{"title": "City of Joy", "film_link": "/Movie Scripts/City of Joy Script.html", "script_link": "/scripts/City-of-Joy.html", "info_raw": "\n\nCity of Joy Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gerald Brach  Roland Joffe\nGenres  Drama\nScript Date : October 1990\n\nRead \"City of Joy\" Script\n\n\n", "script": "\n City of Joy\n\n        Written by\nGERALD BRACH & ROLAND JOFFE\n\n\n       October 1990\n       Early Draft\n\n\n\n\n   FOR EDUCATIONAL\n    PURPOSES ONLY\n\n                       CITY OF JOY\n\nFADE IN:\n\nTITLE SEQUENCE.\nEXT. BIHAR - DAY (DAWN, SUMMER, MID-1980)\nHeat that has mass. That rises off the parched earth in\nshimmering waves. After a moment, we see what appear to\nbe figures coming out of the haze, one by one. A family\nwith their few belongings: HASARI PAL, 33, his wife,\nALOKA, 28, and their children, daughter, AMRITA, 13,\nsons MANOOJ and SHAMBU, 11 and 9; HASARI'S MOTHER and\nFATHER. They embark toward the night, the rising sun\nbehind them.\n\n\nEXT. ROADSIDE - BUS STOP - DAY (DAWN)\nHasari's Father passes a gourd of precious water. Hasari\nserves the children first. Shambu gulps entirely too\nmuch, the others forcing him to stop by a unified force\nof will. Embarrassed, he passes the cup to his brother,\nwho sips, as does his sister. Aloka barely wets her\nlips, insisting on leaving the last drops for Hasari.\nAnd now, a rooster tail of dust rises up behind the\napproaching bus and the old parents bid farewell to their\nson's family. There is an intense sadness at leaving\nthe land and Hasari's Mother clings to him...\n                         HASARI\n           I'll send money soon.\nHis Mother nods, as Hasari erupts in a small cough which,\nby habit, he suppresses. His Mother crushes Aloka to\nher.\n                         HASARI'S MOTHER\n           Don't let the children out of your\n           sight. Not for a moment.\nNow the children. She wants to keep them here even as\nthe old man touches her, reminding her she must let them\ngo.\n                         HASARI'S MOTHER\n           Help your parents. Don't fight\n           with each other. And, Manooj,\n           stay away from the cinema, do you\n           hear?\nShambu, his eyes big as saucers, whispers to his\ngrandma...\n                                            (CONTINUED)\n\n                                                      2.\nCONTINUED:\n                         SHAMBU\n           I don't want to go. There are bad\n           men with long knives who steal\n           children.\nThat does it: Hasari's   Mother dissolves in tears, but\nthe old man nevertheless  unlooses her insistently from\nthe children. Aloka and   the children get on the bus as\nthe old man embraces his  son.\n                         HASARI'S FATHER\n           A man's journey to the end of his\n           obligations is a very long road.\n           Yours begins here.\n\n\nEXT. ROADSIDE/INT. BUS - DAY\nThere's not an empty inch inside the little vehicle or\non top.  The passengers are silent. A woman breast feeds\na baby.  Several passengers fan themselves. Many sleep.\nThe Pals squeeze wearily into the rear seat.\n                         MANOOJ\n                  (to his neighbor)\n           Our farm has died, so we are\n           moving to Calcutta to become rich!\nHasari and Aloka look  at each other: If only it were the\npursuit of wealth and  not survival. The woman under-\nstands. And now the   BUS GRINDS forward and the Pals look\nback. Hasari coughs,   suppresses it... as silence falls.\nThe elder Pals stand huddled   together in the dust and we\nsee, nestled behind a boulder   at the roadside, a tiny,\nblue flower -- beautiful and   fragile, but like all things\nalive, determined to live...   and we hear the sound of a\nDOZEN VOICES CHANTING a quiet   mantra in unison as we --\n                                            DISSOLVE TO:\n\nINT. ASHRAM - ANOTHER FLOWER - DAY\nThis flower floats gently in a bowl of water. The TITLES\nEND as we PULL BACK SLOWLY to reveal a dozen Anglos,\nseveral Indians, and one Kenyan seated cross-legged\nbefore an aging Yogi, who's quietly urging the suppli-\ncants to find \"their light, allow your white light to\nfill your spirit's eye.\" Above, ceiling fans move the\nair.\n                                            (CONTINUED)\n\n                                                    3.\nCONTINUED:\nAs we PAN the group, we see that everyone has his/her\neyes closed in earnest meditation... until we COME TO an\nAmerican, MAX LOEB, 29, who pops open first his right eye\n-- looks to his right and left -- closes his right eye\nand opens his left eye -- looks left and right... and\nthen, instead of continuing the mantra and the search for\nhis white light, expels a stream of air through his\npursed lips, making a vibrating, flatulent sound, one\nindicative of sizeable frustration and dismissal.\n                         MAX\n         Get serious.\nAround him, other single eyes pop open, searching for the\nsource of this unmeditative sound. Max nods and smiles\na wry smile as if to say: This just ain't doin' it for\nme, folks.\n\nINT. SPARTAN ROOM - TRUMPET - DAY\nMax closes the trumpet case and starts chucking his\nclothes and books in a knapsack and a small valise. We\nnotice the Hebrew letter chai on a gold chain around his\nneck. His girl friend, BETSY KAHN, overdressed somewhat\nin an Indian style, endeavors to exercise the inner peace\nshe's been pursuing...\n                       BETSY\n         I swear to God, you never give\n         anything enough time! What did\n         you expect in five days, Max?\n                          MAX\n         Only what    they promise in the\n         brochure:     Inner peace, serenity,\n         and a nice    chant that gets rid of\n         this rock    in my gut. E.S.T., they\n         do you in    a weekend.\n                       BETSY\n         I would really appreciate it if\n         you wouldn't be terribly glib just\n         now, Max.\nThat's okay with Max, who's willing to eschew communica-\ntion of all kinds and just finish heaving his stuff in\nthe valise.\n                       BETSY\n         Am I to assume you'll be at the\n         airport in Calcutta a week from\n         tomorrow?\n                                           (CONTINUED)\n\n                                                     4.\nCONTINUED:\n                       MAX\n         Impossible to predict, Betsy Ilene\n         Kahn. Maybe you better give me my\n         ticket.\n                       BETSY\n         Screw you, Max -- I paid for it!\n         How many times am I going to let\n         you walk out on me and come back?\n                       MAX\n         I think only you can answer that,\n         Betsy Ilene Kahn.\nShe slaps him.\n\n                       MAX\n         Do you really think that's an\n         appropriate way to get rid of your\n         Western rage, Bets?\nShe swings at him again.   He catches her hand hard in his\nfist.\n                       MAX\n         One slap is romantic. Two would\n         call for retaliation... Lend me a\n         hundred dollars.\nShe yanks free, begins to chant her mantra as he grabs\nhis knapsack and valise and goes out the door.  Now,\nshe's silent and, in the simplest sense, deeply hurt.\nShe can't help herself; she cares. We STAY WITH  her\na moment as we --\n                                           DISSOLVE TO:\n\n\nEXT. COUNTRY AIRPORT (ASSAM) - WINDING ROAD - DAY\nCool, lush hills. A little pack of single-engine two-\nand four-seaters. Max, in shorts and University of\nMiami T-shirt, hot, sweaty, appears around a bend in the\napproach road.\n\nINT. AIRPORT - WAITING ROOM\nA small service desk. A CLERK, who doubles as Ground\nControl on the microphone, passing on the prevailing wind\nand the active runway. We hear the STATIC-BACKED VOICE\nof a PILOT, giving his call numbers, then announcing\nhe's clear for immediate takeoff on the active runway.\nThe Clerk CLICKS off and finds Max.\n                                           (CONTINUED)\n\n                                                    5.\nCONTINUED:\n                       MAX\n         How you doin'?\nThe Clerk gives Max a warm smile.\n                       CLERK\n         Hello.\n                       MAX\n         I've always wanted to walk into a\n         little airport just about like\n         this one and ask the guy at the\n         counter the following question.\n         Ready?\n\nThe Clerk nods; he's at Max's ervice.\n                       MAX\n         When's the next flight to anywhere?\n                       CLERK\n         To Bombay. Tomorrow, at one\n         o'clock in the afternoon.\nA beat --- the Clerk with his smile, Max with his, one\nsimply warm, the other giving off simmering heat.\n\nEXT. AIRPORT - LOW ANGLE - DAY\nMax sits on the ground, up against the building, playing\na jazz line quietly and rather well on his trumpet. A\npair of well-shod feet ENTER the FRAME. Max looks up.\n\nANOTHER ANGLE\n\nThe rubicund face of VEEJAY CHATTERGEE, 50, and more\nBritish than Churchill. Behind him, his cherubic wife,\nRAVI... and making her way toward the enclave of small\nplanes, their daughter, MANUBAI, 26.\n                       VEEJAY\n         I say, are you looking for a way\n         out of here? We have an extra\n         seat. Where are you wanting to\n         go?\nMax's eyes flick from Veejay to the back view of Manubai\nas she continues on and back to Veejay.\n                       MAX\n         I'm wanting to go wherever you're\n         wanting to take me.\n\n                                                        6.\nINT. 180 FOUR-SEATER - DAY\nMax is crammed into the back seat with the plump Ravi.\n\nANOTHER ANGLE\nWe see now that, contrary to our assumption that Veejay\nwould be in the left seat, it's Manubai who's flying the\nplane. The NOISE of the ENGINE forces them to speak\nsomewhat loudly.\n                       VEEJAY\n         We were among the fortunate back\n         in '48.  We got out of East Bengal\n         before partition destroyed so many.\n         We make mattresses. The Rajah\n         Double Spring.\nVeejay has an old flask out.\n                       VEEJAY\n         We don't have a flight attendant\n         on this flight...\n                (passing the flask)\n         Are you a musician, Mr. Loeb?\n                       MAX\n         Unattached trumpet player and\n         recently-certified associate guru.\nAs he takes a hit   on   the flask, Max's eye focuses on the\nlittle mirror on   the   dash. In it he can see Manubai's\neyes. If we  were   to   judge by what he sees in them, she\ndoesn't find him   the   least bit amusing. He smiles his\nsmile at her.\n\n\nEXT. HOWRAH STATION (CALCUTTA) - DAY (EARLY MORNING)\nA huge bridge dominates the skyline. The train     trundles\nto a stop, its WHISTLE clearing the way. People     hang on\nits sides, sit on the roof... and now flood the    platform,\nflowing into the station, clearing a view for us    of the\nPals, clinging to their baggage in the middle of    this\nhuman anthill.\n\nCLOSE ON THEM (MOVING)\nHands reach out with sweets to sell, with tea, asking for\nmoney.\n                       MANOOJ\n         Daddy, I'm scared.\n                                              (CONTINUED)\n\n                                                       7.\nCONTINUED:\n                       HASARI\n         Scared? No -- why? This is very\n         exciting. As soon as we get to\n         our friend's house, everything\n         will be fine.\nBut, despite Hasari's charade of confidence, they (and\nwe) are overwhelmed by the size of the station and the\ndesperate energy of the humanity around them. As they\npress on, a small beggar woman huddled on the platform\nturns her eyes eerily on Manooj... as a deformed hand\nstretches INTO the FRAME. Aloka senses someone: A\nbeggar, face half-hidden and eaten away by leprosy. This\nterrifying image presses the boys tightly to their\nmother and moves Hasari to encircle Armita with one hand\nand attempt to wrap the other three inside the embrace of\nhis other hand. It does not seem possible that he can\nprotect all of them against the predatory eyes watching\nthem. He moves them quickly to a wall...\n                       HASARI\n         Wait right here. Don't move.\n\nWITH HASARI\nHe moves to a line of VENDORS, shows a piece of paper to\none, as he digs out his precious screw of money to make a\npurchase of sweets from the Vendor.\n                       HASARI\n         Please, can you direct me to my\n         friend at this address? We are\n         to stay with him.\nThe Vendor gives the address a look, shows it to the\nVendor next to him. Both look at Hasari.\n                       VENDOR #1\n         There's no such address as this in\n         Calcutta.\n                       HASARI\n         But that's not possible.\n                          VENDOR #1\n         Of course    it is possible! I have\n         lived here    all my life. You are\n         new. Who     would know if a place\n         exists or    does not?\n                       VENDOR #2\n         Bombay, perhaps. Delhi.     Look\n         there.\n                                            (CONTINUED)\n\n                                                       8.\nCONTINUED:\nDear God, what now? Stunned, Hasari hands Vendor #1 a\nrupee and, with the sweets, turns back to his family, his\nface going through a magical transformation as he\nprepares to suggest to the family that all is well.\n\nEXT. CHOWRINGHEE LANE - DAY (MIDDAY SUN)\nA few clean and cared-for Ambassador cars sweep into the\ngateway of the Grand Hotel, past a gateman.\n                                           RACK FOCUS TO:\n\nFEET - MAIDAN\n\nFeet tramping the pulsating tarmac, sending up dust.\n\nANOTHER ANGLE\nThe Pals, scared, dispirited, weary, consumed by the\ncrowd. They've been walking a long  time. Shambu cries;\nAloka tries to ease his fear. They  stop numbly at the\nedge of the park, put their bundles down against a long\nwall.\nAcross the way, a thin policeman shares a cigarette with\na group of traders. There is a deeply fearful look in\nHasari's eyes, a look he is having difficulty controlling\nnow. He needs to revive the family's confidence. He\ntakes out his precious bundle of rupees and gives one to\nManooj. Manooj, though, is fixed on the cinema across\nthe street. Hasari indicates a stall just across the\nmain road.\n\n                       HASARI\n         Manooj, go and get some fruit.\n         Come straight back.\nDelighted with his task, Manooj sets off, his eyes on the\nmarquee of the theater with its huge cardboard cutout of\nKumar Kapur, starring in Hot Gun. Hasari calls out to\nhim to watch where he's going; the mere crossing of the\nstreet is a potential parental nightmare. A hand ruffles\nManooj's head and a TALL MAN with dark eyes and a sweet\nsmile comes at the boy's anxious parents.\n                       GANGOOLY (TALL MAN)\n         Yes, hello, brother. Bihar, am I\n         correct?\n                       HASARI\n         Yes, how did you know?\n                                           (CONTINUED)\n\n                                                     9.\nCONTINUED:\nHasari is torn between speaking to the man and watching\nhis son's incredible journey across the street.\n                       GANGOOLY\n         Let me say only that the terrible\n         malevolence that has visited your\n         part of the country affects us all.\n                       HASARI\n         Three years without rain. Nothing\n         came out of the earth but debts.\n                       GANGOOLY\n         Terrible. And now, the    family on\n         the street. It is not    acceptable.\n                (smile widens)\n         And if I can't help, my   name is not\n         Mr. Gangooly... Which,   blessedly,\n         it is.\nAnd now a smile as full as the sky above.\n\nEXT. SMALL BUILDING IN BACK STREET - DAY\nA brick slides out of the wall.\nWe're BEHIND the brick and see Gangooly's soft face as he\nreaches in and pulls out a key.\nThe street is small and empty.  Though the houses are\nnothing much, to the Pals, they look like palaces.\nManooj and Shambu run about in delight. Gangooly motions\nfor quiet. With a flourish, he  opens the door.\n\n\nINT. SMALL ROOM - DAY\nGangooly enters, glances around, waves the Pals in.\nThey're amazed. There's a cage occupied by two parrots.\nIn one corner, a small altar dedicated to the goddess\nLakshmi is decorated with some flowers and, behind a\ntorn, plastic curtain in a corner, part kitchen, part\nwash place, containing a tap with running water.\n                       GANGOOLY\n         Be free -- look around.\nOn the faces of the family is one thought: Is it\npossible? Amrita goes right to the parrots.\n                       GANGOOLY\n         They'll need feeding. Give them\n         seed. But don't spoil them.\n                                            (CONTINUED)\n\n                                                      10.\nCONTINUED:\nHe bows briefly before the altar as he moves to the\nwashing area.\n                       GANGOOLY\n         And now, one of the miracles of\n         life in the city. One and two...\nHe turns on the tap and a stream of brown WATER GURGLES\nout. The Pals are hypnotized, the fists around their\nhearts begin to ease.\n                       GANGOOLY\n         Holy water from the Ganges! Flows\n         out forever. Come -- touch it.\n\nManooj and Shambu put their hands under the tap.\n                       GANGOOLY\n         Drink! It's as pure as the dew on\n         Shiva's lips.\nThey drink. Gangooly claps in delight... and beckons\nHasari aside.\n\nFAVORING GANGOOLY AND HASARI\n                       GANGOOLY\n         Now, this place is yours for two\n         weeks. My cousin, Moti, is away,\n         traveling. Normally, the rent\n         takes fifty rupees for a week, but\n         for a brother, forty. No, don't\n         thank me.\nHasari pulls out his little screw of money.\n\n                       HASARI\n         I have only seventy-five, but as\n         soon as I have work...\n                       GANGOOLY\n         Give me the fifty, pay the rest\n         next week. You'll find work, I\n         trust you. Aren't I from Bihar,\n         too?  Yes.\nAnd the money is in his hand.   He joins his hands\ntogether.\n                       GANGOOLY\n         You are pleased? Then Mr. Gangooly\n         is pleased. It's how I am.\n                                            (CONTINUED)\n\n                                                       11.\nCONTINUED:\nHe turns on his heel and he's gone. For a moment, the\nPals are still, swept from the brink of catastrophe to\nsalvation... and now, as one, they release their sheer\nand utter joy.\n\nINT. CHATTERGEE STAIRCASE - DAY\nRavi and Veejay leading Max up the grand staircase,\nManubai in the foyer, looking after them.\n\nINT. GUEST ROOM - DAY\nRavi leads the way into a lovely guest bedroom.\n\n                        RAVI\n          I hope this is all right. The\n          room hasn't been aired or the bed\n          turned, but --\n                        VEEJAY\n          Oh, he doesn't care about that, do\n          you, Max? Here, look here.\nVeejay opens a little cupboard, stocked with liquor.\n                        VEEJAY\n          Help yourself. Be comfortable.\n          Ravi, come on, go, go, let's leave\n          the young man to himself.\nObediently, Ravi goes.   Veejay follows.   Max goes to the\nwindow.\n\n\nHIS POV\nThe beautiful Manubai in the garden.\n\nMAX\nHe lies down on the bed.   He's found Nirvana.\n\nINT. MAIN ROOM - DAY\nIt's Hasari who watches now. There's LAUGHTER from Aloka\nand Amrita. Joyful SHOUTS from the boys. Hasari is\nalone in the main room, on his knees, in front of the\npile of their baggage and bundles. He turns his atten-\ntion from the laughter to a just-opened, old suitcase.\nHe takes out a small tea box. Opens it delicately.\n                                            (CONTINUED)\n\n                                                     12.\nCONTINUED:\nIt's full of something brown. He  pushes his fingers in\nand feels this bit of earth with a tenderness that's\nalmost religious, puts a pinch to his nose and breathes\nit in. The LAUGHTER and SHOUTING  from the bathing area\nis GROWING.\n\nINT. BATHING AREA\nShambu is paddling near the tap. Aloka is bending over\nthe drain and Amrita is rinsing her heavy, dark hair\nwith a pot. Manooj is nearby, rubbing himself with an\nold towel. Hasari enters unnoticed and looks at the\ngroup with tenderness... and with gratitude for their\ngood fortune.\n\nA MAN, red with anger, yanks the curtain aside, stares.\nThe family freezes. Aloka's hair drips unnoticed on her\nsari.\n                       MAN\n         What are you doing here?   Who are\n         you?\n                       HASARI\n         My name is Pal, Hasari. Mr.\n         Gangooly rented this space to --\n                       MAN\n         Mr. Who?\n                        HASARI\n         Gangooly.   You must be his cousin,\n         Mr. Moti.\n                       MAN\n         I don't know any Gangooly and my\n         name is Binal and this is my home\n         -- get out!\nThe furious Binal, followed by the Pals, goes into the\nmain part of the room. A small crowd has been attracted\nby the noise.\n                       HASARI\n         But this is true. We paid him a\n         deposit of fifty --\n                       BINAL\n         A man goes out because he has to\n         work, and some beggar tries to\n         move in while his back is turned.\n                                            (CONTINUED)\n\n                                                    13.\nCONTINUED:\nThis while Binal has begun to throw things out onto the\nstreet, though this cleansing of his home doesn't stop\nhim from picking up a stick. The odd sympathizer meets\nwith...\n                       BINAL\n         So, should I suffer if they are\n         so stupid to jump into the first\n         mouth that wants to eat them?\nHe turns with the stick on Hasari.\n                       BINAL\n         You're lucky I don't kill you!\n\nHasari looks at Manooj, who drops his eyes. They collect\nthe remainder of their possessions and hurry out the\ndoor.\n\nEXT. SMALL STREET - DAY\nFull of neighbors. There's a suppressed violence in the\nair. A man pushes Aloka. Sweat streaming down his face,\nHasari confronts the man. A WOMAN pushes the men apart.\n                       WOMAN\n         Go to the river. Try to squeeze\n         in there.\n\nEXT. VICTORIA MONUMENT - STREET - NIGHT (DUSK)\nCalcutta broiling: Buses, vendors, carts, rickshaws,\nchildren beg at car windows. The Pals stand, uncertain,\nand for the first time a rickshaw fills Hasari's eye,\ncarrying two passengers. But now he shoulders his burden\nand leads the family toward the river. We HOLD until\nthey grow small against the setting sun, gleaming red\nagainst the white domes of the Victoria Monument.\n\nINT. CHATTERGEE'S LIBRARY - TORSO - NIGHT\nMoving through the dark, a figure, touching things,\nlooking at photographs of the Chattergees. We hear\na MUFFLED DIALOGUE mixed with the SINGING a la Dean\nMartin of \"Everybody Loves Somebody Sometime\":\n\"Goddamn it, boy, what's the matter with you? --\n\"Everybody loves somebody sometime\" -- \"Go for it,\nson!\" -- \"Sure, Dad, whatever you say, Dad.\" --\n\"Everybody falls in love somehow\" -- \"You're the dad,\nDad.\" Now, a humidor. Max opens it, takes out a\ncigar, takes two. Takes five. Senses someone. Turns.\n\n                                                      14.\nANOTHER ANGLE\nRavi in her bathrobe.\n                         MAX\n         I'm starving.\nHe gives her his best saint's smile.\n                       RAVI\n         Well, you don't want to eat those\n         awful cigars. Come with me, we'll\n         wake up the cook, she'll fix you\n         something proper.\n\nEXT. KITCHEN - WINDOW - NIGHT\n\nTHROUGH the window, we see the bleary-eyed cook laying\nout food as Ravi chatters away at Max, he with a beatific\ngrin on his face as he feeds himself.\n\nEXT. RIVER BANK - HOWRAH BRIDGE - DAY\nThe bridge etched against the dawn sky. The corpse of\nan indigent is collected and put on a cart.\n\nMANOOJ\nWith his eyes open, watching the dead man being removed.\n\nFAMILY\nAfter their humiliating flight, they found refuge here.\nTiny figures huddled together with their baggage and\nbundles, near a tree, not far from the steps that dip\ndown to the smooth water. Hasari's eyes, too, are on\nthe dead man, that warning. He kneels beside Manooj,\nstrokes him. The boy's eyes turns to the man's,\nwondering if the man can provide for them.\n                       HASARI\n         Don't let it frighten you. You\n         have to be brave. I know we'll\n         find work today.\nFear and doubt fill Manooj's eyes.   He nods.\n\nEXT. DOCKS - DAY\nHasari at the gates, the family huddled together in\nthe b.g. The man behind the gate shakes his head,\npoints.\n\n                                                    15.\nANOTHER ANGLE\nA line of a hundred men stretches from a door. Hasari\nis on the edge of panic, but when he turns to the family,\nhe's wearing his confident smile. As before, he gathers\nthe family into the protectorate of his arms and guides\nthem onward. As he pushes off into the sea of humanity,\nwe PULL BACK AND UP, FILLING the FRAME WITH street upon\nstreet, disappearing Hasari.\n\nFROM STREET - INTO WORKSHOP - HASARI AND OWNER\nTwo plump men in shirt sleeves look coolly at Hasari.\nThe elder shakes his head. The younger shows Hasari\nthe door.\n\nOutside, an increasingly desperate Hasari finds\nAloka before a small shrine, saying a prayer.\n\nEXT. BARA BAZAR - DAY\nAloka huddled with Manooj and Amrita. Hasari talking\nto the owner of a small market stall. Shambu is peering\ninto a shop with male mannequins in the window.\n\nINT. MEN'S SHOP - MOVING MIRROR\nIn the moving mirror we see counters and shelves of men's\nclothing.\nThe mirror stops at Max slipping into a kurta before an\naudience of Ravi, Manubai, and a salesman.\n                       RAVI\n         It's not extravagant at all. You\n         can't go around all week in your\n         tribal garb.\nMax sees a boy's face pressed to the glass: he indicates\nthe shirt, for the boy's approval. The boy smiles a\nwonderful smile.\n                       RAVI\n         Now he looks civilized, doesn't\n         he, Manubai?\n                        MANUBAI\n         Almost.\nMax looks at her.   She at him.\n\n                                                      16.\nEXT. MEN'S SHOP - DAY\nMan leans down, whispers to the smiling boy...\n                       MAX\n         You sure I look all right?\nThe little boy nods. Max slips him several rupees...\nand he, Manubai, and Ravi fold themselves into her tiny\ncar as --\n\nANOTHER ANGLE\nShambu runs to his dejected family.\n                      SHAMBU\n         Look! A man gave me these many\n         moneys!\n                      HASARI\n         What man? Why -- did you ask him\n         for money?\n                       SHAMBU\n         He just gave it to me.\n                        HASARI\n         Where is he?\nShambu looks, but the car's gone.\n                       HASARI\n         Don't do that. We're not beggars.\nShambu is devastated. Out of his own desperation,\nHasari feels he's been a little rough on the boy. He\nholds him close.\n\n                       HASARI\n         Go back to the river. Wait for me\n         by the tree. Don't go anywhere.\n         Do you understand?\nAloka, the boys nod. We WATCH them as Hasari heads\noff, quickly becoming a small figure disappearing into\nthe sea.\n\nEXT. JUTE MILL DAY - LATE AFTERNOON SUN\nStarting to sink. We PAN DOWN TO Hasari stepping to\na grilled window as the man ahead moves out.\n\n                                                          17.\nINT. JUTE MILL - DAY\nA flaking gray wall, half-obscured with moldering files.\nThe grilled window lets in a little light and the quiet\nsupplications of those outside.\nAn old CLERK at a desk. A voice calls out.       The Clerk\nlooks up, crosses to the grill.\nHasari's tense face through the bars. A TRUCK RUMBLES\npast, drowning out the words... except these: \"...trade\nunion.\" The Clerk shakes his head sadly. On the verge\nof panic, Hasari hangs onto the window...\n                       CLERK\n         Do you have family?\n\n                       HASARI\n         Yes, yes of course. But I'm\n         three days without work. I'll\n         take anything.\nThe Clerk digs in his pocket, presses two rupees on\nHasari.\n                       CLERK\n         Here, now go away.\n                       HASARI\n         No, I don't want you to give me --\nThe next man in line forcibly moves Hasari out of the\nway.\n                       CLERK\n         In this city, a man with a family\n         can't be proud. Take it!\n\nThe Clerk waves him away, turns his attention to the\nnext man.\n\nINT. CHATTERGEE RECEPTION ROOM - DAY (LATE AFTERNOON)\nManubai's face.   Then Max's.   Then hers.    Then his.\nLooking at each other.   Five days.   Kiss.    Ravi.\n                       MAX\n         I said you have three days to\n         get me into bed, and I'm betting\n         you can't do it.\n                                              (CONTINUED)\n\n                                                       18.\nCONTINUED:\n                       MANUBAI\n         It's all right for you to use my\n         mother as your tour guide and\n         meal ticket, because she'll get\n         something nice out of it. But\n         what would I get?\nHe stares at her a moment, then gets up, goes around the\ntable.\n                          MAX\n         Well, gee,    I don't know. Maybe I\n         could say    something so amusing\n         that you'd    laugh so hard it would\n         break that    hot poker you have up\n         your ass.\nShe stares at him. He bends to kiss her. She doesn't\npull away... but after a moment he realizes she isn't\nresponding. He continues the kiss, but he opens his\neyes... to find her staring at him. He pulls back.\nThey stare at each other another moment, then Max\nsenses someone in the doorway.\n\nRAVI\nStaring at them, disappointment filling her eyes.\n\nMAX\nThe same sound of frustration and ennui he made in the\nashram.\n\n\nEXT. CHATTERGEE HOME - DAY\nHis arm around Max, Veejay guides the young man toward\na waiting taxi.\n                       VEEJAY\n         Believe me, I understand, but you\n         know how women are. Do you have\n         enough money?\nMax gives him a non-commital shrug.    Veejay winks,\nstuffs the money into Max's pocket.\n\nEXT. GREEN ACRES COURTYARD - COW - DAY (LATE AFTERNOON)\nBare feet... and then sneakered feet step over the sleep-\ning bovine, who turns a disinterested eye up.\n\n                                                        19.\nANOTHER ANGLE\nMax is guided by a grumpy hall PORTER wearing an off-\nwhite shirt and bellbottoms through the walled and well\nplanted courtyard of an inexpensive hotel. Max gives the\ncow a bemused eye...\n\nINT. HOTEL ROOM - DAY\nThe room is utterly utilitarian. The Porter turns on a\nceiling fan, sending an army of cockroaches scurrying\nfor calmer terrain. Max clearly doesn't care for\ncockroaches.\n                        PORTER\n          It pleases you?\n\n                        MAX\n          No fruit basket? No mini bar?\nMax hands the Porter several rupees.\n                        PORTER\n          Bar? Of course -- many, many.\n          But make care, Sahib. Please,\n          for me. If it is lady you like\n          to know -- yes? -- you let me.\n          Huh? Very sweet girl, good\n          nature, very sweet. Or boy, very\n          good...\nMax puts a finger on the Porter's head, turns him for\nthe door.\n                        PORTER\n          No like boy? Something then for\n          smoke -- mmmh, very good for smoke!\n\n\nAT DOOR\nMax eases the Porter out.   As the door is closing...\n                        PORTER\n          Maybe you like two girls -- look\n          a little Chinese, but very great\n          pleasure.\nMax smiles his smile and disappears the Porter behind the\nclosed door. The smile disappears and the FAN gets his\nattention; it has an annoying rhythm and sound. He\nflicks the switch, but the fan continues to snap around.\n                                             (CONTINUED)\n\n                                                       20.\nCONTINUED:\nHe stares at it... and startles us by suddenly flicking\nout a hand and grabbing the blade, stopping the fan.\nHe lets go. The fan is still. He carries his knapsack\nto the tub; it has brown stains along the middle and\nthe water has a brown tinge as it flows out of the tap.\nHe sits on the edge of the tub, dumps his knapsack on\nthe floor, picks up a half-dozen pamphlets from the\nashram.\n\nCLOSE ON PAMPHLETS\nGuides to inner peace.\n\n\nRESUME\nHe wings the pamphlets at the trashcan.\n\nEXT. RIVERBANK - HOWRAH BRIDGE - DAY (EARLY EVENING)\nHasari comes around the corner of a warehouse, a smile\non his face, clutching some bananas and dried grain.\nHis relief -- and ours -- is short-lived.\n\nTREE AND BANK\nThe space where he left the family has been cleared\nand taken over by trucks. He's lost his family.\n\nHOWRAH BRIDGE ROAD\nA group of Hindus are   celebrating a puja, the women\nsinging canticles at   the top of their lungs; the men\ntossing a little boy   happily back and forth... as the\npanic-stricken Hasari   rushes up.\n                       HASARI\n         My wife, my children...\nHasari rushes on.    Suddenly we --\n                                            CUT TO:\n\nUNDER BRIDGE - DAY\nHis head turns and his eyes look this way, that way...\nuntil out of the near silence, we hear a distant,\nextraordinary word...\n                                            (CONTINUED)\n\n                                                      21.\nCONTINUED:\n                       CHILD (O.S.)\n         Daaaaaaddddddyyyyy!\nThe word catches Hasari's ear. He looks into the sea\nof people along the river bank under the bridge.\n                       CHILD (O.S.)\n         Daaaaaadddddddyyyy!\nAs in a dream, Shambu rises up out of the sea of bodies\n... and runs to his father.\n                       SHAMBU\n         Daaaaadddddyyyy!\n\nNow, Aloka, Amrita, Manooj appear, rising up out of the\nsea, ending Hasari's nightmare.\nA warrior returning from battle, Hasari engulfs the\nlittle boy.\n                       HASARI\n         I told you to remain where I left\n         you! I told you to stay there!\n                       MANOOJ\n         The police came!\n                       SHAMBU\n         We said we had to meet you, but\n         they didn't care! They were\n         mean!\nAs before, Hasari tries to engulf the rest of his family\nin the protectorate of his arms. In the b.g., Arun and\nhis family.\n\n                       ALOKA\n         These friends have found space.\n         They will share with us.\nHasari looks at the tiny space. The roof is cardboard\nand cloth and half an old movie poster featuring the\nactor Kumar Kapur. Hasari looks at his tiny bit of\nfood, debates a moment... then puts his hands together,\naddresses these generous people.\n                       HASARI\n         I would be proud if you would\n         share our food with us.\nEveryone looks at the food; there is no disguising their\nhunger.\n\n                                                       22.\nEXT. BRIDGE - NIGHT\nDistant transistor MUSIC as we PAN DOWN: The Pal\nchildren sleep despite the QUIET MOANS and nightmare\nCRIES around them, the two boys huddled together, Amrita\nclose to her mother.\nHasari comes out of the dark. Aloka looks at him. He\nshakes his head. He slumps beside her. Aloka strokes\nHasari, looking lovingly at him.\n                       ALOKA\n         I remember the first time I saw\n         you, on the day of our marriage.\n         Wearing a bright yellow turban.\n         You asked me my name and you said,\n         'You are a very beautiful girl\n         and I am wondering whether you\n         will find me appealing.'\nHe strokes her tenderly in return... but now, overwhelmed\nwith despair, she begins to weep.\n                       HASARI\n         What?\nShe doesn't want to say it, doesn't want to wake the\nchildren.\n                       HASARI\n         It's all right -- what?\n                       ALOKA\n         I miss the village.    There I\n         could help.\nHasari pulls Aloka close, strokes her.\n\n\nEXT. GREEN ACRES - NIGHT\nThe sky turns red. The Porter looks up, shakes his head:\nPoor young man, stuck with only a trumpet for company.\n\nINT. MAX'S ROOM\nMax sits on the floor in a corner and plays as we hear\nthe sound of a fierce WHISTLE and a SCREAMING ENGINE.\n\nEXT. SETTLEMENT - CLOSE ON BULLDOZER - DAWN\nA gigantic earthmover lurches into position.\n\n                                                     23.\nANOTHER ANGLE\nSwarming police.\n\nPALS\nAwaken -- startled, disoriented. Aloka gentles the\nchildren as Hasari moves instinctively toward the threat.\n\nSCENE\nA black ambassadorial car pulls up, out of which steps\na BABU. A microphone and speaker has been set up.\nAnother car unloads several politicos with party banners.\nA minion hands the Babu the mike; he wants to get on with\nit before this turns into a political rally. Hasari is\nclose to him, as is Arun.\n                       BABU\n         The municipality has directed us\n         to carry out the destruction of\n         this settlement. All of you must\n         go -- now!\nFor a moment there is a babble of fear and frustration.\nThen from Hasari's side, Arun confronts the Babu.\n                       ARUN\n         For what reason?\nThe Babue appears disconcerted.   He's not accustomed to\nthe poor asking questions.\n                       BABU\n         Because this settlement is\n         impeding construction work.\n\n                       ARUN\n         We're not moving! Why should\n         we move? Who is the municipality?\n         We are! This is our home!\n                       BABU\n         I have my orders.\n                       ARUN\n         If we're driven from here, where\n         should we go?\n                       BABU\n         I'll give you five minutes to\n         gather your things. Then, the\n         settlement comes down.\n                                            (CONTINUED)\n\n                                                     24.\nCONTINUED:\n                       ARUN\n         Why should you alone be burdened\n         with such a task? Let me help!\nArun begins to tear his shelter apart, and to heave the\npieces at the Babu, who retreats. Others soon take up\nthe call to vent their frustration, hurling things at\nthe police and at the driver of the tractor. Quickly\nwe've got a full-scale riot. The police wade into the\ncrowd, pounding people with their sticks, Arun one of\nthe first to get hit. He staggers into Hasari's arms.\n\nFAVORING PALS/ARUN AND HIS FAMILY\n\nUnbelievable! Panic-stricken, Hasari and Aloka gather\nthe children and their few belongings... as beside them\na woman goes down from a stick to the head; Aloka stops\ninstinctively to help the woman, but Hasari grabs her,\ntrying to shelter her and the children as well as Arun's\nwife and children, clutching Arun to him as in the chaos\nthey manage to escape.\n\nEXT. CHURCH - CLOSE ON BILLBOARD - DAY\nOn the billboard: A maharajah sleeping snugly on a thick\nmattress. From his dreamland he inquires solicitously:\n\"Have you ever thought of a Rajah Double Spring as a\npresent?\" We PAN DOWN and FIND the Pals and Arun and his\nfamily, panting, terrified, beneath the sign.\n                       SHAMBU\n         Daddy, are we going to die here?\nHasari can see on everyone's face this question.\n\n                       HASARI\n         No! Today, I'm just a mangy dog\n         on the street, but soon, I swear,\n         I'll look other men in the eye!\n                (a beat)\n         I swear.\nYet on his face we see the extraordinary pressure to make\nthis promise reality.\n\nEXT. SIDE OF RESTAURANT\nHasari reaches the head of a line and receives a small\nhandout. Turning away, he  studies the morsel of food.\nHis head aches, his belly screams with hunger... but he\ntakes only a single bite, then carefully wraps the rest\nin a cloth and knots it.\n                                            (CONTINUED)\n\n                                                       25.\nCONTINUED:\nHe feels a tug at his elbow.   It's a 15-year-old BOY with\nthick, scholarly spectacles.\n                         RAFIK (BOY)\n           Why live like a beggar when you\n           can live like a maharajah?\nHasari stares at the boy.\n\nINT. BLOOD DISPENSARY - CLOSE ON HASARI'S ARM - DAY\nA needle injected, blood flowing into a bottle.\n\n\nANOTHER ANGLE\nHasari seated on a stool, watching his blood leave his\nbody, his face broken out in perspiration.\n                         HASARI\n           I thought you were only taking a\n           little.\n                         ATTENDANT\n           We pay more, we take more.\n                         HASARI\n           I'm feeling a little dizzy.\n                         ATTENDANT\n           It'll pass.\n\nHIS POV\n\nRafik and a thin man chatting easily and exchanging ciga-\nrettes with another attendant. His vision BLURS.\n\nHASARI AND NURSE\nWith his free hand, he begins to grapple for the Atten-\ndant to keep his balance, starts to fall... and the\nSCREEN GOES BLACK.\nFADE IN:\nEXT. DISPENSARY - DAY\nA woozy Hasari gives Rafik his share; Rafik in turn gives\nthe thin man his share. The thin man bows his farewell.\n                                              (CONTINUED)\n\n                                                      26.\nCONTINUED:\n                       RAFIK\n         Blood is the oil well of the poor,\n         brother. Now, give me another\n         three and I'll give you these.\nHe opens his hand with its dirty nails. In it lie a\nlittle group of pills, like highly-colored sweets.\n                       HASARI\n         What are those?\n                       RAFIK\n         Vitamins. Take these and you can\n         give again in a week.\n\nWhile Hasari considers, Rafik pours the pills into\nHasari's hand, takes the three rupees. Hasari downs the\npills.\n                        RAFIK\n         One week.   Here. The same time.\nAnd he's gone, leaving Hasari, woozy but at least, for\nthe moment, blessed to count his money.\n\nINT. MAX'S ROOM - NIGHT\nMax lies on his messed bed, contorted, with his feet up\nover his head against the wall. A book lies open beside\nhim. A half-eaten room service meal, many hours old,\nmoulders on the bedside table. Max is babbling a mock\nsports case into his fist...\n                       MAX\n         They're in the shotgun. There's\n         the snap from center, the clock is\n         running -- five, four, three -- he\n         has an open man at the Notre Dame\n         twenty for the victory... and he\n         freezes. He freezes! Mr. Choke\n         chokes. The fans go --\nA KNOCK at the door. Max shuts up, falls off the wall.\nHe crosses to the door. Opens it. POOMINA is 16,\nbeautiful and exotic-looking behind her excessive makeup.\n\nANOTHER ANGLE - FAVORING MAX\nThe porter pushes the girl gently into the room, smiling\nat Max, nodding. The door is closed.\n\n                                                      27.\nMAX AND POOMINA\nHe may have been receptive to a \"sweet, young girl,\" but\nnot a kid in her teens.\n                       MAX\n         Got an I.D. on you?\n                (she doesn't get it)\n         How old are you?\n                       POOMINA\n         Twenty, sahib.\n                         MAX\n         I buy that.\nShe approaches him seductively.\n\n                       POOMINA\n         I can do anything you want, sahib.\nShe fingers the   Hebrew letter at Max's throat, on its\ngold chain. For    a moment, Max is mesmerized by this\nchild; but then,   as she begins more serious ministra-\ntions, he pulls   back.\n                       MAX\n         Hold it, time out. Time, there's\n         time out on the field.\n                       POOMINA\n         Is problems, sahib?\n                       MAX\n         Is problems, yeah, just a couple.\n                       POOMINA\n         No, please, yes, I can --\n\nThere's something desperate in her that makes him put a\nfinger to her lips and say...\n                       MAX\n         How 'bout some chow?\n                (she doesn't get it)\n         I was just about to order some room\n         service. Food. I call, they come,\n         we eat.\nShe stares at him.\nINT. MAX'S ROOM - NIGHT (HALF HOUR LATER)\nMax smokes a Monte  Cristo and watches Poomina, like a\nfrightened little  animal, devour the last of a Green\nAcres room service  meal and then wrap a small piece of\nfish in the paper  napkin.\n                                            (CONTINUED)\n\n                                                      28.\nCONTINUED:\nShe looks up at him, delivers a small burp.    Covers her\nmouth in charming embarrassment.\n                       POOMINA\n         Now, you are ready for great\n         pleasure, yes?\n                       MAX\n         Watching you eat was my great\n         pleasure. Now you go home.\nAs he escorts her toward the door, Poomina is distressed.\nMax realizes she can't leave empty-handed. He pulls out\nsome notes.\n\n                         MAX\n         For you.\nShe hasn't given up, though, and as he takes the money,\nshe stands on tiptoe and kisses him. Torn, Max begins\nto respond. He stops  himself, his grip on her causing\nher discomfort. His  breath comes in little bursts.\n                       MAX\n         You're a very wet kisser. Work on\n         it, get in touch in five years.\nHe leads her toward the door. Like some lunatic comedy.\nshe resists. He pushes. She locks her knees. He opens\nthe door.\n                       MAX\n         Goddamn it, cut it out!   Now, good\n         night.\nHe muscles her out the  door, closes it, wipes his lips.\nHe stares at a parade  of cockroaches gliding along the\nwall as he listens to  her CRYING quietly on the other\nside of the door. He   debates... and he loses. Opens the\ndoor. Poomina stands   there; the tears stop and a lip-\ntwitching smile lights  her face.\n                       MAX\n         Five years already? Gee, time\n         really flies when you have no\n         moral conviction.\nShe slides into his arms, pressing against him. With his\nshoulder, he closes the door, leaving us outside.\n\nINT. BACK ALLEY - BAR - FLAMING LIGHT - NIGHT\nA bare light bulb; a SCRATCHY vinyl RECORD on a turn-\ntable.\n                                           (CONTINUED)\n\n                                                      29.\nCONTINUED:\nPoomina watches Max do a sleight-of-hand trick with a\ncoin. He tosses it up, brings his hands past each other,\nthen holds out his fists; she picks on... but the other\nholds the penny. Fooled, she laughs. He does it again;\nshe points to one fist -- empty -- then other -- also\nempty. Max reaches behind her ear and... produces the\ncoin. She loves it, her laughter escalating. But then\nshe seesm to read something in the b.g. where we see four\nthugs, two of whom will become known to us as THE GOONDA,\na capo to the local \"mafia\" chieftan, and ASHOKA, son of\nthe local Godfather. Ashoka works on a pimple on his\nchin. The Goonda meticulously cleans a spot of mud with\nspit from one of his expensive new running shoes. Max\neyes the thugs eyeing him.\n\n                        MAX\n         Short guys!   Quit lookin' at us!\nThis remark goes over big with the thugs. Max doesn't\ncare. He knocks off the last of the beer in his bottle.\nThe bartender brings them two shots of something in two\nunmatched glasses.\n                       POOMINA\n         Special drink for you, sahib.\n         Only the most man can drink it.\n         You make try. For me.\n                       MAX\n         For you, I would drink battery\n         acid.\n                       POOMINA\n         Who that finish first.   I bet!\nShe puts her glass to her lips and, in a childish,\nexaggerated way, mimes waiting for him to commence a\ndrinking race with her. The two of them toss off what's\nin their glasses. The bangla in Max's glass is stronger\nthan battery acid. He does an elaborate routine involv-\ning the pain, the surprise, the sheer awfulness of the\ndrink. But puts it down with mock machismo.\n                       POOMINA\n         I beat!\n                       MAX\n         I really don't think so -- oh no,\n         nay, nay! I never lose the truly\n         irrelevant contest.\n                       POOMINA\n         We have fun some more.   I bet\n         again!\n                                             (CONTINUED)\n\n                                                     30.\nCONTINUED:\nShe turns to the bartender, calls for two more. All the\nwhile, in the b.g., The Goonda and his two thugs watch\nemotionlessly and Ashoka works on his acne.\n\nEXT. BAR - NIGHT\nMax sings \"Take It to the Limit\" with enormous inebriated\nsincerity as Poomina helps him out of the bar. There's a\nbig black motorcycle parked outside. Max glances at it\nas they start down the alley. As he looks back to the\nroad ahead, he finds The Goonda in front of him. Max\nisn't so drunk that he doesn't sense what this is about.\nHe looks behind him. Indeed, the other two goons are\nthere. Ashoka straddles the big cycle.\n\n                        MAX\n           Well well. Seek punishment and ye\n           shall find.\nKnowing what's  coming, Max nevertheless unleashes a\nbeautiful howl  and tries to trample The Goonda off-\ntackle. From   behind, he's hit with a length of stick.\nHe goes down,  looks up through blasted eyes at Ashoka as\ntwo sticks now  land against his shoulder and his head...\n\nEXT. MAHARAJAH SIGN - NIGHT\nThe Pals sleep beneath the sign. Hasari awakens from\nrestive sleep to the sound of a FIGHT. He gets up. The\nothers awaken.\n                         ARUN\n           Don't go -- what are you doing?\n\n                         HASARI\n           It sounds like someone needs help.\nHasari bolts for the corner.\n\nALLEYWAY\nAs Hasari turns into the head of the alley, he can see\nthree men beating someone, a fourth man standing off to\nthe side, watching.\n                         HASARI\n           What are you doing?\n                  (calling back)\n           A man's being beaten here!\nAs Hasari runs down the alley, the MOTORCYCLE FIRES UP\nand SCREAMS OFF and the three goons take flight.\n\n                                                      31.\nHASARI AND MAX\nHasari runs up, reaches out to Max, who's barely on his\nfeet. As Hasari touches Max, Max turns and belts Hasari\nin the nose, nailing Hasari to the wall as Max collapses\nat Hasari's feet. Hasari grabs his nose with one hand\nand kneels beside the fallen Max... as a shadow moves\nand startles Hasari. He peers into the dark... and\nPoomina steps into the light.\n\nINT. CLINIC/SCHOOL (CITY OF JOY) - MAX'S POV - CRUCIFIX\n- DAY\nThe crucifix sways. Now Max's eyes RACK FOCUS TO the\ncherubic face of JOAN BETHAL, peering AT the CAMERA\nwithout sympathy.\n\n\nANOTHER ANGLE\nMax on a cot in a tiny, spare room, a butterfly bandage\nunder one eye. Joan, Irish, short, stout, hovers over\nhim. Behind her, Hasari Pal.\n                       JOAN\n         Good morning, junior, welcome to\n         our country.\nMax manages to sit up.   Wishes he hadn't.\n                       MAX\n         Oh, I like the way the room moves\n         in circles.\n                (checking out his\n                 accommodations)\n         I suppose I should inquire where I\n         am.\n\n                       JOAN\n         You're in the City of Joy.\n                       MAX\n         Is that geographic or spiritual?\n                       JOAN\n         Oh, now we require that each\n         visitor decide that for himself.\n         This gentleman and a young lady\n         brought you here.\n                       MAX\n         Did I do that to your nose?\n                (as Hasari nods)\n         I'm sorry.\n                                             (CONTINUED)\n\n                                                             32.\nCONTINUED:\nHasari shrugs, smiles... and a gigantic rat drops in\nMax's lap. He leaps to his feet and against the wall.\nThe rat scurries away.\n                         MAX\n           What was that -- a Shetland pony?\n                         JOAN\n           I would have to inspect it more\n           closely, but I believe that was\n           one of our economy-size rats.\nMax clambers for the door.        Too late, Joan thinks to\nsay...\n\n                           JOAN\n           Watch your --\nMax cracks his head on the door frame.\n                         MAX\n           Thanks -- got it.\nHe ducks outside for some air.\n\nEXT. CLINIC/SCHOOL - NIZAMUDHIN LANE - MAX'S FACE\nStunned.\n\nSQUARE\nIn the dawn light, he finds himself in a small square in\na slum, an open sewer running before him. He's repulsed.\n\n                         MAX\n           Pardon the expression, but Jesus\n           H. Christ.\nFrom the tea shop, SURYA, a stout old Hindu man dressed\nin Western clothes, raises a hand in greeting to Joan.\nOn the door Max and Joan have come through: \"City of Joy\nSelf Help School & Clinic.\" Across the way, a young man\nis dandling a baby on his knee, rubbing its back and\nsniffing at its neck. Small group of children around a\nblackboard with a teacher, MARGARETA, doing numbers.\nRAM CHANDAR, the rickshaw puller, readies to go out to\nwork. Trying to orient himself, Max turns...\n\nANOTHER ANGLE\n... to find perhaps fifty people, largely women and\nchildren, staring at him.\n                                           (CONTINUED)\n\n                                                      33.\nCONTINUED:\nHe knows them by type:   patients.   He looks at the sign\non the door.\n                         MAX\n         You a doctor?\n                       JOAN\n         Oh no, I'm a corporate executive.\n         Doctor arrives at half seven, but\n         only three days a week.\n                       MAX\n         This is obviously one of those\n         three days.\n\n                      JOAN\n         Indeed. What brings you to our\n         country?\n                       MAX\n         I came to find my white light.\n                        JOAN\n         Ah, yes.   I take it you didn't\n         find it.\n                       MAX\n         Kept opening the doors and windows\n         of my spirit, but couldn't see a\n         goddamn thing.\n                       JOAN\n         What do you do in America?\nMax is slow to answer.   Discreetly, Hasari hangs back,\nlistens.\n\n                       JOAN\n         Oh, how exciting. Must be\n         something illegal. Are you a\n         criminal of some sort?\n                       MAX\n         I suppose that depends how you\n         define the word: I'm a doctor.\n                       JOAN\n         I see. How long are you here?\n         Perhaps I could recruit you for --\n                       MAX\n         Forget it. You've got your non-\n         practicing Catholics. I'm a non-\n         practicing doctor.\n                                            (CONTINUED)\n\n                                                        34.\nCONTINUED:\n                       JOAN\n         How very distressing.     Why's that?\n                       MAX\n         Found out I just really don't like\n         sick people. Well, I'm outta\n         here. I owe you one.\n                       JOAN\n         I can't imagine ever divining how\n         to collect, but there are a few of\n         us Indians, you know, who believe\n         the tourist trade ought to be\n         encouraged.\n\nMax turns to Hasari. Hasari is incredibly shy, can\nbarely meet Max's eyes.\n                       MAX\n         Thank you very much.     Let me...\nHe goes for his money.\n                         HASARI\n         No, please.\nMax finds his pockets empty. Then reaches for his wrist\n-- his watch is gone -- and then his throat -- his chai\nis gone, too.\n                       JOAN\n         I'm afraid they cleaned you out.\n         Ram, here's your first rider.\n                (to Max)\n         Take this.\n\nShe holds out several rupees toward him.      All eyes on\nthem.\n                       JOAN\n         Go on, it's all right.     You'll owe\n         me two.\n\nEXT. STREET - FLYING FEET - DAY\nMax in the rickshaw, Hasari running alongside Ram, an\nexuberant smile slashed across his face.\n                       HASARI\n         You see, I can keep up.\n                                              (CONTINUED)\n\n                                                    35.\nCONTINUED:\n                       RAM\n         Keep up, of course. Anyone can\n         run at this pace. But you think\n         it's easy to run and to pull?\n                        HASARI\n         I can do it.   I could pull it.\n                       MAX\n         Come on, give him a shot. He's as\n         fast as you and looks twice as\n         strong.\n                       RAM\n         Will you still pay me when he runs\n         you into a ditch?\n                         MAX\n         Absolutely.    I trust the man.\nSuddenly, Ram comes to a stop.\n                       RAM\n         All right, you, come, step in here.\nHasari looks on Max with enormous gratitude. Ram puts\nthe shafts down, has a short coughing fit, spits some\nphlegm, looks at Max.\n                       MAX\n         I hope you're taking something for\n         that.\nRam waves him off as Hasari lifts the shafts to his hips.\n                       RAM\n         Now, fine, pull, go.\nHasari tries to pull, but the center of gravity isn't\neasy to find. This is enormously difficult and Hasari's\nvery clumsy at it. The street is crowded. The traffic\nis beginning to back up behind them. The driver and\nconductor of the tram let fly a tirade of insults.\n                       RAM\n         See, mister! What did I tell\n         you? Come on! What do you think\n         this is -- some village street?\n         You've got to move quickly.\nHe turns to Max.\n                       RAM\n         You see, it takes a gift.\n                                           (CONTINUED)\n\n                                                       36.\nCONTINUED:\n                       MAX\n         I say he can do it. I'll bet you\n         the fare he can do it.\n                (play by play)\n         What do you think, rickshaw fans,\n         can he do it?\nThe crowd isn't in for fun. Hasari strains forward.\nThe rickshaw moves with him. Ram moves alongside,\nshouting instructions and oaths. A cop comes on the run,\nscreaming at Hasai... which makes Ram importune more\nstrongly and Max joke more vociferously.\nEven under this incredible pressue, Hasari gains\nconfidence and begins to move quicker, earning shouts\nof approval from Max and Ram, who now has trouble\nkeeping up as they make their way through the maelstrom,\nan avalanche of oaths following them.\n\nINT. GODFATHER'S HOUSE - DAY\nAt first all we see are feet on a marble floor. The\nGoonda's in his running shoes, then Ram and Hasari's\nbare feet.\nThis is the partitioned splendor of an old house\nsprinkled with the relics of a grand colonial past.\nEverything is baroque, rotting and somehow impressive.\nHasari has never been anywhere like this, and is caught\nbetween curiosity and fear of breathing.\n\nINT. \"THRONE ROOM\"\nThe three men enter a large room shuttered from the sun-\nlight -- dusty and packed with a ramshackle assortment\nof furniture. Two fat blue titmice perch in a cage next\nto ambitious plaster portrait of Napolean.\nSitting behind a desk is Ashoka, leaning over a mirror,\nsqueezing a balky pimple.\nNear a large window, his 60-year-old father, GHATAK, in\na European jacket and dhoti, works with intense concen-\ntration at repairing a pair of broken glasses with a\ntwist of fine wire.\nThe three new arrivals stand silent and respectful\nbefore the desk. At last, without raising his head...\n                       ASHOKA\n         Not a tongue between you then?\n                                          (CONTINUED)\n\n                                                    37.\nCONTINUED:\n                       RAM\n         Yes, yes, I am wondering, sir,\n         we are, is it possible you might\n         have something for my friend?\nRam indicates Hasari, as if there might be some question\nto whom he's referring. Ashoka attacks the pimple.\n                       RAM\n         Let me explain it for your ears,\n         sir. My cousin from Bihar has\n         just arrived in our city --\n                       GOONDA\n         They've brought a small present\n         -- of respect.\nThe Goonda places a small bundle of rupees on the desk.\nAshoka allows himself a disinterested glance at\nHasari.\n                       ASHOKA\n         So, you want to be a human horse?\n                       RAM\n         Oh yes! I have personally witnessed\n         his excellence -- yes.\n                       ASHOKA\n         He doesn't talk? Can he neigh at\n         least?\n                (to Hasari)\n         You -- do your ears function?\n                         HASARI\n         Oh yes, Babu.    Can I... uhm...?\n\n                        ASHOKA\n         Neigh!   Like a horse.\nAshoka pulls back his lips, shows his teeth and imitates\na neigh: \"Ne-igh! Ne-igh!\"\n                       HASARI\n         Well, yes, Babu, I can do that.\n         Would you like me to imitate a\n         horse?\nFinished with the pimple, Ashoka wipes a finger on his\nshirt and takes a helping off a plate of sweetcakes\nas...\n\n                                                      38.\nANOTHER ANGLE\nBehind him, The Godfather walks up to the desk, putting\nhis glasses on. He barely glances at his son, but\nwaves him out of the chair.\nAshoka doesn't like it, but he steps aside. As he does,\nhe turns a look of hatred on Hasari. Through no fault of\nhis own, Hasari has made an enemy. Ghatak chews on a pan\nand casts a benevolent eye on Hasari.\n                       GHATAK\n         Lift your longhi.\nHasari does.    The Godfather looks at his legs and thighs.\n                       GHATAK\n         The wise men of our nation say that\n         nirvana is the attainment of a\n         state of supreme detachment. For\n         me, nirvana is counting each\n         evening, one by one, the rupees\n         earned by my two thousand and\n         forty-six rickshaws.\nHasari doesn't know whether to respond. A glance at\nRam tells him not to. Ghatak gestures for Hasari to\nlower his longhi.\n                       GHATAK\n         You are with family?\n                       HASARI\n         I have a wife and three children,\n         Babu.\n                       GHATAK\n         And they must eat, heh. The\n         world is full of open mouths.\nHe chews on this a moment, then opens a drawer... and\nholds a small, tinkling rickshaw bell toward Hasari.\nHasari understands that, incredibly, he has a job. His\nbreath is so shallow, he can barely utter his gratitude.\nHe takes the bell.\n                       HASARI\n         I shall be eternally grateful to\n         you. From now on, I shall be as\n         the youngest of your brothers.\n                       GHATAK\n         Stay loyal. These days, it's a\n         crop nobody plants.\nThe Godfather turns his beatific and Godlike smile on\nHasari Pal.\n                                           (CONTINUED)\n\n                                                     39.\nEXT. MATTRESS SIGN - DAY (EARLY EVENING)\nTransitor MUSIC. The Pals load the rickshaw that stands\nat the road with Ram in it. There are embraces with the\nbruised Arun and his family.\n\nEXT. SQUARE - NIGHT (EARLY EVENING)\nWe hear the BELL TINKLING as the rickshaw, pulled by\nHasari, carrying Ram and Aloka (holding Shambu) arrives\n(Amrita and Manooj trotting beside their father). Surya,\nSelima, other neighbors greet them as they come. The\nPals glance into the school at Joan, who's teaching\nan evening class.\n\n\nWITH PALS\nReverentially, they follow Ram inside as Joan watches.\n\nINT. RAM'S HUT - NIGHT\nA door opens. Moonlight. Faces peer through the door.\nRam lights an oil lamp. In the glow, the family looks\naround their tiny space. Hardly able to suppress smiles.\n                          HASARI\n            Someone has blessed us. A job, a\n            roof, a school. Soon I'll be able\n            to send money home...\n                   (looking at Amrita)\n            ... and put away a little bit for\n            your dowry.\nIn their excitement, the boys run.\n\n\nOUTSIDE\nand up to the roof, under the stars.   We LOOK UP WITH\nthem and:\n                                           DISSOLVE TO:\n\nEXT. GREEN ACRES - ON SKY - NIGHT\nPAN DOWN TO Max on his balcony playing his trumpet as we\ncontinue to\n                                           DISSOLVE TO BLACK.\n\n                                                      40.\nFADE IN:\nEXT. SQUARE AND STREET (CITY OF JOY) - DAY\nAbout twenty tattered street kids faces shining with en-\njoyment. They run and shout as they pursue something\njust out of frame.\n\nWIDE SHOT\nThe cause of the excitement is Hasari running TOWARD us,\nfeet flying, as he pulls the rickshaw, loaded with a huge\nsack. Manooj and Shambu are clinging to the sides of the\nmachine.\nRam stands   in the center of the square. He shouts a\ncommand and   Hasari struggles to bring the rickshaw to a\nstop. It's    not easy and Sunil -- who's arriving -- has to\njump out of   the way to the accompaniment of apologies from\nHasari and   Ram and hoots of laughter from the children.\nOutside the clinic, a line of perhaps seventy-five wait\npatiently, watching as Hasari takes off again. The wheels\nof the rickshaw hit a rut. Hasari loses control, the sack\ntips back and Hasari is lifted into the air, feet kicking\nas he tries to regain his balance. Aloka and Amrita,\nsitting near the bawling Ram, can't hold back their\nlaughter.\n\nEXT. SQUARE - HIGH ANGLE - DAY\nThe square is set with obstacles. As Ram shouts instruc-\ntion, we see Hasari negotiate them with much increased\nskill. He stops in front of a small group. It's his\nfamily, plus Joan and Surya. With an exhausted smile, he\nsigns to Aloka and Amrita to get in. They do, and Hasari\ntakes them triumphantly around the circuit.\n\nHIGH ANGLE\nHasari's triumphant ride continues and we:\n                                             DISSOLVE TO:\n\nEXT. PARK STREET - DAY\nHasari rubs the moonstone in his ring on the shafts, then\ntouches his heart and his forehead. A SCHOOL GIRL in\nuniform, approaches the rickshaw stand. We also see\nseveral other pullers, Rassoul, Chomotkar, Ramatullah.\n                          SCHOOL GIRL\n            Rickshaw wallah!\n                                             (CONTINUED)\n\n                                                     41.\nCONTINUED:\n                       RAM\n         Let Hasari go!\nThe line of rickshaw pullers  turns to Hasari. The other\npullers wish him well as he  comes forward. His heart\npounds; ever so politely, he  helps the School Girl into\nhis carriage. She gives him   the address of the St. Pius\nSchool.\n                       HASARI\n         I'm sorry, I don't know where that\n         is. You're my very first passenger.\n                        SCHOOL GIRL\n         Really.   Well, I hope I bring you\n         luck.\nShe gives him a sweet smile.\n                       SCHOOL GIRL\n         That way, and then to the right.\nHis moment has arrived. He looks at Ram... and thrusts\nhis hips forward, setting off into the insanity of the\ntraffic, eyes flicking left and right. A HORN RAILS at\nhim and a taxi tries to run him down, calling and laugh-\ning as Hasari jumps in terror.\n                       RAM\n                (calling)\n         Feed the police!\nOther pullers laugh,  call after Hasari... and as he\napproaches the first  corner, he manages to pull out a\nrupee and deposit it  into the hand of the impassive\ntraffic policeman and  then turn right.\n\n\nEXT. ST. PIUS - DAY\nThe School Girl hands him a slip of paper.\n                       SCHOOL GIRL\n         This is my home address. Pick me\n         up promptly at seven each morning.\n                       HASARI\n         Yes, thank you, you can depend on\n         me.\nThe girl runs into the school  yard, met immediately by\nfriends. Hasari looks around   at the clean, bustling\nschool, at all the children in  their crisp uniforms and\na look of great yearning comes  over his face.\n\n                                                       42.\nINT. SMALL RESTAURANT - DAY\nMax is trying to explain to the waiter what he wants.\n                       MAX\n         Beef. You know -- cow? Minced,\n         little salt, pepper, slap it flat\n         like this, throw it on the grill,\n         flip it.\nNow, though, he just glimpses the shiny gas tank and\nengine of a motorcycle around the hip of the waiter.\nHe leans out.\n\nANOTHER ANGLE\n\nAshoka, astride his motorcycle, GUNNING the ENGINE as a\nboy runs out of a store with an armload of cassettes.\n\nWITH MAX AND WAITER\n                       MAX\n         Put it on the grill, I'll be right\n         back.\n\nWITH ASHOKA\nHe pulls the boy's ear, REVS the ENGINE to go... and\nsenses someone close. He turns to find an American\nhovering at his shoulder.\n                       MAX\n         You know, I have to say you\n         really don't look Jewish. I\n         believe that's mine.\n\nHe reaches for the necklace with the Hebrew letter.\nAshoka recognizes Max. Looks around for help. There is\nnone.\n                       ASHOKA\n         Don't touch me. No one touches me.\n                       MAX\n         Really?\nMax grabs Ashoka... who breaks free, and GUNS the CYCLE\ndown a side street. Max gives chase, his aching ribs\nslowing him a bit.\n\n                                                        43.\nSEVERAL CUTS\nAshoka, glancing back, begins to open up some distance.\nYet, Max hangs tough, weaving like a broken field runner\nthrough the mass of bodies and vehicles. Now, suddenly,\nhe loses Ashoka. He has to make a choice about this\ncorner or that one. He chooses.\n\nEXT. CITY OF JOY - AROUND CORNER - DAY (EARLY EVENING)\nA COP steps into his path.   He sees Ashoka up ahead.    He's\nhopelessly out of breath.\n                       MAX\n         Oh... great... good...good timing\n         ...him!\n\nHe can't talk and breathe. He points desperately. The\nCop glances where Max points, but he makes no move to\ngive chase.\n                       COP\n         May I see your passport?\n                       MAX\n         Passport? I'm in the middle of a\n         high speed chase. That guy --\n                       COP\n         Passport please.\nA crowd has begun to form. In the distance, we see a\ngroup of girls carrying cricket equipment COMING AT us.\n                       MAX\n         It's in my hotel room.\n\n                       COP\n         Passport, please, now.\n                       MAX\n         Ready my lips: I do not have my\n         passport with me at this...\n                (he gets it)\n         Ah, I see, said the blind man.\nThe Cop obviously is doing this at Ashoka's behest. Max\nstarts around the Cop. The Cop, however, sticks his club\nin Max's face; there's fire in Max's eyes... but a hand\ntakes the Cop's stick before Max can make a big mistake.\n\n                                                       44.\nANOTHER ANGLE - FAVORING OWNER OF HAND\nThe girls with the cricket equipment (and Margareta,\nthe teacher). The hand belongs to Joan Bethel.\n                       JOAN\n         Well, all right, junior, so you'll\n         owe me three.\n\nEXT. POST OFFICE - DAY\nA scribe finishes writing a note home for Hasari.   The\nscribe hands it to Hasari.\n\nINSERT - NOTE AND MONEY ORDER\n\n\"We are well. Manooj does not go in the cinema. I am\nearning my living as a rickshaw wallah. It is my\nhonor to send you this.\"\n\nRESUME\nWith great pride, Hasari pays the scribe, seals the money\norder with the message in an envelope, licks the flap,\nand puts the envelope into the mail slot.\n\nEXT. SQUARE (CITY OF JOY) - TEA SHOP - DAY (DUSK)\nSurya plays his zither. Max and Joan sit at a table. Max\npops little boiled candies into his mouth from a dish on\nthe table.\n                       JOAN\n         Oh, it was just a whim in the\n         beginning really -- to try to\n         convince them not to be so bloody\n         passive, that they could pull\n         themselves up on their own. I\n         get a little money from a Swiss\n         organization. Now it's become a\n         bit more than I can manage.\n                       MAX\n         It's got to be like trying to\n         drill a hole in water, though.\n                       JOAN\n         We just need a few more hands on\n         this little life raft we've set\n         afloat here.\n                                            (CONTINUED)\n\n                                                     45.\nCONTINUED:\nThey stare at each other. Shambu has become one of\nSurya's tea boys and refills their tea.\n                       JOAN\n         You know what I've come to think\n         in my middle age, Max?\n                       MAX\n         Nope, no, earthly idea. You're\n         pretty much outta my league,\n         thought-wise.\n                       JOAN\n         There are really only three\n         actions open to a person.\n\n                       MAX\n         Only three -- okay.   And what are\n         they?\n                       JOAN\n         To run, to spectate, to commit.\nMax peers at her a moment, then around the square.\n                       MAX\n         Has it occurred to you that this\n         obsession with charity is really a\n         flaw in your character?\n                       JOAN\n         Charity! It's not charity, dear\n         child, it's love. You're very\n         badly twisted around, aren't you?\n                       MAX\n         One of us sure as hell is.\nThe clinic's part-time doctor, SUNIL DASGUPTA, comes out\nof the clinic after a very long day.\n                       SUNIL\n         I'm off for home, Sister Joan. A\n         pleasure to meet you, Dr. Loeb.\n                       MAX\n         The same.\n                       SUNIL\n         See you day after tomorrow.\n                       JOAN\n         Good night, God bless, Doctor.\n                (a beat)\n         Generous young man.\n                                            (CONTINUED)\n\n                                                              46.\n      CONTINUED:\n      As he watches Sunil head away, Max senses something com-\n      ing at him from the side. A soccer ball almost hits him;\n      he jumps up, handles the ball athletically.\n\n      SQUARE\n      He begins to play with Manooj and several other children.\n      Shambu leaves his post in the tea shop to join them.\n                              MANOOJ\n                Are you the American doctor?    Are\n                you coming here to help us.\n                              MAX\n                No, I'm the visiting American\n                soccer star, El Max.\n                              MANOOJ\n                Do you go to the cinema in\n                America, El Max?\n                              MAX\n                When I was your age -- two movies,\n                plus cartoons every Saturday.\n      Aloka and Amrita are cooking on an open fire bucket. Max\n      almost knocks the fire over. Aloka looks at him, apolo-\n      getic, shy... as Manooj knocks Shambu down at Max's feet.\n      Max scoops the little boy up...\n                              MAX\n                There you go, little guy.    Ut --\n                what's this?\n      Reaching behind Shambu's ear, Max produces a boiled sweet.\n      Aloka watches this with a smile; their eyes touch again...\n      as Manooj lets out a cry at the sight of their father.\n\n      ANOTHER ANGLE\n      Ram and Hasari return home. Hasari can hardly walk.\n      Shambu runs to his father, explaining excitedly...\n                              SHAMBU\n                Daddy, there is the doctor from\n                America. He saw two movies every\n                Saturday. What's in your fist?\n                Open, Daddy!\nShambu pries his father's fist open:   seeds.\n                                                     (CONTINUED)\n\n                                                     47.\nCONTINUED:\n                         SHAMBU\n         Seeds?   Why?\n                       HASARI\n         So we can watch something grow.\n\nEXT. RAM'S HUNT NIGHT - UPSTAIRS\nChildren leaning down as smoke wafts up. We FOLLOW the\nsmoke DOWN TO Max's cigar. Aloka and Amrita laying the\nfood out. Shambu rubbing his father's aching legs as\nHasari and Manooj plant the seeds in Hasari's little tea\ncaddy full of earth from home. Max is watching this\n\"family\" huddled around the father.\n\n                       RAM\n         Another few months, I'll be able\n         to pay off the moneylender in my\n         village and go home and open a\n         grocery shop. All around me sacks\n         overflowing with all kinds of dal\n         and rice, aromatic spices, piles\n         of vegetables... and at night, I'll\n         lie on my back beneath the trees\n         sniffing fresh aubergines.\nThis beautiful picture burrows into Hasari's mind.   For\na moment, he goes there -- home, to the village...\n                       RAM\n         If my wife will let me come within\n         a hundred miles of the place where\n         she herself resides.\nRam laughs, Hasari smiles...\n\n                       HASARI\n         Amrita, I saw a beautiful wedding\n         sari today.\nAmrita is terribly embarrassed.\n                       RAM\n         It was six hundred rupees only.\nHe laughs at the impossibility of the price.\n                       MAX\n         That's only 40 dollars, isn't it?\n                       HASARI\n         If you have it.\n                                           (CONTINUED)\n\n                                                      48.\nCONTINUED:\n                       MAX\n         I'll send it to you from America\n         when I get home tomorrow.\n                       HASARI\n         That's very generous but no,\n         thank you.\n                       MAX\n         Repayment for punching you in the\n         nose.\n                       HASARI\n         You have repaid me by sharing our\n         supper.\n\nJoan indicates that Max should let it go.    Hasari ever\nso carefully waters the tea box.\n                       RAM\n         Doctor Big Brother, I myself would\n         be willing to accept a gift. Could\n         you give me five rupees in a note --\n         ten, perhaps. My ankle is badly\n         swelled; the higher the number the\n         more the swelling sinks.\nMax has to laugh.\n                       MAX\n         I don't have a cent on me.   I'll\n         owe you.\n                       RAM\n         How much?\n\nNow everyone's attentions is taken by a CRY from Shambu,\nwho expels his breath, his terrified eyes directing our\nattention to...\n\nANOTHER ANGLE\nIt's an amazing sight. Two lepers: ANOUAR, bearded with\na sharp intelligent, unmarked face, makes his way along\non a small wheeled board, at an amazingly fast pace,\nahead of SAID, a huge, mute leper. They stop some feet\naway. Lepers aren't often welcome. Out from behind Said\nsteps Poomina.\n                       POOMINA\n         Joan Di, my sister!\n                                             (CONTINUED)\n\n                                                     49.\nCONTINUED:\nShe sees Max, gasps, throws herself behind Said. Joan\nlooks at Max -- he starts to speak, she points a finger\nthat silences him...\n                       JOAN\n         It was Poomina who brought you to\n         us. She has herself and her\n         sister to support. It's all right,\n         Poomina. Anouar, what is it?\nShe moves to them.   They're all three badly out of breath.\n\nWITH JOAN AND LEPERS\n\n                       ANOUAR\n         It's Meeta! It's her time. But\n         something is wrong. The midwives\n         don't know what to do! Dr. Sunil,\n         could he help, perhaps?\n                       JOAN\n         Dr. Sunil isn't here.\n                       POOMINA\n         Meeta will die.\n\nANOTHER ANGLE\nJoan turns to Max, who hasn't heard the exchange.\n                       JOAN\n         Max, I wouldn't ask, but it's an\n         emergency. A pregnancy gone awry.\n         It's a leper. Could you have a\n         look?\nMax is clearly thrown by the sight of the lepers.\n                       MAX\n         I don't have any experience with\n         leprosy.\n                       JOAN\n         Good Christ, son, because she's\n         a leper doesn't mean she's not\n         built like a woman!\n                       HASARI\n         I can run and get Dr. Sunil.\n                         JOAN\n         It's too far.\n                                            (CONTINUED)\n\n                                                     50.\nCONTINUED:\nSuddenly, impulsively...\n                         ALOKA\n         I could help.    I've had three\n         babies.\n                       RAM\n         You can't do that. They're\n         outcasts, they're unclean.\nThere are murmurs of assent from the others.\n                         JOAN\n         Oh nonsense!    It's not contagious!\n\nA beat -- everyone fixed on Max.\n                       HASARI\n         You're a doctor, how can you not\n         help?\n\nEXT. PATH-NIGHT\nThe moon reflects off the dark puddles of muddy water\nthat line the side of the railway tracks. Anouar\npropels his board with astonishing agility along the\npath, Said and Poomina running with him. Max, Joan,\ncarrying a first aid bag, Aloka and Hasari following,\nslipping and sliding on the rough ground with its\npuddles and sewage.\n\nEXT. RAILWAY LINE - LEPER HUTS - NIGHT\nThe little procession arrives outside the three rough\nhuts, made of bamboo, plastic sheeting, cloth, wood\nand cardboard. A few shadows materialize. Lepers --\nstaring silently.\nAnouar points into a hut. Joan and Aloka precede Max\ninside. Max forgets to bend and bumps his head.\n\nINT. HUT - NIGHT\nThe only light is the feeble waver from a candle. The\nblind Meeta lies on a rough mattress on the ground. Her\nragged sari is pulled up to her middle. Her face runs\nwith sweat, her hair is plastered to her face. A girl\nwith black eyes is fanning her with a piece of wood.\nMeeta sends up a SOFT, uninterrupted MOAN. A wedge of\nblood-soaked cloth is between her legs.\n                                            (CONTINUED)\n\n                                                       51.\nCONTINUED:\nA middle-age leper is leaning over her -- a midwife,\nencouraging Meeta with a string of commands in their\nown language.\nMax kneels, Aloka at his side.   His breathing becomes\nshallow... but then he pulls off  the blood-soaked\nbandages. Between Meeta's legs   he can just make out\nthe bottom of a foot. The child   is breached. Maybe\nalready dead.\n                         ALOKA\n         Will she die?\nMax goes into reflex actions. Joan has opened the first\naid kit. There's a flashlight among the medicine,\nalcohol, compresses, scissors, etc. He hands the flash-\nlight to Aloka as...\n                       MAX\n                (to Joan)\n         Pull me two c.c.'s of Coramine.\nHe nods at Aloka; she illuminates the scene.\n                       MAX\n         Uh-oh, uh-oh, who's this coming'\n         down the lane? Why it's -- is it\n         possible -- way over here, in\n         India -- yes, it's Mr. Choke.\nHe comes to a stop. Everyone stares at him. Meeta\nmoans. For a moment, he stays frozen. Aloka reaches\nout instinctively, wipes the sweat from his eyes. This\ngesture seems to free him; he looks at her, looks at the\nroom and its expectant, trusting faces...\n\n                       MAX\n         I'm going to have to turn it --\n         the baby. Tell her she has to\n         relax these muscles as much as\n         she can.\nHe doesn't finish the sentence. Aloka speaks softly to\nMeeta as Max takes Meeta's arm, makes a tourniquet.\nJoan hands him the syringe and he injects. Hands the\nsyringe back to Joan and begins to work at turning the\nbaby.\nAloka takes Meeta's hand and it's a moment before we\nrealize Aloka, with her fine hand, is holding Meeta's\nfingerless palm.\n\n                                                       52.\nOUTSIDE\nA small group waits, trying to determine from the sounds\nwhat's happening inside. Anouar pours tea from a pot on\nthe small fire, offers the cup to Hasari. Hasari stares\nat the cup, doesn't want to be impolite, but more than\nthat, doesn't want to touch the cup. He shakes his head,\nsmiles. Anouar drinks off the tea.\n\nINSIDE\nSweat pours down Max's face into his eyes. He shakes it\nout. Aloka leans forward and, with her new sari, wipes\nthe sweat away again. Max nods thanks.\n                        MAX\n          Tell her again to breathe in short\n          little bursts now.\nHe demonstrates. Aloka does the same to Meeta. Meeta\ntries to cooperate. And suddenly Max has the baby\nturned.\n                         MAX\n          All right!   Now, tell her to push.\nAloka translates. Meeta pushes.      The midwife, the little\ngirl, Aloka lean forward.\n                          MAX\n          Again.   Yes!   Again.   It's coming.\n\nOUTSIDE\nNo one is sitting now. Everyone hangs close to the\ndoor. Only Hasari remains apart, seated on a tree stump\nin the middle of the quad. He coughs; suppresses it.\n\nINSIDE\n                        MAX\n          I've got the head. Come on,\n          little baby, come on, little\n          baby. Be alive, be alive, be\n          alive.\nAloka wipes the sweat away again. He looks at her, his\nvoice squeezed out through his teeth.\n                        MAX\n          We've got it, we've got it.     Yeah!\n                                             (CONTINUED)\n\n                                                     53.\nCONTINUED:\nHe seems as released as Meeta. Then he gives a last\ngentle tug and a CRY squeezes out of the little piece of\nlife in his hands. Max is fairly overwhelmed by the life\nin his hands. Poomina steps close, a smile on her lovely\nface, and touches the baby in Max's hands.\n\nEXT. LANE - NIGHT\nMax, Joan, Aloka and Hasari walk in silence down Nizamudhin\nLane. There is only the mingled  sound of COUGHING,\nMOANING, and a TRANSISTOR RADIO nearby playing a popular\nsong. Outside the clinic, they  stop. She takes his hand.\n                       JOAN\n         For a non-practicing doctor, that\n         was pretty practiced.\n                       MAX\n         Never been so scared in my life.\nIt's a warm, open moment between them.   But now there's\nthe ongoing desperation of her needs.\n                       JOAN\n         Max, please, won't you change your\n         mind? We desperately need another\n         doctor. Full-time. Think about\n         it -- just give us a couple of\n         months.\n                       MAX\n         Can't do it. Maybe you've got it\n         in you to be a saint. I just\n         don't.\n\n                       JOAN\n         Then what do you want? What are\n         you going to be when you grow up?\n         Good night, Aloka, Hasari.\nJoan goes inside, leaving Max, Aloka, and a very uncom-\nfortable Hasari alone a moment.\n                       ALOKA\n         Thank you for allowing me to go\n         with you.\n                       MAX\n         You could make a helluva nurse.\nA little smile comes over her face; no one's ever paid\nher that kind of compliment. She goes into Ram's hut,\nleaving Max and Hasari now.\n                                            (CONTINUED)\n\n                                                     54.\nCONTINUED:\n                         HASARI\n           I think perhaps you are a good\n           man.\nHasari brings his hands together and goes inside.\n\nEXT./INT. JOAN'S AND THE PAL'S (ALTERNATE) - NIGHT\nMax hears Joan praying inside.\n                         JOAN (O.S.)\n           Jesus, my brother, you who I am\n           trying to believe are the light\n           and salvation of the puking world\n           ...\nTHE PALS\nAloka sits huddled with her husband while their children\nsleep; they listen...\n                         JOAN (O.S.)\n           Please see that we are living in\n           madness and darkness here...\nMAX\nlistens.\n                         JOAN (O.S.)\n           ... and we need help. Om, Jesus,\n           om and amen.\nSuddenly, he hurtles into motion. He runs down the alley,\nhis stride stretching out, swallowing up the distance\nbetween here and the world beyond the City of Joy in\ngreat gulps.\n\nEXT. CALCUTTA AIRPORT - ESTABLISHING - DAY\nA busy, urban airport as opposed to the small country\nairport in which we saw Max earlier. V.O. we hear...\n                         BETSY (V.O.)\n           Yes, yes, yes, that's right, yes!\n           I turned in your ticket!\n\n                                                      55.\nINT. AIRPORT - DAY\nIt's a small place; it's sweltering, and it's packed\nwith hundreds of families shoulder to shoulder. Though\nBetsy's trying to be discreet, it's not a very private\nplace, as we see by the number of people watching Max\nand Betsy.\n                       BETSY\n         I bought it, I got a refund!\n                       MAX\n         But I want to go home with you.\n                       BETSY\n         You want to go home with me?\n\n                       MAX\n         Yes.\n                       BETSY\n         Then prove it.\n                       MAX\n         Good -- how -- name it.\n                       BETSY\n         Buy yourself a ticket.\n                       MAX\n         I would love to do    that, Betsy\n         Ilene, boy would I    love to do\n         just that, but I'm    financially\n         embarrassed at the    --\n                       BETSY\n         Use your credit cards.\n\n                       MAX\n         What credit cards? You know I\n         maxed them before we left. Just\n         lend me --\n                      BETSY\n         No! You won't pay me back; you\n         never have. Oh, Max!\n                       MAX\n         They're calling our flight. I\n         want to go home with you, Betsy\n         Ilene Kahn. Because I have a\n         vision. It's...\nHe's trying to woo and charm her.    He mimes a kind of\nhouse shape.\n\n                                             (CONTINUED)\n\n                                                     56.\nCONTINUED:\n                       MAX\n         I see you and me, Betsy Ilene\n         Kahn, nibbling toward each other\n         through a quarter pounder with\n         cheese, chugalugging a frosty\n         light beer -- great taste! Less\n         filling! Bowling! I want to go\n         bowling, Besty Ilene Kahn!\nHe fires a strike through the watching crowd.\n                       MAX\n         I want... Oh, my Lord Amighty, I\n         want so many American things --\n\n                       BETSY\n         Oh, stop it! You have no earthly\n         idea what you want, Max! And\n         stop calling me Betsy Ilene Kahn.\n                       MAX\n         Isn't that your name?\n                       BETSY\n         You call me Betsy Ilene Kahn like\n         you just met me yesterday.\n                       MAX\n         What should I call you?   My girl,\n         my significant other --\n                       BETSY\n         Don't get cute! You get cute and\n         I swear to God --- you told me once\n         I look like my mother!\n\n                       MAX\n         You do -- so what?\n                       BETSY\n         See -- you don't understand!\n                       MAX\n         How could I possibly not\n         understand a conversation as easy\n         as this one, Betsy Ilene.\n                        BETSY\n         I hate you!\n                        MAX\n         Na ya don't.\n                                            (CONTINUED)\n\n                                                       57.\nCONTINUED:\n                       BETSY\n         I stood by you for three years!\n                       MAX\n         I know.\n                       BETSY\n         I supported you through your\n         internship!\n                       MAX\n         You did.\n                       BETSY\n         Why? It was never working. What\n         have I been thinking all these\n         years -- that you'd change?\n         You're the most self-pitying,\n         self-destructive, self...\nShe can't find anything fierce enough, so she abates,\ntries to get it together to make a dignified exit.\n                       BETSY\n         But you've taught me something,\n         Max. You never finish anything.\n         Well, I quit. I've found my\n         light and I'm free of you.\nShe heads for the gate, people parting to give her a\nwide berth.\n\nMOVING SHOT - TOWARD THE GATE\n                       MAX\n         Will you at least call my mother\n         and ask her to empty my savings\n         account and wire --\n                       BETSY\n         Do it yourself, Max. Call her\n         collect. You should have called\n         her weeks ago anyway just because\n         she's your mother!\n                (to herself)\n         White light, white light...!\nShe hands her ticket and boarding pass over and she's\nthrough the gate. Max turns to find the audience fixed\non him.\n                                            (CONTINUED)\n\n                                                       58.\nCONTINUED:\n                       MAX\n         Guerilla theater, folks. 'All the\n         world's a stage.'  Don't know if\n         that word reached you here yet.\n         If you'd care to show your\n         appreciation by a small donation...\nMany smiles... and several instant offers of rupees.      A\nbeat, then...\n                       MAX\n         Aw, what the hell.\n... Swallowing his incredible embarrassment, Max takes\nthe money.\n\n\nEXT. SQUARE - DAY (EARLY MORNING)\nThe line is long. At this moment, Joan is checking a\nchild's throat with a tongue-depressor. Aloka is walking\nbeside her with a fistful of depressors and a bag for\ndisposal. Hasari and Ram are getting ready to leave.\nAnouar appears at Joan's waist.\n                       ANOUAR\n         Good morning, Joan Di. Dr. Loeb\n         said many of us could be helped;\n         that all it would take is money\n         for medication.\nAnouar hands Joan some newspaper in which something is\nwrapped. Joan opens the paper. Inside is a good deal of\nmoney.\n                       ANOUAR\n         Please buy the medication for us.\n         If we cannot come here to receive\n         it, perhaps Dr. Loeb would come\n         to us.\n                       JOAN\n         I'll be happy to buy the medication,\n         but Dr. Loeb is not part of this\n         endeavor, Anouar; there is only his\n         cherished memory.\n                       ANOUAR\n         Then perhaps I am having visions.\nAnouar's focus is up the lane.   Joan follows his focus\nto:\n\n                                                        59.\nTHEIR POV\nMax approaches. A buzz    about Max's heroics; hands coming\ntogether. Max raises a    hand in benediction, makes the\nsign of the cross. Max    claps Hasari on the shoulder;\nHasari brings his hands   together and gives Max a\ngenuinely pleased smile.    Children circle and touch him,\nManooj and Shambu among   them.\n\nBACK TO SCENE\n                          MAX\n            Good morning! Good morning!\n            Heckuva morning! Getting ready\n            to practice medicine without a\n            license, Sister Joan? You don't\n            see me soliciting conversions,\n            do you?\n                          JOAN\n            Well, well, well, I do so love to\n            be surprised.\n                          MAX\n            Okay, for starters, pick me out\n            someone with something easy I can\n            heal, make me look good.\n                   (to Aloka)\n            Aloka, you're my assistant, let's\n            go.\nAloka smiles, she nods, she accepts.\n                          JOAN\n            Max, knock it off, give us a bit\n            of hush.\n                   (as he does)\n            What happened?\n                          MAX\n            I changed my mind.\n                          JOAN\n            And I'm a bloody bathing beauty.\n                          MAX\n            Okay, so I got left.\n                          JOAN\n            Smart girl... So how long am I\n            stuck with you?\n                          MAX\n            Two weeks -- or until Mom sends me\n            a ticket.\n                                               (CONTINUED)\n\n                                                         60.\nCONTINUED:\n                         JOAN\n           Not worth the aggravation of your\n           prattle every day. Six months --\n           and not a day less.\n                         MAX\n           No way. Six weeks -- and that's\n           my best offer.\n                         JOAN\n           Two months -- and that's my final\n           offer.\n                          MAX\n                   (a beat)\n           Done.\n                         JOAN\n           Jesus and Mary. The Lone Ranger\n           rides again.\nAnd now smiles creep onto all their faces as Max goes\ninside, followed by Joan... and then Aloka -- after she\nlooks at Hasari, gets his nod of encouragement. Too late,\nJoan says...\n                           JOAN\n           Watch your --\nThud!\n                         MAX\n           Thanks -- got it.\nThe children titter. The teacher, Margareta, admonishes\nthem to pay attention and be polite... as we --\n\n                                             FADE OUT.\nFADE IN:\nEXT. SCHOOL GIRL'S HOUSE - HASARI'S WHEELS - DAY (TWO\nWEEKS LATER)\nThe wheels spinning furiously and then stopping abruptly.\nHasari, dripping with sweat, panting. The School Girl\ncomes running toward him. After her, in the b.g., her\nMOTHER.\n                         SCHOOL GIRL\n           Hasari, where have you been? I've\n           been waiting almost five minutes.\n                                             (CONTINUED)\n\n                                                       61.\nCONTINUED:\n                       HASARI\n         I'm sorry, forgive me.   It won't\n         happen again.\n                       SCHOOL GIRL\n         We're not going to school today.\n         You're taking my mother and me to\n         the Bara Bazar. I'm getting\n         married!\n                       HASARI\n         Oh, I am so pleased for you!\nPanting helplessly, Hasari smiles... as he helps the\nSchool Girl's Mother into the rickshaw.\n\n                       MOTHER\n         Good morning, Hasari.\n                       HASARI\n         Good morning, missus.\nBriskly, he takes up the shafts and sets off.\n                       MOTHER\n         Turn right at that corner, Hasari.\n                       HASARI\n         It's farther that way, missus.\n                       MOTHER\n         No, not really. Turn there,\n         please.\nObediently, Hasari turns (as Ramatullah, heading the\nother way, passes; they wave) and Hasari pulls AWAY FROM\nus.\n\nEXT. SECOND WEDDING SHOP - DAY\nHe helps them out of the rickshaw in front of an\nexpensive-looking bridal shop.\n                       SCHOOL GIRL\n         You must remember this shop,\n         Hasari, when it's your daughter's\n         time. This is the nicest in the\n         city.\nThe Mother gives the School Girl a withering look and\nhustles her into the shop. Hasari can just barely\nhear...\n                                             (CONTINUED)\n\n                                                       62.\nCONTINUED:\n                          MOTHER (O.S.)\n            Don't say things like that. He's\n            never going to be able to buy\n            anything here.\n\nON HASARI\nHe watches from outside, a look of determination coming\nover his face. Suddenly a pair of fingers takes hold of\nhis ear, twisting his face painfully.\n\nANOTHER ANGLE\n\nAshoka, with The Goonda and two henchmen, in the b.g.\n                          ASHOKA\n            Not working? How will my father\n            eat this evening?\n                            HASARI\n            I was just...\n                          ASHOKA\n            You have a daughter?\n                            HASARI\n            Yes, Babu.\n                          MARWARI (O.S.)\n            Rickshaw wallah!\nCalled to work, Hasari starts for his rickshaw, but\nAshoka hangs on to his ear for another uncomfortable\nmoment... as he slips a rupee into Hasari's shirt pocket.\n\n                          ASHOKA\n            Keep working. Give this to Sister\n            Joan and your friend the doctor\n            when you go home.\nNow he hands Hasari a sealed envelope and turns his ear\nloose. Hasari springs toward his passenger.\n\nINT. EXAMINING ROOM - DAY\nMax with his stethoscope to Meeta's baby. Meeta in a\nbrightly-colored sari and a lot of bracelets and Aloka\nlooks on. Poomina clings to the wall.\n                                              (CONTINUED)\n\n                                                     63.\nCONTINUED:\n                       MAX\n         He's just malnourished. Is she\n         giving him the milk we gave her or\n         selling it?\nAloka asks Meeta in Hindi. Meeta clearly swears she's\ngiving the baby the milk. Aloka pushes her.\n                          ALOKA\n         Not all.     Most.\n                       MAX\n         Tell her to give all the milk to\n         the baby.\n\nAloka does so as Max bounces the baby, coos to it play-\nfully. The baby pees all over him. Aloka translates\nquickly. Meeta starts apologizing. Poomina can't help\nlaughing. Max reminds Meeta that that's once for each\nof the two weeks of the baby's life. Aloka soothes Meeta\nas she hustles her, Poomina, and the baby out, then\nquickly begins to wipe Max's face with a clean rag. This\nisn't something she's accustomed to doing, but she's\ndoing it before she has time to think. Max finds himself\nconscious of her closeness to him... and then she becomes\nsuddenly self-conscious and she backs off, ducks her\nhead. He peeks up under.\n                         MAX\n         Psst.\nShe looks at him.\n                         MAX\n         It's okay.\n\nHe smiles.   So does she.\n\nEXT. SQUARE - DAY (EARLY EVENING)\nSunil stands outside the clinic, rolling his sleeves\ndown. Anouar waits at a polite distance. Exhausted but\nexhilarated, Max and Aloka emerge with an elderly woman\npatient, Max singing Chuck Berry to the woman's embar-\nrassed delight: \"They're really rockin' in Boston, in\nPhiladelphia, P.A...\" Sunil looks at his American\ncolleague, smiles a small smile.\n                       SUNIL\n         Good night, I'll see you day after\n         tomorrow.\n                       MAX\n         Good night, Sunil.\n                                            (CONTINUED)\n\n                                                    64.\nCONTINUED:\n\"... Deep in the heart of Texas, around the Frisco\nBay...\" Manooj and Shambu come charging at Max with the\nsoccer ball, hoping to engage him as a playmate. Hasari\nreturns home with his rickshaw.\nSelima waves at Max, indicates she's cooking dinner.\nJoan wanders out of the school as the kids are released\nand go charging through the square. Joan has the Pal\nkids in hand.\n                       SELIMA\n         Very special supper for you\n         tonight, Doctor Big Brother!   Will\n         you stay?\n\n                       MAX\n         Wish I could, Selima,  because I'm\n         sure hungry! Sixteen   hours of\n         pestilence and misery  always make\n         me famished. I have   to go with my\n         man Anouar tonight.   I've got\n         lepers to heal!\n                       ANOUAR\n         No, no, you know how patient we\n         are. Eat, eat.\n                       MAX\n                (to Aloka)\n         You're not tired, are you?\n                       ALOKA\n         Not if you're not.\nBetween Hasari and Aloka, there's just a flicker of\ntension; evidently, this has become Max's (and her)\nnormal day. But he's also worried about the note from\nAshoka. Joan joins them with the Pal children.\n                       JOAN\n         Well, I think we've got three very\n         good potential scholars here.\nBehind the children's backs, she points at Manooj and\nindicates the kid's really got a head.\n                       JOAN\n         Given him some time here, he'll\n         be good enough for a proper school.\n                       HASARI\n         It's more than a father could hope.\n                                           (CONTINUED)\n\n                                                     65.\nCONTINUED:\n                       MAX\n         Fifteen years from now: Miami,\n         Florida, Dr. Manooj Pal, in\n         association with Dr. Maxwell Loeb.\nFor a moment, Hasari is swept up in this little reverie,\nthen remembers reality.\n                       HASARI\n                (giving her the note)\n         From the godfather's son. For you\n         and the doctor.\nAmidst instant concern, Joan opens the envelope.   Looks\nat Max. We hear the sound of BANGLADESH MUSIC.\n\n\nINT. GODFATHER'S \"THRONE ROOM\" - OLD RADIO - DAY\nThe MUSIC is of days gone by, playing on an old RADIO.\nSticks of burning incense send off trails of smoke. The\ngodfather, MR. GHATAK, Looking infirm, wipes a tear from\nhis eye.\n                         GHATAK\n         Acha!\nNow we see   Max and Joan seated on cushions before the\ngodfather,   tea in hand. Max catches a glimpse in an\nanteroom of   several thugs with several young girls, one\nof whom is   Poomina. She catches a glimpse of Max as she\ndisappears   past a door. A moment later, her head peeks\naround the   door frame. She brings her hands together.\n                         ASHOKA (O.S.)\n         You!\n\nPoomina quickly disappears.   Max's attention is pulled\nback to the godfather...\n                       GHATAK\n         I understand that you're interested\n         in expanding your clinic and free\n         school, and that you intend to\n         start treating lepers in the City\n         of Joy.\n                       JOAN\n         We'd like to better serve the\n         entire community, Mr. Ghatak.\n                                            (CONTINUED)\n\n                                                    66.\nCONTINUED:\n                       GHATAK\n         Of course. That's very good.\n         Admirable. And we'd be pleased to\n         rent you suitable space. But you\n         must understand that certain\n         payments will go up.\n                       JOAN\n         I understand the rent would have\n         to go up if we rent larger\n         quarters from you, Mr. Ghatak, but\n         why should we have to pay more\n         protection?\n                       GHATAK\n         More people, more potential\n         trouble. Strangers. If I don't\n         charge you, what will I tell\n         others?\n                       JOAN\n         But we can't afford it!\n                       GHATAK\n         Surely if you can expand, you can\n         pay more.\nJoan throws up her hands -- how do you reason with this\nman?\n                       MAX\n         Am I stupid, but isn't this\n         protection money money we're\n         paying you to protect us from you?\n                       GHATAK\n         We live in chaotic times, Miss\n         Bethel, Doctor. I control the\n         City of Joy and maintain it as a\n         model of harmony. It's a miracle,\n         but a very fragile miracle.\n                       MAX\n         And how are we threatening your\n         miracle?\n                       GHATAK\n         I admire your courage in choosing\n         to work in such a violent place,\n         Miss Bethel.\n                       (MORE)\n                                           (CONTINUED)\n\n                                                    67.\nCONTINUED:\n                       GHATAK (CONT'D)\n         Your neighbors in the City of Joy,\n         they're not educated, they're\n         given to violence, to meanness, I\n         can promise you they won't like\n         having lepers among them, but\n         because they know you're under my\n         protection...\nHe dispatches a globule of spit into the copper urn next\nto his right toe... and tries to get to his feet. The\nGoonda hurries forward to help him.\n                       GHATAK\n         Doctor, do you like our music?\n\n                       MAX\n         Well, I can't say I've developed a\n         craving for it yet.\n                       GHATAK\n         It's difficult to appreciate what\n         we don't understand, isn't it?\n         Let me put it another way: The\n         world is a terrible place. Only\n         the ruthless prevail. My son will\n         make the arrangements with you.\nOne of the thugs helps the godfather outside, where, in\nthe b.g., we see him listening to his music and pottering\nin his garden. As Max and Joan turn, Max finds himself\nface to face with Ashoka, who wears Max's necklace and\nchai. There's a long pause as the two of them take the\nother's measure.\n                       MAX\n                (to Ashoka)\n         I like your taste in neckwear.\nJoan puts a cautioning hand on Max's arm. Ashoka seems\njust the slight bit uneasy dealing with Max and so keeps\ntrying to direct himself to Joan. He smokes a long\nIndian cigarette.\n                       ASHOKA\n         The entire package we're proposing\n         will cost you three thousand rupees\n         a month.\nJoan is taken aback by the sum.\n                       JOAN\n         If we pay you that, we won't have\n         any money for supplies.\n                                          (CONTINUED)\n\n                                                    68.\nCONTINUED:\n                       ASHOKA\n         I'm told you're very resourceful.\n                       MAX\n         I think I see a solution. May I?\n         What if we were to work out a\n         profit-sharing arrangement? We\n         give you a share of our net profit.\n                       ASHOKA\n         How do you expect to make a profit\n         off of lepers and the poor, Doctor?\n                       MAX\n         Beats the hell outta me, asshole.\n         But you've obviously found a way.\nThe question would seem to be whether Ashoka will have\nMax killed here or outside the house. His eyes on Max,\nAshoka puts the cigarette out against the back of his\nhand... and smiles at Max.\n\nEXT. GODFATHER'S HOUSE - DAY\nJoan is furious.\n                       JOAN\n         Have you gone right off your\n         rocker!? These people don't have\n         a sense of humor. Are you trying\n         to get yourself killed?\n                       MAX\n         I don't think so... but with me,\n         any duplicity is possible.\n\nHe tickles her; she knocks his hands away; he tickles her\nagain.\n                       JOAN\n         Stop it, you... you... you nudnick!\nHe doesn't stop, and as she storms off down the street,\nhe stays right on her, tickling away.\n\nINT. METAL PIECEWORK SHOP - DAY\nIt's dark and claustrophobic. The air vibrates with the\nSQUEAL and CLATTER of METAL. About twenty kids sit in a\nline, back to back, manipulating aseries of lethal and\nunprotected lathes and polishers. No one can hear his\nneighbor.\n\n                                                     69.\nANOTHER ANGLE\nHasari, with Shambu in the rickshaw, arrives to take the\nchildren home. As he looks inside, he notices...\n\nHASARI'S POV\nNot far from Amrita sits a handsome boy (Subash). He\ncatches Amrita's eyes. Amrita is sweetly embarrassed\nto find her father staring at her.\n\nON HASARI\nBut he can't help but smile. At the same time he's re-\nminded moment to moment of his various obligations.\n\n\nEXT. SIDE STREET - DAY\nThe three kids in the rickshaw. An ambassador car\nswerves in front of Hasari, forcing him to jam to a stop,\njolting the kids. The Goonda sits in the back seat with\nAshoka, who carves his fingernails with a switchblade\nknife. He crooks a finger at Hasari. Hasari leans close\nand Ashoka takes him by the ear.\n                          ASHOKA\n            Who gave you your rickshaw?\n                          HASARI\n            The Godfather.\n                          ASHOKA\n            Who provides the food you eat?\n                          HASARI\n            The Godfather.\n                           ASHOKA\n            Remember:   Loyalty.\nHe gives Hasari's ear a last tug... and the car continues\non, leaving Hasari. He looks at his children, ashamed\nto have been cowed. Manooj fixes his father with a hard\nlook.\n\nEXT. JOAN'S ROOM - KIDS - ABOVE - NIGHT\nLeaning over, listening, taking in the aroma of...\n\n                                                       70.\nINT. JOAN'S ROOM\nMax's cigar. He sits slightly apart from Joan, Sunil,\nAloka, Ram, Hasari, Selima, Margareta, Surya, SALADDIN,\nASHISH and Shanta, Aristotle John, MEHBOUB, Anouar, and\nSaid.\nHasari is stretched out, Aloka rubbing his screaming\nlegs. Throughout the following, their eyes meet and\ndeflect...\n                       SALADDIN\n         The Godfather is at least\n         civilized. The son is vicious.\n         Remember the last elections -- the\n         Molotov coctails, the blows with\n         iron bars. They'll throw us out.\n         We won't be able to find anyone\n         else to rent to us. We'll just\n         have to agree to pay what he\n         wants.\n                       MEHBOUB\n         Saladdin's right. Neither nature\n         nor the people with the power\n         have any conscience. We have to\n         pay.\nA sigh escapes Surya.   He shakes his head.    Eyes\nflick at him.\n                       ASHISH\n         What do you say, Doctor Big\n         Brother?\n                       SUNIL\n         I think we must try to break the\n         Godfather's hold on us.\n\nThis is startling and is met with a babble of cautious\nagreement and dispute.\n                       SUNIL\n         Please, hear me out. But I think\n         we have to be very cautious.\n                       MAX\n         How the hell do you proceed with\n         caution against these people?\n         You can't. You have to risk\n         everything.\n                       (MORE)\n                                              (CONTINUED)\n\n                                                    71.\nCONTINUED:\n                       MAX (CONT'D)\n         You try to negotiate with these\n         people, you make compromises with\n         them, they'll eat you alive. Stand\n         up against them now and they'll\n         fold. I guarantee it. Underneath,\n         they're cowards, they got no guts.\n         We show them we're strong and\n         the'll just move on to easier\n         pickings.\n                        ASHISH\n         We?   You have an airplane ticket.\nStill, he's clearly piqued a lot of support.\n\n                       SUNIL\n         You know, Max, this is not\n         American gangster television.\n                       SALADDIN\n         Yes, if you're wrong, you don't\n         have to be here.\n                       MAX\n         I'm not wrong. You bow your heads,\n         you plead with your Gods to do\n         what you won't do yourselves.\n         You put up with this nightmare\n         as if there were no choice. I'm\n         telling you, if you don't stand\n         up to that little pimple face\n         now, he'll own you for the rest\n         of your lives.\nEveryone stares at him. Many of them want to buy his\ncommitment. There's another large sigh from Surya.\nAloka and Hasari's eyes bang off of each other, she\nsilently urging him to speak. He's deeply conflicted\nand deeply frightened.\n                       ANOUAR\n         Even though I am invisible to some\n         of you and I don't have a complete\n         set of legs to stand on, I stand\n         with the Doctor Big Brother. Maybe\n         nature doesn't have a conscience\n         or those with the power, but don't\n         we?\nSaid, the giant mute, mades an unintelligible sound in\nhis throat, but clearly he's agreeing with Anouar.\n                                           (CONTINUED)\n\n                                                     72.\nCONTINUED:\n                       MARGARETA\n         I agree with Anouar and Max Daddah.\n         I think it's worth the chance.\nSilence... until Aloka and Hasari's meet again and, out\nof his terrible fear and conflict, he says very shyly...\n                       HASARI\n         Is it permitted to speak?\nThere are quick nods around the room.   With great difficulty,\nHasari says his piece.\n                       HASARI\n         I want my children to be educated\n         and cared for; this is our home,\n         we have never had such friends.\n         But many of us owe a great debt\n         to the Godfather. He is strong\n         and could kill us... But we must\n         choose. I trust my Big Brother.\n         I say we must stand up.\nThere's still dissension, but somewhat more support.\nSaid makes a fierce, unintelligible supportive sound.\nSurya sighs again. Eyes flick at the old man.\n                       SUNIL\n         Sister Joan, what do you think,\n         really?\n                       JOAN\n         Well, I think Max has hit on the\n         heart of what we're trying to build\n         here: a self-help society. Each\n         of us has to decide for himself.\n         As for me, I suppose I think,\n         really, that if the bastards are\n         going to suck us dry, I'd like to\n         get in a couple of good left-\n         handers before I turn the other\n         cheek.\n                       SALLADIN\n         But who will rent to us!\nSurya clucks his tongue and shakes his head; everyone\nassumes he is preparing a heated refutation of the\nresisters. His sighs, though, have been a building\ncommitment.\n                                           (CONTINUED)\n\n                                                         73.\nCONTINUED:\n                       SURYA\n         I have a property I will    rent you\n         for two hundred rupees a    month,\n         and not a rupee less. As     for\n         protection... you are on    your own.\nMany of the faces are uncertain -- Hasari's notable among\nthem.\n\nMONTAGE - INT./EXT. COWSHEDS - DAY\nA) Two cows are shooed out of the ramshackle building as\n   bustling activity on the new clinic begins. Cleaning\n   the place. Debris being torn out, hurled into a\n   pile in the street.\nB) Said, with the strength of three men, holds up a heavy\n   beam while Hasari tries to secure it. Max, hot,\n   smelly, and hating the place, stands in the middle of\n   the room, wishing he were elsewhere. The beams starts\n   to slip. Max leaps to Hasari's side.\nC) We see    that Max and Hasari are thrown together again\n   in some    carpentering task in uneasy camaraderie. A\n   finger    pokes Max on the back. He turns to find\n   Poomina    holding out two cups of tea.\nD) The whole    group shares a meal, prepared under   the\n   direction    of Selima, though the lepers remain   separate\n   from the    normals. Anouar leads the lepers in    singing\n   a song.     Joan and Margareta pick it up, as do   several\n   other of    the normals.\nE) Equipment from the old school/clinic being moved from\n   the square down here.\n\nF) Max and Aloka do one of those dances where two people\n   with arms loaded try to go around each other. Finally\n   he says he'll stand still and she should go around\n   him. They both laugh. Hasari watches.\nG) As Max puts medicine into a cabinet, Ram peeks in,\n   nods his approval, \"helpfully\" passes Max something\n   Max can reach just fine himself, shows Max an enormous\n   hole in his shorts and hits Max for ten rupees.\nH) A small truck carrying a charitable organization's\n   logo on the side is being unloaded of powdered milk\n   and various other things.\n                                             (CONTINUED)\n\n                                                       74.\nCONTINUED:\nI) UPSTAIRS AND STAIRWELL\n  Hasari and Max    move the last cot upstairs and into\n  place beside a    window that will come into play at the\n  end (It looks    down on the street). Hasari nods to Max,\n  indicating he    should look.\nJ) THEIR POV\n  Everyone gathered as Shanta and Ashish put a banner\n  above the door: \"You are invited to the festival of\n  this world and your life is blessed.\" The assemblage\n  applauds and embraces.\nK) UPSTAIRS\n\n  Hasari smiles at Max, brings his hands together, but\n  doesn't embrace the doctor.\n\nEXT. CLINIC - NIGHT\nEveryone lingers, adults and children. Max plays his\ntrumpet, accompanying Surya on his zither. Manooj\nhovers over Max.\n                       MANOOJ\n         Doctor Big Brother, aren't you\n         going to smoke your evening cigar?\nMax points at his trumpet, continues playing.\n                         MANOOJ\n         Please.\nMax indicates his pocket. Manooj takes out a cigar and a\nclip. Clips the cigar, holds it out to Max, who indi-\ncates Manooj should light it, and keeps playing. Manooj\nlooks at Hasari, who nods. Shambu holds a match to it.\nEveryone watches as if this were a major event. Manooj\ntakes a puff, chokes, offers the cigar to Mehboub, who\ntakes it, puffs, passes it. Everyone relaxes, enjoys the\npeacefulness of the smoking and the aroma wafting upward.\nRam taps at Max's elbow.\n                       RAM\n         It has come to me tonight to write\n         a letter to my wife.\nRam produces a mangled one piece letter -- envelope.\n                         RAM\n         Please.\n                                            (CONTINUED)\n\n                                                      75.\nCONTINUED:\nHe thrusts the paper at Max.   Max takes a pen from his\npocket.\n                       MAX\n         Okay -- shott.\n                       RAM\n         Yes -- what is the word -- that\n         word -- when land is watered...\n         with canals?\n                         MAX\n         \"Irrigation\"?\n                       RAM\n         Yes, yes, that word, I want that\n         word in the letter.\nMax looks at him, nods, waits.   Ram stares at Max; waits.\n                         MAX\n         Well?\n                         RAM\n         Well?\n                       MAX\n         What would you like to say to\n         your wife?\n                       RAM\n         I don't know, Max Daddah. If I\n         knew what to say to my wife, I'd\n         never have left home.\nEverybody laughs, though Ram's remark hits Max on a\ndeeper level. Manooj slides in beside him.\n                       MANOOJ\n         Why do you have to go home, Doctor\n         Babu?\n                       ALOKA\n         Because he doesn't live here,\n         Manooj. This is not his home.\nA look between Max and Aloka; Hasari's eyes flicking at\nboth of them... as Aloka's eyes come to Hasari. The\ncigar reaches Ram. As Max starts to write, Ram takes\na large puff and blows a huge ring out of his mouth. We\nFOLLOW it.\n\n                                                       76.\nABOVE\nA whole row of faces on rooftops enjoying the cigar.\nThis as we:\n                                           DISSOLVE TO:\n\nEXT. GREEN ACRES - THROUGH RICKSHAW WHEELS - DAY\nTHROUGH the WHEELS we see Max come briskly out of the\nhotel carrying his doctor's bag. He's met by the sight\nof Hasari between the shafts of his rickshaw and Anouar\nand Meeta perched on the seat.\n                       MAX\n         On no! Lepers! Lepers in my\n         neighborhood!\n                       ANOUAR\n         Sshh! Doctor Big Brother,\n         please, we are pretending not\n         to be lepers.\n                       MAX\n         Oh, oh, I didn't get the concept\n         -- of course, not lepers. I think\n         you're going to fool a lot of\n         people. I have only one question:\n         Why are you here?\n                       ANOUAR\n         We've come to take you to the\n         dispensary in grand style on this\n         special day, haven't we, Hasari?\n                       HASARI\n         Yes.\n\n                       MAX\n         Na, I'll just trot alongside Hasari.\n                       HASARI\n         No, please, get in.\nMax climbs into the rickshaw beside the two lepers and\nHasari pulls away.\n                       ANOUAR\n         Meeta's very excited by this ride\n         through Calcutta. You see, she's\n         never been sightseeing before.\nMeeta, of course, is blind.   Max, Hasari, Anouar laugh.\n                       MAX\n         You're incorrigible, Anouar.\n                                           (CONTINUED)\n\n                                                       77.\nCONTINUED:\n                         ANOUAR\n           Yes, yes, I know, thank you very\n           much.\nAs the rickshaw disappears into the sea of people and\nvehicles, we hear Anouar and Max LAUGHING.\n\nEXT. SIDE STREET - DAY\nMargareta, Manooj, Shambu, Shoba, several other kids and,\nat the end of the line, Poomina, all carrying water on\ntheir heads toward the City of Joy. Suddenly, someone\nwhispers to Poomina. One of Ashoka's thugs. She glances\nafter Margareta and the other kids who are turning a\ncorner and steps into:\nALLEYWAY\nWhere Ashoka waits.\n                         ASHOKA\n           You taking that to the clinic?\n                  (as she nods)\n           You like it there?\n                  (as she nods)\n           And they love your smile, don't\n           they?\nShe's fearful now and doesn't respond. He grabs her,\nthe water pitcher crashes to the ground, he puts his\nknife into her mouth and lays her face open on both side\nwith his knife.\n\nEXT. CITY OF JOY - DAY\n\nAloka comes TOWARD us leading a group of lepers.     And\nstops. Her hand goes to her mouth.\n\nTHEIR POV - CLINIC - FROM DISTANCE\nTwo hundred normal people lined up outside the gaily be-\ndecked dispensary -- many mothers with small children in\ntheir arms. Shanta sees Aloka, gestures to indicate the\nincredible turn-out. The normals at the end of the line\nturn to look at the approaching LEPERS.\n                         LEPER WOMAN\n           It is too beautiful to believe.\n                                              (CONTINUED)\n\n                                                      78.\nCONTINUED:\nAs if indeed she were right, their path is suddenly cut\noff by the Goonda and a commando of thugs, armed with\nsticks and iron bars, backed up by a group carrying\nbanners with slogans proclaiming in Hindi, Urdu, English:\n\"We Don't Want Lepers Here!\" There's a sudden uneasy\nsilence. Behind the thugs a short distance is the\npoliceman who harassed Max earlier and another cop.\nJoan hurries forward.\n                       GOONDA\n         Good morning, Sister to the poor.\n                       JOAN\n         Yes, Mr. Bhose?\n\n                       GOONDA\n         Those people aren't coming into\n         this neighborhood.\n                       JOAN\n         They are going to be treated at\n         the dispensary. You have no\n         right to stop them.\n\nANOTHER ANGLE\nHasari arrives with Max, Anouar, and Meeta.\n                       JOAN\n         Go ahead, Aloka, take them inside.\nThe Goonda puts his hand on Aloka.   The policeman in the\nb.g. keep their distance.\n                       JOAN\n         Take your hands off her, you\n         waster!\nJoan is seized by a sudden fury and grabs the Goonda.\nHe grabs her much harder. Said growls and pushes\nforward. Several thugs turn, step in to neutralize him.\nJoan elbows the Goonda and tires to westle free of him.\nAs a reflex he raises his hand. And as he does, it's\nseized.\n\nANOTHER ANGLE\nMax (with Hasari in the b.g., confused, conficted).   Max\nslings the Goonda against the side of a truck.\n                       GOONDA\n         That was a mistake, Doctor.\n                                           (CONTINUED)\n\n                                                      79.\nCONTINUED:\n                       MAX\n         The mistake's yours, putz.\n                (to Aloka)\n         Get these people inside.\nAloka starts forward, leading the lepers. She's stopped\nby a sudden blow from the Goonda's stick across her\nshoulders, knocking her to the ground, bleeding from the\nneck.\nHasari bolts for his wife, gets caught up in the melee.\nMax swings   around on the Goonda and for the first time we\nrealize how   strong he is, and that he knows how to box.\nThe Goonda   goes down and violence erupts. Anouar is\nchopping at   the legs of one of the thugs working on Said.\nThe massive   Said tears free and starts to beat the crap\nout of the   two thugs holding him.\nThe noise brings everyone out of the square, those lined\nup at the clinic, the children from the school.\nSunil comes flying out of the clinic.\nA stampede of those waiting outside the dispensary and\nthose normally in the crowded alley ensues. Shanta runs\ninside for help. Shopkeepers barricade their shop\nwindows.\nOne of the thugs pours gasoline over Anouar and  lights a\nmatch. Hasari kneels beside Aloka when he sees   the\nmatch ignite the tiny leper. Without thinking,   Hasari\nhurls himself on top of Anouar, rolling him in  the dirt\nand against his own body to put out the flames.\nJoan shouts, demanding the violence stop. She's hit\nfrom behind; she decides talk isn't going to do it. She\ngrabs a piece of lumber and starts to fight.\n\nANGLE ON DISPENSARY\nAn EXPLOSION in the doorway, scattering anyone who remains\nin the area of the dispensary doorway, badly wounding\nMehboub.\nMore people with sticks. Hasari goes down under    several\nbodies. Max reaches Aloka, helps her up, sends    her toward\nthe clinic. He tears an attacker off of Hasari    and they\nfight back to back a moment. A SECOND EXPLOSION    near\nthem... and through the smoke Max sees...\n\n                                                      80.\nANOTHER ANGLE\nAshoka astride his motorcycle, behind his dark glasses,\nwith more thugs, these with Molotov cocktails and pick-\naxes, ready to raze the clinic and school and the\nsurrounding neighborhood.\nSunil drags Mehboub inside.\nPeople chant: \"White Monkeys, go home! White Monkeys,\ngo home! No lepers here! No lepers here!\" The thugs\ncock their iron bars and bricks and Molotov cocktails.\nMax picks up an iron bar of his own and starts for\nAshoka. Suddenly, there's a DETONATION followed by a\nBLAST of air so fierce, Max is thrown to the ground.\nA bottle of GASOLINE has EXPLODED just behind him. He's\nenveloped in smoke.\n\nAn assailant bears down on Joan with a cutlass. As the\nassailant is about to strike, Hasari seizes the attacker\nand hurls him backward. Ashish steps in and slashes the\nassailant with his own weapon, startling, even repelling\nHasari.\nFrom all over   the lane, young fighters have come and joined\nthe fray, not   bothering to choose sides but merely enjoying\nthe release.    Hasari lunges for a woman under attack by a\nboy, arriving   too late to stop the boy from plunging his\nknife into the   woman's belly. Hasari fights his way to\nthe woman, but   she staggers into the mob.\nMax knocks down one of the thugs only to have  another hand\ngrasp his shoulder. He turns, fist cocked to   find Poomina,\nher hands holding her face together. Slowly,   she takes\nhands away. The sides of her face have been   laid open.\nMax sweeps her up in his arms, heads for the  clinic.\n                       MAX\n         Oh, little girl, little girl...\nJoan is suddenly beside Ashoka.\n                       JOAN\n         We'll pay! All right then, so by\n         all means, protect us!\nAshoka raises a hand,   The Goonda blows a whistle, and\nthe fighting stops as   suddenly as it began. The com-\nbatants are breathing   heavily. There is silence but for\nthe groans and cries   of the wounded and grieving.\n                       ASHOKA\n         In a world such as ours, everyone\n         needs protection. For the fee we\n         discussed, from this day forward,\n         I can assure you nothing like this\n         will happen again.\n                                          (CONTINUED)\n\n                                                       81.\nCONTINUED:\nA beat... Saladdin is at Joan's shoulder.     Ashoka points\na finger at Hasari.\n                       ASHOKA\n         You. I warned you about the\n         company you keep.\nHe REVS his MOTORCYCLE and SCREECHES away, leaving Hasari\nstaring after him in his dust.\n\nINT. COURTYARD - DAY\nPeople peer in through every opening. Mehboub's chest is\nbandaged. Sunil squeezes through the packed courtyard\nand hallway, Ashish carrying a wounded woman behind him.\nHasari steps into a doorway, us WITH him.\n\nINT. EXAMINING ROOM - MAX, ALOKA, POOMINA\nMax, blood crusted on her face, sutures Poomina's awful\nfacial wound as Aloka prepares a compress.\n                       ALOKA\n         Will she... Her face, will it...\n                       MAX\n         If she's very careful and doesn't\n         do anything to open the wound, the\n         scarring will be minimal.\n                (to Poomina)\n         Do you understand? You can't...\n         You have to stay here.\n                (to Joan)\n         You make her stay here.\n\n                       JOAN\n         I'll try.\n                       MAX\n         Don't goddamn try, Joan!   Goddamn\n         do it!\nPoomina peers through her pain at Max, his hands putting\nher back together.\n                       MAX\n                (a litany)\n         I hate this place, I hate this\n         place, I hate this place.\nMax looks at the doorway and he locks eyes with Hasari.\nMax breaks the contact. Hasari stares at him as we hear\nthe godfather's MUSIC on the RADIO.\n\n                                                          82.\nEXT. GODFATHER'S COURTYARD - HAND AND PENCIL - DAY\nA hand tap, tap, taps against a ledger.\n\nCOURTYARD\nAshoka sits behind a little table, picking absently at\nhis face. The Goonda is slouched near the table, smoking\na cigarette and fiddling with a thin switch. (It's dif-\nficult for him to show Ashoka the respect his inherited\nposition gives him.) The Goonda has a bruise under one\neye from his altercation in the City of Joy yesterday.\nThe air is filled with the MUFFLED SOUNDS OF the STREET.\nFROM here, we can see the evermore enfeebled godfather\nin his \"throne room,\" wrapped in a cashmere, listening\nto the radio. Ashoka looks up, stares impassively at\nsomeone.\n                            ASHOKA\n            Well.    What have you got to say?\n\nANOTHER ANGLE\nFor the first time, we see who Ashoka's speaking to.\n                          HASARI\n            I told them that your father\n            provides us with a great deal and\n            that --\nAshoka slams his hand on the register.\n                          ASHOKA\n            From this minute, you   are off the\n            list! You will leave    your rickshaw\n            here... where it will   be reserved\n            for a man who deserves   our trust.\nHe stands up.       Hasari is near tears.\n                          HASARI\n            Please, Babu, this is as if the\n            ground has opened up. I have to\n            speak to Mr. Ghatak!\nHasari starts for the house. The Goonda stops him and,\nquickly, has Hasari on his knees, his arm twisted pain-\nfully behind his back. Ashoka jumps at Hasari, grabs\nhis ear.\n                          ASHOKA\n            My father's ill! You are speaking\n            to me!\n                                                 (CONTINUED)\n\n                                                       83.\nCONTINUED:\n                       HASARI\n         I have a family!\n                       ASHOKA\n         The decision is made. I have made\n         it. Now get out before I have Mr.\n         Bhose break your legs.\nHe gives Hasari's ear a vicious twist and slams his head\nagainst the table.\n\nEXT. GODFATHER'S HOUSE - DAY\nThe side gate opens and Hasari is shoved   out. Stumbling,\nhe runs to the fence, peers through. Two    men are pulling\nhis rickshaw into the courtyard. Hasari    watches as a\nsteel shutter is pulled down, cutting his   livelihood from\nsight.\n\nANGLE THROUGH BAR - HASARI\nNumb, compromised, defeated.    Perhaps the low point of\nhis life.\n\nINT. CLINIC - JOAN'S ROOM - \"RAFT OF MEDUSA\" - NIGHT\nFlickering candlelight illuminates the \"Raft of Medusa.\"\nMax rails at Joan.\n                       MAX\n         I just don't... I don't want to...\n         I don't want to care! I don't want\n         to care this much! I just don't\n         want to be invested in you people.\n         In people! I became a goddamn\n         doctor because my goddamn father\n         wanted me to be a goddamn doctor\n         because he was a goddamn doctor!\n         He was the goddamn king of\n         doctors! It's too goddamn hard!\nOut of breath, out of words, Joan reaches out and takes\nMax to her, brings him beside her on the cot. Beneath\nthe \"Raft of Medusa,\" she sits with an arm around Max, as\nif he were her son.\n                       JOAN\n         Not everyone's cut out for this.\n         You did the best you could.\n         Better than many. It's all right.\n                                            (CONTINUED)\n\n                                                     84.\nCONTINUED:\n                       MAX\n         I didn't do the best I could! I\n         did what I always do! I shot my\n         big mouth off and did a half-assed\n         job. And what I want to do now is\n         I want to go back to America and\n         make money and live a life without\n         entanglements and demands and\n         people hanging on me.\n                       JOAN\n                (a beat)\n         You know, the fact is from the\n         minute we're born we're\n         shipwrecked. Some see that as a\n         lifetime of drowning, of fear,\n         others only to endure, but to\n         triumph. It's all in the\n         individual spirit, isn't it?\n                       MAX\n         Got it: To run, to spectate, to\n         commit.\n                (raises his hand)\n         Running spectator.\n                       JOAN\n         Then, by all means, go home, Max,\n         and go with my blessing and my\n         eternal friendship.\nThe candlelight flickers against them as they sit side\nby side. Neither speaks.\n\nEXT. RAM'S HUT - TEA SHOP - NIGHT\n\nAt the tea shop, a group relive the day's events. The\nchildren sleep. Aloka sits outside, worried about\nHasari.\nMax comes out, meets Aloka's eyes and looks away.   She's\nheard the conversation.\nHasari, drunk, comes down the slope.   Face to face with\nMax.\n                       HASARI\n         They took away my rickshaw.\nAloka's hand flies to her mouth. Hasari peers at Max\nwith his drunken gaze. It's a terrible moment for Max,\nbut...\n                                           (CONTINUED)\n\n                                                     85.\nCONTINUED:\n                       MAX\n         So what do you want me to do about\n         it -- get it back for you?\nMax takes away a step.   Stops.\n                       MAX\n         I'm sorry. I'm going home.\n         Because this isn't my fight. I\n         got one person to look after --\n         me.\nHasari stares at Max. On the roof, the children listen.\nAt the tea shop, the late-night talkers listen.\n\n                       MAX\n         All right, I'm running out,   okay?\n         Because I'm a coward, this   is me,\n         this is what I do, I get in   over\n         my head, I let people down,   I run.\n                       HASARI\n         But I trusted you.\n                       MAX\n         Well, that was your goddamn\n         mistake!\nMax walks away, leaving Hasari desolate.   Aloka comes to\nhim.\n                       HASARI\n         I don't know how I'm going to pay\n         the rent, how we're going to eat.\n                       ALOKA\n         We have what is saved for Amrita's\n         dowry.\nThe thought of using the dowry is yet another awful blow\nto Hasari's hopes.\n                       HASARI\n         The children must leave the\n         school; they'll have to work. And\n         you will not have anything to do\n         with the clinic or those people\n         anymore.\nRam joins them.\n                       RAM\n         What I earn is yours, too.\n                                           (CONTINUED)\n\n                                                      86.\nCONTINUED:\n                         HASARI\n           You can't support all of us. You\n           have a family in your village, too.\nHasari touches his friend and goes into:\n\nINT. RAM'S HUT\nAlone in his pain, he spots his tea caddy in which he\nplanted his seeds over a month ago. He bends over to\ntenderly touch the growing shoot and water the earth.\nHe looks up and the three children are staring at him.\nWhat will their father do now to keep them alive?\n\n\nINT. BLOOD DISPENSARY - CLOSE ON HASARI'S ARM - DAY\nThe needle injected, Hasari's blood flowing into a\nbottle.\n\nANOTHER ANGLE\nHasari seated on the stool, watching his blood leave his\nbody, his face again broken out in perspiration.\n\nHIS POV - RAFIK\nWaiting.\n\nBACK TO SCENE - HASARI\nHis face immobile, his thoughts distant. The Attendant\nstarts to pull the needle out. Hasari stops his hand.\n                         HASARI\n           Take more.\nThe Attendant shakes his head.\n                         HASARI\n           Take more.\nThe Attendant looks at Rafik, who shrugs, nods... and\nallows the blood to flow on out of Hasari's body.\n\nEXT. BLOOD BANK - DAY\nBarely ambulatory, Hasari starts down the street, but has\nto stop, lean against a wall. Through his woozy haze, he\nthinks he sees an apparition.\n\n                                                     87.\nANOTHER ANGLE\nThere, in the entrance to a building, is Gangooly.\nSeeing a potential victim, he swoops in.\n                       GANGOOLY\n         Not well, brother?\n                       HASARI\n         Still stealing from refugees?\nGangooly looks at Hasari, recognizes him, and gives him\nan amazing smile.\n                       GANGOOLY\n         Well, yes, I remember you, of\n         course -- hello! I am delighted\n         to see you -- yes. And tell me\n         immediately, please -- your little\n         family, your beautiful children,\n         everyone eats, yes. Come, have a\n         cup of tea or a little something\n         stronger, we must celebrate.\nGangooly starts to move, to position himself for a get-\naway. Hasari blocks his egress, unsmiling.\n                       GANGOOLY\n         Ah, well, you're angry    at me, yes,\n         I wondered if that was    still on\n         your mind -- I am full    of regret\n         about that, yes, even    a little\n         tormented. What can I     say? I have\n         the spirit of an eagle    trapped in\n         the body of a crow.\n                        HASARI\n         I'm touched.\n\n                       GANGOOLY\n         My friend, I am lame and I am poor.\n         Does that mean that I shouldn't\n         survive? Huh? When a man is\n         struggling in a rough sea, he\n         clutches onto what he can or he\n         drowns. You don't look so well.\n                       HASARI\n         I lost my rickshaw.\nGangooly gives Hasari an appraising look for a moment,\nthen...\n                                            (CONTINUED)\n\n                                                      88.\nCONTINUED:\n                       GANGOOLY\n         Ach! I  have an offer. No,\n         listen!  Shiva be my witness, you\n         must at least think about this.\n         Please, I can help... Or my name\n         is not Mr. Gangooly.\n                       HASARI\n         Which, fortunately, it is.\n\nEXT. STREET - MOVING SHOT - DAY\nGangooly guiding Hasari onward.\n\n                       GANGOOLY\n         Remove the children from the school\n         -- no, why? When you, the father,\n         can make a small sacrifice. Nature\n         has foreseen your plight. For she\n         has given you two eyes, yes, and\n         two kidneys. But. To live, you\n         have need of one only. I have a\n         friend who sold his kidney -- this\n         one -- and now -- believe me, this\n         is the truth -- he lives in a brick\n         home... which he owns.\nThat smile.\n\nEXT. SKELETON WAREHOUSE (MITRA & CO. EXPORTERS) - JUDAS\nDOOR - DAY\nA forbidding face appears at the grill, stares out.\n\n\nINT. SKELETON WAREHOUSE - DAY\nHasari and Gangooly enter. A repulsive smell almost\nmakes Hasari gag. Gangooly takes Hasari's arm and steers\nhim through the gloom. Hasari discovers the origin of\nthe smell.\nA line of skeletons arranged along the walls. Tables\nstacked with bones: skulls, spines, rib cages, hands\nand feet. Each skeleton sports a label with a price in\nU.S. dollars.\nCrouched among the bones and packing crates are men work-\ning. Some smoke, some have masks over their faces. They\nscrape and clean and decorticate. They skillfully\nassemble their grisly creations, emotionless but like\nartists.\n\n                                                      89.\nPOV - MANAGER'S OFFICE - DAY\nTHROUGH a dusty, glass, interior window, we see, almost\nin mime, the manager examining Hasari.\n\nINT. MANAGER'S OFFICE\nWith a smile, the manager produces some papers. Hasari\nshakes his head, starts for the door. Gangooly stops\nhim.\n                       GANGOOLY\n         Of course, take some time, think\n         about it. People all over the\n         world, anxiously waiting, willing\n         to pay. 15,000 rupees for a\n         kidney. 25,000 for an eye.\nGangooly winks, peers at Hasari with a single eye, and\nsmiles.\n\nINT./EXT. TAXI - ROAD TO AIRPORT - DAY\nHeat haze on the road. As we FOCUS, we FIND Max, Joan,\nAloka, also with their thoughts. Joan gazes out the\nwindow of the taxi. Max looks at the back of Joan's head\na moment, then looks at Aloka, who sits between them.\nShe deflects his eyes forward.\n                       JOAN\n         Hasari has forbid her to have\n         anything more to do with us. He'd\n         be very angry if he knew she was\n         seeing you off.\nMax looks at Joan.   Looks out the window.\n\n\nINT. AIRPORT - DEPARTURE AREA - WIDE SHOT - DAY\nFirst we see joyous people greeting arriving passengers;\nparents greet a young man returning from college abroad.\nThe way clears and we CLOSE IN ON Max, Joan, and Aloka, a\ntiny island in this sea of people at the moment of their\nparting. Max empties all the money out of his pockets.\n                       MAX\n         This is for Poomina.   When I get\n         home...\nHe thrusts the money on Joan and Max offers his hand;\nshe goes through the hand to embrace Max. Then Max and\nAloka look at each other.\n                                             (CONTINUED)\n\n                                                         90.\nCONTINUED:\n                          ALOKA\n            You did good things.\n                   (chokes up, but\n                    manages)\n            Thank you for coming to our\n            country.\nAnd now Max heads out the door.\n\nINT. CAFETERIA - ALOKA AND JOAN - DAY\nSparsely populated.     They sit in isolation at a table\nover a cup of tea.\n\n                           JOAN\n            It's not like  he's royalty or\n            anything, so  I'm not persuaded we\n            have to wait  for the plane to\n            actually take  off.\n                           ALOKA\n            No.   We should go.\nYet, they   remain another moment... then get up. Joan\nputs her   arm around Aloka and they turn to go. The looks\non their   faces suggest they've come face to face with\nsomething   startling.\n\nANGLE ON DOOR\nMax.   Standing inside the departure doorway.\n                          MAX\n            What were those three choices\n            again?\nTheir faces. And his with just a wistful version of his\nold grin... and we --\n                                             FADE OUT.\nFADE IN:\nEXT. COMPOUND - DAY\nHasari returns.     Goes into Ram's hut.\n\nINT. RAM'S HUT - DAY\nHe finds his family... and Max.     The two men stare at\neach other.\n                                             (CONTINUED)\n\n                                                    91.\nCONTINUED:\n                       MAX\n         I need Aloka at the clinic.\n                (as Hasari stares)\n         All right, they, the patients,\n         need her. She's a good nurse.\n                (as Hasari stares)\n         Come on, man, this is between you\n         and me. Why take the kids out of\n         school, why punish your wife?\nHasari holds his anger in; he moves to a mat and lies\ndown, his back to Max. But Max doesn't go.\n                       MAX\n         I have a little money, I can get\n         it from the States...\n                       HASARI\n         It's not a question of money.\n         We'll survive on our own.\nThat's it. Hasari lies with his back to Max. After some\nmoments of silence, Aloka indicates Max should go. And\nhe does. After another moment...\n                       ALOKA\n         Maybe he's right. The clinic is\n         for everyone and if I am needed --\nHasari bolts up, a look of anger on his face we've never\nseen.\n                       HASARI\n         No! I'm your husband and you'll\n         do as I say! Unless, of course,\n         you've become an American wife and\n         then you'll do as you please!\n                       HASARI\n         Stay away from them. They are not\n         part of us. They will only be good\n         to you as long as you please them.\nThe children, Aloka are frozen, she very close to tears.\nHasari lies back down, again turns his back on them.\n\nEXT. LEPER COLONY (DAWN) - DAY\nThe small colony alive; a line of patients outside a door.\n\n                                                       92.\nINT. ROOM - DAY\nMax unwraps a bandage from a leper's partial limb. Looks\naround for Aloka. She's not there. Said is acting as\nhis nurse. Points at his instruments.\n                       MAX\n         Hand me the scissors, please.\nHelpfully Said hands him the tweezers.\n                       MAX\n         Scissors, scissors.\nHe demonstrates. Said fumbles through the instruments,\npicking up the scissors by the ends.\n\n                       MAX\n         Not that end -- No, that's fine,\n         thanks, I've got it.\n\nEXT. LEPER COLONY - DAY\nMax comes out with his last patient.   Anouar waits.\n                       ANOUAR\n         Max Daddah, you are finished?\n                (Max nods)\n         Follow me.\nAnouar takes off down the lane and disappears quickly\ninto a little building, Max following.\n\nINT. TANNERY - DAY\nMax follows Anouar past bubbling cauldrons and heaps of\nanimal skins. The place stinks fiercely. Anouar and\nMax exit into...\n\nA SMALL YARD\nTwo young men (the two pullers Chomotkar and Ramatullah)\n... and something covered with a tarp.\n                       MAX\n         You didn't steal this.\n                       RAMATULLAH\n         The police, Sahib, they stole it.\n         We stole it from them.\n                                            (CONTINUED)\n\n                                                     93.\nCONTINUED:\nThe pullers whip the tarp off. A battered rickshaw, the\nsprings poking out of the seat, the broken wheels lying\nin the body, the finish scarred and gouged, one shaft\nbroken.\n                        MAX\n         How much?\n\nEXT. SQUARE - DAY\nMax comes into the square. Aloka and Selima are pre-\nparing meals. Manooj, Shambu, and three other boys\nplaying. Ram is trying to jolly Hasari, who's deep in\nhis own reverie. Max stands in front of Hasari.\n\n                       MAX\n         I'd like to show you something.\n         Just take a minute.\nA beat as Hasari fixes Max with an empty stare and the\nfamily waits to see if Hasari will respond.\n                        MAX\n         Go ahead.   Go on.\n\nEXT. COURTYARD AND STORAGE SHED - CLINIC\nThe sound of a PADLOCK being UNLOCKED. DARK SCREEN.\nLight flashes. Max and Hasari appear in the doorway.\nSurprised by the light, a few rats scurry off. Some-\nwhere a dog BARKS. Slated, shafted light. He indicates\na corner.\n\n\nTHE RICKSHAW\nPiled up in its ruin.\n                       MAX\n         I'm good with my hands. You're\n         good with yours. What do you say?\nHasari looks at Max, part resentful, part touched.\n                       HASARI\n         If I were to go on the street with\n         this machine, I would end up in a\n         gutter with my throat cut.\n                                           (CONTINUED)\n\n                                                     94.\nCONTINUED:\n                       MAX\n         Well, it's yours if you want it.\n         You know the license, the cops,\n         all that can be fixed. You'll\n         own this -- it'll have nothing to\n         do with the Godfather.\n                       HASARI\n         Doctor Daddah, I'm just a small\n         man. Don't try to tempt me again\n         with big thoughts.\nHasari starts to leave.    Max blocks his way.\n                       MAX\n         You didn't want me to quit.    Well,\n         I came back.\n                       HASARI\n         But can you be trusted?\n                          MAX\n         I hope so.\nHasari can see the hope and desire in Max's face. After\na moment, Max steps aside. Hasari bends his head and\nmakes off. Leaving Max and a small sigh of\ndisappointment.\n\nEXT. LATRINES - FOUNTAIN - ALOKA - DAY (DAWN)\nShe takes her morning absolutions, bathing in the foun-\ntain. The process is extremely sensual, though there is\nnot even a glimpse of her nakedness as she moves her\nclothing around, cleansing this area, then that. She\nglances up to see...\n\nANOTHER ANGLE\nMax, in an Indian shirt, heading for the square; rather\nnaturally, he brings his hands together in the Indian\nsalutation. He carries several bottles of distilled\nwater, a large value pack of bar soap, and a carton of\nmedical supplies. As he passes, his eyes hook on\nAloka's. He lifts a hand in greeting. After a moment,\nshe ducks her head. He turns and continues on coming\nface to face with Ram, an enormous smile on his face.\nWith him, Hasari. He glances at his wife in the water.\n                       MAX\n                (to Hasari)\n         Going to look for work?\n                                            (CONTINUED)\n\n                                                        95.\nCONTINUED:\nWhen Hasari doesn't answer...\n                         RAM\n         Yes, he is.\nRam has a small coughing fit.\n                       MAX\n         Are you taking your medicine?\n                       RAM\n         Yes, yes, but look at this.\nHe points at the wheel  of his rickshaw; the rim is\ncracked. Scornfully,   Hasari walks on. Max and Ram\nglance after him. Max   digs out several rupees. Ram\ntakes them and goes.   Max looks after the two men as\nthey disappear. When   he turns...\n\nANOTHER ANGLE\n...he finds himself face to face with Aloka. Without a\nword, they start walking side by side toward the square.\nIt's several seconds before she says...\n                       ALOKA\n         He's very proud.\nThey walk on in silence -- two friends, separated by a\ngulf.\n\nEXT. DOCKS - FROM THE GATE - DAY\nMen moving like ants into the bow of the ship.   Hasari is\nlocked out, turned away without work.\n\nEXT. METRO CONSTRUCTION SITE - DAY\nA huge gouge in the black mud, sunlight streaming through\nsteel girders across it. Hasari emerges from the ground,\nlooking for someone. Stops him. The foreman shakes his\nhead, no, before Hasari even has the chance to ask for\nwork.\n\nEXT. SKELETON WAREHOUSE - EXTREME CLOSEUP - HASARI'S\nFACE - DAY\nThen we see he's standing outside Mitra & Co., staring at\nit, wondering if it's time to sell part of himself. No!\nWe see on his face a look that tells us he will not be\nbeaten.\n\n                                                         96.\nEXT. CLINIC - COURTYARD - DAY\nThe street children's school now takes up two rooms.\nChildren peer out of one room now as, to the accompani-\nment of Surya's zither, twenty or so girls are doing some\nIndian classical dancing, under the eye of a young Indian\nteacher.\nAcross the way, in the other room, some children are\ntranslating Bengali words into English. A boy is writing\non the board. It's Manooj. We see that Shambu is in the\nsame class.\n\nINT. EXAMINING ROOM\nFROM BEHIND, we watch Max take a wrapping off of\nPoomina's wound, Joan assisting him. Indeed, Ashoka\nextended Poomina's smile on either side of her mouth.\nThe scars are healing as nicely as could be expected.\nMax did a fine job.\n                       MAX\n         You must have had a good doctor.\n         Still no running, jumping, picking\n         up anything heavy. And you stay\n         here. You're going to help Sister\n         Joan and you're going to school.\n         Do you understand?\nA beat, Poomina nods.    But now a look of abject fear\ncomes over her face.\nThe Goonda stands in the doorway. Max begins singing\n\"Sweet Little Sixteen.\" The Goodna stares impassively\nat Max.\n                       THE GOONDA\n         Time to collect the rent, Sister.\n\n                          JOAN\n         Of course.     Come with me, please.\nJoan leaves, followed by The Goonda. Max works care-\nfully at the fine line of scabbing on Poomina's scar...\nbut then something takes his attention.\n\nACROSS THE COURTYARD\nManooj, with a small tin of food, looks this way and\nthat... and then sneaks into the shed.\n\nEXT. SHED - DAY\nWe hear a, TAP, TAP, TAP. The door is half open. The\npadlock is hanging on its chain. Max opens the door.\n\n                                                       97.\nINT. STORAGE ROOM\nStartled, frightened, Hasari presses himself against the\nwall, as does Manooj. Hasari is wearing a wet dhoti,\ncaught in the middle of straightening the wheel rim of\nthe old rickshaw.\n                       HASARI\n         Close the door!\nMax is very surprised but, needless to say, pleased.      He\nlooks at the rickshaw, looks at Hasari.\n                       HASARI\n         Close the door. The Godfather\n         has more eyes than a pineapple.\n\nMax quickly closes the door. The half light is broken\nby thin beams of light that dance with dust.\nHasari studies Max a moment, then moves to put the first\nwheel on. Instinctively, Manooj moves to his side, takes\nhold of the rickshaw so Hasari can slip the wheel on.\nHasari nods and goes for the other wheel. Manooj moves\naround to the other side, hefts the carcass. Hasari\nslips on the second wheel. Hasari looks at Max. Max\nbrings his hands together and starts to go.\n                       HASARI\n         I was saying to Manooj that if a\n         man bows down too many times,\n         there will come a day when he will\n         no longer be able to stand upright.\nThe two men look at each other... and then Hasari gets\non with his work.\n                       MAX\n         I promised Manooj and Shambu I'd\n         take them to the movies. Is it\n         all right?\n                       HASARI\n                (a beat)\n         If a man makes a promise...\nMax brins his hands together and starts for the door.\nHasari picks up one of the worn seat boards.\n\nINT. MOVIE THEATER - NIGHT\nWe're TRACKING WITH a moving bag of peanuts behind a row\nof boy's heads. On the screen in front of them, a \"medi-\neval era\" sword battle between the great Kumar Kapur and\na legion of bad guys.\n                                            (CONTINUED)\n\n                                                       98.\nCONTINUED:\nWe hear the sound of CRACKING NUTS as we MOVE FROM Manooj\nto three kids we've seen in the neighborhood (two boys\nManooj's age and Shoba, who's Shambu's age) and then to\nShambu, each kid dipping into the bag in his turn.\nFinally: Max's (and on the other side of him, Amrita\nand Poomina.) The bag arrives... empty.\n                       MAX\n                (whispering)\n         Thanks, guys. Who wants to go for\n         more peanuts?\nNo one. We're talking about rapt attention.   We hear\nNUTS CRACKING. Max smiles.\n\n\nEXT. STREET - NEAR CITY OF JOY - NIGHT\nMax and the boys walking home after the movie, the boys\ndancing around each other, acting out the fight sequences,\nall of the sword-fighting against Max, who battles them\nall over the street, in and around cars, Poomina and Amrita\nlooking on shyly, as El Max fights to save their honor.\n                       MANOOJ\n         I can't decide if I want to be\n         Kumar Kapur or a doctor.\n                       MAX\n         Ha ha! You can be both! Manooj\n         Pal, swashbuckling physician!\n                       MANOOJ\n         You're so much fun, El Max. I\n         wish my daddy were as much fun as\n         you.\n\nMax stops the fight, takes Manooj by the shoulders.\n                       MAX\n         I wish my father loved me like\n         your father loves you. Your dad's\n         a very special man. And now, en\n         garde!\nAs the battle continues, the bright beams of a truck\ncome at them.\n                       MAX\n         Time out, men. Off the street\n         till this truck passes.\n                                          (CONTINUED)\n\n                                                       99.\nCONTINUED:\nThe kids move toward the wall of the building they're\npassing, but the truck seems to turn toward them, seem-\ning not to intend to pass, but to hit them.\nThe look on Max's face lets us know he senses something\nterrible is in the offing here. He shouts for the kids\nto get out of the way, shoving the kids closest to him\ninto a doorway. He turns to Shambu, who's behind him,\ncalls to him.\nBut in a panic, Shambu doesn't move into the shelter   of\nthe building on his right... but tries to run across   the\nstreet. Max leaps for the little boy too late... as    the\ntruck just misses Max and clips Shambu hard, sending   the\nlittle boy flying.\n\n\nEXT. SQUARE - NIGHT\nManooj runs   ahead of everyone as he charges into Ram's\nhut, crying   for his father. Behind Manooj come the\nothers, Max   carrying Shambu in his arms. Hasari and\nAloka, Ram,   Joan, others in the square hurtle out of\ntheir huts.\n                       MAX\n         I can't do anything here. He's\n         got a compound fracture, he\n         hemorrhaging. We've got to get\n         to a hospital -- now!\n                       JOAN\n         You'll never get a taxi at this\n         hour.\n\n\nEXT STREET - HASARI'S FEET - DAY (EARLY EVENING)\nHe pounds along,  the wheels wobbling and squeaking,\nurging people out  of his way. Max runs alongside Hasari.\nAloka sits on the  seat with Shambu, whose quiet moaning\nfills her ears.   Blood drips down the rickshaw.\n\nEXT. PARK STREET - FROM THE RICKSHAW - DAY\nSeveral taxis waiting for clients outside a row of\nrestaurants. Hasari and Aloka watch as Max argues with\nthe drivers. They won't take a bleeding passenger.\n\nSAME STREET - MOMENTS LATER\nThe race to the hospital continues.\n\n                                                       100.\nEXT. MEDWAR PINE MEMORIAL HOSPITAL - NIGHT\nThe arrive at the gates of the huge, Victorian hospital.\nPeople sleep outside the gates.\n\nINT. HOSPITAL - CORRIDOR - SIDE ROOM - DAY\nThe wards are full, as are the corridors. Patients on\nbeds and stretchers everywhere. Most have at least one\nmember of their family to look over them. In a side\nroom, Max is arguing with a porter who tells him he can't\nhelp him.  Max slaps some rupees into the porter's hand,\ntells him to take him to the person in charge.\nShambu is fading. Aloka smooths the sweat from his brow,\ntrying to keep Shambu alive by force of will and love.\nThen Max is back, standing over her with another man. It\nmay take a moment before we recognize the ATTENDANT from\nthe Blood Bank.\n                          MAX\n            They'll admit him, but we have to\n            pay for the blood. I gave him all\n            I had. He wants more. Do you have\n            anything?\n                          ALOKA\n            Sister Joan gave me this.\nAloka holds out a fistful of rupees. The Attendant blows\nthrough his lips, indicating it's a paltry sum. Max\ngrabs the money and shoves it at the Attendant.\n                          MAX\n            We haven't got any more!\nThe Attendant doesn't move... until he sees Max is about\nto explode.\n                          MAX\n            If this child dies while you\n            stand here, I'll kill you.\nThe Attendant is smart enough not to push any further.\n                          MAX\n            Now, I need an X-ray room and I\n            need an O.R. nurse.\n                          ATTENDANT\n            Not possible. You can't give\n            care, you're an American. You\n            must be an Indian doctor.\n                                              (CONTINUED)\n\n                                                       101.\nCONTINUED:\n                       MAX\n         Then take me to one!\nAs Max takes flight with the Attendant, Aloka strokes\nShambu and Hasari hovers. We CLOSE IN ON Shambu's\ninanimate face and HOLD a moment.\n\nANOTHER ANGLE\nMax hurtles down the corridor with a young INTERN in\ntow. Almost a kid, he's been up for days. But he's\ngoing to help.\n                       INTERN\n         This way, please.\nMax scoops Shambu up and rushes down the corridor behind\nthe Intern, leaving Hasari and Aloka looking after him.\nHis arm comes around her shoulders.\n\nEXT. HOSPTIAL - DAY (DAWN)\nHasari and Aloka wait.   People are starting to move about.\n                       HASARI\n         You're my wife, Aloka, you and my\n         children are all my wealth. But\n         if Max Daddah and Big Sister Joan\n         have need of you, you may go to\n         them.\nMax comes out of the hospital.   The two Pals stare at\nhim.\n\n                       MAX\n         We pinned his leg. Couple of\n         months, he'll be better than\n         ever. They want to keep him\n         today. We're a good team.\n         Gimme five.\nHe smiles, holds out a palm for them to slap. They\nlook at the palm, unsure what this means. Yet, each\ntakes Max's hand.\nEXT. CLINIC - COURTYARD - DAY\nThe whole community is here, around the tree.\n                                           (CONTINUED)\n\n                                                      102.\nCONTINUED:\n                       JOAN\n         I don't think it was an accident.\n         I think they were aiming for Max.\n         So, what we have to ask ourselves\n         is whether his presence is\n         endangering all of us.\n                       ANOUAR\n         Even from my low vantage point, I\n         know this: It's the son. He's\n         mad.\n                       HASARI\n         Max Daddah is our friend. If\n         they're trying to harm him, then\n         they're trying to harm all of us.\n         We must stand by him as one.\n\nINT. SHED - CLOSE ON TWO PAINTBRUSHES - NIGHT\ndip into a little box of paints. The boys look on as the\ntwo men paint an intricate design on the shafts. Shambu\nsits in the rickshaw seat. He wears an ankle to hip\ncast. Manooj is spelling words and urging Shambu to\nfollow suit. Aloka is putting out a tray of food. Ram,\nRamatullah, and Chomotkar slip in, quickly close the\ndoor. The two pullers focus on the rickshaw, Ram on Max.\n                       RAM\n         Doctor Daddah, please, very\n         important, only one moment.\n                       MAX\n         This is going to cost me every\n         rupee I didn't make today.\n\nRam thrusts an envelope into Max's hand.\n                       MAX\n         A letter from your wife.\nRam nods nervously. Max looks at the postmark as he\nslices it open with a finger.\n                       MAX\n         This is postmarked six weeks ago.\n                       RAM\n         So?\n                                           (CONTINUED)\n\n                                                      103.\nCONTINUED:\n                       MAX\n         So, what have you been doing --\n         incubating it?\n                          RAM\n         I was afraid.\nRam waits, his hands twisting each other.\n                       MAX\n         'My dear husband...'\n                       RAM\n         Oh that's very hopeful so far!\n\n                       MAX\n         'Your words brought tears of joy\n         to my arid eyes.'\n                       RAM\n         Oh, I'm in love! My words\n         brought tears to her arid eyes!\n                (then fearful)\n         What does that mean -- arid?\nManooj throws his hand up.\n                          MANOOJ\n         I know!   Dry.\n                       MAX\n         Correct. Her eyes were dry, your\n         letter irrigated them.\n                          RAM\n         Aaah!\n\nHe snatches the letter, crushes it to his heart.   Notices\nthe finish work on the rickshaw.\n                       CHOMOTKAR\n         This is a puka nasgar. What a\n         curse that you can't use it.\n                       HASARI\n         I'm going on the streets tomorrow.\nThis gets everyone's attention.    The pullers shake their\nheads, they're worried for him.\n                       MAX\n         Listen. I don't want you to think\n         I'm crazy, but I don't think that\n         truck was an accident.\n                       (MORE)\n                                          (CONTINUED)\n\n                                                     104.\nCONTINUED:\n                       MAX CONT'D)\n         I think Ashoka was after me. You\n         can bet he'll be after you too.\n                       HASARI\n         I'm going to speak to his father.\n                       MAX\n         Can I go with you? I'll go with\n         you. Can I go with you if I shut\n         up?\nA beat... and Hasari gives him a small nod.\n\n\nEXT. GODFATHER'S HOUSE - DAY\nGhatak is literally carried out of the house by an\norderly and placed into his car. There's a driver\nand there is the Goonda. They start down the street.\nWe're WITH the car. Suddenly, the driver slams on the\nbrakes and from:\n\nANOTHER ANGLE\nWe see Hasari and Max blocking the street with the new\nrickshaw. The Goonda jumps out of the car, comes\nthreateningly at Hasari.\n                       HASARI\n         Babu, please, I beg you, hear\n         my words!\nAs the Goonda is about to land on Hasari we hear a\nfeeble...\n\n                       GHATAK\n         Wait.\nThe Goonda backs off. The Godfather waves Hasari and\nMax close. Hasari brings his gleaming rickshaw to the\nwindow of the car, Max at his shoulder.\n                       HASARI\n         May I say first, Babu, I wish you\n         long life and good health.\n                       GHATAK\n         Acha! They take me now to the\n         scientists. They stick needles in\n         me, take pictures of my insides,\n         study them, and then tell me what\n         I know.\n                                          (CONTINUED)\n\n                                                    105.\nCONTINUED:\nThe Godfather stares at Hasari, flicks his eyes at Max.\nWaits.\n                       HASARI\n         When you gave me work, I swore I\n         would be as your youngest brother.\n         Your son thinks I have been\n         disloyal. He took my rickshaw.\n         With my friend, I have remade this\n         one. I beg you to let me go again\n         onto the streets. I have my family.\nThe old man looks at the rickshaw, at the obvious care\nthat went into its renovation, at this unlikely team\nof refurbishers. He reaches a shaking  hand out toward\na shaft. Hasari brings it close. The   old man rubs the\nshaft.\n                       GHATAK\n         It is very beautiful.\n                       HASARI\n         Thank you, Babu.\n                       GHATAK\n         If I may say, it has an allure.\n                       HASARI\n         An allure, Babu -- thank you.\nThe Godfather stares at Hasari, then at Max.\n                       GHATAK\n         The world is chaos. We struggle\n         to build something permanent,\n         then our bodies betray us, our sons\n         betray us.\n                (to Hasari now)\n         Yes, you may take your rickshaw\n         out. If you can face up to my son.\nThe Goonda gets back into the car and the car pulls away\nand we are left with Hasari and Max as moment.\n\nEXT. SKELETON WAREHOUSE (MITRA & CO) - DAY\nHasari enters.\n\nINT. MANAGER'S OFFICE - DAY\nThe manager stares at Hasari, as he consumes a pot of\nrice and vegetable curry. Gangooly hovers like a crow.\nHasari stares at the contract before him.\n                                           (CONTINUED)\n\n                                                     106.\nCONTINUED:\n                       HASARI\n         If a man dies and he's not burned,\n         what do you think becomes of his\n         soul?\nThe manager turns his palms up, continues chewing.\nHasari stares through the window at the row of skeletons.\n                       HASARI\n         I must provide for my family.\n                       GANGOOLY\n         Oh, it's a noble fate. If indeed\n         your wheel ceases to turn, you will\n         help educate somewhere in this\n         great world a fine doctor.\nHasari bends to the contract and laboriously signs his\nname.\n\nEXT. GODFATHER'S HOUSE - DAY\nHasari arrives to an outcry of anger. There are several\ndozen rickshaws. Among the passersby, we see umbrellas,\nas the people on the street try to combat the incredible\nheat.\n                       HASARI\n         What's going on?\n                       CHOMOTKAR\n         The Godfather ill! The son is\n         raising the rent!\nAshoka is on his front steps with a loudspeaker before a\ngrowing crowd of pullers. He's backed up by the Goonda\nand a dozen of his thugs. The loudspeaker lifts\nAshoka's voice above the anger.\n                       ASHOKA\n         Do you know how much it costs to\n         change the spoke in a wheel? Or\n         how much baksheesh I have to pay\n         the police?\nImpulsively, Hasari moves forward. Cries from pullers:\n\"Who will be the victims of this madness? You?\" \"Hell\nno!\" \"You don't need the six rupees each old crate\nbrings you per day to fill your belly! For us, it means\ndeath!\" The street is so packed with rickshaw and\npullers now that cars can't get through. A chorus\nof HORNS HONK; drivers scream.\n                                            (CONTINUED)\n\n                                                       107.\nCONTINUED:\n                          RAMATULLAH\n            We haven't been breaking our\n            backs between the shafts of our\n            rickshaws in order to weep for\n            you!\nHasari continues forward, his eyes on Ashoka.\n                          CHOMOTKAR\n            The only thing that matters is the\n            bundle of rupees we take to the\n            munshi each month to feed and to\n            answer the daily needs of our\n            children!\n\nRASSOUL steps up on a telagarhi with a loudspeaker.\n                          RASSOUL\n            Listn to me! Listen now! Listen\n            to me!\n                   (when the pullers\n                   quiet)\n            Friends! I ask you to vote for an\n            unlimited strike. Inkalabad\n            zindabad! Long live the\n            revolution! Rickshaw Workers Union\n            zindabad!\nA strike? No income at all? The slogan is taken up\nby a small percentage of the assemblage. Fear and\ndoubt on many faces.\n                          ASHOKA\n            That's what I thought. All\n            right, get to work! Customers\n            are waiting!\n\n\nON HASARI\nSomething detonates in him and he jumps onto the tela-\ngarhi and grabs the microphone from Ashoka. Police\narrive in vans.\n                          HASARI\n            Friends! The Godfather at least\n            is a caring man! This one,\n            though, the son --\nA signal from Ashoka and one of the thugs knocks Hasari\ndown.\n                                              (CONTINUED)\n\n                                                        108.\nCONTINUED:\n                         ASHOKA\n           We helped this man! We gave  him\n           a job, a place to live! This  is\n           how he shows his gratitude.  Get\n           on the streets now! Or turn  in\n           your machines!\nHasari gets up and tries to speak.\n                         HASARI\n           Friends -- don't! If we stand --\nHe gets hit again. A number of the pullers come forward\nand a riot starts. The police move in, beat and arrest\nmany of the demonstrators. Ramatullah and Chomotkar\ntry to help Hasari, but they are descended on by cops\nwho hurl them aside and beat Hasari senseless until\nthe:\n                                              SCREEN GOES BLACK.\n\nFADE IN:\nINT. BONSAL COURT - DAY\nBirds flying  below ceiling. The room has a barred cage\nrunning all  around its edge; the cage is filled to near\noverflowing.   Hasari stands before the JUDGE, his face\ncovered with  blood, his body a mass of aches and welts.\nAt the back  of the room, Max and Aloka; elsewhere,\nAshoka, the  Goonda, and several of his thugs.\n                         HASARI\n           The life of a rickshaw puller is\n           not one a man would choose if he\n           had a choice. Our feet blister\n           and burn up from the boiling\n           asphalt, our noses burn from the\n           fumes of countless motor cars and\n           buses, our backs curve permanently\n           from the loads we carry hour after\n           hour, day after day. But I am\n           proud to be one of the human horses\n           who carry my countryman from place\n           to place and I am thankful for the\n           opportunity to make a living. But\n           I will not keep silent anymore and\n           I will not be cheated and\n           threatened anymore. Life is hard\n           enough. No more.\nRamatullah starts to applaud.   Rassoul follows suit.\nThe Judge bangs his gavel.\n                                              (CONTINUED)\n\n                                                        109.\nCONTINUED:\n                       JUDGE\n         Silence!\n                (when it's silent)\n         This man will be permitted to\n         use his rickshaw without let or\n         hindrance. And I will make a\n         restraining order against Mr.\n         Ghatak.\nCheers from the pullers.   The Judge bangs his gavel.\n                       JUDGE\n         I haven't finished these\n         proceedings. For his part in this\n         disturbance, I fine the defendant\n         50 rupees.\n                       HASARI\n         Fifty rupees, Your Honor?\n         That's --\n                       JUDGE\n         Pay at this time or spend seven\n         days in jail!\nSeven days in jail will cost him far more than fifty\nrupees. As he reaches into his pocket for his screw\nof money, a hand suddenly protrudes into the cage through\nthe bars.\n                       RAMATULLAH\n         Hasari!\nAnd now another hand with several rupees reaches through.\n                       RASSOUL\n         Hasari!\nNow a dozen voices call his name and a  dozen hands reach\nthrough the bars with rupees clutched  in their fists and\npress the money into Hasari's hands.   The Judge, Max and\nAloka, and certainly Ashoka watch this  in amazement. The\nJudge bangs his gavel.\nMax turns, shoots a little finger gun and winks at Ashoka.\n\nCLOSE ON ASHOKA\nON his face, we see pure hatred for these two men.\n\n                                                    110.\nEXT. CITY OF JOY - DAY\nAmrita, Manooj, and Shambu. With them, Subash flirting\nwith Amrita, incurring the wrath and admiration of her\nbrothers, causing her to flush.\nTHUNDER sounds. They all look up. Rain starts to fall.\nPeople run outside of workshops and huts, crying, \"The\nrains, the rains.\" Suddenly, a THUNDERCLAP shakes the\nearth and rain begins to bombard them. The rain falls,\nthe WIND HOWLS, and people in the lane are dancing,\npraising the beginning of the monsoon season. Men tear\noff their shirts, women rush out fully clothed, singing.\nSwarms of naked children run about. The kids run toward\nthe clinic/school.\n\n\nEXT. CLINIC COURTYARD - DAY\nHasari is locking his rickshaw into the shed. Staff and\nseveral patients come out of the examining rooms -- Joan,\nAloka, Sunil, Anouar, Poomina. Margareta and her\nstudents, a new teacher, Bandona, her students come out of\nthe classrooms... They're all swept up in dancing, Joan's\nmetal cross jumping about as if it were beating out time.\nFrom his balcony, Max emerges with his trumpet and plays\nthe first bars of \"Singin' In the Rain.\" Everyone looks\nhis way; he begins to hum and sing as he jumps over the\nbalcony to the ground and takes off in a wild, impro-\nvished, but damn good version of Gene Kelly's dance in\nthe rain, bringing Anouar on his cart in as his dancing\npartner. Everyone in the courtyard crowds around them,\nlaughing and encouraging the dancer/singers on. The\nnumber builds to an extraordinary climax with Max sliding\nthrough mud to an exquisite finish at Joan's feet.\nThere's thunderous applause.\n\n\nINT. CLINIC - NIGHT\nRain. Max, The Pals, Ram, Joan, Anouar, Meeta and the\nBaby, Poomina, Saladdin, Mehboub, Ashish, Shanta,\nMargareta, Bandona, and the other members of the commit-\ntee sharing a meal.\n                       HASARI\n         Really -- a boyfriend, Amrita?\n                         AMRITA\n         No!\nAmrita whacks Manooj.\n                                          (CONTINUED)\n\n                                                       111.\nCONTINUED:\n                         MANOOJ\n           Yes, she does. His name is Subash\n           Ghosh. His father owns the workshop.\n                         HASARI\n           Is there someone you care about?\nThe look in Amrita's eyes tells us indeed there is.\nHasari smiles at Amrita and then at Aloka.\n                         HASARI\n           Then I must speak to his father\n           and I must complete your dowry.\nAmrita squeezes close to her mother.   This is serious\nand joyous.\n                         HASARI\n           You will make people sigh at how\n           beautiful you are. And I shall\n           drop tears of joy.\n                         RAM\n           At my wedding I became so\n           frightened, my father gave me\n           things to drink to calm me down.\n           I went out to piss and fell asleep\n           under the village tree. When I\n           woke I thought it was the tree I'd\n           married. I still love that tree.\nThe laugh. But Hasari's attention is on his daughter.\nHe reaches a loving hand to her.\n\nINT. GREEN ACRES - MAX'S BATHROOM - TUB FAUCET - NIGHT\n\nA rag has been wrapped around the faucet and water runs\nslowly and silently down into the nearly filled tub. The\nscene is illuminated dimly by a flashlight with fingers\nover the beam.\n\nON MAX\nHe sleeps. Suddenly he's grabbed, his eyes spring open\nin fear. Hands yanks him out of bed, slam him up against\nthe wall, then hurtle him across the room and into:\n\nBATHROOM\nWhere the tub has been filled. His head is slammed down\nunderwater and he's held there struggling.\n                                              (CONTINUED)\n\n                                                    112.\nCONTINUED:\nHis head is yanked up and through bleary eyes he sees a\nknife at his throat and the Hewbrew letter chai dangling\nfrom the knife - wielder's neck, illuminated by a\nflashlight.\n                       ASHOKA\n         Go home, Doctor.\nBefore he can respond, he's slammed down into the tub of\nwater again and held there until it seems his lungs will\nexplode. Then he's dumped backward, gasping for breath.\n\nEXT. CITY OF JOY - SQUARE - NIGHT\n\nMax on the run through the rain, carrying his belongings.\n\nCLINIC\nHe pounds through the puddles, past a sleepy old watchman,\nand through the gate.\n\nINT. COURTYARD - NIGHT\nHe bangs on Joan's door. She opens the door in her Indian\npajamas. One look at him...\n                       JOAN\n         What's happened?\n                       MAX\n         Ashoka ordered me to go home.\n         Well, I've come home.\n\nA beat. She steps aside, he steps in, and the door closes\nhim safely inside.\n\nEXT. PARK CIRCUS - DAY\nThe rickshaw station. The  rain pours down. People\nclambor for rickshaws. The  line moves forward as fast\nas the pullers can take on passengers. Hasari, Ram,\nRamatullah, Chomotkar look at the stalled buses, the\nstreetcars, the taxis, the private cars.\n                       CHOMOTKAR\n         What a joy it is to survey this\n         disaster! We will all make a\n         fortune!\n                                           (CONTINUED)\n\n                                                     113.\nCONTINUED:\n                       HASARI\n         The monsoon is the great Durga's\n         gift to the human horse!\nHasari glances at Ram, who isn't a part of the joking.\n                       HASARI\n         What's the matter?\n                       RAM\n         I'm wet and I'm cold. Your\n         daughter is getting married. Time\n         is passing. I want to go home to\n         my wife.\n\nChomotkar touches Hasari, nods across the street.   There,\nwe see the Goonda and two thugs.\n                         RAMATULLAH\n         Hasari!\nIt's Hasari's turn.   He can't stay to talk with Ram now.\nHe has to go.\n                       MARWARI #4\n         How much to the market?\n                         HASARI\n         Eight rupees.\n                        MARWARI #4\n         What!   I won't pay it!\n                       HASARI\n         Who else needs a ride?       I am\n         available at a price!\n\nSeveral others crowd and shove toward him.\n                        MARWARI #4\n         No!   Take me -- I'll pay, let's\n         go!\n                       HASARI\n         The price just went up!       Ten\n         rupees! In advance.\nThe Marwari hesitates only as long as it takes him to dig\nin his soaking wet pants and to slap the bills into\nHasari's hand and climb aboard. Hasari sets out with\ngreat difficulty -- and greater determination -- through\nthe floodwaters, flicking his eyes at the Goonda as he\ngoes.\n\n                                                     114.\nEXT. WEDDING SHOP - DAY\nWater  pours down. FROM HERE we see Hasari inside, putting\nmoney  down in front of the shop owner and then hustling\nback  into the rain and taking up his shafts. We WATCH the\nowner  look after him with a touch of disdain as he comes\ninto  the window and takes down the beautiful green and\ngold  sari.\n\nEXT. CLINIC - GUTTERS - NIGHT\nWater pouring from above; the gutters overflow with refuse.\nWe PAN UP to the clinic.\n\nINT. CLINIC COURTYARD\n\nWater pouring off the room into the courtyard. Hasari\nlocks his rickshaw into the shed and turns out, attention\nto Max, Aloka, Joan, Poomina, Margareta, Mehboub, several\nothers trying to patch leaking roof tiles and keep\nsupplies high and dry.\n\nINT. CLINIC ROOM\nHasari enters. Max looks at him, doesn't like the look\nof the obviously exhausted man.\n                        HASARI\n          How can I help?\n\nEXT. CIRCULAR ROAD - FISTFUL OF RUPEES (RUNNING MONTAGE)\n- DAY\nAn Anglo couple jockeying for preference. Hasari selects\nthem from a crowd. This is the beginning of RUNNING\nMONTAGE.\nA)   He runs AT us from different directions with riders\n     -- pushing, pushing -- the water getting higher, our\n     FOCUS VARIOUSLY IN NORMAL AND SLOW MOTION ON his\n     feet, his tensed muscles; for a moment, we hear only\n     his breathing, the sound of his feet on the pavement,\n     the RAIN AGAINST the CANOPY of the rickshaw.\nB)   He drags up with an entire, well-to-do family of six,\n     packed into the rickshaw.\nC)   He stumbles to a stop outside the emergency entrance\n     to the hospital, carrying a mother and her sick\n     child.\n                                           (CONTINUED)\n\n                                                        115.\nCONTINUED:\nD)   An upper-crust Brahmin dressed in crisp white, an\n     umbrella protecting him against the harsh elements.\nE)   Four uniformed school children huddled, laughing\n     together under the rickshaw's canopy.\n\nINT. LEPER COLONY - MEETA'S ROOM - DAY\nThe rain continues, as does the work in the clinic. Max\nis working on Anouar, Aloka assisting. Meeta and the\nbaby (now 6 months old) in the b.g.\n                          ANOUAR\n            I think Aloka would have a gentler\n            touch than you, Max Daddah. Maybe\n            she should perform this surgery on\n            her own.\nAloka ducks her eyes, embarrassed.\n                          MAX\n            Last time you told me you were\n            more than two women could manage.\n                          ANOUAR\n            Yes, but given a choice between one\n            and none, I will accept the one.\nMax lifts Anouar off the table and places him on his\ncart.\n                          MAX\n            Okay, you ought to be good for\n            another few days. Send in the\n            next patient.\n\nAnouar scoots out. Max and Aloka both turn to the\ninstruments lying on the table and knock a pair of\nscissors to the floor. Simultaneously, they bend to pick\nit up and bang heads.\n\nLOW ANGLE\nThe first   impulse of each is to touch the other's head.\nBut almost   simultaneously, their hands freeze short of\ntouching.    Several months ago, Max might have tried to\nkiss her;   now, though, there is friendship and affection.\nFROM here,   we see a pair of bare feet. We COME WITH Max\nand Aloka   UP.\n\n                                                       116.\nANOTHER ANGLE\nShoba, a deeply concerned look on his face. Slowly his\nhands come forward, holding his parrot, with a broken\nwing. He puts the parrot on the examining table.\n\nINT. POST OFFICE - DAY\nHasari seals a letter and a money order into an envelope,\nseals, and puts it into the slot. He is  clearly\nexhausted. Outside he can  see two Sikh merchants at his\nrickshaw, looking around in the rain for him. He hurries\ntoward the door.\n                        HASARI\n         Here!   I'm here!\n\n\nINT. SUBASH'S HOUSE - NIGHT\nAloka and three women huddled beside a window, Amrita\nhalf hidden behind them. We PAN ACROSS a staircase TO\nanother window, THROUGH which we see a doorway. In the\ndoorway, Subash turns to smile a shy smile at Amrita; he\nshrugs. PAST him now, we see Hasari facing SUBASH'S\nFATHER and three UNCLES, surly men with hair matted with\nmustard oil. The Ghoshes are all seated on low chairs\nand stools. Hasari is standing.\n\nINT. ROOM - NIGHT\nMr. Ghosh and the Uncles stare at Hasari, who stands\npolitely and hopefully before them.\n                       MR. GHOSH (SUBASH'S FATHER)\n         You're a rickshaw puller, am I\n         correct?\n                       HASARI\n         Yes, that's correct.\nHe looks at his brothers, on either side.    They look at\nhim.\n                       MR. GHOSH\n         And I a partner in the workshop\n         where your daughter is employed.\n         Were you aware of that?\n                       HASARI\n         Yes, yes, I was, my daughter told\n         me, thank you.\n                                            (CONTINUED)\n\n                                                         117.\nCONTINUED:\n                       MR. GHOSH\n         Yes, well then, perhaps you can\n         tell me why I would permit my son\n         to marry your daughter.\nMr. Ghosh raises his palms.    It's all over as far as\nhe's concerned.\n                       UNCLE #1\n         Just a moment, please.\nThe brothers huddle, whisper just loudly enough for\nHasari to hear.\n                       UNCLE #1\n         Are you saying there's no way\n         you'd consider this match?\nMr. Ghosh shakes his head, shrugs his palms.\n                       UNCLE #1\n         Perhaps some inducement?    Would\n         that be of any help?\n                       MR. GHOSH\n                (considering this)\n         What could he possibly offer?\n                       UNCLE #1\n         Probably nothing. But perhaps,\n         in fairness, we should find out.\nMr. Ghosh shrugs.    The huddle breaks.   All five men\nstare at Hasari.\n\n\nEXT. STREETS - DAY\nHasari, mouth half open, flecked with spume, pulls a\nhuge Marwari. He's pouring sweat, his eyes are blood-\nshot. He has never looked more like a horse.\nThey arrive at a cross street. The Marwari gets down\nand pays Hasari. Hasari slumps against the rickshaw\nand, while he awaits his next rider, counts his crum-\npled pile of notes and coins.\n\nEXT. CLINIC - DAY\nMax, Joan, Aristotle John, Margareta, Mehboub, perhaps\na dozen others trying to raise the level of the low\nwall at the entrance with bricks. The wall caves in.\nOther people in the neighborhood rush to rebuild it.\n                                             (CONTINUED)\n\n                                                       118.\nCONTINUED:\n                       MAX\n                (shouting to the\n                 others)\n         My dear friends, it's just\n         occurred to me what inspired me\n         to stay here.\nThinking he's about to make some cogent remark about\nthis unified effort...\n                       MARGARETA\n         What's that, Doctor Big Brother?\n                       MAX\n         The opportunity to acquire\n         waterfront property at a reasonable\n         price.\nJoan begins to laugh; the others don't get it, query\neach other as to what's funny about that.\n                       JOAN\n         I hate to admit it, junior, but\n         that was actually quite witty.\nShe whacks him on the shoulder with a wet, muddy paw.\n                       JOAN\n         Ut-nobody laugh; it's a natural\n         disaster -- we have guests.\nEveryone turns to...\n\nANOTHER ANGLE\n\nManubai and Ravi, their car parked at the entryway to\nthe clinic. A big puddle separates them.\n                       MAX\n         I'd throw my cape down, but I'm\n         all out of dry capes.\nHe sloshes through the water to them, wiping his muddy\nhands on his pants. He offers a semi-clean hand to\neach in turn.\n                       MAX\n         It's very nice to see you.   Both\n         of you.\n                       RAVI\n         We heard you were still here.\n         Vijay wanted to send some things.\n                                             (CONTINUED)\n\n                                                       119.\nCONTINUED:\nShe indicates the car, which is packed with dry food\nand such.\n                       MAX\n         Shall we unload the car?\n                       RAVI\n         Yes, yes, by all means.\nMax whistles, indicates the car. People come and start\nunloading it, Ravi showing the way, leaving Max and\nManubai alone a moment, Aloka flicking her eyes at the\ntwo of them.\n                       MANUBAI\n         I'm surprised. I really didn't\n         think you'd stick it out.\n                       MAX\n         People grow older; sometimes they\n         even grow up.\nHe smiles a sweet smile at her.    She smiles back at him.\n\nEXT. MUD BANK - WIDE SHOT - DAY\nAnouar on Said's shoulders. The big mute runs, followed\nby Hasari and a phalanx of rickshaw pullers: Chomotkar,\nRassoul, Ramatullah-Joan, Aloka, Manooj, several others\nin the rickshaws, Max and Sunil, each with his doctor bag\n-- all of them running in silhouette along the embankment\nin the rain.\n                       ARISTOTLE JOHN\n         Where can we take them? We can't\n         take them back to the clinic. No\n         one will put up with it.\n                       SALADDIN\n         We can't let them drown, can we?\n         Eh, Max Daddah?\n\nEXT. LEPER COLONY - DAY\nThe leper colony is submerged. The parents have put\ntheir children on the roofs and the relatively able-\nbodied lepers are piling charpoys one on top of another\nto protect the sick and the infirm. Meeta and her baby\nare on a roof. The mud bank is too slippery to get the\nrickshaws down and back up.\n                       HASARI\n         It's too deep!\n                                            (CONTINUED)\n\n                                                       120.\nCONTINUED:\nA beat.\nEXT. LEPER COLONY - PAIR MUDDY, PARTIAL HANDS - SAME\nDAY - SOME MINUTES LATER\nA leper clings to a rope as several of the human horses\npull him and others up the mud bank.\n\nANOTHER ANGLE\nMax, Hasari, Rassoul, and Chomotkar up to their necks\nin water; Hasari and Rassoul have a door on their\nshoulders; on top of the door, a sick leper woman.\nMax is lifting one child, then another onto the door.\nThe two pullers make their way slowly toward the mud\nbank.\n\nON MUD BANK\nAloka, Joan, helping lepers into rickshaw.\n                        MEETA\n          Anouar!\n                        ANOUAR\n          Max Daddah!\n\nON MEETA AND BABY\nThe hut starts to come apart under them. Max and\nChomotkar quickly move to the house with another door.\n                         MAX\n          We're here!   We're here!\nChomotkar holds the door up as Meeta holds the baby\nout in the direction of Max's voice. Max catches the\nbaby as the house slips down, then grabs Meeta, who\nclings to him.\n\nEXT. MUD BANK - DAY\nHasari pulling the lead rickshaw. Anouar on Max's\nshoulders, the two of them leading a terrible ensemble\nversion of \"Hound Dog.\" An air of festivity among\nlepers and rescuers.\nThey come to a bridge made of two planks over rushing\nwater.\n                                             (CONTINUED)\n\n                                                        121.\nCONTINUED:\nSeveral rickshaws go across but as Max and Anouar start\nover, suddenly the ground gives way beneath Max's feet.\nAnouar falls free; someone grabs him; but a blackish\nstream rushes into Max's mouth and in an instant he's\nswept beneath the gurgling filth. The density of the\nfilth makes his effort to surface ineffective. It\nlooks for all the world like he's going to drown.\n\nON OTHERS\nMax has disappeared. Instinctively, Hasari dives into\nthe maelstrom. He, too, disappears. After some moments,\nHasari surfaces, spitting the filth out of his mouth.\nHe dives again, comes up somewhere else. Dives a third\ntime. Is down. Is down. Is down. Then suddenly\nbursts out of the filth, dragging the unconscious form\nof Max Loeb into the air. More people have gathered.\nCries of:\n                          OTHERS\n            It's the doctor. Save Doctor Big\n            Brother!\nAloka passes a baby to someone and helps Hasari push\nMax up onto the bank. But now Hasari doesn't know\nwhat to do and turns to his wife.\nAloka quickly clears Max's mouth and begins to admin-\nister mouth-to-mouth resuscitation. She blows, she\nbreathes; she blows, she breathes. People crowd in.\nAloka blows, she breathes. It seems, though, that by\nhis stillness and by the looks on people's faces that\nMax is dead. Yet, more determined still, Aloka goes\non; blows, breathes...\n\n\nCLOSE ON ALOKA AND MAX\nAnd now Max gags,  his body erupts in spasm, and he\nexplodes a stream  of black liquid out of his lungs.\nAloka supports his  forehead as Max retches again and\nthen comes still.   A beat.\n\nINT. CLASSROOM - NIGHT\nWe PAN ACROSS members of our group -- lepers and\nnormals -- passing bowls of rice in a simple communal\nmeal, Singing a religious song quietly. On the floor\nin the b.g., Anouar is writing something on a slightly\ndamp stretch of cloth with a child's crayon. Said\ntakes the cloth and tacks it to the wall. What Anouar\nhas written is this, \"All that is not given is lost.\"\nEveryone in the room stares at the words.\n\n                                                    122.\nINT. CLINIC - MAX'S ROOM - NIGHT\nMax opens his eyes to find Joan, Hasari, Aloka, and the\nchildren keeping a vigil.\n                       MAX\n         Oh, Jesus, the guy went to sleep\n         when he was supposed to be working?\n         I gotta get up --\nHe tries to get up.   Joan pushes him back down.\n                       JOAN\n         Sshh, sshh, sshh! No heroics,\n         junior. Lay back. You're all\n         right.\n\n                       MAX\n         All right.\n                (a distant laugh)\n         Yeah, I am, I'm all right.\nHe is a little delirious. The boys come close, kneel\nat his side, instinctively reach out to him.\n                       MAX\n         Want you guys to know something.\n         About me. Wanted to be the\n         world's greatest heart surgeon,\n         just one better than my dad. Just\n         one. First time I'm the lead\n         surgeon on a case, the main guy, I\n         choke. Froze. The chief made me\n         step aside. My teacher. Had to\n         take over for me. Went into\n         radiology. Photography. Had to\n         have somethin' easy. No pressure.\n         Wasn't too nuts about myself.\n         Quit.\nHasari reaches out and touches Max, telling him with a\ntouch that it's all right. He stares up through bleary\neyes at all of them with utterly open love. Amrita\nholds out a small gift to him: It's a banana leaf,\nholding a small scoop of rice and surrounded by little\ndecorative leaves.\n                       MAX\n         You people... You...\n                (a beat)\n         I love you guys.\n\nEXT. RAM'S HUT - TWO MONTHS LATER - DAY\nA group gathered on a dry, sunny afternoon, peering into\nthe hut. We FOCUS on the growing flower in the tea\ncaddy in the window and then go THROUGH the window into:\n\n                                                       123.\nINT. PALS' ROOM - DAY\nHasari, Max (dressed quite India), the local Hara Giri,\nMr. Ghosh and the four Ghosh uncles crammed into the\ntiny room. Members of our group jam the doorway,\nspectating. The air is close.\n                       HASARI\n         I can offer no more    than I've\n         offered! No more!      All right,\n         I'll add two dhotis,    two vests,\n         and a punjabi. But     that's all.\nMr. Ghosh lights up a bidi, looks at his brothers,\nwrinkles his brows at Hasari.\n                          MR. GHOSH\n         That's all?     Did he say that's\n         all?\n                       HASARI\n         My daughter's qualities will make\n         up for what is lacking.\n                       SUBASH'S FATHER\n         Well, it won't do! I am firm in\n         requiring for my exceptional son\n         the bicycle, 1000 repees... and\n         one ounce of gold.\n                       HASARI\n         That's robbery! The child of a\n         rajah might be worth that, and\n         I'm not even sure of that!\n         Impossible!\nWe linger on Shambu a moment.\n\n\nINT. ST. PIUS SCHOOL - HEADMISTRESSES' OFFICE - DAY\nSister Cecilia, in full habit, looks over a sheaf of\ntest scores.\nThen she peers up at...\n\nANOTHER ANGLE\nManooj, seated between Hasari and Max.\n                          SISTER CECILIA\n         Well, indeed    I think Sister Joan\n         is right --    we've got a prospect\n         here. We'll     start you off with a\n         few classes;    if that works out,\n         we'll make a    proper student of you.\n                                             (CONTINUED)\n\n                                                       124.\nCONTINUED:\nHasari can't believe his ears.   Manooj sits frozen.   Max\ngrins.\n\nEXT. NARROW LANE - NEAR CITY OF JOY - DAY\nAmrita, Subash, and Shambu heading home from the work-\nshop. Shambu's cast is gone. Subash flirts with\nAmrita. They see Hasari, Max, and Manooj coming toward\nthem. Manooj runs to them, shouting that he's going to\nthe school; Amrita, Subash, Shambu congratulate him...\n\nHASARI AND MAX\n\nSuddenly the rickshaw wheels jam. They turn to find\ntwo men, one of whom has slammed a stick into Hasari's\nspokes. Retribution, it would seem, has arrived.\nThe kids stop, huddle instinctively together in fear.\nOur policeman disappears into a doorway as shutters\nclose up and down this little street. There are thugs\nat both ends. No one else is visible on the street.\nThe two men stare at Hasari a moment, smiling. Then\none gets into the rickshaw, crosses his legs as if he\nmight want transport. But now he whips out a narrow\nbladed knife, and still staring at Hasari, begins to\nslice up the newly covered seats of the rickshaw. Max\nlooks around, trying to cool things.\n                       MAX\n         Hey, come on, don't do this.\n                       VOICE\n         Well, what's the problem here?\nThey turn, Ashoka.   Behind him, the Goonda.\n                       ASHOKA\n         You've become very brave of late,\n         haven't you?\n                       MAX\n         Don't do this.\n                       ASHOKA\n         Oh, I do what I please. You see,\n         my father's dead, I'm in charge\n         now. So you will get off my\n         streets, you will leave my\n         country, and that clinic and\n         school will close.\n                                            (CONTINUED)\n\n                                                     125.\nCONTINUED:\n                         MAX\n         Why?\n                       ASHOKA\n         My father was weak. He let you\n         and your European friend give\n         these little people ideas. It's\n         over.\n                       MAX\n         You can't do this!\nHe takes no more than a step at Ashoka, a hand coming up,\nwhen he's hit hard from behind. Goes to his knees.\n\n                         MAX\n         Jesus Christ.\nHis hand comes away from the back of his head with blood.\nHe tries to rise and is hit again.\n                       HASARI\n                (to the kids)\n         Get back! Stay back!\n                       ASHOKA\n         No, no, come forward.   Come.\nAshoka glides toward the petrified Amrita. The Goonda\nremains unmoving, watchful. Ashoka puts out his hand\nwith its rings, and strokes Amrita's cheek.\n                       ASHOKA\n         What a little woman already, hey?\n                       HASARI\n         Please, don't touch her, Babu.\n                       ASHOKA\n         What did you say?\n                       HASARI\n         I said, Please, don't touch her.\nHasari glances over his shoulder, his eyes bouncing off\nthe Goonda's impassive face. Now, the knife comes out of\nAshoka's pocket, snaps open, glints in the light.\n                       ASHOKA\n         She's going to give someone a lot\n         of enjoyment. Yes.\n                                            (CONTINUED)\n\n                                                       126.\nCONTINUED:\nThere's a moment of unbearable tension as everyone, in-\ncluding the Goonda, realizes this man is out of control.\n                       ASHOKA\n                (to the Goonda)\n         He said 'please' didn't he?\n         'Please, don't touch her?'\nThe Goonda stares at Ashoka... And now Ashoka reaches out\nand we FOLLOW CLOSE on his hand as it moves ever so\nslowly through space to settle on Amrita's breast.\nAnd now Hasari explodes. He hits Ashoka. A hard punch\nto the chest. Ashoka stumbles and falls to one knee.\n\nThe Two Thugs make    a move to come to his rescue... but a\ncurious thing stops    them: the Goonda's arm, outstretched\nacross their path,    his eyes alerting them not to proceed.\nMax lurches to his    feet unsteadily.\n                       ASHOKA\n         Bhose, help me!\nHasari unloads a punch into Ashoka's face; Ashoka's nose\npours blood; he starts to whimper. He clutches Hasari\nhard to him. Holds him. Hasari struggles, slams his\npalm into Ashoka's chin, sending Ashoka to the ground,\nsending the knife skidding across the ground. Hasari\ngrabs the knife, straddles Ashoka, about to kill. But he\ncan't do it.\n                       HASARI\n         Life is hard enough.     No more.\n         Leave us alone.\nHasari backs off, leans against a wall, stares down at\nAshoka, his hands in tight against his body.\nManooj and Shambu stare at their father in awe.\nShambu sees something on the ground where the first blow\nwas delivered to Ashoka's chest. Everyone has moved\nslightly to one side. He bends and closes his fist\naround something.\nThe Goonda steps between Ashoka and Max and Hasari.\n                       GOONDA\n         You won't be bothered again.\nA look from the Goonda and the Thugs vanish, leaving\nAshoka cowering in a doorway on his knees.\n                                             (CONTINUED)\n\n                                                       127.\nCONTINUED:\nShutters start to open, people begin   to appear again in\ndoorways and windows.\nFearing for his life, Ashoka suddenly   bolts.\nMax is fixed on Hasari. He lets up a    scream of exulta-\ntion, his hand going out for a \"five\"   from Hasari. The\nkids charge toward Hasari.\nThen everyone freezes.\nHasari lists to his right side and blood starts to pour\nfrom the knife wound in his abdomen under his pressing\narm.\n\nEXT. MAX'S ROOM - UPSTAIRS BALCONY - NIGHT\n\nFrom here we can see Hasari on Max's cot under \"The Raft\nof the Medusa\" in the little room overlooking the street.\nOut here, the two doctors are alone.\n                         MAX\n           Why don't you go on home.   I'll\n           stay with him.\nSunil nods. Max grips Sunil's hand strongly. Sunil goes\ndown the steps. Max moves to Hasari's bedside. He\nwatches Hasari breathing. He looks up at \"The Raft of\nthe Medusa.\"\n\nINT. MAX'S ROOM - NIGHT (SEVERAL HOURS LATER)\nA thin stream of dawn light coming through the half-\nclosed shutters.\n\n\nFROM HERE - THE BALCONY\nThrough the open door, we can just see Joan, praying\nquietly. Close around her, Anouar, Meeta, Surya, Marga-\nreta, Poomina...\n\nTHE ROOM\nBeneath \"The Raft of the Medusa,\" Hasari Pal speaks to\nhis family and Max, Aloka sitting close to the bed, the\nChildren on the bed beside their father, and Max standing\nclose.\n                                              (CONTINUED)\n\n                                                     128.\nCONTINUED:\n                        HASARI\n          A man's journey to the end of his\n          obligations is a very long road.\n          And you have to remember that you\n          can never give up. We pray that\n          life will bless us, that we will\n          be kings, with possessions and\n          money that we can rule over all\n          around us. But it's a mist; the\n          only thing that makes it possible\n          to endure life is our love, one\n          for the other.\nA beat, the family and Max tightly bound together.   And\nnow we hear the dim sounds of RICKSHAW BELLS.\n\n                        HASARI\n          I was dreaming the sound of\n          rickshaw bells, and now I hear\n          them.\nMax opens the windows.   Manooj helps his father sit up.\n\nCOURTYARD - THEIR POV\nOutside, there are rickshaw pullers filling the courtyard\nand spilling out into the street. When the window opens,\nall the Pullers start ringing their bells and the room is\nfull of their music.\n                        HASARI\n          Are they here for me?\nUnquestionably, they are.\n\n                        HASARI\n          A city so big. When we arrived,\n          we didn't have a place to live, a\n          friend.\nHe smiles.\n\nOUTSIDE\nThe many hands with their ringing bells.\n\nCLOSE ON WINDOW\nThe tiny figure of Shambu joins Max in the window.   Max\nbends close.\n                                           (CONTINUED)\n\n                                                     129.\nCONTINUED:\n                       SHAMBU\n                (whispering)\n         Is my father going to die?\nMax makes the same sound he made in the ashram at the\nbeginning of the movie, though this sound of dismissal\ndifferent.\n                        MAX\n         Get serious.\n\nINT. RAM'S HUT - HASARI'S FACE - DAY\nHasari mirrors Max's expression of dismissal!\n\n                       HASARI\n         Get serious! I've agreed to the\n         bicycle, I've agreed to the 1000\n         rupees! I can go no further. I\n         have nothing more to give!\n\nOUTSIDE THE HUT\nEveryone crowded around the door. From within, we DIMLY\nHEAR the negotiations continue. Max approaches from the\nclinic. Shambu slips down the steps from above as...\n                       MAX\n         How's it going?\n                       RAM\n         All that stands between them now\n         is the ounce of gold. Max\n         Daddah, Joan Di -- is she a good\n         reader?\n                       MAX\n         What do you mean?\n                       RAM\n         She read this letter to me.\n                ( he shows Max)\n         But I think she must have read it\n         wrong. She said my wife writes\n         that irrigation has come to our\n         village.\n                       MAX\n         But that's great.\n                                            (CONTINUED)\n\n                                                        130.\nCONTINUED:\n                          RAM\n            But it means I should go home to\n            my wife.\n                          MAX\n            I thought that's why we've been\n            writing all these letters.\n                          RAM\n            Yes, of course, I love her from\n            here, yes; but, what if I go home\n            and find I don't love her from\n            there.\nShambu takes him by the hand and tugs him quickly to the\nedge of the tea shop. The little boy indicates Max\nshould bend close. Max leans down.\n                          SHAMBU\n            Daddy needs gold, right?\nMax nods.    And Shambu brings his fist up from under the\ntable.\n\nCLOSE ON SHAMBU'S HAND\nHe opens his hand to disclose what he scooped off the\nground during the fight: Max's necklace and Hebrew\nletter.\n                          SHAMBU\n            Do you think this is pretend gold\n            or real?\n\n\nMAX AND SHAMBU\nMax stares at the little boy's hopeful face.\n\nINT. PAL'S ROOM - FLOWER\nWe see the fully blossomed flower in the tea caddy and\nthen Hasari's fingers come INTO THE FRAME. He carefully\nsnips the flower free of its stalk.\n\nANOTHER ANGLE\nAmrita is dressed in the beautiful sari her father bought\nher. Father and daughter are alone. He hands her the\nflower and adjusts her veil tenderly.\n                                               (CONTINUED)\n\n                                                      131.\nCONTINUED:\n                       HASARI\n         You never did belong to me. You\n         were only lent to me by God until\n         you marry and continue the wheel\n         of life.\nAmrita stares at her loving father and slowly her arms\ncome up around his neck, the flower against his curved\nback. Tears fill Hasari's eyes, but a smile graces his\nlips.\n\nEXT. SQUARE - DAY - EARLY EVENING\nThe procession to the courtyard begins when a BRASS BAND\nstrikes up, accompanied by singing and shouting. Tiny\nlights have been strung over the street. We see Max and\nManubai. Margareta and a group of children. Joan with\nPoomina. Anour, Meeta, Said. Everyone who's become part\nof the family is present.\n\nEXT. CLINIC COURTYARD - DAY (DUSK)\nThe procession arrives and enters. Smoke from the chu-\nlas. Light from a half dozen lamps.\nSubash and his procession make their entrance. A ritual\nveil is fixed to Subash's face. The Pujari waves for\nHasari to come to his place. Hasari turns to Max.\n                       HASARI\n         I would be pleased if you would\n         stand with me in the place of\n         honor to the right of my daughter.\n\nDeeply touched, Max nods... and the two men step for-\nward... as Subash is motioned forward by the Pujari.\nSubash sits beside Amrita.\n\nTHE CEREMONY\nA flame. The    shyness of bride and groom as the ceremony\nproceeds with   the winding of the red thread. Hasari\nlooks on with   unspeakable pride, Max beside him. We see\nthe faces of   all our family again: Aloka, Manooj and\nShambu, Joan,   Poomina, Surya, Selima, Aristotle John,\netc.\n\n                                                      132.\nTHE WHEEL\nTurning. As Amrita and Subash, joined by the thread,\ncircle the flame... as we PULL BACK AND UP. Now we see\nthe clinic and school and the surrounding area, the\nalleys full of people and activity. As we continue to\nPULL BACK, we see the entirety of the City of Joy and\nthen beyond -- Calcutta, its teeming streets -- life con-\ntinuing as the sun sets against an infinite sky and we\nROLL END CREDITS.\n                                          FADE OUT.\n\n\n                        THE END\n\n\n\n\n\nCity of Joy\nWriters :   Gerald Brach  Roland Joffe\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:38.495738"}