{"title": "Cliffhanger", "film_link": "/Movie Scripts/Cliffhanger Script.html", "script_link": "/scripts/Cliffhanger.html", "info_raw": "\n\nCliffhanger Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Michael France\nGenres  Action  Adventure  Thriller\nMovie Release Date : May 1993\n\nRead \"Cliffhanger\" Script\n\n\n", "script": "\n\n\n\n                           CLIFFHANGER\n\n\n\n                            Written by\n\n                          Michael France\n\n\n\n\n        EXT. MOUNTAIN RANGE - HELICOPTER SHOT - DAY\n\n        An unparalleled set of sheer mountains -- part of the Colorado\n        Rockies. The peaks rise a challenging half mile and more out\n        of the valley -- wind-whipped snow mists over the mountains\n        like a low fog. The tranquility is broken as a helicopter\n        BLASTS into view, fighting the wind as it heads for the center\n        of it all.\n\n        Our CREDITS fly us past and through this magnificent range.\n        There are sky-piercing peaks that slope up to a narrow, high\n        pinnacle -- and others that are steel, straight-up approaches\n        to large plateaus. One of the mountains has a crystal lake on\n        top -- with a waterfall that drains from it and exits from the\n        middle of a mountain wall. Nearby, an abandoned cable ladder\n        is bolted into the same wall, leading to the top.\n\n        BACK IN THE HELICOPTER\n\n        We can see a man sitting in its doorway, looking out --\n\n        INT/EXT HELICOPTER - BINOCULAR POV\n\n        The glasses scan systematically, slowly -- to us, it looks\n        like nothing more than a field of gray and white.\n\n                                        FRANK (O.S.)\n                      Nothing yet.\n\n        EXT. THE MOUNTAINS - LONG SHOT\n\n        The helicopter now circles this tallest mountain -- \"The\n        Tower\", separated from a lower but equally formidable peak by\n        a chasm of two hundred feet -- that drops 3,500 feet below.\n\n        INSIDE HELICOPTER - FRANK AND MAGGIE\n\n        Spotter FRANK NEWELL (50s) scans the mountain wall.  MAGGIE\n        DEIGHAN (30s) expertly pilots the helicopter through the storm\n        winds. Both wear orange jackets identifying themselves as\n        members of the Rocky Mountain Park Rescue Team.\n\n                                        FRANK\n                      Wait a minute -- there's Hal.\n                            (beat)\n                      And his date.\n\n        BINOCULAR POV - A LEDGE\n\n        that's part of the smaller peak. HAL TUCKER (30s) and his \n        \"date\", SUSAN COLLINS (20s), are decked out in climbing gear.  \n        Hal's aplomb suggests he's a veteran climber -- Susan's\n        worried look shows she isn't. Hal and Susan huddle together,\n        both cold, but okay. Hal has a makeshift splint wrapped\n        around his lower leg, and a slow burning flare in one hand.\n\n        INSIDE HELICOPTER\n\n        Frank lowers his glasses -- Maggie struggles with the wind.\n\n                                        MAGGIE\n                      How do they look?\n\n        BINOCULAR POV - HAL AND SUSAN\n\n        Hal, now aware of the copter, looks towards it, smiling -- and\n        starts jerking off the flare.\n\n                                        FRANK (O.S.)\n                      He's signalling \"okay.\"\n\n                                        MAGGIE (O.S.)\n                      Where's Gabe?\n\n        The POV dips down -- there's somebody climbing below, in an\n        orange rescue jacket.\n\n                                        FRANK (O.S.)\n                      Right where he's supposed to be.\n\n        CLOSER ON THE CLIMBER\n\n        This is GABE WALKER (30s). In spite of the cold and the snow,\n        he's fearlessly, swiftly scaling the tower without safety\n        lines, as if he's done it a hundred times. That's because he\n        has done it a hundred times. This is what Gabe lives for.\n\n        ON THE LEDGE\n\n        Gabe, almost there, finds a fingertip-width handhold at arm's\n        length -- grabbing it, he pulls himself up on the ledge with a\n        move that's just a little tougher than chinning yourself on a\n        doorjamb. Winded, Gabe slumps down next to the couple, and\n        tries to light a cigarette. The lighter only sparks.\n\n                                        HAL\n                      Excuse me -- I know you're my\n                      salvation, and all -- do you think you\n                      could rescue us before your smoke\n                      break?\n\n        Hal pulls out a box of wooden matches and lights one Bogart\n        style, one-handed with a thumbnail, cupping a hand to shield\n        it against the wind. Gabe bends down for it -- a familiar\n        routine. We know in a glance they've been friends for years.\n\n                                        GABE\n                      Maybe you could tell me why I am\n                      rescuing you.\n\n                                        HAL\n                      Basically -- I've fallen down, and I\n                      can't get up...\n\n                                        GABE\n                            (into radio)\n                      Rescue One -- have located helpless\n                      climber, please prepare idiot line\n                      for transport, over --\n\n        THE HELICOPTER dips down towards the ledge -- no way can it\n        land there. Frank lowers a rescue wire to\n\n        GABE\n\n        who precariously swings out from the ledge to grab it -- the\n        wire is just out of reach. Hal grabs the radio.\n\n                                        HAL\n                      Rescue One -- please remind me to tell\n                      you about the time I hauled your hero\n                      here down Mt. Huntington on my back,\n                      over --\n\n                                        MAGGIE (O.S.)\n                            (through radio)\n                      Hal, if I hear that story one more\n                      time, I'm making you limp down the\n                      entire three thousand feet, over --\n\n        Gabe finally grabs the line, secures it to a heavy piton, and\n        hammers it into the wall.\n\n                                        GABE\n                            (to Susan)\n                      This guy showing you a good time?\n\n        THE HELICOPTER\n\n        swings over across to the facing mountain -- Maggie lands the\n        copter, in spite of the winds, on a small plateau. Frank gets\n        out to secure the wire -- there's now a lifeline spanning the\n        chasm.\n\n        ON THE LEDGE\n\n        Gabe finishes anchoring the line in the rock -- he\n        extinguishes his cigarette in the snow, and naturally, pockets\n        the butt. Hal, propped up against the wall, expertly rigs a\n        seat harness around his legs -- Susan helps him get part of it\n        around his splint, and Gabe clips it to the line.\n\n                                        GABE\n                      Now, remember -- keep your arms and\n                      legs within the vehicle at all\n                      times --\n\n                                        HAL\n                            (laughing)\n                      Fuck you --\n\n        With that, Hal pulls himself hand-over-hand across the sloping\n        line -- Hal makes a point of looking down --\n\n        HAL'S POV -- THE DROP\n\n        is vertigo defined. Thirty five hundred feet straight down.\n        You could stack the World Trade Center towers on top of each\n        other and they'd still be shorter than this mountain is high.\n        However --\n\n        HAL\n\n        lets go of the overhead line and claps his hands to his face\n        in mock horror -- he quickly whizzes down the last thirty feet\n        of the line, where Frank catches him and pulls him out. Hal\n        gets out of the harness, checks every stitch of it, signals\n        thumbs-up, and sends it back.\n\n        THE LEDGE\n\n        Gabe, retrieves the harness on a small attachment line, and\n        gives Susan a reassuring smile, but she's still, sensibly,\n        very scared. Gabe recovers the harness, rigs Susan into it,\n        and meticulously re-checks it.\n\n                                        GABE\n                      Ready?\n                            (sees she's afraid)\n                      Did he tell you about the time he\n                      almost made it up Everest?\n\n                                        SUSAN\n                      He said you gave him a bad oxygen mask\n                      --\n\n                                        GABE\n                      Well, if he's bored you with that\n                      bullshit, then this has to be the best\n                      part of a bad date. Right?\n\n        Susan nervously laughs.\n\n                                        GABE\n                      Ready?\n\n                                        SUSAN\n                            (scared but tough)\n                      Okay --\n\n        Gabe starts to push her out on the line, but she grabs his arm\n        in a panic.\n\n                                        SUSAN\n                      I can't --\n\n        Susan starts to tilt her head down -- Gabe gently takes hold\n        of her chin, turning her view up to face him.\n\n                                        GABE\n                      Yes you can.\n                            (reassuring)\n                      You can do it. Don't look down.  The\n                      whole way across, don't look down.\n                      Look at me. Just keep looking at me --\n                      and you'll be okay.\n\n        Susan looks at Gabe -- trying to be confident -- nods.\n\n                                        GABE\n                      Sure?\n\n                                        SUSAN\n                      Yeah.\n                            (beat)\n                      I have always depended on the kindness\n                      of Rangers.\n\n        Gabe grins and gently pushes her out. Susan tentatively pulls\n        herself across -- then develops a rhythm, building speed --\n\n        GABE'S POV - SUSAN\n\n        inching away in the harness, looking more confident now --\n\n        SUSAN'S POV - GABE\n\n        signalling \"OK\" -- \"you're doing fine\" --\n\n        SUSAN - ANOTHER ANGLE\n\n        thirty feet out, going fine --\n\n        INSERT -- A HARNESS CLIP\n\n        holding the strap under Susan's left leg breaks --\n\n        GABE'S POV - SUSAN\n\n        The harness completely unravels all at once, its strands\n        shoot through the clips -- what was a seat has become a trap\n        door in half a second -- as the harness shoots out from under\n        her, Susan falls but grabs the harness strand --\n\n        HAL\n\n        is helpless, and can only watch as\n\n        SUSAN\n\n        too scared to breathe, dangles on the remaining strand of what\n        used to be the harness -- she sways from the wind and the jerk\n        of her own weight, her grip loosens --\n\n        INSERT - THE TOP CLIP\n\n        that is supporting all of Susan's weight is being seriously\n        tested -- a single knot in the harness has caught there, but\n        it clearly won't last long --\n\n        GABE\n\n        moves back from the ledge.\n\n                                        GABE\n                            (loud, in control)\n                      Hold on. I'm coming out to get you.\n\n        Gabe gently pulls himself up on the line, crosses his ankles\n        on it, and clips himself on with a three foot safety line.\n        Gabe starts smoothly, quickly pulling himself out, but --\n\n        SUSAN\n\n        is in trouble -- the bobbing of the line from Gabe's weight\n        and the winds are making her lose her grip even more --\n\n        GABE\n\n        urgently pulls himself along the line faster, trying not to\n        shake the line. As he gets closer and closer to a terrified\n        Susan, his eyes lock on hers --\n\n                                        GABE\n                      Keep looking at me. Hold on --\n\n        WIDER ANGLE\n\n        Gabe is only ten feet away from --\n\n        SUSAN\n\n        who stares at Gabe, petrified -- this focus is helping, but\n        her strength is just about gone --\n\n        INSERT - THE CLIP\n\n        The knot has worked itself halfway through -- it doesn't make\n        any difference how tight she holds on to the harness, the\n        harness itself is letting go --\n\n        ON GABE\n\n        who knows it and pulls himself the rest of the way, a little\n        faster, almost bridging the gap --\n\n        ON SUSAN\n\n        staring desperately at Gabe, holding on --\n\n        INSERT - THE TOP CLIP\n\n        that's keeping Susan alive surrenders the knot -- it passes\n        through, and\n\n        SUSAN\n\n        falls --\n\n        GABE\n\n        deliberately lets go of the main line and launches himself\n        at Susan --\n\n        THEIR HANDS\n\n        miss --\n\n        ANGLE ON BOTH\n\n        Gabe's three foot safety line pulls taut, testing the limits\n        of the line above as it yanks him back --\n\n        GABE'S POV - SUSAN\n\n        is just out of reach -- her hand is still stretched out, her\n        eyes still locked on\n\n        GABE\n\n        who can only look down, swaying helplessly on the wire as\n        Susan's SCREAM starts --\n\n        ON THE OPPOSITE SIDE\n\n        Frank and Maggie look down in horror, but neither look as\n        anguished as Hal --\n\n        LONG SHOT - SUSAN\n\n        falling -- falling -- falling -- looking very small against\n        the vast mountain range --\n\n        SUSAN'S POV - FALLING\n\n        from this height takes the longest nineteen seconds you can\n        imagine --\n\n        GABE\n\n        twists from his safety line, spinning helplessly -- he wants\n        to, but can't, shut his eyes --\n\n        GABE'S POV - THE CHASM\n\n        Susan is gone. Her SCREAM, cut short, echoes -- the \"safety\"\n        harness spirals down after her like a carefree bird --\n\n                                                          SMASH CUT TO:\n\n        INT/EXT SMALL AIRLINER - GABE'S POV OUT WINDOW - DAY\n\n        As the plane dips to land, Gabe can see a bird circling far\n        below, over the same mountainous terrain.\n\n        INT. SMALL AIRLINER - GABE\n\n        sweating, panting, awake. It hasn't been that long since the\n        accident -- a year, to be exact -- but he looks older. He\n        looks as if he's watched Susan Collins drop at least one\n        hundred times. Gabe reels himself in as a STEWARDESS hands him\n        a glass of water.\n\n                                        STEWARDESS\n                      Take this.\n                            (Gabe does)\n                      Afraid of flying?\n\n        Gabe shakes his head.\n\n                                        GABE\n                      Falling.\n\n        INT. TERMINAL - DAY\n\n        Gabe, with no luggage, is at the small airport's only car\n        rental counter, doing the paperwork for a RENTAL AGENT.\n\n                                        RENTAL AGENT\n                      Midsize?\n\n                                        GABE\n                      Any size, any color, any model.\n\n                                        RENTAL AGENT\n                      How long will you be needing it?\n\n                                        GABE\n                            (flat)\n                      Just under six hours.\n\n                                        MAGGIE (O.S.)\n                      You aren't wasting any time, are you?\n\n        Gabe turns and looks at\n\n        MAGGIE\n\n        who is standing off to the side.\n\n                                        MAGGIE\n                      I knew you'd be coming by. Today.\n\n        Gabe's happy to see her -- but at the same time, he isn't.\n        She looks too good -- and she brings up quite a mixed bag of\n        memories. Maggie carves on a smile.\n\n                                        MAGGIE\n                      If you're in that much of a hurry, why\n                      don't you ride with me?\n\n        INT. RESCUE HELICOPTER - DAY\n\n        Maggie pilots the copter, heading out toward the mountain\n        range. Gabe fiddles with some of the equipment inside. Both\n        grope for a way to start the conversation.\n\n                                        GABE\n                      This is new...\n\n                                        MAGGIE\n                      It's a thermal scope -- picks up body\n                      heat of lost hikers --\n\n        Gabe flicks it on, looks at the total absence of heat as they\n        fly over the snow.\n\n                                        GABE\n                      Still find the dead ones the old\n                      fashioned way, I guess.\n\n        So much for small talk. Gabe is clearly uneasy watching these\n        mountains go by. Maggie breaks an awkward silence --\n\n                                        MAGGIE\n                      You could have said goodbye.\n\n                                        GABE\n                            (shakes head)\n                      If I did, I'd have to listen to you\n                      tell me one more time that it wasn't\n                      my fault.\n\n                                        MAGGIE\n                            (angry)\n                      Today -- especially today -- you get\n                      to hear it again. The harness clip\n                      broke.  Cold stress -- one in a\n                      million equipment failure. You and\n                      Hal could have checked it from then\n                      till now and it still would have\n                      happened.\n                            (beat)\n                      You did everything right --\n\n                                        GABE\n                      -- If I did everything right, Susan\n                      Collins would still be alive.\n\n        THE HELICOPTER\n\n        whizzes on to the Ranger station -- a small building by an old\n        country road. Not much activity outside of some ROOKIE\n        CLIMBERS working out on a CLIMBING PRACTICE WALL. Maggie\n        starts to land the copter, and as she does --\n\n        INSIDE THE COPTER\n\n                                        GABE\n                      Do you really believe all that?  That\n                      it wasn't our fault?\n\n        Maggie slows the rotor, her eyes on the controls. Gabe's eyes\n        are locked on her.\n\n                                        MAGGIE\n                            (turns to Gabe)\n                      Yes. Yes, I do.\n\n        But she answered a half beat too slow. The helicopter touches\n        ground.\n\n                                        GABE\n                      I'm not sure what I wish more, Maggie.\n                      That you meant what you said, just now\n                      -- or that it were really true then.\n\n        EXT. RANGER STATION\n\n        Hal, wearing Sheriff's garb, storms towards Maggie's side of\n        the copter as the engine shuts off and the rotor dies.\n\n                                        HAL\n                      Maggie, where the hell have you been?\n                      I've got two climbers out --\n\n        Gabe gets out of the copter, and Hal sees him for the first\n        time. Unlike the last time we saw them, neither man is glad to\n        see the other. Hal turns on Maggie.\n\n                                        HAL\n                      Brett and Evan are up there again to\n                      jump off the spur. Their wives called\n                      twice. I want you in the air and I\n                      want them found before the storm\n                      system moves in.\n                            (Maggie hesitates)\n                      Now.\n\n        Maggie takes off as Gabe and Hal step away from the copter.\n        Gabe eyes Hal's uniform and almost -- not quite but almost --\n        laughs.\n\n                                        GABE\n                      Christ. You're in charge of Rescue\n                      now?\n\n                                        HAL\n                      There was a vacancy. Maybe you heard\n                      about it. The last guy lost his nerve\n                      and lit out of town.\n\n                                        GABE\n                      Well, you're a better man than I am,\n                      Hal. Nothing rattles you.\n\n        The rookie climbers get off the practice wall to watch this\n        faceoff. Gabe and Hal are one crack away from beating hell out\n        of each other. Frank heads over to defuse the confrontation.\n\n                                        FRANK\n                            (steering Gabe away)\n                      Gabe! Long time, son -- why don't you\n                      come meet some of the new guys --\n\n                                        GABE\n                      Good idea. Say, Hal?\n                            (beat)\n                      Why don't you come with me so we can\n                      show these rookies how to death-rig a\n                      woman properly?\n\n        That tears it -- Hal rushes Gabe and they pummel each other\n        until Frank and the others pull them apart, panting and\n        bleeding.  Hal throws off the men holding him back -- but\n        instead of going at Gabe again, Hal throws Gabe a set of car\n        keys.\n\n                                        HAL\n                      Take the Bronco to where you're going.\n                      I've already been. Then go back to\n                      wherever it is you like to hide. And\n                      stay there.\n\n        Hal heads back into the office -- Gabe heads for the Bronco.\n\n                                                           CUT TO:\n\n        EXT. DENVER MINT - HIGH ANGLE - DAY\n\n        The Southwest regional center for printing and distributing\n        currency. Hundreds of troops stand guard over the impressive\n        U.S. Treasury complex.\n\n        INT. TREASURY COMPOUND - A HUGE PRINTING PRESS\n\n        is at work -- the ROAR of its parts is deafening as it stamps\n        out a plate design on huge sheets of paper -- we move in on\n\n        THE PAPER\n\n        which is moved by mechanical arm to a SLICER that razors the\n        bills apart -- it's moving too fast for us to see the\n        denomination -- the cut bills are separated by --\n\n        FOUR SEPARATION CHUTES\n\n        that fire the bills down to a mechanical COUNTER that\n        serializes, counts, bands and stacks them faster than any\n        human could -- a HAND reaches to pick up a band --\n\n        THE BILLS\n\n        are something a banker could work a lifetime without seeing,\n        but are real nonetheless --  $5,000 bills, banded here in\n        hundreds. The band is put back in the growing stack by\n\n        RICHARD TRAVERS\n\n        mid-thirties, a tough, imposing Treasury agent -- he regards\n        the fortune piling up in front of him with only cold,\n        professional interest. Travers is flanked by a trio of equally\n        tough TREASURY AGENTS -- he turns to flunky DAVIS (20s). It's\n        clear who's in charge of protecting the money here, and who's\n        in charge of counting it.\n\n                                        TRAVERS\n                      Tell Wright the San Francisco shipment\n                      is ready.\n\n                                        DAVID\n                            (phone already out)\n                      Right away, Mr. Travers.\n\n        As Davis dials we move to --\n\n        THE OFFICE\n\n        of WALTER WRIGHT (50s), comptroller of currency -- his\n        demeanor suggests he's in control, and used to keeping it that\n        way.\n\n                                        WRIGHT\n                            (into phone)\n                      Good -- good. I'll be right down.\n\n        As Wright gets up from his desk, though, we hear in the outer\n        office --\n\n                                        SECRETARY (O.S.)\n                      You can't go in there --\n\n                                        MATHESON (O.S.)\n                      Watch me.\n\n        KURT MATHESON (30s) bursts into the office, trailed by\n        Wright's flustered SECRETARY.\n\n                                        MATHESON\n                      Walter Wright?\n                            (flashes badge)\n                      Matheson. FBI. We need to talk.\n\n        PRINTING COMPOUND - THE MONEY\n\n        has now been packed into a trio of metal briefcases -- ten \n        thousand $5,000 bills. Travers shuts the cases in turn, and\n        locks each with an electronic key card, triggering a FLASHING\n        RED LIGHT on the locks as he does. A uniformed PILOT shows up\n        behind Travers as he cuffs the cases to the hands of the three\n        other agents.\n\n                                        PILOT\n                      We'll be fueled and ready in ten\n                      minutes, Mr. Travers.\n\n                                        TRAVERS\n                            (an order)\n                      Be ready in five.\n\n                                        MATHESON (O.S.)\n                      Go ahead and take ten. We'll need the\n                      time.\n\n        Travers looks up at Matheson, who has just arrived with\n        Wright. Travers is instantly furious at the challenge to his\n        authority.\n\n                                        MATHESON\n                            (flashes badge)\n                      Matheson. FBI.\n\n                                        TRAVERS\n                            (looking down at it)\n                      Your parents must be proud.\n                            (to Wright)\n                      What the fuck is this about?\n\n                                        WRIGHT\n                      Small problem with the shipment,\n                      Travers.\n                            (to Matheson)\n                      Tell him what you just told me.\n\n        Matheson draws out a file and hands it to Travers.\n\n                                        MATHESON\n                      We got word that somebody's been\n                      observing your currency shipments --\n                      this load, the $5,000s -- over the\n                      last three deliveries.\n\n                                        TRAVERS\n                            (laughs)\n                      There isn't a hell of a lot anyone can\n                      do but observe.\n                            (beat)\n                      This is the most protected shipment\n                      we've got -- and the most useless for\n                      a thief. Those bills aren't in\n                      circulation. You think five thousand\n                      dollar bills are easy to pass? Who the\n                      fuck would try?\n\n        Matheson hands Travers a folder.\n\n                                        MATHESON\n                      This guy might.\n\n        We look over Travers' shoulder at the photos, which are all\n        blurry, all blown up from different surveillance pictures --\n        and all of them show ERIC QUALEN.\n\n                                        TRAVERS\n                      Who is he?\n\n                                        MATHERS\n                            (patient)\n                      His name's Eric Qualen. One of the\n                      East German spies who got shut out by\n                      the reunification. The CIA issued an\n                      inter-agency warning about him right\n                      after the wall came down. He's got\n                      nowhere to go and nothing to lose.\n                      He's also got the international\n                      connections to get rid of bills like\n                      these -- and he's probably desperate\n                      enough to try for them. Fifty million\n                      bucks buys a lot of sanctuary.\n\n                                        TRAVERS\n                      Could you get to the part where I'm\n                      supposed to care?\n\n                                        MATHESON\n                            (shows him more photos)\n                      We had two agents monitoring him.\n                      These two -- Gleason and Quinones.\n                      Their last report said he was going to\n                      try to take this shipment.\n\n                                        TRAVERS\n                            (turning away)\n                      Thanks for the tip. But I've got work\n                      to do.\n\n                                        MATHESON\n                            (stopping him)\n                      Did I say \"last\" report? I think I\n                      did. I mean last fucking report.\n                      These guys have vanished.\n\n                                        TRAVERS\n                      You have my sympathy, but --\n                            (exasperated)\n                      There's a reason we do things this\n                      way, all right? Armored cars can be\n                      hijacked. Trains can be derailed. But\n                      nobody can get to us in flight. The\n                      only time this is on the ground is at\n                      the mint, or on the Presidio runway in\n                      San Francisco. Either way, someone\n                      would have to shoot his way past a\n                      couple of thousand guards.\n\n        Matheson still isn't convinced.\n\n                                        TRAVERS\n                      If you're worried about an inside job,\n                      forget it. I checked the plane from\n                      top to bottom an hour ago. And these\n                      three are my best against. Even if one\n                      of them did go skydiving, they\n                      wouldn't get far. Each case has an\n                      electronic tracer with a range of one\n                      hundred miles.\n\n        Travers pulls a tracking device about the size of a watchman\n        out of his jacket pocket. The small screen shows three red\n        blips at rest -- matching the three currency cases.\n\n                                        TRAVERS\n                            (facing down Matheson)\n                      I haven't lost a bill in eight years.\n                      And I'm not scrubbing this shipment\n                      because you scare easily.\n\n                                        MATHESON\n                            (an easy smile)\n                      Who said anything about stopping the\n                      shipment?\n                            (beat)\n                      I've been tracking Qualen for almost a\n                      year. If he pulls something, I want to\n                      be in on the party.\n\n        Travers, angry, turns to Wright. Wright clearly doesn't like\n        this either, but is resigned to it.\n\n                                        WRIGHT\n                      This is cleared from the top, Travers.\n                      Matheson will accompany you on the\n                      flight to San Francisco.\n                            (beat)\n                      Show him every professional courtesy.\n\n        Travers turns back to a smiling Matheson, looking like he'd\n        rather kill him instead, as we --\n\n                                                           CUT TO:\n\n        EXT. MOUNTAIN RANGE - MAGGIE'S HELICOPTER\n\n        is being buffeted by storm winds and a light snow -- Maggie\n        struggles hard with the controls, but --\n\n        INSIDE HELICOPTER\n\n        Visibility is near zero. Maggie keys the radio.\n\n                                        MAGGIE\n                      Rescue One to base, over.\n\n                                        HAL (O.S.)\n                      Rescue One -- have you sighted them?\n                      Over --\n\n                                        MAGGIE\n                      Negative, Hal -- storm's already\n                      moving in -- I can't see them, and\n                      winds are too strong to stay up\n                      here -- over --\n\n                                        HAL (O.S.)\n                      Rescue One -- abort. They'll be all\n                      right. Brett and Evan are dumb enough\n                      not to log in, but they're smart\n                      enough to have storm gear. Head back\n                      to base.\n                            (not unkindly)\n                      Maybe you can catch Gabe before he\n                      leaves. Over.\n\n                                        MAGGIE\n                      I don't think he's planning a long\n                      visit, Hal.\n                            (back to business)\n                      Rescue One heading back to base, over\n                      and out.\n\n        THE HELICOPTER\n\n        banks a 180 to fly back -- we can see over the horizon that\n        the storm is moving in fast.\n\n        INT. CAVE - DAY\n\n        We can hear Maggie's helicopter flying off overhead -- camped\n        inside the cave are BRETT and EVAN, both 20s, both shivering,\n        amid their gear -- backpacks, cooking stuff -- and parachutes.\n        These are Colorado rock jocks -- thrillseekers who'll try\n        anything if the odds are strong enough they'll die in the\n        process.\n\n                                        EVAN\n                            (freezing)\n                      Way to check the weather, Brett.\n\n                                        BRETT\n                            (shivering yet macho)\n                      Hey. If it were easy, it wouldn't be\n                      worth d-doing.\n\n                                                           CUT TO:\n\n        EXT. TREASURY JET (DC-9) - DAY\n\n        The DC-9 cruises over increasingly mountainous, remote\n        terrain.\n\n        INT. JET - CLOSE ON TRAVERS\n\n        who looks tense -- we MOVE AROUND the cabin and find two more\n        relaxed Treasury agents are dozing on the opposite side of the\n        plane, their arms chained to the currency cases. Matheson is\n        edgy. Another AGENT offers some condescending reassurance.\n\n                                        AGENT\n                      Just enjoy the view, huh?\n                            (Matheson says nothing)\n                      Relax. I mean, what could happen in\n                      the air?\n\n        Matheson turns back to his window and looks down --\n\n        WINDOW POV - THE GROUND BELOW\n\n        is covered with snow -- the jet's shadow moves sleekly and\n        plainly over it. But after a moment we see -- -- another\n        jet's shadow on the ground, coming up fast!\n\n        INSIDE THE DC-9 - MATHESON\n\n        reacts this and shifts his look upward to --\n\n        WINDOW POV - ANOTHER PLANE (GULFSTREAM)\n\n        is flying a parallel course to the Treasury jet, and is just\n        one hundred yards away. Close enough to see Eric Qualen's face\n        in one of the windows.\n\n        INSIDE THE PLANE\n\n        Matheson stands -- Travers has noticed the plane by now too,\n        and gets out of his seat as the other agents react.\n\n                                        TRAVERS\n                            (to other agents)\n                      Stay put! Don't panic, goddammit!\n\n        Travers moves into\n\n        THE COCKPIT\n\n        where the pilot seems nervous, but oddly, not frightened.\n\n                                        PILOT\n                      He's coming in too slow.\n\n                                        TRAVERS\n                            (cool)\n                      No -- we're going too fast, and we're\n                      too high up. Push flaps forward twenty\n                      degrees and drop to five thousand\n                      feet.\n\n        THE CABIN\n\n        Matheson is out of his seat, pistol drawn. Seems a little puny\n        under the circumstances.\n\n                                        MATHESON\n                            (to agent)\n                      You got any rifles?\n\n                                        AGENT\n                      Forward compartment -- left side --\n\n        Matheson rushes through a curtain to the area between the\n        cabin and the cockpit and pulls open a closet door. To his\n        horror, he finds inside not rifles, but\n\n        TWO DEAD BODIES\n\n        who we'll recognize as the missing FBI agents from the photos\n        Matheson showed Travers.\n\n        MATHESON\n\n        backs up in horror -- and he sees Travers calmly coming out of\n        the cockpit. Rattled, Matheson pulls his gun on Travers.\n        Travers looks dumbfounded -- then angry.\n\n                                        TRAVERS\n                      What the hell are you doing --\n\n                                        MATHESON\n                      Checked the plane from top to bottom,\n                      huh? You fucker --\n                            (clicks hammer back)\n                      Put your hands behind your head! It's\n                      over!\n\n        Travers puts his hands out and walks forward -- slowly,\n        backing Matheson into the cabin. Not in surrender, but as if\n        he's calming a nutcase. The other agents see this and don't\n        know which way to jump.\n\n                                        TRAVERS\n                      Calm down -- give the gun to me --\n\n                                        MATHESON\n                            (to other agents)\n                      There's a couple of dead bodies in the\n                      front compartment -- they're FBI\n                      agents --\n\n                                        TRAVERS\n                      He's losing it --\n\n        They now think Matheson is crazy too -- he looks nuts -- the\n        other agents move behind him. Matheson gets even more frantic\n        and point his gun at them.\n\n                                        MATHESON\n                      Goddamn it! Don't you see what he's\n                      doing! He's hijacking the fucking\n                      shipment!\n                            (back to Travers)\n                      Don't make me shoot you!\n\n        The other two agents get behind Matheson and rapidly disarm\n        him. Travers pulls out his gun with a slow, leisurely move.\n\n                                        TRAVERS\n                      Don't make me laugh.\n\n        Travers FIRES his gun three times, one for each agent's\n        chest -- the agents are cut down, realizing too late what's\n        happened. A fourth SHOT knocks Matheson over a seat as if he'd\n        been kicked. Travers puts his gun away and puts on a radio\n        headset as he goes to a window.\n\n                                        TRAVERS\n                            (to mouthpiece)\n                      Move into position.\n\n        EXT. QUALEN'S JET - GULFSTREAM\n\n        maneuvers over the DC-9 -- and holds steady above it.\n\n                                                           CUT TO:\n\n        EXT. CEMETERY MARKER - COLORADO - DAY\n\n        The stone reads \"Susan Collins -- 1965 - 1991\". It's\n        surrounded by wreaths -- one of which has an old snapshot of\n        her attached to it. Mementos sent on the first anniversary of\n        her death.\n\n        GABE\n\n        brushes some of the falling snow away from the marker. He lays\n        down his flowers and pauses for a moment -- then gets into the\n        Bronco and drives away.\n\n        INT. FORD BRONCO - DAY\n\n        Gabe looks out the window at the countryside he used to belong\n        in. He's wondering if he still does.\n\n                                                           CUT TO:\n\n        EXT. TREASURY JET/QUALEN'S JET - FLYING\n\n        Qualen's jet is now flying parallel to, and slightly above,\n        the Treasury jet. The door in Qualen's jet is open, and we get\n        our first good look at --\n\n        INT/EXT. QUALEN'S JET\n\n        -- Qualen, who is also wearing a headset radio and is wired\n        to a safety line in the jet. He's lowering a thick steel cable\n        down to the Treasury jet.\n\n        Qualen is as deadly as advertised -- 150 mph winds are tearing\n        at him through the open door, but he is unfazed and\n        unfrightened.\n\n        TRAVERS\n\n        is also wired to a safety line by his own jet's open door.\n\n                                        TRAVERS\n                            (into radio)\n                      More -- more -- keep it coming --\n\n        THE TWO PLANES\n\n        Qualen's jet lowers the cable into the Treasury jet -- it\n        looks like an Air Force midair refuelling -- difficult and\n        dangerous. After about thirty feet of line is lowered --\n\n        TRAVERS\n\n        -- takes it in and clips it to a ring at the top of the jet's\n        doorway.\n\n                                        TRAVERS\n                            (into radio)\n                      Locked on. Move into lateral position.\n\n        INSIDE QUALEN'S PLANE\n\n        The pilot, KRISTEL, is a woman. Her skill, like her hard\n        beauty, can be measured in a glance: she's a lot calmer than\n        her counterpart in the Treasury plane.\n\n                                        KRISTEL\n                      Moving into lateral position.\n\n        ON THE TWO PLANES\n\n        Qualen's jet lowers itself, banking to the side -- the\n        Treasury jet raises itself. Both are now flying side by side,\n        with the cable serving as a thirty foot bridge.\n\n        TREASURY JET CABIN\n\n        Travers, unclipped from his safety line, cautiously goes to\n        the cockpit. The pilot, nervous, struggles with the controls.\n\n                                        PILOT\n                      We're right on the edge of the\n                      storm -- let's move it.\n\n        Travers pulls the two dead FBI agents out of the\n        compartment -- one is dressed in a flying suit like the pilot,\n        one in a suit like Travers.\n\n                                        PILOT\n                      This isn't going to work -- Wright\n                      will suspect something.\n\n                                        TRAVERS\n                      So what. He'll sift though a plane\n                      that went down in a storm --\n                            (gestures to bodies)\n                      -- find enough pulverized bone for six\n                      men heroically killed in the line of\n                      duty --\n                            (finds three suitcases)\n                      -- and just enough of the right kind\n                      of ash.\n\n        Travers opens one of the cases, which is identical to the\n        others -- except that it's full of one dollar bills. He's\n        thought of everything.\n\n                                        TRAVERS\n                      We get twenty-one gun funerals and\n                      they write off fifty million. It's\n                      perfect, as long as you hold the plane\n                      steady -- so concentrate.\n\n        Travers moves back into the cabin.\n\n        INSIDE QUALEN'S JET\n\n        We can now see four other passengers. All are fit and armed --\n        HELDON and RYAN are seated, while KYNETTE and DELMER, ready to\n        help with the transfer, are on the opposite side of the door\n        from a very impatient Qualen.\n\n                                        QUALEN\n                            (into radio)\n                      Travers -- hurry it up.\n\n        INSIDE TREASURY JET\n\n        Travers, now in a harness like the one seen earlier -- uncuffs\n        the money cases from the agents.\n\n                                        TRAVERS\n                            (into radio)\n                      On my way.\n\n        Travers steps back into the cockpit and flips a toggle switch\n        over and LED --\n\n        THE LED\n\n        starts counting down from 2:00 -- 1:59 -- 1:58 --\n\n        IN THE COCKPIT\n\n        Even in the last minute, the storm's gotten worse -- the plane\n        is flying right into the blackest center of it. The pilot\n        looks more panicked than ever.\n\n                                        TRAVERS\n                      That charge is going to blow both\n                      engines -- the plane'll go down like a\n                      rock, so clip yourself on to the end\n                      of the cable with the money as soon as\n                      I get over.\n                            (an afterthought)\n                      And make sure you bring the right\n                      cases.\n\n        Travers heads back into the cabin and hooks his harness to the\n        cable between the planes.\n\n                                        TRAVERS\n                            (into the headset)\n                      Dip the plane. I'm coming over.\n\n        THE JETS - LONG SHOT\n\n        Qualen's jet dips down so there's a sharp incline -- Travers\n        starts the slide down, zipping in seconds across into\n\n        QUALEN'S JET\n\n        where he's pulled in and unclipped by Qualen.\n\n                                        QUALEN\n                            (shouting over the wind)\n                      Why didn't you send the money over?\n\n                                        TRAVERS\n                            (shouting too)\n                      Somehow, I didn't think you'd have\n                      waited for me if I'd sent it first.\n\n        Qualen smiles in reply. No. Maybe he wouldn't.\n\n        IN THE TREASURY PLANE COCKPIT\n\n        The pilot locks the controls and rushes back to the cabin.\n\n        THE LED\n\n        counts down -- 0:38 -- 0:37 -- 0:38 --\n\n        IN THE TREASURY PLANE CABIN\n\n        The pilot gathers the cases and uses their cuffs to attach\n        them to the cable -- but as he steps past the bodies of --\n\n        THE AGENTS\n\n        Matheson's eyes open -- he's not dead yet.\n\n        IN THE CABIN\n\n        The pilot clicks the last of the three cases onto the cable\n        and is about to put his harness on -- but behind him, Matheson\n        shakily crawls to his feet, draws his gun, and SHOOTS the\n        pilot in the back twice.\n\n        THE PILOT\n\n        drops out of the plane, flailing -- if he's screaming, we\n        can't hear it over the HOWLING of the storm --\n\n        IN QUALEN'S JET\n\n        Qualen and Travers are watching the whole plan unravel --\n\n                                        TRAVERS\n                            (shouting to cockpit)\n                      Get underneath the jet! The cases will\n                      slide over!\n\n        THE JETS - LONG SHOT\n\n        Qualen's jet sharply dips down and the cases start to slide\n        over -- but at the same time --\n\n        INSIDE THE TREASURY JET\n\n        Matheson, groggy, holds onto the doorway and FIRES a full clip\n        from his automatic at Qualen's jet -- and\n\n        THE LED\n\n        counts down -- 0:02 -- 0:01 -- 0:00 -- and\n\n        THE TREASURY JET'S ENGINES\n\n        are destroyed as the charge DETONATES --\n\n        THE JETS - LONG SHOT\n\n        As promised, the Treasury jet is now plummetting as if it had\n        no wings at all, levelling the angle between the planes -- the\n        cases dangle precariously on the wire --\n\n        INSIDE QUALEN'S JET\n\n                                        TRAVERS\n                            (shouting)\n                      Lower! Get underneath it!\n\n        INSIDE TREASURY JET\n\n        Matheson struggles to the cockpit and gets behind the controls\n        -- as if that's going to do any good --\n\n        THE JETS - LONG SHOT\n\n        Qualen's jet is deliberately racing the disabled Treasury jet\n        down, but it's hopeless -- there's no way to get underneath\n        the falling jet long enough for the cases to slide over.\n\n        INSIDE QUALEN'S JET - KRISTEL\n\n        isn't quite panicked. Yet.\n\n                                        KRISTEL\n                      It's dragging us down! Disconnect the\n                      cable!\n\n        INT. QUALEN'S JET - CABIN\n\n        Heldon and Ryan try to do just that, but the cable is\n        taut -- there's no way to loosen the clip on the door --\n\n        BOTH JETS\n\n        dive down faster at an ever steeper angle, over the edge of\n        the Colorado mountain range --\n\n        INSIDE THE TREASURY JET\n\n        -- the clip on the door finally breaks --\n\n        BOTH JETS - LONG SHOT\n\n        -- the Treasury jet drops as Qualen's jet, trailing the cable\n        and the money, sharply shoots upward --\n\n        THE TREASURY JET\n\n        makes a one point landing nose first into the wilderness,\n        cartwheeling into a FIREBALL!\n\n        INT./EXT. RANGER STATION\n\n        The sound of the EXPLOSION, muffled in the wind, far-off, but\n        audible, drives Hal outside -- he's alert, but can't see\n        anything in the murk of the storm --\n\n        INT. QUALEN'S JET - THE COCKPIT - KRISTEL\n\n        levels off the plane, but it's still in trouble --\n\n        CABIN - QUALEN AND TRAVERS\n\n        struggle to reel in the cable, because --\n\n        CLOSE ON THE CABLE\n\n        The money cases are still, barely, holding on, the cuffs\n        caught on the broken clip at the end --\n\n        QUALEN AND TRAVERS\n\n        aren't even bothering with the electric winch, they're\n        dragging it in hand over hand -- but --\n\n        CLOSE ON THE CABLE\n\n        -- the cases, torn by the wind, work their way loose one at a\n        time and drop -- one -- two -- three -- into the snowy\n        mountains below!\n\n        IN THE CABIN\n\n        Heldon and Ryan clamp the door shut as Qualen angrily attacks\n        Travers --\n\n        THE COCKPIT - KRISTEL\n\n        tries to bring the plane up, but can't -- the fuel guage\n        needle is dropping fast --\n\n        INSERT - THE WING\n\n        is pouring out fuel through a dozen bullet holes -- one of two\n        engines sputters to a stop.\n\n        THE COCKPIT - KRISTEL POV\n\n        The plane is now just skirting the mountain tops, and is still\n        being battered by storm winds -- Kristel aims it for what\n        looks like the flattest, longest mountain top --\n\n        THE CABIN\n\n        Kynette and Ryan grab Qualen and Travers to separate them --\n        all strap in, because\n\n        THE PLANE\n\n        is going down -- it just tops the edge of a precipice and hits\n        the ground level --\n\n        THE MOUNTAIN TOP - LONG SHOT\n\n        -- the problem is, the ground itself isn't level, it tilts\n        down towards another edge five hundred yards distant -- if the\n        plane keeps skidding, it'll go over the edge --\n\n        THE PLANE\n\n        sleds down at an angle, skipping over rocks -- -- through\n        trees --\n\n        -- tearing off a wing --\n\n        THE COCKPIT\n\n        Kristel rides the stick only out of habit -- nothing she does\n        is going to matter now --\n\n        INSIDE THE CABIN\n\n        The men are jolted around -- windows IMPLODE as Kynette tries\n        to protect a bag of what is obviously explosives --\n\n        THE PLANE\n\n        rips downhill through a wooded area like a runaway train --\n\n        -- the second wing is sheared off by trees --\n\n        COCKPIT POV - THE OPPOSITE EDGE\n\n        is coming up fast -- but\n\n        THE PLANE\n\n        wrenches to a sudden halt, the fuselage intact.\n\n        WIDER VIEW - THE PLANE\n\n        or what's left of it has stopped several feet short of the\n        edge -- we can see why: the steel cable, trailing from the\n        cargo door, has lashed itself around a half dozen trees,\n        acting as a tripwire to stop the plane.\n\n        INSIDE THE PLANE\n\n        Quiet. All are dazed but, outside of superficial cuts,\n        unhurt. Kristel moves out of the cockpit, looking around.\n\n                                        KRISTEL\n                      So much for phase one.\n                            (to Travers)\n                      Now what?\n\n        She speaks for all of them -- especially a still-seething\n        Qualen. Travers pulls out the tracer monitor for the cases.\n        The tracer screen shows three distinct blips -- the tracers\n        have survived the fall.\n\n                                        TRAVERS\n                      Now -- we call the police.\n\n        INT. RANGER STATION - DAY\n\n        Hal, agitated, paces in the main office -- Frank, unconcerned,\n        puts a coat hanger and some aluminum foil on a little TV to\n        drag in the fading signal of a Broncos game.\n\n                                        HAL\n                      Look -- I know there's a storm, but\n                      that wasn't thunder.\n\n                                        FRANK\n                            (unconcerned)\n                      Hal, when you've been in this line as\n                      long as I have --\n\n        The station's scanner radio barks to life.\n\n                                        KRISTEL (O.S.)\n                            (panicky)\n                      Mayday -- mayday -- downed DC-3 -- \n                      mayday --\n\n        Hal runs to the radio and keys the mike.\n\n                                        HAL\n                      Rocky Mountain Rescue -- come in,\n                      mayday --\n\n        INT. COCKPIT\n\n        Kristel is on the radio, as Travers and Qualen hang back.\n        Kristel's voice is panicked but she can't suppress a grin.\n\n                                        KRISTEL\n                      Downed charter flight\n                      alpha-charlie-niner--\n                            (keys mike to \"garble\"\n                             transmission)\n                      -- dead, seven seriously wounded,\n                      acknowledge --\n\n        INT. RANGER STATION\n\n                                        HAL\n                      Acknowledged, mayday. What's your\n                      position?\n\n                                        KRISTEL (O.S.)\n                            (\"panicked\")\n                      Don't know -- position unknown --\n                      landed on top of some mountain -- only\n                      visual bearing is a facing\n                      cylinder-type formation -- over --\n\n                                        HAL\n                      Got to be Comb Bluff.\n                            (keys mike)\n                      Acknowledged, mayday. Winds are too\n                      strong for us to get a copter up there\n                      -- can you and your passengers make it\n                      through the storm? Over --\n\n                                        KRISTEL (O.S.\n                      Negative -- cockpit is on fire --\n                      fuselage broken into three sep--\n                           (\"garble\")\n                      --ed in shock.  Need medical supplies,\n                      including insulin, repeat, insulin, as\n                      soon as po --\n\n       Dead silence. The transmission cuts off/\n\n                                        HAL\n                      Mayday -- come in, mayday --\n\n       INT. COCKPIT\n\n       Kristel hangs up the radio and smiles, Travers and Qualen\n       standing behind her. Qualen lightly applauds.\n\n                                        QUALEN\n                      Not bad. The insulin was a nice touch.\n\n       EXT. COUNTRY ROAD - DAY\n\n       The Bronco wends through a winding country road, coming\n       finally to a cabin settled in a clearing.\n\n       GABE\n\n       pulls into the driveway and puts the Bronco in park. He\n       doesn't cut the engine, because he's not sure whether he's\n       going in or not. Finally -- he cuts the ignition.\n\n       INT. CABIN - DAY\n\n       A knock on the door brings no response -- no one inside. Gabe\n       opens the unlocked door -- and steps inside.\n\n                                        GABE\n                      Maggie?\n\n       No answer. Gabe takes a look around the living room. His face\n       tells us, without a doubt, this used to be his home. Gabe\n       moves inside, pausing at a mantle. Two framed photos -- Gabe\n       and Maggie sleeping together in a hammock, bolted to a sheer\n       wall over a 2,000 foot drop. Gabe, Hal and Maggie, all\n       younger, all sporting drunken grins, in a mountain cave.  Gabe\n       smiles for the first time today at this memory -- a BANGING at\n       the back of the cabin shakes him out of it.\n\n       EXT. CABIN - DAY - THE BACK DOOR\n\n       has come open and swings in the wind. Gabe steps outside and\n       pulls it shut. Gabe looks down and sees tracks that lead to a\n       small but sturdy shed a few yards away. Gabe heads over to it.\n\n       INT. SHED - DAY\n\n       Not a storage shed at all -- it's a small workspace that\n       offers solid protection from the elements, is well-lit, and\n       whistle-clean. Maggie, in front of a table, pulls a cover off.\n\n       A LARGE PLASTIC CAGE\n\n       -- inside is a bald eagle. One of maybe 2,000 left in the\n       country. Its uneven feathering and small, gawky size tells us\n       it isn't nearly full grown. A bandage on its side tells us\n       it's been injured. Maggie's smile tells us it's healing.\n\n                                        MAGGIE\n                      Hey there --\n\n       The door to the shed opens -- Gabe steps in, and shuts the\n       door behind him. Maggie looks surprised to see him. Gabe just\n       looks awkward.\n\n                                        GABE\n                      Hi.\n                           (beat)\n                      Could you introduce us?\n\n                                        MAGGIE\n                      Sure. Gabe Walker -- this is A27.\n                      A27 -- Gabe.\n\n                                        GABE\n                      Not the tag -- what do you call\n                      him?\n\n                                        MAGGIE\n                      Her. I call her Lucky.\n\n                                        GABE\n                           (bends down, eyes wound)\n                      Poachers?\n                           (Maggie nods)\n                      Bastards...\n\n                                        MAGGIE\n                      They got the mother -- and left this\n                      one behind. Too small to make a decent\n                      trophy, I guess.\n\n                                        GABE\n                      About four months, right?\n                           (Maggie nods)\n                      Christ -- it must have been just about\n                      his -- I mean her -- first flight --\n\n                                        MAGGIE\n                      Time to change the dressing.\n\n       Maggie pulls on a pair of pair of cowhide gloves.\n\n                                        GABE\n                      You can't do that alone --\n\n                                        MAGGIE\n                      I've had to learn. She trust me --\n\n       Maggie reaches into the cage, but the eagle starts thrashing.\n\n                                        GABE\n                      I'm making her nervous --\n                           (beat)\n                      You hold her, I'll do the dressing.\n\n       Gabe finds another pair of gloves, sterile cotton pads and\n       alcohol in a drawer -- Maggie reaches in and grabs the eagle's\n       beak and talons quickly but gently, and takes it out of the\n       cage, holding it firm. This is clearly something they've done\n       many times before. They move together, tight -- Gabe and\n       Maggie both react to this bit of close contact as they bandage\n       the eagle. It's getting warmer in here. Gabe reaches down and\n       yanks off the patch. The eagle thrashes as Gabe cleans the\n       wound.\n\n                                        GABE\n                      Got some fight in her -- that's good.\n                           (beat)\n                      What happened to Dave?\n\n                                        MAGGIE\n                      The usual. Flew off -- never calls,\n                      never writes --\n\n       Gabe winces at this one as he carefully tapes the small patch\n       and sticks it on the eagle's side. Maggie puts the eagle back\n       in the cage and closes the top door. Gabe and Maggie don't\n       move any further apart as they pull their gloves off. Gabe\n       tentatively reaches for Maggie's face -- but she pushes him\n       hand away.\n\n                                        MAGGIE\n                      I'm glad to see you, Gabe. But I kind\n                      of wish you hadn't come. I was almost\n                      used to you being gone.\n                           (beat, quiet)\n                      Why are you here?\n\n                                        GABE\n                           (pauses)\n                      I thought I came back to see if I'd\n                      learned to live with it. Well, big\n                      surprise. Coming back just tore me\n                      open all over again, like it all\n                      happened yesterday instead of a year\n                      ago. Nothing's changed. Including the\n                      way I feel about you.\n                           (beat)\n                      I didn't realize it till I saw you at\n                      the airport. But I came back for you,\n                      Maggie.\n\n                                        MAGGIE\n                      Does that mean you're going to stay?\n\n                                        GABE\n                      No. Not here.\n                           (beat)\n                      I want you come with me. Start over,\n                      somewhere else.\n\n                                        MAGGIE\n                           (incredulous)\n                      You come back after being gone a year,\n                      and you expect me to --\n                           (beat)\n                      You don't live here any more, Gabe.\n                      Your choice, remember? But this is\n                      my home. I'm not leaving. You can\n                      stay with me, or you can go alone.\n                      It's still your choice.\n\n                                        HAL (O.S.)\n                      Now there's an easy call.\n\n       Standing in the shed's doorway is Hal. Stone faced. Grim.\n\n       OUTSIDE SHED\n\n       Furious, Gabe heads out after Hal.\n\n                                        GABE\n                      What the hell do you want?\n\n                                        HAL\n                           (beat)\n                      I need your help. A plane's gone down\n                      on Comb Bluff. This storm would blow\n                      a copter all over the place -- but we\n                      can climb up to it.\n\n                                        GABE\n                      \"We\"?\n                           (beat)\n                      Talk to somebody who's still on the\n                      payroll. You've got a half dozen new\n                      guys --\n\n                                        HAL\n                      -- who couldn't climb that wall now if\n                      there were stairs cut into it. But\n                      you've soloed it.\n\n                                        GABE\n                      During the summer. On a bet.\n\n                                        HAL\n                      This is a little more important than a\n                      bet. Just a few injured people with\n                      no first aid or shelter, camping in a\n                      zero degree blizzard. They'll be ice\n                      sculptures by tomorrow morning.\n\n                                        GABE\n                            (shakes his head)\n                      Maybe you missed the headlines -- but\n                      I don't do rescues any more. They're\n                      bad for my conscience.\n                            (beat)\n                      Fuck this one up on your own.\n\n        Gabe walks past Hal. Furious, Hal spins Gabe around.\n\n                                        HAL\n                      Play it again, Gabe, about how we\n                      killed her. I was there too, remember?\n\n                                        GABE\n                            (hot)\n                      Not like I was, pal -- her fingers\n                      brushed mine on the way down --\n\n                                        HAL\n                            (right back)\n                      -- and I was the one who had to deal\n                      with her family when you fucking tore\n                      out of town.\n                            (takes a breath)\n                      We lost her. Whatever anybody says\n                      about cold stress and the clip, you\n                      and I have to live with that. But\n                      right now, there are some more people\n                      who need our help, and they shouldn't\n                      die too just because you've got a\n                      problem keeping the past in the past.\n\n        Gabe knows he's right. But he's hesitant. And scared.\n\n                                        GABE\n                      I don't want the responsibility.\n\n                                        HAL\n                      Walk away and you are responsible.\n                      They'll die. I can't do this alone.\n                            (Gabe slows but doesn't\n                             stop)\n                      You know what else, Gabe? You can go\n                      anywhere you want, but if you don't do\n                      this, now, you're going to be stuck on\n                      that goddamn ledge for the rest of\n                      your life.\n\n        Gabe turns. Sees Maggie in the doorway. She's heard every\n        word. Gabe turns to Hal -- hesitates -- and nods.\n\n        EXT. COMB BLUFF TRAILHEAD - WIDE SHOT - DAY\n\n        Relative to the other mountains, Comb Bluff is smaller --\n        about 2,500 feet high. But that's like saying the Empire State\n        Building is smaller than the Sears Tower. It's still a long\n        way up if you're climbing the stairs.\n\n        ON THE GROUND - GABE AND HAL\n\n        with full packs of mountaineering gear on. They've got to\n        climb up this beast. Gabe -- now back in his orange Sheriff's\n        jacket -- scrambles with Hal up the base of the mountain, the\n        last few yards before it turns into a sloping wall. Gabe\n        takes a bolt gun -- which fires rope-fastened bolts into\n        rock -- and hangs it from a strap on his chest.\n\n                                        HAL\n                            (indicating gun)\n                      That thing's dead weight. Completely\n                      useless for an ice climb.\n\n                                        GABE\n                      Just backup.\n\n        Gabe readies a coil of rope and starts up the wall.\n\n                                        GABE\n                            (not a challenge)\n                      I'll lead. I left a few bolts last\n                      time I climbed this -- I think I can\n                      find some of them.\n\n        Hal starts up after Gabe, easily keeping pace with him.\n\n                                        HAL\n                      Save the rope for when it gets tough.\n                            (beat, realizing)\n                      That bet was for you to free climb\n                      the wall.\n\n                                        GABE\n                            (further up)\n                      Tell you what, Hal -- if we're still\n                      alive tomorrow morning, I'll give you\n                      the twenty bucks back, okay?\n\n        COMB BLUFF - LONG SHOT\n\n        Two orange specks move their way up the mountain -- it's\n        definitely going to be a long trip.\n\n                                                           DISSOLVE TO:\n\n        EXT. COMB BLUFF - LONG SHOT - DAY - GABE AND HAL\n\n        are now visibly two-thirds of the way up.\n\n        CLOSER ON GABE AND HAL - THE MOUNTAIN FACE\n\n        is not only higher, it's a lot tougher to climb. Instead of\n        being angular, the wall is now completely vertical -- and\n        coated with ice. Rough, irregular ice ledges are all Gabe and\n        Hal can grip -- it's a matter of grabbing what you can for a\n        handhold, and kicking the spikes of the steel crampons on\n        their boots into the ice for footholds. Gabe leads, planting\n        pitons into the ice, threading the rope through them as he\n        goes. Three steel pins between Gabe and Hal. Their only safety\n        net. Gabe, trailing rope behind him, goes up a difficult slab\n        of ice and climbs under a ledge, where he anchors the rope in\n        the ice with another piton.\n\n                                        GABE\n                            (shouting down)\n                      Anchored!\n\n        HAL\n\n        is beside and slightly below Gabe -- at the other end of the\n        fifty foot rope. Hal cautiously pulls himself along the line\n        to the first piton -- as is standard for a climb, he pulls out\n        the piton, then moves on to the second -- but up above\n\n        HIGHER ON THE MOUNTAIN\n\n        Ice, building in a small crevase, builds and CRACKS the\n        adjoining rock -- several ten-pound boulders fall, causing a\n        chain reaction\n\n        ROCKSLIDE\n\n        that bounces down the wall --\n\n        GABE\n\n        hugs the ice wall, making himself as flat as possible --\n\n                                        GABE\n                            (shouting down)\n                      Rockslide!\n\n        HAL\n\n        flattens too as rocks bounce past -- the second anchoring\n        piton LOOSENS as it is struck by a falling rock -- Hal\n        nervously eyes the last piton between him and Gabe --\n\n        THE PITON - CLOSE\n\n        also has been clipped by the still falling boulders and droops\n        at half mast -- no way are these going to hold in the\n        unreliable ice --\n\n        HAL\n\n        tries to stay flat, but one boulder painfully CLIPS him on the\n        shoulder, knocking him from his perch -- Hal falls --\n\n        WIDER - HAL FALLING\n\n        In falling, Hal's weight on the rope yanks out the nearest\n        anchor piton -- Hal tumbles in space, keeping pace with the\n        boulders, as --\n\n        GABE\n\n        who's seen everything we have, quickly reaches to the piton\n        he's just anchored, and removes the carabiner clip --\n\n        HAL - FALLING\n\n        The rope draws taut, yanking out the last piton between he and\n        Gabe -- nothing but a few yards of slack rope now --\n\n        GABE\n\n        has the bolt gun out. He rapidly hooks the rope's carabiner\n        clip to the chambered bolt, and FIRES it at a solid rock ledge\n        above him --\n\n        INSERT - THE BOLT\n\n        imbeds solidly in the rock --\n\n        GABE\n\n        lashes the rope to his shoulder, bracing for the coming impact\n        by lodging his feet in the ice --\n\n        THE JOLT - WIDER SHOT\n\n        The line pulls taut, leaving Hal suspended, the wind knocked\n        out of him from the impact --\n\n        GABE\n\n        is almost dragged down by the jolt -- he painfully takes most\n        of the impact in his shoulders -- the shock forces his feet\n        through an ice ledge -- but the rope, bolted to the rock\n        above, has held. Barely.\n\n                                        GABE\n                            (shaken, voice gone)\n                      Anchored --\n                            (shouts this time)\n                      Anchored!\n\n        HAL\n\n        now somewhat recovered, steadies himself.\n\n                                        HAL\n                            (breathless too)\n                      You're sure this time --\n\n        Hal climbs up the rope, finally reaching another ledge\n        slightly below Gabe's. Hal leans against the wall, gasping, as\n        Gabe clips the gun to his pack.\n\n                                        HAL\n                            (looking up at gun)\n                      Don't say it --\n\n                                        GABE\n                            (wheezing too)\n                      It's kind of hard to resist --\n\n                          GABE                         HAL\n                  It's not dead                It's not dead\n                  weight -- you                weight -- I am.\n                  are.\n\n        Hal and Gabe start howling -- that hysterical, giddy laugh\n        that only comes from just missing a violent end.\n\n        WIDE SHOT ON MOUNTAIN - THE TWO LEDGES\n\n        Hal and Gabe's friendship is starting to resurface -- their\n        LAUGHTER is nearly louder than the wind, as we --\n\n                                                           DISSOLVE TO:\n\n        EXT. PRECIPICE EDGE - DAY - BINOCULAR POV\n\n        From the top of the bluff, someone is looking down through\n        binoculars -- Gabe and Hal's orange jackets are plainly\n        visible a few hundred yards below.\n\n        RYAN\n\n        lowers the binoculars, and keys an ear button on the headset\n        radio he's wearing, sending a beep.\n\n        INSIDE THE PLANE\n\n        Travers is wearing another headset -- the others are just\n        resting in the seats\n\n                                        TRAVERS\n                            (into mouthpiece)\n                      Have they arrived?\n                            (two beeps in response)\n                      Good. Return to the plane and cover\n                      your tracks.\n\n                                        QUALEN\n                            (to others)\n                      Get ready.\n\n        ON THE MOUNTAIN BELOW\n\n        Hal and Gabe are tired, but get a second wind from the\n        excitement of being almost on top. Gabe stops, breathless for\n        a second, then goes on. Hal lags a little behind.\n\n                                        GABE\n                      Come on -- the hard part's over.\n\n        Gabe heads up and over\n\n        THE MOUNTAIN'S EDGE/CRASH SITE\n\n        and helps Hal up. From here, the rest of the range looms\n        large. Even in the continuing snowstorm, it's a spectacular\n        sight -- but Gabe and Hal don't pause to enjoy it. This isn't\n        a trip for sport. Hal looks off into the trees, and sees the\n        torn tree stumps from the plane crash.\n\n                                        HAL\n                            (grim)\n                      That's it.\n\n        Hal and Gabe run into the wooded area and follow the\n        wreckage -- felled trees, a smashed wing -- and reach\n\n        THE FUSELAGE\n\n        which sits intact by the other edge of the precipice.\n\n                                        GABE\n                      I thought the fuselage was broken.\n                      That looks pretty cozy.\n\n                                        HAL\n                            (puzzled too)\n                      The pilot was hysterical.\n\n                                        GABE\n                      Something's wrong here --\n\n                                        HAL\n                      Does this look like a prank to you?\n                      Come on --\n\n        Hal pulls open the passenger door and goes in -- Gabe, wary,\n        takes a look around the plane.\n\n        INSIDE THE FUSELAGE\n\n        It's comparatively dark in here -- Hal starts in, shining a\n        light -- the beam finds\n\n        HAL'S POV - TRAVERS\n\n        slumped down on the cabin floor, a blanket wrapped around\n        him -- he's shaking and is generally giving a good impression\n        of a shock victim. Hal rushes to him.\n\n                                        HAL\n                      Relax -- we're here to help --\n\n        \"Weak\", Travers whispers as Hal gives him some water.\n\n                                        HAL\n                      Don't try to talk --\n\n        Travers won't quit -- Hal leans down to hear.\n\n                                        TRAVERS\n                            (hoarse whisper)\n                      Where?\n\n                                        HAL\n                      -- Where? What are you --\n\n        A gun barrel moves INTO VIEW as it presses against Hal's neck.\n        Heldon and Ryan are right behind him. Travers instantly drops\n        his act.\n\n                                        TRAVERS\n                      You said \"we\". Where are the rest?\n\n        GABE - OUTSIDE THE FUSELAGE\n\n        notes footprints in the snow -- fresh ones -- and kneels down\n        to look at the cable wrapped around the tree. No ordinary\n        accident. But before he can think about this, he gets an\n        earful of gun barrel from Qualen, who is behind him.\n\n        INSIDE THE FUSELAGE\n\n        Qualen hustles Gabe inside the plane -- his hands are on his\n        head, and his pack has been removed. Qualen throws the pack\n        to Ryan and Delmer, who rifle through it, removing anything\n        that could be a weapon -- they quickly confiscate Gabe's bolt\n        gun and ice axe.\n\n                                        TRAVERS\n                      What's for dinner?\n                            (Kynette tosses packet)\n                      Ugh. \"Dried Beef Slices With Barbeque\n                      Sauce.\"\n                            (tosses it back)\n                      Try and make this edible.\n\n        Travis looks at Hal's park ranger badge.\n\n                                        TRAVERS\n                      Hal Tucker.\n                            (to Gabe)\n                      Where's yours?\n\n                                        QUALEN\n                      He doesn't have one. Just a wallet.\n\n        Qualen tosses it to Travers, who glances through it.\n\n                                        TRAVERS\n                      Gabe Walker...\n                            (notes photo of Maggie)\n                      Very attractive.\n\n                                        GABE\n                      My ex.\n\n                                        TRAVERS\n                      Too bad. Let me tell you what's on for\n                      today. We'd like you to help settle a\n                      wager. You see, we lost some\n                      luggage --\n\n        Travers motions to Ryan and Qualen, who shove Gabe and Hal\n        forward in the cabin. Travers takes out the tracer monitor.\n\n                                        TRAVERS\n                            (showing them the blips)\n                      See these? Now I've bet the gentlemen\n                      behind you that you know enough about\n                      this mountain range to lead us to each\n                      of these, quickly, and that you'd be\n                      happy to do so. They bet me you\n                      couldn't and wouldn't.\n                            (guns are clicked)\n                      Now tell me -- who wins?\n\n        Gabe and Hal eye each other -- no choice. Gabe nods.\n\n                                        TRAVERS\n                      Good dog. Now let's get this\n                      expedition started.\n\n        EXT. FACING MOUNTAIN - WIDE SHOT\n\n        Hal and Gabe lead the \"expedition\" down a steep, but passable,\n        descent, leading to --\n\n        A NATURAL STONE BRIDGE\n\n        that links Comb Bluff with the next mountain. Travers stops\n        Gabe and pulls out the monitor.\n\n                                        TRAVERS\n                      Okay. Connect the dots.\n\n        Gabe pauses as he holds the monitor up against the\n        mountainscape.\n\n        MOUNTAIN AND MONITOR\n\n        The first blip is up a thousand feet -- it's a wall, and\n        obviously not something for a novice. Gabe pauses a little\n        too long -- Qualen nudges him with his gun. Gabe hands the\n        monitor back to Travers.\n\n                                        GABE\n                      This way.\n\n        Gabe, with Hal right behind, leads them up the wall -- it's\n        not a straight climb, but there's a series of zig-zagging\n        natural ledges that cut up the wall. Wide enough even for an\n        amateur. The others follow Gabe and Hal's example.\n\n                                                           DISSOLVE TO:\n\n        EXT. MOUNTAIN WALL - WIDE SHOT - DAY - HAL AND GABE\n\n        have led the gang further up the wall, using pitons and\n        carabiner clips to create a guide rope. It's still just a\n        matter of climbing relatively easy ascending ledges. Hal and\n        Gabe lead them by jumping to the next ledge.\n\n        CLOSER ON HAL AND GABE\n\n        As Gabe hammers in a new piton, he turns to Hal.\n\n                                        GABE\n                            (sotto)\n                      We don't have to do this. We know\n                      these mountains -- they don't. If we\n                      can get ahead --\n\n                                        HAL\n                      Can you climb faster than they can\n                      shoot?\n\n                                        GABE\n                      We've got to try something. Think\n                      we'll get a finder's fee after they\n                      get all their \"luggage\"?\n\n                                        HAL\n                      Sure. All the bullets we can eat.\n\n                                        GABE\n                      That's not what really worries me.\n\n                                        HAL\n                      There's something else to worry\n                      about?\n\n                                        GABE\n                      Yeah. Once they've got what they're\n                      after -- they're gonna need a copter\n                      to get out of here.\n\n                                        HAL\n                            (realizing)\n                      Maggie.\n\n        Gabe nods grimly -- and keeps moving up. The rest keep pace.\n\n        THE WALL\n\n        The climbers have reached a point of comparative comfort on\n        the wall -- the ledge is now two feet wide. Travers takes out\n        the tracer monitor -- the monitor shows that the first case is\n        just above them.\n\n                                        TRAVERS\n                      Hold it.\n                            (beat)                      \n                      It's up there.\n\n        \"UP THERE\" - AN OVERHANG\n\n        juts out of the wall fifty feet above their position. As the\n        rest of the wall above is completely sheer, it's obvious that\n        the case, if it is above, has landed on top of a ledge.\n\n        But this isn't easily accessible -- we MOVE DOWN from the\n        overhang and can see there are only the smallest of handholds\n        to get up there, and those are slick with ice and snow. Worse,\n        the rest of the mountain bulges outward in a curve, making\n        climbing almost impossible.\n\n        ON THE LEDGE\n\n        Travers holds his gun on Gabe, and motions up\n\n                                        TRAVERS \n                      Fetch.\n\n                                        GABE\n                      I'll need the ice axe.\n\n                                        TRAVERS\n                            (laughs)\n                      You've got to be kidding.\n\n                                        GABE\n                            (sighs)\n                      Okay. How about some tape?\n\n        Travers nods -- Kynette pulls a roll of tape out of Gabe's\n        confiscated pack and throws it to him.\n\n\n                                        GABE         \n                      Crampons too.\n\n        Travers hesitates, but nods -- Kynette throws him the iron\n        spikes. Gabe fastens them to his boots.\n\n        Gabe looks up -- this is going to be tough, even for him. In\n        spite of the cold, he takes off his gloves -- that's how small\n        these holds are -- and he meticulously tapes up his hands and\n        his fingers.\n\n        HIGH ANGLE - GABE\n\n        moves up the wall with some ease at first -- there are\n        hand-sized handholds, and decent footholds -- but twenty feet\n        up, there's nothing. To keep going, Gabe has to painfully\n        wedge his fingers into small cracks, essentially supporting\n        his weight only by several fingerholds at any given moment.\n        We can see from the angle that Gabe is at least 3,000 feet\n        from solid ground. We can see from his face that he's trying\n        not to think about it.\n\n        ON THE LEDGE - TRAVERS AND QUALEN\n\n        watch Gabe's slow progress.\n\n                                        QUALEN\n                      I don't trust him.\n\n                                        TRAVERS\n                            (indicating wall)\n                      Where could he go?\n\n                                        QUALEN\n                      I'd rather he didn't show us.\n                            (beat)\n                      We don't need two guides.\n\n                                        TRAVERS\n                            (shrugs)\n                      You win. Kill him when he gets down.\n\n        GABE ON THE WALL - CLOSE\n\n        Make that \"if he comes down\". Gabe is now in one of the\n        worst positions possible for a free climb. He is moving up\n        the underside of the overhang and is essentially hanging\n        upside down, knifing his fingers into tiny cracks for support.\n        It's excruciating -- both in terms of muscular effort, and the\n        abrasions that come from forcing fingers into ice and rock\n        again and again. Gabe keeps his hold with one hand and slides\n        the other up, hammering it into a crack wedge with ice --\n        some of the ice chips whistle past and down --\n\n        -- finally, Gabe gropes one hand over the edge, and pulls\n        himself onto\n\n        THE OVERHANG\n\n        Exhausted, Gabe pulls himself prone across the top. Something\n        hard is underneath him -- Gabe recovers and brushes the snow\n        off the money case that's underneath. It's battered from the\n        fall, but is still barely holding together. Gabe manages to\n        force open the trashed locks -- he looks inside the case, and\n        fingers a band of $5000s.\n\n                                        GABE\n                      Jesus.\n\n        ON THE LEDGE - TRAVERS AND QUALEN\n\n        look up. They can see Gabe has made it -- but they can't see\n        him, or the case.\n\n                                        TRAVERS\n                            (impatient, shouting)\n                      Lower it down -- now!\n\n        ON THE OVERHANG - GAB\n\n        has no intention of doing this -- he snaps the case shut and\n        looks over at a ledge that moves off from it -- and at the ice\n        and snow above.\n\n        ON THE LEDGE - TRAVERS AND QUALEN'S POV\n\n        try to look up and locate Gabe. They can't. Until -- \n\n                                        GABE (O.S.)\n                            (shouting down)\n                      I've got a better idea. Why don't you\n                      come up and get it?\n\n        With the case, Gabe moves, back against the wall, on a ledge\n        that skirts off the overhand -- from Travers and Qualen's\n        point of view. Gabe can hardly be seen -- since the mountain\n        bulges out as it goes up. Gabe's got a slight edge of cover.\n\n                                        TRAVERS\n                            (shouts to Heldon)\n                      Get him!\n\n        Heldon runs along the lower ledge, FIRING up at --\n\n        GABE\n\n        who has to flatten against the upper ledge -- bullets howl\n        past at twenty per second, SPARKING against the lip of the\n        rock -- it's cover, but not much --\n\n        HAL\n\n        looks up, worried --\n\n        HAL'S POV - ICE AND SNOW\n        \n        piled by the ton from the storm, lie further above -- the ice\n        holding it back already, already weakened by the sun, is being\n        chiselled away by bullets --\n\n        ON THE LOWER LEDGE - QUALEN\n\n        grabs Hal and puts the gun to his head.\n\n                                        QUALEN\n                            (shouting)\n                      Bring the money down, or we kill your\n                      friend!\n\n        Travers pushes the barrel away from Hal, shaking his head.\n\n                                        TRAVERS\n                      We can't.\n                            (frowning)\n                      And he knows it.\n\n        WIDER ANGLE ON MOUNTAIN - THE PARALLEL LEDGES\n\n        Gabe moves across his thing ledge as Heldon runs across his --\n        Gabe ducks back and has to flatten even more against the wall,\n        because his ledge is getting smaller --\n\n        HELDON\n\n        smiles, seeing Gabe's cover is gone -- Heldon's ledge is\n        getting wider, so it's easier for him to fire up. Heldon moves\n        out to the edge --\n\n        GABE'S POV DOWN\n\n        There's now nothing between Heldon and Gabe -- Heldon takes\n        dead aim --\n\n        GABE\n\n        looks up, sweating it --\n\n                                        GABE\n                      Come on --\n\n        THE ICE AND SNOW\n\n        above finally give way, dropping an avalanche on\n\n        GABE\n\n        who drops the case and hugs the wall --\n\n        THE AVALANCHE - WIDE VIEW ON MOUNTAIN\n\n        Only now can we see how much snow and ice had been penned up\n        on the mountain top -- tons of ice and snow sweep down the\n        mountainside -- it SHATTERS the case against the wall as it\n        easily swipes a SCREAMING Heldon off the ledge --\n\n        TRAVERS, QUALEN AND HAL\n\n        are safe at their vantage, but stunned at the sight of --\n\n        THE AVALANCHE\n\n        Heldon's machine fun FIRES uselessly as he's swallowed in an\n        explosion of white -- as well as a flurry of green as the\n        bills scatter amid the snow --\n\n        -- then: quiet. The avalanche ends as abruptly as it started.\n        The rumble dies down to complete silence.\n\n        TRAVERS\n\n        apoplectic, stares at seventeen million dollars worth of snow\n        settling far below. He takes his gun, furious, and fires at\n\n        THE UPPER LEDGE\n\n        where Gabe was hugging the wall -- it's now blanketed with\n        snow. Travers FIRES an entire clip at where Gabe used to be.\n        The snow FALLS AWAY, revealing nothing but stark rock. Gabe\n        has been swept away.\n\n        HAL\n\n        reacts and attacks Travers.\n\n                                        HAL\n                      You son of a bitch --\n\n        Travers turns and pins Hal against the wall with the gun,\n        ready to kill him too. But he's stopped by Qualen.\n\n                                        QUALEN\n                      No. We need him to get the rest of the\n                      money.\n                            (he isn't backing down)\n                      If he dies we lose everything\n\n        Travers, furious, takes the gun out of Hal's face.\n\n                                        TRAVERS\n                            (to Hal)\n                      Get us out of here.\n\n        Hal stares at Travers with absolute fury -- but he leads the\n        gang back along the ledge in retreat.\n\n        EXT. FURTHER DOWN THE MOUNTAIN - DAY\n\n        Powdery snow is settling from the avalanche. From a cave in\n        the rocks, Brett and Evan crawl out a little timidly.\n\n                                        EVAN\n                      What the hell --\n\n        Evan takes a pair of overpriced binoculars and looks up --\n\n        BINOCULAR POV - FAR UP ON LEDGE\n\n        The figures are small, but it's clear that one is pointing a\n        gun at an orange-jacketed figure.\n\n        EVAN\n\n        lowers the binoculars.\n\n                                        EVAN\n                      Brett -- you're not going to believe\n                      this -- but a couple of guys are\n                      holding a gun on Hal and forcing him\n                      up the bluff --\n\n                                        BRETT (O.S.)\n                      I believe it.\n\n        Evan turns to\n\n        BRETT\n\n        who has found both Heldon's broken body, and his gun, half\n        buried in snow. Evan walks over, amazed.\n\n                                        EVAN\n                      What the fuck is going on here?\n\n        Brett picks up the gun -- this is more an adventure than he\n        ever dreamed of.\n\n                                        BRETT\n                      Let's catch up and find out.\n\n        Brett and Evan grab their packs, and hurry onto a trail, as we\n        return to --\n\n        THE UPPER LEDGE\n\n        where Gabe was. Nothing is stirring. Until, there's some\n        movement ten feet from where Gabe was hugging the wall.\n\n        It's a crevice in the mountain, about two feet wide -- a\n        climber would call this a \"chimney\" -- and it's packed with\n        ice and snow. It's also packed with\n\n        GABE\n\n        -- his hand gropes out -- and with some difficulty, he digs\n        himself out, gasping and coughing. Gabe, coated with snow,\n        leans against the wall and rests. Alive.\n\n        INT. RANGER STATION - DAY\n\n        Maggie is on the phone, pacing, as Frank is slumped in front\n        of the radio scanner. Suddenly, the radio comes to life.\n\n                                        HAL (O.S.)\n                      -- Come in, Rescue Unit -- over --\n\n        Maggie bolts over to the radio before Frank can react.\n\n                                        MAGGIE\n                            (keying mike)\n                      Rescue Unit -- what's going on,\n                      Hall? -- over --\n\n        EXT. MOUNTAIN - WOODED AREA - DAY\n\n        Travers has his gun pressed to Hal's temple.\n\n                                        TRAVERS\n                      No tricks, no procedural codes, no\n                      personal messages -- just tell them\n                      everything's under control and you're\n                      taking care of the wounded.\n\n                                        HAL\n                            (keys it)\n                      We've reached the wreckage -- top of\n                      Comb Bluff -- six injured, but they're\n                      responding to treatment. Everything\n                      A-OK. Over.\n\n                                        MAGGIE (O.S.)\n                      Everything isn't okay, Hal -- I'm\n                      coming up after you -- over --\n\n                                        HAL\n                      Negative, Maggie. Winds are too\n                      high, and the passengers' injuries are\n                      all superficial. We're going to ride\n                      out the storm here -- over --\n\n        Travers yanks away the radio.\n\n                                        TRAVERS\n                      Have her come up.\n\n                                        HAL\n                      Forget it -- downdrafts would wipe her\n                      all over the peaks --\n                            (Travers starts to argue)\n                      -- Not that I expect you to give a\n                      shit, but it's our only copter.\n                      You'll be stuck.\n\n        Travers relents and hands the radio back.\n\n                                        MAGGIE (O.S.)\n                      I can handle the winds --\n\n                                        HAL\n                            (breaking in)\n                      Forget about it, Maggie, that's an\n                      order -- acknowledge --\n\n        INT. RANGER STATION\n\n        Maggie looks out the window. The station's windspeed gauge is\n        flying around so fast it looks like it might take off.\n\n                                        MAGGIE\n                      Acknowledged. Let me talk to Gabe --\n                      over --\n\n                                        HAL (O.S.)\n                            (hesitates)\n                      You can't. He's taking care of\n                      passengers. Just like I should be.\n                      Over and out.\n\n        Maggie leans back in the chair, looks out at the storm, and\n        tries not to worry. She fails miserably.\n\n        EXT. MOUNTAIN - WOODED AREA - TRAVERS AND HAL\n\n                                        TRAVERS\n                            (snatching radio away)\n                      Good. You might live longer than your\n                      friend. Now --\n                            (takes out monitor)\n                      -- what?\n\n        Hal takes the monitor -- the next blip is above, almost\n        straight up. Hal motions to the wooded area ahead.\n\n                                        HAL\n                      The next one's on top of the peak.\n                      This'll be long, but easy -- more like\n                      a hike than a climb.\n\n                                        TRAVERS\n                            (suspicious)\n                      It looks like a winding route.\n\n                                        HAL\n                      There's a more direct route. The East\n                      Face. But it's the wall on the other\n                      side, and it's smooth as glass. Maybe\n                      a dozen guys in the world could do it\n                      in good weather. Only a psycho would\n                      try it in a snowstorm.\n\n        Travers digests this, and motions Hal to move on as we --\n\n                                                           CUT TO:\n\n        CLOSE SHOT - GABE'S FACE\n\n        is torn in pain. In spite of the cold and wind, he's drenched\n        in sweat, half exertion, half fear. We pull back to take in\n\n        THE EAST WALL - LONG SHOT\n\n        Envision a wall. A really big wall. A really, really big wall.\n        A wall that's as wide as it is high -- five thousand feet by\n        five thousand feet -- narrowing to a domed peak at the summit.\n\n        Now picture the same wall, checkered with ice. If this were\n        horizontal, you or I couldn't walk on it without falling.\n\n        Now picture the same wall with an orange dot, two-thirds of\n        the way up it. The orange dot is\n\n        GABE\n\n        and he barely has the strength to hold on, much less go up.\n        Gabe holds himself steady with one hand, gets a foothold, and\n        swings another hand up to SLAM it against the wall.\n\n        He's improvised gear -- he's tied a crampon to one hand. But\n        it's as awkward as it sounds. Gabe moves up only a foot or so\n        -- then pulls out the crampon, reaches up, and SLAMS it into \n        the wall, starting the painful process over again.\n\n                                                           CUT TO;\n\n        INT. DENVER MINT - WRIGHT'S OFFICE - DAY\n\n        Wright's pacing around, trying to figure out what in his\n        office he should break first. Davis shows up at the door.\n\n                                        WRIGHT\n                            (furious)\n                      Okay -- I know it's not in San\n                      Francisco. I know it's not here. I\n                      know it's not in any fucking airport\n                      from here to Montana. Where it's\n                      not - we got that covered. Now, do\n                      you have any ideas on where it is?\n\n                                        DAVIS\n                            (walking to a map)\n                      There's no radio contact, sir. At all.\n                      We're not receiving the tracer signal\n                      from the cockpit's flight recorder.\n                      Radar lost it after it went low here.\n\n        He points to a huge part of Colorado. Hundreds of square\n        miles.\n\n                                        DAVIS\n                      We have to assume it went down in the\n                      storm.\n\n                                        WRIGHT\n                      Air search?\n\n                                        DAVIS\n                            (shakes head)\n                      That storm hasn't quit yet. Weather\n                      service says we've got it until\n                      tomorrow morning at least. Even if we\n                      could get a plane up now, it'd be\n                      impossible to see anything on the\n                      ground. And --\n\n        Wright slumps into a chair.\n\n                                        WRIGHT\n                      -- The roads are shut down, right?\n\n                                        DAVIS\n                      Most of this area doesn't even have\n                      roads.\n\n                                        WRIGHT\n                            (rubs his eyes)\n                      Keep two copters on full standby. And\n                      let me know the second that storm\n                      starts to wind down.\n\n                                                           CUT TO:\n\n        EXT. THE EAST FACE - WIDE SHOT - DAY - GABE\n\n        is clearly exhausted and freezing -- his lips are blue, his\n        eyebrows encrusted with snow. Wind still threatens to knock\n        him off the wall -- but he forces himself on.\n\n                                        GABE\n                            (teeth chattering)\n                      A steambath.\n                            (spikes himself up)\n                      A steambath -- and a bottle of\n                      whiskey.\n                            (new foothold)\n                      A steambath with a bottle of\n                      Glenlivet. And a fire.\n                            (new handhold)\n                      A steambath -- with a bottle of\n                      Glenlivet -- and a steak.\n                            (new foothold)\n                      A steak soaked with Glenlivet, cooking\n                      over a steambath on fire.\n\n        WIDER ON MOUNTAIN\n\n        Gabe finally reaches the top of the wall, where it meets an\n        enormous overhang of ice.\n\n        GABE\n\n        is right underneath where the ice flows over the wall. Gabe\n        takes his handheld crampon and hammers it into the ice\n        overhead with more force than usual. This one is going to have\n        to hold.\n\n        Gabe steels himself for a tough move -- with one hand gripping\n        that crampon, he swings out, away from the wall.\n\n        Only the crampon spikes jammed into the ice above his hand\n        are keeping Gabe from falling. Gabe needs the second crampon\n        to make the move up -- but that's not going to be easy to get.\n        It's attached to his boot.\n\n        As Gabe clings to the upper crampon, his body swaying, he\n        reaches down with his free hand to loosen the other crampon.\n\n        GABE'S POV - DOWN\n\n        The ground is one slip and five thousand feet away. Gabe\n        fumbles desperately with the buckles on the crampons -- but\n        both his fingers, and the buckles, are frozen stiff --\n\n        GABE'S FACE\n\n        shows real, solid terror for the first time --\n\n        GABE'S POV - DOWN\n\n        Gabe gets the first buckle off -- then the second. The crampon\n        is off his boot.\n\n        GABE\n\n        still swinging from one hand, takes the now-freed crampon and\n        slams it into the ice. It doesn't hold -- but the force of\n        Gabe's swing, pushing him away, has loosened the other\n        crampon. Gabe only gets one more shot at this -- he swings\n        the free crampon up with all his might -- it catches in the\n        same split second as the other dislodges.\n\n        But the hard part is over -- with the two crayons, Gabe\n        quickly manages to climb up over the lip of\n\n        THE ICE OVERHANG\n\n        This is a field of ice sloping up to the top. Gabe pulls\n        himself a few feet away from the edge, and puts the crampons\n        back on his feet where they belong. It's now pretty simple for\n        Gabe to run up the ice slope three hundred yards to\n\n        THE SUMMIT\n\n        which is a rocky, wooded area. Gabe seems to have a second\n        wind now -- he runs to the other side of the summit. The other\n        side is obviously the route Hal and the others will be\n        taking -- beneath the summit is a winding, well-beaten path.\n        Gabe finally arrives at a small shack with a sign nearby\n        commemorating the \"DOUGLAS EXPEDITION - 1933\".\n\n        INT. THE SHACK\n\n        is just a small \"point of interest\" shed for hardy tourists\n        who have hiked up this far -- there is a corny photo stand,\n        where you stick your head through a hole, so your face is put\n        on top of a cartoon climber hacking up a mountain. Gabe rushes\n        past this to a glass display case on the wall.\n\n        THE GORDON DOUGLAS DISPLAY\n\n        has black and white photos of a square jawed 1930s climber\n        with his expedition -- more important is what's beneath it.\n        Douglas' original climbing equipment -- a coil of rope, some\n        pitons, a hat, a cloth backpack, small binoculars, other odds\n        and ends. Gabe prepares to smash the glass -- and hesitates.\n        Respect.\n\n                                        GABE\n                            (sighing)\n                      Sorry, Gordon -- I promise I'll have\n                      it back tomorrow.\n\n        Gabe SMASHES the glass as we move to --\n\n        EXT. THE TRAIL - DAY\n\n        Hal is leading Qualen, Travers and the others upward -- this\n        is a comparatively easy route, but still tiring. The sun goes\n        down beyond a facing, taller mountain. Ryan is huffing and\n        puffing -- the altitude and exertion are getting to him. Hal\n        allows himself a smile at his discomfort.\n\n                                        HAL\n                      Come on -- tourists take this trail.\n\n        Qualen pokes Hal with the gun -- he moves on ahead.\n\n        EXT. THE SUMMIT - DUSK\n\n        It's getting dark rapidly -- Gabe has scaled a rock formation\n        so he has a view of the rest of the summit --\n\n        GABE'S POV - SCANNING THE TREELINE\n\n        Gabe slowly looks along the trees of the summit -- looks\n        pretty ordinary to us, but something must have caught Gabe's\n        eye, because he swings back to look at one tree. With broken\n        branches on top.\n\n        GABE\n\n        climbs down from his rock perch and rushes toward the tree.\n\n        EXT. SUMMIT TRAIL - NIGHT\n\n        This \"expedition\" reaches the top -- Hal is in the lead, with\n        Qualen just inches behind. Qualen shoves Hal forward.\n\n                                        TRAVERS\n                      Is this it?\n\n                                        HAL\n                      Yeah. This is it.\n\n                                        TRAVERS\n                      Good. Get out of the way.\n\n        Travers takes out the tracer and starts following the blip.\n\n        ELSEWHERE ON THE SUMMIT - GABE\n\n        frantically rushes around, looking for the case -- he spots a\n        crater of snow, rushes to it and starts digging. Even below\n        the snow, the tracer's blinking red light is glowing and\n        visible. Gabe laughs as he digs it out.\n\n        NEARBY ON THE SUMMIT - TRAVERS\n\n        has his eyes glued to the tracer monitor, which shows the case\n        is nearby.\n\n                                        TRAVERS\n                            (smiling)\n                      This way.\n\n        Qualen shines a light -- all of them push their way through\n        the trees.\n\n        TRAVERS\n\n        is excited now -- he can't even wait for Qualen's flashlight,\n        he intuitively races through the trees, dividing his attention\n        between his surroundings and\n\n        THE MONITOR\n\n        which shows he's practically on top of the case -- finally\n\n        TRAVERS\n\n        shoves his way through some small pines -- he can see the\n        blinking of the red tracer light ahead through the branches.\n\n                                        TRAVERS\n                            (calling behind)\n                      It's over here!\n\n        Travers shoves his way through the branches, and heads for the\n        light -- but something's wrong -- Qualen comes up behind\n        Travers and shines the light on\n\n        A SNOWMAN\n\n        cute, if hastily constructed, stands with a five-pebble smile,\n        as well as Douglas' cap, in a clearing. The still blinking,\n        still operable tracer is now the nose of the snowman. The case\n        is leaned up against it.\n\n        Travers runs over to the case, furious, and opens it. It's\n        empty -- except for a single $5000 bill. Travers picks it\n        up -- scrawled on the margin is \"LET'S TRADE.\"\n\n                                        TRAVERS\n                            (incredulous)\n                      He's still alive.\n                            (furious)\n                      He's still alive!\n                            (to Qualen and the\n                             others)\n                      He can't be far away -- spread out!\n\n        Qualen, Kynette, Delmer and Krystel fan out into the woods,\n        each with a flashlight and a fun. Ryan, however, straps on\n        nightfinder goggles and runs out without a flashlight.\n\n                                        TRAVERS\n                            (to Hal, brandishing gun)\n                      Put your hands on your head.\n\n        ELSEWHERE ON THE SUMMIT - GABE\n\n        watches the chaos with a grin from a slightly elevated vantage\n        point -- he can see the flashlight beams, all headed in the\n        wrong direction. But he doesn't see\n\n        RYAN - \"NIGHTFINDER\" POV\n\n        With these goggles, light is amplified a thousandfold -- this\n        isn't one of those infra-red, thermo-blob jobs -- it looks\n        more like day for night photography. Even starlight is enough\n        for Ryan to run easily through the thick woods -- and he's\n        going in the right direction.\n\n        GABE\n\n        begins climbing down to level ground so he can circle closer\n        to where Travers is holding Hal -- before he can get far --\n\n        \"NIGHTFINDER\" POV - RYAN\n\n        looks up, and can clearly see Gabe climbing down the small\n        rock, twenty yards distant --\n\n        RYAN\n\n        smiles, looking macabre under the goggles, and opens fire --\n\n        GABE\n\n        is startled as the bullets impact inches over his head -- he\n        jumps the last ten feet to the ground and is running even as\n        he hits the ground -- more bullets hit where Gabe was a\n        split second ago --\n\n        RYAN\n\n        chases Gabe, easily maneuvering through the trees --\n\n        GABE\n\n        runs too, trying to dodge Ryan's continuing fusillades -- Gabe\n        knows this territory, but to him, it's still pitch dark -- he\n        stumbles, and rams against trees --\n\n        RYAN\n\n        keeps coming up behind, closing the hap, Gabe's bright form\n        just ahead --\n\n        GABE\n\n        comes out of the trees and finds he is on another part of the\n        summit. All that's beneath him is\n\n        GABE'S POV\n\n        -- a sudden, sloping plunge down a field of ice. No escape\n        route here -- anything that goes down this slide is going all\n        the way to the ground far below.\n\n        GABE\n\n        is driven forward by a fresh burst of bullets -- he dives to\n        the edge of the ice field and ducks behind a boulder -- the\n        sole source of cover.\n\n        ELSEWHERE ON THE SUMMIT\n\n        Kristel, Qualen and Kynette, having heard the gunshots, are\n        now rushing to Gabe's position --\n\n        RYAN\n\n        almost casually emerges from the woods. He can see there is\n        nowhere for Gabe to have gone -- except behind the boulder. He\n        walks toward it as if he had all the time in the world.\n\n        GABE\n\n        fumbles in his backpack and pulls out something from the\n        Douglas exhibit -- an ancient flare that looks like a can of\n        sterno. Gabe pulls out his lighter and tries to light it -- it\n        resists and looks like a dud, but finally it catches, and as\n        it ignites Gabe heaves it over the boulder at Ryan --\n\n        RYAN - \"NIGHTFINDER\" POV - THE FLARE\n\n        arcs over the boulder to fully ignite, turning everything\n        into a blinding, agonizing flash of white --\n\n        RYAN\n\n        SCREAMS, putting one hand over the goggles, trying to rip them\n        off --\n\n        GABE\n\n        bolts out from behind the boulder to rush him --\n\n        RYAN\n\n        instantly aware of what Gabe's doing, blindly shoots, fanning\n        out in a semi-circle as he gets the goggles off --\n\n        GABE\n\n        just runs straight ahead to Ryan, getting to him before the\n        machine gun field of fire can intersect his path -- Gabe\n        tackles Ryan as he manages to get the goggles off -- both men\n        fall to the ground, and --\n\n        The machine gun CLATTERS away, landing on the edge of the ice,\n        just out of reach -- Ryan, now recovered from the blinding\n        flash, pulls an ice axe out of a pack sheath and swings it at\n        Gabe -- Gabe rolls away in time, and gets to the machine gun,\n        grabbing it -- But Ryan dives for Gabe, slamming into him --\n        the force of it knocks the machine gun loose -- it skips down\n        the ice slope -- but the momentum of Ryan's hit also carries\n        both Gabe and Ryan over the edge, onto --\n\n        THE ICE SLOPE\n\n        Gabe and Ryan both tumble over the edge and start sliding\n        down, Ryan face first on his stomach, Gabe head first and on\n        his back -- both are in immediate agony, because\n\n        CLOSE ON THE ICE\n\n        -- it's covered with razor sharp, irregular ridges, both large\n        and small, that slice through clothing and shred skin as they\n        pick up speed --\n\n        GABE'S UPSIDE-DOWN POV - THE ICE FIELD\n\n        The edge and a five thousand foot drop are less than a hundred\n        yards away --\n\n        GABE AND RYAN SLIDING\n\n        Ryan flails and SCREAMS as the ice gashes him from\n        underneath -- Gabe, however, manages to flip over and to the\n        side -- he lunges on top of Ryan and rides him down like a\n        bobsled --\n\n        GABE'S POV - END OF THE ICE SLOPS\n\n        is coming up too fast --\n\n        GABE\n\n        tries to maintain his perch on Ryan, who is SCREAMING and not\n        yet used to the idea of being a human sled -- he isn't\n        remaining still enough to provide a smooth ride -- Gabe\n        frantically reaches behind to Ryan's wrist to get the ice axe,\n        trailing from a wrist strap, but Ryan's arm is thrashing away,\n        threatening to toss off the axe --\n\n        ON SUMMIT\n\n        Qualen, Kristel and Kynette arrive at the lip, and look down,\n        incredulous --\n\n        QUALEN POV - GABE RIDING RYAN\n\n        Gabe and Ryan, accelerating, have almost reached the edge --\n\n        GABE\n\n        finally grabs the ice axe, pulling it off Ryan's wrist -- just\n        as they reach the precipice edge, Gabe loops the axe to his\n        wrist and swings toward the ice with everything he's got --\n\n        The axe's scythe-like blade catches on the ice, right at the\n        lip of the precipice -- Gabe is wrenched to a painful halt,\n        suspended over the drop, as what's left of Ryan, still\n        SCREAMING, shoots over the edge --\n\n        Gabe unhooks the axe, and gets another handhold. Gabe uses the\n        axe to climb further down the ice to some rock -- finding\n        easier hand holds, he quickly disappears into the darkness.\n\n        QUALEN, KRISTEL AND KYNETTE\n\n        look down -- Ryan's death scream is still echoing. Qualen is\n        furious -- Gabe has escaped with the second case.\n\n                                        QUALEN\n                            (to Kynette)\n                      Follow him!\n\n        Kynette shines his flashlight below, illuminating the long,\n        frozen streak of blood on the ice.\n\n                                        KYNETTE\n                            (gestures with light)\n                      After you.\n\n        INT. DOUGLAS TOURIST SHACK - NIGHT\n\n        The expedition has holed up here for the night -- Travers and\n        Qualen look upset. Things aren't going as well as they'd\n        hoped. Kristel tries to get some candy out of a vending\n        machine that's obviously empty. Kynette saws at some camp food\n        with a distinctive knife -- the handle is a set of brass\n        knuckles. Delmer guards Hal, who is bound, and seated by the\n        souvenir photo stand.\n\n                                        HAL\n                      Well -- look at the bright side.\n                            (beat)\n                      At least you've only got to make the\n                      split five ways now.\n\n        EXT. MOUNTAIN LEDGE - NIGHT\n\n        Gabe confidently drops down onto a large ledge that juts out\n        from the wall -- obviously familiar territory for him. The\n        ledge leads to a small, enclosed cave. Gabe takes out his\n        penlight and shines it -- but the light looks dim. Batteries\n        are low. Gabe pockets it, flicks his lighter and goes in --\n\n        THE CAVE\n\n        in the flickering light, we can see that no one has been in\n        here for a while -- snow, dust, rocks -- but we should also\n        recognize this from the photo seen earlier as Gabe, Maggie and\n        Hal's hangout.\n\n        GABE\n\n        smiles with the memories -- then his face brightens with one\n        memory in particular. Gabe rushes to a corner of the cave and\n        opens a rock-lid to a hiding place.\n\n                                        GABE\n                      Please still be there -- oh,\n                      please --\n\n        Gabe reaches in the stash and finds an ancient half-full pint\n        of Jack Daniels. The first thing to go right all day. Gabe\n        uncaps it and gratefully gulps down a double shot. Peace, at\n        last. Gabe smiles and leans against the wall, closing his eyes\n        -- but he's startled instantly by a SCREECH -- Gabe's eyes\n        shoot open --\n\n        An aggressive rat scurries toward him on the floor.\n\n        Gabe grabs a rock and CLOBBERS the rat off-screen, ending the\n        screeches with one blow. Gabe's face first registers\n        disgust -- then an idea. Then real disgust. Sighing, Gabe\n        pulls out a pocket knife and opens the blade.\n\n                                                           CUT TO:\n\n        INT. THE CAVE - A LITTLE LATER - CLOSE ON GABE\n\n        Gabe takes the now cooked rat carcass -- properly skinned and\n        butchered -- off his knife blade. We can see from flickering\n        shadows that a small fire is now burning in a cave -- we\n        pull back to see\n\n        THE FIRE\n\n        which is built out of small bundles of $5,000 bills. It's safe\n        to say that something like $500,000 is going up in smoke, and\n        the fire's dying down. Gabe tosses a fresh band of bills on\n        the flame. Gabe cools the knife in some snow, saws off a rat\n        leg, and chews unhappily.\n\n                                        GABE\n                            (mouth full)\n                      Mmm. Just like -- chicken.\n\n        Gabe sparingly washes the bite down with a taste of Jack\n        Daniel. It's going to have to last him. He has an entire rat\n        to get through.\n\n                                                          DISSOLVE TO:\n\n        EXT. WIDE MOUNTAIN VIEW - DAWN\n\n        The first rays of the sun start to poke through the mountains.\n        It's stopped snowing -- the storm seems to be letting up.\n\n        INT. RANGER STATION\n\n        Very quiet in here. Frank is snoring, slumped over the radio.\n        Maggie is wide awake and obviously hasn't slept -- her\n        attention is fixed out the window.\n\n        MAGGIE'S POV - WINDSPEED GAUGE\n\n        The gauge is still flying around, but clearly shows that the\n        winds are slowing.\n\n        INT. DENVER MINT - WRIGHT'S OFFICE\n\n        Wright is coiled at his desk, tense. Ten empty styrofoam\n        coffee cups -- and dark rings under Wright's eyes -- make\n        clear he hasn't slept. Wright's assistant bursts in.\n\n                                        DAVIS\n                      We've got a fix on the plane, sir --\n                      we're getting a reading on the flight\n                      recorder tracer --\n\n                                        WRIGHT\n                      Any visual? Any radio contact?\n\n                                        DAVIS\n                      Not yet --\n\n                                        WRIGHT\n                            (heading to the door)\n                      Get the copters ready. We take off in\n                      three minutes.\n\n                                        DAVIS\n                      The winds are still too strong --\n\n                                        WRIGHT\n                      Sorry to hear it. We're still going.\n                      The plane might be intact.\n\n        Wright drags the protesting Davis out the door.\n\n                                        DAVIS\n                      Sir --\n\n                                        WRIGHT\n                      Shut up. That fifty million isn't\n                      coming out of my pension.\n\n        EXT. MOUNTAIN TOP - DOUGLAS TOURIST SHACK - DAY\n\n        Travers, Qualen and the rest of the expedition head out of the\n        shack, a little groggy. Odds are no one got much sleep.\n\n        Travers shoves Hal toward a sketchy \"YOU ARE HERE\" map of the\n        mountain range, and hands him the tracer monitor.\n\n                                        TRAVERS\n                      Still interested in staying alive?\n\n        Hal matches the monitor to the map -- the blip is higher up.\n\n                                        HAL\n                            (pointing to map)\n                      It's up here. Somewhere on the Tower.\n                      There's a way to cross over to the top\n                      in about half a day.\n\n                                        TRAVERS\n                      Show me.\n\n        Travers shoves Hal forward -- the others follow.\n\n        ELSEWHERE ON THE MOUNTAIN/SUMMIT - BINOCULAR POV\n\n        From about fifty yards off, someone watches Hal lead the gang\n        away from the shack.\n\n                                        BRETT (O.S.)\n                      They're heading toward the opposite\n                      edge. An easy way down.\n\n        BRETT AND EVAN\n\n        are crouched in the woods. Brett, gun in hand, has no idea how\n        far out of his league he is. Evan looks like he's having\n        second thoughts, but he can't hack down now.\n\n                                        BRETT\n                      I'll cut around this side, and wind up\n                      in front. You come up behind them --\n                      quietly. And we've got 'em.\n\n                                        EVAN\n                      Brett -- they've got five guns --\n\n                                        BRETT\n                      And you can collect them all after I\n                      get the drop on 'em. Let's get moving.\n\n        Brett, automatic held high, circles off through the woods.\n        Evan reluctantly lopes off toward his assignment.\n\n        BELOW - GABE'S CAVE\n\n        Gabe pulls his jacket on -- reversed, with the grey lining\n        out, so the orange won't make him so easy to spot -- and\n        starts out towards the facing Tower -- his route, clearly, is\n        going to be along the rock wall. It's relatively sheer, but\n        there are shelves cut into it to make walking easy.\n\n        MOUNTAIN TOP/SUMMIT - BRETT\n\n        races quietly through the woods in a parallel path with Hal,\n        who's guiding the hang. Brett circles around ahead of them,\n        waiting. Before he can jump out --\n\n        HAL'S POV - ON BRETT\n\n        hiding ahead in the trees and rocks.\n\n        HAL\n\n        makes eye contact with Brett, realizes what he's doing, and\n        shakes his head as violently as he dares -- no, don't --\n\n        BRETT\n\n        gives Hal a confident wink in response, then pounces in front\n        of the gang, gun held high.\n\n                                        BRETT\n                      End of the line!\n\n        Travers, Delmer, Kristel and Kynette are startled, but don't\n        immediately comply. This throws Brett off his stride.\n\n                                        BRETT\n                            (nervous now)\n                      You heard me! Drop the guns!\n\n        Travers smiles and steps closer to Brett. The others walk up\n        in front of Hal. Travers actually laughs.\n\n                                        TRAVERS\n                      \"End of the line\"? That's classic.\n                            (beat)\n                      You've got style. So, I'm going to\n                      give you a three-count to figure out\n                      how to turn the safety off.\n\n        Brett doesn't even look down -- he responds by FIRING a short\n        burst over Travers' head.\n\n                                        BRETT\n                      Nice try. I've got one of these at\n                      home. Now drop 'em.\n\n        All drop their guns -- Brett, unfortunately, realizes at the\n        same time we do --\n\n                                        BRETT\n                      Hey -- where's the other guy --\n\n                                        HAL\n                            (shouting)\n                      Brett, behind you!\n\n        Too late -- Brett can only twist around half way before --\n\n        QUALEN\n\n        easily mows down Brett with his machine gun, riddling him with\n        at least thirty rounds at close range. Brett falls dead into\n        the snow. Qualen walks up to Brett's corpse, blood steaming in\n        the reddening snow, and kicks it over.\n\n        BELOW ON THE WALLSIDE\n\n        Gabe, reacting to the sound of the machine gun fire, climbs\n        up, but there's nothing he can do --\n\n        TRAVERS AND QUALEN\n\n        and the others pick up their guns.\n\n                                        TRAVERS\n                            (turning to face Hal)\n                      Time to --\n\n        Travers sees that Hal is gone -- he's escaped in the\n        confusion.\n\n        IN THE WOODS - HAL\n\n        runs like his ass is on fire and practically collides with\n        Evan, who is more panicked than ever.\n\n                                        EVAN\n                      What are we going to do --\n\n                                        HAL\n                      You came up here to jump the spur --\n                            (pulls Evan's chute out\n                             of his pack)\n                      This'd be a great time to do it.\n\n                                        EVAN\n                            (panicked)\n                      But --\n\n                                        HAL\n                            (quick)\n                      Listen -- they don't know you're up\n                      here -- I'll draw their fire, you've\n                      got to make the jump and get help.\n\n                                        EVAN\n                      I don't -- I -- uh --\n\n                                        HAL\n                            (exasperated, grabs\n                             chute)\n                      Unless you want to do it the other way\n                      around?\n\n        Evan snatches the parachute and runs off. Hal, wasting no\n        time, runs in the opposite direction, deliberately making as\n        much noise as he can, slapping branches, stomping on rocks.\n\n        EXT. WOODS - THE BANG\n\n        runs into the woods -- Qualen and Kristel, hearing Hal's noisy\n        retreat, run after him.  But Travers stops for a second -- he\n        has spotted\n\n        EVAN'S FOOTPRINTS\n\n        in the snow -- not unlike a neon arrow.\n\n        TRAVERS\n\n        runs in the direction of the footprints and quickly closes the\n        gap between him and\n\n        EVAN\n\n        who tries to pull on the chute and run at the same time --\n        it's not easy. Evan closes one of the three buckles -- but\n\n        TRAVERS\n\n        bursts out of the woods and runs up right behind him --\n\n        QUALEN AND KRISTEL\n\n        in the meantime, get behind Hal in a clearing -- Kristel FIRES\n        over his head.\n\n                                        KRISTEL\n                      Stop!\n\n        Hal, caught again, freezes in his tracks.\n\n        EVAN\n\n        is still up and running -- he dodges Travers' fire, weaving\n        through trees, getting the second buckle closed -- he sees the\n        edge, just ahead, and puts on an extra burst of speed --\n\n        TRAVERS\n\n        does likewise, still firing -- his clip runs out, but this\n        only buys Evan an extra few seconds --\n\n        THE SPUR\n\n        is a rock formation that just out like a diving board -- Evan\n        runs like hell to the edge of it --\n\n        TRAVERS\n\n        is right behind him, and has slapped a fresh clip in place,\n        but before he can shoot --\n\n        EVAN\n\n        dives off the edge and clasps the third buckle --\n\n        ON THE LEDGE - GABE\n\n        is directly below a few hundred feet -- looking up, he thinks\n        Evan has made it -- but\n\n        ON THE SPUR EDGE - TRAVERS\n\n        throws himself down, aims quickly but carefully, and FIRES\n        twenty rounds towards Evan's falling figure --\n\n        EVAN - FALLING\n\n        Evan LAUGHS -- he hasn't been hit --\n\n        GABE - WATCHING\n\n                                        GABE\n                      Come on -- wait till you're out of\n                      range -- don't pull it yet --\n\n        LONG SHOT - EVAN FALLING\n\n        Several seconds pass -- Evan is now several hundred feet down\n        and apparently out of firing range --\n\n        TRAVERS\n\n        stops firing -- but doesn't seem unhappy at all.\n\n        EVAN\n\n        LAUGHS more and pulls the D-ring -- the parachute billows\n        open, inflating --\n\n        CLOSE ON THE PARACHUTE\n\n        which has been shredded by bullets that hit the pack -- as\n        quickly as it inflates, it deflates through dozens of\n        holes -- whatever resistance is left vanishes as the canopy\n        collapses.\n\n        EVAN'S\n\n        exhilaration turns to panic as he frantically pulls on the\n        chute's guide lines -- but the more he does this, the faster\n        the chute caves in -- he SCREAMS as the chute finally gives\n        way and plummets right past\n\n        GABE ON THE LEDGE\n\n        who is powerless to do anything but watch --\n\n        EVAN\n\n        falls the long, full five thousand feet, desperately,\n        uselessly, pulling in the lines of the tattered chute until\n        he's tangled in it like a shroud --\n\n        GABE\n\n        turns away -- he can't watch Evan hit bottom -- he grimaces\n        and looks up with absolute hate at\n\n        TRAVERS\n\n        who doesn't see Gabe -- he's laughing at Evan's desperation,\n        which ends as his death scream is cut off.\n\n        Hal is led over to the spur, with the other gang members\n        behind him. Hal looks as angry as Gabe.\n\n                                        QUALEN\n                      Was that Walker?\n\n                                        TRAVERS\n                      No such luck.\n                            (to Hal, smiling)\n                      Cheer up. Everyone should die in a\n                      spot this beautiful.\n\n        ON THE LEDGE BELOW - CLOSE ON GABE\n\n        who has heard this and is shaking with fury.\n\n                                        GABE\n                            (quietly)\n                      Don't worry. You will.\n\n        LONG SHOT OF MOUNTAIN\n\n        On top, Hal reluctantly leads the gang away -- below, we can\n        see Gabe start out on a parallel path along the ledges.\n\n        EXT. RANGER STATION - HELIPAD - DAY\n\n        Winds or not, Maggie is untying the helicopter's rotor from\n        the bolts on the helipad. Frank, who has obviously just\n        awakened, rushes out of the station.\n\n                                        FRANK\n                      Maggie -- what are you doing --\n\n                                        MAGGIE\n                      I'm going to go nuts if I sit here one\n                      more hour.\n\n                                        FRANK\n                      Still a little breezy out, Mag --\n\n        Maggie gets into the helicopter and starts the rotor.\n\n                                        MAGGIE\n                            (over engine's whine)\n                      You coming?\n\n        Frank hesitates, but climbs in the other side. The helicopter\n        lifts off and heads toward the mountain range.\n\n        EXT. MOUNTAIN - AERIAL SHOT - DAY\n\n        The next obstacle Hal is leading the gang through is a\n        buttress -- a large, stark boulder formation -- that lays\n        between the mountain they've just come from, and the nearest\n        mountain to it: the Tower. This is lower down from the\n        summit -- it's solid and treeless.\n\n        Hal and the rest of the expedition is totally exposed as they\n        climb in single file up to the top. Terrain is flat enough\n        that the climb amount to an uphill run on all fours.\n\n        CLOSER ON HAL AND GANG\n\n        Hal leads the gang forward -- and keeps casting anxious\n        glances back at them. And beyond them. Travers notices this.\n\n                                        TRAVERS\n                      Forget about it. He's smart, but he's\n                      not invisible.\n\n        Hal looks back. Travers is right. There's absolutely no way\n        Gabe can come up behind them without being seen.\n\n        LOWER DOWN ON BLUFF\n\n        where the bluff meets a tree-lined plain. Gabe, in hiding,\n        watches Hal and the others go up. No, he can't follow them up\n        the bluff's side without being seen. But Gabe moves closer to\n        the bluff's base -- Gabe shoves through some trees to the\n        beginning of\n\n        THE \"CHIMNEY\"\n\n        A crevice runs the entire length and breadth of the bluff.\n\n        GABE\n\n        pulls out his ancient binoculars, and scans the crack.\n\n        GABE'S POV - THE CHIMNEY\n\n        Starting with an outside view, we can see that the crevice\n        runs all the way up, and through, the bluff -- but it's a\n        zig-zag, not a straight line.\n\n        Picture a mine shaft designed by a madman. The crack moves\n        upward, then erratically to the side, then straight up again.\n        The width of the crack is uneven, ranging from six inches to\n        six feet. And that's just how it looks on the outside.\n        There's no telling what the interior is like.\n\n        Gabe turns the binoculars to the inside of the crack. It's\n        hard to see much -- it's very, very dark. But it looks as if\n        the crack goes all the way through the bluff, as well as all\n        the way up it. On this route, Gabe can tunnel through the\n        mountain instead of going up the side.\n\n        GABE\n\n        puts away the binoculars and wedges himself into the crack,\n        starting the long process of going up -- and through -- the\n        mountain formation.\n\n        EXT. COLORADO WILDERNESS - PLANE CRASH SITE - DAY\n\n        A frenzy of activity, as several dozen Treasury agents sift\n        through the snow for the wreckage of the CT-39, some taking\n        photos, some taking videotapes, some putting the pieces into\n        bags for analysis. Many bags. Many small bags.\n\n        WIDER ON CRASH SITE\n\n        The Treasury plane has been completely pulverized by the crash\n        and its subsequent explosion -- there are few pieces here that\n        aren't charred, and fewer still that are any larger than a\n        paperback book.\n\n        WRIGHT\n\n        unhappily walks through the carnage and past agents gathering\n        up the plane, to a harried crash specialist from the FAA --\n        ROSS STUART (40s) -- who is organizing the debris.\n\n                                        WRIGHT\n                      What can you confirm?\n\n                                        STUART\n                      Well, sir -- it crashed. That, I can\n                      confirm.\n                            (condescending)\n                      We've been here just about one hour.\n                      These events take months to analyze.\n                      So if you'll excuse me --\n\n        He walks away -- but Wright, pissed, spins him around.\n\n                                        WRIGHT\n                      No, I don't think I will. The reason\n                      the FAA pays you is to exercise your\n                      vast, amazing knowledge of these\n                      \"events\". So I expect you to come up\n                      with some stunning insights, something\n                      a slow-witted fuck like me hasn't\n                      already observed.\n                            (gesturing to wreckage)\n                      One: it didn't blow up in mid-air,\n                      because the debris isn't widely\n                      dispersed. But was there a bomb on\n                      board that could have disabled it? I\n                      wonder.\n                            (pointing back)\n                      Two: There wasn't an attempted\n                      landing. Otherwise, there'd be debris\n                      to the east of the wreckage, where the\n                      plane was coming from. Did it come\n                      straight down? That's got me\n                      scratching my head too.\n                            (gesturing back to\n                             wreckage)\n                      And three: the flight recorder's\n                      tracer led us here in the first place.\n                      So where is the goddamn thing? That\n                      one's got me all aflush with\n                      curiosity.\n\n                                        STUART\n                            (a little cowed)\n                      You'll be the first to know.\n\n                                        WRIGHT\n                      Oh, I believe you.\n\n        Wright storms off as agents delicately handle debris.\n\n        EXT. TOP OF THE BLUFF/VISTA - DAY\n\n        A vista. From this point, you can see everything else in the\n        mountain range. The only thing left that's taller is the\n        Tower, a hundred yards away. Between the two mountains lies a\n        drop of a mere four thousand feet.\n\n        Hal has led the rest of the gang up to the edge. Travers\n        approaches him, furious.\n\n                                        TRAVERS\n                      I thought you said there was an easy\n                      way across.\n\n                                        HAL\n                      There is. You might not like it much.\n\n        Hal points\n\n        FURTHER DOWN\n\n        A steep two hundred yard downhill climb leads to a wire that\n        bridges the two mountains. The same wire we saw at the\n        beginning -- left behind from Susan Collins' botched rescue.\n\n        TOP OF BLUFF - HAL AND TRAVERS\n\n                                        HAL\n                      Of course -- we'll have to do it hand\n                      over hand. Seems I forgot my harness.\n                      Sorry.\n\n                                        TRAVERS\n                      Don't be. Lead on.\n\n        Hal is surprised to see Kynette pull a harness out of his pack\n        -- the one Travers used earlier. Disappointed, Hal leads the\n        downward climb, looking several hundred yards to\n\n        THE CRACK\n\n        running up, and through, the bluff, coming out on this side.\n\n        HAL'S FACE\n\n        registers a thought -- will he? -- then dismissal. Nah. He\n        couldn't.\n\n        INT. THE CRACK/CHIMNEY - CLOSE ON GABE'S FACE\n\n        Gabe is sweating, straining in the dark, climbing up -- this'd\n        be a good spot to pull back and take in the view, except --\n\n        THE CHIMNEY\n\n        -- there's nowhere to pull back to. There's about two inches\n        of clearance between Gabe's chest and the rock, and about the\n        same between his back and the rock. To the right, there is no\n        light. At all. To the left, there's no light. Even above,\n        there is no light, because the crack isn't straight -- nature\n        isn't that obliging -- it zig-zags up. Gabe is well within the\n        mountain rock. Nothing could be closer to being buried alive\n        Gabe snakes through a spot where the crack goes straight up --\n        he takes out his penlight and turns it on --\n\n        GABE'S POV - INSIDE THE CRACK AROUND HIM\n\n        even this dim light reveals scores of bats hanging on the\n        wall, surrounding him, up and down, left and right --\n\n        GABE'S FACE\n\n        is stuck somewhere between nausea and the realization that\n        he's made a big mistake.\n\n                                        GABE\n                      I didn't need to see that. I really\n                      didn't.\n\n        Gabe cuts the light and slithers up through the dark.\n\n        EXT. RESCUE HELICOPTER - DAY\n\n        Maggie and Frank are flying low and fast, over treetops and\n        snow -- both are intently staring down --\n\n        THEIR VIEW\n\n        is nothing but empty wilderness. But a BUZZER goes off --\n\n        MAGGIE AND FRANK\n\n        turn their attention to the helicopter's heat scope, which\n        shows something alive beneath them.\n\n                                        FRANK\n                      Got 'em -- they're under the trees --\n\n        Maggie smiles and slows the copter over a clearing --\n\n        EXT. WOODS/THE COPTER\n\n        touches down. Maggie is out of it before the rotor has stopped\n        turning, running into the trees.\n\n                                        MAGGIE\n                      Hal! Gabe!\n\n        Maggie runs into the trees, headlong into\n\n        A PACK OF WOLVES\n\n        that are preying on -- a body. A pair of legs are gruesomely\n        sticking out from the feast. One wolf turns to SNARL at Maggie\n        -- but Frank runs up and pulls a gun from a holster.\n\n        Frank aims high and FIRES twice to scare the pack -- the\n        wolves run off. Maggie goes to the body -- Frank holds her\n        back, but she goes ahead anyway, worried it might be Gabe --\n\n        TIGHT ON MAGGIE\n\n        as she examines the body --\n\n                                        MAGGIE\n                      It's Evan.\n                            (she stands, looks up)\n                      Parachute failed.\n\n                                        FRANK\n                            (not unkindly)\n                      Damn fool. Why would anybody try that\n                      in the middle of a storm.\n\n                                        MAGGIE\n                      Why would anybody try at all.\n                            (sighs)\n                      Get the bag.\n\n        INT. BLUFF CRACK/CHIMNEY\n\n        Gabe has a quick climbing rhythm now. He pulls himself up with\n        his hands, then braces his body with his back, and pulls\n        himself up again -- he's not looking up, because he can't see\n        anything yet anyway -- naturally, this leads to --\n\n        A head and rock collision. Gabe's head crashes against a new\n        part of the crack, as the passage thins out. He gropes up.\n        The passage is narrowing to the point that he can't get\n        through it. Dead end.\n\n                                        GABE\n                      Should've taken that left turn at\n                      Albequerque.\n\n        Gabe backs down, and starts to slide across the side. With\n        his back wedged against the rear wall, he uses his feet to\n        push against the forward wall.\n\n        GABE'S POV - BLACK\n\n        Zero visibility -- Gabe can't see what he's shoving toward.\n        There has never been light of any kind in here.\n\n        GABE\n\n        blindly pushes to the side, rattled by the difficulty of doing\n        this in the dark.\n\n                                        GABE\n                      It's just like any other side move --\n                      you can't see where the fuck you're\n                      going, that's all --\n\n        Gabe stops and fishes out his penlight. Turning it on, it's\n        clear those batteries haven't gotten any more potent in the\n        last few hours. Gabe shines it to the side.\n\n        GABE'S POV - THE LIGHT\n\n        is fading fast. A match's last gasp is brighter.\n\n        GABE\n\n        exasperated, puts the penlight in his mouth and moves on.\n\n                                        GABE\n                            (garbled)\n                      Much better.\n\n        Gabe inches on to the side. Looks up to see if the crack has\n        gotten wider. It hasn't. Gabe mumbles something phonetically\n        near \"motherfucker\" around the flashlight, aiming it up --\n\n        GABE'S POV - UP\n\n        No opening larger than a mail slot --\n\n        GABE\n\n        still cursing, still looking up, still moving to the side --\n        he gets the opening he wants, but not where he wants it --\n\n        The crack suddenly, drastically widens as he moves to the\n        side -- since he's been bracing his back against the wall,\n        Gabe falls out of control, twisting around, face down --\n\n        Gabe bounces down the walls for several yards and catches\n        himself by bracing his arms and legs against the crack. It's\n        now five feet wide as he painfully brakes himself --\n\n        GABE'S POV - THE PENLIGHT\n\n        falls out of Gabe's mouth and tumbles down, ping-ponging from\n        one side of the crack to the other as it tumbles a long, long\n        way down -- even after the light is gone, we can still hear\n        the penlight's receding clattering against the walls --\n\n        GABE\n\n        is now, literally, in a jam. There are no handholds, no\n        ledges, and the walls are slick. All he can do is remain\n        braced against the crack's walls until his already sore arms\n        and legs give out.\n\n        EXT. RESCUE HELICOPTER - NEAR BLUFF'S BASE - DAY\n\n        Frank is now flying the helicopter -- a body bag is stashed in\n        the back, and Maggie is in the passenger seat.\n\n                                        MAGGIE\n                            (motioning down)\n                      Bring it down here.\n\n                                        FRANK\n                      Maggie --\n\n                                        MAGGIE\n                      Just do it, Frank.\n\n        EXT. BLUFF BASE\n\n        The copter touches down -- Frank doesn't turn it off. Maggie\n        jumps out with a walkie talkie. Frank makes another try.\n\n                                        FRANK\n                      Maggie, this is dumb --\n\n                                        MAGGIE\n                      No it isn't. I'm going to find\n                      Brett -- I don't want to have to talk\n                      to his widow too. Fly Evan's body\n                      back to base -- I'll call you when\n                      I've found Brett. Or Hal. Or Gabe.\n                      Or anybody.\n\n        Maggie runs off into the snow as Frank lifts off. Maggie moves\n        quickly through the snow, and it isn't long before she spots\n        multiple tracks in the snow -- they lead toward, and up, the\n        buttress. Now she's really confused. But with nothing left to\n        do, she starts climbing up the side.\n\n        EXT. WIRE CROSSING - HAL'S POV\n\n        As we've caught Hal in mid-crossing, he's looking from whence\n        he came -- the opposite side of the buttress, where Travers\n        has a gun trained on him --\n\n        HAL\n\n        unhappily hangs high above the ground from the harness kindly\n        provided by Travers --\n\n        HAL'S POV - ON THE OTHER SIDE OF THE WIRE\n\n        Kristel is waiting, also with a gun trained on him. Hal\n        arrives and disengages -- the harness is pulled back.\n\n        BUTTRESS SIDE OF WIRE\n\n        Kynette pulls the harness back and hands it to Qualen, who's\n        standing next to Travers.\n\n                                        KYNETTE\n                            (motioning up)\n                      I'm going back.\n\n                                        TRAVERS\n                      Look -- this part is nothing,\n                      believe me --\n\n                                        KYNETTE\n                      Walker should be coming up by now.\n\n        Kynette, automatic strapped to his chest, rushes back to the\n        buttress' summit.\n\n        INT. BUTTRESS CRACK/CHIMNEY\n\n        Gabe is just as we left him. Face down, arms and legs pressing\n        against the five-foot gap of the tunnel walls.\n\n        Carefully, Gabe takes one hand off the wall, gets out his\n        lighter with the other, and ignites it for a look --\n\n        GABE'S POV - UPWARD\n\n        Just as the crack has widened below him -- it's wider above\n        him. More important, it slants at an easy enough angle to\n        allow him to walk up. If only he can get up there.\n\n        GABE\n\n        snaps the lighter shut, pockets it, and readies himself.\n\n        Gabe steadily \"walks\" up the vertical passage by bracing\n        himself with one leg and one arm -- then moving the other\n        leg and arm up.\n\n        Gabe repeats this until he has his hands on the curved edge\n        where the crack snakes into a sideways passage. But there are\n        no handholds that will allow Gabe to get a grip and simply\n        swing over and climb up.\n\n                                        GABE\n                            (winded)\n                      So much for the easy part.\n\n        OVERHEAD ANGLE - THE CRACK\n\n        Gabe takes a deep breath, readies himself, and shoves himself\n        away from the wall with his arms, pushes himself into a squat\n        against the opposite wall, hanging for a second with no\n        support at all, and he springs from that all into\n\n        THE DIAGONAL PASSAGE\n\n        Gabe lands hard but flat on the passage and immediately starts\n        backsliding into the drop, but he digs in with his boots and\n        his hands. Safe at last. Gabe carefully stands in a crouch --\n        and starts heading up.\n\n        EXT. BUTTRESS TOP\n\n        Kynette moves to the edge, lies flat, and looks down --\n\n        KYNETTE'S POV - ON THE BUTTRESS SIDE\n\n        Maggie is climbing up, but she's still some way down -- and\n        the hood of her parka has been pulled over her head. All\n        Kynette can see is what she's wearing: an orange parka.\n\n        KYNETTE\n\n        smiles and hits his headset radio.\n\n                                        KYNETTE\n                      He's on the way up. I could hear that\n                      jacket before I could see it.\n\n                                        TRAVERS (O.S.)\n                            (over radio)\n                      Then get the money, kill him and get\n                      back here. Now.\n\n                                        KYNETTE\n                            (into radio)\n                      I'll wait till he comes to me.\n\n        Kynette flattens out to wait -- Maggie is coming up fast.\n\n        INT. MOUNTAIN CRACK/CHIMNEY\n\n        Gabe moves up through the diagonal section -- the crack is\n        starting to go directly upward. Gabe looks up --\n\n        GABE'S POV - TOP OF THE CRACK\n\n        It's coated with snow, but not too much -- Gabe can faintly\n        make out light shining through up there.\n\n        GABE\n\n        knows the top is twenty feet away. Gabe starts up the easy\n        segment, his back braced against one wall.\n\n        EXT. TOP OF BUTTRESS - KYNETTE\n\n        is staring down intently at the climber below --\n\n        KYNETTE'S POV - MAGGIE\n\n        is now almost to the top -- sweating with exertion, she throws\n        her hood back.\n\n        KYNETTE\n\n        keys his headset radio again.\n\n                                        KYNETTE\n                            (into radio)\n                      Bulletin. The climber isn't Walker --\n                      it's a woman.\n\n        INT. MOUNTAIN CRACK/CHIMNEY\n\n        Gabe, wedged near the top of the crack, is ready to dig\n        through the snow -- but he hears the sound, muffled and\n        distant, of Kynette talking. Gabe strains to hear -- a bad\n        time to come up? Might be.\n\n        EXT. BUTTRESS SIDE\n\n        Maggie, tired, gets near the top and collapses, resting for a\n        moment, her arms on the edge -- Maggie looks up and is very\n        surprised to see Kynette, standing over her, smiling, his gun\n        aimed down at her.\n\n                                        KYNETTE\n                      Rotten weather for a climb, huh?\n                            (aims barrel)\n                      I have two questions I'd like to\n                      trouble you with. Ready?\n\n        Maggie stares up, frozen -- whatever she was expecting, it\n        wasn't this.\n\n                                        KYNETTE\n                      This first one's easy. Do you know a\n                      man named Gabe Walker?\n\n                                        MAGGIE\n                      Yes.\n                            (breathless, scared)\n                      Where is he?\n\n                                        KYNETTE\n                      You don't know either? I am sorry.\n                      That was question number two.\n                            (lowers barrel)\n                      Thanks for your time.\n\n        As Kynette tightens his finger around the trigger --\n\n        GABE\n\n        appears -- he completes his run toward Kynette's back and\n        kicks him over the edge --\n\n        KYNETTE\n\n        goes flying over Maggie, his shots going wild -- but he\n        catches himself on the rock and comes to a painful but safe\n        halt after skidding down ten feet --\n\n        GABE\n\n        yanks Maggie to her feet and onto the top. Maggie gets a good\n        look at Gabe -- his clothes are slashed, he's covered with\n        cuts, and coated with slime and dirt from the crack. He looks\n        like he's just spent a week in Hell. Gabe doesn't react to her\n        reaction -- he just grabs her hand and runs.\n\n        QUALEN\n\n        chooses this moment to show up at the opposite edge -- he\n        fires and automatic BURST at Gabe and Maggie.\n\n                                        GABE\n                      Come on --\n\n                                        MAGGIE\n                      Where? --\n\n                                        GABE\n                      Here.\n\n        Gabe jumps on a spot in the snow over the crack, caving it\n        in -- Gabe falls two feet into\n\n        THE CRACK - MAGGIE'S POV\n\n        Gabe has grabbed, and is hanging from, a rope anchored to a\n        piton on the edge of the rock. He's also glowering up at\n        Maggie a little impatiently.\n\n                                        GABE\n                      Today, goddamit!\n\n        Gabe rappels down the rope into the darkness.\n\n        MAGGIE\n\n        hesitates -- she's still getting used to the idea of being\n        shot at --\n\n        KYNETTE\n\n        woozy but recovered, has climbed up -- he runs toward the\n        opening, FIRING his gun --\n\n        MAGGIE\n\n        drops into the relative safety of the crack and rappels\n        downward.\n\n        Maggie reaches rope's end thirty feet down, as the vertical\n        passage again becomes diagonal. Gabe is there waiting.\n\n        KYNETTE\n\n        reaches the edge of the crack and FIRES down into it --\n\n        GABE AND MAGGIE - FURTHER DOWN\n\n        -- bullets are RICOCHETING all over -- Gabe throws himself\n        over Maggie to shield her.\n\n        KYNETTE\n\n        can't see what he's shooting at, so he mercifully stops.\n        Seeing the rope, he bends down to climb after them --\n\n        GABE AND MAGGIE - FURTHER DOWN\n\n        Gabe reaches up and tugs gently on the rope twice --\n\n        KYNETTE - REACHING FOR THE ROPE\n\n        -- which is tied in a standard climber's slipknot and comes\n        undone with a final tug -- the rope, freed of the piton, falls\n        down, but Kynette firmly grabs hold of the end --\n\n        GABE\n\n        feels the rope go taut -- he yanks the rope down hard --\n\n        KYNETTE\n\n        gets more pull than he counted on and takes a head first fall\n        into the crack, disappearing with a scream -- Qualen has just\n        arrived in time to see this --\n\n        GABE\n\n        looks over as Kynette bounces past him, a few feet away -- the\n        rope goes slack in his hand as Kynette falls below.\n\n        UP ABOVE - QUALEN\n\n        in frustration, FIRES a burst straight down into the crack --\n\n        GABE AND MAGGIE - IN THE CRACK/CHIMNEY\n\n        Gabe and Maggie move laterally through the crack -- now about\n        thirty feet from where they started, so ricochets are a\n        serious but decreasing problem.\n\n        The crack narrows from five to three feet. Gabe edges Maggie\n        down into it, and along a ledge moving to the side.\n\n                                        GABE\n                      This way.\n                            (off Maggie's look)\n                      I like the outside of the mountain\n                      better too, but --\n\n        Gabe and Maggie move along the ledge --\n\n        QUALEN\n\n        is still at the edge of the crack -- stymied. He's definitely\n        not climbing down after them -- he pulls back from the edge.\n\n        IN THE CRACK/CHIMNEY - GABE AND MAGGIE\n\n        find a comparative point of comfort -- a toe-sized ledge.\n        Maggie is moving ahead of Gabe.\n\n                                        GABE\n                      Stop.\n\n                                        MAGGIE\n                      We can't --\n\n                                        GABE\n                      I need to stop.\n\n        Exhausted, Gabe braces himself against the wall.\n\n                                        GABE\n                            (looks at Maggie)\n                      I'm glad to see you -- but Christ, I\n                      wish you hadn't come.\n\n        EXT. WIRE CROSSING - TOWER SIDE - DAY\n\n        Qualen whizzes across the wire on the harness, easily making\n        it to where Hal, Travers and Kristel are waiting.\n\n                                        TRAVERS\n                      Don't tell me --\n\n                                        QUALEN\n                            (disengaging)\n                      He's still alive.\n\n        Travers takes a couple of heavy swings at the connecting bolt\n        with Hal's axe. Qualen grabs his arm before he can take a\n        third swing -- and looks at his watch.\n\n                                        QUALEN\n                      For another two minutes.\n\n        IN THE CRACK/CHIMNEY - GABE AND MAGGIE\n\n        Gabe catches his breath. All this is taking its toll on him.\n\n                                        MAGGIE\n                      It hurts just looking at you.\n\n                                        GABE\n                            (still panting)\n                      Try it from this side. Do you still\n                      have your radio?\n\n                                        MAGGIE\n                      It's not going to work in here.\n\n                                        GABE\n                      Let's give it a try.\n                            (she hands it to him)\n                      I'm in bad need of a ride.\n                            (keys it)\n                      Come in, Rescue Unit --\n\n        EXT. TOWER FACE - DAY\n\n        Hal is leading the expedition upward along a ledge -- the\n        radio, in Travers' pack, comes to life.\n\n                                        GABE (O.S.)\n                            (over radio)\n                      -- Come in, Rescue One --\n\n        Travers stares daggers at Qualen. Qualen looks to his watch.\n\n                                        QUALEN\n                      Patience.\n\n        INT. RESCUE STATION\n\n        The radio is reading Gabe loud, if not clear -- the\n        interference of solid rock is garbling it. But we can see out\n        the window that Frank is now between radios, carefully\n        hauling Evan's body from the helicopter to the station on a\n        collapsible gurney. No one else is in the station.\n\n                                        GABE (O.S.)\n                            (over radio, broken up)\n                      -- Come in, Frank --\n\n        INT. BUTTRESS CRACK/CHIMNEY\n\n        Gabe, exasperated, stops for a moment.\n\n                                        GABE\n                      Is there anybody else on the radio?\n\n        Maggie shakes her head no.\n\n                                        GABE\n                      I take a year off and the department\n                      goes to hell.\n                            (keys it)\n                      -- Come in, Rescue Unit --\n\n        TOP OF BUTTRESS - HIGH ANGLE\n\n        We can see there are three holes punched in the snow along the\n        crack's top --\n\n        CLOSER ON ONE OF THE HOLES\n\n        Recognizably the part of the crack Gabe and Maggie dove\n        into -- but perched on the edge is a block of plastic\n        explosive -- the detonator LED races down -- 0:20 -- 0:19 --\n\n        A SECOND HOLE\n\n        has been punched in the snow at the center point of the\n        crevice's top -- another bomb has been planted there --\n\n        A THIRD HOLE\n\n        at the opposite end of the crevice has a third timer tied to\n        a third pack of plastics --\n\n        EXT. TOWER FACE\n\n        Qualen is staring at his watch, but pointing the others toward\n        the buttress.\n\n                                        GABE (O.S.)\n                            (via radio)\n                      Come in, Frank -- over --\n\n                                        QUALEN\n                      Try to get thirty million in\n                      entertainment out of this, because he\n                      is definitely in for thirty million\n                      worth of pain.\n\n        Gabe's radio calls continue as Qualen extends his arm towards\n        the buttress and starts a silent hand countdown, stage manager\n        style -- five -- four -- three --\n\n        INSERT - TIMER\n\n        The LED runs down -- 0:02 -- 0:01 --\n\n        THE BUTTRESS TOP\n\n        is shattered by a huge blast as the first bomb detonates --\n\n        INSIDE THE CRACK/CHIMNEY\n\n        The walls are pulverized near the top and cave in, raining\n        rocks further down towards --\n\n        GABE AND MAGGIE\n\n        who are hit by a blast of air booming down through the\n        confined space -- Gabe drops the radio -- Maggie slips, but\n        Gabe grabs her -- both slide down the crack, out of control,\n        until it narrows to a three foot width -- and they stop --\n        Gabe shoves Maggie against the wall and tries to protect her\n        with his body as the rocks start to rain down --\n\n        TOWER FACE\n\n        Hal lunges at Qualen, but is held back by Travers.\n\n                                        HAL\n                      You sick fuck --\n\n                                        QUALEN\n                      Don't worry. They may still be alive.\n                      That was the small one.\n\n        RESCUE STATION\n\n        Frank stops wheeling the gurney and looks up at the far-off\n        blast, and the smoke, amazed.\n\n                                        FRANK\n                      Jesus -- that's some flare.\n\n        INSIDE THE CRACK\n\n        Rocks tumble down it, filling it in and sealing it off --\n\n        FURTHER DOWN - GABE\n\n        is braced over Maggie, protecting her from the first round of\n        falling rocks, but rolling THUNDER in the crack announces that\n        more is coming -- Gabe looks up as the noise gets closer --\n\n        ABOVE IN THE CRACK\n\n        The rockslide arrives -- the crack is filled in seconds with\n        rocks and dirt, packing it in -- Gabe tries to hold on, but is\n        shoved down by the falling rocks -- Maggie, however, is\n        buried in the crack as it fills --\n\n        GABE\n\n        is knocked down to a point where the crack narrows -- he stops\n        himself by jamming his body against the sides. Suddenly, it's\n        quiet. A little dirt whistles through, but that's all.\n\n        The cave-in has stopped, as it's filled in the crack above.\n\n        And Maggie is in the middle of it.  Gabe unsheaths his ice axe\n        and starts hacking up to get at Maggie. Dirt and rocks fall in\n        his face as he digs --\n\n        BOMB NUMBER TWO - INSERT\n\n        Another LED is counting down from 3:00 -- 2:59 -- 2:58 --\n\n        INSIDE THE CRACK\n\n        Gabe frantically hacks at the ceiling of dirt -- rock and soil\n        tumble down, but no sign of Maggie. Gabe uncovers one of\n        Maggie's feet. Is it too late? Gabe digs up around her --\n\n        Maggie realizes Gabe is there -- she starts kicking.\n\n        Finally Maggie tumbles out of the cave-in -- gasping and\n        coughing, but alive.  Gabe catches her and brushes the dirt\n        off her face.\n\n                                        GABE\n                      Are you all right?\n\n                                        MAGGIE\n                            (terrified, coughing)\n                      Why are they doing this?\n\n        RESCUE STATION\n\n        Frank, having lain Evan's body to rest, runs back to the\n        helicopter, starts it up and takes off.\n\n        INSIDE THE CRACK/CHIMNEY\n\n        Gabe is leading Maggie horizontally through the crack, fast\n        and furious --\n\n                                        MAGGIE\n                            (looks up)\n                      We might be able to get up that way --\n                      there's an opening --\n\n                                        GABE\n                      No -- there could be another bomb up\n                      there -- even if there isn't, we could\n                      get another cave-in. The only sure way\n                      out is through the side.\n\n        EXT. TREASURY PLANE CRASH SITE - DAY\n\n        Treasury agents sift debris as Davis runs up to Stuart.\n\n                                        DAVIS\n                      I've got something here.\n\n                                        STUART\n                      Let's have it.\n\n                                        DAVIS\n                      There's an unconfirmed report of a\n                      distress call made from a plane that\n                      crashed.\n\n                                        STUART\n                      That's really, really interesting, but\n                      --\n                            (gestures around)\n                      -- kind of old news, don't you think?\n\n                                        DAVIS\n                      This call was supposedly made from a\n                      plane that crash landed. After it\n                      landed.\n\n                                        STUART\n                            (waves it off)\n                      Sounds like they got it wrong. Next\n                      time you interrupt my work make sure\n                      it's something I can use.\n\n        INT. MOUNTAIN CRACK/CHIMNEY\n\n        Gabe and Maggie cautiously move along a single ledge --\n        finally, some light can be seen, thirty feet ahead, as they\n        round a corner.\n\n                                        GABE\n                            (smiling)\n                      Come on -- we're almost out.\n\n        The crack narrows, and Gabe straddles it, putting his feet on\n        the opposite edge to walk faster. But before he can go on --\n\n        A HAND\n\n        grabs one of Gabe's ankles from below and yanks him down --\n        Gabe tumbles painfully, braking himself in front of\n\n        KYNETTE\n\n        bruised and bloody, who has survived the earlier fall and made\n        his way out. His look is not a forgiving one.\n\n                                        KYNETTE\n                      Miss me?\n\n        Kynette smashes Gabe's face with a devastating, brass-knuckled\n        punch --\n\n        GABE\n\n        falls back, desperately grabbing at the walls to stop himself\n        from going all the way down -- as he weakly tries to get up --\n\n        KYNETTE\n\n        calmly opens his knife, and re-laces his fingers into its\n        brass-knuckle handle.\n\n        TOWER FACE\n\n        The gang and Hal watch the mountain top, with very different\n        expectations and hopes -- their vantage point keeps them from\n        seeing where the crack actually comes out.\n\n                                        QUALEN\n                            (looks to Hal)\n                      You might say a few words for your\n                      friends -- this is the one that will\n                      bury them.\n\n        BOMB NUMBER TWO - INSERT\n\n        Ready to blow -- 0:10 -- 0:09 --\n\n        IN THE CRACK - MAGGIE\n\n        can only look down helplessly at\n\n        GABE AND KYNETTE\n\n        fighting -- Gabe is on his feet, but Kynette, slashing at him\n        with his knife, is forcing Gabe to back up -- the crack is\n        getting wider, and finding footholds while crab-walking\n        backwards in the dark isn't east.\n\n        Gabe's in a rotten fighting position -- as he has to spread\n        his feet out wider as he backs up, he's always lower than\n        Kynette.\n\n        Gabe throws a punch at Kynette's stomach, but there's no power\n        to it. Kynette hits Gabe with a brutal knuckle-duster punch --\n        Gabe flies back several feet, somehow managing to straddle the\n        crack walls -- which are now four feet apart. Kynette moves in\n        for the kill.\n\n        BOMB NUMBER TWO - INSERT\n\n        The LED counts down -- 0:02 -- 0:01 -- 0:00 -- but doesn't\n        detonate. A green light starts flashing, but the bomb hasn't\n        gone off.\n\n        IN THE CRACK/CHIMNEY\n\n        Kynette moves in over Gabe and swings down with the knife --\n        But Gabe grabs his knife hand, and adding his own force to the\n        swing, imbeds the knife to the hilt in the rock wall,\n        trapping Kynette's hand in the brass-knuckle handle.\n\n        Gabe stabilizes himself on Kynette's trapped arm and gets a\n        little payback -- three solid roundhouse punches to Kynette's\n        face -- he then climbs up his pinned opponent, stepping up\n        on Kynette's stuck hand as if it were a piton.\n\n        TOWER FACE\n\n        Qualen's smirk is wiped off his face. The bomb didn't work?\n\n                                        TRAVERS\n                      What happened?\n\n                                        QUALEN\n                      I'm not sure -- I set the timer --\n\n        Qualen gestures helplessly, putting the radio in Hal's reach.\n        Hal takes advantage of this, throws off Travers, and grabs the\n        radio.\n\n                                        HAL\n                            (keying radio)\n                      Gabe, it's a dud --\n\n        But the second Hal transmits --\n\n        BOMB NUMBER TWO\n\n        detonates over the central part of the crevice, and as\n        promised, it's even bigger than the first --\n\n        INSIDE THE CRACK\n\n        The bomb instantly blasts tons of rock down the crevice --\n\n        GABE AND MAGGIE\n\n        The RUMBLE of the approaching rockslide is unmistakable --\n        Gabe shoves Maggie forward --\n\n                                        GABE\n                      Move!\n\n        Maggie doesn't have to be told twice -- she and Gabe move out\n        the narrowed crack quickly, but under the circumstances,\n        this \"running\" looks damn slow --\n\n        KYNETTE\n\n        struggles with the stuck knife as the cave-in knocks him off\n        the wall and buries him instantly --\n\n        GABE AND MAGGIE\n\n        cover the last ten feet, shoved forward by an airburst from\n        the giant explosion -- they make it to the crack's edge at\n        last, but on the\n\n        OUTSIDE OF THE MOUNTAIN\n\n        Gabe and Maggie still have to cling desperately to the sheer\n        wall -- the airburst has turned the crack into a wind\n        tunnel -- it's as if the mountain were trying to blow them\n        out.\n\n        TOWER FACE\n\n        Hal, shocked, stares at the enormity of the explosion. Qualen\n        looks serenely satisfied.\n\n                                        QUALEN\n                      When I was seventeen, I was a sentry\n                      on the East Berlin boundary.\n                      There was a problem, then -- too many\n                      defectors were managing to sneak\n                      through the wilderness to the west. A\n                      man would take them through, every\n                      night of every week -- a man like your\n                      friend.\n                            (beat)\n                      He had quite a sense of humor. Every\n                      time he got someone through, he'd\n                      radio us at midnight to let us know\n                      how many. \"Five tonight.\" \"Eight\n                      more have been freed tonight.\" No one\n                      could find the route. It made me look\n                      bad.\n                            (beat)\n                      I looked day and night and finally I\n                      found it. A tunnel. I didn't tell me\n                      superiors. I put a charge there, with\n                      a timer to trigger a radio receiver on\n                      the detonator. At midnight. Our friend\n                      made his radio report, and I heard him\n                      say \"seven\" before the explosion.\n                            (beat)\n                      They pulled eight bodies out of the\n                      tunnel, and I was promoted to\n                      intelligence the next day.\n\n        Hal, stunned, looks at the radio, realizing Qualen tricked\n        him into detonating the bomb. Travers, grinning, takes the\n        radio from Hal and pats him on the back.\n\n                                        TRAVERS\n                      Thanks. We couldn't have killed him\n                      without you.\n\n        GABE AND MAGGIE - ON THE WALL\n\n        The force of the airburst, as brief as it is strong, is over.\n        Dust slowly swirls out -- Gabe and Maggie raise their heads.\n        Gabe looks back -- the crack is now sealed off. Gabe takes a\n        piton and hammer from his belt and hands it to Maggie along\n        with the rope.\n\n                                        GABE\n                      Knock this in the side. Make it firm.\n\n        Maggie does as Gabe takes the binoculars out, and climbs out\n        on a slim toehold so he can look up the wall.\n\n        GABE'S POV - UP THE WALL\n\n        Gabe whips the binoculars up to the top edge of the wall. It's\n        blurry -- Gabe focuses the binoculars on -- the third\n        bomb, visible on the mountain's edge. The LED counts down,\n        but it's partly obscured. All Gabe can see is the seconds, not\n        the minutes, that remain -- :42 -- :41 --\n\n                                        GABE (O.S.)\n                      Bad news. There's another bomb up\n                      there. We've got to move quick.\n\n        Gabe scans methodically but rapidly down the rock below. All\n        smooth. Until -- Gabe swings the binoculars back. There's a\n        lip ninety feet below, leading into the wall. A cave.\n\n                                        GABE (O.S.)\n                      Good news. There's a cave down there.\n\n        GABE\n\n        puts away the binoculars and swings back to Maggie -- she lets\n        the length of rope drop. It's thirty feet long. Not even\n        almost long enough to get to the shelter. Gabe leans against\n        the crack wall, drained. Now what?\n\n        HELICOPTER - MOVING OVER MOUNTAINS\n\n        Frank is in the air, heading back out toward the range,\n        frantically working the radio.\n\n                                        FRANK\n                      Maggie -- come in, Maggie, this is\n                      Rescue One --\n\n        TOWER FACE\n\n        Frank's call is heard on the radio. Travers takes it, and\n        takes charge.\n\n                                        TRAVERS\n                      There's our ride out of here. Everyone\n                      out of sight -- except you, Kristel.\n                            (hands her radio)\n                      Make the distress call. You're so good\n                      at it.\n\n        All scramble up towards the clearing.\n\n        INSERT - THE THIRD BOMB\n\n        We can see what Gabe couldn't -- the timer has about two\n        minutes left -- 1:59 -- 1:58 --\n\n        GABE AND MAGGIE - AT THE CRACK'S EDGE\n\n        Gabe looks completely defeated. Can't go up. Can't go back in.\n        Can't go down.\n\n                                        MAGGIE\n                            (frantic)\n                      What are we going to do?\n\n                                        GABE\n                            (defeated)\n                      Die. I'm sorry, Maggie. I'm sorry you\n                      got into this.\n\n        Gabe and Maggie fuse together in a tight embrace -- a final\n        embrace. But Gabe opens his eyes as the rope, still in\n        Maggie's hand, brushes his cheek. The end is frayed.\n\n        Gabe's eyes light up. Inspiration. Gabe breaks off the embrace\n        and snatches the rope from her -- he pulls at the end and\n        furiously starts unravelling it.\n\n                                        MAGGIE\n                      What are you doing?\n\n        EXT. TREASURY PLANE CRASH SITE - DAY\n\n        Davis has just filled in Wright on the \"unconfirmed\" distress\n        call. Wright looks furious.\n\n                                        WRIGHT\n                      He didn't think a distress call from a\n                      crashed plane was \"important\"?\n                            (Davis nods)\n                      Get me a fucking radio! Now!\n\n        EXT. HELICOPTER\n\n        flying over the mountains.\n\n        INT. HELICOPTER\n\n        Frank is practically there, heading toward the buttress and\n        the facing Tower.\n\n                                        FRANK\n                            (over radio)\n                      Come in, Maggie, over --\n\n                                        KRISTEL (O.S.)\n                            (over radio -- \"weak\")\n                      Alpha Charlie Niner -- please --\n                      help --\n\n        Frank recognizes the pilot's voice from the \"distress call\".\n\n                                        FRANK\n                            (over radio)\n                      I copy, Charlie Niner -- what's your\n                      position -- over --\n\n        An aerial flare fires up, leaving a clear marker.\n\n                                        FRANK\n                            (over radio)\n                      Sit tight, Charlie Niner -- I'm right\n                      on top of you.\n\n        GABE AND MAGGIE - AT THE CRACK'S EDGE\n\n        Gabe is still unravelling the rope fiber -- it's three\n        different segments wound together. The helicopter flies\n        overhead -- and past.\n\n                                        MAGGIE\n                            (shouting, waving)\n                      Frank! Down here! Frank!\n                                        \n                                        GABE\n                      Forget about it. He can't hear you.\n                            (hands Maggie some rope)\n                      Tie these together. Tight.\n\n                                        MAGGIE\n                            (realizing)\n                      -- Are you out of your mind --\n\n                                        GABE\n                      This is rope from the Gordon exhibit.\n                      The way guys climbed then, they'd tie\n                      on three at a time -- this rope'll\n                      take around nine hundred pounds.\n\n                                        MAGGIE\n                      Gabe -- this rope is sixty years old\n                      --\n\n                                        GABE\n                            (misses the point)\n                      Yeah, they made it pretty good then.\n                      Each of these strands ought to hold\n                      about 300 pounds before snapping.\n\n        Gabe rapidly ties the rope to the piton -- Maggie works on the\n        third connecting knot as she does the mental calculation of\n        what she and Gabe weigh together.\n\n                                        MAGGIE\n                            (dazed)\n                      Ought to. About.\n                            (beat)\n                      Will it hold?\n\n        Gabe takes the line from her and lets it drop. Ninety feet of\n        what looks like twine.\n\n                                        GABE\n                      Depends on how big a breakfast you\n                      had. You want to go first?\n\n        Maggie's stunned -- but there's no choice. She starts the\n        rappel down, and Gabe is close behind.\n\n        INSERT - THE THIRD BOMB\n\n        is ready to blow -- 0:12 -- 0:11 --\n\n        MAGGIE AND GABE - RAPPELLING DOWN\n\n        To make this even trickier, they have to swing over to the\n        side about fifteen feet to get to the cave -- meaning they\n        have to move down in pendulum type swings that put even more\n        pressure on\n\n        THE ROPE\n\n        which looks sorely tested at one knot -- it's coming undone --\n\n        MAGGIE AND GABE - RAPPELLING\n\n        They swing down lower -- twenty feet to the cave, four\n        thousand to the ground --\n\n        INSERT - THE BOMB\n\n        -- 0:04 -- 0:03 --\n\n        MAGGIE AND GABE - RAPPELLING\n\n        They reach the end of the rope -- six feet above the cave\n        and fifteen feet away laterally.\n\n                                        GABE\n                            (shouting)\n                      Swing towards it -- and drop!\n\n        Maggie nods -- they start the swing over -- as they get over\n        the cave's lip --\n\n        THE ROPE\n\n        snaps --\n\n        MAGGIE AND GABE\n\n        fall, landing roughly on the cave's narrow lip -- Gabe\n        starts to slip over, but Maggie pulls him back as --\n\n        ABOVE ON THE WALL\n\n        The bomb detonates and starts raining debris -- an instant,\n        massive rockslide --\n\n        MAGGIE AND GABE\n\n        dive into the small cave as the rockslide tumbles past --\n        exhausted, they collapse on the cave floor.\n\n        THE HELICOPTER - OVER THE TOWER\n\n        Frank, obviously, is surprised by the nearby explosion.\n\n                                        FRANK\n                      What the fuck --\n\n        But he sees Kristel in a clearing. Face down in the snow.\n        First things first.\n\n        EXT. TOWER/CLEARING\n\n        Frank lands near her, and rushes over to her. Frank turns her\n        over and breaks a capsule under her nose. She \"wakes up\" with\n        a start and looks \"terrified\".\n\n                                        KRISTEL\n                      What -- who are --\n\n                                        FRANK\n                      Don't worry. I'm here to help.\n\n                                        KRISTEL\n                            (recovered)\n                      Glad to hear it.\n\n        Kristel sees the snap is off Frank's holster -- she grabs it,\n        spins it around, and pulls the trigger. CLICK. Frank grabs\n        her wrist with a move faster than you'd expect from him, and\n        he yanks the pistol back.\n\n                                        FRANK\n                      Jailhouse load. First chamber's\n                      empty --\n                            (aims gun)\n                      -- the rest aren't. Forgive me, but\n                      things have been a little strange this\n                      morning.\n\n        Nearby, the helicopter radio crackles to life. Frank backs\n        toward the helicopter, keeping the gun trained on Kristel.\n\n        But Frank only gets to the helicopter door before --\n\n        DELMER\n\n        comes out of hiding and empties a clip from his automatic into\n        Frank. Frank is pinned to the door by the fusillade before he\n        can even get a shot off. Travers runs over to Delmer and\n        shoves the barrel up.\n\n                                        TRAVER\n                      Stop!\n                            (explaining)\n                      You'll damage the helicopter.\n\n        As if to punctuate this, Frank -- and the now ruined pilot\n        side door -- fall to the ground. The radio continues to squawk\n        as Travers grabs Frank's discarded gun.\n\n                                        TRAVERS\n                            (to Kristel)\n                      Answer that.\n\n        Kristel brushes the snow off her and goes over to the radio.\n\n                                        STUART (O.S.)\n                            (over radio)\n                      Calling Rocky Mountain Rescue -- come\n                      in, Rocky Mountain Rescue -- over --\n\n                                        KRISTEL\n                            (keying radio)\n                      Rocky Mountain Rescue One, over --\n\n        EXT. TREASURY PLANE CRASH SITE - DAY\n\n        Wright, davis, and an irritated Stuart huddle over a radio.\n\n                                        STUART\n                      This is Ross Stuart, Federal Aviation\n                      Administration -- please identify --\n                      over --\n\n        EXT. HELICOPTER - DAY\n\n        By now, the others have come out of hiding and up to the\n        helicopter. Kristel grabs some papers from a plastic packet on\n        the helicopter seat -- and keys the mike.\n\n                                        KRISTEL\n                      Copy, FAA. This is Margaret Deighan,\n                      Rocky Mountain Rescue. Over --\n\n                                        STUART (O.S.)\n                      We have an unconfirmed report of an\n                      air crash in your area, and a distress\n                      call on this frequency -- can you\n                      confirm -- over --\n\n                                        KRISTEL\n                            (keying mike)\n                      Copy, FAA. Distress call came at\n                      approximately eleven hundred hours\n                      yesterday. I investigated -- the call\n                      turned out to be a false alarm. Over.\n\n        EXT. TREASURY PLANE CRASH SITE - DAY\n\n        Stuart gestures with exasperated triumph.\n\n                                        STUART\n                      Please repeat, Rocky Mountain\n                      Rescue -- distress call was a false\n                      alarm? -- over --\n\n                                        KRISTEL (O.S.)\n                            (over radio)\n                      Repeat, distress call was a definite\n                      false alarm -- we've had several here.\n                      Somebody's sick idea of a joke. Do you\n                      require further assistance -- over --\n\n                                        STUART\n                      Not from you. Thanks, Rocky Mountain\n                      Rescue -- over and out --\n\n        Stuart shuts off the radio with finality.\n\n                                        STUART\n                      I don't want to say I told you so. But\n                      I did. Can I go back to work now?\n\n        EXT. HELICOPTER/TOWER CLEARING - DAY\n\n        Kristel smiles and puts the radio mike back into its bracket.\n\n                                        TRAVERS\n                      I almost believed you myself.\n\n        Travers smiles and turns, looking at\n\n        HAL\n\n        trembling with fury and grief, bent over Frank's body as the\n        last trace of vapor -- his breath -- trails from his lips.\n        He's gone. Hal gently closes the eyes of his friend.\n\n                                        HAL\n                            (quiet)\n                      Goodbye, Frank.\n\n        Travers moves up behind Hal and kicks him.\n\n                                        TRAVERS\n                      Time for number three. Unless you want\n                      to have a longer conversation with him\n                      elsewhere.\n\n                                        HAL\n                            (low)\n                      Fuck off.\n\n        Travers kicks him in the face, knocking him into the snow.\n\n                                        HAL\n                      I think I'll wait here. You just\n                      murdered three of my friends. Sooner\n                      or later, whoever's chasing you is\n                      going to show up and return the favor,\n                      and I'd love to watch.\n\n        Travers puts his gun at Hal's forehead and shrugs.\n\n                                        TRAVERS\n                      Suit yourself. You see, we just had a\n                      little interface with several branches\n                      of the federal government -- one of\n                      whose members I know has zero\n                      imagination -- and I can tell you, the\n                      cavalry just isn't going to make it by\n                      this week.\n                            (beat)\n                      No, you're taking us where we want to\n                      go. Because you want to return that\n                      favor and you want to do more than\n                      watch. You want to kill me -- more\n                      than anything, even more than you want\n                      to keep on breathing, and with a\n                      little more time you pray you'll get\n                      that chance.\n                            (tightens trigger)\n                      Am I right?\n\n        Hal's answer is a stony, loathing stare. He gets up. But --\n\n        INSERT - HAL'S HAND\n\n        -- we can see Hal has palmed something from Frank's body.\n\n        INT. CAVE - GABE AND MAGGIE\n\n        Dust from the rockslide is drifting past the cave opening, but\n        the worst is over. Gabe rolls Maggie over carefully.\n\n                                        GABE\n                      Are you okay?\n\n                                        MAGGIE\n                      My ears are ringing -- but I'm all\n                      right. Gabe, what's going on?\n\n                                        GABE\n                            (shows money in his pack)\n                      This. That plane crash -- it's a half\n                      dozen guys who were smart enough to\n                      steal fifty million bucks, but dumb\n                      enough to drop it all over the range.\n                      They've got Hal as a bird dog -- and\n                      right now they're heading for the rest\n                      of it.\n\n                                        MAGGIE\n                      Where?\n\n                                        GABE\n                      It's close to the lake -- Hal's\n                      probably leading them on the slowest\n                      possible route down to it.\n                           (stiffly gets up)\n                      I can get there first -- all I have to\n                      do is make it along the north wall to\n                      the Bitker ladder --\n\n                                        MAGGIE\n                      \"All?\" Jesus, Gabe -- what do you\n                      expect to do then?\n\n                                        GABE\n                            (aching)\n                      Something -- subtle.\n\n        Gabe lurches towards the cave opening, looking more like\n        Quasimodo than a champion climber. Maggie stops him.\n\n                                        MAGGIE\n                      I'm going with you.\n\n                                        GABE\n                      No way. You're climbing back down --\n                      try to get to the station or find some\n                      help.\n\n                                        MAGGIE\n                      I'm just as good a climber as you\n                      are -- and right now, I'm definitely\n                      in better shape.\n\n                                        GABE\n                            (hard)\n                      And you're definitely not going --\n\n        Maggie stares Gabe down. Guess who won all the arguments when\n        they were together. Gabe's face is a portrait of familiar\n        exasperation.\n\n                                        GABE\n                      Okay. Come on --\n\n        As they move out of the cave together, Gabe favors one foot.\n\n                                        GABE\n                      -- but the second you slow me down,\n                      I'm leaving --\n                            (slips on sore leg,\n                             Maggie catches him)\n                      -- I'm leaving you behind. Understood?\n\n                                        MAGGIE\n                            (helping Gabe out)\n                      Anything you say, Gabe.\n\n        EXT. TREASURY PLANE CRASH SITE - ON CHUNK OF WRECKAGE\n\n        If you have a good imagination, this corner of charcoal looks\n        like it could have been --\n\n                                        WRIGHT (O.S.)\n                      One of the currency cases.\n\n        WRIGHT AND DAVIS\n\n        are standing over some of the wreckage. One of the suits bags\n        and tags the \"briefcase\".\n\n                                        DAVIS\n                      We've tested the ash inside -- it's\n                      the right paper.\n\n                                        WRIGHT\n                      What about the men?\n\n                                        DAVIS\n                      It's -- hard to tell. But forensics\n                      says yes. All of them were in the\n                      plane.\n\n                                        WRIGHT\n                            (sags with the news)\n                      Everything's accounted for, then --\n                      time to head back and start making\n                      excuses.\n                            (beat)\n                      Fifty million bucks up in smoke, and I\n                      just don't give a shit. It's one more\n                      run of the press. But we lost five\n                      good men and they aren't so easily\n                      replaced.\n                            (beat)\n                      Especially a guy like Travers.\n\n        EXT. MOUNTAIN TOP/TOWER - HELICOPTER - DAY\n\n        Dedicated agent Travers leans in reasonable comfort against\n        the helicopter and keys his headset mike.\n\n                                        TRAVERS\n                      Qualen. How far along are you?\n\n                                        QUALEN (O.S.)\n                            (over radio)\n                      Not as far as we'd be with the\n                      helicopter.\n\n        FURTHER DOWN ON MOUNTAIN/TOWER\n\n        Qualen, Kristel and Delmer follow Hal's lead down the side --\n        it's not too steep a grade, but it's solid rock and it's\n        covered with ice and fresh snow -- all have to brace\n        themselves with their hands to keep from slipping down.\n\n                                        TRAVERS (O.S.)\n                            (over radio)\n                      We have less than half a tank of fuel,\n                      Eric -- if we burn it up treasure\n                      hunting we'll never get off this rock.\n                      Now -- how far away are you?\n\n                                        QUALEN\n                            (keys radio)\n                      It looks like two miles, but --\n\n        Qualen's foot slides out from under him -- he catches himself.\n\n                                        QUALEN\n                      -- it'll take some time.\n\n                                        TRAVERS (O.S.)\n                            (over radio)\n                      Time we have -- Walker's dead,\n                      Wright's an idiot. And our guide --\n\n                                        QUALEN\n                            (keys radio)\n                      What about him?\n\n                                        TRAVERS (O.S.)\n                            (over radio)\n                      As soon as he becomes a convenience\n                      instead of a necessity -- kill him.\n\n                                        QUALEN\n                            (keys radio)\n                      Agreed.\n\n        HAL\n\n        can only hear Qualen's end of the conversation -- but his face\n        shows he can guess what they're talking about.\n\n                                                           CUT TO:\n\n        GABE'S FACE - CLOSE\n\n        Gabe's rattled too -- but for a brand new reason -- we PULL\n        BACK to see Gabe at\n\n        THE WIRE'S EDGE\n\n        where the wire -- that wire -- links the buttress with the\n        facing Tower. Whipping in the wind, it looks risky -- but\n        that's not the problem.\n\n        Gabe stares at the other edge for a moment. Immobile.\n        Remembering Susan's death. Gabe shakes out of it when --\n\n                                        MAGGIE\n                      Gabe?\n                            (beat)\n                      I'll go first.\n\n                                        GABE\n                            (shakes his head)\n                      If I don't go first, I might not go at\n                      all.\n\n        Gabe hooks his ankles over the wire and starts dragging\n        himself, hand over hand, across the abyss -- no safety line\n        this time. As his weight pulls the line taut, the wind rocks\n        him back and forth. Gabe steadily drags himself out --\n\n        GABE ON WIRE - LONG SHOT\n\n        Fatigue stops Gabe in the middle -- a half mile up, strung\n        between two gigantic mountains, he looks as insignificant and\n        alone as a man possibly can be --\n\n        CLOSER ON GABE\n\n        Panting with exertion, frozen -- he can barely hold his grip\n        and has an elbow crooked around the wire for support. Gabe's\n        eyes are shut -- he looks near collapse --\n\n        FLASHBACK - GABE'S POV\n\n        Gabe is falling from the wire in slow motion, trailing\n        Susan -- she spirals out of reach as his line SNAPS him\n        back --\n\n        GABE'S\n\n        grip unconsciously relaxes -- but his eyes jolt open and he\n        clamps both hands shut on the wire. Gabe, drawing on some\n        inner fury, drags himself with long, sharp yanks --\n\n        MAGGIE\n\n        tensely watches Gabe's crossing --\n\n        OVERVIEW - GABE\n\n        is about ten feet away from the end --\n\n        GABE'S UPSIDE-DOWN POV - THE END OF THE WIRE\n\n        looks a lot further away than that --\n\n        GABE\n\n        pulls faster -- and reaches the other side. Gabe maintains his\n        hand grip and swings his feet onto the ledge, leaning back\n        against the wall to catch his breath.\n\n                                        GABE\n                            (winded, shouting across)\n                      Think you can beat my time?\n\n        MAGGIE\n\n        smiles -- this is more like the Gabe she remembers. She gets\n        on the wire and starts across in a fast, easy rhythm.\n\n        GABE\n\n        watches her, grinning. Admiration for Maggie is washing away\n        bad memories of Susan.\n\n                                        GABE\n                            (to himself)\n                      Shit -- she is in better shape.\n\n        Maggie pulls across fearlessly -- but --\n\n        INSERT - THE BOLT\n\n        on Gabe's side of the wire is giving where Travers had\n        hacked at it -- just a millimeter, but it's pulling loose --\n\n        GABE\n\n        doesn't notice and shouts across at Maggie, now half way.\n\n                                        GABE\n                            (enjoying it now)\n                      Quit sandbagging it -- I haven't got\n                      all day --\n\n        INSERT - THE BOLT\n\n        is coming looser -- Maggie's quicker crossing is thrashing the\n        wire and straining the bolt's weakened anchoring --\n\n        GABE - WATCHING MAGGIE\n\n        who is now twenty feet away -- fifteen -- ten -- five --\n\n        INSERT - THE BOLT\n\n        pops out of the wall as if it were shot --\n\n        THE WIRE\n\n        which was tight as a bowstring fires out into the chasm --\n        Maggie, stunned and without options, lets go two feet short\n        of the ledge --\n\n        GABE\n\n        drops low just as Maggie starts to fall and swings his arm out\n        towards hers in one lightning-fast motion --\n\n        THEIR HANDS\n\n        catch --\n\n        GABE\n\n        maintains his grip on Maggie's hand, but her weight nearly\n        pulls him off the ledge -- Maggie drags him down, the window\n        goes out of his chest when it collides with the ledge's\n        bottom, but their grip holds.\n\n        All of this in a split second. Maggie hangs from Gabe's arm,\n        locked in terror -- but skill wins out over fear. She finds a\n        handhold with her free arm, and climbs up to the ledge with\n        Gabe's help. Maggie collapses into Gabe's arms and they fall\n        back against the wall, but Gabe's the one who's really holding\n        on tight.\n\n                                        GABE\n                      That -- tears it.\n                            (gasping)\n                      You're not coming any further.\n\n                                        MAGGIE\n                            (just as breathless)\n                      Gabe -- you're going to get yourself\n                      killed --\n\n                                        GABE\n                            (breath almost back)\n                      Maybe. But I'm not getting you\n                      killed.\n                            (she starts a reply)\n                      Look, Maggie. I don't know what'll\n                      happen when I catch up with Hal -- but\n                      I've got to know one thing for sure --\n                      that you're making it off this\n                      mountain. Alive.\n\n        Gabe's eyes are pleading. Maggie hesitates. But gives in.\n\n                                        MAGGIE\n                      Okay.\n\n        Gabe lightly kisses Maggie -- he doesn't want to turn this\n        into a farewell kiss, afraid that that's really what it might\n        be. They stand -- and separate. Gabe moves away.\n\n                                        GABE\n                      Get on the trail and stay out of\n                      sight.\n                            (beat)\n                      I'll see you on the ground.\n\n        Maggie wonders if she will as Gabe vanishes around a corner.\n\n        EXT. TREASURY PLANE CRASH SITE - CLOSE ON BODY BAG\n\n        as the zipper is pulled down -- before we can see anything we\n        mercifully reverse POV to\n\n        WRIGHT, DAVIS AND STUART\n\n        near a helicopter, look down with disgust. Davis turns away.\n\n                                        WRIGHT\n                      I give up. What was it?\n\n        A SEARCH PILOT zips the bag back up.\n\n                                        SEARCH PILOT\n                      ID says this used to be your pilot.\n                            (beat)\n                      And we found him seven miles east of\n                      the wreck.\n\n        Davis and Wright look at each other, drawing the same\n        conclusion.\n\n                                        WRIGHT\n                      A hijack.\n                            (beat)\n                      The plane was hijacked. Son of a\n                      bitch --\n\n                                        STUART\n                      Oh, give me a break. Your pilot lost\n                      it when the flight started going\n                      south, and he bailed --\n\n                                        SEARCH PILOT\n                      Excuse me -- but there's no parachute\n                      there. Check it yourself.\n\n        Before this can go on, a FORENSICS AGENT runs up to Stuart\n        carrying a recorder.\n\n                                        FORENSICS AGENT\n                      Sir -- we found the flight recorder --\n                      it was driven twenty feet deep into a\n                      crater. It was demolished, but we\n                      salvaged the recording --\n\n                                        STUART\n                            (grabbing it away)\n                      I've heard a thousand of these, Wright\n                      -- whoever was at the stick is going\n                      to begin by screeching the Lord's\n                      Prayer and wind up screaming \"Oh,\n                      shit\" at ground zero --\n\n        Stuart clicks the recorder on with a flourish, but his smug\n        look melts as the voice of FBI agent Matheson explains --\n\n                                        MATHESON (O.S.)\n                            (shouting, rushed)\n                      -- the money's been stolen -- Travers\n                      and the pilot were in on it -- the\n                      pilot's dead, but Travers took the\n                      cash and made a mid-air transfer to a\n                      jet flown by Qualen -- controls won't\n                      respond --\n                            (screaming)\n                      shiiiiii--\n\n        Matheson is cut off by the sound of impact, which is followed\n        by silence. Wright gently turns the recorder off.\n\n                                        WRIGHT\n                      Guess we're both right, Stuart. Thanks\n                      for your expertise.\n                            (turns to pilot)\n                      Well?\n                            (jerking a thumb back)\n                      You'll be waiting till Groundhog's Day\n                      for him to pull his head out of his\n                      ass -- let's get it in the air!\n\n        Wright, Davis and the pilot scramble into a helicopter --\n        Stuart pauses, but goes after them.\n\n        EXT. MOUNTAIN WALL/TOWER - HIGH ANGLE - GABE MOVING ON A\n        LEDGE\n\n        that's a little narrower than your coffee table. It's got\n        irregular breaks, causing it to go up or down several feet --\n        and Gabe is jogging it, leaping across the ledge's gaps,\n        leaning toward the wall -- and away from the four thousand\n        foot drop.\n\n        Gabe's gotten his second wind -- he keeps jumping from ledge\n        to ledge with the ease that comes from skill and familiarity,\n        and with renewed purpose. Gabe makes the last jump to a\n        section of ledge near the bottom of\n\n        THE \"BITKER\" LADDER\n\n        which consists of metal rungs woven into loose steel cable\n        bolted into the rock, running two hundred feet to the top --\n        something left behind by a past expedition, now a tourist's\n        toy. And the bottom rung is three feet above Gabe's\n        outstretched arms.\n\n                                        GABE\n                      Hasn't gotten any lower in the last\n                      year.\n                            (coiling for jump)\n                      Bitker, you cheap bastard. Would\n                      another four feet have killed you?\n\n        Gabe leaps up, grabbing the bottom rung instead of a half mile\n        of air, and he shoots up the ladder as we PULL BACK --\n\n        WIDER ANGLE ON MOUNTAIN WALL\n\n        A closer look at terrain seen earlier -- fifty yards away from\n        the ladder, a waterfall is spewing out of the wall, giving the\n        appearance that the mountain has sprung a torrential leak.\n\n        As we track Gabe up the ladder, we can see where the water's\n        coming from -- a whirling lake on top of the mountain. Its\n        constant motion keeps it from totally freezing, but the lake\n        is still coated with a veneer of ice, moving in thick chunks\n        through circular currents on the surface.\n\n        ELSEWHERE ON MOUNTAIN SLOPE - HAL AND GANG\n\n        are negotiating the grade, which is slippery, thanks to the\n        fresh, thick snow -- we can see from their relative position\n        to the lake that Gabe has a lead on them. A very slight one.\n\n        TOP OF LADDER - GABE\n\n        pulls himself over and starts running -- as he does, he\n        uproots a big, 3' x 3' park service sign commemorating the\n        \"BITKER CLIMB\" and takes it with him, moving ahead into a\n\n        WOODED AREA\n\n        where Gabe replants the sign near the top of another slope.\n        Gabe heads down towards some rocks -- -- and spots the third\n        case, which took a tough landing on one rock -- it's shattered\n        into halves, and the bands of $5000s are scattered around in\n        the snow.\n\n        Gabe rushes down behind a rock and starts gathering the\n        cash -- soaked by the snow, they've frozen into ice bricks. As\n        Gabe stuffs them into his pack, he's startled by something\n        coming over the rock -- Gabe whirls around to face\n\n        A RABBIT\n\n        that's landed in the snow and looks a lot more frightened than\n        Gabe was. Gabe leans back, relieved. For now.\n\n        EXT. FURTHER UP ON SLOPE - HAL AND GANG\n\n        are closer now -- but as they move down, Hal freezes in place\n        as he sees the \"Bitker\" sign some distance ahead. The sign is\n        out of place. A signal from Gabe -- he is alive. And here.\n\n        Qualen and the others check the monitor. Hal takes the\n        opportunity to back up to a rock formation and swiftly, subtly\n        wedge something into a crack behind his back --\n\n        INSERT - THE OBJECT\n\n        is what Hal lifted off Frank's body -- a speed load cylinder\n        from a revolver, with six fresh bullets in it.\n\n        QUALEN\n\n        checks the monitor -- the relative position shows they're --\n\n                                        QUALEN\n                      Almost there.\n\n        -- but Qualen's grin is wiped away as he looks down at --\n\n        THE MONITOR\n\n        -- the tracer blip is moving -- fast -- away from their\n        position!\n\n        QUALEN'S\n\n        face shifts from incredulity to realization to rage.\n\n        All eyes are on the monitor -- Hal, at the rock formation, has\n        one hand behind his back.\n\n        INSERT - HAL'S HAND\n\n        shakes a box of matches from his sleeve -- he slides a single\n        wooden match halfway out of the pack -- and ignites it with\n        his thumbnail --\n\n        HAL\n\n        moves away from the rock, to draw their attention from what\n        he's been doing --\n\n                                        HAL\n                      Oh, no -- you didn't lose another\n                      one, did you?\n\n        Delmer clicks off his safety and aims at Hal -- Qualen runs\n        into the woods, guided by the monitor -- Kristel follows.\n        Delmer backs Hal up at gunpoint. Hal deliberately moves in a\n        semi-circle, putting Delmer's back to the rocks.\n\n                                        DELMER\n                      What about him?\n\n                                        QUALEN\n                            (over his shoulder)\n                      Kill him! Now!\n\n        Delmer grins as he aims at Hal.\n\n                                        DELMER\n                      Tell me -- where would you like the\n                      first half dozen shots to go?\n\n        INSERT - THE MATCH\n\n        has burned more than halfway down to the rest of the box,\n        which is behind the speed load cylinder --\n\n        HAL AND DELMER\n\n                                        HAL\n                            (hands up)\n                      As long as you're taking requests --\n                      how about -- the base of your spine?\n\n        Delmer smiles and starts to squeeze the trigger -- Hal tenses\n        up, it's now or never --\n\n        INSERT - THE MATCH\n\n        burns down to the box, igniting all the matches --\n\n        ON DELMER\n\n        as there is the sudden sound of six distinct, consecutive\n        gunshots behind him -- the fire's blasted the powder in all\n        the bullets. Delmer, startled, spins around and FIRES up,\n        FIRES down, FIRES across -- by the time he realizes no one's\n        there and he turns back around to find --\n\n        -- Hal is gone, vanished into the woods.\n\n        FOLLOWING QUALEN\n\n        through the woods -- up a slope, around a tree, down another\n        slope -- his eyes fixed on the screen and the blip that's\n        zig-zagging just ahead of him.\n\n                                        QUALEN\n                            (tagging headset radio)\n                      Travers. Get down here. Now.\n\n        TRAVERS\n\n        is trying to repair the helicopter door when the call comes.\n\n                                        TRAVERS\n                      Have you found the money?\n\n                                        QUALEN (O.S.)\n                      No. Walker has.\n\n        Travers, furious, flings the door aside, jumps into the copter\n        and starts the rotor.\n\n        QUALEN\n\n        is running alone, following the monitor lead -- until he sees\n        a band of $5000s in the snow. Sure he's on the right track,\n        Qualen picks it up and picks up his pace too. But we can see\n        that behind him and higher up --\n\n        GABE\n\n        who is on a rise behind a rock, watches Qualen's futile\n        pursuit from a distance, amused. Amused, until --\n\n                                        KRISTEL\n                      You would have lived longer, if you\n                      weren't such a smartass.\n\n        Gabe spins his head around -- and his temple smacks into\n        Kristel's gun barrel.\n\n                                        KRISTEL\n                      You telegraphed this kind of stunt\n                      with that joke snowman. Too bad for\n                      you we're not all gullible.\n\n        Kristel starts to squeeze the trigger.\n\n                                        GABE\n                      Good thing for Qualen you are.\n\n                                        KRISTEL\n                            (pauses, wary)\n                      What do you mean?\n\n                                        GABE\n                      When he comes back, he's going to\n                      shoot you and the other guy, grab the\n                      money, and take off with Travers.\n\n                                        KRISTEL\n                            (squeezing trigger again)\n                      No sale. Say \"night-night\" --\n\n                                        GABE\n                            (talking fast)\n                      He already blew up one of your pals in\n                      that crevice. And I've been in that\n                      copter. It goes a hell of a lot\n                      farther with two people than with\n                      four.\n                            (beat)\n                      Am I wrong? Give him a buzz.\n\n        Kristel eases back with the gun.\n\n                                        KRISTEL\n                      You've got my attention.\n\n                                        GABE\n                      You've also got all the money. And I\n                      can show you how to get off the\n                      mountain with it. Right now.\n\n        ELSEWHERE ON MOUNTAIN - HAL\n\n        tears into a clearing, trying to put some distance between him\n        and Delmer -- as soon as he's out in the open, though,\n\n        THE HELICOPTER\n\n        thunders over Hal -- Travers FIRES down at Hal through the\n        doorless pilot's side. Bullets kick up tufts of snow at Hal's\n        heels as he runs down into a steep, sloping wooded area. The\n        tree cover is too thick for Travers to take good aim. Looks\n        like temporary refuge -- but\n\n        INSIDE THE HELICOPTER\n\n        Travers finds a new use for the search copter's heat\n        scope -- using the blip that betrays Hal's body heat as a\n        guide, Travers can still fire down through the trees at\n\n        HAL\n\n        who's still running down the grade -- he hasn't been hit yet,\n        but there's an awful lot of bad luck in the air --\n\n        TRAVERS\n\n        banks the helicopter around and up for another pass.\n\n        EXT. ANOTHER PART OF THE MOUNTAIN/TOWER WOODS - QUALEN\n\n        is slogging uphill after his own tracer blip -- which is\n        turning back around and heading towards him. Qualen aims his\n        gun and waits, but at the top of the hill --\n\n        THE RABBIT\n\n        that spooked Gabe earlier sticks its head up for a curious\n        sniff. It has the tracer fastened to its neck with a currency\n        band. Furious, Qualen FIRES at the rabbit -- it safely speeds\n        away as Qualen smashes the useless tracer monitor and turns\n        around.\n\n        EXT. TRAVERS IN HELICOPTER - TRAVERS POV\n\n        On the heat scope. The blip that represents Hal -- vanishes.\n        Delmer, who has caught up, is at the edge of the tree-lined\n        area -- he looks up at Travers.\n\n                                        TRAVERS\n                            (keying headset radio)\n                      He's hiding twenty yards in -- be\n                      careful.\n\n        EXT. WOODS - DELMER\n\n        \"replies\", beeping twice on the headset's ear button as he\n        moves downhill into the woods, closely following Hal's\n        tracks -- they lead up to the replanted \"BITKER\" sign. Just\n        big enough to hide behind. Delmer smiles, and advances toward\n        the sign --\n\n        -- and looks behind it. Nothing but a mound of snow. Delmer\n        looks again to the tracks, which lead toward\n\n        A SMALL ROCK FORMATION\n\n        also big enough to conceal Hal. Delmer moves toward it as --\n\n        BEHIND THE \"BITKER\" SIGN\n\n        the mound of snow shifts as Hal climbs out, silently shaking\n        off the cover -- the snow hid him not only from Delmer, but\n        from the heat scope as well --\n\n        TRAVERS IN HELICOPTER\n\n        hovers overhead, watching Delmer's blip on the heat scope --\n        but Hal's blip returns, rushing ahead --\n\n                                        TRAVERS\n                            (keying headset radio)\n                      He's right behind you!\n\n        DELMER\n\n        whirls around at the warning, his gun BLAZING, but Hal is too\n        fast -- he swings the sign like a club, knocking Delmer's gun\n        away into the snow. Before Hal can swing again, Delmer\n        brutally punches Hal in the face -- stunned, Hal drops the\n        sign --\n\n        IN HELICOPTER - TRAVERS POV\n\n        Travers can't do anything now but watch the heat scope as if\n        it were a video game -- now it's just one big blip --\n\n        DELMER AND HAL\n\n        thrash around in the snow, pummelling each other -- Hal's\n        getting the worst of it, as Delmer manages to get on top of\n        him and deliver a series of punishing blows to his face. Ready\n        to end it, Delmer tries to get the bolt gun off a clip on his\n        front pack strap -- but he has trouble unfastening it. Hal\n        rallies with a solid punch to Delmer's face. Hal gets Delmer\n        off of him and follows with two more.\n\n        Delmer is knocked away, landing on the sign board -- but clear\n        from Hal -- another chance to get the bolt gun off --\n\n        Hal quickly moves to the sign and grabs its post -- before\n        Delmer can move off the sign's board, Hal's running forward.\n        shoving the sign ahead of him with Delmer on top -- Hal lets\n        go, and the sign, with Delmer, sleds downhill on the hard\n        packed snow --\n\n        TRAVERS IN HELICOPTER - TRAVERS\n\n        can now see one blip moving quickly away from the other --\n\n                                        TRAVERS\n                            (into radio)\n                      Something's moving fast down the\n                      hill -- is it Tucker?\n\n        HAL\n\n        has found Delmer's fallen headset radio and put it on.\n\n                                        TRAVERS (O.S.)\n                            (over radio)\n                      Answer me! Is it Tucker?\n\n        Hal smiles and beeps twice -- affirmative.\n\n        IN HELICOPTER\n\n        Happy at last, Travers takes off after the blip, flying down\n        the incline and staying just above the trees, strafing an\n        intense fusillade at\n\n        DELMER\n\n        who's screaming as a storm of bullets rip through him and the\n        sign and the surrounding snow, keeping pace with his downhill\n        slide --\n\n        TRAVERS IN HELICOPTER\n\n        FIRES until his clip is empty -- he heads for the end of the\n        tree line as his target comes out, skidding to a stop in the\n        snow. Travers gleefully moves lower down for a closer look\n        but is shocked to see\n\n        DELMER - ON \"SLED\"\n\n        Delmer's highly perforated body rolls off the sign as it\n        finally skids to a dead halt.\n\n        CLOSE ON TRAVERS\n\n        who is apoplectic -- he's just shot one of his own men.\n\n                                        HAL (O.S.)\n                            (over radio)\n                      Thanks loads.\n                            (beat)\n                      I couldn't have killed him without\n                      you.\n\n        Travers looks down at the heat scope -- blank.\n\n        HAL\n\n        is hiding his body \"heat\" under a rock formation.\n\n        IN HELICOPTER\n\n        Stymied, Travers furiously banks it away from the wooded area\n        and circles around the mountain's other side.\n\n        EXT. MOUNTAIN - SLOPING GRADE - GABE AND KRISTEL\n\n        Gabe, hands on his head, moves down a slope near a mountain\n        edge, ahead of Kristel, who's aiming her gun at his back.\n\n                                        KRISTEL\n                      How much further?\n\n                                        GABE\n                            (stops)\n                      It's right over there.\n\n        Gabe nods ahead, indicating what looks like a\n\n        A SHED\n\n        that is partially obscured by snow, about twenty feet distant\n        across a snowy plateau.\n\n        GABE AND KRISTEL\n\n                                        GABE\n                      It's a storage locker for the rangers.\n                      Everything you need to get off the\n                      mountain is in there -- skiis, food --\n                      I'll show you --\n\n        Gabe shows a sudden burst of enthusiasm and starts quickly\n        moving ahead again -- Kristel suspiciously notices this --\n\n                                        KRISTEL\n                      Don't move.\n\n        Kristel gets ahead of Gabe and walks backward, keeping her gun\n        trained on him as she crunches through the snow.\n\n                                        KRISTEL\n                      Skiis, food -- and maybe guns too,\n                      right?\n                            (moves backward)\n                      Keep walking. Not too close.\n\n                                        GABE\n                      We'd make better time walking straight\n                      ahead. Qualen's not going to be\n                      hopping down the bunny trail too much\n                      longer.\n\n                                        KRISTEL\n                            (walking backward)\n                      Right. So I'd better have one less\n                      problem when he arrives.\n\n                                        GABE\n                            (knowing this means him)\n                      Don't fuck up. You still need me to\n                      show you a route off the mountain.\n\n                                        KRISTEL\n                      You've worn that one out, Walker --\n                            (snaps back bolt)\n                      -- I'll find my own way down.\n\n        Kristel solidly plants her feet firmly to shoot Gabe, but her\n        feet sink through the crystallized snow cover -- --\n        Kristel completely disappears down through the snow as it\n        collapses under her -- she's pulling the trigger and SHOTS\n        go wild as she sinks and sinks --\n\n        ON GABE\n\n        who's had to drop flat on his stomach to avoid the same\n        fate -- as he scrambles back to solid land, Kristel's SHOTS\n        arc up through the snow toward him, and the snow crumbles\n        around him -- but he bellies ahead as --\n\n        ON THE SNOWDRIFT'S TOP\n\n        Kristel's GUNSHOTS slow, and finally, stop, the very last of\n        them loosening the snow around --\n\n        THE \"SHED\"\n\n        that was obscured by snow was a tall, three-sided park service\n        sign shouting \"WARNING -- SNOWDRIFT -- DO NOT CROSS\" in eight\n        different languages. The rest of the snow falls away from it,\n        revealing a cautionary but cheesy illustration -- a\n        stick-figure fatally sinking into the snow.\n\n        GABE\n\n        bellies ahead, flat on his stomach, testing the snow with the\n        ice axe's staff -- only when he hits something solid with it\n        does he get back up to his feet. But the sound of ice-crusted\n        snow CRUNCHING above Gabe alerts him that --\n\n        QUALEN\n\n        has just hit the top of the slope and spotted him -- Qualen's\n        gun BLAZES down --\n\n        GABE\n\n        is on the run, but it's that lead-footed, slow motion stuff\n        that only happens in nightmares -- with every step, a foot\n        breaks through the icy crust and sinks into two feet of\n        snow -- Gabe stays just ahead of the barrage, making it into\n\n        A THICK WOODED AREA\n\n        which is very temporary refuge -- Qualen will be down in\n        seconds. Gabe looks down the slope. Running is impractical. So\n        he sits down.\n\n        QUALEN\n\n        arrives where Gabe was and looks down the slope --\n\n        QUALEN'S POV - GABE\n\n        is whizzing down the slope in a sitting position, using his\n        back and his shoes as gliders, the ice axe as a rudder.\n        Alpinists call this a \"sitting glissade\". Colorado climbers\n        call it \"butt skiing\". Some psychos do this for fun.\n\n        GABE'S POV - THE SLIDE\n\n        is anything but fun -- Gabe can't control his speed or\n        direction well at all -- Gabe barely manages to steer in and\n        out of trees and boulders in his path --\n\n        QUALEN\n\n        starts running down the slope -- he doesn't have speed, but he\n        does have the machine gun -- he FIRES short bursts at --\n\n        GABE\n\n        who tries to steer away from the line of fire -- Gabe is hit\n        in the shoulder -- he slides out of control, and rolls down --\n\n        -- to the slope's bottom. Gabe painfully lifts himself up and\n        moves through the woods, coming out of the trees to\n\n        THE LAKE\n\n        The bridge that spans it is ahead of Gabe -- but there is\n        nothing around but flat terrain. It's a beautiful sight, but\n        no good for hiding. And Qualen is right behind him.\n\n        EXT. MOUNTAIN SLOPE - HAL\n\n        rushes down to Delmer's body -- in the snow, he finds the\n        discarded machine gun and holds it up, but stray bullets from\n        Travers' fusillade have made it inoperable. Hal tosses it\n        aside and checks Delmer's bloody pockets for more weapons.\n        Nothing. Just a couple of machine gun clips, and the bolt gun.\n\n        EXT. MOUNTAIN TRAIL - MAGGIE\n\n        is wending her way down a hiking trail on the opposite side of\n        the mountain. In plain view,\n\n        TRAVERS IN HELICOPTER\n\n        is circling the mountain -- he spots Maggie from on high and\n        moves down after her.\n\n        MAGGIE\n\n        hears the helicopter, and turns around -- she has no way of\n        knowing it isn't Frank, so she takes off her jacket and waves\n        it as a signal --\n\n                                        MAGGIE\n                      Frank! Down here!\n\n        The helicopter moves down until Maggie can see --\n\n        TRAVERS\n\n        is at the controls.\n\n        MAGGIE\n\n        starts running, but it's useless. Nowhere to hide. Travers\n        hovers over her, FIRING ahead of her, FIRING behind her, not\n        to kill, just to make a point. He's in charge.\n\n        EXT. MOUNTAIN TRAIL\n\n        Maggie finally stops -- Travers lands the copter and opens the\n        passenger door, keeping his gun trained on her.\n\n                                        TRAVERS\n                      Hop in. I know someone who'd like to\n                      see you again before he dies.\n\n        EXT. BOTTOM OF THE SLOPE - QUALEN\n\n        moves down to the slope's edge, noting with pleasure the blood\n        in the snow. Gabe is wounded, and he's left a trail as a\n        bonus.\n\n        Qualen moves out lakeside -- nothing visible but the thick,\n        flat ice chunks circling in the currents. But Gabe's\n        footprints and blood lead straight ahead to the bridge.\n\n        Qualen starts to run across the bridge, but stares down --\n\n        QUALEN'S POV - THE BRIDGE'S PLANKS\n\n        The blood -- and slush from Gabe's boots -- end halfway\n        across.\n\n        QUALEN\n\n        Smiles and shakes his head. Too obvious. Gabe is hiding\n        underneath the bridge, in the three foot deep network of steel\n        supports. Qualen slows his pace, staring down through the\n        thin, but visible cracks between the planks.\n\n        TIGHT CLOSE-UP - GABE'S FACE\n\n        grimacing, shivering, ashen from his wound and exertion --\n        lined shadows on his face confirm he is under the bridge.\n\n                                        QUALEN (O.S.)\n                      You've come a long way to die.\n\n        QUALEN\n\n        enjoying himself, slams a fresh clip into his machine gun.\n\n                                        QUALEN\n                      If you were smart, you'd have left\n                      your friend behind. I would have.\n                      There's no shame in staying alive.\n\n        Qualen stops, staring down. Through the gaps, Gabe's parka is\n        visible. Right where the blood trail ends.\n\n                                        QUALEN\n                            (aims down)\n                      But you're not smart. And now you're\n                      going to die from an overdose of\n                      heroism.\n\n        Qualen BLAZES the gun into the planks --\n\n        UNDER THE BRIDGE - GABE\n\n        is clinging to the steel supports of the small bridge,\n        several feet ahead of where his empty parka is being\n        shredded by the FUSILLADE -- without the parka, Gabe is\n        freezing, and too many bullets are coming too close for\n        comfort as they RICOCHET on the bridge's supports --\n\n        QUALEN\n\n        stops firing and kicks away the planks, which are a tangle of\n        toothpicks at this point -- Qualen bends down --\n\n        -- and sees there's nothing in the parka except for Gabe's\n        back. Qualen's face registers anger and surprise as -- -- Gabe\n        appears at the edge of the hole -- before Qualen can react,\n        Gabe swings up with his ice axe, hooking it around the\n        shoulder strap of Qualen's machine gun -- Gabe yanks down,\n        and Qualen falls head first\n\n        UNDER THE BRIDGE\n\n        with Gabe -- Qualen catches himself by hooking an arm and a\n        leg on one of the steel supports -- but both\n\n        THE ICE AXE AND THE GUN\n\n        fall, landing on separate chunks of ice floating underneath\n        the bridge --\n\n        IN THE SUPPORTS\n\n        Gabe pulls himself through the girders to Qualen and punches\n        him with his good arm, but Qualen is unfazed -- neither are in\n        good position, it's like a fistfight on a jungle gym -- --\n        Qualen steadies himself to savagely punch Gabe in his\n        shoulder wound -- Gabe YELLS in pain and tries to block the\n        next one, but Qualen punches him again, and Gabe lets go of\n        the support, falling -- -- on the way down, Gabe grabs\n        Qualen's leg with his good hand -- too low to grab the bridge,\n        Gabe dangles just over the water, raising his legs above it as\n        Qualen tries to kick him off -- -- Gabe holds onto Qualen's\n        leg, and swings on it like a pendulum -- Gabe twists the leg\n        -- Qualen loses his grip on the icy steel and lets go --\n        both\n\n        QUALEN AND GABE\n\n        fall -- they land hard, not in the water, but on a\n        raft-sized chunk of ice driven under the bridge by the\n        current. Their weight teeter-totters the ice as they get up --\n        they're in danger not just from each other, but from\n\n        THE FAST APPROACHING WHIRLPOOL\n\n        where the ice chunks are drawn into the fiercely swirling\n        vortex that drains into the waterfall --\n\n        ON THE ICE RAFT\n\n        Qualen and Gabe circle each other like cautious boxers, as the\n        ice itself swirls in the current -- if either makes the wrong\n        move, they'll both go over. Gabe swings at Qualen, but Qualen\n        throws a leg under Gabe and stiff-arms him down -- Gabe hits\n        the ice hard, his chest hanging over the side -- Qualen moves\n        in to shove him off -- but their combined weight on the same\n        side of the ice starts to tip it over -- Gabe viciously\n        kicks Qualen back, gashing his face with his boot's crampon as\n        Qualen grabs the ice raft's opposite side, levelling it.\n\n                                        QUALEN\n                            (wiping the gash)\n                      Stalemate, isn't it?\n\n                                        GABE\n                            (winded)\n                      Not any more.\n\n        Gabe, still prone, reaches out -- the chunk of ice with\n        Qualen's machine gun is floating by. Gabe snatches up the gun\n        and pulls the trigger. Nothing but an empty CLICK.\n\n                                        QUALEN\n                      Far more intimidating when it's\n                      loaded.\n\n        The chunk of ice with Gabe's ice axe floats by Gabe -- Gabe\n        grabs for it, but misses -- as the ice raft spins around,\n        Qualen manages to snatch it up -- Qualen scythes it down at\n        Gabe, slamming the blade into the ice as Gabe rolls away --\n\n        WIDER VIEW - THE ICE RAFT\n\n        is nearing the center of the whirlpool -- the current is\n        faster and stronger here -- if it doesn't swallow the ice\n        raft, it will definitely upend it --\n\n        QUALEN AND GABE\n\n        stay on opposite sides of the ice raft for balance -- Qualen\n        swings out at Gabe with the axe. Gabe ducks and tries to go\n        low to hit Qualen with the gun, but Qualen swings the axe down\n        again, whizzing right past Gabe as it sinks into --\n\n        THE CENTER OF THE ICE RAFT\n\n        -- a crack spiderwebs through the ice around the blade --\n\n        GABE\n\n        quickly reacts, jumping onto another bed-sized chunk of ice\n        floating by, landing on his stomach and braking himself by\n        digging his crampons in -- just as --\n\n        QUALEN\n\n        realizing what deep shit he's in, looks for another chunk of\n        ice to make the same move -- to sees one just out of reach.\n        Qualen pulls the ice axe out of the raft's center to drag the\n        other chunk closer in -- -- as he does, the entire raft\n        disintegrates under him -- Qualen plunges into the water, and\n        tries to maintain a slippery grip on what ice is left --\n\n        -- but now at the center of the whirlpool, Qualen is drawn\n        into the vortex --\n\n        GABE\n\n        struggles to his feet and looks down, wincing --\n\n        GABE'S POV - QUALEN GOING DOWN\n\n        Qualen's inaudible scream is just a burst of rising bubbles as\n        he shoots down to the bottom of the lake -- and beyond --\n\n        QUALEN'S POV - UNDERWATER\n\n        Qualen is shoved with incredible force and speed through the\n        lake's tunnel drain --\n\n        ON THE MOUNTAIN WALL - THE WATERFALL\n\n        BLASTS OUT full force, hurling a still thrashing Qualen a\n        half a mile to the ground below!\n\n        GABE\n\n        has no time to celebrate -- the chunk of ice he's on leaves\n        him moments from the same fate. One more time around, and\n        it's down the drain. Gabe takes a deep breath. No choice. He\n        leaps --\n\n        WIDER VIEW - THE ICE - GABE LEAPING\n\n        -- from one chunk of ice to the other, running the way you\n        would across stones in a stream, zig-zagging to catch the ones\n        big enough to support him -- only his crampons keep him from\n        sliding off, only his momentum keeps him from capsizing the\n        ice chunks, which shoots away from him in his wake --\n\n        GABE\n\n        lands on an ice raft floating towards the bridge. No choice --\n        Gabe lunges off the ice raft and reaches for one of the bridge\n        supports -- his hand catches -- but it's slippery and he's\n        weakened -- Gabe slides off, but --\n\n        A HAND\n\n        reaches down and grabs him --\n\n        HAL\n\n        pulls Gabe the rest of the way onto the bridge. Gabe's\n        surprise gives way to a grin almost as big as Hal's.\n\n                                        HAL\n                            (eyeing Gabe's ruined\n                             shirt)\n                      Nice outfit.\n                            (hands him his parka)\n                      I know you never liked the orange, but\n                      --\n\n                                        GABE\n                      Didn't care for the Smokey The Bear\n                      hats, either. That's why I quit.\n                            (pulls on parka)\n                      You all right?\n\n                                        HAL\n                      I feel better than you look. I can\n                      live with that.\n\n        Gabe looks down at the parka -- it's completely full of\n        bullet holes.\n\n                                        GABE\n                      Hardly seems worth zipping, huh?\n                            (serious now)\n                      Frank?\n\n        Hal sobers -- shakes his head no. A cloud passes over Gabe's\n        face.\n\n                                        HAL\n                      It's not over, Gabe. Travers took the\n                      helicopter.\n\n        INSIDE HELICOPTER - FLYING ELSEWHERE OVER MOUNTAIN\n\n        Maggie's hands are cuffed to a bar on the helicopter's roof.\n        Travers keys his headset radio while piloting the copter.\n\n                                        TRAVERS\n                            (into radio)\n                      Qualen -- Kristel -- come in --\n\n        HAL AND GABE ON BRIDGE\n\n        Gabe hears Hal's borrowed headset radio crackling -- he holds\n        his hand out to Hal.\n\n                                        GABE\n                      May I?\n                            (dons it, keys it)\n                      They can't talk right now, Travers.\n                      Kristel's busy making snow angels --\n                      and I'm not sure, but I think Qualen\n                      is still falling.\n                            (radio silence)\n                      Any messages?\n\n        A moment's silence -- then --\n\n                                        MAGGIE (O.S.)\n                            (over radio)\n                      Gabe?\n\n                                        GABE\n                            (keying it)\n                      Maggie --\n\n        INSIDE COPTER - TRAVERS\n\n        yanks the radio off Maggie and puts it back on --\n\n                                        TRAVERS\n                            (into radio)\n                      You wanted to make a trade earlier,\n                      Walker -- still interested?\n\n                                        GABE (O.S.)\n                            (pause)\n                      I've got the money. Fly to the lake.\n                      And if you touch her --\n\n        Travers cuts off the radio, smiles, and banks the helicopter\n        down around the mountain wall.\n\n        GABE AND HAL ON BRIDGE\n\n                                        HAL\n                      Now what?\n\n                                        GABE\n                      I have no fucking idea.\n                            (holds Qualen's gun)\n                      Empty.\n\n                                        HAL\n                            (smiling)\n                      Not for long.\n\n        Hal fishes into his pockets and pulls out one of the ammo\n        clips he took from Delmer, Gabe tries to force it into the\n        gun's stock -- but it's the wrong size.\n\n                                        GABE\n                            (sagging against rail)\n                      Why can't anything be easy?\n\n        THE HELICOPTER\n\n        thunders around the mountain wall, getting closer --\n\n        HAL AND GABE\n\n        have crossed the bridge, near the mountain edge -- Gabe, now\n        wearing his pack again, nods over to the wooded area.\n\n                                        GABE\n                      Stay over there --\n\n                                        HAL\n                      Look -- let me --\n\n                                        GABE\n                      -- what, throw snowballs at him?\n                      Just -- whatever happens -- get Maggie\n                      out of here.\n\n                                        HAL\n                            (relenting)\n                      Count on it.\n                            (beat)\n                      And Gabe? Thanks for tagging along.\n\n                                        GABE\n                            (smiles)\n                      Thanks for asking. I forgot how much I\n                      enjoyed rescue work.\n\n        Gabe limps toward the mountain's edge as Hal runs into the\n        woods.\n\n        THE HELICOPTER\n\n        blasts along the wall towards the lake -- the waterfall and\n        the ladder are just ahead. The copter radio crackles --\n\n                                        WRIGHT (O.S.)\n                            (from radio)\n                      Come in, Rocky Mountain Rescue --\n                      urgent -- come in --\n\n        Travers recognizes the voice -- frowning, he snaps off the\n        radio and banks the helicopter up over the top --\n\n        TRAVERS IN HELICOPTER - TRAVERS POV\n\n        tops the precipice, revealing Gabe, standing on the end of a\n        narrow spur -- it just out from the edge like a diving board.\n        Gabe has his pack on one arm -- the money is visible. Gabe\n        levels Qualen's emptied gun on Travers and the copter -- this\n        bluff is all he has left.\n\n                                        GABE\n                            (over radio)\n                      Remember that bet you made? About\n                      whether I could find the money for you\n                      or not?\n                            (holds pack over drop)\n                      You won.\n\n        Travers helplessly flies in low, tight circles over Gabe and\n        the spur -- if he shoots Gabe, the money falls too, Travers\n        presses his gun at Maggie.\n\n                                        TRAVERS\n                            (into radio)\n                      I'll kill her --\n\n                                        GABE\n                            (over radio)\n                      You do, and the spring thaw's going to\n                      be worth thirty million bucks.\n                            (pause)\n                      No rush. I'm sure you've got lots of\n                      time.\n\n                                        TRAVERS\n                            (into radio)\n                      All right. Drop the gun first.\n\n                                        GABE\n                            (into radio)\n                      When she's safe on the ground.\n\n        EXT. SPUR/COPTER\n\n        Travers has no choice but to give in -- he gives Maggie the\n        handcuff key, and she frees herself as he flies away from the\n        spur, touching the copter down on the mountain top.\n\n                                        TRAVERS\n                            (to Maggie)\n                      Get out.\n\n        Maggie moves out the door and stares uncertainly at Gabe.\n\n                                        GABE\n                            (shouting)\n                      Run!\n                            (she doesn't)\n                      Run!\n\n        Maggie runs for the trees. When Gabe is sure she's safe, he\n        throws the gun away -- but keeps the pack suspended over the\n        edge.\n\n                                        GABE\n                            (into radio)\n                      Now come and get it. My arm's getting\n                      tired.\n\n        EXT. HELICOPTER\n\n        Travers flies the copter up and over, until he and it are five\n        feet away from Gabe's position on the spur. Gabe is buffeted\n        by the copter's wind, but stands firm. Travers levels his gun\n        at Gabe through the open passenger door as Gabe heaves the\n        pack in. Travers doesn't even look down -- he just stares at\n        Gabe with hate as he prepares to shoot.\n\n                                        GABE\n                            (shouting)\n                      Don't you want to count it?\n\n        Puzzled, Travers takes his gun hand and rips open\n\n        THE PACK\n\n        The $5000s are there -- but they've been shredded by\n        Qualen's earlier blast of gunfire. Few, if any, of the bills\n        are passable.\n\n        TRAVERS\n\n        stares down, incredulous -- as he does --\n\n        GABE\n\n        rips open a perforated section of parka and yanks his bolt\n        gun from his waist --\n\n        Travers looks up and raises his gun at Gabe -- but Gabe fires\n        first -- the bolt imbeds itself high in Travers' chest.\n        Gasping, Travers drops his gun -- it falls over the pack and\n        out the open door -- Travers clutches at his chest --\n\n                                        GABE\n                      Don't spend it all in one place, you\n                      son of a bitch.\n\n        Travers falls back in his seat and loses control of the\n        helicopter -- it spins around, and Gabe has to instantly\n        flatten to avoid the tail when it swings at him -- Gabe looks\n        down as --\n\n        THE HELICOPTER\n\n        quickly begins to spiral down in wide, aimless circles --\n        Travers has clearly lost control --\n\n        GABE\n\n        stares down coldly, waiting for the crash -- but --\n\n        INSIDE THE COPTER - TRAVERS\n\n        won't give up -- sweating, bleeding, he sits forward and\n        grabs the stick, seizing control of the helicopter again --\n\n        GABE'S POV - THE HELICOPTER\n\n        stops its uncontrolled descent and begins to rise up and\n        up -- with clear purpose --\n\n        CLOSE ON GABE\n\n        eyes widening with realization. Gabe gets up from the spur and\n        starts running back towards the woods -- several hundred yards\n        from safety -- before he can get very far --\n\n        THE HELICOPTER\n\n        tops the precipice edge and, sweeping low over the snow, it\n        gets between Gabe and the trees, cutting him off --\n\n        WOODED AREA - HAL AND MAGGIE\n\n        watch, powerless --\n\n                                        HAL\n                      He's going to run Gabe down --\n\n        TRAVERS IN HELICOPTER\n\n        Ashen, hyperventilating, he's running on pure adrenalin and\n        fury as he drives the stick forward --\n\n        TRAVERS POV - GABE\n\n        is stiff-legging it toward the edge of the mountain -- but\n        he's too banged up to run fast through the thick snow --\n\n        THE HELICOPTER\n\n        with its skids skipping just over the snow overtakes --\n\n        GABE\n\n        as he throws himself flat into the snow -- the front of the\n        skid misses Gabe by inches as it blasts over him --\n\n        THE HELICOPTER\n\n        moves out over the precipice edge -- Travers banks it wide to\n        circle back around for another run --\n\n        GABE\n\n        gets back up as the helicopter swings back behind him --\n\n        IN A WOODED AREA\n\n        Hal rips the lining out of one of his pockets and stuffs it\n        into one of the ammo clips -- Maggie stays back as he runs for\n        all he's worth out into the clearing --\n\n        THE HELICOPTER\n\n        has circled back around, stopping at a hover far back in the\n        clearing -- Travers intends to not just run Gabe over, but to\n        run him off the edge as well --\n\n        GABE\n\n        lumbers as fast as he can towards the edge --\n\n        TRAVERS\n\n        knows he has Gabe nailed -- he shoves the stick forward --\n\n        THE HELICOPTER\n\n        flies forward, skids just inches over the snow --\n\n        HAL\n\n        runs out to where Travers is heading -- he lights the cloth\n        in the ammo clip -- as\n\n        THE HELICOPTER\n\n        flies past\n\n        IN THE CLEARING\n\n        Hal hurls the clip, with its cloth \"fuse\" burning down, into\n        the doorless side of the copter --\n\n        INSIDE THE HELICOPTER\n\n        -- the makeshift bomb bounces to the floor of the cockpit --\n        Travers sees it and looks down, but --\n\n        THE \"FUSE\"\n\n        sputters out -- nothing but glowing embers in the cloth --\n\n        TRAVERS\n\n        smiles -- nothing to worry about -- he speeds ahead --\n\n        CLOSE ON THE HELICOPTER'S SKIDS\n\n        as they slice through the top of the snow towards --\n\n        GABE\n\n        as he runs toward the mountain's edge -- it's just a couple of\n        feet ahead, but the copter is a couple of feet behind --\n\n        -- as the copter overtakes Gabe, dipping even lower into the\n        snow, he dives off the edge --\n\n        FOLLOWING GABE - FALLING\n\n        Gabe is at the ladder -- he falls the first twenty feet of the\n        long drop, then grabs a rung on the cable ladder, very\n        painfully stopping his fall -- but in the same split second --\n\n        THE HELICOPTER\n\n        skid meant to impale Gabe catches the top two rungs of the\n        cable ladder --\n\n        WIDE SHOT - THE HELICOPTER\n\n        -- caught in the rungs of the cable ladder, the helicopter\n        keeps flying out over the abyss, but as it pulls the cable\n        ladder, it pops out the bolts that hold the ladder in place,\n        rung by rung -- -- still going full tilt, the copter strains\n        against the ladder -- thirty feet of it tethers the copter\n        to the wall -- -- and Gabe is dangling from the center of\n        it.\n\n        ON THE LADDER - GABE\n\n        has one arm hooked around a rung, hanging on for his life as\n        the copter thrashes the ladder up and down --\n\n        INSIDE THE COPTER\n\n        Travers is disoriented by the jolt, and tries to maintain\n        control -- he doesn't see --\n\n        -- that the cloth fuse on the ammo clip has reignited -- it\n        burns down to the clip, and fifty rounds explode like a\n        string of firecrackers --\n\n        -- Travers tries to shield himself as he is struck by airborne\n        lead. Shrapnel blasts into the instrument panel --\n\n        THE HELICOPTER\n\n        still strains against the cable ladder but the engine goes\n        dead -- the rotor blades slow --\n\n        GABE ON LADDER\n\n        Gabe stares in horror at the stalling rotor -- if it were\n        possible for him to grip the ladder tighter, he'd do it now --\n\n        ON THE HELICOPTER\n\n        -- as the rotor WHOPS to a dead halt the copter arcs down\n        and slams against the mountain wall -- the skids are still\n        caught in the ladder, and it holds --\n\n        GABE\n\n        is shaken off by the massive impact -- he falls -- --\n        landing on the helicopter, half in and half out of the\n        cockpit! As Gabe scrambles for a solid hold --\n\n        INT. HELICOPTER\n\n        -- Travers, who has been shaken to the opposite side of the\n        copter, reaches into his jacket and pulls out the pistol he\n        took from Frank -- he aims at Gabe --\n\n        INSERT - THE HELICOPTER SKID\n\n        One of the two rungs holding the copter up bursts --\n\n        THE HELICOPTER\n\n        slips, now hanging from just a single rung -- -- and the\n        impact of the slip makes Travers drop the gun -- it falls out\n        the open passenger door. Travers scrambles up through the\n        cabin to go after -- -- Gabe, who is trying to get off the\n        helicopter and onto a solid part of the ladder before the\n        whole thing goes down --           Gabe jumps for the wall as\n        Travers scrambles behind him and --\n\n        CLOSE ON THE HELICOPTER SKID\n\n        -- as the last rung supporting the copter snaps in two --\n\n        GABE\n\n        grabs hold of the ladder as\n\n        THE HELICOPTER\n\n        plummets down -- but as it starts its fall --\n\n        TRAVERS\n\n        leaps from the falling copter and grabs Gabe's leg -- Gabe\n        struggles to support both of them, but Travers, weakened from\n        his wound, loses his grip on Gabe's leg -- he stares up in\n        terror at Gabe as he clutches Gabe's snow-slick boot --\n\n                                        GABE\n                      Cheer up. It's a beautiful spot to\n                      die.\n\n        Travers slides off and away --\n\n        THE FALL - LONG SHOT\n\n        Travers SCREAMING as he free falls, trailing behind the\n        helicopter -- we follow the entire four thousand foot drop --\n\n        -- until the helicopter explodes when it hits the ground far\n        below, and the fireball engulfs Travers just before he\n        impacts into the explosion!\n\n        GABE\n\n        looks down at the burning wreck and clings to the ladder,\n        closing his eyes for a moment in exhaustion. But the WHOPPING\n        of another helicopter makes him look up --\n\n        THE TREASURY HELICOPTER\n\n        has shown up, a little too late to be of any help.\n\n        INSIDE THE TREASURY COPTER\n\n        Wright, Davis and Stuart look at the billowing flames of the\n        wreck -- even from here, the burning money is visible,\n        drifting up in the smoke. Wright turns to Stuart.\n\n                                        WRIGHT\n                      I'm no expert -- but what do you make\n                      of that \"event\"?\n\n        GABE\n\n        is drained -- from somewhere, he finds the strength to lift\n        his head up --\n\n        GABE'S POV - THE WALL\n\n        The section of ladder above him, of course, is gone -- he has\n        to cover the fifty feet of wall above him by free climbing.\n        There are holds that look easy enough for him, but --\n\n        GABE\n\n        leans back, gripping the ladder, too tired to move. Just the\n        thought of one more climb drains him.\n\n                                        GABE\n                            (mumbling)\n                      Forget it. No fucking way. I'm staying\n                      right here. I've spent the night on\n                      walls before -- some of the best\n                      nights of my life have been spent\n                      lashed to walls --\n\n        Before Gabe can take this any farther -- a loop tied to the\n        end of a rope falls to a stop next to him. Gabe looks up --\n\n        ON THE EDGE - HAL\n\n        has thrown the line down. Maggie is by his side.\n\n                                        HAL\n                      Remember -- keep your arms and legs in\n                      the vehicle at all times --\n\n        GABE\n\n        puts the loop around himself and tightens it by rote -- even\n        this action aches.\n\n                                        GABE\n                            (too tired to shout)\n                      Fuck you --\n\n        Hal and Maggie draw Gabe up -- Gabe pulls some of his weight\n        by using hand and foot holds, but when he reaches\n\n        THE PRECIPICE EDGE\n\n        Hal and Maggie are both winded from the effort as they haul\n        Gabe onto the top. Gabe unties himself, and collapses into\n        Maggie's lap.\n\n                                        HAL\n                            (winded, coiling the\n                             rope)\n                      Jesus Christ -- you think you could\n                      have put a little less effort into\n                      that climb? I mean, what have you done\n                      for me -- lately?\n\n        Hal ends his harrangue and looks over -- Gabe has apparently\n        revived, because he and Maggie are locked in the kiss of their\n        lives. Hal stands, and smiles -- he walks toward the Treasury\n        agents, who are scrambling out of the helicopter. Hal starts\n        an explanation that's going to take a long, long time as --\n\n        GABE AND MAGGIE\n\n        break off their kiss.\n\n                                        MAGGIE\n                      Does this mean you're staying?\n\n        Off Gabe's answering smile, we --\n\n                                                            FADE OUT.\n\n\n\n\n\nCliffhanger\nWriters :   Michael France\nGenres :   Action  Adventure  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:41.493443"}