{"title": "Color of Night", "film_link": "/Movie Scripts/Color of Night Script.html", "script_link": "/scripts/Color-of-Night.html", "info_raw": "\n\nColor of Night Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Billy Ray  Matthew Chapman\nGenres  Mystery  Romance  Thriller\nMovie Release Date : August 1994\nSubmitted by: Dominique\n\nRead \"Color of Night\" Script\n\n\n", "script": "\n\r\n\r\n\r\n                                    COLOR OF NIGHT\r\n\r\n\r\n\r\n                         \r\n                                      Written by\r\n\r\n                              Billy Ray & Matthew Chapman\r\n\r\n\r\n\r\n\r\n                         \r\n                         CREDITS\r\n                         \r\n          Credits start on a black screen, then they continue during the\r\n          whole scene at Michelle's place, and they end at the beginning of\r\n          the scene at Bill Capa's office.\r\n                         \r\n          MICHELLE'S PLACE - INTERIOR DAY\r\n                         \r\n          Close-up on a silver lipstick stand made into a bad taste musical\r\n          box. We see Michelle's hand selecting a lipstick then we see\r\n          Michelle putting the lipstick on her lips, seated in front of the\r\n          mirror of her dressing table. She is dressed in a green frock, and\r\n          her face shows that she is quite disturbed.\r\n           Her apartment's decoration is very heavy, with a lot of various\r\n          useless objects and gold-plated furniture and many mirrors.\r\n           She looks for a new dress in her wardrobe, and get mad at not\r\n          finding it. She then goes to a sofa covered with cushions, which\r\n          she throws all around the place, still madder at not finding her\r\n          dress. A cat, who was lying on the armrest of the sofa, runs away\r\n          hurriedly from the mad Michelle.\r\n                         \r\n                          MICHELLE\r\n           God !...... No !......\r\n                         \r\n          Michelle is back in front of the mirror of her dressing-table. She\r\n          takes the lipstick and put a lot of it on her lips, then on her\r\n          teeth, then all around her mouth. She makes faces to herself in\r\n          the mirror. She seems more and more disturbed.\r\n           She takes a chrome-plated revolver in her drawer, starts to put\r\n          it in her purse, then takes it out, spins the cylinder of the\r\n          revolver, and puts the revolver in her mouth, as if she wanted to\r\n          kill herself. But instead, she starts sucking the barrel, while\r\n          she strokes the revolver in a quite erotic way.\r\n                         \r\n          BILL CAPA' OFFICE - INTERIOR DAY\r\n                         \r\n          Large planes of ground glass. We hear, without understanding them,\r\n          some voices and laughs. Then a male voice becomes more\r\n          understandable...\r\n                         \r\n                          BILL'S VOICE\r\n           So who do you think is the enemy ?... No, no, give me a\r\n           specific answer...\r\n                         \r\n          ... then Michelle appears on the screen. She is dressed in a green\r\n          suit, she is heavily made up, et she still seems very disturbed.\r\n           The office is very chic and evidently belongs to a very rich New-\r\n          York psycho-analyst. Beautiful and good taste furniture. Shelves\r\n          with leather-bound books.\r\n                         \r\n                          MICHELLE\r\n           You are the goddamned enemy, Capa, you and this all tower\r\n           of psycho-babble. You know what I hope ? That God gets real\r\n           pissed off and He shrivels up your cock, so that it points\r\n           straight down to Hell, where you belongs !...\r\n                         \r\n          During this reply, Bill Capa has appeared on the screen. He is\r\n          seated. He is wearing a long-sleeve shirt, a necktie, but no\r\n          jacket. He laughs at Michelle's last sentence.\r\n                         \r\n                          BILL\r\n           OK... Michelle, so you will become His Avenging Angel, and\r\n           swoop down to finish me off.\r\n          He stands up.\r\n                         \r\n                          MICHELLE\r\n           Now, I finally get it : you're are like my ex-husband. You\r\n           think that everything got to be either black or white\r\n           because you got color-blind. But God is on my side now. He\r\n           knows I'm not like you\r\n                         \r\n                          BILL\r\n           Well, we are pretty much the same, Michelle. We all do it.\r\n                         \r\n                          MICHELLE\r\n           We all do what ?\r\n                         \r\n                          BILL\r\n           Tend to view our lives as we were looking through a\r\n           keyhole. I's a very limited view of the truth. So, we have\r\n           to fill in the blanks. We invent things.\r\n                         \r\n                          MICHELLE\r\n           I don't know what you mean.\r\n                         \r\n                          BILL\r\n           You invent enemies to test your strength against. You\r\n           invent gods to protect you from these enemies.\r\n                         \r\n                          MICHELLE\r\n          Cutting him.\r\n           What a depressing view of life you have, that is such\r\n           horse-shit !\r\n                         \r\n                          BILL\r\n           Who is the enemy ? One minute you have friends, the next\r\n           moment they've slipped away. You leave here and I wonder\r\n           who is Michelle really hating this week. I try to remember\r\n           and I can't bring it to mind. Do you know why ?\r\n                         \r\n                          MICHELLE\r\n           No, why don't you tell me\r\n                         \r\n                          BILL\r\n           Take a look in the mirror, Michelle\r\n                         \r\n                          MICHELLE\r\n           Which mirror ?... This mirror ?...\r\n                         \r\n                          BILL\r\n           Any mirror. Tell me what you see.\r\n                         \r\n                          MICHELLE\r\n          We see Michelle as if we were watching her from behind the mirror.\r\n           I see... I see your reflection over my shoulder... I see... there\r\n           is nothing much that I really like... I think I prefer the\r\n           view outside actually...\r\n                         \r\n          During this last reply, Bill, standing up, is fidgeting with\r\n          something on his desk. At Michelle's last words, he turns toward\r\n          her, looking alarmed. But he doesn't have time to do prevent her\r\n          from breaking through the glass pane and jumping outside. He yells\r\n          «Michelle» twice.\r\n                         \r\n          A STREET IN NEW-YORK - EXTERIOR DAY\r\n                         \r\n          We see Michelle's body falling all the way down. Capa's office\r\n          must be around the 25th floor. The body crashes on the street. A\r\n          police horse, who was near the impact, rears up in fright. As if\r\n          the asphalt were translucent, we see Michelle's body from\r\n          underneath, with the blood flowing around it.\r\n                         \r\n                          SEVERAL VOICES\r\n           All right, get back there... Stay back !... Get back in your\r\n           car... Stop it...\r\n                         \r\n          BILL CAPA'S OFFICE - INTERIOR DAY\r\n                         \r\n          We see Bill with tears in his eyes. He walks to the broken window,\r\n          and look outside.\r\n                         \r\n                          BILL\r\n          Voice over.\r\n           My God, it was the reddest blood I ever saw, poured around\r\n           her green dress. And... Then the red disappeared...\r\n                         \r\n          OPHTHALMOLOGIST'S OFFICE - INTERIOR DAY\r\n                         \r\n          Bill is seated with a huge ophthalmologic device on his head. He\r\n          finishes the preceding reply.\r\n                          BILL\r\n           Christ, Ed. It was like a vibration of color broadcast from\r\n           Hell. And then the red started to fade away.\r\n                         \r\n          The ophthalmologist moves the device away. We see Bill's face, and\r\n          behind him, projected on the wall, an abstract drawing made of\r\n          colored spots close together. The red spots start to blink and\r\n          then they become grey.\r\n                         \r\n          LARRY'S PLACE - INTERIOR DAY\r\n                         \r\n          It is the apartment of an old New-York intellectual. A bit messy.\r\n          A old Earth globe on a stand. Objects and books everywhere, but\r\n          with an warm atmosphere. Larry wears an open shirt and a sweater.\r\n          Bill also is in open shirt, with a sleeveless sweater. At the\r\n          beginning of the scene, Bill is lying on a couch.\r\n                         \r\n                          LARRY\r\n           Poor Capa ! You're here for me to pity you.\r\n                         \r\n          Larry puts down the newspaper he was reading. It is the New York\r\n          Post. On the front page, a title in large prints : «Patient's\r\n          family sues Manhattan shrink»\r\n                         \r\n                          BILL\r\n           Hell, yes. It doesn't take Sigmund Freud to figure out I\r\n           don't care to see the color of my patients' blood.\r\n                         \r\n                          LARRY\r\n           I'm a little surprised that this happened to you.\r\n                         \r\n                          BILL\r\n           Starts to stand up.\r\n           Sure. You always thought I was a cold-hearted son of a\r\n           bitch.\r\n                         \r\n                          LARRY\r\n           Not really, but there is a kind of arrogance here.\r\n          Bill laughs.\r\n           Do you really believe that you're responsible for her\r\n           illness. You were a small recent part of her life.\r\n                         \r\n                          BILL\r\n           Yes, that's right, that's right. But it's all too fucking\r\n           glib for me, Larry. I cannot dispose of this woman that\r\n           easily.\r\n                         \r\n                          LARRY\r\n           Well, you always were a romantic. Are you involved with\r\n           anyone else ?\r\n                         \r\n          Larry starts to make tea in a corner of the room. Bill is seated\r\n          on an armchair during the following reply, and strokes the grey\r\n          cat who is lying on the table.\r\n                         \r\n                          BILL\r\n           No. I am still a romantic. I just don't have anybody to be\r\n           romantic with. They want to fuck me or marry me... None of\r\n           them want to love me\r\n                          LARRY\r\n           Maybe you don't want to be loved. You had a happy marriage\r\n           once.\r\n                         \r\n                          BILL\r\n           She loved me to death. Then she ran off and loved somebody\r\n           else to death.\r\n                         \r\n                          LARRY\r\n           Of course, there is something else here. To deny red is to\r\n           deny emotion.\r\n                         \r\n                          BILL\r\n           Oh yeah !\r\n                         \r\n                          LARRY\r\n           As you know, that could be very dangerous.\r\n                         \r\n          Bill stands up.\r\n                         \r\n                          BILL\r\n           Yes, yes, I know. Very dangerous. I know and I have got\r\n           something broken. I know it's gonna take some time to get\r\n           fixed.\r\n                         \r\n          He picks up his jacket on a chair and put it on.\r\n                         \r\n                          LARRY\r\n           You're a pretty good therapist. How long does it take a man\r\n           like you to forgive himself.\r\n                         \r\n                          BILL\r\n           I see you when I get back from Los Angeles.\r\n                         \r\n          During the two last replies, Bill has walked to the front door.\r\n                         \r\n                          LARRY\r\n           Don't run away because of one treatment failure.\r\n                         \r\n                          BILL\r\n           I'm not running away, Larry, it's just a little trip to Los\r\n           Angeles. Besides, you can't really run away. It's all up\r\n           here, isn't it...\r\n          He shows his forehead and pretends he is shooting a bullet in it.\r\n           Pow !... It's a package deal. The head goes with me.\r\n                         \r\n          ABOVE L.A. - EXTERIOR DAY\r\n                         \r\n          Shot of L.A. seen from the sky, then shot of an airplane landing.\r\n          On these two short shots, we hear :\r\n                         \r\n                          STEWARDESS\r\n           Ladies and Gentlemen, welcome to Los Angeles. Please remain\r\n           seated until the aircraft comes...\r\n                         \r\n          The end of the sentence is not understandable, because it is mixed\r\n          with the sound of a radio set in a car.\r\n                         \r\n           VOICE IN THE RADIO\r\n           Just another Monday in paradise. There is a fender-bender\r\n           on 405, slowing thing down.\r\n                         \r\n          TAXI IN A TRAFFIC JAM - EXTERIOR DAY\r\n                         \r\n          The voice in the radio is covered by the voice of the taxi driver.\r\n          He wears a French cap and a striped shirt. He has a strong foreign\r\n          accent, which makes his sentences a bit hard to understand. Bill\r\n          is seated at the back of the taxi. He is wearing a black polo\r\n          shirt, jeans and sunglasses.\r\n                         \r\n                          TAXI DRIVER\r\n           Hey ! Jerk-off ! What are you looking at ! There's an\r\n           accident !...\r\n          Short shot of the accident.\r\n           ... Hey ! What happened ? Anybody is hurt ? Anybody is dead ?\r\n          Car horns. A car bumps into the back of the taxi. Bill moves\r\n          forward and backward, and then massages the back of his head.\r\n           What are you doing ? You 're looking there and driving\r\n           here ? Put the pedal on the metal... Asshole !\r\n                         \r\n          BOB'S OFFICE - MEETING ROOM - INTERIOR DAY\r\n          Bob's office is located in a big modern building in downtown L.A.\r\n          A wide sitting room, called «Group Room» is reserved for group\r\n          therapy sessions. Furniture is modern and functional, but with a\r\n          little personal touch.\r\n           Close-up of a woman's hand, who steals a lighter on a table. Then\r\n          we see Sondra putting covertly the lighter in her purse. She is\r\n          dressed in a very elegant way, and wears expensive jewels. Richie,\r\n          a teenagers with a large checkered floating shirt, a sleeveless\r\n          denim jacket and walkman earphones on his head, walks behind her\r\n          without looking at her, and gets seated in an armchair. We hear\r\n          voices, but we understand only a few words here and there. Then a\r\n          voice becomes clearer than the other ones. It is Clark's voice\r\n          counting the books on a shelf.\r\n                         \r\n           BITS OF CONVERSATION\r\n           Is the aquarium with it ?... That's a blue shark... OK... Was\r\n           that an after-schock I felt ?...\r\n                         \r\n                          CLARK\r\n          He is dressed with a very neat grey suit. Everything on him is\r\n          neat : not a hair going the wrong way.\r\n           33 and 3 is... 44... 45\r\n                         \r\n                          CASEY\r\n          He is seated on an armchair shaped like a giant hand. He looks ver\r\n          «artist». He wears his hair tied in a ponytail. He is making fun\r\n          of Clark.\r\n           5...\r\n                         \r\n                          CLARK\r\n           38... 14...\r\n                         \r\n                          CASEY\r\n           33...\r\n                         \r\n                          CLARK\r\n           2...\r\n                          CASEY\r\n           13...\r\n                         \r\n                          CLARK\r\n           3...\r\n                         \r\n                          CASEY\r\n           29... 304...\r\n                         \r\n                          SONDRA\r\n           Casey, you're such a weenie !\r\n                         \r\n                          BUCK\r\n          He looks very rough, with his uncombed grey hair. He wears a red\r\n          sweater without shirt, and a jacket.\r\n           Leave him alone, will you ?\r\n                         \r\n                          CLARK\r\n                          7\r\n                         \r\n                          BUCK\r\n           Clark !\r\n                          CASEY\r\n           8...\r\n                         \r\n                          BUCK\r\n           Clark !\r\n                         \r\n                          CLARK\r\n           Yeah !\r\n                         \r\n                          BUCK\r\n           Did you read the paper to-day ?\r\n                         \r\n                          CLARK\r\n           No !\r\n                         \r\n                          BUCK\r\n          He take off his jacket.\r\n           I was just wondering how many fucking pages it had !\r\n          Casey laughs.\r\n                         \r\n                          CLARK\r\n           Oh Christ ! I fell right into that !\r\n                         \r\n          We see Bob behind the glass on the door of the room. He wears a\r\n          shirt and a necktie, but no jacket. He looks pensively at the\r\n          group.\r\n                         \r\n                          CASEY\r\n           16...\r\n                         \r\n                          CLARK\r\n           4... 47...\r\n                         \r\n                          BUCK\r\n           I care that he is late.\r\n                         \r\n                          CASEY\r\n           I don't get it.\r\n                         \r\n                          SONDRA\r\n           I do too.\r\n                         \r\n                          CASEY\r\n           I don't care.\r\n                         \r\n                          SONDRA\r\n           Why not ?\r\n                         \r\n                          BUCK\r\n           Because his father's paying for his therapy.\r\n                         \r\n                          SONDRA\r\n           Oh, my dead husband is paying for mine, and I still care.\r\n                         \r\n          Casey is looking for his lighter. We see Sondra taping her chin\r\n          with the lighter, then giving it back to Casey.\r\n                         \r\n                          CASEY\r\n           Unbelievable !...\r\n          Bob enters the room.\r\n                         \r\n                          BOB\r\n           I think we should get started now... Clark...\r\n                         \r\n          He closes the door. We hear Bill's voice.\r\n                         \r\n                          BILL\r\n           Hey Bob !\r\n                         \r\n                          BOB\r\n           God ! Bill !\r\n                         \r\n          BOB'S OFFICE - CORRIDOR - INTERIOR DAY\r\n                         \r\n          Bob jumps nervously, then walks in the corridor toward Bill. They\r\n          hug each other.\r\n                         \r\n                          BOB\r\n           How you doing ? You look great.\r\n                         \r\n                          BILL\r\n           I'm good...\r\n                         \r\n                          BOB\r\n           OK...\r\n                         \r\n                          BILL\r\n           I' sorry I'm late. I got stuck in traffic on the freeway.\r\n                         \r\n                          BOB\r\n           Listen... We're just about to get started.\r\n                         \r\n                          BILL\r\n           You know. I'll just wait out here for a while.\r\n                         \r\n                          BOB\r\n           Why don't you join us ?\r\n                         \r\n                          BILL\r\n           Oh no... Listen... I's the last thing I need right now...\r\n                         \r\n                          BOB\r\n           I'm serious... I could use a second look.\r\n                         \r\n                          BILL\r\n           No, Bob... Not tonight...\r\n                         \r\n          Bob drags him by the sleeve and pushes him into the meeting room.\r\n                         \r\n          BOB' OFFICE - MEETING ROOM - INTERIOR DAY\r\n                         \r\n                          BOB\r\n           This is my friend, and colleague, Bill Capa, from New-York.\r\n           Why don't you sit down over there, Bill...\r\n          He sits next to Clark, who stands up to give him room.\r\n           ... I thought it might be interesting for you, and for him,\r\n           if he sat in one of our session.\r\n                          BUCK\r\n           What kind of a shrink are you ?\r\n                         \r\n                          BILL\r\n           I'm a behaviorist.\r\n                         \r\n                          CASEY\r\n           Qualifications ?\r\n                         \r\n                          BILL\r\n           Same as Bob. We went to college together. We fought the\r\n           battle at Penn State Mental Hospital, as interns...\r\n                         \r\n                          BOB\r\n           No one is gonna be offended if you want to say no.\r\n                         \r\n                          BUCK\r\n           No, Bob !\r\n                         \r\n                          SONDRA\r\n          She simpers while she talks.\r\n           Nobod... Nobody wants to say no... I'm Sondra... How are you,\r\n           Bill ?\r\n                         \r\n                          BILL\r\n           Fine, thank you, Sondra.\r\n                         \r\n                          CLARK\r\n           Medical degree ?\r\n                         \r\n                          BILL\r\n           No. I'm a psychologist and a psycho-analyst, not a\r\n           psychiatrist. The Ph.D. is from N.Y.U.\r\n                         \r\n                          CLARK\r\n           OK ! Thank you...\r\n                         \r\n                          CASEY\r\n           So, it's Bill and Bob, therapy \"à deux\" !\r\n                         \r\n                          BOB\r\n           Why don't we begin by introducing ourselves and then saying\r\n           as much or as little about why we are here as we are\r\n           confortable with...\r\n                         \r\n          The secretary closes the door behind Bob's back, who remains\r\n          seated and only turns his head slightly.\r\n                         \r\n                          BUCK\r\n           Name's Buck.\r\n                         \r\n                          SONDRA\r\n           Oh, that's helpful. Very macho of you\r\n                         \r\n                          BUCK\r\n           That's an anti-gender remark\r\n                         \r\n                          BOB\r\n           Sondra ! Sondra, whey don't you start us off ?\r\n                          SONDRA\r\n          She simpers a lot and makes strange faces while she talks.\r\n           OK... My name is Sondra Dorio... and... I always marry older men\r\n           but...\r\n          Richie looks at Bill's feet. Bill is wearing a red sock and a\r\n          green sock, which makes Richie smile.\r\n           ... I am single now... and I keep... I... I want sex all the time...\r\n          Clark looks embarrassed. Casey sneers.\r\n           But I mean... I really do... want... a real relationship... and...\r\n           sometimes, I steal thing... I mean, they're little thing...\r\n          Richie put his walkman earphones back on his ears.\r\n           ... It doesn't make any sense. It's hard to... You know, I... Is\r\n           that OK !\r\n                         \r\n                          BOB\r\n           Thank you.\r\n                         \r\n                          SONDRA\r\n                          THANKS\r\n                         \r\n                          BOB\r\n           Richie !...\r\n                         \r\n                          CASEY\r\n           This will be an event\r\n                         \r\n                          BOB\r\n           Richie !\r\n                         \r\n          Richie doesn't hear a thing because of his earphones.\r\n                         \r\n                          BUCK\r\n          Yelling louder.\r\n           Richie !\r\n                         \r\n          He signals him to take off his earphones. Richie takes them off.\r\n                         \r\n                          RICHIE\r\n           What !\r\n                         \r\n                          BOB\r\n           Would you like to tell Bill a little something about\r\n           yourself ?\r\n                         \r\n                          RICHIE\r\n           No !\r\n                         \r\n                          CLARK\r\n           OK... If nobody else is going to do it, I will. Richie has a\r\n           gender identity problem, and social phobia, and he's\r\n           promised the group no to wear the walkman in this group.\r\n                         \r\n                          BUCK\r\n           Doctor Clark, to lay the inventory on. I like that.\r\n                         \r\n                          CLARK\r\n           Oh, Saint Christopher rattles his chain.\r\n                         \r\n                          BUCK\r\n           Saint Michael, sir.\r\n                          CLARK\r\n           This is not about you.\r\n                         \r\n                          BUCK\r\n           You're right...\r\n                         \r\n                          BOB\r\n           You know what I am saying ?...\r\n          He talks to Richie.\r\n                         \r\n                          RICHIE\r\n          One feels he has elocution problems. He stutters and looks for his\r\n          words.\r\n           I... I... I op... open my mouth to talk, but nothing... happens...\r\n           except when I... when I do drugs. I... I can't... can't talk... so\r\n           that's... how come I'm here... They... they say that I... I... that I\r\n           blush too.\r\n                         \r\n                          CASEY\r\n          Imitating him.\r\n           Y-You c... can say that again...\r\n                         \r\n          Richie jumps on Casey. Sondra stands up to stop him, but she is\r\n          toot late. Richie falls on Casey and knocks his armchair down.\r\n                         \r\n                          RICHIE\r\n           Fuck you !... Fuck you !... I'll tear your fuckin' head off !\r\n           You fuckin' cocksucker !\r\n                         \r\n                          BUCK\r\n           Get up!\r\n                         \r\n          They fight on the floor. Buck tries to take them apart. He\r\n          succeeds in tearing Richie away by holding him with both arms, and\r\n          carrying him away.\r\n                         \r\n                          RICHIE\r\n           Get the fuck off me !\r\n                         \r\n                          BOB\r\n           Buck.\r\n                         \r\n          Richie gets free and walks rapidly out of the room. Sondra tries\r\n          to follow him. Bob stops her.\r\n                         \r\n                          SONDRA\r\n           Richie !\r\n                         \r\n                          BOB\r\n           It's all right... He'll come back...\r\n                         \r\n                          BUCK\r\n          Voice over.\r\n           What do you think, Doctor Clark ?...\r\n                         \r\n          Bob straightens up the armchair and Casey stands up sneering.\r\n                         \r\n                          CASEY\r\n           Was it something I said ?\r\n                          SONDRA\r\n           You are an asshole !\r\n                         \r\n                          BOB\r\n           You know, guys... A little humanity...\r\n                         \r\n                          BUCK\r\n          Talking to Bill.\r\n           Funny... Oh, fucking laugh !...We're entertaining the shit out\r\n           of you, aren't we ?\r\n                         \r\n                          SONDRA\r\n           Why don't you stop feeling responsible for everyone.\r\n                         \r\n                          BUCK\r\n           Would you stop wound-licking, Sondra.\r\n                         \r\n                          SONDRA\r\n          She seems a bit shocked.\r\n           Oh ! That's very nice !\r\n                         \r\n                          BOB\r\n           Buck ?\r\n                         \r\n                          BUCK\r\n           I lost my wife... and daughter... And it just can't seem to\r\n           pass... All right ?\r\n                         \r\n                          BILL\r\n           Very sorry. How did they die ?\r\n                         \r\n                          BUCK\r\n           They say...\r\n          He starts crying.\r\n           ... I... I can't talk about it...\r\n                         \r\n          Sondra turns her head away : she looks disturbed and moved. Clark\r\n          wipes his eyes.\r\n                         \r\n                          BOB\r\n           Casey ?\r\n                         \r\n                          CASEY\r\n          He talks in articulating his words in an affected manner.\r\n           I am Casey Heinz. I am a painter. I live in a loft\r\n           downtown, and I guess... you could say... I'm alienated...\r\n          At the end of his reply, he seems to be ready to cry. He puts his\r\n          head in his hands, then shows his laughing face.\r\n                         \r\n                          SONDRA\r\n           Can't you ever be serious ?...\r\n                         \r\n                          BUCK\r\n           Does a bear poop in the woods ? I sit next to Clark\r\n                         \r\n          He moves to sit behind Clark. He lights a cigarette.\r\n                         \r\n                          CLARK\r\n           And then smoke up a storm. My name is Clark. I'm a lawyer.\r\n           And I... I have a compulsive obsessive disorder.\r\n                         \r\n                          CASEY\r\n           So what's the problem ?\r\n          He sneers.\r\n                         \r\n                          CLARK\r\n           The problem is that if you and Buck are going to smoke in\r\n           here, then the door to Doctor Moore's office must remain\r\n           opened in minimum of fifteen inches.\r\n                         \r\n          Buck comes and sits next to Casey. They smoke together.\r\n                         \r\n                          SONDRA\r\n           I can't stand smoke... OK ?\r\n                         \r\n          Buck and Casey puff clouds of smoke.\r\n                         \r\n                          CLARK\r\n           And I would also like to suggest that you buy one of those\r\n           ashtrays...\r\n                         \r\n                          SONDRA\r\n           How come you don't listen to Clark ? How come you don't do\r\n           anything about this, Bob ?\r\n                         \r\n                          CLARK\r\n           ... that sucks up the smoke and purifies it. They cost nine\r\n           dollars and ninety-nine cents, half of which is four-\r\n           ninety-nine point five.\r\n                         \r\n                          CASEY\r\n                         HE LAUGHS\r\n           He's going to open the door.\r\n                         \r\n                          CLARK\r\n           One of you will have to pay an extra penny, but I'm sure\r\n           you can work that out.\r\n                          CASEY\r\n           He's going to open the door.\r\n                         \r\n                          CLARK\r\n           I'm going to open the door.\r\n                         \r\n          General laugh. Several incomprehensible words. We understand only\r\n          Sondra's next reply.\r\n                         \r\n                          SONDRA\r\n           You smell like an ashtray.\r\n                         \r\n                          CLARK\r\n           You know, if you don't act more seriously in groups.\r\n                         \r\n          Richie enters the room.\r\n                         \r\n                          SONDRA\r\n           Hi, Richie !\r\n                         \r\n                          BUCK\r\n           He's back.\r\n                         \r\n                          CASEY\r\n           He's back.\r\n                         \r\n                          BUCK\r\n           Next time you get snot on the doorknob...\r\n                         \r\n                          SONDRA\r\n           Come sit down here.\r\n                         \r\n                          BOB\r\n           Bill... What would you like to tell us about yourself ?\r\n                         \r\n          Richie walks behind Bill to reach his seat.\r\n                         \r\n                          BILL\r\n           Well... I have plenty of problems... the biggest of which right\r\n           now is jet-lag. So I think I'll pass for now, Bob.\r\n                         \r\n                          BOB\r\n           Fair enough...\r\n                         \r\n          BOB' OFFICE - MEETING ROOM - INTERIOR NIGHT\r\n                         \r\n          The end of the preceding scene fades in the beginning of this one.\r\n          We are now later in the same day. Night has come. The atmosphere\r\n          seems more relax. Buck is half lying on a sofa. Sondra is\r\n          finishing her story with a sweet voice, and does not simper\r\n          anymore.\r\n                         \r\n                          SONDRA\r\n           ...She's like a daughter to me... We hang out... Meaning that...\r\n           It's wonderful...\r\n                         \r\n                          BOB\r\n          He looks at this watch.\r\n           Well, that's all for tonight. I'll see you all next week...\r\n                          BUCK\r\n           Way to go.\r\n                         \r\n          Bob gets up very quickly. Everyone does like him, but more slowly.\r\n          Bob turns back before he leaves the room.\r\n                         \r\n                          BOB\r\n           Bill... I'll be with you in a couple of minutes.\r\n          Bill nods in agreement.\r\n                         \r\n                          SONDRA\r\n           Bye...\r\n                         \r\n                          BUCK\r\n           Coffee, anyone?\r\n                         \r\n                          BILL\r\n           Yeah.\r\n                         \r\n                          CLARK\r\n          He whispers.\r\n           Nine.\r\n                         \r\n          Bill remains seated and nods to the people getting out. Clark\r\n          remains, behind Bill, in front of the shelves. He puts something\r\n          back in a plastic bag and mumbles something we don't understand.\r\n          Bill turns toward him.\r\n                         \r\n                          CLARK\r\n           Have you read Bob's book ?\r\n                         \r\n                          BILL\r\n           No, I haven't.\r\n                         \r\n                          CLARK\r\n          He puts the bag in the pocket of this jacket, and takes a book on\r\n          a shelf. He gives it to Bill.\r\n           It's really... it's quite excellent.\r\n                         \r\n                          BILL\r\n           \"Way to go\"... I'm glad to hear you liked it.\r\n                         \r\n                          CLARK\r\n          He wipes his hand with a white handkerchief, wipes the handle of\r\n          his black leather case before taking it, and then puts the\r\n          handkerchief in the pocket of his pants.\r\n           Very much. Good night, Doctor Capa.\r\n                         \r\n                          BILL\r\n          Bill holds his hand out, but Clark does not take it. He just nods\r\n          in a friendly way and goes out.\r\n           Good night.\r\n          Alone, Bill flips through the books.\r\n                         \r\n          IN FRONT OF BOB'S OFFICE BUILDING - EXTERIOR NIGHT\r\n                         \r\n          Bill and Bob come out of the building where Bob's office is\r\n          located. Bob has his jacket on and Bob is wearing a brown leather\r\n          jacket. He is carrying his traveling bags.\r\n                          BILL\r\n           Alone at last !...\r\n                         \r\n                          BOB\r\n           Are you OK ?\r\n                         \r\n                          BILL\r\n           Well, nobody jumped out of the window. So maybe I am making\r\n           progress...\r\n                         \r\n          BOB'S CAR - EXTERIOR NIGHT\r\n                         \r\n          Bob's expensive convertible Mercedes starts away. On the back\r\n          license plate, we can read «WAY TO GO». The roof of the car is\r\n          open. The rest of the scene takes place inside the car driving\r\n          through Los Angeles.\r\n                         \r\n                          BOB\r\n           You want to get a drink ?\r\n                         \r\n                          BILL\r\n           Hu-hu !\r\n                         \r\n                          BOB\r\n           You want to get laid ?\r\n                         \r\n                          BILL\r\n          He laughs.\r\n           No !\r\n                         \r\n                          BOB\r\n           So what do you think of my little group ?\r\n                         \r\n                          BILL\r\n           What's Buck's story ?\r\n                         \r\n                          BOB\r\n           You mean, how did he loose his wife and kid. I don't know\r\n           yet. He's not talking yet... Either !\r\n                         \r\n                          BILL\r\n           How about Casey ?\r\n                         \r\n                          BOB\r\n           You tell me !\r\n                         \r\n                          BILL\r\n           Well... I smell money... Lots of it... Maybe an abusive father...\r\n           How am I doing so far ?\r\n                         \r\n                          BOB\r\n           A Plus !\r\n                         \r\n                          BILL\r\n           Daddy pays for the expensive loft downtown, and the very\r\n           expensive artistic life style, as long a junior stays in\r\n           therapy.\r\n                         \r\n                          BOB\r\n           You got the hair on the back of my neck standing up !\r\n                         \r\n                          BILL\r\n           Yes, I'm a psychic when it comes to masochists. Five'll get\r\n           you ten he likes to whack now and then.\r\n                         \r\n                          BOB\r\n           Where did you get that from ?\r\n                         \r\n                          BILL\r\n           I was born with it. Like a tuning fork.\r\n                         \r\n                          BOB\r\n           What about Richie ?\r\n                         \r\n                          BILL\r\n           Genuine nut-case.\r\n                         \r\n                          BOB\r\n           Dangerous ?\r\n                         \r\n                          BILL\r\n           Volatile ! Don't fuck with a trapped rat !\r\n                         \r\n                          BOB\r\n           Oh, I see. \"Trapped rat\" syndrome with a recommendation of\r\n           a \"Non fuck with\" therapy !\r\n          Bill laughs.\r\n           Well, can I quote you on that ?\r\n                         \r\n          They have reached a quieter road.\r\n                         \r\n                          BILL\r\n           Yes, you may. Takes notes, there'll be a pop-quiz later !...\r\n                         \r\n                          BOB\r\n           OK, I'm ready.\r\n                         \r\n          Bob turns on his left to enter his residence.\r\n                         \r\n                          BILL\r\n           All right, if I diagnose a schizophrenia, what do you\r\n           recommend ?\r\n                         \r\n                          BOB\r\n           Don't fuck with it !\r\n                         \r\n                          BILL\r\n           Now, you got it.\r\n                         \r\n          BOB'S RESIDENCE - EXTERIOR NIGHT\r\n                         \r\n          A huge sliding metallic door, with spikes on the top, moves\r\n          smoothly to let the car enter. Bill seems impressed by the\r\n          residence of his friend. He looks at the security camera. Bob\r\n          stops the car and they get out of it. Bill takes his luggage.\r\n                         \r\n                          BILL\r\n           It's all one place ?...\r\n          They come near a door shaped like a giant keyhole.\r\n           Goddamn...\r\n          A metallic gate slides behind the door to let them in.\r\n           Like peeking through a keyhole...\r\n          They get down a few steps and reach a lawn.\r\n           You get a very limited... view of the truth....\r\n                         \r\n                          BOB\r\n           What's that ?\r\n                         \r\n          Bill looks with admiration at the pool, and at the huge and\r\n          impressive house, very Hollywood-like.\r\n                         \r\n                          BILL\r\n           \"Way to go\" must have gone really well !\r\n                         \r\n                          BOB\r\n           Yeah !\r\n                         \r\n          BOB'S RESIDENCE - INTERIOR NIGHT\r\n                         \r\n          They enter the house. A beep is heard when Bob opens the door.\r\n                          BOB\r\n           After you, wise guy... Come on.\r\n          Bill laughs.\r\n                         \r\n                          BILL\r\n           Oh, men...\r\n          He laughs, looking at the luxury that surrounds him. The best and\r\n          the most expensive in modern furniture. Large expensive paintings\r\n          hanged on the walls. Leather armchairs. Bob types a secret code on\r\n          a keyboard. Then he switch on a small TV set that shows the\r\n          pictures from all the security cameras.\r\n           So, how are we as we approach forty ?\r\n                         \r\n                          BOB\r\n           We are in a good shape. Really good shape. We finally got\r\n           divorced. We have some money...\r\n          He puts back in place a painting that was slightly crooked.\r\n           ... We're meticulous.\r\n                         \r\n                          BILL\r\n          He takes off his jacket.\r\n           I don't detect a woman's touch.\r\n                         \r\n                          BOB\r\n           We have a little friend... You'll meet her.\r\n                         \r\n                          BILL\r\n           She's too young for you.\r\n                         \r\n                          BOB\r\n           Ohh !\r\n                         \r\n                          BILL\r\n          He sits behind the bar.\r\n           Always get the clichés and you won't be disappointed.\r\n                         \r\n                          BOB\r\n           This woman is not a cliché.\r\n          He has taken two bottle of beer from the fridge and he gives one\r\n          to Bill.\r\n                         \r\n                          BILL\r\n           Thanks...\r\n          They clink the two bottle and drink the beer from the bottle.\r\n           Good to see you, Bob !\r\n                         \r\n                          BOB\r\n           You too !... So...\r\n          Bill plays with a «piece of art», consisting of an assembly of\r\n          square pieces of glass glued together into a larger square. The\r\n          object can pivot on his stand and, when you look through it, you\r\n          get a distorted view of whatever is behind it.\r\n           You're ready yet ?\r\n                         \r\n                          BILL\r\n           Ready to what ?\r\n          We see the distorted face of Bill through the «piece of art», or\r\n          rather several distorted view of Bill's face seen through each of\r\n          the individual square of glass. Bob pivot the object to have a\r\n          better view of his friend.\r\n           So hard to talk about... So hard to talk about...\r\n          Bill pivot the object again to hide behind it.\r\n           I's just a game... dumb, deceitful game. So I quit my\r\n           practice.\r\n          He gets up.\r\n                         \r\n                          BOB\r\n           Lost you religion, huh ?\r\n                         \r\n                          BILL\r\n          He takes a big book on a shelf. There is a picture of Sigmund\r\n          Freud on the cover.\r\n           Well, I certainly lost my belief in the scriptures.\r\n          He puts the book back, and with his hand, makes a masturbation\r\n          gesture.\r\n                         \r\n                          BOB\r\n           I'm sorry, buddy. You gonna be in a lot of pain.\r\n                         \r\n                          BILL\r\n           There is a distinctive absence of pain. I... I cannot feel\r\n           the pain that I know that I'm supposed to be feeling right\r\n           now. And I think I'm going crazy...\r\n          We feel that Bill is ready to cry.\r\n           I'm lost, man, I think I'm going crazy.\r\n          He has tears in his eyes.\r\n                         \r\n                          BOB\r\n           You may be... Your mind may be shot...\r\n                         \r\n          COUNTRYSIDE - EXTERIOR DAY\r\n                         \r\n          In front of Bob's residence. The sun is shining. Bill is wearing a\r\n          brown tank top and white jogging pants. Bob is wearing a blue\r\n          cyclist shirt and black pants. They're both wearing caps. They are\r\n          ready to go cycling. We hear the voice over of Bob, finishing the\r\n          sentence from the preceding scene.\r\n                          BOB\r\n           ... but I hope your body isn't.\r\n                         \r\n                          BILL\r\n           Do I get to warm up ?\r\n                         \r\n                          BOB\r\n           Yeah !... Two mile any pace you like. And then...\r\n          They mount their bicycles.\r\n           ... let's do ten.\r\n                         \r\n          They are now on the road in front of Bob's residence.\r\n                         \r\n                          BILL\r\n           Ten ?\r\n                         \r\n                          BOB\r\n           Too much for you, huh ?\r\n                         \r\n                          BILL\r\n           I dunno... I was thinking of maybe twenty.\r\n          He starts full speed.\r\n           They are now on a minor dirt road. We can see Bob's house in the\r\n          background.\r\n                         \r\n                          BOB\r\n           Gees ! Billy ! You'll never change... Why don't we just drop\r\n           our pants to see who's got the bigger dick, and then we can\r\n           go back and have a nice civilized breakfast ?\r\n                         \r\n                          BILL\r\n           Wouldn't be civilized...\r\n                         \r\n                          BOB\r\n           Why ?\r\n                         \r\n                          BILL\r\n           You'll be sulking !\r\n                         \r\n                          BOB\r\n          They are going uphill.\r\n           You don't have hills in New-York...\r\n          He slows down.\r\n           Hang on a second... Hang on a second... Hang on a second...\r\n          Bob stops and dismounts his bike.\r\n                         \r\n                          BILL\r\n           What ?\r\n                         \r\n                          BOB\r\n           What was that ?... What the hell was that ?...\r\n                         \r\n          Bill dismounts his bike. Bob gets his bike upside down and sets it\r\n          upright standing on the saddle and the handlebar. He checks the\r\n          chain. Bill is leaning on his bike.\r\n                         \r\n                          BILL\r\n           What are you afraid of ?\r\n                          BOB\r\n           I got a gear slip, here somewhere...\r\n                         \r\n                          BILL\r\n           That's not what I meant... What with the security systems,\r\n           the security gates, looking over your shoulder.\r\n                         \r\n                          BOB\r\n           I've been getting some threats.\r\n                         \r\n                          BILL\r\n           What do you mean ?... Death threats ?\r\n                         \r\n                          BOB\r\n           Pretty sure it's somebody in the Monday night group, I just\r\n           don't know who...\r\n                         \r\n                          BILL\r\n           Monday night as in last night ?\r\n                         \r\n                          BOB\r\n           Yeah !... I was hoping that maybe with your tuning fork that\r\n           you might have a hunch.\r\n                         \r\n                          BILL\r\n           No... No hunch, Bob. What make you think it's somebody in the\r\n           group ?\r\n                         \r\n          Bob spins the pedals to check the chain.\r\n                         \r\n                          BOB\r\n           Only about a dozen things... I's been going on for a couple\r\n           of months now. It's funny how it gets you after a while.\r\n                         \r\n                          BILL\r\n           Call the cops ?...\r\n                         \r\n                          BOB\r\n          He puts his bike back on the wheels.\r\n           Yeah ! They say if they had to protect every shrink in\r\n           L.A., they'll need an army ! But that I should call them if\r\n           anything happened.\r\n                         \r\n          They put their sunglasses on.\r\n                         \r\n                          BILL\r\n          He laughs.\r\n           That makes sense.\r\n                         \r\n                          BOB\r\n           Yeah ! Probably, it'll just blow over.\r\n                         \r\n                          BILL\r\n           Yeah !\r\n                         \r\n                          BOB\r\n           How about you ?\r\n                         \r\n                          BILL\r\n           About me... what ?\r\n          We see them going very fast on the minor dirt road. A horse rider\r\n          rides near them.\r\n           What would you give a suicidal patient that's got\r\n           everything ?\r\n          They ride even faster while clowning, like riding on the back\r\n          wheel.\r\n                         \r\n                          BOB\r\n           Parachute, I heard it already.\r\n                         \r\n                          BILL\r\n           Out here already, huh ?\r\n                         \r\n                          BOB\r\n           Come on, old timer !...\r\n                         \r\n          BOB'S RESIDENCE - EXTERIOR DAY\r\n                         \r\n          The heavy metal door is sliding away. Bob and Bill are getting in.\r\n          They dismount their bikes with some difficulty. They drop their\r\n          bikes on the ground.\r\n                          BILL\r\n           Oh, shit ! You may have to... You may have to carry me in.\r\n                         \r\n          They hold each other by the waist and the shoulders.\r\n                         \r\n                          BOB\r\n           You know you lose a lot more gracefully than you used to...\r\n                         \r\n                          BILL\r\n           Yeah ! Well, you know... Practice and all... Hey ! How about\r\n           that : \"Learning to loose\" by Doctor Bill Capa !\r\n                         \r\n          A beep and the second gate gets open.\r\n                         \r\n                          BOB\r\n           Got a ring to it !\r\n                         \r\n                          BILL\r\n           They are making those seats smaller, huh ? Whoo !\r\n                         \r\n          They enter the residence. Bill is massaging his buttocks.\r\n                         \r\n          BOB'S OFFICE - BOB'S WORKROOM - INTERIOR NIGHT\r\n                         \r\n          Short low angle shot of the whole building, before entering Bob's\r\n          workroom. Bob's desk is decorated with two wrought iron eagles.\r\n          Bob is wearing jacket and necktie. He is just finishing a session\r\n          with a patient.\r\n                         \r\n                          BOB\r\n           See you next week. All right ?\r\n                         \r\n          He escorts his patient to the door. Enter Barbara, Bob's\r\n          secretary.\r\n                         \r\n                          BARBARA\r\n           I'm going now. You want me to lock on the way out ?\r\n                          BOB\r\n           That'll be great, Barbara.\r\n                         \r\n          She gets out. Bob takes his jacket off and sets it on a clothes\r\n          valet. He then stops by the shelves behind his desk and starts the\r\n          music : a concerto for piano and orchestra. He sits behind his\r\n          desk, and starts writing in a large notebook. He hears a strange\r\n          noise, and raises his head. He puts his pen down, open a drawer\r\n          and takes his revolver out. A draught flips the pages of his\r\n          notebook. He seems to feel better, puts the revolver back and\r\n          closes the drawer. Then he closes the notebook, takes it and goes\r\n          to the shelves. He seems to be looking for something, and feels\r\n          worried not to find it. He gets out of his workroom.\r\n                         \r\n          BOB'S OFFICE - MEETING ROOM - INTERIOR NIGHT\r\n                         \r\n          He enters the meeting room and goes directly to the shelves. He\r\n          looks around and takes an art book about Van Gogh. He checks that\r\n          the size of the art book and the size of his notebook are similar.\r\n          He takes off the dustcover of the art book and puts it on his\r\n          notebook, puts his notebook on the shelf where the art book was\r\n          and puts the art book in the bottom of the shelves. A shadow moves\r\n          on the shelves and a strange noise is heard. Bob, a bit nervous,\r\n          goes to the door and opens it. The classical music stops. Through\r\n          the open door, we can see Bob opening the door of his workroom.\r\n                         \r\n                          BOB\r\n           Barbara ?...\r\n                         \r\n          He comes back into the meeting room. When he enters the room, the\r\n          light is suddenly switched off. He crosses the meeting room. We\r\n          can hear someone chuckling, and we can see a shadow through the\r\n          glass on the door.\r\n                         \r\n          BOB'S OFFICE - CORRIDOR - INTERIOR NIGHT\r\n                         \r\n          Bobs gets rapidly out of the meeting room. A man, completely\r\n          covered in black leather, jumps through a large ground glass\r\n          paneI, and jumps on Bob's back. Short fight on the floor. Bob gets\r\n          up, bumps into the drinking fountain which falls on the floor, and\r\n          falls down.\r\n           Close-up of the mysterious man's hand. It is covered with a\r\n          glove. The hand closes itself and a long blade appears on the top\r\n          of the hand. Bob gets up and is stabbed in the chest. He staggers\r\n          a bit, takes a blue vase on a table and tries to hit the head of\r\n          the mysterious man. He misses and the vase crashes on the wall. He\r\n          is stabbed again in the chest. His staggering increases. He turns\r\n          around and the man stabs him several time in the back. He stumbles\r\n          to the front door. Another stab in the back. The man grabs him by\r\n          his hair to bring him back into the workroom.\r\n                         \r\n                          BOB\r\n           No... Nooooo !... Why ?\r\n                         \r\n          The man stabs him several times. Bob is covered with blood. He\r\n          falls on a glass door. The glass is shattered. Bob falls on his\r\n          back. A big piece of glass goes through him and comes out of his\r\n          stomach. Through the window, we can see an helicopter flying over\r\n          Los Angeles.\r\n          MAIN POLICE STATION - EXTERIOR NIGHT\r\n                         \r\n          A car has just stopped in front of the building. The blue\r\n          revolving light keeps on moving on top of the car. An helicopter\r\n          is flying above the building. It could be the same that is seen at\r\n          the end of the preceding scene. Officer Anderson goes around the\r\n          car and opens the door for Bill. Bill is wearing a T-shirt, a\r\n          light sweater and jeans. One can tell he had to dress quickly.\r\n          Bills gets out of the car, and the car moves away. Anderson takes\r\n          Bill into the building.\r\n                         \r\n          MAIN POLICE STATION - INTERIOR NIGHT\r\n                         \r\n          Classical setup of a californian police station. The various rooms\r\n          are separated with glass partitions. An officer enters pushing, in\r\n          front of him, a hooker dressed with a minimum of very flashy\r\n          clothes.\r\n                         \r\n           VOICE OF A POLICE WOMAN\r\n           Have you thought about...\r\n                          THE HOOKER\r\n           Man, I didn't do nothing. Oh, please... You know, you're very\r\n           cute. I love you.\r\n                         \r\n           THE POLICE OFFICER\r\n           I love you too !\r\n                         \r\n          Anderson leads Bill into a room and leaves him there. Bill sits\r\n          down. Enters lieutenant Hector Martinez. He is wearing a pink\r\n          shirt with short sleeves. His tie is badly knotted on an open\r\n          collar. He has a police badge fixed on his belt. He holds a file\r\n          in his hand.\r\n                         \r\n                          HECTOR\r\n           You're Capa ?\r\n                         \r\n                          BILL\r\n           Yes, I'm Doctor Capa.\r\n                         \r\n                          HECTOR\r\n          He closes the door, puts his file on the desk and sits down behind\r\n          the desk.\r\n           You're here because of the dead doctor ?\r\n                         \r\n                          BILL\r\n           Yes...\r\n                         \r\n                          HECTOR\r\n           I read something about sessions on Mondays. Tell me about\r\n           this Monday group.\r\n                         \r\n                          BILL\r\n           There's five patients in the group. I Can't really remember\r\n           their names right now.\r\n                         \r\n                          HECTOR\r\n          He taps his head with his right hand, a gesture meaning mental\r\n          illness. He has a telephone number scribbled on the palm of his\r\n          hand.\r\n           Like five cuckoos.\r\n                         \r\n                          BILL\r\n           No. Four neurotics of varying degrees and one killer. At\r\n           least, that's what Bob thought.\r\n                         \r\n                          HECTOR\r\n           Bob Moore ?\r\n                         \r\n                          BILL\r\n           Good. Yes, Bob Moore.\r\n                         \r\n                          HECTOR\r\n           Four men and one woman.\r\n                         \r\n                          BILL\r\n           Right.\r\n                         \r\n                          HECTOR\r\n           And you sat in one of these sessions, right ?\r\n                          BILL\r\n           Yes, I did.\r\n                         \r\n                          HECTOR\r\n           So, who did it ?\r\n          Anderson enters the room behind Bill, carrying a plastic cup.\r\n           Hey-hey-hey-hey... ! Anderson ! This is civilization, man.\r\n           What do think this is ?... Your bedroom ?...\r\n          Anderson gives Bill the cup.\r\n           Damn... Knock... Knock... Don't... don't come into my office like\r\n           that, bro. Hey !\r\n          Anderson leaves the room and closes the door.\r\n           It's third world thing !... Where were we ?...\r\n                         \r\n                          BILL\r\n          He blows on the cup.\r\n           You were probing me about the patients. And I was about to\r\n           tell you that I really can't help you at all. I don't\r\n           really know any of these people.\r\n                         \r\n                          HECTOR\r\n           But you're a professional like me. You gotta have some kind\r\n           of suspicion.\r\n                         \r\n                          BILL\r\n           I really don't have a clue. I'd like to help you, but even\r\n           if I could, there is an issue of confidentiality.\r\n                         \r\n                          HECTOR\r\n           Confidentiality ?...\r\n                         \r\n                          BILL\r\n           Yes.\r\n                         \r\n                          HECTOR\r\n          He laughs and gets up.\r\n           You're talking to me about an issue of confidentiality.\r\n                          BILL\r\n           Similar to the Miranda oath.\r\n                         \r\n                          HECTOR\r\n          He sits down on the desk, facing Bill.\r\n           If a friend of mine got killed, and the only thing between\r\n           the killer and me was Miranda, you know what I will do ?...\r\n           Huh ?... Fuck Miranda up the ass. But don't tell anybody,\r\n           because it's a matter of confidentiality... Shhh !...\r\n                         \r\n          He puts a finger on his lips.\r\n                         \r\n                          BILL\r\n           Oh, look ! I'm sorry I can't help you. I've only been in\r\n           Los Angeles four days.\r\n                         \r\n                          HECTOR\r\n           You're sleeping at that... dead guy's house, aren't you ?\r\n                         \r\n                          BILL\r\n           Yes.\r\n                          HECTOR\r\n           Maybe something will come to you in the night, you know,\r\n           like dreams and shit. But... what happens to patients in a\r\n           situation like this ?\r\n                         \r\n                          BILL\r\n           Usually a colleague will offer to take over the group...\r\n           continue the treatment.\r\n                         \r\n                          HECTOR\r\n          He gets up. We see his pistol hooked on the back of his belt.\r\n           How sweet !... How sweet !... It's like one of the vultures\r\n           dies and then the others step in line and eat his portion.\r\n          He mimes vultures walking.\r\n           Is that what you're planning ?\r\n                         \r\n                          BILL\r\n           No.\r\n                         \r\n                          HECTOR\r\n           Why not ?\r\n                         \r\n                          BILL\r\n           Because I really can't handle that right now.\r\n                         \r\n                          HECTOR\r\n           Sure you can !... Come on !... You've been a week in L.A. and\r\n           you already have you own private screwing farm.\r\n          He sits back on the edge of the desk.\r\n           How bad can that be ?... That's a great career move.... Where\r\n           were you at the time of the killing, Capa ?\r\n                         \r\n                          BILL\r\n          He pauses before answering.\r\n           I was at his house, Bob's house.\r\n                         \r\n                          HECTOR\r\n           You had to think about that ?\r\n                          BILL\r\n           Jesus Christ !... Are you going to arrest me, Lieutenant\r\n           Martinez ?\r\n                         \r\n                          HECTOR\r\n           Hey ! You want a lawyer ?\r\n                         \r\n                          BILL\r\n           Do I need a lawyer ?\r\n                         \r\n                          HECTOR\r\n           You're in L.A. Everybody needs a lawyer.\r\n          He goes back to his seat behind the desk, and conspicuously shows\r\n          his back to Bill.\r\n           All right !... You can go home now, take a shower.\r\n          He turns back to Bill.\r\n           And keep your mouth shut. The only thing that I got going\r\n           for me is that few people know what happened, and I don't\r\n           want the press fucking things up.\r\n                         \r\n          BOB'S RESIDENCE - INTERIOR NIGHT\r\n          Bill plays with the «piece of art» made of pieces of glass. He\r\n          pivots it. We can see Bill's face duplicated by the object. We\r\n          then see Bill putting back in place the same crooked painting that\r\n          Bob had been putting back in place the first time Bill was in the\r\n          house. Then we see him walking pensively around the house.\r\n                         \r\n          BOB'S RESIDENCE - INTERIOR DAY\r\n                         \r\n          A corridor. We hear the buzz of an intercom. Bill comes out of the\r\n          bathroom, dressed in a white bathrobe. He is drying his hair with\r\n          a towel.\r\n                         \r\n                          BILL\r\n           All right !... All right !... Hold on !\r\n                         \r\n          He walks in the corridor, looking for the buzzer. He arrives into\r\n          the main hall, near the video security device. On the wall near\r\n          the TV set, two large paintings showing enlarged footprints. On\r\n          the screen, we see Hector's face.\r\n                         \r\n                          BILL\r\n           Oh shit !\r\n                         \r\n          BOB'S RESIDENCE - MAIN GATE - EXTERIOR DAY\r\n                         \r\n          Hector is waiting in front of the gate. He is wearing a grey\r\n          shirt, a beige blazer and a necktie, and a police badge on his\r\n          belt. Next to him is Bob's car. Behind him, a uniformed police\r\n          officer. Hector presses the bell. We hear a beep.\r\n                         \r\n          BOB'S RESIDENCE - HALL - INTERIOR DAY\r\n                         \r\n          We see and hear Hector via the TV set.\r\n                         \r\n                          HECTOR\r\n           Capa !... Capa !... Are you there ?\r\n          Bill takes the remote control.\r\n                         \r\n                          BILL\r\n           Yeah...\r\n                         \r\n                          HECTOR\r\n           How is it going ?\r\n                         \r\n          BOB'S RESIDENCE - MAIN GATE - EXTERIOR DAY\r\n                         \r\n          We hear Bill's voice in the intercom.\r\n                         \r\n                          BILL\r\n           What do you want ?\r\n                         \r\n                          HECTOR\r\n           I brought the victim's car back and I got to search the\r\n           house.\r\n                         \r\n          BOB'S RESIDENCE - HALL - INTERIOR DAY\r\n                         \r\n                          BILL\r\n           You got a search warrant ?\r\n                         \r\n          BOB'S RESIDENCE - MAIN GATE - EXTERIOR DAY\r\n                         \r\n                          HECTOR\r\n           What is it with you ? Don't you want me to find out who\r\n           killed your friend ?... No, I don't have a warrant.\r\n                         \r\n          BOB'S RESIDENCE - HALL - INTERIOR DAY\r\n                         \r\n                          BILL\r\n           All right... Come on in...\r\n                         \r\n                          HECTOR\r\n           Open the gate.\r\n                         \r\n                          BILL\r\n           Yeah... Right... How's that ?\r\n                         \r\n          BOB'S RESIDENCE - MAIN GATE - EXTERIOR DAY\r\n                         \r\n          Hector waits a little, then gets sprayed by a sprinkler located\r\n          outside the screen-field.\r\n                         \r\n                          HECTOR\r\n           You got the sprinklers on !\r\n                         \r\n          BOB'S RESIDENCE - HALL - INTERIOR DAY\r\n                         \r\n          We hears the end of Hector's sentence.\r\n                         \r\n                          BILL\r\n           How about that ?\r\n                         \r\n          Bill taps on the remote control. We hear a beep. On the TV set, we\r\n          see Hector taking his jacket off.\r\n                         \r\n          BOB'S RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n          Hector is searching the shelves on the wall. He quickly looks\r\n          through the books, takes a step back, then thrusts his hand behind\r\n          a row of books, and grabs a photo album. While flipping through\r\n          the pages, he goes to the sofa and sits next to Bill. Bill is\r\n          wearing a white shirt and a pair of jeans. Hector goes on turning\r\n          the pages, and stop on a page with the picture of supine naked\r\n          woman.\r\n                         \r\n                          BILL\r\n           Jill... his wife... his ex-wife...\r\n                         \r\n                          HECTOR\r\n           Nice bush !\r\n                         \r\n          Bill closes the album, takes it from Hector's hands and gets up.\r\n          He turns to look at Hector.\r\n                         \r\n                          BILL\r\n           I'll tell you said so...\r\n          He walks to the shelves and put the album back where it was found.\r\n          He looks at Hector.\r\n           I'm sure it will mean a lot to her...\r\n                         \r\n          BOB'S RESIDENCE - BEDROOM - INTERIOR DAY\r\n                         \r\n          Close-up of the head of the bed. It is decorated with wooden\r\n          sculpture of women's faces. Hector enters the room, followed by\r\n          Bill. He goes to the bed and strokes the sculptures.\r\n                         \r\n                          HECTOR\r\n           Check this fucking bed !\r\n          He goes around the bed and sits next to the sculpture, which he\r\n          keeps on fondling.\r\n           Damn !... Everybody is having fun but me, goddammit !\r\n          Hector opens a drawer, and takes a revolver out of it. He holds it\r\n          with his pen stuck into the trigger ring.\r\n                         \r\n                          BILL\r\n           I do not like guns.\r\n                         \r\n          Hector puts the revolver back in the drawer.\r\n                         \r\n                          HECTOR\r\n           You prefer knives ?\r\n                         \r\n          BOB'S RESIDENCE - EXTERIOR DAY\r\n                         \r\n          Bill and Hector are getting out of the house.\r\n                         \r\n                          HECTOR\r\n           I need you to do me a favor.\r\n                         \r\n                          BILL\r\n           What's that ?\r\n                         \r\n          They are crossing the garden. Hector is still in shirtsleeves and\r\n          has some papers in his hand.\r\n                         \r\n                          HECTOR\r\n           I want you to tell the group about Moore's death.\r\n                         \r\n                          BILL\r\n           Me ?...\r\n                         \r\n                          HECTOR\r\n           Yes.\r\n                         \r\n                          BILL\r\n           Why ?\r\n                         \r\n                          HECTOR\r\n           Well, maybe one of them won't come in, or maybe they will\r\n           all come in, but then you would be able to spot something\r\n           wrong.\r\n                         \r\n                          BILL\r\n           I just can't handle it right now... OK ?...\r\n                         \r\n                          HECTOR\r\n           I just had all the mess in his office cleaned up. Don't you\r\n           want to help me find the killer ? Have a heart.\r\n                          BILL\r\n           What does that mean?\r\n                         \r\n                          HECTOR\r\n           If you don't tell them, I'll have to tell them. Am I the\r\n           person to break the news to these people ? « Listen up, you\r\n           fucking daffodils, your shrink is dead.\r\n          They have reached the main gate. Hector gets out and Bill presses\r\n          a switch. The gate starts sliding between him and Hector.\r\n           Which means that all the time, effort and love you put in\r\n           this relationship is wasted. You've got to remain as fucked\r\n           up as you are or get worse. »\r\n                         \r\n                          BILL\r\n           You are one sinister piece of work. All right, I'll do it.\r\n                         \r\n                          HECTOR\r\n           It's better if you do it.\r\n                         \r\n          A ROAD - EXTERIOR DAY\r\n                         \r\n          We are in Bob's car, with the roof open. Bill is wearing a green\r\n          polo shirt, jeans and sunglasses. He is on the phone, while he\r\n          drives the car, but he drives slowly.\r\n                         \r\n                          BILL\r\n           No, you listen to me. You don't understand, Gene. Don't\r\n           lie, just give the family what it wants... No... No, you don't\r\n           understand.\r\n          We see Bill from the back. In the rear-view mirror of the car, we\r\n          see another convertible vehicle approaching with also its roof\r\n          open. A young girl is driving. She comes a bit too fast and bumps\r\n          into the back of Bill's car. Bill jumps and stops his car.\r\n           I have to call you back. Christ !\r\n          He puts the telephone back on his hook and gets out of the car. He\r\n          goes to Rose's car. She is leaning on the steering wheel.\r\n           Hey !... You're right ?... Hey !...\r\n          He opens the door. She stands back. She is wearing a large beige\r\n          sweater.\r\n                         \r\n                          ROSE\r\n           Why me ?... Hi !... I'm Rose.\r\n                         \r\n                          BILL\r\n           Hi, Rose !... I't nice to run into me like this !... I'm Bill\r\n           Capa...\r\n                         \r\n          He goes away from the car.\r\n                         \r\n                          ROSE\r\n           I got no insurance...\r\n          She gets out of her car.\r\n           I know it's against the law and everything.\r\n          She goes around her car, and looks at the damage.\r\n           Don't bust my chops. I'll bring the money to you, if you\r\n           just get an estimate.\r\n          She stoops, picks up a piece of red plastic and gives it to Bill.\r\n           OK ?... Just give me a break !\r\n                          BILL\r\n           Got a pen ?\r\n                         \r\n          Rose goes to her car and Bill throws the piece of red plastic\r\n          away. Rose gets into her car, looks into her purse, and takes a\r\n          small notebook and a pen. Bill takes them but hesitates before\r\n          writing. Rose smiles mockingly.\r\n                         \r\n                          ROSE\r\n           Oh, poor old brain can't remember its own phone number.\r\n                         \r\n                          BILL\r\n           I just moved here... From New York... I wrote my address down,\r\n           because I am not sure about this number, and how long I\r\n           gonna be there, so maybe you can call me sometimes for the\r\n           next couple of days.\r\n                         \r\n                          ROSE\r\n           I will.\r\n                         \r\n                          BILL\r\n           Bye !\r\n                         \r\n          He goes away from the car.\r\n                         \r\n                          ROSE\r\n           Hey !... Don't you want my address ?\r\n                         \r\n          Bill gets into his car.\r\n                         \r\n                          BILL\r\n           You could lie.\r\n                         \r\n          He starts his car.\r\n                         \r\n          BOB'S OFFICE - WORKROOM - INTERIOR NIGHT\r\n                         \r\n          Bill skip through the pages of a large notebook, looking exactly\r\n          like the one Bob had hidden under a Van Gogh dustcover just before\r\n          he got killed. He puts his back on the two other ones, already\r\n          lying on the desk. He is wearing a grey T-shirt and an open denim\r\n          shirt.\r\n                         \r\n          BOB'S OFFICE - MEETING ROOM - INTERIOR NIGHT\r\n                         \r\n          Bill enters the room, coming from the workroom.\r\n                         \r\n                          BILL\r\n           Hi !... Who hasn't arrived yet ?\r\n                         \r\n                          BUCK\r\n          He is standing up. He is wearing a white T-shirt and a grey\r\n          sweater with a V-shaped collar.\r\n           Sondra... Where's Bob ?\r\n                         \r\n                          RICHIE\r\n          He is wearing a grey sport jacket with a zipper and a striped T-\r\n          shirt.\r\n           Wha... What's wrong ?\r\n                          BILL\r\n           If it's all right, I'd rather wait till you're all here.\r\n           She's always this late ?\r\n                         \r\n                          CLARK\r\n          He is wearing a dark suit, very elegant. He is wiping his hand\r\n          with a handkerchief.\r\n           Depends on who is banging her...\r\n                         \r\n                          SONDRA\r\n          She enters very rapidly through the corridor door. She seems very\r\n          happy. She drops on the armchair next to Casey. She is wearing an\r\n          very close-fitting overall, which is generously open on her\r\n          throat. The top of the overall is very colorful and the bottom is\r\n          black. On top of it, she is wearing a pink sport jacket.\r\n           Oh, I'm sorry... Class was really, really really late.\r\n                         \r\n                          CASEY\r\n          He is sitting in an armchair. He is wearing an grey collarless\r\n          shirt and a black sleeveless vest.\r\n           Was class was that, Sondra ? Advanced cunnilingus for the\r\n           single woman, or a CPR for pleasure and game ?\r\n                         \r\n                          BUCK\r\n           Christ, don't excite her !...\r\n                         \r\n                          SONDRA\r\n           Where is Doctor Moore ?\r\n                         \r\n                          BILL\r\n           There's something I want to tell you.\r\n                         \r\n                          RICHIE & CASEY\r\n           What ?\r\n                         \r\n                          SONDRA\r\n           What's the matter ?\r\n                          CASEY\r\n           Shhhh !...\r\n                         \r\n                          SONDRA\r\n           I'm trying to pay attention... Shhh !\r\n                         \r\n                          BILL\r\n           You should prepare yourself for bad news...\r\n                         \r\n                          SONDRA\r\n           Why ?...\r\n                         \r\n                          BILL\r\n           Bob's been killed.\r\n                         \r\n                          SONDRA\r\n          Her face is distorted by the pain. She puts her hand in front of\r\n          her mouth.\r\n           Ohhhh !\r\n                         \r\n                          CASEY\r\n           What are you saying ?... What are you telling me ?\r\n                          BILL\r\n           He was murdered.\r\n                         \r\n                          CASEY\r\n           Sondra !...\r\n                         \r\n                          BILL\r\n           He was locking up here late Friday night.\r\n                         \r\n                          SONDRA\r\n           Here ?...\r\n                         \r\n                          BILL\r\n           Yes, right here in the office.\r\n                         \r\n                          BUCK\r\n           Was he shot... stabbed... beaten ?... Have they got a suspect... a\r\n           motive ? Three days go by, and you don't call us.\r\n                         \r\n                          BILL\r\n           It was easier if you were here together.\r\n                         \r\n                          CASEY\r\n          He stands up.\r\n           Oh, I see. So, even Bob's death is group therapy. That's\r\n           great. Hey, Bob, thanks for giving us a chance to grieve\r\n           together. Shit !...\r\n          He gets more and more angry through the preceding reply.\r\n                         \r\n                          BUCK\r\n          He has become very nervous too.\r\n           What the fuck is going on here ? I need to know more.\r\n                         \r\n                          BILL\r\n           He was stabbed to death.\r\n                         \r\n                          CLARK\r\n           How many times was he stabbed ?\r\n                         \r\n                          SONDRA\r\n          She jumps up. She goes to Clark and hits him.\r\n           This man was Bob's best friend. Do you really needed exact\r\n           numbers now ?\r\n                         \r\n                          BILL\r\n          He takes Sondra very gently by the shoulders and brings her back\r\n          to her seat.\r\n           Sondra... Sondra... Sondra... Sondra...\r\n                         \r\n                          SONDRA\r\n           Get your fucking hands off me...\r\n                         \r\n                          BILL\r\n           It's OK... It's OK !\r\n                         \r\n                          CASEY\r\n           It doesn't make sense to me...\r\n                         \r\n                          BILL\r\n           Many times, Clark... More than thirty... It's all I can tell\r\n           you...\r\n                         \r\n                          CASEY\r\n           It wasn't a thief, I can tell you that right now.\r\n                         \r\n                          CLARK\r\n           I agree.\r\n                         \r\n                          CASEY\r\n          He is still very nervous.\r\n           I mean, why stab a guy thirty times ?... Bob !... He'd piss in\r\n           his pants if you showed him a knife, you know that...\r\n                         \r\n                          SONDRA\r\n          She is crying.\r\n           What are you saying ?\r\n                         \r\n                          CASEY\r\n           I'm saying, Sondra, that you really, really have to hate a\r\n           person to stab him that many times. You're a shrink,\r\n           right ? You know what kind of power people hand over a\r\n           shrink. Or maybe sometimes, they hand even more than they\r\n           want to.\r\n                         \r\n                          CLARK\r\n           That is absolutely correct... A thief would not stick around\r\n           and stab someone thirty times.\r\n                         \r\n                          BUCK\r\n          He sits down.\r\n           Since when did you become such an expert on robbery ?\r\n                         \r\n                          SONDRA\r\n           It's not the robbery he's an expert on, it's the rage.\r\n                         \r\n                          RICHIE\r\n          He has seated himself behind Sondra and puts his hand on her\r\n          shoulder.\r\n           What... what are we gonna do now ? I mean u...us, th...the\r\n           group ?\r\n                         \r\n                          CASEY\r\n           I bet Doctor Capa has an idea...\r\n                         \r\n                          BUCK\r\n           What does he mean ?\r\n                         \r\n          Casey hits his forehead. Buck is almost crying.\r\n                         \r\n                          BILL\r\n          He sits down.\r\n           I think Casey is suggesting that I... may have some plans to\r\n           replace Bob...\r\n          Casey sits down.\r\n                         \r\n                          SONDRA\r\n           Maybe you should.\r\n                         \r\n                          BILL\r\n           No... I can't do that... Not right now...\r\n                         \r\n                          SONDRA\r\n           Why ?...\r\n                         \r\n                          BILL\r\n           One reason is that I am more screwed up than you people\r\n           are.\r\n                         \r\n                          CASEY\r\n           I was just being obnoxious, and loud before. Anybody has a\r\n           fucking Xanax ?\r\n                         \r\n                          SONDRA\r\n           I have a librium...\r\n                         \r\n                          BUCK\r\n           Stop with the drugs.\r\n                         \r\n                          CASEY\r\n           It would be a good idea if you stayed.\r\n                         \r\n                          BUCK\r\n           Bob isn't cold yet ?\r\n                         \r\n                          CASEY\r\n           I mean, there'll be some connections. Right ?...\r\n                         \r\n                          SONDRA\r\n          She gets up and sits down in front of Bill. She takes the cushion\r\n          which was on the armchair and hugs it.\r\n           You were Bob's best friend... You... you seem kind of like him...\r\n           I'll be so much easier to trust you.\r\n                         \r\n                          BILL\r\n          During the following reply, Richie comes and sits behind Sondra.\r\n           I know what kind of force a group can become in your life...\r\n           You tell things here... intimate things that... you wouldn't\r\n           tell your best friend. I'm very flattered that you would...\r\n          He stops. He seems ready to cry.\r\n           But the truth is : You are the people that make this work.\r\n           I would be more than happy to try to find someone for you\r\n           to continue this, but I cannot help you.\r\n                         \r\n                          CLARK\r\n           If my opinion counts for anything, I would like to ask :\r\n           why it is you feel so inadequate for the task.\r\n                         \r\n          Buck comes and sits next to Clark.\r\n                         \r\n                          BUCK\r\n           Maybe he just don't like us.\r\n                         \r\n                          BILL\r\n           No, that's not it, Buck.\r\n                         \r\n                          BUCK\r\n           Why don't you step on something?\r\n                         \r\n                          CLARK\r\n           You stop.\r\n                         \r\n                          BILL\r\n           Six weeks ago, I spoke harshly to a patient. And she\r\n           committed suicide... Right in front of me.\r\n          Clark puts his handkerchief on his lips.\r\n           Perhaps she would have done this, anyway. That's what my\r\n           colleagues say... But I don't know...\r\n                         \r\n                          SONDRA\r\n           Oh, I'm sorry.\r\n                         \r\n                          BILL\r\n          He is crying with big tears.\r\n           And my patient... Her name was Michelle... She jumped out... of a\r\n           window in my office... Ohh... So much blood... And so red... And in\r\n           right time, before my eyes... the red just disappeared... it's\r\n           turned to grey... So I don't see... red now... Then I failed... so\r\n           I can't help you... I don't think that you want someone like\r\n           me around right now...\r\n                         \r\n          Clark wipes his face again with his handkerchief. He seems to be\r\n          extremely moved.\r\n                         \r\n                          BUCK\r\n           I think I do.\r\n                         \r\n                          RICHIE\r\n           M... me too.\r\n                         \r\n                          CASEY\r\n           Why don't you give us a try for a month.\r\n                         \r\n                          CLARK\r\n           Listen, if you need anything, any free legal advice, to\r\n           help you wrap up Bob's affair, please don't hesitate to\r\n           call me. I'm not with anyone right now. I'll be more than\r\n           happy to help you in anyway.\r\n          Clark gives his business card to Bill, who takes it. Then he gives\r\n          him a kleenex. Bill wipes his eyes.\r\n                         \r\n                          BILL\r\n           Thank you.\r\n                         \r\n          We see, through the window, light-beams crossing in the sky.\r\n                         \r\n          THE WHISKY BAR - EXTERIOR NIGHT\r\n                         \r\n          Usual atmosphere of a well-known bar. At a short distance from the\r\n          entrance of the bar, a truck with two floodlights, the beams of\r\n          which are sweeping the sky. Those beams make the connection with\r\n          the preceding scene.\r\n                         \r\n          THE WHISKY BAR - INTERIOR NIGHT\r\n                         \r\n          Quick shot on the very noisy orchestra. A long hair bearded guy is\r\n          playing the drums, a girl is playing the guitar. Bill, dressed\r\n          exactly like in the preceding scene, is looking for someone.\r\n          Eventually he founds him, Hector, who is already seated. Bill sits\r\n          down at Hector's table. Hector is wearing an open dark pink shirt.\r\n                          HECTOR\r\n           You bring me a confession ?\r\n                         \r\n                          BILL\r\n           No.\r\n                         \r\n                          HECTOR\r\n           Well, you win some, you lose some, right Capa ?\r\n                         \r\n                          BILL\r\n           Listen, maybe it was not one of the group\r\n                         \r\n                          HECTOR\r\n           Oh no... he's beginning to like them already. Your friend Bob\r\n           Moore deserves a lot more loyalty than this.\r\n                         \r\n                          BILL\r\n           Hey... Why... Why are we staying here shouting at each other\r\n           for ? What's this place ?\r\n                         \r\n                          HECTOR\r\n           I used to work in narcotics. They used to come here a lot.\r\n           I probably fucked and, or arrested half of these people's\r\n           parents. It's a nice place. I like it.\r\n                         \r\n                          BILL\r\n           Makes sense. Look, I'm sorry I haven't got anything for\r\n           you. I'll see you around.\r\n                         \r\n          Bill gets up and leaves the bar. Hector gets up behind him and\r\n          follows him. They meet back in the street.\r\n                         \r\n          THE WHISKY BAR - EXTERIOR NIGHT\r\n                         \r\n                          HECTOR\r\n           So, that's it, hey ?\r\n                          BILL\r\n           Yeah.\r\n                         \r\n                          HECTOR\r\n           Anything you want to tell me ?...\r\n                         \r\n          They put back their jackets.\r\n                         \r\n                          BILL\r\n                          NO\r\n                         \r\n           VOICE OF THE CAR VALET\r\n           Yeah, it's a four-door, man !\r\n                         \r\n          Hector and Bill are walking slowly in front of the bar.\r\n                         \r\n                          HECTOR\r\n           So you better shut the group down.\r\n                         \r\n                          BILL\r\n           Who say I hadn't ?\r\n                          HECTOR\r\n           Oh, have you or haven't you ?\r\n                         \r\n                          BILL\r\n           They ask me to take over the group. I couldn't say no.\r\n                         \r\n                          HECTOR\r\n           Ha ! Ha !... I figured... You're gonna do real well in this\r\n           town. Shut the fucker down.\r\n                         \r\n                          BILL\r\n           Stop. You sent me over there.\r\n                         \r\n                          HECTOR\r\n           No, I send you there to convey a piece of bad news...\r\n          A pedestrian bumps into Hector.\r\n           Will you give me a break, will you, man !...\r\n          Hector lays the man on the hood of a car and frisks him.\r\n           I didn't send you there to go trolling for business.\r\n                         \r\n                          BILL\r\n           Come on !\r\n                         \r\n          Hector lets the man go and starts walking again with Bill near the\r\n          bar.\r\n                         \r\n                          HECTOR\r\n           You told me you couldn't handle it.\r\n                         \r\n                          BILL\r\n           Well, it turns out that I handle it now.\r\n                         \r\n                          HECTOR\r\n           You stick you dick in a barrel full of barracudas once.\r\n           Maybe you won't lose it. You leave it in there, it's gonna\r\n           get shewed up at the root.\r\n                         \r\n          They stop walking.\r\n                          BILL\r\n           I appreciate your concern for my dick, Hector, thank you.\r\n                         \r\n                          HECTOR\r\n           I am being really nice, full of concern for your safety, in\r\n           case it's one of them, hey ? Shut it down, OK ?...\r\n                         \r\n                          BILL\r\n           No... I can't do that.\r\n                         \r\n                          HECTOR\r\n          He yells.\r\n           Shut it down, chingada ! Don't be an asshole. You'll find\r\n           another set of wombats to exploit !\r\n                         \r\n                          BILL\r\n           These sudden irrational outbursts, Hector... Did they begin\r\n           in childhood or in puberty?\r\n                         \r\n                          HECTOR\r\n           Get out of my face.\r\n                          BILL\r\n           Am I in your face ? What an interesting choice of words !\r\n           Would you like me in your face ? You're married, Hector ?...\r\n           If you wanna deal with any of these problems, I'll give you\r\n           special rates.\r\n                         \r\n          Bill has moved slightly away from Hector and turns his back to\r\n          him.\r\n                         \r\n                          HECTOR\r\n           Special rates ?... Ha ! ha !... What, like frequent flyer\r\n           miles ?...\r\n          Hector mime something (or someone) crashing on the ground. Then he\r\n          walks around his car.\r\n           Let me ask you something. Are you really color-blind, or is\r\n           that some shit you feed them with so they feel sorry for\r\n           you ?\r\n                         \r\n                          BILL\r\n           No, unfortunately I am color... Did you bug the office ?\r\n                         \r\n                          HECTOR\r\n           Hey, for a shrink, you're pretty fucking dense.\r\n                         \r\n          Hector gets in his car, while the valet is holding the door for\r\n          him. He closes the door and the car moves away, leaving a pensive\r\n          Bill on the sidewalk.\r\n                         \r\n          BOB'S RESIDENCE - EXTERIOR NIGHT\r\n                         \r\n          Bill comes to the keyhole shaped door. We can see his car parked\r\n          behind him. He dial a code on a keyboard and the gate opens behind\r\n          the door. He looks cautiously around him before walking further.\r\n          He presses a switch to close the gate.\r\n                         \r\n          BOB'S RESIDENCE - INTERIOR NIGHT\r\n          Bill enters the house. It is very dark. He opens a glass door and\r\n          walks slowly, while the door closes behind him. He hesitates a\r\n          moment, then walk more decidedly... and falls heavily on the floor !\r\n          He stands back up with some difficulty, and discovers that the\r\n          whole floor is flooded.\r\n                         \r\n          BOB'S RESIDENCE - KITCHEN - INTERIOR DAY\r\n                         \r\n          Bill enters the kitchen without switching the light on. He takes a\r\n          big butcher's knife in a stand on the table, and looks in the\r\n          corridor.\r\n                         \r\n          BOB'S RESIDENCE - CORRIDOR - INTERIOR NIGHT\r\n                         \r\n          Bill wades in the flooded corridor. He seems worried and we see\r\n          the knife blade shining. He enters the bathroom, the door of which\r\n          is wide open, and opens the shower stall. A rush of water runs out\r\n          of it. An alarm starts sounding. He goes back into the corridor\r\n          and turns off the garden hose faucet.\r\n                         \r\n          BOB'S RESIDENCE - GARDEN - EXTERIOR NIGHT\r\n          The alarm has stopped sounding. Bill is wearing short pants and he\r\n          is emptying a bucket of water on the lawn. Then he spreads a wet\r\n          cloth on the back of a seat. Several other wet clothes are already\r\n          drying.\r\n                         \r\n                          ROSE\r\n           Hello !\r\n                         \r\n                          BILL\r\n           Who's there ?\r\n                         \r\n          We see Rose entering through the keyhole-shaped door.\r\n                         \r\n                          ROSE\r\n           Hi !... Remember me ?... Fender-bender !...\r\n                         \r\n                          BILL\r\n           There she is, a little angel, dancing on the head of a pin.\r\n                         \r\n          Rose gets down the few steps to the garden. She is wearing a light\r\n          flowered summer dress.\r\n                         \r\n                          ROSE\r\n           So... did you get that estimate ?\r\n                         \r\n                          BILL\r\n           No.\r\n                         \r\n                          ROSE\r\n           Waow !... Nice place you got here. It's a little cold... but\r\n           it's kind of tasteful, right ?\r\n                         \r\n                          BILL\r\n           And wet !\r\n                         \r\n                          ROSE\r\n           You too, I guess.\r\n                          BILL\r\n           Cold or tasteful ?\r\n                         \r\n                          ROSE\r\n           So... Are we eating in here, or you take me out ?...\r\n                         \r\n          Bill bursts laughing.\r\n                         \r\n          BIG HOTEL - MAIN HALL - INTERIOR NIGHT\r\n                         \r\n          We still hear Bill's laugh slowly fading out. We are looking above\r\n          the main hall of a big luxurious hotel. Two attendants are pushing\r\n          a baggage cart. We move with them to the restaurant room. Bill and\r\n          Rose are seated at a table.\r\n                         \r\n                          ROSE\r\n           You can't ? ... At all ?... Waow !...\r\n                         \r\n          BIG HOTEL - RESTAURANT - INTERIOR NIGHT\r\n                         \r\n          Close-up on Rose putting lipstick on.\r\n                          ROSE\r\n           Not even a shade of pink ?... Can't tell me if it's smeared\r\n           or not ?\r\n                         \r\n                          BILL\r\n           I can't tell you if your eyes are bloodshed.\r\n                         \r\n                          ROSE\r\n           Really !... That's sad !... You know what ?... In respect for\r\n           your infirmity, I'm gonna give up wearing lipstick.\r\n          Close-up on Rose putting her lipstick in her glass of water.\r\n           There is something about me that I bet you find a little\r\n           strange. Right ?\r\n                         \r\n          In several shots during this dialogue, we see Bill seated in front\r\n          of a mirror wall and Rose's reflection in the mirror behind Bill's\r\n          back.\r\n                         \r\n                          BILL\r\n           What is that ?\r\n                         \r\n                          ROSE\r\n           Well, I haven't asked you what you do.\r\n                         \r\n                          BILL\r\n           That's right. You showed a remarkable restraint.\r\n                         \r\n                          ROSE\r\n           Well, it's because I'd rather guess. You know, I actually\r\n           get upset if someone tries to tell me before I can... figure\r\n           it out for myself, you know ?\r\n                         \r\n                          BILL\r\n           But what if I am ashamed of what I do.\r\n                         \r\n                          ROSE\r\n           Why... Why should you be ashamed of being a shrink.\r\n                          BILL\r\n           Who told you I was a shrink ?\r\n                         \r\n                          ROSE\r\n           Well... Are you ?\r\n                         \r\n                          BILL\r\n           How did you know ?\r\n                         \r\n                          ROSE\r\n           The way you looked at me, you know ?\r\n                         \r\n                          BILL\r\n           How I look at you ?\r\n                         \r\n                          ROSE\r\n           You... you have this kindness in your eyes. But I think\r\n           you're using it to keep me away. You know, you're trying to\r\n           play safe. You're trying to think of a case instead of\r\n           thinking of a female.\r\n                         \r\n                          BILL\r\n           So, you have a tuning fork too.\r\n                         \r\n                          ROSE\r\n           I guess we have a lot in common.\r\n                         \r\n                          BILL\r\n           We seem to be playing the same game.\r\n                         \r\n                          ROSE\r\n           Why do you say I'm playing a game?\r\n                         \r\n                          BILL\r\n           Because you're the fantasy girl, aren't you? Quicksilver?\r\n           The face glimpsed across a crowded room?\r\n                         \r\n                          ROSE\r\n           Yeah, that's... That's exactly what I am.\r\n                         \r\n                          BILL\r\n           You'll be whatever they want you to be... no substance, no\r\n           rules. Light as air. So your feet never have to touch those\r\n           burning hot coals the rest of us walk around on.\r\n                         \r\n                          ROSE\r\n           Yeah. Sort of like... not seeing red?\r\n                         \r\n                          BILL\r\n           Yeah, sort of like that.\r\n                         \r\n          BIG HOTEL - MAIN HALL - INTERIOR NIGHT\r\n                         \r\n          The main hall seen from above. Bill is crossing the hall with Rose\r\n          holding his arm.\r\n                         \r\n                          ROSE\r\n           I was afraid during dinner that you had taken a room\r\n           here... and I might have to decide whether or not to go up\r\n           with you.\r\n          BIG HOTEL - HOTEL MAIN ENTRANCE - EXTERIOR NIGHT\r\n                         \r\n          Rose and Bill are leaving the hotel.\r\n                         \r\n                          BILL\r\n           Yes, but that was part of my plan. I mean, I wanted to.\r\n          Bill gives a ticket to the car valet.\r\n           Thank you.\r\n                         \r\n                          ROSE\r\n           Oh, I need a taxi. Taxi !\r\n                         \r\n                          BILL\r\n           No, hey, hey. Wait, wait, wait. What are you being so tough\r\n           for ?\r\n                         \r\n                          ROSE\r\n           I'm just beginning to think that maybe I'Il...\r\n                         \r\n          Rose kisses Bill very tenderly, and even with some spirit. While\r\n          kissing, Bill moves Rose to a more discreet place near the\r\n          entrance. He strokes her shoulder and gets the strap of her dress\r\n          a bit down. Then he moves up the bottom of her dress to stroke her\r\n          thigh.\r\n                         \r\n           VOICE OF THE VALET\r\n                         VOICE OVER\r\n           Cab's here ! Yo, who called a taxi ?\r\n                         \r\n                          BILL\r\n           I am thinking you should just let me take you home and\r\n           forget about this stupid taxi.\r\n                         \r\n                          ROSE\r\n          Rose walks to her waiting cab.\r\n           Well, I'm thinkin' you should stay exactly where you are,\r\n           'cause...\r\n          She smiles and looks at Bill's crotch.\r\n           In that condition, you'd get arrested. Start another riot.\r\n                         \r\n                          BILL\r\n           Give me your phone number and address.\r\n                         \r\n                          ROSE\r\n           Why? You want to make me fall to earth and burn my feet ?\r\n           Whatever happened to quicksilver and light as air?\r\n          She opens the cab's door and climbs inside. She waves to Bill.\r\n                         \r\n                          BILL\r\n           She floats away on her sweet young legs. Waves to him once.\r\n           Drives away without a backward glance.\r\n                         \r\n          Rose closes the door and the cabs moves away.\r\n                         \r\n          BOB'S OFFICE - BUILDING - EXTERIOR DAY\r\n                         \r\n          The first sentence of the following dialogue is heard voice-over\r\n          on a wide shot of the modern glass building where Bob's office is\r\n          located.\r\n          BOB'S OFFICE - WORKROOM - INTERIOR DAY\r\n                         \r\n          Bill sits behind the desk. In front of the desk, already seated,\r\n          Dale, Richie's brother. He is wearing an open khaki shirt. Bill\r\n          wipes his glasses and puts them on. He is wearing an open light-\r\n          blue shirt.\r\n                         \r\n                          DALE\r\n           Richie is what he is.\r\n                         \r\n                          BILL\r\n           What exactly is that?\r\n                         \r\n                          DALE\r\n           He was born back of a van going up Route 5 to a Grateful\r\n           Dead concert. The first sound he ever heard was \"Beat It On\r\n           Down The Line.\"\r\n                         \r\n          They both laugh.\r\n                         \r\n                          BILL\r\n           Well, it could be worse.\r\n                         \r\n                          DALE\r\n           Not much.\r\n                         \r\n                          BILL\r\n           How long have you been his guardian?\r\n                         \r\n                          DALE\r\n           Since he was nine or ten. But I've always taken care of\r\n           Richie.\r\n                         \r\n                          BILL\r\n           So, what can I do for you ?\r\n                         \r\n                          DALE\r\n           Um, I was hoping you would help me... get Richie out of\r\n           therapy. Look, I know I'm just his brother, but I've been\r\n           like a mother and a father to him...\r\n          Bill takes his glasses off.\r\n           and I know I can get overprotective, but...\r\n                         \r\n                          BILL\r\n           Why would you want to take Richie out of therapy now ?\r\n                         \r\n                          DALE\r\n           What Richie needs is normalcy.\r\n                         \r\n                          BILL\r\n           Well, normalcy...\r\n          Bill gets up and keeps on talking while walking in the room.\r\n           Normalcy can be interpreted in a lot of different ways.\r\n                         \r\n                          DALE\r\n           Richie has practically been raised by the state...\r\n          Bill sits back.\r\n           ... the social workers, psychiatrists... forcing him into\r\n           this, um, psycho-servitude. He is the sweetest kid you'll\r\n           ever meet, but he thinks of himself as handicapped. It just\r\n           isn't right.\r\n                         \r\n                          BILL\r\n           Well, he's got legal problems. Richie was sentenced by the\r\n           court to mandatory treatment.\r\n                         \r\n                          DALE\r\n           Every kid gets into trouble. And that's why I need you to\r\n           help get him out.\r\n                         \r\n                          BILL\r\n           You know, Dale, it's hard to tell when someone's feeling\r\n           pain... but I want you to know...\r\n                         \r\n                          DALE\r\n           If Richie feels pain... then I feel pain. Pretty much in\r\n           tune with him. I just wish you'd give us a chance.\r\n                         \r\n                          BILL\r\n           Let me check out Richie's status. Then, uh, I'll give\r\n           probation a call.\r\n          Bill gets up.\r\n                         \r\n                          DALE\r\n           Oh, thanks. Thanks, Dr. Capa.\r\n          Dale gets up and shakes Bill's hand.\r\n           I really appreciate it.\r\n                         \r\n                          BILL\r\n           You're welcome, Dale. You either lift weights or work with\r\n           your hands.\r\n                         \r\n                          DALE\r\n           Yeah, uh, I make furniture.\r\n                         \r\n                          BILL\r\n           Really.\r\n          Bill sits back, but not Dale.\r\n                         \r\n                          DALE\r\n           Yeah, I made this desk for Bob, to remind him of New York.\r\n                         \r\n                          BILL\r\n           No kidding.\r\n                         \r\n                          DALE\r\n           We called it the Chrysler desk.\r\n                         \r\n                          BILL\r\n           Chrysler.\r\n                         \r\n                          DALE\r\n           You ever see his bed ?\r\n                         \r\n          CASEY'S LOFT - INTERIOR DAY\r\n                         \r\n          Tracking shot starting on a large painting showing a naked woman\r\n          tied with ribbons. We hear the phone ringing. The answering\r\n          machine gets on while the tracking shot moves to a painting\r\n          showing another woman naked but for very small leather panties.\r\n          She is hung upside down with chains and ropes.\r\n                         \r\n           CASEY'S VOICE ON THE ANSWERING MACHINE\r\n           Hi. This is Casey.\r\n           I can't get to the phone right now, so, uh, leave a\r\n           message. Thanks.\r\n                         \r\n          A beep ends the message. The tracking shot moves on to a\r\n          motorcycle, looking old, then to another painting showing a\r\n          redhead woman wearing a bustier, a garter belt and hoses, all red.\r\n          She is standing on hands and knees and she is wrapped with chains.\r\n          We hear Bill's voice leaving a message on the answering machine.\r\n                         \r\n           BILL'S VOICE ON THE ANSWERING MACHINE\r\n           Casey, this is Bill Capa. It's around noon. Your father\r\n           sent me a check for the private sessions you were having\r\n           with Bob. Should I send the check back or do you want to\r\n           continue ? Let me know, okay ?\r\n                         \r\n          A click ends the message. During Bill's message, the tracking shot\r\n          moves to a giant plastic statue, with Walt Disney's Pluto's head\r\n          on a human male body. Then the tracking shot moves more quickly to\r\n          another painting showing a redhead woman wearing a close-fitting\r\n          sexy black overall. Then a close shot on a painting of a woman\r\n          wearing a harness with spikes. Further away we see another\r\n          painting showing a redhead woman being whipped. At the end of\r\n          Bill's message, the tracking shots ends on Casey lying supine on a\r\n          weightlifting bench. His writs are tied to the vertical bars where\r\n          a dumbbell is resting.\r\n                         \r\n                          CASEY\r\n           I think I want to continue.\r\n          We hear the crack of a whip. Since the shot is showing only\r\n          Casey's head and chest, we don't see who is whipping him.\r\n           You bitch !\r\n          Another whip crack.\r\n           I called you a bitch !\r\n          Whip crack.\r\n           I'm sorry. I'm sorry.\r\n          Whip crack. The tracking shot starts moving backwards, but with a\r\n          larger angle.\r\n           Oh!\r\n          Whip crack. Casey's voice is softer. Medium long shot on the room.\r\n           Oh! I'm sorry.\r\n          Almost hysterical laugh.\r\n                         \r\n          ROAD IN FRONT OF BOB'S RESIDENCE - EXTERIOR DAY\r\n                         \r\n          We see Bill, bare chest, wearing sneakers short pants and cap,\r\n          running toward us. His T-shirt is hanging at his side, partly\r\n          stuck in the elastic band of his shorts. Bill stops running when\r\n          he reaches the mailbox, hesitates one moment, comes two steps back\r\n          and opens the box. Close-up on the box, inside of which a coiled\r\n          rattlesnake whips a menacing forked tongue. The snake rattles,\r\n          then the front half of the snake jumps out of the box, with its\r\n          mouth wide open. Bill falls on the road, where he remains seated\r\n          without moving. The snake, with the back half of his body still in\r\n          the box, doesn't seem to know what it must do next.\r\n           A car arrives at a high rate of speed. Since a pick-up is parked\r\n          on the other side of the road, the car must zigzag and it barely\r\n          avoid driving on Bill.\r\n                         \r\n                          BILL\r\n          Yelling to the driver.\r\n           Hey !\r\n                         \r\n          The car honks. We get a close-up of the driver when the car comes\r\n          very close to Bill.\r\n                         \r\n                          THE DRIVER\r\n           You idiot !\r\n                         \r\n          Bill looks at the departing car and notices a city worker blowing\r\n          dead leaves on the bank of the road.\r\n                         \r\n                          BILL\r\n          He yells to the city worker, but, with the loud noise of his power\r\n          blower, the man does not hears him and remains concentrated on his\r\n          work.\r\n           Hey ! Hey !... Help !... Shit !\r\n          Bill crawls back a little, then he eventually stands up. He\r\n          crosses the road, and takes a big shovel in the pick-up truck.\r\n           Fuck !\r\n          He crosses the road back. The snake is back in the mailbox.\r\n           Hello !\r\n          Bill hits the box very hard with the shovel. Snake and mail fall\r\n          on the road. Bill laughs and throws the shovel on the side of the\r\n          road.\r\n           I am not goin' back to New York, you hear me ? You're stuck\r\n           with me !\r\n          Bill stoops to pick up the letters scattered on the road. He looks\r\n          at the envelopes.\r\n           Fuckin' bill. Great.\r\n                         \r\n          We see the snake disappearing through the grass on the side of the\r\n          road. Bill, with his back to the road, is getting ready to enter\r\n          the house. A car stops and honks. Bill turns around to face\r\n          Hector.\r\n                         \r\n                          HECTOR\r\n           Capa !\r\n                         \r\n                          BILL\r\n          He comes back to the car. He looks very angry.\r\n           Oh, that's perfect ! That's really perfect ! Just like a\r\n           cop ! You're never there when you need one !\r\n                         \r\n                          HECTOR\r\n           What did I do now ?\r\n                         \r\n                          BILL\r\n           Somebody put a rattlesnake in the mailbox, Hector !\r\n                         \r\n                          HECTOR\r\n          He laughs.\r\n           A rattlesnake !\r\n                         \r\n          BOB'S RESIDENCE - KITCHEN - INTERIOR DAY\r\n          Bill is washing his arms in the sink.\r\n                         \r\n                          HECTOR\r\n           You scared the shit out of me outside.\r\n                         \r\n                          BILL\r\n           Oh, I scared you, huh ? What the hell are you doing here ?\r\n                         \r\n                          HECTOR\r\n           I could use some assistance, some of your professional\r\n           wisdom.\r\n                         \r\n                          BILL\r\n           I'm really flattered.\r\n                         \r\n                          HECTOR\r\n           Everyone in the group has an alibi. Except for Casey. He\r\n           says he was alone in his loft.\r\n                         \r\n                          BILL\r\n           Yeah ?\r\n                          HECTOR\r\n           Mm-hmm.\r\n                         \r\n                          BILL\r\n           What does that mean ?\r\n          He dries his arms with a dishcloth.\r\n                         \r\n                          HECTOR\r\n           What do you make of Casey?\r\n                         \r\n                          BILL\r\n           He's a good kid.\r\n                         \r\n                          HECTOR\r\n           You're an asshole, Capa.\r\n                         \r\n          Bill turns the water off, throws the dishcloth on the sink. Hector\r\n          walks in the room while wiping his hands with another dishcloth.\r\n                         \r\n                          BILL\r\n           Should we analyze that statement, Hector ?\r\n                         \r\n                          HECTOR\r\n           Yeah, yeah, yeah, yeah, yeah. Come on. Who is our man ?\r\n           Help me.\r\n                         \r\n                          BILL\r\n           You're the cop. Figure it out.\r\n                         \r\n          He gets out of the kitchen, followed by Hector.\r\n                         \r\n          BOB'S RESIDENCE - CORRIDOR - INTERIOR DAY\r\n                         \r\n                          HECTOR\r\n           You know what I think ? I think it was you. You've got the\r\n           look.\r\n                         \r\n                          BILL\r\n           That's right.\r\n                         \r\n                          HECTOR\r\n           Yeah, I been talking to people who knew you both. Everyone\r\n           says there was a weird competitive thing going between you.\r\n                         \r\n          They have come to the hall where the security TV screens are\r\n          located. They stop walking.\r\n                         \r\n                          BILL\r\n           Yeah, that's right. There was. I admit it. He was on the\r\n           way up... and I was on the way down.\r\n                         \r\n                          HECTOR\r\n           Including...\r\n          He whistles, miming, with both hands, something crashing down.\r\n           Splat ! It unhinged you.\r\n                         \r\n                          BILL\r\n           I bet you've seen every episode of Columbo, huh?\r\n          Sound of a buzz. The two men look at the security screen.\r\n           Who is it?\r\n          Bill taps on the remote control, and Rose appears on the screen.\r\n                         \r\n                          ROSE\r\n           Hi. It's me, Rose. The old fender bender.\r\n                         \r\n          Bill taps again on the remote control to open the gate, and Rose\r\n          leaves the TV screen.\r\n                         \r\n                          HECTOR\r\n           That's a very young girl to be going around... fending\r\n           benders.\r\n                         \r\n          Bill puts the remote control down and follows Hector to the main\r\n          gate.\r\n                         \r\n          BOB'S RESIDENCE - GARDEN - EXTERIOR DAY\r\n                         \r\n          Hector is walking to the exit. As he reaches the bottom of the\r\n          steps, Rose is going down. Bill, standing behind a low wall, looks\r\n          at her coming.\r\n                         \r\n                          BILL\r\n           Here she comes. Weightless, hanging from the sky... wearing\r\n           a short dress of indeterminate color.\r\n                         \r\n                          ROSE\r\n           It's red, poor thing.\r\n                         \r\n                          BILL\r\n           Thank you.\r\n                         \r\n          They kiss. Rose takes his hand.\r\n                         \r\n                          ROSE\r\n           I was thinking. Maybe I should see a shrink.\r\n                         \r\n                          BILL\r\n           I can recommend someone.\r\n                         \r\n                          ROSE\r\n           I feel better already.\r\n                         \r\n          Close-up on their kissing.\r\n                         \r\n                          BILL\r\n           God, I missed you.\r\n                         \r\n          They are now at the edge of the pool.\r\n                         \r\n                          ROSE\r\n           This time you won't miss.\r\n                         \r\n          They fall fully dressed in the pool.\r\n           Underwater shot. They keep on kissing in the water. Bill takes\r\n          her dress off. She wears nothing underneath. We can see a rose\r\n          tattooed on her buttock. She slips Bill's short down to his\r\n          ankles. We get a brief view of Bill's penis.\r\n           Above water shot. They are now in the water up to their waists.\r\n          Bill is kissing Rose's breasts.\r\n           Underwater shot. They are back underwater. Bill is kissing Rose's\r\n          legs, and moves slowly up to her crotch. She has trimmed pubic\r\n          hair, but with some left. Still kissing, Bill moves up along her\r\n          stomach and reaches hers breasts, which he kisses greedily.\r\n           Above water shot. Bill is leaning his back against the edge of\r\n          the pool. Rose is lying on him. They are still in the water up to\r\n          their waists.\r\n           Underwater shot. Rose is kissing Bill's chest et goes slowly down\r\n          his stomach, then along one of his legs. We get another brief view\r\n          of Bill's penis. We notice that it is not erected (certainly to\r\n          avoid being X-rated).\r\n                         \r\n          BOB'S RESIDENCE - BEDROOM - INTERIOR DAY\r\n                         \r\n          Multiple shots of Bill and Rose making love, seen through the\r\n          «piece of art». Then tracking shot on the two bodies fondling each\r\n          other.\r\n           Shot on the bedroom window, and two hand-glider in the\r\n          californian sky.\r\n           Back to the lovers couple. They are sweating profusely. Their\r\n          position and their movements suggest, without actually showing it,\r\n          that Bill is inside Rose. Bill turns Rose around to put her lying\r\n          on her stomach. Rose holds the two sculpted bed posts very\r\n          tightly. It is suggested that Bill could be sodomizing her.\r\n           They both moan. The moaning increases with a suggestion of an\r\n          orgasm.\r\n                         \r\n                          ROSE\r\n          Still holding the bedposts. She speaks with a breathless voice.\r\n           I want you to get dressed up... Get dressed up... All right ?\r\n          She turns around to face him.\r\n           I want to get dressed up.\r\n                         \r\n                          BILL\r\n           Right now ?\r\n                         \r\n                          ROSE\r\n           Uh-huh.\r\n          BOB'S RESIDENCE - DINING-ROOM - INTERIOR NIGHT\r\n                         \r\n          Through the window, we notice that the night has fallen. Bill,\r\n          seated behind the table, is wearing brown suit and necktie, very\r\n          elegant. On the table, wine and water glasses and two chandeliers,\r\n          with a lighted candle. In front of Bill, a plate with food. Rose\r\n          enters the field, carrying another plate, which she sets on the\r\n          other side of the table.\r\n           In the plate, a piece of grilled beef, noodles et vegetables.\r\n           Rose sits behind her plate. As the table is made of glass, we see\r\n          that Rose is naked.\r\n                         \r\n                          ROSE\r\n           You're not eating. Don't you like my food?\r\n                         \r\n                          BILL\r\n           I'd like your food five inches to the left.\r\n                         \r\n                          ROSE\r\n           Okay.\r\n          Rose moves the plate to her left, showing her naked body though\r\n          the glass table.\r\n           But if you don't like this... I have something else for\r\n           you.\r\n           She laughs.\r\n                         \r\n                          BILL\r\n           Yeah, okay.\r\n                         \r\n                          ROSE\r\n           I think it's ready.\r\n                         \r\n          She stands up laughing. Fade out on the next scene.\r\n                         \r\n          BOB'S RESIDENCE - BATHROOM - INTERIOR NIGHT\r\n                         \r\n          Long scene on the couple making love standing under the shower.\r\n          Fade out on the next scene.\r\n                         \r\n          BOB'S RESIDENCE - BEDROOM - INTERIOR DAY\r\n                         \r\n          Bill wakes up, naked, and alone in the bed. One of his hand is\r\n          cuffed to one of the bedpost with a long strap. He laughs.\r\n                         \r\n          ARCHIVES ROOM - INTERIOR DAY\r\n                         \r\n          An archives room, congested with shelves from floor to ceiling. On\r\n          these shelves, hundreds, and perhaps thousands, of files, stacked\r\n          not too cleanly. Bill is leaning on one of the shelves. The\r\n          archivist, a forty-year old lady, appears from behind another\r\n          shelf, apparently coming down some steps. Bill stands up.\r\n                         \r\n                          THE ARCHIVIST\r\n           It's a miracle. I found it.\r\n          She starts walking between two rows of shelves. Bill follows her,\r\n          putting his glasses on.\r\n           Here he is. Richie Dexter. Legal guardian: Dale Dexter.\r\n           That's his brother. Kids were put under care, let's see,\r\n           about six years ago.\r\n                          BILL\r\n          He tries to read above her shoulder.\r\n           Does it say why?\r\n                         \r\n                          THE ARCHIVIST\r\n           Abandonment, abuse. The children were assigned to a, uh...\r\n          She flips a page in the file.\r\n           Dr. Niedelmeyer in Pasadena. A child psychiatrist. Richie\r\n           was 12.\r\n          Bill tries to come back to the preceding page, but the archivist\r\n          looks angrily at him, silently meaning he is going a bit too far.\r\n           No foster parents. Looks like the doctor retired a couple\r\n           years after that. Then we lost track of the kids until\r\n           recently.\r\n                         \r\n                          BILL\r\n           What do you mean, \"lost track\" of them?\r\n                         \r\n                          THE ARCHIVIST\r\n          She closes the file, and keeps on walking between the rows of\r\n          shelves, followed by Bill.\r\n           Like on a radar : One minute a blip, the next, no blip.\r\n           Hey, look. This is the lost souls memorial wing. Children\r\n           of L.A. County of the '90s: 250 000 cases in here, and\r\n           there's two more down the hall.\r\n                         \r\n          SONDRA'S RESIDENCE - BEDROOM - INTERIOR DAY\r\n                         \r\n          The room is decorated in quite a luxurious way, but with a lot of\r\n          good taste. Paintings on the walls. Bed covered with an\r\n          embroidered bedspread, and many cushions. At the foot end of the\r\n          bed, a small upholstered bench.\r\n           Two women enter the room, laughing and carrying many parcels,\r\n          which they throw on the bed.\r\n                         \r\n                          BONNIE\r\n           Nobody's like your ex-husband!\r\n                         \r\n                          SONDRA\r\n           That's for sure. That's for sure.\r\n          Bonnie takes one of the parcel, a large white box.\r\n           Okay, okay, okay.\r\n                         \r\n                          BONNIE\r\n          She takes a white dress out of the box. For the first time, we see\r\n          a close-up of her face, and we discover she is Rose, different\r\n          hairdo, a lot of almost vulgar make-up, but still, she is Rose.\r\n           Here it is. Oh, Sondra, it is so beautiful. Isn't it\r\n           great ?\r\n                         \r\n                          SONDRA\r\n           I know. It's incredible. Look at all these bags.\r\n                         \r\n                          ROSE\r\n          She shamelessly takes off the dress, and, as she wears no bra, she\r\n          stands naked, save for her panties, in front of Sondra.\r\n           Oh, the man that was staring at you in the shop... was so\r\n           funny.\r\n          She laughs. Sondra freezes watching the naked body of her friend.\r\n           I think I should have got it in green or something.\r\n                         \r\n                          ROSE\r\n           Oh ! Oh ! Lush !\r\n          She has put the white dress on.\r\n           What do you think?\r\n                         \r\n                          SONDRA\r\n          She seems very moved.\r\n           I think... you look beautiful.\r\n                         \r\n                          ROSE\r\n           You sure ?\r\n                         \r\n                          SONDRA\r\n           Oh, yeah.\r\n                         \r\n                          ROSE\r\n           Come zip me up.\r\n                         \r\n                          SONDRA\r\n           Okay. Okay.\r\n          She gets up from the bed to zip up Rose's dress.\r\n           Oh, this is so tight.\r\n                         \r\n                          ROSE\r\n           Thank you.\r\n                         \r\n                          SONDRA\r\n           I need to find a new husband.\r\n          They both laugh. Sondra goes back sitting on the bed and looking\r\n          through the parcels.\r\n           I need some more money.\r\n                         \r\n                          ROSE\r\n           Oh, men. Who needs them ? Have you seen my earrings\r\n           anywhere ?\r\n                         \r\n                          SONDRA\r\n          She waves the earrings in front of Rose's face.\r\n           Yes, I've got them.\r\n                         \r\n                          ROSE\r\n           Oh, sweet !\r\n          Rose takes off the large rings she is wearing to replace them by\r\n          the earrings Sondra just gave her. She sighs.\r\n           Oh, my God. I love these. Aren't they pretty ?\r\n                         \r\n                          SONDRA\r\n           They're so gorgeous, yes.\r\n                         \r\n                          ROSE\r\n           Try yours on.\r\n                         \r\n                          SONDRA\r\n          Sondra doesn't move, feeling very embarrassed by the idea of\r\n          undressing in front of her friend.\r\n           Okay.\r\n          She eventually gets up, an starts taking off the belt from her\r\n          suit. Rose is putting her jacket on. A long silence : Sondra looks\r\n          more and more embarrassed. She snickers stupidly. Rose looks at\r\n          her without really understanding what's going on.\r\n                         \r\n                          ROSE\r\n           What now ? Sondra, what ?\r\n                         \r\n                          SONDRA\r\n          She sits back on the bed.\r\n           I feel embarrassed.\r\n                         \r\n                          ROSE\r\n           Why?\r\n                         \r\n                          SONDRA\r\n           'Cause... the way you're looking at me.\r\n                         \r\n                          ROSE\r\n           Sondra... Do men look at you like that ?\r\n                         \r\n                          SONDRA\r\n           No... Yes... But it's different.\r\n                          ROSE\r\n          She bends to her.\r\n           You know, Sondra... it doesn't have to be any different at\r\n           all.\r\n          The phone rings. Rose starts laughing.\r\n           You better get that.\r\n                         \r\n                          SONDRA\r\n          She takes the phone.\r\n           Hello. Oh, h-hi. Um... Oh...\r\n          She seems embarrassed. Rose is making funny faces.\r\n           Um, mmm, okay.\r\n          She stammers a little.\r\n           N... My trainer's coming at 2:30, but that's... Yeah. You\r\n           are? Okay !...\r\n          She goes to the window and moves the curtain aside. We see Bob's\r\n          car in the street.\r\n           Um, oh, there you are ! Okay, okay. I'll see you in a\r\n           minute !\r\n                         \r\n          STREET IN FRONT OF SONDRA'S RESIDENCE -- BOB'S CAR - EXTERIOR DAY\r\n                         \r\n          Bill drives and holds his car phone on his ear.\r\n                         \r\n                          SONDRA'S VOICE\r\n           Bye.\r\n          Bill hangs up his car phone.\r\n                         \r\n          SONDRA'S RESIDENCE - BEDROOM - INTERIOR DAY\r\n                         \r\n                          ROSE\r\n          She is looking at herself in the full-length mirror.\r\n           Who's that?\r\n                         \r\n                          SONDRA\r\n           That's my analyst ! He's coming to visit me.\r\n                         \r\n                          ROSE\r\n          When she hears Sondra's last reply, Rose's carefree face becomes\r\n          very anxious.\r\n           He what?\r\n                         \r\n                          SONDRA\r\n           Oh, my God. He's coming over.\r\n                         \r\n                          ROSE\r\n           Sondra, thanks. Oh, thanks a lot !\r\n                         \r\n                          SONDRA\r\n           What's the matter ? What ?\r\n                         \r\n                          ROSE\r\n           Nothing !\r\n          She starts gathering her belongings.\r\n           If you don't know, I thought we were just going to have a\r\n           nice afternoon together... maybe have dinner.\r\n                         \r\n                          SONDRA\r\n          She puts the telephone back on its stand and takes Rose's arm.\r\n           Well, we can. Oh, don't worry. Don't be upset. You can stay\r\n           here. Really.\r\n                         \r\n                          ROSE\r\n          She closes her purse and puts it over her shoulder.\r\n           You just don't understand, do you?\r\n                         \r\n                          SONDRA\r\n           I don't.\r\n                         \r\n                          ROSE\r\n           Nobody appreciates you the way that I do. People just use\r\n           you, and you don't even see it.\r\n                         \r\n                          SONDRA\r\n           Oh, don't be upset.\r\n          She turns to Rose to look at her face.\r\n                         \r\n                          ROSE\r\n          Rose kisses Sondra tenderly on the lips.\r\n           That's more like it. Ciao.\r\n                         \r\n          She leaves the room. Sondra seems very disturbed by the kiss. She\r\n          puts her hands on her chest.\r\n                         \r\n                          SONDRA\r\n           Oh, my God.\r\n                         \r\n          SONDRA'S RESIDENCE - HALL AND SITTING-ROOM - INTERIOR DAY\r\n                         \r\n          Rose gets quickly down the stairs. Chimes. Rose gets large\r\n          sunglasses out of her purse and adjust them on her nose before\r\n          opening the front door.\r\n           She opens the door to face Bill whom she almost jostle to get\r\n          outside as fast as possible. Through a low window, we see her\r\n          going down the stairs to the street.\r\n           Larger shot. We discover the sitting-room next to the hall. Good\r\n          taste expensive furniture, nice paintings, concert piano.\r\n           Sondra gets down the stairs. Bill, who was looking around him,\r\n          turns to her.\r\n                         \r\n                          BILL\r\n           Hi, Sondra. Someone just let me in.\r\n                         \r\n                          SONDRA\r\n           Hi.\r\n                         \r\n                          BILL\r\n           I didn't just walk in on my own.\r\n                         \r\n                          SONDRA\r\n          She closes the front door, which had remained open.\r\n           Oh... no. That was my, um... That was my girlfriend,\r\n           Bonnie. Yeah.\r\n                         \r\n                          BILL\r\n           Bonnie. Yes.\r\n                         \r\n                          SONDRA\r\n           Please, come in.\r\n                          BILL\r\n           Thank you very much. Thank you.\r\n          He enters the sitting-room, followed by Sondra.\r\n           This is a really lovely place you have here. Yeah.\r\n          He sits on a cushions-covered sofa.\r\n                         \r\n                          SONDRA\r\n           You think so? Thank you.\r\n          She sits on a small sofa without back.\r\n                         \r\n                          BILL\r\n           A lot of nice, nice things. A lot of nice art.\r\n                         \r\n                          SONDRA\r\n          She simpers a little.\r\n           What did you come here for?\r\n                         \r\n                          BILL\r\n           Well, I feel like I have so much... so much catching up to\r\n           do with all of you. And I know that you're very close with\r\n           Richie. And I was wondering if you could tell me anything\r\n           that might help me... understand him a little better.\r\n                         \r\n                          SONDRA\r\n           Richie's... my little baby.\r\n                         \r\n                          BILL\r\n           His brother Dale thinks that your \"little baby\"... should\r\n           be taken out of therapy.\r\n                         \r\n                          SONDRA\r\n           That's insane!\r\n                         \r\n                          BILL\r\n          He gets up.\r\n           I think it's a mistake too.\r\n          He goes to the window and looks at the children playing in a park.\r\n                          SONDRA\r\n           That Dale is a dangerous bastard.\r\n                         \r\n                          BILL\r\n           But he obviously seems to care for Richie a great deal.\r\n           There's a big gap in Richie's life up until about a year\r\n           ago. Did he ever mention a Dr. Niedelmeyer to you ?\r\n                         \r\n                          SONDRA\r\n           I don't have much to tell. Richie's okay. He's sweet. Did\r\n           you know that he was... molested as a child ?\r\n          She has tears in her eyes.\r\n                         \r\n                          BILL\r\n           No, I didn't know that.\r\n          He comes back to her.\r\n           It's sticking out all over.\r\n          He sits on the bench of the piano.\r\n                         \r\n                          SONDRA\r\n           It's fashionable.\r\n          She laughs nervously.\r\n           I mean, it pays well. At least, you know, you can write a\r\n           book, go on Oprah.\r\n                         \r\n                          BILL\r\n           That was quite a show he gave us in group. You think Richie\r\n           has a violent streak ?\r\n                         \r\n                          SONDRA\r\n          She sighs.\r\n           Oh. Let's cut to the chase. Richie did not kill Bob Moore.\r\n           You know... it's really swell. Snooping around here...\r\n          She gets up.\r\n           ... sniffing for blood on other people's hands... while\r\n           pretending to help your patients ?\r\n                         \r\n                          BILL\r\n           You really think that I don't care about Richie ?\r\n                         \r\n                          SONDRA\r\n          She gets upset.\r\n           Richie wouldn't hurt a fly ! Why don't you take a look at\r\n           someone dangerous. Why don't you take a look at someone who\r\n           could do it ! Why don't you take a look at Clark !\r\n                         \r\n                          BILL\r\n           Clark ?\r\n                         \r\n                          SONDRA\r\n          She gets more and more upset.\r\n           Clark ! Clark ! Clark is a sneaky, lying, button-down son\r\n           of a bitch... who pretends to be this gentle creature ! I\r\n           heard him screaming one night at Bob. It made the hairs on\r\n           my neck stand up ! Anyway... I hope that they fry...\r\n           whoever did it, and it takes a really long time. And\r\n           then... And then a fuse blows. They have to start all over\r\n           again.\r\n          She sits back. Bill has been listening to her outburst without\r\n          reacting.\r\n           We hear the front door chimes, and Sondra's expression changes\r\n          immediately. Her angry face becomes suddenly softer.\r\n           She snickers and puts her tongue to her lips.\r\n           Wow ! That's my trainer.\r\n          She gets up and sniffs a bit.\r\n           I gotta go. I gotta get the door.\r\n          She goes to the front door and opens it to a very muscular young\r\n          man wearing a sleeveless T-shirt.\r\n           This is my trainer, Chris.\r\n                         \r\n                          BILL\r\n           Hi.\r\n          Chris just nods his head.\r\n           Bye-bye.\r\n          Bill gets out. As soon as the door is closes, Sondra literally\r\n          jumps in Chris' arms, and starts giggling.\r\n                         \r\n                          SONDRA\r\n           I don't feel like lifting weights today.\r\n                         \r\n                          CHRIS\r\n           Okay.\r\n                          SONDRA\r\n           Let's do something else.\r\n          She bursts laughing.\r\n           Through the low window, we see Bill going down the stairs to the\r\n          street. He stops for two seconds to look at the tender couple !\r\n                         \r\n          DALE'S WORKSHOP - PARKING - EXTERIOR DAY\r\n                         \r\n          Bob's car stops in front of a slightly dilapidated building, on a\r\n          desert parking lot. The building could be an old factory\r\n          reconverted by Dale into a workshop to make his furniture. A very\r\n          high chimney above the building.\r\n           Bill, dressed in jeans and light-colored shirt, gets out of the\r\n          car and walks toward the building. He passes a board that\r\n          indicates the location of the «office». He knocks at a door with a\r\n          window and a grating and a sign that says «beware of the dog». The\r\n          dog starts barking. Bill knocks again. He tries to look through\r\n          the door window. The dog keeps on barking.\r\n           Bill comes back the way he came toward the «office». He stops in\r\n          front of a window and bends to try to see something inside. He\r\n          knocks on the window. He turns around, and we catch a quick\r\n          glimpse of someone behind the window.\r\n           Bill comes back to the parking lot toward a pickup that two men\r\n          are unloading.\r\n                         \r\n                          BILL\r\n           Hey! Is this Dale Dexter's shop here?\r\n                         \r\n          One of the men nods and shows the main door to Bill.\r\n                         \r\n          DALE'S WORKSHOP - INTERIOR DAY\r\n                         \r\n          Entrance of the workshop. The door opens and Bill appears. He\r\n          takes off his sunglasses, puts them in the pocket of his shirt and\r\n          gets in.\r\n           The workshop has a very high ceiling and looks a bit dilapidated.\r\n          On the roof of a small structure (perhaps the quoted «office»)\r\n          sits the impressive statue of a lion who gives the impression to\r\n          watch Bill.\r\n           Bill keeps on walking and passes a spray of burning sparks.\r\n          Someone must be using a blowtorch in the neighborhood.\r\n           Bill looks around him, looking a bit anxious. Several men are\r\n          working. He approaches one of them, wearing a sleeveless T-shirt,\r\n          and who is welding, with a protection mask covering his face.\r\n                         \r\n                          BILL\r\n           Excuse me.\r\n                         \r\n          The man stands up and puts down the piece he was welding. He\r\n          raises his mask : It's Dale.\r\n                         \r\n                          DALE\r\n           Hello. Did you go to the house?\r\n                         \r\n                          BILL\r\n           Yeah. Nobody was home. I would have phoned a...\r\n          Dale shuts his blowtorch off.\r\n           I would have phone ahead, but, uh, I don't have your phone\r\n           number in our file.\r\n                          DALE\r\n          He takes off his mask, then his protection gloves.\r\n           No problem. So, uh, did you make up your mind ?\r\n                         \r\n                          BILL\r\n           After Dr. Niedelmeyer, did Richie get another\r\n           psychiatrist ?\r\n                         \r\n                          DALE\r\n           No. No, we moved.\r\n          Dale goes around a huge, geometrically shaped, metallic structure.\r\n           Richie went to school. Everything was fine.\r\n                         \r\n                          BILL\r\n           Well... that's the problem, Dale. I look at Richie, and I\r\n           don't see that everything is fine. I see a kid that's on\r\n           the brink.\r\n                         \r\n                          DALE\r\n          He starts working on the metallic structure, but stops to look at\r\n          Bill.\r\n           A person, uh, gets a bullet in the head. Sometimes they\r\n           just leave it there 'cause... to fuck around in the brain\r\n           is gonna paralyze the person. That's Richie.\r\n                         \r\n                          BILL\r\n           What's the bullet ?\r\n                         \r\n                          DALE\r\n           Whatever it was, I got him away.\r\n          He has taken protection glasses to work.\r\n                         \r\n                          BILL\r\n           You want to talk about that ?\r\n                         \r\n                          DALE\r\n           No. I want you to stop trying to tear off the scabs. Let\r\n           the demons rest. You dig around in Richie's head, he's\r\n           gonna blow up in your face.\r\n                         \r\n                          BILL\r\n           You think he's violent ?\r\n                         \r\n                          DALE\r\n           Not with me.\r\n                         \r\n                          BILL\r\n           I think you're making a mistake, Dale. This is not the time\r\n           to take Richie out of therapy. If you don't like me, let's\r\n           get him someone else.\r\n                         \r\n                          DALE\r\n           Jesus Christ. One of you is the same as another.\r\n                         \r\n                          BILL\r\n           Yeah.\r\n                         \r\n          NIEDELMEYER'S RESIDENCE - GARDEN - EXTERIOR DAY\r\n          Bill gets out of his car. He is wearing light-colored pants, a\r\n          shirt, and a very elegant leather jacket. He walks up a few steps\r\n          toward the house.\r\n           He crosses the garden, then reaches the very impressive main door\r\n          of the house. Above the door, two similar faces are carved in the\r\n          stone. Probably Doctor Niedelmeyer's face.\r\n           A small panel opens in the door and Edith Niedelmeyer's face\r\n          appears.\r\n                         \r\n                          BILL\r\n           Mrs. Niedelmeyer?\r\n                         \r\n                          EDITH\r\n           Yes.\r\n                         \r\n                          BILL\r\n           Hi, I'm Bill Capa. I'm a doctor. I tracked you down through\r\n           the Psychiatric Institute.\r\n                         \r\n                          EDITH\r\n           How very enterprising of you.\r\n                         \r\n          She slams the panel shut. A few seconds, then she opens the door.\r\n                         \r\n                          BILL\r\n           Actually, I was wondering if I could speak to Dr.\r\n           Niedelmeyer.\r\n                         \r\n                          EDITH\r\n           My husband died last year. If it makes you feel better, he\r\n           suffered a lot. Well, anyway, it made me feel better.\r\n                         \r\n                          BILL\r\n           I'm treating a young man that was a patient... of Dr.\r\n           Niedelmeyer's when he was a child. His name is Richie\r\n           Dexter.\r\n                         \r\n                          EDITH\r\n           Why don't you leave me alone ?\r\n                         \r\n                          BILL\r\n           If I could just ask you a few questions.\r\n                         \r\n                          EDITH\r\n           You get out of here before I call the police !\r\n          She angrily slams the door shut.\r\n                         \r\n                          BILL\r\n           Just a few questions. Mrs. Niedelmeyer...\r\n                         \r\n                          EDITH\r\n          Voice over through the door.\r\n           Get out of here !\r\n                         \r\n          Bill sighs, then walks away from the door. The camera moves above\r\n          the door and ends up on a close-up of Niedelmeyer's carved face,\r\n          who seems to sneer at Bill.\r\n                         \r\n          BOB'S OFFICE - MEETING ROOM - INTERIOR NIGHT\r\n          Night is falling on L.A. Clark, in the foreground, is counting\r\n          books. Behind him, Richie, Buck and Casey are seated, Casey in his\r\n          favorite hand-shaped armchair. Sondra is standing up.\r\n                         \r\n                          CLARK\r\n           Fifty-eight. Now, if I'm not mistaken... last week there\r\n           were 59 books on the shelf and this week there are only 58\r\n           books on the shelf somehow.\r\n                         \r\n                          BUCK\r\n           Clark... what's the ashtray situation ?\r\n                         \r\n          Sondra sits down and Casey sits in another armchair.\r\n                         \r\n                          CLARK\r\n           Three. Not four, as recommended. There are three chairs and\r\n           five assorted sofas.\r\n                         \r\n                          BUCK\r\n           Who cares ?\r\n                         \r\n                          BILL\r\n          He just came in and is standing by the window. He is wearing his\r\n          glasses, jeans, open shirt and a light grey jacket. He turns\r\n          around to speak to the group.\r\n           Okay, let's get started.\r\n                         \r\n                          BUCK\r\n          Finishing a sentence the beginning of which was not\r\n          understandable.\r\n           ... an emotional tar baby.\r\n                         \r\n                          BILL\r\n           Today I'd like to focus on a most enlightening... and\r\n           challenging topic.\r\n                         \r\n                          SONDRA\r\n          She is - a bit lasciviously - sprawled in her armchair.\r\n           Sex.\r\n                         \r\n                          BILL\r\n           More or less. You see, the primary romantic relationship...\r\n           in our life is often a symptom of our illness.\r\n          He has seated himself in the hand-shaped armchair.\r\n                         \r\n                          CASEY\r\n           Glad I wore my rubber pants.\r\n          Buck snickers.\r\n                         \r\n                          BILL\r\n           We keep making the same neurotic choices over and over\r\n           every time we choose a new mate. So... If you had a magic\r\n           wand... if you, uh, had a wish list... and could change\r\n           your partner... Sondra, how would you make them different ?\r\n           What's wrong ? What's missing ?\r\n                         \r\n                          SONDRA\r\n           Now ?\r\n                         \r\n                          BILL\r\n           You need a minute to think about it ?\r\n                         \r\n                          CLARK\r\n           She's totally forgot her Rolodex.\r\n          Casey snickers.\r\n           Sorry, sorry.\r\n                         \r\n                          SONDRA\r\n           Well, I don't have an attachment in my life right now. The\r\n           last one sort of went to pieces. If you enjoy sex... A man\r\n           thinks you're doing it with everybody.\r\n                         \r\n                          BILL\r\n           He was jealous.\r\n          He gets ups, walks to a cupboard, opens its door and takes a cup.\r\n                         \r\n                          SONDRA\r\n           That's right. And I was as good as gold.\r\n                         \r\n                          BILL\r\n           Well, there's a good chance that he was the one that was\r\n           sleeping around... and projecting his fantasies and desires\r\n           onto you.\r\n                         \r\n                          SONDRA\r\n           This guy had a major projection, and he couldn't keep it in\r\n           his pants.\r\n          The whole group laughs. Bill smiles while pouring himself a\r\n          coffee.\r\n                         \r\n                          SONDRA\r\n           Anyway, I do have this girlfriend. She really makes me\r\n           laugh. A wish list. I wish... she was a guy.\r\n                         \r\n                          BILL\r\n          He comes back with his cup in his hand.\r\n           Fair enough. Casey, what do you got for us?\r\n                          CASEY\r\n          He is playing with a small statue of a monkey who looks at a\r\n          skull.. He waits a few seconds, and puts the statue down before\r\n          speaking.\r\n           Well... I met this girl about a month ago. I've painted\r\n           every inch of her in detail. She's the best model I've ever\r\n           seen. Completely uninhibited. Does whatever I ask no matter\r\n           how...\r\n                         \r\n                          BUCK\r\n          He smiles.\r\n           I'll bet she does.\r\n                         \r\n                          CASEY\r\n           That's right, Buck. See, but this is where the problem\r\n           comes in. It's what you see beneath the skin... when you\r\n           study somebody endlessly, the way an artist does. I see a\r\n           transcendental beauty there... beyond anything I could\r\n           ever, ever imagine.\r\n                         \r\n                          BILL\r\n           How does this woman feel about you?\r\n                          CASEY\r\n           She thinks I'm the living end because I've got talent. But,\r\n           I mean, what's talent ? Kick a garbage can... starving\r\n           artists crawl out, right ? But there's only one, unique\r\n           her. And, uh, I think it's love, you know ? And, um... I\r\n           don't know what to do about that.\r\n          He is suddenly moved on the verge of tears.\r\n                         \r\n                          BILL\r\n           Do you think she loves you ?\r\n                         \r\n                          CASEY\r\n           No. No.\r\n                         \r\n                          BILL\r\n           Do you care, Casey ?\r\n                         \r\n                          CASEY\r\n           I don't know. I don't know.\r\n                         \r\n                          BUCK\r\n           He's a romantic. He loves the suffering.\r\n                         \r\n                          CASEY\r\n           Maybe being who I am... I have no choice.\r\n                         \r\n                          BILL\r\n           Very good, Casey. That's good stuff.\r\n                         \r\n                          SONDRA\r\n           I agree.\r\n                         \r\n                          BILL\r\n           Buck, what do you got?\r\n                         \r\n                          BUCK\r\n          He jumps.\r\n           Oh, nothing to talk about, not compared to that.\r\n                         \r\n                          BILL\r\n           It's not a contest.\r\n                         \r\n                          BUCK\r\n          He lights a cigarette.\r\n           Hey, Yard Sale, you want to share the ashtray ?\r\n          Casey puts his foot on the ashtray to prevent Buck from using it.\r\n           Thanks a lot.\r\n          He gets up.\r\n           Forget it. You want to share something, share the ashtray.\r\n          He sits on a small armchair by a glass table with an ashtray on\r\n          it.\r\n           I got something in my life, something new. You know, she's\r\n           young. Auburn hair, 5'5\", 105. Pretty as hell. I see her on\r\n           weekends.\r\n          He picks up the ashtray and moves to sit in a more comfortable\r\n          armchair.\r\n           I don't think she'd sleep with a man unless she was married\r\n           to him.\r\n                          BILL\r\n          He has taken his glasses off.\r\n           Anything else you'd like to tell us?\r\n                         \r\n                          BUCK\r\n           She doesn't mind the gray, you know.\r\n          Bill smiles.\r\n           She's fragile... you know ? It's like she's running through\r\n           my fingers. Two people I loved died. I never thought that I\r\n           could feel anything.\r\n                         \r\n                          BILL\r\n           Good, Buck. Richie. How 'bout you ?\r\n                         \r\n                          RICHIE\r\n          He is playing with the statue of the monkey.\r\n           I don't have,really, relationships. I have m-my brother.\r\n                         \r\n                          BILL\r\n           Okay. You want to talk about him?\r\n                         \r\n                          RICHIE\r\n           H-He worries a-a lot about me. And he l-loves me. But l...\r\n           I wish he didn't... love me so m... so much sometimes. I\r\n           wish l-I had more of a l-life.\r\n          He puts the statue down and gets up.\r\n           And I know that everyone h-here thinks that I'm gay... but\r\n           I'm-I'm not. A-And I don't want to be.\r\n          Richie opens the cupboard, takes a can of Pepsi and opens it.\r\n                         \r\n                          BILL\r\n           What would you like to be ?\r\n                         \r\n                          RICHIE\r\n           I'd like t-to be a w-woman.\r\n                         \r\n                          BILL\r\n           Have you seen a doctor ?\r\n                          RICHIE\r\n           Yeah.\r\n                         \r\n                          BUCK\r\n           So the next step is the chop.\r\n                         \r\n                          BILL\r\n          He cuts him very curtly.\r\n           Thank you, Buck. Anything else you'd like to tell us,\r\n           Richie ?\r\n                         \r\n                          RICHIE\r\n           Nope.\r\n                         \r\n                          BILL\r\n           Very good. Hi, Clark. What would you change about your\r\n           partner ?\r\n                         \r\n                          CLARK\r\n          He is manicuring with his handkerchief.\r\n           Um, I think I'll pass... today.\r\n                          SONDRA\r\n           Excuse me. You think you're gonna pass today ? Don't you\r\n           think that's kind of a betrayal to the rest of the group ?\r\n           I mean, we're all sitting here sharing our most intimate\r\n           thoughts... and you're just gonna pass today ?\r\n                         \r\n                          CLARK\r\n           Well, Sondra, I have my little problems... but I don't s-\r\n           see how it's your business...\r\n                         \r\n                          SONDRA\r\n           Your \"little problems\" ?\r\n                         \r\n                          CLARK\r\n           To decide when I'm gonna share in group and not.\r\n                         \r\n                          SONDRA\r\n           Ah, I see. You're smiling. Is that a smile ? You think this\r\n           is funny ?\r\n          She gets up from her armchair.\r\n           Look at you. Just look at you. Look at your hair.\r\n          Buck snickers.\r\n           Who do you think you are ? Huh ? You think you're God's\r\n           gift to women ? Let me tell you something. You are nothing.\r\n           Nothing but a shallow, rigid... self-protective, anal\r\n           coward ! And I'll tell you what your little fucking\r\n           problems are...\r\n                         \r\n                          CLARK\r\n          He gets ups, looking angry.\r\n           Oh, shut up ! Shut up, shut up ! You promiscuous cunt ! And\r\n           if you must know, I do have somebody in my life ! Black,\r\n           emotional hole, unattractive me !\r\n          He walks nervously to the door. Sondra remains standing, looking a\r\n          bit embarrassed.\r\n                         \r\n                          BUCK\r\n          He snickers.\r\n           You can say that again !\r\n                         \r\n                          CLARK\r\n          He slams furiously the door.\r\n           Fuck you ! Fuck all of you !\r\n                         \r\n                          CASEY\r\n           Is this what you call \"treatment failure\" ?\r\n          Buck snickers.\r\n                         \r\n                          BILL\r\n           Well, it's not a total loss. He left without counting\r\n           everything.\r\n          He puts down the file he was holding in his hand.\r\n                         \r\n          CLARK'S RESIDENCE - STREET IN FRONT OF THE HOUSE - EXTERIOR DAY\r\n                         \r\n          A quiet little street, surrounded by houses an buildings of good\r\n          standing. Children in roller skates are playing hockey on the\r\n          pavement.\r\n                          CHILDREN\r\n           Come on !... Hey, right here !... Hit it !\r\n                         \r\n          Bob's car arrives in the street. The children moves away to let it\r\n          pass. While Bill is parking the car, we hear, in voice over, the\r\n          beginning of the conversation between Bill and Clark. Bill is\r\n          wearing a light-colored shirt and beige pants.\r\n                         \r\n                          CLARK\r\n          Voice over.\r\n           So pretty soon the relevant numbers weren't enough. I had\r\n           to know all the irrelevant numbers... like the numbers of\r\n           pages in each deposition.\r\n                         \r\n          CLARK'S RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n                         \r\n          Walls are white, furniture modern, but with good taste. Everything\r\n          is meticulously clean and tidy. Bill sits in an armchair. Clark is\r\n          standing by the window.\r\n                         \r\n                          BILL\r\n           So you were fired.\r\n                         \r\n                          CLARK\r\n          He takes off his sunglasses and gets regular glasses from his\r\n          shirt pocket. He is wearing disposable gloves.\r\n           Yes. In effect. Obsessive-compulsive. Medical leave.\r\n          He puts his glasses on.\r\n           \"Just please, please don't come back.\"\r\n          He sits down and sighs.\r\n           I do apologize for my outburst in group.\r\n                         \r\n                          BILL\r\n           You're screwing Sondra... aren't you?\r\n                         \r\n                          CLARK\r\n          He puts his sunglasses in his shirt pocket, gets back up and start\r\n          walking in the room.\r\n           I'm very fond of Sondra. More than that, perhaps. Sondra\r\n           is... A very warmhearted woman, but...\r\n          While talking, he sprays a liquid from a can on his plants.\r\n           Tissues. Panty hose. CDs put back in the rack without\r\n           cases. Frying pans with coagulating grease. Cotton balls.\r\n           Cotton balls. I mean, my God, the cotton balls that woman\r\n           used. Unspeakable items of underwear left hanging in the\r\n           shower. Chewed gum in the ashtrays. I made a list. There\r\n           were 22 items I couldn't take.\r\n                         \r\n                          BILL\r\n           It must be difficult to find someone... to measure up to\r\n           your keen sense of order.\r\n                         \r\n                          CLARK\r\n           I found someone. This woman thinks I'm messy. It's perfect.\r\n           She comes, she goes. I don't even know she's been except\r\n           for the faint smell of perfume.\r\n                         \r\n                          BILL\r\n          Bill sneers.\r\n           Nice. And what does Sondra think of this woman ?\r\n                          CLARK\r\n           Take a look at this.\r\n          He goes to a closet, from which he gets a paper bag. From the bags\r\n          he takes out a tattered piece of clothing.\r\n           Sondra tried to do this to my clothes... while I was\r\n           wearing them; butcher knife in hand, screaming. The next\r\n           day she came back, did this to my friend's dress. I'm\r\n           terrified to go near the woman.\r\n                         \r\n          FREEWAY, THEN ROAD - EXTERIOR DAY\r\n                         \r\n          Cars on the freeway. Among them Bob's car. The car phone is\r\n          ringing. Bill picks up the phone, while he keeps on driving. He is\r\n          wearing sunglasses.\r\n                         \r\n                          BILL\r\n           Hello ?... Hello, this is Bill Capa.\r\n                         \r\n           THE VOICE IN THE PHONE\r\n          Giggly voice sounding like a child's voice.\r\n           Hey, puke-face. Look around. Can't you see me ? I'm in the\r\n           red car.\r\n          Bill looks around him on the freeway, and sees a red car on his\r\n          right.\r\n           You got doo-doo in your eyes... or caca on the brain, Dr.\r\n           Shithead Capa.\r\n          Strange sounding giggles.\r\n                         \r\n                          BILL\r\n           Does your mommy know you escaped from the straightjacket?\r\n                         \r\n           THE VOICE IN THE PHONE\r\n           Suck my Tinkertoy, you faggot cretin... after you suck my\r\n           scalpel, Doctor.\r\n                         \r\n          Bill puts the phone down and speeds the car up to avoid the red\r\n          car which is still following him. The red car catches up with him\r\n          and bumps into him. Bill jumps up.\r\n                         \r\n                          BILL\r\n           Goddamn it !\r\n                         \r\n          The red car bumps into him a second time, and looses part of its\r\n          radiator grill.\r\n           Third bumps. Bill is now out of the freeway and on a road\r\n          downtown.\r\n           The two vehicles are zigzagging between the others cars. Lot of\r\n          honking.\r\n           Without warning, Bill turns on a side street on his right, and\r\n          gets honked by the other cars. In spite of the very dangerous\r\n          driving of Bill among the other cars, the red car keeps on\r\n          following him.\r\n           To follow Bill, the red car must take a vey sharp left turn, and\r\n          bumps into a pickup truck full of kits and gears which fall on the\r\n          pavement.\r\n           The chase goes on. The red car is dented everywhere. It catches\r\n          up with Bill, overtakes him, and bumps violently into Bill's car\r\n          right side.\r\n                          BILL\r\n           Fuck you !\r\n          The red car hits him on the right side twice in a row.\r\n           Fuck you!\r\n          Bill hits the red car on its left side and remains stuck to it.\r\n          They move together, and Bill tries to bring the red car as close\r\n          to the curb as possible.\r\n           Get the... You... Ohh! Get the fuck...\r\n          The red car is so close to the curb that it snatches away the open\r\n          door of a parked car, and then knocks down the shopping caddie of\r\n          a woman. Fortunately, the woman is able to move away, but all her\r\n          shopping items are scattered on the pavement. The two car bump\r\n          again into each other and arrive into a main road.\r\n           When the red car wants to hit Bill's car again, Bill stands on\r\n          the brake and the red car hits a big truck carrying cars. The\r\n          truck honks and start zigzagging in the traffic. The last car on\r\n          the upper bridge of the truck gets loose and falls on the road.\r\n          Bill barely avoids it. Another car gets loose from the truck and\r\n          causes a pile-up on the road.\r\n           Bill zigzag out of the pile-up, and comes to a crossing with a\r\n          railway. A train is approaching. The red car is still behind Bill.\r\n          Bill brakes suddenly just after he has crossed the railway, then\r\n          starts moving backwards. He hits the front of the red car, and\r\n          keeps on moving backwards until he brings the red car on the\r\n          railway itself. The train keeps on honking to move the cars away.\r\n           Hey! You wanna die ! Huh ? You wanna die ?\r\n          We see the driver of the train working madly on his brake, and\r\n          looking to the red car with terror in his eyes.\r\n           Just before the train reaches the crossing, Bill jumps his car\r\n          forward and the red car quickly moves backward.\r\n           Bill stops a few feet after the crossing to get his breath back.\r\n          We see the train moving behind him.\r\n                         \r\n          MEXICAN BAR - EXTERIOR NIGHT\r\n                         \r\n          A Mexican bar, where Hector is a regular. The first shot shows two\r\n          hands playing the harp. Then we get a larger shot and we see\r\n          Hector and Bill talking together. Bill is carrying his jacket on\r\n          his arm, and Hector is wearing his necktie very loose.\r\n           There is quite a crowd in the bar, some people dancing, others\r\n          drinking and some are seated to eat. Electric lines with colored\r\n          bulbs are hung in the trees. In the back, the orchestra keeps on\r\n          playing.\r\n                         \r\n                          HECTOR\r\n           I told you to stay the fuck out of it... Hey !\r\n          He kisses a passing Mexican woman.\r\n           ? Como esta? Gracias.\r\n                         \r\n                          BILL\r\n           I almost killed somebody out there. I mean, I had that car\r\n           wedged right on the railroad tracks. Christ, man. It's a\r\n           spooky feeling.\r\n                         \r\n                          HECTOR\r\n           Like mainlining adrenalin, huh ? The rush is really\r\n           something, huh ? See ? You're my kind of guy !\r\n          He takes him by the shoulders. They walk out of the field, and we\r\n          see kids hitting a puppet hanging from a tree with a bat. The\r\n          puppet is dressed in a cop's costume !\r\n          Hector and Bill come to the buffet table.\r\n                         \r\n                          HECTOR\r\n          He gets a notebook from his pocket.\r\n           You want to hear what I found out about your famous Monday\r\n           group ?\r\n                         \r\n                          BILL\r\n           Yeah, sure. Can stand a little more pain.\r\n          He takes a plate and starts helping himself at the buffet.\r\n                         \r\n                          HECTOR\r\n          He takes a tray and starts reading. A woman is serving him from\r\n          the buffet.\r\n           Well, Clark's wife divorced him... after he put her in\r\n           intensive care.\r\n                         \r\n                          BILL\r\n           What'd she do ? Spill some wine on the rug ?\r\n                         \r\n                          HECTOR\r\n           Then Sondra, she stabbed her father with a knife... and a\r\n           fork. She must have been having dinner. One of her husbands\r\n           died of unnatural causes.\r\n                         \r\n                          BILL\r\n           Probably lost some body fluids.\r\n                         \r\n                          HECTOR\r\n           And that, that kid Richie. That Richie's been busted for\r\n           drugs... and Casey hates his father so much... he set the\r\n           house on fire. So what do you think of that ?\r\n                         \r\n                          BILL\r\n           I think it's good. They should learn to assert themselves.\r\n                         \r\n          A very bright light, coming from above, suddenly shines on the\r\n          bar. Hector and Bill raises their heads. We hear the engine of a\r\n          helicopter and a voice coming from a loudspeaker.\r\n                         \r\n                          THE VOICE\r\n           Hey, the house is surrounded. Come out with your hands up\r\n           and your legs spread !\r\n                         \r\n                          HECTOR\r\n           What the hell is this ?\r\n                         \r\n          We see the helicopter and its powerful floodlight.\r\n                         \r\n                          THE VOICE\r\n           Happy birthday, Hector ! Hey, Martinez, come on out ! We\r\n           got something for you !\r\n                         \r\n          We get a better view of the helicopter. The word «police» is\r\n          written on its fuselage. Two uniformed cops are standing on the\r\n          right skid. One has a megaphone.\r\n                         \r\n           VOICES OF THE COPS\r\n           Martinez, happy birthday, man !... Happy birthday !\r\n          The crowd starts singing, accompanied by the Mexican orchestra.\r\n                         \r\n                          THE CROWD\r\n           For he's a jolly good fellow ! For he's a jolly good\r\n           fellow ! Which nobody can deny ! Which nobody can deny !\r\n          Bill and Hector come in front of the crowd, and look up.\r\n           For he's a jolly good fellow ! For he's a jolly good... !\r\n          People yell and whistle.\r\n                         \r\n          One of the cops standing on the right skid is a woman. She gets\r\n          her pants down and shows her buttocks to the crowd. Another cop,\r\n          on the other skid, has another megaphone.\r\n           People scream when they see the female cop's buttocks.\r\n                         \r\n                          BILL\r\n           If I had known it was your birthday, I'd have come by\r\n           tomorrow.\r\n                         \r\n                          HECTOR\r\n           Me too.\r\n                         \r\n          The helicopter flies away.\r\n           Large shot on the orchestra singing.\r\n                         \r\n                          ORCHESTRA\r\n           Estas son las mananitas. Que cantaba el Rey David.\r\n                         \r\n          In a corner of the bar, Bill and Hector are eating quietly.\r\n          Thunder rumbles and the first drops of rain start falling. The two\r\n          men get up to find a shelter.\r\n                         \r\n                          HECTOR\r\n           Oy. Oigan, ivengan a buscar el cake ! Better get your cake.\r\n           Ivengan a buscar el cake !\r\n                         \r\n          People stop dancing and run to find a shelter.\r\n                          A MAN\r\n           Everybody inside !\r\n                         \r\n                          BILL\r\n           How come you didn't mention Buck ?\r\n                         \r\n                          HECTOR\r\n           There wasn't anything on him.\r\n                         \r\n          BUCK'S RESIDENCE - STREET IN FRONT OF HOUSE - EXTERIOR NIGHT\r\n                         \r\n          It's raining. Bill drives with lights on and roof closed. On the\r\n          side of the car, we can see the dents from the chase with the red\r\n          car. Bill stops in front of a big vehicle. He switches off the car\r\n          lights, gets out of the car, and pulls the collar of his jacket\r\n          up. He stops near a car parked in front of Buck's house. He goes\r\n          round the vehicle. There is a bullet hole in the windshield. Bill\r\n          touches the bullet hole. He then walks toward the house, and stops\r\n          in front of the open garage door. Inside is a red car. Bill enters\r\n          the garage to have a better look at the car. When he gets up after\r\n          inspecting the car, we see Buck standing behind him. Bill turns\r\n          around. Buck has a gun in his hand.\r\n                          BUCK\r\n           You caught me at a bad time.\r\n                         \r\n                          BILL\r\n           Can we get in out of the rain?\r\n                         \r\n          Slowly Buck starts walking toward the inside of the house. Bill\r\n          starts walking too in front of Buck. They enter the house.\r\n                         \r\n          BUCK'S RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n                         \r\n          They get inside the house, which is lit only by the street lights\r\n          and a unique lamp above the desk.\r\n           Typical bachelor's place. Very messy. The furniture is simple and\r\n          practical.\r\n           We hear the storm rumbling in the distance.\r\n                         \r\n                          BUCK\r\n           Have a seat.\r\n                         \r\n          Buck gets into the bathroom, the door of which is wide open, and\r\n          grabs a towel. He dries himself and throw the towel to Bill. Bill\r\n          sits down. Buck sits down on an armchair covered with a tartan\r\n          rug. Bill dries his face. He looks at the gun, still in Buck's\r\n          hand.\r\n                         \r\n                          BILL\r\n           I don't like guns.\r\n                         \r\n          Buck shoves angrily the gun between the armrest and the cushion of\r\n          his seat. He lies back in his armchair which rocks a little. Bill\r\n          takes his jacket off.\r\n           A lightning floods the room with a very bright light. Buck puts\r\n          his hands on his face. He moans.\r\n                         \r\n                         \r\n                          BUCK\r\n           Oh, shit !\r\n                         \r\n                          BILL\r\n           Was it raining like this that night ?\r\n                         \r\n                          BUCK\r\n           Yeah. We were drivin'... me, my wife, my daughter. This guy\r\n           comes out wavin', \"Stop!\" So I slow down. My wife said,\r\n           \"No, not here, Buck. It's a bad neighborhood. Besides, the\r\n           baby's asleep in the back.\" And I said, \"Bad neighborhood,\r\n           nothing.\" So I stopped. Never even made it to the other\r\n           car. I could hear the shots being fired, but my eyes\r\n           wouldn't open. L...\r\n          Another lightning. Buck puts his hands on his head.\r\n           Oh, man ! The rain brought me around. This heavy, heavy\r\n           rain. And I'm on the sidewalk, and I crawl over... and pull\r\n           my way up and... There are two lateral shots... to the head\r\n           for my wife... and a single shot through the heart for my\r\n           daughter. Oh, Jesus, God ! Oh, Jesus. They got, uh... They\r\n           got $31. The rain nails me every time, man.\r\n                         \r\n                          BILL\r\n           Did they ever find out who did it ?\r\n                         \r\n                          BUCK\r\n           No. I think it was some kind of payback for something. But\r\n           that's a long story.\r\n                         \r\n          BOB'S RESIDENCE - GARAGE - EXTERIOR NIGHT\r\n                         \r\n          The rain has stopped, but the ground is still wet. The garage door\r\n          opens slowly and Bob's car enters the garage. The roof is still\r\n          closed. Bill is on the phone.\r\n                         \r\n          MAIN POLICE STATION - INTERIOR NIGHT\r\n                         \r\n          A telephone rings in an empty office, separated by a glass\r\n          partition from the corridor. The door is open and Anderson comes\r\n          running in, with a ready-cooked dish in his hand. He picks up the\r\n          phone.\r\n                         \r\n                          ANDERSON\r\n           Officer Anderson. What can I do for you?\r\n                         \r\n                          BILL'S VOICE\r\n           It's Dr. Bill Capa. Remember me ?\r\n                         \r\n          Low-angle shot of the office, showing the high ceiling, with a\r\n          vintage decoration, contrasting with the modern and functional\r\n          furniture.\r\n                         \r\n                          ANDERSON\r\n           Oh, yeah, yeah. The Bob Moore murder case.\r\n                         \r\n          BOB'S RESIDENCE - INSIDE CAR - EXTERIOR NIGHT\r\n                         \r\n          The car has stopped but Bill still holds the phone.\r\n                         \r\n                          BILL\r\n           I need to talk to you.\r\n          MAIN POLICE STATION - INTERIOR NIGHT\r\n                         \r\n          Same low-angle shot.\r\n                         \r\n                          ANDERSON\r\n           I hope you're an early riser. I get off at 6:00.\r\n                         \r\n          BOB'S RESIDENCE - INSIDE CAR - EXTERIOR NIGHT\r\n                         \r\n                          BILL\r\n           Okay.\r\n                         \r\n          He puts the phone down, gets his car keys and his jacket, and\r\n          leaves the car.\r\n                         \r\n          BOB'S RESIDENCE - GARDEN - EXTERIOR NIGHT\r\n                         \r\n          Bill gets out of the car and seems very intrigued by the fact that\r\n          the keyhole-shaped door is open. He shuts his car door, and walks\r\n          quietly toward the house. He looks around him in the garden,\r\n          seeming more and more anxious. Finally, he enters the house.\r\n          BOB'S RESIDENCE - CORRIDOR - INTERIOR NIGHT\r\n                         \r\n          Still anxious, Bill walks along the corridor.\r\n                         \r\n          BOB'S RESIDENCE - KITCHEN - INTERIOR NIGHT\r\n                         \r\n          Bill enters the kitchen. A lot of cooking ingredients scattered on\r\n          the table. A noise makes Bill turn around. Rose, who was kneeling\r\n          behind the table, stands up. She smiles when she sees Bill.\r\n                         \r\n                          ROSE\r\n           Hey.\r\n          She snickers. The only piece of clothing she is wearing is a hotel\r\n          room-maid white apron.\r\n           Busy day ? Can I get you something ?\r\n          Bill doesn't react at all. He looks shocked.\r\n           No ? Okay.\r\n          She crosses the room to get something in a drawer, showing her\r\n          naked buttocks. All of a sudden, she seems to remember she is\r\n          naked and put the two square fireproof cloths she is holding on\r\n          her buttocks.\r\n           Oh! I forgot about that !\r\n          She laughs then comes back to the stove, where she moves a dish.\r\n           Bill's face still looks very shocked.\r\n                         \r\n                          BILL\r\n           How did you get in here ?\r\n                         \r\n                          ROSE\r\n           Last time I was here, I stole the key. It was by the door.\r\n                         \r\n                          BILL\r\n           What about the alarm ?\r\n                         \r\n                          ROSE\r\n           Oh ! I never thought about that.\r\n                          BILL\r\n           It didn't go off ?\r\n                         \r\n                          ROSE\r\n           No. Um, did I make a mistake ? You have someone in the\r\n           car ?\r\n                         \r\n                          BILL\r\n           No, goddamn it, there isn't someone in the car ! People are\r\n           getting killed around here ! You walk around like it's\r\n           goddamn Disneyland ! What if something were to happen to\r\n           you ?\r\n                         \r\n                          ROSE\r\n          She seems not to understand Bill's anger.\r\n           I just thought that it would be a nice surprise, that's\r\n           all. You don't look too happy to see me.\r\n                         \r\n                          BILL\r\n          He waits a few second before he cools down.\r\n           This is my happiness mode. I'm sorry.\r\n                          ROSE\r\n          She is crying. Bill comes to her and takes her in his arms.\r\n           I'm sorry.\r\n                         \r\n                          BILL\r\n           I'm sorry. Baby, I'm sorry. This is a very nice surprise.\r\n          He gives a quick look at her naked body. She laughs.\r\n           Really nice. I'm sorry.\r\n          They kiss.\r\n                         \r\n                          ROSE\r\n           I'll never take a risk like that again.\r\n                         \r\n                          BILL\r\n           Why don't you take the biggest risk of all and give me...\r\n           your phone number.\r\n                         \r\n                          ROSE\r\n          She laughs and goes away from him and back to her cooking.\r\n           Christ, Capa ! I can't have people tying up the phone\r\n           lines. I'm trying to run a business here.\r\n                         \r\n          BOB'S RESIDENCE - DINING ROOM - INTERIOR NIGHT\r\n                         \r\n          Bill, with his shirt completely open, eats spaghettis in front of\r\n          a lighted candle. Rose also eats spaghettis, still dressed only in\r\n          her white apron. Bill drinks from a glass of white wine. Rose\r\n          bites into a asparagus in a slightly erotic way. Under the glass\r\n          table, we can see Bill's naked foot stroking Rose's foot. With her\r\n          other foot, Rose moves Bill's pants up. Rose slides down on her\r\n          chair, so Bill can reach her feet with his hands. Then Rose slides\r\n          completely out of her chair and under the table.\r\n                         \r\n          BOB'S RESIDENCE - BATHROOM - INTERIOR NIGHT\r\n                         \r\n          A toy remote-controlled tank is moving on Rose's naked legs. The\r\n          shot gets larger and we discover that Rose is in a bathtub full of\r\n          foaming water.\r\n                          BILL\r\n          Voice over.\r\n           General Patton comes out of the foothills.\r\n          The tank moves on Rose's pubis, then on her stomach.\r\n           Oh, he's in the swamp. Oh, oh, he's in the deep abyss.\r\n          The tank skid on Rose's naked skin and doesn't succeed in climbing\r\n          on her breast. We then see she is lying on her back on Bill's\r\n          naked body, who is also lying on this back in the bathtub.\r\n           Ooh! Ooh ! And now... Oh, he's having a problem. He's up in\r\n           the Swiss Alps, ladies and gentlemen.\r\n          They both laugh. We see Bill's hand holding the remote control.\r\n           Fire one. Fire... Oh !... A direct hit !\r\n          The tank skids into the water and stops.\r\n                         \r\n                          ROSE\r\n          Voice ironically disappointed.\r\n           Oh.\r\n                         \r\n                          BILL\r\n           Oh, our, our tank fleet is crippled.\r\n                          ROSE\r\n           Yeah ?\r\n                         \r\n                          BILL\r\n           It's goin' away.\r\n                         \r\n                          ROSE\r\n          She turns around and we guess she is grabbing Bill's penis under\r\n          water.\r\n           How's the submarine fleet ?\r\n                         \r\n                          BILL\r\n           Hey, hey, hey, hey, please, please. I gotta get some sleep.\r\n                         \r\n                          ROSE\r\n          They kiss.\r\n           Oh, you're chicken.\r\n                         \r\n                          BILL\r\n           I gotta be up...\r\n                         \r\n                          ROSE\r\n           You're chicken.\r\n                         \r\n                          BILL\r\n           I gotta be up at 6:00 in the morning.\r\n                         \r\n                          ROSE\r\n          She turns around to kiss him.\r\n           You're chicken, chicken.\r\n                         \r\n          LOS ANGELES CENTRAL MARKET - MARKET BUILDING - EXTERIOR DAY\r\n                         \r\n          Tracking shot down a high glass building until it reaches the\r\n          entrance of the «Grand Central Market».\r\n           We hear Anderson and Bill in voice over.\r\n                         \r\n                          ANDERSON\r\n           Nobody told me Buck was one of your patients.\r\n                         \r\n                          BILL\r\n           \"Nobody,\" like Martinez ?\r\n                         \r\n                          ANDERSON\r\n           Right.\r\n                         \r\n                          BILL\r\n           That's the same \"nobody\" who didn't tell me Buck was a cop.\r\n                         \r\n          The camera is now on street level and we see Bill and Anderson\r\n          crossing the street towards the main gate of the market. They pass\r\n          a truck delivering fresh meat.\r\n                         \r\n                          ANDERSON\r\n           Fucking Martinez. That's a can of worms you don't want to\r\n           mess with.\r\n                         \r\n                          BILL\r\n           What about Buck ?\r\n          They enter the market.\r\n                         \r\n          LOS ANGELES CENTRAL MARKET - INSIDE THE MARKET - INTERIOR DAY\r\n                         \r\n                          ANDERSON\r\n           Hey, look, you gotta promise... if I tell you what I know\r\n           about this shit, it stays between me and you. And you never\r\n           heard it from me, okay ?\r\n          They walk in the market alleyways. Anderson stops near a stall,\r\n          and starts talking to a stall-holder we do not see.\r\n           Two, Angelo.\r\n                         \r\n                          BILL\r\n           Why ?\r\n                         \r\n                          ANDERSON\r\n           Why ?\r\n          Two uniformed cops are walking between the stalls. Anderson raises\r\n          his voice to them.\r\n           Because cops are vindictive sons of bitches. Right, Alex ?\r\n          He throws a chicory to a cop, who catches it.\r\n                         \r\n                          ALEX\r\n           Right.\r\n                         \r\n                          ANDERSON\r\n          The cops are gone away. Anderson lowers his voice.\r\n           Fucking asshole. I don't want to spend the rest of my\r\n           career getting pissed on from above, okay ?\r\n                         \r\n                          BILL\r\n           Okay.\r\n                         \r\n                          ANDERSON\r\n          He laughs nervously.\r\n           Martinez was nailin' Buck's wife.\r\n                         \r\n                          BILL\r\n           Holy shit.\r\n                         \r\n                          ANDERSON\r\n           Yeah. Both these guys were in narcotics. And those guys\r\n           usually stick together like shit on a shirt... so who knows\r\n           how long it's been going on. Anyway, one day, it came out.\r\n           In the station, they had this big fight in front of\r\n           everybody.\r\n          Anderson takes two little wrapped packages from the unseen stall-\r\n          holder and gives one to Bill.\r\n           Two days later, Buck's wife gets blown away.\r\n                         \r\n                          BILL\r\n          He follow Anderson between the stalls.\r\n           Jesus Christ ! Was there an investigation ?\r\n                         \r\n                          ANDERSON\r\n           Of course there was an investigation. Martinez was a\r\n           suspect. Buck was a suspect. I mean nobody figured Buck\r\n           forgiving her. For a while, half the station was a suspect.\r\n                         \r\n                          BILL\r\n           What do you think ?\r\n                         \r\n                          ANDERSON\r\n           I think Buck and Martinez had a lot of enemies on the\r\n           street. This was just payback\r\n           for both of 'em.\r\n          They have come to a fishmonger stall. The fishmonger wraps a fish\r\n          for Anderson.\r\n                         \r\n          CASEY'S LOFT - INTERIOR DAY\r\n                         \r\n          Casey is lying on an exercise bench and lifting weight with a\r\n          pulleys and cables device.\r\n           The phone rings. Casey doesn't move.\r\n                         \r\n           CASEY'S VOICE ON THE ANSWERING MACHINE\r\n           Hi, this is Casey. Can't get to the phone right now, but\r\n           please leave a message.\r\n          A beep, then Bill's voice.\r\n                         \r\n           BILL'S VOICE ON THE ANSWERING MACHINE\r\n           Casey, it's Bill Capa. I got your message and, sure, I can\r\n           make it today. Are you there ?\r\n                         \r\n          A hand appears holding a leather collar, which the hand wraps\r\n          around Casey's neck.\r\n                         \r\n                          CASEY\r\n           Hey !... What... What the hell are you doing here ?\r\n                         \r\n           BILL'S VOICE ON THE ANSWERING MACHINE\r\n           Hello ? Listen, Casey, y-you sounded a little upset. Just\r\n           hang in there, okay ?\r\n                         \r\n                          CASEY\r\n           Let me get this, huh ? No ?\r\n                         \r\n           BILL'S VOICE ON THE ANSWERING MACHINE\r\n           I'll be by this morning. So I'll see you in 30.\r\n                         \r\n                          CASEY\r\n           Well, you think you can do it in 30 ?\r\n                         \r\n          He snickers while the hand tighten the collar around his neck.\r\n                         \r\n          CASEY'S LOFT - PARKING IN FRONT OF THE BUILDING - EXTERIOR DAY\r\n                         \r\n          Bob's car stops in front of the building. Bill, wearing\r\n          sunglasses, gets out of the car and walks toward a three-story,\r\n          impressive but a bit dilapidated, brick building. Evidently, it is\r\n          an old workshop changed into an artist's loft. We can still read\r\n          «Nate Starkman & Son» on the front of the building.\r\n           Bill comes to a large metallic door and presses on an intercom\r\n          button. No answer. He tries again. He raises his head to the above\r\n          windows. No one. He walks a few steps back to get a better view of\r\n          the building.\r\n                         \r\n                          BILL\r\n          He yells.\r\n           Casey !\r\n          CASEY'S LOFT - INTERIOR DAY\r\n                         \r\n          Casey is still lying on his exercise bench. Both his hands are\r\n          tied to the weight-lifting device, and his mouth is gagged. He\r\n          groans through the gag.\r\n                         \r\n          CASEY'S LOFT - PARKING - EXTERIOR DAY\r\n                         \r\n                          BILL\r\n          He puts his hands around his mouth to make his voice louder.\r\n           Casey !\r\n                         \r\n          He comes back to the door and presses the intercom button several\r\n          times. He raises his eyes and notice a folded fire-exit ladder. He\r\n          test the strength of the folding gate pulled in front of one of\r\n          the doors. It seems strong enough for him to climb it. He reaches\r\n          the ladder, which he brings down.\r\n                         \r\n          CASEY'S LOFT - ROOF OF THE BUILDING - EXTERIOR DAY\r\n                         \r\n          Bill is now on the roof of the building. He jumps down in a sort\r\n          of yard, in which are scattered various objects : plants, modern\r\n          furnitures and a full-size very realistic plastic sculpture of a\r\n          cow. Bill remains crouched a few second, pats the cow's snout,\r\n          stands up and walks towards a glass wall located on one side of\r\n          the yard. He notices he is above Casey's workshop. He walks along\r\n          the glass wall to a closed window, from which smoke is coming out.\r\n                         \r\n                          BILL\r\n           Oh, Jesus Christ.\r\n          Bill succeeds in forcing the window open. A big cloud of smoke\r\n          gets out of it.\r\n           Casey ! Hey !\r\n          He walks through the open window.\r\n           Casey!\r\n                         \r\n          CASEY'S LOFT - INTERIOR DAY\r\n          Bill walks on the upper gallery, coughing with the smoke. He takes\r\n          off his sunglasses. Down he sees flames around the mantlepiece. He\r\n          gets very quickly down the steps to ground level.\r\n           He goes to the mantlepiece. What looks like pieces of paper are\r\n          burning on the floor around the mantlepiece. He first tries to put\r\n          the flames out with his foot, then he takes a small shovel and\r\n          shovel the flaming papers back into the mantlepiece.\r\n           A curtain suddenly opens on the glass wall above the workshop,\r\n          flooding the room with bright light.\r\n           Bill walks to the center of the room, and notice that paintings\r\n          have been lacerated. On each one, it is the face of a red-hair\r\n          woman which has been taken away. Bill runs back to the\r\n          mantlepiece, where he picks up a piece of what he first thought\r\n          was a piece of paper, but which is actually a piece of canvas from\r\n          the paintings. On the half-burned piece of canvas, the face of a\r\n          woman, who is heavily made up but looks slightly like Rose.\r\n           He puts the piece of canvas down, and notice a slimy liquid on\r\n          the floor. He turns around to try to find out more about this\r\n          slimy liquid.\r\n           He pulls a rope and the painting, hooked on an horizontal cable\r\n          line, start moving toward him. Behind the paintings, hooked on the\r\n          same cable, comes Casey's body, hanging upside down. He looks dead\r\n          and sill have the gag on this mouth. The half-naked body is\r\n          covered with graffitis. The slimy liquid on the floor is Casey's\r\n          blood.\r\n                         \r\n                          BILL\r\n           Ow ! Ow ! Ow ! Shit !\r\n                         \r\n          Suddenly the blood, which was grey seen through Bill's eyes, turns\r\n          red.\r\n                         \r\n          A ROAD - EXTERIOR NIGHT\r\n                         \r\n          Sondra's car. Sondra is driving. Rose is on the passenger seat,\r\n          with her Bonnie's hairdo and make-up. The car radio is playing a\r\n          song.\r\n                         \r\n                          ROSE\r\n           I love this song.\r\n                         \r\n                          SONDRA\r\n           I know.\r\n                         \r\n          Honking. Two thirty-year old men, in an open convertible red car.\r\n                         \r\n           THE RED CAR PASSENGER\r\n           You girls want to go dancing ?\r\n                         \r\n           THE RED CAR DRIVER\r\n           Yeah. We're going to a party.\r\n                         \r\n                          SONDRA\r\n           Hi ! Hi !...\r\n                         \r\n          Rose bends over Sondra and kisses her tenderly.\r\n                         \r\n           THE RED CAR PASSENGER\r\n           Well, pardon me !\r\n          The two men look disappointed. Their car speeds up and goes away.\r\n          The two women start laughing. Rose stands up through the open roof\r\n          of the car. She waves to the passing cars. She then sits down and\r\n          moves tenderly very close to Sondra.\r\n                         \r\n                          SONDRA\r\n           What are you doing ?\r\n          Rose takes Sondra's hand and guide it under her skirt toward her\r\n          crotch.\r\n           Wha... No!\r\n          Sondra bursts laughing and takes her hand away. Rose keeps on\r\n          cuddling Sondra who tries to concentrate on her driving.\r\n           Don't ! Don't !\r\n                         \r\n          SONDRA'S RESIDENCE - BEDROOM - INTERIOR NIGHT\r\n                         \r\n          Music from preceding scene has gone on without interruption. The\r\n          two girls are dancing in front of the mirror. Sondra is wearing a\r\n          tight-fitting black dress and Rose a skirt and a short top which\r\n          shows her belly.\r\n                          SONG WORDS\r\n           Out all night Lady did. When nobody else would. Lady did\r\n           And she did it real good. Once was not enough.\r\n                         \r\n                          SONDRA\r\n           Ah !\r\n                         \r\n                          ROSE\r\n           Sondra, go !\r\n                         \r\n                          SONG WORDS\r\n           Tell me, Katie What would your mama say.\r\n                         \r\n                          SONDRA\r\n           Oh, I'm gonna go change the music.\r\n                         \r\n          While Sondra moves away to change the music, Rose goes to the\r\n          window. In the house across the street, she sees a couple kissing.\r\n          The music stops.\r\n                         \r\n                          ROSE\r\n           Sondra, come here. Oh, come here. My God !\r\n                         \r\n                          SONDRA\r\n          She comes near Rose.\r\n           Oh, my God !\r\n                         \r\n                          ROSE\r\n           These are your neighbors !\r\n                         \r\n                          SONDRA\r\n           They do this all the time.\r\n                         \r\n                          SONDRA\r\n           Oh, wait. Watch, watch! No!\r\n                         \r\n                          ROSE\r\n          She bends down under the window sill and get Sondra down too.\r\n           They're gonna see you !\r\n                         \r\n          They get up and keep on watching.\r\n                         \r\n                          SONDRA\r\n           Oh, I don't believe it !\r\n                         \r\n                          ROSE\r\n           Oh, this is the part ! This is the part !\r\n                         \r\n                          SONDRA\r\n           Oh, my gosh !\r\n                         \r\n                          ROSE\r\n           Oh !\r\n                         \r\n                          SONDRA\r\n           Believe me, they can fuck.\r\n          They laugh.\r\n           Oh, I can't watch this anymore. I didn't see anything.\r\n                         \r\n                          ROSE\r\n           Oh, Sondra, go. I love this song.\r\n                         \r\n                          SONDRA\r\n           Yeah.\r\n                         \r\n          The two girls start cuddling each other. Sondra strokes Rose's\r\n          naked stomach, then her face.\r\n           Close-up on the mirror, which shows the fire in the mantelpiece,\r\n          between the girls legs.\r\n                         \r\n                          ROSE\r\n           Sondra, through the window ! Look ! Look !\r\n                         \r\n          The camera remains on the mirror, which shows the two girls\r\n          climbing on the bed to get a better look.\r\n                         \r\n                          SONDRA\r\n           Oh, what are they doing now ?\r\n                         \r\n                          ROSE\r\n           I can't tell.\r\n                         \r\n                          SONDRA\r\n           Are they gonna do it ? No !\r\n                         \r\n          We see the couple in the house across the street. She is only\r\n          wearing panties and her breast is naked. He is only wearing his\r\n          trunks. They flirt on the couch.\r\n                         \r\n                          ROSE\r\n           My God ! It's gonna happen right now.\r\n                         \r\n          Back to the mirror shot. The two girls, still standing up, are\r\n          slapping each other buttocks. Rose raises Sondra's dress.\r\n                         \r\n                          SONDRA\r\n           Ow !\r\n                          ROSE\r\n           Oh, I'm sorry. I'm sorry.\r\n          She sits on the bed and picks up a champagne glass.\r\n           Oh, champagne.\r\n                         \r\n          Sondra comes and sits next to her. Rose gives her her glass.\r\n          Sondra drinks.\r\n                         \r\n                          SONDRA\r\n           Mmm.\r\n                         \r\n          Sondra gives the glass back to Rose, who puts it on a furniture.\r\n          The two faces come very close, and the two girls start exchanging\r\n          tender little kisses. Then Rose moves Sondra's dress down and\r\n          takes her own top off, showing her breast. Sondra seems very moved\r\n          by what she sees. She strokes Rose's face. Their lips are getting\r\n          very close.\r\n           We see Sondra's hand going down Rose's back, and slipping under\r\n          the top of her skirt, showing her buttocks. We see the tattooed\r\n          rose.\r\n                         \r\n                          ROSE\r\n          She moves her face away from Sondra.\r\n           No, no, Sondra. I can't. I can't.\r\n                         \r\n                          SONDRA\r\n           Why ? It's wonderful.\r\n                         \r\n                          ROSE\r\n           Sondra, I'm a jinx.\r\n                         \r\n                          SONDRA\r\n           No. We can cancel each other out.\r\n                         \r\n                          ROSE\r\n          She sobs a little.\r\n           No. I'm not who you think I am. Oh, God, I'm in love with\r\n           somebody and it's all falling apart. I'm sorry.\r\n                         \r\n                          SONDRA\r\n           Look, the sky isn't falling down.\r\n                         \r\n                          ROSE\r\n           Yes, it is.\r\n                         \r\n                          SONDRA\r\n           No. Let's get that silly thing off your head. There. I love\r\n           your brown hair.\r\n          She strokes her hair.\r\n                         \r\n          BOB'S RESIDENCE - INTERIOR DAY\r\n                         \r\n          Bill sleeps on a leather couch, dressed with a western-style shirt\r\n          and jeans. There is a gun on the low table near his head. We hear\r\n          a buzz. Bill wakes up, gets up and looks at the security TV set.\r\n          He takes the remote control to change the camera.\r\n                         \r\n                          BILL\r\n           Who is it ?\r\n          After two unsuccessful pictures, Rose appears on the screen. She\r\n          is wearing very short pants, a flowered blouse knotted under her\r\n          breast and a small backpack.\r\n                         \r\n                          ROSE'S VOICE\r\n           I'm back.\r\n                         \r\n          Bill opens the gate and looks through the window at Rose crossing\r\n          the garden.\r\n                         \r\n                          BILL\r\n           Here she comes. Wearing a backpack on her back... making\r\n           her look even younger than she is.\r\n          Rose enters the room, puts her backpack down and falls in Bill's\r\n          arms.\r\n           She falls into his arms. And they kiss.\r\n          They kiss.\r\n                         \r\n                          ROSE\r\n           Oh, God. I'm so glad that you're here. I didn't know if\r\n           you'd be in.\r\n                          BILL\r\n           I don't have to be anywhere until this evening.\r\n                         \r\n                          ROSE\r\n           Yeah ?\r\n          She opens her blouse. She doesn't wear a bra and her nipple\r\n          appears.\r\n           So, what color are my nipples ?\r\n                         \r\n          They both laugh. She covers and uncovers her nipple. They kiss\r\n          tenderly.\r\n                         \r\n                          ROSE\r\n           Oh, God. To be normal like this all the time.\r\n                         \r\n                          BILL\r\n           Oh, God, this is better than normal. This is much better\r\n           than normal. It's just driving me crazy, that's all. I\r\n           mean, I don't really know you... who you are... what you\r\n           do... if you're safe, when you're coming by. You have all\r\n           the power. I just sit around here and wait for you.\r\n                         \r\n                          ROSE\r\n          She cries.\r\n           You do ?\r\n                         \r\n                          BILL\r\n           Yeah. I mean, other things happen, but... in the \"what I\r\n           wait for\" department, you're it.\r\n                         \r\n                          ROSE\r\n           Oh, my.\r\n                         \r\n          Time has elapsed. They are now seated next to each other. Bill is\r\n          bare-chest and Rose is wearing one of Bill's denim shirts. They\r\n          look at a photo album. Rose puts her finger on the pictures and\r\n          Bill tells her who it is.\r\n                          BILL\r\n           Bob's wife. My ex-wife.\r\n                         \r\n                          ROSE\r\n           She's pretty.\r\n                         \r\n                          BILL\r\n           Pretty fucked up.\r\n          Rose flips the page. A picture of Bob.\r\n           Oh, God. I forget that he's dead.\r\n          She kisses him tenderly to comfort him.\r\n                         \r\n                          ROSE\r\n          She flips the page.\r\n           He looks so young here. God, how long ago were these\r\n           taken ?\r\n                         \r\n                          BILL\r\n           Ten years ago.\r\n                         \r\n                          ROSE\r\n           Really ? Do you have anything more recent ?\r\n                          BILL\r\n           Maybe. Hold on.\r\n          He gets up and goes to the shelves. He start looking for another\r\n          album.\r\n           I don't know why he kept this hidden back here except\r\n           maybe... because it had a picture of his wife naked, which\r\n           leads me to believe that... the relationship wasn't as dead\r\n           as they were pretending.\r\n          He sits back next to Rose, and start looking at the new album.\r\n           I don't know who these people are.\r\n                         \r\n                          ROSE\r\n          She seems very worried all of a sudden.\r\n           No. It's morbid. I don't want to see anymore. Let's go\r\n           outside. Let's pretend it's Sunday. Yeah? You wanna?\r\n                         \r\n          Bill looks at her, a bit disconcerted by her unexpected reaction.\r\n                         \r\n          BOB'S RESIDENCE - GARDEN - EXTERIOR DAY\r\n                         \r\n          We hear the birds chirping. By the poolside, Bill is lying on his\r\n          back on a mattress. He is wearing sunglasses, and is naked except\r\n          for a white towel spread on his pelvis. Rose is lying on her\r\n          stomach, head to foot with Bill. She is naked but is wearing one\r\n          thick woolen sock on one foot.\r\n                         \r\n                          BILL\r\n           One of my patients was killed last night. He was murdered.\r\n                         \r\n                          ROSE\r\n          She seems very disturbed by the news.\r\n           What ?\r\n                         \r\n                          BILL\r\n           The painter. Casey.\r\n                         \r\n                          ROSE\r\n          She has tears in her eyes.\r\n           Were you there ?\r\n                         \r\n                          BILL\r\n           A little bit after.\r\n                         \r\n                          ROSE\r\n           What did you see ?\r\n                         \r\n                          BILL\r\n           You don't want to know.\r\n          He takes off his sunglasses and start getting up, covering his\r\n          crotch with the towel.\r\n           About a half hour before group. I'm gonna get a shower. You\r\n           gonna be okay out here ?\r\n                         \r\n                          ROSE\r\n           Yeah.\r\n                         \r\n          BOB'S RESIDENCE - BATHROOM - INTERIOR DAY\r\n                         \r\n          Bill enters the bathroom and turn the shower faucet on. Then he\r\n          gets out of the room.\r\n                         \r\n          BOB'S RESIDENCE - DRESSING ROOM - INTERIOR DAY\r\n                         \r\n          Bill takes a pair of jeans in the closet and puts it on, without\r\n          underwear.\r\n                         \r\n          BOB'S RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n                         \r\n          Rose has dressed up. She enters the room and goes directly to the\r\n          shelf where the photo album was hidden. She gets it and starts\r\n          turning the pages.\r\n                         \r\n          BOB'S RESIDENCE - UPPER GALLERY - INTERIOR DAY\r\n                         \r\n          Bill comes out of the dressing room, and into a gallery above the\r\n          sitting room. He sees Rose looking through the album, taking a\r\n          picture out of the album and then putting the album back where it\r\n          was. He hides behind a wall for her not to see him. She is looking\r\n          inside a photo-lab envelope. Bill comes out of his hiding.\r\n                         \r\n                          BILL\r\n           Rose.\r\n                         \r\n                          ROSE\r\n          She jumps.\r\n           Oh ! Oh !\r\n          She drops the envelope, picks up her backpack and runs out of the\r\n          room.\r\n                         \r\n                          BILL\r\n           Rose ! Rose !\r\n                         \r\n          BOB'S RESIDENCE - GARDEN - EXTERIOR DAY\r\n                         \r\n          Rose runs to the keyhole-shaped door. The gate opens and Rose runs\r\n          out.\r\n          BOB'S RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n                         \r\n          Bill runs down the stair from the upper gallery. He is bare chest\r\n          with his shirt in his hand.\r\n                         \r\n          BOB'S RESIDENCE - ROAD IN FRONT OF THE HOUSE - EXTERIOR DAY\r\n                         \r\n          Rose gets out of the residence and runs to her car, a small ORV.\r\n          She climbs in and starts very fast. Bill gets out of the house.\r\n                         \r\n                          BILL\r\n          He jumps into his car without opening the door.\r\n           Rose ! Jesus !\r\n                         \r\n          Bob's car get's out of the residence.\r\n                         \r\n          MAIN ROAD, THEN CITY STREETS - EXTERIOR DAY\r\n                         \r\n          We see Bill driving his car. He chases Rose, whom we then see in\r\n          her car. Tires screech with the high speed driving. Bill comes\r\n          closer to Rose and tries to memorize her license plate numbers.\r\n                          BILL\r\n           2ASB... 185...\r\n                         \r\n          The chase goes on. Rose drives very recklessly, Bill too. He\r\n          drives through the cross roads without slowing down.\r\n           A man, who was seated on a low wall, has to climb on it to avoid\r\n          Bill's car, which is driving on the sidewalk. Bill stops near him.\r\n          We hear the voice of an angry woman.\r\n                         \r\n           VOICE OF THE ANGRY WOMAN\r\n           Oh ! Stupid, crazy bastard ! They'll give anybody a\r\n           license !\r\n                         \r\n          BOB'S OFFICE - MEETING ROOM - INTERIOR NIGHT\r\n                         \r\n          Outside, night has fallen and it is raining.\r\n                         \r\n                          CLARK\r\n          He is very smartly dressed, and even wears a bow tie. He counts\r\n          the books on the shelves.\r\n           Five and six are 31. Seven, seven, that makes 45. And that\r\n           will remain 45, and every single time you count it, it will\r\n           be 45, no matter what. And then this is five, and that\r\n           makes 50. And nine is 59. Now that's odd. That's really\r\n           odd. Now there's 59 again.\r\n                         \r\n                          BILL\r\n          He has just come into the room.\r\n           What ?\r\n                         \r\n                          CLARK\r\n           Well, last week... there were 58 books on the bookshelf\r\n           where there is always... and I mean always, 59 books, and\r\n           this week there are 59 again, so I don't...\r\n                         \r\n                          BILL\r\n          He turns toward Sondra.\r\n           Which one, Sondra ?\r\n                          SONDRA\r\n          She is very smartly dressed too, in a white suit with black\r\n          collar. She sighs.\r\n           I didn't read any of it. Really. I felt so bad when I got\r\n           it home. I couldn't help myself.\r\n                         \r\n                          BILL\r\n          He moves rapidly to the shelves.\r\n           Which one, Sondra ?\r\n                         \r\n                          SONDRA\r\n           It... The Van Gogh. But I didn't read any of it. Honestly,\r\n           I promise !\r\n                         \r\n          Bill takes the book and moves away from the shelves. Sondra signs\r\n          menacingly to Clark.\r\n                         \r\n                          CLARK\r\n           What did I do ?\r\n                         \r\n          Bill has seated himself, and he looks through the book. Sondra\r\n          tries to read above his shoulder. Close-up of the book. It is\r\n          Bob's diary. Close-up on one paragraph. We hear Bob's voice\r\n          reading the paragraph.\r\n                         \r\n                          BOB'S VOICE\r\n           I was right about the threats from the Monday group. This\r\n           cycle of pain. Yesterday's victim becomes tomorrow's\r\n           monster. Today's the day.\r\n                         \r\n          Buck enters the room.\r\n                         \r\n                          BILL\r\n           Hi.\r\n                         \r\n          Buck starts closing the door, but Richie comes in.\r\n                         \r\n                          BUCK\r\n           Hi, Bill.\r\n                         \r\n                          BILL\r\n           Hi, Buck.\r\n          Buck sits down.\r\n           Casey, uh... is not gonna be joining us tonight, so I think\r\n           we should get started.\r\n                         \r\n                          BUCK\r\n           That's typical.\r\n          Thunder rumbles. Buck puts his hands on his head. Richie looks at\r\n          him.\r\n           Oh, shit!\r\n                         \r\n                          CLARK\r\n           Buck, are you all right ?\r\n                         \r\n                          BUCK\r\n           It's none of your fucking business.\r\n                         \r\n                          SONDRA\r\n           You know, I can't stand this arguing. Really.\r\n                         \r\n                          CLARK\r\n           I'd like to start, if I may. I'd like to apologize to the\r\n           group and Sondra.\r\n          While he is talking, Bill keeps on looking through his friend's\r\n          diary. A photo is stuck between two pages. It is a photo of Rose\r\n          naked.\r\n           Everything that you said last week in group was right, and\r\n           that's why I lost my temper. Uh, the young lady that I\r\n           mentioned last week... that relationship has been\r\n           terminated. No reason and no hope. She just, just called...\r\n           and told me, and that's it.\r\n                         \r\n                          BILL\r\n          He reads what is written on the back of the photo.\r\n           \"The sociopath, lacking the restraints that... hold a\r\n           normal character together, can become anything. Amorality\r\n           frees her to be universally perfect. A charming chameleon\r\n           with a scorpion's tail.\" Do any of you recognize...\r\n           recognize this woman ?\r\n          He gives the photo to Sondra.\r\n                          SONDRA\r\n          She laughs and brings the picture to her chest.\r\n           Oh, my God ! Oh ! This is my girlfriend. This is Bonnie.\r\n                         \r\n                          BUCK\r\n          He tears the picture away from her hands.\r\n           Give me that !\r\n          He looks at the picture and turns to her.\r\n           This your Bonnie ? This is your Bonnie ? Yeah ?\r\n                         \r\n                          SONDRA\r\n           Yeah. Yeah.\r\n                         \r\n                          BUCK\r\n           The one you've been boring the living shit out of us with ?\r\n           This is the one that's saving you from yourself ? Your\r\n           shopping mall hag ?\r\n                         \r\n                          SONDRA\r\n           Shut up.\r\n                         \r\n                          BUCK\r\n           The one that makes you smile ?\r\n                         \r\n                          SONDRA\r\n           Shut up !\r\n                         \r\n                          BUCK\r\n           The one that you wish was a man ?\r\n                         \r\n                          SONDRA\r\n           What are you getting at, Buck ?\r\n                         \r\n                          BUCK\r\n           That Bonnie ? Is that it ?\r\n                         \r\n                          SONDRA\r\n           That's right, that's it. That's right, That's right.\r\n                         \r\n                          BUCK\r\n           Sondra... this is my Bonnie.\r\n                         \r\n                          SONDRA\r\n          She bursts laughing, but she has tears in her eyes.\r\n           You're lying. You're lying. You're lying. You're lying ! I\r\n           don't believe you !\r\n                         \r\n          Bill looks intensely at her. Sondra has started sobbing.\r\n                         \r\n                          CLARK\r\n          He tears the picture away from Buck's hands.\r\n           Let me see that.\r\n                         \r\n                          BUCK\r\n          He puts his head in his hands.\r\n           Fuckin' A !\r\n                         \r\n                          CLARK\r\n          He looks at the picture.\r\n           Well, yes, of course. This is the woman that I've been\r\n           talking about. This is my Bonnie.\r\n          Buck tears the picture away from his hands.\r\n           Goddamn it, Buck ! Don't do that ! Do not do that !\r\n                         \r\n                          BUCK\r\n           Hey, hey, hey !\r\n                         \r\n          They are ready to fight. Sondra comes between them. The three of\r\n          them are talking together.\r\n                         \r\n                          SONDRA\r\n           You're lying to me ! Why are you lying to me ?\r\n                         \r\n                          CLARK\r\n           Stop acting like an... Like an emotional child !\r\n                         \r\n                          BUCK\r\n           Goddamn tar baby !\r\n                         \r\n                          SONDRA\r\n           You're making it up ! You're making it up !\r\n                         \r\n                          CLARK\r\n           Nobody's making anything up... and stop it, stop it, stop\r\n           it !\r\n                         \r\n          During this heated verbal exchange, Richie has picked the fallen\r\n          picture from the floor.\r\n                         \r\n                          SONDRA\r\n           Stop it !\r\n                         \r\n                          CLARK\r\n           Quit it ! You're crumpling the picture up ! I want you to\r\n           stop showing off ! You're a little brat !\r\n                         \r\n                          BUCK\r\n           Fuck it ! You have the emotions of a styrofoam cup !\r\n                         \r\n          We see Richie putting the picture away and leaving hurriedly.\r\n                         \r\n                          CLARK\r\n           You calm down, and you stop...\r\n                         \r\n                          SONDRA\r\n           Where's the picture ?\r\n                         \r\n          Lightning, thunder, and the pictures appears close-up in a hand.\r\n          It is Hector's hand, who looks at them all, sneering.\r\n                         \r\n                          HECTOR\r\n           How in the name of God... could all of you be going out\r\n           with the same woman and not know ? Not have a clue ?\r\n           Including you, Mr. Psycho-fucking-analyst ? Not to mention\r\n           Bob Moore... who probably took this amazing picture himself\r\n           in front of his expensive painting. I'm gonna call the\r\n           Guinness Book of World Records... because I think this\r\n           woman deserves credit. And I'm gonna make sure that all of\r\n           your names are included... so you can all share in the\r\n           glory.\r\n                         \r\n                          BILL\r\n           Well, you should know something about sharing, huh,\r\n           Hector ? I mean, you and Buck must have shared some very\r\n           tender moments... discussing his wife. Huh ? Why didn't you\r\n           tell me the truth ?\r\n                         \r\n                          HECTOR\r\n           What truth is that ?\r\n                         \r\n                          BILL\r\n           Why didn't you tell me Buck was a cop... not to mention a\r\n           suspect in a murder case ? Not to mention you, goddamn it.\r\n                         \r\n                          HECTOR\r\n           Because... I'm not your patient, and I don't have to tell\r\n           you shit !\r\n                         \r\n                          BILL\r\n          He jumps on Hector. Bucks tries to take them apart.\r\n           That's right, you don't have to tell me shit ! Fuckin' tell\r\n           me anything, do you ? Why won't somebody tell me some\r\n           fucking truth ?\r\n                         \r\n                          BUCK\r\n          He has succeeded in taking them apart.\r\n           Get the fuck out of here !\r\n                         \r\n                          BILL\r\n           One fuckin' thing ! Can you do that, Buck ?\r\n                         \r\n                          HECTOR\r\n           You really know how to pick your women, you know that ?\r\n                         \r\n                          BILL\r\n           I know you can't... you lyin' sack of shit !\r\n          He wants to jump again on Hector. Buck holds him back.\r\n           You can't fuckin' do it !\r\n                         \r\n                          BUCK\r\n           Listen. After my wife died, I wanted to slaughter this\r\n           cock-sucker !\r\n                         \r\n                          SONDRA\r\n           Don't ! No more !\r\n                         \r\n                          BUCK\r\n           But I realized we both loved her. It became a, sort of a\r\n           bond between us. Isn't that right, Hector ? Isn't it ?\r\n           Hector ! Jesus God ! I never got the chance to forgive her.\r\n           So I forgave him instead.\r\n                         \r\n                          HECTOR\r\n           All right ! So much for the famous fucking Monday group !\r\n           Now we have a suspect with a tattoo on her ass and no\r\n           address. Now the cops need your help. What about the car ?\r\n           Anybody around here wrote down the license plates numbers ?\r\n                         \r\n                          BUCK\r\n           \"The license plates numbers\" ?\r\n                         \r\n                          SONDRA\r\n           We didn't even...\r\n                         \r\n                          HECTOR\r\n           Huh ?\r\n                         \r\n          Bill looks at Hector, but says nothing.\r\n                         \r\n                          SONDRA\r\n           Well, I didn't think to-to-to write it down.\r\n                         \r\n          PALACE HOTEL - HALL - INTERIOR DAY\r\n                         \r\n          Revolving door of the entrance of the hotel. People are coming\r\n          incessantly in and out. Among them we see Bill coming in. The\r\n          following dialogue is in voice over on the shot of the revolving\r\n          door.\r\n                         \r\n                          HOTEL ATTENDANT\r\n           Hey, welcome back to L.A., Miss Brown.\r\n                         \r\n           HOTEL FEMALE GUEST\r\n           Thanks. Put my bags in my room.\r\n                         \r\n                          BILL\r\n           Dr. Ashland from New York with the psychiatric convention.\r\n                         \r\n                          HOTEL ATTENDANT\r\n           Dr. Ashland ? In the health club.\r\n                         \r\n          HOTEL FITNESS CENTER - INTERIOR DAY\r\n                         \r\n          Larry, dressed in tracksuit, is working with one of the fitness\r\n          devices. Bill is standing in front of him.\r\n                         \r\n                          BILL\r\n           I don't think she is a sociopath.\r\n                         \r\n                          LARRY\r\n           Well, then how about something simple and snappy like a\r\n           multiple personality disorder ? You've fallen into a trap.\r\n           You are not well. She is not well. And to you, Iit feels\r\n           like a bond.\r\n          He gets up and starts walking in the room. Bill follow him.\r\n                         \r\n                          BILL\r\n           She's been acting this thing out as if... it's the only way\r\n           for her to have a life.\r\n                         \r\n                          LARRY\r\n           Or lives.\r\n                         \r\n          HOTEL SWIMMING POOL - INTERIOR DAY\r\n                         \r\n          Larry is sitting in a whirlpool. Hot water is bubbling all around\r\n          him. Bill is seated by the pool side.\r\n                         \r\n                          LARRY\r\n           You really want to go on seeing her, do you ?\r\n                         \r\n                          BILL\r\n           Yes, I want to see her.\r\n                         \r\n                          LARRY\r\n           In a, a nonprofessional sense ?\r\n                         \r\n                          BILL\r\n           In every sense.\r\n                         \r\n                          LARRY\r\n           I don't have your magical tuning fork. All I know is that\r\n           two people are dead... and she seems an excellent suspect.\r\n           Bill, salmon swim upstream to mate and die. And so do men.\r\n                         \r\n                          BILL\r\n           Is that what I'm doing?\r\n                         \r\n          A STREET NEAR THE MAIN POLICE STATION - EXTERIOR DAY\r\n                         \r\n          Anderson is walking in the street, a coffee paper cup in his hand.\r\n          He is wearing suit and sunglasses, but also a very flashy necktie.\r\n          Bill dressed in open shirt and sunglasses, walks toward him.\r\n                         \r\n                          BILL\r\n           Anderson ! I need your help with something.\r\n                         \r\n                          ANDERSON\r\n           Hey, man, how ya doin'?\r\n                         \r\n          They start walking together in the street.\r\n                         \r\n                          BILL\r\n           I'm sitting in a restaurant last night, and I'm looking out\r\n           the window... watching this woman trying to back out of a\r\n           space right in front of mine.\r\n                          ANDERSON\r\n           A beautiful woman ?\r\n                         \r\n                          BILL\r\n           Stunning. Anyway, the next thing I know, she busted out the\r\n           headlight on my car.\r\n                         \r\n                          ANDERSON\r\n           Uh-oh. Drives away, right ?\r\n                         \r\n                          BILL\r\n           I don't even think she knew what she did.\r\n                         \r\n                          ANDERSON\r\n           But you'd like to meet her ?\r\n          Bill answers with a silly smile.\r\n           All right, um, I'll see what I can do. You got the license\r\n           number ?\r\n                         \r\n                          BILL\r\n          He gets a piece of paper out of his shirt pocket and gives it to\r\n          Anderson.\r\n           Yeah. Thanks, man. All right. Thanks.\r\n                         \r\n                          ANDERSON\r\n           Sure.\r\n                         \r\n          The two men split up. Anderson walks into the police office.\r\n                         \r\n          STREETS, THEN PARKING BUILDING IN L.A. - EXTERIOR DAY\r\n                         \r\n          Bob's car, still dented all over, starts, with open roof, and Bill\r\n          driving. He is wearing sunglasses.\r\n           As the car passes a crossroad, we see, coming on its right , the\r\n          «red car», also dented all over. It starts following Bill.\r\n           Bill parks his car on a parking lot, at the bottom of a parking\r\n          building. The red car climbs to the roof of the building.\r\n           Bill cuts the ignition off, takes his keys and gets out of the\r\n          car. He starts walking along the building, the red car following\r\n          him from the roof.\r\n           The red car stops behind a car parked on the edge of the roof,\r\n          then starts pushing the car. The car breaks the guardrail and\r\n          falls down to the ground. Bill raises his head, sees the car\r\n          coming down, jumps away and falls flat on the ground, just\r\n          avoiding the falling car, which crashes on two other parked cars.\r\n          We see the front of the red car appearing behind the broken\r\n          guardrail. Bill bangs his fist on the ground, while pieces of\r\n          broken cars are flying all around him.\r\n                         \r\n                          BILL\r\n          He yells.\r\n           Damn !\r\n                         \r\n          BUILDING WITH GALLERIES - EXTERIOR DAY\r\n                         \r\n          A very picturesque building with multiple open air galleries. On\r\n          one of the galleries, Anderson walks toward Hector who is pointing\r\n          a menacing finger to him.\r\n                         \r\n                          HECTOR\r\n           I ought to shoot you!\r\n                         \r\n                          ANDERSON\r\n           I came to make amends.\r\n                         \r\n                          HECTOR\r\n           So make 'em, loudmouth !\r\n                         \r\n          Full shot of the building. Very typical L.A. architecture, looking\r\n          almost like a movie set. Anderson and Hector are leaning against\r\n          the bannister of one of the upper galleries.\r\n                         \r\n                          ANDERSON\r\n           I just spoke to Bill Capa. This license plate might belong\r\n           to our mystery lady.\r\n                         \r\n          Close up on Anderson and Hector. Anderson gives to Hector the\r\n          piece of paper Bill had given to him. Hector reads the paper.\r\n                         \r\n          NIEDELMEYER'S RESIDENCE - EXTERIOR DAY\r\n                         \r\n          Bill runs to the door of the house. He knocks repeatedly and\r\n          forcefully.\r\n                         \r\n                          BILL\r\n           Mrs. Niedelmeyer ! It's Dr. Capa again.\r\n                         \r\n          Edith Niedelmeyer opens the small panel in the door. She looks\r\n          furious.\r\n                         \r\n                          EDITH\r\n           You leave me alone ! Get away from here !\r\n                         \r\n                          BILL\r\n           I need your help, please !\r\n                         \r\n                          EDITH\r\n           Why are you torturing me like this ?\r\n                         \r\n                          BILL\r\n           Mrs. Niedelmeyer, please !\r\n                         \r\n          NIEDELMEYER'S RESIDENCE - INTERIOR DAY\r\n                         \r\n          Edith closes the small panel. Several heavy blows on the door,\r\n          which eventually crashes open and gives access to Bill.\r\n           The house is very heavily decorated.\r\n                         \r\n                          BILL\r\n           I need you to listen to me ! My best friend was killed. He\r\n           was stabbed with a knife...\r\n                         \r\n                          EDITH\r\n           You get out of my house !\r\n                         \r\n                          BILL\r\n           ... 38 times in the chest !\r\n                         \r\n                          EDITH\r\n           You-You go away!\r\n                          BILL\r\n          He follows her through the sitting room. They arrive near a bay\r\n          window, behind which we can see a large swimming pool.\r\n           Another patient was bled to death ! I think that I might be\r\n           next !\r\n                         \r\n                          EDITH\r\n           Go away !\r\n                         \r\n                          BILL\r\n           I don't have anywhere else to go, Mrs. Niedelmeyer ! What\r\n           are you hiding from me ? What is it ?\r\n                         \r\n                          EDITH\r\n           Nothing.\r\n                         \r\n                          BILL\r\n          Why won't you tell me the truth ?\r\n          Edith picks up a cordless phone on a table. Bill tears the phone\r\n          away from her hands.\r\n           Put that phone down.\r\n                          EDITH\r\n           I'm calling the police !\r\n                         \r\n                          BILL\r\n           Put the phone down ! Put the phone down !\r\n                         \r\n                          EDITH\r\n          She falls on the armchair in which Bill has pushed her.\r\n           Please ! What kind of twisted creature are you ? I've never\r\n           done anything to you.\r\n                         \r\n                          BILL\r\n           My patient Richie is involved...\r\n                         \r\n                          EDITH\r\n           Why in God's name are you doing this horrible joke ?\r\n                         \r\n                          BILL\r\n           If you just help me...\r\n                         \r\n                          EDITH\r\n           Richie Dexter is dead ! He killed himself four years ago.\r\n                         \r\n                          BILL\r\n           Why ?\r\n                         \r\n                          EDITH\r\n           Because he couldn't stand... what my husband was doing to\r\n           him.\r\n          She gets up goes to the window bay and open a glass door. She\r\n          leans against the frame of the door.\r\n           He hung himself with a belt. He was 12. I didn't know ! I\r\n           mean, how could I know ? Nobody knew.\r\n                         \r\n                          BILL\r\n           What about the family ?\r\n                          EDITH\r\n           He is survived by his brother, Dale. If Richie Dexter were\r\n           alive today... he'd be 16 years old. He also had a sister,\r\n           Rose.\r\n                         \r\n          Bill stands still for a few seconds. He has just understood the\r\n          truth. Then he sighs and rushes out of the house. He runs near a\r\n          impressive mantlepiece decorated with a fierce lion head pulling\r\n          its tongue out.\r\n                         \r\n          DALE'S WORKSHOP - PARKING - EXTERIOR NIGHT\r\n                         \r\n          Bob's car arrives on the empty parking lot in front of Dale's\r\n          workshop. The atmosphere is even more uncomfortable at night than\r\n          during the day. Lightnings in the sky. There are lights evenly\r\n          placed all along the high chimney. Several windows are lit on the\r\n          first floor of the building.\r\n           Bill parks the car in front of the building, gets out the car\r\n          and runs toward the building. He enters using the door with the\r\n          sign «Beware of dog».\r\n                         \r\n          DALE'S WORKSHOP - LIVING QUARTERS - INTERIOR NIGHT\r\n          Bill gets in the living quarters of the Dexter. It is quite dark.\r\n          In one corner, a large kitsch statue of Christ of the Sacred\r\n          Heart. A sink with two cabinets with glass doors..\r\n           Bill pushes the sliding door leading to the workshop.\r\n                         \r\n          DALE'S WORKSHOP - WORKSHOP - INTERIOR NIGHT\r\n                         \r\n          Bill walks between statues being worked on. He bumps into a small\r\n          cage hanging from the ceiling.\r\n           He opens a door which leads him into a small room covered with\r\n          spiderwebs. Something liquid drops on his hand. It's blood. Bill\r\n          raises his head.\r\n           Though a gate in the ceiling, he sees the crying face of Richie.\r\n           He gets out of the small room, takes a big piece of carved wood\r\n          on a table, and climbs the steps leading to the upper parts of the\r\n          workshop.\r\n           When he arrives in the upper gallery, he menacingly waves the\r\n          piece of wood, and walks very cautiously. Richie is seated with\r\n          his back to him. He has blood on his T-shirt.\r\n                         \r\n                          BILL\r\n           Richie.\r\n          He gets nearer and puts the piece of wood down.\r\n           Jesus Christ !\r\n          When he is close to Richie, he sees that his T-shirt is badly torn\r\n          down and full of blood. He wants to touch it, but Richie starts\r\n          moaning. Bill kneels near him.\r\n           What did he... What did he do to you ?\r\n                         \r\n                          RICHIE\r\n          He can hardly talk, and stammers even more than usual.\r\n           W-What I... d-deserved. Y-You shouldn't be here. Get away\r\n           from me.\r\n                         \r\n                          BILL\r\n           Richie... Richie... I have to see Rose.\r\n          He takes off Richie's glasses.\r\n           I need her.\r\n          He takes off Richie's wig, and Rose's face appears.\r\n                         \r\n                          ROSE\r\n          She has gone back to Rose's voice, and doesn't stammer anymore.\r\n           Get away from me, please ! You'll make it worse !\r\n                         \r\n                          BILL\r\n           Where's Dale ?\r\n                         \r\n                          ROSE\r\n          She cries.\r\n           L-I don't know, but he'll be back ! L-I don't know where he\r\n           is.\r\n                         \r\n                          BILL\r\n          He is also crying.\r\n           Was this your idea, to become Richie ?\r\n                         \r\n                          ROSE\r\n           No ! No ! L-It happened. It just happened.\r\n                          BILL\r\n           What? What happened, Rose ? Please. I need to know.\r\n                         \r\n                          ROSE\r\n           When Richie died... Dale buried the body and then he said,\r\n           \"Richie, come here.\" And I told him, I told him, \"My name\r\n           is Rose !\" He slapped me so hard, I couldn't get up. A-And\r\n           he, he made me dress in these clothes... and h-he did\r\n           things to me that made me not want to be a woman anymore. I\r\n           was Richie from then on.\r\n                         \r\n                          BILL\r\n           What happened to Rose ?\r\n                         \r\n                          ROSE\r\n           After a while, I forgot about Rose. Then Richie got busted.\r\n                         \r\n                          BILL\r\n           And you had to come to group.\r\n                         \r\n                          ROSE\r\n           They were our world. They were our family.\r\n                         \r\n                          BILL\r\n           But then what ? Rose started coming back ?\r\n                         \r\n                          ROSE\r\n           No! Rose, Rose was too scared, so Bonnie came out. Bonnie\r\n           was first.\r\n                         \r\n                          BILL\r\n           Oh, honey.\r\n                         \r\n                          ROSE\r\n           Help me, please ! Help me.\r\n          Rose moves her eyes down and Bill follows her eyes. He discovers\r\n          that Rose's hand has been nailed to the carved armrest of the\r\n          armchair.\r\n                          BILL\r\n           Jesus! Oh, my God !\r\n          Bill stands up.\r\n           Oh! Jesus Christ ! Jesus Christ !\r\n          He goes to the table where he had dropped the piece of wood and\r\n          start looking for an appropriate tool. He finds a big hammer.\r\n           That crazy bastard !\r\n          With the forked end of the hammer, he raises the nail.\r\n                         \r\n                          ROSE\r\n          She cries and yells.\r\n           Oh, God !\r\n                         \r\n          Bill gets the nail off. Rose can't breathe anymore. Her eyes are\r\n          rolling upwards.\r\n                         \r\n                          BILL\r\n          He feels that she is going away from him.\r\n           Rose !\r\n                         \r\n                          ROSE\r\n          She goes back to Richie's voice and face. She starts stammering\r\n          again.\r\n           Get away f-from me!\r\n                         \r\n                          BILL\r\n           Rose, come back ! Richie ! Richie, leave her alone !\r\n                         \r\n                          ROSE\r\n          Still talking like Richie.\r\n           I never get to be out a-anymore.\r\n                         \r\n                          BILL\r\n           Rose. Come on.\r\n                         \r\n                          ROSE\r\n          Rose's head stands up : she is gone back being Rose.\r\n           And then I met you and the fog... Started to lift.\r\n          Bill takes off the other nail.\r\n           It did. It did.\r\n                         \r\n                          BILL\r\n           I know. Come on, let's go.\r\n          He helps her to stand up, and then to walk.\r\n           Let's go. Here we go. Come on. Shh. Come here.\r\n          They start going down to the workshop.\r\n           Here we go. Here we go. Let's move.\r\n                         \r\n          We hear the sound of a nail-gun, and a nail clicks on a piece of\r\n          metal near them.\r\n                         \r\n                          ROSE\r\n           Oh !\r\n                         \r\n          Several nail-gun shots. Nails are getting stuck in the various\r\n          wooden objects around them.\r\n                         \r\n                          DALE\r\n          Shot from behind Dale. He holds a nail-gun and keeps on shooting\r\n          nails.\r\n           Back up!\r\n          He sticks a nail in Bill's shirt. Bill remains nailed against a\r\n          carved wooden panel.\r\n                         \r\n                          ROSE\r\n          She yells and holds Bill tightly.\r\n           No ! No, Dale, don't !\r\n                         \r\n                          BILL\r\n           Get back ! Get back !\r\n                         \r\n                          ROSE\r\n           Dale, no !\r\n                         \r\n                          DALE\r\n           Quick tongue, slow wit. Deadly, Doctor.\r\n          Bill tries to take the nail off. The nail must have gone through\r\n          his flesh, because there is blood on his shirt.\r\n           Deadly.\r\n                         \r\n          Dale raises his nail-gun slowly, but Hector appears from behind a\r\n          wall, holding a «real» gun.\r\n                         \r\n                          HECTOR\r\n           Hi, Dale. You fucking daffodil. Put that toy down. Put it\r\n           in the toolbox. Now ! I got .45 caliber nails in this gun !\r\n                         \r\n                          BILL\r\n           What are you doing here, Martinez ?\r\n                         \r\n                          HECTOR\r\n          He talks to Bill who is behind him, but without taking his eyes\r\n          away from Dale.\r\n           Aren't you glad I'm here ? Anderson snitched you out !\r\n           That's what happens when you try to outsmart a cop ! Let\r\n           that be your psych lesson for the day !\r\n                         \r\n          At the end of his sentence, Hector slightly turns his head toward\r\n          Bill. Immediately Dale shoots him. Hector bends down a little\r\n          because of the pain, and stands back up to shoot Dale. But Dale is\r\n          faster than him and nails both of his hands against the wood\r\n          panel.\r\n                         \r\n                          HECTOR\r\n          He yells.\r\n           Go ! Run !\r\n                         \r\n                          BILL\r\n           Go ! Get over there ! Get over there !\r\n                         \r\n                          ROSE\r\n           No ! No !\r\n                         \r\n          Dale keeps on shooting and sticks several nails in Hector's\r\n          fingers.\r\n                         \r\n                          HECTOR\r\n           Go ! Run ! Run ! Run ! Run ! Go !\r\n          Bill succeeds in getting the nail off his arm. He runs away with\r\n          Rose.\r\n           We follows them through the workshop. As they reach a staircase,\r\n          we hear an engine starting. Then a whole block of shelves falls in\r\n          front of them. We see Dale in a small glass cabin, his hands on\r\n          the controls of a handling machine.\r\n           Bill moves Rose away from him...\r\n                         \r\n                          BILL\r\n           Let's go!\r\n                         \r\n          ... just as a huge piece of furniture falls on Bill, who falls\r\n          down, stuck under the furniture.\r\n                         \r\n                          ROSE\r\n           No ! Get out !\r\n                         \r\n          Dale appears behind Bill, and wraps a leather belt around his\r\n          neck. He tightens the belt. Bill suffocates. Dale pulls him by the\r\n          belt across the workshop.\r\n                         \r\n                          DALE\r\n           Come on ! Come on !\r\n                         \r\n          He puts him inside a metal cage. He ties the belt on the top of\r\n          the cage. Bill tries, with both hands to move the belt away from\r\n          his throat.\r\n                         \r\n                          BILL\r\n           You fucking son of a bitch !\r\n          Dale takes a small electric saw, switches it on and tests it on\r\n          the bars of the cage. Sparks spring up.\r\n           You really fucked it up, didn't ya ? Got your little\r\n           brother killed.\r\n                         \r\n                          DALE\r\n           No !\r\n                         \r\n                          BILL\r\n           You let old Niedelmeyer do it to him.\r\n                         \r\n                          DALE\r\n           No, I saved him !\r\n                         \r\n                          BILL\r\n           You knew what was happening...\r\n                         \r\n                          DALE\r\n           I didn't know !\r\n                         \r\n                          BILL\r\n           Because it happened to you before !\r\n                         \r\n                          DALE\r\n           Would you goddamn shut up ?\r\n                         \r\n                          BILL\r\n           Could have saved your little brother, but he killed\r\n           himself.\r\n                          DALE\r\n          He is getting angry.\r\n           Shut up ! Shut the fuck up !\r\n                         \r\n                          BILL\r\n           You failed, Dale. And you made Rose become Richie !\r\n                         \r\n                          DALE\r\n          He calms down and smiles.\r\n           Oh, you're smart. You're really smart. Bob Moore was smart,\r\n           but I put a stop to that.\r\n                         \r\n                          BILL\r\n           Yeah, you did.\r\n          He coughs.\r\n           Why'd you kill Casey, Dale?\r\n                         \r\n                          DALE\r\n           Why are you head-shrinkers all alike, huh ? Y-You can't\r\n           keep your fucking hands off of us. Huh ? Always pokin' and\r\n           pushin'. Huh ?\r\n          While talking, he keeps on switching his saw on and off.\r\n                          BILL\r\n           Why'd you do it, Dale ?\r\n                         \r\n                          DALE\r\n           Because... that little bitch, Rose, she started sneaking\r\n           out... playing like Bonnie, modeling for him night after\r\n           night. Christ, Bill, he was lookin' right through her...\r\n           gonna recognize Richie in group. Well, I might have missed\r\n           old Niedelmeyer... but I sure as hell got Bob... real good.\r\n           - And now...\r\n          He starts his saw. Sparks spring up on the edge of the cage.\r\n           I'm gonna cut you into little pieces and sand the skin off.\r\n                         \r\n                          BILL\r\n          He snickers.\r\n           The inspiration of madness, Dale.\r\n                         \r\n                          DALE\r\n           The tyranny of normalcy, Bill.\r\n                         \r\n          He starts his saw again, and slowly moves it close to Bill. We\r\n          hear the sound of the nail-gun and a nail gets stuck in Dale's\r\n          shoulder. The saw stops. Dale walks back a few steps to face Rose,\r\n          holding the nail-gun pointed on him.\r\n                         \r\n                          DALE\r\n           Richie.\r\n                         \r\n                          ROSE\r\n           My name is... My name is Rose.\r\n          He rushes on her. She shoots and sticks a nail in the middle of\r\n          his forehead. Dale falls down. Rose starts screaming.\r\n           No ! No !\r\n          Bill tries to get the belt off his neck. Rose raises the gun to\r\n          her throat, and presses the trigger. But it doesn't work. She\r\n          tries again. It still doesn't work. The gun must be empty.\r\n           No !\r\n          Bill eventually succeeds in getting free, but Rose, after she has\r\n          thrown the gun away, starts running through the workshop.\r\n           No !\r\n                         \r\n                          BILL\r\n          He runs after her.\r\n           Rose ! Rose ! Come back ! Rose !\r\n                         \r\n          DALE'S WORKSHOP - CHIMNEY - EXTERIOR NIGHT\r\n                         \r\n          Rose starts climbing the ladder mounted on the body of the\r\n          chimney. Bill follows her and yells.\r\n                         \r\n                          BILL\r\n           Rose ! Rose ! Stop ! Rose !\r\n          Rain is soaking both of them, but they keep on climbing. Thunder\r\n          is rumbling.\r\n           A long distance shot shows the whole chimney, with Rose and Bill\r\n          climbing on it.\r\n           Wait ! Rose!\r\n                         \r\n                          ROSE\r\n          She sobs.\r\n           Don't !\r\n                         \r\n                          BILL\r\n           For God's sakes, don't jump ! Rose !\r\n                         \r\n                          ROSE\r\n          She has reached the circular platform on the top of the chimney.\r\n          She yells.\r\n           No !\r\n                         \r\n                          BILL\r\n           Rose ! Stop !\r\n                         \r\n                          BILL\r\n          He reaches the platform.\r\n           No ! No. No !\r\n                         \r\n                          BILL\r\n           Wait !\r\n                         \r\n                          ROSE\r\n           Why ?\r\n                         \r\n                          BILL\r\n           Rose ! No ! Stop, please !\r\n          Rose jumps on the very narrow ring which circles the platform.\r\n           Just stay there !\r\n                         \r\n                          ROSE\r\n           It's too late. I've gone too far. I can't go back.\r\n                         \r\n                          BILL\r\n           If you go, I go ! I swear to God ! I swear to God.\r\n                         \r\n                          ROSE\r\n           Why would you do that ?\r\n                          BILL\r\n           Please, God, just come over here. I don't want you to die.\r\n           Just give me your hand. Take a risk ! There's no risk in\r\n           dying. Come on.\r\n                         \r\n                          ROSE\r\n           Oh, Capa.\r\n                         \r\n                          BILL\r\n           Come on.\r\n                         \r\n                          ROSE\r\n          She puts her hand out to Bill's strutted hand. We hear the sound\r\n          of a high gust of wind, and Rose looses her balance and starts\r\n          falling backward.\r\n           L... No...\r\n                         \r\n                          BILL\r\n           No !\r\n                         \r\n                          ROSE\r\n           Capa !\r\n          She yells.\r\n           No !\r\n                         \r\n          Bill jumps from the platform and catches a chain hanging under the\r\n          platform. His momentum makes him swing and he catches Rose's arm\r\n          just as she was falling from the outer ring. With his other arm he\r\n          holds on the chain and they start swinging back and forth. They\r\n          eventually reach the chimney ladder. Rose grabs one of the rungs,\r\n          followed by Bill, who pushes her up.\r\n                         \r\n                          BILL\r\n           Come on.\r\n                         \r\n          They move back to the platform, and, as soon as they reach it,\r\n          they hug each other very tight. Bill looks at the beacon on the\r\n          top of the chimney. From white, the beacon becomes red, which is\r\n          its real color. Bill smiles : he sees red again. He hugs Rose even\r\n          more tightly.\r\n                         \r\n                          HECTOR'S VOICE\r\n          While the camera pans away from the platfom, showing the whole\r\n          platform with Bill and Rose holding each other, we hear Hector's\r\n          voice.\r\n           Hey! Listen up, you fucking daffodils ! You gonna leave me\r\n           hanging here all night, huh ?\r\n          Bill starts laughing.\r\n           Get me down, you goddamn cuckoos ! Get me some fucking\r\n           Band-Aids !\r\n          Bill keeps on laughing. Rose starts laughing too.\r\n           Come on, you fucking daffodils ! Get me out of here !\r\n                         \r\n                         CREDITS\r\n                         \r\n          During the credits, we hear the following song :\r\n                         \r\n           WORDS OF THE CREDITS SONG\r\n           You and I - Moving in the dark - Bodies close But souls\r\n           apart - Shadowed smiles - Secrets unrevealed - I need to\r\n           know The way you feel - And I'll give you everything I am\r\n           And everything I want to be - I'll put it in your hands -\r\n           If you could open up to me - Oh, can't we ever Get beyond\r\n           this wall 'Cause all I want Is just once To see you in the\r\n           light - But you hide behind The color of the night - Ooh,\r\n           ooh, ooh Ooh, ooh, ooh, ooh - God save me - Ooh, ooh, ooh\r\n           Ooh Ooh, ooh, ooh, ooh Ooh, ooh, ooh - Everything I am -\r\n           Everything I am - And everything I want to be - Oh, can't\r\n           we ever get beyond this wall 'Cause all I want Is just once\r\n           - Forever and again - Ever and again - I'm waiting for you\r\n           - I'm standing in the night But you hide behind The color\r\n           of The night - Ooh, ooh, ooh, ooh, ooh, ooh - Please come\r\n           out from the color of The night\r\n                         \r\n                          HECTOR'S VOICE\r\n          At the end of the credits, we hear Hector's voice again.\r\n           Hey ! You gonna spend the night up there ? You and little\r\n           Miss Fender Bender ?\r\n                          \r\n\r\n\n\n\n\nColor of Night\nWriters :   Billy Ray  Matthew Chapman\nGenres :   Mystery  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:52.995505"}