{"title": "Confidence", "film_link": "/Movie Scripts/Confidence Script.html", "script_link": "/scripts/Confidence.html", "info_raw": "\n\nConfidence Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Doug Jung\nGenres  Crime  Drama\nScript Date : March 2000\n\nRead \"Confidence\" Script\n\n\n", "script": "\nconfidence\n\n\n    by\n\n Doug Jung\n\n\n\n\n             First Draft\n              March 2000\n\nBLACK:\n                       JAKE (V.O.)\n           So I'm dead...\nFADE IN:\nEXT. - BACK ALLEY- NIGHT (PRESENT)\nDumpsters overflow with the day's garbage. A pillar of\nsteam rises from an underground grate. It's the dark\nplace between buildings that a reasonable person avoids.\nWe see JAKE VIG, a guy in his late 20's whose fashionable\nsuit and good looks are in obvious contrast to the\nsurroundings-- At first glance, you'd think he could run\nfor Congress some day.  At first glance.\nJake faces a garbage dumpster on his knees, execution\nstyle. His face gives away nothing-- He could be kneeling\nin a strawberry field.\n                       JAKE (V.O.)\n           And I think it's because of this\n           redhead...\n                       BUTCH (O.S.)\n           Know who I am, Jake?\n                       JAKE\n           The Anti-Christ?\n                       BUTCH (O.S.)\n           No. I'm not the Anti-Christ. Or the\n           Prince of Darkness. I'm just a guy\n           looking for some answers.\nThere's the LOUD UNMISTAKABLE \"CLICK\" of a gun being\ncocked. The barrel of a gun slides gently along Jake's\near and comes to rest at the base of his skull.\nThe voice and the gun belong to BUTCH (40's). With his\nsuit and conservative looks, you'd make him out for a\n\"Steve\" or \"Roger\" more than a \"Butch\".\n                       BUTCH (cont' d)\n           Things are probably going to end badly\n           for you, Jake.\n                       JAKE\n           Gee... What makes you say that?\n                       BUTCH\n           Your life flashing before your eyes?\n                       JAKE\n           Just the last three weeks.\n\n                                         (CONTINUED)\n\n                                                               2.\nCONTINUED:\n                         BUTCH\n             That's not a bad place to start.\n                                                           CUT TO:\nEXT . - BACK ALLEY- NIGHT\nTitle: Three Weeks Ago...\nThe same alley... The door of a building bursts open as\nLIONEL DOLBY (late 40's), dressed in a cheap suit, stumbles\nout breathing heavy. The dim light of a bare bulb glares\noff the sweat on his forehead.\nA moment later, Jake emerges from the same door carrying\na large black revolver.\n                         JAKE\n             I lost my head. I'm... Sorry.    I don't\n             know what happened.\n                         LIONEL\n             Y-y-you fucking shot him!   That's what\n             happened!\n                        JAKE\n             I had to! That motherfucker was about\n             to welch! You saw what he was doing,\n             right? You heard him!\nLionel starts shaking his head spastically.\n                         LIONEL\n             I can't be here! You understand?     I\n             can' t--\n                         JAKE\n             Listen to me! It went to shit.     It\n             happens sometimes.\nIn the distance, A POLICE SIREN WAILS, growing louder.\n                         LIONEL\n             Oh Jesus!\n                         JAKE\n             LISTEN to me! We don't have much time.\n             We can still get through this but you\n             have to keep your head and trust me!\nJake takes a tentative step forward.     Lionel sees a BLOOD\nSTAIN on Jake's shirt and recoils.\nThe SIREN GROWS LOUDER, Jake turning his head towards it.\n\n\n\n\n                                             (CONTINUED)\n\n                                                               3.\nCONTINUED:\n                         LIONEL\n             What-- What do we do?\n                            JAKE\n             Help me.\nJake waves Lionel back through the door they came out of.\n                                                           CUT TO:\nINT. - THE EUCLID BAR\nA dive furnished with a few mismatched chairs and a bar.\nA single overweight PATRON sits at a corner table with\nface buried in his hands as he WHIMPERS. Jake and, Lionel\nDolby pass him as they emerge from a back hallway.\nMILES, late 20's, wipes blood off the bar. Placed at the\nedge of the bar are two briefcases, both open, both filled\nwith neat stacks of blood splattered money.\nA DEAD GUY lies face down on the floor in a pool of blood.\nJake grabs the Dead Guy's legs as Lionel watches in\ndisbelief.\n                           JAKE\n             Come on.    Grab his arms.\nLionel stands frozen.       Jake, drops the dead guy's legs\nwith a THUD.\n                         JAKE\n             Lionel... He's dead. Yeah, maybe you\n             didn't pull the trigger, but you were\n             standing right there and watched me do\n             it. Help me. Grab his arms.\nThe POLICE SIRENS grow LOUDER.\n                            MILES\n             Tick-tock...\n                         JAKE\n             If you wanna help, then help.    If not,\n             shut up.\n                            MILES\n             Your mess.\n                         JAKE\n             Then shut up.\n                            MILES\n             My place.\n\n\n\n                                             (CONTINUED)\n\n                                                             4.\nCONTINUED:\nMiles lets out a little chuckle; it's just enough to set\nJake off again.\nJake pulls the gun and points it at Miles.\n                            MILES\n             Oh please...\nMiles non-chalantly pulls a sawed off shot gun frown under\nthe bar.\n                         MILES (cont' d)\n             You think this kinda shit hasn't happened\n             here before? Given it's usually on\n             Thursdays. And usually, I gotta tell\n             the cops, \"No, Officer... I didn't really\n             get a good look at the shooters.\"\n             Usually anyway.\n                         PATRON\n                 (without looking up)\n             I didn't see nothing. And I swear if\n             you let me go now, I won't say-\n                         JAKE\n             Relax, porkchop.\nThe POLICE SIRENS sound like they're right outside.\n                         LIONEL\n             I can't be here!\nJake cocks his gun, never taking his stare off Miles.\n                            JAKE\n             Then go.\nLionel looks at the briefcases of bloodied money.\n                         LIONEL\n             What about... The money?\n                         JAKE\n             What about this situation makes you\n             think I can answer that question right\n             now?\nLionel again looks at the briefcases; then the shotgun\nleveled at Jake; then at the direction of the POLICE\nSIRENS... He runs for the door without a second thought.\n                                                         CUT T0:\n\n                                                             5.\n\n\nEXT.- THE EUCLID/CITY SIDEWALK- NIGHT\nLionel emerges up the stairs from the basement level bar\nto street-level just as a POLICE CAR SCREECHES to a halt\nin front of the bar, lights flashing, SIREN WAILING. On\nthe door is the emblem for the NEW YORK POLICE\nDEPARTMENT.\nLionel does his best to look casual as TWO UNIFORMED\nOFFICERS jump out of the car and rush the Euclid. One of\nthe Officers catches Lionel looking over his shoulder.\nThe last thing Lionel hears before he turns a corner--\n                      OFFICER (O.S.)\n          Everybody FREEZE!\nAs soon as he's turned the corner, Lionel breaks into a\nfull sprint down the street.\n                                                         CUT TO:\nINT.- THE EUCLID\nOFFICER WALTER SOBOZINSKI, a middle aged cop with a couple\nof spare tires, stands by the front door with his gun\ndrawn, in a dramatic stance.\n                      SOBOZINSKI\n              (yelling)\n          I said, freeze you motherfucking,\n          cocksucking, scumbags!\nThe second middle aged cop, OFFICER RICHARD ROTTOVICH\ncomes calmly down the stairs behind Sobozinski.\n                         ROTTOVICH\n          We're clear.\nRottovich closes the door and locks it behind him.\n                      SOBOZINSKI\n              (still yelling)\n          Or I'll blow off every one of your\n          fucking heads!\nSobozinski lets out a bellowing LAUGH.\nWe PAN OVER TO REVEAL Jake, Miles and BIG AL (the Patron)\nsitting at the bar by the Dead Guy.\n                      JAKE\n          Stop waving that thing around.\n                      MILES\n          You sure we're clear?\n\n\n                                           (CONTINUED)\n\n                                                            6.\nCONTINUED:\n                         ROTTOVICH\n             Guy looked like he was trying not to\n             shit himself.\n                 (re: the Dead Guy)\n             Nice.\n                         DEAD GUY\n             What took so fucking long?\nThe Dead Guy stirs-- GORDO, late 20's, dressed in a blood\nsoaked suit stands up; wiping blood off his face.\n                         DEAD GUY/GORDO\n             I've been lying in this shit like half\n             the night.\n                         MILES\n             You guys were late.   We had to go to a\n             Mexican stand-off.\n                         JAKE\n             And you know I hate guns.\nJake tosses the revolver on the bar.\n                         SOBOZINSKI\n             We were fighting crime.\n                         MILES\n             Keeping the city streets safe for drug\n             dealers and pedophiles everywhere.\nJake starts taking    the money out of the briefcases. Gordo\nstrips out of the    jacket and shirt, revealing a THIN WHITE\nVEST. A wire runs     from a battery pack on his belt, up\nthe center of the    vest, ending at a scorched, bloody,\nexplosive squib.\nGordo drops the vest along with a plastic bag containing\nfake blood. A nasty bruise on his chest marks the spot\nwhere the squib was.\n                         GORDO\n             Shit.\n                         JAKE\n             I told you, use less powder.\n                         GORDO\n             But you won't get that splatter effect.\nJake removes the blood stained bills from the top of the\npile.\n\n\n\n\n                                            (CONTINUED)\n\n                                                           7.\nCONTINUED:\n                         JAKE\n             Then these go into your cut.\nBig Al moves over to the bar.\n                         BIG AL\n             Hey, Jake... When am I gonna get to\n             play the Inside?\n                         JAKE\n             Gordo plays the inside.   You're the\n             Shill.\n                         BIG AL\n             Yeah, but come on... All I get to do is\n             cry and get insulted.\n                         JAKE\n             What are you talking about? You should\n             get a fucking Academy Award for the\n             Shill work you do.\n                 (off Al's smile)\n             We got it down cold, Al. You don't\n             want to jinx it by changing something\n             up, do you?\n                         BIG AL\n             I' m gonna go get eggrolls. Anyone want\n             eggrolls?\nAl slaps Jake on the back and exits.\nJake catches Gordo hawking over his shoulder.\n                          JAKE\n             What?   I can feel you looking at me.\n                         GORDO\n             That's a lot of cash. He came up with\n             it pretty quick.\n                         JAKE\n             Probably some investment banker or\n             convertible-bonds-broker-dickhead. Did\n             you see how fast he ran out of here?\n             It's done. He's not coming back.\n                         GORDO\n             I guess. I gotta drop a dime.    Did\n             anybody mess up the hoop?\n                           MILES\n             It's clean.\nGordo disappears dawn the back hallway.\n\n\n\n                                             (CONTINUED)\n\n                                                            8.\nCONTINUED:\nJake rubber bands two small wads of cash and hands them\nto Rottovich and Sobozinski.\n                            JAKE\n             Ten percent.\n                         SOBOZINSKI\n             You guys got sack, I'll give you that\n             much.\n                            JAKE\n             Confidence.     It's just confidence.\nSobozinski and Rottovich head for the door with their\nnewly padded pockets.\n                         ROTTOVICH\n                 (patting his pocket)\n             Feels a little light, Jake.    Next time\n             we're in for twenty.\n                          MILES\n             Twenty?   My ass!\n                         JAKE\n             What are you talking about?    Ten's\n             standard.\n                         ROTTOVICH\n             Yeah Well, Sobo's kid needs braces.\n                         SOBOZINSKI\n             Do you have any idea what those monks\n             charge for that medieval torture?\n                         JAKE\n             We got a good thing going here. You\n             want to blow it over an overbite?\n                         ROTTOVICH\n             Don't get me wrong, Jake. I like you\n             boys. You guys are the steadiest\n             business in town. But what can I say?\n             Twenty percent's still better than\n             what we give to any of the other\n             criminals.\n                         JAKE\n             All the shit we pulled with you and\n             you're trying to shake us down? You\n             guys got sack.\n                         ROTTOVICH\n             Was that a threat? Did I hear a\n             threat?\n\n\n\n                                              (CONTINUED)\n\n                                                              9.\nCONTINUED:\n                         ROTTOVICH (cont' d)\n             Last I remember, we were talking\n             economics, then this..? What happens\n             next time if we gotta stop and help a\n             little old lady cross the street? Well,\n             shit... Then we gotta pass the call to\n             someone else.\nSobozinski and Rottovich exit.\n                         MILES\n                 (shaking his head)\n             Cops...\n                                                          CUT TO:\nEXT. BACK ALLEY- NIGHT (PRESENT)\nButch shaking his head, still holding the gun.\n                           BUTCH\n             Grifters...\n                         JAKE\n             We can't all be model citizens such as\n             yourself.\n                         BUTCH\n             It's all about the money, isn't it?\n                         JAKE\n             Isn't it always?\n                                                          CUT TO:\nINT.- FOUR SEASONS HOTEL- NIGHT\nA suite in the upscale hotel. Miles answers a KNOCK on\nthe door-- An expensive CALL GIRL stands at the door in\nan overcoat.\n                         JAKE (V.O.)\n             It's what makes us run. And despite\n             what they say, it can buy you love.\n                         CALL GIRL\n             Are you ready for me, Ralph?\nShe lets the overcoat fall open, revealing her lack of\nclothing.\n                                                          CUT TO:\nINT.- PRADA STORE- NIGHT\nGordo stands in front of a mirror trying on a new suit.\nThe sales people fawn over him.\n\n                                            (CONTINUED)\n\n                                                            10.\nCONTINUED:\n                         JAKE (V.O.)\n             It can buy you a new and better you.\n                         GORDO\n             I just don't know if this says, \"me\".\n             What's the fabric?\n                                                         CUT TO:\nINT.- BIG AL'S APARTMENT- NIGHT\nBig Al has a cordless phone to his ear...\n                         JAKE (V.O.)\n             It can erase all those things about you\n             that you wish didn't exist.\n                         BIG AL\n             It's Alfonse. I want to settle up. I\n             haven't been ducking you. I told you\n             I'd get it.\nBig Al picks up a CHINESE TAKE-OUT MENU and leafs through\nit while on the phone.\n                                                         CUT TO:\nEXT.- SOHO STREET- NIGHT\nJake walks down the crowded street, passing the bars and\nrestaurants of SoHo. His jacket's buttoned up to hide\nthe blood stains.\n                         JAKE (V.O.)\n             It can make you think you're on top of\n             the world.\nJake passes a group of well-dressed, well manicured people\nwaiting in line outside of a trendy bar called \"Wax.\"\nAmong the hip and well dressed, he seems out of place at\nthe moment. An outsider.\nAn attractive blonde in her late twenties, LILY, bumps\ninto Jake.\n                         LILY\n                 (innocently)\n             Oops.\nShe throws Jake a smile he can't but help return. They\nstand for a second facing each other before she's whisked\naway by an OLDER MAN, dressed in an expensive suit.\n\n\n\n\n                                           (CONTINUED)\n\n                                                              11.\nCONTINUED:\nJake's smile fades as he watches her saunter into the\nbar, but not before she throws him another glance over\nher shoulder. Jake continues on into...\n                                                           CUT TO:\nINT.- NEIGHBORHOOD BAR- CONTINUOUS\nA semi-crowded bar.    Not hip and trendy like \"Wax.\"\nJake finds an empty stool at the end of the bar and orders\na drink. He takes a second to look around at the cliques\nof people talking, laughing, having a good time before he\npulls a newspaper out his coat pocket.\nJake takes a pen from the bar and opens to the crossword\nsection.\n                         JAKE (V.O.)\n             And if you believe that money can do\n             all that for you, you're the perfect\n             mark. Jack Kerouac said that if you\n             own a rug, you own too much. I don't\n             necessarily like Kerouac and driving\n             cross country isn't exactly my idea of\n             a good time, but the guy's got a\n             point...\nJake sits alone with his crossword puzzle.\n                                                           CUT TO:\nINT.- JAKE'S APARTMENT- LATER\nJake enters a sparsely furnished loft. The skyline of\nBrooklyn twinkles through dirty, picturesque windows.\nJake drops his keys on a table and hits a button on an\nanswering machine.\n                         ANSWERING MACHINE\n             You have no new messages.\n                          JAKE (V.O.)\n             If you've got nothing, you've got\n             nothing to lose. And when it comes to\n             money, finding it and losing it, you\n             always gotta remember how much of it's\n             just luck...\nJake stands his sparse little world, addressing the quiet\nbefore he fishes for his wallet, which he can't find.\n                         LILY (V. O. )\n             Oops.\n\n\n\n                                             (CONTINUED)\n\n                                                                12.\nCONTINUED:\nThe realization makes Jake smile.\nThen a FLAPPING SOUND spins him around to see a PIGEON,\nflapping up against the inside of a partially opened\nwindow.\nVisibly upset by the bird, Jake moves towards the window\nand pushes it wide, allowing the bird to escape.\n                         JAKE\n             Dumb fucking luck.\nJake stares out the window after the bird.\n                                                           CUT T0:\nINT.- DOLBY'S APARTMENT- NIGHT\nA nicer apartment than Jake's. Lionel Dolby, the Mark\nfrom the Euclid rushes around, haphazardly throwing\nthings into a suitcase. There's a KNOCK on the door that\nstops Lionel dead in his tracks.\nAnother KNOCK.       Lionel still frozen.\nThe door flies open with a      BOOM. In the doorway, we see\nHARLIN, an older mountain      of a man dressed in a plain\nblack suit. Behind him is       LUPUS (late-20's), dressed in\na sweatsuit a pilot could      spot from 20,000ft.\n                           LUPUS\n             Mr. Dolby.    King would like a word with\n             you.\n                         LIONEL\n             R-r-right now?\n                         LUPUS\n             Please. We have a car waiting.     I\n             apologize for the door.\n                                                           CUT T0:\nINT . - JAKE'S APARTMENT- MORNING\nA RINGING PHONE... Jake stirs on the futon oddly placed\non the floor in the middle of the room and picks up the\nphone.\n                           JAKE\n             Yeah.\n                         MILES (O.S.)\n             You better get over to Al's.    Now.\n\n\n\n\n                                             (CONTINUED)\n\n                                                            13.\nCONTINUED:\nMiles hangs up before Jake can answer.\n                                                         CUT TO:\nINT.- BIG AL'S- DAY\nJake stand's with Miles in the sparse living room. Big\nAI's body sits reclining on a Lazy Boy chair, eyes bulging\nopen. An open carton of food rests in his lap. A feast\nof take-out Chinese surrounds him. The TV blares an old\nepisode of \"The Little Rascals.\"\nThere's a singed, neat bullet hole in his forehead.\n                         MILES\n             I was supposed to meet him for breakfast.\n             He likes that new IHOP they just opened,\n             you know... He likes to order that thing.\n             The Rutti-Tutti-Fresh and Fruity thing\n             they got.\n                         JAKE\n             Miles...\n                        MILES\n             Sorry. I'm just... Look what they did\n             to him. Right in the middle of his egg-\n             foo-young.\nBig Al stares up at them with those bulging, vacant eyes,\nhis mouth hanging open. Jake reaches down and grabs the\nremote control and turns the TV off.\n                         JAKE (V.O.)\n             Big Al used to send money to his Father,\n             some Vietnam Vet slowly losing his mind\n             in a VA hospital in Cleveland. Al was\n             like that. That's why Al never played\n             the Inside.\n                                                         CUT TO:\nINT.- DINER- DAY\nGordo enters and takes a seat in the back booth with Jake\nand Miles.\n                         GORDO\n             Seems Lionel Dolby came down with a\n             sudden case of drowning last night.\nThey just pulled him out of the East River.\n                         JAKE\n             Well, this is just fucking great...\n\n\n\n                                           (CONTINUED)\n\n                                                            14.\nCONTINUED:\n                         GORDO\n             It gets worse. Now I know     why he was\n             such a good rope. X mean,     cash....\n             That much and we never had    to put him\n             on the \"Send?\" Turns out     this ducking\n             Moe was an accountant for    the King Pin.\nGordo throws Jake a hard look, letting the news sink in.\nJake can only slump back into the booth.\n                           MILES\n             Who's that?\n                         GORDO\n             The cash we fleeced off of him was\n             collection money. He was supposed to\n             take that money and give it to the\n             King earlier yesterday like he does\n             every Thursday. `Cept this time, he\n             figured he could make a little\n             something for himself off us and still\n             get the King's money back before any\n             body says \"boo.\"\n                         MILES\n             What's a King Pin?\nGordo looks to Jake, but can see that he's still processing\nthe information.\n                         GORDO\n             Currently, the King Pin is a very large-\n             type pole stuck up our asses.\n                           MTLES\n             Mob?\n                         GORDO\n             Independant. Same shit, just\n             independant. They call him the King\n             Pin because he looks like that guy from\n             the comic book... Big. Fat. Bald.\n                          MILES\n             So what?   We hide, right?\n                         GORDO\n                 (shaking his head)\n             What are you? New? Let me tell you\n             how good this guy is. Last night, Al\n             calls this bookie to settle up.\n             Apparently he's been ducking him for\n             like a month. So the guy asks him where\n             he's got all this money all of a sudden,\n             right? What does Al do?\n\n\n\n                                              (CONTINUED)\n\n                                                         15.\nCONTINUED:\n                         GORDO (cont'd)\n             Does he tell him that he cashed in a\n             fucking Bar Mitzvah bond? Does he tell\n             him he's been giving head out back for\n             twenty bucks a pop? No... He starts\n             going on about this job he just pulled\n             and how he fleeced some Wall Street\n             asshole -type... How HE fleeced.\n                         MILES\n             You're pissed we didn't get credit?\n                         GORDO\n             No, that was the only semi-fucking smart\n             thing he said! Except anybody that's\n             ever met Big A1 knows that the only\n             thing he's comfortable doing alone is\n             eating. This guys tells this guy, that\n             guy tells some other guy, eventually it\n             works it's way back to someone who works\n             for the King and--\nINSERT SHOT\nINT- BIG AL'S APARTMENT- NIGHT\nBig Al sits on the Lazy Boy, about to take a big bite of\negg foo young. He stops as the front door is kicked open\nwith a CRASH.\n                          GORDO (V.O.)\n             Shazaam.\nBig Al's eyes grow huge as we hear a LOUD BALM!!!\nBACK TO THE DINER\n                         GORDO (coat' d)\n             Big Al gets whacked mid-egg foo young.\n             The whole thing took about two and a\n             half hours. That's how good he is.\n                         MILES\n             We sure Big Al threw him to us?\n                          GORDO\n             Come on...\nAll three of them turn their attention out the window.\nThey watch the bustle of people walking past wondering if\nany one of them is looking back.\n                         JAKE\n             A bird flew into my house last night.\nGordo and Miles exchange a look, unsure of how to\nrespond.\n\n                                           (CONTINUED)\n\n                                                            16.\nCONTINUED:\n                         JAKE (cont'd)\n             It's bad luck.\n                         MILES\n             Just an idea, but let's just fucking\n             split. We'll meet up anywhere. Akron\n             or Austin or Atlanta. Anywhere...\n                         JAKE\n             He'll find us. We go talk to him.\n                             GORDO\n             Whoa.   What?\n                         MILES\n             We're going to give him the money back?\n                         JAKE\n             You know what we're doing with the money.\n                         GORDO\n             And what about Big Al?\n                          JAKE\n             Leave him. Someone's going to find him\n             eventually. Then they'll start looking\n             for us, too.\nA WAITRESS approaches.\n                         WAITRESS\n             What can I get you guys?\n                          MILES\n             Coffee.   And a valium.\nJake turns his attention out the window.\n                                                         CUT TO:\nEXT. - THE EUCLID-- DAY\nA basement bar in a crummy neighborhood. There's no sign,\nbut everything about it says, \"Condemned.\"\n                         JAKE (V.O.)\n             The Euclid was our place.\n                                                         CUT TO:\n\n                                                           17.\n\n\nINT.- THE EUCLID- DAY\nJake, Miles and Gordo sit at the bar of the run down\nwatering hole. Jake stands placing neat stacks of money\ninto a Fed-Ex box.\n                      JAKE (V.O.)\n          Gordo fleeced the deed off some idiot\n          in a card game. We used it every now\n          and then for a rag, but mostly it was\n          our office. Our Power Point.\nGordo and Miles start unloading the same neat stacks of\nmoney from their pockets. It's not as much as Jake put\nin.\n                        JAKE\n          That's it?\n\n\n                      MILES/GORDO\n          Bills.../Had that thing...\nShaking his head, Jake seals the Fed--Ex box, then hands\nthe form to Miles and. Picks up the phone.\n                      MILES (cont'd)\n          Do we want insurance?\n              (off their looks)\n          I'm just asking...\n                      JAKE\n          Just mail it to the hospital.\n              (dialing)\n          Mr. King, please. It's regarding an\n          accounting problem. Yes... Correct...\n          I know where it is. That will be fine.\n          Thank you.\nJake hangs up the phone.\n                        GORDO\n          When?\n                       JAKE\n          Tonight.   Just me.\n                        MILES\n          Fuck that.    We're going too.\n                      GORDO\n          Alright, let's all put our dicks back\n          in our pants for a second. Is this the\n          best thing to do?\nJake levels a stare at Gordo for a second.\n\n                                           (CONTINUED)\n\n                                                            18.\nCONTINUED:\n                         JAKE\n             Meet me at my place later.\n                         MILES\n             How do you know the King's going to let\n             you walk?\n                         JAKE\n             I'm getting a ride.\nJake picks up the phone and dials another number.\n                                                         CUT TO:\nEXT.- THE BULLDOG GYM- NIGHT\nA neon sign in the shape of a boxing glove tells you what\nkind of gym it is.\nA police car comes to a stop in front. Rottovich and\nSobozinski in the front seats. Jake gets out of the back.\n                         SOBOZINSKI\n             The King, huh? Nice going.\n                         JAKE\n             I try.\n                         ROTTOVICH\n             Don't dick around too long. And if he\n             stabs you or shoots you or causes any\n             other form of profuse bleeding, call a\n             cab because you are not getting back in\n             this car!\nJake nods and approaches the door where Harlin and Lupus\nstand vigil. Lupus wears another loud sweatsuit.\n                         HARLIN\n             We appreciate your punctuality.   Mr.\n             King is expecting you.\nJake takes a step towards the door, but is pushed up\nagainst The wall by Lupus who begins to roughly pat Jake\ndown.\n                         HARLIN\n             Lupus!\n                        LUPUS\n             What? You said pat him down, I'm pattin'\n             him down.\nHarlin shakes his head and pushes Lupus out of the way.\n\n\n\n\n                                           (CONTINUED)\n\n                                                             19.\nCONTINUED:\n                         HARLIN\n             It only takes a moment to be polite.\n             My apologies, Mr. Vig. If you wouldn't\n             mind?\nJake steps back and raises his arms.\n                          JAKE\n             You the one that did it?   You the one\n             that got Al?\n                         HARLIN\n             Mr. King prefers to farm out for that\n             kind of work.\n                 (gesturing to the\n                  door)\n             Please, after you.\nHarlin gives the Officers Sobozinski and Rottovich a slight\nnod of acknowledgment.\n                                                          CUT TO:\nINT.- BULLDOG GYM- CONTINUOUS\nHarlin and Lupus lead Jake through the cavernous gym.\nAll around them, huge, sweaty, boxers work the speed bag,\njump rope, spar, etc... There's not one that doesn't look\nlike he's spent some time in the State Penal Boxing League.\n                         JAKE\n                 (a little nervous)\n             Uh... Which one's the King Pin?\n                         HARLIN\n             He's in the back taking a steam.\nJake nods and let's out a silent sigh of relief.\n                                                          CUT TO:\nINT.- STEAM BATH- CONTINUOUS\nA huge room filled with steam. Harlin and Lupus stand by\nthe door as Jake cautiously steps in. NEW AGE MUSIC is\nbeing played-- Could be Yanni.\nSitting in a lounge chair, wearing a white terry cloth\nrobe is THE KING PIN. His large body is less fat than\njust big, constructed of circles and topped off with the\nbaldest head you've ever seen.\nA MANICURIST sits next to the King Pin working on his\nnails.\n\n\n\n                                            (CONTINUED)\n\n                                                            20.\nCONTINUED:\n                          KING PIN\n             Ow!   Watch the pinkie!\nThis isn't so bad.     Jake almost has to stifle a laugh.\n                         KING PIN (cont'd)\n             Every time, you get the pinkie and I\n             get a hang nail.\n                 ( to Jake)\n             You Jake?\nJake nods and the King motions for the manicurist to\nleave.\n                         KING PIN\n             Grifter huh? Where have you been on\n             the grift? Couldn't been here long\n             'cause I would have heard of you,\n             Skippy.\n                        JAKE\n             Jake. You can call me Jake.   Here and\n             there.\n                         KING PIN\n             Here and there, Scooter? Here and\n             there like Boston, Chicago, Houston?\n             The bay area? Some action in London,\n             `til it turned nickel and dime. Or how\n             about that little stint down in Miami?\n             Heard you actually got into some\n             trouble with the Feds down there. You\n             guy's pretty good?\n                         JAKE\n             I have a good crew.\n                          KING PIN\n             Minus one.\nJake visibly bristles...\n                          JAKE\n             Minus one.\n                         KING PIN\n             You know, back in the day, grafting was\n             considered a gentleman's racket. Good\n             suits, good food... The Underworld of\n             the Underworld. A grifter had to survive\n             on his wits, his instincts... I like\n             that. I like the idea of that.\n             These days, things being what they are,\n             guys like me gotta stay low.\n                 (MORE)\n\n\n\n                                           (CONTINUED)\n\n                                                            21.\nCONTINUED:\n                         KING PIN (cont' d)\n             It's all take, take, take . You can' t\n             just be fucking witty about it.\n                         JAKE\n             I guess it lacks a certain style.\n                         KING PIN\n             Of course, your line of work's only as\n             good as the people you find.\n                         JAKE\n             You can't cheat an honest man.\n                         KING PIN\n             You can't cheat an honest man.    But a\n             man like Lionel Dolby...\n                         JAKE\n             I apologize for the inconvenience.\nThe King picks up a long, metal nail file.\n                         KING PIN\n             Honest mistake. Just give me the money\n             back and all will be forgiven.\n                         JAKE\n             I can't do that.\n                         KING PIN\n             Why not?\n                         JAKE\n             Let me rephrase-- I won`t do that.\n                         KING PIN\n             Let me repeat-- Why not?\n                         JAKE\n             Because you killed one of my crew.\n                         KING PIN\n             Buddy, that was business. Besides, you\n             have more crew. Then there's you...\n                         JAKE\n             I'll get the money back, plus interest.\n             I go on the grift for you. You get a\n             cat, I get a cut. And we get square.\n                         KING PIN\n                 (laughing)\n             Fucking grifters! I love it! You got\n             balls, I'll give you that much.\n\n\n\n                                              (CONTINUED)\n\n                                                          22.\nCONTINUED:\n                          JAKE\n             No.   Just confidence.\nThe King Pin stands up and moves over to Jake.\n                         KING PIN\n             I' ll be honest with you, Kid. A\n             grifter comes in here with a fifteen\n             hundred dollar D-K-fucking-N-Y suit,\n             cooler than an Eskimo in winter and\n             tells me he wants to grift for me?\n             First thing I have to ask myself is,\n             is he playing for me or is he just\n             plain playing me? You tried it once.\n                         JAKE\n             We got caught. So you know it won't\n             happen again.\nWith surprising speed, the King Pin grabs Jake by the\nneck.\n                         KING PIN\n             I know it won't happen because you're\n             going to feel like a Prom Queen who\n             just got gang fucked by the wrestling\n             team!\nA few pained CHOKES from Jake as his knees buckle.\n                         HARLIN\n             Mr. Vig arrived with an escort.   NYPD.\nThe King loosens his grip and let's Jake fall.\n                          KING PIN\n             Grifters... Always working  an angle.\n             Alright. I can see you got   some vision.\n             But I give you the Mark. I   tell you\n             the who and you give me the  how. Lupus\n             go with him.\nLupus snaps to attention.\n                          LUPUS\n             What?\n                         KING PIN\n             Consider him part of your crew.\n             Consider him a part of me.\nJake begins to speak, but is silenced with a look.\n                          KING PIN\n             He goes.   Now let me see your hands.\n\n\n\n                                            (CONTINUED)\n\n                                                             23.\nCONTINUED:\nThe King picks up the nail file again.\n                         JAKE\n             Why?\n                         KING PIN\n             You ask a lot of questions.   Come on.\n                 (motioning with nail\n                  file)\n             Let me see `em.\nJake turns to find Lupus and Harlin on either side of\nhim. They take him by the wrists and hold his hands up\nfor the King.\n                         KING PIN (cont' d)\n             I don't like to ask things more than\n             once, Junior. I want you to know how\n             much that irks me.\nThe King begins to gently trace between Jake's fingers\nwith the nail file.\nJake remains rigid against Lupus and Harlin as the nail\nfile scrapes along the soft, fleshy webbing between his\nfingers.\nJake shuts his eyes... Then opens them to find the King\nnow gently stroking his hands-- Almost a loving caress.\n                         KING PIN\n             You have incredibly soft hands. Good\n             cuticles . They' re like a baby's hands.\n             Grifters with rough hands... You know\n             that they're probably not that good.\n             Means they've had to do some hard\n             labor to make ends meet. But you...\n             Smooth... Supple.\nThe King continues to stroke Jake's hands with his own\nmeaty paws.\n                         BUTCH (V.O.)\n             Are you insinuating that the King Pin\n             is of an alternative lifestyle?\n                                                          CUT TO:\nEXT. BACK ALLEY- NIGHT (PRESENT)\nJake shakes his head slowly.\n                         JAKE\n             I'm not saying anything. Besides, you're\n             one to talk. You're the one who's got\n             me on my knees in a dark alley.\n\n\n                                            (CONTINUED)\n\n                                                               24.\nCONTINUED:\n                         BUTCH\n             And these cops? What do they get?\n                                                            CUT TO:\nINT. - SQUAD CAR- NIGHT\nRottovich and Sobozinski sit staked out in front of a\nsmall cigar/magazine store.\n                            JAKE (V.O.)\n             Just a tip.\n                         SOBOZINSKI\n             What are we gonna do with this stuff\n             anyway? Heroin? What the hell do you\n             do with heroin?\n                            ROTTOVICH\n             You sell it.\n                            SOBOZINSKI\n             To who?\n                         ROTTOVICH\n             Don't be an idiot. How hard do you\n             think it is to sell one drug dealer's\n             drugs to another drug dealer? If Vig's\n             right, we might be looking at a hundred,\n             maybe a hundred fifty grand...\n                         SOBOZINSKI\n             You think this is a good idea?    We never\n             did this kinda shit before.\n                         ROTTOVICH\n             What's he going to do? File a missing\n             drugs report? If it works out, this\n             guy might be good for a few more turns.\nA hooded figure turns a corner onto the street, heading\nfor the Cigar Shop. He wears a knapsack slung over his\nshoulders.\n                         SOBOZINSKI\n             Hope so. Those fucking orthodontist\n             bills are killing me. One fifty every\n             time they tighten those bitches up.\n             One fifty! It's not even covered.\n                         ROTTOVICH\n             It's cosmetic. They don't cover\n             cosmetic.\n\n\n\n\n                                              (CONTINUED)\n\n                                                               25.\nCONTINUED:\n                         ROTTOVICH (cont' d)\n             Last year I had a tooth capped. The\n             dentist tells me I'm not covered for\n             caps. It's cosmetic.\n                                                            CUT TO:\nINT.- ANOTHER CAR- SAME\nParked across the street and well hidden among the other\nparked cars... SPECIAL AGENT GUNTHER MOONAN, a guy in his\nearly 40's in the kind of suit you'd find on a \"2--for-1\"\nrack. He sits pointing a TELESCOPE MICROPHONE out the\nwindow, wearing headphones. He chews on gum loudly.\n                         ROTTOVICH\n                 (O.S. from headphones)\n             Bullshit it's cosmetic! My fucking\n             tooth was cracked in half. I made the\n             son of a bitch write it in as a\n             cavity. The department's dental is for\n             shit.\n                         SOBOZINSKI\n                 (O.S. from headphones)\n             Whoa, whoa... There he is.\nWe HEAR the SOUNDS OF CAR DOORS OPENING, then SLAMMING\nSHUT.\nMoonan puts down the mic and hits \"STOP\" on a microcassette\nrecorder.\n                         MOONAN\n             Confessions of a poor brusher.\nMoonan takes a second to remove his gum, then checks his\nteeth in the rearview mirror.\n                                                            CUT TO:\nEXT.- STREET/BROOKLYN- SAME\nRottovich and Sobozinski walk quickly down the street.\nAhead of them, the hooded figure approaches, his hands\nburied in his pockets, a knapsack slung over his shoulder.\nAs he gets closer, we see that he's just a KID of about\nten or eleven.\nRottovich reaches over and pulls off the Kid's hood.\n                         SOBOZINSKI\n             You know who we are?\n                         KID\n             The heat.\n\n                                              (CONTINUED)\n\n                                                              26.\nCONTINUED:\nRottovich can't help smiling.\n                         ROTTOVICH\n             That's right. We're the heat.\n                 (yelling)\n             STICK `EM UP!\nThe Kid jumps back startled and throws his hands up.       The\ncops share a laugh.\n                         ROTTOVICH\n             Alright. Put your hands dawn.\n             What do you got in the bag?\n                         KID\n             Something for my Pops.\n                         ROTTOVICH\n             I see. Well, your Pops has been making\n             you carry around drugs for him. We're\n             going to have to take them.\nThe Kid hesitates for a second before handing the knapsack\nover. Rottovich opens it and pulls out TWO BRICKS OF\nHEROIN, wrapped in plastic. He nods to Sobozinski.\nThe Kid stays rooted right where he is, looking up at the\nDetectives like a lost puppy.\n                         KID\n             My Pops is going to be mad.\n                         ROTTOVICH\n             Give the kid a twenty.\nSobozinski fishes in his pocket starts to peel off bills\nfor the kid who then sprints away.\n                         SOBOZINSKI\n             What's the world coming to?\n             Everybody's on the friggin' take...\nRottovich and Sobozinski head off with the knapsack.\n                                                           CUT TO:\nEXT. - BACK-NIGHT (PRESENT)\nButch and Jake...\n                         BUTCH\n             Keeping the Fix happy.\n\n\n\n\n                                             (CONTINUED)\n\n                                                            27.\nCONTINUED:\n                         JAKE\n             You never know when you can use a crooked\n             cop.\n                         BUTCH\n             Keep going. I want to know how you got\n             Lionel Dolby.\n                         JAKE\n             So you want to know how to play the Big\n             Con.\n                         BUTCH\n             In this case, you might say I want to\n             know how not to play the Big Con.\nButch shoves the gun a little harder into Jake's head.\n                                                         CUT TO:\nINT.- BAR- NIGHT\nA trendy bar, dimly lit and packed. We PAN along the hip\ncrowd and STOP on Jake speaking with a SLICK GUY dressed\nin black Armani.\n                         JAKE (V.O.)\n             First thing about being on the grift....\n             You're only as good as your Mark. The\n             Roper's the guy who finds them.\nJake buys another round to the indifferent Slick.\n                         JAKE (V.O.)\n             They all have money one way or\n             another. Some of them come from money.\nTHE SCENE DOESN'T CHANGE--- Slick MORPHS into a FAT TEXAS\nBUSINESS MAN wearing a ten-gallon hat. He doesn't smile.\n                         JAKE (V.O.)\n             There's that saying-- Show me an honest\n             man and I'll show you a natural born\n             liar. There's always that little bit\n             of bad no matter how much good. It's\n             that little itch on the back of you\n             neck. You may not even know it's there,\n             but it is.\nThe Fat Texan MORPHS into a WALL STREET-type suit, who\nremains stoic as Jake reaches over for another round of\ndrinks.\n\n\n\n\n                                           (CONTINUED)\n\n                                                           28.\nCONTINUED:\n                         JAKE (V.O.)\n             A good Roper knows how to scratch it--\n             You the outdoorsy-type? \"I was just\n             fly fishing out in Montana\". You play\n             the market? \"I just got a tip on a\n             tech start-up IPO.\" You saw \"the\n             'Riverdance\" twice? \"I had a roommate\n             in college who was gay.\" Whatever...\nWall Street MORPHS into a THIN EURO-TRASH man who takes a\ndrink from Jake without even a \"thanks.\"\n                         JAKE (V.O.)\n             It means that in fifteen minutes we're\n             on good terms. Thirty, I'm your buddy.\nEuro-Trash MORPHS into an distinguished looking OLDER MAN\nas he takes a sip.\n                         JAKE (V.O.)\n             In an hour, I'm your best friend.\nJake punctuates some unheard point with a slap on his\nknee.\n                         JAKE (V.O.)\n             Give me a day and you'll let me do\n             your wife and daughter at the same time.\n             It's too late for you...\nJake looks up as the OLDER MAN MORPHS into LIONEL DOLBY,\nthe nervous mark from the earlier con.\n                         JAKE (V.O.)\n             I have your confidence.\nCLOSE-UP: Dolby's lips loosen in a wide SMILE.\nJake smiles back. He puts his drink down, then takes the\ndrink from Dolby. They remain talking as THE BACKGROUND--\n                                                 MORPHS INTO:\nEXT. - SIDEWALK-NIGHT\nUnder the light of a streetlamp, the two continue to\ntalk.\n                         JAKE (V.O.)\n             I tell you the \"Tale\"-- It's the story\n             of how we're going to make easy money.\n             No one gets hurt. And here's the guy\n             who's going to help. That's when you\n             meet the Insideman.\n\n\n\n\n                                           (CONTINUED)\n\n                                                            29.\nCONTINUED:\nGordo approaches, dressed in a suit and looking slightly\nanxious. Introductions are made.\n                         JAKE (V.O.)\n             The Insideman's the one with the know-\n             How, the scoop, the angle. But maybe\n             'you' re the suspicious type . So I\n             give you the \"Convincer.\" We both put\n             up a little and we get a little back.\n             Just a taste.\nGordo pulls an envelope out of his coat and gives it to\nDolby.\n                         JAKE (V.O.)\n             Just enough that when I tell you we can\n             make more off of it, you agree.\nJake speaks quickly to Dolby who nods emphatically.    He\nhands the envelope back to Gordo.\n                         JAKE (V.O. )\n             That`s when I put you on the \"Send.\"\n             You put in -a little, you got a little.\n             Put in a lot... I \"send\" you out for\n             mare.  As much as you can get.\n                                                       CUT TO:\nINT. - JAKE'S APARTMENT- NIGHT\nJake stands TALKING DIRECTLY TO CAMERA, loading a big,\nblack revolver with bullets.\n                         JAKE\n             Doesn't matter what the con is.\n             Insider trading, a line we got on   a\n             bookie club, insurance scam,\n             whatever... You saw the money and you\n             want it. More of it. Who cares   if you\n             have to bend the rules a little?  As\n             long as no one gets hurt.\nJake spins the gun cylinder then SLAPS it closed, pointing\nit straight at the CAMERA.\n                         JAKE (cont'd)\n             Then someone does...\nBLAM!!!\n                                                       CUT TO:\n\n                                                            30.\n\n\nINT. - THE EUGLID BAR- NIGHT\nA flash of Gordo's stunned face before his chest EXPLODES\nIN RED.\nJake stands holding the smoking gun.   Dolby looks around\nin shock.\n                      JAKE\n              (turns 'to face CAMERA)\n          Frankie Suits always said, that what\n          you have to understand about any\n          confidence game, is that it's like\n          putting on a play where everyone knows\n          their part... The Roper, the\n          Insideman, the Shills... Everyone\n          except for the Mark.\nGordo lying in a pool of blood...\n                      GORDO\n              (while playing dead)\n          I've been shot. Oh. The humanity.\nBig Al sits cowering at a table...\n                      BIG AL\n              (monotone)\n          God. No. Please.     Don't kill me.\nMiles casually washing glasses...\n                      MILES\n              (indifferent)\n          You better hurry. The police will be\n          here any second.\n              (breaking character)\n          I don't really understand my\n          motivation with this. Why am I washing\n          glasses?\n                      JAKE\n              (still facing camera)\n          Now you're an accomplice in a\n          homicide. Everything you thought you\n          were in control of just flew out the\n          window or is dripping down your leg.\nDolby turns to Jake, eyes wide, lips trembling in fear.\n                      JAKE\n              (turning to Dolby)\n          You should be running out the door,\n          desperate to forget this ever\n          happened, ready to repent your greedy\n          ways!\n\n\n                                         (CONTINUED)\n\n                                                            31.\nCONTINUED:\nDolby eyes the briefcases of money.\n                         DOLBY\n             What about... The money?\n                         JAKE\n                 (turns back to CAMERA)\n             Then there it is again... That little\n             itch. There's a guy holding a smoking\n             gun, a guy bleeding all over the floor\n             and still, all you can think about is\n             the money. You twisted fuck. So we\n             gotta give you the \"Blow-off\". We make\n             sure that you never, ever want to look\n             for us again. We get you off our backs.\n             Forever.\nJake stops for a second and listens... He points over his\nshoulder and on cue A POLICE SIREN WAILS in the distance.\n                         JAKE\n             And that's why you need the \"Fix\"...\nDolby bolts for the door without the money.\n                                                         CUT TO:\nEXT.- SIDEWALK- CONTINUOUS\nDolby tries to act casual as he walks away.\n                                                         CUT TO:\nINT. - THE EUCLID BAR- CONTINUOUS\nRottovich and Sabozinski enter the front door.\n                         JAKE (V.O.)\n             The New York Police Department's finest.\n             Half as smart and twice as crooked as\n             the guy they just chased away.\n                                                         CUT TO:\nEXT - BACK ALLEY- NIGHT (PRESENT)\nButch eases the gun off Jake's head.\n                         BUTCH\n             So how'd you get caught?\n\n\n\n\n                                           (CONTINUED)\n\n                                                              32.\nCONTINUED:\n                         JAKE\n             Suits used to say that in any con,\n             sooner or later someone's going to\n             start asking the right questions.\n             Usually, it takes a little longer.\n                                                           CUT TO:\nINT.- JAKE'S APARPMENT--NIGHT\nEmpty except for Gordo, Miles, Jake and Lupus, dressed in\nanother of his trademark loud sweatsuits.\n                         JAKE\n             We're working for the King.\n                         MILES\n                 (re: Lupus)\n             Wait a second... Who's the mope?\n                         LUPUS\n             I'm the King's eyes and ears.   Just in\n             case you decide to get cute.\n                         MILES\n             So we gotta short con our way out of a\n             hundred and fifty grand? That could\n             only take like, a year.\n                         JAKE\n             No. Big con. One rag. One rag and we\n             get out from under all this. But we\n             need another Shill.\n                         MILES\n             What do we need another Shill for?\n                         JAKE\n             Breasts.\n                                                           CUT TO:\nINT . - WAX--NIGHT\nA crowded night...\nLILY, the attractive blonde from earlier, flirts with a\nwell dressed, OLDER MAN who has his hand firmly planted\non her ass. She squeezes his hand and gives him a quick\npeck on the cheek before walking away. She takes a look\nat the man's wallet she just lifted before putting it in\nher bag.\nFrom out of nowhere, Jake bumps into her.\n\n\n\n\n                                             (CONTINUED)\n\n                                                           33.\nCONTINUED:\n                         JAKE\n                 (not so innocently)\n             Oops.\nJake takes her by the arm out to...\n                                                        CUT TO:\nEXT.- ALLEY/OUTSIDE BAR- NIGHT\nJake pushes Lily through the back door where she finds\nGordo, Miles and Lupus waiting. Her once flirtatious\ndemeanor is replaced by something harder.\n                         LILY\n             What is this? You guys cops or\n             something?\n                         JAKE\n             We're not cops.\n                         GORDO\n             You gotta be kidding me.       Her?\n                           JAKE\n             Yes, her.    Where's my wallet?\n                            LILY\n             Your what?\nJake takes her bag and dumps the contents on the floor--\nA few wallets, a watch, even a wedding ring. Jake picks\nup one of the wallets filled with cash.\n                            LILY (cont'd)\n             That's not--\n                         JAKE\n                 (pocketing the wallet)\n             You interested in a little work?\nLily scoops up her bag and finds a cigarette, eyeing them\nall suspiciously.\n                         LILY\n             Sorry about your wallet, but if you\n             think I'm going to suck dick over thirty\n             seven dollars, a waxed out Visa and a\n             bad fake I.D., you're fucking crazy.\n                 (lighting the cigarette)\n             Jake.\n\n                                                           34.\n\n\n                       JAKE\n          Take a deep breath and count to ten.\n          It's not that kind of work. You're\n          Lily, right?\n                      LILY\n          Says who?\n                      JAKE\n          You're working Daffy's block. He was\n          going to break your kneecaps. Pick-\n          pockets can be so bitchy sometimes. I\n          told him you were with us, so that's\n          two you owe me.\nLily takes a second to look the guys over. Miles gives\nher a wink. Lily slowly raises her middle finger at him.\n                      JAKE\n          We have work. It pays a lot. Unless\n          you figure on getting rich lifting\n          wallets while old guys feel you up.\n                      LILY\n          Oooh. Sassy. What do you care who\n          feels me up, Jake? Unless it kinda\n          gotcha going. Did it, Jake? Getcha\n          going?\nLily saunters to Jake with a seductive grin.\nJake may be aware that he's stopped breathing.\nShe puts her hands on Jake's chest and leans in a half\ninch more, her lips an eyelash away from his. She\nwhispers...\n                      LILY (cont' d)\n          Keep the wallet. We're even. Take a\n          deep breath... Count to ten... And go\n          fuck yourself.\nLily pushes past Jake and heads out of the alley.\n                      MILES\n          Is it just me or is there something\n          really hot about a girl telling you to\n          go fuck yourself?\nGordo gives Jake a nod of approval and Jake takes off\nafter Lily.\n                                                        CUT TO:\n\n                                                               35.\n\n\nEXT.- CITY SIDEWALK- NIGHT\nLily down the street, Jake giving chase.\n                       JAKE\n          Alright!   Hold up.    You win.   You got\n          the job.\n                      LILY\n          Gee thanks. Now I don't have to find\n          that bridge to jump off.\nJake catches up and blocks Lily's way.\n                      JAKE\n          We had to see what your deal was.      I'm\n          just a little superstitious.\n                      LILY\n          Here's my deal-- Don't waste my time.\n          What do you want me for anyway? You\n          don't even know me.\n                      JAKE\n          I just have a good feeling about you.\n          Haven't you ever had someone say they\n          had a good feeling about you before?\nLily studies Jake's face for any hint of sarcasm.      None.\n                         LILY\n          No.\n              (beat)\n          What's my cut?\n                      JAKE\n          You get an equal cut.\n                      LILY\n          What do I have to do?\n                      JAKE\n          Just play a part.     A little acting.\nLily steps back and hails a cab.\n                         LILY\n          Make a wish.\nShe points to a large digital clock hanging in a store\nwindow reading \"11:11p\".\n                       LILY\n          Eleven-eleven. If you're superstitious,\n          make a wish.\n\n\n\n                                            (CONTINUED)\n\n                                                              36.\nCONTINUED:\n\n\nLily hops into the Cab and tosses Jake's new wallet onto\nthe sidewalk.\n                         LILY (cont'd)\n             That's twice.\nThe cab pulls away.\nJake looks up at the clock-- \"11:12P\".\n                                                           CUT TO:\nEXT. - BACK ALLEY- NIGHT (PRESENT)\nButch smiles...\n                         BUTCH\n             I can see why you liked her.\n                         JAKE\n             That was it. We had our crew.    Now we\n             needed the Mark.\n                                                           CUT TO:\nINT.- THE EUCLID- DAY\nJake stands in front of the crew: Miles, Gordo, Lily and\nLupus.\n                         JAKE\n             Morgan Gillette.\nGordo and Miles both do their best to contain their\ndisbelief.\n                         MILES\n             Why?\n                         JAKE\n             Because that's who the King Fin wants\n             us to fleece. And Gillette's perfect...\n                                                           CUT TO:\nINT.- CITY BANK OF MANHATTAN/BOARDROOM--DAY\nA circle of BUSINESS MEN sitting at a conference table.\n                         JAKE (V.O.)\n             His grandfather used to run liquor\n             during prohibition and his father made\n             a bundle in illegal importing and\n             exporting. That makes him a third\n             generation crook.\n\n                                             (CONTINUED)\n\n                                                              37.\nCONTINUED:\n                         JAKE (cont' d)\n             He's been tied into pretty much\n             everything; drugs, mob, money\n             rinsing...\nWe PAN AROUND THE TABLE OF BUSINESS MEN and settle on\nMORGAN GILLETTE, a man in his early fifties with the\nsharp, angular features of a reptile. We STAY with\nMorgan as the meeting breaks and everyone heads for the\ndoor and into...\n                                                           CUT TO:\nINT. - CITY BANK OF MANHATTAN/HALLWAY-DAY\nGillette is greeted by a handful of SUITS.       Butch is with\nthem, staying in the periphery.\n                         JAKE (V.O.)\n             There's a story going around that he\n             helped fund the Contras back in the\n             eighties.\nGillette and his crew head through a large glass revolving\ndoor to...\n                                                           CUT TO:\nEXT.- CITY BANK OF MANHATTAN- DAY\nA busy mid-day New York sidewalk.       Gillette heads towards\na waiting Town Car.\n                         JAKE\n             Most of his money's clean. A lot of it\n             isn't. The best part is that we know\n             exactly where it is.\nAs Gillette and his crew disappear into the car, we PAN\nup to see the front of the building which has a large\nsign reading, \"City Bank of Manhattan; A Gillette Family\nCompany.\"\n                                                           CUT TO:\nINT.- THE EUCLID-- RESUMING\nJake looks over the crew, who are less than convinced.\n                         GORDO\n             How much we going after?\n                            JAKE\n             Two million.\nMiles lets out a whistle.\n\n\n                                             (CONTINUED)\n\n                                                              38.\nCONTINUED:\n                         GORDO\n             We only owe the King a hundred and fifty.\n                          JAKE\n             We get fifty percent.   And we get clear\n             of the King.\nJake looks over at Lupus for confirmation.\n                         LUPUS\n             That's worth it right there. You ask\n             me, I don't think you can do it.\n                          MILES\n             I'm with Jack LaLane.   That guy's\n             untouchable.\n                         JAKE\n             That's why we don't go after him\n             directly.\n                                                           CUT TO:\nINT.- CITY BANK OF MANHATTAN/LOBBY\nEmpty. The marble floor spotless, the dark oak teller\nwindows vacant, a row of desks.\n                         JAKE (V.O.)\n             We find a doable guy in Gillette's\n             bank... Someone about mid-level. Not\n             too high, not too low.\nA lone man, GRANT ASHBY, MATERIALIZES behind a desk on\nthe empty floor and sits behind a computer terminal.\n                         JAKE (V.O.)\n             We meet him with corporate papers,\n             inquiring about a corporate loan for\n             start up capital. The corporate papers\n             are in order, but we need things to\n             happen fast. Our guy fudges numbers in\n             the right places, moves our papers to\n             the top of the pile or to the bottom,\n             depending upon what we need.\n                           GORDO (V.O.)\n             How's that?    He works for Gillette.\n                         JAKE (V.O.)\n             We pay better.\n\n\n\n\n                                             (CONTINUED)\n\n                                                            39.\nCONTINUED:\nAn envelope stuffed with cash MATERIALIZES on the desk\nnext to Ashby.\n                                                         CUT TO:\nEXT . -- CAYMEN ISLANDS--DAY\nCrystal clear water gently rolls onto a white beach.\n                         JAKE (V.O.)\n             Our guy gets us approved for the start\n             up capital. But, the money can't be\n             transferred to any one person. On the\n             given day, the money's wired into a\n             corporate account in an off-shore\n             bank.\n                                                         CUT TO:\nINT.- GRAND CAYMEN'S BANK- DAY\nAnother empty bank... A lone TELLER MATERIALIZES behind\nthe counter.\n                         JAKE (V.O.)\n             That same day, I show up in the Caymens\n             with the proper I.D. and corporate papers\n             to make a withdrawal.\nJake MATERIALIZES on the empty bank floor, walking\nconfidently up to the Teller with a SILVER BRIEFCASE in\nhand.\n                           MILE5 (V.O.)\n             Uh...\n                           JAKE (V.O.)\n             What?\n                         MILE5 (V.O.)\n             I'm just thinking out loud here, but...\n             Two million in a briefcase?\n                           JAKE (V.O.)\n             Good point.\nJake approaches the Teller, now wheeling a BLACK SUITCASE\nbehind him by the handle.\nJake presents the Teller with a series of papers and a\nphoto I.D.\n                         JAKE (V.O.)\n             It's bank policy not to release this\n             money in cash because it's under a\n             corporate account.\n\n\n                                           (CONTINUED)\n\n                                                            40.\nCONTINUED:\nThe Teller turns to a computer printer and removes a\ncheck. Jake signs a few documents and places the check\ninto his pocket.\n                                                         CUT TO:\nEXT.- CAYMEN ISLANDS/STREET--DAY\nLined with shops and stores, but it's as empty as the\nbank. Not even a car: Jake strides out of the Grand\nCaymen's Bank and walks across the street to another\nbuilding with a sign reading \"BANK OF THE GRAND CAYMENS.\"\n                                                         CUT TO:\nINT.- BANK OF THE GRAND CAYMENS- DAY\nAgain, empty... Jake strides in and approaches the deserted\nteller counter.\nANOTHER TELLER MATERIALIZES and greets him with a smile.\n                         JAKE (V.O.)\n             So we cash the check at another bank.\n             Jake slides the suitcase and the check\n             over to the Teller.\n                                                         CUT TO:\nINT.- JFK AIRPORT/TERMINAL HALLWAY- DAY\nLike the banks, empty. Jake walks with the suitcase down\nthe flourescent lit hall towards a series of tables under\na sign marked \"Customs.\"\n                         JAKE (V.O.)\n             Now, this is the most important part--\n             You can't just walk into the United\n             States with a suitcase full of cash\n             without evoking the words \"cavity\n             search\".\nAs we get closer to the Custom's Desk, a CUSTOMS OFFICER\nwearing a white short sleeve shirt and a badge\nMATERIALIZES behind it.\n                         JAKE (V.O.)\n             That's why you need someone on the inside\n             at Customs.\nJake approaches and slides the suitcase towards him. The\nOfficer slides it back to Jake, revealing another envelope\nstuffed with cash under it.\n\n\n\n\n                                           (CONTINUED)\n\n                                                            41.\nCONTINUED:\nThe Officer literally looks the other way as he pockets\nthe envelope and waves Jake through the gate.\n                                                         CUT TO:\nEXT.- JFK AIRPORT- DAY\nJake exits the terminal. Outside, the street is empty,\nnot a traveler, an airlines rep, a luggage handler or a\ncab. Jake waits at an empty cross walk until the \"walk\"\nsignal is given.\n                         JAKE (V.O.)\n             Then we disappear.\nAs he walks away, WE SEE some PEOPLE MATERIALIZE carrying\nluggage... Then a FEW CARS... Then an AIRLINE REP...\nGradually more and more people and cars, each MATERIALIZING\ninto a normal scene at the airport until we lose Jake in\nthe crowd.\n                                                         CUT TO:\nINT.- THE EUCLID- RESUMING\nJake stops and gauges the crew for their reactions, which\nare the same all the way around-- Slack jawed disbelief.\n                         MILES\n                 (breaking the silence)\n             This might just be me, but that is hands\n             down, the dumbest fucking idea I've\n             ever heard.\n                         GORDO\n             People have tried this before, Jake.\n             It's never worked. Teddy Fraiser and\n             his crew went on vacation in Chicago\n             for it. Last year, Mumps got pinched\n             in L.A.\n                         JAKE\n             It never worked before because A, they\n             didn't flush the bank enough; B, their\n             corporate papers were for shit; C,\n             they didn't have someone on the inside\n             with Customs.\n                         MILES\n             Yeah, or D, it's a dumb fucking\n             idea...\n                         JAKE\n             Then what do you want to do, Miles?\n             Run?\n\n\n                                           (CONTINUED)\n\n                                                               42.\nCONTINUED:\n                         MILES\n             We never had a problem with that before.\n                         JAKE\n             Yeah, well we never had this kind of\n             problem before.\n                         MILES\n             What are you talking about? Yes we\n             have. And we would have been beautiful\n             about it. We would've had a bucket of\n             chicken delivered to the King with a\n             nice kiss my ass card attached to it.\n             Then we woulda moved on `til the next\n             local putz caught on.\n                         JAKE\n             We're getting a little old for\n             running.\n                         MILES\n             Yeah, well we're still a little young\n             for Albany State Prison. Are you pissed\n             about Al? I'm pissed too, but I' m not\n             like \"twenty-five to life\" pissed.\n                         JAKE\n             I'm getting clear of this. If you're\n             not going to do it for the fucking\n             principle, do it for the money. Gordo?\n                         GORDO\n             Yeah... Whatever, Jake.\n                          JAKE\n             No, not \"whatever.\" You're either in or\n             you' re out.\nA silence falls over everyone.\n                         LILY\n             I'm in.\nHer eyes stay on Jake as a smile grows across her face.\n                                                            CUT TO:\nEXT.- PAY PHONE- DAY\nJake dials a number...\n                         JAKE (V.O.)\n             I agreed with Miles. It was, hands down,\n             a dumb fucking idea.\n\n\n\n\n                                              (CONTINUED)\n\n                                                              43.\nCONTINUED:\n                         JAKE (V.O.)\n             But they bought it. Now I had to deliver\n             and I needed help.\n                         JAKE (into phone)\n             Yeah, it's Jake. How'd that tip work\n             out?\n                                                           CUT TO:\n\n\nEXT. BACK ALLEY- NIGHT (PRESENT)\nButch takes out a cigarette.\n                         BUTCH\n             But there were other factors.\n                         JAKE\n             Factors that weren't clear to me until\n             now.\n                                                           CUT TO:\nINT. - 16TH PRECINT/OFFICE- DAY\nAn office of empty chairs and desks. Through the windows\nwe can see the hustle and bustle of the precinct. SPECIAL\nAGENT GUNTHER MOONAN, still dressed in the same shitty\nsuit, sits behind a desk as Rottovich and Sobozinski\nenter.\n                          MOONAN\n             Gentlemen?   Special Agent Gunther Moonan.\nMoonan quickly flashes a badge and his best Kodak smile.\n                         ROTTOVICH\n             Special Agent?\n                         MOONAN\n             You are Officer Richard Rottovich. And\n             this would be Officer Walter Sobozinski.\n             I'm looking for Jake Vig.\n                          SOBOZINSKI\n             Who?\n                         MOONAN\n             I've been looking for this Jake Vig for\n             some time now. Problem is, the guy's\n             the invisible man. A spook, a spectre,\n             a ghost. Then, like a gift, Jake's\n             good buddy and member of his crew,\n             Alfonse Moorely, is found the other day\n             with a hole in his head.\n\n                                             (CONTINUED)\n\n                                                           44.\nCONTINUED:\nMoonan holds up crime scene photos of Big Al's body.\n                         MOONAN (cont'd)\n             Preliminary forensics suggests he was.\n             Sitting there, bloated and purple in\n             his egg foo young for at least seventy\n             two hours. Alfonse was not a small man\n             and there was a lot of food ordered, so\n             you can imagine the smell. Bad for the\n             neighbors, good for me because in all\n             the time I've been looking for Jake,\n             this is only the second time I've even\n             gotten a whiff of him.\n                         ROTTOVICH\n             Look Special Agent Moonan... We don't\n             know what you're talking about.\nMoonan takes out a microcassette recorder and hits PLAY.\n                         ROTTOVICH\n                 (V.O. from tape)\n             Don't be an idiot. How hard do you\n             think it is to sell one drug dealer's\n             drugs to another drug dealer? If Vig's\n             right, we might be looking at a\n             hundred, maybe a hundred fifty grand.\nCLICK.   Moonan kills the recorder.\n                         MOONAN\n             Oh yeah, I almost forgot. The two\n             serious looking gentlemen outside?\n             Internal Affairs.\nThe Officers look out the window to see TWO SERIOUS LOOKING\nMEN in suits.\n                         MOONAN\n             Do you want to know the first time I\n             had a line on Vig? He sent me a\n             birthday card.\n                 (off their silence)\n             Belated, but it's the thought, right?\n             Oh, this prick's got a sense of humor.\n             But, then again you guys probably know\n             him better than I do. In fact, I've\n             only met the guy once. But now, now I\n             have you. The next best thing. His\n             partners. His \"Fix.\"\n                         SOBOZINSKI\n             What do you want?\n\n\n\n\n                                           (CONTINUED)\n\n                                                         45.\nCONTINUED:\n                         MOONAN\n             You help me catch him. Whatever he's\n             into next, I want you to be into. And\n             what you're into, I'm into. If it all\n             goes well, those two guys from IAD will\n             never have to hear this tape. I'll\n             clear you guys of anything you've ever\n             done with Vig under the guise of some\n             cross-departmental investigation. This\n             prick's been on the wish list for so\n             long, you'll probably get gold shields\n             out of it.\n                         SOBOZINSKI\n             What do you get out of it?\n                         MOONAN\n             Peace of mind.\n                          SOBOZINSKI\n             That's it?\n                         MOONAN\n             Not everyone's on the take, Walter.\n                         ROTTOVICH\n             If you Feds are so hot for him, why\n             don't we just bring him in right now?\n                         MOONAN\n             I want him for something big and to do\n             that, we have to catch him in the act.\n                         SOBOZINSKI\n             This guy must have been a real pain in\n             your dick.\n                         MOONAN\n             Literally. It's not a bad deal,\n             gentleman. I get peace of mind. You\n             get Detective Sheilds. But this is the\n             best part, Walter... Walter, your\n             daughter will get to keep her braces\n             and have that winning smile. Capice?\nRottovich and Sobozinski remain silent.\n                         MOONAN\n             Good. One more thing... You gotta give\n             up the booty. I can't have you guys\n             running around with heroin.\nFREEZE FRAME ON MOONAN'S SMILING FACE.\n\n\n\n\n                                           (CONTINUED)\n\n                                                              46.\nCONTINUED:\n                         JAKE (V.O.)\n             Let me tell you something about Moonan...\n                                                          CUT TO:\nEXT. - BACK ALLEY- NIGHT (PRESENT)\nA serious look comes across Jake's face-- Hate.       Butch\neases back with the gun for a second.\n                         JAKE\n             He's just as crooked as the next guy.\n             You'd think he'd have more important\n             things to do with tax payer dollars.\n                         BUTCH\n             Cue the fucking violins.   Come on...\n             It's getting cold.\n                                                          CUT TO:\nINT. - THE KIEV DINER- DAY\nGordo, Miles, Jake and Lily next to him, all crammed into\na booth.\n                         MILES\n             Am I the only one who feels like we\n             can't make a move with this guy on us?\n                         LILY\n             We should ditch him.\n                         JAKE\n             Just watch every thing you say around\n             him. Every word, every move... It all\n             goes back to the King Pin.\nLupus exits the restroom, heading back towards the booth.\n                         GORDO\n             How's the hoop, superstar?   Clean?\n                         LUPUS\n             What is it with you and bathrooms?\n                         MILES\n             He doesn't like using a bathroom unless\n             he knows it's clean.\n                         LILY\n             Manly.\n\n\n\n\n                                            (CONTINUED)\n\n                                                            47.\nCONTINUED:\n                         GORDO\n             You laugh now, but wait until you need\n             a clean place to powder. This is New\n             York city, Sister. Public sanitation\n             does not run very high on the city hall\n             agenda. You know what you can get off\n             a toilet or doorknob? Let's do the\n             list... Hepatitis, influenza, the\n             flesh eating disease-\n                          JAKE\n             Here's what's going to happen. Gordo,\n             we need to find a guy in Gillette's\n             bank. Miles, we need papers, corporate,\n             insurance...\n                         MILES\n             Is it all fugasi?\n                          JAKE\n             No, the corporate papers have to be\n             legit. But you gotta score an I.D. A\n             clean one. Talk to Suits. I gotta get\n             us a Banker.\n                         LILY\n             What about Customs?\n                         JAKE\n             I'll worry about Customs.\n                         LILY\n             Hey, I' m not just along for the ride,\n             so I don't want to hear any bullshit\n             later about a smaller cut.\n                         JAKE\n             Take a deep breath. You sound like you\n             just broke up with your boyfriend or\n             something.\nJake rolls his eyes as Lily glares at him.\n                                                         CUT TO:\nINT.- BULLDOG GYM- DAY\nBoxers at the bags, a jumping rope, etc...\nJake and Lily stand in front of the King Pin, who's\ndressed in shorts and a t-shirt. He wears boxing gloves\nand headgear. Lupus and Harlin stand vigil by the\nsparring ring.\n                         KING PIN\n             How much?\n\n\n                                           (CONTINUED)\n\n                                                         48.\nCONTINUED:\n                         JAKE\n             I think two million.\n                         KING PIN\n             What do you need from me? Permission?\n             Go! If you can fleece him for two\n             million, then do it, Kid.\n                         JAKE\n             I need you to stake me.\n                          KING PIN\n             Stake you?\n                         JAKE\n             I need you to stake me. I can't do it\n             without it. It's just a couple hundred\n             grand. Taken out of our cut when we're\n             done.\nKing Pin eyes Jake suspiciously for a second.\n                         KING PIN\n             That's more than you already owe me.\n             What happens if you fuck this up?\n                         JAKE\n             Nothing ventured, nothing gained.\n                         KING PIN\n             Hey Skippy? Do I have the word \"chump\"\n             tattooed on my forehead?\n                         LILY\n             Mr . King, I think---\n                         JAKE\n                 (w/ a look)\n             Hey, I got it! Take some mental notes.\n             You just might learn something here.\nLily just shrugs and rolls her eyes.\n                         KING PIN\n             Listen, Scooter---\n                         JAKE\n             No, you listen. We're partners now and\n             even though I'm running the show for\n             you, I'm still running the show. That\n             means I get a little respect. So I\n             don't want to hear anymore of this\n             Scooter, Buddy, Junior, Skippy, Tiger,\n             bullshit. It's Jake.\n                 (beat)\n\n\n\n                                           (CONTINUED)\n\n                                                                  49.\nCONTINUED:\n                         JAKE\n             And I gotta tell you, for a guy who\n             spends all his time in a gym, you\n             could be in better shape.\nA few of the BOXERS training around stop and turn.          The\nKing Pin lowers a glare at Jake.\n                         KING PIN\n             Take off your shirt.\nJake looks behind him to see Harlin looming.\n                          JAKE\n             Excuse me?\n                         KING PIN\n             I said take off your fucking shirt.\nA few more BOXERS stop and turn. Jake notices he's being\nwatched. The King Pin takes a step towards Jake...\n                          JAKE\n             Fine. You want me to take it off, I'll\n             take it off.\nJake unbuttons his shirt and stands in front of the King\nPin, arms crossed. It's getting weird.\n                         KING PIN\n             Look at you, you skinny prick.\n                         JAKE\n             You're not going to bust out baby oil\n             and start rubbing me down or anything,\n             are you?\nThe King smiles and begins to take off his shirt.       Harlin\nand Lupus share an uncomfortable glance.\nThe King strips down to the waist and reveals an incredibly\nlarge, incredibly round stomach which he SLAPS loudly.\n                          KING PIN\n             Come here.   Feel this.\n                          JAKE\n             No thanks.   I'm good.\n                          KING PIN\n             Come here!\nThe King grabs Jake's hand and puts it on his stomach.\nIt just got weirder.\nNow the whole gym has stopped, everyone focused on Jake\nand the King Pin.\n\n                                              (CONTINUED)\n\n                                                                  50.\nCONTINUED:\n                         LILY\n             You guys are freaking me out.\n                        KING PIN\n             Shut up. Feel that? That's solid\n             muscle. Not an ounce of fat. Go ahead.\n             Punch it.\n                         JAKE\n             I am not going--\nThe King starts to get that look again.\nJake winds up and punches the King in the stomach.           He\nshakes his fist in pain.\n                           KING PIN\n             Come on.    Harder.\n                         JAKE\n             I think I just broke my hand.\n                           KING PIN\n             Harder.    Remember, I killed your buddy.\nJake's demeanor changes as he winds up and hits the King\nas hard as he can. The King just smiles.\n                           KING PIN (cont'd)\n             All muscle.\nThe King then hits Jake back in the gut with surprising\nspeed. Jake falls to his knees, but the King's right\nthere. With one arm he pulls Jake up and starts to pummel\nhim in the stomach with an unbridled visciousness.\nJake spits up blood as the King hurls him face first into\nthe ring.\n                         KING PIN\n             Maybe it's true. Maybe you can't cheat\n             an honest man. Me? I'm about as\n             dishonest as they come and that's the\n             truth. But if you even think about\n             trying to con me they'll find fucking\n             pieces of you in each of the five\n             boroughs. Pieces of you, pieces of\n             her, pieces of your whole crew. Can't\n             be any mare honest than that. I'll\n             stake you, but that's three hundred\n             fifty you're in the hole and consider\n             the juice running. Now go make me proud.\nHarlin and Lupus lift Jake up.        Lily looks at Jake with a\npained expression.\n\n\n\n                                               (CONTINUED)\n\n                                                          51.\nCONTINUED:\n                         JAKE\n             You get all that?\nEveryone in the gym goes back to their workouts.\n                                                       CUT TO:\nEXT. - BACK ALLEY (PRESENT)\nButch lets out an easy laugh.\n                         BUTCH\n             Nice.\n                         JAKE\n             We got our stake. Now we need to find\n             our guy in Gillett's bank.\n                                                       CUT TO:\nEXT. - CITY BANK OF NEW YORK DAY\nA flood of people exit the bank at the end of the day.\nJake, Lupus, Lily, Miles and Gordo wait by the side of\nthe building. Miles reads off a piece of paper.\n                         JAKE (V.O.)\n             What you're looking for in a mark is\n             someone who's weakness you can exploit.\n                         MILES\n             Michelle Strigo. Loan officer.\nMiles points out a woman crisply dressed in a suit,\nMICHELLE STRIGO. They follow her down the street.\n                         JAKE (V.O.)\n             Guy like me, with people like that...\n             I'll tell you what you're looking for\n             without even meeting you. It's like a\n             personal ad you wear over your head.\nJake watches as she hails a cab. A MAN, also hailing a\ncab goes for the same one. Michelle gets into a screaming\nmatch with the man.\nFREEZE FRAME ON MICHELLE--- A CGI SIGN appears over her\nhead \"Single, volatile, confrontational woman seeks \"man\"\nfor economic security and house chores.\"\n                         JAKE\n             No.\n                                                       CUT TO:\n\n                                                           52.\n\n\nEXT. - CITY BANK OF NEW YORK-NEXT DAY\nA flood of people exit the bank at the end of the day.\nJake, Lupus, Lily, Miles and Gordo wait by the side of\nthe building.\n                         MILES\n          Jay Houlser.     VP International finance.\nMiles points out a JAY HOUSLER, a young guy in suit.\nThey follow him...\n                                                        CUT TO:\nINT.- TRENDY RESTAURANT- NIGHT\nJake and the others watch Jay standing around the bar\nsilently scoping the place with a group of young\ntucks(dressed oddly alike).\nFREEZE, FRAME ON GROUP-- A CGI SIGN appears over their\nheads: \"YOUNG WALL STREETERS seek acknowledgement of\nmonetary earning potential from Supermodel-types ages 20-\n25.\"\n                         JAKE\n          No.\n                                                        CUT TO:\nEXT. - CITY BANK OF NEW YORK- NEXT DAY\nThe same flood of people exit the bank... Jake, Lupus,\nLily, Miles and Gordo wait by the side of the building.\n                      MILES\n          Alice Tanner. Finance Director.\nMiles points out ALICE TANNER, a mousy looking woman in a\nbad skirt. She gets to the intersection and waits for\nthe light to change, even as hordes of others jaywalk the\nway New Yorkers do.\nFREEZE FRAME ON ALICE-- A CGI SIGN appears: \"Single woman\nlooking for opportunity. Plays by the rules and willing\nto claw her way up to middle management.\"\n                         JAKE\n          No.\n                                                        CUT TO:\n\n                                                              53.\n\n\nEXT. - CITY BANK OF NEW YORK- NEXT DAY\nAgain the flood of people.       Again Jake, Lupus, Lily, Miles\nand Gordo wait.\n                         MILES\n          Grant Ashby.     VP of Corporate Loans.\nMiles points out a GRANT ASHBY, a schlubish middle aged\nbalding guy walking down the street. They follow.\n                                                           CUT TO:\nINT.- THE BULL AND THE BEAR PUB- NIGHT\nDark oak and brass, the bar plays host to legions of\nSuited Urban Professionals gathered in cliques.\nJake and the others watch as Ashby makes his way through\nthe crowd, taking a seat alone at the bar.\nFREEZE FRAME ON ASHBY-- A CGI SIGN appears over his head:\n\"SINGLE MALE seeks end to safety of tedious and solitary\nlifestyle. Moral and ethical constitution flexible.\"\n                      JAKE (V.O.)\n          What you're looking for in a      mark is\n          someone who's got nothing to      lose. No\n          friends, no family, no life.       You're\n          looking for a guy who doesn't      own a\n          rug.\nJake watches as Ashby orders a drink and pulls a\nnewspaper from his coat. He opens it to the crossword--\nJust like Jake would.\n                         JAKE\n          Him.\n                         MILES\n          You sure?\nJake watches Ashby do the crossword puzzle alone.\n                         JAKE\n          I' m sure.\n                                                           CUT TO:\nINT.- GARMENT DISTRICT/WAREHOUSE- DAY\nJake, Miles, Gordo, Lily and Lupus enter a warehouse\nhousing racks of clothes.\n\n\n\n\n                                             (CONTINUED)\n\n                                                              54.\nCONTINUED:\n                         JAKE\n             Now we had the con and the mark.    We\n             needed to look the part...\nThey're greeted by FRANKIE SUITS, an ancient rake-thin\nman, perfectly coiffed and exceptionally dressed.\n                         JAKE (V.O.)\n             Frankie Suits was a legend in certain\n             circles. He. Was on the grift since\n             he was ten.\n                         FRANKIE\n             Last of the red hot grifters.\nSuits grabs Jake with a hug.     It's a heartfelt one.\nThe others exchange greetings with Suits who moves over\nto Lupus and studies his loud sweatsuit.\n                          JAKE (V.O.)\n             Back in the day, Suits made money\n             running fight stores and the wire with\n             a Fix so tight it was like a legit\n             business. I never understood what the\n             point was if grifting became like a\n             regular job.\n                         JAKE\n             We need wardrobe.\n                         FRANKIE (re: Lupus)\n             So I see. In from Long Island?     You\n             fellas take a look around.\n                         GORDO\n             Hey Suits? You got anything in like a\n             eleven or twelve ounce Super 100 worsted?\nMiles gives him a look like he's speaking latin.\nJake and Lily follow Suits into...\n                                                           CUT TO:\n\n\nINT.- SUITS' OFFICE- DAY\nA spare little office piled high with clothes. Suits\nreaches into a desk drawer and pulls out a large envelope\nand slides it to Jake.\n\n\n\n\n                                             (CONTINUED)\n\n                                                               55.\nCONTINUED:\n                         SUITS\n             Corporate papers with the New York State\n             seal, insurance documents with a proof\n             of bonding and some fugasi financial\n             records. There's also the I.D. you\n             asked for. Corporate papers with the\n             New York State seal, insurance documents\n             with a proof of bonding and some fugasi\n             financial records. There's also the\n             I.D. you asked for.\nJake takes out the papers and gives them the once over.\nHe then puts an envelope thick with cash on the desk.\n                            JAKE\n             Aces, Suits.\n                           SUITS\n             Not easy   pickin's. Papers like these\n             speak to   larger issues. Sorry about\n             Alfonse.\n                 (off   Jake's nod)\n             You into   something big?\n                            JAKE\n             Pretty much.\n                         SUITS\n             In over your head?\n                            JAKE\n             Pretty much.     Suits eyes Lily.\n                         SUITS\n             Can I speak to you in confidence?\n                           JAKE\n             Huh?   Oh.   She's alright.\nSuits gives Lily another suspicious look.\n                         SUITS\n             Try and keep up... You ask for      the\n             Advantage Goods, then you guys      come in\n             looking to be Bean Traps. So I       gotta\n             think you're either working the      mace or\n             playing the Jug Mob.\n                         JAKE\n             A little bit of both.\nLily watches in utter confusion.\n                         SUITS\n             Hey, I been on the ramp all my life, so\n             I got no problem with the way you help\n             yourself, Jake.\n\n                                                 (CONTINUED)\n\n                                                         56.\nCONTINUED:\n                         SUITS (cont'd)\n             I saw you go up from the Knecker,\n             working that Grind, learning the\n             Barnard's Law and I thought, \"the\n             kid's a prodigy.'\" But I know that if\n             you're using these goods... So then I\n             figure, what's worth that? You're\n             either looking for a little history or\n             a retirement fund. Who's the Mark?\n                          JAKE\n             Can't say.\n                         SUITS\n             Then who's the Banker?\n                          JAKE\n             The King.\nA dead look comes over Suits.\n                         SUITS\n             The King? Jake, you play the heavy\n             rackets like that... They put the lug\n             on for nothing at all.\n                         JAKE\n             I can handle it.\n                         SUITS\n             I don't doubt your talent. You looking\n             for that place in the hall of fame?\n                         JAKE\n             It's not history.\n                         SUITS\n             So what do you want?\n                         JAKE\n             I want to get out from under all this\n             for good. And I want to fuck them all\n             doing it.\n                         SUITS\n             Then I gotta say, in my opinion, you\n             can't get what you want.\nJake considers those words for a moment.\n                          JAKE\n             Yes I can.\nSuits guages the seriousness in Jake's face and nods.\nThe he gently rests his hands on the papers.\n\n\n\n                                           (CONTINUED)\n\n                                                                   57.\nCONTINUED:\n                           SUITS\n             Still time.\n                         JAKE\n             Can't do it Suits.      I can't lay down\n             for this one.\n                         SUITS\n             Okay. Here's the thing... You fall\n             flat, you might not get anything short\n             of stiffed. Then it's Blue River Land\n             for everybody. Papers like these are\n             dangerous because papers tend to\n             multiply, then they start to take\n             shape. Usually it's the shape of an\n             arrow. I hate to do it, but after this,\n             I gotta give you the blowoff.\n             We Jake, Jake?\nSuits holds out his hand.         Jake takes it.\n                           JAKE\n             We're Jake.\nThey shake, knowing it'll be the last time.\n                                                              CUT TO:\nINT.- GARMENT DISTRICT/WAREHOUSE- CONTINUOUS\nWe follow Lily and Jake out of Suit's office.           Lily can\nsee that it's thrown Jake a bit.\n                         LILY\n             What the hell's his problem?\n                         JAKE\n             Don't worry about it.\n                         LILY\n             It's just that I left my asshole decoder\n             ring at home, so how do I know not to\n             worry?\nJake stops and turns to her, looking her up and down.\n                         JAKE\n             You need to get a haircut.\n                           LILY\n             What?\n                         JAKE\n             And some new clothes.\n                           LILY\n             Why?\n\n                                               (CONTINUED)\n\n                                                            58.\nCONTINUED:\n                         JAKE\n             We're going to rope this banker\n             tomorrow and you gotta at least look\n             classy, if not be classy. You gotta do\n             this thing and I don't even know if\n             you can.\n                         LILY\n             You're just going to have to trust me.\n                         JAKE\n             I don't trust anyone.\n                         LILY\n             Then show me how.\n                                                         CUT TO:\nINT. - TIFFANY'S - NIGHT\nJake and Lily enter the store. Jake takes a quick moment\nto case the place-- A few scattered CUSTOMERS, some being\nhelped by SALESPEOPLE. All the Customers look like the\nuppercrust crowd you'd expect at Tiffany's.\n                         JAKE\n                 (to himself)\n             Oh yeah. This is good. This will do\n             nicely.\n                 (to Lily)\n             This is about confidence. Your\n             confidence and their confidence. You\n             get their confidence by giving them\n             yours.\nJake leaves Lily by the front counter as he starts a slow\nturn around the store.\nHe casually pretends to be browsing as he moves next to\nMR. LEWIS, an older, distinguished looking gentleman,\nbeing helped by a SALEGIRL, who is scribbling on an order\nform.\n                         SALESGIRL\n             Let me read this back. One silver\n             Cattier watch, engraved-- \"To Carolyn,\n             the Attorney at Law. Happy Graduation,\n             Counselor. Love Mom and Dad.\"\n                         MR. LEWIS\n             Right.\n                         SALESGIRL\n             One bracelet, engraved \"To Abby.   Happy\n             25th Anniversary, Love Tom.\"\n\n\n\n                                           (CONTINUED)\n\n                                                           59.\nCONTINUED:\n                          MR. LEWIS\n             Perfect.\n                         SALESGIRL\n             I' ll just go put this in, Mr. Lewis.\nThe Salesgirl takes the order form and walks away.\nA change comes over Jake. It's subtle-- Posture, facial\nexpressions, a slight tug of an accent-- but it's there.\n                          JAKE\n             Mr. Lewis?\nMr. Lewis turns and looks at Jake. There's no real hint\nof recognition, but Jake's smiling up at him like an old\nfriend.\n                          JAKE\n             It is you.   Hello!\nJake extends his hand.\n                          MR. LEWIS\n             Sorry, I--\n                         JAKE\n             Jake. Jake Pearson. I go to lawschool\n             with your daughter. Carolyn. We met\n             once or twice.\nMr. Lewis seems to search for second, then extends his\nhand more in an effort not to appear rude.\n                          MR. LEWIS\n             Of course.   Jake. Nice to see you.\n                         JAKE\n             Well, it certainly is a coincidence.\n             Here of all places! How is Mrs. Lewis?\n                          MR. LEWIS\n             Great.   Thank you.\nThe Salesgirl returns.\n                         JAKE\n             Excuse me? I believe you're holding\n             something far me under Pearson.\n                         SALESGIRL\n             Do you have a ticket?\n\n\n\n\n                                           (CONTINUED)\n\n                                                           60.\nCONTINUED:\n                           JAKE\n             You   know, this is kind of embarassing,\n             but   my wallet was stolen yesterday and\n             I'm   afraid the ticket was in it. But\n             the   name's Pearson.\n                         MR. LEWIS\n             While you're back there, could you make\n             sure that Carolyn is spelled with a\n             \"y\"?\nThe Salesgirl nods and disappears again.\n                         MR. LEWIS (cont'd)\n             What brings you down from Boston, Jake?\n             Taking advantage of the long weekend?\n                         JAKE\n             My wife and I are just taking a little\n             vacation.\nBehind his back, Jake discreetly waves Lily over.\n                         MR. LEWTS\n             Carolyn's down this weekend too.\nLily approaches. When she does, Jake pulls her close and\ngives her a loving kiss on the lips. It throws Lily for\na second.\n                         LILY\n             Uh... Everything okay?\n                         JAKE\n             Honey, this is Mr. Lewis. Carolyn\n             Lewis's father. Mr. Lewis, this is my\n             wife, Lily.\nLily and Mr. Lewis exchange handshakes.\n                         JAKE\n             I'm sorry, honey.    I'm almost done.\nJake taps Lily on the back with the hand wrapped around\nher waist.\n                           LILY\n             It's okay.    I'll be looking for\n             earrings.\nJake gives Lily another kiss before she leaves.\n                         MR. LEWIS\n             Attractive girl.\n\n\n\n\n                                             (CONTINUED)\n\n                                                           61.\nCONTINUED:\n                           JAKE\n             Thank you.    Actually, it's our first\n             anniversary   this weekend. She thinks\n             I'm here to   pick up something for my\n             mother, but   it's actually a gift for\n             her. Think    I've fooled her?\n                         MR. LEWIS\n             Take it from me, you never do. But\n             congratulations. Nice to be married,\n             isn't it?\n                         JAKE\n             Very much so.\nJake smiles ear to ear, like the happy newlywed he's\npretending to be. The Salesgirl returns.\n                         SALESGIRL\n             We have Carolyn with a \"y\". I'm sorry,\n             there's nothing under Pearson. If we\n             had an invoice number--\nJake's smile dissolves as he grows a little anxious.\n                         JAKE\n             I told you. My wallet was stolen.\n             Please... Check again.\nJake takes a nervous look over at Lily, who is drying on\nearrings with another Salesperson.\n                           MR. LEWIS\n             Good luck.    Congratulations again.\nHe and Jake shake hands.\n                         JAKE\n             Thank you, sir. You know, I hope this\n             isn't too much of an inconvenience, but\n             if Carolyn is coming down for the\n             weekend, perhaps I could give you\n             something for her? It's a check. We\n             split the cost on a few books and I\n             haven't had the chance to pay her back\n             yet. Could you..?\n                           MR. LEWIS\n             Sure.\nJake pulls out a checkbook and pen.\n                         JAKE\n                 (writing)\n             That'd be a great help.\n\n\n\n                                             (CONTINUED)\n\n                                                          62.\nCONTINUED:\nThe Salesgirl returns.\n                          SALESGIRL\n             I'm sorry.   Nothing under Pearson.\n                         JAKE\n             You're sure? This is... Just a\n             complete disaster.\n                            SALESGIRL\n             What was it?\nJake quickley scans the jewelry in the glass case.\n                         JAKE\n             A ring for my wife. Alot like that\n             one. In fact, it was that one.\n                         SALESGIRL\n             That's no problem. We have those in\n             stock.\n                         JAKE\n             Thank you. Sorry, I'm just a little\n             anxious to give it to her. You take\n             out of state checks?\n                         SALESGIRL\n             With identification.\nJake stops writing on the check and locks up.\n                         JAKE\n             I understand that, but I had my wallet\n             stolen last night. Is there any way..?\n                            SALESGIRL\n             I'm sorry.\nJake's anxious look comes back.\n                         JAKE\n             I know it's policy, but...\n                 (looking over at Lily)\n             The thing is... It's our first\n             anniversary and we're only in town for\n             the weekend. It's a very, very special\n             night for my wife and I. This ring is\n             my gift to her and I think she's going\n             to really love it. I can give you\n             phone numbers to call for people\n             who'll vouch. I can send you I.D.\n             later...\n\n\n\n\n                                            (CONTINUED)\n\n                                                            63.\nCONTINUED:\n                         SALESGIRL\n                 (sympathetic)\n             I'm sorry.\n                         JAKE\n                 (clearing his throat)\n             This is embarrassing.\n                         MR. LEWIS\n             Jake?\nJake looks up and rips the check out from his book.\n                         JAKE\n             I'm sorry, sir. Thank you very much\n             for doing this. And please tell Carolyn\n             hello for me.\nJake seems to be lost. Mr. Lewis looks over at Lily, who\ngives him a friendly smile, then back to Jake.\n                         MR. LEWIS\n             Why don't you let me put the ring on\n             the card and you can write me a check\n             in return?\nUnseen to Mr. Lewis, one corner of Jake's lip goes up in\na grin.\n                                                         CUT TO:\nEXT.- TIFFANY'S/SIDEWALK--NIGHT\nJake and Lily exit the store.     Jake hands Lily the\ntrademark colored box.\n                         JAKE\n             Happy anniversary.\nLily takes the box and shakes her head, impressed. Jake\nLooks up to see Mr. Lewis watching them as he tries to\nhail a cab.\nJake's demeanor quickly changes as he puts on a big smile.\n                         JAKE\n             Smile. You just got a present from the\n             man of your dreams.\nLily puts on a big smile while opening the box.\n                         JAKE\n             Now we gotta give him a strong finish.\n\n\n\n\n                                           (CONTINUED)\n\n                                                           64.\nCONTINUED:\nJake pulls Lily closer and looks into her eyes. She leans\nin and they kiss-- A deep, slow kiss that makes people\nhave to walk around them.\nMr. Lewis sees them and smiles to himself as he gets into\na cab.\nJake and Lily are still kissing as the cab pulls away.\nLily finally breaks the kiss--- Slowly.\n                          LILY\n             He's gone.\n                          JAKE\n             Uh-huh.\n                         LILY\n             I gotta go get a haircut.\n                          JAKE\n             Uh-huh.\nJake watches as Lily walks away. She looks back at Jake\nonce before disappearing around a corner.\n                                                        CUT TO:\nINT.- SIXTEENTH PRECINT- DAY\nMoonan sits on a desk, ear to a phone.\n                         JAKE (V.O.)\n             It was all in play. Everything...\n                         MOONAN\n             It's Moonan... I'm in New York.\n             Listen, I got Vig. He's here and I'm\n             this close... Look, I understand that,\n             but I'm telling you this time...\n             Obsessive is a big word to use...\n             Goddamn it, Lou! I'm telling you, this\n             is it. Yeah... I figured you'd feel\n             that way. So here's the deal... Call\n             Kylie over at the Bureau. Tell him I\n             got something that might interest him.\n             A guy they call the King Pin. I think\n             there may be a corruption case brewing\n             here, too... That's right. So even if\n             I don't get Vig, you'll still have\n             something to show.\nRottovich and Sobozinski enter.\n\n\n\n\n                                          (CONTINUED)\n\n                                                             65.\nCONTINUED:\n                         MOONAN (cont' d)\n             Good... I gotta go.\n                 (hanging up)\n             So, what do you have for me?\n                         SOBOZINSKI\n             Whaddya mean? We got dick.\n                         MOONAN\n             You guy's are not working with me here.\n             I just got off the phone with my boss.\n             After he got done ripping me a new\n             Lincoln Tunnel size asshole, he let me\n             know exactly how little I'm welcome\n             back if we come up short. And now here\n             you guys are, WASTING MY FUCKING TIME!\nMoonan kicks a chair across the floor.\n                         ROTTOVICH\n             Like we told you before, we think he's\n             into something with the King Pin---\n                         MOONAN\n                 (composing himself)\n             Look, I'm not a confrontational person\n             by nature.\nMoonan walks over to the fallen chair and picks it up.\n                         MOONAN\n             I need answers and the only two things\n             you've given me are jack and shit. You\n             gotta do better. You gotta do better\n             or I swear on my sweet dead\n             grandmother's grave, I'm gonna make\n             you guys an I-A-fucking-D cautionary\n             tale.\nMoonan kicks the chair down again, sending Rottovich and\nSobozinski back a few steps.\n                                                          CUT TO:\nEXT. - BACK ALLEY-NIGHT (PRESENT)\nButch takes out two cigarettes and lights both, sticking\none in Jake's mouth.\n                         JAKE\n             Thanks. Did you know you shouldn't\n             light three cigarettes with a match?\n\n\n\n\n                                            (CONTINUED)\n\n                                                               66.\nCONTINUED:\n                         JAKE (cont' d)\n             Back in WWI or WWII, one of the WW' s,\n             if you took the time to light three\n             cigarettes with one match, some Nazi\n             would be able to figure out where you\n             were. Then, well... It was the last\n             cigarette you and your two buddies ever\n             had. So three on a match is bad luck.\n                         BUTCH\n             You're a superstitious fucker.\n                         JAKE\n             Luck's a funny thing.    Especially the\n             bad.\n                          BUTCH\n             Like what?\n                         JAKE\n             Having a gun pointed at you for one.\n             It's not like breaking a mirror bad\n             luck, but it's bad. Three on a match,\n             black cats... Believe it. Believe it\n             all.\n                                                            CUT TO:\nINT.- JAKE'S APARTMENT- NIGHT\nMiles, Jake, Lupus and Gordo sit around in silence.\nThey're all dressed in new suits.\n                         JAKE (V.O.)\n                 (overlap below)\n             But if you wanna talk about bad luck...\n                         MILES\n             Where the hell is she?\nJust then, a KNOCK on the door. Jake opens the door to\nreveal Lily, dressed in an expensive business suit and\nsporting a sophisticated cut of new RED HAIR\n                          JAKE (V.O.)\n             Redheads.\n                          JAKE\n             FUCK!\nGordo, Lupus and Miles look up at Lily.\n                          GORDO\n             Oh shit.\n\n\n\n\n                                              (CONTINUED)\n\n                                                             67.\nCONTINUED:\nLily stands at the door watching Jake freak out in\ndisbelief.\nFREEZE FRAME ON LILY and her new red hair.\n                         JAKE (V.O.)\n             Top three all-time worst red-heads...\nINSERT SHOT- A RED HEADED WOMAN enters dark bedroom,\ncarrying an axe...\n                         JAKE (V.O.)\n             Lizzie Borden... Axe murder.\nINSERT SHOT- A dinner table for TWELVE MEN dressed in\nflowing robes. A RED HEADED MAN leans over to whisper in\nthe ear of an important looking guy in the middle...\n                         JAKE (V.O.)\n             Judas... Betrayer.\nINSERT SHOT- A RED HEADED WOMAN, middle-aged with a bad\nhaircut from the 70's carrying a suitcase leans down and\ntearfully kisses a SMALL BOY on the cheek.\n                         JAKE (V.O.)\n             Shirley Vig... Abandoner.\nBACK TO FREEZE FRAME OF LILY\nThe action resumes...\n                         LILY\n             Nice to see you too.   Why are you getting\n             so bent?\nShe takes a step into the apartment.\n                         JAKE\n             You just put a mother of a jinx on us.\n                           LILY\n             Lighten up.\n                         JAKE (V.O.)\n             But the fucking Grand Poo-Bah of all\n             jinxes? A bird in your house...\nLily takes her jacket off revealing a delicate blouse,\ndecorated with a design of flowers and a BIRD.\nFREEZE FRAME ON LILY'S BIRD BLOUSE.\n                                                          CUT TO:\n\n                                                            68.\n\n\n(FLASHBACK) INT.- JAKE'S APARTMENT- NIGHT\nIt's the scene earlier, when Jake finds a BIRD rapping at\nhis window to get out.\n                      JAKE (V.O.)\n          A bird enters your house...\n                                                         CUT TO:\n(FLASHBACK) INT.- BIG AL'S APARTMENT\nBig Al's bulging, vacant eyes stare straight at us, his\nmouth hanging open.\n                      JAKE (V.O.)\n          It means death.\nBACK TO FREEZE FRAME ON LILY'S BIRD BLOUSE.\nThe action resumes...\n                      JAKE\n          You have no idea what you've done do\n          you? No idea! What is this?\nJake points to her hair.\n                      LILY\n          You told me to change my hair!\n                      JAKE\n              (re: the shirt)\n          What about this? Do you have any idea\n          what this means? You've killed us.\n          We're dead!\n                      LILY\n          Did I miss something?\n                      GORDO\n          The red hair... It's bad luck.\n                      MILES\n          It's not like she's a real redhead,\n          Jake...\n                      JAKE\n          Like that matters! You can't fool bad\n          luck! You can't get by on a\n          technicality! You can't trick karma!\nLily grabs her jacket and starts out the door, then turns\nback around to Jake.\n\n\n\n\n                                           (CONTINUED)\n\n                                                             69.\nCONTINUED:\n                         LILY\n             So much for that good feeling, huh?\nSilence.   Jake can feel the eyes on him.\n                         JAKE\n             Anybody says a word I swear to God...\nJake takes off after her.\n                                                          CUT TO:\nEXT. - BACK ALLEY- NIGHT (PRESENT)\nButch cracks a big smile.\n                         BUTCH\n             She had you tempting fate.\n                         JAKE\n             My father used to play the same fucking\n             lotto numbers with these other guys in\n             the pharmacy. The same numbers everyday\n             for sixteen years. One day he gets\n             pissed off, tells them he's out and\n             plays his own numbers. They hit the\n             Lucky Seven for one point two million.\nLILY steps out from behind Butch.\n                         LILY\n             Guess he passed on that unlucky-\n             asshole gene.\nLily looks down at Jake and the gun pointed at his head.\nThere's not even a hint of sympathy.\n                         LILY\n             You should have trusted me Jake.\n                                                          CUT TO:\nINT.- THE BULL AND THE BEAR PUB- NIGHT\nJake turns and looks at the crew, Miles, Gordo, Lupus and\nLily behind him.\nGrant Ashby sits alone at the crowded bar, doing his\ncrossword puzzle.\nJake a smile and saunters over to the bar.\n                         GORDO\n             She up for this?\n\n\n\n\n                                            (CONTINUED)\n\n                                                               70.\nCONTINUED:\n                         JAKE\n             She's up for it.\nANGLE ON ASHBY AT THE BAR\nAshby sits finishing a drink. Snippets of CONVERSATION\nand LAUGHTER from the cliques around him catch his\nattention, but he remains alone.\n                         BLONDE (O.S.)\n             Is this seat taken?\nAshby turns to see an ATTRACTIVE BLONDE pointing to the\nempty seat next to him.\n                         ASHBY\n                 (brightening)\n             Uh, no. Please.\n                           BLONDE\n             Thanks.\nThe Blonde grabs the barstool and starts to walk off with\nit. A rejected look from Ashby.\n                         LILY (O.S.)\n             Sorry I'm late.\nLily appears next to the Blonde.       Ashby looks around to\nmake sure she's talking to him.\n                         LILY\n             But I'm not that late.    You didn't have\n             to give away my seat.\n                         ASHBY\n                 (getting it)\n             I wasn't sure if you'd make it.\n                         BLONDE\n             Oh, I didn't know you... Here.    Sorry.\nLily takes the barstool back.\n                           LILY\n             No problem.\nThe blonde woman leaves as Lily sits down next to Ashby.\n                         LILY\n             Thanks for playing along.    I just have\n             to sit for a while.\n                           ASHBY\n             Tough day?\n\n\n\n                                              (CONTINUED)\n\n                                                                71.\nCONTINUED:\n                         LILY\n             Brutal day. They say the streets are\n             lined with money down here, but I guess\n             you have to know the secret handshake.\n             What are you drinking?\n                         ASHBY\n             Uh, Maker's Mark.      Rocks.\nLily signals the BARTENDER for two more drinks.\n                         ASHBY\n             My name's Grant. Grant Ashby.\n                        LILY\n             Oh god. I'm overbearing and rude.\n             Lily. Lily Finn.\nThey shake, Ashby's demeanor brightening again.\n                         ASHBY\n             So, what do you do?\n                         LILY\n             It's more like what aren't I doing.        My\n             partners and I are trying to secure\n             start up capital for a small tech\n             company. We tried the venture\n             capitalist route in the Valley, but\n             then again who hasn't up there.\n                         ASHBY\n             Silicon Valley?\n                         LILY\n             That's right. So, brainiacs that we\n             are, we thought we'd be innovative and\n             relocate east. Try our luck with a\n             straight corporate loan out here.\nThe drinks arrive.       Lily hands the bartender a twenty.\n                            ASHBY\n             I can---\n                            LILY\n             On me.     For the seat.   Cheers.\nShe flashes a trademark smile as they CLINK glasses.\n                         LILY\n             So we've been meeting with banks all\n             day. It's amazing how many ways they\n             can say \"no\" without ever using the\n             word.\n\n\n\n                                                  (CONTINUED)\n\n                                                           72.\nCONTINUED:\n                         ASHBY\n             Well, typically, corporate loans are\n             relatively simple matters, but you do\n             need to demonstrate a capacity for gross\n             fund recovery.\nLily arches an eyebrow at Ashby.\n                         LILY\n             Don't tell me you started a tech firm\n             here before us.\n                          ASHBY\n             No, no.   Nothing like that.   I work in\n             a bank.\n                          LILY\n                  (leaning in)\n             Really? Wish we had met eight hours\n             ago.\nAshby nods and shyly looks away. He could be blushing.\nLily lets the moment play out for a beat before looking\nover her shoulder.\n                         LILY\n                 (getting up)\n             My partners are here.\nAshby reverts back to schlub mode.\n                          ASHBY\n             Oh.   Well, thanks for the drink.\n                         LILY\n             You're welcome. I was just going to\n             ask you if you'd like to join us. Ashby\n             brightens again.\n                                                        CUT TO:\nINT.- THE BULL AND THE BEAR PUB/TABLE- LATER\nAshby sits with the crew, a few empty glasses in front of\nhim. He looks remarkably relaxed, just another guy hanging\naround with a group of friends.\n                         JAKE (V.O.)\n             She got one leg out from under him.\n             Now we had to lean.\n\n                                                      73.\n\n\n                      GORDO\n          So then Miles walks straight into the\n          Creative Director's office and says\n          \"The code's fine, the program's for\n          shit\" and throws down like a thousand\n          pages of code on the guy's desk!\nThey all break out into LAUGHTER.\n                      JAKE\n          So this is our boss, right? He chases\n          me and Miles out of his office and\n          he's yelling and screaming, \"You're\n          fired! Your whole team's fired!\" He\n          starts looking for Lily, Lupus, Gordo--\n                      MILES\n          But the best part was that he couldn't\n          find Gordo! He was in the bathroom.\n          So he finally goes in there, kicks in a\n          stall door and starts yelling! And\n          there's Gordo, pants at the ankles,\n          holding a PC World Magazine!\nMore LAUGHS.\n                      GORDO\n          I haven't been able to use a public\n          bathroom since.\n                      LUPUS\n          Especially with the thing!\nLupus's non-sequitur brings the whole rhythm of the\nconversation to a grinding halt.\n                      JAKE\n          Uh, right... And that was it. That's\n          when we decided to start our own\n          business. No more shithead bosses.\n                      ASHSY\n          I envy you guys. Taking a chance like\n          that.\n                      GORDO\n          Masters of our own destiny.\n                      LILY\n          So far, masters of our own demise.\n          What bank are you with?\n                      ASHBY\n          City Bank of Manhattan.\n\n\n\n\n                                        (CONTINUED)\n\n                                                          74.\nCONTINUED:\n                         GORDO\n             That's that Gillette guy, right?\n                 (off Ashby's nod)\n             You Like him? As a boss, I mean.\n                         ASHBY\n             He's . . . He's okay.\n                         GORDO\n                 (goading)\n             Come on...\n                         ASHBY\n             No.\nMore LAUGHS.\n                         JAKE\n             What do you do over at your bank,\n             Grant?\n                         ASHBY\n             What do I do? I'm the VP of Finance.\nThe group exchanges Looks.\n                         MILES\n             Wow. We haven't met with anyone your\n             level yet. VP? So that means there's\n             you, then the P.\n                         ASHBY\n             (Confidently Yeah.   That's right.\nFREEZE FRAME ON ASHBY...\n                         JAKE (V.O.)\n             Here's where a little research comes in\n             handy. Corporate banks give out VP\n             titles like calendars. It's a small\n             lie, but now we're sure he's playing.\nRESUME ACTION\n                         JAKE\n             Maybe you can help us understand what's\n             so hard about getting a corporate loan.\n                         ASHBY\n             Well, typically speaking, they're not.\n             As long as you can demonstrate--\n\n\n\n\n                                            (CONTINUED)\n\n                                                             75.\nCONTINUED:\n                         JAKE\n             A capacity for gross fund recovery.\n             Yeah, we got that part.\n                         ASHBY\n             That's right. And tech firms... They\n             'tend to scare people off.\n                         JAKE\n             They scare people off because most\n             people lack vision. Vision and balls.\n             Present company excluded of course.\n                         ASHBY\n             Banks need to know how they're going to\n             get their money back.\n                         JAKE\n             We know exactly how we're going to make\n             The money back. There in lies the\n             Catch-22\n                         ASHBY\n             I don't follow.\nAn uncomfortable silence falls.\n                          GORDO\n             Jake...\n                         LILY\n             It's alright. Grant's one of the good\n             guys.\nShe throws Ashby a flirty smile.\n                          LUPUS\n             Yeah.   He's our boy.\nLupus casually punches Ashby in the arm. It's meant to\nbe a friendly tap, but it's hard enough to jerk Ashby's\nhead to the side. Ashby lets out an uncomfortable LAUGH\nas he rubs his arm.\n                         JAKE\n                 (leaning in)\n             Listen, what I'm about to tell you, I'm\n             telling you in confidence, okay?\n                 (off Ashby's nod)\n             Have you ever heard of a company called\n             Big.Com?\n                          ASHBY\n             Big.Com.   That Internet thing.\n\n\n\n\n                                               (CONTINUED)\n\n                                                           76.\nCONTINUED:\n                         JAKE\n             Right. The guys who started that did\n             what a lot of companies in the Valley\n             do. They get a good idea, shop it\n             around, raise some capital, then sell\n             it off to a bigger company. Microsoft,\n             Intel, Oracle, whatever. The beauty of\n             it is, they've pretty much sold the\n             company before they're even real. The\n             bigger company is already set to buy\n             it, all they want to do is make sure\n             that the idea actually works. So they\n             get some start up capital, make it work,\n             then sell it for like five times the\n             initial loan.\n                         ASHY\n             Sort of like a letter of intent.\n                         JAKE\n             Exactly. But the Catch-22 is that you\n             can't tell anyone about the offer,\n             because if it's public, you could start\n             a bidding war and that's considered a\n             breach of etiquette. It could kill a\n             deal. But, wait too long and you're\n             not considered hot anymore.\n                         ASHBY\n             And you have this letter of intent?\n                         JAKE\n                 (quietly)\n             Yes. That's why I wish there were guys\n             willing to take a chance and live a\n             little.\n                         LILY\n             We're getting down to the wire.\n             Apparently another company has a\n             similar product in R&D right now.   If\n             they beat us to it...\n                         JAKE\n             Off the record, I'm this close to\n             cutting someone in on the action if\n             it'd help.\nAshby considers for a moment.\n                         ASHBY\n             Should we get another round?\nJake and Lily share an almost imperceptible look.\n                                                        CUT TO:\n\n                                                            77.\n\n\nTNT.- CITY STREET- NIGHT\nJake, Lupus, Miles, Gordo and Lily walking, still on a\ncelebratory high.\n                      GORDO\n          Poor bastard never knew what hit him.\n          Jesus, I almost felt sorry for the guy.\n                      MILES\n          I gotta work off some of this\n          adrenaline. I got a line on this Pawn\n          Shop guy over in Brooklyn. Anybody\n          want in?\n                      LILY\n          I' m going home\n                      GORDO\n          Let's go, Jake?\n                      JAKE\n          Uh... No thanks. I'm not going all the\n          way to Brooklyn for a hundred dollar\n          pay-off.\n                       GORDO\n          You sure?\nJake looks over at. Lily then nods.      Gordo, Miles and\nLupus start to head off.\n                       JAKE\n          Lupus!\nLupus turns and Jake moves closer.\n                      JAKE (cont'd)\n          When this is all over, you're going to\n          tell me who the King put on Al.\n                      LUPUS\n          You going to have the time?\n                      JAKE\n          I'11 find the time.\nLupus nods and heads off.     Jake watches them go.\n                      LILY\n          Look at you... You want to go.\n                       JAKE\n          For what?   A couple hundred bucks?\n\n\n\n\n                                           (CONTINUED)\n\n                                                           78.\nCONTINUED:\n                         LILY\n             I think you'd do it for free. You' re\n             almost drooling. You like the rush.\n                         JAKE\n             It's what I do. It's my job.\n                         LILY\n             Why? Your mother not breast feed you\n             or something?\n                         JAKE\n             Are you asking me if I have something\n             to prove?\n                         LILY\n             Do you have something to prove?\n                         JAKE\n             Not in that repressed anger sort of\n             way.\n                         LILY\n             I'm your basic underachiever. Can't\n             stand working and porn doesn't seem\n             like a good option.\n                         JAKE\n             Good quality porn has it's place in the\n             world.\n                         LILY\n             Whatever. But you... I get the feeling\n             you could have bullshitted your way\n             into anything. So why this?\n                         JAKE\n             I'm good at it. Lying, cheating.\n             Manipulating... I'm good at it.\n                         LILY\n             It's more than that.\n                         JAKE\n             Intuition. It doesn't make you Yoda.\n             Like tonight. You killed that guy\n             tonight. But I knew you would.\n                         LILY\n             So that was my part?   Smile and shake\n             my ass?\n                         JAKE\n             No. You have another part?     You'll\n             know what to do.\n\n\n\n                                             (CONTINUED)\n\n                                                           79.\nCONTINUED:\n                         LILY\n             How do you know I will?\n                          JAKE\n             Intuition.\n                                                       CUT TO:\nINT.- LILY'S APARTMENT- NIGHT\nIlluminated only by the light coming from the windows...\nJake runs a hand down the length of Lily's bare back.\nShe falls onto him, both of them hitting the bed locked\nin a deep kiss.\nLily's hand moves down Jake's arm until it finds his hand.\n                         LILY\n             You have really soft hands.    Like a\n             baby's.\n                         JAKE\n                 (remembering the King)\n             Don't ruin this for me.\nThey roll off the bed onto the floor, a naked tangle of\narms and legs, their hands still entwined.\n                                                       CUT TO:\nEXT. - BACK ALLEY NIGHT (PRESENT)\nJake takes a deep breath, Butch and Lily behind him.\n                         BUTCH\n             Is that what it was, Jake?    Was it\n             love?\n                         JAKE\n             You know when the first con was ever\n             played? It was when Adam fell for Eve\n             in the Garden of Eden.\nLily looks away, her face softening for a moment.\n                         JAKE\n             Then she fucked him over with an apple.\n                 (with a dry laugh)\n             Redheads...\nJake continues to LAUGH...\n                                                       CUT TO:\n\n                                                          80.\n\n\nINT . - LILY'S APARTMENT--DAY\nNot even the soft morning light can diffuse the reality\nof this slum-pit studio apartment.\nJake lies next to Lily, kissing her neck. A spoon\nRATTLES in a glass from the growing RUMBLE of a passing\nsubway train. The RUMBLE rises to an almost deafening\nvolume.\nJake's a little alarmed.   Lily, oblivious.\n                       JAKE\n              (drowned out by the\n               rumble)\n          How do you deal with---\n                      LILY\n              (yelling)\n          WHAT?\n                      JAKE\n              (yelling back)\n          SAID, HOW DO--\n              (the subway passes)\n          Deal with that?\nLily shrugs indifferently.\n                      LILY\n          Do you think we can do it?\nJake resumes kissing Lily's neck, trying to rekindle some\nof last night's magic.\n                     JAKE\n          Maybe. Even if we don't, you'll be\n          alright. You're not in the hole with\n          the King.\nLily rolls away from Jake.   Undaunted, Jake starts kissing\nher back.\n                      LILY\n          Who says you have to know the King to\n          be in a whole? I actually did have a\n          real job once. When I was in high\n          school, I worked as a candy striper.\n                      JAKE\n          Sounds respectable.\n                      LILY\n          Not the way I did it. I was loaded\n          half the time. I don't know how you\n          could change bedpans sober.\n                      (MORE)\n\n                                         (CONTINUED)\n\n                                                           81.\nCONTINUED:\n                         LILY (CONT'D)\n             I used to hang out with this guy,\n             Glenn. He was an x-ray technician or\n             something.\n                         JAKE\n             You want to talk about an old\n             boyfriend right now?\nJake, kissing up the length of Lily's neck.\n                         LILY\n             He wasn't my boyfriend. I had a\n             boyfriend at the time... What was his\n             name? Anyway, Glenn was like thirty.\n             I was only fifteen. But he was a nice\n             guy. Real sweet. Liked to talk. We\n             used to get loaded on pills from the\n             nurses station and then listen to\n             Morrisey or some stupid shit like\n             that.\n                         JAKE\n             Yeah, the sensitive guy-thing never\n             worked for me.\n                         LILY\n             We were friends. I trusted him. I\n             should have known it was weird. But,\n             then again I was weird.\n                         JAKE\n             You guys got busted.   This is a great\n             neck.\nJake still kissing...\n                         LILY\n             No, we never got busted. We were done\n             with a shift one night, both a couple\n             of Percocets down and I was telling\n             Glenn about my boyfriend, about how we\n             were thinking about doing it, you know?\n             I was thinking about letting him be my\n             first because I loved him.\n                 (pause)\n             What the hell was his name?\n                         JAKE\n             Glenn talked you out of it.\n                         LILY\n             Sort of. I was telling him about this\n             great love of my life who's name I don't\n             remember, and I could see... He was\n             getting pissed. I thought it was just\n             because he was worried about me, but...\n\n                                             (CONTINUED)\n\n                                                           82.\nCONTINUED:\n                         LILY (cont'd)\n             He told me that I was stupid because\n             my boyfriend didn't really love me.\nJake grabs Lily and rolls her over onto her back.     He\nclimbs on top of her.\n                         JAKE\n             He was looking out for you.\n                         LILY\n             Then he grabbed me and threw me down\n             on the floor, that really cold\n             linoleum tiled hospital floor and\n             started ripping my uniform off.\n                 (pause)\n             He said he was going to \"fuck some\n             sense into me.\"\nJake stops kissing Lily and looks up at her.\n                         LILY\n             Shit, what was that guy's name?   I really\n             liked him.\n                         JAKE\n             Lily... Jesus Christ...\n                         LILY\n             After Glenn was finished, he gave me a\n             couple of valiums and I went home. The\n             next day, I finished my shift and met\n             him around back, like we always did. I\n             stuck a number eight scalpel into his\n             chest. Three or four times.\nJake slides off Lily.\n                         JAKE\n             Did, uh... Did you kill him?\n                         LILY\n             I don't know. I packed up my shit and\n             ran away. To this... So unlike you, I\n             guess I do have something to prove, in\n             a repressed anger sort of way.\nJake considers for a second.\n                         JAKE\n             No. You trusted him... You were just\n             getting square.\n                         LILY\n             You know why I told you that, Jake?\n                 (turning towards him)\n             Because I trust you too.\n\n                                            (CONTINUED)\n\n                                                              83.\nCONTINUED:\nJake tries a reassuring smile even though he's not sure\nit's something he should be smiling about.\nThe spoon starts to RATTLE again as another subway train\nRUMBLES in the distance.\n                                                          CUT TO:\nEXT. - BACK ALLEY-NIGHT (PRESENT)\nLily shakes her head in disbelief that Jake would tell\nthe story.\n                         JAKE\n             Sorry, honey. But I figure if we can't\n             all share at a time like this...\nButch lowers the gun down and looks over at Lily.\n                         BUTCH\n             You got some issues, huh?\n                         LILY\n                 (with a hiss)\n             I can take care of myself.\nButch freezes as A POLICE SIREN WAILS in the BACKGROUND,\ngrowing CLOSER then FADING again. He puts the gun back\nto Jake's head.\n                          BUTCH\n             Hurry up.\n                                                          CUT TO:\nINT.- ASHBY'S OFFICE- DAY\nAshby sits behind a desk in front of the crew.     In front\nof him are the corporate papers.\n                         JAKE (V.O.)\n             We had to finalize the deal.\n                         ASHBY\n             Everything looks in order.\n                         JAKE\n             This has to happen fast.\n                          ASHBY\n             I know.   It won't go unnoticed.\n                         JAKE\n             There'll be red flags.\nJake slides an envelope across the desk.\n\n\n                                            (CONTINUED)\n\n                                                                 84.\nCONTINUED:\n                            ASHBY\n             What's this?\n                          JAKE\n             You need some convincing.       Consider it\n             a convincer.\nAshby leafs through the money in the envelope.\n                         ASHBY\n             Let's just slow down for a second...\n                         JAKE\n             You're worried about recouping the loan.\n             I already told you.\n                         ASHBY\n             No, I understand that. What I mean...\n             What I'm trying to say... I was\n             actually wondering about...\n             Well, my cut.\nECU- A bead of sweat rolls down the back of Ashby's neck.\n                         JAKE (V.O.)\n             Then there it is. Ashby gets the itch.\n                         JAKE\n             The standard ten.\n                            ASHBY\n             Ten percent.     Of how much?\n                            JAKE\n             Two million.\n                         GORDO\n             We're going to make it back, Grant.\nThree or four times over.\n                         JAKE\n             And all you need to do for your ten\n             percent is put some paperwork through\n             and push a button tomorrow.\nThere's a pause before Ashby smiles, then reaches around\nto scratch his neck.\n                                                              CUT TO:\nINT.- CITY BANK OF MANHATTAN/HALLWAY- DAY\nJake exits Ashby's office with Lupus, Gordo, Miles and\nLily. They all follow Jake down the hallway.\n\n\n\n                                                (CONTINUED)\n\n                                                             85.\nCONTINUED:\n                         GORDO\n             You'll be there?\n                         JAKE\n             Eight A.M. flight.\n                         GORDO\n             Calls?\n                         JAKE\n             We'll use the Euc.\nThey pass the glass partitioned conference room. Jake\nlooks inside to see Morgan Gillette holding court with a\nbunch of SUITS. Butch stands behind Gillette.\nFor a second, Butch and Jake's eyes meet.\n                                                         CUT TO:\nEXT.- STREET- DAY\nJake, Lily, Miles, Gordo and Lupus... As they move through\nthe crowded sidewalk, Rottovich and Sobozinski appear\nbehind them.\n                         ROTTOVICH\n             Hey Jake.\nJake turns just in time to catch Rottovich's fist square\nin the face.\nJake staggers back and Sobozinski pushes him into an\nalley.\n                         JAKE\n             That tip not work-out for you fellas?\n                         ROTTOVICH\n             Tip was fine, Jake. We were a little\n             more curious about the Fed.\n                         JAKE\n             Hey, listen... If you guys don't pay\n             your taxes, that's your business.\nSobozinski punches Jake in the stomach.    Miles and Gordo\nlurch forward--\n                         SOBOZINSKI\n                 (pulling his gun)\n             Back up.\n                         LUPUS\n             You want I should hold him down?\n\n\n\n                                           (CONTINUED)\n\n                                                            86.\nCONTINUED:\nGordo throws Lupus a look.\n                         ROTTOVICH\n             Special Agent Gunther Moonan.     Ring a\n             bell?\n                           JAKE\n             Gunther?    I think I'd remember a Gunther.\n                         ROTTOVICH\n             Ring it for him, Sobo.\nSobozinski punches Jake again.\n                           JAKE\n             Oh yeah.    Moonan.   I remember now.\n             Thanks.\n                           ROTTOVICH\n             Well he's   in town and he sure as shit\n             remembers   you. What are we going to do\n             about this   Jake? We can't afford to\n             have a Fed   onto us.\n                         JAKE\n             Wouldn't dream of it.\nRottovich punches Jake hard in the stomach, sending him\nGASPING to the ground.\n                         ROTTOVICH\n             I don't know what you're into with the\n             King Pin, but whatever it is we get a\n             piece, understand? We get a big piece.\n             If we find out you're keeping us out, I\n             may suddenly develope a conscious and\n             give you up to Moonan myself. Say\n             something stupid if we got a deal,\n             Jake.\n                         JAKE\n                 (gasping for breath)\n             Something stupid.\n                           ROTTOVICH\n             Good boy.\n                         SOBOZINSKI\n             And don't leave town!\n                 (to Rottovich)\n             I always wanted to say that...\nAs the cops exit, Lily, Miles and Gordo rush to Jake.\n\n\n\n\n                                              (CONTINUED)\n\n                                                               87.\nCONTINUED:\n                         LILY\n             People don't like you much, do they?\nJake lets out a pained GROAN as they help him up.\n                                                            CUT TO:\nINT.- CAR- DAY\nRottovich and Sobozinski get in the front of a squad car.\nIn the back, Moonan sits reading the Travel section of\nthe NY Times.\n                         MOONAN\n             Did he buy it?\n                           ROTTOVICH\n             I think so.    What'd he ever do to you\n             anyway?\n                         MOONAN\n             Let's just say he burned me once.\nMoonan calmly turns the page of the paper.\n                         LUPUS (V.O.)\n             Why's this guy so hard up for you?\n             You're not exactly a threat to\n             national security.\n                                                            CUT TO:\nINT.- THE EUCLID- DAY\nJake sits at a barstool, battered and bruised. Lily tends\nto him with a towel. Miles and Gordo pour drinks. Lupus\nsits at a table, watching.\n                         JAKE\n             We go way back...\n                                                            CUT TO:\nEXT.- DOG RACETRACK- DAY\nA BELL... A mechanical rabbit springs forward.         Greyhounds\nbolt out of the gate.\n                         JAKE (V.O.)\n             About four years ago, we were working\n             in Miami, turf fixing for some local\n             goon.\n                                                            CUT TO:\n\n                                                           88.\n\n\nINT.-- RACETRACK- DAY\nGordo, Miles, Big A1 and Jake watch the race with\nindifference, surrounded by excited SPECTATORS.\n                      JAKE (V.O.)\n          Turns out this local goon was being\n          watched by the Feds, which means we\n          were being watched by the Feds. One in\n          particular.\nThrough the crowd, we catch a glimpse of Moonan, in\nsunglasses, watching the guys.\n                      JAKE (V.O.)\n          Special Agent Gunther Moonan.\nJake turns and catches Moonan looking at him.\n                                                        CUT TO:\nEXT.- RACETRACK/PARKING LOT- DAY\nMoonan walks over to a car.\n                      JAKE (V.O.)\n          He didn't really have anything on us,\n          but I figure, maybe this guy's good\n          for a Fix. So I ask him out to dinner.\nMoonan pulls a piece of paper off the windshield that\nreads: \"La Scala 2night.\"\n                                                        CUT TO:\nINT.- LA SCALA- NIGHT\nAn elegant restaurant. Jake sits confidently in an\nexpensive suit speaking to the shabbily dressed Moonan\nacross from him.\n                      JAKE (V.O.)\n          These guys we have now, sure, give\n          them twenty bucks and they'll look the\n          other way on a parking ticket. But a\n          Fed... You get a guy like that as your\n          Fix...\nJake nonchalantly slides a fat envelope over to Moonan.\nMoonan picks it up and finds a wad of cash.\n                      JAKE (V.O.)\n          It was probably a stupid idea. There I\n          am, Armani and Rolex. There he is, JC\n          Penny and Timex...\n\n\n\n                                          (CONTINUED)\n\n                                                             89.\nCONTINUED:\nMoonan smiles and slides the envelope back over to Jake\nwith a disappointed shake of his head.\n                         JAKE (V.O.)\n             So I took a shot. But now he had me on\n             attempted bribery of a Federal Agent.\nAs Moonan stands, we see Big Al get up from the next table.\nA1 \"bumps\" into Gordo, dressed in a waiter's white jacket.\nGordo \"trips;\" spilling scalding hot coffee into Moonan's\nlap.\nJake casually gets up and leaves.\nFREEZE FRAME ON MOONAN'S CONTORTED FACE.\n                         JAKE (V.O.)\n             That's when Gordo comes in with the\n             Hazelnut French Roast.\nRESUME-- Moonan falls to the floor, holding his crotch in\nagony.\n                                                          CUT TO:\nEXT.- LA SCALA/PARKING LOT- NIGHT\nMiles pulls up in an old Cadillac, picking up Jake at the\nentrance. They pick up Gordo and Big Al from a side door\nand drive off as Moonan limps out of the restaurant, still\nholding his crotch.\n                                                          CUT TO:\nINT.- THE EUCLID- DAY (RESUMING)\nJake finishes the story to Lupus.\n                         JAKE\n             And that's how Special Agent Gunther\n             Moonan and I became friends.\nLupus nods, satisfied.\n                           GORDO\n             Moonan.    Here. Shit...\n                          LILY\n             So what?   We just stay clear of him.\nJake gets up, hard enough to knock the chair over.\n                         LILY\n             Jesus... Take it easy.\n\n\n\n\n                                            (CONTINUED)\n\n                                                           90.\nCONTINUED:\n                         JAKE\n             No, I'm not going to take it easy. You\n             can't stay clear of this guy. He will\n             be on this until the end of time.\n                         MILES\n             What do we do? We change the scam?\n                         JAKE\n             There is no scam!    I've got a fucking\n             sign on my back!    I can't leave town\n             now and come back   with a suitcase full\n             of money. You get    it? It's over. We\n             walk.\n                         GORDO\n             Jake--\n                         JAKE\n             What do I always tell you guys? Don't\n             spend it all. Sooner or later we're\n             going to run into some bad luck. Save\n             some. Put it away, so when shit like\n             this happens, you're not desperate.\n             That's it. The gig's up.\n                         LILY\n             That's it? What are you talking about?\n             We can still do this!\n                         GORDO\n             Jake, I mean, come on--\n                         JAKE\n             No, no, no! Not  this time. I am doing\n             this for your own good! You guys have\n             got to learn when to stop. You with\n             the Armani! You  with the hookers!\n                         MILES\n             Escorts!\n                         JAKE\n             Do you even remember Al? Do you remember\n             what he looked like sitting there?\n                         LILY\n             You are such a raving pussy sometimes.\n                          JAKE\n             Hey, we fucked once, honey. That\n             hardly makes you a good judge of\n             character. And don't think I didn't\n             know you were working some angle with\n             that either.\n\n\n\n                                             (CONTINUED)\n\n                                                         91.\nCONTINUED:\n                         LILY\n             Everyone's working an angle, right?\n                         JAKE\n             There are three people I trust-- him,\n             him and a guy who got killed. I don't\n             know who you are! You're like some\n             stray doq that wandered into the\n             house. So I'm telling you to cut loose\n             of this. No one's looking for you, Not\n             the King, not Moonan and not Gillette.\n             Just go wherever it is you would go.\n             It's over.\nLily looks around the room. No one seems to be backing\nher up.\n                         LILY\n             What about...\n                         JAKE\n             What about what?\n                         LILY\n             What about the money?\nJake stops and levels a look at Lily.\n                         JAKE\n             So there it is. You got that big itch\n             you need to scratch. It's all about\n             the fucking money. What do you want,\n             an apology?\n                         LILY\n             No, I want my cut!\n                         JAKE\n             I'm going to say this one last time for\n             You, so take a deep breath and count to\n             ten. There is no cut.\nLily levels a look of utter contempt at Jake.\n                         LILY\n             You're an asshole.\nWith that, she grabs her coat and leaves.\nLupus sits quietly, taking it all in.\n                         GORDO\n             So that's it...\n                          JAKE\n             That's it.\n\n\n                                           (CONTINUED)\n\n                                                                92.\nCONTINUED:\n                         LUPUS\n             King ain't gonna like this.\n                         JAKE\n             Don't worry, I'll settle up with your\n             boss. We haven't skipped town yet.\n                         LUPUS\n             What I'm saying is, is that the King\n             ain't gonna care. See he had a real\n             thing with getting this Gillette guy,\n             If you ask me I think he's jealous.\n                          JAKE\n             Of what?   They're both crooks.\n                         LUPUS\n             Exactly. `Cept this Gillette guy. He\n             gets to walk around in three piece\n             suits, hob knob with the Mayor, own a\n             bank, that kinda shit. Meanwhile, the\n             King sits holed up in the steam, afraid\n             to even take a leak without me or Harlin\n             watching the door.\n                         JAKE\n             My fucking heart bleeds.\n                         LUPUS\n             Your buddy. That fat guy. The King\n             couldn't wait to have that guy\n             whacked. He didn't even know who the\n             guy was, but he was so pissed off at\n             him, he gets him drilled. It ain't\n             personal. It's business.\n                         JAKE\n             Point, Lupus. Give us a point.\n                         LUPUS\n             Point is, you don't go through with\n             this, he's going to go after you next.\n             And he don't even like you, Jake.\nLupus stares blankly at Jake.\n                                                             CUT TO:\nEXT. - BACK ALLEY (PRESENT)\nButch hovering over Jake...\n                         BUTCH\n             So much for honor among thieves. You\n             would have cut loose your friends, your\n             girl...\n\n\n                                               (CONTINUED)\n\n                                                             93.\nCONTINUED:\n                         JAKE\n             I was doing it for them.\n                         BUTCH\n             BULLSHIT! You were scared, Jake! You -\n             Lost your nerve! You lost your\n             confidence! You weren't being noble.\n             You weren't trying to save anybody but\n             yourself! Admit it.\n                         JAKE\n             It's not true.\n                         BUTCH\n             Yes it is Jake! Yes it is! They were\n             right there for you. She was right\n             there for you! Look at her!\nJake doesn't move.    Butch grabs him by the hair and turns\nhim towards Lily.\n                         BUTCH (cont'd)\n             She trusted you and you sold her out!\n             Be honest! Be a man! Tell her, Jake!\n             Tell her that you loved her but the\n             money meant more to you!\nButch kicks Jake in the gut.\n                         BUTCH (cont'd)\n             Grifters... Gentleman's racket... My\n             ass. You're just any other lowlife\n             stammer-- Looking out for number one.\nJake shuts his eyes, maybe because Butch is right.\n                                                          CUT TO:\nINT . - JAKE'S APARTMENT-- NIGHT\nLupus and Jake sit at the table.    Lupus on the phone.\n                         LUPUS\n             Hey, boss. It's me. The bank's in.\n             It's happening tomorrow... Jake?\nLupus turns to Jake and slaps him on the shoulder good\nbuddy-style.\n                         LUPUS (cont' d)\n             He got a little shaky there for a minute,\n             but we got him back in the batter's\n             box.\n                                                          CUT TO:\n\n                                                          94.\n\n\nINT. -BULLDOG GYM - SAME\nThe King Pin on a cell phone. Harlin stands in front of\nhim, punching the King's stomach hard enough that he's\nsweating. The King seems to hardly notice.\n                      LUPUS (O.S.)\n          Coupla things. They got this Fed , loo\n          king around and the girl just split.\n                        KING PIN\n          A Fed?    Is he close?\n                      LUPUS (O.S.)\n          I don't think so. Their Fix gave us\n          the heads up and Jake's got a plan\n          that'll probably keep him off.\nBACK TO LUPUS\n                      LUPUS\n          But this girl, the redhead. She knows\n          a lot. She could be a pain in the ass.\nJake looks up.\n                     JAKE\n          No. She won't. She's not going to be\n          a problem.\nLupus cups the phone.\n                      LUPU\n          He wants to talk to you.\n              (whispering)\n          Don't tell him I said he was jealous\n          of Gillette, okay?\nJake reaches over and grabs the phone.\n                      JAKE\n          Uh huh... Uh huh... Okay... I understand.\nJake hangs up the phone.\n                      LUPUS\n          What'd he say?\n                         JAKE\n          Oh,    you know... Don't fuck this up.\n          I'll    kill you. I'll kill your family.\n          I'll    shoot your dog... All the usual.\n          Then    he said good luck.\n\n\n\n\n                                          (CONTINUED)\n\n                                                             95.\nCONTINUED:\nA FLAPPING SOUND catches Jake and Lupus's attention.     A\nWHITE PIGEON sits on the frame of an open window.\n                           JAKE\n             Aww, shit!\n                                                         CUT TO:\nEXT.   BACK ALLEY- NIGHT (PRESENT)\nWith a shrug, Jake continues...\n                         JAKE\n             We were back on.\n                         BUTCH\n             After you cut her loose.\n                           JAKE\n             She walked.\nLily pushes Butch aside and moves closer to Jake.\n                        LILY\n             I walked? Let me tell you a story,\n             asshole...\n                                                         CUT TO:\nINT.- LILY'S APARTMENT- NIGHT\nLily stands at a hot plate in her \"kitchen\" frying an\negg.\nHEAVY FOOTSTEPS from the hall catch her attention, growing\nlouder, then stopping at her door. A KNOCK.\n                           HARLIN (0.S.)\n             Lily?\nLily frantically rumages through drawers. She pulls a\nknife, but it's only a butter knife. She tosses it aside.\nLily moves to the door and looks out the peep hole.\n                         HARLIN (O. S.)\n             .Jake sent me.\nLily moves to the closet.\n                        LILY\n             Jake? Hold on. I just got out of the\n             shower.\nMore KNOCKING.\n\n\n\n\n                                           (CONTINUED)\n\n                                                                    96.\nCONTINUED:\nLily rumages in the closet and a baseball bat. She hefts\nthe bat and takes a stance in front of the door.\nMore KNOCKING.\n                           LILY\n             HOLD ON!\nAnother KNOCK. Lily slowly reaches for the doorknob.\nThen the door flies open with a CRASH. Harlin fills the\ndoorway.\n                         HARLIN\n             The King would like to have a word\n             with you.\nLily, wide-eyed, stands frozen with the bat still cocked..\n                         LILY\n             Uh, right now?\n                           HARLI\n             Please.    I have a car waiting.\nLily takes a swing.      Harlin easily grabs the bat and\nbackhands Lily. She      goes flying back into the far wall,\nbounces off and lands     with a THUD at Harlin's feet where\nshe finds the butter     knife.\nHarlin reaches down and pulls Lily up by the hair.            The\negg SIZZLES in the pan.\nLily takes a stab at Harlin, but the knife just bounces\noff his coat. Harlin slaps Lily again, sending her flying\ninto the stove. Smoke starts to rise from the burning\negg.\nHarlin steps closer, but Lily throws her hands up in\nsurrender.\nA spoon RATTLES in a cup as the RUMBLE of a subway train\ngrows LOUDER.\n                         HARLIN\n             (Drowned out by rumble)\n             I apologize for the--\n                         LILY\n                 (yelling)\n             WHAT?\n                         HARLIN\n                 (yelling back)\n             I SAID, I APOLOGIZE FOR--\n\n\n\n\n                                                (CONTINUED)\n\n                                                              97.\nCONTINUED:\nLily shakes her head and points to her ear and mouths,\n\"Can't hear you.\" Harlin moves closer and they lean into\neach other.\n                          HARLIN (cont' d)\n                 (louder)\n             I SAID, I APOLOGIZE FOR--\n                 (the subway passes)\n             --The door.\n                         LILY\n                 (Nodding)\n             No problem.\nShe grabs the smoking pan from the stove and WHACKS Harlin\nacross the head. The burned egg lands on the floor.\nLily watches as he sways and teeters on his feet, like a\ndrunk. She raises the pan again... But before she\ndelivers the final blow, Harlin steps on the egg, causing\nhis leg to shoot out from under him. He lands flat on\nhis back, out cold. The wood floor CREAKS with his weight.\nLily wipes the blood from her nose and turns the hot\nplate off.\n                                                           CUT TO:\nEXT. - BACK ALLEY- NIGHT (PRESENT)\nJake, Butch and Lily...\n                          JAKE\n             Sorry.   I didn't know...\n                         LILY\n             Your friend, Big Al?   It should have\n             been you.\n                         BUTCH\n             Alrlght, alrlght.   What happened today?\n                          JAKE\n             Today?   Started off great...\n                                                           CUT TO:\nEXT.-- CAYMEN ISLANDS/BEACH- DAY\nCrystal blue water gently rolls onto virgin white sand.\nA jet cuts a line across the cloudless sky...\n\n\n\n\n                                             (CONTINUED)\n\n                                                            98.\nCONTINUED:\n                         JAKE (V.O.)\n             Ashby was going to call us with the\n             exact time of the transfer. The King\n             was waiting on us. Just to be safe...\n                                                         CUT TO:\nINT.- JET- SAME\nGordo sits in first class, impeccably dressed in a Brooks\nBrothers suit.\n                         JAKE (V . O .\n             Gordo went down to the Caymens instead\n             of me. I needed Rottovich and\n             Sobozinski to keep Moonan off our backs\n             and the only way I could do that was to\n             stay in town and cut them in on the\n             deal.\n                                                         CUT T0:\nINT.- 16TH PRECINT- SAME\nRottovich and Sobozinski sit around the desks, as Moonan\nreads the newpaper behind them.\n                         JAKE (V.O.)\n             So they waited for my call while Miles\n             and I waited for Ashby's call.\n                                                         CUT T0:\nINT.- THE EUCLID- SAME\nJake sits with Miles and Lupus at a table in the otherwise\nempty bar.\n                         MILES\n             He should be landing in the Caymens\n             about now. The Custom's guy is ready\n             right?\nJake stares off into space, absentmindedly flipping a\npenny in his hand.\n                         JAKE\n             Feeling lucky today, Miles. Found a\n             penny-- Heads up. There was an empty\n             cab right outside my building. We hit\n             every green light.\n                         MILES\n             And we got rid of the red head.\nJake considers...\n\n\n                                           (CONTINUED)\n\n                                                              99.\nCONTINUED:\n                         JAKE\n             And we got rid of the red head.\n                          MILES\n             Jake?   Customs?\nJake just nods and continues flipping the penny.       JAKE\n                         (V.O.)\n             They say a good chess player can. See\n             up to twenty moves deep. That means\n             that in some games, you've calculated\n             every possible move in your head... The\n             game's over before it's even \" really\n             started.\nCUT T0:\nINT.- CITY BANK OF MANHATTAN/ASHBY'S OFFICE- SAME\nAshby sits at a desk, computer terminal in front of him.\nHe speaks in hushed tones on the phone.\n                         JAKE (V.O.)\n             Same thing with playing a con. You\n             have to be able to see that deep.\n                         ASHBY\n             Jake? Right. Uh-huh... Uh-huh... Yeah,\n             it's going through--\nINSERT SHOT- ECU of Ashby's finger on the \"Enter\" key.\n                          ASHBY (coat' d)\n             Now.\nAshby hangs up and checks over his shoulder.\n                                                          CUT T0:\nINT. - THE EUCLID BAR- SAME\nJake hangs up and immediately dials another number.\n                         JAKE (V.O.)\n             In order to ensure that we weren't going\n             to welch, Ashby's pay-off was to be\n             directly deposited into his own offshore\n             account which he could confirm\n             electronically. In this age of\n             ecommerce, paper currency has become \"\n             more of a liability than a commodity.\n             Especially to us.\n\n\n\n\n                                            (CONTINUED)\n\n                                                           100.\nCONTINUED:\n                           JAKE\n                   (into phone)\n             Go.\n                                                         CUT TO:\nEXT.- CAYMEN ISLANDS/CAFE- SAME\nGordo listens into a cell phone: Without saying a word,\nhe gets up, wheeling a nondescript BLACK SUITCASE.\nAcross the street sits the Grand Caymen's Bank in all\nit's pastel and brass glory.\n                                                         CUT TO:\nINT.-- GRAND LAYMEN'S BANK- DAY\nGordo moves across the lobby of the bank to the back of a\nline at the Teller windows wheeling the black suitcase.\n                         JAKE (V.O.)\n             Gordo was making the withdrawal from\n             the Grand Laymen's Bank.\nGordo stands in front of a Teller. She reads off a paper\nthen does a double take at Gordo, who smiles back.\n                         JAKE (V. O. )\n             They check the papers...\nGordo slides a folder of corporate papers along with his\nphoto ID towards the Teller.\nWe follow the teller as she hands the papers to the\nOFFICIOUS LOAN OFFICER.\nANGLE ON the teller window-- A check is pushed to Gordo.\n                         JAKE (V.O.)\n             ...They stick.\nGordo shakes the Loan Officer's hand and calmly walks\ntowards the door.\n                                                         CUT TO:\nEXT.- LAYMEN ISLANDS/STREET DAY\nGordo walks across the street with the suitcase and pulls\na cell phone from his pocket.\n                         GORDO\n             First and ten.\n\n\n\n\n                                           (CONTINUED)\n\n                                                          101.\nCONTINUED:\nGordo hangs up without another word. He approaches a\nbuilding with the words \"BANK OF THE CAYMENS\" engraved\nover the brass handled doors.\n                                                        CUT TO:\nINT.- BANK OF THE CAYMENS- DAY\nGordo approaches the teller window with the check in hand.\n                         JAKE (V.O.)\n             Then he had to bang it out across the\n             street at the Bank of the Caymens...\n                         GORDO\n             I'd like this cashed, please.\nANOTHER TELLER looks at the check then back up at Gordo.\n                         GORDO (cont'd )\n             I also need to deduct a certain amount\n             and deposit it into this account number.\nGordo takes another piece of paper and slides it to the\nTeller.\n                                                        CUT TO:\nINT.- CITY BANK OF MANHATTAN/ASHBY'S OFFICE- DAY\nAshby sits, nervously tapping his computer monitor with a\npen. MARIE, a secretary, pokes her head in.\n                         MAR I E\n             Mr. Ashby? Mr. Thompson from\n             International with a 34R on a\n             corporate account.\nAshby watches the screen, as a big broad smile comes\nacross his face.\n                         ASHBY\n             Probably just a new account marker.\n                 (standing)\n             Tell him I already left for lunch and\n             that I'll call him later.\nAshby grabs his coat and strides confidently out.\n                                                        CUT TO:\n\n                                                            102.\n\n\nINT.- BANK OF THE CAYMENS/VAULT ROOM- CONTINUOUS\nA SECURITY GUARD stands in the small, windowless room.\nGordo is escorted into the room by a BANK OFFICIAL.\n                      BANK OFFICIAL\n          We'll let you have a moment.\nOn a small table are neat piles of bundled money, shrink\nwrapped in plastic. Gordo seems in awe.\n                      JAKE (V.O.)\n          We called them Green Twinkies.\nThe Bank Official and Security Guard exit. Gordo holds\nup a Green Twinkie up to his nose and takes a deep breath.\n                                                          CUT TO:\nEXT.- CAYMEN ISLANDS/STREET- DAY\nThe Security Guard holds open the door as Gordo exits,\nsuitcase in tow. Gordo takes his cell phone out as he\nmoves across the street.\n                      GORDO\n          We got Twinkies.\nGordo pockets the phone and disappears into the crowd.\n                                                          CUT TO:\nINT.-- THE EUCLID- SAME\nJake hangs up the phone and dials another number.    He\nnods at Lupus.\n                      JAKE (V.O.)\n          Miles was on his way to the airport to\n          wait for Gordo to land. I made the\n          call.\n                      JAKE\n          Yeah, it's me. I need an escort. Not\n          a ride, just an escort. You wanted in,\n          this is in.\n                                                          CUT TO:\nINT.- 16TH PRECINCT/DETECTIVES' OFFICE- DAY\nSobozinski behind a desk. Sitting in a chair leafing\nthrough a magazine is Moonan. Rottovich on the phone...\n\n\n\n\n                                           (CONTINUED)\n\n                                                            103.\nCONTINUED:\n                         JAKE (O.S.)\n             Kennedy. International terminal. Gordo\n             with a black suitcase. You got Moonan\n             under control?\n                         ROTTOVICH\n             Don't worry about Moonan. We got him\n             covered. When..?\n                 (hanging up)\n             It was him. There's a shipment coming\n             through tonight. Kennedy.\n                         MOONAN\n             Shipment of what?\n                 (off Rottovich's shrug)\n             Find two cars. And change into plain\n             clothes.\nAfter Rottovich and Sobozinski exit, Moonan dials a number.\n                         MOONAN\n             It's Moonan. Tonight. JFK.\n             International terminal. Come heavy.\n                                                         CUT TO:\nINT.- THE EUCLID- NIGHT\nJake sits at the bar, looking at his watch.    He notices\nhis hand is shaking.\n                         LUPUS\n             So that's it, huh? You get the cops to\n             give you a safe ride.\n                         JAKE\n             Let me ask you something... You really\n             think I'm going to come this close,\n             this fucking close and let my guard\n             down? I'll get square with your boss.\n             I'll get square with whoever did Al.\n             I'll get square with everybody. Then\n             I'm going going to cash in my chips\n             and be on my way to a new and better\n             me far away from here.\n                         LUPUS\n             You're a weasal.\nLupus gets off the stool and we follow him into...\nINT.- THE EUCLID/BATHROOM- CONTINUOUS\nLupus enters the small.    Bathroom and pulls a cellphone.\n\n\n\n\n                                           (CONTINUED)\n\n                                                              104.\nCONTINUED:\n                         LUPUS\n             Yeah... He's landing with the money at\n             Kennedy in a few hours. International\n             Terminal. You were right. He's trying\n             to fuck you. You want it, you gotta\n             get it at the airport...\n                                                            CUT TO:\nINT.- BULLDOG GYM/LOCKER ROOM- SAME\nThe King Pin closes the cell phone and looks over at\nHarlin, who's hair is singed and matted down on one side.\n                         KING PIN\n             He's got pigs for an escort.   You\n             believe this guy?\n                         HARLIN\n             I'll get the car.\n                         KING PIN\n             Always something.\nThe King struggles into a pair of pants, then turns\naround.\n                         KING PIN (cont' d)\n             My ass look big in this?\nHarlin deliberately looks away.\n                         HARLIN\n             Looks fine, Boss.\n                                                            CUT TO:\nEXT.-- JFK AIRPORT/PARKING LOT- NIGHT\nA black Lincoln Town Car rolls through the parking lot.\nBehind the wheel we see Harlin with the King Pin riding\nin the back.\nThe Town Car passes...\nMILES SITTING ON THE HOOD OF A CAR LOOKING AT THE\nTERMINAL.\nWe follow the Town Car as it passes...\nROTTOVICH AND SOBOZINSKI STAKED OUT IN AN UNMARKED POLICE\nCAR A FEW SPACES PAST MILES.\n\n\n\n\n                                              (CONTINUED)\n\n                                                          105.\nCONTINUED:\nThe Town Car finally parks in the same row, each car,\nseparated only by a few spaces.\n                                                        CUT TO:\nINT.- UNMARKED POLICE CAR- SAME\nSobozinski and Rottovich overlook the terminal.\n                         SOSOZINSKI\n             You trust this Moonan guy?\n                         ROTTOVICH\n             I don't trust anybody. You see   how bad\n             this guy wants Vig? It's like a\n             sickness. I say we collar Vig\n             ourselves. We got Vig, then we   got\n             leverage. And we trade; Vig for   that\n             tape. I want to see it right in   front\n             of my face.\n                         SOBOZINSKI\n             It's just insurance.\n                         ROTTOVICH\n             That's what I'm talking about.\n                          SOBOZINSKI\n             I'm down!\nSobozinski holds his hand up for a high five.\n                         ROTTOVICH\n             What are you doing?\n                          SOBOZINSKI\n             High five.\n                         ROTTOVICH\n             Put your hand down. I don't high five.\nThere's the CRACKLE from a walkie-talkie.\n                         MOONAN\n             You guys awake?\n                         ROTTOVICH\n                 (into walkie)\n             We're here.\n                                                        CUT TO:\n\n                                                         106.\n\n\nINT.- JFK AIRPORT/TERMINAL- SAME\nMoonan sits a safe distance away from an area marked\n\"Customs\". Behind a large table, a few CUSTOMS OFFICERS\nin white shirts mill around.\nMoonan speaks into a mic hidden in his sleeve.\n                         MOONAN\n          Stay sharp.\nMoonan keeps his eyes on the Customs desk.\n                                                       CUT TO:\nINT . - JET- NIGHT\nGordo sits squashed in the window seat, next to a VERY\nHEAVYSET COUPLE.\n                         MR. HEAVYSET\n          Oh jeez.\nMr. Heavyset quickly gets up.\n                                                       CUT TO:\nINT.- THE EUCLID- SAME\nJake sits at the bar, the phone a few inches away. Lupus\npours himself a drink from the bar. The phone RINGS.\n                         JAKE\n          Gordo.\n                                                       CUT TO:\nINT.- JET- SAME\nGordo on the Air-Phone next to MRS. HEAVYSET...\n                      GORDO\n          I'm landing in about fifteen minutes.\nMR. HEAVYSET returns to his seat, drying his hands on his\nown shirt.\n                      MR. HEAVYSET\n          Jeez... I tell ya, this airline food\n          goes right through me every time.\nMrs. Heavyset pats her husband's hand.\n                      GORDO\n          You ever use the bathroom in Kennedy?\n\n\n\n                                         (CONTINUED)\n\n                                                           107.\nCONTINUED:\n                         JAKE (O.S.)\n             What? No.   Use the bathroom on the\n             plane!\nGordo eyes Mr. & Mrs. Heavyset.\n                         GORDO\n             Let me just say that there is no way\n             I'm using the bathroom on this plane.\n                                                         CUT TO:\nINT.- THE EUCLID- SAME\nJake hangs up...\n                         JAKE\n             He's wheeling around two million dollars\n             in cash and he wants to stop to use the\n             bathroom. You believe this?\n                         LUPUS\n             Maybe he's got it right. Maybe we're\n             all just looking for a safe place to\n             shit.\n                         JAKE\n             That was fucking deep.\nLupus gets up and heads for the bathroom again.\n                                                         CUT TO:\nINT.- TOWN CAR- SAME\nA CELL PHONE RINGS with a digitized version of \"Ode to\nJoy\". The King answers it.\n                         KING PIN\n             Speak.\n                         LUPUS (O.S.)\n             He's landing. He's got a suitcase on\n             wheels.\n                         KING PIN\n             So do half the other people in this\n             place. How do I know which one?\n                         LUPUS (O.S.)\n             I got it figured out... He's got this\n             thing with bathrooms. If he makes it\n             through Customs, he'll be heading for\n             the john.\n\n\n\n\n                                           (CONTINUED)\n\n                                                             108.\nCONTINUED:\n                           KING PIN\n             Good. Good.     Do not let Vig out of\n             your sight.\nThe King hangs up the phone and motions to Harlin to go.\n                                                           CUT TO:\nINT. -- THE EUCLID BAR- SAME\nJake looks up at a small digital clock sitting behind the\nbar. It reads \"11:11PM.\"\nLupus emerges from the back hallway to find Jake dialing\na number.\n                         JAKE\n             What's up with you?   Bladder infection?\n                           LUPUS\n             Keep it up.\n                         LILY (O.S.)\n             You got my cell. Leave a message.\n                         JAKE\n             It's me. It's Jake. Listen... It's\n             happening. Gordo's landing right now.\n             Meet me at the Euclid... For your cut,\n             I mean. It's... I want you to have it.\nJake hangs up the phone.\n                          LUPUS\n             You really like that bitch don't you?\n             I gotta tell you, I was pretty\n             convinced that the whole thing before\n             was blowing her off for her cut. You\n             know how it is, get her to do some\n             shit for you, throw her a bang to keep\n             her happy. But, if you're into her...\n             That's cool.\n                         JAKE\n             That's what I like about you, Lupus.\n             You're a free thinker. Don't let the\n             King tell you different.\n                         LIONEL\n             Not for nothing, Jake, but the guy who\n             whacked your buddy? It was me. The\n             King usually farms out for that kind of\n             stuff, but I tell ya, he was so pissed\n             off he couldn't wait for the regular\n             guy. Fucker didn't even put down his\n             Kung Pao Chicken.\n\n\n                                             (CONTINUED)\n\n                                                            109.\nCONTINUED:\nJake seems to be reeling with the information.\n                         JAKE\n             Egg Foo Young.\n                 (standing)\n             Stand up.\n                         LUPUS\n             What?\n                         JAKE\n             Stand up.\n                         LUPUS\n                 (laughing)\n             No offense, but I've seen you fight.\n             You gotta be kidding m-\nJake's sends a fist flying right into Lupus' mouth,\nknocking him over.\n                         JAKE\n             I said stand up.\n                                                          CUT TO:\nINT.- MORGAN GILLETTE'S OFFICE- NIGHT\nMORGAN GILLETTE sits behind a desk in an ultra modern\noffice, his reptilian like face fixed straight ahead.\nButch leans against the wall behind him.\n                         JAKE (V.O.)\n             This is probably about where you came\n             in.\n                         GILLETTE\n             Wow. Now that's an exciting story.\n             Butch, has anyone ever tried something\n             like this before?\n                         BUTCH\n             Not that I recall.   What do you want us\n             to do about it?\n                         GILLETTE\n             Let's see... Let's suppose he gets to\n             Customs and he gets caught. We get our\n             money back, but then we have to deal\n             with a criminal investigation. I don't\n             much like that idea. Then again, let's\n             suppose he actually gets through\n             Customs. Now, that'll be something.\n             We recover the money in cash and let\n             the insurance cover the corporate fraud.\n             We double our money.\n\n\n                                            (CONTINUED)\n\n                                                            110.\nCONTINUED:\n                         BUTCH\n             So we go to the bar.\n                         GILLETTE\n             I think so. The airport's going to be\n             crawling with police. Traffic will be\n             a nightmare. Go down to the bar. If\n             they pull it off, great. Have someone\n             deal with Ashby.\n                         BUTCH\n             We'll take care of it.\n                         GILLETTE\n             And how much did you say you wanted for\n             this... What did you call it? A finder's\n             fee?\nREVEAL Lily sitting on the couch in front of them, cell\nphone in hand.\n                            LIL\n             Ten percent.\n                           GILLETTE\n             Ten?    That seems a little high.\n                         BUTCH\n             Ten is standard, sir.\n                           GILLETTE\n             Fine.    But only if we recover the cash.\n                           LILY\n             Only if--?    No way.     I want something\n             for this.\n                           GILLETTE\n             Have a   little faith in him, honey.\n             Butch,   see if you can get him to tell\n             you how   he did it. Or almost did it.\n             Sounds   like a good story.\n                            BUTCH\n             I' ll ask.\nGillette picks up an APPLE from a bowl in his desk... The\noldest con.\n                            GILLETTE\n             Apple?\n                                                          CUT TO:\n\n                                                           111.\n\n\nINT.- AIRPORT/TERMINAL HALLWAY- NIGHT\nWe follow Gordo as he wheels the black suitcase down the\nlong corridor towards the Customs Desk.\nMoonan spots Gordo and speaks into his wrist.\n                       MOONAN\n          I got him.\nANGLE ON THE CUSTOMS DESK\nA few TRAVELERS quickly move past the desk.    Gordo\napproaches a CUSTOMS OFFICER.\nGordo lays the suitcase on the desk: The Customs Officer\nlooks nervously in both directions before waving Gordo\nthrough.\nMoonan follows at a safe distance as Gordo clears\nCustoms.\n                                                         CUT TO:\nINT.- CAR- SAME\nRottovich and Sobozinski check their guns.\n                      MOONAN (O.S.)\n          He's headed towards the eastern most\n          exit. Do not, under any circumstances\n          approach. I want to follow this all\n          the way down to Vig.\n                      SOBOZINSK\n              (into walkie)\n          Roger that.\n                      ROTTOVICH\n          Oh yeah, we'll wait, jerk-off.\nSobozinski snorts a LAUGH as they get out of the car.\n                                                         CUT TO:\nINT.- JFK AIRPORT/TERMINAL- SAME\nGordo wheels the suitcase towards the exit when he spots\nthe MEN'S ROOM. He stops and considers for a moment before\nhe turns and enters.\nMoonan watches a few yards back. He pulls his badge out\nfrom under his shirt, hanging from a chain.\n\n\n\n\n                                           (CONTINUED)\n\n                                                              112.\nCONTINUED:\n                         MOONAN\n                 (into mic)\n             He just went into the crapper.\n             Hold your positions.\nHarlin walks into the Men's Room half a minute after\nGordo.\n                                                            CUT TO:\nINT.- MEN'S ROOM- SAME\nGordo pads the toilet with half the roll before gingerly\nsetting his ass down.\nSuddenly the STALL DOOR FLIES OPEN. Harlin steps in,\nGordo defenseless with his pants at his ankles.\nHarlin picks him up off the toilet and throws him into\nthe wall repeatedly before letting him fall face first\nonto the dirty floor.\n                                                            CUT TO:\nINT.- JFK AIRPORT/TERMINAL- CONTINUOUS\nMoonan watches the door to the Men's Room as Harlin comes\nout, wheeling the black suitcase behind him.\n                         MOONAN\n                 (into mic)\n             They pulled a switch.   Big guy.   Blue\n             suit. Keep on him.\n                                                            CUT TO:\nEXT.- JFK AIRPORT/PARKING LOT- CONTINUOUS\nRottovich turns the walkie talkie off as he and Sobozinski\nfall in behind Harlin.\nANGLE ON MILES-- Who steps out of his car, watching the\nlittle parade go by with a look of confusion.\n                                                            CUT TO:\nINT.- THE EUCLID- SAME\nA LOUD THUMPING NOISE... Jake has Lupus by the hair as he\nrams his head repeatedly into the bar. Jake then gets\nhim into a headlock.\nLupus snaps his head back and butts Jake in the nose,\nsending him staggering back.\n                                                            CUT TO:\n\n\n                                              (CONTINUED)\n\n                                                         113.\nCONTINUED:\nTNT.- JFK AIRPORT/TERMINAL- SAME\nMoonan taps the mic hidden in his sleeve, then checks the\nwalkie.\n                          MOONAN\n             Hello?   Can you hear me?\nMoonan pulls the ear plug out and races down the hall.\n                                                       CUT TO:\nEXT.- JFK AIRPORT/PARKING LOT- SAME\nHarlin gets to the King Pin's car and opens the back door.\nAs he crams the suitcase in, Rottovich and Sobozinski\ncome up behind him, guns drawn.\n                            ROTTOVICH\n             Hey asshole.\nThey both grin like idiots.\n                                                       CUT TO:\nINT.- THE EUCLID- SAME\nJake goes flying into the bar. Lupus pushed Jake back up\nagainst the bar and lands a series of body blows.\nJake manages to grab the phone and whips it across Lupus'\nhead, sending him to the ground. Jake straddles Lupus\nand raises the phone for the last whack.\nWe HEAR A LOUD CLICK.\nJake stops and the two slowly get up. As they stand, we\ncan see that Lupus has the barrel of a small gun in\nJake's mouth.\nJake shuts his eyes tight, still holding the phone.    Which\njust then, RINGS.\nJake opens his eyes and looks at the phone. Then to Lupus,\nwho nods. Jake picks up the receiver and speaks, the gun\nstill in his mouth.\n                            JAKE\n             Eww-Whoa?\n                                                       CUT TO:\nEXT.- JFK AIRPORT/PARKING LOT- SAME\nMiles on a cell phone...\n\n\n\n                                         (CONTINUED)\n\n                                                          114.\nCONTINUED:\n                         MILES\n             Jake! I don't know what's going on!\n             The King Pin... He's here and he just\n             got pinched. I think with the\n             twinkies! It looks like half the\n             police department's down here!\nIn the BACKGROUND, a whirlwind of activity-- Red and blue\nflashing lights, half of the police department, Federal\nAgents in blue windbreakers... The King and Harlin slumped\nover the hood of the car, cuffed.\n                                                        CUT TO:\nINT. - THE EUCLID BAR- SAME\nJake drops the phone and looks at Lupus.\n                         LUPUS\n             What happened?\n                         JAKE\n                 (w/ the gun still in\n                  his mouth)\n             Eee Oott Auught!\n                         LUPUS\n                 (pulling the gun out)\n             Sorry. What?\n                         JAKE\n             HE GOT CAUGHT! Your boss tried to pull\n             a switch and he got us all fucking\n             pinched!\nLupus picks up the phone and dials another number... No\nanswer.\n                           LUPUS\n             Shit.\nLupus cocks the gun and crams it back into Jake's mouth.\n                           JAKE\n             Aaaaiiit!!!    Ooopusss!!\nLupus takes a newspaper off the bar and covers Jake's\nface with it.\nSLAM!!!-- Blood splatters across the front page of the\nMetro Section. The paper falls away revealing Jake, wide-\neyed, the gun hanging from his mouth.\nLupus lies in a heap at the floor.\n\n                                                              115.\n\n\nCONTINUED:\nJake lets the gun fall and Looks up to see Butch, standing\nat the door, gun in hand.\nLily steps out from behind him.\n                         JAKE (V.O.)\n             I never thanked you for that.\n                                                           CUT TO:\nEXT. BACK ALLEY- NIGHT (PRESENT)\nJake runs his tongue across the front of his teeth.\n                         BUTCH\n             You're welcome.\n                         LILY\n             Can we please all stop being so\n             goddamnfucking-polite and get to the\n             point?\n                          BUTCH\n             Right.   Where's the money, Jake?\nButch presses the gun against Jake's head.       Jake turns\nand looks at Lily. They lock eyes.\n                         JAKE\n             What do you get, Lily? Finder's Fee?\n             Because it is all about the money,\n             right?\n                         LILY\n             You sold me out. You should have trusted\n             me like I trusted you. You fucked up.\n             You fucked up HUGE.\nButch taps Jake on the head with the gun.\n                          BUTCH\n             Alright... Turn around. She doesn't\n             get shit, unless I get that money.\n             Where is it?\n                         JAKE\n             Probably safe in the hands of the Federal\n             Government.\nButch buttons his coat.\n                         BUTCH\n             Oh, Jake. You disappoint me. And you\n             just let Lily here down again.\n                 (MORE)\n\n                                             (CONTINUED)\n\n                                                           116.\nCONTINUED:\n                         BUTCH (cont'd)\n             What was it you said about playing the\n             big con?\n                         JAKE\n             It's like putting on a play, where\n             everyone knows their part except for\n             the mark.\n                         BUTCH\n             Like putting on a play... Guess some\n             people forgot their lines.\n                         JAKE\n             Guess so.\n                         BUTCH\n             So why don't you take a deep breath,\n             Jake, and I'll count to ten. One.\n             Two. Three...\nAs Butch continues to count, Jake slowly turns his head\nand looks at Lily.\nButch, still counting, smiles at Lily's obvious contempt\nthen slides the gun along the back of Jake's head.\n                         JAKE\n             I do trust you, Lily.\nButch turns back to Lily to see her reaching into her\nbag...\n                         BUTCH\n             Wha-\nButch spins and aims at her.\nLily pulls out a gun and... BLAM!!!\n                                                         CUT TO:\nINT.- JFK AIRPORT/BATHROOM- SAME\nGordo stirs on the floor of the stall, slowly getting up.\nPieces of toilet paper are stuck to his face.\n                         JAKE (V.O.)\n             Trust...\n                                                         CUT TO:\nINT.- CAR- SAME\nMiles gets back in the car and SCREECHES out of his parking\nspace.\n\n                                           (CONTINUED)\n\n                                                           117.\nCONTINUED:\n                         JAKE (V.O.)\n             It should be a four letter word.\n                                                         CUT TO:\nEXT. - BACK ALLEY- NIGHT (PRESENT)\nLily drops the gun and breaks down in tears\n                         BUTCH\n             Jesus Christ! Tell me before you do\n             something like that!\nJake lies face down in a puddle, the collected pool of\nwater growing red with blood.\nPOLICE SIRENS WAIL in the distance, growing closer.\n                         BUTCH\n             You should leave.\nButch disappears down the dark alley.\nLily stands for a moment and takes a final look at Jake's\nbody. She then turns and runs back into the bar.\n                         JAKE (V.O.)\n             So I'm dead...\nEXT.- JFK AIRPORT/PARKING LOT- NIGHT\nPOLICE OFFICERS and FEDERAL AGENTS in windbreakers swarm\nall over the parking lot.\nThe King and Harlin are bent over the hood of the car,\ncuffed.\nOne Federal Agent pulls the black suitcase out of the\ncar.\n                         JAKE (V . O . )\n             But maybe I can't blame Lily. Maybe I\n             just should have just trusted her to\n             play her part. Because playing the big\n             con is like putting on a play. A play\n             where everyone knows their part except\n             for the Mark...\n                                                         CUT TO:\n(FLASHBACK) INT.- DINER\nJake sits with Lily, Miles and Gordo crammed into a\nbooth.\n\n\n\n\n                                           (CONTINUED)\n\n                                                           118.\nCONTINUED:\n                         JAKE\n             Just watch everything you say around\n             him. Every word, every move... It all\n             goes back to the King Pin. Get it?\n                                                         CUT TO:\n(FLASHBACK) INT.- JAKE'S APARTMENT\nLily with her new red hair and the bird blouse.      The crew\nwatches Jake slowly flip out.\n                         JAKE\n             You have no idea what you've done do\n             you? No idea! What is this?\nJake points to her hair.\nLupus quietly watches, taking it all in...\n                                                         CUT TO:\n(FLASHBACK) INT.-- THE EUCLID- DAY\nJake and Lily squaring off...\n                         JAKE (V.O.)\n             You tell them the \"Tale\".\n                         JAKE\n             What do you want?    An apology?\n                         LILY\n             No, I want my cut!\nLupus watches quietly, taking it all in...\n                                                         CUT TO:\n(FLASHBACK) INT.- THE EUCLID/BATHROOM\nLupus on the cellphone to the King...\n                         JAKE (V.O.)\n             And like in a game of chess, you've\n             played every possible move in your\n             head...\n                         LUPUS\n             You were right. He's trying to fuck\n             you. You want it, you gotta get it at\n             the airport...\n                                                         CUT TO:\n\n                                                          119.\n\n\nEXT.- JFK AIRPORT/PARKING LOT- NIGHT\nPOLICE OFFICERS and FEDERAL AGENTS in windbreakers swarm\naround the King Pin's car.\n                      JAKE (V.O.)\n          Then you give them the \"Blow-off\".     You\n          get them off your back. Forever.\nThe King Pin and Harlin are bent over the hood handcuffed.\nRottovich and Sobozinski lie on the ground, face down,\ntheir hands behind their heads.\n                      ROTTOVICH\n          We're on the job! We're active in the\n          one-six.\nNext to them, a Federal Agent opens the suitcase. Coffee\nbeans spill out on the asphalt, followed by the two bricks\nof heroin.\nThe TWO INTERNAL AFFAIRS officers from before emerge from\nthe crowd.\n                      IA OFFICER#1\n          Officers Rottovich and Sobozinski?\nThe second Internal Affairs officer holds up a\nMICROCASSETTE.\n                       SOBOZINSKI\n          Fuck me...\n                                                       CUT TO:\n(FLASHBACK) INT.- LA SCALA\nJake slides a thick envelope of money to Moonan, seated\nacross from him.\n                      JAKE (V.O.)\n          But most of all, you need the \"Fix\".\nThis time, Moonan TAKES IT.\n                                                       CUT TO:\n(FLASHBACK) INT.- THE EUCLID\nJake finishing the Moonan story...\n                      JAKE\n          That's how Special Agent Gunther Moonan\n          and I became friends.\n\n\n\n                                        (CONTINUED)\n\n                                                           120.\nCONTINUED:\nLupus nods, satisfied.\n                                                         CUT TO:\n(FLASHBACK) INT.- CUSTOMS DESK\nGordo hoists the suitcase onto the desk. The Customs\nOfficer looks around nervously. We see he's looking at\nMoonan in the B.G., who gives him a nod.\n                         JAKE (V.O.)\n             Like Suits said, sooner or later\n             someone's going to start asking the\n             right questions.\nThe Custom Officer waves Gordo through. Gordo reaches\ndown and picks up an IDENTICAL BLACK suitcase already\nlying on the table next to his and leaves.\n                         JAKE (V.O.)\n             Rottovich and Sobozinski would ask how\n             the drugs got in that suitcase. The\n             King and Gillette would ask where the\n             money really went.\nMoonan walks over to the Customs Desk and takes the\noriginal black suitcase. He nods to the Customs Officer.\nMoonan turns and walks TOWARDS CAMERA, wheeling the\nsuitcase behind him.\n                         JAKE (V.O.)\n             And all of them would ask what agency\n             Special Agent Gunther Moonan worked\n             for.\nWe CLOSE-IN ON THE BADGE hanging from Moonan's neck.     On\nit is a number and the single word, \"CUSTOMS\".\n                                                         CUT TO:\nEXT. BACK ALLEY- NIGHT (PRESENT)\nRIPPING SOUNDS...\n                         JAKE (V.O.)\n             But what do I care? I'm dead...\nA THIN, WHITE VEST, splattered with blood and wired with\nsquibs falls to the ground.\nPOLICE SIRENS WAIL just around the corner.\n                                                         CUT TO:\n\n\n\n\n                                           (CONTINUED)\n\n                                                            121.\nCONTINUED:\n\n\nJake emerges from .the back alley, his shirt ripped and\nsplattered with fake blood.\n                         JAKE (V.O.)\n             No one's going to ask me:\nA black car comes to a stop n front of him.    The tinted\nglass slides down and Jake leans in.\n                         JAKE\n             Drop something?\nInside we see Moonan and Lily riding in the back, Miles\nand Gordo up front.\n                         LILY\n                 (innocently)\n             Oops.\nShe smiles that smile.\n                           JAKE (V.O.)\n             Redheads...\nJake gets in and the car pulls away, followed seconds\nlater by two Police Cars SCREECHING to a stop in front of\nthe Euclid.\n                                               FADE TO BLACK:\n                                    THE END.\n\n\n\n\n\nConfidence\nWriters :   Doug Jung\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:57.251179"}