{"title": "Cowboys & Aliens", "film_link": "/Movie Scripts/Cowboys & Aliens Script.html", "script_link": "/scripts/Cowboys-&-Aliens.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Cowboys &amp; Aliens Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Cowboys-&amp;-Aliens.jpg\" title=\"Cowboys &amp; Aliens Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Alex Kurtzman\" title=\"Scripts by Alex Kurtzman\">Alex Kurtzman</a><br/>  <a href=\"/writer.php?w=Roberto Orci\" title=\"Scripts by Roberto Orci\">Roberto Orci</a><br/>  <a href=\"/writer.php?w=Damon Lindelof\" title=\"Scripts by Damon Lindelof\">Damon Lindelof</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : August 2009<br/>\n<b>Movie Release Date</b> : July 2011<br/>\n<br/>\n<a href=\"/scripts/Cowboys-&amp;-Aliens.html\">Read \"Cowboys &amp; Aliens\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n<b>                                COWBOYS &amp; ALIENS\r\n</b>\r\n\r\n\r\n                                   Written by\r\n\r\n                  Alex Kurtzman, Roberto Orci &amp; Damon Lindelof\r\n\r\n\r\n\r\n                                                           Aug 4th, 2009\r\n                         \r\n\r\n                         \r\n\r\n<b>          FADE UP ON:\r\n</b>          SPACE. Infinite stars. A TITLE:\r\n\r\n<b>          1870. THE ARIZONA TERRITORY.\r\n</b>          We descend past DARK CLOUDS. Violent FLASHES ripple within.\r\n          Thunder blends with DRUMS as we reach a BOX CANYON...\r\n\r\n<b>          A BONFIRE -- SILHOUETTED BODIES -- APACHE WARRIORS\r\n</b>          Whirling around the fire -- war paint -- masks and headdresses --\r\n          a RELIGIOUS RITE or CELEBRATION. On the periphery, we FIND...\r\n          A BEAUTIFUL APACHE WOMAN. Softly singing to the even more\r\n          beautiful BABY in her arms as we FOLLOW THEM INTO --\r\n          A TEEPEE. The simple melody of the woman's song as she lays the\r\n          baby on a blanket, gently swaddling it, LOVE in her eyes.\r\n          But.\r\n          The wind starts to HOWL. QRAJ. And then... a BURST OF\r\n          LIGHT through the opening of the teepee -- intense ULTRAVIOLET:\r\n          FWHOOOOOOOOOOOOOOOSHHss!!!\r\n\r\n<b>          THE E IRE TENT IS RIPPED UP INTO THE SKY, LEAVING THE WOMAN AND\r\n</b>          HER BABY-EXPOSED!!!! She SCREAMS -- grabs her child and starts\r\n          to RUN -- CHAOS EVERYWHERE as the tribe scatters in TERROR --\r\n          Suddenly -- Apaches are getting YANKED INTO THE AIR by some\r\n          superior force -- PLUCKED savagely into the light, GONE -- as we\r\n          WHIP AROUND the horror show of SCREAMING, DISAPPEARING INDIANS --\r\n          And now -- A DEAFENING SHRIEK AS STRANGE DOMED OBJECTS HURTLE\r\n\r\n<b>          DOWN, CRASHING LIKE COMETS TO THE CANYON FLOOR AND CRUSHING\r\n</b>\r\n<b>          FLEEING PEOPLE.\r\n</b>          Impossibly, the objects are STEEL MACHINES. BELLY VENTS snap\r\n          open and DRILL CONES drop out -- jagged teeth CHURN TO LIFE --\r\n          faster -- FASTER -- as the drills begin CHEWING INTO THE GROUND.\r\n          THE WOMAN -- staggering back in SHOCK and AWE -- clings to her\r\n          baby for one final SCREAM and -- BLACK. Over which we read:\r\n          C--() ... .-4ï¿½_ s A N D A\r\n\r\n<b>          EXT. ARIZONA DESERT - DAY\r\n</b>\r\n          burning sun FLARES LENS, beating down on... A MAN.\r\n          Lying in the barren DESERT. Out cold. Handsome... but HARD.\r\n          We'll call him THE MAN IN BLACK, the color of his dirty clothes.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          2.\r\n</b>          A PINK TONGUE LICKS HIM. The man STARTS AWAKE -- to find a\r\n          MONGREL DOG over him. Mangy. But sweet.\r\n          COUGHING, the man stumbles up. How'd he get here? And where\r\n          the hell i.: here? And -- OWWW. A GASH in his side...\r\n          .. part of the wound oddly SEARED. He winces. Trying to solve\r\n          this painful puzzle. Something GLINTS on his wrist:\r\n          A STEEL BRACELET. No clasp to pull it off. He touches the\r\n          surface -- TSSS -- SHIT -- It's HOT!\r\n          And there's a BLACK STETSON on the ground. The Man grabs it to\r\n          shield his eyes... but STOFS:\r\n          A WORN PHOTOGRAPH in the inner brim. A WOMAN. Young,\r\n          beautiful. SMILING.\r\n          The Man stares: does he KNOW this woman? is this even HIS hat?\r\n          The dog BARKS ALERT. The man turns -- QUICK -- his hand reaches\r\n          toward his hip on INSTINCT but there's no holster. NO GUNS.\r\n\r\n<b>          THREE RIDERS ON HORSEBACK ARE COMING OVER THE RISE:\r\n</b>          THE CLAIBORNE BROTHERS -- WES, MOSE and LUKE. Dusty and tough.\r\n          Wes gallops right up to our Man, gives him the once over --\r\n\r\n<b>                         WES CLAIBORNE\r\n</b>          Howdy.\r\n\r\n<b>                         (NO RESPONSE)\r\n</b>          We're riding towards Absolution. You\r\n          know how far west we are?\r\n          The Man's got NO IDEA what he's talking about.\r\n\r\n<b>                         LUKE CLAIBORNE\r\n</b>          Maybe he's a dummy.\r\n          Wes hops off his horse, right in The Man's face now --\r\n\r\n<b>                         WES CLAIBORNE\r\n</b>          There a reason you don't wanna answer my\r\n          question, friend?\r\n          And now, Mose nods to the BRACELET on The Man's wrist --\r\n\r\n<b>                         MOSE CLAIBORNE\r\n</b>          Wes, he's got iron on his wrist... and\r\n          he's been shot.\r\n\r\n<b>                         LUKE CLAIBORNE\r\n</b>          Bet he's a chain jumper.\r\n          Luke spurs his horse behind him -- The Man's SURROUNDED.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          3.\r\n</b>\r\n<b>                         LUKE\r\n</b>          If he escaped, there'll be a bounty.\r\n          Let's bring him with us.\r\n          Wes nods as he slides a SAWED-OFF DOUBLE-BARREL from his back\r\n          scabbard. COCKS both barrels. The dog GROWLS --\r\n\r\n<b>                         WES CLAIBORNE\r\n</b>          Not your lucky day, Stranger -- turn\r\n          round and start walking.\r\n          But The Man doesn't move. The Claibornes share glances. Wes\r\n          steps forward -- RAISING HIS RIFLE --\r\n\r\n<b>          WES CLAIBORNE (CONT'D)\r\n</b>          Dead or alive, no difference. I said\r\n\r\n<b>                         WALK OR--\r\n</b>          THE MAN MOVES, A MECHANISM OF BRUTAL VIOLENCE -- YANKS the rifle\r\n          forward as BLAMI -- shot goes WILD -- suddenly the gun's in THE\r\n          MAN'S HANDS -- BLAXI Wes is BLOWN backwards, HOLE IN HIS CHEST!\r\n          As Hose draws his Enfield, The Man FLIPS the rifle again --\r\n          SLAM! MOSE FLIES OFF HIS SADDLE as The Man rolls -- UNDER\r\n          Luke's horse -- GRABBING Luke's ankle -- suddenly Luke's FLAT on\r\n          his back -- BREATHLESS, staring UP at the double-barrel:\r\n\r\n<b>                         LUKE CLAIBORNE\r\n</b>          -- P-please, God -- d-don't --\r\n          -- The Man PULLS the trigger but CLICK! The rifle's EMPTY.\r\n          Luke's RELIEF is short as The Man SLAMS the gun-butt down,\r\n          knocking him out cold. And ALL of this took about ten seconds.\r\n          This man is a cold-blooded KILLER. But somehow... he didn't\r\n          seem to KNOW that. CONFUSION. Drops the rifle, looks down at\r\n          his hands... covered in BLOOD. And the BODIES in his wake.\r\n          The WIND loosens a piece of PAPER from Wes's jacket. It DANCES\r\n          on the breeze -- flattens against The Stranger's foot. He picks\r\n          it up, BLOODY FINGERPRINTS on what we now see is a TELEGRAM --\r\n\r\n<b>          \"TO FORT STANTON -- STOP -- ABSOLUTION TOWNSHIP BESIEGED BY\r\n</b>\r\n<b>          OUTLAWS -- STOP -- FIFTY DOLLARS FOR ANY MAN WITH A GUN -- STOP\r\n</b>\r\n<b>          -- ABSOLUTION AWAITS -- STOP\"\r\n</b>\r\n<b>          THE MAN IN BLACK\r\n</b>          (a hoarse whisper)\r\n          Absolution...\r\n\r\n<b>          SLAM TO MOMENTS LATER:\r\n</b>          With a HYA! The Man sends two horses GALLOPING, mounts the\r\n          third, wincing at that gash in his side. Starts to trot off...\r\n          sees the dog following...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          4.\r\n</b>\r\n<b>          THE MAN IN BLACK (CONT'D)\r\n</b>          Get outta here. Leave me alone.\r\n          But the dog keeps following. Like they're FRIENDS now. The man\r\n          turns away dismissively as we BOOM UP to reveal the WIDE OPEN\r\n          VALLEY below... and a SPECK within it that is:\r\n\r\n<b>          EXT. TOWN - MAIN STREET - DAY\r\n</b>\r\n          A CROOKED SIGN: \"ABSOLUTION.\" The town is dismal and forgotten.\r\n          Crumbling buildings blistered by sun. The Man rides in --\r\n          dehydrated, the wound DRAINING him.\r\n          His eyes fall on the first building he sees... A CHURCH.\r\n\r\n<b>          INT. CHURCH - DAY\r\n</b>\r\n          BAM! The door flies open and VOTIVE CANDLES FLICKER. The Man\r\n          looks at the dog and says --\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Stay.\r\n          The dog sits by the door as The Man enters -- EMPTY -- he's\r\n          moving -- into a small kitchen area -- bottle of whiskey --\r\n          uncorks it with his teeth -- drinks -- pours some on the wound --\r\n          then A PISTOL COCKS behind him --\r\n          Meet MEACHAM, town preacher, a tough, wash-foot Baptist:\r\n\r\n<b>                         MEACHAM\r\n</b>          Palms to heaven, Friend.\r\n          The Man freezes. Turns up his hands.\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Been shot.\r\n\r\n<b>                         MEACHAM\r\n</b>          Only two kinds of men get shot --\r\n          criminals and victims.\r\n          (steps forward; hard)\r\n          Which one're you?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          don't know.\r\n          Meacham hears the HONESTY in his voice. Knows a lost soul when\r\n          he sees one. Lowers his gun, softening...\r\n\r\n<b>                         MEACHAM\r\n</b>          Got a name, son?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Don't know that either.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          5.\r\n</b>\r\n<b>                         MEACHAM\r\n</b>          What do you know?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          (a beat; then)\r\n          ... English.\r\n          Off Meacham, INTRIGUED -- we CUT TO:\r\n\r\n<b>          INT. CHURCH RECTORY - LATER\r\n</b>\r\n          A CANDLE FLAME -- a NEEDLE passing through it -- it's LATER and\r\n          Meacham's studying The Man's wound:\r\n\r\n<b>                         MEACHAM\r\n</b>          Odd wound. Looks... cauterized.\r\n          (off The Man's look)\r\n          Means somethin' burned it half closed.\r\n          The Man just stares. News to him. And now, as Meacham leans\r\n          over the wound, the METAL CROSS around his neck begins to\r\n          twitch... lifting ever so SLIGHTLX off his chest -- towards the\r\n          strange BRACELET on the Man's wrist. Meacham reacts --\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          Nice trick. That some kinds... magnet?\r\n          The Man looks at him -- \"What the hell is a 'magnet'?!?\"\r\n          Meacham shrugs it off, readies the needle --\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          Try'n hold still.\r\n          He pokes the hot needle through the wound -- The Man winces\r\n          slightly, but bears the pain.\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          Where'd you ride in from?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          West. Woke up in the desert.\r\n          Looking up at the sun like I'd been\r\n          dropped outta the sky.\r\n\r\n<b>                         MEACHAM\r\n</b>          Seems I remember a story about that\r\n          happening once... fella by the name of\r\n          Lucifer.\r\n\r\n<b>                         (GRINS)\r\n</b>          How 'bout I just call you \"Luke,\" for\r\n          short.\r\n          But TheMan's distracted by his REFLECTION in a cracked mirror:\r\n          his own face unfamiliar. Meacham nods towards The Man's HANDS --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          6.\r\n</b>\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          That blood yours or somebody else's?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Three men rode up. Drew on me.\r\n\r\n<b>                         (STILL CONFUSED)\r\n</b>          My hands... moved on their own.\r\n\r\n<b>                         MEACHAM\r\n</b>\r\n<b>                         (A BEAT)\r\n</b>          Anything else you wanna confess to while\r\n          you got my attention?\r\n          And The Man senses somehow that, ygg, there is... but:\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Everything that happened before I woke\r\n          up...\r\n          (shakes his head)\r\n          It's gone.\r\n\r\n<b>                         MEACHAM\r\n</b>          Well. Too bad. Can't absolve you for\r\n          your sins if you don't recall 'em. That\r\n          bein' said...\r\n          Meacham looks up, eyes twinkling. This is not a fire n'\r\n          brimstone preacher. This is a guy who GETS IT --\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          I seen bad men do good things and good\r\n          men do bad things. Whether you end up in\r\n          heaven or hell... it's not God's plan...\r\n          it's yours.\r\n\r\n<b>                         (BEAT)\r\n</b>          You just got to remember what it was.\r\n          The Man considers. Darkly --\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          What if I don't want to remember?\r\n\r\n<b>                         MEACHAM\r\n</b>\r\n<b>                         (BEAT; GRINS)\r\n</b>          Then you're probl'y goin' to hell.\r\n          On cue -- SMASH!!! The stained glass window EXPLODES as a\r\n          MOLOTOV COCKTAIL hurtles into the church. FIRE spreads around\r\n          the pews -- MEACHAM ACTIVATES -- tears curtains off the\r\n          confessional and uses them to STAMP OUT the fire --\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          Dammit -- it's Dolarhyde's men!\r\n          WHOOPS and HOLLERS and GUNSHOTS outside! The Man whirls to see\r\n          A DOZEN MEN ON HORSEBACK, marauding through town --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          7.\r\n</b>\r\n<b>          EXT. ABSOLUTION - MAIN STREET - CONTINUOUS\r\n</b>\r\n          Their leader is PERCY DOLARHYDE, a cocky, hot-tempered bastard --\r\n          he ignites another Molotov, hurls it at the CLAIMS OFFICE --\r\n\r\n<b>                         PERCY\r\n</b>\r\n<b>          THIS IS A MESSAGE FROM MY FATHER! ONLY\r\n</b>\r\n<b>          CLAIM TO LAND AROUND HERE'S THE ONE WITH\r\n</b>          HiS NAME ON IT!\r\n          The gang rides down Main Street, HOOTING -- Percy cocks another\r\n          Molotov, aiming for the SALOON --\r\n          But one of his men, half-Apache NAT COLORADO, shouts:\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Percy! N2t the saloon!\r\n\r\n<b>                         PERCY\r\n</b>          Why the goddamn hell not?!\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Cause your dady said so.\r\n          Something LOADED in the way he emphasizes \"daddy.\" Percy GLARES\r\n          -- strange RESENTMENT between them. With a growl, Percy GALLOPS\r\n          OFF, chucks the flaming bottle onto the CHURCH STEPS:\r\n\r\n<b>          INT. MEACHAN'S CHURCH - CONTINUOUS\r\n</b>\r\n          Meacham finishes putting out the fire, grabbing a couple\r\n          blankets as he moves past The Man --\r\n\r\n<b>                         MEACHAM\r\n</b>          You wanna help or are you just gonna\r\n          stand there and burn?!\r\n\r\n<b>          EXT. CHURCH - PORCH - CONTINUOUS\r\n</b>\r\n          FRIGHTENED TOWNSPEOPLE run for the sanctuary of the church,\r\n          Meacham SWATS OUT the fire on the steps --\r\n\r\n<b>                         MEACHAM\r\n</b>          All right, folks -- don't panic! Get\r\n          inside and you'll be fine... C'mon...\r\n          Meacham tosses The Man one of the blankets, nods across the\r\n          street to the GENERAL STORE which is just STARTING to burn --\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          Put it out before it gets goin'!\r\n          ON THE MAN, not sure how he suddenly became the damn fire\r\n          brigade, but HUSTLING across the street to --\r\n\r\n<b>          THE GENERAL STORE\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          8.\r\n</b>          WHIPS open the blanket, beats at the flames advancing toward the\r\n          roof -- PUTS THE FIRE OUT as the door FLIES OPEN and out steps:\r\n          A KID. 11. Rough n' tumble. And right now, mouth full of\r\n           LICORICE. Two FULL JARS of CANDY in his hands. OOPS:\r\n\r\n<b>                         KID\r\n</b>          Just tryin' to save the candy.\r\n          (SWALLOWS, worried now)\r\n          You one of my Pa's hired guns?\r\n          Before he can answer, HOOFBEATS behind them -- and here's PERCY.\r\n          He yanks the reins, pulls his REVOLVER on our Man --\r\n\r\n<b>                         PERCY\r\n</b>          Who the hell're yam?\r\n          Whatever the opposite of Love At First Sight is, THIS is it:\r\n\r\n<b>                         THE MAN\r\n</b>          Nobody.\r\n\r\n<b>                         PERCY\r\n</b>          Nobody is right. You think you can just\r\n          collect your fifty dollars and ride off?\r\n          You signed up for the wrong side, boy.\r\n          The kid's scared. The Man ISN'T, despite the gun in his face:\r\n\r\n<b>                         PERCY (CONT'D)\r\n</b>          Tell you what. You get down on your\r\n          knees and kiss my boot.\r\n          The Man's eyes narrow --\r\n\r\n<b>                         PERCY (CONT'D)\r\n</b>          You do that and I'll let you run back to\r\n          wherever the hell you came from so you\r\n          can tell whoever you see...\r\n          (cocks his gun)\r\n          Absolution belongs -tg..th-e- 1Dolar es.\r\n\r\n<b>                         THE MAN\r\n</b>          You want me to kiss your boot?\r\n          Percy extends his boot just INCHES from The Man's face:\r\n\r\n<b>                         PERCY\r\n</b>          Tongue's just fine if you're feelin'\r\n          amorous. Don't hold ba --\r\n          THWIP! The Man YANKS Percy's boot off his foot in one quick\r\n          move and KWHAM!!!1 WINGS IT RIGHT INTO PERCY'S FACE!\r\n          Percy FLIES off the HORSE -- The Man grabbing his rifle -- the\r\n          moment Percy lands, it's STICKING into his NECK:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          9.\r\n</b>\r\n<b>                         THE MAN\r\n</b>          Kiss this, you sonofa --\r\n\r\n<b>          NAT COLORADO (O.S.)\r\n</b>\r\n<b>          -- PUT IT DOWN !\r\n</b>          -- Nat Colorado gallops around the corner, SHOTGUN RAISED.\r\n\r\n<b>                         PERCY\r\n</b>          Goddamnit, Nat -- SHOOT HIM!!!\r\n          -- but The Man yanks Percy up by his collar, using him as a\r\n          SHIELD between himself and Colorado. Eerily calm --\r\n\r\n<b>                         THE MAN\r\n</b>          Wherever you came from? Go back.\r\n          Colorado knows he's dealing with a PROFESSIONAL. MORE GANG\r\n          MEMBERS ride up, surprised -- a dirty outlaw, GREAVEY, barks:\r\n\r\n<b>                         GREAVEY\r\n</b>          Sheriff's right behind us, Nat!\r\n\r\n<b>                         PERCY\r\n</b>          You goddamned shitheels! Don't you even\r\n          THINK about leavin' me!!!!\r\n          Colorado -- DECISION -- doesn't take long -- glares at The Man --\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Be seeing you.\r\n\r\n<b>                         THE MAN\r\n</b>          Look forward to it.\r\n          With that, Nat spurs his horse -- YA! The others follow him as\r\n          he RIDES HARD out of town. Percy growls at The Man --\r\n\r\n<b>                         PERCY\r\n</b>          You are a dead man. You hear me? So\r\n          help me God I will kill you my--\r\n          DM! The Man's SMASHES Percy's skull with the gun, knocking him\r\n          OUT COLD, as LAWMEN approach on horseback --\r\n\r\n<b>                         KID\r\n</b>          FA! He caught Percy Dolarhyde!\r\n          SHERIFF KYLE TAGGART rears up on his horse. Tall, dark and\r\n          handsome despite a SADNESS in his eyes, already dismounting:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Emmett -- you all right?\r\n          The Kid (now EMMETT) strides towards his father excitedly:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          10.\r\n</b>\r\n<b>                         EMMETT\r\n</b>\r\n<b>                         YOU-SHOULDA-SEEN-IT-HE-TOSSED-PERCY-L IKE-\r\n</b>          a-f lap jack- then-stared-down-Nat-Colorado-\r\n          like-he-wasn't-even-scared!!!!\r\n          Taggart turns to The Man now, cautious, but grateful --\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Pardon my boy, mister. He can be\r\n          excitable.\r\n          (puts out his hand)\r\n          Kyle Taggart.\r\n          The Man shakes Taggart's hand. A beat. Then --\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          . Luke.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Well I'm in your debt, Luke. Tune of\r\n          fifty dollars, actually.\r\n          (off The Man's look)\r\n          Our advert? The telegram?\r\n          The Man NODS -- Oh, RIGHT.\r\n\r\n<b>           SHERIFF TAGGART (CONT'D)\r\n</b>          Could use a man like you in case any of\r\n          'em come back...\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          -- I'm just passing through.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Fair enough. You don't mind spending the\r\n          night, bank opens in the morning... I'll\r\n          get you your money then.\r\n          (nods down the street)\r\n          Saloon's got rooms. You just tell Maria\r\n          I sent you.\r\n          The Man tips his hat, nods to Emmett (still STARSTRUCK), turns\r\n          to go. Taggart furrows his brow as the DOG scampers after him.\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          You here with the prospector woman?\r\n          The Man stops. Intrigued. Turns back --\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          woman?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Yup. Real looker. Came into town\r\n          yesterday with that there dog. She a\r\n          friend of yours?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          11.\r\n</b>          ON THE MAN. His first real LEAD.\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Maybe.\r\n          And as The Man heads off, we HOLD ON TAGGART, his spidey-sense\r\n          tingling that all is not RIGHT with this...\r\n\r\n<b>                         DEPUTY WADE\r\n</b>          Somethin' wrong, Kyle?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          What's that French sayin' where you swear\r\n          you seen someone before?\r\n\r\n<b>                         DEPUTY WADE\r\n</b>          Don't speak French.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          No... you sure's hell don't.\r\n          Taggart takes one last look at The Man departing as we CUT TO:\r\n\r\n<b>          EXT. CATTLE RANGE - MAGIC HOUR\r\n</b>\r\n          300 head of CATTLE under a blood red sky -- BOOM DOWN to THREE\r\n          RANCH HANDS by a fire. One's drinking liberally from a BOTTLE;\r\n          call him ROY CLANTON. The other two trade glances, nervous:\r\n\r\n<b>                         RANCH HAND #1\r\n</b>          Should take it easy there, Pal --\r\n\r\n<b>                         RANCH HAND #2\r\n</b>          Mr. Dolarhyde don't like it when we drink\r\n          on the job.\r\n\r\n<b>                         ROY CLANTON\r\n</b>          I don't give a damn what he don't like --\r\n          gotta sit here and babysit a damn herd of\r\n          cattle. Dolarhyde ain't gonna do squat.\r\n          (rises; grabs his\r\n\r\n<b>                         CROTCH)\r\n</b>          Gotta see a man about a buffalo...\r\n          He lets out a big BURP and stumbles off behind a ridge. More\r\n          THUNDER. Something doesn't feel right. A sudden WHOOSH and --\r\n\r\n<b>          A COW'S PULLED INTO THE AIR BEHIND THEM BY SOME INVISIBLE FORCE,\r\n</b>          JUST LIKE THE APACHES IN OUR OPENING! Flies STRAIGHT UP, out of\r\n          FRAME. Its PLAINTIVE MOO blending into all the others:\r\n\r\n<b>                         RANCH HAND #1\r\n</b>          You hear that?\r\n\r\n<b>                         RANCH HAND #2\r\n</b>          Hear what?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          12.\r\n</b>          ANOTHER COW zips up from the herd behind them. And ANOTHER.\r\n          MANY OF THE SWSSHS. The men slowly turn toward the sound as --\r\n\r\n<b>          ALL AT ONCE, HUNDREDS OF COWS FLY OFF INTO THE SKY!\r\n</b>\r\n<b>                         RANCH HAND #1\r\n</b>\r\n<b>          SWEET JESUS!!!\r\n</b>\r\n<b>          THE DARKNESS EXPLODES WITH EERILY BRILLIANT BLUE LIGHT! THE MEN\r\n</b>\r\n<b>          SCREAM AS THEY'RE ENGULFED IN IT AND --\r\n</b>          ROY CLANTON -- comes RUNNING back up the hill, pulling up his\r\n          pants as the light DISAPPEARS -- to find the men GONE. So are\r\n          the COWS. PULL BACK... he's ALL THAT'S LEFT in the open range.\r\n\r\n<b>          INT. GOLD LEAF SALOON - NIGHT\r\n</b>\r\n          THE BATWING DOORS SWING OPEN: The Man In Black enters with the\r\n          dog, tips his hat to a couple WHORES. They GRIN, liking what\r\n          they see. RANCH HANDS drink their pay. Behind the bar, a MAN\r\n          and WOMAN argue. DOC and MARIA; she's a buxom Mexican beauty;\r\n          he's 300 roly-poly pounds of ANXIOUS CASTILIAN JEALOUSY:\r\n\r\n<b>                         DOC\r\n</b>          -- I know you are, don't lie to me!\r\n\r\n<b>                         MARIA\r\n</b>          How many times do we have to do this,\r\n          Arturo? J. love you.\r\n\r\n<b>                         DOC\r\n</b>          Really? Do you?!?\r\n          (holds up a POCKETWATCH)\r\n          I found this in our bed! And I don't\r\n          k3 Vg. a watch, Maria. I can't AfjQrd a\r\n          watch because y insisted we buy this\r\n          saloon!\r\n          She looks at him SQUARELY -- yes, some SECRET withheld. As The\r\n          Man In Black reaches the bar, he's Maria's EXCUSE to end this:\r\n\r\n<b>                         MARIA\r\n</b>          We have customers.\r\n          And MOVES off. Doc stomps toward the exit -- sees EMMETT at the\r\n          back of the bar stealing sips of BEER from left-behind glasses:\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>          AFUERA! ADULTS ONLY!!!\r\n</b>          Emmett RUNS OUT. The Man sits beside an old cuss named ATTICUS.\r\n          The dog heels at The Man's feet, eyes a STEAK on Atticus' plate:\r\n\r\n<b>                         ATTICUS\r\n</b>          That mutt makes a move for my steak, I'll\r\n          drill him down.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          13.\r\n</b>\r\n<b>                         MARIA\r\n</b>          Shut up, Atticus. This is the man who\r\n          took out Percy Dolarhyde.\r\n          Atticus grumbles and goes back to eating, but not before\r\n          sweeping his duster aside to show the GUN in his holster. Maria\r\n          rolls her eyes, sets a GLASS in front of The Man, who nods:\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          I'm looking for a woman.\r\n          She gestures to the WHORES --\r\n\r\n<b>                          MARIA\r\n</b>          What kind?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          This kind.\r\n          He removes the PHOTO from inside his hat. The one of the WOMAN.\r\n\r\n<b>                         MARIA\r\n</b>          Never seen her before. But she is\r\n          beautiful.\r\n          (pours him whiskey; then\r\n          one for herself)\r\n          Here's to you finding her, Senor.\r\n          ON THE MAN. Not exactly sure he WANTS to. But they CLINK\r\n          glasses, knock 'em back. Maria pours him another:\r\n\r\n<b>                         MARIA (CONT'D)\r\n</b>          You have any idea what kind of mess you\r\n          just stepped into?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          No. But I figured I'd be safe in here\r\n          seein' as how that boy I tossed off his\r\n          horse didn't wanna burn your saloon.\r\n          Maria's eyes go down. Somehow GUILTY. But then:\r\n\r\n<b>                          - -\r\n</b>\r\n<b>                         MARIA\r\n</b>          It's not the boy you should worry about.\r\n\r\n<b>                         (OMINOUS)\r\n</b>          It's his papa.\r\n\r\n<b>          EXT. RANCH - NIGHT\r\n</b>\r\n          POV: UPSIDE DOWN, A MAN, surrounded by his RANCH HANDS -- his\r\n          FACE just out of the light, hat brim lowered under an oil lamp:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Name's Woodrow Dolarhyde. I'm what you\r\n          might call, the Tall Hog at the trough.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          14.\r\n</b>          His face comes INTO light: 50's, tailored finery, patent leather\r\n          Wellington boots that bespeak wealth. HARD. Exudes POWER:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          You're Roy, right? Clanton, is it? Been\r\n          working for me two weeks now, and I\r\n          haven't had the pleasure.\r\n          Our POV belongs to ROY CLANTON, the ranch hand from the cow\r\n          abductions. TERRIFIED -- his arms and legs TIED TO THE SADDLES\r\n          OF TWO HORSES, kicking dirt in front of Dolarhyde's RANCH HOUSE:\r\n\r\n<b>                         CLANTON\r\n</b>          Mr. Dolarhyde, I... I swear I didn't\r\n\r\n<b>                         STEAL YOUR--\r\n</b>          -- a VIOLENT \"SSST\" from Dolarhyde JOSTLES the horses --\r\n          STRETCHING Roy tight enough to SNAP -- he SCREAMS --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Best not to interrupt me, Roy, makes the\r\n          horses skittish.\r\n\r\n<b>                         (THEN)\r\n</b>          You partial to history? Here's a primer,\r\n\r\n<b>                         LISTEN CLOSE:\r\n</b>          He pulls out a WHIP, gripping it by its STERLING SILVER HANDLE.\r\n          Starts CIRCLING the horses as he lets the whip UNFURL:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Following the War Of Northern Aggression\r\n          -- what some ironically refer to as the\r\n          \"Civil\" War -- came a prodigious nation-\r\n          wide market for beef. Cowtowns sprang up\r\n          all along these prairies, Roy; populated\r\n          by enterprising young drovers -- among\r\n          'em, my daddy, Jeremiah Dolarhyde. Sold\r\n          six of his gold teeth and a sword gifted\r\n          to him by Robert E. Lee for twenty of the\r\n          scrawniest Longhorns you ever saw -- then\r\n          turned 'em into the fattest herd West of\r\n          the Chisholm Trail.\r\n          (stops: the WHIP)\r\n          Watched him work this lash, driving those\r\n          steer til his fingers bled... but what\r\n          good's a whip without a herd, Roy?\r\n          And slowly, torturously, SWEEPS the whip tip in the dirt...\r\n\r\n<b>                         ROY CLANTON\r\n</b>          Mr. Dolarhyde, Sir, you gotta believe me\r\n          -- I went to take a piss and and -- saw a\r\n          light in the sky -- blue -- and when I\r\n          ran back the cows and fellas were gone!\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          15.\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          The sky. Opened up. And took my cows.\r\n          Incoming HOOFBEATS -- Dolarhyde looks up to see COLORADO and the\r\n          rest of the GANG returning from Absolution.\r\n          A WOMAN emerges from the servant's quarters. APACHE. 50's.\r\n          Beautiful. As the men REAR, Nat Colorado MEETS EYES with her.\r\n          A relationship we don't understand yet as Dolar strides up --\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Where's Percy?\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Jail. Sheriff locked him up.\r\n          Dolar darkens. Unsheathes a KNIFE. Looks down at Roy:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          When're these people gonna lgarn?\r\n          He STABS the knife down... SLICING the rope tethered to Roy's\r\n          FEET. His lower body SLUMPS to the ground, he breathes a SIGH:\r\n\r\n<b>                         ROY CLANTON\r\n</b>\r\n<b>                         THANK Y--\r\n</b>          Dolar SLAPS the horse's rump, to which Roy's UPPER TORSO is\r\n          tied; it GALLOPS off, dragging a SCREAMING ROY into the night.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Everyone saddle up. Got us a sheriff to\r\n          kill.\r\n          As he MOVES OFF, Dolarhyde's eyes go to the Apache Woman.\r\n          Something passes between them. She seems CONCERNED.\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Wasn't the sheriff, got him caught. It\r\n          was a stranger.\r\n          That STOPS Dolarhyde. He turns back, face dark:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          ... What stranger?\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Usually a man gives off a scent. Where\r\n          he's been. What he's done.\r\n\r\n<b>                         (STILL SPOOKED)\r\n</b>          He didn't have one.\r\n\r\n<b>          OFF DOLARHYDE, EYES BURNING --\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          16.\r\n</b>\r\n<b>          INT. SHERIFF TAGGART'S OFFICE - NIGHT\r\n</b>\r\n          A BULLET, in close up, twirling between the thumb and forefinger\r\n          of SHERIFF TAGGART. Boots up on his desk, TROUBLED.\r\n          Deputy Wade pours himself a cup from a TIN POT OF COFFEE:\r\n\r\n<b>          DEPUTY CHARLIE WADE\r\n</b>          Percy wouldn't've come in shooting\r\n          without his daddy's say-so, Kyle. You\r\n          best get ready for a war 'cause that's\r\n          what's comin'.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Tomorrow we ride the little shit up\r\n          Phoenix way, turn him over. Dolarhyde's\r\n          got a beef, he can take it up with the\r\n          6th cavalry.\r\n          Taggart's on his feet, grabs his JACKET off the door --\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          Goddamn tired of this... fatass rancher\r\n          scaring good people off their lan--\r\n          He STOPS. Something catches his eye on the posting board.\r\n          YANKS a piece of paper off, a mixture of CONFUSION and CONCERN\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          Sonofabitch.\r\n          WHAT DOES HE SEE? Before we get a chance to KNOW --\r\n\r\n<b>          EXT. SALOON - NIGHT\r\n</b>\r\n          EMMETT'S FACE rises into frame, peering into the saloon from\r\n          below a windowsill. Sees THE MAN IN BLACK at the bar as ---\r\n\r\n<b>          INT. SALOON - NIGHT\r\n</b>\r\n          -- he SLUGS back a shot, the dog at his feet, still eyeing that\r\n          steak on Atticus' plate. The Man points to his GLASS:\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Another.\r\n\r\n<b>                         MARIA\r\n</b>          You drink like a man who wants to forget.\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          (haunted; the irony)\r\n          Other way round.\r\n          The dog WHINES AGAIN for the steak. Atticus SLAMS down his\r\n          silverware. Draws his GUN --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          17.\r\n</b>\r\n<b>                         ATTICUS\r\n</b>          You got three seconds to get your dog\r\n          outta here or I blow his balls off.\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          (without a blink)\r\n          Not my dog.\r\n\r\n<b>                         ATTICUS\r\n</b>          Q=... two...\r\n          -- and just before \"three\"... CA-CLICK. Atticus FREEZES,\r\n          because there's a RIFLE BARREL at the back of h,iS head now:\r\n\r\n<b>          VOICE (O.S.)\r\n</b>          Give you odds you don't get to 'three.'\r\n          RACK TO FIND the person holding the rifle is A WOMAN.\r\n          Beautiful. EXOTIC. Dressed in leather. Meet ELLA SWENSON.\r\n          ON THE MAN IN BLACK. Can't help himself. immediate and\r\n          undeniable CHEMISTRY. But she pays him no mind -- makes a PSST\r\n          sound and the dog snaps to her side. Atticus uncocks his gun,\r\n          slowly slides it back in the holster --\r\n\r\n<b>                         ATTICUS\r\n</b>          I was just havin' some fun, Miss --\r\n\r\n<b>                         ELLA\r\n</b>          Give- him, the steak.\r\n          Atticus HESITATES, angry at the humiliation. Ella PRESSES THE\r\n          GUN HARDER against his neck, lowering him -- and his plate -- to\r\n          the floor. Right in front of the dog, who GROWLS --\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          Now say you're sorry.\r\n\r\n<b>                         ATTICUS\r\n</b>          (biting his tongue)\r\n          I'm-- sorry.\r\n\r\n<b>                         ELLA\r\n</b>          His name's 'Happy.'\r\n          HappyBARES HIS TEETH. INCHES from Atticus' face\r\n\r\n<b>                         ATTICUS\r\n</b>          I'm sorry... 'Happy.'\r\n\r\n<b>                         ELLA\r\n</b>          Alright then.\r\n          (lowers her rifle)\r\n          You're right. That was fun.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          18.\r\n</b>          -- Atticus scrambles back to his feet and OUT the door, as Ella\r\n          looks at the Man In Black:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          What're you doing with my dog?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          I was hoping you could tell me.\r\n\r\n<b>                         ELLA\r\n</b>          The hell're you talking ab--?\r\n          WRIST BRACELET. Surprise and REVELATION:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          Where... did you get that?\r\n          Before he can answer, SHERIFF TAGGART enters, along with DEPUTY\r\n          WADE (carrying a SHOTGUN), and 5 other deputies. They move\r\n          cautiously to THE MAN, like he's a powder keg about to go off...\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Hey there, \"Luke.\" Mind following me\r\n          down to the office so we can have us a\r\n          chat...?\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>\r\n<b>                         (CONFUSED; ALERT)\r\n</b>          What for?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          All due respect, I'm the law, mister.\r\n          That's what for.\r\n          The men LOCK EYES:\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          Tell you what, Sheriff. How about you\r\n          keep the fifty dollars you owe me and I\r\n          just walk outta here like we. never met?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Because we did meet.\r\n          ON ELLA. For reasons we're not sure of, the idea of The Man\r\n          leaving ALARMS her. All the Gunslingers' hands are POISED by\r\n          holsters. The Man stays preternaturally COOL:\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          L can't be accountable for what happens\r\n          if they draw on me.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          And what's gonna happen?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          19.\r\n</b>\r\n<b>          THE MAN IN BLACK\r\n</b>          Best you don't find out.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Now why'd you have to go and say that?\r\n          Taggart gives a nod and the men start to CONVERGE --\r\n\r\n<b>          THE MAN IN BLACK\r\n</b>          (low; genuine plea)\r\n          Don't.\r\n          But Charlie makes a MOVE and The Man SLAMS his head into a pole\r\n          -- the NEXT GUNMAN reaches for his pistol -- The Man PUNCHES his\r\n          THROAT -- SLAMS the third into a bench -- The FOURTH straight\r\n          down on the Faro table --\r\n          TAGGART levels his REPEATER -- but The Man just GRABS the barrel\r\n          as Taggart FIRES a ROUND into the ceiling -- now the rifle's in\r\n          THE MAN'S HANDS and just before he PULLS THE TRIGGER on Taggart:\r\n          HE SEES EMMETT AT THE WINDOW. About to watch his father's\r\n          MURDER... and The Man LOWERS the gun:\r\n\r\n<b>          THE MAN IN BLACK (CONT'D)\r\n</b>          I told you, I don't wanna hurt anyb--\r\n          CRACK! The butt of a PISTOL WHIPS the side of his SKULL! The\r\n          Man DROPS as we REVEAL who just knocked his ass OUT:\r\n          ELLA! Taggart draws a gun and pins The Man, whipping out that\r\n          piece of paper he pulled from his office...\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Yup -- looks just like him.\r\n\r\n<b>          NOW WE IT'S A WANTED POSTER WITH THE MAN'S FACE ON IT:\r\n</b>\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          \"Jake Lonergan. Scourge a' The\r\n          Territories. Wanted Dead or Alive.\"\r\n          And The Man... now forever known as JAKE... stares WOOZILY into\r\n          his OVERTURNED HAT... the photo tucked inside of the BEAUTIFUL\r\n          WOMAN... her image goes BLURRY... then mil{:\r\n\r\n<b>                         AND WHAM:\r\n</b>\r\n<b>          MEMORY FLASHCUTS1 STROBELIXE IMAGES --\r\n</b>          1.) A tilted, handmade trail sign: \"SAGUARO PASS.\"\r\n          2.) We're in a CABIN somewhere. BLINDING ULTRAVIOLET LIGHT\r\n          EXPLODES INTO THE CABIN, against which a DEMONIC SILHOUETTE\r\n          appears -- it looks like an INDIAN IN FULL-FEATHER HEADDRESS --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          20.\r\n</b>          3.) A WOMAN'S FACE -- THE WOMAN FROM JAKE'S PHOTOGRAPH -- she\r\n          looks at us and SCREAMS --\r\n          4.) Now we're someplace VERY DARK -- a cave? As some kind of\r\n          TERRIFYING OCULAR PROBE lowers right in front of our eyes --\r\n          5.) Now we're RUNNING through the cave -- ESCAPE -- BREATHING\r\n          HARD -- a LIGHT at the end of the tunnel -- BLINDING SUN hits us\r\n          as we emerge -- our eyes ADJUST to see:\r\n          6.) A STRANGE ROCK FORMATION on the rim of a canyon -- like a\r\n          STONE TOWER pointing to heaven as the SUN WHITEWASHES US TO:\r\n\r\n<b>          INT. JAIL CELL - PRE-DAWN\r\n</b>\r\n          JAKE'S EYES OPEN and he GASPS AIR! His POV: a FACE comes into\r\n          FOCUS -- PERCY DOLARHYDE. GRINNING at him from the next cell:\r\n\r\n<b>                         PERCY\r\n</b>          You're a dead.\r\n          Jake sits up. Woozy. Blinking back to reality.\r\n\r\n<b>                         PERCY (CONT'D)\r\n</b>          My daddy's comin' for me, Boy. You're\r\n          gonna end up another dead shitheel under\r\n          his spurs. I am gonna watch you suffer\r\n          for a long, long --\r\n          Jake moves LIGHTNING QUICK -- reaching through the bars,\r\n          GRABBING PERCY'S COLLAR, YANKING FORWARDS -- SLAMMING Percy's\r\n          head into the bars, KNOCKING hIM OUT COLD AGAIN. Percy DROPS.\r\n\r\n<b>                         JAKE\r\n</b>          Shut up.\r\n          Jake sits back on his cot, rubbing his still-throbbing head.\r\n\r\n<b>          EXT. SHERIFF'S OFFICE - JAIL - CONTINUOUS\r\n</b>\r\n          A PRISON WAGON pulls up in front of the Sheriff's office, along\r\n          with Taggart's GUNMEN on horseback. ELLA takes frame as the men\r\n          dismount and head into the office -- she pursues DEPUTY WADE\r\n          with a real sense of PURPOSE:\r\n\r\n<b>                         ELLA\r\n</b>          I need to see Lonergan. It's important.\r\n\r\n<b>                         DEPUTY WADE\r\n</b>          'Fraid not, Miss -- we're preppin' him\r\n          for transport.\r\n          And pushes PAST her, into the office with the men. HOLD on Ella\r\n          -- dammit, she NEEDS to find a way in there.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          21.\r\n</b>\r\n<b>          INT. SHERIFF'S OFFICE - JAIL CELL - CONTINUOUS\r\n</b>\r\n          A KEY in the LOCK as the cell door OPENS: Sheriff Taggart, Wade,\r\n          the gunmen. GLARING at Jake, then noticing Percy --\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          What happened to him?\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>                         (DEADPAN)\r\n</b>          Man walked into a bar.\r\n          Taggart shakes his head as Charlie and a deputy unlock Percy's\r\n          cell, CUFF HIM, drag him out. Taggart points to Jake:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Step back against the wall there. Move\r\n          and I shoot you dead.\r\n\r\n<b>                         JAKE\r\n</b>          (as he does)\r\n          You should've let me go.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Yeah, I should've shot you in your knee.\r\n          You put down six of my deputies.\r\n\r\n<b>                         JAKE\r\n</b>          Six was all you had.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Hell, they're gonna love you in Phoenix.\r\n\r\n<b>                         JAKE\r\n</b>          Yeah? What's in Phoenix?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          What you got comin', Jake Lonergan.\r\n          Taggart reaches into his shirt, pulls out a pair of GLASSES.\r\n          Slips them on his nose. Takes out that WANTED poster and reads:\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          Aggravated banditry, 17 counts, Forgery,\r\n          Blackmail, Hijacking, injurious use of a\r\n          cattle prod, Arson, Incitement of\r\n          Whorehouse Riot, and Trespassing with\r\n          intent to deflower. You're also leader\r\n          of a gang of outlaws includin' Creek\r\n          Johnson and Bull McCade, which makes you\r\n          accessory to every law they broke too.\r\n\r\n<b>                         JAKE\r\n</b>          (after a long BEAT:)\r\n          That it?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          22.\r\n</b>\r\n<b>                         SHERIFF TAGGART\r\n</b>          Saved the best for last... 'Murder.'\r\n          That LANDS on Jake. Wondering if this is TRUE. Evenly --\r\n\r\n<b>                         JAKE\r\n</b>          It say who I killed?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Prostitute outta Mojave, name of Alice\r\n          Wills.\r\n          Taggart rises, removes Jake's BLACK STETSON from a hook on the\r\n          wall, pulls that PHOTOGRAPH OF THE WOMAN from the inner brim:\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          If I were a bettin' man, I'd say this\r\n          would be Ms. Wills, would it not?\r\n          Jake just stares, CONFUSED. SHAKEN.\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          They found her dead in a cabin round\r\n          Saguaro Pass, twenty miles west of here.\r\n          With that, a CLUE falls into place: SAGUARO PASS.\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          Deed was in your name.\r\n          He slips the photo back in the brim, tosses the hat to Jake:\r\n\r\n<b>          SHERIFF TAGGART (CONT'D)\r\n</b>          Dead hooker with a hole in her chest, in\r\n          your cabin, plus your sterling reputation\r\n          equals guilty as goddamned sin.\r\n          (draws his GUN)\r\n          And you're gonna hang for it.\r\n          At gunpoint, Taggart PUSHES Jake out the door --\r\n\r\n<b>          EXT. DESERT PLAINS - DAWN\r\n</b>\r\n          Against the RISING SUN, Dolarhyde and 15 GUNMEN ride hard, armed\r\n          to the teems. They REAR in the hills above Absolution. Dolar\r\n          looks down through BINOCULARS as NAT COLORADO turns to...\r\n          an incoming WIND. Across the valley, a massive BLACK CLOUD\r\n          is starting to SWIRL. Violent BLUE FLASHES within. Eerie.\r\n\r\n<b>                         GREAVEY\r\n</b>          blue light... Clanton said he saw\r\n          blue light before the cows disappeared...\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Just a storm.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          23.\r\n</b>\r\n<b>                         COLORADO\r\n</b>          No storm I've ever seen... I say we wait\r\n          'til it passes.\r\n          But Dolar isn't listening. THROUGH HIS BINOCULARS: he sees\r\n          PERCY being carried into the prison wagon. Followed by Jake.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          No time, they put him in an iron coach.\r\n          With a HYA! he's OFF, the others FOLLOWING with reluctant looks\r\n          -- still SPOOKED by that incoming STORM:\r\n\r\n<b>          EXT. ABSOLUTION - MAIN STREET - CONTINUOUS\r\n</b>\r\n          As Jake's loaded into the prison wagon after the still-\r\n          unconscious Percy, he SEES MEACHAM through the barred window.\r\n          The preacher flashes SYMPATHY as Wade takes out the cuff key:\r\n\r\n<b>                         DEPUTY WADE\r\n</b>          Gimme your wrist.\r\n          Jake holds out his hands. Wade unlocks one wrist, freeing a\r\n          cuff... then takes that cuff and LOCKS IT to Percy's wrist.\r\n\r\n<b>                         JAKE\r\n</b>          What're you --?\r\n\r\n<b>                         CHARLIE\r\n</b>          Best way to make a man stay put: chain\r\n          him to his enemy.\r\n\r\n<b>                         (A GRIN)\r\n</b>          You lovebirds have a nice trip now.\r\n          SLAM: the door CLOSES and LOCKS. Jake SIGHS and tries to sit\r\n          back, but it's hard tethered to Percy's slumped form. Shit.\r\n          Then QWW -- something starts to STING and he looks down:\r\n          HIS BRACELET. Has started PULSING RED. And it's getting WARM.\r\n          Jake stares -- ON EDGE -- what the hell's happening? As --\r\n          OUTSIDE, Taggart mounts the buckboard. EMMETT feeds the horses:\r\n\r\n<b>                         EMMETT\r\n</b>          You sure he's a bad guy, Pa? He did give\r\n          Percy a lickin'.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          He's bad enough.\r\n\r\n<b>                         EMMETT\r\n</b>          (not so sure, but --)\r\n          . can I come with you?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Too dangerous.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          24.\r\n</b>\r\n<b>                         EMMETT\r\n</b>          Dangerous to drive a damn coach? Why\r\n          can't Charlie just take him?\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Because it's my job, Emmett. That's what\r\n          these people pay me to do. And your\r\n          mother would kill me if I brought you.\r\n          Emmett looks off, half sad, half angry --\r\n\r\n<b>                         EMMETT\r\n</b>          Good thing she's already dead then.\r\n          And turns without a goodbye. Taggart watches him leave, wishing\r\n          he could connect. Takes the reins and looks up -- REACTS:\r\n          THAT MASSIVE. FRIGHTENING CLOUD IN THE SKY -- roiling faster\r\n          toward town. The scary BLUE FLASHES within grow more INTENSE.\r\n          IN THE COACH -- WITH JAKE, looking at the BRACELET, the pulsing\r\n          growing MORE FREQUENT -- and then, a VOICE:\r\n\r\n<b>          ELLA (0.S. )\r\n</b>\r\n<b>          HEY!\r\n</b>          Jake turns to see ELLA, pushed up against the coach window:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          Tell me where you got that bracelet...\r\n\r\n<b>                         JAKE\r\n</b>          Maybe you should'a asked before you\r\n          knocked me out..\r\n\r\n<b>                         ELLA\r\n</b>          Please... I need to know. Just tell me\r\n          where you got it.\r\n\r\n<b>                         JAKE\r\n</b>          Y dOli' .xBmbgX - - I don' t remember my\r\n          name or where I've been or any of the\r\n          things they said I done, so leave me the\r\n          hell alone.\r\n          And sits back as the coach starts to MOVE, leaving Ella in the\r\n          dust. Some of the gunmen ride atop it; others on horseback\r\n          cover the coach in a protective ring.\r\n          Wade sees something incoming from the NORTH:\r\n\r\n<b>                         DEPUTY WADE\r\n</b>\r\n<b>          KYLE!!!\r\n</b>          Taggart looks up: Dolarhyde's gang racing down the mountain --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          25.\r\n</b>\r\n<b>                         SHERIFF TAGGART\r\n</b>\r\n<b>                         DAMNIT --\r\n</b>          He unslings his SHOTGUN as his men ready their weapons --\r\n          ON DOLARHYDE'S GANG, riding hard, guns ready too --\r\n          This is about to get UGLY. BUT... from the OTHER end of town,\r\n          the WIND picks up --\r\n          As the massive storm cloud seems shockingly to have STORED AT A\r\n          H -- its EYE churning, ROARING and... TWO BOLTS OF BLUE\r\n          LIGHTNING CRACK DOWN FROM IT! Happy starts BARKING MADLY. Ella\r\n          sees the lightning and starts to BACK AWAY in fear:\r\n\r\n<b>                         ELLA\r\n</b>          NonoNO -- GET TO YOUR CELLARS! EVERYONE\r\n\r\n<b>          UNDERGROUND NAT!\r\n</b>          But her cries are LOST as -- RRRRRRRR!!!!!\r\n\r\n<b>          A LONG, NARROW FUNNEL SHOOTS FROM THE CHURNING CLOUD: A TORNADO!\r\n</b>\r\n<b>          BREAKING THE MOMENTUM OF THE SHOWDOWN --\r\n</b>          The stagecoach UPENDS, FLIPPING SIDEWAYS as the animals try to\r\n          break free -- Taggart and his men are THROWN --\r\n          Inside, Jake and Percy TUMBLE end-over-end -- SLAMMING into\r\n          walls, LOCKED TOGETHER -- JARRING Percy back to consciousness --\r\n          Dolarhyde's men are THROWN from their horses too as the animals\r\n          STAMPEDE OFF in different directions --\r\n          THE 1Q8k=O ENGULFS THE TOWN! THE CONCUSSIVE BLAST BUCKLES\r\n\r\n<b>          BUILDINGS, PULLING WHOLE SECTIONS OF THEM INTO THE SKY!\r\n</b>\r\n<b>          THE TELEGRAPH OFFICE. SHERIFF'S STATION. BROTHEL. WOOD\r\n</b>\r\n<b>          STRIPPED RIGHT OFF THEIR FALSE FRONTS LIKE PIANO KEYS!\r\n</b>          Okay, wait. Just wait. Take a breath. 'Cause it's\r\n          about ... . to get... . MORE insane...\r\n\r\n<b>          TEN MANTA RAY-SHAPED HOVER-SPEEDERS BURST FROM THE CYCLONE!\r\n</b>          ROARING into the town, FLYING just above ground --\r\n\r\n<b>          TOWNSPEOPLE'S FACES -- GOING DOWN THE RABBIT HOLE -- 19TH\r\n</b>\r\n<b>          CENTURY BRAINS TRYING TO PROCESS THE IMPOSSIBLE --\r\n</b>\r\n<b>                         MEACHAM\r\n</b>          Jesus God!!\r\n          STRANGE STEEL RINGS fire from the speeders and mushroom out --\r\n          KA-CHING! -- SNAP OPEN and CLAMP around necks, arms, legs -- and\r\n          from these steel collars, CABLES LASH OUT, whip-snapping back to\r\n          the speeders and TETHERING MAGNETICALLY to them --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          26.\r\n</b>          Yeah-these are HIGH-TECH LASSOS:\r\n\r\n<b>          HELPLESS VICTIMS ARE YANKED OFF THE GROUND AND PULLED BEHIND THE\r\n</b>          SPEEDERS LIKE ROPED STEER! Two of TAGGART'S GUNMEN. Now some\r\n          of DOLARYHYDE' S. Screaming, just gone. THIS IS A...Qlp lam.\r\n          EMMETT -- stunned -- as SHERIFF TAGGART runs for him --\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>\r\n<b>          EMMETT !\r\n</b>          Emmett runs into his dad's embrace --\r\n\r\n<b>          EMMETT SHERIFF TAGGART\r\n</b>          What's happening?! -- Stay _by-mvside!\r\n           A_LIVERY_STABLE -- the HORSES stamp in their stalls as Taggart\r\n           tears the door open and rushes Emmett inside; as he's about to\r\n          follow... am c1:t lU 01 If\r\n\r\n<b>                          EMMETT\r\n</b>\r\n<b>          PA!!\r\n</b>          -- a STEEL CABLE fires from the collar, SNAPS TAUT as it\r\n          connects to a speeder and WHOOSH! Taggart's RIPPED off his\r\n          feet, dragged away -- ELLA tackles the boy as ANOTHER RING zooms\r\n          overhead, locks around a FLEEING WOMAN -- she's TAKEN --\r\n\r\n<b>                         EMMETT (CONT'D)\r\n</b>\r\n<b>          THEY TOOK HIM! LEMME 9Q11!!\r\n</b>\r\n<b>                         ELLA\r\n</b>\r\n<b>          HE'S GONE!\r\n</b>\r\n<b>                         EMMETT\r\n</b>\r\n<b>          NO HE'S N--\r\n</b>\r\n<b>                         ELLA\r\n</b>\r\n<b>          LISTEN TO ME! YOU WANNA LIVE?!! WHERE'S\r\n</b>\r\n<b>          THERE A CELLAR?! TAKE ME TO IT!\r\n</b>\r\n<b>          -- HE'S COMING INTO FOCUS -- TEARS IN HIS EYES --\r\n</b>\r\n<b>                         EMMETT\r\n</b>\r\n<b>          BIRDCAGE THEATER!\r\n</b>          With a \"C'MON!!!\" she rushes him through the FRENZIED CROWD --\r\n\r\n<b>          INT. PRISON WAGON - CONTINUOUS\r\n</b>\r\n          JAKE AND !MERCY -- TRAPPED IN THE UPSIDE-DOWN COACH -- Jake sees\r\n          DEPUTY WADE on the ground just a few feet away, head bleeding --\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>          HEY!! LET US OUT!!!\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          27.\r\n</b>          -- but WHOOSH! A METAL COLLAR CLAMPS AROUND WADE AND YANKS HIM\r\n          AWAY! Percy STRUGGLES wildly against Jake in a TUG-O'-WAR:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>\r\n<b>          STOP PULLING AND GIMME YOUR HAND--!\r\n</b>\r\n<b>                         PERCY JAKE\r\n</b>\r\n<b>          -- THE HELL FOR-- ?! -- I CAN GET US FREE! GIMME\r\n</b>\r\n<b>          YOUR DAMN HAND!!!\r\n</b>          Percy RELENTS. Offers up his hand. Jake grabs all of Percy's\r\n\r\n<b>          FINGERS, TIGHTENS HIS FIST AROUND THEM -- CRRRRAAACKI\r\n</b>          SNAPS THEM BACKWARDS!!!!! Percy SHRIEKS as Jake KICKS him back\r\n          against the wall, FORCING Percy's hand out of the cuff -- and\r\n          now Jake's UNTETHERED too!\r\n          THROUGH THE CROWD -- DOLARHYDE hears his son SCREAM. SEES the\r\n          overturned coach and TWO-FINGER WHISTLES to:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Colorado!\r\n          Nat Colorado RACES IN as Dolar draws his .45 -- BANG! --\r\n          shatters the coach lock -- they PULL Percy out:\r\n\r\n<b>                         PERCY\r\n</b>\r\n<b>          MY FINGERS!! HZ BE= MY FINGERS!!!\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>\r\n<b>          QUIT WHININ' AND FIND A HORSE!\r\n</b>          As Dolar runs for his horse, Percy sees a PISTOL left on the\r\n          ground -- grabs it with his good hand and FIRES at Jake who\r\n          JUKES behind the coach for cover, Percy SHOOTING in a FURY but:\r\n          -- KLINK! A collar CLAMPS around Percy's neck and he's YANKED\r\n          OFF TOO! Dolarhyde turns and SEES HIS SON DISAPPEAR:\r\n\r\n<b>          INT. MEACHAM' S CHURCH - CONTINUOUS\r\n</b>\r\n          Meacham ushers people into the church as WALLS SHAKE, PEWS JUMP:\r\n\r\n<b>          INT. BLACKSMITH'S SHOP - CONTINUOUS\r\n</b>\r\n          DOC AND MARIA burst in, huddle under a window. Across the room,\r\n          a YOUNG MAN clamps a hand over his TERRIFIED WIFE's mouth --\r\n\r\n<b>          CRAAASFI! MORE RINGS SMASH THROUGH THE WALL, YANKING THE YOUNG\r\n</b>\r\n<b>          COUPLE THROUGH IT! ANOTHER RING CLAMPS AROUND MARIA'S NECK!\r\n</b>\r\n<b>                         MARIA\r\n</b>\r\n<b>          AYUDAMEEEEEEE!\r\n</b>          Doc LEAPS after her but her collar's LASSO CABLE whips out,\r\n          TETHERING to a passing Speeder and she's RIPPED OUT THE DOOR --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          28.\r\n</b>\r\n<b>                         DOC\r\n</b>\r\n<b>          MARIA!!!\r\n</b>\r\n<b>          EXT. BIRDCAGE THEATER - CELLAR - CONTINUOUS\r\n</b>\r\n          ELLA -- hurrying Emmett toward the theater's CELLAR DOOR, but a\r\n          SPEEDER circles around and ROARS toward them --\r\n          ON JAKE. He SEES this -- and suddenly, to HIS surprise as much\r\n          as OURS... HIS BRACELET ACTIVATES! METAL COMING TO LIFE,\r\n          coiling up around his arm -- WHAT? HOW? -- as it becomes...\r\n\r\n<b>          A SMART GUN BLASTER WE PON! A HOLOGRAPHIC SCOPE MATERIALIZES,\r\n</b>          tracking that speeder as it DESCENDS on Ella and the mother and:\r\n\r\n<b>          BALLLLAMMMI THE BLASTER FIRES A PULSE, VAPORIZING THE SPEEDER\r\n</b>\r\n<b>          MID-AIR! THE RECOIL HURTLES JAKE BACK 15 FEET, INTO A WALL.\r\n</b>          Ella reaches the CELLAR DOOR with Emmett. LOCKED. Sees a\r\n          HATCHET in a stump -- rips it out and HAMMERS the lock to bits:\r\n\r\n<b>                         ELLA\r\n</b>          Everyone inside! GO GO GO!!\r\n          Ushering Emmett and TOWNSFOLK underground, PULLS the door SHUT --\r\n\r\n<b>          EXT. ABSOLUTION - MAIN STREET - CONTINUOUS\r\n</b>\r\n          JAKE stumbles up... as a speeder FIRES A RING AT HIM. But\r\n          reflexively, his WRIST WEAPON FIRES ANOTHER BLAST, vaporizing\r\n          it! He looks down at the blaster: \"Hell y .\"\r\n          Another speeder circles around -- KABOOM! The blaster's\r\n          incredible firepower SPIRALS THE SPEEDER OUT OF CONTROL, it\r\n\r\n<b>                         CRASHES INTO:\r\n</b>\r\n<b>          INT. MEACHAM'S CHURCH - CONTINUOUS\r\n</b>\r\n          The speeder PLOWS through, parishioners flee -- the CHURCH BELL\r\n          breaks from the BELL TOWER -- CRASHES DOWN ON THE SPEEDER --\r\n\r\n<b>          EXT. TOWN STREETS - CONTINUOUS\r\n</b>\r\n          As Jake keeps FIRING, the last speeders turn tail and RETREAT --\r\n          disappearing back INTO THE TORNADO as the cloud overhead OPENS\r\n          UP and INHALES the swirling mass, which spirals to the heavens.\r\n          ... GONE. The massive cloud seems to VAPORIZE and the DESERT\r\n          SUN returns... debris flutters... smoke clears...\r\n          And all... is... STILL.\r\n          As our CAMERA RISES to reveal... HALF THE BUILDINGS HAVE BEEN\r\n\r\n<b>          SUCKED INTO THE SKY.\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          29.\r\n</b>          From the rubble, SURVIVORS EMERGE: EMMETT and ELLA from the\r\n          cellar with inhabitants. DOLARHYDE. DOC. Al in SHOCK:\r\n\r\n<b>                         DOC\r\n</b>          Maria -- oh God-- they t-took her-- What\r\n          just...?\r\n          MOANS, WAILS... desperate cries as people search for loved ones.\r\n          JAKE'S BLASTER -- RETRACTS, folding in on itself -- shrinks down\r\n          to size, reverting back into a BRACELET. He's stunned. So are\r\n          the remaining townsfolk. DOLARHYDE is first to speak:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Who the hell're ?\r\n\r\n<b>                         NAT COLORADO\r\n</b>          He's the one who caged Percy.\r\n          Dolarhyde starts MOVING toward Jake -- wild killer eyes --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Whatwere__tho_se__thinae?\r\n\r\n<b>                         JAKE\r\n</b>          -- why're you asking m&amp;?!\r\n          Dolarhyde GRIPS Jake's arm -- THE BRACELET:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          This! Where'd you get this?! It was\r\n          shooting the same light beams they were --\r\n\r\n<b>                         JAKE\r\n</b>          Let go of my wrist.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          -- I'm not lettin' go of nothin' til you\r\n          tell me what the he--\r\n          KA-LLLANG!! Suddenly that CHURCH BELL comes HURTLING out of the\r\n          church wreckage, PLOWS through debris. People scatter. And out\r\n          of the church stumbles...\r\n          AN ALIEN. 8 FT. TALL. Standing upright, limbs inverted --\r\n           limbs that DRAG, wounded, as people SCREAM and RUN and Jake and\r\n          Dolarhyde can only stare, jaws dropped, and the monster LUNGES:\r\n          WHUPWHUP -- something SPINNING through the air -- A HATCHET ---\r\n\r\n<b>          SCHLUCK!!!! -- EMBEDDING IN THE ALIEN'S HEAD! WHIP TO --\r\n</b>          ELLA, hang iust hurled it. The alien lets out a DEATH RATTLE\r\n          then FALLS FORWARD, the hatchet embedding deeper as it HITS THE\r\n          DIRT. Holy SHIT.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          30.\r\n</b>          Ella's adrenaline dynamo starts to die down, replaced now by\r\n          SHOCK. And for what seems like the first time, FEAR. She\r\n          EXHALES a crazy breath, stumbles back... as slowly... people\r\n          converge around the corpse:\r\n\r\n<b>                         EMMETT\r\n</b>          Is it... dead?\r\n          Jake KICKS the alien. It doesn't move. Happy BARKS --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          . The hell j,,a it?\r\n\r\n<b>          MEACHAM (O.S.)\r\n</b>          A demon.\r\n          They all turn to see MEACHAM. TERRIFIED.\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          Revelations 16:14: \"For there are\r\n          spirits of demons, showing signs.\"\r\n          (points to the alien)\r\n          Escaped from hell itself.\r\n\r\n<b>                         EMMETT\r\n</b>          Lookit its wrist! It's got one'a those\r\n          bracelet things too!\r\n          Indeed, there on the creature's wrist is an IDENTICAL BRACELET.\r\n          ON JAKE. Mind tumbling. He meets eyes with ELLA. Her face as\r\n          EAGER as his to understand this and now... BEEP. BEEP. BEEP.\r\n          What's that SOUND? Everyone looks at each other. Colorado\r\n          bends closer to the corpse... SCARED...\r\n\r\n<b>                         NAT COLORADO\r\n</b>          I think... it's comin' from somewhere\r\n          inside it.\r\n          People look at each other: WHAT NOW? Trying to control the near-\r\n          hysteria they all feel. Finally, Dolarhyde takes a BREATH --\r\n          more BRAVADO than actual courage:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Only one way to find out. We need to cut\r\n          it open.\r\n\r\n<b>                         (TO DOC)\r\n</b>          You're a doctor. Got a bone saw?\r\n          DOC snaps out of his stupor, looks up, FREAKED --\r\n\r\n<b>                         DOC\r\n</b>          . Are you... serious?\r\n          (looks to them all)\r\n\r\n<b>          WHAT THE HELL JUST HAPPENED?!?\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          31.\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          Wake u Those things took your wife --\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>          I KNOW THAT!!\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          Well this one here's our only chance of\r\n          findin' where they went.\r\n          That LANDS on all of them. A long beat. Doc looks down at the\r\n          thing, ORANGE GOO dribbling around the AXE in its head...\r\n\r\n<b>                         DOLLARHYDE\r\n</b>          So you got a bone saw or don't you?\r\n\r\n<b>          INT. GOLD LBAP SALOON - DAY\r\n</b>\r\n          THUD! The alien corpse is DROPPED onto the bar by Doc and\r\n          Meacham. As Dolarhyde and Colorado follow through the batwings\r\n          -- Doc WHIPS a SHOTGUN from under the bar:\r\n\r\n<b>                         DOC\r\n</b>          Stay outside. You're not welcome in\r\n          here!\r\n          Dolar brings up his COLT -- so does COLORADO --\r\n\r\n<b>                         DOLARRYDE\r\n</b>          I own more of this town than any man in\r\n          it so I'll go wherever the hell I damn\r\n          please. And for the record? You ain't\r\n          welcome in my country, Mexican.\r\n          Ella steps between them, BAD ASS --\r\n\r\n<b>                         ELLA\r\n</b>          Whatever troubles you had don't mean a\r\n          damn thing against the ones we got now.\r\n          We wanna see our way through 'em, your\r\n          guns better start pointing in the same\r\n          direction, Goddammit.\r\n          Doc and Dolar never take eyes off each other. or their GUNS.\r\n          Finally... Dolar LOWERS his. So does Doc. People BREATHE.\r\n          Meacham slips on a pair of GLASSES, studying eerie veins and\r\n          muscles through the creature's viscous outer layers. Doc turns\r\n          his focus to the alien too. Picks up his PUMP-OPERATED BONE\r\n          SAW. Presses his boot on the bellows, it turns with a WHIR...\r\n          SHAKING as he brings the SPINNING BLADE to the alien's CHEST.\r\n          Looks at Meacham, AFRAID --\r\n\r\n<b>                         DOC\r\n</b>          If it 'mss a demon, and I cut it open... am\r\n          I going to burn for it?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          32.\r\n</b>          Meacham hesitates a beat, then CROSSES the air in front of Doc --\r\n\r\n<b>                         MEACHAM\r\n</b>          That should cover ya.\r\n          ON DOC. Little relief. BROW SWEATING, he brings the spinning\r\n          blade down toward the disgusting ALIEN -- VRRRRZZ -- HESITATES --\r\n\r\n<b>                         DOC\r\n</b>          Excuse me.\r\n          B GH! He PUKES on the ground.\r\n\r\n<b>                         EMMETT\r\n</b>          Jesus, Doc!!!\r\n          Doc wipes his mouth with a handkerchief, slightly DEFIANT --\r\n\r\n<b>                         DOC\r\n</b>          This is not normal. I'm entitled to\r\n          vomit. We should XU be vomiting.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Just cut, Lardass.\r\n          Doc GLARES... with a still-shakitig hand, gets back to business --\r\n\r\n<b>          VRRRRZ -- CUTS THROUGH THE STERNUM -- ORANGE BLOOD SPRAYING --\r\n</b>          and... SHUNK! Doc looks up at Jake, gestures to the carcass:\r\n\r\n<b>                         DOC\r\n</b>          Senor? A hand?\r\n\r\n<b>                         (TO DOLARHYDE)\r\n</b>          You too, maricon.\r\n          The men all grip the chest plate and PULL -- A DISGUSTING CRACK.\r\n          Everyone turns away, scowling, Emmett wafting the air:\r\n\r\n<b>                         EMMETT\r\n</b>          Damn! Smells like a dead dog's ass.\r\n\r\n<b>                         MEACHAM\r\n</b>          Emmett.\r\n\r\n<b>                         EMMETT\r\n</b>          Sorry, Father.\r\n          Doc covers his face with his handkerchief as he explores...\r\n\r\n<b>                         DOC\r\n</b>          Chet wall's partially collapsed... no\r\n          familiar organs of any kind...\r\n\r\n<b>                         DOLARHYDE\r\n</b>          'course they're not familiar. Just look\r\n          at this th--\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          33.\r\n</b>          SUDDENLY THE ALIEN'S ARM LASHES OUT -- claws SNAP OPEN and PIN\r\n          Dolarhyde against the wall! Everyone tries to PRY the claws\r\n          from his neck -- but the second Doc withdraws his hands from the\r\n          alien's chest, its arm goes LIMP. Dolarhyde drops, GASPING...\r\n\r\n<b>                         DOC\r\n</b>          Spinal reflex.\r\n          And GRINS at Dolar's pain. But Meacham NOTICES something around\r\n          Dolar's neck where the alien pinned him, like a ring of DUST:\r\n\r\n<b>                         MEACHAM\r\n</b>          Something on your neck. Hold still.\r\n          Meacham sweeps a little off Dolar's neck, rubs it between thumb\r\n          and forefinger. The dust GLINTS under the kerosene lamp:\r\n\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          I'll be damned... gold.\r\n          They check the creature's hand talons: GOLD FLAKES underneath\r\n          'em, and Lots of it. Colorado checks its taloned feet:\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Down here too.\r\n          (looks to Dolar)\r\n          This much ore... could only have come\r\n          from a digging in a mine.\r\n          That LANDS on everyone. but most especially ELLA. Who looks up\r\n          to see Jake READING her in this moment.\r\n\r\n<b>                         EMMETT\r\n</b>          In the ALIEN'S EYE is a SMALL FLASHING LIGHT. On/Off/On/Off in\r\n          time with that BEEP BEEP BEEP.\r\n\r\n<b>                         DOC\r\n</b>          Gimme my scalpel.\r\n          In MACRO CU, DOC CUTS INTO THE EYE, WET SQUISHY SOUNDS as he\r\n          pulls it from its socket, attached to a STRINGY OPTIC NERVE\r\n          dripping with juice. Clamped to the nerve is a METALLIC ORB:\r\n          -- he takes hold of the blinking orb. It FLARES to life, the\r\n          light coalescing into a 3-D ARROW-LIKE HOLOGRAM. Confusion.\r\n          Doc REMOVES it from the optic nerve and the hologram DISAPPEARS:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Where'd it go? The hell'd you do?\r\n\r\n<b>                         DOC\r\n</b>          Nothing, just pulled it off --\r\n          He reconnects it to the optic nerve, the hologram REAPPEARS:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          34.\r\n</b>\r\n<b>                         DOC (CONT'D)\r\n</b>          Only works when it's touching the\r\n          creature.\r\n          Colorado moves closer... rainbow light flickering across his\r\n          face...\r\n\r\n<b>                         NAT COLORADO\r\n</b>          I think... it's a compass. Look:\r\n          (fiddles with tweezers)\r\n          No matter how you move it, it points in\r\n          the same direction.\r\n\r\n<b>                         EMMETT\r\n</b>          Compasses point north. That's west.\r\n\r\n<b>                         MEACHAM\r\n</b>          (realizing; to Jake)\r\n          West's where 141 came from.\r\n          ON JAKE. Another puzzle piece falling into place.\r\n\r\n<b>                         EMMETT\r\n</b>          If you're right, what's it pointing to?\r\n\r\n<b>                         ELLA\r\n</b>          The rest of 'em.\r\n\r\n<b>                         (THEN)\r\n</b>          Be my guess.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Then that's where I'm goin'.\r\n          He SNAPS his PISTOL open, loading bullets:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          One of my ranchers said my herd\r\n          disappeared into the sky. 'Til about ten\r\n          minutes ago, I figured him for a liar.\r\n          (SNAPS barrel closed)\r\n          Nobody takes my cattle.\r\n\r\n<b>                         MEACHAM\r\n</b>          Your b was taken too.\r\n          A FLASH of something from Dolarhyde -- could that be EMOTION?\r\n          But just as fast, it's GONE. Almost a THROWAWAY:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          I noticed.\r\n\r\n<b>                         NAT COLORADO\r\n</b>          What if they're already dead?\r\n\r\n<b>                         EMMETT\r\n</b>          They're not dead.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          35.\r\n</b>\r\n<b>                         ELLA\r\n</b>          Kid's right. If all they wanted was to\r\n          kill us, they would've.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Looked to me like... they were ropin'\r\n          people.\r\n\r\n<b>                         (THEN)\r\n</b>          Means they need 'em for something.\r\n          Whatever it is, we can either stand here\r\n          guessin'... or go find out.\r\n          His eyes flash to Nat: \"C'mon.\" And they EXIT. Everyone looks\r\n          at each other, working up the courage to face what they know\r\n          they must. Doc grabs his SHOTGUN, starts gathering shells:\r\n\r\n<b>                         DOC\r\n</b>          If she's alive -- if there's even a\r\n\r\n<b>                         CHANCE --\r\n</b>\r\n<b>                         MEACHAM\r\n</b>          Lord hates a coward... but our bullets\r\n          were useless against those things. Other\r\n          than his wrist gizmo, we're outgunned and\r\n          outnumbered.\r\n          As one by one, they turn... to JAKE. Who until this point has\r\n          been mostly SILENT. Observing. But now -- he's gone from enemy\r\n          to potential savior in a heartbeat.\r\n\r\n<b>                         JAKE\r\n</b>          Whoa, I got nothing to do with this --\r\n\r\n<b>                         ELLA\r\n</b>          You got everything to do with it. If you\r\n          can remember where you got that thing --\r\n\r\n<b>                         JAKE\r\n</b>          I remember you all wantin' me on the end\r\n          of a damned rope. Whatever's happenin'\r\n          here's got nothin' to do with me.\r\n\r\n<b>                         ELLA\r\n</b>          You sure. about that?\r\n          He LOOKS at her. No, he isn't. But he sure as hell won't stay\r\n          to debate it -- turns to go --\r\n\r\n<b>                         EMMETT\r\n</b>          Mr. Lonergan? Sir?\r\n          The EMOTION in the boy's voice STOPS Jake at the door.\r\n\r\n<b>                         EMMETT (CONT'D)\r\n</b>          My mother died last year. My Paw... he's\r\n          all I got.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          36.\r\n</b>          And despite a fleeting moment of SYMPATHY, Jake darkens --\r\n\r\n<b>                         JAKE\r\n</b>          Kid, I'm the last man you want anywhere\r\n          near you, your Pa... or anyone else in\r\n          this goddamned town.\r\n          OUT the door. Everyone trades looks, then Ella FOLLOWS:\r\n\r\n<b>          EXT. SALOON - NIGHT\r\n</b>\r\n          Jake moves FAST past blown-out STOREFRONTS as Ella PURSUES:\r\n\r\n<b>                         ELLA\r\n</b>          That's it? You're just gonna run away?\r\n\r\n<b>                         JAKE\r\n</b>          No, Sister. I'm walking away.\r\n\r\n<b>                         ELLA\r\n</b>          Well s w.\r\n          As he keeps on walking, Ella picks up a ROCK, wings it at the\r\n          back of his HEAD -- WHAMI Jake stumbles forward, TURNS AROUND --\r\n\r\n<b>                         JAKE ELLA\r\n</b>          SONOVA-- -- I told you to gyp.\r\n          Ella strides forward, picking up another rock on the move --\r\n\r\n<b>                         JAKE\r\n</b>          What's your damn problem?!\r\n\r\n<b>                         ELLA\r\n</b>          You're comin' with us.\r\n\r\n<b>                         JAKE\r\n</b>          I'm not coming anywhere. And you throw\r\n          that rock I swear I'll--\r\n          WHAM! The rock glances off his shoulder --\r\n\r\n<b>                         ELLA\r\n</b>          If you're walkin' away from here, what\r\n          the hell're you walking tsQ?\r\n          That PENETRATES as Jake realizes he doesn't really KNOW. And\r\n          that's the last thing he's gonna admit --\r\n\r\n<b>                         JAKE\r\n</b>          What the hell are you walkin' to, Lady?\r\n          'Cause if I heard right, it sounds like\r\n          suicide to me.\r\n          -- now it's her turn to pause. Cryptically:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          37.\r\n</b>\r\n<b>                         ELLA\r\n</b>          I... just wanna help these people.\r\n\r\n<b>                         JAKE\r\n</b>          Bullshit. You wanna help yourself. Saw\r\n          your face light up the minute you knew\r\n          that thing might lead you to gold.\r\n          And the fact that he's BUSTED her gets Ella's hackles up --\r\n\r\n<b>                         ELLA\r\n</b>          It's not gold I want, you dumb\r\n          sonofabitch, it's what it'll buy me.\r\n\r\n<b>                         JAKE\r\n</b>          And what's that?\r\n\r\n<b>                         ELLA\r\n</b>          Remange.\r\n          Whatever that means, it's a deep, painful LONGING in her. She\r\n          stares at him, DEAD ON:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          And lookin' at you? I'd bet a silver\r\n          dollar... its what you want, too.\r\n          With that, Ella turns and STRIDES OFF as we HOLD ON JAKE, face\r\n          knotted in conflict. As her words RESONATE.\r\n\r\n<b>          MEACHAM (V.0.)\r\n</b>          Was the Devil come to Absolution... come\r\n          to drag our town down to hell...\r\n          SERIES OF SHOTS - AS DUSK TAI .t $. TQ .NIGItT:\r\n          Though BURNING EMBERS, Emmett helps a LITTLE GIRL pull her half-\r\n          burnt DOLL from the rubble...\r\n\r\n<b>          MEACHAM (V.0.) (CONT'D)\r\n</b>          but our town's not just a buncha\r\n          buildings, Brothers and Sisters --\r\n          Nossir. Our town is fie. Good, God-\r\n          fearing souls. Pure and hopeful. And\r\n          the devil can't never take that away...\r\n          Ella and Doc tend to WOUNDED PEOPLE in a triage area as...\r\n          Meacham finds his overturned PULPIT. Determination in his eyes,\r\n          he pushes it UPRIGHT:\r\n\r\n<b>          AND NOW WE CATCH UP TO WHERE MEACHANL'S VOICE 1S_CQMING FRUM:\r\n</b>          He's standing on the pulpit in the rubble, his words a\r\n          sermon/call-to-arms -- every survivor GATHERED AROUND:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          38.\r\n</b>\r\n<b>                         MEACHAM (CONT'D)\r\n</b>          In times of darkness, God asks that we\r\n          come together so we may stand and fight.\r\n          So we're goin' after our kin. Any of you\r\n          aren't able or prepared, no shame in it.\r\n          Head up to Fort Huachuca, join up with\r\n          the garrison there and pray... Rest of us\r\n          ride out at sun-up to recover that which\r\n          we have lost.\r\n          SUNRISE: Pistol chambers SPINNNN -- rifles are COCKED --\r\n\r\n<b>          MEACHAM (V.0.) (CONT'D)\r\n</b>          Thy will be done, Lord, and there's an\r\n          amen behind it.\r\n          Lo and behold, most of the town survivors are just too damn\r\n          scared. They form an EXODUS LINE, heading off toward the fort.\r\n          Dolarhyde, Colorado and his REMAINING MEN (6) load the ALIEN\r\n          CORPSE onto the back of a WAGON. Some of them trade glances --\r\n          DAMN WORRIED about staying. Dolarhyde sees it:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Somebody got something to say?\r\n          His withering GLARE keeps them from speaking up. Doc and\r\n          Meacham climb onto the wagon:\r\n\r\n<b>                         MEACHAM\r\n</b>\r\n<b>                         (THE ALIEN)\r\n</b>          Sure we need to bring that thing along?\r\n          Doc nods as he TWISTS the forceps in the Alien's eye, the\r\n          COMPASS HOLOGRAM flickering to life before them:\r\n\r\n<b>                         DOC\r\n</b>          If this arrow points me back to Maria?\r\n          Yeah -- J'm sure.\r\n          Emmett appears leading a PONY, a BOW and quiver of ARROWS slung\r\n          around his back:\r\n\r\n<b>                         MEACHAM\r\n</b>          Can't come, Emmett, too dangerous.\r\n\r\n<b>                         EMMETT\r\n</b>          I can protect myself -- shoot, I'm the\r\n          only master bowman in my archery club.\r\n          Won the county tournament by shootin' a\r\n          flipped nickel at 50 paces.\r\n\r\n<b>                         MEACHAM\r\n</b>          Somethin' tells me these things don't\r\n          carry nickels, son. Answers's no.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          39.\r\n</b>\r\n<b>                         EMMETT\r\n</b>          You want me to ride off with the\r\n          chickenshits, then double back, be happy\r\n          to. But let's just skip that part and\r\n          get to it, Padre.\r\n          And that's the truth. Meacham sighs, no choice... finally:\r\n\r\n<b>                         MEACHAM\r\n</b>          Go fill your canteen, dammit.\r\n          He SLAPS the reins and the wagon rides off. Emmett GRINS and\r\n          mounts the pony, then sees... JAKE riding past. ANGRY EYES from\r\n          Ella as she heels her horse and TROTS OFF angrily:\r\n\r\n<b>                         ELLA\r\n</b>          C'mon, Happy.\r\n          But HAPPY remains, torn between them, tail wagging and looking\r\n          up at Jake as if to say: PLEASE COME?\r\n\r\n<b>                         JAKE\r\n</b>          Oh shut up.\r\n          Suppressing GUILT, he rides on toward the hills -- as Dolarhyde\r\n          VEERS his horse in front of Jake, cutting him off:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          I was ridin' into town to kill you for\r\n          what you done to my son. You owe me your\r\n          life, Boy.\r\n\r\n<b>                         (BEAT)\r\n</b>          Ride with us, we'll call it square.\r\n          His hand rests on his nickel-plated .38. Eyes gleaming cruelly.\r\n\r\n<b>                         JAKE\r\n</b>          You that fast?\r\n\r\n<b>                         DOLARHYDE\r\n</b>\r\n<b>                         FAST ENOU--\r\n</b>          -- WHOOSH: Jake's hand is already UP with his own PISTOL, having\r\n          drawn before Dolarhyde can finish his sentence:\r\n\r\n<b>                         JAKE\r\n</b>          Now you owe me y.Q= life. We're square.\r\n          In a DAZZLING TWIRL, Jake slaps it back in his holster. Point\r\n          made, he RIDES ON. Dolarhyde, burning mad at having been out-\r\n          drawn, turns to CULOBAI)U -- speaks LOW:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Follow him. Soon as he's got his back\r\n          turned... kill him.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          40.\r\n</b>          Shit. Colorado hesitates. Dolar GLARES: \"Do it.\" Finally\r\n          Colorado NODS acquiescence, moves off...\r\n          JAKE -- on the OUTSKIRTS of town now -- riding past Meacham and\r\n          Doc on the WAGON:\r\n\r\n<b>                         MEACHAM\r\n</b>          Figure out which way you're headed yet?\r\n\r\n<b>                         JAKE\r\n</b>          West. Saguaro Pass.\r\n\r\n<b>                         MEACHAM\r\n</b>          That's not what I meant.\r\n          The inference LANDS on Jake. But he's in no mood. GALLOPS off.\r\n          Meacham watches Jake go... MUSIC RISES AS WE DISSOLVE THROUGH:\r\n\r\n<b>          EXT. DESERT PLAINS\r\n</b>\r\n\r\n<b>          JAKE -- RIDING HARD THROUGH THE DESERT:\r\n</b>          A man running from his demons, or maybe toward them... through\r\n          plains and pasturage... until he sees the tilted ROAD SIGN:\r\n          \"SAGUARO PASS.\" Up ahead, he sees DEBRIS...\r\n          Part of a ROOF, lying broken on the ground. Pieces of a STONE\r\n          CHIMNEY. Jake comes over a rise... to REVEAL:\r\n\r\n<b>          EXT. ABANDONED CABIN - DAY\r\n</b>\r\n          A DESTROYED LOG CABIN. Walls partially TORN AWAY. Something in\r\n          Jake is DEEPLY STIRRED. Dismounts, tentatively... walks up to\r\n          the PORCH. Boots CRUNCH over broken window glass as they ENTER:\r\n\r\n<b>          INT. ABANDONED CABIN - CONTINUOUS\r\n</b>\r\n          LIGHT BEAMS stream in. Eerie quiet.\r\n          Jake takes it in, HAUNTED. Something CRUNCHES under his boot --\r\n          DRIED FLOWERS. Sticking out from an OVERTURNED CRACKED VASE.\r\n          Jake BLINKS, affected -- Bends over, TOUCHES the VASE AS:\r\n          MEMORY FLASECUT! FRESH FLOWERS in a woman's hand... THE W B&amp;\r\n          FROM JAKE'S PICTURE. She smiles at him --\r\n\r\n<b>                         THE WOMAN\r\n</b>          You shouldn't have.\r\n          She turns, drops the flowers into the vase as we see she's\r\n          talking to JAKE.\r\n\r\n<b>                         JAKE\r\n</b>          Got you somethin' else.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          41.\r\n</b>          CLINK -- He drops a LEATHER POUCH on the table next to the vase.\r\n          A FEW GOLD COINS clink out. The woman turns to him, WORRIED:\r\n\r\n<b>                         THE WOMAN\r\n</b>          Where'd you get this?\r\n\r\n<b>                         JAKE\r\n</b>          Where do you think?\r\n          The woman looks to the pouch -- Picks up one of the coins.\r\n          TORN. Jake moves behind her. Close. An INTIMACY here.\r\n\r\n<b>                         THE WOMAN\r\n</b>          Your boys '11 come after you.\r\n          ON JAKE. Dark. But DETERMINED:\r\n\r\n<b>                         JAKE\r\n</b>          Let 'em come.\r\n          She turns to him, their eyes HOLD... and they KISS. Soft.\r\n          Tender. Soulful.\r\n          But then -- a THUNDERCRACK turns their attention to the window:\r\n          A STORM CLOUD on the horizon. Same kind that consumed the town.\r\n          The cabin starts to VIBRATE like a tuning fork. The pouch\r\n          slides off the table... THE GOLD COINS SPILL OUT and --\r\n\r\n<b>          BACK TO PRESENT - JAKE\r\n</b>          REELING. What is this memory? Who the hell is the woman?\r\n          Something GLINTS in the far wall where the chimney used to be:\r\n\r\n<b>          ONE OF THE GOLD COINS\r\n</b>          EMBEDDED in the wood. Jake pulls it out of the wall, a thousand\r\n          questions in his eyes. Sunlight SHIMMERS off it and --\r\n          MEMORY FLASHCUT! The spilled coins start SLIDING across the\r\n          floor all by themselves, as if magnetically drawn to THE CHIMNEY\r\n          -- WHOOSH! -- SUCKED right up into it by some VACUUM FORCE!\r\n\r\n<b>                         THE WOMAN\r\n</b>          What's happening?!!!\r\n\r\n<b>          WINDOWS EXPLODE! THE ROOF'S RIPPED AWAY BY SOME NSANE VACUUM\r\n</b>          FORCE AS ULTRAVIOLET LIGHT CRASHES IN! The Woman SCREAMS and --\r\n\r\n<b>          KA-CHINNNG! A STEEL COLLAR SHOOTS DOWN FROM THE LIGHT, CLAMPING\r\n</b>\r\n<b>          AROUND HER NECK! A CABLE SNAPS OUT FROM IT AND WHIPS UPWARD,\r\n</b>\r\n<b>          PULLING HER INTO THE LIGHT --\r\n</b>          She manages to GRAB a doorknob and DANGLES UPWARD, CHOKING as --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          42.\r\n</b>          A DEMONIC SILHOUETTE drops in front of them!\r\n          JESUS!! Jake draws his pistol and FIRES!\r\n           The demon SHRIEKS IN RAGE as SPIKED PLUMES fan out from its\r\n           huge, elongated skull... making it look like a SILHOUETTED\r\n          It QIAï¿½1.-L 2 A T EI! R HEADDRESS!\r\n           Its HIDEOUS FACE comes into the light -- AN AIJIE -- as it\r\n           raises its arm, wearing a WRIST BRACELET that reshapes into a\r\n\r\n<b>                         BLASTER --\r\n</b>           JAKE DIVES AWAY but a searing pulse RIPS A WICKED GASH in his\r\n          side (now we know how he woke up with it in the desert) --\r\n\r\n<b>          THE PULSE PASSES THROUGH JAKE AND HITS THE WOMAN SQUARE IN THE\r\n</b>          C-Mr-M. She 's HURLED backward into the wall, Jake. CRIES OUT:\r\n\r\n<b>                         JAKE\r\n</b>          Alice!\r\n          As he RUSHES to her, her collar UNLOCKS... and FLIES AT JAKE,\r\n          clamping HE'S PULLED INTO THE LIGHT, CHOKING, SCREAMING --\r\n\r\n<b>          BACK TO PRESENT - JAKE\r\n</b>          As he STUMBLES back -- GASPING -- touching his neck --\r\n          Catches his breath. ROCKED. Sees \"Alice's\" BLOOD STAIN on the\r\n          wall. His shaking hand reaches out, brushes over it...\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          (trying out the name)\r\n          \"Alice\"...\r\n          Whoever she was to him, he feels sledgehammered with GRIEF. All\r\n          he knows is, it was THEM. The creatures killed her. And this\r\n          revelation... well, it galvanizes him with RAGE.\r\n          Rage that gives him NEW PURPOSE... then--\r\n\r\n<b>          SUDDENLY -- INSTINCT -- JAKE SENSING SOMETHING IS HERE -- GRABS\r\n</b>\r\n<b>          A CHIMNEY STONE AND SPINS, HURLS IT...\r\n</b>\r\n<b>          AT COLORADO, IN THE DOORWAY BEHIND HIM AIMING A GUN:\r\n</b>          The stone HITS Colorado as he FIRES, the bullet tears PAST Jake\r\n          -- as Colorado recovers, Jake BODYSLAMS HIM -- the GUN goes\r\n          flying, they go hurling THROUGH THE WALL -- LANDING HARD on the\r\n          other side -- aaballs-out. messy. close-quarter death match --\r\n          Jake takes a PUNCH -- Colorado LOOPS an arm around his throat,\r\n          YANKS -- they TUMBLE/SLAM to the floor, Jake LANDING on top of\r\n          Colorado who holds the arm lock, CHOKING THE LIFE OUT OF HIM --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          43.\r\n</b>          Jake -- EYES POPPING -- SEES THE GUN just out of reach --\r\n          fingers GRASP for it -- seconds before he PASSES OUT\r\n          He GRABS the gun and swings it back -- BLAMMII!Colorado ROLLS\r\n          aside as the WALL where his head just was BLOWSOPEN--and\r\n          Jake's ON HIM, PISTOL WHIPPING HIM MERCILESSLYuntilheSPINS\r\n          the gun back around and POINTS IT between Colorado's eyes:\r\n          ON JAKE -- quaking with rage -- he wants to kill this guy so bad\r\n          he can taste it... but something's HOLDING HIM BACK -- GRITS his\r\n          teeth, COCKS the trigger and:\r\n\r\n<b>          EXT. ABANDONED CABIN - DAY\r\n</b>\r\n          -- we CUT WIDE on the cabin as a GUNSHOT CRACKS. A flock of\r\n          BIRDS screech into the sky from the overgrown corn field...\r\n\r\n<b>                         DISSOLVE TO:\r\n</b>\r\n<b>          EXT. DESERT PLAINS - DAY\r\n</b>\r\n          The rest of our people RIDE along, following the ever-tilting\r\n          HOLOGRAPHIC ARROW, their COMPASS, floating from the dead alien's\r\n          eye in the back of the wagon.\r\n          Greavey, Dolar's ranch hand, heels up to ELLA. COCKY SWAGGER:\r\n\r\n<b>                         GREAVEY\r\n</b>          So... what's a pretty lady like y--\r\n\r\n<b>                         ELLA\r\n</b>          -- you finish that sentence, I shoot you\r\n          in your beef whistle.\r\n          Doc, sipping from his canteen, does a SPIT TAKE. Ella's eyes\r\n          DRILL Greavey. Cut down a peg, he tips his hat, red-faced:\r\n\r\n<b>                         GREAVEY\r\n</b>          Ma'am.\r\n          And rides past her, taking us to EMMETT and DOLARHYDE:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Tell me somethin', Kid... why didn't your\r\n          father just take my money?\r\n\r\n<b>                         EMMETT\r\n</b>\r\n<b>                         (CONFUSED)\r\n</b>          What money?\r\n\r\n<b>                         UOLARHY DE\r\n</b>          offered him a thousand dollars to leave\r\n          town. He could's taken you outta harm's\r\n          way, relocated... found you a new momma.\r\n          And this just BURNS Emmett. A beat; then:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          44.\r\n</b>\r\n<b>                         EMMETT\r\n</b>          Is it true Percy's momma died givin'\r\n          birth to him, Mister Dolarhyde?\r\n          Something FLASHES in Dolarhyde. But he's contained:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Yeah.\r\n\r\n<b>                         EMMETT\r\n</b>          Then maybe you should use that thousand\r\n          dollars to buy yourself a new wife.\r\n          Emmett HOLDS his look against Dolarhyde's. Brave and\r\n          UNFLINCHING. Doc can't help but grin at the kid's moxie... but\r\n          it's short-lived as his face suddenly falls:\r\n\r\n<b>                         DOC\r\n</b>          Madre Dios...\r\n          And we PAN AROUND, dropping over his shoulder to see what he's\r\n          reacting to --\r\n          AN ENORMOUS CRATER. ACRES WIDE... TWENTY FEET DEEP. Even\r\n          Dolarhyde looks nervous now:\r\n\r\n<b>                         DOLARYHYDE\r\n</b>          What the... hell is it?\r\n\r\n<b>                         MEACHAM\r\n</b>          It was Winfield's Landing.\r\n          They turn to see Meacham, brushing the DUST off a WOODEN SIGN:\r\n          Holds it UP. \" Winfield's Landing... Population 133.\"\r\n          ON GREAVEY AND THE MEN. Shit. He doesn't mean...?\r\n\r\n<b>                         GREAVEY\r\n</b>          You tryin' to tell me those... things\r\n          pulled the whole damn town into the sky?\r\n          And suddenly a weird CRACK shakes the canyon -- like the SOUND\r\n          BARRIER BREAKING -- everyone's look goes UP where:\r\n          SWIRLING, DARK CLOUDS LOOM. The same clouds that dropped the\r\n          tornado on Absolution. And that appeared in Jake's MEMORIES at\r\n          the cabin. But this time, something's SHOT OUT from them --\r\n\r\n<b>                         MEACHAM\r\n</b>          That can't be good.\r\n          The plummeting object HITS a distant dune, kicking up a SAND\r\n\r\n<b>          PLUME -- ROLLING TOWARD THEM --\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          Scatter.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          45.\r\n</b>          -- everyone runs their horses aside as the object BOUNCES over\r\n          rocks -- then SLOWS... to a STOP.\r\n          They STARE. Finally Dolarhyde kicks his horse forward slowly...\r\n          DISMOUNTS, draws his GUN. What he sees is SHOCKING:\r\n          It's an OVAL CAPSULE OF BLUE GOO, the outer layer some kind of\r\n          TRANSLUCENT COCOON. Suspended within the murky Jell-o is a\r\n          GE, DEC SHAPE. Motionless. UH-OH.\r\n          The others draw guns too, converging around it in equal SHOCK\r\n          and FEAR. But the thing doesn't MOVE.\r\n\r\n<b>                         DOC\r\n</b>          Should we... open it?\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Should we open it? Hell NO we shouldn--\r\n\r\n<b>                         EMMETT\r\n</b>          -- oops --\r\n          -- and now we find Emmett's already POKING it with a stick, a\r\n          Small TEAR in the cocoon's outer embryonic layer -- GOO leaks --\r\n          then it RUPTURES, EXPLODING as the horses REAR away, WHINNYING\r\n          the goo spreads across the desert floor, thinning out.\r\n          BEAT. Everyone wipes blue shit off their clothes as they come\r\n          FACE-TO-FACE with the object inside, lying there on the ground:\r\n\r\n<b>          A COW. YES, A COW.\r\n</b>          Motionless. DEAD, in fact. A METAL TUBE jammed in its mouth,\r\n          connected to a VALVE in the now-flaccid bubble's outer shell.\r\n          Greavey notices a BRANDING on the cow's rump -- the letter \"D\":\r\n\r\n<b>                         GREAVEY\r\n</b>          Boss... it's one'a yours.\r\n          Dolarhyde's eyes NARROW. Emmett looks at Doc, SCARED:\r\n\r\n<b>                         EMMETT\r\n</b>          Is-- is this what happened to my Pa?\r\n          Doc dismounts. Moves to the cow's mouth and PULLS OUT THAT TUBE\r\n          with a wet SQUISHING sound. Thinking it through:\r\n\r\n<b>                         DOC\r\n</b>          This was stuck down its throat... to help\r\n          it breathe. That means they wanted to\r\n          keep it alive, Emmett.\r\n          (forces a small smile)\r\n          I'm sure your father is fine.\r\n          But Doc's eyes aren't sure. Meacham looks back to the sky:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          46.\r\n</b>\r\n<b>                         MEACHAM\r\n</b>          Why'd they dump it?\r\n\r\n<b>                         ELLA\r\n</b>          Whatever they needed from it, they\r\n          must've got.\r\n\r\n<b>                         (THEN)\r\n</b>          Gonna get dark soon, need to keep moving.\r\n          She does. The others FOLLOW in a chilled daze. The last is\r\n          DOLARHYDE, glancing back at his dead cow with angry eyes...\r\n\r\n<b>                         DISSOLVE TO:\r\n</b>\r\n<b>          EXT. RIDGE ABOVE VALLEY - DUSK\r\n</b>\r\n          Now our people APPEAR riding up a ridge... Dolarhyde shoots up a\r\n          HAND, bringing the caravan to a STOP. Once again, SHOCK:\r\n\r\n<b>                         EMMETT\r\n</b>          Ho-ly shit.\r\n          BOOM UP to reveal a SURREAL SIGHT in the valley below:\r\n          AGAMBLING RIVERBOAT. Nose buried in the sand, paddlewheels\r\n          facing the sky, as if it'd been dropped from the clouds into the\r\n          desert. Just like that cow. Off their LOOKS --\r\n\r\n<b>          EXT. DESERT - THE PADDLEBOAT - MINUTES LATER\r\n</b>\r\n          TRACKING alongside of the TILTED PADDLEBOAT, our team rides\r\n          around it. Trying to make SENSE. STENCILED on the stern is...\r\n\r\n<b>                         DOC\r\n</b>          \"Colorado Queen.\"\r\n\r\n<b>                         (THEN)\r\n</b>          The river's two hundred miles from here.\r\n          But Ella doesn't seem as impressed as the rest of them. In\r\n          fact, her attention is drawn BEHIND them, to something coming up\r\n          over the DUNES... the barest flicker of a smile --\r\n\r\n<b>                         ELLA\r\n</b>          Son of a bitch.\r\n          IT'S JAKE ON HORSEBACK. Followed by another horse, with\r\n          COLORADO in the saddle. Wrists tied but ALIVE. As Jake rides\r\n          to a stop, he PUSHES Colorado off the horse -- the indian HITS\r\n          the ground with a THUD as Jake levels Dolarhyde with HARD EYES:\r\n\r\n<b>                         JAKE\r\n</b>          Your man got it in his head that he was\r\n          s'posed to kill me. I'm holding onto his\r\n          ear 'til he says sorry.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          47.\r\n</b>          As Colorado stumbles to his feet angrily, humiliated, Dolar\r\n          notices his BLOODY EAR. The LOBE has been SHOT OFF. He looks\r\n          up at Jake, half-angry, half-EMBARRASSED --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Why'd you let him live?\r\n          Jake's hard-as-nails. DRIVEN now --\r\n\r\n<b>                         JAKE\r\n</b>          Gonna need him.\r\n          He rides past Dolar to Ella. Stops. Says, simply:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Nice boat.\r\n          (then... SNIFFS)\r\n          What's that smell?\r\n\r\n<b>                         ELLA\r\n</b>          That'd be me.\r\n          He realizes her shirt's caked in the BLUE GOO from the cow.\r\n\r\n<b>                         JAKE\r\n</b>          Why're you blue?\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>                         (DRYLY)\r\n</b>          Cause I missed ya.\r\n          Their look HOLDS. A MOMENT. Something REAL between them.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          We better keep movin'.\r\n          A THUNDERCRACK. On the horizon, sheets of RAIN.\r\n\r\n<b>                         JAKE\r\n</b>          Storm's comin'. I say we dig in here til\r\n          it passes.\r\n          (to Colorado; fucking\r\n\r\n<b>                         WITH HIM)\r\n</b>          How's that sound, Nat?\r\n          Nat BURNS. Dolar feels his AUTHORITY being undermined:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Storm or no storm, I say we keep movin'.\r\n          Colorado finally turns to Uolarhyde. DEFIANT:\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Too hard tracking anything in the rain.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          48.\r\n</b>          Dolarhyde GLARES at Colorado, who GLARES BACK: his loyalty now\r\n          in QUESTION. The tide IS turning against the rancher.\r\n\r\n<b>          EXT. UPENDED RIVERBOAT - NIGHT - LATER\r\n</b>\r\n          RAIN POURS on the overturned boat. Horses tethered. The ALIEN\r\n          CORPSE has been moved onto a slanted deck, covered by a TARP...\r\n          WE TILT TO THE ALIEN'S HAND. Poking out. Motionless. HOLD on\r\n          it, longer than we're comfortable.\r\n\r\n<b>          INT. UPENDED RIVERBOAT - LATER THAT NIGHT\r\n</b>\r\n          A RATTLESNAKE is coiled around a CHANDELIER... except the\r\n          chandelier is on the floor and the floor is the CEILING.\r\n          Upended gambling tables. WOODRATS scurry over FOOD. Every\r\n          window's SMASHED... as if something just TOOK everyone.\r\n          Dolar sits by a FIRE made from furniture parts, drinking from a\r\n          WHISKEY FLASK. Colorado opposite, rubbing his MANGLED EAR.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          You okay?\r\n\r\n<b>                         COLORADO\r\n</b>          (low, eyes averted)\r\n          Yeah.\r\n          Dolar pours some whiskey on a BANDANA, leans towards Colorado --\r\n\r\n<b>                         DOLARHYDE COLORADO\r\n</b>          Lemme clean it for you or\r\n          it'll get -- -- I'm fine.\r\n          Dolarhyde backs away. Colorado GLARES.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Say it.\r\n\r\n<b>                         COLORADO\r\n</b>          (after a beat)\r\n          Is Percy worth dyin' for?\r\n          Dolar's eyes flash. A mixture of anger and PAIN. Then --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          He's my son.\r\n\r\n<b>                         (POINTED)\r\n</b>          I take care of my kin, Nat.\r\n          ON COLORADO as that lands. Clearly, there's something here...\r\n          a bond that seems to go deeper than just boss and employee. But\r\n          WHAT? Finally Nat just gets up and LEAVES.\r\n          Dolar watches him go, takes a healthy SWIG. Hears a WHIMPER.\r\n          Looks over and sees... EMMETT, huddled in a corner. CRYING.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          49.\r\n</b>          ON DOLARHYDE. The kid's naked emotion AFFECTING him, but the\r\n          fact Dolar might have a conscience makes him ANGRY too. Low:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Hey. Kid.\r\n          Emmett looks up, SNIFFLES. Dolar tosses him the WHISKEY FLASK:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Take a drink and shut p.\r\n          He gets up, walks off. Leaving the kid with the flask. As\r\n          Emmett looks at it confusedly, stuffs it in his POCKET --\r\n\r\n<b>          INT. UPENDED RIVERBOAT - KITCHEN - CONTINUOUS\r\n</b>\r\n          Meacham has set out TIN PANS under holes to collect RAIN WATER.\r\n          Dumps a pan into his CANTEEN as Doc enters with COFFEE for him:\r\n\r\n<b>                         DOC\r\n</b>          (re: the tin plates)\r\n          We brought enough water.\r\n\r\n<b>                         MEACHAM\r\n</b>          Not for drinkin', it's for blessin'.\r\n          Doc nods: ah. Turns to go... STOPS. Turns back. Intense eyes:\r\n\r\n<b>                         DOC\r\n</b>          Padre... Maria came to see you in\r\n          confession every Sunday. It seemed...\r\n          she had a lot to talk about.\r\n          (beat, this is hard)\r\n          Was she having an affair?\r\n          Meacham removes his spectacles. Looks at Doc --\r\n\r\n<b>                         MEACHAM\r\n</b>          You know I can't say.\r\n          And Doc DOES know. But there's a quiet DESPERATION here --\r\n\r\n<b>                         DOC\r\n</b>          The last thing I said to her... I...\r\n          (shakes his head; then)\r\n          Please. If I'm wrong about my wife... I\r\n          don't want to die angry.\r\n          Meacham sees the PAIN in his friend's eyes.\r\n\r\n<b>                         MEACHAM\r\n</b>          You can ask Maria if she was cheatin' on\r\n          you once we get her back. 'Til then?\r\n          (bit of a grin)\r\n          Don't die.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          50.\r\n</b>          And OFF DOC, thunder CRACKS --\r\n\r\n<b>          INT. RIVERBOAT - COMMODORE'S QUARTERS - NIGHT\r\n</b>\r\n          RAIN pours down through an open gash in the roof, splashing the\r\n          floor. Ella enters, glances back toward the door to make sure\r\n          she's alone, then pulls off her shirt and folds it over a stool.\r\n          Upper body NAKED in the moonlight. We catch only a FLASH of\r\n          this, and for a moment it's PURE HOTNESS...\r\n          . until she turns and something ELSE is revealed: criss-\r\n          crossed LASH MARKS on her back.\r\n          She turns away and starts to SPLASH herself with water, erasing\r\n          the blue goo and dirt from her skin and face... then: A MATCH\r\n          ignites behind her. She WHIRLS, startled, covering her breasts\r\n          with her arms -- JAKE is sitting in a chair at the Commodore's\r\n          desk, casually lighting a cheroot in his mouth:\r\n\r\n<b>                         JAKE\r\n</b>          You missed a spot.\r\n\r\n<b>                         ELLA\r\n</b>          The hell,-re- you doing here?\r\n\r\n<b>                         JAKE\r\n</b>          Mindin' my own business.\r\n          (snaps out the match)\r\n          Then you decided to take a shower.\r\n\r\n<b>                         ELLA\r\n</b>          Why didn't you say anything?\r\n\r\n<b>                         JAKE\r\n</b>          Givin' you privacy.\r\n          She throws her shirt on, but her skin's wet and the shirt glues\r\n          to her, celebrating her shape in a way that can't be ignored.\r\n          Jake tosses her his jacket. As she slips it on, she notices a\r\n          bottle of WHISKEY on the table... and the PHOTOGRAPH OF ALICE.\r\n\r\n<b>                         ELLA\r\n</b>          . she's pretty.\r\n          (Jake says NOTHING)\r\n          Who was she?\r\n          Jake's quiet. DARK. Intense emotion, intensely suppressed:\r\n\r\n<b>                         JAKE\r\n</b>          only thing I know's her name was Alice...\r\n\r\n<b>                         (THEN; DISTANT)\r\n</b>          And she's dead.\r\n          Ella looks up at him. INTO him --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          51.\r\n</b>\r\n<b>                         ELLA\r\n</b>          Maybe you loved her.\r\n          Jake shakes his head, sort of mumble/chuckles in RESISTANCE:\r\n\r\n<b>                         JAKE\r\n</b>          All you women are the same -- Always\r\n          wanna make it about Goddamn \"love.\"\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>                         (A BEAT)\r\n</b>          Trust me, Lonergan. I'm not the same.\r\n          There is a force -- a strength about this woman -- that he\r\n          connects with. But remains, true to character, ALOOF:\r\n\r\n<b>                         JAKE\r\n</b>          Don't matter.\r\n          She takes a step closer. Soft. Intimate.\r\n\r\n<b>                         ELLA\r\n</b>          So what dj= matter?\r\n          Jake just looks at her. Then, lifts the cheroot to his lips,\r\n          the FLARE of its tip casting him in a demonic light...\r\n\r\n<b>                         JAKE\r\n</b>          What matters is I find the thing that\r\n          killed her.\r\n          (dark as hell)\r\n          And make it pay.\r\n          And now, he leans forward with a focused LOOK... holds up his\r\n\r\n<b>                         BRACELET:\r\n</b>\r\n<b>                         JAKE (CONT'D)\r\n</b>          Where'd you see this before?\r\n          A beat. Ella -- somehow CONTAINED -- opens her mouth to lie.\r\n          But he cuts her off --\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          -- and don't lie to me. You wouldn't've\r\n          asked me if you didn't recognize it.\r\n          Ella tightens. PAIN in her eyes. And Jake REALIZES:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Those things... they the ones who put\r\n          those marks on your back?\r\n          She swallows: a mixture of SHAME that he's found her out... and\r\n          ANGER at what was done to her.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          52.\r\n</b>\r\n<b>                         ELLA\r\n</b>          They took my people. Destroyed where I'm\r\n          from.\r\n\r\n<b>                         JAKE\r\n</b>          Where's that?\r\n\r\n<b>                         ELLA\r\n</b>          North of here. Been trackin' 'em ever\r\n          since, town to town. Best I figure,\r\n          they're hidin' in a mine.\r\n          Jake CONSIDERS all this. Softens a little:\r\n\r\n<b>                         JAKE\r\n</b>          Maybe if you'd told me the truth instead\r\n          of throwin' rocks at me --\r\n\r\n<b>                         ELLA\r\n</b>          -- what, you would've stuck around?\r\n          Bullshit. I couldn't've turned you away\r\n          from what you had to do, any more than I\r\n          could've stopped these people from going\r\n          after their kin.\r\n\r\n<b>                         (BEAT)\r\n</b>          Truth ain't worth a damn, Jake... and\r\n          we're gonna need all the guns we can get.\r\n          Their look HOLDS... until Jake SMIRKS. Likes her style:\r\n\r\n<b>                         JAKE\r\n</b>          So that's the only reason you wanted me\r\n          to come with you? Cause of my gun?\r\n          There's a pause... then Ella SMIRKS back:\r\n\r\n<b>                         ELLA\r\n</b>          No, not your gun.\r\n\r\n<b>                         (BEAT)\r\n</b>          What you do with it.\r\n          Among the many things these two ate feeling -- both separately\r\n          and together -- the one that pops right now is ATTRACTION.\r\n          Confusing as it is for him. The pregnant moment LINGERS...\r\n          Until Happy suddenly starts to GROWWWWL, sensing something\r\n          outside. ANOTHER CRACK OF THUNDER as:\r\n\r\n<b>          INT. STATEROOM - CONTINUOUS\r\n</b>\r\n          The horses STAMP NERVOUSLY out the window as Greavey and the\r\n          rest of Dolarhyde's men (COBBETT and 4 others) HUDDLE in secret\r\n          conference -- whispers that sound a lot like MUTINY --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          53.\r\n</b>\r\n<b>                         GREAVEY\r\n</b>          What the hell're we doin' here? We\r\n          should be ridin' in the opposite\r\n          direction of those things --\r\n\r\n<b>                         COBBETT\r\n</b>          We do that, the old man's likely to shoot\r\n          us himself. Only way outta this is --\r\n          And suddenly. Greavey SNIFFS the air, FROWNS:\r\n\r\n<b>                         GREAVEY\r\n</b>          . what's that smell?\r\n          -- as they TURN to the deck where the creature lays... ALL THEY\r\n\r\n<b>          FIND IS AN EMPTY TARP FLAPPING AIMLESSLY:\r\n</b>\r\n<b>                         COBBETT\r\n</b>\r\n<b>                         AW SH--\r\n</b>          LIGHTNING FLASHES, illuminating the ship -- and als4THE ALIEN\r\n          behind them. a coiled mass clinging spiderlike to the ceiling!!!\r\n          Its arm WHIPS out, noosing around Cobbett -- LIFTS HIM off his\r\n          feet -- SLAMS HIM into the ceiling -- TOSSES HIM like a ragdoll:\r\n          The men SHOUT -- a PAIR OF RAZOR SHARP CANINES extrude from the\r\n          alien then it SPRINGS -- SLICING THROUGH TWO MEN AT ONCE --\r\n          GREAVEY and 2 others manage to SCRAMBLE AWAY:\r\n\r\n<b>          INT. RIVERBOAT - VARIOUS - CONTINUOUS\r\n</b>\r\n\r\n<b>          JAKE AND ELLA\r\n</b>          HEAR the SCREAMS -- Happy takes off -- they RACE after him --\r\n\r\n<b>          DOC AND MEACHAM\r\n</b>          Hear them too -- grabs their PISTOLS -- and Doc, his CANTEEN --\r\n          DQIRHXPE_. 9oWQ n\r\n          Colorado snatches up a WINCHESTER, LOADS IT, throws another one\r\n          to Dolar -- who's suddenly, surprisingly, PROTECTIVE of Emmett:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Get behind me, Boy --\r\n          THE ALIEN SPRINGS INTO THE ROOM -- landing upside down on the\r\n          ceiling. Dolar FIRES at it --\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>\r\n<b>          RUN, KID! GIT!\r\n</b>          Emmett SCRAMBLES down a FLOOR HATCH, disappears as Dolar keeps\r\n          FIRING -- but the alien BATS the gun away and LIFTS Dolar UP --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          54.\r\n</b>          Paralyzed with FEAR, he EXHALES a terrified GASP and --\r\n          THE CREATURE RECOILS FROM HIS BREATH! HURLS Dolar aside --\r\n          THROUGH THE FIRE -- embers catch CURTAINS and FLAMES SPREAD --\r\n          COLORADO races in, throws a TOMAHAWK -- it PINS the alien's claw\r\n          to the wall, the monster SHRIEKS as Nat draws a PISTOL but --\r\n          The alien SPITS A STICKY RESIN GOB -- it HARDENS, pinning NAT'S\r\n          hand with the pistol to the wall in return. He STRUGGLES as the\r\n          alien ADVANCES --\r\n          BOOM! The Alien's shoulder EXPLODES ORANGE FLUORESCENT BLOOD as\r\n          a GUNSHOT rings out -- it's Dolarhyde, back on his feet aid\r\n          FIRING -- the monster SCREECHES and leaps down, DISAPPEARING\r\n          through the hatch where Emmett fled --\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>\r\n<b>          GODDAMMITT!!!\r\n</b>          And the fire's GROWING around the boat --\r\n\r\n<b>          INT. CRAWLSPACE - CONTINUOUS\r\n</b>\r\n          EMMETT moves FAST on hands-and-knees through a narrow CRAWLSPACE\r\n          -- around a corner here -- another there -- a MAZE --\r\n\r\n<b>          SOMEWHERE BEHIND HIM -- THE ALIEN -- CRAWLING FAST --\r\n</b>          EMMETT -- reaches another HATCH -- pushes through and OUT:\r\n\r\n<b>          INT. RIVERBOAT BALLROOM - CONTINUOUS\r\n</b>\r\n          -- DROPPING onto the floor -- as we WHIP TO Jake racing in from\r\n          around a corner -- but suddenly: THE ALIEN BURSTS FROM THE HATCH\r\n\r\n<b>          BEHIND EMMETT, SWEEPING HIM UP IN ITS CLUTCHES:\r\n</b>          Jake's bracelet OPENS UP into that BLASTER and it's AIMED at The\r\n          Alien but the creature CUPS a hand around Emmett and LIFTS HIM\r\n          off the floor, a TALONED FINGER pressed to the boy's THROAT:\r\n          STANDOFF. ELLA rushes in. The creature sees her -- HISSES --\r\n\r\n<b>                         JAKE\r\n</b>          Don't know if you understand me... but\r\n          you hurt that boy and I hurt you.\r\n\r\n<b>          CLOSE, EMMETT -- MUFFLED, TEARS LEAKING FROM HIS TERRIFIED EYES:\r\n</b>\r\n<b>          MEACHAM (O.S.)\r\n</b>\r\n<b>          I=.\r\n</b>\r\n<b>          RACK FOCUS TO REVEALMEACHAM BEHIND THE ALIEN:\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          55.\r\n</b>\r\n<b>                         MEACHAM (CONT'D)\r\n</b>\r\n<b>          BY THE SPIRIT OF THE LORD, GO BACK TO\r\n</b>\r\n<b>          HELL, DEMON!\r\n</b>          Meacham brings his CANTEEN down like a HATCHET, SPRAYING the\r\n          alien with HOLY WATER... but NOTHING happens! And then --\r\n          The Alien STRIKES -- SLAMMING MEACHAM BACK INTO A JUTTING PIECE\r\n\r\n<b>          OF IRON, IMPALING HIM --\r\n</b>\r\n<b>                         MEACHAM (CONT'D)\r\n</b>\r\n<b>          ! ! !\r\n</b>          The Alien SPRINGS through a doorway, TAKING EMMETT WITH IT.\r\n          Ella RUSHES after it as Jake RUNS to Meacham, hanging impaled:\r\n\r\n<b>                         JAKE\r\n</b>          Easy, now... Don't move, dammit --\r\n\r\n<b>                         (TURNS; SHOUTING)\r\n</b>\r\n<b>          DOC -- GET IN HERE NOW!\r\n</b>\r\n<b>                         MEACHAM\r\n</b>          Go after the boy... then you get our\r\n          people back...\r\n\r\n<b>                         JAKE\r\n</b>          Stop talking. DQW! GET YOUR ASS--\r\n          But Meacham GRABS Jake, EYE TO EYE. GASPING:\r\n\r\n<b>                         MEACHAM\r\n</b>           Listen up... 'cause I'm not gonna be able\r\n          to say it again --\r\n          (pulls Jake CLOSE)\r\n          God don't care who you were, Son... only\r\n          who you Mg.\r\n          ON JAKE. AFFECTED. With a last RASP, Meacham DIES just as DOC\r\n          races through the growing FLAMES -- REACTS -- no time to mourn --\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>          JAKE -- WE GOTTA GO M!\r\n</b>          But Jake can't let go -- FURY -- HEARTBREAK -- Doc PULLS HIM\r\n          away -- Jake SNAGS THE CRUCIFIX off Meacham's neck as he's\r\n          forced OUT, leaving Meacham's body to be CONSUMED BY FLAMES --\r\n\r\n<b>          EXT. UPENDED RIVERBOAT - DESERT - NIGHT\r\n</b>\r\n          The boat is a BALL OF FIRE in the pouring rain, as what remains\r\n          of our heroes stumble out, COUGHING, devastated... Jake, Doc,\r\n          Dolarhyde, Colorado, Greavey, 2 GUNMEN... and Ella and Happy\r\n          atop a DUNE, following a TRAIL OF FLUORESCENT ORANGE BLOOD\r\n          streaking into the desert. Happy BARKING MADLY. Ella drops to\r\n          a knee, touches the orange blood as it WASHES AWAY in the rain:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          56.\r\n</b>\r\n<b>                         ELLA\r\n</b>\r\n<b>          RAIN'S GONNA COVER ITS TRACKS!\r\n</b>\r\n<b>                         NAT COLORADO\r\n</b>          That thing... was dead... it was d-ead...\r\n          DOLARHYDE, RAIN pouring down his face... VULNERABLE and GUILTY:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          I couldn't stop it -- It just... grabbed\r\n          the kid.\r\n          ON JAKE. Rage-filled against the flames... Meacham's CRUCIFIX\r\n          in his hared, as his FIST closes around it. Looks up, HARDCORE:\r\n\r\n<b>                         JAKE\r\n</b>          Then we'd better get him back.\r\n\r\n<b>                         SMASH TO:\r\n</b>\r\n<b>          INT. STALACTITE CAVERN - NIGHT\r\n</b>\r\n          STALACTITES loom from the ceiling -- BAM! EMMETT is DROPPED on\r\n          the floor of a sinister cave -- scrambles back from THE ALIEN:\r\n\r\n<b>                         EMMETT\r\n</b>          Damn. You are one ugly bastar--\r\n          PSST! The alien spits a RESIN GOB on Emmett's mouth -- PSST\r\n          PSST! More gobs PIN his limbs to the wall. Emmett can't move --\r\n          can't speak -- eyes WIDE and TERRIFIED --\r\n          The creature looks down at an ARMOR PLATE on its bicep. Touches\r\n          a series of keys and the armor spits out what looks like...\r\n          .. a small RUBIK'S CUBE made of some alien alloy.\r\n          The creature casually TOSSES IT in the air where it FLOATS and\r\n          starts to SPIN -- as it does, its sides FLIP AND TURN (like a\r\n          Rubik's Cube) -- emitting HIGH-PITCHED SONAR BEEPS:\r\n          This thing's some kind of HOMING BEACON.\r\n          Off Emmett's WIDE, GAPING EYES...\r\n\r\n<b>          EXT. DESERT PLAINS - SUNRISE\r\n</b>\r\n          Our people RIDE FAST against the rising sun, on the hunt for\r\n          Emmett. Colorado REARS his horse, kneels by a trace of ORANGE\r\n          BLOOD on some rocks.\r\n\r\n<b>                         NAT COLORADO\r\n</b>          (looks off --)\r\n          West.\r\n          Greavey and the others share a LOOK. E o Turn to Dolar --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          57.\r\n</b>\r\n<b>                         GREAVEY\r\n</b>          Boss, only took one of them things to\r\n          kill four of us. We got no chance here.\r\n          Dolarhyde BURNS -- knowing he's being ABANDONED --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          You're a goddamn coward.\r\n          (to the others)\r\n           You work for me, dammit. You're my\r\n          m e 1 1 Qyees.\r\n          And Greavey, finally FREE to speak his mind, says SPITEFULLY:\r\n\r\n<b>                         GREAVEY\r\n</b>          Fine line between a coward and a fool.\r\n          The men turn tail and RIDE AWAY. Dolarhyde SHOUTS after them --\r\n\r\n<b>                         DOLARHYDE\r\n</b>          You're all FIRED!\r\n          Doc takes the opportunity to TWIST the knife:\r\n\r\n<b>                         DOC\r\n</b>          Looks like they finally found something\r\n          to be more scared of than you.\r\n          Dolarhyde feels his world CRUMBLING away man by man...\r\n          Ella trots alongside Jake, who's staring at that DARK CLOUD MASS\r\n          overhead with a bad feeling:\r\n\r\n<b>                         JAKE\r\n</b>          Clouds've been moving east since sun-\r\n          up... 'cept that one.\r\n          ON ELLA. We SENSE she knows something, something more she isn't\r\n          saying. SNAPS her reins and they RIDE OFF:\r\n\r\n<b>          INT. BOX CANYON - CONTINUOUS\r\n</b>\r\n          As the group gallops into a BOX CANYON, Happy starts BARKING\r\n          MADLY -- the horses SLOW --\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>                         SOMETHING'S WRON--\r\n</b>          BLAMBLAN1111 GUNSHOTS from above suddenly PEPPER the ground --\r\n          the horses REAR and KICK UP, startled --\r\n          A DOZEN FIGURES ON THE CLIFFS ALL AROUND THEM. Badass OUTLAWS\r\n          with RIFLES aimed at our heroes. One of them CALLS DOWN:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          58.\r\n</b>\r\n<b>                         OUTLAW GUNMAN\r\n</b>\r\n<b>          EVERYBODY DRAW YOUR GUNS SLOW AND TOSS\r\n</b>\r\n<b>          'EM ON THE GODDAMNED GROUNDI\r\n</b>\r\n<b>          SHIT.\r\n</b>          SLOWLY, Jake draws his gun... tosses it. Now the rest of them.\r\n          As they SEE -- TWO RIDERS -- incoming -- from the other end of\r\n          the canyon. Rifles aimed and ready. Happy GROWLS...\r\n          One of the outlaws knocks back the hammer on his rifle --\r\n\r\n<b>                         OUTLAW\r\n</b>          I say we just shoot 'em and take their--\r\n          But the words catch in his throat as his EYES WIDEN:\r\n\r\n<b>                         OUTLAW (CONT'D)\r\n</b>          . Boss?\r\n          Sure enough, they're looking right at (BRONC\r\n          -JAKE. Both outlaws\r\n          and HUNT) lower their guns, hostility replaced by SURPRISE:\r\n\r\n<b>                         HUNT\r\n</b>          What the hell you doin' back here,\r\n          Lonergan?\r\n          Oh, Christ. This is JAKE'S gang. ON DOLARHYDE. ELLA.\r\n          COLORADO. All registering it. And JAKE, of course, doesn't\r\n          REMEMBER these men as Bronc dismounts, NERVOUS:\r\n\r\n<b>                         BRONC\r\n</b>          Jesus, Boss... Creek's gonna shit when he\r\n          sees you.\r\n          (then; re: the others)\r\n          And who the hell're they?\r\n          ON JAKE. Now does he handle this? Ht:nt rides up next to him,\r\n          SUSPICIOUS, and for reasons yet to be known, UNFRIENDLY --\r\n\r\n<b>                         HUNT\r\n</b>          What's the matter, Jake. Cat got your--?\r\n          SMACKI Jake moves LIGHTNING FAST, SLAPS Hunt across the face,\r\n          stopping the question on his tongue -- CATCHES the gun as it\r\n          drops and presses the barrel into Hunt's NECK:\r\n\r\n<b>                         JAKE\r\n</b>          Since when're Qy the one asking the\r\n          goddamned questions!?!\r\n          Ella and our people REACT as Jake plays it up, beat defense a\r\n          good OFFENSE. The outlaws are SCARED: this is the Lonergan they\r\n          know. Hunt holds his BLOODY MOUTH:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          59.\r\n</b>\r\n<b>                         HUNT\r\n</b>          Christ, Jake... You broke my tooth\r\n\r\n<b>                         JAKE\r\n</b>          Quit whining. Now bring me to the rest\r\n          of the boys, if that meets with your\r\n          goddamn approval.\r\n          Bronc and Hunt nod, mounting up, SHOUTING to the OUTLAWS above:\r\n\r\n<b>                         BRONC\r\n</b>\r\n<b>          LONERGAN'S BACK. MEET US AT THE CAMP!\r\n</b>          As they RIDE OFF, Dolarhyde looks to Jake and mutters:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Nice company you keep.\r\n\r\n<b>                         ELLA\r\n</b>          What the hell're you doing? If we don't\r\n          catch up to that kid, we're never gonna--\r\n\r\n<b>                         JAKE\r\n</b>          They called me \"Boss.\" You wanna go\r\n          after these things with five or fifty?\r\n          (off her look)\r\n          Like you said: we can use every gun we\r\n          can get.\r\n          Qh. That actually makes SENSE. But --\r\n\r\n<b>                         ELLA\r\n</b>          What exactly're you gonna say to 'em?\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>                         (A BEAT)\r\n</b>          Tell you when I figure it out.\r\n          And he SPURS onward, leaving her to follow uneasily --\r\n\r\n<b>          INT. STALACTITE CAVERN - DAY\r\n</b>\r\n\r\n<b>          CLOSE -- RUBIK'S CUBE -- STILL SPINNING MID-AIR AS:\r\n</b>          OUR ALIEN HANGS UPSIDE DOWN from stalactites by four spindly\r\n          limbs. Mid sleep cycle. And inches below its head...\r\n          EMMETT, still webbed to the wall. Unable to move or speak,\r\n          TERRIFIED. As suddenly... the cube DEACTIVATES. And DROPS --\r\n          THE CREATURE'S EYES SNAP OPEN. It SPRINGS from the ceiling as\r\n          FOUR DARK SHAPES blot out light, GLIDING IN...\r\n\r\n<b>          MANTRA RAY HOVER SPEEDERS\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          60.\r\n</b>          A gang of FOUR MORE ALIENS dismounts. The biggest and STRONGEST\r\n          -- their LEADER -- barks GUTTURAL CLICKS at the alien who\r\n          kidnapped Emmett. Kidnapper explaining as it removes another\r\n          STRANGE DEVICE. The device beams a HOLO-PROJECTION...\r\n          OF ELLA'S FACE! The aliens HISS in furious RECOGNITION.\r\n          JESUS... is this some kind of otherworldly WANTED POSTER?\r\n          PLUMES fan out angrily from the Leader's HUGE, ELONGATED SKULL --\r\n          like an indian headdress! The creature TURNS to Emmett --\r\n          It's the alien who killed Jake's woman! We'll come to know it\r\n          as... THE SLAVER.\r\n          It MOVES OMINOUSLY for Emmett, grasping the HANDLE of something\r\n          that UNCOILS with fluid, frightening speed:\r\n          A WHITE-HOT LASER WHIP. This will be The Slaver's SIGNATURE\r\n          WEAPON. It spirals to its full length, FLASHING out at --\r\n          EMMETT -- MUFFLED SCREAM! But... the whip DOESN'T cut him,\r\n          instead it SLICES THROUGH THE WEBBING that pins the boy to the\r\n          wall. As Emmett FALLS, The Slaver SWEEPS HIM UP -- Emmett\r\n          FLAILS, punching, kicking to no avail -- but then:\r\n\r\n<b>                         DOLARHYDE'S FLASK\r\n</b>          Tumbles from Emmett's pocket and SPLASHES WHISKEY on The Slaver\r\n          -- IT.. S[iRIEM WILDLI-Aa THE BOOZE CONTACTS FLESH, SKIN SMOKING!\r\n          EMMETT -- tumbles away. Terror turns to REVELATION as he PULLS\r\n          the webbing from his mouth:\r\n\r\n<b>                         EMMETT\r\n</b>          Holy SHIT.\r\n          Another alien LUNGES for the kid but Emmett SPLASHES him with\r\n          the flask -- the alien RECOILS, flesh BUBBLING --\r\n          Emmett whirls -- sees the HOVERBIKES -- JUMPS onto one, twisting\r\n           desperately at the controls --- IiON-DO , ï¿½'T THIS TURNS,__\r\n          WO ?!! Another Alien SCUTTLES in FAST -- Emmett's scrambling\r\n          boots slide into the foot supports, which automatically WHIR\r\n          CLOSED as the bike THROTTLES FORWARD... DECAPITATING THE ALIEN!\r\n          The bike SPINS UNCONTROLLABLY, plasma thrusters SCORCHING WALLS\r\n          and setting two more aliens ABLAZE! The speeder KAMIKAZE\r\n          BOUNCES out of the cavern at 90 MPH, Emmett screaming!\r\n          The Slaver SCREECHES FURIOUSLY as the remaining creatures LEAP\r\n          back on their speeders and GIVE CHASE!\r\n\r\n<b>          EXT. GANG ENCAMPMENT - DAY\r\n</b>\r\n\r\n<b>                         A TARANTULA\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          61.\r\n</b>          Climbing onto an old desert stump -- BLAM! It's SHOT OFF by a\r\n          couple DRUNK OUTLAWS, swigging booze from STOLEN WHISKEY CRATES\r\n          piled on a WAGON. We're in an OUTLAW CAMP: roughly 40 fast guns\r\n          and saddle tramps. Tents. Horses. Ample weapons. And right\r\n          now, most of them are GEARING UP to ride out for some reason...\r\n          One of them, CREEK JOHNSON, with a chewed up face like swiss\r\n          cheese, slides a RIFLE into his saddle and shouts to the drunks:\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          Hey --- ï¿½s 4 Lay off that whiskey and\r\n          saddle up. Flyer's on its way and we\r\n          best damn be sober for it.\r\n\r\n<b>          HUNT (O.S.)\r\n</b>          Creek turns; sees HUNT and BRONC crest the hill with the other\r\n          OUTLAWS from the cliffs. ANGRILY:\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          'Bout time you got back.\r\n          (re: Hunt's bloody nose)\r\n          What the hell happened to you?!?\r\n          Hunt nods over his shoulder --\r\n\r\n<b>                         HUNT\r\n</b>          He did.\r\n          The outlaws part to reveal JAKE, riding in with Ella and the\r\n          rest of our people. Creek's eyes NARROW, NOT happy to see him:\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          well, shit.\r\n          It gets very, VERY QUIET. Our people tread warily, knowing\r\n          whatever reaction Jake's eliciting, it AIN'T GOOD. He runs the\r\n          gaunt of ACCUSING GLARES. Smart enough to know that CREEK is\r\n          the man in charge. Dismounts:\r\n\r\n<b>                         JAKE\r\n</b>          You don't look happy to see me, Creek.\r\n          Creek eyes him. TOUGH. Clearly, HISTORY here:\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          We're fixin' to rob us a train in about\r\n          twenty minutes and you come ridin' in\r\n          like nothin' ever happened?\r\n\r\n<b>                         (FUCK YOU)\r\n</b>          No. Lonergan. I ain't happy to see you.\r\n          ON JAKE. How to navigate bad blood that he doesn't REMEMBER?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          62.\r\n</b>\r\n<b>                         JAKE\r\n</b>          Well I'm sure you'll get over it.\r\n          Then, pretty much DISMISSING Creek, Jake turns, addresses the\r\n          rest of the men. If he's their boss? Hï¿½ _gQDn&amp;. CT LIR .ï¿½Tâ\u0080¢\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Nice to see you, Boys, but we're not\r\n          going after a train -- We're going after\r\n          something else.\r\n          The men seem... . CONFUSED. Not sure what the hell is GOING ON.\r\n\r\n<b>                         BRONC\r\n</b>          But Jake... you-- you said you didn't\r\n          wanna be in charge no more.\r\n          And this is a REVELATION. Jake glances at ELLA -- has to keep\r\n          IMPROVISING to hold his ground:\r\n\r\n<b>                         JAKE\r\n</b>          Well, I-- changed my mind. So saddle the\r\n          hell up.\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          They're not going anywhere with you.\r\n          Creek's heard enough. Strides forward, a direct CHALLENGE:\r\n\r\n<b>          CREEK JOHNSON (CONT'D)\r\n</b>          You got some balls on you -- walkin'\r\n          outta here a week ago sayin' what you\r\n          said and doin' what you did and then\r\n          ridin' back in here and givin orders.\r\n          Just who the hell do you think you are?\r\n          The IRONY of the question isn't lost on Jake, as Creek walks\r\n          right up to Ella. CLOSE. Violates her space: studies her with\r\n          a mixture of curiosity and CONTEMPT.\r\n\r\n<b>          CREEK JOHNSON (CONT'D)\r\n</b>          So. Are you her?\r\n\r\n<b>                         ELLA\r\n</b>          Am I who?\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          The whore Jake quit this gang for.\r\n          OH. Another piece of the puzzle falls into place -- Jake's eyes\r\n          SNAP to Ella as they both REALIZE... the men think she's\r\n          \" e.\" Jake does his best to stay cool, meets Creek's stare:\r\n\r\n<b>                         JAKE\r\n</b>          Watch your mouth, Creek.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          63.\r\n</b>\r\n<b>                         CREEK JOHNSON\r\n</b>          Or what? These boys are with = now.\r\n          jID in charge. You may be fast, but you\r\n          are goddamned outgunned.\r\n          ON JAKE. OUR HEROES. Shit. Jake turns to the men --\r\n\r\n<b>                         JAKE\r\n</b>          That a fact, Boys?\r\n          But Creek doesn't wait for them to respond:\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          Put your guns on the whore. He so much\r\n          as twitches, blow her brains out her ear.\r\n          AT ONCE, 10 GUNS ARE LEVELED AT ELLA'S HEAD. No doubt as to who\r\n           the men are LOYAL to. But Jake locks into Creek, UNFLINCHING:\r\n\r\n<b>                         JAKE\r\n</b>          Call her a whore again, that'll be the\r\n          last word you ever say.\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          You ain't in no position to make threats,\r\n          asshole. Hunt: take his gun.\r\n          Hunt reluctantly scrambles over to Jake, oh-so-carefully pulls\r\n          the PISTOL from Jake's holster:\r\n\r\n<b>                         HUNT\r\n</b>          Sorry, Boss... nothin' personal.\r\n          Creek now turns to BULL MCCADE, roughly the size of a BARN.\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          Put him down, Bull.\r\n          And Jake barely has time to react as Bull lets fly with a\r\n          JAWBREAKING HAYMAKER that about knocks Jake out of his BOOTSI\r\n          Dolarhyde and Colorado WINCE as Jake hits the dirt with a THUD --\r\n          Creek striding over, cock of the walk, LEANS over him:\r\n\r\n<b>          CREEK JOHNSON (CONT'D)\r\n</b>          Where the hell's our gold. Jake?\r\n          \"Gold?\" Jake SPITS BLOOD, defiant:\r\n\r\n<b>                         JAKE\r\n</b>          Don't remember.\r\n          Creek NODS to Bull: SMASH! Another devastating BLOW. ON ELLA --\r\n          at GUNPOINT. Wishing she could intervene. DOC too.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          64.\r\n</b>\r\n<b>                         CREEK JOHNSON\r\n</b>          Well I _dg remember you tellin' us you was\r\n          leavin' us high and dry because you were\r\n          in love... You just left out the part\r\n          about taking half our goddamned haul from\r\n          the Yuma Bank. So I'm gonna ask you one\r\n          last time -- Where. Is. Our. Gold?\r\n          -- WHAM! Bull PUNCHES Jake so hard he FLIES OFF HIS FEET:\r\n\r\n<b>          CREEK JOHNSON (CONT'D)\r\n</b>          Man can't run away from who he ja,\r\n          Lonergan... you really think you could go\r\n          straight just cause you were fool enough\r\n          to fall in love with some woman?\r\n          WHAM! Bull PUNCHES Jake back into oblivion, and on the HIT we:\r\n          MEMORY FLASECUTi PEACEFUL SILENCE -- two FACES staring at each\r\n          other across a pillow -- Jake and ALICE, naked, in a WHOREHOUSE\r\n\r\n<b>                         BEDROOM SOMEWHERE:\r\n</b>\r\n<b>                         ALICE\r\n</b>          You sure you wanna give it all up?\r\n          ON JAKE. Clearly TORN. But just as clearly, in LOVE.\r\n\r\n<b>                         JAKE\r\n</b>          What about you? Once we're gone, you\r\n          ain't ever comin' back.\r\n          She touches his face so gently. And whispers:\r\n\r\n<b>                         ALICE\r\n</b>          You're the first person ever believed I\r\n          was better than this place... so I gotta\r\n          believe in y=.\r\n          (and she KISSES him)\r\n          You're a good man, Jake Lonergan.\r\n          PRESENT: as the words \"Good Man\" ECHO back to Jake. Stir=g_\r\n          ]1â\u0080\u009e1n as Creek GRABS Jake's hair and YANKS BACK, rears up a fist:\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>          You figgered you could steal from us?\r\n          All that gold was yours to take co you\r\n          could go off and start a new life?\r\n          Creek's next PUNCH takes us to another:\r\n          TORY FLASECUTI REPLAY -- Jake and Alice in the cabin -- he\r\n          drops the SADDLEBAG -- it CLINKS to the floor. She's worried:\r\n\r\n<b>                         ALICE\r\n</b>          Your boys'ii come after you.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          65.\r\n</b>\r\n<b>                         JAKE\r\n</b>          (dark, determined)\r\n          Let 'em come.\r\n          BACK TO PRESENT -- as now Jake UNDERSTANDS the context of this\r\n          moment -- what they were saying to each other -- He looks up at\r\n          Creek, BEATEN AND BUSTED UP:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Okay... okay, I remember now...\r\n          (\"fuck you\" grin)\r\n          Demons stole your gold, Creek. But when\r\n          you get to hell, you can ask for it back.\r\n\r\n<b>                         CREEK JOHNSON\r\n</b>\r\n<b>                         (TSK'S)\r\n</b>          Okay then. That's the way you wanna do\r\n          this...\r\n\r\n<b>                         (TURNS)\r\n</b>          Kill the whore.\r\n          ON THE GANG. As they all cock their guns -- Aimed at Ella --\r\n          This is IT --\r\n          JAKE -- slowly lifts his head, suddenly RAGE-FILLED as --\r\n\r\n<b>          HIS WRIST BRACELET ACTIVATES! BLAMMMM11! A SEARING PULSE BLAST\r\n</b>\r\n<b>          FIRES, VAPORIZING CREEK JUST BEFORE HE PULLS THE TRIGGER!\r\n</b>          EVERYONE'S FACES. Holy shit. Jake spits on the around between\r\n          the SMOKING BOOTS that formerly belonged to Creek:\r\n\r\n<b>                         JAKE\r\n</b>          Told you not to call her that.\r\n          ON JAKE. Pure KILLER. As he turns his weapon on the rest of\r\n          the (awestruck) gang -- through BLOODY TEETH:\r\n\r\n<b>                          JAKE (CONT'D)\r\n</b>          You're all riding with me. Any one of\r\n          you decides otherwise? So help me God,\r\n          I'll kill you where you stand.\r\n\r\n<b>                         (AND THEN)\r\n</b>          I'm j2acj&amp; and I'M in goddamne.d\r\n          The gang quickly flips: \"Absolutely, Jake/ Whatever you say,\r\n          Boss...\" Jake turns to the speechless Bull McCade and KICKS HIM\r\n          IN THE BALLS as hard as he can, doubling him over.\r\n          Now he meets eyes with ELLA. She can't help SMIRKING, grateful.\r\n          DOC. Is the only one NOT looking at Jake. His attention drawn\r\n          toward a SOUND coming from the distant DUNES --\r\n\r\n<b>                         DOC\r\n</b>          Dios mio.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          66.\r\n</b>\r\n<b>          A SPEEDER IS ROARING TOWARD THEM BOUNCING OVER DESERT:\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          (squints, realizing...)\r\n          Jesus... it's the kid.\r\n          As Emmett ROARS IN, the shocked outlaws SCATTER:\r\n\r\n<b>                         EMMETT\r\n</b>\r\n<b>          THEY'RE COMING!!!! THEY'RE COMING!!!\r\n</b>          The kid TUMBLES off the speeder as it PLOWS RIGHT THROUGH CAMP,\r\n          kicking up DIRT and UPENDING SUPPLIES. As Emmett scrambles up --\r\n\r\n<b>          VROOOM! FOUR MORE SPEEDERS ROAR OVER THE CREST IN PURSUIT OF\r\n</b>\r\n<b>          EMMETT! THE ALIENS FROM THE CAVE!\r\n</b>\r\n<b>                         JAKE\r\n</b>\r\n<b>          EVERYBODY MOOOOVE!!!\r\n</b>\r\n<b>          STEEL COLLARS START FLYING, ATTACHED TO ROPING CABLES -- BEFORE\r\n</b>\r\n<b>          THE GANG KNOWS WHAT'S HAPPENING, THEY'RE BEING GRABBED AND\r\n</b>\r\n<b>          DRAGGED AWAY!\r\n</b>          Those who have their wits about them FIRE BACK, trying to hit\r\n          the flying machines. CROSSFIRE. CONFUSION.\r\n\r\n<b>                         THE SLAVER\r\n</b>          His speeder GROWLS to a halt. Dismounting like a killer biker.\r\n          ON JAKE. As he SEES that horrible alien face across the crowd:\r\n          QUICK BIT: Alice dying in his arms. And this same damn THING is\r\n          the one responsible for it. And we're:\r\n          BACK TO PRESENT. Jake's eyes LOCKED on the SLAVER as he says:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          You.\r\n\r\n<b>          BUT THE ACTION COMES ROARING BACK AS:\r\n</b>          Outlaws start FIRING at the Slaver, who REACTS in mere\r\n          annoyance. Flicks open a POUCH on his bandolier for what look\r\n          like THUMB TACKS -- throws them and they tan out, PIERCING THE\r\n          NECKS of the outlaws, activating \"Blue\":\r\n          !NTLY E ZE. TUR an\r\n          The Slaver draws a ROL) that TELESCOPES into a SIX FOOT LANCE --\r\n          KA-TCHING! BARBED ENDS snap out and the alien runs on two\r\n          limbs, then FOUR -- LEOPARD-LIKE for speed -- rises back up and\r\n          SMASH! SHATTERS each man into a million Pieces. Now he uses\r\n          the bladed-ends to SKEWER five more outlaws and turns --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          67.\r\n</b>\r\n<b>          MEETING JAKE'S EYES IN MUTUAL RECOGNITION -- SCREECHES:\r\n</b>\r\n<b>                         JAKE (CONT'D)\r\n</b>\r\n<b>                         (TO DOLARHYDE)\r\n</b>          Find cover!!!\r\n          Jake FIRES his pulse blaster, providing cover as DOLAR, DOC,\r\n          EMMETT, and ELLA rush to hide behind the WAGON. The Aliens FIRE\r\n          BACK as LASER CROSSFIRE shreds the camp -- EXPLOSIONS and CHAOS:\r\n          THREE OUTLAWS scramble to form a GATLING CREW. It SPINS to\r\n          life, MOWING DOWN tents as they try to hit the aliens --\r\n\r\n<b>                         ANOTHER ALIEN\r\n</b>          Hurls a boomerang-like \"SMART WEAPON.\" It circles past the\r\n          GATLING COWBOYS, BACK into the alien's hand as:\r\n\r\n<b>          THE TOP HALVES OFTHE_COWBOYS SLIDE OFF, SEVERED AT THE WAIST,'.\r\n</b>          An EXPLOSION blows one of whiskey crates open on the wagon:\r\n\r\n<b>                         EMMETT\r\n</b>\r\n<b>          USE THE WHISKEY! IT BURNS EM!\r\n</b>\r\n<b>                         ELLA\r\n</b>\r\n<b>          -- WHAT?!\r\n</b>\r\n<b>                         EMMETT\r\n</b>\r\n<b>          LIKE ACID ON THEIR SKIN!!!\r\n</b>          Ella REACTS -- WHAT? As an alien SKITTERS toward her, she grabs\r\n          a bottle and HURLS IT -- it EXPLODES all over the creature! A\r\n          HORRIBLE SCREECH as its skin smokes, thrashing epileptically --\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>                         (REVELATION)\r\n</b>          Oh my GOD --\r\n\r\n<b>                         DOLARHYDE\r\n</b>\r\n<b>          LET'S GO!!!\r\n</b>          Our people ESCAPE for the horses. Doc climbs up on the WAGON\r\n          buckboard and pulls EMMETT in the seat beside him --\r\n          As ELLA leaps on a horse --\r\n\r\n<b>                         THE SLAVER\r\n</b>          Climbs back on his speeder and GUNS FOR HER, firing a STEEL\r\n          COLLAR -- Jake turns -- SEES THIS. Starts RUNNING MADLY:\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>          ELLA!!\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          68.\r\n</b>          Too late: KA-CHANK! The collar CLAMPS her neck, RIPPING ELLA\r\n          OFF HER HORSE! The CABLE snaps back and attaches to the\r\n          hovercraft as it ZIPS by, DRAGGING ELLA BACKWARD LIKE A WATER\r\n\r\n<b>          SKIER BEHIND A SPEEDBOAT!\r\n</b>          ON JAKE -- FURY -- HIS BRACELET ACTIVATES! And there's a LOGIC\r\n          here we'll come to realize, as he KICKS his horse into a gallop:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>\r\n<b>          HYAA!\r\n</b>\r\n<b>          EXT. DESERT - CONTINUOUS\r\n</b>\r\n          ELLA'S DRAGGED BEHIND THE SPEEDER. Hands GRASPING at the\r\n          magnetic collar as it HALF-CHOKES HER, yet keeps her upper body\r\n          SUSPENDED just oft the ground while her heels BOUNCE HARSHLY --\r\n\r\n<b>          JAKE ON THE HORSE\r\n</b>          Riding hard -- aims his BLASTER, trying to get a TARGET on the\r\n          CABLE linking Ella's collar to the speeder -- fires -- MISSES!\r\n          The Slaver TILTS VERTICAL to fly through a narrow CANYON\r\n          ENTRANCE as Ella's fingers reach wildly for THE BOWIE KNIFE on\r\n          her belt. She starts CUTTING THE CABLE, trying to FREE HERSELF:\r\n          WHOOSH! The speeder BLASTS out the other side of the canyon,\r\n          Jake still in pursuit but suddenly...\r\n\r\n<b>          THE UNION PACIFIC LOCOMOTIVE IS CURVING AROUND A CORNER, RACING\r\n</b>          RIGHT FOR THEM! This is the train Jake's gang was gonna rob!\r\n\r\n<b>          INT. UNION PACIFIC EXPRESS CAR - CONTINUOUS\r\n</b>\r\n          Two PINKERTONS sit by a SAFE. LOOK UP at an unidentified ROAR --\r\n\r\n<b>                         PINKERTON #1\r\n</b>          You hear.that?\r\n\r\n<b>                         PINKERTON #2\r\n</b>          How many times I gotta tell you, Leonard.\r\n          No one'd be stupid enough to rob this tr--\r\n\r\n<b>          SWWWWWM. IN THE WINDOW BEHIND THEM... THE SPEEDER BLASTS BY.\r\n</b>\r\n<b>          GOING AGAINST THE TRAIN, ELLA BOUNCING BEHIND IT.\r\n</b>          When the Pinkertons SNAP around, Ella's GONE... but now they SEE\r\n          JAKE -- ON HORSEBACK -- FLASHING PAST in pursuit!\r\n\r\n<b>                          PINKERTON #2 (CONT'D)\r\n</b>          1 stand corrected.\r\n          They DRAW GUNS, running to see what's happening and --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          69.\r\n</b>\r\n<b>          EXT. UNION PACIFIC TRAIN - KID AIR AT 80 MPH - CONTINUOUS\r\n</b>\r\n          As the speeder SKIMS alongside the train, ELLA keeps struggling\r\n          painfully to CUT HER COLLAR CABLE. Jake FIRES again, MISSES the\r\n          cable but DETONATES THE SIDE OF A TRAIN CAR:\r\n\r\n<b>          INT. UNION PACIFIC - TRAIN CAR - CONTINUOUS\r\n</b>\r\n          The wall EXPLODES INWARD on the Pinkertons -- hurt, but ALIVE --\r\n\r\n<b>          EXT. UNION PACIFIC TRAIN - CONTINUOUS\r\n</b>\r\n          The speeder's SHAKEN. The Slaver GROWLS as he fights for\r\n          balance. Reaches the TRAIN'S END, skims past the caboose and --\r\n\r\n<b>          DAMNIT. THE SLAVER ARCS BACK AROUND IN A WIDE U-TURN, SLOTTING\r\n</b>\r\n<b>          IN FOR COVER BEHIND THE OTHER SIDE OF THE TMINâ\u0080¢,=_`T1.2AVF.LLING,.J\r\n</b>\r\n<b>          THE SAME DIRECTION NOW!\r\n</b>\r\n<b>          ELLA'S FLUNG WILDLY BY THE HAIRPIN TURN! SHE DROPS THE KNIFE,\r\n</b>\r\n<b>          IT CLATTERS AWAY! HER ONLY MEANS OF ESCAPE GONE!\r\n</b>\r\n<b>                         JAKE'S POV:\r\n</b>          Through a slot between boxcars, the speeder BLURS in the\r\n          opposite direction. Up ahead comes the CABOOSE. No more TRAIN:\r\n          Thinking FAST, Jake LEAPS off his horse -- CATCHES A LADDER RUNG\r\n          ON THE CABOOSE'. Teeth gritted, starts to CLIMB up onto:\r\n\r\n<b>          EXT. TOP OF UNION PACIFIC TRAIN CAR - CONTINUOUS\r\n</b>\r\n          Jake JUMPS from car to car -- over LOGS in a TENDER CAR --\r\n          BLAM BLAM!!! The PINKERTONS are climbing to the roof, WEAPONS\r\n          FIRING -- Jake loses footing, ROLLING off the side --\r\n\r\n<b>          EXT. SIDE OF TRAIN - CONTINUOUS\r\n</b>\r\n          -- but CATCHES another ladder rung and he DANGLES, looks DOWN:\r\n\r\n<b>          ELLA IS RIGHT UNDER HIM, DRAGGING BEHIND THE SPEEDER! HE\r\n</b>\r\n<b>          REACHES OUT --\r\n</b>\r\n<b>                         JAKE\r\n</b>\r\n<b>          TAKE MY HAND!\r\n</b>          She GRUNTS WITH EXERTION as their fingers GRAZE each other and\r\n          The Slaver SNAPS AROUND. Hurls a SMART DISC at Jake -- no\r\n          choice, he LETS GO of the LADDER -- HITS the ground PAINFULLY\r\n\r\n<b>          THE PINKERTONS RUSH TO THE ROOF EDGE\r\n</b>          -- SXLSKLISH! The disc VIVISECTS THEM THEN CIRCLES BACK AROUND,\r\n          cutting the IRON STRAPS that secure the logs in the tender car --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          70.\r\n</b>\r\n<b>          THE LOGS START ROLLING OFF THE TOP. CRASHING DOWN ON THE\r\n</b>          SPEEDER. It SPIRALS end-over-end, CRASHING into the desert!\r\n          ON JAKE. He picks himself up, WINCING. Sees the SMOKING WRECK\r\n          in the distance. Starts to limp, then RUN --\r\n\r\n<b>          EXT. CRASHED SPEEDER - CONTINUOUS\r\n</b>\r\n          Jake APPEARS through the smoke. No sign of The Slaver. Then --\r\n          FALLING ROCKS turns his look upward. Though WOUNDED, the alien\r\n          is SCALING a rock-face. Turns... a look that says \"Next time.\"\r\n          Then in a BLUR, it's GONE. Jake's blaster REVERTS into a\r\n          bracelet. When the smoke clears:\r\n          ELLA is revealed on the ground, thrown from the speeder. Jake\r\n          REACTS -- EQ -- takes her in his arms.\r\n          She desperately tries to SAY SOMETHING... but goes LIMP.\r\n\r\n<b>                         JAKE\r\n</b>          Ella...?\r\n          Her head just falls back. Yeah. Hard to swallow, but it's\r\n          true. ELLA'S DEAD. And if this moment ECHOES Jake holding his\r\n          dead wife, well that's just fine. He stares beseechingly as...\r\n          HOOFBEATS. The rest of our people gallop in: Colorado,\r\n          Dolarhyde, Doc and Emmett in the wagon:\r\n\r\n<b>                         EMMETT\r\n</b>          Aw no... is she --?\r\n          Jake looks up -- unhinged --\r\n\r\n<b>                          NAT COLORADO\r\n</b>           We need to get out of here NOT.\r\n\r\n<b>          JAKE NAT COLORADO\r\n</b>          Not gonna leave her here -- L4Re.Xam --\r\n          -- I'M NOT LEAVIN' HER! -- This is Apache territory!\r\n          They catch us, they'll kill u--\r\n          THHHHHHHUNKI The air SCREAMS as an ARROW pierces the ground\r\n          inches from Jake's hand! Suddenly THIRTY MORE -- ALL AROUND\r\n          THEM -- forming an instant circle perimeter as --\r\n          APACHE WARRIORS FLASH DOWNHILL. Dolar dismounts, swings Emmett\r\n          to the ground --\r\n\r\n<b>          NAT COLORADO (CONT'D)\r\n</b>          Nobody move.\r\n          Jake and Emmett freeze. The Apaches are ALL AROUND THEM.\r\n          Fierce. BOWS and TOMAHAWKS drawn -- OFF THIS:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          71.\r\n</b>\r\n<b>          EXT. ARIZONA MOUNTAINS - TWILIGHT\r\n</b>\r\n          The sun DIPS behind the mountains... NIGHT FALLS...\r\n\r\n<b>          INT. TEEPEE - NIGHT\r\n</b>\r\n          CLOSE ON ELLA'S DEAD FACE. Still. Beautiful. FIND JAKE, on\r\n          his knees beside her, hands bound in front of him. An INDIAN\r\n          WOMAN finishes wrapping the body in a shroud and LEAVES.\r\n          Jake is alone. Overwhelmed. Raw. Something rising in him.\r\n          Something he COULDN'T FACE... until this moment:.\r\n\r\n<b>                         JAKE\r\n</b>          I remember now.\r\n\r\n<b>                         (THEN; SOFTLY)\r\n</b>          I-- I did love her.\r\n          And just saying it, saying those words, brings a swell of\r\n          EMOTION to the surface... but he FIGHTS it. A losing battle, as\r\n          his eyes WELL:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          She was like you. Seemed to think I was\r\n          a good man.\r\n          (finally, voice almost\r\n\r\n<b>                         CRACKS)\r\n</b>          But I couldn't save either of you.\r\n          A beat... his bound hands gently touch her face...\r\n\r\n<b>          JAKE (CONT' D )\r\n</b>          Where's the good in that?\r\n          His eyes CLOSE. Too much.\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          I'm sorry, Ella.\r\n          And that sits... then suddenly -- JARRINGLY -- THREE MORE BRAVES\r\n          roughly enter, pull Jake up, FORCE HIM out:\r\n\r\n<b>          EXT. APACHE ENCAMPMENT - NIGHT\r\n</b>\r\n          BAN! Our people are THROWN TO THEIR KNEES in a large CIRCLE OF\r\n          APACHES. GUARDED by warriors with tomahawks and -- WHOOSH! A\r\n          PYRE is ignited and if we ever had any doubt about Ella being\r\n          dead, the BRAVES carry her roughly past --\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>          HEY! GODDAMMIT DON'T YOU TOUCH--\r\n</b>          -- he's YANKED BACK and held in place as... ELLAIg BODY IS\r\n          THROWN RIGHT INTO THE FLAMES. Jake helplessly watches her BURN.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          72.\r\n</b>\r\n<b>                         EMMETT\r\n</b>          Wasn't your fault, Mr. Lonergan.\r\n          Those things... were lookin' for her.\r\n          Had a picture and everything.\r\n          That breaks the spell. Jake looks over --\r\n\r\n<b>                         JAKE\r\n</b>          What d'you mean... 'a picture'?\r\n\r\n<b>                         EMMETT\r\n</b>          Floatin', like that arrow thing we found\r\n          in its eye.\r\n          Before Jake can makes sense of this, a teepee smoke flap OPENS\r\n          and out steps the tribe's SACHEM. This is GREY WOLF -- dark,\r\n          wrinkled face enhanced by TATTOOS. He takes one look at his\r\n          prisoners and SPEAKS A FEW WORDS OF APACHE.\r\n\r\n<b>                         DOC\r\n</b>          What'd he say?\r\n\r\n<b>                         COLORADO\r\n</b>          \"Kill them. And make it quick.\"\r\n          Doc is amply freaked. Turns to Jake as FIVE OF THE BRAVES move\r\n          for them, MENACING --\r\n\r\n<b>                         DOC\r\n</b>          Now'd be a good time to use your gun\r\n          bracelet, my friend.\r\n          But Jake is VACANT. BROKEN. All the fight seems GONE from him.\r\n          His bracelet DOESN'T MOVE.\r\n          Dolarhyde's grabbed first... PULLED FORWARD by one of the\r\n          braves, raising his TOMAHAWK -- they're really gonna KILL HIM --\r\n\r\n<b>                         DOLARRYDE\r\n</b>\r\n<b>                         (SUBTITLED)\r\n</b>\r\n<b>          SOP. DON'T DO THIS.\r\n</b>          SURPRISED looks from just about everyone in the camp (besides\r\n          Colorado) as we realize Dolarhyde just spoke APA\r\n          ON GREY WOLF -- INTRIGUED as he approaches Dolarhyde:\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          How is it that you speak our language?\r\n\r\n<b>                         UOLARHYUE (SUBTITLE)\r\n</b>          Because I'm a damn genius.\r\n          Grey Wolf's fascinated this man has the audacity to be a WISEASS\r\n          given his circumstances. Turns to the Brave with the tomahawk --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          73.\r\n</b>\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Forget about quick. Make him feel it.\r\n          The Brave NODS, RAISES the Tomahawk again, but Dolar interrupts:\r\n\r\n<b>                         DOLARHYDE (SUBTITLE)\r\n</b>          Two hundred head of cattle!\r\n          Grey Wolf holds up his hand, halting the Brave's death blow --\r\n\r\n<b>          DOLARHYDE (SUBTITLE) (CONT'D)\r\n</b>          I'll have two hundred head of cattle u_a\r\n          here in a day's time if you let me go.\r\n          ON GREY WOLF. Considering this.\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          And how do I know you'll come back?\r\n          Dolarhyde nods to Colorado --\r\n\r\n<b>                         DOLARHYDE (SUBTITLE)\r\n</b>          You can keep my associate here. if I\r\n          don ' t come back, you can kill him.\r\n          Colorado REACTS. He's the only one here who knows what the hell\r\n          these two are saying to each other as Grey Wolf approaches\r\n          Dolar, looks right INTO HIM --\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Why should I believe that you even care\r\n          about this man?\r\n          Dolarhyde's eyes flash EMOTION. Quickly bottled. Then:\r\n\r\n<b>                         DOLARHYDE (SUBTITLE)\r\n</b>          Because he's my son.\r\n           Wow. Didn't see that one coming. Grey Wolf levels Colorado\r\n          with those unyielding eyes --\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Is this true?\r\n          And Colorado answers in ENGLISH, for the benefit of the others:\r\n\r\n<b>                         COLORADO\r\n</b>          Yeah... he's my father.\r\n          REACTIONS. JAKE. EMMETT. DOC. Stunned silence. And so:\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Three hundred head.\r\n          Dolar looks to Colorado, who won't meet his eyes. His FATHER's\r\n          eyes. Turns back to Grey Wolf, HARD --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          74.\r\n</b>\r\n<b>                         DOLARHYDE (SUBTITLE)\r\n</b>          Two fifty.\r\n          HOLD ON GREY WOLF for a beat. Then --\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Cut him loose.\r\n          The Brave does exactly that. Dolar's FREE to go...\r\n\r\n<b>                         EMMETT\r\n</b>          Hey! What about =?!?\r\n          ON DOLAR. A FLASH of regret. But it's gone fast.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          What about you, kid?\r\n          And he just walks out of the camp, leaving his son behind...\r\n          GONE. And now, it's back to business --\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Kill all of them except the half-breed.\r\n          Our people are GRABBED. Jake's yanked forward, PINNED DOWN -- a\r\n          Brave raises a HATCHET to kill Jake, who glares back with\r\n          lunatic eyes. Ready to die. Almost wanting it:\r\n\r\n<b>                         JAKE\r\n</b>          What're you waiting for, asshole? DO IT.\r\n          And as Jake's about to MEET HIS DEATH:\r\n\r\n<b>          FWOOM! THE PYRE SUDDENLY BILLOWS, TURNING FROM ORANGE TO GREEN\r\n</b>\r\n<b>          TO WHITE -- EVERYONE BACKS AWAY AS --\r\n</b>\r\n<b>          ELLA EMERGES FROM THE PYRE. WRAPPED IN A CAUL OF FIRE AND LIGHTI\r\n</b>          Except she isn't exactly Ella. She's a HUMANOID, incredibly\r\n          close to us in physical appearance, her features acutely\r\n          feminine, yet... ALJM.\r\n          PANDEMONIUM. The Apache kneel in prostration, DROPPING weapons\r\n          as flames DISSIPATE off Ella's backlit form. Her skin RETURNS\r\n          to human flesh-tone. Hair too. When she finally STOPS, she\r\n          looks like the ELLA we've come to know and love. STANDS there:\r\n\r\n<b>                         ELLA\r\n</b>          . what... happened?\r\n          ON JAKE. Holy. SHIT. Everyone else equally STUNNED.\r\n\r\n<b>                         EMMETT\r\n</b>          You... died.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          75.\r\n</b>          Ella looks around. Fifty dumbstruck faces staring at her.\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>                         (QUIETLY; CAUGHT)\r\n</b>          . oh.\r\n          OFF ELLA, who's got a helluva lot to explain --\r\n\r\n<b>          INT. TEEPEE - NIGHT\r\n</b>\r\n          A deerskin shirt slips down over Ella's naked body.' A dark\r\n          breechcloth is tied. She TURNS to us.: beautiful as ever.\r\n\r\n<b>          EXT. TEEPEE - NIGHT\r\n</b>\r\n          Ella emerges to find... JAKE. Standing outside.the teepee.\r\n          HARD. And for a long moment, nothing is said. Until she takes\r\n          a step TOWARD him:\r\n\r\n<b>                         ELLA\r\n</b>          If I'd told you on the boat, you never\r\n          would'a trusted me --\r\n          -- but he takes a step BACK. If he's relieved she's alive, he\r\n          isn't showing it:\r\n\r\n<b>                         JAKE\r\n</b>          Did you hear what I said?\r\n\r\n<b>                         ELLA\r\n</b>          .. What?\r\n\r\n<b>                         JAKE\r\n</b>          When you were playin' possum. Did you\r\n          hear what I mid?\r\n          He's angry. Yes, even embarrassed. And because of it,\r\n          something has SHUT DOWN in him again. That killer look is back.\r\n\r\n<b>                         ELLA\r\n</b>          No. I was mendin'.\r\n\r\n<b>                         (BEAT)\r\n</b>          It's like sleep.\r\n          His eyes narrow, trying to understand:\r\n\r\n<b>                         JAKE\r\n</b>          How's it you look like one of us?\r\n\r\n<b>                         ELLA\r\n</b>          I can look like whatever I want to.\r\n\r\n<b>                         JAKE\r\n</b>          So you can't die?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          76.\r\n</b>\r\n<b>                         ELLA\r\n</b>          Sure I can. If my heart stops beating...\r\n          just like you.\r\n\r\n<b>          .JAKE\r\n</b>          You're nothin' like me, Ella. You're\r\n          one'a them.\r\n          we can see that hurt her. But she deserved it, too. So\r\n          desperately wants to reach him...\r\n\r\n<b>                         ELLA\r\n</b>          I'm not, Jake. I'm from a different\r\n          place.\r\n          He isn't sure what that means. Can he even trust her? Either\r\n          way, she has ANSWER;. Darkly:\r\n\r\n<b>                         JAKE\r\n</b>          The one that took you.\r\n\r\n<b>                         (BEAT)\r\n</b>          It killed her.\r\n          That LANDS on her. Knowing and painful.\r\n\r\n<b>                         ELLA\r\n</b>          They call him The Slaver. He's the one,\r\n          gave me the scars. Broke me. And made\r\n          me watch... while he killed my family\r\n          too.\r\n          Even with his guard up... Jake can't help but be STRUCK. As the\r\n          sound of HOWLING WIND takes us to:\r\n\r\n<b>          EXT. BOX CANYON - RIM - NIGHT\r\n</b>\r\n          A SANDSTORM... through which a GHOSTLY FIGURE materializes...\r\n          THE SLAVER. Moving with angry purpose toward the CANYON BLUFF.\r\n          As he looks down into it, we hear the SOUNDS of MACHINERY below.\r\n          But we DO__QT.YET_ REVEAL what it_ is__ he sees.\r\n          He stalks down, LEAVING FRAME -- as we HOLD on the field of\r\n\r\n<b>          TWINKLING STARS ---\r\n</b>\r\n<b>          ELLA (V.0.)\r\n</b>          For every drop of light in the sky,\r\n          there's another world. Filled with\r\n          life...\r\n\r\n<b>          EXT. APACHE CAMP - MINUTES LATER - NIGHT\r\n</b>\r\n          Ella's in front of the campfire, surrounded by EVERYONE\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          77.\r\n</b>\r\n<b>                         ELLA\r\n</b>          Our race was first to map the stars...\r\n          that's why they came for us. Took our\r\n          planet, piece by piece. Slaughtered\r\n          anyone who fought hack. Ones who\r\n          survived were turned into slaves.\r\n          Trackers.\r\n          She says this meeting the eyes of GREY WOLF. There's immediate\r\n          SIMPATICO here: a story the Indians could be telling.\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          They brought me aboard one of their scout\r\n          ships -- a ship with only one purpose: to\r\n          find other planets like mine. Planets\r\n          they can take... people they can enslave.\r\n          As the terrible gravity of all this HITS everyone, JAKE is first\r\n          to understand...\r\n\r\n<b>                         JAKE\r\n</b>          X lead 'em here.\r\n          Ella swallows. Wracked with GUILT.\r\n\r\n<b>                         EMMETT\r\n</b>          Well damn, lady, thanks a 1.\r\n\r\n<b>                         ELLA\r\n</b>          I never wanted this.\r\n          (an EMOTIONAL beat)\r\n          But they got... ways. Of making you do\r\n          things.\r\n          Her eyes are HAUNTED with memory. The inference is some kind of\r\n          TORTURE. She pushes it away -- staying strong:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          Been tryin' to make it right... tried to\r\n          blow the ship to hell by burnin' up all\r\n          their fuel, then escaped down here.\r\n\r\n<b>                         (BEAT)\r\n</b>          'Cept it didn't work... damn thing\r\n          survived.\r\n\r\n<b>                         JAKE\r\n</b>          Where is it.\r\n          Jake's determined -- he's got his OWN agenda. Ella looks up to\r\n          that OMINOUS CLOUD. Those BLUE LIGHT FLASHES ripple within:\r\n\r\n<b>                         ELLA\r\n</b>          Hiding in that cloud. Way I figure,\r\n          they'll find enough fuel to leave by\r\n          tomorrow, midday. Then they'll bring\r\n          back the others.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          78.\r\n</b>\r\n<b>                         DOC\r\n</b>          \"others\"?\r\n\r\n<b>                         ELLA\r\n</b>          The whole fleet. They'll take what they\r\n          need. Everyone on this planet. Anything\r\n          too weak to survive... they'll toss.\r\n          Like that cow.\r\n          Tomorrow. Midday. Hi noon. This is bad, bad news.\r\n\r\n<b>                         NAT COLORADO\r\n</b>          What'd you mean, they're looking for\r\n          \"fuel\"...?\r\n          And before Ella can answer, Jake already GETS IT:\r\n\r\n<b>                         JAKE\r\n</b>          Gold. That's why they're in a mine.\r\n\r\n<b>                         ELLA\r\n</b>          (NODS, solemn)\r\n          . wherever it is, that's where you\r\n          escaped from -- and it's the only way\r\n          back up to the ship.\r\n\r\n<b>                         (STEPS CLOSER)\r\n</b>          Even with your memory wiped, your\r\n          instincts kicked in --\r\n\r\n<b>                         (HIS BRACELET:)\r\n</b>          That's how it works, Jake, the bracelet\r\n          reads your impulse -- you wanna fight, it\r\n          reacts. Somehow you took it off one of\r\n          'em... don't you remember any of it?\r\n          ON JAKE. Deeply STIRRED. As he looks down at the BRACELET and:\r\n          MEMORY FLASBCUTSI REPLAY POV as we're HELD DOWN in that CAVE\r\n          the TERRIFYING OCULAR PROBE lowers right in front of our eyes\r\n          One of the ALIENS starts to activate the probe -- it begins to\r\n          FLASH STEADILY -- HYPNOTICALLY -- PUvTNG OUR MIND --\r\n          But our arm manages to BREAK FREE -- a BLADE hidden in our\r\n          sleeve -- WE SLASH OFF THE. ALIEN'S HAND -- GRAB THE BRACELET off\r\n          its severed limb -- it COILS around our wrist and ACTIVATES:\r\n          BLAM SLAM! We BLAST the creature to oblivion -- we're FREE!\r\n          JAKE IN PRESENT -- Eyes ALIVE with MEMORY:\r\n\r\n<b>                         JAKE\r\n</b>          I-- I blasted my way out...\r\n          MEMORY FLASHCUTI REPLAY POV as we RUN through the cavern --\r\n          ESCAPE -- a LIGHT at the end of the tunnel -- BLINDING SUN hits\r\n          us as we emerge -- our eyes ADJUST to see:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          79.\r\n</b>          That STRANGE ROCK FORMATION HIGH ABOVE on the edge of a CANYON --\r\n          the STONE TOWER pointing to heaven --\r\n          JAKE IN PRESENT: The sequencing is COMPLETE for him now:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          I remember seeing a tower... made of\r\n          stone... on the rim of a canyon...\r\n          Upon hearing that, Grey Wolf suddenly speaks in animated\r\n          gestures, pointing North. Colorado REACTS:\r\n\r\n<b>                         ELLA\r\n</b>          What? What's he sayin'?!?\r\n          Colorado turns to Jake, a flicker of HOPE:\r\n\r\n<b>                         COLORADO\r\n</b>          That rock you're talkin' about... he-\r\n          knows where it is.\r\n\r\n<b>          INT. UNDERGROUND TUNNELS - NIGHT\r\n</b>\r\n          The Slaver ENTERS the gloom of an UNDERGROUND CAVERN. Two\r\n          ALIENS melt from the dark to greet him with frightening HISSES.\r\n          SENTRIES. We HOLD on the walls as something GLITTERS: GOLD.\r\n\r\n<b>          INT. UNDERGROUND CAVERN - SOMEWHERE\r\n</b>\r\n          CLOSE ON SHERIFF TAGGART'S REFLECTION IN MURKY WATER. As we\r\n          TILT UP to reveal him hanging UPSIDE DOWN. Eyes flutter open.\r\n          He's seen better days. Dazed. Turns his head slightly...\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          You... all right...?\r\n          DRIFTING over to see MARIA. Gravity PULLING her hair downward.\r\n          Groggy. Mostly SCARED:\r\n\r\n<b>                         MARIA\r\n</b>\r\n<b>                         (BRAVE FACE)\r\n</b>          . Fantastic. You?\r\n\r\n<b>          CAMERA SLOWLY TURNS, ROTATING 180 DEGREES, TO REVEAL THEY'RE\r\n</b>          STUCK TO THE CEILING OVER A WATER GROTTO. The whole town of\r\n          Absolution is here... a hundred others from the now-cratered\r\n          town of Winfield's Landing, feet embedded in the ORANGE RESIN.\r\n          Suddenly, PERCY DOLARHYDE sees a TERRIFYING SHADOW spread across\r\n          the wall -- what looks like a HUGE, COILING SNAKE:\r\n\r\n<b>                         PERCY DOLARHYDE\r\n</b>\r\n<b>          H-- HEY!!! THE HELL'S THA--?!\r\n</b>          -- but what comes around the corner is a LONG METAL TENTACLE:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          80.\r\n</b>          A SCANNING MECHANISM on its tip shoots out a blue triangular\r\n          beam -- itemizing specimens -- SELECTING ONE: SHERIFF TAGGART.\r\n          Mechanized TALONS open up -- Taggart SCREAMS as he's PLUCKED\r\n          from the ceiling like an apple from a TREE:\r\n\r\n<b>          DEPUTY CHARLIE WADE\r\n</b>\r\n<b>          KYLE!!!!\r\n</b>          ANOTHER METAL TENTACLE slithers in and GRABS WADE -- swinging\r\n          our men across the cavern where we reveal...\r\n          . the tentacles are attached to a TERRIFYING ALIEN MACHINE.\r\n          Taggart and Wade are PINNED DOWN on what looks like an operating\r\n          table. As they thrash, RESTRAINING CLAMPS enfold their skulls.\r\n          An OCULAR PROBE looms _Q.Xpr. them, This is the image _ e.'_A_beM1_\r\n          seeing! This is what haRpened to him before he escaRe !\r\n          WORKER-BEE ALIENS adjusts the device over their eyes -- INSTANT\r\n          X-RAYS read their retinas -- HYPNOTIC -- as the men grow DOCILE\r\n          and LIMP despite their fight and -- FLASHFLASHTLASHI\r\n          The probe has ERASED THEIR MINDS. Catatonic stares.\r\n          Now the machine arms slip the men into separate TRANSLUCENT\r\n          CAPSULES. METAL BREATHING TUBES are implanted down their\r\n          throats as the capsules begin to fill with a THICK, BLUE LIQUID.\r\n          This is the same blue goo -- a protective gel -- that housed the\r\n          COW in that jettisoned cocoon in the desert.\r\n          More Worker Bees load the cocoons into TRANSPORT SHUTTLECRAFTS.\r\n          We see containment holds filled with BLEATING COWS and REARING\r\n          HORSES... all going through a similar cocooning process.\r\n          All of this is overseen by THE SLAVER, who stalks up a ramp\r\n          behind the cocoons. The craft HUMS to life, undergear\r\n          retracting as it ROARS OFF down the tunnel...\r\n\r\n<b>          EXT. CANYON RIM - DANN\r\n</b>\r\n          Our people ride up a rocky slope with a few Apaches. Grey Wolf\r\n          looks around and SPEAKS, Colorado translates:\r\n\r\n<b>                         NAT COLORADO\r\n</b>          This is Kiowa land, their sister tribe.\r\n          As they near the bluff, Jake sees the STONE TOWER. Dismounts:\r\n\r\n<b>                         JAKE\r\n</b>          That's it.\r\n          As they near the bluff, they hear the growing sound of that\r\n          MACHINERY. Everyone dips low, peering over to see...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          81.\r\n</b>          What looks a whole lot like a CAVALRY FORT in the canyon below,\r\n          amid a network of trenches and underground tunnels. Except this\r\n          fortress is made of some kind of ALIEN ALLOY, glowing impossibly\r\n          bright as its steel surface reflects the rising sun.\r\n          DRILLING MACHINES are chewing deep into the earth, mining for\r\n\r\n<b>          GOLD -- THESE ARE THE SAME DRILLS THAT LANDED IN OUR OPENING.\r\n</b>          Massive receptacles are FILLED with HUGE CHUNKS.\r\n          ALIENS move in and out, working, as if from an ant hive.\r\n\r\n<b>                         DOC\r\n</b>          Holy Jesus. Like a damn fort.\r\n          Grey Wolf looks to his men, GRAVE, CRESTFALLEN as he realizes:\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          The Kiowa... they were taken too.\r\n          Suddenly, the ROOF of the steel structure blossoms open like a\r\n          CHROME LOTUS... and WHOOSH! The SHUTTLE TRANSPORT flies out of\r\n          the canyon, RISING into the dawn sky...\r\n\r\n<b>                         ELLA\r\n</b>          Transports. Way they get people and gold\r\n          back and forth to the ship.\r\n\r\n<b>                         DOC\r\n</b>          Place is crawling with those things.\r\n          We'll never even get close.\r\n          Grey Wolf SPEAKS --\r\n\r\n<b>                         NAT COLORADO\r\n</b>          He says there's a back way in... The Twin\r\n          Rivers run underneath this whole canyon.\r\n          Limestone tunnels up by the falls, couple\r\n          miles East. Lead right down there.\r\n          Jake looks to the SKY. DARK. DETERMINED.\r\n\r\n<b>                         JAKE\r\n</b>          The Slaver... he's up in that big cloud?\r\n          Ella nods, HARD. Off their SHARED DETERMINATION, our SCORE\r\n          rises. A DRUM CADENCE that suggests a MISSION starting to form:\r\n\r\n<b>          EXT. APACHE CAMP - DAY\r\n</b>\r\n          DOC. Skeptical, eyes narrow -- staring at Jake and Ella --\r\n          surrounded by our team and the Apaches back at the APACHE CAMP:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          82.\r\n</b>\r\n<b>                         DOC\r\n</b>          Just so I got this straight... three of\r\n          those things just kicked the shit out of\r\n          your entire gang, took our whole town,\r\n          and now you two're gonna ride right into\r\n          that fort, try to hijack one'a those--\r\n          He pauses on the word --\r\n\r\n<b>                         ELLA\r\n</b>          \"Transports.\"\r\n\r\n<b>                         DOC\r\n</b>          -- ride it up to that space boat --\r\n\r\n<b>                         ELLA\r\n</b>          Spaceshp.\r\n\r\n<b>                         DOC\r\n</b>          Then bring it down here and get everybody\r\n          off alive? That's your big plan?\r\n          Jake and Ella share a LOOK. Simply:\r\n\r\n<b>                         JAKE\r\n</b>          Yup.\r\n\r\n<b>                         DOC\r\n</b>          And just how do you figure on getting in\r\n          there in the first place?\r\n\r\n<b>                         JAKE\r\n</b>          Poke a hornet's nest... they swarm\r\n          at'cha.\r\n\r\n<b>                         ELLA\r\n</b>          You gotta draw 'em out. Buy us a\r\n          distraction.\r\n          A long beat of incredulous, do-you-believe-this-shit STARES:\r\n\r\n<b>                         DOC\r\n</b>          You want us to storm that fort? Against\r\n          those things? With less than fifty men?\r\n          It's suicide.\r\n\r\n<b>                         EMMETT\r\n</b>          It ain't, it's been done! I read at\r\n          school how Ethan Allen and his Green\r\n          Mountain Boys took Fort Ticonderoga, they\r\n          weren't but a small garrison and they\r\n          were outgunned --\r\n\r\n<b>                         ELLA\r\n</b>          We need all of you to make a stand.\r\n          Together. It's the only way.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          83.\r\n</b>\r\n<b>                         NAT COLORADO\r\n</b>          Make a stand with what?\r\n          Jake turns to the WAGON they rode from Jake's gang camp -- the\r\n          WHISKEY CRATES. Sweeps up a bottle:\r\n\r\n<b>                         JAKE\r\n</b>          This.\r\n          An impossible mission. Sure death. Yet for the first time...\r\n          they have an ADVANTAGE. Emmett cuts the moment with a BIG GRIN:\r\n\r\n<b>                         EMMETT\r\n</b>          Hell, yeah. Let's squish some bugs.\r\n          Grey Wolf CHUCKLES, murmurs. Jake looks to Nat for translation:\r\n\r\n<b>                         JAKE\r\n</b>          Somethin' funny?\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Yeah... that you whites finally know what\r\n          it feels like to face extinction. Now\r\n          that we're on the same side, he says we\r\n          can all die together.\r\n\r\n<b>                         (THEN)\r\n</b>          They're with us.\r\n          The LOOK holds between them --\r\n\r\n<b>                         JAKE\r\n</b>          Guess that means you're not waitin' for\r\n          your dad to come back.\r\n          Colorado's face CLOUDS. Years of ANGER and RESENTMENT:\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Been Woodrow Dolarhyde's son my whole\r\n          life... first time he ever copped to it\r\n          was to save his own ass.\r\n          (not without emotion)\r\n          He's not comin' back.\r\n          And as Colorado TURNS away, the PERCUSSION finds another GEAR --\r\n\r\n<b>          MONTAGE -- OUR CLAN PREPARES FOR BATTLE:\r\n</b>          Pieces of CLOTH are RIPPED, stuffed inside the WHISKEY BOTTLES.\r\n\r\n<b>          MOLOTOV COCKTAILS...\r\n</b>          Emmett works with Apaches and their KIDS, roping WOOD together\r\n          to build LADDERS and CATAPULTS...\r\n          WAR PAINT is applied to faces in DARK STREAKS...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          84.\r\n</b>          Jake slips on his coat. Sees Emmett lead a horse to mount up\r\n          with his BOW and ARROW QUIVER:\r\n\r\n<b>                         JAKE\r\n</b>          Not you, Kid.\r\n\r\n<b>                         EMMETT\r\n</b>          Aw, hell, we been through this. Ya can't\r\n          stop me.\r\n          Jake draws his gun, SPINS it in his palm, aims at Emmett's FOOT:\r\n\r\n<b>                         JAKE\r\n</b>          I can shoot you in the foot.\r\n\r\n<b>                         EMMETT\r\n</b>          Bu111i11SHIT.\r\n          Jake SIGHS -- bluff called. Holsters the gun and takes a\r\n          knee... but just when we think this is gonna be a tender moment,\r\n          he GRABS Emmett by the collar, pulls him CLOSE:\r\n\r\n<b>                         JAKE\r\n</b>          You told me your daddy's all you got\r\n          left. Want me to save his ass?\r\n          Then park yours right there on the\r\n          ground, you little shit. Got me?\r\n          Emmett's nailed. ANGRY, but knows he's gotta stay.\r\n\r\n<b>                         EMMETT\r\n</b>          Yeah. I gotcha.\r\n          Jake releases him. Happy moves to Ella but she TSKS:\r\n\r\n<b>                         ELLA\r\n</b>          Stay with the kid, Happy.\r\n          The dog WHINES but complies, moving next to Emmett. Jake climbs\r\n          on his horse. Looks back to the boy -- now he Ia tender:\r\n\r\n<b>                         JAKE\r\n</b>          I'll get your father back. Bastard still\r\n          owes me fifty dollars.\r\n          The hint of a SMIRK... long enough for Emmett to SMIRK BACK.\r\n          Ella, Doc, and Colorado mount Â»p too, along with a 10-MAN APACHE\r\n          WAR PARTY. Jake meets eyes with GREY WOLF:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          You'll be ready?\r\n          Grey Wolf NODS. Some part of the PLAN we have yet to learn.\r\n          And now Jake starts to trot off, Ella beside him. This plays\r\n          just between the two of them:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          85.\r\n</b>\r\n<b>                         ELLA\r\n</b>          That's a nice thing... what you said to\r\n          the boy. I didn't know better, I'd say\r\n          you got yourself a sweet side.\r\n          She smiles. But Jake turns to her -- deadly serious:\r\n\r\n<b>                         JAKE\r\n</b>          There's nothin' sweet about me. I told\r\n          that kid what he needed to hear so he\r\n          wouldn't get in my damn way. All I care\r\n          about is killin' that thing.\r\n          And Ella reacts to the DARKNESS in his voice. Shakes her head:\r\n\r\n<b>                         ELLA\r\n</b>          I don't believe that.\r\n\r\n<b>                         JAKE\r\n</b>          Well believe it. I was playing a part.\r\n          (straight at her)\r\n          Just like you were.\r\n          He CRACKS the reins, riding ahead. HOLD ON ELLA... who finally\r\n          follows as they all ride out and MUSIC SOARS:\r\n\r\n<b>          EXT. DESERT PLAINS - CONTINUOUS\r\n</b>\r\n\r\n<b>          JAKE, ELLA, COLORADO, DOC AND THE APACHE WARRIORS RIDE LIKE HELL\r\n</b>\r\n<b>          TOWARD THEIR FATE, SLAMMING RIGHT INTO LENS -- AND WE MATCH TO:\r\n</b>\r\n<b>          EXT. DOLARHYDE'S RANCH - DAY\r\n</b>\r\n          THUNDERING HOOVES -- but it's DOLARHYDE on his horse. REARS\r\n          near the SERVANTS QUARTERS -- moving FAST toward a small hut:\r\n          A HATCHET is embedded in a wood pile. Dolarhyde YANKS it out.\r\n\r\n<b>          INT. SERVANTS' QUARTERS - DAY\r\n</b>\r\n          The APACHE WOMAN we saw in the drawn-and-quartered scene earlier\r\n          is washing clothes on a basin board. She turns as --\r\n          Dolarhyde ENTERS. A menacing figure with a blade in the\r\n          doorway. She stands, ALERT -- in SUBTITLED APACHE:\r\n\r\n<b>          THE WOMAN (SUBTITLE)\r\n</b>          What are you doing?\r\n          Without response, he levels the axe and SLAMS it down on the\r\n          FLOORBOARDS. Wood chips SPRAY until a GASH is opened. Dolar\r\n          REACHES in... pulling out a CANVAS BAG. A few COINS spill\r\n          out... COLD. He picks them up -- looks at the woman:\r\n\r\n<b>                         DOLARHYDE (SUBTITLE)\r\n</b>          Need it to save Nat.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          86.\r\n</b>          And now her worry becomes FEAR; English now:\r\n\r\n<b>                         THE WOMAN\r\n</b>          Is he okay?\r\n\r\n<b>                         DOLARHYDE\r\n</b>          He's gonna be.\r\n          A storm of mixed emotions in his eyes. That stoic Dolarhyde\r\n          veneer starts to CRACK... just a hint... as the woman MOVES to\r\n          him... and TOUCHES his face.\r\n          And he lets her. WHOA. We realize: this woman is COLORADO'S\r\n          MOTHER. Dolarhyde, for all his wicked bluster, LOVES AN APACHE.\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          I won't let anything happen to him,\r\n          Jenny.\r\n\r\n<b>                         THE WOMAN\r\n</b>\r\n<b>                         (SOFTLY)\r\n</b>          Come back to me.\r\n          With that, he's GONE with the gold. Leaving her full of DREAD.\r\n\r\n<b>          EXT. TWIN RIVER FALLS - CAVERN ENTRANCE - DAY\r\n</b>\r\n          A CASCADING WATERFALL flows over rock face into the TWIN RIVERS.\r\n          The water curtain covers a CAVERN ENTRANCE. The back way in.\r\n          Jake, Ella, Doc, Colorado and the Apaches cross slippery rocks\r\n          and push through the water...\r\n\r\n<b>          INT. LIMESTONE CAVERN - CONTINUOUS\r\n</b>\r\n          Behind the curtain, they shake off the wet and remove TORCHES\r\n          from waterproof buffalo-hide pouches. FIRELIGHT as our team\r\n          creeps along in a column. TENSE. Jake glances at Colorado:\r\n\r\n<b>                         JAKE\r\n</b>          You and Percy're brothers, huh?\r\n\r\n<b>                         NAT COLORADO\r\n</b>          ... half.\r\n\r\n<b>                         JAKE\r\n</b>          So... your momma and Dolarhyde---\r\n\r\n<b>                         NAT COLORADO\r\n</b>          We friends now? Last I checked, you shot\r\n          my ear off.\r\n\r\n<b>                         JAKE\r\n</b>          (a beat; then)\r\n          Want it back?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          87.\r\n</b>          Colorado GRUMBLES, pushes ahead of Jake...\r\n\r\n<b>          EXT. FORT HUACHUCA - MORNING\r\n</b>\r\n          A BUZZARD picks at the EAR of a DEAD GANG MEMBER. More birds\r\n          scavenge the dismembered remains of JAKE'S CREW as the rest of\r\n          its LIVING MEMBERS -- roughly 30 -- tend wounds and get ready to\r\n          move on. One of them looks up...\r\n          .. and sees an INCOMING RIDER on the horizon:\r\n\r\n<b>                         OUTLAW\r\n</b>\r\n<b>          BRONC!\r\n</b>          BRONC and HUNT look up. Draws their GUNS. So does the rest of\r\n          the gang... until they see the rider's waving a WHITE FLAG. As\r\n          he comes closer -- they realize it's DOLARHYDE:\r\n\r\n<b>                         HUNT\r\n</b>          One of them fellas Jake was ridin' with!\r\n          Dolarhyde rides into camp, REARING in front of 30 guns\r\n\r\n<b>                         BRONC\r\n</b>          The hell you want?\r\n\r\n<b>                         DOLARHYDE\r\n</b>          It's about what you want.\r\n          He reaches into his pocket and tosses Bronc a GOLD COIN:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Lonergan stole your gold. That's a taste\r\n          of what I got -- more'n you've ever seen.\r\n          It's all yours if you help me get my boy\r\n          back.\r\n          The men trade LOOKS. Bronc eyes the coin. Alight with greed:\r\n\r\n<b>                         BRONC\r\n</b>          Who's got your boy?\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Well, there's the rub.\r\n\r\n<b>                         (BEAT)\r\n</b>          I got two.\r\n          Off that --\r\n\r\n<b>          INT. DEEPER IN THE LIMESTONE CAVERN - CONTINUOUS\r\n</b>\r\n          Our team has travelled far into the bowels of the cavern. Jake\r\n          STOPS, torchlight reflecting the GOLD in the cavern walls.\r\n          Doc cracks off a piece. POCKETS it. Shrugs:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          88.\r\n</b>\r\n<b>                         DOC\r\n</b>          In case we live through this.\r\n          They SNEAK on down the narrow shaft til they're funneled into...\r\n\r\n<b>          THE WATER GROTTO\r\n</b>          Where our TOWNSPEOPLE were hanging. Now, GONE. Around the\r\n          corner, the sound of ENGINES POWERING UP...\r\n          A TRANSPORT. A dozen WORKER-BEE ALIENS try to corral the HORSES\r\n          from the pen -- cruelly jabbing the animals with ALIEN CATTLE\r\n          PRODS. The mares REAR and WHINNY.\r\n\r\n<b>                         JAKE\r\n</b>          We're never gonna get close to that ship.\r\n          Silently. a DRIPPING. GLISTENING SHAPE rises un from the WATER\r\n          behind them. Swaying like a COBRA ready to strike:\r\n          Our people TURN... the TUBE ALIEN snatches one of the Apaches,\r\n          SWALLOWING HIM in its thorny snout! The indian SCREAMS --\r\n\r\n<b>                         JAKE\r\n</b>          Lights a WHISKEY MOLOTOV, hurls it at the CREATURE: BOOM! It\r\n          KEENS, BURNING, SPITTING OUT the Apache. ALERTED, the dozen\r\n          aliens by the transport SWARM at our heroes!\r\n\r\n<b>                         NAT COLORADO\r\n</b>          C g_that shuttle.\r\n          Colorado readies his TOMAHAWK -- Jake meets his eyes:\r\n\r\n<b>                         JAKE\r\n</b>          Knew there was a good reason I didn't\r\n          kill you.\r\n\r\n<b>                         NAT COLORADO\r\n</b>          Just thinkin' the same thing.\r\n          The men trade FATEFUL LOOKS... then the Indians HURL MOLOTOVS at\r\n          the charging horde: KAAA-BOOM! Aliens TWIST and SCREAM --\r\n          The Apaches STRIKE FEARLESSLY -- but the aliens quickly RECOVER\r\n          and SHAKE THEM OFF, tearing most of them to SHREDS.\r\n          The horses BREAK FREE and crash madly through the cavern --\r\n          And this is the DISTRACTION Jake and Ella need to make their run,\r\n          for the transport -- up the loading ramp:\r\n\r\n<b>          INT. TRANSPORT SHUTTLE - MINI CARGO BAY - CONTINUOUS\r\n</b>\r\n          Ella SLAMS a switch and the ramp DRAWS UP. Jake FREEZES:\r\n          COCOONS hang all around, filled with motionless HUMAN BEINGS.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          89.\r\n</b>\r\n<b>                         ELLA\r\n</b>          Jake - -\r\n          (he can only stare)\r\n\r\n<b>          JAKE.\r\n</b>          She slaps open an ENGINEERING HATCH, drops down a LADDER. He\r\n          takes a last awful look and SLIDES down after her --\r\n\r\n<b>          INT. TRANSPORT SHUTTLE COCKPIT - CONTINUOUS\r\n</b>\r\n          -- the ladder funnels into the COCKPIT. Ella starts TAPPING the\r\n          console and HOLO-DISPLAYS appear, Alien text, rotating\r\n          graphics. She slides into a SEAT --\r\n\r\n<b>                         ELLA\r\n</b>          Strap in. dammit!!!\r\n\r\n<b>                         JAKE\r\n</b>          Into what?!?\r\n          Ella JAMS a lever forward and the shuttle RISES. JAKE grabs\r\n          WEBBING that must be some type of SEATBELT, feeling the\r\n          sensation of ELLQU as:\r\n\r\n<b>          INT. CAVERN TUNNELS - CONTINUOUS\r\n</b>\r\n          Ella pilots the ship UPWARD, thrusters belching a WAKE OF FIRE\r\n          that SCORCHES cavern walls and INCINERATES 6 ALIENS!\r\n          As a HORSE streaks by, Colorado grabs a hunk of mane, LEAPS ON --\r\n\r\n<b>          NAT COLORADO (SUBTITLE)\r\n</b>\r\n<b>          LET'S GO!!!\r\n</b>          DOC comes RUNNING frantically:\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>          DON'T LEAVE ME!!!\r\n</b>          Colorado PULLS Doc up onto the horse's bare back -- no easy task\r\n          with Doc's 300 POUNDS. The remaining Apaches (5) commandeer\r\n          horses and GALLOP HARD down the tunnel --\r\n          Two aliens jump on MANTA-SPEEDERS in pursuit!\r\n\r\n<b>          INT. UNDERGROUND TUNNELS - DAY\r\n</b>\r\n\r\n<b>          THE TRANSPORT SHUTTLE KAMIKAZES THROUGH BI-SECTING TUNNELS:\r\n</b>          Jake has NEVER moved this fast, BARELY avoiding walls as Ella\r\n          expertly pilots the ship. LEFT -- RIGHT -- SIDEWAYS -- up\r\n          ahead, DIM LIGHT spills from a FISSURE leading above ground:\r\n\r\n<b>                         ELLA\r\n</b>          Hold on.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          90.\r\n</b>          She cranks back and the ship PITCHES upward --\r\n\r\n<b>          INT. TRANSPORT SHUTTLE - OVER THE CANYON - CONTINUOUS\r\n</b>\r\n          The shuttle BURSTS OUT into the canyon and skates the rim. Jake\r\n          fights the G-FORCES and teeth-rattling TURBULENCE as --\r\n          The craft keeps spiralling UP UP toward... THE OMINOUS CLOUD.\r\n          As we come closer, an IMPOSSIBLY BLUE GLOW blinds us:\r\n\r\n<b>          EXT. UPPER CLOUD LAYER - CONTINUOUS\r\n</b>\r\n          The shuttle BLASTS through the upper cloud layer, to reveal...\r\n\r\n<b>          THE ALIEN SCOUT\r\n</b>          -SHIP. ENORMOUS AND THREATENING, like a BLACK METAL CLAW. Cloud banks encircle the ship as if it were the eye\r\n          of a hurricane.\r\n          ON ELLA. Like ice down her spine... as we drift back to JAKE.\r\n          Trying to find a word to DESCRIBE this thing. Finally:\r\n\r\n<b>                         JAKE\r\n</b>          Sheee-it.\r\n\r\n<b>          INT. UNDERGROUND TUNNELS - CONTINUOUS\r\n</b>\r\n          The rest of our heroes GALLOP FAST out the criss-crossing\r\n          tunnels -- KA-CHINNNG! Apaches are CLAMPED WITH STEEL COLLARS\r\n          and YANKED off their horses as the SPEEDERS roar in from behind!\r\n          Colorado VEERS toward a LIGHT as Doc ignites a molotov and they:\r\n\r\n<b>          INT. ALIEN FORT - CANYON - CONTINUOUS\r\n</b>\r\n          GALLOP Out into daylight, rigb-t_through the CENTER of the fort --\r\n          Doc THROWS his molotov and BOOM!!! Aliens go FLYING, on fire!\r\n          Doc throws another MOLOTOV, clearing a path for Colorado to RIDE\r\n          HARD for the fort's 30 FT. STEEL ENTRY GATES... which start\r\n           SWINGING CLOSED to trap them!\r\n          But at the LAST SECOND, the horse SLIPS THROUGH the narrow\r\n          opening as it THUNDERS CLOSED. Now the aliens are pissed off:\r\n\r\n<b>          EXT. ALIEN FORT - CONTINUOUS\r\n</b>\r\n          They start spilling over the fort walls in pursuit. A few mount\r\n          SPEEDERS and launch as our guys ride DOWN THE CANYON TRENCH:\r\n\r\n<b>          ,INT. CANYON TRENCH - CONTINUOUS\r\n</b>\r\n          Colorado and Doc ZIG-ZAG around CURVES -- like mice navigatinga\r\n          maze, so the speeders can't get a clear shot:\r\n\r\n<b>                         DOC\r\n</b>          They're gaining on us!\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          91.\r\n</b>\r\n<b>                         NAT COLORADO\r\n</b>          That's the point!\r\n          And just when it looks like Doc and Colorado are GONERS...\r\n          BOOM! An EXPLOSION rocks the canyon as something HURTLES DOWN\r\n          from above -- WHISKEY MOLOTOVS fired from the handmade\r\n          CATAPULTS. BOOM! BOOM! Aliens are VAPORIZED, SHRIEKING!\r\n          A cloudburst of FLAMING ARROWS brightens the sky as 20 APACHES\r\n          RISE UP along the canyon rims: A AMBUSH!\r\n          An ASSEMBLY LINE OF SQUAWS works like a drill team, soaking\r\n          WHISKEY RAGS and wrapping arrows. Among them, EMMETT and HAPPY!\r\n          The kid pocks an arrow like a damn EXPERT -- IGNITES it -- lets\r\n          it FLY -- WHOOSH! It SKEWERS a speeder pilot who BURSTS INTO\r\n          FLAMES, the speeder CORKSCREWS into another one, both EXPLODING:\r\n\r\n<b>                         EMMETT\r\n</b>\r\n<b>          YEAHHHHH!!!\r\n</b>\r\n<b>                         THE ALIENS\r\n</b>          Caught OFF-GUARD with NO WM TO TURN AROUND as from the OPPOSITE\r\n          END of the canyon, a BELLOWING WAR WHOOP:\r\n\r\n<b>          GREY WOLF AND HIS 40 APACHES CHARGE IN. A MOVING HUMAN WALL\r\n</b>          CRASH! The Apaches HURTLE into the flank of aliens. LASERS are\r\n          met with the CRACK of RIFLES and hatchets --\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>\r\n<b>          TAKE THE FORT! ! !\r\n</b>          The Apache leader spurs his horse onward, leading men toward the\r\n          alien bunker. An EXPLOSION CONSUMES FRAME, becoming the:\r\n\r\n<b>          EXT. ALIEN SCOUT SHIP - ABOVE THE CLOUDS - CONTINUOUS\r\n</b>\r\n          -- PLASMA FIRE of the shuttle's burners as it ROARS toward the\r\n          ALIEN SHIP... a SPECK against the BEHEMOTH:\r\n\r\n<b>          INT. ALIEN SCOUT SHIP - COMMAND CENTER - CONTINUOUS\r\n</b>\r\n          The shuttle sweeps past the command center's polarized window,\r\n          where... THE SLAVER watches with EVIL EYES.\r\n          He's on the UPPER LEVEL of a TWO-TIER COMMAND CENTER. A DOZEN\r\n          ALIENS operate holo-consoles. Readying the ship to leave.\r\n\r\n<b>          INT. TRANSPORT SHUTTLE - SAME\r\n</b>\r\n          Ella settles down on a GLOWING DOCKING COLLAR. With the two\r\n          ships CONNECTED, the DISPLAY flashes a DEPARTURE ALERT:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          92.\r\n</b>\r\n<b>                         ELLA JAKE\r\n</b>          -- Dammit --- -- what--?\r\n\r\n<b>          -- WHAT'S WRQNG?\r\n</b>          -- she's CLIMBING back up the ladder, he FOLLOWS:\r\n\r\n<b>          INT. SHUTTLE - LADDER TUBE - CONTINUOUS\r\n</b>\r\n          They quickly CLIMB up the LADDER TUBE --\r\n\r\n<b>                         ELLA\r\n</b>          Engines are warming up -- got eight\r\n          minutes til the ship leaves, and about\r\n          one til automated retrieval --\r\n\r\n<b>                         JAKE\r\n</b>          -- autojamated what --?\r\n\r\n<b>          INT. SHUTTLE - LOADING BAY - CONTINUOUS\r\n</b>\r\n          As they spill into the LOADING BAY, a CLANG reverberates:\r\n          THE AIRLOCK DOOR -- AT THEIRFEyT\r\n          The first EXPLOSIVE BOLT shoots off. Ella jams her SHOTGUN into\r\n          a sheath on her back, presses herself flat:\r\n\r\n<b>                         ELLA\r\n</b>          Hug the wall.\r\n          Jake does that beside her as the next bolt PINGS out --\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          When they come at us, aim for their\r\n          heads. Only way to kill 'em for sure.\r\n          He looks at his bracelet, adrenaline SURGING -- it ACTIVATES:\r\n\r\n<b>                         JAKE\r\n</b>          I'll aim just fine.\r\n          THE LAST BOLT FIRES and the airlock door SHOOTS OFF:\r\n\r\n<b>          A MULTI- D HYDRAULIC \"GRABBER\" RISES INTO THE MECHANICAL\r\n</b>\r\n<b>          LIMBS SWINGING AROUND INCHES FROM THEIR FACES!\r\n</b>\r\n<b>                         JAKE (CONT'D)\r\n</b>          SonofaBITCH!\r\n          The manipulator arms SCOOP UP COCOONS, pulling them DOWN the\r\n\r\n<b>                         AIRLOCK:\r\n</b>\r\n<b>                         ELLA\r\n</b>\r\n<b>          C'MON!\r\n</b>          She JUMPS through the airlock -- Jake has no time to think:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          93.\r\n</b>\r\n<b>                         JAKE\r\n</b>\r\n<b>                         DAMMIT --\r\n</b>          And JUMPS after her --\r\n\r\n<b>          INT. SCOUT SHIP - \"THE FARM\" - CONTINUOUS\r\n</b>\r\n          -- LANDING beside Ella. Starts to pick himself up... but what\r\n          he sees ASSAULTS HIS MIND. We RISE UP UP UP, Ella and Jake\r\n          growing SMALLER in what we now reveal is a MASSIVE HANGAR where:\r\n          AUTOMATED -ARMS PLANT RECENT ARRIVALS INTO A VERITABLE FOREST of\r\n          PEOPLE AND ANIMALS. Level after level, THOUSANDS UPON THOUSANDS\r\n          OF COCOONS are suspended from branch-like limbs.\r\n          Jake picks himself up, looking around the massive hangar in AWE.\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>                         Ï¿½CIDYAPLQLWJJ\r\n</b>          -- she PULLS HIM into an alcove as a machine arm SWINGS\r\n          overhead, flashing a WIDE CONICAL LASER that inventories cocoons\r\n          like the machine in the underground cave. As they CROUCH:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          We can't let that thing see us or they'll\r\n          know we're here.\r\n          She turns -- hits buttons on a console -- a door SLIDES UP\r\n          leading to a series of CORRIDORS. She starts to MOVE --\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          This'll take us to the bridge --\r\n          But Jake doesn't follow. STARES at her --\r\n\r\n<b>                         JAKE\r\n</b>          Slaver's up there--?\r\n\r\n<b>                         ELLA\r\n</b>          I sure as hell hope not.\r\n\r\n<b>                         JAKE\r\n</b>          Then I'm not goin' with you.\r\n          And now she HARDENS --\r\n\r\n<b>                         ELLA\r\n</b>          You got any idea how big this ship is?\r\n          No ray you'll ever find him alone. Be\r\n          like findin' a needle in a--\r\n          -- SLAM!! Jake interrupts her by aiming at the LASER SCANNER\r\n          and FIRING HIS BLASTER, blowing it apart. The scanner eye\r\n          CRASHES to the floor, flaming. A KLAXON rings --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          94.\r\n</b>\r\n<b>                         JAKE\r\n</b>          I ain't gonna find him. He's gonna find\r\n          me.\r\n\r\n<b>                         ELLA'S FURIOUS:\r\n</b>\r\n<b>                         ELLA\r\n</b>          Thanks for the head start.\r\n          She turns and RUNS. Jake moves to that scanner eye on the\r\n          floor, walks right up to it and STARES into the shattered IRIS:\r\n\r\n<b>                         JAKE\r\n</b>          Alright, you sonofabitch... come and get\r\n          me.\r\n\r\n<b>          INT. ALIEN SCOUT SHIP - COMMAND CENTER - CONTINUOUS\r\n</b>\r\n          JAKE'S FACE APPEARS AS A THERMAL HEAT SOURCE -- fritzing as he\r\n          stares into the scanner. ALARMS scream.\r\n          THE SLAVER fills with RAGE. And RECOGNITION.\r\n          Aliens begin grabbing WEAPONS but The Slaver SHRIEKS for them to\r\n          STOP. We don't need to speak alien to understand:\r\n          \"He's mine. \"\r\n\r\n<b>          INT. SCOUT SHIP - CORRIDORS - CONTINUOUS\r\n</b>\r\n          Jake has moved out into the corridors -- blaster ready -- eyes\r\n          darting -- suddenly -- WHAM:\r\n          A STEEL BARRICADE SLAMS DOWN BEHIND HIM. WHAM! Another in\r\n          front -- WHAM! He's TRAPPED, shut off from the passageways...\r\n          .. except ONE. A long, dark tunnel. A DOOR at the far end\r\n          HISSES open: THE TURBOLIFT ELEVATOR.\r\n          ON JAKE. Understanding... his call is bging answe\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>                         (QUIETLY; HARD)\r\n</b>          Okay.\r\n          And starts walking to the elevator... as a SCREAM takes us to:\r\n\r\n<b>          INT. CANYON - DAY\r\n</b>\r\n          Handmade LADDERS are SWUNG FORWARD onto the fort as Apaches try\r\n          to SCALE the wall, but are BLOWN BACK by ALIEN PARAPET SENTRIES.\r\n          ON DOC -- running TRIAGE on wounded warriors:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          95.\r\n</b>\r\n<b>                         DOC\r\n</b>          I need more bandages now!/ You: lint and\r\n          splint that leg!\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          We're losing ranks ! ! !\r\n           And then, out of nowhere... the BANG BANG BANG of 30 pistols\r\n          fills the air as --\r\n          DOLARHYDE RIDES IN WITH JAKE'S GANG! A renewed SURGE of energy\r\n          as cowboys join Indians to fortify their ranks:\r\n\r\n<b>                         NAT COLORADO\r\n</b>          You came back!\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Told you: I take care of my kin.\r\n          Colorado knows that's as close to \"I love you\" as he'll ever\r\n          get. But the UPSWING is short-lived as:\r\n          A speeder WHIZZES past, dropping a METALLIC BUNDLE. It splits\r\n          open right in front of the fort's STEEL GATES -- pieces\r\n          hydraulically ASSEMBLING THEMSELVES in seconds, becoming:\r\n          THE MOTHERFUCKING SUPERGUN_OF DEATH. TWO LETHAL BARRELS spin to\r\n          life, firing STRANGE STEEL BALL BEARINGS in every direction.\r\n          CLAW HOOKS snap out of the balls, EMBEDDING in soldiers! One\r\n          LODGES in a GANG MEMBER beside DOC -- he FLAILS:\r\n\r\n<b>                         GANG MEMBER\r\n</b>\r\n<b>          HELP ME!!! GET IT OFF!\r\n</b>          A RED SPRING-LOADED PIN depresses in the ball's center: KA-BOOM!\r\n\r\n<b>          SEARING WHITE LIGHT TURNS THE OFFICER TOAASH -- AN ALIEN\r\n</b>          GRENADE! Doc goes FLYING from the kickback, landing near:\r\n          GREY WOLF -- FWWWWTWHCK!!! Another claw-ball CLAMPS into the\r\n          Apache's SHOULDER -- he SHOUTS, struggles to pull it out --\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>          DON'T. STOP, DAMMIT!!!!\r\n</b>          The RED PIN starts to depress -- pOC LUNGES, JAMS HIS FINGER\r\n          RETJff&amp;H_THE PIN AND BLASTING CAP. Now he's stopped it from\r\n          exploding, but if he pulls his finger out... HE DIES TOO.\r\n          DOC and GREY WOLF lock eyes. Their fates suddenly ENTWINED as --\r\n\r\n<b>          INT. SCOUT SHIP - TURBOLIFT - MOVING - CONTINUOUS\r\n</b>\r\n          Bars of light move rhythmically across Jake's face -- BURNING\r\n          with determination -- as he travels up in the turbolift. It\r\n          slows to a STOP. The door cycles open and --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          96.\r\n</b>          -- the STRANGEST THING happens. DESERT SAND billows in a gust\r\n          of ventilated air. SAND?! Jake emerges, blocking his eyes:\r\n\r\n<b>          INT. SCOUT SHIP - JUNKPILE CARGO HANGAR - CONTINUOUS\r\n</b>\r\n          -- the sand swirls and eddies. Visibility reduced to ZERO. As\r\n          Jake pushes through, the air clears a little...\r\n          His eyes WIDEN. Trying to make SENSE of what he sees:\r\n          Remember all those BUILDINGS that were pulled up into the\r\n          tornado when Absolution was attacked? And that CRATER they\r\n          found that used to be \"Winfield's Landing\"? It-'-s all-HE\r\n          in a junkwle hangar. Building pieces. False front\r\n          facades. Debris piled on top of each other, TILTED AND TWISTED\r\n          AT FUNHOUSE ANGLES. And the desert sand that was sucked up\r\n          along with it all.\r\n          A GLOWING REACTOR casts hellish light on the dormant wreckage.\r\n          Weapon ready, Jake moves past part of A BROTHEL. Jutting\r\n          fragments of a HORSE CORRAL. A CREAKING SALOON SIGN swings like\r\n          a pendulum, CLANKS EERILY.\r\n          A STEAM PIPE EXPLODES STEAM. Jake WHIRLS -- and like demons...\r\n          5 ALIENS emerge. Slowly. Fanning out, taking positions as...\r\n          THE SLAVER steps out of the smoke, squarely facing Jake. aAd_h@--\r\n          is holding ELLA hostage. WRIST BLASTER pressed to her throat.\r\n          Jake and Ella LOCK EYES. She's terrified, but staying STRONG.\r\n          His hand LINGERS at his hip, blaster ready.\r\n\r\n<b>                         JAKE\r\n</b>          Drop the woman. We both know this ain't\r\n          about her.\r\n          But The Slaver only presses his blaster HARDER into Ella's neck.\r\n          Almost GRINNING. And Jake MEETS the look --\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          She says you're as bad as they come.\r\n          Jake curls back the fingers on both hands, CRACKING knuckles:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Well, you ugly sonofabitch... they say\r\n          the same about me.\r\n          A pipe SPEWS STEAM -- UNNERVINGLY LOUD. Then STOPS.\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Could'a had your boys kill me five times\r\n          over, instead you rolled out the red\r\n          carpet... so let's get it over with.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          97.\r\n</b>          The Slaver HISSES ANGRILY at the challenge. PUSHES Ella roughly\r\n          off to one of his GANG, who keeps a blaster pressed to her side.\r\n          Vow ' O right the a ter of the \"town\" junkpile.\r\n          THE SLAVER -- his hand at his side, twitching.\r\n          JAKE -- his hand is still.\r\n\r\n<b>          A PIPE SPRAYS STEAM AGAIN, SCREAMINGLY LOUD AND --\r\n</b>          Everyone DRAWS! But Jake's INSANELY FAST as he drops to a knee\r\n          and FIRES gunsmoke-style -- BLAM SLAM! The Slaver's HIT and --\r\n          ELLA -- WRENCHES her captor's arm backward and he fires USELESS\r\n          ROUNDS into the air -- she takes a HIT in the leg as Jake SHOOTS\r\n          the captor with a SHOT to the temple --\r\n          Jake GRABS and PULLS Ella to safety behind a SHREDDED STORE\r\n          FRONT, taking cover -- lasers PUNCHING through the building\r\n          walls -- Ella spots an ALIEN lunging around a corner:\r\n\r\n<b>                         ELLA\r\n</b>\r\n<b>          BEHIND YOU!!!\r\n</b>          Jake WHIRLS, SLAM!!! The creature FLIES off its feet.\r\n\r\n<b>                         JAKE\r\n</b>          Stay down.\r\n          Ella does, and here come the rest of the aliens as Jake GUNS\r\n\r\n<b>          THEM ALL DOWN WITH PERFECT AIM.\r\n</b>          The REACTOR is hit in the crossfire and the ship RESPONDS with a\r\n          turbine HOWL.\r\n          Corpses litter the floor... all except for The Slaver. A trail\r\n          of FLUORESCENT BLOOD leads around the corner...\r\n          Jake WHIRLS to Ella -- her leg wounded --\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          -- you alright?\r\n          In PAIN, she snatches one of those SMART DISCS off a dead alien:\r\n\r\n<b>                         ELLA\r\n</b>          Reactor's hit. if I don't get this ship\r\n          on the ground soon, we're all dead...\r\n          (tries to STAND, WINCES)\r\n          Get me over to that turbolift.\r\n          He slings an arm around her shoulder and LIFTS her, helping her\r\n          to the elevator --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          98.\r\n</b>\r\n<b>                         ELLA (CONT'D)\r\n</b>          Put me inside.\r\n          He does. She sees his eyes go back to The Slaver's BLOOD TRAIL:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          I can manage the rest without you.\r\n          (tough... but with\r\n\r\n<b>                         COMPASSION)\r\n</b>          Go do what you came up here to do.\r\n          He looks at her. At the blood. At the unstable REACTOR.\r\n          And Jake Lonergan makes a CHOICE:\r\n\r\n<b>                         JAKE\r\n</b>          Goddamnit.\r\n          -- he gets INTO THE ELEVATOR with her. She SLAMS the control\r\n          pad, doors CLOSE -- they start rocketing upward. She half-grins\r\n          as her eyes hold on him. And within them... trust. AND FAITH.\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Stop smiling.\r\n\r\n<b>          EXT. THE BATTLEFIELD - OUTSIDE ALIEN FORT - CONTINUOUS\r\n</b>\r\n          As the FORT SIEGE continues, DOLARHYDE and COLORADO gallop back\r\n          and forth between their men:\r\n\r\n<b>                         DOLARHYDE\r\n</b>\r\n<b>          DON'T BREAK RANKS! HOLD YOUR LINES\r\n</b>\r\n<b>          GODDAMIT! WE CAN TAKE THIS FOR--\r\n</b>          -- KATHWAM! An EXPLOSION throws them off their horses.\r\n          Colorado picks up his father and they start RUNNING LOW under\r\n          stray beams of PLASMA FIRE, reaching Doc and Grey Wolf:\r\n\r\n<b>          THE FOUR MEN -- PINNED BEHIND THE ROCK EMBANKMENT:\r\n</b>          Doc's finger is still STUCK in that ALIEN GRENADE, clamped to\r\n          the bleeding Apache's shoulder:\r\n\r\n<b>          DOL.ARHYDE (CONT'D)\r\n</b>          The hell iz that?\r\n          Grey Wolf MOANS in pain. Doc SHOUTS to Dolar:\r\n\r\n<b>                         DOC\r\n</b>          Tell him to hold still! If I have this\r\n          thing figured right, long as t keep my\r\n          finger under the red pin we won't blow\r\n          up!\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          What's he saying?:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          99.\r\n</b>\r\n<b>                         DOLARHYDE (SUBTITLE)\r\n</b>          He says we're all gonna die.\r\n\r\n<b>                         COLORADO\r\n</b>          We need to pull it out of his shoulder!\r\n\r\n<b>                         DOLARHYDE\r\n</b>          I'm not pullin' anything!\r\n\r\n<b>                         (RE: DOC)\r\n</b>          He's the damn doctor!\r\n          ZZZZZZAM! MORE people are CUT DOWN by the Alien GRENADE CANNON\r\n          -- the BLOWBACK nearly KNOCKS the grenade out of Doe's hand --\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>          SHIT!\r\n</b>          Dolarhyde gets an IDEA. HARDENS. Looks Doc right in the eye:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Alright, listen -- you slide your finger\r\n          from under that pin, I'll slip mine in\r\n          and hold it in place. Then you pull it\r\n          out and I'll throw it.\r\n          Doc NODS fearfully. Dolar carefully SLIPS his finger under the\r\n          pin as Doc SLIPS it out. PHEW. Now Doc takes hold of the\r\n          grenade itself, nods \"ready\" to pull it out. Grey Wolf braces\r\n\r\n<b>                         FOR PAIN:\r\n</b>\r\n<b>                         DOC\r\n</b>          On three...\r\n\r\n<b>                         (DOLAR NODS)\r\n</b>          One... t --\r\n\r\n<b>                          DOLARHYDE\r\n</b>          -- Wait.\r\n          Everyone LURCHES from the tension interrupt:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Tell your wife we're clear.\r\n\r\n<b>                         DOC\r\n</b>          What?\r\n\r\n<b>                         DOLARHYDE\r\n</b>          -- your wife. Maria. We had an\r\n          arrangement. I left your saloon alone\r\n          and she paid me off.\r\n          ON DOC. Reeling, now REALLY confused --\r\n\r\n<b>                         DOC\r\n</b>          We're broke. Paid you off with what?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          100.\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          She stole from the people in your morgue.\r\n          Gold teeth, trinkets, pocket watches --\r\n          It LANDS on Doc: that's why he fond the watch under their bed.\r\n\r\n<b>                         DOC\r\n</b>          I thought she was cheating!\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Just robbin' corpses.\r\n\r\n<b>                         DOC\r\n</b>          Thank God!\r\n          (and then -- )\r\n          Wait. You hate me. Why're you telling\r\n          me this?\r\n          With GENUINE REMORSE:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          May not get another chance --\r\n\r\n<b>                         (THEN)\r\n</b>          -- and I still hate ya.\r\n          A MOMENT. Forgiveness and atonement.\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>\r\n<b>          WILL YOU GET ON WITH IT?111\r\n</b>\r\n<b>          DOC AND DOLARHYDE\r\n</b>          One... two... three!\r\n          And Doc RIPS the grenade from Grey Wolf's shoulder -- he HOWLS,\r\n          CLAMPS tearing out of his flesh. But they did it!\r\n          As more EXPLOSIONS decimate men, Dolarhyde PULLS the grenade out\r\n          of Doc's hands, still holding his finger under the FIRING PIN --\r\n\r\n<b>                         DOC\r\n</b>\r\n<b>                         WHAT'RE YOU--\r\n</b>          Dolarhyde looks at Colorado:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Tell your mother I love her.\r\n          With that, he CHARGES into the swirling chaos\r\n\r\n<b>                         NAT COLORADO\r\n</b>\r\n<b>          WAIT!\r\n</b>          -- but BOOM! Colorado's FORCED BACK by an explosion -- through\r\n          the debris, he sees his father running toward...\r\n\r\n<b>                         THE SUPERCANNON\r\n</b>\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          101.\r\n</b>          Dolarhyde HURLS the grenade -- BOOM!!! IT DETONATES IN A\r\n\r\n<b>          MILLION PIECES! DOLARHYDE DISAPPEARS IN THE BLAST!\r\n</b>\r\n<b>                         COLORADO\r\n</b>\r\n<b>          NO!!!!!\r\n</b>          But his sacrifice 7M S THE TIDE! THE EXPLOSION BLOWS THE\r\n\r\n<b>          FORT'S FRONT GATES OFF! THEY TOPPLE ON A WHOLE BUNCH OF ALIENS!\r\n</b>          A CRY OF VICTORY as the humans STORM THROUGH! Aliens hurtle\r\n          back in DISORDER --\r\n\r\n<b>          INT. SCOUT SHIP - COMMAND CENTER - CONTINUOUS\r\n</b>\r\n          The small ALIEN BRIDGE CREW scrambles to control the damaged\r\n          ship. The WHIR of the lift arriving, doors OPEN and --\r\n          WHOOSH! The SMART WEAPON blurs out of the elevator, SLICING\r\n          HALF A DOZEN ALIENS IN HALF -- circles back around to ELLA, who\r\n          skillfully catches it as she RUN/LIMPS from the lift with JAKE --\r\n          LASER FIRE IGNITES THE BRIDGE as he makes QUICK WORK of the rest\r\n          and Ella mans a console, getting to work --\r\n\r\n<b>                         ELLA\r\n</b>          We're going down fast.\r\n          She calls up telemetry on a HOLO-WINDOW: EARTH TERRAIN -- The\r\n          BATTLEFIELD. Sets coordinates, vectoring the ship that way:\r\n          A WHIR as a SECOND TURBOLIFT arrives... AND THE SLAVER STEPS\r\n          QQT. Wounded, and very PISSED OFF. Jake says to Ella:\r\n\r\n<b>                         JAKE\r\n</b>          No matter what.\r\n          Jake and The Slaver HURTLE into each other, TUMBLE off a\r\n          catwalk, CRASHING into conduits and GUNKY WATER below.\r\n          Jake staggers up but The Slaver is HUGE -- SLAMS Jake back into\r\n          the water. PINS A FOOT on his blaster arm -- CRUSHING IT.\r\n          Jake HOWLS as The Slaver presses a series of those HIEROGLYPH\r\n          MARKINGS on Jake's BRACELET -- the symbols LIGHT UP in an UNLOCK\r\n          CODE -- and KA-CHING! The bracelet POPS OF.E.\r\n          The Slaver TOSSES IT into the gunky water. Draws his LASER WHIP\r\n          -- WHUP-SNAP! The white-hot tip LASHES JAKE'S BACK, ripping his\r\n          shirt and BURN-SCARRING HIS BACK!\r\n          Jake SCREAMS in agony as The Slaver WHIPS HIM MERCILESSLY --\r\n\r\n<b>          EXT. SKIES ABOVE DESERT - CONTINUOUS\r\n</b>\r\n          The Scout Ship SCREAMS down out of the cloud, toward the CANYON:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          102.\r\n</b>\r\n<b>          EXT. CANYON BATTLEFIELD - CONTINUOUS\r\n</b>\r\n          Outlaws and Apaches finish off the wounded, TOMAHAWKS RIPPING\r\n          AWAY TENTACLED SCALPS! Carnage and joy -- but then:\r\n          A MONSTROUS SHADOW spreads over the battlefield. Everyone looks\r\n          up to see the SCOUT SHIP PLUMMETING DOWN --\r\n\r\n<b>          GREY WOLF (SUBTITLE)\r\n</b>          Fall back!!! NOW!! NOW!!\r\n\r\n<b>          INT. SCOUT SHIP - COMMAND CENTER - LOWER LEVEL - CONTINUOUS\r\n</b>\r\n          Another LASER WHIP SNAP and Jake seems DONE. Now The Slaver\r\n          LIFTS Jake from the water, CRUSHING his wind-pipe.\r\n          Jake FLAILS, REACHING for something BELOW FRAME... finally GRABS\r\n          and STABS it into The Slaver's side. The Alien ROARS in pain\r\n          and looks down to see --\r\n\r\n<b>          ONE OF HIS OWN \"ICE TACKS\" FROM HIS BANDOLIER EMBEDDED IN HIS\r\n</b>\r\n<b>          SIDE. IT STARTS TO GLOW BLUE WITH A HIGH-PITCH WHINE:\r\n</b>\r\n<b>                         JAKE\r\n</b>          Go to hell.\r\n\r\n<b>          THE SLAVER'S ROAR OF DEFEAT IS CUT SHORT AS THE MOTHERFUCKER\r\n</b>\r\n<b>          FREEZES TO GREY STONE. EXPLODING IN A MILLION PIECES!!!\r\n</b>          Jake DROPS, GASPING. Revenge fulfilled. Painfully starts\r\n          CLIMBING a ladder back to the upper deck --\r\n\r\n<b>          EXT. CANYON - BATTLEFIELD - CONTINUOUS\r\n</b>\r\n          As the humans FLEE from the fort, the remaining aliens RETREAT\r\n          to the last shuttles for ESCAPE... start to LIFT OFF...\r\n          But find themselves SMASHING into the ENORMOUS HULL of the ship\r\n          as_it crashe _down!\r\n\r\n<b>          INT. SCOUT SHIP - COMMAND CENTER - CONTINUOUS\r\n</b>\r\n          Jake FALLS into the seat beside Ella, straps in. Fighting the\r\n          controls, she SEES THE WHIP MARKS on his back. It TEARS her\r\n          heart open. And because this might be the end... she ADMITS:\r\n\r\n<b>                         ELLA\r\n</b>          I lied.\r\n\r\n<b>                         JAKE\r\n</b>          ... I know.\r\n\r\n<b>                         ELLA\r\n</b>          No, I heard what you said when I was\r\n          layin' there...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          103.\r\n</b>          JAKE. Taken aback. LAID BARE. As she says:\r\n\r\n<b>                         ELLA (CONT'D)\r\n</b>          You are a good man. At least... to me.\r\n          The ground GROWS BIGGER out the window. Her HAND reaches over\r\n          for his. JAKE'S HAND clasps hers and --\r\n\r\n<b>          EXT. BADLANDS - THE BATTLEFIELD - CONTINUOUS\r\n</b>\r\n\r\n<b>          THE SHIP PLUNGES INTO THE CANYON AND CLEAR THROUGH THE ALIEN\r\n</b>\r\n<b>          FORT, RIPPING IT INTO TIDAL-WAVE MOUNDS OF SHRAPNEL... CHEWS UP\r\n</b>\r\n<b>          A HALF-MILE BEFORE SLOWLY COMING TO A FINAL, WRENCHING... STOP.\r\n</b>          The frame is WHITE with dust and SUNSHINE. As from the ether\r\n          comes...\r\n          EMMETT, HAPPY, and DOC, with GREY WOLF's arm slung over his\r\n          shoulder. Among other faces, White and Apache... all of them\r\n          PROUD WARRIORS. Staring in awe at:\r\n\r\n<b>          THE CRASHED ALIEN SHIP. DUG DEEP INTO THE CANYON FLOOR.\r\n</b>          Something starts to rain down. Looks at first like glitter...\r\n          until we realize it's GOLD DUST.\r\n          From an OPENING in the Scout Ship, the sound of THUNDERING\r\n          HOOVES as... ALL THE ANIMALS STAMPEDE OUT. Then, slowly...\r\n          HUNDREDS OF PEOPLE emerge, dazed -- their minds slowly WAKING\r\n          UP. White and Kiowa-Apache ABDUCTEES.\r\n          DOC RUSHES IN, searching faces -- no -- no -- no -- n--\r\n          THERE she is, his BELOVED MARIA, stumbling weakly toward him as\r\n          tears runs down her cheek. He EMBRACES her madly, kissing every\r\n          inch of her face as...\r\n          EMMETT pushes through the crowd, sees SHERIFF TAGGART --\r\n\r\n<b>                         EMMETT\r\n</b>\r\n<b>          PAW!!!! PAW!!!!\r\n</b>          The kid GRABS his father and holds him for dear life, as Taggart\r\n          stares back in a daze --\r\n\r\n<b>                         EMMETT (CONT'D)\r\n</b>          It's me -- it's Emmett.\r\n          And somewhere in there, RECOGNITION comes to the Sheriff's\r\n          eyes... Emmett SMILES and throws his arms around his father\r\n          again as --\r\n\r\n<b>          THE TOWNSFOLK OF ABSOLUTION AND THE APACHES FIND EACH OTHER.\r\n</b>          Families, lovers, friends... reunited.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          104.\r\n</b>\r\n<b>                         COLORADO\r\n</b>          Moving through the FALLEN BODIES toward the lifeless form of\r\n          Dolarhyde, his FATHER. Eyes welling, he drops to his knees...\r\n\r\n<b>          A VOICE (O.S.)\r\n</b>          Nat?\r\n          Colorado turns -- it's PERCY. Confused. Like waking from a\r\n          dream. Sees his father on the ground...\r\n\r\n<b>                         PERCY\r\n</b>          What... happened?\r\n          And all Colorado can say is...\r\n\r\n<b>                         NAT COLORADO\r\n</b>          He's dead.\r\n          That HANGS there. Percy blinks. And then --\r\n\r\n<b>                         PERCY\r\n</b>          Who's gettin' the ranch?\r\n          ON COLORADO. At first, words that don't compute. Then PURE\r\n          BLIND RAGE takes hold and his FISTS FLY, PUNCHING PERCY:\r\n\r\n<b>          NAT COLORADO PERCY\r\n</b>\r\n<b>          YOU SONOFABITCH! HE JUST STOP! NAT, STOP!!!\r\n</b>\r\n<b>          SAVED YOUR WORTHLESS LITTLE\r\n</b>\r\n<b>          LIFE!\r\n</b>\r\n<b>          DOLARHYDE (O.S.)\r\n</b>\r\n<b>          HEY!\r\n</b>          Colorado WHIRLS -- DOLARHYDE IS STAGGERING TO HIS FEET, ALIVE!\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          No one's gettin' my ranch.\r\n          Stunned, Colorado GRINS. Percy spits blood, points accusingly --\r\n\r\n<b>                         PERCY\r\n</b>          Paw, he--\r\n          Dolarhyde SMACKS Percy across the face:\r\n\r\n<b>                         PERCY (CONT'D)\r\n</b>          OW!!! What'd you do that for?\r\n\r\n<b>                         UOLARHYUE\r\n</b>          For being an ungrateful little bastard.\r\n          Now shake your brother's hand and thank\r\n          him for saving your ass, cause it's more\r\n          than you ever would'a done bjM.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          105.\r\n</b>          Chastened, Percy glowers at Colorado. Grudgingly reaches out a\r\n          hand. So does Nat. As they SHAKE --\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          That's better.\r\n\r\n<b>                         JAKE\r\n</b>          Staggers through the crowd. And sees ELLA. Thgy did it. But\r\n          she still looks TROUBLED. Staring out at the vast desert...\r\n\r\n<b>                         JAKE\r\n</b>          . what is it?\r\n\r\n<b>                         ELLA\r\n</b>          We didn't get all of 'em. Some ran oft.\r\n          That LANDS on Jake, as he too looks toward the endless horizon.\r\n          HOLD on them, together, a VICTORIOUS but UNRESOLVED note...\r\n          We RISE UP over the sea of bodies and the CRASHED SHIP, until\r\n          Jake and Ella are just two small figures in the crowd...\r\n\r\n<b>                         FADE TO:\r\n</b>\r\n<b>          EXT. TOWN OF ABSOLUTION - DAY\r\n</b>\r\n          A glorious sight: Absolution in REBIRTH -- FLUSH from all that\r\n          GOLD. Storefronts brightly painted, the streets ALIVE.\r\n          We PICK UP EMMETT running through the hustle and bustle with two\r\n          APACHE KIDS. Suddenly, DOLARHYDE, COLORADO and their gang ride\r\n          in. SHERIFF TAGGART emerges from his office with DEPUTY WADE:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>\r\n<b>          EMMETT! GET OVER HERE!!!\r\n</b>\r\n<b>                         EMMETT\r\n</b>          -- what? What'd I dQ?\r\n\r\n<b>          SHERIFF TAGGART EMMETT\r\n</b>          Get outta the road before\r\n          you're run down! If your (overlapping)\r\n          momma saw y-- -- \"saw me playin' in the\r\n          street she'd roll over in her\r\n          grave and shoot lightnin'\r\n          bolts outta her eyes,\" I know,\r\n          I know!\r\n          He runs off. Taggart SMIRKS:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Kid's got a mouth on him.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          106.\r\n</b>\r\n<b>                         DEPUTY WADE\r\n</b>          Well, Kyle, considering he saved your\r\n          life, guess you'll just have to grin'n\r\n          bear it.\r\n          Dolar moves up to Taggart, tough as ever. The men HOLD looks:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Woodrow.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Kyle.\r\n          Percy STEWS about something. Dolar WHACKS him upside the head:\r\n\r\n<b>                         DOLARHYDE (CONT'D)\r\n</b>          Go_ _on.\r\n          Grudgingly, Percy hands Taggart a SHEAF OF PAPER --\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          What's this?\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Claims to the land 50 miles west of here.\r\n          I've signed it over to the township of\r\n          Absolution.\r\n          (off Taggart's LOOK)\r\n          Considering I'm a businessman, I figure\r\n          expansion's in both our interests. Needs\r\n          the Sheriff's signature to be official.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Fifty miles west of here is where the\r\n          goldmine is, Woodrow.\r\n\r\n<b>                         DOLARHYDE\r\n</b>\r\n<b>                         (A BEAT)\r\n</b>          That so.\r\n          With surprise, Taggart studies the paper. SMILES:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          What's this about twenty percent going to\r\n          the Apaches?\r\n          Dolarhyde glances at Colorado. A moment. But the hardened\r\n          rancher maintains his rock-solid facade:\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Figure the only way not to piss 'em off\r\n          is to buy 'em.\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          Since when'd you worry about pissin'\r\n          anyone off?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          107.\r\n</b>\r\n<b>                         DOLARHYDE\r\n</b>          Just sign it, Goddamnit.\r\n          With a grin, Taggart gestures for Deputy Wade to turn around and\r\n          flattens the paper on his BACK, using it as a surface to SIGN:\r\n\r\n<b>                         SHERIFF TAGGART\r\n</b>          I'd say you were being generous, Woodrow,\r\n          but I know you'd just be insulted.\r\n\r\n<b>                         DOLARHYDE\r\n</b>          Damn right.\r\n          Dolar gives his hat a TIP, then mounts up to go -- and we RISE\r\n          UP to the UPPER FLOOR of the GOLD LEAF SALOON, in the process of\r\n          being rebuilt in grand style -- and MOVE IN on a WINDOW where:\r\n\r\n<b>          INT. BEDROOM - CONTINUOUS\r\n</b>\r\n          DOC AND MARIA burst through a door, tearing passionately at each\r\n          other's CLOTHES -- Maria MOANS as Doc kisses her neck:\r\n\r\n<b>                         DOC MARIA\r\n</b>          SHH! The workers will hear\r\n          us!!! Let them hear!\r\n          As they TUMBLE back onto the bed, Doc LURCHES. Reaches under\r\n          his back to find... a GOLD POCKETWATCH.\r\n\r\n<b>                         DOC\r\n</b>          What is this?\r\n\r\n<b>                         MARIA\r\n</b>          Look at the inscription.\r\n          He flips it open to find an ENGRAVING: \"MI CORAZON... POR\r\n          SIEMPRE.\" Doc looks up at her, MOVED. Then -- PLAYFULLY:\r\n\r\n<b>                         DOC\r\n</b>          This looks like Aldo Mayberry's watch...\r\n\r\n<b>                         MARIA\r\n</b>          Shut up and kiss me.\r\n          She pulls him down, OUT OF FRAME --\r\n\r\n<b>          EXT. EDGE OF TOWN - DAY\r\n</b>\r\n          A hand unties a HORSE from its tether bar -- it's JAKE. Saddle\r\n          bags packed. A BARK turns him around... HAPPY. Yipping for\r\n          Jake to FOLLOW. He GRINS. As MUSIC begins to RISE -- HOPEFUL:\r\n\r\n<b>          EXT. ARIZONA DESERT - DAY\r\n</b>\r\n          In a LONG SHOT -- the distant SILHOUETTES of Happy BOUNDING\r\n          through the shallow TWIN RIVERS, Jake following on horseback...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          108.\r\n</b>\r\n<b>          EXT. RIM OF CANYON - DAY\r\n</b>\r\n          As Jake approaches, APACHE SENTRIES emerge from rocks to keep\r\n          outsiders away. Jake TIPS his hat and they nod, let him pass.\r\n          He nears the bluff where ELLA, GREY WOLF, and the rest of the\r\n          Apaches finish laying DYNAMITE DET CORD that trails down into\r\n          the canyon. Ella hears Happy BARKING -- turns to see her dog\r\n          with Jake. She smiles as he rides up, dismounts:\r\n\r\n<b>                         ELLA\r\n</b>          Second damn time that dog ran off on me.\r\n\r\n<b>                         JAKE\r\n</b>          Second time he brought me to you.\r\n          Happy's tail wags. The look between Jake and Ella HOLDS. And\r\n          it seems freighted with everything. Finally, he breaks it --\r\n          glancing at the Apaches finishing their work with the dynamite,\r\n          and the remnants of the ALIEN SHIP and FORTRESS below.\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Looks like you got everything set.\r\n          Ella eyes Jake's horse, loaded with GEAR. Looks up, clearly\r\n\r\n<b>                         DISAPPOINTED:\r\n</b>\r\n<b>                         ELLA\r\n</b>          Where you headed?\r\n\r\n<b>                         JAKE\r\n</b>\r\n<b>                         (A BEAT)\r\n</b>          Got some messes to clean up.\r\n          But she looks at him. fEADI.NG liim. wryly:\r\n\r\n<b>                         ELLA\r\n</b>          Messes.\r\n\r\n<b>                         JAKE\r\n</b>          ... Yep.\r\n          (then; off her look)\r\n          What.\r\n          She walks right up to his horse. Right up to HIM:\r\n\r\n<b>                         ELLA\r\n</b>          I think you're ridin' off cause you're\r\n          just scared of what'll happen if you\r\n          stay.\r\n          An INFERENCE here. Ella's going BOLD. Jake swings off his\r\n          horse, lands beside her. Now. Almost CURIOUS:\r\n\r\n<b>                         JAKE\r\n</b>          And what's gonna happen?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          109.\r\n</b>          She steps CLOSER to him... INTIMATE:\r\n\r\n<b>                         ELLA\r\n</b>          You know.\r\n          A CHARGE between them. All they wanna do is KISS...\r\n          But that'd be too easy. And those wounds of his, they haven't\r\n          quite healed. He drops his eyes; SOFTLY NOW:\r\n\r\n<b>                         JAKE\r\n</b>          If I stay... it's not gonna be good for\r\n          anybody, Ella.\r\n          A beat. She looks off. Nods. They say nothing. And now he\r\n          slowly climbs back on his horse. Ella TOUGHENS:\r\n\r\n<b>                         ELLA\r\n</b>          Heard some rumors outta Abilene. Weird\r\n          noises at night. Cattle mutilations.\r\n          Weather phenomena. Figured I'd ride down\r\n          there. Give it a look-see.\r\n\r\n<b>                         JAKE\r\n</b>          (his eyes narrow)\r\n          What's 'phenomena'?\r\n\r\n<b>                         ELLA\r\n</b>          Big storms in places that don't get big\r\n          storms.\r\n          ON JAKE. Every fighting instinct in him suddenly IGNITED,\r\n          though he plays it down:\r\n\r\n<b>                         JAKE\r\n</b>          You goin' down there yourself?\r\n\r\n<b>                         ELLA\r\n</b>          Why? You worried about me?\r\n          You bet your ass he is. But, he shakes his head--\r\n\r\n<b>                         JAKE\r\n</b>          No, ma'am. You can take care of yourself\r\n          just fine.\r\n          (then; tips his hat)\r\n          Be seein' you around.\r\n\r\n<b>                         ELLA\r\n</b>          goodbye, Jake.\r\n          He gets back on his horse. Starts to ride off. Happy BARKS and\r\n          trots alongside him. BARK BARK BARK. In dog that means \"Don't\r\n          be an idiot.\" Jake glances over --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n<b>          110.\r\n</b>\r\n<b>                         JAKE\r\n</b>          Get the hell away from me, you damn mutt.\r\n\r\n<b>          (BARK, BARK)\r\n</b>          Go on, GET.\r\n          He heels his horse, leaving Happy behind to WHINE.\r\n          Jake rides off into the sunset. But his heart's KICKING in his\r\n          chest. And this is pretty much where things usually end...\r\n          But. Jake pulls the REINS as he SIGHS. Turns the horse around.\r\n          TROTS back to Ella, whose smile WIDENS as he closes the gap\r\n          between them.\r\n          Finally STOPS right in front of her. And despite his best\r\n          effort to stay TOUGH... he just plain likes her:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Abilene happens to be on my way.\r\n          He reaches out a hand... she takes it... as he PULLS HER UP INTO\r\n          THE SADDLE. Ella grinning ear-to-ear as she folds her arms\r\n          around his waist. Jake -- ever the outlaw -- grumbles:\r\n\r\n<b>                         JAKE (CONT'D)\r\n</b>          Stop smiling, Goddammit.\r\n          He KICKS the horse and Happy follows. Ella shoots a goodbye\r\n          look to Grey Wolf, who NODS. Signals his men and FUSES ARE LIT:\r\n          The DYNAMITE FUSES ssssssnake down the mountain -- reaching the\r\n          canyon floor -- INTO those limestone tunnels where CLUSTERS OF\r\n          DYNAMITE have been placed... and as FUSE MEETS EXPLOSIVE:\r\n          ANGLE - JAKE AND ELLA CRESTING A HILL -- B000000000000MI The\r\n          THUNDER of EXPLOSIONS makes them rear. They turn back to see...\r\n\r\n<b>          THE TWIN RIVERS GEYSERING UP INTO THE CANYON. COVERING ALL\r\n</b>\r\n<b>          EVIDENCE OF THE ALIEN SHIP AND 'Q T.\r\n</b>          Ella folds her arms TIGHTER around Jake, her heart full. With a\r\n          nod of private affirmation, he spurs the horse with a HYAI\r\n          As the canyon behind them fills with rushing water, Jake and\r\n          Ella ride hard into the fiery sunset...\r\n          Away from the past, toward a future full of promise.\r\n\r\n<b>          FADE OUT.\r\n</b>\r\n\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Cowboys-&amp;-Aliens.jpg\"/>\n</td><td><h1>Cowboys &amp; Aliens</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Alex Kurtzman\" title=\"Scripts by Alex Kurtzman\">Alex Kurtzman</a>  <a href=\"/writer.php?w=Roberto Orci\" title=\"Scripts by Roberto Orci\">Roberto Orci</a>  <a href=\"/writer.php?w=Damon Lindelof\" title=\"Scripts by Damon Lindelof\">Damon Lindelof</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Cowboys &amp; Aliens Script.html#comments\" title=\"Cowboys &amp; Aliens comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:02:44.390908"}