{"title": "Cradle 2 the Grave", "film_link": "/Movie Scripts/Cradle 2 the Grave Script.html", "script_link": "/scripts/Cradle-2-the-Grave.html", "info_raw": "\n\nCradle 2 the Grave Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John O'Brian  Channing Gibson\nGenres  Action  Comedy  Crime  Drama  Thriller\nScript Date : May 2002\n\nRead \"Cradle 2 the Grave\" Script\n\n\n", "script": "\nCRADLE TO THE GRAVE\n\n             Written by\n  John O'Brien and Channing Gibson\n\n              Story by\n            John O'Brien\n\n\n\n\n          May 2002 Draft\n\n\n\n\n      FOR EDUCATIONAL\n       PURPOSES ONLY\n\n                                                                 2.\n\nFADE IN:\n\nEXT. STREETS (LOS ANGELES) - DAY\n\nEnd of the day.     An armored truck moves through the city of\nLos Angeles.\n\nEXT. JEWELRY EXCHANGE - DAY\nThe armored truck pulls up. An ARMORED TRUCK GUARD emerges\nfrom the back with a satchel and heads inside.\n\n\nINT. JEWELRY EXCHANGE - LOBBY - CONTINUOUS ACTION\nA large foyer. Security station and elevators. PARTY SOUNDS\ncan be heard from a second floor balcony.\nDOUGLAS is the security guard manning the station. Seeing\nthe Armored car Guard entering, he picks up the phone and\ndials. Beat. Into phone --\n                         DOUGLAS\n           Last delivery's finally here.\nThe Armored Truck Guard approaches the security station. As\nhe and Douglas exchange paperwork, the Armored Truck Guard\nreferences the sounds from upstairs --\n                           ARMORED TRUCK GUARD\n           Party?\n                         DOUGLAS\n           Introducing a new line of jewelry.\n                         ARMORED TRUCK GUARD\n           Wife wants me to buy her a ruby ring.\n           Told her to spend a little time with\n           the family jewels first.\nPING. An ELEVATOR opens. A second security guard's inside.\nHanding over the satchel and heading out --\n                           ARMORED TRUCK GUARD\n           Keep it real.\n\nINT. ELEVATOR - CONTINUOUS ACTION\nWe see the security guard with the satchel use a key-card to\ngain elevator access to the lower floors. As the elevator\ndoors slide closed...\n\n                                                              3.\n\nINT. VAULT ANTEROOM - MOMENTS LATER\nAn exclusive showroom. Display tables empty. At one end of\nthe room, the elevator. At the other end, the open door to\na walk-in vault.\n\nThe ELEVATOR PINGS, and the doors open. The guard emerges\nwith the cart. Pushes it across the room to the outside of\nthe vault.\nA man in a suit emerges from the vault and starts unloading\nthe cart into the vault.\n\nINT. SUBWAY STATION - DAY\n\nA train arrives.   People jostle on and off.\nOne man remains on the platform. MILES. Crisp dresser.\nCarrying a large leather bag. A cylinder hanging by a strap\nover his shoulder.\nThe train doors begin to close.   When...\nA fist inserts itself between the doors. They re-open, and\na man steps onto the platform. TONY FAIT. Well-dressed.\nIntense.\nFait joins Miles. They watch the train pull out. They\ncheck to make sure the station's empty. Then jump off the\nplatform into the tunnel and disappear.\n\nINT. VAULT ANTEROOM - DAY\nThe man in the suit has finished unloading the cart. He\ncloses the heavy vault door and spins a large wheel on the\ndoor, securing the vault.\n\nINT. SUBWAY TUNNEL - DAY\nFait and Miles run down the dark tunnel, staying close to\nthe wall. Miles stumbles. Falls toward the deadly, high-\nvoltage third rail.\nOut of nowhere, Fait's hand grabs Miles' jacket. Stops him.\nJust before he hits. Inches from the rail. Fait pulls him\nback up and away from the danger.\n                        FAIT\n          Watch yourself.\nMiles nods.\n\n                                                              4.\n                           FAIT\n          Keep it tight.\nMiles nods again, and they set off.\n\n\nINT. JEWELRY EXCHANGE - LOBBY - DAY\nSounds of the PARTY continue from upstairs. At the security\nstation, the guard, Douglas, looks up from a magazine and\nscans the security monitors.\n\nANGLE - SECURITY MONITORS\ndepicting the empty vault, empty vault anteroom, various\nempty store areas and the elevator, in which we see the man\nin the suit riding up.\n\nBACK TO SCENE\nDouglas settles back in with his magazine.\n\nINT. SUBWAY TUNNEL - DAY\nFait and Miles reach an access door tagged with paint.    Fait\nstarts to open it.\nSuddenly, the tunnel is filled with the ROAR of an\nAPPROACHING TRAIN. Fait and Miles leap to the wall.   Press\ntheir backs against it as tightly as they can.\nThe TRAIN whooms past, inches from their faces. When it's\ngone, Miles sighs with relief. Fait cracks the access door.\n\nINT. SUBWAY UTILITY TUNNELS - DAY\nFait moves quickly, Miles following. Fait makes fast lefts\nand rights, following more spray paint.\nThey branch off into a small dirt-floored space, deep in the\nsub-foundation of a building. Fait stops. Overhead is a\nflat ceiling. On the ceiling, his flashlight finds a spray-\npainted circle.\n                           FAIT\n          Bull's-eye.\nWithout a word, Miles begins assembling equipment.    Fait\npulls out a cell phone.\n\nEXT. PARKING GARAGE - (SANTA MONICA) ROOFTOP - DAY\n\n                                                                    5.\n\nA man, DUNCAN SU, sits in a rental 2002 Thunderbird.\n\nINT. SU'S RENTAL T-BIRD - CONTINUOUS ACTION\n\nSu's focused, intense, listening to a fancy WALKMAN through\nHEADPHONES. We hear what he hears. Only there's no music,\njust STATIC.\nSuddenly, on Su's headphones, a PHONE RINGS. Su grows even\nmore alert. We hear a man with a French accent answer the\nphone.\n                           CHRISTOPHE (V.O.)\n           Yes?\n\n                         FAIT (V.O.)\n           We're in position.\n                         CHRISTOPHE (V.O.)\n           Delivery confirmed. The stones are\n           there.\n                           FAIT (V.O.)\n           Not for long.\nCLICK.   HISS.\nSu didn't like what he just heard.       Curses in Chinese.   And\ntakes off.\n\nEXT. CHRISTOPHE'S APARTMENT BUILDING - DAY\nPerched on the side of a cliff above the Pacific, next to\nthe park. The top floor is at street level.\nSu easily gains access to the roof of the building. He\nmoves to an exact position just at the ocean-side edge. It's\nan eight-story drop.\nSu faces in.      And then... Hops backward off the roof.\nFalling feet-first through the air, Su momentarily grabs\nonto an eight-floor balcony rail, slowing his descent, then\nlets go.\nMomentarily grabs a seventh-floor rail and lets go. Grabs a\nsixth-floor rail. Hangs on this time. Vaults lightly onto\nthe balcony.\n\n\nINT. CHRISTOPHE'S APARTMENT - LIVING ROOM - DAY\n\n                                                                    6.\nA large, free-standing FISH TANK BUBBLES away. Nearby,\nCHRISTOPHE is packing to leave town. When...\n                         SU (0.S.)\n           Where are the stones?\n\nChristophe turns.       Sees Su standing behind him.\n                         CHRISTOPHE\n                   (French accent)\n           Who the fuck are you?\nWham.   The Chinese boxing version of a bitch-slap.\n                         SU\n           Who's getting them for you?\n\n                            CHRISTOPHE\n           Fuck off.\nWham!   Wham!   Wham!     Wham!   Much more violent than a bitch-\nslap.\n                            CHRISTOPHE\n           I'll tell you.\n                            SU\n           I know.\n\nINT. SUB-FOUNDATION - DAY\nA plasma torch burns through the metal-reinforced slab\noverhead. Fait taps Miles, who turns off the torch.\nFait hammers at the last layer. And...\n\nINT. VAULT ANTEROOM - CONTINUOUS ACTION\nA hole appears under the private display table, where it\ncan't be seen by the room's security camera.\n\nINT. SUB-FOUNDATION - DAY\nFait communicates via a high-tech, transmitting/receiving\nearwig.\n                            FAIT\n           Daria.\n\nINT. JEWELRY EXCHANGE - LOBBY - DAY\nDouglas looks up from his magazine and checks the security\nmonitors again. Everything a-okay.\n\n                                                                   7.\n\n\nANGLE - FRONT DOOR\nA limo pulls up outside.\n\n\nEXT. JEWELRY EXCHANGE - DAY\nA uniformed chauffeur gets out of the limo, moves to the\nback and opens the door. A very attractive woman in a\nshort, tight dress emerges.\n\nINT. JEWELRY EXCHANGE - LOBBY - DAY\n\nEscorted by the chauffeur, the woman, DARIA, enters. She\napproaches the security station. Up close, in the light,\nDaria's even more alluring. And knows how to wield it.\n                        DARIA\n          I'm here for the reception.\n                          DOUGLAS\n          Name, please?\n                          DARIA\n          Angie Rawlins.\nDouglas scans a list of names.      Checks off hers.\n                        DOUGLAS\n          Thank you. You can go on up.       Front\n          elevator, to the mezzanine.\nDaria turns toward the elevator. Then doesn't go. Just\nglances up toward the party, suddenly unenthusiastic.\n                        DARIA\n          ... I hate these things.      Don't you\n          hate these things?\n                        DOUGLAS\n          I'm just here to do my job.\nDaria looks back at Douglas.      Studies him a moment.   Liking\nwhat she sees.\n                        DARIA\n          Then again, you never know who you're\n          going to meet...\nShe shifts her wrap, baring cleavage.      Then leans over the\ndesk. Giving Douglas an eyeful.\n                          DARIA\n\n                                                               8.\n          I'll bet you're a lot more fun than\n          any of those boring people upstairs.\nDouglas is unaffected.   Just looks at her blankly.\n                         DOUGLAS\n          Really, ma'am.   I have a job to do.\nDaria doesn't understand why he's not interested in her.\nThen she glimpses Douglas's magazine lying on the desk.\n\nDARIA'S POV\nThe magazine is Genre.   Males for males.   Buff boys.   Big\npecs, big penises.\n\n\nBACK TO SCENE\nDaria steps back.\n                        DARIA\n          Well, I suppose I should go up and\n          see what they're selling.\nDaria turns back and calls to her chauffeur, TOMMY.\n                         DARIA\n          Tommy...\nWhat happens next happens very quickly and sotto voce, as\nDaria walks toward Tommy:\nShe whispers into a hidden mike --\n                        DARIA\n          Change of plans. He's gay.\nTommy hears it over his earwig.\n                         TOMMY\n          No way.\n                         DARIA\n          Yeah way.\nINTERCUT WITH:\n\nINT. SUB-FOUNDATION - DAY\nFait and Miles have heard it, too.   Into his mike --\n                          FAIT\n          Tommy.    Your turn.\n\n                                                            9.\n\nA look of alarm on Tommy's face.    Into his mike --\n                         TOMMY\n          Uh-uh.\n\n                        FAIT\n          This isn't a conversation.    Do it.\nIt's an order.    Tommy knows he has to.   Shit.\n                         TOMMY\n          Shit.\n                         DARIA\n          Key-card.\n\nThen, still to Tommy, her voice again at normal volume --\n                        DARIA\n          Why don't you keep my purse?     I\n          shouldn't be too long.\nDaria hands Tommy her purse. Palms the key-card from him.\nThen heads toward the elevator, as...\nTommy replaces the sick look on his face. Does his best to\nlook flirty as he walks over to the security station. Leans\nover the desk with a yummy-smile on his face.\n                         TOMMY\n          ... Aloha.\n(NOTE: The following scene is INTERCUT with Scenes 20\n thru 28.)\nDouglas looks up from his magazine.\n                         DOUGLAS\n          Hi.\n                        TOMMY\n          I hope you don't take offense at\n          this... but I just have such a\n          weakness for a man in uniform.\n                        DOUGLAS\n          If that's your thing...\n                        TOMMY\n          Uniform's definitely my thing. I\n          mean, I see a sailor, I'm thinking,\n          mmm, seafood. Y'know?\n                        DOUGLAS\n          I'm not actually supposed to be\n\n                                                   10.\n          talking on duty.\n                        TOMMY\n          Who's talking? Honey, this is a\n          flirting... But you're probably just\n          another good-looking man wasting it\n          all on women. World's full of fools.\nBeat.   Douglas lets him see the Genre magazine.\n                        TOMMY\n          Yahtzee!... Okay, Mr. I-Always-Have-\n          A-Hard-Nightstick. Put away the\n          pictures of those underfed, white\n          males and let's broaden your\n          horizons.\n\n                        TOMMY (CONT'D)\n          I like sunsets and puppy dogs, and\n          I'm big in the pants. Just hope I'm\n          not too cute for you. And don't tell\n          me it's a color thing, hon, or I'll\n          come over there and slap a little\n          discrimination right upside your\n          yummy little cheeks.\n                        DOUGLAS\n          I'm hooked up.\n                        TOMMY\n          Another big, hot, cuddly, black love-\n          Jesus got there first. That bitch.\n          Taking you. From me.\n                        DOUGLAS\n          Sorry.\n                        TOMMY\n          Hey... This day and age, sweetie, I\n          can appreciate the monogamy. Saving\n          it for your number one is keeping the\n          world safe, and it's okay by me.\n          Even if you are just breaking my\n          heart... Guess I'll just have to come\n          in here someday, let you catch me\n          shoplifting and resist arrest -- just\n          to have you wrestle me down and cuff\n          me.\n                        DOUGLAS\n          I can be pretty rough.\n                        TOMMY\n          Don't you get me all excited now.   I\n          was just learning to accept my\n          disappointment.\n\n                                                                11.\n\nTommy sticks out his hand.\n                           TOMMY\n          Tommy.     But you can call me Rachel.\n\nShaking hands --\n                        DOUGLAS\n          Douglas. And, man, I really gotta\n          get back to what I'm supposed to be\n          doing, okay?\nHe looks away.     Scans the monitors.\n\n\nANGLE - MONITORS\nEverything looks normal.\n\nANGLE BACK ON TOMMY AND DOUGLAS\nSeeing Douglas is unaware of what's happening in the vault,\nTommy relaxes.\n                        TOMMY\n          I'll leave you alone. But is it okay\n          if I just stand here and stare at the\n          muscles I'll be missing for the rest\n          of my\n          life?\nOFF which...\n\nINT. ELEVATOR - CONTINUOUS ACTION\nDaria gets in. Looks back to make sure Tommy has Douglas's\nattention. He does.\nInstead of going up, Daria uses the key-card to access the\ncontrols to go down.\n\nANOTHER ANGLE\nAs the doors close, Daria shoots a wink back at...\n\nTOMMY\nwho furtively flips her the bird.        Never missing a beat with\nDouglas.\n\n                                                            12.\nINT. VAULT ANTEROOM - DAY\nFait emerges from the hole beneath the table.\n\nINT. LOBBY - SECURITY STATION - DAY\n\nOn the monitors, we see Fait in the vault anteroom and Daria\ndescending in the elevator as Tommy keeps Douglas's\nattention diverted.\n\nINT. VAULT ANTEROOM - DAY\nFait holds a small digital camera next to the room's\nsecurity camera. Mimicking the security camera's slow pan,\nFait films the room. When he's done....\n\nCLOSEUP - FAIT'S DIGITAL CAMERA\nWe see the panning shot of the room on the monitor. Fait\npulls up an on-screen menu, clicks on \"Repeat.\" Whereupon\nthe mini-movie begins playing in a continuous loop.\n\nINT. VAULT ANTEROOM - DAY\nAs Fait mounts his camera in front of the security camera,\nDaria steps off the elevator, putting her hair up, ready to\nwork.\n\nINT. LOBBY - SECURITY STATION - DAY\nOn the anteroom monitor, we see the monitor on Fait's camera\nslide into position, making the room look empty, as Tommy\ncontinues diverting Douglas's attention.\n\nINT. VAULT ANTEROOM - DAY\nFait and Daria push the display table aside as Miles shoves\nequipment bags through the hole in the floor.\nFait opens the leather bag, revealing tools, a tripod, three\nsteel cables and a long, rectangular box. Miles grabs a\nhigh-tech DRILL. Begins BORING a hole high up on the vault\ndoor.\nFait hands Daria the tripod to set up, while he uncoils the\nsteel cables, attaches them to the wheel on the vault door.\nThen opens the rectangular box and lifts out what's inside.\nA surface-to-air missile. Fait sets it on the tripod.\n\n                                                             13.\nMiles, the hole drilled, picks up the cylinder he'd had\nslung over his shoulder. Pulls out a pressurized metal\ncanister of liquid nitrogen.\nMiles injects the nitrogen into the hole. A CRACKLING sound\nas the super-low-temp LIQUID spreads out inside the vault\ndoor. The outside frosts over.\nFait finishes attaching the free ends of the cables to clips\non the SAM. Final checks of the rig.\n                        FAIT\n          Out.\n\nINT. SU'S RENTAL T-BIRD - DAY\n\nSpeeding through L.A.   Calling 911 on a cell phone.\n                        SU\n          ... I want to report a crime in\n          progress.\n\nINT. SUB-FOUNDATION - DAY\nFait is the last one down through the hole.   Beat.    He looks\nat the others.\n                        FAIT\n          Faith.\n                        MILES\n          Faith.\n                        DARIA\n          Faith.\nFait pulls out a remote control firing device.   He pushes\nthe button. And...\n\nINT. VAULT ANTEROOM - DAY\nThe SAM IGNITES with a blinding flash and streaks across the\nroom. The steel cables instantly snap taut and... RIP the\nvault's wheel and frozen locking mechanism right the fuck\nout of the door.\n\nINT. LOBBY - SECURITY STATION - DAY\nThey felt a rumble.   Tommy covers --\n                        TOMMY\n          Earthquake.\n\n                                                             14.\n\nDouglas checks the monitors.      Everything looks okay.\n                        TOMMY\n          Bet you know how to hit a ten on the\n          Richter scale...\n\n\nINT. VAULT ANTEROOM - DAY\nThe crew re-emerges through the floor to find the vault door\nin pieces and a hole the size of a Sub Zero where the SAM\naugured into the opposite wall.\n                          DARIA\n          Holy shit...\n\nFait's already swinging open the vault.\n                        FAIT\n          This will trigger the silent alarm.\n          Let's go. We got eleven minutes.\nMiles moves down the rows of   drawers, using a tool to pop\nall the locks. Fait and Daria   follow behind, quickly pulling\nout the drawers and emptying   jewels into nylon bags. Fait\nempties drawer after drawer.    All white diamonds. When...\nHe opens a drawer containing various colored diamonds.     And\nstops, admiring them.\n                        FAIT\n          ... I love colored stones... Look at\n          this...\nHe holds up a small, faceted blue diamond.\n                        FAIT\n          Two-point-seven million.\nInto the bag.\n                        MILES\n          Whose shit we stealing, anyway?\n                        FAIT\n          Drug dealers and money launderers.\n                          DARIA\n          Works for me.\nThen something else catches his eye. He holds up a small,\npink diamond on a chain. Admires it.\n                        FAIT\n          This I can use.\n\n                                                           15.\n\nAnd pockets it.\n                         DARIA\n          T.\n\nFait moves to her. Daria's fishing into a nylon bag she\nfound in a drawer. Pulls out a handful of... Large black\ndiamonds. Many more in the bag.\n                         FAIT\n          Pow.\nHe takes the bag. Stows it in his jacket. When...\nSuddenly, Fait's CELL PHONE RINGS. Surprising them.   Beat.\nFait answers.\n\n                         FAIT\n          Go.\nINTERCUT WITH:\n\nINT. SU'S RENTAL T-BIRD - DAY\nSu's speeding through Los Angeles streets.\n                        SU\n          Your employer betrayed you. The\n          police are on the way. Leave the\n          black stones.\n                         FAIT\n          Who is this?\n                        SU\n          You know the ones I mean.\n                        FAIT\n          Don't think I'll do that.\nFait just hangs up.\n\nINT. LOBBY - SECURITY STATION - DAY\nTommy and Douglas hear APPROACHING SIRENS. The SIRENS STOP\noutside. SWAT, cops, the works. All heading for the front\ndoor. Tommy whispers urgently into his mike.\n                        TOMMY\n          Shit.  Five-0 at the do'.\n                  (then, aloud to\n                  Douglas)\n          Better move my car.\n\n                                                          16.\n\nINT. VAULT ANTEROOM - DAY\nFait grabs a bag of jewels.\n                           FAIT\n          Go time.     Leave the rest.\n\nINT. LOBBY - SECURITY STATION - DAY\nSWAT swarms in.\nTommy exits behind them.\n\n\nINT./EXT. LIMO - DAY\nTommy gets in.    A SWAT COP signals him.\n                           SWAT COP\n          Move it out.\n\nINT. UTILITY TUNNELS - DAY\nFait, Miles, and Daria run.\n\nINT. SUBWAY TUNNEL - DAY\nSlam! Fait, Miles, and Daria blast out the access door.\nFait kneels, feels the track.\n                         FAIT\n          Stopped the trains.\n                  (then)\n          We're in the rabbit hole, they're\n          sending down the snakes.\n                  (then)\n          Daria comes with me.\n                  (to Miles)\n          I got no idea where you should go,\n          but you know where to end up.\nMiles nods.\n                           FAIT\n          Faith.\n                           MILES\n          Faith.\n\nINT. SU'S RENTAL T-BIRD - DAY\n\n                                                                17.\nSu studies a computer map of downtown as he drives.\n\nINT. SUBWAY TUNNEL - MILES - DAY\nrunning like hell. Rounds a curve.      Ahead are the rear\nlights of a stopped train.\n\nINT. SUBWAY TUNNEL - FAIT AND DARIA - DAY\nApproaching the front of another train, stopped at a\nstation. Fait signals Daria to stay put. Then pokes his\nhead around the corner of the train.\n\n\nFAIT'S POV - STATION PLATFORM\nSWAT cops hustle passengers off the train. One SWAT GUY\nhelps another up to check the top of the train. The SECOND\nCOP jumps back down.\n                          SWAT COP #2\n             All clear.\n\nANGLE BACK\nFait turns back to Daria. Signals her to climb up onto the\ntop of the train. Then begins climbing after her.\nAs Fait reaches the driver's window, he sees ANOTHER SWAT\nCOP approaching the train's DRIVER, checking under seats,\netc.\nFait has to climb fast. The SWAT Guy and the Driver getting\ncloser. Looking up. Just as...\n\nINT. SUBWAY TRAIN - THEIR POV - CONTINUOUS ACTION\nFait's leg just clears the window.      They don't see it.\nBut...\n\nINT. SUBWAY TUNNEL - CONTINUOUS ACTION\nAs Fait rolls onto the top of the train...\n\nINT. SUBWAY TRAIN - CONTINUOUS ACTION\nThe NOISE causes the SWAT Cop to react.      To the Driver --\n                          SWAT COP #3\n             Hold it.\n\n                                                              18.\n\nA moment, as they stop and the Cop looks around.    The Cop\nchecks the Driver's compartment. Nothing.\n                         SWAT COP #3\n                  (radios)\n          Train's clear.\nThe Cop exits.    The Driver enters his compartment.\n\nINT. SUBWAY TUNNEL - CONTINUOUS ACTION\nANOTHER SWAT COP stands outside the Driver's window.\n                         DRIVER\n          Okay to go?\n                        SWAT COP #4\n          Just hang tight.\nDuring which, just above them...\nFait and Daria lie very still. Daria's tense. Fait winks at\nher, trying to relax her. Daria's still tense. He raises his\neyebrows slightly. Shifts his gaze down.\nShe doesn't get it. Finally follows his gaze. Sees her\nposition is giving him a full view of her cleavage. She\nlooks back at him in disbelief.\n                         FAIT\n          Nice.\nThat does it. She relaxes and smiles back. Under which a\nvoice crackles over the SWAT Cop's radio.\n                         RADIO (V.O.)\n          All clear.\n                          SWAT COP #4\n                    (to Driver)\n          Okay.    Get this train outta here.\nWhereupon the train jerks to a start.\n\nINT. SUBWAY TUNNEL - MILES - DAY\nrunning toward the rear of the stopped train.   Leaping onto\nthe rear steps. When...\nOut of nowhere, a foot catches him in the head, sending him\nflying back down onto the rails. And... There is Su in\nfront of him.\n\n                                                             19.\n                        SU\n          The stones.\n\n                        MILES\n          You'll have to come and get 'em.\n\nSu moves on Miles. Miles throws a solid punch at him. Su\nand Miles fight on the track behind the stopped train. The\ndeadly third rail making the fight even more dangerous.\nMiles is a street boxer. He's good. He's ferocious. But\nhe's no match for Su. When Miles is subdued, Su grabs the\nbag of jewels, makes sure Miles doesn't have any more, then\ngoes.\n\n\nINT. SUBWAY TUNNEL - SUBWAY CAR ROOF - DAY\nRocketing underground. The tunnel ceiling whizzes by above\nFait and Daria. Intermittent tunnel fixtures just inches\nfrom their heads.\nEvery time the train takes a curve, they both slide toward\nthe edge. Fait places a calming hand on top of Daria's. The\ncar takes a wide curve.\nDaria's body flips to the side. She loses her grip.\nScreams as she starts to fall off the train. Fait reaches\nfor Daria, losing his grip on his bag, which plummets off\nthe train.\nFait can't grab her. The train jerks again. He starts\nsliding away from her, off the opposite side. Fait thrusts\nout both hands as far as he can. And...\nJust snags her at the last second. Grips Daria's wrists\nwith all he's got. They're now draped across the curved roof\nof the train. Hands in the middle. If Daria slips, or Fait\nlets her go, they both die.\n\nINT. RENTAL T-BIRD (OUTSIDE SUBWAY ENTRANCE) - DAY\nSu gets in. Empties Miles' nylon bag into his lap. A\nfortune in gems and jewelry pours out. Su sifts through it,\nincreasingly agitated. What he wants isn't there. He throws\nthe bag down, cursing in Chinese.\n\nINT. SUBWAY TUNNEL - SUBWAY CAR ROOF - DAY\nFait is at his limit. His grip starts to loosen. When the\ntrain begins to slow. They pull into a station and stop.\nFait releases Daria, and she drops to the platform.\n\n                                                            20.\nFait jumps down on the other side. He's lost the bag of\njewels. Knows they're gone for good. He feels for the bag\nof black diamonds. Still has them.\nUnseen, Fait joins Daria on the platform, and, hand in hand,\nthey melt into the crowd of commuters.\n\n\nEXT. AIRPORT - GENERAL AVIATION TERMINAL - DUSK\nA stretch limo and a Cadillac Escalade wait on the tarmac\nnext to a Gulfstream, which has just arrived.\nThe jet door opens, and a man emerges with a bodyguard. The\nman, LING, is Asian, about forty. Emanates grace and power.\nAs Ling descends the steps, and two thugs from the SUV go to\nretrieve baggage...\nA woman steps out of the waiting limo to greet Ling.   She's\nalso Asian. Dressed in American casual. Beautiful.     SONA.\nShe's not smiling. As Ling approaches her --\n                        LING\n          Enjoying California?\nCHARLES, the bodyguard, answers for himself.\n                        CHARLES\n          Hope we're not here long.    I hate\n          sunshine.\nLing kisses Sona on the lips.    Then --\n                        SONA\n          We may have a problem.\nLing's mood quickly darkens.\n                        LING\n          The stones?\n                        SONA\n          The exchange was just robbed.\n                        LING\n          ... Let's hope that was part of the\n          plan.\n\nINT. JEWELRY EXCHANGE - VAULT ANTEROOM - DAY\nSwarming with police. When... Su steps off the elevator.\nHe's carrying the bag of jewels he took from Miles. To a\nCOP --\n                        SU\n\n                                                            21.\n          Who's in charge?\n                        COP\n          Who wants to know?\nSu flashes I.D. We don't see it.   The Cop scopes it a\nmoment. He's clearly impressed.\n                        COP\n          Follow me.\nAs he leads Su toward his superiors in the vault...\n\nINT. VANESSA'S BEDROOM - NIGHT\n\nVANESSA, eight, is in her pajamas, playing SIM Coaster on\nher computer. The door opens. Fait enters. His daughter.\n                        FAIT\n          You know it's past your bedtime.\n                        VANESSA\n          Just a little longer.\n                        FAIT\n                  (imitating sweetly)\n          'Just a little longer'... School\n          tomorrow, baby. Let's go.\nVanessa sighs. Fait stands over her as she shuts down the\ncomputer, talking her through the commands, making sure she\ndoesn't dawdle.\n                       FAIT\n          'Exit.' 'Quit.' 'Do not save.'\n          'Special.' 'Shut down.' Sleepy-\n          time.\nWhereupon he whisks her out of her chair, flies her once\naround the room and tucks her into bed.\n                        FAIT\n          You bag some Z's now, you hear?\n                        VANESSA\n          Okay.\n                        FAIT\n          ... Wait a second.\n                        VANESSA\n          What?\n                        FAIT\n          I think there's something behind your\n\n                                                               22.\n          ear.\n                        VANESSA\n          Oh, please, that is so lame.     It's in\n          your hand.\n\nShe takes his right hand, opens it and turns it over.\nNothing. Takes his left hand, opens it and turns it over.\nMore nothing. She's stumped.\nFait smiles. Puts his hands together. When he opens them,\nthere is the pink diamond pendant on the chain.\n                        VANESSA\n          How'd you do that?\n\nFait slips the chain over her head and kisses her.\n                          FAIT\n          Good night.\nThen Fait looks up.     Addresses the air above her.\n                        FAIT\n          Angels east, angels west, north and\n          south, do your best. Guard her,\n          watch her, while she rests.\nA bedtime ritual. Fait goes. When she's alone, Vanessa\nholds up the diamond, which catches every bit of available\nlight and shines in the dark.\nThen she rolls over and closes her eyes.\n\nINT. FAIT'S HOUSE - KITCHEN - NIGHT\nFait enters.     Vanessa's nanny, TONITA, is there.    To Tonita\n--\n                        FAIT\n          She'll stay down now.\n                        TONITA\n          She won't listen to me lately.     Only\n          you.\n                        FAIT\n          I'll have a talk with her about it\n          tomorrow.\nStill to the nanny --\n                        FAIT\n          I got some work to do in the office.\n          You can go on to bed.\n\n                                                            23.\n                        TONITA\n          I'm watching TV, if you need me.\nFait exits.\n\n\nINT. FAIT'S BAR/LIVING ROOM - CONTINUOUS ACTION\nFait enters.    Tommy and Daria are there.\n\n                        TOMMY\n          What the hell happened?\nFait puts a finger to his lips.    Leads them across the room\nto another door.\n\n\nINT. FAIT'S OFFICE - CONTINUOUS ACTION\nThey enter.    Fait shuts the door.\n                        TOMMY\n          Should we be considering a\n          long vacation in a warm,\n          foreign climate where there's\n          no extradition?\nFait's thinking it through.\n                        FAIT\n          The guy who called was only\n          interested in the black stones...\n                        DARIA\n          Christophe sold us out.\n                          FAIT\n          Or something.\nJust then, Miles enters.\n                          DARIA\n          You made it.\n                        MILES\n          By the skin of my ass. Some\n          Chinese dude kicked me around\n          the motherfuckin' block. Busted\n          my ear piece.\nHe takes the broken communication device out of his ear and\ntosses it on the table.\n                        MILES\n          Snagged my loot, too... Maybe time to\n\n                                                              24.\n          rethink the no-gun policy.\n                        TOMMY\n          Little ass-whuppin's nothing. 'Least\n          you didn't have to play all foxy with\n          the rent-a-cop.\n\nFait pulls out the bag of black diamonds.\n                        FAIT\n          Means this is all we got.\n                        DARIA\n          So what do we do?\n                        FAIT\n          You all wait to hear from me.\n                        TOMMY\n          Where're you going?\n                        FAIT\n          To get some answers.\nMiles moves to go with him.\n                        MILES\n          I got your back.\n                        FAIT\n          No. I got us into this.     I'll call\n          you if I need you.\nDaria moves to him.   Their eyes meet.\n                         DARIA\n          Be careful.\nFait gives her a kiss.   Then goes.\n\nINT. CHRISTOPHE'S LIVING ROOM - NIGHT\nChristophe's arms are   wrapped around the large fish tank,\none arm over the top,   the other through the legs of the\nstand. His hands are    bound. He can't move. His beaten\nface is pressed to the   glass. Large, weird fish swim past\nin front of him.\nThe weird fish scatter as a face appears on the other side\nof the tank. Ling. Looking through at Christophe.\nLing straightens and walks around the tank. Sona is with\nhim. So is Charles, the bodyguard. In b.g., the two thugs\nstand sentry near the front door. Christophe's eyes follow\nthem.\n\n                                                            25.\n\n                        LING\n          So this is Mr. Christophe?\n                        SONA\n          Yes. Only the handcuffs and fish\n          tank are a new look.\n                        LING\n          Apparently we're not his first\n          visitors today.\n                        CHRISTOPHE\n          Please, Monsieur Ling --\nLing interrupts him with a hand on the shoulder.\n\n                        LING\n          Whatever you're going to say... Make\n          it the truth.\n\nEXT. ARCHIE'S AMERICAN SURPLUS - M1A1 TANK - NIGHT\nSitting in the middle of the large lot, which is full of hot\ngoods and military surplus equipment. The tank's turret is\nspinning around. The cannon elevating and depressing\nseemingly at random. When...\nThe cannon stops. Having locked on...Fait, standing in\nfront of the tank. From inside the tank, a muffled voice.\n                        VOICE (O.S.)\n          Bang.\nA hatch opens. ARCHIE, a fairly straight-ahead-looking man,\npops his head up out of the tank.\n                        ARCHIE\n          Like it?\n                        FAIT\n          It's cool.\nAs Archie climbs out of the tank and joins Fait --\n                        ARCHIE\n          Want it? Give you a good deal. Ammo\n          included... Reactive armor, twin M240\n          machine guns, 120mm smoothbore\n          cannon. Guaranteed to get you\n          through the rougher areas of the city\n          and keep the neighbors in line.\n                        FAIT\n          Pass.\n\n                                                         26.\n\n                        ARCHIE\n          How about a Marine Corps assault\n          hovercraft?\n                        FAIT\n          I got other business.\nFait and Archie walk to a work table. Nearby, two MEN\nUNLOAD HOT TVS from a truck. One Man calls to Archie.\n                        MAN UNLOADING HOT TVS\n          We're outta room over here, Arch.\n                        ARCHIE\n          Stack 'em in the office, if you have\n          to.\nThen Archie turns his attention back to Fait.\n                        ARCHIE\n          ... You weren't downtown tonight by\n          any chance, were you, Tony?\n                        FAIT\n          Don't know what you're talking about.\n                        ARCHIE\n          Me either.\n                        FAIT\n          Ever see black diamonds before?\n                        ARCHIE\n          White, blue, yellow, pink. Neil\n          Diamond. Lou Diamond Phillips.\n          Black diamonds? Solid rocks? No.\nWhereupon Fait opens the nylon bag and pours the black\ndiamonds out onto the table. Archie pulls out a loup.\nStudies them a moment. Shrugs.\n                        ARCHIE\n          You got me.\n                        FAIT\n          Find out how much they're worth.\n                        ARCHIE\n          There a timetable on this, or --\n                        FAIT\n          Yesterday.\n                        ARCHIE\n          That's what I figured.\n\n                                                                27.\n\nFait's heading out.\n                        FAIT\n          I'll be back. I gotta go fuck over a\n          guy who fucked me over.\n\n\nINT. CHRISTOPHE'S APARTMENT BUILDING - HALLWAY - NIGHT\nFait opens a door with an electronic lock pick.\n\nINT. CHRISTOPHE'S APARTMENT - LIVING ROOM - CONTINUOUS\nFait enters. Stops a moment, his back against the closed\ndoor, while his eyes adjust to the dark. Then moves quietly\nout into the room. Looking for Christophe.\nFait continues moving around through the room. When he\nsteps in something wet. He bends down and checks it out.\nWater. The carpet's soaked.\nHis eyes go to something. Fait finds a cord and turns on a\nswitch. The light in the fish tank snaps on.\nREVEAL Christophe.     Stuffed inside the tank.     Sleeping with\nthe fishes.\n                        SU (O.S.)\n          Looks dead to me.\nBehind him.   Fait turns around.      Sees Su.   Sitting on a\nsofa.\n                        FAIT\n          Guess you got to him first.\n                           SU\n          Not me.     Someone else.\nFait does the math.\n                        FAIT\n          ... You're the one who called me.\n          The one who took on my guy... Who the\n          fuck are you, man?\n                          SU\n          My name is Su.\n                           FAIT\n          Cool.     I'm Sally.\n                        SU\n          I want the black stones.\n\n                                                                  28.\n\n                            FAIT\n             Yeah?   Make me an offer.\nSu stands.\n\n                           SU\n             You can walk out of here.\n                            FAIT\n             ... No deal.\nFait launches   himself at Su. Gonna fight     his way    out the\ndoor. A much    better fighter than Miles.     And...    He's saved\nby the bell:    the PHONE RINGS. The fight     stops.     The\nphone's near   Fait. Beat. The answering      machine    picks up.\n\n                           CHRISTOPHE (V.O.)\n             Christophe here. Leave a message.\nBEEP.\n                           LING (V.O.)\n             I know you're there, Mr. Fait.\nBeat.   Fait pushes the button for the speakerphone.\n                            FAIT\n             Who's this?\nINTERCUT WITH:\n\nINT. HOTEL ROOM - NIGHT\nOverlooking L.A. Ling and Sona. Enjoying hotel room\nservice. Ling's on a cell phone.\n                             LING\n             The man for   whom Mr. Christophe\n             arranged to   have the black stones\n             brought into   the country and\n             deposited at   the jewelry exchange.\n             The man who   wants them back. Now.\n                            FAIT\n             Fine.   How much?\n                           LING\n             Maybe you didn't understand me.    The\n             stones are already mine.\n                           FAIT\n             I got 'em, I'm selling 'em. So get\n             your bid in or go fuck yourself.\n\n                                                               29.\n                           LING\n             I don't have time for this.\n                           FAIT\n             That your final offer?\n\n                           LING\n             I can be a very dangerous man, Mr.\n             Fait.\nFait just hangs up.\n                        FAIT\n          Everybody think I'm the fucking\n          Goodwill or something...? Look, I've\n          had a shitty night, and so far, I got\n          zip for all my troubles. So I don't\n          know who the fuck you are, and I\n          don't care. But hear this: you can\n          beat my ass around the block all\n          night --\n          Brother, it ain't gonna get you those\n          stones.\nA long beat. The two men facing off. Then...\nAs Su stands aside, giving Fait a clear path out...\n\nEXT. STREET NEAR CHRISTOPHE'S - NIGHT\nFait slides into his Porsche and drives off.\n\nINT./EXT. FAIT'S PORSCHE - NIGHT\nFait's checking his rearview mirror. Sees a black Cadillac\nEscalade pull away from the curb and follow.\nFait doesn't need it.\n                           FAIT\n             Oh, man...\nHe's about    to punch it. When... A cop car turns a corner\nand falls    in beside him. Fait throttles back. Keeps\ndriving.     Until, finally... The cops turn off. And now...\nFait hits    it. Until...\nTraffic ahead forces Fait to turn into an alley in a semi-\nindustrial area. Behind him, the Escalade tries to follow,\nbut is cut off by the on-coming cars.\nWe STAY WITH Fait. He GUNS down the alley. Reaches an\nintersecting alley. Turns. GUNS it out of sight.\n\n                                                               30.\nINT./EXT. ESCALADE - CONTINUOUS ACTION\nFinally forcing its way through on-coming traffic and\nspeeding down the alley after Fait. The ESCALADE reaches the\nintersection. Turns. And... CRASHES into a DUMPSTER rolled\ninto its path. The dumpster forces the Escalade into a\nwall.\n\nEXT. ALLEY (SEMI-INDUSTRIAL AREA) - CONTINUOUS ACTION\nTwo men start to get out of the Escalade. We recognize\nthem: Ling's two thugs. We barely have time to realize\nthat Fait's escape has been blocked by construction\nequipment down the alley. He's had no choice but to turn\nand fight.\n\nWhich is what he does, rushing the passenger.\nThe battle's ferocious and fast. Ultimately, Fait's out-\nmuscled and out-gunned. He's forced back against the open\ndoor of the Escalade, guns to his head.\n                        LING THUG #1\n          Give us the stones.\n                        FAIT\n          Man, how many times I gotta tell\n          people: I'm a business man. Make me\n          a motherfucking offer.\n                        LING THUG #2\n          Here's your offer.\nHe cocks his pistol.   Beat.\n                        FAIT\n          That shit ain't gonna do it, biggie.\n          'Cause I ain't scared of guns, and I\n          ain't got the stones.\n                        LING THUG #1\n          Then you're gonna tell us where they\n          are.\nWhereupon a...\nBOTTLE\nSpins through the air. The bottle knocks the gun from one\nKiller's hand. The gun skids under a nearby chain-link\nfence.\nREVEAL\nthe person who threw the bar.   Su. The fight's on.   Two on\n\n                                                            31.\ntwo. Using all means available. During the battle, a killer\ntries to reach the gun behind the chain-link fence. Almost\ngets it. When...\nTwo vicious DOBERMANS, guard dogs for the junkyard behind\nthe fence, leap out of nowhere, SNARLING and SNAPPING and\nsmash into the fence. The killer jumps back, barely\nescaping with his arm.\nThe fight continues.   Fait and Su wear them down.\nBehind the fence, the Dobies want flesh. Every time someone\ncrashes into the fence, they're right there trying to get a\npiece.\nAlso, every time someone crashes into the old fence, we see\na series of chain-link connections loosen and break. Until\nit happens one too many times. The entire fence goes down.\nThe dogs are out. The nearest targets: Su and Fait.Su and\nFait must now focus their attention on fighting off and\nevading the ferocious attack dogs.\nFinally, Su kicks one dog flying. Whip-kicks the other off\nFait. The two men run for the Escalade. The dogs are up in a\nflash. Su spots an abandoned car. A rear door is open.\n                        SU\n          Over here.\nFait follows, right on his heels.\nThe dogs close in.\nSu reaches the car. Dives through the open door.\nSomersaults over the rear seat. Kicks open the far door and\nrolls out. Fait dives in right behind him. The Dobies leap\nin after Fait.\nFait's airborne completely through the back seat and out the\nother side of the car. Clears the door. And... Su slams\nthe door shut.\nWe watch a two-Doberman pile-up against the suddenly closed\ndoor as Su leaps to the car's other side and shuts that\ndoor, too. Trapping the SNARLING, foaming DOGS inside.\nThe bad guys are gone. And Fait's CELL PHONE is RINGING. As\nFait digs out the phone, to Su --\n                        FAIT\n          Man, what the hell's up with these\n          fucking stones?\n                  (into phone)\n          Go.\n\n                                                           32.\nINTERCUT WITH:\n\nINT. ARCHIE'S AMERICAN SURPLUS - OFFICE - NIGHT\nArchie's had the shit beat out of him.\n\n                          ARCHIE\n          It's Archie.    Bad news.   We got a\n          problem.\n\nCLOSEUP - VIDEO MONITOR\nSurveillance camera footage of Archie's.\n\nFive armed African-Americans, faces hidden under baseball\ncaps, enter Archie's place, put Archie up against a wall and\nstart to beat something out of him.\n                        ARCHIE (O.S.)\n          ... I did what you said, right? Put\n          it out on the street, trying to get\n          info on the stones. Next thing I\n          know, the Jackson Five here show\n          up... Now, there are three\n          significant elements to notice here.\n          One, I'm outnumbered. Two, they're\n          heavily armed. Three, they're gonna\n          beat me like a bongo drum...\n\nINT. ARCHIE'S AMERICAN SURPLUS - OFFICE - NIGHT\nArchie, Fait and Su are watching the monitor. On screen,\nArchie surrenders immediately.\n                        ARCHIE\n          ... I mean, hey, I coulda resisted,\n          sure -- and they coulda beat me into\n          a coma or killed me or whatever --\n          but then, see, I'm thinking: How\n          would I be able to tell Tony what\n          happened to the stones? Right? What\n          good am I dead or on life-support.\n          So I threw in the towel.\n          Reluctantly, of course. For your\n          sake.\n                       FAIT\n          Okay. You saved yourself to tell me.\n          So tell me.\n                          ARCHIE\n          What?\n\n                                        33.\n                FAIT\nWho are they?\n              ARCHIE\nUh... Don't know.\n\n              FAIT\nWhat'd they say?\n              ARCHIE\nWell... 'Give us the stones,\nmotherfucker.' You know. That kinda\nthing.\n                FAIT\nThat's it?\n\n                ARCHIE\nPretty much.    Yeah.\n              FAIT\nThanks for keeping yourself alive to\npass on all that valuable\ninformation.\n              SU\nDid you call the police?\n              ARCHIE\nLook around. Are you crazy? Then\nagain, maybe you are crazy, 'cause I\nhave no idea who you are.\n              FAIT\nBig question is, who's behind the\nboost?\n              ARCHIE\n        (re: footage)\nI don't know that, but I know they\ngot great guns. I can't even get\nthose. U.S. Special Forces only.\n                FAIT\n... Chambers.\n                ARCHIE\nWhat?\n              FAIT\nHe's wired into everything going down\nin this city, and he can get that\nkind of firepower. Gotta be him.\n              SU\nWho's Chambers?\n\n                                                  34.\n\n                        FAIT\n          Runs the biggest outfit in town.\n          What warlords are to Afghanistan,\n          Chambers is to L.A... And you want to\n          take him on, you're on your own.\n          Game over for me.\n                  (beat; then)\n          And now that I'm truly fucked -- what\n          the hell are you, anyway? You got\n          some I.D.?\nBeat.   Su takes out his wallet and shows him.\n\nINSERT - I.D.\n\nIn Chinese.     Clearly official.\n                        FAIT\n          Doesn't mean shit to me.\n                        ARCHIE\n          Let me see that.\nArchie takes it, reads.\n                        ARCHIE\n          Taiwan. Central Security Bureau.\n          Taiwanese intelligence.\n                        FAIT\n          You read Chinese?\n                       ARCHIE\n          No. But I know 'cop' in every\n          language.\n                        FAIT\n          What, you some kinda Asian James\n          Bond?\n                        SU\n          The stones belong to my government.\n                        FAIT\n          Yeah, well, they're Chambers' now.\n          And even governments don't go to war\n          with him.\nUNDER which, Fait's CELL PHONE starts RINGING.\n                        FAIT\n          I'm starting to hate this phone.\n                  (answers)\n          What now?\n\n                                                              35.\n\nINTERCUT WITH:\n\nINT. LIMOUSINE - TIGHT ON LING AND SONA - NIGHT\n\nLing's on his cell phone.\n                        LING\n          I hope you've reconsidered.\n                        FAIT\n          Hey, it's Mr. Dangerous.   'Sup,\n          'homie'?\n                        LING\n          You've made this difficult, Mr. Fait.\n          Let me make it easy.\n                        FAIT\n          Can't wait to hear.\n                        LING\n          I have your daughter.\nFait freezes.\n                        LING\n          She's very pretty in her pink\n          pajamas. Aren't you, Vanessa?\nREVEAL Vanessa, in the limo, held by Charles.     On Ling's\nsignal, Charles uncovers her mouth.\n                        VANESSA\n          Daddy!\n                        FAIT\n          Vanessa!\n                        LING\n          I want my stones, Mr. Fait.\n                        FAIT\n          Motherfucker...\n                        LING\n          You think about it a moment. Let me\n          talk to the Chinese gentleman who's\n          with you.\n                        FAIT\n          Don't you hurt her.\n                        LING\n          That's up to you... The Chinese\n\n                                                             36.\n          gentleman, please?\nBeat.   Fait hands the phone to Su.\n                        FAIT\n          He has my daughter.\n\n                         ARCHIE\n          Oh, Jesus...\n                        FAIT\n          He wants to talk to you.\nSu takes the phone.   In CHINESE with ENGLISH SUBTITLES --\n                         SU\n          Hello.\n                        LING\n          I thought I killed you.\n                        SU\n          I have the stones.      No negotiations.\n          Let the girl go.\n                        LING\n          Do you really want one more person to\n          die?\nWe see this resonates with Su.\n                        SU\n          No negotiations.\nAnd then, he simply hangs up.\nEND INTERCUT.\n                        FAIT\n          What'd you just do?     What happened?\n                        SU\n          I said I have the stones and won't\n          negotiate for your daughter.\n                         FAIT\n          You what?\n                         ARCHIE\n          Oh, Jesus...\n                        SU\n          It will confuse him.     Buy us time and\n          keep her alive.\n                         FAIT\n\n                                                              37.\n          What the fuck're you talking about?\n          That asshole has my daughter.\n                         SU\n          Look -- I know him.\n                  (then)\n          I want the stones, you want your\n          daughter. We'll get them both back.\n          We'll work together.\n                        FAIT\n          ... I gotta work with you?\n                        SU\n          You have no choice.\n\nBeat.   Fait realizes what this means.\n                        FAIT\n          ... Shit... We gotta go see\n          Chambers...\n                  (beat, then)\n          Oh, god... Vanessa...\n\nINT. AIRPLANE HANGAR - NIGHT\nLarge, empty, brightly-lit.    The door opens, and the limo\npulls in.\n\nINT./EXT. LIMOUSINE - CONTINUOUS ACTION\nThe limo stops inside the hangar.    To Charles, re:   Vanessa\n--\n                        LING\n          Find a place to put her.\nThen, as Charles forces Vanessa out --\n                        VANESSA\n          My daddy's gonna come and kick your\n          butts.\nSona just reaches out and slaps her. It hurts and surprises\nVanessa. Tears come to her eyes. But she's Fait's\ndaughter: she won't let this bitch make her cry. Charles\ntakes Vanessa out. Ling's mind is still on the phone call.\n                        LING\n          Su says he has the stones... But why\n          cut me off? Why not negotiate for\n          the girl? It doesn't make sense.\n                        SONA\n\n                                                           38.\n             The buyers fly in tomorrow.   Should\n             we stop them?\n                            LING\n             We'll never regain their confidence.\n                     (beat)\n             We need information. Find the right\n             people. Pay whatever it costs.\n             Something's not right. Something's\n             happening with the stones.\n                           SONA\n             What about the girl?\n\n                           LING\n             We'll need her... She stays alive.\n             For now.\n\nINT. FAIT'S PORSCHE - NIGHT\nIn motion.     Fait and Su.   Fait on the cell to Tommy.\n                             FAIT\n             I'm on the way to Chambers... Yeah, I\n             know, but I got no other choice.\n             Just get the word into his pipeline\n             that I'm coming and want permission\n             to visit... I'll get back to you...\n             Faith...\n                      (hangs up)\n             Maybe Chambers'll have a heart and\n             give the stones back.\n                      (then)\n             Yeah, right -- and maybe he'll join\n             the Peace Corps.\nSu looks over.     Beat.\n                           SU\n             I'm sorry about your daughter... How\n             old is she?\n                           FAIT\n             This ain't the Biography Channel.\n             Let's just get there.\nA long beat.     L.A. moving by outside.\n                            FAIT\n             Eight.   She'll be nine in September.\nBeat.\n                           SU\n\n                                                          39.\n          Mine is fifteen... Boyfriends...\n                          FAIT\n          Never happen.    I'll just kill\n          'em.\n\n                        SU\n          I wish it were that easy.\nAnother beat.   Then --\n                        FAIT\n          About time I got the 4-1-1.\n                          SU\n          4-1-1?\n\n                        FAIT\n          What's this all about?\n                        SU\n          The stones aren't what you think they\n          are.\n                          FAIT\n          No shit.\n                  (then)\n          How about the guy who has Vanessa?\n                        SU\n          He's exactly what you think he is --\n          a thief and a killer.\n                          FAIT\n          Great...\n\nINT. HANGAR - NIGHT\nA battered Ford camper now sits in the middle of the hangar.\nWe see Vanessa inside the camper. She's screaming. Loudly.\nNot scared. Pissed. As...\nLing Thug #2 covers the windows with black spray paint.\n\nANGLE - ACROSS HANGAR\nLing Thug #2 hands car keys to Charles.\n                        CHARLES\n          Where'd you get that piece of shit?\n                        LING THUG #1\n          Let's just say Grandma and Grandpa\n          have a long walk back from the\n\n                                                              40.\n          campground.\n                        CHARLES\n          You're sure you cleaned it out?\n                        LING THUG #1\n          Everything except the denture cream\n          and adult diapers.\nVanessa's still screaming.   It's getting on Charles' nerves.\n                        CHARLES\n          I'm sick of her already.\nHe marches toward the van.   Unlocks the rear door and slides\nit open.\n\n\nINT./EXT. CAMPER - CONTINUOUS ACTION\nVanessa is standing inside, still yelling.\n                         CHARLES\n          Shut up!\n                         VANESSA\n          You shut up!\n                         CHARLES\n          Go to sleep!\nVanessa reaches over and flicks ON the camper's TV.   Turns\nit UP LOUD. Giving him stink-eye defiance as...\nCharles slams the door shut.   Locks it.   And...\nNow that Vanessa's made her point, and Charles can't see her\nanymore, her boldness begins to subside. She lies down on\nthe bed and curls up, alone and scared inside the dark\ncamper.\nVanessa holds up the pink diamond pendant and gazes at it.\nA talisman. Connecting her to her father. Not making the\nfear go away, but giving her strength.\n\nCLOSEUP - FAIT\nAs he drives, just as if he can sense Vanessa's need for him\n--\n                        FAIT\n          Angels east, angels west, north and\n          south, do your best. Guard her,\n          watch her, while she rests.\n\n                                                               41.\nOFF which, as Su regards him...\n\nINT. MEDIUM SECURITY PRISON - CELLBLOCK - DAY\nA prison guard escorts Fait and Su past cells, each just as\ndreary, spare and institutional as the next. That is, until\nthey reach the last cell.\nThe last cell is guarded by two convict sentries.    Hanging\nblankets cloak the cell entirely from view.\nFait, Su and the prison guard stop outside the cell. One\nsentry blocks the way in as the other parts the blankets\ncovering the open cell doorway, REVEALING...\n\n\nINT./EXT. CHAMBER'S CELL - CONTINUOUS ACTION\nAfter a walk through Kansas, this is the land of Oz. The\nlast cell is as comfy, colorful and a well-appointed as\nJoel's office.\nJUMP CHAMBERS, a large, brutal-looking, inner-city crime\nlord has clearly used money and influence to improve the\nterms of his incarceration.\nChambers puffs a Cuban as a prison trustee, WILLY CHICKENS,\nsets out breakfast before him: fresh-squeezed OJ; eggs\nbenedict; large, juicy sausages; fresh breads and pastries;\nFrench-press coffee; LA TIMES, NY TIMES, WSJ, Maxim, Hustler\nand the daily mail.\nThe guard leaves Fait and Su, turns to go.\n                          CHAMBERS\n             Metz.\nThe guard, METZ, stops and looks back.\n                           CHAMBERS\n             D.V.D.'s broke.\n                           METZ\n             Get you a new one straight away, Mr.\n             Chambers.\nMetz goes.\nBeat.   Chambers eyes Fait and Su through his cigar smoke.\n                            CHAMBERS\n             Thanks for your patience.   Man needs\n             his nightly rest.\n                     (then)\n             Who's the gook?\n\n                                                            42.\n\n                        FAIT\n          ... Chinese guy.\n                        CHAMBERS\n          ... No shoes in my crib.\n\nThen, when Fait and Su have removed their shoes --\n                         CHAMBERS\n          In.\nThe sentries move aside. Fait and Su enter. Chambers ash-\ntrays his Cuban and digs into b-fast.\n                        FAIT\n          How you doing, Jump?\n                        CHAMBERS\n          Don't waste my precious time.\n                        FAIT\n          ... I got a problem.\n                         CHAMBERS\n          How's Daria?\n                         FAIT\n          ... Good.\n                        CHAMBERS\n          Always was good. From the moment I\n          found her till the moment you took\n          her away from me. Problem, you say?\n                        FAIT\n          ... The black stones.\n                        CHAMBERS\n          Bitch brought it in. Made me a lotta\n          money. But that all stopped. You\n          stopped that. You decided it was\n          okay to put an end to that. Black\n          stones. Go on.\n                        FAIT\n          I need 'em back.\n                        CHAMBERS\n          Only smart thing was not pimping her\n          yourself, 'cause then I'da been real\n          sore-angry, and you'da both been real\n          cold-dead...\n                        CHAMBERS (CONT'D)\n          But you don't pimp, do you? Just a\n\n                                                              43.\n          thief in the night. Stealing what\n          don't belong to you.\nChambers turns to Su.   In SUBTITLED KOREAN --\n                        CHAMBERS\n          You like tall white women?\nSu doesn't say anything.   Back to English --\n                        CHAMBERS\n          He can't talk?\n                        SU\n          I don't speak Korean.\n\nChambers carves up a sausage.\n                        CHAMBERS\n          Bought myself this Korean club\n          downtown. Packing in the Seoul\n          brothers 24-7-365... Black man\n          gouging Koreans, ain't that a\n          switch... Motherfuckers got faces\n          like walls, but they love to drink\n          liquor and look at naked girls...\n          Place is no shitbox, either. Got me\n          an office looks like a kabuki love\n          palace. My own little sanctuary --\nA QUICK SHOT OF Fait, taking this in.\n                        CHAMBERS\n          -- just waiting for when I parole\n          out... Stop by sometime, eyeball the\n          poon.\n                        FAIT\n          ... Jump, my daughter's mixed up in\n          this. I gotta have the stones, or\n          she's dead.\nNo response.   Chambers just keeps eating.\n                        FAIT\n          If you need something more than that,\n          here it is...\n                  (this is hard)\n          I'm begging you, Jump.\nStill no response... Chambers finishes eating.    Wipes his\nface. Finally --\n                       CHAMBERS\n          Big heist. Risky heist. Breaking\n          news. I'm watching it wondering why.\n\n                                                                44.\n          What's worth that kind of trouble,\n          that kind of heat? Gotta be\n          something good. Gotta be something\n          expensive.\nBeat.   He meets Fait's eyes.   Holds them.\n\n                        FAIT\n          She's my little girl.\n                         CHAMBERS\n          Make another one... Lotta offspring\n          running around. Big scores're rare\n          in a lifetime.\nAnother beat.   That's it.   No deal.\n\nFait takes a sudden step toward Chambers.     Su stops him.\n                        CHAMBERS\n          Slope's no dope.\nHe indicates behind them. They turn. The two cell sentries\nare wielding prison shanks. So is Willy Chickens.\n                         CHICKENS\n          Let me cut one of these\n          motherfuckers.\n                         CHAMBERS\n          Your choice.\nChickens is happy.   Thrusts the knife at Fait.       When...\nSu reaches out and catches the   blade.  Catches it with just\nthe thumb and forefinger of one   hand.  And holds it like\nthat. Holds it hard. Chickens     can't push and can't pull.\nDoesn't know what to do next.    Finally yanks really hard.\nAnd...\nSu lets go. Chickens goes backward, ass over teakettle. A\nbeat. Then, to Fait --\n                        CHAMBERS\n          Say hey to Daria. And don't forget\n          your shoes.\n\nEXT. PRISON - DAY\nFait and Su walk toward the Porsche.\n                        FAIT\n          I used to look up to that guy.      All I\n          wanted was to be like him.\n\n                                                            45.\n                       SU\n         In Taiwan, I could force him to talk.\n                        FAIT\n         This ain't Taiwan.\n                 (then)\n         Only thing we can do now is find out\n         where the stones are and go take 'em.\n                       SU\n         You make it sound easy.\n                        FAIT\n         It won't be.\nThey're about to get in the car. Fait stops.     Looks back at\nthe prison. Suddenly realizing something.\n                       FAIT\n         ... They're at his club.\n                       SU\n         How do you know?\n                        FAIT\n         I know. I can feel it.      That ever\n         happen to you?\n                        SU\n         No.\n                       FAIT\n         I thought Chinese people were all\n         mystical and shit.\n                       SU\n         We like to gamble.     Not guess.\n                       FAIT\n         It's no guess... But I could be\n         wrong... We'll hit the club. You\n         gotta see Archie.\n                        SU\n         Archie?\n                       FAIT\n         He's gotta remember something about\n         the guys who took down his place.\n                       SU\n         What if he can't?\n                       FAIT\n         Pretend it's Taiwan.    Make him\n         remember.\n\n                                                          46.\n\n\nINT. HANGAR - DAY\nRUSSELL, the science and technology end of Ling's operation,\ncarries a piece of equipment from the back of a five-ton\ntruck and approaches some kind of strange contraption, which\nhe's in the process of erecting in the middle of the hangar.\nHe puts down what he's carrying next to the contraption and\nstarts back for something else, when he sees Charles is\nlooking in the back of the truck.\n                          RUSSELL\n          Hey!    Get away from there!\nRussell hurries over, extremely edgy, almost manic.\n\n                        RUSSELL\n          What are you doing?!\n                        CHARLES\n          Whoa. Take it easy. Just seeing if\n          I could help with something.\n                        RUSSELL\n          You can't! It's very delicate\n          equipment! Stay away! Just stay\n          away from my truck!\n                         CHARLES\n          What?\n                        RUSSELL\n          Stay away from my truck!\n                         CHARLES\n          What?\n                        RUSSELL\n          Stay away from my truck!\n                         CHARLES\n          What?\nSona's emerging from a trailer/office nearby.\n                         SONA\n          Stop it.\nCharles does. And now we can hear Vanessa, who's begun\nscreaming inside the camper.\n                        VANESSA (O.S.)\n          I want my daddy!\nCharles backs up, continuing to address Russell --\n\n                                                            47.\n\n                        CHARLES\n          I'm backing away... I'm backing\n          away...\n                        VANESSA (O.S.)\n          I want my daddy! I want my daddy!\nCharles joins Sona.   Re:   Russell --\n                        CHARLES\n          Someone give the geek his Ritalin.\n                        SONA\n          At least he's doing his job. Which\n          is more than I can say for some\n          people.\n                        VANESSA (O.S.)\n          I want my daddy! I want my daddy!\nSona tosses Charles a roll of duct tape.\n                        SONA\n          Tape her up and gag her.\nAs Vanessa continues to SCREAM, Charles moves to the van,\nunlocks the rear door with the key/remote and pockets it.\nThen opens the door. And...\nVanessa bolts out, crying, and clamps her arms around his\nwaist.\n                         VANESSA\n          I want my daddy! I want my daddy!    I\n          want my daddy!\n                        CHARLES\n          Get the hell off me.\nHe pries loose her arms from around him. Keeping a grip on\nher wrists with one hand, Charles turns her around to face\naway from him. He's about to start duct-taping her wrists.\n                        CHARLES\n          ... Waste of time... I can think of a\n          better way of shutting you\n          up --\nVanessa back-kicks him hard in the 'nads.   Charles howls in\npain and lets her go.\nQuickly, Vanessa jumps back inside the camper.\n\nINT. CAMPER - CONTINUOUS ACTION\n\n                                                           48.\n\nVanessa slams the sliding rear door shut. And now... We\nsuddenly realize she has the key and remote! The crying\njust an act she put on to pickpocket Charles. Vanessa pushes\nthe remote. And...\n\n\nEXT. CAMPER - CONTINUOUS ACTION\nTHUNK go the DOOR LOCKS. Charles, still in pain, is\nsurprised to hear this. Feels his pocket. Realizes the key\nand remote are gone.\n                        CHARLES\n          Shit.\n                  (yells to Sona)\n          She got the key!\n\nINT. CAMPER - CONTINUOUS ACTION\nVanessa climbs into the driver's seat. Puts the key into\nthe ignition and STARTS the ENGINE. Puts it in \"D.\"\n\nCLOSEUP - ACCELERATOR PEDAL\nTo reveal Vanessa's rigged a soda can to the pedal. An\nextension for her short legs. As her foot tromps down on the\ncan...\n\nANGLE - CAMPER\ntakes off. The windows are blacked out and Vanessa can't\nsee where she's going. But she's going.\n\nINT. HANGAR - CONTINUOUS ACTION\nThe camper careens around the large space.   Charles\nscrambles after.\n\nINT. CAMPER - CONTINUOUS ACTION\nVanessa keeps driving blind, pedal to the metal.\n\nINT. HANGAR - CONTINUOUS ACTION\nThe CAMPER veers toward the rear wall.   And...\n... CRASHES into a support post.\nAs Charles yanks Vanessa from the wrecked van, unhurt...\n\n                                                           49.\n\n\nINT. KOREAN CLUB - DAY\nA hostess bar, but very high-end. Beautiful women. Elegant\ndecor. Pumping MUSIC. No strip-club cheese. For extra\nmoney, private rooms for private pleasures. It's day, but\nthe place is wall-to-wall with Korean men.\nChambers' African-Americans maintain low visibility:   at the\ndoor, behind the scenes, counting the register, etc.\nODION, a dangerous-looking Chambers main man, moves through\nthe crowd to Daria, waiting near the front door.\n                        ODION\n          Delicious Daria.\n                         DARIA\n          'Sup, Odion?\n                        ODION\n          Long time no see.\nThen, checking her out --\n                         ODION\n          Like cognac. Just getting better.\n                  (then)\n          So what brings you around?\n                        DARIA\n          ... Sometimes you need an old friend,\n          y'know?\n                         ODION\n          Got trouble?\n                        DARIA\n          ... With a capital 'T.'\n                       ODION\n          Tony Fait? Thought you and him were\n          tight. Bonnie and Clyde.\n                        DARIA\n          Used to be that way. Not treating me\n          right these days. The kid's all he\n          cares about.\n                        ODION\n          ... What do you want me to do?\n                        DARIA\n          ... Man, I don't know. Probably\n          nothing you can do. I just\n\n                                                     50.\n          thought...\n                  (then)\n          Hey, y'know, this is crazy. I don't\n          know what I was thinking. I\n          shouldn't even be here like this.\n          Sorry, Odion.\n\nDaria starts to go.   Odion stops her.\n                        ODION\n          Nah, hey, hold up. It's okay.\n                        DARIA\n          Back in the day... Just always seemed\n          like you and I had something special\n          between us.\n\n                        ODION\n          Didn't know you thought so.\n                        DARIA\n          I always cared for you, Odion.\n          That's why I'm here.\n                        ODION\n          ... You looking for a job?\n                        DARIA\n          I need something.\n                        ODION\n          ... So maybe you could work here.\n                        DARIA\n          Here?... Oh, man, I don't know.\n                        ODION\n          You were the best. Not many girls\n          pulling in two g's a night.\n                        DARIA\n          Yeah, but it's been a while for\n          that... Might not remember how.\n                        ODION\n          Just like a bicycle, baby.     You don't\n          forget that stuff.\nDaria considers it a moment.\n                        DARIA\n          Don't know how Jump'd feel about it.\n          Having me back.\n                        ODION\n          Hey, you let me worry about Jump,\n\n                                                            51.\n          okay?\n                  (then)\n          Meantime, why don't you come on in,\n          and you and me can, y'know, talk some\n          more about it.\n\nBeat.   Daria knows the look in his eyes.   Gets the subtext.\n                         DARIA\n          ... Just talk?\nOdion's drinking her in.\n                         ODION\n          ... No.\n\nA beat. Then, as Daria reaches out and slips her hand into\nOdion's, smiling at him --\n\nINT. SU'S T-BIRD - DAY\nSu and Archie.\n                        SU\n          They have boxing matches in the day?\n                        ARCHIE\n          Not exactly boxing. More dangerous.\n          No gloves. No rules. Big money.\n          Very illegal... Started holding 'em\n          during the daytime to fool the cops.\n                        SU\n          The man you remembered -- how do you\n          know he will be here?\n                         ARCHIE\n          I don't. But Chambers owns the\n          operation, so I figure it's a good\n          place to start.\n                  (then)\n          This is it.\nThey turn into...\n\nEXT. FIGHT CLUB - CONTINUOUS ACTION\nA cavernous industrial building.   Cars parked on the\nperimeter.\n\nINT./EXT. SU'S T-BIRD - CONTINUOUS ACTION\nAs they park --\n\n                                                            52.\n\n                        SU\n          How will you recognize him?\n                        ARCHIE\n          I didn't see his face.   But I'll know\n          his pinkie ring when I  see it. Ten\n          carats. Round cut with   square mount.\n          Good color and clarity.   I remember\n          thinking what it would  do to my face\n          if he hit me.\nOFF Su's dubious look, as Archie crams on a baseball hat to\nhelp disguise himself...\n\n\nINT. FIGHT CLUB - CONTINUOUS ACTION\nArchie and Su exit the car and approach a GUARD manning a\ngate to the fight arena beyond.\n                        SU\n          How do we get in?\n                        ARCHIE\n          Leave that to me.\nThen, to the Guard --\n                        ARCHIE\n          Hey, man, how you doing? Got a\n          fighter here I want to enter.\nSu shoots him a surprised look.\n                        ARCHIE\n          My man's gonna put the rest of these\n          bums to beddy-bye. He'll go in there\n          and get all Chinese on 'em -- the\n          teeth are gonna fly, the blood's\n          gonna run... Gonna be fun.\n                        GUARD\n          Whatever... You're number twelve,\n          Bruce.\nHe hands a card reading \"12\" to Su. As Archie and Su make\ntheir way toward the arena --\n                        SU\n          I didn't come here to fight.\n                        ARCHIE\n          You won't have to. That was just to\n          get us in.\n\n                                                                  53.\nThey reach the arena. It's also huge. Packed with men.\nHazy with smoke. Loud with betting, cheers and boos.\nA large, chain-link cage stands at the center of the room.\nInside, two battered and bloodied fighters are beating the\nshit out of each other.\n\nLike at    a Gallagher concert, front row fans have sheets of\nplastic    over their laps. Whenever a hard kick or punch\nlands,    the nearest fans quickly raise the plastic sheets to\nshield    themselves from flying blood.\n                          ARCHIE\n            Good day, over a million dollars'll\n            pass hands in here.\n\n                             SU\n            Find the ring.\n                             ARCHIE\n            Yeah.    Okay.\nHe looks around.      Lotta African-American males.\n                          ARCHIE\n            Could take a little while.\nAs Archie starts moving through the crowd, looking at hands,\nand Su follows...\n\nINT. PRIVATE ROOM - DAY\nDaria and Odion enter, and Odion closes the door. He starts\nto take her in his arms. Daria slows him up. Guides him\nback toward a sofa.\n                             DARIA\n            Sit down.\nOdion sits.\n                          DARIA\n            Put on some music.\nOdion puts a DISC in the STEREO.        Cranks up some HIP-HOP.\n                            DARIA\n            Nah.    Something slower.\nOdion SWITCHES MUSIC.        A SLOW TUNE fills the room.\n                          DARIA\n            That's good... Now just relax... And\n            watch...\n\n                                                            54.\nDaria just stands there a moment, getting her body into the\nmusic. Then starts dancing for him. Slow and sexy.\nAnd Odion's eating it up.\n\n\nEXT. ROOFTOP - DAY\nFait and Miles climb onto the roof with gear bags.   Via\nearwig mike --\n                            FAIT\n          Tommy.\n\nINT./EXT. PEST CONTROL TRUCK - DAY\n\nTommy's behind the wheel, wearing a pest control uniform.\n                        TOMMY\n          Here come da bug man.\n\nEXT. KOREAN CLUB - STREET IN FRONT - DAY\nThe DOORMAN watches Tommy drive up in the pest-control\ntruck, put on a respirator, get out, unreel 20 feet of pest\nspray hose from the truck and advance toward the door.\n                            TOMMY\n          Hey.    Howzit?\n                        DOORMAN\n          What the hell you doing?\n                        TOMMY\n          Pest control. Don't tell me you\n          didn't get your notice.\n                            DOORMAN\n          What notice?\n                        TOMMY\n          See, that burns my ass right to the\n          bone. I mean, hey, I'm here doing my\n          job... Anyway, putting that aside, if\n          you had gotten your notice, you'd\n          know there's a new city ordinance\n          saying all businesses catering to\n          foreigners gotta be sprayed.\n                          DOORMAN\n          Yeah?    How come?\n                        TOMMY\n          'Cause foreign people're bringing all\n\n                                                     55.\n          their scary-assed foreign bugs over\n          here. Y'know, in their luggage and\n          shit. And then the bugs're getting\n          loose and fucking everything up --\n          eating all the trees and everything,\n          y'know, making people sick... Anyway,\n          city says we gotta spray to prevent\n          any infestation and possible spread.\n                        DOORMAN\n          We're doing business inside. Can't\n          let you just start hosing the place\n          with bug spray.\n                        TOMMY\n          Yeah, well, maybe you should at least\n          ask the manager about it.\n                        DOORMAN\n          Manager's busy.\n                        TOMMY\n          ... Okay. Your call. Just know the\n          city quarantine people'll be here\n          first thing tomorrow.\n                        DOORMAN\n          Quarantine people?\n                        TOMMY\n          They'll be shutting you down for non-\n          compliance... Peace out.\nTommy starts to go.\n                        DOORMAN\n          Wait, wait, wait.\nTommy stops.\n                        DOORMAN\n          City's really gonna come and close us\n          up?\n                        TOMMY\n          Quicker'n a Zip-loc.\n                        DOORMAN\n          ... You sure you're not fucking with\n          me?\n                        TOMMY\n          I'm a licensed exterminator.   Why\n          would I be fucking with you?\nThe Doorman considers it another moment.   Then --\n\n                                                              56.\n\n                        TOMMY\n          Look. Let's do this. You let me\n          start with a couple small rooms,\n          y'know, offices or something,\n          someplace you don't have customers.\n          Upstairs, so the fumes don't bother\n          anybody. I'll pop off a couple bug\n          bombs, and then we'll do the rest\n          later. How's that?\nThe Doorman considers a moment.     Then --\n                        DOORMAN\n          ... Yeah, okay. Get the bombs, and\n          come on.\n\n\nINT. PRIVATE ROOM - DAY\nDaria keeps dancing. Peeling off layers now.    Showing skin.\nOdion's starting to salivate.\n\nINT. CHAMBERS' OFFICE - DAY\nWhat Chambers' cell is to a normal cell, this place is to a\nnormal office. No expense spared. (Think Joel again.) A\nlarge, \"Zen\" FOUNTAIN BURBLES meditatively in the center of\nthe room.\nThe door opens.   The Doorman admits Tommy, who looks around\nin amazement.\n\n                          TOMMY\n          ... Look.   At.   This.\n                        DOORMAN\n          Just do your thing and go,\n          bro.\n                          TOMMY\n          Roger that.\nHe positions the BUG BOMBS. Then.... PFFFT.     He sets off\none. PFFFT. The other. As he goes --\n                        TOMMY\n          Just keep the door closed and be sure\n          to give this shit a full hour before\n          anyone comes in.\nOFF the closing door...\n\n                                                              57.\nEXT. ROOFTOP - DAY\nFait and Miles grab gear bags and mobilize. Clip onto\nascender/descenders and lower themselves to a second-story\nwindow. A window into...\n\n\nINT. CHAMBERS' OFFICE - CONTINUOUS ACTION\nWhere the BUG BOMBS HISS away.\nFait tries the WINDOW. Locked shut. He quickly tapes it.\nBREAKS it. He and Miles climbs inside. Grab the bug bombs\nand toss them out.\nAs Miles locks the door, Fait opens a gear bag and pulls out\na folding metal detector. Uses it to scan the entire room\nquickly: floor, walls, ceiling... Gets LOW-VOLUME RING-OFFS\nfrom various hidden metal. But he's looking for something\nbigger.\nBLEEE.   He gets it when he sweeps past Chambers' big desk.\n                             FAIT\n             Safe.\nHe kneels.     Removes a desk panel.   And...\nThere it is.     The safe is small but highly secure.\n                             FAIT\n             Take it down.\nMiles finishes assembling a Barrett .50 caliber rifle. A\nbig gun. Opens an ammo box labeled \"Depleted Uranium. .50\ncal.\"\n\nINT. PRIVATE ROOM - DAY\nDaria's down to bare essentials -- still dancing slow and\nsexy for Odion.\n\nINT. CHAMBERS' OFFICE - DAY\nMiles loads one of the massive D.U. cartridges into the\nBarrett.\n                           MILES\n             Even with the music, they're gonna\n             hear it when I fire this tank buster.\n                             FAIT\n             Daria.   Get ready to move.\n                      (then)\n\n                                                                58.\n          Do it.\nMiles aims the BARRETT directly at the safe lock.      Miles\nFIRES. BIG BANG.\n\n\nINT. PRIVATE ROOM - DAY\nOdion starts.\n                          ODION\n          What was that?\n\nINT. CHAMBERS' OFFICE - DAY\n\nBasically, the lock's just gone. Melted. Burned through by\nthe DU slug. Fait swings the safe door open.\n\nINT. PRIVATE ROOM - NIGHT\nOdion's heading out the door. When he stops.       Looks back at\nDaria. A realization dawning.\n                        ODION\n          'Sometimes you need an old friend'...\nHe steps toward Daria.    Backhands her.   Hard.   Then opens\nthe door.\nA CHAMBERS MAN outside the door addresses Odion.\n                        CHAMBERS MAN\n          It came from the office.\n                         ODION\n          Watch her.   Don't let her leave.\nOdion goes. The Man enters. Shuts the door, leering at\nDaria, who starts putting on what she's taken off.\n\nINT. CHAMBERS' OFFICE - DAY\nFait's tossed the safe.     No stones.\n                          MILES\n          Not here?\n                          FAIT\n          They're here.    Somewhere else.\n                        MILES\n          What're you talking about?\n\n                                                              59.\n                         FAIT\n           I'm telling you, they're here.\n                         MILES\n           What're we gonna do?\n\n                           FAIT\n           Everyone out.\nFait's started searching the room.       Tearing it apart.\n                         MILES\n           What about you?\n                         FAIT\n           I gotta save Vanessa.     I gotta find\n           'em.\n                         MILES\n           I'm not leaving you.\n                           FAIT\n           Yes, you are.    Go.   Now.\nSomeone starts RATTLING the LOCKED DOOR.      Fait doesn't stop.\n                        MILES\n           T. Come on, man. They're outside.\n           Give it up.\n                         FAIT\n           Shut up and get the fuck outta here!\n           That's an order!\nMiles hesitates. Fait's unreachable. Chambers' men are\ntrying to break down the door. Miles goes. Out the window.\nOnto the ascender-descender. And gone.\n\nINT. PRIVATE ROOM - NIGHT\nDaria finishes dressing.     When...\n                         CHAMBERS MAN\n           ... Y'know, I got the big one...\nHer response is a front kick to the head. Followed by a\nspin kick, knocking him out. Then, stepping past him --\n                         DARIA\n           Keep it in your pants.\n\nINT. CHAMBERS' OFFICE - DAY\nCRASH!   Odion and his men break down the door.\n\n                                                               60.\n\nFait's still searching. Desperate to find the stones.\nDesperate to save his daughter. He fights off the first\nmen to reach him. A wild animal. Fights off another. And\nthen...\n\nThe guns are out.     All pointed at Fait. No stones. No exit.\n\nINT. KOREAN CLUB - DAY\nDaria walks out the front door.\n\nINT. CHAMBERS' CELL - DAY\n\nWilly Chickens hovers near Chambers, who is talking as he\neats another meal. Lobster. At first, we don't realize who\nChambers is addressing.\n                        CHAMBERS\n          ... If you're willing to pay five,\n          you're willing to pay ten.\n                           CHAMBERS (CONT'D)\n          You're    willing to pay ten, you're\n          willing    to pay twenty. Twenty,\n          forty.     Forty, eighty... I'm not\n          selling    till I know exactly where the\n          ceiling    is.\nWhereupon we see who he's talking to:     Ling.\n                        CHAMBERS\n          You like foreplay?\n                        LING\n          How much money do you want for the\n          stones?\n                         CHAMBERS\n          I hate foreplay. Fuck the warm-up\n          drills -- girl's gotta get in there\n          and be ready to score points. Bring\n          it straight to the motherfucking\n          hoop. You understand?\n                  (beat)\n          So, instead of us going back and\n          forth doing warm-ups, my idea's for\n          you to think of a number. A very\n          high number. A very final number. A\n          number so high and final it'll get me\n          off good, bam, right when I hear it.\nChambers hasn't looked at Ling the whole time.       Still isn't\nlooking. Forks up some lobster meat. When...\n\n                                                             61.\n\nChickens' face suddenly appears in front of him. And...\nLing slams a lobster claw deep into Chickens' neck. Chambers\ndoesn't wait for whatever's next. Jumps back. Fast for a\nbig man.\n\nBut Ling is much faster. Stronger. Deadlier. Quickly, and\nquietly beats Chambers like a drum. Chambers knows when it's\nfinally tent-folding time. Croaks surrender through the\nblood and swelling --\n\n                          CHAMBERS\n          Okay, okay...\nLing stops.\n\n                        CHAMBERS\n          Ain't worth my life... I'll take the\n          five and call it a game.\n\nINT. CELLBLOCK - OUTSIDE CHAMBERS' CELL - MOMENTS LATER\nLing emerges from the cell through the blankets. Closing\nthe blankets behind him. To the sentries, who've heard\nnothing --\n                         LING\n          Mr. Chambers is resting.   He says not\n          to bother him.\nOFF which, as Ling walks away...\n\nINT. CHAMBERS' CELL - DAY\nFIND Chambers. No one will bother him. Ever.       The lobster\nfork driven deep into the base of his skull.\n\nINT. FIGHT CLUB - DAY\nArchie still looking for the man with the diamond\npinkie-ring. Su still following.\n                        ARCHIE\n          ... By the way, when we do find him,\n          what then?\n                        SU\n          I'll handle it.\nIn the cage, a fight has just ended. The loser's\nunconscious and looks like he stepped into a spinning\nairplane propeller. The winner doesn't look much better.\n\n                                                            62.\nThe midget RING ANNOUNCER steps in with a mike.\n                        RING ANNOUNCER\n          Seven advances, eleven's out...\n          Next up, eight versus twelve. Eight\n          versus twelve. Fighters report to\n          the cage.\nAs Archie and Su continue the search --\n                        ARCHIE\n          You're after the stones, too, huh?\nNo response from Su.   Beat.\n                        ARCHIE\n          ... I did some more checking around\n          to see what anyone knows about 'em...\n          Guess who get back to me? My Defense\n          Department connection. Now, I think\n          he's calling me about this surplus F-\n          14 Tomcat I'm trying to get my hands\n          on. But no. Turns out he's calling\n          to tell me about a rumor outta Taiwan\n          about black stones --\nIn the ring, we see another bruiser waiting to fight as the\nmidget calls out --\n                         RING ANNOUNCER\n          Number twelve!\n                        ARCHIE\n                  (to Su)\n          -- only they're not jewels --\n                         RING ANNOUNCER\n          Number twelve!\n                         ARCHIE\n          They're --\nSuddenly, seeing the \"12\" card in Su's hand, a FIGHT CLUB\nFAN grabs his arm and raises it. Yells out --\n                        FIGHT CLUB FAN\n          Twelve's right here!\nSu pulls his arm back.\n                        FIGHT CLUB FAN\n          I'd be scared of him, too.\nSu glances into the ring, seeing the BRUISER for the\nfirst time. The Bruiser's beckoning.\n\n                                                            63.\n                        BRUISER\n          Let's go, chickenshit!\nSu waves them off.\n                          SU\n          Not today...\nThe catcalls start.    Archie leans into Su.\n                           ARCHIE\n          I know it    wasn't the plan. But if\n          you don't    fight, they're gonna toss\n          us out on    our asses. We might never\n          find the    guy.\n\nA long beat.    Su hates this place.   Su hates Archie.\n\nINT. KOREAN CLUB - DAY\nFait's in handcuffs. A big cut on his head. Being escorted\nby two COPS to the stairs leading out of the club. To\nOdion, as they pass him --\n                        COP #1\n          He's pretty beat up.\n                        ODION\n          Yeah. Fell down the stairs... Enjoy\n          the jail sex, Fait.\nAs they continue up the stairs --\n                        COP #2\n          Better have the E.M.T.s look at his\n          head.\n\nEXT. HOT DOG STAND (NEAR KOREAN CLUB) - CONTINUOUS ACTION\nNear, but not too close. The club visible in b.g. Daria,\nMiles, and Tommy watch as Fait is led into an ambulance.\nVia earwigs --\n                        DARIA\n          We're still here to help you, T.\n                        MILES\n          Anything you want us to do?\n\nINT. AMBULANCE - CONTINUOUS ACTION\nFait's heard.\n                          FAIT\n\n                                                               64.\n          Not yet.\nThe PARAMEDIC treating him doesn't understand.\n                         PARAMEDIC\n          What?\n\n                         FAIT\n          Nothing.\n\nCLOSEUP - BEHIND FAIT'S BACK\nHis cuffed hands.    Fingers feeling the inside of his belt.\nFinding a spot where a small rectangle has been cut into the\nleather. Popping out the rectangle to reveal a hollowed-out\nrecess in the belt. Where...\nFait has a hidden handcuff key.\n\nCLOSEUP - ANOTHER SET OF HANDS\nstruggling against their duct-tape bonds.   REVEAL...\n\nINT. CAMPER - DAY\nVanessa's hands are taped together behind her back. There's\ntape around her feet. Tape over her mouth. The TV is ON\nnearby, but she's not watching.\nVanessa struggles a moment longer, but can't break the tape.\nFinally gives up trying. Just lies there. Tired and\nscared.\n\nINT. FIGHT CLUB - DAY\nDING! The crowd's yelling and betting as number eight\nleaves his corner and advances on Su.\nSu has nothing against number eight. He's just trying to\nbuy time. So he dodges his opponent. Not exactly\nrunning. Fighting by not fighting. A target one moment,\ngone the next. Again and again, number eight swings and\nmisses. Until...\nNumber eight delivers a knockout blow. Unfortunately\nit's against himself. The momentum of a missed punch\ncarries him headfirst into a metal post.\nNumber eight drops. As the referee counts over number eight,\nSu uses the chance to find...\n\n                                                             65.\n\nARCHIE\nstill checking out the hands of African-American men in\nthe crowd. Not making any friends as he does it.\n\n\nSU\nNumber eight's on his feet.    Moving in again.   When...\n\nARCHIE\nSuddenly, he sees it.    The ring.\n\n\nSU\ndodges number eight again. Then... Sees Archie signaling\nhe's found the guy. And... Gets nailed by number eight. A\nsolid hit. Exciting the crowd and pumping up number eight.\nWhereupon... Su turns to him and bows.\n                          SU\n          You win.\nSu turns, heads out of the cage. The crowd roaring its\ndisapproval. As... The midget Ring Announcer bars Su's\npath.\n                          RING ANNOUNCER\n          No quitting.    Get back in there.\nSu moves him aside. The midget resists. Five other waiting\nfighters come to the midget's aid. Forcing Su back into the\ncage. Where... It's now Su against them all.\n\nHOT DOG STAND - DAY\nDaria, Tommy and Miles wait. Two     extreme MOTO-RIDERS\ndressed in leathers have pulled up    in a truck and gotten out\nto eat. In the back of the truck     is a motorcycle and a\nfour-wheel ATV. The two men Ogle     Daria. To her --\n                          MOTO-RIDER #1\n          Looking good.\nShe ignores them.     To each other, so she can hear --\n                          MOTO-RIDER #2\n          Nice rack.\n                        MOTO-RIDER #1\n          Like the upstairs, like the basement,\n\n                                                              66.\n          too.\n                        DARIA\n          Shut up, assholes...\n\n\nINT. AMBULANCE - CONTINUOUS ACTION\nFait's heard. Looks past the Paramedic. Past the Cops\ntalking outside. Sees the hot dog stand in b.g. Sees the\ntruck with the motorcycle and ATV parked near the stand. The\nParamedic finishes bandaging Fait. To the cops outside --\n                        PARAMEDIC\n          He's all patched up.\n\nA Cop calls inside to Fait.\n                           COP #1\n          Let's go.\nFait stands.     Starts out.   Into his mike --\n                        FAIT\n          Get ready to move.\nAnd we see...\nThe handcuffs aren't on him anymore.\n\nEXT. AMBULANCE - CONTINUOUS ACTION\nFait reaches the rear doorway.      When...\nHe jumps. Knocks one Cop down.      Shoves another aside.   And\ntakes off running.\nFait's caught the cops completely by surprise. It takes a\nfew moments before the cops give chase, some on foot, others\nby car.\n\nANOTHER ANGLE\nFait runs toward the truck parked by the hot dog stand.\nTo Daria, Miles and Tommy, looking on --\n                           FAIT\n          Get the car.     Stay close.\nAs Daria, Miles and Tommy quickly mobilize, Fait jumps into\nthe bed of the truck. Jumps on the ATV. IGNITION.\nThe Moto-Riders suddenly realize what's happening.\n\n                                                           67.\n\n                          MOTO-RIDER #1\n          Hey!\nToo late. Fait blasts out of the rear of the truck.   Right\nthrough the nylon mesh tailgate.\n\nFait flies from the truck bed. Lands on the hood of a\npolice car. Gets big air off the windshield. Clears the\nrest of the car and grabs pavement with all four wheels.\nAs Fait tears off, and cop cars follow, one of the Moto-\nRiders jumps into the bed of the truck and climbs aboard the\nremaining motorcycle. His friend calls to him --\n                        MOTO-RIDER #1\n          Don't let that fucker get away!\nThe Moto-Rider FIRES UP the MOTORCYCLE. Drops it into\nfirst. Dittoes Fait's leap out the back and SCREAMS off in\npursuit.\n\nINT. CAMPER - DAY\nVanessa still taped up.    TV still ON.   When...\n                        TV ANCHOR (V.O.)\n          ... We go now to this breaking\n          story...\nANGLE TO INCLUDE TV\nAiring a chopper shot tracking Fait on the ATV.\n                        TV ANCHOR (V.O.)\n          ... You're watching a man on an all-\n          terrain vehicle leading police in a\n          high-speed chase through downtown Los\n          Angeles. An L.A.P.D. spokesman says\n          the man, Anthony Fait --\nVanessa looks over in surprise.\n                        TV ANCHOR (V.O.)\n           -- commandeered the A.T.V. after\n          escaping from police officers while\n          being treated at a local hospital for\n          injuries resulting from his earlier\n          arrest for robbery... And this is\n          certainly one of the wildest chases\n          we've witnessed here in L.A...\n\nEXT. DOWNTOWN LOS ANGELES - VARIOUS SHOTS - DAY\n\n                                                               68.\nWHOOOM! Fait's flying. Seventy-plus. Down streets,\nsidewalks, squeezing through places police cars can't.\nOver, under, around, through -- doesn't matter. The ATV's\nfast, strong and maneuverable.\n\n\nOne problem: so is the moto-cross bike.     The guy's right on\nFait's ass. Matching move with move.\nOverhead, police choppers follow Fait's every move. While\non the ground other police vehicles move to block his path.\nBut whenever Fait meets a roadblock, he somehow finds an\nescape. At one point, he uses an outdoor escalator. At\nanother point he blasts through the Hotel Bonaventure.\nThis'll be a news highlight for days to come.\n\n\nINT. FIGHT CLUB - DAY\nThe place is bedlam. In the crowd, bets are going down on\nthe battle royal, now in full effect inside the cage. Su\nversus the five fighters. And the midget.\nThe different fighters use different fighting styles against\nSu. Kickboxing, grappling, aikido, kali, American street\nfighting...\nSu uses all his own skills and whatever's at hand. At one\npoint he engineers it so one opponent turns on another\nopponent. At another point, Su wields the midget like a\nfighting staff.\nOne by one, Su starts reducing the opposition.\n\nEXT. DOWNTOWN LOS ANGELES - VARIOUS SHOTS - DAY\nFait's everywhere.   And so is the moto-bike.   Still on his\ntail.\nFait veers inside a building.   The bike follows.\n\nINT. BUILDING - VARIOUS SHOTS - CONTINUOUS ACTION\nFait and the moto-bike ascend the stairs.   One floor.   Two\nfloors. Up and up.\nFait reaches the top-floor hallway.   Nowhere left to go\nexcept...\nOut the window at the end.   And...\nThat's just where he goes.\n\n                                                              69.\nAnd where he goes, the moto-bike goes.\n\nEXT. DOWNTOWN LOS ANGELES - ROOFTOPS - CONTINUOUS\nThe ATV and the moto-bike make the first leap.    Onto the\nroof of a next-door building.\nFrom there, it's rooftop to rooftop.    Jump after jump.\nLonger and longer. Until...\nThe MOTO-BIKE eats it in a spectacular CRASH.     The moto-\nrider walks away, but his chase is over.\n\nEXT. DOWNTOWN LOS ANGELES - VARIOUS SHOTS - DAY\n\nFait's ATV SCREAMS down another street, still chased by\ncops. Into his mike --\n                          FAIT\n           Yo.\n\nINT. DARIA, MILES AND TOMMY'S CAR - DRIVING - DAY\n                          DARIA\n           Here.\n                         FAIT\n           Above ground parking garage in\n           Chinatown?\n                          MILES\n           Know it.\n                          FAIT\n           Get there.\n\nINT. FIGHT CLUB - DAY\nIt's down to Su and the kick boxer.    The kick boxer spins\nand kicks and punches, and...\nSu just ties the guy up in his own clothes.    Ties him into a\npretzel. Cinches him tight. Then...\nLooks for Archie.     Can't find him. Can't find the guy\nwearing the ring.     And hurries out of the cage.\n\nEXT. PARKING GARAGE - DAY\nFait jukes the ATV in the entrance.    Up the spiral ramp.\n\n                                                             70.\n\nMoments later, police CARS SKID up and seal the entrance.\n\nINT. CAMPER - DAY\n\nOn TV, a chopper shot of the garage surrounded by police.\n                        TV ANCHOR (V.O.)\n          ... And it looks like this chase will\n          end here, as police seal off the\n          building...\nOFF Vanessa, watching...\n\n\nINT. FIGHT CLUB - DAY\nSu runs into the parking area. Archie's in the T-bird.\nSitting, a little unnaturally in the front.\n                         SU\n          Where is he?\n                        ARCHIE\n          Decided to leave early.\n                         SU\n          Where'd he go?\n                         ARCHIE\n          Right here.\nSu looks inside the car.\n\nANGLE - CAR\nWhere Archie sits atop the man with the diamond pinkie ring.\nHolding a STUN GUN to the guy's cheek.\n                        ARCHIE\n          Good thing I brought my stunner.\nHe ZAPS the air.    Then puts it back to the guy's cheek.\n                        ARCHIE\n          Okay, bud, wanna start the Q and A?\n\nINT. CAMPER - DAY\nOn TV, the chopper zooms in on a familiar car, as it rolls\ndown the exit ramp toward the police barricade.\n\n                                                                71.\n                        TV ANCHOR (V.O.)\n          ... Here's a car coming down the exit\n          ramp...\nWe see the police approach the car.\n\n                        TV ANCHOR (V.O.)\n          ... The police apparently talking to\n          the driver...\nThe police let the car pass.\n                        TV ANCHOR (V.O.)\n          ... Now letting this car drive on as\n          the search inside continues...\n\nVanessa notices something about the car.     Looks carefully.\nWhen...\nThe car turns, giving the news chopper a better zoom angle\nof the people inside, and...\nVanessa sees Daria, Miles and Tommy.\nWhich could mean only one thing:    her daddy's safe.   And\nsoon he'll be coming to get her.\nWith a rekindled hope inspired by her father's escape,\nVanessa now looks for a way to free herself from her duct-\ntape bonds. When, just as it's about to seem hopeless\nagain, her eyes go to...\nHer necklace.   The chain and pink diamond pendant.\nVanessa bends over    and lowers her head until the necklace\nslides off onto the    bed. Then turns around and  picks up the\nnecklace behind her    back. Holding it as taut as  she can\nbetween her hands,    she begins sawing away at the tape around\nher wrists.\n\nEXT. NEAR KOREAN CLUB - HOT DOG STAND - NIGHT\nThe gang's all here.    All eyes on the club.\n                        FAIT\n          I knew the stones were in there.\n                        TOMMY\n          Question is, how do we get 'em out?\n          Place is slamming nonstop.\nA long beat.    Fait doesn't answer.\n                        SU\n          Something isn't right.\n\n                                                                  72.\n\n                         FAIT\n          Yeah.   That's what I'm getting.\n                          SU\n          The doorman.\n\n\n                         FAIT\n          ... Where the hell is he?\n                  (then)\n          Everyone stay put.\nOFF which, as he and Su go --\n\n\nINT. KOREAN CLUB - UPSTAIRS HALL - NIGHT\nMUSIC pumps downstairs as Su and Fait cautiously move down\nthe hall toward Chambers' office.\n                        FAIT\n          No Chambers' guys.     I don't get it.\nThey reach the closed office door, where they stop and\nlisten. Hear nothing.\nSu and Fait exchange a \"ready-ready\" look.     Then Su opens\nthe door.\n\nINT. CHAMBERS' OFFICE - CONTINUOUS ACTION\nSu and Fait enter, unchallenged, to find...\nOdion and the other Chambers' men.    Dead.   Skull shot.\n                          FAIT\n          I get it now.\nSu ignores the bodies, quickly moves to the Zen fountain,\nwhere he reaches into the water and begins searching the\nrocks lining the bottom. Beat. Then --\n                        FAIT\n          Are they there?\nSu doesn't answer, still searching.\n                        FAIT\n          No. This can't fucking happen.      They\n          gotta be there.\nAnother beat. Then, at last, Su holds something up:         one\nblack stone. It takes Fait a moment to understand.\n\n                                                                 73.\n                              FAIT\n             ... What?     That's it?\n                           SU\n             The rest are gone.\n\nFait can't believe it.\n                           FAIT\n             ... What the hell happened?        Who got\n             'em?\n                             SU\n             ... Ling.\n                           FAIT\n             How do you know?\n                             SU\n             I know.\n                           FAIT\n             ... How'd he get here before us?\n                             SU\n             He's good.\nBeat.   Failure.       Summed up in one word:\n                           FAIT\n             Vanessa...\n                     (then, trying)\n             He has the stones. There's      no reason\n             to keep her. Hell, she's a      little\n             girl, she's eight years old     -- she\n             can't hurt him. He can let      her go...\n             He can just fucking let her     go...\nSu just looks at him.        Not a chance.   And he knows Fait\nknows it, too.\nIt's over.     For Fait, it's as if his life just ended.\n                           FAIT\n             ... What the hell am I gonna do?\n                           SU\n             ... We need to go.\nFait doesn't move. Then, suddenly, it all explodes as rage,\nand Fait picks up the large, stone ball spinning atop the\nfountain and, screaming, hurls it into a large display of\nexotica, destroying it.\nBeat.   Fait looks at Su, who meets his eyes.          Then --\n\n                                                            74.\n                         SU\n          Come on.\nOFF which, as Su mobilizes him, and they go...\n\n\nINT. HANGAR - NIGHT\nLing pours the black stones out on a table.   To Sona and\nCharles --\n                        LING\n          We're back in business.\n                       CHARLES\n          Good. I don't have to baby-sit much\n          longer.\n                         SONA\n          I hate kids.\n                        LING\n          Is everything else ready?\n                        SONA\n          We just have to test the device.\nRussell, who's been working on his scientific contraption\nnearby, speaks up.\n                         RUSSELL\n          Dye master oscillator. And not test,\n          calibrate. Which I'm now ready to\n          do... Goggles.\nWhen the goggles are on, Russell hits a switch.   And...\nInside the contraption, brilliant green laser BEAMS begin\nbombarding a sensor. OFF which...\n\nINT. CAMPER - NIGHT\nVanessa succeeds in using the necklace   as a saw to free her\nwrists from the duct-tape. She quickly    rips the tape from her\nmouth. Untapes her ankles. Then tries     to figure out what to do\nnext. Begins searching the camper for    anything that might help\nher escape or fight. When...\nLooking through the glove box, she finds a cell phone. An\nold model. So old, it takes her a moment to figure out\nexactly what it is. Then she pushes \"Power,\" and...\nThe phone turns on.    Sort of.\nCLOSEUP - CELL PHONE\n\n                                                                75.\n\n\"Low Batt\" flashes on the screen.\nINT. FAIT'S LIVING ROOM - NIGHT\nRock bottom.\n\nFait's desolate, sitting on the sofa, staring off.      Daria\ntries to comfort him, but it doesn't help.\nMiles and Tommy stay close and stay silent.\nEven Archie's quiet for once.\nThe only noise is Su, speaking into a cell phone in Chinese\nto someone who is obviously his superior.\n\n                        SU\n          ... I lost the stones. Ling has\n          them... I don't know where he is... I\n          have no way to find him... What do\n          you want me to do?\nUnder which, the PHONE begins to RING.    And...\nFait's too upset to care about answering.\n\nINT. CAMPER - NIGHT\nVanessa's on the old cell phone.    We hear RINGING on the\nother end.\n                        VANESSA\n          ... Answer, Daddy, answer...\n\nCLOSEUP - PHONE\n\"Low Batt\"... \"Low Batt\"...\n\nINT. FAIT'S LIVING ROOM - NIGHT\nThe PHONE'S still RINGING.    After another moment...\n                        MILES\n          Want me to get that?\nWhich finally mobilizes Fait to reach over and answer.\n                        MILES\n          Hello.\nINTERCUT WITH:\n\n                                                               76.\n\nINT. CAMPER - NIGHT\nVanessa whispers urgently.\n                         VANESSA\n          Daddy?\n                         FAIT\n          Vanessa!\nWhich gets everyone's attention.\n                         VANESSA\n          Come get me!   Please!   I want to go\n          home!\n\n                        FAIT\n          Okay, baby, okay. Just calm down.\nUnder which, in b.g., Su quickly ends the phone call to his\nsuperior. Still in Chinese --\n                        SU\n          I'll call you back.\n                         FAIT\n                  (continuing, to\n                   Vanessa)\n          Where are you?\n                        VANESSA\n          I don't know. I'm in a van inside a\n          big building. They painted the\n          windows. I can't look out.\n                         FAIT\n          Try.   Try to see something.\nVanessa puts her eye to the window.    Finally finds a small\ngap in the paint.\n\nVANESSA'S POV\nFew details. Just some chairs and bright green light from\nRussell's contraption.\n\nCLOSEUP - VANESSA'S PHONE\n\"Low Batt\"... \"Low Batt\"...\n\nBACK TO SCENE\n\n                                                77.\n                          VANESSA\n          I see chairs.    And there's green\n          light.\nFait repeats for the others' benefit.\n\n                        FAIT\n          You see chairs and green light?\n          Where's the light coming from?\n                          VANESSA\n          I can't tell.\n                          SU\n          Is it bright?\n\n                        FAIT\n          The green light, baby -- is it\n          bright?\n                         VANESSA\n          Yeah.   Really, really bright.\n                        FAIT\n                  (to Su)\n          It's real bright.\n                          VANESSA\n          Daddy, hurry!    I'm scared!\n                          FAIT\n          I know, baby.    Just hang in there\n\nCLOSEUP - VANESSA'S PHONE\nFait's voice drops out as the battery dies.\n\nBACK TO SCENE\n                         VANESSA\n          ... Daddy?!   Daddy?!...\nEND INTERCUT.\n                        FAIT\n          ... Vanessa?... Vanessa!... Shit!\nFait slams the phone down in frustration.\nBut Su's mind is on what she told them.\n                        SU\n          ... He's doing it here.    Tonight.\n\n                                                  78.\n                        TOMMY\n          What?\n                         SU\n          Selling the stones... A dye laser\n          emits green light. He needs it to\n          activate them.\n                        MILES\n          What the hell you talking about?\n                        DARIA\n          What are these stones?\nArchie answers it.\n\n                        ARCHIE\n          Doomsday in disguise.\nAll eyes go to him.\n                         ARCHIE\n          They're some kinda new synthetic\n          plutonium. Small and portable, but\n          mega-powerful.\n                        TOMMY\n          This fucker's making bombs?\n                        SU\n          Not making them.\n                        ARCHIE\n          Yeah, he'd need a big operation for\n          that. Why bother? Just demonstrate\n          the stones work and sell 'em to\n          whichever international scumbag\n          offers the highest bid. He makes\n          millions, they make the bombs,\n          then... 'look out, world.'\n                        FAIT\n          ... Okay, so we know what he's up to.\n          How's it get us to Vanessa?\nSu considers it a moment.\n                        SU\n          The buyers will want to arrive and\n          leave quickly... Somewhere private...\n          Accessible by aircraft.\n                        FAIT\n          Vanessa said she's inside a big\n          building. Could be a hangar.\n\n                                                             79.\n                        MILES\n          Man, there's dozens of little\n          airports around here. We'd never get\n          to 'em all.\n                        SU\n          ... Flight plans.\n                        ARCHIE\n          Hey, yeah. Flight plans show\n          destinations. All aircraft file 'em\n          with the Aviation Administration. If\n          we could get a list, we could maybe\n          figure out where the sale's going\n          down.\n\n                        FAIT\n          ... Daria, call the aviation people.\n          Use our L.A.P.D. credentials. We\n          need flight plan info for all private\n          aircraft in this area tonight...\n          Everyone else get ready to move...\n          Miles, the no-gun policy's revoked.\n          You break out the heat... Tommy, you\n          gotta get us a diversion.\n                        ARCHIE\n          I can help with that.\n                        FAIT\n          ... Do it all fast.\n\nINT. HANGAR - NIGHT\nLing, Sona, Charles, and Russell.\nRussell finishes testing his contraption.    Switches it OFF.\nThen, removing his goggles --\n                        RUSSELL\n          We're operational.\nThe others remove their goggles.    Sona checks her watch.\n                        SONA\n          The buyers arrive in less then an\n          hour.\nBeat.   Ling holds up a black stone and examines it.\n                        LING\n          ... So small. So deadly... We're\n          selling conscience for money...\nA look at the others.   Serious.   Then a broad smile of\n\n                                                             80.\nconsummate satisfaction suddenly spreads across his face.\n                         LING\n           ... But it's a lot of money...\nBeat.   He puts down the stone.    A glance at the camper.\n\n                         LING\n           Be ready to kill the girl and go as\n           soon as the sale's over.\n\nCLOSEUP - TOPOGRAPHICAL MAP OF LOS ANGELES AREA\nFait's finger indicates a spot.\n\n                         FAIT (O.S.)\n           Wick Airfield...\nPULL BACK TO...\n\nINT. FAIT'S OFFICE - NIGHT\nFait, Su, Daria and Miles.\n                         FAIT\n           ... Five private choppers arriving\n           tonight within minutes of each other.\n                         DARIA\n           Sounds like our best shot.\n                         FAIT\n           .. It better be, or my baby's dead.\nHe and Su exchange a look.     Then --\n                         FAIT\n           Let's go.\n\nCORPORATE HELICOPTER - NIGHT\nNoselight beaming, the chopper lands next to four other\nhigh-end biz copters, including an Agusta A109, outside the\nhangar, where the bruised Ling killers stand guard.\n\nINT. CAMPER - NIGHT\nVanessa peeks through a void in the paint covering the\nwindows.\n\nVANESSA'S POV - HANGAR\n\n                                                            81.\n\nAn internationally-diverse group of men -- some occupying\nthe chairs, some studying the contraption, some clearly\nmuscle. Across the room, Sona and Ling greet the new\narrivals.\n\nIn all, sixteen men have arrived for the sale. There are\nfive buyers -- one RUSSIAN, one AFRICAN, one PAKISTANI, one\nEGYPTIAN, one FRENCH. The French Buyer is in a wheelchair.\nEach buyer has brought with him one right-hand man and one\nto three bodyguards.\nVanessa SHIFTS her VIEW, REVEALING...\nCharles standing nearby.    Too close for her to escape.\n\nCharles turns, and...\n\nBACK TO VANESSA\nQuickly, before Charles can see her, she steps away from the\nwindow.\nThere's no way out.\n\nEXT. FAIT'S PORSCHE - NIGHT\nDriving.   Daria and Miles following in their car.\n                         FAIT (V.O.)\n           So tell me... How the hell's Taiwan\n           fit into all this?\n                         SU (V.O.)\n           One of our scientists made the\n           stones. Tried to go into business\n           for himself. We stopped him.\n           Recovered the stones... Ling betrayed\n           us. He took them.\n                          FAIT (V.O.)\n           Ling?   He was one of you?\n                         SU (V.O.)\n           We were partners. Six of us. He\n           killed the others. He thought he\n           killed me, too.\n                          FAIT (V.O.)\n                   (beat)\n           So what're you really after -- the\n           stones or the payback?\n                         SU\n\n                                                            82.\n          Both.\n                        FAIT (V.O.)\n          ... Yeah... Let's get it all.\n\n\nINT. HANGAR - NIGHT\n                        LING\n          You're the world's foremost arms\n          dealers. You all know that weaponry\n          equals power. And in the world of\n          weaponry, nukes rule.\n                        (MORE)\n                        LING (CONT'D)\n          But nuclear material is hard to\n          obtain and difficult to handle... But\n          what if it weren't?... That's the\n          question that brought you here\n          tonight... And here's the answer.\nLing holds up a single stone.\n                        LING\n          In its present state, it's completely\n          inert. Zero radiation, zero\n          volatility...\nWhereupon Ling places the stone on a piece of velvet on a\ntable. Folds the velvet over. Then, whack, hits it hard\nwith a mallet.\nHe unfolds the velvet.   The stone's smashed to pieces.\nLing picks up a sliver of stone and hands it to Russell, who\nplaces the sliver inside a small ceramic capsule, then\ninserts the capsule into his contraption.\n                         RUSSELL\n          Goggles on.\nEveryone puts on goggles. Then Russell hits the switch, and\nthe green lasers bombard the capsule containing the sliver\nof stone, which begins to glow.\nRussell announces each passing threshold as a numerical\nreadout on the contraption races up the scale --\n                        RUSSELL\n          ... Firecracker... .44 magnum...\n          R.P.G... Sidewinder... SCUD...\n          Tomahawk... Daisy Cutter...\n          Hiroshima... two Hiroshimas...\nAnd it just keeps going.   Until, finally --\n\n                                                             83.\n\n                         RUSSELL\n           ... New World Order.\nAs the buyers absorb this...\n\nRussell shuts off the beams.\n                           RUSSELL\n           Goggles off.\nRussell removes the capsule and hands it back to Ling, who\nholds it up.\n                            LING\n           One small    fragment. Transformed into\n           a source    of immense energy. More\n           powerful    than weapons-grade plutonium\n           a hundred    times its size.\nA beat as this sinks in.\n                         SONA\n           The purpose of today's sale is to\n           begin trading a new commodity on the\n           black market and establish its\n           value... There are fifty stones\n           available in the first sale. The\n           opening price is one million per\n           stone... Bids, please?\nThe buyers indicate their bids both aloud and by using hand\nsignals a la traders in a commodities exchange pit. At the\nsame time, they're all crunching the numbers on calculators.\nLing looks on as Sona runs the sale, and Russell uses a\nlaptop to input data and develops supply and demand market-\nanalysis for Sona to consult.\nThe pace starts out slowly and unevenly as the buyers feel\nout the situation.\n                         RUSSIAN BUYER\n           Five at one million.\nSona is silent.   Silence means \"No.\"\n                         AFRICAN BUYER\n           Five at one-point-two.\nSilence.\n                         PAKISTANI BUYER\n           Three at two million.\n                           SONA\n\n                                                             84.\n           We'll take that.\n                         FRENCH BUYER\n           Six at one-five.\nSilence.\n\n                         EGYPTIAN BUYER\n           Ten at two million.\nSilence.\n\nEXT. WICK AIRFIELD - FAIT AND DARIA - NIGHT\nNear their cars.\n\n(NOTE: From now until the battle's over, it's night. At\nthe airport, Fait, Su and Fait's team will all communicate\nvia earwigs.)\n                         FAIT\n           Miles, what do you see?\n\nEXT. AIRFIELD - ROOF\nAtop the building next to Ling's hangar. The five choppers\nrest on the wide tarmac below, between the two buildings.\nMiles scans Ling's hangar through the scope of a silenced\nsniper rifle.\n\nSNIPER-SCOPE POV - NO NIGHT VISION\nFINDING the Ling killers outside the hangar.\n                         MILES (V.O.)\n           Two sentries my side.\nThen, scanning inside Ling's hangar THROUGH windows --\n                          MILES (V.O.)\n           Sale's at this end... There's a\n           camper with painted windows. Middle\n           of the hangar.\n\nEXT. AIRFIELD - FAIT AND DARIA\n                         FAIT\n           Vanessa said she was in a van.\n           That's gotta be it.\n                   (to Daria)\n           When we get her, you move her outta\n\n                                                              85.\n           there fast.\n                         DARIA\n           I'll keep her safe.\n\n\nEXT. HANGAR\nSu's reached the top of outside stairs.    Opens a door and\nenters.\n\nINT. HANGAR - CONTINUOUS ACTION\nHigh above the floor, Su steps onto a catwalk.    The sale\ncontinuing below. More heated now.\n\n                         RUSSIAN BUYER\n           Eight at three.\nSilence.\n                         FRENCH BUYER\n           Nine at three.\nSilence.\n                         EGYPTIAN BUYER\n           Ten at three-one.\n                         SONA\n           We'll take that... There are now\n           thirty-seven stones available.\nAnd now, in more and more rapid-fire succession --\n                         AFRICAN BUYER\n           Five at three-five.\n                         PAKISTANI BUYER\n           Eight at three-five.\n                         FRENCH BUYER\n           Twenty at three.\n\nEXT. AIRFIELD - FAIT AND DARIA\n                          FAIT\n           Miles.   Sentries.\n\nMILES\nis already sighted in.   PULLS the TRIGGER.   PHUT!\n\n                                                             86.\n\nSENTRIES\nOne Ling killer takes a leg hit and goes down.\nBefore the second killer has time to react, he catches a\nBULLET in the shoulder.\n\nMILES\n                          MILES\n           Done.\n\nFAIT AND DARIA\n\n                         FAIT\n           Tommy and Archie. Watch out for the\n           camper. Punch it.\n\nINT. HANGAR\nThe sale's now a frenzy.\n                         PAKISTANI BUYER\n           Five at five million.\n                          RUSSIAN BUYER\n           Six at five.\n                          FRENCH BUYER\n           Seven at five.\n                          AFRICAN BUYER\n           Ten at five.\n                         EGYPTIAN BUYER\n           Ten at five-one.\n                          FRENCH BUYER\n           Five-two.\nWhen suddenly...\nKA-WHAM! Archie's Abrams TANK BLASTS through a wall and\ninto the hangar.\nArchie's head pops out of the driver's hole. At the same\ntime, Tommy pops up out of the turret and trains a mounted\nmachine gun on the stunned group.\n                         TOMMY\n           Freeze, motherfuckers!\n\n                                                             87.\nRussell watches the advancing tank.\n                           RUSSELL\n            I knew it!   I knew it!\n\n\nANGLE - BEHIND TANK\nFait and Daria enter through the hole in the wall using the\nAbrams for shelter.\n\nINT. CAMPER - CONTINUOUS ACTION\nVanessa peers out through a gap in the paint to see what's\nhappening.\n\n\nVANESSA'S POV\nCharles is drawn away by the advancing tank.\n\nBACK TO VANESSA\nShe looks back into the camper. Finds a heavy iron skillet\namid the stove utensils. Swings it. And...\nSMASH!    She SHATTERS a side WINDOW.\n\nMILES' SNIPER-SCOPE POV (NO NIGHT VISION)\nWe FIND Vanessa, jumping out of the camper.\n                          MILES (V.O.)\n            Vanessa's out of the camper.   Running\n            this way.\n\nINT. HANGAR - FAIT AND DARIA\nTo Daria --\n                          FAIT\n            Stay.\nAnd he's gone, sprinting after her just as...\n\nVANESSA\nreaches a button for opening and closing the giant hangar\ndoors. She jabs a button, and the nearest door begins to\nmotor open.\n\n                                                              88.\n\nCHARLES\nhears the OPENING HANGAR DOOR.    Turns.   Sees Vanessa and\ngoes after her.\n\n\nSNIPER-SCOPE POV (NO NIGHT VISION)\nVanessa rolls out under the rising door and runs.\n                          MILES (V.O.)\n          She's out.\nThen, FINDING Charles coming after her --\n\n                        MILES (V.O.)\n          There's a guy after her.\nPHUT!\n\nINT. HANGAR - CHARLES\nA BULLET rips through the collar of his leather coat. Just\nbehind his neck. Just missing him. But he keeps coming.\n\nSNIPER-SCOPE POV (NO NIGHT VISION)\nCharles rolling out under the door.\n\nMILES\nSHOOTS again.   PHUT!\n\nCHARLES\nThe BULLET RICOCHETS off the PAVEMENT right next to him. In\na flash, he's up and running. Heading out into the darkness\nof the airfield after Vanessa. Meanwhile, back inside...\n\nINT. HANGAR\nIn here, the hangar door continues to open as the tank makes\nits slow approach. Archie's not a great driver. Tommy\nsweeps the muzzle of the machine gun across the group.\n                          TOMMY\n          Just be cool!\nAt which point, Russell breaks for his five-ton truck.\n\n                                                             89.\n                        TOMMY\n          I said don't move, motherfucker!\nRussell just keeps going. Slides open the side door in the\nback of the five-ton, revealing... A twin-fifty machine gun.\nTwo barrels, .50 caliber. Dangerous even for a tank.\nRussell vaults in and takes aim.\n                        RUSSELL\n          Fucking amateurs!\nHe starts FIRING. People start running. .50 CAL. ROUNDS take\nbig CHUNKS out of whatever they hit.\n                        TOMMY\n          Shit!   What do we do?\n\n                          ARCHIE\n          Shoot back!\n                          TOMMY\n          How?\nThe question's answered for him.   He somehow does the right\nthing. And...\nTommy's MACHINE GUN begins RIPPING CHUNKS out of the FIVE-\nTON and EVERYTHING near it. Tommy's a horrible shot; the\ngun's more in control of him. But...\nRussell finally dies under a HAIL of HEAVY LEAD.\n                        ARCHIE\n          Twin .50's some major firepower.\n          How'd that little shit get one?\n                          TOMMY\n          Motherfucker.    Couldn't fucking\n          listen.\nINTERCUT WITH which...\n\nACROSS HANGAR\nLing and Sona are moving toward the limo. Ling has the\nstones. When... Su is there. Blocking the way. Sona\nattacks. Su easily blocks the counters. Knocking Sona back.\nNever taking his eyes off Ling. When...\nSona, who's fallen back against a buyer's bodyguard, quickly\ntakes the bodyguard's small, full-auto SCORPION and turns\nthe gun on Su.\nSu dives for cover as the BURST SHREDS the AREA where he'd\njust been standing. As Sona continues hunting Su... Su sees\n\n                                                              90.\nLing getting into the limo.    To Archie and   Tommy, as he\nsignals --\n                        SU\n          Don't let him get away!\n\nAs a result of which...\n\nTOMMY AND ARCHIE\nHaving just waxed Russell, see Ling in the limo. Tommy's .50\nis out of ammo. He switches to the .30 cal. tank's machine\ngun. As Archie steers toward the limo, Tommy begins BLASTING\naway.\n\n\nLIMO\nLing's trying to drive out, when the .30 CAL. SLUGS PUNCH\nHOLES in the LIMO. The tank keeps coming. Ling bails out as\nthe TANK CRUSHES the LIMO.\nINTERCUT WITH which...\n\nSU AND SONA\nPlay cat and mouse. Su rapidly runs out of room to hide.\nHe can't get away. Su stands. Faces her. Faces the\ninevitable. When...\nWHAM! Daria appears from nowhere. Kicks the gun from\nSona's hand. To Su, re: Ling, now running from the crushed\nlimo\n                          DARIA\n          Get him.\nSu goes after Ling.\nAnd now it's Daria vs. Sona.\nSona's a better fighter, but Daria's got passion on her\nside. It's a good fight. Until, at last, Sona finds the\nScorpion. She swings it up. And...\nDaria executes a sudden, improvised double move that strikes\nSona's arm in such a way as to cause her to point the\nSCORPION at herself, just as she FIRES. The burst rips\nthrough her chest and kills her.\nAnd now, here's what's been going on outside...\n\nEXT. AIRFIELD\n\n                                                                91.\n\nAs Charles runs from the hangar, chasing Vanessa across the\ntarmac into the darkness of the airfield...\n\nMILES\n\nflips to NIGHT VISION on the sniper-scope.    And...\n\nSNIPER-SCOPE POV - NIGHT VISION\nCharles and Vanessa become clearly visible. Charles is\nclosing in on her. Cross-hairs FIND him. PHUT!\n\n\nCHARLES\nThe BULLET knocks his gun from his hands.    Charles is slowed\nbut keeps going.\n\nSNIPER-SCOPE POV - NIGHT VISION\nCharles reaches the flight line. Parked planes, a gas\ntruck, a shed, etc. He disappears behind the equipment.\n\nMILES\nsweeps the rifle, looking for Charles and Vanessa.     He comms\nFait.\n                        MILES\n          Lost 'em behind the gas truck.\n\nCHARLES\nstops behind the gas truck.   Looks around for Vanessa.    No\nsign of her. Until...\nCharles notices the door to the gas truck isn't closed all\nthe way. He whips it open. And...\nThere's Vanessa, hiding inside.\nCharles grabs her.   Yanks her out struggling and kicking.\n                        CHARLES\n          Time to end this my way.\nAnd then...\n                        FAIT (O.S.)\n          Drop the girl.\n\n                                                              92.\n\nCharles looks over.    Fait is there, holding a gun on him.\nVanessa's relieved and excited to see her father.\n                          FAIT\n          Put her down.\nCharles lowers Vanessa to the ground.    He releases her.\n                          VANESSA\n          Daddy!\nVanessa runs to her father. Dives into his arms. It's a\nlittle more energetic than Fait was expecting. And...\n\nSuddenly, Charles uses the distraction to rush in behind\nher. He hits Fait hard. A kick sends the gun flying.\nCharles keeps coming. Charles keeps pounding.\nFait's hampered by Vanessa. She won't let him go. Fait\nstays between Charles and Vanessa. Guarding his little\ngirl. Barely managing to fend off Charles, a seemingly\nunstoppable force.\nThe fight winds through the planes, under wings, through\nstruts.\n\nSNIPER-SCOPE POV - NIGHT VISION\nFait, Charles and Vanessa.    No clear shot.\n\nMILES\ncomms Fait.\n                          MILES\n          No shot.\n\nFAIT, CHARLES AND VANESSA\nThe fight continues.   Fait's suffering under Charles' brutal\nattack. When...\nVanessa causes Fait to stumble near a plane.   They fall.\nCharles moves in. And...\nFait's hand goes to a set of chocks set against the plane's\nwheel. The chocks are two heavy wooden blocks connected by\na length of nylon rope.\nFait turns to Vanessa.\n\n                                                            93.\n                         FAIT\n          Don't move.\nFait jumps to his feet. Swinging the chocks. Not quite\nlike nunchakus; more like a medieval mace. And now, all of\nFait's fury comes pouring out as he uses the chocks to beat\nthe living shit out of Charles. Charles tries to fight\nback, but he's out-matched by the chocks and Fait's emotion.\nThe punishing blows land like Thor's hammer. Until...\nA mighty swing nearly takes Charles' head off. Charles is\nunconscious before he hits the ground. Fait stands over\nCharles. Tosses the chocks down.\n                          FAIT\n          Wrong kid.    Wrong dad.\n\nFait turns. He moves back to where Vanessa's still hiding.\nHe scoops her up. And... Father and daughter hold each\nother tight. Forever. During all of which, also INTERCUT...\n\nEXT. HANGAR\nLing, having just escaped being crushed in the limo, runs\nout just as... Four helicopters take off, one after the\nother, carrying the buyers away.\nThe fifth chopper, an AGUSTA A109, is POWERED UP, waiting\nfor the wheelchair-bound French Buyer, being helped by a\nbodyguard.\nLing intercepts them. Knocks out the bodyguard and tips\nover the Frenchman's chair. Then jumps into the Agusta.\n\nINT. AGUSTA - COCKPIT\nLing puts a gun to the pilot's head.\n                         LING\n          Go!\n\nEXT. HANGAR\nSu, having left Daria to fight Sona inside, runs out.\n\nEXT. AIRFIELD\nThe Agusta begins to lift off. Su starts running toward the\nhelicopter. Runs under the rising aircraft. Jumps. Just\nin time to... Grab onto one of the retractable rear wheels.\n\n                                                                 94.\nEXT. AGUSTA\nAs the chopper transfers to forward motion, Su struggles to\nget a foot hooked on something, anything. In the process,\nhe kicks against the helo's sleek underbelly.\n\n\nINT. AGUSTA\nLing hears the THUMPS.    Looks out.\n\nLING'S POV - SU'S LEG\nswinging beneath the Agusta.\n\n\nLING\nTo the pilot --\n                          LING\n            Retract the gear!\n\nCLOSEUP - CONTROL PANEL\nThe pilot hits the wheels-up switch.     And...\n\nSU\nThe gear begins to retract. Disappearing into the bottom of\nthe chopper. In a second, there'll be nothing left to hold.\n                          SU\n            Shoot it down!   Now!\nAnd then... Su lets go.      Drops fifteen feet to the ground.\nAs...\nBehind him, having clanked out of the hangar, the Abrams\ntank is stopped. The turret swivels toward the Agusta.\n\nINT. TANK\nArchie aims the cannon.\n                          TOMMY\n            Can you hit it?\n                           ARCHIE\n            No problem.   Absolutely... Load.\nTommy slides a shell into the breech.\n\n                                                                95.\n\nArchie's locked on.     He hits the trigger.   And...\n\nABRAMS TANK\n\nBOOM!   The big CANNON FIRES.      And...\n\nSKY\nThe Agusta's tail is BLOWN AWAY by the CANNON SHELL.\n\nINT. TANK\n\nArchie and Tommy exult.\n                          TOMMY\n            Shot him right in the ass.\n                           ARCHIE\n            I did it.   I can't believe it.\n                          TOMMY\n            Thought you said it was no problem.\n                          ARCHIE\n            What do I know?\n\nINT. AGUSTA - COCKPIT\nThe pilot hopelessly fights to keep the chopper from\ncrashing.\n\nEXT. AIRFIELD\nThe out-of-control AGUSTA swings back toward Su and the\nhangar, losing altitude. Then SMASHES into the tarmac,\nripping open the fuel tank, spilling fuel behind it as it\ncaroms off the hangar and inscribes a large, skidding circle\naround Su before CRASHING into another CHOPPER and BURSTING\nINTO FLAMES.\nThe spilled fuel ignites.    A circle of intense fire.   With\nSu in the middle.\nThe Agusta pilot, still alive, has been thrown outside the\ncircle. But Ling's only path of escape takes him inside.\nInto the circle. He emerges with the bag of stones.\nSu is waiting.\n                          LING\n\n                                                          96.\n          You were lucky last time.   You\n          Won't be lucky again.\nThe final fight begins.\nThe two martial arts masters battle in the circle of fire,\nusing everything they can lay their hands on. Each the\nequal of the other. Each knowing it's a fight to the death.\nFor a long time, the fight could go either way. Until...\nLing gets an arm around Su's neck. Like Charles, Su thrashes\nand flails. Like Charles, he can't get away.\n                        LING\n          I'll kill you fast.    You won't\n          Feel a thing.\n\n                          SU\n          ... I won't.    You will\nWhat happens next happens in an instant:\nSu breaks the hold. Hooks one of Ling's arms.   Wrenches it.\nA direction it can't go.\nLing's ARM BONES SNAP, TISSUES RIP.\nLing screams in pain. Just as... Su pulls the ceramic\nCapsule containing the activated sliver of stone from\nLing's pocket. And...\nSlams the capsule deep into Ling's open mouth. Ling gags,\nchoking on the capsule lodged in his throat. His horror-\nstricken eyes meet Su's. Su lets him suffer another moment.\nThen, in SUBTITLED Chinese --\n                        SU\n          This is for our friends.\nAnd Su strikes him in the throat. A spearing, open-hand\nblow with his fingertips. Hard. Hard enough that...\n\nINSIDE LING'S THROAT\nThe CERAMIC CAPSULE SHATTERS. Releasing the hot, glowing\nwhite sliver of stone into Ling's windpipe. The fragment's\nsuper high-energy radiation instantly beginning to cook\nLing's body from within. The power of a few thousand\nmicrowave ovens turned on all at once.\nLing's bodily fluids instantly start boiling dry as...\n\nANGLE BACK ON LING\n\n                                                             97.\n\nAs, light beaming from his eyes and mouth, Ling flash-cooks\nfrom the inside out.\nNot simply burned. Horribly desiccated. His seared and\ndarkened skin shrink-wrapped, mummy-like, around his\nskeleton. Human jerky.\nIn a moment, it's finished. Ling's dry-roasted remains\ntopple over. Su has closed a chapter.\n\nSAME SCENE - MOMENTS LATER\nSu and Fait meet on the tarmac. Su has the stones. Fait's\nholding Vanessa, asleep in his arms. SIRENS APPROACH in\nb.g.\nThe two men regard each other a moment.\n                         FAIT\n          We got it all.\n                  (then)\n          What happens to the stones?\n                        SU\n          They'll be destroyed.\nThey see police and emergency vehicles beginning to arrive\nin b.g.\n                        FAIT\n          Looks like I'll be doing some jail\n          time.\n                       TOMMY\n          Jail? Man, you just helped save the\n          planet. Law's gotta allow for that.\nA look between Fait and Su.   Su nods.\n                        SU\n          I'll do what I can.\n                        ARCHIE\n          That's good, 'cause I mean, we make a\n          helluva team, y'know?\n                  (to Su)\n          Well, not you, 'cause you're law\n          enforcement. But the rest of us\n          -- look, a white guy comes in handy\n          now and then. Y'know, if you're\n          pulling a job in Beverly Hills or\n          ripping off a country club or\n          whatever... What kind of percentage\n          are we talking?\n\n                                                                98.\n\n                         FAIT\n          We're not.\nFait looks at Vanessa again.     Finding a new purpose in her\neyes. Beat.\n\n                        FAIT\n          Time I got real.\nHe regards the others.\n                        FAIT\n          Time we all did.\n                          ARCHIE\n          Get real?    What's that mean?\n                        TOMMY\n          ... Means we're through with that\n          life.\nFait's eyes meet Tommy's.     Beat.   Tommy nods.\nFait looks to Daria for her answer.\n                        DARIA\n          I'm with you, T.\nHe looks to Miles.\n                        MILES\n          Whatever you say, man.\nFait looks back to Su.   They hold the look.\n                         SU\n          ... Good luck.\n                         FAIT\n          ... Faith.\nAnother beat. Then they turn and start walking toward the\narriving cop cars. Daria and Miles follow. Archie and\nTommy lag behind. As they all walk away from us --\n                        ARCHIE\n          What, you're all gonna go straight,\n          just like that?\n                        TOMMY\n          Maybe oughta try it yourself.\n                        ARCHIE\n          Me? Are you kidding? I've had\n          straight jobs. You ever had a\n\n                                                       99.\n          straight job?\n                        TOMMY\n          I had plenty of straight jobs.\n                          ARCHIE\n          Name one.\n                        TOMMY\n          I sold Avon door-to-door.\n                        ARCHIE\n          ... You were an Avon lady?\n                        TOMMY\n          I was an Avon man. You got a problem\n          with that?\n                        ARCHIE\n          No, it's just, well, uh...\n                         TOMMY\n          Nah, I'm just fucking with you.\n                  (then)\n          But my momma did it, and don't you\n          dare start disrespecting my momma...\nAnd so on... OFF which, we...\n                                           FADE OUT:\n\n\n                            THE END\n\n\n\n\n\nCradle 2 the Grave\nWriters :   John O'Brian  Channing Gibson\nGenres :   Action  Comedy  Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:08.980874"}