{"title": "Crow: City of Angels, The", "film_link": "/Movie Scripts/Crow: City of Angels, The Script.html", "script_link": "/scripts/Crow-City-of-Angels,-The.html", "info_raw": "\n\nCrow: City of Angels, The Script\n\n\n\n\nIMSDb opinion  Severely underrated, but not as good as the first film.\nIMSDb rating   (7 out of 10)\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David S Goyer  James O'Barr\nGenres  Action  Fantasy  Thriller  Crime\nMovie Release Date : August 1996\n\nRead \"Crow: City of Angels, The\" Script\n\n\n", "script": "\n\n\n\n                              THE CROW: CITY OF ANGELS           \n          \n\n                                     Written by\n\n                            David S Goyer & James O'Barr\n\n\n           \n          \n          FADE IN:\n          \n          EXT. LIMBO - DAY/NIGHT\n          \n          A heavy mist hangs before us - endless and impenetrable. And\n          out of that primordial fog a CROW materializes, flying toward\n          the camera in slow motion.\n          \n           \n          \n          SARAH (O.S.)\n          \n          I believe there's a place where the restless souls wander. Burdened\n          by the weight of their own sadness, they cannot enter Heaven...\n          \n           \n          \n          Presently a second shape materializes - a FIGURE ON HORSEBACK.\n          A warrior whose baleful eyes shine behind the familiar irony\n          mask war paint.\n          \n           \n          \n          SARAH (O.S.)\n          \n          And so they wait, trapped between our world and the next, endlessly\n          searching for a way to rid themselves of their pain - in the\n          hopes that somehow, some day...\n          \n           \n          \n          The figure on horseback sweeps past us, disappearing once again\n          into the mists of time.\n          \n           \n          \n          SARAH (V.O.)\n          \n          ... they will be reunited with the ones they love.\n          \n           \n          \n          DISSOLVE TO:\n          \n           \n          \n          EXT. DOCS, COMMERCIAL WATERFRONT - NIGHT\n          \n           \n          \n          Present day. The Crow settles on a shipping container, tilts\n          its head, watching...\n          \n          SUPER TITLE:\n          \n          \"CITY OF ANGELS - OCTOBER 29TH - LA NOCHE DE SAN LUCAS\"\n          \n          CLOSE ON A PAIR OF HANDS tearing open a tiny glassine envelope\n          filled with powder - our drug du jour - Trinity. The face of\n          the envelope has been stamped with an image - a cartoon imp with\n          a shit-eating gring giving us the thumbs-up sign.\n          \n          A MAN lowers his face to the envelope, snorts up the powder.\n          The man discards the glassine envelope...\n          \n          FOLLOWING THE ENVELOPE\n          \n          as it flutters to the ground, landing \"imp-side\" up. Let the\n          rush begin.\n          \n          PULL BACK TO REVEAL\n          \n          Garbage-poisoned waters wreathed in fog. Although once part of\n          a thriving shipping industry, decades of decline have seen these\n          docks become a hellish dumping ground. Case in point:\n          \n          A FATHER AND HIS YOUNG SON\n          \n          are kneeling next to one another at the end of a pier, their\n          arms linked together, then tied behind their backs. DANNY CORVEN\n          (8) is quietly sobbing. ASHE (late 20s), tries to calm the frightened\n          boy.\n          \n           \n          \n          DANNY\n          \n          I'm sorry, Dad...I'm sorry... I didn't mean to look...\n          \n           \n          \n          ASHE\n          \n          It's okay, Danny. It's okay...\n          \n           \n          \n          NEMO (O.S.)\n          \n          Lights...\n          \n           \n          \n          A bright light comes on. Ashe and Danny turn their heads to avoid\n          the glare.\n          \n           \n          \n          NEMO (O.S.)\n          \n          ...camera...\n          \n           \n          \n          CLOSE ON\n          \n          A camcorder lens as it auto-focuses, bringing Danny's distorted\n          face into view via the lens' reflection.\n          \n           \n          \n          NEMO (O.S.)\n          \n          ...action.\n          \n           \n          \n          CAMERA FINDS Ashe and Danny's executioners, CURVE, KALI, SPIDER\n          MONKEY, and NEMO.\n          \n          NEMO, a post-modern sleaze-hound, circles Danny and Ashe with\n          a camcorder. He Pats Ashe's face.\n          \n           \n          \n          NEMO\n          \n          Make-up.\n          \n           \n          \n          SPIDER MONKEY, lean and gangly, crouches next to Ashe, holding\n          a marigold in his hand.\n          \n           \n          \n          SPIDER MONKEY\n          \n          Flowers for the dead, Senor?\n          \n           \n          \n          CAMERA POV (CLOSE ON ASHE'S EYE)\n          \n          Ashe stares directly into the camera.\n          \n           \n          \n          SPIDER MONKEY\n          \n          No? Suite yourself, then.\n          \n           \n          \n          Spider Monkey tucks the flower behind his ear. Danny is praying\n          now, MUMBLING a Catholic School litany.\n          \n           \n          \n          SPIDER MONKEY\n          \n          You're wasting your breath, angelito. Nobody up there's listening.\n          \n           \n          \n          WHOOSH!\n          \n          We cut to an extreme high-angle shot - God's omniscient POV,\n          perhaps.\n          \n          CURVE\n          \n          leans up against his motorcycle a few yards away - big, burly,\n          shaved head, a ciggie hanging from his lips. He's got a custom\n          paint-job on his pearl drop gas tank - a buxom blonde doing the\n          \"wild thing\" with the Grim Reaper. Curve's also the one who just\n          dusted himself\n          \n           \n          \n          CURVE\n          \n          (hyped on drugs)\n          \n          Let's get this over with. Judah's waiting.\n          \n           \n          \n          Kali, a cold-eyed heavy-metal femme with a killer's casual stoicism,\n          is methodically loading bullets into her revolver. She's taking\n          her own sweet time, in defiance of Curve. There's a tension between\n          them. Finally, she flicks her wrist, snaps the revolver shut.\n          Kali walks up to them...\n          \n           \n          \n          DANNY\n          \n          I'm scared, Dad.\n          \n           \n          \n          ASHE\n          \n          I know...\n          \n           \n          \n          Ashe turns to his executioners, pleading with them...\n          \n           \n          \n          ASHE\n          \n          Listen to me, please. He's just a kid. Let him go. He can't hurt\n          you. He doesn't even know who you are...\n          \n           \n          \n          ...and puts a bullet through Danny's chest. Ashe SCREAMS.\n          \n           \n          \n          ASHE\n          \n          NO!!!\n          \n           \n          \n          Danny's body slumps forward, dragging Ashe down next to him.\n          Ashe stares into his son's lifeless eyes.\n          \n          Curve saunters over, stares down at Ashe, flicks his cigarette\n          butt off into the water.\n          \n           \n          \n          CURVE\n          \n          Nothing personal, sport. Guess you were just in the wrong place\n          at the wrong time.\n          \n           \n          \n          BANG! BANG! BANG! Curve FIRES a gun into Ashe's back. As Ashe\n          crumples...\n          \n           \n          \n          CURVE\n          \n          Dump 'em. Let's get this cluster-fuck on the road.\n          \n           \n          \n          CURVE\n          \n          motions to Kali and Spider Monkey. Together, the three of them\n          heave Ashe and Danny into the ocean.\n          \n           \n          \n          CURVE\n          \n          Bon voyage, shitheads.\n          \n           \n          \n          EXT. OCEAN DEPTHS - NIGHT\n          \n           \n          \n          Ashe and Danny sink down into the murky underworld, taking their\n          place amongst a thousand other deep-sixed dreams.\n          \n          ASHE'S POV\n          \n          falling further and further away from the light of the surface\n          world. Bit by bit, Ashe's struggles subside. All we hear now\n          is an ever-slowing HEARTBEAT. Darkness begins to close in around\n          us, womblike, peaceful...\n          \n          ...AND OUT OF THE DARKNESS,\n          \n          something takes shape - a CROW. Winging its way from Ashe's dream-like\n          death up through watery depths into a smog-bound cityscape...\n          \n           \n          \n          EXT. CITY OF ANGELS - NIGHT\n          \n           \n          \n          The Crow flies over a bridge with spans the Styx - the city's\n          polluted, man-made river.\n          \n          THE CROW\n          \n          rides the thermals above an urban sprawl riven by fires, floods,\n          and earthquakes. Smog hangs in the air like an army of ever-present\n          ghosts. We pass over a roof where someone has painted a smart-ass\n          welcome mat for the benefit of anyone flying overhead - \"GO BACK\".\n          Nevertheless, we continue on.\n          \n           \n          \n          SARAH (V.O.)\n          \n          They say that time cancels pain. I don't know about that. Eight\n          years ago I lost two of my best friends. Two thousand miles later\n          I find I'm still living in the past...\n          \n           \n          \n          THE CROW\n          \n          sweeps down into man-made caverns of pigeon-shit concrete and\n          grimy glass. Through the bird's eyes we glimpse the city's silent\n          HOMELESS. Automobile hulks littering the streets like insect\n          husks. The shifting searchlights of police helicopters...\n          \n          WE PASS OVER SARAH'S ROOFTOP\n          \n          The Crow circles downward...\n          \n           \n          \n          SARAH (V.O.)\n          \n          Every night when I close my eyes the dreams come. That's how\n          the dead talk to us, I guess. In the dark, when our souls are\n          off wandering...\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          The Crow lands next to an open window. It perches on the edge,\n          looking into the loft.\n          \n           \n          \n          SARAH (V.O.)\n          \n          I just wish I understood what they were telling me.\n          \n           \n          \n          CROW'S POV (ANAMORPHIC)\n          \n          SARAH, early 20s, lies asleep in bed. She stirs, troubled by\n          uneasy dreams, rolls over, opens her eyes...\n          \n           \n          \n          INT. SARAH'S LOFT, SLEEPING AREA - NIGHT\n          \n           \n          \n          As Sarah rises the Crow flits away like yesterday's memory. Sarah's\n          not sure whether or not she dreamed the bird. GABRIEL, the cat\n          Sarah inherited from Eric and Shelly, is perched on the end of\n          the bed.\n          \n           \n          \n          SARAH\n          \n          Hey, Gabriel...\n          \n           \n          \n          Sarah gives the cat an obligatory behind-the-ear scratch, then\n          climbs from bed, making her way across the loft.\n          \n          SARAH'S ARTIST LOFT\n          \n          is furnished in thrift-store treasures. The loft has an earthy\n          warmth to it, in stark contrast to the urban decay outside -\n          an island amidst a sea of unrest, dominated by an arching half-circle\n          window through which Sarah can view the local wildlife on the\n          streets below.\n          \n          ON SARAH'S CANVASSES\n          \n          Turbulent oils reminiscent of history's brooding symbolist painters.\n          Give Sarah's childhood inspiration, the subject matter is no\n          real surprise.\n          \n          CAMERA ISOLATES a work-in-progress. The painting depicts a woman\n          resembling Sarah being cradled in the arms of her pale-faced\n          lover, surrounded by a sea of watchful dead.\n          \n          SARAH\n          \n          reaches the shower, strips off her clothes. Her back and upper\n          arms are decorated with graceful tattoo work - a pair of black\n          angel wings sweeping over her shoulder blades. She's got a ring\n          in her navel, another in a nipple...\n          \n          In short, the skate-waif we knew back in Detroit has matured\n          quite a bit since that fateful Devil's Night. Sarah shuts here\n          eyes, turns her face up into the spray. For a brief second we\n          see a flash of...\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT\n          \n           \n          \n          Ashe's death. Plunging into the icy waters, down into darkness.\n          Just as suddenly we are back in...\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah's eyes snap open. She holds a hand out to the shower wall,\n          takes a moment to collect herself.\n          \n          Troubled, Sarah climbs from the shower, shrugs on some clothes.\n          Among her accourterments is a necklace featuring a silver ankh,\n          the symbol of eternity.\n          \n          As Sarah sites in front of her vanity we catch sight of the irony\n          mask that used to hang by Shelly's mirror. Next to the mask is\n          a...\n          \n          TARNISHED WEDDING RING\n          \n          Once Shelly's. There's an inscription inside - \"FOREVER\".\n          \n          Sarah fingers the ring a moment, glancing at the irony mask.\n          Lots of memories. Lots of ghosts.\n          \n          Gabriel creeps up, MEOWING forlornly.\n          \n           \n          \n          SARAH\n          \n          (WISTFULLY)\n          \n          Me too.\n          \n           \n          \n          She threads the ring onto her necklace, letting it fall next\n          to the ankh, then slips the silver chain over her head. Sarah\n          stands, pulls on a jacket, heads out.\n          \n           \n          \n          EXT. SARAH'S LOFT, STREET - DUSK\n          \n           \n          \n          An ill-wind kicks up trash and grit. Sarah glances down. Dozens\n          of the glassine imp envelopes swirl around Sarah's feet like\n          confetti. One of the envelopes has stuck to her heel. As she\n          peels it off, she catches sight of...\n          \n           \n          \n          A PALE FACE\n          \n          in a shadowed entryway. It's a TEENAGED GIRL (16), strung out\n          on drugs. The girl cowers in a narrow stairway, hugging herself,\n          shivering from withdrawal.\n          \n          Sarah draws closer, notices some of the grinning imp drug sachets\n          at the girl's feet. The girl shies away, frightened, suspicious.\n          \n           \n          \n          SARAH\n          \n          (DRYLY)\n          \n          Nice place you've got here.\n          \n           \n          \n          GRACE\n          \n          (a muttered whisper)\n          \n          No place else to go.\n          \n           \n          \n          Sarah can't help but recognize a part of herself in this lost\n          soul.\n          \n           \n          \n          SARAH\n          \n          Gotta name?\n          \n           \n          \n          GRACE\n          \n          Grace. So what?\n          \n           \n          \n          SARAH\n          \n          Listen, Grace, how does some hot coffee sound? Maybe a little\n          food?\n          \n           \n          \n          GRACE\n          \n          What do you want?\n          \n           \n          \n          SARAH\n          \n          Nothing. Guess you just remind me of someone I used to know.\n          \n           \n          \n          After a moment, Grace offers a reluctant nod. Sarah helps her\n          from the entryway, into the warmth of the dying light. Grace\n          blinks, shields her eyes.\n          \n          As they walk away down the street, camera rises up to include...\n          \n          THE CROW\n          \n          perched on a nearby rooftop, watching them.\n          \n          CUT TO:\n          \n          EXT. GRAY GARGOYLE TATTOO SHOP - NIGHT\n          \n           \n          \n          the Gargoyle is an usassuming ink shop - the sole oasis of light\n          in an otherwise desolated block populated by derelict warehouse\n          buildings. Flickering neon BUZZES in the window.\n          \n          Nearby is a battered road sign - \"END CITY LIMITS\". Someone has\n          spray-painted \"OF THE FUCKING WORLD\" over \"city limits\". In the\n          distance, the bridge of the River Styx rises through the mist\n          like a skeletal dinosaur.\n          \n          SUPER TITLE:\n          \n          \"OCTOBER 30TH - LA NOCHE DE LA SANTA MUERTE\"\n          \n           \n          \n          INT. GRAY GARGOYLE TATTOO SHOP - NIGHT\n          \n           \n          \n          CLOSE ON a sparking tattoo \"gun\", the needle WHIRRING as it travels\n          over a patch of Vaseline-smeared skin.\n          \n           \n          \n          SARAH (V.O.)\n          \n          Almost finished. Doing okay?\n          \n           \n          \n          CUSTOMER (V.O.)\n          \n          Yeah, stings a little.\n          \n           \n          \n          SARAH (V.O.)\n          \n          That's why they call me the Mistress of Pain.\n          \n           \n          \n          PULL BACK TO REVEAL Sarah expertly guiding the needle, wearing\n          glasses, surgical gloves, concentrating.\n          \n          Sarah's buzz-headed CUSTOMER sits in a ratty dentist's chair.\n          Sarah is finishing coloring a Japanese dragon which winds its\n          way over the man's forearm. She makes another line of color then\n          sits back, smoothing more Vaseline over the man's arm. She picks\n          up a jeweler's loupe, makes an adjustment on her needle...\n          \n          Behind Sarah we glimpse the cluttered tattoo shop - walls covered\n          with sheets of flash (ready-made art), bookshelves crammed with\n          reference works. Sarah's partner, NOAH, a chain-smoking proto-punk\n          Brit, consults with a YOUNG GRUNGE COUPLE.\n          \n          LATER -\n          \n          Noah is closing up shop, while Sarah sterilizes some needles\n          in an autoclave.\n          \n           \n          \n          NOAH\n          \n          What a downer - this kid wanted me to tattoo \"If you're reading\n          this, you're too close\" on his bleedin' bum!\n          \n           \n          \n          Sarah smiles. Noah fires up a fag, flops down into a dentist\n          chair. The two slip into a familiar, good-natured banter.\n          \n           \n          \n          NOAH\n          \n          Christ, I'm knackered.\n          \n           \n          \n          SARAH\n          \n          Beats pushing ink in Detroit.\n          \n           \n          \n          NOAH\n          \n          That it does, Princess, that it does.\n          \n          (REMEMBERING)\n          \n          Oh, I bought you a little present...\n          \n           \n          \n          Noah reaches into his shirt pocket and pulls something out. It's\n          a handmade candy sugar skull with a little strip of paper glued\n          to the bottom - a fortune.\n          \n           \n          \n          NOAH\n          \n          They do 'em for the Day of the Dead.\n          \n          (tossing the skull to Sarah)\n          \n          Nice, huh? Necrophagia, Princess. Eat the dead.\n          \n           \n          \n          SARAH\n          \n          (reading fortune)\n          \n          \"Life is just a dream on the way to death.\" I like that.\n          \n           \n          \n          Sarah studies the skull, then pops it in her mouth, nodding.\n          Noah rises, stretching.\n          \n           \n          \n          NOAH\n          \n          Want to grab a beer, then?\n          \n           \n          \n          SARAH\n          \n          No, I gotta go home. Haven't been sleeping much lately.\n          \n           \n          \n          NOAH\n          \n          So, what's the dirty dog's name?\n          \n           \n          \n          SARAH\n          \n          I've just been having some weird dreams.\n          \n          (REFLECTING)\n          \n          You ever dream that you're dying someone else's death?\n          \n           \n          \n          Outside we hear a MOTORCYCLE pulling up, then someone KNOCKS\n          on the front door.\n          \n           \n          \n          NOAH\n          \n          (calling out)\n          \n          Sorry, we're closed.\n          \n           \n          \n          CURVE\n          \n          appears outside. He POUNDS harder on the door.\n          \n           \n          \n          CURVE\n          \n          Open the fucking door!\n          \n           \n          \n          NOAH\n          \n          stands, moves to the door.\n          \n           \n          \n          NOAH\n          \n          Look, I said we're...\n          \n           \n          \n          BANG! Curve kicks open the door and storms in. He PUNCHES Noah\n          in the nose, then heads straight for Sarah.\n          \n           \n          \n          CURVE\n          \n          You think what you did to me is funny? Some kind of joke?\n          \n           \n          \n          SARAH\n          \n          What are you talking about?!\n          \n           \n          \n          CURVE\n          \n          I'm talking about the fucking tattoo you gave me! I took off\n          the bandages. Look...!!!\n          \n           \n          \n          Curve rips open his shirt, revealing his chest.\n          \n          CURVE'S TATTOO\n          \n          It's a crow, rendered in bold slashes of black. Or is it? Upon\n          closer examination the crow looks like something else - two demons\n          fighting. The design is a classic ambiguous figure - like the\n          picture of the woman in front of a vanity which can also be seen\n          as a skull.\n          \n           \n          \n          SARAH\n          \n          A crow...\n          \n          Damn right, it's a crow. And did I ask for a fucking bird on\n          my chest? Did I?!\n          \n           \n          \n          Sarah shakes her head.\n          \n           \n          \n          CURVE\n          \n          Then what-the-fuck is it doing there?!\n          \n           \n          \n          SARAH\n          \n          I don't know, I was just going from the design you gave me...\n          \n           \n          \n          SMACK! Curve backhands Sarah across the face. Noah rushes forward,\n          blood still running from his nose.\n          \n           \n          \n          NOAH\n          \n          Stop it!\n          \n           \n          \n          Curve pulls an automatic from his waist-band and points the gun\n          at Noah. Noah freezes...\n          \n           \n          \n          CURVE\n          \n          What's it going to be, hero? Ready to kiss your faggot-ass good-bye?\n          I think so. I think you're shitting yourself you're so goddamn\n          ready.\n          \n           \n          \n          Curve snaps open an imp bag of his favorite drug, snorts up the\n          contents. He presses the gun against Noah's forehead.\n          \n           \n          \n          SARAH (O.S.)\n          \n          Over here, ass-hole...\n          \n           \n          \n          As Curve turns, Sarah squeezes a bottle of tattoo ink into the\n          killer's eyes, blinding him.\n          \n           \n          \n          CURVE\n          \n          Agh!!! SHIT!!!\n          \n           \n          \n          Sarah plants one of her Doc Marten boots in Curve's groin. He\n          SCREAMS, doubles over. Sarah pulls the automatic from his grasp\n          and trains it on him.\n          \n           \n          \n          SARAH\n          \n          Get up.\n          \n           \n          \n          Curve cups his balls, slowly rises. His eyes are glowing with\n          manic intensity. A slow smile creeps across Curve's face. He\n          backs away towards the front door.\n          \n           \n          \n          CURVE\n          \n          Shoulda killed me while you had the chance, sugarplum. Be seeing\n          you.\n          \n           \n          \n          Curve smashes his fist into the neon sign, then ducks out thedoor.\n          Moments later we hear his motorcycle ROAR to life. He takes off,\n          ENGINE SCREAMING away into the night.\n          \n          Sarah lowers the gun, takes a deep breath, looks to Noah.\n          \n           \n          \n          SARAH\n          \n          You okay?\n          \n           \n          \n          Noah wipes his bloody nose, looks to the floor where Curve discarded\n          the drug sachet, shakes his head in disgust.\n          \n           \n          \n          NOAH\n          \n          Fuck me, wonder what they'll be snorting next?\n          \n           \n          \n          Sarah shakes her head, at wits end.\n          \n           \n          \n          SARAH\n          \n          I just can't do this anymore... I'm so tired of this.\n          \n           \n          \n          Noah pulls Sarah toward him, gives her a big hug.\n          \n           \n          \n          NOAH\n          \n          Easy there, luv. It'll all work out.\n          \n           \n          \n          EXT. GRAY GARGOYLE, - NIGHT\n          \n           \n          \n          Sarah, still clutching Curve's gun, hurries to her Galaxy 500\n          which is parked along the nearby train tracks.\n          \n           \n          \n          INT. SARAH'S GALAXY - NIGHT\n          \n           \n          \n          Sarah moves behind the wheel, dumps the gun on the seat, and\n          rests her head in her hands. As Sarah raises her head...\n          \n          SARAH'S POV (THROUGH WINDSHIELD)\n          \n          The Crow is perched on the hood of her car. Sarah HONKS her horn\n          in frustration. The Crow doesn't move.\n          \n           \n          \n          EXT. GRAY GARGOYLE, ALLEYWAY - NIGHT\n          \n           \n          \n          Sarah rushes out of her car, screaming at the bird.\n          \n           \n          \n          SARAH\n          \n          Get out of here! Go!!!\n          \n           \n          \n          Sarah FIRES a wild shot into the sky. The Crow files off into\n          the night. Sarah collapses against the hood of her Galaxy and\n          starts to cry.\n          \n          CUT TO:\n          \n           \n          \n          EXT. CITYSCAPE - NIGHT\n          \n           \n          \n          The Crow soars away from the Gargoyle, toward the beckoning lights\n          of Downtown. In the distance, a flashing \"JESUS SAVES\" sign draws\n          our attention to a monolithic tower.\n          \n           \n          \n          EXT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          The Crow makes its way towards the decaying tower, which is crowned\n          by a weather-worn campanile. The campanile is a complex arabesque\n          of rusted iron scrollwork, like something Antonio Gaudi conjured\n          up from an art nouveau fever-dream.\n          \n          Just as the Crow is about to reach the campanile, it banks away.\n          We, however, continue to rush onward, right through one of the\n          dark openings in the scrollwork...\n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          SCRITCH! SCRITCH! All we see is black, then some vague, shiny\n          reflections...\n          \n          CAMERA PULLS BACK to reveal a stag beetle, imprisoned within\n          a box, leashed to a nail with a piece of thread. We were tight\n          on its shiny carapace. The beetle strains at its leash, moving\n          in a perpetual circle around the nail.\n          \n          CAMERA MOVES UP\n          \n          over the side of the box. Although mere inches in height, this\n          enclosure might as well be the Great Wall as far as our little\n          member of the Coleoptera is concerned.\n          \n          AS THE CAMERA CONTINUES TO PULL BACK\n          \n          we see crime lord Judah Earl's lair in all its sepulchral glory...\n          \n          Dark, filled with shadows. The decor is a cross between ruinous\n          palatial splendor and a SoHo industrial art installation. The\n          upper reaches of the campanile are laced with a spiderweb network\n          of steel girders.\n          \n          Look close enough and you might see PEOPLE bound to the supporting\n          pillars, like the half-glimpsed shapes crouching at the foot\n          of your bed in the middle of the night.\n          \n          VOICES draw our attention to an area partitioned off by chain-mail\n          curtains. CAMERA MOVES IN towards a break in the curtains. We\n          linger there for a tantalizing moment...\n          \n           \n          \n          JUDAH (V.O.)\n          \n          Talk to me, Sibyl. Tell me what you see.\n          \n           \n          \n          SIBYL (V.O.)\n          \n          I see Death returning from the veil of tears. He has your name\n          on his tongue.\n          \n           \n          \n          Now we plunge in through the curtains...\n          \n          The \"camera\" consists of a series of lenses and mirrors which\n          project images from the outside world onto a circular table,\n          offering the ultimate voyeuristic view of the crumbling cityscape.\n          TWO FIGURES stand with their backs to us, studying the camera's\n          view. The first is...\n          \n          JUDAH EARL,\n          \n          A sinewy, slash-mouthed Byronic figure with a guttural voice.\n          Old before his time, touched by childhood visions of his own\n          death. The tower is Judah's prison in more ways than one.\n          \n          SIBYL, Judah's blind oracle, waits by his side. Attractive, though\n          of indeterminate sex. His/her dour features are hidden beneath\n          a black cowl.\n          \n           \n          \n          JUDAH\n          \n          (FATALISTIC)\n          \n          It's finally beginning, isn't it? What mask will Death wear,\n          can you tell me that?\n          \n           \n          \n          SIBYL\n          \n          I see the face of one of your victims.\n          \n           \n          \n          Judah lifts his head up and we see his luminous amber eyes for\n          the first time. A kind of madness dances within them.\n          \n           \n          \n          JUDAH\n          \n          All my sins remembered.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah sits in bed, cigarette burning in one hand, a half-filled\n          wine glass in the other. She turns out her light, looks to the\n          window and the cityscape beyond - as if the answers were lying\n          out there in the steam-cloaked streets.\n          \n          CUT TO:\n          \n          SOMEONE'S SPEED-INDUCED POV. Performers flaunt their flesh on\n          a raised stage. CROWDS OF SEXUAL LIBERTINES and CUTTING EDGE\n          FETISHISTS writhe as one on the dance floor. Lots of rubber,\n          latex strap bodices, Victorian hoop skirts - it's a modern-day\n          De Sade's wet-dream.\n          \n          REVERSE ANGLE\n          \n          on Curve as he pushes his way upstairs and through the tangle\n          of flesh.\n          \n          He pulls up to a bar, takes a seat alongside Kali and Spider\n          Monkey (who's amusing himself with a Viewmaster). CLICK, CLICK\n          - we see\n          \n          MONKEY'S POV - as the 3-D tableaus rotate into position\n          \n          THE BARTENDER,\n          \n          a barrel-chested Samoan, sets a drink down in front of Curve,\n          nods a greeting. Curve sits back, opens his shirt, nudges Spider\n          Monkey.\n          \n           \n          \n          CURVE\n          \n          Spider Monkey, what's this tattoo look like to you?\n          \n           \n          \n          SPIDER MONKEY\n          \n          This a test?\n          \n           \n          \n          CURVE\n          \n          Come on, man, just tell me what you see.\n          \n           \n          \n          Spider Monkey inspects Curve's chest.\n          \n           \n          \n          SPIDER MONKEY\n          \n          A bird.\n          \n           \n          \n          CURVE\n          \n          (ANNOYED)\n          \n          Think about it a minute. Don't you see two demons?\n          \n           \n          \n          SPIDER MONKEY\n          \n          Nope. I see a bird.\n          \n           \n          \n          CURVE\n          \n          Ah, fuck you, then.\n          \n           \n          \n          Curve lifts up his beer bottle. ECU from within the beer as the\n          amber liquid rushes towards us...\n          \n          DISSOLVE TO:\n          \n           \n          \n          EXT. UNDERWATER REALM - NIGHT\n          \n           \n          \n          Air bubbles escaping, blood. Ashe is drowning again, the orbs\n          of his eyes bulging outwards. Over this we hear a WOMAN'S SCREAM\n          and...\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah bolts up in bed, knocking her wine glass to the floor,\n          SHATTERING it. She's choking, gasping for breath. Her heart is\n          hammering within her chest.\n          \n           \n          \n          SARAH\n          \n          ...ohgodohgodohgod...\n          \n           \n          \n          Suddenly she catches sight of a shadow on the wall before her\n          - a GIANT BIRD slowly spreading its black wings.\n          \n          Sarah turns to the window. The Crow is perched just outside.\n          \n           \n          \n          SARAH\n          \n          What do you want from me?!\n          \n           \n          \n          The Crow CAWS, then takes flight.\n          \n          CLOSE ON SARAH\n          \n          Calm now, realization and a sense of purpose dawning.\n          \n          CUT TO:\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT\n          \n           \n          \n          We descend towards the empty docks, pushing out into the mist-shrouded\n          water, then down into the ocean's murky depths.\n          \n          PRESENTLY THE BODIES OF ASHE AND DANNY\n          \n          come into view, caught up in a tangle of razor wire.\n          \n          CLOSE ON ASHE'S FACE\n          \n          Unaltered by the ravages of time. His eyelids flicker, dreaming.\n          A SINGLE TEAR escapes, flowing down his cheek. We push on INSIDE\n          HIS HEAD...\n          \n          We see brief MEMORY FLASHES of he and Danny together...\n          \n           \n          \n          INT. ASHE'S GARAGE - NIGHT/DAY (MEMORIES)\n          \n           \n          \n          Danny stretched out on the floor of their garage, painting a\n          picture...\n          \n          Danny and Ashe rough-housing, having a water fight...\n          \n          Danny sitting in Ashe's lap as Ashe reads aloud from a story.\n          \n           \n          \n          ASHE\n          \n          (READING)\n          \n          \"...midway through our life's journey I came to myself within\n          a dark wood where the straight way was lost...\"\n          \n           \n          \n          Danny asleep, curled up next to his father. Ashe reaches out\n          and strokes Danny's hair...\n          \n           \n          \n          CLOSE ON ASHE'S FACE\n          \n          His dead eyes suddenly open. Confusion. Pain. Fear. A stream\n          of bubbles rushes from his mouth, obscuring our view.\n          \n          ASHE'S POV\n          \n          As the bubbles clear, Danny's face comes into focus just a few\n          inches from his own.\n          \n          Ashe panics, jerks back. The razor-wire barbs cut into his flesh.\n          The more he struggles, the tighter the coils become, slashing\n          his hands and face, shredding his clothes. He's caught in his\n          son's embrace, the two of them thrashing about in a grotesque\n          underwater ballet.\n          \n          CUT TO:\n          \n           \n          \n          EXT. RIVER STYX BRIDGE - NIGHT\n          \n           \n          \n          The headlights of Sarah's Galaxy cut through the fog. She pulls\n          up just in time to see the Crow disappearing into the mist which\n          cloaks the bridge. Sarah follows, trying to keep up with the\n          bird.\n          \n          CUT TO:\n          \n           \n          \n          EXT. UNDER WATER - NIGHT\n          \n           \n          \n          Ashe's struggles become more and more violent. He thrashes, churning\n          up a cloud of bubbles. We are intercutting quickly now, between\n          Ashe's turmoil and...\n          \n          CUT TO:\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT\n          \n           \n          \n          Sarah reaches the pier where Ashe and Danny were executed. She\n          climbs from her car...\n          \n          THE CROW\n          \n          flies on ahead, landing atop one of the piles, staring down into\n          the water.\n          \n          AND AS SARAH\n          \n          starts toward the bird we...\n          \n          CUT TO:\n          \n           \n          \n          EXT. UNDER WATER - NIGHT\n          \n           \n          \n          Ashe tears his hands free, clawing his body away from the barbwire,\n          swimming to the surface in a storm of bubbles...\n          \n          FLASHBACKS\n          \n          of subjective POVs. The killers walking down the jetty, marching\n          Ashe and Danny to their deaths and...\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL DISTRICT - NIGHT\n          \n           \n          \n          We are beneath the jetty now in the present, looking up through\n          the slats as a FIGURE (Sarah?) makes its way to the water...\n          \n          Camera CRANES UP from beneath the jetty to reveal Sarah standing\n          there in silhouette...\n          \n           \n          \n          EXT. UNDER WATER - NIGHT\n          \n           \n          \n          Ashe is propelled towards the surface.\n          \n           \n          \n          EXT. DOCKS COMMERCIAL WATERFRONT - NIGHT\n          \n           \n          \n          Ashe suddenly bursts from the sea with his arms outstretched.\n          A hellish Venus on the half-shell. Gasping, full of terror and\n          rage. He lets loose a TORTURED HOWL.\n          \n          ASHE\n          \n          digs his fingers into the wood-rot pulp of the pilings and claws\n          his way up to the jetty. He collapses down onto the wooded slats.\n          \n          ASHE\n          \n          crouches before us, his face hidden from view. He reaches out\n          his hand, touching an unmistakable BLOOD STAIN... Danny's blood\n          stain. This triggers more painful memories...\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT\n          \n           \n          \n          Images from Ashe and Danny's execution assault him. BANG!!! Kali\n          FIRING her gun. Ashe SCREAMING. Danny's body slumping forward\n          like a marionette whose strings have been severed.\n          \n          CUT TO:\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT (PRESENT)\n          \n           \n          \n          Ashe lifts his head, WAILING. He's covered from head to toe in\n          ocean-bottom silt. Blood from the razor-wire wounds has smeared\n          across his face in patterns which eerily recall the Crow make-up.\n          Strips of the wire still cling to his arms and chest, the barbs\n          buried deep in his flesh.\n          \n          Reliving the violent moment is more than his mind can bear. Ashe's\n          eyes roll up into his head. The world spins around him. But even\n          as the lights are going out, Ashe glimpses...\n          \n          A DARK FIGURE\n          \n          standing in front of him. It's the last thing Ashe sees before\n          consciousness escapes him.\n          \n          SARAH\n          \n          emerges from the shadows, staring down at Ashe in wonder.\n          \n          CUT TO BLACK:\n          \n          SUPER TITLE:\n          \n          \"OCTOBER 31ST - ALL HALLOWS EVE\"\n          \n          INT. SARAH'S LOFT - DUSK\n          \n           \n          \n          Ashe opens his eyes. The mud-silt which covers his face has dried\n          and cracked, causing it to crumble away in flakes.\n          \n          Ashe is lying on a cot in the middle of the loft. We see scattered\n          images: candles burning, a reilgious altar overflowing with trinkets,\n          mirrors, mannequins, canvases, and finally...\n          \n          GABRIEL\n          \n          perched at the end of the bed, watching Ashe intently.\n          \n          SARAH\n          \n          sits on the other side of the loft in a paint-smeared work-shirt,\n          brush in hand. She's studying a half-finished canvas, contemplating\n          her next move.\n          \n          CANVAS\n          \n          The eerie scene depicting a woman on her death-bed being cradled\n          in the arms of her ghostly lover.\n          \n          Sarah tenses, feeling Ashe's eyes burning into the back of her\n          neck. She turns around, sees Ashe.\n          \n           \n          \n          ASHE\n          \n          (DISORIENTED)\n          \n          ...who are you?\n          \n           \n          \n          SARAH\n          \n          My name's Sarah. I had a dream about you. I saw them shoot you\n          and your son...\n          \n          (BEAT)\n          \n          ...I saw you drowning.\n          \n           \n          \n          Ashes shuts his eyes a moment, trying to recall the imagery.\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT (FLASHBACK)\n          \n           \n          \n          BANG! BANG! BANG! Curve FIRES a gun into Ashe's chest. Ashe crumples\n          and we are back at...\n          \n           \n          \n          INT. SARAH'S LOFT - DUSK\n          \n           \n          \n          Ashe looks down at his chest, tracing his fingers over the area\n          where bullet holes should be. Instead, he finds a series of indented\n          welts.\n          \n           \n          \n          ASHE\n          \n          How did I survive?\n          \n           \n          \n          Sarah suddenly comes to the terrible realization that Ashe does\n          not know he has died.\n          \n           \n          \n          SARAH\n          \n          (coming towards him)\n          \n          You didn't.\n          \n           \n          \n          Ashe looks up at Sarah, uncomprehending.\n          \n           \n          \n          SARAH\n          \n          You're dead.\n          \n           \n          \n          ASHE\n          \n          No...\n          \n           \n          \n          Ashe stands, enraged. He starts toward Sarah. She backs away...\n          \n           \n          \n          ASHE\n          \n          Stop looking at me that way -- stop looking -- this isn't real,\n          none of this is real! I'm dreaming this.\n          \n           \n          \n          SARAH\n          \n          (shaking her head, frightened)\n          \n          No.\n          \n           \n          \n          The two of the struggle a moment, Ashe pushes Sarah back. Sarah\n          reaches for him, trying to restrain him, trying to somehow keep\n          his rising terror in check... she's not getting through to him,\n          he can't be made to listen...\n          \n          Finally, Sarah grabs a kitchen knife from the counter and plunges\n          it into Ashe's chest.\n          \n          Ashe gasps. He stares down at the incongruous sight of a knife-handle\n          stickout out from his sternum, then he yanks the knife back out.\n          No pain. No wound. A moment of shock, then...\n          \n           \n          \n          ASHE\n          \n          (looking at her, a tortured whisper)\n          \n          I'm dreaming this.\n          \n           \n          \n          Sarah tries to reach for Ashe again. He tears away from her,\n          flinging her back and running for the door.\n          \n           \n          \n          EXT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Ashe stumbles from the doorway out onto the sidewalk. He rushes\n          blindly up the street.\n          \n          CAMERA WHIP-PANS\n          \n          from the fleeing Ashe to Sarah's window. On a pillar outside,\n          the Crow is waiting...\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah rushes to the window, watching Ashe run. She SEES the Crow\n          perched below her. It takes wings, flying after Ashe...\n          \n          CUT TO:\n          \n           \n          \n          EXT. BRIDGE/GARAGE - NIGHT\n          \n           \n          \n          Beneath the arching span of a freeway bridge is a series of corrugated\n          iron sheds. CAMERA FOLLOWS as Ashe, exhausted fro his run, makes\n          his way towards them. The Crow flies on ahead, landing next to\n          one of the doors, beckoning...\n          \n          Ashe slides one of the RATTLING doors open...\n          \n           \n          \n          INT. GARAGE - NIGHT\n          \n           \n          \n          As light spills in, we catch a glimpse of the humble auto repair\n          garage - tools, a few wrecks-in-progress, a motorcycle...\n          \n          CAMERA ISOLATES a tempera painting on the floor that's been executed\n          on construction paper. A brush and a collection of paint canisters\n          are scattered around it, like the kind you might find in a primary\n          school art class. Ashe kneels next to the painting...\n          \n          CLOSE ON PAINTING\n          \n          An image rendered by a child's optimistic imagination - a crude\n          father and sone, respectively labeled \"DAD\" and \"ME\". A FOOTPRINT\n          mars the otherwise perfect memento. Ashe touches the figure labeled\n          \"ME\", which triggers...\n          \n           \n          \n          INT. GARAGE - NIGHT (FLASHBACK)\n          \n           \n          \n          Ashe is working beneath a car. Danny is sprawled on the floor.\n          He holds up the painting in question.\n          \n           \n          \n          DANNY\n          \n          Hey, Dad...what color should I make the sun?\n          \n           \n          \n          ASHE\n          \n          Blue.\n          \n           \n          \n          DANNY\n          \n          There's no such thing.\n          \n           \n          \n          ASHE\n          \n          (PLAYFUL)\n          \n          No. Well there should be.\n          \n           \n          \n          Just then we hear a GUNSHOT coming from outside.\n          \n           \n          \n          DANNY\n          \n          (wide eyed)\n          \n          What was that?\n          \n           \n          \n          Danny climbs to his feet, moves outside...\n          \n           \n          \n          ASHE\n          \n          Danny, wait!\n          \n           \n          \n          Ashe slides out from under the car.\n          \n           \n          \n          EXT. GARAGE - NIGHT (FLASHBACK)\n          \n           \n          \n          From the back doorway, Ashe and Danny catch sight of Curve and\n          his crew executing someone beneath the freeway overpass. Curve's\n          face is splattered with blood. He turns and sees them...\n          \n           \n          \n          CURVE\n          \n          See no evil.\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - NIGHT (FLASHBACK)\n          \n           \n          \n          Now we're back at the pier. The memory flashes are coming faster\n          and faster. Danny is sobbing once again.\n          \n           \n          \n          DANNY'S VOICE\n          \n          I'm sorry, Dad...I'm sorry...\n          \n           \n          \n          We see Kali raise her gun. BANG! There's the muzzle flash! Ashe\n          SCREAMS...\n          \n           \n          \n          ASHE\n          \n          NO!!!\n          \n           \n          \n          CURVE'S VOICE\n          \n          Nothing personal, sport.\n          \n           \n          \n          SMASH CUT TO:\n          \n           \n          \n          INT. GARAGE - NIGHT (PRESENT)\n          \n           \n          \n          Ashe is tearing the place apart, sobbing, knocking over racks\n          of tools. Finally, he sinks to his knees, his face a mask of\n          tears.\n          \n          Ashe spins, murderous rage in his eyes. Never startle an animal,\n          right?\n          \n          SARAH\n          \n          stands in the doorway.\n          \n           \n          \n          ASHE\n          \n          Why are you here?\n          \n           \n          \n          SARAH\n          \n          I don't know.\n          \n           \n          \n          She stops herself -- she does know, she just didn't want to admit\n          it to herself.\n          \n           \n          \n          SARAH\n          \n          I want to help you. I need to.\n          \n           \n          \n          Sarah approaches, dropping by Ashe's side. She sees Danny's painting\n          which Ashe cradles protectively.\n          \n          Ashe looks up at Sarah, his eyes full of questions.\n          \n           \n          \n          ASHE\n          \n          Everything's so confused...\n          \n          (anguished, touching the drawing)\n          \n          Danny...\n          \n           \n          \n          SARAH\n          \n          He's not here anymore.\n          \n           \n          \n          Sarah draws closer, touched by Ashe's inner struggle. She reaches\n          out to him, drawing him into her arms. He stares up at her, eyes\n          distant.\n          \n           \n          \n          ASHE\n          \n          There's no moon...\n          \n           \n          \n          Sarah touches Ashe's face, calming him, trying to reach through\n          his pain.\n          \n           \n          \n          SARAH\n          \n          You've been given another chance, Ashe -- to put the wrong things\n          right...\n          \n           \n          \n          Sarah's eyes drop to the canisters of paint which have been scattered\n          nearby. She reaches for the canister of white and unscrews the\n          lid, dipping her fingers inside...\n          \n          Sarah's re-creation of the irony war mask has an oddly ritualistic\n          feel to it. Yet the act is also quite erotic, for the mutual\n          attraction between these two battered souls is almost palpable.\n          \n          As Sarah continues to speak, she begins to paint Ashe's face\n          using Danny's art supplies.\n          \n          We see this transformation in bits and pieces - an eye here,\n          fingers dipping into the canister of white there, ruby lips being\n          smeared with black...\n          \n          ...the face that is taking shape is both similar to and different\n          from Eric's. It's the legacy of the Crow, as funneled through\n          Ashe's own, unique pain.\n          \n           \n          \n          SARAH\n          \n          I believe there've always been people like you...\n          \n           \n          \n          Sarah has finished. She sits back, surveying her work...\n          \n           \n          \n          SARAH\n          \n          It's the pain that brings people back. It makes us strong again.\n          \n           \n          \n          CLOSE ON ASHE'S FACE as he turns towards us. A slash of light\n          illuminates the signature black and white war-paint of the Crow\n          in all its glory. Ashe looks like a dark saint.\n          \n          CUT TO:\n          \n           \n          \n          EXT. FREEWAY OVERPASS - NIGHT\n          \n           \n          \n          Ashe rockets beneath the gothic arches of the freeway overpass\n          on his motorcycle, hellfire burning in his eyes, his coat flapping\n          behind him like a fallen angel's wings.\n          \n          THE CROW\n          \n          flies alongside Ashe.\n          \n          THE CROW\n          \n          lands on a telephone wire, studying the warehouse.\n          \n          Presently we hear Ashe's MOTORCYCLE approaching, then we see\n          the front wheel of his bike pulling into the foreground.\n          \n          CROW'S POV (ANAMORPHIC)\n          \n          Ashe turns to the Crow, slyly giving the bird the thumbs-up sign...\n          \n          MATCH CUT TO...\n          \n          INT. SPIDER MONKEY'S WAREHOUSE LAB - NIGHT\n          \n           \n          \n          CA-CHUNK, CA-CHUNK, CA-CHUNK. CLOSE ON a sheet of glassine drug\n          bags as a hand-powered printing press comes down, mass-producing\n          the image of the imp giving us the thumbs up...\n          \n          PULL BACK TO REVEAL the lab set up in a maze of barrells. The\n          walls are stained from the toxic fumes. Blacked-out windows sweat\n          with moisture. There are heating mantles rigged with flasks and\n          condensers, vacuum pumps - along with ingredients like battery\n          acid, paint thinner, and Epsom salts. Nearby are dozens of 50-gallon\n          drums containing the finished product.\n          \n          Spider Monkey is working away at the printing press, pausing\n          to snoot some of Judah's drug. Nearby is an old TV featuring\n          lurid videos of amateur bull riding - we watch as a drunken participant\n          gets gored.\n          \n          Suddenly the power in the lab goes out, the TV screen sputters\n          and goes dark.\n          \n           \n          \n          SPIDER MONKEY\n          \n          Ono!\n          \n           \n          \n          ASHE (O.S.)\n          \n          'My mother was accursed the night she bore me and I am faint\n          with envy of all the dead'.\n          \n           \n          \n          Spider Monkey whirls around, startled. Ashe is sitting cross-legged\n          on one of the tables, grinning like a black leather Buddha.\n          \n           \n          \n          ASHE\n          \n          Tell me, Monkey. Does the corpse have a familiar face?\n          \n           \n          \n          SPIDER MONKEY\n          \n          Who the fuck are you?\n          \n           \n          \n          ASHE\n          \n          You have to learn to look beyond the mask.\n          \n           \n          \n          Ashe jumps down from the table, walking into the light. Spider\n          Monkey's eyes widen in recognition.\n          \n           \n          \n          SPIDER MONKEY\n          \n          No way, man...we put you under...you and that little snot-nosed\n          kid...\n          \n           \n          \n          Ashe dips his hand into one of the 50-gallon drums. He blows\n          a handful of the Trinity dust at Spider Monkey. Spider Monkey,\n          terminally spooked, reaches back to the counter behind him, searching\n          for something...\n          \n           \n          \n          ASHE\n          \n          Looking for this?\n          \n           \n          \n          Ashe holds up a pistol and puts it to his head.\n          \n           \n          \n          ASHE\n          \n          (an evil grin)\n          \n          Don't try this at home, kids.\n          \n           \n          \n          BOOM! ASHE\n          \n          puts a bullet through his own forehead. His head snaps backward\n          and his body collapses onto the floor. Spider Monkey creeps forward\n          toward Ashe's body...\n          \n          ASHE\n          \n          springs from the ground, SLAMMING Spider Monkey against a table\n          of chemicals. Bottles SHATTER on the floor, spilling their toxic\n          contents.\n          \n           \n          \n          SPIDER MONKEY\n          \n          What are you?! What the fuck are you?!\n          \n           \n          \n          Ashe leans in so he's eye to eye with Spider Monkey.\n          \n           \n          \n          ASHE\n          \n          I wasn't sure at first. Now I know. I'm the boiling man, Monkey.\n          I'm the plague of Darkness and the death of the first-born. All\n          your nightmares rolled into one.\n          \n           \n          \n          Ashe removes a wooden match from his inside coat pocket. He scrapes\n          his thumb-nail over the head, igniting it.\n          \n           \n          \n          SPIDER MONKEY\n          \n          Whoa...this shit's flammable! Look, look, what do you want?\n          \n           \n          \n          ASHE\n          \n          The others. Who are they?\n          \n           \n          \n          SPIDER MONKEY\n          \n          Nemo. Kali. Judah. And Curve.\n          \n           \n          \n          ASHE\n          \n          I'll start with Nemo, then work my way up the food chain. Where\n          is he?\n          \n           \n          \n          SPIDER MONKEY\n          \n          Nemo? Nemo's an old gash-hound. He hangs out at the Peep-O-Rama\n          on Deacon Street!\n          \n           \n          \n          WHOOSH! Ashe blows the match out.\n          \n           \n          \n          ASHE\n          \n          Congratulations, monkey. You just bought yourself a fighting\n          chance.\n          \n           \n          \n          Ashe reaches into his coat pocket, pulling out a deck of cards.\n          He fans them out, points...\n          \n           \n          \n          ASHE\n          \n          Pick a card, monkey.\n          \n           \n          \n          Spider Monkey slowly extends his hand, half-expecting Ashe to\n          pounce on him. He pulls a card out.\n          \n          Spider Monkey tosses the card down, face up. He's got the Jack\n          of Hearts. he smiles tentatively. Ashe pulls out a card of his\n          own and flips it around - the King of Clubs.\n          \n           \n          \n          ASHE\n          \n          Lady Luck's a bitch.\n          \n           \n          \n          Ashe produces another wooden match.\n          \n           \n          \n          SPIDER MONKEY\n          \n          Aw, Jesus, c'mon, man!\n          \n           \n          \n          ASHE\n          \n          You're wasting your breath, angelito. Nobody's up there listening.\n          \n           \n          \n          CLOSE ON MATCH\n          \n          as Ashe scrapes his thumb-nail over the head...\n          \n           \n          \n          EXT. SPIDER MONKEY'S WAREHOUSE LAB - NIGHT\n          \n           \n          \n          An EXPLOSION rips through the front of the lab, spilling roiling\n          CLOUDS OF FIRE out into the street. The blackened windows SHATTER\n          OUTWARDS in a HAIL STORM OF GLASS... ASHE\n          \n          emerges from the raging conflagration, walking right through\n          the flames, indifferent to the heat. A flurry of the tiny glassine\n          drug bags swirl around him like snow.\n          \n          THE CROW\n          \n          spirals down from a telephone wire, landing atop the handlebars\n          of Ashe's motorcycle.\n          \n          ASHE\n          \n          lifts his head to the night sky, laughing. His clothes are still\n          smoking.\n          \n          CUT TO:\n          \n           \n          \n          INT. GRAY GARGOYLE - NIGHT\n          \n           \n          \n          Sarah is working at one of the drawing tables. Noah is mixing\n          pigments.\n          \n          SARAH'S SKETCH PAD\n          \n          She's working on a rendering of Ashe. She sits back...\n          \n           \n          \n          SARAH\n          \n          ...and all the world will be in love with night...\n          \n           \n          \n          SARAH STARES AT THE DRAWING.\n          \n           \n          \n          SARAH\n          \n          Do you believe in fate, Noah?\n          \n           \n          \n          NOAH\n          \n          (CONSIDERING)\n          \n          Seeems to me it's more a question of fate believing in you.\n          \n           \n          \n          Sarah rises, reaching for her bag. As she heads for the exit,\n          Noah reaches for the sketch. He smoothes it out, studies the\n          image awhile as we...\n          \n          CUT TO:\n          \n           \n          \n          EXT. SPIDER MONKEY'S WAREHOUSE LAB - NIGHT\n          \n           \n          \n          The demolished building is still burning strong. Curve arrives\n          on the scene, dismounting his motorcycle.\n          \n          CLOSE ON CURVE\n          \n          as he studies the shattered glass which litters the asphalt.\n          The fire is reflected in the fragments. With a growing sense\n          of dread, Curve looks from the glass to the tattoo on his chest.\n          He touches the Crow tattoo.\n          \n          SCENE FROM ABOVE -\n          \n          Now we see that the glass shards have fallen in an array that\n          is anything but random. The shards have taken the shape of a\n          large crow.\n          \n          CUT TO:\n          \n          THE CROW\n          \n          flys past a line of palm trees which burst into flames.\n          \n          CUT TO:\n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          TWO ZIPPER-MASKED WOMEN are frolicking on a bed, acting out an\n          elaborate bondage fantasy. Pull back to include...\n          \n          A VIDEO CAMERA\n          \n          recording the pornographic act for posterity. Pull further back\n          to include...\n          \n          JUDAH\n          \n          lounging on a couch a few dozen yards away, watching the women\n          on four video monitors, detached and twice removed from the sex\n          play.\n          \n          CURVE\n          \n          enters from out of the shadows. Judah looks up to him.\n          \n           \n          \n          CURVE\n          \n          Bad news.\n          \n           \n          \n          JUDAH\n          \n          Illuminate me.\n          \n           \n          \n          CURVE\n          \n          Someone torched the lab on Manchester. Spider Monkey's a fucking\n          crispy critter.\n          \n           \n          \n          JUDAH\n          \n          Monkey I could care less about. What about our merchandise?\n          \n           \n          \n          CURVE\n          \n          A total loss.\n          \n           \n          \n          SIBYL (O.S.)\n          \n          He left a sign, didn't he?\n          \n           \n          \n          Judah looks to Sibyl who is standing nearby.\n          \n           \n          \n          CURVE\n          \n          (rising, uneasy)\n          \n          I don't know what you're talking about.\n          \n           \n          \n          SIBYL\n          \n          Yes you do. You've seen it.\n          \n           \n          \n          Sibyl points an accusing finger at Curve's chest.\n          \n           \n          \n          SIBYL\n          \n          You've been marked.\n          \n           \n          \n          CURVE\n          \n          (even more agitated)\n          \n          Jesus Christ, Judah, why the fuck to you listen to her?!\n          \n           \n          \n          JUDAH\n          \n          Because she speaks the truth.\n          \n           \n          \n          Judah rises swiftly from his chair. He snags a handful of Curve's\n          shirt and rips it open, revealing the Crow tattoo.\n          \n           \n          \n          JUDAH\n          \n          What's this, Curve? A beauty mark?\n          \n           \n          \n          SIBYL\n          \n          Your enemy wears the mask of the Crow. The bird of ill-omen.\n          \n           \n          \n          CLOSE ON Judah as the words sink in. He strides across the floor,\n          sweeping aside one of the curtains surrounding the camera obscura.\n          \n           \n          \n          JUDAH\n          \n          The Crow. Death's avatar. I've heard the legends.\n          \n           \n          \n          JUDAH\n          \n          looks down at a view of the seething landscape.\n          \n           \n          \n          JUDAH\n          \n          Let him come, then.\n          \n           \n          \n          CUT TO:\n          \n          EXT. PEEP-O-RAMA PORN SHOP - NIGHT\n          \n           \n          \n          The Peep-O-Rama occupies an old Japanese movie house. A geisha-girl\n          sign flashes over the marquee. Beneath that is a blinking neon\n          eye which opens and closes. Other signs offer enticements like\n          \"ONLY 25 CENTS A PEEP!\" and \"REAL GIRLS WORKING THEIR WAY THROUGH\n          COLLEGE!\"\n          \n          As Nemo approaches, a laconic HINDU with a throat microphone\n          sits outside, reciting his tired schpiel.\n          \n           \n          \n          HINDU\n          \n          Tokens for the buddy booths, live girls. Tokens for the buddy\n          booths, live girls...\n          \n           \n          \n          Nemo hands the Hindu a twenty.\n          \n           \n          \n          INT. BUDDY BOOTH - NIGHT\n          \n           \n          \n          Nemo enters a cramped booth, clutching a handful of tokens embossed\n          with the Peep-O-Rama eye logo on them. There's a seat, a box\n          of Kleenex, a phone, and a grimy Plexiglas window with a metal\n          shutter over it.\n          \n          Nemo starts popping tokens into the slot next to the window,\n          pockets the rest of them.\n          \n          With a WHIR the metal shutter rises, revealing a WOMAN in a garter-belt\n          get-up perched on a stool. In a forgiving light, she might even\n          be beautiful.\n          \n          An LED display starts counting down from sixty - the seconds\n          remaining on the metered shutter. Nemo picks up the receiver.\n          \n           \n          \n          NEMO\n          \n          You got a name?\n          \n           \n          \n          WOMAN\n          \n          Holly Daze. Do you want me, baby?\n          \n           \n          \n          NEMO\n          \n          I need to see some sugar.\n          \n           \n          \n          Holly shrugs out of her bra, plants her scuffed-up high heels\n          on either side of the window, runs her hands up and down her\n          body, utters some tired-ass MOANS.\n          \n           \n          \n          NEMO\n          \n          Right on, sister...\n          \n           \n          \n          Nemo unbuckles his belt, drops his drawers...\n          \n           \n          \n          HOLLY\n          \n          (eyeing his endowment)\n          \n          Mmmm. Is that for me?\n          \n           \n          \n          NEMO\n          \n          Yeah, we're gonna celebrate Christmas a little early this year.\n          \n           \n          \n          HOLLY\n          \n          Keep doing that, honey, you'll go blind.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          INT. PEEP-O-RAMA BUDDY BOOTH - NIGHT\n          \n           \n          \n          Holly is still MOANING. Over on the LED display, Nemo's time\n          has just about expired.\n          \n           \n          \n          HOLLY\n          \n          Time's almost up, lover. Better hurry up with those tokens.\n          \n           \n          \n          NEMO\n          \n          Shitfire...\n          \n           \n          \n          Nemo fumbles with his pants, scoops out some more tokens...\n          \n          Too late, the shutter is already closing. Nemo feeds some more\n          tokens into the slot. Nothing happens. Nemo punches the LED display.\n          \n           \n          \n          NEMO\n          \n          Come on, fucker!\n          \n           \n          \n          The shutter starts rattling up again, only this time...\n          \n          ASHE\n          \n          is standing on the other side of the Plexiglas. His mouth splits\n          into an evil grin.\n          \n           \n          \n          ASHE\n          \n          \"Do you want me, baby?\"\n          \n           \n          \n          Nemo's eyes just about pop from his skull.\n          \n           \n          \n          NEMO\n          \n          You.\n          \n           \n          \n          ASHE\n          \n          Me.\n          \n           \n          \n          CRASH! Ashe slams his fists through the Plexiglas window, reaching\n          for Nemo's throat.\n          \n           \n          \n          INT. PEEP-O-RAMA, HALLWAY - NIGHT\n          \n           \n          \n          Nemo comes flying out the booth door. He struggles to rise. A\n          CHORUS OF ORGASMIC SIGHS and cheesy SURF MUSIC drifts out from\n          the other booths.\n          \n           \n          \n          ZEKE\n          \n          (o.s.)\n          \n          Hey, mime boy.\n          \n           \n          \n          AT THE FRONT COUNTER.\n          \n          ZEKE, the Peep-O-Rama's corpulent manager, is cradling a sawed-off\n          shotgun. BOOM! He blows a blast into Ashe's chest!\n          \n          Ashe starts toward Zeke, unfazed. Zeke moves to fire again...\n          \n          Ashe snatches the shotgun from the fat man's grasp, smashing\n          him in the face with the butt-end. Zeke falls back into a video\n          display, sending an avalanche of porno tapes raining down on\n          top of him.\n          \n          Seizing the moment, Nemo rushes for the exit...\n          \n          Ashe spins, pumps the shotgun, blows out one of Nemo's kneecaps.\n          Nemo collapses on the floor, wailing like a child. Ashe strides\n          over to him.\n          \n           \n          \n          ASHE\n          \n          One crow sorrow...\n          \n           \n          \n          He HEAVES Nemo through a glass display booth filled with sex\n          toys. Ashe punctuates each line of the nursery rhyme with a new\n          assault on Nemo.\n          \n           \n          \n          ASHE\n          \n          ...two crows joy...\n          \n           \n          \n          Nemo starts dragging his broken body across the floor. He finds\n          himself face to face with an anatomically-correct blow-up sex\n          doll - the kind with a built-in pre-recorded memory chip.\n          \n           \n          \n          DOLL\n          \n          Ooh, oh baby, I like it like that. You're so good. You're so\n          good...\n          \n           \n          \n          ASHE\n          \n          Three crows a letter, four crows a boy...\n          \n           \n          \n          Ashe HEAVES Nemo back the other way, sending him SMASHING into\n          the front counter. Peep-O-Rama tokens go flying, bouncing and\n          spinning every which way...\n          \n          CLOSE ON A SPINNING TOKEN\n          \n          On one side of the coin the eye is open, on the other it's closed\n          - this creates the illusion of the eye blinking.\n          \n           \n          \n          ASHE\n          \n          Five crows silver, six crows gold...\n          \n           \n          \n          Nemo utters a half-sob and rolls over, feebly wiping away the\n          blood which is clouding his eyes.\n          \n           \n          \n          ASHE\n          \n          Seven crows a secret never to be told.\n          \n           \n          \n          NEMO\n          \n          ...please, please just stop...\n          \n           \n          \n          Ashe pries open Nemo's eyes with his fingers.\n          \n           \n          \n          ASHE\n          \n          You killed my son, Nemo. You took away the only piece of light\n          left in my soul.\n          \n           \n          \n          NEMO\n          \n          We had to! Judah's orders. Never leave any witnesses! We didn't\n          have a choice!\n          \n           \n          \n          ASHE\n          \n          We always have a choice.\n          \n           \n          \n          Ashe plunges his fingers into Nemo's eyes - killing him off-camera.\n          He lifts up his now blood-covered hands and turns...\n          \n          Just then, Holly Daze bursts out into the hall. She sees Ashe\n          and YELPS, certain her number's up. Ashe grabs her by the wrist,\n          spinning her around.\n          \n           \n          \n          HOLLY DAZE\n          \n          (CRINGING)\n          \n          ...no...\n          \n           \n          \n          Ashe touches her face and sees a split-second FLASH of...\n          \n          HOLLY DAZE DANCING\n          \n          Jump-cut bump and grind, CAT-CALLS, LAUGHTER, the distorted faces\n          of men leering with their hungry eyes, tongues and sweaty palms\n          and heavy breath and I wanna be your fucking dog, baby, and...\n          \n          BANG! ASHE\n          \n          shuts his eyes, reeling...\n          \n          Ashe looks up at Holly - one victim to another. His eyes burn\n          a laser beam into her soul.\n          \n           \n          \n          ASHE\n          \n          If you value what you've lost, you'll walk away from this place\n          and never look back.\n          \n           \n          \n          Holly Daze nods with conviction. Ashe releases her. She bolts\n          like a rabbit flushed from cover.\n          \n          CUT TO:\n          \n           \n          \n          EXT. PEEP-O-RAMA - NIGHT\n          \n           \n          \n          Curve ROARS UP on his motorcycle, followed by Kali and a car-load\n          of ENFORCERS. The team grab their weapons, head for the porno\n          shop...\n          \n           \n          \n          KALI\n          \n          Inside!\n          \n           \n          \n          Kali leads the crew of killers into the porno shop. But Curve\n          stops, sensing something. He spins around...\n          \n          THE CROW\n          \n          is sitting atop one of the cars, watching him.\n          \n           \n          \n          INT. PEEP-O-RAMA, BACK CORRIDOR - NIGHT\n          \n           \n          \n          Kali and Curve move down the dark corridor. The PORN ACTRESS\n          VOICES from the vid-booths continue their ORGIASTIC MOANS, but\n          one voice in particular stand out.\n          \n           \n          \n          KALI\n          \n          Nemo?\n          \n           \n          \n          DOLL'S VOICE\n          \n          Ooh, oh baby, you're so good...\n          \n           \n          \n          CAMERA FINDS NEMO'S BODY\n          \n          at the end of the corridor, lounging in the arms of the sex doll\n          which is still repeating its tinny refrain. Nemo's neck has been\n          snapped and his head hangs at an awkward angle.\n          \n           \n          \n          DOLL\n          \n          ...oh! Oh yea, that's the spot. Do me, baby. Do me.\n          \n           \n          \n          There's a folded piece of paper shoved into Nemo's mouth. Curve\n          pries it out. The paper unfolds like one of those snowflake cut-outs\n          we used to make in grade school - only this cut-out is of a crow.\n          \n          Written across the paper crow are the following words:\n          \n          \" I KNOW WHY JESUS WEPT\"\n          \n           \n          \n          A phone on the wall is RINGING. RINGING and RINGING. Finally,\n          Curve leans in, snatches up he receiver...\n          \n           \n          \n          ASHE'S VOICE\n          \n          Do you know what they call a gathering of crows, Curve?\n          \n           \n          \n          At the sound of Ashe's voice, Curve's eyes widen with fear.\n          \n           \n          \n          ASHE'S VOICE\n          \n          A murder. A murder of crows. Think about it.\n          \n           \n          \n          CLICK! The line goes dead. Furious, Curve tears the phone from\n          the wall, HEAVING it across the porno shop.\n          \n          CUT TO:\n          \n          \n          EXT. STREET/CHURCH - NIGHT \n          \n          Ashe exits a phone booth, leaving the receiver dangling. A DOG\n          BARKS nearby, followed by the sound of CHILDREN LAUGHING. Ashe\n          turns and sees...\n          \n          A GROUP OF CHILDREN running away, giggling, their FOOTSTEPS receding\n          into the night.\n          \n          A BLACK DOG trots toward Ashe. The children have tied a plastic\n          skull mask to the dog's head. The skull dog trots up the street\n          towards...\n          \n          A SMALL, INNER-CITY LATINO CHURCH\n          \n          sandwiched between two derelict buildings. The doors are open\n          - there's a path of marigold petals leading up the front steps.\n          The skull dog trots up the steps and enters.\n          \n           \n          \n          INT. CHURCH - NIGHT\n          \n           \n          \n          Ashe moves into the sanctuary. He watches from the rear, entranced.\n          PEOPLE are scattered amongst the pews.\n          \n          At the altar is a lavish offrenda - an offering of food and drink\n          for the wandering dead decorated with sugar skulls and floral\n          garlands. Amidst the decorations are photos of departed loved\n          ones. There are tiers of candles surrounding these, scores of\n          them.\n          \n          An ELDERLY PRIEST emerges from a confessional, looking to Ashe\n          with a raised eyebrow...\"Next?\".\n          \n           \n          \n          PRIEST\n          \n          Can I help you?\n          \n           \n          \n          ASHE\n          \n          I'm sorry, Father, I was just watching...\n          \n           \n          \n          PRIEST\n          \n          Our doors are open.\n          \n           \n          \n          The Priest moves to a candelabra and lights some tapers.\n          \n           \n          \n          ASHE\n          \n          What is this for?\n          \n           \n          \n          PRIEST\n          \n          Dias de los Muertos, the Days of the Dead. We light the candles\n          for our loved ones - so that they might find their way back to\n          earth and share in the pleasures of the living.\n          \n           \n          \n          Ashe watches an OLD WOMAN place a toy motorcycle in front of\n          a picture of a child.\n          \n           \n          \n          PRIEST\n          \n          Tomorrow night we will celebrate. The people will dance, sing...\n          \n          (indicating Ashe's makeup)\n          \n          ...many will wear masks.\n          \n           \n          \n          ASHE\n          \n          Why?\n          \n           \n          \n          PRIEST\n          \n          Some spirits linger here too long. They become confused, mistaking\n          themselves for the living. They have to be frightened away.\n          \n           \n          \n          The priest nods to Ashe and moves down the aisle to the next\n          candelabra.\n          \n          A LITTLE BOY\n          \n          is watching Ashe from one of the back pews. He clutches a striped\n          ball. He drops it.\n          \n          The boy rolls the ball across the floor to Ashe. Ashe kneels\n          and catches it, rolling it back. The boy smiles.\n          \n           \n          \n          BOY\n          \n          Santa Muerte.\n          \n           \n          \n          Unnerved, Ashe retreats out of the sanctuarly, letting the night's\n          shadows swallow him up once more.\n          \n          CUT TO:\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah sits by her paintings. Gabriel suddenly stands, arching\n          his back, hair standing on end.\n          \n          ASHE\n          \n          appears on the ledge of the broken window, crouching there like\n          a gargoyle in silhouette.\n          \n           \n          \n          SARAH\n          \n          (hesitant, but relieved)\n          \n          You came back...\n          \n           \n          \n          ASHE\n          \n          Heaven wouldn't have me and Hell was afraid I'd take the place\n          over.\n          \n           \n          \n          Ashe drops into the loft.\n          \n           \n          \n          ASHE\n          \n          I needed to see you again.\n          \n           \n          \n          Ashe moves towards Sarah's paintings, pausing to study the one\n          of the woman being cradled in the arms of her ghostly lover.\n          He touches the woman's face.\n          \n           \n          \n          ASHE\n          \n          She looks like you.\n          \n           \n          \n          After a long moment, Sarah responds.\n          \n           \n          \n          SARAH\n          \n          I paint what I see.\n          \n           \n          \n          Ashe approaches Sarah. He points to the wedding ring which hands\n          from her neck.\n          \n           \n          \n          ASHE\n          \n          Were you married?\n          \n           \n          \n          SARAH\n          \n          It belonged to a friend.\n          \n           \n          \n          ASHE\n          \n          Where are they now?\n          \n           \n          \n          SARAH\n          \n          A better place.\n          \n           \n          \n          Sarah turns the ring around her finger, fidgeting with it.\n          \n           \n          \n          SARAH\n          \n          What about you?\n          \n           \n          \n          ASHE\n          \n          Danny's mother left after he was born. She was a drug addict.\n          \n           \n          \n          SARAH\n          \n          (NODDING)\n          \n          I lost my mother the same way.\n          \n           \n          \n          ASHE\n          \n          Small world.\n          \n           \n          \n          Sarah reaches for a cigarette and lights up, taking a long drag.\n          Ashe notices a number of scars on her forearm, possibly some\n          track marks...\n          \n          Sarah catches him looking, self-consciously pulls her hand back.\n          \n           \n          \n          SARAH\n          \n          (meeting his gaze)\n          \n          I left Detroit because I wanted to put the past behind me.\n          \n          (STRUGGLING)\n          \n          The problem is, I know how it ends. Blood. Violence. I don't\n          want a part of it anymore.\n          \n           \n          \n          Gabriel approaches Ashe. He crouches, runs his fingers along\n          the cat's back.\n          \n           \n          \n          ASHE\n          \n          What happens to me when I finish what I'm supposed to do here?\n          \n           \n          \n          SARAH\n          \n          You go back.\n          \n           \n          \n          ASHE\n          \n          What if I don't want to go back?\n          \n           \n          \n          Sarah looks away.\n          \n           \n          \n          SARAH\n          \n          Then you're damned\n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          CLOSE ON A VIDEO MONITOR. We're watching the tape documenting\n          Ashe's death. We see Ashe's face sinking beneath the water's\n          surface. The image freezes.\n          \n           \n          \n          CURVE (O.S.)\n          \n          It was him. It was that son of a bitch we dumped off the pier.\n          I know it.\n          \n           \n          \n          PULL BACK TO REVEAL Judah, Curve, and Kali gathered around the\n          monitor. Sibyl waits nearby. Curve is snapping open an envelope\n          of Trinity, sniffing up the contents.\n          \n           \n          \n          JUDAH\n          \n          I thought you killed him.\n          \n           \n          \n          CURVE\n          \n          I shot him in the head!\n          \n           \n          \n          KALI\n          \n          He's a ghost.\n          \n           \n          \n          CURVE\n          \n          No such thing as ghosts.\n          \n           \n          \n          KALI\n          \n          (POINTEDLY)\n          \n          Then who killed Spider Monkey and Nemo?\n          \n           \n          \n          Curve starts pacing, growing more apprehensive.\n          \n           \n          \n          CURVE\n          \n          All I know is, he's fucking with us. The Crow's his symbol, right?\n          That means I'm marked. It means he's coming for me now!\n          \n           \n          \n          KALI\n          \n          I thought you said you didn't believe?\n          \n           \n          \n          Curve turns on Kali, furious, ready to strike her. In a flash,\n          Kali has one of her katanas out.\n          \n          Curve backs away, bristling.\n          \n           \n          \n          CURVE\n          \n          Look, you want to tell yourselves some bullshit fairytales, that's\n          your business. But i'm not gonna sit here with a fucking target\n          on my chest. I'm going to take this motherfucker out!\n          \n           \n          \n          SIBYL\n          \n          You won't stop him with bullets or knives. He doesn't feel pain.\n          He doesn't bleed. Don't you see? His soul has crossed over. He's\n          come back from the other side.\n          \n           \n          \n          Curve looks like he's going to be sick from fear. But Kali and\n          Judah are listening intently.l\n          \n           \n          \n          JUDAH\n          \n          So how do you stop a man who's already dead?\n          \n           \n          \n          SIBYL\n          \n          Can you look destiny in the eye without flinching?\n          \n           \n          \n          Judah studies Sibyl's shadowed face.\n          \n           \n          \n          JUDAH\n          \n          You tell me.\n          \n           \n          \n          A stare-down ensues. Judah doesn't avert his gaze.\n          \n           \n          \n          SIBYL\n          \n          The Crow is the source of his power - his link between this world\n          and the next. Sever that link and he's as vulnerable as the next\n          man.\n          \n           \n          \n          CUT TO:\n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Ashe pushes through a curtain, turns towards Sarah's vanity --\n          SEES the knick-knacks and mementos gathered there, then SEES\n          the ceramic irony mask which hangs above. Ashe approaches, reaching\n          a hand out to trace its features.\n          \n          At the bottom of the mirror, a FADED POSTCARD has been tucked\n          between the frame and the glass. Ashe pulls it free, studying\n          it...\n          \n          CLOSE ON POSTCARD\n          \n          A carnival midway set on the beach, people strolling along a\n          boardwalk, golden sand and blue skies. WORDS at the top of the\n          picture read: \"WISH YOU WERE HERE\".\n          \n           \n          \n          ASHE\n          \n          I've been here.\n          \n           \n          \n          Ashe stares at the picture, entranced, caught up in a moment\n          of wistful nostalgia for the life he's lost.\n          \n           \n          \n          ASHE\n          \n          I took Danny last summer. We went up on the bike, rode all the\n          way up the coast...\n          \n          (BEAT)\n          \n          It was cold up there. I remember we could see each other's breath.\n          \n           \n          \n          Ashe catches himself, setting the postcard down. He turns his\n          back to Sarah, hiding his face form her, overcome by emotion.\n          \n          Sarah stands, drawing near. She reaches out to console him, touching\n          his shoulder. She alone, among all the souls of the world, understands\n          the isolation that is consuming Ashe.\n          \n           \n          \n          SARAH\n          \n          Look at me.\n          \n           \n          \n          But Ashe won't.\n          \n           \n          \n          SARAH\n          \n          Ashe. Look at me.\n          \n           \n          \n          Ashe finally turns around, a sense of deep and profound loss\n          in his eyes...\n          \n          Something unspoken passes between them. Sarah leans into Ashe,\n          tentative, eyes searching. It's one of those fragile moments\n          where things could go either way. And then...\n          \n           \n          \n          ASHE\n          \n          (pulling back)\n          \n          No...\n          \n          (turning away)\n          \n          We can't do this...\n          \n           \n          \n          The spell has been broken. Ashe starts away from her.\n          \n           \n          \n          ASHE\n          \n          I have to finish what I started. I have to find the others.\n          \n           \n          \n          SARAH\n          \n          I know.\n          \n           \n          \n          Ashe moves to the door, hesitant, a terrible sense of longing\n          gnawing at his heart.\n          \n           \n          \n          SARAH\n          \n          I wish I'd met you before.\n          \n           \n          \n          Ashe nods, then turns to leave. There's nothing else to say.\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah watches from her window as Ashe strides to his motorcycle.\n          She raises her hand up, as if to say good-bye.\n          \n           \n          \n          EXT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          As Ashe climbs aboard his bike, he catches sight of himself in\n          the...\n          \n          DISPLAY WINDOW OF A BAKERY\n          \n          Within the bakery are mountains of sugar skulls, candy skeletons,\n          and pan de muerte (bread of the dead). Ashe's reflection is superimposed\n          over this morbid tableau.\n          \n          Ashe fires up the bike's engine. He takes off down the street...\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          Judah moves back to the stag beetle, watching its Sisyphean efforts.\n          SCRITCH! SCRITCH!\n          \n           \n          \n          JUDAH\n          \n          So the Crow is Ashe's familiar...\n          \n          (to Sibyl)\n          \n          Can his power be taken?\n          \n           \n          \n          SIBYL\n          \n          The bird is the key, the life-force that flows within it...\n          \n           \n          \n          JUDAH\n          \n          (UNDERSTANDING)\n          \n          The blood of the Crow.\n          \n           \n          \n          Judah whirls around, his eyes glowing with a manic fervor.\n          \n           \n          \n          JUDAH\n          \n          (to Curve)\n          \n          The tattoo on your chest, who gave it to you?\n          \n           \n          \n          CURVE\n          \n          Some bitch down at the Gargoyle, but what's that got to do with...\n          \n           \n          \n          Judah grips Curve's shoulders tightly, shaking him.\n          \n           \n          \n          JUDAH\n          \n          Everything, you idiot! Find her. If she gave you his mark, then\n          she's connected to him in some way. She can lead us to him.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          EXT. DOCKS, COMMERCIAL WATERFRONT - DAWN\n          \n           \n          \n          Ashe stands at the end of the pier, staring down into the silent\n          waters where his natural life ended. He takes something from\n          his coat...\n          \n          THE PAINTING\n          \n          which Danny had been working on. It's got bullet holes in it\n          now.\n          \n          Ashe throws his arms back and lifts his face to the heavens,\n          SCREAMING, cursing his fate.\n          \n          ON ASHE,\n          \n          as seen from afar. A tiny figure dwarfed by the endless expanse\n          of ocean and sky.\n          \n          CUT TO:\n          \n           \n          \n          INT. GRAY GARGOYLE TATTOO SHOP - MOMENTS LATER\n          \n           \n          \n          SUPER TITLE:\n          \n          \"NOVEMBER 1ST - NOCHE DE LOS MUERTOS\"\n          \n          Curve and Kali have duct-taped Noah to one of the dentist chairs\n          - even his mouth and nose have been sealed shut. Curve lets Noah\n          thrash a moment, then violently rips the tape from Noah's face.\n          \n           \n          \n          NOAH\n          \n          (frightened, gasping)\n          \n          Look, what do you people want?\n          \n           \n          \n          CURVE\n          \n          A house in the country, a dog, a wife and two kids...\n          \n          (GRINS)\n          \n          ...your fucking head stapled to my saddlebags.\n          \n           \n          \n          KALI\n          \n          We're looking for Sarah. Where is she, Noah?\n          \n           \n          \n          NOAH\n          \n          I'm not going to tell you that...\n          \n           \n          \n          KALI\n          \n          Oh, but I think you are...\n          \n           \n          \n          Kali sites astride Noah. She reaches for one of the tattoo machines.\n          She motions to Curve, who hits the treadlight foot switch. Noah\n          eyes the sparking tattoo machine with rising apprehension as\n          Kali moves it towards his face.\n          \n          CLOSE ON THE NEEDLE\n          \n          a vibrating blur just a few centimeters from Noah's blinking\n          eye. Noah tries to shut his eyes. Kali forces an eye open with\n          the thumb and forefinger of her other hand.\n          \n          BACK TO SCENE\n          \n           \n          \n          KALI\n          \n          Last chance, \"love\".\n          \n           \n          \n          NOAH\n          \n          (DEFIANT)\n          \n          Get bent, you dried-up bitch.\n          \n           \n          \n          From behind, we see Kali lower the vibrating needle towards Noah's\n          eye. His SHRILL SCREAMS split the night as we...\n          \n          CUT TO:\n          \n           \n          \n          EXT. GRAY GARGOYLE TATTOO SHOP - NIGHT\n          \n           \n          \n          Curve and Kali are leaving the shop. Suddenly Curve clutches\n          at his chest, wincing in pain. He opens his coat, looks down\n          at his chest...\n          \n          THE CROW TATTOO\n          \n          is dripping blood from its beak and talons.\n          \n          Curve staggers back, horrified. Kali is watching him.\n          \n           \n          \n          CURVE\n          \n          No...no...\n          \n           \n          \n          KALI\n          \n          What is it?\n          \n           \n          \n          But Curve isn't listening. He leaps onto his motorcycle and hits\n          the ignition. He takes off with a ROAR...\n          \n           \n          \n          KALI\n          \n          Curve!\n          \n           \n          \n          It's no good. Curve is long gone.\n          \n          CUT TO:\n          \n           NOTE: The following scene appears here in the script, but in\n          the film it appears in Chapter 12. \n          \n           \n          \n          INT. SECOND COMING FETISH CLUB - NIGHT\n          \n           \n          \n          Curve makes his way to the bar. He rips open a glassine bag of\n          Trinity and vacuum snorts it. His eyes roll up in his head as\n          the chemicals flow. Another wave of pain washes over him. Curve\n          claws at his chest, falls against the bar...\n          \n           \n          \n          CURVE\n          \n          ...goawaygoawaygoawaygoaway...\n          \n           \n          \n          TIME SLOWS TO A CRAWL\n          \n          The MUSIC fades to a muted echo of distant WAR DRUMS. As a feeling\n          of inexorable doom settles over him, Curve lifts his head and\n          sees...\n          \n          ASHE\n          \n          reflected in the bar mirror, materializing out of the narcotic\n          haze. He's wading through the ocean of bodies. In his face paint\n          and black leather Ashe looks like he's just another part of the\n          twisted scene. people are stroking him, brushing up against him\n          - like they can leech off some of his morbid angel charisma.\n          \n          Ashe lifts his hand - he's clutching House o' Peep Zeke's sawed-off\n          shotgun.\n          \n          Curve DIVES to the floor as Ashe's shotgun blast shatters the\n          bar mirror, taking out his own reflection. Curve rolls, climbs\n          to his feet, starts running...\n          \n          The Samoan bartender grabs a semi-auto pistol, opens up on Ashe.\n          Now some of the other ARMED DOORMEN are FIRING too...\n          \n          ...but Ashe keeps on coming, trudging through the HAIL OF GUNFIRE.\n          Bullets are EXPLODING over his body at an insane rate. Ashe is\n          a human roman candle. Nothing is going to stop him from reaching\n          Curve, nothing.\n          \n          The Samoan stops firing. He takes one look at Ashe, who's still\n          coming at them...\n          \n          Fuck this. He turns tail and run.\n          \n           \n          \n          EXT. SECOND COMING FETISH CLUB - NIGHT\n          \n           \n          \n          Curve comes storming out the back door like a bat out of Hell.\n          He takes the rear stairs three at a time, spilling into a couple\n          of back-alley JUNKIES. He stumbles into a pile of garbage, scatters\n          some rats...\n          \n          Curve makes for his bike, which is parked nearby. He fumbles\n          with the key, hits the starter switch...\n          \n          Ashe comes flying off from a second story fire escape, landing\n          atop a car roof on all fours, popping the windows.\n          \n           \n          \n          ASHE\n          \n          Time's up, Curve.\n          \n           \n          \n          CURVE\n          \n          Fuck you, bird-dick!\n          \n           \n          \n          Curve jerks his bike towards the street and guns it...\n          \n           \n          \n          EXT. STREET - NIGHT\n          \n           \n          \n          Curve zooms by a bridal shop-sees his own reflection in the window.\n          \n           \n          \n          EXT. STREET - NIGHT\n          \n           \n          \n          Curve SHRIEKS, turns into the Alley, tachometer red-lining. He\n          glances behind him...The crow flies by.\n          \n          THE CROW\n          \n          plunges down from the night sky, wings flapping madly, quickly\n          gaining on Curve like the breath of death.\n          \n           \n          \n          EXT. CITY STREETS - NIGHT\n          \n           \n          \n          Ashe, in a dream-like state, races along.\n          \n           \n          \n          EXT. OVERPASS - NIGHT\n          \n           \n          \n          Curve leans in low, trying to urge his bike on by will-power\n          alone. He races by a warehouse, veering off the road onto the\n          railroad tracks.\n          \n          UP ABOVE,\n          \n          Ashe appears on the overpass, riding on his own motorcycle, matching\n          Curve's speed.\n          \n          THE CROW\n          \n          soars higher for a bird's eye view, tracking Curve's progress\n          as it sweeps past chimneys, swerves around billboards, ducks\n          under laundry lines...\n          \n          ON ASHE\n          \n          as he ROCKETS along the overpass. The Crow lands on his shoulder.\n          Ahead is a break in the guard rail. Ashe cuts sharply to the\n          right, taking the motorcycle airborne through the break in the\n          rail and...\n          \n          ASHE\n          \n          ...lands on the surface street some thirty feet below! Ashe is\n          now just behind Curve.\n          \n          CUT TO:\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Sarah is back at work on the painting of the woman being cradled\n          by her lover. Gabriel, who's lounging nearby, suddenly looks\n          up and HISSES.\n          \n          UP ABOVE THEM\n          \n          the Crow lands on the skylight, staring down at Sarah, watching...\n          \n          There's a KNOCK at her door. Sarah approaches, looks through\n          the peephole...\n          \n           \n          \n          SARAH\n          \n          Who is it?\n          \n           \n          \n          SARAH'S POV (THROUGH FISH-EYE PEEPHOLE)\n          \n          Kali stands there, cradling an automatic. She's flanked by TWO\n          IDENTICAL TWIN THUGS. Kali FIRES into the lock...\n          \n           \n          \n          EXT. TUNNEL MOUTH - NIGHT\n          \n           \n          \n          The chase continues. Curve approaches the bridge doing well past\n          ninety. Abruptly, he cuts down a roadway which parallels the\n          river. There's a chain-link running across the mouth of the tunnel.\n          \n          Up ahead is a hole in the fence leading down to a tunnel spillway.\n          Curve guides his bike through the hole...\n          \n           \n          \n          INT. TUNNEL - NIGHT\n          \n           \n          \n          Curve speeds into the dark tunnel, splashing through puddles\n          of water, whipping past graffiti. As he nears the mouth at the\n          other end, Curve brakes hard, TIRES SQUEALING, almost going down...\n          \n          CURVE'S POV\n          \n          We are now beneath the bridge. It's a stone-cold dead-end. The\n          roadway slopes sharply downward, spilling out into the concrete\n          river bed which is filled to capacity with rushing flood waters.\n          \n          BACK TO SCENE\n          \n          We hear the ROAR of an approaching motorcycle, then an engine\n          cutting out. Curve looks back the way he came...\n          \n          AT THE OPPOSITE END OF THE TUNNEL\n          \n          Ashe's siilhouette steps into view. He's on foot now, clutching\n          the sawed-off shotgun. He lets loose a LAUGH which chills Curve\n          to the bone.\n          \n           \n          \n          ASHE\n          \n          \"I have a rendezvous with Death, on some scarred slope of battered\n          hill...\"\n          \n           \n          \n          Ashe starts into the tunnel. His WET FOOTSTEPS echo off the weeping\n          walls...\n          \n           \n          \n          ASHE\n          \n          \"God knows, 'twere better to be deep where love throbs out in\n          blissful sleep, pulse nigh to pulse and breath to breath...\"\n          \n           \n          \n          As Ashe draws closer, his death-like face emerges from the gloom\n          - a ghastly visage floating in the ether...\n          \n           \n          \n          ASHE\n          \n          \"But I have a rendezvous with Death. And I to my pledged word\n          am true...\"\n          \n           \n          \n          Ashe stops some twenty feet away, grinning like the Cheshire\n          Cat.\n          \n           \n          \n          ASHE\n          \n          \"I shall not fail that rendezvous.\"\n          \n           \n          \n          Silence like knives. Ashe and Curve facing one another. Curve\n          is tense, dry-mouthed...\n          \n           \n          \n          CURVE\n          \n          You think i'm afraid of you, you fucking freak?! YOU THINK I'M\n          AFRAID?!!\n          \n           \n          \n          Curve SCREAMS and guns his cycle forward, rolling the throttle\n          all the way open - a kamikaze run aimed straight at Ashe.\n          \n          Ashe stands his groupd, lifts the shotgun, FIRST at Curve's customized\n          teardrop gas tank. There's the woman doing the wild thing with\n          Death and...\n          \n          BOOM! CURVE'S MOTORCYCLE\n          \n          disintegrates beneath him, breaking apart into a RUSHING COMET\n          OF FLAMING WRECKAGE. Shrapnel skids along the tunnel walls, SPEWING\n          SPARKS.\n          \n          CURVE\n          \n          lies on the garbage-strewn tunnel floor in a spreading pool of\n          blood - burnt, battered, a barb of steel sticking up from his\n          chest. Still, Curve has one glorious, giddy moment where he thinks\n          he's actually succeeded in defeeating Ashe, then...\n          \n          CURVE'S POV\n          \n          as Ashe steps through the gasoline flames.\n          \n          Curve's elation vaporizes.\n          \n           \n          \n          ASHE\n          \n          Can you hear me, Curve?\n          \n           \n          \n          Curve offers a weak nod.\n          \n           \n          \n          ASHE\n          \n          You're going to die now.\n          \n           \n          \n          Curve tries to speak, blood spills from his mouth. Ashe places\n          a finger to his lips.\n          \n          Ashe drops down, kneeling over Curve's chest.\n          \n           \n          \n          ASHE\n          \n          People used to put coins in the mouths of the dead. Do you know\n          why? So they could pay the ferryman to take them across the river\n          Styx.\n          \n          (reaching to Curve's ear)\n          \n          What's this?\n          \n           \n          \n          In a parody of a stage magician, Ashe retrieves one of the Peep-O-Rama\n          tokens from Curve's ear. The embossed eye logo flashes.\n          \n           \n          \n          ASHE\n          \n          Open your mouth, Curve.\n          \n           \n          \n          Curve,s eyes are wide, filled with terror. He MOANS.\n          \n           \n          \n          ASHE\n          \n          Shhh. It's not so bad. Trust me. I've been there.\n          \n           \n          \n          Curve slowly opens his mouth. Tears run from his eyes. Ashe places\n          the coin on Curve's tongue, like a priest administering a Holy\n          wafer.\n          \n          Ashe stands, grabs Curve by the coat collar. He pulls him back\n          towards the end of the tunnel...\n          \n           \n          \n          EXT. TUNNEL MOUTH/RIVER - NIGHT\n          \n           \n          \n          Ashe drags Curve down the sloping end of the spillway to the\n          waters edge.\n          \n           \n          \n          ASHE\n          \n          I want to thank you for showing me my pain, Curve. You made me\n          what I am.\n          \n           \n          \n          ON ASHE\n          \n          As he releases Curve, letting the current carry him away. Ashe\n          stands, tracking Curve's progress.\n          \n          ON CURVE\n          \n          as he floats downstream, limbs outstretched, consciousness fading\n          fast.\n          \n          CURVE'S POV\n          \n          GHOSTLY FACES stare down at him from the girders - people who\n          have made their home in the underbelly of the bridge which stretches\n          overhead.\n          \n          A WOMAN lets loose a cloud of marigold petals. They flutter down\n          around Curve, swirling in the currents.\n          \n          PULL BACK TO REVEAL\n          \n          the petals have clustered around Curve's body in the shape of\n          a Crow. Curve continues to float downstream towards an estuary,\n          borne away on the wings of the bird.\n          \n           END OF MOVED SCENE \n          \n           \n          \n          INT. TUNNEL - NIGHT\n          \n           \n          \n          Ashe starts back into the tunnel. He pauses a moment, kneeling\n          down, lowering his head. Whether out of respect for the dead\n          or his own condition, we'll never know.\n          \n          After a minute, Ashe lifts his head again and stands. It's time\n          to see his mission through to the end.\n          \n          CUT TO:\n          \n           \n          \n          INT. TUNNEL - NIGHT\n          \n           \n          \n          Ashe is heading back from the river when he's struck by...\n          \n          A VISION OF THE CROW'S POV OF SARAH\n          \n          ASHE\n          \n          is seeing what the crow is witnessing - Sarah in danger.\n          \n           \n          \n          ASHE\n          \n          Sarah!\n          \n           \n          \n          Ashe starts to run, back toward his bike...\n          \n          CUT TO:\n          \n          EXT. CITY STREETS - NIGHT\n          \n           \n          \n          Ashe is on the motorcycle, racing through the streets. He takes\n          a corner on a skid, zipping past the Gray Gargoyle and the neighboring\n          train tracks.\n          \n          CUT TO:\n          \n           \n          \n          EXT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Ashe pulls up on the motorcycle, SCREECHING to a stop. He leaps\n          from the bike, rushing into Sarah's building.\n          \n           \n          \n          INT. SARAH'S LOFT - NIGHT\n          \n           \n          \n          Ashe stumbles through the doorway into the loft...\n          \n          The loft has been trashed. Furniture turned over, paintings slashed,\n          the ceramic irony mask smashed into pieces...\n          \n           \n          \n          ASHE\n          \n          (alarmed, desperately looking for her)\n          \n          Sarah?!\n          \n           \n          \n          KALI (O.S.)\n          \n          Sarah's gone, ghost man.\n          \n           \n          \n          Ashe whirls around\n          \n          KALI\n          \n          who had been standing still amidst the shadows, now moves from\n          behind Sarah's paintings.\n          \n           \n          \n          ASHE\n          \n          Where is she?\n          \n           \n          \n          KALI\n          \n          Judah's tower. He's waiting for you there.\n          \n           \n          \n          As Kali steps closer we see that she's dressed for war -- a katana\n          secured in a black scabbard, twin daggers on each hip, a bandoleer\n          of throwing stars.\n          \n           \n          \n          ASHE\n          \n          You took my son's life.\n          \n           \n          \n          KALI\n          \n          (GASPING)\n          \n          Some people are born victims.\n          \n           \n          \n          ASHE\n          \n          It takes two to make a murder.\n          \n           \n          \n          Kali unsheathes her katana. The blade edge catches the streetlight's\n          glare coming in from the window.\n          \n           \n          \n          KALI\n          \n          Shall we dance?\n          \n           \n          \n          Kali comes at Ashe blindingly fast. She spins and cartwheels\n          end over end, somersaulting. As she lands, Kali shifts into Ginsu-mode,\n          her blade a whirling blur...\n          \n          Ashe ducks under the blade, trapping Kali's sword arm. He twists\n          his hands, SNAPPING her arm...\n          \n          As Kali CRIES OUT, Ashe pivots, THROWING HER towards the half-moon\n          window looking out over the street...\n          \n          CUT TO:\n          \n           \n          \n          INT. CAMPANILE - JUDAH'S TOWER - NIGHT\n          \n           \n          \n          Sarah's eyelids flutter open with a start. She's waking on the\n          heels of a dream.\n          \n          PULL BACK to reveal Sarah curled up on the cold tile floor, a\n          number of candles burning nearby. Sarah sits up, disoriented.\n          Upon moving her arm she finds that it's been shackled to one\n          of the pillars via a long chain.\n          \n          Sarah wastes a few moments tugging at her tether, trying to snap\n          one of the links, but it's no good.\n          \n          Frustrated, Sarah looks around, trying to get her bearings...\n          \n          SIBYL\n          \n          is standing a few yards away, cloaked in darkness, head bowed.\n          Sarah didn't notice her at first.\n          \n           \n          \n          SARAH\n          \n          Where am I?\n          \n           \n          \n          SIBYL\n          \n          The Tower. Everyone finds their way here eventually.\n          \n           \n          \n          Sarah rises from the floor, a little unsteady. She moves towards\n          Sibyl, reaches out to touch her shoulder. The prophetess abruptly\n          lifts her head, causing her hood to fall back. Sarah takes a\n          step back, GASPING...\n          \n          SIBYL'S EMPTY EYE SOCKETS\n          \n          have been sewn shut with black thread.\n          \n           \n          \n          SARAH\n          \n          My God. What happened to you...?\n          \n           \n          \n          JUDAH (O.S.)\n          \n          Fate happened to her.\n          \n           \n          \n          Sarah spins...\n          \n          JUDAH\n          \n          emerges from the gloom, almost as if he were materializing from\n          the shadows themselves.\n          \n           \n          \n          JUDAH\n          \n          Sibyl's been cursed with the gift of prophecy. She sees things\n          that are fated to happen...\n          \n          (BEAT)\n          \n          She cut her eyes out with a carving knife because she wanted\n          to make the visions stop...\n          \n           \n          \n          Judah brushes the back of his hand affectionately against Sibyl's\n          cheek.\n          \n           \n          \n          JUDAH\n          \n          ...but that only made the visions stronger, didn't it, dear?\n          \n           \n          \n          Sibyl turns her head away from Judah, shunning his caress.\n          \n           \n          \n          SIBYL\n          \n          I've learned to live with my affliction.\n          \n           \n          \n          JUDAH\n          \n          Don't we all.\n          \n           \n          \n          Sarah backs away from Judah, wary.\n          \n           \n          \n          SARAH\n          \n          Judah Earl.\n          \n           \n          \n          JUDAH\n          \n          My reputation precedes me.\n          \n           \n          \n          SARAH\n          \n          (DISGUSTED)\n          \n          I've seen what your drugs have done to this city.\n          \n           \n          \n          JUDAH\n          \n          (SHRUGGING)\n          \n          I saw a need, I exploited it. It's all economics, Sarah. Supply\n          and demand.\n          \n           \n          \n          SARAH\n          \n          Why did you bring me here?\n          \n           \n          \n          JUDAH\n          \n          I'm glad you asked that, Sarah. You've got a very important part\n          to play in this little drama of ours. You see, I intend to capture\n          the Crow...\n          \n           \n          \n          Judah draws near, devouring Sarah with his hungry eyes. USING\n          A JAGGED FINGERNAIL, HE INCISES A CROSS INTO HER FOREHEAD.\n          \n           \n          \n          JUDAH (O.S.)\n          \n          ... and you, my dear, are the birdseed.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          EXT. SARAH'S LOFT/ALLEY - NIGHT\n          \n           \n          \n          Kali comes CRASHING through the window, falling down to the sidewalk\n          below. She lands atop a wrecked car, snapping her back in two...\n          \n          CLOSE ON KALI\n          \n          lies on the ground, her limbs twisted at awkward angles. She\n          MOANS, somehow still alive.\n          \n          KALI'S POV\n          \n          as Ashe approaches. The Crow flits in from off-screen, landing\n          on his shoulder. Watching Kali with it's curious golden eyes.\n          \n          As Ashe draws near, Kali tries to rise. The most she can do is\n          lift her head.\n          \n           \n          \n          KALI\n          \n          (GASPING)\n          \n          I...can't...move...\n          \n           \n          \n          Ashe stares at her, dispassionate.\n          \n           \n          \n          KALI\n          \n          Kill...me, then...finish...it...\n          \n           \n          \n          Ashe simply shakes his head.\n          \n           \n          \n          KALI\n          \n          You...have to.\n          \n           \n          \n          ASHE\n          \n          My job is to send you to hell. You're in it.\n          \n           \n          \n          Kali stares at Ashe in disbelief, her stoic warrior's mien quickly\n          evaporating.\n          \n           \n          \n          KALI\n          \n          There's no...honor in this. It's my...death. I've won it..\n          \n           \n          \n          Ashe turns and starts away.\n          \n           \n          \n          ASHE\n          \n          Me, too.\n          \n           \n          \n          KALI\n          \n          Wait! Where are you going?! Wait! You can't...do this! You can't\n          do this!!!\n          \n           \n          \n          But Ashe doesn't turn back. He leaves Kali in the cold, wet street,\n          ignoring her pathetic laments.\n          \n          Ashe continues on to the end of the alley...\n          \n          THE CROW\n          \n          lands on Ashe's outstretched hand.\n          \n          The Crow takes wing, lifting its way up into the night.\n          \n          Ashe fires up the motorcycle's engine, tearing away from Sarah's\n          apartment in a cloud of smoke.\n          \n          CUT TO:\n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          The scene resumes. Sarah stares at Judah, horrified.\n          \n           \n          \n          SARAH\n          \n          Why are you doing this?\n          \n           \n          \n          JUDAH\n          \n          Have you ever read Dante's Inferno? It says that the only true\n          path through Hell lies at its center. If you want to escape it\n          -- you have to go further in.\n          \n           \n          \n          Judah lowers himself into a chair.\n          \n           \n          \n          JUDAH\n          \n          When I was a boy I fell through the ice of a lake. I remember\n          seeing the sky through the ice above me, close enough to touch.\n          The world grew cold around me. Dark. Eventually my heart stopped\n          beating. And in that moment, I died.\n          \n           \n          \n          Judah sweeps his hand through one of the candle flames, then\n          pinches the flame out of existence. A tiny wisp of smoke trails\n          up into shadow.\n          \n          Judah settles back in his chair, overcome by a memory that for\n          him has never lost its vibrancy.\n          \n           \n          \n          JUDAH\n          \n          A half-hour later I awoke on an operating table. I had returned\n          to the world of flesh and bone -- But I brought a knowledge back\n          with me...\n          \n          (tapping his forehead)\n          \n          Forbidden knowledge.\n          \n           \n          \n          Judah leans in close to Sarah, his lambent eyes glowing like\n          hot coals. As Judah continues, Sarah fingers the ankh which hangs\n          from her neck.\n          \n           \n          \n          JUDAH\n          \n          I've been living on borrowed time ever since. I've always known\n          Death would be coming for me.\n          \n          (BEAT)\n          \n          I see now that your friend is the one I've been waiting for.\n          \n           \n          \n          SARAH\n          \n          You can't stop him.\n          \n           \n          \n          JUDAH\n          \n          You're wrong, Sarah.\n          \n          (RISING)\n          \n          There is a way to defeat Death... and that's to trade places\n          with him.\n          \n           \n          \n          Sibyl turns her head towards the east.\n          \n           \n          \n          SIBYL\n          \n          The Crow is coming.\n          \n           \n          \n          Judah looks back at Sarah.\n          \n          CUT TO:\n          \n           \n          \n          EXT. CITY STREETS - NIGHT\n          \n           \n          \n          Ashe comes screaming over a hill on his motorcycle, the image\n          of Judah's face burned into his mind...\n          \n          A HORSE-DRAWN CARRIAGE\n          \n          piloted by a man in a devil mask suddenly looms up in front of\n          Ashe. The street ahead has been cordoned off with flashing wooden\n          barricades. There's some kind of street fiesta going on...\n          \n          Ashe swerves, BRAKING HARD to avoid hitting the carriage. Ashe's\n          bike slips out from under him and Ashe goes CRASHING into the\n          barricades. But even as the carriage's skull-faced costumed occupants\n          rush up to help him...\n          \n          ... Ashe is up and running, leaping over the barricades into\n          the crowd beyond...\n          \n          CUT TO:\n          \n           \n          \n          EXT. JUDAH'S TOWER - JESUS SAVES SIGN - NIGHT\n          \n           \n          \n          The Crow lands atop the buzzing \"JESUS SAVES\" sign. It cocks\n          its head, as if considering its next move, then flies toward\n          the campanile.\n          \n           \n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          The Crow enters through one of the openings in the grillework,\n          settling on one of the rafters.\n          \n          CROW'S POV\n          \n          Sarah sits within one of the pools of illumination far below,\n          still bound to the bed by the chain. Judah and Sibyl are nowhere\n          in sight.\n          \n          THE CROW\n          \n          flies down from the rafters, landing on the floor at Sarah's\n          feet. It CAWS at her, trying to communicate.\n          \n           \n          \n          SARAH\n          \n          ...go...please go...\n          \n           \n          \n          The Crow tilts its head as if trying to understand...\n          \n           \n          \n          SARAH\n          \n          (shaking her chain)\n          \n          GO!!!\n          \n           \n          \n          WHOOSH! A steel cage on a wire and pulley system CLATTERS down\n          from above, SLAMMING to the floor and trapping the bird within\n          it. The bird CAWS angrily, flitting from one side of the cage\n          to another, but its efforts are futile.\n          \n          CROW'S POV (ANAMORPHIC)\n          \n          as Judah emerges from the darkness, crouching down on the floor\n          to study the Crow. He grins.\n          \n           \n          \n          JUDAH\n          \n          Look who's come home to roost.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          EXT. STREET - DAY OF THE DEAD CELEBRATION - NIGHT\n          \n           \n          \n          A massive street festival is under way with Dia de los Muertos\n          CELEBRANTS mobbing the area. Paper \"BIENVENIDOS\" banners are\n          strung overhead. CHILDREN light strings of firecrackers. Masked\n          MUMMERS in garish costumes dance, MUSICIANS stroll. People are\n          holding giant papier-mache skulls on sticks along with torches\n          and calavera placards.\n          \n          There are stalls offering marigolds and cockscomb, black beeswax\n          tapers, dangling toy skeletons, mountains of calaveras de azucar.\n          \n          ASHE\n          \n          pushes through the throng of revelers, invisible amidst the carnival\n          atmosphere. In his makeup he's just another face in the crowd.\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S CAMPANILE/CAMERA OBSCURA - NIGHT\n          \n           \n          \n          Judah, now carrying the cage which contains the Crow, sweeps\n          aside the curtain of the camera obscura. He reaches up to a lever\n          which opens the camera's lens. Moonlight shines down on the camera\n          table. With another lever, Judah adjusts the camera's view.\n          \n          CAMERA TABLE\n          \n          The camera lens is now trained on the night sky. A churning landscape\n          of night-sky coulds drifts across the table's surface, creating\n          an eerie effect.\n          \n          JUDAH\n          \n          sets a package wrapped in velvet on the camera table. He peels\n          back the cloth, revealing a set of ornately decorated, tapered\n          daggers. He looks back at Sarah.\n          \n           \n          \n          JUDAH\n          \n          Do you know what these are called? Misericords. Wonderful name,\n          isn't it?\n          \n           \n          \n          Judah removes one of the blades from its sheath, running the\n          glinting edge along his finger.\n          \n           \n          \n          JUDAH In the Dark Ages, these were used to deliver the death\n          stroke to the mortally wounded. They were considered tools of\n          mercy.\n          \n           \n          \n          Judah turns to the steel cage in which the Crow has been trapped.\n          \n          He pulls on a leather falconer's glove and opens the door to\n          the cage. The Crow flaps his wings madly, desperately trying\n          to strike at Judah with its beak and claws...\n          \n          ... but Judah secures his grip around the bird's throat, pulling\n          it out. He pins the Crow to the focusing table of the camera\n          obscura with his gloved hand.\n          \n          CUT TO:\n          \n           \n          \n          EXT. STREET - DAY OF THE DEAD CELEBRATION - NIGHT\n          \n           \n          \n          Ashe fights his way through the crowd. A drunken, MASKED WOMAN\n          grabs hold of him, spins him around, dancing. Ashe shoves her\n          aside, making his way to...\n          \n           \n          \n          EXT. JUDAH'S TOWER, STREET LEVEL - NIGHT\n          \n           \n          \n          The black sky beyond shimmers with turbulent yellow thunderheads.\n          The entry way to the tower has been gated and chained. The only\n          way in is up.\n          \n           \n          \n          EXT. JUDAH'S TOWER, STREET LEVEL - NIGHT\n          \n           \n          \n          Ashe grabs a hold of one of the ornamental statues which crowd\n          th ebuildint's facade. He pulls himself up, starting the daunting\n          task of scaling the tower.\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S CAMPANILE/CAMERA OBSCURA - NIGHT\n          \n           \n          \n          Back to Judah and the Crow. The clouds being projected onto the\n          camera table (and subsequently the Crow itself) are rushing at\n          an unearthly speed. The create a surreal backdrop for the Crow's\n          frenetically beating wings - in effect, a mockery of the bird\n          flying.\n          \n           \n          \n          JUDAH\n          \n          Easy, little wing. It will all be over soon.\n          \n           \n          \n          EXT. JUDAH'S TOWER - NIGHT\n          \n           \n          \n          Ashe continues to climb. A cluster of PIGEONS take wing, startled\n          from their roost...\n          \n          Ashe pulls back, one of his hands slipping free. He dangles there\n          for a moment, hanging by the tenuous grasp of his fingertips.\n          \n          SIBYL\n          \n          who has been lurking in the shadows, suddenly lifts her head\n          up...\n          \n           \n          \n          SIBYL\n          \n          (full of portent)\n          \n          Ashe is here.\n          \n           \n          \n          Judah grins. This moment has been a long time coming...\n          \n           \n          \n          JUDAH\n          \n          Not for long.\n          \n           \n          \n          Judah raises the misericord up high. Sarah turns her head away\n          as...\n          \n          ...Judah plunges the weapon down, pounding it straight through\n          the bird's right wing!\n          \n          CUT TO:\n          \n           \n          \n          EXT. JUDAH'S TOWER - NIGHT\n          \n           \n          \n          Ten stories up now. Ashe suddenly loses his handhold. He SCREAMS\n          in agony as he suffers the pain of the Crow through their symbiotic\n          link. Ashe stares down at his hand in disbelief...\n          \n          CLOSE ON ASHE'S HAND\n          \n          Blood seeps from a stigma-like wound on his palm.\n          \n           \n          \n          INT. JUDAH'S TOWER - CAMERA OBSCURA - NIGHT\n          \n           \n          \n          Judah plunges a second misericord into the Crow's left wing...\n          \n           \n          \n          EXT. JUDAH'S TOWER\n          \n           \n          \n          Ashe CRIES OUT again as his left hand is seemingly twisted back\n          against his will. A second stigma wound appears.\n          \n          He slips, tumbling to the next ledge down but catching himself\n          on his fingertips. He hazards a look down...\n          \n          ASHE'S POV\n          \n          Day of the Dead CELEBRANTS crowd the streets far below.\n          \n          BACK TO SCENE\n          \n           \n          \n          ASHE\n          \n          (in agony)\n          \n          ...oh God...help me...\n          \n           \n          \n          It takes every ounce of Ashe's strength to keep from letting\n          go. He tightens his white-knuckled grip on the ledge above.\n          \n          Shaking terribly, trying to fight back the pain, Ashe continues\n          to climb. He reaches up to a...\n          \n          STONE MAIDEN\n          \n          which protrudes from the building's facade. The maiden's face\n          has been all but worn bare by the harsh elements.\n          \n          Ashe clutches the back of the maiden in a parody of a lover's\n          embrace. Using the statue for support, he drags himself back\n          up to relative safety. Now Ashe is face to face with the maiden,\n          staring into its blind stone eyes.\n          \n           \n          \n          ASHE\n          \n          Sarah.\n          \n           \n          \n          Ashe whispers the word like a mantra, using it to urge him on.\n          Steeling himself again, fighting the burning pain, Ashe resumes\n          his climb. He's on autopilot now, just trying to reach the campanile,\n          which at this point, seems hopelessly unattainable.\n          \n          THE SKY ABOVE\n          \n          seems to churn and roil. A storm of epic proportions is about\n          to break.\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S CAMPANILE - CAMERA OBSCURA - NIGHT\n          \n           \n          \n          The Crow has now been crucified to the camera table, a misericord\n          staked through each wing.\n          \n          CROW'S ANAMORPHIC POV\n          \n          as Judah reaches for a third misericord. He raises it high above\n          his head, preparing for the coup de grace.\n          \n           \n          \n          JUDAH\n          \n          (WHISPERING)\n          \n          Ashes, ashes, we all fall down...\n          \n           \n          \n          As the dagger comes down we hear...\n          \n           \n          \n          SARAH\n          \n          (SCREAMING)\n          \n          No!!!!\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          EXT. JUDAH'S TOWER - NIGHT\n          \n           \n          \n          Ashe Cries out a final time as a GAPING WOUND appears on his\n          chest, BLOOD BLOSSOMING outward.\n          \n          CITY STREET\n          \n          The Day of the Dead celebrants swirl around us, Judah's Tower\n          rising up behind the mob - an unholy ziggurat built to challenge\n          the gods. The CROWD has been worked up into a frenzy. Everyone\n          is singing and dancing. MUSIC blasts from loudspeakers...\n          \n          ASHE\n          \n          comes CRASHING DOWN atop a small vending stall filled to the\n          brim with flowers an sugar skulls. Time slows as a flurry of\n          golder marigold petals flutter down around his still form.\n          \n           \n          \n          INT. JUDAH'S CAMERA OBSCURA - NIGHT\n          \n           \n          \n          The Crow is dead, transfixed by the gleaming misericords. Blood\n          is pooling beneath black flight feathers.\n          \n          Judah steps back, momentarily overwhelmed by the enormity of\n          his crime.\n          \n           \n          \n          JUDAH\n          \n          It's done.\n          \n           \n          \n          Judah looks to the camera obscura's table. The blood from the\n          Crow has completely covered the table's concave surface, filling\n          it to the brim like liquid in a shallow bowl. The end result\n          is an eerie reflecting pool.\n          \n          AS WE WATCH, THE IMAGE OF THE CLOUDS\n          \n          cast by the camera lens onto the table begins to ripple and dissolve,\n          only to be replaced by Judah's own, shimmering reflection.\n          \n          BACK TO SCENE\n          \n          With a shaking hand, Judah dips his fingers into the pooling\n          blood and begins to paint his face. A swatch of blood over one\n          eye, then a swatch over the other. A long, bloody smear over\n          his lips...\n          \n          The action harkens back to the moment when Sarah painted Ashe's\n          face - a parallel ritual turned on its head.\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S CAMPANILE - CAMERA OBSCURA - NIGHT\n          \n           \n          \n          Judah turns towards us, his transformation now complete. We see\n          that he has painted himself a parody of Ashe's irony mask in\n          the Crow's own blood.\n          \n          SARAH\n          \n          watches with a mixture of mounting horror and morbid curiousity.\n          \n          JUDAH\n          \n          scoops up a handful of the Crow's blood and brings it to his\n          lips.\n          \n          CLOSE ON JUDAH'S LIPS\n          \n          as he drinks, letting the overflow trickle down over his chin\n          and neck.\n          \n          CLOSE ON JUDAH'S FACE\n          \n          his once-pallid features now glow with a kind of beatific radiance.\n          \n          WE RISE UP\n          \n          from Judah, up and up into the darkest reaches of his tower.\n          Judah is LAUGHING, laughing in the face of Death itself.\n          \n          CUT TO:\n          \n           \n          \n          EXT. JUDAH'S TOWER - STREET\n          \n           \n          \n          Ashe lies amidst a field of shimmering glass shards and flowers.\n          \n          THE MASKED CELEBRANTS\n          \n          slowly gather around Ashe, craning their necks for a view of\n          the fallen angel.\n          \n          CLOSE ON ASHE'S FACE\n          \n          Relaxed, peaceful, even. For a moment, we aren't sure whether\n          or not Ashe's soul has fled.\n          \n          The peripheral noise from the street festival dies away. We're\n          in the eye of the hurricane now. Once again, time seems to shudder\n          to a stop. And the only thing we hear are...\n          \n          THE CROWS\n          \n          Thousands of them, filling the heavens with their KEENING WAILS.\n          \n          Ashe slowly opens his eyes, tentative. When you're this deep\n          in the bosom of bliss, the last thing you want to do is waken,\n          but waken he does...\n          \n          ASHE'S POV - THE SKY ABOVE JUDAH'S TOWER\n          \n          is black with crows. And endless army of carrion-creatures, swirling\n          madly about.\n          \n          BACK TO SCENE\n          \n          Ashe sits up, stares at the crows, fascinated, frightened. Then\n          his eyes fall to the faces of the people around him. We are in\n          dream-time now, blurring the edges of reality.\n          \n          A CHILD\n          \n          wearing a skull mask pushes to the front of the crowd. He stares\n          at Ashe a moment, then lifts the mask from his face...\n          \n          It's Danny.\n          \n           \n          \n          ASHE\n          \n          (CONFUSED)\n          \n          Danny...?\n          \n           \n          \n          Ashe rushes to Danny's side, holding him tight, his disbelief\n          overpowered by the unfettered joy of seeing his son once again.\n          \n           \n          \n          ASHE\n          \n          What are you doing here?!\n          \n           \n          \n          DANNY\n          \n          It's time to go back, Dad.\n          \n           \n          \n          Ashe looks up at the screaming crows above them.\n          \n           \n          \n          ASHE\n          \n          Is that why they're here?\n          \n           \n          \n          DANNY\n          \n          (NODDING)\n          \n          They're the souls who came before you. They're crying for the\n          people they've lost.\n          \n          (BEAT)\n          \n          Now they're crying for you.\n          \n           \n          \n          ASHE\n          \n          But Sarah still needs me.\n          \n           \n          \n          DANNY\n          \n          You don't understand, Dad. You work for the dead, not the living.\n          Your work here is done.\n          \n           \n          \n          Ashe reaches for his son's shoulders, all but pleading with him.\n          \n           \n          \n          ASHE\n          \n          I can't go, not yet, not now...\n          \n           \n          \n          DANNY\n          \n          You have to.\n          \n           \n          \n          ASHE\n          \n          Danny, I can't leave her like this...\n          \n           \n          \n          The CRIES of the crows grow louder as the sky above becomes darker.\n          \n          A shadow passes over Danny's face. He Seems Saddened. For a moment,\n          it seems as if another entity creeps into Danny's voice.\n          \n           \n          \n          DANNY\n          \n          If you turn your back on the dead now, you'll be trapped between\n          the worlds. You'll never be allowed to cross over.\n          \n          (BEAT)\n          \n          You'll be alone, Dad. Forever.\n          \n           \n          \n          Ashe hesitates a moment, realizing the enormity of what he is\n          about to do. It's an agonizing choice.\n          \n           \n          \n          ASHE\n          \n          I have to stay.\n          \n           \n          \n          Danny nods.\n          \n           \n          \n          DANNY\n          \n          I know.\n          \n           \n          \n          Danny reaches out to touch Ashe's painted face...\n          \n           \n          \n          DANNY\n          \n          (FORLORN)\n          \n          Good-bye, Dad.\n          \n           \n          \n          As Danny says his parting words, the SOUNDS of the world around\n          them come rushing back with startling clarity. Danny starts to\n          turn away...\n          \n           \n          \n          ASHE\n          \n          Danny, wait...!\n          \n           \n          \n          WHAM! Ashe bolts up from the bed of flowers and glass. The spell\n          is broken. Was he dreaming...?\n          \n          No, there's Danny slipping back into the crows, the mask pulled\n          down over his face once again.\n          \n          Ashe reaches for Danny, spinning him around, pulling off the\n          mask...\n          \n          ...only it's not Danny! It's a drunken DWARF with fucked-up teeth\n          who's laughing his ass of at Ashe. Ashe recoils, horrified, then\n          spins around, suddenly finding himself face to face with...\n          \n          JUDAH\n          \n          standing just a few yards away, emerging from the doorway of\n          his tower. He got the anti-Crow blood mask on his face. His eyes\n          are glowing like twin stars and his lips are curled back in a\n          feral snarl. In his hands, he holds one of the chains from his\n          campanile.\n          \n          Judah grabs Ashe by the lapels of his coat, draging him close\n          so they're eye to eye -- close enough to breathe the same beath\n          -- two sides of a coin.\n          \n           \n          \n          JUDAH\n          \n          Tell me, Ashe. Do you every get the feeling we're all just dead\n          men on leave?\n          \n           \n          \n          ASHE\n          \n          (seething with hatred)\n          \n          Judah.\n          \n           \n          \n          JUDAH\n          \n          In the flesh.\n          \n           \n          \n          Judah flings Ashe backwards...\n          \n          Ashe reaches his hand into his coat, pulling out a .45. He FIRES\n          into Judah's chest - once, twice, thrice...\n          \n          Judah doesn't even stagger, he just keeps on grinning. Wisps\n          of smoke rise up from the holes in his chest.\n          \n          Ashe stares at Judah, dumbfounded.\n          \n           \n          \n          ASHE\n          \n          What...are...you?\n          \n           \n          \n          JUDAH\n          \n          I'm your shadow, Ashe. Every angel's got a devil. Didn't you\n          know that? Or maybe you just slept your way through Sunday school?\n          \n           \n          \n          Judah lashes out with the rope. Ashe spins and falters. Incredibly,\n          he finds himself feeling pain.\n          \n          Judah follows with a series of blows, each more savage than the\n          next, driving Ashe back...\n          \n          Ashe stumbles, falls to his hands and knees. He reaches to his\n          mouth, his hand comes away spattered with blood. Ashe shakes\n          his head to clear it.\n          \n          Judah kicks Ashe in the face, knocking him onto his back...\n          \n          ...but Ashe springs back to his feet. He tries to strike Judah.\n          Judah catches Ashe's hand and squeezes tight. We hear bones snapping.\n          \n          CRACK! Judah smashes out with his other fist, Ashe spins around\n          and collapses...\n          \n          Ashe tries to push himself up by his hands. He coughs, spitting\n          up more blood, crawls forward...\n          \n           \n          \n          ASHE\n          \n          What... did you do to me...?\n          \n           \n          \n          JUDAH\n          \n          I've tasted the blood of the Crow and taken your power.\n          \n           \n          \n          WHOOSH! Judah whips the rope about, snapping the end around Ashe's\n          neck, dragging him off his feet.\n          \n          Judah pulls Ashe forward, crouching over him like a spider ready\n          to devour its prey.\n          \n           \n          \n          JUDAH\n          \n          You're flesh and blood now, Ashe. You can die like any other\n          man.\n          \n           \n          \n          ASHE\n          \n          Go to hell.\n          \n           \n          \n          JUDAH\n          \n          Already been there. And I must confess, I liked what I saw.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S TOWER - NIGHT\n          \n           \n          \n          Sarah sobs quietly, still chained to the pillar. A figure suddenly\n          appears at her side -- Sibyl. Sarah looks up...\n          \n           \n          \n          SARAH\n          \n          What...?\n          \n           \n          \n          Sibyl produces a key from within her robes. She places the key\n          in the lock on Sarah's manacles. With a turn of the key, the\n          manacles fall away and Sarah is free.\n          \n          Sarah looks back at the blind oracle, uncertain.\n          \n           \n          \n          SARAH\n          \n          Why are you doing this?\n          \n           \n          \n          Sibyl fixes Sarah with her blind stare.\n          \n           \n          \n          SIBYL\n          \n          Ashe needs you now. More than ever.\n          \n           \n          \n          Sibyl raises her other hand. She's holding one of the misericords\n          which she extends to Sarah.\n          \n           \n          \n          SIBYL\n          \n          Go to him.\n          \n           \n          \n          Sarah takes the misericord and racees for the end of the campanile,\n          towards a beckoning doorway and a stairwell beyond. Printed on\n          a grime-smeared placard nearby are the words...\n          \n          \"THIS IS NOT AN EXIT\"\n          \n           \n          \n          Sarah rushes through the doorway, heedless.\n          \n          CUT TO:\n          \n           \n          \n          EXT. JUDAH'S TOWER, CITY STREETS - NIGHT\n          \n           \n          \n          Judah plants his foot on Ashe's chest, tightening the chain around\n          Ashe's throat.\n          \n           \n          \n          JUDAH\n          \n          Looks like the dead have forsaken you, my friend.\n          \n           \n          \n          Ashe clutches at the rusty chain links which bite into his flesh,\n          choking.\n          \n           \n          \n          JUDAH\n          \n          Look at you, bleeding like a stuck pig. Where's your precious\n          strength? Where's your power?\n          \n          (drawing closer, whispering)\n          \n          You're nothing now, Ashe, not even a ghost.\n          \n           \n          \n          Judah rises. He grabs a hold of the chain, pulling...\n          \n          ASHE\n          \n          down the street. Ashe SCREAMS as his body is dragged across the\n          asphalt...\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S TOWER, ELEVATOR - NIGHT\n          \n           \n          \n          Sarah rushes into a rickety old elevator, pulling the accordion-style\n          security gate shut. She punches the \"DOWN\" arrow on the tarnished\n          control panel. With a lurch and HUM the elevator car starts its\n          journey downward.\n          \n           \n          \n          EXT. CITY STREET, MOVIE PALACE - NIGHT\n          \n           \n          \n          Judah has dragged Ashe over to the East side of the street, in\n          front of an old movie palace. He leaps atop one of the vending\n          stalls and clambers onto the marquee itself.\n          \n          JUDAH\n          \n          shouts to the crowds below, his eyes on fire.\n          \n           \n          \n          JUDAH\n          \n          You want death?! Here he is, people!!! Take a good look!!!\n          \n           \n          \n          Even as Ashe fights to free himself of the chain, Judah loops\n          one end of it over a street lamp. He jumps from the marquee,\n          using his body weight to pull Ashe from the ground...\n          \n          ASHE\n          \n          is dragged up into the air, dangling above the faces of the crowd.\n          \n           \n          \n          EXT. CITY STREET, JUDAH'S TOWER - NIGHT\n          \n           \n          \n          Sarah rushes out the front entrance of the tower, into the Day\n          of the Dead crowd which swarms below. She pushes through the\n          mob, trying to fight her way across the street.\n          \n           \n          \n          EXT. CITY STREET - MOVIE PALACE - NIGHT\n          \n           \n          \n          Ashe swings like a puppet from Judah's improvised hangman's noose.\n          His coat and short have been all but torn to shreds.\n          \n          Judah drags down on the chain harder, lifting Ashe even higher,\n          tightening the noose. He secures the chain on a hydrant, then\n          strolls forward, inspecting his work. Judah circles Ashe, grinning\n          like the cat who swallowed the canary.\n          \n           \n          \n          JUDAH\n          \n          Now don't we look pretty...\n          \n           \n          \n          Ashe struggles, choking, causing...\n          \n          THE TATTERED PAINTING\n          \n          of Danny's that Ashe had kept in his coat pocket to fall free.\n          It flutters to the ground, landing at Judah's feet.\n          \n          Judah kneels, picking it up. As he unfolds the painting, we see\n          that it has been stained with Ashe's own blood. He tilts it this\n          way and that -- as if he were appraising the craftsmanship of\n          the piece.\n          \n           \n          \n          JUDAH\n          \n          Nice. If you prick him, does he not bleed?\n          \n           \n          \n          Judah looks up at Ashe, his eyes full of crazed humor, then he\n          very deliberately tears the painting to shreds, letting the pieces\n          fall away into the night wind.\n          \n          Judah reaches for metal rod, lashing out at Ashe's bare, bloodied\n          back...\n          \n          WHACK! Ashe SCREAMS. Judah is hell-bent on beating Ashe into\n          oblivion. With every stroke of the switch the crowd CHEERS.\n          \n          CLOSE ON ASHE\n          \n          His eyes are rolling to whites as consciousness begins to recede...\n          \n          ASHE'S POV\n          \n          The swirling faces of the masked celebrants, with Judah front\n          and center. Mob mentality, everyone drunk and LAUGHING, jeering\n          at Ashe, the dangling fool. It's a scene out of Hell...\n          \n          .. and behind Judah, a familiar figure pushing her way to the\n          front of the crowd...\n          \n          SARAH\n          \n          lunges forward, clutching the misericord, shoving a reveller\n          aside...\n          \n           \n          \n          SARAH\n          \n          Get away from him!\n          \n           \n          \n          Judah turns. Sarah drives the misericord into Judah's eye. Judah,\n          momentarily blinded, falls back...\n          \n          Sarah unlashes the end of the chain from the hydrant...\n          \n          ASHE\n          \n          falls to the street as the chain CLATTERS over the street lamp.\n          He unravels the chain from his throat and drags himself back\n          up...\n          \n           \n          \n          ASHE\n          \n          Sarah, get back!\n          \n           \n          \n          Too late. Judah has torn the misericord from his eye. He rushes\n          up to Sarah and...\n          \n          ...THUNK! Drives it deep into her chest.\n          \n           \n          \n          ASHE\n          \n          SARAH!!!\n          \n           \n          \n          Sarah gasps, drops to her knees, clutching at the dagger's handle.\n          She pulls the misericord out. Blood begins to well up from the\n          wound. She stares at her blood-covered hands in disbelief, then\n          falls back.\n          \n          Silence now as the crowd begins to back away. The mood has shifted.\n          \n          Ashe drops by Sarah's side. She stares up at the sky, eyes wide\n          with wonder...\n          \n           \n          \n          SARAH\n          \n          The crows...I can see them coming...\n          \n           \n          \n          SARAH'S POV\n          \n          Once again, the crows are wheeling around the ceiling of the\n          sky.\n          \n          BACK TO SCENE\n          \n          Ashe looks up at Judah, fueled by a righteous rage that's been\n          burning since the moment of his resurrection. He rises. All reason\n          is gone. The only think that remains for Ashe is an unbridled\n          animal fury.\n          \n          Ashe launches himself at Judah, sending the villain tumbling\n          back into a nest of scaffolding. One of the pipes punches clear\n          through Judah's chest, impaling him!\n          \n          Judah hangs there, transfixed like a butterfly with a pin stuck\n          through it. He struggles to pull himself from the piping, but\n          even so, he's laughing hysterically...\n          \n           \n          \n          JUDAH\n          \n          You can't stop me anymore, Ashe. You don't have the power.\n          \n           \n          \n          Ashe's eyes boil with hatred.\n          \n           \n          \n          ASHE\n          \n          If it were just me, you'd be right, Judah. But I have an eternity\n          of pain to call upon...\n          \n           \n          \n          Ashe lifts his hands up, exposing his bleeding palms.\n          \n           \n          \n          ASHE\n          \n          And the pain gives me strength.\n          \n           \n          \n          ASHE'S PALMS\n          \n          As we watch the stigmata close themselves up, blood drawing itself\n          back into the wounds.\n          \n          Ashe raises his arms to the sky, gesturing to the crows which\n          spin high above his head.\n          \n           \n          \n          ASHE\n          \n          TAKE HIM!!!\n          \n           \n          \n          EXT. JUDAH'S CAMPANILE - NIGHT\n          \n           \n          \n          The murder of crows spirals down from the sky like a black tidal\n          wave. They descend on Judah as one entity, SCREAMING down from\n          the heavens like a storm of razor blades.\n          \n           \n          \n          JUDAH\n          \n          NO!!!\n          \n           \n          \n          We get one final glimpse of horrified Judah's face, eyes wide\n          with terror, before the tidal wave of black wings engulfs him.\n          \n          JUDAH\n          \n          lets loose a DEATH-SHRIEK that all but splits the sky as the\n          myriad beaks and talons rend him limb from limb.\n          \n          DOWN IN THE STREET,\n          \n          Ashe returns to Sarah's side, lifting her up off the ground and\n          cradling her in his arms.\n          \n           \n          \n          ASHE\n          \n          You can't die, Sarah... I stayed for you.\n          \n           \n          \n          SARAH\n          \n          (GASPING)\n          \n          There's a balance that needs to be kept...someone had to cross\n          over...\n          \n           \n          \n          Sarah takes a ragged breath, wincing as a wave of pain washes\n          over her.\n          \n           \n          \n          SARAH\n          \n          I didn't want it to be you...\n          \n           \n          \n          Sarah looks up at Ashe, tries her level best to smile. She's\n          at death's door now - one foot already over the threshold. Her\n          face is pale, having lost so much blood. Tears spill down Ashe's\n          cheeks, causing the war-paint makeup to run in rivulets.\n          \n           \n          \n          ASHE\n          \n          (in anguish)\n          \n          I can't go with you, Sarah. I have to stay here now.\n          \n          (cursing his fate)\n          \n          I have to stay.\n          \n           \n          \n          SARAH\n          \n          Do you love me?\n          \n           \n          \n          Ashe nods.\n          \n          Sarah reaches down to the wedding ring which hangs from her neck\n          on the chain. She tugs at the chain, snapping it apart. She holds\n          the ring out to Ashe.\n          \n           \n          \n          SARAH\n          \n          Take...this...\n          \n           \n          \n          Ashe takes the ring from Sarah. She closes Ashe's hand around\n          the ring, gripping his fist tightly.\n          \n           \n          \n          SARAH\n          \n          I'll wait for you. Forever, if I have to.\n          \n           \n          \n          She shuts her eyes, riding through another wave of pain.\n          \n           \n          \n          ASHE\n          \n          Oh God...\n          \n           \n          \n          SARAH\n          \n          Listen...if two people really love each other...\n          \n           \n          \n          She inhales sharply. Breathing has become a labor for her now.\n          \n           \n          \n          SARAH\n          \n          ...nothing can keep them apart.\n          \n          (her voice fading)\n          \n          ...nothing.\n          \n           \n          \n          Ashe nods, trying to let this thought reassure him. It's the\n          only thing he has left to cling to.\n          \n          SARAH'S POV\n          \n          Ashe's face, surrounded by a nimbus of light. We're falling away\n          from him. Down, down, down. And as we fall, we hear a FLUTTERING\n          OF WINGS.\n          \n          ON SARAH'S FACE\n          \n          Her eyes lose focus. Her head goes slack in Ashe's arms. She's\n          gone.\n          \n          Ashe lowers his lips to her, kissing her one final time.\n          \n          Ashe cradles Sarah's lifeless body in his arms, gently rocking\n          back and forth, tears streaming down his cheeks.\n          \n          And as we pull back from them, we realize that the scene mirrors\n          the prophetic image from Sarah's own painting - the woman dying\n          in the arms of her lover, surrounded by a gallery of skull-masked\n          celebrants.\n          \n          Ashe stands, lifting Sarah in his arms. He turns to leave...\n          \n          THE DAY OF THE DEAD CROWD\n          \n          slowly part for him, revealing a path of marigold petals leading\n          away down the street. It's almost as if, by silent consensus,\n          the crowd has come to understand what has happened here this\n          night.\n          \n          ASHE\n          \n          moves through the crowd carrying Sarah in his arms. The people\n          close ranks behind him and we...\n          \n          CUT TO:\n          \n           \n          \n          INT. JUDAH'S TOWER, CAMERA OBSCURA - NIGHT\n          \n           \n          \n          Sibyl stands over the camera obscura. On the table's focusing\n          surface we see the street below.\n          \n          ASHE\n          \n          is carrying Sarah in his arms, moving through the crowd of silent\n          witnesses.\n          \n          SIBYL\n          \n          nods to herself, satisfied. We see what might be a trace of a\n          smile cross her lips.\n          \n          Sibyl turns and exits the camera obscura.\n          \n           \n          \n          INT. JUDAH'S TOWER, CAMPANILE - NIGHT\n          \n           \n          \n          Sibyl approaches the table where the stag beetle is tethered.\n          Removing a pair of scissors from within her robes, Sibyl cuts\n          the thread which binds the beetle.\n          \n          THE STAG BEETLE,\n          \n          free at last, quickly scurries out of the box and across the\n          table, disappearing into the shadows.\n          \n          Sibyl follows suit, gathering her robes about her and stepping\n          on into the darkness.\n          \n          DISSOLVE TO:\n          \n           \n          \n          EXT. INNER-CITY CHURCH - DAWN\n          \n           \n          \n          The same church we visited the night before. Ashe, still carrying\n          Sarah in his arms, enters the sanctuary.\n          \n          The church is aglow with candles. Ashe lays Sarah's body down\n          in front of the offrenda, folding her arms across her chest,\n          leaving her in a state of repose. He stands, taking in one last\n          look.\n          \n          As Ashe moves to leave, he sees the elderly priest he had spoken\n          to earlier.\n          \n           \n          \n          PRIEST\n          \n          Why are you still here?\n          \n           \n          \n          ASHE\n          \n          Because I have nowhere left to go.\n          \n           \n          \n          Ashe steps past the priest, moving towards the doorway and the\n          daylight beyond.\n          \n           \n          \n          PRIEST\n          \n          What will you do, then?\n          \n           \n          \n          ASHE\n          \n          (looking back)\n          \n          This city is filled with shadows. One more won't make it any\n          darker.\n          \n           \n          \n          EXT. CHURCH - DAWN\n          \n           \n          \n          Ashe exits the church, finding haven in a shadowed doorway. He\n          reaches into his pocket, removing the wedding ring Sarah had\n          given to him...\n          \n          CLOSE ON THE RING\n          \n          as Ashe turns it over in his hands, seeing the word \"FOREVER\"\n          inscribed on the inside of the band. He slips it on his finger.\n          \n           \n          \n          GRACE (O.S.)\n          \n          (CONCERNED)\n          \n          Are you all right?\n          \n           \n          \n          Ashe looks up to see...\n          \n          GRACE,\n          \n          the drugged-out girl that Sarah helped at the beginning of the\n          film. She's looking good now, clean of the poison that once possessed\n          her. And damned if she isn't holding Gabriel in her arms.\n          \n           \n          \n          GRACE\n          \n          Long night, huh?\n          \n           \n          \n          Gabriel MEOWS to Ashe. Ashe reaches out and scratches the cat's\n          ear.\n          \n           \n          \n          GRACE\n          \n          Isn't he cool? I found him on the street. I was going to take\n          him home with me.\n          \n           \n          \n          ASHE\n          \n          You should. Looks like he needs a home.\n          \n           \n          \n          GRACE\n          \n          Well, see ya.\n          \n           \n          \n          She smiles at him and starts off down the street. Gabriel turns\n          around in Grace's arms and peers back at Ashe from over her shoulder.\n          \n          Ashe moves out from the shadows into the steadily growing light,\n          watching them. We see just a hint of hope in his eyes - hope\n          that someday he and Sarah will be reunited.\n          \n          As we hold on Ashe's face, Sarah's VOICE-OVER begins.\n          \n           \n          \n          SARAH (V.O.)\n          \n          I believe there's a place where the restless souls wanter...\n          \n           \n          \n          DISSOLVE TO:\n          \n           \n          \n          EXT. LIMBO - DAWN\n          \n           \n          \n          The same scene as the beginning of our film. We've made a circle.\n          A heavy mist hangs before us - endless and impenetrable. And\n          out of that primordial fog a CROW materializes, flying towards\n          the camera in slow motion.\n          \n           \n          \n          SARAH (V.O.)\n          \n          Burdened by the weight of their own sadness, they cannot enter\n          Heaven...\n          \n           \n          \n          Presently a second shape materializes - a FIGURE ON HORSEBACK,\n          galloping after the Crow.\n          \n           \n          \n          SARAH (V.O.)\n          \n          And so they wait, trapped between our world and the next, endlessly\n          searching for a way to rid themselves of their pain - in the\n          hopes that somehow, some day, they will be reunited...\n          \n           \n          \n          As the dark rider comes towards us, we realize that it's Sarah\n          whose baleful eyes are now shining behind the irony mask war\n          paint.\n          \n           \n          \n          SARAH (V.O.)\n          \n          ...with the ones they love.\n          \n           \n          \n          CUT TO:\n          \n           \n          \n          EXT. FREEWAY OVERPASS - DAWN\n          \n           \n          \n          Ashe is back on his bike, racing beneath the cathedral-like arches\n          of the overpass. As he sweeps past a concrete pillar we...\n          \n          CUT TO:\n          \n           \n          \n          EXT. LIMBO - DAY/NIGHT\n          \n           \n          \n          Sarah on her horse, galloping in parallel action. As she sweeps\n          last a tree we...\n          \n          CUT TO:\n          \n           \n          \n          EXT. FREEWAY OVERPASS - DAWN\n          \n           \n          \n          Ashe on the bike. Now we intercut between the two doomed lovers,\n          each on their respective steeds. Worlds apart, and yet, somehow\n          traveling the same road.\n          \n          We are intercutting faster and faster, until the sound of HOOFBEATS\n          and the MOTORCYCLE'S ROAR are indistinguishable.\n          \n          Until the two figures themselves begin to blur.\n          \n          Faster and faster and faster until we...\n          \n          CUT TO BLACK.\n          \n          Over the darkness we hear Sarah's final words to Ashe:\n          \n           \n          \n          SARAH'S VOICE\n          \n          If two people really love each other, nothing can keep them apart...\n          \n          (BEAT)\n          \n          Nothing.\n          \n           \n          \n          THE END\n          \n           \n\n\n\n\n\nCrow: City of Angels, The\nWriters :   David S Goyer  James O'Barr\nGenres :   Action  Fantasy  Thriller  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:20.778353"}