{"title": "Dawn of the Dead", "film_link": "/Movie Scripts/Dawn of the Dead Script.html", "script_link": "/scripts/Dawn-of-the-Dead.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Dawn of the Dead Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Dawn of the Dead Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  The best horror film ever?<br/><br/>\n<b>IMSDb rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9 out of 10)<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.75 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=George A. Romero\" title=\"Scripts by George A. Romero\">George A. Romero</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> :  1977<br/>\n<br/>\n<a href=\"/scripts/Dawn-of-the-Dead.html\">Read \"Dawn of the Dead\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>DAWN OF\n<b>THE DEAD\n</b>(The working draft 1977)\nby George A. Romero\n\n\n1\tWe see the face of a young woman. She is asleep. It is very\n\tquiet at first, as credits appear. The woman's face begins to\n\ttwitch, as though she is having a bad dream. She moans slightly\n\tand her expression grows more desperate.\n\n\tA mix of subtle sounds begin to fade in. As they get louder, we\n\tcan discern what sounds like a busy office area. It is actually\n\ta frantic television studio with the hum of panic in a national\n\temergency.\n\n\tThe woman's moans get louder and more desperate as the\n\tbackground sounds reach full volume and the credits stop. The\n\twoman sits up, snapping awake.\n\n2\tShe lurches forwards into the arms of a strong young man. She is\n\tFrancine, twenty three years old and very attractive, although\n\tshe is gritty with dirt. Her hair is hanging, dishevelled and\n\tsweaty. Her jeans and blouse have been worn for several days.\n\n\tShe is sitting on the floor, where she has slept the last\n\tseveral hours, covered by an old overcoat.\n\n\tTony:\tYOU OK?\n\n\tFran stares at the young man. She is shaking. She doesn't speak.\n\n\tTony:\tTHE SHIT'S REALLY HITTING THE FAN.\n\n\tThe girl tries to clear her head as the young man moves on to\n\twhere others sleep on the floor. He wakes them up one at a time.\n\tWe begin to hear voices over the busy hum of the studio. They\n\thave an electronic tinniness, as broadcast over a monitor. Fran\n\tlooks about. She is still shaken from her dream.\n\n3\tWe see the television studio. Reporters buzz about madly.\n\tEverybody looks dishevelled and exhausted. Technicians man\n\tmonitors, and we see people on the little screens, arguing\n\temotionally.\n\n4\tVoice:\tWHAT'S MAKING IT HAPPEN? WHAT THE HELL\n<b>\t\t\tDIFFERENCE DOES IT MAKE, WHAT'S MAKING IT\n</b><b>\t\t\tHAPPEN.\n</b>\n\tVoice:\tYES, BUT THAT'S...\n\n\tVoice:\tTHAT'S A WHOLE OTHER STUDY. THEY'RE TRYING...\n\n\tVoice:\tBUT IF WE KNEW THAT, WE COULD...\n\n\tVoice:\tWE DON'T KNOW THAT! WE DON'T KNOW THAT!\n<b>\t\t\tWE'VE GOTTA OPERATE ON WHAT WE DO KNOW!\n</b>\n5\tThe room is pandemonium. People run in with wire copy; others\n\torganise the stacks of bulletins as they arrive. Others trip\n\tover cables and generally get in each other's way.\n\n6\tFrancine stares at the madness, still trying to clear her head.\n\n\tMan's voice: I'M STILL DREAMING.\n\n\tFran turns her head. Another young man sits next to her on the\n\tfloor. He is one of the ones Tony awakened.\n\n\tFran:\tNO YOU'RE NOT.\n\n\tWoman:\tMY TURN WITH THE COAT.\n\n\tFran looks up. A young woman is offering her coffee in a paper\n\tcup. She is next in line for the overcoat and a few hours sleep.\n\tFran takes the coffee and struggles to her feet.\n\n\tWoman:\tTHE GUYS ON THE CREW ARE GETTING CRAZY.\n<b>\t\t\tA BUNCH OF 'EM FLEW THE COOP ALREADY.\n</b><b>\t\t\tI DON'T KNOW HOW MUCH LONGER WE'LL BE ABLE\n</b><b>\t\t\tTO STAY ON AIR.\n</b>\n7\tFran staggers over to the control consoles. The technicians are\n\tat the end of their ropes.\n\n\tTechnicians: (all at once)\n<b>\t\t\tWATCH CAMERA TWO...WHO THE HELL'S ON CAMERA\n</b><b>\t\t\tTWO, A BLIND MAN...\n</b><b>\t\t\tWATCH THE FRAME...WATCH THE FRAME...\n</b><b>\t\t\tROLL THE RESCUE STATIONS AGAIN.\n</b>\n\tTechnicians: WE GOT A REPORT THAT HALF THOSE RESCUE\n<b>\t\t\tSTATIONS HAVE BEEN KNOCKED OUT.\n</b><b>\t\t\tSO GET ME A NEW LIST.\n</b><b>\t\t\tSURE, I'LL PULL IT OUTA MY ASS.\n</b>\n\tFran focuses on the monitors. She is incredulous... stunned by\n\tthe madness which surrounds her. She realises the hopelessness\n\tof the situation as she zeroes in on the televised conversation.\n\n8\tWe begin to listen over the din of the news room.\n\n\tTV Man 1:    I DON'T BELIEVE THAT, DOCTOR, AND I DON'T\n<b>\t\t\tBELIEVE...\n</b>\n\tTV Man 2:    DO YOU BELIEVE THE DEAD ARE RETURNING TO\n<b>\t\t\tLIFE?\n</b>\n\tTV Man 1:    I'M NOT SO...\n\n\tTV Man 2:    DO YOU BELIEVE THE DEAD ARE RETURNING TO\n<b>\t\t\tLIFE AND ATTACKING THE LIVING?\n</b>\n\tTV Man 1:    I'M NOT SO SURE WHAT TO BELIEVE DOCTOR!\n\n9\tSuddenly we cut into the studio, and we see the argument as it\n\tis being shot.\n\n\tTV Man 1:    (con't)\n<b>\t\t\tALL WE GET IS WHAT YOU PEOPLE TELL US.\n</b><b>\t\t\tAND IT'S HARD ENOUGH TO BELIEVE...\n</b>\n\tTV Man 2:    IT'S FACT... IT'S FACT...\n\n\tTV Man 1:    IT'S HARD ENOUGH TO BELIEVE WITHOUT YOU\n<b>\t\t\tCOMING IN HERE AND TELLING US WE HAVE TO\n</b><b>\t\t\tFORGET ALL HUMAN DIGNITY AND...\n</b>\n\tTV Man 2:    HUMAN DIG... YOU CAN'T...\n\n\tTV Man 1:    ...FORGET ALL HUMAN DIGNITY...\n\n\tTV Man 2:    YOU'RE NOT RUNNING A TALK SHOW HERE, MR.\n<b>\t\t\tBERMAN...YOU CAN FORGET PITCHING AN AUDIENCE\n</b><b>\t\t\tTHE MORAL BULL SHIT THEY WANT TO HEAR!\n</b>\n\tTV Man 1:    YOU'RE TALKING ABOUT ABANDONING EVERY HUMAN\n<b>\t\t\tCODE OF BEHAVIOUR, AND THERE'S A LOT OF US\n</b><b>\t\t\tWHO AREN'T READY FOR THAT DOCTOR FOSTER...\n</b>\n10\t A great cry of assent goes up from the studio floor. Doctor\n\tFoster is flustered and frustrated. The stage hands and\n\tcameramen are all screaming at him, swearing and ridiculing. We\n\tnotice Police guards, armed, at the studio doors. They control\n\tthe traffic in and out of the big room.\n\n11\t Back at the control panel. Fran stares at the screens. Confusion\n\tstill reigns.\n\n\tMan:\t FRANNIE, GET ON THE NEW LIST OF RESCUE STATIONS.\n<b>\t\t\tCHARLIE'S RECEIVING ON THE EMERGENCIES...\n</b>\n\tFran pulls herself away from the monitors as the argument rages\n\ton screen.\n\n12\t She fights through the heavy traffic and reaches Charlie, a\n\tharassed typist who holds the receiver of an emergency radio\n\tunit under his chin...\n\n\tCharlie:\t(into receiver)\n<b>\t\t\tSAY AGAIN...CAN'T HEAR YOU... \n</b>\n\tFran:\tRESCUE STATIONS?\n\n\tFran leafs through sheets of paper on Charlie's desk. He writes\n\tnotes as he listens on the receiver, and he speaks to the woman.\n\n\tCharlie:\tHALF THOSE ARE INOPERATIVE ANY MORE.\n<b>\t\t\tI'M TRYIN' TO FIND OUT AT LEAST ABOUT THE\n</b><b>\t\t\tIMMEDIATE AREA. WE'VE HAD OLD INFORMATION\n</b><b>\t\t\tON THE AIR FOR THE LAST TWELVE HOURS.\n</b>\n\tFran:\tTHESE ARE RESCUE STATIONS. WE CAN'T SEND\n<b>\t\t\tPEOPLE TO INOPERATIVE...\n</b>\n\tCharlie:\t(into receiver)\n<b>\t\t\tSAY AGAIN, NEW HOPE...\n</b>\n\tCharlie makes more notes and hands them to Fran. Still listening\n\ton the receiver, he speaks to the woman again.\n\n\tCharlie:\tI'M DOIN' WHAT I CAN. THESE ARE DEFINITE\n<b>\t\t\tAS OF NOW. SKIP AND DUSTY ARE ON THE RADIO,\n</b><b>\t\t\tTOO. GOOD LUCK.\n</b>\n\tFran snatches up the sheets and moves across the room.\n\n13\t She stops at the consoles...\n\n\tFran:\tI'M GONNA KNOCK OFF THE OLD RESCUE STATIONS.\n<b>\t\t\tI'LL HAVE THE NEW ONES READY AS SOON AS I CAN.\n</b>\n\tTechnician:  WE'RE SENDING PEOPLE TO PLACES THAT HAVE\n<b>\t\t\tCLOSED DOWN. I'M GONNA KILL THE OLD LIST.\n</b>\n14\t Fran moves toward another control room. An armed officer stops\n\ther. A young man rushing through with copy intercedes.\n\n\tMan:\t HEY, SHE'S ALRIGHT.\n\n\tOfficer:\tWHERE'S YOUR BADGE?\n\n\tFran reaches instinctively for the lapel of her blouse. Her\n\tbadge is missing.\n\n\tFran:\tJESUS!\n\n\tMan:\t SHE'S ALRIGHT.\n\n\tFran:\tI HAD IT...I WAS ASLEEP OVER THERE...\n\n\tShe makes a move toward the corner where she was asleep.\n\n\tMan:\t SOMEBODY STOLE IT. THERE'S A LOT OF 'EM\n<b>\t\t\tMISSING.\n</b>\t\t\t(to officer)\n<b>\t\t\tSHE'S ALRIGHT. LET HER THROUGH.\n</b>\n\tThe officer reluctantly steps aside.\n\n15\t The young man and Fan move down a crowded hall and into a small\n\tcamera room. The foot traffic is solid. They talk as they walk.\n\n\tFran:\tI DON'T BELIEVE IT.\n\n\tMan:\t ONE OF THOSE LITTLE BADGES CAN OPEN A LOT\n<b>\t\t\tOF DOORS...YOU AVOID A LOT OF HASSLES IF\n</b><b>\t\t\tYOU GOT A BADGE...ANY KIND OF BADGE...\n</b>\n\tFran:\tIT'S REALLY GOING CRAZY.\n\n16\t They reach a small camera installation. The camera is aimed at a\n\tmachine which rolls out a list of rescue stations. The list is\n\tsuperimposed over the live broadcast as it goes out.\n\n\tCameraman:   YOU GOT NEW ONES?\n\n\tFran:\tI GOTTA TYPE 'EM UP. KILL THE OLD ONES.\n\n\tCameraman:   GIVENS WANT 'EM...\n\n\tFran:\tKILL 'EM, DICK. TELL GIVENS TO SEE ME!\n\n\tThe man clicks off his camera. Fran moves toward the studio.\n\n17\t On the monitors, we see the rescue stations blink off over shots\n\tof the two men who still argue on the air.\n\n\tTV Man 1:    WELL I DON'T BELIEVE IN GHOSTS, DOCTOR.\n\n\tTV Man 2:    THESE ARE NOT GHOSTS. NOR ARE THESE HUMANS!\n<b>\t\t\tTHESE ARE DEAD CORPSES. ANY UN-BURIED HUMAN\n</b><b>\t\t\tCORPSE WITH ITS BRAIN INTACT WILL IN FACT\n</b><b>\t\t\tRE-ACTIVATE. AND IT'S PRECISELY BECAUSE OF\n</b><b>\t\t\tINCITEMENT BY IRRESPONSIBLE PUBLIC FIGURES\n</b><b>\t\t\tLIKE YOURSELF THAT THIS SITUATION IS BEING\n</b><b>\t\t\tDEALT WITH IRRESPONSIBLY BY THE PUBLIC AT\n</b><b>\t\t\tLARGE!\n</b>\n18\t Another outraged cry goes up from the stagehands and observers.\n\tDoctor Foster tries to out-scream the cries...\n\n\tTV Man 2:    YOU HAVE NOT LISTENED...YOU HAVE NOT LISTENED...\n<b>\t\t\tFOR THE LAST THREE WEEKS...WHAT DOES IT TAKE...\n</b><b>\t\t\tWHAT DOES IT TAKE TO MAKE PEOPLE SEE?\n</b>\n19\t Fran moves into the large studio area where the broadcasters\n\targue. The commotion is maddening. Fran stares for a moment.\n\n20\t TV Man 2:    (now distraught...almost pleading)\n<b>\t\t\tTHIS SITUATION IS CONTROLLABLE. PEOPLE\n</b><b>\t\t\tMUST COME TO GRIPS WITH THIS CONCEPT.\n</b><b>\t\t\tIT'S EXTREMELY DIFFICULT...WITH FRIENDS...\n</b><b>\t\t\tWITH FAMILY...BUT A DEAD BODY MUST BE DE-\n</b><b>\t\t\tACTIVATED BY EITHER DESTROYING THE BRAIN\n</b><b>\t\t\tOR SEVERING THE BRAIN FROM THE REST OF THE\n</b><b>\t\t\tBODY.\n</b>\n\tAnother outburst in the studio.\n\n\tTV Man 2:    THE SITUATION MUST BE CONTROLLED...BEFORE IT'S\n<b>\t\t\tTOO LATE...THEY ARE MULTIPLYING TOO RAPIDLY...\n</b>\n21\t Fran moves through the crowded room of emotional people and\n\tfinally reaches another emergency radio installation. Skip and\n\tDusty are trying to listen to their receivers. They jot notes.\n\n\tFran:\tOPERATIVE RESCUE STATIONS?\n\n\tDusty:\tTHEY'RE DROPPIN' LIKE FLIES. HERE'S A FEW.\n<b>\t\t\tYOU KNOW, I THINK FOSTER'S RIGHT. I THINK\n</b><b>\t\t\tWE'RE LOSIN' THIS WAR.\n</b>\n\tFran:\tYEAH, BUT NOT TO THE ENEMY.\n<b>\t\t\tWE'RE BLOWIN' IT OURSELVES.\n</b>\n\tShe gives the rest of her coffee to the two men.\n\n\tFran:\tNOT MUCH LEFT, BUT HAVE A BALL.\n\n\tThe two men each slug eagerly from the paper cup. Fran rushes\n\toff toward a large teleprompter typing machine.\n\n22\t The broadcasters still argue emotionally.\n\n\tTV Man 1:    PEOPLE AREN'T WILLING TO ACCEPT YOUR SOLUTIONS,\n<b>\t\t\tDOCTOR, AND I, FOR ONE, DON'T BLAME THEM.\n</b>\n\tTV Man 2:    EVERY DEAD BODY THAT IS NOT EXTERMINATED\n<b>\t\t\tBECOMES ONE OF THEM! IT GETS UP AND KILLS!\n</b><b>\t\t\tTHE PEOPLE IT KILLS GET UP AND KILL!\n</b>\n23\t Handing the list of active rescue stations to the teleprompter\n\ttypist, Fran rushes back toward the control room.\n\n24\t Around the monitor consoles, the commotion has been made even\n\tmore frantic by an angered Dan Givens, obviously one of the\n\tstation managers.\n\n\tGivens:\t NOBODY HAS THE AUTHORITY TO DO THAT, I WANT...\n\n\tGivens spots Fran as she moves into the room.\n\n\tGivens:\t GARRET, WHO TOLD YOU TO KILL THE SUPERS?\n\n\tFran:\tNOBODY. I KILLED 'EM. THEY'RE OUT OF DATE.\n\n\tGivens:\t I WANT THOSE SUPERS ON THE AIR ALL THE TIME.\n\n\tFran:\tARE YOU WILLING TO MURDER PEOPLE BY SENDING THEM\n<b>\t\t\tOUT TO STATIONS THAT HAVE CLOSED DOWN?\n</b>\n\tGivens:\t WITHOUT THOSE RESCUE STATIONS ON SCREEN EVERY\n<b>\t\t\tMINUTE PEOPLE WON'T WATCH US. THEY'LL TUNE OUT.\n</b>\n\tFran stares at the red faced man in disbelief.\n\n\tGivens:\t I WANT THAT LIST UP ON THE SCREEN EVERY MINUTE THAT\n<b>\t\t\tWE'RE ON THE AIR.\n</b>\n\tFran is about to say something in anger, but before she can, one\n\tof the technicians, having overheard Givens, gets up from the\n\tcontrol panel and starts to walk away.\n\n\tGivens:\t LUCAS...LUCAS, WHAT THE HELL ARE YOU DOING...\n<b>\t\t\tGET ON THAT CONSOLE...LUCAS...WE'RE ON THE AIR!\n</b>\n\tLucas:\tANYBODY NEED A RIDE!\n\n25\t Two other men from various positions in the room snatch up\n\tpersonal effects and follow the technician toward the door. The\n\tdoor is guarded by a nervous Officer.\n\n26\t Givens:\t OFFICER...OFFICER...YOU STOP THEM...STOP THOSE\n<b>\t\t\tMEN...LUCAS...GET BACK ON THIS CONSOLE...\n</b>\n\tA frantic hubbub begins over the lack of console control. People\n\trush in and out, the floor director's voice can be heard over a\n\ttalk back system...\n\n\tVoices:\t WHAT THE HELL'S GOIN' ON IN THERE.\n<b>\t\t\tSWITCH...SWITCH...THERE'S NO SWITCHER...\n</b><b>\t\t\tWE'RE LOSING PICTURE...\n</b>\n\tGivens:\t OFFICER...STOP THOSE MEN...\n<b>\t \n</b>27\t The young officer faces the men as they reach his post. He takes\n\ta grip on his rifles, opens the door and lets the group through.\n\tThen he runs out himself, deserting the losing cause.\n\n28\t Givens jumps toward the console. He frantically tries to work\n\tthe complex dials and pots...\n\n\tGivens:\t GET SOMEBODY IN HERE THAT KNOWS HOW TO RUN\n<b>\t\t\tTHIS THING...COME ON...I'LL TRIPLE THE MONEY\n</b><b>\t\t\tFOR THE MAN THAT CAN RUN THIS THING...TRIPLE\n</b><b>\t\t\tTHE MONEY...WE'RE STAYING ON THE AIR...\n</b>\n\tFran moves slowly off toward the studio.\n\n29\t In the big room, the tension is thicker than ever. A few of the\n\tnewsmen still earnestly try to perform their various functions,\n\tbut most of the crew are reduced to emotional polarisation over\n\tthe broadcast which still rages.\n\n30\t TV Man 2:    THEY KILL FOR ONE REASON.\n<b>\t\t\tTHEY KILL FOR FOOD.\n</b><b>\t\t\tTHEY EAT THEIR VICTIMS, DO YOU UNDERSTAND THAT,\n</b><b>\t\t\tMR. BERMAN. THAT'S WHAT KEEPS THEM GOING.\n</b>\n31\t Fran stops to listen to the argument. She falls back into the\n\tshadows of the studio. People rush past her, some leaving the\n\tstudio in disgust.\n\n32\t TV Man 2:    IF WE'D LISTENED...IF WE'D DEALT WITH THE\n<b>\t\t\tPHENOMENON PROPERLY...WITHOUT EMOTION...\n</b><b>\t\t\tWITHOUT...EMOTION...\n</b><b>\t\t\tIT WOULDN'T HAVE COME TO THIS!\n</b>\n\tFoster wipes his sweat with a dirty hanker chief. He pulls his\n\ttie away from his tight collar, and pops the shirt button open.\n\tHe is desperate now, shivering with anger and frustration.\n\n\tTV Man 2:    THERE IS A MARTIAL LAW STATE IN EFFECT IN\n<b>\t\t\tPHILADELPHIA...AS IN ALL OTHER MAJOR CITIES IN\n</b><b>\t\t\tTHE COUNTRY...\n</b><b>\t\t\tCITIZENS MUST UNDERSTAND THE...DIRE...DIRE\n</b><b>\t\t\tCONSEQUENCES OF THIS PHENOMENON...SHOULD WE\n</b><b>\t\t\tBE UNABLE TO CHECK THE SPREAD...\n</b><b>\t\t\tBECAUSE OF THE EMOTIONAL ATTITUDES..OF THE\n</b><b>\t\t\tCITIZENRY...TOWARD...THESE ISSUES OF...\n</b><b>\t\t\tMORALITY...\n</b><b>\t\t\tIT IS THE ORDER OF THE O.E.P. BY COMMAND OF THE\n</b><b>\t\t\tFEDERAL GOVERNMENT...THE PRESIDENT OF THE\n</b><b>\t\t\tUNITED STATES...\n</b><b>\t\t\tCITIZENS MAY NO LONGER OCCUPY PRIVATE RESIDENCES,\n</b><b>\t\t\tNO MATTER HOW SAFELY PROTECTED OR WELL STOCKED...\n</b>\n\tA murmur in the studio begins to build to an emotional\n\tcrescendo. Foster tries to talk over the noise...\n\n\tTV Man 2:    CITIZENS WILL BE MOVED INTO CENTRAL AREAS OF\n<b>\t\t\tTHE CITY...\n</b>\n33\t Technicians abandon their posts. A few others jump in to take\n\ttheir places, but pandemonium reigns. A cameraman whips off his\n\theadset and breaks for the door. His camera spins on its liquid\n\thead, and on the monitors, we see a whirling blur as Foster\n\tcontinues to speak.\n\n\tFran moves quickly for the spinning camera. She aims it back at\n\tthe sweating Foster, and she stares through the viewfinder not\n\tbelieving what she is seeing.\n\n34\t TV Man 2:    THE BODIES OF THE DEAD WILL BE DELIVERED OVER\n<b>\t\t\tTO SPECIALLY EQUIPPED SQUADS OF THE NATIONAL\n</b><b>\t\t\tGUARD FOR ORGANISED DISPOSITION...\n</b>\n35\t Suddenly a man darts out of the bustling crowd and comes up\n\tquickly behind Fran.\n\n\tSteve:\tFRANNIE...AT NINE O'CLOCK MEET ME ON THE ROOF.\n<b>\t\t\tWE'RE GETTING OUT.\n</b>\n\tFran:\t(letting the camera slip slightly)\n<b>\t\t\tSTEPHEN...I DON'T BELIEVE THIS...WHAT...\n</b>\n\tSteve:\tWE'RE GETTING OUT. IN THE CHOPPER.\n\n\tAnother technician steps over to take the camera from Fran.\n\tStephen talks more quietly in the other man's presence.\n\n\tSteve:\tNINE P.M. ALRIGHT?\n\n\tFran:\tSTEVE...WE CAN'T...WE'VE GOT TO...\n\n\tSteve:\tWE'VE GOT TO NOTHING, FRAN. WE'VE GOT TO\n<b>\t\t\tSURVIVE. SOMEBODY'S GOT TO SURVIVE. NOW YOU\n</b><b>\t\t\tCOULD BE UP THERE AT NINE. DON'T MAKE ME COME\n</b><b>\t\t\tLOOKIN' FOR YA.\n</b>\n\tStephen is gone in a flash. Fran nervously looks back at the\n\tcameraman. The argument still rages between Foster and Berman.\n\tThe cameraman, without taking his eye from the viewfinder,\n\tspeaks to Francine quietly and slowly.\n\n\tCameraman:   GO AHEAD. WE'LL BE OFF THE AIR BY MIDNIGHT\n<b>\t\t\tANYWAY. EMERGENCY NETWORKS ARE TAKING OVER.\n</b><b>\t\t\tOUR RESPONSIBILITY... IS FINISHED, I'M AFRAID.\n</b>\n36\t It is dusk, and the city of Philadelphia is surprisingly quiet.\n\tWe see several large buildings. They are part of a low-income\n\thousing project, and their lack of grace is evident. They stand\n\tlike tombstones as the first stars appear in the navy blue sky.\n\n37\t Under cover of the growing darkness, activities of the S.W.A.T.\n\tUnit go unnoticed. Grappling hooks grab against the lip around\n\tthe roof and silent figures climb to the top of the building.\n\tMen in armour vests, clutching the latest in special weapons,\n\ttake position here and there about the development.\n\n\tOther men strategically place their cars and trucks in the court\n\tbelow.\n\n38\t On the roof, at an entrance to one of the building's fire\n\tstairs, Roger squats silently alongside three other team\n\tmembers. The men check their weapons. Roger looks at his watch.\n\tThe sweep hand reaches the 12...\n\n\tRoger:\t(to himself) LIGHTS.\n\n39\t In an instant, large searchlights bathe the side of the\n\tbuilding. The troop commander, shielded with other Officers\n\tbehind a large truck, shouts through an electric bullhorn.\n\n\tCommander:   MARTINEZ...YOU'VE BEEN WATCHING...YOU KNOW WE\n<b>\t\t\tHAVE THE BUILDING SURROUNDED...\n</b>\n\tThe electronically amplified voice echoes through the concrete\n\tcaverns between the buildings of the project. There are only a\n\tfew windows which glow with lights from inside. At the sound of\n\tthe bullhorn, the lights all blink out one at a time.\n\n\tCommander:   (not over the bullhorn)\n<b>\t\t\tLITTLE BASTARD'S GOT 'EM ALL MOVED INTO ONE\n</b><b>\t\t\tBUILDING...DUMB LITTLE BASTARD!\n</b>\n\tSergeant:    LOOKS LIKE THEY'RE GONNA TRY TO FIGHT US.\n\n\tCommander:   (on the bullhorn again)\n<b>\t\t\tMARTINEZ...THE PEOPLE IN THIS PROJECT ARE YOUR\n</b><b>\t\t\tRESPONSIBILITY...WE DON'T WANT ANY OF THEM HURT\n</b><b>\t\t\tAND NEITHER DO YOU!\n</b>\n42\t There is no sign of life in the building. The great concrete\n\tslab is silhouetted silently against the darkening sky.\n\n43\t Roger, and his team mates, crouch in readiness. The sound of the\n\tbullhorn rises to them easily and clearly.\n\n\tRoger:\tI'M GIVIN' YOU THREE MINUTES, MARTINEZ...\n\n\tCommander:   (Bullhorn)\n<b>\t\t\tI'M GIVIN' YOU THREE MINUTES, MARTINEZ...\n</b><b>\t\t\tTURN OVER YOUR WEAPONS AND SURRENDER...\n</b>\n\tRoger:\tTHERE ARE NO CHARGES AGAINST YOU...\n\n\tCommander:   THERE ARE NO CHARGES AGAINST YOU OR ANY OF YOUR\n<b>\t\t\tPEOPLE...\n</b>\n\tRoger:\tYET.\n\n\tCommander:   THREE MINUTES, MARTINEZ.\n\n\tRoger:\tAND COUNTING.\n\t\t\t(he looks at his watch)\n\n\tThere is a long silence.\n\n\tRoger:\tCOME ON, MARTINEZ!\n\n\tOne of the other S.W.A.T. team members is a big man, with a\n\trough and vicious looking face. He is WOOLEY, a hardened\n\tveteran, and a red neck of the first order.\n\n\tWooley:\t YEAH, COME ON, MARTINEZ...SHOW YOUR GREASY\n<b>\t\t\tLITTLE PUERTO RICAN ASS...SO I CAN BLOW IT OFF...\n</b>\n\tRoger looks over at the big man. He is distressed at the pent up\n\tviolence in Wooley.\n\n\tWooley:\t I'LL BLOW ALL THEIR ASSES OFF...LOW LIFE BASTARDS..\n<b>\t\t\tBLOW ALL THEIR LITTLE LOW LIFE PUERTO RICAN AND\n</b><b>\t\t\tNIGGER ASSES RIGHT OFF...\n</b>\n\tRoger is greatly concerned. He looks at one of the other men, a\n\tyoung, smoothed faced rookie. The boy doesn't know now to react.\n\tHe is obviously nervous.\n\n\tRoger:\tKEEP COOL. JUST DON'T POP OFF IN THERE WHEN WE\n<b>\t\t\tGO IN.\n</b>\n\tThe boy nods, grateful for a more human contact.\n\n\tWooley:\t HOW THE HELL COME WE STICK THESE LOW LIFES\n<b>\t\t\tIN THESE BIG ASS FANCY HOTELS ANYWAY? SHIT\n</b><b>\t\t\tMAN. THIS' BETTER THAN I GOT. YOU AIN'T\n</b><b>\t\t\tGONNA TALK 'EM OUTA HERE. YOU GOTTA BLOW\n</b><b>\t\t\t'EM OUT. BLOW THEIR ASSES!\n</b>\n\tRoger:\t(to the boy)\n<b>\t\t\tYOU GONNA BE ALRIGHT?\n</b>\n\tThe boy nods in the affirmative.\n\n\tWooley:\t LET'S GET ON WITH IT. THIS IS A WASTE OF\n<b>\t\t\tMY TIME!\n</b>\n44\t CRASH! Without warning, the metal door to the fire stair bursts\n\topen and several figures rush out of the darkness. Shots are\n\tfired from hand guns. A bullet smashes through the skull of the\n\tyoung boy next to Roger. He falls against Roger with a pleading\n\texpression on his face.\n\n\tFigures charge this way and that. More gunfire. The other\n\tS.W.A.T. men dodge and dive for cover. Wooley opens fire with\n\this automatic weapon.\n\n45\t On the street, the Commander, hearing the gunfire, barks into\n\tthe bullhorn:\n\n\tCommander:   MOVE IN...MOVE IN...\n<b>\t\t\tGODDAMMIT!\n</b>\n\tSergeant:    (into walkie talkie)\n<b>\t\t\tALL UNITS... FULL OPERATION!\n</b>\n46\t On the roof, Roger struggles under the dead weight of the young\n\tman. He tries to free himself and his weapons. Shots ring out.\n\n\tA handful of Black and Puerto Rican youngsters charge about the\n\trooftop. Another S.W.A.T. patrol appears from behind a large\n\televator housing. The young civilians retreat. Several are mowed\n\tdown.\n\n\tAnother bullet smashes against the dead S.W.A.T. man's back.\n\tJust as Roger frees himself, a bullet catches him squarely in\n\tthe chest, but his armour takes the impact. He is thrown back\n\toff balance, and he struggles to catch his wind as he scrambles\n\tover to recover his weapon which skitters away across the roof\n\ttop.\n\n\tBefore he reaches the gun, he is cut off by the looming figure\n\tof one of the Black youths, pistol in hand. Roger freezes. The\n\tyoung man aims his hand gun, but hesitates. A sudden barrage of\n\tbullets rips through the young Black and he falls in a pool of\n\tblood. It was Wooley's gun that killed him.\n\n\tWooley:\t COME ON YOU DUMB BASTARDS...\n<b>\t\t\tCOME AND GET 'EM...\n</b>\n\tHe fires again and again, even though the skirmish is winding\n\tdown.\n\n\tRoger charges for his weapon, snatches it up, and runs for the\n\tcover of an incinerator housing. He startles a young civilian\n\twho was hiding there, trying to load his gun. The boy makes a\n\tbreak...\n\n\tRoger:\tHOLD IT...\n\n\tThe boy freezes for a moment, then, thinking, breaks into a run\n\tacross the roof.\n\n\tRoger:\tHOLD IT, KID...DON'T RUN OUT THERE!\n\n\tThe boy is mowed down in a crossfire.\n\n47\t Inside the building, other S.W.A.T. teams along with units of\n\tthe National Guard are crashing through hallways and breaking\n\tinto apartment units. People are herded into the halls where\n\tthey are held at gun point.\n\n\tSome men, although armed, surrender willingly. Others retaliate\n\tagainst the invading force, and little skirmishes develop on\n\tevery floor of the complex structure.\n\n48\t On the ground, the Commander barks into the bullhorn:\n\n\tCommander:   MASKS...\n\n\tSergeant:    (into walkie talkie)\n<b>\t\t\tMASKS FOR GAS...MASKS FOR GAS.\n</b>\n49\t Tear gas canisters crash through windows and the halls are\n\tfilled with clouds of gas. Civilians trying to escape, are\n\tchoked as they attempt to shoot their way out.\n\n50\t The teams on the roof charge down the fire stairs into the\n\tbuilding.\n\n<b>\tS.W.A.T. 1:  WORK YOUR WAY DOWN. A FLOOR AT A TIME.\n</b><b>\t\t\tHOLD 'EM IN THE HALLS 'TIL WE CAN WORK 'EM\n</b><b>\t\t\tDOWN THE STAIRS.\n</b>\n\tRoger and Wooley and the men in their unit, snap on their\n\tbizarre looking gas masks.\n\n51\t The troopers break into an apartment on the floor. An old couple\n\tkneels in prayer at a small alter, while their children and\n\ttheir children's children huddle in a corner. The young husband\n\tsurrenders his gun to a trooper, and Roger watches as the group\n\tis led into the hallway.\n\n\tSuddenly, a young Black man charges out of one of the\n\tapartments. A woman appears at the door, screaming for him to\n\tstop. He breaks through a cloud of gas and Wooley fires his\n\tautomatic. The black man crashes to the floor. Wooley is crazed.\n\tHe kicks in the door of another apartment and fires randomly\n\tinto the room.\n\n\tThe flurry of action causes panic among the civilians in the\n\thall. The younger ones try to escape while the older people\n\tkneel or fall against the walls praying.\n\n<b>\tS.W.A.T. 2:  WOOLEY'S GONE APE SHIT, MAN...\n</b>\n\tRoger:\tWOOLEY! (shouting)\n\n\tWooley kicks in the door of another apartment. Roger charges at\n\thim and grabs him around the shoulders. The big man resists. His\n\tgun fires and bullets fly wildly. He struggles against Roger,\n\tbut Roger manages to hold on.\n\n\tRoger:\tGIMME A HAND...SOMEBODY...\n\n\tAnother S.W.A.T. Trooper steps up out of the cloud of gas. He is\n\tvery tall and he looks mysterious in the fog as he speaks in a\n\tdeep voice.\n\n\tTrooper:\tSTEP AWAY FROM HIM.\n\n\tRoger:\tGIMME A HAND.\n\n\tWooley throws his body around and slams Roger against the wall,\n\tbut Roger grabs him again just as the crazed man is levelling\n\toff his gun at the open apartment door.\n\n\tRoger:\tGODDAMMIT...HELP ME...HE'S CRAZY!\n\n\tTrooper:\tSTEP AWAY FROM HIM!\n\n\tJust then, Wooley wrenches free and pushes Roger across the\n\thallway. The Trooper carefully aims his weapon and fires one\n\tshot through Wooley's head. The big man falls back violently.\n\n\tThe mysterious Trooper turns and hurries away down the hall.\n\tOther S.W.A.T. Officers face him threateningly. He stares at\n\tthem through his mask. They let him pass. He disappears through\n\tthe smoke as other officers begin to restore order among the\n\tcivilians.\n\n\tWomen scream and cry over their dead-loved ones. Roger is helped\n\tto his feet by another Officer. Roger's eyes are wide and\n\tstaring through the insect-like lenses of his mask. They are\n\tlocked on the sight he sees through the door of the apartment\n\twhich Wooley kicked open. The other Trooper looks and his eyes\n\twiden as well.\n\n53\t In the apartment, lying in a pool of blood, are the partial\n\tremains of what was a human body. It has been ripped to shreds.\n\n\tRoger staggers against the door frame. The other trooper moves\n\tinside. Another corpse, also mutilated, one leg missing, one arm\n\tbadly mangled. It is trying to move. To reach the Troopers.\n\n54\t A sudden loud scream. Roger startles and spins around. A woman\n\tin the hall has seen the grisly sight, and she runs screaming\n\tdown the corridor. More confusion, as civilians push through the\n\tTroopers who try to hold them back.\n\n55\t The Trooper in the apartment is revulsed...\n\n\tTrooper:\tJESUS...HOLY JESUS...\n\n\tA third officer enters the apartment. He speaks to the Trooper\n\twhich is closest to the writhing corpse on the floor.\n\n\tTrooper 2:   SHOOT IT...SHOOT IT THROUGH THE HEAD.\n\n\tThe young officer is too dumb struck to respond so the third\n\tOfficer pulls out his pistol. Then suddenly, from out of the\n\tshadows, a spectre-like figure lunges at the third Officer,\n\tflailing and biting at his arms. It is a wild-haired woman.\n\tThere are several bleeding wounds over her body. She is one of\n\tthe walking dead.\n\n\tThe Trooper struggles to free himself, and Roger darts into the\n\troom. Although the Zombie is weak, she manages to hold on to the\n\tTrooper.\n\n\tAnother creature suddenly appears in the bedroom doorway. A\n\tmale, it staggers out into the room. The young Trooper struggles\n\twith his holster trying to free his hand gun. Suddenly, he feels\n\tsomething on his leg. The dismembered corpse is clutching his\n\tankle, pulling itself closer, it's mouth open. The boy tries to\n\tpull away, but falls onto the floor, crashing over a table and\n\tlamp. He tries to crawl away, but the frail corpse keeps its\n\thold and drags along behind the young Trooper, who still cannot\n\tfree his pistol.\n\n\tRoger and the third Officer fling all their weight against the\n\twoman Zombie. She flies against a wall, but bounces back\n\timmediately, and attacks again. The third Trooper's rifle fires.\n\tA slug tears through the woman's chest but it doesn't stop her\n\tonslaught. Another shot rips through her neck. Still she comes.\n\n\tThe boy on the floor manages to level off his pistol. He fires\n\tat the ghoulish head which draws closer to his leg. The thing's\n\tskull blows open and its grasp relaxes. The boy is shaking\n\tviolently. His arm and gun stay in the air, still poised. He\n\tfires again...and again...and again.\n\n56\t In the hall, the male Zombie appears, and the crowd panics. The\n\tTroopers try to keep things calm.\n\n<b>\tS.W.A.T. 3:  IT'S ONE OF THEM...MY GOD...IT'S ONE OF THEM.\n</b>\n<b>\tS.W.A.T. 4:  SHOOT FOR THE HEAD.\n</b>\n\tWoman:\tNO! NO! MIGUEL...DIOS MIO...MIGUELITO...\n\n\tThe woman pushes through the crowd. The Zombies advances. Before\n\tthe Trooper can stop her, the woman throws her arms around the\n\tcreature.\n\n\tWoman:\tMIGUEL...MI VIDA...MIGUELITO...\n\n<b>\tS.W.A.T. 3:  GRAB HER...GET HER OUT OF THERE...\n</b>\t\t\t(his gun is levelled off, but he can't get a shot)\n\n\tThe Zombie clutches at the woman. It bites at her neck...her\n\tarm. She screams with terror. She tries to pull away, but the\n\tcreature holds her. It bites again. A Trooper comes up from\n\tbehind and tries to wrestle the creature away. Another Trooper\n\tgrabs the woman and tries to free her. She is screaming\n\tinsanely. The Zombie pulls another piece of flesh off her arm.\n\n<b>\tS.W.A.T. 3:  STAND CLEAR...FOR CHRISSAKE...STAND CLEAR!\n</b>\n57\t In the apartment, the female Zombie lunges at the third Trooper\n\tand the two tumble to the floor. Roger wrestles her free and,\n\twith all his might, throws her against the wall. She advances\n\tagain. Roger raises his gun, She is just about to reach him. He\n\tfires. The bullet drops her.\n\n58\t In the hall, a Trooper brings his gun butt slamming against the\n\tmale ghoul's head. The creature loses his grip on the screaming\n\twoman. The Trooper who is holding her, pulls her free across the\n\tfloor. S.W.A.T. 3 fires. The bullet tears through the Zombie's\n\tshoulder...another shot...through his neck...another...through\n\tthe skull. It falls.\n\n59\t There is finally a calm. A few of the citizens murmur prayers.\n\tTroopers and befuddled old people seem to drift through the\n\tclouds of gas in a totally dazed state.\n\n60\t Roger and the third Trooper from the apartment drift to the\n\thallway. The third Trooper moves into the crowd, but Roger\n\tstands against the open door jamb for a moment.\n\n\tA sudden, loud gunshot makes Roger duck and spin around. He\n\tlooks into the apartment. The young Trooper has shot himself\n\tthrough the head.\n\n61\t In the dark firestair, it is very quiet. Roger bursts through a\n\tmetal door from one of the halls and falls against the stair\n\trailing. He is retching. He breathes heavily to contain himself.\n\tHe removes his mask and coughs slightly from the gas mist which\n\tstill clings in the air.\n\n\tVoice:\tYOU'RE NOT ALONE BROTHER.\n\n\tRoger tightens, grabbing for his gun. The voice is present; very\n\tnearby. Roger looks up. Sitting on the stairs above is the\n\tTrooper who shot Wooley. His rifle is aimed at Roger.\n\n\tVoice:\tYOU WAS IN WOOLEY'S UNIT.\n\n\tRoger:\tI DIDN'T SEE NOTHIN.\n<b>\t\t\tI DIDN'T SEE HOW HE DIED.\n</b>\n\tRoger slings his rifle, so the Trooper relaxes and lowers his\n\tgun. He removes his gas mask. He is Black.\n\n\tRoger:\tYOU RUNNIN?\n\n\tThe Black man shrugs. He hasn't decided.\n\n\tRoger:\tI DON'T JUST MEAN 'CAUSE OF WOOLEY.\n<b>\t\t\tI JUST MEAN 'CAUSE OF...\n</b>\n\tVoice:\tYEAH. I KNOW.\n\n\tRoger:\tTHERE'S A LOT OF PEOPLE RUNNIN'.\n<b>\t\t\tI COULD RUN.\n</b>\n\tRoger stares up at the grim faced Black.\n\n\tRoger:\tI COULD RUN RIGHT TONIGHT.\n\n\tThe black man just stares levelly into Roger's eyes.\n\n\tRoger:\tFRIEND OF MINE GOT A HELICOPTER. HE DOES\n<b>\t\t\tTRAFFIC FOR J.A.S. GOT A HELICOPTER AND HE'S\n</b><b>\t\t\tRUNNIN' OUT WITH IT. AS'T ME T'COME.\n</b>\n\tThe Black man smiles.\n\n\tRoger:\tYOU THINK IT'S RIGHT TO RUN?\n\n\tThe Black man shrugs again, then he stands and walks down the\n\tstairs. HE turns past Roger on the landing and continues down\n\tinto the lingering gas mist. Roger follows.\n\n62\t A few landings down...a noise. The two Troopers freeze. The\n\tstairwell is dark. The noise grows louder. The Troopers ready\n\ttheir weapons.\n\n\tThe sounds are little scraping thumps, like the weary foot falls\n\tof someone...something...trying to negotiate the stairs...There\n\tis the low, wheezing sound of laboured breath.\n\n\tThe men stare at the landing below. The Black man steps forward\n\tslightly, trying not to make a sound.\n\n\tSuddenly, a figure pops out of the darkness. It falls against\n\tthe wall below. Both Troopers raise their guns. The figure pulls\n\taway from the wall. In the mist, it's shape is ghostly...\n\trobed...in black...is sees the Troopers...\n\n\tFigure:\t SENORES...\n<b>\t\t\tPLEASE TO LET ME PASS...\n</b>\n\tThe voice weakens into a low wheezing cough. The figure slumps\n\tand sits on the steps, clinging to the railing. It is an old\n\tPriest, obviously from a local Puerto Rican Parish.\n\n\tRoger stoops next to the old man, who is struggling to keep his\n\tbreath. He is weary. He seems to be near death. He clutches at\n\this chest.\n\n\tRoger tries to support him.\n\n\tRoger:\tLET'S GET HIM TO THE MEDICS...\n\n\tPriest:\t NO...NO...NO...PLEASE. JUST...LET\n<b>\t\t\tME PASS...MY SISTER...I GO UP TO SEVEN\n</b><b>\t\t\tFLOOR...TO FIND MY SISTER...\n</b>\n\tRoger:\tTHEY'RE TAKIN' EVERYONE DOWN...THEY PROBABLY\n<b>\t\t\tBROUGHT HER DOWN...COME ONE...\n</b>\n\tPriest:\t MY SISTER...SHE IS DEAD...THEY TELL ME...\n<b>\t\t\tTHE DEAD THEY DO NOT BRING DOWN.\n</b>\n\tRoger and the Black Trooper shoot glances at one another.\n\n\tPriest:\t JUST LET ME PASS. MARTINEZ IS DEAD.\n<b>\t\t\tTHE PEOPLE OF 107 WILL DO WHAT YOU\n</b><b>\t\t\tWISH NOW. THESE SIMPLE PEOPLE...\n</b><b>\t\t\tBUT STRONG...THEY HAVE LITTLE...BUT THEY\n</b><b>\t\t\tDO NOT GIVE IT UP EASILY. AND THEY GIVE\n</b><b>\t\t\tUP THEIR DEAD...TO NO ONE!\n</b>\n\tThe Priest goes into a coughing fit. The Troopers look on. Roger\n\twants to help in some way.\n\n\tPriest:\t MANY HAVE DIED ON THESE STREETS IN THE LAST\n<b>\t\t\tWEEKS...IN THE BASEMENT OF THIS BUILDING\n</b><b>\t\t\tYOU FIND THEM...\n</b>\n\tThe Troopers are shocked. The Priest struggles to his feet.\n\n\tPriest:\t I HAVE GIVEN THEM THE LAST RITES.\n<b>\t\t\tNOW...YOU DO WHAT YOU WILL...\n</b>\n\tThe old man starts up the stairs. Roger moves to help him, but\n\tthe big Black man stops him. The Priest weaves up through the\n\tgas mist, coughing.\n\n\tPriest:\t YOU ARE STRONGER THAN US...BUT SOON, I\n<b>\t\t\tTHINK...THEY BE STRONGER THAN YOU...\n</b>\n\tThe old man's voice trails off up the stairwell as he disappears\n\tin the cloud...\n\n\tPriest:\t WHEN THE DEAD WALK, SENORES...WE MUST\n<b>\t\t\tSTOP THE KILLING...OR WE LOSE THE WAR...\n</b>\n63\t In the basement of the large building, S.W.A.T. troopers pry at\n\tthe boards which are nailed over the entrance to the storage\n\tarea.\n\n\tThe rest of the riot troops stand at the ready, weapons\n\traised...high powered rifles...flame throwers...\n\n\tThe nails creak loudly as they are pulled free. The men are\n\tsilent, not knowing what to expect.\n\n\tThere are three boards left...then two...\n\n\tWith a great, tearing sound, the door flies open before the men\n\tremove the last boards. The boards fly and the door almost rips\n\toff its hinges. Like flood waters, a small army of Zombies\n\tpushes into the hall.\n\n\tThey are wide eyed and terrifying. In life, they were mostly\n\tBlacks and Puerto Ricans from the neighbouring buildings. They\n\tare all ages, from the very old to the very young.\n\n\tThe riot troops are stunned. They cannot react quickly enough,\n\tand the squeeze is so tight in the little hall that it is\n\timpossible to shoot accurately, or without the bullets injuring\n\tother troopers.\n\n\tThe men fight back, wrestling and trying to back away. In the\n\tfront line, Zombies bite at the flesh of the humans. Teeth tear\n\tinto arms and hands. Some men are trampled in the crush.\n\n\tCommander:   BACK OFF...BACK OFF...SPREAD OUT...\n\n\tThe rear lines retreat into the wider vestibule, and as the mass\n\tof struggling bodies spreads out, shots begin to fire. Some\n\tTroopers, at close quarters, are able to fire off accurate\n\trounds with their hand guns. Others fall and are lunged at by\n\tclutching ghouls.\n\n\tRoger and the Black Trooper are in the middle of the battle.\n\tThey fight off several of the creatures. The battle spreads into\n\tlittle skirmishes through the dark hallways. The highly\n\torganised Troopers are scattered and confused by the mindless\n\tonslaught.\n\n64\t As the main action moves away from the entrance to the storage\n\tarea, several Troopers move into the room.\n\n\tThe walls are dank and grey. There is a dripping sound. All\n\taround lie remnants of human civilisation. Baby buggies and\n\tbicycles chained to pipes which ring the area. Large trunks and\n\tcartons of every size and shape; old beds and other furniture.\n\n\tAnd here and there throughout the large area lie the remains of\n\tcorpses. They have been eaten away. Most of them are still\n\tmoving, their heads uninjured.\n\n\tTwo of the Troopers retreat, revulsed. The sound of the gunfire\n\tand screaming can be heard from the hall.\n\n\tThe big Black man walks calmly into the room. Roger watches him.\n\tHe walks up to the writhing creatures one at a time, and fires\n\tcarefully aimed shots into their heads with his hand gun. Tears\n\troll down his cheeks.\n\n\tSome of the creatures are without arms and legs. Some have been\n\teaten away about the neck and shoulder. They moan with a\n\tgurgling, gutteral sound as they try to move.\n\n\tA young Black Zombie, pulling itself along the floor with one\n\tarm, draws close to the Black Trooper. The big man aims his\n\tpistol. It clicks...empty. He quickly and efficiently reaches\n\tfor more ammunition and begins to reload. The Zombie pulls\n\tcloser, its mouth wide.\n\n\tRoger steps up behind the other Trooper and fires into the\n\tcreatures head with his automatic rifle.\n\n\tThe Black man brushes tears from his eyes and continues to load\n\tthe pistol.\n\n\tRoger disposes of several other creatures. he comes to a place\n\twhere several are piled together. Some lie still, others writhe\n\tabout. Two on the heap, although they cannot move about, are\n\teating at parts of other bodies. Roger shoots them. They never\n\tlook up. They don't seem to notice him at all.\n\n\tA loud creaking sound breaks the mood suddenly. Roger looks up.\n\n65\t In the ceiling, a double set of loading doors has been opened.\n\tSeveral other Troopers look down into the storage area.\n\n\tTrooper:\tJESUS CHRIST.\n\n\tHe shines a light beam down towards Roger.\n\n\tTrooper:\tYOU OK DOWN THERE?\n\n64\t Roger nods.\n\n65\t Trooper:\tTHIS MUST BE WHERE THEY DUMPED 'EM IN.\n\n64\t Roger looks down at the pile of corpses beneath the opening.\n\n65\t Trooper:\tYOU NEED MORE MEN?\n\n64\t Roger shakes his head \"no\".\n\n65\t Trooper:\tJESUS CHRIST.\n\n\tThe trooper leaves the opening. He is replaced by two others who\n\tjust stare down into the storage room through the weird, round\n\tlenses of their masks.\n\n66\t The distant sounds of the battle in the hall flare up again. The\n\tbig Black man snaps his loaded clip into his pistol and takes a\n\tfew steps forwards. He sees a corpse wrapped in a bed sheet and\n\ttied securely with clothes line. It looks like a mummy. It is\n\twrithing, trying to free itself. he shoots it through the head.\n\n\tNearby, a small corpse, that of a very young child, is also\n\twrithing, but the end of the shroud, where the child's feet\n\tshould be, has been torn open and is bloody. A stump kicks\n\taround the blood where a foot has been eaten off. The Black man\n\tfires into the thing's head.\n\n\tRoger:\tTHEY...ATTACK...EACH OTHER...\n\n\tBlack:\tJUST THE FRESH CORPSES...BEFORE THEY REVIVE...\n\n\tRoger:\tWHY DID THESE PEOPLE KEEP THEM HERE? WHY\n<b>\t\t\tDON'T THEY TURN THEM OVER...OR...OR DESTROY\n</b><b>\t\t\tTHEM THEMSELVES...IT'S INSANE...WHY DO THEY\n</b><b>\t\t\tDO IT?\n</b>\n\tBlack:\t'CAUSE THEY STILL BELIEVE THERE'S\n<b>\t\t\tRESPECT IN DYING.\n</b>\n\tThe big man fires into the head of another squirming Zombie.\n\n67\t In the halls of the building, Troopers fall and are pounced on\n\tby ghouls. Other Troopers fire their automatics through the\n\theads of attacking Zombies. The riot troops try to stay\n\torganised, but the onslaught is so mindless and random that it\n\tis turning into a riot.\n\n68A\tThe buildings of Philadelphia loom in the moonlight. What few\n\tlights remain lit reflect in the waters of the Delaware.\n\n68B\tIt is quiet except for the slight sounds of lapping water and an\n\toccasional wooden creak as the floating docks strain against one\n\tanother.\n\n\tThere are a few big Police launches still docked in the marina.\n\tThey bob about silently. The chain, which normally restricted\n\tthe area, is broken and dangling. The sign, which reads: CITY OF\n\tPHILADELPHIA - POLICE - NO ADMITTANCE clangs against the broken\n\tchain in the wind.\n\n\tHalfway down the long dock is a little guard house. Inside,\n\tsitting at a radio transmitter, is the corpse of a uniformed\n\tguard.\n\n\tNearby is a separate floating dock on which is painted a large\n\tsquare pattern. It is a landing bay for Police helicopters.\n\tAlongside, afloat separately but securely chained fast, is a\n\tsmall fuel barge, with pumps and hoses for refueling the chopper\n\tand launches.\n\n\tThe other bodies lie bleeding on the bobbing docks, another\n\tofficer and a civilian. A bell buoy rings in the distance and we\n\tbegin to hear the sound of an approaching helicopter.\n\n\tThe blades of the J.A.S. Traffic Copter whine as they gear down\n\tfor a landing. The whirlybird settles like a hummingbird on the\n\tgently bobbing heliport.\n\n69\t With the blades still spinning loudly, Stephen hops out of the\n\tcockpit.\n\n\tSteve:\tCOME ON...I NEED YOU.\n\n\tFrancine unbuckles her safety belt and jumps out of her side of\n\tthe machine. Steve runs, ducking under the blades, around to the\n\twoman's side of the cockpit, grabs her hand, and they make for\n\tthe fuel pumps.\n\n\tSteve:\tI DON'T SEE ROGER. WE'LL GIVE HIM TEN MINUTES.\n\n\tFran:\tOH MY GOD!\n\n70\t The woman freezes in mid stride, and her action brings Stephen's\n\teyes around to see what she is staring at. The two bodies which\n\tlie near the fuel pumps.\n\n\tSteve:\tYOU HAVEN'T BEEN OUT IN IT AT ALL.\n<b>\t\t\tIT'S TOUGH TO GET USED TO IT.\n</b>\n\tHe pulls her quickly along. They have to actually step over the\n\tcivilian corpse. Fran freezes again. She can't bring herself to\n\twalk over the body. Steve lets go of her hand and checking the\n\ttank gauge, he pulls the hose with him as he moves quickly back\n\tto Fran. The long hose is heavy, and it bobbles the civilian\n\tcorpse, almost rolling it over. The back of the bodies head has\n\tbeen blown out by the exit wound of a powerful bullet. Blood\n\tstill runs. The wound is fresh. Steve does not see this as he\n\ttugs the hose over the corpse and moves to the helicopter with\n\tFran following.\n\n71\t At the side of the machine, the blades still spinning overhead,\n\tSteve jams the hose nozzle into the fuel tank receptacle. He\n\tpulls one of Fran's hands into the nozzle mechanism.\n\n\tSteve:\tJUST LIKE THIS...LIKE A CAR...\n\n\tFran responds, getting the feel of the nozzle trigger.\n\n\tSteve:\tTHAT'S IT...JUST HOLD HER THERE 'TIL SHE\n<b>\t\t\tSPITS OUT AT YA.\n</b>\n\tThe woman takes over and Stephen trots away toward the guard\n\tshed. The propeller blades still spin. They make an eerie,\n\twhispering sound as they pass over Fran's head. She can hear the\n\tlapping water now, and the creaking moans of the shifting docks.\n\tShe looks this way and that, fear in her eyes.\n\n72\t At the guard house, Stephen rushes in to find the dead radio\n\toperator. A signal is coming over the receiver in Morse Code.\n\tThe corpse is slumped over the desk and it is covering the send\n\tkey. A small entry wound is barely visible in the back of the\n\tdead man's head. As Stephen pulls the body up to an erect\n\tposture in its chair, he sees that the exit of the bullet all\n\tbut obliterated the corpse's face. Again the wound is still\n\trunning and bits of flesh and blood are splattered about the\n\tdesk and the radio unit.\n\n\tStephen clicks on the send switch and he quickly begins to send\n\ta message in Morse:\n\n<b>\t\t\tOPERATOR DEAD...POST ABANDONED...\n</b>\n73\t Back on the fuel dock, the long hose brushes over the civilian\n\tcorpse. A shadow moves nearby, making is aware of a presence\n\tother than Fran's.\n\n74\t The woman switches hands on the pump nozzle. The blades still\n\twhoosh overhead. Then she hears the sound of another engine. She\n\tlooks towards the mainland. The headlights of an approaching\n\tvehicle can be seen.\n\n75\t At the guard house, Stephen, hearing the approaching engine,\n\tsteps into the doorway and looks up the dock. He calls to Fran.\n\n\tSteve:\tI HOPE IT'S ROGER.\n\n76\t Fran:\tWHAT ARE YOU DOING?\n\n\tSteve:\tI'LL BE RIGHT THERE.\n\n77\t He ducks back into the shed. He snatches up a First Aid Kit and\n\tthrows it into a khaki knapsack. He rummages in the darkness. He\n\tfinds a toolbox.\n\n\tAs he stands up, he backs into a tall figure which stands in the\n\tshadows. Feeling something sharp and hard against his back.\n\tSteve recoils and spins to face the figure. It is a uniformed\n\tofficer. His rifle is levelled off at Steve's chest. From out of\n\tthe shadows, a second Policeman appears with a hand gun cocked\n\tand aimed.\n\n78\t Fran's eyes strain to discern the approaching vehicle, but\n\tsuddenly she catches a movement in the corner of her vision.\n\tThrough the open sides of the helicopter bubble, she notices a\n\tPolice van. It has been there all along, it's doors flung wide\n\topen, as though abandoned hurriedly. Now one of the rear doors\n\tmove. A figure appears carrying a large packing carton. The\n\tfigure is uniformed, with two rifles strapped to its back. It\n\trushes toward the launch docks.\n\n\tVoice:\tJUST STAY COOL.\n\n\tFran, already startled by the running figure, is now doubly\n\tshocked by the calm voice behind her. She spins and the fuel\n\tnozzle clatters out of it's receptacle to the wooden dock\n\tboards. She is facing another \"Policeman\", to aims a rifle\n\tdirectly at her head.\n\n\tOfficer 1:   IF YOU DIE...IT'LL BE YOUR OWN FAULT.\n\n\tThe Officer who is running with the carton shouts toward the\n\tGuard House.\n\n\tOfficer 2:   COME ON SKIPPER...THEY GOT FRIENDS COMIN'.\n\n79\t In the Guard House, Steve is held at bay by one of the Officers\n\twhile the other uniformed man moves to the door to check the\n\tprogress of the approaching vehicles.\n\n\tOfficer 3:   WHO ARE YOU?\n\n\tSteve:\tWE'RE WITH J.A.S...WE...\n\n\tOfficer 4:   (at the door)\n<b>\t\t\tABOUT A MINUTE AND A HALF.\n</b>\t\t\t(referring to the arrival time of the vehicle)\n\n\tOfficer 3, the Skipper, pushes Steve with his gun barrel. Steve\n\tspins out through the open doorway. He looks up the dock and\n\tsees the vehicle which is just turning onto the pier which is\n\talmost a mile long.\n\n80\t Officer 1 has moved around Fran and he reaches into the\n\thelicopter bubble pulling out Steve's rifle.\n\n81\t Steve:\tNOW WAIT A MINUTE...WE'RE JUST HERE TO REFUEL...\n<b>\t\t\tTHESE MEN WERE ALREADY DEAD...YOU WERE HERE...\n</b><b>\t\t\tYOU KNOW THAT...IT LOOKS LIKE SOMEBODY WAS\n</b><b>\t\t\tAFTER THE LAUNCHES...WE HAD NOTHING TO DO WITH...\n</b>\n\tOfficer 3:   (looking at the insignia on the helicopter)\n<b>\t\t\tHEY...J.A.S. TRAFFIC WATCH...\n</b><b>\t\t\tSTEVE ANDREWS.\n</b>\n\tSteve:\t(trying to capitalise on his minor celebrity power)\n<b>\t\t\tRIGHT...THAT'S ME...I'M STEVE ANDREW...\n</b>\n\tOfficer 3:   NO SHIT.\n\n82\t Officer 1:   (shouting from the helicopter)\n<b>\t\t\tWE'D GET A LOT FURTHER IN THIS BIRD, SKIPPER.\n</b>\n83\t Steve freezes again, sensing that these are not law enforcers.\n\n84\t The man who was carrying the carton is now rushing back up the\n\tdock having deposited his load in one of the motor launches.\n\n\tOfficer 2:   CAN'T ALL FIT.\n\n85\t Officer 3:   (directly to Stephen)\n<b>\t\t\tHOW MANY WILL THAT THING HOLD?\n</b>\n\tOfficer 4:   HEY, MAN, I AIN'T GOIN' NOWHERE IN NOTHIN' I\n<b>\t\t\tCAN'T DRIVER MYSELF!\n</b>\n86\t Officer 2 has returned to the van and is carrying out another\n\tcarton rushing back to the launch.\n\n\tOfficer 2:   THAT'S TRUE...SOMETHIN' HAPPENS TO HIM AND\n<b>\t\t\tWE'RE STUCK. STAY WITH THE LAUNCH!\n</b>\n\tOfficer 1:   GET A LOT FURTHER IN THIS BIRD!\n\n87\t Suddenly, above the two white headlights of the approaching\n\tvehicle, we see a third light in red. It is the spinning\n\t\"bubble-gum-machine\" of a Squad Car. It is heralded by one\n\tblast of the car's siren.\n\n88\t Officer 4:   HEY, THAT'S A BLACK AND WHITE!\n\n89\t Officer 1 still holds his rifle aimed at Fran.\n\n\tOfficer 1:   THEY SEEN US!\n\n90\t Officer 3:   IT'S ALRIGHT...WE'RE POLICE...\n\n91\t Officer 2 dumps his carton at the edge of the dock and pulls one\n\trifle from his back.\n\n\tOfficer 2:   BULL SHIT...LET'S GET TO THE BOAT!\n\n92\t Officer 3 stares hard at Stephen. Then at the Squad Car. Then\n\tback at the nervous young pilot.\n\n\tOfficer 3:   YOU'RE RUNNIN', AIN'T YOU, FLY BOY?\n\n\tSteve does not respond. He is terrified, not knowing what answer\n\tto be the safest.\n\n\tOfficer 3:   YOU AND YOUR FRIENDS IS RUNNIN' OFF IN THE\n<b>\t\t\tJ.A.S. TRAFFIC BIRD...\n</b>\n\tThe man starts to grin with knowing. He suddenly feels in more\n\tcontrol.\n\n\tOfficer 3: SIT TIGHT, BOYS...THEY'RE RUNIN', TOO.\n\n93\t It seems to take forever for the Police Car to pull down the\n\tdock. Stephen takes a few steps forward, squinting to see, but\n\the is threatened by the \"Policeman's\" gun barrels.\n\n94\t The car screeches to a stop and two armed S.W.A.T. Troopers\n\timmediately pop out of the front seat on either side. They are\n\tRoger and the Black Trooper.\n\n\tRoger:\tWHAT'S THE PROBLEM, OFFICER?\n\n95\t Officer 3:   CAUGHT YOUR FRIENDS HERE STEALIN' COMPANY\n<b>\t\t\tGASOLINE.\n</b>\n96\t Roger:\tWHAT DO YOU MEAN FRIENDS?\n\n\tRoger is trying to play dumb, assuming that the other Policemen\n\tare on official business...\n\n97\t Steve:\tTHEY KNOW, ROG...\n<b>\t\t\tTHEY'RE TRYIN' TO GET OUT, TOO.\n</b>\n\tOfficer 3:   IT'D BE CRAZY TO START SHOOTIN' AT ONE\n<b>\t\t\tANOTHER, NOW WOULDN'T IT?\n</b>\n98\t Roger:\tSURE WOULD.\n\n99\t Officer 1:   ALRIGHT, LET'S LOAD UP...\n\n\tHe slings his rifle and tosses the other gun back to Fran. She\n\tbobbles it and it falls, skittering across the dock.\n\n\tOfficer 1:   YOU BETTER LEARN HOW TO USE THAT THING, WOMAN.\n<b>\t\t\tTIMES IS TENSE.\n</b>\n100\tThe policemen start to unload crates and cartons from their Van.\n\tThe big Black Trooper pulls a few supplies from out of the squad\n\tcar and carries them toward the helicopter.\n\n101\tFran trots over toward Stephen. He is just coming back out of\n\tthe guardhouse where he picked up the toolbox and the knapsack\n\tfull of supplies. The woman falls into his arms. Roger trots up.\n\n\tRoger:\tYOU OK?\n\n\tStephen:\t(nods)\n<b>\t\t\tWHO'S HE?\n</b>\t\t\t(referring to the big Black)\n\n\tRoger:\tHIS NAME'S PETER. HE'S ALRIGHT.\n\n\tThe three are already moving toward the helicopter.\n\n\tRoger:\tLET'S HUSTLE.\n\n102\tPeter has stowed the supplies in the rear of the cockpit, and he\n\thas noticed the fuel hose lying on the dock. He tries the nozzle\n\tin the receptacle on the chopper and holds it in until the tank\n\tfills.\n\n103\tThe other \"Policemen\" are still moving cartons of supplies from\n\ttheir van down the dock.\n\n\tRoger:\t(to the other Policemen)\n<b>\t\t\tYOU GUYS BETTER MOVE IT. THERE'S A RADIO\n</b><b>\t\t\tREPORT ABOUT THE DOCK BEIN' KNOCKED OUT.\n</b>\n104\tThey reach the cockpit. Fran climbs in and crouches on the floor\n\tin the rear of the bubble.\n\n\tFran:\tYOU SURE THIS'LL CARRY US ALL.\n\n\tSteve:\tLITTLE HARDER ON THE FUEL, BUT WE'LL BE OK.\n\n105\tAs Peter climbs aboard, one of the other policemen, carrying a\n\tfinal carton, speaks to Roger.\n\n\tOfficer 2:   HEY...YOU GOT ANY CIGARETTES.\n\n\tRoger looks at the others one at a time. Fran shakes her head\n\t\"no\".\n\n\tRoger:\tSORRY. (he trots around to the passenger seat)\n\n\tSteve:\tWHERE YA HEADED?\n\n\tOfficer 2:   DOWN RIVER...GOT AN IDEA MAYBE WE CAN MAKE IT TO\n<b>\t\t\tTHE ISLANDS.\n</b>\n\tSteve:\tWHAT ISLANDS? (he starts the engine)\n\n\tOfficer 2:   ANY ISLANDS...WHAT ABOUT YOU? WHERE YOU HEADED?\n\n\tSteve:\tSTRAIGHT UP.\n\n106\tThe Policeman rushes off with his two cohorts. As they untie one\n\tof the launches from the dock, the J.A.S. helicopter whines\n\tloudly. Then it lifts off the dock with a smooth motion.\n\n\tThe Police launch starts without a problem, and it pulls out\n\tonto the dark river.\n\n107\tThe lights on the helicopter blink as the metal bird swoops low\n\tover the Philadelphia skyline. We see an empty city.\n\tIndependence Hall...Betsy Ross' House, which flies the original\n\tAmerican flag...the oldest American heritages stand coldly in\n\tthe night. The whirring engine fades overhead.\n\n108\tIn the cockpit, Fran lights a cigarette. So does Roger. No one\n\tcomments, but Peter smiles slightly.\n\n\tThe big Black looks down at the city.\n\n\tPeter:\tANY OF YOU LEAVIN' PEOPLE BEHIND?\n\n\tFran:\tAN EX-HUSBAND.\n\n\tRoger:\tAN EX-WIFE.\n\n\tSteve:\tYOU PETER?\n\n\tPeter:\t(still looking down)\n<b>\t\t\tSOME BROTHERS.\n</b>\n109\tThe whirlybird cuts through the dark night sky. It flies over\n\topen country now, moving West. Some time has passed.\n\n110\tRoger is asleep in the passenger seat. Twisted in the cramped\n\trear of the cockpit, Fran and Peter sit very close to each\n\tother. Peter still stares off into the night.\n\n\tFran:\tREAL BROTHERS?\n\n\tPeter looks at her. He has a strong face.\n\n\tFran:\tREAL BROTHERS OR...STREET BROTHERS?\n\n\tPeter:\tBOTH.\n\n\tFran:\tHOW MANY REAL ONES?\n\n\tPeter:\tTWO.\n\n\tFran:\tTWO.\n\n\tPeter:\tONE'S IN JAIL. THE OTHER'S A PRO BALL PLAYER.\n<b>\t\t\tBUT WE CATCH UP TO EACH OTHER ONCE IN A WHILE.\n</b>\n\tFran doesn't quite know how to respond.\n\n\tPeter:\t(nodding at Steve...the engine roars too loudly\n\t\t\tfor the pilot to hear the conversation)\n<b>\t\t\tHE YOUR MAN NOW?\n</b>\n\tFran is taken off guard. She smiles slightly.\n\n\tFran:\tMOST OF THE TIME, YEAH.\n\n\tPeter:\tJUST LIKE TO KNOW WHO EVERYONE IS.\n\n\tFran:\tYEAH. ME TOO.\n\n111\tLight downs on the horizon. The little helicopter chugs through\n\tthe shades of blue.\n\n112\tNow Fran is asleep and Roger still snores. Peter stares at the\n\tback of the pilot's head. Steve nods slightly, then shakes\n\thimself. Soon, he nods again...falling asleep. Peter kicks him\n\tin the shoulder.\n\n\tSteve looks back, surprised that the big man is awake. Peter\n\tjust stares at him.\n\n\tSteve rubs his face violently with his free hand. He pulls at\n\this lower eyelids.\n\n\tSteve:\tANY MORE WATER?\n\n\tPeter reaches into the supplies and produces a plastic container\n\twith water. Steve slugs some of it and pours a little onto his\n\tface. Then he passes it back to Peter, who also drinks.\n\n\tSuddenly, Fran stiffens and wakes up with a start. Peter looks\n\tover at her with a gentle expression. She takes a moment to\n\torient herself.\n\n\tPeter:\t(to Stephen)\n<b>\t\t\tYOU KNOW WHERE YOU ARE?\n</b>\n\tSteve:\tI KNOW EXACTLY WHERE WE ARE.\n\n\tPeter:\tHARRISBURG?\n\n\tSteve:\tPASSED IT ABOUT AN HOUR AGO.\n\n\tRoger finally wakes up from the loud talking.\n\n\tSteve:\tWE'RE PRETTY LOW ON FUEL. I'M JUST WAITIN'\n<b>\t\t\tFOR FULL LIGHT SO WE CAN SEE WHAT WE'RE\n</b><b>\t\t\tLANDIN' IN.\n</b>\n113\tIn the morning light, several fires can be seen on the ground,\n\twhere buildings are burning.\n\n114\tThe chopper flies over a National Guard convoy as it chugs up a\n\twinding country road.\n\n115\tHere and there on the ground, human activity can be seen. Search\n\tand Destroy units, made up of Police, Guardsmen and civilian\n\tvolunteers move across the country side. Occasionally, a Zombie\n\tis seen staggering through the trees or over a field. Gunfire\n\tcuts the creature down.\n\n116\tRoger:\tJESUS. IT'S EVERYWHERE.\n\n\tSteve:\tWE'RE STILL PRETTY CLOSE TO JOHNSTOWN. WE'RE\n<b>\t\t\tBETTER OFF AWAY FROM THE BIG CITIES.\n</b>\n117\tA little country airfield lies quiet in the morning sun. There\n\tis no sign of life. A few private planes dot the area, but the\n\ttower is empty. The J.A.S. chopper buzzes very low just outside\n\tthe tower windows.\n\n118\tAs the whirlybird slowly sets down near the fuel pumps, its\n\tblades create a wind blast which raises great clouds of dust\n\tfrom the dry earth. Sheets of old newspaper and other light\n\tdebris are sent flying through the air in all directions.\n\n119\tOne piece of torn newsprint blows flat against a window in one\n\tof the little sheds.  It sticks against the glass for a moment,\n\tas though glued there, then it flutters to the ground. As the\n\tpaper clears the glass, we see the face of a badly scarred\n\tZombie peering out through the window.\n\n120\tAs the group scrambles out of the helicopter, Stephen\n\timmediately checks the fuel pumps.\n\n\tSteve:\tSHIT, MAN, DAMN NEAR EMPTY.\n\n\tRoger:\tLOTTA PRIVATE PLANES IN FARM COUNTRY LIKE THIS.\n<b>\t\t\tGUESS THEY ALL HIT THE PUMPS AND TOOK OFF.\n</b>\n\tSteve:\tTO WHERE? WHERE THE HELL CAN THEY GO?\n\n\tPeter:\tWHERE WE GOIN?\n\n\tBy now, Steve has drained the dregs from the first pump into the\n\tchopper's tank, and moved to the second pump. It spurts with\n\tmore force.\n\n\tSteve:\tTHERE'S A GOOD BIT LEFT IN THIS PUMP.\n\n\tHe stretches the hose toward the chopper but it doesn't quite\n\treach.\n\n\tSteve:\tDAMN. I GOTTA GET IT CLOSER.\n\n121\tSteve jumps back into the cockpit and the machine lifts off the\n\tground.\n\n122\tFran is watching the action, walking slowly backwards to a small\n\trickety hangar area. She turns and looks down to the private\n\thangars. Most of them are open wide, the planes they housed long\n\tgone. One or two of the old wooden double-doors are still closed\n\tand locked with chains and padlocks. The wind from the chopper\n\tblades blows her hair and sends more debris flying.\n\n123\tPeter kicks open the door to the chart house. The room is dusty\n\tand dilapidated. A few small chairs surround an old wooden\n\ttable. Several half finished cups of coffee sit on top of\n\twrinkled flight charts leaving brown rings on the paper. Flies\n\tbuzz loudly. An old window shade clicks against its window from\n\tthe gusting of the wind and it makes Peter flinch.\n\n\tHe readies his weapon. When he sees the shade, he steps over to\n\tit easily, pulls it and lets it roll up on itself. It makes a\n\tloud, flapping noise.\t\n\n124\tOutside, the chopper sets down. Roger is ready with the hose\n\tnozzle. Ducking under the blades he inserts the device into the\n\ttank receptacle even before Stephen has idled the engine.\n\n\tStephen hops out of the cockpit and shouts over the engine\n\tnoise.\n\n\tSteve:\tI'M GONNA SEE WHAT'S LEFT IN THE HANGARS.\n\n\tHe trots off after Fran.\n\n125\tIn the chart house, Peter idly drops a coin into an old coffee\n\tmachine at one end of the room.  The machine clicks loudly and\n\tspits out a cup. To Peter's surprise, the cup starts to fill\n\twith hot brown liquid.\n\n\tWhile he waits. Peter notices a series of notes taped to the\n\tmachine and the surrounding walls. They are all written\n\thurriedly in various hands and with all sorts of inks and \n\tcolours.\n\n<b>\t\t\tLUCY - GONE TO JOHNSTOWN.\n</b><b>\t\t\tCHARLES - I HAVE THE KIDS. LEFT WITH BEN.\n</b><b>\t\t\tCOULDN'T WAIT. GONE TO ERIE - JACK FOSTER.\n</b>\n\tThere are dozens of such messages. Peter takes the full coffee\n\tcup from the machine. As he sips it, his eyes fall on a closet\n\tdoor just across the room. It is moving slightly. It is locked,\n\tbut it bangs against the lock...once...twice...more regularly\n\tthan if caused by the wind drafts.\n\n\tPeter steps closer. Now the door bangs violently with a loud\n\tcrash, but it holds. Peter sets his coffee on the chart table\n\tand takes his rifle in both hands.\n\n\tAgain the door bangs hard, and a skeleton key is knocked out of\n\tthe keyhole. It falls to the floor with a metallic clang, and\n\tPeter notices a caked blood stain where blood recently ran out\n\tof the closet, under the door and onto the linoleum.\n\n\tAnother bang and a gurgling moan. One of the living dead is\n\ttrying to break out of the closet.\n\n\tQuite calmly. Peter raises his rifle and aims it at the door\n\tabout head high. The rifle roars in the little room, and a\n\tsplintery hole appears in the old wooden door.\n\n126\tOutside, Fran and Stephen snap to attention at the sound of the\n\trifle. Fran stands at the entrance to one of the little wooden\n\thangars. Stephen is checking out the cockpit of an old Cessna\n\tinside. Immediately, Stephen runs out and grabs Fran's hand. As\n\tthey turn the corner to run up the grade to the helicopter, they\n\tare confronted with two Zombies, staggering slowly towards them\n\tthrough the dust cloud from the chopper.\n\n\tFran screams. They have no weapons with them.\n\n\tSteve:\tROGER...ROGER...\n\n127\tUnder the whirling chopper blades, Roger continues to fill the\n\tfuel tank. In the roar of the engine, he cannot hear anything\n\telse.\n\n\tA third Zombie lumbers toward the helicopter. Roger's back is\n\tto the creature and he is unaware of the impending danger.\n\n128\tInside the chart house. Peter stares at the closet door. It is\n\tstill for a moment...then another moan and the door bangs again.\n\n\tPeter fires two shots, lower right and lower left of the first\n\tforming a triangle.\n\n129\tThe two creatures advance slowly on Fran and Steve.\n\n\tSteve:\tJUST RUN.\n\n\tFran is petrified. She turns and looks behind them. They are\n\tboxed in by the hangars.\n\n\tSteve:\tRUN RIGHT PAST 'EM...RIGHT AROUND 'EM.\n<b>\t\t\tTHEY CAN'T CATCH YOU.\n</b>\n\tShe hesitates. The Zombies draw closer.\n\n\tSteve:\tRUN, FRANNIE. GODDAMMIT, I'M RIGHT BEHIND YOU.\n<b>\t\t\tWE CAN HANDLE THEM!\n</b>\n\tFran charges up the little grade. She runs to the right of the\n\tcreatures and they move in her direction, arms outstretched. As\n\tshe draws near to the dead things, she hesitates again in\n\tfright. The creatures claw at the air. The one in front is\n\twithin a few feet of the woman.\n\n\tSteve:\tRUN, FRANNIE. MOVE!\n\n\tFran stares into the dead, staring eyes of the lead Zombie. She\n\tis almost hypnotised. At the last instant, she runs and just\n\tgets past the creatures. A little up the grade, she turns and\n\tlooks back, stopping again.\n\n\tOne Zombie turns slowly and starts up the grade after Fran. The\n\tother continues to advance on Stephen.\n\n130\tStephen ducks back into the open hangar. It is very dark but for\n\tthin beams of sunlight which cut through between the wooden\n\tboards of the structure. Stephen roots around among the greasy\n\ttools which clutter the area. He finds an enormous sledge\n\thammer. He runs out of the shed.\n\n131\tHe dodges around the lead Zombie, who staggers on with inertia.\n\tSteve sees that Fran is still facing the second creature. The\n\tman takes a firm grip on the giant hammer as he charges up the\n\tgrade toward the Zombie's back. As he reaches the creature, he\n\tbrings the twenty pound steel head of the sledge slamming\n\tagainst the ghoul's skull with all his might.\n\n\tThe creature staggers on for a few more steps, its head a bloody\n\tpulp, then it falls to its knees and finally flops face down in\n\tthe dust.\n\n\tWithout breaking stride, Stephen grabs Fran's hand and the two\n\trun toward the helicopter. The other Zombie at the hangar has\n\tturned around and is walking up the grade.\n\n132\tRoger is pumping the last drops out of the fuel hose when he\n\tsees the frightened couple making for the chopper.\n\n133\tAs Steve charges up the grade he sees the Zombie approaching\n\tRoger from behind.  Steve shouts and Roger spins around. The\n\tstumbling creature is very close. It raises its arms and its\n\thands clutch at the air. Roger lets the fuel nozzle drop to the\n\tground. He is trapped at the side of the machine. He doesn't\n\thave his rifle. He fumbles with the snap on his hand-gun\n\tholster.\n\n\tSuddenly, the blank face of the Zombie turns red as the top of\n\tits head seems to disintegrate into a bloody pulp. The creature\n\thas walked into the spinning chopper blade. Its body staggers\n\tforward another step or two, then the thing collapses in a heap.\n\n134\tStephen and Fran have reached the chopper. Steve let's go of the\n\twoman's hand and he drops his bloody sledge to the ground. He\n\tlunges into the cockpit and snatches up his rifle, ducking in\n\tthe propeller draft.\n\n135\tThe Zombie which is stumbling up the grade from the hangars\n\talmost loses its footing, but it regains its balance and\n\tadvances steadily toward the helicopter.\n\n136\tThe shot misses clean. He fires again. The bullet grazes the\n\tcreature's face. It staggers from the impact, but does not fall.\n\n137\tRoger moves quickly for his high powered weapon. Steve fires\n\ttwo more rounds.\n\n138\tAnother miss and another graze, this time on the arm.\n\n139\tHe is about to shoot once more when Roger stops him, stepping up\n\talongside.\n\n\tRoger calmly aims and fires one shot cleanly through the\n\tcreatures' brain.\n\n140\tThe Zombie falls and papers blow over its body.\n\n141\tIn the chart house. Peter fires several more shots into the\n\tcloset door. Bullet holes appear just where the creature's head\n\tshould be. There seems to be no way that the volley could have\n\tmissed.\n\n\tSilence for a moment. Peter still holds his gun high.\n\n\tThen, with a great crash, the closet door flies open into the\n\troom. Two small children burst out. One has no left arm; the\n\tother has been bleeding from a great wound in his side. They are\n\tdead. They move directly toward Peter. Their heads are at least\n\ta foot shorter than the bullet holes in the closet door.\n\n\tPeter stares down at the creatures, revulsed.  He is so startled\n\tthat he cannot react quickly enough, and they are on him. The\n\tmoment he feels their clammy grasp, he regains his survival\n\tinstincts. He cannot effectively aim his rifle. He kicks and\n\tthrashes around. One creature flies against a wall. The other is\n\tabout to bite the man's arm. The big Black grabs the small\n\tZombie and flings it physically back. The other creature pounces\n\ton his back. He throws it over his shoulders and it crashes\n\tagainst its brother.\n\n\tNow Peter raises his gun. As the children try to scramble to\n\ttheir feet the man fires several shots in rapid succession.\n\tFirst one creature falls; then the other.\n\n\tPeter continues to fire, his eyes wide with desperation and\n\tdisgust. Finally his weapon clicks. It is out of ammunition.\n\n\tPeter breathes heavily. He stares at the small corpses.\n\tInstinctively, he begins loading his weapon, without even\n\tlooking at the action, as he backs wearily out toward the door\n\tof the chart house.\n\n\n142\tBehind him, in the brightly sunlit doorway, we see the Zombie\n\twho first appeared at the window. The creature staggers forward.\n\tPeter turns and startles. He reaches for more shells and backs\n\taway a few steps as he tries to load the bullets into his gun.\n\tThe creature reaches out and takes another step into the room.\n\n\tPeter stares into the creatures eyes. Then suddenly, out in the\n\tsunlight, a few hundred feet behind the Zombie, Stephen appears\n\twith his rifle. Peter sees the man over the creature's shoulder.\n\n143\tSteve raises his gun and aims at the Zombie, but the barrel\n\tseems to be on a straight line with Peter.\n\n144\tPeter ducks quickly. Steve's gun fires. The bullet misses the\n\tcreature cleanly and crashes into the room. It ricochets off\n\tthe coffee machine. Another shot crashes through the glass in\n\tthe front room.\n\n\tPeter crouches, still stuffing shells into his weapon. A third\n\tof Stephen's bullets tears through the Zombie's shoulder, but\n\tthe creature still stands. It turns toward Peter slowly. Peter\n\tcrawls under the table as another shot splatters into the coffee\n\tcups.\n\n145\tOnce again, Roger steps up beside Stephen.  He fires one\n\tcarefully aimed shot, looking through his telescopic range-\n\tfinder.\n\n146\tJust as Peter finishes loading his weapon, the Zombie crashes\n\tinto the room, falling over the table and onto the floor.\n\n147\tFran is still kneeling in the dust, trying to keep herself from\n\tvomiting. Stephen rushes to her side. Roger, keeping his rifle\n\tpoised, shouts toward the chart house.\n\n\tRoger:\tPETER.\n\n148\tThe big Black man appears in the doorway, snapping the safety on\n\this rifle.\n\n151\tFran's retching causes her to choke and cough. Steve tries to\n\tcomfort her, not knowing what to say and shaking himself.\n\n152\tPeter advances with long strides.\n\n153\tStephen looks up when the Black man is a dozen steps away.\n\tImmediately, he sees the anger in Peter's eyes. The big Trooper\n\tthen raises his rifle and aims it a Stephen. Steve tries to\n\tstand, but trips and falls on his back in the dust. In an\n\tinstant, Peter is looming over him with the barrel of his rifle\n\taimed at point blank range for the shivering man's forehead.\n\n\tFran screams through her choking...\n\n\tFran:\tNO...MY GOD...DON'T... WHAT ARE YOU DOING?\n\n\tPeter speaks calmly to Stephen, in low tones.\n\n\tPeter:\tYOU NEVER AIM A GUN AT ANYONE, MISTER.\n<b>\t\t\tIT'S SCARY.\n</b><b>\t\t\tISN'T IT?\n</b><b>\t\t\tISN'T IT?\n</b>\n\tStephen looks up at the tall man, shivering. Then Peter lowers\n\this weapon and extends his hand, helping Stephen up onto his\n\tfeet.\n\n154\tRoger clears the fuel hose from around the runners of the\n\tchopper. Peter climbs into the cockpit and sits in the rear\n\twithout saying another word.\n\n\tRoger helps Fran climb aboard. Steve wanders around the front of\n\tthe cockpit bubble and climbs into the Pilot's seat. Roger\n\tclimbs in behind Fran as she squeezes into the uncomfortable\n\tspace beside Peter. The big black offers the woman a sip of\n\twater, which she accepts. Then she lets her head flop wearily\n\tagainst the rear bulkhead.\n\n155\tSteve is urgently surveying his flight charts, shuffling the\n\tpapers and trying to seem very busy after the embarrassment of\n\tthe incident.\n\n\tSteve:\tWE GOTTA FIND FUEL. MAYBE CLOSER TO PITTSBURGH.\n\n\tRoger:\tNO, WE'VE GOTTA STAY OUT OF THE BIG CITIES.\n<b>\t\t\tIT IT'S ANYTHING LIKE PHILLY WE MIGHT NEVER\n</b><b>\t\t\tGET OUT ALIVE.\n</b>\n\tPeter:\tWE MIGHT NOT GET OUT OF ANY PLACE ALIVE.\n<b>\t\t\tWE ALMOST DIDN'T GET OUT OF HERE.\n</b>\n\tRoger:\tWE'RE GETTIN' OUTA HERE FINE.\n<b>\t\t\tAS LONG AS THERE'S NOT TOO MANY OF THOSE\n</b><b>\t\t\tTHINGS WE CAN HANDLE 'EM EASY.\n</b>\n\tPeter:\tYEAH, WELL IT WASN'T \"THOSE THINGS\" THAT\n<b>\t\t\tNEARLY BLEW ME AWAY!\n</b>\n\tStephen turns around and is about to say something angrily.\n\tRoger stops him by speaking urgently.\n\n\tRoger:\tWE GOTTA STAY IN THE STICKS. THERE'S BOUND TO\n<b>\t\t\tBE MORE LITTLE PRIVATE AIRPORTS UPSTATE.\n</b>\n\tSteve:\t(reluctantly going back to his charts)\n<b>\t\t\tTHERE'S THE LOCKS ALONG THE ALLGHENY.\n</b><b>\t\t\tFUEL STATIONS THERE, PRIVATE AND STATE.\n</b>\n\tRoger:\tPROB'LY STILL MANNED. WE DON'T NEED THOSE\n<b>\t\t\tHASSLES EITHER.\n</b>\n\tSteve:\tTHEY'RE JUST OUT AFTER SCAVENGERS...LOOTERS...\n\n\tPeter:\tOH, YOU GOT THE PAPERS FOR THIS LIMOUSINE?\n\n\tSteve:\t(angrily)\n<b>\t\t\tI GOT J.A.S. ID. SO DOES FRAN.\n</b>\n\tPeter\tRIGHT. AND WE'RE OUT HERE DOIN' TRAFFIC REPORTS?\n<b>\t\t\tWAKE UP, SUCKER. WE'RE THIEVES AND BAD GUYS IS\n</b><b>\t\t\tWHAT WE ARE. AND WE GOTTA FIND OUR OWN WAY!\n</b>\n\tThere is a long silence. The engine drones, but the helicopter\n\tstill sits on the ground. The men look at each other. Peter\n\ttakes a long slug of water.\n\n\tFran:\tJESUS CHRIST. WE DON'T EVEN KNOW WHERE WE'RE\n<b>\t\t\tGOING.  WE DON'T HAVE A RADIO.  WE'RE RUNNING\n</b><b>\t\t\tOUT OF WATER. WE NEED FOOD....STEPHEN,\n</b><b>\t\t\tYOU NEED TO SLEEP.\n</b>\n156\tWe see a wide shot of the little airfield. The J.A.S. chopper\n\tsits on the ground for a moment, it's props spinning. The, with\n\ta surge of power, it lifts off and flies away. The dry earth\n\tswirls up into clouds and blows more bits of paper over the\n\twide-eyed corpses which lie in the morning sunlight.\n\n157\tWe see the facade of an enormous structure. It is a huge,\n\tsuburban shopping mall. The outer walls are all concrete, and\n\ttheir clean lines stretch upward for more than two storeys. The\n\tbuilding looks like a giant domino lying flat on the ground.\n\tThere are only four entrances, and the shops which are housed\n\twithin have no windows opening onto the surrounding lot.\n\n158\tIn the immense area around the building, lanes and stalls are\n\tpainted for automobile parking. What few cars now dot the area\n\tare parked randomly, some with their doors open wide.\n\n159\tWe hear the sound of the helicopter engine fading in, then we\n\tsee the little machine as it approaches and eases down onto the\n\troof of the building.\n\n160\tIn the parking lot, walking among the abandoned vehicles, we see\n\tseveral of the living dead.  They look almost like normal\n\tshoppers at the mall for morning chores, but their lumbering\twalk is unmistakably stiff.\n161\tAt one of the mall entrances, we see a revolving door flanked\n\tby several regularly hinged doors, all made of glass and\n\tsurrounded by large windows. A few of the Zombies manage to\tnegotiate the hinged doors and enter the building. Others bounce\n\toff windows and claw the transparent glass in confusion. One\n\tcreature walks around in the revolving door endlessly.\n\n\tThere are a good many of the creatures, but they are spread out\n\tand far between. They move with no seeming purpose.\n\tWe do not yet see the mall interior.  The Zombies pay no\tattention to the sound of the chopper engine stopping overhead.\n\n162\tOn the roof, even as the blades of the helicopter still spin,\n\tthe humans are out and moving to the edge of the building. They\n\tlook down at the creatures which dot the parking lot.\n\n\tFran:\tOH MY GOD!\n\n\tStephen:\tNO CHANCE. FORGET IT, LET'S GET OUTTA HERE.\n\tRoger:\tWAIT A MINUTE, WAIT A MINUTE...THEY CAN'T\t\t\tGET UP HERE.\n\tSteve:\tYEAH, AND WE CAN'T GO DOWN THERE!\n\n\tRoger:\tLET'S CHECK IT OUT.\n\tRoger trots away.\n163\tPeter has moved directly to an area where a giant grid of\n\ttransparent Plexiglas bubbles face down into the building. He\n\tstares through one of them and can see into the mall below.\n\tRoger trots up and peers through another of the bubbles.\n\tPeter:\tMOST OF THE GATES ARE DOWN. I DON'T THINK\t\t\tTHEY CAN GET INTO THE STORES.164\tThe vantage point only reveals a small aspect of the interior,\n\ta square plaza with a garden beneath the sunroof of transparent\n\tbubbles. The space is open all the way down to the garden, which\n\tis two storeys below. Around the garden on the bottom floor can\n\tbe seen the entrances to several shops. All but one have heavy\n\tmetal cage gates down and locked into position.\n\tOne or two Zombies are seen wandering about. They cannot enter\n\tthe stores, except for the one which is un-gated.\n\n\tHalfway up the walls can be seen a balcony railing which rings\n\tthe entire plaza, it is a second storey of shops. The same cage-\n\tgates seal off the visible store entrances, but none of the dead\n\tcreatures are evident on the balcony.\n\n165\tFran and Stephen come trotting up to the bubbles.\n\n\tRoger:\tI HAVEN'T SEEN ANY OF THEM UP ON THE SECOND\n<b>\t\t\tFLOOR.\n</b>\n\tPeter:\tTHE BIG DEPARTMENT STORES USUALLY USE BOTH\n<b>\t\t\tFLOORS.\n</b>\n\tRoger:\tIF WE CAN GET IN UP TOP...\n\n166\tPeter is looking across the rest of the expansive rooftop. He\n\ttakes off toward a series of other housings which jut up out of\n\tthe otherwise flat surface. Roger follows.\n\n167\tFran:\t(still staring down through a bubble)\n<b>\t\t\tWHAT ARE THEY DOING?\n</b><b>\t\t\tWHY DO THEY COME HERE?\n</b>\n\tSteve:\t(also looking down)\n<b>\t\t\tSOME KIND OF INSTINCT. MEMORY...OF WHAT THEY\n</b><b>\t\t\tUSED TO DO. THIS WAS AN IMPORTANT PLACE IN\n</b><b>\t\t\tTHEIR LIVES.\n</b>\n168\tBelow, the Zombies which are in sight wander aimlessly over the\n\tplaza. Some try the gates but cannot budge them. One wanders out\n\tof the single open shop, it is a female. The shop is an\n\tappliance store. As the creature leaves she drags a toaster idly\n\tbehind her, pulling it by its power cable. It scrapes on the\n\tfloor loudly.\n\n169\tWe see an installation of large reflectors mounted in an\n\tintricate metal skeleton which stretches across a large area of\n\tthe roof surface.  Behind the structures can be seen a large\n\tpower generator.\n\n170\tPeter:\tSOLAR SCREENS.\n\n\tRoger:\tCAN'T BE ENOUGH TO POWER THIS PLACE.\n\n\tPeter:\tEMERGENCY SYSTEM, MAYBE.\n\n\tRoger:\tIT'S PRETTY LIT UP IN THERE.\n\n\tPeter:\tGUESS THE POWER'S NOT OFF IN THIS AREA.\n<b>\t\t\tA LOT OF PHILLY'S STILL LIT. COULD BE NUCLEAR.\n</b>\n171\tRoger:\tHEY LOOK AT THIS!\n\n\tRoger is peering down through a wire-hatched skylight. There are\n\tseveral laid out over this particular area of the roof. He moves\n\tto another while Peter looks down into the first. Fran and\n\tStephen jog up.\n\n\tRoger:\tTHESE DON'T GO DOWN INTO THE MALL.\n<b>\t\t\tWHAT THE HELL IS THIS?\n</b>\n\tFran and Stephen peer down into the darkness. Peter pulls a\n\tflashlight from his utility belt.  He has stayed in full uniform\n\tall the while, where Roger has stripped off all but his\n\tammunition belt and pistol holster.\n\n172\tThe big man shines a light beam down into the space. The floor\n\tis only seven feet or so below the window. There is absolutely\n\tnothing in sight; clear floor, clear walls, all light grey.\n\n\tPeter:\tDAMN.\n\n173\tRoger has moved to another window.\n\n\tRoger:\tHEY, OVER HERE. THERE'S SOMETHIN' HERE.\n\n174\tPeter trots over and shines his beam down. They see a vast\n\tarray of cardboard cartons...hundreds of them.\n\n\tRoger:\tSTORAGE?\n\n175\tPeter moves the light beam. Now it illuminates a collection of\n\tlarge drums, stacked floor to ceiling and running deep past the\n\tline of vision. On the face of each drum is the familiar symbol\n\tof a triangle within a circle, and the letters C.D.\n\n176\tPeter:\tCIVIL DEFENCE. CIVIL DEFENCE WATER SUPPLY.\n\n\tRoger:\tAND BOXES OF CANNED FOOD!\n\n\tSteve:\tHOW DO WE GET DOWN THERE?\n\n\tPeter looks at Stephen as a street-wise-tough would look at a\n\thopeless city-slick-sissy. Then the big man brings his rifle\n\tbutt down against the glass and the shattered pane crashes to\n\tthe floor below.\n\n177\tInside - the vast space is impressive. It is quite dark but for\n\trays of sunlight which drift through the occasional skylights.\n\tWe see an enormous quantity of food cartons and water drums, it\n\tis very quiet. The space is barren except for the stacks of\n\tCivil Defence supplies.\n\n178\tSuddenly, a figure drops out of one of the skylights, landing on\n\tits feet in the sunray. It is Peter.\tInstantly he readies his rifle, looking this way and that across\n\tthe large room. Silence.\n\n\tPeter:\tOK.\n\n\tHe steps aside and Roger climbs in. He too drops cat-like to the\n\tfloor.179\tThe two men instantly sling their rifles and move to the food\n\tcartons as by pre-arranged plan. They carry the big boxes\n\tquickly, one at a time, to the spot under the open skylight.\tIn a moment, they have built a pyramid out of the cartons. It\n\tcreates a kind of stairway for a quick escape through the window\n\tabove.\n\n180\tNow Fran lowers herself into the room and is able to climb down\n\tthe cartons holding onto Roger's hand. She is followed by an\n\tanxious Stephen.181\tPeter has already wandered off. There are only two doors in the\n\tenormous room, one at either end. The big Trooper moves up to\n\tone of them as Roger comes up behind him, gun ready.\tPeter's hand turns the doorknob. It is unlocked, and the big man\n\tgives Roger a familiar nod. Roger stands several feet back, his\n\trifle aimed directly at the door and ready to fire. Then, with a\n\tsudden, commando-like motion. Peter throws the door open and\n\tducks away flat against the wall. Roger stiffens, his finger all\n\tbut pulling his trigger, but there is no apparent danger.\n\n182\tThe door opens onto another vast room, equivalent to the one the\n\tpeople are in. It also has stacks of C.D. supplies.\n\n\tThe Troopers cautiously move into the area through the door. The\n\troom is empty. The same sunrays pierce the darkness through\n\tskylights. All is dead quiet. This room has no doors at all, but\n\tfor the one Peter opened.\n\tRoger:\tDOUBLE DAMN! LOOKS LIKE A FREE LUNCH, BUDDY.183\tIn the first room Stephen has started to rip open one of the\n\tcartons.\n\n\tFran:\tSPAM!\n\n\tRoger walks back into the room.\n\tRoger:\tYOU BRING A CAN OPENER?\n\n\tFran:\tOH.\n\n\tRoger:\tTHEN DON'T KNOCK SPAM. IT'S GOT IT'S OWN KEY.\n\n\tThe woman flips over the can in her hand and finds the little\n\tkey.\n\n\tPeter has walked right past the group.  He is moving quickly\n\ttoward the still-unknown door at the other end of the room.\n\tAgain, Roger follows.\n\n184\tAt the door, the two Troopers go through the same S.W.A.T.\n\tprocedure. The door swings open, this time onto a very small\n\tspace. Again no immediate danger.\n\n185\tAs the men enter, they discover that they are on the top landing\n\tof a concrete and metal firestair. There are no windows, and the\n\tair is musty. There is one bare light bulb lit in the ceiling,\n\tbut down the stairs at the next landing it is quite dark, and\n\tthere the stairs wind even further down; they recede into\n\tblackness.\n\n\tRoger:\tWHATD'YA THINK?\n\n\tThe Black man just stares, first down into the darkness then\n\tback into the storage area.\n\n\tRoger:\tTHIS IS THE ONLY WAY UP HERE. WHATD'YA THINK?\n<b>\t\t\tCUT.\n</b>\n186\tA great barricade of food cartons has been stacked against the\n\tstairway door.\n\n187\tNear the pyramid under the open skylight, the group of refugees\n\tsits on the floor.\n\n\tStephen is asleep. Fran sits next to his curled form, her hand\n\tin his hair. Roger leans against the pyramid and Peter sits in\n\tthe lotus position, his gun across his legs, squarely facing the\n\tsuspicious stairwell. He and Roger still pick at their food.\n\tRoger swills water from an empty Spam can which he has filled\n\tfrom one of the C.D. drums.\n\n\tRoger:\tYOU BETTER GET SOME SLEEP, TOO, BUDDY.\n\n\tPeter:\tTHERE'S AN AWFUL LOT OF STUFF DOWN THERE THAT\n<b>\t\t\tWE COULD USE, BROTHER.\n</b>\n\tRoger:\tI KNOW IT.\n\n\tFran stiffens at the talk.  She doesn't believe what she is\thearing. She knows instantly that the men will try to raid the\n\tmall.\tPeter:\tTHEY'RE PRETTY SPREAD OUT DOWN THERE.\n<b>\t\t\tIT'S A BIG PLACE. I THINK WE WOULD OUT-RUN 'EM.\n</b>\n\tRoger:\tHIT AND RUN.\n\n\tPeter:\tHIT AND RUN... MAYBE GRAB US OFF A RADIO...\n\n\tFran:\tYOU'RE CRAZY!\tRoger:\tTHIS PLACE COULD BE A GOLD MINE.\n<b>\t\t\tWE GOTTA AT LEAST CHECK IT OUT.\n</b>\n188\tRoger checks his weaponry and quickly moves toward the door\n\twhere he begins to remove the barricade of cartons. Peter still\n\tsits, checking his own guns.\n\n189\tFran:\tTHIS IS EXACTLY WHAT WE'RE TRYING TO GET AWAY\n<b>\t\t\tFROM...LOOK WHAT HAPPENED AT THE AIRPORT...\n</b>\n\tPeter:\tTHE ONLY PROBLEM AT THE AIRPORT WAS STRAY BULLETS!\n<b>\t\t\tWE COULD OUTFIGHT THOSE DUMMIES BLINDFOLDED.\n</b>\n\tFran:\tSTEPHEN...(the exhausted Pilot is sleeping through\n\t\t\t\tit all)\n\n\tPeter:\t(standing)\n<b>\t\t\tLEAVE HIM BE. WE'RE GOIN' OURSELVES.\n</b>\n\tThe big Trooper bends over snatching up Stephen's rifle. He\n\tsnaps off the safety and slams a shell into the chamber. He\n\thands it to the woman.\tPeter:\tTHAT'S READY TO SHOOT. BE CAREFUL.\n\tFran holds the gun gingerly.\tPeter:\tTHE TRIGGER SQUEEZES REAL EASY, BUT THE WEAPON'LL\n<b>\t\t\tKICK YOU GOOD WHEN IT FIRES. BE READY FOR THAT.\n</b>\n\tFran\t WAIT A MINUTE, I...\n\n\tPeter:\tANYONE BUT US COMES UP THEM STAIRS, YOU GUYS\n<b>\t\t\tTAKE OFF IN THE MACHINE. WE'LL TRY TO MAKE IT\n</b><b>\t\t\tOUT TO THE PARKIN' LOT. YOU CAN PICK US UP THERE.\n</b>\n\tFran just stares up at the big man, with desperation in her\n\teyes. She has stopped arguing seeing that the Troopers'\n\tdecision is made.\n\n\tPeter:\tIF WE DON'T SHOW UP AFTER A FEW MINUTES...\n\t\t\tWE'LL CATCH UP TO YOU SOME OTHER TIME.\t\t\tYOU UNDERSTAND?190\tIn the dimly lit firestair, the door on the top landing pulls\n\topen suddenly. The stairway is still empty.\tThe Troopers move slowly out onto the landing. They look down\n\tinto the darkness below. Then they move slowly and silently down\n\tthe steps. Fran appears on the upper landing. She stands in the\n\tdoorway clutching the rifle.\tPeter stops for a moment, looking back up at the frightened\n\twoman.\tPeter:\tYOU'LL PROB'LY HEAR SOME SHOOTING.\t\t\tJUST DON'T PANIC, OK.\n\n\tFran sighs exhaustedly.\n\n\tPeter:\tYOU'LL BE ALRIGHT. IT'S OUR ASSES THAT'S IN\n<b>\t\t\tTHE FIRE.\n</b>\n191\tTwo landings below, there is almost no light. Roger clicks on\n\this flashlight and shines the beam around. He is in a very small\n\tconcrete space. The stairs go down no further. There is only one\n\tdoor. Peter eases down the steps behind.\tRoger:\tTHIS IS THE ONLY WAY UP THERE.192\tWe see the other side of the metal door. It stands in another\n\tcement walled space, which also seems small from our angle, but\n\tit is fully lit.\tThe door opens slowly, and the Troopers cautiously step out. As\n\tthe camera swings around, we see that the men are at the end of\n\ta long narrow hallway. Directly across from them are two open\n\tsupply rooms, one containing a stationery sink and a toilet.\n\tBoth rooms are filled with cleaning supplies.193\tDown along the hall can be seen a dozen or so doorways. Some\n\tdoors are open, some are closed. Along the opposite wall there\n\tis nothing.\tThe far end of the hall, about a hundred yards away, opens out\n\tonto the second story of the mall proper.194\tThe men look at one another and slowly move down the corridor.\n\tThey try the first two doors, which are locked. The third is\n\twide open.\n195\tRoger ducks quickly into the room with his rifle raised. It is\n\ta large administrative office, with rows of desks which are\n\tfully equipped for a staff of secretaries and accountants.196\tThe next room has a closed door, but it is unlocked. Peter\tswings the door open and silently jumps into the room. This is\n\ta much more spartan area, with two metal desks and a few chairs.\n\tThere are several phones. It is a maintenance office. On one\n\twall is a large map of the mall, with pin flags and scribbling\n\tover an acetate which covers the drawing. At the other end of\n\tthe space is a huge electrical panel with circuit breakers and\n\tan entire series of master controls all keyed by a number code\n\tto another map of the mall showing electrical installations.\tOn the wall behind Peter is a large blackboard and two metal\n\tcabinets. One is open. It contains all sorts of tools, manual\n\tand electric. There are circuit testers, walkie talkie units and\n\tthere are several enormous rings containing hundreds of keys,\n\talso colour and number coded. Peter grabs up one of the rings\n\tand Roger steps up behind him.\tRoger:\tTHE KEYS TO THE KINGDOM.197\tBack in the hallway, Roger's hand tries another doorknob and\tthrows the door open. This opens onto beautifully plush offices,\n\tobviously the executive headquarters.\tThe rooms interconnect, and while Peter walks from door to door\n\tin the corridor, Roger moves through the inner doors, meeting\n\tPeter at each room. One office is more elegant than the next,\n\twith the latest in designer furniture and expensive decorations.198\tThe Troopers finally reach a room on which both the interior and\n\tcorridor doors are closed and locked. The brass nameplate on the\n\tinterior door reads C.J. Porter - President.199\tRoger moves out to the corridor where he joins Peter. They move\n\tinto the exterior corridor. They are very near the end of the\n\thall, and the brightly lit shopping area is close at hand. They\n\tcan only see a small section.200\tThe balcony on their side is railed off against the open drop\n\tdown to the first floor, and across the great cavity they see\n\tthe opposite balcony. On the far side only two store fronts can\n\tbe seen. They are both gated and shut.\n201\tThe two realise what dangers might face them in the mall proper.\n\tThey look at each other and move forward, each clinging to\n\topposite walls in the corridor.202\tAs they reach the mall proper they slowly and carefully peer\n\taround their respective corners.\n\n203\tThe upper balcony totally surrounds the vast interior of the\n\tbuilding, and at several points bridges across from one side to\n\tthe other. Little shops of all types run along the entire length\n\tof the balcony, and at each far end, stands the entrance arches\n\tfor a large department store.\tMost of the stores are gated, but several seem open. The big\n\tdepartment stores are gated and locked. Here and there tall\n\ttrees grow up from the ground floor and reach up into view of\n\tthe second storey. There are none of the living dead evident on\n\tthe balcony.204\tThe two troopers move slowly and quietly to the railing. The\n\tcrouch and peer down through the bars of the rail. Below, the\n\tsight is even more spectacular.205\tStores of every type offer gaudy displays of consumer items.\tEverything from clothing to appliances. Photo equipment; audio\n\tand video outlets; sporting goods and weaponry; gourmet foods\n\tand natural organic foods. There is a Book Store, a Record\n\tStore, a Real Estate Agency and a Bank; A Novelty Shop, a Gift\n\tShop; all with the absolute latest in American consumer items.\n\tAnd at either end of the concourse like the main Altars at each\n\tend of a Cathedral, stand the mammoth two storey Department\n\tStores; great symbols of a consumer society.\n\tDown the centre of the ground floor, along with the gardens and\n\tpark benches, are little stalls. One is a Tobacco Specialist\n\tanother Jewellery; another is a small Photo Portrait stall where\n\tmothers had their children photographed. There are restaurants\n\tand Snack Bars and numerous coin operated machines selling\n\teverything from children's toys to Blood Pressure readings.\n\tThere is a large turntable, designed to spin but which is now\n\tstill, holding a late model car on exhibit. Another turntable\n\tdisplays futuristic household appliances.\tThe images are all too familiar, but in their present state they\n\tappear as an archaeological discovery revealing the Gods and\n\tCustoms of a civilisation now gone.\n\n\tThe ghosts of a civilisation, however, are not figments in the\n\tmind. They are quite real. And they walk below in the aisles of\n\tthe great Cathedral. At least twenty Zombies can be seen from\n\tthe Troopers' perspective.\n\n206\tRoger:\tIT'S CHRISTMASTIME DOWN THERE, BUDDY.\n\tPeter:\tFAT CITY, BROTHER. HOW WE GONNA WORK IT.\tRoger:\tWE GET INTO THE DEPARTMENT STORES UP HERE.\t\t\tTHEY PROB'LY HAVE THEIR OWN ESCALATORS INSIDE.\n\n\tPeter:\tLET'S CHECK THOSE KEYS.\n\n207\tThe Troopers stealthily pull away from the railing and back into\n\tthe administrative corridor. Then they move quickly down the\n\thall toward the Maintenance Office.\n\n208\tAs the men leave the balcony, the camera pans. Several yards\n\taway a Zombie staggers out of one of the open stores. It is\n\tfollowed by a second creature, a female without one arm. They\tare moving along the balcony toward the open corridor.\n\n209\tIn the Maintenance Office, the Troopers are checking the keys\n\tagainst the coded map on the wall.\n\n\tRoger:\tSEVENTY TWO...U. AND D. ...HERE IT IS...\n\n\tThe men check the keys. Peter finds corresponding numbers.\n\n\tPeter:\tHERE.\n\tRoger:\tLET'S JUST HOPE IT'S RIGHT.\tPeter:\tLOOK HERE (on the map) THESE NUMBERS MUST ALL\n\t\t\tBE LOCKS (he points) FRONT...SIDE...BACK OUTSIDE,\n<b>\t\t\tMUST BE LIKE LOADING DOCKS...BUT WHAT ARE THESE?\n</b>\n\tThe man points to several numbered spots which seem to be within\n\tthe big Department Store they are studying.\tRoger:\tWASHROOMS...EQUIPMENT...I DUNNO.\tRoger moves off toward the electrical control panel. Peter still\n\tstares at the map.\tPeter:\tI GUESS THESE GOTTA BE THE GATES.\n\tRoger:\tHOW ABOUT A LITTLE MUSIC?\n\tPeter:\tWHAT?210\tThe big Black moves up behind his partner. One of the controls\n\ton the panel is marked: MUSIC TAPE. It indicates a master switch\n\twhich is in the off position. Another is marked FLOOR EXHIBITS\n\tand a series of others are marked ESCALATORS. There are dozens\n\tof master switches which are in the off mode.\n\tPeter:\tPOWER SWITCHES.\n\tRoger:\tTHE MUSIC MIGHT COVER THE NOISE WE MAKE.\tPeter:\tHIT 'EM ALL. MIGHT AS WELL HAVE POWER IN\t\t\tEVERYTHING. WE MIGHT NEED IT.\n\n\tRoger hits the switches one at a time.\n\n211\tThroughout the mall, we hear the drone of the dull, mass\n\tproduced music designed to lull a shopper's brain.212\tUpstairs, Francine startles at the sound from below. She snaps\n\tthe rifle into her hands, ready to fire. She has been standing\n\tjust inside the storage area. She steps into the firestair and\n\tlooks down into the darkness. The sounds of the insipid music\n\tdrift up to her. She leans into the storage area again.\n\n\tFran:\tSTEPHEN...\n<b>\t\t\tSTEPHEN!\n</b>\n213\tSteve, still lying on the floor against the escape pyramid,\n\tslowly awakens.214\tDown on the first floor of the big mall, things begin to work.\n\tThe automobile turntable starts spinning; the great escalators\n\tmove up and sown. Two of the living dead, caught just starting\n\tup two stalled escalator, fall and roll down as the mechanical\n\tsteps begin moving.\n\n\tLights blink on the exhibits, and mechanical window displays\n\tbegin their robot-like motions. It is like a Carnival coming\n\talive. The Zombies which wander the floor look about in\n\tconfusion. Some of them swat ineffectively at the moving\n\texhibits.215\tIn a very tall cage, which reaches from the first floor all the\n\tway to the ceiling, the Tropical Birds which are housed within\n\tbegin to flutter and squawk.216\tIn a pet shop, there are puppies and kittens in a window\n\tdisplay. They whine and scramble over one another in fright at\n\tthe noise and the motion and the coloured lights.217\tOn one of the floor exhibits, a rear-projection movie starts. It\n\tis a dryly produced film about the merits of a Real Estate\n\tDeveloper's new tract of suburban houses. A narrator speaks in a\n\tfriendly voice:\n\t\t\t... and for prices which anyone can afford,\t\t\tyou can live in these luxurious new homes\n\t\t\tby Brandon. Fully electric, central air, ..etc.\n\n218\tIn the Maintenance Office, the Troopers ready themselves for\n\ttheir raid. Peter secures the vital key ring to his utility\tbelt and the move out.\n\n\tPeter and Roger move down the Hall and exit through door to\n\texterior corridor.\n\n219\tJust as Roger moves through the door into the corridor, he is\n\tconfronted by the Zombies from the balcony. He startles and\n\tducks back into the room. The closest Zombie is reaching out\n\twith clutching hands. Peter raises his gun and fires two shots\n\tcleanly through the creature's head.220\tAs the shots ring through the area, Fran, standing at the top of\n\tthe firestair, startles. Steve grabs the rifle from the woman.\n\n\tSteve:\tJESUS CHRIST...\n<b>\t\t\tTHEY'RE MANIACS.\n</b>\n221\tThe Troopers step over the corpse. The second Zombie, the\n\tarm less female, is walking toward them. This time Roger fires\n\this weapon. The creature falls in a heap.\tRoger:\tWHATD'YA THINK? BAG IT OR TRY FOR IT?\n\tPeter:\tYOU GAME?\tRoger nods and the two men run down the hall toward the mall.\tTheir rifles poised, they are like commandos on an important\n\tmission.\n\n\tThe men at the mall mouth see the department store and start for\n\tit. They run from the corridor onto the balcony.222\tThe battle to win the mall has begun. The creatures which wander\n\tthe first floor look about, attracted by the sound, but they are\n\tconfused. They walk this way and that, in mis-guided staggering\n\tstrides.223\tSeveral of the Zombies try to move up the down-escalator. They\n\tfall over themselves and cannot negotiate the moving stairway.224\tA few creatures who move onto the up-escalator also fall against\n\teach other from the movement, but one falls onto the moving\n\tsteps and is carried upward. Then another manages to keep its\n\tbalance holding on to the hand rail.\n225\tAt another point down the length of the mall, there is a\n\tstationary stairway which runs from the first to the second\tfloor. Several creatures move up the steps.\n\n226\tAt the top of the firestair, Stephen begins to move down the\n\tsteps cautiously. His rifle is at the ready. Fran stays on the\n\ttop landing.\tFran:\tSTEPHEN, DON'T GO DOWN THERE.\t\t\t(he continues)\n<b>\t\t\tSTEPHEN PLEASE!\n</b>\n\tSteve:\tIT'S ALRIGHT.\n\n227\tAt the huge gate which locks off the big Department Store,\n\tthe two Troopers come to a crashing stop.\n\n228\tThere is a side concourse which can be seen from this vantage\n\tpoint, and in the hall are four or five Zombies. They are about\n\tthree hundred feet away.\n\n229\tRoger keeps his rifle levelled off in the direction of the\n\tcreatures while Peter confronts the lock at the middle of the\n\tbig roll gate.\tHe fumbles with the keys for a moment until he finally sinks\tthe proper key into the receptacle which is right at the floor.\tThe tumblers turn successfully.\tPeter:\tALRIGHT!\n\n230\tOn the escalator, the creatures which fell onto the moving steps\n\tare being carried up to the balcony. The one supporting himself\n\ton the hand rail is still standing. The head of the standing\n\tZombie suddenly becomes visible from Roger's perspective.\n\n231\tThe Trooper raises his gun and aims for the creature's forehead.\n\n\tPeter tries to life the roll gate. It won't move. It is still\n\tlocked.\tPeter:\tYOU BASTARD!\n\tRoger:\tWHAT?\n\n\tPeter:\tSTILL LOCKED...(he sees another assembly)\n<b>\t\t\tON THE SIDE...\n</b>\n\tThe big man moves to the far side of the gate. The same key\n\tfits. Roger re-focuses on the creature which is riding the\n\tescalator. It is quite near the top now. Roger is about to\n\tshoot when something catches his eye.\n\n232\tThe fallen Zombies, which up to now could not be seen behind the\tescalator rail wall, suddenly come tumbling out onto the balcony\n\tfloor.233\tRoger fires, but his aim is inaccurate.234\tHe hits the standing Zombie in the neck. The creature is thrown\toff balance enough to lose its footing. It falls back down the\n\tescalator, but before it reaches the bottom, it stops rolling.\n\tThe steps carry it back up toward the second floor again. It is\n\tstill very much alive. The two creatures on the balcony struggle\n\tto stand.235\tRoger looks back over his shoulder.236\tThe Zombies from the side concourse are now about a hundred and\n\tfifty feet away.\n\n237\tPeter turns the key in the lock, but again the gate will not\n\tlift. It moves slightly, as the middle mechanism and the one on\n\tthe far right are free, but there is a third lock on the far\n\tleft. Peter moves to it quickly.238\tOn the first floor concourse, other creatures are beginning to\ttake note of the action upstairs. They start to move.239\tThe Zombies on the stationary stairway are beginning to reach\n\tthe second floor, but they are far down the main balcony. They\n\twill have to pass the administrative corridor in order to reach\n\tthe Department Store.\n\n240\tRoger fires again.\n\n241\tOne of the nearby Zombies falls in a heap.\n\n242\tAt the sound of the rifle, Fran gets desperate.\n\n\tFran:\tSTEPHEN...FOR GOD'S SAKE...LET'S GET UP ON THE\n\t\t\tROOF...243\tSteve is at the middle landing. He stares down into the darkness\n\tbelow. More gunfire can be heard from the mall.\n\n\tSteve:\tIT'S ALRIGHT, I'M TELLIN 'YA. THOSE THINGS\t\t\tDON'T MOVE FAST ENOUGH TO CATCH US.\tMore gunfire can be heard.244\tNow the giant gate rolls up with a loud rumble. Peter ducks into\n\tthe store even as the gate is still rising, but the inertia of\n\tthe great metal cage carries the lip up out of Peter's grasp. He\n\tjumps to try to catch it, but he misses. It jerks up into its\n\tfully open position and rolls back down slightly, but still\n\tPeter cannot reach the lip. It slides back to rest about three\n\tfeet above Peter's fingertips.245\tThe Zombies advance.246\tRoger drops another with a clean shot through the head, then he\n\tbacks into the archway of the Department Store entrance. Peter\n\tis desperately looking around for something to stand on to reach\n\tthe gate.247\tThe Zombies are very close to the arch now, advancing steadily.\n\n248\tPeter grabs a small counter used to display shoes, but it is too\n\theavy for him to move himself.\n\n\tPeter:\tHERE...COME ON...\n\n\tRoger has to abandon his post at the arch long enough to help\n\tdrag the little counter. The men drag it to a point just at the\n\tside of the open arch, and Peter instantly jumps up on the top\n\tof it. At that instant, a Zombie rounds the corner and grabs at\n\tPeter's legs. The big man kicks, startled, and the motion causes\n\thim to fall off the little counter. He lands on his feet, but\n\tout on the balcony beyond the arch. Roger brings his rifle butt\n\taround against the creature's head and the Zombie falls back,\n\tbut is not dead.\n\n\tOther creatures are only a few feet from Peter, whose gun sits\n\ton the little counter inside the store. Roger levels off his\n\trifle but cannot fire as Peter is in the line. Peter makes a\n\tmove and, like a football player, jukes to the left, then to the\n\tright. He dives right at one of the creatures carrying it into\n\tthe store.\tNow Roger fires, dropping one, then another. Peter jumps back up\ton the counter.\tPeter:\tBEHIND YOU...BEHIND YOU...\n\n\tThe creature in the store has crashed against a cosmetics\n\tdisplay and is regaining its footing. Roger turns and fires. The\tcreature falls. Peter grabs the lip of the roll gate and starts\n\tto bring it down.\n\n\tThere are several creatures right in the archway, now they\n\tclutch with their hands. One blocks the downward progress of the\tgate. Roger fires point blank and the Zombie flies back. The\n\tgate lowers but is stopped by the clutching hands of other\n\tcreatures. Roger grabs the cage now and helps to pull it down.\n\tPeter, still gripping the lip, jumps off the counter to get more\n\tleverage.\tThe bottom of the gate is now four feet from the floor. The two\n\tmen are able to move it steadily downward. The Zombies are very\n\tweak, but more creatures appear making it more difficult. Then\n\tone Zombie tries to crawl under the gate. Its torso just gets\n\tthrough as the gate slams down against its chest. Its arms grab\n\tfor Peter's legs and its mouth is gasping. Its body is\n\tpreventing the gate from engaging in the floor mechanisms.\tRoger lets go the cage as Peter tries to hold it against the\n\tcreatures outside. Grabbing his rifle, Roger brings the butt\n\tstraight down on the clutching Zombie's skull. The Zombie goes\n\tlimp. Then Roger tries to push the creature clear of the gate,\n\tbut the pressure is too great.\n\tRoger:\tLET UP A LITTLE...LET UP A LITTLE...\n\n\tThe gate rises a few inches. More Zombies appear outside. Their\n\thands clutch at the roll gate. The openings in the grid are only\n\tbig enough for their fingers, their hands can't reach through,\n\tbut they are pushing the gate higher and higher...more than\n\tPeter intended to clear the obstructing corpse.\tWith his rifle butt, Roger manages to push the dead Zombie clear\n\texcept for one of its arms. From outside, a creature's hand\n\tsuddenly grabs Roger's weapon. For a moment its like a Tug-O-War.\n\tPeter is having a harder time holding the gate. It is inching\n\tupward.\tPeter:\tCOME ON...COME ON...\tRoger lets go his gun barrel and the weapon is snatched away by\n\tthe creature in the crowd. Roger grabs for the gate.\tPeter:\tTHE ARM...THAT ARM'S IN THE WAY.\tRoger squats again and manages to throw the dead Zombie's arm\tclear. Then he grabs the gate again. Now it starts to move down\n\tmore steadily.\tAt the last moment, another clutching arm juts into the store,\n\tbut when the gate hits it, it withdraws, and the big cage clicks\n\tsolidly into place.\n\n\tThe two Troopers step back from the gate. The creatures still\n\tmoan and gurgle, slamming against the gate, their fingers\n\tclutching at the grid, but they are unable to budge it.\n\tThere are ten or twelve Zombies trying to get into the\n\tDepartment Store and several others are making their way along\n\tthe balcony. At least six lie dead along the floor.\tRoger:\tWELL...WE'RE IN...NOW, HOW THE HELL WE GONNA\t\t\tGET BACK?\tPeter:\tLET'S GO SHOPPIN' FIRST.\n\n\tThe two men back into the aisles of the store. The creatures\n\toutside still push and claw at the gate. The one with Roger's\n\trifle uses it as a bludgeon, but it has no effect.\n\n249\tStephen opens the door into the Administration corridor.\n\n250\tFrom his perspective, the hall is inactive. He observes the\n\twashrooms and the long row of doors to the various offices.\n\n251\tHe starts into the corridor, letting the firestair door close.\n\n252\tAt the top of the firestair, Fran can see the beam of light from\n\tthe open door below. As the door closes, the beam narrows, then\n\tit blinks out with a click as the door closes.\tFran:\tSTEPHEN...JESUS GOD...\n\n\tShe is very frightened.  She backs into the storage area.253\tShe moves quickly to the pyramid of cartons which lead to the\troof. She sits on the bottom carton biting her fingers.254\tIn the Department Store, Roger is riding down an escalator. He\n\thas found a back pack, and it is obviously already filled with\n\tgoods. As he steps off the moving stairs on the ground floor,\n\tthe surroundings are eerily quiet.255\tHe moves through a clothing department. We see the dead looking\n\tfaces of store mannequins. Roger runs into one and is greatly\n\tstartled. He snatches up a lined windbreaker and ties it around\n\this waist by its arms, then he trots off down another aisle,\n\twhere he finds Peter.\n\n256\tThe big Trooper has a radio under his arm and he is snatching up\n\ta small television.\n\n\tRoger:\tHEY MAN, WE CAN'T CARRY ALL THIS SHIT...\n\n257\tPeter turns a corner and dumps the articles into something\n\twhich we cannot yet see. As Roger trots up, he sees that Peter\n\thas a big gardening cart already heaped with goods.\n\tRoger:\tOH...WE'RE GONNA JUST WHEEL RIGHT BY 'EM, RIGHT?\tPeter:\tWE GONNA TRY, BROTHER. WE AIN'T DOIN' THIS\n<b>\t\t\tFOR THE EXERCISE. WE MIGHT AS WELL TRY TO\n</b><b>\t\t\tGET WHAT WE CAN.\n</b>\n\tRoger:\tTHERE'S NO WAY THIS IS GONNA HAPPEN...\n\n\tEven though he doesn't understand the plan, Roger helps Peter\n\ttoss things into the barrow.\n\n258\tThey race down the hardware aisle tossing in tools and other\n\tsupplies. Electrical cables, flashlights, batteries. They scoop\n\tthings up like contestants on a game-show who have five minutes\n\tin a store to grab whatever they can.259\tStephen is in the Maintenance office. He examines the maps and\telectrical equipment, then rummages through a desk.260\tAt the open end of the corridor leading to the second storey\n\tbalcony, Zombies wander past as they head for the Store entrance\n\twhere many creature still claw at the roll gate.261\tThe Zombies move randomly. Some are leaving the gate as their\tprey is now out of sight. They begin to wander here and there.\n\n262\tThree of the creatures turn into the administrative corridor and\n\tstart toward the offices.\n\n263\tStephen has found a large binder in the desk. It contains all\n\tthe plans for the mall, duplicating the charts on the walls and\n\tmany others. It is a complete maintenance manual revealing all\n\tthe workings and layout of the huge structure.264\tElevator doors slide open with a loud whoosh. The two Troopers\n\tappear in the car, wheeling their barrow out onto the second\n\tstorey aisles of the big store.265\tNow, they can see the roll gate and the creatures pushing at it\n\tineffectively. They roll their barrow very close to the gate.\n\tWhen the Zombies catch sight of the humans, their efforts are\n\trenewed. They moan and push harder at the gate.266\tThey Troopers leave the barrow, disappearing back to the aisles.\tThey run onto the interior escalator, bounding down faster than\n\tthe moving steps, then they run across the first floor until\n\tthey see the lower level-roll gate.267\tThere are creatures wandering the concourse, but none of them\tare at the gate.\tPeter:\tLET'S GO BROTHER...THE OLD OKEY DOKE!\n\n\tThe men move up to the roll gate. A Zombie lumbers past. Roger\n\tspeaks to the creature.\n\n\tRoger:\tHEY, UGLY!\n\n\tThe creature turns instantly. Registers. Then dives for the\n\tgate with a moaning roar. Its mouth opens and its hands clutch.\n\tThe gate pops forward from the creature's thrust, but it holds\n\ttightly. The action causes Roger to jump even though there is no\n\timmediate danger.\tPeter:\tLET'S RAISE SOME HELL...HEY...HEY...\n\t\t\t(he is shouting)\n\n\tRoger:\tOVER HERE...LET'S GO OVER HERE...\n\n268\tOther creatures along the concourse turn toward the Department\n\tStore. They lumber along attracted by the sounds.\n\n269\tAt the gate, several Zombies push at the metal grids. The\n\tTroopers back away, but stay in sight of the creatures.\n\n\tPeter:\tJUST GIVE IT TIME ...GIVE IT TIME.\n\n270\tUpstairs, the Zombies at the upper gate are attracted by the\n\tcommotion below. They begin to move away from the gate and\n\tlumber along the balcony to the stairways and escalators.\n\n271\tIn the maintenance office, Stephen still rummages. He finds a\n\tloaded hand gun and stuffs it in his belt. He moves to the large\n\tcabinets containing the walkie talkies and the keys.272\tIn the corridor, the stray Zombies move in and out of the\n\texecutive offices as they draw nearer to the Maintenance room.273\tSeveral creatures fall over one another as they try to move down\n\tthe up escalator. The down escalator push others onto the first\n\tfloor. They scramble to their feet and move toward the\n\tDepartment Store.\n274\tIn the concourse, many creatures are moving toward the gate.\n\tAlready there are a dozen or so clutching and pushing at the\n\tmetal grid. Through the crowd. Peter can see several other\n\tcreatures lumbering down the stationary steps.\n\n275\tPeter:\tOK...THEY 'RE COMIN'...\n\n\tThe big man readies his walkie talkie, pulling the antenna out.\tPeter:\tGO ON UP...STAY OUTTA SIGHT BUT LEMME KNOW\t\t\tWHEN ITS CLEAR ENOUGH.\tRoger, clutching his walkie talkie, disappears among the aisles\n\tas he runs, crouching, into the store. Peter tries to hold the\n\tattention of the creatures at the gate.\tPeter:\tRIGHT HERE, BABIES...THIS IS WHERE IT'S AT...\n<b>\t\t\tYOU DUMB ASS SUCKERS...YOU DUMB...YOU ARE DUMB!\n</b>\n276\tUpstairs, the doors to the elevator glide open again and Roger\n\tmoves through the second floor aisles stealthily.277\tStephen takes the maintenance manual and leaves the office. He\n\twalks down the interior corridor and opens the door to the\n\texterior corridor. As the door opens, the Zombies attack. The\n\tZombies clutch as Stephen tries to close the door on Zombie 13's\n\tarm. Stephen then runs back down the interior corridor.\n\n278\tStephen starts up the firestair to the door. Just then he hears\n\tFran call out. Realising he will lead the creatures to her, he\n\tcloses the door and moves toward the Maintenance office and runs\n\tin.\n\n279\tStephen runs into the office and slams the door.\n\n280\tA second creature is moving up behind the first, and another\n\tenters the corridor from the accounting office.\n\n281\tThe metal door locks only with a key. Stephen fumbles for a\n\tmoment with his rifle, then dives for the key cabinet. There are\n\thundreds of keys on rings. He looks at the wall map. He can't\n\tfocus in his panic.\n\n282\tIn the hall, the first creature slams against the floor. It\n\tdoesn't even have the intelligence to reach for the knob. It\n\tpounds on the door with its hands.\n\n283\tThe pounding increases Stephen's panic. He stares at the map\n\ttrying to focus on the maze of numbers.\n\n284\tThe second creature reaches the door and claws at it. The third\n\tapproaches slowly.\n\n285\tStephen rattles among the keys. His fingers shake and he cannot\n\tdecipher the numbers.\n\n286\tOutside, one of the creatures, in its random clutching, takes\n\thold of the knob and pushes in and out, not yet turning it.\n\n287\tStephen, clutching one of the rings, throws himself against the\n\tdoor, still trying to read the numbers. The knob finally turns.\n\tThe door opens against Stephen's weight. He manages to slam it\n\tshut despite the pushing creatures. He throws the key ring down\n\tand grabs his gun.\n\n288\tRoger speaks into his walkie talkie:\n\n\tRoger:\tI THINK WE CAN MOVE THE WAGON.\n\n289\tPeter, downstairs, talks into his unit:\n\n\tPeter:\tCLEAR?\n\n\tRoger:\t(over talking unit)\n<b>\t\t\tNOT ALTOGETHER, BUT THEY'RE SPREAD OUT PRETTY\n</b><b>\t\t\tGOOD...ENOUGH TO MOVE THE WAGON.\n</b>\n\tThe creatures slam against the first floor gate, but it holds\n\tsecurely. Peter stares at the beasts as he lowers his talk\n\tunit. He backs slowly away into the depths of the store.\n\n290\tUpstairs, Roger peers from behind a counter.\n\n291\tThe second floor gate is clear.\n\n292\tOn the balcony, several creatures wander aimlessly, but most of\n\tthem have already moved down the steps and escalators.\n\n293\tPeter is still in sight of the Zombies at the first floor\n\tentrance. He clips his talk unit onto his belt, then ducks and\n\tdisappears among the aisles.\n\n294\tHe runs, crouching out of sight, until he rounds a far wall\n\tand comes up into the elevator.\n\n295\tHe enters the car and pushes \"2\". The doors glide shut and the\n\tcar begins to move up.\n\n296\tAt the door of the Maintenance Office, the knob turns again. The\n\tdoor pushes open against Stephen weight. His feet slide on the\n\tlinoleum floor. He cannot get the door closed this time. Biting\n\this lip, he makes the sign of the cross, and backs suddenly into\n\tthe room holding his rifle high. The door flies open with a\n\tslam, and three Zombies advance into the office. Stephen tries\n\tto aim carefully, and he fires.\n\n297\tJust as the elevator doors open. Peter hears the gunfire. He\n\thesitates for a moment, then runs toward the entrance arch.\n\n298\tRoger is poised at one of the side locks on the gate. The\n\tgunfire stops him also as he is unlocking the mechanism.\n\n299\tAlong the balcony, some of the creatures turn around in con-\n\tfusion. They walk this way and that, attracted  by the sound.\n\n300\tPeter thunders up behind Roger.\n\n\tPeter:\tWHAT THE HELL IS THAT?\n\n\tRoger:\tFUZZ MAYBE?\n\n\tPeter:\tOR MAYBE FLYBOY. WHERE'S IT COMIN' FROM?\n\n\tRoger:\tCAN'T TELL.\n\n\tPeter:\tCOME ON. OPEN UP.\n\n\tRoger :\t MAYBE WE SHOULD SEE WHAT'S HAPPENIN'...\n\n\tPeter:\tOPEN UP. I CAN GET THE WAGON OVER. IF IT\n<b>\t\t\tIS FLYBOY, LET'S GET HIM ON OUR SIDE.\n</b>\n\tRoger moves to the second lock. More gunfire.\n\n\tPeter:\t(setting his weapon on the floor)\n<b>\t\t\tYOU JUST COVER ME GOOD, YOU HEAR?\n</b>\n\tRoger moves to the third lock as Peter stands and grabs on to\n\tthe handles of the barrow.\n\n301\tThe body of a dead Zombie hits the floor, its head shot\n\tthrough. Nearby lies the corpse of the first creature to break\n\tinto the Maintenance Office.\n\n\tThe third staggers into the room. Stephen stands fast now. He\n\tholds his rifle out in front of him. The creature walks toward\n\tthe gun. Steve holds his hands on the trigger. The Zombie lunges\n\tsuddenly, and grabs the gun barrel. Steve fires, but the blast\n\ttears through the creature's chest. Steve struggles to raise the\n\tbarrel but the motion of the Zombie makes it impossible to aim\n\taccurately. The gun fires again, this time grazing the Zombie's\n\tneck. With a sudden burst of energy the creature wrenches the\n\tgun free. Steve backs against the wall. The creature tosses the\n\trifle across the room where it slams the floor near a desk. The\n\tZombie advances on Steve. Steve is next to the key cabinet and\n\tgrabs at it, trying to find some weapon. He feels the tools in\n\tthe cabinet and comes up with a hammer. The Zombie is about to\n\treach him when Steve pulls the hammer out and upsets the\n\tcabinet. The Zombie fumbles with the cabinet at its feet, but\n\tdoesn't fall. Steve tries to hit the creature's head with the\n\ttool, he misses and the Zombie grabs at his arm, trying to bite\n\tit. Steve wrenches free and the two bodies fall to the floor.\n\tThe creature clutches at the man's legs, it's teeth bared like\n\tan animal. Steve kicks desperately and manages to land a blow\n\tsquarely in the creatures face. The Zombie comes after him again\n\tand from his crawling position, Steve brings the hammer as an\n\tuppercut to the creature's jaw. The creature falls back enough\n\tfor Steve to crawl across the floor. It follows, but Steve\n\treaches the desk and grabs his rifle. Rolling on the floor, he\n\tfires several shots into the creature, finally destroying it.\n\n302\tThe second floor gate rolls up with a rumble and Peter runs out\n\tof the Department Store with the barrow full of supplies.\n\n303\tThe action attracts the attention of several of the creatures\n\twhich are still wandering the balcony. They turn slowly.\n\n304\tJust as he rounds the corner. Peter almost collides with one\n\tcreature, and can barely keep from upsetting the barrow. He\n\tmanages to get past, and he runs as fast as he can toward the\n\topening of the Administrative corridor.\n\n305\tRoger does not let the gate roll up too high. He stabilises the\n\tmetal grid well within reach, then he stands his post with\n\tPeter's rifle. Several creatures approach from the opposite\n\tdirection. Roger fires at the closest one. It falls. The others\n\tare still too far away to waste bullets.\n\n306\tStephen steps over the corpses in the office and grabs the\n\tmaintenance manual. He rushes into the corridor and runs out.\n\n307\tThree more creatures move toward him up the hallway.\n\n308\tAt first Stephen freezes, then he starts backing toward the\n\tfirestair, his rifle poised.\n\n309\tJust as Peter is reaching the mouth of the corridor, a Zombie\tsteps out of the hallway into his path. Peter slams the barrow\n\tsquarely into the creature's legs. The Zombie falls in the\n\tbarrow onto the supplies. The big man slams the load against a\n\twall at the mouth of the corridor. Before the Zombie can get its\n\tbalance, the big Trooper reaches down and grabs the creature's\n\tjacket lapels. With all his might he flings the creature out\n\tagainst the balcony railing. The creature flips over the rail,\n\tbut does not fall. Its arms and legs flailing as Peter comes up\n\tquickly behind and flips it over the rail. The creature makes no\n\tsound as it plummets to the concourse below.310\tRoger fires again at a Zombie drawing dangerously near. Other\tcreatures throughout the area are again converging on the\n\tDepartment Store entrance.311\tPeter wheels the barrow into the corridor and sees Steve at the\tother end, the three Zombies are still closing in.\tPeter:\tHOLD IT FLYBOY!312\tSteve freezes. He can barely see Peter, his vision blocked by\n\tthe Zombies. The creatures are about thirty feet away.313\tPeter:\tDON'T GO INTO THE STAIRWAY!314\tStephen is confused. The creatures advance.315\tPeter:\tDON'T OPEN THAT DOOR, BABY. YOU'LL LEAD 'EM\n<b>\t\t\tRIGHT UP WITH YOU.\n</b>\n316\tSteve is on the verge of panic.\n\n\tPeter:\tRUN FOR IT.  RUN THIS WAY.\n\tThe Zombies are drawing closer and closer.317\tPeter:\tCOME ON, MAN. RUN THIS WAY. YOU CAN RUN RIGHT\n<b>\t\t\tTHROUGH 'EM. WE GOTTA LEAD 'EM AWAY FROM HERE!\n</b>\n318\tSteve sizes up the corridor. It is narrow, but there is room to\n\trun past the Zombies.\n\n319\tPeter:\tCOME ON, FLYBOY. YOU CAN MAKE IT. COME ON!\n\n320\tWith a sudden move, Steve breaks into a run. He passes the first\tcreature easily. The second grabs him as he runs past, but the\n\tman keeps his footing even though he slams against the wall. He\n\tkeeps moving forward. The third creatures stands in his path.\n\tSteve lowers his head and slams into the Zombie's chest. The\n\tcreature flies back and falls. Steve falls and tumbles toward\n\tthe mouth of the passageway. He regains his footing as the\n\tcreatures turn to pursue him, he runs to the end of the hall\n\twhere Peter waits.\tPeter:\tNOW...HEAD FOR THE DEPARTMENT STORE...GO!321\tThe two men run across the balcony. They slam into two other\tZombies which clutch and grab at them without success.\n\n322\tAt the entrance arch to the store, Roger fires at another\n\tcreature. It falls. Other Zombies are approaching, but Steve and\n\tPeter dive into the arch and the three men manage to lower the\n\tgate without a problem.\n\n\tThe Zombies converge on the area as they did before, clutching\n\tand pushing at the metal cage, which holds them out securely.\n\n\tThe men breathe heavily as they back away from the gate.\n\n\tPeter:\tDOWNSTAIRS AGAIN ...SAME TRICK.\n\n323\tThe men move through the aisles of the store and go crashing\n\tdown the escalator.\n\n324\tOn the first floor they run toward the lower gate where they\n\tpull up wheezing with exhaustion.\n\n\tSteve:\tWHAT DO WE DO...\n\n\tRoger:\tLET 'EM KNOW WE'RE HERE...\n\t\t\t(shouting)\n\t\t\tWHOOOO HOOOOOO...OVER HERE...YEEE HAAAAAAAA.\tSteve starts to laugh at the ludicrous situation. Peter smiles\n\tat the young pilot.\n\n\tPeter:\tYOU DID ALRIGHT THIS TIME FLYBOY.\n<b>\t\t\tHOW 'BOUT IT?\n</b>\n\tStephen laughs some more, nervously at first, then whole-\n\tHeartedly. Then he lets out a loud:\n\n\tSteve:\tWHOOOOOOOOOOOPEEEEEEEEE...\n\n\tHe has joined the cowboys. He is like a child, almost exultant\n\twith the joy of their victory...\n\tThe three men shout through the cage at the creatures, which are\talready gathering at the gate.\n\n325\tOut on the concourse, a few Zombies wander aimlessly, but most\n\tare heading for the commotion on the first floor arch.\n\n326\tOn the upstairs balcony, Zombies again move toward the\n\tstationary steps and the escalators.\n\n327\tThe three creatures in the Administration corridor move toward\n\tthe open mall. Two walk out on the balcony, but the last one\n\tturns into an open office. Then it staggers back out and heads\n\tdown the hall toward the firestair.\n\n328\tFran can faintly hear the \"whooping\" of the men as she moves\n\ttoward the stairway door, which is still open.329\tShe steps onto the landing and looks down into the darkness. The\tshouting stops. Desperate with fear, she moves back to the\n\tstorage room, then back onto the landing. Now her fear turns\n\tinto anger.\tFran:\tSHIT...\tShe takes a few steps down the stairs. Stops. Goes back up.\n\tFran:\tGOD DAMMIT!\n\tShe starts back down again.\n\n330\tIn the corridor below, the creature walks into another office.\n\tThen it moves back into the hall.\n\n331\tThe Zombies crash against the first floor gate. It holds. The\n\tmen crouch in the shadows of the gate.\n\n\tRoger:\tWE JUST GOTTA WAIT LONGER BEFORE WE MOVE.\n\n\tPeter:\tNO. THERE'S ALWAYS A CHANCE OF SOME OF THEM\n<b>\t\t\tSTAYIN' UP ON THE BALCONY.\n</b>\n\tRoger:\tYEAH, BUT WE CAN HANDLE THAT.  WE CAN BREAK THROUGH.\n\n\tPeter:\tIF ANY OF THEM SEE OR HEAR US, THEY'LL JUST\n<b>\t\t\tFOLLOW US ON UP.  IT'S NO GOOD.\n</b>\n\tRoger:\tWE CAN SURE AS HELL OUT RUN 'EM...LOAD UP WHAT\n<b>\t\t\tWE CAN AND GET OUTTA HERE.\n</b>\n\tPeter:\tI'M THINKIN' MAYBE WE GOT A GOOD THING GOIN' HERE.\n\t\t\tMAYBE WE SHOULDN'T BE IN SUCH A HURRY TO LEAVE.\tRoger:\tOH, MAN...\tPeter:\tIF WE COULD GET BACK UP THERE WITHOUT THEM\t\t\tCATCHIN' ON, WE COULD HOLE UP FOR A WHILE.\n<b>\t\t\tAT LEAST LONG ENOUGH TO CATCH A BREATH.\n</b>\t\t\tCHECK OUT THE RADIO. SEE WHAT'S HAPPENIN'...\tRoger:\tMAN, I DON'T KNOW...\tSteve:\tTHERE'S SOME KIND OF PASSAGEWAY OVER THE TOP\n<b>\t\t\tOF THE STORES.\n</b>\n\tThe Troopers look at the young pilot, almost surprised to hear\n\thim speak.  He has been quiet up until now.\n\n\tSteve:\tI DON'T KNOW IF IT'S JUST HEATING DUCTS OR\n<b>\t\t\tIF IT'S SOME KIND OF ACCESS. I SAW IT ON A MAP.\n</b>\n\tPeter:\tUPSTAIRS.  LET'S GO.\n\n\tThe three move off down the aisles, then duck out of sight\n\taround a corner. The Zombies clutch at the metal gate, moaning\n\tand rattling the grid loudly.332\tIn the Maintenance hallway, we see the thick manual lying on the\tfloor. A lumbering foot kicks it as the Zombie in the corridor\n\twanders into another office. The creature ignores the book, as\n\tit does the corpses strewn in the hall.333\tIn the fire stair, Fran is on the middle landing. She is\n\tsuddenly overcome with a wave of nausea. She clutches at her\tstomach, retching. She sits on the landing, letting her head\n\tflop against the wall. She is almost in tears.334\tThe upstairs doors of the Department Store elevator open and the\tmen trot out. As they clear a wall, they see the entrance arch.335\tThere are no Zombies at the gate, but two are seen drifting\n\talong the balcony outside.\n\n336\tPeter:\tWATCH IT...DON'T LET 'EM SEE YOU.\n\n\tThe men move stealthily along the aisles. They look up at the\n\tceiling and see a series of large grillwork panels. Peter shines\n\this flashlight beam into one.\n337\tThe ceiling is about twelve feet high, but the light beam\tpenetrates the grille to reveal a fairly large space above.338\tRoger:\tLOOKS BIG ENOUGH TO CRAWL THROUGH.\tPeter:\tTHEY'RE LOCKED.\n\n\tRoger:\tDAMN. THAT'S THOSE OTHER LOCK NUMBERS WE\n<b>\t\t\tSAW ON THE CHART.\n</b>\n\tSteve:\tWHY THE HELL WOULD THEY BE LOCKED?\n\n\tPeter:\tJACKPOT, FLYBOY. YOU'RE RIGHT.\n\tRoger:\tWHAT?\tPeter:\tTHEY'RE LOCKED BECAUSE YOU CAN GET THROUGH\t\t\t'EM EASY FROM OTHER PARTS OF THE BUILDING.\tSteve:\tOVER HERE.339\tSteve notices that one of the ceiling grids is very close to the\n\televators. Peter looks at the grids, then down at the double\n\tdoors.\tPeter:\tTHE ELEVATOR SHAFT!\n\tHe moves over and hits the button. The doors open.\n\tPeter:\tHOLD 'EM.\tRoger stands against the rubber safety bumper, holding the car\n\tdoors open wide. Peter steps onto the hand railing and reaches\n\tup for the escape hatch, which is held in place by four knub-\n\theaded bolts. He removes the bolts quickly and dislodges the\n\thatch cover and passes it down to Stephen.\tThen the big man sticks his head up through the opening.340\tHe looks around the elevator shaft, shining his flash this way\tand that. He sees another grid in the shaft wall.\n\n\tPeter:\tIT'S HERE...AND IT AIN'T LOCKED. GET A SCREW-\n<b>\t\t\tDRIVER AND SOMETHIN' TO STAND ON FOR IN HERE.\n</b>\n341\tRoger:\tI KNOW WHERE THE TOOLS ARE. GET ONE OF THOSE\n<b>\t\t\tTABLES.\n</b>\n\tRoger ducks off down an aisle and Steve moves to the nearby\n\tfurniture department and grabs a lightweight lamp table. The\n\televator doors close. When Steve returns with the table he has\n\tto hit the button again. The doors open. Peter is already\n\tclimbing out of the car into the shaft. Steve uses the table to\n\thold the doors open and goes to get another.\n\tThis time he gets a larger coffee table and sets it under the\n\topening in the car and puts the smaller table on top. He climbs\n\tup and sticks his head out into the shaft. The doors close\n\tagain.342\tIn the greasy black shaft, amid the cables and elevator\tmechanisms. Peter examines the wall grid with his flashlight.\tPeter:\tIT'S ALRIGHT...WE CAN GET IT OFF.\n<b>\t\t\tYOU FOUND IT FLYBOY.\n</b>\n\tEven though he speaks softly, Peter's voice has an eerie,\n\techoing sound in the narrow shaft.\n\n343\tThe car doors open. Steve ducks down to see Roger bearing a\n\tscrewdriver and pliers along with some other tools in a shopping\n\tbag.\tRoger:\tONE-STOP SHOPPING ...ANYTHING YOU NEED RIGHT\t\t\tAT YOUR FINGERTIPS.344\tSteve relays the tools up to Peter, who immediately begins to\n\twork on the screws which mount the grid. He passes the\n\tflashlight to Steve who holds the beam on the work area.345\tFran sits in the stairwell, her hand over her mouth. It is very\n\tquiet for a moment, then she hears a slight clicking. Her head\n\tsnaps to attention. She stares down at the bottom landing. There\n\tis a thump at the door.\tSlowly the woman stands to her feet, her eyes transfixed on the\n\tdoor below.\tFran:\tSTEPHEN!\n\n\tThe door starts to open. Light creeps in. The slow, lumbering\n\tfigure of the Zombie moves into the firestair. Choking back a\n\tscream, Fran turns and runs up the stairs. The creature below\n\tfollows, unsure of itself in the dim light.\n\n346\tAt the top, Fran makes it into the storage area and slams the\n\tdoor. For a moment, she just backs away in terror. Then she\n\tgathers her wits and moves to drag the food cartons over as a\n\tbarricade. She struggles with one of the cartons. It is very\n\theavy and so large she cannot get a good grip. The smooth\n\tcardboard slips in her hands.347\tThe Zombie has almost reached the middle landing.\n348\tRoger looks down through a ceiling grid. He sees the interior of\n\ta Sporting Goods Store. Along one wall is an arsenal of the\n\tlatest weaponry for the sportsman.349\tRoger:\tSWEET JESUS!\n\tPeter:\tI SEEN IT. COME ON!\tThe men are in a large ductwork which seems to run along the\n\tentire length of the mall. They move as quietly as they can.\n\tThere are several side tunnels branching off in both directions.\n\n350\tSteve passes another ceiling grid and looks down. He sees a\n\tfull equipped radio and electronics shop.\n\n\tRoger:\tI HOPE YOU KNOW WHERE YOU'RE GOIN', BUDDY.\n\n\tPeter:\t(who is leading)\n<b>\t\t\tTHIS IS IT. COME ON.\n</b>\n351\tFran struggles with the carton. She gets it against the door\n\tfinally and moves to haul another.\n\n352\tThe Zombie has reached the top landing and makes for the door.\n\n353\tBefore the woman can bring another carton over, she sees the\n\tdoor move. She throws herself against it, but can't plant her\n\tfeet well because of the carton of the floor. The door moves an\n\tinch at a time. The creature's hand reaches into the room. It\n\tclutches at the edge of the door.\n\n354\tFran panics and runs back towards the escape pyramid, where she\n\tturns and faces the door.\n\n355\tThe creature is straining against the weight of the carton. Now,\n\tnow both its hands clutch the door edge. The carton moves\n\tanother inch...and another. Now, the creature's head can be seen\n\tas it strains to get through the widening space.\n\n356\tFran's eyes are wide, almost hypnotised. She looks for something\n\tto use as a weapon. The room is bare but for the cartons and\n\twater drums. She is about to opt for the skylight, when she\n\tglimpses Roger's knap-sack in the shadows. She runs for it as\n\tthe creature finally breaks into the big room.\n\n357\tThe woman's hands tremble as she rummages through the cloth\n\tsack. Nothing appropriate. She dumps the contents out:\n\tammunition, mace cans, batteries, flares...flares! She\n\tnervously grabs one of the cylinders and her shaking hands try\n\tto deal with the paper wrapping.\n\n358\tThe Zombie moans as it draws closer. It is approaching the\n\tpyramid of cartons.\n\n359\tFran manages to free the wrapping, and snaps the cylinder in two\n\tat the mark.\n\n360\tNow the Zombie is between her and the pyramid, cutting off her\n\timmediate route. It is very near. Fran backs away a few steps as\n\tshe tries to strike the flare head on the small striker on the\n\tcylinder cap. It doesn't fire...she tries again...and again.\n\tNow, the Zombie has reached the knap-sack. It kicks through the\n\titems and knocks and rolls the other flares.\n\n\tFran's flare finally catches with a great whoosh, the bright\n\tflame startling the woman as well as the Zombie. The creature's\n\teyes go wide and it brings its arms up to avoid the brightness.\n\tThe intense white flame casts an eerie light over the creature\n\tand throws the Zombie's enormous shadow against the cartons and\n\twall. The creature backs away a few steps almost tripping over\n\tthe articles on the floor.\n\n\tFran manages to advance close enough to snatch two extra\n\tcylinders and skirt around the Zombie in a wide arc. The\n\tcreature swats the air, keeping distance, but threatening.\n\n\tFran considers the firestair door, but decides on the pyramid.\n\tShe circles around to a point where she can climb up from\n\tbehind the moaning Zombie. She rushes for the cartons and\n\tclimbs, but loses her footing while trying to hold the flares\n\tand crashes into the topmost carton. It starts to slide off\n\tthe pyramid and tumbles to the floor almost crashing into the\n\tZombie. The creature starts to clutch at the pyramid.\n\n\tThe stack of cartons is now too short and Fran can reach the\n\tskylight but can't pull herself up. She accidentally drops\n\ttwo flares, including the lit one. It tumbles to the floor\n\tbehind the pyramid where it no longer offends the Zombie's\n\teye's. Now the creature tries to climb to the woman.\n\n\tFran grabs the last flare in her mouth and reaches with both\n\thands for the skylight. She lifts with all her might and her\n\tfeet come off the cartons but she cannot pull herself up. As she\n\ttries to lower her feet back to the cartons, the pyramid shakes\n\tand wobbles from the Zombie. The creature is making progress;\n\tits hands can almost touch Fran's foot.\n\n361\tPeter drops out of a ceiling grid into a plush office. Roger's\n\tlegs appear through the grid and he too swings down, holding on\n\twith his hands to soften his landing.\n\n\tSuddenly, we are aware of a third person on the room in the\n\tlarge chair at the desk. Roger startles and grabs his gun.\n\tPeter just stares. They are in the President's office. Some\n\tdays earlier, the President, shot himself in the head.\n\n\tPeter:\tCOME ON...\n\n\tSteve struggles overhead.\n\n\tPeter:\tJUST DROP, I GOT YOU...\t\t \n\n\tSteve:\tI CAN'T...I...\n\n\tPeter:\t(to Roger)\n<b>\t\t\tTHE DESK...GIMME A HAND.\n</b>\n\tThe two Troopers grab the desk and slide it away from the\n\tPresident's corpse. The action causes the chair to spin slightly\n\tand his wide terrified eyes seem to watch the action.\n\n\tThe desk in place. Steve's toes can reach its surface. He loses\n\this balance slightly and pulls back up. He kicks a picture frame\n\toff the desk onto the floor, shattering the glass over photos of\n\tthe President's wife and children.\n\n\tPeter:\tCOME ON!\n\n\tSteve finally gets footing on the desktop and lowers himself\n\tdown. He stares at the corpse as Roger helps him off the desk.\n\n362\tPeter is already unlocking the door to the corridor. He opens it\n\ta crack and peeks out.\n\n363\tThe corridor is empty. He sees the door at the end which leads\n\tto the exterior corridor.\n\n364\tAs the other men come up behind, Peter opens the door quietly\n\tand slips into the hall. He starts to walk quickly toward the\n\tdoor to the exterior corridor. Roger follows as Stephen moves\n\tbackwards toward the fire stairs.\n\n365\tPeter's hands grab the barrow and pulls the cart down the\n\tcorridor backwards so as to face the mall opening.\n\n366\tIn the corridor, Steve clutches the maintenance manual. Peter\n\tbacks slowly up the hall. The wheels squeak and the big man\n\tbites his lip. Roger kicks the last corpse to the wall. Steve\n\tnotices that the fire stairs door is open wide.\n\n\tSteve:\tJESUS CHRIST!\n\n\tHe bounds towards the door. Roger spins to see what happened.\n\tPeter turns and quickens his pace. Steve trots up the steps.\n\n\tRoger:\t(to Peter)\n<b>\t\t\tCOME ON...YOU GOT IT.\n</b>\n\tPeter runs with the cart the last few yards. As he gets to the\n\tdoorway, Roger breaks up the steps.\n\n368\tSteve breaks into the storage area...he drops the manual...\n\n\tSteve:\tFRANNIE!\n\n369\tThe woman turns in Steve's direction. The Zombie swats the\n\tflare out of Fran's hand. She startles and the cartons feel as\n\tthough they will topple. She steadies herself with both hands.\n\tThe creature is grabbing at her legs. She kicks.\n\n370\tSteve raises his rifle and moves in for a close shot.\n\n\tRoger:\tDON'T SHOOT...THEY'LL HEAR YA...\n\n\tRoger arrives and the two men charge the pyramid.\n\n371\tThe creature is still clutching at Fran. She kicks violently as\n\tRoger pulls the back of the Zombie's clothing. The Zombie falls\n\tand hits the floor. As it kneels up, Steve swings the butt of\n\this rifle and smashes it into the thing's head. Then Roger\n\tdelivers a blow with his gun, straight down.\n\n372\tSteve rushes to Fran. She falls off the cartons into his arms\n\tsobbing and choking.\n\n\tSteve:\tFRANNIE...ARE YOU ALRIGHT?\n<b>\t\t\tYOU OK, FRANNIE? HEY...\n</b>\n\tThe woman is incoherent. She is clutching at her stomach.\n\n373\tPeter appears in the doorway carrying the TV and several other\n\titems. He dumps them on the floor.\n\n\tPeter:\tLET'S GET THIS STUFF UP, COME ON.\n\n374\tRoger is dragging the dead Zombie to the door. Peter comes to\n\thelp and Fran starts to wretch. Steve tries to calm her. He gets\n\tsome water in a can and brings it over.\n\n\tSteve:\tFRANNIE...IT'S OK...COME ON, IT'S OK...ARE YOU\n<b>\t\t\tHURT, HUN? DID YA HURT YOURSELF? FRANNIE...\n</b>\n375\tDownstairs, at the exterior corridor, Peter peeks out. He can\n\tsee the mall at the far end. The coast is clear. He and Roger\n\thurriedly carry the corpse into the hall and roll it onto the\n\tfloor and retreat back into the fire stairs. Peter holds open\n\tthe door slightly and watches the corridor for a moment.\n\tConvinced they've not been seen, he closes the door.\n\n376\tPeter:\tI THINK WE'RE OK, BROTHER.\n\n\tThey grab more supplies from the barrow and start upstairs.\n\n377\tSteve still tries to comfort Fran.\n\n\tSteve:\tWE'RE OK...WE'RE ALL OK...WE GOT A LOT\n<b>\t\t\tOF STUFF...ALL KINDS OF STUFF...\n</b>\n\tIn the background the two Troopers bring their load of supplies\n\tinto the big room and deposit them near the TV. Then they go\n\tdownstairs for another load.\n\n\tSteve:\tTHIS IS A TERRIFIC PLACE...FRANNIE. THIS PLACE\n<b>\t\t\tIS PERFECT. WE GOT IT MADE IN HERE...FRANNIE.\n</b>\n\tThe woman still cannot stop sobbing and retching.\n\n378\tNow, the enormous barricade of food cartons is stacked against\n\tthe door again. It is quiet except for the little noises of\n\teating and occasional rustle of paper. We also head a faint\n\telectronic whistle, but we do not recognise it.\n\n\tAs we see more of the room, we find our refugees sitting near\n\tthe reconstructed pyramid on the floor. Peter seems to be asleep\n\tup against the pyramid. Roger is nibbling at delicacies from the\n\tDepartment Store's Gourmet department.\n\n\tTheir \"loot\" is laid around them on the floor. Roger, as he\n\teats, is leafing through the maintenance manual. There is a\n\tstack of tools, some still in wrapping; electric razors, still\n\tboxed; some clothing articles; the radio, which also plays small\n\tcassettes. There are soaps, toiletries, pens, pencils, and\n\tnotebooks, flashlights, cigarettes and several decks of cards\n\twith a canister of chips. The items are clearly not all\n\tfunctional. Some are representative of the luxuries considered\n\tnecessary by a consumer society.\n\n\tThey are all bathed in the blue glow from the television which\n\tStephen tries to tune in. Its power cable is spliced into the\n\tleads of a bare light fixture overhead. Fran cannot be seen at\n\tfirst.\n\n\tRoger:\tWHAT THE HELL TIME IS IT, ANYWAY?\n\n\tSteve:\tONLY ABOUT NINE.\n\n\tRoger:\tAND NOTHING? (referring to the TV)\n\n\tOn the screen we see the Civil Defence logo, and realise that\n\tthe high pitched electronic signal is coming from the TV set.\n\n\tSteve:\tAS LONG AS WE'RE GETTING THE PATTERN,\n<b>\t\t\tTHAT MEANS THEY'RE SENDING.\n</b>\n\tRoger snaps on the large, battery powered radio. He rolls the\n\tdial getting nothing but static. Finally, he hears a signal\n\tand tunes it in. A badly modulated voice is droning through\n\tthe interference. It sounds like a war correspondent sending\n\ta signal from very far away.\n\n\tRadio:\t...REPORTS THAT COMMUNICATIONS WITH DETROIT\n<b>\t\t\tHAVE BEEN KNOCKED OUT ALONG WITH ATLANTA,\n</b><b>\t\t\tBOSTON AND CERTAIN SECTIONS OF PHILADELPHIA\n</b><b>\t\t\tAND NEW YORK CITY...\n</b>\n\tRoger:\tPHILLY...\n\n\tSteve:\tI KNOW J.A.S IS OUT BY NOW...IT WAS A MADHOUSE\n<b>\t\t\tBACK THERE...PEOPLE ARE CRAZY...IF THEY'D JUST\n</b><b>\t\t\tORGANISE...IT'S TOTAL CONFUSION...I DON'T\n</b><b>\t\t\tBELIEVE IT'S GOTTEN THIS BAD. I DON'T BELIEVE\n</b><b>\t\t\tTHEY CAN'T HANDLE IT. LOOK AT US. LOOT AT\n</b><b>\t\t\tWHAT WE WERE ABLE TO DO TODAY.\n</b>\n379\tPeter's eyes suddenly blink open. None of the rest of his body\n\tmoves, the others do not realise he is awake. The big man stares\n\tat Stephen, who is getting emotionally excited about their\n\texploits as a team.\n\n\tSteve:\tWE KNOCKED THE SHIT OUT OF 'EM AND THEY\n<b>\t\t\tNEVER TOUCHED US...NOT REALLY.\n</b>\n\tPeter:\tTHEY TOUCHED US GOOD, FLYBOY. WE'RE LUCKY\n<b>\t\t\tTO GET OUT WITH OUR ASSES. YOU DON'T FORGET THAT!\n</b>\n380\tThe other men look at Peter. The radio drones on with more\n\tdisaster reports.\n\n\tPeter:\t YOU GET OVERCONFIDENT...UNDERESTIMATE THOSE\n<b>\t\t    SUCKERS...AND YOU GET EATEN! HOW YOU LIKE THAT?\n</b>\n\tPeter speaks in a low, unemotional tone. Stephen is transfixed.\n\n\tPeter:\t THEY GOT A BIG ADVANTAGE OVER US BROTHER.\n<b>\t\t    THEY DON'T THINK. THEY JUST BLIND-ASS DO WHAT\n</b><b>\t\t    THEY GOT TO DO. NO EMOTIONS. AND THAT BUNCH\n</b><b>\t\t    OUT THERE? THAT'S JUST A HANDFUL AND EVERY\n</b><b>\t\t    DAY THERE'LL BE MORE.\n</b><b>\t\t    A COUPLE HUNDRED THOUSAND PEOPLE DIE EACH DAY\n</b><b>\t\t    FROM NATURAL CAUSES. THAT PROB'LY TRIPLES OR\n</b><b>\t\t    BETTER WITH FOLK KNOCKIN' EACH OTHER OFF THE\n</b><b>\t\t    WAY IT'S GOIN'.\n</b><b>\t\t    NOW SAY EACH ONE OF THEM COMES BACK AND KILLS\n</b><b>\t\t    TWO, AND EACH ONE OF THEM TWO MORE...\n</b><b>\t\t    YOU KNOW ABOUT THE EMPEROR'S REWARD?\t \n</b>\n381\tWe see Fran's face. She is listening. There is no answer\n\taudible. A tear rolls down the woman's cheek. The radio drones.\n\n\tAfter a time, Steve appears. He is surprised to find the woman\n\tawake. She sits on a new blanket from the store. Another is\n\trolled up as a pillow. She wipes away her tears with her\n\tcigarette still in her hand.\n\n\tSteve:\tHEY...YOU OK?\n\n\tThe man kneels next to her, not knowing what to say. Stephen\n\tsits down next to her and puts his hands on her shoulders.\n\n\tFran:\tSO I GUESS WE FORGET ABOUT CANADA, RIGHT?\n\n\tSteve:\t(taking her in his arms)\n<b>\t\t\tJESUS, FRANNIE, THIS SET UP IS SENSATIONAL.\n</b><b>\t\t\tWE GOT EVERYTHING WE NEED. WE SEAL OFF THAT\n</b><b>\t\t\tSTAIRWAY...NOBODY'LL EVER KNOW WE'RE UP HERE.\n</b><b>\t\t\tWE'D NEVER FIND ANYTHING LIKE THIS...\n</b>\n\tFran:\tI GUESS NOBODY CARES ABOUT MY VOTE, HUH?\n\n\tSteve:\tCOME ON, FRANNIE, YOU WERE SLEEPING.\n\n\tFran:\tWHAT HAPPENED TO GROWING VEGETABLES AND FISHING?\n<b>\t\t\tWHAT HAPPENED TO THE IDEA ABOUT THE WILDERNESS...\n</b><b>\t\t\tHUNDREDS OF MILES FROM ANYTHING AND ANYBODY...\n</b><b>\t\t\tSTEVE, I'M AFRAID. YOU'RE HYPNOTISED BY THIS\n</b><b>\t\t\tPLACE. ALL OF YOU. IT'S ALL SO BRIGHT AND NEATLY\n</b><b>\t\t\tWRAPPED THAT YOU DON'T SEE...YOU DON'T SEE THAT IT\n</b><b>\t\t\tCAN BE A PRISON.\n</b>\n\tShe leans in to him, making a final plea.\n\n\tFran:\tSTEPHEN, LET'S JUST TAKE WHAT WE NEED AND KEEP\n<b>\t\t\tGOING.\n</b>\n\tSteve:\tWE CAN'T HARDLY CARRY ANYTHING IN THAT LITTLE BIRD.\n\n\tFran:\t(angry)\n<b>\t\t\tWHAY DO YOU WANT? A NEW SET OF FURNITURE? A\n</b><b>\t\t\tFREEZER? A CONSOLE TV AND A STEREO? WE CAN TAKE\n</b><b>\t\t\tWHAT WE NEED. WHAT WE NEED TO SURVIVE.\n</b>\n382\tCut to a close up of Peter's face. His eyes pop open.\n\n\tPeter:\tSHUT THAT THING OFF!\n\n\tRoger clicks off the radio. They listen. They hear slight sounds\n\tcoming from the fire stairs. The end of the room with the\n\tbarricade of cartons looks surreal in the blue glow of the TV\n\tscreen which still shines.\n\n\tRoger crawls over and clicks the TV off as well. The electronic\n\twhistle slowly dies. Silence.\n\n\tSteve steps out from behind the wall of cartons. Fran peers\n\taround the corner to look, but she still sits on the floor.\n\tAnother noise. The faint squeaking of the door to the bottom of\n\tthe steps. Then footsteps on the metal stairs. Slow...\n\tlumbering.\n\n\tThe faces of the humans all tighten. Peter and Roger pull their\n\trifles. Roger makes his ready.\n\n\tSome thumping in the hall. Steve squats down and holds Fran.\n\tThe sounds are closer now. The door behind the cartons clicks\n\tbut does not move. More pounding...then silence.\n\n\tAfter a time, the footsteps recede down the stairs.\n\n\tPeter:\tSOMEBODY BETTER SIT WATCH ALL THE TIME.\n\n\tRoger:\tTHEY'LL NEVER GET THROUGH THERE.\n\n\tPeter:\tENOUGH OF 'EM WILL. AND IT AIN'T JUST THEM THINGS\n<b>\t\t\tWE GOT TO WORRY ABOUT. THAT CHOPPER UP THERE COULD\n</b><b>\t\t\tGIVE US AWAY IF SOMEBODY COMES MESS' AROUND.\n</b>\n\tRoger:\tWHAT ARE THEY GONNA DO? LAND ANOTHER PILOT TO FLY\n<b>\t\t\tIT OUT. THEY'RE NOT GONNA MESS WITH A LITTLE BIRD\n</b><b>\t\t\tLIKE THAT. THEY GOT ENOUGH ON THEIR HANDS. YOU\n</b><b>\t\t\tKNOW BACK IN PHILLY WE FOUND A BOAT IN THE MIDDLE\n</b><b>\t\t\tOF INDEPENDENCE SQUARE. SOMEBODY TRYIN' TO CARRY\n</b><b>\t\t\tIT TO THE RIVER, I GUESS. DIDN'T MAKE IT. DAMN\n</b><b>\t\t\tTHING SAT THERE FOR EIGHT DAYS.\n</b>\n\tPeter:\tSOMEBODY FINALLY GOT IT, THOUGH. IT COMES DOWN TO\n<b>\t\t\tHOW MUCH ITS WORTH.\n</b>\n383\tFran ducks back onto her blanket. She disgustedly lights another\n\tcigarette. Steve sits next to her again.\n\n\tSteve:\tFRANNIE...\n\n\tShe doesn't respond.\n\n\tSteve:\tDAMMIT, FRAN, YOU KNOW HOW MANY TIMES WE'D\n<b>\t\t\tHAVE TO LAND FOR FUEL TRYIN' TO MAKE IT UP NORTH?\n</b><b>\t\t\tTHOSE THINGS ARE OUT THERE EVERYWHERE. AND THE\n</b><b>\t\t\tAUTHORITIES WOULD GIVE US JUST AS HARD A TIME...\n</b><b>\t\t\tMAYBE WORSE... WE'RE IN GOOD SHAPE HERE, FRANNIE.\n</b><b>\t\t\tWE GOT EVERYTHING WE NEED RIGHT HERE!\n</b>\n\tStephen curls up with his head on the rolled blanket.\n\n\tSteve:\tCOME ON...GET SOME SLEEP.\n\n\tThe woman doesn't move.\n\n\tSteve:\tFRANNIE. COME ON.\n\n\tShe grinds her cigarette out on the concrete floor and stretches\n\tout next to the man. He puts his arm around her. His hands rub\n\tup and down her body as he curls next to her. He opens her\n\tblouse and reaches inside. He closes his eyes and he seems\n\tperfectly comfortable to rest in her softness. His hand moves\n\tunder her clothing. She doesn't respond, at first, then her body\n\trelaxes somewhat and she brings one of her arms up around his\n\thead.\n\n\tSteve:\tI'M NOT JUST BEING STUBBORN. I REALLY THINK THIS\n<b>\t\t\tIS BETTER. HELL. YOU'RE THE ONE'S BEEN WANTIN' TO\n</b><b>\t\t\tSET UP HOUSE.\n</b>\n\tShe stares off across the barren room. His hands continues to\n\tmove under her blouse.\n\n384\tIn the Administration Corridor, a few stray Zombies wander among\n\tthe corpses on the floor. One large and severely wounded\n\tcreature pounds on the door to the interior corridor. It had\n\tbeen the one which was pounding at the door upstairs.\n\n\tA female Zombie squats near one of the corpses in the hall. She\n\tlifts its arm and moves it to her mouth, but she drops it\n\tquickly, repelled by its coldness. She leans over and picks at\n\tanother corpse, then she stands and drifts towards the mall.\n\n\tSlowly the creatures leaves the corridor and move out onto the\n\tsecond floor balcony. We begin to hear a voice fading in over\n\tthe scene.\n\n\tVoice:\t...NOT ACTUALLY CANNIBALISM...CANNIBALISM IN THE\n<b>\t\t\tTRUE SENSE OF THE WORD, IMPLIES AN INTRASPECIE\n</b><b>\t\t\tACTIVITY... THESE CREATURES CANNOT BE CONSIDERED\n</b><b>\t\t\tHUMAN..THEY PREY ON HUMANS...THEY DO NOT PREY ON\n</b><b>\t\t\tEACH OTHER.\n</b>\n385\tWe see the mall balcony now. Zombies wander past the stores.\n\tSome move down the stationary stairs onto the main concourse.\n\tBelow.\n\n\tVoice:\tTHEY ATTACK AND...AND FEED...ONLY ON WARM HUMAN\n<b>\t\t\tFLESH...\n</b>\n386\tAt the mall entrances, some creatures drift out into the night.\n\tOthers still enter the enormous building. There are not as many\n\tas there were in the afternoon, but there are certainly enough\n\tto be threatening.\n\n\tVoice:\tINTELLIGENCE? SEEMINGLY LITTLE OR NO REASONING\n<b>\t\t\tPOWER. WHAT BASIC SKILLS REMAIN ARE MORE\n</b><b>\t\t\tREMEMBERED BEHAVIOURS FROM...FROM NORMAL LIFE.\n</b>\n387\tSeveral creatures are clawing at the roll gate to the department\n\tstore. It is a strange and eerie sight. The staring, painted\n\teyes of the mannequins within the store seem to watch the\n\tZombies. The gate rattles but does not budge.\n\n\tVoice:\tTHERE ARE REPORTS OF THE CREATURES USING TOOLS,\n<b>\t\t\tBUT EVEN THESE ACTIONS ARE THE MOST PRIMITIVE...\n</b><b>\t\t\tTHE USE OF EXTERNAL ARTICLES AS BLUDGEONS ETC.,\n</b><b>\t\t\tEVEN ANIMALS WILL ADOPT THE BASIC USE OF TOOLS IN\n</b><b>\t\t\tTHIS MANNER.\n</b>\n388\tFran's eyes pop open the voice has awakened her. She has been\n\tasleep on the blanket.\n\n\tVoice:\tTHESE CREATURES ARE NOTHING BUT PURE, MOTORISED\n<b>\t\t\tINSTINCT...\n</b>\n\tThe woman looks around. Morning sunlight is spilling in through\n\tthe skylights above. She sits up and peers into the next area of\n\tthe room. The men are gone. The television is playing. On the\n\ttube we see a dishevelled man sitting in an emergency news room\n\treading the report.\n\n389\tVoice:\tTHEIR ONLY DRIVE IS FOR THE FOOD WHICH SUSTAINS\n<b>\t\t\tTHEM. WE MUST NOT BE LULLED BY THE CONCEPT\n</b><b>\t\t\tTHAT THESE ARE OUR FAMILY MEMBERS OR OUR FRIENDS.\n</b><b>\t\t\tTHEY WILL NOT RESPOND TO SUCH EMOTIONS. THEY\n</b><b>\t\t\tMUST BE DESTROYED ON SIGHT....\n</b>\n390\tFran sees that the barricade of cartons is still in place at\n\tthe fire stairs door. She looks up. The skylight above the\n\tpyramid is open. She realises that the men are on the roof.\n\n391\tAt the edge of the roof, Peter looks through binoculars.\n\n392\tAbout a quarter of a mile away, he sees the large warehouse of\n\ta food processing chain. IN the yard and in the large open\n\tgarages of the building, he sees a fleet on enormous trailer-\n\ttrucks parked.\n\n393\tSteve:\tYOU SURE WE CAN START 'EM.\n\n\tRoger:\tYOU HAVEN'T SPENT ENOUGH TIME ON THE STREET.\n\n\tPeter:\tWELL LET'S GET IT UP. THERE'S NOT TOO MANY\n<b>\t\t\tOF 'EM AROUND YET THIS MORNIN'.\n</b>\n\tThe big trooper looks down to the parking lot below.\n\n394\tThere are not as many Zombies as there were the day before, and\n\tthey wander aimlessly, spread out rather than in clusters.\n\n395\tThe men move for the skylight.\n\n396\tIn the storage area below, Fran is examining the maps in the\n\tmanual. The TV still drones in a low volume. The men climb\n\tdown into the room.\n\n\tRoger:\tHEY, FRAN...\n\n\tFran:\tI WOULD HAVE MADE COFFEE AND BREAKFAST, BUT I\n<b>\t\t\tDON'T HAVE MY POTS AND PANS.\n</b>\n\tThere is a bitterness in her voice. Roger laughs. Steve senses\n\tthe tension. Peter just straps on his equipment.\n\n\tFran:\tCAN I SAY SOMETHING?\n\n\tSteve:\tSURE. WHAT DP YOU MEAN?\n\n\tFran:\tI'M SORRY YOU FOUND OUT I'M PREGNANT, BECAUSE I\n<b>\t\t\tDON'T WANT ANY OF YOU TO TREAT ME DIFFERENTLY\n</b><b>\t\t\tTHAN YOU'D TREAT ANOTHER GUY.\n</b>\n\tSteve:\tHEY, FRANNIE, COME ON...\n\n\tFran:\tAND,...I'M NOT GONNA BE DEN MOTHER FOR YOU GUYS.\n\n\tThey all look at her, attentive now.\n\n\tFran:\tAND I WANT TO KNOW WHAT'S GOING ON. AND I\n<b>\t\t\tWANT SOMETHING TO SAY ABOUT THE PLANS. THERE'S\n</b><b>\t\t\tFOUR OF US, OK?\n</b>\n\tSteve:\tJESUS, FRAN...\n\n\tPeter:\tFAIR ENOUGH!\n\n\tFran:\tNOW. WHAT'S GOIN' ON?\n\n\tPeter:\tWE'RE GOIN' OUT.\n\n\tFran starts to say something, but this time Peter cuts her off.\n\n\tPeter:\t...AND YOU ARE NOT COMING WITH US!\n\n\tAgain the woman starts to protest, but Peter continues.\n\n\tPeter:\tAND YOU WILL NOT COME WITH US UNTIL YOU CAN\n<b>\t\t\tHANDLE YOURSELF. THAT MEANS LEARN TO SHOOT AND\n</b><b>\t\t\tLEARN TO FIGHT.\n</b>\n\tThe big man starts back up the pyramid. Roger moves to\n\tfollow him.\n\n\tFran:\tSOMETHING ELSE.\n\n\tThe men look at her. She faces Roger and Peter directly without\n\tlooking at Stephen.\n\n\tFran:\tI DON'T KNOW ANOUT YOU TWO, BUT I WANNA LEARN\n<b>\t\t\tHOW TO FLY THAT HELICOPTER.\n</b>\n\tStephen is shocked. Fran looks at him and lowers her eyes.\n\n\tFran:\tIF ANYTHING HAPPENS...WE'VE GOTTA BE ABLE TO GET\n<b>\t\t\tOUT OF HERE.\n</b>\n\tStephen doesn't know what to say. He looks at the woman,\n\tthen up at the other men.\n\n\tPeter:\tSHE'S RIGHT, FLYBOY. COME ON, LET'S GO.\n\n\tFran:\tAND YOU'RE NOT LEAVING ME WITHOUT A GUN AGAIN.\n\n\tStephen thinks about protesting but he complies by slowly\n\tsetting his rifle down on the cartons. Then he fishes in his\n\tpocket for a fistful of shells and dumps them next to the gun.\n\tHe stares at the woman angry and hurt.\n\n\tFran picks up the weapon and shoots a glance up at Peter. \n<b>\t\t\t\n</b>\tFran:\tI JUST MIGHT BE ABLE TO FIGURE OUT HOW TO USE\n<b>\t\t\tIT.\n</b>\n\tPeter and Roger disappear through the skylight. Stephen stands\n\tstill. He looks down at the floor. Fran moves close to his side.\n\n\tFran:\tI'M SORRY, STEPHEN. (it is not an apology)\n\n\tSteve:\tI KNOW...I KNOW...IT'S ALRIGHT!\n\n\tHe starts up to the skylight.\n\n\tFran:\tSTEPHEN\n\n\tSteve:\tYEAH.\n\n\tHe stops and turns to look at her. Her eyes are pleading for\n\tunderstanding, but he is incapable of it at the moment. Fran\n\tjust shrugs off whatever she was going to say, and she sighs\n\twith exasperation.\n\n\tFran:\tBE CAREFUL.\n\n\tSteve:\tYEAH, WE'LL BE ALRIGHT.\n\n\tHe disappears through the skylight. Fran stares down at the\n\tweapon in her hands, then she steps over and clicks off the\n\ttelevision.\n\n397\tThe sudden, loud noise of the chopper engine as it hovers.\n\tOnly Stephen is on board at the controls.\n\n398\tIn the cab of one of the big trailer trucks Roger is crouching\n\tworking on the wiring beneath the dashboard.\n\n399\tPeter sits on the cab of another truck. He tries the\n\tcomplicated shift mechanism and fidgets with the other controls.\n\tThen he pulls out. He stops the big vehicle with his cab just\n\tabreast of the cab Roger is working in.\n\n\tPeter:\tHOW ABOUT IT?\n\n\tRoger:\tGETTIN' IT.\n\n400\tPeter looks around. The mall can be seen in the distance. On the\n\tground between, there are a few Zombies scattered about in\n\tlittle clusters. None of them present any immanent danger.\n\n401\tRoger sits up and is able to start his truck.\n\n\tPeter:\tI'LL JUST RIDE PICK UP, I'M NOT TOO SURE OF\n<b>\t\t\tTHIS THING...\n</b>\n\tRoger:\tI GREW UP ON ONE OF THESE, LET'S GO.\n\n402\tThe great trucks lumber away from the warehouse. They pull\n\tacross the little loading lot and out a ramp toward the\n\troadway. Stephen hovers overhead in the chopper, following\n\tthe trucks as closely as he can.\n\n403\tOn the roof of the mall, Fran clutches her rifle. She sees the\n\tbig trucks roar up over the hill, the helicopter just above\n\tthem. It is a strange looking convoy as it speeds toward the\n\ttrucks as closely as it can.\n\n404\tAlong the road, several Zombies try to stagger after the trucks\n\tbut they are left in the dust of the speeding vehicles. The\n\tcreatures lumber along slowly behind.\n\n405\tThe vehicles pull into the little grade which loads into the\n\tmall's parking lot. They roar right toward the building.\n\n406\tAt one of the building entrances, a cluster of Zombies is\n\tmoving in and lot of the main doors. Others wander nearby in the\n\tparking lot. Attracted by the sounds of the engines, the\n\tcreatures turn and face the trucks.\n\n\tAs Peter pulls his vehicle in a wide arc, Roger drives his right\n\tup to the side of the building and roars toward the entrance\n\tdoors. Then he skips his right wheels up onto the curb, and with\n\ta great, scraping crunch, the big truck pulls directly abreast\n\tof the building, flush with the entrance. The huge vehicle\n\tcrushes several of the helpless creatures and knocks other\n\tflying back.\n\n407\tThe trailer of the truck has totally blocked off the mall\n\tentrance. Several Zombies trapped inside try to push the glass\n\tdoors open. The doors move, but cannot be opened wide enough\n\tfor the creatures to get out.\n\n408\tThe few creatures immediately around the truck begin clambering\n\tat its sides. Roger shuts off the engine and grabs his gun as\n\tother Zombies begin clutching at the windows of the cab.\n\n409\tOverhead, the whirlybird hovers very close by. Now Peter's big\n\ttruck pulls up alongside so that Peter's passenger door is\n\tdirectly abreast of the free door on Roger's cab.\n\n\tPeter's truck also crushes one or two of the creatures, but\n\tthere are still several in the immediate vicinity of the cab.\n\n410\tAs Roger opens his door and scrambles into the other truck, one\n\tof the Zombies grabs hold. Roger just manages to kick the\n\tcreature off as the big truck pulls out and roars across the\n\tlot.\n\n411\tThe helicopter flies straight up and directly over the roof of\n\tthe big shopping centre, where Fran has been watching the\n\taction. She now runs to the other side of the roof, the wind\n\tfrom the chopper whipping her hair.\n\n412\tThe chopper turns and waits for the big truck to move up under\n\tit, then the whirlybird escorts the trailer back to the warehouse\n\tdown the road.\n\n413\tRoger is whooping and hollering like a cowboy as the big rig\n\tpulls up beside another of the parked vans.\n\n\tPeter:\tCOME ON, COME ON... THREE MORE BABY.\n\n\tRoger:\tLIKE A CHARM, HUH? LIKE A FUCKING CHARM!\n\n\tRoger grabs his knapsack and climbs into the new cab where he\n\timmediately goes to work on jumping the engine cables.\n\n414\tFrom the helicopter overhead, Stephen spots something moving\n\taround the warehouse. He jockeys the chopper slightly for a\n\tbetter look and he sees a small group of Zombies wandering out\n\tof the big garage directly toward Roger's truck.\n\n415\tIn the meantime, Peter's truck pulls away from the cab Roger is\n\tin. The big vehicle rolls into the large paved area behind the\n\twarehouse where Peter can turn it around easily.\n\n416\tStephen swoops down with the big bird. He buzzes as close as he\n\tcan to Roger's truck, trying to signal the man.\n\n417\tRoger continues to work on the cables, still whooping like a\n\tchild. The Zombies are very close at hand. They have just\n\tabout reached the cab. Stephen buzzes again. Roger doesn't\n\tnotice.\n\n418\tPeter has now backed up into a position which enables him to\n\tpull out. He looks up to see the helicopter heading straight\n\tfor him.\n\n419\tThe big chopper buzzes right over Peter's cab then spins around\n\theading back for Roger.\n\n420\tPeter looks toward the other truck. He can now see the lumbering\n\tcreatures. He tries to slam the truck into gear, but the\n\tcomplicated shift mechanism fights him.\n\n421\tOne Zombie slams its hands against the driver-side window of\n\tRoger's truck. The man startles and tries to untangle himself\n\tfrom his cramped position under the big steering wheel. He is\n\tstuck for a moment. The other creatures appear at the passenger\n\tside of the cab, where the door is open. One grabs at Roger's\n\tlegs. Roger kicks violently, but can't get a good position. He\n\tfalls lower onto the floor of the cab, his body almost knotted\n\tamong the controls and the shift sticks.\n\n422\tPeter's truck starts to roll, but it accelerates slowly.\n\n423\tThe helicopter tries to buzz the clutching ghouls, but they do\n\tnot even flinch. The wind from the propeller blades whip at the\n\tcreatures' hair, making them look even more frightening as they\n\tclaw at the desperate Roger.\n\n424\tThe man kicks and kicks, but he cannot deliver a solid blow from\n\this pinned position. His hand gropes on the seat of the truck\n\tfor his rifle, which suddenly fires as the man's fingers\n\tinadvertently hit the trigger. A shell blasts through the chest\n\tof the lead creature, but the thing pays little attention.\n\n425\tPeter's truck is starting to roll faster. He heads right for\n\tRoger's cab.\n\n426\tThe helicopter hovers as Stephen tries to see the action.\n\n427\tNow Roger has a good grip on his gun, but he cannot clear the\n\tlong weapon from around the gear sticks. The lead Zombie is\n\tactually scrambling into the cab and is all but on top of the\n\tstruggling Trooper.\n\n428\tThe second creature is about to claw its way in when, with a\n\tgreat roar, Peter's truck swings up and crushes it.\n\n429\tRoger is desperately trying to keep the other Zombie's mouth\n\taway. They are wrestling now. The Zombie is weak, as usual, but\n\tRoger is still hampered by the position he is in.\n\n430\tPeter has pulled too far past the other truck. He slams his rig\n\tinto reverse and backs up. Now his window is in a direct line\n\twith the open door on Roger's cab. He raises his rifle and aims,\n\tbut he cannot get a clear shot. He shouts loudly trying to\n\tovercome the noise of the truck engine and the hovering\n\thelicopter.\n\n\tPeter:\tGET ITS HEAD UP...GET ITS HEAD UP...\n\n431\tRoger realises that Peter is outside. He struggles with the\n\tcreature, dropping his gun. His hands manage to get a\n\tstranglehold on the creature's neck. He pushes up with all his\n\tmight. The Zombie's hands are clutching at the man's face. It's\n\tfingers push at the man's eyes.\n\n432\tPeter sees the opportunity and fires. The gun roars loudly.\n\n433\tThe Zombie's head flies apart. Remnants of blood and brain\n\ttissue splatter the inside of the cab and the driver's window.\n\tThe gummy stuff flies into Roger's face. The Zombie falls limp,\n\tbut Roger is still desperate. The dead weight of the creature is\n\tnow on top of him, and the bloody wound runs. Roger is frantic.\n\tHe frees himself with great heaves of his body and he pushes the\n\tcreature out of the cab. The man's eyes are wide with revulsion.\n\tHe instantly brings up his sleeve to wipe the stains from his\n\tface. He is quivering in extremes of emotions.\n\n\tA sudden crash. Roger spins. The Zombie at the driver door has\n\tsmashed through the cab window with a brick. Roger, still\n\tshaking, dives down to the floor for his weapon.\n\n434\tPeter tries to level off a shot but he cannot because Roger is\n\tin the way...\n\n\tPeter:\tGET DOWN...STAY DOWN...I GOT IT!\n\n435\tRoger, in his adrenalised anger, sits up with his gun and levels\n\toff on the creature himself. He fires. The shell crashes through\n\tthe already shattered glass and squarely into the creatures\n\thead.\n\n\tRoger:\tYOU BASTARDS...YOU BASTARDS...\t\n\n\tIt seems as though his mind is snapping. His voice quivers as\n\tdoes his body.\n\n\tRoger:\tWE GOT 'EM, BUDDY...WE GOT 'EM DIDN'T WE!\n\n436\tPeter:\tCOOL IT, MAN...GET YOUR HEAD...\n\n437\tRoger:\tWE GOT THIS BY THE ASS...GOT THIS BY THE ASS!\n\n\tRoger is screaming. He dives down to work on the jumping again.\n\n438\tPeter:\tHEY, ROG...GET YOUR HEAD MAN...COME ON...\n<b>\t\t\tWE GOT A LOT TO DO...ROGER...\n</b>\n439\tThere is no response from the other truck. Peter is about to\n\topen his door and step out when suddenly Roger sits up again.\n\tThe engine of the truck roars. He seems to have calmed down\n\tsome. He looks across at Peter.\n\n\tRoger:\tLET'S GO BABY...NUMBER TWO...\n\n\tPeter:\tYOU ALRIGHT?\n\n\tRoger:\tPERFECT, BABY...PERFECT!\n\n\tRoger guns the engine on his truck. The big vehicle lumbers out\n\tof the area. Peter follows suit.\n\n440\tThe two Semis rumble out of the warehouse lot and start down the\n\tgrade toward the road. The helicopter escorts them.\n\n441\tA few Zombies are walking up the road slowly.\n\n442\tRoger's eyes get wider with anger. He steers his big rig right\n\tfor the creatures.\n\n443\tThe front of the cab smashes into two of them. One is crushed\n\tunder the wheels, the other flies back from the impact.\n\n444\tFran watches with anxiety. She sees the two trucks pull up over\n\tthe rise with the helicopter following. We hear spirited music\n\tas the convoy approaches the mall building.\n\n445\tThe two trucks roar around the entrance ramps into the parking\n\tlot and again, the chopper zooms right over the roof.\n\n446\tFran trots across the roof to see the action in the lot.\n\n447\tthe trucks rumble toward the second set of doors. The music\n\tcontinues through the entire action.\n\n448\tRoger steers his giant vehicle directly broadside to the doors.\n\tThe cab knocks over several creatures and scrapes the building\n\tas the trailer blocks off the entrance. This time there are\n\tstill creatures alive in the immediate area. They clutch at the\n\tcab of the truck and leap at the doors.\n\n449\tFran, watching from directly above, seems inspired, caught up in\n\tthe bravery of the moment. As she sees the creatures converging\n\ton the truck, she aims her rifle at them. Before she fires,\n\tPeter's rig slides next to Roger's, cabs abreast.\n\n450\tPeter's truck knocks over several of the clutching creatures.\n\tOne Zombie, caught directly under the front wheels, is still\n\talive and clutching at the air. Several creatures jump at\n\tPeter's driver side window.\n\n451\tRoger, grabbing his gun, moves to leave his truck on Peter's\n\tside, but the trucks are too close. His door won't open\n\tenough to get out. He rolls down his window. Peter has noticed\n\tRoger's door won't open, and the Trooper fumbles with the gear\n\tshift in order to pull away, but he hears Roger shouting:\n\n\tRoger:\tTHE WINDOWS...OPEN YOUR WINDOW...YOUR WINDOW...\n\n\tPeter dives across the cab and rolls down the passenger window.\n\tRoger leans out his open window, trying to get his weapon into\n\tfiring position. One or two Zombies are squeezing through the\n\tnarrow space between the truck. They are just about to reach\n\tRoger when he fires, killing the lead ghoul. More Zombies move\n\taround Roger's cab, moments away from him.\n\n452\tThe helicopter buzzes the area as Stephen watches the Zombies\n\tconverge on the cab.\n\n453\tFran, her hair blowing front he chopper, tries to aim her rifle\n\tinto the pack of creatures. Her hair covers her eyes and she\n\tbrushes it away with irritation.\n\n\tFran:\tROGER...IN FRONT, ROGER...IN FRONT, ROGER...\n\n\tShe shouts over the engine noises, getting very excited.\n\n454\tRoger fires again and again down the narrow space between the\n\trigs. Another Zombie falls.\n\n\tPeter:\tFOR CHRISSAKE COME ON!\n\n\tRoger is still emotionally crazed. He leans out of his window in\n\ta very vulnerable position. He is whooping like a child again as\n\the tries to level off another shot.\n\n\tSuddenly, he's grabbed from behind by a Zombie and almost falls\n\tout the window. He struggles to hold himself and keep a grip on\n\this gun. Peter leans over, trying to get a shot at the creature,\n\tbut can't get a clean sight. Roger grabs the window frames on\n\tPeter's door and tries to pull himself up. Another creature\n\tgrabs him from behind.\n\n455\tFran watches with emotion in her eyes.\n\n\tFran:\tMONSTERS! MONSTERS!\n\n\tShe fires her gun.\n\n456\tThe bullet slams into the pavement kicking up a cloud of smoke.\n\tIt narrowly misses a creature. Fran fires again. Her shot tears\n\tinto the shoulder of the Zombie, but it doesn't stop him.\n\n457\tThe chopper zooms very close. Peter still cannot aim his rifle,\n\tbut Roger, using both hands, brings his gun butt in an uppercut.\n\tIt slams against a creature which is grabbing him and drives the\n\tthing staggering back. Then with a desperate driving motion, \n\tRoger climbs through the window of Peter's cab.\n\n458\tPeter pulls the big rig away even while Roger's legs still kick\n\tout the window. The Zombies grab at Roger's ankles, and one\n\tmanages to hold on as the truck starts to move.\n\n459\tFran fires again and again.\n\n460\tThis shot rips into the Zombie holding Roger's leg. It lets go\n\tand falls, rolling across the pavement. The woman fires again,\n\thitting the pavement. The creature struggles to its knees. She\n\tfires again and hits the creature's neck. Again.\n\tShoulder. Again...head. The Zombie sprawls on the pavement. Fran\n\tis exultant, she aims and fires at another creature.\n\n461\tThe helicopter passes overhead. The music is still stirring.\n\n462\tIn Peter's truck, just rolling out the lot, Roger realises:\n\n\tRoger:\tJESUS!\n\n\tPeter:\tWHAT?\n\n\tRoger:\tMY GODDAM BAG...I LEFT MY GODDAM BAG IN THE\n<b>\t\t\tOTHER TRUCK.\n</b>\n\tPeter brings his vehicle to a screeching halt.\n\n\tPeter:\tALRIGHT, NOW YOU SON OF A BITCH! YOU\n<b>\t\t\tBETTER SCREW YOUR FUCKIN' HEAD ON, BABY!\n</b>\n\tRoger:\tYEAH, YEAH...I'M O.K. LET'S GO.\n\n\tSuddenly, Peter grabs the Trooper by his lapels and slams\n\thim back against the door of the cab.\n\n\tPeter:\tI MEAN IT! NOW YOU'RE NOT JUST PLAYIN' WITH\n<b>\t\t\tYOUR LIFE, YOUR PLAYIN' WITH MINE!\n</b>\n\tThe two men stare at each other for a moment. Roger is startled\n\tsomewhat out of his emotional rush.\n\n\tPeter:\t(softer)\n<b>\t\t\tALRIGHT, NOW ARE YOU STRAIGHT?\n</b>\n\tRoger:\tYEAH.\n\n\tPeter lets him go and returns to the wheel. He guns the engine\n\tand roars into a big arcing turn in the parking lot.\n\n463\tWhen Fran sees the truck returning, she looks up from her gun\n\tsight. The helicopter has already flown over the roof, and\n\tStephen is confused as to why the truck hadn't appeared on the\n\troad. Fran turns and tries to signal to Stephen.\n\n464\tHe finally sees her and flies closer. The woman waves a signal\n\tand the chopper buzzes back over the lot.\n\n465\tHer hair blowing wildly, Fran takes up her post again, her rifle\n\tready. She thinks a moment, then begins to reload the weapon\n\tpulling the shells from her blouse pocket.\n\n466\tPeter's truck zooms back into position, colliding with some of\n\tZombies in the vicinity.\n\n467\tRoger immediately climbs through the windows into the original\n\tcab. He snatches up his knapsack and several tools which are\n\tstrewn over the seat and floor.\n\n\tAgain, creatures converge on the cab area. Two more come up\n\tbetween the trucks, several come around the front of the cab.\n\n468\tFran is still loading.\n\n469\tThe helicopter buzzes.\n\n470\tAs Roger climbs back through the window, his pack accidentally\n\tfalls to the ground. With reflex action, he drops between the\n\tcabs, landing on his feet. He is facing the two creatures\n\twhich are very close. He reaches up and with on hand on each of\n\tthe open window frames, he swings his legs up hard. His kick\n\tsends the creatures sprawling. Then, he bends to collect his\n\tpack and is grabbed from behind.\n\n471\tPeter tries to level off his gun but he cannot get a shot.\n\n472\tNeither can Fran who is shouting from the roof.\n\n473\tRoger keeps his head this time. His first thought is for the\n\tpack of tools. He tosses the sack into the cab of Peter's truck\n\tas though he were making a hook shot with a basketball.\n\n474\tPeter catches the pack as several of the tools clatter out and\n\tonto the floor of the cab.\n\n475\tThe creature which has a hold on Roger takes advantage of the\n\tman's imbalance from throwing the knapsack. It bites at the\n\tman's arm. Roger tears away, but blood appears at the wound.\n\tThen Roger squares off a solid punch right to the Zombie's jaw.\n\tThe creature flies back and almost knocks over the Zombies\n\tbehind it. Roger jumps, making a grab for the window of Peter's\n\tcab. The Zombies between the trucks, which Roger originally\n\tkicked away, have regrouped. They advance and grab at the\n\tstruggling trooper. Roger's feet try to get hold on the side of\n\tthe door, but they slip.\n\n476\tPeter moves to drop his rifle and grab Roger's hands, but Roger\n\tfalls from the high window back to the pavement. Peter draws his\n\thand gun.\n\n477\tRoger leaps again, his hands catching the window frame. The\n\tZombies are clutching at him. Again he swings up his legs and\n\tkicks the creatures off balance. This time he manages to get his\n\tfeet locked against the door and Peter grabs the Troopers arm\n\twith his free hand, but another Zombie is pulling at the man's\n\tshirt and still another makes a grab for his legs.\n\n\tPeter reaches out with his pistol and fires a point blank shot\n\tat one of the clutching ghouls. It flies back and Roger is able\n\tto pull himself higher. His torso is just about through the\n\twindow when another creature grabs him.\n\n478\tPeter can no longer get a shot as Roger fills the window, so the\n\tbig man drops his pistol and pulls Roger's arm with all his\n\tmight.\n<b>\t\n</b>479\tRoger is almost all the way in but his legs still dangle,\n\tkicking. Peter starts the truck. As it begins to roll away, one\n\tof the clutching Zombies is able to get a solid hold on Roger's\n\tleft leg. The creature opens its mouth and bites at the calf.\n\tBlood appears. The creature bites again and this time it comes\n\taway with bits of flesh tangled in a bloodstained strip op\n\tmaterial from Roger's trousers.\n\n480\tRoger screams in pain and kicks violently. The truck\n\taccelerates and the Zombie finally falls clear.\n\n481\tIt rolls on the pavement for a little way before it stops.\n\tThen it sits on the ground, looking like a gorilla. It still\n\thas a bloody mass of flesh and material in its mouth. With its\n\thands it tries to separate the cloth from the more important\n\tmorsels.\n\n\tA bullet pings into the cement near the chewing Zombie. Another\n\ttears through its shoulder. It still is concerned only with its\n\tprize.\n\n482\tFran is firing, swearing through her teeth as the gun roars.\n\tShe finally hits the seated creature squarely in the head.\n\n483\tWe see it fall from her point of view on the roof. Others walk\n\tby the corpse without taking notice.\n\n484\tThe helicopter escorts the big truck back to the warehouse.\n\n485\tAs it rumbles along, Roger, in extreme pain, is tying his belt\n\ttightly around his leg as a tourniquet. He sucks air through his\n\tteeth in anguish.\n\n\tPeter:\tTHAT'S IT.\n\n\tRoger:\tBULL SHIT.\n\n\tPeter:\tWE GOTTA DEAL WITH THAT LEG!\n\n\tRoger:\tI'M DEALIN' WITH IT...I'M DEALIN' WITH IT FINE!\n<b>\t\t\tI WON'T BE ABLE TO WALK ON THIS AT ALL IF WE WAIT.\n</b>\n\tPeter:\tCAN YOU WALK ON IT NOW?\n\n\tRoger:\tYOUR DAMN RIGHT, I CAN...DAMN RIGHT, I CAN!\n\n\tThe wounded trooper struggles to wrap the bloody part of his leg\n\twith a torn off piece of trouser. He can hardly keep from\n\tscreaming, and his words come out sharply and with great breaths\n\tbetween them.\n<b> \n</b>\tRoger:\tI STOP MOVIN' THIS LEG...MAY NOT EVER GET IT GOIN'\n<b>\t\t\tAGAIN...THERE'S A LOT TO GET DONE BEFORE...BEFORE\n</b><b>\t\t\tYOU CAN AFFORD TO LOSE ME...\n</b>\n\tThe big Black man stares at his friend for a moment. Then he\n\tdrives on to the warehouse escorted by the chopper.\n\n486\tThere is now a huge trailer truck at each of the four main\n\tentrances to the mall. They are very close to the doors, if not\n\tcompletely flush. Some of the glass portals can be opened not\n\tslightly, but not enough for the Zombies inside to pass through.\n\n487\tIn the parking lot, the creatures mob around the trucks,\n\tfrustrated that they cannot pass into the building. They clutch\n\tand claw at the enormous vehicles but to no avail. Some try to\n\tclimb up onto the cabs. Others try to claw at the doors on the\n\ttrailers.\n\n488\tSome creatures are crawling under the rigs: When they reach the\n\tmall doors they cannot stand, so they have no leverage. The\n\tcreatures inside are pushing the doors out, so the Zombies under\n\tthe trucks cannot push them in. The doors swing both in and out,\n\tso it is very clear that some access could be had by the\n\tcreatures if they were more organised.\n\n\tOne creature, having crawled under a trailer, does manage to\n\tpush open a mall door. The thing crawls into the building\n\tthrough the legs of other ghouls which are trying to exit. They\n\tbehave as a swarm of insects.\n\n\tThe revolving door offers the best access for the creatures,\n\talthough its inherent complexity is baffling to their empty\n\tbrains. Two creatures do manage to crawl under the truck which\n\tblocks the revolving door, and one of them negotiates the\n\trotating action and enters the concourse.\n\n489\tPeter and Stephen are huddled over the maps of the building.\n\tThey are back in the crawl space. The cartons are still piled\n\tagainst the firestair entrance.\n\n\tPeter:\tIT ALL DEPENDS ON HOW MANY OF THEM ARE STILL\n<b>\t\t\tINSIDE. THAT'S A LONG HAUL BETWEEN THOSE ENTRANCES.\n</b>\n\tSteve:\tWELL IF WE CAN GET SOME MORE FLARES...OR MAYBE\n<b>\t\t\tSOME OF THOSE PROPANE JOBS.\n</b>\n\tPeter:\tTHE GUNS ARE FIRST. GUNS AND AMMUNITION.\n\n490\tRoger moans with pain. Nearby, Fran is applying a dressing to\n\this leg. The wound is wrapped with several layers of cloth. The\n\tfirst aid kit is open on the floor. Peter crouches near his\n\tfriend. He takes over from Fran. He ties more strips tightly\n\taround the wound and around the upper thigh.\n\n\tPeter:\tYOU SURE YOU GONNA MAKE IT, BUDDY?\n\n\tRoger:\tJUST HURRY UP WITH THAT!\n\n491\tAgain, the military music. A tall figure drops out of a ceiling\n\tgrid and lands on the floor of the Sporting Goods Store. It is\n\tPeter. His rifle is slung and there is an empty pack on his\n\tback. Several of the Maintenance Room key rings are strapped\n\tinto his belt.\n\n492\tSuddenly a Zombie charges across the room. The gate to the mall\n\tbalcony is open on this store. Another creature, attracted by\n\tthe commotion, starts through the open entrance arch.\n\n493\tStephen is starting down through the ceiling grid. He also has\n\tequipment strapped onto his body. He sees the charging creature.\n\tPeter is trying to unsling his rifle. Stephen conquers his fear\n\tof the height, and lets himself fall to the floor. He crumples\n\tup when he hits, and rolls into a store exhibit, knocking things\n\tflying.\n\n\tPeter manages to level off his gun and shoots the rushing\n\tcreature. Stephen regains his footing. The second creature is\n\tmoving up the aisle. Stephen grabs a powerful crossbow from a\n\tnearby exhibit. It is loaded. It fires with a strumming sound\n\tand the small shaft rips cleanly through the creature's skull\n\tand imbeds itself in a wall beyond. The Zombie walks forward a\n\tfew steps before it falls.\n<b> \n</b>494\tThe men run toward the entrance arch. Leaping up on an adjacent\n\tcounter top, Peter manages to reach the lip of the roll gate and\n\the swings it down fast. Stephen catches the cage below and slams\n\tit into place just as another ghoul falls against it moaning and\n\tclawing.\n\n\tStephen unslings his gun and is about to level it off on the\n\tcreature outside. Peter jumps down from the counter.\n\n\tPeter:\tDON'T TRY TO SHOOT THROUGH THOSE GATES.\n<b>\t\t\tOPENINGS ARE TOO SMALL. BULLET'LL WIND UP\n</b><b>\t\t\tCHASIN' US AROUND IN HERE.\n</b>\n\tThe Zombie crashes all its might against the metal cage.\n\tStephen startles.\n\n\tPeter:\tHE CAN'T GET THROUGH...COME ON...\n\n495\tThe men crash back through the store and Peter moves right to\n\tthe racks of weapons. He pulls down a gorgeous high powered\n\trifle which is equipped with a sophisticated scope for sighting.\n\n\tPeter:\tAIN'T IT A CRIME!\n\n\tSteve:\tWHAT?\n\n\tPeter:\t(looking through the telescope)\n<b>\t\t\tTHE ONLY PERSON WHO COULD EVER MISS WITH THIS\n</b><b>\t\t\tGUN...IS THE SUCKER WITH THE BREAD TO BUY IT.\n</b>\n496\tThe cross hairs of the telescope zero in on the enlarged\n\tforehead of the Zombie, which is thrashing against the roll\n\tgates. The sight gives up a sense of the super-weapon's lethal\n\taccuracy.\n\n497\tStephen dives into the ammunition and moves behind the counter\n\twhere he pulls out boxes of shiny new hand guns.\n\n\tPeter finds elaborate holsters and ammunition belts. He pulls\n\tseveral other rifles from the rack. We recognise the firepower\n\tin the arsenal that the two men accumulate.\n\n498\tOther Zombies appear at the gate, but they cannot break in.\n\n499\tPeter:\t(at the creatures)\n<b>\t\t\tYOU JUST WAIT OUT THERE, SISSIES...\n</b><b>\t\t\tWE COMIN'...AND WE READY!\n</b>\n500\tWith a swell in the music, the band of all four humans charges\n\tout of the Maintenance corridor and makes a break for the\n\tDepartment Store. They all wear new double holsters containing\n\thand guns. Each has a rifle strapped over his shoulder and\n\tanother in hand. They wear ammo belts and carry packs with\n\tother supplies. The wounded Roger is sitting in the big\n\tgardening cart which Peter earlier used to carry the first\n\tsupply load out of the store. Peter runs, pushing the cart\n\tbefore him.\n\n\tThere are only a few creatures on the balcony. The dead things\n\tturn in confusion at the sound of the attacking commandos.\n\tRoger, his hands free to shoot, fires his weapon several times\n\tat some of the creatures who are closest.\n\n501\tThe creatures from the main concourse below begin to move up\n\tthe stationary staircase and struggle with the escalators.\n\tThe corpses of creatures slain in the earlier battles still\n\tclutters in the area.\n\n502\tFran and Steve are the first to reach the entrance to the \n\tDepartment Store. Steve falls immediately on the gate locks.\n\tPeter pulls up to a screeching halt at the gate. He turns the\n\tcart in a full 180 so that Roger is facing out toward the mall.\n\n\tSteve fumbles with the second lock. Peter faces the few Zombies\n\twhich are converging along the balcony. He lift his new\n\tSuper-gun and stares through the scope. The gun roars\n\teloquently. Even its sound pronounces its power. The single\n\tshot rips cleanly through the centre-forehead of one of the\n\tcreatures.\n\n\tThe man aims at another head. Blam. Another perfect kill. Then a\n\tthird. Roger fires several times.\n\n\tFran stands ready at the roll gate. As Stephen finishes with the\n\tfinal lock, the woman pushes against the cage and it starts up.\n\tSteve stands, and the two roll the cage into the ceiling, but\n\tStephen is careful not to let it get out of his grasp.\n\n\tFran moves into the store and Peter pulls the cart behind him.\n\tThen Steve, Peter and Fran pull the gate shut long before any of\n\tthe advancing creatures reach the area.\n\n503\tAgain, the Zombies smash into the cage, but the humans are\n\talready running through the aisles of the big store.\n\n504\tPeter wheels Roger into the elevator and hits the button for the\n\tfirst floor. The doors shut and the car starts down.\n\n\tPeter:\tHOW'S THE RIDE?\n\n\tRoger:\tKIND BUMPY. WATCH IT.\n\n\tThe stern Black face stares down at the back of the wounded\n\tman's head. Despite his attempt at humour, the stiffness in\n\tRoger's body evidences his pain. Peter puts his hand squarely\n\ton the Trooper's shoulder.\n\n\tPeter:\tLOOK HERE...I...\n\n\tRoger:\tI KNOW, I KNOW...SHUT UP.\n\n\tSomething very serious is shared between the two men, some\n\tknowledge which we do not fully understand. We do see the\n\tkind of bond shared by soldiers in a battle.\n\n505\tThe elevator doors glide open and Peter pushes the cart out\n\tinto the first floor on the big store.\n\n506\tFran and Stephen charge down the store escalator moving faster\n\tthan the steps themselves.\n\n507\tThey run through the hardware department where Stephen snatches\n\tup several propane torches. Fran stuffs extra bottles of gas\n\tinto her back pack.\n\n508\tWith a great hiss one of the propane nozzles spits a white-hot\n\tflame as it is lit with a new disposable lighter. Fran holds\n\ttwo torches as Stephen lights them.\n\n509\tPeter steps up to the first floor entrance gate with Roger in\n\tfront of him. Several creatures outside of the cage fly into\n\tsudden frenzy at seeing the humans. They slam against the grid\n\tbut it holds as usual.\n\n\tPeter:\tUNLOCK THE MIDDLE ONE LAST.\n\n510\tSteve falls on the right hand lock with his keys. The Zombies\n\tall converge near the crouching man's side of the gate. They\n\tpush and shove. Fran holds one of the lit torches very close and\n\tthe creatures back away cringing. The lock opens and Steve moves\n\tto the extreme left.\n\n\tAgain the Zombies follow and again Fran is ready with the torch.\n\n\tPeter:\tALRIGHT...THE TOUGHEST PART'LL BE GETTIN'\n<b>\t\t\tBY THESE RIGHT HERE...\n</b>\n\tSteve:\tIT'S A LONG HAUL DOWN TO THE ENTRANCE.\n\n511\tPeter cranes his neck to see past the Zombies and down the\n\tconcourse. Several other creatures are starting toward the\n\tDepartment Store. Behind them, about three hundred feet away, is\n\tone of the main entrances which is blocked off outside by a\n\ttruck trailer.\n\n512\tPeter:\tWE'LL BE ALRIGHT!\n\n\tFran:\tIT'S TOO FAR!\n\n\tPeter:\tTHERE'S NO BACKIN' OUT NOW. WE GOTTA LOCK\n<b>\t\t\tTHOSE DOORS!\n</b>\n\tFran:\tWE'LL NEVER MAKE ALL FOUR. IT'S TOO RISKY.\n\n\tSteve:\tYOU JUST STAY HERE AND BE READY TO UPEN UP FOR US.\n\n\tFran:\tTHE CAR!\n\n\tPeter:\tWHAT?\n\n\tFran:\tTHE CAR!\n\n513\tOutside, we see the slowly spinning exhibit which displays the\n\tnew automobile. It is a sleek, sporty model, which looks fast\n\tand manoeuvrable.\n\n514\tPeter looks down at Roger.\n\n\tPeter:\tYOU OK TO START IT?\n\n\tRoger nods and reaches for his supply pack. He is cringing\n\twith pain, but he moves efficiently.\n\n515\tThe Zombies clutch at the gate with new vigour. At the unlocked\n\tends the grid gives a little, but still holds the creature out.\n\tFran waves the torches closer and the creatures back away.\n\tSteve un-locks the middle lock.\n\n\tSteve:\tIT'S GOIN' UP!\n\n516\tThe gate swings up with a thunderous roar. The Zombies attack\n\tbut Fran's torches make them hold back slightly. Steve grabs\n\tone of the propane canisters with one hand and draws a pistol\n\twith the other. Fran draws a hand gun also. The two fire into\n\tthe pack of Zombies. One or two fall. The others try to move\n\tin but are afraid of the bright flames. One gets close to Steve\n\tbut the man blasts his torch directly into its face. Its hair\n\tcatches on fire and the creature throws itself wildly about,\n\tknocking other Zombies back.\n\n517\tNow Peter sees an opening and he makes a break with the cart.\n\tRoger holds on to the sides. They crash through the scattered\n\tpack of ghouls successfully and Peter makes for the car exhibit.\n\tThere are a few creatures on the concourse on the cart's path.\n\n\tPeter:\t(shouting)\n<b>\t\t\tCLOSE THE GATE...CLOSE THE GATE...\n</b>\n518\tSteve grabs the lip of the roll cage and it starts down. Fran is\n\tstill inside the store with one of the torches.\n\n\tFran:\tTHE KEYS, STEPHEN...THE KEYS!\n\n\tSteve tries to stop the downward progress of the gate but it\n\tslams shut with a metallic crash.\n\n\tFran:\tJESUS CHRIST!\n\n519\tPeter stops in his tracks when he hears the woman's shouts. He\n\tlooks back. Several of the creatures have followed the cart.\n\tThey advance slowly.\n\n520\tSeveral have stayed with Stephen, however, and they approach\n\tStephen as he tries to pass the keys back through the gate.\n\tThe big ring doesn't fit through the small openings.\n\n\tSteve:\t YOU MOTHER!\n\n\tFran:\tKEEP 'EM...JUST KEEP 'EM...LOOK OUT!\n\n\tThe Zombies at Stephen's back are very close. Steve lunges at\n\tthem with his torch. They back off slightly.\n\n521\tPeter:\tCOME ON, MAN! GET OUTA THERE!\n\n\tThe creatures on the concourse are approaching the cart. A\n\tpained Roger levels off several shots, but he is very shaky from\n\this extreme pain. He manages to down one of the Zombies.\n\n522\tFran:\tSTEPHEN...FOR GOD SAKE...\n\n\tThe woman holds up her torch so that the bright flame faces the\n\tghouls. Stephen crouches and puts a key in the right hand lock.\n\tThe Zombies converge on him.\n\n523\tPeter, seeing other creatures drawing near, starts to push the\n\tcart again. he manages to dodges two little clusters of the\n\twalking dead.\n\n524\tThe lock clicks just as one bold creature grabs Stephen from\n\tbehind, Fran tries to aim her torch closer. It disarms the\n\tZombie for a moment, Stephen thrashes his body back knocking\n\tthe think off balance. Then he quickly slides the keys under\n\tthe gate which he can lift just high enough with the single\n\tlock undone.\n\n\tAnother ghoul grabs Steve from behind. This time Steve's torch\n\tis knocked flying and rolls away. Fran is desperate. She tries\n\tto aim her pistol but cannot shoot through the grill. She holds\n\ther torch high.\n\n\tSteve kicks and scrambles, rolling on the floor. The Zombies\n\tare on him. He manages to knock one or two of them to the\n\tfloor. Then he fires with his pistol, killing another, He\n\tcrawls to the torch and grabs it, the creatures clutching and\n\ttugging at his pants and shirt.\n\n\tHe brings the flame up and flashes it at the Zombies. They back\n\taway enough for him to crawl to an open space. Then he scrambles\n\tto his feet and charges down the concourse toward the car.\n\n525\tAt the exhibit, Peter stops the cart. There are two of the\n\tlumbering creatures close at hand. The big trooper raises his\n\trifle. Roger, using all his strength, manages to pull himself up\n\tout of the cart. He lips to the exhibit as Peter fires at the\n\toncoming ghouls. The super-gun scores two perfect hits.\n\n526\tAs Roger tries to step onto the spinning platform, he falls and\n\trolls against the car. The turntable carries him around toward\n\tanother creature. He is struggling in pain toward the driver's\n\tdoor of the vehicle.\n\n527\tSteve, who is approaching at a run, sees the action.\n\n\tSteve:\tWATCH IS ROGER...ROGER!\n\n528\tRoger turns his head and sees the ghoul just before the creature\n\tgrabs him. The things hands clutch at the wrapped wound, which\n\tis already leaking blood through its dressing. Roger screams\n\tloudly.\n\n529\tPeter jumps up onto the spinning turntable, leans across the\n\thood of the car. His super-gun drills a hole through the\n\tcreature's skull. It falls off the exhibit.\n\n530\tPeter hurriedly comes around to Roger's side. In extreme pain,\n\tthe Trooper is desperately trying to open the driver door. Peter\n\thelps him. The door opens and Peter eases his friend into the\n\tseat. Roger immediately goes to work under the dash.\n\n531\tZombies are advancing now from all over the concourse.\n\n532\tPeter:\tGET IN!\n\n\tHe is shouting at Stephen who is just rushing up to the\n\tplatform. He and the Trooper scramble into opposite sides of the\n\tback seat. They slam the doors and make sure that all buttons\n\tare locked. Roger works as quickly as he can.\n\n533\tSeveral of the lead creatures reach the turntable. Some fall\n\ttrying to step onto the moving disc, but others manage to\n\tstruggle over to the car. They smash the windows with their\n\thands. It is a nightmarish scene as the men huddle in the\n\tshiny, new car which spins very slowly in circles.\n\n534\tFran has relocked the one open gate mechanism, and she stands\n\tnow trying to see the action, but it is out of her line of\n\tvision. She can only hear the moaning of the creatures, and\n\tpounding on the car. She turns the valve on her propane nozzle\n\textinguishing the flame.\n\n535\tThe car's engine roars as Roger is able to jump the wires.\n\n\tSteve:\tI'LL DRIVE IT...\n\n\tRoger:\tI GOT IT.\n\n\tThe Trooper's face contorts in agony as he moves himself into\n\tposition behind the wheel. He is shaking, but he bites his lip\n\tand slams the car into gear. There are at least eight creatures\n\tcrawling over the car, more approach. The platform spins. Roger\n\twaits until the car is aimed directly down the concourse. The\n\tmen in the back seats are alert to the Zombies which pound at\n\tthe windows. The ugly and distorted faces press close against\n\tthe safety glass.\n\n536\tNow the car pulls out quickly. It rolls of the edge of the\n\tspinning display, knocking several of the creatures aside. The\n\tfront wheels move off the platform and bounce onto the floor,\n\tbut the frame of the car scrapes the top of the disc and is\n\tstuck for a moment. The disc spins on carrying the rear of the\n\tcar with it. Then Roger gives it more gas. The rear wheels spin\n\tand finally catch.\n\n537\tThe car shoots out onto the mall floor. Some of the Zombies\n\tcling for a moment, but they fall away quickly, scrambling to\n\tregain their footing and follow.\n\n538\tThe car swerves and for an instant seems as though it will\n\tcrash against the columns on the concourse. Roger manages to\n\tcontrol it, and the shiny vehicle zooms ahead with tremendous\n\tenergy.\n\n539\tOne of the stray creatures in the concourse tries to intercept\n\tthe speeding auto, but the car knocks him mercilessly aside as\n\tthough he were a bowling pin.\n\n540\tFran sees the car as it rounds the corner, heads directly for\n\tthe main entrance which she can see from her position.\n\n541\tThe Zombies at the entrance already started back into the mall\n\tattracted by the commotion. The car zooms down the concourse\n\teasily breaking their ranks.\n\n542\tRoger throws the manoeuvrable vehicle into a screeching\n\ttailspin, stopping just at the doors.\n\n543\tThe big trailer blocks the entrance effectively. There are some\n\tcreatures inside the doors. Under the van, several Zombies are\n\tstruggling with the doors. one is just pushing in and seems as\n\tthough it will be able to enter.\n\n544\tPeter and Stephen slam against the door. Stephen aims his torch\n\tdirectly at the crawling creatures. The one in front withdraws\n\tits arm. The grotesque things writhe, kick under the truck. The\n\tdoor slams and Peter produces another set of master keys. They\n\tare all coded. he falls on the lock mechanism.\n\n\tPeter:\tTHAT'S NOT 100%, BUT I DON'T THINK THEY'LL GET\n<b>\t\t\tTHROUGH.\n</b>\n\tSteve:\tCAN'T THEY SMASH THE GLASS?\n\n\tPeter:\tSAFETY STUFF...PRETTY INDESTRUCTIBLE...THEY GOT\n<b>\t\t\tNO LEVERAGE UNDER THE TRUCK.. GIMME THE ALARMS...\n</b>\n545\tSteve rummages in his back pack. Produces two portable battery\n\toperated burglar alarms. Peter activates the units, stands them\n\tagainst the base of the now locked doors. As he crouches near\n\tthe glass, creatures outside go into a frenzy clawing at the\n\tglass doors. They cannot get in.\n\n\tPeter:\tI'M HOPIN' THEY'LL JUST GO AWAY AFTER THEY FIND\n<b>\t\t\tTHEY CAN'T GET IN...\n</b>\n546\tThe creatures moving slowly down the concourse are now getting\n\tclose to the action.\n\n547\tThe men hop back into the car, it roars off with Roger still at\n\tthe wheel.\n\n548\tAgain the sleek auto rips through the ranks of the advancing\n\tZombies. They fall and scatter.\n\n549\tThe car speeds down the concourse, turns the corner near where\n\tFran watches at the Department Store game. We hear Steve's voice\n\ton the woman's walkie talkie.\n\n\tSteve:\tWE'RE OK...WE GOT IT MADE...IT'GONNA WORK.\n\n\tFran stares out through the roll cage. The Zombies are\n\tstaggering weakly after the car.\n\n550\tWith another tailspin, the auto pulls up at the second set of\n\tdoors. The men scramble out of the back seat, the Zombies\n\toutside try to crawl under the second trailer. The men shut them\n\tout easily, locking the door and planting alarms. They stand to\n\tlook down the concourse.\n\n551\tThe creatures seem even more spread out now.\n\n\tSteve:\tHOW MANY YOU FIGURE ARE ALREADY IN...\n\n\tPeter:\tDUNNO. NOT TOO MANY. WE'LL GET 'EM EASY. WE\n<b>\t\t\tGET IT ALL LOCKED OFF AND WE'RE GOIN' ON A HUNT!\n</b><b>  \n</b>\tThe big Trooper raises his super-gun and sights through the\n\ttelescope.\n\n552\tAs we see through the scope, cross hairs settle on the forehead\n\tof one of the creatures which is lumbering down the hall. The\n\tface is magnified, distorted by the telescope. The gun roars and\n\tthe head in the scope explodes with red.\n\n553\tThe creature falls against a column, hit squarely through the\n\tbrain. We sense the supreme accuracy of the magnificent weapon.\n\n554\tIt is night. The Zombies in the parking lot still group around\n\tthe semis. They set up an eerie moaning in the moonlight. A slow\n\tpiece of music starts to build.\n\n555\tThe creatures crawl under the trucks but cannot enter the mall.\n\tThey pound and scratch at the doors, to no avail.\n\n556\tFrom inside the concourse, the mob is muffled. Even the\n\trevolving door is locked now. It seems the most vulnerable, but\n\tthe crawling creatures cannot quite get leverage to smash the\n\tglass panels and they have no tools to pound with.\n\n\tThe auto is flush against the revolving doors inside, offering\n\tadded protection. Several alarm units sit atop the car. They\n\tare the early warning devices against penetration.\n\n557\tThey camera starts to dolly back, the music builds. We see slain\n\tcorpses of many Zombies lying askew in various parts of the\n\tbuilding. It is like a battlefield after a war.\n\n558\tThe humans appear on the second storey balcony. Moving to the\n\trailing, looking down to the expanse of the building. They are\n\tguerrilla fighters, with their weapons strapped on. They have\n\ttaken the Temple. The music hits a crescendo as the people look\n\tover their spoils. Even the wounded Roger seems triumphant as he\n\tlimps to the rails, supporting himself on his arms.\n\n559\tWe see a spectacular shot of the full expanse of the building.\n\tZombies lie dead everywhere. The humans have captures the gold of\n\tthe Gods...In this case the Gods of Consumer Heaven.\n\n560\tPeter's hand is on the maps of the Maintenance Corridor. He is\n\tdrawing a line past the washrooms at the end of the hall near\n\tthe firestair.\n\n\tPeter:\tWE PUT UP THE WALL HERE. THERE'S NO DOOR FROM\n<b>\t\t\tTHE LAST OFFICE INTO THE WASHROOMS, SO NOBODY'LL\n</b><b>\t\t\tGET NOSEY...AND THIS WAY WE CAN STILL GET TO THE\n</b><b>\t\t\tPLUMBING...\n</b>\n\tSteve:\tWHY CAN'T WE JUST BOARD UP THE STAIRWAY. HELL,\n<b>\t\t\tTHEY CAN'T EVEN GET THROUGH A STACK OF CARTONS.\n</b>\n\tPeter:\tI'M NOT JUST WORRYIN' ABOUT THEM. SOONER OR\n<b>\t\t\tLATER MIGHT BE A PATROL THROUGH HERE...LOOTERS\n</b><b>\t\t\tMAYBE...I DON'T WANT ANYBODY TO EVEN KNOW THAT\n</b><b>\t\t\tSTAIRWAY EXISTS.\n</b>\n\tThey look back at the map.\n\n\tPeter:\tTHE DUCTWORK RUNS ALL THE WAY INTO THE WASHROOMS.\n<b>\t\t\tWE'LL HAVE TO GET IN AND OUT THAT WAY. WE'LL\n</b><b>\t\t\tBRING UP ANY BUG STUFF WE WANT BEFORE WE PUT UP\n</b><b>\t\t\tTHE WALL.\n</b>\n561\tThe men sit huddled. The large storage area is filled with\n\tmounds of supplies brought up from the mall stores, but the\n\tstuff all sits around in disarray.\n\n562\tBehind the wall of cartons, Roger seems to be sleeping, but he\n\tis sweating feverishly, and his face twitches. Fran has been\n\ttrying to soothe him with a wet cloth on his forehead. Now she\n\tstops, leaving the cloth on the shivering head. She moves out\n\tto Stephen and Peter.\n\n563\tFran:\tHE SEEMS TO BE SLEEPING.\n\n\tPeter:\tGOOD.\n\n564\tThe woman moves to where she has medical supplies on one of the\n\tcartons. There are bottles, vials and diabetic hypo syringes as\n\twell as bandages and dressings from the Pharmacy in the mall.\n\n\tFran:\tI DON'T KNOW WHAT ELSE TO DO...\n\n\tSteve:\tYOU'RE DOIN' FINE.\n\n\tFran:\tHIS LEG IS AWFUL...THE INFECTION IS SPREADING FAST.\n<b>\t\t\tCAN'T WE FLY HIM OUT OF HERE...TRY TO FIND A MED.\n</b><b>\t\t\tUNIT...\n</b>\n565\tSteve looks at Peter. The big trooper speaks softly.\n\n\tPeter:\tI'VE SEEN HALF A DOZEN GUYS GET BITTEN BY THOSE\n<b>\t\t\tTHINGS...NONE OF 'EM LASTED MORE THAN THIRTY SIX\n</b><b>\t\t\tHOURS.\n</b>\n566\tFran is stunned. Suddenly, Roger screams from behind the cartons.\n\n\tRoger:\tPETER...PETER...WHERE ARE YOU?\n\n567\tPeter:\tRIGHT HERE, BUDDY.\n\n568\tRoger is sitting up. His eyes look very dark and sunken. He is\n\tsweating even more profusely than before.\n\n\tRoger:\tYEAH...YEAH...\n\n\tHe licks his lips. He looks around the vast, barren room, trying\n\tto clear his eyesight.\n\n569\tOutside, Fran sits on a carton. The men are still huddled\n\taround the spoils. Roger occasional shouts from the other\n\troom.\n\n\tRoger:\tWE DID IT, HUH, BUDDY? WE WHIPPED 'EM.\n\n\tPeter:\tTHAT'S RIGHT ROG.\n\n\tRoger:\tDIDN'T WE? PETER? DIDN'T WE WHIP 'EM?\n\n\tPeter:\tWE SURE DID, BUDDY.\n\n\tRoger:\tWE WHIPPED 'EM AND GOT IT ALL! WE GOT IT ALL!\n\n\tThe man's voice sounds pathetic as it echoes through the big\n\tstorage area bouncing off barren walls.\n\n570\tA hammer slams into nails behind the fake wall which the people\n\tare working on. A great network of two-by-fours are braced at\n\tthe rear of the corridor, more lumber is wedged against walls\n\tmaking a frame. Stephen is slamming large nails into the\n\tframework for reinforcement. On the frame's face a masonite\n\tpanel is nailed into place on one side. Peter works in the\n\tcorridor. He is carefully nailing in a moulding which makes the\n\tnew partition look like a finished wall.\n\n\tIn the corridor, there are power tools lying about and a vast\n\tarray of other hardware in the gardening cart. Fran appears from\n\tout of the washrooms. She is carrying an old can of paint which\n\thas obviously been used.\n\n\tFran:\tTHIS MUST HAVE BEEN FOR TOUCH UP...IT LOOKS\n<b>\t\t\tPERFECT.\n</b>\n\tPeter grabs the can and pries it open quickly with a screw\n\tdriver. He dips his finger into the liquid and smears some onto\n\tthe new wall where it butts against the corridor. It is a\n\tperfect match.\n\n\tSteve:\t(to Fran) ANYTHING ELSE YOU WANT BEFORE WE CLOSE\n<b>\t\t\tIT OFF?\n</b>\n\tFran:\tNO...\n\n\tThe woman is staring down the corridor toward the mall proper.\n\n571\tThe corpses from the hall have been carried out of the way.\n\tThey are piled together at the corridor mouth on the balcony.\n\tIt is a grisly sight. Fran turns away.\n\n572\tFran:\tNO.\n\n\tShe steps back through the unfinished partition, leans against\n\tthe framework. Her hand goes to her mouth as she tries to choke\n\tback a gag. Steve moves up behind her, but she feels another\n\twave of nausea and she darts for the washroom. Steve sets down\n\this hammer and follows.\n\n573\tThe woman is kneeling on the floor, propped up by her hands on\n\tthe toilet seat. She is vomiting. Steve approaches quietly. His\n\thand falls on her back.\n\n\tFran:\tLEAVE ME ALONE...IT'S ALRIGHT...IT'S MY PROBLEM.\n\n\tSteve:\tFRANNIE...\n\n\tFran:\tJUST GET OUTA HERE, STEPHEN...I DON'T WANT YOU\n<b>\t\t\tHERE.\n</b>\n\tThe man doesn't move. Fran reaches up, taking his hand. She\n\tclutches it tightly, indicating that she is not angry.\n\n\tFran:\tI DON'T WANT YOU TO SEE ME THIS WAY...\n\n\tAnother wave hits her and she wretches again. She pulls her\n\thand back leaning over the toilet bowl.\n\n\tFran:\tPLEASE GO...I'M ALRIGHT...PLEASE...\n\n\tStephen stands up reluctantly and drift out of the room. The\n\twoman wretches but she is dry. She tries to swallow. Then sits\n\ton the floor next to the toilet holding her stomach. She\n\tfumbles with the flush handle, depressing it. The rushing water\n\tmakes an ugly sound. Fran looks down at her stomach thinking of\n\ther pregnancy.\n\n574\tStephen steps out of the unfinished framework. Peter is gazing\n\tdown the corridor at the pile of corpses.\n\n\tPeter:\tTHIS PLACE IS GONNA BE ROTTEN...WE GOTTA\n<b>\t\t\tCLEAN UP, BROTHER.\n</b>\n\tFlies buzz about the staring faces of the dead things on the\n\tbalcony.\n\n575\tPeter's hands are on the round hatch wheel of an enormous safe.\n\n\tPeter:\tTHEY'RE USUALLY ON A TIMER...OPEN AT\n<b>\t\t\tNINE...LOCKED AT FOUR...KEEPS THE BANKERS HONEST.\n</b>\n\tThe wheel spins and Peter swings the giant door open.\n\n576\tInside is a huge safety deposit vault of a bank. The men stand\n\tfor a moment in awe. The clean walls are lined with drawers and\n\tdoors where depositors have stored their valuables. At one end\n\tof the room there are stacks and stacks of paper bills. The men\n\tapproach the piles of money, stooping down.\n\n\tThey each pick up packets of bills and flip through the edges...\n\n\tPeter stuffs several packets into his knapsack. Steve looks at\n\thim quizzically.\n\n\tPeter:\tYOU NEVER KNOW, BROTHER.\n\n\tSteve takes several stacks and stuffs them into his kit. He\n\tlooks about the enormous vault.\n\n\tSteve:\tDON'T YA WONDER WHAT THE ARCHAEOLOGISTS ARE GONNA\n<b>\t\t\tTHINK...GUYS IN THE FUTURE...DIGGIN' THE PLACE\n</b><b>\t\t\tUP. IMAGINE ALL THE STUFF IN THESE BOXES...\n</b><b>\t\t\tJEWELLERY...MAYBE THEY'LL FIGURE IT'S ALL SOME\n</b><b>\t\t\tKIND OF OFFERING TO THE GODS...LIKE IN THE\n</b><b>\t\t\tPYRAMIDS...A BURIAL CHAMBER.\n</b>\n\tPeter:\tTHAT'S EXACTLY WHAT IT IS, NOW.....\n\n577\tWe see the men wheeling gardening carts piled with corpses. The\n\tsombre image is shocking as the figures move in silhouette\n\tagainst the bright store fronts with their displays of goods\n\tdesigned to attract shoppers to the sweet life the items\n\tpretend to represent.\n\n578\tAt the bank, Peter wheels a cart with several dead Zombies\n\tthrough the lobby.\n\n579\tIn the vault, the big Trooper dumps bodies out on top of\n\tseveral others, already deposited. The corpses lie askew, their\n\tarms and legs protruding. The stacks of money are upset by the\n\tlimp action of the bodies as they roll around.\n\n580\tA finger flips a switch and we hear the mall music start up\n\tslowly.\n\n581\tWe see a montage: Fran, Stephen and Peter walk slowly through\n\tthe conquered building. They drift in and out of stores picking\n\tup various items. They use shopping carts.\n\n582\tFran rummages idly through the cosmetic department.\n\n583\tPeter looks through a book store.\n\n584\tStephen plays the pinball machines in a huge game room.\n\n585\tPeter tries on big colourful hats in front if a mirror.\n\n586\tFran trims Stephen's hair as he sits in the mechanical chair of\n\tthe mall Barber Shop.\n\n587\tFran feeds the animals in the Pet Store, then with a bag of seed,\n\tshe feeds the Tropical Birds in the tall cage out on the\n\tconcourse. The birds flutter, flap about, screeching loudly.\n\n588\tNow the group walk along the upper balcony. They look down.\n\tThey still have their weapons and kits, Peter is wearing a wide\n\tbrimmed hat and Fran sports a new mink coat.\n\n589\tThe concourse is empty now of corpses, but the group can hear\n\tthe moaning and thumping at the main entrances. It is dark\n\toutside, the creatures claw at the doors but cannot be seen in\n\tthe shadows under the big trailer trucks. The sound evidences\n\ttheir presence, however.\n\n590\tThe people stand at the balcony railing overlooking their realm.\n\n\tFran:\tTHEY'RE STILL HERE.\n\n\tSteve:\tTHEY'RE AFTER US...THEY KNOW WE'RE IN HERE.\n\n\tPeter:\tTHEY'RE AFTER THE PLACE...THEY DON'T KNOW\n<b>\t\t\tWHY...THEY JUST REMEMBER...REMEMBER THAT\n</b><b>\t\t\tTHEY WANNA BE IN HERE!\n</b>\n\tThe noise at the entrance continues eerily. Fran starts to be\n\tafraid.\n\n\tFran:\tWHAT THE HELL ARE THEY?\n\n\tPeter:\tTHEY'RE US, THAT'S ALL. THERE'S NO MORE\n<b>\t\t\tROOM IN HELL.\n</b>\n\tSteve:\tWHAT?\n\n\tPeter:\tSOMETHIN' MY GRANDADDY USED TO TELL US...YOU\n<b>\t\t\tKNOW MACUMBA? VOODOO... GRANDADDY WAS A PRIEST\n</b><b>\t\t\tIN TRINIDAD. USED TO TELL US...WHEN THERE'S NO\n</b><b>\t\t\tMORE ROOM IN HELL...THE DEAD WILL WALK THE EARTH.\n</b>\n591\tRoger is screaming wildly. He is sweating and his face looks\n\tsunken with an ashen colour. He thrashes about as Steve tries to\n\thold him. His leg is swollen, almost all black. His arm, which\n\twas also bitten, is wrapped but oozing.\n\n\tSteve:\tGET MORE VALIUM IN HIM...\n\n\tFran fumbles with one of the hypodermics, but she drops the vial\n\tof serum and it shatters on the floor.\n\n\tSteve:\tGET ANOTHER ONE...COME ON...\n\n\tRoger is throwing himself about wildly. Steve barely manages to\n\thold on. Fran rushes into the other room.\n\n592\tThe space is starting to look like living quarters. There is\n\tfurniture. There are sectioned off areas with things still\n\tpacked in cartons, but it is beginning to look like home.\n\n593\tThe woman rushes to the medical supply area which is now more\n\torganised with little cabinets and a small refrigerator. She\n\ttakes a new vial of serum from the freezer.\n\n594\tDownstairs, Peter is checking the covering at the floor base of\n\tthe fake wall. He hears the violent screaming from above.\n\n595\tHe climbs up a rope ladder in the ceiling, scrambles through the\n\tgrill in the ceiling, enters the duct. Then he pulls up the\n\tladder and closes the grill.\n\n596\tHe crawls through the tight space for a few feet, and drops out\n\tof another grill into the washroom.\n\n597\tHe moves through the internal corridor and into the firestair. \n\n598\tAll the while, Roger's screaming can be heard. Peter tramps up\n\tthe stairs several at a time.\n\n599\tHe rushes through the living space in the direction of the\n\tscreams.\n\n600\tFran is withdrawing a hypodermic from Roger's good arm. The man\n\tstill thrashes wildly. Steve is struggling to hold him. Peter\n\trushes in and helps. Fran drifts out of the room.\n\n\tAfter a short time Roger relaxes somewhat.\n\n\tPeter:\t(to Steve) GO ON...I'LL STAY WITH HIM.\n\n\tSteve leaves the area.\n\n601\tIn the living spaces, Fran is sitting in a chair. It is the\n\tinflatable kind, which can be collapsed like a balloon. Steve\n\tcomes up to her and puts his arms around her neck from behind.\n\tShe cups his hands with hers and holds them tightly. She stares\n\toff across the room.\n\n602\tRoger catches his breath and looks up at Peter. He licks his\n\tlips and tries to speak coherently.\n\n\tRoger:\tYOU...YOU'LL TAKE CARE OF ME, RIGHT, PETER?\n<b>\t\t\tYOU'LL TAKE CARE OF ME...WHEN I GO...\n</b>\n\tPeter:\tI WILL.\n\n\tRoger:\tI DON'T WANNA BE WALKIN' AROUND LIKE THAT PETER...\n<b>\t\t\tNOT AFTER I GO...I DON'T WANNA BE WALKIN' AROUND\n</b><b>\t\t\tLIKE THAT...\n</b>\n\tThe man's eyes are terrified. He looks this way and that at the\n\twalls, the ceiling, at Peter...He can't focus...\n\n\tRoger:\tPETER? PETER?\n\n\tPeter:\tI'M HERE, TROOPER.\n\n\tRoger:\tYOU'LL TAKE CARE OF ME...I KNOW YOU WILL...\n\n\tPeter:\tI WILL.\n\n\tRoger:\tPETER?\n\n\tPeter:\tYEAH, BROTHER.\n\n\tRoger:\tPETER, DON'T DO IT...TIL YOUR SURE...SURE I'M COMIN'\n<b>\t\t\tBACK...DON'T DO IT TIL YOU'RE SURE...I MIGHT NOT\n</b><b>\t\t\tCOME BACK, PETER...I'M GONNA TRY NOT TO...I'M\n</b><b>\t\t\tGONNA TRY...NOT TO COME BACK...\n</b>\n603\tLater, the moon shines down through the skylight in the living\n\tarea. A sturdy ladder has now replaced the pyramid of cartons\n\tup to the open hatch.\n\n604\tStephen fiddles with the television. There is a faint signal\n\tcoming in. He has the set wired to a makeshift antenna which\n\tstretches through the skylight. A table lamp sits on a small\n\tend table and is lit. Its cable is patched into a network of\n\twiring which stretches about the room.\n\n605\tFran is unpacking things. She is stacking dishes and silverware.\n\tIt is a very orderly scene. The couple looks like a pair of\n\tnewlyweds who have just moved into a new house.\n\n606\tOn the television, two men are talking, a commentator and an\n\tofficial of the Government. The Scientist is in a suit, but his\n\ttie is rumpled and his collar open. He has not shaved and he\n\tseems very tired and nervously upset.\n\n\tScientist:   I'VE GOT TO...BE CAREFUL WITH WORDS HERE...WE\n<b>\t\t\tHAVEN'T BEEN ABLE TO STUDY THEIR HABITS...WE'VE\n</b><b>\t\t\tREPEATEDLY ASKED FOR A LIVE CAPTURE SO WE CAN HAVE\n</b><b>\t\t\tCONTROLLED STUDY...WE NEED SUPPLY AND DEMAND\n</b><b>\t\t\tRATIOS.\n</b>\n\tComm.:\tYOU MEAN...THEIR NEED VERSUS...\n\n\tScientist:   VERSUS THE AMOUNT OF FOOD AVAILABLE. LETS BE BLUNT.\n\n\tThere is a commotion in the TV studio. We hear noises and\n\tshouting, as we did J.A.S. earlier.\n\n607\tSteve:\tJESUS CHRIST.\n\n\tHe squats near the set, staring. Fran comes up behind him.\n\n608\tScientist:   PROJECT OUT THEIR RATE OF GROWTH...THERE'S A\n<b>\t\t\tCRITICAL BALANCE...AND IT'S THE WASTE THAT KILLS\n</b><b>\t\t\tUS. LITERALLY...THEY USE...THEY USE MAYBE FIVE\n</b><b>\t\t\tPERCENT OF THE FOOD AVAILABLE ON THE HUMAN\n</b><b>\t\t\tBODY...AND THEN THE BODY IS USUALLY INTACT ENOUGH\n</b><b>\t\t\tTO BE MOBILE WHEN IT REVIVES. THERE'S AN ECOLOGICAL\n</b><b>\t\t\tIMBALANCE AND THEY'RE INCAPABLE OF UNDERSTANDING...\n</b>\n\tComm.:\tWHAT ARE YOU PROPOSING?\n\n\tScientist:   WE HAVE TO BE UNEMOTIONAL...WE HAVE TO PROVIDE\n<b>\t\t\tCOUNTER MEASURES OR WE'RE ALL...\n</b>\n\tComm.:\tCOUNTER MEASURES?\n\n\tScientist:   THEY CAN'T CONTROL THE RATE OF GROWTH AND CON-\n<b>\t\t\tSUMPTION...WE HAVE TO CONTROL IT FOR THEM!\n</b>\n\tComm.:\tYOU'RE SUGGESTING THAT WE HELP THEM?\n\n\tScientist:   BY HELPING THEM IN THIS CASE WE SAVE OURSELVES...\n\n\tA great outcry is heard in the studio. The camera bobbles\n\taround. The scientist is fumbling for words.\n\n609\tStephen:\tGOOD GOD.\n\n610\tIn the other room, Peter sits against a wall. He can hear the\n\ttelevision. His eyes stare straight ahead at something.\n\n\tScientist:   I'M PROPOSING THAT CERTAIN...NECESSARY MEASURES\n<b>\t\t\tBE PUT INTO EFFECT AT ONCE...MEASURES APPLYING TO\n</b><b>\t\t\tALL OFFICIAL SEARCH AND DESTROY UNITS, WHILE\n</b><b>\t\t\tTHEY'RE STILL OPERATIVE...HOSPITALS...RESCUE\n</b><b>\t\t\tSTATIONS...AND ANY...PRIVATE CITIZENS...\n</b>\n\tThe camera pulls off Peter's face. We see that his rifle is\n\tstretched across his lap. The TV drones on from the other room.\n\n\tScientist:   IN CO-OPERATION WITH THE MOBILE UNITS OF THE O.B.P.\n<b>\t\t\tTHE CORPSES OF THE RECENTLY DEAD SHOULD BE\n</b><b>\t\t\tDELIVERED OVER TO THE AUTHORITIES FOR COLLECTION\n</b><b>\t\t\tIN REFRIGERATED VANS...THEY SHOULD BE DECAPITATED\n</b><b>\t\t\tTO PREVENT REVIVAL...\n</b>\n\tWe see now what Peter is staring at. On the floor, twenty feet\n\taway lies the corpse of Roger. It's face is covered with a\n\tblanket. It lies very still.\n\n\tScientist:   THIS COLLECTION...THIS COLLECTION...\n\n\tThe man's voice is heard almost shouting over the voices from\n\tthe studio. The angry staff protests vigorously, with\n\temotional language...\n\n\tScientist:   THIS COLLECTION COULD BE...STORED...RATIONED...\n<b>\t\t\tFOR DISTRIBUTION AMONG THE INFECTED SOCIETY...\n</b>\n\tThe shouts of anger continue.\n\n<b>\t\t\tIN AN ATTEMPT...IN AN ATTEMPT TO CURB THE SENSELESS\n</b><b>\t\t\tSLAUGHTER...THE SENSELESS SLAUGHTER OF OUR OWN\n</b><b>\t\t\tSOCIETY...\n</b>\n\tSuddenly the dead Roger's foot seems to move under the blanket.\n\tPeter's eyes pick up the movement immediately. His hands\n\ttighten on his weapon.\n\n\tScientist:   THE DISSECTION...THE DISSECTION OF THE CORPSES CAN\n<b>\t\t\tBE CARRIED OUT...CARRIED OUT WITH RESPECT FOR THE\n</b><b>\t\t\tDIGNITY OF THE HUMAN BODY...\n</b>\n\tRoger's arms seem to move, in slight twitching motions...\n\n<b>\t\t\tTHE HEADS...THE HEADS AND THE ...SKELETONS...\n</b><b>\t\t\tWHENEVER POSSIBLE...COULD BE IDENTIFIED AND...\n</b><b>\t\t\tAND BURIED IN CONSECRATED GROUNDS...\n</b>\n\tThe commotion in the studio reaches a fever pitch.\n\n\tFrom the movement beneath, the blanket starts to creep down off\n\tRoger's face. Peter stares with fascination and disbelief.\n\tThe blanket clears the blankly staring eyes...the drooling\n\tmouth...Roger tries to sit up/ Peter's hands click a shell into\n\this super-gun.\n\n\tSuddenly, the corpse sits up. It stares at Peter, blankly at\n\tfirst, then with purpose...it starts to move towards the Trooper\n\twho calmly raises his weapon...\n\n611\tOn the TV, the commotion still rages. Stephen and Fran stare at\n\tthe tube, hardly believing what they see. The scientist is\n\tshouting above the din. He is nervous. He wipes his brow with\n\this sleeve...\n\n\tScientist:   WE'VE GOT TO REMAIN UNEMOTIONAL...UNEMOTIONAL...\n<b>\t\t\tRATIONAL...LOGICAL...TACTICAL! TACTICAL!\n</b>\n612\tSteve:\tTHEY'RE CRAZY...THEY'RE CRAZY...\n\n\tFran:\tIT'S REALLY...ALL OVER, ISN'T IT...\n\n\tBLAM! The loud roar of Peter's gun from the next room. Fran\n\tstartles and falls into Stephen's arms.\n\n613\tRoger's corpse is dumped on top of the stack of bodies in the\n\tBank vault. His eyes stare with a puzzled expression. The arms\n\tand legs of the other bodies make the room look like a\n\tRenaissance Painting of hell itself. There is the familiar\n\tgunshot wound in Roger's forehead.\n\n\tThe heavy door of the vault closes with a metallic slam which\n\techoes through out the mall.\n\n614\tA small puppy lifts its leg and urinates on a table.\n\n\tFran:\tADAM! NO NO!\n\n\tThe woman's hands reach into frame and grab the little animal.\n\tShe carries it through the room and drops it on some papers laid\n\tout in an unused part of the storage area.\n\n\tFran's stomach is big now, her pregnancy evident. She wipes her\n\tbrow like an exhausted housewife, and shuffles back into the\n\tliving area. She fumbles with the sheets on the double mattress\n\twhich she and Steve obviously share. There is an end table near\n\tthe bed, with a reading light. Books lie strewn around, along\n\twith magazines and half drunk cups of coffee.\n\n615\tIn the sitting room, we see a scene which could be comfortable\n\tsuburban. The furniture is neatly arranged. There is a small\n\tportable stove which operates on bottled gas, a refrigerator,\n\tand cabinets with dishes and silverware.\n\n616\tThere is a modern calendar on the wall, which has three months\n\tcrossed off. There are a variety of radio and TV units and a\n\tstereo record player. There are even decorations: paintings\n\thung, knick knacks on the tables. The room almost looks like a\n\twealthy man's den, with all the gadget-oriented affluence.\n\n617\tIn the Department Store, Stephen wanders about. He fiddles with\n\ta new supersonic calculator and he looks at adult games.\n\n618\tOn the roof, in the bright sun of early morning, Peter plays\n\ttennis against one of the shed walls. He's dressed in a new\n\tsweat suit with brightly coloured Addidas sneakers. He has a\n\tsleek new racquet, slamming phosphorescent balls with all his\n\tmight. His face is set in what is almost anger. He attacks each\n\tshot with determination and emotion.\n\n619\tOne of his shots misses the shed. The ball bounces and banks off\n\tthe lip of the roof, then it tumbles over the edge.\n\n620\tIn the parking lot below, the ball hits the pavement. It bounces\n\tseveral times, rolling off among the feet of the army of Zombies\n\twandering this way and that through the area.\n\n621\tThe creatures mob around the trucks at the main entrances. They\n\tmoan and gurgle, clawing at the building. There seem to be\n\thundreds of them, all different ages, sexes, shapes. Some\n\tclothed, some naked, some wounded, some almost untouched.\n\n622\tNow Fran, the pregnant housewife, is cooking supper.\n\n623\tThe men play cards with hundred dollar bills in the living space.\n\n624\tThe three sit around the dinner table, just finishing their\n\tsupper. The TV set is on, but only grey snow fills the screen\n\tand the speaker hisses as it receives no signal.\n\n\tFran:\tTHERE HASN'T BEEN A BROADCAST FOR THREE DAYS.\n<b>\t\t\tWHY DON'T YOU GIVE IT UP?\n</b>\n\tSteve:\tTHEY MIGHT COME BACK ON.\n\n\tFran angrily throws down her silverware and stomps over to the\n\tTV. She clicks it off. The woman returns to the table.\n\n\tSteve stands up and moves to the set. He clicks it back on.\n\tPeter watches the two sheepishly. It is a domestic scene. The\n\tgroup has become a family, with all the disadvantages of\n\tcomfortable living, including the inability to communicate.  \n\n\tFran:\tWHAT HAVE WE DONE TO OURSELVES?\n\n625\tThe thunderous roar of the helicopter engine. The machine is\n\thovering over the roof of the mall.\n\n626\tFran is at the controls. Steve sits in the passenger seat.\n\n\tSteve:\tOK, NOW EASY...EASY...BRING 'ER DOWN...\n\n627\tThe whirlybird starts down for the roof. It is somewhat\n\tunstable, but it eases down regularly.\n\n628\tIn the cockpit, a flustered Fran manages to handle the controls.\n\n\tSteve:\tEASY...STABILISE IT...THAT'S IT...\n\n\tThe woman reacts efficiently. She handles the controls better as\n\tThe chopper's runners are just about on the roofs surface.\n\n\tSteve:\tTHAT'S IT...THAT'S IT...YOU GOT IT!\n\n629\tThe runners hit the roof surface and the chopper settles.\n\n630\tFran throws her arms impulsively around Stephen's neck.\n\n\tSteve:\tYOU DID IT...YOU DID IT, HON...YOU DID IT...\n\n\tThe woman excitedly hugs and kisses Stephen with childish joy.\n\tShe is bubbling.\n\n631\tSeen from a great distance, the helicopter atop the mall looks\n\tvery small. Its engine dies and begins to whine.\n\n632\tA pair of binoculars is watching the action. The lenses pull\n\taway from a pair of beady eyes.\n\n\tVoice:\tTHEY MUST GET IN THROUGH THE ROOF.\n\n\tVoice:\tSON OF A BITCH!\n\n\tVoice:\tTHERE'S TRUCKS BLOCKIN' ALL THE ENTRANCES.\n\n\tVoice:\tNO SWEAT!\n\n\tVoice:\tWHAT DO YA THINK? HIT 'EM NOW OR WAIT\n<b>\t\t\tFOR TONIGHT?\n</b>\n\tVoice:\tTONIGHT.\n\n633\tWe see the short wave radio speaker installed in the living\n\tspace near the TV. A voice rattles over the unit:\n\n\tVoice:\tWE KNOW YOU'RE IN THERE...SEEN THE WHIRLYBIRD\n<b>\t\t\tON THE ROOF.\n</b>\n634\tFran steps to the doorway attracted by the signal. Peter sits at\n\tthe radio, not knowing whether to send. Steve listens.\n\n\tVoice:\tHEY, ER...COULD YA USE SOME COMPANY IN THERE?\n\n\tSteve is about to say something. Peter stops him.\n\n\tVoice:\tWE'RE JUST RIDIN' BY...WE COULD SURE USE\n<b>\t\t\tSOME SUPPLIES...WHAT'S THE CHANCE US\n</b><b>\t\t\tGETTIN' IN THERE TO STOCK UP?\n</b>\n\tPeter listens intently, trying to read the voice's inflections.\n\n\tVoice:\tHOW MANY OF YOU IN THERE, ANYWAY...THERE'S\n<b>\t\t\tTHREE OF US. COULDN'T YA USE THREE MORE GUNS?\n</b>\n\tPeter:\tRAIDERS.\n\n\tFran:\tWELL, THEY KNOW WE'RE HERE, MAYBE WE SHOULD...\n\n\tPeter:\t(cutting her off)\n<b>\t\t\tNO CHANCE.\n</b>\n\tThe little puppy scrambles up to Fran's feet, seeking attention.\n\tShe picks the little dog up in her arms.\n\n\tFran:\tWELL, IF THERE'S ONLY THREE OF THEM...\n\n\tPeter:\tWHO SAYS?\n\n\tThere's a long silence. The radio sputters static. Voices are\n\theard, but they aren't speaking into the microphone. They are\n\tobviously conferring among themselves. Steve starts to speak,\n\tPeter cuts him off.\n\n\tPeter:\tSHHHH! QUIET!\n\n\tHe is trying to hear the muffled conversation.\n\n\tFran:\tI THINK WE SHOULD...\n\n\tPeter:\tJESUS CHRIST, SHUT UP AND LISTEN!\n\n\tMore static. Slight laughter is heard. Steve looks into Peter's\n\tface. The bug trooper just stares at the speaker without moving.\n\tFinally, the voice again.\n\n\tVoice:\tHEY...YOU IN THE MALL...YOU JUST FUCKED UP\n<b>\t\t\tREAL BAD! WE DON'T LIKE PEOPLE WHO DON'T SHARE.\n</b>\n\tInstantly Peter grabs his weapon and straps on his holster.\n\n\tPeter:\tCOME ON, MAN...GET IT UP.\n\n635\tUnder the cover of darkness, a pair of hands stores a microphone\n\ton a portable radio unit. The radio is in a small van which is\n\tcluttered with junk. An arsenal of weapons is strewn about.\n\n636\tWe see several men, and a few women, huddling inside the van.\n\tThey look like banditos. One even wears a Mexican sombrero. The\n\tmen are armed to the teeth, wearing ammunition belts criss-\n\tcrossed on their chests. They are dirty and sloppily dressed in\n\tall sorts of surplus clothing.\n\n637\tOutside, in close-up shots, hands turn controls on big motor-\n\tcycles and feet stomp accelerators. The bikes roar, creating a\n\tthunderous sound. Clouds of dust and fumes rise into the air.\n\n638\tPeter and Stephen are running across the mall roof. The roar of\n\tthe cycles can be heard in the distance.\n\n639\tReaching the roof's edge, Peter stares off at the horizon, but\n\tsees nothing. The thunder draws nearer. Peter tries binoculars.\n\n640\tThrough the lenses are vague shapes in the darkness. As the\n\tsound swells, we see the riders. Their powerful bikes come\n\tcharging over a rise...two...then three more...three more...\n\tmore...\n\n\tThey are accompanied by two small vans. There are at least\n\tfifteen bikes. The sound is deafening.\n\n641\tPeter:\tJUST THREE, HUH?\n\n\tSteve:\tHOLY SHIT!\n\n\tPeter:\tTHEY'LL GET IN. THEY'LL MOVE THE TRUCKS.\n\n\tSteve:\tTHERE'S HUNDREDS OF THOSE CREATURES DOWN THERE.\n\n\tPeter:\tCOME ON, MAN. THIS IS A PROFESSIONAL ARMY.\n<b>\t\t\tLOOKS LIKE THEY BEEN SURVIVIN' ON THE ROAD ALL\n</b><b>\t\t\tTHROUGH THIS THING...DAMN! HOW MANY OF THE\n</b><b>\t\t\tSTORES ARE OPEN?\n</b>\n\tSteve:\tI DUNNO...SEVERAL OF 'EM...\n\n\tPeter:\tWELL LET'S NOT MAKE IT EASY FOR 'EM...COME ON!\n\n642\tThe men charge down through the skylight. The roar of the\n\tconvoy can now be heard in the living space.\n\n\tFran is desperate. Steve rushes by her with Peter, who crashes\n\ton ahead through the door onto the firestairs.\n\n\tFran:\tWHAT'S HAPPENING?\n\n\tSteve:\tTHERE'S FIFTEEN OR TWENTY OF 'EM...\n<b>\t\t\tWE'RE GONNA SHUT OFF THE GATES.\n</b>\n\tFran:\tSTEPHEN!\n\n\tSteve:\tWE'RE JUST GONNA SHUT THE GATES.\n<b>\t\t\tTHEY'LL NEVER FIND US UP HERE.\n</b>\n\tThe man disappears through the stairway door. Fran drops the\n\tpuppy which goes running after the men floppily.\n\n\tFran thinks to chase the dog, but instead moves to the storage\n\tarea and snatches her weapons. She starts to load her rifle.\n\n643\tOutside, the convoy makes a pass at one of the trucks. In the\n\tdarkness the Zombies clutch at the fast bikes. The raiders\n\tfire their guns, dropping several of the creatures.\n\n\tThe mob of creatures is impenetrable at first. The raiders\n\tleader signals the convoy to drop back across the parking lot.\n\tSome raiders have trouble keeping balance as Zombies claw them.\n\n644\tThe lead bikes pull up on the other side of the lot.\n\n\tRaider:\t THEY'LL SPREAD OUT COMIN' AFTER US...\n<b>\t\t\tTHEN WE GO IN WITH THE VAN...\n</b>\n645\tThe other bikes ride to the leaders. A van pulls in and two\n\tbikers scramble aboard through the side doors. One of the women\n\tjumps into the driver's seat and revs the engine.\n\n646\tThe Zombies are starting to move out after the convoy. The mob\n\tat the mall entrance is thinning somewhat.\n\n647\tIn the mall, Peter drops from the grill in the exterior corridor.\n\tHe charges out and into the Maintenance corridor, where he\n\tbreaks for the mall proper. He is followed by Stephen.\n\n\tPeter:\t(shouting)\n<b>\t\t\tDOWNSTAIRS FIRST...\n</b>\n\tSteve:\tOK...\n\n\tPeter:\tGOT YOUR TALK BOX?\n\n\tSteve:\tYEAH.\n\n\tPeter:\tKEEP IS HANDY.\n\n648\tOutside, the Raiders' van revs and roars towards the mall. The\n\tbikers stay at the other side of the lot, engines idling. Some\n\tof them whoop and holler like American Indians.\n\n649\tThe van crashes through the advancing Zombies. Several of them\n\tare knocked flying. The vehicle pulls up to the truck cab. Three\n\tmen pile out and scramble into the truck. The Zombies in the\n\tarea clutch at the raiders, but they fight their way clear. The\n\twoman in the van revs the engine again. Zombies claw at her\n\twindow. She squeals back to the main biker group.\n\n650\tThe Zombies in the parking lot are approaching the ranks of\n\tmotorcycles from a good distance. The raiders open fire. They,\n\ttoo, possess sophisticated weapons, the barrage sets up a great\n\tnoise. Several creatures fall. The little van pulls up behind\n\tthe bikes. The men still whoop and shout.\n\n651\tOn the floor on the mall, Peter and Steve dash about slamming\n\troll gates down on the open stores. They run desperately through\n\tthe empty concourses. They hear the din from outside.\n\n652\tAt the trailer cab, a raider fires point blank at the Zombies\n\tthat claw at the passenger window. Another man checks cables.\n\n\tRaider:\t SHIT...IT'S STILL TAPED UP...IT'S ALL READY\n<b>\t\t\tFOR US...\n</b>\n\tThe man sits at the wheel, revving the engine. Ghouls at\n\twindows.\n\n653\tInside, the men hear the truck starting. Steve slams down the\n\tPharmacy gate. Peter is already running to the Department\n\tStore. The big Trooper crashes up the escalator to the second\n\tfloor aisles. Steve breaks for the open Hardware Store.\n\n654\tThe huge trailer rolls away from the mall entrance. A shout of\n\tvictory goes up from the raiders. The Zombies at the door do not\n\tyet enter the mall, their focus on the raiders now. From other\n\tentrances Zombies start converging on the parking lot.\n\n655\tAcross the lot, the bikers rev their engines ready to make a run\n\ton the building. The raiders in the truck hop from the cab. They\n\trun to the doors, shooting Zombies at they move. Some creatures\n\tfall, others claw at the runners. One raider is brought down by\n\tthe ghouls. His friends pay no attention.\n\n656\tOne gunman slams into the mall doors to find they are locked.\n\tHe levels his machine gun on the locks and rips open the\n\tmechanism. The men push through the doors. The little alarm\n\tunits are knocked flying sending out a high pitched signal.\n\n657\tPeter is just slamming down the gates on the balcony when he\n\thears the alarms go off.\n\n658\tOne of the raiders hears the gates rumbling. He looks up and\n\tsees Peter running by the railing upstairs. He fires with his\n\tmachine gun.\n\n659\tPeter dives, sliding across the balcony. The bullets miss him\n\tand he crawls around the balcony just out of sight from below.\n\n660\tSteve has just slammed down the Hardware Store gate, and makes a\n\tdash for the Department Store.\n\n661\tThe raiders spot him as well, and open fire.\n\n662\tSteve runs zip-zag and dives into the big store, where he ducks\n\tinto the shadows leaving the gate open.\n\n663\tPeter, at the balcony railing, levels his super-gun on the\n\tbikers.\n\n664\tOne accurate shot fires and a raider falls with a giant wound in\n\this chest.\n\n665\tThe last raider at the doors ducks out of Peter's sight.\n\n666\tSteve now charges the roll gate and slams it shut on the store.\n\n667\tThe bikers toward the building. Zombies scatter on the lot.\n\n668\tJust as the bikers are reaching the building, the raider inside\n\trushes the doors. He holds them open as the big fleet of\n\trumbling cycles comes screaming into the building.\n\n669\tSteve is in awe, watching from the Department Store grid.\n\n670\tThe cycles pull down the concourse and Zombies lumber in after\n\tthem. The raider at the door is grabbed by a Zombie. Then\n\tanother. He manages to fight away.\n\n671\tPeter, shooting above, downs the raider and one of the ghouls.\n\n672\tThe main band of bikers hear the gunfire and pull down a side\n\tconcourse to regroup. They make their turn close to the\n\tDepartment Store and Steve backs into he shadows.\n\n673\tPeter moves down the balcony as Zombies are clamouring back to\n\tthe big concourses. Peter's eyes are wide at the invasion.\n\n674\tUpstairs, Fran hears the noises. She is at the top of the\n\tfirestair, weapons ready. On the landing below, the puppy\n\tscamper and barks. Fran calls the dog, but it doesn't listen.\n\n675\tThe bikes arc around and several pull up to the Dept. Store.\n\n\tRaider:\t ALRIGHT...COUPLE OF YOU HOLD OFF THEM ZOMBIES...\n<b>\t\t\tCHARLIE?...HIT THE GATES...WE GOTTA GET THAT\n</b><b>\t\t\tSNIPER.\n</b>\n\tThe leader rolls out. Others follow. Peter fires and drops a\n\traider, his bikes flying into the approaching Zombies.\n\n676\tThe action is too fast and furious. Neither Peter or Steve can\n\tsee the whole layout of the concourse.\n\n677\tThe lead bikers pulls out of range behind a set of columns. A\n\tcouple of bikers dismount and start up the stationary stairs.\n\n678\tSteve talks into his walkie talkie:\n\n\tSteve:\tTHEY'RE COMIN' UP, PETER...THEY'RE COMIN'\n<b>\t\t\tUP THE STAIRS.\n</b>\n679\tPeter moves to another spot on the balcony.\n\n680\tSuddenly the raiders at the Dept. Store door turn a machine\n\tgun on the roll gate locks. One flies open...another...\n\n681\tSteve runs into the store, about to charge up the escalator when\n\the realises he'll be in the line of fire. he runs to the\n\televator, hits a button, and starts for the second floor.\n\n682\tPeter fires and drops one of the charging men on the balcony.\n\tThe other takes cover. Just as Peter is changing position, the\n\tlights in the building blink out...the escalators stop... the\n\tpower has gone off.\n\n683\tUpstairs, Fran is alone in total darkness. Below, she hears the\n\tpuppy still barking. She starts carefully down the steps.\n\n684\tIn the stuck elevator, Steve gropes and fumbles for his talk box.\n\n\tSteve:\tPETER...PETER...\n\n685\tThe big trooper charges through the darkness to the Maintenance\n\tcorridor, ignoring the buzzing on his talk unit.\n\n686\tThe raiders on the balcony approach quickly, ducking against the\n\twalls occasionally for cover.\n\n687\tThe other bikers spill into the Dept. Store, raiding the\n\tcounters and raping the displays. They throw things into sacks\n\twhile others move to different stores and shoot off roll gate\n\tlocks. They raid the arsenal in the Sporting Goods store.\n\n688\tThe main pack of bandits are holding off the Zombies. The\n\tcreatures charge with new vigour. Some raiders fall and the\n\tghouls pounce on them, ripping flesh with teeth and hands.\n\n689\tThe van pulls up outside the doors and two bikers ride out to\n\tit, loading supplies into it. The Zombies are everywhere, but\n\tthe actions of the professional looters befuddle them.\n\n690\tSeveral creatures move onto the balcony. One Zombie pounces the\n\traider Peter shot and tears at his body.\n\n691\tAs remaining raiders appear at the mouth of the corridor, Peter\n\topens fire, killing the lead raider with a clean shot in the\n\theart. The man flies back over the railing, falling to the\n\tconcourse below where Zombies attack it. The other raider falls\n\tback against the wall.\n\n692\tPeter dashes into the Maintenance Room and rushes to throw the\n\temergency power switch.\n\n693\tThe portable emergency light units blink on all over the mall.\n\n694\tSteve, who has crawled through the escape hatch of the elevator,\n\tsuddenly feels the car move. He grabs onto the cables but his\n\thands slip from grease and his rifle falls down and wedges\n\tbetween the wall of the shaft and the moving car.\n\n\tSuddenly, the car stops again, and Steve sees through the\n\tescape hatch as light spills in as the main elevator doors open.\n\tHe thinks to jump down, but hears raiders below.\n\n695\tTwo of the big, greasy bandits charge into the car. They whoop\n\tand shout as they see the open escape hatch.\n\n696\tSteve settles back out of sight against the wall.\n\n697\tRaider:\t COME ON, MAN...LET'S GO...\n\n\tThe other raider whoops loudly and fires a barrage of bullets\n\tinto the escape hatch.\n\n698\tThe shells bang and clatter in the shaft and ricochet off the\n\twalls and gears. A shell nicks Stephen's arm, but he is silent.\n\n699\tFinally, the barrage stops. The raiders charge back to the\n\tstore.\n\n700\tOther bandits battle with Zombies. The men crash through\n\tstores, collecting weapons, ammunition, tools, clothes, food.\n\n701\tBikers shuttle goods out to the side doors of the van. The\n\twoman in the front seat is ready with giant pistols. Zombies\n\ttry to pound their way in, but they cannot succeed.\n\n702\tIn the mall, another biker drops to the Zombies. They pounce\n\ton him and start devouring his screaming body.\n\n703\tSeveral creatures now wander through the Department Store,\n\thaving entered from the second storey gate. They move through\n\taisles knocking against displays. One grabs a mannequin thinking\n\tit human, throws the dummy aside roughly.\n\n704\tThe raider on the balcony is approached by several Zombies. He\n\truns down the corridor to the Maintenance office. Peter is gone.\n\tBreaking into the various empty offices, the raider comes to the\n\tfake wall panel and assumes it goes nowhere. Then he hears the\n\tfaint barking of the dog. He checks the panel again by running\n\this hand along the edge.\n\n\tSuddenly a sound in the corridor and the raider turns. There\n\tare three ghouls coming. He fires and knocks off the ghouls one\n\tat a time and runs onto the balcony.\n\n705\tBikes roar this way and that. It is a war zone.\n\n706\tThe man is about to run downstairs when he hears a noise above.\n\tHe spins and looks up. He sees Peter just too late.\n\n707\tThe big Trooper, in an open ceiling grid, aims his super-gun\n\tsquarely at the raider's head. The gun roars and the man flies.\n\n708\tBelow, the raiders are starting to regroup. The bikes begin to\n\tpeel out of the mall entrance one at a time.\n\n709\tAnother raider is snatched off his machine by the Zombies.\n\n710\tThe bikers toss a last bit of booty in the van and the woman\n\tdriver gets ready to pull out. She lowers her window and fires\n\tpoint blank at the heads of the clutching creatures.\n\n711\tThe last wave of raiders is at the first floor entrance. The\n\tZombies are mobbing around the bikes outside. The men shoot and\n\tbeat their way to the cycles. One man is brought down, but three\n\tmanage to mount their cycles. The big bikes roar out.\n\n712\tPeter is crawling through the ductwork. Just as he opens a grid,\n\the sees the last bike rolling across the concourse. He levels\n\toff with his scope.\n\n713\tHe shoots one raider out of the saddle. Two others get out.\n\n714\tRegrouping in the lot, the band of twenty is now seven or eight.\n\n715\tOne last cyclist revs his engine and roars through the\n\tconcourse. He dodges several ghouls and heads for the entrance.\n\tHe is the leader. The one who was on the radio. He whoops\n\tvictorious just as he is about to drive through the doors.\n\n716\tPeter leans out of the grid work and settles the cross-hairs on\n\tthe back of the riders head. He waits as the biker roars out\n\tonto the lot. The rider lets out one last victorious shout in\n\tthe fresh air. Peter's scope is locked on the riders back and\n\tthe super-gun roars. The biker is blown off his machine.\n\n717\tThe bike flies into a pack of Zombies. Some fall back, but\n\tothers advance on the rider. The man rolls over the cement,\n\tstops, not dead yet. He screams wildly as they move onto him.\n\n718\tThe other bikers move off in the night and the engines fade\n\taway.\n\n719\tThe puppy stops barking. Fran is tense in the darkness clutching\n\ther rifle. She stands on the now silent landing.\n\n720\tIn the parking lot and main concourse the Zombies move freely.\n\tThey fight over the remains of the corpses. They eat ravenously,\n\tthe sounds of their feast the only thing in the area.\n\n721\tPeter peers down at the slaughter below from the ductwork.\n\tSuddenly he hears the beeper of his talk unit, hits the button.\n\n\tSteve:\tPETER!\n\n\tPeter:\tWHERE THE HELL ARE YOU?\n\n\tSteve:\tIN THE ELEVATOR!\n\n\tPeter:\tLISTEN, THOSE THINGS ARE ALL OVER THE PLACE.\n<b>\t\t\tCLIMB UP TOP...I'LL GET YOU OUT THE GRID ON\n</b><b>\t\t\tTHE SHAFT...I'M COMIN.\n</b>\n\tPeter starts to crawl through the ducts.\n\n722\tSteve hits the second floor button and the car moves. He\n\tclamours up on the hand rail on the car. His hands reach up and\n\tgrab the escape hatch pulling his head and shoulders out the\n\topening. He kicks with his legs to force himself up when the car\n\tstops. He sees the grid in the shaft wall.\n\n723\tSuddenly, the car doors open on the second storey and abruptly\n\tseveral Zombies dart into the car. They claw at Steve's legs and\n\tpull him out of the hatch. He screams, thrashes violently.\n\n724\tIn the duct, Peter hears the screams. He stops and listens for a\n\tmoment. He backs away heading for the Maintenance corridor.\n\n725\tIn the elevator, Steve thrashes with all his might. The ghouls\n\ttry to pull him out of the car while the elevator doors open and\n\tclose repeatedly against the creatures which block it.\n\n\tA Zombie bites Steve's arm, another bites his neck. The man\n\tscrambles to unholster his gun. Although he is bleeding\n\tprofusely, he finally pulls his gun and fires...once...twice...\n\n726\tPeter is dropping out of the washroom duct. He hears the pistol\n\tshots and realises Steve is not dead. He thinks about climbing\n\tback in the grid, but stops. He punches at the wall violently.\n\tHe is angry and confused.\n\n727\tAgain the pistol roars and rips through a Zombie head, flying\n\tout of the elevator. The doors still slam against the last\n\tcreature and Steve fires. The Zombie flies back and the doors\n\tfinally close.\n\n728\tOutside, Zombies fall against the elevator doors.\n\n729\tInside, Steve falls to the floor. His neck runs red. His eyes\n\tare wide with terror. He sits stupidly staring at the pistol in\n\this hand. He finds it hard to breathe.\n\n730\tPeter appears at the bottom of the firestair. The puppy runs to\n\tmeet him, tails wagging and yapping. He hangs his head as Fran\n\tlooks down.\n\n\tFran:\tNO.....NO!\n\n\tShe runs down the steps. The big Trooper catches her bodily as\n\tshe is about to charge out into the hall.\n\n\tPeter:\tI HEARD HIS GUN...MAYBE HE'S ALRIGHT...WE'LL\n<b>\t\t\tWAIT...WE'LL JUST WAIT A WHILE...\n</b>\n731\tThe mall stands silent in the blue haze of impending dawn.\n\n732\tZombies move through the building freely, walking the halls,\n\tlumbering through the stores.\n\n733\tSeveral creatures still pound and scratch the elevator doors.\n\tAs they push each other, one creature inadvertently makes\n\tcontact with the elevator call button.\n\n\tThe doors glide open. Steve is standing, his blood dry now.\n\tHis eyes are blank as he steps forward. The creatures step\n\taway seeing that he is no longer prey...he is among them now.\n\n\tThe doors slam against Steve and open again. Steve lumbers into\n\tthe store down the aisle. Other creatures drift away.\n\n734\tUpstairs, Fran is packing her sack slowly and ponderously. Her\n\tface is red from crying.\n\n735\tPeter stands at the stair top looking down at the landing.\n\n736\tFran sets the sack down at the escape ladder leading to the\n\troof. She deliberately goes to fill another sack.\n\n737\tOn the mall balcony, Stephen's corpse walks to the Maintenance\n\tcorridor. He looks past other wandering Zombies and sees the\n\tfake partition. Something in him remembers. He moves forward.\n\n738\tFran:\tIT'S ALMOST LIGHT...LET'S GO.\n\n\tPeter looks at her silently from the stairway door.\n\n\tFran:\tHE DOESN'T ANSWER THE RADIO...IT'S BEEN HOURS...\n\n\tShe starts to cry again.\n\n\tFran:\tFOR GOD SAKE. YOU BETTER COME ON BECAUSE IF\n<b>\t\t\tI GET TO THINKIN' ABOUT THIS, I'LL JUST GO ON\n</b><b>\t\t\tDOWN THERE AND LET THEM...LET THEM...\n</b>\n\tThe puppy suddenly growls. It charges between Peter's feet and\n\truns floppily down the steps.\n\n739\tIn the hallway, Steve pounds at the fake wall. Other creatures\n\tnotice and they all move toward the partition.\n\n740\tUpstairs, the pounding can be heard. Peter stands stoically,\n\tlooking down into the darkness. The dog barks below.\n\n\tFran:\tWHAT IS IT?\n\n\tPeter:\tIT'S STEPHEN...THEY'RE COMIN' UP!\n\n741\tWith a great crunching noise the partition gives way from the\n\tarmy of creatures.\n\n742\tPeter slams the door. He speaks quietly.\n\n\tPeter:\tGO ON...YOU GET OUT OF HERE.\n\n\tFran:\tPETER...\n\n\tPeter:\tI SAID...GET OUT OF HERE.\n\n\tFrom the firestair, we hear the sudden yelping of the puppy as\n\tit falls victim to the creatures. The sound echoes through the\n\tbarren spaces of the storage area.\n\n\tFran:\tOH, JESUS, PETER...PLEASE...\n\n\tPeter:\tI DON'T WANT TO GO...I REALLY DON'T...\n<b>\t\t\tYOU KNOW THAT? I REALLY DON'T.\n</b>\n743\tSuddenly, the door flies open and the creatures lumber into the\n\tliving space. Peter stares at them. He smiles slightly. The\n\tcreatures advance, led by Stephen.\n\n744\tFran starts to scream.\n\n\tFran:\tSTEPHEN...STEPHEN...\n\n\tShe makes a slight move for her lover, but Peter raises his\n\tsuper-gun and shoots the Zombie through the head.\n\n\tAs Stephen falls, Fran comes up short. The act startles her into\n\tawareness. Peter faces her as the creatures come up behind him.\n\n\tPeter:\tMOVE, WOMAN!\n\n745\tFran grabs the sacks and climbs the ladder to the roof.\n\n746\tThe creatures advance on Peter. He backs away, trying to lead\n\tthem from the skylight. They crash through the living space,\n\tupsetting the carefully planned room.\n\n747\tOn the roof, Fran desperately starts the helicopter engine.\n\n748\tPeter backs into the storage room, slamming the door. The\n\tcreatures approach the door and the super-gun roars one last\n\ttime. The Zombies push through the door and move in for their\n\tfeast.\n\n749\tSeveral zombies manage to scramble up the skylight to the roof.\n\n\tFran stares, transfixed. The blades roar up to full speed.\n\n\tThe creatures advance toward the machine.\n\n\tFran steps out onto the running board; the creatures very close\n\tnow. She crouches, watching for a moment, then looks up at the\n\tspinning blades.\n\n\tShe stands straight up, driving her head into the spinning\n\tblades.\n\n\tA headless form falls to the roof. The Zombies advance.\n\n750\tIn a wide shot, silhouetted against the dawn sky, we see the\n\tcreatures huddled under the chopper blades, feasting on their\n\tlast victim.\n\n\tThe credits crawl up.\n\n\tJust as the credits end...\n\n\tthe engine of the helicopter sputters...\n\n\tand dies.\t\t\n\nwww.homepageofthedead.com\n\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Dawn of the Dead</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=George A. Romero\" title=\"Scripts by George A. Romero\">George A. Romero</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Dawn of the Dead Script.html#comments\" title=\"Dawn of the Dead comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:03:17.169549"}