{"title": "Day of the Dead", "film_link": "/Movie Scripts/Day of the Dead Script.html", "script_link": "/scripts/Day-of-the-Dead.html", "info_raw": "\n\nDay of the Dead Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.33 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  George A. Romero\nGenres  Horror  Drama  Sci-Fi  Thriller\nScript Date :  1985\n\nRead \"Day of the Dead\" Script\n\n\n", "script": "\nDAY\nOF\nTHE\nDEAD\n(The original script)\nby George A. Romero\n\n\n\n\tFADE IN:\n\n1\tEXT. THE EMPTY STREET OF A CITY - DAY\n\nNo people. A FEW CARS AND TRUCKS are parked at odd angles, abandoned. \nA TITLE FADES IN, one phrase at a time.\n\nFIVE YEARS...\nSINCE THE DEAD FIRST WALKED.\n\n2\tEXT. THE CITY - DAY\n\nWe hear THE SOUND OF A STRONG WIND. DEBRIS flutters through the \nstreets. A LARGE ALLIGATOR slithers into frame, stops and looks \naround.\n\nMONTAGE: as MORE GATORS explore the empty streets, knocking over \nGARBAGE CANS, upsetting the MANNEQUINS in A DEPARTMENT STORE WINDOW. \nA GATOR crawls out through the open doors of AN ABANDONED BANK. LOOSE \nBILLS are dragged along under the animal's tail. They flutter away on \nthe WIND.\n\n3\tEXT. THE CITY - DAY\n\nGATORS crawl over A '79 CADELLIC. A FEMALE SKELETON sits slumped over \nthe steering wheel. In the back a BABY'S BONES are strapped into AN \nINFANT'S SAFETY SEAT. One of the gators THUMPS its tail maddeningly \nagainst the windshield. ANOTHER TITLE APPEAR:\n\nFLORIDA - 1987\n\n4\tEXT. THE CITY - DAY\n\nCLOSE ON A SECTION OF PAVEMENT as we hear THE SOUND OF SLUGGISH \nFOOTSTEPS approaching. A SHADOW appears at the bottom of the frame. \nIt gets longer and takes on the shape of a man.\n\nTIGHT ON THE AFTERNOON SUN, blinding us. Into the FOREGROUND lurches \nTHE FIGURE which cast the shadow. Glare obscures all facial detail \nuntil the head jogs into position directly in front of the fiery ball \nin the sky. Then we see its hideous, dead eyes, its blue-grey colour, \nthe blackened wound where a large portion of jaw has been ripped \naway. This is a ZOMBIE! A MUSIC CHORD SOUNDS and THE MAIN TITLE \nAPPEARS:\n\nDAY OF THE DEAD\n\n5\tEXT. THE CITY - DAY\n\nHEAD CREDITS ROLL over A MONTAGE: the CITY STREETS are now populated \nby the WALKING DEAD. In every shape, size and colour they wander, \nwithout purpose, up and down the avenues, in and out of buildings. \nThe city is theirs, they have inherited the place. Man, in his human \nform, seems to be gone.\n\nAs the CREDITS END, we CUT TO:\n\n6\tEXT. A MAIN STREET - DAY\n\nWe are looking down from a HIGH ANGLE. The corner of A TALL BUILDING \nis in the FOREGROUND. A CORPSE is dangling from A NOOSE. It's been \ndead for some time. It's mostly bone now, its blackened flesh picked \nclean by scavenger birds and harbour rats. A SIGN flaps against its \nchest cavity. Its hurriedly scrawled message reads: TAKE ME, LORD! I \nLOVE YOU!\n\nTHE ROPE BREAKS suddenly and THE CORPSE FALLS out of frame.\n\n7\tEXT. THE STREET - DAY\n\nWe're at GROUND LEVEL now...SMACK!!! THE CORPSE HITS THE PAVEMENT and \nSHATTERS as though made of potter's clay. BONES bounce over a wide \narea. THE SIGN is carried off by the WIND.\n\n8\tEXT. AN ABANDONED MARINA - DAY\n\nTHE SIGN gallops across the grass of A HARBOUR PARK towards the water \nwhere A FEW DERELICT BOATS sway in the WIND.\n\nSlowly, THE SOUND OF A MOTOR FADES IN.\n\n9\tEXT. THE MARINA (CLOSER ANGLE) - DAY\n\nA FISHING BOATS, old and sea-worn, chugs into the harbour.\n\n10\tEXT. THE MARINA (CLOSE ON THE FISHING BOAT) - DAY\n\nThere are people on board, THREE MEN AND TWO WOMEN. They look like \nguerilleros from somewhere in Latin America. They're heavily armed, \nunshaven, covered with months worth of jungle crud. They are \nobviously exhausted. They gaze up to the city. Their deep-sunken eyes \nare too war-weary to show much emotion but we can read their despair.\n\nTONY\nAnother dead place. I tol' you. Let's get \nout to the islands.\n\nMIGUEL\nThe radio signals were coming from this \narea.\n\nTONY\nNot from the city. In every city it's the \nsame. Dead. Let's get out to the barrier \nislands. If there are survivors sending \nthose signals that's where we'll find them.\n\nMIGUEL\nPlenty of time for the islands. The rest of \nour...life...on the islands...I think.\n\nMiguel is drifting. The sight of the dead city has pushed him a few \ninches closer to the brink of insanity. He catches himself and comes \nback toward reality.\n\nMIGUEL\nWe gotta see if there are others here. We \ncame all this way. We're gonna check it \nout.\n\n11\tEXT. THE MARINA (AT THE DOCKS) - DAY\n\nCLOSE ON THE OPEN GASOLINE RECEPTACLE in the hull of AN ABANDONED \nBOAT. A WOMAN'S HANDS shove a LENGTH OF HOSE down into the hole.\n\nThe woman, MARIA, puts the other end of the hose to her mouth and \nsucks the air out.\n\nAt ANOTHER DERELICT BOAT, TONY sucks on ANOTHER HOSE.\n\nTONY\nPtoooo! Nothing! Dry as a bone. No gas. \nLet's get outa here.\n\nMIGUEL\nCheck them all. And check the tanks under \nthe pumps.\n\t\nMIGUEL and the other two guerilleros, SARAH AND CHICO, start to walk \nup the dock towards the harbour park, toward the city. MIGUEL has AN \nELECTRONIC BULLHORN in one hand, his AUTOMATIC RIFLE ready in the \nother.\n\n12\tEXT. THE HARBOUR PARK - DAY\n\nTHE TRIO of refugees move across the grass. The WIND blows DEBRIS \naround them as they stare towards the downtown buildings. MIGUEL \nlifts THE BULLHORN to his mouth.\n\nMIGUEL\nHELLO. IS THERE ANYONE THERE? HELLO. \nHELLOOOOOOO....\n\n13 \tEXT. THE CITY - DAY\n\nMONTAGE: as THE WALKING DEAD hear that human VOICE. Throughout the \ncity they turned towards THE SOUND, at once confused and excited.\n\nMIGUEL (o.s.)\nHELLOOOOOOOOOOO....\n\nTHE DEAD start to GROAN hungrily, almost pleadingly. All over the \ncity their VOICES RISE.\n\n14\tEXT. THE HARBOUR PARK - DAY\n\nIt comes to MIGUEL AND THE OTHERS as A MASSIVE WALL OF NOISE, THE \nSOUND of hundreds-of-thousands of damned souls moaning on one solid \nvoice. The sound of hell on earth.\n\n15\tEXT. THE MARINA (AT THE DOCKS) - DAY\n\nTONY AND MARIA hear it as well and feel the familiar grip of cold \nfear. Maria makes the sign of the cross.\n\nMARIA\nDios mia.\n\nTONY\nI tol' him. I tol' him this is a dead \nplace. Like all the others.\n\nCUT TO:\n\n16\tEXT. THE CITY (FROM THE WATER) - DAY\n\nWe see the place FROM A GREAT DISTANCE. In the FOREGROUND THE FISHING \nBOAT, with all five REFUGEES back on board, chugs into open waters.\n\nCUT TO:\n\n17\tEXT.\tA SMALL PRIVATE DOCK - DAY\n\nAway from the city, this dock is wooden, rickety. DERELICT BOATS rust \nat their moorings. THE FISHING BOAT is tied-on at one end of the pier \nand THE GUERILLEROS are moving through the area, scavenging. This \ntime CHICO helps MARIA with the SIPHON HOSES. TONY lingers sullenly \nnear the fishing boat which has its motor still idling.\n\nMARIA'S SIPHON HOSE is stuffed into the gas tank of A LARGE TRAWLER. \nShe sucks on the hose and, unexpectedly, foul tasting liquid fills \nher mouth.\n\nMARIA\nAY! GASOLINA! GASOLINA!\n\nWithout warning, A FIGURE pops up from behind the side wall of the \ntrawler. He reaches out and grabs the woman, pulling her against the \nboat, his arm around her neck, a pistol to her head.\n\nTONY sees the action. He dives into the fishing boat, crawls over to \nhis RIFLE and scrambles towards the pilot's controls.\n\nWith a lightning move, MARIA pulls A KNIFE from her belt. She \nwrenches around and PLUNGES THE BLADE INTO HER ATTACKER'S CHEST. The \nman staggers back, screaming. MARIA breaks away and runs across the \ndock. THE MAN FIRES HIS PISTOL wildly.\n\nMARIA IS HIT IN THE ARM. She tumbles forwards onto the decking.\n\nTONY reacts, OPENING FIRE WITH HIS AUTOMATIC.\n\nBULLETS RIP INTO THE ATTACKERS CHEST: HE FALLS OUT OF THE TRAWLER \nonto the dock, but TWO MORE GUNMEN appear behind him, mean-looking \ndesperadoes with RIFLE SPITTING LEAD.\n\nTONY ducks as low as he can. He grabs the controls and pilots the \nfishing boat along the edge of the dock toward the downed woman.\n\n18\tEXT. THE PRIVATE DOCK - DAY\n\nMIGUEL, SARAH AND CHICO react to the gunfire. They draw their WEAPONS \nand look for cover.\n\nThey are at the far end of the dock, their backs to the sea. There is \na WORK SHED nearby. BULLETS WHIZ past them as they charge towards the \nwooden structure. They make it there safely and they begin to RETURN \nFIRE. A gun battle ensues between the two groups.\n\n19\tEXT. THE PRIVATE DOCK - DAY\n\nMARIA, her ARM BLEEDING, rolls off the dock and into THE FISHING \nBOAT. TONY guns the engine and the boat pulls out into open water.\n\nTHE ATTACKERS try to FIRE AT THE ESCAPING BOAT but they are forced to \nduck BULLETS which RICOCHET OFF THE TRAWLER pinning them down.\n\n20\tEXT. THE PRIVATE DOCK - DAY\n\nMIGUEL'S RIFLE is in his right hand. His left hand clings to the \nframe of AN OPEN WINDOW on his side of the shed. There's a SUDDEN, \nSTARTLING MUSIC STING and, with it, A ZOMBIE appears inside the open \nwindow. Grotesque and drooling dark SALIVA, its hungry mouth lunges \nat MIGUEL'S left arm. ITS TEETH TEAR A LARGE STRIP OF FLESH OUT OF \nTHE ARM six inches above the wrist.\n\nMIGUEL screams. He pulls away from the creature, his terrified eyes \nstaring at the BLEEDING WOUND. A zombie bite means infection and \nalmost certain death.\n\nTHE ZOMBIE leans out through the open window, its hands clawing the \nair trying to reach MIGUEL. SARAH pulls A GIANT .45 from her holster \nbelt. BULLAMN! BULLAMN! BULLAMN! She FIRES three rapid shots.\n\nTHE SKULL OF THE ZOMBIE INDENTS IN FRONT like a hard-boiled egg shell \nthat's been whacked with a spoon bowl. BLACKENED BLOOD AND BRAIN \nMATTER FLIES OUT OF THE BACK where the bullets exit. The creature \nfalls, destroyed.\n\n21\tEXT. THE PRIVATE DOCK - DAY\n\nSARAH acts quickly. She lunges towards CHICO and snatches A MACHETE \nout of his belt. CHICO shows concern but he's busy RETURNING FIRE at \nTHE ATTACKERS on the trawler.\n\nSARAH\nI have to stop the infection... Querrida...\n\t\nMIGUEL looks into SARAH'S eyes. He has started to tremble. A cry of \nprimal panic is gurgling up in his throat. With a sudden move, SARAH \nslams her RIFLE BUTT into the side of his head with all her might. He \nreels backwards and slams into the boathouse wall. His eyes roll but \nhe stays on his feet, still conscious.\n\nCHICO steps away from his post and stands squarely in front of \nMIGUEL. WHAP! He slugs him with a powerhouse right-cross. MIGUEL \nstill stands. WHAP! He slugs him again. WHAP! Again. Finally, MIGUEL \ncollapses into the man's arms and CHICO lays the limp body down on \nthe deck.\n\nBUDDABLAM! RATTATATTATATTATATT! THE ENEMY, sensing an upper hand, \nstarts FIRING WITH MORE INTENSITY. CHICO steps away from MIGUEL and \nSENDS SOME LEAD BACK their way.\n\n22\tEXT. THE PRIVATE DOCK - DAY\n\nSARAH is crying. It's not weakness. She's crying for MIGUEL, crying \nfor his pain. But she doesn't hesitate in what she has to do. She \ncrouches over the BITTEN ARM and raises the MACHETE over her head.\n\nTHUCK! SHE CHOPS AT THE ELBOW JOINT with all her strength. THE BLADE \nBITES DEEP BUT DOESN'T CUT THROUGH. SHE LIFTS IT AND CHOPS AGAIN AND \nAGAIN....THUCK! THUCK! Then SHE DIGS AROUND, searching for the joint \nthe way she might on a turkey drumstick. Finding the spot, SHE PUSHES \nDOWN WITH BOTH HANDS, leaning all her weight on the top edge of the \nblade. TEARS are running down her cheeks when THE BIG KNIFE \nFINALLY.... THUMMMPPP!....CUTS THROUGH TO THE DECKING.\n\nRepulsed, angry, SARAH SWEEPS THE SEVERED FOREARM AWAY WITH THE BLADE \nthe way a butcher might sweep away unwanted fat. BLOOD IS SPURTING \nOUT OF THE STUMP at an alarming rate. SARAH has to act quickly again.\n\nWhile CHICO continues to RETURN FIRE at the enemy, SARAH swings \nherself up onto the sill of the open boathouse window and disappears \ninside the place.\n\n23\tINT. THE BOATHOUSE - DAY\n\nThe place is dark and cluttered (oars, bait buckets, fishing gear, \nlife preservers, tools, paints, varnishes). SARAH snatches up AN AXE \nHANDLE.\n\nTHE ZOMBIE that bit Miguel lies nearby with its skull laid open. Its \nhand is jogged, startingly, when SARAH grabs A BOTTLE OF PAINT \nTHINNER from the floor beside the corpse.\n\nFrom out of the shadows...A HAND! It grabs SARAH'S ankle. She kicks \nviolently and pulls away. ANOTHER ZOMBIE is crawling across the \nfloor. ONE OF ITS LEGS IS MISSING AND THE OTHER IS BADLY DAMAGED.\n\nSARAH draws her .45 and BULLAMM! BULLAMM! SHE PUMPS TWO ROUNDS INTO \nTHE CREATURE'S BRAIN.\n\n24\tEXT. THE PRIVATE DOCK - DAY\n\nCHICO ducks the enemy's RICOCHETING BULLETS.\n\nCHICO\nHEY ! WHAT ARE WE DOIN' THIS FOR? WE CAN \nSTICK TOGETHER. WE CAN USE EACH OTHER'S \nGUNS.\n\nAt THE TRAWLER, ONE OF THE ATTACKERS shouts a response.\n\nATTACKER #1\nYou could use our guns, maybe. We can't use \nyours. Unless you can get yer boat back \nhere.\n\nCHICO\nYou got a boat.\n\nATTACKER #1\nShit, man. We can drift this tub into the \nbay...tow her around with a dinghy...but \nshe ain't gonna get us nowhere. Ev'ry boat \nyou see here is long dead, soldier...else \nwe'd be long gone. Can you get your boat \nback here?\n\nCHICO\nI don't know where they went, man. I don't \nknow. I swear.\n\nATTACKER #1\nThen, like I said...we can't use you. We \nain't got the food nor the patience to put \nup with you.\n\nThe man FIRES A LONG BURST from his automatic.\n\nCHICO\nYOU....YOU MOTHERFUCKERS!\n\nHe reaches around the corner of the shed with his own rifle and FIRES \nblind in return. SARAH clambers out through the shed windows having \nwrapped A LARGE PIECE OF CLOTH around the end of the AXE HANDLE.\n\t\nShe reaches into a shirt pocket and produces A WOODEN MATCH. She \nstrikes the match and touches the flame to the thinner-soaked cloth. \nPHOOOOOMPH! The axe handle becomes an angrily flaming torch.\n\n25\tEXT. THE PRIVATE DOCK - DAY\n\nAs the gun battle continues, SARAH crouches over MIGUEL. BLOOD IS \nSTILL FOUNTAINING FROM THE STUMP OF HIS LEFT ARM. The woman slaps THE \nFLAMING END OF HER TORCH ONTO THE STUMP. There's A SIZZLING SOUND as \nthe raw flesh there cooks.\n\nThe pain reaches MIGUEL even though his unconscious state. He starts \nto breathe heavily. His head shakes from side to side silently \npleading \"NO, NO, NO.\" The flames do their job. THE FLESH CRUSTS OVER \nAND THE BLEEDING STOPS.\n\nMIGUEL'S SHIRT CATCHES. Suddenly his eyes pop open and he screams \nlike the man on fire he is. He lurches away from the flame, his body \nslamming against the shed wall. SARAH flings the torch into the water \nand dives on top of the man.\n\nSARAH\nMIGUELITO. MI VIDA. MIGUEL MIO.\n\nMIGUEL, trying to scream but needing to vomit, is doing neither. His \nbody is convulsing in the woman's arms. She rubs the sparks on his \nshirt until they disappear then she caresses him, holding his head \nagainst hers, rocking him back and forth.\n\n26\tEXT. THE PRIVATE DOCK - DAY\n\nCHICO is still busy RETURNING FIRE. BULLETS WHIZ through the air \naround his head. ONE KNICKS HIM ON THE SHOULDER, a superficial but \npainful wound.\n\nCHICO\nJESUS CHRIST! GET UP HERE, WOMAN! GET THE \nHELL UP HERE!\n\nSARAH has no choice but to help in the fight. She lays MIGUEL as \ngently as she can on his back. He's gone into deep shock, shivering \nviolently. Rubbing tears away from her eyes, SARAH jumps to her feet, \ntakes up a post and begins to FIRE AT THE ATTACKERS.\n\nTHE ATTACKERS are grinning like old-fashioned pirates as their GUNS \nCHEW UP THE DOCK. Suddenly, just behind THE TRAWLER, we see A FLASH \nOF COLOUR SPEEDING BY...\n\nIt's THE FISHING BOAT! The WOUNDED MARIA is steering. TONY is \nstanding on the prow with his RIFLE FIRING... \nRATTATATTATATTATATTATATT!!!!\n\nONE OF THE ATTACKERS IS HIT FROM BEHIND. HIS BACK TURNS SOLID RED and \nHE PITCHES FORWARDS, FALLING between the boat and the dock into the \nwater below.\n\nTHE OTHER ATTACKER (#1) turns and FIRES IN RESPONSE. TONY IS HIT IN \nTHE STOMACH. He falls to his knees and grabs the side of the boat but \nhe KEEPS FIRING.\n\nTHE ATTACKER pivots against a mast. For a moment he doesn't realise \nthat HIS NECK HAS BEEN RIPPED OPEN BY A LINE OF BULLETS. He tries to \nscream. Can't. A PLUME OF RED SHOOT OUT OF HIS MOUTH. Then he \nrealises. He realises that he's a dead man. He falls.\n\nMARIA\nTONY....TONY....\n\nTONY\nPULL IN! GET THE OTHERS.\n\nTONY is clutching at his BLEEDING BELLY as MARIA, in pain from her \nown wound, circles the boat towards the edge of the dock.\n\n27\tEXT. THE PRIVATE DOCK - DAY\n\nBehind the boathouse, SARAH slings her rifle onto her shoulder and \nshe leans over MIGUEL who is now catatonic.\n\nSARAH\nHelp me get him to the boat.\n\nCHICO\nLeave him.\n\nSARAH calmly raises her .45 and aims it directly at CHICO's head.\n\nSARAH\nHelp me or die.\n\nReluctantly the man moves towards MIGUEL and the two survivors drag \nhis limp body over the decking.\n\nDISSOLVE TO:\n\n28\tEXT. THE PRIVATE DOCK - SUNSET\n\nThe fishing boat is gone. Orange light from the western horizon \npaints the scene. FIGURES are moving about on the dock, slumped, \nlumbering figures....ZOMBIES.\n\nThey're clustering around THE TRAWLER, around THE CORPSES OF THE \nATTACKERS.\n\nTHEY BEGIN PULLING THOSE CORPSES APART AND EATING THEM HUNGRILY.\n\nONE CREATURE has found MIGUEL'S SEVERED FOREARM. IT PULLS A BIG CHUNK \nOFF THE THING WITH ITS TEETH. It chews for a time, ITS DROOL TURNING \nRED. Then it spits out MIGUEL'S WRISTWATCH as though it was a \nbothersome bit of bone.\n\n29\tEXT. THE FISHING BOAT (IN DEEP WATER) - SUNSET\n\nTHE TWO WOMEN hover over their wounded, TONY AND MIGUEL. CHICO steers \nthe boat. Suddenly, TONY arches his back and screams in pain.\n\nTONY\nAaaaaaah...my God...my God...I am heartily \nsorry...for having offended \nThee....offended Thee...\n\nMARIA\nShhhhh....Tony. Rest, rest.\n\nTONY\nI detest all my sins...because... because \nof Thy just punishment... because of \nThy...just...punish...\n\nA coughing fit interrupts his Act of Contrition. From across the open \ncabin, from within SARAH'S arms, MIGUEL stares. His eyes have the \nglaze of a madman's eyes. Despite that, and despite the physical \ntrauma he has endured, he seems remarkably in command.\n\nMIGUEL\nHe is dying. I will end his pain.\n\nMIGUEL draws his PISTOL.\n\nMARIA\nNOOOOOOOOO!\n\nTONY\n...but most of all because...they offend \nThee, my God...Who art all good...and \ndeserving...deserving of all my love...\n\nMIGUEL\nHe is dying. He knows it.\n\nMARIA\nYou are dying, too.\n\nMIGUEL\nNo. The disease was cut away from me. I \nwill live. I will live.\n\nTONY\nI firmly resolve...with the... with the \nhelp...the help of...of Thy grace...\n\nTONY collapses. A long, gurgling breath of surrender spills out of \nhim and BLOOD TRICKLES FROM HIS LIFELESS MOUTH.\n\nMARIA\nTony...TONY!\n\nThe woman folds TONY'S corpse into her arms as though trying to give \nit life from her own wounded body. For a long moment there is only \nthe CHUG-CHUG-CHUG of the tired engine. Then the woman, sensing \nsomething, turns back towards MIGUEL. His pistol is raised, aimed at \nTONY'S head.\n\nMARIA\nNO! YOU CAN'T!\n\nSARAH\nIt must be done. You know this. It must by \ndone to keep him from...\n\nMARIA\nIt won't happen to him! It won't happen to \nhim! You heard his prayer. His prayer will \nsave him. He could never become one \nof...one of those... devils.\n\nMIGUEL\nPrayers have no power to save. The knife \ncan save. It can cut the disease away. The \nbullet. It can shatter the brain where the \nevil takes seed. These are saviours...our \nnew saviours...our only saviours.\n\nMARIA\nWe must wait. One day the curse will pass. \nOne day a dead man will... will...\n\nMIGUEL\nOne day a dead man will refuse to return, \nand that man will be a saint. The first \nsaint of our century. That's a prayer, too. \nA catechism. Something the priests tell us \nto believe.\n\nMARIA\nYou can believe this, Miguel. I'll kill you \nif you shoot. We must wait. I'll....I'll do \nit....I'll do it myself....when it needs to \nbe done.\n\nMIGUEL\nNo. You won't be able to do it. He will \nrise. He will rise and you... you will die.\n\nThat madman's glaze is wet in MIGUEL'S eyes again. A grin curls his \nmouth into an odd shape. He freezes, staring, waiting. SARAH shows \nconcern.\n\n30\tEXT. DEEP WATER (WITH THE FISHING BOAT) - NIGHT\n\nA CRESCENT MOON lies on its back. Below, on the pitch black water, \nits reflection, a vertical stripe, breaks open as THE BOAT passes \nthrough it...CHUG-CHUG-CHUG.\n\n31\tEXT. THE FISHING BOAT (IN DEEP WATER) - NIGHT\n\nCHICO has fallen asleep at the tiller. SARAH is asleep as well, and \nso is MARIA.\n\nA SILENT SHADOW moves over the side rail. HANDS reach out and grip \nMARIA'S shoulders, lifting her up, up from sleep. Her eyes flutter \nopen.\n\nTONY'S face is blue-grey in the moonlight. It takes the woman a \nsecond or two to recognise that HE IS ONE OF THE LIVING DEAD. His \nhungry mouth lunges towards her neck. His DROOLING TEETH SINK DEEP. \nThe woman screams.\n\nSARAH wakes with a start. MIGUEL is already awake. He's been watching \nall along. Now he watches still, his PISTOL idle in his one good \nhand, his mouth curled in that strange grin, as MARIA'S screams \nshatter the quiet night.\n\nAt the tiller, CHICO sees what's happening. He fumbles for the \nAUTOMATIC RIFLE that's strapped over his shoulder.\n\nA PORK-CHOP-SIZE CHUNK COMES OUT OF MARIA'S NECK IN THE CLENCHED \nTEETH OF THE TONY-CREATURE. BLOOD SQUIRTS UPWARD IN A FIVE-FOOT ARC.\n\nSARAH lifts her RIFLE from her lap. She is the first to FIRE. An \ninstant later, CHICO FIRES as well.\n\nTHE HEAD ON THE TONY-CREATURE IS HIT BY RAPID-FIRE LOADS from each \ngun and IT COME APART ABOVE THE EYES. Its body staggers stiffly into \nMARIA. She tries to stand, tries to pull away, screams still bubbling \nin her torn throat. She topples backward over the side rail. The \ncorpse, taller and heavier, flips rigidly over, its feet kicking \nskyward, and splashes in to the deep, black Gulf. \n\nMARIA, the small of her back balanced precariously on the side rail, \ngrabs at the air trying to swing her weight back on board. SARAH \nsprings forward. She reaches the other woman a second too late. Their \nhands brush but don't catch. MARIA slips over the side. A LOUD SPLASH \nCUTS OFF HER SCREAMS.\n\nCHICO brings the boat about in as tight a circle as possible. He and \nSARAH stare out over the water. The blackness out there is absolute. \nVisibility zero.\n\nSilence....but for the CHUG-CHUG-CHUG of the boat's engine.\n\nMIGUEL slowly raises his hand and aims his PISTOL at a LARGE, TURTLE-\nSHAPED SPLOTCH OF BLOOD on the hull across the cabin, the spot where \nTONY died. With that odd grin still on his lips, HE BEGINS TO FIRE \none shot at a time in deliberate, slow rhythm.\n\nTHE BULLETS PUNCH HOLES through the wooden side-wall, most of them \nhitting squarely in the blood stain.\n\nSARAH looks over toward CHICO who returns her look with frightened \neyes.\n\n32\tEXT. GASPARILLA'S ISLAND (EST.) - DAY\n\nIt looks like a tropical paradise. Greatly separated from the other \nsmaller islands on the horizon, its vegetation is dense and lush. \nThere's no sign that civilisation ever invaded the place, no power \nlines, no buildings. What meets the eye is all natural and inviting.\n\nTHE FISHING BOAT chugs into a tidewater basin on the afternoon side \nof the island.\n\n33\tEXT. THE FISHING BOAT (IN THE BASIN) - DAY\n\nCHICO\nIt looks uninhabited. What do you think?\n\nMIGUEL\nI think we should burn the church. Kill the \npriest and burn the church. It's the only \nway. The only way.\n\nMIGUEL is sweating profusely yet shivering as though cold. FLIES ARE \nBUZZING in a cluster around his WRAPPED STUMP. He's over the edge \nnow, insane. And worse than that, the infection from the original \nbite is spreading. The amputation was not done quickly enough to \nprevent the parasites from racing through his veins to the brain and \nelsewhere.\n\nSARAH turns towards the madman once her lover. Her heart is too \ncallused for emotion to reach it. She just stares, her eyes dead cold \nlike the eyes of a shark.\n\nCHICO\nI'm pullin' in.\n\n34\tEXT. THE ISLAND (WITH THE FISHING BOAT) - DAY\n\nTHE BOAT noses into a swamp water backwash. Tall reeds and cypress \nmoss camouflage it completely. It's at though the boat is sailing \nright onto dry land.\n\nSHOCK CUT TO:\n\n35\tEXT. THE JUNGLE NEAR THE INLET - DAY\n\nTHWOCK! CLOSE ON A MACHETE. The blade chops into the top of a \ncoconut.\n\nCHICO drinks the milk. SARAH sits on a nearby rock, her RIFLE AND A \nBACK-PACK full of supplies strapped over her shoulders.\n\nMIGUEL, his madman's eyes wide with excitement, is trotting urgently \nfrom spot to spot where a spectacular specie of sub-tropical plant \ngrows. There are hundreds of them, six-feet tall and flowering. Their \nred-gold blossoms are shaped like trumpets hanging with their bells \ndown.\n\nMIGUEL\nDATURA!!! DATURA!!! MIRA. DATURA!!!\n\nCHICO\nWhat's he saying?\n\t\nSARAH shrugs, not knowing. CHICO looks down at her, empathising.\n\nCHICO\nHis madness....could be from shock.\n\nSARAH\nNo. I didn't stop the infection in time. I \nknow.\n(She speaks softly, matter-of-factly)\nDon't worry. When he dies, I won't be like \nMaria. I'll shoot him.\n\nMIGUEL\nDATURA!!! DATURA!!! DATURA METEL!!!\n\n36\tEXT. THE INLAND JUNGLE - DAY\n\nTHE GUERILLEROS hack their way through thick undergrowth with \nMACHETES. MIGUEL is ineffectual. He lags behind the others who are \ndoing trailblazing. THE SOUNDS OF WILDLIFE, excited by the intruders, \nfill the close, humid air, sometimes beautiful, sometimes grotesque, \nsometimes startling.\n\n37\tEXT. A SWAMPY AREA - DAY\n\nALLIGATORS lurk and SNAKES slither among the reeds. A FOURTEEN FOOT \nGATOR opens its jaws wide making a SOUND LIKE ESCAPING STEAM. CHICO \ndraws his PISTOL but SARAH reaches out to grab his hand.\n\nSARAH\nNo. No shooting. Not until we're sure we're \nalone on this island.\n\nMIGUEL\nNo. No, thank you. No ice. Straight up, \nplease. No ice. Thank you.\n\nMIGUEL'S eyes roll up into his head. His knees buckle. SARAH grabs \nhim under the arms barely keeping from falling face first into the \nmuddy swamp water. CHICO comes to help.\n\n38\tEXT. THE SWAMP - DAY\n\nTHE TWO drag MIGUEL to the edge of dry land. They flop him onto his \nback and SARAH puts her canteen to his lips.\n\nMIGUEL\nNO ICE, I SAID!!! NOOOOO ICE!!!\n\nHe slams his good hand against the canteen, knocking it away. It \nplops into the marsh water, its contents lost.\n\nMIGUEL\nBurn the church. Kill the priest and burn \nthe church. Burn....\n\nHis mouth keeps on shaping words but no sound comes out. He squirms \nfor a moment, then he seems to fall asleep.\n\nCHICO looks down at him. Unable to help, he moves off towards solid \nground and disappears in the thick brush. After a time, SARAH follows \nafter him.\n\n39\tEXT. THE CAVE ENTRANCE - DAY\n\nCHICO is at the edge of a clearing when SARAH reaches him. His eyes \nare wide, frightened by what they see.\n\nIn the ground before them there's AN ENORMOUS IRON PLATE, fifty feet \nby ten, all painted in brown and green camouflage patterns.\n\nSARAH\nWhat is it?\n\nCHICO\nI dunno. Landing pad for a helicopter? I \ndunno.\n\nSuddenly there's A GREAT RUMBLING, like the giant gears and pistons \nof a drawbridge being activated. The iron plate shudders and starts \nto move, downward, into the earth. SARAH AND CHICO duck into the \nnearby jungle.\n\n40\tEXT. THE JUNGLE NEAR THE CAVE ENTRANCE - DAY\n\nThey take cover in a thicket, both their GUNS up and ready. OTHER \nSOUNDS can be heard now, clunking sounds of metal on metal, and a few \nheavy thuds. There are also VOICES on the wind but their words are \nindistinguishable.\n\nCHICO\nIt's some kind of....elevator. There must \nbe something under the ground \nhere....maybe....military.\n\nSARAH\nLook.\n\n41\tEXT. THE CAVE ENTRANCE (THEIR P.O.V.) - DAY\n\nSEVERAL FIGURES are rising up in to view, a dozen, maybe fifteen. \nDetails are obscured by FOREGROUND FOLIAGE but we can read helmets, \nheavy armaments, packs, utility belts. The impression is of a ghostly \ncadre of soldiers rising from hell.\n\nSARAH (o.s.)\nJesus Christ!\n\nCHICO (o.s.)\nIt is military. I don't believe it.\n\n42\tEXT. THE JUNGLE NEAR THE CAVE ENTRANCE - DAY\n\nCHICO\nWhat do we do? Let'em know we're here....or \nwhat?\n\nSARAH\nLet's just....wait a minute. Get a better \nlook.\n\nShe moves to another spot a few feet away. CHICO follows.\n\n43\tEXT. THE CAVE ENTRANCE (THEIR P.O.V.) - DAY\n\nTHE PLATOON OF SOLDIERS, still obscured by foliage, moves off into \nthe jungle carrying A COLLECTION OF PARAPHERNALIA.\n\nThere are THREE SOLDIERS who do not move off with the others. They \nare standing still with their shoulders slumped, their heads lolling \nlistlessly from side to side. They have the body attributes of \nprisoners yet there's something menacing about them. We HEAR A SERIES \nOF ELECTRONIC BEEPS, something like computer beeps, and, as though in \nresponse to that signal, the three slumped figures start to walk. \nThey move slowly, stiffly, their feet shuffling, their arms dangling \nlifelessly at their sides.\n\nSARAH (o.s.)\nOh....oh, my God.\n\n44\tEXT. THE JUNGLE NEAR THE CAVE ENTRANCE - DAY\n\nSARAH'S eyes are wide in their sockets with disbelief, revulsion, \nhorror. Beside her CHICO, also astonished, makes the sign of the \ncross.\n\nSARAH\nOH, MY GOD!!!\n\n45\tEXT. THE CAVE ENTRANCE - DAY\n\nAs we CUT IN CLOSER we see that the three slumped figures are \nZOMBIES. They are wearing khakis and they are armed with RIFLES AND \nPISTOL BELTS. Their HELMETS have been painted an identifying bright \nRED and they wear slipover vests dyed the same bright colour.\n\nAll the others in the platoon are humans. They, too, wear vests but \ntheirs are not red but WHITE, WITH LARGE ORANGE CIRCLES emblazoned \nfront and back. Two of the men wield LONG ELECTRIC CATTLE PRODS for \nuse should the ZOMBIES misbehave, but the creatures, amazingly, are \nshambling along with the rest of the platoon voluntarily, co-\noperatively, even somewhat excitedly....the kind of excitement seen \nin a puppy that's just learned a new trick.\n\n46\tEXT. THE JUNGLE NEAR THE CAVE ENTRANCE - DAY\n\nCHICO\nIt can't be. Are we truly in hell?\n\nSARAH\nCome on.\n\nStealthily the woman moves along the edge of the thicket, crouching \nall the while. CHICO hesitantly follows.\n\n47\tEXT. A CLEARING - DAY\n\nThe mysterious PLATOON begins \"setting up\" their equipment, which \nincludes TRIPOD MACHINE GUNS. TWO MEN don BLACK RUBBER GLOVES AND \nLONG BLACK LABORATORY APRONS. They strap LARGE REFRIGERATED CARTONS \naround their necks and open the sealed lids. VAPOUR mushrooms out \nlike dry-ice vapour out of Good Humour wagons on a hot day.\n\n48\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nSARAH AND CHICO watch. Suddenly THE HUGE, FULL-THROATED SOUND OF A \nSIREN startles them. They look around, up into the trees. SARAH spots \nsomething and points.\n\nCLOSE ON A SIREN HORN, high in the cypresses, its wires running down \nto the brush and disappearing under ground.\n\n49\tEXT. THE CLEARING - DAY\n\nFirst ONE comes....then TWO MORE....THREE MORE. ZOMBIES are shuffling \nout of the jungle and converging on the platoon.\n\nThey seem to come from everywhere. Soon there are twenty or more. \nMost are tattered and ragged but others wear vests, the same type as \nworn by the platoon. These are solid colours, some white, some blue. \nNone are red and none have orange circles.\n\nAs THE ZOMBIES push in closer they seem to get agitated. They start \ngrowling and reaching out. THE MEN WITH THE CATTLE PRODS poke at the \nmore unruly creatures and ZAPPING SOUNDS can be heard.\n\nThe creatures form a kind of ragged queue, lining up in front of the \n\"Good Humour\" men. From inside their freezer cartons those men \nproduce GREAT BLOODY CHUNKS OF RAW MEAT. THE ZOMBIES docilely take \nthe hand-outs and go lurching out of the queue, some starting to eat \nimmediately, others retreating into the cool of the jungle to enjoy a \nmore private supper.\n\n50\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nSARAH\nWhat is that? Could that be....?\n\nBehind her, CHICO gets the dry heaves. He slams his hand into his \nmouth to keep from making noise.\n\nSARAH\nNo. They must have gotten them to \naccept....other things. They wouldn't be \nfeeding them with....they wouldn't...\n\n51\tEXT. THE CLEARING - DAY\n\nThe man in command of the platoon is obvious, strutting around while \nothers do the dirty work. This is CAPTAIN RHODES. He's \nconscienceless, the low of the low, and a weasely-looking guy, to \nboot. He watches the operation almost hoping for trouble. (He loves \nto torture disobedient zombies.)\n\nBehind him, their AUTOMATICS ready, are SEVERAL TROOPERS especially \nassigned to protect the captain. One of these troopers is TOBY TYLER, \na good guy. TOBY is revulsed by the scene in the clearing. He drops \nhis head, almost gagging. RHODES notices.\n\nRHODES\nYou'll get used to this, Tyler. It's the \nonly way. They don't bite the hand that \nfeeds.\n\t\nTOBY looks up. He can't conceal his contempt for the captain. RHODES \nreads it in his eyes and is about to say something when a SOUND \ndistracts him.\n\nONE OF THE RAG-TAG ZOMBIES is running amok. THE ZAPPERS poke at the \ncreature but that just makes it angrier.\n\nRHODES\nGET THAT THING AWAY FROM THE OTHERS!\nBRING IT HERE!\n\nONE TROOPER has A LONG POLE WITH A WIRE NOOSE ON THE END. He drops \nthe noose over the wild zombie's head and the wire tightens, biting \ninto the dead flesh on the thing's neck. The pole is long enough to \ncontrol the creature while keeping it out of reach.\n\n52\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nSARAH watches, repulsed but fascinated. CHICO is still fighting the \nheaves. Without warning, A ZOMBIE looms up directly behind CHICO. The \nman jumps forward, terrified. He crashes into SARAH who spins and \nsees the danger.\n\nTWO MORE ZOMBIES appear. Then A THIRD. These have no vests. They're \nrag-tag, bad ass and hungry as hell. ONE OF THEM grabs SARAH. She \nmanages to pull away but behind her CHICO panics. He raises his RIFLE \nand...RATTATATTATATT!\n\n53\tEXT. THE CLEARING - DAY\n\nRHODES hears the GUNFIRE. He seems pleased. He grins.\n\nRHODES\nWe have visitors. Let's go men.\n\nHe moves slowly towards the thicket followed by TOBY TYLER AND \nSEVERAL OTHER SOLDIERS. He reaches down to his belt and pushes one of \nTHREE BUTTONS on A UNIT that resembles a pager. ELECTRONIC BEEPS, \nlike the ones we heard earlier, come from the unit, this time in a \ndifferent pattern.\n\nTHE RED COAT ZOMBIES respond quickly. They draw their PISTOLS and go \nmarching off after their leader, grunting and snorting like bull \napes. RHODES' grin breaks into a wide-open laugh.\n\nRHODES\nHah! If only the rest of you ladies would \nobey orders the way they do.\n\n54\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nTheir cover blown, SARAH now raises her RIFLE. BUDDABUDDA!!!\n\nTHE SECOND ZOMBIE'S HEAD TURNS TO RED PULP and the thing pitches \nforward, dead.\n\nCHICO FIRES and THE THIRD ZOMBIE IS DESTROYED.\n\nSuddenly there is DISTANT FIRE, from the clearing. BULLETS WHIZ \nthrough the brush. The guerilleros duck for cover.\n\n55\tEXT. THE CLEARING - DAY\n\nTHE RED COAT ZOMBIES, shuffling forward abreast in a line, have \nOPENED FIRE. It's a grisly parody of foot-soldiering. The creatures \nare unsteady on their feet, their hands shake when they squeeze the \nstiff Army-issue triggers. BULLETS FLY this way and that, most of \nthem grossly off target.\n\nRHODES\nTHAT'S IT, YOU WORM-EATEN SLIME ! YOU FOUL-\nSMELLING, PUSS-FACED MAGGOTS! I TOLD YOU \nI'D FIND YOU REAL ACTION, DIDN'T I? YOU \nCORRUPTION! YOU FILTH! YOU'RE LEARNING! \nYOU'RE GETTING BETTER....GETTING \nBETTER...GETTING BETTER, YOU SCUM!\n\nThe trooper beside TOBY is another young man whose nickname is \nTRICKS. He and TOBY exchange glances as they trudge along behind the \ncaptain and his zombie red coats. Their eyes tell us that they both \nthink Rhodes to be insane, which of course he is.\n\n56\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nSARAH moves to retreat but CHICO lifts his rifle and FIRES wildly \ninto the clearing.\n\nCHICO\nNO! NOOOOO! NOOOOOOOOOOOOOOOO!!!\n\n57\tEXT. THE CLEARING - DAY\n\nTWO OF THE RED COATS ARE HIT, but not in the head. Their brains keep \nfunctioning and they march on.\n\t\nRHODES\nSPREAD OUT, MEN! OPEN FIRE!\n\nWhatever else he is, RHODES seems fearless. He stands in the open as \nhis human soldiers fan out. He notices that the RED COATS are out of \nammunition. He pushes another button on his belt unit and MORE BEEPS \nSOUND. THE RED COATS stop in their tracks. They dump the SPENT SHELLS \nfrom their weapons and reload using fresh rounds from their belts. \nTheir fingers are stiff. Three bullets fall to the ground for every \none that finds its way into a gun chamber.\n\nThe SOLDIERS HAVE OPENED FIRE NOW. They are closing in on the \nthicket.\n\n58\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nCHICO IS HIT high on the right side of his chest. SARAH FIRES A QUICK \nBURST out into the clearing as she tries to pull the man deeper into \nthe jungle.\n\nSuddenly, from right behind SARAH's back, comes A BLOOD CURDLING \nSCREAM. A DARK FIGURE LOOMS UP startling us all.\n\nMIGUEL\nBURN THE CHURCH! KILL THE PRIEST!\n\nIt's MIGUEL, sweating, his eyes sunken into deep black sockets. He is \ncharging toward the clearing with his AUTOMATIC BLAZING in his one \ngood hand. He thunders right past SARAH almost knocking her down.\n\n59\tEXT. THE CLEARING - DAY\n\nMIGUEL breaks out of the thicket into clear view of the SOLDIERS. \nRHODES sees the one-armed wild man and his grin dissipated slightly. \nHe draws his own PISTOL, an enormous Magnum, an elephant stopper.\n\nSOLDIERS, taken by surprise, scatter, TOBY AND TRICKS among them. \nMIGUEL'S BULLETS DRAW A LINE ACROSS ONE SOLDIER'S CHEST. He dies \ninstantly.\n\nMIGUEL\nKILL THE PRIEST! BURN THE CHURCH!\nBURN! BURN! BURN! BURN! BURN!\n\nNOW MIGUEL IS HIT but he keeps coming, his GUN SPITTING.\n\nANOTHER SOLDIER goes down, HIT IN THE MID SECTION.\n\nTHE PLATOON RETURNS FIRE.\n\nMIGUEL IS HIT SQUARELY IN THE CHEST. He falls to his knees. His RIFLE \nFIRES A LINE OF BULLETS INTO THE EARTH and the kicking of the gun \nknocks him back on his ass. He sits there bewildered for a moment, \nthen he looks up to find himself directly facing CAPTAIN RHODES.\n\nRHODES lifts his MAGNUM but MIGUEL is faster with his RIFLE. In the \nnext instant the muzzle is aiming straight for the captain's stomach. \nRHODES' smile disappears, re-placed by a sudden flush of fear. He \nfreezes.\n\nMIGUEL\nKill the priest.\n\nMIGUEL squeezes the trigger and his weapon CLICKS sharply. It's \nempty.\n\nThe captain's smile slowly returns. He pushes the \"Attack\" button on \nhis belt unit.\n\nTHE RED COATS advance, their PISTOLS reloaded. THEY FIRE, stiff-armed \nand fumble-fingered, at MIGUEL. He sees them moving towards him. \nSomething in his mind clicks and he recognises the creatures for what \nthey are...walking dead.\n\nTHE FIRST FEW BULLETS MISS. Then ONE HITS HIM IN HIS STUMP and \nreality gets even clearer. He starts to scream.\n\nTHE READ COATS walk closer, their dead eyes showing enjoyment of the \nsport. BLAM! BLAM! BLAM! BLAM!\n\nANOTHER ROUND HITS MIGUEL IN THE STOMACH. ANOTHER CREASES HIS HEAD. \nHe tries to stand up but he's too weak. A BULLET IN THE NECK stops \nhis screaming. Then HE'S HIT IN THE HEART. A BALL OF BLOOD PROJECTS \nOUT OF HIS MOUTH and he plops onto his back, dead.\n\nTHE READ COATS KEEP FIRING until their guns are empty again. RHODES \ncalmly pushes the \"Reload\" signal and the creatures obey.\n\nMIGUEL'S CORPSE twitches for a short time, then goes rigid.\n\n60\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nSARAH sinks against a cypress when she sees MIGUEL die.\n\nCHICO, in a state of blind panic, takes off along the edge of the \nthicket, his WOUND BLEEDING PROFUSELY.\n\n61\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nCHICO breaks through some brush to find himself face-to-face with \nTOBY TYLER'S GROUP OF SOLDIERS. He stops, reverses course, and ducks \ninto a cluster of palms. ONE OF THE SOLDIERS FIRES. \nRATTATATTATATTATATT!!!\n\nBULLETS RIP THE PALM FRONDS APART. There's a scream and CHICO \nsomersaults out into view. NEW WOUNDS BLEEDING ACROSS THE CENTER OF \nHIS CHEST.\n\n62\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nSARAH realises that this is her last chance to escape. She takes \nadvantage of the confusion and the NOISE and bolts into the jungle at \na full run.\n\n63\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nCHICO is still alive. He fumbles for his HOLSTERED PISTOL but before \nhe can draw it THREE TROOPERS are on top of him. TRICKS tromps a boot \non his hand. TOBY TYLER aims his RIFLE squarely at his sweating brow.\n\nCHICO\nYes...yes, do it...please...you can't let \nme die this way...please. Destroy me. A \nbullet...in the head...I don't want to \nbecome...one of...one of them.\n\nTOBY looks down at the man, at his TERRIBLE WOUNDS, clearly fatal \nones. TOBY clicks a shell into the firing chamber of his RIFLE. His \nfinger is just sliding under the trigger shield when CAPTAIN RHODES \nstrides up behind him.\n\nRHODES\nTake his weapon, Tyler.\n\nTOBY is startled by the voice at his back. He turns towards the \ncaptain, then he looks back down at the guerillero, hesitating..\n\nRHODES\nTake his gun, ass hole. He still has the \nstrength to pull a trigger.\n\nReluctantly TOBY obeys, reaches down for CHICO'S PISTOL.\n\nCHICO\nPlease...senor...destroy me...one \nbullet...please.\n\t\nRHODES\nMaybe. We'll have a little talk first. \nThen....maybe...I can help you out. String \nhim up.\n\nTHE THIRD SOLDIER reaches down and grabs the wounded guerillero under \nthe arms. TRICKS stoops to help. CHICO screams in agony when he is \nmoved. TOBY lunges in to help the others, thinking to ease the man's \npain.\n\nRHODES\nThey can handle it, Tyler. You've been \nbuckin' for a shit detail lately so here's \none you're gonna love. We've got two dead. \nCut the heads off and get the bodies \nunderground to the refrigerators. Fast. \nIt's a hot day.\n\nTOBY grimaces but doesn't speak. He turns and moves briskly towards \nthe clearing. RHODES watches him go.\n\n64\tEXT. THE CLEARING - DAY\n\nTOBY nears the spot where MIGUEL lies sprawled in A POOL OF BLOOD. \nRHODES calls from the edge of the thicket.\n\nRHODES\nTyler. Just our men. Not him.\n\nTOBY looks down at the remains of the one-armed guerillero.\n\nRHODES\nHis head stays where it is. He and I never \nreally had the chance to get acquainted. \nWhen he comes back...I'll get another shot \nat it... Ha ha ha ha...\n\n65\tEXT. THE CLEARING - DAY\n\nCLOSE ON CHICO. He's dangling from A ROPE which is tied over a tall \ntree, his feet ten feet off the ground.\n\nZOMBIES wander here and there. They've all received their rations. \nThe picnic is breaking up now. Occasionally one of them gets surly \nbut it doesn't amount to anything. SOLDIERS stand ready with ELECTRIC \nPRODS, OTHERS with GUNS.\n\nPARAPHERNALIA is being packed away. MEN CARRY EQUIPMENT in the \ndirection of the elevator.\n\nRHODES walks up beneath where CHICO is hanging. He's careful not to \nstep in too close. He doesn't want to get any DRIPPING BLOOD on his \nuniform.\n\nCHICO\nPlease....shoot me.\n\nRHODES\nAnd if I don't? If I don't you'll come back \nafter your death. You'll come back and find \nyourself hanging there...wanting to \neat...needing to eat human flesh. You hate \nthat thought, don't you? That's the \nultimate sin for most of you fools, isn't \nit?\n\nCHICO is weeping now. With a found spurt of energy he struggles \nagainst the rope. No use. It only brings pain.\n\nRHODES\nAfter hanging up there a few days you will \nbe mad for food...crazed! You will lust for \nit! YOU WILL BE WORSE THAN ANY OF THEM!\n\nCHICO\nNO...NOOOOOOO...SHOOT ME! SHOOT ME! \nSHOOOOOOOOOT MEEEEEEEEE!!!\n\nRHODES\nI'll bargain with you. How many of you are \non the island?\n\nCHICO\nTwo of us...only two of us...me...and him. \n(He nods towards MIGUEL'S CORPSE.)\n\nRHODES\nI don't believe you, rebel. Where are your \nheadquarters? On the mainland?\n\nCHICO\nThe mainland...is dead...a dead \nplace...nobody there...\n\nRHODES\nWhere are your headquarters, rebel? Tell me \nor I'll let you hang there \nforever...FOREVER!\n\nCHICO\nThere are no...headquarters. There are \nno...rebels. Only the walking dead. Don't \nyou see. They have won.\n\nRHODES\nThen why did you come here?\n\nCHICO\nTo look...look for a place...a place to \nlive in...an empty place...a... \nnew...place...\n\nRHODES\nHow did you know we were on this island? Do \nothers know? Will others come?\n\nCHICO\nNooooo. Believe me. There are no \nothers...no rebels...nobody...it's \nover...it's ooooo....\n\nThe man collapses, unconscious.\n\n66\tEXT. THE CLEARING - DAY\n\nCLOSE ON THE DISEMBODIED HEAD OF ONE OF THE DEAD SOLDIERS. TRICKS is \ndropping the thing into A LARGE PLASTIC BAG which obviously already \ncontains THE SECOND HEAD. TOBY wraps the mouth of the bag and begins \nto walk off. RHODES stops him.\n\nRHODES\nWhere are you going, Tyler?\n\nTOBY\nMy...\"detail\", sir. We're going to bury the \nheads.\n\nRHODES\nNo time for that. I'll take care of them.\n\nTOBY\nJust....following procedure, sir. They're \nentitled to burial.\n\nRHODES\nI said, I'll take care of them. Just leave \nthem there. Go help with the rest of the \ngear.\n\nRHODES has it in for TOBY (we'll find out why later), and of course \nthe feeling is mutual. TOBY sets the bag down on the ground and, \nseething, he trots off towards the rest of the platoon. TRICKS \nfollows.\n\nAfter a moment, RHODES motions with his head. THE SOLDIER WITH THE \nLONG NOOSE POLE steps into view with the CAPTIVE ZOMBIE, the one that \nran amok earlier. The man follows RHODES towards the jungle, dragging \nthe gurgling creature along, the wire noose digging into the thing's \nneck.\n\n67\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nCLOSE: as RHODES' GLOVED HAND jams A HAND GRENADE into THE CAPTIVE \nZOMBIE'S gaping mouth. THE SOLDIER WITH THE POLE releases the noose \nand the two men take off, running.\n\n68\tEXT. THE CLEARING - DAY\n\nThey run to the middle of the clearing where they turn around to \nwatch. RHODES lifts A PAIR OF BINOCULARS that are strapped around his \nneck. He stares through the lenses, focusing, grinning.\n\n69\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nTHROUGH THE BINOCULARS: We see THE ZOMBIE staggering in the bush, \nclawing desperately at the thing jammed in its mouth.\n\n70\tEXT. THE CLEARING - DAY\n\nTOBY AND TRICKS are the only ones who seem to notice what RHODES has \ndone. TOBY drops THE CRATE he was going to carry off. He stares in \ndisbelief, hatred on his face.\n\n71\tEXT. THE JUNGLE NEAR THE CLEARING - DAY\n\nWIDE SHOT as THE HEAD OF THE ZOMBIE DISINTEGRATES WHEN THE GRENADE \nEXPLODES.\n\n72\tEXT.\tTHE CLEARING - DAY\n\nRHODES grins as he watches the spectacle.\n\nSuddenly, A LOUD GUNSHOT startles the captain. He drops the \nbinoculars and spins around. He sees...\n\n...CHICO'S BODY DANGLING ON THE ROPE. CHICO'S HEAD IS BLOODY. He's \ndead...and won't come back to life. He's been shot through the brain.\n\nRHODES\nWHO FIRED THAT SHOT? WHO FIRED THAT SHOT?\n\nSOLDIERS stand around dumbly. Those with RIFLES in their hands \nquickly sling them onto their shoulders. They're all afraid of the \ncaptain's wrath. RHODES walks towards the line of men with fury in \nhis eyes.\n\nRHODES\nGoddammit, somebody's gonna tell me who \nfired that shot or I'll have every last one \nof you chopped up for feed!!!\n\nHis eyes spot TOBY, standing behind the crate he dropped earlier, his \nrifle slung.\n\nRHODES\nStep up here, Tyler.\n\nTOBY\nSir!\n\nTOBY shouts the word like a West Point cadet and he bravely steps \nforward. RHODES stares him down, his anger turning sinister.\n\nRHODES\nYou fired that shot, didn't you?\n\nTOBY\nNo, sir.\n\nRHODES\nLet me see your weapon.\n\nTOBY hands over his rifle. RHODES feels the barrel, sniffs it.\n\nRHODES\nIt's been fired.\n\nTOBY\nIn the battle, sir.\n\nRHODES is sure he's found the guilty man and he's glad it turned out \nto be his favourite whipping boy. His body relaxes visibly.\n\nRHODES\nIt may be that none of these chicken-shits \nwill talk while the whole troop is \npresent...but I know some of these men \nwell. I'm sure that a few private \nconversations will tell me what I already \nknow. You may have earned yourself some \ntime in the Stalag, Tyler.\n(Rhodes glances over at CHICO'S body)\nCut him down. That's another head for you \nto chop off. Leave it with the others. Take \nthe rest of his body down to the freezers. \nMove it, shit hill.\n\nTOBY moves off. RHODES' grin returns.\n\nCUT TO:\n\n73\tINT. THE CAVE ENTRANCE - EVENING\n\nThere's that GIANT SOUND again, the RUMBLE OF THE ELEVATOR. We're \ninside the place called THE CAVE, in a huge under-ground concrete \nbunker. TECHNICIANS AND ARMED GUARDS bustle around. Enormous \nhydraulic pistons are bringing the camouflaged iron plate down from \nthe surface. Riding on board, RHODES AND HIS PLATOON prepare to \nunload their paraphernalia.\n\n74\tEXT. THE JUNGLE - EVENING\n\nSARAH, sweating, exhausted, BLEEDING FROM CUTS made by jungle \nbranches, wrings out a piece of cloth torn from her sleeve. She has \ndipped it into a jungle stream. Cautiously she tastes the water, \ndecides to chance it and squeezes the cloth into her mouth.\n\nThe NIGHT BIRDS suddenly stop their singing and the quiet makes SARAH \nlook up. Standing across the stream, only ten feet away, is A \nPARTICULARLY GROTESQUE ZOMBIE. VULTURES stand on the marshy ground \nbeside the creature's legs, THEIR SHARP BEAKS PICKING BLOODY HOLES IN \nITS ANKLES AND FEET.\n\nSARAH jumps to her feet, fighting back exhaustion one more time. She \nunslings her RIFLE, aims it, then thinks better of firing. Grabbing \nup her SUPPLY PACK she runs into the darkening jungle.\n\n75\tEXT.\tTHE JUNGLE - EVENING\n\nWHAM! TWO BIG HANDS GRAB SARAH by her shoulders. She starts to scream \nbut one of those hands shoots up to cover her mouth.\n\nJOHN\nIt's alright. It's alright. Don't be \nafraid. We're friends.\n\nSARAH looks into the strong, good face of JOHN, a tall muscular man, \na Caribbean Islander with shiny black skin and enormous brown eyes \nthat seem instantly trustworthy.\n\nJOHN\nThere are soldiers near here. Guards. I'll \ntake my hand away if you won't scream.\n\nSARAH nods and JOHN lets her go. There are two other humans standing \nbehind the big man. There's BILL McDERMOTT, wearing the grease-\ncovered jump-suit of a mechanic and swilling generous shots of brandy \nfrom a hip flask, and there's a smallish woman with a sensitive face \nwho, apparently out of character, is armed to the teeth. She's a deaf \nmute, nicknamed SPIDER, and she is urgently signing \"Come on! Let's \nget outa here!\" with her hands.\n\nJOHN\nRight. We better get away from that Bee. He \nmight have friends.\n\nTHE GROUP starts moving. SARAH follows voluntarily. We notice that \nall three strangers are wearing the same pullover vests that we saw \non the foot soldiers, the ones with big orange circles.\n\n76\tEXT. THE JUNGLE - EVENING\n\nTHE GROUP trudges through thick brushland, occasionally needing to \nchop a path with their blades. JOHN speaks in low tones as they move.\n\nJOHN\nBees. That's what we call the dead... the \nwalking dead...here on Gasparilla's island.\n\n SARAH\nGasparilla?\n\nJOHN\nHe was a pirate who sailed these waters \nlong ago. His name is bein' borrowed these \ndays by the long lost Henry Dickerson.\n\nSARAH\nGovernor Dickerson? Of Florida?\n\nJOHN\nThat's the man. He's been holed up here \never since the shit hit the fan. Him and \nhis family owned these islands 'round here. \nThey was leasin' this one to the Fed. The \nwhole underneath is dug out. There was \nmissiles here and laboratories and bomb \nproof housing, nuclear power, all o' that. \nNow this is Dickerson's....Gasparilla's... \nprivate fortress. Him and a bunch o' his \ncronies from all the best golf courses in \nTallahassee...and his private army, of \ncourse.\n\nSARAH\nWe ran up against a platoon of soldiers. \nThere were actually walking dead...in \nuniform...with guns.\n\nJOHN\nCaptain Rhodes and his Red Coat Bees. They \ncould sting, sister. We know you came up \nagainst 'em. We been watchin' you since you \nlanded. Couldn't help. I'm sorry for that. \nWe ain't supposed to be outside. If we was \nspotted it could....well, it could be the \nend of everything.\n\nSPIDER is signing for everyone to be quiet. They all stop in their \ntracks. BILL McDERMOTT swigs some more brandy. With the stealth of a \nMohican SPIDER pushes aside the branches of a giant oleander and \npeers through.\n\n77\tEXT. ENTRANCE TWO - EVENING\n\nThere's A HATCHWAY in sight built into A CONCRETE, BUNKER LIKE \nSTRUCTURE. FOUR OR FIVE SOLDIERS are coming up out of the ground. \nThey're armed with PRODS AND RIFLES.\n\nBehind the men, lurching on unsteady feet, come A HALF-DOZEN OF THE \nLIVING DEAD, all wearing vests of white and blue.\n\nBehind the lumbering creatures come A WOMAN AND A MAN both wearing \nwhite laboratory coats and carrying clipboards. The woman is MARY \nHENRIED, one of the top behaviouralists in The Cave. (We'll learn a \nlot more about her later.)\n\nTHE ZOMBIES are pushing through the undergrowth right in the \ndirection of SARAH and her friends. SARAH shows some alarm at this \nbut JOHN calms her with a strong hand.\n\nSPIDER has seen the approaching danger. She silently draws A FARMER'S \nSICKLE from her belt. (With her other hand she draws A PISTOL for \ngood measure.) BILL McDERMOTT unarmed, nervously takes another \nswallow from his flask.\n\nTHE ZOMBIES are getting closer. Too close for comfort.\n\nFinally, MARY HENRIED and THE OTHERS turn and disappear into the \nbunker. The last man down pulls the hatch shut.\n\nThe moment the coast is clear, SPIDER AND JOHN jump up from cover. \nTHE OTHERS follow their lead. But it's too late. THE ZOMBIES have \nspotted them. The creatures begin to growl and make AGITATED, APE-\nLIKE SOUNDS. SPIDER brings her BLADE up chest-high, ready to repel an \nattack. SARAH lifts her own MACHETE but JOHN reaches over and takes \nit away from her.\n\nJOHN\nGive that to me. Get behind me. Stay behind \nme.\n\n(SARAH resists, not understanding, somewhat \ninsulted.)\n\nYou ain't wearin' a vest. They been taught \nnot to touch the ones with the circles. \nThere ain't no hundred percent, all-a-time \nrules with the Bees, but most-a-time they \nleave us alone. The colour on their vests \ntell ya how much schoolin' they got. It's \nthe ones without colours you gotta watch \nout for.\n\nSARAH gets behind JOHN, his orange circle acting as her shield. He \nreaches around with one strong arm and pulls her in tight against his \nback.\n\nTHE ZOMBIES, snarling and showing teeth, move through the thicket. \nONE shuffles right past SPIDER AND McDERMOTT. It gets stuck in the \nbramble, changes course and moves on without attacking.\n\nANOTHER ZOMBIE, a \"white\", trudges within arm's reach of JOHN, \ngrowling all the while. Suddenly it reaches its arms out and takes \ntwo angry steps towards the humans who back away.\n\nTHE ZOMBIES charges. Things happen quickly. JOHN pushes SARAH away \nand swings the MACHETE. THE BLADE SINKS INTO THE CREATURES SKULL. \nBLACKENED BLOOD FLIES. An instant later SPIDER'S SICKLE PUNCHES IN \nBESIDE THE BIG KNIFE. THE ZOMBIE twitches for a moment, its eyes \nrolling, then it falls, lifeless, to the ground.\n\nMcDERMOTT trots up beside SARAH. He takes a huge swallow from his \nflask then offers some to her. She puts the flask to her lips but \nnothing comes. She holds it out, neck down, to show that it's empty.\n\nMcDERMOTT\nSorry. Guess I don't know my own strength.\n\nJOHN wipes SARAH'S MACHETE on some thick leaves, cleaning off most of \nthe gore, then he returns the weapon to the woman.\n\nSARAH\nThanks. I can fight my own battles.\n\nJOHN\nI know you can. Like I said, we been \nwatchin' you.\n\nMcDERMOTT\nWe better get as far away from here as we \ncan. We can work the other side of the \nisland tonight.\n\nJOHN\n(explaining) We found nine entrances to the \nCave so far, and we ain't got the whole \nthing near charted yet. That's what we was \ndoin' out here today. Huntin' for \nentrances.\n\nMcDERMOTT\nCome on. They find a Bee done like this and \nthey'll know somebody's been out walkin' \nwhere they shouldn't have been.\n\nJOHN bows his head over the downed ZOMBIE. He mumbles softly. We \ncan't hear the words but we can tell that he's praying, reciting the \ngood words over the corpse of the \"white-coat\".\n\nSARAH\nThe man I was with...until today... \nbelieved that praying was for blind men who \ncouldn't see the truth.\n\nJOHN\nHow we gonna break the curse without a \nprayer or two.\n\nSARAH\nCurse?\n\nJOHN\nWhat is it if it ain't a curse?\n\nSARAH\nIt's a disease. It's a...a bug...a parasite \nthat infects the brain.\n\nJOHN\nThat sounds like a curse to me.\n\nSARAH\nWe thought we were escaping here. We \nthought we'd found an uninhabited island. \nChrist! This place is a worse nightmare \nthan anything I've seen yet!\n\nJOHN\nI'm sure that's true, miss. And that's why \nwe're doin' what we're doin'. What's \nhappenin' underground here is just what \nLucifer planned for this sinful race o' \nman. But we're gonna beat Lucifer. We're \ngonna put an end to what's happenin' here.\n\nSARAH\nOh, what did I run into? A bunch o' Jesus \nnuts? Religiosos? Prayer won't stop a \nbullet from one of those storm troopers and \nprayer won't keep one of those monsters \nfrom eatin' your liver for lunch.\n\nJOHN\nThat's why we didn't use prayers on this \nhere white coat 'til after he was \ndestroyed. We ready to fight when we have \nto. And we gotta fight now.\n\nSARAH\nLook. I BEEN fightin', mister. I been \nfightin' for what feels like a hundred \nyears and I'm finished. I don't need \nreligion. I don't need prayers. I need a \ncouple guns and a couple hands. We can sail \non outa here. Find another island where \nthere ain't so much....traffic.\n\nJOHN\nYou think you can find your boat? There's a \nthousand little inlets and backwaters all \nthrough here. You remember all the ways you \nturned to get where you are now? You leave \nyourself a trail?\n\nSARAH is stopped by this. She stares at the big man suspiciously, not \nsure whether to believe him.\n\nJOHN\nWe didn't see the exact spot but we know \nabout where you landed. But we ain't ready \nto take you there. Not yet. You see...we \nneed guns, too.\n\nSARAH looks around her at the unlikely band of guerillas. She thinks \nfor a moment...not very long...then she turns and starts off into the \njungle.\n\nSARAH\nI can find it myself. I didn't come that \nfar.\n\nJOHN\nFarther than you think. You'll get lost. \nYou will. And there's Bees all through the \njungle. I ain't lyin' to ya. Religiosos \ndon't lie.\n\nSARAH\nNo. They just try to hold you for ransom. \nFuck you, Moses! I'm outa here!\n\nSARAH plunges into the brush and without so much as a look back over \nher shoulder she disappears.\n\nMcDERMOTT\nWe can't let her go, John.\n\nJOHN\nWe don't need her guns that bad. Billy boy. \n(He's joking.)\n\nMcDERMOTT\nThe hell we don't! But that's not what I \nmean. She'll be dead in ten minutes out \nthere alone. That or she'll be firin' off \nher automatics and wakin' up the troops.\n\nJOHN\nWe'll split up. Billy, you go with Spider. \nJust an hour or two tonight, that's all. \nRhodes might have extra guards on after all \nthe commotion. We'll meet up at number six \nand go back home together.\n\nMcDERMOTT\nGod save us. And me with me flask dry. I'll \nnever make it.\n\nTHE GROUP splits up, moving off in two different directions through \nthe darkening underbrush.\n\n78\tEXT. SOMEWHERE IN THE JUNGLE - NIGHT\n\nDARKNESS has fallen. The jungle is as black as the background on a \nvelvet painting.\n\nSARAH is moving cautiously. She bumps into something, jumps back, her \nMACHETE high, and freezes. Cautiously she moves ahead...one \nstep...another...another...\n\nSPLASH!!! She steps down off a hidden ledge into A KNEE-DEEP RIVER. \nShe manages to keep her balance but her MACHETE falls into the water \nand drops to the bottom invisible in the dark silt. Slowly she bends \ndown and reaches into the water. A SNAKE swims past just inches away. \nSARAH recoils. Before she can reach down again she hears A LOUD, \nANIMAL SNORT followed by A GREAT SPLASHING SOUND. Then ANOTHER. She \nsquints to see.\n\nSHAPES approach on the black water. ALLIGATORS, big ones, just their \nvery tops showing as they move on a straight course toward the woman.\n\nShe backs up feeling for the shore, for the ledge behind her. THE \nFIRST ZOMBIE GRABS HER SHOULDERS. She spins and sees the thing. It \nhas one eye dangling out of its socket and there's a broken-off \nlength of wooden pole stuck clean through its torso just under the \nleft breast.\n\nSARAH smashes her RIFLE BUTT INTO THE THING'S HEAD. AGAIN. AGAIN. It \nkeeps coming. (So do the gators. They're getting to within a few \nyards.) SARAH swings a fourth time. THE ZOMBIE grabs her rifle. She \npulls with all her might and the creature, hanging on to the gun, \ntopples off the ledge and into the water.\n\nWhen SARAH starts to climb up on the ledge, ANOTHER ZOMBIE lurches \ntowards her from dry land. She spins around, looking for options. The \ngators are just about close enough to bite her ass and THE ZOMBIE \nthat fell into the river is rising up again, covered with moss and \nslime and looking pissed.\n\nSARAH faces THE ZOMBIE on the bank. She has no choice. She aims her \nAUTOMATIC. She's just about to fire when SOMETHING FLASHES out of the \ndarkness. It's A MACHETE. IT CLEAVES OPEN THE ZOMBIE'S SKULL. From \nout of the night big JOHN appears. He struggles to free his blade \nfrom the dead creature's head.\n\nSARAH scrambles up onto the muddy ledge. THE GATORS are still moving \nin and THE ZOMBIE, its moss-covered arms reaching out rigidly like \nthe arms of Frankenstein's monster, is growling ferociously (almost \nswallowing its own dangling eyeball in the process).\n\nSARAH\nAre you gonna pause to say words over the \ndead this time or can we be on our way?\n\nWithout answering, JOHN steams off through the bush pulling SARAH \nalong behind him, his big hand tight around her arm.\n\n79\tINT. THE CAVE - NIGHT\n\nCLOSE on: A TELEVISION SCREEN. First there is only VIDEO NOISE, then \nan image blinks onto the screen.\n\nMONTAGE: OTHER VIDEO SCREENS on MONITORS in various places throughout \nthe huge underground facility. ZOMBIES watch the screens gathered in \ngroups of four, six and eight, like children in ranked classes.\n\nThe screens show scenes of ZOMBIES taking FOOD from humans in ORANGE \nCIRCLE VESTS. GUNS are pointed at ORANGE CIRCLES then lowered \nharmlessly. GUNS are pointed at HUMANS without orange circles and \nFIRED. The images repeat and repeat and repeat. THE ZOMBIES watch the \nscenes with dumb curiosity.\n\n80\tINT. COMMUNICATION CENTER IN THE CAVE - NIGHT\n\nThis is the central area for all varieties of communication. There \nare RADIO CONSOLES, both intercom and outgoing, there are VIDEO \nCONTROL PANELS and there are LARGE COMPUTER TERMINALS. Reflecting the \npanic to set up operations back when the disaster first struck, much \nof the equipment is placed haphazardly and not built in. WIRES run \nevery which way, BARE ANTENNAS AND LOOSE CONNECTORS clutter the \nplace. ENGINEERS scurry with TOOL BOXES constantly repairing, \npatching, trouble shooting.\n\nMost of the personnel are TECHNICIANS but there is a group of \nSCIENTIFIC TYPES, obvious in their white lab coats. Among these is \nMARY HENRIED, who we caught a glimpse of outside Entrance Two.\n\nAt A SECURITY STATION, A GUARD notices something on one of his own \nVIDEO SCREENS which monitor key locations inside The Cave.\n\nGUARD\nThere's activity in the dormitory!\n\nMARY and one of her assistants, JULIE GRANT, a younger girl, move \nover to the video console. ONE SCREEN there shows what looks like a \nprison corridor. CELLS WITH HEAVILY BARRED DOORS run down both sides. \nWe can see the distinct MOVEMENT OF SHADOWS in the corridor. MARY \nreacts instantly stepping over to AN INTERCOM and pressing A SEND-\nBUTTON.\n\nVOICE (o.s. - filter)\nGate twenty-three.\n\nMARY\nThis is Mary Henried. Did anyone enter the \ndormitory?\n\nVOICE (o.s. - filter)\nYes, ma'm. Captain Rhodes.\n\nMARY clicks off, infuriated. She hurries towards AN EXIT followed by \nJULIE GRANT.\n\n81\tINT. THE DORMITORY IN THE CAVE - NIGHT\n\nCLOSE ON: THE MOUTH OF A LARGE PLASTIC BAG. A HAND wearing A BLACK \nLEATHER GLOVE pulls A HUMAN HEAD out of a bag by its hair. It's the \nhead of one of the dead soldiers from Rhode's platoon. The hand \nbelongs to RHODES himself.\n\nIn the darkness of A CELL, A RED COAT ZOMBIES takes a hesitant step \nforward. RHODES tries to shove THE HEAD through the bars but IT \nSTICKS. When RHODES lets go it stays there, wedged at shoulder \nheight.\n\nRHODES\nTake it, friend. Take it. It's a present. \nFrom me to you.\n\nTHE RED COAT steps forward and lays its hand on THE HEAD.\n\nRHODES\nJust remember who gives you favours.\n\nTHE ZOMBIE pulls hard and THE HEAD pops through onto its side of the \nbars. The creature lurches off towards A COT in the shadows at the \nrear of the cell where it hunkers down and begins to RAVISH THE HEAD, \nTEARING FLESH OFF, EATING IT hungrily.\n\nOn the cell door we notice A PLAQUE with a number (5) and, written in \nmarker, the Red Coat's nickname, \"BLUTO\".\n\nRHODES moves past OTHER CELLS, each holding A NICKNAMED RED COAT. \nGRUMPY stands way back in the shadows. TONTO stands near the bars, \ngrowling. FATSO is swaying back and forth like a chubby five year old \nwho needs to pee.\n\nRHODES stops at A CELL marked \"BUB!\". Inside we see A SILHOUETTE, \ntall, erect, not moving a muscle. RHODES grins.\n\nRHODES\nWell, Bub. I've heard about you. Miss \nHenried's pride and joy.\n\nRHODES steps closer and BUB snarls warningly.\n\nRHODES\nSurly sonofabitch. I want to make friends, \nBub. Friends. I have one more goodie in my \nsack here.\n\nA LOUD, CLANGING SOUND interrupts. RHODES turns to see.\n\n82\tINT. THE DORMITORY - NIGHT\n\nMARY HENRIED AND JULIE GRANT have entered through A STEEL DOOR WITH \nELECTRONIC LOCKS. THE ZOMBIES send up A CHORUS OF MOANS AND GROWLS. \nThe women start down the corridor checking cells as they pass. \nSuddenly they stop in their tracks, their horrified eyes staring into \nA CELL marked \"SAMSON!\".\n\nSAMSON is nibbling on ANOTHER HEAD. Much of the flesh is already \ngone, but we can still recognise...CHICO. The zombie turns the thing \nup-side-down, reaches way inside, through the neck, and pulls out \ngrey matter.\n\nJULIE backs away, fighting nausea. A spasm rises in MARY'S stomach as \nwell and she reels away from the hideous sight.\n\nRHODES\nCome, come, Miss Science. You've seen \nworse.\n\nMARY\nGod....damn you, Rhodes!\n\nRHODES\nGod has damned us all. Are my atrocities \nworse than yours?\n\nMARY\nYou have ruined weeks of work here! We've \nbeen trying to wean these specimens onto \nalligator meat!\n\nRHODES\nNo wonder they're so....hungry.\n\nSuddenly JULIE SCREAMS, her hands flying to her mouth.\n\nTHE PLASTIC BAG is still dangling from RHODES' GLOVED HAND. Inside, \npressed into the thin plastic, we can see the rough outline of THE \nFINAL HEAD. THE THING IS SQUIRMING causing the whole bag to wiggle.\n\nRHODES drops the bag instantly to the floor. Taking care, he grabs \nthe bottom by a loose corner and pulls up hard. THE HEAD ROLLS OUT \nAND SETTLES AGAINST A WALL. IT'S EYES ARE OPEN AND DARTING CRAZILY, \nITS MOUTH IS CHEWING, GROTESQUELY, ON THE AIR.\n\nMARY stares in shock. JULIE runs towards the exit, trying to scream \nbut gagging on her own acids. She's hysterical.\n\nRHODES calmly draws his PISTOL, cocks, and FIRES. THE SQUIRMING HEAD \nIS SHATTERED by the powerful bullet.\n\n83\tINT. MARY'S OFFICE IN THE CAVE - NIGHT\n\nA 9 BY 12 CUBICLE with A SMALL COMPUTER TERMINAL, A DESK AND THREE \nCHAIRS. There's A LIGHTBOX on the wall displaying GROUPS OF CRANIAL \nX-RAYS.\n\nMARY guides JULIE GRANT into a chair. RHODES stands cockily in the \nopen doorway.\n\nJULIE\nI didn't realise! Those were de-caps! I \ndidn't know that....de-caps... revived!\n\nRHODES\nAny dead whose brains are intact will \nrevive.\n\nJULIE\nBut...we bury the heads. Oh. God! It must \nbe torture for them!\n\nRHODES\nThey are brutes without feeling. Though I \nadmit that I've requested cremation for \nmyself. Burial is an archaic tradition, \neven more ridiculous now than it ever was. \nTo say nothing of the...spacing \nproblem...on a small island like this.\n\nJULIE\nI thought the purpose of decapitation was \nto...to...\n\nRHODES\nThe purpose of decapitation is to preserve \nas much...food...as possible. The purpose \nfor feeding is to keep the beasts on our \nside. The fact that they can be taught to \nclean up our garbage or to fire a gun is a \nconvenient side benefit, not the primary \ngoal. The primary goal is to keep ourselves \nfrom becoming their supper. Keep them fed \nand they behave. Keep them hungry and they \nrevert back to being the animals that they \nhave always been. You saw them in there.\n\nMARY\nYou gave them a fresh taste of blood!\n\nRHODES\nThey will never be satisfied with anything \nelse, Miss Henried. They want human flesh. \nI'm prepared to take whatever steps are \nnecessary to see to it they don't get mine! \nNot while I'm still using it!\n\nJULIE has calmed herself down. Now she feels angry, betrayed. She \nlooks at MARY accusingly.\n\nJULIE\nDid you know? About the de-caps?\n\nMARY\nI'd never seen it before.\n\nJULIE\nBut you knew.\n\nMARY nods in the affirmative. Tears form in JULIE'S eyes.\n\nJULIE\nWhat else is there, doctor? What else do \nyou people know that the rest of us don't?\n\nThey stare at one another. Whatever bond once existed between them \nhas been severed forever.\n\n84\tINT. A CONDITIONING ROOM IN THE CAVE - NIGHT\n\nThere are CARDIOGRAPHS, E.E.G. MONITORS, AND ALL SORT OF PHYSICAL \nCONDITIONING DEVICES. On TABLES lie SYMBOLOGY CARDS AND COLOURED \nBLOCKS for dexterity testing. There are LARGE CUT-OUT SHAPES on the \nwalls, TRIANGLES, SQUARES and familiar ORANGE CIRCLES.\n\nMARY storms into the room flinging the door shut behind her. RHODES \ncatches it with his BLACK LEATHER GESTAPO BOOT.\n\nRHODES\nYou can't run away from the planet, Miss \nScience. You can't even run away from the \nisland, heh heh.\n\nMARY\nLeave me alone, you...COCKSUCKER!!!\n\nRHODES laughs loudly. MARY faces him, hatred boiling away her \nvocabulary. She can't think of word that are adequate.\n\nMARY\nYou're....you're disgusting! \nYou're....FILTH!\n\nRHODES\nAnd you're the one who builds the bomb and \nthey says, 'I hope it'll never actually be \nused'.\n\nMARY is stopped...by her own guilt. She turns and busies herself \ngathering books and papers, then she CLICKS OFF A LIGHT and moves \ntoward the doorway where RHODES stands.\n\nMARY\n(calmer, with method) Julie Grant is a \nbehaviouralist. She's not medical. She \nhasn't been as...exposed to...to \nthings...as some of the rest of us. She'll \nbe alright. I'll talk to her. She'll be \nalright.\n\nRHODES\nOh, I have no doubt.\n\nMARY\n(recognising threat in his voice) If you \nput her on the shit list because of her \nreaction here tonight I'll go to Dickerson.\n\nRHODES\nAh, yes, our noble Gasparilla does seem to \nfavour you lately. I understand he assigned \nyou a roommate of your choice. The rest of \nus have to pick names out of a hat. \n\nMARY\n(reading his jealousy) Rhodes, you and I \nhad a roll in the hay together when I first \ngot here. It was a wholly unsatisfying \nexperience which I do not want to, and \nwhich I never will repeat! So give up, \nmister! I'm going home...to that roommate \nyou mentioned.\n\nMARY pushes past RHODES into the hallway.\n\n85\tINT. THE HALLWAY OUTSIDE THE CONDITIONING ROOM - NIGHT\n\nMARY starts down the hall but RHODES grabs her from behind. He leans \nin close, lusting, pressing his lips against the back of her neck.\n\nMARY\nTake your hands off me! Right now!\n\nAn evil grin returns to RHODES' flushed face. He stares at the woman \nfor a long moment, then he lets go. MARY walks away, bristling. \nRHODES calls after her.\n\nRHODES\nMaybe you'll change your mind when it \nstarts getting too lonely for you.\n\nMARY stops dead. She turns back to see him gloating.\n\nRHODES\nI'm not entirely without influence myself, \nMiss Science. I had your roommate \nassigned...by Gasparilla... to my platoon. \nWhat's his name? Tyler? Yes. Toby Tyler.\n\nA bubble of fear pushes up in MARY'S throat but she is only letting \nher anger show. Her stare is fierce, her eyes daggers.\n\nRHODES\nI had an unfortunate little run-in with him \ntoday. In fact...you might say that Mr. \nTyler is in big trouble with \nthe...authorities.\n\nMARY\nYou better not mess with me, Rhodes. I'd \nlove to serve your balls to those Red Coats \nfor lunch! Think about it!\n\nRHODES\nNo, Miss Science. You're the one who needs \nto do some thinking.\n\nHe turns and walks away. MARY stands still for a time, THE SOUND OF \nRHODES' CLICKING BOOTHEELS surrounding her, swallowing her. In the \nDEEP BACKGROUND we can HEAR THE MOANS OF THE CAGED DEAD.\n\n86\tINT. THE CENTRAL CHAMBERS OF THE CAVE - NIGHT\n\nMONTAGE: as MARY walks through HUGE OPEN AREAS CARVED OUT OF NATURAL \nROCK. We are stunned at the enormity of the place. JEEPS AND TRUCKS \nRUMBLE back and forth. Storage areas hold MOUNTAINS OF CRATES, \nCARTONS, WATER AND GAS CANISTERS. FORK LIFTS shift loads from here to \nthere.\n\nMARY comes to a place where the natural rock surrenders to man-made \nwalls. She enters past TWO SECURITY GUARDS, showing her I.D.\n\n87\tINT. THE RESIDENCE - NIGHT\n\nMARY moves down A CORRIDOR with NUMBERED DOORS on both sides. We HEAR \nTHE SOUND OF LIFE, MUSIC BLASTING, VOICES LAUGHING, ARGUING, CRYING. \nPEOPLE move by. A MAN AND A WOMAN are fighting. She slaps him, he \npunches her, she kicks him in the balls. THREE HOOKERS pound on a \ndoor. The door is opened by A NAKED MAN WEARING A DILDO on his nose. \nOTHER MEN, behind him, laugh wildly as the hookers enter their smoke-\nfilled room.\n\nMARY stops in her tracks when she sees that outside A DOOR NUMBERED \n83 (the door to her quarters) there are TWO OF RHODES' SOLDIERS with \nRIFLES in hand. The door itself is open and SHADOWS move inside.\n\nMARY turns quickly, before she is spotted, and starts back through \nthe hallway. As she turns a corner she is grabbed by TOBY TYLER.\n\nMARY\nToby...thank God...wait here. I gotta find \nout what's goin' on.\n\nTOBY\nHey. Slow down. What is it?\n\nMARY\nSome of Rhodes' men. At the door.\n\nTOBY\nThat bastard. I didn't think he'd make his \nmove so fast.\n\nMARY\nIt's because of me.\n\nTOBY\nOh, bullshit, Mary. It's because Rhodes is \na prick.\n\nMARY\nI want you to leave. Then maybe...\n\nTOBY\nWe're both gonna leave. Leave the island. \nI've been talkin' to Tricks. We think we \ncan smuggle out one of those inflatable \nrafts. They're crated up real small. \nThey've got air canisters. There's food \ninside. Even a little motor.\n\nMARY\nI am not...a guerilla fighter, Toby. I'm \nnot a pioneer. I'm not...I'm not strong \nthat way. I need...\n\nTOBY\nNeed what? Civilised order like we have \ndown here? Christ!\n\nMARY\nI can work here. Maybe my work can \nhelp...help everyone. I can do more good \nwith access to this equipment than I can \noff in some wasteland.\n\nTOBY\nFor the good of mankind. That's what every \nmonster-maker says.\n\nMARY looks into TOBY'S eyes. She's hurt, yet angry. The kind of anger \nthat comes involuntarily when somebody strikes an already sensitive \nguilt-nerve.\n\nTOBY\nWe're gettin' out. Me and Tricks. I want \nyou to come with us. I want that more than \nanything. I'll send word. I'll let you know \na time and a place to meet. We probably \nwon't be able to wait around so if you're \nnot there on the dot...well...if you're not \nthere, I'll know you're not comin'.\n\nShe grabs him, holding him tightly against her. They kiss, hard and \nlong. TOBY pulls away, looks at her lovingly, then turns and starts \ntoward the guarded apartment. MARY follows.\n\nTOBY\n(walking) I don't know what they're gonna \ndo to me. I figure they'll just send me out \nto Stalag Seventeen but if...if it's worse \nthan that...Tricks will know. Stay in touch \nwith Tricks.\n\nAs they approach the door to number 83, THE SOLDIERS there raise \ntheir RIFLE to ready positions.\n\nSOLDIER\nYou Tyler?\n\nTOBY\nYes.\n\nSOLDIER\nYou're under arrest. I'll take your weapon.\n\nTOBY hands over his RIFLE and begins to unbuckle his PISTOL BELT. TWO \nMORE SOLDIERS appear from inside the open apartment.\n\nMARY\nWhat's he supposed to have done? What are \nthe charges?\n\nSOLDIER\nDunno, ma'm. We're on orders.\n\nMARY\nLook...I'm Mary Henried. I'm with the \nspecial conditioning center. I'm not \nwithout influence...\n\nTOBY\n(calmly) Mary.\n\nMARY\nI'll have somebody's ass for this. I'll \nhave your ass, soldier. I'm not gonna stand \nhere and...\n\nTOBY\n(more insistent) MARY!\n\nShe gives up. She looks into TOBY'S eyes.\n\nTOBY\nI'll be alright. Just remember the things I \nsaid. Take care of yourself.\n\nTHE SOLDIERS escort TOBY down the hall without force. MARY watches \ntheir backs for a time, then she flings her BOOKS AND PAPERS angrily \ninto the open apartment. She begins to cry.\n\n88\tEXT. ENTRANCE NUMBER SIX - NIGHT\n\nHATCHWAY NUMBER SIX is surrounded by PROTECTIVE FENCING and, from it, \nA FENCED ALLEYWAY runs off through the brush toward...we don't know \nwhat yet.\n\nTHE HATCH OPENS and TOBY, along with TWO OTHER PRISONERS, also \ndisarmed troopers, is led down that alleyway by THREE GUARDS.\n\nJOHN, SARAH AND BILL McDERMOTT peer out from nearby foliage. They \nwatch the procession. John whispers.\n\nJOHN\nThe fences make a safe pathway to Stalag \nSeventeen. That's where we live. That's \nwhere you gonna live, too. Hell's half \nacre. It's not a nice place. Them boys \nthere is prisoners. What's their \npunishment? They sent out to the Stalag for \na few weeks. That's punishment enough.\n\nSPIDER seems to appear from nowhere. She motions and the others \nfollow her through the thick jungle.\n\n89\tEXT. ENTRANCE TO STALAG SEVENTEEN - NIGHT\n\nTHE RUNNING FENCE LEADS TO A GATE IN A BIGGER FENCE. This one is \nELECTRIFIED. We know this because we see A COLLECTION OF ZOMBIES, \nmostly \"civilians\" with no vests, clambering there, HANDS AND FACES \nSPARKING WHEN THEY TOUCH THE CHAIN LINKS.\n\nTHE ZOMBIES send up wild MOANS AND GURGLES when TOBY AND THE OTHER \nPRISONERS are led through the gate.\n\nInside the compound is A SCATTERING OF OPEN-SIDED MILITARY TENT-\nBUILDINGS, resembling those on M*A*S*H. There's A DIN coming off the \nplace, a mixture of MUSIC AND VOICES that forms a disturbed blanket \nof noise. The place seems to seethe like a hornets' next.\n\nTHE SOLDIERS head back for The Cave as POSTED GUARDS shut the gate \nbehind THE PRISONERS. TOBY and the other captives move toward the \n\"village\".\n\n90\tEXT. STALAG SEVENTEEN MAIN STREET - NIGHT\n\nPEOPLE wallow in the mud. ONE MAN has just taken a shit and is wiping \nhis ass. Nearby A DRUNK lies unconscious. SEVERAL MEN are fighting. \nIt's a brutal fight with BOTTLES AND PIPES AND LENGTHS OF CHAIN. The \nmen are really hurting each other. PEOPLE SMOKE AND SNORT AND SHOOT \nUP in wide open disarray.\n\nA HUGE PREGNANT WOMAN plants herself right in TOBY'S path.\n\nPREGNANT WOMAN\nHow 'bout it, baby. I'm big but I'm \nbeautiful.\n\nTOBY pushes past her and bumps into A SURLY DRUNK.\n\nDRUNK\nHEY, YOU FUCK! YOU FUCK!\n\nHe grabs TOBY and flings him violently against an upright on one of \nthe long huts. THE OTHER TWO PRISONERS move on, abandoning TOBY, \ndisappearing into the crowd. THE DRUNK pulls A RUSTED, HOME-MADE \nKNIFE.\n\nDRUNK\nI OUGHTA SLICE YOU UP, YOU FUCK! YOU CAN'T \nPUSH ME AROUND LIKE... PUSH ME \nAROUND...LIKE...\n\nSuddenly VOMIT rises in the man's throat and he doubles over. TOBY is \naware of SOUNDS behind him. At his back, in the hut, A HAIRY FAT MAN, \nstill wearing his boxer shorts and his muddy boots, is wham-bam-\nbamming A WHORE, who is wearing everything but underwear and boots. \nThere are needle tracks on the woman's arms and her face looks as \nthough she's been beaten brutally. She purses her deep red, damaged \nlips and blows TOBY a kiss that's meant to be seductive.\n\nTOBY moves on down the street. The place is a cesspool full of human \ndregs, stinking with refuse, filled with the fury and desperation of \nman in his last days.\n\n91\tEXT. ENTRANCE TO STALAG SEVENTEEN - NIGHT\n\nJOHN leads his followers to within sight of the Stalag gates. ZOMBIES \nstill claw at the ELECTRIFIED FENCE. BLUE-WHITE SPARKS fill the air \nlike flashbulbs.\n\nJOHN\nThis is home, darlin'. Home for us that \ndon't make the grade. Us that ain't...good \nenough to live inside The Cave. We grow a \nlittle food, do a little light \nmanufacturin'...like these here vests, we \nmake these for the massers. We live in our \nown filth, with bugs and snakes and disease \nand jungle fever...all the time waitin' to \nbecome breakfast for the Bees.\n\nJOHN is doing a sales job on SARAH but everything he says is truth. \nShe hears it all, softening to JOHN'S cause.\n\nSPIDER has silently lifted A LARGE WOODEN ROUND out of the weeds. \nIt's a camouflaged tunnel entrance.\n\nJOHN\nIt's a tunnel. It's a couple hundred yards. \nJust keep goin' 'til you reach the end. \nI'll be right behind you.\n\nSARAH starts down into the hole. JOHN and the others prepare to \nfollow. JUNGLE SOUNDS cover the noises they make.\n\n92\tINT. THE HOSPITAL IN STALAG SEVENTEEN - NIGHT\n\nWe see ROWS OF HOME-MADE COTS, each with A BODY lying on top. What \nfaces we see are gaunt, showing the boils and lesions of consumptive \ndiseases and tropical fever. INSECTS BUZZ and there is THUNDER in the \nair.\n\nAn Oriental orderly, LUKEY, moves through the maze of bodies. He \nlifts the wrist of A WOMAN WHO LOOKS DEAD and he discovers that she \nis dead indeed. He hurries off.\n\n93\tINT. HOSPITAL OPERATING ROOM - NIGHT\n\nThis is a room with walls, an operating room with JURY-RIGGED \nAPPOINTMENTS. On A TABLE, under A HALF-DOZEN LIGHT BULBS, lies A \nCORPSE. Another orderly, a Nordic type names DIESEL, an enormous man, \nassists while DOCTOR LOGAN methodically SAWS OFF THE CORPSE'S HEAD.\n\nLUKEY rushes in out of breath.\n\nLUKEY\nDoc Logan! Doc Logan! Dere's a lady dead \nout dere! Gotta hurry! Gotta hurry! Dunno \nhow long she been dat way! Maybe she \ngettin' ready to come back.\n\nTHE CORPSE'S HEAD ROLLS AWAY FROM ITS BODY. DOC LOGAN picks up AN \nELECTRIC DRILL WITH A LONG BIT. WHZZZZZZZZZ! HE DRIVES THE SPINNING \nBIT INTO THE DISEMBODIED HEAD, DEEP INTO ITS BRAIN. When he pulls it \nout, MATTER FLIES as the motor winds down.\n\nLOGAN is a middle aged man. He looks exhausted, demoralised, a bit \nmad. And he looks as ill as some of his patients. There are OPEN \nSORES on his face and he hasn't shaved for days. He's covered with \ntwo week worth of BLOOD STAINS. He starts around the table leaving \nDIESEL to dispose of the \"DE-CAP\".\n\nLOGAN\nBury the head. Call the guard for the rest. \nGet it off the table for now. We'll bring \nthis new one in.\n\nDIESEL doesn't respond right away. He's heard something.\n\nLOGAN\nWhat is it?\n\nDIESEL\nThe tunnel.\n\nLOGAN hears it now, A SCRATCHING, SCUFFLING SOUND. He looks at his \nwatch.\n\nLOGAN\nGod. It's almost sun-up.\n\nLOGAN AND LUKEY move to a spot at the back of the room. They remove \nSEVERAL OF THE PLANKS in the floor. SARAH'S head pops out, gasping \nfor air. Logan recoils, his eyes wide and frightened.\n\nLOGAN\nWho are you? Who are you?\n\nHe stands up too quickly. Dizziness makes him reel. He smashes into \nAN INSTRUMENT CART, comes up with A LONG-BLADED SCALPEL and holds the \nthing threateningly aimed at the stranger.\n\nJOHN\nIt's OK. It's OK, Doc. She's with us.\n\nIn the next moment, SARAH and the others climb out of the tunnel.\n\nJOHN\nThis here's the hospital. That's Diesel \nover there, the big guy. This here's Lukey \nand that's Doc Logan who's about to cut \nyour tonsils out.\n\nSPIDER, the last one to climb into the room, quickly begins \ncollecting WEAPONS, what few the rebels have.\n\nJOHN\nThis here's all the weapons we got. That's \nwhy your fancy automatic looks so good to \nus. We gotta stick it over here with the \nothers for now. They catch us with any kind \no' weapon and its death without even askin' \nyour name.\n\nSARAH lets SPIDER take her GUN. The deaf mute signs something which \nSARAH can't decipher.\n\nJOHN\nAmmunition. You got ammunition in your pack \nthere? I hope you do or the gun ain't worth \nmuch.\n\nSARAH roots through her SUPPLY PACK and produces THREE LOADED CLIPS \nAND SEVERAL BOXES OF LOOSE SHELLS. JOHN notices SOME TINS OF FOOD, \nMEDICINES, A KNIFE, A COMPASS...\n\nJOHN\nWe better just hide the whole pack, \ndarlin'. That stuff is just shoutin' out \nthat it come from the mainland. The shit we \nget is all C.D. rations. Aspirins and \ncrackers from 1958.\n\nSPIDER snatches THE PACK away rather roughly. SARAH is a little \ndisturbed by the action. THE MATERIAL is stashed under FLOOR BOARDS \nbeside the tunnel entrance.\n\nJOHN\nLet's go. You look like you could use some \nshut eye. Me too. We can all get acquainted \ntomorrow.\n\nLUKEY escorts JOHN AND SARAH out of the operating room into the main \nhospital area. BILL McDERMOTT pulls out his empty flask.\n\nMcDERMOTT\nDoc, I need a fill up. I'll help m'self if \nit's alright with you.\n\nLOGAN nods distractedly and BILL moves to A SUPPLY CABINET which \ncontains, among other essentials, SEVERAL BOTTLES OF BRANDY. He fills \nhis flask eagerly.\n\nLOGAN\nHow do we know she's alright? How do we \nknow?\n\nMcDERMOTT\nShe's alright. Christ, Rhodes and his \ncossacks wiped out her whole party. Dan \nnear got her.\n\nMcDERMOTT pockets the refilled flask, takes a long slug from the \ncabinet bottle before putting it back, and moves out of the room. \nLOGAN is left alone with DIESEL AND SPIDER.\n\nLOGAN\nHow do we know she's alright? How do we \nknow?\n\nLOGAN repeats his question, intoned identically as it was before. \nHe's twitching slightly and sweat is pouring down his face. THE \nTHUNDER suddenly seems LOUDER.\n\nDIESEL\nAre you alright, Doc? You look... you look \nreal bad.\n\nLOGAN\nI have looked bad for four years. Everyone \nin the world has looked bad for four years. \nThank God looks don't matter as much as \nthey once did.\n\nLOGAN, a wild gleam in his eye, moves out of the room, following \nwhere the others went, that LONG-BLADED SCALPEL still clutched in his \nhand. The others follow.\n\n94\tINT. THE HOSPITAL - NIGHT\n\nJOHN, SARAH AND LUKEY are facing out across the compound. A TEEMING \nTROPICAL RAIN has started to fall.\n\nJOHN\nThis just ain't your day, is it, darlin' \nSarah.\n\nSARAH can't help but snicker. Suddenly her head spins exhaustion is \nconquering her body as last. JOHN puts a big arm around her.\n\nJOHN\nThree more minutes. Then you can sleep. You \ngotta stay with it for three more minutes.\n\nMcDERMOTT joins them and the group moves out into the rain. LUKEY \nwaddles back through the maze of cots.\n\nLOGAN, SPIDER AND DIESEL have moved to about the center of the big \nroom. The patients around them, their eyes bulging, look like lemurs.\n\nLOGAN\nHow do we know she's alright? How do we \nknow?\n\nThe same intonation again. This guy's wrapping is definitely coming \nloose.\n\nTHE ZOMBIE rises up behind LOGAN'S back. It's the woman whose wrist \nLukey checked earlier. Its teeth are dripping with drool, its hands \nreaching out wantingly.\n\nLOGAN turns around. Calmly, but with the swiftness of a rattlesnake, \nhe shoots out the hand that's holding THE SCALPEL. THE BLADE SINKS \nDEEPLY INTO THE ZOMBIE'S FOREHEAD. LOGAN pulls it out and strikes \nagain, and again, and again, like a swordsman thrusting, thrusting, \nthrusting. Finally the creature collapses. LOGAN wipes the scalpel on \nhis already blood-covered apron. RAIN WATER drops onto him from holes \nin the roof above. He doesn't seem to notice.\n\n95\tEXT. STALAG SEVENTEEN MAIN STREET (RAIN) - NIGHT\n\nTHE STREET SCENE is toned down due to the late hour and the rain, but \njust as vile, just as vicious. JOHN AND McDERMOTT escort SARAH. JOHN \nspeaks softly, and only when others on the street are far enough \naway.\n\nJOHN\nThey supply us with disinfectant and dope. \nSex, drugs and rock-and-roll. What more \ncould anyone ask for? Most around here \nain't interested in changin' their lives. \nThe folks you met...me and them and a \ncouple others is the whole rebel army. \nNobody else gives a shit...and they're \nafraid o' Rhodes.\n\nThey pass A STRUCTURE WITH AN OVERHEAD SIGN that reads: JOE'S CORNER \nTAVERN. If there were walls they'd be pushed out by the MASS OF \nHUMANITY inside. MUSIC BLARES and VOICES form a wall of noise louder \nthan the THUNDER. A FIGHT spills out onto the muddy street, PUSHERS \nselling all sort of delights accost JOHN and his group.\n\t\nSARAH\nThey seem to be havin' a good time. Some \npunishment.\n\nJOHN\nYou disappear in here, darlin'. You get a \nknife in yer belly or too much shit in yer \nveins. You get lost out here and nobody's \ngonna notice. Rhodes, he counts on that. It \nall makes for food in the freezers.\n\nThey come to A LONG HUT WITH A SIGN that reads: THE RITZ.\n\nJOHN\nThis is your hotel. I'm not gonna stay here \nwith you but I'll always be close. You \ngonna hafta take care o' yourself like you \nsaid you was able to do.\n\nSARAH nods. JOHN smiles at her. His warm, trustworthy eyes seem to \nglow in the dark.\n\nJOHN\nSome may notice that you're new. Just deny \nit. You'll get away with it. Nobody really \nlooks at each other around here. Go on in. \nGet some sleep.\n\nHe squeezes her hand tightly, then he turns away and moves off with \nMcDERMOTT. SARAH moves into THE RITZ.\n\n96\tINT. THE RITZ (RAIN) - NIGHT\n\nIt resembles the hospital. There are ROWS AND ROWS OF COTS. SOME \nPEOPLE SLEEP, alone and in pairs. OTHERS are awake, drinking, \nscrewing, shooting up. SARAH finds an empty cot and flops down. \nBeyond the open walls she can see THE BLUE-WHITE FLASHES coming from \nthe electrified fence. RAIN LEAKS in on her but it doesn't keep her \nfrom falling asleep.\n\n97\tINT. THE CONDITIONING ROOM IN THE CAVE - MORNING\n\nTECHNICIANS are working with ZOMBIES while ARMED GUARDS stand ready. \nWe FOCUS ON A BLUE COAT. Under supervision, the thing is fumbling to \ntie a shoelace. It's failing miserably but trying hard. ANOTHER BLUE \nis busy placing LITTLE WOODEN SHAPES into their proper HOLES IN A \nBOARD.\n\nTWO RED COATS sit at a table attended by HUMAN TECHNICIANS. We've \nseen these zombies before, in the dormitory. TONTO, is...or was...a \nnative American, probably Seminole. In front of him is A PLATE \ncontaining SEVERAL BITS OF MEAT. He has A FORK in his hand and he is \nidly stabbing at the meat.\n\nThe other RED COAT, BLUTO, looks just like Bluto from Popeye, bulky \nwith a thick, black beard. Tired of THE JIG SAW PUZZLE he's working \non, he snarls and suddenly lunges for the meat on TONTO'S plate. He \nsnatches a handful and stuffs it in his mouth. As soon as he tastes \nit, however, he pulls it back out, dribbling and spitting \ndisgustedly.\n\nFISHER (a technician)\nThey won't accept a substitute. They want \ntheir Alpo.\n\nTONTO has succeeded in forking a piece of meat. He moves it to his \nmouth and pops it in.\n\nFISHER\nAlright! Way ta go, Kemosabe!\n\nMARY HENRIED has entered the room. She pulls up and watches  TONTO \nwith a kind of dubious interest. TONTO stops chewing. He looks up \nwith exaggerated sadness on his face. Slowly his mouth opens and the \nchewed piece of meat slides out between his lips. He throws his fork \ndown angrily.\n\nMARY\nThey won't learn to use forks if they don't \nlike the breakfast you're serving, Ted.\n\nFISHER\nThe fork is like a game to them. If they \nget into the game maybe they'll learn to \nlike the food.\n\nMARY\nIt won't work.\n\nSuddenly BLUTO jumps up from the table. He flings his chair aside and \ntromps right over to MARY. His arms are outstretched and he is making \na pleading, Karloff-like SOUND. GUARDS come after him but MARY waves \nthem off.\n\nMARY\nIt's alright! Leave him alone!\n\nMARY extends her right hand to meet BLUTO'S right and they shake \nvigorously. Then the dumb creature drops his arms and looks around. \nHis brain sends no signal as to what he should do next. THE GUARDS \nlead him away.\n\n98\tINT. THE FIRING RANGE IN THE CAVE - MORNING\n\nBLAM!!! A RED COAT is FIRING A PISTOL right AT THE LENS.\n\nCLOSE ON: A TARGET, a flat, cut out silhouette of a man, BLACK \nTRIANGLES painted on the instant-kill-zones, brain, heart. BULLETS \nSTRIKE the neck, the to torso, SOME RICOCHET off the wall behind. \nNone hit the kill-zones.\n\nMARY HENRIED enters. The place resembles a Police Department target \nrange. RED COATS stand in stalls and FIRE down LONG ALLEYS at TARGETS \nwhich pop up against the opposite wall. THE NOISE is deafening. TWO \nTECHNICIANS are watching the shooters and keeping score. MARY walks \nup to one of them.\n\nMARY\nHave you seen Julie Grant this morning?\n\nTECHNICIAN\nShe should be in the behaviour rooms.\n\nMARY\nShe's not. Hasn't shown up yet.\n\nThere's AN OFF-SCREEN GROAN, the sound of a zombie trying to \ncommunicate. MARY turns and sees the tall RED COAT names BUB standing \nin the closest stall trying to attract MARY'S attention. (He was the \none Rhodes referred to last night as \"Mary's pride and joy\".) He is \nwearing WESTERN-STYLE GUN BELTS, SIX-SHOOTER hang in HOLSTERS on both \nhis hips. MARY faces BUB full with her body and delivers a military \nsalute.\n\nMARY\nGood morning, Bub.\n\nBUB replies with one of those pathetic sounds that obviously mean \nsomething to him. Then he, too, salutes. MARY pulls away, heading for \nAN EXIT, but BUB calls after her. He makes inarticulate sounds but we \ncatch his drift.\n\nTECHNICIAN\nI think he wants you to watch.\n\nMARY\nOK, Bub. Do your stuff.\n\nBUB turns towards the target wall looking like a gunfighter on a \nwestern street. There's A HUMMING MECHANICAL SOUND. KATCHUNG! A \nSILHOUETTE pops up. BUB slaps leather...fast... lighting fast. BOTH \nGUN come up. BLAM-KA-BLAM-KA-BLAM-BLAM-BLAM-BLAM!!!\n\nHOLES APPEARS IN THE TARGET...WOP-WOPPETY-WHUMP!!! All in the kill-\nzones, or damn close.\n\nBUB slaps ONE PISTOL back into its HOLSTER. He clicks open the shell-\nchamber on THE OTHER, dumps the SPENT CARTRIDGES and begins to reload \nfrom his belt.\n\nMARY stares at the creature's back, mixed emotions showing on her \nface. BUB turns to face her. Dropping a bullet, he salutes again. \nMARY hesitates, then salutes back.\n\nMARY\nVery good, Bub. That's....very good.\n\n99\tINT. A LOCKER ROOM IN THE CAVE - MORNING\n\nPEOPLE are changing clothes, going on and off duty. JULIE GRANT \nrushes in and moves to a locker where she pulls out her LAB COAT. \nMARY HENRIED enters the room, spots JULIE, and rushes towards her.\n\nMARY\nWhere the hell have you been?\n\nJULIE doesn't respond. She buttons her coat never looking up.\n\nMARY\nJulie. Are you alright?\n(still no response)\nYou were missed this morning. I need you. I \ndon't want you getting your ass in hot \nwater. I won't be able to help you if...\n\nJULIE\nI don't need any help from you!\n\nJULIE slams the locker door and storms away toward the exit.\n\nMARY\nJulie...JULIE!\n\nBut she's gone. The locker door has bounced open. MARY slams it and \nit bounces again. She pounds it with her fist. Suddenly, A LOUD BELL \nSOUNDS. MARY looks at her watch then exits.\n\nThere are TWO WOMEN cleaning the locker room with MOPS AND PAILS. One \nof them turns to watch MARY HENRIED exit. We recognise her. It's \nSPIDER.\n\n100\tINT. THE COUNCIL CHAMBER IN THE CAVE - MORNING\n\nThis is a large Situations Room that is serving now as GOVERNMENT \nHEADQUARTERS. In A BIG, STUFFED OFFICE CHAIR behind A DESK FLANKED \nWITH FLAGS sits GOVERNOR HENRY DICKERSON (former of Florida, now of \nthe world) A.K.A.... GASPARILLA.\n\nAt TABLES sit A DOZEN OR SO COUNCILMEN, Dickerson's cronies from the \nold Doral Country Club, close friends who were offered asylum in the \nprivate underground shelter. Now they sit in council, \"yessing\" \neverything the boss man says.\n\nA STATE PROSECUTOR has a DESPERATE-LOOKING PRISONER on the floor, \nstanding with his hands cuffed.\n\nPROSECUTOR\nHe was found with a government-issue short-\nwave transmitter in his quarters. He's \ncharged with the theft of that equipment \nfrom a government installation and with \npossession of an illegal radio.\n\nGASPARILLA munches on SOME FRUIT. He's a fat man with a handlebar \nmoustache that makes him look like Pancho Villa. As an indication of \nrank we wears a military jacket but underneath is a Hawaiian shirt \nwith a bold flamingo and palm tree pattern. Around his neck, nestled \nin the rolls of fat there, is enough gold to stake a small business.\n\nPROSECUTOR\nI can only suggest that the court rule in \nfavour of the ultimate penalty for this \ntraitor.\n\nGASPARILLA\nYou always recommend the ultimate penalty, \nTommy Lee. You and Rhodes.\n\nWe now see that RHODES is present, looking on with a smile.\n\nGASPARILLA\nAll those...AGAINST...the ultimate penalty \nraise yer hands.\n\nNone of THE COUNCILMEN move a muscle. GASPARILLA scans them slowly as \nhe takes a big, wet bite out of a peach.\n\nGASPARILLA\nYa mean ta say nobody's gonna object to the \nultimate penalty in this here case? Well, \nwhat if I object? What if I object to the \nultimate penalty.\n\nTHE COUNCILMEN look nervous, apprehensive. GASPARILLA'S flexing his \npower-muscles.\n\nGASPARILLA\nThere's been a whole lotta swingin' \ninfluence and swingin' weight arountyere \nlately. Does anybody at all give two shits \nfer what I think any more? Well, I'm a-\ngonna let this guy off. How d'yall like \nthat? And I want the word ta git out I let \n'im off. I let 'im off. Not this council. \nMaybe I can improve my image rountyere.\n\nTHE PRISONER looks up at GASPARILLA, hatred boiling inside him. \nGASPARILLA meets his gaze with a power-mad sneer.\n\nGASPARILLA\nYer sentenced ta hard labour. Stalag \nSeventeen. A year.\n\nPRISONER\nWHY DON'T YOU KILL ME! I PREFER TO DIE! I \nDON'T WANT TO LIVE WITH... WITH THIS KIND \nOF...SIN!\n\nGASPARILLA\nWELL, PISS ON YOU, MISTER! I JUST SAVED \nYOUR ASS! YOU DAMN WELL BETTER NOT GO \nHOLLERIN' LIKE THAT IN HERE!\n\nPRISONER\nI SPIT ON YOU! THE ULTIMATE PENALTY FOR \nYOU! BURN IN HELL...FOR THE ULTIMATE SIN! \nPIG! ALL OF YOU! PIGS!\n\nGUARDS drag the screaming PRISONER from the room. GASPARILLA flops \nback in his chair, flustered but unscarred. His skin is about a foot \nthick. He pitches the peach and grabs up a mango. MARY HENRIED enters \nthe chamber and rushes toward an empty chair. GASPARILLA checks THE \nDOCKET on his desk, smiles, and looks up at MARY.\n\nGASPARILLA\nWell, Miss Henried, what a coincidence. \nYou're just in time fer a case that seems \nta concern you. Guess you didn't care about \nthe other proceedin's we been dealin' with \nhere this mornin'.\n\nMARY\nI'm sorry. I was...busy. In the lab.\n\nGASPARILLA\nWell, you managed ta make it here jus' in \ntime fer this case, didn't ya?\n\nRHODES replaces THE PROSECUTOR on the floor. He smiles at MARY \npointedly as he starts his speech.\n\nRHODES\nSir. In the matter of the State versus \nPrivate Tyler, I don't want to...\n\nMARY\n(standing) Sir, Tyler is innocent of any \ncrime against the State. Captain Rhodes \nis...\n\nGASPARILLA\n(with a mouthful of mango) Miss Henried, I \nthink you better...\n\nMARY\n...Captain Rhodes is trying to...\n\nGASPARILLA\n(spitting a wad of chewed pulp into his \nhand) MISS HENRIED, SHUT THE HELL UP!!!\n\nMARY'S eyes indicate her frustration and anger but she does shut up. \nGASPARILLA plops the handful of fruit pulp onto the floor wiping his \nfingers on his military jacket.\n\nRHODES\nI don't want to take up a lot of time with \nthis. Mr Tyler shot a prisoner against \norders. There are eyewitnesses. I've \nreprimanded Tyler and I've had him sent \noutside. It's as simple as that.\n\nGASPARILLA\nYa had 'im sent ta the Stalag? That's all \nya did to 'im?\n\nRHODES\nThe prisoner was dying, sir. Tyler acted \nout of a sense of mercy. I don't believe \nTyler to be dangerous, General. He just \nneeds...discipline. Two or three months \noutside will teach him...discipline.\n\nMARY\nSir. It's quite clear that...\n\nGASPARILLA\nSHUT UP, MISS HENRIED! I TOL' YA B'FORE!\n\nMARY\nTHIS IS A TRAVESTY! CAPTAIN RHODES IS...\n\nGASPARILLA\nSIDDOWN, YOUNG LADY! I DONE YUP A SHIT-LOAD \nO' FAVOURS AND I AIN'T NEVER YET ASKED FER \nNOTHIN' IN RETURN! NOW HOW'D YOU LIKE TA \nSPEND TWO WEEKS UP T'THE VEGETABLE FARM \nYERSELF? THAT'S WHAT IT'LL BE IF YA DON'T \nSIDDOWN AN' SHUT THE HELL UP!\n\nMARY checks herself. There's a perverse air of danger fuming off the \nfat General. His attitude toward MARY has clearly changed. RHODES has \nbeen working on him. MARY seems to have lost this round. She can only \nhope that's all she's going to lose.\n\nGASPARILLA\nNow I think Captain's punishment is fair, \nconsiderin'. In fact I think you ain't got \nshit ta complain about.\n\nMARY\n(softly, carefully) I'm sorry, General, if \nI...spoke out of turn. It's just that...Mr \nTyler is not here to defend himself. He has \nno representation. I don't believe due \nprocess is being served by...\n\nGASPARILLA\nListen, Missy. I am the only due process \nthat has ta be served aroun' tyere and one \nof the people doin' the servin' from now on \nis gonna be you. Now you been prancin' \naroun' the Cave like yer ass was glass fer \nlong enough! All that's\n\nGASPARILLA\ngonna change, young lady. Now if you still \ngot a statement you'd like ta make, you can \njus' hold onto it 'til tonight.\n\nMARY\nTonight?\n\nGASPARILLA\nThat's right. 'Bout eight, if that suits. \nWe'll start out in my gymnasium an' \nprogress on from there...to various other \nforms o' physical therapy.\n\nMARY shoots a hate-filled eye full at RHODES. THE CAPTAIN responds \nwith a phoney look of sympathy.\n\n101\tINT. GASPARILLA'S GYMNASIUM - NIGHT\n\nThe place is full of EXERCISE EQUIPMENT, TREADMILLS, WEIGHTS, A \nNAUTILUS, ETC. There are other items which seem contradictory, PLUSH \nPILLOWS, A HUGE CIRCULAR BED SURROUNDED BY MIRRORS. Delicacies of \nFOOD AND DRINK lie about on LOW TABLES. The room is a cross between \nElaine Powers and a harem chamber.\n\nA HUGE COFFIN-SHAPED DEVICE opens and we see that the inside is lined \nwith ULTRAVIOLET TUBES which are covered with plexiglass. GASPARILLA \nlounges inside the thing, sweating, having just taken a long dose of \nfake sunshine.\n\nAll around are THE COUNCILMEN, some with COUNTRY-CLUB TYPE WOMEN, \nconservatively dressed and wearing suitable jewellery (obviously \nwives left over from the good old days), and some with SCANTILY CLAD \nCOURTESANS.\n\nOTHER SCANTILY CLAD \"BUNNY\" TYPES are serving HORS-D'OEUVRES and \npouring WINE, offering SMOKE AND SNORT.\n\nMARY HENRIED is sitting on the floor, lost in fluffy pillows, her LAB \nCOAT incongruous. RHODES watches her from nearby.\n\nGASPARILLA\nAWRITE. C'MON LADIES. OFF WITH IT... AND ON \nWITH IT...HA HA HA...\n\nMUSIC BLARES and SEVERAL OF THE COURTESANS spring up, stripping off \nwhat few clothes they are wearing. Some strip naked, others down to \npanties. They hop onto various exercise machines and begin to \n\"workout\", tits flopping, thighs pumping...GASPARILLA'S kind of \nentertainment.\n\nGASPARILLA\nOh, Lordy, Lordy...I'm drunk as a skunk. \nLook at this...will ya jus' loooooook at \nthese lovelies! Say, Henried, you ever try \nit with another woman?\n\nMARY looks up at the General, not knowing whether or not she should \nanswer, afraid of what he might try to make her do.\n\nGASPARILLA\nI've tried it with boys. Too strenuous.\n\nFOUR MORE WOMEN have brought in SILVER PLATTERS full of NEW HORS-\nD'OEUVRES, prepared carefully and laid them out like sushi. They're \ndistributed and people eat them\n\nGASPARILLA\nFolks...I just couldn't resist. How d'yall \nlike those? How do those taste?\n\nGUESTS look up, not knowing what to expect. MARY fears the worst. She \nlooks around to see RHODES grinning. A knot comes up into her throat. \nShe tries to swallow it down.\n\nGASPARILLA\nFresh from the freezers, folks. It's \nwhat...THEY...EAT!\n\nA FEW OF THE GUESTS are revulsed. ONE MAN starts to vomit and he runs \nfrom the room.\n\nGASPARILLA\nJust kiddin' folks. Just kiddin'. Would I \ndo a thing like that? I ask ya now, would \nI? Hah ha ha ha ha...\n\nRelief spreads and the bacchanalian atmosphere restores itself. \nGASPARILLA spills himself out of the tanning coffin and flops down on \nsome pillows near MARY. He grabs up a goblet and swills red wine \nwhich runs down his front.\n\nGASPARILLA\nThe great state of Florida. People came \nhere fer years ta die. Retire and expire. \nThe rest o' the country used ta think we \nwas nothin' but a bunch o' farts and \nfogies. Hah! Now this here's the new \nCapital o' the World! Hah! They came \nhere...died...went to hell...and the Devil \nsent 'em back as an army. Hah! General \nGasparilla's army...MY ARMY!\n\nMARY\nWe think there are other cities surviving. \nWe think maybe Detroit... there's some \nsignalling out of Philly.\n\nGASPARILLA\nThere's no place like this place. Warm \nclimate. This facility. Christ, there ain't \nnothin' like this no-damn-where! Even the \nFeds knew that. That's why they stored so \nmuch o' their shit down here. It's all mine \nnow. All mine. Just let 'em try ta come \nafter us down here, which they will some \nday...take a likin' ta what all we got an' \ncome after us. They'll hafta get past my \narmy! An army that ain't afraid ta die...ha \nha ha...'cause it's awreddy DAID! HA HA HA \nHA....\n\nMARY\nIt's not a very big army. And small as it \nis you won't be able to continue feeding it \nfor very long. We've got to find ways of \ngetting them to respond without relying \non...\n\nGASPARILLA\nYou'll find the ways, Miss Mary. And when \nya do...we'll sail on over to the \nmainland...or any other damn mainland fer \nthat matter...and start us a recruitin' \nprogram. There's millions o' Bees out there \njus' waitin' fer' a General ta lead 'em on \nta vict'ry!\n\nGASPARILLA swallows another huge quantity of wine.\n\nDISSOLVE TO:\n\n102\tINT. THE GYMNASIUM - NIGHT\n\nThe room is empty now. Remnants of food and drink clutter the place. \nTHE FAT GENERAL is asleep, snoring loudly, one of his pudgy arms is \ndraped across MARY HENRIED'S lap. She is trying to move out from \nunder without waking the man. She slides on the floor...a few \ninches...a few inches more. GASPARILLA snorts and rolls over. His \neyes pop open, focus on MARY, and a smile pushes his fat cheeks back.\n\nGASPARILLA\nWell, hi there, y'all.\n\nMary looks down at the man, repulsed and afraid. Suddenly he grabs \nher LAB COAT. She pulls away and he crawls after her, his belly \nbouncing along the floor. BUTTONS POP and the coat falls open. He \nreaches for her blouse. It tears away and for a moment he gets a \nchubby handful of bare breast. He dives into her but he's unconscious \nbefore his face reaches her chest.\n\nMARY pulls herself out from under his dead weight. Shivering, she \nclutches her blouse together and hurries out of the room.\n\n103\tEXT. ENTRANCE TO STALAG SEVENTEEN - DAWN\n\nLight is just breaking through the trees when THE GATES ARE OPENED \nadmitting FIVE UNIFORMED MEN into the compound. Outside the fence \nZOMBIES clamber excitedly as always.\n\n104\tINT. THE RITZ - DAWN\n\nSARAH jumps, awakened by A VOICE AND THE LOUD POUNDING OF RIFLES \nagainst the upright of the sleeping hut.\n\nRHODES\nREVEILLE! REVEILLE! RISE AND SHINE!\n\nRHODES is standing near the entrance. FOUR SOLDIERS are doing the \npounding. Stunned, disease-ridden faces look up as CITIZENS are \nawakened from sleep. Fear sweeps through the place like a tropical \nwind.\n\nRHODES\nWe found two white Bees in the jungle with \ntheir heads chopped open. I want to know \nwho's going outside the compound. I want to \nknow how they're going out. I want to know \nwhy they're going out. Until I get these \nanswers...each morning...some of you will \ndie.\n\nWithout warning RHODES draws his MAGNUM and...BLAM! BLAM! He shoots \nTWO COT PEOPLE who happen to be at close range. They tumble to the \ndirt floor, dead before they hit.\n\nRHODES scans the rest of the hut. He spots a familiar face, THE \nPRISONER from the Council Room, the one Gasparilla saved from a death \nsentence. The man makes the sign of the cross, knowing what's coming. \nBLAM! BLAM! RHODES FIRES TWO RAPID ROUNDS and THE PRISONER'S CHEST \nTURNS RED. He flies off his cot into one adjacent, landing on top of \na SCREAMING WOMAN.\n\nRHODES AND HIS MEN leave as abruptly as they entered. SARAH is \nstunned. As PEOPLE around her react with sobs and more screams, she \nlocks her eyes on RHODES.\n\nHe is moving authoritatively down the street just outside the open-\nwalled structure. He passes within inches of SARAH'S cot which is \nright against the outside rail. Her emotions well up inside her. She \nis about to jump out into the street when A BIG BLACK HAND grabs her \narm. It's JOHN, who has pushed through the gathering crowd outside.\n\nSARAH\nLet me go! I'm the one he wants. This is \nall happening because of me. If I turn \nmyself in...\n\nJOHN\nHe's just finding another reason for \nbumpin' us off. Don't ya see. He needs us \nta die. He needs our bodies. \n\nBehind JOHN on the street TOBY TYLER is looking on. He has heard the \nconversation. JOHN turns and sees him. His eyes go dark with \napprehension.\n\nTOBY\nIt's alright. I'm a friend. I need help and \nso do you. What's a safe place to talk?\n\nJOHN\nAin't no place safe.\n\nTOBY\nLook...I know you have no reason to trust \nme. I've got friends in the Cave. I got \nsome stuff comin' out this mornin'. I'm \ngonna try to get off the island.\n\nPEOPLE are pushing in closer attracted by the commotion inside the \nRitz. TOBY has to make it fast. He whispers.\n\nTOBY\nI'm gonna have this stuff sent over to the \nhospital...\n\nJOHN\nThe hospital? (surprised, worried)\n\nTOBY\nYeah. My stuff's all marked with red \ncrosses so nobody gets too nosey. Meet me \nat the hospital after the supplies come in. \nMaybe we can find a place there to talk.\n\nJOHN\nMaybe.\n\nTOBY drifts off into the crowd. JOHN AND SARAH exchange glances.\n\n105\tEXT. ENTRANCE TO STALAG SEVENTEEN - MORNING\n\nSUPPLIES are being brought in through THE MAIN GATES, CRATES, \nCARTONS, BAGS OF GRAIN, SEED, FERTILISER.\n\nTRICKS is in charge of the patrol from the Cave. He's checking items \nas they're picked up by WORKERS from the compound. TOBY TYLER sidles \nup to his friend.\n\nTOBY\nHey, Tricks. Some detail they got you on.\n\nTRICKS\nNot as bad as yours, pal.\n\nTOBY\n(whispering) What'dya get?\n\nTRICKS\nRafts. Two 38s. A little ammo.\n\nTOBY\nWe need fuel, and a couple automatics.\n\nLUKEY, the orderly, picks up A DOLLY which is LOADED DOWN WITH CRATES \nMARKED WITH RED CROSSES.\n\nTRICKS\nHey, you. Those two on the bottom. Don't \nopen those yet. They might be from the \nwrong shipment. Just keep 'em around 'til I \ncan check.\n\nLUKEY\nYessir. I never open 'em. Nossir. I keep \n'em innaback for you.\n\n106\tEXT. FRONT STREET OF STALAG SEVENTEEN - MORNING\n\nWatching from the shadows of A BUILDING are JOHN, SARAH AND DIESEL.\n\nDIESEL\nHe's a spy. A spy for Rhodes.\n\nJOHN\nGive him a chance.\n\nThey see TOBY pull away from TRICKS and start down the street \nfollowing LUKEY. They move out and catch up with TOBY, flanking him.\n\nJOHN\nWhat'dya tell that soldier, soldier? You \ntell him we was rebels?\n\nTOBY\nHe's my contact for Chrissake! There's two \ncrates. Can you get me into the hospital?\n\nSHORT CUT TO:\n\n107\tINT. STORAGE BAY IN THE HOSPITAL - MORNING\n\nCREAK! A CROWBAR pries open A CRATE. JOHN AND LUKEY guard the \nentrance while TOBY AND DIESEL work at opening the \"Red Cross\" boxes. \nSARAH stands nearby. THE LIDS LIFT and we see TWO ARMY-ISSUE LIFE \nRAFTS.\n\nTOBY\nThere ya go. Complete with air \ncanisters...little motors.\n\nJOHN\nWe got a boat.\n\nTOBY\nWhat?\n\nJOHN\nI say we got a boat. Can you get other \nstuff?\n\nTOBY\nI got some fuel comin' out and, I hope, \nsome automatic rifles.\n\nDIESEL\nHe's just tryin' to win us over. This \ndoesn't prove anything.\n\nJOHN\nI'm gonna trust him, Diesel. He already \nknows who we are and we ain't got a bunch \no' time to mess around with Rhodes shootin' \nup the joint every mornin'.\n\nTOBY, rooting through the open crates, finds THE PISTOLS TRICKS told \nhim about and A FEW BOXES OF AMMO. He tosses one of the guns to JOHN. \nThe big man walks over and puts the weapon back inside the crate.\n\nJOHN\nCan't walk around here with these. Let's \njust leave 'em here 'til we ready ta use \n'em.\n\n108\tINT. HOSPITAL OPERATING ROOM - DAY\n\nCLOSE ON: HANDS carefully...very carefully...pouring DROPS OF CLEAR \nLIQUID INTO A TEST TUBE. The liquid is sweating slowly out of A \nMILDEWED AND ROTTING STICK OF DYNAMITE which has been softened to \nnear-melting by jungle heat.\n\nA DOZEN TEST TUBES stand in a rack, already filled. SPIDER, another \nwoman, SALLY, and a man, JACK, each have their own DYNAMITE STICK. \nEach is transferring LIQUID SWEAT...which is, of course, nitro \nglycerine...into A GLASS TUBE. They work in tense silence on the \noperating table.\n\nDOC LOGAN works with them, doing the same delicate procedure. \nSuddenly his hands starts to tremble.\n\nLOGAN\nTake it away from me. Quickly. Take it! \nTake it!\n\nSPIDER reaches over and, as gently as possible, takes the VIAL and \nTHE DYNAMITE out of the doctor's hands. She sets the tube in the rack \nand returns the dynamite to AN OPEN CRATE, years old and crusted with \nmildew and mud, still half-filled with sticks yet to be drained. The \ndanger passed, they all breathe a sigh of relief. LOGAN wipes the \nriver of sweat from his face. His hands are shaking quite violently \nnow. He pops pills, dry, from his pocket.\n\nLOGAN\nSorry. I'm sorry. I'll, er...I'll be \nalright...in a moment.\n\nJOHN\nYou're sick, Doc. You been sick for a while \nnow. Too sick to be workin' with us on this \nraid.\n\nJOHN, SARAH AND DIESEL are standing in a corner of the room. TOBY \nTYLER is with them, sweating and obviously nervous.\n\nJOHN\nYou've helped us enough, providin' cover, \nhidin' us out. Let the rest of us handle \nthe physical stuff. It's too much for you.\n\nLOGAN\nIt's my fight as much as yours. The things \nthey made me do...the things they \nmade...me...do. I want so see Rhodes \ndestroyed. I want to see all of them, all \nof them destroyed. It's my duty...in the \neyes of God. In the eyes of God.\n\nLOGAN is really flipso now, over the edge into banana-land.\n\nTOBY\nIt won't work. That's pure nitro you're \ndealin' with there. That stuff can blow if \nyou look at is funny. What're you gonna do, \nwalk into the Cave carryin' those tubes on \nfeather pillows? You don't have a complete \nlayout of the place. Even if you manage to \navoid a fight you won't know where to go.\n\nJOHN\nWe're hopin' you can show us where ta go, \nToby.\n\nTOBY\nOh, no. I'm tryin' to get off this island \nalive. I'll help you all I can but I'm not \ngoin' in there on a suicide mission. What \ncan you hope to accomplish? Some radios \nmaybe? A supply room or two? You'll all be \nkilled and in a few weeks they'll be back \nto business as usual. That place was built \nto withstand nuclear attack! What are you \ngonna do with a half-dozen guns and a few \nsticks of nitro?\n\nJOHN\nWe're gonna blow up the powder magazine.\n\nTOBY\nWhat?\n\nJOHN\nWe know what's down there. We did the \nloading' and unloadin' when the stuff came \nashore in the early days. A direct hit \noughta do more than a few weeks worth o' \ndamage.\n\nTOBY\nA direct hit'll blow the top off this whole \nisland! How're you gonna fuse the stuff? \nHow're you gonna leave yourself time to get \nout?\n\nLOGAN\nIf we don't get out it's a small price to \npay.\n\nTOBY\nYou're fuckin' out of your minds! There's \ntwo hundred people down there. You gonna \nmurder two hundred people?\n\nLOGAN\nSinners! Animals! Filth! Doing the work of \nthe Devil!\n\nTOBY\nWhat about the people here in the camp? If \nthey don't get blown to kingdom come their \nfood'll be destroyed, their water, medical \nsupplies. They won't have any more power. \nThis island can't support them all, they'll \nbe doomed. Count me out, friends. I'm gonna \nget my ass outa here. Anybody wants to come \nalong is welcome.\n\nSilence falls over the room. Finally JOHN moves towards the door. \nTOBY follows but before exiting he turns back to face the group once \nmore.\n\nTOBY\nI wanna see Rhodes burn just a much as you \ndo...but all those people. We don't have \nthe right to be their judges... just like \nthey don't have the right to be our judges.\n\nJOHN opens the door and TOBY exits. SARAH follows. JOHN looks around \nat the faces in the group, then he leaves, shutting the door behind \nhim. There's a long silence, then LOGAN speaks.\n\nLOGAN\nWe know what we must do. It's written for \nus in the Bible. \"They shall be driven from \nthe land of the living down to the world of \nthe dead. That is the fate of those who \ncare nothing for God.\"\n\n109\tINT. STORAGE BAY IN THE HOSPITAL - DAY\n\nLUKEY stands guard. McDERMOTT has joined SARAH AND JOHN in a strategy \nhuddle. TOBY stands nearby, feeling strangely guilty.\n\nSARAH\nToby's right. They're not gonna sit around \nwith their fingers up their asses while we \nbust up their toys.\n\nJOHN\nDatura.\n\nSARAH\nWhat?\n\nJOHN\nDatura Metel. The Devil's Trumpet. Don't \nworry. I ain't goin' religioso again. It's \na flower that grows on these islands. Where \nI come from the voodoo priests used it \nwhenever they needed a Mickey Finn. It's \ntoxic. Ground up you can put it in a drink \nor inject it...or...in a sealed area it \nmight be introduced through the ventilation \nsystem.\n\nSARAH\nDatura! Miguel knew it! Datura, he was \nshouting! Datura Metel!\n\nJOHN\nWe always planned to use it. We got some \nground up already...but we could never find \nenough.\n\nSARAH\nThere's hundreds of 'em. Right where we \nlanded our boat.\n\nTOBY\nThis stuff really works? No shit?\n\nJOHN\nQuicker than gas. And it smells a lot \nprettier. It usually don't kill but it puts \nya under fer a good night's sleep.\n\nTOBY\nIf you could knock out the central \ncommunications room you could foul up their \nwhole intercom system. Then, if you move \nfast enough, stay ahead of 'em...without \nbein' able to signal each other, they might \nhave a hard time catchin' you.\n\nJOHN\nI say it's poetic. Pure calypso, brother. \nThe Devil's Trumpet blowin' the notes o' \ndoom for the Devil's troops. Ha ha ha ha \nha...\n\n110\tEXT. THE BACKWATER - NIGHT\n\nTHE FISHING BOAT that bought SARAH and her friends to the island sits \nstill in the channel. There are SOLDIERS ABOARD, two of Rhodes' men, \npacing the deck, passing a bottle back and forth.\n\nJOHN (o.s.)\nWell, we found yer boat, lady, but so did \nthey.\n\nJOHN, SARAH AND TOBY are huddled behind green cover peering out at \nthe boat.\n\nSARAH\nLooks like just two. We can take 'em when \nthe time comes.\n\nJOHN\nWe're only about a quarter-mile from Cave \nentrance number five.\n\nTOBY\nThat entrance is closest to the labs and \nthe Bee cages.\n\nJOHN\nCome on. Let's go.\n\nThey move off stealthily.\n\nThey enter the clearing with the spectacular PLANTS that Miguel \ndiscovered. Six feet tall, their red-gold blossoms like trumpets with \ntheir bells down, these are Daturas, nightshades indigenous to \nsouthern Florida and parts of the Caribbean.\n\nSALLY AND JACK, who we saw working on the nitro sticks, are chopping \noff the eighteen-inch blossom and stuffing them into LARGE LEAF BAGS. \nThey're wearing HOSPITAL MASKS over their mouth and noses. JOHN moves \nin to help. TOBY AND SARAH follow but JOHN stops them.\n\nJOHN\nJust stand guard for now. Spell us after a \nwhile. Can't breathe this grass too long or \nsomebody hafta carry you home.\n\nWork goes on in silence.\n\n111\tEXT. THE STREET OUTSIDE THE RITZ - NIGHT\n\nMUSIC ROCKS AND VOICES SHOUT. The street scene is as wild as ever. \nHOOKERS, PUSHERS AND DRUNKS pack the hot darkness.\n\n112\tINT. THE RITZ - NIGHT\n\nAt A COT near the open wall, in DIM LIGHT FROM AN OVERHEAD BULB \nOUTSIDE, SARAH, JOHN AND TOBY huddle. The DIN from the street makes \nit impossible for others to hear them. TOBY is drawing A MAP.\n\nTOBY\nMaintenance shafts run behind all the main \nrooms. Nobody's in those at night. You can \nuse them to get around in. Hit the power \ngovernors first. Kick a surge into their \ncomputer network and you erase everything \nstored in the memory. Then...over in \nhere...that's where the cages are...\n\nOn the street outside, a puffing BILL McDERMOTT pushes through the \nunruly crowd, his face showing alarm.\n\nMcDERMOTT\nThe Doc's gone. Diesel and Jack and Spider \nwith him. They took the guns... and the \nnitro.\n\nCUT TO:\n\n113\tINT. HOSPITAL OPERATING ROOM - NIGHT\n\nCLOSE ON: LUKEY, beside himself, almost to the point of tears.\n\nLUKEY\nI coulden stop 'em, boss. No way I coulda \nstop 'em, I sweah. They tie me up and stick \ndis...\n(He's waving a pillowcase in his hand, the \naction accentuating his frenzied state.)\n...they stick dis in my mouf. You b'lieve \ndis?\n\nJOHN is in the room with SARAH, TOBY, SALLY AND BILL McDERMOTT. This \nis now the entire rebel force. THE FLOORBOARDS TO THE TUNNEL have \nbeen thrown aside. The weapons are gone.\n\nMcDERMOTT\nI was in the Cave yesterday workin' \nrepairs. Spider was in on clean up. I seen \nher talkin' ta some insiders... well, she \nwas scribblin', they was talkin'...mighty \npalsy.\n\n TOBY\nJesus! They're gonna try to do it! They're \ngoin' in! They got somebody to help 'em \nfrom the inside!\n\nLUKEY\nThey din' get da pistols. You know dem \npistols you buddy send in widda raffs.\n\nTOBY\nI gotta get Mary out. Tricks. We gotta go \nnow! Tonight! Right away!\n\nMcDERMOTT\nOh, Lord! (He polishes of what's left in \nhis flask and moves to refill it from the \nbottles in Logan's cabinet.)\n\nSALLY\nWe're not ready.\t\n\nJOHN\nWell...if ya think about it...we as ready \nas we ever gonna be. How was they carryin' \nthe nitro, Lukey?\n\nLUKEY\nOh, me. You ain't gonna b'lieve dis, \nneider. You ain't, I sweah. They put it \ninta Spidah's body.\n\nTOBY\nThey what?\n\nLUKEY\nDe Doc. He cut up Spidah here and here and \nhere...all ovah. He stick dem tubes in \ndere, like undah da skin...an' den he sews \n'em all up. I sweah. I sweah, sweah, sweah!\n\n114\tEXT. THE JUNGLE - NIGHT\n\nJACK AND DIESEL are chopping a path through the undergrowth with \nMACHETES. Behind them DOC LOGAN is walking slowly along with SPIDER, \nguiding her carefully around obstacles. SPIDER is in major pain. \nShe's sweating rivers, her fists are clenched, she's biting her lover \nlip so that it bleeds.\n\nLOGAN\nI know it hurts. But it won't be long. Then \nall the pain will be over. Oh, I wish you \ncould hear me. GOD, GIVE HER THE EARS TO \nHEAR ME SO SHE KNOWS I DON'T WANT HER TO \nHURT SO!\n\nDIESEL\nQuiet!\n\nLOGAN\nOh, yes. Quiet. Yes. We must be quiet.\n\nSuddenly, A ZOMBIE lunges from the underbrush, its FACE BADLY \nDETERIORATED and one of its hands; lost during its human life, \nreplaced by A MECHANICAL HOOK. SPIDER stumbles. She holds her breath \nand stiffens all her muscles. Miraculously the nitro vials inside her \ndo not explode. LOGAN throws himself quixotically in front of THE \nZOMBIE.\n\nLOGAN\nFALLEN ANGEL! THIS IS THE JUDGEMENT DAY \nWHEN YOU WILL BURN FOR YOUR SINS! THE LORD \nWILL CAST YOU DOWN TO THE LOWER REACHES AND \nYOU SHALL FOREVER KNOW....\n\nTHWOK!!! THE ZOMBIE'S STEEL HOOK SINKS DEEPLY INTO LOGAN'S UPPER \nCHEST. The man's eyes reflect no immediate sensation. His speech \nfalters but only slightly.\n\nLOGAN\n...YOU SHALL FOREVER KNOW THE PAIN... THE \nPAIN...\n\nTHE ZOMBIE pulls LOGAN towards its DROOLING, WIDE OPEN MOUTH. It's \njust about to bite when DIESEL CHOPS HIS MACHETE INTO THE CENTER OF \nTHE CREATURE'S SKULL. The thing falls, pulling LOGAN, still hooked, \nto the ground with it.\n\nLOGAN\nYOU SHALL FOREVER KNOW THE PAIN OF HELL... \nTHE PAIN OF HELL.\n\nDIESEL frees the doctor's shoulder from the hook. BLOOD FLOWS FREELY. \nDIESEL grabs a handful of DRESSINGS from LOGAN'S PACK and goes to \nwork on the wound.\n\nLOGAN\n...the pain of Hell...the pain...the \npain...\n\n115\tEXT. THE JUNGLE NEAR THE VENTS - NIGHT\n\nSARAH, SALLY, LUKEY AND McDERMOTT stand by while JOHN AND TOBY swing \nopen THE RUSTED GRILLWORK OF AN AIR-VENT in the ground. TOBY is able \nto swing his upper torso completely down inside.\n\n116\tINT. THE VENT - NIGHT\n\nTOBY hangs up-side-down in A RUSH OF AIR. He tightens A HOSPITAL MASK \nover his nose and mouth.\n\nTOBY\nOkay. Lemme have 'em.\n\nA LEAF BAG is passed in from above. TOBY flags the bag open and BITS \nOF FLOWER AND POLLEN DUST FLY through the tight space, sucked off \ninto the duct.\n\n117\tINT. THE COMMUNICATION ROOM - NIGHT\n\nCLOSE ON: A GRILL NEAR THE CEILING. BITS OF TOXIC POLLEN and AN \nOCCASIONAL PIECE OF FLOWER blow into the room.\n\nThere are SIX TECHNICIANS AND TWO SECURITY GUARDS posted at various \nstations. A RADIO MAN looks up.\n\nRADIO MAN\nWhat's that? Smell it?\n\nTECHNICIAN\nDunno. Must be comin' from outside. Kinda \nnice.\n\n118\tINT. ENTRANCE NUMBER SEVEN - NIGHT\n\nThere are only TWO GUARDS posted at the sealed entrance. One is \neating from A CAN OF SPAM. The other is reading an old, dog-eared \nPLAYBOY. A RIFLE BARREL jabs suddenly into \"Playboy's\" back.\n\nJULIE\nDon't move!\n\nIt's JULIE GRANT, Mary's disgruntled assistant. A YOUNG MAN, another \nbehaviouralist in a WHITE LAB COAT is with her. They both have \nRIFLES.\n\nJULIE\nOpen the outer door. Move it!\n\n\"Playboy\" slowly gets up and starts towards A CONTROL PANEL. At the \nlast minute, he spins around, grabbing JULIE'S GUN BARREL and pushing \nit away. JULIE'S YOUNG ACCOMPLICE swings his RIFLE BUTT and knocks \n\"Playboy\" cold. Then he trains the weapon on \"Spam man\" again.\n\nJULIE moves to the controls, examines them, trips A TOGGLE marked \n\"LOCK\" and pushes A LARGE GREEN BUTTON.\n\nTHE DOOR TO THE OUTSIDE SWINGS OPEN. Beyond is blackness with an \noccasional patch of MOONLIGHT ON JUNGLE GROWTH. JULIE walks slowly, \ncarefully toward the opening. Just as she is about to cross the \nthreshold into the night, A HUGE FIGURE leaps at her, grabbing her \nRIFLE and enclosing her in a strangle hold. It's DIESEL. Behind him, \ncomes JACK, his RIFLE (Sarah's rifle) levelled off at JULIE'S YOUNG \nFRIEND.\n\n\"Spam man\" makes a break for it down the hall. Reacting nervously, \ntoo quickly, JACK FIRES. \"SPAM MAN\" IS HIT SQUARELY IN THE BACK. He \npitches forward, dead.\n\nTHE YOUNG SCIENTIST raises his gun.\n\nYOUNG MAN\nHey! What the hell.....?\n\nJACK FIRES ANOTHER BURST and the ORANGE CIRCLE ON THE YOUNG MAN'S \nCHEST SHOW A DOTTED LINE OF RED. He flies back, a surprised \nexpression on his face, and he flops, dead, right on top of the \n\"Playboy\" guard who is lying near the control booth.\n\nLOGAN\nENOUGH! ENOUGH! ENOUGH! ENOUGH!\n\nTHE DOC comes slowly out of the night guiding SPIDER over the \nthreshold and into the hall. LOGAN reminds us of a crazy John \nHouston, floating on air in a madman's bubble.\n\nJULIE\nWhat...what is this? Who...?\n\nLOGAN\nIt's alright, it's alright, my dear. You've \nsimply helped us do the Lord's work.\n\nLOGAN'S SHOULDER WOUND IS BLEEDING THROUGH ITS DRESSINGS but the \ndoctor, on a holy mission, seems to feel no pain. He guides SPIDER \ninto the light and opens her shirt. DIESEL shoves JULIE against a \nwall. JACK covers her with his AUTOMATIC.\n\nLOGAN removes RED-SOAKED DRESSING from SPIDER'S skin. All over her \nbare chest and upper belly we see LONG, EIGHT-INCH SCARS, HASTILY \nSTITCHED WITH SUTURE SHOWING. Beneath each is A CIGAR-SHAPED BULGE \nwhere a vial of nitro has been implanted. The woman stands on \ncrumbling legs, her arms open outward, a grotesque lampoon of a \nstigmatic.\n\nJULIE\nWhat...what have you done to her?\n\nLOGAN\nGod forgive us. Forgive us the pain we \ninflict as surgeons. We'll be in Heaven, \nchild. Soon. We'll be with Him in Heaven.\n\nSPIDER\nNa...na...ak...aaaaaaaaaa...\n\nSPIDER is trying to signal something. She has seen that \"PLAYBOY\" is \ncrawling into the control booth. LOGAN follows her alarmed gaze.\n\nLOGAN\nNO YOU DON'T I CAN'T LET YOU DO THAT! I \nCAN'T!\n\nLOGAN charges toward the booth. THE GUARD is half-in-half-out of the \nglass chamber, his hands reaching for the control panel inside. LOGAN \nstarts to kick him, again and again.\n\nJACK\nOuta the way, Doc! Outa the way!\n\nThere's vengeance on LOGAN'S face. He's kicking THE GUARD brutally, \nbut that doesn't stop the man from reaching the controls. He hits A \nRED ALARM BUTTON. THE PANEL BUZZES AND COLOURED LIGHTS BLINK. THE \nDOOR to the jungle starts to swing closed. DIESEL dives at it but \ncan't stop the steel slab. It slams with A LOUD THUNNNNNG!\n\nJACK swings into another position to get a clear shot and he FIRES A \nLONG BURST into the control booth. \"PLAYBOY\" IS STRUCK BY SEVERAL \nROUNDS. He bounces around in the booth and collapses to the floor, \ndead.\n\nLOGAN, his SHOULDER WOUND POURING BLOOD, aggravated by his physical \nexertion, falls to floor himself, in a faint.\n\nJACK\nShit!\n\nDIESEL\nKeep the woman covered.\n\nJACK levels off on JULIE again. DIESEL moves over to SPIDER. Pulling \nFRESH DRESSING from LOGAN'S BAG, the big man begins to pack them onto \nSPIDER'S BLEEDING CHEST.\n\n119\tINT. THE COMMUNICATION ROOM - NIGHT\n\nCLOSE ON: A BLINKING RECTANGLE OF RED LIGHT. Written on its face is: \nALARM - GATE 7. A BELL RINGS LOUDLY in the room. THE SHOT WIDENS and \nwe see FIVE MEN, all slumped, unconscious, none able to react to the \nalarm.\n\nONE OF THE SECURITY GUARDS has made it to THE EXIT. He manages to \npush the door open, but then he falls in a heap.\n\nA RADIO MAN staggers into A WEBBING OF WIRES, then he too falls.\n\nTHE OTHER SECURITY GUARD inches his hand towards A LEVER WITH A \nPROTECTIVE COVER. He flips the cover up, then collapses. The falling \naction causes his fingers to trip the lever. A HUGE KLAXON SOUNDS. A \nBLINKING RECTANGLE, huge over the doors, reads: GENERAL ALERT!\n\n120\tINT. GASPARILLA'S GYMNASIUM - NIGHT\n\nThe usual scene here, GASPARILLA AND HIS COURTESANS entertaining THE \nCOUNCILMEN AND THEIR LADIES. THE KLAXON SOUNDS over THE LOUD ROCK \nMUSIC. MARY HENRIED, a prisoner for the evening again, hears THE \nSOUND. Her eyes widen. She looks over at RHODES, who jumps to his \nfeet. The party gradually goes silent.\n\nRHODES\nDon't be alarmed. We're impregnable. Stay \nwhere you are. Nothing will happen to any \nof you. You're safe here. Men.\n\nThis last word to A SMALL UNIT OF FOUR TROOPERS standing guard at THE \nEXIT. RHODES goes steaming through the doors. TWO OF THE TROOPERS \nFOLLOW, THE OTHER TWO unsling their RIFLES and take up posts just \noutside in the corridor. THE STEEL DOOR SLIDES SHUT locking \nGASPARILLA AND HIS COURT inside the gymnasium...MARY HENRIED with \nthem.\n\nGASPARILLA\nWell, c'mon, ladies and gents. Who says we \ngotta let our evenin' get spoiled? Simon \nsez...GET DOWN!!!\n\nMOST OF THE GUESTS are willing to let the party get back to full \nswing. GASPARILLA grabs A TOPLESS COURTESAN and rocks his fat belly \naround in an attempted dance. MARY seems to be the only one concerned \nabout the alarm.\n\n121\tEXT. THE JUNGLE - NIGHT\n\nEven outside THE KLAXON CAN BE HEARD. TOBY AND THE REBELS stop in \ntheir tracks.\n\nTOBY\nThat's the general alarm. Jesus! They musta \ngot in!\n\nJOHN\nWhat you wanna do?\n\nTOBY\nCome on!\n\nTHE GROUP moves out urgently.\n\n122\tINT. ENTRANCE NUMBER TWO - NIGHT\n\nA CIRCULAR LIGHT BLINKS GREEN with A BUZZING SOUND. THE TWO INSIDE \nGUARDS punch up A VIDEO MONITOR. The screen shows TOBY TYLER AND \nLUKEY holding PISTOLS on SALLY AND BILL McDERMOTT.\n\nGUARD\n(into intercom) What's goin' on?\n\nTOBY (filter)\n(on video) LET US IN. THERE'S BEEN A \nREVOLT...AT STALAG SEVENTEEN...THERE'S \nREBELS CRAWLIN' EVERYWHERE!\n\nGUARD #2\nI know him. That's Tyler.\n\nTOBY (filter)\n(on video) FER CHRISSAKE! LEMME IN, DAMMIT! \nLEMME IN!\n\nTHE FIRST GUARD HITS A BUTTON AND THE BIG STEEL ENTRANCE DOOR SWINGS \nOPEN. THE REBELS storm in like an ocean wave taking the hapless \nGUARDS completely by surprise. They knock them unconscious and take \ntheir WEAPONS. TOBY pushes A BUTTON which causes the outer door to \nswing shut, then he leads the band down the corridor.\n\nThey go through A DOOR about a hundred yards from the entrance.\n\n123\tINT. MAINTENANCE SHAFT - NIGHT\n\nThis is one of the WORK CORRIDORS that TOBY mentioned earlier. THE \nREBELS run, single-file, deep into the Cave.\n\n124\tINT. ENTRANCE SEVEN - NIGHT\n\nJULIE GRANT has been ROPE-TIED to an eyelet in the wall. DIESEL sets \ndown A PISTOL AND A BOX OF AMMO beside DOC LOGAN who is sitting on \nthe floor beside the control booth. He's having trouble catching his \nbreath. His WOUND has turned his ENTIRE FRONT RED.\n\nDIESEL\nYou'd hold us back. We have to go on.\n\nLOGAN\nHmmmmmm? Oh, yes. Go on.\n\nSPIDER, her shirt buttoned again over her new dressings, is carefully \nsigning something. DIESEL reads her fingers.\n\nDIESEL\nMaps. Yes. She was supposed to bring us \nmaps.\n\nJACK steps over to JULIE. He frisks her pockets and finds TWO HAND-\nDRAWN MAPS showing complete layouts of the Cave.\n\nDIESEL\nAlright. Let's go.\n\nThey move out, DIESEL supporting SPIDER, JACK with his RIFLE ready.\n\n125\tINT. A SUPPLY CLOSET - NIGHT\n\nTOBY breaks open A CARTON and pulls GAS MASKS out. He passes them \nback to BILL McDERMOTT AND SARAH.\n\n126\tINT. THE COMMUNICATIONS ROOM - NIGHT\n\nTHE REBELS, all wearing GAS MASKS, burst into the room. TOBY moves \nright toward AN INTERCOM. He punches in a code and waits while the \nINTERCOM BUZZES.\n\nTOBY\nCome on, Mary. Answer. ANSWER!\n\nNothing. Toby punches up another code while the others drag THE \nUNCONSCIOUS GUARD out of the doorway, letting the doors shut behind \nthem. A VOICE comes over the speakers.\n\nTRICKS (o.s. - filter)\nYeah.\n\nTOBY\nTricks, it's Tyler. We're inside.\n\nTRICKS (o.s. - filter)\nWhat? Was that you that set off the alarms?\n\nTOBY\nNo. There's some loonies from outside. \nThey're gonna try to blow the powder \nmagazine.\n\nTRICKS (o.s. - filter)\nWhere are you? What's the plan?\n\nTOBY\nFind Mary. If you can get help do it. We're \ngonna hit the power station and haul-ass \nouta here. We'll be at exit five...that's \nexit five in exactly ten minutes.\n\nTRICKS (o.s. - filter)\nI think I can get a couple guys.\n\nTOBY\nAnd Mary! You gotta find Mary!\n\nTRICKS (o.s. - filter)\nI'll try, Tob. I'm gone.\n\nTRICKS clicks off. TOBY levels his AUTOMATIC at the RADIO CONSOLE and \nFIRES. SPARKS FLY, CHUNKS OF WOOD AND METAL SHOOT OFF IN EVERY \nDIRECTION.\n\nMcDERMOTT\nHOLD ON! HOLD ON! Yer wastin' yer \nammunition. Hit 'er in here...then around \nback in the circuit boards.\n\nTOBY levels off again, this time at the \"kill-zones\". BULLETS FLY. \nMORE SPARKS DANCE as THE UNIT BREAKS APART.\n\nMcDERMOTT\n(shouting) AND OVER HERE. THE ALARM \nSYSTEMS. THESE CENTRAL PANELS HERE. THESE \nCIRCUITS.\n\nSARAH AND SALLY step up and start BLASTING. A PROFUSION OF SPARKS \nthis time as THE ALARM SYSTEMS SEEM TO EXPLODE.\n\nSuddenly A COLLECTION OF RED LIGHTS START BLINKING URGENTLY. A BELL \nSOUNDS. THE LARGE RECTANGLE OVER THE EXIT IS FLASHING A NEW WORD: \nEVACUATE! EVACUATE! EVACUATE!\n\nMcDERMOTT\nJesus, Mary and Joseph! (he slugs from his \nflask) By blowin' the alarm panels...we \nsignalled an Evac!\n\n127\tINT. CORRIDORS IN THE CAVE - NIGHT\n\nMONTAGE: A LOUD BUZZING IS HEARD as DOORS OPEN everywhere, some \nsliding, some swinging back, some rolling into the walls. TROOPERS \ncaught trotting through halls are taken by surprise. CITIZENS spill \nout of apartment doors that have opened electronically.\n\n128\tINT. ENTRANCE SEVEN - NIGHT\n\nTHE DOOR TO THE JUNGLE SWING OPEN. JULIE GRANT looks over at DOC \nLOGAN. The madman struggles to his feet. Supporting himself against \nthe wall of the control booth, he reaches inside and starts pushing \nbuttons.\n\nJULIE\nThose buttons won't work! The evacuation \ncommand overrides them.\n\nJULIE looks through the open entranceway. Barely visible in the DIM \nBLUE MOONLIGHT are the hulking shapes of TWO...NO THREE ZOMBIES, \napproaching the open hatch.\n\n129\tINT. THE COMMUNICATION ROOM - NIGHT\n\nMcDERMOTT is explaining to the others.\n\nMcDERMOTT\nAll the doors in the Cave have been sprung \nopen...all the ones that work on electric. \nIt's so nobody'll get trapped anywhere.\n\n130\tINT. ENTRANCE SEVEN - NIGHT\n\nLOGAN stares dumbly, without comprehending, at THE ZOMBIES which are \nlurching forward out of the night.\n\nJULIE\nCUT ME LOOSE! PLEASE! CUT ME LOOSE!\n\n131\tINT. THE DORMITORY - NIGHT\n\nTHE LATCHES ON THE CELL DOOR CLICK. With BUZZING, MOTOR NOISES, THE \nDOORS OPEN OUTWARD. THE ARMY OF RED COATS marches out into the hall. \nWe might recognise TONTO, BLUTO, SAMSON....we certainly recognise big \nBub.\n\n132\tINT. A HOLDING PEN IN THE CAVE - NIGHT\n\nWe see A LARGE PEN, its GATE SWINGING OPEN. From inside, MOANING \nHUNGRILY, come FORTY OR FIFTY ZOMBIES, BLUE COATS AND WHITE.\n\nGUARDS outside the pen start to panic. They OPEN FIRE. A FEW ZOMBIES \nARE HIT but there are too many, way too many. THE GUARDS turn tail \nand retreat off into the Cave.\n\nTHE ZOMBIES are out! Free to find their own suppers!\n\n133\tINT. THE GYMNASIUM - NIGHT\n\nTHE DOORS have opened here, too. THE CROWD, having heard the \nEVACUATION SIGNAL, is panicking. MANY are running out past THE GUARDS \nand into the hallway. GASPARILLA is trying to reinstate calm.\n\nGASPARILLA\nSTAY HERE! STAY PUT! WE'LL BE ALRIGHT! \nWE'RE SAFE HERE! JUST AS SAFE AS ANYWHERE \n'TIL WE FIND OUT WHAT'S GOIN' ON!\n\nMARY HENRIED takes advantage of the confusion. She slips out behind \nTWO COUNCILMEN AND THEIR LADY-FRIENDS.\n\n134\tINT. NURSERY CORRIDOR - NIGHT\n\nTHE HALLWAY is in chaos. TROOPERS run by, CRAZED CITIZENS flee in \nboth directions. MARY HENRIED is stopped by A NURSE standing in AN \nOPEN DOORWAY.\n\nNURSE\nWhat is it? What's happening?\n\nMARY\nIt's an evacuation signal. The radios are \nout. People are panicking.\n\nNURSE\nWhat should we do?\n\nMARY looks past THE NURSE into A ROOM where A GROUP OF CHILDREN, a \ndozen or so, ranging from twelve-years-old down to infancy, are \nhuddled. Some are crying.\n\nMARY\nGod. I, er...I dunno what to say. It could \nbe a real evacuation or it could just be a \nglitch in the system. Wait here for now. \nI'll...I'll make sure you get the word what \nto do, okay?\n\nNURSE\nPlease...hurry...\n\nMARY takes off down the hall.\n\n135\tINT. ENTRANCE SEVEN - NIGHT\n\nCLOSE ON: JULIE GRANT'S FACE, screaming, in agony, on the brink of \ninsanity. THE ZOMBIES have reached her. They're started to pull at \nher arms, her legs. ONE BITES HER HAND, ANOTHER HER ARM, ANOTHER HER \nCALF.\n\nDOC LOGAN is watching from the control booth, all the while fiddling \nwith BUTTONS, DIALS, LEVERS.\n\nLOGAN\nWe'll be in Heaven soon. We'll all be in \nHeaven soon.\n(Julie's screams penetrate the fog in his \nbrain. He frowns.)\nPain. God forgive the pain inflicted by \nsurgeons. We must atone. We must atone for \nour sins.\n\nHis eye is attracted to A LARGE LEVER seemingly separate from \neverything else. It's marked: SIREN. He pulls it.\n\nLOGAN\nWe must...atone. We must.\n\n136\tEXT. THE SIREN HORN - NIGHT\n\nSlowly, THE THROATY WAIL RISES and calls out over the jungle. It's \nthe \"Feeding Signal\" we heard earlier.\n\n137\tEXT. THE JUNGLE - NIGHT\n\nMONTAGE: as everywhere in the jungle ZOMBIES turn toward the call of \nTHE SIREN. They start to walk...toward the SOUND, toward the place \nwhere there is food.\n\n138\tINT. ENTRANCE SEVEN - NIGHT\n\nJULIE is still screaming wildly. THE ZOMBIES ARE TEARING HER APART, \nLITERALLY.\n\nDOC LOGAN inadvertently kicks THE PISTOL left by DIESEL and is \nskitters across the floor. He flops down on his knees.\n\nLOGAN\nWE WILL ATONE. WE WILL BE THE \nSACRIFICE...THE COMMUNION...WE OFFER \nOURSELVES UP...OUR SOUL...AND OUR BODIES...\n\nJULIE GRANT finally loses consciousness. MANY MORE ZOMBIES are \npressing in through the entrance now. They reach LOGAN and start to \ntear at him. Something clicks in his brain and he realises what's \nhappening. He starts to scream. His hands find THE PISTOL on the \nfloor.\n\nONE ZOMBIE TAKES A BITE OUT OF HIS LEFT ARM. He shrieks and brings up \nTHE PISTOL, FIRING. THE FIRST SHOT RIPS OPEN THE CREATURE'S SKULL. \nThe next FIVE SHOTS are wasted, FIRED WILDLY. The GUN CLICKS emptily \nas THE ZOMBIES engulf him, TEARING, BITING, EATING HIM ALIVE.\n\nMORE ZOMBIES come out of the jungle...a lot more...called by the \nSIREN. In waves they enter the Cave looking for food.\n\n139\tINT. A CORRIDOR IN THE CAVE - NIGHT\n\nTRICKS is running through the hall with TWO BUDDIES. MARY HENRIED \njumps out of the crowd.\n\nMARY\nTricks! What's going on?\n\nTRICKS\nToby's in the Cave. We're gonna make our \nmove. There's rebels out to blow the powder \nmagazine. Come on. Come with us.\n\nMARY\nWhere are you goin' out?\n\nTRICKS\nExit five.\n\nMARY\nSee ya there.\n\nShe turns away and starts back in the direction she came from. TRICKS \ncalls after her.\n\nTRICKS\nSEVEN MINUTES, MARY. EXACTLY SEVEN MINUTES!\n\n140\tINT. THE MAIN CHAMBER OF THE CAVE - NIGHT\n\nRHODES AND EIGHT TROOPERS turn a corridor and there, before them, is \na sight out of Dracula's tomb. Moving through the lava-stone arches, \nbetween the giant earthen pillars, is THE ARMY OF BLUE AND WHITE \nZOMBIES. RHODES and his men can't possibly fight them, there are too \nmany. RHODES spots A DOOR WITH A CAGED RED LIGHT OVERHEAD. They can \nget to it by slicing through only A FEW OF THE ADVANCING GHOULS.\n\nRHODES\nTHIS WAY. OVER HERE! SHOOT! SHOOT THEM! \nSHOOT TO KILL! IN THE HEAD!\n\nTheir RIFLES BLAZE as they drive through the edge of THE ZOMBIE \nHORDE. SEVERAL OF THE CREATURES GO DOWN, THEIR HEADS BLASTED OPEN BY \nRAPID-FIRE ROUNDS.\n\nONE grabs RHODES by the sleeve of his jacket. The captain turns on \nhis heels and stares at the thing with outraged disbelief. He raises \nhis MAGNUM and pumps TWO QUICK SHELLS INTO THE CREATURE'S BRAIN.\n\nTHE PLATOON finally reaches the door. RHODES holds it open while his \nMEN run inside. He holsters his PISTOL and unslings his AUTOMATIC. \nTHE ZOMBIES press towards him. He selects A FEW OF THE CLOSEST ONES, \naims, and FIRES, with a look of enjoyment on his face. For a moment \nhe resembles Doc Logan, madness bristling inside him.\n\nTHE ZOMBIES fall, THEIR HEADS SHATTERED, ONE OF RHODES' MEN calls \nfrom inside the doorway.\n\nTROOPER\nCaptain...CAPTAIN!\n\nRHODES FIRES ANOTHER QUICK BURST, then he turns and moves through the \ndoorway.\n\n141\tINT. A CORRIDOR IN THE CAVE - NIGHT\n\nSPIDER is walking along, careful to avoid jolts, support-under her \narms by the giant DIESEL. JACK walks with them, his nervousness \nirritated by the need to move slowly. CITIZENS run past, none of them \npaying attention to the desperadoes.\n\nSuddenly they encounter A TROOP OF SOLDIER who come trotting around a \ncorner. Nervous JACK OPENS FIRE. TWO SOLDIER GO DOWN. A gunfight \nerupts as the rest of the TROOPS scatter in the hallway, CIVILIANS \nare caught in the crossfire. TWO ARE HIT.\n\nDIESEL manages to steer SPIDER around a corner to safety. JACK keeps \nFIRING but he's trapped in A HAIL OF BULLETS. A RED LINE CUTS ACROSS \nHIS CHEST and he flies back, dead, his GUN STILL FIRING.\n\nOut of the Troopers' sight, DIESEL checks his map and moves into A \nDOORWAY, one of several on the area, guiding SPIDER through beside \nhim.\n\n142\tINT. ANOTHER MAINTENANCE SHAFT - NIGHT\n\nThey find themselves in one of those work corridors. The giant man \nshoulder his RIFLE and gently lifts SPIDER into his arms. He moves, \nas smoothly as he can, down the shaft and around a bend.\n\n143\tINT. A CORRIDOR IN THE CAVE - NIGHT\n\nTOBY leads JOHN AND THE REBELS out into A HALLWAY. They break across \nto an opposite door. Before they can escape, A TROOP OF SOLDIERS \nappears. A GUNFIGHT ENSUES.\n\nTWO SOLDIERS GO DOWN. JOHN IS WOUNDED IN THE SHOULDER but he stays on \nhis feet. THE SOLDIERS have them divided in the two opposite \ndoorways.\n\nSuddenly, TRICKS AND HIS BUDDIES come charging around a corner. THEY \nOPEN FIRE. THE SOLDIERS RESPOND. TWO MORE SOLDIERS GO DOWN. ONE OF \nTRICKS' MEN IS KILLED. TRICKS himself IS WOUNDED BADLY IN THE \nSTOMACH.\n\nCaught in a crossfire, THE LAST FOUR TROOPERS throw down their guns. \nThey flee wildly down the corridor. THE REBELS pick up and file \nthrough one of the doors. TOBY rushes to aid his BADLY WOUNDED BUDDY.\n\nTOBY\nTricks...Jesus...\n\nTRICKS\nI'm alright. Let's go.\n\nThey follow after the others.\n\n144\tINT. THE GYMNASIUM - NIGHT\n\nA SCREAM GOES UP! A WOMAN near the exit has spotted something \nterrifying in the hallway. THE GUARDS panic. ONE OF THEM OPENS FIRE.\n\n145\tINT. THE HALLWAY OUTSIDE THE GYMNASIUM - NIGHT\n\nA MASS OF ZOMBIES COME SHUFFLING DOWN THE CORRIDOR. Their VOICES ECHO \nIN GROTESQUE HARMONY, the song of the living dead that we've heard \nbefore.\n\n146\tINT. THE GYMNASIUM - NIGHT\n\nTHE GUARDS are trying to close the entrance doors manually. The big \nslabs won't budge. Suddenly GASPARILLA appears. Drawing A PISTOL from \nA HOLSTER he wears, without warning he SHOOTS ONE OF THE GUARDS. THE \nOTHER GUARD flees.\n\nGASPARILLA falls onto the dead man and rips off his ORANGE-CIRCLE \nVEST. THE ZOMBIES are pressing in now, into the gymnasium. GASPARILLA \nAND SEVERAL REMAINING PARTY-GOERS (none with vests) are trapped.\n\n147\tINT. A CORRIDOR NEAR THE DORMITORY - NIGHT\n\nMARY is running along with THE NURSE AND THE CHILDREN. Suddenly, from \nout of a doorway, comes CAPTAIN RHODES WITH HIS STORM TROOPERS.\n\nRHODES\nHENRIED! WHERE ARE YOU GOING?\n\nWithout answering, MARY leads her band through A MANUAL DOOR that \nleads to the Dormitory.\n\nRHODES\nSTOP THEM! SHOOT!\n\nSOLDIER\nThe...the children, sir.\n\nRHODES\nAfter them then! I want them stopped! That \nwoman is dangerous!\n\n148\tINT. THE HALLWAY OUTSIDE THE DORMITORY - NIGHT\n\nMARY AND HER REFUGEES are stopped in their tracks by BUB AND HIS \nCADRE OF RED COATS. THE NURSE screams and tries to back away. THE \nCHILDREN cling to her, petrified, shrieking, starting to cry.\n\nBUB lumbers up to MARY and...salutes. MARY returns the formality.\n\nMARY\nIt's alright. I don't think they'll hurt \nus. Try to stay calm.\n\n149\tINT. THE OUTER CORRIDOR - NIGHT\n\nTHE MANUAL DOOR has been locked from inside.\n\nRHODES\nSHOOT IT OPEN!\n\nTHE SOLDIERS follow orders, TWO OF THEM FIRING AT THE LOCK.\n\n150\tINT. THE FIRING RANGE - NIGHT\n\nMARY is at A CABINET pulling out PISTOLS AND RIFLES, passing the \nweapons around to TONTO, BLUTO, SAMSON. BUB is strapping on his TWO-\nGUN HOLSTER SET all by himself, fumbling a little, but succeeding.\n\n151\tINT. THE CORRIDOR WITH RHODES - NIGHT\n\nRHODES' MEN kick open the door and charge into the Dormitory \ncorridor.\n\n152\tINT. THE FIRING RANGE - NIGHT\n\nTHE NURSE slams ANOTHER MANUAL DOOR, locking and bolting it.\n\nNURSE\nThey're coming! They're coming!\n\nShe hurries along the caged alley behind the firing stalls guiding \nTHE CHILDREN to an opposite exit.\n\nBLAM! BLAM! MARY IS FIRING at AN ORANGE CIRCLE VEST on one of the cut \nout target figures in the range. THE RED COATS are watching with \ncuriosity, cocking their heads.\n\nMARY moves to fire again but BLUTO grabs her hand.\n\nMARY\nNO...BLUTO...I'M TRYING TO...\n\nThe dumb creature keeps his grip. MARY has to appease to him. She \ngrasps his hand and shakes vigorously. When he finally lets go, she \naims her PISTOL again and FIRES AT THE VEST SEVERAL MORE TIMES.\n\nMARY\nLook. It's good to shoot the circles. Good. \nGood.\n\nTHE ZOMBIES are confused. Exasperated, MARY tears off her own vest \nand tosses it down the alley. THE RED COATS look befuddled, and a \nlittle angry. MARY FIRES at the vest she threw down. TWO BULLETS HIT \nIT before MARY'S PISTOL CLICKS...empty.\n\nThere's A POUNDING AT THE DOOR. It's RHODES AND HIS TROOP.\n\nSuddenly BUB steps into position. WHAP! One of his famous quick \ndraws! BLAM!!! HE FIRES. THE VEST ON THE FLOOR, MARY'S VEST, IS HIT. \nBUB FIRES AGAIN, the other gun this time. THE VEST ON THE TARGET IS \nHIT squarely in the center of its orange circle.\n\nTONTO now turns. He lifts his PISTOL and FIRES. THE VEST ON THE \nTARGET IS HIT AGAIN, off center, but hit.\n\nMARY\nTHAT'S IT! THAT'S IT!\n\nSuddenly THE DOOR AT THE END OF THE RANGE FLIES OPEN. THREE OF \nRHODES' MEN RUSH IN, wearing, of course, orange circles. THE RED \nCOATS OPEN FIRE. THE TROOPERS ARE CUT TO RIBBONS. Others outside the \ndoor duck back behind the walls.\n\nTHE ZOMBIES lumber toward the open doorway, STILL FIRING AS THEY GO. \nMARY is backing away through the opposite exit. BUB sees her leaving. \nHe calls to her with a deep, pleading moan. MARY stops and looks at \nhim sadly. He shoots off a military salute. MARY salutes him back. \nThere are tears in her eyes.\n\nShe turns and hurries off. BUB joins his fellows in pursuit of \nRhodes' and his men.\n\n153\tINT. THE GYMNASIUM - NIGHT\n\nA WOMAN'S FACE IS FULL SCREEN. She is screaming in agony as she is \nTORN APART BY ZOMBIES. The creatures have invaded the gymnasium. \nThey're CLAWING AT THE FAT-CAT COUNCILLORS, MAULING THEIR WOMEN.\n\nGASPARILLA AND TWO OTHER MEN are rolling around crazily, bumping into \nexercise machines, knocking over wine bottles and tables full of \nhors-d'oeuvres. The single vest they are fighting over rips apart \ninto two pieces, its orange circle severed into two useless halves.\n\nGASPARILLA backs across the floor, his blubber bouncing. He has a \ntattered piece of the vest clutched in his hands. He tries to spread \nit out on his chest but it's too late... and THE ZOMBIES are too \nhungry...much too hungry.\n\nMONTAGE: as ALL OVER THE ROOM THEY STRIKE. This is it, gore fans. The \ngross finale. The intestine-tugger. THE ZOMBIES GET THEIR SUPPER. \nTHEY FEAST AMONG THE PILLOWS, like Romans at an orgy. MUSIC still \nplays over the gymnasium speakers, rock-a-billy in a gleeful tempo.\n\nGASPARILLA has retreated into his tanning-coffin but a pudgy arm and \na leg are dangling outside. ZOMBIES CHEW HUNGRILY on the juicy \nmorsels. From inside the coffin, where ultraviolet glows brightly, \ncome the piercing, agonised screams of the fat General.\n\n154\tINT. THE MAIN CHAMBER OF THE CAVE - NIGHT\n\nDIESEL guides SPIDER through the huge earthen archways. ZOMBIES here \nare scattered now, but they provide for delays. DIESEL FIRES and \nZOMBIES ARE HIT but few are hit fatally. DIESEL'S free arm can't fire \naccurately while he's trying to support the walking bomb beside him.\n\nDIESEL stops to check his map. A ZOMBIE looms up behind him and takes \na HUGE BITE OUT OF HIS SHOULDER. DIESEL screams. He lets go of SPIDER \nwho stumbles away from him, almost falling but saving herself. Her \neyes are bugging with pain.\n\nDIESEL FIRES POINT BLANK AT THE ZOMBIE, BLOWING ITS HEAD TO BITS. \nMORE CREATURES are pressing in close. DIESEL bats at one, kicks \nanother, punches a third. Then he rushes to SPIDER'S side and scoops \nher into his arms again. Wincing in pain from THE BLEEDING WOUND IN \nHIS SHOULDER he manages to move out of immediate danger.\n\nTHE ZOMBIES lumber after the two, groaning in chorus as they walk.\n\n155\tINT. THE CORRIDOR AT EXIT FIVE - NIGHT\n\nMARY, THE NURSE AND THE CHILDREN come charging down the hall. TOBY, \nSARAH, AND JOHN are waiting for them near the open door which leads \nout into the jungle. TOBY AND MARY rush into each other's arms and \nthey flee, with the others, out into the night.\n\n156\tINT. A CORRIDOR NEAR THE DORMITORY - NIGHT\n\nRHODES AND HIS MEN rush into another corridor where they are met by a \ncrowd of DROOLING ZOMBIES. THE MEN OPEN FIRE but the ZOMBIES are too \nclose in. They get the upper hand.\n\nRHODES FIRES HIS MAGNUM, his eyes insane, his face boiling red with \ndisbelief. After TWO SHOTS BLAST OPEN THE HEADS OF THE CLOSEST \nZOMBIES, THE MAGNUM just CLICK-CLICK-CLICKS! RHODES is out of lead.\n\nHe's grabbed by ONE ZOMBIE, then ANOTHER. He fights to free himself \nbut HE'S BITTEN ONCE...TWICE...\n\nBLEEDING, he fights on. He struggles to a doorway and pushes through.\n\n157\tINT. ANOTHER CORRIDOR - NIGHT\n\nRHODES comes face-to-face with...you guessed it...big BUB. THE ZOMBIE \nfaces off, ready to draw those SIX-GUNS that hang at his hips. RHODES \nturns and runs.\n\nWHAP! BUB slaps leather. BLAM! BLAM! BLAM! RHODES turns a corner but \nONE BULLET BITES HIM ON THE BACK OF HIS SHOULDER. Terrified, fighting \npain, he staggers on with the gun-totin' RED COAT following behind.\n\n158\tEXT. THE JUNGLE - NIGHT\n\nTHE REBELS lead MARY, THE NURSE AND THE CHILDREN through the \nunderneath. TRICKS is bleeding badly. TOBY helps him along. Suddenly, \nas they break into a clearing, SARAH stops cold. There on the ground, \nlying where we last saw it, is THE CORPSE OF MIGUEL.\n\nJOHN\nWhat is it?\n\nSARAH\nIt's...he was...one who came to the island \nwith me.\n\nTOBY\nCome on. No time.\n\nSARAH\nHe was killed...five days ago.\n\nMARY\nMaybe...maybe he wasn't dead. Are you sure \nhe was dead when you left him?\n\nSARAH\nLook at him. A hundred bullets. You tell \nme. Was he dead?\n\nThere are tears in SARAH'S eyes.\n\nSARAH\nFive days...and he hasn't...risen. He \nhasn't risen.\n\nTOBY\nCome on. There's no time. There's no time \nto lose.\n\nTHE GROUP pushes ahead. SARAH kneels. She blesses herself and makes \nthe sign of the cross over the corpse. Then she stands to see that \nJOHN is waiting for her. He holds out his hand, she takes it and \nfollows the others.\n\n159\tEXT. THE BACKWATER - NIGHT\n\nTHE SOLDIERS aboard THE FISHING BOAT hear NOISES coming from the \nsurrounding jungle.\n\nSOLDIER\nWHO IS IT? WHO'S OUT THERE?\n\nJOHN (o.s.)\nWE WANT THE BOAT! DROP YER GUNS OR WE'LL \nBLAST YOU!\n\nTHE SOLDIERS hesitate, looking around at the dark jungle.\n\nTOBY (o.s.)\nWE GOT YOU SURROUNDED!\n\nA SUDDEN BURST OF AUTOMATIC FIRE LIGHTS UP THE BLACK FOLIAGE. THE \nSOLDIERS react, flinging their WEAPONS over the side into the water.\n\nTHE REFUGEES spill out of the undergrowth and scramble over to the \nboat, lifting THE CHILDREN and THE WOUNDED TRICKS on board carefully.\n\nJOHN pauses to look back into the jungle.\n\nJOHN\nDamn you, island. Damn you ta Hell and \nworse!\n\nMcDERMOTT\nWe ain't outa here yet. Get yer ass movin' \nya dumb bastard.\n\nMcDERMOTT tries to slug from his flask, finds it empty. With a shrug \nhe tosses the thing into the backwater. THE ENGINE STARTS as JOHN \nclimbs aboard, SARAH AND TOBY giving him their hands.\n\n160\tINT. THE MAIN CHAMBER WITH DIESEL AND SPIDER - NIGHT\n\n161\tINT. THE LABORATORY AREA WITH RHODES AND BUB - NIGHT\n\n(These two sequences will be intercut for parallel action)\n\nZOMBIES are crawling all over DIESEL now. He fights them off \nvaliantly but his super strength is waning. HE IS BITTEN AGAIN AND \nAGAIN but he tries to keep himself between THE CLUTCHING CREATURES \nAND THE LITTLE DEAF MUTE who is stumbling along ahead. She's getting \nvery close to a huge SET OF CONCRETE SLABS...THE DOORS TO THE POWDER \nMAGAZINE.\n\nMeanwhile RHODES approaches another corner in the hallway near the \nConditioning Room. BUB follows, his boot heels CLICKING the way \nRHODES' own heels once clicked.\n\nRHODES dives for the corner. BUB slaps leather and FIRES OFF ALL \nTWELVE. RHODES rolls on the ground crazily. HE'S HIT SEVERAL \nTIMES...but he's still alive. He pulls himself, in agony, out of \nrange. Calmly, BUB dumps out his spent shells and starts to reload.\n\nIN THE MAIN CHAMBER, DIESEL IS OVERCOME, DRAGGED DOWN BY A MOB OF \nZOMBIES. THEY START TO TEAR HIM APART BIT BY BIT.\n\nSPIDER walks on alone. She is just a few feet from the POWDER \nMAGAZINE now. A ZOMBIE grabs her from behind but just gets a handful \nof shirt. SPIDER reaches forward but the creature holds her back. Her \nSHIRT IS RUNNING RIVERS OF BLOOD NOW where the vials are implanted \nunderneath.\n\nRHODES crashes through a doorway into THE CONDITIONING ROOM. He \nrealises, too late, that there's no exit. BUB'S BOOTHEELS are getting \nLOUDER. RHODES crawls around behind THE TABLES FULL OF TESTING \nEQUIPMENT, WOODEN SHAPES, FLASH CARDS SCATTER. Over near the LARGE \nCOLOURED SYMBOLS which are mounted on the wall there's A WEAPONS \nCABINET. RHODES grabs a chair and smashes open the glass.\n\nBUB steps into the open doorway, still reloading his PISTOLS. He \nstands there, a golem, his fingers slowly, calmly working. He drops a \nshell or two but soon the barrels are filled with fresh loads.\n\nRHODES reaches in through the broken glass and pulls out AN \nAUTOMATIC.\n\nBUB slaps his PISTOLS back into their HOLSTERS and face off.\n\nRHODES lifts the AUTOMATIC...aims...\n\nBUB DRAWS! BLAM! BLAM! BLAM! BLAM! BLAM! BLAM! BLAM! BLAM! BLAM! \nBLAM! BLAM! BLAM! EACH ONE OF THE TWELVE BULLETS HITS RHODES \nSOMEWHERE, many of them in the \"kill-zones\". He screams when the \nfirst few rounds hit, but his screaming stops about halfway through \nthe barrage. That's when he dies. His leg bones support his corpse \nlong enough for the last six bullets to reach him. Then, as THE SOUND \nOF BUB'S GUN ECHOES AWAY down the corridors, RHODES BODY slides down \nthe wall and crumples to the floor in a heap, leaving MUCH OF HIS \nBLOOD on the ORANGE CIRCLE that's mounted behind him.\n\nIN THE MAIN CHAMBER, A ZOMBIE TAKES A BITE OUT OF SPIDER'S SHOULDER. \nIT PULLS OUT A BIG CHUNK OF FLESH, AND WITH IT, STUCK IN THE \nCREATURE'S TEETH, COMES ONE OF THE NITRO VIALS.\n\nSEVERAL ZOMBIES are pulling at the woman. She is still reaching for \nthe POWDER MAGAZINE DOORS but the ghouls are pulling her away.\n\nTHE CREATURE WITH THE TEST TUBE IN ITS MOUTH pulls the bothersome \nthing out from between its teeth. It studies the vial curiously for a \nmoment, then it tosses it angrily towards SPIDER, toward THE MAGAZINE \nDOOR...\n\nKA-BLOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOM!!!\n\n162\tINT. THE MAIN CHAMBER (EFX) - NIGHT\n\nA HALLACIOUS FIREBALL RIPS THROUGH THE CAVE.\n\n163\tINT. THE CONDITIONING ROOM - NIGHT\n\nBUB stands in the open doorway staring at RHODES' still twitching \ncorpse. He slaps his SIX-GUNS back into their leather HOLSTERS, then \nhe shoots off one of those military salutes of his....just as the \nwalls fall in on him.\n\n164\tEXT. THE FISHING BOAT - NIGHT\n\nTHE REFUGEES stare toward the island as A HUGE BOOOOOM FILLS THE \nNIGHT. Some of the YOUNGER CHILDREN start to cheer as though watching \nfireworks on the Fourth of July.\n\n165\tEXT. GASPARILLA'S ISLAND (THEIR P.O.V.) - NIGHT\n\nTHE TOP BLOWS OFF THE ISLAND, just as TOBY predicted is would. It's \nas though an enormous underground volcano is exploding. It's a \nfrightening...yet beautiful sight.\n\n166\tEXT. THE FISHING BOAT - NIGHT\n\nTOBY looks back over his shoulder. THE NURSE is kneeling beside the \nbody of TRICKS. He's dead. The woman pulls a blanket up over his \nhead. TOBY steps forward, his PISTOL drawn. He pulls the hammer back \nand aims at TRICKS' head.\n\nSARAH\nNo. Don't. Wait. Wait to see if... wait \nuntil it's necessary.\n\nTOBY turns and looks at MARY. She nods. He releases the PISTOL HAMMER \nwithout firing.\n\nDISSOLVE TO:\n\n167\tEXT. ANOTHER ISLAND (WIDE EST.) - MORNING\n\nGorgeous, a paradise. BIRDSONG fills the air.\n\n168\tEXT. A RIVER ON THE ISLAND - MORNING\n\nTHE REGUGEES are all gathered. THE CHILDREN walk, one by one, through \nthe shallows as JOHN baptises them. SARAH, MARY AND THE NURSE carry \nthe infants. When the infant in SARAH'S arms has been touched by \nJOHN'S hand, SARAH doesn't move on. Instead, she looks up into the \nbig man's warm eyes.\n\nSARAH\nMe too...please.\n\nJOHN gently cups a handful of river water and pours it on the woman's \nforehead.\n\nTHE OTHER ADULTS, led by LUKEY, file into the river, all lining up \nbefore the baptist, waiting their turns to be blessed into this tiny \nnew society.\n\n169\tEXT. A BEACH ON THE ISLAND - MORNING\n\nTRICKS' BODY lies covered in the sand. THE REFUGEES are gathered \nagain, heads bowed, while JOHN speaks.\n\nJOHN\nSatan ain't sent this man back. Not yet, \nanyway. So we all hopin' that maybe he's up \nthere with you, Lord. This might be the \nfirst decent soul we been able ta offer ya \nin quite a few years. That's a fact. We \njust gonna... pray, Lord. We gonna pray \nthat what seems ta be happenin' here...is \nreally happenin'...and I'm gonna take the \nchance and speak these words that I ain't \nbeen able ta speak for so long...\n\nMay he rest in peace\n\nTHE OTHERS\nAmen.\n\n170\tEXT. THE BEACH - NIGHT\n\nTHE CORPSE lies in the MOONLIGHT. NIGHT CRITTERS SCREECH AND BURBLE \nin the jungle behind the sand. It's an eerie scene.\n\nSARAH is sitting up, her RIFLE ready in her lap, watching the body. \nJOHN steps in behind and she startles.\n\nJOHN\nJust me. I'll take the next shift.\n\nHe settles easily down beside the woman. The two stare together at \nthe shrouded corpse.\n\nSARAH\nHow long do we have to watch him?\n\nJOHN\nForever, darlin'. Forever. 'Til he turns ta \ndust and blows away on the wind.\n\nTHE BODY lies silent, rigid under the KHAKI ARMY BLANKET that rises \nand falls, rises and falls with the Gulf breeze.\n\nSuddenly...A LOUD MUSIC CHORD! A SUDDEN MOVEMENT!\n\nIt's the movement of RED LETTERS that spin up off the head of the \ncorpse and settle before our eyes.\n\nThe letters read: \"THE END (I PROMISE)\"\n                          \n\n\n\n\n\n\n\nDay of the Dead\nWriters :   George A. Romero\nGenres :   Horror  Drama  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:37.955552"}