{"title": "Days of Heaven", "film_link": "/Movie Scripts/Days of Heaven Script.html", "script_link": "/scripts/Days-of-Heaven.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Days of Heaven Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Days of Heaven Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Terrance Malick\" title=\"Scripts by Terrance Malick\">Terrance Malick</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> : June 1976<br/>\n<br/>\n<a href=\"/scripts/Days-of-Heaven.html\">Read \"Days of Heaven\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<link href=\"style.css\" rel=\"stylesheet\" title=\"style1\" type=\"text/css\"/>\n<b>\t\n</b><meta content=\"text/html; charset=utf-8\" http-equiv=\"Content-Type\"/>\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script> \n<title>\u0093DAYS OF HEAVEN\u0094 by Terry Malick REVISED: 6/2/76</title>\n\n\n<p></p><p id=\"act\">DAYS OF HEAVEN\"\n</p><p></p><p id=\"act\">by Terry Malick\n</p><p></p><p id=\"act\">REVISED: 6/2/76\n</p><p></p><p id=\"act\">SETTING\nThe story is set in Texas just before the First World War.\n</p><p></p><p id=\"act\">CAST OF CHARACTERS\nBILL:  A young man from Chicago following the harvest.\nABBY:  The beautiful young woman he loves.\nCHUCK:  The owner of a vast wheat ranch (\"bonanza\") in the Texas Panhandle.\nURSULA:  Abby's younger sister, a reckless child of14.\nBENSON:  The bonanza foreman, an enemy of the newcomers.\nMISS CARTER:  Chief domestic at the Belvedere, Chuck's home.\nMcLEAN:  Chuck's accountant.\nGEORGE:  A young pilot who interests Ursula. \nA PREACHER, A DOCTOR, AN ORGANIST, VARIOUS HARVEST HANDS, LAWMEN, VAUDEVILLIANS, etc.\n</p><p></p><p id=\"act\">\"Troops of nomads swept over the country at harvest time like a visitation of locusts, reckless young fellows, handsome, profane, licentious, given to drink, powerful but inconstant workmen, quarrelsome and difficult to manage at all times. They came in the season when work was plenty and wages high. They dressed well, in their own peculiar fashion, and made much of their freedom to come and go.\"\n</p><p></p><p id=\"act\">\"They told of the city, and sinister and poisonous jungles all cities seemed in their stories. They were scarred with battles. They came from the far-away and unknown, and passed on to the north, mysterious as the flight of locusts, leaving the people of Sun Prairie quite as ignorant of their real names and characters as upon the first day of their coming.\"\t\t\t\t\t\tHamlin Garland, Boy Life on the Prairie (1899) \n</p><p></p><p id=\"act\">DAYS OF HEAVEN\n</p><p></p><p id=\"slug\">1\tINT. CHICAGO MILL - SERIES OF ANGLES\n</p><p></p><p id=\"act\">WORKERS in a dark Chicago mill pound molten iron out in flaming sheets. The year is 1916.\n</p><p></p><p id=\"slug\">2\tEXT. MILL\n</p><p></p><p id=\"act\">BILL, a handsome young man from the slums, and his brother\nSTEVE sit outside on their lunch break talking with an\nolder man named BLACKIE. By the look of his flashy clothes\nBlackie is not a worker.\n</p><p></p><p id=\"speaker\">BLACKIE\n</p><p id=\"dia\">Listen, if I ever seen a tit, this here's a tit. You understand? Candy. My kid sister could do this one. Pure fucking candy'd melt in your hand. Don't take brains. Just a set of rocks. I told you this already.\n</p><p></p><p id=\"speaker\">STEVE\n</p><p id=\"dia\">Blackie, you told me it was going to snow in the winter, I'd go out and bet against it. You know?\n</p><p id=\"spkdir\">(to Bill)\n</p><p id=\"dia\">There is nothing, nothing in the world, dumber than a dumb guinea.\n</p><p></p><p id=\"speaker\">BLACKIE\n</p><p id=\"dia\">Okay, all right, fine. Why should I be doing favors for a guy that isn't doing me any favors? I must be losing my grip.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I got to give it to you, though. Couple of guys look like you just rolled in on a wagonload of chickens. You ever get laid?\n</p><p></p><p id=\"speaker\">STEVE\n</p><p id=\"dia\">Sure.\n</p><p></p><p id=\"speaker\">BLACKIE\n</p><p id=\"dia\">Without a lot of talk, I mean? 'Cause I'm beginning to understand these guys, go down the hotel, pick something up for a couple of bucks. It's clean, and you know what you're in for.\n</p><p></p><p id=\"slug\">3\tEXT. ALLEY\n</p><p></p><p id=\"act\">Sam the Collector's GANG swaggers around in the alley behind a textile plant. ONE of them has filed his teeth down to points and stuck diamonds in between them. ANOTHER wears big suspenders.\nSam and Bill appear to know one another.\n</p><p></p><p id=\"speaker\">SAM\n</p><p id=\"dia\">Hey, Billy, you made a mistake. You made somebody mad. Nothing personal, okay? It's just gotta be done. You made a mistake. Happens in the best of families.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I paid you everything I have. Search me. The rest he gets next week.\n</p><p></p><p id=\"speaker\">SAM\n</p><p id=\"dia\">Listen, what happens if I don't do this? I gotta leave town?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I could do something, you know. You guys wanta do something to me, I know who to tell about it. You guys ought to think about that. \n</p><p></p><p id=\"speaker\">SAM\n</p><p id=\"dia\">You maybe already did something. Maybe that's why you're here, on account of you already done something.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I haven't done anything.\n</p><p></p><p id=\"speaker\">SAM\n</p><p id=\"dia\">Then you're all right, Billy.\n</p><p></p><p id=\"speaker\">RAZOR TEETH\n</p><p id=\"dia\">You got nothing to worry about.\n</p><p></p><p id=\"speaker\">SAM\n</p><p id=\"dia\">Cut it out, Billy, all right? You know what can happen to a guy that doesn't wanta do what people tell him? You know. So don't give us a lot of trouble. You're liable to get everybody all pissed off.\n</p><p></p><p id=\"act\">Sam, a busy man, checks his watch.\n</p><p></p><p id=\"slug\">4\tNEW ANGLE\n</p><p></p><p id=\"act\">Bill puts his hand on the ground. Sam drops a keg of roofing nails on it and, his work done, leaves with his gang. Bill sobs with pain.\n</p><p></p><p id=\"slug\">5\tEXT. LOT BEYOND MILL\n</p><p></p><p id=\"act\">Bill and Steve drag a safe by a rope through a vacant lot beyond the mill. Blackie walks behind.\n</p><p></p><p id=\"speaker\">BLACKIE\n</p><p id=\"dia\">You know what I'm doing with my end? Buy a boat. Get that? I had a boat. I had a nice apartment, I had a boat. Margie don't like that. We got to have a house. \"I can't afford no house,\" I said. She says, \"Sell the boat.\" I didn't want to sell my boat. I didn't want to buy the house. I sell the boat, I buy the house. Nine years we had the house, eight of them she's after me, we should get another boat. I give up.\n</p><p></p><p id=\"speaker\">STEVE\n</p><p id=\"dia\">Same as always, I do all the work, you gripe about it.\nSuddenly FOUR POLICEMEN surprise them from ambush. Bill lets go of the rope and starts to run. Steve does not give up immediately, however, and they shoot him down. Bill picks up Steve's gun and fires back. Three of the Policemen go chasing after Blackie, whom they soon bring to heel. The FOURTH stays behind taking potshots at Bill while he attends to Steve.\n</p><p></p><p id=\"slug\">6\tTIGHT ON STEVE\n</p><p></p><p id=\"act\">Steve, badly wounded, is about to die.\n</p><p></p><p id=\"speaker\">STEVE\n</p><p id=\"dia\">Run. Get out of here.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(weeping)\n</p><p id=\"dia\">I love you so much. Why didn't  you run. Don't die.\nSteve dies. Bullets kick up dust around him. He takes off running. One of the bullets has caught him in the shoulder.\n</p><p></p><p id=\"slug\">7\tINT. SEWER\n</p><p></p><p id=\"act\">ABBY, a beautiful woman in her late twenties, attends to Bill's wounds in a big vaulted sewer. Her sister URSULA, a reckless girl of14, stands watch.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(weeping)\n</p><p id=\"dia\">They shot the shit out of him. My brother. I couldn't believe what I was seeing.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Hold still, or I can't do anything.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I love you, Abby. You're so good to me. Remember how much fun we had, on the roof...\n</p><p></p><p id=\"slug\">8\tEXT. ROOF - MATTE SHOT\n</p><p></p><p id=\"act\">Bill and Abby flirt on the root of a tenement, happily in love. The city stretches out behind them.\n</p><p></p><p id=\"slug\">9\tINT. BED - QUICK CUT\n</p><p></p><p id=\"act\">Abby lies shivering with fever.  Bill spoons hot soup into her mouth. Ursula rolls paper flowers for extra change.\n</p><p></p><p id=\"speaker\">BILL (o.s.)\n</p><p id=\"spkdir\">(continuing)\n</p><p id=\"dia\">... even when you were sick and I was in the mill.\n</p><p></p><p id=\"slug\">10\tINT. MILL - QUICK CUT (VARIOUS ANGLES OF OTHER WORKERS)\n</p><p></p><p id=\"act\">Bill works in the glow of a blast furnace. He does not seem quite in place with the rest of the workers. A pencil moustache lends a desired gentlemanliness to his appearance. He looks fallen on hard times, without ever having known any better--like Chaplin, an immigrant lost in the heartless city, with dim hopes for a better way of life.\n</p><p></p><p id=\"speaker\">BILL (o.s.)\n</p><p id=\"dia\">I won't let you go back in the mill. People die in there. I'm a man, and I can look out for you.\n</p><p></p><p id=\"slug\">11\tEXT. SIDING OUTSIDE MILL\n</p><p></p><p id=\"act\">Along a railroad spur outside the mill, Abby and Ursula glean bits of coal that have fallen from the tenders.\n</p><p></p><p id=\"speaker\">BILL (o.s.)\n</p><p id=\"dia\">We're going west. Things gotta be better out there.\n</p><p></p><p id=\"slug\">12\tEXT. TENEMENT\n</p><p></p><p id=\"act\">A POLICEMAN, looking for Bill, roughs Abby up behind the tenement where they live. Suddenly Bill runs out from a doorway and slams him over the head with a clay pitcher full of water.\n</p><p></p><p id=\"speaker\">POLICEMAN\n</p><p id=\"dia\">What'd you do?\n</p><p></p><p id=\"act\">Bill shrugs, then hits him again, knocking him unconscious, when he reaches for a gun. Abby calls Ursula and they take off running, Bill stopping only to collect some of their laundry off a clothesline.\n</p><p></p><p id=\"slug\">13\tEXT. FREIGHT YARDS\n</p><p></p><p id=\"act\">They hop a freight train.\n</p><p></p><p id=\"slug\">14\tCREDITS (OVER EXISTING PHOTOS)\n</p><p></p><p id=\"act\">The CREDITS run over black and white photos of the Chicago they are leaving behind. Pigs roam the gutters. Street urchins smoke cigar butts under a stairway. A blind man hawks stale bread. Dirty children play around a dripping hydrant. Laundry hangs out to dry on tenement fire escapes. Police look for a thief under a bridge. Irish gangs stare at the camera, curious how they will look. The CREDITS end.\n</p><p></p><p id=\"slug\">15\tEXT. MOVING TRAIN\n</p><p></p><p id=\"act\">Abby and Bill sit atop a train racing through the wheat country of the Texas Panhandle.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I like the sunshine.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Everybody does.\nThey laugh. She is dressed in men's clothes, her hair tucked up under a cap. They are sharing a bottle of wine.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I never wanted to fall in love with you.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Nobody asked you to.\n</p><p></p><p id=\"act\">He draws her toward him. She pulls away.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's the matter? A while ago you said I was irresistible. I still am.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">That was then.\n</p><p></p><p id=\"act\">She pushes her nose up against his chest and sniffs around.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You playing mousie again?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I love how nice and hard your shoulders are. And your hair is light. You're not a soft, greasy guy that puts bay rum on every night.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I love it when you've been drinking.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're not greasy, Bill. You have any idea what that means?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Kind of.\n</p><p></p><p id=\"act\">They share the boxcar with a crowd of other HARVEST HANDS. Ursula is among them, also dressed like a man. Bill gestures out at the landscape.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Look at all that space. Oweee! We should've done this a long time ago. It's just us and the road now, Abby.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">We're all still together, though. That's all I care about.\n</p><p></p><p id=\"slug\">16\tEXT. JERKWATER\n</p><p></p><p id=\"act\">The train slows down to take on water. The hands jump off. Each carries his \"bindle\"-- a blanket and a few personal effects wrapped in canvas. TOUGHS with ax handles are on hand to greet them.\nThe harvesters speak a Babel of tongues, from German to Uzbek to Swedish. Only English is rare. Some retain odd bits of their national costumes, they are pathetic figures, lonely and dignified and so far from home. Others, in split shoes and sockless feet, are tramps. Most are honest workers, though, here to escape the summer heat in the factories of the East. They dress inappropriately for farm work, in the latest fashions.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Elbow room! Oweee! Give me a chance and I'm going to dance!\n</p><p></p><p id=\"act\">Bill struts around with a Napoleonic air, in a white Panama hat and gaiters, taking in the vista. Under his arm he carries a sword cane with a pearl handle. It pleases him, in this small way, to set himself apart from the rest of toiling humanity. He wants it known that he was born to greater things.\n</p><p></p><p id=\"slug\">17\tNEW ANGLE\n</p><p></p><p id=\"act\">Bill comes upon a BIG MAN whose face is covered with blood.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Good, very good. Where you from,  mister?\n</p><p></p><p id=\"speaker\">BIG MAN\n</p><p id=\"dia\">Cleveland.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Like to see the other guy.\n</p><p></p><p id=\"act\">Bill helps him to his feet and dusts him off. A TOUGH walks up.\n</p><p></p><p id=\"speaker\">TOUGH\n</p><p id=\"dia\">You doing this shit?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Then keep it moving.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Oh yeah? Who're you?\nThe Tough hits Bill across the head with his ax handle.\n</p><p></p><p id=\"speaker\">TOUGH\n</p><p id=\"dia\">Name is Morrison.\nBill looks around to see whether Abby has seen this. She hasn't. He walks dizzily off down the tracks.\n</p><p></p><p id=\"slug\">18\tNEW ANGLE\n</p><p></p><p id=\"act\">He takes Abby by the arm.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What happened to your ear?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Nothing.\nShe is a sultry beauty--emancipated, full of bright hopes and a zest for life. Her costume does not fool the men. Wherever she goes they ogle her insolently.\n<b>EXT. WAGONS\n</b>The FOREMEN of the surrounding farms wait by their wagons to carry the workers off. A flag pole is planted by each wagon. Those who do not speak English negotiate their wages on a blackboard.\nBENSON, a leathery man of fifty, bellows through a megaphone. In the background a NEWCOMER to the harvest talks with a VETERAN.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Shockers! Four more and I'm leaving.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How much you paying?\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Man can make three dollars a day, he wants to work.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Who're you kidding?\nBill mills around. They have no choice but to accept his offer.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Sackers!\nAbby steps up. Benson takes her for a young man.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">You ever sacked before?\n</p><p></p><p id=\"act\">She nods.\n</p><p></p><p id=\"act\">Transcriber's Note: the following seven lines of dialogue between the NEWCOMER and the VETERAN runs concurrent with the previous six lines of dialogue between Benson and Bill and Abby. In the original script they are typed in two columns running side-by-side down the page.\n</p><p></p><p id=\"act\">*****\n</p><p></p><p id=\"speaker\">NEWCOMER (o.s.)\n</p><p id=\"dia\">How's the pussy up there?\n</p><p></p><p id=\"speaker\">VETERAN\n</p><p id=\"dia\">Not good. Where you from?\n</p><p></p><p id=\"speaker\">NEWCOMER (o.s.) \n</p><p id=\"dia\">Detroit.\n</p><p></p><p id=\"speaker\">VETERAN\n</p><p id=\"dia\">How's the pussy up there?\n</p><p></p><p id=\"speaker\">NEWCOMER (o.s.) \n</p><p id=\"dia\">Good.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">The guys tough out here?\n</p><p></p><p id=\"speaker\">VETERAN (o.s.)\n</p><p id=\"dia\">Not so tough. How about up there?\n</p><p></p><p id=\"speaker\">NEWCOMER (o.s.)\n</p><p id=\"dia\">Tough.\n<b>*****\n</b></p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">When's that?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Last year.\nHe waves her on. Abby nods at Ursula.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're making a mistake, you pass this kid up.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Get on.\nHe snaps his fingers at her. Bill climbs up ahead of the women. Anger makes him extremely polite.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You don't need to say it like that.\nBenson ignores this remark but dislikes Bill from the first.\n</p><p></p><p id=\"slug\">20\tEXT. PLAINS\n</p><p></p><p id=\"act\">Benson's wagons roll across the plains toward the Razumihin, a \"bonanza\" or wheat ranch of spectacular dimensions, its name spelled out in whitewashed rocks on the side of a hill.\n</p><p></p><p id=\"slug\">21\tEXT. BONANZA GATES (NEAR SIGN)\n</p><p></p><p id=\"act\">The wagons pass under a large arch, set in the middle of nowhere, like the gates to a vanished kingdom. Goats peer down from on top.\nBill looks at Abby and raises his eyebrows.\n</p><p></p><p id=\"slug\">22\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">At the center of the bonanza, amid a tawny sea of grain, stands a gay Victorian house, three stories tall. Where most farm houses stand more sensibly on low ground, protected from the elements, \"The Belvedere\" occupies the highest ridge around, commanding the view and esteem of all.\nFiligrees of gingerbread adorn the eaves. Cottonwood saplings, six feet high, have recently been planted in the front. Peacocks fuss about the yard. There is a lawn swing and a flagpole, used like a ship's mast for signaling distant parts of the bonanza. A wind generator supplies electric power.\nA white picket fence surrounds the house, though its purpose is unclear; where the prairie leaves off and the yard begins is impossible to tell.\nBison drift over the hills like boats on the ocean. Bill shouts at the nearest one.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Yo, Beevo!\n</p><p></p><p id=\"slug\">23\tTIGHT ON CHUCK\n</p><p></p><p id=\"act\">CHUCK ARTUNOV, the owner--a man of great reserve and dignity, still a bachelor--stands on the front porch of the Belvedere high above, observing the new arrivals.\n</p><p></p><p id=\"slug\">24\tEXT. DORMITORY\n</p><p></p><p id=\"act\">Benson drops the hands off at the dormitory, a hundred yards below, a plain clapboard building with a ceiling of exposed joists. Ursula sees Chuck watching them.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Whose place is that?\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">The owner's. Don't none of you go up around his place. First one that does is fired. I'm warning you right now.\n</p><p></p><p id=\"act\">In the warm July weather most of the hands forsake the dorm to spread their bedrolls around a strawpile or in the hayloft of the nearby barn.\n</p><p></p><p id=\"act\">Abby and Bill slip off to share a cigarette. Ursula tags behind.\n</p><p></p><p id=\"slug\">25\tEXT. ROCK\n</p><p></p><p id=\"act\">Bill lifts a big rock. Abby applauds. Ursula kneels down behind\nhim. Abby pushes him over backwards.\n</p><p></p><p id=\"slug\">26\tEXT. BARN\n</p><p></p><p id=\"act\">Ursula gasps as Abby tumbles off the roof of the barn and falls through the air screaming:\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Urs!\nShe lands in a straw pile.\n</p><p></p><p id=\"slug\">27\tTIGHT ON ABBY AND BILL\n</p><p></p><p id=\"act\">Bill takes Abby by the hands, spins her around until she is thoroughly dizzy, then grasps her across the chest.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Ready?\nShe giggles her consent. He crushes her in a bear hug until she is just on the verge of passing out, then lets her go. She sinks to the grass, in a daze of sweet intoxication.\n</p><p></p><p id=\"slug\">28\tEXT. LANTERN - NIGHT\n</p><p></p><p id=\"act\">Bill looks deeply into Abby's eyes by the light of a lantern that night. They have made a shallow cut on their thumbs and press them together mixing their blood like children.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You're all I've got, Abby. No, really, everything I ever had is a complete piece of garbage except you.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I know.\nThey laugh. He bends to kiss her. She pulls away.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Sometimes I think you don't like men.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">As individuals? Very seldom.\nShe kisses him lovingly.\n</p><p></p><p id=\"slug\">29\tEXT. WHEAT FIELDS - DAWN\n</p><p></p><p id=\"act\">The sun peers over the horizon. The wheat makes a sound like a waterfall. It stretches for as far as the eye can see. A PREACHER has come out, in a cassock and surplice, to offer prayers of thanksgiving.\n</p><p></p><p id=\"speaker\">PREACHER\n</p><p id=\"dia\">\"... that your days may be multiplied, and the days of your children, in the land which the Lord swore unto your fathers to give them, as the days of' heaven upon the earth.\"\nThe harvesters spit and rub their hands as they wait for the dew to burn off. They have slept in their coats. The dawn has a raw edge, even in summer.\n</p><p></p><p id=\"slug\">30\tTIGHT ON WHEAT\n</p><p></p><p id=\"act\">Chuck looks to see if the wheat is ready to harvest. He shakes the heads; they make a sound like paper. He snaps off a handful, rolls them between his palms, blows away the chaff and pinches the kernels that remain to make sure they have grown properly hard.\nTiny sounds are magnified in the early morning stillness:\ngrasshoppers snapping through the air, a cough, a distant hawk.\nHe pops the kernels into his mouth, chews them up, and rolls the wad around in his mouth. Satisfied, he spits it out and gives a nod. The Preacher begins a prayer of thanksgiving. Two ACOLYTES flank him, one with a smoking censer, the other with a crucifix.\nAll repeat the \"Amen.\" Benson makes a tugging signal with his arm. A Case tractor--forty tons of iron, steam-driven, as big and as powerful as a locomotive--blasts its whistle. This is the moment they have been waiting all year for.\n</p><p></p><p id=\"slug\">31\tOTHER FIELDS - SERIES OF ANGLES\n</p><p></p><p id=\"act\">A SIGNALMAN with two hand flags passes the message on from the crest of a nearby hill. In the far-flung fields of the bonanza other tractors answer as other crews set to work.\nAbby and Bill join in, Bill reaping the wheat with a mowing machine called a binder, Abby propping the bound sheaves together to make bunches or \"shocks.\"\nA cloud of chaff rises over the field, melting the sun down to a cold red bulb.\nAbby is well turned out, in a boater and string tie, as though she were planning any moment to leave for a picnic.\nBill, too, dresses with an eye to flashy fashion: Tight dark trousers, a silk handkerchief stuck in the back pocket with a copy of the Police Gazette, low-top calfskin boots with high heels and pointed toes, a shirt with ruffled cuffs, and a big signet ring. While at work he wears a white smock over all this to keep the chaff off. It gives him the air more of a researcher than a worker.\nThe harvesters itch madly as the chaff gets into their clothes. The shocks, full of briars, cut their hands; smut and rust make the cuts sting like fire. Nobody talks. From time to time they raise a chant.\nUrsula, plucking chickens by the cookhouse--a shack on wheels-- steals a key chain from an unwatched coat.\nBenson follows the reapers around the field in a buggy. He keeps their hours, chides loafers, checks the horses, etc. The harvesters are city people. Few of them are trained to farming. Most--Abby and Bill are no exception--have contempt for it and anybody dull enough to practice it. Tight control is therefore exercised to see that the machines are not damaged. \nWhere the others loaf whenever Benson's back is turned, Bill works like a demon, as a point of pride.\n</p><p></p><p id=\"slug\">32\tCHUCK AND BENSON\n</p><p></p><p id=\"act\">Lightning shivers through the clouds along the horizon. Chuck looks concerned. Benson consults a windsock.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Should miss us.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">They must be having trouble over there, though.\nAbby, passing by, lifts her hat to wipe her face. As she does her hair falls out of the crown. Women are rare in the harvest fields. One so beautiful is unprecedented.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I didn't know we had any women on.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"spkdir\">(surprised)\n</p><p id=\"dia\">I thought she was a boy. Should I get rid of her?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">No.\n</p><p></p><p id=\"slug\">33\tMONTAGE\n</p><p></p><p id=\"act\">A COOK stands on the horizon waving a white flag at the end of a fishing pole. Ursula bounds through the wheat blowing a horn.\nBenson consults the large clock strapped to the back of his buggy, then fires a smoke pistol in the air.\nTheir faces black with chaff, the hands fall out in silence. They shuffle across the field toward the cookhouse, keeping their feet close to the ground to avoid being spiked by the stubble.\n</p><p></p><p id=\"slug\">34\tEXT. COOKHOUSE - STUBBLE FIELD IN B.G.\n</p><p></p><p id=\"act\">The COOKS, Orientals in homburgs, serve from planks thrown across sawhorses. The hands cuff and push each other around as they wash up. The water, brought up fresh in wagons from the wells, makes them gasp. An ice wagon and a fire truck are parked nearby.\nMost sit on the ground to eat, under awnings or beach umbrellas dotted around the field like toadstools. The Belvedere is visible miles away on the horizon.\nBill is carrying Abby's lunch to her when a loutish DUTCH MAN makes a crack.\n</p><p></p><p id=\"speaker\">DUTCHMAN\n</p><p id=\"dia\">Your sister keep you warm at night?\nBill throws a plate of stew at him and they are quickly in a fight. No fists are used, just food. The others pull them apart. Bill storms away, flicking mashed potatoes off his shirt.\n</p><p></p><p id=\"slug\">35\tEXT. GRAIN WAGON - STUBBLE FIELD IN B.G.\n</p><p></p><p id=\"act\">Bill and Abby sit by themselves in the shade of a grain wagon. Demoralized, Abby soaks her hands in a pail of bran water. Bill inspects them anxiously. They are swollen and cracked from the morning's work.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I ran a stubble under my nail.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Didn't you ever learn how to take care of yourself? I told you to keep the gloves on. What can I do if you don't listen?\nBill presses her wrists against his cheek, ashamed that he can do nothing to shield her from such indignities. In the b.g. a MAN with a fungo bat hits flies to SOME MEN with baseball gloves.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You can't keep on like this.\n</p><p></p><p id=\"speaker\">ABBY \n</p><p id=\"dia\">What else can we do?\nShe nods at the others.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Anyway, if they can, I can too.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That bunch? Don't compare yourself to them.\nShe flexes her fingers. They seem lame.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You drop off this weak. I can make enough for us both. It was a crime to bring you out here. Somebody like you.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Right now, what I'm doing, I'm just dragging you down.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Maybe you should go back to Chicago. We've got enough for a ticket, and I can send you what I make.\nHe seems a little surprised when she does not reject this idea out of hand. Perhaps he fears that if she ever did go back, he might never see her again.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's the matter?\nShe begins to cry. He takes her in his arms.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I know how you feel, honey. Things won't always be this way. I promise.\n</p><p></p><p id=\"slug\">36\tABBY AND BILL - CHUCK'S POV\n</p><p></p><p id=\"act\">The men knock out their pipes as Benson's whistle summons them back to their stations.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Tick tockl Tick tock! Nothing moving but the clock!\nBill pulls Abby to her feet. He sees the Dutchman he fought with and shoots him the finger.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You better be careful.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Of him? He's just a. sack of shit.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Stop it! He's liable to see you.\n</p><p></p><p id=\"speaker\">BILL \n</p><p id=\"dia\">I want him to. He's the one better be careful.\n</p><p></p><p id=\"slug\">37\tTIGHT ON CHUCK\n</p><p></p><p id=\"act\">Chuck looks on. Something about her captivates hint, not so much her beauty--which only makes her seem beyond his reach--as the way she takes it utterly for granted.\n</p><p></p><p id=\"slug\">38\tMONTAGE (DISSOLVES)\n</p><p></p><p id=\"act\">The work goes on through the afternoon. The pace is stern and incessant, and for a reason: a storm could rise at any moment and sweep the crops flat, or a dry wind shrivel them up. A series of dissolves gives the sense of many days passing.\nIany moment and sweep the crops flat, or a dry wind shrivel them up.Animals--snakes and gophers, rabbits and foxes--dart through the field into the deep of the wheat, not realizing their sanctuary is growing ever smaller as the reapers make their rounds. The moment will come when they will every one be killed with rakes and flails.\nThe wheat changes colors in the wind, like velvet. As the sun drops toward the horizon a dew sets, making the straw hard to cut. Benson fires his pistol. A vine of smoke sinks lazily through the sky. As the workers move off, the fields grow vast and inhospitable.\nOil wells can be seen here and there amid the grain.\n</p><p></p><p id=\"slug\">39\tEXT. ABBY'S ROW\n</p><p></p><p id=\"act\">Bill helps Abby finish up a row. Thousands of shocks stretch out in the distance. Benson comes up behind her, making a spray of the stalks that she missed.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">You must've passed over a dozen bushels here. I'm docking you three dollars.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What're you talking about? That's not fair.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Then leave. You're fired.\nAbby is speechless. Bill squeezes the small rubber ball which he carries around to improve his grip and swallows his pride.\n</p><p></p><p id=\"speaker\">BILL\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Wait a minute.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">You want to stay?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Then shut up and get back to work.\nBenson leaves. Abby covers Bill's embarrassment.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I guess he meant it.\nShe turns her back to him and goes about picking up the sheaf Benson threw down.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">He did. Ask him. If you can't sing or dance, what do you do in this world? You might as well forget it.\nIsing or dance, what do you do this world? You might as wellu\nrorget it.\n</p><p></p><p id=\"slug\">40\tEXT. STOCK POND - DUSK\n</p><p></p><p id=\"act\">Their day's work done, the men swim naked in a stock pond.\nTheir faces are black, their bodies white as a baby's.\nA retriever plunges through the water fetching sticks.\n</p><p></p><p id=\"slug\">41\tEXT. ROAD - DUSK\n</p><p></p><p id=\"act\">Some bowl with their hats on in a dusty road and argue in Italian.\n</p><p></p><p id=\"slug\">42\tEXT. BELVEDERE - DOCTOR'S WAGON - DUSK\n</p><p></p><p id=\"act\">A physician's wagon stands in front of the Belvedere.\nBill hunts nervously through it for medicine to soothe Abby's \nhands. Not knowing quite what to look for, he sniffs whatever \ncatches his eye. \nSuddenly the front door opens and Chuck steps out with a DOCTOR, a stooped old man in a black frock coat. Bill, surprised, crouches behind the wheel. As they draw closer their conversation becomes faintly audible.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">How long you give it?\nDOCTOR (o.s.)\nCould be next month. Could be a year. Hard to say. Anyway, I'm sorry.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">Got to happen sometime.\nThey shake hands\n</p><p></p><p id=\"slug\">43\tNEW ANGLE - DUSKI\n</p><p></p><p id=\"act\">The Doctor snaps his whip at the horses. Bill grabs holdI\nThe Doctor snaps his whip at the horses. Bill grabs hold of the back of the wagon and lets it drag him away from the Belvedere.the Belvedere. -\n</p><p></p><p id=\"slug\">44\tEXT. BARN - DUSK\n</p><p></p><p id=\"act\">Ursula and Abby case the barn for dinner. Abby points at a pair of peacocks strutting by, nods to Ursula and puts a finger over her lips. Ursula, with a giggle, followsone while Abby stalks the other.\n</p><p></p><p id=\"slug\">45\tEXT. RAPESEED FIELD - SERIES OF ANGLES - DUSK\n</p><p></p><p id=\"act\">The peacock, a resplendent white, leads Abby through a bright yellow rapeseed field. It keeps just out of reach, as though it were enticing her on.\nas though it were enticing her on.'U\nAll at once she looks up with a start. Chuck is standing in front of her, \ndressed in his habitual black. The Belvedere rises behind him like a \ncastle in a fairy tale. She remembers Benson's warning that this is forbidden ground.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(afraid)\n</p><p id=\"dia\">I forgot where I was.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Don't worry. Where you from?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Chicago.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">We hardly ever see a woman on the harvest.\nThere is a small rip in the side of her shirt, which the camera observes with Chuck. She pulls her sweater over it.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You like the work?\n</p><p id=\"spkdir\">(she shrugs)\n</p><p id=\"dia\">Where do you go from here?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Wyoming and places. I've never been up that way. You think I'll like it?\nHe shrugs. Shy at first, she begins to open up.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">That dog belongs to you that was running around here? That little pointer?\n</p><p id=\"spkdir\">(he nods)\n</p><p id=\"dia\">What's his name\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Buster.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He seems like a good dog.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I think so.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He came over and tried to eat my bread from lunch.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Maybe I should keep him penned up.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(smiling)\n</p><p id=\"dia\">You asking me?\n</p><p></p><p id=\"slug\">46\tEXT. SPIT - DUSK\n</p><p></p><p id=\"act\">Bill finds Ursula roasting a peacock on a spit. She has arranged some of its tail feathers in her hair.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You're getting prettier every day.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Aren't you sweet!\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Depends how people are with me. Where's Abby? I found her something.\nHe holds out a jar of salve. Ursula shrugs.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">She mention anything to you about going back?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">What?\nUrsula has no idea what he is talking about.\n</p><p></p><p id=\"slug\">47\tEXT. STRAW STACK - MAGIC HOURMost of the workers are fast asleep around the strawp±lU\n</p><p></p><p id=\"act\">Most of the workers are fast asleep around the strawpile, their bodies radiating out like the spokes of a wheel.  A few stay up late to shoot dice in the back of a wagon.\n</p><p></p><p id=\"slug\">48\tEXT. SEPARATE STACK - MAGIC HOUR\n</p><p></p><p id=\"act\">Abby and Bill have laid their bedrolls out by a stack away from the others. A fire burns  nearby. Abby look at the stars. Bill shines his shoes. The straw is fragrant as thyme.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I've had it.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You're tired, that's all. I'm going to find you another blanket.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">No, it's not that. I'm not tired. I just can't.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Don't you want to be with me?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You know I do. It's just that, well, I'm not a bum, Bill.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I know. I told you though, this is only for a while. Then we're going to New York.Then we're New York. \n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">And after that?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Then we're there. Then we get fixed up.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You mean spend one night in a flophouse and start looking for work.\nThey are silent for a moment.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You should go back.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">And leave you? I couldn't do that.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Someday, when I'm dying, I'd like somebody to ask me if I\nstill see life the same way as before--and I'd like them to\nwrite down what I say. It might be interesting.I\nSuddenly they look around. The chief domestic at the Belvedere, a churlish lady named MISS CARTER, stands above them with a salver of fruit and roast fowl.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(suspicious)\n</p><p id=\"dia\">What's going on? Who sent it?\nShe nods up toward the Belvedere and sets it down.I\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What for?\nShe withdraws with a shrug. She does not appear to relish \nthis duty. Bill watches her walk back to the buggy she \ncame down in. Benson waits beside it.U\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(to Abby)\n</p><p id=\"dia\">She's the kind wouldn't tell you if your coat was on fire.U\n</p><p></p><p id=\"slug\">49\tNEW ANGLE - MAGIC HOURI\n</p><p></p><p id=\"act\">Abby, with the look of a child that has wandered into aI\nmagic world, digs in. Bill looks on, suspicious of the_\nmotives behind this generosity.\n</p><p></p><p id=\"slug\">50\tEXT. FIELD WITH OIL WELL - URSULA'S THEME - MAGIC HOUR\n</p><p></p><p id=\"act\">A bank of clouds moves across the moon. Ursula roams the fields, keen with unsatisfied intelligence. The stubble hisses as a hot wind blows up from the South, driving bits of grain into her face like sleet. From time to time she does a cartwheel.\nEquipment cools in the fields. Little jets of steam escape the \nboilers of the tractors.Ursula stops in front of a donkey well. It nods up and down in ceaseless agreement, pumping up riches from deep\nin the earth.\n</p><p></p><p id=\"slug\">51\tEXT. BEDROOM WINDOW  -  MAGIC HOUR\n</p><p></p><p id=\"act\">The camera moves through the bedroom window to find Chuck \nasleep on his pillow. The wind taps the curtain into the room.\n</p><p></p><p id=\"slug\">52\tEXT. FATHER IN CHAIR - QUICK CUT\n</p><p></p><p id=\"act\">Chuck dreams of a Biblical figure with a long plaited room.U52EXT.  Chuck dreams of a Biblical figure with a long plaited \nbeard, in a frock coat and Astrakhan hat, sitting in a_\nchair on the open prairie, guarding his land with a brace \nof guns. This man will later be identified as his FATHER. \n</p><p></p><p id=\"slug\">53\tEXT. FIELDS - DAY\n</p><p></p><p id=\"act\">The next day Benson yells through a megaphone from atop a stool.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Hold your horses!I\nThe huge tractors start up with a bang. Despite Benson's warning a team of Percherons breaks free. Threshing, the separating of the wheat from the chaff, has begun.\n</p><p></p><p id=\"slug\">54\tEXT. SEPARATOR - SERIES OF ANGLESI\n</p><p></p><p id=\"act\">Sixty foot belts connect the tractors to the separating machines, huge rattletrap devices that shell the wheat out at deafening volume. Benson tosses bundles down the hissing maw, squirts oil into the gears, tightens belts, chews out a MAN who's sliced a hand on the driveshaft, etc. \nBill works on the straw pile at the back of the machine, in a soft rain of chaff, spreading it out with a pitchfork. \nUrsula helps stoke the tractor with coal and water. When nothing is required of her she sneaks off to burrow in the straw. \nGingerbread on the eaves of the tractors gives them a Victorian appearance. Tall flags mark their position in the field.\nAbby moves quickly, without a moment's rest, sewing up the\nsacks of grain as they are measured out at the bottom of\nthe separator. A clowning WORKER comes up and smells herU\nlike a flower.\n</p><p></p><p id=\"slug\">55\tEXT. GRAIN ELEVATORSU\n</p><p></p><p id=\"act\">Fully laden wagons set off toward distant grain elevators.U\n</p><p></p><p id=\"slug\">56\tEXT. COUCH ON RIDGE\n</p><p></p><p id=\"act\">Chuck and McLEAN, his accountant, sit on a ridge away from the chaff, in the shade of a beach umbrella. \nChuck keeps track of operations through a telescope. Our last view of Abby, we realize, was from his POV. A plush Empire couch has been drawn up for his to rest in. At a table beside it, McLean computes the yield.\n</p><p></p><p id=\"speaker\">McLEAN\n</p><p id=\"dia\">This must be wrong. No, dammit, nineteen bushels an acre.\nChuck sails his hat out in the stubble with a whoop.\nMcLean leans over his adding machine, cackling like a thief. \n</p><p></p><p id=\"speaker\">McLEAN\n</p><p id=\"dia\">Say it goes at fifty-five cents a bushel, that means a profit of\nfour dollars and seventy-five cents per acre. Multiply by twenty\nthousand and you're talking over six figures.I\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Big year.\n</p><p></p><p id=\"speaker\">McLEAN\n</p><p id=\"dia\">Your biggest ever. This could make you the richest man in thePanhandle.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">You ought to get out while you're this far ahead. You'll never do\nbetter. I mean it. You have nothing to gain by staying.U nothing to gain by staying. I\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I want to expand. I want to run this land clear to the Oklahoma border. Next spring I will. \n</p><p></p><p id=\"speaker\">McLEAN\n</p><p id=\"dia\">And gamble everything?U\n</p><p id=\"spkdir\">(he nods)I\n</p><p id=\"dia\">You're crazy.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I been out here all my life. Selling this place would be like\ncutting my heart out. This is the only home I ever had. ThisI\nis where I belong.  Besides, I don't want to live in town.\nI couldn't take my dogs.I\n</p><p></p><p id=\"slug\">57\tCHUCK'S POV - TELESCOPE MATTE\n</p><p></p><p id=\"act\">Chuck takes another look at Abby through the telescope.\n<b>25\n</b></p><p></p><p id=\"slug\">58\tEXT. BUGGY\n</p><p></p><p id=\"act\">Bill drinks from the water barrel at the back of Benson'sU\nbuggy, his eyes fixed on Chuck's distan\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Big place here.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">The President's going to pay a visit next time he comes West.U\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Got a smoke?\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">No.I\nBill puts his hat back on. He keeps wet cottonwood leaves in the crown to cool himself off.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why's that guy dragging an expensive piece of furniture out here? Reason\nI ask is he's going to ruin thefinish and have to strip it.I\nBenson hesitates, uncertain whether he might be divulging\na confidence.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">He's not well.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's the matter with him?I\nBenson immediately regrets having spoken so freely. He checks his watch to suggest Bill should get back to work. This uneasiness confirms Bill's sense that Chuck is gravely ill.\n</p><p></p><p id=\"slug\">59\tEXT. SEPARATOR - DUSKI\n</p><p></p><p id=\"act\">Abby is sewing up her last sacks by the separator that evening when Chuck walks up, still in the flush of McLean's good news.\nThe others have finished and left to wash up. He sits down and helps her. Shy and upright, he does not know quite how to behave with a woman.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Probably be all done tomorrow.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">You still plan on going North?\nShe nods and draws her last stitch. Chuck musters his courage. It must be now or never.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Reason I ask is maybe you'd like to stay on. Be easier than now. There's hardly any work after harvest. The pay is just as good, though. Better in fact.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why're you offering me this?  My honest face?\nChuck takes a moment to compose his reply.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I've watched you work. Think about it.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Maybe I will.\nShe backs off toward Bill, who is waiting in the distance.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Who's that?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(hesitant)\n</p><p id=\"dia\">My brother.\nChuck nods.\n</p><p></p><p id=\"slug\">60\tNEW ANGLE - DUSK\n</p><p></p><p id=\"act\">She joins Bill. He gives her a melon, wanting to pick up her spirits.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">This is all I could find. You feeling better?\n</p><p id=\"spkdir\">(she shrugs)\n</p><p id=\"dia\">What'd he want?\nThey look at each other.\n</p><p></p><p id=\"slug\">61\tEXT. RIVER - DUSK\n</p><p></p><p id=\"act\">As Bill and Abby bathe in the river that evening, he tells her what he seems to have learned about Chuck's state of health. Down the way Ursula sits under a tree playing a guitar. Otherwise they are alone. They all wear bathing suits, Bill a shirt as well.\n</p><p></p><p id=\"speaker\">BILLU\n</p><p id=\"dia\">It must be something wrong with his lungs.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">He doesn't have any family, either.his lungs.I\n</p><p id=\"spkdir\">(pause)I\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">So what?\nBill shrugs. Does he have to draw her a picture? A shy, virginal light has descended over the world. Cranes peer at them from the tamarack.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Tell him you'll stay.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What for?\nBill is wondering what might happen if Chuck got interested enough to marry her. Isn't he soon to die, leaving a vast inheritance that will otherwise go to waste?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You know I love you, don't  you?\nABBY Yes.\nAbby guesses what is going through his mind, and it shocks her.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Oh, Bill!\nHe takes her into his arms, full of emotion.I\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What else can we really do?  I know how you feel, but we keepon this way, in five years we'll be washed up.\nHe catches a stick drifting by and throws it further down stream.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You ever think about all those ladies parading up and downU\nMichigan Avenue? Bunch of whores! You're better than anyI\nof them. You ever think how they got where they are?\nHe wants to breathe hope into her. He thinks of himself as responding\nto what she needs and secretly wants. When she does not answer he gives up with a sigh.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Let's forget it.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I know what you mean, though.\nHe takes her hand, with fresh hope of convincing her. \n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">We weren't meant to end up like this. At least you weren't.\nYou could be something. I've heard you sing. You have a lot\nof fine qualities that need to come out. Ursula, too. What.U\nkind of people is she meeting\nup with, riding the rods? The girl's never had a clean shot--\nnever will. She oughta be in school.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(nodding)\n</p><p id=\"dia\">You wouldn't say this if you really loved me.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">But I do. You know I do. This just shows how much. We're shitI\nout of luck, Abby. People need luck. What're you crying about? Oh, \ndon't tell me. I already know. All on account of your unhappy life and all\nthat stuff. Well, we gotta do something about it, honey. We can't expect\nanybody else to.\nAbby runs into the woods.U\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Always the lady! Well, you don't know how things work in this country. This is why every hunkie I ever met is going nowhere.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Why do you want to make me feel worse than I already do?\n</p><p></p><p id=\"speaker\">BILL (CONT'D)\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">You people get hold of the guy that's passing out dough, giveI\nhim my name, would you? I'd appreciate it.\n</p><p></p><p id=\"slug\">62\tTIGHT ON BILL\n</p><p></p><p id=\"act\">Bill skims rocks off the water to calm himself down. HeI\nfeels that somehow he did not get to say what he wanted to.U\n</p><p></p><p id=\"slug\">63\tEXT. WOODS BY RIVER\n</p><p></p><p id=\"act\">Abby is dressing in the cool woven shade of the woods when\nUrsula, her face caked with a mask of river mud, jumps from the bushes with a shriek, scaring the wits out of her sister.\n</p><p></p><p id=\"slug\">64\tEXT. BELVEDERE - DUSKU\n</p><p></p><p id=\"act\">On their way home they pass the Belvedere. A single light\nburns on the second floor. Abby picks cornflowers to put\nin her hair. Bill runs his hand down her back.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why're you touching me that way?\nHe shrugs. Muffled by the walls of the house, above the cries of the peafowl, they can faintly hear Chuck singing to himself.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">He's singing.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He can't be too sick if he's singing to himself.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">He might be singing to God.\nThey look at each other and smile. It does not appear that she has held what he said by the river against him. Bill stands for a moment and looks up at the Belvedere before passing on.\n</p><p></p><p id=\"slug\">65\tEXT. SEPARATOR, LAST SHEAVES, RATS\n</p><p></p><p id=\"act\">Work goes on the next day. As they near the last sheaves of unthreshed grain, hundreds of rats burst out of hiding. The harvesters go after them with shovels and stones. The dogs chase down the ones that escape.\n</p><p></p><p id=\"slug\">66\tBENSON AND CHUCK\n</p><p></p><p id=\"act\">Benson and Chuck smile at each other.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">We should be done around four.\nThey improvise a chat about past harvests. Years of  shared hardship have drawn them close. Chuck trails off in the middle of a reminiscence. Something else weighing on his mind.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(shyly)\n</p><p id=\"dia\">You put her on the slowest machine?\nBenson nods.U\n</p><p></p><p id=\"slug\">67\tNEW ANGLE\n</p><p></p><p id=\"act\">The threshing is done. A bundle is pitched into the separator backwards, snapping it abruptly to a stop. The drive belt whips along the ground like a mad snake. \n</p><p></p><p id=\"slug\">68\tEXT. PAYROLL TABLEI\n</p><p></p><p id=\"act\">All hands line up at the payroll table. McLean gives out their wages in twists of newspaper. Chuck and Benson shake their hands.\n</p><p></p><p id=\"slug\">69\tTIGHT ON BILL AND SORROWFUL MAN\n</p><p></p><p id=\"act\">A SORROWFUL MAN shows Bill a picture of a woman.\n</p><p></p><p id=\"speaker\">SORROWFUL MAN\n</p><p id=\"dia\">And I let somebody like that get away from me. Redhead. Lost her to a guy named Ed. Just let it happen. Should've gone out there outside the city\nlimits and shot him. I just about did, too.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">If you're knocking yourself out like this, I hope it's for a woman. And I hope she's good looking. You understand?\n</p><p></p><p id=\"slug\">70\tTIGHT ON ABBY AND URSULAI\n</p><p></p><p id=\"act\">Abby snatches a cigarette out of Ursula's mouth, takes a drag and throws it away. When Ursula goes to pick it up, she stamps it out.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Don't spend a cent of that.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Why don't you leave me alone?U\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I'm not going to sit around and watch you throw your life away.\nNobody's going to look at you twice if you've got nothing to\nyour name.\nUrsula dislikes meddlesome adults. She takes out a pouch  of tobacco to roll another cigarette. Abby swats it out of her hand and chases her off.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You want me to cut a switch?\n</p><p></p><p id=\"slug\">71\tSERIES OF ANGLES - FESTIVITIES - DUSKU\n</p><p></p><p id=\"act\">There are feats of strength and prowess as workers from the many fields of the bonanza join to celebrate the harvest home: boxing, wrestling, barrel jumping, rooster bouts, bear hugs, \"Crack the Whip\" and nut fights. Two tractors, joined by a heavy chain, vie to see which can outpull the other. Chuck lifts the back wheel of the separator off the ground; Benson replies by holding an anvil at arm's length; they tease each other about showing off. A GYMNAST does flips. They all seem happy as kids on holiday.\n</p><p></p><p id=\"slug\">72\tNEW ANGLE\n</p><p></p><p id=\"act\">Bill and Ursula share a cigarette. Ursula tries on his sunglasses.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">We going to stay?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">If she wants to.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You'd rather go?_\nBill, after a moment's thought, shrugs.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">She's the one has to say. You put aspirin in this?\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">No. \nShe hands back his sunglasses.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Keep them.\n</p><p></p><p id=\"slug\">73\tEXT. MUD PIT - DUSK\n</p><p></p><p id=\"act\">Two TEAMS of harvesters have a tug of war. The losers are dragged through a pit of mud. Cradling handfuls of slime, they chase the winners off into the dusk.\n</p><p></p><p id=\"slug\">74\tBILL AND ABBY - DUSKI\n</p><p></p><p id=\"act\">Bill finds Abby sitting off by herself, wanting no part of the festivities. This is the first time since their arrival in Texas we have seen her wearing a dress.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Sunny Jim, look at this. My first ice cream in six months. And the lady even asks do I want sprinkles on top, thank you. Big, deep dish of ice cream. You couldn't pay me to leave this place, Got you one, too. You should've heard the line I had to give her, though. Oowee!\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Good, huh?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Great.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Now you're trying to coax me. You never used to act like this.\nBill throws down the bowls of ice cream. In the distance, some MEN compete at throwing a sledge hammer.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">For as long as I can remember, people been giving me a hard time about one thing or another. Don't you start in, too!\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You want to turn me into a whore?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">We don't have to decide anything final now. Just if we're going to\nstay. You never have to touch him if you don't feel like it. Minute\nyou get fed up, we take off. Worst that can happen is we had it soft\nfor a while.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Something's made you mean.  \nShe walks off, uncertain what Bill really wants.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Or else we can forget it. I'm not going to spend the whole\nafternoon on this, though. That I'm not going to do.\n</p><p></p><p id=\"slug\">75\tISOLATED ON CHUCK\n</p><p></p><p id=\"act\">Chuck watches from a distance, fearful that tonight may\nbe the last he will ever see of her.U\n</p><p></p><p id=\"slug\">76\tTGHT ON ABBY, EFFIGY, MARS, ETC.I\n</p><p></p><p id=\"act\">The harvesters shape and dress the final sheaf as a woman.\nThe LAST of them to finish that day carries the effigy at\nthe end of the pole to the Belvedere. His mates follow\nbehind, jeering and throwing dirt clods at him.U\nAby watches. We sense that anything she sees mightI\nfigure in her decision.U\nMars hangs low and red in the western sky._\n</p><p></p><p id=\"slug\">77\tURSULA AND DRUNK\n</p><p></p><p id=\"act\">Ursula is looking at her figure in a pocket mirror whenU\na DRUNK appears behind her.I\n</p><p></p><p id=\"speaker\">DRUNK\n</p><p id=\"dia\">See what happens to you? Little shit. Get out there and make that\nbig money and don't spend time dicking around.\n</p><p></p><p id=\"slug\">78\tEXT. PIT OF COALS - DUSKU\n</p><p></p><p id=\"act\">A feast is laid on. ONE PERSON rolls a flaming wheel down a hill. ANOTHER sets off a string of firecrackers. GERMANS pelt each other with spareribs. Ursula  spears hogsheads out of a pit of hot coals. The YOUNGER MEN tease her. She is too much of a tomboy to interest any of thm seriously. The effigy sits off in a chair by itself.\u0095\n<b>1\n</b></p><p></p><p id=\"slug\">79\tTIGHT ON ABBY AND CHUCK - DUSKChuck awaits Abby's answer.I\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">There's a problem. I have to keep my baby sister with me. Someday_ my baby sister with me. Someday\nI'm going to save up enough, see, and send her to school.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">My brother, too. I can't leave him.I\nAbby fears she has asked too much. Chuck hesitates, but only to suggest he still has the prudence he long since has abandoned.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">There's work for them, too.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Really?\n</p><p></p><p id=\"slug\">80\tEXT. BONFIRE - DUSK.\n</p><p></p><p id=\"act\">A bonfire burns like a huge eye in the vat of the prairie night. The band strikes up a reel.\nChuck and Abby lead the dancing off, as though to celebrate their agreement. Their giant shadows dance with them. Soon the other harvesters join in.\n</p><p></p><p id=\"slug\">81\tTIGHT ON BILL - DUSKU\n</p><p></p><p id=\"act\">Bill watches Abby dance--it almost seems in farewell to their innocence. After a moment he turns off into the night.I\n</p><p></p><p id=\"slug\">82\tMONTAGE - NIGHT_\n</p><p></p><p id=\"act\">The effigy is held over the flame at the end of a pole until it catches fire. The harvesters prance around in the dark, trading it from hand to hand.\nThe MUSICIANS, drunk and happy, bow their hearts out.\n</p><p></p><p id=\"slug\">83\tTIGHT ON BILL - DAWN\n</p><p></p><p id=\"act\">While the others pursue their merriment, Bill walks the fields by himself, trembling with grief and indecision. Dawn is breaking. The eastern sky glows like a forge. Suddenly he comes upon a wolf. He catches his breath. \nThe wolf stares back at him for a moment, then turns and pads off into the stubble.\n</p><p></p><p id=\"slug\">84\tEXT. RAILROAD TRACKS - DAWNEEXT. RAILROAD TRACKS - DAWNU\n</p><p></p><p id=\"act\">Early the next morning the HARVESTERS wander by the hundreds down to the railroad tracks to catch a train for the North, where the crops are just now coming into maturity. A subtle feeling of sadness pervades the group. Bill gives his sword cane away to a MAN who seems to have admired it. The MAN offers him money, but he declines it.\n</p><p></p><p id=\"slug\">85\tEXT. TRAIN - URSULA AND JOHN - LATER\n</p><p></p><p id=\"act\">Ursula says goodbye to her favorite, a redhead named JOHN. She is hoarse, as always.\n</p><p></p><p id=\"speaker\">JOHN\n</p><p id=\"dia\">Why don't you come with us?\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">They won't let me. So when am I going to see you again?\n</p><p></p><p id=\"speaker\">JOHN\n</p><p id=\"dia\">Maybe in Cheyenne.\nShe nods okay. They both know they will never see each other again. On a sudden impulse she gives him a love note.\n</p><p></p><p id=\"speaker\">JOHN\n</p><p id=\"dia\">What's this?\nShe takes it back immediately, but he snatches it away from her and, after a brief, giggling scuffle, hops aboard the train, now picking up speed. Ursula runs along behind, cursing and throwing rocks at him.\n</p><p></p><p id=\"slug\">86\tTIGHT ON BILL AND ABBY\n</p><p></p><p id=\"act\">Bill and Abby look on.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I told her, \"none of my business Urs, I just hope you're not rolling\naround with some redhead is all.\" She looks me over. \"Why?\" she says, \n\"What've you guys got that redheads don't?\" I pity that kid.\nUrsula runs up and throws herself tearfully into Abby's arms.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's the matter? What'd he do?\nBill starts off after the train.\n</p><p></p><p id=\"slug\">87\tEXT.-\"SHEEP POWER\"\n</p><p></p><p id=\"act\">Abby tends a washing machine driven by a sheep on a treadmill. Chuck\nwatches from the front steps of the Belvedere.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I'm just about done with this.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Good.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">So what's next?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Next?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">There's nothing else you want done?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Not that I can think of. Not right now.\nMiss Carter, the housekeeper, steps out on the porch and pours a bucket of milk into a cream separator. \n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">How about the cream?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">She takes care of that.\nHe nods at Miss Carter, who conspicuously lets the screen door clap shut as she goes back inside. She misses no opportunity to express her disdain for these newcomers.\nShe and Benson are the only employees seen at the Belvedere. Several dozen others have stayed on after the harvest but they keep to their quarters down at the dorm. \n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You mean I'm done for today?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(uncomfortably)\n</p><p id=\"dia\">Something else might come up.\nIn truth, Chuck does not want to see Abby degraded by menial labor, considering her more a guest than an employee. They look at each other. Abby does not know quite what to make of him\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Well, I'm going back to the dorm.\n</p><p></p><p id=\"speaker\">CHUCKU\n</p><p id=\"dia\">Is everything okay down there? In the way of accommodations, I mean.U\nShe nods and waves goodbye.I\n</p><p></p><p id=\"slug\">88\tEXT. BARN\n</p><p></p><p id=\"act\">Down by the barn Bill teaches Chuck how to shoot dice.  Chuck feigns interest.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I like to gamble, and I like to win. I make no bones about it.\nGot to where the guys on Throop Street wouldn't even lag pennies\nwith me on account of I was such a winner. I'm starting out level\nwith you, you understand.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Have you ever been in trouble with the law?\nBill looks around. Abby would think it impolitic of him to speak so openly with Chuck.\n</p><p></p><p id=\"speaker\">BILLI\n</p><p id=\"dia\">Nothing they could make stick. \nMy problem has always been not having the education. I bullshitted\nmy way into school. They gave me a test. It was ridiculous. I got in fights. Ended up paying for a window. They threw me out. Don't blame them either. Still, I wanted to make something of myself. I mean, guys look at\nyou across a desk, you know what they're thinking. So I went in\nthe mill. Couldn't wait to get in there. Begin at seven, got to have a smile on your face. Didn't work out, though. No matter what you do, sometimes\nthings just don't go right. It gets to you after a while. It gives you that feeling,  \"Oh hell, what's the use?\"\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">My dad told me, forget what the people around you are doing. You got enough to worry about without considering what somebody else does. Otherwise you get fouled up. He used to say (tapping his temple)\n\"All you got is this.\" Only one day you wake up, find you're not the smartest guy in the world, never going to come up with the big score. I really believed when I was growing up that somehow I would. I worked like a bastard in that mill. I felt all right about it, though. I felt that somewhere along the line somebody would see I had that special gleam. \"Hey, you, come over here.\" So then I'd go.\nThey are silent for a moment.\n</p><p></p><p id=\"speaker\">CHUCKI\n</p><p id=\"dia\">You seem close to your sister._\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Yeah. We've been together since we were kids. You like her, don't you?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">She likes you, too.\nChuck looks down, feeling transparent in the pleasure he takes at this news.\n</p><p></p><p id=\"slug\">89\tTIGHT ON ABBY\n</p><p></p><p id=\"act\">The camera moves back to reveal Abby listening in from the other side of the barn. Her eyes are full of tears. How can Bill prize her so lightly?\n</p><p></p><p id=\"speaker\">BILL (o.s.)\n</p><p id=\"dia\">Don't get the wrong idea, though.\n</p><p></p><p id=\"slug\">90\tISOLATED ON BILL - LATERI\n</p><p></p><p id=\"act\">Bill sits on the ground reading his Police Gazette. Abby walks up and without a word of explanation, slaps him. He jumps up and protests but quickly tapers off. She turns on her heel and leaves.U\nBill sits down feeling misunderstood and abused. Does she think all this pleases him?\n<b>1\n</b></p><p></p><p id=\"slug\">91\tEXT. FAIRY RINGS (PRAIRIE)\n</p><p></p><p id=\"act\">Chuck, out for a stroll with Abby and Ursula, shows them a fairy ring--a colony of mushrooms growing in a circle thirty feet across.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">I heard you farmers were big and dumb. You aren't so big. Where do they learn how to?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">They're so darling! Can you eat them?\nChuck nods. Abby snaps the mushrooms off flush at the ground. The music underscores this moment. She smiles at Chuck as she eats the dark earthy flesh.\n</p><p></p><p id=\"slug\">92\tEXT. POST\n</p><p></p><p id=\"act\">They pitch rocks at a post and exchange intimacies. Abby has grown more lively.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You know sometimes I think there might have been a mixup at the\nhospital where I. was born and that I could actually be the interesting\ndaughter of some big financier. Nobody would actually know.I\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Are you in love with me, Chuck, or why are you always so nervous?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(Stumbling)\n</p><p id=\"dia\">Maybe I am. I must be.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why? On account of something I've done?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Because you're so beautiful.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What a nice thing to say. Look, I hit it. Did you see?\nShe goes right on with their game, as though she attached no great importance to his momentous declaration.\n</p><p></p><p id=\"slug\">93\tTIGHT ON CHUCK AND ABBY - LATERI\n</p><p></p><p id=\"act\">Chuck takes Abby's hand for the first time. Abby, startled, gives him a gentle smile, then lets go.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What about my shoes? Aren't they pretty?U94EXT. SWING\n</p><p></p><p id=\"slug\">94\tEXT. SWING\n</p><p></p><p id=\"act\">Bill sits in a swing and plays a clarinet. The music flows out across the fields like a night breeze from the city.  Abby, passing by, glowers at him, as though to ask if things are going along to his satisfaction.\n</p><p></p><p id=\"slug\">95\tASTRONOMICAL SIGHTS (STOCK)\n</p><p></p><p id=\"act\">Jupiter, the Crab Nebula, the canals of Mars, etc.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">It turns out that people might have built them. Does that surprise you?\n</p><p></p><p id=\"speaker\">ABBY (o.s.)U\n</p><p id=\"dia\">No.\n</p><p></p><p id=\"slug\">96\tEXT. RIDGE - DAWN\n</p><p></p><p id=\"act\">They are on a ridge opposite the Belvedere looking at the heavens through Chuck's telescope. Abby tingles with a sense of wonder. Chuck has opened a whole new world to her.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You know so much! Would you bring my sister up here and tell\nher some of this stuff?\n</p><p></p><p id=\"slug\">97\tEXT. FATHER'S GRAVE - NIGHT\n</p><p></p><p id=\"act\">Nearby the grave of Chuck's father stands in helpless witness to Abby's deception. A cottonwood tree rises against the cold blue sky, still as a statue.\n</p><p></p><p id=\"slug\">98\tTIGHT ON BOOK - FLASHBACK\n</p><p></p><p id=\"act\">A hand turns the pages of a book from Chuck's childhood. The text and VOICE reading it are in Russian, the picture of Russian wood folk and animals.\n</p><p></p><p id=\"slug\">99\tEXT. VIRGIN PRAIRIE - FLASHBACK\n</p><p></p><p id=\"act\">Chuck's father rushes around marking off his property with stakes.\n</p><p></p><p id=\"slug\">100\tEXT. UNFINISHED SOD HOUSE - FLASHBACK\n</p><p></p><p id=\"act\">Chuck, ten years old, scours up the blade of a scythe. Family effects -- a big green stove, a bird cage, a table stacked with melons and a mirror--stand waiting in front of their half-finished sod house. We see no sign of Chuck's mother.\n</p><p></p><p id=\"slug\">101\tEXT. PLOWED FIELD - FLASHBACK\n</p><p></p><p id=\"act\">A plow folds back the earth. The roots of the prairie grass twang like harp strings.\nThe plowing done, his father sows the seed. Poverty requires that for a harrow he drag a tree branch in back of his ox. Over his shoulder he carries a rifle.\nChuck blows a horn to chase the blackbirds off the seed.\nA scarecrow is rigged to his back, to make him more intimidating.\n</p><p></p><p id=\"slug\">102\tCHUCK AND FATHER - FLASHBACK\n</p><p></p><p id=\"act\">Chuck's father has caught smallpox. His face is covered\nwith sores. Chuck wants to embrace him, but the father\nwards him off with a long stick as he passes on some last\ninstructions in Russian.\n</p><p></p><p id=\"slug\">103\tEXT. RIVER - FLASHBACK\n</p><p></p><p id=\"act\">The father stands on a ledge above the river, filling his pockets with rocks to weight him down.\n</p><p></p><p id=\"speaker\">CHUCK (V.0.)\n</p><p id=\"dia\">My father caught smallpox when I was eleven. I fished him out of the river and buried him myself.\n</p><p></p><p id=\"slug\">104\tEXT. SAND BAR - FLASHBACK\n</p><p></p><p id=\"act\">Chuck drags his father's drowned body across a sand bar with a rope.\n</p><p></p><p id=\"slug\">105\tEXT. FATHER'S GRAVE - FLASHBACK\n</p><p></p><p id=\"act\">Chuck heaps the last bit of earth on his father's grave. The stove stands as a marker.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">So who raised you?\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">Nobody. Did it myself.\n</p><p></p><p id=\"slug\">106\tCHUCK AS BOY - WITH COYOTE, INDIANS - FLASHBACK\n</p><p></p><p id=\"act\">Famished, Chuck eats from the carcass of a coyote. Some INDIANS watch him from a ridge.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">From the time you were a kid? How?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Worked hard, didn't fool around. I never saw a city. Never had\ntime. All I ever did is work.\nHe digs a post hole with a shovel twice his size.\n</p><p></p><p id=\"slug\">107\tPAN OVER HILLS-DAWN\n</p><p></p><p id=\"act\">The camera pans across Chuck's vast domain.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">I gave my life to that land.\nBut what do I really have now? It'll still be here when I'm gone. It won't remember me.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I'd give it all up for you. I could make you happy, too, I think-if only you'd trust me.\nThe camera settles on Ursula, playing with a dog on a seesaw Chuck\nhas built her, then begins to move again, to a long shot of Chuck and \nAbby on the ridge by the telescope. Chuck is proposing.\n</p><p></p><p id=\"slug\">108\tEXT. DORM\n</p><p></p><p id=\"act\">Abby has told him of the proposal. Bill broods over an unlit cigarette. Is this a great blessing or a great misfortune which has befallen them?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He's asked me to marry him.\n</p><p></p><p id=\"speaker\">BILL \n</p><p id=\"dia\">I never really thought he would.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I thought you wanted me to.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Before I did. You cold?\nAbby is shivering. Bill takes off his jacket and slips it over her shoulders.\n</p><p></p><p id=\"speaker\">BILL \n</p><p id=\"dia\">What're you thinking?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">We've never done anything like this.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Who'd know but you and me?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Nobody.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That's it, Ab. That's all that matters, isn't it?  \n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You talk like it was all right. It would be a crime.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">But to give him what he wants more than anything? Two, threeI\nmonths of sunshine? He'll never get to enjoy his money anyway.\nWhat're you talking about? We'd be showing him the first good\ntimes of his life.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Maybe you're right.\nAt each hint of consent from Abby, Bill feels he must press on.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You know what they're going to stick on his tombstone? \"Born\nlike a fool, worked like a mule.\" Two lines.\nAbby cannot say the proposal is devoid of principle. The idea of easing Chuck's imminent death gives them just the shade of a good motive. This would be a trade.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What makes you think we're just talking about a couple of months?U\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Listen, the man's got one foot on a banana peel and the other\non a roller skate. What can I say? We'll be gone before theI\nPresident shows up.\nHe straightens his coat and smooths back his hair, to make her smile, without success.\nBILL Hey, I know how you feel. II\nHey, I know how you feel. I feel just as bad. Like I was sticking an icepick in my heart. Makes me sick just to think about it!\nheart. Makes me sick just to\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I held out a long time. I could've taken the first guy with a gold watch, but I held out.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I told myself that when I found somebody, I'd stick by him.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I know. We're in quicksand, though. We stand around, it's\ngoing to suck us down like everybody else.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Somewhere along the line you have to make a sacrifice. Lots of people want to sit back and take a piece without doing nothing. \nHe waits to see how she will respond. Half of him wants her to turn him down flat. Abby is bewildered. \n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Have I ever complained? Have I said anything that would make\nyou think...\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You don't have to. I hate it when I see you stooped over and\nthem looking at your ass like you were a whore. I personally\nfeel ashamed! I want to take a .45 and let somebody have it.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">We got to look on the bright side of this, Ab. Year from\ntoday we got a Chinese butler and no shit from anybody.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Some people need more'n they have, some have more'n they need. It's\njust a matter of getting us all together.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I don't even know if I believe what I'm saying, though. I\nfeel like we're on the edge of a big cliff. \nAbby looks at the ground for a moment, then nods.\n</p><p></p><p id=\"slug\">109\tTIGHT ON CHUCK\n</p><p></p><p id=\"act\">Chuck lies in bed, daydreaning.\n</p><p></p><p id=\"slug\">110\tTIGHT ON ABBY AND URSULA\n</p><p></p><p id=\"act\">Ursula decorates Abby's hair with flowers and tells her how pretty she looks.\n</p><p></p><p id=\"slug\">111\tEXT. RIVER BANK\n</p><p></p><p id=\"act\">The wedding takes place along the river. The Preacher has come back with his ACOLYTES. A chest of drawers serves as the altar. Benson is the best man--a joyless one. Ursula bounces around in a beautiful gown, looking for the first time like a young woman. The BAND practically outnumbers the guests: ELDERS from the local Mennonites, the MAYORS of a few surrounding towns decked out in sashes and medals, etc.\n</p><p></p><p id=\"slug\">112\tTIGHT ON ABBY AND BILL\n</p><p></p><p id=\"act\">Bill kisses the bride on the cheek. Each believes she is going through with this for the other's sake. They whisper back and forth.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You know what this means, don't you?\n</p><p id=\"spkdir\">(he nods)\n</p><p id=\"dia\">We won't ever let each other down, will we?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I love you more than ever. I always will. I couldn't do this unless I loved you.\n</p><p></p><p id=\"slug\">113\tSERIES OF ANGLES\n</p><p></p><p id=\"act\">The Acolytes ring an angelus bell. Chuck slips a sapphire on her finger. The Preacher, with outstretched arms, reminds them all that they are witness to a great event. \n</p><p></p><p id=\"slug\">114\tSKY - ABBY'S POV\n</p><p></p><p id=\"act\">Abby, frightened, looks off at the rolling sky, wondering how all thislooks in the sight of heaven.\n</p><p></p><p id=\"slug\">115\tINT. BEDROOM - DUSK\n</p><p></p><p id=\"act\">From her pillow, Abby watches Chuck shyly enter the bedroom\nHe comes over and sits down beside her\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You're wonderful.\nShe is silent for a moment. The wind moans in the rafter\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">No. But I wish I were.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Listen. It sounds like the ocean.\nThey smile at each other.\n</p><p></p><p id=\"slug\">116\tEXT. BELVEDERE - DUSKI\n</p><p></p><p id=\"act\">Bill watches the lights go out in the Belvedere. A lump rises to his throat. How exactly did this happen? He sets his jaw, vowing not to give way to weakness or jealousy. This is the price they have to pay for a lasting\nhappiness.\n</p><p></p><p id=\"slug\">117\tTIGHT ON ABBY, CHUCK, ETC.\n</p><p></p><p id=\"act\">The next morning the newlyweds set off on their honeymoon. \nChuck tells Bill to move his things from the dorm into the Belvedere.\nAbby, a basket of cucumbers under her arm, waves goodbye, angling her wrist so that Bill and Ursula can see the diamond bracelet Chuck has given her.\n</p><p></p><p id=\"slug\">118\tEXT. PRAIRIEI\n</p><p></p><p id=\"act\">They steer out across the prairie in a1912 Overland auto. Ursula runs after them, slaps the back fender and hops around on one foot, pretending the other was run over. Abby laughs. She knows this stunt.\nWhen they are gone Ursula turns fiercely on Bill.U\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">I hate you.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What for? Don't be any more of a pain in the neck than you gotta\nbe, okay?\nShe swings at him with her fist. He pushes her away._\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You think I like this? I'm doing it for her!\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You scum.\nBill slaps her.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Still think so?\nShe throws a rock at him and runs off. He catches her, repenting of his meanness.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I know you can't understand this, but there's nothing I want except good things for Abby and you. Go ahead and hit me back.\nShe hesitates a second, then slaps him as hard as she can. Blood glistens on his lip. He does not say a word in protest. She looks at the wound, horrified, then throws her arms tight around him.\n</p><p></p><p id=\"slug\">119\tEXT. PIERI\n</p><p></p><p id=\"act\">Abby and Chuck disembark from a paddleboat steamer at a\npier along the river. Chuck looks excited.\n</p><p></p><p id=\"slug\">120\tEXT. YELLOWSTONE POOL\n</p><p></p><p id=\"act\">Chuck and Abby have gone to Yellowstone Park for their honeymoon. Abby wades in a pool, wreathed by mists from the underworld. She carries a parasol to protect her from the sun. The trees in the vicinity are bare of leaves.\n</p><p></p><p id=\"slug\">121\tEXT. ANTLERS - FREEZE FRAME\n</p><p></p><p id=\"act\">Chuck kneels with a box camera to photograph a large pair of antlers lying on the ground.\n</p><p></p><p id=\"slug\">122\tSERIES OF STILLS (STOCK)\n</p><p></p><p id=\"act\">This photo becomes the first in a series from their Yellowstone trip: fishermen displaying sensational catches by a river, buggies vying with early autos on rutted roads, the giant Beaupre who stood eight feet tall, etc. Each of the pictures bears a caption. Together they make a little story.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">We saw grizzly bears and a boar. The bears scared me the most.\nThey eat garbage.\n</p><p id=\"spkdir\">(whispering)\n</p><p id=\"dia\">I was so lonesome. I missed you.\n</p><p></p><p id=\"slug\">123\tTIGHT ON BILL AND ABBY\n</p><p></p><p id=\"act\">Bill and Abby kiss, renewing old ties.U\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">There was a mountain partly made of glass, too, but we didn't get to see it. And a petrified tree.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">We'll go back.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Can we? Because there's a whole lot I didn't get to see.\nBill straightens up. Chuck sits down on Abby's other side.\n</p><p></p><p id=\"slug\">124\tEXT. DINNER TABLE UNDER NETI\n</p><p></p><p id=\"act\">They are having dinner on the lawn in front of the Belvedere. A fine mesh net is spread above them like a tent to keep the insects out. Ursula sits on Bill's lap. He puts a hand up the back of her shirt and they play as though she were a ventriloquist's dummy.\n</p><p></p><p id=\"slug\">125\tTIGHT ON RABBIT\n</p><p></p><p id=\"act\">Bill displays a rabbit which he trained in their absence to perform a card trick.\n</p><p></p><p id=\"speaker\">BILL (o.s.)\n</p><p id=\"dia\">I have you now, Ed. Only thing that can beat me is the ace of spades. (His name's Ed..) Her name's Abigail. Hungarian name.\n</p><p id=\"spkdir\">(mumbling)\n</p><p id=\"dia\">Andrew drew Ann. Ann drew Andrew.\nFrom the whole of a spread deck it picks the ace of spades.\n</p><p></p><p id=\"slug\">126\tNEW ANGLE\n</p><p></p><p id=\"act\">Abby and Chuck applaud. Ursula cranks up the victrola and puts on a record. Bill strokes the rabbit.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You know why I like him? He minds his business and isn't full of baloney.\nChuck turns to Abby and, for nearly the first time, smiles.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">He's funny.\nBill holds a plate up for Abby to see. Limoges china. Abby rolls her eyes and spits out a cherry pit. They eat like pigs, with no respect for bourgeois manners.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You have any talents, Chuck?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">No, but I admire people who do.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">That's not so. He can do a duck. Show them.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Stand back. Get the women and children someplace safe.\nChuck, feeling it would be wrong not to enter the spirit of the occasion, does his imitation. The likeness is astonishing. Abby wipes a bit of food off his chin with her napkin. Bill drums on the table with his spoon.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You saw how modest he was?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How'd you get along so long without a woman?\nChuck shrugs. Ursula makes a gesture as though to say by masturbating. Chuck does not see it. Billy laughs. Abby slaps her. The rabbit jumps out of the way.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Don't you ever behave that way at table!\n</p><p id=\"spkdir\">(to Chuck)\n</p><p id=\"dia\">She's adopted. I had nothing to do with her upbringing. I'd trade her off for a yellow dog.\n</p><p id=\"spkdir\">(to Ursula)\n</p><p id=\"dia\">Now eat. You want to starve to death?\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">That's what you'd like.\nAbby, overcome with impatience, throws her food to the dogs. Ursula catches a grasshopper and holds it out to Chuck.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You give me a quarter to eat this hopper?\nChuck does not reply. She pops it into her mouth anyway, enjoying his look of shock. Bill throws down his fork.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">All right, okay, nobody's hungry anymore. What's the worst thing you ever did, Chuck? Besides missing church and that kind of stuff.\nChuck thinks about this.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Once I turned a man out in the middle of winter, without a cent of pay. For  all I know he froze.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">If you went that far, he must've deserved it. What else?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">He didn't. I fired him out of resentment.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Well, you're the boss, right? That's how it works. Got to make decisions on the spot. Anyway, this guy-what's his name?--if I know his kind, which I do, he's probably doing okay for himself, got a hand in\nsomebody else's pocket for a change. Is that all?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">All I can think of right now. How about yourself?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(to Abby)\n</p><p id=\"dia\">He wants to know. I'm not going to count setting Blackie's \non fire either. He had it coming.\n</p><p></p><p id=\"speaker\">BILL (con't)\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Once I punched a guy while he was asleep.\nChuck looks surprised. Bill glances at Abby, worried that he might have said too much.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I was just kidding. Actually a guy I know did, though.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Maybe he did it to you.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Yeah. I think so.\nChuck gets up to ring for Miss Carter. Bill looks him up and down. Chuck, though older, is physically more imposing.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Can I have the rabbit?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Get serious. I can win money with him.\nShe licks his ear. He laughs.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">I want that bunny.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You still believe in Santa Claus.\nBill closes his eyes as he feels the soft fur of the rabbit. Ursula looks around to make sure Chuck is gone, then wings a roll at Bill. It bounces off his forehead. He retaliates with a pat of butter.\n</p><p></p><p id=\"slug\">127\tBENSON\n</p><p></p><p id=\"act\">Benson watches from another hill. He finds his displacement by these newcomers a humiliating injustice.\n</p><p></p><p id=\"slug\">128\tNEW ANGLE\n</p><p></p><p id=\"act\">Chuck returns to the table and draws Bill aside.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Almost forgot. Here's your pay. Bill takes the envelope Chuck holds out. Then, in a spasm of conscience, he gives it back. \n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">hat's the matter?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I got no right to.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Why?\nBill is momentarily at a loss for words.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I haven't worked hard enough to deserve it. I been goofing off.I\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Don't be silly.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Give it to charity or something.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Don't worry. I always know to look out for myself, because ifI\nI don't, who will? See what I'm driving at?\nChuck sees a sense of honor at work in Bill here, and\nthough he considers the gesture misguided and a little\ngrand, admires him for it.\n</p><p></p><p id=\"slug\">129\tEXT. BASESU\n</p><p></p><p id=\"act\">They play a game with big lace pillows for bases. The\nrules are unintelligible.\n</p><p></p><p id=\"slug\">130\tNEW ANGLE\n</p><p></p><p id=\"act\">Bill is expert at throwing knives. As the others watch, he goes into a big windup and pins a playing card to the side of the house.U\nEveryone seems happy and congenial. They have reached some kind of plateau. Chuck's ignorance of the ruse does not cause the others to treat him with less respect. They seem themselves almost to have forgotten it. \n</p><p></p><p id=\"slug\">131\tBILL AND ABBY'S POV - LATERU\n</p><p></p><p id=\"act\">Benson collects the bases, a job he doubtless feels is beneath him.\nThe Doctor's wagon, unmistakable even at such a great distance, thunders away from the Belvedere.\n</p><p></p><p id=\"slug\">132\tTIGHT ON BILL AND ABBYU\n</p><p></p><p id=\"act\">Bill and Abby, waiting for Chuck to join them for a swim,U\nlook questioningly at each other.S\n</p><p></p><p id=\"slug\">133\tEXT. RIVER\n</p><p></p><p id=\"act\">Ursula, in her bathing suit, jumps from a ledge above the river. She holds a big umbrella over her to see if it will act as a parachute.\nBill and Chuck have a water fight. Abby wades in the shallows with a parasol.\n</p><p></p><p id=\"slug\">134\tTIGHT ON ABBY AND URSULA - LATER\n</p><p></p><p id=\"act\">Abby is teaching Ursula how to kiss.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Too like a mule.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"spkdir\">(trying again)\n</p><p id=\"dia\">What about that?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">It's got to be--how should I say?-- more relaxed.\nThey laugh and kiss again.\n</p><p></p><p id=\"slug\">135\tNEW ANGLE\n</p><p></p><p id=\"act\">Farther up the slope Bill and Chuck wring out their bathing suits. Bill, thinking of the Doctor's visit, puts a hand on Chuck's shoulder. This time Chuck does not stiffen or ease it off.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You okay?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Sure. Why?\nBill shrugs, beaming with admiration for this man who does not burden others with his secrets.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I appreciate everything you've done for Abby. I really do. You've given her all the things she always deserved. I got to admit you have.\nChuck looks off, embarrassed but oddly pleased. Bill snatches up a handful of weeds and smells them.\n<b>.\n</b></p><p></p><p id=\"slug\">136\tCRANE SHOT\n</p><p></p><p id=\"act\">Returning home they portray the movements of the sun, earth and moon \nrelative to each other. Abby is the sun and keeps up a steady pace across \nthe prairie.\nChuck, the earth, circles her at a trot, giving instructions. Bill, with the \nmost strenuous role of all--the moon-- runs around Chuck while he circles Abby.\n</p><p></p><p id=\"slug\">137\tEXT. PRAIRIE - SERIES OF ANGLES\n</p><p></p><p id=\"act\">They play golf on the infinite fairway of the prairie. Bill and Abby make a team against Chuck and Ursula. Nightingales call out like mermaids from the sea.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You liking it here?\n</p><p id=\"spkdir\">(she nods)\n</p><p id=\"dia\">Feel good?\n</p><p id=\"spkdir\">(she nods)\n</p><p id=\"dia\">Feels good to feel good.\nHe smiles, satisfied that he has done well by her, and lets a new ball slip down his pant leg to replace the one he played.\n</p><p></p><p id=\"slug\">138\tNEW ANGLE\n</p><p></p><p id=\"act\">Ursula, meanwhile, grinds Abby's ball into the dirt with the heel of her boot. She winks at Chuck. Chuck smiles back.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's your mother like?\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Her? Like somebody that just got hit on the head. She used to pray for me. Rosary, the stations, everything. \"Hey, Ma,\" I tell her, \"I ain't crippled.\" They don't know, though. They say you're in trouble. They don't know.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">My dad, the same way. Thought the world owed him a living. He drowned in Lake Michigan.\n</p><p></p><p id=\"slug\">139\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">They walk home. Bill stays behind to work on his strokes. Ursula sends the dogs after the balls.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You shag them, not those dogs. They might choke or run off with them.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Who made you the boss? Shag them yourself.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Listen, some day all this is going to be mine. Or half is. Somebody like that, you want to get on his good side, not give him a lot of gas. You want to do what he says.\nHe steps off a few paces of his future kingdom and draws a deep breath.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">This reminds me of where I came from. I left when I was six. That's when I met your sister.\nHe looks at the land with a new sense of reverence. He snatches up a handful of grass and rolls it between his palms.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I can't wait to go back to Chicago, bring them down for a visit. Blackie and them. There's a lot of satisfaction in showing up people who thought you'd never amount to anything.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I'd really like to see this place run right. I got a lot of ideas I'd like to try out.\n</p><p></p><p id=\"slug\">140\tBILL'S POV AND TIGHT ON BILL\n</p><p></p><p id=\"act\">In the distance he sees Chuck put his arm on Abby's waist and whisper something in her ear. This intimacy rubs him the wrong way. He gives his clubs to Ursula and starts after them.\n</p><p></p><p id=\"slug\">141\tINT. KITCHEN\n</p><p></p><p id=\"act\">Bill finds them in the kitchen. Chuck goes into the other room to look for something. Abby lifts the cigarette out of Bill's mouth, takes a drag and does a French inhale. Bill kisses her.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Nobody's all bad, are they?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I met a few I was wrong on, then.\nSuddenly they hear Chuck's footsteps. They pull back just in time, Abby returning the cigarette to him behind her back. They chat as though nothing had happened.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I have a headache. I probably should've worn a hat.\nAbby rolls her eyes at this improvisation. No sooner does Chuck turn his back than Bill's hand darts out to touch her breast. He snatches it away a moment before Chuck turns back.\nTogether they walk into the living room.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You ever see anybody out here?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Not after harvest.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How often do you get into town?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Once or twice a year.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You're kidding. He must be kidding.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Why do I need to?\nBill catches Abby's eyes. He frowns at the idea of being cooped up with this Mormon all winter.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Relaxation. Look at the girls. Opportunity to see how other folks live.\nChuck looks at him blankly. None of these reasons seems to carry\nmuch weight for him. Bill turns to Abby.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Somebody is nuts. I don't know whether it's him or me, but somebody is definitely nuts.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why don't I fix tea?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Maybe I should help you.\nHe follows her back into the kitchen, where he starts to kiss her. She pushes him away and turns to making the tea.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're worse than an Airedale.\n</p><p id=\"spkdir\">(raising her voice)\n</p><p id=\"dia\">You want jasmine or mint?\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">Mint.\nBill lifts up the back of her dress and looks under it, testing the breadth of his license. She slaps it back down. He lifts it again, standing on his right to. She glowers at him.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Don't do that.\n</p><p id=\"spkdir\">(calling to Chuck)\n</p><p id=\"dia\">How much sugar?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why not? I'm just seeing what kind of material it's made of.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">One spoonful.\nBill walks around absentmindedly, inspecting Chuck's things, stealing whatever catches his fancy. A book, a paperweight, a bell--things he does not really want and has no use for. His conscience is clear, however; the sacrifices they are making excuse these little sins.\nAs Chuck walks in, Bill has pocketed a candlestick.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Where's the candlestick?\nChuck shrugs. Bill gives Abby a cold look and goes outside.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">He's a strange one.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(nodding)\n</p><p id=\"dia\">Once he named his shoes like they were pets. It was a joke, I guess.\n</p><p></p><p id=\"slug\">142\tEXT. WELL\n</p><p></p><p id=\"act\">Bill drops the candlestick down the well, stands for a moment, then punches the bucket with his fist. He looks up. Benson has seen him.\n</p><p></p><p id=\"slug\">143\tEXT. SAPLINGS AGAINST WINDOW - NIGHT\n</p><p></p><p id=\"act\">Outside the saplings thrash in the wind.\n</p><p></p><p id=\"slug\">144\tINT. BEDROOM - NIGHT\n</p><p></p><p id=\"act\">Abby wakes up with a gasp.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's the matter?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I had a dream.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What about?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Was something after you?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I forgot it already.\n</p><p></p><p id=\"slug\">145\tAERIAL SHOT (STOCK)\n</p><p></p><p id=\"act\">The camera falls through the clouds as though in a lost fragment of Abby's dreams.\n</p><p></p><p id=\"slug\">146\tEXT. BARN\n</p><p></p><p id=\"act\">Benson sulks by the barn. Chuck approaches him.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You come down here a lot, don't you? Always when you're mad. You never change.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">It might not be my place to say this, sir, but I don't think they're honest people.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">He gets on your nerves, doesn't he? He always has.\n</p><p id=\"spkdir\">(cutting in)\n</p><p id=\"dia\">Now don't say something you're going to regret.\n<b>.\n</b></p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Why should I regret it? I think they're a pair of scam artists,\nsir. Let me tell you what I've seen, and you judge for yourself.\nChuck, who of course has seen the same things and more, raises a hand to silence him.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Maybe you'd be happier taking over the north end till spring. I don't say this in anger. We've been together a long time, and I've always felt about you like, well, close. It just might work out better is all. Less friction.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Don't believe me, then. You shouldn't. But why not check it out, sir? Hire a detective in Chicago. It won't cost much. What's there to lose?\nChuck's brow darkens as Benson goes on. For a moment we glimpse the anger that would be unleashed if ever he woke up. Somewhere he already knows the truth but refuses to acknowledge it.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You're talking about my wife.\nAnd so Chuck, too, becomes an accomplice in the scheme.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Maybe I better pack my things.\nBenson turns and walks off. Chuck watches him go, ashamed at himself. What has this man done but a friend's duty?\n</p><p></p><p id=\"slug\">147\tINT. MASTER BEDROOM\n</p><p></p><p id=\"act\">Abby sits at the dresser in the master bedroom. Bill walks in through the door and tries Chuck's hat on for size.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What're you doing in here?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Just walked in through the door, like any other white man.\nOn the bureau he finds a pistol. He aims it out the window. All this will soon be theirs!\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Smith and Wesson. You ought to see one of these plow into a watermelon.\nShe holds a hairbrush out for him to see. He looks it over and  gives it back without comment. He finds a stain on the tabletop.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Somebody's been staining this fake inlay with a water glass. Actually I don't blame them.\nHe walks around trying out more of Chuck's appurtenances. Abby, caught up, models a shawl before an imaginary mirror. She blows a kiss at herself.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Don't say I did that.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">The bed should be over next to the window. Where the view is.\nBill is already making plans for life after Chuck's demise.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Maybe we build on a balcony.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">First the birds go.\nThe peacocks are crowing outside. They burst out laughing. Bill checks the mussed bedsheets.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">That doesn't concern you.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why not?\n</p><p id=\"spkdir\">(no reply)\n</p><p id=\"dia\">Look, I know you've got urges. It wouldn't be right if you didn't.\nAbby stands up, angry.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You think I enjoy it?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Lower your voice.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You act like it's harder on you than me! I never want to talk\nabout this again.\nBill, consoled, holds an eyelet blouse against the light.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I bet he enjoys looking at you in this.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I thought you liked it.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">He likes it, too, is what I'm saying.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Well, it's the style.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I see.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What do you want me to wear in this heat? A blanket?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That's your problem.\nAbby puts on her wedding bracelet and admires it. Bill softens at the sight of her beauty, properly adorned.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I told you someday we'd be living in style. When this whole thing is over I'm going to buy you a necklace with diamonds as big as that.\nHe holds out the tip of his little finger. They laugh, as though they suddenly felt the absurdity of all this make-believe.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You're cute. Maybe a shade too cute.\nShe touches his face sympathetically, as though to say that she knows the pain this was causing him.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">This is terrible for us both. \n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">Abby?\nThey jump as Chuck calls up from downstairs.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Down in a minute.\nShe kisses Bill.\n</p><p></p><p id=\"slug\">148\tEXT. BACK DOOR OF BELVEDERE\n</p><p></p><p id=\"act\">Bill sneaks out the back door of' the Belvedere, only to find Benson drinking at the well. They look at each other in silence for a moment. Benson's horse stands beside him, a suitcase fixed to the saddle.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">I know what you're doing.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What're you talking about?\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">That boy's like a son to me. Don't you forget it. I know what you're doing.\nBenson gets on his horse, turns and rides off. Miss Carter waves goodbye from the side of the house. She and Bill exchange a look.\n</p><p></p><p id=\"slug\">149\tEXT. FRONT PORCH\n</p><p></p><p id=\"act\">Bill finds the others around front. Abby lolls in the hammock writing in her diary and eating a peach. Ursula plays the guitar.\nLittle by little the newcomers have done the house over from the austere structure that it was. Living room furniture has been moved out onto the front lawn and there arranged as though by a child. Goats sleep on the divan. Archery targets hang from the side of the house. The porch is covered with a striped awning, bird cages and twirls of bunting. Everywhere an atmosphere of drunken ease prevails.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Nice fall day.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Wish I'd said that.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(to Abby)\n</p><p id=\"dia\">Watcha doing?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Eating a green peach. 'Spect to die any minute.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Listen, I had a great idea. Let's spend Christmas in Chicago. Break\nup the old routine. Rhino's never been to a baseball game or a horse\nrace. I know guys one month off the boat that have. Don't even\nspeak the English language, but they eat it right up.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">You're just a young guy, Rhino; you oughta be running around\nraising hell. No offense to the little woman.\nHe bows apologetically to Abby. She pinches a dead leaf off a plant.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Abby says that in the poor section people eat cats.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Did you, sis? Well, there's always something doing. I can't\nbegin to tell you. State and Madison? Mmmm. Lights everywhere.\nYou'd love it.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">It can be rough, though.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Rough? Listen, you can't walk down the street without somebody\nreaching in your pocket! You've got to keep your coat like this\nand poke them away.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Bill got shot once. The bullet's still in him.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Really?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Doctor said he took it out, but I never saw it. Hurt like a bastard.\nYou got no idea how it hurt.\nSuddenly he worries this might discourage Chuck from going.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">They won't mess with you, though. Big fella like you. I can see it\nnow.\nHe offers a taste of the talk Chuck is like to provoke on the street corners.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">\"Hey, hey, hey. Who's this here, fresh out of the African Jungle,\nmoving down the sidewalk with a whowhowho, taking ten feet at a step\nand making all the virgins run for cover? Why, it's Big Rhino, the\nKing of Beasts. He walks, he talks, he sucks up chalk.\"\nBill steps back and sees, as though for the first time, how imposing Chuck really is.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You are big, aren't you? Sunny Jim! You must've had a real moose\nfor an old lady.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Take it easy.\nBut Chuck holds none of this against him. He knows it comes from respect.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">So what do you say?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">What a sorry outfit! Bunch of old ladies. You better stay behind.\nYour mammas'd probably get upset.\nBut when the time comes, I'm out of here. Hit the road, Toad!\nUrsula passes the sandwiches around until there is just\none left, Miss Carter's. While the others are talking,\nshe scoops up a handful of dirt and pours it into the middle.\nBill, lighting a cigarette, notices Chuck's hand on Abby's.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Ever seen a match burn twice?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">No.\nBill blows out the match and touches Chuck's hand with\nthe hot ember, causing him to yank it away.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That's old.\nChuck starts to cough. Bill looks at Abby, then whips the handkerchief out of his pocket and puts it over his nose, as though to keep from getting Chuck's germs.\nMiss Carter's face goes blank as she bites into her sandwich.\nShe jumps up and rushes back into the house. Chuck frowns.\nBill glares at Ursula, then turns to Chuck and, referring to the dead prairie grass which runs through the front yard right up to the house, continues:\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You ever thought of putting in some fescue here? Some fescue grass?\nOf course, it might not take in this soil.\nChuck stands up and winds a stole, a long religious scarf, around his neck.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You ready?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I still have a little of this sore throat. Where you going, though?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">To kill a hog.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's the necktie for?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Or does it just come in handy?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Keeps the stain of guilt off.\nChuck nods goodbye and walks off, taking a stool with him. Bill sighs with admiration.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I try and try.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What a splendid person! I've never met anybody like him!\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Splendid people make you nervous.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">They do! I breathe a sigh of relief when they step outside the room.\nBill puts on his boater and opens a copy of the Police Gazette. \nThey are silent for a moment. \n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">A guy ate a brick on a bet. Must of busted it up first with a hammer. Guy in New York City. Where else?\n</p><p id=\"spkdir\">(Jumping up)\n</p><p id=\"dia\">Anybody want to bet me I can't stick this knife in that post?\nNobody takes him up on this. Abby leafs through the\nSears catalogue, her mind dancing with visions of splendor.\n</p><p></p><p id=\"slug\">150\tTIGHT ON CATALOGUE\n</p><p></p><p id=\"act\">Pictured. in the catalogue are bath oils and corsets and feathered hats. A grasshopper is perched on the page among them, its eyes blank and dumb.\n</p><p></p><p id=\"slug\">151\tTIGHT ON ROSE\n</p><p></p><p id=\"act\">Bill watches her run her finger slowly around the closed heart of a rose. Suddenly they both look at each other. They have heard the squeals, faint but unmistakable, of a hog being led to slaughter.\n</p><p></p><p id=\"slug\">152\tTIGHT ON STOOL - QUICK CUT\n</p><p></p><p id=\"act\">Chuck has tied the hog's feet to the inverted legs of  the stool.\n</p><p></p><p id=\"slug\">153\tOTHER QUICK CUTS\n</p><p></p><p id=\"act\">Ursula, off by herself, skips rope.\nA flag on the pole by the front gate snaps in the breeze. From the branch of a lone tree the hog dangles by its hocks into the mouth of a barrel.\n</p><p></p><p id=\"slug\">154\tEXT. BELVEDERE - ABBY'S POV FROM SECOND FLOOR WINDOW\n</p><p></p><p id=\"act\">Miss Carter storms down the hill with her bags. Fed up, she is leaving the bonanza. Chuck tries in vain to appease her. She keeps walking, out the front gate and into the prairie on a straight course for the railroad tracks.\nChuck will now be alone at the Belvedere with the newcomers and no other point of reference.\n</p><p></p><p id=\"slug\">155\tEXT. CLOTHES LINE\n</p><p></p><p id=\"act\">Later that afternoon, Bill catches sight of Abby's underthings rustling on the clothes line.\n</p><p></p><p id=\"slug\">156\tINT. STAIRS\n</p><p></p><p id=\"act\">That evening he watches her from behind as she climbs the stairs to join Chuck at their bedroom door. She nods goodnight, sensing the jealousy that is growing in him.\n</p><p></p><p id=\"slug\">157\tINT. MASTER BEDROOM\n</p><p></p><p id=\"act\">Chuck looks impatiently through a drawer.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I can't find anything around here. Last week it was my gloves; this\nweek my talc. What's going on?\nHe stands and watches Abby get ready for bed. She fills him with a deep adoration. He feels that in the tulip of her mouth at last he has found heaven.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You're beautiful.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You don't think my skin's too fair?\nHe comes up behind her and touches her long hair.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You're smart, too, aren't you?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I know what the Magna Carta is.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Can I help you brush it out?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Not right now.\nShe is cold to discourage false expectations in him--and because she feels that she at least owes Bill this. Chuck, however, assumes the fault must be his own. His naivete about women, and the world in general, protects\nthe conspirators--and protects him, too, for he glimpses enough of the truth not to want to know any more.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What makes you so distant with me?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Distant? I don't mean to be.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You know what I'm talking about,  though. You aren't that way\nwith your brother.\n</p><p></p><p id=\"slug\">158\tINT.ATTIC\n</p><p></p><p id=\"act\">Bill, eavesdropping in the attic above them, surveys Chuck's dusty heirlooms.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">It must be something I'm doing. I wish you'd tell me what, though.\n</p><p></p><p id=\"slug\">159\tINT. BEDROOM\n</p><p></p><p id=\"act\">These gentle endearments, so rarely heard from Bill, stir her deeply. She throws herself in his arms.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Oh, Chuck I Please forgive me. Does it mean anything that I'm\nsorry?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(pleased) \n</p><p id=\"dia\">But I don't blame you. Did I make it sound that way?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You should. You have a right to.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">It's just that sometimes I feel I don't know you well.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You don't. It's true.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I think you love me better than before, though.\nShe rubs her cheek against his hands. Daily she feels warmer toward him. How much of this is love, how much respect or devotion, even she cannot say.\n</p><p></p><p id=\"slug\">160\tTIGHT ON BILL - LATER - NIGHT\n</p><p></p><p id=\"act\">The night throbs with crickets. Bill cracks open the bedroom door. Chuck lies asleep in a shaft of moonlight next to Abby. He hesitates a moment, but a strange compulsion drives him on. He has never done anything\nso dangerous, or had so little idea why.\n</p><p></p><p id=\"slug\">161\tINT. BEDROOM - NIGHT\n</p><p></p><p id=\"act\">Abby wakes up to find him staring her in the face. He kisses her. Chuck stirs. Abby signals they should go outside.\n</p><p></p><p id=\"slug\">162\tEXT. BELVEDERE - DAY FOR NIGHT\n</p><p></p><p id=\"act\">They sneak out of the Belvedere. The night is warm.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're no good.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Mmmm. But I love you.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I can't stand it any more. This is just so cruel. We're both no\ngood. I've got to get drunk with you, Bill. You know what I mean?\nDrunk.\nBill wags a bottle. The dogs, awakened, bay from the kennel. They wait a moment to see if a light will go on in the house, then dart off toward the fields. A plaster lawn dwarf seems to watch them go.\n</p><p></p><p id=\"slug\">163\tEXT. FIELDS - DAY FOR NIGHT\n</p><p></p><p id=\"act\">They run through the fields, hand in hand, laughing and flirting. The moon makes Abby's nightgown a ghostly white.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">We can never do this again, though. Okay? It really is too dangerous.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">This one night.\nHe toes a sodden old shoe.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Hey, I found a shoe.\n</p><p></p><p id=\"slug\">164\tSHOE, COYOTES, SCARECROW - DAY FOR NIGHT\n</p><p></p><p id=\"act\">The shoe gleams in the moonlight. Coyotes yelp from the hilltops. A scarecrow spreads its arms against the sky. The waving fields of wheat have given way to vast reaches of cleanly shaven stubble, stained with purple morning glories. Odd, large stakes are planted among them.\n</p><p></p><p id=\"slug\">165\tNEW ANGLE - DAY FOR NIGHT\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You want me to spin you around?\nShe nods okay. He takes her by the hands and spins her around the way he used to--until they go reeling off, too dizzy to stand.\n</p><p></p><p id=\"slug\">166\tEXT. RIVER BANK - DAY FOR NIGHT\n</p><p></p><p id=\"act\">They lie by the river looking at the great dome of stars. Bill wants to believe things are the same between them as before. So does Abby--but she knows better.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Suppose we woke up tomorrow and it was a thousand years ago. I\nmean, with all we know? Electricity, the telephone, radio, that kind of\nstuff. They'd never figure out how we came up with it all. Maybe\nthey'd kill us.\nShe looks at him, and they laugh.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You sleepy?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">This is the first time we slept together in a while, Bill.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You like it?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Of course.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Kiss me, then.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">It's so sweet to be able to kiss you when I want to.\n</p><p></p><p id=\"slug\">167\tNEW ANGLE\n</p><p></p><p id=\"act\">Before the marriage his lovemaking was gentle and soft. Now it has a brutal air, as though he were asserting his right to her for the last time.\n</p><p></p><p id=\"slug\">168\tTIGHT ON ABBY - DAWN\n</p><p></p><p id=\"act\">Dawn is breaking. Abby jumps to her feet, alarmed. They have slept too long.\n</p><p></p><p id=\"slug\">169\tEXT. BELVEDERE - DAWN\n</p><p></p><p id=\"act\">They have run back to the Belvedere. It seems they are safe until Chuck appears on the porch, yawning and stretching. Bill drops to the ground while Abby goes ahead.\nAbby appears at one side of the house while Bill steals around the other. Luckily, they have come up from the back.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Abby! I've been looking all over for you. Where have you been?\nWhile she distracts Chuck, Bill slips back in the house. It has been a close call.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Watching the ducks.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Didn't you sleep well?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">No.\n</p><p></p><p id=\"slug\">170\tTIGHT ON ABBY (DISSOLVE TO PAGE, THEN TO URSULA)\n</p><p></p><p id=\"act\">Abby looks sympathetically at Chuck. Her face dissolves into a page of her diary and from there to Ursula, balancing an egg on her fingertip.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Chuck saw Ursula balance an egg. He begged her to repeat this trick,\nbut she wouldn't.\n</p><p></p><p id=\"slug\">171\tTIGHT ON CHUCK\n</p><p></p><p id=\"act\">Chuck tries to reduplicate Ursula's feat. Abby, amused, reaches out and touches his face.\nWe wonder if, despite herself, she might be falling in love with him.\n</p><p></p><p id=\"slug\">172\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">Bill watches the Doctor walk out the front door and down the steps to his wagon. Chuck follows, smiling.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">The Doctor came. Chuck looked pleased for a change.\n</p><p></p><p id=\"slug\">173\tEXT. PRAIRIE - BILL'S POV\n</p><p></p><p id=\"act\">The Doctor's wagon rolls off across the prairie.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Tomorrow the President passes through. Plans have changed, and he can't stop.\n</p><p></p><p id=\"slug\">174\tEXT. RAILROAD TRACKS - DUSK\n</p><p></p><p id=\"act\">They have come down to the railroad tracks to watch the President pass through.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">We should have brought a flag.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Does she have time to ride back and get it?\nAbby and Bill hold hands. Chuck by now is accustomed to such displays. They seem, however, to make Abby increasingly uncomfortable.\n</p><p></p><p id=\"slug\">175\tMOVING TRAIN - THEIR POVS\n</p><p></p><p id=\"act\">The train bursts past at twenty yards, its great light rolling like a lunatic eye. Bill's heart pounds with excitement. Chuck holds Abby by the waist. Ursula waves a handkerchief... They cannot make out anything specific in the windows, but there is the sense of people going more important places, getting on with the serious business of their lives - while out here they stagnate.\nDimly visible, on the back platform of the caboose, a MAN in a frock coat salutes them with his cane.\nThe train has quickly vanished into the declining sun. Everything is quiet again. Ursula rushes up the grade to collect some pennies she laid on the tracks.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Did you see him wave?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">He was shorter than I expected.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How do you know it was him?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I saw!  He had a hat on.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You didn't understand my question.\nThey walk back to the buggy. Ursula holds up a dead snake she found on the tracks.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You know what I'm going to do with this? Take it home and put it in\nvinegar.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That was the President, shortie. Wake up.\nBill watches Chuck help Abby into the buggy. She is laughing about something or other. His hand lingers for a moment on hers. She does not brush it aside, as once she might have, but to Bill's dismay, presses\nit against her breast. Chuck seems to have breathed a hope into her that he, Bill, was never able to.\n</p><p></p><p id=\"slug\">176\tEXT. FIELDS\n</p><p></p><p id=\"act\">Abby and Ursula race across the fields trying to fly a kite. Ursula rides a tiny Shetland pony. Just as the wind lifts the kite away, they run into Bill. He sits by himself observing a spear of grass. Abby drops off. Ursula rides off over the hill with the kite, leaving her alone with Bill.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You look deep in thought.\nShe touches his cheek. He brushes her hand away.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What's the matter?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Nothing.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">There's nothing wrong?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">No.\n</p><p></p><p id=\"speaker\">ABBY \n</p><p id=\"dia\">What're you so mad about then?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Who said I was mad?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Can't I be alone once in a while without everybody getting all\nworked up? \n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're the only person getting worked up.\nSome buffalo appear on the crest of the next hill. Abby looks at them. They do not seem quite part of this world but mythical, like minotaurs.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Chuck says they're good for the grass.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Stop giving me that look.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You can't keep your hands off him these days.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What're you talking about?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You know.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I haven't touched him.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How about the other night? I saw you, Abby. The other night\nby the tracks? If only you wouldn't lie! Really, there's\nsome things about you I'm never going to understand.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I forgot. Anyway it doesn't matter. What are you doing, always trying\nto trap me?\nBill paces around, disgusted with himself and the whole situation.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I can't stand it any more. It's just too degrading.\n</p><p id=\"spkdir\">(pause) \n</p><p id=\"dia\">You and him. Why do I have to spell it out? I thought it would be all\nover in a month or two. Guy might go another five years. We've got to\nclear out, Abby.\nThey stare at each other in silence for a moment.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why stop now?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">We've come this far.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You heard me.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why stay? Go ahead and tell me! I'm standing here.\nBill trembles with shock and anger. The buffalo cast aware glances at them.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You want us to lose everything?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I'm telling you I can't stand it.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're weak then. What about all I've been through?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">And what about him? It would be the worst thing we could do. Worse\nthan anything so far. It would break his heart.\nBill is silent for a moment.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You're getting to like him, aren't you?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">It would kill him. Leaving now would be just cruel.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Would it? So what's it matter to somebody in his shape?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">In fact you're just leaving us one way out.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What're you talking about? Murdering him? Ursula comes riding over the hill, without the kite.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You watch and see.  \n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">I had to let it go. One of them started following me, and I threw\na rock at him. I had a bunch stored in my pocket.\nThey take off running after her.\n</p><p></p><p id=\"slug\">177\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">As they approach the Belvedere, Bill sees Chuck standing on the front steps. Suddenly angry, he draws Abby to him and in plain view kisses her on the lips.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He can see you!\nBill nods; he knows. Abby runs ahead, angry and alarmed.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Don't you believe in being honest?\n</p><p></p><p id=\"slug\">178\tNEW ANGLE\n</p><p></p><p id=\"act\">Abby bounds up the steps. Chuck has bent his mind to understand all this as mere sibling love, but here is the greatest test so far.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Aren't you going to kiss me?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Why?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Today's my birthday.\nChuck gives her a kiss, glad to put aside his suspicions.\n</p><p></p><p id=\"slug\">179\tTIGHT ON POINTERS, QUAIL AND PHEASANTS\n</p><p></p><p id=\"act\">Tails level, their noses thrust high in the air, a pair of pointers prance through the high uplands grass, following a scent like sailors taking in a rope. Pheasants and quail tremble in their coveys, their eyes big with fear.\n</p><p></p><p id=\"slug\">180\tEXT. UPLANDS\n</p><p></p><p id=\"act\">Chuck has taken Bill out bird-hunting. They wear heavy canvas leggings and carry shotguns.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Did you ever tell Abby the buffalo help keep up the grass?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I think so. Why?\nBill shrugs. Chuck welcomes this opportunity to speak of his wife. He considers Bill a good friend, in fact the only person with whom he can talk about delicate matters.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I want to get her something nice for Christmas.\nBill, who means to kill Chuck the first chance he gets, forgets this intention for a moment to give him advice.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(thoughtfully)\n</p><p id=\"dia\">She likes to draw. Maybe some paints. Nothing too expensive--\nshe might want to exchange it. Maybe a coat. She likes to show\noff sometimes. She's sweet that way.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I wish I knew how to make her happy. Nothing I do really seems to.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That's how they are. They like to make you work for it. I couldn't\never figure out why.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Sometimes you can't go wrong, though. You know that one Abby showed you a picture of? Elizabeth? I took her cherry.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I know. You told me.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Actually, I didn't, but I could have. The point I'm making is you've got\nto understand how they operate. Get them thinking you can take it or\nleave it, you're usually okay.\nSuddenly the dogs stop rigid, on point. At Chuck's hiss they sink into the  grass.\nBill looks at Chuck's exposed back. Nobody would know. It could be made to seem like a hunting accident. He cocks the hammer of his shotgun. His heart pounds wildly. Chuck talks in a low voice to the dogs.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">All right, put them up, girl.\nThe dogs rise and inch toward the birds, as slowly as the minute hand of a clock. All at once the quail explode out of hiding. Bill jumps at the noise. Chuck fires twice. Two birds fall. The retriever notes where. Chuck turns around.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Why aren't you shooting? I left you those two on the left.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">They caught me off guard.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You have to keep your gun up.\nChuck walks ahead. The music builds a mood of tension. Bill takes a practice shot into the ground. Bill looks around. There is nobody in sight. He turns the sights on Chuck's back. It would be simple enough.\nThough only twenty feet away, he closes the gap, to make sure he does not miss.\nChuck whistles the scattered birds back to their covey. \"Pheo! Pheo!\" Soon, faint and far away, comes a reply-the sweet, pathetic whistle of the quail lost in a forest of grass. The mother bird utters a low \"all is well.\"\nOne by one, near and far, the note is taken up, and they begin to return.\nBill holds his breath. His finger moves inside the trigger guard. He only has to squeeze a fraction of an inch. Three more birds shoot out of the grass. Chuck fires. At first we think Bill has, but he cannot stoop this low. He does not have the heart. Disgusted, he throws his gun on the ground. Both barrels go off. Chuck snaps around, startled and concerned. Bill is\nshaking like a leaf.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's the matter? What are you so upset about?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">They surprised me again. Chuck sends a retriever after the fallen birds, then--in an unprecedented gesture-he puts his arm over Bill's shoulder to comfort him, like an older brother.\n</p><p></p><p id=\"slug\">181\tNEW ANGLE\n</p><p></p><p id=\"act\">They return home, the day's kill slung over the back of a Shetland pony.\n</p><p></p><p id=\"slug\">182\tEXT. BACK YARD\n</p><p></p><p id=\"act\">They sit on stools in the back yard plucking the birds.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You like to box?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I never have.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Just wondering. I got a pair of gloves I brought with me.\nBill feels oddly better, as though Chuck had backed down.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Abby bought me this at Yellowstone.\nChuck shows Bill his knife. Bill reads a name off the handle.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">That's what she calls you? 'Chickie?'\nHe gets up, his nostrils flaring with anger. Chuck thinks this indignance is on his behalf.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Doesn't bother me. Should it?\nBill throws down the pheasant he was plucking.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's the matter?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Don't let her fool you, too. She warms up to whoever says please and thank you.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's the matter?\nBill, still angry at himself, considers telling him.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You really want to know?\nHe would like Chuck to know the truth but does not want theresponsibility for revealing it. He must find out by accident.\nLuckily they are interrupted as Ursula runs up, pointing over her shoulder. A pair of three-wing airplanes sputters into view low overhead. One seems to be having engine trouble.\n</p><p></p><p id=\"slug\">183\tEXT. FIELD NEAR BELVEDERE\n</p><p></p><p id=\"act\">The planes set down in a nearby field. \"Toto's Flying Circus\" is emblazoned on the wings.\n</p><p></p><p id=\"slug\">184\tNEW ANGLE\n</p><p></p><p id=\"act\">Five PEOPLE clamber out, members of a seedy vaudeville troupe. They swagger around, filthy with oil from the backwash of the props, looking more like convicts than entertainers. Their LEADER is an excitable Levantine.\n<b>LEADER\n</b>How long it take to fix? Very mooch time! Now look where you\nhab stuck us. Salaupe! You forget who I aim!\nBill, Abby and Ursula approach the aircraft with the greatest caution, like the Indians at Cortez's ships.\n</p><p></p><p id=\"slug\">185\tEXT. SCREEN - NIGHT\n</p><p></p><p id=\"act\">A JUGGLER and a SNAKE CHARMER perform first separately,\nthen jointly as a slap act. A DOUBLE TALKER weaves sentences of absolute nonsense. After a moment a black and white image appears over his face and he drops out of sight.\nThe troupe is putting on a show to earn its supper. ONE of them stands behind the viewers -- Abby and Bill, Chuck and Ursula -- cranking a carbide projector by hand. A silent movie appears on the screen, full of extraordinary pratfalls, disappearances and other tricks of the early\ncinema. Chuck has never seen anything remotely like this.\n</p><p></p><p id=\"speaker\">CHUCK (o.s.)\n</p><p id=\"dia\">How'd they do that? Where'd he go? There must be a wire. Etc.\nHe steps forward to inspect the screen, actually just a sheet hung along a clothesline, to see whether the image is coming from behind. Bill and Abby sit rapt as children, nostalgic for Chicago.\n</p><p></p><p id=\"slug\">186\tEXT. DINNER TABLE - NIGHT\n</p><p></p><p id=\"act\">Ursula serves dinner. She is excited by the visitors'\ncity ways. They are bored with her, all except the\nyoungest, GEORGE, a young pilot in a white scarf.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">We never hear a thing out here. It's like being on a boat in the\nmiddle of a lake. You see things going on, but way far away, with no voices.\n<b>GEORGE\n</b>Maybe time to clear out.\nGeorge puts his hand on hers. She snatches it away.\n<b>GEORGE\n</b>What's the matter? Aren't I your\ntype or something?\nThe Doubletalker pokes his fork into a pudding. A balloon, concealed beneath the surface, explodes to general delight. Down the table Abby and Bill chat with the Leader.\n<b>LEADER\n</b>You do not understand, sir. I am saddled with asses, yaays? I, who\nonce played the Albert Hall\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You. hear that? He called me 'sir.'\nIn their gaiety he carelessly puts a hand on Abby's leg.\n</p><p></p><p id=\"slug\">187\tTIGHT ON CHUCK - NIGHT\n</p><p></p><p id=\"act\">Chuck looks on from the shadows, no longer just puzzled but angry. He has watched them behave this way a dozen times before, but tonight, with other people around, he must see it more directly.\n</p><p></p><p id=\"slug\">188\tEXT. STRAW STACK - NIGHT\n</p><p></p><p id=\"act\">George tells Ursula a joke. She dissolves in giggles before he can finish, as though amazed at his power to dispense illusion.\n</p><p></p><p id=\"slug\">189\tINT. LIVING ROOM - NIGHT\n</p><p></p><p id=\"act\">Chuck, alone in the darkened living room, calms himself down by breathing through a rubber mask into a respirator. Joyful noises reach him from outside.\n</p><p></p><p id=\"slug\">190\tCHUCK'S POV - NEXT MORNING\n</p><p></p><p id=\"act\">The next morning Chuck looks down out his bedroom window.\nThe troupe is packing to leave. Still troubled, he walks to the bed and and stands over Abby.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's going on, Abby?\nShe does not respond. He yanks the sheet off. She is wearing a nightgown. She looks up and frowns. This is the first time she has ever seen him this way.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You know what I mean. Between you and Bill.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I have no idea.....\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(interrupting)\n</p><p id=\"dia\">Something's not right, and I want to know what.\nAbby jumps out of bed and assumes the offensive. She has no other choice.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Say it out loud. What're you worried about? \n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Incest?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">It just doesn't look right. I don't know how brothers and\nsisters carry on where you come from, but...\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(interrupting)\n</p><p id=\"dia\">Did you ever have a brother. Then who are you to judge? Maybe if\nyou had, you'd understand. Anyway, times have changed while you've been stuck out in this weed patch. We're\n************************line missing****************\nShe puts on a robe and walks out. Her last argument has worked best. Chuck never imagined he was in step with the times.\n</p><p></p><p id=\"slug\">191\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">Abby slips out the front door. She looks around to make sure that Chuck is not watching her, then heads off to find Bill. The vaudevillians gorge themselves on last night's leftovers, steal flowers from the flower beds,\netc. ONE sits off by himself, playing a French horn.\n</p><p></p><p id=\"slug\">192\tEXT. DORM\n</p><p></p><p id=\"act\">She finds Bill by the dorm throwing a switchblade in the ground, a toothbrush in his mouth.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I have to talk to you.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Look what I traded off those clowns. For a bushel of corn!\nShe draws him by the arm behind a wall. She is trembling with fear.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Chuck is suspicious.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Chickie you mean? So what?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Really. This is the first time he's ever been like this. I'm scared.\nAll this flatters Chuck in a way Bill does not like.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What for? Why're you so worried what he thinks?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He could kill us. I want to live a long time, okay? I just got\nstarted and I like it.\nBill shrugs, as though to say he can handle whatever Chuck can dish out and a little more.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You might take a little responsibility here. You got us into all this.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Did I? Well, it never would've come up if you hadn't led him on.\nLed Chickie on!\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Is that the best you can do? Knowing you it probably is.\nYou've made a mess of our lives, okay. Don't pretend it was my\nfault.\nBill combs his hair to calm himself down.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why's this guy still hanging on like a goddamn snapping turtle?\nBecause of you. Boy, this was a great idea. Right up there\nwith Lincoln going down to the theater, see what's on!\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Keep your voice down.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Don't give me that. When a guy's getting screwed, he's got a right\nto holler.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You're such a fool!\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Nothing.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I heard what you said.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Then why'd you ask? Oh, how did I ever get mixed up with you?\nAbby, in terror of Chuck's finding out, cannot understand why Bill seems to care so little.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You've gone sweet on him. You have, haven't you?\nAbby hesitates. Bill throws his knife away.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I admire him. He's a good man.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Broad shoulders. I know. Very high morals. Why can't he talk\nfaster? It's like waiting for a hen to lay an egg.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You wouldn't understand, though. He's not like you. You don't\nknow how people feel. You only think of yourself.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's going on between us, Abby? Think about that. If you figure it\nout, tell me, will you? I'd appreciate it.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Lord, but you do come on! You talking like this, used to play\naround right under his nose. Somebody I met in a bar, remember?\nOr maybe you walked in, thought it was a church. Well, I've had\nit.I'm clearing out. You understand?\nThey look at each other for a moment.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Go ahead.\nThis is not what he expected to hear. But now his pride requires that he face the truth and not back down.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Okay.\nHe looks at her for a moment. He cannot be dealt with this way. He turns and walks off.\n</p><p></p><p id=\"slug\">193\tNEW ANGLE\n</p><p></p><p id=\"act\">Ursula flirts with George. He slips a hand inside her blouse. She bats it away.\n</p><p></p><p id=\"slug\">194\tEXT. BEDROOM WINDOW\n</p><p></p><p id=\"act\">Bill stands on the ground below the master bedroom. Chuck leans out the window above him. Peacocks roost on the balcony, beneath the telescope. The vaudevillians are loading up their planes. Abby watches from the porch.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I'm going away for a while. They're giving me a lift.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What for?\nHe shrugs.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I'm wearing one of your shirts. Let me take it off for you.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Never mind.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I got my own. Just wasn't any clean today.\nBill takes off the shirt, drapes it over a post and walks off, hurt and angry, but with a sad dignity.\nChuck is not entirely sorry to see him go, nor is Abby; she knows that he is getting out just in time. One more episode like last night's and the fuse would hit the powder.\n</p><p></p><p id=\"slug\">195\tNEW ANGLE\n</p><p></p><p id=\"act\">Bill gives Ursula his money.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">We get split up for any reason, you spend that on school.\n</p><p></p><p id=\"slug\">196\tEXT. PRAIRIE\n</p><p></p><p id=\"act\">The vaudevillians are ready to take off. Bill boards the plane which George is piloting, wondering if today's break with Abby is real or just in anger, a necessary gesture. With him he carries his only possessions, a bindle and his trick rabbit. Abby, Chuck and Ursula look on.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What's eating him?\nAbby shrugs and walks down to Ursula.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Why aren't we going with him?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What for? To sleep in boxcars?\n</p><p></p><p id=\"slug\">197\tAIRPLANES\n</p><p></p><p id=\"act\">The planes set their wheels in the furrows, rev their engines and wobble off into the sky. Ursula waves goodbye to George.\n</p><p></p><p id=\"slug\">198\tEXT. PLAINS UNDER SNOW - SERIES OF ANGLES\n</p><p></p><p id=\"act\">Winter has come. Snow falls across the breadth of the plains, on the river and the dark sleeping fields.\n</p><p></p><p id=\"slug\">199\tEXT. SLEIGH (OR ICE BOAT) - SNOW\n</p><p></p><p id=\"act\">Chuck and Abby skim over the snow in a gaily painted sleigh (or ice boat). She is wrapped up snug in a buffalo robe, her feet on a hot brick. Pigs forage along the fences.\n</p><p></p><p id=\"slug\">200\tINT. CAVE\n</p><p></p><p id=\"act\">They inspect a cave with a kerosene lantern. Blocks of ice, covered with burlap and sawdust, cool shelves of preserves.\nAbby drops a stone into a dark pit. Two seconds pass before it hits the bottom.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Probably that's the first noise down there for thousands of years.\nShe speaks as though she had done it a favor. He puts his hand on hers. She presses it against her chest.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You ever wish you could turn your heart off for a second and\nsee what happened?\n</p><p></p><p id=\"slug\">201\tOTHER ANGLES\n</p><p></p><p id=\"act\">Views of backlit gems, stalactites, salamanders in their cold dark pools, hidden springs and other mysteries of nature.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Maybe nothing would.\nThey round a corner and come upon an underground waterfall. It flows out of darkness back into darkness.\n</p><p></p><p id=\"slug\">202\tINT. FORGE\n</p><p></p><p id=\"act\">Bill, meanwhile, stands in a line of panting, sweating IMMIGRANTS.\nOn their shoulders they carry the huge barrel of a cannon. With a grunt they drive it into the fiery mouth of a forge.\n</p><p></p><p id=\"slug\">203\tEXT. CITY STREET\n</p><p></p><p id=\"act\">Bill stands on the corner of a big city street, stamping his feet against the cold. He tries to catch a pigeon with some bread crumbs under a box propped up by a stick, but just as he pulls the string to drop the trap it darts\nout of the way.\n</p><p></p><p id=\"slug\">204\tBILL AND YOUNG GIRL\n</p><p></p><p id=\"act\">Bill has an improvised conversation with a YOUNG GIRL who has run away from home. He asks her where she comes from, whom she belongs to, etc. She tells him of her hopes, then passes on. Bill gives her all the money in his pocket.\n</p><p></p><p id=\"slug\">205\tMONTAGE\n</p><p></p><p id=\"act\">Enthralled, Abby surveys the wonders of Babylon and\nNineveh in a book about the Near East.\nUrsula sits with a world globe, taking a geography lesson from a traveling TUTOR. No doubt this was Abby's idea.\nAbby copies from a small plaster model of a Roman bust. She wants painfully to improve herself.\n</p><p></p><p id=\"slug\">206\tEXT. FROZEN LAKE -NIGHT\n</p><p></p><p id=\"act\">Abby and Chuck skate around a bonfire on a frozen prairie lake, carrying torches to guide them through the dark.\n</p><p></p><p id=\"slug\">207\tINT. CHICAGO FLOPHOUSE\n</p><p></p><p id=\"act\">Bill sits in a cold flophouse trying to write a letter. After a moment he wads it up and throws it away.\n</p><p></p><p id=\"slug\">208\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">Abby, Ursula and Chuck are on a walk outside the Belvedere. The snow is gone. Abby's hands are stuffed in a chinchilla muff.\nAll at once they hear a distant noise like the whoops of an Indian war party. It seems mysteriously to come from every hilltop. Abby turns to Chuck with a puzzled look.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Prairie chickens. That means winter's broken.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Really? Where are they?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You hardly ever see them.\nThey stand and listen to the birds. There is a sense of the earth stirring back to life. Abby breathes in with a wild joy and hugs Chuck tightly by the waist.\n</p><p></p><p id=\"slug\">209\tEXT. TENEMENT HALLWAY\n</p><p></p><p id=\"act\">Bill is talking with a FRIEND in the hallway of a tenement.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I can't seem to get my mind on anything. I thought, when I came\noff that place, boy, they'd better get all the women out of town that day, you know? Somewhere safe. But you know what I do? I sleep, nothing but\nsleep.\nA PANHANDLER approaches them with a hard-luck story.\n</p><p></p><p id=\"speaker\">FRIEND\n</p><p id=\"dia\">Okay, here's a quarter, but give me some entertainment, okay?\nNot this old song and dance.\nWhile the Panhandler performs, Bill looks around.\nTwo POLICEMEN have appeared in the entryway talking with the LANDLADY. Bill edges out the back door and down the steps, as though they might be after him.\nHe walks briskly down the alley without looking back.\n</p><p></p><p id=\"slug\">210\tTIGHT ON CHUCK (DISSOLVE TO DIARY)\n</p><p></p><p id=\"act\">Chuck holds a handful of seed under his nose. His heart stirs at the dark, mellow smell.\nInto this dissolves an image of Abby writing in her diary.\n</p><p></p><p id=\"slug\">211\tEXT. FIELD\n</p><p></p><p id=\"act\">Chuck swings a barometer round and round, checking the weather. Two Case tractors pitch across a field like boats on a rolling sea. Long plumes of smoke wind off behind them. Each tows a fourteen-gang plow. A third\ntractor follows, putting in the seed.\nUrsula chases a flock of blackbirds off with a big rattle.\nEvery acre of ground for as far as the eye can see is under cultivation.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">They put in the wheat the other day. This will be the biggest\nyear ever. There was a scare\nwhen a locust turned up. Luckily it wasn't the bad kind.\n</p><p></p><p id=\"slug\">212\tNEW ANGLE\n</p><p></p><p id=\"act\">The plows have turned up a hibernating locust. Chuck stands by the tractor, inspecting it under a magnifying glass. The creature nestles like a fossil in the black earth.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">They sleep in the ground for seventeen years, then crawl up\naround the end of May and spend a week flying around before they die.\nChuck kicks up the dirt around the plow, looking for others. Benson, back from exile, looks concerned.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Nothing to worry about. Just shows the land is good.\n</p><p></p><p id=\"slug\">213\tSERIES OF ANGLES\n</p><p></p><p id=\"act\">Various wonders of the prairie:  a charred tree, a huge mastodon bone, a flowering bush, a pelican, the rusted hulk of an ancient machine, etc.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">How strange this new world is! You walk out in the morning\nsometimes to find a lake rippling where the day before solid land\nwas.\n</p><p></p><p id=\"slug\">214\tEXT. STONE BOAT\n</p><p></p><p id=\"act\">Chuck has laid out the outline of a 50-foot boat in whitewashed stones. He walks around the imaginary deck showing Abby where the cabins will be.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Chuck wants to build a boat and take us off to Java, which he's\nnever seen.\n</p><p></p><p id=\"slug\">215\tEXT. FIELDS\n</p><p></p><p id=\"act\">Ursula goes out to the fields with an organist named JOEY\nwhom Chuck has hired to play for the crops. He and Ursula\nseem to hit it off.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Last month he brought in a kid to play the organ. He claims it\nhelps the crops grow. Personally I doubt it.\n</p><p></p><p id=\"slug\">216\tEXT. MIDDLE OF FIELDS\n</p><p></p><p id=\"act\">They have brought an organ out into the middle of the fields. Ursula pumps up the bellows. Joey sits in front of the keyboard and shoots his cuffs.\nHis fingers strike the keys.\n</p><p></p><p id=\"slug\">217\tCLOUDS, CLOSEUPS OF PLANTS - TIME LAPSE PHOTOGRAPHY (STOCK)\n</p><p></p><p id=\"act\">Clouds build in huge toadstools. Thunder rolls across the\nplains. A rain begins to fall. The music seems to work a magic on the crops, to draw them forth. The seeds germinate in the darkness of the\nsoil. Water finds its way down. Roots, tiny hairs at\nfirst, spread and grow.\n</p><p></p><p id=\"slug\">218\tDOLLS, TIGHT ANGLES ON THEIR FACES\n</p><p></p><p id=\"act\">Rude dolls fixed at the ends of pointed sticks--agricultural fetishes that Chuck's father brought with him from the Old World--stand around the field to join in aiding the crops.\n</p><p></p><p id=\"slug\">219\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">Flags and bunting adorn the porch for Independence Day. Ursula sets off some fireworks.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Time has flown, and once again harvest is near.\n</p><p></p><p id=\"slug\">220\tEXT. GREEN FIELDS(TRIFFIDS)\n</p><p></p><p id=\"act\">The bald earth has, as though by a mystery, become a sheet of grain, its green already fading to gold. The music dies away, replaced by the whirr of summer crickets.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">It will be a year that we have been here.\nThe camera holds and holds on the fields until in their vacant depths, we begin to sense the presence of a deep malevolence, still biding its time but growing every minute.\nSeagulls--like strange emissaries from another world--glide back and forth over the fields in search of grasshoppers.\n</p><p></p><p id=\"slug\">221\tINT. LANTERN - NIGHT\n</p><p></p><p id=\"act\">Ursula takes curling irons from the chimney of a lantern where she has set them to heat, and applies them to Abby hair.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Suppose I never fall in love, Abby?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Don't be silly. Everybody does. What do you think all those songs\nare about? You need to be careful, though, and not throw it away.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Throw what away?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You know, your chances. It's too hard to explain to a little\nsquirrel like you.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">That sounded just like Bill. Don't you miss him?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Sometimes.\nFrom her tone, however, we sense that she finds it easier with him gone.\n</p><p></p><p id=\"slug\">222\tINT. MASTER BEDROOM\n</p><p></p><p id=\"act\">Abby whispers something to Chuck in bed that evening.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You ever said that to anybody else?\nShe giggles.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You're lying, aren't you? Well, go right on lying.\nThe camera moves to the window, beneath the eave. Outside, peacocks strut back and forth.\n</p><p></p><p id=\"slug\">223\tEXT. MUDDY ROAD\n</p><p></p><p id=\"act\">Bill rides an Indian motorcycle along a muddy road back to the bonanza. His rabbit is strapped to the back. He stops for a moment to look at the new fields.\n</p><p></p><p id=\"slug\">224\tEXT. BELVEDERE - BILL'S POV\n</p><p></p><p id=\"act\">Abby sings to herself as she beats out a carpet. Bill appears on the ridge behind her. Hope leaves him like a ghost. She looks happily settled into a new life with Chuck. All at once she turns around.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Bill!\nShe rushes up and embraces him, but her warmth just seems a tease to Bill. She is different. She looks different. The tutors and tailors Chuck has brought in over the winter have given her more polish. Her hair is nicely\ncoiffed. Where she used to dress in cotton shirtwaists, she wears crinolines now.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How's everybody been?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Including me? Okay. Gee, you look good.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Thanks. And Chuck?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Still the same.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Actually I didn't mean it that way.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I came back to help out with the harvest.\nHe feels humiliated at not having a stronger excuse. But he loves her. He aches with love. He hoped their last fight was just another storm in the romance. Evidently it was more.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I thought about you a lot. Wrote you a letter, but it was no good, so I tore it up.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">How'd you come?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Train.\nHe looks her up and down.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Nice dress.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I'm glad you like it.\nHe admires her garden. His familiar cockiness vanishes as little by little he sees the old feeling is not there.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">This is new, too.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">The daffodils were already here,  but I put in the rest. You\nreally do like them?\nAt a shriek from Ursula, Bill turns around. She runs into his arms, and covers him with kisses.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">I've missed you! I thought about you every day. You should've written. Did Abby show you what she got?\nAbby scowls at Ursula. With no choice but to show him, she opens the top button of her blouse and draws out a diamond necklace.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(apologetically)\n</p><p id=\"dia\">For Christmas.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Plus a music box. He spoils her. Why don't they spoil me, too?\n</p><p id=\"spkdir\">(whispering)\n</p><p id=\"dia\">You oughta be glad you didn't have to spend the winter. You\nwould've gone crazy.\n</p><p></p><p id=\"slug\">225\tTIGHT ON ABBY\n</p><p></p><p id=\"act\">The winter's peace is gone. Abby is sick with fear. Now that she loves Chuck, too, she can never again be honest with Bill. The truth of her feelings would crush him. Moreover, there's no telling how he might react. He could ruin everything, even get them killed.\n</p><p></p><p id=\"slug\">226\tEXT. BEDROOM WINDOW\n</p><p></p><p id=\"act\">Chuck looks on from behind the bedroom window.\n</p><p></p><p id=\"slug\">227\tEXT. DINNER TABLE\n</p><p></p><p id=\"act\">They dine in awkward silence. Benson has joined them.\nAbby, for all her winter's polish, still eats with the back of her knife.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">How was Chicago?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Great.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">How's everybody doing?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Okay.\nThey are silent for a moment. Bill senses that nobody except Ursula is really glad to see him back.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">How's Blackie?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Still hasn't wised up. Know what I mean? He asked how you were\ndoing, though.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I told him. Ran into Sam, too. He'd been in a fight.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Oh yeah?\nBill can see that her interest is only polite. He knows that he should turn around and leave, but he cannot. The sight of him with his confidence gone is painful to behold.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">His nose was like this.\nHe pushes his nose to one side. Ursula and Abby laugh.\n</p><p></p><p id=\"slug\">228\tEXT. STOCK POND\n</p><p></p><p id=\"act\">Bill plants willow slips in the soft earth by the stock pond. Ursula orders a dog around.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Look at this dog mind me. Sit! You've got to say it like hitting a nail.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Has she asked you anything about me?\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">No.\nUrsula flirts with him, running the shoots along his back.\nShe waits to see what he will do. He gets up and after a short chase catches her. He holds her at arm's length for a moment, then kisses her.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">What'd you do that for?\nBill wonders himself. To get revenge on Abby? He touches her breast.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Don't.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why not?\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Cause there's nothing there.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I can be the judge of that.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Then ask first.\nHe kisses her neck.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Nobody has to know but us  chickens.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">What do I have to say to convince you? You tell me, I'll say it.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">What makes you think I would?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Nothing.\nShe giggles and kisses him back. But guilt has caught up with him. He cannot go ahead.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">What's the matter?\nNo reply.\n</p><p></p><p id=\"speaker\">URSULA \n</p><p id=\"dia\">Maybe it would be wrong.\n</p><p id=\"spkdir\">(disappointed)\n</p><p id=\"dia\">You still love her, don't you?\nBill hums a rock off toward the horizon.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I should've gone in the church, like my father was after me to.\n</p><p></p><p id=\"slug\">229\tBILL'S POV - OUTSIDE THE BELVEDERE - NIGHT\n</p><p></p><p id=\"act\">Chuck and Abby sit in their cozy living room playing Parcheesi. The sound of their voices is muffled. The camera draws back to reveal Bill outside the window, watching.\nShe is comfortable with Chuck now. Apparently, he has lost his place in her heart. He wants to rush in and drag her away.\n</p><p></p><p id=\"slug\">230\tEXT. BEDROOM WINDOW - NIGHT\n</p><p></p><p id=\"act\">Later that night he stands under the bedroom window and wonders at the meaning of the shadows that flicker across the ceiling. After a moment he withdraws into the darkness.\n</p><p></p><p id=\"slug\">231\tEXT. SMALL PRAIRIE TOWN (DUCK LAKE)\n</p><p></p><p id=\"act\">Bill has brought Abby into a nearby town to make some purchases. Dressed in a chauffeur's gown and goggles, he sits against the fender of the Overland watching her move from store to store. Ursula is with her.\nThe TOWNSPEOPLE all speak German. Their peasant costumes are freely mixed with Western dress. The signs are old German script. Two MEN carry a huge bulb through the street, to put atop a church.\n</p><p></p><p id=\"slug\">232\tOVERLAND AUTO\n</p><p></p><p id=\"act\">Abby walks up with Ursula.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Listen, I'm going to stay and go back with the laundry wagon.\nAbby looks at Bill, then nods okay. Ursula runs off. Bill opens the door, and she gets in.\n</p><p></p><p id=\"slug\">233\tEXT. ROAD OUTSIDE TOWN (DUCK LAKE)\n</p><p></p><p id=\"act\">They are stopped on the road a hundred yards outside the town.\nAbby smokes as Bill checks the radiator. Something in his behavior leads us to suspect he may have staged this stop.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How you been doing?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Me? Fine.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">We don't talk so much these days.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I know.\nShe knows what he wants. She cannot give it anymore.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I said a lot of stupid things before I went off.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(politely)\n</p><p id=\"dia\">I forgot about it already.\nBill, trying his best to make peace with her, cannot help seeing that she would like to keep things as they are--and not because she harbors any grudge.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You've forgiven me?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">There was nothing to forgive.\nHe holds a bottle of liquor out to her.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What're you worried about?\nShe takes a swig. He laughs. She laughs back.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">So how'm I doing with you?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Fine.\nHe takes her hand and holds it like a trapped bird.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's happened?\nShe shrugs, disengaging her hand to brush aside her hair. She is painfully aware of his suffering but doesn't have the heart to tell him how it all is.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I probably ought to leave. I will.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Already? You just got here.\nShe hasn't really contradicted him. He leans forward as though to kiss her. She lets him. She wishes that she could give herself to him, but she doesn't know what is right. Then, a sudden impulse of panic, she gets up and backs away.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Where you going?\nHe reaches out to catch her. She breaks away and starts to run. He walks quickly after her, cutting off any escape toward the town.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why'd you have to come back?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I'm not going to hurt you. I only want to talk with you.\nShe stops and hides her face in her hands. He gently pulls them away.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I didn't come back to make trouble for you. I guess we were fooling\neach other to think it could last. I mean, What was I offering youanyhow? A ride to the bottom. Looking at you now, in the right  clothes and everything, I see how crazy I was and--well, I understand. It's okay. I sort of cut my own throat, actually.\nHer eyes close and her legs give in. Bill lets her go and backs off a step in surprise. She sinks to the ground, as though in a trance.\n</p><p></p><p id=\"slug\">234\tTIGHT ON BILL\n</p><p></p><p id=\"act\">Bill, taken by surprise, goes up and kneels down beside her. He looks to see that she is okay. He picks a fox-tail out of her hair. Her dress has worked up toward her knees. He pulls it back down. He wants to caress \nher face but hesitates.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">How'd we let it happen, Abby? We were so happy once. Why didn't we starve? I love you so much. What have1 done? You're so beautiful. What have I done?\nHe touches his lips for a fraction of a second to hers, notices another car approaching down the road. He picks her up like a doll and carries her back to the Overland.\n</p><p></p><p id=\"slug\">235\tEXT. BELVEDERE - CHUCK'S POV\n</p><p></p><p id=\"act\">They have arrived back at the Belvedere.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I'm sorry.\nShe touches his face in a surge of sympathy. What has she done to him? He kisses her neck and leads her toward the front door.\n</p><p></p><p id=\"slug\">236\tCRANE TO CHUCK\n</p><p></p><p id=\"act\">The camera rises to the uppermost story of the Belvedere. Chuck has seen them. Hot tears leap to his eyes. Before Bill left for the winter he often observed such intimacies between them. Now it all looks different.\n</p><p></p><p id=\"slug\">237\tCHUCK'S POVS (HIGH ANGLES)\n</p><p></p><p id=\"act\">He looks around at his estate--his barn, his auto, his great house and his granary. None of them is any consolation now. Far a moment it seems to him as though he lived here in some time long past.\n</p><p></p><p id=\"slug\">238\tINT. BEDROOM\n</p><p></p><p id=\"act\">Abby notices Chuck watching her outside the bedroom door.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">You want something from me?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">No.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Will you hand me that magazine?\nHe gives her the magazine she wants.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What's the matter?\nHe seems for a moment to consider telling her, then shrugs and goes downstairs.\n</p><p></p><p id=\"slug\">239\tINT. LIVING ROOM\n</p><p></p><p id=\"act\">He stumbles into a bird cage but hardly notices. The jostled birds raise a fuss.\n</p><p></p><p id=\"slug\">240\tEXT. FRONT PORCH\n</p><p></p><p id=\"act\">He runs into Bill on the front porch.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I've been looking for you. I have to take off again, real soon here, and...\nChuck puts a hand on Bill's shoulder, stopping him. They look at each other for a moment, then he passes on. Bill seems puzzled.\n</p><p></p><p id=\"slug\">241\tEXT. FIELDS\n</p><p></p><p id=\"act\">Chuck walks out into the deep of his fields. The wheat, a warm dry gold, is almost ready to take in. He sits down and rests his head against a \nfurrow, powerless to think. The wind makes a song in the infinitude of sweet clicking heads.\nHe puts his hands over his heart and breathes in gasps, with the dumb honesty of a wounded animal. He could not himself quite say what it is that he knows.\n</p><p></p><p id=\"slug\">242\tEXT. BONANZA - SERIES OF ANGLES\n</p><p></p><p id=\"act\">Late that afternoon disaster strikes as a swarm of locusts sweeps down on the bonanza. We do not see where they come from. They seem to appear out of nowhere, unnoticed. Ursula works in the kitchen, Bill by the barn. Chuck lies asleep in the field, Abby upstairs in bed.\n</p><p></p><p id=\"slug\">243\tANIMALS ON BONANZA\n</p><p></p><p id=\"act\">The animals sense it first. The buffalo move off in a mass. The horses become uncontrollable. One runs around the barn in a panic. Bill watches it, puzzled.\nTwo peacocks have a fight.\nA dog in the treadmill races in vain to escape, driving the machine to a feverish pitch. The shadow of a giant cloud licks over the hills.\n</p><p></p><p id=\"slug\">244\tEXT. FIELDS\n</p><p></p><p id=\"act\">Everything seems normal in the fields.\nThen, as you listen, a strange new sound begins to rise from them, a wild sea-like singing. As the camera moves over the fields and down into the wheat it swells in a crescendo until...\n</p><p></p><p id=\"slug\">245\tTIGHT ON LOCUSTS\n</p><p></p><p id=\"act\">Suddenly we see them up close, devouring the stalks in a fever, the noise of their jaws magnified a thousand times.\nThey slip into the Belvedere, under the sash and wainscoting, turning up first in places it would seem they could never get into: a jewelry case, the back of a radio, the works of a music box, a bottle with a miniature ship inside, etc.\n</p><p></p><p id=\"slug\">246\tEXTREME CLOSEUPS\n</p><p></p><p id=\"act\">Their eyes are dumb and implacable. They seem to have a whole hidden life of their own.\n</p><p></p><p id=\"slug\">247\tINT. KITCHEN\n</p><p></p><p id=\"act\">Little by little they gather in numbers. Ursula first sees one on the drainboard. She swats it with a newspaper. Others sprout up. One by one she picks them up with a tongs and drops them into the stove. This method\nis too slow. She begins to use her fingers. She moves with a quick, nervous energy, even as she understands this is futile. At last claustro-phobia seizes her. She spins around with a shriek, lashing out at everything in sight.\n</p><p></p><p id=\"slug\">248\tINT. MASTER BEDROOM\n</p><p></p><p id=\"act\">In the bedroom overhead, Abby wakes up from one nightmare into another. She jumps out of bed and goes to the window. The locusts pelt against the pane like shot. She throws the bolt. Suddenly a crack shoots through the glass. She jumps back and watches in horror as a sliver of the pane falls in. They are free to enter.\n</p><p></p><p id=\"slug\">249\tSERIES OF ANGLES\n</p><p></p><p id=\"act\">Suddenly they are everywhere: on the clothesline, in the pantry, in hats and shoes and the seams of clothing. Not a nook or cranny is safe from penetration.\n</p><p></p><p id=\"slug\">250\tTIGHT ON CHUCK - SLOW MOTION\n</p><p></p><p id=\"act\">Chuck, asleep in the deep of the wheat, bolts up in slow motion. His hair is seething with them.\n</p><p></p><p id=\"slug\">251\tEXT. BONANZA - FURTHER ANGLES\n</p><p></p><p id=\"act\">Panic hits the bonanza. Workers tie string around their pant cuffs to keep the insects from crawling up their legs, then rush out to the fields with gongs, rattles, pot lids, scarecrows on sticks, drums and horns and \nother noisemakers to scare them off.\nSome pray. Others run around like madmen, stamping and yelling, ignored by the gathering host. A couple get into a fistfight.\nA storm flag is run up the flagpole. A tractor blasts out an S.O.S. The peacocks huddle under the stoop.\n</p><p></p><p id=\"slug\">252\tTIGHT ON CHUCK\n</p><p></p><p id=\"act\">Chuck gives Benson his orders.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Offer fifty cents a bushel for them. Get out the reapers.\nSee what you can harvest.\n</p><p></p><p id=\"slug\">253\tHIGH DOWN ANGLE\n</p><p></p><p id=\"act\">The locusts snap through the air. Bill, swatting at them with a shovel, stops to gag. One has flown into his mouth.\n</p><p></p><p id=\"slug\">254\tTIGHT ON GEARS\n</p><p></p><p id=\"act\">They jam up the gears of the machinery with the crush of their bodies.\n</p><p></p><p id=\"slug\">255\tINT. MASTER BEDROOM\n</p><p></p><p id=\"act\">Abby throws a sheet over herself, but they get in under it. She thrashes around madly, then with a cry goes limp.\n</p><p></p><p id=\"slug\">256\tCHUCK AND BENSON\n</p><p></p><p id=\"act\">Benson reports back to Chuck. A team of horses races by, nearly bowling them over.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">We can't get the machines out. They're jamming up the gears.\nThere's a good chance they'll pass on south, though. Unless...\nunless a wind comes up.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What happens then?\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">They'll set down and walk in.\n</p><p></p><p id=\"slug\">257\tSIGNS OF DAMAGE\n</p><p></p><p id=\"act\">The locusts devour not just the crops but every organic thing: pitchfork handles, linens on the clothesline, leather traces, flowers in the window boxes, etc. Soon a large area of wheat is eaten down to stubble.\nBill looks away from a tree for a second. When he turns back it has been stripped to a wintry bareness.\n</p><p></p><p id=\"slug\">258\tEXT. WIND GENERATOR, OTHER ANGLES\n</p><p></p><p id=\"act\">The vanes of the wind generator begin gently to stir. Little by little the wind picks up. A dust devil spins across the yard. The grass lists by the well. A power line moans.\n</p><p></p><p id=\"slug\">259\tEXT. FIELDS\n</p><p></p><p id=\"act\">As the sun dips below the horizon, the locusts pour in like a living river, walking along the ground like a procession of Army ants. The roar of their wings is deafening. The air hisses and pops with their electric frenzy.\n</p><p></p><p id=\"slug\">260\tSTOCK AND MATTE SHOTS - SUNSET\n</p><p></p><p id=\"act\">And these are but the advance elements of a main force which looms like a silver cloud on the horizon.\n</p><p></p><p id=\"slug\">261\tEXT. BONFIRE - NIGHT\n</p><p></p><p id=\"act\">WORKERS dump bushels of the insects into a bonfire. A MAN with an abacus keeps track of what each is owed.\n</p><p></p><p id=\"slug\">262\tSAME FIELDS - NIGHT\n</p><p></p><p id=\"act\">The wind has picked up. Chuck, Bill and Abby have come out to the fields with a dozen WORKERS to investigate the extent of the damage. The insects buzz around blindly in the light of their lanterns, which they carry Japanese-fashion at the ends of cane poles.\n</p><p></p><p id=\"slug\">263\tTIGHT ON CHUCK - NIGHT\n</p><p></p><p id=\"act\">Chuck inspects the grain.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">There's nothing we can do but wait. They're either going to take it all or they're not.\nHe covers his face with his hands. The others shy back at this display of grief, startling in one so formal. Their jostled lanterns cast a dance of lights.\nBill, moved to real sympathy, takes him by the shoulders.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Come on. They might still lift. Hey, I've seen a wind like this lay\ndown and die. Don't give up now.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(ignoring him)\n</p><p id=\"dia\">We could at least make sure they don't get the people on south.\nHe breaks open the mantle of his lantern, still unsure what he should do. Some of the flaming kerosene splashes onto the crops nearby, setting them ablaze. Bill drops his rattle and swats the fire out with his coat.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What're you doing? Watch it! What're you, crazy? There's\nstill a chance, don't you see?\nChuck goes to his horse. Bill grabs him by the sleeve. Does he really mean to set the fields on fire? Chuck pushes him aside. Bill, frantic, turns to the others for support.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Stop him, or it's all going up.\nThey, however, are too uncertain of their ground to intervene. Chuck turns on Bill.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What does it matter to you?\nChuck slings fire out of the broken lantern onto the crops next to Bill -- a sudden, hostile gesture that catches them all by surprise. Independent of his will, the truth is forcing its way up, like a great blind fish from the bottom of the sea.\nHe slings the fire out again. A patch lands on Bill's pantleg. Bill slaps it out.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What's got into you?\nThey stare at each other. Bill backs off like a cat, sensing Chuck knows the truth, but at a loss to understand how he could.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Why do you care? I gave my life for this land.\nChuck walks towards him. Suddenly Bill turns and takes off running. Chuck swings at him with the lantern. Bill escapes behind the building wall of flame that springs up between them.\nThe whirr of the locusts stops for a moment--they seem at times to have a collective mind--then, just as mysteriously, resumes.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Stop, Chuck!\nChuck leaps on his horse. She tries to drag him off but is thrown aside and almost trampled underfoot. Now the others join in, trying to knock away the lantern or catch his stirrup. He eludes them and rides off after Bill,  leaving a slash of flame behind him in the grain. They tear off their coats to swat it out, in vain--already it stretches a hundred yards.\n</p><p></p><p id=\"slug\">264\tBILL\n</p><p></p><p id=\"act\">Bill runs through the night, still carrying his lantern. Chuck bears down on him. Abby chases along behind him, screaming for him to stop.\nBill realizes the lantern is giving his position away He blows it out and vanishes from sight. All we can see is the thundering horseman, sowing fire.\n</p><p></p><p id=\"slug\">265\tCRANE SHOT\n</p><p></p><p id=\"act\">With a rough idea where Bill is, Chuck begins to lay a ring of fire around him, fifty yards in diameter.\n</p><p></p><p id=\"slug\">266\tBILL AND ABBY INSIDE RING\n</p><p></p><p id=\"act\">Abby spots Bill against the flames. She rushes up, gasping. They have been caught inside the ring.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What're you doing? This is a bad place to talk\nHe throws his coat over Abby's head, picks her up by the waist and crashes through the flame. They have to shout to make themselves understood. The locusts roar like a cyclone.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Did you see that? He was trying to burn me. What's got into him?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">He knows. He must.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">A whole year's work. All wasted! These bugs, once they make up\ntheir minds...\nBill stalls. The fire races toward them through the wheat. They appear as silhouettes against it.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I need to get out of here. I think you probably should, too.  \n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Hell of a life. Damned if you do and damned if you don't.\nHe leaves. Abby wonders if she ought to run after him.\n</p><p></p><p id=\"speaker\">ABBY  \n</p><p id=\"dia\">Bill!\nBut this moment's hesitation has been too long. Already he is swallowed up in the night, her voice swept away in the roar of the flame and the locusts, who seem to wail louder now, and with a great mournfulness--like keening Arab women--as if they knew the fate shortly to envelop\nthem.\nAbby turns back. She, too, has reason to fear Chuck and must escape.\n</p><p></p><p id=\"slug\">267\tNEW ANGLE\n</p><p></p><p id=\"act\">Benson rallies the workers.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">There's still a chance they're going to fly.\n</p><p></p><p id=\"speaker\">VOICES\n</p><p id=\"dia\">Get the tractor out! The pump wagon! Blankets!\nThey rush off to find equipment to fight the fire.\n</p><p></p><p id=\"slug\">268\tISOLATED ON CHUCK - NIGHT\n</p><p></p><p id=\"act\">Chuck rides through the dark like a lone Horseman of the Apocalypse, setting his fields on fire.\n</p><p></p><p id=\"slug\">269\tEXT. PLAINS ON FIRE - SERIES OF ANGLES - NIGHT\n</p><p></p><p id=\"act\">Tractors attempt to plow a firebreak. Mad silhouettes run back and forth, slapping at the blaze with wet gunny sacks fixed to the ends of sticks. Two dormitories burn out of control.\nUrsula throws open the barn and lets the horses out. They have raised thunder kicking at their stalls. The light above the barn door pulses erratically.\n</p><p></p><p id=\"slug\">270\tEXPLOSIONS - NIGHT (MINIATURES)\n</p><p></p><p id=\"act\">Oil wells explode along the horizon. Huge balls of flames roll into the heavens.\n</p><p></p><p id=\"slug\">271\tEXT. BURNING PLAINS - NIGHT\n</p><p></p><p id=\"act\">Panic spreads among the workers as the holocaust threatens to engulf them. They throw down their tools and run for their lives.\n</p><p></p><p id=\"slug\">272\tANIMALS - NIGHT\n</p><p></p><p id=\"act\">Animals flee in all directions:  birds and deer and rabbits, pigs, buffalo and the horses from the barn. The locusts mill around crazily on the wheat stalks, backlit against the flame.\n</p><p></p><p id=\"slug\">273\tBILL - NIGHT\n</p><p></p><p id=\"act\">Bill, fleeing on his motorbike with his rabbit, holds up\nfor a moment to watch the fire--a Biblical inferno of spectacular sweep.\n</p><p></p><p id=\"slug\">274\tEXT. BEDROOM WINDOW--TRACKING SHOT (CHUCK'S POV)--NIGHT\n</p><p></p><p id=\"act\">A single light burns in the Belvedere.\n</p><p></p><p id=\"slug\">275\tINT. BEDROOM - NIGHT\n</p><p></p><p id=\"act\">Heaving with sobs, Abby throws her things into a bindle. She has lost Chuck forever. Their life is destroyed. She glances out the window. She still has time to get away, but she must hurry. She bolts for the door. Sud-\ndenly Chuck steps from the shadows, blocking her exit.\nHis face, black with soot, looks gruesome in the gas1ight. The locusts have chewed up his clothes.\nAbby is like a frightened deer. Did he see her packing?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You look as though you'd seen a ghost.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Where you going?\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">Off with him?\nThe wind cuts gaps in the death wail of the locusts. From time to time we hear the thump of an exploding well.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">He's not your brother, is he?\nHow much does he know? She edges toward the door.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why do you say that?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Come here a minute. Who are you?\n</p><p id=\"spkdir\">(no reply)\n</p><p id=\"dia\">Where'd you come from?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I told you.\nHe shakes her. She quivers like a child in his grasp. She no longer has the audacity to lie.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">How long have you known?\nHe drops his eyes. Shamefully long -- and his anger is partly just at this.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">What'd you want? He punches in the shade of a lamp, extinguishing it.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Tell me. He shoves over the chest of drawers. She does not move.\nHe tears down the drapes, already in shreds.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">This? Show me what you wanted! I would have given it all to you.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Please, Chuck.  \n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Please what? You're not going to tell me you're sorry, I hope..\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">But I am.\nOutside the window fires rage along half the horizon. He sits down. He wants to sob, but cannot.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">You're so wonderful. How could you do this?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I'm just no good. You picked me from the gutter, and this is\nhow -- I never deserved you.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(interrupting)\n</p><p id=\"dia\">The things you told me.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I love you, though. You have to believe me. It may sound false after...\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"spkdir\">(interrupting)\n</p><p id=\"dia\">Down at the cave. Don't you remember? I believed them.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">All right. I'm going away. You'll never have to see me again.\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Away?\nHe gets up, suddenly alarmed, walks to the mantel and opens a chest.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What're you doing?\nChuck drapes his neck with the stole he used in slaughtering the hog. Her face goes empty. He gets his razor strop from the shaving basin. She shrinks back in the corner. He looks at her for a moment, then leaves the room. \n</p><p></p><p id=\"slug\">276\tINT. STAIRCASE - NIGHT\n</p><p></p><p id=\"act\">Abby pursues him down the stairs. He throws her aside.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Where are you doing? Chuck! What are you doing? I won't  \nlet you! Come back!\nAgain he throws her aside, and again she keeps after him, desperate to prevent any harm coming to Bill. Finally he picks her up and drags her outside.\n</p><p></p><p id=\"slug\">277\tEXT. PORCH - NIGHT\n</p><p></p><p id=\"act\">He lashes her with a rope to a column of the porch. She struggles vainly to free herself. Does he intend to use the razor on her?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">No, Chuck! Please, darling! It wasn't his fault. It was mine.\nLet him go. I love you, Chuck. Do anything, only please... \n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">I'm sick of hearing lies.  \nHe stuffs a handkerchief in her mouth and leaves.\n</p><p></p><p id=\"slug\">278\tTIGHT ON CHUCK - NIGHT\n</p><p></p><p id=\"act\">Chuck wanders through the night with a lantern, calling his mare.\n</p><p></p><p id=\"slug\">279\tEXT. BURNT-OUT FIELDS - DAWN\n</p><p></p><p id=\"act\">Dawn breaks. Chuck rides over the burnt-out fields looking for Bill. The feet of his lank white mare are wrapped to the fetlock in wet burlap, to protect them from the smouldering grass. It prances warily along, without\nmaking a sound, wreathed in a mist of blue smoke. With him he carries a stool. The camera pans up to the smoke which is carrying his fortune off.\n</p><p></p><p id=\"slug\">280\tCHUCK'S POVS\n</p><p></p><p id=\"act\">Burnt, blind deer stand and look at him in utter terror, as though they understood his intentions. The roasted corpses of sharptail grouse, coyotes and badgers lie scattered here and there. Piles of dung burn on after the grass is out.\nA peacock from the Belvedere wanders around, angry and\nperplexed.\n</p><p></p><p id=\"slug\">281\tBILL\n</p><p></p><p id=\"act\">Bill is repairing his motorbike by a rock in the middle of the scorched landscape. The tires are soft as licorice from the heat. Suddenly, he looks up. Chuck has found him.\nHe jumps behind the handlebars and fishtails off. Chuck breaks into a gallop, rides him down, knocks him to the ground with the stool, dismounts and stamps in the spokes of the front wheel to make sure he goes no further.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Who do you think you are? Now you've ruined it. What's got\ninto you?\n</p><p></p><p id=\"speaker\">CHUCK\n</p><p id=\"dia\">Where you headed?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Why do I have to tell you? I can come and go when I like.\nThis is still a free country, last I heard.\nBill stops when he sees the stool. Chuck calmly strops the razor on his stirrup flap. There are no secrets now.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">What can I say? Too late for apologies. You've got a right\nto hate me.\nChuck puts the razor away and advances on Bill with the stool.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I want to leave. You won't ever see me again. I already got what\nI deserve.\nThere is nothing Bill can say to appease him. This will be a fight to the death. Chuck lashes out with the stool. Bill ducks too late.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Watch it!\nChuck comes at him again. Bill throws a punch, but Chuck blocks it and knocks him down again with the stool.\nBill reels back and cracks his head on the bicycle frame. This time he stays down. Satisfied the struggle is over, Chuck goes back to get some rope.\n</p><p></p><p id=\"slug\">282\tNEW ANGLE\n</p><p></p><p id=\"act\">Chuck shuts his eyes to mumble a prayer of absolution--in Russian.\nBill in a panic, snaps a spoke out of the broken wheel and lays it against his sleeve.\nChuck moves in for the kill. Bill gets to his feet. He wants to run but fear makes his knees like water. Suddenly, they are face to face. Chuck swings at Bill with the stool but misses. Bill lifts the spoke above him and\ndrives it deep into Chuck's heart.\nChuck gasps. Bill seems just as shocked. Chuck sits down to determine the gravity of his injury. Blood jets rhythmically out the end of the spoke, as though from a straw. Bill circles him, unbelieving.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Should I pull it out?\nChuck puts his finger over the end of the spoke. Blood seeps out the side of his mouth, like sap from a broken stem.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I better get somebody.\nHe tries to catch the reins of Chuck's horse, but it shies out of reach, its conscience repelled. He looks back at Chuck in anguish.  What has he done?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You were my friend.\n</p><p></p><p id=\"slug\">283\tTIGHT ON BILL AND HIS POVS\n</p><p></p><p id=\"act\">The Belvedere is visible on the horizon. Bill hesitates\na moment, then heads back on foot to find Abby. He gives\nChuck a wide berth.\nThen, on a ridge in the distance, he spots Benson.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Get a doctor! Fast!\nHow much did he see? Bill does not stay to find out but\ntakes off running, though not without first collecting his\nrabbit.\nBenson, meanwhile, bounds down the hill to Chuck's side.\nHis left sleeve has been burned away. The flesh beneath\nis the color of a raw steak.\n</p><p></p><p id=\"slug\">284\tCHUCK'S POVS\n</p><p></p><p id=\"act\">Chuck sees the smoke from his fields, the burnt deer,\na circling hawk.\n</p><p></p><p id=\"slug\">285\tTIGHT ON CHUCK\n</p><p></p><p id=\"act\">He breathes in gulps. His eyes are blank, like a child's\nmarbles. He takes Benson's hand.\n</p><p></p><p id=\"speaker\">CHUCK  \n</p><p id=\"spkdir\">(weakly)\n</p><p id=\"dia\">Wasn't his fault. Tell her...forgive them.\nThe locusts can be heard no more. The prairie makes a\nsound like the ocean. Chuck turns his back and dies.\n</p><p></p><p id=\"slug\">286\tTIGHT ON BENSON\n</p><p></p><p id=\"act\">Benson weeps. Whether or not he understood Chuck's last\nwishes, he seems unlikely to abide by them.\n</p><p></p><p id=\"slug\">287\tEXT. BELVEDERE\n</p><p></p><p id=\"act\">Bill finds Abby bound to the house like the figurehead\nof a ship. He cuts her loose. The ropes fall at her feet. She is free. \nThey look at each other for a moment.\nThen, in a rush of compassion for them all, she throws\nher arms around him.\nBill wonders if she is taking him back. Might their\ndifferences all have been a terrible misunderstanding?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">We have to hurry. Chuck's out looking right now. Oh, Bill,\nwhat have we done? He took his razor. We need to hurry. He\nmight be coming back any minute.\nBill mentions nothing of his encounter. She grabs her\nbindle, Bill a handful of silverware and an umbrella.\nAfter a moment's hesitation, he puts them back.\n</p><p></p><p id=\"slug\">288\tNEW ANGLE\n</p><p></p><p id=\"act\">They run down to the barn, where the cars are stored.\nThe saplings in the front yard have been stripped even\nof their bark. Abby stops to look back at the Belvedere\none last time. Chuck does not want her anymore. How\ncould she expect him to?\nBill grabs her by the hand and tugs her along.\n</p><p></p><p id=\"slug\">289\tEXT. BARN\n</p><p></p><p id=\"act\">Abby throws open the doors of the barn. Bill cranks up\nthe engine of the Overland.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Will the cops be looking for us, too?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Probably.\nAbby stands in the door. She is reluctant to leave, though she \nknows they must.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Get in.\nShe notices that Bill's lip is cut, his shirt soaked with\nblood.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What happened to you? Where's this from?\nBill looks down. He forgot.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Had an accident.\nShe looks at him for a moment, not quite trusting this\nexplanation. The engine catches with a noise like start-\nled poultry. Bill gets behind the wheel. Just as they\nare pulling out of the garage, Ursula runs up, black \nas coal from battling the fire all night.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Where you going?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"spkdir\">(breathless)\n</p><p id=\"dia\">We got in a jam. You'll be safer here. Say we're headed for town.\nTake care of the rabbit, too. He's yours now. \n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">What's the matter?\n</p><p></p><p id=\"speaker\">BILL \n</p><p id=\"dia\">Just do what I say. Why're you always arguing about everything?\nWait here till we get in touch.\nBill gives Ursula his wallet and a kiss. Abby gives her a hug.\n</p><p></p><p id=\"slug\">290\tEXT. BURNT GRASS\n</p><p></p><p id=\"act\">They roar off through the burnt grass of the prairie.\nAbby waves goodbye.\n</p><p></p><p id=\"slug\">291\tTHEIR POV (MOVING)\n</p><p></p><p id=\"act\">As they crest a ridge, Benson appears in front of them,\nwaving a hand to flag them down. Bill puts his foot on\nthe gas. Benson sees they are not going to stop and fires\nat then with a pistol. Bill grabs a shotgun from a scab-\nbard under the dash and fires back. Nobody is hurt.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What's the matter with him?\nBill shrugs. Inside he feels a great relief. They are\nfree at last. At last he has her back.\n</p><p></p><p id=\"slug\">292\tEXT. BONANZA GATES\n</p><p></p><p id=\"act\">They veer off across the prairie, towards the Razumihin\ngates. The music comes up full.\n</p><p></p><p id=\"slug\">293\tEXT. SHACK ON RIVER\n</p><p></p><p id=\"act\">They have come to a lone shack on the river, a drinking\nhouse for passing boatmen. They negotiate (in pantomime)\nwith the PROPRIETOR for a tiny steam boat moored at the\nend of the pier. When the car is not enough, Abby throws\nin her necklace.\n</p><p></p><p id=\"slug\">294\tABOARD THE BOAT\n</p><p></p><p id=\"act\">They board the boat and turn down stream. There is a phonograph \non board.\n</p><p></p><p id=\"slug\">295\tTIGHT ON NECKLACE\n</p><p></p><p id=\"act\">The necklace sparkles on the hood of the car--a hint\nthey are leaving behind evidence that could betray them.\n</p><p></p><p id=\"slug\">296\tEXT. BOAT ON RIVER - AND MOVING POVS\n</p><p></p><p id=\"act\">They glide along in the hush of evening. The reeds are\nfull of deer. Cranes, imprudently tame, dance on the\nsand bars.\nBill looks around in wonder. He knows these may be his\nlast days on earth. Abby throws a sounding line.\nA COUPLE from a local farm seeks privacy in the willows.\nOther BOATMEN glide past in silence. A CHILD plays a\nfiddle on the deck of a scow. HUNTERS creep along the\nshore in search of waterfowl.\n</p><p></p><p id=\"slug\">297\tEXT. CAMP - DUSK\n</p><p></p><p id=\"act\">Bill sleeps under a tarp. Abby looks out across the water\nand bursts into sobs. She has wronged Chuck and thrown\nher life away.\n</p><p></p><p id=\"slug\">298\tTHEIR POVS (MOVING) - NIGHT\n</p><p></p><p id=\"act\">They shine a lamp into the murky depths and spear pickerel\nwith a hammered-out fork.\nStrange rocks loom up and give way to wide moonlit fields.\nThey have the sense of entering places where nobody has\nbeen since the making of the world.\n</p><p></p><p id=\"slug\">299\tEXT. FARMHOUSE\n</p><p></p><p id=\"act\">Four LAWMEN, in pursuit, interrogate some FARMERS. Have\nthey seen the two people standing by Chuck in his wedding\nportrait? Benson holds the bulky frame. There is a funereal \nborder of black crepe at the corners.\n</p><p></p><p id=\"slug\">300\tEXT. ABOARD THE BOAT - DUSK\n</p><p></p><p id=\"act\">They drift idly on the flood. The phonograph is playing\nin the stern. Abby is back in trousers. Bill points to\na white house on the shore, an image of comfort and peace.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I used to want a set-up like that. Something like that, I thought,\nand you'd really have it made. Now I don't care. I just wish\nwe could always live this way.\nHe sees that her mind is somewhere else. He wants to tell\nher the truth about Chuck, for intimacy's sake, but it\nwould just put more of a cloud over everything. It might\neven cause her to hate him.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Maybe you want to write him a  letter.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I hadn't thought of that.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You really do love him, don't you?\nShe does not reply.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">You want to go back?\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"spkdir\">(shaking her head)\n</p><p id=\"dia\">Too late for that. I could never face him again.\nThey look at each other for a moment. He touches her face,\nto show that he does not hold it against her. She touches\nhim back. They only have each other now. They must save\nwhat moments they can.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Guess it's you and me again.\n</p><p></p><p id=\"slug\">301\tNEW ANGLE\n</p><p></p><p id=\"act\">On a sudden whim, Abby takes off her wedding bracelet\nand holds it over the water.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Watch this.\nBill is caught off guard. Before he can make a move she\nthrows it far out into the river. They laugh, without\nknowing why, at this extravagance.\n</p><p></p><p id=\"slug\">302\tEXT. SHORE .. TRACKING SHOTS\n</p><p></p><p id=\"act\">They gather May apples and black haws. The music from\nthe phonograph comes up full.\nThey dig clams from a sand bar in a playful way. We are\nreminded of their first days on the harvest.\n</p><p></p><p id=\"slug\">303\tXT. UNDERGROWTH\n</p><p></p><p id=\"act\">They make love in the undergrowth.\nAbby, afterwards, lies in a naked daze. The damp greens\nof the wilderness envelop her.\n</p><p></p><p id=\"slug\">304\tTHEIR POV - ON CITY ON RIVER - NIGHT\n</p><p></p><p id=\"act\">Rounding a bend in the river that night, they come upon\nthe lights of a great city. They have doused the running\nlamp. Except for a faint groaning of the trees along the\nshore, the river is silent, conveying the sounds of the\ncity to them from across a great distance -- bells, joy-\nful voices, horns, the chirping of brakes, etc.\n</p><p></p><p id=\"slug\">305\tEXT. CITY STREETS AND THEIR POVS - NIGHT\n</p><p></p><p id=\"act\">They sneak down an alley.\nThere are signs of life behind a few windows, but the\ncity pursues its gaiety elsewhere.\nSuddenly, they come upon a POLICEMAN making his rounds.\nThey let him pass, then cut through a vacant lot back\nto the boat.\n</p><p></p><p id=\"slug\">306\tEXT. RIVER FRONT - DAY\n</p><p></p><p id=\"act\">The next morning finds them camped in a thicket on the river\nfront below a factory.\nBill wakes up, mysteriously happy. Their blankets are heavy\nwith dew. Overhead, finches tilt from branch to branch. A\nlight wind rushes through the leaves. Whatever his trou-\nbles, they seem very small to him in the great. scheme of\nthings.\nHe looks at Abby, mouthing silent words in her sleep.\nHe puts on a white scarf and starts down to the boat. The\nslope is strewn with sodden cartons, burnt bricks and burst\nmattresses, an avalanche of urban excreta.\n</p><p></p><p id=\"slug\">307\tHIS POV\n</p><p></p><p id=\"act\">Abruptly he stops. Two POLICE OFFICERS are combing over the\nboat. They have not seen him. He edges back. Suddenly, there is yelling on the hill above them. Bill looks up. Benson is calling him to the attention of a car-load of POLICEMEN pulling up beside him. The Officers at the boat now spot him, too, and open fire. Bill darts like\na rabbit into the thicket.\n</p><p></p><p id=\"slug\">308\tTIGHT ON ABBY\n</p><p></p><p id=\"act\">Abby bolts awake. Bill jumps down beside her, breathless,\nand begins looking frantically for the shells to his shotgun.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">What's going on?\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Keep down. Can't explain now. They're here.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Who? What're you talking about?  Stop a minute.\nHe covers her with his body as bullets zoom through the\nundergrowth. His face is close to hers. She bursts into\ntears.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">Don't get shot. Look for me under that next bridge down. \nAfter dark.\nHe empties out the contents of his pockets -- a watch, a\ncouple of dollars in change, a ring -- and slaps them down\nin front of her.\nThe Police fan out along the ridge above them. He jams a\nflare pistol into his belt and kisses her goodbye--after\na moment's hesitation -- on the cheek. She tries in vain\nto hold him back.\n</p><p></p><p id=\"speaker\">BILL\n</p><p id=\"dia\">I wish I could tell you how much\nI love you.\n</p><p></p><p id=\"slug\">309\tEXT. MUD FLAT\n</p><p></p><p id=\"act\">Bill runs from the thicket down to the water. The Police\nhave bunched on the other side. It seems he might be able\nto escape. Keeping low, he splashes across a mud flat.\nSuddenly he runs into a trot line that a fisherman has\nleft out overnight. The hooks bite into his thigh and\nshoulder, yanking a string of startled, thrashing catfish\nout of the water.\nHe keeps running in a panic, not realizing the line is\nstaked to the shore. All at once, he jackknifes in the\nair. The stake twangs loose. The Police now spot him \nand begin firing.\n</p><p></p><p id=\"slug\">310\tTIGHT ON ABBY\n</p><p></p><p id=\"act\">Abby runs out of hiding, thinking at first that the Police\nmust be looking for her.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">Why're you shooting? You'll kill him! Have you gone crazy? \nStop! Oh, Bill, not you! Not you!\n</p><p></p><p id=\"slug\">311\tNEW ANGLE\n</p><p></p><p id=\"act\">Bill stumbles along, trying to rip the hooks from his\nflesh, but the fish--fighting their way back to the\nwater--only drive them in deeper.\nAhead two MOUNTED POLICE surge into the river, blocking\nhis retreat.\nHe empties his shotgun at them and throws it away. They\nhold up, astonished. He dashes across a sand bar for the\ndeep of the river and comparative safety. Black mud clings\nto his feet, drawing him down like a fly in molasses.\nBenson goes running out into the river ahead of the Police.\n</p><p></p><p id=\"speaker\">BENSON\n</p><p id=\"dia\">Leave him alone. I want him. Leave him alone.\n</p><p id=\"spkdir\">(firing)\n</p><p id=\"dia\">There you go! There you go!\nHe shoots Bill down. Bill turns and looks at him in sur-\nprise. Benson shoots him again, point blank.\n</p><p></p><p id=\"slug\">312\tUNDERWATER SHOT\n</p><p></p><p id=\"act\">Bill's blood fades off quickly in the gliding water of the\nriver. The line of frightened catfish dances out behind\nhim like a garland.\n</p><p></p><p id=\"slug\">313\tOTHER ANGLES\n</p><p></p><p id=\"act\">A dog trots off in alarm.\nBenson wades into shore, tears streaming down his face,\nhis chest heaving with emotion.\nAbby falls to the ground in a convulsion of grief.\nA short way down the river PEOPLE come and go along the\nbridge where they were to meet.\n</p><p></p><p id=\"slug\">314\tISOLATED ON ROLLER PIANO\n</p><p></p><p id=\"act\">A roller piano sits in a corner by itself, playing a fox-\ntrot. The camera moves back.\n</p><p></p><p id=\"slug\">315\tINT. ARBORETUM - ATTIC\n</p><p></p><p id=\"act\">YOUNG DANCERS are learning the foxtrot in the attic of the\nArboretum, a tacky Western version of an Eastern finishing\nschool. The steps are painted on the floor as white footprints.\nAbby is apparently enrolling Ursula here. The headmistress, \nMADAME MURPHY, boasts of the school's achievements. \nUrsula looks trapped. Abby checks her watch.\nShe must go.\n</p><p></p><p id=\"slug\">316\tEXT. BRICK STREET\n</p><p></p><p id=\"act\">Abby and Ursula walk down an empty street. Abby wears a\nmourning band on her sleeve. She is under the false im-\npression that Ursula likes her new home. An INDIAN PORTER\ncarts her bags along behind them in a wheelbarrow.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">They'll teach you poise, too, so you can walk in any room you \nplease. Pretty soon you'll know all kind of things.\n</p><p id=\"spkdir\">(pause)\n</p><p id=\"dia\">I never read a whole book till I was fifteen. It was by Caesar.\nThey laugh at her careful pronunciation of \"Caesar.\"\n</p><p></p><p id=\"slug\">317\tEXT. TRAIN STATION\n</p><p></p><p id=\"act\">Abby's train is about to leave. The CONDUCTOR walks by\nblowing a whistle. A five-piece BAND plays Sousa airs.\nThey are practically the only civilians on the platform.\nThe rest are SOLDIERS bound for Europe, where America has\njust entered the War, on fire with excitement and a sense\nof high adventure.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">I like your hat.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">It doesn't seem like a bird came down and landed on my head?\nAbby takes the hat off and gives it to Ursula, who lately\nhas begun to take more trouble with her appearance, comb-\ning her hair free of its usual snarls. They laugh at their reflection\nin a window of the train.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">I hardly ever wear it. Be sure and write every week.\nSignals nod. A lamp winks. There are leave-takings up\nand down the platform as the train slides away. Abby hops\non board. A SOLDIER next to her sheds bitter tears.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You write me, too!\nThey wave goodbye.\n</p><p></p><p id=\"slug\">318\tEXT. ARBORETUM - NIGHT\n</p><p></p><p id=\"act\">Late that evening Ursula lowers herself out a third-floor\nwindow of the Arboretum with a rope made of bedsheets.\n</p><p></p><p id=\"slug\">319\tTIGHT ON GIRLS AT WINDOW\n</p><p></p><p id=\"act\">The other GIRLS stand in their nightgowns and wave good-\nbye, amazed at her boldness.\nShe slips off into the night.\n</p><p></p><p id=\"slug\">320\tEXT. BACKSTAGE DOOR - NIGHT\n</p><p></p><p id=\"act\">Ursula looks in a backstage door. She can see, through\nthe wings, a MAN dancing on stage. There is a feeling of\nmad excitement about the place.\nThe person she is looking for is not here, however.\n</p><p></p><p id=\"slug\">321\tEXT. ALLEY - URSULA'S THEME - NIGHT\n</p><p></p><p id=\"act\">She runs down an alley. A man steps out of the shadows--\nGeorge, the pilot. She throws herself in his arms. This\nis our first sight of him since he left the bonanza.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">You're here! Oh, hug me!\nThey kiss madly, with mystery. The moonlit, midsummer night thrums\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Aren't we happy? Oh, George, has anybody ever been this happy?\nHe rocks her back and forth in his arms. They laugh,\nthinking what lucky exceptions they are to the world's\nmisery.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">Hurry.  They'll be looking for me.\n</p><p></p><p id=\"slug\">322\tEXT. AIRPLANE - DAWN\n</p><p></p><p id=\"act\">George bundles Ursula, giggling, into a biplane.\n</p><p></p><p id=\"speaker\">URSULA\n</p><p id=\"dia\">This doesn't even belong to you. Suppose they catch us?\n</p><p></p><p id=\"slug\">323\tEXT. PASTURE -- DAWN\n</p><p></p><p id=\"act\">From a pasture outside town the plane rises into the vast dawn sky.\n</p><p></p><p id=\"slug\">324\tINT. TEXTILE FACTORY\n</p><p></p><p id=\"act\">Abby changes bobbins on a huge loom. A pall of lint and\nanonymous toil hangs over the factory. Down the way a\nhandsome MALE WORKER smiles at her. She smiles back,\ninterested.\n</p><p></p><p id=\"speaker\">ABBY\n</p><p id=\"dia\">It seems an age we've been apart, and truly is for those who\nlove each other so. Whenever shall we meet?'\n</p><p></p><p id=\"slug\">325\tTIGHT ON MACHINERY\n</p><p></p><p id=\"act\">The shuttle rockets back and forth. Off camera we hear\nAbby reading what seems part of a letter to Ursula.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">Soon, I hope, for by and by we'll all be gone, Urs. Does\nit really seem as though we might?'\n</p><p></p><p id=\"slug\">326\tUNDERWATER SHOT\n</p><p></p><p id=\"act\">We look from the bottom of a river up toward the light. \nIn the foreground, dangling from the tip of a submerged\nlimb, is the bracelet Abby threw away.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">'The other day I tried to think how I'd look laid out in a solemn\nwhite gown. Closing my eyes I could almost hear you tiptoe inlook down in my face, so deep asleep, so still.\n</p><p></p><p id=\"slug\">327\tEXT. FIELDS - SERIES OF ANGLES\n</p><p></p><p id=\"act\">The PEOPLE of the Razumihin rebuild the land -- raising\nfences and sinking a well, plowing down the stubble and\nputting in the seed.\n</p><p></p><p id=\"speaker\">ABBY (o.s.)\n</p><p id=\"dia\">'I went to Lincoln Park Zoo the other day. It was great as usual.\nI enclose a check.'\n</p><p></p><p id=\"act\">An ANONYMOUS YOUNG MAN, standing on a carpet \nof new-sprung wheat, looks up with a start. From the \ndistance comes a ghostly noise--the call of the prairie \nchickens at their spring rites. He listens for just a moment, \nthen returns to work.\n</p><p></p><p id=\"act\">THE END</p>\n\n\n\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Days of Heaven</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Terrance Malick\" title=\"Scripts by Terrance Malick\">Terrance Malick</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Days of Heaven Script.html#comments\" title=\"Days of Heaven comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:03:21.845923"}