{"title": "Dead Poets Society", "film_link": "/Movie Scripts/Dead Poets Society Script.html", "script_link": "/scripts/Dead-Poets-Society.html", "info_raw": "\n\nDead Poets Society Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.38 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Tom Schulman\nGenres  Drama\n\nRead \"Dead Poets Society\" Script\n\n\n", "script": "\n\n\n   Dead Poets Society: Final Script\n\n\n\n\n\nINT. WELTON ACADEMY HALLWAY - DAY\n\nA young boy, dressed in a school uniform and cap, fidgets as his mother\nadjusts his tie.\n\n\t\t\t\tMOTHER\n\t\tNow remember, keep your shoulders back.\n\nA student opens up a case and removes a set of bagpipes. The young\nboy and his brother line up for a photograph\n\n\t\t\t\tPHOTOGRAPHER\n\t\tOkay, put your arm around your brother.\n\t\tThat's it. And breathe in.\n\nThe young boy blinks as the flash goes off.\n\n\t\t\t\tPHOTOGRAPHR\n\t\tOkay, one more.\n\nAn old man lights a single candle. A teacher goes over the old\nman's duties.\n\n\t\t\t\tTEACHER\n\t\tNow just to review, you're going to\n\t\tfollow along the procession until you\n\t\tget to the headmaster. At that point\n\t\the will indicate to you to light the\n\t\tcandles of the boys.\n\n\t\t\t\tMAN\n\t\tAll right boys, let's settle down.\n\nThe various boys, including NEIL, KNOX, and CAMERON, line up holding\nbanners. Ahead of them is the old man, followed by the boy with the\nbagpipes with the two youngest boys at the front.\n\n\t\t\t\tMAN\n\t\tBanners up.\n\nThe boys hoist the banners and the bagpipes begin to play loudly. The\nsmall group marches out of the room and down a set of stairs into a\nchurch. The pews are filled with students and parents while the\nteachers, all dressed in robes, are seated at the front of the church\nbehind the headmaster.\n\nThe boys break off to either side at the front of the church. The\nbagpipes cease and the headmaster, MR. NOLAN, walks over to the old\nman carrying the candle.\n\n\t\t\t\tMR NOLAN\n\t\tLadies and gentlemen, boys, the light\n\t\tof knowledge.\n\nAn organ begins to play as the old man goes forward with shaking hands\nto the young boys in the front pew. Each boy is holding a candle and\nhe bends over to light the first one. Each boy in turn lights the\ncandle of the boy next to him.\n\n\t\t\t\tMR NOLAN\n\t\tOne hundred years ago, in 1859, 41 boys sat in this\n\t\troom and were asked the same question that greets\n\t\tyou at the start of each semester. Gentlemen, what\n\t\tare the four pillars?\n\nAll throughout the pews, uniformed boys rise to their feet. TODD, who\nis not wearing a uniform, is urged by his father to stand with them.\n\n\t\t\t\tBOYS\n\t\tTradition, honor, discipline, excellence.\n\nThe boys quickly return to their seats.\n\n\t\t\t\tMR NOLAN\n\t\tIn her first year, Welton Academy graduated five\n\t\tstudents. Last year we graduated fifty-one. And\n\t\tmore than seventy-five percent of those went on to\n\t\tthe Ivy League. This, this kind of accomplishment is\n\t\tthe result of fervent dedication to the principles taught\n\t\there. This is why you parents have been sending us\n\t\tyour sons. This is why we are the best preparatory\n\t\tschool in the United States.\n\nMr. Nolan soaks up the applause from the audience.\n\n\t\t\t\tMR NOLAN\n\t\tAs you know, our beloved Mr. Portius of the English\n\t\tdepartment retired last term. You will have the\n\t\topportunity later to meet his replacement, Mr. John\n\t\tKeating, himself a graduate of this school. And who,\n\t\tfor the past several years, has been teaching at the\n\t\thighly regarded Chester School in London.\n\nThe crowd applauds once again.\n\nEXT. SCHOOL GROUNDS - DAY\n\nThe school lawn is a filled with luggage, students, and parents mulling\nabout in every direction.\n\nINT CHURCH ENTRANCE - DAY\n\nMr Nolan stands by the entrance, speaking with each family as they leave.\n\n\t\t\t\tMR NOLAN\n\t\tGlad you could come by.\n\n\t\t\t\tMR ANDERSON\n\t\tThrilling ceremony as usual Dr. Nolan.\n\n\t\t\t\tMR NOLAN\n\t\tYou've been away too long.\n\n\t\t\t\tMRS ANDERSON\n\t\tHello Dr. Nolan.\n\n\t\t\t\tMR NOLAN\n\t\tGood to have you back.\n\n\t\t\t\tMRS ANDERSON\n\t\tThis is our youngest, Todd.\n\n\t\t\t\tMR NOLAN\n\t\tMr. Anderson.You have some big shoes to fill,\n\t\tyoung man. Your brother was one of our finest.\n\n\t\t\t\tTODD\n\t\tThank you.\n\nTodd and his parents leave while others file past Mr. Nolan.\n\n\t\t\t\tWOMAN\n\t\tLovely ceremony.\n\n\t\t\t\tMR NOLAN\n\t\tThank you. So glad you liked it.\n\nMR PERRY approaches with his son Neil. He shakes Mr. Nolan's hand.\n\n\t\t\t\tMR PERRY\n\t\tGale\n\n\t\t\t\tMR NOLAN\n\t\tTom\n\n\t\t\t\tMR PERRY\n\t\tGood to see you again.\n\n\t\t\t\tNEIL\n\t\tHello Mr. Nolan.\n\n\t\t\t\tMR NOLAN\n\t\tNeil. We expect great things from you this year.\n\n\t\t\t\tNEIL\n\t\tThank you, sir.\n\n\t\t\t\tMR PERRY\n\t\tWell he won't disappoint us. Right Neil?\n\n\t\t\t\tNEIL\n\t\tI'll do my best sir.\n\nEXT SCHOOL GROUNDS - DAY\n\nA bell tolls. Parents begin wishing their boys farewell.\n\n\t\t\t\tFATHER\n\t\tHey, come on son.\n\n\t\t\t\tMOTHER\n\t\tChin up.\n\n\t\t\t\tFATHER\n\t\tNo tears now.\n\n\t\t\t\tBOY\n\t\tOkay.\n\n\t\t\t\tMOTHER\n\t\tChin up.\n\nAnother boy hugs his mother.\n\n\t\t\t\tBOY\n\t\tI don't want to go here.\n\n\t\t\t\tMOTHER\n\t\tYou be a good boy and do your lessons.\n\nEXT SCHOOL GROUNDS - DAY\n\nNeil emerges from a building and sees Todd.\n\n\t\t\t\tNEIL\n\t\tHey, I hear we're gonna be roommates.\n\nHe shakes Todd's hand.\n\n\t\t\t\tNEIL\n\t\tI'm Neil Perry.\n\n\t\t\t\tTODD\n\t\tTodd Anderson.\n\n\t\t\t\tNEIL\n\t\tWhy'd you leave Balincrest?\n\n\t\t\t\tTODD\n\t\tMy brother went here.\n\n\t\t\t\tNEIL\n\t\tOh, so you're that Anderson.\n\nINT DORMATORY - DAY\n\nDR. HAGER is standing in his room doorway while SPAZ and his father are\ngoing over some last minute precautions over the boy's allergies. Spaz's\nfather hands Hager various bottles.\n\n\t\t\t\tFATHER\n\t\tThis is for sinuses. Oh, and if he can't swallow you\n\t\tgive him one of these. And if he had trouble breathing\n\t\tyou can give him some of those.\n\n\t\t\t\tHAGER\n\t\tAll right fine.\n\nDr. Hager takes the bottles and quickly backs into his room, shutting\nthe door.\n\n\t\t\t\tFATHER\n\t\t\t    (to son)\n\t\tDid you remember your vaporizer?\n\n\t\t\t\tSPAZ\n\t\tYes, I put it in my room.\n\nSpaz's father tries to say something else to Dr. Hager but realizes he\nhas already gone.\n\nINT HALLWAY - DAY\n\nNeil pushes his way through a crowd of boys, carrying two suitcases. As\nhe enters his room, Knox quickly passes by.\n\n\t\t\t\tKNOX\n\t\tHey, how's it going Neil?\n\n\t\t\t\tNEIL\n\t\tHey Knox.\n\nCameron comes by and leans against the doorway.\n\n\t\t\t\tCAMERON\n\t\tNeil, study group tonight?\n\n\t\t\t\tNEIL\n\t\tYeah, sure.\n\n\t\t\t\tCAMERON\n\t\tBusiness as usual, huh? Hey, I hear you got the new\n\t\tkid. Looks like a stiff!\n\nHe begins laughing when he notices Todd coming into the room.\n\n\t\t\t\tCAMERON\n\t\tOops!\n\nCameron quickly leaves. Neil tries to keep from laughing as Todd enters\nthe room and sets his luggage down on his bed.\n\n\t\t\t\tNEIL\n\t\tListen, don't mind Cameron. He was born with his\n\t\tfoot in his mouth. You know what I mean?\n\nHe pulls some papers from his blazer pocket and playfully whacks Todd \nacross the back with it.\n\nCHARLIE comes to the door with a smug expression on his face. Knox and\nMEEKS are close behind him. He points at Neil\n\n\t\t\t\tCHARLIE\n\t\tRumor has it, you did summer school.\n\n\t\t\t\tNEIL\n\t\tYep. Chemistry. My father thought I should get ahead.\n\t\tHow was your summer Slick?\n\n\t\t\t\tCHARLIE\n\t\tKeen.\n\nThe boys enter the room. Charlie turns around and looks at Meeks who is\njust entering. \n\n\t\t\t\tCHARLIE\n\t\tMeeks. Door. Closed.\n\n\t\t\t\tMEEKS\n\t\tYes sir.\n\n\t\t\t\tNEIL\n\t\tGentlemen, what are the four pillars?\n\n\t\t\t\tBOYS\n\t\tTravesty. Horror. Decadence. Excrement.\n\nCharlie makes himself comfortable on Neil's bed and lights up a cigarette.\nMeanwhile, Todd is by his bed unpacking his luggage.\n\n\t\t\t\tCHARLIE\n\t\tOkay, study group. Meeks aced Latin. I didn't quite\n\t\tflunk English. So, if you want, we've got our study\n\t\tgroup.\n\n\t\t\t\tNEIL\n\t\tSure. Cameron asked me too. Anyone mind\n\t\tincluding him?\n\n\t\t\t\tCHARLIE\n\t\tHmm, what's his specialty, boot-licking?\n\n\t\t\t\tNEIL\n\t\tCome on, he's your roommate.\n\n\t\t\t\tCHARLIE\n\t\tThat's not my fault.\n\nMeeks seems to notice Todd for the first time.\n\n\t\t\t\tMEEKS\n\t\tOh, I'm sorry, my name is Steven Meeks.\n\nNeil quickly gets up from his spot by the window.\n\n\t\t\t\tNEIL\n\t\tOh, this is Todd Anderson.\n\nTodd turns around and shakes hands with Meeks.\n\n\t\t\t\tMEEKS\n\t\tNice to meet you.\n\n\t\t\t\tTODD\n\t\tNice to meet you.\n\n\t\t\t\tCHARLIE\n\t\tCharlie Dalton.\n\nCharlie continues to lay on the bed, looking smug. Knox extends a hand.\n\n\t\t\t\tKNOX\n\t\tKnox Overstreet.\n\n\t\t\t\tNEIL\n\t\tTodd's brother was Jeffrey Anderson.\n\n\t\t\t\tCHARLIE\n\t\tOh yeah, sure. Valedictorian. National merit scholar. \n\n\t\t\t\tMEEKS\n\t\tOh well, welcome to Hell-ton.\n\n\t\t\t\tCHARLIE\n\t\tIt's every bit as tough as they say, unless you're a\n\t\tgenius like Meeks.\n\n\t\t\t\tMEEKS\n\t\tHe flatters me. That's why I help him with Latin.\n\n\t\t\t\tCHARLIE\n\t\tAnd English, and Trig.\n\nCharlie begins coughing. There is a knock at the door. Charlie quickly\nstamps out his cigarette on the floor and Neil tries to wave the smoke\nfrom the air.\n\n\t\t\t\tNEIL\n\t\tIt's open.\n\nThe door opens and Mr. Perry walks into the room. Neil quickly rises from\nthe window.\n\n\t\t\t\tNEIL\n\t\tFather, I thought you'd gone.\n\nThe other boys stand up when he enters.\n\n\t\t\t\tBOYS\n\t\tMr. Perry.\n\n\t\t\t\tMR PERRY\n\t\tKeep your seats fellows, keep your seats. Neil, I've\n\t\tjust spoken to Mr. Nolan. I think that you're taking\n\t\ttoo many extra curricular activities this semester, and\n\t\tI've decided that you should drop the school annual.\n\n\t\t\t\tNEIL\n\t\tBut I'm the assistant editor this year.\n\n\t\t\t\tMR PERRY\n\t\tWell I'm sorry Neil.\n\n\t\t\t\tNEIL\n\t\tBut Father, I can't. It wouldn't be fair.\n\n\t\t\t\tMR PERRY\n\t\tFellas, would you excuse us for a moment?\n\nMr. Perry walks towards the door and Neil hesitantly follows. Mr. Perry\npauses by the door and smiles to the other boys.\n\nINT. HALLWAY - DAY\n\nThe smile has gone from Mr. Perry's face. He grabs a hold of Neil's arm.\n\n\t\t\t\tMR PERRY\n\t\tDon't you ever dispute me in public. Do you\n\t\tunderstand?\n\n\t\t\t\tNEIL\n\t\tFather, I wasn't disputing-\n\n\t\t\t\tMR PERRY\nAfter you've finished medical school and you're on your own, then you\ncan do as you damn well please. But until then, you do as I tell you.\nIs that clear?\n\n\t\t\t\tNEIL\n\t\tYes sir. I'm sorry.\n\n\t\t\t\tMR PERRY\n\t\tYou know how much this means to your mother,\n\t\tdon't you?\n\n\t\t\t\tNEIL\n\t\tYes sir. You know me, always taking on too much.\n\n\t\t\t\tMR PERRY\n\t\tWell, that's my boy. Now listen, you need anything,\n\t\tyou let us know, huh?\n\n\t\t\t\tNEIL\n\t\tYes sir.\n\nMr. Perry slaps his son on the shoulder and leaves. Neil leans his head\nback against the wall as the other boys emerge from the room.\n\n\t\t\t\tCHARLIE\n\t\tWhy doesn't he let you do what you want?\n\n\t\t\t\tKNOX\n\t\tYeah Neil, tell him off. It couldn't get any worse.\n\n\t\t\t\tNEIL\n\t\tOh, that's rich. Like you guys tell your parents off, Mr.\n\t\tFuture Lawyer and Mr. Future Banker.\n\n\t\t\t\tCHARLIE\n\t\tOkay, so I don't like it any more than you do.\n\n\t\t\t\tNEIL\n\t\tWell just don't tell me how to talk to my father. You\n\t\tguys are the same way.\n\n\t\t\t\tKNOX\n\t\tAll right, all right, Jesus. So what are you going to do?\n\n\t\t\t\tNEIL\n\t\tWhat I have to do. Drop the annual.\n\n\t\t\t\tCHARLIE\n\t\tWell I wouldn't lose much sleep over it. It's just a\n\t\tbunch of jerks trying to impress Nolan.\n\n\t\t\t\tNEIL\n\t\tI don't care. I don't give a damn about any of it.\n\n\t\t\t\tMEEKS\n\t\tWell, uh, Latin, eight o' clock in my room?\n\n\t\t\t\tNEIL\n\t\tYes.\n\n\t\t\t\tMEEKS\n\t\tTodd, you're welcome to join us.\n\n\t\t\t\tKNOX\n\t\tYeah, come along pal.\n\nTodd looks up from his desk where he is setting his alarm clock.\n\n\t\t\t\tTODD\n\t\tThanks.\n\nEXT. FIELDS - DAY\n\nA clock bell chimes five o'clock. Enormous flocks of birds, apparently\ndisturbed by the noise, take to the sky.\n\nINT. STAIRCASE - DAY\n\nThe sound of squawking birds merges into the sound of noisy boys as they\ndescend the stairs in a long spiralling line.\n\nMR. MCALLISTER tries to make it upstairs against the steady stream.\n\n\t\t\t\tMCALLISTER\n\t\tSlow down boys, slow down you horrible\n\t\tphalanx of pubescense.\n\nINT CHEMISTRY LAB - DAY\n\nA teacher walks up and down the aisles, handing out books.\n\n\t\t\t\tTEACHER\n\t\tPick three laboratory experiments from\n\t\tthe project list and report on them every\n\t\tfive weeks. The first twenty questions at\n\t\tthe end of chapter one are due tomorrow.\n\nThe students let out a collective groan.\n\nINT. LATIN CLASSROOM - DAY\n\nMr. McAllister paces back and forth in front of the blackboard and gets\nthe students to repeat everything he says.\n\n\t\t\t\tMCALLISTER\n\t\t\t    (students repeat after each word.)\n\t\tAgricolam. Agricola. Agricolae.\n\t\tAgricolarum. Agricolis. Agricolas.\n\t\tAgrilcolis.\n\n\t\tAgain, please.\n\t\tAgricola.\n\nINT. MATH CLASSROOM - DAY\n\nDr. Hager walks up the classroom aisles with his arms behind his back.\n\n\t\t\t\tHAGER\n\t\tYour study of trigonometry requires absolute precision.\n\t\tAnyone failing to turn in any homework assignment will\n\t\tbe penalized one point off their final grade. Let me urge\n\t\tyou now not to test me on this point.\n\nINT. KEATING'S CLASSROOM - DAY\n\nStudents enter Keating's classroom, talking and acting up. Keating\nglances out from his room off to one side.\n\n\t\t\t\tKNOX\n\t\tHey Spaz, Spaz.\n\nSpaz turns around in time to be hit by a ball of crumpled up paper\nwhile Cameron smacks him on the shoulder.\n\n\t\t\t\tCAMERON\n\t\tBrain damage.\n\nThe students quickly quiet down as Keating emerges from the other room,\nwhistling the 1812 Overture. He walks up the length of the classroom and\nout the door without a word. The students look around at one another,\nuncertain of what to do. Keating pokes his head back in the doorway.\n\n\t\t\t\tKEATING\n\t\tWell come on.\n\nHe gestures them to follow and the students, after some hesitation, grab\ntheir books and follow Keating out into the main entranceway. \n\nINT. ENTRANCEWAY - DAY\n\nKeating stands before the school's trophy cabinets and waits until all\nthe boys arrive.\n\n\t\t\t\tKEATING\n\t\t\"Oh Captain, My Captain\" who knows where\n\t\tthat comes from?\n\nTodd looks up as if he knows the answer, but says nothing. Spaz blows his\nnose a little too close to Meeks for his liking.\n\n\t\t\t\tKEATING\n\t\tNot a clue? It's from a poem by Walt\n\t\tWhitman about Mr. Abraham Lincoln. Now in\n\t\tthis class you can call me Mr. Keating. Or,\n\t\tif you're slightly more daring, Oh Captain,\n\t\tMy Captain.\n\nThe students laugh slightly.\n\n\t\t\t\tKEATING\n\t\tNow let me dispel a few rumors so they\n\t\tdon't fester into facts. Yes, I too\n\t\tattended Hell-ton and survived. And no,\n\t\tat that time I was not the mental giant\n\t\tyou see before you. I was the intellectual\n\t\tequivalent of a ninety-eight pound\n\t\tweakling. I would go to the beach and\n\t\tpeople would kick copies of Byron in my\n\t\tface.\n\nThe boys laugh once again, while Cameron, obviously trying to write all\nthis down, looks around confusedly. Keating looks down at papers in his\nhand.\n\n\t\t\t\tKEATING\n\t\tNow, Mr\u0085 Pitts. That's a rather\n\t\tunfortunate name. Mr. Pitts, where are\n\t\tyou?\n\nPitts raises his hand while everyone around him snickers.\n\n\t\t\t\tKEATING\nMr. Pitts, would you open your hymnal to page 542 and read the first\nstanza of the poem you find there?\n\n\t\t\t\tPITTS\n\t\t\"To the virgins, to make much of time\"?\n\n\t\t\t\tKEATING\n\t\tYes, that's the one. Somewhat appropriate,\n\t\tisn't it.\n\n\t\t\t\tPITTS\n\t\t\"Gather ye rosebuds while ye may, old\n\t\ttime is still a flying, and this same\n\t\tflower that smiles today, tomorrow will\n\t\tbe dying.\"\n\n\t\t\t\tKEATING\n\t\tThank you Mr. Pitts. \"Gather ye rosebuds\n\t\twhile ye may.\" The Latin term for that\n\t\tsentiment is Carpe Diem. Now who knows\n\t\twhat that means?\n\nMeeks immediately puts his hand up.\n\n\t\t\t\tMEEKS\n\t\tCarpe Diem. That's \"seize the day.\"\n\n\t\t\t\tKEATING\n\t\tVery good, Mr.-\n\n\t\t\t\tMEEKS\n\t\tMeeks.\n\n\t\t\t\tKEATING\n\t\tMeeks. Another unusual name. Seize the\n\t\tday. Gather ye rosebuds while ye may.\n\t\tWhy does the writer use these lines?\n\n\t\t\t\tCHARLIE\n\t\tBecause he's in a hurry.\n\n\t\t\t\tKEATING\n\t\tNo, ding!\n\nKeating slams his hand down on an imaginary buzzer.\n\n\t\t\t\tKEATING\n\t\tThank you for playing anyway. Because we\n\t\tare food for worms lads. Because, believe\n\t\tit or not, each and every one of us in\n\t\tthis room is one day going to stop\n\t\tbreathing, turn cold, and die. \n\nKeating turns towards the trophy cases, filled with trophies, footballs,\nand team pictures.\n\n\t\t\t\tKEATING\n\t\tNow I would like you to step forward over\n\t\there and peruse some of the faces from\n\t\tthe past. You've walked past them many\n\t\ttimes. I don't think you've really looked\n\t\tat them.\n\nThe students slowly gather round the cases and Keating moves behind them.\n\n\t\t\t\tKEATING\n\t\tThey're not that different from you, are\n\t\tthey? Same haircuts. Full of hormones,\n\t\tjust like you. Invincible, just like you\n\t\tfeel. The world is their oyster. They\n\t\tbelieve they're destined for great things,\n\t\tjust like many of you. Their eyes are full\n\t\tof hope, just like you. Did they wait until\n\t\tit was too late to make from their lives\n\t\teven one iota of what they were capable?\n\t\tBecause you see gentlmen, these boys are\n\t\tnow fertilizing daffodils. But if you listen\n\t\treal close, you can hear them whisper their\n\t\tlegacy to you. Go on, lean in.\n\nThe boys lean in and Keating hovers over Cameron's shoulder.\n\n\t\t\t\tKEATING\n\t\t\t    (whispering in a gruff voice)\n\t\tCarpe.\n\nCameron looks over his shoulder with an aggravated expression on his face. \n\n\t\t\t\tKEATING\n\t\tHear it?\n\t\t\t    (whispering again)\n\t\tCarpe. Carpe Diem. Seize the day boys,\n\t\tmake your lives extraordinary.\n\nThe boys stare at the faces in the cabinet in silence.\n\nEXT. SCHOOL STEPS - DAY\n\nThe boys emerge from the school, loaded down with numerous books.\n\n\t\t\t\tPITTS\n\t\tThat was weird.\n\n\t\t\t\tNEIL\n\t\tBut different.\n\n\t\t\t\tKNOX\n\t\tSpooky if you ask me.\n\n\t\t\t\tCAMERON\n\t\tThink he'll test us on that stuff?\n\n\t\t\t\tCHARLIE\n\t\tCome on Cameron, don't you get anything?\n\n\t\t\t\tCAMERON\n\t\tWhat? What?\n\nINT. LOCKER ROOM - EVENING\n\nA coach sticks his head around the corner into the room.\n\n\t\t\t\tCOACH\n\t\tLet's go boys, hustle up in here. That\n\t\tmeans you Dalton.\n\nMeeks emerges from the showers, drying himself off.\n\n\t\t\t\tMEEKS\n\t\tOkay, who's up for a trig study group\n\t\ttonight guys?\n\n\t\t\t\tPITTS\n\t\tMe.\n\n\t\t\t\tNEIL\n\t\tMe.\n\n\t\t\t\tCHARLIE\n\t\t\t(still annoyed by what the coach said)\n\t\tWhat?\n\n\t\t\t\tKNOX\n\t\tI can't make it guys. I have to have\n\t\tdinner at the Danburry's house.\n\n\t\t\t\tPITTS\n\t\tThe Danburry's? Who are the Danburry's?\n\n\t\t\t\tCAMERON\n\t\tBig alumns. How'd you swing that?\n\n\t\t\t\tKNOX\n\t\tFriends of my Dad's. They're probably in\n\t\ttheir nineties or something.\n\n\t\t\t\tCHARLIE\n\t\tOoh!\n\n\t\t\t\tNEIL\n\t\tAnything's better than Hell-ton hash.\n\n\t\t\t\tCHARLIE\n\t\tI'll second that.\n\n\t\t\t\tKNOX\n\t\tYeah we'll see.\n\nNeil approaches Todd, who's been sitting by the window staring down at the\nfloor. Neil snaps his fingers to get Todd's attention. \n\n\t\t\t\tNEIL\n\t\tHey, you coming to the study group tonight?\n\n\t\t\t\tTODD\n\t\tUh, no, no I, uh, I've got some history I\n\t\twanna do.\n\n\t\t\t\tNEIL\n\t\tSuit yourself.\n\nINT. TODD'S ROOM - EVENING\n\nTodd is seated at his desk. He scrawls \"CARPE DIEM\" across a blank page\nof his notebook. He looks at it for a few moments before crumpling it up\nand opening up his Chemistry book.\n\nINT. ENTRANCEWAY - NIGHT\n\nHager comes down the stairs. Knox is looking at one of the old class photos\non the walls.\n\n\t\t\t\tHAGER\n\t\tReady Overstreet?\n\nKnox reluctantly follows after Dr. Hager.\n\n\t\t\t\tKNOX\n\t\tReady to go sir.\n\nEXT. ROAD - NIGHT\n\nThe car leaves Welton and drives towards the Danburry's house.\n\nINT / EXT DANBURRY'S HOUSE - NIGHT\n\nThe doorbell rings.\n\n\t\t\t\tMRS DANBURRY (O.S.)\n\t\tChet, can you get that?\n\n\t\t\t\tCHET (O.S.)\n\t\tI can't, Mom.\n\n\t\t\t\tCHRIS (O.S.)\n\t\tI'll get it.\n\nThe door opens and Knox is awe-struck by the beautiful girl (CHRIS) who\nhas answered the door.\n\n\t\t\t\tCHRIS\n\t\tCan I help you?\n\nKnox manages to break out of his daze.\n\n\t\t\t\tKNOX\n\t\tHi. Knox Overstreet. Uh, Dr. Hager.\n\n\t\t\t\tCHRIS\n\t\tHi.\n\n\t\t\t\tKNOX\n\t\tThis is the Danburry's, right?\n\n\t\t\t\tCHRIS\n\t\tAre you here to see Chet?\n\n\t\t\t\tKNOX\n\t\tMrs. Danburry?\n\nChris begins to laugh as Mrs. Danburry arrives behind her.\n\n\t\t\t\tCHRIS\n\t\tNo.\n\n\t\t\t\tMRS DANBURRY\n\t\tSorry. Thank you Chris. I'm Mrs. Danburry.\n\t\tYou must be Knox.\n\n\t\t\t\tKNOX\n\t\tYes.\n\n\t\t\t\tMRS DANBURRY\n\t\t\t    (to Dr. Hager)\n\t\tBack by nine.\n\t\t\t    (to Knox)\n\t\tPlease come in.\n\n\t\t\t\tCHET (O.S.)\n\t\tChris, come on, what are you doing?\n\n\t\t\t\tCHRIS\n\t\tChet, I'm coming.\n\nKnox enters the house, his mind still hung up on Chris as MR DANBURRY\ncomes out of the living room to meet him.\n\n\t\t\t\tMR DANBURRY\n\t\tKnox. How are you? Joe Danburry.\n\n\t\t\t\tKNOX\n\t\tNice to meet you sir.\n\n\t\t\t\tMR DANBURRY\n\t\tWell he's the spitting image of his father,\n\t\tisn't he. How is he? Come on in.\n\n\t\t\t\tCHET (O.S.)\n\t\tChris!\n\n\t\t\t\tKNOX\n\t\tHe's great. He just did a big case for GM.\n\n\t\t\t\tCHRIS (O.S.)\n\t\tI'm coming.\n\n\t\t\t\tMR DANBURRY\n\t\tI know where you're headed, like father\n\t\tlike son, huh?\n\nINT. STUDENT LOUNGE - NIGHT\n\nSeveral students are throwing darts at a small rubber skeleton hanging\nfrom the bulletin board. Various students are studying and playing games.\nMeeks and Pitts are sitting at one table working on their \"hi-fi system\".\nMeeks is waving an antenna around with no luck. Pitts points out to him\nthat he forgot to plug it in. Neil, Cameron, and Charlie are working on\ntheir trig homework.\n\n\t\t\t\tCAMERON\n\t\tJust replace these numbers here with \"x\",\n\t\tfor \"x\" and \"y\".\n\n\t\t\t\tNEIL\n\t\tOf course.\n\n\t\t\t\tCAMERON\n\t\tOf course, so what's the problem?\n\nCharlie enters the room and closes the door behind him, leaning up\nagainst it heavily.\n\n\t\t\t\tCHARLIE\n\t\tHow was dinner?\n\n\t\t\t\tKNOX\n\t\tHuh?\n\n\t\t\t\tCHARLIE\n\t\tHow was dinner?\n\n\t\t\t\tKNOX\n\t\tTerrible. Awful.\n\nHe leaves the door and sits down with the other boys.\n\n\t\t\t\tCHARLIE\n\t\tWhy? What happened?\n\n\t\t\t\tKNOX\n\t\tTonight, I met the most beautiful girl\n\t\tin my entire life.\n\n\t\t\t\tNEIL\n\t\tAre you crazy? What's wrong with that?\n\n\t\t\t\tKNOX\n\t\tShe's practically engaged. To Chet Danburry.\n\n\t\t\t\tCHARLIE\n\t\tThat guy could eat a football.\n\n\t\t\t\tPITTS\n\t\tThat's too bad.\n\n\t\t\t\tKNOX\n\t\tToo bad? It's worse than too bad Pitsie,\n\t\tit's a tragedy. A girl this beautiful in\n\t\tlove with such a jerk.\n\n\t\t\t\tPITTS\n\t\tAll the good ones go for jerks, you\n\t\tknow that.\n\n\t\t\t\tCAMERON\n\t\tAhh, forget her. Open your trig book and\n\t\ttry and figure out problem five.\n\n\t\t\t\tKNOX\n\t\tI can't just forget her Cameron. And I\n\t\tcan't think about trig.\n\nThe radio Meeks and Pitts were working on begins letting out a high\npitched hum.\n\n\t\t\t\tPITTS\n\t\tWe got it.\n\n\t\t\t\tMEEKS\n\t\tHoly cow.\n\nMr. Hager walks into the room.\n\n\t\t\t\tHAGER\n\t\tAll right gentlemen, five minutes. Let's\n\t\tgo.\n\nThe students quickly pack up their gear and prepare to leave. Pitts tries\nto hide the radio in his lap. Charlie leans in close to Knox.\n\n\t\t\t\tCHARLIE\n\t\tDid you see her naked?\n\n\t\t\t\tKNOX\n\t\tVery funny Dalton.\n\n\t\t\t\tHAGER\n\t\tThat wouldn't be a radio in your lap,\n\t\twould it Mr. Pitts?\n\n\t\t\t\tPITTS\n\t\tNo sir. Science experiment, radar.\n\nMeeks holds up the antenna as if demonstrating it.\n\nINT. KEATING'S CLASSROOM - DAY\n\nKeating sits at his desk at the front of the classroom and opens up one\nof his books.\n\n\t\t\t\tKEATING\n\t\tGentlemen, open your text to page\n\t\ttwenty-one of the introduction. Mr.\n\t\tPerry, will you read the opening\n\t\tparagraph of the preface, entitled\n\t\t\"Understanding Poetry\"?\n\n\t\t\t\tNEIL\n\t\tUnderstanding Poetry, by Dr. J. Evans\n\t\tPritchard, Ph.D. To fully understand\n\t\tpoetry, we must first be fluent with\n\t\tits meter, rhyme, and figures of speech.\n\t\tThen ask two questions: One, how artfully\n\t\thas the objective of the poem been\n\t\trendered, and two, how important is that\n\t\tobjective. Question one rates the poem's\n\t\tperfection, question two rates its\n\t\timportance. And once these questions have\n\t\tbeen answered, determining a poem's\n\t\tgreatest becomes a relatively simple\n\t\tmatter.\n\nKeating gets up from his desk and prepares to draw on the chalk board.\n\n\t\t\t\tNEIL\n\t\tIf the poem's score for perfection is\n\t\tplotted along the horizontal of a graph,\n\t\tand its importance is plotted on the\n\t\tvertical, then calculating the total\n\t\tarea of the poem yields the measure of\n\t\tits greatness.\n\nKeating draws a corresponding graph on the board and the students\ndutifully copy it down.\n\n\t\t\t\tNEIL\n\t\tA sonnet by Byron may score high on the\n\t\tvertical, but only average on the\n\t\thorizontal. A Shakespearean sonnet, on\n\t\tthe other hand, would score high both\n\t\thorizontally and vertically, yielding a\n\t\tmassive total area, thereby revealing the\n\t\tpoem to be truly great. As you proceed\n\t\tthrough the poetry in this book, practice\n\t\tthis rating method. As your ability to\n\t\tevaluate poems in this matter grows, so\n\t\twill - so will your enjoyment and\n\t\tunderstanding of poetry.\n\nNeil sets the book down and takes off his glasses. The student sitting\nacross from him is discretely trying to eat. Keating turns away from\nthe chalkboard with a smile.\n\n\t\t\t\tKEATING\n\t\tExcrement. That's what I think of Mr. J.\n\t\tEvans Pritchard. We're not laying pipe,\n\t\twe're talking about poetry.\n\nCameron looks down at the graph he copied into his notes and quickly\nscribbles it out.\n\n\t\t\t\tKEATING\n\t\tI mean, how can you describe poetry like\n\t\tAmerican Bandstand? I like Byron, I give\n\t\thim a 42, but I can't dance to it.\n\nCharlie suddenly appear to become interested in the class.\n\n\t\t\t\tKEATING\n\t\tNow I want you to rip out that page.\n\nThe students look at Keating as if he has just gone mad.\n\n\t\t\t\tKEATING\n\t\tGo on, rip out the entire page. You heard\n\t\tme, rip it out. Rip it out!\n\nCharlie looks around at the others. He then looks down at his own notes,\nwhich consists of drawing breasts.\n\n\t\t\t\tKEATING\n\t\tGo on, rip it out.\n\nCharlie rips the page out and holds it up.\n\n\t\t\t\tKEATING\n\t\tThank you Mr. Dalton. Gentlemen, tell you\n\t\twhat, don't just tear out that page, tear\n\t\tout the entire introduction. I want it\n\t\tgone, history. Leave nothing of it. Rip\n\t\tit out. Rip! Begone J. Evans Pritchard,\n\t\tPh.D. Rip, shred, tear. Rip it out. I\n\t\twant to hear nothing but ripping of Mr.\n\t\tPritchard.\n\nMeeks looks around reluctantly and then finally begins tearing out pages.\n\n\t\t\t\tKEATING\n\t\tWe'll perforate it, put it on a roll.\n\nKeating sees Cameron still hesitating.\n\n\t\t\t\tKEATING\n\t\tIt's not the bible, you're not going to\n\t\tgo to hell for this. Go on, make a clean\n\t\ttear, I want nothing left of it.\n\nKeating goes over to his room. Cameron turns around to Neil.\n\n\t\t\t\tCAMERON\n\t\tWe shouldn't be doing this.\n\n\t\t\t\tNEIL\n\t\tRip, rip, rip!\n\nNeil makes Cameron turn back around.\n\n\t\t\t\tKEATING (O.S.)\n\t\tRip it out, rip!\n\nFrom outside the classroom, Mr. McAllister hears all the noise and sees\nall the students ripping out the pages. He bursts into the room.\n\n\t\t\t\tMCALLISTER\n\t\tWhat the hell is going on here?\n\nThe boys all turn around in shock. Charlie stuffs a crumpled page into his\nmouth. Keating emerges from his room with a waste paper basket.\n\n\t\t\t\tKEATING\n\t\tI don't hear enough rips.\n\n\t\t\t\tMCALLISTER\n\t\tMr. Keating.\n\n\t\t\t\tKEATING\n\t\tMr. McAllister.\n\n\t\t\t\tMCALLISTER\n\t\tI'm sorry, I- I didn't know you were\n\t\there.\n\n\t\t\t\tKEATING\n\t\tI am.\n\n\t\t\t\tMCALLISTER\n\t\tAhh, so you are. Excuse me.\n\nMr. McAllister slowly backs out of the classroom.\n\n\t\t\t\tKEATING\n\t\tKeep ripping gentlemen. This is a battle,\n\t\ta war. And the casualties could be your\n\t\thearts and souls. \n\nKeating holds out the basket to Charlie who spits out a wad of paper.\n\n\t\t\t\tKEATING\n\t\tThank you Mr. Dalton. Armies of academics\n\t\tgoing forward, measuring poetry. No, we\n\t\twill not have that here. No more of Mr.\n\t\tJ. Evans Pritchard. Now in my class you\n\t\twill learn to think for yourselves again.\n\t\tYou will learn to savor words and language.\n\t\tNo matter what anybody tells you, words and\n\t\tideas can change the world. I see that look\n\t\tin Mr. Pitt's eye, like nineteenth century\n\t\tliterature has nothing to do with going to\n\t\tbusiness school or medical school. Right?\n\t\tMaybe. Mr. Hopkins, you may agree with him, \n\t\tthinking \"Yes, we should simply study our\n\t\tMr. Pritchard and learn our rhyme and meter\n\t\tand go quietly about the business of\n\t\tachieving other ambitions.\" I have a little\n\t\tsecret for ya. Huddle up. Huddle up! \n\nThe boys get up from their seats and gather around Keating in the center\nof the class.\n\n\t\t\t\tKEATING\n\t\tWe don't read and write poetry because\n\t\tit's cute. We read and write poetry\n\t\tbecause we are members of the human race.\n\t\tAnd the human race is filled with passion.\n\t\tMedicine, law, business, engineering,\n\t\tthese are all noble pursuits, and necessary\n\t\tto sustain life. But poetry, beauty,\n\t\tromance, love, these are what we stay alive\n\t\tfor. To quote from Whitman: \"O me, o life\n\t\tof the questions of these recurring, of the\n\t\tendless trains of the faithless, of cities\n\t\tfilled with the foolish. What good amid\n\t\tthese, o me, o life? Answer: that you are\n\t\there. That life exists, and identity.\n\t\tThat the powerful play goes on, and you\n\t\tmay contribute a verse. That the powerful\n\t\tplay goes on and you may contribute a verse.\n\nKeating looks up at Todd.\n\n\t\t\t\tKeating\n\t\tWhat will your verse be?\n\nINT. HEAD OF CAFETERIA - DAY\n\nThe cafeteria is filled with students and teachers standing before the tables saying grace.\n\n\t\t\t\tALL\n\t\tFor what we are about to receive, may the\n\t\tLord make us truly grateful. Amen.\n\nMr. Keating and Mr. McAllister are seated next to one another at the table.\n\n\t\t\t\tMCALLISTER\n\t\tQuite an interesting class you gave today,\n\t\tMr. Keating.\n\n\t\t\t\tKEATING\n\t\tI'm sorry if I shocked you, Mr. McAllister.\n\n\t\t\t\tMCALLISTER\n\t\tOh, there's no need to apologize. It was\n\t\tvery fascinating, misguided though it was.\n\n\t\t\t\tKEATING\n\t\tYou think so?\n\n\t\t\t\tMCALLISTER\n\t\tYou take a big risk by encouraging them to\n\t\tbe artists John. When they realize they're\n\t\tnot Rembrandts, Shakespeares or Mozarts,\n\t\tthey'll hate you for it.\n\n\t\t\t\tKEATING\n\t\tWe're not talking artists George, we're\n\t\ttalking free thinkers.\n\n\t\t\t\tMCALLISTER\n\t\tFree thinkers at seventeen?\n\n\t\t\t\tKEATING\n\t\tFunny, I never pegged you as a cynic.\n\n\t\t\t\tMCALLISTER\n\t\t\t  (taken aback by the comment)\n\t\tNot a cynic, a realist. Show me the heart\n\t\tunfettered by foolish dreams, and I'll\n\t\tshow you a happy man.\n\n\t\t\t\tKEATING\n\t\tBut only in their dreams can man be truly\n\t\tfree. 'Twas always thus, and always thus\n\t\twill be.\n\n\t\t\t\tMCALLISTER\n\t\tTennyson?\n\n\t\t\t\tKEATING\n\t\tNo, Keating.\n\nKeating winks and Mr. McAllister can't help but laugh.\n\nINT. CAFETERIA TABLE - DAY\n\nNeil joins the others at the table. He pulls out a yearbook.\n\n\t\t\t\tNEIL\n\t\tHey, I found his senior annual in the\n\t\tlibrary.\n\nHe hands the annual over to Cameron who laughs at the younger picture of Keating.\n\n\t\t\t\tNEIL\n\t\tListen to this, captain of the soccer team,\n\t\teditor of the school annual, Cambridge\n\t\tbound, Thigh man, and the Dead Poets Society.\n\n\t\t\t\tCAMERON\n\t\t\t    (reading from the annual)\n\t\tMan most likely to do anything.\n\n\t\t\t\tCHARLIE\n\t\tThigh man. Mr. K was a hell-raiser.\n\n\t\t\t\tKNOX\n\t\tWhat's the Dead Poets Society?\n\n\t\t\t\tNEIL\n\t\tI don't know.\n\n\t\t\t\tMEEKS\n\t\tIs there a picture in the annual?\n\n\t\t\t\tNEIL\n\t\tNothing. No other mention of it.\n\n\t\t\t\tMR. NOLAN (O.S.)\n\t\tThat boy there, see me after lunch.\n\nCameron quickly puts the annual away and the others all return to their meal.\n\nEXT. WELTON GROUNDS - DAY\n\nKeating is walking down towards the lake, whistling the same tune as before.\nThe boys emerge from the building and chase after him.\n\n\t\t\t\tNEIL\n\t\tMr. Keating? Mr. Keating? Sir? Oh Captain,\n\t\tMy Captain?\n\nKeating immediately turns around.\n\n\t\t\t\tKEATING\n\t\tGentlemen.\n\n\t\t\t\tNEIL\n\t\tWe were just looking in your old annual.\n\nHe hands Keating the annual and Keating looks at his old photograph.\n\n\t\t\t\tKEATING\n\t\tOh my God. No, that's not me. Stanley\n\t\t\"The Tool\" Wilson-\n\nKeating crouches down and continues looking through the book.\n\n\t\t\t\tKEATING\n\t\tGod.\n\nNeil crouches down next to Keating.\n\n\t\t\t\tNEIL\n\t\tWhat was the Dead Poets Society?\n\n\t\t\t\tKEATING\n\t\tI doubt the present administration would\n\t\tlook too favorably upon that.\n\n\t\t\t\tNEIL\n\t\tWhy? What was it?\n\n\t\t\t\tKEATING\n\t\tGentlemen, can you keep a secret?\n\n\t\t\t\tNEIL\n\t\tSure.\n\nThe other boys crouch down around Keating.\n\n\t\t\t\tKEATING\n\t\tThe Dead Poets were dedicated to sucking\n\t\tthe marrow out of life. That's a phrase\n\t\tfrom Thoreau that we'd invoke at the\n\t\tbeginning of each meeting. You see we'd\n\t\tgather at the old Indian cave and take\n\t\tturns reading from Thoreau, Whitman,\n\t\tShelley; the biggies. Even some of our\n\t\town verse. And in the enchantment of the\n\t\tmoment we'd let poetry work its magic.\n\n\t\t\t\tKNOX\n\t\tYou mean it was a bunch of guys sitting\n\t\taround reading poetry?\n\n\t\t\t\tKEATING\n\t\tNo Mr. Overstreet, it wasn't just \"guys\",\n\t\twe weren't a Greek organization, we were\n\t\tromantics. We didn't just read poetry,\n\t\twe let it drip from our tongues like honey.\n\t\tSpirits soared, women swooned, and gods\n\t\twere created, gentlemen, not a bad way to\n\t\tspend an evening eh? Thank you Mr. Perry\n\t\tfor this trip down amnesia lane. Burn that,\n\t\tespecially my picture.\n\nKeating hands the annual back and walks away, whistling once again. Neil\nremains crouched.\n\n\t\t\t\tNEIL\n\t\tDead Poets Society.\n\n\t\t\t\tCAMERON\n\t\tWhat?\n\nThe school bells begin ringing and everyone heads back towards the school.\nNeil stands up.\n\n\t\t\t\tNEIL\n\t\tI say we go tonight.\n\n\t\t\t\tCHARLIE\n\t\tTonight?\n\n\t\t\t\tCAMERON\n\t\tWait a minute.\n\n\t\t\t\tPITTS\n\t\tWhere's this cave he's talking about?\n\n\t\t\t\tNEIL\n\t\tIt's beyond the stream. I know where it\n\t\tis.\n\n\t\t\t\tPITTS\n\t\tThat's miles.\n\n\t\t\t\tCAMERON\n\t\tSounds boring to me.\n\n\t\t\t\tCHARLIE\n\t\tDon't go.\n\n\t\t\t\tCAMERON\n\t\tYou know how many de-merits we're talking\n\t\tDalton\n\n\t\t\t\tCHARLIE\n\t\tSo don't come, please.\n\n\t\t\t\tCAMERON\n\t\tLook, all I'm saying is that we have to\n\t\tbe careful, we can't get caught.\n\n\t\t\t\tCHARLIE\n\t\tNo shit, Sherlock.\n\n\t\t\t\tHAGER\n\t\t\t\t(yelling)\n\t\tYou boys there, hurry up.\n\nNeil turns around and faces the other boys.\n\n\t\t\t\tNEIL\n\t\tAll right, who's in?\n\n\t\t\t\tCAMERON\n\t\tCome on Neil, Hager's right-\n\n\t\t\t\tNEIL\n\t\tForget Hager, no. Who's in?\n\n\t\t\t\tCHARLIE\n\t\tI'm in.\n\n\t\t\t\tHAGER (O.S.)\n\t\tI'm warning you, move.\n\n\t\t\t\tCAMERON\n\t\tMe too.\n\n\t\t\t\tPITTS\n\t\tI don't know Neil\n\n\t\t\t\tNEIL\n\t\tWhat? Pitts-\n\n\t\t\t\tCHARLIE\n\t\tPitsie, come on.\n\n\t\t\t\tMEEKS\n\t\tHis grades are hurting Charlie.\n\n\t\t\t\tNEIL\n\t\tYou can help him Meeks.\n\n\t\t\t\tPITTS\n\t\tWhat is this, a midnight study group?\n\n\t\t\t\tNEIL\n\t\tForget it Pitts, you're coming. Meeks,\n\t\tare your grades hurting too?\n\n\t\t\t\tMEEKS\n\t\tI'll try anything once.\n\n\t\t\t\tCHARLIE\n\t\tExcept sex.\n\n\t\t\t\tMEEKS\n\t\tHa ha ha.\n\n\t\t\t\tCAMERON\n\t\tI mean as long as we're careful.\n\nThe boys run into the building.\n\n\t\t\t\tCHARLIE\n\t\tWhat about you Knox?\n\n\t\t\t\tKNOX\n\t\tI don't know Charlie.\n\n\t\t\t\tCHARLIE\n\t\tCome on Knox, it'll help you get Chris.\n\n\t\t\t\tKNOX\n\t\tYeah? How?\n\n\t\t\t\tCHARLIE\n\t\tWomen swoon.\n\nCharlie laughs and runs inside. Knox chases after him.\n\n\t\t\t\tKNOX\n\t\tBut why do they swoon? Charlie, tell me\n\t\twhy they swoon. Charlie!\n\nINT LIBRARY - DAY\n\nThe boys are all gathered around one of the tables with a map laid out\non it.\n\n\t\t\t\tNEIL\n\t\t\t    (whispering)\n\t\tOkay, follow the stream to the waterfall.\n\t\tIt's right there. It's got to be on the\n\t\tbanks.\n\n\t\t\t\tCAMERON\n\t\tI don't know, it's starting to sound\n\t\tdangerous.\n\n\t\t\t\tCHARLIE\n\t\tWell, why don't you stay home?\n\n\t\t\t\tMCALLISTER\n\t\tFor God's sake stop chattering and\n\t\tsit down.\n\nThe boys take their seats once again and Neil goes over and sits next to\nTodd, who is sitting by himself.\n\n\t\t\t\tNEIL\n\t\tTodd, are you coming tonight?\n\n\t\t\t\tTODD\n\t\tNo.\n\n\t\t\t\tNEIL\n\t\tWhy not? God, you were there. You heard\n\t\tKeating. Don't you want to do something\n\t\tabout it?\n\n\t\t\t\tTODD\n\t\tYes, but-\n\n\t\t\t\tNEIL\n\t\tBut? But what?\n\n\t\t\t\tTODD\n\t\tKeating said that everybody took turns\n\t\treading and I don't want to do that.\n\n\t\t\t\tNEIL\n\t\tGosh, you really have a problem with\n\t\tthat, don't you?\n\n\t\t\t\tTODD\n\t\tN- no, I don't have a problem. Neil,\n\t\tI just- I just don't want to do it,\n\t\tokay?\n\n\t\t\t\tNEIL\n\t\tAll right. What if you didn't have to\n\t\tread? What if you just came and\n\t\tlistened?\n\n\t\t\t\tTODD\n\t\tThat's not how it works.\n\n\t\t\t\tNEIL\n\t\tForget how it works. What if - what if\n\t\tthey said it was okay?\n\n\t\t\t\tTODD\n\t\tWhat? What are you gonna do, go up and\n\t\task them?\n\nNeil shrugs.\n\n\t\t\t\tTODD\n\t\tNo. No, Neil.\n\n\t\t\t\tNEIL\n\t\tI'll be right back.\n\n\t\t\t\tTODD\n\t\tNeil, Neil!\n\nNeil gets up and rejoins the others. McAllister hears the boys whispering\nagain.\n\n\t\t\t\tMCALLISTER\n\t\tOh shut up, will you.\n\nINT BATHROOM - NIGHT\n\nVarious boys are crowded around the sinks getting ready for bed. Someone\nis playing snake charmer music on a kazoo while someone else is bothering\nSpaz with a red sock puppet acting like a snake.\n\n\t\t\t\tSPAZ\n\t\tThat's my- that's for my asthma, okay.\n\t\tCould you give that back please? Could\n\t\tyou give that back?\n\n\t\t\t\tBOY\n\t\tWhat's the matter? Don't you like snakes?\n\nNeil enters and taps Todd on the shoulder.\n\n\t\t\t\tNEIL\n\t\tYou're in.\n\n\t\t\t\tSPAZ\n\t\tGet away from me, okay?\n\n\t\t\t\tBOY\n\t\tSpaz, why don't you check your pocket,\n\t\thuh? Come on Spaz I have to brush my\n\t\tteeth\n\n\t\t\t\tSPAZ\n\t\tGet a- get off, \n\nHager walks past the bathroom and into his room.\n\n\t\t\t\tHAGER\n\t\tCut out that racket in there.\n\nThe kazoo player lets out a rude squeek before finally stopping. Hager\nglares at them for a moment.\n\nINT NEIL'S BEDROOM - NIGHT\n\nNeil stands in his doorway. He looks across the hall to the other room\nwhere Cameron and Charlie are standing. Cameron gives a thumbs up. Neil\ncloses his room door and takes out his cloak and a flashlight. Setting\nthe flashlight down on the desk, he notices a worn book, \"Five\nCenturies of Verse\", sitting there. Opening it up, he sees John Keating's\nname at the top followed by \"Dead Poets\". Below the title of the book,\nis written: \"To Be Read At The Opening of D.P.S. Meetings.\" Along with\nseveral lines from Thoreau, beginning with \"I went to the woods because\nI wanted to live deliberately\u0085\"\n\nINT STAIRWAY - NIGHT\n\nThe shadows of hooded figures can be seen moving throughout the darkened\nhalls.\n\nINT HAGER'S ROOM - NIGHT\n\nHager hears a dog barking.\n\nINT HALLWAY - NIGHT\n\nSomeone drops a number of dog biscuits by the dog's feet. He stops\nbarking and immediately begins gobbling them down. Hager looks out\ninto the hallway with his flashlight but sees nothing.\n\nEXT SCHOOL GROUNDS - NIGHT\n\nThe boys quietly leave the building and set off running across the\nfields towards the woods.\n\nEXT WOODS - NIGHT\n\nThe boys search about the trees trying to find the cave. Meeks is\nsearching around when Charlie leaps up behind Meeks in the dark\nshining the flashlight up at his own face and grabs Meeks by the\nshoulder.\n\n\t\t\t\tCHARLIE\n\t\tArrr, I'm a dead poet.\n\n\t\t\t\tMEEKS\n\t\tAww, Charlie.\n\n\t\t\t\tCHARLIE\n\t\t\t    (laughing)\n\t\tGuys, over here.\n\n\t\t\t\tMEEKS\n\t\tYou're funny. You're real funny.\n\nINT CAVE - NIGHT\n\nThe boys are trying to start a fire. The cave is quickly filling up with\nsmoke.\n\n\t\t\t\tMEEKS\n\t\tIt's too wet.\n\nCHARLIE\n\t\tGod, are you trying to smoke us out of\n\t\there?\n\n\t\t\t\tMEEKS\n\t\tNo, no, the smoke's going right up this\n\t\topening.\n\nPitts tries to stand up and slams his head into the low rock ceiling. He\nlets out a yell while the others laugh.\n\n\t\t\t\tNEIL\n\t\tYou okay?\n\n\t\t\t\tPITTS\n\t\tOh God. Clowns.\n\n\t\t\t\tNEIL\n\t\tAll right, all right, forget the fire.\n\t\tLet's go gentlemen.\n\nNeil stands before the others with the book in hand, and takes a drag\non a cigarette.\n\n\t\t\t\tNEIL\n\t\tI hereby reconvene the Dead Poets\n\t\tSociety.\n\nThe boys cheer.\n\n\t\t\t\tNEIL\n\t\tWelton chapter. The meetings will be\n\t\tconducted by myself and the other new\n\t\tinitiates now present. Todd Anderson,\n\t\tbecause he prefers not to read, will\n\t\tkeep minutes of the meetings. I'll now\n\t\tread the traditional opening message by\n\t\tsociety member Henry David Thoreau. \"I\n\t\twent to the woods because I wanted to\n\t\tlive deliberately. I wanted to live deep\n\t\tand suck out all the marrow of life.\"\n\n\t\t\t\tCHARLIE\n\t\tI'll second that.\n\n\t\t\t\tNEIL\n\t\t\"To put to rout all that was not life,\n\t\tand not, when I had come to die,\n\t\tdiscover that I had not lived.\n\nSeveral boys whistle softly in reaction to the poem.\n\n\t\t\t\tNEIL\n\t\tAnd Keating's marked a bunch of other\n\t\tpages.\n\nNeil begins flipping through the book.\n\n\t\t\t\tCHARLIE\n\t\tAll right, intermission. Dig deep right\n\t\there. Right here, lay it down\n\n\t\t\t\tCAMERON\n\t\tOn the mud? We're gonna put our food on\n\t\tthe mud?\n\n\t\t\t\tCHARLIE\n\t\tMeeks, put your coat down. Picnic blanket.\n\n\t\t\t\tMEEKS\n\t\tYes sir, use Meeks' coat.\n\n\t\t\t\tCHARLIE\n\t\tDon't keep anything back either. You\n\t\tguys are always bumming my smokes.\n\nMeeks lays his coat down and everyone dumps their food on it. Amongst\nthe pile are chocolate chip cookies, a box of raisins, a few apples, an\norange, and half a roll.\n\n\t\t\t\tNEIL\n\t\tRaisins?\n\n\t\t\t\tKNOX\n\t\tYuck.\n\n\t\t\t\tCHARLIE\n\t\tWait a minute, who gave us half a roll?\n\n\t\t\t\tPITTS\n\t\t\t  (talking with his mouth full)\n\t\tI'm eating the other half.\n\n\t\t\t\tCHARLIE\n\t\tCome on.\n\n\t\t\t\tPITTS\n\t\tYou want me to put it back?\n\nINT CAVE - NIGHT\n\nNeil, lit up by a flashlight, begins to tell everyone a story.\n\n\t\t\t\tNEIL\n\t\tIt was a dark and rainy night, and this\n\t\told lady, who had a passion for jigsaw\n\t\tpuzzles, sat by herself in her house at\n\t\ther table to complete a new jigsaw puzzle.\n\t\tBut as she pieced the puzzle together, she\n\t\trealized, to her astonishment, that the\n\t\timage that was formed was her very own\n\t\troom. And the figure in the center of the\n\t\tpuzzle, as she completed it, was herself.\n\t\tAnd with trembling hands, she placed the\n\t\tlast four pieces and stared in horror at\n\t\tthe face of a demented madman at the\n\t\twindow. The last thing that this old lady\n\t\tever heard was the sound of breaking glass.\n\n\t\t\t\tBOYS\n\t\tOhhh\u0085 no\u0085\n\n\t\t\t\tNEIL\n\t\tThis is true, this is true.\n\n\t\t\t\tCAMERON\n\t\tI've got one that's even better than\n\t\tthat.\n\n\t\t\t\tCHARLIE\n\t\tHa!\n\n\t\t\t\tCAMERON\n\t\tI do. There's a young, married couple,\n\t\tand they're driving through the forest\n\t\tat night on a long trip. And they run\n\t\tout of gas, and there's a madman on the-\n\n\t\t\t\tCHARLIE\n\t\tThe thing with the hand-\n\nAll the boys react, recalling the story and miming the scraping on the\nroof of the car.\n\n\t\t\t\tCAMERON\n\t\tI love that story.\n\n\t\t\t\tCHARLIE\n\t\tI told you that one.\n\n\t\t\t\tCAMERON\n\t\tYou did not. I got that in camp in\n\t\tsixth grade.\n\n\t\t\t\tCHARLIE\n\t\tWhen were you in six, last year?\n\nAs everyone's voices begin to calm down, Pitts begins reading from the\nbook.\n\n\t\t\t\tPITTS\n\t\t\"In a mean abode in the shanking road,\n\t\tlived a man named William Bloat. Now,\n\t\the had a wife, the plague of his life,\n\t\twho continually got his goat. And one\n\t\tday at dawn, with her nightshift on,\n\t\the slit her bloody throat.\"\n\nThe boys laugh.\n\n\t\t\t\tPITTS\n\t\tOh, and it gets worse.\n\n\t\t\t\tCHARLIE\n\t\tYou want to hear a real poem?\n\nMeeks hands Charlie the book but he shoves it away.\n\n\t\t\t\tCHARLIE\n\t\tAll right? No, I don't need it. You take \n\t\tit. \n\n\t\t\t\tMEEKS\n\t\tWhat, did you bring one? \n\n\t\t\t\tNEIL\n\t\tYou memorized a poem? \n\n\t\t\t\tCHARLIE\n\t\tI didn't memorize a poem. Move up.\n\nNeil moves to the side as Charlie stands and takes his spot.\n\n\t\t\t\tMEEKS\n\t\tAn original piece by Charlie Dalton. \n\n\t\t\t\tKNOX\n\t\tAn original piece. \n\n\t\t\t\tPITTS\n\t\tTake center stage. \n\n\t\t\t\tNEIL\n\t\tYou know this is history. Right? This is \n\t\thistory.\n\nCharlie clears his throat and pulls out a page from a magazine and \nslowly unfolds it, revealing a Playboy centerfold (Elaine Reynolds,\nMiss October, 1959)\n\n\t\t\t\tMEEKS\n\t\tOh, wow. \n\n\t\t\t\tCAMERON\n\t\tWhere did you get that? \n\n\t\t\t\tCHARLIE\n\n\t\tTeach me to love? Go teach thyself more \n\t\twit.\n\t\tI, chief professor, am of it.\n\nNeil gets up and looks over Charlie's shoulder to see what he is\nreading.\n\n\t\t\t\tCHARLIE\n\t\tThe god of love, if such a thing there \n\t\tbe, may learn to love from me.\n\nCharlie winks at the guys and they clap and cheer.\n\n\t\t\t\tNEIL\n\t\tWow! Did you write that?\n\nCharlie turns over the centerfold to show where he had written down\nthe poem.\n\n\t\t\t\tCHARLIE\n\t\tAbraham Cowley. Okay, who's next? \n\nNeil sits reading from the book by flashlight.\n\n\t\t\t\tNEIL\n\t\tAlfred Lord Tennyson. \n\t\tCome my friends, \n\t\t'Tis not too late to seek a newer world \n\t\tfor my purpose holds to sail beyond the \n\t\tsunset. \n\t\tAnd though we are not now that strength \n\t\twhich in old days \n\t\tMoved earth and heaven; that which we \n\t\tare, we are;-- \n\t\tOne equal temper of heroic hearts, \n\t\tMade weak by time and fate, but strong \n\t\tin will. \n\t\tTo strive, to seek, to find, and not to \n\t\tyield. \n\nMeeks takes center stage and begins reading a poem like he is \nperforming a chant.\n\n\t\t\t\tMEEKS\n\t\tThen I had religion, then I had a \n\t\tvision. \n\t\tI could not turn from their revel in \n\t\tderision. \n\t\tThen I saw the Congo creeping through \n\t\tthe black, \n\t\tcutting through the forest with a golden \n\t\ttrack. \n\t\tThen I saw the Congo creeping through \n\t\tthe black- \n\n\t\t\t\tCHARLIE\n\t\tMeeks, Meeks. \n\n\t\t\t\tMEEKS\n\n\t\t...cutting through the forest with a \n\t\tgolden track.\n\t\tThen I saw the Congo creeping through \n\t\tthe black, \n\t\tcutting through the forest with a golden \n\t\ttrack.\n\nKnox picks up a metal container and begins using it as a drum. The\nother boys stand and begin going in a circle, making music with\nsticks of wood, combs, etc.\n\n\t\tThen I saw the Congo creeping through \n\t\tthe black, \n\t\tcutting through the forest with a golden \n\t\ttrack. \n\t\tThen I saw the Congo creeping through \n\t\tthe black, \n\t\tcutting through the forest with a golden \n\t\ttrack. \n\n\t\t\t\tBOYS\n\n\t\tThen I saw the Congo creeping through \n\t\tthe black, \n\t\tcutting through the forest with...\n\nThe boys continue to chant the chorus as they emerge from the\ncave.\n\nEXT. CAMPUS - NIGHT\nThe clock tolls two as the boys silently run back to their dorm.\n\nINT. KEATING'S CLASSROOM - DAY\n\nKeating is walking to the front of the classroom filled with students.\n\n\t\t\t\tKEATING\n\t\tA man is not very tire, he is exhausted.\n\t\tAnd don't use very sad, use-\n\nHe points to the back of the classroom.\n\n\t\t\t\tKEATING\n\t\tCome on, Mr. Overstreet, you twerp, \n\t\t\t\tKNOX\n\t\tMorose? \n\n\t\t\t\tKEATING\n\t\tExactly! Morose. Now, language was \n\t\tdeveloped for one endeavor, and that is? \n\t\tMr. Anderson? Come on! Are you a man or \n\t\tan amoeba?\n\nKeating stands before Todd's desk. Todd looks up nervously but\nsays nothing. Keating paused for a moment before looking away.\n\n\t\t\t\tKEATING\n\t\tMr. Perry? \n\n\t\t\t\tNEIL\n\t\tUh, to communicate. \n\n\t\t\t\tKEATING\n\t\tNo! To woo women. Today we're going to \n\t\tbe talking about William Shakespeare. \n\nThe class lets out a collective sigh.\n\t\t\t\tBOY\n\t\tOh, God! \n\n\t\t\t\tKEATING\n\t\tI know. A lot of you looked forward to \n\t\tthis about as much as you look forward \n\t\tto root canal work. We're gonna talk \n\t\tabout Shakespeare as someone who writes \n\t\tsomething very interesting. Now, many of \n\t\tyou have seen Shakespeare done very much \n\t\tlike this:\n\nKeating holds out his right arm dramtically and begins to\nspeak in an exaggerated British accent.\n\n\t\t\"O Titus, bring your friend hither.\" But\n\t\tif any of you have seen Mr. Marlon Brando,\n\t\tyou know, Shakespeare can be different. \n\t\t\"Friend, Romans, countrymen, lend me your\n\t\tears.\" You can also imagine, maybe, John\n\t\tWayne as Macbeth going, \"Well, is this a \n\t\tdagger I see before me?\"\n\nINT. KEATING'S CLASSROOM - DAY\n\nThe students are all seated together near the front of the room as\nKeating reads from a book.\n\n\t\t\t\tKEATING\n\t\t\"Dogs, sir? Oh, not just now. I do enjoy \n\t\ta good dog once in a while, sir. You can \n\t\thave yourself a three-course meal from \n\t\tone dog. Start with your canine \n\t\tcrudites, go to your Fido flambe for \n\t\tmain course and for dessert, a Pekingese \n\t\tparfait. And you can pick your teeth \n\t\twith a little paw.\"\n\nINT. KEATING'S CLASSROOM - DAY\n\nThe students are all back in their normal seats and Keating leaps\nup onto his desk.\n\n\t\t\t\tKEATING\n\t\tWhy do I stand up here? Anybody? \n\n\t\t\t\tCHARLIE\n\t\tTo feel taller. \n\n\t\t\t\tKEATING\n\t\tNo!\nKeating rings the bell on his desk with his foot\n\n\t\t\t\tKEATING\n\t\tThank you for playing, Mr. Dalton. I \n\t\tstand upon my desk to remind yourself \n\t\tthat we must constantly look at things \n\t\tin a different way. \n\nKeating glances around the classroom from atop the desk.\n\n\t\t\t\tKEATING\n\t\tYou see, the world looks very different \n\t\tfrom up here. You don't believe me? Come \n\t\tsee for yourself. Come on. Come on! \n\nCharlie and Neil quickly rise from their seats to go to the front\nof the classroom. The rest of the class follows them. While Keating\ncontinues speaking, Neil and Charlie join him on the desk and then\nKeating jumps down.\n\n\n\t\t\t\tKEATING\n\t\tJust when you think you know something, \n\t\tyou have to look at it in another way. \n\t\tEven though it may seem silly or wrong, \n\t\tyou must try! Now, when you read, don't \n\t\tjust consider what the author thinks. \n\t\tConsider what you think. \n\n\t\t\t\tKEATING\n\t\tBoys, you must strive to find your own \n\t\tvoice. Because the longer you wait to \n\t\tbegin, the less likely you are to find \n\t\tit at all. Thoreau said, \"Most men lead \n\t\tlives of quiet desperation.\" Don't be \n\t\tresigned to that. Break out!\n\nKeating notices Spaz and another boy leaving the desk immediately.\n\n\t\t\t\tKEATING\n\t\tDon't just walk off the edge like lemmings.\n\t\tLook around you. \n\nThe school bell rings as the boys continue to climb onto the desk.\nKeating begins to gather up his stuff. The clock begins to toll as\nKeating walks to the back of the class.\n\n\t\t\t\tKEATING\n\t\tThere! There you go, Mr. Priske. Thank \n\t\tyou! Yes! Dare to strike out and find \n\t\tnew ground. Now, in addition to your \n\t\tessays, I would like you to compose a \n\t\tpoem of your own, an original work.\n\nThe students begin to groan. Keating begins flickering the lights\noff and on while chanting ominously.\n\n\t\t\t\tKEATING\n\t\tThat's right! You have to deliver it \n\t\taloud in front of the class on Monday. \n\t\tBonne chance, gentlemen. \n\nKeating steps out into the hall before quickly peeking back in once again.\nTodd is the last one to stand on the desk and is about to jump off.\n\n\t\t\t\tKEATING\n\t\tMr. Anderson? Don't think that I don't \n\t\tknow that this assignment scares the \n\t\thell out of you, you mole.\n\nKeating flicks the light off, leaving Todd to jump down in the darkness\nas the students laugh.\n\nEXT. RIVER - DAY\n\nCameron, Charlie, and several other boys are rowing while Mr. Nolan\nshouts orders from a bullhorn.\n\n\t\t\t\tMR. NOLAN\n\t\tTake a power train in two! Three! Keep \n\t\tyour eyes in the boat!\n\nEXT. CAMPUS ROOFTOP - DAY\n\nNoisy static is replaced by music as Pitts climbs down form the peak to\njoin Meeks at their makeshift radio.\n\n\t\t\t\tMEEKS\n\t\tWe got it, Pittsie. We got it! Radio \n\t\tFree America! \n\n\nEXT CAMPUS - DAY\n\nSeveral students are fencing on a grassy slope.\n\nEXT. CAMPUS ROOFTOP - DAY\n\nMeeks and Pitts perform a goofy dance together to the music.\n\nINT. TODD'S ROOM - DAY\n\nTodd is on his bed trying to write a poem. The door opens and Todd\nturns his writing pad over. Neil enters the room laughing. He crouches\ndown next to Todd's bed and plunks a sheet of paper in Todd's lap.\n\n\n\t\t\t\tNEIL\n\t\tI found it. \n\n\t\t\t\tTODD\n\t\tYou found what? \n\n\t\t\t\tNEIL\n\t\tWhat I wanna do right now. What's \n\t\treally, really inside me. \n\n\t\t\t\tTODD\n\t\t\"A Midsummer Night's Dream\"? \n\n\t\t\t\tNEIL\n\t\tThis is it. \n\n\t\t\t\tTODD\n\t\tWhat is this? \n\n\t\t\t\tNEIL\n\t\tIt's a play, dummy. \n\n\t\t\t\tTODD\n\t\tI know that. I-- Wh-Wh-What does it have \n\t\tto do with you? \n\n\t\t\t\tNEIL\n\t\tRight. They're putting it on at Henley \n\t\tHall. Open tryouts. Open tryouts! \n\n\t\t\t\tTODD\n\t\tYes, so?\n\nNeil pounds on the bed and then pulls a blanket off his bed,\nwearing it like a cloak.\n\n\t\t\t\tNEIL\n\t\tSo, I'm gonna act. Yes, yes! I'm gonna \n\t\tbe an actor! Ever since I can remember, \n\t\tI've wanted to try this. I even tried to \n\t\tgo to summer stock auditions last year, \n\t\tbut, of course, my father wouldn't let \n\t\tme. For the first time in my whole life \n\t\tI know what I wanna do.\n\nNeil grabs a handful of papers off Todd's bed and tosses them into\nthe air.\n\n\t\t\t\tNEIL\n\t\tand for the first time I'm gonna do it \n\t\twhether my father wants me to or not!\n\t\tCarpe diem! \n\n\t\t\t\tTODD\n\t\tNeil, Neil, hold on a minute. How are \n\t\tyou gonna be in a play if your father \n\t\twon't let you? \n\n\t\t\t\tNEIL\n\t\tFirst I gotta get the part, then I can \n\t\tworry about that. \n\n\t\t\t\tTODD\n\t\tYeah, but won't he kill you if he finds \n\t\tout you went to an audition and didn't \n\t\teven tell him? \n\n\t\t\t\tNEIL\n\t\tNo, no, no, no. As far as I'm concerned, \n\t\the won't have to know about any of this. \n\n\t\t\t\tTODD\n\t\tWell, that's impossible. \n\n\t\t\t\tNEIL\n\t\tBullshit! Nothing's impossible. \n\n\t\t\t\tTODD\n\t\tWell, why don't you just call him and \n\t\task him? And m-maybe he'll say yes. \n\n\t\t\t\tNEIL\n\t\tThat's a laugh!\n\nNeil tosses the blanket back onto his bed.\n\n\t\t\t\tNEIL\n\t\tIf I don't ask him, at least I won't\n\t\tbe disobeying him. \n\n\t\t\t\tTODD\n\t\tYeah, but if he said-- \n\n\t\t\t\tNEIL\n\t\t\t   (shouting angrily)\n\t\tJesus, Todd! Whose side are you on?\n\nTodd says nothing. Neil looks at him for a moment and then takes\nthe flyer back from Todd. He walks over to the window, his \nexcitement gone.\n\n\t\t\t\tNEIL\n\t\tI mean, I haven't even gotten the part \n\t\tyet. Can't I even enjoy the idea for a \n\t\tlittle while? \n\nOnce again, Todd says nothing. After a moment, Neil sits on the\nheater and Todd returns to his poem.\n\n\t\t\t\tNEIL\n\t\tYou're coming to the meeting this \n\t\tafternoon? \n\n\t\t\t\tTODD\n\t\tI don't know. Maybe.\n\n\t\t\t\tNEIL\n\t\tNothing Mr. Keating has to say means \n\t\tshit to you, does it, Todd? \n\n\t\t\t\tTODD\n\t\tW-What is that supposed to mean? \n\n\t\t\t\tNEIL\n\t\tYou're in the club! Being in the club \n\t\tmeans being stirred up by things. You \n\t\tlook about as stirred up as a cesspool. \n\nNeil gets up from the window and stands over Todd.\n\n\t\t\t\tTODD\n\t\tSo- You want me out? \n\n\t\t\t\tNEIL\n\t\tNo! I want you in, but being in means \n\t\tyou gotta do something. Not just say \n\t\tyou're in. \n\n\t\t\t\tTODD\n\t\tWell, listen, Neil. I-I appreciate this \n\t\tconcern, but I-I'm not like you. All \n\t\tright? You, you, you say thing and \n\t\tpeople listen. I'm, I'm not like that. \n\n\t\t\t\tNEIL\n\t\tDon't you think you could be? \n\n\t\t\t\tTODD\n\t\tNo! I--I, I don't know, but that's not \n\t\tthe point. The, the, the point is that \n\t\tthere's nothing you can do about it, so \n\t\tyou can just butt out. I can take care \n\t\tof myself just fine. All right? \n\n\t\t\t\tNEIL\n\t\tNo. \n\n\t\t\t\tTODD\n\t\tWhat do you mean, \"no\"? \n\nA smile comes to Neil's face.\n\n\t\t\t\tNEIL\n\t\tNo. \n\nNeil grabs Todd's notebook of poetry and runs across the room with \nit. Todd leaps up after him.\n\n\t\t\t\tTODD\n\t\tGive me-- Neil. Neil, give that back. \n\nThe two begin racing in circles around the room, jumping from\nbed to bed as Todd tries to grab his poem back.\n\n\t\t\t\tNEIL\n\t\t\"We are dreaming of a--\" Poetry! I'm \n\t\tbeing chased by Walt Whitman! Okay, \n\t\tokay.\n\nNeil drops the notebook. Cameron walks into the room.\n\n\t\t\t\tCAMERON\n\t\tWhat are you guys doing? I'm sure-- You \n\t\tsee this chemistry-\n\nCameron tries to hold up his book and Neil snatches it from his hands and\nsuddenly all three of them are racing around the room.\n\n\t\t\t\tCAMERON\n\t\tHey, give me-- Neil, give me-- Don't be\n\t\timmature. Come on. I need my- \n\nCharlie enters the room and begins waving his hands.\n\n\t\t\t\tCHARLIE\n\t\tGive it to me! Give it to me! \n\n\t\t\t\tNEIL\n\t\tCharlie!\n\nNeil tosses Cameron's book to Charlie.\n\n\t\t\t\tCAMERON\n\t\tLet me have my book, I need my- \n\nThe four boys continue racing around the cramped quarters, tossing\nCameron's book back and forth. Neil picks up a recorder and begins\nblowing erratic notes on it while Charlie starts pounding on a set of\nbongo drums. Outside the room a crowd of boys watch.\n\nEXT. CAMPUS ENTRANCE - DAY\n\nKnox is riding his bike around in circles near the entrance. Seeing no\none nearby, he races through the open gates and down the road. He comes\nto the top of a hill and then goes downhill across the grass, shouting\nas he sends an immense flock of geese flying into the air.\n\nEXT. PARKING LOT - DAY\n\nA number of vehicles drive up, filled with students dressed in bright red\ncosyumes, playing trumpets and various other instruments as they pass.\nKnox watches the growing crowd of students. They are all converging on\na bus. A football player, wearing a horned helmet, dances on the roof of\nthe bus. A band is playing while a group of cheerleaders are practising.\nKnox spots Chris amongst the cheerleaders. He watches her until Chet\ncomes along and she grabs hold of his hand. Knox looks away in disgust.\n\n\t\t\t\tCOACH\n\t\tOkay, everybody on the bus. Let's go, \n\t\tboys. Come on, let's go. On the bus, \n\t\tboys. Now!\n\nChris jumps into Chet's arms as everyone begins to board the buses. Knox\nturns his bike around and leaves.\n\nEXT. SOCCER FIELD - DAY\n\nKeating walks across the field, followed by his students. He kicks a ball\nahead of him while he carries a number of other balls in a net slung over\nhis shoulder.\n\n\t\t\t\tKEATING\n\t\tNow, devotees may argue that one sport \n\t\tor game is inherently better than \n\t\tanother. For me, sport is actually a \n\t\tchance for us to have other human beings \n\t\tpush us to excel. I want you all to come \n\t\tover here and take a slip of paper and \n\t\tline up single file.\n\nKeating reaches the stands. He tosses the balls aside and pulls sets\nhis briefcase down. As the boys line up he begins ripping off slips\nof paper from a notepad and handing them out.\n\n\t\t\t\tKEATING\n\t\tMr. Meeks, time to inherit the earth. \n\t\tMr. Pitts, rise above your name.\n\nHe hands the notepad to another student.\n\n\t\t\t\tKEATING\n\t\tI want you to hand these out to the boys,\n\t\tone apiece.\n\nEXT. SOCCER FIELD - DAY\n\nThe students are all lined up in single file, each holding a slip\nof paper. Keating blows his whistle.\n\n\t\t\t\tKEATING\n\t\tYou know what to do, Pitts. \n\n\t\t\t\tPITTS\n\t\t\"Oh to struggle against great odds. To \n\t\tmeet enemies undaunted.\" \n\n\t\t\t\tKEATING\n\t\tSounds to me like you're daunted. Say it \n\t\tagain like you're undaunted. \n\n\t\t\t\tPITTS\n\t\t\"Oh to struggle against great odds. To \n\t\tmeet enemies undaunted.\" \n\n\t\t\t\tKEATING\n\t\tNow go on.\n\nPitts gives one of the soccer balls a good kick.\n\n\t\t\t\tKEATING\n\t\tYes! Next.\n\nOne of the students sets up the next ball as the line advances.\n\n\t\t\t\tBOY 1\n\t\t\"To be a sailor of the world, bound for \n\t\tall ports.\" \n\n\t\t\t\tKEATING\n\t\tNext. Louder! \n\n\t\t\t\tBOY 2\n\t\t\"Oh, I live to be the ruler of life, not \n\t\ta slave.\" \n\nKeating walks away and starts up a record player.\n\n\t\t\t\tBOY 3\n\t\t\"To mount the scaffolds. To advance to \n\t\tthe muzzle of guns with perfect \n\t\tnonchalance.\"\n\nClassical music begins playing on the phonograph. Meeks goes to\nread next but is confused by the music.\n\n\t\t\t\tKEATING\n\t\tCome on, Meeks! Listen to the music. \n\n\t\t\t\tMEEKS\n\t\t\"To dance, clap hands, exalt, shout, \n\t\tskip, roll on, float on.\" \n\n\t\t\t\tKEATING\n\t\tYes! \n\n\t\t\t\tHOPKINS\n\t\t\t\t(without energy)\n\t\t\"Oh, to have life henceforth the poem of \n\t\tnew joys.\" \n\nHopkins crumples up his paper and then barely taps the soccer\nball with his foot.\n\nKeating puts a look of disgust on his face.\n\n\t\t\t\tKEATING\n\t\tOh! Boo! Come on, Charlie, let it fill \n\t\tyour soul! \n\nCharlie raises his hands over his head.\n\n\t\t\t\tCHARLIE\n\t\t\"To indeed be a god!\" \n\nINT. DORM HALLWAY - DAY\n\nNeil is racing down the hallway, all excited.\n\n\t\t\t\tNEIL\n\t\tCharlie, I got the part! I'm gonna play \n\t\tPuck! I'm gonna play Puck!\n\nHe pounds on Charlie's door.\n\n\t\t\t\tMEEKS\n\t\tWhat did he say? \n\n\t\t\t\tPITTS\n\t\tPuck? \n\n\t\t\t\tNEIL\n\t\tThat's the main part. \n\n\t\t\t\tKNOX\n\t\tGreat, Neil. \n\n\t\t\t\tNEIL\n\t\tCharlie, I got it! \n\n\t\t\t\tCHARLIE\n\t\tCongratulations. Good for you, Neil. \n\t\tGood for you. \n\nNeil enters his room with Todd and sits down at his typewriter.\n\n\t\t\t\tNEIL\n\t\tOkay, okay, okay, okay. \n\n\t\t\t\tTODD\n\t\tNeil, how are you gonna do this? \n\n\t\t\t\tNEIL\n\t\tThey need a letter of permission from my \n\t\tfather and Mr. Nolan. \n\n\t\t\t\tTODD\n\t\tYou're not gonna write it. \n\n\t\t\t\tNEIL\n\t\tOh yes, I am. \n\n\t\t\t\tTODD\n\t\tOh, Neil. Neil, you're crazy. \n\n Neil begins typing.\n\n\t\t\t\t    NEIL\n\t\tOkay. \"I am writing to you on behalf of \n\t\tmy son Neil Perry.\"\n\nNeil begins laughing and stomping his feet up and down.\n\n\t\t\t\t    NEIL\n\t\tThis is great.\n\nEXT. CAMPUS - NIGHT\n\nA lone bagpiper plays out on the dock.\n\nINT. TODD'S ROOM - NIGHT\n\nTodd is pacing circles about his room as he reads his poem. His\npacing slows and then he tears the poem up.\n\nINT. KEATING'S CLASSROOM - DAY\n\nKnox stands at the front of the room with his poem in hand.\n\n\t\t\t\tKNOX\n\t\t\t\t(quietly)\n\t\t\"To Chris.\"\n\nCharlie looks up from his desk with a grin.\n\n\t\t\t\tBOY 1\n\t\tWho's Chris? \n\n\t\t\t\tBOY 2\n\t\tMmm, Chris. \n\n\t\t\t\tKNOX\n\t\tI see a sweetness in her smile. \n\t\tBlight light shines from her eyes. \n\t\tBut life is complete; contentment is \n\t\tmine, \n\t\tJust knowing that...\n\nSeveral students begin to snicker.\n\n\t\t\t\tKNOX\n\t\tjust knowing that she's alive.\n\nKnox crumples his poem and walks back to his desk.\n\n\t\t\t\tKNOX\n\t\tSorry, Captain. It's stupid. \n\n\t\t\t\tKEATING\n\t\tNo, no. It's not stupid. It's a good \n\t\teffort. It touched on one of the major \n\t\tthemes, love. A major theme not only in \n\t\tpoetry, but life. Mr. Hopkins, you were \n\t\tlaughing. You're up.\n\nHopkins slowly walks to the front of the class and unfolds\nhis piece of paper.\n\n\t\t\t\tHOPKINS\n\t\t\"The cat sat on the mat.\" \n\n\t\t\t\tKEATING\n\t\tCongratulations, Mr. Hopkins. Yours is \n\t\tthe first poem to ever have a negative \n\t\tscore on the Pritchard scale. We're not \n\t\tlaughing at you, we're laughing near \n\t\tyou. I don't mind that your poem had a \n\t\tsimple theme. Sometimes the most \n\t\tbeautiful poetry can be about simple \n\t\tthings, like a cat, or a flower or rain. \n\t\tYou see, poetry can come from anything \n\t\twith the stuff of revelation in it. Just \n\t\tdon't let your poems be ordinary. Now, \n\t\twho's next? \n\nKeating approaches Todd's desk.\n\n\t\t\t\tKEATING\n\t\tMr. Anderson, I see you sitting there in \n\t\tagony. Come on, Todd, step up. Let's put \n\t\tyou out of your misery. \n\n\t\t\t\tTODD\n\t\tI, I didn't do it. I didn't write a \n\t\tpoem. \n\n\t\t\t\tKEATING\n\t\tMr. Anderson thinks that everything \n\t\tinside of him is worthless and \n\t\tembarrassing. Isn't that right, Todd? \n\t\tIsn't that your worst fear? Well, I \n\t\tthink you're wrong. I think you have \n\t\tsomething inside of you that is worth a \n\t\tgreat deal.\n\nKeating walks up to the blackboard and begins to write.\n\n\t\t\t\tKEATING\n\t\t\"I sound my barbaric yawp over the \n\t\trooftops of the world.\" W. W. Uncle Walt \n\t\tagain. Now, for those of you who don't \n\t\tknow, a yawp is a loud cry or yell. Now, \n\t\tTodd, I would like you to give us a \n\t\tdemonstration of a barbaric \"yawp.\" Come \n\t\ton. You can't yawp sitting down. Let's \n\t\tgo. Come on. Up.\n\nTodd reluctantly stands and follows Keating to the front.\n\n\t\t\t\tKEATING\n\t\tYou gotta get in \"yawping\" stance. \n\n\t\t\t\tTODD\n\t\tA yawp?\n\n\t\t\t\tKEATING\n\t\tNo, not just a yawp. A barbaric yawp. \n\n\t\t\t\tTODD\n\t\t\t\t(quietly)\n\t\tYawp. \n\n\t\t\t\tKEATING\n\t\tCome on, louder. \n\n\t\t\t\tTODD\n\t\t\t\t(quietly)\n\t\tYawp. \n\n\t\t\t\tKEATING\n\t\tNo, that's a mouse. Come on. Louder. \n\n\t\t\t\tTODD\n\t\tYawp. \n\n\t\t\t\tKEATING\n\t\tOh, good God, boy. Yell like a man! \n\n\t\t\t\tTODD\n\t\t\t\t(shouting)\n\t\tYawp! \n\n\t\t\t\tKEATING\n\t\tThere it is. You see, you have a \n\t\tbarbarian in you, after all.\n\nTodd goes to return to his seat but Keating stops him.\n\n\t\t\t\tKEATING\n\t\tNow, you don't get away that easy.\n\nKeating turns Todd around and points out a picture on the wall.\n\n\t\t\t\tKEATING\n\t\tThe picture of Uncle Walt up there. What \n\t\tdoes he remind you of? Don't think. \n\t\tAnswer. Go on.\n\nKeating begins to circle around Todd.\n\n\t\t\t\tTODD\n\t\tA m-m-madman. \n\n\t\t\t\tKEATING\n\t\tWhat kind of madman? Don't think about \n\t\tit. Just answer again. \n\n\t\t\t\tTODD\n\t\tA c-crazy madman. \n\n\t\t\t\tKEATING\n\t\tNo, you can do better than that. Free up \n\t\tyour mind. Use your imagination. Say the \n\t\tfirst thing that pops into your head, \n\t\teven if it's total gibberish. Go on, go \n\t\ton. \n\n\t\t\t\tTODD\n\t\tUh, uh, a sweaty-toothed madman. \n\n\t\t\t\tKEATING\n\t\tGood God, boy, there's a poet in you, \n\t\tafter all. There, close your eyes. Close \n\t\tyour eyes. Close 'em. Now, describe what \n\t\tyou see. \n\nKeating puts his hands over Todd's eyes and they begin to slowly\nspin around.\n\n\t\t\t\tTODD\n\t\tUh, I-I close my eyes. \n\n\t\t\t\tKEATING\n\t\tYes? \n\n\t\t\t\tTODD\n\t\tUh, and this image floats beside me. \n\n\t\t\t\tKEATING\n\t\tA sweaty-toothed madman? \n\n\t\t\t\tTODD\n\t\tA sweaty-toothed madman with a stare \n\t\tthat pounds my brain. \n\n\t\t\t\tKEATING\n\t\tOh, that's excellent. Now, give him \n\t\taction. Make him do something. \n\n\t\t\t\tTODD\n\t\tH-His hands reach out and choke me. \n\n\t\t\t\tKEATING\n\t\tThat's it. Wonderful. Wonderful.\n\nKeating removes his hands from Todd but Todd keeps his eyes\nclosed.\n\n\t\t\t\tTODD\n\t\tAnd, and all the time he's mumbling. \n\n\t\t\t\tKEATING\n\t\tWhat's he mumbling? \n\n\t\t\t\tTODD\n\t\tM-Mumbling, \"Truth. Truth is like, like \n\t\ta blanket that always leaves your feet \n\t\tcold.\" \n\nThe students begin to laugh and Todd opens his eyes. Keating\nquickly gestures for him to close them again.\n\n\t\t\t\tKEATING\n\t\tForget them, forget them. Stay with the \n\t\tblanket. Tell me about that blanket. \n\n\t\t\t\tTODD\n\t\tY-Y-Y-You push it, stretch it, it'll \n\t\tnever be enough. You kick at it, beat \n\t\tit, it'll never cover any of us. From \n\t\tthe moment we enter crying to the moment \n\t\twe leave dying, it will just cover your \n\t\tface as you wail and cry and scream. \n\nTodd opens his eyes. The class is silent. Then they begin to clap\nand cheer.\n\n\t\t\t\tKEATING\n\t\t\t   (whispering to Todd)\n\t\tDon't you forget this.\n\nEXT. SOCCER FIELD - DAY\n\nKeating's students are playing a soccer game. After they score the\nwinning goal they hoist Keating onto their shoulders and carry him\naway.\n\nINT. CAVE - DAY\n\nThe boys are all sitting around the cave lighting their pipes.\n\t\t\t\tCHARLIE\n\t\tAttaboy, Pittsie, inhale deeply. \n\n\t\t\t\tMEEKS\n\t\tMy dad collects a lot of pipes. \n\n\t\t\t\tCHARLIE\n\t\tReally? Mine's got thirty. \n\n\t\t\t\tPITTS\n\t\tYour parents collect pipes? Oh, that's \n\t\treally interesting. \n\n\t\t\t\tCHARLIE\n\t\tCome on, Knox. Join in. \n\n\t\t\t\tMEEKS\n\t\tYeah, Knox, we're from the government. \n\t\tWe're here to help, man. \n\n\t\t\t\tCHARLIE\n\t\tWhat's wrong? \n\n\t\t\t\tPITTS\n\t\tIt's Chris. Here's a picture of Chris \n\t\tfor you.\n\nPitts holds up a centerfold.\n\n\t\t\t\tMEEKS\n\t\tSmoke that. Put that in your pipe and \n\t\tsmoke it. \n\n\t\t\t\tKNOX\n\t\tThat's not funny. \n\n\t\t\t\tCHARLIE\n\t\tKnock it off. Smoke your pipes. \n\n\t\t\t\tMEEKS\n\t\tNeil!\n\nNeil enters the cave carrying a beat up light stand.\n\n\t\t\t\tNEIL\n\t\tFriend, scholar, Welton men. \n\n\t\t\t\tMEEKS\n\t\tWhat is that, Neil? \n\n\t\t\t\tPITTS\n\t\tDuh. It's a lamp, Meeks.\n\nNeil removes the shade from the lamp, revealing the shape of a man\nas the base of the lamp.\n\n\t\t\t\tNEIL\n\t\tNo. This is the god of the cave. \n\n\t\t\t\tMEEKS\n\t\tThe god of the cave.\n\nCharlie begins making loud noises with his saxophone.\n\n\t\t\t\tPITTS\n\t\tCharlie, what are you doing? \n\n\t\t\t\tCHARLIE\n\t\tWhat do you say we start this meeting? \n\n\t\t\t\tBOY 1\n\t\tY-Yeah, just-- I need a light. I just \n\t\tgotta- \n\n\t\t\t\tBOY 2\n\t\tGot my earplugs?\n\nCharlie stands up and clears his throat.\n\n\t\t\t\tCHARLIE\n\t\tGentlemen, \"Poetrusic\" by Charles \n\t\tDalton.\n\nCharlie begins playing erratic notes on the sexophone.\n\n\t\t\t\tMEEKS\n\t\tOh, no. \n\n\t\t\t\tCHARLIE\n\t\tLaughing, crying, tumbling, mumbling. \n\t\tGotta do more. Gotta be more. \n\nCharlie plays more erratic sounds.\n\n\t\t\t\tCHARLIE\n\t\tChaos screaming, chaos dreaming. Gotta \n\t\tdo more! Gotta be more!\n\nCharlie starts to play a real tune on the saxophone.\n\n\t\t\t\tMEEKS\n\t\tWow! \n\n\t\t\t\tPITTS\n\t\tThat was nice. That was great. Where did \n\t\tyou learn to play like that? \n\n\t\t\t\tCHARLIE\n\t\tMy parents made me take the clarinet for \n\t\tyears. \n\n\t\t\t\tCAMERON\n\t\tI love the clarinet. \n\n\t\t\t\tCHARLIE\n\t\tI hated it. The saxophone. The saxophone \n\t\tis more sonorous. \n\n\t\t\t\tCAMERON\n\t\tOoh. \n\n\t\t\t\tMEEKS\n\t\tVocabulary. \n\nKnox jumps up.\n\t\t\t\tKNOX\n\t\tI can't take it anymore. If I don't have \n\t\tChris, I'm gonna kill myself. \n\n\t\t\t\tCHARLIE\n\t\tKnoxious, you've gotta calm down. \n\n\t\t\t\tKNOX\n\t\tNo, Charlie. That's just my problem. \n\t\tI've been calm all my life. I'll do \n\t\tsomething about that. \n\n\t\t\t\tNEIL\n\t\tWhere are you going? \n\n\t\t\t\tCHARLIE\n\t\tWhat are you gonna do? \n\n\t\t\t\tKNOX\n\t\tI'm gonna call her.\n\nKnox begins to chuckle as he leaves the cave. The others\nquickly grab their coats to follow him. Charlie goes back to\nplaying noise on his saxophone again.\n\nINT. HALLWAY - DAY\n\nKnox is making a call from the payphone.\n\n\t\t\t\tCHRIS (O.S.)\n\t\tHello?\n\nKnox immediately hangs up and looks at the other boys who are\nall gathered around him.\n\n\t\t\t\tKNOX\n\t\tShe's gonna hate me. The Danburrys will \n\t\thate me. My parents will kill me. \n\t\tAll right, goddamn it. You're right. \n\t\t\"Carpe diem.\" Even if it kills me. \n\nKnox puts in another coin and calls again.\n\n\t\t\t\tCHRIS (O.S.)\n\t\tHello? \n\n\t\t\t\tKNOX\n\t\tHello, Chris? \n\n\t\t\t\tCHRIS (O.S.)\n\t\tYes. \n\n\t\t\t\tKNOX\n\t\tHi. This is Knox Overstreet. \n\n\t\t\t\tCHRIS (O.S.)\n\t\tOh, yes. Knox. Glad you called. \n\n\t\t\t\tKNOX\n\t\tShe's glad I called. \n\n\t\t\t\tCHRIS (O.S.)\n\t\tListen, Chet's parents are going out of \n\t\ttown this weekend, so he's having a \n\t\tparty. Would you like to come? \n\n\t\t\t\tKNOX\n\t\tWould I like to come to a party? \n\n\t\t\t\tCHARLIE\n\t\tYes. Say, yes. \n\n\t\t\t\tCHRIS (O.S.)\n\t\tFriday? Um- \n\n\t\t\t\tKNOX\n\t\tWell, sure. \n\n\t\t\t\tCHRIS (O.S.)\n\t\tAbout seven? \n\n\t\t\t\tKNOX\n\t\tOkay, great. I-I'll be there, Chris. \n\n\t\t\t\tCHRIS (O.S.)\n\t\tOkay. \n\n\t\t\t\tKNOX\n\t\tFriday night at the Danburrys'. O-Okay. \n\t\tThank you. \n\n\t\t\t\tCHRIS (O.S.)\n\t\tOkay. Bye. \n\n\t\t\t\tKNOX\n\t\tThank you. I'll see you. Bye. \n\n\t\t\t\tKNOX\n\t\tYawp! Can you believe it? She was gonna \n\t\tcall me. She invited me to a party with \n\t\ther. \n\n\t\t\t\tCHARLIE\n\t\tAt Chet Danburry's house. \n\n\t\t\t\tKNOX\n\t\tYeah. \n\n\t\t\t\tCHARLIE\n\t\tWell? \n\n\t\t\t\tKNOX\n\t\tSo? \n\n\t\t\t\tCHARLIE\n\t\tSo, you don't really think she means \n\t\tyou're going with her? \n\n\t\t\t\tKNOX\n\t\tWell, of course not, Charlie. But that's \n\t\tnot the point. That's not the point at \n\t\tall. \n\n\t\t\t\tCHARLIE\n\t\tWhat is the point? \n\n\t\t\t\tKNOX\n\t\tThe point, Charlie, is, uh-- \n\n\t\t\t\tCHARLIE\n\t\tYeah? \n\n\t\t\t\tKNOX\n\t\tthat she was thinking about me. I've \n\t\tonly met her once, and already she's \n\t\tthinking about me. Damn it. It's gonna \n\t\thappen, guys. I feel it. She is going to \n\t\tbe mine. Carpe. Carpe!\n\nKnox flips his scarf dramatically around his neck as he walks away\nand climbs the stairs.\n\nEXT. COURTYARD - DAY\n\nThe students are standing in a line while Cameron, Pitts, and Knox\nare walking in a circle. Keating watches as they go around.\n\n\t\t\t\tKEATING\n\t\tNo grades at stake, gentlemen. Just take \n\t\ta stroll.\n\nAfter a few moments, the three boys begin to march to the same beat.\n\n\t\t\t\tKEATING\n\t\tThere it is. \n\nThe other boys start clapping to the rhythm of their steps.\n\n\t\t\t\tKEATING\n\t\tI don't know, but I've been told-- \n\n\t\t\t\tBOYS\n\t\tI don't know, but I've been told-- \n\n\t\t\t\tKEATING\n\t\tDoing poetry is old-- \n\n\t\t\t\tBOYS\n\t\tDoing poetry is old-- \n\nMr. Nolan looks out at them from his office as Keating joins the\nboys and begins marching with them.\n\n\t\t\t\tKEATING\n\t\tLeft, left, left-right-left. Left, left, \n\t\tleft-right-left. Left, halt! \n\nThe boys come to a halt.\n\n\t\t\t\tKEATING\n\t\tThank you, gentlemen. If you noticed, \n\t\teveryone started off with their own \n\t\tstride, their own pace.\n\nKeating begins walking very slowly.\n\n\t\t\t\tKEATING\n\t\tMr. Pitts, taking his time. He knew he'll\n\t\tget there one day. Mr. Cameron, you could\n\t\tsee him thinking, \"Is this right? It might\n\t\tbe right. It might be right. I know that. \n\t\tMaybe not. I don't know.\"\n\nKeating begins walking with his groin pushed forward.\n\n\t\t\t\tKEATING\n\t\tMr. Overstreet, driven by deeper force.\n\t\tYes. We know that. All right. Now, I\n\t\tdidn't bring them up here to ridicule\n\t\tthem. I brought them up here to illustrate\n\t\tthe point of conformity: the difficulty in \n\t\tmaintaining your own beliefs in the face \n\t\tof others. Now, those of you -- I see \n\t\tthe look in your eyes like, \"I would've \n\t\twalked differently.\" Well, ask \n\t\tyourselves why you were clapping. Now, \n\t\twe all have a great need for acceptance. \n\t\tBut you must trust that your beliefs are \n\t\tunique, your own, even though others may \n\t\tthink them odd or unpopular, even though \n\t\tthe herd may go, \"That's baaaaad.\" Robert \n\t\tFrost said, \"Two roads diverged in a \n\t\twood and I, I took the one less traveled \n\t\tby, and that has made all the \n\t\tdifference.\" Now, I want you to find \n\t\tyour own walk right now. Your own way of \n\t\tstriding, pacing. Any direction. \n\t\tAnything you want. Whether it's proud, \n\t\twhether it's silly, anything. Gentlemen, \n\t\tthe courtyard is yours.\n\nThe students begin walking about, some walking casually, others\nmaking up silly walks. Keating notices that Charlie is still\nleaning up against one of the pillars.\n\n\t\t\t\tKEATING\n\t\tYou don't have to perform. Just make it \n\t\tfor yourself. Mr. Dalton? You be joining \n\t\tus? \n\n\t\t\t\tCHARLIE\n\t\tExercising the right not to walk. \n\n\t\t\t\tKEATING\n\t\tThank you, Mr. Dalton. You just \n\t\tillustrated the point. Swim against the \n\t\tstream.\n\nNolan moves away from the window where he had been watching them.\n\nEXT. CAMPUS - NIGHT\n\nNeil is walking by with the notes for the play when he notices Todd\nsitting off by himself on one of the walkways.\n\n\t\t\t\tNEIL\n\t\tTodd? Hey. \n\n\t\t\t\tTODD\n\t\tHey. \n\n\t\t\t\tNEIL\n\t\tWhat's going on?\n\n\t\t\t\tTODD\n\t\tNothing. Today's my birthday. \n\n\t\t\t\tNEIL\n\t\tIs today your birthday? Happy birthday. \n\n\t\t\t\tTODD\n\t\tThanks. \n\n\t\t\t\tNEIL\n\t\tWhat's you get? \n\n\t\t\t\tTODD\n\t\tMy parents gave me this. \n\nNeil looks down at a deskset sitting next to Todd, still in\nits wrappings.\n\n\t\t\t\tNEIL\n\t\tIsn't this the same desk set- \n\n\t\t\t\tTODD\n\t\tYeah, yeah. They gave me the same thing \n\t\tas last year. \n\n\t\t\t\tNEIL\n\t\tOh. \n\n\t\t\t\tTODD\n\t\tOh. \n\n\t\t\t\tNEIL\n\t\t\t\t (laughing)\n\t\tMaybe they thought you needed another \n\t\tone. \n\n\t\t\t\tTODD\n\t\tMaybe they weren't thinking about \n\t\tanything at all. Uh, the funny thing is \n\t\tabout this is I, I didn't even like it \n\t\tthe first time. \n\n\t\t\t\tNEIL\n\t\tTodd, I think you're underestimating the \n\t\tvalue of this desk set.\n\nNeil picks up the desk set and begins examining it more closely.\n\n\t\t\t\tNEIL\n\t\tI mean, who would want a football or\n\t\ta baseball, or-\n\n\t\t\t\tTODD\n\t\tOr a car. \n\n\t\t\t\tNEIL\n\t\tOr a car if they could have a desk set \n\t\tas wonderful as this one? I mean, if, if \n\t\tI were ever going to buy a, a desk set \n\t\ttwice, I would probably buy this one \n\t\tboth times. In fact, its, its shape is, \n\t\tit's rather aerodynamic, isn't it? I can \n\t\tfeel it. This desk set wants to fly.\n\nNeil tosses the desk set lightly in the air. Todd stands up\nand Neil hands him the desk set.\n\n\t\t\t\tNEIL\n\t\tTodd? The world's first unmanned flying \n\t\tdesk set.\n\nTodd flings the desk set over the side of the walkway and it\nfalls to pieces down below.\n\n\t\t\t\tTODD\n\t\tOh, my! \n\n\t\t\t\tNEIL\n\t\tWell, I wouldn't worry. You'll get \n\t\tanother one next year.\n\nINT. CAVE - NIGHT\n\nAll the boys but Knox and Charlie are gathered in the cave.\n\n\t\t\t\tBOYS\n\t\t\"To live deep and suck out all the \n\t\tmarrow of life. To put to rout all that \n\t\twas not life\"\n\nThe boys stop as they hear the sound of female laughter outside.\n\n\t\t\t\tCAMERON\n\t\tOh, my God! \n\n\t\t\t\tGLORIA\n\t\tIs this it? \n\n\t\t\t\tCHARLIE\n\t\tYeah, this is it. Go ahead, go on in. \n\t\tIt's my cave. Watch your step. \n\n\t\t\t\tTINA\n\t\tWe're not gonna slip, are we? \n\n\t\t\t\tGLORIA\n\t\tUh-oh.\n\nGloria hops into the cave wearing a bright red shirt. The lights from\nthe boys' flashlights play conspicously over Gloria's chest. Tina\nenters right behind her.\n\n\t\t\t\tGLORIA\n\t\tHi.\n\nMeeks stands up and slams his head into the low ceiling.\n\n\t\t\t\tMEEKS\n\t\tHello. \n\n\t\t\t\tGLORIA\n\t\tHello. \n\n\t\t\t\tCHARLIE\n\t\tHi, you guys. Meet, uh, Gloria and-- \n\n\t\t\t\tTINA\n\t\tTina. \n\n\t\t\t\tCHARLIE\n\t\tTina. This is the pledge class of the \n\t\tDead Poets Society.\n \n\t\t\t\tBOYS\n\t\tHello. How do you do? \n\n\t\t\t\tNEIL\n\t\tHello. \n\n\t\t\t\tGLORIA\n\t\tHi. Hi. \n\n\t\t\t\tCHARLIE\n\t\tGuys, move. Move. Come on, folks. It's \n\t\tFriday night. Let's get on with the \n\t\tmeeting.\n\nThe boys move aside to let the girls in.\n\n\t\t\t\tBOYS\n\t\tSorry. Excuse- Excuse me. \n\n\t\t\t\tCHARLIE\n\t\tGuys, I have an announcement to make. In \n\t\tkeeping with the spirit of passionate \n\t\texperimentation of the Dead Poets, I'm \n\t\tgiving up the name Charlie Dalton. From \n\t\tnow on, call me Nuwanda. \n\n\t\t\t\tPITTS\n\t\t\t\t(laughing)\n\t\tNuwanda? \n\n\t\t\t\tNEIL\n\t\tNuwanda? \n\nTina takes out a tube of red lipstick. Charlie takes it from her\nand puts red marks on each of his cheeks.\n\nINT. CHET'S HOUSE - NIGHT\n\nKnox enters the house and looks anxiously about.\n\n\t\t\t\tKNOX\n\t\tHello? Hello, Chris?\n\nKnox stops and combs his hair in the hallway mirror. Chris comes\nrunning out from one of the rooms.\n\n\t\t\t\tCHRIS\n\t\tKnox! \n\n\t\t\t\tKNOX\n\t\tHi. \n\n\t\t\t\tCHRIS\n\t\tYou made it. Great! Bring anybody? \n\n\t\t\t\tKNOX\n\t\tNo. \n\nChris grabs Knox by his jackets and pulls him forward as she walks\ntoward the stairs.\n\n\t\t\t\tCHRIS\n\t\tNo. Ginny Danburry's here. Wait. I have \n\t\tto go find Chet. Why don't you go \n\t\tdownstairs where everybody is?\n\nChris runs up the stairs as Knox stares after her.\n\n\t\t\t\tCHRIS\n\t\tMake yourself at home. \n\n\t\t\t\tKNOX\n\t\tBut I--\n\nINT. CHET'S BASEMENT - NIGHT\n\nKnox stares at a couple kissing passionately. Across the room he sees\nChet and Chris dancing. He walks away.\n\nINT. CHET'S KITCHEN - NIGHT\n\nKnox enters the kitchen, walking between several football players\nto fill up a mug of beer from a keg.\n\n\t\t\t\tSTEVE\n\t\tHey, you Mutt Sanders' brother? Bubba, \n\t\tthis guy look like Mutt Sanders to you \n\t\tor what? \n\nBubba spits ice cubes into the sink.\n\n\t\t\t\tBUBBA\n\t\tYou're his brother? \n\n\t\t\t\tKNOX\n\t\tNo relation. Never heard of him. Sorry, \n\t\tguys. \n\n\t\t\t\tBUBBA\n\t\t\t  (obviously drunk)\n\t\tWhere's your manners Steve? Mutt Sanders' \n\t\tbrother, we don't even offer him a \n\t\tdrink. Here. Go have some whiskey, pal. \n\nBubba hands Knox a glass and fills it up.\n\n\t\t\t\tSTEVE\n\t\tYeah. \n\n\t\t\t\tKNOX\n\t\tWhoa, I, uh, I don't really drink-- \n\n\t\t\t\tBUBBA\n\t\tTo Mutt. \n\n\t\t\t\tSTEVE\n\t\tTo Mutt.\n\nThe two guys raise their glasses in a toast and Knox reluctantly\njoins them.\n\n\t\t\t\tKNOX\n\t\tTo Mutt.\n\nThey each take a big drink. Knox rolls his eyes and gasps,\nloosening his tie to try and breathe.\n\n\t\t\t\tBUBBA\n\t\tNow, how the hell is old Mutt, anyway? \n\n\t\t\t\tSTEVE\n\t\tYeah. What's ol' Mutter been up to, huh? \n\n\t\t\t\tKNOX\n\t\tI don't really know Mutt. \n\n\t\t\t\tBUBBA\n\t\tTo Mighty Mutt. \n\n\t\t\t\tGUY 1\n\t\tTo Mighty Mutt. \n\n\t\t\t\tKNOX\n\t\tTo Mighty Mutt.\n\nThey raise their glasses again for a toast and down the rest\nof their glasses.\n\n\t\t\t\tBUBBA\n\t\tWell, listen, I gotta go find Patsy. Say \n\t\thello to Mutt for me, okay? \n\n\t\t\t\tKNOX\n\t\tWill do.\n\nBubba puts on a horned football helmet and walks away.\n\n\t\t\t\tSTEVE\n\t\tYeah. Hell of a guy, your brother Mutt.\n\nINT. CAVE - NIGHT\n\n\t\t\t\tCHARLIE\n\t\tWe gonna have a meeting or what? \n\n\t\t\t\tGLORIA\n\t\tYeah. If you guys don't have a meeting, \n\t\thow do we know if we wanna join? \n\n\t\t\t\tNEIL\n\t\tJoin? \n\nCharlie leans over to Tina.\n\n\t\t\t\tCHARLIE\n\t\t\"Shall I compare thee to a summer's day? \n\t\tThou art more lovely and more \n\t\ttemperate.\" \n\n\t\t\t\tTINA\n\t\tThat's so sweet. \n\n\t\t\t\tCHARLIE\n\t\tI made that up just for you. \n\n\t\t\t\tTINA\n\t\tYou did?\n\nThe boys laugh and Cameron shakes his head. Charlie moves over\nto sit next to Gloria.\n\n\t\t\t\tCHARLIE\n\t\tI'll write one for you too, Gloria. \n\t\tShe walks in beauty like the night. \n\t\tShe walks in beauty like the night. \n\t\tOf cloudless climes and starry skies. \n\t\tAll that's best, dark and bright, \n\t\tMeet in her aspect and her eyes. \n\n\t\t\t\tGLORIA\n\t\tThat's beautiful. \n\n\t\t\t\tCHARLIE\n\t\tThere's plenty more where that came \n\t\tfrom.\n\nINT. CHET'S BASEMENT - NIGHT\n\nThe room is whirling as Knox belches and staggers across the room. He\npasses Chet and several of his friends. He steps over several couples\nkissing on the floor and slump down on the couch, only to be crowded\nin by another couple who seem oblivious to him. He is about to get up\nagain when he notices Chris sleeping next to him on the couch.\n\n\t\t\t\tKNOX\n\t\tGod help me.\n\nKnox looks about and then looks back down at Chris.\n\n\t\t\t\tKNOX\n\t\tCarpe diem.\n\nKnox takes a last swig of his drink  and then begins to softly run his\nfingers over Chris' hair. He then leans over and kisses her forehead.\nAcross the room, Bubba looks over and sees what's going on.\n\n\t\t\t\tBUBBA\n\t\tChet! Chet! Look! \n\n\t\t\t\tCHET\n\t\tWhat? \n\n\t\t\t\tBUBBA\n\t\tIt's Mutt Sanders' brother. \n\n\t\t\t\tCHET\n\t\tHuh? \n\nChris rises up from the couch and looks at Knox in surprise.\n\n\t\t\t\tCHRIS\n\t\tKnox, what-- \n\n\t\t\t\tBUBBA\n\t\tAnd he's feeling up your girl! \n\n\t\t\t\tCHRIS\n\t\tWhat are you doing? \n\nChet gets up from his chair.\n\n\t\t\t\tCHET\n\t\tWhat the hell are you doing? \n\n\t\t\t\tCHRIS\n\t\tChet! Chet, don't. \n\n\t\t\t\tKNOX\n\t\tNow, Chet, I know this looks bad, but \n\t\tyou've gotta-\n\nChet throws himself at Knox, hurling them both to the floor. He\nthen straddles Knox and begins to punch at him as Knox simply\ntries to protect himself.\n\n\t\t\t\tCHRIS\n\t\tChet, no! You'll hurt him! No! No! Stop \n\t\tit! Leave him alone! \n\n\t\t\t\tCHET\n\t\tGoddamn! \n\n\t\t\t\tCHRIS\n\t\tChet, stop it!\n\nChris manages to haul Chet away from Knox.\n\n\t\t\t\tCHET\n\t\tBastard!\n\nKnox takes his hands away from his face and feels at his bloody\nnose. Chris tries to help him up.\n\n\t\t\t\tCHRIS\n\t\tKnox, are you all right? \n\n\t\t\t\tCHET\n\t\tChris, get the hell away from him! \n\n\t\t\t\tCHRIS\n\t\tChet, you hurt him! \n\n\t\t\t\tCHET\n\t\tGood! \n\n\t\t\t\tKNOX\n\t\tI'm sorry. I'm so sorry. \n\n\t\t\t\tCHRIS\n\t\tIt's okay. It-It's okay.\n\nChet hauls Chris away from Knox and then points at him.\n\n\t\t\t\tCHET\n\t\tNext time I see you, you die. \n\nINT. CAVE - NIGHT\n\nTina passes a bottle of alcohol to Neil.\n\n\t\t\t\tTINA\n\t\tGo ahead, pass it around. \n\nCameron motions for Neil not to take it but Neil takes a swig anyway.\nThere is a moment of awkward silence.\n\n\t\t\t\tMEEKS\n\t\tMe and Pitts are working on a hi-fi \n\t\tsystem. It shouldn't be that hard to, \n\t\tuh, to put together. \n\n\t\t\t\tPITTS\n\t\tYeah. Uh, I might be going to Yale. Uh, \n\t\tuh, but, I, I might not. \n\n\t\t\t\tGLORIA\n\t\tDon't you guys miss having girls around \n\t\there? \n\n\t\t\t\tMEEKS AND PITTS\n\t\t\t\t  (smiling)\n\t\tYeah.\n\n\t\t\t\tCHARLIE\n\t\tThat's part of what this club is about. \n\t\tIn fact, I'd like to announce I \n\t\tpublished an article in the school \n\t\tpaper, in the name of the Dead Poets. \n\n\t\t\t\tCAMERON\n\t\tWhat? \n\n\t\t\t\tCHARLIE\n\t\tDemanding girls be admitted to Welton. \n\n\t\t\t\tPITTS\n\t\tYou didn't. \n\n\t\t\t\tCHARLIE\n\t\t\t    (whispering to Meeks)\n\t\tSo we can all stop beating off. \n\n\t\t\t\tNEIL\n\t\tHow did you do that? \n\n\t\t\t\tCHARLIE\n\t\tI'm one of the proofers. I slipped the \n\t\tarticle in. \n\n\t\t\t\tMEEKS\n\t\tLook, uh, it's, it's over now. \n\n\t\t\t\tCHARLIE\n\t\tWhy? Nobody knows who we are. \n\n\t\t\t\tCAMERON\n\t\tWell, don't you think they're gonna \n\t\tfigure out who wrote it? They're gonna \n\t\tcome to you and ask to know what the \n\t\tDead Poets Society is. Charlie, you had \n\t\tno right to do something like that. \n\n\t\t\t\tCHARLIE\n\t\tIt's Nuwanda, Cameron. \n\n\t\t\t\tGLORIA\n\t\tThat's right. It's Nuwanda. \n\n\t\t\t\tCHARLIE\n\t\tAre we just playing around out here, or \n\t\tdo we mean what we say? For all we do is \n\t\tcome together and reach a bunch of poems \n\t\tto each other. What the hell are we \n\t\tdoing? \n\n\t\t\t\tNEIL\n\t\tAll right, but you still shouldn't have \n\t\tdone it, Charlie. This could mean \n\t\ttrouble. You don't speak for the club. \n\n\t\t\t\tCHARLIE\n\t\tHey, would you not worry about your \n\t\tprecious little neck? If they catch me, \n\t\tI'll tell them I made it up. \n\n\nINT. ASSEMBLY HALL - DAY\n\nThe professors hurry down the steps, lead by an obviously agitated\nMr. Nolan. Several are carrying newspapers in their hands. The\nstudents all rise as they enter. After all the professors have\ntaken their places, Mr. Nolan addresses the students.\n\n\t\t\t\tMR. NOLAN\n\t\tSit.\n\nThe students all sit.\n\n\t\t\t\tMR. NOLAN\n\t\tIn this week of Welton's Honor there \n\t\tappeared a profane and unauthorized \n\t\tarticle. Rather than spend my valuable \n\t\ttime ferreting out the guilty persons -- \n\t\tand let me assure you I will find them -\n\t\t- I'm asking any and all students who \n\t\tknows anything about this article to \n\t\tmake themselves known here and now. \n\t\tWhoever the guilty persons are, this is \n\t\tyour only chance to avoid expulsion from \n\t\tthis school.\n\nThe sound of a phone ringing can be heard. The professors look\nabout for its source. Charlie picks up a telephone receiver.\n\n\t\t\t\tCHARLIE\n\t\tWelton Academy. Hello. Yes, he is. Just \n\t\ta moment.\n\nCharlie stands up, holding a phone and bell in his hands.\n\n\t\t\t\tCHARLIE\n\t\tMr. Nolan, it's for you. It's \n\t\tGod. He says we should have girls at \n\t\tWelton.\n\nMost of the students laugh while the boys from the cave all shake\ntheir heads in disbelief.\n\nINT. NOLAN'S OFFICE - DAY\n\nCharlie stands with his back to the door as Mr. Nolan shuts it. Mr. \nNolan then walks around to face Charlie.\n\n\t\t\t\tMR. NOLAN\n\t\tWipe that smirk off your face. If you \n\t\tthink, Mr. Dalton, that you're the first \n\t\tto try to get thrown out of this school, \n\t\tthink again. Others have had similar \n\t\tnotions and have failed just as surely \n\t\tas you will fail. Assume the position.\n\nCharlie sighs and bends over, resting his hands on the desk. Mr.\nNolan hefts a flat wooden paddle in his hands.\n\n\t\t\t\tMR. NOLAN\n\t\tCount aloud, Mr. Dalton.\n\nMr. Nolan begins to strike Charlie with the paddle.\n\n\t\t\t\tCHARLIE\n\t\tOne. Two. Three. Four. Five. \n\n\t\t\t\tMR. NOLAN\n\t\tWhat is this Dead Poets Society? I want \n\t\tnames.\n\nINT. HALLWAY - DAY\n\nA crowd of students is gathered about as Charlie stiffly walks back to his room.\n\n\t\t\t\tNEIL\n\t\tYou kicked out? \n\n\t\t\t\tCHARLIE\n\t\tNo. \n\n\t\t\t\tNEIL\n\t\tSo what happened? \n\n\t\t\t\tCHARLIE\n\t\tI'm to turn everybody in, apologize to \n\t\tthe school and all will be forgiven. \n\n\t\t\t\tNEIL\n\t\tSo, what are you gonna do? Charlie! \n\n\t\t\t\tCHARLIE\n\t\tDamn it, Neil. The name is Nuwanda.\n\nCharlie smiles and then shuts his door.\n\nINT. KEATING'S CLASSROOM - DAY\n\nKeating and McAllister are enjoying tea in the small room off the\nclassroom. Mr. Nolan knocks on the door and enters.\n\n\t\t\t\tMR. NOLAN\n\t\tExcuse me. May we have a word, Mr. \n\t\tKeating? \n\n\t\t\t\tKEATING\n\t\tCertainly.\n\nKeating fixes his tie and follows Mr. Nolan into the classroom.\n\n\t\t\t\tMR. NOLAN\n\t\tThis was my first classroom, John. Did \n\t\tyou know that? My first desk. \n\n\t\t\t\tKEATING\n\t\tDidn't know you taught, Mr. Nolan. \n\n\t\t\t\tMR. NOLAN\n\t\tEnglish. Oh, long before your time. It \n\t\twas hard giving it up, I can tell you. \n\t\tI'm hearing rumors, John, about some \n\t\tunorthodox teaching methods in your \n\t\tclassroom. I'm not saying they've \n\t\tanything to do with the Dalton boy's \n\t\toutburst. But I don't think I have to \n\t\twarn you boys his age are very \n\t\timpressionable. \n\n\t\t\t\tKEATING\n\t\tWell, your reprimand made quite an \n\t\timpression, I'm sure. \n\n\t\t\t\tMR. NOLAN\n\t\tWhat was going on in the courtyard the \n\t\tother day? \n\n\t\t\t\tKEATING\n\t\tCourtyard? \n\n\t\t\t\tMR. NOLAN\n\t\tYeah. Boys marching, clapping in unison. \n\n\t\t\t\tKEATING\n\t\tOh, that. That was an exercise to prove \n\t\ta point. Dangers of conformity. \n\n\t\t\t\tMR. NOLAN\n\t\tWell, John, the curriculum here is set. \n\t\tIt's proven it works. If you question, \n\t\twhat's to prevent them from doing the \n\t\tsame? \n\n\t\t\t\tKEATING\n\t\tI always thought the idea of educating \n\t\twas to learn to think for yourself. \n\n\t\t\t\tMR. NOLAN\n\t\tAt these boys' ages? Not on your life! \n\t\tTradition, John. Discipline. Prepare \n\t\tthem for college, and the rest will take \n\t\tcare of itself.\n\nINT. STUDY ROOM - DAY\n\nCharlie sits with his bongos as the other boys are all crowded\naround him. He hits the bongoes as he mimes Nolan's footsteps.\n\n\t\t\t\tCHARLIE\n\t\tCreak. He started walking around towards \n\t\tmy left. Creak. Creak. \"Assume the \n\t\tposition, Mr. Dalton.\"\n\nThe door opens and Keating walks in. Many of the boys get up from\ntheir seats.\n\n\t\t\t\tKEATING\n\t\tIt's all right, gentlemen. \n\n\t\t\t\tCHARLIE\n\t\tMr. Keating. \n\n\t\t\t\tKEATING\n\t\tMr. Dalton. That was a pretty lame stunt \n\t\tyou pulled today. \n\n\t\t\t\tCHARLIE\n\t\tYou're siding with Mr. Nolan? What about \n\t\tCarpe diem and sucking all the marrow \n\t\tout of life and all that? \n\n\t\t\t\tKEATING\n\t\tSucking the marrow out of life doesn't \n\t\tmean choking on the bone. Sure there's a \n\t\ttime for daring and there's a time for \n\t\tcaution, and a wise man understands \n\t\twhich is called for. \n\n\t\t\t\tCHARLIE\n\t\tBut I thought you'd like that. \n\n\t\t\t\tKEATING\n\t\tNo. You being expelled from school is \n\t\tnot daring to me. It's stupid, 'cause \n\t\tyou'll miss some golden opportunities. \n\n\t\t\t\tCHARLIE\n\t\tYeah. Like what? \n\n\t\t\t\tKEATING\n\t\tLike, if nothing else, the opportunity \n\t\tto attend my classes. Got it, Ace? \n\n\t\t\t\tCHARLIE\n\t\tAye, aye, Captain. \n\n\t\t\t\tKEATING\n\t\tKeep your head about you. That goes for \n\t\tthe lot of you. \n\n\t\t\t\tBOYS\n\t\tYes, Captain. \n\n\t\t\t\tKEATING\n\t\tPhone call from God. If it had been \n\t\tcollect, it wouldn't been daring.\n\nKeating leaves and the boys gather around Charlie once again.\n\n\t\t\t\tCHARLIE\n\t\tAll right. Go on.\n\nEXT. CAMPUS - DAY\n\nNeil bikes away as the clock bell tolls.\n\nINT. THEATER - DAY\n\nNeil walks into the back of the theater and watches various\nactors rehearsing on stage. A smile fills his face.\n\n\t\t\t\tDIRECTOR\n\t\tWe're trying to rehearse, okay? Start. \n\n\t\t\t\tLYSANDER\n\t\tA good persuasion, therefore hear me, \n\t\tHermia. \n\n\t\t\t\tDIRECTOR\n\t\tWait, please. Excitement. I don't hear \n\t\tany excitement about this play. And take \n\t\ther hand. Bring her down the stage and \n\t\tstop. And \"There, gentle Hermia.\" Okay? \n\t\tTry again.\n\nINT. HALLWAY - DAY\n\nThe bell rings and students rush down the hall.\n\n\t\t\t\tBOY\n\t\tWhat's for dinner? \n\n\t\t\t\tPITTS\n\t\tSpaghetti and meatballs!\n\nNeil comes up the stairs as everyone else swarms down to the cafeteria.\n\n\t\t\t\tNEIL\n\t\tSave some for me. \"But, room, Fairy! \n\t\tHere comes Oberon.\"\n\nNeil opens the door to his room and sees his father sitting at his desk.\n\n\t\t\t\tNEIL\n\t\tFather. \n\n\t\t\t\tMR. PERRY\n\t\tNeil. \n\n\t\t\t\tNEIL\n\t\tWait a minute. Before you say anything, \n\t\tplease let me ex-\n\nMr. Perry rises from the desk.\n\n\t\t\t\tMR. PERRY\n\t\tDon't you dare talk back to me! It's bad \n\t\tenough that you've wasted your time with \n\t\tthis, this absurd acting business. But \n\t\tyou deliberately deceived me! How, how, \n\t\thow did you expect to get away with \n\t\tthis? Answer me. Who put you up to it? \n\t\tWas it this new man? This, uh, Mr. \n\t\tKeating? \n\n\t\t\t\tNEIL\n\t\tNo. Nobody-- I thought I'd surprise you. \n\t\tI've gotten all A's in every class. \n\n\t\t\t\tMR. PERRY\n\t\tDid you think I wasn't going to find \n\t\tout? \"Oh, my niece is in a play with \n\t\tyour son,\" says Mrs. Marks. \"No, no, \n\t\tno,\" I say, \"you must be mistaken. My \n\t\tson's not in a play.\" You made me a liar \n\t\tof me, Neil! Now, tomorrow you go to \n\t\tthem and you tell them that you're \n\t\tquitting. \n\n\t\t\t\tNEIL\n\t\tNo, I can't. I have the main part. The \n\t\tperformance is tomorrow night. \n\n\t\t\t\tMR. PERRY\n\t\tI don't care if the world comes to an \n\t\tend tomorrow night. You are through with \n\t\tthat play. Is that clear? Is that clear? \n\n\t\t\t\tNEIL\n\t\tYes, sir. \n\nMr. Perry goes to leave and then turns around.\n\n\t\t\t\tMR. PERRY\n\t\tI made a great many sacrifices to get \n\t\tyou here, Neil, and you will not let me \n\t\tdown. \n\n\t\t\t\tNEIL\n\t\tNo, sir. \n\nINT. KEATING'S OFFICE - NIGHT\n\nKeating is seated at his desk. He is writing a letter and occasionally\nlooks up at the framed photo on his desk of a woman playing the cello.\nThere is a knock at the door.\n\n\t\t\t\tKEATING\n\t\tIt's open.\n\nNeil enters and closes the door behind him. He appears to be nervous.\n\n\t\t\t\tKEATING\n\t\tNeil, what's up? \n\n\t\t\t\tNEIL\n\t\tCan I speak to you a minute? \n\n\t\t\t\tKEATING\n\t\tCertainly. Sit down.\n\nNeil goes to take a seat but notices the chair is piled up with books.\nNeil picks them up and Keating gets up from his seat to help him.\n\n\t\t\t\tNEIL\n\t\tI'm sorry. Here. \n\n\t\t\t\tKEATING\n\t\tExcuse me. Get you some tea? \n\n\t\t\t\tNEIL\n\t\tTea. Sure.\n\nKeating goes to a table in the corner and begins pouring several cups.\n\n\t\t\t\tKEATING\n\t\tLike some milk or sugar in that? \n\n\t\t\t\tNEIL\n\t\tNo, thanks. \n\n\t\t\t\tNEIL\n\t\tGosh, they don't give you much room \n\t\taround here. \n\n\t\t\t\tKEATING\n\t\tNo, it's part of the monastic oath. They \n\t\tdon't want worldly things distracting me \n\t\tfrom my teaching.\n\nKeating gives Neil a cup of tea and they return to their seats. Neil\nlooks at the photo on the desk.\n\n\t\t\t\tNEIL\n\t\tShe's pretty. \n\n\t\t\t\tKEATING\n\t\tShe's also in London. Makes it a little \n\t\tdifficult. \n\n\t\t\t\tNEIL\n\t\tHow can you stand it? \n\n\t\t\t\tKEATING\n\t\tStand what? \n\n\t\t\t\tNEIL\n\t\tYou can go anywhere. You can do \n\t\tanything. How can you stand being here? \n\n\t\t\t\tKEATING\n\t\t'Cause I love teaching. I don't wanna be \n\t\tanywhere else. \n\n\t\t\t\tKEATING\n\t\tWhat's up? \n\n\t\t\t\tNEIL\n\t\tI just talked to my father. He's making \n\t\tme quit the play at Henley Hall. \n\t\tActing's everything to me. I-- But he \n\t\tdoesn't know. He-- I can see his point. \n\t\tWe're not a rich family like Charlie's, \n\t\tand we-- But he's planning the rest of \n\t\tmy life for me, and I-- H-He's never \n\t\tasked me what I want. \n\n\t\t\t\tKEATING\n\t\tHave you ever told your father what you \n\t\tjust told me? About your passion for \n\t\tacting. You ever show him that? \n\n\t\t\t\tNEIL\n\t\tI can't. \n\n\t\t\t\tKEATING\n\t\tWhy not? \n\n\t\t\t\tNEIL\n\t\tI can't talk to him this way. \n\n\t\t\t\tKEATING\n\t\tThen you're acting for him, too. You're \n\t\tplaying the part of the dutiful son. I \n\t\tknow this sounds impossible, but you \n\t\thave to talk to him. You have to show \n\t\thim who you are, what your heart is. \n\n\t\t\t\tNEIL\n\t\tI know what he'll say. He'll tell me \n\t\tthat acting's a whim, and I should \n\t\tforget it. That how they're counting on \n\t\tme. He'll just tell me to put it out of \n\t\tmy mind, \"for my own good.\" \n\n\t\t\t\tKEATING\n\t\tYou are not an indentured servant. If \n\t\tit's not a whim for you, you prove it to \n\t\thim by your conviction and your passion. \n\t\tYou show him that And if he still \n\t\tdoesn't believe you, well, by then \n\t\tyou'll be out of school and you can do \n\t\tanything you want. \n\nA tear falls down Neil's cheek and he wipes it away.\n\n\t\t\t\tNEIL\n\t\tNo. What about the play? The show's \n\t\ttomorrow night. \n\n\t\t\t\tKEATING\n\t\tWell, you have to talk to him before \n\t\ttomorrow night. \n\n\t\t\t\tNEIL\n\t\tIsn't there an easier way? \n\n\t\t\t\tKEATING\n\t\tNo. \n\n\t\t\t\tNEIL\n\t\tI'm trapped. \n\n\t\t\t\tKEATING\n\t\tNo, you're not.\n\nEXT. CAMPUS - DAY\n\nKnox exits one of the doors. The ground is covered with a thick\nlayer of snow. He looks around to see if anyone is about and then\nhurries over to the bike rack. grabbing one of the bikes, he hurries\noff.\n\nINT. SCHOOL HALLWAY - DAY\n\nA crowd of students come in from the cold. Knox pushes his way through\nthem, carrying a handful of wildflowers. He begins searching for Chris.\n\n\t\t\t\tKNOX\n\t\tChris!\n\nHe approaches a girl with hair similar to Chris' and turns her around,\nonly to realize that it's not her.\n\n\t\t\t\tKNOX\n\t\tChris Noel. Do you know where she is? \n\n\t\t\t\tGIRL\n\t\tUm, I think she's in room 111.\n\nThe girl points down the hallway and Knox sets off in that direction.\n\n\t\t\t\tKNOX\n\t\tThanks.\n\nChris is at her locker talking to a friend. She just closes her locker\nas she notices Knox coming towards her. She turns away.\n\n\t\t\t\tKNOX\n\t\tExcuse me. Chris. \n\n\t\t\t\tCHRIS\n\t\tKnox, what are you doing here? \n\n\t\t\t\tKNOX\n\t\tI came to apologize for the other night. \n\t\tI brought you these and a poem I wrote \n\t\tfor you.\n\nChris pulls him aside, out of the main hallway.\n\n\t\t\t\tCHRIS\n\t\tKnox, don't you know that, if Chet finds \n\t\tyou here he'll kill you? \n\n\t\t\t\tKNOX\n\t\tI can't care. I love you, Chris. \n\n\t\t\t\tCHRIS\n\t\tKnox, you're crazy. \n\n\t\t\t\tKNOX\n\t\tLook, I acted like a jerk and I know it. \n\t\tPlease, accept these. Please. \n\n\t\t\t\tCHRIS\n\t\tNo. No-- I, I can't. Forget it.\n\nChris walks away. The school bell rings and she enters her\nclassroom, closing the door behind her. Undaunted, Knox follows,\nopening the door and standing before her desk.\n\n\t\t\t\tCHRIS\n\t\tKnox, I don't believe this. \n\n\t\t\t\tKNOX\n\t\tAll I'm asking you to do is listen.\n\nAs Knox begins to read his poem, the classroom grows quiet as\neveryone stops to listen.\n\n\t\t\t\tKNOX\n\t\tThe heavens made a girl named Chris \n\t\tWith hair and skin of gold. \n\t\tTo touch her would be paradise.\n\nChris holds her head in her hands in embarrassment.\n\nINT. CAMPUS KITCHEN - DAY\n\nKnox sneaks in through a side door. He snatches a slice of toast\nfrom the counter and motions to one of the staff to keep secret.\nHe then begins to eat the toast as he hurries away.\n\nINT. STAIRWAY - DAY\n\nThe school bell rings and Knox pushes his way up the stairs past\nthe slower students. At the top he joins the other boys where they\nare grabbing their books.\n\n\t\t\t\tCHARLIE\n\t\tGet out of here. Cameron, you fool.\n\nCharlie notices Knox and grabs his jacket.\n\n\t\t\t\tCHARLIE\n\t\tHey, how'd it go? Did you read it to\n\t\ther? \n\n\t\t\t\tKNOX\n\t\tYeah.\n\nThe boys begin to get all excited but Charlie shushes them.\n\n\t\t\t\tPITTS\n\t\tWhat'd she say? \n\n\t\t\t\tKNOX\n\t\tNothing. \n\n\t\t\t\tCHARLIE\n\t\tNothing. What do you mean, nothing? \n\n\t\t\t\tKNOX\n\t\tNothing. But I did it.\n\nKnox walks away down the hall and the others chase after him.\n\n\t\t\t\tCHARLIE\n\t\tWhat did she say? I know she had to say \n\t\tsomething. \n\n\t\t\t\tPITTS\n\t\tCome here, Knox. \n\n\t\t\t\tKNOX\n\t\tSeize the day!\n\nINT. KEATING'S CLASSROOM - DAY\n\nKeating walks from the front of the classroom to Neil's desk. Neil\nis the only student remaining in the class.\n\n\t\t\t\tKEATING\n\t\tDid you talk to your father? \n\n\t\t\t\tNEIL\n\t\tUh, he didn't like it one bit, but at \n\t\tleast he's letting me stay in the play. \n\t\tHe won't be able to make, make it. He's \n\t\tin Chicago. But, uh, I think he's gonna \n\t\tlet me stay with acting. \n\n\t\t\t\tKEATING\n\t\tReally? You told him what you told me? \n\n\t\t\t\tNEIL\n\t\tYeah. He wasn't happy. But he'll be gone \n\t\tat least four days. I don't think he'll \n\t\tmake the show, but I think he'll let me \n\t\tstay with it. \"Keep up the school work.\" \n\t\tThanks.\n\nNeil picks up his books and leaves.\n\nINT. BATHROOM - NIGHT\n\nThe boys are grooming themselves in front of the mirrors.\n\n\t\t\t\tPITTS\n\t\tBeautiful baby. \n\n\t\t\t\tMEEKS\n\t\tBeautiful baby. Henley Hall, here I \n\t\tcome. \n\n\t\t\t\tCAMERON\n\t\tExcuse me, just a moment. Yes. You're so \n\t\tcute.\n\nCameron runs a comb through his hair and Todd tries to mess it up.\n\n\t\t\t\tCAMERON\n\t\tCome on, Todd. I'm trying to fix \n\t\tthis. \n\n\t\t\t\tTODD\n\t\tCome on, Nuwanda. You're gonna miss \n\t\tNeil's entrance. \n\n\t\t\t\tPITTS\n\t\tHe said something about getting red \n\t\tbefore we left. \n\n\t\t\t\tCAMERON\n\t\tGetting red? What does that mean? \n\n\t\t\t\tPITTS\n\t\tI, uh-- Well, you know Charlie.\n\nOne of the stalls opens and Charlie's hand emerges, holding a small\nbrush and a bottle of red paint.\n\n\t\t\t\tCAMERON\n\t\tSo, Charlie, what's this \"getting red\" \n\t\tbit?\n\nCharlie opens his unbuttoned shirt to show a large red lightning bolt\npainted down his chest.\n\n\t\t\t\tTODD\n\t\tW-What is that? \n\n\t\t\t\tCHARLIE\n\t\tIt's an Indian warrior symbol for \n\t\tvirility. Makes me feel potent, like it \n\t\tcan drive girls crazy.\n\nCharlie buttons up his shirt as everyone prepares to leave.\n\n\t\t\t\tTODD\n\t\tOh, come on, Charlie. The girls are \n\t\twaiting.\n\nINT. HALLWAY - NIGHT\n\nThe boys are walking down the hall to leave. Cameron stops and stares.\nThe other boys notice and stop as well. Charlie softly whistles at Chris\nstanding by the door. Knox stares at her in surprise\n\n\t\t\t\tKNOX\n\t\tChris.\n\nKnox leaves the other boys to join her.\n\n\t\t\t\tKNOX\n\t\tWhat are you doing here? \n\n\t\t\t\tKEATING (O.S.)\n\t\tGentlemen, let's go. \n\n\t\t\t\tKNOX\n\t\tGo ahead, guys. I'll catch up. \n\n\t\t\t\tCHARLIE\n\t\tYeah, come on, guys.\n\nCharlie hustles the boys away. Meeks remains staring at her. Charlie\nreturns to drag him away.\n\n\t\t\t\tKNOX\n\t\tChris, you can't be in here. I-If they \n\t\tcatch you, we're both gonna be in big \n\t\ttrouble. \n\n\t\t\t\tCHRIS\n\t\tOh, but it's fine--\n\nKnox shushes her and leads her out the door.\n\nEXT. CAMPUS - NIGHT\n\nSnow is lightly falling as Chris and Knox walk outside.\n\n\t\t\t\tCHRIS\n\t\tIt's fine for you to come barging into \n\t\tmy school and make a complete fool out \n\t\tof me? \n\n\t\t\t\tKNOX\n\t\tI didn't mean to make a fool out of you. \n\n\t\t\t\tCHRIS\n\t\tWell, you did. Chet found out. And it \n\t\ttook everything I could do to keep him \n\t\tfrom coming here and killing you. Knox, \n\t\tyou have got to stop this stuff. \n\n\t\t\t\tKNOX\n\t\tI can't, Chris. I love you. \n\n\t\t\t\tCHRIS\n\t\tKnox, you say that over and over. You \n\t\tdon't, you don't even know me. \n\nKeating calls out from a nearby car.\n\n\t\t\t\tKEATING\n\t\tWill you be joining us, Mr. Overstreet?\n\n\t\t\t\tKNOX\n\t\tGo ahead, Captain. I'll walk. \n\n\t\t\t\tCHRIS\n\t\tKnox, Knox, it just so happens that I \n\t\tcould care less about you? \n\n\t\t\t\tKNOX\n\t\tThen you wouldn't be here warning me \n\t\tabout Chet. \n\n\t\t\t\tCHRIS\n\t\tI have to go. I'm gonna be late for the \n\t\tplay. \n\n\t\t\t\tKNOX\n\t\tAre you going with him? \n\n\t\t\t\tCHRIS\n\t\t\t\t   (laughs)\n\t\tChet? To a play? Are you kidding? \n\n\t\t\t\tKNOX\n\t\tThen come with me. \n\n\t\t\t\tCHRIS\n\t\tKnox, you are so infuriating. \n\n\t\t\t\tKNOX\n\t\tCome on, Chris. Just give me one chance. \n\t\tIf you don't like me after tonight, I'll \n\t\tstay away forever. \n\n\t\t\t\tCHRIS\n\t\tUh-huh. \n\n\t\t\t\tKNOX\n\t\tI promise. Dead Poets Honor. You come \n\t\twith me tonight. And then, if you don't \n\t\twant to see me again, I swear I'll bow \n\t\tout. \n\t\t\n\t\t\t\tCHRIS\n\t\tYou know what would happen if Chet found \n\t\tout? \n\n\t\t\t\tKNOX\n\t\tHe won't know anything. We'll sit in the \n\t\tback and sneak away as soon as it's \n\t\tover. \n\n\t\t\t\tCHRIS\n\t\tAnd I suppose you would promise that \n\t\tthis would be the end of it. \n\n\t\t\t\tKNOX\n\t\tDead Poets Honor. \n\n\t\t\t\tCHRIS\n\t\tWhat is that? \n\n\t\t\t\tKNOX\n\t\tMy word.\n\nChris walks away from him and then turns to face him.\n\n\t\t\t\tCHRIS\n\t\tYou are so infuriating.\n\nChris gestures for Knox to follow her. Charlie does a little \ntwirl as he joins her and puts his arm around her. They walk away.\n\nINT. THEATER - NIGHT\n\nThe audience is packed. The stage is set up to resemble a forest and\nlights dance about it. From behind a bush, Neil emerges, wearing a\ncrown of twigs and berries and twigs on his hands. In the audience,\nCharlie emerges from his seat, all excited.\n\n\t\t\t\tCHARLIE\n\t\tHey, there he is! Hey, hey.\n\nCameron shoves him back into his seat.\n\n\t\t\t\tKEATING\n\t\tShh, boys.\n\nOn stage, Neil hides behind a tree as a girl emerges, similarly clad,\nbut with flowers in her hair. Neil sneaks over to the girl.\n\n\t\t\t\tFAIRY\n\n\t\tEither I mistake your shape and making \n\t\tquite, \n\t\tOr else you are that shrewd and knavish \n\t\tsprite \n\t\tCall'd Robin Goodfellow: \n\n\t\t\t\tPUCK\n\n\t\tThou speak'st aright;\n\nIn the audience, Chris and Knox enter and are shown to seats.\n\n\t\t\t\tPUCK\n\t\tI am that merry wanderer of the night. \n\t\tI jest to Oberon and make him smile \n\t\tWhen I a fat and bean-fed horse beguile,\n\nPuck makes horse sounds and the audience laughs.\n\n\t\t\t\tPUCK\n\t\tNeighing in likeness of a filly foal: \n\t\tAnd sometime lurk I in a gossip's bowl, \n\t\tIn very likeness of a roasted crab, \n\t\tAnd when she drinks, against her lips I \n\t\tbob \n\t\tAnd on her wither'd dewlap pour the ale. \n\t\tThe wisest aunt, telling the saddest \n\t\ttale,\n\nIn the audience, Charlie leans over towards Keating.\n\n\t\t\t\tCHARLIE\n\t\t\t\t  (whispering)\n\t\tHe's good. He's really good.\n\nKeating gives a thumbs up.\n\n\t\t\t\tPUCK\n\n\t\tSometime for three-foot stool mistaketh \n\t\tme; \n\t\tThen slip I from her bum, down topples \n\t\tshe, \n\t\tAnd \"tailor\" cries, and falls into a \n\t\tcough; \n\t\tAnd then the whole quire hold their hips \n\t\tand laugh, \n\t\tAnd waxen in their mirth and neeze and \n\t\tswear \n\t\tA merrier hour was never wasted there. \n\t\tBut, room, Fairy! here comes Oberon. \n\n\t\t\t\tFAIRY\n\n\t\tAnd here my mistress. Would that he were \n\t\tgone!\n\nThe two actors hide behind the trees, lifting their twig covered\nhands to hide themselves.\n\nINT. THEATER - NIGHT\n\nTwo other actors are onstage. \n\n\t\t\t\tLYSANDER\n\n\t\tThen by your side no bed-room me deny; \n\t\tFor lying so, Hermia, I do not lie \n\n\t\t\t\tHERMIA\n\n\t\tLysander riddles very prettily: \n\t\tNow much beshrew my manners and my \n\t\tpride, \n\t\tIf Hermia meant to say Lysander lied. \n\t\tBut, gentle friend, for love and \n\t\tcourtesy \n\t\tLie further off; in human modesty, \n\t\tSuch separation as may well be said \n\t\tBecomes a virtuous bachelor and a maid, \n\t\tand, good night, sweet friend: \n\t\tThy love ne'er alter till thy sweet life \n\t\tend!\n\nNeil is watching the actors from the wing. He glances out at the audience\nand sees his father enter the back of the theater. Neil backs away into\nthe shadows.\n\n\t\t\t\tLYSANDER\n\n\t\tAmen, amen, to that fair prayer, say I;\n\nThe director breaks Neil out of his thoughts.\n\n\t\t\t\tDIRECTOR\n\t\tNeil. That's your cue, Neil. Come on, \n\t\tNeil. Here's your crown. Let's go.\n\nNeil reluctantly replaces his crown and follows her.\n\nINT. THEATER - NIGHT\n\nOn stage, Neil collects dew in a leaf and holds it over his head while\nfairies dance about. In the audience, Knox takes Chris' hand in his.\n\nINT. THEATER - NIGHT\n\nThe stage is dark. A spotlight comes on to reveal Neil with his back to\nthe audience. He slowly turns around to face the audience and his father.\n\n\t\t\t\tPUCK\n\n\t\tIf we shadows have offended,\n\nNeil directs his eyes at his father, who stills stands at the back\nof the theater.\n\n\t\t\t\tPUCK\n\t\tThink but this, and all is mended, \n\t\tThat you have but slumber'd here \n\t\tWhile these visions did appear. \n\t\tAnd this weak and idle theme, \n\t\tNo more yielding but a dream, \n\t\tGentles, do not reprehend: \n\t\tIf you pardon, we will mend: \n\t\tAnd, as I am an honest Puck, \n\t\tIf we have unearned luck \n\t\tNow to 'scape the serpent's tongue, \n\t\tWe will make amends ere long; \n\t\tElse the Puck a liar call; \n\t\tSo, good night unto you all. \n\t\tGive me your hands, if we be friends, \n\t\tAnd Robin shall restore amends.\n\nNeil backs away and the curtains close as the audience begins to\napplaud enthusiastically. Behind the curtain numerous people\ncongratulate Neil as they line up for the curtain call. The curtains\nopen. Charlie and the other boys rise to their feet, followed quickly\nby the rest of the audience. The actors bow to continued applause. The\nactors push Neil forward and he takes a second bow.\n\n\t\t\t\tBOYS\n\t\tYawp! \n\n\t\t\t\tKNOX\n\t\tYeah, Neil!\n\nThe curtain closes again and Neil turns around, letting out an\nexcited sigh. Various actors continue to congratulate him. Neil\nlets out a yell as he walks offstage. In the audience, while others\nare leaving, Mr. Perry approaches a woman.\n\n\t\t\t\tMR. PERRY\n\t\tExcuse me, I'm Neil's father. I need to \n\t\tsee him.\n\nBackstage, the woman approaches Neil.\n\n\t\t\t\tWOMAN\n\t\tNeil, Your father. He's-\n\nNeil nods in agreement.\n\n\t\t\t\tACTOR\n\t\tWhat did you think?\n\n\t\t\t\tWOMAN\n\t\tReally I thought you were all just \n\t\twonderful!\n\nNeil emerges from the curtains, carrying his costume. The theater is\nnearly empty now, except for Mr. Perry standing at the back. Neil\nsmiles at him but the smile quickly disappears.\n\nEXT. THEATER - NIGHT\n\nMr. Perry pushes his way through the crowd of people, with Neil close\nbehind.\n\n\t\t\t\tMR. PERRY\n\t\tExcuse me. Excuse me. Excuse me.\n\nThe boys notice Neil and try to dtop him to talk.\n\n\t\t\t\tCHARLIE\n\t\tNeil, Neil, you were great. \n\n\t\t\t\tNEIL\n\t\tI can't, guys. \n\n\t\t\t\tTODD\n\t\tNeil! Neil!\n\nOutside of the crowd, Keating manages to catch up to Neil. He takes\nhold of Neil's coat.\n\n\t\t\t\tKEATING\n\t\tNeil. Neil. You have the gift. What a \n\t\tperformance You left even me speechless. \n\t\tYou have to stay with-\n\nMr. Perry returns from his car and shoves Neil aside.\n\n\t\t\t\tMR. PERRY\n\t\tGet in the car. Keating, you stay away \n\t\tfrom my son. \n\n\t\t\t\tCHARLIE\n\t\tNeil! Neil! Mr. Perry, come on. \n\n\t\t\t\tKEATING\n\t\tDon't make it any worse than it is.\n\nNeil and Mr. Perry get into their car and drive away. Keating\nstares after them.\n\n\t\t\t\tCHARLIE\n\t\tIs it okay if we walk back? Captain?\n\nCharlie motions Todd to follow.\n\n\t\t\t\tCHARLIE\n\t\tKnox.\n\nThe boys leave and Keating continues to stare after the car, wiping\nthe falling snow from his face.\n\nINT. MR. PERRY'S STUDY - NIGHT\n\nA photo of Neil standing stiffly with his parents sits on a table\nbetween a glass of alcohol and a half filled ashtray. Mrs. Perry\nwatches through the window as her husband and son arrive and then\ntakes a nervous puff on her cigarette before sitting down. Mr.\nPerry walks in with Neil close behind him. Neil sits down beside the\ndesk while Mr. Perry remains standing.\n\n\t\t\t\tMR. PERRY\n\t\tWe're trying very hard to understand why \n\t\tit is that you insist on defying us. \n\t\tWhatever the reason, we're not gonna let \n\t\tyou ruin your life. Tomorrow I'm \n\t\twithdrawing you from Welton and \n\t\tenrolling you in Braden Military School. \n\t\tYou're going to Harvard and you're gonna \n\t\tbe a doctor. \n\n\t\t\t\tNEIL\n\t\tBut that's ten more years. Father, \n\t\tthat's a lifetime! \n\n\t\t\t\tMR. PERRY\n\t\tOh, stop it. Don't be so dramatic. You \n\t\tmake it sound like a prison term. You \n\t\tdon't understand, Neil. You have \n\t\topportunities that I never even dreamt \n\t\tof and I am not going to let you waste \n\t\tthem.\n\nNeil rises to his feet.\n\n\t\t\t\tNEIL\n\t\tI've got to tell you what I feel.\n\nMrs. Perry stands up.\n\n\t\t\t\tMRS. PERRY\n\t\tWe've been so worried about-- \n\n\t\t\t\tMR. PERRY\n\t\tWhat? What? Tell me what you feel. What \n\t\tis it?\n\nNeil looks to his mother and then back to his father but says\nnothing.\n\n\t\t\t\tMR. PERRY\n\t\tIs it more of this, this acting \n\t\tbusiness? Because you can forget that. \n\t\tWhat? \n\n\t\t\t\tNEIL\n\t\tNothing.\n\nNeil sits back down dejectedly.\n\n\t\t\t\tMR. PERRY\n\t\tNothing? Well, then, let's go to bed.\n\nMr. Perry leaves. Mrs. Perry pauses on her way out and kneels\nbehind Neil.\n\n\t\t\t\tNEIL\n\t\tI was good. I was really good.\n\nMrs. Perry nods slightly.\n\t\t\t\tMRS. PERRY\n\t\tGo on, get some sleep.\n\nINT. MR. PERRY'S BEDROOM - NIGHT\n\nMrs. Perry sits on the side of the bed with her back to her\nhusband. Mr. Perry removes his robe and slippers before\ngetting in to bed. Mrs. Perry begins to cry as he turns out\nthe light.\n\n\t\t\t\tMR. PERRY\n\t\tIt's all right. It's going to be all \n\t\tright.\n\nINT. NEIL'S BEDROOM - NIGHT\n\nNeil's pyjamas, bathrobe, towel, and shaving kit are all neatly\nlaid out on his bed. Neil touches his pyjamas lightly and then\nremoves his coat and shirt. He walks over to the windows and\nopens them, taking several deep breaths. He places the crown of\ntwigs on his head and then closes his eyes, slowly letting his head\nfall to his chest.\n\nINT. HALLWAY - NIGHT\n\nA door opens and Neil emerges, slowly walking down the stairs as if\nin a trance.\n\nINT. MR. PERRY'S STUDY - NIGHT\n\nNeil holds a key in his hands. He unlocks a drawer in his father's\ndesk and pulls out a pistol, wrapped in cloth.\n\nINT. MR. PERRY'S BEDROOM - NIGHT\n\nMr. Perry jerks up out of bed, startled and breathing fast.\n\n\t\t\t\tMR. PERRY\n\t\tWhat was that? \n\n\t\t\t\tMRS. PERRY\n\t\tWhat? \n\n\t\t\t\tMR. PERRY\n\t\tThat sound. \n\n\t\t\t\tMRS. PERRY\n\t\tWhat sound? Tom?\n\nMr. Perry turns on the light and gets up out of bed, putting on his\nrobe and slippers.\n\t\t\t\tMRS. PERRY\n\t\tWhat is it? What's wrong? \n\nMr. Perry turns on the hallway light and knocks on Neil's door. He opens\nthe door and goes inside.\n\n\t\t\t\tMR. PERRY\n\t\tNeil.\n\nMr. Perry notices the open window.\n\n\t\t\t\tMRS. PERRY\n\t\tTom, what is it? What's wrong? Neil?\n\nMr. Perry continues to look through the house, continuing downstairs.\n\n\t\t\t\tMR. PERRY\n\t\tNeil?\n\nMr. Perry notices the door to his study is ajar.\n\n\t\t\t\tMRS. PERRY\n\t\tI'll look outside. Neil?\n\nMr. Perry flicks the light on but sees nothing. Then he smells\nsomething. Looking closer, he sees a thin cloud of smoke rising from\nbehind his desk. As he moves around the desk he sees his gun on the\nfloor and Neil's outstretched hand.\n\n\t\t\t\tMR. PERRY\n\t\tNo!\n\nMr. Perry crouches down by his son.\n\n\t\t\t\tMR. PERRY\n\t\tOh, Neil! Oh, my God!\n\nMrs. Perry enters the room and sees her son.\n\n\t\t\t\tMRS. PERRY\n\t\tOh! No! \n\n\t\t\t\tMR. PERRY\n\t\tOh, my son! \n\n\t\t\t\tMRS. PERRY\n\t\tHe's all right. \n\n\t\t\t\tMR. PERRY\n\t\tMy son! My poor son! \n\n\t\t\t\tMRS. PERRY\n\t\t\t    (crying hysterically)\n\t\tHe's all right! He's all right! He's all \n\t\tright! He's all right! He's all right! \n\t\tHe's all right! \n\n\t\t\t\tMR. PERRY\n\t\tStop it! Stop it! Stop it.\n\nMr. Perry holds his wife and tries to comfort her.\n\nINT. TODD'S ROOM - NIGHT\n\nTodd is sleeping. Charlie reaches across to wake him. Tears are\nrunning down his face.\n\n\t\t\t\tCHARLIE\n\t\tTodd? Todd.\n\nTodd, still half asleep, tries to shrug him off.\n\n\t\t\t\tTODD\n\t\tOh, Charlie.\n\nTodd opens his eyes and sees Charlie's face\n\n\t\t\t\tTODD\n\t\tWhat is it?\n\nTodd looks over to see Pitts, Meeks, and Knox by the door.\n\n\t\t\t\tCHARLIE\n\t\tNeil's dead.\n\nEXT. CAMPUS - DAY\n\nIt is a snowy, overcast morning. Todd walks through the snow. He\nhas his coat on over his pyjamas. The other boys follow closely\nbehind him as he walks down towards the water. He stops and stares\nout at the snow-covered surroundings.\n\n\t\t\t\tTODD\n\t\tIt's so beautiful.\n\nTodd begins to gag and then goes down on his knees, vomiting into\nthe snow. The other boys huddle around him, hugging him.\n\n\t\t\t\tCHARLIE\n\t\tTodd. It's okay, Todd. \n\n\t\t\t\tPITTS\n\t\tCalm down. \n\n\t\t\t\tCHARLIE\n\t\tIt's all right, Todd. \n\n\t\t\t\tPITTS\n\t\tTodd, it's okay. It's okay, Todd. \n\n\t\t\t\tCHARLIE\n\t\tIt's all right. It's alright.\n\nCharlie grabs a handful of snow and wipes Todd's mouth with it. \n\n\t\t\t\tTODD\n\t\tHe wouldn't-- He wouldn't have done it. \n\n\t\t\t\tMEEKS\n\t\tYou can't explain it, Todd. \n\n\t\t\t\tTODD\n\t\tIt was his father! \n\n\t\t\t\tCHARLIE\n\t\tNo! \n\n\t\t\t\tTODD\n\t\tHe wouldn't have left us. It's because he-\n\t\tHe wouldn't have. His dad was-- his, his \n\t\tfather did it. \n\n\t\t\t\tCHARLIE\n\t\tTodd. \n\n\t\t\t\tTODD\n\t\tHis father killed him. He made him do it.\n\n\t\t\t\tMEEKS\n\t\tYou can't explain it, Todd.\n\nTodd pushes himself away from the boys and stumbles down the hill,\nslipping and falling in the snow.\n\n\t\t\t\tMEEKS\n\t\tTodd! \n\n\t\t\t\tCHARLIE\n\t\tLeave him be.\n\nThe boys watch as Todd runs down towards the dock by the river,\nyelling and crying. He finally seems to regain control of himself\nand walks in silence out onto the dock.\n\nINT. KEATING'S CLASSROOM - DAY\n\nKeating sits by himself at his desk. After a moment he gets up\nand walks over to Neil's desk. Opening it, he finds his copy\nof \"Five Centuries of Verse\" and flips through the first few pages.\nSitting down at the desk, he returns to the opening page, reading\nthe opening verse written there. Keating begins to sob, then closes\nthe book.\n\nINT. ASSEMBLY HALL - DAY\n\nA church service is going on. The boys have joined in the other\nstudents in a hymn. Charlie is the only one not singing. He stares\noff into nothingness.\n\n\t\t\t\tBOYS\n\t\t\t\t (singing)\n\t\tAll my life \n\t\tThy light shall surely follow me \n\t\tAnd in God's house forevermore \n\t\tMy dwelling place shall be \n\t\tAmen.\n\nMr. Nolan stands at the pulpit, with the rest of the professors\nseated behind him.\n\n\t\t\t\tMR. NOLAN\n\t\tThe death of Neil Perry is a tragedy. He \n\t\twas a fine student. One of Welton's \n\t\tbest. And he will be missed. We've \n\t\tcontacted each of your parents to \n\t\texplain the situation. Naturally, \n\t\tthey're all quite concerned. At the \n\t\trequest of Neil's family, I intend to \n\t\tconduct a thorough inquiry into this \n\t\tmatter. Your complete cooperation is \n\t\texpected.\n\nINT. CLOAKROOM - DAY\n\nThe boys (except Cameron) are sitting about the cluttered room\nwaiting. Charlie lights a cigarette.\n\n\t\t\t\tCHARLIE\n\t\tYou told him about this meeting? \n\n\t\t\t\tPITTS\n\t\tTwice. \n\n\t\t\t\tCHARLIE\n\t\tThat's it, guys. We're all fried. \n\n\t\t\t\tPITTS\n\t\tHow do you mean? \n\n\t\t\t\tCHARLIE\n\t\tCameron's a fink. He's in Nolan's office \n\t\tright now, finking. \n\n\t\t\t\tPITTS\n\t\tAbout what? \n\n\t\t\t\tCHARLIE\n\t\tThe club, Pittsie. Think about it. The \n\t\tboard of directors, the trustees and Mr. \n\t\tNolan. Do you think for one moment \n\t\tthey're gonna let this thing just blow \n\t\tover? Schools go down because of things \n\t\tlike this. They need a scapegoat.\n\nThe door opens. All the boys except Charlie hurry to put\ntheir cigarettes out and wave the smoke away. A light comes on\nand Cameron enters.\n\n\t\t\t\tCAMERON\n\t\tWhat's going on, guys? \n\n\t\t\t\tCHARLIE\n\t\tYou finked, didn't you, Cameron?\n\nCharlie gets up and approaches Cameron, tossing his cigarette away.\n\n\t\t\t\tCAMERON\n\t\tFinked? I didn't know what the hell \n\t\tyou're talking about. \n\n\t\t\t\tCHARLIE\n\t\tYou told Nolan everything about the club \n\t\tis what I'm talking about. \n\n\t\t\t\tCAMERON\n\t\tLook, in case you hadn't heard, Dalton, \n\t\tthere's something called an honor code \n\t\tat this school, all right? If a teacher \n\t\tasks you a question, you tell the truth \n\t\tor you're expelled. \n\n\t\t\t\tCHARLIE\n\t\tYou little-\n\nCharlie lunges at Cameron but Knox and Meeks hold him back.\n\n\t\t\t\tMEEKS\n\t\tCharlie! \n\n\t\t\t\tCHARLIE\n\t\tHe's a rat! He's in it up to his eyes, \n\t\tso he rattled to save himself. \n\n\t\t\t\tKNOX\n\t\tDon't touch him, Charlie. You do and \n\t\tyou're out. \n\n\t\t\t\tCHARLIE\n\t\tI'm out anyway! \n\n\t\t\t\tKNOX\n\t\tYou don't know that, not yet. \n\n\t\t\t\tCAMERON\n\t\tHe's right there, Charlie. And if you \n\t\tguys are smart, you will do exactly what \n\t\tI did and cooperate. They're not after \n\t\tus. We're the victims. Us and Neil. \n\n\t\t\t\tCHARLIE\n\t\tWhat's that mean? Who are they after? \n\n\t\t\t\tCAMERON\n\t\tWhy, Mr. Keating, of course. The \n\t\t\"Captain\" himself. I mean, you guys \n\t\tdidn't really think he could avoid \n\t\tresponsibility, did you? \n\n\t\t\t\tCHARLIE\n\t\tMr. Keating responsible for Neil? Is \n\t\tthat what they're saying? \n\n\t\t\t\tCAMERON\n\t\tWell, who else do you think, dumb ass? \n\t\tThe administration? Mr. Perry? Mr. \n\t\tKeating put us up to all this crap, \n\t\tdidn't he? If he wasn't for Mr. Keating, \n\t\tNeil would be cozied up in his room \n\t\tright now, studying his chemistry and \n\t\tdreaming of being called doctor. \n\n\t\t\t\tTODD\n\t\tThat is not true, Cameron. You know \n\t\tthat. He didn't put us to anything. Neil \n\t\tloved acting. \n\n\t\t\t\tCAMERON\n\t\tBelieve what you want, but I say let \n\t\tKeating fry. I mean, why ruin our lives?\n\nCharlie lunges at Cameron again and punches him in the face.\nCameron falls to the floor as the boys pull Charlie away. Cameron\nlifts a hand to his bloody nose.\n\n\t\t\t\tCAMERON\n\t\tYou just signed your expulsion papers, \n\t\tNuwanda.\n\nCameron rises to his feet.\n\n\t\t\t\tCAMERON\n\t\tAnd if the rest of you are smart, you'll \n\t\tdo exactly what I did. They know \n\t\teverything anyway. You can't save \n\t\tKeating, but you can save yourselves.\n\nCameron walks away, closing the door behind him.\n\nINT. TODD'S ROOM - DAY\n\nTodd looks out the window and watches as Hager escorts Meeks back\nto the dorm. Inside the room, Neil's bed has been stripped of all\nits bedding.\n\nINT. HALLWAY - DAY\n\nMeeks walks slowly to his room. Hager remains standing at the end of\nthe hallway.\n\n\t\t\t\tHAGER\n\t\tKnox Overstreet.\n\nKnox emerges from his room and goes to joing Hager. He gives a thumbs\nup to Todd as he passes his door. Once he leaves with Hager, Todd goes\nover to Meeks' door.\n\n\t\t\t\tTODD\n\t\tMeeks? \n\n\t\t\t\tMEEKS\n\t\tGo away. I have to study. \n\n\t\t\t\tTODD\n\t\tWhat happened to Nuwanda? \n\n\t\t\t\tMEEKS\n\t\tExpelled. \n\n\t\t\t\tTODD\n\t\tWhat'd you tell 'em? \n\n\t\t\t\tMEEKS\n\t\tNothing they didn't already know. \n\n\t\t\t\tHAGER (O.S.)\n\t\tTodd Anderson.\n\nINT. HALLWAY - DAY\n\nTodd is lead up the steps to Mr. Nolan's office by Hager.\n\nINT. NOLAN'S OFFICE - DAY\n\nTodd enters the room to see his mother and father seated opposite\nMr. Nolan's desk.\n\n\t\t\t\tMR. ANDERSON\n\t\tHello, son. \n\n\t\t\t\tMRS. ANDERSON\n\t\tHello, darling. \n\n\t\t\t\tTODD\n\t\tMom.\n\nTHe door closes behind Todd. He remains standing, not knowing\nwhat to do.\n\n\t\t\t\tMR. NOLAN\n\t\tHave a seat, Mr. Anderson.\n\nTodd sits down next to his parents.\n\n\t\t\t\tMR. NOLAN\n\t\tMr. Anderson, I think we've pretty well \n\t\tput together what's happened here. You \n\t\tdo admit to being a part of this Dead \n\t\tPoets Society?\n\nTodd says nothing.\n\n\t\t\t\tMR. ANDERSON\n\t\tAnswer him, Todd. \n\n\t\t\t\tTODD\n\t\tYes, sir.\n\nMr. Nolan puts his glasses on and glances at a paper before him\nbefore removing his glasses once more.\n\n\t\t\t\tMR. NOLAN\n\t\tI have here a detailed description of \n\t\twhat occurred at your meetings. It \n\t\tdescribes how your teacher, Mr. Keating, \n\t\tencouraged you boys to organize this \n\t\tclub and to use it as a source of \n\t\tinspiration for reckless and self-\n\t\tindulgent behavior. It describes how Mr. \n\t\tKeating, both in and out of the \n\t\tclassroom, encouraged Neil Perry to \n\t\tfollow his obsession with acting when he \n\t\tknew all along it was against the \n\t\texplicit order of Neil's parents. It was \n\t\tMr. Keating's blatant abuse of his \n\t\tposition as teacher that led directly to \n\t\tNeil Perry's death. \n\nMr. Nolan motions to Todd's father, who passes along a sheet of\npaper to Todd.\n\n\t\t\t\tMR. NOLAN\n\t\tRead that document carefully, Todd. Very \n\t\tcarefully.\n\nTodd looks at the paper, which already contains the signatures of\nthe other four boys.\n\n\t\t\t\tMR. NOLAN\n\t\tIf you've nothing to add or amend, sign \n\t\tit. \n\n\t\t\t\tTODD\n\t\tWhat's gonna happen to Mr. Keating? \n\n\t\t\t\tMR. ANDERSON\n\t\tI've had enough. Sign the paper, Todd.\n\nMr. Nolan holds out a pen for Todd to take.\n\nEXT. CAMPUS - DAY\n\nMr. McAllister leads his students, textbooks in hand, through the\nsnow outside the classrooms.\n\n\t\t\t\tMcALLISTER\n\t\tGrass is gramen or herba. Lapis is \n\t\tstone. The entire building is \n\t\taedificium.\n\nKeating looks out from his office window. McAllister pauses and looks\nup at Keating, giving him a brief wave. Keating waves back.\n\nINT. KEATING'S OFFICE - DAY\n\nKeating laughs slightly as he watches McAllister from the window.\nInside, all his belongings have been packed up.\n\nINT. KEATING'S CLASSROOM - DAY\n\nThe students are all seated at their desks in silence. Everyone looks\nas the door opens. They quickly stand as Mr. Nolan enters the room.\n\n\t\t\t\tMR. NOLAN\n\t\tSit.\n\nThe students sit once again as Mr. Nolan walks to the front of the room.\n\n\t\t\t\tMR. NOLAN\n\t\tI'll be teaching this class through \n\t\texams. We'll find a permanent English \n\t\tteacher during the break. Who will tell \n\t\tme where you are in the Pritchard \n\t\ttextbook? \n\n\t\t\t\tMR. NOLAN\n\t\tMr. Anderson?\n\n\t\t\t\tTODD\n\t\tUh, in the, in the Pr- \n\n\t\t\t\tMR. NOLAN\n\t\tI can't hear you, Mr. Anderson. \n\n\t\t\t\tTODD\n\t\tIn the, in the, in the Pritchard? \n\n\t\t\t\tMR. NOLAN\n\t\tKindly inform me, Mr. Cameron. \n\n\t\t\t\tCAMERON\n\t\tWe skipped around a lot, sir. We covered \n\t\tthe Romantics and some of the chapters \n\t\ton Post Civil War literature. \n\n\t\t\t\tMR. NOLAN\n\t\tWhat about the Realists? \n\n\t\t\t\tCAMERON\n\t\tI believe we skipped most of that, sir. \n\n\t\t\t\tMR. NOLAN\n\t\tAll right, then, we'll start over. What \n\t\tis poetry?\n\nThere is a knock at the classroom door.\n\n\t\t\t\tMR. NOLAN\n\t\tCome.\n\nThe students look back as the door opens. They quickly turn\naway when hey see it is Keating.\n\n\t\t\t\tKEATING\n\t\tExcuse me. I came for my personals. \n\t\tShould I come back after class? \n\n\t\t\t\tMR. NOLAN\n\t\tGet them now, Mr. Keating. \n\n\t\t\t\tMR. NOLAN\n\t\tGentlemen, turn to page 21 of the \n\t\tintroduction. Mr. Cameron, read aloud \n\t\tthe excellent essay by Dr. Pritchard on \n\t\t\"Understanding Poetry.\"\n\nTodd slowly closes his book. Keating opens the door to the tiny\nroom off the classroom.\n\n\t\t\t\tCAMERON\n\t\tThat page has been ripped out, sir. \n\n\t\t\t\tMR. NOLAN\n\t\tWell, borrow somebody else's book. \n\n\t\t\t\tCAMERON\n\t\tThey're all ripped out, sir. \n\n\t\t\t\tMR. NOLAN\n\t\tWhat do you mean, they're all ripped \n\t\tout? \n\n\t\t\t\tCAMERON\n\t\tSir, we, uh- \n\n\t\t\t\tMR. NOLAN\n\t\tNever mind.\n\nMr. Nolan takes his own book over to Cameron's desk and then\nslaps the open page.\n\n\t\t\t\tMR. NOLAN\n\t\tRead!\n\nAs Cameron begins to read, Keating looks out at Todd as he puts\nhis scarf on. Todd looks at him for a moment and then glances away.\n\n\t\t\t\tCAMERON\n\t\t\"Understanding Poetry by Dr. J Evans \n\t\tPritchard, Ph.D. To fully understand \n\t\tpoetry, we must first be fluent with its \n\t\tmeter, rhyme and figures of speech, then \n\t\task two questions: 1) How artfully has \n\t\tthe objective of the poem been rendered \n\t\tand 2)...\"\n\nThe door squeaks as Keating shuts it behind him. Cameron pauses. \n\n\t\t\t\tCAMERON\n\t\t\"... How important is that objective? \n\t\tQuestion 1 rates the poem's perfection; \n\t\tquestion 2 rates its importance. And \n\t\tonce these questions have been answered, \n\t\tdetermining the poem's greatness becomes \n\t\ta relatively simple matter. If the \n\t\tpoem's score for perfection is plotted \n\t\ton the horizontal of a graph--\"\n\nKeating passes by Todd and the others and gets to the back of the\nclassroom before Todd leaps up from his seat and turns to face him.\n\n\t\t\t\tTODD\n\t\tMr. Keating! They made everybody sign \n\t\tit. \n\nMr. Nolan gets up from his desk and approaches Todd.\n\n\t\t\t\tMR. NOLAN\n\t\tQuiet, Mr. Anderson. \n\n\t\t\t\tTODD\n\t\tYou gotta believe me. It's true. \n\n\t\t\t\tKEATING\n\t\tI do believe you, Todd. \n\n\t\t\t\tMR. NOLAN\n\t\tLeave, Mr. Keating. \n\n\t\t\t\tTODD\n\t\tBut it wasn't his fault! \n\n\t\t\t\tMR. NOLAN\n\t\tSit down, Mr. Anderson!\n\nTodd reluctantly returns to his seat.\n\n\t\t\t\tMR. NOLAN\n\t\tOne more outburst from you or anyone\n\t\telse, and you're out of this school!\n\t\tLeave, Mr. Keating.\n\nKeating hesitates at the back of the classroom.\n\n\t\t\t\tMR. NOLAN\n\t\tI said leave, Mr. Keating.\n\nKeating slowly turns and heads to the door. As he opens\nit, Todd, stands upon his desk and turns to Keating.\n\n\t\t\t\tTODD\n\t\tO Captain! My Captain! \n\n\t\t\t\tMR. NOLAN\n\t\tSit down, Mr. Anderson!\n\nKeating pauses at the door and looks back at Todd on his desk.\n\n\t\t\t\tMR. NOLAN\n\t\tDo you hear me? Sit down! Sit down! This \n\t\tis your final warning, Anderson. How \n\t\tdare you? Do you hear me?\n\nAfter a moment of indecision, Knox climbs up onto his desk.\n\n\t\t\t\tKNOX\n\t\tO Captain! My Captain! \n\n\t\t\t\tMR. NOLAN\n\t\tMr. Overstreet, I warn you! Sit down!\n\nPitts climbs up onto his desk, followed by several others,\nincluding Meeks.\n\n\t\t\t\tMR. NOLAN\n\t\tSit down! Sit down. All of you. I want \n\t\tyou seated. Sit down. Leave, Mr. \n\t\tKeating.\n\nMore students stand on their desks until half the class is standing.\n\n\t\t\t\tMR. NOLAN\n\t\tAll of you, down. I want you seated. Do \n\t\tyou hear me? \n\n\t\t\t\tMR. NOLAN\n\t\tSit down! \n\nKeating stands in the doorway, staring up at the boys in wonder. A\nsmile comes to his face.\n\n\t\t\t\tKEATING\n\t\tThank you, boys. Thank you.\n   \n\n\n\n\n\n\n\n\nDead Poets Society\nWriters :   Tom Schulman\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:42.389037"}