{"title": "Deadpool", "film_link": "/Movie Scripts/Deadpool Script.html", "script_link": "/scripts/Deadpool.html", "info_raw": "\n\nDeadpool Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.67 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Rhett Reese  Paul Wernick\nGenres  Action  Adventure  Comedy\nScript Date : November 2015\nMovie Release Date : February 2016\n\nRead \"Deadpool\" Script\n\n\n", "script": "\n\r\n\r\n\r\n                         DEADPOOL\r\n\r\n\r\n\r\n                        Written by\r\n\r\n                 Rhett Reese & Paul Wernick\r\n\r\n\r\n\r\n\r\n                         Final Shooting Script - November 16, 2015\r\n\r\n\r\n\r\n\r\n\r\n\r\n    OVER BLACK. Low volume, through a tinny speaker, JUICE\r\n    NEWTON'S `ANGEL OF THE MORNING.'\r\n\r\n                                                          FADE UP ON:\r\n\r\n1   EXT./INT.   TAXI CAB - MORNING                                        1\r\n\r\n    DEADPOOL, in full DRESS REDS and MASK, quietly FIDGETS in the\r\n    BACK SEAT of a TAXI CAB as it proceeds along a CITY FREEWAY.\r\n\r\n    Deadpool adjusts the two KATANAS strapped to his back. Rolls\r\n    the WINDOWS up, down, up. Tries futilely to untwist the\r\n    seatbelt, then LUNGES forward, locking it up. Rifles through\r\n    a tourist booklet and tears out a HAUNTED SEGWAY TOUR coupon.\r\n    The CABBIE, young, thin, brown, glances back and forth from\r\n    the rear view to the road to the rear view.\r\n\r\n                          DEADPOOL\r\n                Kinda lonesome back here.\r\n\r\n    CUT TO: DEADPOOL, WEDGING himself through the opening\r\n    between the back seat and front. His two katanas don't\r\n    cooperate, catching on the Plexiglas, stalling him mid-torso.\r\n\r\n                          DEADPOOL (CONT'D)\r\n                Little help?\r\n\r\n    The cabbie grabs Deadpool's hand and pulls him through to the\r\n    front. Deadpool's head rests upside down on the bench seat\r\n    as he maneuvers his legs through. The cabbie turns the\r\n    helping hand into a HANDSHAKE, then turns down the Juice.\r\n\r\n                            CABBIE\r\n                Dopinder.\r\n\r\n                          DEADPOOL\r\n                    (still upside-down)\r\n                Pool. Deadpool.\r\n\r\n    Dopinder is remarkably UNAFFECTED by the lunatic in his cab.\r\n\r\n                          DOPINDER\r\n                Why the fancy red suit, Mr. Pool?\r\n\r\n                          DEADPOOL\r\n                It's like Christmas Day, Dopinder. Been\r\n                waiting one thousand eight hundred twenty-\r\n                two days, three hours...\r\n                    (checks `Adventure Time'\r\n                     watch)\r\n                ...and thirty-six minutes for this shit.\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                      2.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n1   CONTINUED:                                                             1\r\n\r\n    DEADPOOL turns himself RIGHT-SIDE-UP in the front seat. He\r\n    is YOKED to the gills and ARMED to the teeth. TWIN KATANAS.\r\n    TWIN DESERT EAGLE .50 CALIBER PISTOLS.\r\n\r\n    Deadpool grabs Dopinder's OPEN BAG of CORN NUTS. Dopinder\r\n    isn't quick enough to stop him. Deadpool gazes out the\r\n    window onto the city - a teeming, sooty urban sprawl that\r\n    looks almost... pre-post-apocalyptic.\r\n\r\n    Deadpool turns up his MASK. Dopinder catches a GLIMPSE of\r\n    the bottom of a SCARRED face. And quickly looks AWAY.\r\n    Deadpool eats the CORN NUTS. CRUNCH. CRUNCH. Points.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                 Nice.\r\n\r\n    Dopinder eyes his DAFFODIL DAYDREAM AIR FRESHENER and takes a\r\n    deep breath through his nose.\r\n\r\n                           DOPINDER\r\n                 Smells good, no?\r\n\r\n                           DEADPOOL\r\n                 Not the Daffodil Daydream.      The girl.\r\n\r\n    A PICTURE of a young INDIAN WOMAN is taped to the dash.\r\n\r\n                           DOPINDER\r\n                 Ah yes. Gita. She is quite lovely. She\r\n                 was supposed to make me a very agreeable\r\n                 wife. Mom and Dad chose her rather\r\n                 excellently. But Gita's heart has been\r\n                 stolen by my cousin Bandhu. Bandhu is as\r\n                 dishonorable as he is attractive.\r\n\r\n                           DEADPOOL\r\n                 Dopinder, I'm starting to think I'm in\r\n                 this cab for a reason.\r\n\r\n                           DOPINDER\r\n                 Because you hailed it?\r\n\r\n                           DEADPOOL\r\n                 No, my slender brown friend... to give\r\n                 you one crucial piece of advice: Love...\r\n                 is a beautiful thing. When it finds you,\r\n                 the whole world smells like Daffodil\r\n                 Daydream.\r\n\r\n    Deadpool's own heartbreak is palpable.        He takes another\r\n    deep, cleansing BREATH.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     3.\r\n                 Deadpool    Final Shooting Script   11/16/15\r\n1   CONTINUED: (2)                                                        1\r\n\r\n                          DEADPOOL (CONT'D)\r\n                So hold onto love tight. Go at Bandhu\r\n                hard. Get Gita back. Or else... the\r\n                whole world will taste like Mama June\r\n                after hot yoga.\r\n\r\n                          DOPINDER\r\n                And how does Ms. Mama June taste?\r\n\r\n                          DEADPOOL\r\n                Like two hobos making love under a\r\n                drizzle of Limburger- I could go all day\r\n                like this. Point is, bad.\r\n\r\n    Deadpool chucks the bag of Corn Nuts into the back seat and\r\n    pulls out his PISTOLS. He starts CHAMBERING shells into two\r\n    magazines.\r\n\r\n    Suddenly, he frantically pats himself down, like a Hollywood\r\n    agent who can't find his phone.\r\n\r\n                          DEADPOOL (CONT'D)\r\n                Shiiiit. My extra mags! I usually leave\r\n                them right by the door so I'll trip over\r\n                them! Someone must've moved them...\r\n\r\n2   INT.   DEADPOOL'S LAIR - DAY                                          2\r\n\r\n    A blind late-70's AFRICAN-AMERICAN WOMAN in a purple floral\r\n    dress enters the front door, falls as she trips over an `I\r\n    *HEART* HELLO KITTY' DUFFEL BAG of AMMUNITION, PICKS it UP,\r\n    and CARRIES it OFF.\r\n\r\n3   INT./EXT.   TAXI CAB - MORNING                                        3\r\n\r\n                          DOPINDER\r\n                Shall we turn back?\r\n\r\n                          DEADPOOL\r\n                No time. Not today.\r\n                    (slides in last bullets)\r\n                Ten, eleven, twelve... or bust.\r\n                    (chambers a shell into each\r\n                     gun, looks up)\r\n                Right here!\r\n\r\n    The cab SCREECHES to a stop on the shoulder of the highest\r\n    FREEWAY in a massive INTERCHANGE of freeways. Dopinder halts\r\n    the meter and hands Deadpool his CARD.\r\n\r\n                            DOPINDER\r\n                My card.    That's $27.50.\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                  4.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n3   CONTINUED:                                                           3\r\n\r\n                           DEADPOOL\r\n                 Oooo. I never carry a wallet when I'm\r\n                 working. Ruins the lines of my suit.\r\n                 How 'bout a crisp high five?\r\n\r\n    Dopinder stares as he and Deadpool slap skin.        Deadpool GETS\r\n    OUT of the cab.\r\n\r\n                           DOPINDER\r\n                 Be sure to... ask for me again?\r\n\r\n                           DEADPOOL\r\n                 I owe you one. Merry Christmas,\r\n                 Dopinder.\r\n\r\n                           DOPINDER\r\n                 And a convivial... Tuesday in April to\r\n                 you, Pool... Guy.\r\n\r\n    Deadpool closes the door with a flourish.         Boom.\r\n\r\n4   EXT./INT.    `THE RAFT' PRISON - MORNING                             4\r\n\r\n    A bone-white ISLAND PRISON, affectionately nicknamed `The\r\n    Raft,' looms ominously in a CITY HARBOR.\r\n\r\n    Etched in helvetica into the prison wall: `No punishment has\r\n    ever possessed enough power of deterrence to prevent the\r\n    commission of crimes.' - Hannah Arendt. Below it, GRAFFITIED\r\n    in RED SPRAY PAINT: `Until NOW'\r\n\r\n    The prison's FRONT DOORS OPEN, and out steps a handcuffed\r\n    PRISONER, 30's, ORANGE JUMPSUIT, broad shoulders, whip-smart,\r\n    tightly coiled, with cool, dead-blue eyes. BURLY GUARDS\r\n    guide him across a CAUSEWAY toward a CONVOY of Escalades and\r\n    Ducatis on shore.\r\n\r\n    The middle Escalade's door opens.       The prisoner stops.   The\r\n    guards unlock his CUFFS.\r\n\r\n                           GUARD\r\n                 You're someone else's problem now.\r\n\r\n    The ex-prisoner STRETCHES his arms and strides TOWARD the\r\n    convoy.\r\n\r\n                             PRISONER\r\n                 Yes.   I.   Am.\r\n\r\n    CUE SALT & PEPA'S `SHOOP:'\r\n                                                                   5.\r\n                Deadpool   Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n5   EXT.   FREEWAY OVERPASS - DAY                                       5\r\n\r\n    DEADPOOL sits on the edge of the highest freeway on the\r\n    overpass, legs dangling over the side like Huck Finn.\r\n\r\n                         DEADPOOL\r\n               Can I get some fries with that shake-\r\n               shake boobie? If looks could kill you\r\n               would be an uzi.\r\n\r\n    Deadpool is using some broken CRAYONS to draw something on a\r\n    scrap of paper. REVERSE ANGLE to REVEAL a childish drawing\r\n    of Deadpool SHOOTING another man in the head, brains blowing\r\n    out.\r\n\r\n    The victim's thought bubble reads: `OUCHIE!!!'       Even through\r\n    the mask, Deadpool looks pleased by this.\r\n\r\n    He turns to CAMERA:\r\n\r\n                          DEADPOOL (CONT'D)\r\n               Oh, hello, Deadpool here. You may be\r\n               wondering whose balls I had to fondle to\r\n               get my own movie. Rhymes with\r\n               `Polverine.' Couple'a smooth criminals.\r\n                   (ALT:)\r\n               In a word, gorgeous.\r\n                   (ALT:)\r\n               Surprisingly little hair down there.\r\n                   (ALT:)\r\n               It's a jungle down there.\r\n                   (ALT:)\r\n               Thick underbrush.\r\n                   (beat)\r\n               Anyway, I smell Oscar. The suit's gonna\r\n               match the carpet. Now... places to be...\r\n               faces to fix... bad guys to kill...\r\n\r\n    ANGLE ON a distant BIRD'S EYE VIEW of the freeway\r\n    interchange: an interwoven tangle of ramps.\r\n\r\n6   EXT. REMOTE AIRFIELD - MORNING                                      6\r\n\r\n    AJAX, 30's, dead-blue eyes, broad shoulders, whip-smart,\r\n    tightly coiled stands at ease on a cracked and blistered\r\n    tarmac. Behind him, a HEAVILY ARMED CONVOY OF DUCATIS and\r\n    ESCALADES. FOUR LARGE ALUMINUM CARGO CRATES sit beside him.\r\n\r\n    Ajax squints into the sun as A BELL HELICOPTER thrashes the\r\n    air above him, kicking up dust as it lands.\r\n\r\n\r\n\r\n\r\n                                                              (CONTINUED)\r\n                                                                     6.\r\n                  Deadpool   Final Shooting Script   11/16/15\r\n6   CONTINUED:                                                            6\r\n\r\n    A SERBIAN WARLORD, mid-50's, sharply dressed, armored\r\n    BRIEFCASE in hand, climbs out. He is surrounded by ARMED\r\n    GUARDS.\r\n\r\n    The Warlord places the BRIEFCASE on the FOREMOST CRATE. Ajax\r\n    pops the case... to find STACKS upon STACKS of THOUSAND\r\n    DOLLAR BILLS. Satisfied, he closes the briefcase and hands\r\n    it to one of his men.\r\n\r\n                           AJAX\r\n                     (bangs crate)\r\n                 They won't disappoint.\r\n\r\n                           WARLORD\r\n                 They'd better not.    And next month's\r\n                 shipment?\r\n\r\n                           AJAX\r\n                 There won't be one. Demand is high. You\r\n                 aren't the only one with a war to win.\r\n\r\n                           WARLORD\r\n                     (steps forward)\r\n                 That won't do.\r\n\r\n    Both sets of armed thugs shift to ready positions.\r\n\r\n    Ajax smiles calmly, but his free hand DARTS OUT and CASUALLY\r\n    LIFTS the warlord into the air by the THROAT. Fingers find\r\n    triggers on both sides.\r\n\r\n                           AJAX\r\n                 There's been a small... disruption in our\r\n                 supply chain. We'll deliver in full the\r\n                 following month. Say, ten percent off\r\n                 for the inconvenience?\r\n\r\n    The Warlord manages to nod in acquiescence.       Ajax smiles\r\n    again, lowers him gasping to the ground.\r\n\r\n                           AJAX (CONT'D)\r\n                 We appreciate your business.\r\n\r\n    Ajax spins and walks purposefully toward the line of waiting\r\n    SUV's.\r\n\r\n    The warlord angrily motions for his men to begin loading the\r\n    crates into the helicopter, which they do.\r\n\r\n                           WARLORD\r\n                     (sotto voce)\r\n                 Fucking mutant.\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                     7.\r\n                Deadpool   Final Shooting Script     11/16/15\r\n6   CONTINUED: (2)                                                        6\r\n\r\n    Behind him the convoy of SUV's and motorcycles pull out,\r\n    falling into line as they accelerate past the rows of\r\n    derelict aircraft.\r\n\r\n7   EXT.   FREEWAY OVERPASS - DAY                                         7\r\n\r\n    DEADPOOL watches as the convoy approaches. He CASUALLY gets\r\n    up as if standing up out of an easy chair...\r\n\r\n                         DEADPOOL\r\n               On your mark, get set, go, let me go, let\r\n               me shoop...\r\n\r\n    He PIROUETTES, and DROPS an entire level DOWN...\r\n\r\n8   INT. ESCALADE - MORNING                                               8\r\n\r\n    THROUGH the SUNROOF of an ESCALADE.     SMASH!\r\n\r\n    There are FOUR HUGE BAD-ASSES inside the S.U.V., two in\r\n    front, two behind. Deadpool lands back-middle in a HAILSTORM\r\n    of GLASS. He stuns the men to both sides with elbows to the\r\n    face as he raises his arms in greeting.\r\n\r\n                          DEADPOOL\r\n               ¡Hola! ¡Me llamo Piscina De La Muerte!\r\n                   (subtitled, in YELLOW:)\r\n               Hello! My name is the Pool of Death.\r\n               There's no easy way to say this. I'm\r\n               pregnant, Trevor.\r\n                   (ALT:)\r\n               Any of you seen Green Lantern? Me\r\n               neither.\r\n\r\n    BOOM! MAYHEM ERUPTS as the two men in back find themselves\r\n    sharing a phone booth with the TASMANIAN DEVIL: ELBOWS.\r\n    FOREARMS. KNEES. CRACKING. CRUNCHING. SCREAMING.\r\n\r\n    From BEHIND, the Escalade BUCKS and BOUNCES down the road on\r\n    its suspension, almost CARTOON-LIKE.\r\n\r\n    A brutal punch spins Deadpool UPSIDE-DOWN, and he rolls with\r\n    it, uses his FEET to BREAK the man's NECK. The other man\r\n    stomps on his head, then drags him up and SMUSHES Deadpool's\r\n    face into the seat's premium trim.\r\n\r\n                         DEADPOOL (CONT'D)\r\n               Rich... Corinthian... Leather.\r\n\r\n    Deadpool HURLS the man through THROUGH the TAILGATE WINDOW.\r\n\r\n    The man clutches the TAILGATE, DRAGGED behind the S.U.V.\r\n    Deadpool sticks his head between the two guys in FRONT.\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                      8.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n8   CONTINUED:                                                             8\r\n\r\n                           DEADPOOL (CONT'D)\r\n                 Scuse, por favor!\r\n\r\n    The DRIVER SLAMS Deadpool's head into the console repeatedly.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                 Ow.   Ow.   Ow. Ow. Ow.\r\n\r\n    Deadpool squirms away and WRESTLES VIOLENTLY with the guy in\r\n    the PASSENGER SEAT.\r\n\r\n    He GRABS the PASSENGER SEAT-BELT, TIES it around the guy's\r\n    ANKLE, and KICKS him out the PASSENGER SIDE DOOR. The guy's\r\n    HEAD and SHOULDERS SMACK pavement, where he's DRAGGED\r\n    mercilessly by his ANKLE - a modern COWBOY whose boot just\r\n    got stuck in his horse's STIRRUP.\r\n\r\n    Deadpool grabs the driver by the HAIR on the BACK of his HEAD\r\n    and BANGS his FOREHEAD into:\r\n\r\n    The horn. HONK. HONK. The stereo. Every time the driver's\r\n    forehead SMACKS the face of the stereo, the RADIO STATION\r\n    CHANGES:\r\n\r\n    MARIACHI. DR. DREW. MONSTER TRUCK COMMERCIAL ('SUNDAY,\r\n    SUNDAY, SUNDAY!'). One more SMACK to get us back to\r\n    MARIACHI.\r\n\r\n    Deadpool looks in the REAR VIEW MIRROR to see the man in back\r\n    CRAWL up the tailgate.\r\n\r\n    Deadpool PUSHES in the Cadillac's CIGARETTE LIGHTER.\r\n\r\n    Back to the DRIVER. Deadpool BASHES his face into the\r\n    DRIVER's SIDE WINDOW. THUMP. THUMP. THUMP.\r\n\r\n    We're now OUTSIDE the Escalade, seeing the driver's\r\n    expression take on a ridiculous silly-putty-esque grimace of\r\n    pain every time it's MUSHED into the glass.\r\n\r\n    The man in back scrambles forward. The CIGARETTE LIGHTER\r\n    POPS OUT. Deadpool YANKS the EMERGENCY BRAKE. The man in\r\n    back LAUNCHES forward and SMACKS the DASHBOARD.\r\n\r\n    Deadpool STABS the now ORANGE-HOT lighter into the man's\r\n    forehead, burning the COIL PATTERN into his skin. The man\r\n    SCREAMS.\r\n\r\n                           DEADPOOL (CONT'D)\r\n                 Loved your work in Daredevil.\r\n\r\n    Deadpool stuffs the lighter INTO the man's mouth and CLAMPS\r\n    his hand over it.\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       9.\r\n                    Deadpool   Final Shooting Script   11/16/15\r\n8     CONTINUED: (2)                                                         8\r\n\r\n      The man hollers in muffled agony. A MOTORCYCLE has pulled\r\n      AHEAD of the ESCALADE and now sits, STOPPED, in its path.\r\n\r\n      The helmeted RIDER OPENS FIRE with a SUB-MACHINE GUN.\r\n\r\n      Deadpool has one hand grasped on the back of the driver's\r\n      neck, still mashing his face into the window glass, and the\r\n      OTHER hand still clamped over the second man's mouth. He\r\n      plants both FEET on the steering wheel and `drives,' spinning\r\n      the wheel, sending the S.U.V. into...\r\n\r\n      ...a ROLL.    The Escalade goes ENDO, SOMERSAULTING WILDLY.\r\n\r\n      Suddenly, the ACTION BEGINS TO SLOW...\r\n\r\n      The motorcycle RIDER tries to bail out. NO LUCK. The\r\n      tumbling Escalade PLOWS RIGHT INTO him AND his bike.\r\n\r\n      Parts scatter off the motorcycle, including its CHAIN. The\r\n      RIDER continues to SQUEEZE off ROUNDS as he goes FLYING.\r\n\r\n      Inside the Escalade, Deadpool goes SPIN-CYCLE. The DRIVER\r\n      flies through the sunroof, tearing out its remaining glass.\r\n      BLOOD spatters. The other man spits out the glowing\r\n      CIGARETTE LIGHTER. The guy whose ankle is still tangled in\r\n      the seat-belt FLAILS through the air like a rag-doll, AHAB\r\n      tied to MOBY DICK.\r\n\r\n      The action CONTINUES to SLOW... until it FREEZES.\r\n\r\n      The camera swoops in to Deadpool's face, upside down.\r\n\r\n      HE TURNS HIS HEAD TO CAMERA FOR THE FIRST TIME, BREAKING THE\r\n      FOURTH WALL, THE ONLY THING IN THE SCENE THAT'S MOVING:\r\n\r\n                              DEADPOOL (CONT'D)\r\n                   Shit.   Did I leave the stove on?\r\n\r\n      We RAMP back UP to FULL SPEED. The S.U.V. CARTWHEELS. The\r\n      guy's ankle untangles from the seat-belt. He FLIES high\r\n      toward a big HIGHWAY EXIT SIGN and... SPLAT... out of frame.\r\n\r\n      The RIDER's NECK is SLICED by the flying MOTORCYCLE CHAIN.\r\n\r\n      The DRIVER is half-way out the SUNROOF when the S.U.V. rolls\r\n      over him. SQUISH.\r\n\r\n      The man who ate the CIGARETTE LIGHTER now eats pavement.\r\n\r\nVX8   EXT.   X-MANSION - DAY                                                VX8\r\n\r\n      A sign reads `PROFESSOR XAVIER'S SCHOOL FOR GIFTED\r\n      YOUNGSTERS.\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                       10.\r\n                    Deadpool   Final Shooting Script   11/16/15\r\nVX8   CONTINUED:                                                          VX8\r\n\r\n                             REPORTER (O.S.)\r\n                   Breaking news. A multicar collision\r\n                   turns shots fired on the crosstown\r\n                   expressway...\r\n\r\n      The sign sits on the perfectly manicured front lawn of the\r\n      gorgeous Gothic X-MANSION.\r\n\r\nVX8   INT.   KITCHEN - CONTINUOUS                                         VX8\r\n\r\n      The X-Men's COLOSSUS. A GOOD-NATURED GIANT with CHROME METAL\r\n      FOR SKIN. BIG AS A BARN. OTHER-WORLDLY STRONG. He is\r\n      sitting in the kitchen, eating a bowl of GRAPE NUTS and\r\n      finishing a SUDOKU, his attention suddenly drawn to a\r\n      TELEVISION SCREEN:\r\n\r\n                             REPORTER\r\n                   The assailant appears to be wearing a...\r\n\r\n                   COLOSSUS                      REPORTER (CONT'D)\r\n      Red suit?                            Red suit.\r\n\r\n      With an audible CRACK, the pencil in Colossus' thick fingers\r\n      snaps. He rises, muttering Russian curses and stalks from\r\n      the kitchen.\r\n\r\nVC8   INT.   HANGAR - MOMENTS LATER                                       VC8\r\n\r\n      Massive STEEL BLAST DOORS emblazoned with a huge \"X\" slide\r\n      open to reveal COLOSSUS. He walks quickly and purposefully\r\n      towards a big plane in the center of the huge space: the\r\n      BLACKBIRD, the X-Men's modified XR-71 jet transport.\r\n\r\n      Struggling to keep up with the giant's long strides is a\r\n      supernaturally CUTE, supernaturally DEADPAN 15-YEAR-OLD GIRL,\r\n      in an X-MEN outfit. NEGASONIC TEENAGE WARHEAD.\r\n\r\n                             COLOSSUS\r\n                   I've given Deadpool every chance to join\r\n                   us. And what is my reward? More\r\n                   immaturity and criminality! When will he\r\n                   finally grow up and see benefits of\r\n                   becoming X-Man?\r\n\r\n                             NTW\r\n                   Like... The house that blows up every few\r\n                   years? The fashion-forward jump-suits?\r\n                   I need to get myself kicked out of X-\r\n                   School.\r\n\r\n                             COLOSSUS\r\n                   But I thought you were at top of class.\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                        11.\r\n                    Deadpool    Final Shooting Script   11/16/15\r\nVC8   CONTINUED:                                                           VC8\r\n\r\n                             NTW\r\n                   Was that sarcasm?    Awesome.\r\n\r\n                             COLOSSUS\r\n                   You ate breakfast, yes? Breakfast is\r\n                   most important meal of day.\r\n                       (hands NTW a protein bar)\r\n                   Here. Protein bar, good for bones.\r\n                   Deadpool may try to break yours.\r\n\r\n      NTW shoves the bar in a pocket of her coat without breaking\r\n      stride.\r\n\r\n9     EXT. FREEWAY OVERPASS - MORNING                                        9\r\n\r\n      The S.U.V. slides to a halt ON ITS SIDE, PASSENGER WINDOWS\r\n      UP. The rest of the CONVOY is forced to stop BEHIND.\r\n\r\n      A BUNCH of MEN PILE OUT, each one carrying a BEASTLY GUN and\r\n      POINTING it STRAIGHT at the disabled S.U.V.\r\n\r\n      The last noise is made by one final dislodged HUBCAP, which\r\n      rattles in little circles until it lies FLAT on the freeway.\r\n\r\n      TWO SILENT BEATS. Then we hear the soft, ELECTRIC BUZZ of\r\n      the Escalade's middle passenger window ROLLING DOWN. Up pops\r\n      the HEAD of DEADPOOL, like the GOPHER in Caddyshack.\r\n\r\n      BANG BANG BANG BANG.\r\n\r\n                             DEADPOOL\r\n                   Wait, wait...\r\n\r\n      The head drops, the hands come up.        BANG.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                   Wait! You're probably wondering. Why the\r\n                   red suit? It's so bad guys can't see me\r\n                   bleed. This guy has the idea. He wore\r\n                   the brown pants.\r\n                       (to camera)\r\n                   All together now...\r\n\r\n      The THUGS immediately OPEN FIRE.\r\n\r\n      Deadpool is already leaping upward, flipping backwards,\r\n      bullets tearing the air beneath him as he pulls out those TWO\r\n      MASSIVE .50 CAL PISTOLS... and in slo-mo, RETURNS FIRE.\r\n\r\n      Deadpool keeps count of every bullet he fires:\r\n\r\n                               DEADPOOL (CONT'D)\r\n                   Twelve..!\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                      12.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n9   CONTINUED:                                                              9\r\n\r\n    A SHELL-CASING is EJECTED. We enter EXTREME SLO-MO and SWOOP\r\n    IN on the shell as it TUMBLES through the air...\r\n\r\n    ...revealing the number `00012' ETCHED in a semi-circle on\r\n    its butt end. Deadpool FIRES the second pistol. We move\r\n    instantly to the second shell: `00011'\r\n\r\n                             DEADPOOL (CONT'D)\r\n                 Eleven...\r\n\r\n    FULL SPEED.    The first TWO THUGS get a MOUTHFUL of BULLET.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                 Ten...\r\n\r\n    ANOTHER SHOT. A THUG takes one in the HEART.          The other\r\n    thugs POUR LEAD into the disabled S.U.V.\r\n\r\n    Deadpool LEAPS UP and OUT of the window, rising ABOVE the\r\n    incoming shots, then LANDING SAFELY BEHIND the Escalade.\r\n\r\n    Deadpool TURNS to SPY a MOTORCYCLE RIDER BEARING DOWN ON HIM.\r\n    This rider wears a distinctive SILVER HELMET.\r\n\r\n    Deadpool raises BOTH pistols. This RIDER LEANS away, dodging\r\n    each slug. First left, then right, then left.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                 Nine.    Shit! Eight. Fuck! Seven.       Shit-\r\n                 fuck!\r\n\r\n    The bike WHIZZES PAST safely, firing bullets, DEADPOOL\r\n    follows, leaping high, flipping over the S.U.V.\r\n\r\n    He lands smoothly the other side, right BEHIND a thug who's\r\n    looking in the other direction as he sneaks around the car.\r\n\r\n    Deadpool SHRUGS and SHOOTS him in the BACK of the HEAD at\r\n    POINT BLANK RANGE.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                 Six.\r\n\r\n    The shell tumbles to the ground, falls still.         `00006'\r\n\r\n    Deadpool opens the Escalade.       His target is NOT THERE.\r\n\r\n    BANG-BANG-BANG-BANG-BANG. Deadpool is nearly BROUGHT DOWN by\r\n    a particularly big thug with a particularly big AK-47.\r\n\r\n    He dives behind another Escalade, takes a moment to search\r\n    the interior through the windows... and then flinches as AK-\r\n    47 bullets pass THROUGH the skin of the S.U.V. around him.\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                    13.\r\n               Deadpool   Final Shooting Script     11/16/15\r\n9   CONTINUED: (2)                                                        9\r\n\r\n    One of the bullets lands in DEADPOOL'S BICEP. Deadpool\r\n    yelps, in pain... then stuffs some of his torn red suit\r\n    fabric into the hole to staunch the bleeding.\r\n\r\n    Then he scrambles AROUND the S.U.V., trying to close the\r\n    distance to this guy through a WITHERING BARRAGE of fire.\r\n\r\n    Another of the AK's slugs SLICES a swath out of the mask on\r\n    Deadpool's head, SINGING his hair.\r\n\r\n                         DEADPOOL.\r\n              Fuck.   You.\r\n\r\n    Deadpool lands in FRONT of the thug. The thug pulls his\r\n    trigger again, only to - CLICK - realize he's OUT of BULLETS.\r\n\r\n                        DEADPOOL\r\n              Someone's not counting.    Cinco.\r\n\r\n    The bullet HITS the thug in the throat.       `00005'\r\n\r\n                        DEADPOOL (CONT'D)\r\n              Me gusta cinco.\r\n\r\n    Deadpool STRIDES past the fallen thug, pawing at his singed\r\n    hair - ow - and then out of sheer, pumped-up ANGER...\r\n\r\n    ...turns and PUMPS TWO MORE SUPERFLUOUS BULLETS into him.\r\n\r\n                         DEADPOOL (CONT'D)\r\n              Four.   Three. Stupid. Worth it.\r\n\r\n    The SILVER-HELMETED MOTORCYCLE RIDER makes another pass,\r\n    FIRING. Deadpool ducks behind the S.U.V. again.\r\n\r\n    20 yards away, a GROUP of thugs TAKE COVER behind the final\r\n    S.U.V. One pulls out a HAND-GRENADE, RAISES HIS ARM to\r\n    throw.\r\n\r\n                        DEADPOOL (CONT'D)\r\n                  (chuckles)\r\n              Number two...\r\n\r\n    Deadpool FIRES, SHOOTING the GRENADE in the thug's FIST.\r\n    BOOM! The whole CLUSTER of THUGS drops.\r\n\r\n    Deadpool emerges from behind the S.U.V., feeling victorious.\r\n\r\n    He approaches the final S.U.V. and throws open the doors to\r\n    search, expecting to find his target at last.\r\n\r\n    Inside is a rumpled orange prison coverall, but NOT the\r\n    PRISONER. Deadpool gets childishly angry.\r\n\r\n\r\n                                                               (CONTINUED)\r\n                                                                    14.\r\n               Deadpool     Final Shooting Script   11/16/15\r\n9   CONTINUED: (3)                                                        9\r\n\r\n                        DEADPOOL (CONT'D)\r\n              What the shit-biscuit! Where you at,\r\n              Francis?\r\n\r\n    Worse, CLICK-CLACK.    The distinctive COCKING of SHOTGUNS.\r\n\r\n    3 final THUGS stand on the freeway, lined up perpendicular to\r\n    Deadpool, SHOULDER-TO-SHOULDER, FIRING BENELLI COMBAT\r\n    SHOTGUNS.    BAM! BAM! BAM!\r\n\r\n    Deadpool ducks behind the S.U.V. and raises a PISTOL. We\r\n    ZOOM IN through the CHAMBER to spy the last BULLET, POISED in\r\n    front of the FIRING PIN:\r\n\r\n    `00001'\r\n\r\n    Deadpool thinks, then LEAPS from behind the `SCLADE, TWISTS\r\n    forward and right.\r\n\r\n    All 3 THUGS FIRE again.    BUCKSHOT rips into DEADPOOL's BACK.\r\n\r\n    But he LANDS so that all 3 men are now parallel to him...\r\n\r\n    ...in A SINGLE-FILE LINE.\r\n\r\n                           DEADPOOL (CONT'D)\r\n              One.\r\n\r\n    BOOM! We're with the FINAL BULLET as it HURTLES from the gun\r\n    and passes THROUGH the first man's head... then the SECOND\r\n    man's head... and SMACKS the third man in the forehead.\r\n\r\n    This third man, the BIGGEST THUG YET, HITS the DECK.\r\n\r\n    Deadpool puts his mouth to his pistol barrel, INHALES... and\r\n    then EXHALES smoke through the pores of his mask.\r\n\r\n                        DEADPOOL (CONT'D)\r\n              I'm touching myself tonight.\r\n\r\n    But then, as if by magic, the third thug STIRS... and STANDS.\r\n\r\n    The SLUG has LODGED partway in his FOREHEAD, having lost just\r\n    enough momentum that it didn't make it all the way through.\r\n\r\n    The thug sneers, plucks out the slug, wipes away some blood,\r\n    and rolls up his SLEEVES.\r\n\r\n                           DEADPOOL (CONT'D)\r\n              Really?     Rolling up the sleeves?\r\n\r\n    Deadpool reaches back.    We hear the THRILLING SOUND...\r\n\r\n\r\n\r\n                                                               (CONTINUED)\r\n                                                                       15.\r\n                 Deadpool    Final Shooting Script     11/16/15\r\n9    CONTINUED: (4)                                                          9\r\n\r\n     ...of STEEL BLADES being DRAWN. Out come Deadpool's\r\n     TRADEMARK KATANAS. The thug's eyes widen as...\r\n\r\n     ...SWOOSH... the blades swing through the air and SKEWER him,\r\n     between two different ribs and out the BACK.\r\n\r\n                          DEADPOOL (V.O.)\r\n                I know what you're thinking...\r\n\r\n     The action SLOWS again to a FREEZE.      Deadpool is in mid-\r\n     slice, muscles bulging.\r\n\r\n                          DEADPOOL (V.O.)\r\n                I'll bet he works out. So what if I am\r\n                pulling the double shift at the ab-\r\n                factory? What if I do want my man menu\r\n                to feature the shredded beef? Call it\r\n                insecurity. But I haven't touched a carb\r\n                since...\r\n\r\n10   INT.   FOYER, TOWNHOUSE - NIGHT - PAST                                  10\r\n\r\n     Title:   6 Years Ago\r\n\r\n     A sleazy, mid-thirties MAN, GAVIN MERCHANT, decked out in\r\n     DRAGON PRINT V-NECK and STUDDED JEANS, is MID-ARGUMENT with a\r\n     late teen, pimply-faced PIZZA DELIVERY GUY, whose name-tag\r\n     reads: JEREMY.\r\n\r\n                          MERCHANT\r\n                Will it help if I slow down?         I didn't.\r\n                Order. The pizza.\r\n\r\n                          JEREMY\r\n                This 7348 Red Ledge Drive?\r\n                    (off nod)\r\n                And you're... Mr. Merchant?\r\n\r\n                          MERCHANT\r\n                The Mr. Merchant who didn't.         Order.\r\n                The. Fucking. Pie.\r\n\r\n                          JEREMY\r\n                Then who placed the call?\r\n\r\n     A TOILET flushes in another room, and both men turn.\r\n\r\n                            WADE (O.S.)\r\n                I did.\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                       16.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n10   CONTINUED:                                                              10\r\n\r\n     The VOICE comes from over Merchant's shoulder. WADE WILSON\r\n     (the future DEADPOOL, MINUS the SCARS and SUIT), handsome,\r\n     boyish, cheerily steps from through a doorway and into the\r\n     living room wiping his hands on a towel.\r\n\r\n     Merchant STARES, incredulous.\r\n\r\n                            WADE (CONT'D)\r\n                  Pineapple and olive?\r\n\r\n     Jeremy NODS.\r\n\r\n                            WADE (CONT'D)\r\n                  Sweet and salty.\r\n\r\n                            MERCHANT\r\n                  The fuck are you? And what are you doing\r\n                  in my crib?!\r\n\r\n     Without even turning toward Merchant, Wade PULLS OUT A .50\r\n     CALIBER DESERT EAGLE PISTOL and nonchalantly AIMS it at him.\r\n     Merchant and Jeremy both go pale.\r\n\r\n                            WADE\r\n                      (to Jeremy)\r\n                  Burnt crust?\r\n\r\n                            JEREMY\r\n                  God I hope not.\r\n                      (opens the box, winces)\r\n                  Words cannot express-\r\n\r\n                            WADE\r\n                  Relax, son, that's hows I likes it!      Once\r\n                  you go black, you never go back!\r\n                      (takes pizza)\r\n\r\n                            MERCHANT\r\n                      (stammering)\r\n                  This is about the poker game, right? I\r\n                  told Howie... Listen, take whatever you\r\n                  want!\r\n\r\n     Merchant fumbles with his wallet and starts to hand Wade the\r\n     bills inside. Wade takes the ENTIRE WALLET instead.\r\n\r\n                              WADE\r\n                  Thanks!\r\n\r\n                            JEREMY\r\n                      (to Wade)\r\n                  Uh. Sir? Before you do anything to him.\r\n                  Could I have a big tip?\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                      17.\r\n                Deadpool    Final Shooting Script     11/16/15\r\n10   CONTINUED: (2)                                                         10\r\n\r\n                         WADE\r\n                   (already munching)\r\n               Jeremy, is it?\r\n\r\n                           JEREMY\r\n               Yeah.\r\n\r\n                         WADE\r\n               Wade Wilson.\r\n                   (quick fist bump)\r\n               Jeremy, that's a no go on the tiperoo.\r\n               I'm not here for him.\r\n                   (levels gun at Jeremy)\r\n               I'm here for you.\r\n\r\n     Jeremy's eyes widen. Wade holds up a YELLOW CARD, featuring\r\n     an embedded SIM. Below the logo of a CYPRESS TREE is the\r\n     name of Wade's intended target: `GARRETT, JEREMY.'\r\n\r\n     Merchant breathes a sigh of relief.\r\n\r\n                         MERCHANT\r\n               Dodged a big time bullet on that o-\r\n\r\n     Wade PISTOL-PUNCHES/POKES Merchant in the forehead.           Merchant\r\n     howls.\r\n\r\n                         WADE\r\n                   (re: studded jeans)\r\n               Not out of the woods yet. You need to\r\n               seriously ease up on the bedazzling.\r\n               They're jeans, not a chandelier.\r\n                   (sniffs)\r\n               And the Axe body spray.\r\n\r\n                         JEREMY\r\n                   (sheepish)\r\n               That's unfortunately me.\r\n\r\n                         WADE\r\n               PS, I'm keeping your wallet.         Ya did\r\n               kinda give it to me...\r\n\r\n                         MERCHANT\r\n               Can I at least have my Sam's Club card\r\n               baaa-\r\n\r\n     Wade points the pistol at Merchant again, sending him\r\n     backpedaling into a chair.\r\n\r\n                         WADE\r\n               I will shoot your fucking cat.\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     18.\r\n                Deadpool     Final Shooting Script   11/16/15\r\n10   CONTINUED: (3)                                                        10\r\n\r\n                         MERCHANT\r\n               I don't have a cat!\r\n\r\n                         WADE\r\n               Then whose kitty-litter did I just shit\r\n               in?\r\n                   (turns to Jeremy)\r\n               Anyhoo, you by chance know a Meghan\r\n               Orlovsky? Getting that right? Orlovsky?\r\n               Orloskvy? Do you?\r\n\r\n     Jeremy manages a timid little NOD.\r\n\r\n                          WADE (CONT'D)\r\n               Good.   `Cause she knows you.\r\n\r\n     Wade holsters the pistol and WHIPS out a HUNTING KNIFE. He\r\n     twirls it adeptly... but instead of holding it to Jeremy's\r\n     neck... CUTS himself a SLICE of PIZZA.\r\n\r\n                         WADE (CONT'D)\r\n               What situation isn't improved by pizza?\r\n\r\n     Wade shovels half the slice into his mouth, revealing an Army\r\n     SPECIAL FORCES TATTOO on his forearm: A SKULL WEARING A\r\n     GREEN BERET, BACKED BY A BLADE, AND THE WORDS `DE OPPRESSO\r\n     LIBER' (official motto of the U.S. Army Special Forces).\r\n\r\n                         WADE (CONT'D)\r\n                   (through chews)\r\n               Jeremy, I belong to a group of guys who\r\n               take a dime to beat a fella down.\r\n                   (cuts another pizza slice)\r\n               Little Meghan's not made of money, but\r\n               lucky her, I've got a soft spot.\r\n\r\n     Wade brings the next pizza slice over to Merchant. Wade\r\n     nearly hands it to him but lets go too soon. The slice falls\r\n     flat - pineapple down - onto the floor at Merchant's feet.\r\n\r\n                            JEREMY\r\n               B-but I'm-\r\n\r\n                         WADE\r\n                   (returns to Jeremy)\r\n               A stalker. Threats hurt, Jer. Though\r\n               not nearly as bad as serrated steel.\r\n\r\n     Wade pokes the end of his knife into Jeremy's chest, pinning\r\n     him against the wall.\r\n\r\n                         WADE (CONT'D)\r\n               So keep away from Meghan.       We cool?\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                       19.\r\n                 Deadpool    Final Shooting Script     11/16/15\r\n10   CONTINUED: (4)                                                          10\r\n\r\n                            JEREMY\r\n                Y-yeah.\r\n\r\n     A beat. In a huge ANTI-CLIMAX, Wade deftly twirls his knife\r\n     AWAY from Jeremy's chest, SPINS it on his finger, and JAMS it\r\n     back into its SLEEVE.\r\n\r\n                          WADE\r\n                Then we're done.\r\n\r\n                            JEREMY\r\n                W-we are?\r\n\r\n                          WADE\r\n                Soft spot, remember? But even look in\r\n                her general direction again? You'll\r\n                learn in the worst of ways.\r\n                    (pats Jeremy's cheek)\r\n                I've got some hard spots too.\r\n                    (pauses)\r\n                That came out wrong. Or did it?\r\n\r\n11   EXT.   SKATE PARK - NIGHT - PAST                                        11\r\n\r\n     SKATE PUNKS carve on ramps built into the sides of a highway\r\n     underpass. A group of TEEN GIRLS are perched at the bottom\r\n     of the nearby stairs, texting each other from inches away.\r\n     An old-fashioned GHETTO BLASTER bangs `SHOOP.'\r\n\r\n                          SALT & PEPA\r\n                I love you in your big jeans.\r\n\r\n                          GIRLS\r\n                    (join chorus)\r\n                You give me nice dreams.     You make me\r\n                wanna scream...\r\n\r\n     Boom. A PIZZA BOX lands at their feet.          On top of it lands a\r\n     POLAROID PICTURE.\r\n\r\n                          WADE (O.S.)\r\n                \"Oooo, oooo, oooo!\"\r\n\r\n     A FRIZZY-HAIRED EMO GIRL picks up the Polaroid... of a\r\n     terrified JEREMY holding another pizza box that has been cut\r\n     into a heart, the words `I'm Sorry' scrawled onto it, a PEE-\r\n     STAIN on his JEANS, and a laughing WADE photo-bombing with\r\n     the knife to his neck. She looks UP to see:\r\n\r\n     Wade bobbing to the music.\r\n\r\n                          WADE (CONT'D)\r\n                You've seen the last of Jeremy.\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                        20.\r\n                    Deadpool    Final Shooting Script   11/16/15\r\n11    CONTINUED:                                                              11\r\n\r\n      The girl - MEGHAN ORLOVSKY - leaps up and HUGS Wade tight.\r\n\r\n                             WADE (CONT'D)\r\n                   That's why we do it.\r\n\r\n                             GIRL #2\r\n                   Hey, think you could fuck up my step-dad?\r\n\r\n                             GIRL #3\r\n                   How `bout Vice Principal Renwiki?\r\n\r\n                             WADE\r\n                       (suddenly serious)\r\n                   What'd he do to you?\r\n\r\n                             GIRL #3\r\n                   Suspended me for smoking.\r\n\r\n                             WADE\r\n                       (turns to go)\r\n                   Good for him! Sorry, ladies. Me no dig\r\n                   cigs. And I may look mean. But if I\r\n                   give a guy a pavement facial? He earned\r\n                   it.\r\n\r\n      Wade gives Meghan a smile, turns to leave.\r\n\r\n                              MEGHAN\r\n                   Hey.   Thanks. You're my hero.\r\n\r\n      The word catches Wade like a punch to the gut.         Hero?\r\n\r\n                             WADE\r\n                   That I ain't.\r\n\r\n      Wade doesn't turn back, walking through the swooping skaters.\r\n\r\nA12   EXT.   SISTER MARGARET'S - NIGHT - PAST                                 A12\r\n\r\n      A grimy SIGN on a grimier brick building reads:         `SISTER\r\n      MARGARET'S SCHOOL FOR WAYWARD GIRLS.'\r\n\r\n12    INT.   SISTER MARGARET'S - NIGHT - PAST                                 12\r\n\r\n      Inside, society's DREGS. Chief among them, BOOTHE: a HUGE,\r\n      menacing hipster with a BOY SCOUT CAP and MASSIVE HANDLEBAR\r\n      MOUSTACHE. He's got some DUDE's fingers splayed out on the\r\n      bar, jabbing a KNIFE POINT between them as fast as he can.\r\n\r\n      WADE shimmies past, backslaps BOOTHE:\r\n\r\n                               WADE\r\n                   Boothe!\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                      21.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n12   CONTINUED:                                                             12\r\n\r\n                            BOOTHE\r\n                      (turns, smiles)\r\n                  Heya, Wade!\r\n\r\n     We hear a STAB and a SCREAM.\r\n\r\n     Wade winces as he continues on to the BAR, claims a STOOL and\r\n     waves over the lone bartender - WEASEL, early 20's, geeky,\r\n     glasses. Think Tom Cruise in `Cocktail.' Then think the\r\n     opposite.\r\n\r\n                            WEASEL\r\n                  Wade Wilson, Patron Saint of the Pitiful.\r\n                  What can I get you?\r\n\r\n                            WADE\r\n                  I'd love a blow-job.\r\n\r\n                            WEASEL\r\n                  We got that in common.\r\n\r\n                            WADE\r\n                  The drink, moose-knuckle.     But first...\r\n\r\n     Wade digs in a pocket, slaps the YELLOW `HIT' CARD, the one\r\n     with the CYPRESS TREE, on the bar.\r\n\r\n     Weasel goes to the register. Scans the card. Peels off\r\n     three ONE HUNDRED DOLLAR BILLS. Lays them out like a bank\r\n     teller. Wade PUSHES the MONEY AWAY...\r\n\r\n                            WADE (CONT'D)\r\n                  I ain't taking allowance money. Make\r\n                  sure it gets back to Ms. Osflorsky?\r\n                  Onroflensky? Olly-Olly-Oxen-Free?\r\n\r\n                            WEASEL\r\n                  Orlofsky. For a merc, you sure are warm-\r\n                  blooded. Bet you let the boy off easy-\r\n                  peasy, too.\r\n\r\n                            WADE\r\n                      (embarrassed)\r\n                  He's not a bad kid, Weas. Just a little\r\n                  light stalking. I was way worse at his\r\n                  age- traveling to far-off places -\r\n                  Baghdad, Mogadishu, Jacksonville -\r\n                      (shudders)\r\n                  - meeting new and exciting people -\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     22.\r\n                Deadpool    Final Shooting Script    11/16/15\r\n12   CONTINUED: (2)                                                        12\r\n\r\n                         WEASEL\r\n               And killing them. I've seen your\r\n               Instagram. What was Special Forces doing\r\n               in Jacksonville, anyway?\r\n\r\n                         WADE\r\n               Classified.\r\n                   (whispers)\r\n               They have a wonderful TGIFridays. Those\r\n               guys know their way around a Loaded\r\n               Potato Skin. The point is, I'm trying to\r\n               put those days in my rear-view.\r\n\r\n     Weasel puts the finishing touches on the drink, pushes it\r\n     across the bar to Wade.\r\n\r\n                         WEASEL\r\n               Kahlua, Bailey's, whip cream.        Fellatio\r\n               in a glass.\r\n\r\n     A burst of laughter turns Wade's attention to BUCK, a BAD-ASS\r\n     in a snakeskin jacket, has a crowd gathered round him, mid-\r\n     story. He too is holding a YELLOW CARD with SIM and CYPRESS\r\n     TREE.\r\n\r\n                         BUCK\r\n               So he's staring at my Glock in his mouth,\r\n               like...\r\n                   (mouth full)\r\n               `I thought you guys had a code!' And I'm\r\n               like, `Yeah, no kids. No women. Almost\r\n               fooled by your tits. But the moustache?!\r\n\r\n     The crowd CRACKS UP.\r\n\r\n     Wade pulls out Gavin Merchant's wallet and teases out a\r\n     TWENTY. He grabs a passing waitress, tucks the bill in her\r\n     shirt pocket and sets the blowjob on her tray.\r\n\r\n                         WADE\r\n               Kelly, you mind taking this over to Buck?\r\n               Tell him it's from Boothe.\r\n                   (whispers, to Weasel)\r\n               Little foreplay.\r\n\r\n     Weasel follows Wade's gaze to the end of the bar, where a\r\n     chuckling BOOTHE wraps a bandage around the guy's bloody\r\n     hand.\r\n\r\n                         WEASEL\r\n               Remind me what good comes of this?\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                      23.\r\n                Deadpool      Final Shooting Script   11/16/15\r\n12   CONTINUED: (3)                                                         12\r\n\r\n                         WADE\r\n               I don't take the shits.       I just disturb\r\n               them.\r\n\r\n     Weasel allows himself a tiny conspiratorial SMILE.\r\n\r\n                                                         SMASH CUT TO:\r\n\r\n13   INT. SISTER MARGARET'S - NIGHT                                         13\r\n\r\n     WADE, in medium shot, TEARING UP at the famous Steven Seagal\r\n     bar fight from `OUT FOR JUSTICE' on T.V. as... SMACK...\r\n     BAM... a REAL bar fight goes on - OUT OF FOCUS - behind him.\r\n\r\n                         WADE\r\n                   (trailer voice)\r\n               It's a dirty job... but someone's gotta\r\n               take out the garbage.\r\n\r\n     Wade finally turns around to watch. BUCK finishes off\r\n     Boothe... then pours the BLOW-JOB on top of him.\r\n\r\n     WEASEL grabs a hand mirror, hops over the bar, and crosses to\r\n     Boothe. All the PATRONS fall HUSH as WEASEL holds the mirror\r\n     to Boothe's mouth. Boothe's BREATH FOGS it up.\r\n\r\n                         WEASEL\r\n               Still kicking.\r\n\r\n     The place `oooooohs.' Near miss. Weasel returns to his\r\n     place behind the bar, looking disappointed.\r\n\r\n                         WADE\r\n               Lemme guess. Ya got Boothe in Sister\r\n               Margaret's dead pool.\r\n\r\n                             WEASEL\r\n               Um.    See.    About that-\r\n\r\n                         WADE\r\n               You did not bet on me to die.\r\n                   (looks up at board,\r\n                    incredulous)\r\n               You bet on me to die.\r\n\r\n     Wade leans back and looks up at an ENORMOUS CHALKBOARD\r\n     hanging above the bar: `Sister Margaret's DEAD POOL.'\r\n     Below, a long LIST of NAMES. DOLLAR AMOUNTS to the right of\r\n     the names. More NAMES to the right of the dollars.\r\n\r\n     Indeed, `WEASEL' has chosen `WADE.'       Wade looks betrayed.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       24.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n13   CONTINUED:                                                              13\r\n\r\n                            WADE (CONT'D)\r\n                  Weasel, you're the world's worst friend.\r\n                  Joke's on you. I'm living to 102. Like\r\n                  those old Quaker biddies on the Today\r\n                  Show. And retiring on my winnings.\r\n\r\n                            WEASEL\r\n                  Wait, who did you pick?\r\n\r\n     Weasel looks up a the board, where `WADE' has claimed:\r\n     `BIEBER, J.'\r\n\r\n                            WADE\r\n                  The Biebs. But I'm probably wrong.\r\n                  Nothing bad ever happens to teen stars\r\n                  who make 80 mil a year and think they're\r\n                  immune to the pitfalls of addiction and\r\n                  consequence. He'll be fine.\r\n                      (raises shot, yells)\r\n                  Drinks on me, soldiers of fortune!\r\n\r\n                              MERCENARIES\r\n                  Hooah!\r\n\r\n                            VANESSA\r\n                  Whoa, whoa...\r\n\r\n     Wade turns to see a woman on his other side: VANESSA.\r\n     Brunette. Silver-blue eyes. Tank. Tiny jean-shorts.\r\n\r\n                            VANESSA (CONT'D)\r\n                  Sure you wanna shoot your whole wad?\r\n\r\n     Wade looks Vanessa all the way up and down... then holds up\r\n     his PINKIE.\r\n\r\n                              WADE\r\n                  Tight.\r\n\r\n     Vanessa raises her own pinkie.         Shakes like a pinkie swear.\r\n\r\n                              VANESSA\r\n                  Vanessa.\r\n\r\n                            WADE\r\n                  What's a nice place like you doing in a\r\n                  girl like this?\r\n\r\n                            BUCK (O.S.)\r\n                  It ain't what she's doing, it's who.\r\n\r\n     BUCK walks past and SLAPS Vanessa on the caboose.\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                    25.\r\n                Deadpool    Final Shooting Script   11/16/15\r\n13   CONTINUED: (2)                                                       13\r\n\r\n                         BUCK (CONT'D)\r\n               I'd hit that shit.\r\n\r\n     Wade pushes back his stool, stands menacingly.\r\n\r\n                         WADE\r\n               Buck, you'd best apologize, before-\r\n\r\n     But Vanessa doesn't wait for Wade's chivalry. She blows\r\n     right by him and grabs a fistful of Buck's crotch. Buck\r\n     gasps.\r\n\r\n                         WADE (CONT'D)\r\n               Yeah, that.\r\n\r\n                         VANESSA\r\n                   (to Buck)\r\n               Say the magic words, Fat Gandalf.\r\n\r\n                         BUCK\r\n               I'm sorry! I have no filter between my\r\n               brain and mouth. I'm working on it.\r\n\r\n     Wade takes Vanessa's shoulders.\r\n\r\n                         WADE\r\n               OK, he apologized... hakuna his tatas...\r\n\r\n     Vanessa lets Buck go, turns on Wade.\r\n\r\n                         VANESSA\r\n                   (let's go)\r\n               And you-\r\n                   (shakes Wade off)\r\n               Hands off the merchandise.\r\n\r\n                         WADE\r\n               Merchandise? So, what, you, uh, bump\r\n               fuzzies for money?\r\n\r\n                           VANESSA\r\n               Yup.\r\n\r\n                         WADE\r\n               Rough childhood?\r\n\r\n                         VANESSA\r\n               Rougher than yours.     Daddy left before I\r\n               was born.\r\n\r\n                         WADE\r\n               Daddy left before I was conceived.\r\n\r\n\r\n\r\n                                                               (CONTINUED)\r\n                                                                     26.\r\n                Deadpool     Final Shooting Script   11/16/15\r\n13   CONTINUED: (3)                                                        13\r\n\r\n                         VANESSA\r\n               Ever had a cigarette put out on your\r\n               skin?\r\n\r\n                         WADE\r\n               I didn't know there was any other place\r\n               to put one out.\r\n\r\n                         VANESSA\r\n               I was molested.\r\n\r\n                            WADE\r\n               Me too.     Uncle.\r\n\r\n                            VANESSA\r\n               Uncles.     They took turns.\r\n\r\n                         WADE\r\n               I watched my own birthday party from the\r\n               keyhole of a locked closet, which was\r\n               also my-\r\n\r\n                           VANESSA\r\n               Bedroom?    Lucky. I slept in a dishwasher\r\n               box.\r\n\r\n                         WADE\r\n               So you had a dishwasher. I didn't know\r\n               sleep. It was pretty much 24-7 of ball\r\n               gags, brownie mix, and fun-house mirrors.\r\n\r\n                         VANESSA\r\n               Who would do such a thing?\r\n\r\n                          WADE\r\n               Hopefully you. Later tonight.\r\n                   (beat)\r\n               And my Uncle Kevin.\r\n\r\n     Wade EMPTIES the rest of Gavin's wallet:\r\n\r\n                         WADE (CONT'D)\r\n               What can I get for two-hundred-seventy\r\n               three bucks... and a Yogurtland rewards\r\n               card?\r\n\r\n     Vanessa shoves the bills into her halter:\r\n\r\n                         VANESSA\r\n               About forty-eight minutes of whatever you\r\n               want...\r\n                   (peers at card)\r\n               And a low-fat dessert.\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                       27.\r\n                 Deadpool     Final Shooting Script    11/16/15\r\n13   CONTINUED: (4)                                                          13\r\n\r\n     Wade grins at her like a kid on Christmas morning.\r\n\r\n14   INT.   ARCADE - NIGHT - PAST                                            14\r\n\r\n     A two-shot of WADE and VANESSA staring at each other, in\r\n     profile. Wade looks really excited.\r\n\r\n                          WADE\r\n                Time to put balls... in holes.\r\n\r\n     REVERSE ANGLE to reveal two SKEEBALL MACHINES in the ARCADE.\r\n     Wade inserts tokens, and balls CLUNK down.\r\n\r\n     Vanessa looks half amused, half weirded out.\r\n\r\n                          WADE (CONT'D)\r\n                You said whatever I want.\r\n\r\n                          VANESSA\r\n                I get it. You love skeeball.          Apparently\r\n                more than you love vagina.\r\n\r\n                          WADE\r\n                Tough call. Just trying to get to know\r\n                the real you... not the plunging-\r\n                necklined, short-shorted, two-dimensional\r\n                sex object peddled by Hollywood.\r\n\r\n     Wade slowly turns to CAMERA.      REVERSE ANGLE TO his P.O.V.:\r\n\r\n     A ten-year-old BOY stops in his tracks, his gaze moving from\r\n     Vanessa's plunging neckline to her short shorts.\r\n\r\n                             BOY\r\n                Nice tits!\r\n\r\n                          VANESSA\r\n                Thank you, son.\r\n                    (tousles boy's hair)\r\n                You know how to make a woman feel\r\n                special.\r\n\r\n     Vanessa reaches down, grabs two balls, hands one to Wade.\r\n\r\n                          VANESSA (CONT'D)\r\n                Balls in holes.\r\n\r\n                          WADE\r\n                Prepare to lose tragically.\r\n\r\n                          VANESSA\r\n                Bring it, big man.\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                       28.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n14   CONTINUED:                                                              14\r\n\r\n     Wade smiles slyly, sizes up the ramp, rears back and\r\n     OVERHANDS the first ball... right into the 50,000 CUP.\r\n\r\n                              VANESSA (CONT'D)\r\n                  Ruh-roh.\r\n\r\n15   INT.   ARCADE PRIZE COUNTER - LATER - PAST                              15\r\n\r\n     A beaming WADE bellies up to the prize counter and lays a\r\n     massive armful of pink TICKETS on top.\r\n\r\n                            WADE\r\n                  The limited edition Voltron: Defender of\r\n                  the Universe ring, por favor.\r\n\r\n                             TEEN\r\n                  You're roughly three hundred thousand\r\n                  tickets short.\r\n                      (beat)\r\n                  It's nickel-silver-plated.\r\n\r\n                            WADE\r\n                      (disappointed)\r\n                  Then I guess the tire-grade rubber\r\n                  Voltron keychain.\r\n\r\n     VANESSA places a measly TEN tickets of her own next to them.\r\n\r\n                            VANESSA\r\n                  And the... pencil eraser.\r\n\r\n     The weary TEEN behind the counter hands Wade the low-rent\r\n     VOLTRON KEYCHAIN, and Vanessa the eraser.\r\n\r\n                            TEEN\r\n                      (reads keychain package\r\n                       copy, bows)\r\n                  You are now the sworn protector of the\r\n                  gentle people of the planet Arus...\r\n                      (re: eraser, positive\r\n                       spin:)\r\n                  And you... you can... erase stuff...\r\n                  written in pencil.\r\n\r\n     Wade extends his arm chivalrously:\r\n\r\n                              WADE\r\n                  M'lady?\r\n\r\n                            VANESSA\r\n                  Unfortunately, my anus-loving friend,\r\n                  your forty-eight minutes are up.\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                       29.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n15   CONTINUED:                                                              15\r\n\r\n                            WADE\r\n                  Arus. And you're more evil than evil\r\n                  King Zarkon himself.\r\n\r\n     Wade rubs his keychain wistfully, then offers it up.\r\n\r\n                            WADE (CONT'D)\r\n                  How many more minutes for this?\r\n                      (hard sell)\r\n                  FYI. Five mini lion-bots come together\r\n                  to make up the super-bot.\r\n\r\n                            VANESSA\r\n                      (faux-excited)\r\n                  Five mini lion-bots?!\r\n                      (matter-of-fact)\r\n                  Three minutes.\r\n\r\n                            WADE\r\n                      (gives keychain up)\r\n                  That's all I'll need!\r\n\r\n     ALT:\r\n\r\n                            WADE\r\n                  What do we do with the remaining two\r\n                  minutes thirty seven seconds?\r\n\r\n                              VANESSA\r\n                  Cuddle?\r\n\r\n     Vanessa smiles and takes Wade's arm.        They walk out of the\r\n     ARCADE affectionately...\r\n\r\n     ...to the SOUNDS OF TIRELESS, ATHLETIC SEX.\r\n\r\n16   EXT./INT.    WADE'S APARTMENT - NIGHT - PAST                            16\r\n\r\n                            VANESSA (O.S.)\r\n                  How long can you keep this up?\r\n\r\n     DUCT TAPE fails to cover a big multi-fissured CRACK in the\r\n     WINDOW of Wade's CRAPPY APARTMENT. Inside, WADE has VANESSA\r\n     up against the wall decorated with CHRISTMAS LIGHTS that have\r\n     overstayed their welcome and a CALENDAR. They are going at\r\n     it like RABBITS.\r\n\r\n                            WADE\r\n                      (raises eyebrow)\r\n                  All year?\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                      30.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n16   CONTINUED:                                                             16\r\n\r\n     Dolly Parton's `HERE YOU COME AGAIN' kicks in, and we...\r\n\r\n                                                        DISSOLVE INTO:\r\n\r\n17   INT. WADE'S APARTMENT - DAY                                            17\r\n\r\n     A MONTAGE of images: Fun, irreverent SEX around the CALENDAR\r\n     between WADE and VANESSA, identified by various holidays.\r\n\r\n     VALENTINE'S DAY SEX. WADE falls back onto a bed covered in\r\n     rose petals with VANESSA on top of him. She has drawn a\r\n     heart on his chest in red lipstick. They go at it hard...\r\n     then pause for a romantic look and kiss.\r\n\r\n                            VANESSA\r\n                  Happy Valentine's Day...\r\n\r\n     Then IMMEDIATELY go back to hard pounding.\r\n\r\n                                                                  CUT TO:\r\n\r\n     A medium shot of the top half of VANESSA. She is on hands\r\n     and knees, rocking back and forth. WADE leans into frame\r\n     from behind.\r\n\r\n                            WADE\r\n                  Happy Chinese New Year's...\r\n\r\n                            VANESSA\r\n                      (smiles)\r\n                  Year of the Dog.\r\n\r\n     They go at it even harder.\r\n\r\n                                                         SMASH CUT TO:\r\n\r\n     The same exact locked-off medium shot, only WADE is now on\r\n     hands and knees. His expression betrays great stress.\r\n     VANESSA leans into frame from behind.\r\n\r\n                            VANESSA (CONT'D)\r\n                  Relax... Happy International Women's\r\n                  Day...\r\n\r\n     Wade girds himself, then lets out a surprised, WHIMPERY YELP\r\n     as some pioneering object journeys into his virgin lands.\r\n\r\n                                                                  CUT TO:\r\n\r\n     WADE in bed, legs wrapped around VANESSA's neck, being orally\r\n     pleasured.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                      31.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n17   CONTINUED:                                                             17\r\n\r\n                            WADE\r\n                  Happy Fourth of July!\r\n\r\n     We see FIREWORKS through the skylight above.\r\n\r\n                                                                  CUT TO:\r\n\r\n     WADE sitting in an arm-chair, fully dressed, reading glasses\r\n     on, purusing a book. VANESSA is reading in a chair opposite,\r\n     also wearing reading glasses.\r\n\r\n                             VANESSA\r\n                  Happy Yom Kippur...\r\n                      (ALT:)\r\n                  Happy Cesar Chavez Day...\r\n                      (ALT:)\r\n                  Happy Lent...\r\n                      (ALT:)\r\n                  Happy Lyme Disease Awareness Day...\r\n                      (ALT:)\r\n                  Happy Wednesday...\r\n\r\n                                                                  CUT TO:\r\n\r\n     VANESSA in bed where Wade last was. Now her legs are wrapped\r\n     around HIS neck, and he's pleasuring her.\r\n\r\n                            WADE\r\n                      (muffled)\r\n                  Happy Halloween...\r\n\r\n                            VANESSA\r\n                  Oo... ow...\r\n\r\n                            WADE\r\n                      (muffled)\r\n                  Sorry.\r\n                      (takes out Vampire teeth)\r\n                  Happy Halloween...\r\n\r\n     Wade goes back to work.\r\n\r\n                                                                  CUT TO:\r\n\r\n     WADE and VANESSA banging it out one last time, missionary\r\n     style.\r\n\r\n                             VANESSA\r\n                  Happy Thanksgiving.\r\n                      (ALT:)\r\n                  Happy Wednesday.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     32.\r\n                 Deadpool    Final Shooting Script   11/16/15\r\n17   CONTINUED: (2)                                                        17\r\n\r\n     Cut WIDE to reveal that they're on top of the KITCHEN TABLE\r\n     during THANKSGIVING DINNER. Wine spills, cranberry sauce\r\n     topples, mashed potatoes launch. ALT: BREAKFAST FOOD\r\n     INSTEAD.\r\n\r\n     Nothing takes away from the joy of the moment.\r\n\r\n18   INT.   WADE'S APARTMENT - NIGHT - PAST                                18\r\n\r\n     A CHRISTMAS WREATH hangs on Wade's wall.\r\n\r\n                          WADE (O.S.)\r\n                If your left leg is Thanksgiving, and\r\n                your right leg is Christmas...\r\n\r\n     WADE strikes a pose, HANDS on HIPS, wearing an AWFUL, AWFUL\r\n     CHRISTMAS SWEATER. And NO PANTS.\r\n\r\n     VANESSA sits against the bed's HEADBOARD, SHEET pulled over\r\n     her, up to her chin. She quickly lowers the sheet.\r\n     Revealing an APPALLING CHRISTMAS SWEATER of her own.\r\n\r\n                          WADE (CONT'D)\r\n                ...can I visit you between the holidays?\r\n\r\n                          VANESSA\r\n                Y'know, red's your color. Brings out the\r\n                bloodshot in your eyes. Christmas gift!\r\n                Catch!\r\n\r\n     Vanessa tosses something to Wade.      It lands in his hands.\r\n\r\n                          WADE\r\n                Holy fucking shit.\r\n\r\n     It's the nickel-silver-plated Voltron RING, all three hundred\r\n     thousand tickets worth.\r\n\r\n                          VANESSA\r\n                Limited edition. I had to give the kid\r\n                behind the counter a rub and tug. I'm\r\n                kidding. I'm not kidding. I'm kidding.\r\n                It was nearly five full months of\r\n                Skeeball.\r\n\r\n                          WADE\r\n                    (beams)\r\n                Y'know, I've been doing some thinking...\r\n\r\n                            VANESSA\r\n                Really.\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                        33.\r\n                   Deadpool     Final Shooting Script   11/16/15\r\n18   CONTINUED:                                                               18\r\n\r\n                            WADE\r\n                  ...about why we're so good together.\r\n\r\n                            VANESSA\r\n                  Why's that?\r\n\r\n                               WADE\r\n                  Your crazy    matches my crazy. We're like\r\n                  two jigsaw    pieces... weird curvy edges...\r\n                  but fit us    together, you can see the\r\n                  picture on    top.\r\n\r\n     Wade plants a kiss on Vanessa.         She sits up on her knees.\r\n\r\n                             VANESSA\r\n                  Hey, I've been meaning to ask you, only\r\n                  `cause you haven't gotten around to\r\n                  asking me-\r\n                      (pregnant pause)\r\n                  Wade, will you-\r\n\r\n            VANESSA (CONT'D)                              WADE\r\n     Stick it in my-?                       Marry me?\r\n\r\n                            VANESSA\r\n                  Uhh... jinx?\r\n\r\n     Wade reaches back and pulls out an ENGAGEMENT-RING-LIKE BOX.\r\n     Vanessa can barely contain her excitement.\r\n\r\n                            VANESSA (CONT'D)\r\n                  You're not wearing pants. Where exactly\r\n                  were you hiding that?\r\n\r\n     A vulnerable Wade hands her the box and stands there with the\r\n     look of... `Open it. Open it!'\r\n\r\n                            WADE\r\n                  They say one month's salary.\r\n\r\n     Vanessa opens the box... to reveal a CANDY RING.\r\n\r\n                            WADE (CONT'D)\r\n                  Slow month. I've been waiting for this\r\n                  day like Boss Hogg waits to get to the\r\n                  crazy cheesy crust...\r\n\r\n                               VANESSA\r\n                  You mean-?\r\n\r\n                               WADE\r\n                  I do.\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                    34.\r\n                Deadpool    Final Shooting Script   11/16/15\r\n18   CONTINUED: (2)                                                       18\r\n\r\n                         VANESSA\r\n               That's my line. I love you, Wade Wilson.\r\n\r\n                         WADE\r\n               Thought you charged extra for that.\r\n\r\n                           VANESSA\r\n               I did.    At my old job.\r\n\r\n                         WADE\r\n               So that's a-?\r\n\r\n     Vanessa stares. Swallows. Pulls him back into bed and\r\n     WHISPERS ONE SILENT WORD into his ear ('Yes'). Wade jumps up\r\n     and DANCES around the room all goofy, POP, LOCK, & ROBOT.\r\n\r\n                           VANESSA\r\n               Easy.    I can take it back.\r\n\r\n     Wade dives back into bed, SPOONS with Vanessa, wrapping her\r\n     in his ARMS, touching his cheek to hers.\r\n\r\n                         WADE\r\n               What if I never let go?\r\n\r\n                         VANESSA\r\n               Just rode a bitch's back, like Yoda on\r\n               Luke?\r\n\r\n                         WADE\r\n                   (contented sigh)\r\n               `Star Wars' jokes?!\r\n\r\n                         VANESSA\r\n                   (corrects)\r\n               `Empire.'\r\n\r\n                         WADE\r\n               It's like I made you in a computer.\r\n\r\n     Wade swoons, reaches, grabs a POLAROID CAMERA off his night-\r\n     stand, and holds it at arm's length.\r\n\r\n                         WADE (CONT'D)\r\n                   (Yoda voice)\r\n               Cheese, say!\r\n\r\n     The flash POPS.    For this one moment, his life is...\r\n\r\n                           WADE (CONT'D)\r\n               Perfect.\r\n\r\n     Wade hands Vanessa the photo.    Then...\r\n\r\n\r\n                                                               (CONTINUED)\r\n                                                                      35.\r\n                 Deadpool     Final Shooting Script   11/16/15\r\n18   CONTINUED: (3)                                                         18\r\n\r\n                             WADE (CONT'D)\r\n                Wee break.\r\n\r\n     ...bounces up to go to the BATHROOM. Vanessa gazes at the\r\n     photo, which is already FADING IN. Wade notices.\r\n\r\n                          WADE (CONT'D)\r\n                Shake it like a- Uh. You get it.\r\n\r\n                          DEADPOOL (V.O.)\r\n                Here's the thing. Life is an endless\r\n                series of train-wrecks with only brief,\r\n                commercial-like breaks of happiness.\r\n                This had been the ultimate commercial\r\n                break. Which meant it was time to\r\n                return...\r\n\r\n     Wade peels off his Christmas sweater... and STEPS CONFIDENTLY\r\n     BACK TOWARD THE BED. But before he gets there...\r\n\r\n                          DEADPOOL (V.O.)\r\n                ...to our regularly scheduled program.\r\n\r\n     ...HE PASSES OUT, FACE-PLANTING ONTO THE FLOOR.\r\n\r\n19   INT.   ONCOLOGY WARD - DAY - PAST                                      19\r\n\r\n     WADE is sitting in a doctor's office, VANESSA by his side,\r\n     opposite a solemn ONCOLOGIST. Every image suggests BAD NEWS:\r\n\r\n     A COMPLEX looking MRI IMAGE of the CIRCULATORY SYSTEM on a\r\n     BACKLIT VIEWING TABLE. SWEAT STAINS under Wade's arms.\r\n     Vanessa GRIPPING his hand. The LOOK on the DOCTOR's FACE.\r\n\r\n                          WADE\r\n                You're clowning.     You're not clowning?        I\r\n                sense clowns.\r\n\r\n                          DOCTOR\r\n                People react to news of late-stage cancer\r\n                differently.\r\n\r\n     Wade and Vanessa turn and share a devastated but loving look.\r\n\r\n                          VANESSA\r\n                    (to doctor, springs into\r\n                     action)\r\n                So what do we do? Surely there's\r\n                something... we can... do. I mean, my\r\n                uncle, he was diagnosed with thyroid\r\n                cancer, and there was this new\r\n                experimental drug that-\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                      36.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n19   CONTINUED:                                                             19\r\n\r\n     The VOLUME of Vanessa's voice FADES until we can SEE her\r\n     talking but no longer hear the words:\r\n\r\n                            DEADPOOL (V.O.)\r\n                  See, people do react differently.\r\n                  Vanessa's already working on Plan A. B.\r\n                  All the way to Z. Me? I'm memorizing\r\n                  the details of her face. Like it's the\r\n                  first time I'm seeing it. Or the last.\r\n\r\n                            DOCTOR (O.S.)\r\n                  Mr. Wilson?\r\n\r\n                            DEADPOOL (V.O.)\r\n                  Believe it or not, this is only the ninth\r\n                  shittiest thing that's ever happened to\r\n                  me.\r\n\r\n                            DOCTOR (O.S.)\r\n                  Mr. Wilson?\r\n\r\n                            DEADPOOL (V.O.)\r\n                  Stick around. Number 6 is coming right\r\n                  up.\r\n\r\n                            DOCTOR\r\n                  Take your time to process this.\r\n\r\n20   EXT.   FREEWAY - DAY                                                   20\r\n\r\n     DEADPOOL HAS AJAX PINNED TO THE FREEWAY RAIL.\r\n\r\n                            DEADPOOL\r\n                  You know how many people I've killed to\r\n                  find you?\r\n\r\n                            AJAX\r\n                  Actually, I do.\r\n\r\n                             DEADPOOL\r\n                  So you're aware I've been waiting a long,\r\n                  long time for this. And now I'm finally\r\n                  gonna...\r\n                      (ALT:)\r\n                  So you're aware of the category 5 fuck-\r\n                  storm that's coming.\r\n                      (ALT:)\r\n                  Then you know what's coming. I'm about\r\n                  to do to you what Sugar Ray did to the\r\n                  mid-nineties.\r\n\r\n     A massive SHADOW passes over AJAX and DEADPOOL, accompanied\r\n     by LOUD METALLIC FOOTSTEPS. Ajax looks up, a bit awed.\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       37.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n20   CONTINUED:                                                              20\r\n\r\n     Deadpool senses something, reaches back with one hand,\r\n     feels...\r\n\r\n     ...what turns out to be Colossus's METALLIC CROTCH.\r\n\r\n                              DEADPOOL (CONT'D)\r\n                  Dad?\r\n\r\n     COLOSSUS GRABS Deadpool's WRIST, CHUCKS him THROUGH the AIR,\r\n     ASS OVER TEAKETTLE.\r\n\r\n21   INT.   WADE'S APARTMENT - NIGHT - LATER - PAST                          21\r\n\r\n     A CLOSE-UP of a Deadpool ACTION FIGURE from `X-Men Origins.'\r\n     Mouth sewn shut. Blades implanted into wrists.\r\n\r\n     In the exact same POSE we just saw the real Deadpool.\r\n     Sitting in a nightstand DRAWER in Wade's apartment.\r\n\r\n                            WADE (O.S.)\r\n                  This is my most prized possession.\r\n\r\n     Wade looks like he's reaching into the drawer for the action\r\n     figure, but instead, reaches just UNDER it to grasp Wham!'s\r\n     `Make it Big' album on Vinyl. He pulls out the album.\r\n\r\n                              VANESSA\r\n                  Wham?\r\n\r\n                            WADE\r\n                  Wham!\r\n                      (cradles album lovingly)\r\n                  `Make it Big' was the album George and\r\n                  Andy earned their exclamation point.\r\n\r\n     Wade places the album carefully into one of two OPEN\r\n     SUITCASES on the floor next to him. He is currently going\r\n     through his possessions, TOSSING OUT the crap and placing the\r\n     good stuff into the suitcases.\r\n\r\n     Wade pulls out the action figure.\r\n\r\n                            WADE (CONT'D)\r\n                  But this. A little piece of me died the\r\n                  day this came out...\r\n\r\n     Wade DUNKS the action figure in the trash can.         VANESSA\r\n     stands opposite, arms crossed, FUMING.\r\n\r\n                            VANESSA\r\n                  So I'm s'posed to just... smile and wave\r\n                  you out the door?\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                      38.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n21   CONTINUED:                                                             21\r\n\r\n                            WADE\r\n                  Think of it as a spring cleaning. Only\r\n                  if spring was death.\r\n                      (pulls out BERNADETTE PETERS\r\n                       CHANGE PURSE)\r\n                  If I had a nickel for every time I\r\n                  spanked it to Bernadette Peters.\r\n                      (opens purse, it's full of\r\n                       nickels)\r\n                  Looks like I do.\r\n\r\n     Wade TOSSES the purse toward one of the suitcases.           Vanessa's\r\n     hand stabs out and GRABS it.\r\n\r\n                            VANESSA\r\n                  Bernadette's not going anywhere.\r\n                      (slam-dunks purse back into\r\n                       drawer)\r\n                  `Cause you're not going anywhere.\r\n\r\n                            WADE\r\n                  Right! The tumors are only in my liver,\r\n                  lungs, prostate, and brain. All the\r\n                  things you can live without.\r\n\r\n                            VANESSA\r\n                  You know what I mean. You belong here at\r\n                  home. Surrounded by your Voltron... and\r\n                  your Bernadette... and your me.\r\n\r\n                            WADE\r\n                  Babe, we've been through this! Cancer's\r\n                  a real shit-show. A Yakov-Smirnoff-\r\n                  opening-for-the-Spin-Doctors-at-the-Iowa-\r\n                  State-Fair shit-show. And under no\r\n                  circumstances will I take you to that\r\n                  show. I want you to remember me me.\r\n\r\n                            VANESSA\r\n                  Well, I want to remember us us.\r\n                      (that doesn't sound right)\r\n                  We we?\r\n\r\n                            WADE\r\n                  I swear, I'll find you in the next life.\r\n                  And boom-box `Careless Whisper' under\r\n                  your window. Wham!\r\n\r\n                            VANESSA\r\n                  Are you gonna keep saying it like that?\r\n                  Look, I get this impulse. I do.\r\n                            (MORE)\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     39.\r\n                 Deadpool    Final Shooting Script   11/16/15\r\n21   CONTINUED: (2)                                                        21\r\n                          VANESSA (CONT'D)\r\n                Before I met you, I used to fantasize\r\n                about dying alone in the woods, torn\r\n                apart by wolves.\r\n\r\n                          WADE\r\n                Super fucking bad-ass.\r\n\r\n                          VANESSA\r\n                But that was then, and this is now. Walk\r\n                out that door. I dare you. I will ride\r\n                you out. And I won't let go. Yoda on\r\n                Luke.\r\n\r\n     Vanessa embraces Wade. Tight.        Won't let go.   A TEAR\r\n     trickles down Vanessa's CHEEK.\r\n\r\n                          VANESSA (CONT'D)\r\n                    (into Wade's ear)\r\n                If you're willing to fight. There are\r\n                still options. We'll find them.\r\n                Together.\r\n\r\n                          WADE\r\n                    (smiles)\r\n                I just realized! I win! My life's\r\n                officially more fucked-up than yours.\r\n\r\n                          VANESSA\r\n                No one's boom-boxing shit.\r\n\r\n     Vanessa interlaces her pinkie with Wade's.      Smiles.\r\n\r\n                          VANESSA (CONT'D)\r\n                What do we we have to lose?\r\n\r\n                            WADE\r\n                Nothing.    Everything.\r\n\r\n     Vanessa leans in, and the two start to KISS.\r\n\r\n22   INT.   BEDROOM - NIGHT - PAST                                         22\r\n\r\n     VANESSA, horizontal, limbs akimbo, ASLEEP in bed.          She stirs,\r\n     feels next to her for Wade. He's NOT THERE.\r\n\r\n     REVEAL WADE standing at the bedroom window. His P.O.V. of\r\n     the moon makes it look FRACTURED by the cracked glass.\r\n\r\n     RACK FOCUS to Vanessa's REFLECTION. She, too, looks\r\n     fractured. Wade's eyes well with TEARS at the sight of her.\r\n     Cancer will steal the one thing that ever mattered.\r\n\r\n     Vanessa's cracked reflection suddenly RAISES its HEAD.\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                        40.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\n22     CONTINUED:                                                             22\r\n\r\n                              WADE\r\n                    Sorry. Liam Neeson nightmare. I\r\n                    kidnapped his daughter, and he just\r\n                    wasn't having it.\r\n\r\n       Wade slides back into bed.\r\n\r\n                              WADE (CONT'D)\r\n                    They've made three of those movies. At\r\n                    some point you wonder if he's just a bad\r\n                    parent.\r\n\r\n       Wade lies on his back. Vanessa nestles her head lovingly\r\n       against his chest. He takes a vulnerable look at her, then\r\n       stares at the ceiling, LOST.\r\n\r\nRS22   INT.   APARTMENT - NIGHT                                           RS22\r\n\r\n       Wade slips quietly out of bed...\r\n\r\n       ...slips on a hoodie and a backpack...\r\n\r\n       ...opens the door... takes one last longing look at\r\n       Vanessa...\r\n\r\n       ...and slips into the hallway, closing the door behind him.\r\n\r\n       Vanessa is left to feel for Wade in the dark.\r\n\r\nA22    EXT.   STREET - NIGHT                                                  A22\r\n\r\n       WADE walks down the street into the night.\r\n\r\n       He pulls a crumpled card from his jacket pocket:        the black\r\n       card with the recruiter's number.\r\n\r\n       Still walking, Wade pulls out a cellphone and dials.\r\n\r\n23     INT.   SISTER MARGARET'S - NIGHT - PAST                                23\r\n\r\n       Just another night at SISTER MARGARET'S WAYWARD SCHOOL FOR\r\n       GIRLS. Regular crowd has shuffled in. Tonight, a bit thin.\r\n\r\n       WADE is bellied up to the bar, disheveled, unkempt, and\r\n       distraught. WEASEL leans in:\r\n\r\n                              WEASEL\r\n                    Jesus. Someone needs a blow-job and a\r\n                    shower. Though courtesy calls for the\r\n                    latter first.\r\n\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                     41.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n23   CONTINUED:                                                            23\r\n\r\n                            WADE\r\n                  Three shots of Patron Silver, Weez.     And\r\n                  a cure to terminal cancer.\r\n\r\n                            WEASEL\r\n                      (hands over a green\r\n                       concoction)\r\n                  Fresh out of Patron. Wheatgrass?\r\n\r\n                            WADE\r\n                  You're starting to sound like Vanessa...\r\n\r\n     With SHAKY HANDS, Wade empties his POCKETS, placing CRUMPLED\r\n     BROCHURES on the bar.\r\n\r\n                            WADE (CONT'D)\r\n                  She sent away for all these colorful\r\n                  clinic brochures. I hear Chechnya's nice\r\n                  this time of... never. Then there's\r\n                  China... Central Mexico... Know how they\r\n                  say `Cancer' in Spanish? ¡El Cáncer.'\r\n\r\n     Wade pulls out one last thing from his pockets: A POLAROID\r\n     of HIMSELF and VANESSA. He stares. Weasel notices.\r\n\r\n                            WEASEL\r\n                  This belongs on the wall. I want to\r\n                  remember you when you looked... alive.\r\n\r\n     Wade scrapes up a smile as Weasel tapes the picture to the\r\n     BIG BAR MIRROR. Weasel pours a second wheatgrass shot.\r\n     Clinks Wade's glass. They throw them back. WINCE.\r\n\r\n                            WEASEL (CONT'D)\r\n                  Almost forgot...\r\n\r\n     Weasel slides Wade a distinctive black BUSINESS CARD across\r\n     the bartop.\r\n\r\n                            WEASEL (CONT'D)\r\n                  Guy came in asking for you.     Real Grim\r\n                  Reaper type.\r\n\r\n     Wade's gaze follows Weasel's gesture across the barroom,\r\n     where an ominous MAN in a BLACK SUIT sits ALONE at a table.\r\n\r\n                            WEASEL (CONT'D)\r\n                  I don't know? May further the plot?\r\n\r\n                                                                 CUT TO:\r\n                                                                      42.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n23A   INT.   SISTER'S MARGARET'S - NIGHT - PAST                             23A\r\n\r\n      WADE dead-man-walks to the back of the bar. He passes BOOTHE\r\n      and BEEF on his way. They nod solemnly, like cops at a\r\n      funeral procession honoring one of their own.\r\n\r\n                             BEEF\r\n                 Wade.\r\n\r\n      Beef offers Wade his shot. Wade eeks out a smile. Throws it\r\n      back. Then continues on. Wade stops next to the MAN's\r\n      TABLE.\r\n\r\n                           WADE\r\n                 Forget your scythe?\r\n\r\n      The man, even creepier from close up, SMILES.\r\n\r\n                           RECRUITER\r\n                 Mr. Wilson. Have a seat.\r\n                     (Wade sits, long pause)\r\n                 I understand you've recently been\r\n                 diagnosed with terminal cancer.\r\n\r\n                           WADE\r\n                 Stalker alert.\r\n\r\n                           RECRUITER\r\n                 It's my job. Recruitment. And you have\r\n                 quite a reputation. I'm sorry you've had\r\n                 a tough go. But you're a fighter. And\r\n                 not just for Johnny Canuck, impressive as\r\n                 your stint in special forces was. Forty-\r\n                 one confirmed kills?\r\n\r\n                           WADE\r\n                     (bitter)\r\n                 One every seven weeks.     Same rate most\r\n                 folks get a hair-cut.\r\n\r\n      Wade grabs the recruiter's drink and throws it back.\r\n\r\n                           WADE (CONT'D)\r\n                 To wash the taste out. It's hard to\r\n                 forget being so... impressive.\r\n\r\n                           RECRUITER\r\n                 Now you spend your days sticking up for\r\n                 the little man, slitting small time\r\n                 throats for small time folks.\r\n\r\n                           WADE\r\n                 People change.\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       43.\r\n                    Deadpool   Final Shooting Script   11/16/15\r\n23A   CONTINUED:                                                          23A\r\n\r\n      The recruiter leans uncomfortably close.\r\n\r\n                             RECRUITER\r\n                       (low, conspiratorial)\r\n                   Speaking of which... Mr. Wilson, I\r\n                   represent an organization that may be\r\n                   able to help. What if I told you we can\r\n                   cure your cancer? And what's more, give\r\n                   you abilities most men only dream of?\r\n\r\n                             WADE\r\n                   I'd say you sound like an infomercial.\r\n                   And not a good infomercial, like Slap\r\n                   Chop. More Shake-Weighty.\r\n                       (jack-off motion)\r\n\r\n                             RECRUITER\r\n                   The world needs extraordinary men. We\r\n                   won't just make you better. We'll make\r\n                   you better than better. A super-hero.\r\n\r\n                             WADE\r\n                   I already tried the hero business. Let's\r\n                   just say it left a mark. The only chance\r\n                   you'll see me again is if I hit `fuck-\r\n                   it.'\r\n\r\n24    EXT./INT.    GUADALAJARAN CLINIC WAITING ROOM - DAY - PAST           24\r\n\r\n      A DILAPIDATED, SKETCHY MEDICAL `CLINIC' haunts the cityscape\r\n      in GUADALAJARA, MEXICO.\r\n\r\n                             WADE (V.O.)\r\n                   For now, I'll get through this with the\r\n                   one I love.\r\n\r\n      A sickly-looking WADE is on the final stop in his futile\r\n      quest to find a cure. DESPERATE. Among the MOST DESPERATE.\r\n\r\n      He sits in a pathetic muzak-filled WAITING ROOM. Wearing a\r\n      SOMBRERO and clutching VANESSA's hand. Her fingers are\r\n      interlaced in his, once perfectly manicured nails chewed to\r\n      the quick.\r\n\r\n      Vanessa is also wearing a SOMBRERO, and ANXIETY on her face.\r\n\r\n      Wade COUGHS SEVERELY, REPEATEDLY into a HANDKERCHIEF.\r\n\r\n      Wade turns to the sweet ELDERLY COUPLE sitting next to him,\r\n      ekes out a smile. The old man plays with some WORRY BEADS.\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                        44.\r\n                   Deadpool     Final Shooting Script   11/16/15\r\n24   CONTINUED:                                                               24\r\n\r\n                            WADE\r\n                      (pulls out Spanish-English\r\n                       electronic translator)\r\n                  De donde eres?\r\n\r\n                            ELDERLY WOMAN\r\n                  Boca Raton.\r\n\r\n                             WADE\r\n                  Ah.   The fancy part of Mexico.\r\n\r\n                            ELDERLY MAN\r\n                  We've moved in with my son.       To afford\r\n                  the treatment.\r\n\r\n     Wade looks pained to hear this.\r\n\r\n                               WADE\r\n                  Cancer?     Sorry - ¿El Cáncer?\r\n\r\n                            ELDERLY MAN\r\n                  Stage four.\r\n\r\n                            WADE\r\n                  Toughest part of the Tour de France.\r\n\r\n                            VANESSA\r\n                  Very hilly.\r\n\r\n     The elderly man gestures to the souvenir PATCHES sewn onto\r\n     Wade's `HELLO KITTY' DUFFEL: CHECHNYA. CHINA. INDONESIA.\r\n\r\n                            ELDERLY MAN\r\n                  Logging some frequent flier miles?\r\n\r\n                            WADE\r\n                      (bone-weary)\r\n                  Final stop on Desperation World Tour,\r\n                  2016, which I believe was also the name\r\n                  of the Stones' last concert...\r\n\r\n                            VANESSA\r\n                  `Final' because this is where we find the\r\n                  cure.\r\n\r\n     A MOTHER and her stoic young SON sign in with the NURSE\r\n     behind the front desk. The boy has lost all his HAIR.\r\n\r\n                             NURSE\r\n                  No cheques de viajero.      No pesos.   Cash.\r\n                  Americano.\r\n\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                              45.\r\n                Deadpool   Final Shooting Script   11/16/15\r\n24   CONTINUED: (2)                                                 24\r\n\r\n     Wade grows upset as the mother counts out hard-earned CASH.\r\n     The boy reaches for a BOX filled with CHUPACHUPS (lollipops).\r\n     The nurse scolds:\r\n\r\n                         NURSE (CONT'D)\r\n               Chupachups cuestan extra!\r\n\r\n                         WADE (O.S.)\r\n                   (angry)\r\n               Hey!\r\n\r\n     The nurse looks coldly at Wade. He stares back, eyes hard,\r\n     then gets up and lays a crumpled dollar on the counter.\r\n\r\n                         WADE (CONT'D)\r\n                   (ice cold)\r\n               It's on me.\r\n\r\n     The nurse blinks, then stands, checking a CHART.\r\n\r\n                         NURSE\r\n               Señor... Abe Solomon?\r\n\r\n     ABE and his WIFE get up. The nurse motions for Mrs. Solomon\r\n     to stay in the waiting room.\r\n\r\n                         ABE\r\n                   (to Wade and Vanessa)\r\n               Handsome couple. Good luck to you two.\r\n\r\n     Abe drops his WORRY BEADS. Wade bends to retrieve them, then\r\n     stands with effort and gently hands them to Abe.\r\n\r\n                         WADE\r\n               Good luck to you, Pops.\r\n\r\n     Wade sits back down, and his eyes find the LITTLE BOY: his\r\n     SUNKEN EYES. His MISSING HAIR. His LOLLIPOP, CLUTCHED like\r\n     the richest treasure.\r\n\r\n     Wade turns to look at Vanessa, who's also staring at the boy.\r\n\r\n     Even though Vanessa is healthy, she, too, looks sick. No\r\n     makeup. Dirty hair. Dark circles under her eyes. When she\r\n     looks at Wade, it's clear she, not he, most needs comfort.\r\n\r\n     Wade pulls Vanessa close and strokes her hair with a\r\n     trembling hand. Abe disappears. Wade watches with a newly\r\n     dark look of suspicion.\r\n                                                                      46.\r\n                 Deadpool     Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n25   INT.   OPERATING ROOM - DAY - PAST                                     25\r\n\r\n     ABE lies shirtless on an UNSANITARY operating table, a tray\r\n     of RUSTY surgical KNIVES nearby.\r\n\r\n     A MAN with a pock-marked face stands over him in a white lab\r\n     coat with blue-stitched cursive writing: `Dr. Delgado.'\r\n\r\n                          DOCTOR\r\n                Buenos días, Señor Abe.\r\n\r\n     `Doctor' Delgado pokes and prods with his fingers, as if\r\n     Abe's mid-section is Play-Doh.\r\n\r\n                          DOCTOR (CONT'D)\r\n                Voy a llegar dentro de tu cuerpo.\r\n\r\n                             ABE\r\n                I'm sorry.     No hablo español, doc.\r\n\r\n     The doctor's other hand dips below the table, comes up\r\n     dripping with something bloody. He kneeds at wrinkled skin\r\n     smearing the CHICKEN BLOOD across Abe's flesh.\r\n\r\n                          DOCTOR\r\n                De que se cure! Señor Abe, you are\r\n                cured.\r\n\r\n     The doctor holds SMELLING SALTS under Abe's nose. His closed\r\n     eyes jerk open to see the doctor's gloved hand CLUTCHING a\r\n     huge, bloody `TUMOR.'\r\n\r\n     Abe pushes himself up, peers down at his bloody abdomen with\r\n     awe. The doctor wipes the blood away and helps him up.\r\n\r\n                          ABE\r\n                    (tearing up)\r\n                Thank you. I owe you my life.\r\n\r\n     As Abe shuffles out, the doctor turns away to dump the\r\n     `tumor' in the trash and wash his bloody hands in a basin.\r\n\r\n                          DOCTOR\r\n                    (over his shoulder)\r\n                ¡Proximo! Next!\r\n\r\n                          WADE (O.S.)\r\n                Already here, hombre.\r\n\r\n     Dr. Delgado nearly JUMPS at the sight of WADE, already\r\n     standing in the OPEN DOOR of the room, looking DANGEROUS.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                      47.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n25   CONTINUED:                                                             25\r\n\r\n                            DOCTOR\r\n                  So sorry, you surprise me. How...\r\n                  long... you standing there, Señor?\r\n\r\n     Wade walks slowly TOWARD the doctor, who steps out nervously\r\n     from BEHIND his table. The two stand face-to-face. Wade\r\n     smiles... angles his foot UNDER the OPERATING TABLE...\r\n\r\n     ...and uses it to SLIDE something out from underneath the\r\n     table: a BUCKET of BLOODY CHICKEN GIZZARDS that double as\r\n     removed `tumors.' Wade's RAGE seems to grow by the INSTANT.\r\n\r\n                            WADE\r\n                  Long enough...\r\n\r\n     Delgado senses he is suddenly in danger, picks up a rusty\r\n     SCALPEL from his tray. Wade moves toward him. Delgado\r\n     LUNGES, He STABS WADE in the shoulder, then RUNS.\r\n\r\n     Wade TACKLES him. In Wade's weakened state, the fight\r\n     becomes an intense STRUGGLE. The two FALL and WRESTLE. The\r\n     BUCKET of GIZZARDS overturns. They roll around in slop.\r\n\r\n     The doctor squirms out of Wade's grasp and crawls into the\r\n     hallway. Wade wriggles after him, tugging at his ankle.\r\n\r\n26   INT.   WAITING ROOM / HALLWAY - SUNSET - PAST                          26\r\n\r\n     The MUZAC still plays. VANESSA smiles warmly/sadly at the\r\n     little BOY, who is unwrapping his CHUPACHUP.\r\n\r\n     Suddenly... a SCREAM and cries for help in Spanish. The\r\n     NURSE and an ALARMED VANESSA rush toward the shouting.\r\n\r\n27   INT.   HALLWAY - SUNSET - PAST                                         27\r\n\r\n     At last, WADE's fury has overcome his physical weakness. He\r\n     straddles the DOCTOR's CHEST. His expression is that of a\r\n     man who's LOSING his SHIT.\r\n\r\n     Wade RAISES THE SCALPEL, SLASHES at the doctor's throat, then\r\n     STABS him in the heart. The doctor writhes, spasms, gurgles,\r\n     and falls still.\r\n\r\n     Chest heaving, Wade raises his head to see... at the FAR END\r\n     of the HALL:\r\n\r\n     VANESSA - frozen, TERRIFIED. A blood-soaked Wade locks eyes\r\n     with her and swims back up into SANITY... `What have I done?'\r\n     This is a horrific glimpse into Wade's murderous past...\r\n\r\n     ...and the look on Vanessa's face is one of HORROR and PAIN.\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                      48.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n27   CONTINUED:                                                             27\r\n\r\n     Awash in shame, Wade staggers to his feet, slips on chicken\r\n     blood, and LUNGES in the other direction. He hits the door\r\n     at the end of the hall at a RUN.\r\n\r\n28   STAB!                                                                  28\r\n\r\n     The sword, covered in BLOOD, penetrates the crayon drawing of\r\n     the recruiter on DEADPOOL's CORKBOARD.\r\n\r\n                            DEADPOOL\r\n                  Thank you, Agent Smith.\r\n\r\n     Deadpool lasers in on AJAX's picture at the top of the\r\n     pyramid.\r\n\r\n29   EXT.    GUADALAJARA STREET - SUNSET - PAST                             29\r\n\r\n     WADE leans against a wall, gasping for breath. He looks back\r\n     toward her voice, face a mask of pain. Instead of seeking\r\n     her... he melts into the busy street.\r\n\r\n30   EXT.    DEADPOOL'S LAIR - DAY                                          30\r\n\r\n     DEADPOOL trudges to his FRONT DOOR.       He speaks to the\r\n     AUDIENCE:\r\n\r\n                            DEADPOOL\r\n                  Some kind of anger can't be managed.\r\n                  Like the kind where your year-long plan\r\n                  ends with the wrong guy getting\r\n                  dismembered! That said... when it comes\r\n                  time to licking wounds... there's no\r\n                  place like home, and I share that home\r\n                  with someone you met, the old blind lady\r\n                  from the laundromat, Al. She's like\r\n                  Robin to my Batman. Except she's old.\r\n                  And black. And blind.\r\n\r\n     POPS INSIDE\r\n\r\n                            DEADPOOL (V.O.)\r\n                  And I think she loves me. Wait... pretty\r\n                  sure Robin loves Batman, too.\r\n\r\n31   INT.    WORKSHOP - NIGHT - PAST                                        31\r\n\r\n     WADE, ghastly, nearing death, lies BACK onto a STRETCHER,\r\n     covered only by a FLIMSY HOSPITAL GOWN. He's being wheeled\r\n     down a dim corridor by two tough-looking ORDERLIES.\r\n\r\n     In one hand, he holds the recruiter's crumpled BUSINESS CARD.\r\n     In the other, he clutches the limited edition VOLTRON RING,\r\n     as tight as his shaky hand allows.\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                        49.\r\n                   Deadpool     Final Shooting Script   11/16/15\r\n31   CONTINUED:                                                               31\r\n\r\n     They turn a corner and push through a pair of double doors\r\n     into a cavernous room. Wade looks around, full of hope for a\r\n     new life. Immediately, every single thing he sees/hears\r\n     begins to erode his confidence. The RECRUITER stands just\r\n     inside the doors, smiling.\r\n\r\n                            RECRUITER (O.S.)\r\n                  Mr. Wilson! Nothing warms my heart like\r\n                  a change of someone else's.\r\n\r\n     Walking into Wade's P.O.V. is the creepy RECRUITER.             He beams\r\n     down on Wade.\r\n\r\n                            RECRUITER (CONT'D)\r\n                  You finally hit `fuck-it.'\r\n\r\n                            WADE\r\n                  Worse.  Just promise you'll do right by\r\n                  me. So I can do right by someone else.\r\n\r\n                               RECRUITER\r\n                  Of course.\r\n\r\n                            WADE\r\n                  Oh, and please don't make my super suit\r\n                  green. Or animated.\r\n\r\n                            RECRUITER\r\n                  I hope you enjoy your stay.\r\n\r\n     The `Workshop,' as this old warehouse is affectionately\r\n     called, has been converted into a working LABORATORY.\r\n\r\n     Wade is wheeled through a vast room containing rows of\r\n     individual `tents,' each containing a SUBJECT. Wade's eyes\r\n     DART to helpless SILHOUETTES.\r\n\r\n     We hear WHISPERS, WHIMPERS, MOANS.\r\n\r\n     A FELLOW PATIENT, a pathetic, terrified little man named\r\n     CUNNINGHAM, is wheeled past Wade, restrained on another\r\n     STRETCHER. Cunningham briefly locks eyes with Wade, but\r\n     quickly moves on by.\r\n\r\n     Wade can't help but be alarmed by the TERROR in Cunningham's\r\n     eyes.\r\n\r\n     The tents are illuminated by BLINDING overhead lights.             Wade\r\n     spies GRUESOMELY INTIMIDATING MEDICAL EQUIPMENT.\r\n\r\n     Wade is wheeled into the tent that's his new home. The\r\n     FIGURE who was pushing Wade DUMPS him onto a CHROME OPERATING\r\n     TABLE and roughly STRAPS him down.\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                   50.\r\n                Deadpool   Final Shooting Script   11/16/15\r\n31   CONTINUED: (2)                                                      31\r\n\r\n                         WADE\r\n               Um.  My first request?    A warmer table.\r\n                   (shivers)\r\n               And warmer hands.\r\n\r\n     Wade DOUBLE-TAKES at the sight of the figure above him:\r\n     ANGEL DUST - thirties, female, tall, sexy, athletic - an\r\n     Amazonian warrior in another age.\r\n\r\n     Angel Dust wheels over a high-tech I.V. DRIP, complete with\r\n     glass cylindrical tanks housing a glowing, viscous LIQUID.\r\n\r\n     Then she roughly straps Wade's NECK to the table. Wade\r\n     nearly GASPS, the color now officially drained from his face.\r\n\r\n                          WADE (CONT'D)\r\n               Easy!   Aren't you a little strong for a\r\n               lady?   I'm calling wang.\r\n\r\n                         ANGEL DUST\r\n               You'd like that, huh.    Welcome to our\r\n               little hospital.\r\n\r\n                         WADE\r\n               It doesn't look like a hospital. It\r\n               looks like Chlamydia holding still.\r\n\r\n     An UNLIT MATCHSTICK protrudes from Angel Dust's teeth - her\r\n     idea of a TOOTHPICK.\r\n\r\n                         WADE (CONT'D)\r\n               Oral fixation?\r\n\r\n                          ANGEL DUST\r\n               Shut.   The fuck. Up.\r\n\r\n     Angel Dust places a FINGER on Wade's FOREHEAD and SHOVES his\r\n     head back against the table - BANG - pinning it there.\r\n\r\n                         AJAX (O.S.)\r\n               Patience, Angel. All in good time.\r\n\r\n     Enter AJAX, whom we know as the PRISONER from the RAFT with\r\n     whom we've seen Deadpool tangle in the PRESENT. This is the\r\n     first Ajax and Wade have met.\r\n\r\n                         WADE\r\n               Can I expect turndown serv-?\r\n\r\n     Ajax nods to Angel Dust. BOOM! She GAGS Wade with SURGICAL\r\n     TUBING, then wraps it around the TABLE, immobilizing his\r\n     head.\r\n\r\n\r\n\r\n                                                              (CONTINUED)\r\n                                                                   51.\r\n                Deadpool   Final Shooting Script   11/16/15\r\n31   CONTINUED: (3)                                                      31\r\n\r\n                         AJAX\r\n               You're a talker.\r\n\r\n     Wade's eyes are wider than ever.    WTF?\r\n\r\n                         AJAX (CONT'D)\r\n                   (disarmingly matter-of-fact)\r\n               Mr. Wilson, my name is Ajax. I manage\r\n               the Workshop. My `welcome' speech used\r\n               to be full of euphemisms like `You may\r\n               feel some discomfort.' But I've grown\r\n               blunt.\r\n\r\n     Ajax unsheathes an I.V. NEEDLE. Angel Dust up-tilts the\r\n     table 45 degrees, then readies a holographic monitor.\r\n\r\n                         AJAX (CONT'D)\r\n               The Workshop is not a government program.\r\n               It's a private institution tasked with\r\n               turning reclamation projects like\r\n               yourself into men of extraordinary\r\n               abilities. I'm about to remake your\r\n               life. But if you think cancer cures\r\n               painlessly, you're wrong. If you think\r\n               super-human powers are acquired\r\n               painlessly, you're wrong.\r\n\r\n     Ajax touches Wade with the I.V. NEEDLE, pressing here and\r\n     there, not QUITE hard enough to break skin. At last, he\r\n     locates the subclavian vein. Wade flinches.\r\n\r\n                         AJAX (CONT'D)\r\n               We're injecting you with a serum that\r\n               activates mutant genes. For it to work,\r\n               we need to subject you to extreme stress.\r\n\r\n     The liquid glows FLUORESCENT through Wade's white skin as it\r\n     pumps into the pulmonary highway.\r\n\r\n                          AJAX (CONT'D)\r\n               You've heard the whole make-an-omelette,\r\n               break-some-eggs bit?\r\n                   (Wade blinks)\r\n               I'm about to hurt you, Wade. The kind of\r\n               hurt I can't describe and you can't\r\n               prepare for. It's cruel stuff. And\r\n               there's no way out for you. No secret\r\n               you can tell me. No soft spot in me to\r\n               appeal to.\r\n\r\n     Wade stares at them in shock.\r\n\r\n\r\n\r\n\r\n                                                              (CONTINUED)\r\n                                                                52.\r\n                Deadpool     Final Shooting Script   11/16/15\r\n31   CONTINUED: (4)                                                   31\r\n\r\n                         ANGEL DUST\r\n               What, you expected Weapon X?\r\n\r\n     Ajax starts to TURN AWAY, but stops.\r\n\r\n                          AJAX\r\n               One more thing. What's the ad? `I'm not\r\n               just the president. I'm a client?' I've\r\n               been through this procedure myself. It\r\n               made me stronger. It also scorched my\r\n               nerve endings. So I no longer feel pain.\r\n               In fact...\r\n                   (smiles)\r\n               I no longer feel anything.\r\n\r\n     Wade reacts by SAYING something - made UNINTELLIGIBLE by the\r\n     surgical tubing. Ajax nods to Angel Dust, who slices the\r\n     SURGICAL TUBING, SNAPPING it away and FREEING Wade to TALK.\r\n\r\n                         WADE\r\n               Something in your teeth.\r\n\r\n     Ajax smiles WITHOUT opening his mouth, signals Angel Dust.\r\n     She slams Wade's head back again as he turns to leave.\r\n\r\n     Before he exits, Ajax hesitates, can't help but check his\r\n     teeth in one of the surgical mirrors.\r\n\r\n                         WADE (O.S.) (CONT'D)\r\n               Made you look! Hey, is Ajax your real\r\n               name? `Cause it sounds suspiciously made\r\n               up. What's it really? Steve? Mark?\r\n               Trevor? Kyle?\r\n                   (E.T. voice)\r\n               Elliot?\r\n\r\n     We hear LAUGHS from nearby tents.      Wade is now playing for an\r\n     audience.\r\n\r\n                         AJAX\r\n               Joke away. The one thing that never\r\n               survives this place is a sense of humor.\r\n\r\n                            WADE\r\n               We'll see!\r\n\r\n                          AJAX\r\n                   (to Angel Dust)\r\n               All yours.\r\n\r\n     We re-take WADE'S P.O.V. as Angel Dust, chewing her\r\n     matchstick, re-enters frame above him, smiles, then punches\r\n     him in the face. Black.\r\n                                                                        53.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n32     INT.   WORKSHOP - NIGHT/DAY - MONTAGE - PAST                           32\r\n\r\n       A MONTAGE of Wade's treatments in the Workshop, set to the\r\n       notes of JOHN DENVER's inspirational classic, `I WANT TO\r\n       LIVE.' Juxtaposed with HARROWING VIGNETTES of Angel Dust and\r\n       AJAX experimenting on WADE...\r\n\r\n       ...as he GASPS, CLAWS, SCREAMS BLOODY MURDER.\r\n\r\n       Wade is DUNKED into thick, molasses-like LIQUID. PULLED and\r\n       YANKED, POKED and PRODDED by contraptions that would have\r\n       shamed the Spanish Inquisition.\r\n\r\n       SAWED.   COMPRESSED.     SLICED.   DICED.   SLAP-CHOPPED.     BLED.\r\n\r\n       LONG SYRINGES PLUNGE DEEP INTO SOFT TISSUE.\r\n\r\n       SCALPELS MAKE LONG INCISIONS.\r\n\r\n       ENDOSCOPIC CAMERAS TRAVEL THROUGH THE BODY, REVEALING THE\r\n       DIRTY WORK OF INVASIVE SURGICAL EQUIPMENT.\r\n\r\n       STAPLE-GUNS DRIVE STAPLES INTO SLICED SKIN TO PULL IT BACK\r\n       TOGETHER.\r\n\r\n       MINIATURE CIRCULAR SAWS SLICE THROUGH BONE.\r\n\r\n       IV's PULL FLUIDS FROM THE BODY AND INSERT OTHER FLUIDS IN.\r\n\r\n                              JOHN DENVER\r\n                    I want to share what I can give.     I want\r\n                    to be... I want to live!\r\n\r\n       We also see SHORT, ULTRA-FAST MINI-MONTAGES of medical\r\n       instruments, implying the PASSAGE of TIME.\r\n\r\n32AA   INT.   WORKSHOP - MONTAGE - NIGHT                                     32AA\r\n\r\n       Over images of:\r\n\r\n       INJECTION:\r\n\r\n                              AJAX (V.O.)\r\n                    The serum I'm injecting you with targets\r\n                    any mutant genes lurking in your DNA.\r\n\r\n       TORTURE:\r\n\r\n                              AJAX (V.O.)\r\n                    Adrenaline acts as a catalyst for the\r\n                    serum, so we must subject you to extreme\r\n                    stress.\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                         54.\r\n                     Deadpool    Final Shooting Script   11/16/15\r\n32AA   CONTINUED:                                                          32AA\r\n\r\n                              AJAX (V.O.)\r\n                    If you're lucky, the mutant genes will\r\n                    activate and manifest in spectacular\r\n                    fashion.\r\n\r\n                              AJAX (V.O.)\r\n                    If not, we'll have no choice but to keep\r\n                    hurting you in new and different ways.\r\n                    Each more painful than the last.\r\n\r\n32AA   INT.   WORKSHOP - DAY                                               32AA\r\n\r\n                              AJAX\r\n                    Until you finally mutate.      Or die.\r\n\r\n33     INT.   WORKSHOP - WADE'S TENT / WORM'S TENT - NIGHT                   33\r\n\r\n       At last, Wade is laid back down on his table, only now in\r\n       QUIET DARKNESS, MEEK, WITHOUT ANY RESISTANCE whatever.\r\n\r\n                                CUNNINGHAM (O.S.)\r\n                    Puppies.\r\n\r\n       In the tent NEXT to Wade, CUNNINGHAM holds up his FIST to the\r\n       fabric. Wade can see it through the cloth in SILHOUETTE.\r\n\r\n                              CUNNINGHAM (CONT'D)\r\n                    It helps picturing puppies.\r\n\r\n       Wade gives Cunningham a KNUCKLE BUMP through the fabric.\r\n\r\n                                WADE\r\n                    Puppies.\r\n\r\n                              CUNNINGHAM\r\n                    Or kittens. If you swing that way.\r\n\r\n                              WADE\r\n                        (chuckles)\r\n                    I swing both ways.\r\n\r\n       Wade swallows hard, grows serious:\r\n\r\n                              WADE (CONT'D)\r\n                    But me, I've been making a list of things\r\n                    I still plan to do.\r\n\r\n                              CUNNINGHAM\r\n                    A bucket list?\r\n\r\n\r\n\r\n\r\n                                                                    (CONTINUED)\r\n                                                                      55.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n33   CONTINUED:                                                             33\r\n\r\n                            WADE\r\n                  I prefer fuck-it list: Naked tandem base-\r\n                  jumping with the WNBA's Sacramento\r\n                  Monarchs... Sparking up a spliff with the\r\n                  Olympic torch...\r\n\r\n                            CUNNINGHAM\r\n                  Finishing my Lego Millenium Falcon...\r\n\r\n                            WADE\r\n                  Giving Meredith Baxter Birney a dutch\r\n                  oven...\r\n\r\n                            CUNNINGHAM\r\n                  Making my kids banana pancakes...\r\n\r\n                             AJAX (O.S.)\r\n                  With the mouse ears? Creative, and\r\n                  delicious.\r\n\r\n     AJAX and ANGEL DUST enter CUNNINGHAM's tent and begin\r\n     prepping him for a fresh round of torture.\r\n\r\n                            AJAX (CONT'D)\r\n                  It's OK, I encourage distractions. Can't\r\n                  have you giving up on us, can we now, you\r\n                  little worm?\r\n\r\n     Suddenly, a VOICE calls out from the adjacent tent:\r\n\r\n                            WADE (O.S.)\r\n                  Don't take that shit, Cunningham! How\r\n                  tough can he be? Name like Francis.\r\n\r\n     Ajax is very subtly SURPRISED.      WHAT did Wade just say?       WADE\r\n     is still strapped down inside.      Talking nice and LOUD:\r\n\r\n                            WADE (CONT'D)\r\n                  That's right! He got `Ajax' off a dish-\r\n                  washing liquid!\r\n                      (laughs from nearby tents)\r\n                  Legal name's Francis. F-R-A-N-C-I-oops.\r\n\r\n     Ajax has ENTERED Wade's tent. Ajax's expression tells us all\r\n     we need to know about the validity of Wade's claim.\r\n\r\n     With as much freedom of motion as he has in one hand, Wade\r\n     WAVES a STUB of PAPER at Francis.\r\n\r\n                             WADE (CONT'D)\r\n                  Dry-cleaning tag, Francis.     Snagged it\r\n                  off your lab coat.\r\n                      (beat)\r\n                             (MORE)\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     56.\r\n                  Deadpool   Final Shooting Script   11/16/15\r\n33    CONTINUED: (2)                                                       33\r\n                           WADE (CONT'D)\r\n                 FYI. I may be able to get you the super-\r\n                 hero discount.\r\n\r\n      CLOSE-UP on the tag, which reads `FREEMAN, FRANCIS.'\r\n\r\n      Ajax stares hard at Wade with menacing eyes.\r\n\r\n                           AJAX\r\n                 You are so relentlessly annoying. Shut\r\n                 the fuck up, or I'll sew that pretty\r\n                 mouth shut.\r\n\r\n                           WADE\r\n                 Uh, I wouldn't do that. Here's the\r\n                 problem with round-the-clock torture.\r\n                 You can't really step it up from there.\r\n\r\n                           AJAX\r\n                 Is that what you think?\r\n\r\n                            WADE\r\n                 Yeah.   Francis.    That's what I think.\r\n\r\n34    OMITTED                                                              34\r\n\r\nV35   EXT/INT.   MONTAGE - VARIOUS                                         V35\r\n\r\n35    INT.   WORKSHOP - NIGHT - PAST                                       35\r\n\r\n      Two ORDERLIES and ANGEL DUST finish strapping Wade down and\r\n      attaching ELECTRODES to his head and chest. Wade is BOUND to\r\n      a HOSPITAL BED that's ENCASED in a large CAPSULE of\r\n      PLEXIGLAS.\r\n\r\n      The top half of the capsule is hinged to one side, OPEN,\r\n      allowing Angel Dust access to Wade.\r\n\r\n      Ajax sits eating a meal from some Tupperware in a nearby\r\n      chair.\r\n\r\n                           AJAX\r\n                 Seems your genes are as stubborn as you.\r\n                 But we can still increase your suffering.\r\n                 We don't even have a name for this next\r\n                 toy.\r\n\r\n      Various WIRES and TUBES run out of the capsule, connected to\r\n      OXYGEN TANKS, DIALS, and a MONITOR tracking BRAIN and HEART.\r\n\r\n                           AJAX (CONT'D)\r\n                 We reduce the oxygen in the air to the\r\n                 exact point you feel like you're\r\n                 suffocating.\r\n                           (MORE)\r\n\r\n                                                                (CONTINUED)\r\n                                                                         57.\r\n                   Deadpool      Final Shooting Script   11/16/15\r\n35   CONTINUED:                                                                35\r\n                            AJAX (CONT'D)\r\n                  If you start to pass out, and your brain\r\n                  waves slow, we turn up the O2. If you\r\n                  catch your breath, and your heart rate\r\n                  slows, we turn it back down. And we\r\n                  leave you. Right. There.\r\n\r\n                                WADE\r\n                  Um.   What?\r\n\r\n                            AJAX\r\n                  Waterboarding is the most severe stress\r\n                  known to man. This device prolongs that\r\n                  stress. For hours, days, weeks...\r\n\r\n     Angel Dust chews her match and TAPS the capsule with a\r\n     FINGER.\r\n\r\n                            ANGEL DUST\r\n                  Or if you keep yapping, years...\r\n\r\n                            WADE\r\n                  And I thought you were dicks before\r\n                  this.\r\n\r\n                            AJAX\r\n                  The saddest part? You still think we're\r\n                  making you a super-hero. You.\r\n                  Dishonorable discharge. Beating up pizza\r\n                  guys. Hip deep in hookers. You're\r\n                  nothing. I'd call you an asshole, but\r\n                  I'd have to answer to assholes. Little\r\n                  secret, Wade. The Workshop doesn't make\r\n                  super-heroes. It makes super-slaves.\r\n                  We're gonna fit you for a control collar\r\n                  and auction you to the highest bidder.\r\n                      (finishes meal, gets up)\r\n                  Who knows what they'll force you to do.\r\n                  Put down freedom fighters. Murder\r\n                  innocents. Or maybe just mow a lawn or\r\n                  two.\r\n\r\n                            ANGEL DUST\r\n                  There's a brave face.\r\n\r\n     Ajax goes to close the lid.\r\n\r\n                            WADE\r\n                  Seriously. Now you do have something in\r\n                  your teeth.\r\n\r\n                            AJAX\r\n                  Enjoy the weekend!\r\n\r\n\r\n\r\n                                                                    (CONTINUED)\r\n                                                                       58.\r\n                  Deadpool   Final Shooting Script   11/16/15\r\n35    CONTINUED: (2)                                                         35\r\n\r\n      Ajax swings the capsule CLOSED and LOCKS it. The sound leaks\r\n      away until all that's left is a HISSING SOUND as AJAX hits\r\n      BUTTONS to lower O2 LEVELS.\r\n\r\n      Wade's voice drops out as his breathing suddenly grows SHORT\r\n      and SHALLOW. The oxygen dials fall. His HEART-RATE SOARS.\r\n\r\n                           ANGEL DUST\r\n                     (chuckles)\r\n                 He looks like a turd in a punch-bowl.\r\n\r\n                           AJAX\r\n                     (bright idea)\r\n                 The `Punch-Bowl!'\r\n\r\n      Wade fights off panic. His breaths become desperate GASPS.\r\n      There's not enough air to talk, or even SCREAM.\r\n\r\n                                                         DISSOLVE TO:\r\n\r\n35A   INT.   WORKSHOP TENT - LATER                                           35A\r\n\r\n      Night.   Eerily DARK, SILENT.\r\n\r\n      An extreme CLOSE-UP of Wade's hand, nails clenched into the\r\n      surface of whatever he's lying on. Is his skin... actually\r\n      BUBBLING?\r\n\r\n      Two MEN enter the tent and stand over the PUNCH-BOWL.\r\n\r\n      CLICK. One of the men turns on a surgical light overhead,\r\n      revealing himself to be a KINDLY-looking DOCTOR, avuncular,\r\n      thick glasses. Next to him is an ORDERLY. The doctor peers\r\n      through the Punch-Bowl's lid. He is SURPRISED by what he\r\n      sees. He nods to the orderly: `Go on, hurry.'\r\n\r\n      The orderly quickly unlocks and unlatches the lid, then\r\n      swings it OPEN. Air RUSHES INTO the PUNCH-BOWL. The orderly\r\n      steps away, leaving the doctor alone in the room.\r\n\r\n      WADE, hidden in darkness, gasps as though surfacing after\r\n      being held underwater.\r\n\r\n      The doctor casts a SHADOW over WADE's face inside.         The\r\n      doctor is FASCINATED, ENLIVENED.\r\n\r\n                           DOCTOR\r\n                 Mr. Wilson... these results are\r\n                 remarkable.\r\n\r\n      Wade takes deep LUNGS-FUL of AIR.\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                       59.\r\n                    Deadpool   Final Shooting Script   11/16/15\r\n35A   CONTINUED:                                                          35A\r\n\r\n                             DOCTOR (CONT'D)\r\n                   Your cancer cells are more aggressive\r\n                   than ever. Dividing and metastasizing at\r\n                   a fantastic rate.\r\n\r\n                             WADE\r\n                       (broken, breathless)\r\n                   Yippee.\r\n\r\n                             DOCTOR\r\n                   But... the cells have inalterably\r\n                   changed. They're no longer destructive,\r\n                   but productive, selectively targeting and\r\n                   replacing damaged tissue.\r\n\r\n                             WADE\r\n                   That was a lot of... what's the word...\r\n                   syllables. Are you saying I'm better?\r\n\r\n                             DOCTOR\r\n                   Better than better.    A miracle.\r\n\r\n                              WADE\r\n                       (weak smile)\r\n                   My Mom used to call me that.\r\n                       (ALT:)\r\n                   Me and Jesus.\r\n                       (beat, to doctor)\r\n                   Thank you. I owe you my life.\r\n\r\n      Wade grows choked up. The doctor is taken with empathy and\r\n      affection. He tenderly brushes the hair off Wade's forehead,\r\n      of which the camera catches the tiniest glimpse. Wade's skin\r\n      is not RIGHT somehow.\r\n\r\n                             DOCTOR\r\n                   There. There. Your journey's been long\r\n                   and difficult. But you've become\r\n                   something extraordinary. Just rest now.\r\n                   Rest.\r\n\r\n      The doctor slowly exits.     Wade lies there.    Actually relaxes.\r\n\r\n                             DEADPOOL (V.O.)\r\n                   Then, just when I thought I could breathe\r\n                   easy...\r\n\r\n      Who appears over the PUNCH-BOWL but...\r\n\r\n      ...AJAX.\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                               60.\r\n                 Deadpool   Final Shooting Script   11/16/15\r\n35A   CONTINUED: (2)                                              35A\r\n\r\n                         AJAX\r\n                Oo. Someone lost his shot at homecoming\r\n                king.\r\n\r\n                          WADE\r\n                You f-fucking sadistic-\r\n\r\n                          AJAX\r\n                No. Not fair. Everything I've done to\r\n                you has been in your best interest. Even\r\n                this next bit. You may be cured, but you\r\n                still need to learn to be a better man.\r\n                Polite. Respectful. What better way to\r\n                teach you than to close this lid... and\r\n                keep torturing you stupid.\r\n\r\n      Ajax SLAMS the lid shut, LATCHES and LOCKS it. The hissing\r\n      resumes. Wade's eyes grow wide. He starts to slip-slide\r\n      toward absolute ANGUISH.\r\n\r\n                          DEADPOOL (V.O.)\r\n                If you think I'm losing my marbles `cause\r\n                I can't breathe. You're only half right.\r\n\r\n      Ajax appears to be looking in at Wade. But we RACK FOCUS to\r\n      reveal he's looking at his REFLECTION in the Plexiglas lid,\r\n      checking for stuff between his teeth.\r\n\r\n                          DEADPOOL (V.O.)\r\n                See, if Francis was able to see his\r\n                reflection...\r\n\r\n      The camera SWINGS around to Wade's POINT-OF-VIEW of Ajax\r\n      through the glass lid, which has been newly ILLUMINATED by\r\n      the surgical light above...\r\n\r\n      ...and then RACKS FOCUS to WADE's REFLECTED FACE. Covered\r\n      with HORRIFIC SCARS. Wade is no longer a handsome young man.\r\n      He is a monster. Which is perfectly visible to him one foot\r\n      away.\r\n\r\n                          DEADPOOL (V.O.)\r\n                You know what they say. You always\r\n                remember your first time.\r\n\r\n      Wade throws back his head in a SILENT SCREAM.\r\n\r\n                          DEADPOOL (V.O.)\r\n                Even 5 years later...\r\n                                                                       61.\r\n                    Deadpool   Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n36     EXT./INT.   SCRAP-YARD / GROUND - DAY - PRESENT                       36\r\n\r\n       Back in the PRESENT, we find ourselves in a huge SCRAP-YARD,\r\n       where various ships, planes, etc. are sold for scrap iron.\r\n\r\n       Among various vehicles is an OLD, BATTERED COMBAT CARRIER,\r\n       long given up for dead.\r\n\r\n       A heavy truck navigates through the heaps of scrap-metal and\r\n       grinds to a stop in front of the carrier.\r\n\r\n       Two heavyset MEN climb down and head toward the back of the\r\n       truck, heave the heavy door open.\r\n\r\n       AJAX and ANGEL DUST stand just inside, boxes and gear piled\r\n       up behind them. They hop down as four more rough-looking men\r\n       pile out behind them.\r\n\r\n       Angel Dust drags out a WOODEN CRATE. The planks crunch as\r\n       she digs her fingers into the wood and heaves it up on one\r\n       burly shoulder as if it weighed no more than a sack of flour.\r\n       Heavy AMMO peeks through.\r\n\r\n                             ANGEL DUST\r\n                   Better to be the hunter than the hunted.\r\n\r\n       Ajax and Angel Dust walk across the muddy yard toward a\r\n       service elevator bolted to the rusting hulk of the carrier.\r\n\r\n                             AJAX\r\n                   Either I kill him, or he kills me.     Let's\r\n                   put him out of our misery...\r\n\r\nVA37   INT.   GARBAGE TRUCK - DAY                                        VA37\r\n\r\n       DEADPOOL lays horizontal.     He is speaking to the AUDIENCE:\r\n\r\n                             DEADPOOL\r\n                   There... all caught up.\r\n\r\n       He CLIMBS up and out of the GARBAGE TRUCK.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                       (yells to driver)\r\n                   Thanks for the lift! Apologies if I bled\r\n                   in the recyclables.\r\n\r\n37     INT./EXT.   DEADPOOL'S LAIR - DAY - PRESENT                           37\r\n\r\n       A mid-city DUPLEX. Borderline ghetto. Semi-furnished,\r\n       `first apartment' quality: futons and torchiere lamps.\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                      62.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n37   CONTINUED:                                                             37\r\n\r\n     Stained carpet, currently being swept by a roaming ROOMBA.\r\n     IKEA... everywhere.\r\n\r\n     The same old AFRICAN-AMERICAN WOMAN we glimpsed early in the\r\n     movie - late 70's - purple floral dress - sits on a ratty\r\n     couch, where the typical old woman might KNIT.\r\n\r\n     Instead, this old woman uses a BOX-CUTTER to lay waste to a\r\n     BIG CARDBOARD BOX from IKEA - the `IVAR SHELVING UNIT.'\r\n\r\n     She lays out its components and tools on a wobbly IKEA NORNAS\r\n     COFFEE TABLE...\r\n\r\n     ...made more difficult by the fact that she is completely\r\n     BLIND. This is Deadpool's roommate, BLIND AL.\r\n\r\n     Suddenly, Blind Al's KEEN EAR picks up a faint, distant\r\n     KNOCKING. She cocks her head to LISTEN.\r\n\r\n38   EXT. DEADPOOL'S LAIR - DAY - PRESENT                                   38\r\n\r\n     ANGLE ON THE FRONT YARD:\r\n\r\n     Dirt. No grass. `93 Chevy Avon up on BLOCKS. An exhausted\r\n     DEADPOOL is slumped against his own front door, red suit, no\r\n     mask, no right HAND. He is KNOCKING weakly on the door with\r\n     the SIDE of his HEAD.\r\n\r\n39   INT. DEADPOOL'S LAIR - DAY - PRESENT                                   39\r\n\r\n     ANGLE ON THE LIVING ROOM:\r\n\r\n     BLIND AL stands up in comfy creme nursing shoes. Grabs her\r\n     red-tipped CANE. And shuffles toward the front door...\r\n\r\n     ...when she is TRIPPED by the ROOMBA.        She FACE-PLANTS.\r\n\r\n                            DEADPOOL (O.S.)\r\n                      (from outside)\r\n                  Let's get ready to Rooooooomba!\r\n\r\n                            BLIND AL\r\n                      (under breath)\r\n                  Ass-hat.\r\n\r\n     Al SWINGS her cane angrily, again and again, trying to hit\r\n     the robotic vacuum, which moves happily just out of reach.\r\n\r\n     She reaches her knees and stretches for the door when...\r\n\r\n     ...DEADPOOL SPRINGS it open from outside, SLAMMING it into\r\n     her HEAD. Blind Al goes down again.\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       63.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n39   CONTINUED:                                                              39\r\n\r\n                            DEADPOOL\r\n                  Morning, roomie!\r\n                      (sniffs)\r\n                  This place reeks like old lady pants.\r\n\r\n                            BLIND AL\r\n                      (still supine)\r\n                  Yes. I'm old. I wear pants.\r\n\r\n                            DEADPOOL\r\n                  But you're no lady.\r\n\r\n     Blind Al struggles to a sitting position. Deadpool walks\r\n     past her in his socks, drops his muddy BOOTS to the floor and\r\n     slips into a pair of POWDER-BLUE CROCS parked just inside the\r\n     door.\r\n\r\n                              DEADPOOL (CONT'D)\r\n                  So comfy.\r\n\r\n                            BLIND AL\r\n                  Upside of being blind:     I've never seen\r\n                  you in Crocs.\r\n\r\n                            DEADPOOL\r\n                  You mean my big rubber masturbatin'\r\n                  shoes?\r\n\r\n                            BLIND AL\r\n                  Yes I know. Downside of being blind:        I\r\n                  hear everything in this duplex.\r\n\r\n     Deadpool walks bitterly past one wall of the DUPLEX, which is\r\n     COVERED - WALL-to-WALL, FLOOR-to-CEILING, with CHRISTMAS\r\n     ADVENT CALENDARS.\r\n\r\n     Tons of ornaments/candies/etc. adorn the calendars.            There's\r\n     not ONE CALENDAR left uncovered.\r\n\r\n                            DEADPOOL\r\n                  One-thousand eight-hundred twenty-two\r\n                  ornaments pinned to two-hundred-sixty\r\n                  calendars. All for a `Christmas' that...\r\n                  never... came!\r\n\r\n                            BLIND AL\r\n                  Too much naughty, too little nice.\r\n\r\n                            DEADPOOL\r\n                  Sit on a stick.\r\n\r\n     DEADPOOL SPLAYS OUT on a white futon, MOANING, nursing his\r\n     horrifying wound.\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                      64.\r\n                Deadpool      Final Shooting Script   11/16/15\r\n39   CONTINUED: (2)                                                         39\r\n\r\n                             BLIND AL\r\n               Bactine?\r\n\r\n                         DEADPOOL\r\n                   (dripping sarcasm)\r\n               Yeah. Bactine should do it. How's the\r\n               Kullen coming? IKEA doesn't assemble\r\n               itself.\r\n\r\n     Blind Al sits back on the ratty couch and begins applying the\r\n     finishing touches to the shelving unit.\r\n\r\n                         BLIND AL\r\n               You're telling me. I don't mind the\r\n               Kullen. It's an improvement on the\r\n               Hurdal.\r\n\r\n                         DEADPOOL\r\n               Anything's an improvement on the Hurdal.\r\n               I'd have taken a Hemnes... or even a\r\n               Trysil... over the Hurdal. But I didn't\r\n               get excited `til I saw the Kullen.\r\n\r\n                         BLIND AL\r\n               Screw please.\r\n\r\n                         DEADPOOL\r\n               Here? Now? Just kidding.          I know it's\r\n               been decades for you.\r\n\r\n                         BLIND AL\r\n               You'd be surprised.\r\n\r\n                         DEADPOOL\r\n               And totally grossed out!\r\n\r\n     Blind Al turns the final screw, beyond unenthusiastic.\r\n\r\n                             BLIND AL\r\n               Ta.    Dah.\r\n\r\n     The dresser look like the Leaning Tower of Piza in shitty\r\n     particle board. Deadpool TOSSES a DIRTY MAGAZINE on top.\r\n     The Kullen COLLAPSES.\r\n\r\n                         BLIND AL (CONT'D)\r\n               I wish I'd never heard of Craig's List.\r\n\r\n                         DEADPOOL\r\n               And I quote: `Looking for roommate.\r\n               Blind to life's imperfections. Must be\r\n               good with hands.' Or wouldya rather I\r\n               build IKEA and you pay rent?\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       65.\r\n                  Deadpool   Final Shooting Script     11/16/15\r\n39     CONTINUED: (3)                                                        39\r\n\r\n                           BLIND AL\r\n                 Why such a douche this morning?\r\n\r\n                           DEADPOOL\r\n                 Let's recap. That cock-thistle who\r\n                 turned me into this freak... the one I've\r\n                 been waiting five years for... slipped\r\n                 through my arms today. Arm.\r\n\r\n       Deadpool holds up his previously severed arm, which now has\r\n       a little tweenage ARM emerging off it. Yes. Deadpool can\r\n       GROW BACK LIMBS.\r\n\r\n                           DEADPOOL (CONT'D)\r\n                 Catching him was my only chance to be hot\r\n                 again. Get my super-sexy ex back. And\r\n                 stop the same shit from happening to\r\n                 anyone else. So yeah, things are pretty\r\n                 fucking scrumptious.\r\n\r\n       Deadpool stands. Walks behind the couch, and as he passes\r\n       the back of Blind Al's head... FARTS.\r\n\r\n                           DEADPOOL (CONT'D)\r\n                 Hash-tag Drive-by.\r\n\r\n                           BLIND AL\r\n                     (to herself)\r\n                 I'm gonna find this `Craig.'        And I'm\r\n                 gonna kill him.\r\n\r\n                           DEADPOOL\r\n                 Once I've got the cure, I'm gonna do the\r\n                 same to Francis...\r\n\r\nRS40   INT. WORKSHOP TENT - LATER                                        RS40\r\n\r\n       WADE, newly scarred, hidden in darkness, continues to GASP as\r\n       though being held underwater. Then the lid on the punch-bowl\r\n       SLIDES BACK, revealing AJAX. Wade takes deep LUNGS-FUL of\r\n       AIR. Ajax leans in for a closer look.\r\n\r\n                           AJAX\r\n                 Bloody hell. Someone lost his shot at\r\n                 homecoming king.\r\n\r\n                           WADE\r\n                     (can barely speak)\r\n                 What have you done to me?!\r\n\r\n                           AJAX\r\n                 You give me too much credit. This...\r\n                 this is the result of your genes.\r\n                           (MORE)\r\n\r\n                                                                  (CONTINUED)\r\n                                                                        66.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\nRS40   CONTINUED:                                                         RS40\r\n                              AJAX (CONT'D)\r\n                    The punch bowl merely raised your stress\r\n                    to trigger the mutation.\r\n\r\n                              WADE\r\n                    You... sadistic... fuck!\r\n\r\n                              AJAX\r\n                    Where's the gratitude?! You're cured!\r\n                    Your mutated cells can heal anything.\r\n                    They're attacking the cancer as fast as\r\n                    it can form. Your insides are a war\r\n                    zone. Not to mention your outsides!\r\n\r\n       Wade looks stunned as he struggles to process all this\r\n       information. Ajax smiles down.\r\n\r\n                              AJAX (CONT'D)\r\n                    I've seen similar side-effects before.         I\r\n                    could cure them for you. But really,\r\n                    where's the fun in that?\r\n\r\n       Wade says nothing, hating him but wanting to believe.\r\n\r\n                              AJAX (CONT'D)\r\n                    I'm going to close this lid again.     Maybe\r\n                    you no longer need it. But I do.\r\n\r\n       For a long moment, Wade stares intensely at Ajax and sees...\r\n       nothing, a black hole of empathy. And he knows this is a man\r\n       who will never stop hurting him.\r\n\r\n       ***NOTE: We will not be reshooting the rest of the scene\r\n       below with the exception of the final shot.****\r\n\r\n       So he turns his gaze to the ceiling and WITHDRAWS into\r\n       himself... the one place the cruelty can no longer reach him.\r\n\r\n       Angel Dust enters, chewing on her usual matchstick.\r\n\r\n                              AJAX\r\n                    He's all yours.\r\n\r\n       Angel leans over the Punch-bowl, starts to undo Wade's\r\n       restraints.\r\n\r\n                              ANGEL\r\n                    You smell like shit.\r\n\r\n       When Angel Dust leans close to Wade's head he suddenly comes\r\n       alive and uses the strength he has left to HEAD-BUTT her in\r\n       the FOREHEAD.\r\n\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                        67.\r\n                   Deadpool   Final Shooting Script     11/16/15\r\n     CONTINUED:\r\n\r\n                            AJAX\r\n                      (impressed)\r\n                  Whoa.\r\n\r\n     Angel advances toward Wade.      Ajax stops her.\r\n\r\n                            AJAX (CONT'D)\r\n                  Hey, hey, alright. It's alright. I\r\n                  think he earned that one, yeah? You take\r\n                  off. Go on... off you go.\r\n\r\n     As Angel Dust EXITS the tent, she reaches to her mouth for\r\n     her matchstick... only it's not there. She frowns, fishes\r\n     another match from her pocket, and tucks it between her lips.\r\n\r\n     Ajax finishes strapping Wade back down and goes to close the\r\n     lid.\r\n\r\n                            AJAX (CONT'D)\r\n                  One question. What's my name?\r\n\r\n     Wade remains listless, mouth SHUT.       BLINKS.\r\n\r\n                            AJAX (CONT'D)\r\n                  Didn't think so.\r\n\r\n     Ajax CLOSES and LOCKS the lid.      HISS.    The oxygen DIALS FALL.\r\n\r\n                            DEADPOOL (V.O.)\r\n                  Sorry, Francis. But my lips are sealed.\r\n\r\n     And then we're inside the punch bowl with Wade as the oxygen\r\n     levels drop and the suffering rises. Through a fog of misery\r\n     Wade sees Ajax staring down, watching him, drinking in his\r\n     pain.\r\n\r\n41   INT.   WORKSHOP - NIGHT - PAST                                           41\r\n\r\n     Back in the Punch-Bowl, Wade OPENS his MOUTH... within which\r\n     he was HIDING a SINGLE MATCHSTICK, clenched carefully - dryly\r\n     - between his teeth.\r\n\r\n     He inhales... then SPITS OUT the match into his waiting PALM.\r\n     Finally, he STRIKES it against the side of the Punch Bowl.\r\n\r\n     Wade aims the now FLAMING match toward the tiny HOLE through\r\n     which OXYGEN flows. The match is quickly burning down. Will\r\n     it reach the hole before it snuffs out?\r\n\r\n     At the last possible moment...\r\n\r\n     ...the flame COMBUSTS the stream of oxygen, IGNITING it...\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                        68.\r\n                  Deadpool     Final Shooting Script    11/16/15\r\n41   CONTINUED:                                                               41\r\n\r\n     ...back through the TRANSPARENT PLASTIC TUBE that trails\r\n     outside the Punch-Bowl.\r\n\r\n     The flame SNAKES through the tube, this way and that, until\r\n     it reaches the OXYGEN TANK standing next to the Punch-Bowl.\r\n     A beat. Then the TANK EXPLODES.\r\n\r\n     The   BLOWS APART.      The hospital bed SNAPS in TWO.\r\n\r\n     Out in the ward, the FIREBALL curls outward, spreading from\r\n     TENT to TENT. BOOM! BOOM! Other flammable tanks DETONATE.\r\n\r\n     The tents GO UP like ROMAN CANDLES.        It's now MASS CHAOS.\r\n\r\n     ALARMS BLARE.    Flames LEAP.     Smoke BILLOWS.     Patients FLEE.\r\n\r\n     A CURTAIN of FIRE suddenly DISPERSES, replaced by billowy\r\n     WHITE SMOKE from an OVER-SIZED CHROME FIRE EXTINGUISHER...\r\n\r\n     ...held by AJAX, who STRIDES grimly toward Wade's tent.             He\r\n     throws back the burning fabric...\r\n\r\n     ...and nearly EATS an OXYGEN TANK.        He BLOCKS it at the last\r\n     moment with his FIRE EXTINGUISHER.        CLANG.\r\n\r\n     On the other end of the oxygen tank, WIND-MILLING it with\r\n     unbridled FEROCITY, is WADE.\r\n\r\n     WADE and AJAX SWING the oxygen tank and fire extinguisher\r\n     like modern day CLUBS, trying to take off each other's heads.\r\n\r\n     CLANG!   BANG!   BAM!    The tanks COLLIDE in mid-air.\r\n\r\n     Ajax's fingers CRUNCH between metal.        He doesn't even feel\r\n     it.\r\n\r\n     Wade grabs the HOSE of Ajax's fire extinguisher, angles it\r\n     up, and gets his finger on the TRIGGER.\r\n\r\n     The extinguisher BLASTS.      Ajax is momentarily BLINDED.\r\n\r\n     Wade brings the oxygen tank down like a LUMBERJACK'S AXE.\r\n     Ajax BLOCKS it, but is driven to his KNEES.\r\n\r\n     Wade's eyes are lit with fire. DOWN the tank COMES, again\r\n     and AGAIN. Ajax takes his own fire extinguisher to the CHIN.\r\n     Then catches a BLOW from the oxygen TANK to his TEMPLE.\r\n\r\n     The extinguisher goes FLYING. Wade swings the OXYGEN TANK\r\n     AGAIN, but against all odds, AJAX CATCHES it and SLAMS it\r\n     back into Wade's NOSE. CRUNCH.\r\n\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                     69.\r\n                Deadpool     Final Shooting Script   11/16/15\r\n41   CONTINUED: (2)                                                        41\r\n\r\n     Ajax rises to his feet, and the two grip OPPOSITE SIDES of\r\n     the OXYGEN TANK, GRAPPLING with every ounce of strength.\r\n\r\n     Wade sweeps Ajax's feet and he topples over backwards, Wade\r\n     on top of him. Wade lifts the heavy tank and slams it into\r\n     his face. Once. Twice. Three times. CRACK.\r\n\r\n     As he's about to finish the job Ajax smiles, blood bubbling\r\n     from his smashed lips.\r\n\r\n                         AJAX\r\n               You can't kill me, Wade. I'm the only\r\n               one who can fix that ugly mug.\r\n\r\n     Wade looks torn as his rage gives way to something like hope.\r\n     He tosses the tank away.\r\n\r\n                         WADE\r\n               Then time to make me me again.\r\n\r\n     A scream of terror behind Wade makes Wade turn.\r\n\r\n                          CUNNINGHAM (O.S.)\r\n               Wade!   Help! Wade!\r\n\r\n     Wade looks through the smoke and flame and spies a helpless\r\n     Cunningham lying in the flaming wreckage.\r\n\r\n                            WADE\r\n               Fuck!\r\n\r\n     Wade drops Ajax and SPRINTS to Cunningham, starts dragging at\r\n     the WRECKAGE trapping him, when... SLICE! A long piece of\r\n     sheared REBAR THRUSTS CLEAN THROUGH his CHEST from BEHIND.\r\n     The force sends the spear DEEP into the wooden floor beams,\r\n     pinning Wade like an insect in an entomologist's display.\r\n\r\n     In a grand display of strength, AJAX BENDS the end of the\r\n     rebar to keep Wade pinned... then walks around and squats\r\n     down into Wade's eye line, wearing a triumphant sneer.\r\n\r\n                            AJAX\r\n               Say it.     `Francis.'\r\n\r\n     Blood dribbles from Wade's mouth as he tries in vain to push\r\n     himself off the bloody spike of metal. Ajax rises, scans the\r\n     burning workshop with a scowl - clearly a lost cause - and\r\n     turns to leave.\r\n\r\n     Cunningham screams again as the flames near him. Grunting\r\n     with the pain and effort Wade tries to push himself off the\r\n     spike.\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                         70.\r\n                   Deadpool   Final Shooting Script      11/16/15\r\n41    CONTINUED: (3)                                                           41\r\n\r\n      His hands slip on the blood-slick metal, and he cannot free\r\n      himself. His VOLTRON RING lies on the floor next to him.\r\n\r\n      Wade and Cunningham share a last look.          Cunningham clamps his\r\n      jaws shut, fighting the agony.\r\n\r\n      CREAK... CRACKLE... the ROOF COLLAPSES, BURYING BOTH OF THEM.\r\n      And we... CUT TO BLACK.\r\n\r\n                                                              FADE UP ON:\r\n\r\n42    INT. WORKSHOP - DAY                                                      42\r\n\r\n      Morning's first sunlight. WADE's VOLTRON RING lies\r\n      COMPLETELY MELTED in the DEBRIS. The camera follows it to\r\n      Wade's hand... then up his arm to his FACE.\r\n\r\n      WADE's eyelids flutter, and he COMES TO. He is naked, his\r\n      hospital gown burned away. We see BLACKENED SLUDGE, SOOT,\r\n      charred remains. The melted and scorched metal rod next to\r\n      him.\r\n\r\n      Wade slowly realizes where he is and what happened. He\r\n      reaches down to his stomach wound... WHICH HAS MIRACULOUSLY\r\n      HEALED. Wade sits up, stunned.\r\n\r\n                            DEADPOOL (V.O.)\r\n                  I didn't just get the cure to El Cáncer.\r\n                  I got the cure to everything.\r\n\r\nV43   EXT. CITY STREET - MORNING - PAST                                        V43\r\n\r\n      VANESSA, tired, broken, mind seemingly elsewhere, walks\r\n      towards her apartment. She passes a loving young COUPLE, arm-\r\n      in-arm.\r\n\r\n      Vanessa clocks this sadly, continues on.\r\n\r\n      Behind her, PEOPLE walk to and fro.      Among them, we REVEAL:\r\n\r\n      WADE, dressed in ill-fitting pants and a hoodie. He is a\r\n      TRAIN-WRECK, scarred face on display to the world for the\r\n      first time.\r\n\r\n      He looks purposeful, but tentative, walking behind Vanessa,\r\n      GAINING on her.\r\n\r\n      ANGLE ON:   WADE's P.O.V.\r\n\r\n      A BOY goes by on his bike, trying hard not to gape. A\r\n      TODDLER in a STROLLER looks up and BURSTS INTO TEARS. The\r\n      toddler's MOTHER hustles past.\r\n\r\n\r\n\r\n                                                                    (CONTINUED)\r\n                                                                       71.\r\n                    Deadpool   Final Shooting Script   11/16/15\r\nV43   CONTINUED:                                                          V43\r\n\r\n                             MOTHER\r\n                   Alex, don't stare.\r\n\r\n      VANESSA stops and rifles through her purse for keys.\r\n\r\n      STILL on Wade's P.O.V. Wade stops, too, suddenly paralyzed,\r\n      as the moment to face Vanessa arrives.\r\n\r\n      As he hesitates, torn with anguish, the WHISPERS seem to\r\n      grow, rising in volume until they become deafening:\r\n\r\n                             WHISPER 2 (O.S.)\r\n                   Oh, my, god, that is so fucking gnarly.\r\n\r\n                             WHISPER 3 (O.S.)\r\n                   I just lost my appetite.\r\n\r\n      Wade spins, trying to see where the voices are coming from.\r\n      Nowhere... everywhere. The WHISPERS crescendo, now more in\r\n      Wade's mind than in reality.\r\n\r\n      He turns back to Vanessa, his face a mask of fear and pain...\r\n      just as she disappears into her apartment building. The\r\n      closing glass door reveals his own HIDEOUS REFLECTION STARING\r\n      BACK AT HIM.\r\n\r\n                              DEADPOOL\r\n                   In the whole wide world, there's nothing\r\n                   as ugly...\r\n                       (beat)\r\n                   ...as fear.\r\n\r\n      He gives up on his mission, backing away from his reflection,\r\n      Vanessa, his old life. He stumbles off the curb and into the\r\n      street, when... BAM!\r\n\r\n      He is CRUSHED OUT OF FRAME by a SPEEDING BUS.\r\n\r\n                                                           SMASH CUT TO\r\n                                                                 BLACK.\r\n\r\n      FADE UP ON:\r\n\r\nA43   INT.   MORGUE - NIGHT                                               A43\r\n\r\n      THREE BODY BAGS lie on SLABS in a MORGUE.\r\n\r\n      Without warning, the MIDDLE bag SITS UP STRAIGHT at the\r\n      WAIST...\r\n\r\n      ...then tries to CATERPILLAR its way to the edge of its\r\n      slab...\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                           72.\r\n                     Deadpool    Final Shooting Script     11/16/15\r\nA43    CONTINUED:                                                             A43\r\n\r\n       ...but instead pitches off the slab - CRUNCH - FACE-FIRST\r\n       onto the floor.\r\n\r\n                                WADE (O.S.)\r\n                    Ow.\r\n\r\nB44    INT.   DEADPOOL'S LAIR - NIGHT                                           B44\r\n\r\n       An FBI-STYLE `ORGANIZATIONAL CHART' has been pinned on Wade's\r\n       CORKBOARD in the lair. A `pyramid' of baddies are linked by\r\n       strings. Each baddie is depicted not by a photograph, but a\r\n       child-like CRAYON DRAWING.\r\n\r\n       Second from the top is the RECRUITER.\r\n\r\n       At the APEX of the pyramid is AJAX HIMSELF.\r\n\r\n       DEADPOOL, in his LAIR, sews together an early `proto-\r\n       costume.'\r\n\r\n       We see quick cuts of pieces of it going on:\r\n\r\n       White Adidas track suit. White gloves.            White boots.     And\r\n       some sort of white mask...\r\n\r\n       A single gun, underarm holster, boot knife but no swords.\r\n\r\nVC44   INT.   POOL HALL - NIGHT                                                 VC44\r\n\r\n                              DEADPOOL\r\n                    Don't make me ask twice.     Where's\r\n                    Francis?!\r\n\r\n       DEADPOOL questions a bleeding thug, more bodies scattered\r\n       across a floor littered with broken furniture behind him.\r\n\r\n       Another thug rushes in and smashes a pool cue over Deadpool's\r\n       skull. Deadpool snatches the broken shaft of wood and PUNCHES\r\n       it into the thugs belly.\r\n\r\n       A third thug staggers to his feet, pulls a pistol, fires\r\n       multiple shots point blank. Deadpool staggers back, blood\r\n       blossoming across his white suit.\r\n\r\n       \"CLICK\"\r\n\r\n       The thug stares in disbelief that Deadpool's still standing.\r\n\r\n       Deadpool looks down at the shaft of wood in his hand.\r\n       Thinks.\r\n\r\n\r\n\r\n\r\n                                                                      (CONTINUED)\r\n                                                                           73.\r\n                     Deadpool      Final Shooting Script   11/16/15\r\nVC44   CONTINUED:                                                            VC44\r\n\r\n                              DEADPOOL (CONT'D)\r\n                    I said, where's... fucking... FR-\r\n                        (realizes)\r\n                    You made me ask twice.\r\n\r\n       Deadpool spins the bloody cue with inhuman dexterity and\r\n       starts towards the terrified thug, accidentally knocking over\r\n       a PITCHER of BLOODY MARY onto his already bloody stained\r\n       suit.\r\n\r\n                                  DEADPOOL (CONT'D)\r\n                    Fuck.   Me.\r\n\r\nD44    INT.    LAUNDROMAT - DAY                                               D44\r\n\r\n       DEADPOOL, TIDE STAIN-STICK in hand, tries unsuccessfully to\r\n       get the blood out of his white suit.\r\n\r\n       We get our first glimpse of BLIND AL, who's sitting next to\r\n       Deadpool at the laundromat, completely unfazed by the\r\n       bloodbath:\r\n\r\n                              BLIND AL\r\n                    Seltzer water and lemon for blood.\r\n                        (off Deadpool's impressed\r\n                         look, shrugs)\r\n                    Or wear red.\r\n\r\n       Deadpool's eyes light up. He crumples this suit into a ball\r\n       and tosses it into a trash bin.\r\n\r\nE44/H44 INT.   DEADPOOL'S LAIR - NIGHT                                    E44/H44\r\n\r\n       Deadpool stabs a KNIFE into the picture of the GOON he just\r\n       killed (at the bottom of the pyramid)... right in the\r\n       FOREHEAD.\r\n\r\nF44    INT.    LAIR - NIGHT                                                   F44\r\n\r\n       DEADPOOL's at the sewing machine again.\r\n\r\n       Quick cuts of a RED `proto' outfit going on: Cheap red\r\n       sweats. Red gloves. Red converse. As yet unseen RED MASK,\r\n       which turns out to be...\r\n\r\nVG44   INT.    UNDERGROUND FIGHT - NIGHT                                     VG44\r\n\r\n       ...a RED `LUCHA LIBRE' PRO WRESTLING MASK.\r\n\r\n       Deadpool stands in the shadows of a dingy basement, low\r\n       ceilings, walls stacked high with cases of liquor.\r\n\r\n\r\n\r\n\r\n                                                                      (CONTINUED)\r\n                                                                          74.\r\n                     Deadpool     Final Shooting Script   11/16/15\r\nVG44   CONTINUED:                                                           VG44\r\n\r\n       In a BOXING RING at the center of the room two WOMEN pound\r\n       each other surrounded by a scrum of a CROWD. Deadpool spies\r\n       his mark in a dirty white suit pressed in tight ringside.\r\n\r\n       Deadpool pulls his mask down, wades into the crowd, throwing\r\n       men aside, PLOWING toward his target.\r\n\r\n       The mark sees Deadpool at the last second, turns as a KATANA\r\n       flashes out and skewers his hand, pinning it to the wall.\r\n       Deadpool fires a couple shots into the ceiling, sending the\r\n       rest of the crowd rushing for the exit.\r\n\r\n                              DEADPOOL\r\n                    Don't make me ask twice.      Where's-\r\n\r\n                                                             SMASH CUT TO:\r\n\r\nJ44    INT./EXT. VARIOUS LOCATIONS - INTERROGATIONS/KILLS                    J44\r\n\r\n       Deadpool has a goon at sword-point.\r\n\r\n                              DEADPOOL\r\n                    Donde esta Francisco?\r\n\r\n                              THUG\r\n                    I don't speak Spanish.\r\n\r\n                              DEADPOOL\r\n                        (sighs)\r\n                    And I don't have time for you to learn.\r\n\r\n       Deadpool kills the thug.\r\n\r\n                              DEADPOOL (CONT'D)\r\n                    Take me to your leader.\r\n                        (turns)\r\n                    I've always wanted to say that.\r\n\r\n\r\n\r\n                                 DEADPOOL (CONT'D)\r\n                    Squeal.     Like a pig. Where's Francis?\r\n\r\n\r\n\r\n                              DEADPOOL\r\n                    In no particular order. Where's your\r\n                    boss? And where can I find good Indian\r\n                    food?\r\n\r\n                              HENCHMAN\r\n                    Why the red suit?\r\n\r\n\r\n\r\n                                                                     (CONTINUED)\r\n                                                                        75.\r\n                    Deadpool    Final Shooting Script   11/16/15\r\nJ44   CONTINUED:                                                           J44\r\n\r\n                             DEADPOOL\r\n                   That's so bad guys can't- never mind,\r\n                   they've already heard that.\r\n\r\n\r\n\r\n                             DEADPOOL (CONT'D)\r\n                   You're about to tell me everything you\r\n                   know about Francis Freeman. Known\r\n                   aliases. Current whereabouts. Boxers or\r\n                   briefs. Go.\r\n\r\n\r\n\r\n                             DEADPOOL (CONT'D)\r\n                       (forces guy's mouth open,\r\n                        goes in with knife)\r\n                   Open your mouth. Here comes the\r\n                   airplane!\r\n\r\n                             GOON\r\n                       (gun pointed at forehead, a\r\n                        la Joseph Takagi)\r\n                   I don't know, I'm telling you. You're\r\n                   just going to have to kill me.\r\n\r\n                               DEADPOOL\r\n                   OK.\r\n                       (shoots goon in head, a la\r\n                        Hans Gruber, then, to\r\n                        audience:)\r\n                   Right?!\r\n\r\n\r\n\r\n                             DEADPOOL (CONT'D)\r\n                       (goon at knifepoint)\r\n                   Don't make me break out the Collective\r\n                   Soul CDs.\r\n\r\n\r\n\r\n\r\n                             DEADPOOL\r\n                   You give me your boss.     I give you the\r\n                   rest of your life.\r\n\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                        76.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\nJ44    CONTINUED: (2)                                                      J44\r\n\r\n                              DEADPOOL\r\n                        (throws woman onto table)\r\n                    I don't feel good about myself.     But\r\n                    where is he? I'm so sorry.\r\n\r\nL44    EXT./INT.    MONTAGE - VARIOUS                                      L44\r\n\r\n       New COSTUME.     BOOM.   A MAN dies.\r\n\r\n       STAB.    His picture is knifed.\r\n\r\n       BOOM.    STAB.\r\n\r\n       QUESTIONS.\r\n\r\n       BOOM!    STAB!\r\n\r\n       INTERROGATION.\r\n\r\n       BOOM!    STAB!\r\n\r\n       DEADPOOL questions more and more thugs, each bit of\r\n       information bringing him closer....\r\n\r\n       Soon there is a FOREST of knives sticking from the board.\r\n\r\n       ...and only the RECRUITER and AJAX are left.\r\n\r\nK44/VK44 INT.   RICE WORLD - NIGHT                                    K44/VK44\r\n\r\n       A wretched room, dirty mattresses covering the floor. Dim\r\n       light scatters through a tangle of IV bags hastily strung up\r\n       over MEN too poor to have anywhere else to go and die.\r\n\r\n       The RECRUITER kneels, speaking quietly to a particularly\r\n       hardened patient. He places a card in the man's emaciated\r\n       hand, then stands and walks toward a low doorway.\r\n\r\n       The recruiter enters a brightly lit room stacked high with\r\n       bags of rice. Two heavily armed THUGS fall in beside him.\r\n       The men scan the aisles as they move toward a door leading\r\n       out into an alley.\r\n\r\n                              DEADPOOL\r\n                    Agent Smith!\r\n\r\n       They turn to see DEADPOOL, high atop a stack of rice bags.\r\n\r\n                              DEADPOOL (CONT'D)\r\n                    I know, right?! I look like a million\r\n                    bucks.\r\n                        (turns to camera)\r\n                              (MORE)\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                       77.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\nK44/VK44\r\n       CONTINUED:                                                    K44/VK44\r\n                              DEADPOOL (CONT'D)\r\n                    Literally - this suit cost Fox a million\r\n                    dollars.\r\n\r\n       Without a word, the Recruiter flees, running through the big\r\n       roll-up door.\r\n\r\n       Deadpool leaps to land between the two bodyguards as they\r\n       draw their weapons and spray the room with gunfire.\r\n\r\n       One goes down in a bloody heap. Deadpool leaps toward the\r\n       other, skewers him with both swords. The thug falls\r\n       backward, dead before he hits the ground.\r\n\r\nL44/VL44 EXT. ALLEY - NIGHT                                           L44/VL44\r\n\r\n                              DEADPOOL\r\n                    Come out, come out, wherever you are!\r\n                        (darkens)\r\n                    Don't make me ask tw-\r\n                        (pleasantly surprised)\r\n                    Good for you!\r\n\r\n       The Recruiter has stepped timidly from between overflowing\r\n       garbage bins, hands raised, eager to talk his way out of this\r\n       mess:\r\n\r\n                              RECRUITER\r\n                    To whom should I address my... desperate\r\n                    bargaining?\r\n\r\n                              DEADPOOL\r\n                    Don't recognize the voice? Maybe the\r\n                    resumé: Forty-one confirmed kills. Make\r\n                    that Eighty-nine. Seven the past week\r\n                    alone. Same rate most folks...\r\n                        (pulls out SWORD)\r\n                    ...get a shave.\r\n\r\n                              RECRUITER\r\n                        (realizes who it is, fights\r\n                         to stay composed)\r\n                    Mr... Wilson?\r\n\r\n                              DEADPOOL\r\n                    Ding-ding-ding! Now... you're about to\r\n                    tell me where I can find your boss. Or\r\n                    I'm gonna make you feel worse. Wait...\r\n\r\n       Deadpool brings the sword closer to the recruiter's face.\r\n       Turns to CAMERA:\r\n\r\n                              DEADPOOL (CONT'D)\r\n                    ...worse than worse.\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                       78.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\nL44/VL44\r\n       CONTINUED:                                                    L44/VL44\r\n\r\n                              RECRUITER\r\n                    And I pride myself on being persuasive.\r\n\r\n                                                           SMASH CUT TO:\r\n\r\nRS44   INT.   SISTER MARGARET'S - DAY - PAST                              RS44\r\n\r\n       WADE stands in the shadows.      WEASEL sits at a table.\r\n\r\n                              WADE\r\n                    No... no way! I'm not making her life as\r\n                    ugly as mine!\r\n\r\n                              WEASEL\r\n                    C'mon, you can't look that bad! It's\r\n                    like that blemish no one notices but you.\r\n\r\n                              WADE\r\n                    Wrong. I'm a monster, inside and out. I\r\n                    belong in a circus, the kind that rolls\r\n                    around Eastern Europe in covered wagons.\r\n\r\n                              WEASEL\r\n                    I can't envision a scenario where Vanessa\r\n                    won't take you ba-\r\n                        (Wade steps into light,\r\n                         takes off his hoodie)\r\n                    -aaaaaccckkk!! Holy shit. You... are...\r\n                    terrifying. You look like an avocado had\r\n                    sex with an older avocado.\r\n\r\n       Wade grabs the bottle of JACK DANIELS from the table,\r\n       GUZZLES.\r\n\r\n                              WEASEL (CONT'D)\r\n                    We might have to move our relationship to\r\n                    text and phone only.\r\n\r\n       Wade ignores Weas, slams down the bottle:\r\n\r\n                              WADE\r\n                    And the only guy who can fix this fugly\r\n                    mug, the asshole who ran that mutant\r\n                    factory, escaped to who knows where.\r\n\r\n                              WEASEL\r\n                    I take back the Vanessa thing.      You have\r\n                    only one option.\r\n\r\n                              WADE\r\n                    Find Francis-Go-Fuck-Himself.\r\n\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                          79.\r\n                     Deadpool    Final Shooting Script    11/16/15\r\nRS44   CONTINUED:                                                           RS44\r\n\r\n                              WEASEL\r\n                        (not listening)\r\n                    Star in low budget horror movies.\r\n                    Seriously, you look like Freddy Krueger\r\n                    face-fucked a topographical map of Utah.\r\n\r\n                              WADE\r\n                        (equally not listening)\r\n                    I'm gonna work my way through his crew...\r\n                    crushing bad guys' skulls, `til one of\r\n                    `em leads me to Francis. Then I'll force\r\n                    him to cure this face. Stomp his bloody\r\n                    guts into a fine vintage. And win\r\n                    Vanessa back.\r\n\r\n                              WEASEL\r\n                    OK. Not exactly the plot of Beauty and\r\n                    the Beast, but cool. Good news, that\r\n                    douche thinks you're dead. Advantage\r\n                    you. He won't think you're coming. Bad\r\n                    news, with a puss like that, you'll be\r\n                    spotted fast.\r\n\r\n                              WADE\r\n                        (derisive)\r\n                    So what do you suggest?     A mask?\r\n\r\n                              WEASEL\r\n                    Not a bad idea! You... are... haunting.\r\n                    Your face is the stuff of nightmares.\r\n\r\n                               WADE\r\n                        (nods)\r\n                    Like a testicle with teeth.\r\n\r\n                              WEASEL\r\n                    How `bout a super-suit? And a nickname!\r\n                    Bitter-Boy. Super-Fist. Captain Never-\r\n                    Die.\r\n                        (deflates at a thought)\r\n\r\n                                WADE\r\n                    What?\r\n\r\n                              WEASEL\r\n                    Nothing. It's just... you know, I just\r\n                    realized, I'm never winning the-\r\n\r\n       Weasel looks over to Wade, sees him staring.          He follows\r\n       Wade's gaze up to the board on the wall.\r\n\r\n                                WADE\r\n                    Deadpool.\r\n\r\n\r\n                                                                     (CONTINUED)\r\n                                                                        80.\r\n                    Deadpool    Final Shooting Script   11/16/15\r\nRS44   CONTINUED: (2)                                                     RS44\r\n\r\n       As Wade says the word, he and Weasel share a look.           EUREKA.\r\n       Wade holds up the BOTTLE.\r\n\r\n                               WEASEL\r\n                   Deadpool.    To you, Mr. Pool.\r\n\r\n       The two CLINK GLASSES.\r\n\r\n44A    INT./EXT.   MONTAGE - DAY/NIGHT - PAST                                 44A\r\n\r\n       A highly pleased DEADPOOL holds up the-soon-to-become-famous\r\n       MASK for the first time, ushering in... a MONTAGE:\r\n\r\n       WADE, at SISTER MARGARET's, receives a YELLOW CARD with a\r\n       Cypress Tree from WEASEL.\r\n\r\n       He turns a LUCHA LIBRE mask INSIDE OUT to reveal the classic\r\n       DEADPOOL MASK we all know and love. Puts it on. Then\r\n       dresses - piece-by-piece - in the RED UNIFORM we've come to\r\n       know and love. And at last, UNSHEATHES A KATANA. The sword\r\n       TWIRLS, SLASHES, LUNGES into shadow. A HANDKERCHIEF WIPES\r\n       BLOOD from the BLADE. The katana gets SHEATHED again.\r\n\r\n       The same yellow card is now RECEIVED and PUNCHED by Weasel.\r\n       Wade is paid in TWENTY DOLLAR BILLS. WHIP CREAM froths onto\r\n       a shot glass. A BLOW-JOB is TOSSED BACK.\r\n\r\n       Meanwhile, VANESSA plays SKEE-BALL wistfully by herself at\r\n       the ARCADE:\r\n\r\n       SKEE-BALLS roll into HOLES. LIGHTS FLASH. TICKETS CHURN\r\n       OUT. VANESSA catches a reflection of someone STARING at her\r\n       from across the lobby. When she spins around, the culprit is\r\n       GONE. Vanessa SHIVERS... but it's a warm shiver, somehow.\r\n\r\n       A HEAP of TICKETS slides across the prize counter. A big\r\n       STUFFED ANIMAL slides into Vanessa's arms. Vanessa tosses it\r\n       into an empty CLOSET inside her and Wade's former APARTMENT.\r\n       Then stares out the SPIDER-WEB CRACK in the window.\r\n\r\n       Back at DEADPOOL's LAIR, Deadpool places various suspicious\r\n       accoutrements on the NORNAS COFFEE TABLE: an 8x11 framed\r\n       photo of VANESSA. A BOTTLE of JERGENS. A BOX of KLEENEX.\r\n       His BELT. His powder-blue CROCS. Deadpool kicks back on the\r\n       FUTON. Smiles under his mask.\r\n\r\n       CUT TO: BLIND AL, building yet another shelving unit,\r\n       looking up with a grossed-out frown: `Am I hearing what I\r\n       think I'm hearing?'\r\n\r\n       Next, DEADPOOL finishes plastering hundreds of ADVENT\r\n       CALENDARS he's purchased onto one WALL of his LAIR.\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                      81.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n44A   CONTINUED:                                                         44A\r\n\r\n      When the wall is covered, he carefully pins the FIRST\r\n      ornament onto the FIRST tree on the FIRST calendar.\r\n\r\n      And at last, his MASK comes OFF and his HEAD hits the PILLOW.\r\n\r\n      Instantly, the montage CRANKS UP its SPEED, with quicker and\r\n      quicker EDITS.\r\n\r\n      The visual totems that have just been introduced begin to FLY\r\n      by... shorthand for the passage of time:\r\n\r\n      Yellow cards are given, received, punched.\r\n\r\n      Blades are unsheathed, sheathed, cleaned.\r\n\r\n      Whip cream sprayed.     Drinks consumed.\r\n\r\n      Skee-balls rolled into holes. Tickets won. Prizes earned.\r\n      Tossed onto a EVER-GROWING PILE in the closet. VANESSA\r\n      staring out her window.\r\n\r\n      Jergens pumped. Kleenexes pulled.       Crocs discarded.      BLIND\r\n      AL's ears plugged.\r\n\r\n      Ornaments are pinned to calendars.      Lords a-leap.      Swans a-\r\n      swim. Maids a-milk.\r\n\r\n      Mask comes off.    Head hits pillow.    Mask pulls on.\r\n\r\n      The images fly by FASTER... FASTER... FASTER.\r\n\r\n      Whip cream. Skee-balls.     Crocs.    Ornaments.   Weasel.\r\n      Deadpool. Vanessa. Al.\r\n\r\n      `I NEED A HERO' plays faster and faster, too - higher and\r\n      higher, like a record on too many RPMs.\r\n\r\n      The effect is rhythmic... hypnotic...\r\n\r\n      ...until finally, the montage REACHES a CRESCENDO.\r\n\r\n      And then BOOM!    Ratchets back to REGULAR SPEED:\r\n\r\n      `CHRISTMAS MORNING' has arrived. All the calendars but one\r\n      are now fully studded with decorations. DEADPOOL plucks out\r\n      one last STAR to pin atop the final TREE.\r\n\r\n      Only it's not a star at all, it's AJAX's MUG SHOT clipped out\r\n      from the old NEWSPAPER.\r\n\r\n      With great satisfaction, Deadpool pins the faded photo to the\r\n      last treetop. The music dies, and Deadpool turns to camera.\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                      82.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n44A   CONTINUED: (2)                                                     44A\r\n\r\n                           DEADPOOL\r\n                 Santa Claus is coming...\r\n\r\n                                                         SMASH CUT TO:\r\n\r\n45    OMITTED                                                             45\r\n\r\n46    INT.   DEADPOOL'S LAIR - DAY - PAST                                 46\r\n\r\n                           DEADPOOL (O.S.)\r\n                 ...to town!\r\n\r\n      DEADPOOL has ONE LEG in his COSTUME and the other LEG still\r\n      stabbing for the other pants-hole.\r\n\r\n                           DEADPOOL (CONT'D)\r\n                 Late-late-late-late-late!\r\n\r\n      He HOPS ACROSS the hall past BLIND AL, not really paying\r\n      attention to her. We're revisiting the moment from earlier\r\n      JUST AFTER she TRIPS on Deadpool's DUFFEL of AMMUNITION,\r\n      PICKS it up, and DRAGS it OFF.\r\n\r\n                           DEADPOOL (CONT'D)\r\n                 Hurry-hurry-hurry-hurry-hurry!\r\n\r\n                           BLIND AL\r\n                 I hope you're doing us the courtesy of\r\n                 pants.\r\n\r\n47    EXT.   CITY STREET - DAY - PAST                                     47\r\n\r\n      DEADPOOL runs out to the street corner and WAVES.\r\n\r\n                             DEADPOOL\r\n                 Taxi!\r\n\r\n      A TAXI - if you've been paying attention, you will recognize\r\n      it - pulls up to the curb. Deadpool opens the rear door. A\r\n      WOMAN steps out, pausing to pay Dopinder.\r\n\r\n                           WOMAN\r\n                 Keep the change.\r\n\r\n      Deadpool frowns. The woman is pulling her money from a\r\n      BERNADETTE PETERS CHANGE PURSE. Deadpool's eyes raise from\r\n      the purse to the woman holding it: BERNADETTE PETERS\r\n      HERSELF! Deadpool doubletakes, then shakes his head (`Nah,\r\n      couldn't be...') and climbs into the cab. Who is behind the\r\n      wheel but...\r\n\r\n                           DOPINDER\r\n                 Where do you want to be going!\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                         83.\r\n                      Deadpool   Final Shooting Script   11/16/15\r\n47      CONTINUED:                                                             47\r\n\r\n                               DEADPOOL\r\n                         (looks to camera)\r\n                     And we all know how this turned out.\r\n                     Cue Benny Hill speed...\r\n\r\n        The action goes into Benny-Hill-like HYPER-SPEED as we relive\r\n        the opening scenes of the movie: DEADPOOL's CAB RIDE. AJAX\r\n        crumpling up his orange jumpsuit and switching places with a\r\n        motorcycle RIDER at the RAFT. The FREEWAY FIGHT with AJAX's\r\n        GOONS. The CONFRONTATION with COLOSSUS. Until at last...\r\n\r\nVRS48   EXT. WAREHOUSE - DAY                                              VRS48\r\n\r\n        Transport TRUCKS idle in the loading dock.\r\n\r\n        A docile SUPER-SLAVE, fitted with a control collar and cuffs,\r\n        steps into a CRATE IDENTICAL to the ONES AJAX DELIVERED TO\r\n        THE WARLORD in ACT ONE. He lies down.\r\n\r\n        ANGEL DUST is overseeing.      She plunges a pistol-grip syringe\r\n        into his neck and fires:\r\n\r\n                               ANGEL DUST\r\n                     For your flight.\r\n\r\n        The man's eyelids flutter shut. Next to him, four identical\r\n        crates hold four unconscious men and women. The workshop\r\n        henchmen hammer on the tops and laboriously load them up into\r\n        the truck.\r\n\r\n        ANGEL picks up one over her shoulder with ease. She turns at\r\n        the sound of a sputtering motorcycle getting closer.\r\n\r\n        Ajax rolls in on one of the battered black bikes from the\r\n        freeway. Smoke curls from its broken tailpipe.\r\n\r\n        He steps off the bike while it's still moving, just letting\r\n        it roll forward and tip to the ground with a clank.\r\n\r\n                               AJAX (O.S.)\r\n                     Quit showing off, Angel.\r\n\r\n        Angel doesn't seem surprised by his dirty and bloodied\r\n        appearance. A raised eyebrow and a disapproving look is all\r\n        she has for her boss.\r\n\r\nRSA48   INT.   WAREHOUSE - DAY                                            RSA48\r\n\r\n        A WAREHOUSE full of SURGICAL EQUIPMENT. OVERHEAD LAMPS.\r\n        FABRIC TENTS. CHROME TABLES, one of which Ajax sits on.\r\n\r\n                               AJAX\r\n                     Wade Fucking Wilson.\r\n\r\n\r\n                                                                    (CONTINUED)\r\n                                                                         84.\r\n                      Deadpool   Final Shooting Script   11/16/15\r\nRSA48   CONTINUED:                                                        RSA48\r\n\r\n        ANGEL DUST stands in front of him, putting stitches into his\r\n        GORY MESS of a SHOULDER WOUND.\r\n\r\n        He doesn't so much as FLINCH.\r\n\r\n                               ANGEL DUST\r\n                     Makes perfect sense.\r\n\r\n                               AJAX\r\n                     I suppose if I looked like him, I'd wear\r\n                     a mask too.\r\n                         (Angel finishes final\r\n                          stitch)\r\n                     Only wish I mended the same.\r\n\r\n        Ajax pops off the table.     Swings his arm around, testing his\r\n        shoulder.\r\n\r\n                               AJAX (CONT'D)\r\n                     Not to worry. We'll put him out of our\r\n                     misery. On our terms.\r\n\r\n                               ANGEL DUST\r\n                     And if he heals?\r\n\r\n                               AJAX\r\n                     He can't - if there's nothing left of him\r\n                     to heal. And then we go back to business\r\n                     as usual.\r\n\r\n        Ajax's hand is a blur as he plucks the MATCHSTICK from\r\n        Angel's mouth.\r\n\r\n                               AJAX (CONT'D)\r\n                     What say we leave the matches at home?\r\n\r\n49      INT.   DEADPOOL'S LIVING ROOM - NIGHT - PRESENT                      49\r\n\r\n        ...the PAST reaches the PRESENT. REGULAR SPEED AGAIN.\r\n        DEADPOOL is sitting on his futon, Crocs on, staring at\r\n        camera.\r\n\r\n                               DEADPOOL\r\n                     There. All caught up.\r\n                         (shifts weight, moans, lies\r\n                          back on futon)\r\n\r\n                               BLIND AL (O.S.)\r\n                     Tylenol P.M.?\r\n\r\n        BLIND AL shuffles over from the kitchen with a cup of tea and\r\n        a bottle of Tylenol. She eases down onto the futon next to\r\n        Deadpool.\r\n\r\n\r\n                                                                    (CONTINUED)\r\n                                                                      85.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n49   CONTINUED:                                                             49\r\n\r\n                            DEADPOOL\r\n                  You can stick that where you stuck the\r\n                  Bactine! I found my stash of wisdom-\r\n                  tooth Percocet in the Storjorm, and I'm\r\n                  orbiting Saturn. But I appreciate the\r\n                  gesture.\r\n\r\n     Deadpool lays his head on Blind Al's shoulder and gently rubs\r\n     her face with his KID HAND.\r\n\r\n                            BLIND AL\r\n                  Am I crazy, or is your hand really small?\r\n\r\n                            DEADPOOL\r\n                  The size of a KFC spork.\r\n\r\n                            BLIND AL\r\n                  Eesh. I get why you're so pissy. But\r\n                  your mood's never gonna brighten `til you\r\n                  find this woman you love and tell her how\r\n                  you feel!\r\n\r\n                            DEADPOOL\r\n                  What do I keep saying, Mrs. Magoo? She\r\n                  wouldn't have me! If you could see me,\r\n                  you'd understand.\r\n\r\n                            BLIND AL\r\n                  Love is blind, Wade.\r\n\r\n                            DEADPOOL\r\n                  No, you're blind.\r\n\r\n     The ROOMBA sucks up THREE SCREWS next to an IVAR shelving\r\n     unit.\r\n\r\n                            BLIND AL\r\n                  What was that?\r\n\r\n                            DEADPOOL\r\n                  A clue why our Ivar shelving unit's about\r\n                  to fall the fuck apart.\r\n\r\n                            BLIND AL\r\n                  So you're just gonna lie there and\r\n                  whimper?\r\n\r\n                            DEADPOOL\r\n                  Just clocking time `til this arm plows\r\n                  through puberty. I've got a new\r\n                  Christmas Day.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                 86.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n49     CONTINUED: (2)                                                  49\r\n\r\n       Deadpool throws his feet, CROCS and all, up on the coffee\r\n       table.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                  Now, ya may want to leave the room.\r\n                      (beat)\r\n                  I bet it feels huge in this hand.\r\n\r\nRS50   INT.   SISTER MARGARET'S - NIGHT                            RS50\r\n\r\n       WEASEL is on the house phone.    The bar is BUSTLING.\r\n\r\n                            WEASEL\r\n                  Wade, we got a problem.    And by we I mean\r\n                  you.\r\n\r\nVB51   EXT.   NO. 5 ORANGE - NIGHT                                 VB51\r\n\r\n       DEADPOOL and WEASEL walk hastily, purposefully into the eye\r\n       of the storm. Deadpool is a HOT MESS.\r\n\r\n                            DEADPOOL\r\n                  I'm about to lose what's left of my shit.\r\n                  Is there a word for half-afraid, half-\r\n                  furious?\r\n\r\n                             WEASEL\r\n                  Afurious? Wait, is it Monday?! They\r\n                  have an amazing Matzah Ball Soup Monday.\r\n                      (beat)\r\n                  Never mind. Have you figured what you're\r\n                  gonna tell her?\r\n\r\n                            DEADPOOL\r\n                      (thinks)\r\n                  Fuck.\r\n\r\n                            WEASEL\r\n                  It's a start.\r\n\r\n51A    INT.   `NO. 5 ORANGE' STRIP CLUB - NIGHT                        51A\r\n\r\n       Lights flash. Music pumps. From across the room we see WADE\r\n       and WEASEL enter. Weasel jokes with the DOORMAN while Wade\r\n       scans the crowd, searching for Vanessa.\r\n\r\n       EMCEE STAN LEE, sweatsuit, gold chains, Beats headphones,\r\n       lords from a glass cubicle:\r\n\r\n                            STAN LEE\r\n                  Coming onto the stage, give it up for...\r\n                  Chastity!\r\n                                                                    87.\r\n                 Deadpool   Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n52   INT.   `NO. 5 ORANGE' STRIP CLUB - NIGHT                             52\r\n\r\n                          WEASEL\r\n                Or as I like to call her, Irony!\r\n\r\n     DEADPOOL navigates through a TIGHTLY-PACKED CROWD toward the\r\n     MAIN STAGE, accompanied by WEASEL.\r\n\r\n                          DEADPOOL\r\n                We gotta find her fast.    Before fuck-ass.\r\n\r\n                          WEASEL\r\n                How do you even know she's here?\r\n\r\n                          DEADPOOL\r\n                I come for the French Onion Soup. How do\r\n                you think? I'm constantly stalking that\r\n                fox.\r\n\r\n     Deadpool STOPS in his tracks, STARING.\r\n\r\n                          DEADPOOL (V.O.)\r\n                Every time I see her is like the first\r\n                time.\r\n\r\n     REVERSE ANGLE to reveal what Deadpool is looking at: the\r\n     gorgeous backside of a COCKTAIL WAITRESS in a skimpy dress.\r\n     Back to Deadpool:\r\n\r\n                          DEADPOOL (V.O.)\r\n                Even from this angle. Especially from\r\n                this angle.\r\n\r\n     Hypnotized, Deadpool puts one foot in front of the other,\r\n     approaching the waitress.\r\n\r\n     Suddenly, the WAITRESS TURNS to reveal her face:       VANESSA.\r\n\r\n     Deadpool immediately CHICKENS OUT, puts his head down, turns\r\n     away from her into the press of MEN around one of the stages.\r\n\r\n     Vanessa catches the vaguest glimpse, but before she can get a\r\n     better look, Deadpool is swallowed up by the crowd.\r\n\r\n     She gets that warm shiver again... the one that says she's\r\n     feeling an old presence.\r\n\r\n     She stares after Deadpool.    It couldn't possibly be.\r\n\r\n     Deadpool pushes past the men, almost in a panic, beating a\r\n     HASTY RETREAT toward WEASEL at the back of the room.\r\n\r\n\r\n\r\n\r\n                                                               (CONTINUED)\r\n                                                                      88.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n52   CONTINUED:                                                             52\r\n\r\n                            DEADPOOL (V.O.)\r\n                  Shittiest moment numero tres.\r\n\r\n     Deadpool walks past Weasel, fleeing into the men's room...\r\n\r\n53   INT.   MEN'S REST ROOM - CONTINUOUS                                    53\r\n\r\n     ...and SPLASH!     Washes his face at the SINK.\r\n\r\n                            DEADPOOL\r\n                  Lezzdothis. Before I re-reconsider.\r\n                  Maximum effort.\r\n\r\n     A hand comes into frame offering a paper towel. It belongs\r\n     to a WASHROOM ATTENDANT in a tuxedo vest. Deadpool uses the\r\n     towel to wipe his face and finishes with the attendant's\r\n     sleeve.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                  Sorry.\r\n                      (tries to dry attendant's\r\n                       sleeve with paper towel)\r\n                  I get very uncomfortable around you guys.\r\n                      (takes mint off counter,\r\n                       then condom off counter,\r\n                       then sees tip jar)\r\n                  Crisp high five?\r\n\r\n54   INT.   `NO. 5 ORANGE' STRIP CLUB - NIGHT                               54\r\n\r\n     VANESSA sets down a tray of empty glasses.        Her scum-bag of a\r\n     MANAGER gives her a heads-up:\r\n\r\n                            MANAGER\r\n                  Someone out back asking for you. Said\r\n                  somethin' about an old boyfriend?\r\n\r\n55   EXT.   `NO. 5 ORANGE' STRIP CLUB - ALLEY - NIGHT                       55\r\n\r\n     VANESSA exits the club into an ALLEY, one of Wade's old\r\n     jackets thrown over her shoulders. One sickly street lamp\r\n     casts some light. The rest is obscured in SHADOW. Vanessa\r\n     spies the shape of a MAN hiding in the shadows.\r\n\r\n                            VANESSA\r\n                  I knew it was you.\r\n\r\n     Vanessa is seized by memories.      She peers into the dark,\r\n     heart pounding.\r\n\r\n                            VANESSA (CONT'D)\r\n                  With the weird, curvy edges.\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                      89.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n55   CONTINUED:                                                             55\r\n\r\n     Then steps forward slowly, nervously.        Overcome with emotion.\r\n\r\n                            VANESSA (CONT'D)\r\n                      (barely audible)\r\n                  Like a jigsaw puzzle.\r\n\r\n     No one answers.     Vanessa gets a bad feeling and starts to\r\n     back up.\r\n\r\n     The man steps confidently into the light.        Not WADE...\r\n\r\n     ...but AJAX. Vanessa spins around and runs straight into\r\n     Angel Dust, who step out of the shadows.\r\n\r\n     Vanessa make a grab for her purse, contents spilling out onto\r\n     the grimy street, but her hand comes up with a TASER. She\r\n     jams it into the flesh of Angel Dusts shoulder.\r\n\r\n     Angel Dust just smiles as electricity arcs and sizzles.           Then\r\n     she grabs Vanessa's hand and twists it away.\r\n\r\n     Vanessa THRASHES like a polecat. But Angel Dust is brutally\r\n     strong. She clamps her hand around Vanessa's jaw and\r\n     SQUEEZES, dangling her in the air by her FACE.\r\n\r\n                            AJAX\r\n                  You have Wade Wilson to thank for this.\r\n\r\n     Vanessa's eyes widen in shock and surprise.\r\n\r\n                            AJAX (CONT'D)\r\n                  `The good Lord sends the fishing...\r\n\r\n     Vanessa screams mutely into Angel Dust's palm.\r\n\r\n                            AJAX (CONT'D)\r\n                  ...but you must dig the bait.'\r\n\r\n56   INT.   `NO. 5 ORANGE' STRIP CLUB - HALLWAY - NIGHT                     56\r\n\r\n     WADE pushes through the crowd to find WEASEL sitting in GYNO\r\n     ROW at the edge of the stage. He's in the middle of slipping\r\n     a bill into a dancer's garter.\r\n\r\n                            WEASEL\r\n                  Manager said she went that way.\r\n                      (thumbs towards the back)\r\n                  Good luck, Tiger!\r\n\r\n     DEADPOOL moves quickly down a HALL, turns a corner, and\r\n     REACHES for the knob of the door to the alley. His eyes\r\n     WIDEN as he remembers something IMPORTANT.\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                        90.\r\n                     Deadpool   Final Shooting Script   11/16/15\r\n56     CONTINUED:                                                             56\r\n\r\n       Deadpool reaches back and pulls up his hood to hide his\r\n       scarred FACE.\r\n\r\n       Deadpool girds himself, then OPENS the door to spy...\r\n\r\n57     EXT. `NO. 5 ORANGE' STRIP CLUB - ALLEY - NIGHT                         57\r\n\r\n       ...the empty alley. Deadpool spies a woman's CLUTCH lying\r\n       alone in a pool of light, contents strewn about. He reaches\r\n       down and picks up...\r\n\r\n       ...his old BERNADETTE PETERS CHANGE PURSE.\r\n\r\n                              DEADPOOL\r\n                    Mother-fucker best be wearing his brown\r\n                    pants.\r\n\r\n58     INT.   SCRAPYARD / ELEVATOR - PRE-DAWN                                 58\r\n\r\n       AJAX and Angel Dust stand at either side of a bound and\r\n       gagged VANESSA. They are inside the metal cage of an\r\n       INDUSTRIAL ELEVATOR, going UP.\r\n\r\n                              DEADPOOL (V.O.)\r\n                    And... numero dos.\r\n\r\n       A bare bulb casts harsh light as they rise past a dark mass\r\n       of twisted metal. Ajax looks almost bored, hums to himself\r\n       tunelessly.\r\n\r\nV59    EXT.   FLIGHT DECK - DAY                                               V59\r\n\r\n       AJAX explains his plan to VANESSA:\r\n\r\n                              AJAX\r\n                    That's what I thought, but he keeps on\r\n                    coming back. Like a Bad Jesus. But\r\n                    despite all Wade's powers, I still hold\r\n                    the advantage: He feels. Too strongly\r\n                    for his own good. Let's see how he\r\n                    fights with your head on the block.\r\n\r\nVA60   EXT.   X-MANSION - DAY                                             VA60\r\n\r\n       A sign reads `PROFESSOR XAVIER'S SCHOOL FOR GIFTED\r\n       YOUNGSTERS.'\r\n\r\n       The sign is on the perfectly manicured front lawn of the\r\n       gorgeous Gothic X-MANSION.\r\n\r\n       Who is standing outside the front door of the mansion but\r\n       DEADPOOL, in full regalia. Deadpool raises his knuckles to\r\n       KNOCK, but is suddenly STARTLED...\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                    91.\r\n                     Deadpool    Final Shooting Script   11/16/15\r\nVA60   CONTINUED:                                                     VA60\r\n\r\n       ...by the door SWINGING OPEN to reveal an annoyed NEGASONIC\r\n       TEENAGE WARHEAD. She's wearing BEATS HEADPHONES.\r\n\r\n                              DEADPOOL\r\n                    Ripley from `Alien 3'!\r\n\r\n                                NTW\r\n                    Deadfool.\r\n\r\n                              DEADPOOL\r\n                    It's like you knew I was about to knock!\r\n                        (shivers, `creepy')\r\n                    Is that big steel dildo home?\r\n\r\n                              NTW\r\n                    You guys going for a bite?      Early bird\r\n                    special?\r\n\r\n                              DEADPOOL\r\n                    Like there's something wrong with eating\r\n                    before sundown. Or saving money. But\r\n                    no. It's about me saving my girl from a\r\n                    bad guy, the one you two helped me lose.\r\n                    You do fight bad guys?\r\n                        (off NTW's stare)\r\n                    No time for hard stares, are you gonna\r\n                    fetch big-shiny-balls or not? Tell him I\r\n                    have an offer he can't refuse!\r\n\r\n       NTW turns, disappears into the house.\r\n\r\n                                NTW\r\n                    Colossus!\r\n\r\n       From off camera, we hear loudly, excitedly, from the second\r\n       floor:\r\n\r\n                              COLOSSUS (O.S.)\r\n                    Is that you, Wade?! I knew you'd see\r\n                    error of ways!\r\n\r\n                              DEADPOOL\r\n                    Yep, that's me, seeing the error of my\r\n                    ways! I just need an itty bitty favor in\r\n                    return!\r\n                        (turns to camera, whispers)\r\n                    Fool him five times? Shame on him.\r\n                                                                      92.\r\n                 Deadpool    Final Shooting Script    11/16/15\r\n\r\n\r\n\r\n60   INT.   DEADPOOL'S LAIR - DAWN                                           60\r\n\r\n     WEASEL and DEADPOOL are going through IKEA drawers, pulling\r\n     out every GUN and GRENADE on God's green earth and stuffing\r\n     them into a couple of Deadpool's `I *HEART* HELLO KITTY'\r\n     DUFFEL BAGS.\r\n\r\n     This is Deadpool's ARSENAL, big enough for a small army.           In\r\n     go the twin DESERT EAGLES. Then Weasel dumps an entire\r\n     ARMFUL of AMMO BOXES into the duffel.\r\n\r\n                          WEASEL\r\n                That's about... three thousand shells.\r\n\r\n     A BEAT.   Deadpool LOOKS AT CAMERA menacingly:\r\n\r\n                          DEADPOOL\r\n                And we've all seen what I can do with\r\n                twelve.\r\n\r\n     BLIND AL enters, holding a STEYR AUG RIFLE.\r\n\r\n                          BLIND AL\r\n                I was gonna spend tonight assembling the\r\n                Borgsjo, but this is holding my interest.\r\n\r\n     Both Deadpool and Weasel duck, afraid she might shoot them.\r\n\r\n                          DEADPOOL\r\n                Careful, Ronnie Milsap, we're down-range!\r\n                And we decided on the Orrberg, not the\r\n                Borgsjo.\r\n\r\n                            BLIND AL\r\n                Shit.\r\n\r\n                            WEASEL\r\n                She cool?\r\n\r\n                          DEADPOOL\r\n                The coolest. Plus, she could never pick\r\n                you out of a line-up.\r\n\r\n     BEEP-BEEP. DEADPOOL looks at his phone.         The screen says,\r\n     \"Vanessa's Phone\"\r\n\r\n                          DEADPOOL (CONT'D)\r\n                It's Francis. He wants me to come to\r\n                him. And he calls me a piece of-\r\n                    (squints, can't read)\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                       93.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n60   CONTINUED:                                                              60\r\n\r\n                            WEASEL\r\n                      (points)\r\n                  That's the shit emoji. A turd with a\r\n                  smile, see? How did Google ever approve\r\n                  that?\r\n\r\n     Blind Al grabs a Nerf N-Strike Elite Strong-arm Blaster from\r\n     a drawer (it feels like a gun!) and goes to put it in the\r\n     duffel. Deadpool almost stops her, then shrugs - maybe it\r\n     will come in useful...\r\n\r\n                            BLIND AL\r\n                  That's every piece in the house.\r\n\r\n                              DEADPOOL\r\n                  Uh-uh-uh.\r\n\r\n     Blind Al sighs - busted - she puts her leg up on a chair and\r\n     pulls a tiny Saturday Night Special from an ankle holster...\r\n     and is about to hand it over when instead, she turns, and...\r\n\r\n     ...BOOM... shoots the ROOMBA, laying waste to it.\r\n\r\n                             BLIND AL\r\n                  It was him or me.\r\n                      (beat)\r\n                  I did hit it, right?\r\n\r\n                            DEADPOOL\r\n                  Please. It's been years since you've hit\r\n                  anything. See what I did there?\r\n\r\n                              BLIND AL\r\n                  Fuck you.\r\n\r\n     Deadpool takes the tiny gun and shoves it in the small of his\r\n     back. Then follows Weasel out the door. Then quickly turns\r\n     back.\r\n\r\n                            DEADPOOL\r\n                      (to Al)\r\n                  In case I never see you again, I love you\r\n                  very much... and there's a hundred-ten\r\n                  million dollars buried somewhere in the\r\n                  apartment. Good luck. Watch your face.\r\n\r\n     Deadpool slams the door behind him.\r\n\r\n61   INT./EXT.    TAXI - MORNING                                             61\r\n\r\n     A TAXI drives across the city, its BACK BUMPER scraping the\r\n     ground, throwing off SPARKS.\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                       94.\r\n                   Deadpool   Final Shooting Script    11/16/15\r\n61   CONTINUED:                                                              61\r\n\r\n     In the PASSENGER seat: DEADPOOL, his DUFFEL at his feet.\r\n     Behind the wheel: DOPINDER.\r\n\r\n                            DEADPOOL\r\n                  Any luck winning Gita back?\r\n\r\n                            DOPINDER\r\n                  I tried to hold on tight, Mr. Pool. But\r\n                  Bandhu is more craftier - and handsomer -\r\n                  than me.\r\n\r\n                            DEADPOOL\r\n                      (shrugs)\r\n                  It's all relative.\r\n\r\n     Deadpool quickly LIFTS his MASK, revealing his SCARS to\r\n     Dopinder.\r\n\r\n     STARTLED, Dopinder FLINCHES and SIDESWIPES a PARKED CAR.\r\n\r\n                            COLOSSUS (O.S.)\r\n                  Stop the car. I must leave a note.\r\n\r\n     Cut to the BACK SEAT to find COLOSSUS CRAMMED in, KNEES to\r\n     CHEST. He's drinking a CAPPUCCINO in a Dunkin' Donuts cup.\r\n\r\n                            DEADPOOL\r\n                  Oh, please. I'll bet the halls of your\r\n                  high school were very well monitored.\r\n\r\n                            DOPINDER\r\n                  I cannot be stopping.\r\n\r\n                            NEGASONIC TEENAGE WARHEAD (O.S.)\r\n                  Wait, I'm getting a premonition.\r\n\r\n     To Colossus's left is NEGASONIC TEENAGE WARHEAD. She's\r\n     holding two fingers to her temple again, a la Professor X.\r\n     Then nods toward Dopinder.\r\n\r\n                            NEGASONIC TEENAGE WARHEAD (CONT'D)\r\n                  He's uninsured.\r\n\r\n                            DOPINDER\r\n                  She indeed has ESPN!    I am quite\r\n                  uninsuranced.\r\n\r\n                            DEADPOOL\r\n                  You mean ESP. But come on!      I coulda-\r\n\r\n                            NEGASONIC TEENAGE WARHEAD\r\n                  -called that yourself?\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                       95.\r\n                 Deadpool      Final Shooting Script   11/16/15\r\n61   CONTINUED: (2)                                                          61\r\n\r\n                              DEADPOOL\r\n                Gaaaahhhh!\r\n\r\n     Deadpool literally BOUNCES in frustration.\r\n\r\n                          DOPINDER\r\n                Who brought this twinkly man?\r\n\r\n                          DEADPOOL\r\n                Twinkly, but deadly. My big Russki\r\n                friend doesn't like the idea of a whole\r\n                new army of mutant mutton-heads. And I\r\n                told him if he did me this solid, I'd\r\n                consider joining his boy band.\r\n\r\n                          COLOSSUS\r\n                It's not a boy band.\r\n\r\n                          DEADPOOL\r\n                Sure it's not.\r\n\r\n     The cab drives over a SMALL DIP and BOTTOMS OUT.         CLANG.\r\n     BANG. A muffled yelp comes from the TRUNK:\r\n\r\n                              VOICE (O.S.)\r\n                Ow!   Help.     Me.\r\n\r\n     BEAT.   Dopinder reaches to turn up the RADIO.\r\n\r\n                           DEADPOOL\r\n                Uh.   Dopinder. What was that?\r\n\r\n                              DOPINDER\r\n                Oh, that?      That was Bandhu.\r\n\r\n                              COLOSSUS\r\n                Bandwho?\r\n\r\n                          DOPINDER\r\n                My romantic rival, Bandhu. He's tied up\r\n                in the trunk. I'm doing as you said,\r\n                D.P. I plan to gut him like a tandoori\r\n                fish. Then dump his lifeless corpse on\r\n                Gita's doorstep like a cat with a dead\r\n                bird. Mom and Dad will be over the moon.\r\n\r\n     Deadpool looks back at Colossus and shrugs.\r\n\r\n                          DEADPOOL\r\n                Something must've gotten lost in the\r\n                translation.\r\n                    (gives surreptitious thumbs\r\n                     up to Dopinder)\r\n                          (MORE)\r\n\r\n                                                                  (CONTINUED)\r\n                                                                        96.\r\n                 Deadpool     Final Shooting Script     11/16/15\r\n61   CONTINUED: (3)                                                           61\r\n                          DEADPOOL (CONT'D)\r\n                Seriously. This is no way to win Gita's\r\n                heart. Return Bandhu home safe and\r\n                gentle-like. And then woo Gita with your\r\n                boyish charm...\r\n\r\n                          DOPINDER\r\n                Fine, fine. Safe and gentle-like.          Here\r\n                we are...\r\n\r\n     Dopinder pulls over and hits the meter.          Then sighs.\r\n\r\n                           DOPINDER (CONT'D)\r\n                I too am clairvoyance. I presume a crisp\r\n                high five?\r\n\r\n                            DEADPOOL\r\n                For you?    Ten.\r\n\r\n                          DOPINDER\r\n                Knock em dead, Pool Boy.\r\n\r\n     Deadpool and Dopinder SLAP BOTH HANDS.\r\n\r\n                          DEADPOOL\r\n                Time to make the chimichangas.\r\n\r\n62   EXT.   SCRAPYARD - DAY                                                   62\r\n\r\n     We hear the first bold notes of DMX's `X GON GIVE IT TO YA.'\r\n\r\n     DEADPOOL, COLOSSUS, and NEGASONIC TEENAGE WARHEAD walk in SLO-\r\n     MO across the scrapyard toward the COMBAT CARRIER.\r\n\r\n                          DEADPOOL (V.O.)\r\n                Not often a dude ruins your face.\r\n                Destroys your living. Grabs your future\r\n                baby mama. Personally sees to 8 of your\r\n                10 shittiest life moments. And plans to\r\n                lather-rinse-repeat on a buncha new\r\n                chumps. Let's just say, it's beginning\r\n                to look a lot like Christmas...\r\n\r\n     This is as cool as Deadpool has ever looked. Muscles\r\n     sprouting muscles. Katanas gleaming. Then, at the height of\r\n     his coolness, Deadpool STOPS, sensing something amiss.\r\n\r\n     DMX cuts out. REGULAR SPEED RESUMES as Deadpool looks down\r\n     to spy his FLY DOWN. He ZIPS it UP, embarrassed.\r\n\r\n                          DEADPOOL\r\n                    (to camera)\r\n                It happens. A'ight, cue up DMX again.\r\n\r\n\r\n\r\n                                                                   (CONTINUED)\r\n                                                                       97.\r\n                   Deadpool    Final Shooting Script   11/16/15\r\n62   CONTINUED:                                                              62\r\n\r\n                             NEGASONIC TEENAGE WARHEAD\r\n                  Wait!   Where's your duffel bag?\r\n\r\n                             DEADPOOL\r\n                      (freezes, it's missing)\r\n                  Gahhhhhhh!\r\n                      (pulls out a phone, dials)\r\n\r\n63   INT.   TAXI CAB - DAY                                                   63\r\n\r\n     DOPINDER drives, head bobbing to a Bhangra Beat, HELLO KITTY\r\n     DUFFEL still sitting in the passenger WHEEL WELL.\r\n\r\n     On cue, Dopinder's CELL PHONE RINGS. Dopinder reaches for\r\n     it, then fumbles it away. The phone falls to the floorboard.\r\n\r\n     Dopinder looks ahead, sees the approaching traffic light is\r\n     green, ducks down to make a grab, but when he returns his\r\n     eyes to the road, the light is now red.\r\n\r\n     Dopinder slams on his brakes. SCREECH! He manages to avoid\r\n     the car in front. BAM! The taxi is REAR-ENDED, its TRUNK\r\n     SMASHED like an accordion. We hear a HOLLER from inside.\r\n\r\n                              DOPINDER\r\n                  Bandhu?\r\n\r\n64   EXT.   SCRAPYARD - DAY                                                  64\r\n\r\n                            DEADPOOL\r\n                      (hears crash)\r\n                  Goddamnit! Never mind. Nothing that\r\n                  can't be fixed by two swords and...\r\n                      (cracks neck)\r\n                  ...maximum effort.\r\n                      (points to imaginary D.J.)\r\n                  Gimme a beat!\r\n\r\n     DMX KICKS IN AGAIN.      Deadpool strides forward in SLO-MO.\r\n\r\n     As they near the carrier a dozen armed and armored MERCS\r\n     suddenly rise from behind the piles of scrap metal before\r\n     them. Assault weapons raised, ready to fire.\r\n\r\n     The trio stops, Colossus stepping in front of NTW, sheltering\r\n     her behind his armored body.\r\n\r\n                            ANGEL DUST (O.S.)\r\n                  No one fires!\r\n\r\n     Our heroes crane their necks to spy ANGEL DUST standing on\r\n     the edge of the deck above.\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                      98.\r\n                   Deadpool   Final Shooting Script   11/16/15\r\n64   CONTINUED:                                                             64\r\n\r\n                            ANGEL DUST (CONT'D)\r\n                  They're mine.\r\n\r\n     Angel Dust LEAPS outward, falls like a stone, HITS the ground\r\n     with a THUNDEROUS impact. The dust clears. She strides over\r\n     the broken ground, smiling, READY for a scrap.\r\n\r\n                             DEADPOOL\r\n                  Long term, that's hard on your knees.\r\n                      (ALT:)\r\n                  Super-hero landing! Clearly you're far\r\n                  too much dude for me. Which is why...\r\n                      (points)\r\n                  ...I brought him.\r\n\r\n     COLOSSUS steps forward into Angel Dust's path holding a pair\r\n     of Adamantium HANDCUFFS just like he used on Deadpool.\r\n\r\n                            COLOSSUS\r\n                  I'd prefer not to hit a woman. So\r\n                  please place your hands behind your-\r\n\r\n     BOOM! Without stopping Angel Dust throws a RIGHT HOOK from\r\n     her HEELS. The punch CONNECTS with COLOSSUS's JAW. He goes\r\n     flying, SCRAPING SPARKS ACROSS CONCRETE.\r\n\r\n                            DEADPOOL\r\n                      (sighs, points)\r\n                  I also brought her.\r\n\r\n     NEGASONIC TEENAGE WARHEAD steps forward on Deadpool's right.\r\n\r\n     NTW chews her gum. Once. Twice. Then runs TOWARD Angel\r\n     Dust, LOWERS her SHOULDER, and EXPLODES UP toward her with a\r\n     WICKEDLY THUNDEROUS BANG of ENERGY and SOUND.\r\n\r\n     Yes, Negasonic Teenage Warhead is exactly that - a living,\r\n     breathing WARHEAD - like her own personal CANNONBALL.\r\n\r\n     It's Angel Dust's turn to go flying backward, smashing into -\r\n     and completely trashing - a heavy metal shipping container.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                  I feel sorry for the guy who tries to\r\n                  pressure her into prom sex.\r\n\r\n     Angel Dust regains her feet, smiles dangerously at the Mercs.\r\n\r\n                            ANGEL DUST\r\n                  Never mind. Fire.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     99.\r\n                 Deadpool    Final Shooting Script   11/16/15\r\n64   CONTINUED: (2)                                                        64\r\n\r\n     Deadpool is already moving as the Mercs OPEN FIRE, full-auto.\r\n     Deadpool grabs the still-woozy NTW and runs to the nearby\r\n     cover of metal scrap, keeping between her and the gunfire.\r\n\r\n     Colossus, now back on his feet, strides purposely forward.\r\n     Bullets ping harmlessly off his metal skin. Angel Dust\r\n     charges forward, snarling.\r\n\r\n                          DEADPOOL\r\n                    (shouts)\r\n                Finish fucking her the fuck up.\r\n\r\n     Colossus stops, annoyed.\r\n\r\n                            COLOSSUS\r\n                Language.    Please.\r\n\r\n     Then Angel Dust SMASHES into him. The two collide with earth-\r\n     shaking force. The sheer power of Angel Dust's momentum\r\n     slams them backwards into-and through-a huge pile of scrap.\r\n\r\n65   INT.   FLIGHT DECK - DAY                                              65\r\n\r\n     AJAX pulls VANESSA forward to the edge of the carrier deck,\r\n     forces her gaze downward toward the WAR ZONE below.\r\n\r\n                          AJAX\r\n                How does it feel? Ex-boyfriend abandons\r\n                you, becomes a sanity-challenged killer\r\n                mutant in tights...\r\n\r\n                          VANESSA\r\n                Says the sanity-challenged killer mutant\r\n                in parachute pants. P.S. I've never\r\n                played the role of damsel in distress.\r\n\r\n                            AJAX\r\n                `Til now.\r\n\r\n     Ajax yanks Vanessa away from the edge again.\r\n\r\n66   EXT. SCRAPYARD - CONTINUOUS                                           66\r\n\r\n     Every MERC is pouring fire towards Deadpool's position. He\r\n     hunkers down with NTW, her hands clamped tight over her ears.\r\n\r\n     Deadpool unzips a zipper, reaches into his suit at the\r\n     crotch, YANKS. Grimaces. We hear fabric tear. He pulls his\r\n     hand out, waves a pair of torn TIGHTIE-WHITIES up from behind\r\n     cover.\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                      100.\r\n                  Deadpool   Final Shooting Script     11/16/15\r\n66   CONTINUED:                                                              66\r\n\r\n                            DEADPOOL\r\n                  Hey, fellas, whoa! Hold on!        Don'tcha\r\n                  wanna hear my terms?!\r\n\r\n     The mercs spot the white `flag.' Fire slackens from full-\r\n     auto to a few pot-shots. Finally, Deadpool pops up.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                  You guys only work for that shit-spackled\r\n                  Muppet fart! So I'm gonna give y'all the\r\n                  chance to lay down your firearms in\r\n                  return for preferential - bordering on\r\n                  gentle - possibly even lover-like\r\n                  treatment.\r\n\r\n     The Mercs ignore him, opening fire AGAIN with a vengeance.\r\n     Deadpool ducks and drops his tightie-whities.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                  Fine. Commando.\r\n                      (to NTW)\r\n                  Stay down, kid. Unless your power's\r\n                  stopping bullets.\r\n\r\n     Deadpool SURGES forward, dives from cover, rolls.            He comes\r\n     up boot knife out, arm whipping forward-\r\n\r\n     The nearest merc's head snaps back as the knife buries itself\r\n     to the hilt in his eye socket.\r\n\r\n     Deadpool sprints forward, zig-zagging, leaping, spinning as\r\n     he closes the distance to the mercs. He's moving too fast\r\n     for their guns to track. Bullets chew up the ground behind.\r\n\r\n     Deadpool reaches the first pile of twisted metal, slides\r\n     under, comes up behind two mercs taking shelter there. The\r\n     first man turns, gun barrel swinging `round. Deadpool ducks,\r\n     sweeps his legs, grabs his gun as he goes down.\r\n\r\n     Deadpool rolls over him, firing BACKWARD into the man's face\r\n     while spinning up to smash his boot into the face of the\r\n     second merc. He slides past, firing a burst backward into\r\n     the merc's neck as he falls.\r\n\r\n     Seconds later he's leaping OVER the heads of the next pair of\r\n     mercs. They turn to fire up at him - too slow. He fires\r\n     short, controlled bursts down into their upturned faces.\r\n     BOOM! BOOM! BOOM!\r\n\r\n     Deadpool lands, tosses the empty smoking gun.          Then slowly,\r\n     lovingly, unsheathes his Katanas.\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                     101.\r\n                Deadpool      Final Shooting Script   11/16/15\r\n66   CONTINUED: (2)                                                         66\r\n\r\n     Deadpool is running forward now, weaving his way through the\r\n     wreckage. Hunting.\r\n\r\n67   EXT.   SCRAPYARD - DAY                                                 67\r\n\r\n     COLOSSUS and ANGEL DUST engage in a BATTLE ROYALE. Colossus\r\n     grabs Angel Dust by the SCRUFF of her NECK and HURLS her into\r\n     an ABANDONED AIRCRAFT. CRUNCH.\r\n\r\n     Angel Dust is on one knee, shaken, disheveled, one BREAST\r\n     hanging out of her torn flak jacket.\r\n\r\n     The prim Colossus covers his eyes.\r\n\r\n                          COLOSSUS\r\n                Uh... you seem to have, um...\r\n\r\n     Angel Dust smiles, tucks the wayward boob back in, then\r\n     BLASTS Colossus with a FLYING KNEE that generates SHOCK WAVES\r\n     so powerful, Colossus' CHROME actually RIPPLES.\r\n\r\n     Colossus growls and CHARGES AGAIN.\r\n\r\n                                                                  CUT TO:\r\n\r\n     DEADPOOL spins around a corner as another pair of MERCS move\r\n     forward, guns raised.\r\n\r\n     Deadpool dives under their fire, guts them in blurred flash\r\n     of steel. THRUST! SLICE! IMPALE! COMPLETE MAYHEM.\r\n\r\n     Another trio of mercs rush around the corner, opening fire as\r\n     they see their comrades fall. DEADPOOL runs toward them,\r\n     flips and dodges like a whirling dervish, bringing GUARDS\r\n     down in surgical, artistic fashion, as if where he's killing\r\n     them means as much to him as how.\r\n\r\n     Two men converge    on Deadpool. He JUMPS. Mid-air, he flips\r\n     his TWO KATANAS,    GRIPS them upside-down like ICE PICKS, and\r\n     STABS down in an    arc to either side, SKEWERING two men\r\n     through the TOPS    of their HELMETS.\r\n\r\n     A final merc comes around the corner and Deadpool spins,\r\n     slices the strap of his gun, kicks the man in the chest,\r\n     knocking him flat on his back and sitting on his face.\r\n\r\n                          DEADPOOL\r\n                Tea-bag!\r\n                    (notices man under him)\r\n                Bob?!\r\n\r\n                            BOB\r\n                Wade?!\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                     102.\r\n                  Deadpool   Final Shooting Script   11/16/15\r\n67   CONTINUED:                                                             67\r\n\r\n                            DEADPOOL\r\n                  It's been since... Jacksonville!\r\n\r\n                            BOB\r\n                  TGIFridays.\r\n\r\n                            DEADPOOL\r\n                  Liked the Loaded Potato Skins.     Didn't\r\n                  like you.\r\n\r\n                             BOB\r\n                  Ditto.\r\n\r\n     Deadpool rises and pulls Bob to his feet. Bob tries to draw\r\n     a pistol but DP slaps it out of his hand, sends it skittering\r\n     away.\r\n\r\n                            DEADPOOL\r\n                  Bob, y'mind taking a half-step right?\r\n                  No, your right. Never mind-\r\n\r\n     Deadpool KNOCKS Bob OUT with the sword's GRIP, then NUDGES\r\n     him sideways gently as he falls.\r\n\r\n     At last, SILENCE. Deadpool steps forward.           Then looks up\r\n     toward the carrier above, waves.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                  Yoo-hoo!\r\n\r\n     From above, AJAX peers down sees that Deadpool has killed his\r\n     henchmen in such precise positions that their fallen bodies\r\n     spell out:\r\n\r\n     FRANCIS.\r\n\r\n     Deadpool moves forward.       LIMPING.   CHARRED.   TATTERED.   But\r\n     unbowed.\r\n\r\n                            AJAX\r\n                  That never gets old.    But neither will\r\n                  you.\r\n\r\n     Right on cue...\r\n\r\n     ...three more Mercs appear to either side of Ajax, armed with\r\n     HEAVY MACHINE GUNS - much NASTIER than any we've yet seen.\r\n\r\n     BOOM-BOOM-BOOM-BOOM! The guards OPEN FIRE, and a BARRAGE of\r\n     bullets rain down on the scrapyard, chewing up the landscape\r\n     around Deadpool.\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                   103.\r\n               Deadpool    Final Shooting Script   11/16/15\r\n67   CONTINUED: (2)                                                       67\r\n\r\n     Deadpool SPRINTS back toward cover, weaving, leaping, zig-\r\n     zagging to avoid being hit. He dives behind some wreckage as\r\n     more gunfire pings off the metal.\r\n\r\n     DEADPOOL, pokes his head up, drawing a withering barrage of\r\n     fire from the mercs above.\r\n\r\n                           NEGASONIC TEENAGE WARHEAD (O.S.)\r\n               Hey!\r\n\r\n     ANGLE ON: NEGASONIC TEENAGE WARHEAD, also taking cover,\r\n     crouched under a broken PLANE WING.\r\n\r\n                           NEGASONIC TEENAGE WARHEAD (CONT'D)\r\n               Climb on.\r\n\r\n     Deadpool nods, then sprints toward her, springs high, flips,\r\n     and lands on his back, spread eagled on the wing.\r\n\r\n                         DEADPOOL\r\n               Light the candle...\r\n\r\n     NTW nonchalantly SPITS out her GUM, crouches, and... EXPLODES\r\n     UPWARD. The wing LAUNCHES up in a shallow PARABOLA, Deadpool\r\n     CLINGING for dear life on TOP.\r\n\r\n68   EXT. FLIGHT DECK - CONTINUOUS                                         68\r\n\r\n     Four MERCS continue firing down as the wing soars up.\r\n\r\n     The WING SMASHES into them.    All four go FLYING.       Two end up\r\n     DEAD under the wing.\r\n\r\n     AJAX is thrown backward.\r\n\r\n     One MERC lands, stunned, close to the edge.     A LONG BEAT.\r\n\r\n     AJAX rises to his feet.\r\n\r\n     Then DEADPOOL pulls himself UP over the edge of the carrier\r\n     and ROLLS onto the deck. He looks like he's been through a\r\n     meat grinder - limping, scorched, bloody.\r\n\r\n     Deadpool staggers to his feet.    The last injured MERC lamely\r\n     tries to GRAB his ANKLE.\r\n\r\n                         DEADPOOL\r\n               Your plan to trip me to death?      Has\r\n               failed.\r\n\r\n     Deadpool nonchalantly STABS him through the back of the neck\r\n     like a butterfly on a display, then turns to face Ajax.\r\n\r\n\r\n\r\n                                                              (CONTINUED)\r\n                                                                      104.\r\n                  Deadpool    Final Shooting Script   11/16/15\r\n68   CONTINUED:                                                              68\r\n\r\n     Twenty meters away, AJAX leans casually against... what else?\r\n     THE PUNCH-BOWL. VANESSA is STRAPPED inside, lid open.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                  You were right, babe.\r\n                      (wipes blood off sword)\r\n                  Red is my color.\r\n\r\n                              VANESSA\r\n                  Wade?\r\n\r\n                            AJAX\r\n                      (taps glass)\r\n                  What better way to climb back in your\r\n                  head...\r\n\r\n                            DEADPOOL\r\n                  You never left.\r\n\r\n                            VANESSA\r\n                      (to Deadpool)\r\n                  But you did, asshole.\r\n\r\n                            AJAX\r\n                  You two have a lot to work out. Take a\r\n                  deep breath. Wait. Wrong choice...\r\n\r\n     Ajax quickly CLOSES the LID and hits a SWITCH.         Vanessa\r\n     starts taking short, desperate GASPS.\r\n\r\n                            AJAX (CONT'D)\r\n                  ...of words.\r\n\r\n                            DEADPOOL\r\n                  I hope they blocked pain to your every\r\n                  last nerve. `Cause I'm'a go looking.\r\n\r\n     Ajax squats down and picks up TWO STEEL-HAFTED FIRE-FIGHTING\r\n     AXES, each with an ULTRA-SHARP BLADE on one side of its head\r\n     and an EQUALLY SHARP CLAW on the other.\r\n\r\n     Deadpool raises a KATANA and HURLS it NOT at Ajax, but the\r\n     PUNCH-BOWL. The blade PENETRATES the PLEXI and tears into\r\n     the RESTRAINT holding Vanessa's RIGHT WRIST, partly FRAYING\r\n     it. AIR seeps through the CRACK. Vanessa catches a tiny\r\n     BREATH. She TUGS on the frayed RESTRAINT.\r\n\r\n                            AJAX\r\n                  I hear you grow back parts. When I get\r\n                  done... parts will have to grow back you.\r\n\r\n                              DEADPOOL\r\n                  Good one.\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                  105.\r\n                Deadpool   Final Shooting Script   11/16/15\r\n68   CONTINUED: (2)                                                      68\r\n\r\n     A big BOOMING sound from below and then the deck of the\r\n     carrier shakes as if from a mild earthquake. Ajax and\r\n     Deadpool look at each other. Shrug.\r\n\r\n                           DEADPOOL (CONT'D)\r\n                Let's dance.\r\n                    (beat)\r\n                And by dance I mean try to kill each\r\n                other.\r\n\r\n69   EXT.   SCRAPYARD - CONTINUOUS                                       69\r\n\r\n     BAM!   Below, COLOSSUS delivers a HAYMAKER from hell itself.\r\n\r\n     Angel Dust FALLS, then RISES, RIPS OFF the WING of a PLANE,\r\n     and BLASTS Colossus with it... first like a BASEBALL BAT,\r\n     then like a GOLF CLUB, then like a COUNTY FAIR MALLETS you\r\n     use to try to ring a bell. CLANG!\r\n\r\n     A battered NTW RACES toward Angel Dust. Angel Dust swings\r\n     the wing, but NTW BASEBALL SLIDES UNDER it and EXPLODES up\r\n     into her chin.\r\n\r\n     Angel Dust is lifted off her feet into the side of the\r\n     carrier, BUCKLING some of its supports. NTW rolls aside.\r\n\r\n70   EXT. FLIGHT DECK - CONTINUOUS                                       70\r\n\r\n     And now, we get what we've been long been waiting for:\r\n\r\n     THE FINAL CLOSE QUARTERS BATTLE between DEADPOOL AND AJAX.\r\n     AXES vs. KATANA, TEN STORIES UP...\r\n\r\n     AJAX TAKES a MIGHTY, ROARING SWING with an AXE.\r\n\r\n                           DEADPOOL\r\n                Yowww!\r\n\r\n     STEEL SINGS as AXE and KATANA meet again and again.        THRUSTS.\r\n     PARRIES. SPARKS FLY!\r\n\r\n     THUNK! Deadpool's BLADE passes through Ajax's THIGH and pins\r\n     him to a piece of wreckage.\r\n\r\n     CRACK!   Ajax tags Deadpool's head with the FLAT of an axe.\r\n\r\n     SNAP! Ajax BREAKS the sword's blade with an AXE, not feeling\r\n     anything as he slides his leg off the sword.\r\n\r\n     GASP! VANESSA grits her teeth, pulls against the restraints.\r\n     The thick nylon begins to tear as she saws it against the\r\n     katana blade.\r\n\r\n\r\n\r\n                                                              (CONTINUED)\r\n                                                                    106.\r\n                  Deadpool   Final Shooting Script   11/16/15\r\n70   CONTINUED:                                                            70\r\n\r\n     CLANG! AJAX wields both axes in a red blur of painted steel.\r\n     Deadpool snatches up a piece of rusted RAILING from the deck,\r\n     barely blocks Ajax's windmilling swings.\r\n\r\n     Finally, Ajax smashes the length of rusty metal from\r\n     Deadpool's hands with one axe, while the sharp CLAW END of\r\n     the other buries itself in Deadpool's FOREARM. Deadpool\r\n     hollers.\r\n\r\n     Deadpool's red suit has torn away, and the SKULL of his\r\n     TATTOO bleeds from a HOLE in its FOREHEAD.\r\n\r\n     Deadpool GRITS his TEETH and YANKS the AXE from Ajax's grasp.\r\n     A spinning KICK sends the second axe flying after the first.\r\n\r\n     Now they're completely unarmed.\r\n\r\n                             AJAX\r\n                  Fine.   Fists.\r\n\r\n                            DEADPOOL\r\n                  Sounds like your last Saturday night.\r\n                      (smiles)\r\n                  The sense of humor survived.\r\n\r\n     AJAX and DEADPOOL TRADE VICIOUS PUNCHES.        It's HAGLER vs.\r\n     HEARNS! BOOM! BOOM! BOOM!\r\n\r\n     Inspired, VANESSA strains against the torn nylon. RRRRIPPP!\r\n     Her right wrist TEARS FREE. She uses her freed hand to start\r\n     unlatching her other restraints.\r\n\r\n     DEADPOOL throws short, blinding PUNCHES - rat-a-tat-tat -\r\n     into AJAX's jaw.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                  Since you can't feel it?\r\n                      (holds up an INCISOR)\r\n                  I just knocked out your tooth.\r\n\r\n     AJAX snarls, drives a SHOULDER into Deadpool, then MOUNTS him\r\n     and BLUDGEONS his face with HAMMER-LIKE FISTS.\r\n\r\n     DEADPOOL is starting to LOSE CONSCIOUSNESS when he turns his\r\n     head to one side and spies the PUNCH-BOWL.\r\n\r\n     We RACK FOCUS to VANESSA locking eyes with him from inside.\r\n     Hers is an inspired... and INSPIRING look of LOVE.\r\n\r\n     We hear a REPRISE of JOHN DENVER's `I WANT TO LIVE.'\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                     107.\r\n                Deadpool      Final Shooting Script   11/16/15\r\n70   CONTINUED: (2)                                                         70\r\n\r\n     VANESSA pushes against the sealed door of the punchbowl with\r\n     all her might. With a squeal of metal the latch breaks, the\r\n     twisted metal flying off the lid as it slams open.\r\n\r\n     Vanessa grabs the KATANA, jerks it free with another mighty\r\n     effort. Then slides down the containers toward AJAX. With a\r\n     fierce scream, she PLUNGES the blade into his KIDNEY. The\r\n     blade punches through the other side but Ajax feels no pain,\r\n     YANKS out the katana, and THROWS Vanessa aside violently.\r\n\r\n     But it's all the opportunity Deadpool needs. He SURGES with\r\n     energy and throws an THUNDEROUS UPPERCUT, BLASTING Ajax off.\r\n\r\n                          JOHN DENVER\r\n                I want to liiiiiive!\r\n\r\n71   EXT.   SCRAPYARD - DAY                                                 71\r\n\r\n     Below: WHOOSH, BAM! Angel Dust ducks an exhausted\r\n     Colossus's punch and KICKS him THROUGH another STEEL SUPPORT.\r\n     Colossus COLLAPSES. The carrier GROANS.\r\n\r\n     Angel Dust moves in for the KILL.        Only out of nowhere...\r\n\r\n     ...NTW strikes her in the chops and EXPLODES, sending the\r\n     larger woman SMASHING into concrete with UNPRECEDENTED FORCE.\r\n\r\n     Now it's Angel Dust's turn to be broken, smoking, seemingly\r\n     down for the count. NTW approaches carefully to make certain\r\n     it's all over...\r\n\r\n     ...but Angel Dust shoots out an arm and GRABS her... DRAGS\r\n     her in CLOSE... makes to SMASH her head like a walnut.\r\n\r\n                          ANGEL DUST\r\n                C'mere, ya little bitch.\r\n\r\n     NTW fights back valiantly, PUNCHING fast and hard with\r\n     FLURRIES of ENERGY. Angel Dust is scorched and battered by\r\n     the blows, but her adrenaline and rage SURGE. She grabs NTW\r\n     around the neck, plants her into the ground...\r\n\r\n     ...and begins to CHOKE the life out of her.        NTW flails,\r\n     cannot break Angel Dust's grip...\r\n\r\n     ...but marshals her last remaining energy to live up to her\r\n     name...\r\n\r\n     ...and EXPLODE like an ALMIGHTY WARHEAD.         BOOM!\r\n\r\n     CUT WIDE to a GARGANTUAN EXPLOSION.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                    108.\r\n                  Deadpool   Final Shooting Script   11/16/15\r\n71   CONTINUED:                                                            71\r\n\r\n     The ship SHAKES VIOLENTLY, then starts to LIST at a DANGEROUS\r\n     ANGLE.\r\n\r\n72   EXT.   FLIGHT DECK / CONTINUOUS                                       72\r\n\r\n     DEADPOOL and AJAX are trading BLOWS again when the DECK SWAYS\r\n     as if hit by a 9.0 EARTHQUAKE. Then with a thunderous,\r\n     shuddering, groaning of metal the whole carrier begins to\r\n     tilt.\r\n\r\n     Loose wreckage begins to slide and tumble past. A shipping\r\n     container barrels towards them and Deadpool kicks Ajax\r\n     backwards, right into its path. SLAM! It plows into him and\r\n     carries him with it as it disappears over the side.\r\n\r\n     Deadpool scrambles and claws up the tilting floor and grabs\r\n     hold of Vanessa.\r\n\r\n     Deadpool looks around frantically...\r\n\r\n     ...and then spies the PUNCH-BOWL, sliding toward them.\r\n\r\n     Deadpool grabs the side as it slides past and throws VANESSA\r\n     inside and SHUTS the LID for protection...\r\n\r\n     They slam into the twisted metal railings at the bottom of\r\n     the deck and hang there. Deadpool swings by one hand and\r\n     stares at the scrapyard below. Huge chunks of metal slide\r\n     and smash past to tumble to the ground a hundred feet below.\r\n\r\n     Vanessa hangs onto Deadpool for dear life, her eyes locked on\r\n     his...\r\n\r\n                            VANESSA\r\n                  If we survive this.   I'm gonna kill you.\r\n\r\n                            DEADPOOL\r\n                  We have so much to catch up on.\r\n\r\n     ...as the CARRIER topples in an AVALANCHE of STEEL!\r\n\r\n     An EPIC collapse of SHRIEKING METAL. Flying glass. Nearly\r\n     seismic booms. A mushroom CLOUD of thick, black destruction.\r\n\r\n                                                       FADE TO BLACK.\r\n\r\n73   EXT.   SCRAPYARD - RUBBLE PILE - DAY                                  73\r\n\r\n     Black. A crack of light appears, dust sifting down through\r\n     the beam.\r\n\r\n\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                      109.\r\n                  Deadpool     Final Shooting Script   11/16/15\r\n73   CONTINUED:                                                              73\r\n\r\n     More light, more dust and debris pattering down onto-some\r\n     kind of scratched glass in front of the lens. Finally a hole\r\n     of bright sky fills the frame.\r\n\r\n                                                                   CUT TO:\r\n\r\n     COLOSSUS vigorously TOSSING aside MASSIVE SLABS of STEEL as\r\n     he digs through the wreckage, uncovering the PUNCH-BOWL,\r\n     damaged, but intact. The LID CREAKS OPEN - pushed by\r\n     Vanessa's TREMBLING HAND.\r\n\r\n     Vanessa climbs out dazed, dusty, coughing.\r\n\r\n                               COLOSSUS\r\n                  You're OK.     Take it slow.\r\n\r\n     Elsewhere in the rubble pile DEADPOOL's HEAD POPS UP from\r\n     some DEBRIS, again, like the Caddyshack gopher.\r\n\r\n                               DEADPOOL\r\n                  I'm good.\r\n\r\n     Deadpool is just staggering to his feet when AJAX emerges\r\n     from under another BEAM and TACKLES him.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                  ¡Caramba!\r\n                      (subtitled, in YELLOW:)\r\n                  For heaven's sake!\r\n\r\n     The impact sends them both flying, rolling, over the edge of\r\n     a metal container. They fall locked together, punching and\r\n     grappling. They bounce/slide down the pile of rubble.\r\n\r\n     Deadpool gets the better of the grappling and lands on AJAX's\r\n     CHEST. He goes to TOWN with vicious FOREARMS and ELBOWS.\r\n\r\n                             DEADPOOL (CONT'D)\r\n                  Wham!   Wham! Wham!\r\n\r\n     BAM! BAM! BAM. Bam. You can feel Deadpool's adrenalized\r\n     catharsis. Ajax tries to block-CRACK! Deadpool shatters his\r\n     elbow. Ajax other fist swings round, tags Deadpool, but he\r\n     catches it, wraps it tight-SNAP!\r\n\r\n     Ajax finally goes limp, both arms bent in horribly wrong\r\n     directions.\r\n\r\n                            DEADPOOL (CONT'D)\r\n                      (thrilled/exhausted)\r\n                  There are no words.\r\n\r\n\r\n\r\n\r\n                                                                  (CONTINUED)\r\n                                                                     110.\r\n               Deadpool       Final Shooting Script   11/16/15\r\n73   CONTINUED: (2)                                                         73\r\n\r\n     Deadpool pulls out BLIND AL's SATURDAY NIGHT SPECIAL and AIMS\r\n     it right BETWEEN AJAX's EYES.\r\n\r\n                          DEADPOOL (CONT'D)\r\n               Me and you are headed to fix this face.\r\n               Or else...\r\n\r\n     Deadpool places a piece of paper onto Ajax's chest.\r\n\r\n     Ajax shakes off the cobwebs and examines the paper; it's\r\n     Deadpool's CRAYON DRAWING of Ajax getting his brains blown\r\n     out. Ajax actually LAUGHS.\r\n\r\n                         AJAX\r\n               Sorry. It's just. All this time, you\r\n               bought that I have the cure? I'm\r\n               flattered. But do I really look like the\r\n               scientist type? You want the guy behind\r\n               the guy. His name's Dr. Killebrew. And\r\n               he's long gone. Who knows where.\r\n\r\n                              DEADPOOL\r\n               Um.    What?\r\n\r\n                         AJAX\r\n               You heard me.\r\n\r\n                         DEADPOOL\r\n               You mean to say, after five long years,\r\n               I've been chasing the wrong monkey?\r\n\r\n                         AJAX\r\n               Sounds even stupider when you say it.\r\n\r\n                          DEADPOOL\r\n               Like the kind of stupid who admits he\r\n               can't do the one thing I'm keeping him\r\n               alive for?\r\n                   (chambers a round)\r\n               Any last words? Good. I got one:\r\n                   (pulls back the hammer)\r\n               Francis.\r\n\r\n                              COLOSSUS (O.S.)\r\n               Wade!\r\n\r\n     Deadpool turns to see Colossus, hands on hips, looking extra\r\n     HEROIC. NEGASONIC TEENAGE WARHEAD is STANDING at his SIDE.\r\n\r\n                         COLOSSUS (CONT'D)\r\n               Four or five moments.\r\n\r\n\r\n\r\n\r\n                                                                 (CONTINUED)\r\n                                                                    111.\r\n                Deadpool     Final Shooting Script   11/16/15\r\n73   CONTINUED: (3)                                                        73\r\n\r\n                             DEADPOOL\r\n                I'm sorry?\r\n\r\n                          COLOSSUS\r\n                Four or five moments.      That's all it\r\n                takes...\r\n\r\n                             DEADPOOL\r\n                To...?\r\n\r\n                          COLOSSUS\r\n                Be a hero. Everyone thinks it's a full\r\n                time job. Wake up a hero. Brush your\r\n                teeth a hero. Go to work a hero. Not\r\n                true. Over a lifetime, there are only\r\n                four or five moments that really matter.\r\n                Moments when you're offered a choice. To\r\n                make a sacrifice. Conquer a flaw. Save\r\n                a friend. Spare an enemy.\r\n\r\n     Deadpool continues to hold the pistol to Ajax's head.\r\n\r\n                          COLOSSUS (CONT'D)\r\n                In those moments, everything else falls\r\n                away. The way the world sees us. The\r\n                way we see oursel-\r\n\r\n     BOOM!   OFF-SCREEN, A GUNSHOT.\r\n\r\n                          COLOSSUS (CONT'D)\r\n                    (dry-heaves again)\r\n                Huuugglh! Why!\r\n\r\n     REVERSE ANGLE to Deadpool, who's just shot AJAX in the head\r\n     with Blind Al's SATURDAY NIGHT SPECIAL.\r\n\r\n                          DEADPOOL\r\n                You were droning on!\r\n                    (shrugs)\r\n                I may be stuck looking like pepperoni\r\n                flatbread, but at least we've heard the\r\n                last of him. If wearing super-hero\r\n                tights means sparing psychopaths, maybe I\r\n                wasn't meant to wear `em. Not everyone\r\n                monitors a hall like you.\r\n\r\n                          COLOSSUS\r\n                Just promise-\r\n\r\n                          DEADPOOL\r\n                I'll be on the lookout for the next four\r\n                moments.\r\n                          (MORE)\r\n\r\n\r\n                                                                (CONTINUED)\r\n                                                                 112.\r\n               Deadpool   Final Shooting Script   11/16/15\r\n73   CONTINUED: (4)                                                     73\r\n                         DEADPOOL (CONT'D)\r\n                   (peers between Colossus and\r\n                    NTW)\r\n               Now if you'll excuse me. I'm just a\r\n               boy... about to stand in front of a\r\n               girl... and tell her- what the fuck am I\r\n               gonna tell her?!\r\n\r\n     CUT TO: Deadpool's P.O.V. BETWEEN Colossus and NTW of\r\n     VANESSA, who's now walking quickly TOWARD him. She brushes\r\n     between the two X-men and without saying a word, GRABS the\r\n     fallen PISTOL and PUMPS TWO EXTRA BULLETS into Ajax's corpse.\r\n\r\n                          VANESSA\r\n                   (bang)\r\n               Gratuitous.\r\n                   (bang)\r\n               Worth it.\r\n\r\n                         DEADPOOL\r\n                   (to camera)\r\n               Anyone else turned on?\r\n                   (to Vanessa)\r\n               That's what I love about y-\r\n\r\n     Vanessa promptly PUNCHES Deadpool in the face.\r\n\r\n                         DEADPOOL (CONT'D)\r\n               I totally deserved that!\r\n                   (gets punched again)\r\n               That too!\r\n                   (wards off knee)\r\n               Maybe not the nethers.\r\n\r\n     Vanessa restrains herself, then TURNS HER BACK, overcome.\r\n\r\n                         VANESSA\r\n               Start talking.\r\n\r\n                          DEADPOOL\r\n               I'm so sorry. For leaving. And taking\r\n               so long to cowboy up. It's been a rough\r\n               few years.\r\n\r\n                         VANESSA\r\n                   (snorts, dismissive)\r\n               Rough?\r\n\r\n                         DEADPOOL\r\n               I live in a crack house. With a family\r\n               of twelve. At night, we spoon for\r\n               warmth. Everyone fights for Noelle.\r\n               She's the fattest.\r\n                         (MORE)\r\n\r\n\r\n                                                             (CONTINUED)\r\n                                                                 113.\r\n               Deadpool   Final Shooting Script   11/16/15\r\n73   CONTINUED: (5)                                                     73\r\n                         DEADPOOL (CONT'D)\r\n               There's nothing we don't share.    Floor\r\n               space. Dental floss. Condoms.\r\n\r\n                         VANESSA\r\n               So you live in a house!\r\n                   (turns to face him)\r\n\r\n                         DEADPOOL\r\n               I woulda found you before now. But the\r\n               guy behind this mask isn't the same guy\r\n               you remember.\r\n\r\n                         VANESSA\r\n               You mean this mask?\r\n\r\n     Deadpool FLINCHES but doesn't STOP Vanessa from slowly,\r\n     gently taking OFF his mask, revealing underneath... HUGH\r\n     JACKMAN's `SEXIEST MAN ALIVE' People MAGAZINE COVER. Blood\r\n     at the pierce points. Mouth/eyes cut out to make a `mask.'\r\n\r\n                         DEADPOOL\r\n               And this one. In case the other fell\r\n               off.\r\n\r\n                         VANESSA\r\n               You mean like this?\r\n\r\n     Vanessa starts PULLING OUT staples.\r\n\r\n                          DEADPOOL\r\n               Oo. Ah.    Quicker - like a Bandaid!    Owww-\r\n               di 5000.\r\n\r\n     One last staple remains.   Vanessa hesitates.\r\n\r\n                          DEADPOOL (CONT'D)\r\n               Sure?\r\n\r\n                         VANESSA\r\n               Sure I'm sure.\r\n\r\n     She PULLS it out. The photo FALLS, revealing DEADPOOL's\r\n     SCARS. And two vulnerable, misty eyes. A beat.\r\n\r\n                          VANESSA (CONT'D)\r\n               Ew.\r\n\r\n                         DEADPOOL\r\n                   (devastated)\r\n               I understand.\r\n\r\n\r\n\r\n\r\n                                                             (CONTINUED)\r\n                                                                   114.\r\n               Deadpool   Final Shooting Script     11/16/15\r\n73   CONTINUED: (6)                                                       73\r\n\r\n                          VANESSA\r\n                   (smiles)\r\n               Kidding! Get over yourself!        I'd hit\r\n               that shit.\r\n\r\n                         DEADPOOL\r\n               You already did.\r\n                   (rubs chin)\r\n               Twice. Seriously?\r\n\r\n                          VANESSA\r\n                   (nods)\r\n               After a brief adjustment period and one\r\n               or two drinks.\r\n                   (smiles)\r\n               It's a face... I'd be happy to sit on.\r\n\r\n     Vanessa hooks Deadpool's PINKIE with HERS, PULLS him in to\r\n     kiss him.\r\n\r\n                         DEADPOOL\r\n               I'm also not the same under these pants.\r\n                   (whispers)\r\n               Super-penis.\r\n\r\n     Deadpool and Vanessa are ABOUT to kiss when...\r\n\r\n                         NEGASONIC TEENAGE WARHEAD (O.S.)\r\n               1975 called.\r\n\r\n     Deadpool realizes COLOSSUS and NTW are still standing\r\n     WATCHING.\r\n\r\n                         NEGASONIC TEENAGE WARHEAD (CONT'D)\r\n               It wants its peep show back.\r\n\r\n                         DEADPOOL\r\n               Gah! What the hell are you two still\r\n               doing here?!\r\n                   (to Colossus)\r\n               You, go clean some chalk-board erasers,\r\n               or be a... really Big Brother, or teach\r\n               fat kids to eat lettuce.\r\n                   (to NTW)\r\n               And you, Chicken Noodle. Well...\r\n                   (freezes)\r\n               I feel something stupid coming on.\r\n                   (bounces)\r\n               Gaaaaaaahhhhhh!\r\n\r\n\r\n\r\n\r\n                                                               (CONTINUED)\r\n                                                              115.\r\n               Deadpool    Final Shooting Script   11/16/15\r\n73   CONTINUED: (7)                                                  73\r\n\r\n                         NEGASONIC TEENAGE WARHEAD\r\n               It's alright.\r\n                   (beat, tiniest of smiles)\r\n               You're cool.\r\n\r\n                         DEADPOOL\r\n                   (STARES, elated)\r\n               I am?! Omigod. That. Was. Not. Mean!\r\n               Seriously, guys, it was a pleasure. For\r\n               a second there, we felt like... like...\r\n                   (we expect `family')\r\n               ...five mini lion robots forming a large\r\n               super robot.\r\n\r\n                         NEGASONIC TEENAGE WARHEAD\r\n               There's the stupid.\r\n\r\n                         DEADPOOL\r\n               Now, I meant it, both of you, fire up the\r\n               Blackbird and shoo! Scram! Vamoose!\r\n               Skedaddle! Don't make me keep thinking\r\n               of these!\r\n\r\n     They smile, shake their heads, and walk off.\r\n\r\n     Deadpool turns back to Vanessa.\r\n\r\n                         DEADPOOL (CONT'D)\r\n               Where were we, darlin'? Oh, riiight.\r\n               The best part.\r\n\r\n     Deadpool KISSES Vanessa. The little kiss become a BIGGER\r\n     ONE. Then... fading up from nowhere, with a slightly tinny\r\n     quality... we hear WHAM!'s `CARELESS WHISPER.' Vanessa pulls\r\n     back, puzzled. Deadpool raises his ANDROID. On the cracked\r\n     and dirty screen, George's and Andrew's FACES beam from\r\n     Wham!'s `MAKE IT BIG' album cover.\r\n\r\n                           DEADPOOL (CONT'D)\r\n               `Wham!'    As promised.\r\n\r\n     The two share the longest kiss yet.\r\n\r\n                         DEADPOOL (V.O.)\r\n               See, life can smell like Daffodil\r\n               Daydream. So if you're sitting out there\r\n               in your own personal Punch-Bowl. Ms.\r\n               Mama June on your tongue. Find someone\r\n               to hold... and someone to hold on to you.\r\n               Life's next little train wreck...\r\n                                                              116.\r\n                Deadpool   Final Shooting Script   11/16/15\r\n\r\n\r\n\r\n74   INT.   NEW WORKSHOP - DAY                                       74\r\n\r\n                          DEADPOOL (V.O.)\r\n                ..will be so much easier if you do.\r\n\r\n     We find ourselves in a newer, spiffier version of the\r\n     WORKSHOP, where a LAB TECHNICIAN is strapping down a new\r\n     sickly VOLUNTEER/VICTIM.\r\n\r\n                          DEADPOOL (V.O.)\r\n                Which brings us to shittiest moment\r\n                number 1! The guy behind the guy, Dr.\r\n                Killebrew, off scot-free.\r\n\r\n     A SILHOUETTED FIGURE approaches the bed of the nervous\r\n     volunteer, who smiles weakly.\r\n\r\n                          VOLUNTEER\r\n                Can you make me better?\r\n\r\n     REVERSE ANGLE to reveal whom he's talking to: the PUDGY,\r\n     KINDLY-LOOKING DOCTOR WHO STROKED WADE'S HEAD IN THE\r\n     WORKSHOP. He smiles, pats the volunteer's wrist.\r\n\r\n                          DR. KILLEBREW\r\n                Better than better.\r\n\r\n                          DEADPOOL (V.O.)\r\n                But let's look on the bright side.\r\n                    (sniffs)\r\n                You smell what I smell? I mean besides\r\n                stale popcorn and my post-fight man-funk?\r\n\r\n     Dr. Killebrew holds up a syringe with a glint in his eye.\r\n\r\n                          DEADPOOL (V.O.)\r\n                Sequel. Maybe even one of those ensemble\r\n                team movies...\r\n\r\n75   EXT.   SCRAPYARD - RUBBLE PILE - DAY                            75\r\n\r\n     DEADPOOL and Vanessa MAKE OUT LIKE CRAZY, LONG AND HARD. We\r\n     slowly PULL BACK until they look SMALL against the toppled\r\n     hulk of the COMBAT CARRIER.\r\n\r\n                          DEADPOOL (V.O.)\r\n                So, `til next time, this is your friendly\r\n                neighborhood pool guy saying... I'm never\r\n                gonna dance again... the way I danced\r\n                with you.\r\n\r\n     WHAM BELTS OUT `CARELESS WHISPER' as we ROLL CREDITS.\r\n                                                                 117.\r\n                 Deadpool   Final Shooting Script   11/16/15\r\n\r\n\r\n\r\nV76   INT.   SUBURBAN HOME - DAY - POST CREDIT SEQUENCE                 V76\r\n\r\n      A hallway of a suburban home.    DEADPOOL enters in a maroon\r\n      and gray striped robe.\r\n\r\n                           DEADPOOL\r\n                     (short version)\r\n                 You're still here? It's over! Go home.\r\n                 Wait... you expected a tease for Deadpool\r\n                 2?! Sorry, we're low on dough. But if\r\n                 you can keep a secret, I can tell you\r\n                 who's gonna be in it. Cable! Someone\r\n                 suggested Mel Gibson for the role, buuuut-\r\n                 I was thinking Liam Neeson. Only\r\n                 problem, Liam likes to get paid. And\r\n                 more for Liam means less for me. Maybe\r\n                 we'll crowdfund the shit. Just you and\r\n                 me, kids. Shalom!\r\n\r\n                           DEADPOOL (CONT'D)\r\n                     (long version)\r\n                 You're still here? It's over! Go home.\r\n                 Wait... you expected a tease for Deadpool\r\n                 2?! Maybe a little Samuel L. Jackson?\r\n                 Sorry, that budget went to Weasel's\r\n                 Ketamine habit. But if you can keep a\r\n                 secret, I can tell you who's gonna be in\r\n                 it. Cable! You're allowed to show your\r\n                 pleasure. I'd love Liam Neeson for the\r\n                 role, but Liam likes to get paid. And\r\n                 more for Liam means less for me. So we'd\r\n                 best crowdfund the shit. Depending on\r\n                 your level of giving, you could receive a\r\n                 Colossus-brand desktop steel-ball\r\n                 clacker, a Dwayne `The Rock' Johnson real\r\n                 doll, or four minutes alone in a room\r\n                 with Charlie Sheen.   Donate now! And\r\n                 shalom!\r\n\r\n                                                         SMASH CUT TO\r\n                                                               BLACK:\r\n\r\n                           DEADPOOL (O.S.) (CONT'D)\r\n                     (a la Ferris)\r\n                 Boom, boom, chicka chickah...\r\n\n\n\n\nDeadpool\nWriters :   Rhett Reese  Paul Wernick\nGenres :   Action  Adventure  Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:43.662949"}