{"title": "Deception", "film_link": "/Movie Scripts/Deception Script.html", "script_link": "/scripts/Deception.html", "info_raw": "\n\nDeception Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (2.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Mark Bomback  Patrick Marber\nGenres  Crime  Drama  Mystery  Romance  Thriller\nScript Date : September 2005\nMovie Release Date : April 2008\n\nRead \"Deception\" Script\n\n\n", "script": "\n\n\n\n                                         DECEPTION \n\n\n\n                                         Written by\n\n                               Mark Bomback & Patrick Marber\n\n\n\n\n\n\n\n                                                  September 15th,  2005\n\n          \n\n          I .\n\n          EXTREME CLOSE ON A CELL PHONE\n          resting face up on a black surface. A beat of silence           -- is\n          broken by its abrupt RING... RING... RING... Move in tighter\n          on the phone's LCD DISPLAY. A number comes up:                  555-3827\n          RING... RING... RING... A hand enters frame. We follow it to\n          a pad and pen we now discover to the left of the phone. The\n          hand picks up the pen, brings it to the pad, on which we find\n          a list of handwritten numbers. At least fifty. To this series\n          is now added 555-3827. RING... RING... RING...\n\n          FADE TO BLACK.\n\n          FADE IN:\n\n          EXT. MANHATTAN - LATE NIGHT\n\n          We pan across the city skyline, a beautiful sight -- over\n          which we hear the CLACKING of computer keys.\n\n          INT. A CONFERENCE ROOM (RUTHERFORD STERN)                       - LATE NIGHT\n\n          A wall of glass offers a letter-boxed view of a sleek\n          conference room. Amber sconces illuminate an enormous table,\n          empty save for & YOUNG MAN at the far end - a lonely figure\n          hunched over a laptop.\n          Steadily tighten on JONATHAN MESSER (late 20s), trim build\n          not entirely at ease in a suit. Likeable features suggest a\n          gentle, intelligent demeanor.\n          Grids of numbers from the laptop screen reflect off his\n          glasses. Tired, he rubs his eyes, continues typing.\n\n          INT. RUTHERFORD STERN LAW OFFICES - LATE NIGHT\n\n          Briefcase in hand, Jonathan walks a vacant corridor of empty\n          cubicles. In a few offices lights are still on; the figures\n          of YOUNG MEN AND WOMEN at work are blurred like photos out of\n          focus behind the frosted-glass of closed doors.\n\n          INT. TIMES SQUARE SUBWAY STATION - LATE NIGHT\n\n          Waiting for his train, Jonathan pauses at a news kiosk.\n\n          JONATHAN\n          Do-you have tomorrow's Times yet?\n          The grizzled OLD MAN behind the counter doesn't look up.\n\n          OLD MAN\n          It is tomorrow.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          2.\n\n          CONTINUED:\n\n          JONATHAN\n          Right. I forgot.\n          The Old man grudgingly bends to cut the plastic on a fresh\n          stack of newspapers. As he does, Jonathan glances at numerous\n          porn magazines on display. Naked women smile back at him --\n\n          OLD MAN\n          Anything else?\n\n          JONATHAN\n          Uh - no. No that's it, thanks.\n\n          EXT. BROOKLYN - LATE NIGHT\n\n          Jonathan descends an above-ground subway stop. Neighborhood\n          streets are vacant, the clopping of his shoes the only sound.\n          Jonathan turns a corner, heads for a humble duplex, the first\n          floor marked by unlit neon: \"FLEURS DE SOLANGE.\" He ascends\n          the steps, his keys out --\n\n          WOMAN'S VOICE                                                   (O.S.)\n          Jonathan!\n          The voice from nowhere startles him - he spins to find\n          SOLANGE                                                         (50), a vibrant Haitian woman with a thick accent,\n          standing in the doorway below, bundled in a ski jacket.\n\n          JONATHAN\n          Solange, you're up so late?\n\n          SOLANGE\n          So early, Jonathan. We open in one hour.\n\n          (GRINS)\n          So tell me, you have been out with a lady\n          friend, oui?\n\n          JONATHAN\n\n          (SMILES)\n          Je suis desole, madame, mais no.\n\n          SOLANGE\n          But why else does a young man come home at\n          such an hour?\n\n          JONATHAN\n          Just working late, that's all.\n\n          SOLANGE\n          Every night working late, working late.\n          (teasing him)\n          Ah, you can't fool me. You are Mister\n          Mischief maker - I know this! You come by\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          3.\n\n          CONTINUED:\n\n          SOLANGE                                                          (CONT'D)\n          later and pick out something for your lady\n          friend, oui?\n\n          INT. JONATHAN'S APARTMENT - LATE NIGHT\n\n          Very modest. Furnishings are nice, but sparse. Jonathan hangs\n          his suit jacket in a closet of empty hangers.\n\n          INT. JONATHAN'S BEDROOM\n\n          Not much decoration other than a dated Jimmy Connors poster\n          and an old tennis trophy. Jonathan lies in bed, flipping\n          channels on a small TV. Typical late night stuff:\n          infommercials; CNN; a Brazilian soccer match; \"Channel J\"\n          (public access) on which X-rated clips advertise phone sex.\n          Jonathan lingers a moment on these explicit ads                  - then clicks\n          back to, the roaring soccer crowd. He closes his eyes and\n          drifts off to the frenetic Portuguese of an unseen announcer..\n\n          INT. RUTHERFORD STERN LAW OFFICES - COFFEE LOUNGE - MORNING\n\n          TWO CORPORATE LAWYERS are talking shop while pouring coffee.\n\n          JONATHAN                                                         (0.S.)\n          Excuse me.\n          Fixing his coffee, Jonathan reaches past them. They barely\n          give him a glance as they continue their conversation.\n\n          LAWYER 1\n          So, the Knicks win last night?\n\n          LAWYER 2\n          I'm pretty sure, yeah.\n\n          JONATHAN\n          Actually, they lost by 4.\n          Both pause, turn to Jonathan. Jonathan smiles awkwardly.\n\n          JONATHAN\n          It was supposed to be a good game though.\n\n          LAWYER 1\n          Oh.\n          (back to Lawyer 2)\n          Hey, so. did you get a chance to look over\n          that memo from Watkins?\n\n          INT. RUTHERFORD STERN CORRIDORS - MORNING\n\n          Bustling - yet here too Jonathan is ignored as he carries his\n          coffee past ASSISTANTS and LAWYERS talking shop. He smiles\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          4.\n\n          CONTINUED:\n          politely at those he passes; few bother to smile in return.\n\n          INT. CONFERENCE ROOM - MORNING .\n\n          Again Jonathan works alone at one end of the long table,\n          rapidly typing, eyes ping-ponging from files to laptop,\n          beside him a meticulous arrangement of pastel-colored post-\n          its on which are scribbled various calculations. He strikes\n          us as extremely good at his job, tackling the overwhelming\n          array of numbers and data with methodical assurance.\n          Taking a break, he pauses to peer out the glass wall before\n          him. Behind the glass, employees pass like fish in a tank.\n\n          INT. MEN'S WASHROOM -- DAY\n\n          In a stall, Jonathan is staring sleepily at patterns in the\n          stall's marble door -- when a sudden KNOCK-KNOCK on the\n          divider to his right startles him. He peers down and over, to\n          expensive black wingtip shoes, a Wall St. Journal spread on\n          the floor. Another KNOCK-KNOCK. Confused, Jonathan turns to\n          address the divider:\n\n          JONATHAN\n          Yes?\n\n          MALE VOICE                                                      (O.S.)\n          Take a look at this.\n          The voice sounds youthful, energetic. Its owner slides his\n          Journal along the floor halfway between the marble division.\n\n          MALE VOICE                                                      (O.S.)\n          The Japanese are developing a toilet that\n          can analyze your urine for glucose levels,\n          kidney disease, even cancer. They're\n          referring to it as the \"super bowl.\"\n\n          JONATHAN\n          That certainly is                                               - something.\n\n          MALE VOICE (O.S.)\n          Of course if you've ever been to Japan,\n          you know they're nuts about their toilets.\n          I'm talking web sites, symposiums...\n          Jonathan chuckles.\n\n          MALE VOICE                                                      (O.S.)\n          You think I'm kidding. They have bowls\n          over there that cost more than a piano.\n          What I want to know is how you're supposed\n          to retrieve this analysis - you know, from\n          your super bowl.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          5.\n\n          CONTINUED:\n\n          JONATHAN\n          Maybe they're developing a fly with a\n          nursing degree. A superfly.\n\n          MALE VOICE                                                      (O.S.)\n\n          (LAUGHS)\n          Who's in there anyway?\n\n          JONATHAN\n          Uh, Jonathan Messer.\n\n          MALE VOICE                                                      (O.S.)\n          Messer... What department?\n\n          JONATHAN\n          None. I'm from Worth and Berman. I've been\n          over here a few wee--\n          A FLUSH from the next stall cuts him off. The sound of\n          zipping up, of a belt buckled, then of a stall door opening.\n\n          MALE VOICE                                                      (O.S.)\n          So you're an accountant?\n          Jonathan follows the FOOTSTEPS, now addresses his stall door.\n\n          JONATHAN\n          Audit manager, yeah.\n\n          MALE VOICE (O.S.)\n          So how's it work, Rutherford Stern hires\n          Worth and Berman to give their blessing to\n          our books, and they send you?\n\n          JONATHAN\n          Have laptop, will travel. What about you?\n\n          MALE VOICE (O.S.)\n          What about me?\n\n          JONATHAN\n          Well, I didn't get your name for one.th--\n          The SOUND OF A FAUCET RUNNING drowns him out.\n\n          MALE VOICE                                                      (O.S.)\n          .ose.\n\n          JONATHAN\n          Sorry - I didn't catch that?\n          (gets no response)\n          Hello...?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          6.\n\n          CONTINUED:\n\n          MALE VOICE                                                       (O.S.)\n          I said it's Wyatt. Wyatt Bose.\n          Jonathan FLUSHES, buckles his belt, opens his stall door -\n          - only the men's room is now empty.\n\n          COMPUVOICE                                                       (SOUND ADVANCE)\n          Message-four. Three-oh-eight-pee-em.\n\n          INT. CONFERENCE ROOM - DAY\n\n          Alone again, Jonathan listens to voice-mail on his cell\n          phone. We..find two more batteries sitting ready in a charger.\n\n          PETERSON                                                         (O.S.)\n          Jonathan? Chet Peterson. Just wanted to-\n          confirm you're wrapping up over there at\n          Rutherford Stern because the controller at\n          Clancey has been on me to get someone in\n          there by Thursday. I told him how\n          brilliant you are, said you're the best\n          auditor we've got. Anyway, I forwarded you\n          some documentation...\n          Jonathan clicks his mouse - to find 27                           a-mails ending in\n          worth&berman.com. He reaches for his palm pilot, clicks on a\n          day planner, stylus writes \"Clancey\" into next week. Other\n          than places he'll be working, days-are-all entirely blank.\n\n          INT. CONFERENCE ROOM - NIGHT\n\n          Jonathan still working. Only a few of the post-its now remain\n          on the tabletop. Yawning, he glances at his watch -\n\n                                                                                               MALE VOICE   (O.S.)\n          12:53                                                            a.m.\n          Startled, Jonathan turns to a well-dressed young man in the'\n          doorway - penetrating eyes, playful smile, familiar voice:\n\n          WYATT\n          Sorry if I scared you. I was heading home\n          and saw the lights. We met before, in the\n          can...\n\n          JONATHAN\n          Sure. It's Wyatt, right?\n          WYATT BOSE nods as he steps into the room. There's something\n          very likeably \"on\" about him.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          7\n\n          CONTINUED:\n\n          WYATT\n          So do you normally work this late?\n\n          JONATHAN\n          Pretty much. I'm supposed to be out of\n          here by tomorrow so I'm just trying to\n          finish up. What about you?\n\n          WYATT\n          You kidding? This is an early night. Hard\n          to believe that once upona time a man's\n          success was measured by how little he had\n          to work. You know in Sweden the average\n          worker gets 7 weeks a year vacation?\n          (regards his stacked files)\n          Do-you like accounting?\n\n          JONATHAN\n          It's all right, if you enjoy working with\n          numbers. Do you like being a lawyer?\n\n          WYATT\n          It's all right. If you enjoy working with\n          assholes.\n          Jonathan laughs, glances at his monitor screen.\n\n          WYATT\n          Well, I'm probably disturbing you -\n\n          JONATHAN\n          No - it's okay. Really.\n\n          WYATT\n          So Worth and Berman, huh? Don't you have\n          to like be in Mensa to work there?\n          Jonathan smiles, shrugs modestly.\n\n          WYATT\n          Been with them long?\n\n          JONATHAN\n          Since my senior year of college. They\n          subsidized my graduate degree.\n\n          WYATT\n          Really. So you were poor?\n          Jonathan is given pause by the bluntness of the question.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          S.\n\n          CONTINUED:\n\n          JONATHAN\n          Well - I guess you could say that. I was\n          raised by a single mother, and she died\n          when I was nineteen, so... yeah. It wasn't\n          so bad though. I'm sure a lot of people\n          have had it worse.\n\n          WYATT\n          Not around here. Practically every suit I\n          know is Harvard by way of Andover.\n\n          JONATHAN\n          Are you?\n\n          WYATT\n          Me? Hell no... I'm Princeton. By way of\n          Exeter.\n          Jonathan laughs. Wyatt smiles, takes a few idle paces.\n\n          WYATT\n          So. Jonathan.\n\n          (GRINS)\n          What do you say to a break?\n\n          CUT TO:\n          CLOSE ON A SCREENSAVER OF SWIMMING FISH. Tilt up from\n          Jonathan's laptop screen to Wyatt and Jonathan, sitting on\n          top of the expensive conference-table, passinga joint,\n          staring out at the rain hammering the far windows.\n\n          JONATHAN\n\n          (STONED)\n          .It's just sometimes I feel so - I don't\n          know - removed. I mean, I work for one of\n          the biggest accounting firms in the world,\n          and.there's not so much as a desk there to\n          prove it? They've decided all we need are\n          cell phones and laptops. Messages are\n          voice-mailed, documents e-mailed, salary's\n          deposited online. Chet Peterson, my senior\n          manager? I swear he wouldn't recognize me\n          if I was sitting in his chair.\n          Jonathan pauses, takes another drag, train of thought drifts:\n\n          JONATHAN\n          I don't know... I used to have friends.\n          But it's like I've spent so much time\n          trying to prove myself, working these\n          hours                                                           - you can only do it so long before\n          you look up and realize you've lost\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          9.\n\n          CONTINUED:\n\n          JONATHAN                                                        (CONT'D)\n          everyone. Just - fell out of touch. With\n          everyone... And I try to meet people at\n          work. I do. But it's always the same. To\n          the accounting staff I'm a pain because\n          for two weeks they have to hold their\n          breath and hope I don't pick up on any of\n          their screw ups. And to everyone else, I'm\n          just a temporary fixture, so why bother?\n          The truth is, this is the first meaningful\n          conversation I've had in I don't know how\n          long. It's like if I disappeared tomorrow,\n          I'm not .sure anyone other than Solange\n          would even notice - she's my neighbor. I\n          live on what must be the only block in\n          Brooklyn that still isn't hip.\n\n          (EXHALES)\n          I guess I just never counted-on the\n          isolation. It's like sometimes I look\n          through that glass, and I see life\n          literally passing me by.\n          Jonathan stares out the glass wall in stoned silence.\n\n          WYATT\n          Jonathan?\n\n                                                                          JONATHAN\n          Yeah?\n\n                                                                          WYATT\n                                                                          By the clock on the wall there? You've\n          just talked for                                                 37                                       minutes straight.\n          Wyatt looks at Jonathan -- and cracks up. Jonathan hesitates,\n          then he too starts to laugh so now they can't stop, their\n          laughter filling the expansive room -- until it's drowned by\n          the SOUND ADVANCE OF POURING RAIN...\n\n          EXT. MIDTOWN - STREET - LATE NIGHT\n\n          Jonathan hurries in the cold. rain for the Times Square\n          subway. He's just about to descend - when across                7th Avenue\n          he spots a beautiful YOUNG WOMAN in a camel hair coat,\n          clutching a slim briefcase, waiting to cross the street.\n          Jonathan gazes at her, almost gasping. She's surrounded by\n          pedestrians with umbrellas., she's the only one without one\n          and she's DRENCHED. But she seems content to entertain\n          herself drawing a pattern in the drops collecting on the\n          umbrella in front of her.\n          Jonathan watches, intrigued - and then the rumble of the\n          subway below reminds him he'd better move.\n\n          \n\n          \n\n          \n\n          \n\n          10.\n\n          INT. TIMES SQUARE SUBWAY STATION - LATE NIGHT\n\n          Jonathan stands in a long line to buy a Metrocard, his\n          glasses steamed up. He takes them off to wipe the lenses.\n          JONATHAN'S POV: the entire station is a blur, all unfocused,\n          muted colors, no object discernible from another -\n          - until his glasses return his POV to immediate focus, and he\n          sees the same Young Woman in'the camel.hair coat, a pair of\n          dollar bills in her hand, entering the station.\n          Jonathan can't help but stare again. Despite her business\n          attire, there's an almost childlike lightness. to her step.\n          Jonathan notices her slim briefcase. Beneath her hand, he can\n          make out the first letter of a monogram: \"S.\"\n          She checks out the long line for Metrocards, considers\n          waiting, then decides life's too short. She continues past,\n          headed for the turnstiles.\n          Jonathan continues to observe as she raises her briefcase,\n          then proceeds to wriggle her slender frame through the narrow\n          gap in the turnstile.\n          A PANHANDLER on the other side watches her with amusement.\n          Glancing up, she catches his eye, and blushes a mischievous\n          smile. Once she's through, she drops her money into his\n          collection - and slips out of view.\n          ANGLE ON JONATHAN, still stuck on line, staring at the space\n          she vacated.\n\n          INT. SUBWAY PLATFORM -- SHORT TIME LATER\n\n          Jonathan arrives as an N train pulls away, the platform now\n          practically. empty.\n          Weary and still a bit stoned, Jonathan peers sleepily into\n          the dark expanse of tunnel, yawns -\n          And then he sees \"S\" is waiting on the same platform. Ten\n          yards away. He gazes at her. She's unwrapping some GUM. He\n          watches as she puts a piece in her mouth.\n          The sound of an ARRIVING N TRAIN. \"S\" heads for it, Jonathan\n          follows...\n          The train halts. The door before him is the last of its car,\n          the door before her the first of the next.\n          The doors open.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          11\n\n          CONTINUED:\n\n          II S â\u0080¢ II\n          (turns to Jonathan)\n          Excuse me, is this the train for canal\n          Street?\n          It takes Jonathan a second just to find his voice. She's even\n          more arresting up close.\n\n          JONATHAN\n          Uh,.either one is                                               -- I mean the N and the\n          R both stop there so, you know, either\n          way, I mean, this is the right train. Yes.\n          SOS Of\n          Thanks.\n          \"S\" enters her car. Jonathan wavers, wants to follow into her\n          car but doesn't have the nerve. He enters a different car.\n\n          INT. SUBWAY CAR - LATER\n\n          Jonathan's slumped against a window, annoyed. at himself for\n          not getting in her car.\n          He can see 'S'. She sits in the other car chewing her gum. He\n          studies her, he's absolutely knocked out by her.\n\n          CONDUCTOR (O.S.)\n          Next stop Canal Street. Canal is next.\n          He sees \"S\" rising to join the small crowd gathering by a\n          door.\n          Jonathan stands up - his last chance. Determined, he braces\n          himself and rises, grasping his briefcase.\n          The screeching of brakes as the train grinds into \"CANAL ST.\n\n          STATION.\"\n          A sudden JOLT of the braking train.causes Jonathan to stumble\n          slightly and his briefcase BANGS against a seat and SNAPS\n          OPEN - contents tumbling out. His cell phone hits the floor.\n          Jonathan quickly bends for his phone - when the train lurches\n          to a halt, nearly knocking him over, and sliding his cell\n          phone a few feet along the grimy floor.\n          O.S. we hear the hiss of the doors opening as Jonathan grabs\n          for his phone a second before it's stepped on. He hurriedly\n          stuffs it in his pocket, shoves his files and papers and\n          paraphernalia back into his briefcase and rises to his feet -\n          - to find the doors closing, and \"S\" gone.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          12.\n\n          CONTINUED:\n          Devastated, he hurries to a window, searching the platform as\n          the train begins to depart... He can just glimpse the back of\n          her camel hair coat as his car is sucked back into a tunnel.\n          He stands helpless, just shuts his eyes and lowers his head.\n\n          INT. RUTHERFORD STERN - COFFEE LOUNGE - MORNING\n\n          Jonathan is pouring coffee when he brightens on hearing Wyatt\n          enter, talking animatedly with Lawyers                          1   and 2. Caught up in\n          telling his joke, Wyatt doesn't seem to notice Jonathan.\n          Only when the lawyers burst out laughing does Wyatt glance\n          up. His eyes meet Jonathan's. Jonathan smiles in greeting -\n          but Wyatt just nods coolly, returns to his fellow lawyers.\n          Jonathan's smile falters. He exits wordlessly.\n\n          INT. RUTHERFORD STERN - DAY\n\n          Jonathan hands over files and CD-Roms to a less than sociable\n\n          ASSISTANT CONTROLLER.\n\n          JONATHAN\n          I guess that's it. then. Nice meeting you.\n\n          ASSISTANT CONTROLLER\n          Uh huh.\n          Jonathan turns to go, takes two paces - then turns back.\n\n          JONATHAN\n          Listen - could you point me toward Wyatt\n          Bose's office?\n          The Assistant Controller looks up in mild annoyance.\n\n          JONATHAN\n          Wyatt Bose. He's an attorney here.\n          She sighs, put upon, then slides out a desk drawer in which a\n          laminated page of names and extensions is taped. Jonathan's\n          eyes follow her lazy finger down the list --\n\n          A GRUFF VOICE (O.S.)\n          Hey, quit looking down her shirt!\n          Jonathan instinctively leaps back from her desk, turns to\n          find Wyatt grinning at him from down the corridor.\n\n          WYATT\n          Leaving, huh? So where to next?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          13.\n\n          CONTINUED:\n\n          JONATHAN\n          Clancey Funds on Thursday. Clute Nichols\n          after that.\n          Wyatt's about to reply - when ANOTHER LAWYER passes him in\n          the hall. Wyatt taps the lawyer's shoulder.\n\n          WYATT\n          Hey, wait up a sec.\n          (smiles back)\n          Well, good meeting you, Jonathan.\n          ,Wyatt turns and starts to walk off with the other lawyer.\n          Jonathan bends for his briefcase -\n\n          WYATT                                                           (O.S.)\n          Wait, so you have off tomorrow?\n          Jonathan looks up to Wyatt smiling at him from down the hall.\n\n          WYATT\n          You don't happen to have .a. decent\n          backhand, do you?\n\n          INT. MANHATTAN RACKET CLUB - DAY\n\n          Beneath an enormous bubble dome, Jonathan and Wyatt play\n          mixed doubles with two attractive YOUNG WOMEN (early 20's).\n          Between points, we observe from Jonathan's side of the net\n          Wyatt chatting up his partner. The rapport between Jonathan\n          and his partner is markedly less comfortable; he wipes his\n          brow, smiles at her, she forces a polite smile in return.\n\n          SAME SCENE - LATER\n          A good rally underway. Jonathan fires a backhand. Wyatt\n          returns it with an audible grunt. Jonathan snaps the ball\n          back to Wyatt's partner - only Wyatt intercepts, nailing it\n          back. Jonathan returns it with equal force.\n          A grin on Wyatt's face as he savors the battle, blasting back\n          each ball. The women step aside. Jonathan lunges, barely\n          managing to lob a return. Sensing victory, Wyatt raises his\n          racket and with a guttural bark mercilessly smashes the ball.\n          Jonathan dives, racket over-extended - and returns a\n          near perfect shot just over Wyatt's head... but it lands two\n          inches outside the opposite baseline.\n\n          WYATT\n          Out!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          14.\n\n          CONTINUED:\n          Jonathan curls forward, gasping for air. Silence - then\n          Wyatt's SOLITARY APPLAUSE echoes in the humid space.\n\n          WYATT\n          Commiserations, Messer. Good game.\n          They shake hands at the net. Jonathan is exhausted.\n\n          WYATT\n\n          (WARMLY)\n          Develop akiller instinct and you'll beat\n          the crap out of me.\n          Jonathan turns to commiserate with his partner - but she's\n          already gone to join her friend. Jonathan crashes out on the\n          court. From his low angle he watches as Wyatt goes over to\n          the girls and says something that causes a burst of laughter.\n          The girls finally wave goodbye. Wyatt hops over the net.\n\n          WYATT\n          They asked if we'd fancy a post-game\n          cocktail. Don't worry, I got us out of it.\n          Jonathan is barely able to speak.\n\n          JONATHAN\n          Oh? I would've been happy to.\n\n          WYATT\n          Are you kidding? They're a couple of first\n          years at Merrill. Screw that, we can do\n          better. Hey, you OK?\n          Jonathan nods as an amused Wyatt helps him to his feet.\n\n          INT. RACKET CLUB LOUNGE\n\n          Soft jazz plays as Wyatt leads Jonathan past the bar area.\n          Wyatt is admiring Jonathan's weathered tennis racket.\n\n          WYATT\n          Man, I remember when these first came out.\n          I think I was a frosh at boarding school.\n          (chuckles; fingers a string)\n          Jeez, are these strings natural gut?\n\n          JONATHAN\n          Actually, it's a hybrid weave: natural gut\n          and Kevlar. They're pretty obscure now. I\n          should replace them, they're all frayed...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          15.\n\n          CONTINUED:\n          Looking up, Jonathan abruptly slows his pace, his eyes\n          suddenly fixed on a woman sitting at the far end of the bar.\n          From behind, it looks remarkably like \"S\"...\n          Only, as she turns, her profile proves otherwise.\n\n          INT. LOCKER ROOK!\n\n          Wyatt and Jonathan in towels, heading for the showers.\n          Jonathan still deep in the 'S' moment -\n\n          WYATT\n          Have you ever considered contacts?\n          Jonathan halts, confused to find Wyatt studying his face       -\n          his eyeglasses in particular.\n\n          JONATHAN\n          Huh? Oh - yeah, I tried once, but I was\n          allergic to something in the solution.\n\n          WYATT\n          Too bad. You have an attractive face. Your\n          eyes especially.\n          Jonathan looks self-conscious in his towel.\n\n          WYATT\n          It's not a come on, just an observation.\n          (considers him a beat)\n          You don't get much, do you.\n\n          JONATHAN\n          What - you mean sex?\n\n          WYATT\n          No, flood insurance. How many women have\n          you slept with?\n\n          JONATHAN\n          Oh, I don't know, not a whole-\n\n          WYATT\n          Of course you know. Everyone knows.\n\n          JONATHAN\n          Maybe - four.\n\n          WYATT\n          Maybe four?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          16\n\n          CONTINUED:\n\n          JONATHAN\n          Okay fine, just four. What about you?\n\n          WYATT\n          Me? I have no idea.\n\n          JONATHAN\n          What? You just said everyone -\n\n          WYATT\n          I meant everyone like you.\n          Confused, Jonathan looks up -- as Wyatt disappears into a\n          shower stall.\n\n          SAME - MOMENTS LATER\n          Jonathan emerges freshly showered, a towel around his waist\n          as he walks toward the rows of lockers.\n\n          WYATT                                                          (O.S.)\n          Tonight?... Fine. I'm on the list?\n          Jonathan finds Wyatt half-dressed, seated on a bench by a\n          locker and talking on his cell phone.\n\n          WYATT\n          There better be.\n          Wyatt hangs up, looks up to find Jonathan staring, puzzled.\n\n          WYATT\n          Something wrong?\n          Jonathan reaches into his locker for his hanging jacket, and\n          pulls out his own cell phone. It's identical to Wyatt's.\n\n          JONATHAN\n          We have the same phone.\n\n          WYATT\n          Oh - and you thought I was using yours?\n          I can afford my own phone calls, you know.\n\n          JONATHAN\n          No, I wasn't                                                   -- of course you can-\n\n          WYATT\n          I'm pulling your dick, Jonathan.\n          (grins, slams his locker)\n          Actually, I was just firming up some plans\n          for tonight. Are you free?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          17.\n\n          CONTINUED:\n\n          JONATHAN\n\n          (SURPRISED)\n          Me? Sure, I guess                                               - but I don't want to\n\n          INTRUDE-\n\n          WYATT\n          You're not. What do you say, are you in?\n\n          JONATHAN\n          I guess I could go home and change.\n\n          WYATT\n          To Brooklyn? Forget it, you can borrow\n          something of mine.\n\n          INT. WYATT'S BUILDING - EARLY EVENING\n\n          A three-story brownstone in an expensive West Village\n          neighborhood. As Wyatt leads Jonathan to the staircase, they\n          pass a papery-faced GENTLEMAN                                   (50s) in a fine suit.\n\n          WYATT\n          t                                                               a                       uten Abend, Herr Kleiner.\n          (glances back)\n          This way, Jonathan.\n\n          INT. WYATT'S APARTMENT\n\n          Urban chic to a serious degree. Big terrace, funky furniture,\n          framed snapshots of Wyatt with similarly hip and attractive\n          young friends - and great art, including an entrancing image\n          of a burning candle just slightly out of focus.\n\n          WYATT\n          Like it? It's a Gerhard Richter. Kleiner\n          downstairs is a hot shot art dealer - he\n          hooked me up with the gallery in Munich.\n          Wyatt disappears into the next room. Alone, Jonathan wanders,\n          pauses by the framed snapshots. The young people in them are\n          like Wyatt -- beautiful, strong, wealthy. Jonathan pauses by\n          one photo in which Wyatt looks a bit younger, his hair\n          bleached blonde and loosely spiked.\n\n          WYATT (O.S.)\n          Talk about a bad look.\n          Startled, Jonathan quickly turns to find Wyatt standing right\n          behind him,. a slick, expensive SUIT draped over his arm.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          18.\n\n          CONTINUED:\n\n          WYATT\n          Here, try this one.\n          (off Jonathan's hesitation)\n          What?\n\n          JONATHAN\n          Nothing, I just hope I can pull it off.\n\n          WYATT\n          You hope you can pull it off. You know who\n          you remind me of? James Getz.\n\n          JONATHAN\n          Who?\n\n          WYATT\n          A guy I roomed with freshman year at\n          Princeton.. Real smart                                 - witty too, when\n          you loosened him up. Only from day one, he\n          just didn't fit in. For starters, he was\n          dirt poor. But it wasn't that. See, there\n          was always this boundary - this wall -\n          between Getz and everyone else. You could\n          argue we laid the foundation, but he built\n          it. Built it by believing the lie.\n\n          JONATHAN\n          What lie?\n\n          WYATT\n          That he was any different. The clothes,\n          the money, the wry anecdotes - it's all\n          one big masquerade. Anyone can get in,\n          you've just got to wear a costume. But\n          Getz never got that. He assumed he could\n          never scale the wall, when the truth is he\n          was the only one guarding it. It never\n          occurred to him his anonymity could be an\n          asset. No one gets over like the guy who's\n          just a face, an impression. We are - all\n          of us                                                  - only who we're perceived to be.\n\n          JONATHAN\n          So what happened to him?\n\n          WYATT\n          Who, James Getz? Oh - he killed himself.\n\n          JONATHAN\n          (hesitates a beat)\n          You're pulling my dick, aren't you.\n          Wyatt turns to him with a grave look... then smirks.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          19.\n\n          CONTINUED:\n\n          WYATT\n          With both hands.\n          Jonathan can't help but laugh as Wyatt hands him the suit.\n\n          CUT TO:\n          CLOSE ON A BUFF YOUNG MAN                                       (EMCEE) in a vintage bowler hat.\n          He struts up to us, thumbs in his suspenders:\n\n          EMCEE\n          And now, straight from the Cafe Germaine,\n          the Velvet Rope is proud to introduce you\n          to the lovely Miss Lu Lu Lamour!\n\n          INT. THE VELVET ROPE - NIGHT\n\n          An ultra-elite \"new burlesque\" nightclub in Manhattan,          1920s\n          Parisian decor. Strictly UPSCALE PATRONS, male and female,\n          sip from crystal barware, while on stage a BETTY PAGE TYPE\n          performs an elegantly choreographed strip tease.\n          Wyatt and Jonathan sit at a small table; each table is fitted\n          with. an old-fashioned black rotary telephone, as well as a\n          small monitor recessed into the tabletop on which old stag\n          films play silently. All part of the wink-wink ambience.\n\n          WYATT\n          It's a little self-conscious, but I\n          thought you'd get a kick out of it. How's\n          that suit working out?\n\n          JONATHAN\n          Oh - great, actually.\n\n          WYATT\n          Keep it then. I've got two just like it.\n          Jonathan's about to protest, when a WAITRESS arrives.\n\n          WAITRESS\n          Two Macallan 25 year. Enjoy, gentlemen.\n\n          JONATHAN\n          Isn't this like fifty bucks a glass?\n\n          WYATT\n          We'll try not to spill any.\n          (regards the floor show)\n          So what's the wildest thing you've ever\n          done? Sexually, I mean.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          20.\n\n          CONTINUED:\n\n          JONATHAN\n          The wildest thing? Oh I don't know, I've\n          never been too adventuresome.\n\n          WYATT\n          All right, what's the lamest thing then?\n\n          JONATHAN\n          The lamest...\n          Wyatt's focused on him, amused, eager to hear it.\n\n          JONATHAN\n          Actually, that was probably a few months\n          ago. I was flipping through money magazine\n          and saw this small ad in the back. It read\n          something like \"Are. you feeling all alone?\n          Looking to meet women but have forgotten\n          how?\" And-there was this number.\n\n          WYATT\n          And you called it? So what happened?\n\n          JONATHAN\n          Nothing actually. The phone just kept\n          ringing. And that's it.\n          Wyatt stares at Jonathan a beat, then starts to crack up.\n\n          JONATHAN\n          Lame enough for you?\n\n          WYATT\n          You called a sex ad - from Money Magazine.\n          That is beyond lame.\n          Jonathan too starts laughing - when the phone at their table\n          lights'up. Wyatt looks to Jonathan, raises a brow - then\n          picks up. He listens a moment, smiles, hands it to Jonathan.\n\n          JONATHAN\n          .Hello?\n          Wyatt taps his shoulder, directs his gaze to a SEXY BRUNETTE\n          at a distant table, receiver to her ear, eyeing Jonathan.\n\n          JONATHAN\n          .All right... Goodbye.\n          Jonathan hangs up, turns to Wyatt.\n\n          JONATHAN\n          She wants to dance.\n\n          \n\n          \n\n          \n\n          \n\n          21.\n\n          ON THE DANCE FLOOR - LATER\n          Jonathan is slow dancing with the sexy Brunette to an old\n          Edith Piaf ballad. He looks over her shoulder to his table,\n          where Wyatt is sitting, talking on his cell phone.\n          Glancing up, Wyatt's eyes meet Jonathan's; he flashes a proud\n          smile. Jonathan continues dancing, truly enjoying himself.\n          The Brunette leans in, whispers something in his ear...\n\n          BACK TO WYATT AND JONATHAN'S TABLE\n          Wyatt clicks off his cell phone, looks up to find Jonathan\n          returning alone, looking deflated.\n\n          JONATHAN\n          She's a hooker.\n          Wyatt shrugs, grinning.\n\n          JONATHAN\n          Hold on - you knew? What - are all the\n          women here prostitutes?\n\n          WYATT\n          That depends on what you mean by that\n          word. Stretch the definition and you could\n          incorporate most of the men as well.\n          (sips his drink)\n          You know in Amsterdam prostitutes not only\n          belong to a union, they have to pay taxes.\n\n          JONATHAN\n          You seem to possess quite a store of\n          international trivia.\n\n          WYATT\n          Not really. I just get around... Jonathan,\n          relax. It's not like she just shot your\n          dog. I was only trying to help. Besides,\n          what are you looking for - a relationship?\n          As if you have time for one? This was your\n          first day off in how long?\n\n          JONATHAN\n          Three weeks.\n\n          WYATT\n          Four for me. Face it, we've mortgaged our\n          youth. Pimped out our twenties. But we\n          still have needs. And there's nothing\n          shameful about wanting them met.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          22\n\n          CONTINUED:\n\n          JONATHAN\n          So you sleep with hookers?\n\n          WYATT\n\n          (LAUGHING)\n          Me? Never.\n\n          JONATHAN\n          So how do you - meet your needs?\n          Wyatt studies him a beat, another French love song drifting\n          in the background as the Emcee introduces a new girl.\n\n          WYATT\n          What if I told you...\n          (breaks off, laughs)\n          Christ, I sound like an infommercial.\n\n          JONATHAN\n          What were you going to say?\n\n          WYATT\n          Listen. You don't think that women have\n          these same urges? Young women, just like\n          ourselves, successful and working their\n          asses off to stay that way? You better\n          believe they do.\n\n          JONATHAN\n          And?\n\n          WYATT\n          And - well - let's just say, there's a\n          way...a way it can be taken care of.\n\n          JONATHAN\n          You make it sound like a mob hit.\n          Wyatt smiles, and turns his attention back to the floor show.\n\n          INT. TAXI CAB - LATE NIGHT\n\n          Wyatt and Jonathan are in the back seat. A quiet beat.\n\n          JONATHAN\n          What you were talking about, before.\n          Peoples' needs...\n          Wyatt turns to Jonathan with a grin:\n\n          WYATT\n          Some other time.\n          (to Cabbie)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          23.\n\n          CONTINUED:\n\n          WYATT                                                           (CONT'D)\n          At the corner, please. The Rhiga Royal.\n          (to Jonathan)\n          Listen, I have to meet someone..\n\n          JONATHAN\n\n          (SURPRISED)\n          Oh... okay.\n          The cab pulls up before the RHIGA ROYAL HOTEL.\n\n          WYATT\n          Hey. You had a good time tonight?\n\n          JONATHAN\n          Yeah. Yeah I did. Thanks.\n\n          WYATT\n          I'm glad. Listen, that thing with the\n          hooker, I'm really sorry if I                                   -\n\n          JONATHAN\n          Forget it. It was funny.\n          Wyatt smiles warmly, pats Jonathan's shoulder.\n\n          WYATT\n          I'll give you a call tomorrow.\n          Wyatt                                                           climbs out. Jonathan watches through the cab window as\n          Wyatt disappears into the golden glow of the lobby.\n          LATER: Driving in the cab, Jonathan catches his reflection in\n          the glass. He smiles, liking how he looks in Wyatt's suit.\n          Outside, rainy Manhattan passes by ina hypnotic blur.\n\n          JONATHAN\n          (To driver)\n          Hey. Could you let me out at the next\n          corner over there, on 7th Avenue?\n\n          EXT. TIMES SQUARE SUBWAY - LATER\n\n          Jonathan stands in the exact spot where he first saw \"S\".\n          He buys a New York Times and a hot-dog.\n          Pedestrians and theatre crowds pass by as he remains rooted\n          to the spot,.hoping he'll see that face in the crowd.\n          After a while he shakes his head at the ridiculousness of it\n          and heads down into the-subway.\n\n          INT. CLANCEY INVESTMENTS - A CONFERENCE ROOM - MORNING\n\n          Clancey's stiff CONTROLLER                                      (50s) hovers nervously over\n          Jonathan as he unloads files onto the huge conference table.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          24.\n\n          CONTINUED:\n          Beside him we see he's set up his laptop, phone charger,\n          pencils and a fresh, unopened pack of pastel post-its.\n\n          CLANCEY CONTROLLER\n          Any problems, you'll want to see Julie\n          Levinson, she's our assistant controller                       -\n          or if she's busy, Scott Werner, our senior\n          accountant. If Werner's unavailable, we\n          have two staff accountants                                     - but like I\n          said, I don't anticipate any problems. I\n          mean we've never had any before, so...\n\n          JONATHAN\n          Right.I just need the access codes for\n          the accounts and sub-accounts?\n          The Controller suddenly looks uneasy.\n\n          JONATHAN\n          You've got account numbers, but no access\n          codes. Without those I can't get the banks\n          to authorize statement verification.\n          (beat; smiles)\n          Besides, how else can I steal the money?\n\n          CLANCEY CONTROLLER\n          What?\n\n          JONATHAN\n          Nothing, I was just pulling your-- leg. I\n          do need those codes though, when you get a\n          chance.\n\n          INT. CLANCEY CONFERENCE ROOM - DAY\n\n          Other than Jonathan's suit and tie, the reduced number of\n          post-its and the lighter stack of files                        - little has changed.\n          Jonathan is hunched over his laptop. Like Rutherford Stern's\n          conference room, this one too is designed with a glass wall.\n          Jonathan peers out at workers passing in utter indifference\n          to him. Slightly different tank, slightly different fish.\n          CLOSE ON A BUSINESS CARD: a Rutherford Stern masthead,\n          beneath it Wyatt's name and office number. Jonathan picks up\n          his cell phone and dials it. RING... RING -\n\n          WYATT (O.S.)\n          Hey, Jonathan.\n\n          JONATHAN\n          How'd you know it was-\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          25.\n\n          CONTINUED:\n\n          WYATT (O.S.)\n          You really ought to block your caller ID.\n          So - same place as yesterday?\n\n          EXT. ROCKEFELLER CENTER - DAY\n\n          Along the entire square of ledge, throngs of SUITED BUSINESS\n          TYPES bundled in scarves eating street vendor fare. It's here\n          we find Wyatt and Jonathan, having a quick bite.\n\n          WYATT\n          I wonder what the Founding Fathers would\n          make of this scene.\n          Wyatt regards face after face of young men and women wearing\n          expensive suits, wolfing down lunch so they can get back to\n          work - a good 2/3 of them talking on cell phones as they eat.\n\n          JONATHAN\n          I'm just glad to be outside.\n          (awkwardly heartfelt)\n          I've got to tell you, this has been great,\n          meeting up for lunch. I used to just-\n          A cell phone RINGS. They both instinctively reach in their\n          jackets, take out their identical phones. It's Wyatt's that's\n          ringing. Jonathan rests his down on the ledge.\n\n          WYATT\n          Yes?... Shit. Okay, see if you can.gettme\n          on the 6:15                                                     out of JFK tonight... Fine.\n          Wyatt rests his phone on the ledge next to Jonathan's.\n\n          WYATT\n          Rutherford needs me to join him asap in\n          London to paper some financing with\n          Lloyds. I tell you about this?\n\n          JONATHAN\n          No - no you didn't.\n\n          WYATT\n          Yeah, I should be gone a few weeks.\n          Jonathan tries to mask the wave of loneliness setting in.\n\n          JONATHAN\n          Sounds exciting.\n\n          WYATT\n          Nah, it'll be boring as sin.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          26.\n\n          CONTINUED:\n          Wyatt studies him a moment, grabs his cell phone and rises\n          from the ledge.\n\n          WYATT\n          Shit, I'd better get back. You ready?\n\n          INT. CLANCEY INVESTMENTS - CONFERENCE ROOM - LATER\n\n          Sitting before his laptop, Jonathan takes out his cell phone\n          and punches in some numbers.\n\n          COMPUVOICE                                                     (O.S.)\n\n          I'RN-SORRY-THE-VOICE-MAIL-PASSWORD-YOU-\n\n          ENTERED-IS-NOT-VALID-PLEASE-TRY-YOUR-\n          He enters the numbers again, receives the same prerecorded\n          message. He hangs up -- when it abruptly RINGS, surprising\n          him. He stares at the phone a curious beat, then answers it.\n\n          JONATHAN\n          Jonathan Mess-\n          CLICK. Dead air. More puzzled, Jonathan frowns a beat          - then\n          replaces the battery with one fresh off the charger.\n\n          INT. CLANCEY BUILDING - ELEVATOR - NIGHT\n\n          As ignored as ever, Jonathan is squeezed among EMPLOYEES on\n          their way home. TWO SECRETARIES speak in hushed tones:\n\n          SECRETARY 1\n          .That's just it. You caught him in a\n          lie, so now everything he says you have to-\n          RING of a cell phone. RING... RING... It's Jonathan's.\n          Surprised, he takes out the phone, presses talk.\n\n          JONATHAN\n          Hello?\n          A soft, electronic rustle from the other end... then:\n\n          WOMAN'S VOICE                                                  (O.S.)\n          Are you free tonight?\n\n          JONATHAN\n          Excuse me?\n\n          WOMAN'S VOICE                                                  (O.S.)\n          I asked if you're free tonight.\n\n          JONATHAN\n          I'm sorry, I think you have the wrong--\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          27\n\n          CONTINUED:\n          CLICK. The line goes dead.\n\n          EXT. TIMES SQUARE - NIGHT\n\n          Jonathan trudging home. He descends into the subway.\n\n          INT. SUBWAY STATION\n\n          Jonathan is heading for the DOWNTOWN N/R when:. RING...\n          RING... His cell phone again. He steps aside and answers:\n\n          JONATHAN\n          Hello?\n          The CRACKLE OF STATIC on the other end. Then:\n\n          WOMAN'S VOICE                                                   (O.S.)\n          Are you free tonight?\n\n          JONATHAN\n          Actually I am, but I don't think I'm who\n          The static on the other end worsens.\n\n          WOMAN'S VOICE                                                   (O.S.)\n          I'm sorry, I didn't get that?\n\n          JONATHAN\n          I said I am free, but I                                         -\n\n          WOMAN'S VOICE                                                   (O.S.)\n          Could you be at the Plaza in one hour?\n\n          JONATHAN\n          The hotel? I - I guess, but -\n\n          WOMAN'S VOICE                                                   (O.S'.)\n          Beneath the Eloise portrait.\n          THE ROAR OF A TRAIN pulling in. Only when the train passes\n          can he hear the other end. But now there's no one there.\n          Jonathan stares at his cell phone - and frowns.\n          Close on the phone's display as Jonathan scrolls down its\n          list of stored numbers. His expression says none are\n          familiar. And NOW he gets it.\n\n          INT. TAXI CAB - NIGHT\n\n          A heavy-set CABBIE glances in his mirror at Jonathan in back,\n          cell phone to his ear.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          28.\n\n          CONTINUED:\n\n          JONATHAN\n          (into phone)\n          Hi, it's Jonathan, I've got your cell! I\n          guess you must have mine. I imagine you're\n          in the air now, but call when you get\n          this. if you do. Oh, and you got a call\n          from someone who I'm...forget it, just\n          call me.\n          Jonathan hangs up.\n\n          CABBIE\n          So where ya visiting from?\n\n          JONATHAN\n          Excuse me?\n\n          CABBIE\n          You're from out of town, right?\n\n          JONATHAN\n\n          (PUZZLED)\n          Me? No.\n\n          CABBIE\n          Huh. I can usually tell. You seem like a\n          tourist.\n\n          JONATHAN\n          I've lived here all my life!\n\n          CABBIE\n          No offence, pal.\n          The cabbie pulls over on Central Park South. Jonathan leans\n          forward, peers up at the gorgeous French Renaissance facade.\n\n          CABBIE\n          Well, here ya are. The Plaza.\n\n          INT. PLAZA HOTEL - LOBBY - NIGHT\n\n          Sheer elegance. Wealthy GUESTS stroll, chat, lounge. Hotel\n          STAFF in immaculate uniforms greet, assist, etc..\n          Jonathan anxiously wanders the perimeter, then slows as he\n          spies a PORTRAIT OF A PRECOCIOUS LITTLE GIRL grinning at him.\n\n          SAME SCENE - SHORT TIME LATER\n          Jonathan is standing awkwardly beneath the Eloise portrait,\n          glancing at his watch, growing restless, unsure --\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          29.\n\n          CONTINUED:\n\n          WOMAN'S VOICE                                                    (O.S.)\n          Pardon me, but may I ask you something -\n          personal?\n          Jonathan quickly looks.up, to find standing before him an\n          attractive BLONDE WOMAN. She's. around his age, slender to the\n          point of stark, dressed in a chic grey business suit.\n\n          THE BLONDE\n          Are you waiting for me?\n\n          JONATHAN\n          I                                                                - think so, yes. You're here for Wyatt,\n          right?\n\n          THE BLONDE\n          Excuse me?\n          (hesitates, appraising him)\n          I'm sorry, did we speak earlier?\n\n          JONATHAN\n          Yes. Yes we did -\n\n          THE BLONDE\n          Good. Let's go then.\n\n          INT. PLAZA - ELEVATOR\n\n          Jonathan and the Blonde stand in an elevator alongside an\n          ELDERLY COUPLE. The couple smile at the handsome pair.\n          Jonathan fidgets uncomfortably. The Woman is staring at the\n          lit numbers. He notices a ROOM KEY in her hand.\n\n          JONATHAN\n          (whispers aside)\n          Look, I don't think I'm -- I mean; you and\n          I., we don't know each other...?\n          She turns to him, the slightest smile on her thin lips.\n\n          THE BLONDE\n          No fooling.\n          DING. The doors open. She steps out. A beat. He follows.\n\n          THE HALLWAY\n          Walls, carpeting - details all classically gorgeous. The\n          Blonde keeps a quick pace, headed toward a room.\n\n          JONATHAN\n          What I mean to say is, I'm fairly certain\n          there's been some kind of mistake.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          30.\n\n          CONTINUED:\n          She stops dead in her tracks, her back to him.\n\n          THE BLONDE\n          You're not who I spoke with on the phone?\n\n          JONATHAN\n          No - I mean, yes, but -\n\n          THE BLONDE\n          You're not attracted to me?\n\n          JONATHAN\n          Oh no, it's not that at all, it's just                          -\n\n          THE BLONDE\n          It's just what... exactly?\n          She turns, steps toward him. Jonathan opens his mouth to\n          explain -- when she covers it with hers. It takes him a\n          moment to succumb to her kiss... but not too long.\n\n          INT. PLAZA -- A ROOM - LATER\n\n          A smooth plane of pressed sheets creases as two bare bodies\n          lower to them. The Blonde hovering over him, Jonathan's\n          tentativeness is all but gone.\n          Jonathan cradles her to him, her features softening under\n          waves of pleasure as she gasps, and whispers in soft, slow\n          annunciation as if it were the sweetest word in our language:\n\n          THE BLONDE\n          Fuck.\n          LATER: Jonathan lies post-coital. A smile. And then a look of\n          mild anxiety, 'what's going on'? He turns to the Blonde but\n          she's fast asleep.\n\n          INT. PLAZA - THE', ROOM - EARLY MORNING\n\n          On the sound of a DOOR SHUTTING, Jonathan's eyes squint open.\n          Still naked, he props himself up, leans over to find he's all\n          alone. A clock radio reveals itself as the source of the\n          FAINT CLASSICAL MUSIC we hear. The time reads:                  6:18   am.\n          He rises, glances around the room. No sign of her.\n\n          INT. PLAZA - RECEPTION DESK - MORNING\n\n          Showered and dressed, Jonathan is talking with a DESK CLERK.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          31.\n\n          CONTINUED:\n\n          DESK CLERK\n                                                                         Sir, I'm showing that room as having\n          checked out at                                                 6:20                                   this morning.\n\n          JONATHAN\n          Well could you tell me the name of the\n          guest who was staying there?\n\n          DESK CLERK\n          I'm afraid we're not allowed to disclose\n          information regarding our guests. If you\n          give me her name, I can confirm if she was\n          registered here.\n\n          JONATHAN\n          Actually, the thing is... it's okay.\n          Forget it.\n\n          EXT. CENTRAL PARK SOUTH - MORNING\n\n          Jonathan exits to good tidings from the BELL STAFF. Lost in\n          his thoughts, it takes him a moment to respond.\n          He starts to walk. His cell RINGS. He answers.\n\n          JONATHAN\n          Hello?\n\n          WYATT'S VOICE\n          Hey, you're up early!\n\n          JONATHAN\n          Hi! How's London?\n\n          WYATT'S VOICE\n          Raining. So you've got mine-and I've.got\n          yours?\n\n          JONATHAN\n          Yeah. Listen, last night...um...I met this-\n\n          WYATT'S VOICE\n          Damn! Sorry, I'm gonna have to call you\n          back, they want me in a meeting. Hey, no\n          long distance calls, okay!\n          Wyatt hangs up. Jonathan shakes his head, amused. He hails a\n          cab, glances back at the hotel. His lips curl into a vaguely\n          proud, if still dazed, smile.\n\n          \n\n          \n\n          \n\n          \n\n          32.\n\n          INT. CLANCEY INVESTMENTS - DAY\n\n          Jonathan sits alone at the long conference table, working but\n          distracted. He pauses, eyes Wyatt's cell phone sitting there.\n\n          INSERT - EXTREME CLOSE ON THE CELL PHONE'S DISPLAY WINDOW\n          The numbers stored have no names associated with them. It's\n          just a series of undesignated seven-digit sequences, a list\n          of phone numbers that seems to go on and on.\n          Jonathan clicks on a number at random. It highlights itself.\n          Jonathan hesitates, then clicks again. The number is dialled.\n          RING...RING - a woman with an elegant BRITISH ACCENT answers:\n\n          BRITISH ACCENT                                                  (V.0.)\n          Yes?\n\n          JONATHAN\n          Hello, um - I'm sorry to bother you                             -\n\n          BRITISH ACCENT (V.O.)\n          How did you get this number?\n\n          JONATHAN\n          Through a friend.\n\n                                                                          BRITISH ACCENT                             (V.0.)\n                                                                          I think you've got the wrong number. Now\n          if you'll excuse me                                             -\n\n          JONATHAN\n          wait -\n          Jonathan fumbles for what else to say before she hangs up.\n\n          BRITISH ACCENT                                                  (V.O.)\n          Yes?\n          CLOSE ON JONATHAN. What to say? And then:\n\n          JONATHAN\n          (braces himself, swallows)\n          Are you free tonight?\n          He shuts his eyes, ready for a hang up. A long silence.\n\n          BRITISH ACCENT (V.0.)\n          I can be.\n          Jonathan opens his eyes half in disbelief.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          33.\n\n          CONTINUED:\n\n          BRITISH ACCENT                                                 (V.0.)\n          Where?\n\n          JONATHAN\n          Where. Right... The Plaza?\n\n          BRITISH ACCENT (V.0.)\n          I'm afraid that's a bit uptown for me.\n          Perhaps the Mercer? Say by the\n          Shakespeare, half past eleven?\n\n          JONATHAN\n          The Shakespeare?\n\n          BRITISH ACCENT                                                 (V.0.)\n          It should be fairly evident.\n\n          INT. THE MERCER HOTEL - LOBBY - NIGHT\n\n          The SoHo industrial motif is the antithesis of the Plaza. By\n          a vintage book library we find a sleekly dressed YOUNG BLACK\n          WOMAN perusing spines of Salinger, Scott, Sheherazade -\n\n          JONATHAN                                                       (O.S.)\n          Excuse me, um - I'm sorry to disturb you -\n          She turns, regards him a moment, curiously - a copy of\n          Shakespeare's \"A Midsummer Night's Dream\" in her hand.\n\n          JONATHAN\n          I'm - supposed to meet someone here and-\n\n          BRITISH ACCENT\n          You're rather new to this, aren't you?\n          Jonathan falters. She smiles.\n\n          BRITISH ACCENT\n          That's okay. I like that.\n\n          LOBBY ELEVATOR\n          She enters first, then Jonathan. He waits for her.to push a\n          button - only it seems she's waiting for him to do the same.\n\n          JONATHAN\n          I'm sorry, what floor?\n          She rolls her eyes.\n\n          BACK TO THE HOTEL LOBBY\n          Jonathan and British Accent cross the lobby once more.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          34\n\n          CONTINUED:\n\n          BRITISH ACCENT\n          Frankly I'm surprised that whoever gave\n          you access didn't explain more.\n\n          (SIGHS)\n          Right then, the rules: One,.no names, no\n          jobs                                                           - no nothing. Two, latex is mandatory\n                                                                         and non-negotiable.. Three, no rough stuff   -\n          the only rule that's even remotely\n          malleable provided there's mutual consent,\n          although I say if that's your thing, take\n          it elsewhere. And finally...\n          She halts a few feet from the registration desk.\n\n          BRITISH ACCENT\n          The initiator is responsible for the room.\n\n          JONATHAN\n          (takes him a second)\n          Oh - so I should...?\n\n          BRITISH ACCENT\n          Precisely.\n\n          BACK IN THE ELEVATOR\n          Jonathan is holding a key card. British Accent is leaning\n          against the opposite wall, eyeing him with a slight grin. A\n          moment. DING. The elevator doors open.\n\n          INT. MERCER HOTEL - HALLWAY - NIGHT\n\n          They are headed for a room as he ventures another question:\n\n          JONATHAN\n          So are there a lot of - people - who do\n          this?\n          She turns to him with a look of growing impatience -- when\n          the CREAK OF A CART causes them to glance up: a ROOM SERVICE\n          WAITER is crossing past the far end of the hall. Jonathan\n          turns back to find her staring at him uneasily.\n\n          BRITISH ACCENT\n          How did you get into this?\n\n          JONATHAN\n          Well, a friend of mine -\n\n          BRITISH ACCENT\n          He uploaded your numbers but failed to\n          explain the basics?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          35.\n\n          CONTINUED:\n\n          JONATHAN\n          He's                                                          - well, he was going out of town.\n          (off her frown)\n          I'm doing something wrong, aren't I?\n\n          BRITISH ACCENT\n          It's not that, it's just... well, you\n          strike me as something of a stowaway. In\n          fact if I were more suspicious, I'd say\n          you didn't belong here at all.\n          Flustered, Jonathan's about to offer some explanation ---\n\n          BRITISH ACCENT\n          But obviously somebody felt you did.\n          The notion suddenly registers with Jonathan -- Wyatt!\n\n          BRITISH ACCENT\n          And I'm a sucker for bashful boys...\n          She takes his wrist, traces a finger over his palm... and\n          removes the key card from his hand.\n\n          INT. MERCER HOTEL - HOTEL ROOM - NIGHT\n\n          Jonathan and British Accent having sex. She has his arms\n          pinned back, writhing on top of him, clearly enjoying the\n          control - Jonathan remains awed, just enjoying the ride.\n\n          INT. MERCER HOTEL - BEDROOM- LATE NIGHT\n\n          Jonathan lies in bed-beside British Accent.\n\n          JONATHAN\n          Can I ask you something? Why do you do\n          this?\n\n          BRITISH ACCENT\n          Why are any of us doing this? For the\n          economics of the arrangement.\n          (rolls over, away from him)\n          It's intimacy without intricacy.\n          Jonathan's about to reply --\n\n          BRITISH ACCENT\n          Look, I've got a 7                                            a.m. breakfast, so...\n          She says no more. Jonathan stares up at the ceiling a beat.\n\n          JONATHAN\n          Well - good night.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          36.\n\n          CONTINUED:\n          She doesn't reply.\n\n          INT. CLANCEY INVESTMENTS                                        - CONFERENCE ROOM - LATE DAY\n\n          Jonathan.alone at his laptop, the stack of files down to a\n          bare few. He dials a number on 'his' cell:\n\n          JONATHAN\n          (into phone)\n          Hey, I never heard back from you. I guess\n          you're busy.with stuff over there.\n          (smiles to himself)\n          I've been kinda busy too! I've been\n          wondering - did you mean for me to take\n          your phone?\n\n          EXT. RHIGA ROYAL HOTEL - NIGHT\n\n          Jonathan walks the carpet-draped sidewalk toward the entrance\n          - then pauses, looks around in recognition of this same spot\n          where Wyatt had gotten out of the cab that night.\n\n          JONATHAN (V.0.)\n          I've got a feeling you did. You dog! I can\n          see you grinning right now.\n          Jonathan returns the BELL STAFF's chipper greetings and steps\n          inside --\n\n          JONATHAN                                                        (V.0.)\n          Anyway, I just wanted to say... thank you.\n          SOUNDTRACK MUSIC SWELLING: to herald a MONTAGE:\n\n          INT. THE BENJAMIN - LOBBY - NIGHT\n\n          Jonathan seems somewhat more relaxed as he lingers in the\n          lobby. A woman with a BOYISH HAIRCUT taps his shoulder.\n\n          INT. THE REGENCY - A ROOM - NIGHT\n\n          Jonathan and an ASIAN WOMAN having sex on a plush celadon\n          carpet, two briefcases resting side by side a few feet away.\n\n          INT. CLANCEY INVESTMENT SERVICES - CONFERENCE ROOM - DAY\n\n          Alone as usual, Jonathan now seems strangely contented in\n          this isolated state. WORKERS pass in the wall of glass, but\n          now he doesn't bother looking up.\n          In his briefcase, we note the inclusion of a toiletries bag.\n\n          \n\n          \n\n          \n\n          \n\n          37.\n\n          INT. THE DRAKE                                                  - LOBBY - NIGHT\n\n          At a registration desk, Jonathan hands his credit card to a\n          DESK CLERK. A BELLHOP gestures to a luggage cart. Jonathan\n          shakes his head, looking confidently past him to a TALL WOMAN\n          seated inconspicuously among the various out-of-towners.\n\n          INT. THE DRAKE - ROOM - MORNING\n\n          Jonathan wakes up alone, his necktie knotted around a\n          bedpost. He reaches for the phone, presses \"Room Service.\"\n\n          INT. WEISS MURPHY INSURANCE - COPY ROOM - DAY\n\n          Jonathan is waiting to make some copies when the SECRETARY at\n          the copier hands him a stack of paper...\n\n          WOMAN'S VOICE (O.S.)\n          Can you hold these?\n\n          INT. THE MARK - ROOM -- LATE NIGHT\n\n          .only the voice belongs to the woman Jonathan is having sex\n          with - referring to her legs that she wraps around him.\n\n          INT. THE FITZPATRICK - SUNDRY SHOP                              - MORNING\n\n          Jonathan buys a bottle of O.J. and a 36-count box of condoms.\n\n          INT. WEISS MURPHY INSURANCE - CORRIDOR DAY\n\n          Carrying his coffee mug, Jonathan suddenly slows, his eyes\n          locked on The Blonde with whom he'd first been at the Plaza.\n          Her eyes fix on his as he.nears                                 - a flash of mutual\n          recognition... then nothing as they pass without a word.\n          Jonathan can't help but allow himself the slightest grin.\n\n          INT. HOTEL ELYSEE - THE \"CLUB ROOM\"                             - NIGHT\n\n          Jonathan wades confidently through a sea of YOUNG EXECUTIVES.\n          He approaches a REDHEADED BUSINESSWOMAN. He asks her\n          something. She looks up, confused ---\n          -- when ANOTHER REDHEAD taps his shoulder. Her free hand\n          slips into his,. their fingers interlocking...\n\n          INT. THE PARAMOUNT - HOTEL ROOM - NIGHT\n\n          . PULL BACK from interlocked fingers to find Jonathan's\n          hand entwined with ANOTHER WOMAN'S. We realize we're watching\n          their image in a MIRROR when we PAN away from the mirror...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          38.\n\n          CONTINUED:\n          to Jonathan and YET ANOTHER WOMAN having sex. The bed\n          keeps banging against the night stand - a glass of water,\n          moving closer to the edge with every bang. There's something\n          almost rote about it, a numbness in the repetition... the\n          glass FALLS, HITS the ground and BREAKS.\n          MATCH CUT TO: Jonathan PLUNGES into water.\n\n          INT. THE PENINSULA - HEALTH CLUB - MORNING\n\n          Jonathan doing laps. He emerges from the pool, strides with\n          confidence past the tourists flanking him on either side:\n          OLDER COUPLES snoozing, PARENTS adjusting floaties on kids,\n          BUSINESS TRAVELLERS with airport novels.\n          He continues toward us, hair slicked back, like Wyatt's.\n\n          MONTAGE ENDS/ CUT TO :\n\n          EXT. BROOKLYN - JONATHAN'S APARTMENT - NIGHT\n\n          Jonathan arrives at his building's steps to find Solange\n          hurrying out of her flower shop. She embraces him warmly.\n\n          SOLANGE\n          Jonathan, for so long I don't see you!\n\n          JONATHAN\n          J'ai ete tres occupe. with work.\n          He's exhausted. And no longer so exhilarated by his nightly\n          activities.\n\n          SOLANGE\n          Work? No, no. You believe you can trick\n          me, Mr. Mischief Maker! I want to meet\n          this lady friend of yours.\n          Jonathan is about to protest -\n\n          SOLANGE\n          Ah., ah                                                        - ecoutez, I have beautiful winter-\n          roses, just. arrived. She.will swoon...\n          Jonathan smiles, but there's a reticence to it.\n\n          JONATHAN\n          Maybe later, okay?\n\n          SOLANGE\n          There is no later when it comes to love!\n          If you find it, you must not let it go.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          39.\n\n          CONTINUED:\n          Jonathan nods absently, continues up the steps                  - when she\n          tugs his sleeve. He turns to her; she searches his eyes.\n\n          SOLANGE\n          There really is no one?\n          Jonathan evasively shakes his head.\n\n          SOLANGE\n          There should be, Jonathan. It is not good\n          for a young man to be too much alone.\n          He gives her an uncomfortable smile. She smiles back, but as\n          she heads inside, she looks both-sad and worried for him.\n          Jonathan continues up the steps, opens the front door and\n          disappears inside. We remain on the vacant street, hear his\n          FOOTSTEPS climbing the steps - and then the muted RING of his\n          cell phone. A beat, then another...\n          .and the front door opens again as Jonathan steps back out\n          into the night.\n\n          INT. THE HUDSON HOTEL - LOBBY -- LATE NIGHT\n\n          Checking his reflection in a mirror while he waits, Jonathan\n          faintly hears what sounds like WYATT'S LAUGH. He quickly\n          turns to the sound: a bar off the lobby. Through slotted\n          glass he scans the backs of heads: a group of business men.\n          Reflected in the mirror, a WOMAN appears behind him. Jonathan\n          freezes, his eyes grow wide -\n\n          WOMAN\n          Excuse me...\n                                                                          He doesn't breathe. Utterly stunned, he turns to confirm...\n          It's her.                                                       -It's \"S\".\n\n          INT. THE HUDSON - ELEVATOR\n\n          Jonathan stares at her in sheer disbelief but she's\n          oblivious, smiling casually back at him.\n\n          INT. HOTEL ROOM\n\n          \"S\" enters first, flips on the light, proceeds inside.\n          Jonathan enters tentatively behind her, eyes still glued.\n          \"S\" takes off her coat, drapes it over a chair. Jonathan\n          remains still and silent, just watching. She undoes the\n          wrists of her blouse, then the collar button.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          40.\n\n          CONTINUED:\n          Jonathan is about to say something but can't. She undoes the\n          next button. We can glimpse a bra. She undoes the next --\n\n          JONATHAN\n          Before we...um, the thing is                                   - I know you.\n          She glances up, curious                                        - her hand lingering by the front\n          clasp of her bra.\n\n          JONATHAN\n          Not 'know' exactly, but we sort of met\n          before. In the Times Square subway\n          station. It was raining...\n\n          â\u0080\u009e S â\u0080\u009e\n\n          (GRINS)\n          In the subway?\n\n          JONATHAN\n          You had no umbrella. You were soaked.\n\n          â\u0080\u009eC,.\n          It's true, I don't have an umbrella.\n\n          JONATHAN\n          Then you asked me if the N train stops at\n          Canal.\n          She squints back at him, vaguely recalling him. She smiles\n          warmly and continues to unbutton her blouse.\n\n          JONATHAN\n          Wait.\n\n          â\u0080\u009eSÂ»\n          Is something the matter?\n\n          JONATHAN\n          This just seems strange, that's all.\n\n          SÂ\u0080\u008e\n          Because you've seen me before?\n\n          JONATHAN\n          Maybe. I don't know, it's just                                 -\n\n          (EXHALES)\n          Ever since that night on the train, I've\n          thought about how nice it would be to see\n          you again. And now suddenly, here you are,\n          taking off your clothes.\n          â\u0080\u009e S of\n          Bingo! So what's the problem?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          41.\n\n          CONTINUED:\n\n          JONATHAN\n          It's just that-\n\n          \"S,1\n          (a generous smile)\n          Hmm, it is kind of a gear-shift.\n          She starts to button her blouse back up.\n\n          â\u0080\u009eSâ\u0080\u009e\n          Well, maybe some other time.\n          Jonathan is thrown as she reaches for her coat -\n\n          JONATHAN\n          Wait - don't go.\n          She glances back curiously.\n\n          JONATHAN\n          What I mean is, by any chance... are you\n          hungry?\n\n          INT. HOTEL CORRIDOR - PRE-DAWN\n\n          A BELLMAN rolls a cart noiselessly down the carpet, placing\n          early editions of the New York Times before each room.\n          He pauses by a door, quietly leaves anewspaper. We can hear\n          the sound of JONATHAN AND \"S\" TALKING AND LAUGHING...\n\n          INT. HOTEL ROOM\n\n          They sit across from each other Indian-style on the bed. The\n          radio is tuned to a pop music station. They're finishing a\n          meal of burgers and fries, getting along famously.\n          You have some ketchup on your chin.\n\n          JONATHAN\n          sorry, I'm a messy eater.\n          â\u0080\u009esâ\u0080\u009e\n          Me too.\n          Jonathan rubs at his chin with a napkin, misses. she takes\n          the napkin, dabs it in water and cleans him up.\n\n          JONATHAN\n          Thanks.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          42.\n\n          CONTINUED:\n          They continue to eat for a while, eyeing each other   between\n          bites.\n\n          JONATHAN\n\n          (POINTS)\n          Um, I think there's a little piece of...\n          â\u0080\u009eSr.\n          .onion in my hair?\n          She laughs and flicks it.off.\n          Hmm...they get everywhere.\n\n          JONATHAN\n          By the way, my name's-\n\n          â\u0080\u009eS,.\n          Don't!\n          She puts her finger to his lips. A first touch. An\n          electricity between them.\n\n          â\u0080\u009eC/,\n          (a playful smile)\n          You know the rules. No names.\n\n          JONATHAN\n          The 'rules' seem to specify no\n          conversation either.\n          as.,\n          They are a little rigid, aren't they? But\n          I think we should obey the 'no names'.\n          It'll be fun!\n\n          JONATHAN\n          Ah, but I know.yours begins with an 'S'.\n          â\u0080\u009eSir\n          Is that right?\n\n          JONATHAN\n          I saw part of the monogram on your\n          briefcase.\n          ./ S If\n          I see-Excellent work, Holmes.\n          (leans in, smiles)\n          Maybe I'll tell you if.you guess...\n          Her face is an inch from his, the moment mysterious   and           sexy.\n\n                                                                (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          43.\n\n          CONTINUED:\n\n          JONATHAN\n          (Holmes voice)\n          Hmrn...what do we know of her? She sports a\n          camel coat, a briefcase and possesses no\n          umbrella. I deduce...her name is 'Sybil'.\n          'S' laughs.\n\n          JONATHAN\n          Sarah? Sara? Samantha? Sandra? Susan?\n          She makes a little sound of encouragement.\n          Hun...\n\n          JONATHAN\n          Aha! Sue?\n          (shakes her head)\n          Suzie with a 'z'?\n          You're saying my name is 'Suzie'?\n\n          JONATHAN\n          is it?\n\n          â\u0080\u009eSâ\u0080¢â\u0080\u009e\n          Nape.\n          Jonathan laughs.\n\n          JONATHAN\n          I've got to tell you, I'm much better with\n          numbers... How about Sonia? Sheena? Wait -\n          Sophie! You're definitely a Sophie.\n\n          â\u0080\u009eS.\n          With an 'ie' or a 'y'?\n\n          JONATHAN\n          Either.\n\n          W7\n          Neither.\n\n          JONATHAN\n          How about Syd? As in Syd Charisse?\n          She was Cyd with a 'C'!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          44.\n\n          CONTINUED:\n\n          JONATHAN\n          But maybe you spell it with an 'S'?\n          ,, S . If\n          I do not.\n\n          JONATHAN\n          Steffi? Sexy Steffi soaking in the:rain?.\n          She                                                         mock-frowns.\n\n          â\u0080\u009eS.,,\n          Nein.\n\n          JONATHAN\n          Sally? Sally with three 'l's?\n          She                                                         shakes her head, amused. Jonathan rubs his chin.\n\n          JONATHAN\n          Hmmm. Hmmm. The mysterious 'S' alighted\n          from the train at Canal Street. She may\n          well be from 'downtown'...hmm...ah! Of\n          course! How foolish I've been; Sinead.\n          'S'                                                         giggles, charmed by him.\n\n          JONATHAN\n          Stella? Sky? Sunbeam?\n\n          Â»S.,,\n          Do I look like a 'Sunbeam'?\n\n          JONATHAN\n          Absolutely. To me you are 'Sunbeam'.\n\n          â\u0080\u009eS.,,\n          Then so be it.\n          Jonathan considers this a moment, and concedes.\n\n          JONATHAN\n          Can I ask what you do for a living?\n          You first.\n\n          JONATHAN\n          I sit behind glass and watch people pass\n          like fish.\n          She smiles - a more interesting answer than she expected.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          45.\n\n          CONTINUED:\n\n          ALSIP\n          You work in a bank?\n\n          JONATHAN\n          Nahh, I'm... I'm kind of an accountant.\n          us,,\n          Now I bet that's just what you wanted to\n          do when you were a kid!\n\n          JONATHAN\n          Oh yeah. I'm living the dream. Feel free\n          to leave now.\n          u S â\u0080\u009e\n          Still here.\n\n          JONATHAN\n          So what about you?\n\n          â\u0080\u009eSÂ»\n          No, we're still on you, Frank.\n          Off Jonathan's look, 'Frank'?\n\n          â\u0080\u009eS.11\n          You look like a Frank. So, Frank, when you\n          were a little boy, what did you wanna be\n          when you grew up?\n          .Jonathan thinks. Confesses:\n\n          JONATHAN\n          A pro tennis player.\n\n          â\u0080\u009eS,.\n          Huh! I wanted to be an umpire.\n\n          JONATHAN\n          You're kidding?\n          â\u0080\u009esâ\u0080\u009e\n          Really! I loved the idea of sitting in\n          that big, high chair.\n          (umpire voice)\n          'The ball was good,'Mr McEnroe.'\n\n          JONATHAN\n          I can see it.\n          An 80's new wave love song comes on the radio. She beams,\n          reaching across Jonathan to turn it up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          46.\n\n          CONTINUED:\n          a, S 11\n          I used to love this song.\n          \"S\" stands up on the bed, starts to dance. She reaches her\n          hand out to Jonathan. He smiles, shakes his head.\n\n          JONATHAN\n          Trust me, it's not a pretty sight.\n\n          \"S:,\n          I'll be the judge of that.\n          He hesitates, then takes her hand, rises to his feet, and\n          starts to dance with her. He's self-conscious at first, but\n          she's agile enough to guide him, and soon he's into it.\n          is S Il\n          See? You just need the right partner.\n          She closes her eyes, swaying with the music. They dance\n          together. He's falling even harder for her.\n          As the song ends she holds his gaze -- when a small yawn\n          escapes her. She covers her mouth.\n          of S+â\u0080\u009e\n          I'm so sorry. Suddenly I'm crashing.\n          She drops down on the bed, tugging him down with her. They\n          lie back, side by side.\n\n          JONATHAN\n          I'd like to see you again. Not in a hotel.\n          it S+ \"\n          Hmm. I'd have to think about that.\n\n          JONATHAN\n          How about tomorrow?\n          /. S to\n          It is tomorrow.\n          She curls up next to him, rests her head on his arm, closes\n          her eyes and drifts off. Jonathan gazes over at her. The\n          perfect line of her jaw. The petite divot above her lip. The\n          tiny pierced comma in a presently unadorned earlobe.\n          And then he notices, in the far corner: her purse. He stares\n          at it; her name and personal details less than 20               feet away.\n          He hesitates, then tries to silently slide his arm out from\n          under her -- when she stirs and nuzzles closer. He looks over\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          47.\n\n          CONTINUED:\n          to the purse, then back at \"S,\" sleeping peacefully on his\n          arm... and chooses this perfect moment over knowing any more.\n\n          INT. THE HUDSON - HOTEL ROOM - MORNING\n\n          CLOSE ON JONATHAN'S SLEEPING FACE. His eyes slowly open.\n          JONATHAN'S POV: her purse is no longer on the chair.\n          He raises his head, sees that she's gone. He stares at her\n          pillow. The indentation where she slept. Smiles to himself.\n          He gets out of bed and heads for the bathroom. There's a NOTE\n          on the desk on hotel note paper:\n          Frank - you snore like a tractor. Will\n          call u later. Sunbeam xxx\n          He stares at the note, beaming - when his cell phone rings.\n          Jonathan picks it up.\n\n          MAN'S VOICE                                                     (V.0..)\n          Are you free tonight?\n          A bea- - and then Wyatt's familiar laughter.\n\n          JONATHAN\n          Hey! Are you back in town?\n\n          WYATT (V.0.)\n          I wish. It's friggin' anarchy in the U.K..\n          I'm stuck here at least another week.\n\n          JONATHAN\n          Oh. Because I thought I saw you last night\n          - at the Hudson.\n\n          WYATT (V.0.)\n          The Hudson, huh? Sounds like you've been\n          enjoying my little gift.\n\n          JONATHAN\n          Yeah. I mean, I was. Only now - well, I\n          met a girl. Not just any girl. The girl.\n\n          WYATT (V.0.)\n          That's fantastic! Who is the lucky gal?\n\n          JONATHAN\n          She's a member of your naughty little sex\n          club. I have broken all the rules and had\n          an honest-to-God conversation.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          48.\n\n          CONTINUED:\n\n          WYATT (V.0.)\n          That's extremely naughty of you! So what\n          happened, Romeo?\n\n          JONATHAN\n          I'd like to say it's a long story but it's\n          not. When you are coming back, you gotta\n          meet her.\n\n          WYATT (V.0.)\n          So she's, what, a lawyer or something?\n\n          JONATHAN\n          I-have no idea, I don't know all that much\n          about her. All I know is I can't wait to\n          see her again.\n\n          WYATT (V.0.)\n          Listen, I don't want to dampen your\n          spirits, but - be careful, okay?\n\n          JONATHAN\n          What do you mean by that?\n\n          WYATT (V.0.)\n          Nothing. I'm just saying, this club                         - who\n          knows who anybody is, right?\n\n          JONATHAN\n          Yeah, yeah, yeah but - sometimes you just\n          have to go with what you feel, don't you?\n\n          WYATT (V.0.)\n          True enough. Hold on a sec.\n          Muffled sounds of Wyatt talking to someone else.\n\n          WYATT (V.0.)\n          It's non stop back-to-back bullshit here.\n          Listen, I'll call you later. And hey -\n          congratulations!\n          Wyatt hangs up. Jonathan smiles. And then reads the note\n          again - grinning.\n\n          INT. WEISS MURPHY INSURANCE - BUILDING LOBBY - DAY\n\n          The morning crush of executives filing toward elevators.\n          Among them we spot Jonathan, just slightly out of step, a\n          sleepy smile lingering on his face.\n\n          \n\n          \n\n          \n\n          \n\n          49.\n\n          INT. WEISS MURPHY INSURANCE - CONFERENCE ROOM - LATE DAY\n\n          Jonathan is working on his laptop, clearly distracted. He\n          looks at his cell phone, hoping it will ring, but it doesn't.\n          He calls up the list of \"Recent Calls: Incoming,\" scrolls up\n          to the top number. It reads: \"Number Unavailable.\"\n          Jonathan looks worried, wondering how he can get a hold of\n          her - when his cell phone rings. He immediately picks up.\n\n          JONATHAN\n          Hello?\n\n          WOMAN (O.S.)\n          (unfamiliar voice)\n          Are you free tonight?\n\n          JONATHAN\n\n          (DEFLATED)\n          I think you have the wrong number.\n\n          EXT. STREET -- NIGHT\n\n          Jonathan arrives at the subway station. He's a little anxious\n          now, still hasn't heard from her. He lingers at the top of\n          the stairs, not wanting to descend. Below him he can hear the\n          lonely roar of a train pulling in below.\n          only when the train quiets down does Jonathan realize his\n          cell phone is ringing. He picks up.\n\n          JONATHAN\n          Hello?\n          Intermittent static on the other end. And then what sounds\n          like a WOMAN GASPING; it's unclear if it's a sound of\n          pleasure or pain.\n\n          JONATHAN\n          .Hello?\n          The Gasping comes faster; Jonathan debates hanging up - when\n          the gasps halt,--replaced by the faintest whisp__of_ a female\n          voice: \"No... No please...\" There's no mistaking the tone now\n          it's fear - then. suddenly a shrill, terrified SCREAM...\n          - and the line goes dead. Jonathan stares breathlessly at the\n          phone in his hand, like he's just witnessed something awful.\n          He quickly checks the display: \"Number Unavailable.\"\n          Jonathan looks panicked with the possibility that it was \"S\"-\n          - when the phone rings again. He hesitates, then picks up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          50.\n\n          CONTINUED:\n\n          \"S\"                                                             (V.O. FROM PHONE)\n\n          (COYLY)\n          Are you free tonight?\n          Jonathan exhales in relief on hearing her voice.\n\n          EXT. CHINATOWN - CANAL STREET - NIGHT\n\n          Jonathan stands on a corner, looking out of place amidst the\n          glistening neon and bustle of Asian faces. He peers anxiously\n          down the.street, checks his watch, all anticipation             -\n          - when something is wrapped around his eyes. He's startled,\n          tugs it off and spins to find \"S\" smiling back at him.\n          if S I'll\n          I bought you a present.\n          She drapes the scarf around his neck. It's all striped,\n          bright colors                                                   - all the more funky against his dark suit.\n                                                                          I knew it. You look smashing.\n\n                                                                          JONATHAN\n                                                                          Sure you don't mean \"clashing?\"\n          She laughs                                                      - then notices how tense he seems.\n\n                                                                          ,/Sâ\u0080\u009e\n          Are you all right?\n\n          JONATHAN.\n          I guess. I got a call-before yours                              - I'm\n          not sure if it was real, or if it was even\n          meant for me - but there was a woman who\n          sounded like she was being - I don't know,\n          hurt. Maybe worse.\n          \"S\" seems instantly on edge. Something about this scares her.\n          If SIP\n          You don't know who she was?\n\n          JONATHAN\n          (shakes his head)\n          It could've been a prank.\n          (notices).\n          Now you're the one who looks scared.\n\n          ..Sâ\u0080\u009e\n          No, it's just                                                   - it sounds creepy, that's\n          all.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          51\n\n          CONTINUED:\n          She shakes it off, mustering a smile as she takes his arm.\n\n          â\u0080\u009eSâ\u0080\u009e\n          Come on.\n\n          EXT. CHINATOWN -- AN ALLEY -- NIGHT\n\n          A makeshift street market, everything from fish and meat to\n          cheap electronics for sale in cramped stands. Jonathan and\n          \"S\" walk arm in arm through the packed crowd, like a couple.\n          Jonathan looks like we've never seen him before: a\n          fascination with everything around him, especially her.\n          They pause at a stall selling cheap trinkets, including a\n          small metallic wind-up toy of a duck riding a bicycle.\n\n          Â«S\"\n          He's so cute! What's his name?\n\n          VENDOR\n\n          (DEADPAN)\n          Duck On Bike.\n          \"S\" beams like it's the greatest name ever.\n\n          INT. A RESTAURANT - CHINATOWN - LATE NIGHT\n\n          An intimate place, Jonathan and \"S\" are the only patrons at\n          this late hour. They sit across from each other, grinning at\n          \"Duck On Bike\" as it totters across the table, trips over a\n          chopstick and flails on its side.\n          /t S â\u0080\u009e\n          Oh, poor Duck On Bike!\n          She uprights the toy and it keeps on moving across the table.\n\n          JONATHAN\n          You gotta respect him; he just keeps at\n          it.\n          A WAITER arrives and sets down a laminated menu - entirely in\n          Chinese. \"S\" points to the characters like an expert.\n          J! $ Ft\n          We'll have this... and this... oh, and\n          let's try one of these. Thank you.\n          The Waiter nods, walks off.\n\n          JONATHAN\n          What did you order?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          52.\n\n          CONTINUED:\n          â\u0080\u009e S of\n          I have absolutely no idea.\n\n          JONATHAN\n          How do you know we'll like it?\n\n          Â\u0080\u008e\n\n          S\"\n          How do you know we won't?\n          Jonathan gazes at her a beat.\n\n          JONATHAN\n          This is so...not my life.\n\n          â\u0080\u009e$â\u0080\u009e\n          Is that a good thing?\n\n          JONATHAN\n          More than you know.\n\n          O\n          \" smiles. Jonathan looks at her.\n\n          JONATHAN\n          Ever since that night on the subway - I\n          haven't stopped thinking about you.\n          She lowers.her eyes.\n\n          JONATHAN\n          Sorry, I didn't mean to freak you out.\n          She slowly looks up again, touched.\n\n          â\u0080\u009eSâ\u0080\u009e\n          Are you always so honest?\n\n          JONATHAN\n          No.\n          it S.,\n          Even so, I'm not sure I believe you.\n          Jonathan's look, 'why not?'\n\n          \"S.â\u0080\u009e\n          You're in the sex club! Another anonymous\n          guy looking for anonymous action. I'm not\n          judging you, I'm in. there too, but don't\n          say you've been solemnly holding atorch\n          for me for - how long is it -- wow, one\n          whole month!\n          Jonathan smiles.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          53.\n\n          CONTINUED:\n\n          JONATHAN\n          Point taken. But I've thought about you a\n          lot.\n\n          ,.S.,,\n          In between the mindless shtupping?\n\n          JONATHAN\n          And sometimes during.\n          She laughs. The waiter brings them their drinks.\n\n          JONATHAN\n          So how come you got involved in the club?\n          She frowns slightly, thinks.\n          â\u0080\u009es . If\n          Wouldn't it be great if you could just\n          meet someone and not have to do the 'work/\n          family/previous relationships' thing?\n          Isn't who we are right now so much more\n          interesting than where we've come from?\n\n          JONATHAN\n          Sure... but that didn't really answer my\n          question.\n          She reaches over and takes his hand, holds it tenderly.\n          â\u0080\u009e S of\n          I know it seems like I'm holding out on\n          you, but I'm not. It's just                                  - I turned\n          thirty this year, and I made this vow to\n          live only in the present. And it's good,\n          you know? And yes, maybe it's because\n          there are things in my past I don't care\n          to think about - but that's the same for\n          everyone, isn't it?\n          He nods, still holding hands, loving every moment of this.\n          is S . â\u0080\u009e\n          I like you. I hope you like me. Can't that\n          be enough?\n          Jonathan smiles, completely disarmed by her. The waiter\n          brings their food and goes.\n\n          JONATHAN\n          I wasn't asking for an autobiography, you\n          know. I was just curious.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          54.\n\n          CONTINUED:\n          If S. IS\n          (a beat)\n          A woman I know used to do it. So I decided\n          to give it a try. For various reasons, it\n          suits my present situation.\n\n          JONATHAN\n          You mean the intimacy without intricacy.\n\n          â\u0080\u009eS . 110\n          It has its merits. At least I thought it\n          did... until you came along.\n          He beams, gazing at her. Blushing, she starts in on the food.\n          Outside we can hear rain starting to fall...\n\n          EXT. CHINATOWN RESTAURANT - LATER\n\n          Jonathan and \"S\" step out into pouring rain, pause under the\n          shabby awning. Waiters inside are putting chairs on tables.\n          She fishes in her coat and pulls out a PACK OF GUM. The\n          wrapper is entirely in Chinese. She offers him a piece.\n\n          JONATHAN\n          Oh - no thanks.\n\n          JIS.11\n          Don't let the wrapper intimidate you. I\n          buy it at a store nearby. It has ginseng\n          in it, you know, for energy. It's not bad,\n          though it sort of tastes like hairspray.\n          She chews her gum. He watches her; the jaw line, her lips.\n          She looks at him and smiles, but there's something behind it:\n          a sadness. Almost an uneasiness.\n\n          JONATHAN\n          Hey, are you all right?\n\n          \"SÂ\u0080\u008e\n          I don't want to complicate your life.\n\n          JONATHAN\n          Too late.                                                       -- I want all the complication\n          you've got.\n          She gazes at him, blinks back her emotions.\n          it Sc,\n          Your glasses. They're fogging up.\n          She reaches out and gently removes his glasses.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          55.\n\n          CONTINUED:\n          She wipes the lenses, then peering into his eyes, slowly\n          leans in to return them to his face... only she presses her\n          lips to his instead, the glasses still in her hand, the kiss\n          itself at once tender and passionate.\n          She absently lowers her hand, lost in the unexpected\n          intensity of the kiss. Embraced, they accidentally step under\n          the sheet of water falling off the awning. Jonathan guides\n          her back beneath the awning's shelter.\n          At S is\n          (breathless whisper)\n          Maybe you should go...\n\n          JONATHAN\n          Maybe you should stay.\n          She smiles as he kisses her even more passionately. Again\n          they feel the awning's drops, and Jonathan moves to shelter\n          them -\n          - only \"S\" leans into him instead, leading him out from under\n          the awning, the falling rain suddenly drenching their faces\n          as they continue to kiss, the moment purely exhilarating.\n          wiping the rain from her face, Jonathan gazes at her, soaked\n          and utterly beautiful, with something akin to awe - like he's\n          just breathed for the very first time.\n          Rack focus on a hotel down the street, its neon sign reads:\n          \"Hotel Lotus.\"\n\n          INT. HOTEL LOTUS                                                - ROOM - LATE NIGHT\n\n          Jonathan and \"S\" lying on the bed in their white hotel bath\n          robes                                                           (underwear on), his arm around her as they watch TV. He\n          strokes her hair. She nuzzles up to him.\n          She changes channels. Finds some tennis.\n\n          JONATHAN\n          Perfect.\n          They watch together.\n          â\u0080\u009es_..\n          So were you any good?\n\n          JONATHAN\n          Yeah. But I didn't want it enough. The\n          guys who make it really need it. I played\n          recently, first time in years. I've got\n          this friend - a new friend, he's great.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          56.\n\n          CONTINUED:\n\n          JONATHAN                                                       (CONT'D)\n          Maybe you'll meet him one day. Anyway, we\n          played and he creamed me. But I knew I was\n          better than him. He said I had no killer\n          instinct.\n          I's. it\n          .I don't know, I think you're a pretty\n          determined character.\n\n          JONATHAN\n          On a level with this feller?\n          He points to 'Duck on bike' watching over them like a charm.\n\n          \"S\n          Given the chance I believe you could be.\n          She idly flips channels, finds a romantic melodrama, an old\n          black and white film. They settle back to watch.\n\n          JONATHAN\n          I know we said we wouldn't rush. But for\n          the record, I'm doing everything Ican to\n          apply.the brakes here.\n          â\u0080\u009eS                                                             . of\n          Me too.\n\n          (PAUSE)\n          And for the record, I'd like nothing more\n          than to make love right now. But I'm kind\n          of glad we decided to wait.\n\n          JONATHAN\n          It's a wise and mature choice we've made.\n\n          //S . ,/\n          Our parents would be proud.\n          Pause. Jonathan is wild with lust for her.\n\n          JONATHAN\n          But say we did, just say...\n          Mmhmm...?\n\n          JONATHAN\n          Say we were to suddenly tear off these\n          robes... Would that be such a terrible\n          thing? For two people in Manhattan -\n\n          â\u0080\u009eS.\n          In the small hours on a wet Winter's\n          night...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          57.\n\n          CONTINUED:\n\n          JONATHAN\n          To consummate their deep human needs in a\n          frenzy of...of...\n          Fucking and sucking?\n\n          JONATHAN\n          Beautifully put.\n          Its. I.\n          You were saying?\n\n          JONATHAN\n          Who - who would blame these two people?\n\n          0IS                                                           â\u0080\u009e\n          Who could possibly judge them?\n          They face each other, breathing deeply, almost panting...\n\n          JONATHAN\n          And who would know?\n          His face is inches from hers                                  - when she rolls over and\n          reaches for a glass of water on the night stand.\n          She sips her water, as she turns back to Jonathan. Still,\n          Jonathan picks up on her subtle shift.\n\n          JONATHAN\n          is everything okay?\n          She starts to say something, then stops herself and nods\n          instead. She sets down her glass, starts to get out of bed.\n\n          JONATHAN\n          Where are you going?\n\n          ,I $â\u0080\u009e\n          (a mischievous smile)\n          For ice...\n\n          JONATHAN\n          (a lusty grin)\n          Ice, huh?\n\n          I,S,I\n          I saw a machine down the hall. I'll be\n          right back.\n          She starts to tie her robe closed -\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          58.\n\n          CONTINUED:\n\n          JONATHAN\n          That's all right, I'll go.\n          He hops off the bed, grabs an ice bucket from the mini bar\n          and a key card from the table, he surreptitiously adjusts his\n          penis                                                           (as one does): and goes to the door. He's about to turn\n          the handle when -\n\n          ., Sâ\u0080\u009e\n          Wait -\n\n          JONATHAN\n          (glancing back)\n          Yes?\n          She hesitates a cryptic beat - then shakes her head, and\n          smiles at him with immense tenderness. Jonathan beams back.\n          its . P1\n          Hurry, okay?\n          He blows her a kiss, she blows one back. Almost in SLOW\n          MOTION. She looks stunning.\n\n          INT. HALLWAY - LATE NIGHT\n\n          As Jonathan exits the room, hold on the room number:            517.\n          Jonathan runs down the long corridor to the ice machine. He's\n          giddy with excitement. Passionately alive.\n          At the ice machine: an eccentric OLD WOMAN in her night\n          attire is slowly filling a bucket. Piece by piece.\n          Her weak, gnarly hands plucking at the blocks not wanting to\n          break her long nails.\n          Jonathan hops around in an agony of frustration.\n          She turns, looks him up and down - he feels a bit self-\n          conscious in his robe and bare feet.\n\n          JONATHAN\n          Would you like some help, ma'am?\n\n          OLD WOMAN\n          I can manage, thank you.\n          Finally, her bucket is full and she goes on her way.\n          .Jonathan quickly fills his bucket with ice.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          59.\n\n          CONTINUED:\n          Returning down the empty hall, ice bucket in one hand, key\n          card in the other, Jonathan hurriedly checks door numbers.\n          We see Room 518                                                 has the DO NOT DISTURB sign on.\n          Jonathan arrives back at room 517. He pauses and slips his\n          robe from his shoulder, mock 'sexy'. He puts the card key in\n          the lock, starts to open the door-- a small rectangular light\n          blips RED. He tries the card again. Again red. He knocks on\n          the door, calls out:\n\n          JONATHAN\n          I can't get the card to work.\n          He tries the card again. Leaning in, he thinks he hears\n          something behind the door. He peers down at the key panel:\n          red.\n          He knocks harder, waits for a response. None. Dead silence.\n\n          JONATHAN\n          Hello?... Hello?\n          He jostles the door handle: it won't budge. He's getting\n          anxious now, his breath quickening. He tries the key card\n          again: red. He pounds harder, then slams his shoulder into\n          the door. Nothing.\n          Desperate, he tries the key card again -- and the light turns\n          green.                                                          - A millisecond's surprised hesitation - then he jerks\n          the handle, throws open the door and Jonathan tumbles into\n\n          THE ROOM\n          He peers up into the small entryway: empty. Ahead of him we\n          glimpse the foot of the bed, its mussed blanket and sheets.\n          Jonathan gets to his feet, starts for the bed, his breath\n          quickening as he now notices a few red specks on the blanket.\n          Panicked, he rushes forward to find BLOOD soaking the bed,\n          splattered all over the crumpled sheets...\n          Jonathan gapes, horrified, the world crashing in on him just\n          as he senses something behind him and BANG!                     - something hits\n          him to the back of the head -- he goes down like a sack of\n          potatoes.\n\n          BLACKOUT.\n\n          TWO HOURS LATER\n          THE ICE BUCKET on the floor. The ice has melted, a pool of\n          water seeps out... follow the flow to arrive at Jonathan's\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          60.\n\n          CONTINUED:\n          fingers... slowly responding to the cold water... The TV\n          playing a different film now.\n          OVERHEAD OF JONATHAN lies on the floor. He groans a little.\n          Rubs the back of his head. Checks his hand for blood.\n          Pain etched in his face, he manages to get to his feet,\n          shaky. He looks around the room. It's EMPTY. No sign of \"S.\"\n          He runs into the bathroom. Also empty.\n          Back in the room, he tries the closets: empty. The CONNECTING\n          DOOR between this room and the next: LOCKED.\n          He looks to where she'd draped her clothes and bag - every\n          trace of her is gone. He whips back to the bed - the sheets\n          are still crumpled, only there's no blood an here on them.\n          He runs to the window looks down at the street. It's four in\n          the morning, no one around.\n\n          INT. HOTEL HALLWAY\n\n          Tripping over his own legs, Jonathan runs barefoot down the\n          corridor. He rounds a corner, another stretch of narrow\n          corridor. O.S. we hear the muted DING of an elevator.\n          Jonathan tears off in its direction...\n          He stumbles into the open square in which the elevators are\n          located. He crushes the down button, peers up to the floor\n          indicator overhead: \"4\" slowly creeps to \"3\".\n\n          INT. STAIRWELL\n\n          His bare feet pounding the cement steps, Jonathan takes each\n          floor faster, sweat on his brow and his palms which slip\n          their grasp on the railing -- he tumbles head first, crashing\n          to the 2nd floor landing. He clutches his head, gets up and\n          continues to dash down...\n          BANG! of the stairwell's exit as Jonathan stumbles out; he\n          lurches forward, finally looking up to find he's in\n\n          THE LOBBY\n          His undershirt tugged and misshapen, boxers twisted around\n          his bare thighs, robe open, Jonathan scans the lobby, wild-\n          eyed and shaking. It's utterly vacant at this hour, the only\n          sound a piped-in muzak rendition of the Beatles' \"Yesterday.\"\n\n          SLAM! OF JONATHAN'S HAND ON THE FRONT DESK\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          61\n\n          CONTINUED:\n          The Asian Clerk working there snaps his head up with a\n          startled gasp. Jonathan barely manages to breathe the word:\n\n          JONATHAN\n          help...\n\n          INT. HOTEL LOTUS -                                            5TH FLOOR HALLWAY - SHORT TIME LATER\n\n          Two hotel SECURITY GUARDS take the lead as they near room\n          517, Jonathan trailing, breathless and shaken...\n\n          JONATHAN\n          .I saw blood on the bed and then someone\n          hit me. When I came to, she was gone.\n\n          SECURITY 1\n          This woman you were with. What's her name?\n          Jonathan looks blank, his mind racing.\n\n          SECURITY 2\n          Sir?\n\n          JONATHAN\n          I don't know.\n          (off their looks)\n          It starts with an 'S'. I think.\n\n          SECURITY 2\n          Was shea prostitute?\n\n          JONATHAN\n          No! No, she's just a person. A friend.\n\n          SECURITY 2\n          A friend with no name.\n\n          JONATHAN\n          Of course she has a name! I just don't -\n          we have to find her - something must have\n          happened to her!\n\n          INT. ROOM 517\n\n          The two Security Guards are eyeing the bed.\n\n          SECURITY 1\n          I thought you said there was blood?\n\n          JONATHAN\n          I told you, whoever did this must have\n          cleaned it up while I was out.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          62.\n\n          CONTINUED:\n          Jonathan freezes, eyes darting to the night stand.\n\n          JONATHAN\n          My wallet and keys                                          - they're gone! They\n          were right here...\n          He looks over to the chair where his crumpled suit lies.    His\n          SCARF is gone too.\n\n          SECURITY 2\n          Maybe she took them.\n\n          JONATHAN\n          What?!\n\n          SECURITY 2\n          It happens.\n\n          JONATHAN\n          She didn't do this, okay?! Something\n          happened to her! You don't understand, we\n          were... Wait!\n          He sees something on the floor between the bed and night\n          stand. He runs to to pick it up: a Chinese Gum Wrapper.\n\n          JONATHAN\n          This                                                        -- this was hers...\n          Jonathan clutches it desperately, the lone trace of her\n          existence. The Guards exchange a look like he's INSANE.\n\n          SECURITY                                                    1\n          Sir - are these your clothes?\n          Jonathan nods absently.\n\n          SECURITY 1\n          How about putting them on.\n\n          INT. LOBBY - LATER\n\n          Jonathan arrives to find DETECTIVE RUSSO                    (female, mid-30s)\n          waiting by reception with a UNIFORMED OFFICER. Seeing\n          Jonathan, she sizes him up a moment, then approaches him.\n\n          RUSSO\n          Mr. Messer, I'm Detective Russo.\n\n          INT. POLICE PRECINCT - RUSSO'S DESK - LATER\n\n          Still shaken, Jonathan sits in a wooden chair across from\n          Russo, amidst the din and traffic of the precinct.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          63\n\n          CONTINUED:\n\n          RUSSO\n\n          (SCEPTICAL)\n          And you don't know anything about her.\n          Where she works? Where she lives?\n\n          JONATHAN\n          I told you how we met.\n\n          RUSSO\n          Through a sex group.\n          Her flat words hang in the air. He guiltily avoids her eyes.\n\n          RUSSO\n          Does this group have a name?\n\n          JONATHAN\n          I don't                                                         -- it's not like that.\n\n          RUSSO\n          Mr. Messer, I spoke to the desk clerk. She\n          only recalled seeing you check in.\n\n          JONATHAN\n          That's... that's the way it works.\n\n          RUSSO\n          All right. But now you're telling me that\n          in addition to this mystery woman, there\n          was another individual in the room?\n\n          JONATHAN\n          Not at first -- look, I know how it\n          sounds, but I'm telling you, whoever hit\n          me must have - I don't know -- taken her.\n          Maybe even...\n          He stops himself, shuddering to think of the implications.\n\n          RUSSO\n          Mr. Messer, have you had - experiences\n          like this before? Taking any sort of\n          medication?\n\n          JONATHAN\n          I'm not crazy, okay?! A woman vanished\n          back there! There was blood all over the\n          goddamn bed!\n          He becomes very conscious that this sounds crazy - when A\n          CELL PHONE RINGS: it's Russo's. She pauses, struck by the\n          genuine desperation in Jonathan's face. She finally picks up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          64.\n\n          CONTINUED:\n\n          RUSSO\n          Yeah.\n          (glances at Jonathan)\n          No, I don't think it's necessary... Right.\n          She hangs up and turns to Jonathan. He looks away, barely\n          able to contain his devastation.\n\n          JONATHAN\n          What am I supposed to do?\n          An awkward silence, then:\n\n          RUSSO\n          If you want to file a report regarding the\n          items she -\n          (corrects herself)\n          - the items you claim were stolen...\n          Jonathan shakes his head, crushed and exasperated.\n\n          JONATHAN\n                                                                          I'd like to go now. Is that all right? Can\n          I just                                                          - can I go?\n\n          EXT. JONATHAN'S APARTMENT - FIRE ESCAPE - MIDDLE OF NIGHT\n\n          Jonathan climbs up to the landing, fishes in the dark for a\n          boot. He tips it, a SPARE KEY falls out. As he starts back\n          down, he feels something in his coat pocket. He reaches in,\n          finds \"Duck On Bike\" where he'd pocketed it.\n\n          INT. JONATHAN'S APARTMENT - BATHROOM - MIDDLE OF NIGHT\n\n          Jonathan stands motionless beneath the shower, face buried in\n          his elbow, completely overwhelmed by his loss and longing.\n\n          INT. JONATHAN'S BEDROOM\n\n          Jonathan enters, wanders for his bed -- when he pauses,\n          staring at his dresser. He approaches, peering down at\n          something that's caught his eye...\n          HIS HIGH SCHOOL TENNIS TROPHY. Nothing unusual - except for a\n          small square outlined in dust three inches from the trophy\n          base, the wood around its perimeter far more faded than the\n          exposed area                                                    - as if the trophy had recently been moved.\n          Jonathan swallows tensely, staring at the cryptic dust mark -\n          (SOUND ADVANCE) BANG! of a file cabinet drawer yanked open in\n\n          \n\n          \n\n          \n\n          \n\n          65.\n\n          A SPARE BEDROOM\n          Used for storage, including an old, gun-metal grey filing\n          cabinet. Phone to his ear, Jonathan rapidly sifts through\n          faded file folders crammed with papers and documents.\n\n          JONATHAN                                                          (INTO PHONE)\n          .Your ad says                                                     24-Hour Locksmith... Well\n          how soon could you-... Fine.\n          He opens a file: it's where he keeps his passport. He stuffs\n          it in his back pocket, keeps searching, pulls a folder marked\n          \"CREDIT CARDS.\" Sorting through old statements, he finds the\n          line: \"To report a card lost or stolen...\"\n\n          INT. JONATHAN'S BATHROOM - PRE-DAWN\n\n          CLOSE ON JONATHAN'S HAGGARD FACE in the mirror of a medicine\n          cabinet as he pulls it open. Be fishes around, finds what\n          he's looking for: a SMALL BLACK CANNISTER for film. He pops\n          the cap to reveal a fat roll of emergency money.\n          Jonathan exits the bathroom, crosses the living room to the\n          foyer, where we find a LOCKSMITH finishing changing the lock.\n\n          INT. JONATHAN'S BEDROOM - DAWN\n\n          Jonathan lies awake, staring at his muted TV, his face tear-\n          stained, his eyes clouded.\n\n          JONATHAN (V.O.)\n          This is Jonathan Messer. I won't be able\n          to come in today. I'm - pretty ill...\n          'Duck on Bike' sits on his nightstand next to his glasses.\n\n          INT. SUBWAY CAR - DAY\n\n          Jonathan seated, resting against the window, drifting off\n          into.restless sleep. We MOVE IN TIGHTER ON HIS FACE, tighter --\n\n          CONDUCTOR (O.S.)\n          Next stop Canal Street. Canal is next.\n\n          :\n          Jonathan jerks awake. A few stares from nearby passengers.\n\n          EXT. CANAL STREET - DAY\n\n          Jonathan emerges from underground to hectic Chinatown. What\n          once felt romantic now feels cold and exclusionary, a\n          bustling mix of ASIANS and map-clutching TOURISTS. He surveys\n          the area,-overwhelmed, eyes searching for anything resembling\n          a clue. Foreign faces return only cold, blank stares.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          66.\n\n          CONTINUED:\n          Jonathan pauses by a STREET VENDOR, takes from his pocket the\n          GUM WRAPPER he found in the hotel, shows it to the vendor...\n\n          INT. CHINESE MARKET - DAY\n\n          Cramped and dingy. Jonathan makes his way to the counter,\n          where an OLD WOMAN sits smoking. He holds up the wrapper.\n\n          JONATHAN\n          I was told you sell this gum here?\n          The Old Woman studies him a wary beat, then gestures to a\n          candy display. In one box is the same gum.\n\n          JONATHAN\n          A woman - a white woman - buys this brand\n          of gum. I need to find-\n          The Old Woman interrupts him in raspy Chinese.\n\n          JONATHAN\n          I'm sorry, I don't                                              -- Do you know the\n          woman I'm talking about? A white woman...?\n          Please, it's very important that I                              --\n\n          GIRL'S VOICE                                                    (O.S.)\n          My grandmother doesn't speak English.\n          Jonathan spins around to find a CHINESE GIRL.(13) in a smock.\n\n          JONATHAN\n          Can you ask if she knows the name of the\n          white woman who buys this gum?\n          The Girl questions the old woman in rapid Chinese. She takes.\n          a dragon her smoke, then gives a lengthy answer. The girl\n          nods, finally turns to an anxiously waiting Jonathan.\n\n          GIRL\n          She says they sell that gum in practically\n          every store in Chinatown.\n\n          EXT/INT. JONATHAN'S APARTMENT - NIGHT\n\n          Jonathan is struggling with his stiff new key, hearing his\n          PHONE RINGING inside.\n\n          INT. JONATHAN'S APARTMENT\n\n          Jonathan rushes for the phone, picks up.\n\n          JONATHAN\n          Hello?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          67\n\n          CONTINUED:\n\n          DETECTIVE RUSSO\n          Mr. Messer?\n\n          INT. NY MEDICAL EXAMINER'S OFFICE - LOBBY                       - AN HOUR LATER.\n\n          Creepy and drab. Jonathan enters, approaches a RECEPTIONIST.\n          The Receptionist nods, points across the lobby to Detective\n          Russo. Jonathan looks very worried.\n\n          INT. M.E.'S OFFICE                                              - A RICKETY ELEVATOR\n\n          The elevator descends with an unnerving rattle as Jonathan\n          rides down with Russo.\n\n          RUSSO\n          The body came in late last night, although\n          time of death's still unclear. She was\n          found in a taxi: driver was in a .coffee\n          shop on his break, came back to his cab\n          and there she was in the back seat.\n          The elevator shudders to a metallic stop.\n\n          RUSSO\n          Her purse was recovered from a dumpster\n          about a block away, so we've got a name.\n          Jonathan tenses as the elevator doors BANG OPEN.\n\n          RUSSO\n          Simone Forester.\n          Jonathan looks sick with fear.\n\n          INT. MORGUE\n\n          Russo leads Jonathan into the harsh fluorescent lights of the\n          morgue. A MEDICAL EXAMINER                                      (50s) looks up from a deli\n          sandwich, takes one last bite and waves them over.\n          As they approach, Jonathan notices the TWO UNIFORMED OFFICERS\n          stationed down here. They recognize Russo, nod in recognition\n          - and eye Jonathan with hard, careful stares.\n\n          SAME -\"'MOMENTS LATER\n          The M.E. stands over agurney, casually lifts the sheet\n          that's been draped over the body. We glimpse a slender foot.\n          CLOSE ON JONATHAN beside Russo. He turns instantly pale, lip\n          quivering as he stares in disbelief, our CAMERA SLOWLY COMING\n          OVER HIS SHOULDER to get a look at\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          68\n\n          CONTINUED:\n          THE VICTIM'S FACE: it's not \"S\". But we do recognize her.\n          It's the Blonde: the first woman he'd been with, the one he'd\n          passed without a word in an office some days later.\n          She looks the same, only death-pale and naked - and her neck\n          marred by a thin, discolored line where she's been strangled.\n\n          RUSSO\n          Mr Messer...?\n          He tries to speak, but can hardly breathe, let alone answer.\n\n          RUSSO\n          Was this the woman you were with last\n          night?\n          She frowns, suspicious of Jonathan's hesitation. His tense\n          eyes whip across the morgue: the two cops still idling there.\n          They're out of earshot, but their mere presence amps tension.\n          Angle on the guns in their holsters. The handcuffs dangling --\n\n          RUSSO\n          Mr. Messer?\n\n          JONATHAN\n          No - she's not. Not last night... no.\n          Russo studies his strained expression a suspicious beat.\n\n          EXT. MEDICAL EXAMINER BUILDING - SHORT TIME LATER\n\n          Jonathan exits behind Russo as they step onto the sidewalk.\n\n          RUSSO\n          I figured it was a long shot. The only\n          reason I called you down is she was last\n          seen with a man in the bar of the Hudson\n          hotel.\n\n          JONATHAN\n          (suddenly tenses)\n          The Hudson?\n\n          RUSSO\n          You mentioned this group of yours meets up\n          at various hotels. I thought it was worth\n          a shot.\n          Russo glances up at him, trying to read him - something about\n          his reaction not sitting right with her.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          69\n\n          CONTINUED:\n\n          RUSSO\n          Mr. Messer, is there anything else you\n          want to tell me?\n          Nervous and torn, Jonathan manages to shake his head.\n\n          EXT. MORGUE/ STREET - NIGHT\n\n          Jonathan exiting the morgue, talking low into his cell phone.\n\n          JONATHAN\n          Wyatt, it's me. I need to talk to you.\n          Call me, OK? Please.\n\n          INT. RUTHERFORD STERN LLP - LOBBY - MORNING\n\n          A pleasant RECEPTIONIST smiles up from her expansive desk.\n\n          RECEPTIONIST\n          May I help you?\n          Jonathan is standing across from her.\n\n          JONATHAN\n          Yes, I need to get in contact with one of\n          your attorneys, Wyatt Bose - it's\n          extremely important. He's working out of\n          the London office right now. If I could\n          speak to his assistant or someone who'd\n          know how-to reach him immediately...\n\n          RECEPTIONIST\n          Of course. Just a minute.\n          The Receptionist types into her PHONE SYSTEM. She shakes her\n          head, confused.\n\n          JONATHAN\n          B-o-s-e. First name Wyatt.\n\n          RECEPTIONIST\n          Wyatt with a 'Y'?\n\n          JONATHAN\n          Yes...\n          The. receptionist frowns.\n\n          RECEPTIONIST\n          Oh -- Ms. Pomerantz?\n          Angle on a MIDDLE-AGED WOMAN walking past.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          70.\n\n          CONTINUED:\n\n          RECEPTIONIST\n          Ms. Pomerantz works in H.R..\n\n          MS. POMERANTZ\n          What can I do for you, Mr,\n\n          JONATHAN\n          Messer. Jonathan Messer. I'm an auditor\n          from worth and Berman.\n\n          INT. RUTHERFORD STERN - CORRIDOR\n\n          Jonathan walks alongside Ms. Pomerantz.\n\n          POMERANTZ\n          Are you sure you have the right firm?\n\n          JONATHAN\n          Yes                                                             -- yes, I'm                         --- He works here. I've seen\n                                                                          him working here. I net him here.\n\n          POMERANTZ\n          When was this?\n\n          JONATHAN\n          A few weeks ago. Wyatt Bose. Wait... here.\n          He hands her Wyatt's business card with the Rutherford Stern\n          masthead on it. She studies it with a look of confusion.\n\n          POMERANTZ\n          I don't know what's going on, but I can\n          assure you, there is nobody here named-\n\n          JONATHAN\n          I've seen him in the halls                                      - for Chrissake\n          we smoked pot in the conference room!\n          Ms. Pomerantz abruptly frowns, when Jonathan spots a LAWYER -\n\n          FLASH INSERT -= COFFEE LOUNGE\n          This Lawyer and another laughing at Wyatt's punch line.\n          Jonathan runs over to the Lawyer, grabs the man's arm.\n\n          JONATHAN\n          Thank God. Look, I'm trying to find Wyatt.\n\n          LAWYER\n          Who?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          71\n\n          CONTINUED:\n\n          JONATHAN\n          Wyatt Bose. I saw you talking with him,\n          cracking jokes in the coffee lounge.\n          FLASH ON SAME SCENE: Wyatt looks up, eyes meet Jonathan's.\n          Jonathan smiles in greeting... but Wyatt just nods coolly.\n\n          LAWYER\n          I crack jokes with a lot of people.\n\n          JONATHAN\n          Hold on, you're telling me you don't--\n\n          LAWYER\n          Hey - easy with the hands, okay?\n          Jonathan realizes he's got the man's sleeve in his fist. He\n          lets go, spins back to Ms. Pomerantz.\n\n          JONATHAN\n          He said he was in London with Mr.\n          Rutherford, paperinga -\n\n          MS. POMERANTZ                                                   (O.S.)\n          Mister Messer.\n          Jonathan spins to find Ms. Pomerantz scowling at him. A beat.\n\n          MS. POMERANTZ\n          Mr. Rutherford is presently recovering\n          from hip surgery. In New Jersey.\n          Jonathan glances around, to find everyone - lawyers,\n          assistants, mail clerks                                         - all staring at him.\n\n          INT. WYATT'S BROWNSTONE - DAY\n\n          Breathless, Jonathan bolts up a set of stairs, knocks on a\n          door. No answer. He knocks harder. From within we hear a set\n          of FOOTSTEPS. Sound of a lock turning, the door is opened...\n\n          JONATHAN\n          Wyatt -\n          .by a MAN in his early 60's, his WIFE behind him; both\n          strike us as wealthy, downtown patron-of-the-arts types.\n\n          JONATHAN\n          Sorry, I                                                        -- I need to speak to Wyatt.\n\n          MAN\n          Excuse me - Wyatt?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          72\n\n          CONTINUED:\n\n          JONATHAN\n          Wyatt Bose. He lives here.\n\n          WOMAN\n          In this building? He must be new. See,\n          we've been out of town the past2 months -\n\n          JONATHAN\n          Not in this building - in this apartment.\n\n          MAN\n\n          (FROWNS)\n          Young man, we've owned this apartment\n          going on thirty years now.\n\n          JONATHAN\n          But... I was right-here-with him...\n          The Man takes a step back, catching his wife's equally wary\n          expression, his hand making for the chain lock.\n\n          JONATHAN\n\n          (DESPERATE)\n          Wait!! That painting there, it's                              a Gerhard\n          Richter, right?\n\n          WOMAN\n          (even more uneasy)\n          Yes?\n\n          JONATHAN\n          From a gallery! In Munich - the one that\n          Herr Kleiner handles? The art dealer\n          downstairs?\n\n          MAN\n          Downstairs? You must mean Mr. Moretti, but\n          he's in the carpet business                                   -\n\n          JONATHAN\n          But Wyatt smoke to him.\n\n          MAN\n          Unless it was in Italian I doubt he got\n          very far.\n          Jonathan steps back, looking like he's losing his mind.\n\n          WOMAN\n          Young man... are you all right?\n\n          \n\n          \n\n          \n\n          \n\n          73.\n\n          EXT. WYATT'S BUILDING -- DAY\n\n          Jonathan stumbles out, breathing hard as he tries to grapple\n          with this                                                      - when he slams up against a man's shirtfront. Two\n          hands grasp his arms, we glimpse a pair of black wingtips      -\n          - and whip tilt up to the papery face of \"Herr Kleiner\"        (aka\n          Mr. Moretti).\n\n          \"HERR KLEINER\"\n          Sono spiacente.\n\n          INT. SUBWAY CAR - EVENING\n\n          Jonathan sits slumped against a window, the world around him\n          is ceasing to make sense. Across the aisle, a YOUNG BOHEMIAN\n          COUPLE sit side by side, her headon his shoulder. On\n          Jonathan's face there's a sense of loss that is almost\n          overwhelming.\n          Jonathan takes the crinkled Chinese gum wrapper from his\n          pocket, smoothes it in his hands, stares down at it with a\n          look of longing...\n          . when his eyes suddenly widen. He sees something inside,\n          something he hadn't noticed. He unfolds it to reveal two\n          words written in a feminine hand on the white underside:\n          I'm sorry\n          Jonathan quickly looks up, as if expecting someone else to\n          share in this haunting discovery. of course, no one does.\n          He stares back. down at it, bewildered, stunned - chilled.\n\n          EXT. SUBWAY STATION - CANAL ST., CHINATOWN - LATER\n\n          Jonathan runs out from the subway station. Determined, he\n          walks down Canal street, his eyes suddenly land on a COPY\n          SHOP across.\n          TIGHT ON JONATHAN as we see something click in his head -\n\n          INT. RUTHERFORD STERN - LOBBY - LATE DAY\n\n          Jonathan steps off the elevator, heads straight for the\n          Receptionist. She immediately looks nervous.\n\n          RECEPTIONIST\n          Sir, we asked around, nobody knows the guy\n\n          YOU'RE-\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          74\n\n          CONTINUED:\n\n          JONATHAN\n          When I was working over here, you made a\n          photocopy of my I.D..'\n\n          RECEPTIONIST\n          We do all freelancers, it's policy.\n\n          (REALIZES)\n          Oh - I'm not sure I'm allowed to-\n\n          JONATHAN\n          You have to.\n          She looks at him', sees his desperation.\n\n          SAME - MOMENTS LATER\n          Jonathan is flipping through the stack of photocopies, then\n          halts on one. He stares at it. The Receptionist peers over.\n\n          RECEPTIONIST\n          That's him? He was real cute. Only he\n          wasn't a lawyer. He was a systems analyst,\n          I think. He was here for a few days to\n          work on the computers.\n          RECEPTIONIST'S POV: of the photocopy in Jonathan's hand. It's\n          of a Massachusetts Driver's License. Staring back up at us is\n          Wyatt's smiling face.\n\n          RECEPTIONIST\n          I thought you said his name was Wyatt?\n          PAN TO THE NAME beside the photo: Sansky. WilliamR.\n          Jonathan is already running for the EXIT.\n\n          INT. JONATHAN'S APARTMENT -- HIS BEDROOM - EVENING\n\n          CLOSE ON JONATHAN'S LAPTOP SCREEN as an internet search\n          engine runs the name: \"Bansky, William.\" A page of some 200+\n          matches is returned. Jonathan readies himself, then dives in.\n          Beside the keyboard rests the receptionist's photocopy of\n          William Bansky's Massachusetts driver's license. We see\n          Detective Russo's business card resting a few inches away.\n\n          ON JONATHAN - MOMENTS LATER\n          Checking URLs site by site. He finally pauses on one. It's an\n          article from the Boston Herald. The headline: \"POLICE HAVE\n          FEW CLUES TO YOUNG EXECUTIVE'S DISAPPEARANCE.\" As Jonathan\n          scans the article, we glimpse some lines of text:\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          75\n\n          CONTINUED:\n          \"...looking for William Roger Bansky, age                       31...was employed\n          on a freelance basis by an on-site software consulting firm\n          in Boston...\"                                                                                                                                       --                                                     .Bansky recently relocated from the\n                                                                          Chicago area...\"                                                                         --   â\u0080¢   \".              'lavish lifestyle'...\"                                         --   .a\n                                                                                                                                      number of bad checks\"                      . debts\"\n          .a young man on the run...\"\n          Tilt up to Jonathan, scribbling on a Post-it pad:\n\n          WYATT BOSE = WILLIAM BANSKY, SOFTWARE CONSULTANT, BOSTON\n\n          ORIG. FROM CHICAGO -- $$ TROUBLE\n          He sticks the post-it to the photocopy of Bansky's ID. He\n          steps back, stares at it a beat - when he notices something\n          on his desk,,resting under the phone: a manila file folder.\n                                                                          He frowns at it - clearly out of place here. He picks the\n          file up, opens it... to a series of                             8X10                                                        photographs?\n          Heart racing nervously, he takes one out: it's of Jonathan\n          standing in the Plaza lobby by the Eloise portrait. Confused,\n          he quickly flips to the next one: in it, a Blonde now stands\n          there with him -- the Blonde found murdered. Simone Forester.\n          Jonathan's rapidly breathing as he shuffles through more\n          photos. They're in sequence, taken by telephoto lens.\n          Jonathan and Simone Forester getting in the elevator. Opening\n          the room door. Undressing. Screwing. In one, Jonathan has his\n          hands on her neck...\n          He's sweating with anxiety- when suddenly the phone rings,\n          startling him. He eyes it warily, then slowly picks up.\n\n          JONATHAN\n          Hello?\n\n          RUSSO                                                           (O.S.)\n          Mr. Messer, it's Detective Russo returning\n          your call.\n          Jonathan freezes, tries not to sound panicked, his eyes fixed\n          on the damning photos of himself and Simone Forester.\n\n          JONATHAN\n          Oh - right, I was just - checking in, to\n          see if you had any leads...\n\n          RUSSO\n          On that missing girl of yours? No, not\n          yet.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          76.\n\n          CONTINUED:\n\n          JONATHAN\n          (anxious to hang up)\n          Oh - okay, thanks-\n\n          RUSSO                                                      (O.S.)\n          Are you sure you didn't know Simone\n          Forester?\n          The PHOTOS of Simone in his hands, Jonathan tenses...\n\n          JONATHAN\n          I told you before -\n\n          RUSSO                                                      (O.S.)\n          I remember what you said.\n          (an unsettling silence)\n          And you weren't at the Hudson two nights\n          ago?\n\n          JONATHAN\n          I don't                                                    -- why are you-\n\n                                                                     RUSSO             (O.S.)\n          Turns out among credit card charges made\n          that night, there was one with your name.\n          The card was declined.\n\n          JONATHAN\n          I cancelled them all, the day they got\n          stolen.\n\n          RUSSO (O.S.)\n          I see. I figured it didn't mean much -\n          cards move quickly. It just struck me, you\n          know.. The coincidence.\n          Jonathan can hear the suspicion in her pause.\n\n          RUSSO                                                      (O.S.)\n          By the way, the morgue confirmed\n          strangulation as cause of death. He found\n          trace fibres of Kevlar in her neck wound.\n\n          JONATHAN\n          Kevlar?\n\n          RUSSO (O.S.)\n          It's used in certain kinds of rope and\n          string.\n          Jonathan's eyes suddenly go wide; whip pan with his gaze   to\n          the hall closet door.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          77\n\n          CONTINUED:\n\n                                                                                                 RUSSO      (O.S.)\n                                                                         Mr. Messer?\n\n                                                                                                 JONATHAN\n          Yes                                                            - yes, I'm              --\n\n                                                                                                 RUSSO      (O.S.)\n          Thought I lost you for a second.\n\n          (PAUSE)\n          Well, I won't keep you. You have a good\n          night.\n          Jonathan slowly hangs up, his panicked gaze returning to the\n          hall closet as he paces toward it, throws open the door.\n          In the far corner rests his racket bag. He grabs it, yanks\n          open the zipper... his face draining of all remaining color\n          as he peers into his empty racket ba                           . His racket is gone.\n\n          SAME - MOMENTS LATER\n          Jonathan pacing the floor, paranoid. He holds Detective\n          Russo's card. Knows he should call back. He abruptly reaches\n          for the phone, and dials... another number.\n\n          JONATHAN\n          I know, okay? I know your name isn't Wyatt\n          Bose. I know you killed that woman. And I\n          know you're trying to frame me for it, so -\n          so - WHY? What the hell is going on? And\n          where is she?! If you hurt her I swear to\n          God I'll...\n          Jonathan falters, unsure where he's going with this and\n          realizing he's now talking to himself.\n\n          COMPUVOICE\n\n          TO-SEND-THIS-MESSAGE--PRESS-POUND-OR-\n          simply-hang-up. To-erase-and-record-a-new-\n          messa ge---press-Star.\n          Jonathan hesitates, hits the Star key. A new BEEP. Harder:\n\n          JONATHAN\n          It's me. I need to talk to you.\n          He hits pound. Breathes. At least he's done something.\n          Suddenly from O.S. a faint creak. Jonathan spins, scans the\n          room, grabs the nearest blunt object: his tennis trophy.\n          QUICKLY CUT SHOTS of Jonathan searching his apartment, his\n          trophy raised as a makeshift weapon.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          78\n\n          CONTINUED:\n          He finally halts, uneasy but satisfied there's no one else\n          here - when his home phone rings, startling him. RING...\n          RING... RING... Jonathan hesitates. His machine picks up:\n\n          JONATHAN'S ANSWERING MACHINE\n          This is Jonathan. Please leave a message.\n          BEEEEP. A moment of hiss                                       - then:\n\n          MALE VOICE (O.S.\n          Jonathan?\n          Jonathan whips to the phone - it sounds like Wyatt ---\n\n          PETERSON                                                       (O.S.)\n          Chet Peterson calling -\n          -- only it's not.\n\n          PETERSON                                                       (O.S.)\n          I understand you were out today. I left\n          messages on your cell but never heard\n          back, so I thought I'd try you at home.\n          He slowly lowers his trophy as he listens, staring out the\n          window at the dark night and empty street below.\n\n          PETERSON                                                       (O.S.)\n          Just want to make sure you're up to speed\n          with Weiss Murphy, because the folks at\n          Clute Nichols are expecting you...\n\n          INT. SUBWAY CAR - MORNING\n\n          Jonathan sits in a crowded car, dressed for work.\n\n          PETERSON                                                       (V.0.)\n          They're our biggest client, so needless to\n          say, make them your top priority...\n          Jonathan takes out the crinkled Chinese gum wrapper. He\n          stares at it with a look of longing: this is his Priority-\n\n          EXT. CHINATOWN -- DAY\n\n          A series of shots: Jonathan asking around about \"S.\" The\n          street vendors. The receptionist at the hotel. The waiter at\n          the restaurant where they ate... They all shake their heads.\n          Heading back for the subway, dejected, he steps on.a\n          discarded page from the newspaper's Metro section, sees a\n          headline: \"STILL NO SUSPECT IN MURDER OF YOUNG EXEC.\" The\n          photo is of Simone Forester.\n\n          \n\n          \n\n          \n\n          \n\n          79.\n\n          INT. CLUTE NICHOLS BROKERAGE - CORRIDORS                        - LATE DAY\n\n          Intensely preoccupied, Jonathan walks alone past assistants\n          and execs. In his eyes a sense of paranoia, a mistrust of\n          every strange face.\n\n          INT. A CONFERENCE ROOM - NIGHT\n\n          Isolated behind yet another wall of glass, Jonathan just\n          stares bleary-eyed at his laptop, unable to work.\n\n          EXT. CLUTE NICHOLS BUILDING - NIGHT\n\n          Jonathan exits, starts toward the sidewalk -- but hears\n          something: sandpaper SHUFFLE of shoes on pavement. Be spins     --\n          No one there. Just one of many large stone pillars adorning\n          the building. Jonathan peers anxiously at the pillar,\n          wavering. He steps closer, trying to glimpse behind it -\n          RING! of his cell-phone breaks the stillness. RING... RING...\n          He catches his breath, quickly picks up. A silent beat.\n\n          A WOMAN'S VOICE                                                 (O.S.)\n          Are you free tonight?... Hello?\n          He hangs up, chilled. Turns again to the pillar, steps closer\n          - no sound. He hesitates... then turns and walks off.\n\n          INT. TIMES SQUARE SUBWAY STATION - NIGHT\n\n          People heading home from work. Jonathan among them, utterly\n          desolate. Sliding his MetroCard, he suddenly feels watched\n          again. He spins, peers anxiously behind him. Only strange\n          faces passing through turnstiles.\n\n          INT. SUBWAY STATION - CORRIDOR\n\n          A narrow, curved stretch of grimy walls of ads and graffiti.\n          Jonathan keeps a quick pace, feeling vulnerable.\n          We lag back, following him from an ANONYMOUS POV; glance up\n          at a sign for stairs to the N & R trains.\n\n          INT. SUBWAY PLATFORM\n\n          Jonathan is waiting for his train, eyes nervously glancing\n          around, still feeling watched -\n          When he sees a young woman standing all the way across on the\n          opposite platform, waiting for a train. She casually turns\n          her head, and Jonathan's eyes go wide...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          80.\n\n          CONTINUED:\n          It's \"S.\"\n          Jonathan just gapes across the divide of two subway tracks;\n          he can't believe he's seeing her again...\n          . when she starts to back away, almost as if she might run.\n          Confused, Jonathan rushes to the edge of his platform.\n\n          JONATHAN\n          wait! Wait, right there!\n          Jonathan stands on the edge reeling, desperate to get,to her.\n          He looks around, hears the distant: .nimble of afar. off train,\n          and suddenly he does something we'd have never thought him\n          capable of: he jumps onto the tracks!\n          He lands hard, nearly breaking his ankle, but quickly\n          scrambles to his feet, splashing in the sludge between rails,\n          eyes darting along the track, anxious to avoid the third\n          rail, ears attuned to the sound of that distant train as he\n          races for\n\n          THE CENTER DIVIDER\n          He reaches the grimy rungs and quickly climbs up.\n          He gets to his feet on the center divider - now only one lane\n          of track separating him from the platform she was standing on\n          - only she's no longer there?\n          He scans the people waiting, no sign of \"S\" among them - and\n          then suddenly he spots her, heading for the exits.\n\n          JONATHAN\n\n          STOP!\n          She glances back, utterly stunned to find Jonathan standing\n          on the center divider, feet soaked in muck.\n          Neither speaks for a moment, just staring at each other\n          across the solitary track. Then:\n\n          JONATHAN\n          I thought you were dead!\n          She looks like she wants to say something, but doesn't. And\n          all at once he's hit with a crushing realization:\n\n          JONATHAN\n          You are in on this, aren't you?!\n          She holds his eyes a moment longer, fighting back emotion -\n          then she abruptly turns and starts back for the exit again.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          81.\n\n          CONTINUED:\n\n          JONATHAN\n          How do you know him?\n          (off her silence)\n          Damn it answer me!\n          She halts, slowly looks back at him.\n          of camâ\u0080\u009e\n          Through the club. He caught me trying to\n          steal his wallet.\n          Jonathan looks confused; she's struggling to stay composed\n          but looks like she could break down at any moment.\n\n          â\u0080\u009eSâ\u0080\u009e\n          He asked if I wanted to make some real\n          money. All I had to do was get involved\n          with you, and not ask any questions.\n          Jonathan just stares, devastated.\n\n          JONATHAN\n          So everything between us - was nothing?\n          She fights back tears.\n\n          ., S\n          No - no... After that first night I tried\n          to call it off, he said he'd kill me if I\n          didn't go through with it.\n\n          JONATHAN\n          Go through with what?\n\n          â\u0080\u009eC,.\n          The plan. Get you out of the hotel room,\n          slip out and meet up later for my money.\n          Only I ran instead. He's been looking for\n          me ever since. I have to leave the city -\n\n          JONATHAN\n          Then why didn't you?\n\n          SÂ\u0080\u008e\n          Because I needed to see you again. I\n          needed to be sure you were all right.\n          Despite his conflicting emotions, Jonathan is moved          by   this.\n          S,f\n          I didn't know how to find you - you were\n          just a number in a cell phone, and\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          82.\n\n          CONTINUED:\n          'is\"                                                             (CONT-D)\n          Jonathan had taken that. I remembered you\n          took this train -\n\n          JONATHAN\n          Wait, Jonathan? I'm Jonathan. Jonathan\n          Messer.\n          You're                                                           -?\n          O.S. we hear the approaching roar of an INCOMING TRAIN...\n          ii S                                                             7f\n          Did you go to the police?\n\n          JONATHAN\n          I can't. He's framing me for murder.\n          What?\n\n          JONATHAN\n          He killed a woman from the club, someone\n          I'd been with.\n          \"S\" is shocked., instantly terrified. Clearly she had no idea.\n          I/ S$f\n          Jonathan, you have to leave! Do you\n          understand? You need to get the hell out\n          of here, he's going to kill you!\n          The roar of the incoming train is growing LOUDER...\n          Don't you understand? He's going to kill -\n          - when the INCOMING TRAIN completely drowns him out... and\n          swipes \"S\" out of Jonathan's view.\n          Jonathan struggles to peer through the train windows but its\n          passengers prevent him from getting a look at her. Just then\n          the TRAIN DOORS OPEN WITH THE NOISE of passengers getting on\n          and off. Panicked, Jonathan cranes his neck, trying to see\n          her through the windows.\n\n          JONATHAN\n\n          STOP!\n          He boards the train; using it as a bridge, he pushes through\n          passengers, desperate for an open door to the other side.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          83.\n\n          CONTINUED:\n\n          CONDUCTOR (O.S.)\n          Shuttle to New York's Grand Central\n          Station. Grand Central is next.\n          He jumps off the train, in the direction she'd been walking\n          -- only she's nowhere in sight. Jonathan spins frantically as\n          the doors close and he hears the TRAIN START TO PULL AWAY.\n          He runs alongside the train - desperately searching for a\n          glimpse of her                                                  - no sign of her in any of the windows...\n          .until the last car passes                                      - and there she is, standing at\n          the rear observation window, her hand pressed to the pane,\n          her tearful expression bidding him a heartbreaking goodbye.\n          He stumbles to a devastated halt, eyes pleading vainly as he\n          watches her recede, framed by the rectangle of window,\n          directly beneath it the train's steel. exterior labelled the\n          shuttle line's circled black and white S.\n\n          INT. GRAND CENTRAL STATION - MAIN CONCOURSE - LATE NIGHT\n\n          TILT DOWN FROM THE CONSTELLATIONS of the vaulted ceiling to\n          the tiny figure of \"S,\" standing at the ticket counter,\n          staring uneasily through bars at a TICKET AGENT.\n\n          TICKET AGENT\n          Let's see - there's one to New Haven,\n          leaving in... six minutes. If you need to\n          go farther, you can transfer from there.\n          \"S\" peers anxiously around her, like someone hunted.\n\n          #; SIT\n          And that's the very next train leaving?\n\n          INT. METRO-NORTH TRAIN                                          (IDLING IN THE TERMINAL)\n\n          Only a few scattered travellers this late. \"S\" slumps into a\n          seat, takes a breath - and starts to quietly break down. She\n          shuts her eyes, tries to stifle her sobbing.\n          A man's hand extends a handkerchief from the seat behind her.\n\n          â\u0080\u009eSâ\u0080\u009e\n          No thank you.\n          RACK FOCUS on the man withdrawing his handkerchief behind\n          her, grinning coolly to himself: it's-Wyatt.\n\n          WYATT\n          Suit yourself.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          84.\n\n          CONTINUED:\n          RACK BACK TO \"S\" as her eyes blink open in terror --\n\n          SMASH CUT TO:\n\n          INT. JONATHAN'S BUILDING - MAILBOXES - LATE NIGHT\n\n          Jonathan yanks open his mailbox. Empty. As he heads upstairs,\n          there's a change in his face: a newly forged determination.\n          He takes out his cell phone, dials. The other end immediately\n          picks up:\n\n          COMPUVOICE                                                      (O.S.)\n\n          WORTH-AND-BERMAN-VOICE-MAIL-BOX-FOR-\n\n          JONATHAN'S VOICE                                                (O.S.)\n          Jonathan Messerâ\u0080\u0094\n          Jonathan hangs up. Takes an angry breath. Presses redial.\n\n          COMPUVOICE                                                      (O.S.)\n\n          WORTH-AND-BERMAN-VOICE-MAIL-BOX-\n          He hangs up again. But his face bears a blank, eerily driven\n          expression. He hits redial again as he opens the door to\n\n          INT. JONATHAN'S APARTMENT\n\n          Jonathan enters, phone still to his ear.\n\n          COMPUVOICE                                                      (O.S.)\n\n          WORTH-AND-BERMAN-VOICE-\n          Jonathan hangs up and just stares at the phone in his hand,\n          on the verge of something like a scream. He takes a breath.\n          Presses redial once more. Only now it RINGS. Jonathan\n          freezes. RING... RING... RING... RING... RING -- a CLICK of\n          someone picking up, then SILENCE and faint wisps of static.\n\n          JONATHAN\n          Hello...?\n          Not a word from the other end. We barely make out BREATHING.\n\n          JONATHAN\n          Wyatt? Is that you?\n          Jonathan takes a tentative step forward, as if fearful that\n          the least movement will cost him this connection.\n\n          JONATHAN\n          Say something damn it!\n          From the receiver we hear a well-exhaled breath. And then:\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          85\n\n          CONTINUED:\n\n          WYATT'S VOICE                                                   (O.S.)\n          (sung in a low whisper)\n          Yesterday...\n          Reeling, Jonathan grips the phone tighter to his ear.\n\n          WYATT'S VOICE                                                   (O.S.)\n          All my troubles seemed so far away...\n\n          JONATHAN\n          What do you want from me?\n\n          WYATT'S VOICE                                                   (O.S.)\n          Now it seems as though -\n\n          JONATHAN\n          Answer me!\n\n          WYATT'S VOICE                                                   (O.S.)\n          - they're here to stay, Oh I believe\n\n          JONATHAN\n          Why are you doing this to me?!\n\n          WYATT'S VOICE                                                   (O.S.)\n          - in yester--\n\n          JONATHAN\n          I'm going to find you, you hear me? I'm-\n          CLICK. Dead air.\n\n          JONATHAN\n          Hello?... Hello?!\n          Jonathan SLAMS the phone down, tension in his face joined by\n          a new emotion, something closer to. fury.\n\n          JONATHAN\n          I'm going to find you.\n\n          EXT. MIDTOWN MANHATTAN - STREET - DAY\n\n          Jonathan is heading for the Clute Nichols building, that same\n          focused tension on his face -\n\n          WOMAN'S VOICE\n          Mr. Messer?\n          Jonathan is too lost in thought to hear it.\n\n          WOMAN'S VOICE                                                   (CONT'D)\n          Jonathan.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          86\n\n          CONTINUED:\n          He glances up... to find Russo standing near the entryway -\n          what's she doing here? He has no choice but to meet her.\n\n          RUSSO\n          I was gonna call, but I was in the area.\n          Just doing some follow-up.\n          Jonathan tries to mask his uneasiness.\n\n          JONATHAN\n          Follow-up?\n\n          RUSSO\n          On that missing girl of yours. The.one\n          whose name began with. an \"S.\" Have any\n          luck finding her?\n          Jonathan absently tightens his grasp on his briefcase.\n\n          JONATHAN\n          No. No luck.\n\n          RUSSO\n          I see. That's too bad.\n          she studies him a cryptic beat, then smiles flatly.\n\n          RUSSO\n          Well, who knows, maybe she'll turn up yet.\n          You have a good day, Mr. Messer.\n          Jonathan nods tensely, then walks off, feeling her watching\n          him from the curb as he goes.\n\n          INT. CLUTE NICHOLS - CONFERENCE ROOM - DAY\n\n          Employees pass by the glass behind which we see Jonathan - a\n          lone figure at his laptop, surrounded by files and post-its.\n          Close on Jonathan as he scribbles on a post-it: \"Yesterday -\n          Beatles?\" Widen to find the post-its organized with his usual\n          fastidiousness                                                  - only scribbled with words, not numbers:\n          \"Wyatt Bose = William Bansky\" and other random scribblings.\n          He's trying to apply his mathematical mind to his crisis,\n          hoping to conjure some kind of pattern or logic to it all.\n          Reverse angle through the glass: to anyone passing, he looks\n          like your typical overly meticulous, isolated auditor.\n          Closer on Jonathan as he clutches the table, looks seconds\n          away from utterly losing it -- when something suddenly occurs\n          to him. He whips around, gaze fixing on\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          87\n\n          CONTINUED:\n          His cell phone. He grabs it. Presses a key repeatedly -\n          scanning                                                        - then hits SEND. Jonathan brings the phone to his\n          ear, listens for the other end; then:\n\n          JONATHAN\n          Are you free tonight?\n\n          CUT TO:\n\n          INT. THE KITANO HOTEL - LOBBY - NIGHT\n\n          Jonathan waits anxiously by a Botero sculpture of a rotund\n          dog. A young woman in a BLUE PASHMINA approaches.\n\n          INT. THE KITANO - ELEVATOR\n\n          Blue Pashmina enters first, Jonathan follows her into an\n          empty elevator. The doors close.\n\n          JONATHAN\n          Do you know Wyatt Bose?\n\n          BLUE PASHMINA\n          (immediately guarded)\n          Excuse me?\n\n          JONATHAN\n          What about William Bansky? Does that name--\n          She darts.for the \"Door Open\" button, but he blocks her path.\n\n          BLUE PASHMINA\n          I swear to God I'll scream.\n\n          JONATHAN\n          Please, I'm not trying to scare you, I\n          just                                                            -- I'm looking for someone.and it's\n          very important that I find him.\n          she tries to push past him, again Jonathan blocks her.\n\n          JONATHAN\n          He does this too - or he did. someone had\n          to give him the numbers. Someone let him\n          in. If I can-'find who it was that knew\n          him, they might know where he's                                 --\n          she suddenly kicks him in the shin with a spiked heel.\n          Jonathan grasps his leg - she presses the button and is out\n          the opening doors before he's even looked up.\n          SOUND ADVANCE: TENSE CLACKING of computer keys...\n\n          \n\n          \n\n          \n\n          \n\n          88.\n\n          INT. CLUTE NICHOLS                                               - CONFERENCE ROOM - SAME NIGHT\n\n          CLOSE ON JONATHAN alone at the end of the conference table,\n          eyes scanning files absently, fingers typing on auto-pilot.\n          His gaze holds a new determination, as the CLACKING OF KEYS\n\n          SET THE RHYTHM FOR A BRIEF MONTAGE-\n\n          INT. HOTEL CASABLANCA - LOBBY - LATER\n\n          Jonathan anxiously escorts ANOTHER YOUNG WOMAN past the quasi-\n          Moroccan motif. Asking her something, he takes out a folded\n          paper from his pocket, shows it to her: it's the photocopy of\n          Bansky's license with the image of Wyatt's face. She quickly\n          shakes her head, her eyes searching for the exit.\n\n          INT. THE LOMBARDY - BAR - NIGHT\n\n          Jonathan trails a TALL WOMAN as she bee-lines for the exit.\n          He grabs her arm, thrusts the photocopy into her hands. She\n          halts, looks up at him... and tears it in two before handing\n          it back and hurrying off, her glare full of paranoia.\n\n          TNT. THE SHERRY-NETHERLAND - LOBBY - NIGHT\n          Jonathan rises from a couch to greet YET ANOTHER YOUNG WOMAN.\n          He gets no more than a few seconds into his question when she\n          about-faces without a word. Jonathan has a relentless look in\n          his eye. Takes out his cell, calls another number...\n\n          INT. VARIOUS HOTELS - LOBBY COUCHES - NIGHT\n\n          Rapid jump cuts of A DOZEN DIFFERENT WOMEN'S FACES, all\n          indicating twenty different kinds of \"no\"; with each cut the\n          women occupy the exact same position in frame, only their\n          faces and the hotel backgrounds behind them change.\n\n          INT. THE MICHELANGELO - ELEVATOR - NIGHT\n\n          Room key in hand, Jonathan rides up with a woman in a BLACK\n          BUSINESS SUIT - a tall, attractive business-type. Jonathan\n          stares at his shoes, trying to mask his. utter exhaustion.\n\n          INT. THE MICHELANGELO - A ROOM - NIGHT\n\n          Jonathan and Black Business Suit come in. She starts to\n\n          UNDRESS:\n\n          JONATHAN\n          I need to ask you something, it's\n          incredibly important...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          89.\n\n          CONTINUED:\n          He pauses to unfold his now scotch-taped photocopy, shows it\n          to her. She freezes, eyes fixed on the license photo.\n          Jonathan braces himself for her departure                       - when she stares\n          back up at him in scared but clear recognition.\n\n          SAME SCENE - MOMENTS LATER\n          Seated on the edge of the made bed, Black Business Suit\n          shifts uncomfortably as she lights a cigarette.\n\n          BLACK BUSINESS SUIT\n          I was in Chicago on business, a little\n          over a year ago. I was out.to dinner with\n          one of our Chicago partners,.a man named\n          Holloway. That's how I met him.\n          TIGHT ON JONATHAN as we SMASH TO:\n\n          INT. EXPENSIVE CHICAGO RESTAURANT - NIGHT\n\n          A slightly older man                                            (HOLLOWAY) sits with his back to us.\n          Across from him sits Black Business Suit. A YOUNGER MAN steps\n          into frame, rests his hand on Holloway's shoulder.\n\n          BLACK BUSINESS SUIT                                             (V.0.)\n          At first I assumed he was a junior\n          executive at their firm. But he wasn't.\n          That's not to say he didn't work for\n          Holloway, but clearly in a more intimate\n          capacity...\n\n          TNT. THE MICHELANGELO - ROOM - NIGHT\n          Black Business Suit takes a cool drag on her cigarette.\n\n          BLACK BUSINESS SUIT\n          I wasn't shocked. Besides, obviously I'm\n          no prude. Even back then, I'd been doing -\n          you know, this thing -- for a while.\n\n          INT. EXPENSIVE CHICAGO RESTAURANT - NIGHT\n\n          Wyatt is talking, entertaining his two companions - but\n          clearly more focused on Black Business Suit, flirting it up.\n\n          BLACK BUSINESS SUIT                                             (V.0.)\n          I was simply curious. More so when he\n          apologized, explaining that he'd forgotten\n          about another engagement.\n          Wyatt's knuckles just barely stroke Black Business Suit's\n          thigh as he rises to leave. They exchange a knowing glance...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          90.\n\n          CONTINUED:\n\n          BACK TO MICHELANGELO ROOM\n\n          BLACK BUSINESS SUIT\n          I was intrigued. He was intelligent,\n          informed about everything from law to art\n          to politics. I'd never met anyone so in\n          command of his own charm. He said that\n          he'd come from nothing, that everything he\n          learned, he learned from his tricks. He\n          claimed that Holloway was even grooming\n          him for a position at his company.\n          She lights another cigarette with her old one.\n\n          BLACK BUSINESS SUIT\n          In a way, I felt for him. But I also\n          admired him. It sounds silly,. but he had a\n          way of making me feel - close to him, you\n          know?\n          This clearly hits home with Jonathan. He barely nods.\n\n          BLACK BUSINESS SUIT\n          So I found myself telling him things..\n          Personal things. And, next thing I knew -\n\n          JONATHAN\n          You told him. About this.\n          A beat, and she nods, crushing out her other cigarette.\n\n          BLACK BUSINESS SUIT\n          He seemed fascinated by it. Wanted to know\n          all the details.\n\n          (EXHALES)\n          I suppose I'd had too much to drink. And I\n          was distracted... I was thinking about\n          what a great lay he was going to be.\n\n          INT. FOUR SEASONS CHICAGO -.SUITE BEDROOM - LATE NIGHT\n\n          Wyatt and Black Business Suit go at it with animal\n          aggression. She's on all fours, arching lustily, pleasure\n          nearly unbearable, eyes clenched shut as she climaxes.\n          Exhausted, her body goes limp.\n          TILT UP to his face: an eerily blank, driven stare, devoid of\n          real pleasure. She struggles, tries to protest - when his\n          hands grip her shoulder blades, thrusting harder, violently\n          pinning her down, her sudden fear stifled by the mattress --\n\n          INT. THE MICHELANGELO - ROOM - NIGHT\n\n          CLOSE ON Black Business Suit staring off, chilled by memory.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          91.\n\n          CONTINUED:\n\n          BLACK BUSINESS SUIT\n          Only afterwards I discovered two of my\n          credit cards were missing. As was my cell\n          phone. Of course I couldn't say anything\n          to Holloway. And Jamie must have known I'd\n          never report it to the police.\n\n          (BEAT)\n          So I just put the incident out of my mind.\n          I all but forgot about it, until one\n          night, maybe two months ago -\n\n          INT. THE WARWICK (NYC)                                         - LOBBY - NIGHT\n\n          Black Business Suit is crossing the lobby for a portrait of\n          Hearst and A SUITED MAN lingering beneath it... when the man\n          looks up. It's Wyatt.\n\n          BLACK BUSINESS SUIT                                            (V.0.)\n          I almost didn't recognize him. But when I\n          did, I suddenly felt very, very scared.\n          She freezes -- obscured by one of the trees as Wyatt checks\n          his watch, scans-the lobby with a cool, piercing look.\n\n          BACK TO BLACK BUSINESS SUIT AND JONATHAN IN THE MICHELANGELO\n\n          BLACK BUSINESS SUIT\n          I left before he saw me.\n          She drags on her cigarette, looks off into space.\n\n          BLACK BUSINESS SUIT\n          He must have used my cell phone to get\n          into the group.\n          (crushes out her cigarette)\n          Anyway, that's it. That's all I know.\n          She looks around. At the room, the bed. She shudders, rises.\n\n          JONATHAN\n          Wait - thank you.\n          (off her look)\n          Have you ever run into him again?\n\n          BLACK BUSINESS SUIT\n          Getz? No. And I don't ever want to.\n\n          JONATHAN\n          Getz?\n\n          BLACK BUSINESS SUIT\n          That was his name. Jamie Getz.\n\n          \n\n          \n\n          \n\n          \n\n          92.\n\n          EXT. FLEUR DE SOLANGE - NIGHT\n\n          Bundled in her ski jacket, Solange is closing up her shop for\n          the night, stacks of flowers in her arms, when she notices\n          Jonathan coming down the front steps.\n\n          SOLANGE\n          Jonathan, you're home early -\n          Only when he looks up, she finds the young man in the\n          overcoat isn't Jonathan. It's Wyatt.\n\n          SOLANGE\n          Oh - je suis desole. My mistake.\n          Wyatt flashes her an icy smile, continues down the steps.\n          Solange watches him walk away, a puzzled look on her face.\n\n          INT. MICHELANGELO - HOTEL BUSINESS CENTER - NIGHT\n\n          Huddled over a computer, Jonathan typing, eyes red from\n          exhaustion and stress as we hear his recall:\n\n          JONATHAN (V.0.)\n          who's James Getz?\n\n          WYATT (V.0.)\n          A guy I roomed with freshman year at\n          Princeton.\n          on Jonathan's monitor we see he's on a web site for Princeton\n          University alumni. He types in: Getz, James.\n          A beat - then: \"No match.\" A long list of G names follows.\n          Jonathan scrolls down the list, but there's no Getz.\n\n          JONATHAN\n          Shit.\n          Jonathan exhales, about to log off - when a name among the\n          H's jumps out at him: Holloway. Reed.\n          Jonathan stares at it tensely - then clicks on the name.\n          \"Sort no contact information available.\"\n          Jonathan thinks a moment - then tries a search engine, types:\n          \"Holloway Reed\" then decides to add the word \"missing.\"\n          An article appears. From the Chicago Tribune: \"BODY OF\n          MISSING BUSINESSMAN FINALLY DISCOVERED.\" A head-shot style\n          photograph shows a man in his early 40s whom we recognize\n          from Black Business Suit's story. Beneath his photo, his\n          name: \"Reed Holloway.\"\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          93\n\n          CONTINUED:\n          Jonathan glances up at the Hotel employee manning the desk.\n\n          JONATHAN\n          Can I print this out?\n\n          EXT. EIGHTH AVENUE                                              (HELL'S KITCHEN)   - LATE NIGHT\n\n          Porn shops and prostitutes, the streets pulsing with a\n          sinister energy. Jonathan is pacing toward the subway,\n          reading over the printed article.\n\n          EXT. BROOKLYN - ELEVATED SUBWAY PLATFORM - LATE NIGHT\n\n          Jonathan descends the steps to his presently deserted\n          neighborhood. O.S. the departure of the subway train is\n          joined by the distant.wail of SIRENS.\n          Jonathan continues down the block, then pauses. He wrinkles\n          his nose, smelling something. He looks up: two blocks away, a\n          thick plume of smoke is billowing up into the sky --\n\n          EXT. JONATHAN'S DUPLEX\n\n          Jonathan bolts around the corner to find an ambulance and\n          fire engine curbside -- a fire raging in the lower story of\n          his building!\n          Running toward the blaze, he speeds past a BLACK BMW parked\n          across the street, engine running. It suddenly shifts into\n          gear and peels out in a fast turn. Jonathan spins               - something\n          about it troubling him - but the BMW is already gone. He\n          continues racing toward his building...\n          The neon \"FLEURS DE SOLANGE\" sign crackles and sparks in the\n          flame. Through blown out windows, piles of burning flowers\n          emit what must be an awful stench.\n          Two EMS WORKERS are loading a gurney on which Solange lays,\n          burned and half-aware, but alive, when Jonathan rushes over.\n          She manages to open her eyes, her voice barely audible:\n\n          SOLANGE\n          Jonathan...\n          He squeezes her hand as she's lifted into the ambulance.\n\n          JONATHAN'\n          (to EMS worker)\n          Is she going to be okay?\n\n          EMS WORKER\n          Yeah, she'll make it.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          94.\n\n          CONTINUED:\n          The ambulance doors SLAM shut. A hand grabs Jonathan's arm.\n          He spins                                                        - it's a FIRE WORKER.\n\n          JONATHAN\n          I live here.\n\n          INT. JONATHAN'S APARTMENT - LATER\n\n          Thick smoke clouds the stairs and corridor. Suit jacket over\n          his head, Jonathan is hurriedly escorted by the Fire Worker.\n          His own door has already been kicked open, splintered at its\n          hinges. The place looks like it's been turned upside down,\n          furniture soaking wet, charred areas on walls.\n\n          FIRE WORKER\n          Lucky we were able to contain it somewhat.\n          Better get your valuables together.\n\n          INT. JONATHAN'S BEDROOM\n\n          still in shock, he tosses random clothes in a gym bag - \"Duck\n          on Bike\" too.\n\n          JONATHAN\n          (calls out)\n          How did it start?\n\n          FIRE WORKER (O.S.)\n          We're not sure. Maybe a bad fuse.\n\n          INT. JONATHAN'S BATHROOM\n\n          Jonathan opens his medicine cabinet, takes out his small film\n          cannister, uncaps it to see how much money he has left. Not\n          very much. He stuffs the cannister into his pants pocket.\n\n          INT. SPARE BEDROOM\n\n          Jonathan opens his old gunmetal-gray filing cabinet, then\n          pops open his briefcase, trying to decide what to take.\n          He finds a file marked \"Bank Statements,\" pulls it, about to\n          toss it in his briefcase - when he stops, something about its\n          contents ---\n          CLOSE ON THE FILE. Stuffed with paper. But not bank\n          statements... Copies and copies of photographs of Jonathan\n          with Simone Forester. Some we've seen, some new.\n          Jonathan hunts through more files, his breathless nausea\n          telling us the contents of each and every file have been\n          swapped out with photos.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          95.\n\n          CONTINUED:\n          He opens another at random - and freezes: it's a photo of\n          Jonathan and \"S\" walking in Chinatown. He scans through\n          others, shots of them in the restaurant, entering the Hotel\n          Lotus...\n          TIGHT ON JONATHAN, terrified by the horrific implication -\n\n          FIRE WORKER                                                     (O.S.)\n          Mr. Messer?\n          Jonathan gasps as he looks up to find the Fire Worker in the\n          doorway. He quickly shuts the file.\n\n          JONATHAN\n          Just                                                            - give me a minute.\n\n          INT. JONATHAN'S APARTMENT - LIVING ROOM\n\n          A paranoid-looking Jonathan returns with a briefcase stuffed\n          near to bursting. The tired Fire Worker looks up impatiently.\n\n          FIRE WORKER\n          That everything?\n          Jonathan regards his minimal possessions, realizes how little\n          evidence there is of a life. A wrenching sense of isolation.\n\n          JONATHAN\n          I guess it is.\n\n          FIRE WORKER\n          You got someone you can stay with?\n\n          INT. A SEEDY HOTEL LOBBY - DOWNTOWN - PRE-DAWN\n\n          The sort of decrepit no-tell motel frequented by hookers and\n          junkies. Jonathan clutches his briefcase as he stares through\n          steel mesh at. the NIGHT CLERK.\n\n          NIGHT CLERK\n          It's fifty for the night.\n          Jonathan fishes out his film cannister, and parts with what\n          he discovers are his last three                                 $20s.\n\n          INT. SEEDY HOTEL - ROOM - PRE-DAWN\n\n          Even more depressing than the lobby: bars on the windows,\n          stains on the thin walls through which the faint sounds of\n          paid sex bleed in. Somewhere a bottle smashes.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          96.\n\n          CONTINUED:\n          Unable to sleep, Jonathan has emptied his briefcase contents\n          onto the bed. He stares at one of Wyatt's photos of him and\n          \"S.\" She's smiling up at him.\n          EXTREME CLOSE ON THE IMAGE OF HER FACE. The smile, frozen in\n          time, at once haunting and heartbreaking.\n          He gently sets the photo down beside the Chicago Tribune\n          article he'd printed on the unsolved murder of Reed Holloway\n          (\"BODY OF MISSING BUSINESSMAN FINALLY DISCOVERED\"). His eyes\n          drift to the article, and something suddenly occurs to him -\n          FLASH ON: THE PHOTOGRAPH IN \"WYATT'S.BROWNSTONE\" of Wyatt\n          with bleached hair styled in a loose spike --\n          IN THE ARTICLE'S PHOTO, Holloway sports an almost identical\n          look.-His eyes move to the date of the article: \"May 17.\"\n\n          CUT TO:\n          Jonathan on the phone, a business card in hand.\n\n          OFFICE ON PHONE\n          Boston Police, how can I direct your call?\n          Jonathan reads off the card Detective Russo had given him:\n\n          JONATHAN\n                                                                                                      This is Detective Russo, NYPD, badge\n          number 274655.                                                                                                                     1   just need some\n                                                                         information from you guys.\n          Jonathan sits in suspense, awaiting a response. Finally -\n\n          OFFICER ON PHONE\n          Well?\n\n          JONATHAN\n          You've got a case, a missing person named\n          William Bansky. I'm wondering if you can\n          tell me the date he was last seen?\n\n          OFFICER ON PHONE\n          Hold a sec.\n\n          (PAUSE)\n          Bansky, William, last seen... May                              17.\n          Jonathan's eyes return to the Holloway article                 (\"BODY OF\n          MISSING BUSINESSMAN FINALLY DISCOVERED:), dated \"May 17.\"\n\n          OFFICER ON PHONE\n          Anything else you-\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          97\n\n          CONTINUED:\n\n          JONATHAN\n          That's it, thanks.\n          Jonathan quickly hangs up, equally encouraged and chilled by\n          the connection he's made.\n          TILT DOWN to a post-it, on which he's scribbled: \"BOSE =\n          BANSKY = HOLLOWAY.\" To this he adds: \"= JAMES GETZ\"\n\n          INT. CHASE MANHATTAN BANK - MORNING\n\n          A line of customers stare mutely up at plasma tv screens\n          above - except for Jonathan, unshaven, suit wrinkled, face\n          all anxious tension.\n\n          SAME - TELLER'S WINDOW - MOMENTS LATER\n          Jonathan slides his passport through the window's metal tray,\n          to the TELLER                                                   (40s) working behind three inches of glass. The\n          Teller examines the passport, then slides it back.\n\n          TELLER\n          M'kay, if you'll just swipe your ATM card.\n          She gestures to a small punch pad to Jonathan's right.\n\n          JONATHAN\n          Actually, my card was stolen.\n\n          TELLER\n          Mmm'kay... do you see those two taupe\n          colored telephones over there? Just pick\n          up either one and you'll be connected with\n          our automated system.\n\n          JONATHAN\n          The thing is, I already used your\n          automated system and...look, this\n          passport's all I have left, it's the only\n          thing proves who I am and now I'm down to\n          like my last ten dollars here, so...\n          Jonathan's cool is cracking. The Teller wrinkles her brow.\n\n          TELLER\n          Mm'kay, if you press \"0\" on either phone?\n          A customer service representative will -\n\n          JONATHAN\n          Give me a goddamn break.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          98.\n\n          CONTINUED:\n\n          TELLER\n          Sir, there's no need for profanity.\n\n          JONATHAN\n          (loses it)\n          Oh no? In the last few days I've seen a\n          woman I thought might be dead turn up\n          alive and a woman I assumed was alive turn\n          up dead, both at the hands of a guy about\n          whom everything I know is apparently a\n          lie. I've had my building set on fire, my\n          neighbor nearly killed, and my apartment\n          ransacked. So please forgive my language,\n          but it's been one fuck of a week.\n          The stunned Teller stares back at him slack-jawed.\n\n          JONATHAN\n          Look, I know I'm just another face on this\n          side of the glass, I get that. But I'm\n          begging you, as one human being to\n          another, please let me into your life just\n          long enough to help me out here. Please.\n          The Teller stares back at him a beat - and nods.\n          She starts quickly typing into her monitor, finally looks up.\n\n          TELLER\n          I'm showing that card as having been sent\n          out four days ago. It definitely went out.\n          We even heeded the change of address\n          request.\n\n          JONATHAN\n          Well, like I                                                    -- wait, what request?\n\n          TELLER\n          Apparently you informed the bank of an\n          address change?\n          She swivels her monitor so he can see.\n\n          TELLER\n          Mr. Jonathan Messer,                                            140                      E.   91st Street -\n\n          EXT. BANK - DAY\n\n          AS SEEN FROM THE CONVEX MIRROR OF AN ATM MACHINE: we watch\n          from an ANONYMOUS POV Jonathan racing out of the bank.\n\n          \n\n          \n\n          \n\n          \n\n          99.\n\n          EXT.                                                                  91ST STREET\n\n                                                                                                                                          Jonathan rounds the corner at a jog, checking awning numbers,\n                                                                                              finally halts on one: \"140             E.   91st.\"\n\n          INT.                                                            140   E.            91ST                         - LOBBY\n\n          We recognize the DOORMAN in the midst of fielding a complaint\n          by an ELDERLY TENANT with a yappy dog. Jonathan hurries to\n          the elevators, unnoticed.\n\n          INT.                                                            140   E.            91ST -- HALLWAY\n\n          Jonathan emerges from an elevator. The last door on the left.\n          Jonathan tries the doorknob. It's locked. Jonathan checks\n          under the mat. Sure enough, there's a key.\n\n          INT. THE APARTMENT\n\n          Utterly bare. Empty walls, expensive views, polished wood\n          floors. Jonathan takes a wary step inside, leaning to peer\n          around the corners.\n          He paces cautiously through the living room. The dining area.\n          The glistening chrome and granite kitchen.\n\n          THE BEDROOM\n          A room as empty as the others - with the exception of a small\n          pile of envelopes beneath a window in a far corner. Jonathan\n          slowly nears...to find it's a stack of mail. He picks up an\n          envelope -- O.S. the CREAK of a door hinge.\n          Jonathan whips around -- no one behind him. He steps out of\n          the room to investigate.\n          We remain alone in the empty room an excruciating beat...\n          .until Jonathan finally steps back in, only slightly at\n          ease. He returns to the stack of mail, picks up an envelope.\n          He reads: \"Mr. Jonathan Messer 140 E.                           91    St...\"\n          Eyes wide, he hurriedly flips through the rest of the mail -\n          all addressed to him at this address.\n          Jonathan still staring at this mail in disbelief, when he\n          finds at the bottom of the stack: another PHOTOGRAPH. It's of\n          \"S\" standing fearfully on the subwa latform across the\n          track from Jonathan. And suddenly Jonathan is gripped with\n          fear, unaware of a blurred, nearing intruder...\n\n          WYATT\n          Long time no see.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          100.\n\n          CONTINUED:\n          Jonathan spins round, Wyatt's standing there with a gun. It's\n          pointing directly at Jonathan.\n\n          WYATT\n          I have some instructions. Follow them and\n          I might let her live.\n\n          JONATHAN\n          Where is she?\n\n          WYATT\n          This should've been simpler. I frame you,\n          you panic...\n\n          JONATHAN\n          Where is she?!\n          A terrifying silence - Jonathan erupts:\n\n          JONATHAN\n          Goddamn it tell me what you did to--\n\n          WYATT\n          Press pause on the questions and listen.\n          The brokerage firm you're auditing is\n          Clute Nichols. As a standard part of that\n          audit you're temporarily privy to all\n          client accounts as well as access codes\n          required for transactions. At                                   11                              p.m.\n          tonight you're going to skim from those\n          accounts a total of                                             $200 million and\n          transfer that money to an account I've\n          established overseas.\n\n          JONATHAN\n          I can't                                                         - I have no idea how to even-\n\n          WYATT\n          I know you don't. But I do. Your passport.\n          (brandishes the gun)\n          Now, please.\n          Jonathan takes it out and tosses it to him. Wyatt catches it.\n          And hands Jonathan an ENVELOPE.\n\n          WYATT\n          It's all in there.                                              11                              pm tonight. Their\n                                                                          banks will just be opening.\n\n          JONATHAN\n          It won't work - they screen for stuff like\n          this. It'll be discovered eventually.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          101.\n\n          CONTINUED:\n\n          WYATT\n          I can live with eventually. I always have.\n\n          JONATHAN\n          This account overseas                                   - it's in my name,\n          isn't it?\n          A moment of tense silence.\n          Jonathan just stares back hard a quiet beat; then:\n\n          JONATHAN\n          Why'd you pick me?\n          Wyatt raises a brow, vaguely amused the question.\n\n          WYATT\n          You answered the ad, Jonathan.\n          (off Jonathan's confusion)\n          \"Feeling all alone out there? Have a great\n          job, fine personality and good looks to\n          match, but no time to.meet that special\n          someone? Help is just a phone call away -\"\n\n          JONATHAN\n          The ad - in Money magazine...\n\n          WYATT\n\n          (GRINS)\n          Told you to block that Caller ID. Of\n          course I had to scope out a whole lot of\n          losers before I hit the jackpot. After\n          all, there only so many Jonathan Messers\n          out there.\n\n          (BEAT)\n          If you screw with me, well - you saw what\n          I did to that Blonde? That's kindness\n          compared to what I'll do to your little\n          .girlfriend. You won't even recognize her\n          when I'm through.\n\n          JONATHAN\n          Why should I believe you? Everything you\n          told me was lies.\n\n          WYATT\n          Not lies, Jonathan. Foreplay. And now...\n          now you're fucked.\n          He grins his 'charming' grin and starts for the door.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          102.\n\n          CONTINUED:\n\n          WYATT\n          Remember: be smart. I'll be watching you.\n          And... feel free to take a shower, looks\n          like you could do with one.\n          The front door slams. Jonathan just stands there, staring\n          shell-shocked at the envelope.\n\n          EXT. STREET - MINUTES LATER\n\n          Jonathan comes out the building putting the envelope in his\n          suit pocket.\n          As he crosses the street a CAR HORN BLARES - WHIP AROUND to\n          find a car barrelling at us. Jonathan dives out of the way an\n          instant before the car would have hit him.\n          Face first in the gutter, scraped and gasping, Jonathan peers\n          up to see Wyatt's BLACK BMW speeding away.\n\n          CUT TO:\n\n          INT. WORTH & BERMAN - AN OFFICE - LATE DAY\n\n          A stiff guy in his late-30s is working in his office when an\n          ASSISTANT enters.\n\n          ASSISTANT\n          Mr. Peterson, one of the audit managers is\n          here to see you. Jonathan Messer?\n\n          PETERSON\n\n          (PUZZLED)\n          Really? Well - okay, bring him back.\n          We follow the assistant out the door, read the name\n          stencilled on the glass \"CHET PETERSON, SENIOR MANAGER.\"\n\n          INT. WORTH & BERMAN - LOBBY\n\n          Through a set of frosted glass doors we see Peterson's\n          Assistant approach a RECEPTIONIST, who gestures across the\n          lobby. The Assistant approaches the sofas, where Jonathan is\n          seated. She addresses him. He rises.\n\n          INT. WORTH & BERMAN - PETERSON'S OFFICE\n\n          Chet Peterson looks up as his door is opened -\n\n          PETERSON\n          Jonathan, good to see you again!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          103.\n\n          CONTINUED:\n          - reverse angle to find a YOUNG MAN we've never seen before.\n\n          YOUNG MAN\n          Actually, I was just looking for Fred\n          Whipple's office?\n\n          PETERSON\n\n          (AWKWARDLY)\n          Next door down.\n          The Young Man ducks out, and now Peterson sees his Assistant\n          approaching, Jonathan a few paces behind her, adjusting his\n          glasses. Peterson reloads his greeting:\n\n          PETERSON\n          Jonathan, good to see you again!\n\n          INT. PETERSON'S OFFICE - MOMENTS LATER\n\n          Close on Chet Peterson, gravely peering across his desk.\n\n          PETERSON\n          Well, I have to say, your resignation\n          comes as something of a surprise. Most of\n          our auditors seem to like the freedom the\n          position affords.\n\n          (CONCERNED)\n          You'll stay on to finish up at Clute\n          Nichols, of course?\n          Track around Peterson to see Jonathan seated across from him,\n          lifting his head to reply - and doing so revealing it's\n\n          \"\n          Wyatt,\" wearing one of Jonathan's suits, hair colored and\n          styled like Jonathan's, even sporting identical eyeglasses.\n          He offers an awkward half-smile, just as Jonathan would.\n\n          WYATT\n          Absolutely.\n\n          PETERSON\n          So do you have any plans?\n\n          WYATT\n          Yes. I'm going to travel. I want to see\n          the world.\n          Peterson nods benignly.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          104.\n\n          A SERIES OF QUICK DISSOLVES/ STOP-MOTION PHOTOGRAPHY:\n          Jonathan sitting in the conference room of Clute Nichols,\n          lettered-boxed by the glass wall through which he watches\n          employees pass in fewer and fewer numbers. Throughout this,\n          Jonathan's blank stare of harrowed tension never changes.\n\n          LAST DISSOLVE TO:\n\n          EXT. MANHATTAN SKYLINE - NIGHT\n\n          Abeautiful shot of the cityscape - accompanied by the sound\n          of fingers clacking on keys...\n\n          INT. CLUTE NICHOLS - CONFERENCE ROOM\n\n          Jonathan seated at the far end of the empty table, typing on\n          his laptop. Beside him is the envelope Wyatt gave him, and\n          its sheet of paper on which instructions are typed.\n          Jonathan peers at the laptop clock. It reads                            10:58   PM.\n          His eyes travel in a tense triangle from instructions, to\n          laptop screen, to glass wall - fingers typing all the while.\n          He finally reaches a prompt: BIENVENUE. POUR ANGLAIS, CBOISEZ P2.\n          We glimpse a small. logo with a SWISS FLAG.\n          Jonathan presses F2. Reads some more, types some more.\n          Finally we read: ENTER SUB-ACCOUNT NUMBER.\n          Jonathan enters more per Wyatt's typed instructions. Reads.\n\n          ENTER DESIGNATED ACCOUNT NUMBER:\n          Jonathan copies the numbers in from the instructions. Waits.\n\n          ENTER SENDER'S 8 DIGIT ACCESS CODE. REQUIRED TO COMPLETE TRANSACTION.\n          His eyes travel to a page atop a Clute Nichols file. We can\n          glimpse an 8 digit code circled in pencil. Jonathan stares at\n          the cursor.on the laptop screen, the icon blinking\n          petulantly. He's about to type...\n          And then he halts. His eyes drifting to HIS CELL PHONE,\n          resting in its charger.\n          TIGHTER ON JONATHAN. His eyes fixed on the cell phone, an\n          idea forming in his mind --\n          RING!! of the cell phone suddenly jars us. RING... Jonathan\n          hesitates, then picks up.\n\n          WYATT (O.S.)\n          What's taking you?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          105\n\n          CONTINUED:\n          Jonathan says nothing. We can hear Wyatt getting tenser:\n\n          WYATT (O.S.)\n          I said what's taking you?\n\n          JONATHAN\n          I wondered if you were monitoring this.\n\n          WYATT (O.S.)\n          Don't worry about what I'm doing. Just\n          finish the transaction. Now.\n\n          JONATHAN\n          Not until I see her.\n          (off Wyatt's silence)\n          The transfer's impossible without an\n          access code. And there's no way I'm\n          entering it until I'm sure that she's\n          safe. So you tell me. How do we do that?\n          Wyatt still remains unnervingly silent. We tighten on\n          Jonathan, holding his breath, any plan he's concocting\n          clearly hinging on this...\n\n          WYATT (0..S.)\n          (low, frustrated)\n          You have a wireless connection?\n          Jonathan lets out a brief exhalation.\n\n          SAME - MOMENTS LATER\n          Jonathan snaps his laptop lid shut, packs it in his gym bag,\n          in which we glimpse the photo he's kept with him of \"S\"\n          smiling up at him.\n          He then turns to his cell phone once more. He picks it up,\n          scrolls the menu, punches a number.\n\n          RING... RING... RING... RING-\n\n          AWOMAN'S VOICE                                                 (FROM PHONE)\n          Hello?\n\n          JONATHAN\n\n          (BEAT)\n          Are you free tonight?\n          A sudden, jarring SOUND ADVANCE OF MUSIC as we\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          106.\n\n          EXT. THE PLAZA HOTEL - ROOFTOP - LATE NIGHT\n\n          An elaborate and intensely packed WEDDING PARTY is being held\n          up here beneath the glow of heat lamps, the music and crowd\n          noise unspeakably loud. We travel through the din, past\n          hundreds of well-heeled partiers, mainly young and wealthy.\n\n          EXT. PLAZA HOTEL - LATE NIGHT\n\n          The party noise is even slightly audible                        30   stories below,\n          where we find Jonathan carrying his bag as he enters...\n\n          INT. THE PLAZA HOTEL - LOBBY\n\n          Jonathan surveys the busy lobby. GUESTS mulling. STAFF\n          bustling. And, of course, the \"ELOISE\" PORTRAIT.\n\n          WYATT (O.S.)'\n          May I ask you a personal question?\n          Jonathan spins around, stares frostily into Wyatt's magnetic\n          smile. With Wyatt's new look, they could be brothers.\n          Except Wyatt looks clean and crisp, Jonathan dishevelled and\n          tense. Wyatt eyes the bag in Jonathan's hand.\n\n          JONATHAN\n          Where is she?\n\n          WYATT\n          In one of the rooms. Safe.\n          (a thin smile)\n          I got us a table.\n\n          INT. LOBBY BAR - MOMENTS LATER\n\n          A WAITRESS delivers a pair of drinks to where Jonathan and\n          Wyatt are seated.\n\n          WAITRESS\n          Two Macallan 25 year. Enjoy.\n          The Waitress leaves. Wyatt raises his glass.\n\n          WYATT\n          To friendship.\n          Jonathan just stares back at Wyatt.\n\n          JONATHAN\n          Bansky's dead, isn't he?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          107.\n\n          CONTINUED:\n\n          WYATT\n          He was dead when I met him. Just like you.\n          The rest was a mere formality.\n          (re: the laptop)\n          Of course he didn't have your bargaining\n          chip. Speaking of which...\n\n          JONATHAN\n          Not until I see her. She's the only reason\n          I'm here and not at the police.\n\n          WYATT\n          I told you, she's in a room. Alive.\n\n          JONATHAN\n          Give me the key then.\n          Wyatt considers this, then takes out an electronic key card\n          and slides it across the table. Of course there's nothing on\n          the key card to indicate a room number.\n\n          WYATT\n          As soon as you're done, I'll tell you the\n          room number.\n\n          JONATHAN\n          Not good enough.\n          Wyatt reaches for the key card; as he does we glimpse a\n          handgun concealed by his suit.\n\n          JONATHAN\n          You won't let her live. You killed all the\n          others, you'll have to kill us too.\n\n          WYATT\n          Hey, I like you, okay? You'll be fine.\n\n          JONATHAN\n          (scoffs, repulsed)\n          You like me.\n\n          WYATT\n          I do, Jonathan. In my way. After all,\n          you're my creation. I'm the one who gave\n          you life.\n\n          JONATHAN\n          Don't you get it? It was her, not you!\n          She's the one. She gave me life! You can\n          steal my identity, but not what's here.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          108.\n\n          CONTINUED:\n          He puts his hand on his heart. Wyatt is startled by\n          Jonathan's passionate outburst.\n\n          WYATT\n          Yeah, well, I'm weeping big wet ones for\n          you both. Now, let's get on with it.\n\n          (BEAT)\n          I don't have all night, Jonathan.\n          Jonathan reluctantly nods his assent. Wyatt lets go of the\n          key card. Jonathan opens his bag...\n\n          SAME - MOMENTS LATER\n          CLOSE ON JONATHAN'S LAPTOP SCREEN as it defuzzes from sleep.\n          The screen as it was, cursor blinking by the request for an\n          access code.\n          Wyatt watches intensely as Jonathan starts to type -- then\n          pauses, looking confused.\n          Jonathan quickly reaches around. to the back of his laptop,\n          feels an empty jack - and suddenly turns pale.\n\n          WYATT\n          What is it?\n\n          JONATHAN\n          My wireless modem - I must have left it in\n          the conference room. I can't get back\n          online.\n          Wyatt glares at Jonathan, seething.\n\n          WYATT\n          You stupid fuck.\n\n          JONATHAN\n          I can go back there and-\n\n          WYATT\n          No.\n          (thinks, then abruptly)\n          Get up.\n\n          INT. PLAZA HOTEL - LOBBY - MOMENTS LATER\n\n          Wyatt and Jonathan crossing the lobby; they arrive at\n          HOTEL GUEST BUSINESS CENTER, partitioned by a wall of glass.\n          Jonathan and Wyatt stand on the other side, peering in.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          109.\n\n          CONTINUED:\n\n          JONATHAN\n          They don't let you use your own computer.\n          Wyatt takes out a hundred dollar bill, gives it to Jonathan.\n\n          WYATT\n          They will now.\n          Jonathan takes the hundred, and heads into\n\n          INT. HOTEL.BUSINESS CENTER\n\n          Empty at this hour, with the exception of a sleepy-looking\n          EMPLOYEE. As Jonathan steps toward the desk, he takes out\n          the hotel key card, his eyes travelling up to a clock\n          overhead:                                                       11:29.\n\n          INT. LOBBY                                                      (OUTSIDE THE BUSINESS CENTER)\n\n          Wyatt eyes Jonathan on the other side of the glass.\n          INSERT WYATT'S POV: Jonathan explaining himself to the clerk.\n          Satisfied, Wyatt finds a comfortable chair with a direct view\n          of the business center's glass.\n          Across the lobby, an attractive AUBURN-HAIRED WOMAN in\n          business attire glances over at him.\n\n          INT. BUSINESS CENTER\n\n          Jonathan is subtly slipping the                                 $100                            bill to the Employee.\n\n          EMPLOYEE\n          You forgot your. own room number?\n\n          JONATHAN\n          I just checked in and it's been a hectic\n          day. Look at me!\n          The Employee looks uneasy - something about the ill-concealed\n          tension in Jonathan's eyes.\n\n          EMPLOYEE\n          You could just ask at the front desk. I'm\n          sure they can-\n\n          JONATHAN\n          I really don't have time, okay?\n          Jonathan presses the bill into the Employee's palm, peers up\n          at the clock again: the big hand clicks over to 11:30.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          110.\n\n          CONTINUED:\n\n          BACK TO WYATT IN THE LOBBY\n          Still eyeing Jonathan. He sees the Employee hesitate, then\n          accept the money.\n          Wyatt looks relieved -- when his view is abruptly blocked by\n          the Auburn-Haired Woman.\n\n          AUBURN HAIR\n          Pardon me, but may I ask you something -\n          personal?\n          Wyatt quickly looks up at her, momentarily confused.\n\n          AUBURN HAIR\n          Are you waiting for me?\n\n          BACK TO JONATHAN IN BUSINESS CENTER\n          The Employee finishes swiping his card through a scanner.\n\n          EMPLOYEE\n          Room 907.\n\n          JONATHAN\n          907                                                             - thanks.\n\n          BACK TO WYATT IN THE LOBBY\n          His view of Jonathan still obscured by Auburn Hair.\n\n          WYATT\n          What the hell are you --\n          And then he sees Auburn Hair glance unsurely at the Eloise\n          portrait, then at her cell phone's clock -- and now realizes:\n\n          WYATT\n          Motherfucker!\n          He jumps up, shoves Auburn Hair aside - eyes darting to the\n          Business Center to find Jonathan no longer behind the glass,\n          just his laptop resting on the counter where he'd been\n          standing.\n\n          INT. HOTEL ELEVATOR\n\n          Jonathan rushes into an elevator car just as it's about to\n          close. He turns to find a YOUNG FAMILY riding up with him.\n          They've pressed floor 6. He presses floor                       9.\n\n          \n\n          \n\n          \n\n          \n\n          INT. HOTEL LOBBY\n\n          Wyatt arrives at the elevators - none are ready to open. He\n          furiously presses the call button, his hand hovering by his\n          concealed gun.\n\n          INT.                                                            6TH FLOOR HALLWAY - ELEVATORS\n\n          Ding as the elevator doors open and the family step out.\n          Jonathan is left alone, impatiently waiting for the doors to\n          close -\n          - when his eyes land on something in the hallway: the fire\n          alarm. He suddenly reaches out to stop the elevator door just\n          as it's about to close.\n\n          INT.                                                            6TH FLOOR HALLWAY\n\n                                                                                                          Wide shot of an empty hotel hallway -- as suddenly the fire\n          alarm blares to life. Pan                                                                                                                                     180   to find Jonathan dipping into\n          an emergency exit stairwell.\n\n          INT. PLAZA HOTEL - LOBBY\n\n          Wyatt is just about to step onto an elevator, when a crowd of\n          wedding guests also start to pile in. Furious, he abandons\n          the elevators for the nearest stairs.\n\n          INT.                                                            7TH FLOOR HALLWAY\n\n          GUESTS spilling out of rooms met by the blaring alarm...\n\n          INT.                                                            8TH FLOOR HALLWAY\n\n          . as Jonathan smashes the glass of yet another fire alarm.\n\n          INT. LOBBY - SECURITY DESK\n\n          Surveillance monitors show guests in the various hallways and\n          stairwells rushing in confusion at all angles...\n\n          SECURITY                                                        (O.S.)\n          We've got alarms on two - wait, three\n          floors                                                          -\n\n          EXT. HOTEL ROOFTOP\n\n          Only the party 30 stories above remains oblivious: music\n          still blasting, the upscale throngs still partying.\n\n          \n\n          \n\n          \n\n          \n\n          112.\n\n          INT. STAIRWELL\n\n          Wyatt is bounding up the stairs, rounding the Fifth Floor -\n          - when he hears the door overhead bang open, and like a tidal\n          wave a flood of guests fill the stairwell.\n          Wyatt presses against the crush of bodies, pushing his way up\n          the stairwell.\n\n          INT.                                                            9TH FLOOR - HALLWAY\n\n                                                                          Close on a door marked by a placard:   9th floor -- as it's\n          banged open by Jonathan's shoulder.\n          The sound of the fire alarm is fainter up here as Jonathan\n          races down the carpeted corridor, room numbers blurring past\n          in sporadic fits                                                -                                      925...921...           918...   913...   910...\n          Jonathan finally lurches to a halt before room 907.\n          He takes out his key card, about to slide it in the slot --\n          when a hand grabs his forearm! He spins in panic to --\n          - a CLEANING WOMAN. She says something.in Vietnamese,\n          indicating the ringing alarms.\n\n          JONATHAN\n          Fire, I know - I'll be out in a minute.\n          The scared Cleaning Woman nods and hurries off as Jonathan\n          quickly slides the key in the slot. The light blinks green.\n          He jerks the door handle and throws open the door to find -\n\n          INT. ROOM 907\n\n          - nothing. The room is freshly made up, no sign of life other\n          than A PORNO FILM BLARING from the TV set on Pay-Per-View.\n          Jonathan's heart is pounding - where is she? He searches\n          every corner, the bathroom, the closets. Everywhere.\n          The sterile room taunts him - the uncreased bedspread, the\n          neat arrangement of the complimentary stationary, the\n          incessant moaning coming from the porn on the TV set --\n          Jonathan suddenly erupts, grips the TV and shoves it off its\n          ledge. It hits the floor with a crash, and sudden silence.\n          Jonathan rubs his brow, heaving in desperation -- when his\n          eyes land on the sleek, dark piece on which the TV was\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          113.\n\n          CONTINUED:\n          resting; it's a dense, rectangular block - only when Jonathan\n          taps it, he realizes: it's hollow.\n          He immediately seizes it, yanks it from the wall...\n          And there she is, lying face down in a lifeless heap: \"S\".\n          Panicked, Jonathan rushes to her, turns her over. She looks\n          semi-conscious, hands and mouth duct-taped. Jonathan\n          hurriedly removes the tape, gently shakes her, terrified by\n          how lifeless she appears -\n          - when her eyes widen, focus on his face. Before he can say\n          anything, she throws her arms around his neck, presses her\n          face to his chest.\n\n          â\u0080\u009eS.,\n          (whispers gratefully)\n          You're alive.\n          He's struck by these words, and nods, holding her face in his\n          hands as he kisses her urgently and gratefully.\n\n          JONATHAN\n          What do you say we stick together from now\n          on?\n\n          JA S\"\n          I'd like that.\n\n          INT. EMERGENCY STAIRWELL\n\n          A rush of guests hurriedly descending the staircase, a\n          seemingly endless stream of densely packed faces.\n          Close on Wyatt jostled within the flow of the wealthy guests -\n          as he's the only one heading up. He passes the 6th floor...\n\n          INT.                                                             9TH FLOOR\n\n          Jonathan and \"S\" hurrying down the hall - Jonathan torn\n          between a choice of two stairwells. His eyes dart from one to\n          another                                                          - he finally gambles on the one to the right.\n\n          INT. EMERGENCY STAIRWELL\n\n          Wyatt forcing his way upstream with menacing determination;\n          his gaze is wilder, more and more irritated by the descending\n          mob of successful, well-dressed guests he's pushing against --\n          - when he halts, peering up through the railings' lozenge-\n          shaped opening, past a collection of hands and profiles...\n          .to Jonathan and \"S\" some three stories above.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          114\n\n          CONTINUED:\n          TIGHT ON WYATT. As yet unnoticed by Jonathan, he remains\n          halted on a stair, bodies squeezing past him.\n          TIGHTER ON HIS EYES. That predatory gleam.\n          EVEN TIGHTER ON HIS GUN, tucked carefully at his side.\n          CLOSE ON JONATHAN AND \"S\" three stories above, starting to\n          descend -- when Jonathan notices the hint of disruption in the\n          flow of bodies below.\n          Immediately wary, he leans over the railing, but can't get a\n          good look. He grips the railing, leans further over... and\n          his eyes find Wyatt's staring right back up at him --\n\n          JONATHAN\n          He's down there! I saw him -\n\n          11 SIP\n          Oh God -\n\n          JONATHAN\n          Up - we've got to go up!\n          Clutching her arm, Jonathan and \"S\" turn back up, against the\n          flow of traffic. Stories above, less and less people are\n          evacuating.\n          ANGLE ON WYATT as he presses upward, his steely gaze even\n          more rapacious.\n          The crowd is thinning as Jonathan and \"S\" race upward as\n          well.\n          INSERT JONATHAN'S POV: a shaky, dizzying blur as they race\n          higher and higher...\n          INSERT WYATT'S POV: from below but gaining on them, Jonathan\n          and \"S\". appearing and disappearing with each twist and turn\n          of the staircase...\n          CLOSE ON JONATHAN AND \"S\", desperately racing upwards...\n          CLOSE ON WYATT bounding the stairs, footsteps echoing, the\n          staircase now empty and quiet, save for the footfall of\n          Jonathan and \"S\"                                                 - no more than three floors above Wyatt\n          now...\n          Wyatt slows his pace, leans into the railing, takes aim...\n          CLOSE ON JONATHAN AND \"S\" still hurrying up - when a shot\n          rings out, a jolting echo clanging through the stairwell, the\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          115.\n\n          CONTINUED:\n          bullet missing them by inches. \"S\" screams, Jonathan tugs her\n          with him                                                         -\n          - when a second shot rings out, the bullet punching a dent\n          into the underside of the stairs just overhead.\n          ON WYATT, realizing he needs a cleaner shot, taking the\n          stairs even harder in pursuit, all merciless intensity.\n\n          EXT. HOTEL ROOFTOP - MOMENTS LATER\n\n          The party is still at full throttle. Apparently no one has\n          yet told them of the alarms.\n          CLOSE ON A STAIRWELL DOOR MARKED \"EMERGENCY EXIT\" as it\n          suddenly bangs open and Jonathan and \"S\" spill out.\n          They pause a moment - thrown by the sight of all the wealthy,\n          beautiful faces, laughing, dancing.\n\n          JONATHAN\n          Come on!\n          She grabs his hand, and they waste no time disappearing into\n          the mass of bodies.\n          They keep moving. Shoulder to shoulder within the swell of\n          partiers, they fit right in - instantly anonymous                - though\n          not as smartly attired.\n          BACK TO THE STAIRWELL DOOR as Wyatt enters the party,\n          scanning the dense crowd, all senses alert.\n          INSERT WYATT'S POV: just a mass of successful, attractive,\n          partying young men and women. There's no way to pick Jonathan\n          and \"S\" out.\n          Wyatt's smirk fades to an icy glare as he stalks the\n          periphery.\n          WITHIN THE CROWD \"S\" clutches Jonathan's hand, their heads\n          ducked low as they press forward...\n          CLOSE ON WYATT, frustration gnashing at him as he quickens\n          his pace, the idiotic enthusiasm of the crowd enraging him,\n          sweat beading on his face                                        --\n          -- when suddenly the music stops. Wyatt frowns., eyes darting.\n          CLOSE ON JONATHAN AND \"S\" glancing around in confusion -\n\n          SECURITY                                                         (DISTANT U.S.)\n          Ladies and Gentlemen, we need everyone to\n          evacuate the hotel. This way please.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          CONTINUED:\n          The crowd noise resumes, as the throngs begrudgingly start\n          for the exits.\n          ON JONATHAN AND \"S,\" doing their best to stay concealed\n          within the exiting crowd.\n          Angle on Wyatt pushing his way through the crush, shoving\n          people aside, trying to find them -\n          - when he suddenly stops. He has an idea. He takes out his\n          cell phone.\n          BACK TO JONATHAN AND \"5\" within the crowd -\n          - when Jonathan's cell phone RINGS.\n          CLOSE ON JONATHAN as his eyes widen in panic.\n          RING... He quickly fumbles for it, tries to turn it off        -\n          - but it's too late... WHIP ACROSS THE CROWD to Wyatt,\n          grinning wider. He's spotted them. In an instant he is bee-\n          lining through the packed suits.\n          WIDE SHOT OF THE ROOFTOP as the throngs are clearing out.\n          Jonathan grabs \"S\" as they duck, racing across the dark,\n          rooftop, looking for a place to hide.\n          They take cover behind a large venting duct near the ledge -\n          gasping to catch their breath... Stepping back, \"S's\" foot\n          clinks against something: a stray iron railing post.\n          She reaches. down for it, starts to lift it -\n          - when Wyatt's hand darts in and grasps the other end.\n          She looks up in terror - when Wyatt punches her violently,\n          knocking her to the ground.\n          Jonathan rushes to her - only to be blocked by Wyatt,\n          gripping the iron rod tight.\n\n          WYATT\n          Nice try back there, Jonathan. Looks like\n          you picked up a thing or two from me.\n          Jonathan tries to strike him - when with a lightning quick\n          movement Wyatt whips the iron rod through the air, cracking\n          Jonathan across the face.\n\n          WYATT\n          Killer instinct, pall\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          117.\n\n          CONTINUED:\n          Jonathan crumples, his glasses knocked to the ground.\n          CLOSE ON WYATT as he grips the iron rod like a tennis\n          racquet, steps into position                                   -\n          - and brings the rod down on Jonathan with ruthless tennis\n          strokes: Backhand! Bam! Forehand! Bam! Slice! Bam!\n          Jonathan can barely peer up, bloody and beaten. He hears\n          Wyatt drop the iron rod...\n\n\n          JONATHAN'S POV: Wyatt's blurry figure hovering above suddenly\n          swoops in on us  \n                                              -\n          - as Wyatt grabs Jonathan by the throat, hefts him up and\n          yanks him back to the roof's concrete ledge. Jonathan fights\n          to struggle free - when Wyatt jams the gun under his chin.\n          Jonathan freezes.\n\n          JONATHAN\n\n          (GASPING)\n          They'll... catch... you...\n\n          WYATT\n          Me? No - no, I'm just a face in the crowd.\n          I'm a tourist, just passing through.\n          JONATHAN'S POV: Wyatt's face presses closer, now almost in\n          focus as he presses Jonathan's torso back over the ledge -\n\n          WYATT\n          As for you, you had your fun...\n          Wyatt presses closer, crushing Jonathan's back to the edge.\n\n          WYATT\n          Now we're going to go back down...\n          INSERT JONATHAN'S HAND reaching into Wyatt's pocket, his\n          fingers fumbling for the cell phone                            (Jonathan's old phone).\n\n          WYATT\n          We're going to get that laptop...\n          CLOSE ON JONATHAN'S FINGERS blindly prodding - he has the\n          phone now - his fingers feel for the antenna...\n\n          WYATT\n          And we're going to finish this, once and\n          for -\n          - when with all his strength Jonathan jams the cell phone up\n          into Wyatt's eye, the antenna punching into the retina.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          118\n\n          CONTINUED:\n          Wyatt's grasp slips from Jonathan's collar as he stumbles\n          back, cupping a hand to his wound as he swings his gun toward\n          Jonathan -\n          - when with every ounce of strength Jonathan charges, Wyatt's\n          shot missing him as Jonathan slams him into the ledge wall,\n          seizing the momentum to turn himself -\n          - as Wyatt falls right over the edge of the hotel rooftop...\n\n          EXT. THE PLAZA HOTEL                                             (WIDE SHOT)\n\n          .Wyatt's body plummeting down the magnificent facade,\n          vanishing into the vastness of the city below.\n\n          EXT. ROOFTOP\n\n          CLOSE ON JONATHAN as he crawls to the ledge, peers down into\n          the darkness. He exhales, then turns back to \"S\"                 -\n          - to find she's right beside him, grateful tears in her eye.\n          She leans into him, and he holds her tight, the two of them\n          embraced on the precipice as we\n\n          DISSOLVE TO:\n\n          EXT. PLAZA HOTEL - STREET LEVEL - SHORT TIME LATER\n\n          Strobed reds and blues of police and fire.trucks amassed,\n          trying to control the throngs of guests and pedestrians\n          blocking our view of the body they're all gawking at.\n          We travel through the confusion until we find JONATHAN AND\n          \"S\" sitting side by side on the sidewalk curb, each propped\n          against the other.\n          The 'shock of it all is beginning to fade. He reaches into his\n          pocket and hands her 'Duck on Bike'.\n\n          JONATHAN\n          Yours, I believe.\n\n          01S.11\n          Thanks, Frank.\n          She winds the toy up. They watch it make it's funny way down\n          the sidewalk.\n\n          JONATHAN\n          Can I ask you something personal?\n          She nods.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          119.\n\n          CONTINUED:\n\n          JONATHAN\n          What's your name?\n          \"S\" considers the request, then smiles gently, leans in close\n          and whispers the answer in his ear. Jonathan gazes at her a\n          moment - whatever her name is, it must be perfect.\n\n          JONATHAN\n          So what now?\n          She smiles up at him.\n\n          S\n          Well... are you free tonight?\n          On Jonathan: treasuring these moments. He is truly free --\n          perhaps for the first time in his life.\n\n          JONATHAN\n          Yes. I'm free.\n          They gaze at each other.\n          We leave Jonathan and \"S\" to their privacy, pulling back as\n          they continue talking, continuing away until we're\n\n          THROUGH A WINDOW AND INSIDE THE HOTEL ITSELF\n          the window itself now a frame, letter-boxing the scene,\n          people passing like fish in their tank... except for Jonathan\n          and S, seated center-frame, two small figures side by side,\n          face to face, talking intimately as we.\n\n          FADE OUT.\n\n\n                                      THE END\n\n\n\n\n\n\nDeception\nWriters :   Mark Bomback  Patrick Marber\nGenres :   Crime  Drama  Mystery  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:48.294416"}