{"title": "Deep Rising", "film_link": "/Movie Scripts/Deep Rising Script.html", "script_link": "/scripts/Deep-Rising.html", "info_raw": "\n\nDeep Rising Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Steven Sommers  Robert Mark Kamen\nGenres  Action  Horror  Thriller\nScript Date : January 1996\n\nRead \"Deep Rising\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nDeep Rising\n\n\n\n                                       Deep Rising\n                                formerly known as TENTACLE\n                          by Steven Sommers & Robert Mark Kamen \n                         extended revisions by Robert Mark Kamen \n                               Revised Draft Jan. 1st, 1996\n\n                                                       OPEN TO:\n\n               A FLASH OF LIGHTNING rips the HOLLYWOOD PICTURES LOGO away,\n               and we find ourselves in the middle of...\n\n         1     STORMY SEA - NIGHT                                       1\n\n               SUPERIMPOSED: SOUTH CHINA SEA\n\n               The dark blue waters roil and boil and foam. THUNDER CRACKS.\n               LIGHTING FLASHES.\n\n                                                       CUT TO:\n\n         2     UNDERWATER - NIGHT                                       2\n\n               An enormous Japanese BATHYSCAPHE free-falls through the\n               water. An autonomous fifteen-man submersible. Almost\n               futuristic in its design. The nose cone is an amazing ultra\n               high-pressure plexi-dome. LETTERING along the side tells us\n               this is the \"SHINKAI 90000.\" \n\n               COMPUTER PRINTED across the SCREEN are the WORDS:\n               ASSIGNMENT:\t\tGEOLOGICAL EXPLORATION.\n               SUB-OCEANIC SEISMIC RESEARCH.\n               TECTONIC PLATE SURVEILLANCE.\n               ADDENDUM:\t\tABOUT TO BREAK THE WORLD'S RECORD\n               FOR THE DEEPEST DIVE...\n\n         3     SHINKAI 9000 - NIGHT                                     3\n\n               The JAPANESE CAPTAIN watches a DLD laser tracking system and\n               barks one-word questions to his JAPANESE CREW. The Sailors\n               work the consoles and give clipped monosyllabic answers. The\n               JAPANESE SCIENCE OFFICERS go over charts on the electronic\n               position board, a contiuously-shifting graphic representation\n               of the ocean contours below. Behind them is an elaborate\n               DEPTH GAUGE with computerized graphics. READ: 34,000 feet and\n               dropping. The Crew works at a fevered pitch. An ALARM SOUNDS\n               as the depth gauge sounds 35,000 feet. All eyes on the depth\n               gauge. Several Science Officers share excited looks.\n\n         4     ON THE DEPTH GAUGE: 35,100 -- 35,200 -- 35,300 -- 35,400...4\n\n               The excitement builds. Even the Captain's weathered eyes\n               widen. And then, as the depth gauge hits 35,801 feet below\n               sea level, the entire Crew breaks into CHEERS, WHOOPS,\n               HANDSHAKES AND HIGH-FIVES.\n\n                                                       CUT TO:\n\n         5     SHINKAI 9000 - NIGHT                                     5\n\n               As it continues its descent, it passes corroding metal drums\n               leaking toxic waste, radioactive waste, dumped in the depths,\n               away from prying eyes, and populated areas. The vessel drops\n               into the SULU BASIN. Imagine the Grand Canyon under forty\n               thousand feet of water. \n\n               But the Sulu Basin is ten times the size of the Grand Canyon.\n\n               Down here, ten thousand fathoms below the storm, all is calm.\n\n               The dual TURBO-PROPS on the ear of the submersible KICK ON.\n               The Bathysaphe is now mobile. It glides down the side of an\n               enormous rock face, carefully avoiding massive sandstone\n               pinnacles which jut up from the ocean floor far below.\n\n                                                       DISSOLVE TO:\n\n         6     DEEP SEA - NIGHT                                         6\n\n               THE SHINKAI hovers near a gigantic tectonic plate. A ROBOTIC\n               ARM extends out from under the plexi-dome. Its \"hand\" is a\n               high-tech LASER CUTTER. It approaches the plate, steadies,\n               then fires a direct BLUE BEAM at the bedrock, burns the rock\n               into magma and cuts a perfect round pattern. \n\n               Another ROBOTIC ARM reaches forward, its CLAW rips out the\n               cut rock from inside the pattern, then takes the sample and\n               sets it inside a hydro-basket on the submersible's port side.\n\n                                                       DISSOLVE TO:\n\n         7     MINDINAO DEEP - NIGHT                                    7\n\n               A desolate, barren, spooky place. Nothing breathes. Nothing\n               lives. Or so it would appear. The creepy, foreboding MUSICAL\n               SCORE tells us otherwise. The Shinkai ENTERS a huge ROCK\n               FISSURE.\n\n                                                       CUT TO:\n\n         8     SHINKAI 9000 - NIGHT                                     8\n\n               The Captain and the Science Officers stare through the plexi\n               dome and out into the freezing, cobalt blue of the PALAWAN\n               TROUGH. The MUSIC intensifies as they round each curve. Then,\n               dead ahead, is the end of the trough, which is half-blocked\n               by a rock-encrusted embankment. \n\n               The MUSIC builds. \n\n               The Shinkai approaches the embankment. Slowly starts to glide\n               up the side. The Captain and Science Officers seem mesmerized\n               by all the lonely creepiness. They crest the embankment. And\n               the plexi-domed VIEW FILLS with an unimaginable horror. \n\n               As far as the eye can see, the entire murky landscape is\n               filled with WHALE BONES. A valley of death. Cluttered here\n               and there, carelessly flung about, are the rusting hulks of\n               several ships. Seemingly ripped apart. Clusters of shark\n               cartilage float through the water like white ghosts. \n\n               The Captain, the Science Officers and the entire Crew just\n               stare, frozen in place by the strange horror before them.\n\n                                                       CUT TO:\n\n         9     SHINKAI 9000 - NIGHT                                     9\n\n               The vessel cruises through the valley of death. Everyone is\n               nervously taking readings, making calculations and adjusting\n               equipment. \n\n               Gone is the excitement and euphoria of the record breaking.\n\n               Several Crewmen cast nervous glances out through the plexi\n               dome. Giant skeletons everywhere.\n\n                                                       CUT TO:\n\n        10     SHINKAI 9000 - NIGHT                                    10\n\n               The Shinkai approaches an eerie-looking rock formation. The\n               robotic arm comes out. The laser cutter steadies, aims, then\n               shoots out its blue beam and cuts into the rock.\n\n               WHOOSH!! A HUGE JET STREAM OF INKY BLOOD BLASTS OUT OF THE\n               FORMATION!\n\n                                                       CUT TO:\n\n        11     SHNKAI 9000 - NIGHT                                     11\n\n               The Captain and the Science Officers recoil as the inky stuff\n               envelopes the plexi-dome, completely blotting out the VIEW.\n\n                                                       CUT TO:\n\n        12     PALAWAN TROUGH - NIGHT                                  12\n\n               The Shinkai VANISHES into a huge cloud of inky blood. We HOLD\n               for a LONG OMINOUS BEAT. And then, like a slow-motion\n               earthquake, large boulders and giant crevices begin to shift\n               in the murky waters. WHALE BONES TOPPLE and SCATTER. Several\n               feet under the ancient silt, something is coming alive.\n\n                                                       CUT TO:\n\n        13     SHINKAI 9000 - NIGHT                                    13\n\n               Everything outside the plexi-dome is still BLACK. Everyone is\n               staring at the position board, which shows a large section of\n               the OCEAN FLOOR STARTING TO MOVE, its contours incongruous\n               with the rest of the graphic representation. \n\n               The Science Officers look stunned. The Captain barks\n               commands. The Crew leaps into high gear. \n\n               Then the Captain reverses the trottle, and petal-to-the-metal\n               he starts to back out. \n\n               The inky blood swirls past the plexi-dome. Then suddenly, and\n               impossibly, the SUBMERSIBLE JERKS TO A HALT. Everybody goes\n               ass-over-teacups. EQUIPMENT SHATTERS. SPARKS FLY. GLASS\n               BREAKS. Lots of YELLING in Japanese. \n\n               The SHINKAI starts to ROCK and SHAKE. Something has a hold on\n               it. More EQUIPMENT SHATTERS. Men are thrown about. Then it\n               stops rocking. The Sailors stop yelling. Everything goes dead\n               quiet. Frightened eyes share terror-filled looks. A SOUND is\n               HEARD coming from the exterior of the ship, like feet runing\n               across the outside of the hull. Very creepy. \n\n               The HULL starts to MOAN and CREAK from an UNSEEN PRESSURE.\n               And then the sub begins to be crushed like it's a beer can.\n               The metal HULL TORQUES on all sides. RIVETS POP and SNAP.\n               WATER SPRAYS and SHOOTS. More SPARKS FLY. The STEEL PLATING\n               DIMPLES, CRUMBLES and SCREAMS in agony. CHAOS. PANDEMONIUM.\n               And then the SHINKAI IMPLODES. A massive CHURNING SWIRL of\n               water, metal and men.\n\n                                                       SMASH CUT TO:\n\n        14     SOUTH CHINA SEA - SUNSET                                14\n\n               THE SAIPAN, a tricked out Jet Foil, built for speed not\n               looks, gunmetal blue, lean and mean, rips across the choppy\n               water. The Rolling Stones STREETFIGHTING MAN pours out of the\n               jet foil, reverberating over the waves, as the CAMERA rushes\n               right at the windsheild and into...\n\n                                                       CUT TO:\n\n        15     PILOT HOUSE - SUNSET                                    15\n\n               Stripped down, low frills, high tech... ...where JOHN T.\n               FINNEGAN, bathed in the last light of day, all taut muscle\n               and sinew, all business, with every one of his 38 years\n               etched on his rugged, good looking face, is harnessed into\n               the steering pylon, wrestling with his steering-sticks,\n               holding the bouncing jetfoil steady as he can, hauling ass,\n               propelled, it seems, by the music blasting out of four state\n               of the art speakers bolted to the metal walls. Light from the\n               laser imagers plays across Finnegan's face. The face of a man\n               in his element, on the edge, in control. He barks commands\n               into his RADIO HEADSET.\n\n                                   FINNEGAN\n                         How we doing out there?\n\n               THROUGH THE WINDSHIELD we see LEILA, a muscular Filipina\n               clambering over the foredeck. She's dripping wet. Tough as\n               nails. She turns to Finnegan and \"mouths\" something into her\n               headset. Finnegan flashes her his most charming smile.\n\n                                   FINNEGAN (CONT'D)\n                         Yes, I'm very warm and dry in here,\n                         thank you for your concern.\n\n               His HEADSET comes alive withe the SOUND of LEILA bitching in\n               an unintelligible foreign tongue.\n\n                                   FINNEGAN (CONT'D)\n                         A raise? I already pay you two\n                         bucks a day.\n\n               He watches as Leila fights the WIND and SEASPRAY and dogs\n               tight a series of hatch-latches across the foredeck.\n\n                                   FINNEGAN (CONT'D)\n                         Missed one darling.\n\n               Leila turns and gives him a \"jerking-off\" sign with her hand.\n\n                                   FINNEGAN (CONT'D)\n                         I love you too.\n\n               The Radar Imager suddenly blinks, and goes to black. Dead.\n               Finnegan taps on the screen. Nothing. Taps on the console.\n               Still nothing. Simultaneously two more imagers shut down. His\n               mouth screws tight.\n\n                                                       CUT TO:\n\n        16     ENGINE ROOM - NIGHT                                     16\n\n               Crammed wall to wall with enough horsepower to fly a 747.\n               Pumped out of two thumping engines. The domain of a scruffy,\n               shifty-eyed, likeable little weasel of a mechanical\n               genius...JOEY PANTUCCI. \n\n               Wearing a mechanic's toolbelt, slung sideways across the hips\n               like a gunslinger, singing the theme to \"Gilligan's Island\"\n               over the engine's roar. Way off-key. His hands crammed deep\n               in a tangle of wires. On the walls are a few pictures: Of a\n               few major league engines. Of a few major league pinups, and a\n               few of Pantucci and Finnegan...together in the U.S. Navy...in\n               front of the Saipan in shinier days.\n\n                                   PANTUCCI\n                             (singing)\n                         \" -- if not for the courage of the\n                         fearless crew -- \" \n\n               He tugs at the wires.\n\n                                   PANTUCCI (CONT'D)\n                         \" -- the Minnow would be lost, the\n                         Minowwww would be lost.\"\n\n               Finnegan's voice explodes through his headset...\n\n                                   FINNEGAN (V.O.)\n                             (radio filtered)\n                         PANTUCCI!! \n\n               Unperturbed, Pantucci works at the wires.\n\n                                   PANTUCCI\n                             (into radio)\n                         Can we use our indoor voice\n                         please...\n\n                                   FINNEGAN (V.O.)\n                             (radio filtered)\n                         I'm flying blind here God damn it!\n\n               Pantucci pulls two wires from the tangle.\n\n                                   PANTUCCI\n                         You trying to make me feel guilty?\n\n               He begins to strip the wires with his teeth.\n\n                                                       CUT TO:\n\n        17     PILOT HOUSE - SUNSET                                    17\n\n               Finnegan peers out of the windscreen, trying to see ahead of\n               himself.\n\n                                   FINNEGAN\n                         Guilty will be the least of what\n                         you feel when I run my rig into one\n                         of these god damn no name islands!\n                         Get me well here!\n\n                                                       CUT TO:\n\n        18     ENGINE ROOM                                             18\n\n               Pantucci twists one wire around another.\n\n                                   PANTUCCI\n                         All better...\n\n        19     PILOT HOUSE - SUNSET                                    19\n\n               The console lights up. The screens come back on line. \n\n               Finnegan is pleased.\n\n                                   PANTUCCI (V.O.)\n                         Now tell me again...\n\n                                                       CUT TO:\n\n        20     ENGINE ROOM                                             20\n\n               Pantucci works his wrench around an engine mount. And his\n               nervous eyes around six men, big, bad men, standing on the\n               far side of the engines out in a narrow passage. \n\n               A Maori(VIVO). Two Aussies(MASON and MULLIGAN). A\n               Samoan(MAMOOLI). A Chinese(CHIN). And an Aborigine (BILLY).\n               Tattooed, armed to the teeth, packed in Kevlar body armor.\n               Mercenaries. Who would as soon wring your neck as shake your\n               hand. And a sixth man. HANOVER. The obvious leader.\n               Smoother than the rest, but still showing the edge of a man\n               risen from their ranks. He consults his watch with a growing\n               concern.\n\n                                   PANTUCCI \n                         ...why we took this job?\n\n                                                       CUT TO:\n\n        21     PILOT HOUSE - SUNSET                                    21\n\n               Finnegan hits a button on his console. The Stones are\n               replaced by the first chords of LAYLA.\n\n                                   FINNEGAN\n                         If I told you once...I told you a\n                         thousand times...\n\n                                                       CUT TO:\n\n        22     ENGINE ROOM                                             22\n\n                                   PANTUCCI\n                             (rote)\n                         I know...I know...if the cash is\n                         there we don't care...\n                             (nervous)\n                         Finnegan this is as mean a pile of\n                         shit as we ever carried...\n\n               Pantucci notices Hanover impatiently looking at his watch\n               again, and nods for a mass of Aussie mean and muscle named\n               MASON to follow him up a ladder.\n\n                                   PANTUCCI (CONT'D)\n                         ...and some of it's coming your\n                         way.\n\n               He quickly pulls out a wrench, slaps it over a bolt and\n               tightens it down. The leak stops. He blows on the WRENCH like\n               it's a six-shooter, then spins it at the speed of light and\n               holsters it into his toolbelt.\n\n                                                       CUT TO:\n\n        23     PILOT HOUSE - SUNSET                                    23\n\n               As Finnegan is watching the sea ahead, swathed in the\n               shrieking Clapton guitar solos, the hatch opens. \n\n               Hanover enters, followed by Mason, who leaves the hatch door\n               ajar. \n\n               Finnegan's eyes remain fixed on the sea. His ears on the\n               Clapton. \n\n               Hanover and Mason hold onto any available rail as the boat\n               slams over the waves.\n\n                                   HANOVER\n                         You remember the first time we met\n                         Finnegan? I think you were just\n                         starting out...smuggling gold off\n                         Sumatra for those two\n                         Chinese...what did we use to call\n                         them?\n\n                                   FINNEGAN\n                         Fok Yu and Fok Yu Two...are we\n                         strolling down memory lane for any\n                         particular reason?\n\n                                   HANOVER\n                         No, it just struck me as odd...I\n                         don't see you for all these years\n                         and you've still got the same tape\n                         stuck in the box.\n\n                                   FINNEGAN\n                         You know what they say...the\n                         classics are eternal.\n\n               Hanover looks at the Topo Imager. Holding onto the rail to\n               keep his balance as the boat slams over the choppy sea.\n\n                                   HANOVER\n                         So where are we?\n\n               Finnegan points to a spot in the middle of the map.\n\n                                   FINNEGAN\n                         Right here...middle of nowhere...\n\n                                   HANOVER\n                         And where is our point of arrival?\n\n               Finnegan points to another spot on the map.\n\n                                   FINNEGAN\n                         Right here...middle of\n                         nowhere...and the answer to your\n                         question is yes.\n\n                                   HANOVER\n                         Which question is that?\n\n                                   FINNEGAN\n                         The one you came up to ask...are we\n                         on schedule?\n\n                                   HANOVER\n                             (to Mason)\n                         Take note Mr. Mason...this is why\n                         you hire a professional...No\n                         whining. No excuses.\n\n                                   MASON\n                             (attitude)\n                         I've heard a lot of stories about\n                         you mate...\n\n                                   FINNEGAN\n                         All of them flattering I'm sure.\n\n                                   MASON\n                         They were...but they musta been\n                         talking about another Finnegan...\n                         because the one I heard about was\n                         as rough as they came...the one I'm\n                         looking at is, well, about as\n                         current as the music.\n\n                                   HANOVER\n                         Don't mind him Finnegan...you\n                         remember 25...balls of steel...\n                         splashing around in a sea of\n                         testosterone.\n\n                                   FINNEGAN\n                         I don't mind him...but I do think\n                         it's time for him to get back down\n                         below with the rest of the\n                         playgroup.\n\n                                   MASON\n                         And who's gonna make me?\n\n               Finnegan looks at Mason...at the open hatchway just behind\n               him...\n\n                                   FINNEGAN\n                         The Finnegan you heard about.\n\n               ...and jams the steering sticks full speed ahead. The force\n               of acceleration tumbles Hanover into the console. Mason\n               tumbles out the open hatchway, down the stairs behind him. As\n               he rises, Hanover regards Finnegan for a moment. A smile\n               flits across his face.\n\n                                   HANOVER\n                         That's why we're sill around\n                         Finnegan...you and me... Nothing\n                         gets the feathers up. Business is\n                         business. Eh?\n\n               Finnegan's hand finds the console. He hits a button. The\n               first strains of Led Zepplin's WHOLE LOTTA LOVE comes roaring\n               out of the speakers.\n\n                                   FINNEGAN\n                         And the classics are eternal.\n\n               Finnegan cranks the sound to the max, pulls back on both\n               steer sticks, and holds on, as the force of acceleration\n               hammers him into the pylon.\n\n                                                       CUT TO:\n\n        24     OPEN SEA - SUNSET                                       24\n\n               The Saipan roars off into the setting sun, hell bent for\n               leather. Zepplin screaming in its wake.\n\n                                                       CUT TO:\n\n        25     SOUTH CHINA SEA - NIGHT                                 25\n\n               Sailing through the mild waters of the South China Sea, a\n               luxury cruise liner. The FUJI MARU. Top of the line. State of\n               the art. And absolutely MASSIVE. No expense has been spared.\n               Breathtaking. Gunfire shatters the serenity of the night.\n\n                                                       CUT TO:\n\n        26     FUJI MARU DECK - NIGHT                                  26\n\n               A group of tony British passengers is shooting skeet. Being\n               night, the CLAY PIGEONS are glow-in-the-dark. They EXPLODE\n               over the WATERSPORTS PLATFORM, where TWO JET SKIS swing from\n               harnesses, and TWO SPEEDBOATS are being hoisted up the side.\n\n                                                       CUT TO:\n\n        27     CRYSTAL POOL DECK - NIGHT                               27\n\n               Rigged for a formal party. Chinese lanterns sway in the\n               breeze. A band plays. Hundreds of wealthy Passengers, the men\n               in tuxedos, the women in drop dead gowns, dripping with\n               jewelry, dance, flirt, gossip, as an endless stream of\n               waiters ply the floor with champagne laden trays.\n               CLOSE ON: The sexiest pair of spiked heels ever to grace the\n               foot of a woman, stopping at the top of the deck. PAN UP: A\n               shimmering golden gown, high slit on the sides to reveal a\n               perfect set of legs, a runway model's body, a cover girl's\n               face...and a thief's sharp ferret eyes. TRILLIAN. A class act\n               from top to bottom. A head turner for either sex, and knows\n               it. She holds an orchid in her hand. Trillian scans the\n               crowd, looking for her prey...and finds him. Her POV. The\n               Ship's smug Captain. JEAN BAPTISTE DELCROIX. She fixes the\n               orchid in her hair just so, about to move...\n\n                                   OLD WOMAN\n                         He said an orchid and a beautiful\n                         woman belonged together... It was\n                         our first date.\n\n               Trillian looks down to a petite old woman, dressed\n               impeccably, delicate, frail, her beauty long faded except\n               from her eyes. Kindness becomes her, like moonlight does the\n               night.\n\n                                   OLD WOMAN (CONT'D)\n                         He said that it was the orchid I\n                         wore that made him fall in love\n                         with me...\n\n                                   TRILLIAN\n                         He sounds like a real gentleman.\n\n                                   OLD WOMAN\n                         The best of the best he was... This\n                         cruise was supposed to be our 60th\n                         anniversary gift to each other. He\n                         died last Spring...\n\n                                   TRILLIAN\n                         I'm so sorry...\n\n                                   OLD WOMAN\n                         I was going to wear one...special\n                         for him...like a memory...\n\n               The Old Woman looks at the orchid. And then at Trillian.\n\n                                   OLD WOMAN (CONT'D)\n                         But without him here I don't know\n                         why I should.\n\n               Trillian takes the orchid from her hair, and places it in the\n               lapel of the woman's jacket.\n\n                                   TRILLIAN\n                         Because an orchid and a beautiful\n                         woman belong together.\n\n               The smile Trillian bestows on the old woman is loving,\n               sincere. The moment between them is broken by the keen clear\n               sound of a silver spoon tapping a crystal champagne flute.\n\n                                   CANTON (V.O.)\n                         Ladies and gentlemen...\n\n               ANGLE ON: The deck where the band stops playing. Voices hush.\n               Everyone turns to NIGEL CANTON, 65, tall, elegant, every\n               white hair perfectly in place, impeccably turned out, with\n               the energy, and enthusiasm of a man half his age. Canton\n               stands at the head of the pool, in front of a wall sized\n               aquarium, flanked by his Captain.\n\n                                   CANTON (CONT'D)\n                         All my life I had the dream of\n                         building the greatest pleasure ship\n                         ever to sail the seven seas...\n                         tonight, seeing all of you\n                         here...so elegant...so\n                         beautiful...so rich... \n\n               The crowd roars with laughter.\n\n                                   CANTON (CONT'D)\n                         I realize my dream has come\n                         true...I thank you all from the\n                         bottom of my heart for making it\n                         so... \n\n               Canton lifts his glass.\n\n                                   CANTON (CONT'D)\n                         To the Fuji Maru! Good times\n                         forever!\n\n                                   CROWD\n                         Forever!! Here! Here!\n\n               The crowd swells around Canton. ANGLE ON: The Captain\n               chatting up some passengers when a woman's voice, seductive,\n               beguiling, turns his head to...\n\n                                   TRILLIAN\n                             (French)\n                         Is it true what they say about a\n                         captain and his boat.\n\n               The Captain's libido rises as he gazes into Trillian's come\n               hither eyes.\n\n                                   CAPTAIN\n                         Is what true madame?\n\n               Trillian takes one step closer, until her moist lips are\n               pursed inches from the captain's.\n\n                                   TRILLIAN\n                             (French)\n                         Madamoiselle...that the bigger the\n                         boat...the bigger the man... \n\n               His breath catches.\n\n                                   CAPTAIN\n                         It is a theory I would be glad to\n                         put to the test.\n\n               Trillian draws even closer. If looks could cause a man to\n               climax.\n\n                                   TRILLIAN\n                             (French)\n                         In school, the Sisters said testing\n                         was my specialty.\n\n                                   PASSENGER\n                         Captain...\n\n               Driven to distraction, The Captain turns his attention for a\n               moment to a passenger introducing his wife.\n\n                                   PASSENGER (CONT'D)\n                         My wife...\n\n                                   CAPTAIN\n                         Enchante...\n\n               ANGLE ON: Trillian, turning from the captain into the crowd.\n               C.U. on her hand by the side of her dress. A man's wallet\n               held surreptitiously. Her fingers open the wallet, extract a\n               thin gold card with a black stripe. She discards the wallet,\n               keeps the card, and disappears into the crowd.\n\n                                                       CUT TO:\n\n        28     FUJI MARU BRIDGE - NIGHT                                28\n\n               Top of the line. State of the art. The crew is multinational.\n               English is the common language, but everyone has an accent.\n               Canton, the picture of self-satisfaction, enters, sipping\n               champagne.\n\n                                   CANTON\n                         You wanted to see me Captain?\n\n               The Captain stands next to a bank of LASER IMAGING SYSTEMS.\n               Canton steps up. Looks down at the THERMAL RADAR IMAGER.\n               Multi-colored LASER IMAGES.\n\n                                   CAPTAIN\n                         We have a storm rising behind us...\n                         we may have to close the canopy, I\n                         hope it doesn't ruin your party.\n\n                                   CANTON\n                             (self-satisfied)\n                         Ruin my party? Captain, this ship\n                         was built to withstand a typhoon. I\n                         can't imagine there's anything on\n                         the sea today that could possibly\n                         ruin my party.\n\n                                                       SMASH CUT TO:\n\n        29     JETFOIL - NIGHT                                         29\n\n               C.U. A crowbar quietly pops the top off a wooden crate to\n               reveal the lethal looking tip of a torpedo...PULL BACK TO:\n               Pantucci in the storage hold, surrounded by half a dozen\n               crates, his wily eyes popped wide with apprehension. He licks\n               his lips nervously, looks around and whispers into his\n               headset.\n\n                                   PANTUCCI\n                             (whispers)\n                         Finnegan...Finnegan...\n\n               A hand falls on his shoulder, spinning him around to a fist\n               coming right into his face.\n\n                                                       CUT TO:\n\n        30     PILOT HOUSE - NIGHT                                     30\n\n               Jimi Hendrix. THE STAR SPANGLED BANNER. Blasting. As the Jet\n               foil rockets across the waves. Leila, stripped out of her\n               soaking wet clothes, down to her panties and bra, stands\n               wiping her dripping wet, magnificently ripped body, with a\n               dry towel. Leila puts her fingers in her ears.\n\n                                   LEILA\n                         Gum kwa she bam dok.\n\n                                   FINNEGAN\n                         It's not noise...it's genius...\n\n               And then over the headset, over the Hendrix...\n\n                                   PANTUCCI (V.O.)\n                         FINNEGANNNN!!\n\n               Followed by the unmistakable sound of fist hitting flesh.\n               Finnegan and Leila trade a look.\n\n                                                       CUT TO:\n\n        31     HOLD - NIGHT                                            31\n\n               A massive fist plows into Pantucci's stomach. He drops from\n               the arms of MULLIGAN, a scar-faced Irishman with a buzz cut.\n               As quickly as he is doubled over he is yanked up straight by\n               the man who hit him, VIVO, a merciless Maori, covered by\n               tattoos, topped off with venom.\n\n                                   MULLIGAN\n                         You know what my goal is? Before I\n                         die I want to make love to a woman\n                         from every country on earth.\n\n                                   VIVO\n                         You mean countries that are\n                         acknowledged by the UN...or like\n                         made up countries too?\n\n                                   MULLIGAN\n                         What the hell does that mean?\n\n                                   VIVO\n                         Like Mamooli's country...\n\n                                   MAMOOLI\n                         What you talkin'? Samoa's a county!\n\n                                   VIVO\n                         It's a dot on a map...\n\n                                   MULLIGAN\n                         Map...no map...I don't give a shit\n                         ...they got women on Samoa, it's on\n                         the list.\n\n                                   HANOVER\n                         Mr. Billy you're in the batter's\n                         box.\n\n               Hanover watches calmly as BILLY, the Aborigine, cracks his\n               fist against the side of Pantucci's head, knocking him out of\n               Vivo's arms.\n\n                                   BILLY\n                         At home we denosy the nosy.\n\n               BILLY hoists Pantucci. He draws his knife under Pantucci's\n               bloody nose.\n\n                                   HANOVER\n                         We're not savage here Mr. Billy...\n                         we're professionals. Hold him...Mr.\n                         Chin...\n\n               The Chinese merc steps forward, and whaps Pantucci upside the\n               head with a cruelly accurate crescent kick. Pantucci hits the\n               wall hard, crumbling. Chin lifts him.\n\n                                   HANOVER (CONT'D)\n                         Anyone else?\n\n               Massive Mason steps forward.\n\n                                   MASON\n                         I'll take a go and the I vote we\n                         throw the little weasel\n                         overboard...\n\n                                   MULLIGAN\n                         I vote we slit his throat THEN\n                         throw him overboard...\n\n               Mason raises his ham of a fist drawing his tree trunk arm\n               back, taking dead aim at Pantucci's face. He never gets the\n               punch off. His arm is caught from behind. He looks over his\n               shoulder to Finnegan. Gripping his wrist. Right in his face.\n\n                                   FINNEGAN\n                         ...this is not a democracy. You\n                         don't get a vote.\n\n               Mason, enraged, swings with his free hand. Finnegan twists\n               his arm sharply, sending Mason's head into the steel wall,\n               knocking the big man senseless. The other mercenaries go to\n               draw their weapons. Before the guns are out of holsters,\n               Finnegan swings a spear gun into Hanover's face, an inch from\n               his eye.\n\n                                   FINNEGAN (CONT'D)\n                         I'll say it again for the hearing\n                         impaired...\n\n               Finnegan cocks the spear. CLICK! Hanover does not blink.\n               Everyone freezes. With his free hand Finnegan lifts Pantucci\n               to his unsteady feet, the spear stays poised. Finnegan backs\n               out of the room.\n\n                                   HANOVER\n                         This isn't right Finnegan. I've got\n                         a contract.\n\n                                   FINNEGAN\n                             (RECITING)\n                         20 hours on the clock. Out and\n                         back. Double for overtime.\n\n                                   HANOVER\n                         And no questions asked.\n\n                                   FINNEGAN\n                         Who asked any?\n\n                                   HANOVER\n                         He did...with a crowbar...you know\n                         the rules on a broken contract.\n\n                                   FINNEGAN\n                         I know it...but you want to get\n                         where you want to get, and back? I\n                         need a chief engineer, and unless\n                         you got a replacement, I'd highly\n                         recommend overlooking the\n                         indiscretion.\n\n               With that Finnegan leads Pantucci out of the hold, slamming\n               the door behind him.\n\n                                   PANTUCCI\n                         Thanks...\n\n               Finnegan turns his gaze to Pantucci. It makes the smaller man\n               quiver.\n\n                                   FINNEGAN\n                         You put me in that position again\n                         I'll throw you overboard myself.\n\n               Finnegan stalks off. Pantucci swallows hard, knowing he means\n               it.\n\n                                                       CUT TO:\n\n        32     FUJI MARU - NIGHT                                       32\n\n               A man strides down the hall of an executive passageway, his\n               face obscured in shadows. He has a CANISTER in his hands.\n               Walks through a door MARKED:\n\n               \"AUTHORIZED PERSONNEL ONLY\"\n\n                                                       CUT TO:\n\n        33     COMPUTER/CONTROL MONITOR ROOM - NIGHT                   33\n\n               The brain center for the whole ship. Rows of computer\n               mainframes, laser-guided imagers and D.T. processors. No\n               humans needed. And none are present. Except one -- \n\n               The Man strides purposefully down a row of computers, makes a\n               left, then a right. He knows exactly where he's going. He\n               arrives at an ultra-high-tech CONSOLE. The cerebellum. Three\n               similar canisters are plugged into the console. The Man\n               unscrews the middle canister. Screws his canister into its\n               place. Sets the TIMER to 0:300 hours. Pushes a button. The\n               TIMER starts to COUNT DOWN.\n\n                                                       CUT TO:\n\n        34     THE FUJI MARU - NIGHT                                   34\n\n               All LIT UP and looking beautiful. The wind is stronger. The\n               party is wilder. The BAND louder. The people drunker. Rain\n               begins to fall. Everybody moans and heads for cover. \n\n               The deck's huge hydralic canopy begins to close, reviving the\n               party spirit.\n\n                                                       CUT TO:\n\n        35     VAULT ROOM - NIGHT                                      35\n\n               A gold card with a black stripe slides into the security lock\n               of a high tech vault. Lights blink. Tumblers roll. One after\n               another the electronic locks unlock. \n\n               Trillian stands back as the massive vault door swings open.\n               With a quick look over her shoulder, she enters the vault.\n\n                                                       CUT TO:\n\n        36     VAULT - NIGHT                                           36\n\n               Trillian consults a list, looking for one very specific vault\n               box.\n               Finding it, she pulls a lock pick from her fabulous coiffure,\n               and picks the lock in nothing flat. A pro. Flipping open the\n               box, Trillian removes the only thing she came for. A dazzling\n               diamond ring with the center stone the size of an egg. With a\n               twist, she pops the stone from the setting, holds it up to\n               admire it in the light...\n\n                                   CANTON (V.O.)\n                         It is an amazing stone...\n\n               Trillian grits her teeth, and turns to...Canton, the Captain,\n               and two burly Chinese security men.\n\n                                   CANTON (CONT'D)\n                         ...what were you planning on doing\n                         with it?\n\n                                   TRILLIAN\n                         Retiring.\n\n                                   CANTON\n                         Well you can still proceed with\n                         your plans then...in\n                         prison...Captain... escort the\n                         lady...\n\n               Canton exits. The Captain steps forward, and removes the\n               diamond ring from Trillian's hand.\n\n                                   CAPTAIN\n                         Mademoiselle...you are not a lady.\n\n               He slaps her across the face. Trillian flushes, touches the\n               drop of blood at her lip...and decks the Captain with a\n               vicious right cross.\n\n                                   TRILLIAN\n                         And you...Monsieur...you are not a\n                         gentleman.\n\n                                                       CUT TO:\n\n        37     VEGETABLE LOCKER - NIGHT                                37\n\n               A hatch door bursts open. Trillian is thrown inside. The DOOR\n               SLAMS SHUT. Trillian looks around. No windows. One door. Lots\n               of fruit and vegetables. \n\n               Trillian accepts the hopelessness of her situation. She takes\n               an apple, sits down and bites deeply, running her options.\n\n                                                       CUT TO:\n\n        38     COMPUTER/CONTROL MONITOR ROOM - SAME TIME               38\n\n               The CANISTER TIMER finishes counting down -- 4 -- 3 -- 2 --\n               1. It suddenly EMITS a high-energy HUM. Intense electro\n               static, which builds into...\n\n                                                       CUT TO:\n\n        39     SAIPAN PILOT HOUSE - NIGHT                              39\n\n               ...A screeching guitar solo... The Allman Brothers Band\n               pulses out of the speakers. Finnegan is prepping the wound\n               over Pantucci's eye for sutures. \n\n               As he swabs it carefully, Leila is at the helm keeping the\n               speeding, bouncing, boat on course.\n\n                                   PANTUCCI\n                         Here's what I think...I think these\n                         mokes below are a hit squad.\n\n                                   FINNEGAN\n                         I saw these guy perform...at\n                         Altmont ...you know that? They\n                         opened for the Stones...\n\n               He carefully threads the surgical needle.\n\n                                   PANTUCCI\n                         Right now...there's some bozo\n                         sitting on his yacht at those\n                         coordinates they gave us, sipping\n                         his scotch and soda...totally\n                         unawares that we are about to\n                         deliver 500 kgs of high power\n                         torpedo to light up his\n                         ass...that's what's down there in\n                         that hold and who knows what the\n                         hell else...\n\n                                                       CUT TO:\n\n        40     HOLD - NIGHT                                            40\n\n               The top of another wooden crate is popped revealing the\n               answer to Pantucci's question: a chilling display of\n               firepower. Pulse rifles. Hand held gatling guns with laser\n               sightings. Oblong grenades. The latest in death delivery\n               systems. \n\n               Hanover and his men lift and load. Slamming shells into\n               chambers. KA- CHANG! KA-CHANG! KA-CHANG! These boys know\n               their toys.\n\n                                                       CUT TO:\n\n        41     PILOT HOUSE - NIGHT                                     41\n\n                                   FINNEGAN\n                         Hold still now...I was like three\n                         rows back.\n\n               Finnegan centers the needle over Pantucci's wound.\n\n                                   FINNEGAN (CONT'D)\n                         ...Jagger was here...I was here...\n\n                                   PANTUCCI\n                         You don't give a shit about\n                         anything do you?\n\n                                   FINNEGAN\n                         Sure I do...I give a shit that at\n                         0300 hour we reach our point of\n                         destination. I give a shit that\n                         those mojos got to do what they got\n                         to do, and 45 minutes later we are\n                         turn around and gone. I give a shit\n                         that by the time the sun comes up\n                         we are all safely tucked in bed.\n\n                                   PANTUCCI\n                         That's it? That's all you give a\n                         shit about?\n\n                                   FINNEGAN\n                         Oh yeah...and that my stitch job\n                         doesn't make you uglier than you\n                         already are...this won't hurt a\n                         bit...\n\n               Finnegan sinks the needle into the wound. Pantucci's SCREAM\n               rises above the music.\n\n                                                       CUT TO:\n\n        42     FUJI MARU - NIGHT                                       42\n\n               The Fuji Maru cruises through RAIN-LASHED waters. Accompanied\n               by a very scary MUSICAL SCORE. Then suddenly, in the extreme\n               foreground, AIR BUBBLES angrily GURGLE to the surface. Then a\n               WAVE EXPLODES, as if THRASHED from below.\n               Then another WAVE EXPLODES, forty feet to the right. Then\n               ANOTHER, eighty feet to the left. And then ALMOST SEEN: Huge,\n               black, ominous THINGS seem to be SQUIRMING beneath the water.\n               Heading for the Fuji Maru.\n\n                                                       CUT TO:\n\n        43     CRYSTAL FOREDECK - NIGHT                                43\n\n               RAIN PELTS the canopy. LIGHTNING FLASHES. THUNDER RUMBLES. We\n               can HEAR the PARTY inside. MUSIC, laughs and cheers.\n\n                                                       CUT TO:\n\n        44     THE BRIDGE - NIGHT                                      44\n\n               The entire ROOM seems to be FRITZING OUT. The lights crackle\n               on and off. The Captain stands behind the bank of failing\n               IMAGING SYSTEMS, growing edgier by the moment.\n\n                                   MATE\n                         The entire bridge electrical system\n                         is shutting down sir!\n\n                                   CAPTAIN\n                         Switch over to auxiliary power, and\n                         run a circuit check.\n\n                                   MATE\n                         Yes sir...\n\n               The COM. OFFICER is busy fiddling with the communications and\n               imaging gear. DISTORTED LIGHTS from the scrambled systems\n               plays off their faces.\n\n                                   COM. OFFICER\n                         We're losing radar and sonar!\n\n                                   FIRST MATE\n                         Communications systems are out sir!\n\n               The Captain is confounded, on the edge of panic. Canton\n               hurries onto the bridge.\n\n                                   CANTON\n                         What the hell is going on?\n\n                                   CAPTAIN\n                         Communication systems have failed!\n                         Radar...sonar...radios...I don't\n                         understand it.\n\n                                   MATE\n                         Maybe it's the storm!\n\n                                   CANTON\n                         Nonsense! We're impervious to\n                         weather!\n\n                                   FIST MATE\n                         We have a main frame meltdown!!\n\n                                   CANTON\n                         Well unmelt it!!\n\n               Canton storms out. Every piece of electrical equipment on the\n               bridge starts to shut down.\n\n                                                       SMASH CUT TO:\n\n        45     HULL - NIGHT                                            45\n\n               Where the waves meet the hull, A BALLAST HOLE excretes water.\n               Suddenly, near the ballast hole, a WAVE EXPLODES, thrashed\n               from below. Accompanied by the scary foreboding MUSIC again.\n\n                                                       CUT TO:\n\n        46     VEGETABLE STORAGE - NIGHT                               46\n\n               Trillian, making the best of a bad situation, is just putting\n               the finishing touches on a wonderful salad culled from the\n               stores. As she sits down, spreading a makeshift napkin on her\n               lap just so, a violent SUCKING SOUND comes from above her.\n               Trillian's eyes shoot upward. A VICIOUS GURGLING SOUND RACES\n               through a large PIPE along the ceiling. Trillian leaps to her\n               feet. Backs away. A little spooked.\n\n                                                       CUT TO:\n\n        47     STATEROOM BATHROOM - NIGHT                              47\n\n               An elegant woman sits on the toilet, her gown hiked up\n               inelegantly, reading \"Vogue.\" As she turns the page the same\n               strange sound, a violent sucking, comes from inside the\n               walls, startling her. She looks around the room. Can't see\n               anything. Shrugs it off. Goes back to her magazine. Turns\n               another page.\n\n               A LONG SCARY BEAT.\n\n               And then suddenly -- She SHUDDERS VIOLENTLY and gives a sharp\n               CRY. Her eyes filled panic. She tries to stand, but she's\n               JERKED BACK DOWN! Her ARMS FLAIL WILDLY.\n               Scattering stuff off the counter. She tries to SCREAM, but it\n               comes out more like a GURGLE. Below her, in the TOILET, there\n               is a hideous SLURPING SOUND. She manages a final, desperate\n               scream, a high-pitched WAIL. \n\n               Which nobody hears because...\n\n                                                       CUT TO:\n\n        48     POOL DECK - NIGHT                                       48\n\n               ...the Band has kicked into another ROCK SONG. The drunken\n               revelers whoop and holler, dancing with reckless abandon\n               ignoring the THUNDER and LIGHTNING. And then...with a loud\n               BASSO PROFUNDO CLANG, the CRUISE LINER JERKS TO A STOP.\n               EVERYTHING goes CRASH. PEOPLE TUMBLE. TABLES TOPPLE. The\n               MUSIC STOPS as the entire Band falls into the pool.\n\n                                                       CUT TO:\n\n        49     VEGETABLE STORAGE - NIGHT                               49\n\n               Trillian goes ass-over-teacups, rolling over just in time to\n               see a wall of BOXES CRASHING straight down on her. SMASH!\n               She's knocked out cold.\n\n                                                       CUT TO:\n\n        50     WATERSPORT PLATFORM - NIGHT                             50\n\n               One of the SPEEDBOATS breaks free of its harness. TOPPLES\n               over the side and drops down into the sea. SPLASH!\n\n                                                       CUT TO:\n\n        51     POOL DECK - NIGHT                                       51\n\n               Everything goes quiet. Everybody freezes. Panic is a\n               heartbeat away.\n\n               A FLASH OF LIGHTNING lights up the top of the canopy. The\n               passengers begin to mutter fearfully. From his perch, Canton\n               fights down his own panic, and addresses the crowd in calm\n               reassuring tones.\n\n                                   CANTON\n                         Ladies and gentlemen...your\n                         attention please... Ladies and\n                         gentlemen...\n\n               The disquieted crowd turns to Canton.\n\n                                   CANTON (CONT'D)\n                         This is the most technologically\n                         advanced sailing vessel on the\n                         water today. Every problem has been\n                         anticipated...the Captain has\n                         assured me that we will be up and\n                         running in no time...so enjoy\n                         yourselves...there's nothing to\n                         worry about...\n\n               Suddenly, and quite violently, a WOMAN is SUCKED UNDER THE\n               WATER -- THWUP! Others swimmers notice and freeze. The Woman\n               doesn't come back up. And then, THREE more SWIMMERS are\n               violently JERKED UNDER. All the people in and around the pool\n               see this and panic. SCREAMING. YELLING. SWIMMING. SWIMMING\n               and RUNNING. A CRACK OF THUNDER! The Captain calls out --\n\n                                   CAPTAIN\n                         Remain calm! Stop! Do you hear?\n\n               REMAIN CALM! The pool clears. Everybody backs the hell away\n               from it. The WATER in the pool BUBBLES, and GURGLES, and then\n               goes quiet. And then, from somewhere deep within the bowels\n               of the ship, comes a loud, eerie, primordial YOWL. WE PUSH IN\n               ON CANTON: His eyes slowly widen. Stunned. His calm replaced\n               by pure terror.\n\n                                   CANTON\n                         Dear God.\n\n                                                       CUT TO:\n\n        52     SOUTH CHINA SEA - NIGHT                                 52\n\n               Off in the distance is the cruiseliner. WE HOLD FOR A LONG,\n               SILENT, EERIE BEAT. And then the SCREAMING begins...\n\n                                                     SLOW DISSOLVE TO:\n\n        53     SAIPAN - NIGHT                                          53\n\n               Blasting through increasingly stormy seas.\n\n                                                       CUT TO:\n\n        54     PILOT HOUSE - NIGHT                                     54\n\n               Finnegan notices Billy, Mulligan and Vivo setting two\n               catapult like devices on the front of the deck.\n\n                                   FINNEGAN\n                         Leila see what they're up to...\n\n               Leila exits. Finnegan's eyes go up from the action on deck to\n               the radar screen, where a blip, fast moving, right toward the\n               jet foil catches his attention.\n\n                                   FINNEGAN (CONT'D)\n                         What the hell...\n\n                                                       SMASH CUT TO:\n\n        55     SAIPAN - NIGHT                                          55\n\n               A FLASH OF LIGHTNING REVEALS -- The speedboat from the Fuji\n               Maru hurtling at the hull! BAAROOOOM!!! The speedboat slams\n               into the Saipan. Instant FIREBALL. \n\n               ANGLE ON: The mercs and Leila slammed to the deck.\n\n                                                       SMASH CUT TO:\n\n        56     HOLD - NIGHT                                            56\n\n               A GASH is RIPPED out of the bow. METAL FLIES. WATER SPRAYS.\n               The new HOLE VOMITS FLAME. Spewing it over the crates.\n               Hanover and the rest of his men are blown against the walls.\n\n                                                       CUT TO:\n\n        57     ENGINE ROOM - NIGHT                                     57\n\n               Pantucci DIVES as flying SHRAPNEL PEPPERS the two engines.\n               Instantly kills one engine. Maims the other. A FIRE starts.\n\n                                                       CUT TO:\n\n        58     PILOT HOUSE - NIGHT                                     58\n\n               RED WARNING LIGHTS flash and blink. Lighting up the console.\n               The left steering stick dies in Finnegan's hand.\n\n                                   FINNEGAN\n                         Joey!! Talk to me!\n\n                                                       CUT TO:\n\n        59     ENGINE ROOM - NIGHT                                     59\n\n               Mayhem... Fire spews out of the engines. Pantucci sprays a\n               fire extinguisher frantically. Where the shrapnel entered the\n               hull water now spurts with every wave. Smoke and water, oil\n               and fire.\n\n                                   PANTUCCI\n                         Jezebel's dead...Hercules is right\n                         behind her! We got a gusher in the\n                         hull!\n\n                                                       CUT TO:\n\n        60     PILOT HOUSE - NIGHT                                     60\n\n               As the Saipan comes to a halt, Finnegan loses play in his\n               remaining stick.\n\n                                   FINNEGAN\n                         Shit!!\n\n               Finnegan locks the sticks down, and runs out.\n\n                                                       CUT TO:\n\n        61     HOLD - NIGHT                                            61\n\n               TRACK WITH Finnegan running through the smoke filled hold,\n               past Hanover and the merc's who are pulling themselves off\n               the floor, right into the...\n\n               ENGINE ROOM. Where Pantucci is beside himself in smoke and\n               sputtering flame.\n\n                                   PANTUCCI\n                         What did you do to my kids!!\n\n                                   FINNEGAN\n                         Me??\n\n                                   PANTUCCI\n                         No! The man in the moon!! Who's\n                         driving this thing?\n\n               Finnegan notices something on the floor. He picks up a shard\n               of the speedboat propeller. Strange. Hanover steps into the\n               room.\n\n                                   HANOVER\n                         What happened?\n\n               Finnegan looks at the piece of speedboat in his hand.\n\n                                   FINNEGAN\n                         We ran into a speedboat...\n\n               He shows the piece of speed boat to Hanover. Who stares at\n               it. Finnegan sees the hint of recognition in his eyes.\n\n                                   FINNEGAN (CONT'D)\n                         Speedboat in the middle of the\n                         ocean...\n\n                                   HANOVER\n                         How soon can we get up and running?\n\n                                   FINNEGAN\n                         We can't...we got one engine dead,\n                         and the other limping badly.\n\n                                   HANOVER\n                         I have a schedule...\n\n                                   PANTUCCI\n                         I spent two years building these\n                         things...screw your schedule!\n\n               Mason grabs Pantucci by the throat, lifting him off the\n               ground.\n\n                                   MASON\n                         You little weasel!\n\n               Finnegan slams the piece of speed boat into the back of\n               Mason's knees buckling him to the floor. In the blink of an\n               eye there is the barrel of a .45 pressed hard against his\n               head, Hanover at the trigger end.\n\n                                   HANOVER\n                         We were talking about my\n                         schedule...\n\n                                   FINNEGAN\n                         You're going to have to get a new\n                         one.\n\n                                   HANOVER\n                         Not an option.\n\n                                   FINNEGAN\n                         Then you better start swimming.\n\n               Hanover cracks Finnegan across the face with the barrel of\n               the gun. Finnegan's head spins. He touches the corner of his\n               mouth, and comes away with blood, and a look of murder in his\n               eyes. Hanover slams a round in the chamber.\n\n                                   HANOVER\n                         One more joke and your comedy\n                         career is over. Now fix this.\n\n                                   PANTUCCI\n                         With what? Look at them...they need\n                         gears...cylinder heads...oil\n                         pans... we're in the middle of the\n                         goddamn ocean...\n\n                                   FINNEGAN\n                         I think he knows that Joey.\n\n                                   PANTUCCI\n                         Good! So maybe he also know where\n                         the hell am I going to get the\n                         parts I need...\n\n               Mulligan comes running in.\n\n                                   MULLIGAN\n                         Target in sight!!\n\n                                                       CUT TO:\n\n        62     SAIPAN - NIGHT                                          62\n\n               Everybody stands on deck as Hanover scans the darkness\n               through a pair of infrared binoculars.\n\n                                   HANOVER\n                         Contact verified! You know the\n                         drill gentlemen!\n\n               The merc's scatter below deck. Hanover hands the binoculars\n               to Finnegan.\n\n                                   HANOVER (CONT'D)\n                         Care to see what dreams are made of\n                         Finnegan?\n\n               Finnegan's POV through the binoculars. The Fuji Maru in the\n               distance, lit up, beautiful.\n\n                                                       CUT TO:\n\n        63     DECK - NIGHT                                            63\n\n               BAM! BAM! Two grappling hooks fly from the barrels of the two\n               catapults bolted to the deck, landing on the deck of the Fuji\n               Maru, which looms above the Saipan. Vivo pulls on the lines\n               until they go taut. Finnegan, Pantucci, and Leila stand by\n               watching as the mercs in full assault gear, communication\n               headsets in place, get ready for action.\n\n                                   VIVO\n                         Lines set.\n\n               Mason swivels the big HARPOON GUN on the bow.\n\n                                   MASON\n                         Tow lines!\n\n                                   VIVO\n                         Clear!\n\n               He FIRES the HARPOON. It shoots and SLAMS into the rear deck\n               of the Fuji Maru.\n\n                                   MASON\n                         Tow line secure.\n\n                                   HANOVER\n                         Secure the zone of operation!!\n\n               Swift, athletic, the mercs leap onto the lines and scramble\n               hand over hand toward the Fuji Maru's deck.\n\n                                   HANOVER (CONT'D)\n                         When I was a little bit of a\n                         pissant we lived down the road from\n                         where all the big cruise ships used\n                         to come into Sydney harbor...\n\n               The first mercs reach the Fuji Maru's deck, and toss life\n               lines down to Hanover.\n\n                                   HANOVER (CONT'D)\n                         Mum and me we used to sit by our\n                         front door and watch them...she\n                         used to say \"one day you're going\n                         to make your fortune in life on one\n                         of them...\"\n\n               Hanover hands one line to Finnegan, one to Pantucci. The\n               third he attaches around his waist.\n\n                                   FINNEGAN\n                         Great woman your mother. Real\n                         foresight.\n\n                                   HANOVER\n                         And she could do a hell of a barbie\n                         to boot! Belt up. You'll find all\n                         the parts you need up there.\n\n               Finnegan and Pantucci comply.\n\n                                   FINNEGAN\n                         I assume somebody up there has made\n                         sure no distress signal can be\n                         sent.\n\n                                   HANOVER\n                         I'd say that's a pretty good\n                         assumption.\n\n                                   PANTUCCI\n                             (nervous)\n                         You know the crew could be armed.\n\n                                   HANOVER\n                         With what? Martinis and tanning\n                         oil?\n\n               Hanover hand signals to his men above. The lines go taut.\n               Finnegan, Pantucci, and Hanover are hoisted to the deck of\n               the Fuji Maru.\n\n                                                       CUT TO:\n\n        64     FUJI MARU DECK - NIGHT                                  64\n\n               Deathly silent. Not a soul is about. The mercs are deployed\n               in a close military defense pattern.\n\n                                   HANOVER\n                         Synchronize watches...\n\n               Everyone hits a button on their watches.\n\n                                   HANOVER (CONT'D)\n                         25 minutes...by the numbers. Engine\n                         room and machine shop are on the\n                         third sub deck...Vivo...Mulligan go\n                         with them...keep in touch...move\n                         out...\n\n                                                       CUT TO:\n\n        65     SAIPAN ENGINE ROOM - NIGHT                              65\n\n               A thick black hose weaves it's way across the flooded floor,\n               sucking water. Leila up to her knees in water, wearing a\n               blast visor, stripped down to her skivvies, wields a welder\n               against the gaping hole in the hull. As the boat dips in the\n               waves water sloshes in. Billy sits on the stairs trying to\n               stay dry. He goes to light a cigarette.\n\n                                   LEILA\n                             (angry)\n                         Kwan bat! Kwam bat! Booom!!\n\n               She points the acetalyne tank she works with.\n\n                                   BILLY\n                             (bothered)\n                         Yeah...yeah...yeah...\n\n               Billy heads for the deck. Leila looks after him in disgust.\n\n                                   LEILA\n                         Asshole...\n\n               She ignites her torch, is about to flick her visor down again\n               when a loud gurgling, a sucking sound, stops her. She cuts\n               the torch. Looks around nervously...and then she spots the\n               suction hose sucking away. \n\n               She smiles to herself. Flips the visor, fires the torch, and\n               goes back to work.\n\n                                                       CUT TO:\n\n        66     FUJI MARU DECK PASSAGEWAY - NIGHT                       66\n\n               An alert Mulligan leads Finnegan and Pantucci around a\n               corner. Vivo brings up the rear.\n\n                                   PANTUCCI\n                         You'd think they'd set a deck\n                         watch...\n\n               FLASH TO: The deck full of people partying, carousing. The\n               railing is lined with 15 lifeboats suspended in their\n               harnesses. \n\n               FLASH BACK TO: Mulligan, Finnegan, Pantucci and Vivo staring\n               at a completely deserted deck. The lifeboat harnesses swing\n               in the breeze, eerily empty. Mulligan looks back to Vivo.\n\n                                   MULLIGAN\n                         I thought the plan was we'd\n                         evacuate them after we got through.\n\n                                   VIVO\n                         Maybe plans changed...\n\n                                   MULLIGAN\n                         Plans don't change...\n\n                                   PANTUCCI\n                         Maybe it's the wrong ship.\n\n                                   MULLIGAN\n                         Shut up!\n\n               And then a strange yowl echoes from somewhere deep in the\n               bowels of the ship. Finnegan and Pantucci trade a look.\n\n                                   FINNEGAN\n                         Let's just keep going.\n\n                                   MULLIGAN\n                             (nervous)\n                         You ain't giving the orders here!\n\n               And again the yowl. Everyone freezes.\n\n                                   MULLIGAN (CONT'D)\n                         Let's keep going!\n\n                                                       CUT TO:\n\n        67     CRYSTAL POOL DECK - NIGHT                               67\n\n               Hanover, Mason, and Chin set foot on the deserted pool deck.\n\n               FLASH TO: The pool deck is jammed with people partying. The\n               band playing. Two kids toss a beach ball back and forth. The\n               ball flies over one boy's head... \n\n               FLASH BACK TO: The ball falls into the empty pool...Where the\n               band's instruments litter the bottom along a big jagged\n               crack.\n\n                                   MASON\n                         What the...\n\n               Uneasy, Hanover and his men look around at the over turned\n               chairs. The smashed aquarium. Chin bends down and picks up a\n               small squid from the bottom of the smashed aquarium. The\n               squid wraps its tentacles around Chin's hand almost\n               immediately. Chin regards it with curiosity.\n\n                                   HANOVER\n                         Focus on the task Mr. Chin...\n\n               ...and then the yowl freezes them. C.U. on Hanover's face.\n               His eyes flicker with uncertainty...and a tinge of fear.\n\n                                                       CUT TO:\n\n        68     GRAND ATRIUM LOBBY - NIGHT                              68\n\n               DING! FLASH TO: A glass elevator descending through the\n               spectacular atrium, full of elegant well-dressed people\n               laughing, chatting. \n\n               DING! FLASH BACK TO: Mulligan, Vivo, Pantucci, and Finnegan,\n               standing amidst the shattered glass and broken furniture,\n               whirling to the elevator door opening. Mulligan, nerves\n               ajangle, and Vivo, swing their pulse rifles up hard as the\n               door opens to reveal...and empty elevator! DING! The door\n               closes. The car starts to ascend in the eerie silence. The\n               mercs watch it go with growing uneasiness.\n\n                                                       CUT TO:\n\n        69     FUJI MARU BRIDGE - DAWN                                 69\n\n               The door to the bridge is KICKED OPEN. Mason and Chin leap\n               inside. Guns out front. On edge. The overhead lights flicker\n               on and off. The imager screens are all black. The STEERING\n               WHEEL slowly ROCKS. As if an invisible captain is steering a\n               ghost ship. Hanover ENTERS. Eyes shifting. Suspicious, and a\n               bit nervous.\n\n                                   HANOVER\n                         What the hell is going on?\n\n                                                       CUT TO:\n\n        70     THE FRISCO BAR AND CASINO - DAWN                        70\n\n               Mulligan leads Finnegan, Pantucci, Vivo into the casino. The\n               place looks like a mess. Tables and chairs are upended.\n               Glasses and bottles are shattered everywhere. And there's\n               BLOOD on the floor. \n\n               A BELL RINGS LOUDLY and the TROLLEY CAR STARTS TO MOVE!\n\n                                   ELECTRONIC VOICE\n                         Next stop, Chinatown!\n\n               Everyone jumps, freaked. Mulligan and Vivo spin around and\n               OPEN FIRE. Start BLOWING the shit out of the TROLLEY CAR. The\n               GUNS sound like nothing we've ever heard. ROLLING THUNDER.\n               Absolutely deafening.\n\n                                                       CUT TO:\n\n        71     FUJI MARU - DAY                                         71\n\n               The GUNFIRE ECHOES through the hull. Suddenly, with a loud\n               SPLASH, a sixteen-foot-long LIFEBOAT pops to the surface.\n               Then another LIFE BOAT POPS UP. Then ANOTHER. Then THREE MORE\n               off to the port side. Then TWO MORE off to the starboard.\n               It's as if the SOUND of the GUNFIRE is somehow releasing the\n               boats from their watery graves. They start to drift away.\n               Spooky quiet.\n\n                                                       CUT TO:\n\n        72     FRISCO BAR AND CASINO - NIGHT                           72\n\n               BULLETS RAKE the Trolley's metal sides. The WINDSHIELD\n               EXPLODES. Finnegan yells at Mulligan and Vivo --\n\n                                   FINNEGAN\n                         Guys!! Whoa! WHOA! WHOA! WHOOOAAA!!\n\n               Finnegan finally tilts the muzzle of Mulligan's gun to the\n               ceiling. They stop firing. A little wigged-out. Their\n               professional demeanor going by the boards. All goes quiet.\n               They look at Finnegan, who is the picture of calm.\n\n                                   FINNEGAN (CONT'D)\n                         Guys...get a grip.\n\n               The Trolley car reverses. The ELECTRONIC VOICE is now CRACKED\n               --\n\n                                   ELECTRONIC VOICE\n                         Next stop, Fisherman's Wharf.\n\n               Mulligan whirls, his gun poised. Just then his headset\n               crackles.\n\n                                   HANOVER (V.O.)\n                             (radio filtered)\n                         This is Red One...status report.\n\n               Finnegan leans in towards Mulligan's mike.\n\n                                   FINNEGAN\n                             (into radio)\n                         Your boys just killed a trolley car\n                         Red One.\n\n               Mulligan pulls the radio away.\n\n                                   MULLIGAN\n                             (into radio)\n                         We been down three decks, there's\n                         nobody home... Total spooky-town.\n                         Advise on how to proceed.\n\n                                                       CUT TO:\n\n        73     CONNING TOWER - NIGHT                                   73\n\n               Hanover looks around at the empty bridge, the blinking\n               lights.\n\n                                   HANOVER\n                         Stay to the schedule. Stay to the\n                         plan. Nothing has changed.\n\n               But the look in Hanover's slightly unnerved eyes tells a\n               different story.\n\n                                                       CUT TO:\n\n        74     FUGI MARU STORAGE ROOM - DAY                            74\n\n               Trillian goggily crawls out from under a mound of boxes. Her\n               left eye's got a nice purple shiner. Her elegant gown is\n               ripped. \n\n               A VERY STRANGE SOUND coming from behind the wall. Wet. Gooey.\n               Slithery. Ominous. \n\n               Trillian freezes.\n\n                                   TRILLIAN\n                         Hello?\n\n               The SOUND slowly MOVES across the wall. Then another WALL\n               starts to GURGLE. Trillian spins around. She forces herself\n               not to panic. Very cautiously, taking small measured steps\n               she reaches the handle to the freezer, and tries to open it.\n               No go. \n\n               The gurgling ripples above her. Her mouth goes dry as her\n               eyes follow the sound across the ceiling. Her hand goes to\n               her hair. She pulls her lock pick out, and very slowly kneels\n               down until she is eye level with the door lock. She begins to\n               pick her way out, her ears and eyes following the gurgling\n               above. Suddenly the sound stops. The silence makes Trillian's\n               heart sound that much louder. She sidles close to the wall.\n\n                                   TRILLIAN (CONT'D)\n                         Hello?\n\n               Still silence. Cautious, she taps on the wall. For a moment\n               nothing. And then... \n\n               WHAMM!! \n\n               Something slams against the wall from the other side in\n               response. Trillian falls back against the door, her heart in\n               her throat.\n\n                                                       CUT TO:\n\n        75     ENGINE CHAMBERS - DAY                                   75\n\n               A MAZE of pipes, hoses, gears, engines and catwalks. THINGS\n               are HISSING, HUMMING, RUMBLING and CLANKING. A spooky place.\n               Dark. Damp. Eerie. Ominous. Mulligan and Vivo, looking more\n               nervous by the moment, lead the way. Finnegan and Pantucci\n               follow.\n\n                                   PANTUCCI\n                             (rattling, nervous)\n                         You know what I'm gonna do after\n                         this...I'm gonna get a normal\n                         life...\n\n                                   FINNEGAN\n                             (calm)\n                         Joey...\n\n                                   PANTUCCI\n                         ...Like a house in the suburbs...\n                         maybe a couple of kids...some sort\n                         of business...be in the bowling\n                         league...go to the ball games...\n\n               Finnegan turns to Pantucci, his voice even, calm, almost\n               kind.\n\n                                   FINNEGAN\n                         Joey...it's okay...\n\n                                   PANTUCCI\n                         What? You don't think I can have a\n                         normal life?\n\n                                   FINNEGAN\n                         Joey...look at me...\n\n               He forces Pantucci to look him in the eyes.\n\n                                   FINNEGAN (CONT'D)\n                         We're gonna get what we gotta\n                         get... do what we gotta do...and\n                         get the hell outta here...okay?\n\n               Pantucci draws his strength from Finnegan. He forces himself\n               to take a deep breath.\n\n                                   PANTUCCI\n                         Okay...\n\n               Suddenly, overhead, something black and veiny skitters across\n               the mass of pipes, so fast it shocks Pantucci back into the\n               wall.\n\n                                   MULLIGAN\n                         What the...???\n\n               He and Vivo spin their guns at the pipes. The red dots of\n               their laser sights sweep the shadowy web of metal. Nothing.\n\n                                   MULLIGAN (CONT'D)\n                         Come on...the sooner we get outta\n                         here the better I'll feel. Mulligan\n                         and Vivo move forward.\n\n                                   PANTUCCI\n                             (quiet)\n                         Finnegan...\n\n               Finnegan turns to Pantucci, who has not moved from where he\n               hit the wall.\n\n                                   FINNEGAN\n                         It's okay...come on...\n\n                                   PANTUCCI\n                             (scared)\n                         I'm stuck...\n\n               Pantucci tries to pull away from the wall. He is stuck.\n\n                                   MULLIGAN\n                             (jumpy)\n                         Hey! What are you trying to pull!\n\n                                   PANTUCCI\n                             (pleading)\n                         John...\n\n               Finnegan takes Pantucci by the front of his shirt, ignoring\n               Mulligan.\n\n                                   FINNEGAN\n                         Relax your arms...slowly...that's\n                         it...\n\n               As Finnegan pulls, Pantucci does as he is told. He slips away\n               from the wall. The jacket doesn't.\n\n                                   MULLIGAN\n                         What the...\n\n               He reaches out to touch the wall. Finnegan grabs his wrist,\n               grabs a flashlight from Vivo's utility belt and shines it on\n               the wall. Their POV -- the entire wall is covered in a\n               strange, yellow, secreted GELATIN. Laid on in some sort of\n               weird, inhuman, geometric pattern. Like a spider web.\n\n                                                       CUT TO:\n\n        76     THE SAIPAN'S HOLD - DAY                                 76\n\n               Leila has welded half the hole shut. A GUSH OF WATER suddenly\n               pours through the other half. Leila cuts the torch.\n\n                                   LEILA\n                         Gebop!!\n\n               The KA-CHUNK-KA-CHUNK of the PUMP is like a loud scary\n               HEARTBEAT. Leila removes her blast visor. Wipes her brow. \n\n               -- A MANGLED CORPSE GUSHES IN through the gaping hole! \n\n               LEILA SCREAMS. Bloody murder. Scared shitless. Quickly backs\n               away. Actually, it's only half a corpse. The bottom half\n               having been eaten away. It's wearing a tuxedo. The corpse's\n               face is tightly constricted, eyes wide open, a grotesque\n               death mask. Leila shakes like a leaf, waist-deep in seawater.\n\n                                                       CUT TO:\n\n        77     SAIPAN DECK - NIGHT                                     77\n\n               Billy is staring out at all the lifeboats as they drift away.\n               All he can hear is the loud KA-CHUNK-KA-CHUNK of the PUMP. He\n               talks into his headset --\n\n                                   BILLY\n                             (into radio)\n                         I dunno where they came from,\n                         turned around and there they were.\n                             (pause)\n                         No, no passengers.\n                             (pause)\n                         No shit I'll keep my eyes open.\n\n                                                       CUT TO:\n\n        78     ENGINE ROOM - NIGHT                                     78\n\n               Leila trembles in the waist-high water. The PUMP'S HEARTBEAT\n               seems to have gotten louder. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK. \n\n               Leila slowly starts edging her way around the corpse. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK-KA-CHUNK. \n\n               Her eyes are transfixed, staring at the abomination, too\n               scared to scream. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK. \n\n               Her back is to the gaping hole as she slowly starts to pass\n               in front of it. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK. \n\n               The water swirls around her waist. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK. \n\n               She's almost past the gaping hole now. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK... \n\n               Then something grabs her! She SCREAMS! And falls back towards\n               the gaping hole -- But it's only a twisted piece of metal off\n               a strut. She exhales. Relieved. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK. \n\n               Suddenly, LEILA'S whole body SPASMS. She SCREECHES wildly, in\n               great pain. The she's RIPPED backward out through the gaping\n               hole. Gone. WATER SLOSHES back in. \n\n               KA-CHUNK-KA-CHUNK-KA-CHUNK.\n\n                                                       CUT TO:\n\n        79     FUJI MARU MACHINE SHOP - NIGHT                          79\n\n               Knee deep in water, an edgy Mulligan watches Finnegan as he\n               disassembles pieces of a thermal carburetor from an auxiliary\n               generator. His eyes keep shifting around.\n               Over in the far corner Vivo is watching Pantucci working over\n               a metal lathe, repairing the cylinder head. Metal-on-metal.\n               Vivo sits up on a barrel, trying to keep his feet out of the\n               water.\n\n                                   FINNEGAN\n                         The hulls of these things are\n                         supposed to be impregnable...\n\n                                   MULLIGAN\n                         So?\n\n                                   FINNEGAN\n                         So...If the hull's impregnable why\n                         are my feet wet?\n\n                                   MULLIGAN\n                         Why don't you just stop figuring\n                         and keep working so we can get the\n                         hell out of here?\n\n                                   PANTUCCI\n                         Why don't you help us so we can get\n                         done faster so we can get the hell\n                         out of here?\n\n                                   MULLIGAN\n                         'Cause grease monkey ain't in my\n                         job description dick head...\n\n               Vivo pulls his feet further up on the barrel.\n\n                                   VIVO\n                         What I want to know is why the\n                         goddamn ocean is always\n                         cold...since I'm a kid I hate god\n                         damn cold water.\n\n               Then out of the corner of his eye, Vivo sees SOMETHING MOVE.\n               He spins around. Nothing but pipes and hoses.\n\n                                   MULLIGAN\n                             (nervous)\n                         What was that?\n\n                                   VIVO\n                         Nothing.\n\n                                   MULLIGAN\n                         Someone's back there.\n\n                                   VIVO\n                         Hey! Come out here!\n\n               Finnegan and Pantucci stop working. All eyes are focused on\n               the maze of pipes. THINGS are HISSING, HUMMING and RUMBLING.\n               Nothing moves.\n\n                                   MULLIGAN\n                         Check it out!\n\n                                   VIVO\n                         Hey! You hear me? Come out! Still\n                         no response.\n\n                                   MULLIGAN\n                         Will you check it the hell out!!\n\n               Disgusted, Vivo puts his feet in the water, gingerly.\n\n                                   VIVO\n                         Man this shit is cold!\n\n               He walks toward the mass of hissing pipes. His pulse rifle\n               rising.\n\n                                   VIVO (CONT'D)\n                         I'm gonna kick your ass for putting\n                         me through this...\n\n               Then he hears a strange SLURPING and SUCKING SOUND coming\n               from behind some gears at the end of a little alleyway.\n\n                                   VIVO (CONT'D)\n                         I'm not screwing around with you\n                         man...I hate the cold water.\n\n                                   MULLIGAN\n                         What is it man?\n\n                                   VIVO\n                         I'm looking...\n\n               Vivo slowly goes in for a closer look, gun out front, heading\n               down the little alleyway. He looks behind some pipes. The\n               SLURPING gets LOUDER. Then he sees it. His eyes widen --\n\n                                   VIVO (CONT'D)\n                         On shit!\n\n               And that's the last thing he ever says. Because just then,\n               from a dark area between the pipes, SOMETHING SHOOTS OUT!\n\n               Mulligan, Finnegan, and Pantucci stare in horrified amazement\n               as Vivo is viciously YANKED into the pipes.\n               A moment later a WASH OF BLOOD is FLUNG across a wall.\n               Mulligan freaks out, aims his rifle at the pipes.\n\n                                   MULLIGAN\n                         Vivo!! Vivo!!\n\n               As Mulligan's attention diverts, Finnegan instinctively heads\n               for Vivo's rifle, lying on the floor. Mulligan swings around.\n               KACHUNK!! His rifle is armed. The laser dot fixes on\n               Finnegan's forehead.\n\n                                   MULLIGAN (CONT'D)\n                         Touch it and you're dead, asshole!\n\n               Finnegan freezes, looking up at a very freaked out Mulligan.\n\n                                   PANTUCCI\n                         Don't shoot, man, don't shoot!\n\n                                   MULLIGAN\n                         What happened to Vivo?! What the\n                         hell happened to Vivo?\n\n               Everybody's breathing hard. Freaked out. Major tension. Blood\n               drips down the wall.\n\n                                                       CUT TO:\n\n        80     VAULT ROOM - NIGHT                                      80\n\n               Trillian steps up to the vault, looking around, a bit\n               nervous, something is definitely not right here.\n\n                                   TRILLIAN\n                         Helloooo?\n\n               She shrugs, must be her imagination. From inside her low cut\n               dress she pulls the Captain's gold security card. She is\n               about to run it through the reader slot when...\n\n               V.O.\n\n               Ahem... She spins to...Hanover, Mason, Mamooli and Chin.\n               Looking grim.\n\n                                   TRILLIAN\n                             (recovering)\n                         I'm sorry... This area is for\n                         authorized personnel only. As the\n                         assistant to the Purser, I'm afraid\n                         I'll have to ask you to vacate...\n\n               Mason and Chin lift their pulse-rifles. KACHUNK!!\n\n                                   TRILLIAN (CONT'D)\n                         Or maybe not.\n\n                                   HANOVER\n                         Where is everybody? \n\n               Trillian is confused --\n\n                                   TRILLIAN\n                         What do you mean?\n\n               Hanover steps forward, right in her face.\n\n                                   HANOVER\n                             (threatening)\n                         I mean...where is everybody?\n\n                                   TRILLIAN\n                         Poolside?\n\n               Hanover grabs Trillian by the throat and slams her against\n               the wall. He rams his gun against her forehead.\n\n                                   HANOVER\n                         You tell it straight or I pull the\n                         trigger. Who are you?\n\n                                   TRILLIAN\n                             (choking)\n                         A passenger...\n\n               Hanover blinks.\n\n                                   HANOVER\n                         Where are the other passengers?\n\n               Trillian shrugs. Mason grabs the card out of her hand.\n\n                                   MASON\n                         Forget her...let's get what we came\n                         for and get the hell out of here!\n\n               Mason runs the card through the slot. The ELECTRONICS KICK\n               IN. LIGHTS FLASH. TUMBLERS ROLL. CLICK! It unlocks. Hanover's\n               HEADSET comes alive with Mulligan SCREAMING.\n\n                                   HANOVER\n                         Mulligan?? What?? I can't hear\n                         you?? Repeat I...\n\n               -- Mason JERKS the vault door open. A FIRE-AXE SWING DOWN\n               into his head, WHUMP! Kills him instantly. Eyes wide open.\n               Everybody freaks out. Jumps back. Hanover lets go of\n               Trillian, and stares into the vault directly at Nigel Canton.\n               Holding the axe.\n\n                                   CANTON\n                         Oh my God. I didn't mean to...\n\n               Behind Canton the Captain is on the floor, in severe pain,\n               his clothes are ripped up, REVEALING nasty looking RED SCARS,\n               blistered and puffy, all over his chest and arms.\n\n                                   CANTON (CONT'D)\n                         I thought it was one of them!\n\n               Chin jams his rifle to the middle of Canton's forehead, and\n               cocks a round into the chamber.\n\n                                   HANOVER\n                         Stand down soldier!\n\n               But this is one soldier who is slow to obey the order.\n               Hanover grabs Chin by both shoulders and gives a colossal\n               yank.\n\n                                   HANOVER (CONT'D)\n                         I said...\n\n               He slams Chin against the wall. In the process he loses his\n               headset.\n\n                                   HANOVER (CONT'D)\n                         Stand down!!\n\n               Chin and Hanover stare at each other, their chests heaving.\n               Mason finally drops to the ground. All she wrote.\n\n                                   CANTON\n                         I didn't mean to! I though it was\n                         one of them!\n\n                                   HANOVER\n                         One of who?!\n\n                                                       CUT TO:\n\n        81     MACHINE SHOP - NIGHT                                    81\n\n               The machinery is sputtering, and sparking, shorting, steaming\n               as the sea rises. Mulligan, in a panic, has backed Finnegan\n               and Pantucci into a corner. He screams over his headset.\n\n                                   MULLIGAN\n                         Hanover!...Hanover! Come in! Come\n                         in you son-of-a-bitch!\n\n               No response. A sucking sound comes from the dark mass of\n               pipes. Mulligan spins.\n\n                                   MULLIGAN (CONT'D)\n                         Hanover!! Hanover!!\n\n                                   FINNEGAN\n                         Forget them...\n\n               Mulligan spins back to Finnegan and Pantucci.\n\n                                   MULLIGAN\n                             (fried)\n                         Shut up! You hear me!!\n\n                                   FINNEGAN\n                         ...we gotta get outta here -- NOW.\n\n                                   MULLIGAN\n                         Shut up, man, just shut the hell\n                         up! I gotta think! I gotta think!!\n\n                                   PANTUCCI\n                         What's there to think about?? That\n                         THING back there...\n\n                                   MULLIGAN\n                         There ain't no thing here!! No\n                         thing!! There's you him and me!!\n                         Got it! You him and...\n\n               Suddenly, Mulligan's LEGS are suddenly JERKED OUT from under\n               him. He hits the floor hard. Starts FIRING WILDLY. \n\n               Finnegan and Pantucci hit the watery deck. \n\n               BULLETS RICOCHET everywhere. Mulligan is WHIPPED across the\n               floor. SCREAMING in fear. His pulse-rifle goes flying. He's\n               SLAMMED into a metal pylon, then SUCKED into a dark void in\n               the pipes. All in the blink of an eye. \n\n               Finnegan grabs Mulligan's pulse-rifle. OPENS FIRE. BLASTING\n               the shit out of anything and everything that moves.\n\n                                   FINNEGAN\n                         Grab the parts!!\n\n               Pantucci grabs the knapsack, cramming as many parts as he can\n               into it as Finnegan keeps firing into the steaming, creaking,\n               sparking machinery.\n\n                                   FINNEGAN (CONT'D)\n                         I'll cover! Move! Move!\n\n               Pantucci doesn't have to be told twice. He runs like hell,\n               with Finnegan firing a final burst, and following.\n\n                                                       CUT TO:\n\n        82     VAULT - NIGHT                                           82\n\n               Everyone hears the MASSIVE GUNFIRE. Hanover looks around for\n               the source of the sound. He finds it in his discarded\n               headset.\n\n                                   HANOVER\n                         This is Red one! Come in Red two!\n\n               The gunfire stops, replaced by an ominous, horrifying,\n               sucking sound.\n\n                                   CANTON\n                             (panicked)\n                         It's them! We've got to get off!\n\n               He runs out of the vault. The Captain follows close behind.\n               Hanover listens to the sucking sound getting louder and\n               louder.\n\n                                   HANOVER\n                         Let's find them!\n\n                                   CHIN\n                         What about the vault?\n\n                                   HANOVER\n                         It's not going anywhere...\n\n               Hanover rushes out with Chin right behind. \n\n               Only Trillian remains, breathing deeply, scared...but not\n               scared enough to forget the reason she came cruising in the\n               first place. She goes right to the vault, opens one of the\n               boxes, removes the giant diamond, drops it down her\n               decolletage, pulls her high heels off, and runs out.\n\n                                                       CUT TO:\n\n        83     ENGINE ROOM - NIGHT                                     83\n\n               Finnegan and Pantucci run to the end of a long section of\n               metal grating, right below a staircase, to catch their\n               breath. Everything has gone dead quiet, except for the\n               billowing and clanging of the engines. Smoke and sparks\n               obscure their vision.\n\n                                   PANTUCCI\n                         Finnegan, what the hell was that?\n\n                                   FINNEGAN\n                         I don't know...you got what we\n                         need?\n\n                                   PANTUCCI\n                         If I don't, I ain't going back to\n                         get it...you think we're safe?\n\n               Both of them listen to the silence. And then, at the far end\n               of the grating, one grate rises...and falls. Finnegan and\n               Pantucci watch, transfixed. Then, like a locomotive gathering\n               speed, the grates start rising and falling, faster and\n               faster, clanking louder and louder, headed right for the two\n               of them.\n\n               LOUDERFASTERLOUDERFASTER!!!\n\n                                   FINNEGAN\n                         Come on!!\n\n               Finnegan and Pantucci run up the stairs as fast as they\n               can...just as the grate they were standing on rises and\n               falls. Silence returns. Except for the steaming, creaking\n               machinery...and an ominous sucking sound.\n\n                                                       CUT TO:\n\n        84     PASSAGEWAY - NIGHT                                      84\n\n               Trillian comes running down the passageway to a freight\n               elevator. Looking over her shoulder, she hits the button. The\n               elevator doors open to a freight elevator large enough to\n               hold a dozen people. Trillian rushes in and hits the up\n               button. She breathes a sigh of relief as the steel doors\n               close...until the elevator starts going down.\n\n                                   TRILLIAN\n                         Up!! I want to go up!\n\n               She panics. And starts pushing the up button frantically, her\n               heart pounding in her chest.\n               There is not a sound except for the hum of the elevator\n               descending...until something drops on the roof with a THUMP!\n               Trillian screams. The elevator comes to a bumps stop.\n\n                                   TRILLIAN (CONT'D)\n                         No...No...\n\n               Trillian shrinks from the ceiling of the elevator...and then\n               the car starts to move again.\n\n                                   TRILLIAN (CONT'D)\n                         Go up...please go up!\n\n               Trillian pounds on ever button on the console, to no avail.\n               The car continues its inexorable descent. Finally, in\n               desperation, she hits the emergency stop button. The elevator\n               stops. The emergency SIREN WHINES. A LONG BEAT. Nothing\n               moves...and then...\n\n               WHAM! Something beats on the roof, trying to break in. And\n               again -- WHAM! The ELEVATOR SHUDDERS and continues its\n               descent. Trillian backs up against the wall, staring at the\n               ceiling, scared. The ELEVATOR DINGS! \n\n               Startled, TRILLIAN SCREAMS. The DOORS start to OPEN.\n               Panicked, Trillian raises the only weapon at her disposal...a\n               high heel. The DOORS OPEN. -- SOMETHING LUNGES IN! Trillian\n               swings her high heel...right into Pantucci's face! \n\n               Finnegan plows in right behind him.\n\n                                   PANTUCCI\n                         OWWW!! OOWWW!!!\n\n               Trillian tries to run out. Finnegan grabs her.\n\n                                   TRILLIAN\n                         I'm not staying here!\n\n                                   FINNEGAN\n                         It ain't any better out there!\n\n               Trillian struggles. Finnegan does not let go of her.\n\n                                   FINNEGAN (CONT'D)\n                         Lady, I'm telling you...\n\n               Trillian buries her high heel into the back of Finnegan's\n               hand, breaking his grip.\n\n                                   FINNEGAN (CONT'D)\n                         OWW!\n\n               Just then, the doors to the elevator shut, and the car starts\n               to ascend.\n\n                                   TRILLIAN\n                         Now look what you did!\n\n                                   FINNEGAN\n                         I saved your life is what I did!\n\n                                   TRILLIAN\n                         Who asked you to!\n\n                                   PANTUCCI\n                         What the hell's going on here?\n\n                                   TRILLIAN\n                         You're with that other bunch,\n                         right?\n\n                                   FINNEGAN\n                         What other bunch?\n\n                                   TRILLIAN\n                         The thieves.\n\n                                   FINNEGAN\n                         I'm not a thief.\n\n                                   TRILLIAN\n                         Then who are you?\n\n                                   FINNEGAN\n                         I'm their ride. \n\n               Trillian hears music to her ears.\n\n                                   TRILLIAN\n                         You have a boat?\n\n               Her demeanor changes, her voice goes to honey.\n\n                                   PANTUCCI\n                         Finnegan!\n\n               Trillian and Finnegan turn to Pantucci who is looking down at\n               the floor where a mass of yellow slime has dripped from the\n               ceiling. All look up to the yellow goo dripping from the\n               ceiling...followed by a sucking sound.\n\n                                   TRILLIAN\n                         It's up there!!\n\n               Finnegan lifts his pulse rifle and blasts the ceiling. The\n               sucking sound stops.\n\n                                   FINNEGAN\n                         Not anymore.\n\n               The elevator stops. DING! The door opens. Finnegan whirls his\n               rifle, rising. Trillian lifts her high heel, ready to\n               strike... \n\n               Hanover, Chin, and Mamooli have their massive guns trained on\n               the car. The Captain and Canton quiver behind them. There is\n               a momentary stand off.\n\n                                   HANOVER\n                         Where are my men?\n\n                                   FINNEGAN\n                         Dead.\n\n                                   CHIN\n                         YAAHHH!!\n\n               Chin charges Finnegan, the butt of his rifle raised to smash\n               Finnegan's skull. Finnegan parries and drives Chin into the\n               rear wall of the elevator. Mamooli jumps Finnegan from\n               behind, wrapping his rifle against Finnegan's throat.\n               Pantucci jumps on Mamooli's massive back, ripping at his\n               face. Finnegan drops, buries his elbow in Mamooli's solar\n               plexus, spins, and has his knife out of his boot and at\n               Mamooli's throat in a flash. \n\n               ANGLE ON: Trillian. Impressed. She had no idea.\n\n                                   HANOVER\n                         Drop it!\n\n               Finnegan looks up into the barrel of Hanover's gun...and a\n               pair of eyes that will use it. Finnegan does as he is told.\n\n                                   HANOVER (CONT'D)\n                         Now, back up!\n\n               Again, Finnegan does as he is told.\n\n                                   HANOVER (CONT'D)\n                         Everybody in!\n\n               The Captain and Canton are only to happy to comply. As they\n               slip in, Trillian tries to slip out. Hanover swings his gun\n               on her.\n\n                                   HANOVER (CONT'D)\n                         Where are you going?\n\n                                   TRILLIAN\n                             (freezing)\n                         Nowhere...\n\n                                   FINNEGAN\n                         Hanover, listen...\n\n                                   HANOVER\n                         Shut up!\n\n               Hanover hit the elevator button. The elevator starts to rise.\n\n                                   HANOVER (CONT'D)\n                         Now, where's Mulligan? Where's\n                         Vivo?\n\n                                   FINNEGAN\n                         I told you...\n\n                                   PANTUCCI\n                         Man, there's something here! On the\n                         boat!\n\n                                   CANTON\n                         You see? You see?\n\n                                   HANOVER\n                         Shut up! Shut up all of you! Now\n                         here's what we're doing... Mamooli\n                         is going to take you back to fix\n                         your engines, Chin and I are\n                         staying here to finish the job...\n\n                                   FINNEGAN\n                         Did you clear this?\n\n                                   HANOVER\n                         With who?\n\n               All of a sudden, the car is jerked to a halt, as if some\n               giant hand was yanking on the cable.\n\n                                   FINNEGAN\n                         With that...\n\n               And then, the elevator jerks down again. And up. Everyone is\n               thrown about like straw. Everyone is shouting, panicked.\n               And then the jerking stops...and the sound of sucking\n               surrounds the car. The cable starts twisting, creaking\n               sickeningly above their heads.\n\n                                   PANTUCCI\n                         It's gonna snap the cable!\n\n               Trillian starts hitting the buttons frantically.\n\n                                   TRILLIAN\n                         Open! Open! God damn it!!\n\n               Finnegan is at the doors, pulling them with all his might.\n\n                                   FINNEGAN\n                         Help me!!\n\n               Pantucci, then Mamooli, then Hanover and Chin pull at the\n               doors as Trillian keeps hitting the buttons. The doors part a\n               bit.\n\n                                   FINNEGAN (CONT'D)\n                         They're coming! They're coming!\n\n               The doors fly open to...a solid wall.\n\n                                   FINNEGAN (CONT'D)\n                         Oh shit...\n\n               And silence...until the doors slam shut...the cable\n               snaps...and the car plummets! Screaming and shouting mixes\n               with the bloodcurdling shrieking of the metal elevator frame\n               against the shaft. Finnegan's eyes go to the floor indicator.\n\n        13     12 -- 11 -- 10 -- 9 -- 8 -- 7 -- 6 -- 5 -- 4!           13\n\n               An AUTOMATED VOICE rapidly CALLS OUT right along with it --\n\n                                   VOICE\n                         4th floor. 3rd floor. 2nd floor.\n                         1st floor...\n\n               Down, down, down it goes. Faster and faster. But the elevator\n               doesn't stop at the first floor. It keeps dropping. The FLOOR\n               INDICATOR BLINKS: \"SUBLEVEL. SUBLEVEL. SUBLEVEL.\"\n\n                                   CANTON\n                         It's taking us to the bottom of the\n                         ship!\n\n                                   FINNEGAN\n                         HANG ON!\n\n               CABLES SNAP. METAL SCREAMS. The ELEVATOR starts to BUCKLE.\n               Which is actually good, because it's getting jammed sideways\n               in the shaft which slows it down. The it HITS bottom with a\n               resounding crash.\n\n                                                       CUT TO:\n\n        85     SUBLEVEL LOBBY - DAY                                    85\n\n               The DOORS BLOW OUT into the darkened hallway. For a long\n               moment nothing moves, then Finnegan tumbles out of the\n               elevator. Rising painfully. One after another the others exit\n               into the dark lobby.\n\n                                   HANOVER\n                         Where are we?\n\n                                   CANTON\n                         The sublevel lobby.\n\n               Finnegan bends down to pick up one of the pulse rifles.\n\n                                   HANOVER\n                         Don't touch it!\n\n               Finnegan looks up to Hanover standing a bit shakily, his own\n               rifle trained on Finnegan.\n\n                                   FINNEGAN\n                         You shoot me and you got no ride\n                         home...\n\n               And with that, Finnegan picks up the gun. A test of wills.\n               Finnegan wins, and then turns to the Captain.\n\n                                   FINNEGAN (CONT'D)\n                         You the Captain?\n\n                                   CAPTAIN\n                         Yes.\n\n                                   FINNEGAN\n                         How do we get out of here?\n\n                                   CAPTAIN\n                         We have to make it to the third\n                         deck...\n\n               Pantucci steps on something. CRUNCH! He looks down, his eyes\n               widen.\n\n                                   PANTUCCI\n                         Oh no!! Oh no!! Finnegan!!!\n\n               He starts dancing around, trying not to step on whatever it\n               is. Trillian looks down and SCREAMS. \n\n               Everybody freaks -- \n\n               Finnegan grabs a flashlight from Chin's utility belt, and\n               sweeps the beam over the lobby. The entire floor of the lobby\n               is littered with shattered HUMAN SKELETONS. Picked clean and\n               spit out. Just like the earlier whale bones. \n\n               Then suddenly, at the far end of the hallway, one of the\n               metal WALLS suddenly EXPANDS and FLEXES. Everybody feezes.\n               And then the FLEXING suddenly comes RACING down either side\n               of the hallway, accompanied by the most god-awful PRIMORDIAL\n               SCREECH!\n\n                                   FINNEGAN\n                         This way!\n\n               FINNEGAN BOLTS. Everybody else right behind him. The FLEXING\n               and SCREECHING VANISHES into the walls.\n\n                                                       CUT TO:\n\n        86     FUJI MARY & SAIPAN - DAY                                86\n\n               RAIN POURS DOWN on the Fuji Maru and the Saipan as they bob\n               in the waves, surrounded by endless choppy ocean waters.\n\n                                                       CUT TO:\n\n        87     SAIPAN ENGINE ROOM - DAY                                87\n\n               Billy comes down the steps, gun out front, looking around.\n\n                                   BILLY\n                         Hey you! Muscles! Out here!\n\n               There is no reply. The only sound is the sucking of the pump.\n\n                                   BILLY (CONT'D)\n                         O.K. You want it that way... \n\n               He ENTERS the waist-high water.\n\n                                   BILLY (CONT'D)\n                         ...when I find you, you pay...\n\n               Billy heads deeper into the hold.\n\n                                                       CUT TO:\n\n        88     MACHINE SHOP - MOMENTS LATER                            88\n\n               Damp, dark and disgusting. A MAZE of pipes and gears lines\n               the walls. Finnegan SLAMS the HATCH shut. Dogs it tight.\n               Everyone's gathering themselves around the room: Trillian,\n               Pantucci, Hanover, Mamooli, Chin, the Captain and Canton.\n\n                                   TRILLIAN\n                         We've gotta call for help.\n\n                                   PANTUCCI\n                         Yeah man, no shit, call in the\n                         Marines.\n\n                                   CAPTAIN\n                         We can't...all the communication\n                         systems went down.\n\n                                   TRILLIAN\n                         So get them back up.\n\n                                   CAPTAIN\n                         I don't know how.\n\n                                   PANTUCCI\n                         Hey I can fix any damn thing...\n                         where's the comm. center?\n\n                                   CANTON\n                         We should get off as soon as\n                         possible.\n\n                                   TRILLIAN\n                         But if we can at least send a\n                         message...\n\n                                   CANTON\n                         I say we evacuate as soon as...\n\n                                   FINNEGAN\n                             (to Canton)\n                         Who are you?\n\n                                   CAPTAIN\n                         He's the owner...\n\n                                   FINNEGAN\n                         Why don't you want a message sent?\n\n                                   CANTON\n                         I just think that...\n\n                                   FINNEGAN\n                         Because you know a message can't be\n                         sent...\n\n               There is a moment of silence.\n\n                                   FINNEGAN (CONT'D)\n                         You're the inside guy aren't you?\n                         The guy who knocked out the\n                         communications.\n\n               Hanover sets Mason's pulse-rifle down and claps his hands.\n\n                                   HANOVER\n                         Bravo.\n\n               Canton flashes Hanover a look. The Captain is confused.\n               Trillian suddenly GRABS CANTON, spins him around and SLAMS\n               him against the hull.\n\n                                   TRILLIAN\n                         How the hell do we fix it?!\n\n               A tense moment as Canton debates his situation, then relents.\n\n                                   CANTON\n                         You can't... All the systems were\n                         melted at their core by nitric\n                         acid...\n\n                                   CAPTAIN\n                             (confused)\n                         This was your life's work...your\n                         dreams...\n\n                                   CANTON\n                         My dreams cost more than they would\n                         make...I miscalculated the\n                         market... there was no way I could\n                         recoup...\n\n                                   FINNEGAN\n                         Unless you collected on the\n                         insurance...\n\n                                   TRILLIAN\n                         What are you people talking about?\n\n                                   FINNEGAN\n                         He's with them. \n\n               He motions to the mercenaries.\n\n                                   FINNEGAN (CONT'D)\n                         They rob the joint blind and\n                         torpedo it to the bottom. He\n                         collects the insurance, and sails\n                         off into the sunset clean as a\n                         whistle.\n\n               Finnegan fixes Hanover with a look of certainty.\n\n                                   FINNEGAN (CONT'D)\n                         Right?\n\n               The Captain blows. He leaps on Canton. His hands find the\n               older man's throat.\n\n                                   CAPTAIN\n                         All these people dead!! Because you\n                         screwed up on the math?? \n\n               Finnegan pulls the Captain off.\n\n                                   FINNEGAN\n                         It's not going to help us!\n\n                                   CAPTAIN\n                         We're going to die here! We're\n                         going to die!\n\n               Finnegan holds the Captain with both hands, calming him.\n\n                                   FINNEGAN\n                         I was born in a City housing\n                         project in the Bronx OK? It's not\n                         in the cards that I die on a luxury\n                         cruise ship...now which way up?\n\n                                   TRILLIAN\n                             (alarmed)\n                         You hear that?\n\n               Unseen by anyone, there is MOVEMENT within the MACHINERY. The\n               walls start to come alive with dark, SHADOWY IMPRESSIONS.\n               HIDDEN within the maze of machinery, OBSCURED by the bad\n               lighting, glistening abominations slither over pipes, squirm\n               through gears, and undulate in and out of crevices and holes.\n               The room is becoming a living, throbbing, pulsating horror.\n\n                                   CAPTAIN\n                         They are...they are everywhere.\n\n                                   FINNEGAN\n                         All right, be cool, everybody, nice\n                         and slow, no sudden moves.\n\n               Everybody slowly and quietly moves for the far hatch. Then a\n               loud GURGLING is HEARD. Everybody looks up at the ceiling. \n\n               Hidden within the girders, and sticking to them, a large\n               translucent INTESTINE-like thing CROSSES the ceiling. Inside\n               it are strange, disgusting biological workings. The GURGLING\n               suddenly gets dramatically LOUDER. And then we SEE BILLY and\n               LEILA, being sucked down the entire length of the fatty\n               intestine. Still alive. And squirming wildly. EVERYBODY\n               freaks out and HAULS ASS for the hatch. Finnegan and Hanover\n               OPEN FIRE. Covering their asses.\n\n                                                       CUT TO:\n\n        89     ENGINE CHAMBERS - NIGHT                                 89\n\n               Everybody pours out of the machine shop and fans out into\n               this mechanical MAZE. The engine chambers are a labyrinth of\n               pipe-lined alleyways, motorized chambers, swaying catwalks\n               and pillars of steel. The LIGHTING is very poor, very dark.\n\n               Hanover, Pantucci, Chin and Mamooli OPEN UP. FIRING blindly\n               and wildly at anything and everything that seems to move in\n               the darkness. The MUZZLE FLASHES and TRACER FIRE light up the\n               chambers in a sort of surreal horror tableau. We catch more\n               ABSTRACT GLIMPSES of the translucent TENTACLE-SACS, strange\n               FEELERS, groping SUCKERS, SLIME and VEINS.\n\n                                                       CUT TO:\n\n        90     DEEP IN MAZE - NIGHT                                    90\n\n               Finnegan rounds a corner and crouch-runs down a narrow alley.\n               Alone now. White-knuckling his rifle. He turns another corner\n               and runs right into Trillian.\n\n                                   FINNEGAN\n                         AHHH!!\n\n               ...Spins, gun ready to fire at...\n\n                                   TRILLIAN\n                         Noooo!\n\n                                   FINNEGAN\n                         Jesus Christ lady...\n\n                                   TRILLIAN\n                             (scared)\n                         What are those things?\n\n                                   FINNEGAN\n                         I don't know...\n\n               Finnegan looks around to the engine room, a labyrinth of pipe\n               lined alleyways, motorized chambers, swaying catwalks and\n               pillars of steel. The LIGHTING is very poor, very dark. He\n               takes off.\n\n                                   TRILLIAN\n                         Hey! Hey! Where are you going?\n\n                                   FINNEGAN\n                         ...there's got to be a way to\n                         access out back there... \n\n               He motions into the deep shadows.\n\n                                   TRILLIAN\n                         But what makes you think there\n                         aren't more of hose...things...back\n                         there?\n\n                                   FINNEGAN\n                         Nothing...you want to come, come...\n                         you don't...\n\n               Trillian weighs her options, and takes off after Finnegan.\n\n                                   TRILLIAN\n                         You don't have to be so touchy.\n\n                                   FINNEGAN\n                         Look lady, I know you people are\n                         used to getting your way...\n\n                                   TRILLIAN\n                         What's that supposed to mean? You\n                         people.\n\n                                   FINNEGAN\n                         You people...rich people...\n\n                                   TRILLIAN\n                         I'm not rich people.\n\n                                   FINNEGAN\n                         Well, you sure do a good imitation.\n\n                                   TRILLIAN\n                         Thank you, I work at it...\n\n               Finnegan comes to a ladderstair leading to a catwalk. He\n               starts to climb. Trillian, hampered by her long slinky dress,\n               rips at the bottom, making it maxi to mini in a flash, and\n               scoots after Finnegan.\n\n                                   TRILLIAN (CONT'D)\n                         I heard you say you grew up in the\n                         projects in the Bronx...\n\n               Reaching the top of the ladder, she clambers onto the catwalk\n               next to Finnegan, who is deciding which way to go.\n\n                                   TRILLIAN (CONT'D)\n                         Trillian Daley... \n\n               She holds out her hand.\n\n                                   TRILLIAN (CONT'D)\n                         Projects...South Chicago. \n\n               Finnegan ignores her hand.\n\n                                   FINNEGAN\n                         Finnegan...John J...now that we've\n                         been properly introduced, can we\n                         get the hell out of here?\n\n               Finnegan starts to walk down the catwalk.\n\n                                   TRILLIAN\n                         So this boat of yours...that's what\n                         you do? Give people...rides.\n\n                                   FINNEGAN\n                         That's what I do.\n\n                                   TRILLIAN\n                         Seen a lot of islands?\n\n                                   FINNEGAN\n                         Quite a few.\n\n                                   TRILLIAN\n                         Since I'm a kid, I had this\n                         dream... I want to own my own\n                         tropical island...\n                         Beaches, warm ocean, lots of food,\n                         little clothes...population of\n                         one...\n\n                                   FINNEGAN\n                         Anti social?\n\n                                   TRILLIAN\n                         Self sufficient...\n\n                                   FINNEGAN\n                         With the emphasis on SELF, and in\n                         selfish, right?\n\n                                   TRILLIAN\n                         Takes one to know one.\n\n               SNAP!! A TENTACLE SHOOTS OUT between Finnegan and Trillian.\n               Just missing them as it SLAMS into a wall. \n\n               Finnegan falls onto the catwalk, drops his rifle, unarmed.\n               Trillian, freaked, stumbles back and lands on her butt.\n               Finnegan sits up against the walls, turns and looks -- \n\n               The TENTACLE slowly SQUIRMS across the wall like a big leach.\n               Trying to find its prey. Finnegan is frozen in place.\n               Watching. Trillian sits up, eyes widening in fear as she sees\n               -- Hideous little worm-like FEELERS and SUCKERS protrude up\n               and down the Tentacle. WRIGGLING and WRITHING and feeling\n               their way across the wall. Getting closer and closer to\n               Finnegan. \n\n               Finnegan's eyes go to his pulse-rifle close to Trillian's\n               feet. He motions for her to push it toward him. But, frozen\n               in fear, she can only watch the slithering horror before her.\n               Tongue-like, the Feelers lick their way across the oily wall.\n               FINNEGAN DUCKS as they squirm over his head. Then he BRUSHES\n               against some dirt, making a SCRAPING SOUND. \n\n               A Feeler quickly drops down and touches Finnegan's arm. He\n               leaps to his feet. So does Trillian. She grabs the rifle,\n               turns and bolts off down the dark alley. Finnegan tries to\n               run, but the Feelers hold him tight. Two more Feelers slap\n               onto his arm. HE YELLS. \n\n               The Creature starts reeling him in. \n\n               ANGLE ON: Trillian, running. Finnegan's YELL reaches her. She\n               stops cold. Looking back the way she came, torn. \n\n               ANGLE ON: Finnegan, fighting for all he is worth, being\n               reeled into the mass of machinery by the tentacle.\n               When...out of the darkness, Trillian suddenly comes running\n               back. Panting hard, she aims the gun.\n\n                                   FINNEGAN\n                         Shoot it! Shoot it!\n\n               Spurred to action, Trillian jams the rifle barrel against the\n               tentacle and pulls the trigger. Nothing happens.\n\n                                   FINNEGAN (CONT'D)\n                         The safety! The safety!\n\n               Trillian frantically fumbles around, looking for the right\n               lever on the complicated, sophisticated weapon, trying to\n               find it.\n\n                                   TRILLIAN\n                         I don't know where it is!\n\n                                   FINNEGAN\n                         On the side!!\n\n               Desperate, unable to find it, she does the next best\n               thing...she swings her rifle like it's a baseball bat. SMACKS\n               the TENTACLE. HARD. RIPPING into its flesh. It SQUIRTS ink\n               blood, releases Finnegan and recoils.\n\n               Finnegan drops to his knees. Grabbing his arm, in pain. The\n               tentacle recovers and starts coming toward him again.\n               Trillian grabs him, and with all her strength, jerks him to\n               his feet, and starts to drag him backward. The tentacle\n               coils, ready to strike. Just before it does so, Finnegan\n               grabs the rifle with his one good arm, flips the safety, and\n               fires, blasting the tentacle to pieces.\n\n                                   FINNEGAN (CONT'D)\n                         Let's get the hell out of here!\n\n               Finnegan staggers to his feet. He and Trillian run off.\n\n                                                       CUT TO:\n\n        91     ENGINE ROOM - NIGHT                                     91\n\n               Trillian and Finnegan come running around a corner, and stop\n               to catch their breath.\n\n                                   FINNEGAN\n                             (annoyed)\n                         The safety...the safety... He\n                         flicks the safety on and off.\n\n                                   FINNEGAN (CONT'D)\n                         Got it?\n\n                                   TRILLIAN\n                             (pissed)\n                         Hey! I didn't have to come back.\n\n                                   FINNEGAN\n                         Yeah you did...\n\n                                   TRILLIAN\n                             (defensive)\n                         Right... You have a boat.\n\n                                   FINNEGAN\n                         Boat or no boat... You woulda come\n                         back anyway. You're that kind of\n                         gal.\n\n                                   TRILLIAN\n                         Oh yeah? What kind is that?\n\n                                   FINNEGAN\n                         The \"come back\" kind.\n\n                                   TRILLIAN\n                         How do you know that?\n\n                                   FINNEGAN\n                         Takes one to know one.\n\n               Finnegan's small smile makes Trillian acutely uncomfortable.\n\n                                   V.O.\n                         HEELLPP!!\n\n                                                       CUT TO:\n\n        92     ENGINE ROOM - NIGHT                                     92\n\n               The Captain is stuck in a strange gelatinous spider web.\n               Struggling, frantic. But the more he struggles, the more\n               enmeshed he gets. He holds his hands out beseechingly to\n               Canton, who stands looking at him in terror.\n\n                                   CAPTAIN\n                         Help me!\n\n               But Canton does not move. All of a sudden Canton sees\n               something deep in the web, behind the Captain, which makes\n               his blood freeze.\n\n                                   CAPTAIN (CONT'D)\n                         What is it?\n\n               Canton takes a few steps back.\n\n                                   CAPTAIN (CONT'D)\n                         What?!... WHAT?!\n\n               The Captain tries to look over his shoulder to see what it\n               is. There is a DARK MOVEMENT deep within the spider web.\n\n                                   CAPTAIN (CONT'D)\n                         HELP ME, CANTON! HELP MEEEEEEE!!\n\n               ANGLE ON: Finnegan and Trillian racing across a catwalk.\n               Below them, they can see Canton backing away from the\n               Captain.\n\n                                   FINNEGAN\n                         Grab his hands!!\n\n               Canton looks up, stunned, as he sees Finnegan and Trillian\n               rushing down from the catwalk.\n\n                                   CAPTAIN\n                         CANTON!! HELP!!\n\n               Canton backs away from the Captain, as the Captain's struggle\n               draws him further into the web. The Captain's eyes bulge,\n               horrified, as he feels SOMETHING inside the spider web GRAB\n               him from behind.\n\n                                   CAPTAIN (CONT'D)\n                         IT HURTS!!!!! IT\n                         HURRRRRTTTTTSSSS!!!\n\n               He struggles WILDLY. Then starts to freeze up as the\n               tentacles wrap around him. \n\n               Finnegan and Trillian race across the floor as the Captain is\n               slowly sucked deeper into the spider web; his face and body\n               bady constricting, paralyzed. His VOICE is CHOKED OFF.\n\n               Hanover, Chin, Mamooli and Pantucci burst out of another\n               alleyway. Finnegan and Trillian reach the Captain just as his\n               FACE is SUCKED into the gelatinous web. They skid to a stop.\n               Everybody piles up. Eyes wide. Watching as the Captain's body\n               is pulled deeper into the dark web. Tentacles enveloping him.\n\n                                   HANOVER\n                             (to Canton)\n                         Where is the closest hatch?\n\n               Canton still pressed against the wall, staring at the spot\n               the Captain disappeared, talking to himself.\n\n                                   CANTON\n                         I never meant for anyone to get\n                         hurt ...it was supposed to be\n                         clean...\n\n               Hanover grabs Canton by the front of his tattered tuxedo\n               jacket.\n\n                                   HANOVER\n                         You hypocritical bastard...all you\n                         gave a shit about was the money...\n                         where's the hatch!!\n\n               Canton points down a darkened passageway.\n\n                                   HANOVER (CONT'D)\n                         Alright let's move out...you two on\n                         point...\n\n               He looks at an uneasy Mamooli and Chin.\n\n                                   FINNEGAN\n                         Joey... Which way's aft?\n\n                                   PANTUCCI\n                         That way.\n\n               He points in the opposite direction.\n\n                                   HANOVER\n                         Who gives a shit about aft?\n\n                                   FINNEGAN\n                         That's where my boat's moored.\n\n                                   HANOVER\n                         You trying to take over my show\n                         Finnegan, that what you trying to\n                         do?\n\n                                   FINNEGAN\n                         Just trying to get to my boat...\n\n               Finnegan takes off down a catwalk in the opposite direction\n               that disappears in the dark. Pantucci is right with him.\n               Trillian, a step behind.\n\n                                   HANOVER\n                             (yelling)\n                         You stay away from that vault! You\n                         hear me?\n\n               Just before he steps into the darkness, Finnegan calls over\n               his shoulder...\n\n                                   FINNEGAN\n                         They respond to sound...\n\n               He disappears into the dark. Canton looks at Hanover for a\n               long moment, and then takes off after Finnegan. The other two\n               mercs look at Hanover, wavering.\n\n                                   HANOVER\n                             (tense)\n                         What?\n\n               The sound of his voice makes the two mercs look around\n               nervously.\n\n                                   MAMOOLI\n                             (whispered)\n                         He made sense.\n\n                                   HANOVER\n                             (loud)\n                         He's a bloody...\n\n               And then conscious of his voice reverberating...\n\n                                   HANOVER (CONT'D)\n                             (whispered)\n                         ...he's a bloody taxi driver!\n\n               Chin breaks for the catwalk, hurrying after Finnegan. Hanover\n               stands with a very antsy Mamooli, steaming. After a long\n               moment, he strides off after Finnegan as well.\n\n                                                       CUT TO:\n\n        93     BALLAST PASSAGEWAY - DAY                                93\n\n               In SLOW-MO, Finnegan and the others creep down a darkened,\n               pipe-lined passageway. Guns out front. Sight beams sweeping\n               the path ahead. Eyes wide open. Sweat sliding down their\n               faces. Breath coming in short nervous bursts. Hearts pounding\n               out of chests. \n\n               The ominous MUSICAL SCORE adds to the tension. \n\n               Then the EMERGENCY LIGHTING KICKS ON. A creepy-looking\n               reddish-blue glow is cast throughout the ship. Finnegan\n               continues on. Followed by the others. All sweating hard. Eyes\n               nervously shifting. Fear thick in the air. \n\n               LOOKING DOWN THROUGH A METAL GATE, we SEE Finnegan, Trillian\n               and the others passing below. Then suddenly, in the dark\n               foreground -- SOMETHING WET WRIGGLES across the gate. They\n               come to a door. Finnegan tries the handle. No go. Finnegan\n               turns to Canton, and mimes for keys. Canton shakes his head.\n               He has none.\n\n                                   HANOVER\n                             (whispered)\n                         Very good Finnegan...very good.\n\n               Trillian moves up to Finnegan. She reaches into her hair, and\n               pulls out her trusty lockpick. As he watches, somewhat\n               mystified, she inserts the pin, tickles the lock a few times,\n               and depresses the handle. Click! The door opens. Finnegan\n               looks at her curiously, but with respect.\n\n                                                       CUT TO:\n\n        94     BALLAST SECTION - DAY                                   94\n\n               They ENTER the rear ballast section, where the walls are\n               indeed far apart, half of which is now a small POND.\n               Obviously flooded. The only way out of this room is down some\n               STEPS which VANISH beneath the seawater, or through a single\n               violently twisted HATCH DOOR. \n\n               Finnegan tries to push the hatch. It will not give. \n\n               Mamooli and Chin join him, adding their considerable muscle\n               to the task. The hatch holds tight. Finnegan turns to Canton,\n               who stands slumped against a railing. He does not look well\n               at all.\n\n                                   FINNEGAN\n                         What's on the far side?\n\n                                   CANTON\n                         I don't know.\n\n                                   PANTUCCI\n                             (nerves)\n                         It's your damn ship! What the hell\n                         do you mean you don't know?\n\n               Finnegan touches Pantucci's shoulder.\n\n                                   FINNEGAN\n                         Joey, what difference does it\n                         make...\n\n               Finnegan enters the water.\n\n                                   FINNEGAN (CONT'D)\n                         If you hear one shot, you know I\n                         made it...start coming...\n\n               Pantucci follows Finnegan to the water.\n\n                                   HANOVER\n                         How do we know you're going to\n                         signal...how do we know you're not\n                         going to just take off? \n\n               Finnegan stops.\n\n                                   FINNEGAN\n                         I'll wait here... You go check it\n                         out.\n\n               Hanover does not move.\n\n                                   FINNEGAN (CONT'D)\n                             (contemptuous)\n                         I didn't think so.\n\n               Finnegan wades into the water. Just before he sinks beneath\n               the surface...\n\n                                   TRILLIAN\n                         Finnegan...\n\n               He looks back.\n\n                                   TRILLIAN (CONT'D)\n                         Be careful.\n\n               With a smile, Finnegan dives under. Pantucci right behind\n               him. The others stand looking around, nervous.\n\n                                                       CUT TO:\n\n        95     UNDERWATER - NIGHT                                      95\n\n               Finnegan SWIMS down to the floor of the ballast. Then into a\n               passageway lined with black pipes. Pantucci right behind him.\n               STRANGE NOISES REVERBERATE through the MURKY waters. \n\n               CREAKS and MOANS. Spooky shit. Both men are wide-eyed as they\n               swim. Weaving their way through a maze of pipes and ducts.\n               The THINGS could come out of almost anywhere. Bubbles drift\n               up from the darkness below. \n\n               The MUSIC IS TENSE...VERY VERY TENSE. Pantucci falls behind.\n               He swims around a curve and right into a SEVERED HUMAN ARM!\n               AIR BUBBLES BLAST out of his mouth as he SCREAMS. The fingers\n               on the dead hand seem to reach out for him. He fights his way\n               past and swims off in a panic.\n\n                                                       CUT TO:\n\n        96     BALLAST - NIGHT                                         96\n\n               Trillian stares down into the water. Hanover keeps a sharp,\n               nervous eye back down the catwalk, white-knuckling his pulse\n               rifle. Chin and Mamooli keep watch, tight lipped. Canton\n               paces back and forth, driven by anxiety.\n\n                                   HANOVER\n                         Stop pacing.\n\n               Canton acts as if he does not hear. He keeps pacing. Hanover\n               chops sharply with the stock of his rifle into Canton's arm.\n               Canton crumbles against the railing, in pain.\n\n                                   CANTON\n                         AAAAHHHH!!!!\n\n                                   HANOVER\n                         You deaf?\n\n                                   TRILLIAN\n                         Why don't you back off?\n\n                                   HANOVER\n                         You want some too?\n\n               Hanover's jaw clenches. He releases the safety on his rifle,\n               the click resounding ominously in the hollow room.\n\n                                   TRILLIAN\n                         How brave we are.\n\n               Trillian's eyes fix on Hanover's, unwavering. A Mexican\n               standoff.\n\n                                   MAMOOLI\n                         Hanover!\n\n               Everyone turn to... A giant ball of black, wet, OOZING RUBBER\n               UNDULATES down the gangway. Coming straight at them. A mass\n               of glistening striated MUSCLE.\n\n                                   HANOVER\n                         Fire!!\n\n               The three men open up with their pulse rifles. The CREATURE\n               gets RIPPED TO SHREDS. Red and blue INK-BLOOD SPLATTERS\n               everywhere. But onward it comes. Down the gangway. \n\n               Trillian grabs the pistol off Chin's utility belt, and opens\n               fire. Canton jumps into the water and disappears.\n\n                                                       CUT TO:\n\n        97     KITCHEN - NIGHT                                         97\n\n               Finnegan explodes to the surface. GASPING for air. He reaches\n               down and yanks a half drowned Pantucci up next to him. They\n               both look up to gunfire exploding in the distance.\n\n                                                       CUT TO:\n\n        98     BALLAST ROOM - NIGHT                                    98\n\n               The creature keeps coming. The mercs keep firing. Then\n               without warning Hanover drops his rifle and dives into the\n               water, disappearing beneath the surface. \n\n               Trillian is astounded. She throws down her pistol, picks up\n               the pulse rifle, and slams on the trigger. The recoil of the\n               rifle throws her into the water. When she surfaces, she sees\n               Chin and Mamooli, firing as they retreat to the water's edge.\n               Still holding her rifle, she dives.\n\n                                                       CUT TO:\n\n        99     UNDERWATER - NIGHT                                      99\n\n               Trillian swims down a violently SHAKING PASSAGEWAY. Eyes\n               wide. Filled with fear. All around, DEBRIS DROPS through the\n               water. Primordial SOUNDS REVERBERATE off the walls. Lots of\n               BUBBLING and GURGLING -- THEN SOMETHING LUNGES OUT! \n\n               TRILLIAN OPENS UP. FIRING wildly. The water fills with FIRE\n               and BUBBLES. Trillian looks around. Scared shitless. The\n               bubbles clear just in time for her to see -- Chin, mouth\n               open, eyes wide, screaming in agony, being ripped past her.\n               She tries to fire her rifle. Too late. Trillian watches as\n               Chin VANISHES down the shaft in a CLOUD OF BUBBLES.\n\n                                                       CUT TO:\n\n       100     KITCHEN - NIGHT                                        100\n\n               TRILLIAN BURSTS to the surface. FINNEGAN YANKS her up and out\n               of the water.\n\n                                   FINNEGAN\n                         You O.K.?\n\n               Trillian can only nod, and gasp for breath. Canton and\n               Hanover catch their breath, PANTING AWAY, waterlogged.\n               Hanover reaches over to retrieve the rifle in Trillian's\n               hand. Trillian points the barrel at him, and hits the safety.\n\n                                   TRILLIAN\n                             (grim)\n                         Finders keepers.\n\n               Mamooli bursts out of the water, falling on the floor, close\n               to panic mode.\n\n                                   MAMOOLI\n                         Where's Chin?\n\n                                   TRILLIAN\n                         Gone...\n\n                                   MAMOOLI\n                         This is not real! This is not\n                         bloody real!\n\n               Finnegan TOPPLES a large, heavy metal BROILER onto the open\n               floor gate, sealing the watery hole in the floor. There are\n               two hatches in this room. The far hatch is closed. Mamooli\n               stands next to an OPEN HATCH. Canton points to it.\n\n                                   CANTON\n                         Through there...another sixty,\n                         seventy yards...there are more\n                         elevators there.\n\n                                   PANTUCCI\n                         I ain't goin' up no more elevators.\n\n                                   CANTON\n                         There's stairways...\n\n               Mamooli SLAMS the HATCH SHUT. Eyes bugging out of his head.\n\n                                   MAMOOLI\n                         I say we stay right here!\n\n                                   PANTUCCI\n                         Are you crazy?\n\n                                   MAMOOLI\n                             (desperate)\n                         There's plenty of food here. We can\n                         hold out...someone'll rescue us...\n\n                                   FINNEGAN\n                         Who?\n\n                                   MAMOOLI\n                         Someone...maybe they sent an SOS!\n\n                                   PANTUCCI\n                         On what? This son of a bitch\n                             (to Canton)\n                         zapped the communications.\n\n                                   HANOVER\n                         Mamooli stand down!\n\n                                   MAMOOLI\n                         We don't even know if his boat is\n                         still there...you saw Billy!\n\n                                   FINNEGAN\n                         Boat or no boat...I'm going...\n\n               Finnegan steps forward. Mamooli aims his rifle right at\n               Finnegan's head.\n\n                                   MAMOOLI\n                         They're wipin' us out one at a\n                         time. I say we make a stand. Right\n                         here! Right now! Maximum firepower!\n\n                                   PANTUCCI\n                         Somebody shoot this jerk!\n\n                                   FINNEGAN\n                             (calm)\n                         Nobody's shooting nobody...come on,\n                         just let us through the hatch!\n\n                                   MAMOOLI\n                         I'll kill you!! I'll fucking kill\n                         you!! I'll do it! I'll do it! I'm\n                         not playin' around here!\n\n               Finnegan freezes. CLOSE ON: The hatch. As a BLACK LIQUID\n               starts to OOZE through a tiny latch-hole. No one sees it.\n\n                                   FINNEGAN\n                         I once saw a guy put a fish in a\n                         bottle, then he corked it, sealing\n                         it tight, and threw it to a baby\n                         octopus. The little sucker felt its\n                         way around that bottle, and in less\n                         than two minutes, got that cork\n                         off, slid inside, and ate that\n                         fish.\n\n                                   MAMOOLI\n                         What the hell are you talking\n                         about?\n\n                                   FINNEGAN\n                         Us...I'm talking about us... We're\n                         the fish.\n\n               The LIQUID SHADOW OOZES down and hits the floor, starts to\n               EXPAND, filling like a water balloon. It's not a liquid. It's\n               a Tentacle. VEINS, FEELERS and SUCKERS begin to form.\n\n                                   MAMOOLI\n                         And what? These things are\n                         octopuses\n\n                                   FINNEGAN\n                         I don't know what these things are\n                         ...all I know is...\n\n               The TENTACLE slowly RISES UP right behind Mamooli. Inches\n               behind his head. Finnegan and Hanover see it. Eyes widening.\n\n                                   MAMOOLI\n                         What...? What??\n\n               Mamooli turns to the tentacle looming over him, about to\n               strike.\n\n                                   MAMOOLI (CONT'D)\n                         EEEEYYYYYAAAAHHHH!!!!\n\n               He opens fire, emptying his clip into the tentacle. The\n               tentacle retreats into the pipes. Mamooli looks around. The\n               room is empty. He runs out.\n\n                                                       CUT TO:\n\n       101     PASSAGEWAY - NIGHT                                     101\n\n               Mamooli rushes into the empty passageway, looks left. Then\n               right. His POV. Down the hall another TENTACLE comes racing\n               at him. Mamooli panics, drops his rifle. \n\n               TRACK WITH Mamooli racing down the hallway, looking over his\n               shoulder in fear, as the tentacle comes racing after\n               him...gaining...gaining... almost on him... Mamooli leaps\n               through an open hatch, and swings it shut in one swift\n               motion. The tentacle slams into the glass portal. Stopped.\n               Mamooli keeps his eye on the portal, and backs up two steps.\n               He lets out a long deep breath of relief, turns... WHAM!!!\n               Another tentacle envelops his face!\n\n                                   MAMOOLI\n                         EEEYYYAAAHHHH!!!!!\n\n                                                       CUT TO:\n\n       102     MECHANICAL CHAMBER - NIGHT                             102\n\n               Dante's Inferno: STEAM, SMOKE, FIRE, STRANGE NOISES, DARK\n               AREAS, and lots of MOVING ENGINE PARTS. \n\n               Finnegan leads, followed by Trillian, Hanover, Pantucci, and\n               Canton. We can HEAR their HEARTS BEATING. Scary shit.\n               Finnegan heads for a open HATCH. It suddenly SLAMS SHUT. He\n               instantly VEERS down another passageway.\n\n                                   PANTUCCI\n                         What the hell is going on!!\n\n               Finnegan heads for another open HATCHWAY. It also SLAMS SHUT.\n\n                                   FINNEGAN\n                         They're herding us. \n\n               Finnegan and company keep going.\n\n                                   HANOVER\n                         What are you talking about?\n\n               As they round a corner, the CEILING IMPLODES right in front\n               of them. PIPES and OTHER MATTER CRASH down. Cutting them off.\n               Leaving only one route open...a slim passageway.\n\n                                   FINNEGAN\n                         Like cattle...\n\n                                   TRILLIAN\n                         You're saying they can think?\n\n                                   FINNEGAN\n                         I'm saying they're calling the\n                         shots...\n\n               Finnegan heads toward the passageway.\n\n                                   CANTON\n                         Do we have to go there?\n\n               The ceiling left above them begins to torque, and splits. The\n               answer is plain. Everyone runs into the passage just as the\n               ceiling comes down.\n\n                                                       CUT TO:\n\n       103     PASSAGEWAY - NIGHT                                     103\n\n               Finnegan leads them single-file, they quickly head into a\n               SHAKING narrow void. Fear has led to silence, and unbearable\n               tension. The walls on either side creak, and moan with\n               strange noises.\n\n                                                       CUT TO:\n\n       104     MID-HULL - NIGHT                                       104\n\n               Finnegan quickly comes out of the CREAKING, MOANING GANGWAY,\n               followed by the others. All the STRANGE NOISES suddenly STOP.\n               Everything gets quiet. Finnegan freezes. Something's wrong.\n               Everybody looks around. STEAM SHOOTS OUT from multiple pipes.\n               The air is thick with MIST.\n\n                                   TRILLIAN\n                         What's the matter?\n\n                                   FINNEGAN\n                         The quiet...\n\n                                   HANOVER\n                         Maybe we lost them.\n\n                                   FINNEGAN\n                         Or maybe we're exactly where they\n                         want us to be.\n\n               Finnegan moves on. The others follow. Guns out front. TENSE.\n               They round a huge metal pillar and come face-to-face with a\n               soul-wrenching nightmare. The CREATURES' NEST -- OR STOMACH.\n\n               Across a small portion of the ship's midsection, is a huge\n               GELATINOUS WOMB. Imagine a massive thick wall of clear-yellow\n               JELL-O, with hundreds of BLUE VEINS running through it.\n               If it weren't all so horrific, it would be considered\n               beautiful. Inside the womb, A DOZEN HUMANS, passengers, float\n               around in some kind of twisted embryonic state, the living\n               dead. They all seem to be breathing the gelatin. Several\n               TENTACLES WRIGGLE through the stuff; which divides and re\n               forms in some sort of strange mitosis. \n\n               Finnegan and the others look at the passengers, horrified.\n               But even more horrifying is that the people can look back at\n               them. Many start to reach out, seemingly in slow motion as\n               their hands ooze through the thick gelatin. Trillian looks\n               sick, trembles in fear.\n\n                                   TRILLIAN\n                         What is it?\n\n                                   FINNEGAN\n                         A meat locker.\n\n                                   TRILLIAN\n                         We can't just leave them here.\n\n               Canton looks like he's about to throw up, he starts backing\n               away, heading for a side hatch.\n\n                                   CANTON\n                         I can.\n\n               In the womb, a Tentacle suddenly approaches a sexy young\n               LADY. The Lady tries to back-pedal away, but because of the\n               gelatin, it's like one of those nightmares where you can only\n               move in slow motion. The FEELERS GRIP her naked thigh. She\n               tries to scream, but her face is already starting to\n               constrict, her whole body is being paralyzed. Pantucci is so\n               horrified he's about to cry.\n\n                                   PANTUCCI\n                         Oh no...oh God please no.\n\n               The TENTACLE-SAC gloms onto the Lady's forehead. THROUGH THE\n               SAC we can SEE her SKIN MELTING. The only thing she can move\n               are her EYES, which are bugging-out in absolute horror as she\n               is imbibed alive. Our heroes are frozen in fear. Until the\n               Lady's EYES LIQUEFY. \n\n               Trillian burries her head in Finnegan's shoulder, trying to\n               shut out the horror.\n\n                                   FINNEGAN\n                         We can't do anything for them...\n                         Let's go...\n\n               He begins to lead her toward the hatch...when her eyes\n               recognized the old lady with the orchid in her hair. The old\n               lady seems to see her too. Her hands read out, IMPLORING. Her\n               mouth silently shapes the words: HELP ME! Just as a tentacle\n               comes creeping toward her.\n\n                                   TRILLIAN\n                         NOOO!!\n\n               Her rage rises. She hefts her rifle, and starts blasting\n               away.\n\n                                   TRILLIAN (CONT'D)\n                         You won't get her!! You won't!!\n\n               Spitting FLAMES and SMOKE. The BULLETS IMPACT the gelatin.\n               BLASTING IT AWAY. But the bullets only manage to go about\n               twenty feet into the thick shit before gliding to a stop.\n               GELATIN EXPLODES all over the place. TRACER HOLES STREAK\n               through the stuff. But all the bullets are sliding short.\n\n                                   TRILLIAN (CONT'D)\n                         Finnegan...do something!! Please!!\n\n               Finnegan looks around and spots the place in the ceiling\n               where most of the Tentacles are coming from. Their long TAILS\n               WIGGLE down from a massive clutter of pipes. A bas-relief of\n               horror. Finnegan reaches over and yanks two thermite grenades\n               off Hanover's utility belt.\n\n                                   HANOVER\n                         Finnegan, No!!!\n\n               ...bites the pins and spits them out.\n\n                                   FINNEGAN\n                         Eat this.\n\n               He chucks the grenades up into the strange WRITHING FRESCO,\n               safely clear of the passengers.\n\n                                   FINNEGAN (CONT'D)\n                         FIRE IN THE HOLE!\n\n               Pantucci and Hanover throw themselves to the floor. Finnegan\n               pulls Trillian down, covering her.\n\n               BA-WOOM! GELATIN SPRAYS EVERYWHERE.\n\n                                                       CUT TO:\n\n       105     FUJI MARU - SAME TIME                                  105\n\n               A loud, creepy, suction-like SOUND is HEARD, that strange\n               pitter- patter of little feet running across the hull. Then\n               the HULL begins to MOAN and CREAK from an UNSEEN PRESSURE.\n\n                                                       CUT TO:\n\n       106     MID HULL - NIGHT                                       106\n\n               All the MOVEMENT STOPS. The remaining TENTACLES VANISH into\n               the machinery. Pantucci, and Hanover look up from the floor,\n               covered in slime. Finnegan and Trillian also look up...and\n               then look at each other face to face...inches apart. Dripping\n               with slime.\n\n                                   FINNEGAN\n                         Looking good...\n\n                                   TRILLIAN\n                         You should talk...\n\n               Then the machinery shuts down. The engines go dead. ALL SOUND\n               CUTS OUT. An expectant hush. Somewhere, WATER DRIPS... \n\n               WE GO EXTREMELY CLOSE ON Trillian's EYES. Pantucci's EYES.\n               Hanover's EYES. Finnegan's EYES. The air is riddled with\n               ominous expectation. And that's when the HULL BEGINS TO\n               TORQUE. RIVETS POP and SNAP. WATER SPRAYS. METAL BUCKLES.\n\n       107     SHOT:                                                  107\n\n               At the far end of the ship, part of the LOWER BOW RIPS OPEN!\n               AND A WALL OF WATER RUSHES IN. FLOOD CITY! Finnegan's eyes\n               widen as he sees (MODEL SHOT) the massive WAVE OF WATER\n               CRASHING TOWARDS THEM. RIPPING OUT PIPES, DUCTS, WALLS,\n               EQUIPMENT and EVERYTHING in front of it.\n\n                                   FINNEGAN\n                         GO! GO! GO!\n\n               They all hightail it for hatches. Finnegan and Trillian make\n               it into one hatch. Hanover and Pantucci make it into another.\n               WATER CRASHES and SPRAYS behind them.\n\n                                                       CUT TO:\n\n       108     FUJI MARU - NIGHT                                      108\n\n               Massive AIR BUBBLES EXPLODE out from under the bow.\n\n                                                       CUT TO:\n\n       109     FUJI MARU - NIGHT                                      109\n\n               RED WARNING LIGHTS FLASH up and down every passageway. And a\n               CLAXTON RINGS, in accelerating tones, giving a frenetic\n               urgency to ALL OF THE\n\n                                                   FOLLOWING SCENES:\n\n       110     A PASSAGEWAY:                                          110\n\n               WATER BLASTS through a hatch and CHASES Finnegan and Trillian\n               down a passageway. They jag left at an intersection -- WATER\n               BLASTS through the hatch directly in front of them.\n\n                                   FINNEGAN\n                         We're going to sink! We've got to\n                         get on deck!\n\n               They backtrack. Trillian's now in the lead. They HAUL ASS\n               down a hallway. WATER ROARING IN from everywhere behind them.\n               All of the watertight HATCHES begin to hydraulically CLOSE.\n               Trillian and Finnegan JAG into a hatch. It's a small room.\n               The hatch in front of them closes. WATER BLASTS in behind\n               them. SWEEPS them off their feet. The ROOM quickly starts to\n               FILL UP. Trillian pulls frantically at the hatch.\n\n                                                       CUT TO:\n\n       111     NARROW PASSAGEWAY - NIGHT                              111\n\n               Hanover and Pantucci quickly slog their way through knee-high\n               water. Pantucci stumbles into the water, frantically\n               scrambles up. He looks back -- UNDER THE WATER, INKY FORMS\n               hurl themselves down the passageway right towards him.\n               Pantucci YELPS, and splashes away.\n\n                                                       CUT TO:\n\n       112     SUBMERGING ROOM - NIGHT                                112\n\n               Trillian and Finnegan pull with all their might on a tiny\n               portal. Finnegan tries to insert the blade of his knife in\n               the crack.\n\n                                   TRILLIAN\n                         So how do you get from the Bronx to\n                         the South China sea?\n\n                                   FINNEGAN\n                         You quit high school, lie about\n                         your age, join the navy, and next\n                         thing you know, four years are up\n                         and you need a way to make a\n                         living...\n\n               The knife blade slips into the crack.\n\n                                   FINNEGAN (CONT'D)\n                         I'll break the seal! Pull.\n\n               He yanks the blade. Trillian pulls. The seal pops. The portal\n               flies open. Waist-high in water, Trillian sticks her arm out,\n               tries to get her shoulder out, but there's no chance in hell\n               of that.\n\n                                   TRILLIAN\n                         Too small!\n\n               She pulls her arm out. And a TENTACLE LUNGES IN. Just missing\n               Trillian. It SPLASHES under the water. GRABS Finnegan's\n               ankle. Pulls him under. FINNEGAN sticks the barrel of his gun\n               underwater and OPENS FIRE. WATER EXPLODES. The Tentacle\n               recoils. And rips itself back out the porthole. Trillian\n               SLAMS the PORTHOLE SHUT and dogs it tight. The\n\n               WATER QUICKLY RISES.\n\n                                                       CUT TO:\n\n       113     PASSAGEWAY - NIGHT                                     113\n\n               Pantucci and Hanover hauling ass. Hanover pulls out his last\n               two Thermite grenades. Pantucci panics and grabs for them.\n\n                                   PANTUCCI\n                         Gimme one! Gimme one!\n\n               He knocks both of them out of Hanover's hands. They DISAPPEAR\n               under the water.\n\n                                   HANOVER\n                         You idiot!\n\n               They quickly fumble around in the water, trying to find them.\n               A TENTACLE BLASTS around the corner. Partially obscured by\n               the wave in front of it. Heading right for them. Hanover\n               finds the two grenades. Gives one to Pantucci. They rip the\n               pins out and toss the grenades behind them.\n               Then HAUL ASS faster. The Tentacle right behind them. A BEAT.\n               And then the GRENADES EXPLODE, BA-WOOM! BA-WOOM!\n\n                                                       CUT TO:\n\n       114     FUJI MARY - NIGHT                                      114\n\n               The storm hammers the deck. Canton staggers out onto the RAIN\n               SLICKED DECK just in time to see -- A HOLE BEING BLOWN OUT\n               the side of the Fuji Maru's HULL. BUBBLES continue to EXPLODE\n               OUT from under the bow.\n\n                                   CANTON\n                         Oh my God, it's going to sink.\n\n               Then slowly, Canton gets a gleam in his eye, now thrilled.\n\n                                   CANTON (CONT'D)\n                         It's going to sink.\n\n                                                       CUT TO:\n\n       115     SUBMERGED ROOM - NIGHT                                 115\n\n               Finnegan and Trillian are getting banged around the frothy\n               WATER as it quickly RISES. Now only inches from the ceiling.\n               Trapped. They're about to drown. Finnegan keeps looking\n               around, trying to figure a way out.\n\n                                   TRILLIAN\n                         I was so goddamn close, Finnegan!\n                         So goddamn close to my island... I\n                         could almost taste the sand...\n\n                                   FINNEGAN\n                         Keep tasting...\n\n               Finnegan shoves the pulse rifle to the ceiling. And blasts\n               away until part of the ceiling falls out and into the water.\n               There's just enough room between two metal beams to get out.\n               The rising WATER SHOVES them up through the hole.\n\n                                                       CUT TO:\n\n       116     PASSAGEWAY - NIGHT                                     116\n\n               Side-by-side, Hanover and Pantucci quickly slog their way\n               through waist-high water. They round a corner and look back --\n               INKY FORMS SLOSH around the corner. Heading right for them.\n               They slog faster.\n\n                                   PANTUCCI\n                         They're catchin' up! They're\n                         catchin' up! We gotta slow 'em\n                         down!\n\n                                   HANOVER\n                         Feed them. That'll slow them down.\n\n               A black STRIATED MUSCLE ROILS out of the foamy water, then\n               quickly VANISHES under it, heading straight for them.\n\n                                   PANTUCCI\n                         Feed 'em?!! Okay! All right! Feed\n                         'em what? WHAT ARE WE GONNA FEED\n\n               'EM?! Hanover takes his pistol and SHOOTS Pantucci in the\n               leg, BLAM! Pantucci SCREAMS. FALLS into the water. \n\n               Hanover RUNS on. \n\n               Pantucci doesn't even have time to deal with the pain. He\n               starts SCRAMBLING through the water. UNDERWATER, the INKY\n               FORMS RACE AFTER HIM. Only meters away. Pantucci throws\n               himself into the opening of a dumbwaiter. SLAMS the DOOR\n               SHUT. The TENTACLE ATTACKS the door. WORMING its way across\n               the surface, trying to find a way inside. Pantucci is scared\n               beyond his pain. Pushing back as far as he can against the\n               rear wall, he sees the control button. He presses the up\n               arrow. The dumbwaiter starts to move.\n\n                                                       CUT TO:\n\n       117     FUJI MARU REAR DECK - DAY                              117\n\n               The Saipan is still bobbing behind the Fuji Maru. But the\n               HARPOON HOOK, which holds the tow-line and is embedded into\n               the rear deck of the ship, is starting to PRY LOOSE. It JERKS\n               and BUCKS against the metal wall. Canton doesn't notice this\n               as he slips and slides his way up to the railing. He sees the\n               Saipan and smiles. Then he looks off at --\n\n       118     ISLAND                                                 118\n\n               rising out of the ocean. About a mile away. Canton starts to\n               climb over the railing. And that's when the HARPOON HOOK RIPS\n               FREE. WHIZZES FORWARD. And IMPALES Canton's LEG. He SCREAMS.\n               Tries to spin free. The hook hangs onto his leg for a long,\n               agonizing BEAT as Canton continues to SCREAM. Then the HOOK\n               RIPS FREE, grabs the METAL RAILING and starts TEARING IT off\n               the deck. Canton drops to the deck, holding his leg and\n               whimpering in pain. And then he sees it --\n\n       119     SPEEDBOAT                                              119\n\n               dangling from its harness down on the watersports platform.\n\n       120     TO SCENE                                               120\n\n               Canton starts to crawl for it. Moaning and bleeding.\n\n                                                       CUT TO:\n\n       121     CRYSTAL POOL DECK - NIGHT                              121\n\n               Finnegan and Trillian race up onto the pool deck. Passing\n               beneath a colorful NEON SIGN which READS:\n\n               \"THE FUJI MARU - YOUR FUN SHIP\"\n\n               In the dark, Trillian trips. She falls to the slippery,\n               waterlogged deck, and SCREAMS...\n\n                                   TRILLIAN\n                         EEEEEYYYYYAAAAHHHH!\n\n               ...clawing at her face... Finnegan pulls her hands from her\n               face...and the thing that attached itself there...a small\n               squid from the shattered aquarium.\n\n                                   TRILLIAN (CONT'D)\n                             (freaked)\n                         Ah...ah...ah... \n\n               Tries to catch her breath.\n\n                                   FINNEGAN\n                         It's OK...it's not one of them...\n                         it's from the aquarium...it's...\n\n               And then it dawns on Finnegan.\n\n                                   FINNEGAN (CONT'D)\n                         It's not them...it's it...\n\n                                   TRILLIAN\n                         What?\n\n                                   FINNEGAN\n                         You know what kind of force it took\n                         to rip open the bow of this ship? A\n                         million little things like this...\n\n               He holds up the squid.\n\n                                   FINNEGAN (CONT'D)\n                         ...can't exert that kind of\n                         pressure... And the way it tracked\n                         us? A million little things don't\n                         carry portable phones to coordinate\n                         positions... What's chasing us...\n                         it's one...thing...one giant...\n                         thing.\n\n                                                       SMASH CUT TO:\n\n       122     ARIAL POV - MATTE FX SHOT - NIGHT                      122\n\n               ...looking down on the Fuji Maru from high up in the air.\n               Beneath the ENTIRE SHIP is an enormous, undulating BLACK\n               SHADOW. A massive monster from the deep.\n\n                                                       CUT TO:\n\n       123     CASINO - NIGHT                                         123\n\n               RED WARNING LIGHTS FLASH. The CLAXTON RINGS. Off to one side\n               of a wall, behind the bar, the dumbwaiter door opens, and\n               Pantucci tumbles out, looks around, and then hears...\n\n                                   HANOVER (V.O.)\n                         Help!! Help!! \n\n               Pantucci limps around the bar, down a row of one armed\n               bandits... rounds a corner, comes face-to-face with Hanover.\n\n               Hanover's eyes are filled with terror and despair. His face\n               is badly constricted. His body paralyzed. He clings to a\n               black-jack table as a Tentacle-Sac drinks its way up his leg.\n               It's already to his hip. He grasps desperately for his\n               pistol, just beyond his reach on the floor. This guy ain't\n               gonna survive. \n\n               PANTUCCI YELPS and quickly back away, eyes wide, totally\n               tense. He looks around, sees that there's only one Tentacle,\n               and it's completely occupied with devouring Hanover. Pantucci\n               is wigged, but manages to lock eyes with Hanover. Then he\n               looks at the Sac, filled with regurgitated flesh.\n\n                                   PANTUCCI\n                         ...even you don't deserve this.\n\n               Pantucci picks up Hanover's pistol. Then slowly, cautiously,\n               he creeps forward, and sticks the gun into Hanover's\n               TWITCHING HAND.\n\n                                   PANTUCCI (CONT'D)\n                         I'm sorry man...\n\n               He turns and quickly limps off. Hanover's EYES look down at\n               the gun in his hand. Then, with all the strength he has left,\n               he slowly, painfully, turns the pistol so it points at his\n               head. \n\n               CLOSE ON: Hanover's trembling FINGER. As it slowly squeezes\n               the trigger. He want to kill himself. Needs to hill himself.\n               He squeezes harder. The TRIGGER DEPRESSES! -- CLICK! The gun\n               is empty. Hanover's mouth opens in a horrible, silent scream.\n\n                                                       CUT TO:\n\n       124     REAR DECK - SAME TIME                                  124\n\n               Finnegan and Trillian race out onto the rear deck just as the\n               HARPOON HOOK finishes TEARING the railing off the ship. The\n               HOOK, the TOW- LINE, and the ENTIRE RAILING DROP over the\n               side and fall OUT OF SIGHT. The TWO BOATS are now UNCOUPLED.\n               Finnegan reels at the rain soaked sky.\n\n                                   FINNEGAN\n                         Will somebody give me a break here?\n\n               And that's when Finnegan and Trillian hear the SOUND of a\n               HYDRAULIC HOIST. They look over --\n\n       125     AT THE WATERSPORTS PLATFORM:                           125\n\n               The speedboat is being hydraulically lowered into the water.\n               Canton sits inside, fiddling with the ignition. ANGLE ON:\n               Trillian and Finnegan racing down the spiral stairs leading\n               to the watersports platform.\n\n                                   TRILLIAN\n                         Wait! Stop!\n\n               The boat touches down into the water.\n\n                                   CANTON\n                         I'd like to but I have an\n                         appointment with my insurance\n                         broker!\n\n               He HITS the HOIST-RELEASE BUTTON. The speedboat breaks free.\n               Canton HITS the IGNITION. The boat's ENGINE ROARS.\n\n                                   CANTON (CONT'D)\n                         Life takes the damndest turns,\n                         doesn't it?\n\n               He red-lines the THROTTLE. The SPEEDBOAT HAULS ASS away from\n               the cruiseliner. Canton steers for the island. Smiling. \n\n               ANGLE ON: Trillian\n\n               IN HER RAGE...\n\n                                   TRILLIAN\n                         You son of a bitch!!\n\n               She grabs Finnegan's pulse rifle, hefts it to her shoulder...\n\n                                   FINNEGAN\n                         Look!\n\n               He forces her to look in the distance. Their POV. The island.\n\n                                   TRILLIAN\n                         Oh my god! Oh my god! How do we do\n                         it? How do we get there?\n\n                                   FINNEGAN\n                         Not like him.\n\n               Finnegan points to the water...and an INKY PSEUDOPOD FORM\n               racing after the speedboat underwater.\n\n                                   FINNEGAN (CONT'D)\n                         It's the engine...it can hear the\n                         engine...it goes for the loudest\n                         sound...\n\n               The Tentacle quickly picks up speed, going faster and faster,\n               getting closer and closer, stretching further and further.\n               Suddenly, behind them, a METALLIC THRASHING SOUND is HEARD.\n               They turn around and look -- The hook, the tow-line, and the\n               entire railing have dropped down onto the watersports\n               platform and are tangled up around the two jet skis, trying\n               to tear free -- The Saipan is still clinging by its\n               fingernails to the Fuji Maru! Finnegan races over to a WINCH\n               and grabs the winch- line.\n\n                                                       CUT TO:\n\n       126     SPEEDBOAT - NIGHT                                      126\n\n               Canton, smiling brightly, peers at the approaching island\n               through the speedboat's windscreen. So relieved he sings to\n               himself, from the operetta H.M.S. PINAFORE.\n\n                                   CANTON\n                         Oh we sail the ocean blue, and our\n                         mighty ship's a beauty. We are\n                         strong men, yes it's true, and\n                         responsive to our duty...\n\n               When...YANK!!...the SPEEDBOAT is GRABBED from below,\n               practically exploding as it DISINTEGRATES into TWO PIECES.\n               Canton is PROPELLED through the windscreen and onto the hood.\n\n                                                       CUT TO:\n\n       127     WATERSPORT PLATFORM - NIGHT                            127\n\n               Finnegan struggles to clip the winch-line onto the tow-line,\n               hanging precariously over the edge of the ship, clip in one\n               hand, winch-line in the other. The whole METAL MESS is\n               BUCKING and TWISTING and SCREECHING. His every joint is being\n               ripped out of socket as he strains to get the clip on the\n               line before the entire rig tears away into the sea. \n\n               With one last heroic effort of will and grit, he snaps the\n               clip in place just as it all BREAKS LOOSE. One of the JET\n               SKIS and the ENTIRE RAILING are RIPPED over the side and fall\n               down into the ocean. Finnegan is also YANKED over the side,\n               but he manages to hold on by his fingers, dangling\n               precariously.\n\n                                   FINNEGAN\n                         Hit it! Hit it!\n\n               The HOOK and the TOW-LINE drop -- then SNAP TAUGHT as the\n               winch-line holds them tight.\n\n               Trillian throws the start lever on the winch. The WINCH KICKS\n               ON and starts reeling in the Saipan. Finnegan tries to crawl\n               up on the deck, exhausted. Trillian reaches down and pulls\n               him the rest of the way up. He half collapses on top of her.\n\n                                   TRILLIAN\n                         You know, Finnegan, I'm starting to\n                         believe what you said about you not\n                         being born to die on a luxury\n                         liner.\n\n               Despite the grimness of their position, the closeness of\n               their bodies is...a turn on...to both of them...and then a\n               SCREAM from the sea. They look in the direction of...\n\n                                                       CUT TO:\n\n       128     SPEEDBOAT - NIGHT                                      128\n\n               Canton is pinned to the hood of the speedboat, his face\n               shredded by glass, his leg mangled, screaming as his panicked\n               eyes watch a TENTACLE slowly squirm across the hood toward\n               him, it's hideous feelers writhe and arch. Canton backs away\n               from it as far as he can.\n\n               Another TENTACLE SQUIRMS up next to him. Canton crawls away\n               from that one. Its Feelers and Suckers unsheathe, dripping\n               mucus. Canton's eyes widen, horrified. Then another TENTACLE\n               SQUIRMS up. Canton crawls to the center of the hood. And\n               another TENTACLE. Canton has nowhere to go. The Tentacles\n               close in on him.\n\n                                   CANTON\n                         No! No! No!\n\n               All the tentacles rise over him, about to descend.\n\n                                   CANTON (CONT'D)\n                         NOOOOOOOOOOOO!!!!!!\n\n                                                       CUT TO:\n\n       129     FUJI MARU - NIGHT                                      129\n\n               Finnegan and Trillian race for all they are worth, clamber\n               over the side of the Fuji Maru, dropping to the deck of the\n               Saipan.\n\n                                                       CUT TO:\n\n       130     SAIPAN - NIGHT                                         130\n\n               Finnegan and Trillian slowly clamber through the hold, waist\n               deep in water, on edge, eyes wide, watching for any sign of\n               trouble. It's quiet in here. Maybe too quiet.\n\n                                   TRILLIAN\n                             (quietly)\n                         Finnegan...\n\n                                   FINNEGAN\n                         Yeah...\n\n                                   TRILLIAN\n                         ...the minute you start your\n                         engines ...it's going to kill us,\n                         isn't it?\n\n               They step up to one of the big CRATES. Finnegan starts\n               SMASHING it with the butt of his pulse-rifle. The CRATE BURST\n               OPEN. REVEALING the WARHEAD of the torpedo. Trillian is\n               stunned.\n\n                                   FINNEGAN\n                         Not unless we kill it first.\n\n               Finnegan SMASHES more of the CRATE, it falls apart, REVEALING\n               the entire torpedo. He hands her his pulse rifle.\n\n                                   FINNEGAN (CONT'D)\n                         Anything moves, you shoot.\n\n               Finnegan starts to yank open the top plates of the missile\n               head. Trillian looks around nervously.\n\n                                   FINNEGAN (CONT'D)\n                         There's not much horsepower left in\n                         the engines, but there's enough\n                         noise...once this baby's set...I'll\n                         rev it up...that slimy bastard will\n                         come for it like candy...\n\n                                   TRILLIAN\n                         If you blow up your boat, how are\n                         we going to get to the island?\n\n                                   FINNEGAN\n                         Jet ski...there's one left up\n                         there.\n\n               The plate comes loose. Revealing a gaggle of wires, and\n               parts.\n\n                                   FINNEGAN (CONT'D)\n                         ...let's see, it was red wire cross\n                         compressor blue wire...or blue\n                         cross red?\n\n               He starts to fiddle with the wires. -- Suddenly, there's a\n               LOUD SLOSHING SOUND right behind them! CRATES TOPPLE! More\n               pulse rifles spill out. Trillian spins, ready to blast away\n               with the pulse rifle, to...\n\n                                   PANTUCCI\n                         Don't shoot!! Don't shoot!!\n\n                                   FINNEGAN\n                         Just the man I wanted to see. On\n                         this puppy here, you remember if\n                         it's red to blue or blue to red... \n\n               He refers to the wires.\n\n                                   PANTUCCI\n                         Not even a Joey, I'm glad to see\n                         you? Joey, what happened to your\n                         leg?\n\n                                   FINNEGAN\n                         Joey, you want to get sucked out by\n                         a giant fucking mutated squid?\n\n                                   PANTUCCI\n                             (fast)\n                         Red cross over to blue double blue\n                         ...is that what it is? A squid?\n\n                                   FINNEGAN\n                         Squid...squid like...squid type...\n                         it's got tentacles, a feed sac...\n                         probably one central nervous\n                         processor somewhere...what the hell\n                         do I know is going on deep down in\n                         the ocean...there's all sorts of\n                         shit we've never seen...eighty foot\n                         clams...60 foot sharks...I'm just\n                         guessing...can you get me more\n                         juice out of Hercules...fast?\n\n                                   PANTUCCI\n                         For juice, I gotta rebuild. That's\n                         not fast.\n\n                                   TRILLIAN\n                         How about noise? Can you get noise?\n                         We don't need speed, just noise,\n                         right?\n\n                                   FINNEGAN\n                         Right...\n\n                                   PANTUCCI\n                         Can somebody tell me what the\n                         object of the exercise is here?\n\n                                   FINNEGAN\n                         Seafood salad.\n                             (to Trillian)\n                         You ever operate a jet ski?\n\n                                   TRILLIAN\n                             (nervous)\n                         You want ME to go up there?\n\n                                   FINNEGAN\n                         Not unless you can wire a missile\n                         or fix an engine.\n\n                                   TRILLIAN\n                         And what if I run into one of those\n                         things?\n\n               Finnegan tosses her a pulse rifle from the overturned crate.\n\n                                   FINNEGAN\n                         Don't forget the safety.\n\n               She hits the safety, slams a shell into chamber...\n\n                                   TRILLIAN\n                         Don't take too long...I'm not\n                         planning on being on the menu\n                         tonight.\n\n               ...and exits.\n\n                                   PANTUCCI\n                             (razzing)\n                         I've never seen you so congenial\n                         with a member of the opposite\n                         sex... The two of you got a nice\n                         patter going...got a nice\n                         rapport...\n\n                                   FINNEGAN\n                         And you got 10 minutes before this\n                         thing livens up a boring evening.\n\n               Finnegan attaches a wire to a sprocket. A red light starts to\n               blink on the warhead.\n\n                                                       CUT TO:\n\n       131     FUJI MARU - NIGHT                                      131\n\n               It is VERY DARK. The RAIN is getting worse. THUNDER RUMBLES.\n               LIGHTNING FLASHES. The FUJI MARU MOANS and CREAKS.\n               BUBBLES EXPLODE from beneath it. The Saipan rocks against her\n               hull. Trillian clambers along the TILTING RAILING, heading\n               for the watersports platform. Her gorgeous eyes shift\n               nervously.\n\n                                   TRILLIAN\n                         I'm going to be OK...I'm going to\n                         be\n\n               OK... The ship's METAL HULL SCREECHES. The SEAWATER BUBBLES\n               and GURGLES. From somewhere deep inside the ship, we HEAR\n               that loud primordial YOWL again. Trillian freezes, her heart\n               double beats. She looks around, really scared.\n\n                                                       CUT TO:\n\n       132     SAIPAN'S HOLD - NIGHT                                  132\n\n               The missile is on a hoist being pushed forward by Pantucci\n               and Finnegan toward a GAPING HOLE in the PORT BOW.\n\n                                   PANTUCCI\n                         You know what I think? I think our\n                         luck has just about run shit out...\n\n                                   FINNEGAN\n                         A little to the left...\n\n                                   PANTUCCI\n                         I think we gotta stop floating from\n                         one fucked up situation to the\n                         next...\n\n                                   FINNEGAN\n                         Line it up now, nice and easy...\n\n               The missile head is right in line with the hole in the bow.\n\n                                   PANTUCCI\n                         I'm telling you, man, we got to\n                         give the future some serious\n                         thought.\n\n                                   FINNEGAN\n                         I have been.\n\n                                   PANTUCCI\n                         And what have you come up with?\n\n                                   FINNEGAN\n                         How does an island sound to you?\n\n               Pantucci looks at Finnegan quizically. This is news to him.\n\n                                                       CUT TO:\n\n       133     SAIPAN - NIGHT                                         133\n\n               The TIP of the WARHEAD creeps out through the hole. The body\n               of the missile is just a hair too wide, which is good,\n               because it jams itself nice and tight into the hole.\n\n                                                       CUT TO:\n\n       134     WATERSPORT PLATFORM - NIGHT                            134\n\n               Trillian takes the tarp off the remaining jet ski. Pushes the\n               swivel arm that holds it out over the railing. The PLATFORM\n               TILTS! Trillian loses her balance. Almost goes over the side.\n               Just barely manages to catch herself. Hangs there for a\n               moment. Something SWISHES in the water below her. Trillian's\n               EYES scan the darkness; scared sick.\n\n                                                       CUT TO:\n\n       135     THE SAIPAN'S PILOT HOUSE - NIGHT                       135\n\n               Finnegan LASHES the STEERING-STICKS as hard left as they'll\n               go. The rudder locks tight. Pantucci enters.\n\n                                   PANTUCCI\n                         I gerry-rigged the ignition...all\n                         you gotta do is start her up...it\n                         won't go fast but it'll go loud...\n\n               Trillian's scream tears through the night. Finnegan's eyes go\n               to the Fuji Maru. He kicks open a box by the side of the\n               console, and pulls out a sawed off shot gun with a pistol\n               handle in a holster.\n\n                                   PANTUCCI (CONT'D)\n                         Man, don't go up there...\n\n                                   FINNEGAN\n                         One whistle... Start the engine...\n\n               Finnegan slams shells into the shotgun.\n\n                                   PANTUCCI\n                         She's gone...\n\n                                   FINNEGAN\n                         Second whistle you make it to the\n                         deck and get ready to jump...\n\n                                   PANTUCCI\n                         All you're gonna do is get yourself\n                         killed...and for what? Some chick?\n\n                                   FINNEGAN\n                         You're beautiful what you're\n                         jealous, you know that, Joey?\n\n               Finnegan hefts a pulse rifle, and runs out of the pilothouse.\n\n                                                       CUT TO:\n\n       136     FUJI MARU DECK - NIGHT                                 136\n\n               Finnegan drops onto the deck from the tow line. Pulse-rifle\n               leveled. Adrenaline rushing through his veins. A man on a\n               mission. The SHIP is in its final death throes. MOANING and\n               CREAKING. Trillian's scream pierces the night, followed by\n               several shots. Finnegan takes off in it's direction.\n\n                                                       CUT TO:\n\n       137     FUJI MARU PASSAGEWAY - NIGHT                           137\n\n               Finnegan ENTERS. Ready to be jumped. The scary MUSIC builds.\n               TENSION CITY. Again shots fired. This time closer. Finnegan\n               throws caution to the winds, and runs for all he is worth.\n\n                                                       CUT TO:\n\n       138     HALLWAY - NIGHT                                        138\n\n               Trillian is being dragged down the dark hallway by a tentacle\n               wrapped around her legs. She struggles frantically, trying to\n               get a clear shot off. But her shot goes wild as she is pulled\n               this way and that, slammed against the walls on either side.\n               She loses her rifle.\n\n                                                       CUT TO:\n\n       139     GRAND ATRIUM - NIGHT                                   139\n\n               Finnegan ENTERS the glass-domed atrium. Sloshes through the\n               water. Stops in the middle and looks around. Sees a Tentacle,\n               writhing up a glass wall of the atrium. Finnegan hears\n               TRILLIAN SCREAM. He quickly plants his feet and FIRES from\n               the hip. GLASS SHATTERS EVERYWHERE. He arcs around. WINDOWS\n               BLOW TO PIECES. Finnegan lets out a low, angry, guttural\n               YELL. The TENTACLE SHREDS from the GUNFIRE.\n\n                                                       CUT TO:\n\n       140     HALLWAY - NIGHT                                        140\n\n               The tentacle dragging Trillian retracts. Freed, Trillian gets\n               up, grabs her rifle, and RUNS LIKE HELL.\n\n                                                       CUT TO:\n\n       141     FRISCO BAR - NIGHT                                     141\n\n               Trillian runs in and is immediately hit by COLORFUL SWIRLING\n               LIGHTS and a PULSATING STROBE. FLASHING RED WARNING LIGHTS,\n               the SOUND of the CLAXTON, the SPRAYING WATER and thick\n               MIST...major psychedelia. Disoriented, Trillian runs towards\n               a dark exit door -- and into a geometric gelatinous SPIDER\n               WEB. Sticks.\n\n                                   TRILLIAN\n                         NOOO!! NOOOO!! HELPP!! HELPP!!\n\n                                                       CUT TO:\n\n       142     ATRIUM - NIGHT                                         142\n\n               Finnegan is slamming another clip into his pulse rifle when\n               he hears TRILLIAN, YELLING for help. He takes off running\n               through a hatch.\n\n                                                       CUT TO:\n\n       143     FRISCO BAR - NIGHT                                     143\n\n               Trillian struggles in the web, but she's only getting herself\n               more stuck. Behind her, deep in the web, Tentacles slowly\n               start squirming their way towards her. Trillian feels the\n               GELATIN start to MOVE. She struggles wildly. \n\n               Panicked. Finnegan ENTERS the room. Spots Trillian. Starts\n               sloshing his way through the water. Trillian sees him coming.\n\n                                   TRILLIAN\n                         Finnegan!\n\n               Trillian looks back. Sees the Tentacles coming out of the\n               darkness of the web. Twenty feet back and closing.\n\n                                   TRILLIAN (CONT'D)\n                         Hurry!! Hurry!!\n\n               Finnegan runs up and grabs her. Tries to pull her free. But\n               she's stuck good. He looks behind her to the tentacles\n               quickly closing in on her. Now fifteen feet away.\n\n                                   TRILLIAN (CONT'D)\n                         Get me out of here!!\n\n               As she struggles, Finnegan pulls out his knife, and starts to\n               hack away at the sticky webbing. Trillian tries to look\n               behind her.\n\n                                   FINNEGAN\n                         Don't look!! Push!!\n\n               Trillian struggles with every last ounce of her strength. Now\n               ten feet away.\n\n                                   TRILLIAN\n                         FINNEEGGGAANNN!!!\n\n               Finnegan hacks away with desperate urgency. Now five feet.\n\n                                   FINNEGAN\n                         Grab my hands!!\n\n               Finnegan plunges his hands into the goo. Trillian latches\n               onto Finnegan's wrists, he onto hers. Four feet.\n\n                                   FINNEGAN (CONT'D)\n                         Push!! Push!!\n\n               Finnegan strains, pulling, until every muscle in his body\n               keens with the effort, every vein pops to the surface.\n               Trillian pushes for all she is worth. Three feet...two\n               feet...one foot...\n\n                                   BOTH\n                         YYYEEEAAAHHH!!! \n\n               With a last gargantuan effort, Finnegan yanks...Trillian\n               comes tearing out of the webbing...the remnants of her gown\n               doesn't...in the nick of time. \n\n               The tentacle rushes forward. Finnegan jams his pulse-rifle\n               into the web and OPENS FIRE. Blasting the entire clip into\n               the goo. Tearing the shit out of it. BAMBAMBAMBAMBAM!!!!!! \n\n               And that's when the whole ROOM starts to QUAKE. And SHAKE!\n               Finnegan and Trillian both look down at their feet as they\n               hear the LOWER DECKS EXPLODING UPWARD, one at a time -- BAM! \n               - BAM! -- BAM! Something is rising up through the ship. He\n               grabs Trillain and pulls her toward the exit. She scoops her\n               fallen pulse rifle off the floor.\n\n                                   FINNEGAN\n                         Go! Go! Go!\n\n               He shoves her out the door, and is about to follow when the\n               door is slammed shut in his face.\n\n                                   TRILLIAN (V.O.)\n                         Finnegan!!!\n\n                                   FINNEGAN\n                         Get to the jet ski! Go!\n\n                                                       CUT TO:\n\n       144     HALLWAY - NIGHT                                        144\n\n               Trillian stands there, pulling on the door, half naked. The\n               door is bolted tight. She has not other options. She runs\n               off.\n\n                                                       CUT TO:\n\n       145     FRISCO BAR - NIGHT                                     145\n\n               Finnegan turns as the DANCE FLOOR and the D.J. BOOTH EXPLODE\n               as SOMETHING RISES UP from below them. His eyes widen. And\n               there it is -- The huge, horrible, mutated, mucus-covered,\n               sucker-faced HEAD OF THE CREATURE. \n\n               A giant mutated protoplasm. Jutting up from a breach in the\n               floor. The trunk of the Creature, the part where all the\n               Tentacles come from, is below the next deck. A slimy,\n               translucent MEMBRANE slowly RISES, REVEALING what appears to\n               be some sort of ORGANIC LIQUID EYE. It seems to stare right\n               at Finnegan, who is transfixed by the sight. A Tentacle\n               slowly starts to move in on Finnegan. \n\n               Finnegan starts making his way around the shattered debris\n               that blocks his shot. The EYEBALL-type organism follows him.\n               Another Tentacle starts to move. Silently undulating through\n               the water towards Finnegan. The membrane over the EYE moves.\n               And another Tentacle starts to close in for the kill. They\n               are surrounding Finnegan. Finnegan comes around the shattered\n               D.J. booth. Faces the Creature full-on. He can't miss. He\n               gives it a wicked smile.\n\n                                   FINNEGAN\n                         Get a good look...\n\n               In SLOW-MOTION, Finnegan lifts his pulse-rifle. It DRIPS\n               WATER. He jams the gun-butt into his hip. Takes aim -- FIRES!\n               But he only gets off one quick BURST before a TENTACLE LASHES\n               OUT and GRABS him. JERKS him into the air. His pulse-rifle\n               goes flying. Finnegan is being dragged toward the hole into\n               the floor, and the death that awaits him.\n               He struggles to free himself as the hole looms closer,\n               closer. He is about to disappear down the hole of no return,\n               when his hand comes up with his knife. He slashes the\n               tentacle in two, scrambles up and heads for an open door. As\n               he reaches the door, a tentacle rises up in front of him.\n               Huge. Blocking his way. It's maw opens wide. A terrifying\n               sight of jaws and teeth and death. About to devour him. As it\n               strikes forward, Finnegan draws his shotgun, and blasts the\n               vile thing to smithereens. He bolts through the door, several\n               Tentacles already after him.\n\n                                                       CUT TO:\n\n       146     WATERSPORTS PLATFORM - NIGHT                           146\n\n               Trillian sits up on the jet ski. She hears the GUNFIRE.\n\n                                   TRILLIAN\n                         FINNEGAN!! COME ON!!\n\n                                                       CUT TO:\n\n       147     PASSAGEWAY - NIGHT                                     147\n\n               Finnegan runs wildly down a passageway. He rounds a corner. A\n               TENTACLE SIDE-SWIPES him. Hard. SMASHES him into a wall.\n               Finnegan DROPS the shotgun. Hits the floor running. Another\n               TENTACLES CHECKS him. Sends him SPIRALING through a hatch. \n\n               Finnegan TUMBLES in. Face-first. Quickly rolls over and looks\n               back -- A TENTACLE LASHES in through the doorway. Finnegan\n               back-pedals on his hands and feet, stumbling over various\n               sports equipment. The TENTACLE homes-in on him. CHARGES\n               FORWARD. Finnegan hurls himself backwards. THROWING anything\n               that comes to hand at the Tentacle. A VOLLEYBALL. A WATERSKI.\n               A TACKLE BOX. A FRISBEE. But onward it comes. Finnegan back\n               pedals faster. Over diving gear. Scuba tanks. Fins and masks. \n\n               The TENTACLE RISES. About to STRIKE. \n\n               Finnegan backs into the wall. Trapped. He spots a SPEARGUN.\n               Grabs it. \n\n               The TENTACLE LUNGES. Finnegan FIRES. NAILS IT. PINS IT to the\n               wall. Finnegan scrambles past the furiously WRITHING TENTACLE\n               and runs out of the room.\n\n                                                       CUT TO:\n\n       148     WATERSPORT PLATFORM - NIGHT                            148\n\n               Trillian lifts up her feet as the jet ski touches down into\n               the dark water. She frantically whispers to herself:\n\n                                   TRILLIAN\n                         Oh my God, oh my God.\n\n               Suddenly, twenty feet from the jet ski, SOMETHING SWIRLS\n               through the water. Trillian aims her pulse-rifle at it. Eyes\n               wide. Knuckles white. Breathing hard. WHAMM!! Something drops\n               onto the ski behind her.\n\n                                   TRILLIAN (CONT'D)\n                         EEEEYYYYAAAHHH!!!!\n\n               She turns, ghost white...to Finnegan.\n\n                                   FINNEGAN\n                         I don't mean to drop in unannounced\n                         ...you ready...\n\n                                   TRILLIAN\n                         Soon as I get over the heart\n                         attack...\n\n               Finnegan whistles. Waits. No engine goes on. He whistles\n               again. Still no response. Removes his watch, gives it to\n               Trillian.\n\n                                   FINNEGAN\n                         Three minutes...I'm not back...no\n                         matter what...you go...\n\n                                   TRILLIAN\n                         No...\n\n                                   FINNEGAN\n                         You don't take orders very well, do\n                         you?\n\n                                   TRILLIAN\n                         I don't take orders at all.\n\n                                   FINNEGAN\n                         This time, make an exception.\n\n               He grabs Trillian's pulse rifle, and leaps up on the side of\n               the Saipan, and scales up to the deck. Trillian watches him,\n               and then looks at the watch.\n\n                                                       CUT TO:\n\n       149     SAIPAN PILOT HOUSE - NIGHT                             149\n\n               Finnegan bursts in.\n\n                                   FINNEGAN\n                         Pantucci!... JOEY!\n\n               Then he spots something on the floor. He reaches down and\n               picks it up. It's Pantucci's leather tool belt. It's been\n               RIPPED TO SHREDS. Finnegan stares at it. His grip tightening.\n               Tears rising in his eyes. His jaw clenching. Then he flings\n               the belt aside. Filled with rage.\n\n                                   FINNEGAN (CONT'D)\n                         Time to die, motherfucker.\n\n               Finnegan hits the ignition button. A desperate moment of dry\n               cranking ...and then the one remaining engine catches,\n               sputters, and fires to life.\n\n                                                       CUT TO:\n\n       150     FUJI MARU - NIGHT                                      150\n\n               Trillian hears the Saipan's engine come to life. She hits the\n               ignition on the jet ski. Right next to her something drops\n               from the deck of the Saipan into the water. Finnegan clambers\n               up in front of her. His pulse rifle still in hand.\n\n                                   TRILLIAN\n                         Where's you friend?\n\n                                   FINNEGAN\n                         He's not coming...\n\n               The Saipan strains on its leashes. ENGINES GUNNING. Finnegan\n               swings his rifle around. OPENS UP on the tie-lines. All the\n               TIE-LINES SHRED. The Saipan starts to break free.\n\n                                   FINNEGAN (CONT'D)\n                         Hold on!\n\n               He GUNS the ski...and it stalls. The jet ski stalls. Goes\n               dead in the water.\n\n                                   FINNEGAN (CONT'D)\n                         Oh shit!!\n\n               Nearby, the WATER SWIRLS violently. He hammers the starter\n               button.\n\n                                   FINNEGAN (CONT'D)\n                         Come on!!\n\n               The ENGINE STUTTERS. He tries again.\n\n                                   FINNEGAN (CONT'D)\n                         Come on!!\n\n               Another STUTTER. More WATER SWIRLS, getting closer now. But\n               the third time's a charm. The jet ski comes to life and\n               shoots off along the side of the ship. Just as a tentacle\n               comes shooting out of the water. Finnegan fires at it,\n               blowing it to pieces. The last TIE-LINE SNAPS. The SAIPAN\n               LURCHES AWAY from the Fuji Maru. The jammed steering-sticks\n               force the rudder to turn it in a tight circle.\n\n       151     FAST:                                                  151\n\n               Finnegan bears down on the handlebars of the jet ski. Pedal\n               to the metal. Looking straight ahead. Trillian holds on for\n               dead life. Suddenly, a WAVE EXPLODES in front of the jet ski.\n               Finnegan cranks the handlebars. The JET SKI SLEWS SIDEWAYS.\n               The Saipan starts to arc around. The WARHEAD gleams in the\n               MOONLIGHT. Dripping water. Finnegan HAULS ASS away from the\n               Fuji Maru. ENGINE ROARING. Throwing water. Another WAVE\n               EXPLODES. A tentacle rears up. Right in front of the jet ski.\n               Finnegan and Trillian lean hard. The JET SKI SKIDS sideways\n               across the water.\n\n               BOUNCING HARD.\n\n               Trillian can't hold on. Flips off the back. Skips across the\n               water. Finnegan ROARS away. A tentacle hard on his ass.\n               Trillian pops to the surface. Treads water. Panicked. Watches\n               Finnegan and the jet ski leaving her behind. Finnegan looks\n               back at Trillian. Bobbing in the water. The he looks at the\n               Saipan. Continuing its arc. Its deadly payload racing for the\n               Fuji Maru. Finnegan CRANKS the HANDLEBARS. SMASHES through a\n               wave and heads for Trillian. Trillian sees him and swims\n               hard. The SAIPAN ROARS straight at the Fuji Maru. The warhead\n               perfectly positioned to strike its hull. Only fifty meters\n               away. Now forty. Now thirty-five.\n\n       152     FASTER:                                                152\n\n               Finnegan cuts the motor of the jet ski. Slides up next to\n               Trillian. Grabs her by her arm. Rips her out of the water.\n               Throws her onto the back of the jet ski. Just as a tentacles\n               rises up, lashing out. He GUNS IT. SMASHES through the waves.\n               The WARHEAD SPLASHES through the water. The jet ski hauls\n               ass.\n\n               ENGINES WHINING OUT.\n\n               Faster and faster. A HUGE GEYSER OF WATER EXPLODES in front\n               of the jet ski. A tentacle slaps down hard. Finnegan cuts\n               hard. Too late. The JET SKI RAMPS through the geyser.\n               They and the JET SKI TUMBLE and SPLASH across the water. The\n               SAIPAN CHARGES FORWARD. \n\n               Twenty-five meters away from hitting the Fuji Maru. No twenty\n               meters away. Now fifteen.\n\n               Finnegan pops to the surface. Looks around. Can't find\n               Trillian. He DIVES under the water. His POV: Tentacles\n               converging on him from the murky depths. The \"retrieve\"\n               feature that's on all jet skis forces it back around towards\n               where Finnegan and Trillian fell off. Finnegan BURST to the\n               surface. Holding Trillian. She looks nearly lifeless. The jet\n               ski heads right at them. Finnegan swims for it. Dragging\n               Trillian. As tentacles converge from all sides. \n\n               The JET SKI is suddenly SUCKED under the water! Swallowed\n               whole. Finnegan quickly reverses. Backstrokes like mad. The\n               WARHEAD SLICES through the water. Now only ten meters away\n               from hitting the Fuji Maru.\n\n               Now nine meters away. Now eight. Seven. Six. Five.\n\n       153     GO INTO SLO-MO NOW AS:                                 153\n\n               Finnegan paddles hard. Sucking in as much water as he is air.\n               A TENTACLE RISES UP out of the water. Looms above Finnegan\n               and Trillian. Dripping water. About to strike. There's\n               nowhere to hide. Finnegan paddles harder.\n\n       154     COME OUT OF SLOW-MO AS:                                154\n\n               The TENTACLE starts its DOWNWARD LUNGE. And that's when the\n               SAIPAN RAMS the Fuji Maru. The WARHEAD SLAMS into its hull.\n\n               BA-WHOOOOOOMMM!!\n\n               The SAIPAN EVAPORATES.\n\n               METAL FLIES.\n\n               WATER SPRAYS.\n\n               FIRE FILLS the night sky. The TOP DECK of the Fuji Maru\n               CARTWHEELS across the waves. The Tentacle above Finnegan\n               drops like lead. And just lies there. Quivering. Another\n               EXPLOSION. LIFTS the remains of the FUJI MARU out of the sea.\n               Sends shock waves across the water. \n\n               Blows Finnegan's hair back. He swims on. Towards the island.\n               Pulling Trillian. The remains of the SAIPAN and the FUJI MARU\n               SMOLDER and SINK. BUBBLES EXPLODE to the surface.\n               A couple dozen small FIRES dot the waves. WATER SIZZLES and\n               STEAMS. SMOKE drifts into the night sky. Debris coats the\n               water.\n\n                                                    SLOW DISSOLVE TO:\n\n       155     BEACH - SUNRISE                                        155\n\n               Finnegan and Trillian crawl out of the water and up onto the\n               beach of the island. \n\n               They collapse next to each other. Finnegan is exhausted.\n               Trillian coughs up seawater. They both turn and look out to\n               sea, and the rising sun. Trillian reaches into her bra, and\n               pulls out the egg sized diamond. She holds it up. The sun\n               refracts off it brilliantly... \n\n               Trillian looks at the diamond, looks around at the picture\n               perfect island, the picture perfect sunset...and then she\n               heaves it as far as she can into the sea. For the first time\n               since they know each other there is nobody around. No people.\n               No tentacles. And when they look at each other, something\n               else comes to mind besides survival. \n\n               Finnegan moves towards Trillian. Trillian moves towards\n               Finnegan. Their lips move closer, closer... \n\n               And then, down by their feet -- SOMETHING EXPLODES OUT OF THE\n               WATER! Scares the shit out of them. The audience too.\n\n               But it's just Pantucci. Looking waterlogged and shell-\n               shocked. Coughing up half the sea. Finnegan and Trillian help\n               him to his feet.\n\n                                   PANTUCCI\n                         Was it the water in my eyes or were\n                         you guys about to...\n\n                                   FINNEGAN\n                         Joey...\n\n                                   PANTUCCI\n                         Because it's cool, you know, I can\n                         always take a walk or something\n                         down the beach...\n\n                                   FINNEGAN\n                         Joey...\n\n                                   PANTUCCI\n                         Or I could go for a\n                         swim...although, I gotta tell\n                         you...if I never get in the water\n                         again...\n\n                                   BOTH\n                         Joey!!\n\n                                   PANTUCCI\n                         OK...OK...you don't have to beg me\n                         ...I'll stick around...\n\n               And then they head the most gut-wrenching, spine-tingling,\n               teeth- shattering ROAR ever. Pure primeval. Like no sound or\n               animal or thing we've ever hear beofre. Coming from DEEP\n               WITHIN THE ISLAND.\n\n                                   PANTUCCI (CONT'D)\n                         Or maybe not...\n\n               Finnegan, Trillian, and Pantucci slowly turn and look INLAND.\n               We BEGIN TO PULL BACK as they all stand up. MORE STRANGE\n               NOISES ARE HEARD. FROM MULTIPLE UNKNOWN SPECIES. \n\n               WE KEEP PULLING BACK. REVEALING more of this creepy-looking\n               island. And leaving our three heroes stranded on the beach. \n\n               WE KEEP PULLING BACK. REVEALING pieces of the smoldering\n               ship. Nearly the whole island is VISIBLE now. Dark jungles.\n               Craggy mountains. Maybe the scariest-looking place on earth.\n\n                                   FINNEGAN (V.O.)\n                         What now...\n\n               The \"THING\" ROARS again. It's hellacious. \n\n               AND WE CUT TO BLACK.\n\n                                         THE END\n\n\n\n\n\n\nDeep Rising\nWriters :   Steven Sommers  Robert Mark Kamen\nGenres :   Action  Horror  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:23:50.026833"}