{"title": "Detroit Rock City", "film_link": "/Movie Scripts/Detroit Rock City Script.html", "script_link": "/scripts/Detroit-Rock-City.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Detroit Rock City Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Detroit-Rock-City.jpg\" title=\"Detroit Rock City Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Carl V Dupre\" title=\"Scripts by Carl V Dupre\">Carl V Dupre</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Musical\" title=\"Musical Scripts\">Musical</a><br/><br/>\n<b>Movie Release Date</b> : August 1999<br/>\n<br/>\n<a href=\"/scripts/Detroit-Rock-City.html\">Read \"Detroit Rock City\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\n<b>                                    DETROIT ROCK CITY\n</b>\n\n\n                                        Written by\n\n                                       Carl V Dupre\n\n\n\n<b>                \n</b>\n<b>               FADE IN:\n</b>\n<b>               INT. MRS. BRUCE'S LIVING ROOM - NIGHT\n</b>\n               Decorated in Carol Brady chic. When it's not gaudy, tacky, \n               and loud, it's blander than toast. Colors like lime green \n               and sunshine orange should be reserved for popsicles only.\n\n               MRS. BRUCE, late 30's, enters looking exhausted. She carries \n               a glass of wine in one hand and a book in the other, Erma \n               Bombeck's The Grass Is Always Greener Over The Septic Tank.\n\n               HUMMING \"We've Only Just Begun,\" Mrs. Bruce crouches next to \n               her wildly-ancient entertainment center complete with 8-track.  \n               She flips the first record forward on her Ronco Record Mate. \n               Album after album flaps forward. Olivia Newton-John, Neil \n               Diamond, the Osmond Brothers. She stops on the Carpenters \n               and sighs at the serene cover art. Just what the doctor \n               ordered.\n\n               Placing the vinyl on the turntable, she CLICKS the dustcover \n               closed and FLICKS \"Play.\" Reclining in her Lazyboy, she sips \n               her wine, opens the book and awaits the mellow tones of Karen \n               Carpenter.\n\n               Suddenly, her eardrums are hammered by machine gun GUITAR.  \n               Caustic ROCK 'N' ROLL assaults her senses. She jumps, spilling \n               her wine all over herself. This isn't the Carpenters...\n\n<b>               IT'S KISS!\n</b>\n               Racing to the entertainment center, she turns the volume \n               control knob so violently, it comes off in her hand. The \n               music is even louder now.\n\n               Flustered by the awful noise, she tries lifting the dustcover.  \n               It's stuck. She screams and covers her ears. This is Hell. \n               Running to the rear of the huge console, she stretches to \n               reach the plug, but can't. Fingertips millimeters away.\n\n               As the cacophony POUNDS she shakes the entire stereo with \n               all her frantic might.\n\n               SCREEEEEECH! The needle scrapes across the vinyl with a \n               shrill, finally coming to a stop. Whew, silence!\n\n               Then, POP, the dustcover opens unceremoniously. Shaken, she \n               grabs the record with trembling hands and reads the label...\n\n<b>                                KISS - LOVE GUN, SIDE TWO\n</b>\n               Mrs. Bruce's blood boils.\n\n<b>                                     MRS. BRUCE\n</b>                         KISS! The devil's music!\n\n<b>               EXT. LEX'S HOUSE - NIGHT\n</b>\n               A small, two-story house amid a suburban neighborhood of \n               other two-story houses. Uninspired architecture. Spindly \n               trees. \n\n               Two-car garage.\n\n               A faint yellow glow emanates from a cellar window across \n               which shadows frantically dart. Over the CRICKETS, we hear \n<b>               MUFFLED, BADLY-RENDERED ROCK 'N' ROLL. SCRATCHY, GUTTURAL, \n</b>               inhuman.\n\n               CAMERA MOVES to the cellar window. Inside we see four TEENAGE \n               BOYS who are to blame for the racket. Band practice.\n\n<b>               INT. LEX'S BASEMENT/BEDROOM - NIGHT\n</b>\n               An inner-sanctum of KISS devotion. Faux-wood paneling is \n               plastered with countless KISS posters, pictures, fold-outs.  \n               The ceiling is wallpapered with more KISS posters. KISS dolls, \n               magazines, records, comic books clutter the shag-carpeted \n               floor. Fast food wrappers heap over the KISS garbage pail.\n\n               The four high schoolers rock their hearts out as they blast \n               a familiar tune offensively off-key.\n\n<b>                                     BOYS SINGING\n</b>                         \"I wanna rock 'n' roll all night and \n                         party every day!\"\n\n               They stink, but they sure are trying hard. Meet the band \n               \"Mystery.\" Concert tee-shirts, holey jeans, total burn-outs.\n\n               HAWK, a scraggily-haired, disenchanted youth, strains his \n               vocal chords on the microphone as he SCRATCHES at his rhythm \n               guitar. Hawk is sort of the brains of this operation, but \n               knowing the others, that doesn't say much.\n\n               LEX POUNDS a bass with earnest determination. Lanky with bad \n               posture, Lex is already sporting worry lines. He takes \n               everything way-too-seriously.\n\n               TRIP STRUMS lead guitar like he's hammering nails. All id, \n               Trip is slightly out of his mind. But, is it the chemicals \n               or just his chemistry. He always wears a knit cap.\n\n               JAM, a sensitive kid (but no wuss), BASHES on his drums like \n               a madman making the bass drum pulsate like a spastic heart. \n               The big drum bears the word \"Mystery\" painted on its skin \n               with a lightning \"S\" just like the KISS logo.\n\n               They bring the classic tune to a shrieking conclusion and \n               thrust their hands over their heads in the KISS symbol.  \n               Hawk screams into the mike at their imaginary audience.\n\n<b>                                     HAWK\n</b>                         Thank you, Cleveland! You're a great \n                         crowd. But after three and a half \n                         hours of kick-ass rock and seven \n                         encores on top of that, I'm sorry to \n                         say that this time we really gotta \n                         get back to our hotel rooms and fuck \n                         some groupies.\n\n               Behind him, Trip grabs Lex's bass and swings it by the neck \n               at an amp pretending to bash it over and over again. Lex \n               quickly yanks it away from him.\n\n<b>                                     LEX\n</b>                         What the fuck, Trip? That's my bass!\n\n               Jam emerges from behind the pile of drums smiling.\n\n<b>                                     JAM\n</b>                         That was curly!\n\n<b>                                     TRIP\n</b>                         Just one more day of school to get \n                         through, girls, before tomorrow \n                         night... Live!\n                              (getting excited)\n                         COBO Hall! Detroit, Michigan!\n                              (like an announcer)\n                         You wanted the best!\n\n<b>                                     ALL FOUR BOYS\n</b>                         You got the best! The hottest band \n                         in the world... KISS!!\n\n               They all make that BREATH SOUND that mimics a screaming crowd.  \n               Suddenly, headlights swing by in the window above them like \n               a spotlight. Lex hops onto the unmade bed and looks out the \n               cellar window.\n\n<b>               LEX'S POV\n</b>\n               A baby-shit green, Ford station wagon with fake wood sides \n               SCREECHES into the driveway. Mrs. Bruce gets out and STOMPS \n               toward the house. Lex gasps at the sight.\n\n<b>                                     LEX\n</b>                         Shit! It's Jam's mom!\n\n               Jam GULPS as if he's just shat out an whole can of Lincoln \n               logs.\n\n<b>                                     JAM\n</b>                         My mom? Oh, no! What's she doing \n                         here?\n\n               Lex quickly throws a KISS towel over a TV tray hiding a bong, \n               cigarettes, overloaded ashtray. Trip kicks half-empty beer \n               bottles under the bed. Hawk sprays Lysol frantically around \n               the room as Jam shovels gum into his mouth.\n\n               KNOCK, KNOCK, KNOCK! Mrs. Bruce pounds on the cellar window \n               crouching to see in. She looks like a crazed, underlit psycho.\n\n<b>                                     MRS. BRUCE\n</b>                              (muffled through glass)\n                         Jeremiah! Jeremiah Bruce! You get \n                         out here this instant!\n\n               The boys looks up like innocent, wide-eyed angels. Jam waves.\n\n<b>                                     JAM\n</b>                         Oh, hi, mom.\n\n<b>                                     MRS. BRUCE\n</b>                              (screams)\n<b>                         NOW!\n</b>\n               Jam quickly pockets his drumsticks and grabs his worn, denim \n               jacket off the pile of jackets on the floor, then runs \n               upstairs. The others follow.\n\n<b>               EXT. LEX'S HOUSE/FRONT PORCH - NIGHT\n</b>\n               The front door opens. Jam steps out to greet his mom with a \n               nervous smile. Hawk, Lex, and Trip stand at a safe distance \n               in the foyer behind him.\n\n<b>                                     JAM\n</b>                         What's up?\n\n               Mrs. Bruce grabs her son by the ear and holds up the KISS \n               LOVE GUN record waving it in his face.\n\n<b>                                     MRS. BRUCE\n</b>                         The devil's body count, that's what's \n                         up! Don't you know what KISS stands \n                         for? \"Knights in Satan's Service!\"\n\n               She hauls Jam across the lawn. Hawk, Lex, and Trip step onto \n               the porch looking on in sympathetic embarrassment. Mrs. Bruce \n               stuffs the record in the trash can then throws Jam in the \n               front seat. SCREECH, the station wagon pulls away.\n\n<b>                                     TRIP\n</b>                         Jam has yet to do an overnight with \n                         us.\n\n<b>                                     LEX\n</b>                         I had a nightmare once that something \n                         like this might happen. I hope he \n                         doesn't get grounded again. If he \n                         misses Peter Criss's drum solo, I \n                         don't know if he'll be able to handle \n                         it.\n\n<b>                                     HAWK\n</b>                         Lex, quit trying to always jinx \n                         things. Don't worry, dudes. Nobody's \n                         missing that concert tomorrow night.\n\n<b>               MAIN TITLES\n</b>\n<b>               CLOSE-UP\n</b>\n               The LOVE GUN album sitting in the trash can. CAMERA MOVES IN \n               on the round label till it FILLS THE FRAME. The record begins \n               to spin like on a turntable as CAMERA DESCENDS INTO the little \n               hole ENGULFING THE FRAME IN BLACK. This LEADS us INTO...\n\n<b>               OPENING TITLE SEQUENCE\n</b>\n               \"ROCK 'N' ROLL ALL NITE\" BLASTS the way it's supposed to \n               sound. The jammin' KISS classic is accompanied by a barrage \n               of QUICK CUTS depicting KISS mania. TV appearances. Concert \n               footage. Magazine covers. Comic Books. Posters. Art work. \n               KISS merchandise, dolls, lunch boxes, clothes, etc.\n\n               We see the BAND do their thing in authentic CLIPS FROM REAL \n<b>               SHOWS. GENE, PAUL, ACE, AND PETER SHOUTING IT OUT LOUD.\n</b>\n               The MONTAGE is a colorful, kick-ass kaleidoscope of the entire \n               KISS phenomena. CUT TO the BEAT of this seminal anthem.\n\n               The FINAL IMAGE is the KISS \"DESTROYER\" POSTER.\n\n<b>               END CREDITS\n</b>\n<b>                                       TICKET CHECK\n</b>\n<b>               INT. JAM'S BEDROOM - DAY\n</b>\n               The sun's early morning rays beam through the KISS \"Destroyer\" \n               poster taped onto a window shade. The phone RINGS. Jam bolts \n               upright, his profile blocking the poster. He has just awakened \n               under the only other decoration in his room: a crucifix.\n\n               Still dressed in last night's clothes, a plain black tee-\n               shirt and blue jeans, Jam leaps out of bed unwittingly \n               planting a foot in the handle of a Bullworker (a piece of \n               exercise equipment comprised of a powerful spring with two \n               handles on either end) whose other handle is stuck under one \n               of the bed's legs.\n\n               Jam runs to a phone on his dresser, drawing the Bullworker's \n               powerful springs out to maximum tension. No sooner does he \n               pick up, when he is yanked to the floor and dragged across \n               it as if tied to the bumper of a speeding car. Despite the \n               Bullworker pulling him back toward his bed, Jam does manage \n               to get the phone to his ear.\n\n<b>                                     JAM\n</b>                         Hello?\n\n               The phone's cord stretches taut causing its cradle to leap \n               from the dresser and WHACK Jam on the head.\n\n<b>               INT. LEX'S BASEMENT/BEDROOM - DAY\n</b>\n               Hawk is on the phone as Lex and Trip scour every inch of the \n               cluttered room on their hands and knees searching frantically \n               for something.\n\n<b>                                     HAWK\n</b>                         Jam, listen up.\n\n<b>                                     JAM (O.S.)\n</b>                         Hawk?\n\n<b>                                     HAWK\n</b>                         Just listen up, man, cause we are in \n                         a quandary.\n\n<b>               INT. JAM'S BEDROOM - DAY\n</b>\n               Jam clutches the phone with his shoulder GRUNTING as he does \n               battle with the Bullworker for possession of his foot.\n\n<b>                                     HAWK (O.S.)\n</b>                         Are you on the crapper with one of \n                         those antenna phones? Sounds like \n                         you're taking a dump the size of \n                         Butte, Montana.\n\n<b>                                     JAM\n</b>                         It's my Bullworker.\n\n<b>                                     HAWK (O.S.)\n</b>                         Anyway, listen up. They're gone!\n\n<b>                                     JAM\n</b>                         What's gone?\n\n<b>                                     HAWK (O.S.)\n</b>                         The KISS tickets, you nimrod! They're \n                         just fuckin' gone! Please tell me \n                         you have'm!\n\n<b>                                     JAM\n</b>                              (panicked)\n                         Gone!? Why would I have the KISS \n                         tick...?\n\n<b>                                     HAWK (O.S.)\n</b>                         Just check whatever you were wearing \n                         last night. Now!\n\n               Jam briefly scans his surroundings double-taking at the denim \n               jacket lying on the floor. He checks the pockets and sees \n               four tickets labelled KISS - JUNE 7, 1978 - COBO HALL, \n<b>               DETROIT.\n</b>\n<b>                                     JAM\n</b>                         Whew! Oh, God, Hawk... I got'm!  \n                         Somehow I musta taken Trip's jacket \n                         by mistake!\n\n<b>               INT. LEX'S BASEMENT/BEDROOM - DAY\n</b>\n               Hawk SIGHS like a deathrow convict pardoned at the last \n               second.\n\n<b>                                     HAWK\n</b>                              (to others)\n                         He's got'm!\n\n               Lex and Trip collapse with relief.\n\n<b>                                     HAWK\n</b>                         Trip, he took your jacket by mistake.  \n                         You must be wearing Jam's.\n\n               Trip reaches in a breast pocket and pulls out Rosary beads.  \n               Spooked, he drops them like they were a bug.\n\n<b>                                     HAWK\n</b>                              (into phone)\n                         Cool.\n\n<b>                                     JAM (O.S.)\n</b>                         I'm really sorry about that, man.\n\n<b>                                     HAWK\n</b>                         Don't be a fembot. So, are you like \n                         grounded because of last night, or \n                         what?\n\n<b>               INT. JAM'S ROOM - DAY\n</b>\n<b>                                     JAM\n</b>                         Of course, but has that ever stopped \n                         me before? Besides, my mom's going \n                         to some church meeting and won't be \n                         back till late. No sweat... See you \n                         guys in school.\n\n               CLICK. DIAL TONE. Jam hangs up.\n\n<b>               INT. LEX'S BASEMENT/BEDROOM - DAY\n</b>\n               Lex buckles his belt with its huge KISS belt buckle.\n\n<b>                                     LEX\n</b>                         Poor, Jam, man. Imagine having to \n                         stash your KISS records inside Carly \n                         Simon album covers. No question, \n                         Mrs. Bruce is a psycho-bitch from \n                         hell.\n\n<b>                                     TRIP\n</b>                         You're one to talk, Lex. Your mom's \n                         a fuckin' dyke.\n\n               Trip pockets his wallet which is affixed to a long chain \n               attached to a side belt loop.\n\n<b>                                     LEX\n</b>                         Trip, a female gynecologist does not \n                         a lesbian make. And even if it did, \n                         at least my mom didn't give birth to \n                         me while she was on LSD.\n\n<b>                                     TRIP\n</b>                         Shrooms! And even if it was LSD, I \n                         can still give my mom a kiss without \n                         smelling the catch of the day.\n\n<b>                                     HAWK\n</b>                         Both you assholes, SHADDAP!\n\n               Lex and Trip shaddap.\n\n<b>                                     HAWK\n</b>                         Enough of the mom-bashing, all right?  \n                         Lex's mom is cool about us crashing \n                         over here while she's out of town. \n                         And if it weren't for Trip's mom, we \n                         wouldn'ta smoked that fine Panama \n                         Red last night. So leave the women \n                         who gave you life out of it. They're \n                         both cool.\n\n               Trip and Lex cease and desist the mom-bashing and continue \n               getting ready for school. Suddenly, Lex pushes Trip angrily.\n\n<b>                                     LEX\n</b>                         Trip, you fuckin' asshole.\n\n<b>                                     TRIP\n</b>                         What?\n\n               Lex points to a wet mess on the pillow.\n\n<b>                                     LEX\n</b>                         You spilled my Sea Monkeys all over \n                         the bed.\n\n<b>                                       DRESSING UP\n</b>\n<b>               INT. JAM'S BEDROOM - DAY\n</b>\n               Jam gives the Bullworker one final yank. This time it comes \n               loose... not from his foot, but from under the bed. Its handle \n               lashes up SLAPPING him across the face. Ouch.\n\n               Fully awake now, Jam throws on Trip's denim jacket. He stuffs \n               a drumstick into his left sock. We see \"Mystery\" written on \n               it. Just as he's about to stick the other one in his right \n               sock...\n\n               Without a second of warning, or even a knock, Mrs. Bruce \n               suddenly ENTERS. Immediately Jam stands.\n\n<b>                                     MRS. BRUCE\n</b>                         Jeremiah, what are you doing?\n\n<b>                                     JAM\n</b>                         Uhh... nothing.\n\n               She turns to his closet, the door blocking her view of the \n               KISS poster. Jam leaps to the window and yanks the \"Destroyer\" \n               shade. It shoots up, FLAPPING around its rod. He's done this \n               before.\n\n               Mrs. Bruce peeks at Jam from around his closet door. He \n               stretches in front of the window.\n\n<b>                                     JAM\n</b>                         Ahh, sunshine.\n\n<b>                                     MRS. BRUCE\n</b>                         You're going to be late if you don't \n                         hurry up and change soon.\n\n<b>                                     JAM\n</b>                         Change? What's wrong with what I got \n                         on?\n\n<b>                                     MRS. BRUCE\n</b>                         It's dirty laundry for one thing and \n                         for another, you still haven't worn \n                         the clothes I bought you. You're \n                         skating on thin ice already, young \n                         man, so I wouldn't push my luck. Now \n                         get out of those rags.\n\n<b>                                     JAM\n</b>                         But, mom!\n\n<b>                                     MRS. BRUCE\n</b>                         Besides, those jeans are so tight I \n                         can see your penis.\n\n               Jam reluctantly takes off the denim jacket as Mrs. Bruce \n               grabs the single drumstick from his hand and shakes it at \n               him.\n\n<b>                                     MRS. BRUCE\n</b>                         Someday you'll see the futility in \n                         forging a musical career with those \n                         idiots.\n\n               She turns and rummages through the closet.\n\n<b>                                     JAM\n</b>                              (to himself)\n                         They're not idiots.\n\n<b>                                     MRS. BRUCE\n</b>                         Now don't forget you're on the honor \n                         system tonight. I'll be home a little \n                         after one and if you've been partying \n                         or playing that satanic KISS music... \n                         well, need I remind you of the \n                         consequences?\n\n<b>                                     JAM\n</b>                         Grounded for the rest of the year?\n\n<b>                                     MRS. BRUCE\n</b>                         You're a smart boy, Jeremiah. And so \n                         handsome.\n\n               She pulls two Sears department store boxes from the closet \n               and lays them on the bed. Jam is visibly horrified.\n\n<b>                          THIS IS YOUR MOTHER! / THE GIRL'S ROOM\n</b>\n<b>               EXT. ROBERT F. KENNEDY HIGH - DAY\n</b>\n               The suburban high school is teeming with morning activity. \n               School buses pull up to the curb. KIDS arrive in droves and \n               immediately find their cliques. The JOCKS and PRIMADONNAS \n               make up the popular crowd. There's DISCO DUDES, FRESHMEN who \n               look like grade schoolers, and GEEKS.\n\n               At the smoking section hang the BURNOUTS. Hawk, Trip, and \n               Lex stand amid the other long-hairs.\n\n<b>                                     TRIP\n</b>                         School. What a fuckin' waste of time.\n\n               Two GIRLS with tons of make-up, hair so feathered it could \n               fly, and tight clothes, saunter by SNAPPING gum.\n\n<b>                                     HAWK\n</b>                         Will somebody please tell those chicks \n                         disco is dead.\n\n<b>                                     LEX\n</b>                         Stellas. I hate stellas almost as \n                         much as I hate dogs.\n\n<b>                                     TRIP\n</b>                         Same species when you think about \n                         it.\n\n               Their words say one thing, but their eyes say another. They \n               can't stop gawking at the chicks' asses. Girl #1 sneers back.\n\n<b>                                     GIRL #1\n</b>                         Don't stare too long, you'll go blind.\n\n               The boys quickly cover.\n\n<b>                                     LEX\n</b>                              (defensive)\n                         Yeah, right. She wishes. Look at \n                         that big ass.\n\n<b>                                     TRIP\n</b>                         You know what they say about a big \n                         ass... big shit.\n\n               They chuckle. Just then, Jam steps off a school bus in an \n               unbelievably geeky outfit, white corduroy slacks, plaid shirt \n               buttoned to the top, argyle socks and brown deck shoes.\n\n<b>                                     TRIP\n</b>                         Hey, that dork looks just like Jam.\n\n               Hawk and Lex look and laugh when they see him.\n\n<b>                                     LEX\n</b>                         Shit, that dork is Jam.\n\n<b>                                     HAWK\n</b>                              (to Jam)\n<b>                         YO, DOOFUS!\n</b>\n               Jam gives them the finger.\n\n<b>               INT. SCHOOL LOCKER AREA - DAY\n</b>\n               Hawk, Trip, Lex, and Jam grab books from their lockers.  \n               KISS stickers, photos, and rock magazine cut-outs line the \n               insides. Jam's locker door is covered with Peter Criss only.\n\n<b>                                     TRIP\n</b>                         So, Jam, who did your wardrobe, Tad \n                         the preppie sailboat captain?\n\n<b>                                     JAM\n</b>                         Hey, my mom had me over a barrel, \n                         all right. After last night, I had \n                         to let her dress me today. It's a \n                         give and take relationship.\n\n<b>                                     LEX\n</b>                         Yeah, she gives you shit and you \n                         take it.\n\n<b>                                     HAWK\n</b>                         Okay, enough. Enough. Gimme the \n                         tickets. I wanna hold onto them.\n\n<b>                                     JAM\n</b>                         They're still at my house in Trip's \n                         jacket.\n\n<b>                                     HAWK\n</b>                         They're what?\n\n<b>                                     JAM\n</b>                         She was standing right over me when \n                         I was changing for fuck's sake.\n\n<b>                                     TRIP\n</b>                         That's some sick shit right there.  \n                         Did she comb your ass hair for you \n                         too?\n\n<b>                                     LEX\n</b>                         If your mom so much as smells those \n                         tickets, they're history, and we get \n                         screwed outta seeing KISS for the \n                         third year in a row, the third year!\n\n<b>                                     JAM\n</b>                         Don't worry about it. They're \n                         perfectly safe. We can pick them up \n                         after school. My mom won't be home. \n                         It's no problem.\n\n<b>                                     HAWK\n</b>                         All right. After school we double-\n                         time it to your house for the tix \n                         before heading to the train station \n                         for the 2:45 to Detroit Rock City.\n\n<b>                                     JAM\n</b>                         Check.\n\n               The BELL RINGS.\n\n<b>                                     HAWK\n</b>                         As they say in the Tampon biz, see \n                         you next period.\n\n               SLAM! They shut their lockers in unison.\n\n<b>               INT. STUDY HALL - DAY\n</b>\n               The STUDY HALL TEACHER grades papers. On the wall a picture \n               of President Carter hangs next to Old Glory. The words \"Be \n               Quiet\" are written on the blackboard.\n\n               Students study, read, doodle, sleep. Jam is at his desk \n               touching up the word \"Mystery\" on his drumstick. Next to him \n               sits BETH. Quirky, but cute, she stares longingly at him \n               wanting to say something, but not having the guts.\n\n               Pleased with his work, Jam puts the drumsticks on the desk \n               and opens a Peter Criss album cover notebook depicting \n               countless doodles of the KISS logo, the Mystery logo, and \n               renderings of Peter Criss.\n\n               Beth SIGHS and opens her own notebook. Drawings of hearts \n               fill the pages. In them is written \"Beth + Jeremiah\" and \"I \n               love Jeremiah.\"\n\n               Then, one of Jam's drumsticks rolls off the desk and onto \n               the floor. Beth quickly reaches down to grab it for him just \n               as he bends to get it too. THUD, they bash heads.\n\n<b>                                     JAM\n</b>                         Oof!\n                              (whispering)\n                         Sorry.\n\n               Rubbing her head, she smiles and hands him the drumstick.\n\n<b>                                     BETH\n</b>                         No problem.\n\n<b>                                     JAM\n</b>                         Thanks.\n\n               He stuffs his drumsticks in his socks pulling his pantlegs \n               down. Jam and Beth stare at each other. There's a mutual \n               crush, but both are apprehensive about making the first move. \n               Both want to speak, neither does. They awkwardly go back to \n               their notebooks.\n\n               Mustering the nerve, Jam breaks the ice and whispers...\n\n<b>                                     JAM\n</b>                         Beth?\n\n               Beth spins too quickly. Her pen flies out of her hand.\n\n<b>                                     BETH\n</b>                         Yes?\n\n               BOINK! The pen hits Jam in the eye.\n\n<b>                                     JAM\n</b>                         Ow!\n\n               Feeling awful, Beth moves in to help. The teacher looks up \n               sternly.\n\n<b>                                     STUDY HALL TEACHER\n</b>                         Mr. Bruce, Miss Bumsteen, is there a \n                         problem?\n\n<b>                                     BETH\n</b>                         No. No problem.\n\n               Jam points to his eye.\n\n<b>                                     JAM\n</b>                         Just a little pink eye. No reason to \n                         panic.\n\n               Unamused, the teacher goes back to grading.\n\n<b>                                     BETH\n</b>                              (whispering)\n                         Sorry.\n\n<b>                                     JAM\n</b>                              (handing back pen)\n                         It's okay.\n\n               Beth resumes doodling feeling like an idiot. Jam does too. \n               Ah, teenage awkwardness. Finally, Beth musters up some \n               courage.\n\n<b>                                     BETH\n</b>                         Jeremiah?\n\n<b>                                     JAM\n</b>                         Yeah?\n\n               She hems and haw, then...\n\n<b>                                     BETH\n</b>                         I wanted to tell you something... \n<b>                         I...\n</b>\n               Suddenly, Beth is rudely interrupted by HIGH-PITCHED FEEDBACK \n               coming from the P.A. The PRINCIPAL'S VOICE ECHOES over it.\n\n<b>                                     PRINCIPAL'S VOICE\n</b>                         Jeremiah Bruce, come to the office \n                         immediately...\n\n               Jam throws a startled glance to the speaker as the class \n               sings in unison.\n\n<b>                                     WHOLE CLASS\n</b>                         Oooo, you're in troubaaaallll.\n\n<b>                                     PRINCIPAL'S VOICE\n</b>                         Your mother's here and would like to \n                         see you right away...\n\n               More FEEDBACK as the mike on the other end changes hands.\n\n<b>                                     MRS. BRUCE'S VOICE\n</b>                         Give me that microphone... Jeremiah, \n                         you get your sorry self down to this \n                         office, mister!\n\n               All the kids except for Beth burst into hysterical laughter.\n\n               Mrs. Bruce's tirade continues over QUICK SHOTS of...\n\n<b>               INT. HAWK'S SCIENCE CLASS - DAY\n</b>\n               Hawk sits at his lab table burning an eraser with his Bunsen \n               burner. His eyes widen with horror behind his goggles as the \n               other STUDENTS laugh till they hurt.\n\n<b>                                     MRS. BRUCE'S VOICE\n</b>                         I found some things in the pockets \n                         of your jacket while I was picking \n                         up your disgusting laundry today...\n\n<b>               INT. LEX'S GYM CLASS - DAY\n</b>\n               Lex's eyes bug with terror. The basketball game is at a \n               standstill as everyone is crippled with laughter.\n\n<b>                                     MRS. BRUCE'S VOICE\n</b>                         Cigarettes! Marijuana! Prophylactics!\n\n<b>               INT. TRIP'S HEALTH CLASS - DAY\n</b>\n               Trip dozes at his desk as an out-of-date film about VD \n               sputters on. The room is deafening with laughter. Then, as \n               if hit by a ton of bricks, Trip wakes up alarmed by the \n               familiar, shrilly voice.\n\n<b>                                     MRS. BRUCE'S VOICE\n</b>                         And something much, much worse!\n\n<b>                                     TRIP\n</b>                         Holy shit, my jacket!\n\n<b>               4-WAY SPLIT SCREEN\n</b>\n               We see Jam, Hawk, Lex, and Trip agog in dread.\n\n<b>                                     MRS. BRUCE'S VOICE\n</b>                         If you know what's good for you, \n                         you'll get down here... NOW!\n\n<b>               INT. JAM'S STUDY HALL - DAY\n</b>\n               Jam slowly sinks in his chair under the profoundly humiliating \n               weight of an ENTIRE SCHOOL'S ECHOED LAUGHTER.\n\n<b>               INT. WAITING AREA - DAY\n</b>\n               Mrs. Bruce sits next to a stand-up ashtray in the high \n               school's waiting area. Scowling, she fans the KISS tickets \n               out with one hand. Jam sits across from her, one leg jittering \n               anxiously.\n\n               They sit for an uncomfortably long time until... Mrs. Bruce \n               pulls a cigarette and lighter out of her purse.\n\n<b>                                     MRS. BRUCE\n</b>                         I made an appointment with Father \n                         Phillip McNulty at St. Bernard's.  \n                         We're to see him directly where he \n                         will register you on the spot.\n\n<b>                                     JAM\n</b>                         You mean, you're sending me to... b-\n                         b-boarding school?\n\n<b>                                     MRS. BRUCE\n</b>                         What else can I do? Oh, records and \n                         magazines and comic books are one \n                         thing, but tickets? TICKETS? Jeremiah, \n                         do you realize what this means? That \n                         you're no longer content merely \n                         hearing their awful songs or looking \n                         at photos of their horrific faces! \n                         Now you want to see the devil in the \n                         flesh. You want to reach out and \n                         touch pure evil... and in Detroit no \n                         less!\n\n               She flicks the lighter, not yet lighting the cigarette.\n\n<b>                                     JAM\n</b>                         Mom, three of those tickets don't \n                         even belong to me. They're for the \n                         guys.\n\n               Mrs. Bruce holds the tickets over the lighter's flame.\n\n<b>                                     MRS. BRUCE\n</b>                         And if the \"guys\" have parents who \n                         truly love them, they will elevate \n                         me to sainthood for getting rid of \n                         these blasted things.\n\n               Mrs. Bruce lights her smoke with the flaming tickets, then \n               drops them in the ashtray where they burn for a cruel \n               eternity. Jam stares semi-catatonic through his mom's sour \n               expression.\n\n<b>                                     MRS. BRUCE\n</b>                         It's been a long time coming, son, \n                         but you're finally going to get the \n                         kind of discipline you deserve.\n\n               She stands and pulls him out the front entrance by his arm.\n\n<b>               REVERSE ANGLE ON NEARBY CORNER\n</b>\n               Hawk, Trip, and Lex peek around it, their heads forming a \n               totem pole. One-by-one they pull back.\n\n<b>               AROUND THE CORNER\n</b>\n               They slump against the wall devastated.\n\n<b>                                     LEX\n</b>                         I knew it! I knew this was gonna \n                         happen! I had a bad feeling since \n                         last night. Remember? We are so \n                         totally fucked!\n\n<b>                                     TRIP\n</b>                         Waitaminit, dudes! I got it! Maybe \n                         we can glue the tickets back together!\n\n<b>                                     HAWK\n</b>                         What are you, high?\n\n<b>                                     TRIP\n</b>                         Yeah.\n\n<b>                                     HAWK\n</b>                         For once Lex is right. It's over. \n                         Things can't get any worse from here.\n\n               Suddenly, a caustic voice BLURTS from down the hall.\n\n<b>                                     VOICE\n</b>                         I hope you rodents have hall passes!\n\n               The boys whip their heads around to see a potbellied, yellow-\n               toothed, security officer with long sideburns and slicked \n               back hair at the far end of the hall, fists on his hips.  \n               Meet ELVIS.\n\n<b>                                     LEX\n</b>                         Wanna bet.\n\n<b>                                     ELVIS\n</b>                         Could that be three detentions I \n                         smell?\n\n               Elvis laughs and breaks into a run barreling down on them \n               like a maniac. Keys JANGLING furiously.\n\n<b>                                     HAWK\n</b>                         Second floor girls' john! Two minutes! \n                         He'll never look there!\n\n<b>                                     LEX\n</b>                         Check!\n\n               They take off in three different directions. Still laughing, \n               Elvis stops where the boys just were. Which one to follow? \n               He bolts after Hawk who has taken the nearest staircase.\n\n<b>               INT./EXT. JAM'S STUDY HALL - DAY\n</b>\n               Beth looks sadly out the window watching Mrs. Bruce push Jam \n               in the car. Beth puts her hand on the pane wanting to touch \n               him.\n\n<b>               INT. STAIRWAY - DAY\n</b>\n               Meanwhile, Elvis HUFFS and PUFFS up a flight of stairs \n               arriving at a set of swinging doors. He goes to push one in, \n               but it swings out at him with a vengeance knocking him \n               backward.\n\n               From behind it pops Hawk wielding a fire extinguisher. BLAST! \n               A hail of foam covers Elvis's face. Hawk shoves the \n               extinguisher into the man's arms and pushes Elvis backwards \n               down the stairs. He topples ass-over-head till he hits the \n               landing.\n\n<b>                                     HAWK\n</b>                         You're way out of your league, Elvis.\n\n               Elvis rises and shakes the CO2 off like a wet dog. Looking \n               up, he sees the door gently swinging in and out. No sign of \n               Hawk.\n\n<b>               INT. GIRLS' BATHROOM - DAY\n</b>\n               Trip kicks a bathroom stall violently.\n\n<b>                                     TRIP\n</b>                         Fuck! Shit!\n\n               Lex sits on the toilet in the stall.\n\n<b>                                     LEX\n</b>                         Hey, take it easy, man. This is the \n                         girls' crapper, remember?\n\n<b>                                     TRIP\n</b>                         Wake up, Lex! We just watched Jam's \n                         mom torch our fuckin' KISS tickets! \n                         Not REO Speedwagon! Not Journey! Not \n                         the Bay City Rollers! KISS! If you \n                         can think of a better reason to trash \n                         a bathroom, I'd sure like to hear \n                         it!\n\n<b>                                     LEX\n</b>                         Trip, it's not the end of the world, \n                         okay? Quit acting all squeezed out.\n\n               Trip grabs Lex by the collar, yanks him off the toilet and \n               shoves him against the wall.\n\n<b>                                     TRIP\n</b>                         Oh, everything's hunky-dory now that \n                         the shit hit the fan just like you \n                         said it would, you snug sonofabitch! \n                         You fuckin' jinxed us!\n\n<b>                                     LEX\n</b>                         Smug, Trip! Not snug, smug.\n\n               Hawk bursts into the bathroom.\n\n<b>                                     HAWK\n</b>                         We're clear, dudes.\n\n               They run to exit. Hawk first. Suddenly, Hawk backs up again \n               into Trip and Lex as if a swarm of killer bees was out there.\n\n<b>                                     HAWK\n</b>                         A skirt just came around the corner.\n\n               Hawk, Trip, and Lex run back and pile into the last stall.  \n               All three stand on the toilet bracing their arms against the \n               walls for balance.\n\n               A FOXY GIRL hurries into the stall next to theirs. We see \n               the top halves of three heads peek over the stall's partition.  \n               The three boys don't make a sound as they watch her sit down.\n\n               As she glances up, they recoil fast. They whisper super-quiet.\n\n<b>                                     HAWK\n</b>                         That's Sherry VanHafton.\n\n<b>                                     LEX\n</b>                         I've been in love with her since the \n                         second grade.\n\n               Then, a SOUND OF TINKLING. They all throw their hands over \n               their mouths to stifle the giggles. Suddenly, POOT! She lets \n               out an ECHOED FART. The boys are awestruck.\n\n<b>                                     HAWK\n</b>                         Whoa... she just farted.\n\n<b>                                     LEX\n</b>                         I have never heard a girl squeeze \n                         cheese in my entire life.\n\n<b>                                     HAWK\n</b>                         Weird...\n\n               Pause.\n\n<b>                                     TRIP\n</b>                         Peeeyeewww! That stinks!\n\n               Just then, the SOUND OF CRACKING PORCELAIN, as the toilet \n               they're standing on breaks into pieces with a SMASH. They \n               topple over pulling the stall walls down with them exposing \n               the foxy chick sitting on the can. Water GUSHES everywhere \n               as she screams bloody murder, getting doused ruining her \n               Farrah-do.\n\n               They bolt out the door slipping and sliding across the torrent \n               of toilet water. Lex turns and shrugs to the traumatized \n               girl.\n\n<b>                                     LEX\n</b>                         Heh-heh, sorry.\n\n               He's gone.\n\n<b>                                CALLER 106 / ELVIS ATTACKS\n</b>\n<b>               INT. MRS. BRUCE'S CAR - DAY\n</b>\n               Mrs. Bruce uses a finished cigarette to light another.\n\n<b>                                     MRS. BRUCE\n</b>                         Someday you'll have a son just like \n                         you, Jeremiah. A boy who lies through \n                         his teeth, buys demonic records, and \n                         smokes the dope just like you.\n\n<b>                                     JAM\n</b>                              (numbly)\n                         If I'm anything like you, I'll deserve \n                         him.\n\n<b>                                     MRS. BRUCE\n</b>                         What?!\n\n<b>                                     JAM\n</b>                         I said, I'm sorry!\n\n<b>                                     MRS. BRUCE\n</b>                         If you truly are sorry, son, then \n                         you better pray like you've never \n                         prayed before. God willed me to find \n                         those tickets because He wanted to \n                         hear from you.  He knows you need \n                         help and He wants you to ask Him for \n                         it.\n\n<b>               EXT. ST. BERNARD'S - DAY\n</b>\n               Mrs. Bruce's car turns off the road and drives through an \n               imposing set of wrought iron gates. The sign reads: St. \n               Bernard's Veil of Tears. A School for Catholic Boys.\n\n<b>               INT. MRS. BRUCE'S CAR - DAY\n</b>\n               Jam looks at what lies ahead. His face becomes a mask of \n               pure terror. We hear a THUNDER CLAP as Jam puts his hands \n               together and closes his eyes humbling himself. He whispers.\n\n<b>                                     JAM\n</b>                         Please, God, help.\n\n<b>               EXT. ST. BERNARD'S - DAY\n</b>\n               The car winds up the path leading to a dark, Gothic edifice \n               over which tumultuous storm clouds continuously hover. THUNDER \n               BELCHES and bolts of lightning shoot at the blackened \n               crucifixes along the structure. We hear a SCARY ORGAN theme.\n\n<b>               INT. VOC/TECH DEPT. - DAY\n</b>\n               Except for the tinkering NOISES that are heard as the STUDENTS \n               work on their projects, there is silence in Electronics Class.\n\n               The teacher, MR. JOHANSEN, sips from a coffee cup and reads \n               a newspaper, his feet on the desk. The headline says: \"Mass \n               Suicide in Jonestown. Cyanide in the Kool-Aid.\" Above him is \n               a long banner reading: \"Sorry, Absolutely no bathroom breaks\".\n\n               Hawk, Trip, and Lex sit before a half-built radio on a work \n               bench, sheer desperation etched on their faces.\n\n               Lex solders two copper wires together. Hawk attaches a dial. \n               Trip absently plays with a squeeze pump attached to a long \n               plastic tube. He blows air into his face repeatedly with it.\n\n<b>                                     TRIP\n</b>                              (re:squeeze pump/tube)\n                         Wonder if you could smoke shit out \n                         of this?\n\n<b>                                     HAWK\n</b>                         Maybe some tunage'll chase those \n                         blues away.\n\n               Hawk turns the radio on and a HIGH FREQUENCY WHINE pours \n               from its speaker. He adjusts the volume, then the tuner, \n               until a DJ's VOICE comes through crisp and clear.\n\n<b>                                     DJ'S VOICE\n</b>                         ...and this is Simple Simon on the \n                         rock of Detroit, W.A.R.P., home of \n                         the biggest KISS giveaway in the \n                         history of the universe!\n\n               Detroit? DETROIT? Hawk, Trip, and Lex react like they've \n               just been hit by phasers on stun. God is intervening.\n\n<b>                                     DJ'S VOICE\n</b>                         I got four, count 'em, four front \n                         row tickets along with four backstage \n                         passes to the concert tonight at \n                         Cobo Hall and I'm giving them to the \n                         106th caller who can tell me the \n                         real names of each KISS band member!\n\n               HIGH FREQUENCY NOISES again, then the radio loses reception.  \n               Hawk exchanges an anxious glance with Trip and Lex.\n\n<b>                                     LEX\n</b>                         Too bad we're stuck in electronics \n                         or...\n\n<b>                                     HAWK\n</b>                         Never mind with the too bad shit. I \n                         got a crazy plan, but only the \n                         craziest among us can pull it off.\n\n<b>                                                 DISSOLVE TO: MOMENTS LATER\n</b>\n               Mr. Johansen still sits with his feet up, reading. The next \n               page's headline reads: First Test Tube Baby Born.\n\n               Trip runs up to Mr. J's desk, one hand behind his back, the \n               other on his crotch. His face is drawn in an expression of \n               sheer agony. Hawk and Lex watch anxiously in the background.\n\n<b>                                     MR.J\n</b>                         Mr. Verudi, get back to your bench.\n\n               Trip puts one leg over the other always keeping a hand behind \n               his back.\n\n<b>                                     TRIP\n</b>                         But I gotta take a piss like you \n                         would not believe, Mr. Johansen!\n\n<b>                                     MR.J\n</b>                         Put a clothespin on it till the end \n                         of class, Verudi. You know my rule.\n\n<b>                                     TRIP\n</b>                         But ever since my doctor put me on \n                         salt pills, it's been like Niagara \n                         Falls every half hour! Please, Mr. \n                         J! Have mercy!\n\n               Suddenly, a wet stain grows across the crotch of Trip's pants.\n\n<b>                                     MR.J\n</b>                         Salt pills? Don't insult my \n                         intelligence, Verudi...\n\n               Mr. J. stops when he sees the stain starting to spread.\n\n<b>                                     TRIP\n</b>                         Jeezis, I'm taking a leak in my pants!\n\n               We now see Trip is squeezing the pump from before. He holds \n               it behind him feeding water into the tube running down the \n               back of his pants.\n\n               The stain travels fast, hitting Trip's knee in a nanosecond.  \n               In a state of shock, Mr. J. slowly opens a long forgotten \n               drawer on his desk, finding a cobweb and dust-covered pad of \n               bathroom passes. He tears one off and dust flies everywhere.\n\n               He holds the pass out to Trip like it was a cross he was \n               holding before an advancing vampire.\n\n<b>                                     MR.J\n</b>                              (hoarsely)\n                         Get the hell out of here, Verudi! \n                         You disgust me!\n\n               Hawk and Lex observe that Trip has been successful, then do \n               a Three Stooges-style handshake, whispering \"Curly!\"\n\n<b>               INT. FRONT OFFICE - DAY\n</b>\n               The SECRETARY sits at her desk in the reception area filing \n               paperwork. She pauses when she hears RUNNING FOOTSTEPS. Trip \n               charges past, a big, wet stain on his crotch.\n\n               The secretary notices the pump and tube flopping from the \n               back of his pants as Trip turns a corner.\n\n<b>               INT. MAIN CORRIDOR - DAY\n</b>\n               Trip runs up to a pay phone on the wall, pumps every nickel \n               he has into it, puts the phone to his ear and dials.\n\n<b>                                     TRIP\n</b>                         I need to be connected to the W.A.R.P. \n                         contest hotline... Now... lady!... \n                         Hello, is this me? I'm Trip.\n\n<b>               INT. SCHOOL SECURITY OFFICE - DAY\n</b>\n               A cubby-of-an-office. Cluttered beyond belief. Elvis leans \n               back on his chair against the wall reading a PLOP Magazine. \n               A transistor radio plays W.A.R.P. He bolts at the sound of \n               Trip's name causing his chair to slide out from under him. \n<b>               THWAM!\n</b>\n<b>                                     TRIP ON RADIO\n</b>                         Am I on the air?... Yeah... Gene \n                         Klein, Stanley Eisen, Paul Frehley, \n                         and Peter, uh, Criscoula... yeah, \n                         that's it!\n\n<b>               INT. FRONT OFFICE - DAY\n</b>\n               The secretary hears an ecstatic \"YEEEHAAWW\" and turns to see \n               Trip wheeling back around the corner, leaping in the air as \n               he runs, YOWLING like a rodeo cowboy. He bounds past her. \n               She watches him and shakes her head.\n\n<b>                                     SECRETARY\n</b>                              (to herself)\n                         Moron.\n\n<b>               INT. SECURITY OFFICE - DAY\n</b>\n               Still on the floor, Elvis grabs the little radio with rage, \n               flips it off and screams at it.\n\n<b>                                     ELVIS\n</b>                         Why you little...! Over my dead body!\n\n               The bell RINGS.\n\n<b>               INT. HALLWAY OUTSIDE VOC/TECH ROOM - DAY\n</b>\n               Students pour into the hall. Hawk and Lex exit the class \n               just as Trip comes zigzagging down the corridor dodging the \n               hordes. All three converge as Trip can't contain his \n               enthusiasm.\n\n<b>                                     TRIP\n</b>                         I did it! I did it! We won!\n\n<b>                                     LEX\n</b>                         We won?!\n\n<b>                                     HAWK\n</b>                         Fuckin' A! Woooooo!\n\n               The three burnouts jump, scream, HOOT, and play air \n               instruments like loons as if they're the only ones in the \n               hall. They can't stop. The rest of the student body are not \n               amused\n\n<b>               INT. CAFETERIA - DAY\n</b>\n               Hawk, Trip, and Lex hold their trays over the counter as the \n               LUNCH LADIES fill them with Salisbury steak, hard dinner \n               rolls and scoops of bluish pudding. Ah, public school \n               nutrition.\n\n<b>                                     TRIP\n</b>                              (stoked)\n                         This is the best thing that ever \n                         happened to me at school! Not only \n                         are we on again for KISS in Detroit, \n                         but we're actually sitting right at \n                         the fifty yard line! I dare you dudes \n                         to find a curlier scenario.\n\n<b>                                     HAWK\n</b>                              (double stoked)\n                         Stan Lee couldn't think of a better \n                         one.\n\n<b>                                     LEX\n</b>                         The Chinese have a proverb: \"That \n                         which appears too good to be true, \n                         usually is.\" There's gotta be a catch.\n\n<b>                                     TRIP\n</b>                         Yeah? I have a saying too, Lex. It \n                         goes, \"Catch my jizz in your mouth \n                         and stop jinxing us, asshole.\" We're \n                         going this time and that's all there \n                         is to it.\n\n<b>                                     HAWK\n</b>                         I'm afraid our constipated little \n                         friend is right this time, Trip. \n                         There is a catch.\n\n               Hawk's really got their attention now.\n\n<b>                                     TRIP\n</b>                         Namely?\n\n<b>                                     HAWK\n</b>                         Our band \"Mystery\" is a quartet and \n                         we can't go on the road without our \n                         drummer. Jam's mom said something \n                         about sending him to St. Bernard's, \n                         right? We gotta bust him out before \n                         we go anywhere.\n\n<b>                                     LEX\n</b>                         But... but, St. Bernard's is way the \n                         hell over in the next county!\n\n<b>                                     HAWK\n</b>                         So? Your mom's car has a CB, radar \n                         detector and cruise control, check?\n\n<b>                                     LEX\n</b>                         We are not stealing my mom's car.\n\n<b>                                     HAWK\n</b>                         Damn straight we are.\n\n<b>                                     LEX\n</b>                         Hawk, all I need is one ding on the \n                         Volvo and presto! There are my balls \n                         hanging from the rearview mirror \n                         after she gets back from Cincinnati.\n\n<b>                                     HAWK\n</b>                         And when is she due back from that \n                         groinecologist's convention anyway?\n\n<b>                                     LEX\n</b>                         Sunday, but...\n\n<b>                                     HAWK\n</b>                         Then lighten up. She'll never know \n                         we touched it. Alright, here's the \n                         plan. We bus it to chez Lex, grab \n                         the Volvo, bail Jam the hell outta \n                         St. Bernard's and arrive at the train \n                         station precisely on time for the \n                         2:45 to Detroit.\n\n<b>                                     TRIP\n</b>                         Simplicity, Hawk.\n\n<b>                                     LEX\n</b>                         Simple-icity is more like it. And \n                         you guys thought Jam was in trouble \n                         before. Wait till Mrs. Bruce finds \n                         out he went to that concert with us.\n\n<b>                                     HAWK\n</b>                         There's only so much trouble an \n                         individual can get into till it just \n                         doesn't matter anymore, Lex. You \n                         familiar with a condition known as \n                         Absolute Zero?\n\n<b>                                     LEX\n</b>                         The hypothetical temperature \n                         characterized by the absence of heat \n                         and even the slightest amount of \n                         molecular activity? Yeah, I'm vaguely \n                         familiar\n\n<b>                                     HAWK\n</b>                         Well, Jam is in absolute trouble. He \n                         couldn't get any deeper into shit if \n                         he was a fly sitting in a horse's \n                         ass. You know as well as me he'd \n                         give his right arm just to see Peter \n                         Criss's drum solo, never mind a whole \n                         KISS concert, check?\n\n               Lex nods.\n\n<b>                                     HAWK\n</b>                         Well, the least we, his only buds in \n                         the world, can do is take him along \n                         with us tonight and give him one \n                         last curl before he starts serving \n                         his sentence.\n\n<b>                                     TRIP\n</b>                         Just for the record, I understood \n                         the last part of what you said, but \n                         for a while there you guys were making \n                         no fucking sense whatsoever.\n\n<b>                                     HAWK\n</b>                         I was just explaining to Lex here \n                         what you and I already know. Just \n                         had to make it a little more \n                         complicated so he'd understand.\n\n<b>                                     LEX\n</b>                         Very funny, Hawk. Okay, I'm in on \n                         this hare-brained scheme, but if \n                         anything happens to my mom's car, \n                         I'm blaming you. I'll say you drugged \n                         me or something.\n\n<b>                                     HAWK\n</b>                         Curly.\n\n               Hawk scopes out the cafeteria to make sure the coast is clear.\n\n<b>                                     HAWK\n</b>                         Ok, dudes, follow my lead.\n\n<b>                                     LEX\n</b>                         Wait a minute. We ditching the rest \n                         of school?\n\n<b>                                     TRIP\n</b>                         About fuckin' time if you ask me. \n                         I'm just going through the motions \n                         till I drop out anyway.\n\n<b>                                     LEX\n</b>                         Hello summer detention.\n\n<b>                                     HAWK\n</b>                         As I was saying, follow my lead. And \n                         maintain. Elvis just showed up.\n\n               Hawk points across the cafeteria and sure enough Elvis has \n               just entered. Luckily, he hasn't noticed the boys yet.\n\n               Elvis swaggers to a table of CHEERLEADERS, puts his leg on a \n               chair and starts a one-sided conversation with them. They \n               promptly push their trays away, having lost their appetites.\n\n               Meanwhile, back at the condiment tray, Hawk and Trip each \n               grab a big handful of ketchup packets and head to a table. \n               Lex reluctantly follows suit grabbing a big handful of ketchup \n               packets too. All three of them put their trays down and sit.\n\n<b>                                     HAWK\n</b>                              (eyeing Elvis)\n                         Five second rule, boys. See you on \n                         the other side.\n\n               Hawk approaches the exit door, glances either way, then \n               leaves.\n\n               Trip and Lex look at their watches for five seconds. Then \n               Trip heads for the exit door also.\n\n               Lex still stares at his watch. After five, he looks at Elvis, \n               who stops talking to the cheerleaders. As if possessing some \n               sixth sense, Elvis turns quickly and looks STRAIGHT INTO \n<b>               CAMERA.\n</b>\n               ELVIS'S POV -- He spots the swinging exit door and an empty \n               table with three full lunch trays sitting on it.\n\n<b>                                     ELVIS\n</b>                         Excuse me, ladies.\n\n               Relieved he's gone, the cheerleaders start eating again.\n\n               Elvis moves through the cafeteria in SLOW MOTION toward the \n               exit door. The hunter in action.\n\n<b>               INT. HALLWAY - DAY\n</b>\n               Elvis pushes through the door and into a hall, dead-eye stare \n               focused up ahead where the hallway turns sharply. He catches \n               a glimpse of Lex. Smiling like the devil, Elvis bolts.\n\n<b>               INT. OTHER HALLWAY - DAY\n</b>\n               Lex catches up with Hawk and Trip just as Elvis swings around \n               the corner and marauds after them CACKLING maniacally. A mad \n               chase ensues. Down hallways. Around corners. Upstairs. Down \n               ramps.\n\n               Hawk, Trip, and Lex scramble as fast as they can to escape \n               the clutches of their sideburn-clad nemesis.\n\n               As the boys pass a classroom, a NERD comes out pushing a \n               projector on an AV cart. Thinking fast, Hawk grabs it out of \n               the nerd's hands and pushes it down the hall at Elvis.\n\n<b>                                     NERD\n</b>                         Hey, I'm responsible for that!\n\n               CRASH! Elvis bashes face-first into the rolling cart. He and \n               the projector go tumbling. Not wasting a second, Elvis is \n               back on his feet and after them again. The nerd grabs his \n               hair in horror at the sight of the smashed projector.\n\n<b>               AROUND A CORNER\n</b>\n               Elvis SKIDS around the corner and trips on a fire hose \n               stretched across the floor from its glass box to a water \n               fountain pipe. He slides on his belly along the polished \n               floor unable to stop.\n\n<b>               INT. ENGLISH CLASS - DAY\n</b>\n               Old MISS HIBBS is lecturing on MOBY DICK. The kids are dozing.\n\n<b>                                     MISS HIBBS\n</b>                         Then a cry from the crow's nest... \n                         \"Thar she blows!\"\n\n               Suddenly, a screaming Elvis slides into the open door on his \n               stomach and bowls Miss Hibbs over like a Brunswick. He clamors \n               to his feet and shoots out the room leaving everyone stunned.\n\n<b>               INT. HALLWAY - DAY\n</b>\n               Pausing at the corner, Elvis takes a breath and leaps around \n               it. He smiles at what he sees.\n\n               Up ahead, Hawk, Lex, and Trip stand on a 3-stair stoop, \n               desperately pulling at a locked door. Elvis smiles. They \n<b>               GULP.\n</b>\n<b>                                     ELVIS\n</b>                         KISS concert? Kiss my ass morelike. \n                         A nice, fat detention oughta put a \n                         crimp in this evening's plans.\n\n               Elvis takes his key ring off his belt and begins twirling \n               it. The boys turn and face him. He savors the moment.\n\n<b>                                     ELVIS\n</b>                         Looking for something, rodents?\n\n<b>                                     HAWK\n</b>                         Yeah, Elvis...\n\n               Hawk's brow furrows as he pulls about fifty ketchup packets \n               out of his pocket. Trip and Lex do the same.\n\n<b>                                     HAWK\n</b>                         ..Your ass on a lunch tray.\n\n               Elvis laughs and lurches forward -- the boys' cue to drop \n               the ketchup packets at their feet and...\n\n<b>                                     HAWK\n</b>                         On your marks and...\n\n               Trip and Lex ready themselves, then...\n\n<b>                                     HAWK\n</b>                         Fire!\n\n               They start stomping on the packets, squirting Elvis's face \n               and torso with tomato-based condiment causing him to let out \n               a scream that lasts the rest of the scene. Ketchup spatters \n               across his body in SUPER SLOW MOTION. A shot hits him in the \n               mouth and he COUGHS it back out in mid-scream.\n\n               The boys stomp relentlessly, mercilessly, blasting their \n               nemesis with hideous cafeteria red as Elvis throws his arms \n               back, body quaking at every splat. It's kind of like the \n               scene in \"The Godfather\" where Sonny gets it.\n\n               Beaten and spent, his scream now dried up to a hoarse GASPING, \n               Elvis slips on some ketchup at his feet. He hits the floor \n               with a THUD right in the goop. He lays there letting out DRY \n               SOBS looking like a bunless wiener.\n\n               Hawk jumps off the stoop. Taking Elvis's key chain away, he \n               hops back up and unlocks the door letting Trip and Lex out. \n               Hawk whips the keys back at Elvis, hitting him in the head, \n               then flashes a pearly Error Flynn smile.\n\n<b>                                     HAWK\n</b>                         Elvis, you ain't nothin' but a hot \n                         dog.\n\n               Hawk bolts out the door. Elvis tries to get up only to slip \n               in the muck again and fall back down twice as hard.\n\n<b>                                     ELVIS\n</b>                         Nooooo!!\n\n<b>                                        JAILBREAK\n</b>\n<b>               EXT. STREET IN THE NEXT COUNTY - DAY\n</b>\n               C/U on the grill of a moving car, Ohio vanity plate reading: \n               Ob-GYN.\n\n               PULL BACK to reveal it's on a brand spanking-new, brown Volvo \n               242 DL hauling ass. Hawk drives, Lex rides shotgun, and Trip \n               sits in the back, arms draped over the front seat.\n\n<b>               EXT. ST. BERNARD'S - DAY\n</b>\n               The Volvo turns and barrels up St. Bernard's gated entrance.\n\n<b>               INT. VOLVO - DAY\n</b>\n<b>                                     TRIP\n</b>                         Well, here we are back at fucking \n                         school again.\n\n<b>                                     LEX\n</b>                         Huh. St. Bernard's. Figures it's \n                         named after a canine.\n\n               Hawk and Trip roll their eyes.\n\n<b>               INT. ST. BERNARD'S BOARDING SCHOOL - DAY\n</b>\n               Mrs. Bruce and FATHER McNULTY stand outside his office. The \n               door is open a tad. Jam sits just beyond it, but all we see \n               are his corduroyed legs which shake. Jam is one nervous kid.\n\n<b>                                     MRS. BRUCE\n</b>                         Again, many thanks and praise to you \n                         for seeing Jeremiah on such short \n                         notice.\n\n               Father McNulty has a look of utter compassion on his face.\n\n<b>                                     FATHER MCNULTY\n</b>                         Anything for a potential tuition... \n                         to be given to charity of course.\n\n<b>                                     MRS. BRUCE\n</b>                         God bless you, Father McNulty.\n\n<b>                                     FATHER MCNULTY\n</b>                         He already has.\n\n               They hug. She exits. And the look of utter compassion on \n               Father McNulty's face disappears.\n\n<b>               INT. FATHER MCNULTY'S OFFICE - DAY\n</b>\n               The priest enters, SLAMS the door shut, startling Jam, and \n               sits in front of a painting of the Virgin Mary on his wall. \n               The name plate on his desk reads: FR. PHILIP McNULTY.\n\n<b>                                     FATHER MCNULTY\n</b>                         Before enrolling you, Jeremiah, let \n                         me just say it would be greatly \n                         appreciated if your career at St. \n                         Bernard's was an uneventful one. \n                         Some students believe they can get \n                         expelled through disobedience and \n                         recklessness. What they don't \n                         understand is even after God's \n                         vengeance is meted out, He forgives. \n                         That His devastating anger is followed \n                         by His nurturing compassion. In a \n                         nutshell, St. Bernard's may punish \n                         you even for the slightest digression, \n                         but will never cast you out, even \n                         for the largest. So here you are, \n                         Jeremiah... here to stay!\n\n               Father McNulty sticks the pencil into an electric pencil \n               sharpener and it makes the same NOISE a DENTIST'S DRILL does \n               when burrowing into a molar. Jam shudders.\n\n               The Father removes the pencil and blows the shavings away \n               from the needle-sharp tip.\n\n<b>                                     FATHER MCNULTY\n</b>                         Let's begin the enrollment, shall \n                         we?\n\n<b>               EXT. ST. BERNARD'S - DAY\n</b>\n               Mrs. Bruce exits the building and approaches her car. She \n               stops when she sees the '78 brown Volvo parked behind her. \n               It's empty. She shrugs and gets into her car, driving off.\n\n               Inside the Volvo Hawk, Trip, and Lex poke their heads up. \n               The coast is clear so they can sit straight again. They stare \n               up at a second story window where they see part of Jam's \n               profile.\n\n<b>                                     LEX\n</b>                         Now, how are we gonna do this?\n\n<b>                                     HAWK\n</b>                         Gimme a second, dudes. Lemme think.\n\n               They hear an ENGINE and turn to see a delivery truck labelled \n               PIZZA PIG parking behind them. A DELIVERY BOY holding a pizza \n               box steps out. Trip's mouth waters.\n\n<b>                                     TRIP\n</b>                              (licking his chops)\n                         Mmm, pizza...\n\n               Seeing the boys, the delivery boy stops at the Volvo.\n\n<b>                                     DELIVERY BOY\n</b>                         Hey, you guys know where...\n                              (looks at slip on box)\n                         Philip McNutly's office is?\n\n               Hawk, Trip, and Lex exchange an anxious glance, then Hawk \n               smiles. He is officially inspired as he turns to the boy.\n\n<b>                                     HAWK\n</b>                         Yeah, I'm Philip McNutly.\n\n<b>               INT. FATHER MCNULTY'S OFFICE - DAY\n</b>\n               The Father TAPS his pencil looking impatiently at Jam who \n               has totally withdrawn. He sits motionless staring into space.\n\n<b>                                     FATHER MCNULTY\n</b>                         Jeremiah, are you aware you need to \n                         answer these questions, not just \n                         listen to them? Jeremiah?\n\n               Jam doesn't respond.\n\n<b>                                     FATHER MCNULTY\n</b>                         Please don't become difficult this \n                         early in your stay. I hate \n                         disciplining boys before I get to \n                         know them.\n\n               A NUN enters KNOCKING.\n\n<b>                                     NUN\n</b>                         Forgive me, Father. A young man here \n                         with a pizza for you?\n\n<b>                                     FATHER MCNULTY\n</b>                         Ah, yes! Send him in Sister Conimaria.\n\n               The nun exits and a second later Hawk enters wearing Lex's \n               baseball cap pulled down over his eyes.\n\n<b>                                     FATHER MCNULTY\n</b>                         Well, what's the damage, pizza fellow?\n\n<b>                                     HAWK\n</b>                         Ten even.\n\n               The priest swivels his chair around and unlocks a box labelled \n               \"Donations.\" While he looks for cash, Hawk gives Jam a \n               discreet kick in the shin. Jam looks up and recognizes Hawk. \n               He then looks out the window seeing Trip, Lex, and the Volvo \n               below.\n\n               For the first time we see what Jam looks like with a big, \n               fat, shit-eating grin on his face.\n\n<b>                                     HAWK\n</b>                              (whispering to Jam)\n                         If he offers you a slice, you're not \n                         the least bit hungry, check?\n\n<b>                                     JAM\n</b>                              (whispering)\n                         Check.\n\n               Father McNulty swivels back around with a ten.\n\n<b>                                     FATHER MCNULTY\n</b>                         Here's ten and I'm donating your tip \n                         to the church. The Lord thanks you.\n\n<b>                                     HAWK\n</b>                         Tell the Big Guy not to mention it.\n\n               Hawk takes the ten, tips the brim of the baseball cap and \n               leaves, giving Jam a cautious wink as he goes.\n\n<b>                                     FATHER MCNULTY\n</b>                         And not a moment too soon. I'm \n                         famished. I hope you brought a lunch \n                         for yourself.\n\n<b>                                     JAM\n</b>                         No, but I'm not hungry anyway.\n\n               Father McNulty raises his eyebrows, then opens the pizza \n               box.\n\n<b>                                     FATHER MCNULTY\n</b>                         Well! It finally speaks. There's one \n                         barrier we've broken through.\n\n               Father McNulty smiles, taking a big bite. Jam smiles for an \n               entirely different reason. The priest mumbles with a mouthful.\n\n<b>                                     FATHER MCNULTY\n</b>                         You know, your coming here reminds \n                         me of a gospel called The Prodigal \n                         Son.\n\n               Jam grins a bit feigning interest.\n\n<b>                                     FATHER MCNULTY\n</b>                         There was once a farmer who had two \n                         sons. Both grew up on the farm, \n                         helping their father until...\n                              (suddenly alarmed)\n<b>                         GYYAACK!\n</b>\n               Father McNulty GAGS sticking his pizza-covered tongue out. \n               He pours himself a glass of wine and sucks it down looking \n               concerned for the moment. Finally, he BELCHES.\n\n<b>                                     FATHER MCNULTY\n</b>                         That was a very stale mushroom.\n                              (beat)\n                         Where was I?... Ah, yes, one day the \n                         elder son decided to leave the farm...\n\n<b>               INT. VOLVO - DAY\n</b>\n               Hawk, Trip, and Lex look up at Father McNulty's window.\n\n<b>                                     TRIP\n</b>                         Usually takes anywhere from ten \n                         minutes to half an hour.\n\n               They look at their watches, then back at the window.\n\n<b>                                     HAWK\n</b>                         Shit! This is such a lousy view. How \n                         the hell are we gonna know when he's \n                         lit?\n\n               Just then, INSANE LAUGHTER bellows from the window above.\n\n<b>                                     TRIP\n</b>                         He's lit.\n\n<b>               INT. FATHER MCNULTY'S OFFICE - DAY\n</b>\n               The Father has undergone a metamorphosis. He's redder than a \n               boiling lobster, his eyes bulge and he's laughing the deepest \n               laugh a man can without risking psychological evaluation.\n\n               Jam watches fascinated as the priest tries to finish the \n               story. It's not every day you see a holy man tripping on \n               shrooms.\n\n<b>                                     FATHER MCNULTY\n</b>                              (in mid-guffaw)\n                         So then, the younger one says, \"But \n                         dad... I've been helping you on the \n                         farm my entire life!\n                              (belly laugh)\n                         You never once slaughtered the fatted \n                         calf for me!\" And then...\n                              (more belly laughter)\n                         Forgive me, Jeremiah, it's just \n                         that... I've been telling this gospel \n                         for years and... I just now realized \n                         it's the work of some comedy \n                         mastermind! The Prodigal Son is a \n                         barrel of fucking monkeys!\n\n               Father McNulty belly laughs so hard this time, he slides off \n               his chair hitting his chin on the edge of his desk. He is in \n               pain only momentarily, then laughs again, this time at his \n               own pratfall. He hoists himself back into his chair.\n\n               Hawk, Trip, and Lex suddenly barge into the office, followed \n               by the outraged nun.\n\n<b>                                     NUN\n</b>                         You kids can't go in there!\n\n<b>                                     HAWK\n</b>                         It's okay, we're old buds of Father \n                         McNulty... How's it hangin', padre?\n\n<b>                                     FATHER MCNULTY\n</b>                         A little to the right, pizza fellow.\n\n               Father McNulty laughs some more.\n\n<b>                                     HAWK\n</b>                         That was another dude. Anyway, we're \n                         here to take our bud Jam to the big \n                         satanic KISS concert tonight. Okay \n                         with you?\n\n<b>                                     FATHER MCNULTY\n</b>                              (waving)\n                         Rock on!\n\n               Jam gets up and all four boys exit.\n\n<b>                                     FATHER MCNULTY\n</b>                              (yelling after them)\n                         Give my regards to the guy with the \n                         really big tongue!\n\n               The nun looks at the priest, deep concern in her eyes.\n\n<b>                                     FATHER MCNULTY\n</b>                         What the hell are you doing, Sister \n                         Gonorrhea, waiting for a bus?\n\n               He lets out a belly laugh as the shocked nun runs from the \n               office. Father McNulty laughs even louder at her behavior, \n               POUNDING his fists on the desk, tears rolling down his cheeks, \n               until...\n\n               He suddenly glimpses at the painting of the Virgin Mary and \n               abruptly stops laughing. What appears to be extreme contrition \n               washes over his face as he moves closer to the painting.\n\n<b>                                     FATHER MCNULTY\n</b>                         Jesus H. Christ, look at all the \n                         colors.\n\n<b>                                          GUIDOS\n</b>\n<b>               INT. VOLVO - DAY\n</b>\n               Hawk drives, Trip rides shotgun, Lex and Jam sit in the back.  \n               Stoked beyond belief, Jam POUNDS his drumsticks on the \n               upholstery to the beat of a rockin' KISS tune playing on the \n               8-track.\n\n<b>                                     JAM\n</b>                         Oh, man, my mom is gonna send me to \n                         Alcatraz for this and I don't even \n                         care! I'm gonna see Peter Criss's \n                         drum solo!\n\n               Lex taps Jam on the shoulder.\n\n<b>                                     LEX\n</b>                         Not looking like that, Mr. Rogers.\n\n               Lex hands him a paper bag with jeans and a tee-shirt in it.\n\n<b>                                     LEX\n</b>                         We got you a change of duds when we \n                         picked up the car.\n\n<b>                                     HAWK\n</b>                         Next stop: the 2:45 to Detroit Rock \n                         City!\n\n               The boys do their Three Stooges handshake and say \"Curly!\"\n\n               Jam starts to change. Just then, the Volvo passes a two-tone \n               Chevy Impala with luggage tied to the roof. The passenger in \n               the back seat turns and spots Jam pulling off his pants. \n               It's Beth. Her eyes bulge. Beth parents are in the front.\n\n               Jam spots her and beams. Their eyes lock. She waves and starts \n               to yell something, when... suddenly... BANG!\n\n               The boys look out the driver's side of the car to see the \n               rear hubcap rolling away. They've got a flat.\n\n<b>                                     LEX\n</b>                              (screams)\n                         My mom's hubcap!\n\n               The car fishtails and weaves but Hawk manages to pull over. \n               The Chevy continues on, Beth gazing out the rear window sadly.\n\n<b>                                     HAWK\n</b>                         Shit!\n                              (looks at car clock)\n                         Anybody know how long it takes to \n                         fix a flat?\n\n<b>               EXT. LOCAL TRAIN STOP - DAY\n</b>\n               ANGLE ON a status report. The 2:45 is now leaving. We see is \n               Hawk, Trip, Lex, and Jam running alongside a train as it \n               picks up speed by the second. They YELL for it to stop, but \n               it's hopeless. The train is gone. So much for the 2:45.\n\n<b>               INT. VOLVO - DAY\n</b>\n               Lex looks at the speedometer. Hawk's got it up to ninety-\n               five.\n\n<b>                                     LEX\n</b>                         Jeezis, Hawk, can you at least keep \n                         it within twenty miles of the speed \n                         limit?\n\n<b>                                     HAWK\n</b>                         Lex, am I gonna have to lock you in \n                         the trunk till we reach Detroit? \n                         Don't worry, these babies are built \n                         for speed.\n\n               Trip holds his stomach as we hear it GROWL.\n\n<b>                                     TRIP\n</b>                         I'm starvin' and it's way past \n                         lunchtime.\n\n<b>                                     HAWK\n</b>                         Totally. All I've had for chow was a \n                         packet of Pop Rocks and a Yoo-hoo.\n\n               Trip spots a sign on the side of the road: Next Exit, \n               Sandusky.\n\n<b>                                     TRIP\n</b>                         Let's stop in Sandusky, Hawk.\n\n<b>                                     HAWK\n</b>                         What's in Sandusky?\n\n<b>                                     TRIP\n</b>                         Pizza, and I been jones-in' for a \n                         pizza ever since we left St. \n                         Bernard's.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               MOMENTS LATER\n</b>\n<b>               INT. VOLVO - DAY\n</b>\n               The boys chomp on their pizza slices and chug cans of Hawaiian \n               Punch. Another raucous KISS tune BLARES.\n\n               Behind them, a car horn starts HONKING rhythmically. Hawk \n               looks into the rearview mirror and sees two guys and two \n               girls in a tailgating Trans Am.\n\n               The guys have 90 M.P.H. haircuts, tacky, wide-collared shirts, \n               and massive amounts of jewelry on their necks.\n\n               The girls wear 10-layer make-up, mega-jewelry, and hair teased \n               so high, it touches the car's roof.\n\n<b>                                     HAWK\n</b>                         Only a car full of guidos and stellas \n                         would ride someone's ass on a two-\n                         lane road and beep.\n\n<b>               INT. TRANS AM - DAY\n</b>\n               The speakers BLAST a DISCO SONG to which the four passengers \n               sing. KENNY, the driver, HONKS to the disco beat.\n\n               They're slightly older than our heroes and very full of \n               themselves. Kenny and his best girl CHRISTINE sit in the \n               front. BOBBY and BARBARA are in the back. It's a double disco \n               date.\n\n<b>               INT. VOLVO - DAY\n</b>\n               Trip lifts a rubbery slice of pizza to his mouth and the top \n               layer slides off PLOPPING into his lap.\n\n<b>                                     TRIP\n</b>                         Eyowch! This is one hot pizza!\n\n<b>                                     LEX\n</b>                         Trip, huck that out before it stains \n                         the upholstery!\n\n               Trip grabs the wad of goop and throws it out the window.\n\n<b>               EXT. TRANS AM - DAY\n</b>\n               Just as the DISCO TUNE playing in the Trans Am hits the next \n               chorus, a fistful of pizza SPLATTERS across the windshield. \n               Freaked, Kenny swerves and zigzags all over the road.\n\n               Righting himself, Kenny's entire family might as well have \n               been insulted.\n\n<b>                                     KENNY\n</b>                         Stop singing... NOW!\n\n               He turns off the stereo and floors the accelerator, swerving \n               into the left lane and passing the Volvo. Bobby is just now \n               noticing the mess on the windshield.\n\n               He starts to laugh.\n\n<b>                                     BOBBY\n</b>                         Hey, Kenny, look! There's a hunk of \n                         fawkin' cheese on your windsheel!\n\n<b>               INT. VOLVO - DAY\n</b>\n               Lex is looking at the mess on the Trans Am's windshield and \n               the anger in the eyes of its passengers.\n\n<b>                                     LEX\n</b>                         Holy shit! We just pissed off the \n                         Incredible Hulk, his idiot half \n                         brother and two circus clowns.\n\n               The Trans Am runs alongside the Volvo and Hawk turns to see \n               Kenny pointing to the breakdown lane.\n\n<b>                                     KENNY\n</b>                         Stop the friggin' car NOW!\n\n               Hawk rolls up his window. Kenny yells, VOICE MUFFLED, and \n               points to Hawk who pays absolutely no attention whatsoever.\n\n<b>                                     JAM\n</b>                         Don't you think we should at least \n                         pull over and offer to clean it off?\n\n<b>                                     HAWK\n</b>                         What?! Are you mentally deranged, \n                         Jam?\n\n               Just then, SLAM, the Trans Am bangs up against the side of \n               the Volvo pushing it onto the shoulder.\n\n<b>                                     HAWK\n</b>                         What the fuck!\n\n<b>                                     LEX\n</b>                              (freaking out)\n                         The paint!\n\n<b>               EXT. FREEWAY - DAY\n</b>\n               The Trans Am muscles the Volvo into the breakdown lane. \n               Parking the ass end of the Pontiac out a bit, Kenny blocks \n               the Volvo in. Kenny and Bobby climb from their car and storm \n               over to the boys.\n\n               Hawk opens his door just as Kenny's hairy-knuckled hands \n               pull him out through the window. He grabs Trip, yanking him \n               out too. Bobby opens the back door and does the same with \n               Lex and Jam.\n\n               With a kid in each hand now, Kenny and Bobby SLAM the four \n               boys against the Volvo in a line. The size difference between \n               the burnouts and the guidos is painfully obvious now. Kenny \n               and Bobby are Neanderthals.\n\n<b>                                     KENNY\n</b>                         Do you realize the sheer, goddamn, \n                         unadulterated, undiluted, no holds \n                         barred, one hundred percent pure as \n                         Ivory Snow, absolutely friggin' \n                         STUPIDITY of what you just did?\n\n<b>                                     HAWK\n</b>                         Hey, disco dude, it's cool...\n\n               Kenny hauls back and SLAPS the row of boys in the faces Three \n               Stooges-style... WHACKWHACKWHACKWHACK!\n\n<b>                                     KENNY\n</b><b>                         DO YOU?!\n</b>\n               Trip, Lex, and Jam clutch their faces in pain. Hawk looks \n               merely disenchanted as Kenny pokes a muscle-bound finger at \n               his chest. Getting in Hawk's face, Kenny yammers loud and \n               fast.\n\n<b>                                     KENNY\n</b>                         Lemme paint you a friggin' picture \n                         ahright? Imagine if you will a 1978 \n                         Pontiac Trans American in pristine \n                         condition.\n                              (beat)\n                         An appealing portrait, nesspah?\n\n               Hawk starts to say \"yes.\"\n\n<b>                                     KENNY\n</b>                         BUT WAIT! What's that spec on the \n                         windshield? Could it be a wad of \n                         melted mozzarella, tangy tomato sauce, \n                         and various friggin' meat products?\n\n               Hawk is unimpressed.\n\n<b>                                     HAWK\n</b>                         Could be.\n\n<b>                                     KENNY\n</b>                         And if it ain't cleaned off?\n\n<b>                                     CHRISTINE\n</b>                         Kenny, come on with the macho crap \n                         already. Like this kid could take \n                         you in a fight anyway.\n\n<b>                                     KENNY\n</b>                              (ignoring Christine)\n                         Answer me, hippie girl. And if the \n                         mess ain't cleaned off my car?\n\n<b>                                     HAWK\n</b>                         It could... bake on?\n\n               Kenny looks at Bobby and they exchange moronic grins.\n\n<b>                                     KENNY\n</b>                         You're a smart little homo, aren't \n                         you, hippie girl? But, while astounded \n                         at your nimble, friggin' insight, I \n                         still detect an issue hanging fire, \n                         namely: where does a sharp-witted \n                         faggot like yourself get off doing \n                         such a dopey thing like that there?\n\n               Hawk figured out that any answer he gives will be incorrect \n               and has decided to wait till Kenny's done.\n\n<b>                                     KENNY\n</b>                         No really, I'm perplexed. I mean, \n                         could you have done stupider if you \n                         were born without a FUCKIN' HEAD?!\n\n<b>                                     CHRISTINE\n</b>                              (using \"oh\" to mean \n                              \"enough\")\n                         Oh! With the language!\n\n<b>                                     KENNY\n</b>                         Shut-up, Christine!\n\n               Christine snarls at Kenny.\n\n<b>                                     HAWK\n</b>                         Okay, Kenny? I don't mean to drain \n                         your keg or anything, but could you \n                         speed up this process?\n                              (beat)\n                         Don't get me wrong, we'd love to \n                         stand here and get shit on by the \n                         cast of Saturday Night Fever, but \n                         we're also on a schedule. So step on \n                         it.\n\n               Cold silence as Kenny replays Hawk's insult over in his head.\n\n<b>                                     KENNY\n</b>                         Are you gettin' wise with me?\n\n<b>                                     HAWK\n</b>                         No, I'm dumber than a goddamn slug. \n                         Now can I please clean your windshield \n                         and leave without further ado?\n\n<b>                                     BOBBY\n</b>                         Break his fawkin' legs, Kenny!\n\n               Kenny's temper's rising faster than the price of gasoline.  \n               Hawk on the other hand is cooler than an Otter Pop.\n\n<b>                                     KENNY\n</b>                         Oh, you're dumb all right, you hairy \n                         ass punk. But please, allow me to \n                         clean the friggin' windshield. I \n                         insist.\n\n               And with that, Kenny grabs himself a fistful of Hawk's long \n               hair and pulls him over to the Trans Am. He wipes the pizza \n               off with Hawk's hair, tugging Hawk's head up and down, back \n               and forth. Hawk GRUNTS with each wipe, but doesn't give Kenny \n               the satisfaction of hearing him scream.\n\n               Trip, Lex, and Jam watch helplessly, trapped under Bobby's \n               dull-witted, but equally threatening gaze.\n\n               Kenny gets the last of the big chunks off his windshield and \n               looks at his handiwork.\n\n<b>                                     KENNY\n</b>                         There. Nice and clean.\n\n               He throws Hawk to the ground and smiles at Bobby. Then, he \n               suddenly hears the KISS tune coming from the Volvo. Uh-oh!\n\n<b>                                     KENNY\n</b>                         Oh, no, no, no! It's the fag band!\n\n               Kenny clenches his jaws and walks up to the Volvo, reaching \n               in the driver's door. Suddenly Jam grabs his wrist.\n\n<b>                                     JAM\n</b>                         Whoa! This is about pizza! Let's \n                         leave KISS out of it. Please.\n\n<b>                                     KENNY\n</b>                         A bunch of guys who make bad music, \n                         dress like freaks, and wear more \n                         make-up than all my sisters combined?  \n                         These assholes must be stopped!\n\n               Kenny pushes Jam away.\n\n<b>                                     CHRISTINE\n</b>                         That's it, Kenny! I'm leaving!\n\n               Christine gets out of the car and starts walking down the \n               highway, exiting the scene.\n\n<b>                                     BARBARA\n</b>                         Oh, Christine! You googatz in the \n                         head or something? We're on the side \n                         of the freakin' highway!\n\n<b>                                     BOBBY\n</b>                         Let her go, Barbara, she'll come \n                         back to Kenny. She always does...\n                              (to Kenny)\n                         Right, Kenny?\n\n               Kenny meanwhile has his arm in the Volvo.\n\n<b>                                     KENNY\n</b>                         Kool and the Gang, now there's real \n                         music.\n\n               Kenny takes the 8-track from the car...\n\n<b>                                     KENNY\n</b>                         But this... is crap!\n\n               He flings it into the highway, where it is summarily smashed \n               to bits under the wheels of a passing semi.\n\n               FOLLOW a chunk of cartridge and a strand of mangled tape \n               streaming from it as it sails back toward the side of the \n               road, landing at Jam's feet.\n\n               TILT UP to Jam's face. He raises his eyes and turns to the \n               CAMERA, a single tear rolling down his cheek, just like the \n               Indian in that \"Keep America Beautiful\" litter ad.\n\n               Hawk rises and Kenny comes face-to-face with him.\n\n<b>                                     KENNY\n</b>                         So. All that having been said and \n                         done, I believe we are ready for the \n                         final topic of discussion. Namely: \n                         Have you learned your lesson yet, \n                         puke?\n\n               Hawk pulls a cigarette from his pocket and lights it. He \n               blows some smoke in Kenny's face.\n\n<b>                                     HAWK\n</b>                         Well, let's recap, shall we? You \n                         slapped all of us, yelled at me, \n                         used my head for a rag, threw me on \n                         the ground and tossed our LOVE GUN 8-\n                         track under the wheels of a passing \n                         semi.\n                              (puffing on cig)\n                         So, if the lesson was that you're a \n                         dick with ears and a really bad \n                         haircut, then, yes... I'd say we \n                         learned it.\n\n<b>                                     KENNY\n</b>                              (beat, in disbelief)\n                         Excuse me, I'm a little deef-a-\n                         hearin'. Can you repeat yourself?\n\n<b>                                     HAWK\n</b>                         Okay. Ahem! You. Are. A. Dick. With. \n                         Ears. And. A. Really. Bad. Haircut.\n\n<b>                                     KENNY\n</b>                         Oh, yeah...?\n\n               Out of original material, Kenny goes for an old stand by.\n\n<b>                                     KENNY\n</b>                         That's not what your mother said \n                         last night.\n\n               Trip, Lex, and Jam exchange \"uh-oh\" glances. Meanwhile, Hawk's \n               eyes glaze over.\n\n<b>                                     HAWK\n</b>                         It's not, huh? Well, then, tell me...\n\n               Hawk reaches into his coat pocket and pulls out his mostly \n               empty can of Hawaiian Punch, holding it discreetly at his \n               side.\n\n<b>                                     HAWK\n</b>                         ...what exactly did my mother say \n                         last night?\n\n               Kenny draws a blank, not being prepared for this one.\n\n<b>                                     HAWK\n</b>                         You heard me, prick. What did my \n                         mother say last night?\n\n               Kenny chuckles and looks at Bobby. They have a good little \n               laugh... the homo's got balls! Then Kenny turns back to Hawk.\n\n<b>                                     KENNY\n</b>                         Okay, fagmo... I'll tell you what \n                         your mother said last night.\n                              (beat)\n                         She said that I was the fuck of her \n                         life.\n\n               Hawk is a little mad now. He tosses his cigarette to the \n               ground and squashes it like a bug under his sneaker.\n\n<b>                                     HAWK\n</b>                              (very Clint Eastwood)\n                         How would you like a nice Hawaiian \n                         Punch?\n\n<b>                                     KENNY\n</b>                              (smirking)\n                         Sure.\n\n               Quick as a shot, Hawk SLAMS the bottom of the can into Kenny's \n               nose, crushing it flat against his face. Hawaiian backwash \n               spews from its tab hole like blood as Kenny falls backwards \n               from the impact. He hits his head on the ground.\n\n               Taking this as a cue... Trip whips out his wallet on a \n               chain... Lex rips off his KISS belt... And Jam yanks out his \n               drumsticks.\n\n               As if choreographed, Trip swoops the wallet at Bobby's feet, \n               snagging him around the ankles tightly with the chain. Lex \n               THWAMS Bobby in the face with his big KISS belt buckle leaving \n               a reversed, red, KISS logo branded in his forehead.\n\n               Trip yanks the chain pulling Bobby off his feet. When he \n               hits the ground, Jam's right there DRUMMING his balls.\n\n               Bobby shrieks.\n\n               Meanwhile, Hawk advances on Kenny who tries to get the can \n               off his face, but it's stuck on looking like a pig's nose \n               with fruit punch for snot.\n\n               Hawk raises both his hands in Kenny's face, then executes \n               the final insult... Hawk messes Kenny's hair. Kenny lets out \n               a scream that comes from the bottom of his vanity.\n\n               Hawk grabs Kenny by the ears and brings the guido's head \n               swiftly against his kneecap. Kenny falls to the ground, \n               unconscious on top of Bobby. Their heads collide knocking \n               Bobby out cold.\n\n               Terrified, Barbara leaps from the Trans Am and is cornered.\n\n<b>                                     LEX\n</b>                         Not so fast, stella.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               MOMENTS LATER\n</b>\n               Kenny, Bobby, and Barbara are now tied to the guardrail with \n               Jam's white corduroy pants, geeky belt, and plaid shirt. \n               Kenny and Bobby rest their unconscious heads on each of \n               Barbara's shoulders.\n\n               Hawk, Trip, Lex, and Jam look down at the two guidos and the \n               stella, snickering.\n\n<b>                                     BARBARA\n</b>                         When they wake up, they're gonna \n                         come looking for you jerks. You best \n                         hope they don't find you, cause if \n                         they do, they're gonna kick your \n                         asses.\n\n               Hawk grabs a cinderblock off the side of the road, walking \n               up to the Trans Am.\n\n<b>                                     HAWK\n</b>                         Right, stella, and we'll deserve it.  \n                         But let's really make it worth their \n                         while.\n\n               Hawk puts the rock on the Trans Am's accelerator letting the \n               engine WHINE in protest. (Again we are cautious not to show \n               the guidos' faces.)\n\n<b>                                     HAWK\n</b>                         By the way, when Kenny wakes up could \n                         you give him a message for me. Tell \n                         him, quote, Kool and the gang bite \n                         my bag, motherfucker, unquote.\n\n               He throws the Trans Am into drive.\n\n               All who are conscience listen to the brief SCREECH, then \n               watch the Trans Am as it barrels without a driver into the \n               woods skirting the highway.\n\n               It races into ditches, bounces off trees, and SPLASHES through \n               ponds, all Smokey and the Bandit-like.\n\n               The disco-mobile ramps off the edge of an embankment, tumbles \n               down a steep, rocky incline breaking apart along the way, \n               and finally, BOOM! It explodes on final impact.\n\n               The boys all look at each other and shrug. Hawk walks back \n               to the Volvo and gets in. Trip, Lex, and Jam follow suit and \n               pile in as well. Lex shouts back to Barbara.\n\n<b>                                     LEX\n</b>                         Oh, thanks for letting us draw from \n                         your ample make-up supply. You must \n                         have the entire Revlon factory in \n                         your purse!\n\n<b>               ANGLE ON KENNY, BOBBY, AND BARBARA.\n</b>\n               We now see them from the front. Lo-and-behold, Kenny has \n               been made-up like Gene Simmons, Bobby like Paul Stanley.  \n               Whoever finds them is gonna get the wrong idea about their \n               musical taste... and kick their asses all over again.\n\n<b>                                     BARBARA\n</b>                         Very funny. I hope you choke!\n\n<b>                                     STELLA ON BOARD\n</b>\n<b>               INT. VOLVO - DAY\n</b>\n               Hawk starts the engine and takes off. Trip pulls a baggie of \n               weed and some rolling papers out.\n\n<b>                                     JAM\n</b>                         Hey, look, it's that girl.\n\n               Jam points out at the road ahead to Christine. She's a few \n               hundred feet away walking sadly in the breakdown lane.\n\n<b>                                     TRIP\n</b>                         That's no girl. That's a stella.\n\n<b>                                     JAM\n</b>                         Stella or no stella, we should pull \n                         over and help her out.\n\n<b>                                     HAWK\n</b>                         Oh no, Jam. I'm not falling for that \n                         twice.\n\n<b>                                     JAM\n</b>                         Well, couldn't you slow down so I \n                         can at least state my case, Hawk? If \n                         you don't like it, you can speed up \n                         and I'll never mention it again.\n\n               Hawk slows down, turning into the breakdown lane, travelling \n               about two miles per hour. Christine doesn't notice as they \n               edge closer to her.\n\n<b>                                     LEX\n</b>                         What is it with you, Jam? You got a \n                         thing for that... thing?\n\n<b>                                     JAM\n</b>                         She's a teenage girl walking on the \n                         side of the highway. They make very \n                         scary movies that start out like \n                         that.\n\n<b>                                     HAWK\n</b>                         Well, they may not make movies about \n                         four dudes going to a KISS concert. \n                         But if they ever did, the four dudes \n                         most certainly would not stop and \n                         pick up a stranded disco bunny.\n\n               Pause.\n\n<b>                                     TRIP\n</b>                         Unless there was gonna be a scene \n                         where the disco bunny blows the four \n                         dudes on the way to the show.\n\n<b>               INT. VOLVO - DAY\n</b>\n               Christine sits between Jam and Lex in the back SNAPPING gum.  \n               Jam and Lex stare at her like cats looking at a fish bowl.\n\n               Hawk looks in the rearview mirror at Christine checking \n               herself in a compact. She swathes on some 7-Up flavored, \n               Bonnie Bell lip gloss.\n\n               Trip meanwhile twirls the joint he's just finished rolling \n               in his mouth, sealing it. He winks at her disgustingly.\n\n<b>                                     CHRISTINE\n</b>                         Oh, great. I just hitched a ride \n                         with a bunch of potheads... I'm \n                         hooking up with some people at this \n                         funky place in downtown Detroit called \n                         Disco Inferno. Mind droppin' me there?\n\n<b>                                     TRIP\n</b>                              (smirks)\n                         What's it worth to you?\n\n<b>                                     CHRISTINE\n</b>                              (grossed out)\n                         What the hell is that supposed to \n                         mean?\n\n<b>                                     JAM\n</b>                         It doesn't mean anything. Don't pay \n                         attention to him.\n\n<b>                                     HAWK\n</b>                              (rolls his eyes)\n                         Disco Inferno? Disco's infernal \n                         morelike.\n\n               Trying to be suave, Lex moves in close, putting the make on \n               her.\n\n<b>                                     LEX\n</b>                         Your clothes may say disco, but your \n                         eyes say rock 'n' roll, baby.\n\n<b>                                     CHRISTINE\n</b>                         Well, your tee-shirt may say rock \n                         'n' roll, but your breath says \n                         pepperoni, baby.\n\n               She pushes him away. Jam laughs.\n\n<b>                                     TRIP\n</b>                              (frustrated)\n                         So, are you, like, gonna polish our \n                         nobs, or what?\n\n<b>                                     CHRISTINE\n</b>                              (thoroughly offended)\n                         What? That's disgusting!\n\n<b>                                     JAM\n</b>                         Trip! That's so fuckin' rude, man.\n\n<b>                                     TRIP\n</b>                         Oh, quit bein' the wussy, sensitive \n                         guy to impress her, Jam. She's \n                         obviously not gonna put out. She's a \n                         fuckin' tease.\n\n<b>                                     CHRISTINE\n</b>                         Tease? What the hell did I do to \n                         tease you mongoloids?\n\n<b>                                     TRIP\n</b>                         You got in the car, didn't you?\n\n<b>                                     CHRISTINE\n</b>                         Oh, God, how calculating of me to \n                         lead you all on like that after you \n                         offered me a ride in the middle of \n                         nowhere.\n\n<b>                                     TRIP\n</b>                         Whatever... stella.\n\n               Trip lights the joint and takes a lungful of pot. He passes \n               it to Lex and the joint begins to make its rounds with the \n               exception of Christine. The car starts to fill with smoke.\n\n<b>                                     CHRISTINE\n</b>                         The name's Christine, not stella.  \n                         And there's no need to be such pigs \n                         just cause I prefer Donna Summer or \n                         KC and the Sunshine Boys or the \n                         Village People over KISS?\n\n<b>                                     HAWK\n</b>                              (with disdain)\n                         The Village People? They're fags! \n                         You're a fag hag!\n\n<b>                                     JAM\n</b>                         Come on, Hawk.\n\n<b>                                     CHRISTINE\n</b>                         I can take care of myself, but thanks \n                         anyway, germ.\n\n<b>                                     JAM\n</b>                         Jam.\n\n<b>                                     CHRISTINE\n</b>                         Whatever.\n                              (to Hawk)\n                         Okay, Joe Burnout, let's get one \n                         thing straight here. As far as I'm \n                         concerned good tunes is good tunes, \n                         be it disco or rock or polka or \n                         whatever have you, regardless of the \n                         category. True, if I had to choose, \n                         I'd pick the category labelled disco \n                         because I happen to enjoy dancing. \n                         Disco is just easier to dance to.\n\n<b>                                     HAWK\n</b>                         You call that John Travolta/Denny \n                         Terio shit dancing? I wouldn't dance \n                         like that in private if you paid me.\n\n<b>                                     TRIP\n</b>                         Disco blows dogs for quarters.\n\n               Christine processes this remark.\n\n<b>                                     CHRISTINE\n</b>                         Now there's an intelligently biting \n                         remark wrought with wit and irony.\n\n               Trip looks confused, then smiles thinking she paid him a \n               compliment.\n\n<b>                                     HAWK\n</b>                         Hey, if you don't like that one, \n                         maybe you'll think it's funny when \n                         we throw your ass out the goddamn \n                         car!\n\n<b>                                     CHRISTINE\n</b>                         Yeah, why don't you put your money \n                         where your mouth is?\n\n<b>                                     HAWK\n</b>                         Why don't you kiss my hairy crack?\n\n<b>                                     CHRISTINE\n</b>                         Why don't you bend over, you're \n                         looking right at it!\n\n               All, Christine included, pause to think about what that \n               comment was supposed to mean. Lex takes a hit off the joint.\n\n<b>                                     LEX\n</b>                              (holding in smoke)\n                         That last remark fell about 30 yards \n                         away from making any sense whatsoever.\n\n               Hawk and Trip immediately bust into the giggles and it doesn't \n               take long for Lex and Jam to follow suit.\n\n<b>                                     CHRISTINE\n</b>                              (realization)\n                         Hey, you're right. \"Bend over you're \n                         looking right at it?!\"\n                              (starts to laugh)\n                         What's that supposed to mean anyway?\n\n               Christine succumbs to the contagious giggle epidemic and the \n               whole car gets a great laugh for a while.\n\n               They finally calm down again and wipe tears from their eyes.  \n               Lex still has the joint now as Christine looks at it.\n\n<b>                                     CHRISTINE\n</b>                         Man, this is some kickass shit!\n                              (beat)\n                         Gimme a hit off that jay will ya?\n\n               Lex smiles despite himself and holds the weed out to her as \n               we...\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>                             HELLO DETROIT, GOODBYE TICKETS!\n</b>\n<b>               MONTAGE\n</b>\n               The Volvo passing a big sign that says: \"Welcome to Michigan, \n               the Great Lakes State.\"\n\n               The Volvo racing toward the Detroit skyline.\n\n               Detroit landmarks: The General Motors Building, the Ford \n               Building, Motown Records, and finally...\n\n               COBO HALL, where thousands of fans in KISS tees gather, \n               waiting for its doors to open.\n\n               Unbelievable traffic stretches to an intersection at which \n               stand four key landmarks... a cathedral, a convenience store, \n               a parking lot, and a male strip joint. They face one another, \n               each on its own corner.\n\n               A gigantic sign on the auditorium's facade flashes the \n               commandment, \"YOU GOTTA LOSE YOUR MIND IN DETROIT ROCK CITY\" \n               over and over again.\n\n<b>               EXT. COBO HALL - SUNSET\n</b>\n               The sun hangs low on this day as the Volvo sits in traffic, \n               passing Cobo Hall. Movement is nearly impossible.\n\n               KISS FANS cram every square foot of open macadam, pushing \n               through the jammed cars. STREET VENDORS hawk KISS souvenirs \n               from tee-shirts to pennants. Some are in stands along the \n               sidewalk. Others come right up to car windows.\n\n<b>               INT. VOLVO - SUNSET\n</b>\n               Christine is fast asleep between Jam and Lex.\n\n<b>                                     LEX\n</b>                         Man, that weed knocked Christine on \n                         her ass. She's sleeping like a baby \n                         stella.\n\n<b>                                     TRIP\n</b>                              (whispers lustfully)\n                         Let's lift up her shirt.\n\n<b>                                     HAWK\n</b>                              (pointing out \n                              windshield)\n                         There it is!\n\n               All look ahead. COBO Hall. A HALO GLOW forms around the \n               building accompanied by a CHOIR OF ANGELS.\n\n<b>                                     JAM\n</b>                              (in reverence)\n                         We made it!\n\n<b>                                     LEX\n</b>                         Curly driving, Hawk. We still got \n                         two hours to spare.\n\n<b>                                     HAWK\n</b>                         Ample time to grab our tickets at \n                         the station. See, up ahead. W.A.R.P.\n\n               One block on the left is the W.A.R.P. tower.\n\n<b>                                     HAWK\n</b>                         Hey, Look at the front entrance! A \n                         car's pulling out. The parking space \n                         from heaven. God is surely smiling \n                         down upon us tonight, dudes.\n\n<b>                                     JAM\n</b>                         Kind of funny, I thought He'd be \n                         pissed as hell at me.\n\n               The opening to the Carpenters' \"TOP OF THE WORLD\" begins.\n\n<b>               INT. W.A.R.P. TOWER ELEVATOR - NIGHT\n</b>\n               \"TOP OF THE WORLD\" continues, playing through the speaker of \n               the ascending elevator inside which Hawk, Trip, Lex, and Jam \n               stand. They watch the numbers climb, smiling.\n\n<b>                                     HAWK\n</b>                         What was that D.J.'s name again?\n\n<b>                                     TRIP\n</b>                         Oh, I'll remember it till the day I \n                         die. His name was... Simpleton the \n                         Simian? No, Samson Samoan... No, \n                         simply, similar...\n\n<b>               INT. SIMPLE SIMON'S OFFICE - NIGHT\n</b>\n               Hawk, Trip, Lex, and Jam poke their heads around the corner \n               of an office doorway totem pole-style.\n\n<b>                                     HAWK\n</b>                         Simple Simon?\n\n               SIMPLE SIMON strikes a pose before a full-length mirror in a \n               glittery-back Gene Simmons tee-shirt, silver pants, and very \n               high heel boots. He has a huge Afro and bushy moustache. He \n               turns when he hears Hawk.\n\n<b>                                     SIMPLE SIMON\n</b>                         The one and only. But can you kids \n                         hurry this up? I'm due at Coco Hall \n                         in half an hour for the warm-up.\n\n               They all enter and stand at Simple Simon's desk.\n\n<b>                                     HAWK\n</b>                         We're right behind you, Simo. Just \n                         wanted to thank you in advance for \n                         handing over those burly-ass tix me \n                         and my buds won this morning.\n\n               The boys do a Three Stooges handshake and say \"Curly!\" Simple \n               Simon on the other hand suddenly appears nonplussed\n\n<b>                                     SIMPLE SIMON\n</b>                         Your name isn't Trip is it?\n\n<b>               INT. PRODUCER'S BOOTH - NIGHT\n</b>\n               Hawk, Trip, Lex, and Jam sit in the tiny producer's booth \n               with Simon who fast forwards a reel-to-reel tape through \n               some very loud, high-speed conversation and bits of music.\n\n               Looking at the footage counter on the tape player, he slows \n               down at a certain point and lets the boys listen to this: \n               The CLICK of a phone being answered.\n\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                         Simple Simon on the Rock, go caller.\n\n<b>                                     TRIP'S VOICE\n</b>                         Hello? Is this me? I'm Trip. Am I on \n                         the air?\n\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                         I should hang up on you right now, \n                         but you're the right caller so answer \n                         quick or get your battleship sunk. \n                         What are the names of the four members \n                         of KISS?\n\n<b>                                     TRIP'S VOICE\n</b>                         Gene Klein, Stanley Eisen, Paul \n                         Frehley, and Peter...Criscula! Yeah, \n                         that's it!\n\n               Pause.\n\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                         Is that your final answer?\n\n<b>                                     TRIP'S VOICE\n</b>                              (with trepidation)\n                         Yeah.\n\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                              (building to crescendo)\n                         Trip? You just got yourself four \n                         tickets and four backstage passes to \n                         KISS live at Cobo Hall tonight!\n\n               Pause.\n\n<b>                                     TRIP'S VOICE\n</b>                         I did?\n\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                         Yeah, you did!\n\n<b>                                     TRIP'S VOICE\n</b>                         Yeeeehaaawww!! This is totally fuckin' \n                         curly, man! Thank you God!\n\n<b>               CLI-CLICK.\n</b>\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                         Whoa, easy, Trip, this is radio, not \n                         \"Taxi Driver.\" Now listen up cause \n                         this next part is crucial. Stay on \n                         the line so we can get your full \n                         name, information, and...\n\n<b>               DIAL TONE.\n</b>\n<b>                                     SIMPLE SIMON'S VOICE\n</b>                         Trip? Trip? Oh, man, you didn't hang \n                         up on me did you? Trip?\n                              (beat)\n                         What kind of total moron would \n                         hang...?\n\n               Simple Simon stops the tape and looks at the boys who look \n               like they've just been served a life sentence behind bars.\n\n<b>                                     SIMPLE SIMON\n</b>                         Well, there you have it. We had no \n                         choice but to give the tickets to \n                         the next caller. I'm sorry.\n\n               Hawk, Trip, Lex, and Jam stare at the floor in silence.\n\n<b>                                     SIMPLE SIMON\n</b>                         We got sodas in the fridge if that \n                         helps any.\n\n<b>               INT. W.A.R.P. TOWER ELEVATOR - NIGHT\n</b>\n               Hawk, Trip, Lex, and Jam ride back down the elevator sipping \n               NeHi sodas, watching the floor numbers get lower and lower. \n               Terry Jack's immortal hit \"SEASONS IN THE SUN\" plays over \n               the elevator speaker.\n\n<b>                                     HAWK\n</b>                         Well, here we are, dudes. One hour \n                         and thirty minutes away from the \n                         concert of the century... ticketless. \n                         All thanks to Wile E. Coyote, Super- \n                         Fucking Genius over here.\n\n               Trip looks away from the rest, ashamed.\n\n<b>                                     LEX\n</b>                         Really, Trip, can we bore holes in \n                         your head and use it as a bong so it \n                         actually does us some good for a \n                         change?\n\n<b>                                     TRIP\n</b>                         Fuck you, Lex! This whole thing \n                         wouldn't have happened if it wasn't \n                         for you jinxing us. I just made an \n                         honest mistake.\n\n<b>                                     HAWK\n</b>                         Oh, I'm sorry, Trip. What you made \n                         was a big, brainless, pile of horse \n                         shit. No offense.\n\n<b>                                     JAM\n</b>                         Guys, GUYS! Come on, if this is \n                         anyone's fault, it's mine. I was the \n                         one who grabbed Trip's jacket by \n                         mistake. It's my fault and I \n                         apologize.\n\n<b>                                     HAWK\n</b>                         Please, Jam, we're trying to vent \n                         some hostility here. Sure the whole \n                         thing may be your fault, but who's \n                         gonna get pissed off at you?\n\n               Jam looks at his feet.\n\n<b>                                     JAM\n</b>                         Sometimes I think I don't deserve \n                         friends as good as you guys.\n\n               Hawk, Trip, and Lex cringe.\n\n<b>                                     HAWK\n</b>                         I have one question. How could a kid \n                         who wails on the drums like it's the \n                         only thing keeping him alive even \n                         think of such a femmy thing to say?\n\n<b>                                     TRIP\n</b>                         Really, Jam, you tryin' to make us \n                         barf?\n\n<b>                                     LEX\n</b>                         Yeah, it's like you're possessed by \n                         The Flying Nun, or something.\n\n               The doors to the elevator open and the boys step out.\n\n<b>                                    SHAKE YOUR WEEWEE!\n</b>\n<b>               EXT. W.A.R.P. TOWER - NIGHT\n</b>\n               COBO Hall looms up ahead.\n\n               Hawk, Trip, Lex, and Jam enter the sidewalk. A thickening \n               CROWD of KISS fans continually meander by.\n\n               On their way to the car, they suddenly hear a WOMAN'S VOICE \n               bellowing through a megaphone from somewhere down the street.  \n               After a moment they see the voice's source.\n\n               A GROUP OF WOMEN has congregated about forty feet ahead and \n               their LEADER, her back toward the boys, yells to the group \n               through her bullhorn. Flying above them all is a large banner \n               reading: \"MATMOK, Mothers Against The Music Of KISS.\"\n\n<b>                                     LEADER\n</b>                         Welcome to the first open meeting of \n                         MATMOK, Mothers Against The Music Of \n<b>                         KISS!\"\n</b>\n               The group cheers as the KISS FANS milling around them pretty \n               much ignore the whole MATMOK spectacle.\n\n               Lex looks away from the MATMOKS and into the street. We can't \n               see what he sees, but we can tell he's alarmed.\n\n<b>                                     LEX\n</b>                         Uh... dudes?\n\n<b>                                     HAWK\n</b>                              (ignoring Lex)\n                         Now there's a woman who totally abuses \n                         the privilege of motherhood.\n\n<b>                                     LEX\n</b><b>                         DUDES!\n</b>\n               They all look at Lex.\n\n<b>                                     LEX\n</b>                              (eyes focused ahead)\n                         Where's the Volvo?\n\n               Hawk, Trip, and Jam look at their parking spot to see a beat-\n               up Dodge Dart sitting there instead of the Volvo.\n\n<b>                                     TRIP\n</b>                         It's gone.\n\n<b>                                     LEX\n</b>                         I can see that, bright boy. What \n                         happened to it?\n\n<b>                                     JAM\n</b>                         It was stolen!\n\n<b>                                     HAWK\n</b>                              (incredulous)\n                         Christine stole it! Asleep, my ass! \n                         The stella booted with your mom's \n                         wheels.\n\n<b>                                     LEX\n</b>                         But we took the keys?\n\n<b>                                     TRIP\n</b>                         Damn, she musta hot wired it. We \n                         picked up a professional car thief \n                         in the shape of Olivia Newton-John!\n\n<b>                                     LEX\n</b>                         Okay, I'm just a little mad now! \n                         Jam, why'd you talk us into picking \n                         that bitch up in the first place!?\n\n<b>                                     JAM\n</b>                         I'm sorry, guys. I thought it was a \n                         nice thing to do.\n\n<b>                                     HAWK\n</b>                         Jam, not another word out of your \n                         femmy-ass mouth! Okay, we're here, \n                         we got nothing, and we got an hour \n                         and a half. We're totally committed. \n                         It's time to brainstorm.\n\n<b>                                     LEX\n</b>                         Here's a suggestion. Let's stop \n                         worrying about the concert for the \n                         time being and get the cops in on \n                         this Volvo situation.\n\n<b>                                     HAWK\n</b>                         Wake up, Lex. This is Detroit. The \n                         cops aren't gonna waste city dollars \n                         looking for a Swedish car. Face it, \n                         the Volvo's on a cutting board as we \n                         speak getting sliced, diced, and \n                         julienned by Christine, the chop \n                         shop gourmet.\n\n               Lex is developing a look of resolve. This is Detroit!\n\n<b>                                     HAWK\n</b>                         Now listen up. Here's the game plan.\n\n<b>                                     LEX\n</b>                              (on a roll)\n                         ...I mean, my mom's got insurance. \n                         What's the worst thing she could do?  \n                         Ground me for the entire year? I can \n                         handle that...\n\n<b>                                     HAWK\n</b>                         Cool, bro, now listen up...\n\n<b>                                     LEX\n</b>                         ...Holy shit! I am in absolute \n                         trouble! I never should have let you \n                         drive, man! Absolute fuckin' trouble!\n\n<b>                                     HAWK\n</b>                         Okay, shut the fuck up, Lex! Now, \n                         then, step number one, we find us a \n                         scalper. I got...\n                              (takes out KISS money \n                              clip)\n                         twenty-five.\n\n<b>                                     TRIP\n</b>                         Twenty-five more'n I got.\n\n<b>                                     LEX\n</b>                         All I got is five. The rest is in \n                         the Volvo.\n\n<b>                                     JAM\n</b>                         I got...\n\n<b>                                     HAWK\n</b>                         Uh-uh. Don't tell us, Jam. Just show \n                         us.\n\n               Jam holds up a ten keeping his mouth shut.\n\n<b>                                     HAWK\n</b>                         So maybe we got enough for one ticket.  \n                         Fuck!\n\n<b>                                     TRIP\n</b>                         Waitaminit, dudes! I got it! We find \n                         four really small kids, beat the \n                         shit outta them and steal their \n                         tickets. What do you think?\n\n<b>                                     HAWK\n</b>                              (sarcastic)\n                         Brilliance, Trip. Sheer brilliance. \n                         Give Albert Einstein here the Nobel \n                         Prize.\n\n               Trip smiles proudly.\n\n<b>                                     LEX\n</b>                         I think we should try sneaking in.\n\n<b>                                     HAWK\n</b>                         Four dudes sneaking in? We'd get \n                         busted fer sure. Bad plan.\n\n<b>                                     LEX\n</b>                         Okay, one of us sneaks in, gets four \n                         ticket stubs off some kids in the \n                         audience, comes back out, and we all \n                         \"re-enter\" the concerto. Voila!\n\n<b>                                     HAWK\n</b>                         Still too risky for my money.\n                              (looking at watch)\n                         We're running out of time here. This \n                         is KISS! A victory for one is a \n                         victory for the team. I'm sure I can \n                         barter with a scalper, but if you \n                         dudes think you got better plans, go \n                         for it. We'll reconvene at that \n                         intersection...\n\n               Hawk points to the intersection where the church, the male \n               strip joint, the parking lot, and the Smiley Mart are located.\n\n<b>                                     HAWK\n</b>                         ...at twenty-thirty hours.\n\n<b>                                     TRIP\n</b>                         One more time in English.\n\n<b>                                     HAWK\n</b>                         For the next hour and a half it's \n                         every dude for himself. Try to get \n                         at least one ticket and at 8:30 P.M. \n                         we'll meet over there.\n\n<b>                                     JAM\n</b>                              (inspired)\n                         Wait! I know how we can get in!\n\n<b>                                     HAWK\n</b>                         Jam, shut-up! You're not allowed to \n                         speak, remember? Go use whatever \n                         femmy idea you have to get yourself \n                         a ticket or four. I don't wanna hear \n                         it.\n\n<b>                                     JAM\n</b>                              (sadly)\n                         But... my plan involves all four of \n                         us acting together.\n\n<b>                                     HAWK\n</b>                         See you at 8:30, Jam. Later.\n                              (to Lex and Trip)\n                         Dudes? Later.\n\n               Hawk, Trip, and Lex split up, leaving Jam alone. He starts \n               walking in the opposite direction, passing MATMOKS. The leader \n               is still on a roll, yelling through the megaphone.\n\n<b>                                     LEADER\n</b>                         Look around you tonight, mothers!  \n                         Look at all the young faces! They \n                         smile and laugh but their eyes have \n                         lost all hope! Not one among them \n                         appears to possess the love and fear \n                         of God... This satanic group KISS \n                         has stolen their souls.\n\n               The leader's gaze finally falls upon Jam. He lets out a GASP. \n               Yes, the leader is Mrs. Bruce. So this was her church meeting.\n\n               She freezes when she sees her son; her jaw slackens. Meanwhile \n               Jam looks stunned beyond comprehension.\n\n<b>                                     JAM\n</b>                         Oh... dear... Lord!!\n\n               Mrs. Bruce quickly hands the megaphone to another MATMOK \n               member, who picks up where Mrs. Bruce left off.\n\n               Jam looks around for someplace to run and hide, but it's too \n               late. Mrs. Bruce slices through the crowd of KISS fans and \n               grabs Jam by the ear. He yelps.\n\n<b>                                     MRS. BRUCE\n</b>                         I don't know how you got here tonight \n                         and I don't want to know either. All \n                         I know is you're going to pay dearly \n                         for this one, young man!\n\n<b>               EXT. ST., SEBASTIAN'S CATHEDRAL - NIGHT\n</b>\n               Mrs. Bruce tugs Jam toward the intersection we saw before.  \n               They cross the street toward the corner where the Cathedral \n               sits.\n\n               Jam looks up at the cross on the steeple and GULPS with \n               trepidation.\n\n<b>                                     JAM\n</b>                         Mom, what're we...?\n\n<b>                                     MRS. BRUCE\n</b>                         Just keep your lying, heathenous \n                         trap shut, Jeremiah.\n\n               They climb the steps to the cathedral passing a bulletin \n               board reading: Thank God It's Friday Mass, 6PM-7PM.\n\n               PARISHIONERS exit the beautiful church, shaking hands with a \n               PRIEST as they leave.\n\n<b>                                     PARISHIONERS\n</b>                         What a wonderful mass, Father/So \n                         inspirational, Father/Thank you.\n\n<b>                                     PRIEST\n</b>                         Thank you/Come again next week.\n\n               Mrs. Bruce pulls Jam up to the priest.\n\n<b>                                     PRIEST\n</b>                         Next mass is tomorrow morning, sister.\n\n<b>                                     MRS. BRUCE\n</b>                         Can we talk, Father? I'm desperate. \n                         My son was about to defy God by going \n                         to that blasphemous KISS concert.\n\n<b>                                     PRIEST\n</b>                         In that case, come right in.\n\n               Meanwhile, across the street...\n\n<b>               EXT. WHITE CASTLE HAMBURGER JOINT - NIGHT\n</b>\n               Parked in front of the busy fast-food establishment we \n               recognize the two-toned Chevy Impala with luggage tied on \n               top. In the window we see Beth and her parents sitting at \n               one of the booths.\n\n               Out the window Beth looks across the street just as Jam, \n               Mrs. Bruce, and the priest enter the cathedral. Her face \n               drops.\n\n<b>                                     BETH\n</b>                         Oh my God! That's Jeremiah!\n\n<b>                                     DAD\n</b>                         Who?\n\n<b>                                     BETH\n</b>                         Jeremiah Bruce from school. He and \n                         his mom just went into that church. \n                         He must be in Detroit for the concert. \n                         Can I go say good-bye to him?\n\n<b>                                     MOM\n</b>                         Beth, I am not letting you wander \n                         the streets of Detroit after dark.\n\n<b>                                     BETH\n</b>                         I'm not going to wander. I'm just \n                         gonna go over there.\n\n               Beth points to St. Sebastian's.\n\n<b>                                     BETH\n</b>                         He's with his mom.\n\n<b>                                     DAD\n</b>                         Fine, as long as we know where you \n                         are. But don't be long. We need to \n                         be getting back on the road.\n\n               Beth is already out the door and halfway across the street.  \n               Dad pats mom's shoulder.\n\n<b>                                     DAD\n</b>                         She's probably got a little crush on \n                         that boy.\n\n<b>               EXT. ST. SEBASTIAN'S CATHEDRAL - NIGHT\n</b>\n               Beth runs up to the cathedral and sneaks in.\n\n<b>               EXT. IT'S RAINING MEN STRIP JOINT - NIGHT\n</b>\n               Hawk walks down the sidewalk badgering everyone passing by \n               for a ticket, getting the same stock answer: \"Suffer, dude!\"\n\n               He stops and sits on a curb, lighting a cigarette. Behind \n               him stands the marquee for IT'S RAINING MEN, the male strip \n               joint. A DISCO SONG comes from inside. Just when it looks \n               like Hawk's given up, a VOICE is heard above.\n\n<b>                                     VOICE\n</b>                         Hey, chief? Need a ticket?\n\n               Hawk can't believe his ears. He looks up at a greasy-looking \n               hybrid, part porn star, part used car salesman, the SCALPER.\n\n<b>                                     SCALPER\n</b>                         Second row center, seventy-five clams.\n\n               Trying to act confident, Hawk takes out his money clip showing \n               the scalper twenty-five dollars.\n\n<b>                                     HAWK\n</b>                         Dude, this is all I got.\n\n<b>                                     SCALPER\n</b>                         Sorry, man, no can do. But I'll be \n                         here for a while if you scare up the \n                         extra gravy.\n\n<b>                                     HAWK\n</b>                         Where the hell am I gonna scare up \n                         that kinda gravy in one hour?\n\n<b>                                     SCALPER\n</b>                         The easy way.\n\n               The scalper points over his shoulder and Hawk turns to see \n               three GIGGLING WOMEN exiting the strip joint. None are under \n               forty.\n\n               A sign below the bar's logo reads: Amateur Night Giveaway!  \n               Guys Over 18 Only! Bare It All And Win 75 Bucks!\n\n<b>                                     SCALPER\n</b>                         You look a little scrawny, but it's \n                         worth a shot.\n\n<b>                                     HAWK\n</b>                         I can't just walk in and take my \n                         clothes off. It's embarrasskin.\n\n<b>                                     SCALPER\n</b>                         Guess you don't want to see the \n                         greatest show on earth. And in Detroit \n                         no less. Well, take care, chief.\n\n               The scalper turns and Hawk grabs his arm.\n\n<b>                                     HAWK\n</b>                         Dude, if it were dancing the way \n                         Fred Astaire did it, I'd give it my \n                         best shot. I'd learn the steps and \n                         practice in my spare time. But this... \n                         tribal, ritualistic bullshit, it's \n                         way-too-spontaneous for me.\n\n<b>                                     SCALPER\n</b>                         Yeah, you're probably too young \n                         anyhow.\n\n<b>                                     HAWK\n</b>                         Hey, I invented fake I.D.s, alright.  \n                         That's not the problem... They're \n                         playing disco music in there, man.\n\n<b>                                     SCALPER\n</b>                         Chief, here's a little secret. Drink \n                         heavily, your feet will know what to \n                         do. Now shit or get off the pot. Do \n                         you wanna dance or do you wanna see \n                         KISS only on their album covers?\n\n               Hawk gets a look of resolve on his face.\n\n<b>                                     SCALPER\n</b>                         You sure you'll have a ticket for \n                         me?\n\n<b>                                     SCALPER\n</b>                         You have my solemn oath as a public \n                         servant.\n\n               Hawk turns and walks up to the door, hesitating before opening \n               it. Rummaging through his pockets, he pulls out a handful of \n               expired driver's licenses.\n\n               Choosing the one he thinks best suits himself, he walks in \n               with trepidation. The scalper sees someone else coming up.\n\n<b>                                     SCALPER\n</b>                         Hey, chief, you need a ticket? Second \n                         row center, seventy-five clams.\n\n               It's Trip.\n\n<b>                                     TRIP\n</b>                         No thanks, dude. I'm beating my ticket \n                         out of some poor, defenseless chump.\n\n               Trip exits FRAME.\n\n<b>                                     SCALPER\n</b>                         What's happening to kids today?\n\n<b>               INT. IT'S RAINING MEN STRIP JOINT - NIGHT\n</b>\n               Hawk enters your average, everyday, male strip joint. A crowd \n               of LUSTY WOMEN cheer on a STRIPPER IN A FIREMAN'S SUIT. He \n               dances on a lighted, tile stage under a spinning, mirror \n               ball.\n\n               Hawk shows the MAN AT THE DOOR his fake license and the man \n               nods him in. He approaches the bar in the early stages of \n               being very intimidated.\n\n               The BARTENDER, a man dressed only in tight, black, tuxedo \n               pants, shirt cuffs, and a tie, comes up to Hawk.\n\n<b>                                     HAWK\n</b>                              (voice cracking)\n                         Like to sign up for the contest.\n\n               The bartender gives Hawk the once over.\n\n<b>                                     BARTENDER\n</b>                         You're a little scrawny, but thanks \n                         to the concert we're low on amateurs. \n                         Name?\n\n<b>                                     HAWK\n</b>                         Hawk.\n\n<b>                                     BARTENDER\n</b>                         Pick a song, Hawk.\n\n<b>                                     HAWK\n</b>                         Got any KISS?\n\n<b>                                     BARTENDER\n</b>                         You kidding? This is Detroit. Drink?\n\n<b>                                     HAWK\n</b>                         Yeah, a man's drink...\n\n               Hawk squints at a name tag on the bartender's tie.\n\n<b>                                     HAWK\n</b>                         ...Dickey.\n\n               Dickey goes to the bottle rack on the other side of the bar.\n\n<b>                                     HAWK\n</b>                              (to himself)\n                         I'm gonna need all the help I can \n                         get tonight.\n\n               Dickey returns with the drink and Hawk pulls out his money \n               clip.\n\n<b>                                     HAWK\n</b>                              (looking at the drink)\n                         What's that?\n\n<b>                                     BARTENDER\n</b>                         You mean you never seen a Jack Daniels \n                         on the rocks before?\n\n               Hawk looks at the unfamiliar drink again trying to play it \n               cool.\n\n<b>                                     HAWK\n</b>                         Sure, I have. But not one with ice \n                         in it, that's all.\n\n<b>                                     BARTENDER\n</b>                              (seeing money clip)\n                         Save your money, stud muffin. The \n                         lady at the end of the bar sends her \n                         love.\n\n               Dickey points to a WOMAN sitting at the end of the bar. Mature \n               and sexy. She's a knock-out. Every teenage boy's fantasy. \n               Hawk's eyes pop at this \"Mrs. Robinson\" before him.\n\n<b>                                     HAWK\n</b>                         Whoa... she is a killer.\n\n<b>                                     BARTENDER\n</b>                         Amanda Finch. Her ex is one of the \n                         wealthiest businessmen in Detroit. \n                         Play your cards right and you could \n                         hit paydirt. She like 'em young.\n                              (leaning in)\n                         And since you look a little new at \n                         this, let me give you three words of \n                         advice. Hard to get. Think it, act \n                         it, know it, be it. Nothing a woman \n                         loves more than when you beat her at \n                         her own head games.\n\n               Dicky pats Hawk's shoulder and leaves. Hawk looks away from \n               Amanda and scans the room. He glances back at Amanda. She's \n               still gazing at him the way queens of yore must have eyed \n               particularly cute knights. She winks and toasts Hawk.\n\n               Hawk raises his glass smiling nervously. They both sip at \n               their drinks. She licks her lips suggestively at him. And, \n               Hawk proceeds to COUGH up his mouthful of Jack Daniels, \n               SPRAYING it all over the bar.\n\n<b>                                SMILEY MART / HAULING BASS\n</b>\n<b>               EXT. SMILEY MART - NIGHT\n</b>\n               Your typical 70's convenient store. Out front two SIX YEAR \n               OLDS in Star Wars tee-shirts play tug-o-war with a Stretch \n               Armstrong doll.\n\n               Trip stomps over grabbing them by their mini shirts. When he \n               tries to act tough, it's pathetic. Even six year olds aren't \n               afraid.\n\n<b>                                     TRIP\n</b>                         Hey, you little twerps, gimme your \n                         KISS tickets or I'll pop your fuckin' \n                         faces in.\n\n<b>                                     SIX YEAR OLD #1\n</b>                         We don't have any KISS tickets.\n\n<b>                                     SIX YEAR OLD #2\n</b>                         Yeah, KISS sucks!\n\n<b>                                     TRIP\n</b>                         I oughta kick your asses for sayin' \n                         that.\n\n               He grabs the Stretch Armstrong and stuffs it in his pocket.\n\n<b>                                     TRIP\n</b>                         But I'm in a hurry so I'll just take \n                         this instead. Now scram.\n\n               The kids run away.\n\n<b>               INT. SMILEY MART - NIGHT\n</b>\n               The store is crawling with KISS FANS, some reading the comic \n               books, others playing pinball against a far wall, still others \n               looking at the poster section. Trip enters on a mission.\n\n               He looks around catching the eye of a pretty CASHIER. She's \n               a rocker, wearing a Who tee-shirt, a mood ring, and just a \n               little too much make-up. She smiles at him. Trip returns the \n               smile with a feeble wave. Her mood ring turns from blue to \n               pink.\n\n               Concentrating on the layout of the store, Trip peers all the \n               way to the back to a darkened corner... where he spies a \n               LITTLE KID wearing a KISS tee-shirt playing a KISS pinball \n               machine.\n\n               Trip smiles. The eagle has spotted a fuzzy, little bunny. He \n               moves in for the kill, walking past a crowd of kids at the \n               magazine rack, past the Hostess aisle, past the dairy cooler \n               and into the darkened corner.\n\n               He stands behind the little kid, relishing this moment. The \n               kid is actually pretty good. We also see now the little kid \n               has his face painted like Ace Frehley.\n\n<b>                                     TRIP\n</b>                         Hey, little kid.\n\n               Suddenly distracted, the kid loses the ball.\n\n<b>                                     LITTLE KID\n</b>                         Shit! You just skunked my last ball, \n                         you...\n\n               Trip clamps a hand over the little kid's mouth.\n\n<b>                                     TRIP\n</b>                         Okay, booger, your KISS ticket or \n                         your life.\n\n               The little kid says something but Trip's hand muffles his \n               words.\n\n<b>                                     TRIP\n</b>                         Hunh?\n\n               The kid says what he said before, but it is utterly \n               incomprehensible, once again thanks to Trip's hand.\n\n<b>                                     TRIP\n</b>                              (looking at his hand)\n                         Oh. Okay... But scream and you'll \n                         never live to see puberty. I'll pop \n                         your fuckin' face in.\n\n               Trip pulls his hand away.\n\n<b>                                     LITTLE KID\n</b>                         Please sir, don't beat me up. I do \n                         have a KISS ticket, but not on me.\n\n<b>                                     TRIP\n</b>                         A likely story. Hand it over, kid.\n\n<b>                                     LITTLE KID\n</b>                              (bottom lip quivering)\n                         No really. My brother's hanging onto \n                         it for safe keeping. Please, let me \n                         get him for you.\n\n               The kid turns and yells into the store before Trip can stop \n               him.\n\n<b>                                     LITTLE KID\n</b>                         Hey, Chongo!\n\n               A titanic guy at the comic book rack looks up from his issue \n               of \"Thing\" when he hears his name. CHONGO has a very low \n               forehead and the expression of an angry bull plastered onto \n               his face.\n\n<b>                                     TRIP\n</b>                              (getting scared)\n                         Hey, kid, that's okay. I don't wanna \n                         see KISS that ba...\n\n<b>                                     LITTLE KID\n</b>                         Don't try to run, maggot. Chongo's \n                         an all-state track star in every \n                         event.\n\n<b>                                     TRIP\n</b>                         What do you want?\n\n<b>                                     LITTLE KID\n</b>                              (gleefully)\n                         A tag on your toe. Nobody threatens \n                         me and lives.\n\n<b>                                     TRIP\n</b>                         Look, you can have my wallet...\n\n<b>                                     LITTLE KID\n</b>                         It's not nearly enough, punk.\n\n               Chongo is getting ever-closer with his tree trunk legs, his \n               barrel chest and hydraulic biceps. He is joined by TWO BUDS.\n\n<b>                                     LITTLE KID\n</b>                         Besides, I was gonna take your wallet \n                         anyway. After Chongo and his friends \n                         crush your ribcage like a pack of \n                         Luckys.\n\n               Chongo arrives eyeing Trip with distaste. Trip goes white.\n\n<b>                                     CHONGO\n</b>                         This fairy givin' you shit, bro?\n\n<b>                                     LITTLE KID\n</b>                         He was gonna mug me for my KISS \n                         ticket.\n\n<b>                                     TRIP\n</b>                         Me? Mug? That's nuts. I said, do you \n                         know where I can take a piss.\n\n               Chongo and his two buds laugh. Then, without a second of \n               warning, Chongo belts Trip in the gut. Trip doubles over and \n               falls breathlessly to his knees.\n\n<b>                                     CHONGO\n</b>                         Okay, pimple dick, you've got the \n                         option of walking outside with us or \n                         gettin' dragged out. Either way you're \n                         comin' with us.\n\n               Trip catches his breath.\n\n<b>                                     TRIP\n</b>                         Please, sir, don't kick my ass! I'll \n                         do anything to get out of a beating!\n\n<b>                                     LITTLE KID\n</b>                         Say, Chongo, perhaps we could use \n                         some extra cash for tasty snacks at \n                         the KISS concert our weasly friend \n                         won't be attending.\n\n               Chongo scratches his head.\n\n<b>                                     CHONGO\n</b>                         How much cash do you figure?\n\n<b>                                     LITTLE KID\n</b>                         Take five for a minute, Chongo. Let \n                         me do the math.\n\n               The little kid taps his finger on his chin and the theme \n               from \"JEOPARDY\" begins. While the kid thinks, Trip looks \n               nervously up at Chongo and his buds. Chongo reaches into his \n               denim vest pocket and we hear a CRINKLING NOISE. He comes \n               back up with two walnuts, putting them between his bicep and \n               forearm.\n\n               Trip watches in horror as Chongo makes a muscle and the \n               walnuts are shelled between two walls of iron-hard flesh. \n               CREEEAAAACK! Chongo eats the walnuts, shells and all.\n\n<b>               EXT. PARKING LOT - NIGHT\n</b>\n               The full-to-capacity parking lot is patrolled by a couple of \n<b>               SECURITY GUARDS.\n</b>\n               Lex cautiously makes his way to the edge of the parking lot \n               and looks at the back side of Cobo Hall just beyond the chain \n               link fence that surrounds the lot.\n\n               He crouches down and walks between two cars parked against \n               the fence, looking both ways. Seeing a guard's flashlight \n               beam, he sits stock still until the beam sweeps past, then \n               SIGHS eased.\n\n<b>                                     LEX\n</b>                              (whispering to self)\n                         I can't believe I'm actually \n                         entertaining the notion of sneaking \n                         in. I oughta have my cranium examined.\n\n               Lex finds a vertical break in the chain link. He lays on his \n               back, slides through, then stands on the other side of the \n               fence. He's at the edge of a weedy, littery field that also \n               happens to be poorly lit.\n\n<b>                                     LEX\n</b>                         Whoa. Danger Will Robinson.\n\n               Spooked, he lays down again intending to slide back through \n               when a flashlight beam hits his eyes.\n\n<b>                                     SECURITY GUARD'S VOICE\n</b>                         Hey you! Get back in here!\n\n               Lex sees the guard standing about fifty feet away on the \n               other side of the fence. Panicking, he bolts deeper into the \n               field.\n\n<b>                                     SECURITY GUARD'S VOICE\n</b>                         You're not getting far, kid!\n\n               Lex double-times it as we hear the guard yelling into his \n               walkie-talkie.\n\n<b>                                     SECURITY GUARD'S VOICE\n</b>                         We got one just ran into the field \n                         from the north lot!\n\n               The field gets darker as Lex closes in on Cobo Hall's well-\n               lit loading dock, where ROADIES empty the remaining bits of \n               KISS's monstrous set from an 18-wheeler. Other huge trucks \n               are parked nearby. There's a bustle of last minute activity.\n\n<b>               EXT. LOADING DOCK - NIGHT\n</b>\n               Lex scurries from giant speaker box to a stack of lights to \n               huge trunks, keeping well hidden. He dodges roadies and avoids \n               being seen by OTHER GUARDS.\n\n               He slithers along side the 18-wheeler and nears the loading \n               bay. Up ahead some auxiliary speakers, drum kits, and \n               scaffolding wait their turn to be carried into the building.\n\n<b>                                     SECURITY GUARD'S VOICE\n</b>                         There he is!\n\n               Lex spins. The security guard, flanked by two others, barrel \n               right for him.\n\n<b>                                     LEX\n</b>                         Shit!\n\n               He dives rolls under the 18-wheeler. The three security guards \n               leap for the pavement and crawl under the semi after him.\n\n<b>               ON THE OTHER SIDE OF THE SEMI\n</b>\n               The three guards scramble to their feet and grab a SCRAWNY \n               BODY. They spin him around roughly.\n\n<b>                                     SECURITY GUARD\n</b>                         Alright, wiseguy, you are so outta \n                         here!\n\n               They suddenly realize they've got the wrong man. It's a \n               roadie.\n\n<b>                                     ROADIE\n</b>                         Hey, what the fuck?\n\n               The roadie holds up his all-access laminate angrily.\n\n<b>                                     ROADIE\n</b>                         Keep your paws to yourself, ya dumb \n                         fuckin' apes.\n\n               The security guards look around frantically for Lex as other \n               roadies join in to defend their comrade.\n\n<b>                                     SECURITY GUARD\n</b>                         Where'd he go? You see him?\n\n               No one pays attention as a bass drum is carried past the \n               guards and up the loading dock ramp. They don't notice Lex \n               crammed inside contorted into a shape befitting a yoga master.\n\n               Praying he won't be spotted, Lex holds his breath as he's \n               carried into the building and disappears.\n\n<b>                                 JAM IN A JAM / KISS THIS\n</b>\n<b>               INT. ST. SEBASTIAN'S CATHEDRAL - NIGHT\n</b>\n               Jam sits in the front pew, head buried in his hands as Mrs. \n               Bruce and the priest talk on the alter.\n\n               Beth moves quietly in the back, unseen and unheard. She looks \n               overwhelmed by the architecture, the detail on the stained \n               glass windows, the icons carved into the columns that support \n               the extravagantly decorated ceiling.\n\n               The priest catches a glimpse of Beth meandering in the back.\n\n<b>                                     PRIEST\n</b>                         Uh, next mass isn't until tomorrow \n                         morning, young lady. Run along now.\n\n               Beth smiles nervously and heads back toward the front door \n               passing a confessional booth. She throws a glance back at \n               the priest and Mrs. Bruce who have returned to conferring, \n               their backs to her. She stealthily ducks into the booth.\n\n<b>                                     MRS. BRUCE\n</b>                         Now it's been a while since my boy \n                         had holy confession. Could you...?\n\n<b>                                     PRIEST\n</b>                              (smiling)\n                         Consider it done.\n\n               Mrs. Bruce looks down at Jam and sees his drumsticks poking \n               out of his socks. She immediately takes them out and stuffs \n               them into her jacket. Jam doesn't even move.\n\n<b>                                     MRS. BRUCE\n</b>                         It's about time you gave up on that \n                         stupid dream once and for all. No \n                         son of mine is going to be a career \n                         musician.\n\n               Jam is stung. Mrs. Bruce and the priest head back down the \n               center aisle exiting through the gigantic front doors. She \n               eyes Jam.\n\n<b>                                     MRS. BRUCE\n</b>                         Thank you, Father. I'll be back for \n                         him before you know it; after I take \n                         care of some unfinished business.\n\n<b>                                     PRIEST\n</b>                         Just knock loudly, sister.\n\n               He lets her out and locks the door, leaving the keys in the \n               lock, and walks over to Jam.\n\n<b>                                     PRIEST\n</b>                         Come along, son. Get into the booth.\n\n               He helps the despondent Jam up. They walk to the booth and \n               Jam reluctantly gets inside.\n\n<b>               INT. CONFESSIONAL BOOTH - NIGHT\n</b>\n               Jam kneels on the board and a mere two feet behind him, Beth \n               sits on a bench shrouded in darkness. Her posture is that of \n               someone with a crate of nitroglycerine on her lap.\n\n               We hear the SHUFFLING noise of the priest getting into his \n               own compartment next door. A moment later the small, eye-\n               level door SLIDES open. The priest's face is barely visible \n               on the other side of the thick screen, but he's there.\n\n<b>                                     JAM\n</b>                         Forgive me, Father, for I have sinned. \n                         This is my first confession in... \n                         well... a really long time.\n\n<b>                                     PRIEST\n</b>                         Prepare to receive the Act of Penance.  \n                         How many sins have you committed \n                         since your last confession?\n\n<b>                                     JAM\n</b>                         Just one, Father, but boy was it a \n                         doozy.\n\n               Beth leans forward slightly and listens to Jam's confession.\n\n<b>               INT. IT'S RAINING MEN STRIP JOINT - NIGHT\n</b>\n               Hawk's at a bar stool gulping sloppily and woozily from a \n               rocks glass. Four more empty rocks glasses sit in front of \n               him. He stares at the sexy woman who smiles back, blowing \n               him kisses from the other side of the bar.\n\n               The EMCEE enters the stage.\n\n<b>                                     EMCEE\n</b>                              (into microphone)\n                         Okay, ladies, hang onto your hormones. \n                         Here comes our next amateur. Let's \n                         have a big hand for Hawk!\n\n               The beginning of a rockin' KISS tune comes over the P.A. and \n               Dicky approaches Hawk.\n\n<b>                                     EMCEE\n</b>                         You're up, Hawk.\n\n               Hawk wakes up fast. There's nothing more sobering than having \n               to undress in public.\n\n<b>                                     HAWK\n</b>                         Oh, Dicky, I c-c-can't...\n\n<b>                                     BARTENDER\n</b>                         You're not gonna chicken out on me \n                         now, are you? We've got your KISS \n                         song playing and everything.\n\n<b>                                     HAWK\n</b>                         I-I c-can't...\n\n<b>                                     BARTENDER\n</b>                              (leans in close)\n                         Look, people undress in public \n                         because, A, they're exhibitionists, \n                         B, they're nutcases, or C, they need \n                         the money. I can tell you're not A, \n                         and I hope to hell you're not B. So \n                         my suggestion is, think about why \n                         you're a C and let your body party, \n                         shake your groove thing, boogie oogie \n                         oogie till you just can't boogie no \n                         more.\n\n               Hawk thinks about it, then downs the rest of his drink. He \n               grimaces at it's taste, then opens his eyes with new resolve.\n\n<b>                                     HAWK\n</b>                         You're right, Dicky. I gotta do it \n                         for KISS. Gotta put a bag over its \n                         head and \n                              (hiccup)\n                         Do it for KISS.\n\n               Hawk swivels his bar stool to the right and gets off, \n               forgetting to stand when his feet hit the floor. He proceeds \n               to fall flat on his face. Dicky looks down concerned, but \n               Hawk stands with a little difficulty and heads for the stage. \n               The crowd of women parts down the middle for him and checks \n               him out as he walks by. They seem to like what they see. \n               Hawk looks nervously at the carnivorous faces leering at his \n               package first, his ass after. What the hell is he doing?\n\n               Hawk reluctantly climbs onto the stage and the gals start \n               CLAPPING to the song. He faces them and starts gyrating his \n               drunken hips at them, feeling no confidence whatsoever, \n               until...\n\n               The CHEERS start to ECHO and the pulsing lights begin to \n               hurt his eyes. Hawk watches the world proceed to spin faster \n               than the disco ball above his head.\n\n               He stops gyrating and clutches his stomach. BELCHING. Uh-oh.\n\n               Hawk spots an almost-empty beer pitcher one of the CHEERING-\n               IN-SLOW-MOTION women holds above her head. He runs up to the \n               edge of the stage, grabs the pitcher, and PUKES.\n\n               The cheering and music come to a grinding halt. You can hear \n               a pin drop as Hawk yacks his guts out into the beer pitcher. \n               It goes on for an excruciatingly long time, then finally \n               stops.\n\n               Hawk looks up at the hundreds of astonished eyes staring at \n               him. He wipes his mouth, then a look of ease washes over his \n               face.\n\n<b>                                     HAWK\n</b>                         Wow. I feel a hundred times better!\n\n               He hands the vomit-filled pitcher back to the shocked woman.\n\n<b>                                     HAWK\n</b>                         Thanks lady.\n\n               He looks over at the emcee, who gazes at Hawk from the DJ \n               booth.\n\n<b>                                     HAWK\n</b>                         Maestro? As you were.\n\n               The emcee stands perfectly still, jaw agape.\n\n<b>                                     HAWK\n</b>                         Come on, dude, we got a bunch of \n                         frisky felines waiting for some \n                         entertainment! The show must go on!\n\n               Hawk starts gyrating even though the music is still off. The \n               emcee shrugs, re-cuing the song. It starts again as Hawk \n               faces the crowd, dancing with new-found bravado.\n\n               The women come out of their dumbstruck comas and reluctantly \n               start CLAPPING again.\n\n               Hawk pulls off his jacket and twirls it over his head Roger \n               Daltry style. Then he pulls it back down and tosses it into \n               the crowd. The women actually fight over it.\n\n               Encouraged, Hawk then peels off his KISS Army tee-shirt and \n               hurls it at the women, who SQUEAL with delight. Sure, he may \n               be scrawny, but they don't mind. This lad's got personality.\n\n               Adrenaline pumping, confidence building, Hawk starts playing \n               the crowd of very responsive ladies.\n\n               He unbuttons his jeans first. Then, leaving them on, he does \n               an \"air guitar\" medley: Chuck Berry, ZZ Top, Angus Young \n               from AC/DC, and Elvis Costello in six easy steps.\n\n               Hawk finishes off with a Pete Townshend windmill, shaking \n               his ass at his audience in mid-strum, then licks his finger \n               and touches one of his cheeks: \"hot stuff\" (he does this in \n               a manly way of course).\n\n               Then Hawk pauses to adjust what looks to be his underwear \n               bunching up in his crack.\n\n               The women WHOO-HOO.\n\n               He segues into a Mick Jagger rooster strut and the ladies go \n               ga-ga. He makes the sign of the horns with each hand and \n               wiggles a protruding tongue like Gene Simmons. The gals scream \n               in orgastic joy.\n\n               Then, Hawk goes for the gold. Yes, he does the Fonzie dance! \n               The women are now overcome by sheer animal lust. Hawk's \n               whipped his audience into a frenzied pack of bitches in heat. \n               Amanda smirks and sucks from her little drink straw \n               suggestively.\n\n               At long last Hawk figures he has to give them what they want.\n\n               He puts his fingers to his fly, pauses, then unzips. His \n               Brittanias fall to his ankles, revealing a pair of bony legs \n               sticking down from some KISS boxer shorts. The ladies go \n               batty.\n\n               Unfortunately Hawk has neglected a cardinal rule of disrobing. \n               Never pull your pants down without taking your shoes off \n               first. He tries to kick off his shoes. The left one goes \n               flying across the bar and THWACK, beans a MIDDLE-AGED WOMAN \n               in the face. She flies backwards over a chair.\n\n               Trying to kick the other shoe off, Hawk loses his balance \n               and falls backwards, hitting his head on the edge of the \n               bar.\n\n<b>                                 DRUM ROLL / NEGOTIATION\n</b>\n<b>               INT. SMILEY MART - NIGHT\n</b>\n               Trip looks at the little kid, Chongo, and the two buds in \n               fear.\n\n<b>                                     TRIP\n</b>                         Two hundred bucks?\n\n<b>                                     LITTLE KID\n</b>                         You heard me, nad breath. My time's \n                         precious and I think that's a \n                         reasonable price to pay for your \n                         sorry life.\n\n<b>                                     TRIP\n</b>                         Look, I want to live, but I don't \n                         know where the fuck I'm gonna find \n                         two hundred bucks.\n\n               The little kid shakes his head in disgust.\n\n<b>                                     LITTLE KID\n</b>                         Chongo? Take him outside and tear \n                         his ass out through his mouth.\n\n               Chongo advances, muscles flexing.\n\n<b>                                     TRIP\n</b>                         Hold on! I know how I can get the \n                         money! I just figured it out! Only \n                         you might wanna wait outside.\n\n               The little kid and Chongo look at each other.\n\n<b>                                     CHONGO\n</b>                         I don't trust him.\n\n<b>                                     LITTLE KID\n</b>                         I think he's on the level. He's too \n                         stupid to try anything sneaky anyway. \n                         Look at him, he's a moron.\n\n               They look back at Trip.\n\n<b>                                     LITTLE KID\n</b>                         You got fifteen minutes and not a \n                         second longer. We have a concert to \n                         go to. See you outside.\n\n               Trip nods sullenly as the kid, Chongo, and the two buds exit.  \n               Then he checks to make sure Stretch Armstrong is still with \n               him.\n\n<b>               INT. BASS DRUM - NIGHT\n</b>\n               Lex is twisted like a pretzel as he's carted into the bowels \n               of Cobo Hall. He tries to keep calm, but it's not in his \n               nature.\n\n<b>                                     LEX\n</b>                              (under his breath)\n                         Keep it together, Lex. Anything worth \n                         fighting for is worth dying for.\n\n<b>               INT. COBO HALL/RECEIVING AREA - NIGHT\n</b>\n               ROADIES and TECHIES run in all directions as last minute \n               preparations are being attended to.\n\n               Two roadies carry the base drum down a long ramp unaware \n               that Lex is hidden inside.\n\n<b>                                     ROADIE #2\n</b>                         Boy, this one's heavy.\n\n               Suddenly, Roadie #2 snags his foot on a mess of cable and \n               loses his balance, dropping the oversized drum. In an instant \n               the drum goes rolling down the ramp quickly gaining speed.\n\n<b>                                     ROADIE #2\n</b>                         Shit!\n\n               The roadies bolt after the runaway drum. Other workers scurry \n               out of the way to avoid being hit by the speeding instrument.\n\n<b>               INT. BASS DRUM - NIGHT\n</b>\n               Lex spins like in a dryer on speed.\n\n<b>                                     LEX\n</b><b>                         WHOOOOAAA!\n</b>\n<b>               INT. COBO HALL/RECEIVING AREA - NIGHT\n</b>\n               More techies jump out of the way as the wayward drum heads \n               right for a closed set of double doors. The roadies are just \n               about to grab it before impact, when...\n\n               The door unexpectedly swings open. The FOXY GROUPIES on the \n               other side scream at the sight of the careening drum heading \n               straight for them.\n\n<b>                                     ROADIE #2\n</b>                         Close that door!\n\n               Too late. The groupies jump away as the drum flies through \n               the open door and down a flight of stairs.\n\n<b>               INT. COBO HALL STAIRWELL - NIGHT\n</b>\n               The drum bounces down the zigzag stairway violently. Lex's \n               GRUNTS of pain can be heard from inside.\n\n<b>               AT THE BOTTOM\n</b>\n               The big drum hits the landing hard, tips over, then spins \n               like a quarter getting faster before it stops.\n\n<b>               ON THE ROADIES\n</b>\n               They barrel down the stairs two at a time. Finally reaching \n               the bottom, they grab the drum.\n\n<b>                                     ROADIE #2\n</b>                         Peter's gonna kill us.\n\n               As they carry the drum back up the stairs, we see it is now \n               empty. Once the roadies are gone, CAMERA TILTS UP to the \n               ceiling. There's Lex clutching exposed pipes for dear life, \n               hanging upside down, praying the coast is clear.\n\n<b>                      BETH'S CONFESSION / COMPENSATORY POSSIBILITIES\n</b>\n<b>               INT. CONFESSIONAL - NIGHT\n</b>\n               Jam is at the end of his confession. The priest is still \n               listening on the other side of the screen. Beth sits in the \n               shadows behind Jam.\n\n<b>                                     JAM\n</b>                         So, you see if it wasn't for me, me \n                         and my friends would be at that KISS \n                         concert right now... together.\n\n<b>                                     PRIEST\n</b>                         That's it?\n\n<b>                                     JAM\n</b>                         Yeah.\n\n<b>                                     PRIEST\n</b>                         Well, this is a unique confession to \n                         say the least, son. And not exactly \n                         the most interesting one I've ever \n                         heard either. You sure you don't \n                         want to talk about... oh, carnal \n                         knowledge with a neighborhood girl \n                         or impure thoughts about the new \n                         student teacher maybe... or how about \n                         finding a box of magazines under \n                         your dad's bed?\n\n<b>                                     JAM\n</b>                         No.\n\n<b>                                     PRIEST\n</b>                         Well then, I suggest you have a seat \n                         on the bench behind you and think of \n                         something a little juicier to confess \n                         than losing KISS tickets. I realize \n                         this is Detroit, but I personally \n                         find, what that rock and roll band \n                         is all about, to be boring as \n                         Lucifer's kingdom. I'll return in a \n                         little while.\n\n               The priest SLIDES the door shut again. Jam is all but shrouded \n               in darkness, but can make out the time on his watch. It's \n               getting late. He resignedly sits on the bench behind him... \n               right on Beth's lap.\n\n               Jam yells, but Beth throws her hand over his mouth. His eyes \n               bulge. He can't believe what he's seeing. He climbs off Beth \n               and sits next to her.\n\n<b>                                     JAM\n</b>                              (whispering)\n                         Beth? I can't believe it.\n\n<b>                                     BETH\n</b>                         Believe it.\n\n               Jam thinks for a beat. Something still isn't quite clicking.\n\n<b>                                     JAM\n</b>                         Are you waiting for confession? I \n                         thought you were Jewish?\n\n               BETH can hardly speak. She gulps thinking of what to say.\n\n<b>                                     BETH\n</b>                         I have a confession. Here it is.\n\n               Beth gives him the biggest, wettest, sloppiest kiss in \n               recorded history. She pulls away finally wiping her mouth.\n\n<b>                                     BETH\n</b>                         I didn't mean for that to be so... \n                         intense. Forgive me.\n\n<b>                                     JAM\n</b>                         I don't care. I wanna hear more.\n\n               She lunges at him again, kissing him for dear life. Her lips \n               leave his and begin to explore his chin, neck, ear.\n\n<b>                                     BETH\n</b>                         I've loved you ever since I first \n                         laid eyes on you, Jeremiah. I've \n                         just always been too scared to show \n                         it.\n\n<b>                                     JAM\n</b>                         Beth, I can't believe you just said \n                         that because that's exactly how I've \n                         always felt about you... Call me \n                         Jam. It's my band name.\n\n<b>                                     BETH\n</b>                         You don't know how long I've been \n                         waiting to hear that... Jam!\n\n               He kisses her neck. Unable to stop, they start undressing \n               each other, both breathing heavy.\n\n<b>                                     BETH\n</b>                         We've got to take this slow...\n\n<b>                                     JAM\n</b>                         Right, slow...\n\n<b>                                     BETH\n</b>                         Oh, screw it!\n\n               She tears his tee-shirt open with her teeth.\n\n<b>               INT. IT'S RAINING MEN STRIP JOINT - NIGHT\n</b>\n               A really buff STRIPPER dressed as a construction worker is \n               on stage with about ten others who stand in the background.  \n               The emcee's hand hovers above the stripper's head.\n\n<b>                                     EMCEE\n</b>                         Okay, ladies, it's down to... Troy \n                         the Human Jackhammer...\n\n               The women APPLAUD as we...\n\n               FOLLOW the emcee's hand to Hawk who holds an ice pack on the \n               side of his head.\n\n<b>                                     EMCEE\n</b>                         ...and Mr. Massive Head Wound \n                         Accompanied by an Upset Stomach-Hawk!\n\n               The women APPLAUD but not quite as loud.\n\n<b>                                     EMCEE\n</b>                         No contest. The grand prize of seventy-\n                         five dollars goes to Troy the Human \n                         Jackhammer!\n\n               The women cheer and a DISCO SONG starts as Troy does a reprise \n               of his act. Hawk walks away from the stage with the rest of \n               the rejected strippers, looking the way he feels: pretty \n               damn stupid. He puts on his pants, trying to walk at the \n               same time and falls to his knees.\n\n               A helpful hand grabs him under the arm and helps him up.  \n               It's Amanda looking lustier than ever.\n\n<b>                                     HAWK\n</b>                         Thanks, miss.\n\n<b>                                     AMANDA\n</b>                         You're too kind. I'm Amanda.\n\n<b>                                     HAWK\n</b>                         Right, well, thanks for the drinks \n                         and stuff, Amanda, but there's no \n                         reason for me to stick around these \n                         parts anymore.\n\n<b>                                     AMANDA\n</b>                         Don't be so glum, Hawk. The night's \n                         still young and filled with plenty \n                         of compensatory possibilities.\n\n<b>                                     HAWK\n</b>                         Huh?\n\n<b>                                     AMANDA\n</b>                         I'd be in a position to spend some \n                         money on you if you'd get in a \n                         position and spend some time on me.\n\n               Hawk GULPS.\n\n<b>               INT. CONFESSIONAL BOOTH - NIGHT\n</b>\n               Jam and Beth lay buck naked, tightly wrapped around each \n               other in the heat of passion on the confessional booth floor.  \n               They kiss, sweat, and PANT heavily.\n\n               Suddenly, the sliding door to the priest's booth opens. Jam \n               and Beth freeze.\n\n<b>                                     PRIEST'S VOICE\n</b>                         Where are you, son?\n\n<b>                                     JAM\n</b>                         Uhh, tying my shoe.\n\n<b>                                     PRIEST'S VOICE\n</b>                         Oh. So, have you thought of a colorful \n                         confession yet?\n\n<b>                                     JAM\n</b>                         Actually, yes. Last year I walked \n                         out of a candy store with a Reggie \n                         Bar I hadn't paid for, but went back \n                         and apologized the next day.\n\n<b>                                     PRIEST'S VOICE\n</b>                         Boooring. Think, boy, think!\n\n               We hear the door SLIDE shut again as Beth and Jam pick up \n               where they left off.\n\n<b>                                         HOLD UP\n</b>\n<b>               INT. SMILEY MART - NIGHT\n</b>\n               Trip leafs through a KISS comic, not really paying attention \n               to it. Directly behind him is the register and the CASHIER.\n\n               He starts hearing voices in his head. We see SUPERS of his \n               friends' faces hovering around him.\n\n<b>                                     LEX'S VOICE\n</b>                         I can't believe you're even thinking \n                         of committing a robbery, Trip. You \n                         don't pass go and collect 200 dollars \n                         for pulling stuff like this.\n\n<b>                                     HAWK'S VOICE\n</b>                         No shit, dude, is this really worth \n                         it? Sure you get your ass kicked \n                         nine ways to Sunday by that fucking \n                         gorilla, but it's still a hundred \n                         times better than getting it porked \n                         for the next three to five.\n\n               Trip sends brief, agitated glances around the store meeting \n               the cashier's eyes again. She smiles at him coyly as she \n               plays with her mood ring. He gives her the eye, then returns \n               to his comic.\n\n<b>                                     JAM'S VOICE\n</b>                         And what about that girl, Trip? She'll \n                         never forget this night. Even if you \n                         get away with it, she'll be scarred \n                         for life. When are you gonna realize \n                         sometimes being tough means being \n                         tender.\n\n<b>                                     TRIP\n</b>                              (to the other voices)\n                         Alright, everybody, SHUT UP!\n\n               Trip snaps out of it. All the shoppers and cashier are \n               starring at him. He COUGHS loudly, clearing his throat to \n               cover his outburst. The shoppers go back to shopping.\n\n               A MAN WITH A LONG COAT enters the store, looks around, then \n               takes a spot alongside Trip and opens a Mad Magazine.\n\n<b>                                     TRIP\n</b>                              (whispering to himself)\n                         Okay, bro. You gonna have to do this \n                         sometime. Might as well be now.\n\n               Trip puts a hand in his pocket and takes one last look at \n               Stretch Armstrong before stuffing the action figure back in \n               so it looks like he's got a gun. He takes three deep breaths \n               and discreetly pulls his knit cap down over his eyes, \n               revealing it actually as a semi-ski mask that covers the top \n               half of his face.\n\n               Just then, the man with the coat puts the magazine back and \n               pulls something over his own head.\n\n               Trip whirls around pointing Stretch-in-his-pocket at the \n               cashier...\n\n               Just as the man in the coat, now masked with a stocking, \n               pulls the biggest shotgun ever made from under his coat, \n               pointing it at the cashier as well. The cashier shrieks. So \n               does Trip.\n\n<b>                                     MAN WITH COAT\n</b>                         Evening, honey. Y'know what I am, \n                         what this is, and what you have to \n                         do, so do it quick.\n                              (to shoppers, Trip \n                              included)\n                         The rest of you kindly introduce \n                         yourselves to the floor and kiss it \n                         hello.\n\n               His thunder now stolen, Trip drops to the floor along with \n               everyone else. The air is very tense. The cashier starts \n               SOBBING, keeping her hands in the air.\n\n<b>                                     MAN WITH COAT\n</b>                              (to cashier)\n                         Do or die, bitch! Next time I let \n                         the barrels do the talking.\n\n<b>                                     CASHIER\n</b>                         P-p-please, mister, I'm just a high \n                         school kid...\n\n               Man with the coat COCKS the chamber and the cashier \n               immediately opens the register drawer and starts emptying \n               it.\n\n<b>                                     MAN WITH COAT\n</b>                         Fuck school, that's what I say! I \n                         just went through the motions till I \n                         was old enough to drop out and I'm \n                         leaving here with at least two fifty \n                         the easy way. Look where all that \n                         studying's gonna get you tonight. \n                         Robbed at gunpoint and possibly shot \n                         in the fucking head... for minimum \n                         wage!\n\n               The man with the coat's laughter ECHOES in Trip's head till \n               he just can't take it anymore.\n\n<b>               ON THE CASHIER\n</b>\n               She suddenly shoots a surprise glance over the man with the \n               coat's shoulder.\n\n               Seeing this, the man spins around. There's Trip behind him.\n\n<b>                                     TRIP\n</b>                         Alright, drop it or I'll kick your \n                         ass!\n\n               Astounded by Trip's audacity, the man with the coat turns \n               his shotgun point-blank at Trip.\n\n<b>                                     MAN WITH COAT\n</b>                         Oh, yeah! You and what army?\n\n<b>                                     TRIP\n</b>                              (gulps)\n                         The KISS Army!\n\n<b>                                    CRASHING BACKSTAGE\n</b>\n<b>               INT. COBO HALL/BACKSTAGE - NIGHT\n</b>\n               Your wildest fantasy of a rock show's backstage area come \n               true. The place is packed with \"beautiful\" people. Scantily-\n               clad BABES everywhere. Slick, RECORD BIZ-TYPES. Lots of food. \n               Lots of booze. Lots of fun. It's backstage at a KISS concert, \n               come on!\n\n               CAMERA TILTS UP above the partying hordes to find Lex shimming \n               along an exposed duct amid the pipes, sprinklers, and vents. \n               Looking straight down on everybody, Lex is in awe and \n               disbelief.\n\n<b>                                     LEX\n</b>                         This is real. This is not a dream! \n                         This is real! I've pierced the inner \n                         circle!\n\n               He takes the opportunity to peer down some BIG BUSTED GIRL'S \n               cleavage. Then his eye spots something else. He GASPS. A \n               door. On it a star. Written on the star, the word, KISS.\n\n<b>                                     LEX\n</b>                         Oh, God, they're in there!\n\n               A big-haired HIPSTER in mirrored sunglasses KNOCKS on the \n               dressing room door. It opens, but Lex can't see inside. The \n               hipster stands in the doorway talking to whoever is there.\n\n               Lex cranes his neck to see around the door jamb. Desperate \n               for a glimpse of his idols, he leans out too far.\n\n               Suddenly, the entire duct collapses. Breaking loose of the \n               ceiling, Lex hurls to the floor clutching the duct. Backstage \n               goers leap for cover as SMASH... he hits the ground in a \n               shower of plaster and dust.\n\n               The hipster protectively pulls the dressing room door shut \n               as two SECURITY MEN jump in front of it.\n\n               Instantly, huge, burly hands come down on Lex's shoulders.  \n               Before he can react, a slew of OFFICERS have him off his \n               feet and carry him away, a stunned expression frozen to his \n               face.\n\n<b>               EXT. ALLEY BEHIND COBO HALL - NIGHT\n</b>\n               Lex is thrown into a heaping garbage dumpster by the scruff \n               of his neck. The security officers laugh and pat themselves \n               on the back as they hurry back in.\n\n               Lex peeks out the lid. The alley is dark and spooky. He jumps \n               out of the trash and comes face to face with the biggest \n               GERMAN SHEPHERD that has ever lived. Its teeth are bared and \n               its black, wolf-like body is coiled, ready to spring.  \n<b>               GRRRRRRR!\n</b>\n               Lex jumps backward hitting the dumpster. A GROWLING PITBULL \n               walks out from the shadows and joins the Shepherd.\n\n<b>                                     LEX\n</b>                              (petrified)\n                         Dogs! Why did it have to be dogs!\n\n               Then, a GROWLING DOBERMAN with a spiked collar emerges from \n               the darkness on the other side of the alley, its solid, \n               muscular form making the brick building nearby look like \n               jello.\n\n               Lex starts SLAPPING himself on the face.\n\n<b>                                     LEX\n</b>                         Wake up, Lex! Wake up, man! This \n                         part's gotta be a nightmare!\n\n               No luck. He stops, when several other DOGS emerge from the \n               shadows and gather behind the first three. These new mutts \n               immediately join in the GROWLING chorale. The Shepherd snaps \n               at Lex.\n\n<b>                                     LEX\n</b>                              (to the heavens)\n                         God, if you ever get me outta this, \n                         I swear I will never masturbate again!\n\n               The pack BARKS even louder.\n\n<b>                                     LEX\n</b>                              (to heaven again)\n<b>                         I REALLY MEAN IT THIS TIME!\n</b>\n<b>               INT. CONFESSIONAL BOOTH - NIGHT\n</b>\n               Beth lays in Jam's arms on the floor. They might as well be \n               the only two people on the face of the earth. They whisper.\n\n<b>                                     BETH\n</b>                         So. Is it true that Gene Simmons had \n                         a cow's tongue grafted onto his real \n                         one? Y'know, to make it so long?\n\n<b>                                     JAM\n</b>                         I dunno. I think he had the piece of \n                         skin under his tongue removed so he \n                         could stick it out farther. I'm not \n                         too up on Gene trivia.\n\n<b>                                     BETH\n</b>                         Your man is the drummer, Peter Criss, \n                         right?\n\n<b>                                     JAM\n</b>                         Peter Criss is my inspiration, man.  \n                         If I paid a hundred bucks for a KISS \n                         show and all I saw was his solo, I'd \n                         consider it... money... Hey, how'd \n                         you know that?\n\n<b>                                     BETH\n</b>                         I have all your notebook doodles \n                         memorized, Jam... Here.\n\n               She opens her backpack and pulls out a package addressed to \n               Jam. The return address reads: Beth Bumsteen, Somewhere in \n               Ann Arbor.\n\n<b>                                     JAM\n</b>                         Ann Arbor?\n\n<b>                                     BETH\n</b>                         My dad's company is relocating him. \n                         We're moving. That's why I was acting \n                         so freaky in school today. I thought \n                         it was the last time I'd ever see \n                         you. Anyway, open the box. I would \n                         have given it to you this morning, \n                         except... like I said, I was freaking \n                         out.\n\n               Jam opens the box and his jaw drops. It's a black tee-shirt \n               with the \"Mystery\" logo printed in white on the chest. Jam \n               holds it up. It's gigantic.\n\n<b>                                     BETH\n</b>                         I pass by this really cool tee-shirt \n                         shop on my way to school every day \n                         and I know you wear those black tee-\n                         shirts all the time. You look like a \n                         size thirty-five, but all the sizes \n                         were in Roman numerals. So I got you \n                         an XXXL. That's thirty-five, isn't \n                         it?\n\n               Touched, Jam kisses her for a long time. He starts putting \n               on the shirt when suddenly they hear the SHUFFLING of the \n               priest entering his booth. Jam grabs his clothes and sits \n               back on the bench. Beth starts getting dressed at his feet.\n\n<b>                                     PRIEST\n</b>                         Okay, you better have something really \n                         sinful for me this time, son. My \n                         patience is worn to threads and your \n                         mom will be here any minute.\n\n<b>                                     JAM\n</b>                              (pulling up his pants)\n                         Alright, Father, here it is. About \n                         two weeks ago I went to my cousin's \n                         wedding and one of the bridesmaids \n                         asked me if I wanted to take a bath.\n\n<b>                                     PRIEST\n</b>                         No...\n\n               Beth is tying her shoes. Jam slips on his socks.\n\n<b>                                     JAM\n</b>                         I was insulted, so I asked her if I \n                         was wreaking some wicked b.o., right?  \n                         Then she said no, she wanted to take \n                         a bath with me.\n\n<b>                                     PRIEST\n</b>                         Oh, this is terrible... Please go \n                         on.\n\n<b>                                     JAM\n</b>                         Well, she was a very tempting siren, \n                         Father. Built like you wouldn't \n                         believe. So I gave into temptation \n                         about a block away from the wedding \n                         reception at this little motel that \n                         charges by the hour.\n\n               Jam pauses.\n\n<b>                                     PRIEST\n</b>                         Well? Continue! Continue!\n\n<b>                                     JAM\n</b>                         Okay... when she peeled off that \n                         gown, you'll never guess what she \n                         was wearing underneath.\n\n<b>                                     PRIEST\n</b>                         Was it a teddy?\n\n               Fully dressed, Beth crawls out of the confessional.\n\n<b>                                     JAM\n</b>                         No. Much bet... I mean, much more \n                         sinful than that.\n\n<b>                                     PRIEST\n</b>                         A bustier?\n\n<b>                                     JAM\n</b>                         Tell you what. You keep guessing and \n                         I'll say something when you get it.\n\n<b>                                     PRIEST\n</b>                         Splendid! I love a good game of Name \n                         That Nightie.\n\n               Jam quietly sneaks out.\n\n<b>               INT. ST. SEBASTIAN'S CATHEDRAL - NIGHT\n</b>\n               We can hear the priest's voice as Jam hurries to Beth. They \n               dash out the door.\n\n<b>                                     PRIEST'S VOICE\n</b>                         Satin underwear? Crotchless panties? \n                         Leopard skin bra? Fishnet leotard? \n                         Leather G-string?\n\n<b>               EXT. ALLEY BEHIND COBO HALL - NIGHT\n</b>\n               Still trapped by the GROWLING, BARKING pack of dogs, Lex \n               searches nervously through the garbage behind him.\n\n<b>                                     LEX\n</b>                         Okay, okay, you're pissed off. I can \n                         see this. So... Maybe what we need... \n                         ah-ha.\n\n               Lex holds up a worn-out, old frisbee.\n\n<b>                                     LEX\n</b>                         Play some frisbee, poochies?\n\n               The pack just glares and SNARLS. He tosses the frisbee over \n               the packs' heads, but the dogs don't even acknowledge it. \n               They just keep BARKING and GROWLING.\n\n               Meanwhile, an unnoticed dog at the rear of the pack, a mangy \n               Basset Hound, turns its flat head to see the frisbee land on \n               the ground behind him. His tail starts to wag.\n\n<b>                                     LEX\n</b>                              (exasperated)\n                         Alright! I give up! I hearby and \n                         forthwith defer my destiny to you \n                         mutts. I may be an intelligent, \n                         upright, walking, homo-fucking sapien, \n                         but you fleabags are a force of \n                         nature. So, I'm just gonna sit here \n                         and wait for you to decide. If you \n                         let me live, I thank you. If you \n                         bite my head off, I'll die knowing I \n                         did all I could. It's up to you.\n\n               Lex waits before the GROWLING, SNAPPING canines. Suddenly, \n               the Basset Hound runs up in front of the pack and drops the \n               frisbee at Lex's feet. Lex looks down at the floppy, wrinkly \n               dog, who wags its tail and PANTS furiously.\n\n<b>                                     LEX\n</b>                         Well, how do you like that?\n\n               Lex starts to pet the hound, and one-by-one the rest of the \n               dogs shut-up. Shocked, Lex picks the frisbee up again and \n               throws it.\n\n               This time the entire pack bolts after the Whammo product.\n\n               Lex smiles, watching them fight for it in the air... in SLOW \n               MOTION... as the theme from \"CHARIOTS OF FIRE\" begins.\n\n               The black Shepherd finally grabs the frisbee in its mouth \n               and runs back toward Lex. It's soon joined by the rest of \n               the pack. That's right about when Lex realizes they aren't \n               going to stop.\n\n<b>                                     LEX\n</b>                         Whoa! Whoa!\n\n               The dogs plow into Lex full-force knocking him into the \n               garbage. They surround him licking his face. Lex bursts into \n               unstoppable laughter.\n\n               Pulling himself up, he pets the dogs as they jump around him \n               wagging their tails and PANTING.\n\n<b>                                     LEX\n</b>                              (baby talk)\n                         You sonsofbitches could tickle a guy \n                         to death, y'know that? Sure you do... \n                         Sure you do...\n\n               Lex stops. He hears TALKING coming from inside the windowless, \n               brick building on the other side of the alley. He steps in \n               front of the pack and puts his fingers to his lips. They \n               obey, quieting instantly. He then tiptoes to a thin crack in \n               the brick wall. The dogs quietly follow.\n\n               Lex puts his eye to the crack and peers in.\n\n<b>               INT. CHOP SHOP - NIGHT\n</b>\n<b>               LEX'S POV\n</b>\n               His mom's Volvo and a BMW are on adjacent hydraulic lifts \n               inside a makeshift auto-mechanic shop.\n\n               Two BEEFY JERKS with blow torches stand next to the cars. \n               One has a bandage on his head and seems to be in pain.\n\n<b>                                     BEEFY JERK #1\n</b>                         So, I jump into the car, hot-wire it \n                         in thirty seconds and start driving. \n                         Then, suddenly I hear this scream. \n                         The disco queen was asleep in the \n                         back seat.\n\n               Beefy jerk #2 laughs.\n\n<b>                                     BEEFY JERK #1\n</b>                         You think it's funny? How would you \n                         like to have a stiletto heel smacking \n                         you in the temple when you're tryin' \n                         to work?\n\n               Beefy jerk #2 laughs more. Beefy jerk #1 checks the time.\n\n<b>                                     BEEFY JERK #1\n</b>                         You about done splittin' a gut there?  \n                         We gotta get these parts to Toledo \n                         by nine.\n\n               Then a familiar voice is heard coming from the back of the \n               shop.\n\n<b>                                     CHRISTINE\n</b>                         Then maybe you guys'll let me go, \n                         huh?\n\n               Lex follows the voice and sees Christine handcuffed to a \n               radiator near the rear of the shop.\n\n<b>                                     CHRISTINE\n</b>                         Come on, whadaya say? You scratch my \n                         back, I scratch yours. You let me \n                         go, and in return, I keep my big \n                         mouth shut about your little operation \n                         here. Mum, know what I mean?\n\n<b>                                     BEEFY JERK #2\n</b>                         You're lucky you're still alive, \n                         wench. If you was a guy, we woulda \n                         thought nothin' of sawing your head \n                         off with a butter knife.\n\n<b>                                     BEEFY JERK #1\n</b>                         What are we gonna do with her anyway?\n\n               Beefy jerk #2 bares what's left of his yellow, crusty teeth\n\n<b>                                     BEEFY JERK #2\n</b>                         I dunno, but she sure looks fun.\n\n               Beefy jerk #1 touches the bandage on his head.\n\n<b>                                     BEEFY JERK #1\n</b>                         Yeah, and payback's a bitch.\n\n               Christine GAGS at the thought.\n\n<b>               ANGLE ON WALL CRACK\n</b>\n               Lex's eyeball bulges with terror.\n\n<b>               EXT. IT'S RAINING MEN PARKING LOT - NIGHT\n</b>\n               DOLLY FROM the front end of a Jaguar XKE, Michigan vanity \n               plate reading: AMANDA.\n\n               TO its windshield, through which we see Hawk and Amanda \n               kissing in the front seat, clad only in their underwear. \n               Something like \"ME AND MRS. JONES\" plays on the radio. When \n               they separate, Amanda takes out a flask and offers it to \n               Hawk.\n\n<b>                                     HAWK\n</b>                         Thanks.\n\n               He gulps some down and pulls the flask away COUGHING.\n\n<b>                                     HAWK\n</b>                         What the hell is that?\n\n<b>                                     AMANDA\n</b>                         Gin.\n\n<b>                                     HAWK\n</b>                         Whoa. Some of this hard liquor's a \n                         tad too manly for me. I'm a brewski \n                         man myself.\n\n<b>                                     AMANDA\n</b>                         Better ease up then, Hawk. Wouldn't \n                         want to give you whiskey dick would \n                         we?\n\n<b>                                     HAWK\n</b>                         Who's Whiskey Dick?\n\n               Amanda plants a stocking foot on Hawk's crotch and rubs.\n\n<b>                                     AMANDA\n</b>                         Well. Obviously no one you have to \n                         worry about... Woody.\n\n<b>                                     HAWK\n</b>                         My name's not Woody, it's Haw-haw...\n\n               Hawk's eyes cross as he lets out a DEEP, OBNOXIOUS GROAN.\n\n<b>                                     HAWK\n</b>                         ...holy shit!\n\n               Amanda looks down at his crotch.\n\n<b>                                     AMANDA\n</b>                         But you do know Premature Peter, \n                         don't you? Shame, I just bought these \n                         stockings.\n\n               Hawk has never been more embarrassed.\n\n<b>                                     HAWK\n</b>                         Well, Amanda, this has been quite a \n                         night. So far you've seen me and my \n                         dick throw up.\n                              (to the heavens)\n                         What's next? Projectile diarrhea?\n                              (beat, to Amanda)\n                         Man. What a stud, huh?\n\n<b>                                     AMANDA\n</b>                         Believe it or not, you still have a \n                         way to go before you start competing \n                         with my soon-to-be-ex-husband... the \n                         champion of lousy lovemaking. The \n                         man who thinks he's the biggest and \n                         the best... The man who thinks every \n                         secretary, stewardess, and cocktail \n                         waitress he fucks should lick his \n                         feet for the honor. The man for whom \n                         faking it was invented. Christ, if I \n                         hadn't gotten pregnant with our son, \n                         I would have never known I even had \n                         sex with the prick.\n\n               She takes a healthy swig of gin, relishing its bitterness.\n\n<b>                                     HAWK\n</b>                         You love him?\n\n<b>                                     AMANDA\n</b>                         I just told you, he's a big, hairy...\n\n<b>                                     HAWK\n</b>                         No, I mean... you love your son?\n\n<b>                                     AMANDA\n</b>                         More than anything in the world.\n\n<b>                                     HAWK\n</b>                         And he loves you back, doesn't he?\n\n<b>                                     AMANDA\n</b>                         He's a little spoiled, but I know he \n                         does.\n\n<b>                                     HAWK\n</b>                         Well, shame on him if he doesn't.\n\n               She pats his shoulder.\n\n<b>                                     AMANDA\n</b>                         You're sweet.\n\n               Hawk stares out the windshield.\n\n<b>                                     HAWK\n</b>                         My mom died of a heart attack while \n                         she was having me. Man, I wish I had \n                         known her for even one day. If they \n                         ever invent a time machine, that's \n                         what I'm doing. Going back in time \n                         to meet my mom. I'm gonna say, \"Mrs.  \n                         Pitchford?... or Miss Williams, \n                         depending on when I show up. You \n                         don't know me, but I'm your kid from \n                         the future. Just wanted to thank you \n                         for the blue eyes, pug nose and for \n                         tying the knot with a guy who didn't \n                         mind diaper detail... Oh, and, uh... \n                         cut down on the red meat, will ya?\"\n\n               Amanda caresses Hawk's cheek. He turns with her hand and \n               kisses it. He takes her arm and begins kissing his way up to \n               her neck, her cheek, her mouth...\n\n<b>                                  DR. LOVE TO THE RESCUE\n</b>\n<b>               INT. SMILEY MART - NIGHT\n</b>\n               It's a stand-off. Prone customers look up at Trip and the \n               man with the long coat circling each other like sharks. The \n               helpless cashier lets out fearful sobs.\n\n<b>                                     MAN WITH COAT\n</b>                         Gimme your gun, boy!\n\n<b>                                     TRIP\n</b>                         No, you gimme your gun, boy!\n\n<b>                                     MAN WITH COAT\n</b>                         Don't tempt me, I'll shoot!\n\n<b>                                     TRIP\n</b>                         Not if I shoot first!\n\n<b>                                     MAN WITH COAT\n</b>                         I don't even think you have a gun!\n\n<b>                                     TRIP\n</b>                         Neither do I!\n\n               The man with the coat puts his shotgun against Trip's head.\n\n<b>                                     MAN WITH COAT\n</b>                         Now, for the last time, take the \n                         piece out and lay back down or your \n                         mom's gonna need the White Tornado \n                         to get the brains outta your ski \n                         cap.\n\n               Trip GULPS. The jig's up. He slowly pulls out Stretch \n               Armstrong, and the man with the coat glances down and starts \n               to laugh very loud. So loud, he throws his head back.\n\n               When he recovers, Trip's got Stretch aimed at his head and \n               pulled back to maximum tension.\n\n<b>                                     TRIP\n</b>                         Smile, you sonofa...\n\n               Trip lets go. WZZMACK! The man gets it right in the face and \n               falls backward onto the Hostess display, toppling a whole \n               bunch of Ho-Ho's, Ding-Dong's, Twinkies, and Suzy-O's to the \n               ground.\n\n               Trip runs up and grabs the shotgun away as the man with the \n               coat lifts his head briefly, then passes out.\n\n               Trip turns around and the cashier SLAMS into him, nearly \n               knocking him over. She throws her arms around him letting \n               out relieved SOBS. Behind her all the customers rise from \n               the floor CLAPPING. Trip did it. He saved the fucking store!\n\n               The cashier looks into Trip's masked eyes.\n\n<b>                                     CASHIER\n</b>                         Thank you! Thank you!... Who are \n                         you?\n\n<b>                                     TRIP\n</b>                              (with confidence)\n                         Call me... Dr. Love!\n\n               She plants a thousand mega-watt kiss on his lips and we ZOOM \n               IN on her mood ring changing color from gray to fire engine \n               red.\n\n               Trip's eyes widen just before... KABOOM... The shotgun he's \n               holding goes off, blowing a hole in the ceiling.\n\n               The recoil from the blast jolts Trip and the cashier apart.  \n               We now see Trip's face is smeared with bright, red lipstick.  \n               A huge chunk of ceiling falls onto his head but he doesn't \n               move. The kiss hit him harder.\n\n<b>                            I'M HERE FOR THE GIRL AND THE CAR\n</b>\n<b>               INT. CHOP SHOP - NIGHT\n</b>\n               BZZZZZ! Christine and the beefy jerks watch the brown, '78 \n               Volvo, Ohio plates: OB-GYN, ascend on a hydraulic lift.\n\n               Behind them sits the BMW skeleton. These boys work fast.\n\n<b>                                     CHRISTINE\n</b>                         You guys better kill me before you \n                         do what you're thinking of doing. \n                         Cause when I'm mad enough, I can \n                         bite down very hard.\n\n               The beefy jerks laughs.\n\n<b>                                     BEEFY JERK #1\n</b>                         Sweet Polly Purebred's got some spunk, \n                         huh?\n\n<b>                                     BEEFY JERK #2\n</b>                         I'll give her some spunk alright.\n\n               They put their blow torches down and turn to her.\n\n<b>                                     BEEFY JERK #1\n</b>                         We stripped that Beemer in fifteen \n                         minutes. Bet we can strip her in \n                         fifteen seconds.\n\n               They giggle maniacally and lumber toward Christine. Their \n               shadows growing larger and larger across her.\n\n<b>                                     CHRISTINE\n</b>                              (mile a minute)\n                         Now wait a minute, guys! Two against \n                         one ain't fair. Lemme go back and \n                         get my friend Barbara. You'd love \n                         her. Tits the size of your head. \n                         You'll feel like a little baby sucking \n                         on 'em. I swear, I'll bring her right \n                         back. It'll be a four-way... You \n                         guys like disco? I teach disco dancing \n                         at my church. You guys look like you \n                         got rhythm in your blood. Come on, \n                         free lessons if you let me go.\n\n<b>                                     BEEFY JERK #1\n</b>                         I know a dance we can do. The \n                         horizontal hustle.\n\n               They both laugh. Just as they're about to grab her...\n\n               Suddenly, the garage door behind them SLIDES UP revealing \n               darkness. Christine and the beefy jerks look out anxiously.\n\n<b>                                     BEEFY JERK #1\n</b>                         Who's there?\n\n               Silence except for CRICKETS. Then... from out of the darkness \n               emerges a figure... Lex. Christine's eyes brighten like a \n               bulb.\n\n<b>                                     LEX\n</b>                         I'm here for the girl and the car. \n                         You can try to stop me, but I must \n                         warn you, it may be hazardous to \n                         your health.\n\n               The beefy jerks laugh at this little punk. They start toward \n               him, one with a tire iron, the other a big monkey wrench.\n\n<b>                                     BEEFY JERK #1\n</b>                         Too bad. He was such a young idiot.\n\n<b>                                     BEEFY JERK #2\n</b>                         Ehhh. He was a stupid boy. He deserved \n                         to die.\n\n               Lex lets out a quick HIGH-PITCHED WHISTLE. The pack of BARKING \n               dogs led by the Shepherd, the Pit Bull, the Doberman, and \n               the Basset Hound, step from the darkness and flank Lex, \n               GROWLING and SNARLING at the beefy jerks.\n\n<b>                                     LEX\n</b>                         Listen to them. Children of the night. \n                         What music they make... Hounds of \n                         hell? Say hello to dinner!\n\n               The beefy jerks drop their tools on their feet and yelp in \n               pain. The pack takes this as a threat and charge the beefy \n               jerks, who bolt for a glass-partitioned office. The dogs \n               SCRATCH and BARK at the window ferociously.\n\n               Lex smiles at Christine. She smiles back. He presses the \n               \"down\" button on the lift and the Volvo descends. Lex yells \n               to the beefy jerks through the glass.\n\n<b>                                     LEX\n</b>                         One foot out of that office and your \n                         asses are Alpo!\n\n               Lex unlocks Christine. She leaps into his arms.\n\n<b>                                     CHRISTINE\n</b>                         Wow! Thank you! You're cooler than \n                         the Fonz.\n\n               She gives him a lingering kiss. Lex leans back, gives the \n               double thumbs-up, and says...\n\n<b>                                     LEX\n</b>                         Aaaayyyyy!\n\n               Lex takes her hand and they walk over to the Volvo. Lex lets \n               her in then rounds the car to the driver's side.\n\n<b>                                     BEEFY JERK #1\n</b>                         Hey, what about the dogs?\n\n<b>                                     LEX\n</b>                         You got a phone in there?\n\n               They nod. Lex drips a dry smile onto them.\n\n<b>                                     LEX\n</b>                         Call the cops.\n\n               The beefy jerks watch in disbelief as the Volvo SCREECHES \n               out of the chop shop.\n\n<b>                      2 GODDBYES, A PUNCH IN THE GUT AND A DRUMSTICK\n</b>\n<b>               EXT. WHITE CASTLE PARKING LOT - NIGHT\n</b>\n               Beth's parents wait in the running car as Jam and Beth share \n               a heartfelt good-bye outside the back door.\n\n<b>                                     BETH\n</b>                         Ann Arbor isn't... that far from \n                         Cleveland, right?\n\n<b>                                     JAM\n</b>                         Nah. Once I get my own wheels, I \n                         could come up all the time.\n\n<b>                                     BETH\n</b>                         That'd be great. Hey, maybe someday \n                         your band'll play there. It's a \n                         college town, you know?\n\n               Jam takes her hands.\n\n<b>                                     JAM\n</b>                         I feel like such an idiot. Why didn't \n                         I just say something a year and a \n                         half ago? Man, think of how much \n                         time we wasted.\n\n<b>                                     BETH\n</b>                         Let's not think about the past. Let's \n                         just think about from today on. I'll \n                         never forget you, Jam.\n\n<b>                                     JAM\n</b>                         Tell me about it. Church will never \n                         be the same again.\n\n               They stare at each other for a really long time. Then, kiss.\n\n               BEEP. BEEP. Dad looks back out the window and CLEARS HIS \n<b>               THROAT LOUDLY.\n</b>\n<b>                                     BETH\n</b>                              (flustered)\n                         Coming dad.\n                              (to Jam)\n                         I'll call you. Soon as we get a phone. \n                         Bye.\n\n<b>                                     JAM\n</b>                         Bye.\n\n               She gets in the car. They both wave as the Impala turns a \n               corner out of sight. Jam is left alone still waving long \n               after she's gone.\n\n<b>               INT. AMANDA'S JAG - NIGHT\n</b>\n               Amanda and Hawk are half-dressed post-coitus. She looks in \n               her purse.\n\n<b>                                     HAWK\n</b>                         Amanda, as ironic as this is gonna \n                         sound, I can't take any money for... \n                         I'm no Midnight Cowboy, y'know. It \n                         would only cheapen the whole deal \n                         for me.\n\n<b>                                     AMANDA\n</b>                         I'm not paying you for the lovemaking, \n                         Hawk. I just want you to have whatever \n                         you needed the money for when you \n                         took me up on my offer.\n\n               She forces the money into his palm.\n\n<b>                                     HAWK\n</b>                         ...Thanks.\n\n               They kiss.\n\n<b>                                     AMANDA\n</b>                         You're a good man, Hawk. Thank you.\n\n<b>               EXT. SMILEY MART - NIGHT\n</b>\n               The cashier, shoppers, and a gathering CROWD watch two cops \n               load the dazed man with the coat into a cruiser.\n\n<b>                                     COP #1\n</b>                              (to cashier)\n                         You wouldn't happen to know where we \n                         could find this... Dr. Love, would \n                         you?\n\n<b>                                     CASHIER\n</b>                         It's company policy to hand over a \n                         cash reward of a hundred and fifty \n                         dollars to anyone who stops a robbery. \n                         I gave him the money and he took \n                         off.\n\n               The cops shrug and get into the cruiser.\n\n<b>                                     COP #2\n</b>                         Okay, well, thanks anyway. And let \n                         us know if you happen to see him \n                         again. We'd like to ask him some \n                         questions.\n\n               The cruiser takes off and the cashier stares at her mood \n               ring. It throbs red like a beating heart.\n\n<b>                                     CASHIER\n</b>                              (sighing to herself)\n                         If I see Dr. Love any time soon, \n                         you're gonna have to wait till I'm \n                         done with him first.\n\n<b>               CAMERA TRACKS BACK QUICKLY AND SWINGS JUST AROUND THE CORNER.\n</b>\n<b>               EXT. SMILEY MART PARKING LOT - NIGHT\n</b>\n               We find Trip counting his money out to the little kid, Chongo, \n               and their two buds.\n\n<b>                                     TRIP\n</b>                         ...hundred forty, hundred fifty.  \n                         That's all I got.\n\n               The little kid puts the money in his pocket.\n\n<b>                                     LITTLE KID\n</b>                         Tsk. Tsk. Tsk. I really wanted things \n                         to work out for you, my weasly, dim-\n                         witted friend. You got spunk.\n                              (to Chongo)\n                         Chongo, give him a fifty dollar \n                         wallop.\n\n               Chongo reels back and...\n\n<b>                                     TRIP\n</b>                         Oh, no... Please, look.  I...\n\n               THWAM! Right in Trip's face. Trip flies off his feet into \n               the Smiley Mart brick wall with a THUD. A bag of weed drops \n               from his jacket, then some uppers, a few sheets of acid, and \n               finally a can of beer rolls out.\n\n<b>                                     CHONGO\n</b>                         Hey, the jerkoff's got drugs.\n\n<b>                                     LITTLE KID\n</b>                         Consider it a bonus, Chongo.\n\n               Chongo laughs like an ejaculating gorilla as he and his two \n               buds scoop it all up. The little kid, Chongo, and the buds \n               leave Trip lying in a puddle of his own nose blood.\n\n               He pulls out Stretch Armstrong and looks at him fondly.\n\n<b>                                     TRIP\n</b>                              (misty eyed)\n                         At least I still got you, Stretch.\n\n               Trip looks up. The six year olds who he stole it from stand \n               close by having watched the whole humiliating exchange. \n               Licked, Trip tosses the doll to them. They both dash away \n               with it, giggling.\n\n<b>               EXT. NEARBY STREET - NIGHT\n</b>\n               Christine sits in an idling taxi taking money from Lex, who \n               stands outside the window.\n\n<b>                                     LEX\n</b>                         This oughta be enough to get you to \n                         Disco Inferno, Christine.\n\n<b>                                     CHRISTINE\n</b>                         Come with. It's not too late for you \n                         to catch the fever.\n\n<b>                                     LEX\n</b>                         No can do. But I made a promise to \n                         get you to that disco, and we KISS \n                         maniacs are men of our word. \n                         Besides... you're pretty cool... for \n                         a stella, I mean.\n\n               Christine takes his hand and writes something on his palm in \n               lipstick.\n\n<b>                                     CHRISTINE\n</b>                         Here's my number. Tell me how cool I \n                         am over the phone sometime. Okay?\n\n               She gives Lex a kiss then pushes him away.\n\n<b>                                     CHRISTINE\n</b>                              (to CABBIE)\n                         Disco Inferno, on the double.\n\n               The taxi SCREECHES away as Lex smiles and gets back into the \n               Volvo.\n\n<b>               INT. COBO HALL - NIGHT\n</b>\n               Jam approaches the stadium, passing the MATMOKS, walking \n               straight up to Mrs. Bruce. Her back is to him. He taps her \n               on the shoulder. She turns. Her jaw drops. It escaped again! \n               And what an ugly tee-shirt.\n\n<b>                                     JAM\n</b>                         I'm gonna ask you nicely first. Mom, \n                         can I have my drumsticks back?\n\n               Taken aback by his confidence, Mrs. Bruce grabs his ear and \n               tries to pull him away. He won't budge.\n\n<b>                                     JAM\n</b>                         Again, can I have my drumsticks?\n\n               A BUNCH OF IDIOTS walk by with big transistor radios. One of \n               them holds a Mr. Microphone and heckles the MATMOKS.\n\n<b>                                     LEAD IDIOT\n</b>                         Hey, I'm on the radio! Hi, good-\n                         lookin'. We'll be back to pick you \n                         up later!\n\n               Mrs. Bruce yells at Jam through her bullhorn.\n\n<b>                                     MRS. BRUCE\n</b>                         Drumsticks are the least of your \n                         worries, young man. You are in a \n                         world of...\n\n               Jam yanks the Mr. Microphone from the lead idiot and screams \n               at his mother, his voice amplified on the transistors. \n               Everyone stares.\n\n<b>                                     JAM\n</b>                         I know, mom, I've been in trouble \n                         for about twelve hours now! \n                         Hellooooo!?\n\n               The other MATMOKS turn to look as Jam climbs onto a trash \n               receptacle and shouts down at his mother, his face slowly \n               turning purple.\n\n<b>                                     JAM\n</b>                         I'm gonna be spending the next two \n                         years of my life at St. Bernard's \n                         Boarding School, remember?! I'm gonna \n                         be outta your hair till I'm a legal \n                         adult, remember?! That way, all you \n                         have to do is go to church, light a \n                         candle, pray to a little statue for \n                         me, and voila! All is forgiven and \n                         forgotten, right mom?!! Then, you \n                         can spend your days in guilt-free \n                         pursuit of more constructive \n                         activities like telling everybody \n                         else how screwed up their lives are! \n                         That way you no longer need the \n                         patience and understanding required \n                         to communicate on some normal level \n                         with your own child!!! And that way \n                         you don't even have to think about \n                         how tough it was for you when you \n                         were growing up, and it's a good \n                         thing too. Cause if you did, you'd \n                         realize what a LOUSY, GODDAMN, SHITTY-\n<b>                         ASS, PARENT YOU ARE!!!\n</b>\n               The crowd of KISS fans APPLAUD Jam's rant. Mrs. Bruce is \n               utterly winded from the assault.\n\n<b>                                     MRS. BRUCE\n</b>                              (timidly)\n                         Jeremiah... what's gotten into you?\n\n<b>                                     JAM\n</b>                              (into Mr. Microphone)\n                         I just lost my virginity in a \n                         confessional booth! Lord have mercy!!\n\n               The crowd cheers. Jam jumps down and hands the Mr. Microphone \n               back to the lead idiot. He turns to his mom.\n\n<b>                                     JAM\n</b>                         For the last time, mom. Let me have \n                         my fucking drumsticks. Please.\n\n               Mrs. Bruce reaches into the trash, finds the drumsticks and \n               hands them to him. He spins them like pistols, then stuffs \n               them into his socks and walks away.\n\n<b>                                       SIMPLE PLAN\n</b>\n<b>               EXT. IT'S RAINING MEN STRIP CLUB - NIGHT\n</b>\n               Hawk runs to the scalper across the street who's selling a \n               ticket to another KISS fan.\n\n<b>                                     HAWK\n</b>                         Whoa! Whoa! WHOA! That better not be \n                         the last ticket! I hope you have \n                         another one for me!\n\n               The scalper sees Hawk and bolts down the street disappearing \n               around a corner. Hawk stops. He's lost him.\n\n               Hawk sulks to the now-familiar intersection where all four \n               landmarks meet. He takes one more look up the block at Cobo \n               Hall. Nearly all the KISS fans are inside. The streets are \n               almost deserted.\n\n<b>                                     HAWK\n</b>                         Fuck me!\n\n               He sees someone out of the corner of his eye across the \n               street. It's Jam. Lex approaches the other corner. Trip comes \n               up to the forth corner. They all stop when they see each \n               other. Each standing on his own corner. They're all pissed. \n               They meet in the middle of the street as last minute CONCERT \n               GOERS hurry by.\n\n<b>                                     HAWK\n</b>                         Any luck?\n\n<b>                                     TRIP\n</b>                         Plenty, but it was all bad.\n\n<b>                                     LEX\n</b>                         I found the Volvo.\n\n<b>                                     HAWK\n</b>                         Tickets?\n\n               They all shake no.\n\n<b>                                     HAWK\n</b>                         Well, dudes, the only way we're gonna \n                         see KISS this tour is by some fuckin' \n                         miracle.\n\n               Suddenly, a commotion up the street. A SURLY MOM yanks four \n               12 YEAR OLD BRATS dressed like KISS by the scruffs of their \n               necks. She's furious, they're CRYING.\n\n<b>                                     SURLY MOM\n</b>                         How dare you sneak out of the house \n                         like that! You had me worried to \n                         death! Don't you know this is Detroit! \n                         And for a degenerate band like KISS! \n                         They're sick, sick, sick and oughta \n                         be in jail with their vile antics!\n\n               She throws a wad of paper to the pavement as they pass our \n               four heroes. The dudes watch her pull the brats away.\n\n<b>                                     SURLY MOM\n</b>                         Just wait until your father gets \n                         ahold of you!\n\n               Jam, Hawk, Lex, and Trip turn and look at the crumpled wad \n               at their feet. It's an envelope. An ANGELIC SPOTLIGHT FROM \n               ABOVE highlights it.\n\n<b>                                     LEX\n</b>                         No... You don't think...?\n\n<b>                                     HAWK\n</b>                         Nah. Couldn't be.\n\n               They all shake their heads in unison resolved that it isn't. \n               Then, unable to control themselves, they dive for the \n               envelope. Jam tears it open. His trembling hand reaches in.  \n               All their eyes focus like lasers on what's inside.\n\n               Jam pulls out four KISS tickets. Their jaws drop. Their eyes \n               bug.\n\n<b>                                     JAM\n</b>                         It's a miracle! A miracle!\n\n               The boys are practically moved to tears. It's Divine \n               Intervention at its finest.\n\n               Suddenly, a greasy hand juts out of nowhere and grabs the \n               tickets. The boys look up shocked. They can't believe it.\n\n<b>                                     ALL FOUR BOYS\n</b><b>                         ELVIS?!!\n</b>\n               Yes, Elvis. Fire in his eyes. Mania on his mind. And tickets \n               in his hand.\n\n<b>                                     ELVIS\n</b>                              (laughing hysterically)\n                         Whose laughing now?! Whose laughing \n                         now, ya little shits?! I told ya... \n                         Over my dead body! Ha-HA-HAAA!\n\n<b>                                     HAWK\n</b>                              (arms outstretched)\n                         Take it easy, Elvis. Don't do anything \n                         crazy. Just give me the tickets before \n                         someone gets hurt.\n\n<b>                                     TRIP\n</b>                         Hey, wait a minute! This ain't school \n                         property! He's not the boss of us \n                         here!\n\n<b>                                     ELVIS\n</b>                              (crazed)\n                         That's right. This ain't school. \n                         It's not about school anymore. Now \n                         it's personal.\n\n<b>                                     LEX\n</b>                         Come on, Elvis. We was only kiddin'. \n                         It's all in good fun. We run, you \n                         chase. Cat and mouse. You know.\n\n<b>                                     ELVIS\n</b>                         Boys, this time... I win!\n\n               Elvis stuffs all four tickets in his mouth and chews crazily. \n               In seconds, GULP. Elvis explodes into unhinged laughter as \n               he runs away zigzagged down the street.\n\n               Our boys are left dumbstruck and speechless. After a really \n               long pause...\n\n<b>                                     JAM\n</b>                         Well... I still got my idea if anybody \n                         will let me speak.\n\n<b>                                     HAWK\n</b>                              (beaten)\n                         Go ahead, Jam.\n\n<b>                                     JAM\n</b>                         We all beat each other up, then, \n                         once we're nice and bruised, we run \n                         over to the ticket takers and say we \n                         got mugged and our tickets were \n                         stolen. They gotta let us in then.\n\n               They stand and think for a moment. Hawk's mouth curls into a \n               devilish grin.\n\n               Then, he lets out a gigantic \"AIEEE!!! and slugs Jam. The \n               four boys brutally pummel one another in the middle of the \n               intersection. Punching. Kicking. Headbutting.\n\n<b>               EXT. COBO HALL - NIGHT\n</b>\n               Two TICKET TAKERS are letting the last KISS fans in. They're \n               about to close the doors when our four bloodied and bruised \n               heroes come running up.\n\n<b>                                     HAWK\n</b>                         Dude, you gotta let us in! Four \n                         muggers just stole our tickets!\n\n<b>                                     TICKET TAKER\n</b>                              (sceptical)\n                         You expect us to believe that?\n\n<b>                                     JAM\n</b>                         Look at us!\n\n               Trip points into the crowd of fans inside the auditorium \n               foyer.\n\n<b>                                     TRIP\n</b>                         It was those assholes! They even \n                         stole my wallet!\n\n               The ticket takers turn to see the little kid, Chongo, and \n               their two buds just going in. The ticket takers signal two \n               security guards who proceed to stop the four stunned kids \n               and confiscate their tickets. They find all the stolen dope \n               and Trip's wallet.\n\n<b>                                     TRIP\n</b>                         Inside that you'll find my KISS Army \n                         picture I.D. and a hundred fifty \n                         bucks cash.\n\n               The security guards see he's right and break out the cuffs.\n\n<b>                                     TRIP\n</b>                              (to little kid)\n                         Tsk. Tsk. Tsk. I was really hoping \n                         things would work out for you, my \n                         weasly, midget friend. You got spunk.\n\n               The little kid for once is speechless.\n\n               Then the ticket taker extends his arm in SLOW MOTION into \n               COBO Hall as if to say \"Entrez Vous.\" The four friends pause.\n\n<b>                                     JAM\n</b>                         This is it!\n\n               They take a few slow steps almost as if they don't believe \n               it, then run like the wind into the auditorium.\n\n<b>                                    DETROIT ROCK CITY\n</b>\n<b>               INT. COBO HALL AUDITORIUM - NIGHT\n</b>\n               The lights are out. The lighters have been lit. The CROWDS' \n               ROAR is deafening.\n\n               Jam, Hawk, Trip, and Lex plow their way through the throngs \n               and head straight for the front row just as Simple Simon \n               takes the stage.\n\n<b>                                     SIMPLE SIMON\n</b>                         You wanted the best! And you got the \n                         best! The hottest band in the world... \n<b>                         KISS!!!\n</b>\n               Simple Simon runs from the stage just as the opening chords \n               to DETROIT ROCK CITY BEGIN.\n\n               On the beat, BOOM, FIREWORKS shoot from the floor alighting \n               the place. KISS takes the stage descending on hydraulic \n               elevators.\n\n<b>               ON JAM, HAWK, TRIP, AND LEX\n</b>\n               They're seeing God!\n\n               The show is spectacular. The costumes. The make-up. The \n               blitzkrieg of pyrotechnics. The flashing KISS sign. Ace's \n               smoking guitar. Gene's spewing fire. Paul's rockin' vocals. \n               Peter's kick-ass beat.\n\n               Then, something really weird happens.\n\n               The crowd behind the boys heaves forward. Jam is pushed like \n               a twig in a flood and over the shoulders of those in front \n               of him. Purely by accident, he is thrown onto the stage \n               landing on his stomach between Paul and Gene. Just before \n               Peter's drum solo is about to start.\n\n               Gene, Paul, and Ace silence their instruments. Peter throws \n               his drumstick into the air intending to catch it when it \n               comes down. But the sight of Jam landing on the stage \n               distracts him.\n\n               All is mute as Peter misses the drumstick. It hits the outside \n               edge of one of the drums.\n\n               Thinking fast, Jam grabs one of his drumsticks out of his \n               sock and tosses it to Peter. It tumbles through the air in \n               SLOW MOTION with a LOW, WHOOPING, HELICOPTER SOUND. We see \n               the word \"Mystery\" clearly as it twirls.\n\n               Instantly, it's caught in Peter Criss's hand and he brings \n               it down on his drum not missing a beat. The song resumes \n               with all its fury as Peter's drum kit ascends on a hydraulic \n               platform.\n\n               Jam scrambles from the stage and leaps back into the audience \n               barely missing the claws of some security guards.\n\n               The four friends pound on each other with unbridled, teenage \n               exuberance. Will it ever get any better than this?\n\n<b>               FREEZE FRAME.\n</b>\n<b>                                                             FADE TO WHITE:\n</b>\n<b>                                         THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Detroit-Rock-City.jpg\"/>\n</td><td><h1>Detroit Rock City</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Carl V Dupre\" title=\"Scripts by Carl V Dupre\">Carl V Dupre</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Musical\" title=\"Musical Scripts\">Musical</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Detroit Rock City Script.html#comments\" title=\"Detroit Rock City comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:03:39.359956"}