{"title": "Dragonslayer", "film_link": "/Movie Scripts/Dragonslayer Script.html", "script_link": "/scripts/Dragonslayer.html", "info_raw": "\n\nDragonslayer Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Hal Barwood  Matthew Robbins\nGenres  Action  Adventure  Fantasy\nScript Date :  1981\n\nRead \"Dragonslayer\" Script\n\n\n", "script": "\n                                      \"DRAGONSLAYER\"\n\n                                      Screenplay by\n\n                             Hal Barwood and Matthew Robbins\n\n                                      SHOOTING DRAFT\n\n                \n\n               FADE IN:\n\n               CASTLE - NIGHT\n\n               Now comes the moon riding over the horizon. Upon a hill at \n               the edge of the wood squats a castle, its crude stonework \n               bathed in cold silvery light. Queer carvings and runes \n               decorate the ponderous gate. Heavy vines are climbing up the \n               walls. The castle is old, its unfamiliar form testament to \n               an ancient mind and an ancient craft. Flickering candle light \n               dances on a leaded windowpane.\n\n               Inside, the corridors are dark and silent. Under low arched \n               ceilings the uneven floors are paved with stone blocks. \n               Perched over lintels and crouched in niches are icons with \n               strange animal heads.\n\n               HODGE\n\n               A sleep on a straw palette in a room strewn with vegetables \n               and crockery is Hodge, a wrinkled old retainer. A flickering \n               candle and empty jug are beside the bed. He is snoring gently.\n\n               CONJURING ROOM\n\n               This circular chamber at the heart of the castle is stuffed \n               with parchments, scrolls, dusty books, bronze braziers, glass \n               retorts, chemical salts, birds both stuffed and caged. An \n               iron candelabra stands on a work table, tapers burning. In \n               the soft glow it seems that the room is unoccupied, but no, \n               moving in the background is a shadowy figure, preparing for \n               a magical deed. Feet are positioned carefully within a \n               pentagram chiseled into the floor. A scroll is consulted; up \n               comes an arm and a voice blurts out:\n\n                                     VOICE\n                         Omnia in duos: Duo in Unum: Unus in \n                         Nihil: Haec nec Quattuor nec Omnia \n                         nec Duo nec Unus nec Nihil Sunt.\n\n               Nothing happens.\n\n                                     VOICE\n                         Come on, candles, out!\n\n               But the little flames stand at attention without so much as \n               a tremble.\n\n                                     VOICE\n                         In Volunta Divina et Verbum Magi: \n                         Lux! Exstinguat!\n\n               It's no use. There is a sigh and the figure moves forward \n               into the light. Revealed in the glow is the discouraged face \n               of Galen Bradwardyn, sorcerer's apprentice.\n\n               TOWER\n\n               Carrying the candelabra, the youth trudges up a circular \n               staircase.\n\n               TURRET\n\n               The highest point of the castle is a turret, open to the \n               stars and the night air. Here, more magic is afoot. An old \n               enchanter, Ulrich, Magister Ipsissimus, pours water from a \n               silver ewer into a stone bowl. As the surface ripples \n               disappear he leans forward and gazes into the pool. All at \n               once his face hardens as the distant sounds of screams and \n               thunder reach his ears. Lights and shadows, reflected from \n               within the basin, play across his face. His frown deepens as \n               the sound of his own voice comes to him from the vision in \n               the water -- Draco draconis -- suddenly squelched by the \n               roar of flame and an ugly snarl.\n\n               At that moment Galen reaches the top of the steps and holds \n               up the candelabra.\n\n                                     GALEN\n                         Vide, Magister. There's something \n                         wrong.\n\n               Ulrich, startled from his trance, slaps the water out of the \n               basin and turns to confront his student. Galen is taken aback \n               by the old man's grim countenance.\n\n                                     GALEN\n                         What's the matter? What's happened?\n\n                                     ULRICH\n                         I've just seen something. Something \n                         of consequence to you.\n\n                                     GALEN\n                         To me?\n\n                                     ULRICH\n                              (calm)\n                         Yes. My own death.\n\n               With a distracted gesture he causes the flames to extinguish \n               themselves.\n\n                                     ULRICH\n                         Perhaps we had better hasten your \n                         training.\n\n                                                                    CUT TO:\n\n               BARNYARD - DAY\n\n               Outside the castle wall Hodge is feeding the chickens and \n               ducks. He straightens up and squints through the early morning \n               mists. On a distant hillock two figures are moving toward \n               the woods.\n\n               ULRICH AND GALEN\n\n               Hobbling slowly with the aid of a pair of canes, Ulrich guides \n               his pupil across a wooden bridge and along a stream into the \n               forest.\n\n                                     ULRICH\n                              (stern and troubled)\n                         This wood, these leaves, the birds, \n                         the very dome of heaven, once they \n                         all rang with one great chord: and \n                         philosophers like me kept it all in \n                         tune. Now, new voices are singing \n                         new songs.\n                              (sharply)\n                         Have you mastered the threefold \n                         transmutation?\n\n                                     GALEN\n                         Of course.\n\n                                     ULRICH\n                              (skeptical)\n                         You have?\n\n                                     GALEN\n                         Well, almost.\n\n                                     ULRICH\n                         It's very difficult. Have you \n                         committed to memory undying the Codex \n                         de Profundis?\n\n                                     GALEN\n                              (a shrug)\n                         The first two chapters.\n\n                                     ULRICH\n                         It's long. And what about the Ritual \n                         of Banishment as prescribed by my \n                         late master Balisarius?\n\n                                     GALEN\n                         To tell the truth, I haven't dared \n                         try it. What's the point, anyway?\n\n                                     ULRICH\n                         The point? The point is you don't \n                         know it, and you're no magician \n                         without it. It was my hope to school \n                         you, to mold your faculties and \n                         wits... I still believe you have \n                         some talent. Somewhere.\n\n                                     GALEN\n                         I hate books. I hate drill. I want a \n                         real task.\n\n                                     ULRICH\n                         There's no time now. When I'm gone, \n                         half the powers in the universe will \n                         vanish with me. And what's the use \n                         of a few lingering skills if they're \n                         left in the hands of a child?\n                              (pause)\n                         Listen!\n\n                                     GALEN\n                         I don't hear anything.\n\n               Ulrich gauges the young man standing before him and makes a \n               decision. Reaching under his cloak he lifts off a fine silver \n               chain with an amulet dangling from it. He drapes it around \n               Galen's neck.\n\n                                     ULRICH\n                         Here, wear this.\n\n               Galen instinctively wraps his hand around the jewel. He cocks \n               an ear.\n\n                                     GALEN\n                         Voices, singing on the road.\n\n               He hastens forward to a promontory, eager to have a look. \n               Ulrich does not follow. Instead, doffing his cloak, he whirls \n               it before him, where it magically floats a few feet off the \n               ground. Awkwardly, the old man clambers aboard.\n\n                                     GALEN\n                         I don't see anything.\n\n               He turns back, but the wizard is gone. A shadow falls over \n               him. He looks up. There, two hundred feet above the tree \n               tops his master is soaring on the wind.\n\n               AIRBORNE\n\n               The old conjurer squints into the distance. Miles away and \n               far below a company of drab walkers winds along the margins \n               of the forest. They are singing a mournful round.\n\n               GALEN\n\n               He gawks skyward. Suddenly, the old man leans down and \n               addresses him.\n\n                                     ULRICH\n                              (a shout)\n                         We have visitors!\n\n                                                                    CUT TO:\n\n               ROTUNDA - NIGHT\n\n               Clustering together in the center of a wide reception hall \n               is a contingent of weary peasants, awkward amidst the dusty \n               rugs, drapes and heavy furniture. Their leader is a fineboned \n               youth, not yet twenty. Like the others, he is uneasy; his \n               name is Valerian. Hodge enters and sets a tray of mead before \n               them. He leaves without a word. The visitors stare glumly at \n               the refreshment, but are too timorous to go near it.\n\n               CONJURING ROOM\n\n               Galen helps Ulrich prepare for the audience. The sorcerer \n               peers at himself in a full-length mirror, adjusting the hem \n               of a black robe.\n\n                                     ULRICH\n                         Looks forbidding enough, don't you \n                         think?\n\n                                     GALEN\n                         Here are your sticks.\n\n                                     ULRICH\n                         No -- they'll think me infirm. You \n                         know, Balisarius wore this whenever \n                         he changed lead into gold. He could \n                         really do that, you know. I never \n                         could. Too bad -- you'd stand to \n                         inherit some real wealth.\n\n                                     GALEN\n                         You're in a morbid frame of mind. \n                         What's all this about dying? You \n                         don't even look sick.\n\n                                     ULRICH\n                              (tying on a sash)\n                         You still wearing that amulet?\n                              (Galen nods)\n                         Good. Don't lose it. It still belongs \n                         to me.\n\n               He backs away from the mirror and fits a silver coronet onto \n               his head.\n\n                                     ULRICH\n                         Now, adeptus minor, get yourself a \n                         handful of that sulphurous ash over \n                         there...\n\n               The sorcerer starts down a circular stone staircase.\n\n               THE ROTUNDA\n\n               The visitors watch warily as a door swings open and Galen \n               makes his entrance, his face expressionless and hands pressed \n               together. He looks rather young to be the famous Ulrich.\n\n               Galen allows a moment to go by, then throws his arms wide. \n               Ka-whump! and Ulrich appears in the doorway in a smoky \n               fireball. Alarmed, the visitors retreat.\n\n                                     ULRICH\n                         Nunc habeus lux!\n\n               Pffst! around the room candles flare in their niches.\n\n                                     ULRICH\n                         Et calor!\n\n               In the fireplace, the birch logs are suddenly ablaze. Ulrich \n               totters to the hearth and extends long bony fingers toward \n               the warmth.\n\n                                     ULRICH\n                         Welcome to Cragganmore. I am Ulrich. \n                         Which one of you calls himself \n                         Valerian?\n\n               The travelers are suitably dazzled by the magician's \n               performance. The young leader of the party screws up his \n               courage and speaks.\n\n                                     VALERIAN\n                         That would be me. We are here on \n                         behalf...\n\n                                     ULRICH\n                         I know why you're here. You're a \n                         delegation from Urland, from beyond \n                         Dalvatia. Let's see the artifacts.\n\n               The travelers exchange nervous glances. Valerian motions to \n               one of his companions. The man steps forward and hands over \n               a leather pouch. One by one, Valerian places the contents on \n               the table for Ulrich's inspection.\n\n                                     VALERIAN\n                         A bone. Scorched. A rock, fire-\n                         blackened.\n                              (pause)\n                         Scales.\n\n               At this, Ulrich advances and closely examines three shimmering \n               irridescent disks as big as saucers.\n\n                                     ULRICH\n                         All right. How did you come by these?\n\n                                     VALERIAN\n                              (proudly)\n                         I found them. At the mouth of the \n                         lair.\n\n                                     ULRICH\n                              (grim)\n                         What else?\n\n               Valerian reaches under his jerkin and withdraws what appears \n               to be a curved sword. He jabs it into the table.\n\n                                     VALERIAN\n                         A claw.\n\n                                     ULRICH\n                         That's no claw. It's a tooth. By the \n                         gods!\n\n               He runs a finger along a serrated edge and gazes bleakly at \n               his visitors.\n\n                                     ULRICH\n                         And you want me to do battle with \n                         that?\n\n               Valerian has lost all trace of timidity.\n\n                                     VALERIAN\n                         Who else can we turn to? We all know \n                         what we're dealing with here. This \n                         is a basilicok.\n                              (he takes a step \n                              forward)\n                         A cockatrice.\n                              (another step, bolder)\n                         A dragon.\n                              (he leans close to \n                              Ulrich)\n                         This is no stag, no bear, no natural \n                         creature. This is one of your kind. \n                         And only a necromancer such as \n                         yourself can rid us of it.\n\n                                     ULRICH\n                         Did you try the Meredydd sisters? \n                         What about Rinbod? I've heard it \n                         said he killed a dragon once.\n\n                                     VALERIAN\n                         They're all dead. You're the only \n                         one left.\n\n               With a sigh, Ulrich lowers himself into a chair. He rubs his \n               withered legs and shakes his head.\n\n                                     ULRICH\n                         It's a long way to Urland.\n\n                                     VALERIAN\n                         Every quarter, upon the solstices \n                         and the equinoxes there's a new \n                         victim.\n\n               Greil, a grizzled peasant, speaks up.\n\n                                     GREIL\n                         My daughter, for one.\n\n                                     OTHER TRAVELERS\n                         My sister... cousins...\n\n                                     ULRICH\n                         All women?\n\n                                     VALERIAN\n                         Girls. Virgins, to be exact, chosen \n                         by lot.\n\n               Galen edges over to the table and inspects the scales and \n               tooth.\n\n                                     GALEN\n                         Master, don't you think --\n\n                                     ULRICH\n                         Silence!\n\n               He broods for a long time.\n\n                                     VALERIAN\n                         Are you afraid of dragons?\n\n                                     ULRICH\n                         No. Sorcerers and dragons go back a \n                         long long time together. If it weren't \n                         for sorcerers, there wouldn't be any \n                         dragons.\n                              (pause)\n                         All right. I'll go.\n\n                                                                    CUT TO:\n\n               COURTYARD - DAY\n\n               The travelers are making ready for departure in the grey \n               light of dawn. As Hodge stuffs provisions into a wicker box, \n               Ulrich wraps padding on a newly fashioned pair of crutches.\n\n                                     ULRICH\n                         I know of this dragon. Vermithrax \n                         Pejorative: she's four hundred years \n                         old. As far as I can tell she's the \n                         last of her kind. Very appropriate \n                         that I'm the one to finish her off, \n                         don't you think?\n                              (he tries out the \n                              crutches)\n                         There. Flatten the highest mountain. \n                         What say you, Galen?\n                              (no answer)\n                         Speak up.\n                              (still no answer)\n                         You, Hodge.\n\n               Hodge mutters something inaudible and grimly keeps packing.\n\n                                     ULRICH\n                              (to Galen)\n                         While I'm gone see you keep your \n                         nose in your books and your hands \n                         out of my reagents. Leave my \n                         instruments alone too.\n\n               Galen crouches against the castle wall; he regards his master \n               sullenly.\n\n                                     GALEN\n                         Look at yourself. How far will you \n                         get like that? A league, two leagues?\n\n                                     ULRICH\n                         I'm not worried about the road.\n\n                                     GALEN\n                              (sarcastic)\n                         Why don't you wave your hands around \n                         and summon up a coach-and-four?\n\n                                     ULRICH\n                         Don't mock me.\n\n               Galen gets up and calls out to the Urlanders.\n\n                                     GALEN\n                         You pilgrims: You're used to \n                         lotteries. Why not draw straws to \n                         see who'll be first to carry \n                         ironshanks here.\n\n               This is too much for Hodge.\n\n                                     HODGE\n                         Hold your tongue. If the master's \n                         got a mind to go, he'll go.\n\n               Galen approaches the old sorcerer.\n\n                                     GALEN\n                         Send me. You're always saying I need \n                         seasoning. I need a test. Let me go.\n\n                                     ULRICH\n                         You're not ready.\n\n                                     GALEN\n                         I'm ready for anything.\n\n                                     ULRICH\n                              (wan smile)\n                         Don't be so hasty. Your time will \n                         come.\n\n               The walkers are ready to set forth. Hodge picks up his pack, \n               steps forward and pulls open the great gate.\n\n               HORSEMEN\n\n               Three mounted men are outside the gate, helmets on their \n               heads, swords on the belts and longbows across their \n               shoulders. They look formidable. The Urlanders take a step \n               backward.\n\n                                     VALERIAN\n                         Tyrian!?\n\n               Tyrian is a lean, heavily bearded nobleman. There is a coat \n               of arms on the shield strapped to the pommel of his saddle.\n\n                                     TYRIAN\n                              (amiable)\n                         Good morning, all.\n\n                                     VALERIAN\n                         We're not afraid of you. Give us the \n                         road.\n\n                                     TYRIAN\n                         Why, the road is yours. All the way \n                         to Urland. It's a long journey, isn't \n                         it? But when you're in search of a \n                         sorcerer, I suppose no distance is \n                         too great.\n\n               Sensing trouble, Galen moves forward. Ulrich touches his \n               arm.\n\n                                     ULRICH\n                              (under his breath)\n                         Say nothing.\n\n               Galen hears the urgency in the old man's voice and obeys. \n               Hodge takes it upon himself to deal with the strangers.\n\n                                     HODGE\n                         What do you want with us?\n\n                                     TYRIAN\n                         Well, like my good friends here, \n                         I've come for a bit of black magic. \n                         No doubt you've heard of our troubles \n                         at home. This is Cragganmore, is it \n                         not?\n\n                                     HODGE\n                         Aye, this be the place of Ulrich.\n\n               Tyrian dismounts and saunters up to the old magician.\n\n                                     TYRIAN\n                         And here we have the mystical presence \n                         himself, no?\n\n                                     HODGE\n                         You'd best keep your distance -- and \n                         your manners.\n\n                                     TYRIAN\n                         If he's ready to lay a dragon in its \n                         grave, he's got nothing to fear from \n                         me.\n                              (turns to the Urlanders)\n                         I've no more love for that creature \n                         than you lot. Nor has the King. But, \n                         before you stir things up, don't you \n                         think it a good idea to see you've \n                         got the right man for the job?\n\n                                     HODGE\n                         Aha -- it's a test you're looking \n                         for. We don't do tests.\n\n                                     TYRIAN\n                         I'm sure you don't. They never do \n                         tests -- and not many real deeds \n                         either. Oh, conversation with your \n                         grandmother's shade in a darkened \n                         room, the odd love potion or two... \n                         but comes a doubter, well then, it's \n                         the wrong day, the planets are not \n                         aligned, the entrails aren't \n                         favorable, we don't do tests.\n\n                                     VALERIAN\n                         We've got no doubts. We require no \n                         test.\n\n                                     HODGE\n                         And you're not going to get one.\n\n               When Ulrich finally speaks, his voice is low and \n               authoritative.\n\n                                     ULRICH\n                              (to Galen)\n                         Go to the conjuring room. The iron \n                         box. Fetch me the dagger within.\n\n               Galen's eyes widen with alarm.\n\n                                     ULRICH\n                         The dagger. Be quick.\n\n               Galen dashes into the castle. Ulrich gazes almost shyly at \n               Tyrian.\n\n                                     ULRICH\n                         You shall have your test.\n\n               CONJURING ROOM\n\n               Galen comes puffing up the steps, locates the iron box, and \n               flings it open. Amidst the tawdry paraphernalia of a \n               professional magician is an ivory-handled dagger covered \n               with runic inscriptions. Galen eagerly examines it to see \n               how the blade might twist aside or collapse into the handle, \n               but it is all too genuine. A murder weapon.\n\n                                     ULRICH'S VOICE\n                              (impatient)\n                         Where are you, boy? I'm waiting.\n\n               Galen throws open a window and looks down into the courtyard. \n               He displays the dagger.\n\n                                     GALEN\n                         Not this one, was it?\n\n                                     ULRICH\n                         The very one. Let it fall.\n\n               Galen hesitates, then tosses it. Tumbling end over end, it \n               arcs downward. The old conjurer calmly stretches out a hand \n               and plucks it neatly out of the air. Galen watches as Ulrich \n               passes the weapon to Tyrian and strips back his robe exposing \n               a bony chest. Galen knows what's coming. He rushes for the \n               door. He's only a step away when it bangs shut of its own \n               accord. He sprints for a second exit. Whack! This door slams \n               shut too. Locked in. Quick, back to the window and climb \n               down the vine... Smack! the heavy shutters seal him in.\n\n               ULRICH AND TYRIAN\n\n               Ulrich takes Tyrian's arm and guides the point of the dagger \n               to his breastbone.\n\n                                     ULRICH\n                         Vita regula, vita hieratica!\n\n               Everyone is filled with dread. Hodge is shaking. From the \n               castle come the rattling of shutters and Galen's muffled \n               cries. A sick sarcastic smile has crept over Tyrian's lips. \n               He tenses himself to thrust.\n\n                                     ULRICH\n                         Go on. Don't worry, you can't hurt \n                         me.\n\n               CONJURING ROOM\n\n               Galen stops hammering and presses his face to a crack in the \n               shutter. Below he can see the participants in this grisly \n               drama. He holds his breath. Tyrian makes a sudden movement \n               and buries the blade in Ulrich's chest. But the sorcerer \n               stands unbent, seemingly unhurt. Then, after a long moment, \n               he slowly sags forward over the dagger and the hand that \n               holds it. Tyrian shrinks back and allows the body to fall in \n               a heap. Very quickly he remounts. In another moment he and \n               his companions are gone. The others are riveted in horror. \n               Hodge sinks to his knees and wails his grief.\n\n               Galen turns away from the window and gazes blankly into the \n               gloomy conjuring room. Click! The doors unlatch themselves \n               and swing open.\n\n                                                                    CUT TO:\n\n               FUNERAL PYRE - DAY\n\n               Ulrich, principal magician and sorcerer of the western world, \n               reposes on a hardwood pyre. His hands are folded on his chest. \n               His face is peaceful. While the visitors wordlessly look on, \n               Galen touches a burning brand to the kindling. At first the \n               fire catches normally enough, but when the flames start to \n               envelop the body they suddenly turn pale green, producing an \n               unearthly roar. The onlookers back away from the intense \n               heat.\n\n               GALEN\n\n               The erstwhile apprentice stands his ground, blinking back \n               tears, his face weirdly illuminated by the fire.\n\n                                                                    CUT TO:\n\n               CONJURING ROOM - DAY\n\n               Galen sits alone amidst the museum-like collection of magical \n               apparatus. He stares at the amulet, considering its \n               significance. His reverie is interrupted by the murmur of \n               voices below. At the window he looks down to see Hodge bidding \n               farewell to the delegation from Urland. Valerian is the last \n               to leave. He pauses at the gate and glances up at Galen. \n               Then he moves on. The young student of magic sets his jaw, \n               suddenly filled with resolve.\n\n               Moving through the room, he busies himself with the old man's \n               effects. He scoops up the loose books and parchments and \n               locks them into trunks. He drapes muslin cloths over the \n               alchemical devices. He sows a handful of salt over the \n               pentagram inscribed in the floor. Finally, he opens the cages \n               and releases the crow, the falcon, and the great horned owl.\n\n               COURTYARD\n\n               Hodge is up on the burned out funeral pyre, anxiously scraping \n               ashes and small bones into a leather pouch -- the remains of \n               Ulrich. Up behind him comes Galen, now clad in a traveler's \n               cloak, with a pack on his back and a staff in his hand.\n\n                                     GALEN\n                         Hodge -- what are you doing?\n\n               Hodge quickly conceals the pouch.\n\n                                     HODGE\n                         Just making my farewell, thank you \n                         very much.\n\n               He quickly climbs down, picks up his pack and follows Galen \n               out through the gate. As the door is pushed shut a huge oaken \n               timber falls into place, barring the castle against the \n               uninvited.\n\n                                                                    CUT TO:\n\n               HILLTOP - DAY\n\n               Galen and Hodge labor to the crest of a grassy hill and turn \n               to look back across a wide valley. There on another hilltop \n               on the far side sits Cragganmore, lit by the red rays of the \n               setting sun. Galen removes the amulet from his neck and \n               clutches it in his fist. Hodge is bug-eyed to see it.\n\n                                     HODGE\n                         Be careful with that! You don't know \n                         what you're doing.\n\n                                     GALEN\n                         Stand back!\n\n               He raises his hands toward the castle and calls out:\n\n                                     GALEN\n                         Cragganmore! Domus non i am! Silva \n                         celet!\n\n               CRAGGANMORE\n\n               The vines on the castle walls begin to twitch and stretch, \n               magically brought to animate life. They flow upward over the \n               masonry, branching out and covering every surface, then up \n               onto the roof. Finally only the tops of the chimneys and the \n               highest turrets stand above the green carpet. A century's \n               growth in a matter of seconds.\n\n               GALEN & HODGE\n\n               On their hilltop the old retainer gives the youth a fearful \n               look. Galen is too flushed with excitement over what he has \n               done to notice.\n\n                                                                  DISSOLVE:\n\n               FOREST PATH - DAY\n\n               Galen and Hodge trudge along an overgrown cart-track under \n               an arch of trees.\n\n                                     HODGE\n                         Oh, it's a vale of tears in which we \n                         dwell. It doesn't matter who you \n                         are, a king in his robes, a peasant \n                         in his rags, when your time comes, \n                         no magic can save you...\n\n                                     GALEN\n                         I guess...\n\n               The apprentice's mind is elsewhere: he's got a coin hovering \n               in mid-air above his palm, bobbing gently as he walks.\n\n                                     HODGE\n                         ...the kindest lord a man could ask \n                         for... now he's gone. Ye gods he was \n                         fussy about his bath. And you'd think \n                         he could boil his own eggs with the \n                         snap of a finger, but no, he had old \n                         Hodge do it, of course.\n                              (snurfling)\n                         Up before five I was, mucking out \n                         the cages, slopping the pigs, and \n                         never once got so much as a thankyou \n                         or a pat on the back...\n                              (through tears)\n                         I'm going to miss him.\n\n                                     GALEN\n                         Me too...\n\n               He plucks a low-hanging leaf, waves a hand over it, and \n               watches it turn into a spray of daffodils.\n\n                                     HODGE\n                         No you don't. All you care about is \n                         the tricks and knavery. Well, you \n                         don't pull any wool over these old \n                         eyes. It'll be a mighty long walk \n                         before you fill his shoes, you mark \n                         my word.\n\n                                     GALEN\n                         What's the matter, Hodge, pack too \n                         heavy? Here.\n\n               He gives the pack a slap. It flies out of its harness and \n               floats alongside them. Hodge snatches it back and clutches \n               it tightly.\n\n                                     HODGE\n                         Careful with that!\n\n                                     GALEN\n                         Too cold, is it?\n\n               A great coat drapes itself over Hodge's shoulders.\n\n                                     HODGE\n                         Stop it!\n\n                                     GALEN\n                         Too warm?\n\n               The greatcoat disappears, as do the rest of his garments, \n               leaving him in his smalls.\n\n                                     HODGE\n                              (spluttering)\n                         Stop it, I say! Out of respect for \n                         the master!\n\n               Suppressing a grin, Galen mercifully waves his hand and \n               restores Hodge to his usual costume.\n\n                                     GALEN\n                         I've got as much respect for the \n                         master as anyone, old man. But -- \n                         then again, I'm master now.\n\n                                                                    CUT TO:\n\n               TRAVELERS' CAMP - NIGHT\n\n               The Urlanders are gathered around a fire, sharing a meager \n               supper. The man named Greil pokes at the stew-pot.\n\n                                     GREIL\n                         I left my farm with seeds unplanted, \n                         calves unborn, nothing but a wife to \n                         chase down the strays, and for what? \n                         A funeral, that's what.\n\n               He walks up and down behind Valerian.\n\n                                     GREIL\n                         Because some people said, find a \n                         magician. Not just a local fellow, \n                         an import, a good forty leagues from \n                         home. An all-powerful necromancer. \n                         Ha -- some necromancer!\n\n               Malkin, an older man, speaks up.\n\n                                     MALKIN\n                         Hold your tongue, Greil. Sit. Eat.\n\n                                     GREIL\n                         I'll not sit. I'll not eat. See you \n                         the Great Bear. His tail points east. \n                         It's the equinox. Have you forgotten? \n                         Or rather not think about it?\n\n                                     VALERIAN\n                              (miserable)\n                         He's right. I brought us here for \n                         nothing. May the gods help whoever's \n                         daughter it is tonight.\n\n               There is a noise from the darkness beyond the campfire. Two \n               of the men get to their feet and listen. At first silence, \n               then more rustling. Without a word the two men dart into the \n               bushes and haul two interlopers before the company: Galen \n               and Hodge.\n\n                                     HODGE\n                         Good morrow, good morrow. Peace be \n                         with you.\n\n                                     GALEN\n                         Easy now. We mean no harm. We've \n                         been looking for you.\n\n                                     GREIL\n                              (growl)\n                         Well, you've found us.\n\n                                     GALEN\n                              (brushing himself off)\n                         More the other way around, I'd say.\n\n                                     VALERIAN\n                         What do you want?\n\n                                     GALEN\n                         A few words, that's all. You were \n                         looking for a conjurer.\n\n                                     VALERIAN\n                         He's dead.\n\n                                     GALEN\n                         Right. Requiscat in pace.\n                              (he takes a deep breath)\n                         Ecce: magister novus!\n\n                                     GREIL\n                         How say you?\n\n               Galen surveys the puzzled faces. He draws himself up and \n               plunges in:\n\n                                     GALEN\n                         My lord Ulrich is no longer. All \n                         that you asked of him, you may now \n                         expect of me. The dangers he would \n                         face, I will now conquer. The task \n                         he would undertake I will now fulfill. \n                         I am Galen Bradwardyn, inheritor of \n                         Ulrich's craft and knowledge, and I \n                         am the Sorcerer you seek.\n\n               There is a moment of depressed silence. Hodge rolls his eyes. \n               Greil starts to chuckle, then to laugh. Soon the others are \n               laughing too.\n\n                                     GREIL\n                         Well, that's a handsome thought, O \n                         wizard of wizards. But if there's \n                         one thing our friend Tyrian has shown \n                         us, it's to beware the pig in the \n                         poke. Who's got a dagger?\n\n                                     HODGE\n                         No tests!!\n\n                                     GREIL\n                         Call it proof, then.\n\n               Someone brings out a dagger and hands it to Greil. Valerian \n               pushes it away.\n\n                                     VALERIAN\n                         We've seen enough tests.\n\n               But Greil persists, waving the knife at the group.\n\n                                     GREIL\n                         Well I haven't. All I've seen is \n                         death. Death in our families, death \n                         on the road, and tonight, death at \n                         home.\n\n               He lashes out with the knife. Galen jumps back, but Valerian \n               steps in, delivering a quick kick to Greil's gut, followed \n               by a right to the jaw that sends the bigger man sprawling. \n               He takes the knife.\n\n                                     VALERIAN\n                         What's come over you, anyway? Have \n                         you lost your wits?\n\n               He propels Galen out of harm's way and sits him down on the \n               other side of the fire. Greil nurses his jaw.\n\n                                     GREIL\n                         I don't like it. Young snot-nose \n                         comes in here for sport at our \n                         expense. We're on a fool's errand, \n                         but we don't have to listen to this. \n                         I don't want to hear any more about \n                         sorcery. I don't want to hear any \n                         more about spells.\n\n               Valerian hands Galen a plate of food.\n\n                                     VALERIAN\n                         You must be hungry.\n\n                                     GALEN\n                              (nods)\n                         What's the matter with him?\n\n                                     VALERIAN\n                         It's not just him. It's all of us. \n                         It's the equinox.\n\n               They both look up at the moon.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - NIGHT\n\n               The moon shines down on the far reaches of the Kingdom of \n               Urland, coldly lighting a barren landscape filled with the \n               skeletons of dead trees, blackened rock and bare ground. \n               Advancing across this mournful terrain is a troop of armed \n               men leading a blindfolded horse and tumbril. The horse is \n               skittish. Finally, in spite of shouts and lashings, it refuses \n               to go further. The leader, Horsrik, barks out an order:\n\n                                     HORSRIK\n                         Close enough! Bring her out!\n\n               A young woman, no more than seventeen, is brought forth from \n               the cart. Long black hair falls down over a white tunic. Her \n               dark eyes dart fearfully around in her pale face. She is \n               half-carried, half dragged to the edge of a steaming crack \n               in the ground where she is manacled to a wooden post. By \n               lantern-light, Horsrik reads from a parchment scroll.\n\n                                     HORSRIK\n                         Now be it known throughout the \n                         kingdom, that this maiden, having \n                         lawfully been chosen by a deed of \n                         fortune and destiny, shall hereby \n                         give up her life for the greater \n                         good of Urland.\n\n               There is a low rumble; the earth shakes. Horsrik glances \n               nervously around. He carries on by rote.\n\n                                     HORSRIK\n                         By this act shall be satisfied the \n                         powers that dwell underground and \n                         the spirits that attend thereto. In \n                         gratitude for this sacrifice His \n                         Majesty has declared the family -- \n                         what's the name? --\n\n               He prods the girl, but she is too terrified to speak. Beneath \n               them, the earth seems to groan. Smoke issues from the mouth \n               of the pit. One of the nervous witnesses leans forward.\n\n                                     RETAINER\n                         Plowman! The family Plowman!\n\n                                     HORSRIK\n                              (rushing it)\n                         -- the family Plowman to be free of \n                         obligations, taxations, levys and \n                         imposts for a period not to exceed \n                         five years...\n\n               The horse suddenly rears, and blindfold notwithstanding, \n               gallops off, dragging the tumbril over the rocks. The men \n               behind Horsrik break ranks and scatter.\n\n                                     HORSRIK\n                         -- ordained and signed this day, \n                         etc., Casiodorus, in his glory the \n                         reigning king of this our realm... \n                         his seal, his mark, duly read by \n                         Chancellor Horsrik in his holy name.\n\n               Now Horsrik joins the flight, chasing his men back over the \n               murky horizon.\n\n               THE GIRL\n\n               She strains against her manacles, cocking her head to listen \n               as the rumblings below subside. Presently the steam and smoke \n               blow away and she can see the horse pawing and stamping a \n               hundred yards distant, the wheel of the cart jammed between \n               rocks. Summoning up a wild will to live, she squeezes her \n               hands against the cold iron rings. No use. She spits on her \n               wrists and twists desperately. Blood starts. One hand slips \n               free. She looks at the horse. The animal tosses off its \n               blindfold and looks back at her. Now she strains again and \n               pulls her other hand free. She wipes the blood on her frock \n               and sprints toward the horse. But she doesn't get there. The \n               earth abruptly shifts from under her feet, tumbling her among \n               cracked and steaming rocks. When she raises her head a huge \n               shadow has fallen over the horse. There is a piteous whinny, \n               then a roar. The girl's face is suddenly lit by flames. She \n               scrambles to her feet and rushes back the other way.\n\n               THE CHASE\n\n               The girl hasn't taken a dozen steps when something huge \n               hurtles forward and blocks her way. Something scaly and \n               glittering. She whirls and stumbles off in a new direction. \n               This time she's cut off by a monstrous claw tipped with rapier-\n               like talons. She screams and crawls away. Another claw \n               prevents her escape.\n\n               THE CREATURE\n\n               Membranous wings fold down against the night sky. Up comes \n               the silhouette of a reptilian head swaying on a serpentine \n               neck. There's an angry hiss. A sheet of flame envelops \n               everything.\n\n                                                                  FADE OUT:\n\n               FADE IN:\n\n               FOREST - DAY\n\n               Tyrian kneels beside a mountain waterfall, having a drink \n               while his men hover in the background. One of them points \n               down the slope.\n\n                                     MAN\n                         There. I see them.\n\n               Tyrian wipes his mouth unhurriedly and strolls over to look. \n               Far below, half hidden by trees, the little company of \n               Urlanders winds its way through the forest.\n\n               A frown creeps over Tyrian's face.\n\n                                     TYRIAN\n                         Who's that old man?\n\n                                     MAN\n                         Where? Which one?\n\n                                     TYRIAN\n                         That one. That's the man from \n                         Cragganmore. Now what's he doing \n                         here?\n\n                                     MAN\n                         Filling in for the chief, I reckon.\n\n                                     TYRIAN\n                              (weary)\n                         What a pity.\n\n                                                                    CUT TO:\n\n               HODGE\n\n               Hodge marches along with the rest. When he's sure no one \n               else is looking he burrows into his garments and brings out \n               the leather pouch containing Ulrich's ashes. Reassured that \n               it's still with him, he tucks it away again. Galen falls \n               into step.\n\n                                     GALEN\n                         What have you got there?\n\n                                     HODGE\n                         None of your business.\n\n                                     GALEN\n                         A little gold, eh? What do you say I \n                         change it into lead?\n\n                                     HODGE\n                         Save your jokes for someone else. \n                         Me, I don't care for braggarts.\n\n               They pass Valerian, who has dropped out of line.\n\n                                     HODGE\n                         And I don't care for frauds.\n\n                                     GALEN\n                         I'm no fraud.\n\n                                     HODGE\n                         Call it fool then. Upstart. Whatever \n                         pleases you.\n\n                                     GALEN\n                         Hodge, nobody forced you to come \n                         along.\n\n                                     HODGE\n                         Oh, I'm here of my own free will, \n                         all right. We each do the master's \n                         bidding in our own way.\n\n                                     GALEN\n                         Well, if he told you I needed \n                         wetnursing, why don't you just turn \n                         yourself around and go back home.\n\n               Hodge snorts and fusses with his pack.\n\n                                     HODGE\n                         Home, is it? You've seen to that, \n                         haven't you? Gone to seed, I'd say...\n\n               He glances over and discovers Galen missing.\n\n               GALEN\n\n               He walks back along the trail, looking for Valerian. Pretty \n               soon the rest of the travelers are out of sight. He hears \n               the sound of a splash. He turns off the trail and pushes \n               through some shrubbery.\n\n               FOREST POOL\n\n               Under the oaks and hickory, a forest stream has widened into \n               a quiet pool. A pile of clothes lies on a rock at the edge. \n               Out in the middle, Valerian is treading water.\n\n                                     GALEN\n                         You're too far behind us. Come on \n                         out.\n\n                                     VALERIAN\n                         You go ahead, I'll catch up.\n\n                                     GALEN\n                         Not a good idea to get separated. \n                         Let's go.\n\n                                     VALERIAN\n                         Right. I'll be along.\n\n               Galen leans over and splashes some water on his face. Feels \n               good. He shucks his pack and starts to throw off his clothes. \n               Valerian doesn't like it.\n\n                                     VALERIAN\n                         That's all right. Don't come in.\n\n               But Galen is now naked and walking into the water. He swims \n               out toward Valerian.\n\n                                     VALERIAN\n                              (edgy)\n                         You better get back to the group, \n                         they're probably worried.\n\n               Galen keeps swimming.\n\n                                     VALERIAN\n                         I prefer to swim alone, if you don't \n                         mind.\n\n               But Galen has slipped beneath the surface; he doesn't hear.\n\n               UNDERWATER\n\n               Galen works his way through the murky green underwater world. \n               Suddenly, he stops short and stares. He's only a few feet \n               from Valerian's dangling legs. He gasps in surprise. Valerian \n               is no boy.\n\n               ON THE SURFACE\n\n               Galen comes shooting to the surface, coughing and sputtering.\n\n                                     GALEN\n                         By the gods!\n\n               Valerian is pale and frightened.\n\n                                     VALERIAN\n                         Stay away.\n\n               She propels herself backward, then turns and swims for shore.\n\n               ON THE SHORE\n\n               Galen and Valerian have taken refuge behind separate bushes. \n               Briskly they pull on their clothes.\n\n                                     VALERIAN\n                         I suppose you'll tell everyone. Go \n                         ahead, I don't care. It's a relief.\n\n                                     GALEN\n                         I'm not going to say anything.\n\n                                     VALERIAN\n                         I don't blame you. I was stupid. \n                         Careless. A silly woman!\n\n                                     GALEN\n                              (feeble bluff)\n                         Take it easy. I knew the moment I \n                         saw you. I've known the whole time.\n\n                                     VALERIAN\n                         You never knew a thing. No one knew. \n                         Not since I was born. Go on, run off \n                         and tell them. It'll make a great \n                         story.\n\n                                     GALEN\n                         Don't worry. No one's going to find \n                         out. Just tell me: why?\n\n                                     VALERIAN\n                         Ask my father.\n\n               They finish dressing in silence. Finally:\n\n                                     GALEN\n                         The lottery! Daughters are chosen, \n                         but sons are not!\n\n                                     VALERIAN\n                         That's right. Unless you have plenty \n                         of gold or property.\n\n                                     GALEN\n                         What do you mean?\n\n                                     VALERIAN\n                         If you're rich enough, your name \n                         never goes in.\n                              (bitter)\n                         My father is poor. So are a lot of \n                         fathers.\n\n               He studies her. She jams a hat down over her head and, once \n               more the young man, stalks off.\n\n               THE VISION\n\n               Galen walks down to the edge of the pool to retrieve his \n               pack. As he leans over he catches sight of what appears to \n               be a reflection in the water: Tyrian on horseback. He whips \n               around, but no one is behind him. Riveted by the vision, he \n               hurries along the bank to follow it. After a few paces the \n               blurry figure dismounts, unslings a longbow, nocks an arrow \n               and draws the string taut.\n\n                                     GALEN\n                              (horrified)\n                         No!\n\n               FOREST\n\n               Galen sprints through the trees. Up ahead is Valerian, walking \n               resolutely.\n\n                                     GALEN\n                         No!\n\n               She glances back at him and grimly keeps on walking. Galen \n               shoots past her and on into the forest.\n\n                                     GALEN\n                         Hodge!\n\n               TRAVELERS\n\n               Galen races up the trail rounds a bend and sees the Urlanders \n               coming toward him. Hodge precedes the group with an unsteady \n               gait. He sees Galen, raises up his arms and flops face down \n               on the trail. A long arrow protrudes from his back. Galen \n               kneels beside him. The uneasy company keeps its distance. \n               Hodge struggles to speak.\n\n                                     HODGE\n                         Galen? Can you hear me?\n\n                                     GALEN\n                         I hear you.\n\n                                     HODGE\n                         You know, somebody shot me, but I \n                         can still talk. There's something \n                         that has to be done.\n\n                                     GALEN\n                         I know.\n\n                                     HODGE\n                         Not that cockatrice. Ulrich's ashes. \n                         Here.\n\n               Hodge's hand comes out from under his coat gripping the \n               leather pouch. Galen tugs at it, but Hodge can't let go.\n\n                                     HODGE\n                         Take it. Sorry, you'll have to peel \n                         it loose.\n\n               Galen pries the sack out of Hodge's clenched fingers. Suddenly \n               the hand comes up, grabs Galen by the hair, and pulls him \n               near.\n\n                                     HODGE\n                              (a croak)\n                         ...burning water... find the lake, \n                         throw it in...\n\n                                     GALEN\n                              (holding up the pouch)\n                         What are you doing with this, Hodge?\n\n                                     HODGE\n                         ...burning water...\n\n               He dies. Galen frees himself from his grasp.\n\n                                     GALEN\n                         Hodge, don't die. Listen to me. You're \n                         not going to die.\n\n               Galen is frantic. He pulls out the amulet and wraps his hand \n               around it.\n\n                                     GALEN\n                         Excede, mortem! Revoca, vitam!\n                              (he shakes the body)\n                         Excede, mortem! Revoca, vitam!\n\n               But Hodge has passed on, and Galen's magic has no way to \n               reach him. Suddenly the youth cries out in pain. He drops \n               the amulet and looks at his palm. The device has burned his \n               flesh. Now he becomes aware of troubled Urlanders looking \n               over his shoulder, witness to his failure.\n\n                                                                    CUT TO:\n\n               LAKE - DAY\n\n               Wind whips the leaden wave tops on a vast rainy lake. The \n               travelers are rowing across in an open longboat, aided by a \n               tattered lateen sail. Valerian mans the steering oar at the \n               stern while Galen broods in the bow. He feels like an imposter \n               in their eyes.\n\n               FJORD\n\n               The boat pulls into a long narrow waterway with granite cliffs \n               on either side. Moving through swirls of fog, they beach the \n               boat and step out onto a craggy shore. Greil leans over and \n               kisses a rock.\n\n                                     GREIL\n                         Urland!\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - DAY\n\n               The travelers descend a mountain pass and emerge through a \n               wrack of cloud into a gray and cheerless region. Fire-\n               blackened trees dot the barren landscape. As they reach the \n               flatlands, the Urlanders instinctively pick up the pace. \n               Galen slows to inspect the weird surroundings. Valerian trots \n               past him.\n\n                                     VALERIAN\n                         Come on. Don't dawdle here.\n\n               Galen falls into step with her.\n\n                                     GALEN\n                         The whole kingdom like this?\n\n                                     VALERIAN\n                         No. We're near the lair. Keep moving.\n\n               Galen looks around with new interest.\n\n                                     GALEN\n                         Where?\n\n                                     VALERIAN\n                         Over there. Doesn't matter. We're in \n                         no danger if we just pass through \n                         quickly.\n\n               Galen stops. High on the slope beside them is a gaping \n               fissure.\n\n                                     GALEN\n                         I see it. Let's have a look.\n\n                                     VALERIAN\n                         No!\n\n               But Galen is already toiling up the incline.\n\n                                     VALERIAN\n                         Greil! Malkin! Help!\n\n               The travelers turn to see what's the matter.\n\n               THE LAIR\n\n               Galen approaches the lair, pausing beside a wooden post with \n               iron manacles dangling from it. He fingers them thoughtfully. \n               Malkin, Greil and Valerian rush up behind him, their faces \n               drawn with worry.\n\n                                     GREIL\n                         Look, you don't have to do this. We \n                         know you're a fine young magician. \n                         None better. There's no need to prove \n                         it to us.\n\n                                     GALEN\n                         Are there other entrances?\n\n                                     VALERIAN\n                         No. One's enough.\n\n                                     GREIL\n                         Come on. The road's this way. We'll \n                         tell everybody how close you got.\n\n                                     GALEN\n                              (coolly)\n                         No smoke. How do you know it's in \n                         there?\n\n                                     GREIL\n                         Don't be a fool. Come away now and \n                         live to tell about it.\n\n               Instead, Galen starts into the crack. Greil and Malkin hasten \n               away, but Valerian lingers, watching in mounting frustration \n               as Galen probes further and further into the lair. She picks \n               up a fistful of stones and throws them at him.\n\n                                     VALERIAN\n                         Go ahead! You're going to die! What \n                         a fine trick that will be!\n\n               But Galen is lost in the gloom. She flees.\n\n               UNDERGROUND\n\n               Galen puts his hand on the rugged wall: the rocks are hot to \n               the touch. Something glinting on the floor catches Galen's \n               eye: an irridescent disk, a dragon scale. It flashes the \n               colors of the rainbow as Galen examines it. All at once the \n               ground shudders; chunks of rock fall from the ceiling. A \n               pall of smoke billows up from the depths.\n\n               OUTSIDE\n\n               Galen staggers out of the fissure coughing and gagging in a \n               swirl of smoke. There is no sign of the Urlanders. He throws \n               down his pack, climbs onto a huge boulder and surveys the \n               massive cliffs rising behind the lair. He grasps the amulet \n               and closes his eyes.\n\n                                     GALEN\n                         Now, great mountain, hear my command: \n                         Terrae lapsus consignet latibulum \n                         draconis! Evanescat latibulum \n                         draconis!\n\n               LANDSLIDE\n\n               With a thunderous splitting sound, the entire top of the \n               cliff pitches forward and topples onto the lower half of the \n               mountain, sweeping tons of debris into the air. Boulders the \n               size of houses bound down the mountain toward the magician. \n               Eyes wide with awe, he turns and runs for his life. Even as \n               he careens down the slope, chunks of rock rumble past. One \n               catches him at the knee and sends him flying.\n\n               He covers his head and joins the landslide. Finally the dust \n               lifts and he finds himself in a gully face to face with the \n               cowering Urlanders. They look with real fear at the man who \n               just conjured up the Apocalypse. Tattered and torn, covered \n               with dirt, Galen climbs up out of the shelter for a look at \n               his handiwork.\n\n               LANDSCAPE\n\n               The territory has been drastically transformed: the dragon's \n               lair is now buried beneath hundreds of tons of broken granite. \n               The Urlanders look upon the new landscape with stupefaction. \n               Galen grins a triumphant split-lip grin that fails to win \n               them over. Presently they back away and run off down the \n               trail, Valerian in their midst. Galen's grin fades.\n\n                                                                    CUT TO:\n\n               VILLAGE - DAY\n\n               The Village of Swanscombe is little more than a rough and \n               ready collection of thatched huts and mud-daubed outbuildings \n               surrounded by cultivated fields. Dogs sleep in open door-\n               ways; chickens peck around the communal well -- but there \n               are no people in evidence as Valerian and her company troop \n               into town.\n\n               VALERIAN\n\n               She trots across the square and enters a deserted blacksmith \n               shop.\n\n                                     VALERIAN\n                         Father? Hello?\n\n               She goes over to the forge. Hot coals are burning. She becomes \n               aware of a sound -- voices -- chanting.\n\n               SQUARE\n\n               She walks across the square toward the voices. She is joined \n               by Greil, Malkin and the other travelers, all of them puzzled \n               by the desolation. As they approach the grange hall the voices \n               grow louder. They seem to be singing. The main doors open \n               briefly and three villagers scamper out, dripping wet and \n               wrapped in white muslin. Valerian and her companions look at \n               each other in astonishment.\n\n               IN THE GRANGE HALL\n\n               In a wooden cistern in the middle of the hall a woman is \n               being held under water. After a few moments she is pulled to \n               the surface by a tall red-haired man with long bony fingers: \n               Brother Jacopus Januensis, a Carthusian monk. There's a wooden \n               cross on his chest and a mad look in his eye. Gathered around \n               him are the missing villagers, every man woman and child, \n               here to be baptised and sing a few newly-learned hymns in \n               praise of Our Lord Jesus Christ.\n\n                                     BROTHER JACOPUS\n                         Now are you cleansed of your sins! \n                         Now are you born again, purified in \n                         spirit, into the fellowship of Jesus \n                         Christ!\n\n               The travelers enter and mingle with the congregation. Valerian \n               scans the crowd until she locates her father, Simon, a balding \n               sturdy journeyman. He's overjoyed at her return and gives \n               her a hearty embrace.\n\n                                     SIMON\n                         Welcome back, my son.\n\n                                     VALERIAN\n                         Father, what are you doing? Have you \n                         all lost your minds?\n\n                                     SIMON\n                         Some have.\n\n               He points to the monk, who is dunking a screaming infant and \n               carrying on about the Bishop of Rome.\n\n                                     SIMON\n                         It's this monk. He can read and write, \n                         and talk too, I'm afraid.\n\n                                     VALERIAN\n                         And they listen?\n\n                                     SIMON\n                         Shh! They think this a holy place, a \n                         tabernacle.\n\n                                     VALERIAN\n                         This is the granary. What kind of \n                         welcome is this? I've got news of \n                         the sorcerer and news of the dragon.\n\n                                     SIMON\n                         You were brave to go, you and your \n                         friends. But nobody cares. Listen -- \n                         he knows what they want to hear.\n\n               MONK\n\n               Brother Jacopus strides back and forth before the assembly \n               in an inspired state.\n\n                                     BROTHER JACOPUS\n                         The man who walks with Christ is not \n                         a man to fear a dragon: Yea, though \n                         I walk through the valley of the \n                         shadow of death I will fear no evil! \n                         You say you are preyed upon by a \n                         foul beast. Yes, but what is the \n                         nature of this beast? It comes to \n                         you on bat's wings and clawed feet, \n                         does it not? It breathes fire, does \n                         it not? And it lives under ground. \n                         This is no dragon. This is Lucifer!\n\n                                     VOICE\n                         Whoever it is, he's dead.\n\n               This is Galen, who has just stepped into the hall, tattered, \n               bedraggled and triumphant.\n\n                                     BROTHER JACOPUS\n                         Nay, brother! It is not as easy as \n                         that. Allegiance to Christ, to be \n                         sure, but also prayer and confession. \n                         These are the arms by which Satan \n                         may be put down.\n\n                                     GALEN\n                         You're talking about superstition, \n                         friend. None of that has anything to \n                         do with what I, Galen, have already \n                         achieved.\n\n               He marches to the center of the gathering.\n\n                                     SIMON\n                              (to Valerian)\n                         You brought this stranger?\n\n                                     VALERIAN\n                         Ulrich's apprentice. He's a braggart, \n                         but it doesn't matter.\n\n                                     GALEN\n                         People of Urland! Send a messenger \n                         to the king. Vermithrax is dead. \n                         Crushed by the power of the moon and \n                         the stars! Laid low by ancient wisdom. \n                         Dropped into the Abyss by mystical \n                         practice.\n\n                                     BROTHER JACOPUS\n                         Spoken like a pagan. Every word as \n                         reprobate as it is false!\n                              (holding up his cross)\n                         Solum in hoc signo vinces!\n\n                                     GALEN\n                         Nihil plus mysterium!\n\n               He gestures boldly and a fireball crackles at the monk's \n               feet. The holy man scurries back. A hush falls upon the \n               congregation.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - DAY\n\n               A procession of curious villagers winds its way into the \n               badlands. They gather on a promontory overlooking the dragon's \n               lair. They stand there for a long time, a chill wind whipping \n               their garments, trying to understand what's happened. The \n               monk is mightily displeased.\n\n                                     BROTHER JACOPUS\n                         Praise God! Blessed is he that is \n                         humble before the Lord!\n\n                                     VALERIAN\n                         Your god had nothing to do with it.\n\n               Indeed, Galen's act is already the stuff of legend:\n\n                                     MALKIN\n                         We saw it with our own eyes. He flew \n                         to the mountain top. He was a bird. \n                         He brought forth lightning. I saw \n                         it.\n\n               Some of the younger villagers scamper forward to the spot \n               where the cave had its opening. With yells and whoops they \n               beat the ground with clubs. In the crowd Simon begins to \n               smile, then to laugh. Soon he leads the villagers in a \n               tumultuous cheer. Brother Jacopus and some of his converts \n               drop to their knees and pray.\n\n                                                                    CUT TO:\n\n               CELEBRATION\n\n               The inhabitants of Swanscombe have decked out the town square \n               and are making a night of it. By torchlight they dance merrily \n               to jigs and reels provided by the local fiddlers. Ale flows \n               freely from oak casks.\n\n               VALERIAN'S HOUSE\n\n               Valerian is kneeling before a trunk full of women's clothing. \n               She pulls out a long simple frock, goes to a crude mirror, \n               and holds it up against her body to gauge the effect. Her \n               father comes up behind her. He is angry and frightened.\n\n                                     SIMON\n                         Put that away. What if you were seen?\n\n                                     VALERIAN\n                         I'm going to be seen. I want to be \n                         seen. Tonight the world finds out \n                         that you never had a son.\n\n                                     SIMON\n                         No, you mustn't do that. It's too \n                         soon. We've got to think about this, \n                         we've got to make a plan.\n\n                                     VALERIAN\n                         Father: the danger is over.\n\n               He sits on the bed and puts his head in his hands.\n\n                                     SIMON\n                         I know. What am I going to say to my \n                         friends who still mourn for their \n                         lost girls.\n\n                                     VALERIAN\n                         You'll say you did what you had to. \n                         This is a time for celebration -- \n                         and forgiveness.\n\n               He looks up at her, trying to imagine what it's going to be \n               like having a daughter.\n\n               CELEBRATION\n\n               Galen is surrounded by a crowd of wide-eyed kids and not a \n               few adults, entertaining them by pulling duck's eggs out of \n               their ears and causing coins to disappear. Presently he feels \n               the attention of his audience shift away to someone standing \n               behind him. He turns to find a shy but determined Valerian \n               sweetly decked out in her blue frock. A buzz goes through \n               the crowd. Valerian blushes and wavers: she seems ready to \n               bolt for home. But Galen takes her by the hand, and with \n               conspicuous politesse leads her to the dance.\n\n               DANCE\n\n               It's forward, back and around sixth-century style: the young \n               sorcerer can't take his eyes off his partner. But she's too \n               shy to return his gaze.\n\n                                     GALEN\n                         Looks like you've been up to a little \n                         sorcery yourself.\n\n               Valerian doesn't know what to say.\n\n                                     GALEN\n                         Or is it witchcraft?\n\n               She still doesn't reply. It's all she can do to keep on \n               dancing.\n\n                                     GALEN\n                         What's the matter? A real woman never \n                         stops talking.\n\n                                     VALERIAN\n                         I think it was much easier being a \n                         boy.\n\n               SIMON & GREIL\n\n               They stand on the sidelines, watching the young couple step \n               to the music.\n\n                                     SIMON\n                         The damnedest thing is, she was twice \n                         the man of anyone else in the village. \n                         Now she's twice the woman.\n\n                                     GREIL\n                              (grim)\n                         Would that I had been as clever as \n                         her father.\n\n                                     SIMON\n                         Come now, Greil. Don't begrudge a \n                         life spared.\n\n                                     GREIL\n                         I begrudge nothing. But I wonder at \n                         what we have seen and how it was \n                         done.\n\n                                     SIMON\n                         You were there.\n\n                                     GREIL\n                         I saw what I saw. But this jack-anapes \n                         was barely ready to carry his master's \n                         chamberpot. Isn't it strange that at \n                         the very moment the beast is put \n                         down we should have a holy man here \n                         in the village?\n\n                                     SIMON\n                         You don't believe that superstitious \n                         Christian rot, do you?\n\n                                     GREIL\n                              (defensive)\n                         It is said God works his wonders in \n                         mysterious ways.\n\n               CELEBRATION\n\n               While the proud Simon dances in the background with his \n               daughter, a group of tipsy villagers clusters around Galen, \n               belching forth a drinking song. The young magician raises \n               his own mug and joins in on the chorus. Abruptly the music \n               stops. The singing dies away. The ensuing silence is broken \n               by the sound of galloping hooves. Presently three horsemen \n               appear at the end of town: Tyrian and his henchmen. They \n               guide their horses forward into the midst of the merry-makers. \n               Tyrian dismounts and looks around in his usual friendly way.\n\n                                     TYRIAN\n                         A celebration! Don't stop on my \n                         account. You -- musicians, more music!\n\n               The musicians leave their instruments in their laps. Tyrian \n               draws himself a measure of ale and raises it above his head.\n\n                                     TYRIAN\n                         A toast! To the deed of the day! You \n                         see, good news travels fast. The \n                         King himself has already heard it. \n                         And like yourselves, tonight he's \n                         overcome with joy.\n\n                                     MALKIN\n                         What would you have of us then?\n\n                                     TYRIAN\n                         Not a thing. It's this one.\n                              (he gestures toward \n                              Galen)\n                         The King would meet our new benefactor \n                         and offer his gratitude to the man \n                         who succeeded where so many have \n                         failed.\n\n                                     GALEN\n                              (sobering up)\n                         What sort of gratitude? A knife in \n                         the belly? An arrow in the back?\n\n               Tyrian's smile freezes on his face. He steps in front of \n               Galen, towering over him.\n\n                                     TYRIAN\n                         My young friend, I'd as soon dispatch \n                         you as I did the others, and for the \n                         same reason. But his Majesty would \n                         like a cozy chat, and commands \n                         otherwise.\n\n                                     VALERIAN\n                         Don't go, Galen. Cast a spell and \n                         turn them into toads. It should be \n                         easy; that's what they are.\n\n               Tyrian regards her coolly, taking in her change of costume \n               and its meaning.\n\n                                     TYRIAN\n                         Well, well: still plenty of cheek \n                         under those skirts, it seems.\n\n               Having buried the dragon under a mountain, Galen decides \n               he's not worried about an appearance at court. He smiles at \n               Valerian.\n\n                                     GALEN\n                         Don't worry. I'll be back.\n\n                                                                    CUT TO:\n\n               RIDERS\n\n               Three horses gallop through the moors and fens of central \n               Urland. Galen is tucked up behind Tyrian. On the distant \n               horizon, the battlements of the King's castle glow in the \n               slanting light of a new day.\n\n                                                                    CUT TO:\n\n               THRONE ROOM - DAY\n\n               Within the castle is a great hall with shafts of daylight \n               poking in through narrow windows set high in the walls. In \n               the middle of the room stands a carved oak throne. There is \n               Casiodorus Rex, King of Urland, a bearded man in his fifties, \n               as spare and somber as the room in which he sits. He is \n               flanked by a few servants, assorted courtiers and Tyrian. \n               Standing before them all is Galen, looking unhappy. He pours \n               a pitcher full of water into a small glazed goblet.\n\n                                     GALEN\n                         One of the best things about the \n                         water here in Urland is that there's \n                         so much of it -- look at that!\n\n               Water continues to pour into the goblet without overflowing. \n               Galen takes a sip.\n\n                                     GALEN\n                         Mmm. Good. But not cold enough. \n                         Perhaps I could borrow a scarf from \n                         his Majesty.\n\n               The King makes no sign. Galen approaches stiffly, takes a \n               scarf and retreats.\n\n                                     GALEN\n                         I cover the goblet, so... remove, \n                         so... and behold: winter in a mug!\n\n               And he's done it: he turns the goblet over and a small chunk \n               of ice hits the floor. The royal reaction is equally frosty. \n               Galen is bombing, and he knows it.\n\n                                     GALEN\n                         All right. How many of you have ever \n                         seen a table fly?\n\n               He mutters an incantation. In the audience, Tyrian notes \n               that Galen has his hand wrapped around the amulet. There is \n               a loud clatter as the heavy oak table before the throne begins \n               to jitter and buck. As the wine spills and plates go flying, \n               the King wearily raises a hand.\n\n                                     KING\n                         Enough! That's fine.\n\n                                     GALEN\n                         Wait, it'll rise now.\n\n                                     KING\n                         Don't bother. Not necessary.\n\n               The table cracks in half and dumps a mess of fruit and \n               crockery at the onlookers' feet.\n\n                                     KING\n                         Tell me: the landslide -- it was \n                         accomplished this same way?\n\n                                     GALEN\n                         Yes.\n\n                                     KING\n                         I see. And having rendered such unique \n                         service to our kingdom, what would \n                         you claim as a reward?\n\n                                     GALEN\n                         Please -- no payment. I have always \n                         found magical practice to be its own \n                         reward. I seek only some yet greater \n                         challenge.\n\n               This handsome sentiment doesn't go over any better than his \n               tricks.\n\n                                     KING\n                         Did you ever hear of King Gaiseric? \n                         Of course not, you weren't even born. \n                         He was my brother, a great King and \n                         a valiant man-at-arms. When he \n                         ascended to the throne, the dragon \n                         was unbridled. No one knew where it \n                         might strike next. So he brought \n                         forth his broadsword and his spear, \n                         assembled a company of his best \n                         fighters and went out to do battle.\n                              (pause)\n                         He was never seen again. But his \n                         attack provoked the most terrible \n                         reprisals: whole villages incinerated, \n                         entire crops burned. Death, famine, \n                         horrible.\n\n               The King grimaces as the memories come flooding back.\n\n                                     KING\n                              (quietly)\n                         How did you arrogate to yourself the \n                         role of savior?\n\n                                     GALEN\n                         I was invited.\n\n                                     KING\n                         Not by me. Did you ever consider the \n                         consequences of failure?\n\n                                     GALEN\n                         What failure? What's the matter with \n                         you people? You want the dragon back?\n\n                                     KING\n                         Then the beast is dead?\n\n                                     GALEN\n                         Yes, of course. Dead.\n\n                                     KING\n                         We shall see.\n\n                                                                    CUT TO:\n\n               DUNGEON\n\n               Two guards thrust Galen into a narrow cell and slam the barred \n               door shut. The young sorcerer waits until they're safely out \n               of sight, then takes out his amulet. He ponders it for a \n               doubtful moment. Suddenly a gloved hand darts in and whips \n               it off his neck and out through the bars.\n\n                                     TYRIAN\n                         Thank you.\n\n               He makes an ironic salute and leaves. Galen sits down heavily \n               and stares at the stone walls.\n\n               CORRIDOR\n\n               Unseen by Galen, a figure clad in silk and lace skitters \n               down a murky dungeon hallway and peers around a corner. \n               Stealing a look at Galen is the Princess Elspeth, a fey beauty \n               in her early twenties. After a moment, spooked by some \n               imagined noise, she flits away.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - DAY\n\n               Dark clouds slide across a pale sun, throwing the ruined \n               land below into shadow. Soon fat droplets of rain are \n               splattering on the rocks above the dragon's lair. With each \n               tiny splash there is a sizzle and a puff of steam. These \n               rocks are hot!\n\n                                                                    CUT TO:\n\n               DUNGEON\n\n               Outside the barred window, a steady rain is falling. Inside, \n               Galen uses a chunk of limestone to inscribe a pentagram on \n               the floor of his cell. He marks runic signs on the window \n               sill and lintel. Then, positioning himself in the center of \n               the mystic symbol, he raises his hands and spreads his \n               fingers.\n\n                                     GALEN\n                              (authoritative)\n                         Cubiculum gravis aperat!\n\n               There's a long moment when nothing happens. A very long \n               moment. Finally, a thoroughly frustrated Galen leaps to the \n               window and rattles the bars.\n\n                                     GALEN\n                         Open up, dammit! Fenestra gravis \n                         aperat! Asser gravis aperat! \n                         Divinitus!\n\n                                     VOICE\n                         Salve, magistrum iuvenilum.\n\n               Startled, Galen whirls around to find Elspeth standing outside \n               his cell. She hands some food and blankets through the bars.\n\n                                     ELSPETH\n                         I've studied Latin. Greek, too. Me \n                         appelo Elspeth, filia regis.\n\n               Galen looks her over. He's never seen anyone so angelic.\n\n                                     GALEN\n                         How do you do.\n\n                                     ELSPETH\n                         Please don't think ill of us. My \n                         father is a wonderful man, a wise \n                         man. The lottery was his idea.\n\n                                     GALEN\n                         I see.\n\n                                     ELSPETH\n                         You don't understand. From the moment \n                         it began, the dragon was tame. The \n                         kingdom prospered.\n\n                                     GALEN\n                         And only a few had to be sacrificed.\n\n                                     ELSPETH\n                         Yes, that's true. Isn't it better \n                         that a few should die that many might \n                         live?\n\n                                     GALEN\n                         Depends on who does the dying.\n\n                                     ELSPETH\n                         Oh, but we all take our chances. My \n                         father is a just man. My name is \n                         entered on the lists, along with \n                         every other young --\n\n                                     GALEN\n                         Virgin?\n\n                                     ELSPETH\n                         Maiden.\n\n                                     GALEN\n                         If you say so.\n\n                                     ELSPETH\n                         What do you mean?\n\n                                     GALEN\n                              (sighs)\n                         Nothing.\n\n                                     ELSPETH\n                         I've participated in every drawing \n                         since I came of age.\n\n                                     GALEN\n                         Maybe.\n\n                                     ELSPETH\n                         It's true. You don't believe me. You \n                         think I'm lying. Well I'm not.\n\n                                     GALEN\n                         I'm sorry. I heard a rumor. Families \n                         with money, that sort of thing.\n\n                                     ELSPETH\n                         Don't listen to rumors. They're lies. \n                         I have to go now.\n\n                                     GALEN\n                         Wait -- how long do I have to stay \n                         in here?\n\n                                     ELSPETH\n                         Until we know. Not long. Goodbye. \n                         Vale. Dormi bene.\n\n               She slips away down the corridor.\n\n               LIBRARY\n\n               King Casiodorus and Tyrian are huddled over a table piled \n               high with manuscripts and papers. Tyrian clears a spot and \n               sets out a stack of lead bars.\n\n                                     KING\n                         That's enough. Let's not be greedy \n                         here.\n\n               The King picks up Galen's amulet, and holds it over the bars \n               in his clenched fist.\n\n                                     KING\n                         Now then: I, Casiodorus Rex do hereby \n                         command thou base metal to change \n                         thy essence and become gold.\n\n               There is a rustle of skirts and Elspeth appears behind him.\n\n                                     ELSPETH\n                         Father?\n\n                                     KING\n                         Not now. Tyrian, remove all but one \n                         bar. We'll try it one at a time.\n\n                                     ELSPETH\n                         Father: did you know that some \n                         families have paid bribes to stay \n                         out of the lottery?\n\n               The King and Tyrian glance up at her.\n\n                                     KING\n                         Nonsense. By the power of this amulet, \n                         justly wielded by my hand in \n                         accordance with the laws of Urland, \n                         now lead be thou gold.\n\n               The lead remains unchanged, but the King gives out a cry and \n               drops the amulet.\n\n                                     KING\n                         I'm burned! What devilish thing is \n                         this?\n\n                                     ELSPETH\n                         Have you ever kept my name off the \n                         lottery list?\n\n                                     KING\n                         That'll be all, Tyrian. You may \n                         withdraw.\n\n               Tyrian bows and exits. The King uses his sceptre to pick up \n               the amulet and chain. He conceals it in a hollowed-out book \n               and places the volume on a shelf among many others.\n\n                                     KING\n                         Now, my dear, what's troubling you?\n\n                                     ELSPETH\n                         Answer my question: am I not exposed \n                         to the same risk as every other man's \n                         daughter?\n\n               The King paces over to the window and stares out. The rain \n               has stopped.\n\n                                     ELSPETH\n                         Well?\n\n                                     KING\n                              (finally)\n                         Your father loves you very much.\n\n               Elspeth sways in dismay.\n\n                                     ELSPETH\n                              (a wail)\n                         It's true! What have you done to \n                         me!?\n\n                                     KING\n                         Who fills your head with such ideas?\n\n               At that moment a tremor passes through the room. King and \n               daughter look at each other in alarm.\n\n               DUNGEON\n\n               The same tremor shakes the bars in Galen's cell. Puzzled, he \n               rolls off his straw palette and gets to his feet. The tremor \n               dies away. Suddenly a violent shaking hits the cell, bouncing \n               Galen off the walls.\n\n                                                                    CUT TO:\n\n               VILLAGE SQUARE\n\n               Swanscombe is gripped by the same earthquake. Dodging panicky \n               barnyard animals, Valerian and her father join other \n               frightened villagers in the center of town.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY\n\n               Above the dragon's lair, boulders are shifting and grinding \n               together. Massive chunks of stone break loose and tumble \n               down the incline.\n\n                                                                    CUT TO:\n\n               GALEN\n\n               The shaking has stopped. Rock dust filters down from the \n               ceiling. Galen picks himself up and stares: the door to his \n               cell is off its hinges and is sagging open. He darts out.\n\n               CORRIDOR\n\n               Galen dashes along the hallway, rounds a corner and stops. \n               At the other end of the passage is Tyrian.\n\n                                     TYRIAN\n                         You little meddler! It's alive!\n\n               He draws his sword and advances. Galen warily retreats. Tyrian \n               breaks into a run. Galen turns and sprints away.\n\n               COURTYARD\n\n               Unruly horses, terrified by the quake, rush blindly around \n               the courtyard. Hostlers try vainly to catch them. Tyrian \n               leans down from an upstairs window.\n\n                                     TYRIAN\n                         Close the main gate! Quick!\n\n               The men below scramble for the gates. Galen bursts out of \n               hiding, sees the untended horses, and swings aboard as one \n               goes past. A cry goes up from the guards.\n\n                                     TYRIAN\n                         There! Stop him!\n\n               Galen rides like mad for the exit, but he's a half-second \n               late: the doors boom shut in his face. He wheels the horse \n               around. The King's men are coming toward him with pikes. \n               Digging his heels into the horse's sides, he urges the animal \n               back across the courtyard, up the steps and right into the \n               building!\n\n               THRONE ROOM\n\n               Galen gallops into the empty chamber, knocking over the throne \n               and vaulting a table. Hot on his heels are armed soldiers. \n               He kicks the horse again and shoots under an archway.\n\n               KITCHEN\n\n               The kitchen is already in chaos from the earthquake when \n               Galen charges in on his wild steed. Food, utensils and cooks \n               go flying. He reins in, ducks his head, and squeezes the \n               horse out into a narrow hallway.\n\n               HALLWAY\n\n               He clatters down the passageway. But here comes a contingent \n               of footmen from the opposite direction. Galen rides them \n               into the walls!\n\n               STAIRS\n\n               The horse scrabbles up the stairs, Galen tucked low against \n               its neck. On the upper landing he comes face to face with \n               Tyrian and more soldiers.\n\n                                     TYRIAN\n                         Get him! Stab the horse!\n\n               Galen jerks the animal around and plunges back down the \n               stairs.\n\n               LIBRARY\n\n               Whinnying and blowing the horse bursts in, a wild-eyed Galen \n               still in the saddle. He finds himself confronting the King \n               and his daughter.\n\n               Casiodorus grabs Elspeth and retreats into a corner.\n\n                                     KING\n                         Tyrian! Tyrian!\n\n               Tyrian sweeps in with his men. The doors slam shut.\n\n                                     KING\n                         So much for your magic! So much for \n                         your sorcery!\n\n               Galen is trapped. Just as Tyrian reaches for the horse's \n               reins, the animal rears up, rolling its eyes. At that moment \n               the floor heaves and cracks in a new series of shocks. The \n               men at arms go down like ten pins. Tyrian reels back, dodging \n               stone blocks loosened from the ceiling. As the shaking \n               continues, a weakened section of wall gives way. Galen sees \n               daylight! Without even waiting for the quake to cease, he \n               prods the horse across the room and through the wall to \n               freedom.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - DAY\n\n               The unnerved citizens of Swanscombe gather on the promontory \n               overlooking Galen's landslide. Every few seconds there is a \n               new shudder and more rocks pour down the long slope. Valerian \n               stands trembling with her father. Presently Brother Jacopus \n               elbows his way forward.\n\n                                     BROTHER JACOPUS\n                         Listen to me, my brethren. The moment \n                         of our fear is the moment of our \n                         triumph. This is a sign from God. \n                         Follow me, and our faith will send \n                         this creature straight to hell.\n\n               Holding a cross before him, he starts up the slope. No one \n               follows. They haven't been Christians all that long. One or \n               two near Valerian get down on their knees and pray silently. \n               Greil looks things over.\n\n                                     GREIL\n                         You call yourselves Christians?\n\n               He strides after the monk. But he's the only one.\n\n               NEAR THE LAIR\n\n               The determined monk has arrived at the epicenter. His sandals \n               are smoking on the hot gravel. Sweat shines on his face and \n               neck.\n\n                                     BROTHER JACOPUS\n                         The Lord is my shepherd, I shall not \n                         want. Thou makest me to lie down in \n                         green pastures. Thy rod and staff \n                         they comfort me...\n\n               Greil toils up the slope a hundred yards back. He's crossing \n               himself, but he's carrying a sickle.\n\n               VERMITHRAX\n\n               There is a thunderous noise. Part of the mountain is tossed \n               into the air. Up from the depths comes a huge shining wing. \n               Then a neck uncoils and a head appears. It tips down toward \n               the tiny human.\n\n                                     BROTHER JACOPUS\n                              (firm)\n                         ...for Thine is the kingdom and the \n                         power and the glory forever -- amen.\n\n               At the base of the slope the villagers scatter. Greil wavers.\n\n                                     BROTHER JACOPUS\n                         Unclean beast, get thee down! Be \n                         thou consumed by the fires that made \n                         you!\n\n               The dragon's head sways back and forth, then belches out a \n               waterfall of flame. It engulfs Jacopus and sends him to a \n               better world, if there is one.\n\n                                                                    CUT TO:\n\n               HILL ROAD - NIGHT\n\n               Horse and rider race across a night landscape under brooding \n               clouds. Up ahead, the sky glows with an angry red light. At \n               the crest of a hill Galen reins in and looks down across a \n               long valley. There, miles away, is the village of Swanscombe. \n               Many buildings are ablaze. As he watches in horror, fires \n               spring up in the fields and trees. Intermittently he can see \n               the silhouette of the dragon as it spreads destruction. \n               Finally the creature swoops up and away. Galen stares skyward, \n               losing sight of it in the clouds. For a moment, silence. \n               Then, with a thunderous rush of air that almost blows him \n               from the saddle, the dragon reappears and hurtles a few feet \n               over his head! It is gone in an instant.\n\n                                                                    CUT TO:\n\n               VILLAGE - NIGHT\n\n               Half the buildings in the town are on fire. Desperate \n               villagers dash here and there, herding children and animals \n               to safety, trying to save their household goods. Galen walks \n               woodenly into the confusion, leading his horse, taking in \n               the scope of the disaster. He comes upon a line of men who \n               have formed a bucket brigade. He attempts to join up. As \n               soon as he is recognized, he is shouldered roughly aside.\n\n                                     MAN\n                         Get away, you little bastard. We've \n                         had enough help from you.\n\n               Galen staggers back, reaching for his horse. The animal shies \n               and trots off. A middle-aged woman appears in front of him, \n               her face contorted with rage. She swings a flaming broom and \n               catches him on the back of the head. Galen reels away.\n\n                                     WOMAN\n                         This is your doing!\n\n               Galen looks up and sees a couple of burlies moving his way \n               with boards in their hands.\n\n                                     BURLIES\n                         Get him! He's back!\n\n               Before they can get too close, Galen runs down an alley and \n               bumps smack into a glassy-eyed, haunted man. It is Greil.\n\n                                     GALEN\n                         Greil -- help!\n\n                                     GREIL\n                         May the Lord forgive you for what \n                         you have done.\n\n               He pushes past. Galen ducks behind a smoldering building.\n\n               VALERIAN'S HOUSE\n\n               The roof has burned off, but at least the walls are standing. \n               Valerian is wrestling charred timbers out of the center of \n               the room. She is covered with soot. There is a hammering on \n               the door and Galen barges in. He slams the door behind him \n               and puts his back against it.\n\n                                     GALEN\n                         It's me. Are you hurt?\n\n                                     VALERIAN\n                         Where have you been? Doesn't matter -- \n                         listen: Quick! Make it rain. That'll \n                         put the fire out.\n\n                                     GALEN\n                         I can't.\n\n                                     VALERIAN\n                         Then get the animals back. They're \n                         all running loose. There's people \n                         been hurt. Stop their pain. You can \n                         cure them. And we'll need food...\n\n                                     GALEN\n                         I can't do it.\n\n                                     VALERIAN\n                              (this stops her)\n                         What? Why not?\n\n               Galen's hand moves up to where the amulet used to hang.\n\n                                     GALEN\n                         I just can't.\n\n                                     VALERIAN\n                         But you're a sorcerer.\n\n                                     GALEN\n                         I'm no sorcerer. Whatever power I \n                         might have had, it's gone.\n\n                                     VALERIAN\n                         It can't be!\n\n                                     GALEN\n                         I know: I'm an imposter. A fraud. A \n                         fake. I'm sorry...\n\n               For a moment, Valerian is too stunned to speak. Then her \n               face colors.\n\n                                     VALERIAN\n                         You're sorry?! Listen to that! The \n                         damn thing is loose, we're all on \n                         fire and you're sorry!\n\n               Galen sinks to the floor and sits in the ashes.\n\n                                     VALERIAN\n                         You didn't have the faintest idea \n                         what you were doing, did you? You're \n                         a fool -- and I'm a bigger one for \n                         bringing you here.\n\n               She snatches up a pitchfork and glowers at him.\n\n                                     VALERIAN\n                         I don't want you in this house. Get \n                         out.\n\n               But Galen still sits there like a puppet with its strings \n               cut, every dream of glory utterly crushed. This piteous sight \n               touches Valerian's heart. Her gaze softens. She slowly lowers \n               the pitchfork.\n\n                                                                  FADE OUT:\n\n               FADE IN:\n\n               TOWN SQUARE - DAY\n\n               A knot of villagers lead Tyrian and his henchmen across the \n               square directly to the blacksmith's shop. The King's men \n               dismount and pound on the door. It swings open. Valerian is \n               standing there.\n\n                                     TYRIAN\n                         Where is he?\n\n                                     VALERIAN\n                         Not here. I can't help you.\n\n               A cry goes up from the villagers. They know damn well he's \n               in there.\n\n               VALERIAN'S HOUSE\n\n               Tyrian pushes Valerian aside and steps into the room. Aided \n               by some townfolk, his men proceed to ransack the premises, \n               overturning barrels, sticking their swords through flour \n               sacks, poking through the tumbledown thatch. Valerian's eye \n               falls on Malkin, who has involved himself in the search.\n\n                                     VALERIAN\n                         You too?\n\n                                     MALKIN\n                              (returning her look)\n                         Damn right.\n\n               Finding nothing, the group pushes into the metal shop, where \n               Simon is hammering an iron wheel rim back into shape on an \n               enormous anvil. He lays down his tools and grimly watches \n               the men go through, overturning benches and tables. Tyrian \n               props a leg up on the anvil and addresses himself to Simon.\n\n                                     TYRIAN\n                         As the proud new father of an eligible \n                         daughter who was some-how overlooked \n                         all these years, it may interest you \n                         to know that the King has called for \n                         a new lottery.\n\n                                     SIMON\n                         But it's months til the solstice.\n\n                                     TYRIAN\n                         In view of what's happened, we all \n                         know what's required.\n\n                                     SIMON\n                         I've never taken part in your cursed \n                         lottery, and I'll have nothing to do \n                         with it now.\n\n                                     TYRIAN\n                         You were very clever. But she'll \n                         take part, like all the rest. No \n                         exceptions.\n\n               The search party has exhausted the room's hiding places.\n\n                                     HENCHMAN\n                         Nothing. If he was here, he's gone \n                         now.\n\n               Tyrian nods and leads the way out. Simon catches up and pulls \n               Tyrian aside at the door.\n\n                                     SIMON\n                         All right. I know what you want. How \n                         much?\n\n                                     TYRIAN\n                         Are you offering me a bribe?\n\n                                     SIMON\n                         Yes.\n\n                                     TYRIAN\n                         Don't waste your time.\n                              (pause)\n                         You could never afford it.\n\n               He spins on his heel and joins his men as they ride out of \n               town. Valerian and Simon watch them go. When the riders are \n               out of sight, they return to the shop. With a couple of stout \n               poles, they strain to lift the anvil off its base. Finally \n               it topples over. Valerian slides the base aside, revealing a \n               trap door. She raises it and a cramped Galen unfolds himself \n               from the space below. On his face is a curious look of \n               determination.\n\n                                     GALEN\n                         Smith -- have you ever forged a \n                         weapon?\n\n               WEAPONS\n\n               Simon is going through a cabinet, tossing out hoes, rakes, \n               sickles, scythes, plow blades, and a knife or two. Galen \n               examines them doubtfully. Now Simon produces an armload of \n               swords. Galen is impressed; he looks them over carefully, \n               testing and rejecting them in turn.\n\n                                     GALEN\n                         These are your sharpest?\n\n               Simon plucks up one of the swords, carries it to the center \n               of the room. He lays a horseshoe on the anvil. He brings the \n               sword down -- whack! -- and cuts the horseshoe in half.\n\n                                     SIMON\n                         Even Tyrian carries one of these.\n\n               Galen hefts it dubiously.\n\n                                     GALEN\n                         It's sharp -- but it's not sharp \n                         enough.\n\n               Valerian has been watching all this with growing concern.\n\n                                     VALERIAN\n                         Not sharp enough for what?\n\n                                     GALEN\n                         For what I'm going to do with it.\n\n                                     VALERIAN\n                         Nothing's that sharp.\n\n               Simon gnaws his lip. Reluctantly, he brings a long box from \n               the bottom of the cabinet. He opens it. Lying on a bed of \n               silk is an exquisite two-handed broadsword. The flat blade \n               gleams like a mirror. Galen reaches in and lifts it out.\n\n                                     SIMON\n                         The best I ever made.\n\n               Valerian is as awed as Galen.\n\n                                     VALERIAN\n                         It's beautiful.\n\n               Galen brings up a finger to test the edge. Simon grabs his \n               hand away.\n\n                                     SIMON\n                         Don't do that!\n                              (he looks at Valerian)\n                         Girl-child, when you were born I \n                         knew I had to do something, so I set \n                         about the task of fashioning an \n                         extraordinary weapon: I had the skill \n                         to make it --\n                              (bleak pause)\n                         -- but not the nerve to use it.\n\n               She looks at him with affection. Leaning forward, she plants \n               a kiss on his bald pate.\n\n                                     VALERIAN\n                         I'm thankful for that.\n                              (to Galen)\n                         No man should choose a senseless \n                         death.\n\n                                                                    CUT TO:\n\n               STREAM - DAY\n\n               Galen, Valerian and Simon tramp through a glade to a mossy \n               bank. There a wide stream flows lazily under a canopy of \n               trees.\n\n                                     VALERIAN\n                         If it's me you're worried about, \n                         don't. So my name has been entered, \n                         what of it? There are hundreds of \n                         girls. My name just won't be drawn. \n                         I know it won't.\n\n               Galen walks out into the shallows and pushes the sword-tip \n               into the sandy bottom, angled so that the edge splits the \n               current.\n\n                                     GALEN\n                         Valerian, this isn't just for your \n                         sake.\n\n               He walks back to shore. All three watch the sword to see \n               what will happen.\n\n               SWORD\n\n               Big flat oak leaves are gliding along the current. Very \n               slowly, they go by the sword, some of them very close. \n               Finally, one of them floats against the leading edge of the \n               blade and without a ripple is cleft in two. Simon gives Galen \n               a significant look.\n\n                                     VALERIAN\n                         I don't care. It doesn't matter. \n                         What you want to kill isn't flesh \n                         and blood.\n\n                                     SIMON\n                         Oh, it'll bleed, all right.\n\n                                     VALERIAN\n                         How do you know? No one's so much as \n                         even scratched it.\n\n               They look to Galen. The apprentice's face is full of doubt.\n\n                                     GALEN\n                         I'll need the amulet.\n\n                                                                    CUT TO:\n\n               KING'S CASTLE - NIGHT\n\n               Carrying torches to light their way, families -- some with \n               maiden daughters -- gather from all over the country in the \n               courtyard of the King's castle. Simon is there with Valerian, \n               and so is Galen, disguised in rough farm clothes and a wide-\n               brimmed hat. Like many others, he carries a stick topped \n               with a bleached skull -- to all appearances, just another \n               participant in this weird pagan ritual. A barrel decorated \n               with flames and dragon's wings sits on a raised dais in front \n               of the main entrance. Horsrik, the King's herald, supervises \n               preparations for the lottery. Armed guards appear carrying a \n               sealed chest. Horsrik breaks the seal and the guards pour \n               the contents -- hundreds of wooden tiles, each bearing the \n               name of a potential sacrifice -- into the barrel. Trumpets \n               blare and drums roll and the royal party strolls onstage: \n               the King, his daughter, courtiers and Tyrian. Valerian nudges \n               Galen.\n\n                                     VALERIAN\n                              (pointing)\n                         Look at her. The Princess.\n\n                                     GALEN\n                         I know. We've met.\n\n               Valerian gives Galen a sharp look. Horsrik unrolls a \n               parchment.\n\n                                     HORSRIK\n                              (reading)\n                         People of Urland: whereas the peace \n                         of the kingdom has been disrupted by \n                         the mischief of an interloper; and \n                         whereas this interloper being fled; \n                         now therefore, his majesty the King \n                         hereby proclaims the sum of thirty \n                         ducats to be paid to anyone producing \n                         the miscreant Galen Bradwardyn, fraud \n                         enchanter, to our satisfaction.\n\n               Galen pulls his hat low over his eyes. As the moment for the \n               drawing approaches, Valerian becomes more and more uneasy. \n               She pushes forward through the crowd until she's just below \n               the barrel. She eyes the people around her. Some of them \n               seem equally worried, others -- the better dressed and better \n               fed -- are smug and complacent. The King and his retinue are \n               serene. A chant goes up from the crowd:\n\n                                     CROWD\n                         Stir the tiles! Stir the tiles!\n\n               Horsrik picks up a wooden staff surmounted by a carved \n               dragon's head and stirs up the names. This done, a new chant \n               goes up:\n\n                                     CROWD\n                         Bare the arm! Bare the arm!\n\n               At a signal, a guard comes forward and cuts the sleeve from \n               Horsrik's right arm. He holds it high. The crowd surges \n               forward. The atmosphere is full of dread and excitement. \n               Valerian looking pale and determined, is jostled and pushed \n               to the edge of the platform.\n\n                                     CROWD\n                         Draw the name! Draw the name!\n\n               The moment has come. Down goes Horsrik's arm and up it comes, \n               holding one little wooden square, one young woman's fate. An \n               expectant hush falls over the mob. The virgins of Urland \n               tremble and wait.\n\n                                     HORSRIK\n                         Now, my countrymen, hear me: behold, \n                         for I am chosen. I shall die that \n                         many may live. I shall lay down my \n                         life for family and fellows. I shall \n                         go to my grave for the love of our \n                         King and his wise policy. And my \n                         name is --\n\n               He looks down at the tile to read the name, but no sound \n               comes to his lips. He looks back at the crowd, a cold sweat \n               breaking over his face. He swallows, but still can't bring \n               himself to speak. At his feet, Valerian is holding her breath. \n               A new chant goes up.\n\n                                     CROWD\n                         The name! The name!\n\n               By now Horsrik is trembling. He stares down at the tile, his \n               mouth set in a grim line. The King is getting annoyed. He \n               gestures and the crowd falls silent.\n\n                                     KING\n                         Read the name.\n\n                                     HORSRIK\n                              (mastering himself)\n                         The name is: Princess Elspeth Ulfilas, \n                         filia regis.\n\n               There is a moment of profound shock. Then a low murmur of \n               wonder moves through the crowd. Galen looks at Valerian; she \n               sags with relief. The King turns to his daughter. She shows \n               nothing. He rises from his chair, comes forward and snatches \n               the tile from Horsrik.\n\n                                     KING\n                         That's not the name. It's been \n                         misread.\n\n               Valerian will not stand for such hypocrisy.\n\n                                     VALERIAN\n                         There's no mistake! The name's been \n                         chosen -- let it stand!\n\n                                     KING\n                         No, the good Horsrik has misspoke \n                         himself.\n                              (he looks at the tile)\n                         In fairness to this individual, whose \n                         name I can't make out, we'll destroy \n                         this tile.\n\n               He quickly tosses the wood chip into a brazier at his elbow. \n               Led by Valerian, the crowd cries out in protest.\n\n                                     VALERIAN\n                         No! What better name than your own \n                         kin? At last we see justice done!\n\n                                     KING\n                         Silence! We will have a new choosing. \n                         I will draw the name myself.\n\n               He reaches into the barrel and extracts another tile. He \n               looks at it and his eyes widen. Betrayed, he swivels to face \n               his daughter. The din of the crowd reaches a crescendo.\n\n                                     CROWD\n                         Let it stand! Let it stand!\n\n               Elspeth takes the tile from her father's nerveless fingers, \n               looks at it with satisfaction and holds it aloft.\n\n                                     ELSPETH\n                         The name is as you heard it and as \n                         Horsrik read it: Elspeth.\n\n               The King moils through the tiles, finding his daughter's \n               name again and again.\n\n                                     KING\n                         The lottery is invalid. Another and \n                         another. What treachery is this?\n\n               Valerian, chanting with the rest, falls silent. She looks at \n               Elspeth with sudden interest and respect, then awe.\n\n                                     ELSPETH\n                         Hear me, good people! It is true, \n                         that my name appears on many of the \n                         lots. This does not falsify the \n                         drawing, it certifies it! I have \n                         learned that my name has been kept \n                         from jeopardy in all the drawings in \n                         the past. So I have put my name among \n                         the rest many times -- once for each \n                         risk that, over the years, you took \n                         and I did not.\n\n               The crowd is dumbfounded. Gradually voices erupt in a \n               cacophony of shouts, whistles and excited conversation. Galen \n               sees his chance: there's an unguarded door near the stable. \n               He drifts toward it and slips inside.\n\n               THRONE ROOM\n\n               Galen pokes his head in: the room is empty. He scurries over \n               to a chest, flings it open and starts rummaging. Finding \n               nothing he moves on to a cabinet. He breaks the lock and \n               pries it open. Again, nothing.\n\n               CASTLE CORRIDOR\n\n               Galen can hear the voices in the courtyard as he rushes down \n               a hall. Suddenly he stops short. There in front of him is a \n               guard leaning out a window to watch the proceedings. Galen \n               hovers on the verge of panic as the guard abruptly moves. \n               But the man is only headed for another window and a better \n               view. Galen manages to fall into step an arm's length behind \n               him and slip by without a sound.\n\n               LIBRARY\n\n               Galen enters the library, his enormous shadow dancing crazily \n               on the torchlit walls. Hurrying through, his attention is \n               drawn to some open books on a table. Closer inspection reveals \n               magical writings and symbols. Galen paws over everything, \n               suddenly aware that he must be close to the amulet. But where \n               is it?\n\n               COURTYARD\n\n               As the crowd disperses Valerian watches Elspeth walk back in \n               the castle, lofty and composed. She looks for Galen and \n               discovers he has gone.\n\n               LIBRARY\n\n               By now, the room is in total disarray. Galen has opened all \n               the chests and trunks and knocked half the books from the \n               shelves. No amulet. He's feverishly working on a locked drawer \n               when a voice interrupts him.\n\n                                     KING\n                         Don't go to all that trouble.\n\n               Galen whirls around to find the King standing in the doorway. \n               The monarch looks shattered. Galen edges toward the split in \n               the wall and finds that it has been shored up with timbers. \n               At that moment Tyrian comes through the door, sizes up the \n               situation and draws his sword.\n\n                                     GALEN\n                         I'm unarmed. If you want a fight, at \n                         least give me a weapon.\n\n                                     TYRIAN\n                              (pushing by the King)\n                         I think not!\n\n                                     KING\n                         Stop! Don't harm him.\n                              (to Galen)\n                         And you -- don't run away... please...\n\n               The King's voice is cracking. Galen and Tyrian are equally \n               taken aback. The King searches through the books remaining \n               on the library shelves.\n\n                                     KING\n                              (shaky)\n                         I've always had the greatest \n                         admiration for the black arts. You \n                         chaps with your mysterious spells... \n                         I didn't think it would be necessary, \n                         you see. Vermithrax is an old dragon. \n                         And that, I thought, was the beauty \n                         of my plan -- buying time. We'd wait \n                         her out. I'd live to see the end of \n                         her.\n                              (firm)\n                         That's still going to happen.\n\n               The King finds the book and takes the amulet out. With \n               trembling hands, he passes it to Galen.\n\n                                     TYRIAN\n                         Sire!\n\n                                     KING\n                         He shall have it.\n                              (pleading)\n                         It's my daughter. Save her, I beg \n                         you.\n\n                                                                    CUT TO:\n\n               VILLAGE - DAY\n\n               The people of Swanscombe are clearing up the rubble and \n               beginning repairs on their dwellings. Standing in their midst, \n               lecturing every passerby, is Greil. He holds up the charred \n               remains of Brother Jacopus' wooden cross.\n\n                                     GREIL\n                         Holy of holies -- he did not die in \n                         vain. Can you hear me, brothers?\n\n               Some workmen go by lugging new thatch. Malkin is with them.\n\n                                     MALKIN\n                              (gently)\n                         We hear you, Greil.\n\n                                     GREIL\n                         Well and good, but I'm Greil no \n                         longer. Call me Gregorius, after the \n                         Bishop of Rome.\n\n               Malkin and the others stop to listen.\n\n                                     GREIL\n                         I saw him die. Like Our Lord Jesus \n                         on the cross he was, scourged by \n                         evil. But he showed no fear. Such is \n                         the power of the Holy Ghost.\n\n               BLACKSMITH SHOP\n\n               Galen lurks in the shadows of Simon's metal shop looking out \n               on the square where Greil is holding forth.\n\n                                     GREIL\n                         Of what avail is magic? The old gods \n                         died with our daughters. From whence \n                         comest my help? My help comest from \n                         the Lord!\n\n               Galen quietly shuts and bars the door. He moves deeper into \n               the gloomy workroom where Simon is pumping a bellows to heat \n               up the forge. Galen looks at the coals.\n\n                                     SIMON\n                         Good and hot.\n\n                                     GALEN\n                         Don't bother. That's not the kind of \n                         fire we need.\n\n               Valerian is staring at the sword, sitting on the anvil in \n               its silk wrapping. Galen uncovers it, holds it high, and \n               puts his hand on the amulet.\n\n                                     GALEN\n                         Nunc, per Potestatem Hermeticum -- \n                         ex flammis, ferrum sangrinarium!\n\n               The sword starts to hum and to heat up. From the hilt outward \n               the blade glows brighter and brighter: red, orange, white. \n               It lights up the room, throwing long shadows into the corners. \n               Galen lays the white hot steel on the anvil. Simon takes up \n               his hammer and begins the reforging. Valerian sees their \n               resolve. After watching for several moments she slips out \n               the side door, looking sad.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - DAY\n\n               Clouds scud low over the lifeless region. The dragon's lair \n               now has a newer, bigger entrance. Vapors drift upward from \n               it. Down the slope a lonely figure works its way from rock \n               to rock: it's Valerian with a wicker basket on her arm, \n               searching for dragon scales. The basket is already more than \n               half full when she finds herself ominously near the mouth of \n               the cavern. She's about to turn back when she spies a \n               particularly large and beautiful scale just a few yards \n               further on. As she reaches for it, there is a sudden hiss! \n               She jerks her hand back and freezes. There in the shadows is \n               a baby dragon, a basilisk, all coppery bronze with stubby \n               winglets. As she backs away, she sees two more come up to \n               join the first. They watch her retreat through wicked little \n               green eyes.\n\n                                                                    CUT TO:\n\n               STREAM - DAY\n\n               On the mossy bank Galen and Simon unwrap the reforged sword. \n               Now the blade carries a faint blue halation. Galen walks to \n               the middle of the current and once again stabs the tip down \n               into the sand. Then he rejoins Simon onshore to await results. \n               This time, as the oak leaves approach the sharp edge, they \n               gently but definitely veer sideways to avoid contact. Such \n               is the power of the sword that even after many leaves, not a \n               single one has come close enough to be sliced. Simon is agog \n               and even Galen seems satisfied. They clasp hands.\n\n                                     SIMON\n                         An edge like no other on this earth.\n\n                                     GALEN\n                         Well done, Simon. Thank you.\n\n               Simon hands him a bundle of fighting equipment.\n\n                                     SIMON\n                              (grave)\n                         I'll say goodbye to Valerian for \n                         you. I'm sorry she's not here, but \n                         you know how she is.\n\n                                     GALEN\n                         I understand.\n\n               They look at each other for what could be the last time.\n\n                                     SIMON\n                         Fare thee well.\n\n               The old man departs. Galen unfolds the bundle and brings out \n               its contents: mail hauberk with coif, studded leather gloves, \n               padded jerkin, a scabbard and a small wooden shield. He lays \n               them out on the stream bank, then strips off his tunic and \n               kneels down to splash some water in his face. As the cups \n               the water between his hands, an image comes alive and shimmers \n               on the surface: Valerian, stripping off her own clothes, \n               shyly turning toward him, solemn and romantic.\n\n                                     VALERIAN\n                         Galen.\n\n               It's as if the vision is speaking to him, but it's not. He \n               spins around and sees her standing there, fully clothed, and \n               possessed of a brisk and businesslike air.\n\n                                     VALERIAN\n                         Here.\n\n               She throws down a shield. It's remarkable in its construction -- \n               overlapping layers of iridescent dragon scales have been \n               ingeniously fastened to a leather-clad frame.\n\n                                     VALERIAN\n                         It's a shield. I made it. Might keep \n                         the fire off you. Might not. You \n                         know, you're an idiot. You're going \n                         to die tonight. You'll be ripped \n                         limb from limb. This is the last \n                         time I'll ever speak to you.\n\n               Galen turns the shield over and over, marveling at it. He \n               fixes her with a piercing look.\n\n                                     GALEN\n                         Thank you.\n\n                                     VALERIAN\n                              (rushing)\n                         Another thing. That thing isn't alone \n                         up there. There's little ones. Young, \n                         I think. I don't know how many.\n\n               She shudders. Galen's eyes are still fastened on her. She's \n               fighting to retain her hard manner, but the agitation and \n               dread are plain.\n\n                                     GALEN\n                         Hatchlings. They'll have to be killed \n                         too. Anything else?\n\n               Valerian wants to be bold, but on this final point, can't \n               muster the courage.\n\n                                     VALERIAN\n                              (tiny voice)\n                         You're in love, aren't you?\n\n                                     GALEN\n                              (slowly nodding)\n                         Yes.\n\n                                     VALERIAN\n                         That's all right. I understand. She's \n                         very beautiful, very brave.\n\n                                     GALEN\n                         Who is? What do you mean?\n\n                                     VALERIAN\n                         Your Princess. But I don't care. It \n                         doesn't change the way I feel.\n                              (firm)\n                         Listen to me, Galen Bradwardyn, \n                         sorcerer's apprentice; you're going \n                         to be dead, the dragon will be worse \n                         than ever, there will be more \n                         lotteries, and I'm not a boy any \n                         more.\n\n                                     GALEN\n                         And you'll be eligible because --\n\n                                     VALERIAN\n                         Because I'm still a virgin, and I \n                         want you to do something about it.\n\n               Galen takes her in his arms; she is trembling. He tilts her \n               face up toward his and kisses her.\n\n                                     GALEN\n                         I am in love. But not with the \n                         Princess.\n\n               Their image is reflected in the waters. Through the ripples \n               she is visible pulling briefly away to remove her clothes.\n\n               From afar, they are two tiny figures under the overarching \n               oaks and willows. They embrace and sink down into the deep \n               grass beside the water. The leaves continue their unhurried \n               course downstream.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - NIGHT\n\n               A cold wind whistles through the rocks near the dragon's \n               lair. By the light of a flickering torch two workmen finish \n               driving a heavy post into the ground. As they affix a pair \n               of iron manacles they see the torches of a procession coming \n               up the slope. They hurry down to meet it. Horsrik is in the \n               lead, followed by soldiers and royal attendants. Elspeth \n               rides in the tumbril behind a blindfolded horse. Bringing up \n               the rear is Tyrian. At last the cart can go no further. \n               Elspeth alights and leads the rest of the troop to the post. \n               As the soldiers put the irons around her wrists, Horsrik \n               unrolls a parchment, turns his back on the wind and begins \n               to read:\n\n                                     HORSRIK\n                         Now be it known throughout the \n                         kingdom, that the Princess, having \n                         been chosen by a deed of fortune and \n                         destiny --\n\n               Horsrik blinks. There's a black stain growing in the middle \n               of the parchment; all at once it bursts into flames. He cries \n               out and flings the document away. There follows a flash of \n               light and a puff of smoke and Galen is standing there, as if \n               he had materialized out of thin air. Horsrik and his startled \n               men backpedal down the slope.\n\n                                     HORSRIK\n                         No fire, I beg you.\n\n               Galen raises his hands in a menacing gesture.\n\n                                     GALEN\n                         Be gone!\n\n               That's enough for Horsrik and company: he and the soldiers \n               depart.\n\n                                     HORSRIK\n                              (over his shoulder)\n                         I declare these proceedings duly \n                         ordained...\n\n               Only one man remains behind the challenge the young sorcerer: \n               Tyrian. He draws his sword.\n\n                                     TYRIAN\n                         I knew I'd find you here. Well, I'm \n                         not as sentimental as some. The \n                         kingdom, every one of us, need this \n                         sacrifice. If you intend to interfere, \n                         you'll have to kill me.\n\n                                     GALEN\n                         I've got plenty of reasons to kill \n                         you that have nothing to do with \n                         this sacrifice.\n\n               Galen draws his own sword. As it emerges into the night air \n               it seems imbued with a blue phosphorescence.\n\n                                     TYRIAN\n                         Most impressive. Can you use it?\n\n               Elspeth twists around in her chains.\n\n                                     ELSPETH\n                         Let it be! Please! Tyrian is right -- \n                         it's our only hope!\n\n               Galen starts to reply, but as soon as his attention wavers, \n               Tyrian is lunging toward him, sword point directed at his \n               neck. Galen barely manages to parry the thrust before Tyrian \n               is at him again, blade swinging toward his knees. Galen drops \n               the tip of his sword to catch the blow. When the two steel \n               edges connect, sparks fly. In a series of thrusts and counter-\n               thrusts, each accompanied by a shower of sparks, Tyrian backs \n               Galen up the mountain.\n\n                                     ELSPETH\n                         Tyrian -- both of you -- run! Flee! \n                         It's coming!\n\n               Sure enough, at that moment the earth gives out a low moan \n               and undulates in a sickening movement. Vapors begin rising \n               from the lair.\n\n                                     TYRIAN\n                         In a trice! This is no swords-man.\n\n               He might be right, for Galen turns and bolts across the slope. \n               When he reaches the post with Tyrian two steps behind, he \n               whirls and brings his blade down on Princess Elspeth's chains. \n               The chains part in an explosion of sparks.\n\n                                     GALEN\n                         Run! Get out of here!\n\n               The Princess darts from the piling as Tyrian swoops down to \n               continue the attack. Galen dodges and the stake catches \n               Tyrian's blow. The earth shakes again. Galen glances at the \n               Princess.\n\n                                     GALEN\n                         No! Stop! What are you doing?\n\n               Elspeth is not running away down the mountain. Instead she \n               is walking, slowly and deliberately, right into the smoking \n               cave. Swoosh! Tyrian's sword comes down again. The dismayed \n               sorcerer ducks back and Tyrian's blade again bites deep into \n               the wood.\n\n                                     TYRIAN\n                         You've failed, my friend, and I thank \n                         the gods for it. Come out from behind \n                         that post.\n\n               It's now or never. Elspeth is no longer in sight. Galen grits \n               his teeth, grasps the sword with two hands and swings it as \n               hard as he can in a wide arc. The blade never even slows \n               down as it sails right through the post, lopping it clean \n               off. The glowing sword flashes above Galen's head and eagerly \n               buries itself in Tyrian's chest. The King's man is as startled \n               by the amputated piling as he is by his own death. His eyes \n               roll up in his head, his knees buckle and he topples backward -- \n               the blade sliding free.\n\n               DRAGON'S LAIR\n\n               Smoke swirls at the mouth of the cave as Galen enters, holding \n               his sword before him, lighting his way with its faint blue \n               glow.\n\n                                     GALEN\n                         Elspeth!\n\n               The floor of the cave as it winds down into the mountain is \n               paved first with rock, then with dragon scales, then with \n               bones. With each footfall, clusters of mysterious insects \n               scuttle away. Galen pauses to mop his brow; it's getting \n               hot. A sound echoes up from the depths, a grinding sound \n               like the gnashing of teeth, followed by hissing and squealing. \n               Galen grips his sword tighter and pushes on. Suddenly he \n               stoops and picks up an embroidered slipper: Elspeth's. The \n               grinding sounds are louder. He hurries forward and rounds a \n               corner. He stops and gags.\n\n               BASILISKS\n\n               Two disgusting little reptiles -- like scaly raccoons -- are \n               perched on the corpse of Princess Elspeth Ulfilas, feeding \n               contentiously on choice bits of the royal flesh. Galen groans: \n               he lashes out and his sword beheads one of the tiny monsters.\n\n               The other one buzzes its half-formed winglets and hisses a \n               hot stream of air. Galen brings down the sword and slices it \n               in half. Eyes riveted on Elspeth's remains, he edges around \n               the carnage and backs away. Hissss! -- there's a third one, \n               lurking in the shadows, munching on something; it might be a \n               hand. Galen shrieks and jumps away. The little creature comes \n               at him and clamps its jaws on his leg. Galen stabs at it \n               repeatedly. Finally it lets go, and flails and flops across \n               the bloody floor, ululating its death agony. As the creature's \n               last mewlings echo down through the cavern, the ground \n               quivers. Bits of stone fall from the ceiling.\n\n               LAKE OF FIRE\n\n               Galen works his way down a narrow passage whose walls are \n               alive with insects and beads of sulphurous water. As before, \n               he holds the sword in front of him; he marvels at its \n               increasing brightness. The heat is increasing too; sweat \n               mats his hair and runs down his face. A few yards further on \n               the sword starts pulsating. Now the walls take on a flickering \n               rosy sheen and the passage widens into an underground vista \n               of staggering immensity: an underground lake, its surface \n               bubbling and torn with sheets of flame. Arching over it is a \n               vault of stone, penetrated here and there by natural chimneys. \n               The dimensions of this internal world are unknown -- the \n               fiery lake disappears into half a dozen side chambers. The \n               one clear path is accessible only by a series of flat stones \n               leading across the hot liquid. Galen grips his sword and \n               resolutely hops from rock to rock.\n\n               VERMITHRAX\n\n               He's halfway across when the earth rumbles and the stepping \n               stones teeter beneath his feet. A fiery wave washes over his \n               legs, leaving his boots smoking. Another tremor knocks Galen \n               to his knees. As he scrabbles to pick up his sword and shield, \n               the great head of Vermithrax rises up out of the depths on \n               its long neck. It gazes at him through huge pale eyes under \n               armored lids. A tongue flicks out and runs around its lipless \n               mouth. The head sways from side to side. The mouth hinges \n               open, the nostril-like igniters come on and touch off the \n               jet of gas squeezed up out of its innards. A roaring tube of \n               flame engulfs Galen. He crouches behind his dragon scale \n               shield which deflects the fire just enough to save his life. \n               The dragon pauses to take a breath. Galen springs to his \n               feet, and bounds back the way he came, his skin and clothing \n               singed. Flames lick at his back as the dragon lets fly with \n               a second burst.\n\n               TUNNEL\n\n               Coughing and weeping, Galen staggers up through the tunnel, \n               nearly tripping over the body of one of the baby dragons. A \n               few seconds later, Vermithrax follows, squirming and clawing \n               its way upward. When it reaches its dead offspring it surveys \n               the scene with expressionless eyes. Bringing its head low, \n               it sniffs and nudges at the lifeless little ones.\n\n               AMBUSH\n\n               At that moment Galen leaps out from behind a niche in the \n               tunnel wall and lunges forward. Striking sparks, the point \n               of his sword slides across the dragon's plated cheek and \n               stabs deep between the scales of its heavy neck. There is an \n               unearthly shriek and the creature flicks its head back and \n               upward. Galen goes sprawling and finds himself holding half \n               a sword. The rest is buried in the beast's neck, and \n               Vermithrax doesn't like it. It flings its head this way and \n               that, knocking rocks loose from the ceiling. Its movements \n               cause the ground to quake. As boulders tumble around him, \n               Galen drops to the floor under his shield. Dragon flame \n               reaches through the cascading debris and washes over him.\n\n                                                                    CUT TO:\n\n               DAWN\n\n               Valerian roams the rock-strewn slope not far from the dragon's \n               lair. Presently she comes upon a once-familiar object -- the \n               fire shield. Half the scales are gone, the rest are charred \n               and curling. Grimly, she moves on. A few paces away she picks \n               up the blunted sword. She scans the rocks and finally sees \n               what she's looking for.\n\n               GALEN\n\n               He's lying face down behind a boulder, his clothes charred, \n               patches of skin scorched. He looks dead. Valerian rolls him \n               onto his back. She gasps: the eyes are open, regarding her.\n\n                                     GALEN\n                         Still alive.\n\n                                                                    CUT TO:\n\n               BLACKSMITH SHOP - DAY\n\n               Simon is standing by the anvil with the broken sword in his \n               hand, lost in thought.\n\n               HOUSE\n\n               In the adjoining house Valerian tends Galen's wounds. He's \n               propped up on a palette enduring the application of poultices.\n\n                                     VALERIAN\n                         You know what we have to do.\n                              (he looks at her with \n                              dull eyes)\n                         We have to leave Urland.\n\n               He winces in pain.\n\n                                     VALERIAN\n                         Not because of what happened. I \n                         brought you here -- it didn't work -- \n                         now I'm taking you away. Do you \n                         understand?\n                              (Galen does not react)\n                         You said you loved me. Is it true? \n                         If it is, it's the only good we've \n                         done. Let's not lose that too.\n                              (pause)\n                         Galen?\n\n               He seems miles away. She turns aside, on the verge of tears. \n               Simon is standing there, still holding the sword hilt.\n\n                                     SIMON\n                         She's right. What kind of a life \n                         could you have here? It's too late \n                         for me, but you're young enough.\n                              (he shows them the \n                              sword)\n                         You know what I think? Magic is dying \n                         out, fading from the world. But that \n                         makes me happy. That means the dragon \n                         will be dying too.\n\n               Galen looks at him; he has heard everything. He sits up and \n               fondly regards Valerian.\n\n               PACKING\n\n               Valerian packs her belongings into a rucksack. The last item \n               in is her blue frock, carefully rolled. Beside her, Galen \n               dons clean traveling clothes. He stiffly crosses the room \n               and drags his pack out of the corner. He sorts through the \n               effects, and amidst the clothing and supplies discovers the \n               leather pouch containing Ulrich's remains. He contemplates \n               it.\n\n                                     VALERIAN\n                         What's that?\n\n                                     GALEN\n                         Nothing. I was just thinking -- poor \n                         Hodge.\n\n               He tucks the pouch away, throws some clothes on top and ties \n               the satchel shut.\n\n                                                                    CUT TO:\n\n               STREAM - DAY\n\n               Beside the quiet stream Simon bids farewell to the young \n               couple, embracing each in turn. They slosh across the shallow \n               water and follow a path into the woods.\n\n                                                                    CUT TO:\n\n               VILLAGE SQUARE - DAY\n\n               Greil is standing outside the half-burned grange hall, \n               summoning the Christian faithful. He proclaims the call to \n               worship by hammering on a small bell. One by one the townsfolk \n               arrive. Among them is Simon, looking bereft.\n\n                                                                    CUT TO:\n\n               FOREST PATH - DAY\n\n               Valerian and Galen trudge along side by side.\n\n                                     VALERIAN\n                         How's your leg?\n\n                                     GALEN\n                         Hurts. That thing was small, but its \n                         teeth were sharp.\n\n                                     VALERIAN\n                         At least you killed it. You got all \n                         the young.\n\n               This is small consolation, and Galen sighs.\n\n                                     GALEN\n                         But the big one's alive. Somewhere \n                         down in that burning lake.\n\n                                     VALERIAN\n                         Don't think about it. You had your \n                         fight, and you're still here. That's \n                         more than anyone else can say. Let's \n                         think about what lies ahead.\n\n               She reaches out to take his hand. But Galen is no longer at \n               her side. She stops and looks back.\n\n               GALEN\n\n               Galen has come to a halt in the middle of the path. He's \n               staring into the middle distance with a sudden inspiration \n               bubbling in his brain. He flings off his sack, drops to his \n               knees and tears through the contents. Valerian comes back, \n               baffled. Galen's gear is strewn all over the trail.\n\n                                     VALERIAN\n                         What are you doing?\n\n               Galen comes up with what he's looking for -- the leather \n               sack. When he replies, it is not to her, but to Ulrich:\n\n                                     GALEN\n                         You old trickster! The burning water! \n                         The lake of fire!\n\n                                     VALERIAN\n                         Galen, what are you saying?\n\n               He regards her with astonishment.\n\n                                     GALEN\n                         He had it planned. He knew this was \n                         going to happen.\n\n                                     VALERIAN\n                         Who did? What happened?\n\n                                     GALEN\n                         We've got to go back, I want to talk \n                         to him!\n\n               He heads back down the trail, leaving his belongings on the \n               road.\n\n                                     VALERIAN\n                         Where are you going?\n\n               She hurries after him.\n\n                                                                    CUT TO:\n\n               GRANGE HALL - DAY\n\n               Greil, a.k.a. Gregorious, stands in the center of the burned-\n               out granary, delivering a sermon. Behind him, men are filling \n               the baptismal cistern.\n\n                                     GREIL\n                         The Church is mother to us all. Not \n                         just one lonely orphan who has lost \n                         his way, not just a few, but all of \n                         us that believeth in Him. When enough \n                         voices come together in prayer, He \n                         shall hear, we shall live and the \n                         beast shall die.\n\n               In the gathering Simon ponders the hilt of his once fabulous \n               sword. With its blade shortened, it looks a lot like a \n               crucifix.\n\n                                                                    CUT TO:\n\n               DRAGON COUNTRY - DAY\n\n               Galen bounds up the rocky slope as fast as he can manage, \n               trailed by a desperate Valerian.\n\n                                     VALERIAN\n                         Galen, stop! Please, I beg you!\n\n               But Galen pays no attention. In a burst of speed and fury, \n               Valerian comes up behind and tackles him.\n\n                                     VALERIAN\n                         Stop! I won't let you kill yourself.\n\n               Galen waves the leather pouch in Valerian's face.\n\n                                     GALEN\n                         He couldn't walk -- he knew he \n                         couldn't make the journey. So he had \n                         us make the journey for him! Don't \n                         you see?\n\n               He jumps up and runs to the mouth of the lair.\n\n                                     VALERIAN\n                              (pursuing)\n                         No!\n\n               She tackles him again.\n\n                                     VALERIAN\n                         All right, all right. You're going \n                         in there, I'm going too.\n\n                                     GALEN\n                              (brought up short)\n                         What? Why? No you're not, this is my \n                         job. Absolutely not.\n\n               But Valerian springs to her feet and starts into the lair.\n\n                                     VALERIAN\n                         I'm not afraid. And you're not going \n                         to stop me. After all -- I've been a \n                         man longer than you have.\n\n               Galen pauses long enough to snatch up a discarded torch near \n               the remains of the wooden stake, then charges after her.\n\n               UNDERGROUND\n\n               Running footsteps resound in the steamy passageway and Galen \n               comes around the corner holding his torch high to light the \n               way. Valerian stumbles after him. He grabs her hand.\n\n                                     GALEN\n                         Stay close.\n\n               Down and down they go. Soon they reach Elspeth's body.\n\n                                     VALERIAN\n                         What's that?\n\n                                     GALEN\n                         Never mind. Come on.\n\n               But she pulls the torch from his hand and goes over to see.\n\n                                     GALEN\n                         All right. Wait here.\n\n               He darts off. In the flickering torchlight Valerian can see \n               the Princess' remains all too clearly. She suppresses a \n               scream.\n\n                                     VALERIAN\n                         Galen? Galen? Where are you?\n\n               No answer. The torch reveals several passages. She doesn't \n               know which one to take.\n\n               LAKE OF FIRE\n\n               The passage widens out and once again Galen is standing on \n               the shores of the lake of fire. He looks around. The water \n               is rolling with bubbles of gas, and flames run hither and \n               yon across the surface, but there is no sign of the dragon. \n               Gathering his courage, he hops across the stepping stones to \n               the middle of the lake. There he hurriedly opens the pouch.\n\n                                     GALEN\n                         Ex favilla, vita nova!\n\n               Gripping the amulet with his free hand, he scatters Ulrich's \n               ashes in a wide arc over the burning water. Instantly, there \n               is an ominous rumble and the earth gives a shrug. But no \n               wizard appears. No dragon, either. There follows another and \n               stronger quake. Galen crouches to keep his balance. Still no \n               wizard.\n\n               OUTSIDE\n\n               Thoroughly bewildered, Valerian stumbles out into daylight. \n               She wanders a few yards down the slope and collapses against \n               the stake. Something is strange: it's getting dark. Squinting \n               up at the sun, she frowns in puzzlement, then gapes at what \n               is happening.\n\n               ECLIPSE\n\n               Slowly and ponderously the black disk of the moon slides \n               over the face of the sun, plunging the world into crepuscular \n               half-light.\n\n                                                                    CUT TO:\n\n               GRANGE HALL - DAY\n\n               The congregation is confused and frightened by the sudden \n               darkness.\n\n                                     GREIL\n                         Be calm. He watcheth over us! And \n                         this is His sign! Let us pray! Our \n                         Father who art in heaven...\n\n               The faithful bow their heads and join in. Simon as well.\n\n                                                                    CUT TO:\n\n               LAKE OF FIRE\n\n               The earthquakes have subsided; the water is calm. Galen stares \n               bleakly into the flames. As he watches, they gather themselves \n               into a lazy spiral. Gradually the spiral speeds up and becomes \n               a vortex. Now the flames become tinged with green, and as \n               the cavern moans with the sound of rushing air, a form takes \n               shape at the crest of a jet of flame. It is Ulrich, supine \n               as upon his pyre, reforming before Galen's eyes.\n\n                                     GALEN\n                         Ulrich! Magister! Over here! I can \n                         see you! Over here!\n\n                                     ULRICH\n                              (looks at him)\n                         Not so loud. I'm not deaf, you know.\n\n               He slowly raises himself into an upright posture and strides \n               through the flames.\n\n                                     ULRICH\n                         Sic redit magus ex terra mortis.\n\n               The apprentice throws himself at his master's feet.\n\n                                     GALEN\n                         Wonder of wonders -- you're back! I \n                         thank the powers that made me!\n\n                                     ULRICH\n                         Glad to see you, too. You didn't \n                         bring along anything to eat, by any \n                         chance?\n\n                                     GALEN\n                         Food?\n\n                                     ULRICH\n                         No? Oh well, no time anyway.\n\n               OUTSIDE\n\n               Valerian is standing in the unearthly twilight, anxiously \n               peering into the mouth of the lair. Suddenly she is hit from \n               behind by a gust of wind. She does not turn to see the \n               enormous Vermithrax alighting silently behind her.\n\n               GALEN & ULRICH\n\n               Ulrich raises Galen to his feet.\n\n                                     ULRICH\n                         Come along. There's much to be done.\n\n                                     GALEN\n                         Wait, I have something to tell you.\n\n                                     ULRICH\n                         It can wait.\n\n                                     GALEN\n                         No it can't. Listen: I thought I was \n                         a sorcerer -- but I wasn't. I thought \n                         I had power -- but I didn't. I thought \n                         I was you -- but I'm not.\n\n               He hangs his head. Ulrich regards him steadily.\n\n                                     ULRICH\n                         Well said. Now hurry.\n\n               He leads the way across the rocks to the shore and into the \n               tunnel.\n\n               VALERIAN\n\n               Time seems to have come to a stop. Overhead, the moon is \n               locked in front of the sun. At the lair, Valerian stands \n               frozen as the dragon leans over her. The great head sways \n               from side to side. The jaws hinge open. Suddenly, Valerian \n               recovers herself and makes a run for it, leaping and \n               scrabbling over the rocks. A plume of flame licks at her \n               heels. She sees a protective crevice and heads for it, but a \n               winged claw drops to block her way. She changes direction \n               and is cut off again. Cat and mouse.\n\n               VERMITHRAX\n\n               The pale yellow eyes stare implacably down at the hopeless \n               victim. The igniter jets come on, then off, as the beast \n               suddenly stiffens. The head rotates, almost as if catching a \n               new scent. Finally the eyes focus on the entrance to the \n               cavern.\n\n               ULRICH\n\n               There is the sorcerer, leaning on Galen, coolly regarding \n               the creature. The old man's expression hardens.\n\n                                     ULRICH\n                         Draco draconis...\n\n               The dragon lifts its wings as if to menace them, then flaps \n               twice and is airborne. The thing shoots overhead and, with a \n               rush of wind, flies off into the gloom.\n\n               IN THE ROCKS\n\n               Valerian struggles out of her hiding place.\n\n                                     VALERIAN\n                         Galen!\n\n               Galen runs to her. They embrace. When they look up, Ulrich \n               is at their side.\n\n                                     ULRICH\n                         Where's my amulet? Give it to me, \n                         please.\n\n               Galen's hand locates the jewel under his shirt. He finds \n               himself reluctant to part with it.\n\n               With a hurricane howl, a column of flame touches down nearby \n               and rushes toward them. They stagger back as the dragon sweeps \n               past.\n\n                                     ULRICH\n                         Be quick!\n\n               Galen hands his treasure over. Ulrich closes his hand around \n               it.\n\n                                     ULRICH\n                         Come close to me.\n\n               Galen and Valerian approach. The old man's hand is suffused \n               with an internal glow. Behind them, the dragon is turning \n               for another pass.\n\n               VORTEX\n\n               All at once the glow brightens, and in another instant the \n               world spins off into a blur, setting all three afloat in a \n               timeless netherworld. Valerian and Galen cling to each other \n               in terror.\n\n                                     ULRICH\n                         Don't be afraid. You have served me \n                         with great courage. Now you must \n                         show me you have even more.\n\n                                     GALEN\n                         Anything!\n\n               The voices seem to be coming from a huge distance. Starlike \n               gleams whiz by, and fleeting glimpses of half-recognizable \n               faces and forms. The wizard's eyes are like glittering \n               crystals. Tiny motes and planetoids dance in the hairs of \n               his beard. He seems wreathed in luminescence.\n\n                                     ULRICH\n                         You must destroy the amulet, and me \n                         along with it.\n\n                                     GALEN\n                         No!\n\n                                     ULRICH\n                         You brought me from the flames, you \n                         must send me back.\n\n                                     GALEN\n                         I can't.\n\n                                     ULRICH\n                         When the time comes, you'll \n                         understand. Here.\n\n               He dangles the amulet in front of Galen. Even more reluctantly \n               than he let it go, he takes it back.\n\n               MOUNTAIN TOP\n\n               Abruptly, the vortex is gone and they find themselves atop a \n               rocky crag overlooking the eclipse-darkened fields and farms \n               of Urland. Galen glances at his surroundings and stares at \n               the amulet, full of awe.\n\n                                     ULRICH\n                         I know what you're thinking. You \n                         have learned much and done well. \n                         Don't worry, you won't need it any \n                         more.\n\n                                                                    CUT TO:\n\n               GRANGE HALL - DAY\n\n               Greil is urging Simon, the last of the converts, into the \n               cistern.\n\n                                     GREIL\n                         Make haste, brother.\n\n               He dips Simon's head under water.\n\n                                     GREIL\n                         Now be thou baptized in the name of \n                         the Father, Son and Holy Ghost. May \n                         the Lord our God light our way.\n\n               In the background, half the congregation is staring through \n               the burned-out walls, fervently praying and crossing \n               themselves, wondering if they'll ever see the sun again. A \n               cry goes up: a shape crosses the solar corona, wheels over \n               the village and streaks away toward the mountains -- the \n               dragon.\n\n                                                                    CUT TO:\n\n               MOUNTAIN TOP\n\n               Galen and Valerian peer out from behind a boulder and watch \n               Ulrich hobble perilously close to the edge of the cliff. The \n               old man spreads wide his arms and tilts his head back.\n\n                                     ULRICH\n                         Nimbus! Tempestas! Fulmen!\n\n               From over the horizon roiling inky-black clouds churn down \n               upon them. Thunder booms and echoes. A bitter wind whips \n               their clothing. As the storm gathers fury, the dragon \n               reappears, circling in the distance. Finally it homes in on \n               the mountain crag and dives at Ulrich. The conjurer makes a \n               gesture and strokes of lightning explode against the beast's \n               scaly flanks. It emits a high thin scream and rockets past.\n\n               GALEN & VALERIAN\n\n               Valerian crawls away and comes back with a hefty chunk of \n               granite.\n\n                                     VALERIAN\n                         Here. Do as he said. Smash it.\n\n                                     GALEN\n                         Not if it means killing him.\n\n               ULRICH\n\n               He resolutely waits as the dragon banks against the clouds \n               and starts another pass. Again, the sorcerer summons lightning \n               bolts. But the dragon keeps coming; this time a talon splits \n               the old man's cape.\n\n               GALEN & VALERIAN\n\n               Valerian wrestles the amulet away from Galen. It falls to \n               the ground.\n\n                                     VALERIAN\n                         You heard what he said.\n\n               She lifts the chunk of stone. Galen grabs for it.\n\n                                     GALEN\n                         No! You can't!\n\n               THE LAST ATTACK\n\n               Vermithrax spirals up into the storm, then drops earthward. \n               Ulrich watches as the beast comes straight at him. He folds \n               his arms and bows his head. Leathery wings humming, the \n               creature levels out, swoops up past the crag and lifts the \n               master magician away in its huge hind claw.\n\n                                     ULRICH\n                         Galen!\n\n               Galen and Valerian are horrified to see the dragon circling \n               upward with the sorcerer writhing in agony in its grip. As \n               the monstrous thing flies high over them, they can hear \n               Ulrich's faint screams.\n\n               DEATH\n\n               Now Galen understands. He seizes the granite block from \n               Valerian and raises it with both hands over his head. He \n               takes a final look at the amulet, glowing at his feet, then \n               brings the rock down with all his might. There is a blinding \n               flash as it shatters into a million fragments.\n\n               Far above there is another blinding flash as Ulrich's earthly \n               body explodes against the belly of the beast. The darkened \n               sky lights up as huge gouts of flame spew forth from the \n               dragon's gut. Wings fluttering uselessly, this reptilian \n               torch plummets to the ground.\n\n               LAKE\n\n               Below, a stock pond nestled in the foothill pastures. Trailing \n               a wake of flame, Vermithrax plunges like a comet into the \n               water. There is a stupendous splash and eruption of steam.\n\n               GALEN & VALERIAN\n\n               They stare down from their lofty perch, watching as further \n               explosions boil the water from the pond.\n\n               ECLIPSE\n\n               Behind a tattered wrack of cloud, the moon slowly uncovers a \n               pale sun.\n\n                                                                  DISSOLVE:\n\n               THE CARCASS - DAY\n\n               Grey misty light reveals the beast's mangled remains. Galen \n               and Valerian emerge from the fog, walk under a blackened \n               wing and make their way through the mud and loose scales to \n               the huge charred head. The death agony has twisted it upside \n               down. The mouth is frozen in a grotesque look of surprise. \n               The eyes are glazed. Now the sound of voices floats toward \n               them, chanting an ancient hymn. A moment later a mob of \n               Christians, led by Greil, crests a hill and moves toward the \n               hulk. The song ends.\n\n                                     GREIL\n                         Let us pray.\n\n               The members of the congregation fall to their knees.\n\n                                     GREIL\n                         We thank thee, Lord, for this divine \n                         deliverance. Verily is thy presence \n                         amongst us, fully manifest in this, \n                         thy great work.\n\n               Galen and Valerian look at each other. She takes his hand.\n\n                                     GREIL\n                         Arise, children of the Lord and \n                         forsake evermore the pagan mysteries. \n                         Rejoice in the true power of the \n                         Christian God!\n\n               Galen turns and leads Valerian away. They disappear into the \n               mist.\n\n                                                                  DISSOLVE:\n\n               FLENSING - DAY\n\n               In the clear light of a new day, ladders have been tipped up \n               against the creature's back. Teams of men swarm over the \n               crusted flesh, slicing off long strips for piecemeal burial. \n               Below, yoked oxen drag the heavy carrion away on sledges. In \n               the background other workmen dump the remains into an open \n               pit.\n\n               THE KING\n\n               With the crack of a whip and the clatter of hooves, the royal \n               coach pulls up to the shore of the lake. A door creaks open \n               and King Casiodorus totters out. His face is puffy, his eyes \n               are red. He slogs through the mud to the head of the dragon \n               and commences hacking at it with a ceremonial sword. Horsrik \n               steps out of the coach and draws himself up.\n\n                                     HORSRIK\n                              (loud)\n                         All hail Casiodorus Rex -- Dragon \n                         slayer!\n\n               The workers pause long enough to listen to this pronouncement \n               and cast a glance at the sorry spectacle. Wordlessly they \n               resume their labors.\n\n                                     HORSRIK\n                              (nodding)\n                         Hail and praise be!\n\n                                                                  DISSOLVE:\n\n               ON THE ROAD - DAY\n\n               The trail leads through copses and open meadows. Side by \n               side, Galen and Valerian march up a long slope under a hot \n               sun. He limps a bit; she finds a staff and hands it to him.\n\n                                     VALERIAN\n                         You want to rest?\n\n                                     GALEN\n                         No. I'm fine.\n\n                                     VALERIAN\n                         You miss Ulricn.\n\n                                     GALEN\n                         Yes.\n\n                                     VALERIAN\n                         And the amulet.\n\n                                     GALEN\n                         That too.\n\n                                     VALERIAN\n                         Not me. I'm glad it's gone. I'm glad \n                         you did what you did.\n                              (he doesn't reply)\n                         You may not be a sorcerer, Galen, \n                         but I love you anyway. I don't regret \n                         anything that happened. I just wish --\n\n                                     GALEN\n                         Yes?\n\n                                     VALERIAN\n                              (sighs)\n                         -- that we had a horse.\n\n               Galen falls a step behind. He briefly closes his eyes and \n               mutters something. They walk on a few paces. Then there is a \n               whinny from the nearby woods and a white stallion canters \n               forth. It crosses a meadow, comes right up to Valerian and \n               nuzzles her.\n\n                                     VALERIAN\n                         What is this?\n\n                                     GALEN\n                         A horse.\n\n                                     VALERIAN\n                         Did you...!?\n\n                                     GALEN\n                         No. It must have been wandering loose. \n                         Or wild.\n\n               Galen climbs aboard. He reaches out to help her up.\n\n                                     VALERIAN\n                         Wait a minute. I just wished for a \n                         horse and here it is.\n\n                                     GALEN\n                         You don't want to wish it gone, do \n                         you?\n\n               She thinks for a moment, then lets him help her up. Galen \n               touches the horse's flanks with his heels and they ride off.\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nDragonslayer\nWriters :   Hal Barwood  Matthew Robbins\nGenres :   Action  Adventure  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:24:12.889979"}