{"title": "English Patient, The", "film_link": "/Movie Scripts/English Patient, The Script.html", "script_link": "/scripts/English-Patient,-The.html", "info_raw": "\n\nEnglish Patient, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Anthony Minghella\nGenres  Drama  Romance\n\nRead \"English Patient, The\" Script\n\n\n", "script": "\n\n\n\n\n\n   The Enlish Patient\n\n\n\n\n   \n\nThe Saul Zaentz Company\n\n\n\n\n\nTHE ENGLISH PATIENT\n\n\nScreenplay by\nAnthony Minghella\n\nBased on the Novel by\nMichael Ondaatje\n\nDirected by\nAnthony Minghella\n\nProduced by\nSaul Zaentz\n\n      \n\n\n\n\n\n\nRevised Draft (\t\t\t)\n28th August, 1995\n\n\n\n\nCopyright 1995 The Saul Zaentz Company\n\n\n\n\n\n\n\n\n1\tEXT.    LATE 1942.    THE SAHARA DESERT.    DAY.\n\nSILENCE.  THE DESERT seen from the air.  An ocean of dunes  for mile \nafter mile.  The late sun turns the sand every color from crimson to \nblack.\n\nAn old AEROPLANE is flying over the Sahara.  Its shadow swims over the \ncontours of sand.\n\nA woman's voice begins to sing unaccompanied on the track.  Szerelem, \nszerelem, she cries, in a haunting lament for her loved one.\n\nINSIDE the aeroplane are two figures.  One,  A WOMAN, seems to be \nasleep.  Her pale head rests against the side of the cockpit.  THE \nPILOT, a man, wears goggles and a leather helmet.  He is singing, too, \nbut we can't hear him or the plane or anything save the singer's \nplaintive voice.\n\nThe plane shudders over a ridge.  Beneath it A SUDDEN CLUSTER OF MEN \nAND MACHINES, camouflage nets draped over the sprawl of gasoline tanks \nand armored vehicles.  An OFFICER, GERMAN, focuses his field glasses.  \nThe glasses pick out the MARKINGS on the plane.  They are English.  An \nANTI-AIRCRAFT GUN swivels furiously.\n\nShocking bursts of GUNFIRE.  Explosions rock the plane, which lurches \nviolently.  THE WOMAN SLUMPS FORWARD, slamming her head against the \ninstruments.  The pilot grabs her, pulls her back, but she's not \nconscious.  The fuel tank above their heads is punctured.  It sprays \nthem both, then EXPLODES.\n\nTHE MAN FALLS OUT OF THE SKY, clinging to his dead lover.  The are both \nON FIRE.  She is wrapped in a parachute silk and it burns fiercely.  He \nlooks up to see the flames licking at his own parachute as it carries \nthem slowly to earth.  Even his helmet is on fire, but the man makes no \nsound as the flames erase all that matters - his name, his past, his \nface, his lover...\n\n\n2\tEXT.    THE DESERT.    1942.    DAY.\n\nTHE PILOT HAS BEEN RESCUED BY BEDOUIN TRIBESMEN.  Behind them the \nwreckage of the plane, still smoking, the Arabs picking over it.  A \nSILVER THIMBLE glints in the sun, is retrieved.  Another man comes \nacross A LARGE LEATHER-BOUND BOOK and takes it over to the Pilot.  The \nPilot is charred.  His helmet has melted into his head.  He's oblivious \nto this, cares only about the woman who crashed with him.  He twists \nfrantically to find her.  Two men pick him up and carry him across to a \nlitter where they carefully wrap him in blankets.\n\n\n3\tEXT.    THE DESERT.    DUSK.\n\nThe Pilot is being carried across the desert.  A mask covers his face.  \nHis view of the world is through the slats of reed.  He glimpses \ncamels, fierce low sun, the men who carry him.\n\n\n4\tEXT.    AN  OASIS.    DUSK.\n\nThe Pilot sees a man squat down beside him, takes a date from a sack \nand begin to chew it.  Carefully, the Bedouin eases the mask from the \nPilot's face, leaving bandages of cloth and oil, but revealing a mouth.  \nHe stops chewing and passes the pulped date into the Pilot's mouth.  \nMouth to mouth.\n\n\n4a*.\tEXT.    DESERT.    DAWN.\n\nTHE CARAVANSERAI CROSSES THE DESERT, silhouetted against the dunes.\n\n\n5\tEXT.    AN  OASIS.    NIGHT.\n\nThe SOUND OF GLASS, of tiny chimes.  A music of glass.\n\nAN ARAB HEAD APPEARS ON A MOVING TABLE IN THE DESERT.  It floats in \ndarkness, shimmering from the light of a fire.  The image develops to \nreveal a man carrying a giant wooden yoke from which hang DOZENS OF \nSMALL GLASS BOTTLES, on different lengths of string and wire.  He could \nbe an angel.\n\nThe man approaches the litter which carries the Pilot.  He's still in \nthe protective reed mask, wrapped in blankets.  The MERCHANT DOCTOR \nstands over the burned body and sinks sticks either side of him deep \ninto the sand, then moves away, free of the yoke, which balances in the \nsupport of the two crutches.  He puts some liquid in the Pilot's \ntongue, whose eyes almost instantly begin to roll.  Then he slowly sets \nabout peeling away the layers of oiled cloth which protect the Pilot's \nflesh.\n\nThe Merchant Doctor crouches in front of the curtain of bottles and \nMAKES A SKIN CUP with the soles of his feet, then leans back to pluck, \nhardly looking, certain bottles, which he uncorks and mixes in the bowl \nhe'd made with his feet.  This mixture he uses to anoint the burned \nskin.  Next he finds green-black PASTE - ground Peacock Bone - and \nBEGINS TO RUB IT on to the Pilot's rib cage.  All the while he us \nhumming and chanting.  The bottles continue to jingle.\n\n\n6*.\tEXT.    ITALIAN HILL ROAD.    EARLY 1945.    DAY.\n\nThe sand gives way to trees, the jingling bottles to distant church \nbells, as A CONVOY OF TWENTY TRUCKS - Red Cross vehicles and some \nsupply vehicles - snakes along a bumpy hill road.  The war in Italy is \nlargely over and the Allies are moving up the country, the wounded and \nsupply lines slowly following.\n\n\n7*.\tINT.    RED CROSS TRUCK.    DAY.\n\nA young CANADIAN NURSE, HANA, sits in a truck full of patients.  Hana \npays special care to the PATIENT lying in the stretcher alongside her.  \nThis is the PILOT - now known as THE ENGLISH PATIENT.  A web of scars \ncovers the Patient's face and body.  They have the quality of a livid \ntattoo, magenta and green-black.  The hair has largely gone and the \neffect is curious, lassoing his features, the strong nose, the eyes \nliquid.  It's a warrior's face.  But he has no physical strength.  He \ncoughs violently as the trucks shudders along the road.\n\n\n8*.\tEXT.    ITALIAN HILL ROAD.    DAY.\n\nA JEEP pulls out of the line and approaches the Red Cross truck \ncontaining Hana and the Patient.  The horn blows and Hana looks out to \nsee it contains her best friend, JAN.  TWO YOUNG SOLDIERS sit up front, \none driving, both grinning.  Jan signals for Hana's attention.\n\n\t\t\tJAN\n\t\tThere's meant to be lace in the next\n\t\tvillage - the boys are taking me.\n\n\t\t\tHANA\n\t\tI'm not sewing anything else.\n\n\t\t\tJAN\n\t\t\t\t(mischievously)\n\t\tYou don't have any money, do you?  \n\t\tJust in case there's silk.\n\n\t\t\tHANA\n\t\tNo!\n\n\t\t\tJAN\n\t\tHana, I know you do!\n\nHana leans under the tarpaulin, holding some DOLLARS.  The two hands - \nhers and Jan's - reach for each other as the vehicles bump along side \nby side.  They laugh at the effort.  Jan's GOLD BRACELET catches the \nsun and glints.\n\n\t\t\tHANA\n\t\tI'm not sewing anything else for you!\n\n\t\t\tJAN\n\t\t\t\t(getting the money)\n\t\tI love you.\n\nThe Jeep accelerates away.  Hana sighs to the patient.\n\nSuddenly AN EXPLOSION shatters the calm as the jeep runs over a MINE.  \nThe jeep is THROWN into the air.  The convoy halts and there's chaos as \nsoldiers run back pulling people out of the vehicles.  Hana runs the \nother way, towards the accident, until she is prevented from passing by \na soldier.\n\n\n9*.\tEXT.    ITALIAN HILL ROAD.    LATER.\n\n-- and there's still chaos as two SAPPERS arrive on motorcycles.  One \nof them, a SIKH, wears a turban.\n\nThe motorcycles arrive at the front of the convoy.  A nurse, MARY, is \nhelping a doctor, OLIVER, attend to the injured driver.  The other two \nbodies are covered with blankets.  There's blood everywhere.  The Sikh \nand his colleague pull out the paraphernalia of their bomb disposal \nequipment.\n\n\n10\tEXT.    ITALIAN HILL ROAD.    DAY.\n\nKIP, the Sikh Lieutenant, and HARDY, his sergeant, explore the road \nahead of the becalmed convoy, using saucer-like METAL DETECTORS and \nHEADSETS.  Kip is young, lithe, contained, utterly focused as they inch \nalong the debris-strewn road.  He stiffens as he registers metal.  With \na bayonet he carefully scrapes at the mud-caked surface.  Something \nGLEAMS.  Suddenly, A PAIR OF FEET walks across his vision as HANA \nHURRIES PAST, walking carelessly up the road.  It's so surreal that \nneither man registers at first, and then Kip is shouting.\n\n\t\t\tKIP\n\t\tHey!  Hey!  Stop!  Hey!\n\n\t\t\tHARDY\n\t\tDon't move!  Stand ABSOLUTELY STILL!\n\n Hana stops.  Hardy gingerly follows her footsteps.\n\n\t\t\tHARDY\n\t\t\t\t(as he approaches)\n\t\tGood, that's good, just stay still for me\n\t\tand then we're going to be fine.\n\nHe arrives at Hana.  Then grabs her.  He'd like to slap her face.\n\n\t\t\tHARDY\n\t\tWhat are you doing?!  What the bloody \n\t\thell do you think you're doing?\n\nBy way of an answer she looks at the ground ahead of her feet.  Jan's \nBRACELET lies in the mud.  Hardy bends down and collects the mangled \nbracelet, presses it into Hana's hands.\n\n\n11\tEXT.    VILLAGE.    DUSK.\n\nThe CONVOY is threading through A RUINED VILLAGE, passing the souvenirs \nof war.  An overturned vehicle now used as a game by some children, \ndejected refugees tramping along the side of the road.  From the end of \none of the buildings are hanging HALF A DOZEN CORPSES, strung upside \ndown with crude placards denouncing, in Italian, their collaboration \nwith the Nazis.\n\n\n12\tINT.    RED CROSS TRUCK.    CONTINUOUS.\n\nHana sees all this as she sits blankly inside the truck, the Patient \nswaying alongside her.  She puts out her hand to steady him.\n\n\n13*.\tEXT.    CONVOY SITE, ITALY.    DUSK.\n\nTHE CONVOY is making a PITSTOP.  The trucks are silhouetted in a line.  \nHana helps lift the Patient's stretcher onto the ground.  She bends to \nhim.\n\n\t\t\tHANA\n\t\tDo you need something?\n\nThe Patient nods.  Hana gets up to prepare MORPHINE INJECTION from a \nsmall kit.  Mary arrives.  Touches Hana gently, conscious of her grief \nfor Jan's death.\n\n\t\t\tMARY\n\t\tAre you okay?  Oh God, Hana, you were\n\t\tlike sisters.\n\n\t\t\tHANA\n\t\t\t\t(sighs angrily)\n\t\tWe keep moving him - in and out of the\n\t\ttruck.  Why?  He's dying.  What's the point?\n\n\t\t\tMARY\n\t\tWell, we can't hardly leave him.  Do\n\t\tyou mean leave him?  We can't.\n\nHana has settled down beside the Patient's stretcher.  She draws \nherself up against the night.  On the hill above, she can see the \noutline of A SMALL MONASTERY in the moonlight.  She's crying, her face \na frozen mask.\n\n\t\t\tHANA\n\t\tI must be a curse.  Anybody who loves me,\n\t\tanybody who gets close to me -\n\t\tor I must be cursed.  Which is it?\n\nThe Patient laces her fingers into his crabbed hand.\n\n\n14\tEXT.    THE MONASTERY.    DAY.\n\nHana is investigating the MONASTERY OF ST. ANNA, wandering through its \novergrown gardens, past a pond.  What sanctuary it seems to offer.\n\n\n15*.\tINT.    THE MONASTERY LIBRARY.    DAY.\n\nHana explores via a gaping hole in a LIBRARY where the walls have \ncollapsed from shelling.  The garden intrudes, ivy curls around the \nshelves.  Bloated books lie abandoned, and there's a PIANO tiled up on \none side.  Hana presses the keys through the filthy tarpaulin which \ncovers it.  Everywhere there are signs of a brief German occupation.\n\n\n15a*.\tINT.    MONASTERY CLOISTERS.    DAY.\n\nPast the Library is a CLOISTERS, drenched with silver light.\n\n\n15b*.\tINT.    THE MONASTERY STAIRS.    DAY.\n\nHana goes upstairs, negotiating a huge VOID in the stone treads two \nthirds of the way up.\n\n\n15c*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nShe comes across a small CHAPEL, with the remains of murals and an \naltar pressed into service by the Germans as a table.  Hana finds an \nold bed, and a mattress.\n\n\n16\tEXT.    THE MONASTERY GARDEN.    DAY.\n\nHana comes out, passes a DRY WATER TROUGH.  She hears a rustling on the \ngravel and turns to see A TORTOISE ambling towards the trough.  On cue \nthere's A GURGLING SOUND.  THE HANDLELESS PUMP IS SUDDENLY GUSHING, \nsplashing water everywhere.  The Tortoise, clearly arriving for this, \nenjoys a welcome shower.  Hana goes to the trough, dips her hands into \nthe water.  Looks around her, and makes a decision.\n\n\n17\tEXT.    CONVOY SITE.    ITALY.    DAY.\n\nThe Convoy is in the final stages of loading up.  Oliver passes the \nvehicles, deep in dispute with a determined Hana, who is carrying some \nsacks of rice.\n\n\t\t\tHANA\n\t\tThe war's over - you told me yourself.\n\t\tHow can it be desertion?\n\n\t\t\tOLIVER\n\t\tIt's not over everywhere.  I didn't mean\n\t\tliterally.\n\n\t\t\tHANA\n\t\tWhen he dies I'll catch up.\n\nOliver hovers as Hana adds the rice to a small cache of provisions, \nthen lays another blanket over the Patient.\n\n\t\t\tOLIVER\n\t\tIt's not safe here.  The whole country's\n\t\tcrawling with Bandits and Germans and God\n\t\tknows what.  It's madness.  I can't allow it.\n\t\tYou're not, this is natural - it's shock.  \n\t\tFor all of us.  Hana -\n\n\t\t\tHANA\n\t\tI need morphine.  A lot.  And a pistol.\n\n\t\t\tOLIVER\n\t\t\t\t(clutching at straws)\n\t\tAnd what if he really is a spy?\n\n\t\t\tHANA\n\t\t\t\t(impatiently)\n\t\tHe can't even move.\n\n\t\t\tOLIVER\n\t\tIf anything happened to you I'd never\n\t\tforgive myself.\n\nHana nods.  A tiny smile.  Oliver shrugs helplessly.\n\n\t\t\tOLIVER\n\t\tWe're heading for Leghorn.  Livorno the\n\t\tItalians call it.  We'll expect you.\n\n\n18*.\tINT.    THE MONASTERY.    DAY.\n\nTWO SOLDIERS are helping Mary and Hana carry the Patient into the \nmonastery.  Hana indicates the stairs.\n\n\t\t\tHANA\n\t\tUp there.\n\nThey struggle up the stairs, one of the Soldiers gasping as he narrowly \navoids falling into the void in the stairs.  The cot almost tips up, at \nwhich the Patient SUDDENLY SPEAKS, his voice cracked and rasping, but \nstill clearly aristocratic.\n\n\t\t\tTHE PATIENT\n\t\tThere was a Prince, who was dying, and\n\t\the was carried up the tower at Pisa so he\n\t\tcould die with a view of the Tuscan Hills.\n\t\tAm I that Prince?\n\nHana laughs.\n\n\t\t\tHANA\n\t\tBecause you're leaning?  No, you're \n\t\tjust on an angle.  You're too heavy!\n\nMary laughs.  They reach the landing.  Hana kicks open the door to the \nCHAPEL.\n\n\t\t\tHANA\n\t\tIn here.\n\n\n18a*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana lets Mary take the weight while she goes to the bed and pulls away \nthe drapes, sending up a cloud of dust.  They lower the Patient onto \nthe bed.  She turns to the SOLDIERS.\n\n\t\t\tHANA\n\t\tThank you.\n\nShe shuts the door on them, leaving Mary staring aghast at the room, \nits faded frescoes, its mold, its chaos.  Hana smiles, opens a shutter \nto let a fierce envelope of light into the room.\n\n\t\t\tHANA\n\t\tGood.\n\n\tShe goes to Mary and hugs her.\n\n\n19*.\tINT.    HANA'S ROOM.    THE MONASTERY.    DAY.\n\nA smaller upstairs room completely bare.  As Hana tugs off her uniform, \nshe looks out of the window to see the departing Convoy.  A cotton \ndress goes on over her head and she emerges looking suddenly younger \nand rather fragile.   THROUGH THE DAMAGED FLOOR OF HER ROOM SHE HAS A \nVIEW OF THE PATIENT BELOW HER.  SHE LOOKS AT HIM.  NOW SHE HAS SCISSORS \nAND STARTS TO CUT OFF HER HAIR, NOT AGGRESSIVELY, BUT IN A GESTURE OF A \nNEW BEGINNING.\n\n\n19a*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHANA walks down to the Patient's Room and stands in the doorway.  The \nPatient turns his head to her.  He's grinning.  He puts up a thumb.  On \nthe track a song begins:  Some Other Time.\n\n\n20*.\tEXT.  BASECAMP AT POTTERY HILL.  1938.  LATE DAY.\n\nTHE SONG CONTINUED IN THE DESERT where we find the singer - PETER \nMADOX, a weather-beaten man who is working on the guts of an BATTERED \nTIGER MOTH AEROPLANE.  His face is blackened with oil.  A second \nEuropean, ALMÁSY, stands beside him, holding tools and a section of the \ncamshaft.  Madox yanks out a perished rubber hose and holds it up for \nAlmasy to inspect.  Behind them is an ENCAMPMENT - some camels foraging \nin the meager scrub, half a dozen black tents of the BEDOUIN: guides \nand servants to the Almásy/Madox Expedition.  It's 1938 and the whole \ncontinent is full of such expeditions, competing with each other, \npursuing lost treasures, sources of rivers, hidden cities.\n\nD'AGOSTINO, the team's Italian ARCHEOLOGIST, drives towards the plane \nin one of the expedition's adapted FORD MOTORCARS.  He gets out \ncarrying a large earthenware WATER JAR.  He looks very pleased with \nhimself as he shows the jar to Almásy and then passes it to Madox.\n\n\t\t\tD'AGOSTINO\n\t\tThirsty?\n\n\t\t\tMADOX\n\t\t\t\t(sniffing inside)\n\t\tWhat's this?\n\n\t\t\tD'AGOSTINO\n\t\tDon't drink it!\n\nHe reaches for the jug, then pours out a little sludge - it's a \nbrackish and stinks.  Madox makes a face.\n\n\t\t\tD'AGOSTINO\n\t\tI can't guarantee the vintage, my \n\t\tfriends.  I just dug it out of the hill.\n\nMadox and Almásy have seen many such jugs.\n\n\t\t\tMADOX\n\t\tExcellent.  That's terrific, D'Ag.\n\t\t\t\t(to Almásy, of a tool)\n\t\tToss that up, would you.\n\n\t\t\tD'AGOSTINO\n\t\t\t\t(mischievously)\n\t\tThere are some others.\n\n\n21\tEXT.    POTTERY HILL.    DAY.\n\nTHE BASE OF A HILL SEEMS COMPOSED ENTIRELY OF POTTERY JARS.\n\nD'Agostino emerges over the brow of a dune, leading Madox and Almásy.  \nThe other members of the team are already there - BERMANN, a German \nPHOTOGRAPHER and FOUAD, EGYPTOLOGIST from Cairo.\n\n\t\t\tMADOX\n\t\t\t\t(to Almásy, astonished)\n\t\tMy God, look at this!\n\nThey bend to touch the jars, literally hundreds of them, mostly broken, \npiled on top of each other.  Bermann approaches them, carrying his \ntripod.\n\n\t\t\tBERMANN\n\t\tIncredible, Hmm?  Quite incredible.\n\n\t\t\tD'AGOSTINO\n\t\tI've never seen anything like it.  There \n\t\twould have been enough water here to\n\t\tserve an army.\n\n\t\t\tALMÁSY\n\t\t\t\t(gloomily)\n\t\tWhich means we're in the wrong place.\n\nAlmásy speaks with a slight but unmistakable European accent.\n\n\t\t\tD'AGOSTINO\n\t\tWhy?\n\n\t\t\tALMÁSY\n\t\tWould you stockpile water near to an\n\t\tOasis?  There can't be a natural spring\n\t\twithin fifty miles of here.\n\n\t\t\tFOUAD\n\t\tOr they didn't know of one.\n\n\t\t\tBERMANN\n\t\tSo, it may not be Zerzura, still\n\t\tincredible.\n\n\t\t\tD'AGOSTINO\n\t\t\t\t(nodding, delighted)\n\t\tA pottery hill!\n\n\t\t\tALMÁSY\n\t\tA wild goose chase.\n\n\t\t\tMADOX\n\t\t\t\t(firmly)\n\t\tNo.\n\nAlmásy gives him a look.  But Madox will have none of it.\n\n\t\t\tMADOX\n\t\tNo.  Now we look in the other places.\n\t\tWe're eliminating.\n\nThe unmistakable buzz of AN AEROPLANE distracts them.\n\n\t\t\tMADOX\n\t\tGood, and here comes reinforcements.\n\n\n21a*.\tEXT.    BASE CAMP AT POTTERY HILL.    DAY.\n\nLATER and a smart new aeroplane, a STEERMAN, makes a smooth landing on \nthe flat desert.  The expedition team drives over to meet the arrivals.  \nAlmásy is not with them.  He's walking, apparently not so enthusiastic.\n\nA young, kissed and newly-married couple emerge from the plane.  They \nare GEOFFREY AND KATHARINE CLIFTON.\n\nAnd it's immediately clear that Katharine is the woman in the plane-\ncrash at the beginning of the film.\n\nMadox makes all the introductions.  Hands are shaken, hellos all round, \nas the couple disembark in their leather flying gear.  Geoffrey removes \nhis helmet and, in what we will come to know as an ubiquitous gesture, \nproduces a bottle of CHAMPAGNE and sets off the cork with a flourish.\n\n\t\t\tCLIFTON\n\t\tI hereby Christen us the International\n\t\tSand Club!\n\n\n22\tEXT.    BASECAMP AT POTTERY HILL.    LATE DAY.\n\nThe party is in the shade of the tents.  Almásy joins the group.  Madox \nnods over to the Clifton plane.\n\n\t\t\tMADOX\n\t\tMarvelous plane.  Did you look?\n\n\t\t\tCLIFTON\n\t\t\t\t(beaming at Almásy)\n\t\tIsn't it?  Wedding present from\n\t\tKatharine's parents.  I'm calling it\n\t\tRupert Bear.  Hello.  Geoffrey Clifton.\n\n\t\t\tMADOX\n\t\tWe can finally consign my old bird\n\t\tto the scrapheap.\n\n\tAlmásy smiles and walks on towards the others.\n\n\t\t\tD'AGOSTINO\n\t\tMrs. Clifton - Count Almasy.\n\n\t\t\tKATHARINE\n\t\t\t\t(smiling, offering her hand)\n\t\tGeoffrey gave me your monograph when\n\t\tI was reading up on the desert.\n\t\tVery impressive.\n\n\t\t\tALMÁSY\n\t\t\t\t(stiff)\n\t\tThank you.\n\n\t\t\tKATHARINE\n\t\tI wanted to meet a man who could write\n\t\tsuch a long paper with so few adjectives.\n\n\t\t\tALMÁSY\n\t\tA thing is still a thing no matter what\n\t\tyou place in front of it.  Big car, slow\n\t\tcar, chauffeur-driven car, still a car.\n\n\t\t\tCLIFTON\n\t\t\t\t(joining them and joining in)\n\t\tA broken car?\n\n\t\t\tALMÁSY\n\t\tStill a car.\n\n\t\t\tCLIFFTON\n\t\t\t\t(hands them champagne)\n\t\tNot much use, though.\n\n\t\t\tKATHARINE\n\t\tLove?  Romantic love, platonic love,\n\t\tfilial love - ?  Quite different things,\n\t\tsurely?\n\n\t\t\tCLIFTON \n\t\t\t\t(hugging Katharine)\n\t\tUxoriousness - that's my favorite kind\n\t\tof love.  Excessive love of one's wife.\n\n\t\t\tALMÁSY\n\t\t\t\t(a dry smile)\n\t\tThere you have me.\n\n\n23\tINT.  THE PATIENT'S ROOM.  THE MONASTERY.  MORNING.\n\nThe morning floods into the room.  The Patient lies, lost in the \ndesert.  Then a sudden CLATTERING NOISE disturbs him.\n\n\n24\tINT.   STAIRS, THE MONASTERY.   DAY.\n\nHana is dropping armfuls of books into the cavities of the damaged \nstairs, and with others, she is improvising new steps.  The heavy \nvolumes are perfect for treading on.\n\n\n25\tINT.   LIBRARY.   DAY.\n\nHana comes in, gathers up another armful of books and carries them out \nto continue her stair repairs.\n\n\n26*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana enters.\n\n\t\t\tTHE PATIENT\n\t\tWhat was all the banging?  Were you\n\t\tfighting rats or the entire German army?\n\n\t\t\tHANA\n\t\tI was repairing the stairs.  I found a\n\t\tlibrary and the books were very useful.\n\nHana shrugs.  She's attending to him, pulling back the sheets, plumping \nup the pillows.  He's short of breath.\n\n\t\t\tTHE PATIENT\n\t\tBefore you find too many uses for these\n\t\tbooks would you read some to me?\n\n\t\t\tHANA\n\t\tI think they're all in Italian, but I'll\n\t\tlook, yes.  What about your own book?\n\n\t\t\tTHE PATIENT\n\t\t\t\t(reluctant)\n\t\tMy book?  The Herodotus?  Yes, we\n\t\tcan read him.\n\nHana picks up the book and hands it to him.  Then she starts rummaging \nin her pockets.\n\n\t\t\tHANA\n\t\tOh - I've found plums.  We have plums\n\t\tin the orchard.  We have an orchard!\n\nShe has peeled a plum and now slips it into his mouth.\n\n\t\t\tTHE PATIENT\n\t\tThank you.\n\nHis mouth works with the pleasure of the taste, a little juice escaping \nfrom the mouth.  Hana mops it up.\n\n\t\t\tTHE PATIENT\n\t\tThe plumness of this plum.\n\nA noise, GURGLING sound, disturbs them.\n\n\t\t\tTHE PATIENT\n\t\tWhat's that?\n\n\n27\tINT/EXT.    THE MONASTERY.    DAY.\n\nHana comes through the Cloisters into the garden as the gurgling \nincreases.  She's in time to catch the TORTOISE arriving once again in \nthe WATER TROUGH just as it starts to gush with water.  She shouts up \nto The Patient's open window.\n\n\t\t\tHANA\n\t\tWater!\n\t\t\t\t(bends to the Tortois)\n\t\tYou hear it, too, don't you!\n\n\n28\tINT.    THE PATIENT'S ROOM.    DAY.\n\nClose on the HERODOTUS.  The Patient opens its cover, held together by \nleather ties.  Loose PAPERS, PHOTOGRAPHS, HAND-DRAWN MAPS AND SKETCHES \nare all collected between the pages.  He claws at some water-colors \nwhich appear to be based on CAVE PAINTINGS - figures, dark-skinned \nwarriors of the stone age, some with bows in their hands, others with \nplumes in their hair - arranged in abstract patterns uncannily like \nthose of Matisse.  Some appear to be swimming, another is diving.  Then \nthe Patient loses control of the papers and the whole parcel SPILLS to \nthe floor with a crack.\n\n\n29\tINT.    BASECAMP AT POTTERY HILL.    DUSK.\n\nA SHOT RINGS OUT, disturbing the evening meal.  Almásy and others go \noutside.  Silhouetted on a ridge, a group of men sit astride camels.  \nOne of them holds his rifle aloft, clearly pointing towards the sky - \nmeans friend.  Fouad peers at the horizon.\n\n\t\t\tFOUAD\n\t\tEuropean, I think, with guides.\n\n\t\t\tCLIFTON\n\t\t\t\t(can only see shapes)\n\t\tHow do you know?\n\n\t\t\tMADOX\n\t\t\t\t(frowns)\n\t\tYes, and I think I know who this is.\n\n\n30\tEXT.    BASECAMP AT POTTERY HILL.    DUSK.\n\nALMÁSY AND MADOX WALK OUT TO INTERCEPT THE ARRIVALS as the first Arab \ndismounts, the procession of camels splaying out as if in collapse.  \nAlmásy speaks in Arabic, exchanging the ritual greetings.\n\nDURING THIS, FENELON-BARNES, sole European in this expedition, has \nfinally persuaded his camel to sit, and dismounts irritably, slapping \nthe animal in disgust.\n\n\t\t\tFENELON-BARNES\n\t\tUgly brute.  Shits and roars and\n\t\tcomplains all day.\n\t\t\t\t(bypassing Almásy and\napproaching Madox)\n\t\tOf course, you have your aeroplane.  \n\t\tTwo now!  Do you still call yourselves\n\t\texplorers?  I assume not.\n\n\t\t\tMADOX\n\t\t\t\t(stiffly)\n\t\tFenelon-Barnes.\n\n\t\t\tALMÁSY\n\t\tYes, I think a sailor can call himself an\n\t\texplorer, can't he?  Or should Columbus\n\t\thave swum to America?\n\n\n31\tINT.    BASECAMP AT POTTERY HILL.    DUSK.\n\nThe arrivals come inside.  Madox handles the introductions.\n\n\t\t\tMADOX\n\t\tI think you know all of us, except for\n\t\tGeoffrey and Katharine Clifton, who've\n\t\trecently come out from England.\n\n\t\t\tCLIFTON\n\t\tApprentices.\n\n\t\t\tMADOX\n\t\tThis is Clive Fenelon-Barnes.\n\n\t\t\tFENELON-BARNES\n\t\t\t\t(to Katharine)\n\t\tI know your mother, of course.\n\n\t\t\tKATHARINE\n\t\tHello.\n\n\t\t\tFENELON-BARNES\n\t\tI'm also searching for the lost Oasis, \n\t\tbut by more authentic means.\n\n\t\t\tMADOX\n\t\t\t\t(of Almásy)\n\t\tAnyway, my friend here has a new theory -\n\t\tthat Zerzura doesn't exist.  So we may all\n\t\tbe chasing windmills.  Have some food.\n\n\t\t\tFENELON-BARNES\n\t\tWell, it's certainly not between here and\n\t\tDakhla.  Nine days of nothing but sand\n\t\tand sandstorms.  An egg.  I found an\n\t\tostrich egg and some fossils.\n\n\t\t\tKATHARINE\n\t\tIsn't Zerzura supposed to be protected by\n\t\tspirits who take on the shape of sandstorms?\n\n\t\t\tALMÁSY\n\t\tWhat kind of fossils?\n\n\t\t\tFENELON-BARNES\n\t\tI'll invite you to my paper at the\n\t\tRoyal Geographical Society.\n\t\tAre you still a member?\n\nHe takes a long drink from a bowl of frothing camel milk.\n\n\t\t\tALMÁSY\n\t\tI think you know I am.\n\n\t\t\tFENELON-BARNES\n\t\t\t\t(ignoring Almásy)\n\t\tQuite impossible, Madox.  You must know \n\t\tthat.  If you attempt to cross the Sand\n\t\tSea due east of Kufra by car you'll leave\n\t\tyour bones in the sand for me to collect.\n\n\t\t\tALMÁSY\n\t\t\t\t(leaving the tent)\n\t\tIf you come across my bones - I hope\n\t\tyou'll do me the honor of leaving \n\t\tthem in peace.\n\t\t\t\t(to Katharine)\n\t\tExcuse me.\n\n\t\t\tFENELON-BARNES\n\t\tYou have my word as a gentleman.\n\t\t\t\t(watching him leave)\n\t\tI've discovered a unique type of\n\t\tsand-dune.  I've applied to the King\n\t\tfor permission to call it \n\t\tThe Fenelon-Barnes Formation.\n\n\n32\tEXT.    BASECAMP AT POTTERY HILL.    NIGHT.\n\n\tLATER, supper over, the company is entertaining itself.\n\nAlmásy, standing outside his tent, watches the merriment from a \ndistance.\n\nD'Ag is nearing the end of a passionate rendition of  Puccini's E \nLucevan Le Stelle.  He sits down to much applause from the others and \nSPINS AN EMPTY CHAMPAGNE BOTTLE on the sand.  It comes to rest pointing \nat Clifton who gets up, grinning, and plunges into Yes! We Have No \nBananas with great gusto.  His version involves CHANGING LANGUAGE \nduring each line of the chorus - prompted by Oui!  or Ja!  or Si!  from \nthe others.  Song finished, much bowing and guying, he spins the bottle \nand it arrives equidistant between Fenelon-Barnes and Katharine - until \nwith a little NUDGE from the husband it settles on his wife.  Katharine \ngets up, awkward.\n\n\t\t\tKATHARINE\n\t\tI can't sing.\n\t\t\t\t(the audience groans)\n\t\tbut I can tell a story.\n\t\t\t\t(to Almásy, who has arrived)\n\t\tI might need a prompt.  Do you have your\n\t\tHerodotus?  I've noticed you carry it...\n\n\t\t\tALMÁSY\n\t\tI'm sorry - what have you noticed?\n\n\t\t\tMADOX\n\t\tYour book.  Your Herodotus!\n\nAlmásy looks uncomfortable.\n\n\t\t\tKATHARINE\n\t\t\t\t(reacting quickly)\n\t\tIt doesn't matter.  Really.  I think I can\n\t\tmuddle through.  Okay - The Story of \n\t\tCandaules and Gyges.  King Candaules was\n\t\tpassionately in love with his wife -\n\t\t\t\t(Geoffrey whistles proudly)\n\t\tOne day he said to Gyges, the son of\n\t\tsomebody, anyway - his favorite warrior -\n\n\t\t\tALMÁSY\n\t\t\t\t(quietly prompting her)\n\t\tDaskylus...\n\n\t\t\tKATHARINE\n\t\t\t\t(smiles)\n\t\tYes, thank you, Gyges, son of Daskylus -\n\t\tCandaules said to him I don't think you\n\t\tbelieve me when I tell you how beautiful\n\t\tmy wife is.  And although Gyges replied he\n\t\tdid find the Queen magnificent the King \n\t\tinsisted he would find some way to prove\n\t\tbeyond dispute that she was fairest of\n\t\tall women.  Do you all know this story?\n\nThe men all encourage her to continue her story.\n\n\n33*.\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\n- and Hana's voice CONTINUES THE STORY as she reads to the Patient who \nlistens, eyes closed, still in the desert.\n\n\t\t\tHANA\n\t\t\t\t(reading from the Herodotus)\n\t\tI will hide you in the room where \n\t\twe sleep, said Candaules.\n\nShe stumbles over the word.\n\n\t\t\tTHE PATIENT\n\t\tCandaules\n\n\t\t\tHANA\n\t\t\t\t(not neurotic)\n\t\tCandaules...you're laughing at me.\n\n\t\t\tTHE PATIENT\n\t\tI'm not laughing at you.  Go on, please.\n\n\t\t\tHANA\n\t\tWhen my wife comes to lie down she always\n\t\tlays her garments one by one on a seat\n\t\tnear the entrance of the room, and from\n\t\twhere you stand you will be able to gaze\n\t\ton her at your leisure...\n\n\n34*.\tEXT.    BASECAMP AT POTTERY HILL.    NIGHT.\n\n\t\t\tKATHARINE\n\t\t\t\t(her story continuing)\n\t\tAnd that evening, it's exactly as the\n\t\tKing had told him, she goes to the chair\n\t\tand removes her clothes, one by one, \n\t\tuntil she stand naked in full view of\n\t\tGyges.  And indeed she was more lovely\n\t\tthan he could have imagined.\n\nAlmásy stares at her, framed by the velvet black sky.  Katharine turns \nto looks at him.\n\n\t\t\tKATHARINE\n\t\tBut then the Queen looked up and saw\n\t\tGyges concealed in the shadows.   And\n\t\tthough she said nothing, she shuddered.\n\t\tThe next day she sent for Gyges and\n\t\tchallenged him.  And hearing his story,\n\t\tshe said this -\n\n\t\t\tCLIFTON\n\t\tOff with his head!\n\n\t\t\tKATHERINE\n\t\t#NAME?\n\t\tdeath for gazing on that which you\n\t\tshould not, or else kill my husband who\n\t\tshamed me and become King in his place.\n\nClifton makes a face of outrage.  For Katherine the story has \ncollapsed.  She wants it to be finished.\n\n\t\t\tKATHERINE\n\t\tSo Gyges killed the King and married\n\t\tthe Queen and became ruler of Lydia\n\t\tfor twenty eight years.  The End.\n\t\t\t\t(an uncomfortable moment)\n\t\tDo I spin the bottle?\n\nAlmásy shrinks away from the fire, disappears into black.\n\n\t\t\tMADOX\n\t\t\t\t(to Clifton)\n\t\tAnd let that be a lesson to you!\n\n\n35\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nHana looks up from the Herodotus, sees the Patient's eyes closed.  \nGently touches his face and whispers.\n\n\t\t\tHANA\n\t\tAre you asleep?\n\n\t\t\tTHE PATIENT\n\t\t\t\t(lying)\n\t\tYes.  Dropping off.\n\nAnd Hana closes the book, gets up, and blows out the lamp.  \n\n\n36\tINT.   FENELON-BARNES TENT.   POTTERY HILL.   NIGHT.\n\nPITCH BLACK and then A TORCH flickers on as Almásy enters Fenelon-\nBarnes' tent.  He pulls apart his luggage, quickly and methodically.  \nHe finds what he is looking for inside a trunk:  A LARGE FOSSILIZED \nBRANCH; a collection of stone leaves, wrapped in a piece of tarpaulin.  \nThen he's distracted by a noise from Fenelon-Barnes' bed.  Almásy \nstiffens, turns to investigate.  There's A LUMP in the cot.  A dog?  \nAlmásy eases back the blanket to reveal a YOUNG GIRL, no more than \nfourteen, bound hand and foot.  He holds the torch to her face.\n\n\n37\tEXT.    BASECAMP AT POTTERY HILL.    MORNING.\n\nThe next morning.  Almásy and Madox prepare to take off.  As they talk \nClifton's Rupert Bear taxis past them, a wave from Clifton and \nKatharine.  Madox is very disturbed by what Almásy is telling him.\n\n\t\t\tMADOX\n\t\tWhat did you think you were\n\t\tdoing in his tent?\n\n\t\t\tALMÁSY\n\t\tLooking for the fossils.  Why should we\n\t\twait until we're in London?  This girl \n\t\twas probably twelve years old.\n\n\t\t\tMADOX\n\t\t\t\t(getting into the plane)\n\t\tYou shouldn't go into another man's tent.\n\t\tIt's inexcusable.\n\n\t\t\tALMÁSY\n\t\tHer hands and feet were tied.\n\n\t\t\tMADOX\n\t\tWhat did you do?\n\n\t\t\tALMÁSY\n\t\tI looked at them.  They're shrubs,\n\t\tsmall trees.  Exquisite.  And\n\t\tfossilized, rock hard.\n\nHe walks away to the nose of the plane.\n\n\t\t\tMADOX\n\t\tI was talking about the girl.\n\n\t\t\tALMÁSY\n\t\tCut the ropes.  I left a note,\n\t\ton his blanket.\n\t\t\t\t(gleefully)\n\t\tAt the next Geographical Society I \n\t\tshall await with great interest the\n\t\tannouncement of the Fenelon-Barnes\n\t\tSlave Knot.  The Girl wouldn't leave, \n\t\tof course.  Her father had sold her\n\t\tfor a camel.\n\nHe turns over the propeller, the engine cranks up.\n\n\n38\tEXT.    GILF KEBIR PLATEAU.    MORNING.\n\nBoth planes are scouting the Gilf Kebir region.  Geoffrey flies up \nalongside Madox and wiggles his wings.  Madox waves.\n\nThey're flying over a distinctive group of GRANITE MASSIFS, Crater-\nshaped hills.  The broken towers of the Gilf Kebir.  Almasy is \ndistracted by them.  He turns to Madox and points down, indicating they \nshould explore them.\n\nMadox gestures to the Cliftons to PHOTOGRAPH the Massifs.  A THUMBS UP \nfrom Geoffrey.\n\n\n39*.\tINT.    THE PATIENT'S ROOM.    MORNING.\n\nHana gives the Patient his injection, now she begins to change the \nsheet.  The light streams in from the open window.  She looks up at the \ngreen hills rolling away from the Monastery, the village in the \ndistance.\n\n\t\t\tHANA\n\t\tI should try and move your bed.  I want\n\t\tyou to be able to see the view.  It's\n\t\tgood, it's a view from a monastery.\n\n\t\t\tTHE PATIENT\n\t\tI can already see.\n\n\t\t\tHANA\n\t\t\t\t(bending down to his level)\n\t\tHow?  How can you see anything?\n\n\t\t\tTHE PATIENT\n\t\tNot the window - I can't bear the light\n\t\tanyway - no, I can see all the way to \n\t\tthe desert.  I've found the lost fossils.\n\n\t\t\tHANA\n\t\tI'm turning you.\n\nAn awkward moment as she rolls him on to his back.  He grunts with the \npain.  She washes him very tenderly.\n\n\t\t\tTHE PATIENT\n\t\tZerzura, the White City of Acacias, the\n\t\tOasis of Little Birds.  As me about the\n\t\tscent of acacia - it's in this room.  I can\n\t\tsmell it.  The taste of tea so black it\n\t\tfalls into your mouth.  I can taste it.\n\t\tI'm chewing the mint.  Is there sand in my\n\t\teyes?  Are you cleaning sand from my ears?\n\n\t\t\tHANA\n\t\tNo sand.  That's your drugs speaking.\n\n\t\t\tTHE PATIENT\n\t\tI can see my wife in that view.\n\n\t\t\tHANA\n\t\tAre you remembering more?\n\n\t\t\tTHE PATIENT\n\t\tCould I have a cigarette?\n\n\t\t\tHANA\n\t\tAre you crazy?\n\n\t\t\tTHE PATIENT\n\t\tWhy are you so determined to\n\t\tkeep me alive?\n\n\t\t\tHANA\n\t\tBecause I'm a nurse.\n\n\n40\tEXT.    THE MONASTERY GARDENS.    NOON.\n\nThe TORTOISE heads towards the trough, to the gurgling accompaniment.  \nIt reaches the shade only to be greeted by the obstacle of some tennis \nshoes, a frock.  It clambers over as the water begins to belch out.  \nHana, naked, kneeling in the trough, receives the shower with a great \nYELP of shivering joy.\n\n\n41*.\tEXT.    THE MONASTERY CLOISTERS.    NIGHT.\n\nIt's dark, but something is going on here.  Hana is caught by the stray \nshafts of moonlight.  She is SCRATCHING something on the flagstones.  \nHer skirt is bunched up around her thighs.  She throws something in the \nair.  It's a SPILE, used to tap into the maple tree for syrup.  It \nlands with a crack.  Suddenly she is flying across the space, a hop, a \nskip, a jump.  Then turns at the other end, dips for the stone, then \nback again, in this blindman's version of HOPSCOTCH.\n\n\n42*.\tINT.    TRAIN.    ITALY 1944.    BEFORE DAWN.\n\nAS HANA HOPS AND JUMPS IN THE SHADOWS SHE IS SUDDENLY ON A TRAIN IN \n1944.  A HOSPITAL TRAIN ploughs through the night carrying the wounded \nback to Naples.\n\nHana walks through a long carriage.  HER HAIR IS LONG.  She could be \nten years younger than the Hana at the Monastery.  And easy.  She stops \nat the bunk of A NEW PATIENT.  Hana bends to the boy.  He's had \nshrapnel in his legs and cheek.  She speaks softly to him.\n\n\t\t\tHANA\n\t\tHow are you?\n\n\t\t\tBOY\n\t\tOkay.\n\n\t\t\tHANA\n\t\tYour leg will be fine.  A lot of shrapnel\n\t\tcame out - I saved you the pieces.\n\n\t\t\tBOY\n\t\tYou're the prettiest girl I ever saw.\n\n\t\t\tHANNA\n\t\t\t\t(she hears this every day)\n\t\tI don't think so.\n\n\t\t\tBOY\n\t\tWould you kiss me?\n\n\t\t\tHANA\n\t\tNo, I'll get you some tea. Wait till\n\t\tyou're in Naples.  You'll find a\n\t\tgirl there.\n\n\t\t\tBOY\n\t\t\t\t(innocent)\n\t\tJust kiss me.  It would mean\n\t\tsuch a lot to me.\n\n\t\t\tHANA\n\t\t\t\t(tender, believing him)\n\t\tWould it?\n\nShe kisses him, very softly, on the lips.\n\n\t\t\tBOY\n\t\tThank you.\n\nHe closes his eyes.  Is almost instantly asleep.  Hana smiles, \ncontinues along the compartment.  VOICES CALL OUT.\n\n\t\t\t#1 INJURED MAN\n\t\tNurse - I can't sleep.\n\n\t\t\t#2 INJURED MAN\n\t\tNurse?  Would you kiss me?\n\n\t\t\t#3 INJURED MAN\n\t\tYou're so pretty!\n\n\t\t\t#4 INJURED MAN\n\t\tHinky-dinky parlez-vous!\n\n\t\t\tHANA\n\t\t\t\t(good-naturedly waving\naway their joke)\n\t\tVery funny.  Go to sleep.\n\nShe gets into a corridor.  Mary is coming the other way.  She carries a \nblood-soaked bundle.  Hana questions her appalled expression.\n\n\t\t\tMARY\n\t\tDon't ask.\n\n\n43\tINT.    RAILWAY STATION.    DAY.\n\nThe train is arriving.  Hana hangs out of a window, scouring the crowds \nto find her sweetheart, STUART McGANN, a young Canadian Captain, who \nseeing her runs up to her window.\n\n\t\t\tHANA\n\t\tWhere are we going?  I don't want to be\n\t\tkissing in a crowd.  I have six hours.\n\nShe jumps out of the moving door and into his arms.\n\n\t\t\tSTUART\n\t\t\t\t(laughing at her ferocity)\n\t\tWhoa - give me a chance!\n\n\t\t\tHANA\n\t\tSorry.  I took a Benzedrine.\n\nThe Station is full of desperate people trying to make do.  the couple \nhurry through, oblivious to anyone except each other.\n\n\t\t\tSTUART\n\t\tI've got a surprise.  A boat!  We can go\n\t\tto Capri.  It's got a cabin, it's private.\n\n\t\t\tHANA\n\t\tI'd like to spend a night with you\n\t\tin a bed.\n\n\t\t\tSTUART\n\t\tWe can do that when we're very very old.\n\n\n44\tINT.    THE MONASTERY.    HANA'S ROOM.    NIGHT.\n\nHana lies alone in her bed covered by a curtain.  There's a sharp \nNOISE.  She's very frightened.  She has her pistol under her pillow and \npulls it out, listens, holding her breath.  Another BANG.  She listens.\n\n\n45\tEXT.    THE MONASTERY.    HANA'S GARDEN.    DAY.\n\nHana has been reviving a vegetable patch.  She comes to garden.  CROWS \nare feasting.  She's furious, shouts, runs at them.  Nature, wildness, \ninsisting on invading her peace.\n\n\n46*.\tEXT.    THE MONASTERY.    GRAVEYARD.    MORNING.\n\nHana appears from the Cemetery, dragging A METAL CRUCIFIX.  It's bigger \nthan she is, and she drags it, as if approaching Calvary.  A MAN \nWATCHER HER FROM A BICYCLE.  He's approaching fifty, grizzled and \nattractive, and could be Italian.  His hands are bandaged.  Hana aims \nthe cross at the soil, but is not quite bit or strong enough.  The man, \nCARAVAGGIO, chooses this moment to introduce himself.  He drops the \nbicycle on the ground with a clatter.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(very cheerful)\n\t\tBuon' Giorno!\n\nHana turns, startled and suspicious.\n\n\t\t\tCARAVAGGIO\n\t\tAre you Hana?\n\n\t\t\tHANA\n\t\tWhat do you want?\n\n\t\t\tCARAVAGGIO\n\t\tI met your friend Mary.  She said I\n\t\tshould stop and see if you were okay.\n\t\tApparently we're neighbors - my house\n\t\tis two blocks from yours in Montreal.\n\t\tCabot, north of Laurier.  Bonjour.\n\n\t\t\tHANA\n\t\t\t\t(unraveling this information)\n\t\tBonjour.\n\nHe goes to her and - putting a bandaged hand behind her ear - PRODUCES \nAN EGG.  He beams, as does Hana.\n\n\t\t\tCARAVAGGIO\n\t\tI'd like to take credit, but it's from\n\t\tMary.  My name's David Caravaggio,\n\t\tbut nobody ever called me David.\n\t\tCaravaggio they find to absurd to\n\t\tmiss out on.\n\nDuring this he attempts the same thing with his other hand to Hana's \nother ear.  THE EGG DROPS TO THE GROUND.  Cursing, he gets on his knees \nand starts to scoop it up, preserving it.\n\n\n47*.\tINT.    THE MONASTERY.    KITCHEN.    DAY.\n\nHana has taken his eggs and put them into a bowl.  She beats them with \na knife picking out the bits of shell.  Caravaggio watches, takes in \nhow little food there is otherwise.  The table seems useful more as a \nsewing area than for cooking - it's STREWN WITH ALTAR CLOTHS being sewn \ninto drapes.  On a tray on the table are TWO PHIALS OF MORPHINE from \nthe Patient's room.  As Hana turns to the stove, he's moved and covered \nthem with his bandaged hands, a second later and he's juggled them into \nhis pockets with the slightest clink.  Hana looks at him.  He shrugs, \nnods at the eggs.\n\n\t\t\tCARAVAGGIO\n\t\tThey're fresh.  I haven't eaten an egg\n\t\tin...have you noticed there are chickens?\n\t\tYou get chickens in Italy but no eggs.\n\t\tIn Africa there were always eggs, but\n\t\tnever chickens.  Who separates them?\n\n\t\t\tHANA\n\t\tYou were in Africa?\n\n\t\t\tCARAVAGGIO\n\t\tYeah, for a while.\n\n\t\t\tHANA\n\t\tSo was my Patient.\n\n\t\t\tCARAVAGGIO\n\t\tI'd like to stay.  That's the long and\n\t\tshort of it.  I mean, you know blah-blah\n\t\tif it's convenient, if there's room \n\t\tblah-blah-blah.  I have to do some \n\t\twork here -I speak the language.  \n\t\tThere are Partisans to be -\n\t\t\t\t(trying to paraphrase)\n\t\t#NAME?\n\t\trelieve them of their weapons, you \n\t\tknow - while we hug.  I was a thief, so \n\t\tthey think I'd be good at that.\n\n\t\t\tHANA\n\t\tSo you can shoot a pistol?\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(showing his hands)\n\t\tNo.\n\n\t\t\tHANA\n\t\tIf you said yes I would have had a\n\t\treason.  You should let me redress\n\t\tthose bandages.  Before you go.\n\n\t\t\tCARAVAGGIO\n\t\tI'm okay.  Look, it's a big house.  We\n\t\tneedn't disturb each other.  I can shoot\n\t\ta pistol!  I'll sleep in the stables.  I\n\t\tdon't care where I sleep.  I don't sleep.\n\n\t\t\tHANA\n\t\tBecause we're fine here.  I don't know\n\t\twhat Mary told you about me, but I\n\t\tdon't need company, I don't need\n\t\tto be looked at.\n\n\t\t\tCARAVAGGIO\n\t\tFine.  I'm not looking.\n\n\n48\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana carries in a tray.  There's OMELETTE on the plate.\n\n\t\t\tHANA\n\t\tThere's a man downstairs.  He\n\t\tbrought us eggs.\n\t\t\t\t(shows him the omelette)\n\t\tHe might stay.\n\n\t\t\tTHE PATIENT\n\t\tWhy?  Can he lay eggs?\n\n\t\t\tHANA\n\t\tHe's Canadian.\n\n\t\t\tTHE PATIENT\n\t\t\t\t(brittle)\n\t\tWhy are people always so happy when\n\t\tthey collide with someone from the same\n\t\tplace?  What happened in Montreal when\n\t\tyou passed a man in the street - did you\n\t\tinvite him to live with you?\n\n\t\t\tHANA\n\t\tHe needn't disturb you.\n\n\t\t\tTHE PATIENT\n\t\tMe?  He can't.  I'm already disturbed.\n\n\t\t\tHANA\n\t\tHe won't disturb us then.  I think\n\t\the's after morphine.\n\t\t\t\t(she's cut the omelette\ninto tiny pieces)\n\t\tThere's a war.  Where you come from\n\t\tbecomes important.  And besides - \n\t\twe're vulnerable here.  I keep hearing\n\t\tnoises in the night.  Voices.\n\nThe Patient says nothing.  She puts a spoonful of the omelette into his \nmouth.  He grunts.\n\n\n49\tINT.    THE MONASTERY.    STAIRS.    DAY.\n\n\tCaravaggio is in the shadows on the stairs.  HE LISTENS.\n\n\n50\tEXT.    CAIRO MARKET.    1938.    DAY.\n\nA STREET MARKET in full sway, a locals-only affair, blazing with noise \nand bustle and barter.  Emerging from a thicket of women and begging \nchildren, KATHARINE CLIFTON carries her purchase of an exotic-looking \nRUG.  From nowhere she is joined by Almásy.\n\n\t\t\tALMÁSY\n\t\tHow much did you pay?\n\n\t\t\tKATHARINE\n\t\t\t\t(delighted)\n\t\tHello!  Good morning.\n\n\t\t\tALMÁSY\n\t\tThey don't see foreign women in this\n\t\tmarket.  How much did you pay?\n\n\t\t\tKATHARINE\n\t\tSeven pounds, eight, I suppose.  Why?\n\n\t\t\tALMÁSY\n\t\tWhich stall?\n\n\t\t\tKATHARINE\n\t\tExcuse me?\n\n\t\t\tALMÁSY\n\t\tYou've been cheated, don't worry,\n\t\twe'll take it back.\n\n\t\t\tKATHARINE\n\t\t\t\t(bristling)\n\t\tI don't want to go back.\n\n\t\t\tALMÁSY\n\t\tThis is not worth eight pounds,\n\t\tMrs. Clifton.\n\n\t\t\tKATHARINE\n\t\tI don't care to bargain.\n\n\t\t\tALMÁSY\n\t\tThat insults them.\n\n\t\t\tKATHARINE\n\t\t\t\t(turning to face him)\n\t\tI don't believe that.  I think you are\n\t\tinsulted by me, somehow.  You're a\n\t\tforeigner too, aren't you, here,\n\t\tin this market?\n\n\t\t\tALMÁSY\n\t\t\t\t(of the carpet)\n\t\tI should be very happy to obtain\n\t\tthe correct price for this.  I apologize\n\t\tif I appear abrupt.  I am rusty at\n\t\tsocial graces.\n\t\t\t\t(tart)\n\t\tHow do you find Cairo?  Did you\n\t\tvisit the Pyramids?\n\n\t\t\tKATHARINE\n\t\tExcuse me.\n\nHe stands as she continues, pushing past him, shrugging off the \nchildren, boiling.\n\n\n51\tINT.    SHEPHEARD'S HOTEL.    CAIRO.    EVENING.\n\nTHE LONG BAR.  The Exploration Team are drinking at a table.  They are \nnot entirely off-duty - Almásy and Madox as ever ponder the maps.  \nGeoffrey Clifton appears, arms waving.\n\n\t\t\tCLIFTON\n\t\tGentlemen, good evening!\n\nHe sits down.   Madox hails the waiter.\n\n\t\t\tD'AGOSTINO\n\t\tHow is your charming wife?\n\n\t\t\tCLIFTON\n\t\tUh, marvelous.  She's in love with\n\t\tthe hotel plumbing.  She's either in\n\t\tthe swimming pool - she swims for\n\t\thours, she's a fish, quite incredible -\n\t\tor she's in the bath.  Actually,\n\t\tshe's just outside.\n\t\t\t\t(responding to their\nbewildered expressions)\n\t\tChaps Only in the Long Bar.\n\n\t\t\tMADOX\n\t\t\t\t(standing, embarrassed)\n\t\tOf course.  Well, we should all go\n\t\tout onto the terrace.\n\n\t\t\tCLIFTON\n\t\tOh no, really.  She has her book.\n\n\t\t\tMADOX\n\t\tI won't hear of it.  None of us will.\n\n\n52\tEXT.    SHEPHEARD'S HOTEL TERRACE.    NIGHT.\n\nKatharine appears with Geoffrey to join the arriving Explorers.  She \nlooks exquisite in her evening clothes.  Madox brings her to her seat.  \nThere is dancing inside, and couples walk to and from their tables.  \nKatharine manages to produce a dazzling smile which includes everyone \nexcept Almásy.\n\n\t\t\tMADOX\n\t\tMrs. Clifton, you'll have to forgive\n\t\tus.  We're not accustomed to the\n\t\tcompany of women.\n\n\t\t\tKATHARINE\n\t\tNot at all.  I was thoroughly \n\t\tenjoying by book.\n\t\t\t\t(indicating they should all sit \nand then nodding at Almásy\nbefore greeting the others)\n\t\tPlease.  Signor D'Agostino, Herr Bermann.\n\n\t\t\tCLIFTON\n\t\tThe team is in mourning, darling.\n\n\t\t\tKATHARINE\n\t\tOh really?\n\n\t\t\tMADOX\n\t\tI'm afraid we're not having much luck\n\t\tobtaining funds for the expedition.\n\n\t\t\tKATHARINE\n\t\tHow awful.  What will you do?\n\n\t\t\tMADOX\n\t\tA more modest expedition, or even wait a\n\t\tyear.  Remind our families we still exist.\n\n\t\t\tCLIFTON\n\t\t\t\t(astonished)\n\t\tGood heavens, are you married, Madox?\n\n\t\t\tMADOX\n\t\tVery much so.  We are all, save my\n\t\tfriend here.\n\nHe nods at Almasy.  Clifton appears tremendously relieved.\n\n\t\t\tCLIFTON\n\t\tI feel much better, don't you darling?\n\t\tWe were feeling rather self-conscious.\n\t\tLet's toast, then.  To absent wives.\n\n\t\t\tD'AGOSTINO\n\t\t\t\t(toasting Katharine)\n\t\tAnd present ones.\n\n\t\t\tKATHARINE\n\t\t\t\t(toasting Almásy)\n\t\tAnd future ones.\n\n\n53\tINT.    SHEPHEARD'S HOTEL.    NIGHT.\n\nTHE BALLROOM.  A dance finishes.  Almásy takes over from D'Agostino to \npartner Katharine.  They dance beautifully.  The others remain on the \nterrace in deep conversation.\n\n\t\t\tKATHARINE\n\t\tWhy did you follow me yesterday?\n\n\t\t\tALMÁSY\n\t\tExcuse me?\n\n\t\t\tKATHARINE\n\t\tAfter the market, you followed me\n\t\tto the hotel.\n\n\t\t\tALMÁSY\n\t\tI was concerned.  As I said, women in\n\t\tthat part of Cairo, a European women,\n\t\tI felt obliged to.\n\n\t\t\tKATHARINE\n\t\tYou felt obliged to.\n\n\t\t\tALMÁSY\n\t\tAs the wife of one of our party.\n\n\t\t\tKATHARINE\n\t\t\t\t(sardonic)\n\t\tSo why follow me?  Escort me, by\n\t\tall means.  Following me is\n\t\tpredatory, isn't it?\n\nThe dance finishes.  They walk back to their table, where Almásy leads \nKatharine back to her seat next to Clifton.\n\n\t\t\tCLIFTON\n\t\tI was just saying, I'm going to cable\n\t\tDowning Street, see if I can't stir up\n\t\ta few shillings - Katharine's mother\n\t\tand the PM's wife are best -\n\n\t\t\tKATHARINE\n\t\t\t\t(interrupting)\n\t\tDarling, for goodness' sake!\n\n\t\t\tCLIFTON\n\t\tWell, she is!\n\n\n54*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana, having already replaced the bedlinen, is standing on a stepladder \ntrying to hang home-made drapes around the bed as Caravaggio knocks \ntentatively, then comes in.\n\n\t\t\tCARAVAGGIO\n\t\tHello.\n\n\t\t\tTHE PATIENT\n\t\tFinally!  So you're our\n\t\tCanadian pickpocket?\n\n\tHe goes to help Hana, they work as he talks.\n\n\t\t\tCARAVAGGIO\n\t\tThief, I think, is more accurate.\n\n\t\t\tTHE PATIENT\n\t\tI understand you were in Africa.\n\t\tWhereabouts?\n\n\t\t\tCARAVAGGIO\n\t\tOh, all over.\n\n\t\t\tTHE PATIENT\n\t\tAll over?  I kept trying to cover\n\t\ta very modest portion and still failed.\n\t\t\t\t(to Hana)\n\t\tAre you leaving us?  Now's our\n\t\topportunity to swap war wounds.\n\n\t\t\tHANA\n\t\tThen I'm definitely going.\n\nAnd she exits.  The men consider her.\n\n\t\t\tCARAVAGGIO\n\t\tDoes she have war wounds?\n\n\n55*.\tINT.    THE MONASTERY.    HANA'S ROOM.    DAY.\n\nAs Hana walks up her stairs she finds herself overhearing their \nconversation as it threads up through the hole in the ceiling.  She \nstrips her own bed of the curtain she uses for a sheet.\n\n\t\t\tTHE PATIENT\n\t\tI think anybody she ever loves\n\t\ttends to die on her.\n\n\t\t\tCARAVAGGIO\n\t\tAre you planning to be the exception?\n\n\t\t\tTHE PATIENT\n\t\tMe?  You've got the wrong end of\n\t\tthe stick, old boy.\n\t\t\t\t(a pause)\n\t\tSo - Caravaggio - Hana thinks you\n\t\tinvented your name.\n\n\t\t\tCARAVAGGIO\n\t\tAnd you've forgotten yours.\n\n\t\t\tTHE PATIENT\n\t\tI told her you would never invent\n\t\tsuch a preposterous name.\n\n\t\t\tCARAVAGGIO\n\t\tI told her you can forget everything\n\t\tbut you never forget your name.\n\n\n56*.\tEXT.    BEACH CABIN.    ITALY.    DAY.    1944.\n\nHANA IS STILL LISTENING BUT NOW SHE'S OUTSIDE A CABIN.  She's in her \nuniform, clearing things away.  The Cabin door is ajar.  An OFFICER \nmoves around, then sits to make notes.\n\n\t\t\tOFFICER (O/S)\n\t\tWhat about your rank or serial number?\n\n\t\t\tTHE PATIENT (O/S)\n\t\tNo.  I think I was a pilot.  I was found\n\t\tnear the wreckage of a plane by the\n\t\tBedouin.  I was with them for some time.\n\nTHIS CONVALESCENCE HOSPITAL HAS BEEN FASHIONED FROM A LONG ROW OF \nBATHING CABINS ON THE COAST, complete with Campari Umbrellas and metal \ntables, at which are seated the bandaged and the dying and the \ncomatose, staring out to sea or in slow, muted conversation.  Hana \nwalks up to the Patient's cabin.  He is propped up with a view of the \nsea, which is interrupted by the pacing Officer.  Hana has a blanket \nand a chart for the Patient's bed.  She busies herself.\n\n\t\t\tOFFICER\n\t\tDo you remember where you were born?\n\n\t\t\tTHE PATIENT\n\t\tAm I being interrogated?  You should be\n\t\ttrying to trick me.  Ask me about\n\t\tTottenham Hotspur.  Or Buckingham Palace.\n\t\tAbout Marmite - I was addicted.  Or make\n\t\tme speak German, which I can, by the way.\n\n\t\t\tOFFICER\n\t\tWhy?  Are you German?\n\n\t\t\tTHE PATIENT\n\t\tNo.  \n\n\t\t\tOFFICER\n\t\tHow do you know you're not German if\n\t\tyou don't remember anything?\n\n\t\t\tTHE PATIENT\n\t\tYou tell me.  I remember a lot of things.\n\t\tI remember a garden, plunging down to\n\t\tthe sea - the Devil's Chimney we called\n\t\tit - and there was a cottage at the\n\t\tbottom, right on the shore, nothing\n\t\tbetween you and France.\n\n\t\t\tOFFICER\n\t\tThis was your garden?\n\n\t\t\tTHE PATIENT\n\t\tOr my wife's.\n\n\t\t\tOFFICER\n\t\tThen you were married?\n\n\t\t\tTHE PATIENT\n\t\tI think so.  Although I believe that\n\t\tto be true of a number of Germans.\n\t\tMight I have a glass of water?\n\nHana pours him a glass of water.  He notices her.\n\n\t\t\tTHE PATIENT\n\t\tThank you.\n\t\t\t\t(he sips)\n\t\tLook - my lungs are useless -\n\t\t\t\t(makes a small gap with\nhis fingers)\n\t\tI've got this much lung...the rest\n\t\tof my organs are packing up -\n\t\twhat could it possibly matter if I\n\t\twere Tutankhamun?  I'm a bit of\n\t\ttoast, my friend - butter me and\n\t\tslip a poached egg on top.\n\nHana leaves, smiling at the Patient's irascibility, sharing this with \nthe Officer, who frowns.  The interview continues.\n\n\n57\tEXT.    BEACH CABIN.    DAY.\n\nHana walks between the cabins.  STUART steps out of the shade.  He is \ndrawn, older than last seen.\n\n\t\t\tSTUART\n\t\tMy leave is canceled.  I can't\n\t\tmeet you later.\n\nHana frowns, helpless.  As if to emphasize this, a Staff Nurse comes \nby, carrying a bowl and a withering look.\n\n\n58*.\tINT.    BEACH CABIN.    DAY.\n\n Hana enters, approaches the Patient.  She's circumspect.\n\n\t\t\tHANA\n\t\tExcuse me -\n\n\t\t\tTHE PATIENT\n\t\tYes?\n\n\t\t\tHANA\n\t\tCan I ask - my friend, can he come in?\n\t\tJust for a few minutes?\n\n\t\t\tTHE PATIENT\n\t\tYour friend?\n\n\t\t\tHANA\n\t\tHe's going back to the front this\n\t\tevening.  I can't see him otherwise.\n\n\t\t\tTHE PATIENT\n\t\tJust go off.  I'll be quite all right.\n\n\t\t\tHANA\n\t\tNo, I can't go, but if it, if you weren't \n\t\toffended, it would be very good of you \n\t\tto allow us - every other cabin is crammed.\n\t\tThis is as private as we'll get.\n\n\t\t\tTHE PATIENT\n\t\tWell then - yes.  Of course.\n\n\t\t\tHANA\n\t\tThank you.  Thank you.\n\nShe hurries out, returns with Stuart.  They stand awkwardly.\n\n\t\t\tHANA\n\t\tThis is Captain McGann.\n\n\t\t\tTHE PATIENT\n\t\tPlease, don't waste your time on\n\t\tpleasantries -\n\n\t\t\tSTUART\n\t\tThanks.\n\n\t\t\tTHE PATIENT\n\t\tI'm going to sing.  If I sing I shan't\n\t\thear anything.\n\nAnd with that he bursts into a raucous, coughing version of Yes! We \nHave No Bananas.  He changes language each verse.  The couple stand, \nformal, then edge round to the back of the bed.\n\n\t\t\tHANA\n\t\t\t\t(touching his lip)\n\t\tYou've got a mustache.\n\n\t\t\tSTUART\n\t\tA bit of one.\n\n\t\t\tHANA\n\t\tI was looking forward to this evening.\n\n\t\t\tSTUART\n\t\t\t\t(whispers)\n\t\tI had a hotel room.\n\n\t\t\tHANA \n\t\t\t\t(whispers)\n\t\tI thought that was for when we\n\t\twere very very old?\n\n\t\t\tSTUART\n\t\tI'm feeling old.\n\nThey EMBRACE, fiercely, hardly making a sound, or moving.  THE PATIENT \nROARS THE SONG.\n\n\n59*.\tEXT.   THE MONASTERY.   HANA'S GARDEN.   MORNING.\n\nA battered open backed TRUCK comes into the Monastery.  An ITALIAN \nPARTISAN sits in the back, a SHOTGUN resting on his knees.  The truck \nstops, and Caravaggio emerges from the passenger door.  He collects \nsome packages from the PARTISAN, including a dead RABBIT, and then \nexchanges a few words with the driver.  Hana, who's watching all of \nthis from her garden, sees that the driver is a WOMAN.  The woman's \nname is GIOIA, and Caravaggio leans into the window to make his goodbye \nto her.\n\nCaravaggio approaches the Vegetable Garden as Hana comes to greet him.  \nHe throws her the rabbit, and hurries up the stairs without pausing, \nclutching the other boxes.\n\n\t\t\tCARAVAGGIO\n\t\tSupper.\n\nHana calls after him.\n\n\t\t\tHANA\n\t\tWhere've you been?\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(not stopping)\n\t\tRabbit hunting.\n\nHana looks at the rabbit.  She's angry.  Caravaggio hasn't been around \nfor a week.\n\n\n60*.\tINT.  THE MONASTERY.  DOWNSTAIRS CORRIDOR.  DAY.\n\nHana heads up for the kitchen, then stops as there's a faint CRASH from \nupstairs.\n\n\n61*.\tINT.   THE MONASTERY.   UPSTAIRS CORRIDOR.   DAY.\n\nHana, the rabbit still in her hands, comes along the corridor to find \nCaravaggio SLUMPED on the floor, retching.  The discarded NEEDLE lies \nbeside him, the new package of MORPHINE CAPSULES ripped open.  He looks \nup at Hanna, glazed.\n\n\t\t\tHANA\n\t\tI could help you.  I could\n\t\tget you off that.\n\n\t\t\tCARAVAGGIO\n\t\tCan you cook the rabbit or will you\n\t\ttry and bring that back to life?\n\nShe bends, starts clearing up, putting the morphine phials back into \nthe box.\n\n\t\t\tHANA\n\t\tIt's a week.  We didn't know where you\n\t\twere - or if you coming back, or -\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(of the drugs)\n\t\tYou should be happy.  What were you\n\t\tgoing to do for him when it ran out?\n\nHe pulls out more phials from his jacket.\n\n\t\t\tHANA\n\t\tWhat do you do?  What are you doing here?\n\n\t\t\tCARAVAGGIO\n\t\tSome gave me a dress.\n\t\t\t\t(starts to tear at a parcel)\n\t\tYou know what's great?  What I'm learning?\n\t\tYou win a war and you not only gain the\n\t\tmiles you get the moral ground.\n\t\tEverywhere I go, we're in the right.\n\t\tI like that.\n\n\n62*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana comes in, carrying a batch of the new morphine.  She's wearing a \ndifferent FROCK.  It's not new, and it's faded, but the change of color \nis startling.\n\n\t\t\tTHE PATIENT\n\t\tSomething smells so rich.  My\n\t\tstomach is heaving -\n\n\t\t\tHANA\n\t\tHe came back, he says he caught a\n\t\trabbit.  I'm cooking it.\n\n\t\t\tTHE PATIENT\n\t\tThat's a different dress.\n\n\t\t\tHANA\n\t\tHe keeps asking me questions about you.\n\t\tDo you know him?  Do you recognize him?\n\n\t\t\tTHE PATIENT\n\t\tDo I recognize him?  I recognize what he is.\n\t\tI like him.  He's Canadian.  He can read\n\t\tItalian.  He can catch rabbits.\n\n\n63*.\tEXT.    BASECAMP AT POTTERY HILL.    DUSK.\n\nAlmásy squats with an ANCIENT ARAB outside his rudimentary house, while \nhe draws on the sand, talking in some arcane dialect, scratching out a \npossible location for the lost oasis.  The man stops speaking and \nscours the sky a beat or two before we or Almasy hear the faint noise \nof a PLANE.  It's Clifton's Steerman, Rupert Bear, coming in to land.  \nAlmasy doesn't look up.\n\nThe Arab continues to talk.  The newly-arrived Katharine has scrambled \nup the hill to speak to Almásy.\n\n\t\t\tKATHARINE\n\t\t\t\t(diffident)\n\t\tHello.  Not to interrupt but\n\t\twe're celebrating.\n\nShe makes to leave but Almásy puts up a hand to keep Katharine there, \nbut quiet.\n\n\t\t\tALMÁSY\n\t\tThis is an incredible story - about a man\n\t\thunting an Ostrich, he's been telling me\n\t\tabout Zerzura, he thinks he's been there,\n\t\tbut his map, the route he's describing,\n\t\the couldn't survive the journey now, but\n\t\the's a poet, so his map is poetry - and\n\t\tnow we're onto an Ostrich.\n\t\t\t\t(to the Arab in ARABIC)\n\t\tI'm telling her your map is poetry.\n\nThe Arab shrugs.\n\n\t\t\tKATHARINE\n\t\tWhat do you mean, poetry?\n\n\t\t\tALMÁSY\n\t\tA mountain curved like a woman's back, \n\t\ta plateau the shape of an ear.\n\n\t\t\tKATHARINE\n\t\tSounds perfectly clear.  Where does\n\t\tthe Ostrich come in?\n\n\t\t\tALMÁSY\n\t\tThe Ostrich is a detour.  A poor man hunts\n\t\tan ostrich, it's the method.  Nothing to do\n\t\twith Zerzura.  To catch an ostrich you must\n\t\tappear not to move.  The man finds a place\n\t\twhere the ostrich feeds, a wadi, and stands\n\t\twhere the ostrich can see him, on the\n\t\thorizon, and doesn't move, doesn't eat -\n\t\totherwise the ostrich will run.  At nightfall,\n\t\the moves, fifty, sixty yards.  When the\n\t\tostrich comes the next day, the man is\n\t\tthere, but he's nearer.\n\t\t\t\t(to the guide)\n\t\tHaunting the ostrich.\n\nThe Guide speaks, amplifying something, picking at his robe.\n\n\t\t\tALMÁSY\n\t\tYes, the ostrich, it will feed a family,\n\t\tnot just the meat, but by selling the \n\t\tfeathers, beak, the skin, a year from\n\t\tthis one animal.  So, each day the\n\t\tman gets closer.  And the ostrich is\n\t\tnot sure - has something changed? -\n\t\tnow the standing man is only a few\n\t\tyards from where it feeds.  And then\n\t\tone day, the man is in the wadi, in\n\t\tthe water.  And the Ostrich comes, as\n\t\talways, dips into the water and the\n\t\tman JUMPS UP - and captures it.\n\nHe shrugs.  The Arab has more to say.  Almásy doesn't respond, quieting \nhim with a dismissive gesture.\n\n\t\t\tKATHARINE\n\t\tWhat is he saying?\n\t\t\t\t(Almasy, awkward, shakes his head)\n\t\tCome on, what did he say?\n\n\t\t\tALMÁSY\n\t\tHe said - be careful.\n\n\t\t\tKATHARINE\n\t\tBe careful?  You mean you - or me?  Who?\n\n\t\t\tALMÁSY\n\t\t\t\t(to the Arab)\n\t\tHer or me?\n\nThe Arab speaks again.  Almasy speaks without looking at her.\n\n\t\t\tALMÁSY\n\t\tThe one who appears not to be moving.\n\n\n64*.\tINT.    TENT.   BASECAMP AT POTTERY HILL.   NIGHT.\n\nKatharine comes in.  Then, a beat, and Almásy.  Clifton is holding up \nthe champagne.  \n\n\t\t\tCLIFTON\n\t\tGentlemen, to Zerzura.\n\n\t\t\tALL\n\t\tZerzura.\n\n\t\t\tMADOX\n\t\tAnd a special thank you to Geoffrey\n\t\tand Katharine, without whose\n\t\tfund-raising heroics we should \n\t\tstill be kicking our heels.\n\nThey toast the Cliftons.\n\n\t\t\tCLIFTON\n\t\tTo arm-twisting.\n\n\t\t\tMADOX\n\t\t\t\t(to Almásy)\n\t\tDid Katharine say? - \n\t\tGeoffrey has to fly back to Cairo.\n\n\t\t\tCLIFTON\n\t\tHave to return the favor - take a few\n\t\tphotographs for the army.\n\n\t\t\tKATHARINE\n\t\tDarling, Peter says I could stay...\n\n\t\t\tMADOX\n\t\t\t\t(checking with Almásy)\n\t\tWhy not?\n\n\t\t\tALMÁSY\n\t\tWhat kind of photographs?\n\n\t\t\tCLIFTON\n\t\tPortraits.  The Brigadier, the Brigadier's\n\t\twife, the Brigadier's dogs, the Brigadier\n\t\tat the Pyramids, the Brigadier breathing.\n\n\t\t\tKATHARINE\n\t\t\t\t(to Clifton)\n\t\tWhy do you think?  About my staying?\n\n\t\t\tCLIFTON\n\t\tWell look, if nobody minds, truly, then\n\t\tI suppose - I shall, of course, be bereft...\n\n\t\t\tKATHARINE\n\t\t\t\t(playfully poking his ribs)\n\t\tOh.\n\n\t\t\tCLIFTON\n\t\tBut finally able to explore the Cairo\n\t\tnight-life.  I shall produce an\n\t\tauthoritative guide to the Zinc Bars\n\t\tand - I want to say Harems - am I in\n\t\tthe right country for Harems?\n\n\n65*.\tEXT.     BASECAMP AT POTTERY HILL.    MORNING.\n\nAs Clifton prepares to leave in the Steerman, Almásy approaches.\n\n\t\t\tALMÁSY\n\t\tSafe journey.\n\n\t\t\tCLIFTON\n\t\tYou too.  Good luck!\n\n\t\t\tALMÁSY\n\t\tClifton - your wife - do you think\n\t\tit's appropriate to leave her?\n\n\t\t\tCLIFTON\n\t\tAppropriate?\n\n\t\t\tALMÁSY\n\t\tI think the desert is, it's - for a\n\t\twoman - it's very tough, I wonder \n\t\tif it's not too much for her.\n\n\t\t\tCLIFTON\n\t\tAre you mad?  Katharine loves it\n\t\there. She told me yesterday.\n\n\t\t\tALMÁSY\n\t\tAll the same, I, were I you I would\n\t\tbe concerned -\n\n\t\t\tCLIFTON\n\t\tI've known Katharine since she was\n\t\tthree, my aunt is her aunt, we were\n\t\tpractically brother and sister before\n\t\twe were man and wife.  I think I'd\n\t\tknow what is and what isn't too much\n\t\tfor her.  I think she's know herself.\n\n\t\t\tALMÁSY\n\t\tVery well.\n\n\t\t\tCLIFTON\n\t\t\t\t(laughing it off)\n\t\tWhy are you people so threatened \n\t\tby a woman?!\n\nHe settles into the controls.  Almásy watches the plane taxi away.  \nDoesn't move at all.  Katharine waves from the tent as the Steerman \ntakes off.\n\n\n65a*.\tEXT.    BASECAMP AT POTTERY HILL.\n\nThe THREE FORD CARS leave the campsite, loaded for a scouting \nexpedition.  The rest of the party, Bedouin, tents, camels and Tiger \nMoth is left behind.  Madox shouts last-minute instructions from the \nwindow of his car.\n\n\n66*.\tEXT.    DESERT EN ROUTE TO CAVE OF SWIMMERS.    DAY.\n\nFENELON-BARNES sits astride his camel, and wipes away the sweat.  The \ndesert stretches for miles, shimmering, the sun baking the sand.  His \nGUIDES wind their headcloths tighter.  Nobody speaks.  Then one of them \nlooks round, raises a hand.  A BUZZING noise.  They all turn.  A SMALL \nCLOUD OF DUST EMERGES OVER A RIDGE.  Locusts?  A sandstorm?\n\nA CARAVAN OF CARS, the Almásy/Madox expedition, bumps along, \nsuspensions threatened by the constant dips and ridges.  On each car \nthere are three in the passenger cabin, the open backs crammed with \ndrums of gasoline and water and equipment.  On the front vehicle, the \ntenth member of the party, KAMAL, acts as a navigator and sits on a \nCAMEL SADDLE, a rodeo cowboy, on the roof of the leading car, driven by \nMadox.  As they spot FENELON-BARNES they sound their horns and wave \ngood-naturedly.  F-B scowls, watches them roar by, stealing his \nthunder.\n\n\n66a*.\tEXT.  DESERT EN ROUTE TO CAVE OF SWIMMERS.   DAY.\n\nONE OF THE CARS IS HOPELESSLY BOGGED DOWN IN HEAVY SAND.  It's contents \nhave been unloaded, and a rope ladder is being inserted under the \ntires.  The entire company huff and puff and argue about the best means \nof extricating the vehicle.\n\n\n67*.\tINT.    CAR EN ROUTE TO CAVE OF SWIMMERS.    DAY.\n\nLATER - Almásy drives the second car, accompanied by Katharine and Al \nAuf.  Katharine breaks the long silence.\n\n\t\t\tKATHARINE\n\t\tI've been thinking about - how does\n\t\tsomebody like you decide to come to\n\t\tthe desert?  What is it?  You're doing\n\t\twhatever you're doing - in your castle,\n\t\tor wherever it is you live, and one day,\n\t\tyou say, I have to go to the desert - or what?\n\nAlmásy doesn't answer.  Katharine, who has looked at him for an answer, \nlooks away.  There's another long silence.\n\n\t\t\tALMÁSY\n\t\tI once traveled with a terrific guide,\n\t\twho was taking me to Faya.  He didn't\n\t\tspeak for nine hours.  At the end of\n\t\tit he pointed at the horizon and \n\t\tsaid - Faya!  That was a good day!\n\nPoint made, they lapse again into silence.  Katharine boils.\n\n\t\t\tKATHARINE\n\t\tActually, you sing.\n\n\t\t\tALMÁSY\n\t\tPardon?\n\n\t\t\tKATHARINE\n\t\tYou sing.  All the time.\n\n\t\t\tALMÁSY\n\t\tI do not.\n\n\t\t\tKATHARINE\n\t\tAsk Al Auf.\n\nAlmásy asks Al Auf in Arabic.  He laughs, nods.\n\n\t\t\tKATHARINE\n\t\t\t\t(sings wickedly)\n\t\tI'll be down to get you in the taxi,\n\t\thoney, you'd better be ready about\n\t\thalf-past eight...!\n\nAl Auf nods and grins furiously, joins in, impersonating Almásy.  \nAlmásy grunts in irritation.\n\n\n68*.\tEXT.  NEAR THE BASECAMP AT THE CAVE OF SWIMMERS.  DUSK.\n\nThe group is investigating a cleft in the rocky massif.  They climb \nslowly.  Below them, A NEW AND TEMPORARY BASE CAMP.\n\nThe group winds around the rock.  Almásy turns to offer a hand to \nKatharine behind him, pulling her up to the next rock slab.  She smiles \nat him.  He smiles back curtly, continues.\n\nThe group stops at a level plateau.  The Arabs stand apart and SING \nTHEIR PRAYERS AT DUSK.  Al Auf leads the incantations.\n\n\t\t\tAL AUF\n\t\tAllahu Akbar, Allahu Akbar...\n\nThe westerners wait respectfully.  As the sun sets in glory, Almásy \nlooks over at the range of rocks.  One particular range seems to look \nexactly like A WOMAN'S BACK.  He squints at the rock.  Almásy \ndiscreetly pulls out his COMPASS.\n\n\n69*.\tEXT.    CAVE OF SWIMMERS.    DUSK.\n\nAlmásy clambers up the rocks, coming through a narrow crevice to find A \nNATURAL SHELF.  He scrambles up this path, reaching up, only to notice \nthat his hand almost perfectly covers A PAINTED HAND on the rock, and \nas he digests this he realizes he has climbed past what is THE MOUTH OF \nA CAVE.  He disappears inside.\n\n\n70\tINT.    CAVE OF SWIMMERS.    FLASHLIGHT.\n\nA FLASHLIGHT squirts into the cave.  Almásy treads cautiously along the \nnarrow winding passage.  He comes to an open cavern and takes his \nflashlight up to a wall.  PAINTINGS EMERGE, figures, animals,  ancient \npictures.  A giraffe.  Cattle.  Fish.  Men with bows and arrows.  \nAlmásy is astonished by what he sees.\n\n\n71*.\tEXT.    NEAR THE CAVE OF SWIMMERS.    EVENING.\n\nThe others watch as a flashlight bobs and jerks among the rocks as \nAlmásy comes scrambling down, transformed into an excited teenager.\n\n\t\t\tALMÁSY\n\t\tMadox!  Madox!\n\nHe slithers in a heap in front of the astonished expedition party.  \nDoesn't care.\n\n\n72\tINT.    CAVE OF SWIMMERS.    FLASHLIGHT.\n\nAlmásy has led the whole party into the heart of the cave.  Now Madox \ncomes alongside him at the wall, his flashlight joining Almásy's and \nincreasing the visibility of the paintings.  A dark-skinned figure, \napparently in the process of DIVING into water, comes clearly into \nview.  Then others supine, arms outstretched.\n\n\t\t\tMADOX\n\t\t\t\t(with audible excitement)\n\t\tMy God, they're swimming!\n\nThe others crowd round.  FIVE EXCITED FACES IN THE GREEN GLOOM OF THE \nCAVE.\n\n\n73*.\tEXT.    CAVE OF SWIMMERS.    DAY.\n\nA hive of activity.  The team has set up TRESTLES to catalogue the \nfinds as the Bedouin come out with baskets of detritus, which they \nempty onto a growing heap as the Cave is cleared out.  Entering the \ncave, Almásy passes with camera equipment, just as D'Ag emerges \ncarrying the corpse of a perfectly preserved DESERT FOX.  D'Ag gestures \nto Almasy with his customary enthusiasm, holding up the body of the \nfox.\n\n\t\t\tD'AGOSTINO\n\t\tHave you seen this?  Astonishing.\n\t\tPerfectly preserved.\n\n\n74\tINT.    CAVE OF SWIMMERS.    DAY.\n\nInside, Bermann is setting up LAMPS, running wires from a car BATTERY.  \nKamal is helping him.  And as Almásy arrives he catches a tiny moment \nof tenderness between them.  Bermann, seeing him, quickly disengages \nand busies himself with the lights.  At another wall, Katharine is \ncatching.\n\n\n75\tEXT.    THE DESERT.    DAY.\n\nThe CARS are heading back to Basecamp.  They bounce over the sand.\n\n\n76*.\tINT.    BERMANN'S CAR.    DAY.\n\nBermann is driving the lead CAR along some STEEP DUNES.  Almásy beside \nhim.  Bermann is peeling AN ORANGE, a segment of which he holds out of \nthe window.  Kamal, riding shotgun, leans down and collects it, his \nhead dipping in to grin at Bermann.  Bermann looks uneasily as Almásy.  \nHe wants to tell him of his passion, of his absolute love for Kamal, \nbut he daren't.\n\n\t\t\tBERMANN\n\t\tI love the desert, you see.  That's my,\n\t\tthat's my - I can't think of the word.\n\t\t\t\t(Almásy nods)\n\t\tHow do you explain?  To someone who's\n\t\tnever been here?  Feelings which seem\n\t\tquite normal.\n\n\t\t\tALMÁSY\n\t\t\t\t(compassionate)\n\t\tI don't know, my friend.  I don't know.\n\nBermann holds out another segment of the orange, and watches the slim \nbrown hand collect it.  A MOMENTARY DISTRACTION IS ALL IT TAKES FOR HIM \nTO MISJUDGE THE LINE AND SUDDENLY THE DUNE COLLAPSES UNDER THE TIRE AND \nTHE CAR LURCHES SIDEWAYS AND TOPPLES OVER THE EDGE.  D'Ag - following, \nFouad beside him - brakes sharply, but can't stop his own car from \nbeing caught in the avalanche of sand, and IT PLUNGES DOWN THE DUNE AND \nINTO BERMANN'S UPTURNED CAR WITH AN OMINOUS CRUNCH, the radiator \nexploding.  Only Madox, Katharine beside him, and a little way behind, \nmanages to stay clear of the trouble.  He jumps out of the vehicle and \nslides down the dune to find pandemonium as the passengers stumble out \nof the cars, sand flying, smoke pouring from the upright vehicle, the \nwheels of the overturned car spinning wildly in the air, a puddle of \noil spreading ominously.\n\n\n77*.\tEXT.    THE DESERT.    DAY.\n \nLATER and the group have cleaned up as best as possible.  D'Ag, \nBermann, and Fouad are a little worse for wear.  Fouad's arm is in a \nsling, and D'Ag is sporting a bloody head-bandage.  Bermann has broken \na finger and is being attended to by Madox.  The luggage, water and \npetrol have been stacked up and the men are loading up the remaining \ncar.  Almásy is working at the crumpled end of the vehicle.  He's \nhaving no success.\n\n\n78*.\tEXT.    THE DESERT.    DAY.\n\nAlmásy, Kamal and two of the other young Bedouin stand around the mess \nof the two broken vehicles.  The ONE WORKING CAR is loaded with men and \nprovisions.  Katharine sits inside, next to Madox, Almásy comes over to \nher window, to speak past her to Madox.\n\n\t\t\tMADOX\n\t\tI'll be back as quick as I can.  \n\t\tThirty-six hours at the outside.\n\n\t\t\tALMÁSY\n\t\tTry to get a second radiator, we'll bury\n\t\tit between here and the Pottery Hill.\n\t\tAnd a better jack.  We planned badly.\n\n\t\t\tMADOX\n\t\t\t\t(nods at Almásy, then shouts over \nto the wrecked vehicles)\n\t\tBermann!\n\nThis is Bermann's cue to take leave of Kamal who is staying behind.  \nKamal makes a little bow.\n\n\t\t\tKAMAL\n\t\tMay God make safety your companion.\n\nBermann nods and hurries away, squeezing into the car which jolts off, \nbouncing over the track.\n\nTHE VEHICLE GETS ABOUT TWENTY YARDS, ALMASY WATCHING, BEFORE IT SINKS \nFORLORNLY INTO THE SOFT SAND.  IT'S HOPELESSLY OVERLOADED WITH PEOPLE.  \nTHEY ALL GET OUT.\n\n\t\t\tKATHARINE\n\t\tI shall stay behind, of course\n\n\t\t\tMADOX\n\t\tCertainly not.\n\n\t\t\tKATHARINE\n\t\tI insist.  There clearly isn't room for\n\t\tus all, I'm the least able to dig, and \n\t\tI'm not one of the walking wounded.\n\t\tThose are facts.  Besides, if I remain\n\t\tit's the most effective method of\n\t\tpersuading my husband to abandon\n\t\twhatever he's doing and rescue us.\n\nIt's hard to argue with this logic.  Almásy shrugs.\n\nLATER - THE MADOX CAR makes a more effective departure.  And Almasy and \nKatharine are left alone.  THEY LOOK AT EACH OTHER as if realizing this \nfor the first time.  Almasy immediately returns to the two damaged \nvehicles and helps the men stretch the cut canvas which was once a tent \nTO FASHION A MAKESHIFT SHELTER BETWEEN THE TWO CARS.  Katharine goes to \njoin them.  There is no obstacle to the remorseless horizon, just miles \nof undulating dunes.\n\n\n79\tINT.    SHELTER.    DAY.\n\nAlmásy sits alone, writing into HIS HERODOTUS, a map folded in front of \nhim, from which he makes notes.  Katherine comes across with a clutch \nof her SKETCHES from the Cave wall.  Hands them to him.  They're \nbeautiful.\n\n\t\t\tALMÁSY\n\t\tWhat's this?\n\n\t\t\tKATHARINE\n\t\tI thought you might paste them\n\t\tinto your book.\n\n\t\t\tALMÁSY\n\t\tWe took several photographs,\n\t\tthere's no need.\n\n\t\t\tKATHARINE\n\t\tI'd like you to have them.\n\n\t\t\tALMÁSY\n\t\t\t\t(handing them back)\n\t\tThere's really no need.  This is\n\t\tjust a scrapbook.  I should feel\n\t\tobliged.  Thank you.\n\n\t\t\tKATHARINE\n\t\t\t\t(exasperated)\n\t\tAnd that would be unconscionable,\n\t\tI suppose, to feel any obligation?  \n\t\tYes.  Of course it would.\n\nShe's already turning, walking as far from him as the cramped shelter \npermits.  He continues with his maps.\n\n\n80\tEXT.    THE DESERT.    NIGHT.\n\nKatharine sits alone on top of the Dune, smoking, surveying the \nlandscape.  Below her the makeshift camp - a fresh wind flicking at the \ntarpaulin, THE DEEP TRACKS OF MADOX'S CAR STRETCHING OFF TOWARDS \nCIVILIZATION.  Almásy emerges from the tent and, locating Katharine, \nheads towards her.\n\n\t\t\tALMÁSY\n\t\tYou should come into the shelter.\n\n\t\t\tKATHARINE\n\t\tI'm quite all right, thank you.\n\n\t\t\tALMÁSY\n\t\tLook over there.\n\nKatharine turns, scans the horizon.\n\n\t\t\tKATHARINE\n\t\tWhat am I looking at?\n\n\t\t\tALMÁSY\n\t\tSee what's happening to them -\n\t\tthe stars.\n\n\t\t\tKATHARINE\n\t\tThey're so untidy.  I'm just trying \n\t\tto rearrange them.\n\n\t\t\tALMÁSY\n\t\tIn an hour there will be no stars.\n\t\tThe air is filling with sand.\n\nHe offers a hand.  A little reluctantly she takes it.\n\n\n81\tEXT.    SHELTER.    NIGHT.\n\nThe team hurries around the improvised tent, weighing it down with \npacking cases, gasoline drums, water cans, bringing anything loose or \nlight inside the tarpaulin.  THE WIND is whipping up, the air busy with \nsand.  Almásy pushes everyone under cover.\n\n\n82\tINT.    SHELTER.    NIGHT.\n\nTHE SAND SEEMS TO BE SCOURING THE TARPAULIN.  Kamal and Almásy try to \nsecure one vulnerable area, but suddenly there are leaks everywhere and \nthe sand swarms inside.\n\nIt's noisy, too, and Almásy has to shout to make himself understood, \nindicating to the Bedouin to grab water and blankets and food, all the \nvaluables, and get out.  He himself finds blankets and water and shouts \nat Katharine to do the same.  One side of the canvas suddenly RIPS \napart like paper. Chaos as figures struggle in ever-worsening \nconditions, sand blizzarding the air.\n\n\n83\tEXT.    SHELTER.    NIGHT.\n\nTHE SHELTER FLIES INTO THE AIR, stranding the figures, their heads \nwrapped in blankets, flashlights useless.  They seek safety in two \ngroups, the tribesmen to the cabin of the overturned car, Katharine and \nAlmásy to the upright one.\n\n\n84\tINT.    CAR.    NIGHT.\n\nInside the cabin, the sand swirling around them, Katharine and Almásy \nsit without speaking.  Dawn is trying to break through.  He pours a \nlittle water into a mug so that they can wash out their eyes and noses \nand mouths.  She takes her silk scarf and first dries her eyes with it, \nthen dries his.\n\n\t\t\tKATHARINE\n\t\tThis is not very good, is it?\n\n\t\t\tALMÁSY\n\t\tNo.\n\n\t\t\tKATHARINE\n\t\tShall we be all right?\n\n\t\t\tALMÁSY\n\t\tYes.  Absolutely.\n\n\t\t\tKATHARINE\n\t\tYes is a comfort.  Absolutely is not.\n\n\n85\tEXT.    THE DESERT.    DAWN.\n\nThe sand is piling up against the two cars, the tent is swept from its \nmoorings, the water cans are hurled up too, and then plunge ominously \ninto sand drifts as if going under an ocean.\n\n\t\t\tALMÁSY (O/S)\n\t\t...let me tell you about winds.  There\n\t\tis a whirlwind in Southern Morocco, the \n\t\tAajej, against which the fellahin defend\n\t\tthemselves with knives.  The Ghibli from\n\t\tTunis rolls and rolls and produces a \n\t\trather strange nervous condition...\n\nAnd we hear Katharine's laugh.\n\n\n86\tINT.    CAR.    DAWN.\n\nAlmasy sits alongside Katharine, whose head is against his shoulder.  \nHe continues his story of winds.\n\n\t\t\tALMÁSY\n\t\t#NAME?\n\t\tWhich Mariners called the sea of\n\t\tdarkness.  Red sand from this wind\n\t\thas flown as far as the south coast\n\t\tof England, producing showers so\n\t\tdense they were mistaken for blood.\n\nAlmasy checks to see if Katharine is still awake.\n\n\t\t\tKATHARINE\n\t\tFiction.  We had a house on that coast\n\t\tand it never rained blood.  Go on.  More.\n\n\t\t\tALMÁSY\n\t\tAll true.  Herodotus, your friend, tells\n\t\tof a wind - the Simoon - so evil that a\n\t\tnation declared war on it and marched\n\t\tout to fight it in full battle dress, \n\t\ttheir swords raised.\n\n\n87*.\tEXT.    THE DESERT.    DAY.\n\nMORNING.  The sand has almost COMPLETELY ENGULFED the car on the \nexposed side, covering the windshield like snow, and encroaching onto \nthe door of the protected flank.\n\n\n88*.\tINT.    CAR.    DAY.\n\nAlmásy is woken by sound of A DISTANT ENGINE.  He jerks up, waking \nKatharine in the process, and heaves against the door.  He can't open \nit, and has to lean his feet against the passenger door, lying across \nKatharine, kicking it open.\n\n\n89*.\tEXT.    THE DESERT.    DAY.\n\nBy the time Almásy emerges from the car, the sand pouring into the \ncabin, MADOX'S CAR IS ROARING ALONG THE HORIZON.  Almásy waves, shouts, \nand then runs back into the car, finds his flare-gun, and SENDS A FLARE \nhigh into the sky.  Katharine is with him now, and they watch, \nhelplessly, as the car bounces away from them, Madox a man on a \nmission.  Katharine panics, THE SAND HAS ERASED ALL TRACES OF THEM.  \nShe speaks quietly, shocked.\n\n\t\t\tKATHARINE\n\t\tOur tracks, where are they?\n\nAlmásy is preoccupied.  He's gone back to their vehicle and returns \nwith a shovel, STARTS TO DIG FRANTICALLY.\n\n\t\t\tALMÁSY\n\t\tMadox will have calculated how many\n\t\tmiles, they'll soon turn around.\n\n\t\t\tKATHARINE\n\t\t\t\t(realizing what he's doing)\n\t\tOh my God, the others!\n\nShe kneels with him and helps to shovel away the sand WHICH HAS \nCOMPLETELY ENGULFED THE OTHER VEHICLE containing the three Bedouin.\n\n\t\t\tALMÁSY\n\t\t\t\t(during this)\n\t\tCould I ask you, please, to paste you\n\t\tpaintings into my book?  I should like\n\t\tto have them.  I should be honored.\n\n\t\t\tKATHARINE\n\t\tOf course.  Is it, am I a terrible\n\t\tcoward to ask how much water we have?\n\n\t\t\tALMÁSY\n\t\t\t\t(shoveling hard)\n\t\tWater?  Yes, we have water, we have\n\t\ta little in our can, we have water in\n\t\tthe radiator which can be drunk.  Not\n\t\tat all cowardly, extremely practical.\n\t\t\t\t(anxious at not uncovering\nthe boys, egging himself on)\n\t\tCome on, come on!\n\t\t\t\t(then back to Katharine)\n\t\tThere's also a plant - I've never seen\n\t\tit but I'm told you can cut a piece the\n\t\tsize of a heart from this plant and\n\t\tthe next day it will be filled with a\n\t\tdelicious liquid.\n\n\t\t\tKATHARINE\n\t\tFind that plant.  Cut out its heart.\n\nThey hear NOISES, scrabbling, faint thumps.  Almásy scrapes at the sand \nand they find the glass of the car.  The angle of the cab, tilted up to \nthe sky, has made it impossible for the trapped boys to lever it open.  \nTheir oxygen is rapidly deteriorating.  Almásy pulls the door and it \ncranks open.\n\n\n90*.\tEXT.    THE DESERT.    DAY.\n\nKatharine sits in the car, putting her pictures into the Herodotus.  \nIt's full of ALMÁSY'S HANDWRITING, PHOTOGRAPHS, SOME PRESSED FLOWERS.  \nShe deciphers a page of his words and drawings.  It's almost \nexclusively about her, the lines studded with K.s.  She reads, \nastonished, then looks at him as he and two of the three Bedouin circle \nthe area of the cars in ever-widening circles, like water-diviners, \nlike Kip searches for mines.  Kamal is slumped against the front of the \ncar.  He's sick.  Almásy suddenly drops to his knees and begins to \nshovel into the sand.  He pulls out A CAN OF WATER.  Turns to Katharine \nand holds it triumphantly in the air.\n\n\n91*.\tINT.    THE DESERT.    NIGHT.\n\nThere's a small, weak fire.  The group crouch around it.  The boys talk \nnoisily to Almásy.  Kamal is wrapped in a blanket and shivering.  \nAlmásy gives him water, speaks to Katherine.\n\n\t\t\tALMÁSY\n\t\tKamal is passing blood.  He must have\n\t\thad some internal damage in the crash.\n\t\tHe needs medicine.  I think we must risk\n\t\tthe other flare.\n\nHe gets up and loads the flare with what is clearly the last charge.  \nThis time the effect is dramatic with A RED UMBRELLA OF LIGHT.  \nKatharine comes up beside him.  They wait, hope fading with the flare.\n\n\t\t\tKATHARINE\n\t\t\t\t(blank)\n\t\tGeoffrey's not in Cairo.\n\t\t\t\t(Almásy looks at her)\n\t\tHe's not actually a buffoon.  And\n\t\tthe plane wasn't a wedding\n\t\tpresent.  It belongs to the British\n\t\tGovernment.  They want aerial\n\t\tmaps of the whole North Africa.\n\t\tSo I think he's in Ethiopia.  In\n\t\tcase you were counting on his \n\t\tsudden appearance.\n\n\t\t\tALMÁSY\n\t\tAnd the marriage - is that a fiction?\n\nThere's a beat.  Katharine has a hundred answers.\n\n\t\t\tKATHARINE\n\t\tNo, the marriage isn't a fiction.\n\nThe light from the flare fades on them and they stand in the dark.  \nSuddenly on the far horizon, behind their heads, AN ANSWERING FLARE \nfireworks into the sky.\n\n\t\t\tKATHARINE\n\t\tThank God.  Oh, thank God.\n\nThere's excited shouting from the two fit boys.  They leap up and run \ntowards the couple, who meanwhile have realized that the flare has not \ncome from Madox, but from an approaching CAMEL CARAVAN.  Almásy shouts \nto the boys for some identification.\n\n\t\t\tKATHARINE\n\t\tDo they know them?\n\n\t\t\tALMÁSY\n\t\t\t\t(squinting at the horizon)\n\t\tNo, but I think I do.\n\nThe Caravan slowly comes into focus.  IT'S FENELON-BARNES.  Katharine \ntouches Almásy's arm - an almost imperceptible gesture.\n\n\t\t\tKATHARINE\n\t\tAm I K. in your book?  \n\t\tI think I must be.\n\nAlmásy turns to her.  He runs the blade of his arm across her neck - \nthe sweat leaving a clear stripe.\n\nFenelon-Barnes approaches, dismounts from his camel, and addresses \nAlmásy.\n\n\t\t\tFENELON-BARNES\n\t\tI recollect your saying to ignore\n\t\tyour bones but I assume you have\n\t\tno objection to my rescuing your\n\t\tcompanion?\n\t\t\t\t(to Katharine)\n\t\tGood evening, Mrs. Clifton.\n\n\t\t\tKATHARINE\n\t\t\t\t(accepting his handshake)\n\t\tHello.\n\n\t\t\tFENELON-BARNES\n\t\tI'd like to introduce you to my camel -\n\t\tthe most notable beast on earth.\n\t\t\t\t(to Almásy)\n\t\tI understand you found some\n\t\tremarkable caves.\n\nA goatskin bag of water is offered to Katharine.  She drinks and hands \nit to Almásy.\n\n\t\t\tFENELON-BARNES\n\t\tPaintings of swimmers?  Remarkable.\n\n\n92\tEXT.    CAIRO.    DAY.\n\nANOTHER WORLD as a honking TAXI containing Almásy and Katharine \nnegotiates the incredible bustle of Cairo.\n\n\n93\tEXT.    SHEPHEARD'S HOTEL.    DAY.\n\nAlmásy, still in the same clothes, and evidently weary, emerges from \nthe cab, and pulls Katharine's belongings from the trunk, then holds \nopen the door for her.  As she walks towards the hotel, he hands her \nbag to a porter.  Katharine is stung.\n\n\t\t\tKATHARINE\n\t\tWill you not come in?\n\n\t\t\tALMÁSY\n\t\tNo.\n\n\t\t\tKATHARINE\n\t\tWill you please come in?\n\n\t\t\tALMÁSY\n\t\t\t\t(a beat)\n\t\tMrs. Clifton -\n\n\tKatharine turns, disgusted.\n\n\t\t\tKATHARINE\n\t\tDon't.  \n\n\t\t\tALMÁSY\n\t\tI believe you still have my book.\n\nKatharine fishes the book from her knapsack, shoves it at him, then \ndisappears.\n\n\n94\tINT.    ALMÁSY'S ROOM.    DAY.\n\nAlmásy lying on a camp bed, face down.  The walls are covered with \nmaps, enlargements of photographs.  A fan whirs over his kit which is \nspread, unraveled but ordered, on the stone floor.  An ineffably male \nroom, the shutters closed, just the thinnest shaft of light piercing \nthe gloom.  Almásy hasn't even removed his clothes, his boots kicked \noff below his jutting feet.  \n\nThere's A KNOCK at the door.  Almásy sleeps.  Another.  A third.  He's \nroused from the dead.  Stumbles to his feet, opens the door as the \nknocking continues.\n\nIt's Katharine.  She's bathed, luminous, stands back-lit by the \nafternoon sun - an angel in a cotton dress.  She walks past him into \nthe room.  He closes the door.  She turns.  He KNEELS before her, head \nat her thighs.  She's crying, her face expressionless as her hands go \nto his head.\n\n\t\t\tKATHARINE\n\t\tYou still have sand in your hair.\n\nShe starts to BEAT on his head and shoulders, violently.  He pulls \nback, to look at her, the tears streaming down her face.  She kneels \nand covers his face with kisses.  He pulls blindly at her dress and it \nRIPS across her breasts.\n\n\n95*.\tINT.    BATHROOM.    DAY.\n\nAlmásy is in the bath.  Katharine, wearing his dressing gown, pours in \na jug of steaming water.  Almásy leans over the rim of the bath.  He's \nsewing, carefully repairing the torn dress.\n\n\t\t\tKATHARINE\n\t\tI'm impressed you can sew.\n\n\t\t\tALMÁSY\n\t\tGood.\n\n\t\t\tKATHARINE\n\t\tYou sew very badly.\n\n\t\t\tALMÁSY\n\t\tYou don't sew at all!\n\n\t\t\tKATHARINE\n\t\tA woman should never learn to sew,\n\t\tand if she can she should never\n\t\tadmit to it.  Close your eyes.\n\n\t\t\tALMÁSY\n\t\t\t\t(laughs)\n\t\tThat makes it harder still.\n\nShe pushes the sewing from his hands, then pours water over his head, \nthen begins to shampoo his hair.\n\nAlmásy is in heaven.  The biggest smile we have seen from him.  She \ncontinues to massage his scalp.\n\n\t\t\tALMÁSY\n\t\tWhen were you most happy?\n\n\t\t\tKATHARINE\n\t\tNow.\n\n\t\t\tALMÁSY\n\t\tWhen were you least happy?\n\n\t\t\tKATHARINE\n\t\t\t\t(a beat)\n\t\tNow.\n\n\t\t\tALMÁSY\n\t\tOkay.  And what do you love?\n\t\tSay everything.\n\n\t\t\tKATHARINE\n\t\tWhat do I love?  I love rice pudding,\n\t\tand water, the fish in it, hedgehogs!\n\t\tThe gardens at our house in Freshwater -\n\t\tall my secret paths.\n\nShe rinses his scalp, then slips off the robe and CLIMBS IN BESIDE HIM, \ncovering his neck and shoulders in kisses.\n\n\t\t\tALMÁSY\n\t\tWhat else?\n\n\t\t\tKATHARINE\n\t\tMarmite - addicted!  Baths - not\n\t\twith other people!  Islands.  Your\n\t\thandwriting.  I could go on all day.\n\t\t\t\t(a beat)\n\t\tMy husband.\n\n\tAlmásy nods.\n\n\t\t\tALMÁSY\n\t\tWhat do you hate most?\n\n\t\t\tKATHARINE\n\t\tA lie.  What do you hate most?\n\n\t\t\tALMÁSY\n\t\tOwnership.  Being owned.  When\n\t\tyou leave, you should forget me.\n\nShe freezes, pulls herself away, out of the bath, looks at him, then \nSLAPS HIM VERY HARD across the face.\n\nShe picks up her dress, the thread and needle dangling from it, and \nwalks, dripping, out of the room.\n\n\n96*.\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nTo the Patient it's as if Katharine is walking out of his wall.  He \nsighs with pain, then looks away to where Hana has fallen asleep on the \nbed, almost on top of him.  He touches her.   He speaks as if each word \nburns him.\n\n\t\t\tTHE PATIENT\n\t\tCould I ask you to move?  I'm sorry -\n\t\tbut when you turn, the sheets, I can't\n\t\treally bear the sheets moving over me.  \n\t\tSorry.\n\n\t\t\tHANA\n\t\t\t\t(mortified, moving quickly)\n\t\tYes, of course, I'm so sorry.\n\t\tStupid of me.\n\n\tHana gets up, upset to have hurt him.\n\n\t\t\tHANA\n\t\tI'm so sorry.\n\n\n97*.\tINT.    THE MONASTERY KITCHEN.    NIGHT.\n\nHana comes to the table, carrying a jug of water and a bowl.   She's \nstill sad.  She unbuttons her dress, pulling it off her shoulder, \nbegins to pour the water to cool herself against the night's pressing \nheat.\n\n\n98*.\tEXT.    EMERGENCY FIELD HOSPITAL.   1944.    LATE DAY.\n\nThe EMERGENCY FIELD HOSPITAL is a cluster of tents practically ahead of \nthe Front Line SPORADIC GUN FIRE, LIGHT AND HEAVY, SOUNDS THROUGHOUT.  \nMary walks by on her way to the Nurse's tent.  It's 1944 and the war in \nItaly is still intense.\n\n\n99\tINT.    EMERGENCY FIELD HOSPITAL TENT.    LATE DAY.\n\nJAN is washing out of her HELMET, and stands naked in her socks.  Hana \nis using a flannel to wash Jan's back.  A couple of other girls like, \nexhausted, on their cots.  The mud is everywhere.  Another nurse is \nmaking tea out of an adapted plasma can on their tiny primus.\n\nMARY comes in and flops down.  She's GIVEN BLOOD and is pale and \nenervated.\n\n\t\t\tMARY\n\t\tOkay, Type Os, the vampires wait.\n\t\tEverybody's giving a pint.\n\n\t\t\tJAN\n\t\tUgh!  If they were sucking it out\n\t\tI wouldn't mind.  It's the needle\n\t\tI can't stand.\n\n\t\t\tHANA\n\t\t\t\t(laughing)\n\t\tYou're a nurse - how ca you be\n\t\tfrightened of needles!\n\n\n100\tINT.  TRIAGE TENT, EMERGENCY FIELD HOSPITAL.  NIGHT.\n\nHana walks through the main TRIAGE TENT.  It's packed with the ruined \nbodies of the injured, swaddled in bloody bandages.  Hana stops at a \ncouple of beds, shares a word or two with the patients.  She stops at \nanother bed, leans over its occupant.  His bandaged face is bloated and \nyellow.  He's not breathing.  She bends over him, his open eyes fixed \nin a glassy stare.  No pulse.  She snaps the triangular cardboard ID \nfrom his bed to indicate HE'S DIED.  Then tenderly closes his eyes.  \nTHEY SUDDENLY SNAP OPEN.  HE REARS UP, GRABBING HER.\n\n\t\t\tWOUNDED SOLDIER\n\t\tCan't wait to have me dead?  You bitch!\n\nHe slaps her hand away.  Slaps at the tubes going into his arm.  Hana \nis absolutely shocked.  But just as suddenly he's sunk back into semi-\nconsciousness.\n\nShaken, she sits by him and takes his hand, he pulls it away, she takes \nit again.  He is in terrible pain.  His face creased with anger.  Now \nhis hand is clutching at hers.  She tries to soothe him.\n\n\t\t\tHANA\n\t\tTry t be calm.  Ssssshhh.  Come on.\n\t\tBe calm now.  Ssshhhh.  Be peaceful.\n\t\tIt's okay.  It's okay.\n\nHIS FACE STILLS.  HIS HAND LOOSENS.  Now he has gone.  As Hana inspects \nhim, a shell seems to land close by.  THE LIGHTS FLICKER.  She ducks, \nalong with everyone else.\n\nBelow the bed, on slatboards, above the mud, are the now dead soldier's \npossessions.  They include A PAIR OF TENNIS SHOES.\n\n\n101\tINT.  TRIAGE TENT, EMERGENCY FIELD HOSPITAL.  EVENING.\n\nHANA, WEARING THE TENNIS SHOES, IS GIVING BLOOD.  She lies in a cot, \nnext to JAN.  The shelling sounds closer.\n\nOLIVER, the Doctor, is working on the most recent patient, a young \nCANADIAN Boy who is critically ill - the tubes hanging above him, of \nplasma and of blood.  The curtain drawn around him is pulled back, to \nreveal the two nurses in the background.  The Soldier can just see \nthem.  He's going to die any minute.  \n\n\t\t\tCANADIAN SOLDIER\n\t\t\t\t(whispering to Oliver)\n\t\tIs there anybody here from Picton?\n\n\t\t\tOLIVER\n\t\tPicton?  I don't know.\n\n\t\t\tCANADIAN SOLDIER\n\t\tI'd like to see somebody from home\n\t\tbefore I go.\n\nHana can only really hear Oliver's end of this conversation, but the \nmention of Canada chills her, and she knows, now, not later, that \nStuart is dead.\n\n\t\t\tHANA \n\t\t\t\t(to Oliver)\n\t\tWhy Picton?\n\n\t\t\tOLIVER\n\t\tHe's from there - edge of Lake\n\t\tOntario right, Soldier?\n\nThe boy nods.\n\n\t\t\tJAN \n\t\t\t\t(innocent)\n\t\tWhere's your Stuart from?\n\t\tSomewhere near there, isn't it?\n\n\t\t\tHANA\n\t\t\t\t(to Oliver)\n\t\tAs him what company he's with?\n\nOliver leans over, then turns to Hana.\n\n\t\t\tOLIVER\n\t\tThird Canadian Fusiliers.\n\n\t\t\tHANA\n\t\tDoes he know a Captain McGann?\n\nThe boy hears this, whispers to Oliver.\n\n\t\t\tCANADIAN SOLDIER\n\t\tHe bought it.  Yesterday.  Shot to bits.\n\nThe shells are getting closer.\n\n\t\t\tHANA\n\t\tWhat did he say?\n\n\t\t\tOLIVER\n\t\t\t\t(can't look at her)\n\t\tDoesn't know him.\n\nA SHELL SUDDENLY LANDS ON TOP OF THE SITE, PERHAPS FIFTY YARDS FROM THE \nTENT.  THE LIGHTS GO OUT.  THEN ANOTHER LANDS.\n\nEverybody is on the floor, struggling to get on a helmet.\n\nHana lies down, the blood still leaving her, her helmet on.  Oliver is \nnext to her in the mud.  Her heart is breaking.\n\n\t\t\tHANA\n\t\tHe's gone, hasn't he?\n\n\t\t\tOLIVER\n\t\tNo.  He's - no.\n\n\t\t\tHANA\n\t\tOh God.  Oh God.\n\nThe shells pound them, incredibly loud, drowning out her grief, but \neach explosion illuminates it for a moment.\n\n\n102\tINT.    THE MONASTERY KITCHEN.    NIGHT.\n\nCaravaggio comes into the kitchen.  Hana is slumped at the table, her \nback naked.  The jug of water in front of her.  She's sobbing, her \nshoulders heaving.  Caravaggio approaches tentatively.\n\n\t\t\tCARAVAGGIO\n\t\tHana?\n\t\t\t\t(he touches her shoulder)\n\t\tHana?  Are you alright?\n\n\t\t\tHANA\n\t\t\t\t(without raising her head)\n\t\tDon't touch me if you're going to\n\t\ttry and fuck me.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(soothing)\n\t\tI'll have some of your water.  It's hot.\n\nShe reaches for her blouse, wraps it around herself.  Her face is read \nwith weeping.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(gently)\n\t\tYou have to protect yourself from \n\t\tsadness.  This is the thing I've learned.\n\t\t\t\t(drinking the water)\n\t\tYou're in love with him, aren't you?\n\t\tYour patient.  Do you think he's a saint\n\t\tor something?  Because of the way he \n\t\tlooks?  I don't think he is.\n\n\t\t\tHANA\n\t\tI'm not in love with him.  I'm in love\n\t\twith ghosts.  And so is he.  He's in\n\t\tlove with ghosts.\n\n\t\t\tCARAVAGGIO\n\t\tWho are his ghosts?\n\n\t\t\tHANA\n\t\tAsk him.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(he holds up his hands)\n\t\tWhat if I told you he did this to me?\n\n\t\t\tHANA\n\t\t\t\t(stung)\n\t\tWhat?  How could he have?  When?\n\n\t\t\tCARAVAGGIO\n\t\tI'm one of his ghosts and he wouldn't\n\t\teven know.  It's like he slammed a\n\t\tdoor in Cairo and it trapped my \n\t\tfucking hands in Tobruk.\n\n\t\t\tHANA\n\t\tI don't know what that means.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(shrugs)\n\t\tAsk him.  Ask your saint who he is.\n\t\tAsk him who he's killed.\n\n\t\t\tHANA\n\t\t\t\t(furious)\n\t\tPlease don't creep around this house.\n\n\n103*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana sits reading from the Herodotus.  She shows the Patient the page \nwhere a CHRISTMAS CRACKER WRAPPER covered in handwriting has been glued \nin.\n\n\t\t\tHANA\n\t\tTell me about this, this is in your\n\t\thandwriting - December 22nd -\n\t\tBetrayals in war are childlike \n\t\tcompared with our betrayals during\n\t\tpeace.  New lovers are nervous and\n\t\ttender, but smash everything - for\n\t\tthe heart is an organ of fire...\n\t\t\t\t(she looks up)\n\t\tI love that, I believe that.\n\t\t\t\t(to him)\n\t\tWho is K?\n\n\t\t\tTHE PATIENT\n\t\tK is for Katharine.\n\n\n104\tEXT.  AMBASSADOR'S RESIDENCE, DECEMBER 1938.  DAY.\n\nA CHRISTMAS PARTY FOR THE TROOPS.  The incongruous attempts to create a \ntraditional Christmas in the dusty heat of Cairo.  \n\nThe Party is in the courtyard of the Moorish Palace which serves as the \nprivate residence of the British Ambassador, SIR RONNIE HAMPTON.  Lots \nof Wives, including LADY HAMPTON and Katharine help serve tea and cake \nto the SOLDIERS who sit at rudimentary tables with paper plates and \npaper hats.  A man dressed as SANTA CLAUS is giving out presents - \nPENGUIN PAPERBACKS, CHOCOLATE.  Music blares out from a loudspeaker.  \nOfficers and Civilians walk the parameter.  One of these, arriving, is \nAlmasy.  He sits in the shade, catches Katharine's attention.  \nKatharine brings him over a cup of tea and a plate with Christmas cake \non it.\n\n\t\t\tALMÁSY\n\t\tSay you're sick.\n\n\t\t\tKATHARINE\n\t\tWhat?  No!\n\n\t\t\tALMÁSY\n\t\tSay you're feeling faint - the sun.\n\n\t\t\tKATHARINE\n\t\t\t\t(but a frisson)\n\t\tNo.\n\n\t\t\tALMÁSY\n\t\tI can't work.  I can't sleep.\n\nLady Hampton calls impatiently.\n\n\t\t\tLADY HAMPTON\n\t\tKatharine!\n\n\t\t\tKATHARINE\n\t\tComing.\n\t\t\t\t(to Almásy)\n\t\tI can't sleep.  I woke up shouting\n\t\tin the middle of the night.  Geoffrey\n\t\tthinks it's the thing in the desert,\n\t\tthe trauma.\n\n\t\t\tALMÁSY\n\t\tI can still taste you.\n\n\t\t\tKATHARINE\n\t\t\t\t(waving at another woman who\npushes a trolley with teapots)\n\t\tThis is empty, just coming!\n\n\t\t\tALMÁSY\n\t\tI'm trying to write with your taste\n\t\tin my mouth.\n\t\t\t\t(as she leaves)\n\t\tSwoon.  I'll catch you.\n\nAlmásy sits watching the party.  The Santa Claus is dragged outside by \nsome excited Children.  Almásy picks at his cake removing the thick \nmarzipan icing.  He's writing on A CHRISTMAS CRACKER WRAPPER, smoothing \nit out - December 22nd.  Betrayals in war are childlike compared with \nout betrayals du...\n\nKatharine, attending to a raucous table, suddenly sags at the knees, \nand SWOONS.  People rush to her.\n\n\t\t\tKATHARINE\n\t\tI'm fine.  How silly.\n\n\t\t\tOFFICER'S WIFE\n\t\t\t\t(helping her to her feet)\n\t\tIt's the heat.\n\n\t\t\tLADY HAMPTON\n\t\tYou should sit down, darling.\n\t\t\t\t(to the others)\n\t\tShe's quite all right.\n\t\t\t\t(escorts Katharine away)\n\t\tAre you pregnant?\n\n\t\t\tKATHARINE\n\t\tI don't think so.\n\n\t\t\tLADY HAMPTON\n\t\t\t\t(squeezing her arm)\n\t\tHow romantic.  With Fiona I fell\n\t\tover every five minutes.  Ronnie\n\t\tChristened me Lady Downfall.\n\n\t\t\tKATHARINE\n\t\tI think I might go inside and sit\n\t\tdown for a few minutes.\n\n\t\t\tLADY HAMPTON\n\t\tI'll come with you.\n\n\t\t\tKATHARINE\n\t\tNo, please.  I shall be absolutely fine.\n\nThey pass Almásy, who doesn't look up from his book.\n\n\n105\tINT.  STORE ROOM.  AMBASSADOR'S RESIDENCE.  DAY.\n\nA small STOREROOM inside the Palace - Brooms, Mops, Cleaning Equipment.  \nOutside, the party is visible as opaque shadows through the beveled \nglass of the ornate window.  The sound of carols sung by the enlisted \nmen gives way to a version of SILENT NIGHT played on a solitary \nbagpipe.  Inside, ALMÁSY AND KATHARINE MAKE LOVE IN THE DARKNESS.  \nEverything is too fast, desperate, standing up, grabbing, hoisting \nclothes.\n\n\n106\tINT.    CORRIDORS.    AMBASSADOR'S RESIDENCE.    DAY.\n\nA CORRIDOR.  Almásy appears and almost immediately collides with the \nman dressed as SANTA CLAUS.  He moves to one side.  \n\n\t\t\tCLIFTON\n\t\tHave you seen Katharine?\n\n\t\t\tALMÁSY\n\t\t\t\t(taken aback)\n\t\tWhat?\n\n\t\t\tCLIFTON\n\t\tIt's Geoffrey under this.\n\n\t\t\tALMÁSY\n\t\tI haven't, no.  Sorry.\n\n\n106a*.\tINT.    SIDE ROOM IN AMBASSADOR'S RESIDENCE.    DAY.\n\nGeoffrey continues scouting the warren of tiny rooms that run off the \ncentral courtyard.  He finds Katharine sitting in one, smoking, \nsurrounded by oppressive and elaborate tiling.  Clifton wonders briefly \nhow Almásy had missed Katharine.\n\n\t\t\tCLIFTON\n\t\tDarling, I just heard.  You poor\n\t\tsausage, are you all right?\n\n\t\t\tKATHARINE\n\t\tI'm fine.  I got hot.\n\n\t\t\tCLIFTON\n\t\tLady H said she thought you might be -\n\n\t\t\tKATHARINE\n\t\tI'm not pregnant.  I'm hot.  I'm too hot.\n\n\t\t\tCLIFTON\n\t\tRight.\n\n\t\t\tKATHARINE\n\t\tAren't you?\n\n\t\t\tCLIFTON\n\t\tSweltering.\n\t\t\t\t(taking off his hat and beard)\n\t\tCome on, I'll take you home.\n\n\t\t\tKATHARINE\n\t\tCan't we really go home?  I can't breathe.\n\t\tAren't you dying for green, anything\n\t\tgreen, or rain, wouldn't you die to feel\n\t\train on your face?  It's Christmas and \n\t\tit's all - I don't know - if you asked me\n\t\tI'd go home tomorrow.  If you wanted.\n\n\t\t\tCLIFTON\n\t\tSweetheart, you know we can't go\n\t\thome, there might be a war.\n\n\t\t\tKATHARINE\n\t\t\t\t(poking at his costume)\n\t\tGeoffrey, you do so love putting\n\t\ton a disguise.\n\n\t\t\tCLIFTON\n\t\tI do so love you.\n\t\t\t\t(he kisses her head)\n\t\tWhat do you smell of?\n\n\t\t\tKATHARINE\n\t\tWhat?\n\n\t\t\tCLIFTON\n\t\tMarzipan!  I think you've got marzipan\n\t\tin your hair.  No wonder you're homesick.\n\n\n107*.\tINT.    THE PATIENT'S ROOM.    EVENING.\n\nThe Patient lies alone in his room.  CLIFTON'S FACE stares back at him \nfrom among the frescoes.  Then something distracts him.\n\n\t\t\tTHE PATIENT\n\t\tAre you outside?\n\nA beat and then Caravaggio shuffles in.  Like an old boxer.\n\n\t\t\tCARAVAGGIO\n\t\tI can't hide anymore.\n\t\t\t\t(jerks up his hands)\n\t\tI breathe like a dog.  I lose my\n\t\tbalance.  Stealing's got harder.\n\nCaravaggio stares at the Herodotus.\n\n\t\t\tCARAVAGGIO\n\t\tWhy do I feel if I had your book I\n\t\twould know everything?\n\n\t\t\tTHE PATIENT\n\t\tI don't even know if it is my book.\n\t\tThe Bedouin found it in the plane,\n\t\tin the wreckage.  It's mine now.  \n\t\tI heard your breathing and thought\n\t\tit might be rain.  I'm dying for rain -\n\t\tof course I'm dying anyway - but I\n\t\tlong to feel rain on my face.\n\nCaravaggio comes close, scrutinizing the face, trying to repair the \nfeatures.  Exasperated.\n\n\t\t\tCARAVAGGIO\n\t\tIs it you?  If I said Moose... I look\n\t\tdifferent, fuck, why shouldn't you?\n\n\t\t\tTHE PATIENT\n\t\t\t\t(impassive)\n\t\tMoose.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(a different tack)\n\t\tFirst wedding anniversary - what\n\t\tdo you call it?\n\n\t\t\tTHE PATIENT\n\t\tI don't know.  Paper.  Is it?  Paper?\n\t\t\t\t(sharp, not wanting to think)\n\t\tI don't remember.\n\n\n108\tINT.    MONASTERY LIBRARY.    DAY.\n\nHana stands at the PIANO.  It's still lop-sided, propped against the \nwall.  She tries but can't move it.  So she pulls off the dust-sheet \nand, with the instrument still on a tilt, begins to play the Aria from \nBach's Goldberg Variations.\n\n\n109\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHANA'S PIANO CONTINUES.  Upstairs, Caravaggio chats with the Patient \nwhile working his arms to RAISE A VEIN, a boot-lace tied around it, \npreparing an injection for himself, tapping the syringe.  During this:\n\n\t\t\tTHE PATIENT\n\t\tI have come to love that little tap of\n\t\tthe fingernail against the syringe.  Tap.\n\n\n110*.\tINT.    MONASTERY LIBRARY.    DAY.\n\nHana plays.  GUN SHOTS punctuates the music.  She's totally engrossed \nand only hears the second or third shot.  Her hands falter, she looks \nup to see A SIKH SOLDIER RUNNING ACROSS THE FIELD WAVING HIS ARMS, his \nREVOLVER held aloft.  He approaches the door, his face creased with \nanxiety, and raps on the shattered frame.  It's KIP.\n\nShe gets up and walks past Kip standing at the door, and continues the \nseven or eight feet to the right and out into the garden VIA THE HOLE \nRIPPED OUT OF THE WALL.\n\n\t\t\tHANA\n\t\tExcuse me.  Yes?\n\t\t\t\t(of the doors)\n\t\tI don't have the key to that door.\n\n\t\t\tKIP\n\t\tThe Germans were here.  The Germans \n\t\twere all over this area.  They left mines\n\t\teverywhere.  Pianos were their favorite\n\t\thiding places.  \n\n\t\t\tHANA\n\t\tI see.\n\t\t\t\t(then mischievous)\n\t\tThen may be you're safe as long as\n\t\tyou only play Bach.  He's German.\n\nKip is looking around the piano.  Hana giggles.\n\n\t\t\tKIP\n\t\tIs something funny?\n\n\t\t\tHANA\n\t\tNo, but, no, not at all.  I'm sorry.\n\t\tYou came to the doors, that's all and -\n\t\t\t\t(a little laugh)\n\t\t#NAME?\n\t\tworried about mines.  That's all.\n\n\t\t\tKIP\n\t\tI've met you before.\n\n\t\t\tHANA\n\t\tI don't think so.\n\nHana bends to see what Kip's looking at under the piano.  Wires run \nfrom the wall to the instrument onto which is taped an EXPLOSIVE \nCHARGE.   If Hana had succeeded in moving the piano she would have \ntriggered the charge.  Kip looks at Hana who conceals her dismay with a \nshrug.\n\n\n110a*.\tEXT.    THE MONASTERY GARDEN.    DUSK.\n\nAcross from the terrace, HARDY AND KIP ARE PUTTING UP THEIR TENTS.  \nCaravaggio stands, chatting amiably to them, holding a haversack, \nsmoking a cigarette.\n\n\n111*.\tINT.    THE PATIENT'S ROOM.    DUSK.\n\nHana looks down from the Patient's room, watching the tents go up.\n\n\t\t\tHANA\n\t\tHe wants us to move out, says there\n\t\tcould be fifty more mines in the building.\n\t\tHe thinks I'm mad because I laughed at\n\t\thim.  He's Indian, he wears a turban.\n\n\t\t\tTHE PATIENT\n\t\tSikh.  If he wears a turban, he's a Sikh.\n\nKip glances up at the window.  Hana, suddenly shy, backs away.\n\n\t\t\tHANA\n\t\tI'll probably marry him.\n\n\t\t\tTHE PATIENT\n\t\tReally?  That's sudden.\n\n\t\t\tHANA\n\t\tMy mother always told me I would\n\t\tsummon my husband by playing the piano.\n\nShe goes over to the Patient's bed.\n\n\t\t\tHANA\n\t\tI liked it better when there were\n\t\tjust the two of us.\n\n\t\t\tTHE PATIENT\n\t\tWhy?  Is he staying?\n\n\t\t\tHANA\n\t\tWith his Sergeant.  A Mr. Hardy.\n\n\t\t\tTHE PATIENT\n\t\tWe should charge!  Doesn't anyone\n\t\thave a job to do?\n\n\t\t\tHANA\n\t\tThey have to clear all the local roads\n\t\tof mines.  That's a big job.  They won't\n\t\tstay in the house.  They're putting up\n\t\ttheir tent in the garden.\n\n\t\t\tTHE PATIENT\n\t\tIn that case, I suppose we can't charge.\n\n\n112*.\tINT.    OFFICE, BRITISH HQ.    CAIRO.    DAY.\n\nA SMALL OFFICE, shared by two men, and a mountain of filing cabinets \nand paper.  There are AERIAL MAPS all over the walls.  Clifton is on \nthe telephone, while his colleague, RUPERT DOUGLAS, works at the desk.\n\n\t\t\tCLIFTON\n\t\t\t\t(into the phone)\n\t\tDarling, it's me, I'm sorry,\n\t\tsomething's come up.\n\t\t\t\t(Katharine responds)\n\t\tDon't sulk - I'll be back tomorrow\n\t\tevening.  I promise.\n\t\t\t\t(Katharine responds)\n\t\tOkay my precious, I love you.\n\nRupert makes a face at his friend's sentimentality.  Clifton beams.\n\n\t\t\tRUPERT\n\t\tI didn't know you were going anywhere?\n\n\t\t\tCLIFTON\n\t\tI'm not.  I'm going to surprise her.\n\t\tIt's our anniversary.  She's forgotten,\n\t\tof course.  What's the symbol for your\n\t\tfirst anniversary?  I should get something.\n\t\tIs it paper?\n\t\t\t\t(he knocks sharply on the wall)\n\t\tMoose!  Moose, you there?  First\n\t\tAnniversary - is it cotton?\n\n\t\t\tCARAVAGGIO\n\t\tIs what cotton?\n\n\t\t\tCLIFTON\n\t\tFirst Wedding Anniversary.\n\n\t\t\tRUPERT\n\t\t\t\t(of Clifton)\n\t\tHe's hopeless!\n\n\t\t\tCLIFTON\n\t\tYour day will come, my sausage.\n\n\t\t\tCARAVAGGIO\n\t\tYour first anniversary is Paper.\n\n\n113\tEXT.    CAIRO STREET.   O/S  SHEPHEARD'S HOTEL.    DAY.\n\nThe approach to the Shepheard's Hotel.  Geoffrey Clifton in a TAXI, \nchampagne between his knees.\n\nThe car ahead of them SCREECHES TO A HALT as a WOMAN hurries across the \nstreet.  The driver honks his horn angrily.  The woman puts up a hand \nin apology as she skips across the street to another taxi.  IT'S \nKATHARINE - she's dressed for a date, carries flowers, an overnight \nbag.\n\nGeoffrey, at first excited, is troubled by the accouterments.  Then he \nsees Katharine skip and his whole being punctures.\n\nKatharine's cab roars off.  His own car jerks forward.\n\n\t\t\tCLIFTON\n\t\tStop!\n\n\t\t\tCABBIE\n\t\tPlease?\n\n\t\t\tCLIFTON\n\t\tStop here.\n\n\t\t\tCABBIE\n\t\tYessir.\n\nGeoffrey sits in the cab.  Fifty yards short of the hotel.  The world \nrushes by.  He finds a cigarette.\n\n\n114\tINT.    ALMÁSY'S ROOMS.    LATE DAY.\n\nKatharine is in bed.  Almásy has just put A RECORD on.  It's the folk \nsong heard at the beginning of the film.  He slips back under the \ncovers.  Their clothes are scattered around the room.  He lies over a \nhappy Katharine.  She listens.\n\n\t\t\tKATHARINE\n\t\tThis is - what is this?\n\n\t\t\tALMÁSY\n\t\tIt's a folk song.\n\n\t\t\tKATHARINE\n\t\tArabic?\n\n\t\t\tALMÁSY\n\t\tNo, no, it's Hungarian.  My daijka\n\t\tsang it to me.\n\n\t\t\tKATHARINE\n\t\t\t\t(as they listen)\n\t\tIt's beautiful.  What's it about?\n\n\t\t\tALMÁSY\n\t\t\t\t(as if interpreting)\n\t\tIt's a long song - Szerelem means \n\t\tlove...and the story - there's a\n\t\tHungarian Count, he's a wanderer,\n\t\ta fool.  For years he's on some kind\n\t\tof quest, who knows what?  And then\n\t\tone day he falls under the spell of a\n\t\tmysterious English woman - a\n\t\tharpy - who beats him and hits him\n\t\tand he becomes her slave.  He sews\n\t\ther clothes, he worships the hem of -\n\nKatharine had thought for a few seconds he was serious, then she \ncatches on and starts to beat him.\n\n\t\t\tALMÁSY\n\t\t\t\t(laughing)\n\t\tOuch!  See - you're always beating me..!\n\n\t\t\tKATHARINE\n\t\tYou bastard, I was believing you!\n\nThey embrace, he lies over her, considering her naked back.\n\n\t\t\tALMÁSY\n\t\tI claim this shoulder blade - oh no,\n\t\twait - I want this!\n\nHe turns her over, kisses her throat, then traces the hollow \nindentation.\n\n\t\t\tALMÁSY\n\t\tThis - what's it called? - this place,\n\t\tI love it - this is mine!\n\t\t\t\t(Katharine doesn't know)\n\t\tI'm asking the King permission to\n\t\tcall it the Almasy Bosphorous.\n\n\t\t\tKATHARINE\n\t\t\t\t(teasing)\n\t\tI thought we were against ownership?\n\t\t\t\t(kissing him)\n\t\tI can stay tonight.\n\nThe luxury of this makes them both sad.  The duplicity.  Almásy rolls \naway on to his back.\n\n\t\t\tALMÁSY\n\t\tMadox knows, I think.  He's tried to\n\t\twarn me.  He keeps talking about\n\t\tAnna Karenina.  I think it's his idea\n\t\tof a man-to-man chat.  Its my idea\n\t\tof a man-to-man chat.\n\n\t\t\tKATHARINE\n\t\tThis is a different world - is what\n\t\tI tell myself.  A different life.\n\t\tAnd here I am a different wife.\n\n\t\t\tALMÁSY\n\t\tYes.  A different wife.\n\n\n115\tINT. CAB.  CAIRO STREET.  O/S SHEPHEARD'S HOTEL.  NIGHT.\n\nThe CAB DRIVER is asleep. A loud POP! jerks him awake.  In the back of \nthe car Geoffrey has opened the champagne.  He lets it overflow, then \ntakes a swig.  He notices the startled driver and puts up an apologetic \narm.\n\n\t\t\tCLIFTON\n\t\tSorry.\n\nTwo or three CHILDREN knock on the window, begging.  Geoffrey knocks \nback, violently.  They disappear.\n\n\t\t\tCABBIE\n\t\tHotel now, sir?\n\n\t\t\tGEOFFREY\n\t\tNo.\n\nAnd he throws a silencing wad of money onto the seat by the Cabbie.\n\n\n116\tEXT.    ALMASY'S HOUSE.    OLD CAIRO.    DAWN.\n\nAlmásy and Katharine wander out of his building and into the early \nmorning streets, hand in hand.\n\n\n117\tEXT.    SPICE MARKET.    CAIRO.    DAWN.\n\nThe MORNING PRAYERS rise out from the city's three Minarets.  Almásy \nstops at a stall, which is just preparing to open for the day.  He \npicks up a SILVER THIMBLE, points at it to the merchant who gives him a \nprice.  Without comment, Almásy produces the money and, beaming, hands \nthe thimble to Katharine.\n\n\t\t\tALMÁSY\n\t\tI don't care to bargain.\n\t\t\t\t(she smiles)\n\t\tIt's full of saffron, just in case\n\t\tyou think I'm giving it to you to\n\t\tencourage your sewing.\n\n\t\t\tKATHARINE\n\t\tThat day, had you followed me\n\t\tto the market?\n\n\t\t\tALMÁSY\n\t\tOf course.  You didn't need to slap\n\t\tmy face to make me feel as if you'd\n\t\tslapped my face.\n\n\t\t\tKATHARINE\n\t\t\t\t(loving him, but frightened)\n\t\tShall we be all right?\n\n\t\t\tALMÁSY\n\t\tYes.  Yes.\n\t\t\t\t(shrugs)\n\t\tAbsolutely.\n\n\n118\tEXT.    CAIRO STREET.    DAWN.\n\nKatharine takes leave of Almásy on the street corner away from the \nhotel entrance.  They don't kiss, there's no demonstration of feeling.  \nHe turns immediately away and disappears.\n\n\n119\tINT.  CAB.  CAIRO STREET.  O/S SHEPHEARD'S HOTEL.  DAY.\n\nGeoffrey, unshaven, watches as Katharine crosses the street and heads \ntowards the hotel.  His expression is terrible, trying to smile, his \nface collapsed.\n\n\n120\tINT.    THE PATIENT'S ROOM.    MORNING.\n\nCheek to Cheek leaks into the room from a GRAMOPHONE that Caravaggio \nstands over proudly.  The Patient opens his eyes - is confused, \ndislocated - stares blankly at Caravaggio.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(grinning)\n\t\tThought you'd never wake up!\n\n\t\t\tTHE PATIENT\n\t\tWhat?\n\nHana comes in, sleepily, frowns at the gramophone.\n\n\t\t\tHANA\n\t\tWhere did you find that?\n\n\t\t\tCARAVAGGIO\n\t\tI liberated it.\n\n\t\t\tHANA\n\t\tI think that's called looting.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(relaxed)\n\t\tNo-one should own music.  The real\n\t\tquestion is who wrote the song?\n\n\t\t\tTHE PATIENT\n\t\tIrving Berlin.\n\n\t\t\tCARAVAGGIO\n\t\tFor?\n\n\t\t\tTHE PATIENT\n\t\tTop Hat.\n\n\t\t\tCARAVAGGIO\n\t\tIs there a song you don't know?\n\n\t\t\tHANA\n\t\t\t\t(speaking for him)\n\t\tNo.  He sings all the time.\n\nShe goes over to the Patient and kisses him gently.\n\n\t\t\tHANA\n\t\tGood morning.\n\t\t\t\t(of his singing)\n\t\tDid you know that?  You're always singing?\n\n\t\t\tTHE PATIENT\n\t\tI've been told that before.\n\n\t\t\tHANA\n\t\tKip's another one.\n\nShe goes to the window, looks over to where the tents are pitched, sees \nHardy shaving, Kip IN THE PROCESS OF WASHING HIS HAIR, his turban \nHANGING LIKE A RIBBON between two trees to dry.  He's perched a bowl on \nthe sundial and is dipping his long coal-black hair into it.  As Hana \nwatches Kip, Caravaggio changes the record.  The Patient identifies it \nimmediately.\n\n\n121*.\tEXT.    MONASTERY GARDEN.     MORNING.\n\nHana walks past the tent, and passes Hardy.  She's carrying a small \ncup, which she's a little furtive about.  He's carrying a whole armada \nof OIL LIGHTS.  He nods upstairs.\n\n\t\t\tHANA\n\t\tHello.\n\n\t\t\tHARDY\n\t\tHello miss.\n\n\t\t\tHANA\n\t\tI was going to say - if you want to\n\t\teat with us, ever... you and Lieutenant\n\t\tSingh...\n\n\t\t\tHARDY\n\t\tVery kind of you, we can always eat in\n\t\tthe town with the others -\n\n\t\t\tHANA\n\t\tSince Caravaggio turned up - food\n\t\tseems to appear, so please.\n\n\t\t\tHARDY\n\t\tI'll ask the Lieutenant.  But thank you.\n\n\t\t\tHANA\n\t\tYou saved my life.  I haven't forgotten.\n\t\t\t\t(Hardy waves that away)\n\t\tI thought you were very very tall.  You\n\t\tseemed to big - a Giant - and I felt\n\t\tlike a child who can't keep her balance.\n\n\t\t\tHARDY\n\t\t\t\t(does a little mime)\n\t\tA toddler\n\nShe goes on, and tentatively approaches Kip, who's still working at his \nhair.  Kip hears her and puts out an inquiring arm, moving towards her \nlike a blink man through the curtain of hair.  He touches her.\n\n\t\t\tHANA\n\t\tSorry, is it all right I'm seeing this?\n\nKip shrugs.\n\n\t\t\tHANA\n\t\tMy hair was long.  At some point.  \n\t\tI've forgotten what a nuisance it is\n\t\tto wash.  You know - if you were ever\n\t\taround - we get water from the pump\n\t\tat noon.\n\nHe continues to wash.  She holds up the cup of oil.\n\n\t\t\tHANA\n\t\tTry this.  I found a great jar of it.  \n\t\tOlive oil.  In Naples this was so\n\t\tprecious it would have bought you a wife.\n\n\t\t\tKIP\n\t\tThank you.\n\nShe stands for a second, then walks away.  Kip examines the oil, calls \nafter her.\n\n\t\t\tKIP\n\t\tFor my hair?\n\n\t\t\tHANA\n\t\t\t\t(turning, smiling)\n\t\tYes, for your hair.\n\n\n122\tEXT.    THE MONASTERY.    HANA'S GARDEN.    DAY.\n\nHANA IS GARDENING, close to the crucifix, which is now a full-fledged \nScarecrow.  Broken bottles, fragments of stained glass and shards from \na mirror are hung from the crossbar, syringes too, all jangling and \ntinkling and catching the sunlight.\n\nKip and Hardy drive off to work on their motorcycles.  She watches \nthem, catching Kip's careless wave to her.  She looks briefly at \nherself in A PIECE OF MIRROR dangling from the Scarecrow.\n\n\n123\tINT.    THE MONASTERY.    UPSTAIRS LANDING.    DAY.\n\nHana walks along the landing with a tray.  There's a message on several \ndoors in the corridor from Kip: SAFE, then a couple with the warning: \nDANGER.  She hears noise from the Patient's room.  Listens for a second \nbefore going in.\n\n\t\t\tTHE PATIENT (O/S)\n\t\tBecause you're reading it too fast!\n\n\t\t\tTHE PATIENT (O/S)\n\t\tNot at all.\n\n\t\t\tTHE PATIENT (O/S)\n\t\tYou have to read Kipling slowly!\n\t\tYour eye is too impatient - think\n\t\tabout the speed of his pen.\n\t\t\t\t(quoting Kipling to demonstrate)\n\t\tWhat is it - He sat comma in defiance\n\t\tof municipal orders comma astride the\n\t\tgun Zamzammah on her brick... What is it?\n\n\n124\tINT.    THE PATIENT'S ROOM.    DAY.\n\nDuring this, Hana comes through with the tray, finds Kip perched on the \nwindow, relishing his skirmish with the Patient, who has condensed milk \ndribbling down his neck.\n\n\t\t\tKIP\n\t\tBrick platform opposite the old\n\t\tAjaib-Gher -\n\n\t\t\tTHE PATIENT\n\t\t#NAME?\n\t\tnatives called the Lahore Museum.\n\n\t\t\tKIP\n\t\tIt's still there, the cannon, outside the\n\t\tmuseum.  It was made of metal cups\n\t\tand bowls taken from every household\n\t\tin the city as tax, then melted down.\n\t\tThen later they fired the cannon at my\n\t\tpeople - comma - The natives.\n\n\t\t\tTHE PATIENT\n\t\tSo what do you really object to - the\n\t\twriter or what he's writing about?\n\n\t\t\tKIP\n\t\tWhat I really object to, Uncle, is\n\t\tyour finishing all my condensed milk.\n\t\t\t\t(snatching up the empty can)\n\t\tAnd the message everywhere in your\n\t\tbook - however slowly I read it - that\n\t\tthe best destiny for India is to be ruled\n\t\tby the British.\n\n\t\t\tTHE PATIENT\n\t\tHana, we have discovered a shared\n\t\tplease - the boy and I.\n\n\t\t\tHANA\n\t\tArguing about books.\n\n\t\t\tTHE PATIENT\n\t\tCondensed milk - one of the truly\n\t\tgreat inventions.\n\n\t\t\tKIP\n\t\t\t\t(grinning, leaving)\n\t\tI'll get another tin.\n\nHana and the Patient are alone.\n\n\t\t\tHANA\n\t\tI didn't like that book either.  It's\n\t\tall about men.  Too many men.\n\t\tJust like this house.\n\n\t\t\tTHE PATIENT\n\t\tYou like him, don't you?  Your\n\t\tvoice changes.\n\n\t\t\tHANA\n\t\tI don't think it does.\n\t\t\t\t(a beat)\n\t\tAnyway, he's indifferent to me.\n\n\t\t\tTHE PATIENT\n\t\tI don't think it's indifference.\n\nKip comes bounding in with a fresh can.\n\n\t\t\tTHE PATIENT\n\t\tHana was just telling me that you\n\t\twere indifferent -\n\n\t\t\tHANA\n\t\t\t\t(appalled)\n\t\tHey! - \n\n\t\t\tTHE PATIENT\n\t\t#NAME?\n\n\t\t\tKIP\n\t\tWell, I'm indifferent to cooking, not\n\t\tHana's cooking in particular.\n\t\t\t\t(stabbing at the tin with a bayonet)\n\t\tHave either of you ever tried \n\t\tcondensed milk sandwiches?\n\n\n125\tDELETED.\n\n\n126.\t\t\t\tINT.    THE PATIENT'S ROOM.   MORNING.\n\nCaravaggio and the Patient are singing - an Arab song which they both \nknow from Cairo days.  THUNDER accompanies them.  It's pouring.  \nSuddenly the door is flung open and HANA, KIP and HARDY appear.  They \nhave the stretcher with them.\n\n\n127*.\tEXT.    THE MONASTERY CLOISTERS.    MORNING.\n\nA whoop precedes THE HEADLONG RUSH OF KIP, HARDLY and CARAVAGGIO as \nthey cart the Patient across the Cloisters like manic stretcher-\nbearers.  Hana is with them, holding an umbrella over the Patient who \nbounces uncomfortably.  He is nervous, a little giddy.  The rain \nbuckets down.\n\n\t\t\tTHE PATIENT\n\t\t\t\t(no irony)\n\t\tCareful - careful!\n\n\n127a*.\tEXT.    THE MONASTERY GARDEN.    MORNING.\n\nThe storm tour includes a trip around the pond.  The Patient pushes \naway the umbrella, lets the rain drench him.   He grins at Hana.\n\n\t\t\tTHE PATIENT\n\t\tThis is wonderful!\n\n\t\t\tKIP\n\t\t\t\t(to Hana)\n\t\tWhat's he saying?\n\n\t\t\tHANA\n\t\tHe's saying it's wonderful!\n\n\n128*.\tINT.  LIBRARY OF THE DEPARTMENT OF EGYPTOLOGY.  DAY.\n\nMadox and Almásy are camped in one corner of THE LIBRARY, hunched over \ntheir maps and papers and journals and clashing furiously over the site \nof the next part of the expedition.\n\n\t\t\tMADOX\n\t\t\t\t(pushing away his charts)\n\t\tAnd I'm telling you there's nothing\n\t\tthere to explore.\n\n\t\t\tALMÁSY\n\t\tNo, because you can't see from the air!\n\t\tIf you could explore from the air life\n\t\twould be very simple!\n\t\t\t\t(he yanks up a map)\n\t\tLook!  What is that?  Is that a wadi?\n\t\tThat whole spur is a real possibility...\n\n\t\t\tMADOX\n\t\tWhich we've overflown twice.\n\n\t\t\tALMÁSY\n\t\tWhich we couldn't explore because\n\t\tof rocks, because of cross-winds,\n\t\tit's sloppy.\n\t\t\t\t(stabbing another location)\n\t\tAnd here - and here - we could be\n\t\tstaring at Zerzura.\n\n\tOther readers look over at this unseemly skirmish.\n\n\t\t\tMADOX\n\t\tSo - on Thursday you don't trust\n\t\tBell's map - Bell was a fool, Bell\n\t\tcouldn't draw a map, but on Friday\n\t\the's suddenly infallible?\n\nAlmásy is surprised by Madox' anger.\n\n\t\t\tMADOX\n\t\tAnd where are the Expedition Maps?\n\n\t\t\tALMÁSY\n\t\tIn my room.\n\n\t\t\tMADOX\n\t\tThose maps belong to His Majesty's\n\t\tGovernment.  They're confidential.\n\t\tThey shouldn't be left lying around\n\t\tfor any Tom, Dick or Mary to have\n\t\tsight of.\n\n\t\t\tALMÁSY\n\t\tWhat's the matter with you?\n\n\t\t\tMADOX\n\t\tDon't be so bloody naïve.  You know\n\t\tthere's a war breaking out.\n\t\t\t\t(he tosses a slip of paper onto\nthe map, recites its message)\n\t\tThis arrived this morning.  By order\n\t\tof the British Government - all\n\t\tInternational Expeditions to be\n\t\taborted by May 1939.\n\n\n129\tINT.   CAIRO STREET.   DAY.\n\nAlmásy and Madox walk down this busy and rather narrow street without \npavements.  Both of them somber.\n\n\t\t\tALMÁSY\n\t\tWhy do they care about our maps?\n\n\t\t\tMADOX\n\t\tWhat do we find in the desert?  Arrow\n\t\theads, spears.  In a war, if you own the\n\t\tdesert, you own North Africa.\n\n\t\t\tALMÁSY\n\t\t\t\t(contemptuous)\n\t\tOwn the desert.\n\nAlmásy hesitates at a junction, clearly about to take leave of Madox.\n\n\t\t\tALMÁSY\n\t\tThat place at the base of a woman's\n\t\tthroat?  You know - the hollow - here -\n\t\tdoes that have an official name?\n\nMadox looks at him.\n\n\t\t\tMADOX\n\t\tFor God's sake, man - pull\n\t\tyourself together.\n\n\n130\tINT.    OPEN-AIR CINEMA.    CAIRO.    EVENING.\n\nThe OPEN-AIR CINEMA is just beginning its evening programme.\n\nPATHE NEWS BEGINS and we date the event to April 1939.  Stories of \nimminent war jostle with images of Merrie England.  Village greens, \nsporting victories, Cruft's Dog Show.  Alone among the necking couples \n- mostly soldiers with their Egyptian girlfriends - in an otherwise \nempty block, is Katharine.  She's waiting for Almásy.  A SOLDIER comes \nover to Katharine's row and settles a couple of seats away from her.\n\n\t\t\tSOLDIER\n\t\tBeggin your pardon, miss, but have\n\t\tyou got a lighter?\n\nKatharine lights his cigarette and returns to the screen.  An item \nabout Fred Astaire and Ginger Rogers and TOP HAT.  The stars do their \nstuff.  The soldier moves a seat nearer.\n\n\t\t\tSOLDIER\n\t\t\t\t(leering)\n\t\tI love Ginger, she's a foxy girl, ain't she?\n\n\t\t\tKATHARINE\n\t\tFuck off.\n\n\t\t\tSOLDIER\n\t\tWhat?\n\n\t\t\tKATHARINE\n\t\tYou heard me.\n\nThe Soldier slinks off, muttering.  Katharine is wretched.  She sits \nhead down, not watching the screen, marooned in her despair about \nduplicity, sordid assignations.\n\nAlmásy arrives, slides in beside Katharine, his shadow momentarily \nlarge across the screen.\n\n\t\t\tALMÁSY\n\t\tSorry.\n\nThey watch the screen.  Katharine is weeping.  Almásy doesn't \nunderstand.  He puts his arm around her.\n\n\t\t\tKATHARINE\n\t\tI can't do this, I can't do this any more.\n\n\n131*.\tEXT.    GROPPI PARK.    CAIRO.    EVENING.\n\nA man walks round with A HAND BELL - announcing that the Park is \nclosing.  He turns off the gaslights which illuminate the animal cages.  \nAlmásy and Katharine sit stiffly on a bench.  They don't speak.  Almásy \nputs his hands to his head, he rubs his shoulders.  The lights are \ngradually being extinguished around them.\n\n\tFinally, Katharine gets up.\n\n\t\t\tKATHARINE\n\t\tI'd better get back.\n\t\t\t\t(she keeps him away with a hand)\n\t\tSay goodbye here.\n\n\t\t\tALMÁSY\n\t\tI'm not agreeing.  Don't think I'm\n\t\tagreeing, because I'm not.\n\nThey stand, awkward.  Katharine rehearses her position.  The bell \nclangs.\n\n\t\t\tKATHARINE\n\t\tI just know - any minute he'll find out,\n\t\twe'll barge into somebody we'll - and it\n\t\twill ill him.\n\n\t\t\tALMÁSY\n\t\tDon't go over it again, please.\n\nHe takes her hands, lays his cheeks into them, then releases them, gets \nup, walks away.  She walks towards the gate.  He calls after her.\n\n\t\t\tALMÁSY\n\t\tKatharine -\n\n\tHe walks towards her, his smile awful.\n\n\t\t\tALMÁSY\n\t\tI just wanted you to know.\n\t\tI'm not missing you yet.\n\nShe nods, can't find this funny.\n\n\t\t\tKATHARINE\n\t\tYou will.  You will.\n\nThen she turns sharply from him and catches her head against the \ngatepost, staggers at the shock of it, then hurries away.\n\n\n132*.\tINT.    THE PATIENT'S ROOM.    MORNING.\n\nHana sits with the English Patient - the room shuttered against the \nmorning light.  His breathing is noticeably worsening, a shudder of a \nbreath, the shallow rise and fall of his chest perceptible.  Hana \nfrets, touches his wrist, feeling for the pulse.\n\n\t\t\tTHE PATIENT\n\t\tI'm still here.\n\n\t\t\tHANA\n\t\tYou'd better be.\n\n\t\t\tTHE PATIENT\n\t\tDon't depend on it.  Will you?\n\t\tThat little bit of air, each day\n\t\tthere's less of it, which is al right,\n\t\twhich is quite all right.\n\nShe squeezes his hand, suddenly overwhelmed.\n\n\t\t\tTHE PATIENT\n\t\t\t\t(brightly)\n\t\tI've been talking to Caravaggio - my\n\t\tresearch assistant - there's meant to be\n\t\ta ghost in the Cloisters.  I can join him!\n\nThere's some kind of noise from the garden.  Muffled shouts.\n\n\t\t\tTHE PATIENT\n\t\tIt's the boy.\n\nHana goes to the window, opens the shutters.  The day pours in.\n\n\n132A*.\tEXT.    MONASTERY OLIVE GROVES.    DAY.\n\nHana sees Kip - barely visible - standing at the far perimeter of the \ngarden in the olive groves, HIS HANDS RAISED ABOVE HIM, HIS LEG HELD \nOUT STRANGELY.  WIRES run from his foot in all directions as if he'd \ntrodden in some elaborate steel cobweb.\n\n\n133\tEXT.    MONASTERY OLIVE GROVES.    DAY.\n\nHana appears at the edge of the Olive groves and hurries towards Kip, \nwho hasn't moved.  He shouts warning her.\n\n\t\t\tKIP\n\t\tGo to the left!  Keep to the left!  There\n\t\tare mines and trip wires everywhere!\n\nHana stops, hoists up her skirt and circles left, tentative in the long \ngrass.  He shouts, doesn't want her close.\n\n\t\t\tKIP\n\t\tGet Hardy.  He's on the other side of \n\t\ttown.  In the hills.  Get him to hurry.\n\nShe keeps coming, can see that he needs her.\n\n\t\t\tHANA\n\t\tIt's okay - I'll help.  Please.\n\n\t\t\tKIP\n\t\tThe mines, the wires, there's a trick.\n\t\tSome explode if you stretch the wires,\n\t\tsome if you cut them.\n\n\t\t\tHANA\n\t\tWhat do I do?\n\n\t\t\tKIP\n\t\tThere's a mine here, but the others are\n\t\tfar enough away, I think at least to\n\t\tgive me a chance.  I have to work out\n\t\twhich one to cut before I fall over.\n\n\t\t\tHANA\n\t\tSo I follow the wires?\n\n\t\t\tKIP\n\t\tYou get Hardy.\n\n\t\t\tHANA\n\t\tI follow the wires.\n\nShe kneels at his feet and tries to trace the tangled route of the web.\n\n\t\t\tKIP\n\t\tDon't touch them.\n\nShe follows one wire back to the closest mine, and traces another back \nto Kip's foot.  Then she finds another one leading off to a second mine \nsome thirty metres away.\n\n\t\t\tHANA\n\t\tWhy would anyone do this?\n\n\t\t\tKIP\n\t\tI've done this.  I've had to do this.\n\n\tThen Hana's suddenly tense.\n\n\t\t\tHANA\n\t\tGive me a second.\n\nShe turns and tiptoes RIGHT THROUGH THE DANGER AREA, straight to what \nhad seized her attention.  Kip is appalled.\n\n\t\t\tKIP\n\t\tWhat are you doing?!  Hana!\n\nHeedless, she dodges another mine and its web of wires just as THE \nTORTOISE clambers onto a clump of rock, which is, in fact, ANOTHER \nCONCRETE-COVERED MINE.\n\nHana snatches him up as he ambles towards the metal.  She turns, \nholding the protesting animal in triumph.  HER FOOT SNAGS ON A WIRE.  \nShe has to ease it off, in arabesque, still clutching the tortoise.   \nShe goes sideways to the safe zone - setting down the animal.  Then \nshe's back with Kip.  He's seething.  She is strangely elated.\n\n\t\t\tKIP\n\t\tWhat is this business with you and\n\t\texplosives?  Do you think you're immune?\n\n\t\t\tHANA\n\t\tI promise you that was the right thing\n\t\tto do.  He's my good luck.\n\t\t\t\t(she gets the pliers from his belt,\nand hands them to him)\n\t\tNow cut.  This one.\n\t\t\t\t(she indicates the wire)\n\t\tI hope we don't die.\n\n\t\t\tKIP\n\t\tOkay.  Get away from here.  Quick.\n\n\t\t\tHANA\n\t\tI'm not scared.  So many people have\n\t\tdied around me.  But I would be a\n\t\tshame for us.\n\t\t\t\t(shrugs)\n\t\tI don't feel like being shy.\n\n\t\t\tKIP\n\t\tYou must get away.  Before I cut.  I'm\n\t\tnot cutting if you're here.\n\nHe's struggling.  He's going to topple over if he cuts.\n\n\t\t\tHANA\n\t\tActually, you can't cut, can you?\n\t\tYou'll fall over.  Give me the pliers.\n\n\t\t\tKIP\n\t\tNo.\n\nBut he hands them over.\n\n\t\t\tHANA\n\t\tKiss me.  Before I cut.  Just in case.\n\n\n\t\t\tKIP\n\t\tDon't talk.  Check again.  Lie flat and\n\t\tthen cut.\n\nHana checks, lies down.  He bends as close to the ground as he dares \nAND KISSES HER, THEN SHE IMMEDIATELY CUTS.\n\n\n134\tINT.    THE PATIENT'S ROOM.    CONTINUOUS.\n\nThe Patient lies in bed.  He's agitated by the silence.  SUDDENLY \nTHERE'S AN EXPLOSION.  He tries to shout, a croak which quickly reduces \nhim to coughing and breathlessness.\n\n\t\t\tTHE PATIENT\n\t\tHana!  Hana!  Kip!  Hana!\n\nHe tries to move.  He can't.  He's frantic.\n\nFOOTSTEPS, as someone hurtles up the stairs.  It's Hana.  She's ashamed \nto have forgotten him.  She rushes to him.\n\n\t\t\tHANA\n\t\tI'm sorry.  I forgot you'd be worrying.\n\t\tWe're all safe.  It was a mine, but not\n\t\tthe mine.  Nobody's hurt.  I'm sorry.\n\nShe calms him.  He's exhausted.  His eyes shine.\n\n\n135\tEXT.    MOUNTAIN ROAD.    ITALY.    LATE DAY.\n\nHana clings onto Kip as the TRIUMPH MOTORCYCLE hares along the circling \nroad.  She has her arms around his waist.  His head turns to her for a \nsecond and she smiles.\n\n136\tEXT.    ROAD BLOCK.    TUSCANY.    DUSK.\n\nKip and Hana have been detained at a ROAD BLOCK.  Kip is being \nquestioned at a sentry post, his papers over-thoroughly inspected and \naccompanied by several meaningful glances at Hana, who waits, standing \nby the motorcycle.  One of the SOLDIERS saunters over and returns her \npapers.\n\n\t\t\tSOLDIER\n\t\tAnd you're definitely traveling with\n\t\thim of your own free will?\n\n\t\t\tHANA\n\t\tYes.\n\n\t\t\tSOLDIER\n\t\t\t\t(clearly disapproving)\n\t\tJust wanting to be sure.  And he's\n\t\ttaking you to church?\n\n\t\t\tHANA\n\t\t\t\t(deadpan)\n\t\tYes.  We're going to a funeral.  A cow has\n\t\tdied.  And in his religion they're sacred.\n\nThe Soldier isn't sure what to make of this.  He signals to his \ncompanion who returns Kip's papers.  Kip walks back to the motorcycles.  \nHe says nothing.  He kicks the starter.  Hana gets on, slides her arms \nlovingly around him.\n\n\n137\tEXT.    BRIDGE.    ITALY.    DUSK.\n\nIT'S GETTING DARK.  The bike, headlights on, crosses a bridge.  Kip has \nstrapped on his crimson emergency light as they sail along the winding \ncrest of mountain ridge that is a spine down Italy.\n\n\n138\tEXT.    AREZZO.   DUSK.\n\n\tKip steers the motorbike into the deserted PIAZZA.\n\nThey dismount and Kip starts to unbuckle his bulging satchel and unload \nthe panniers.  Hana still doesn't know what's in store and looks \nquestioningly at Kip as he walks up to the door of the CHURCH.\n\n\n139\tINT.    CHURCH.    DUSK.\n\nThey enter the Church.  It's in almost total darkness.  THEN A FLARE \nSUDDENLY ILLUMINATES THE INTERIOR.  It's magnificent.  Kip holds the \nflare, crimson on one arm, green pouring up from the other.  Hana walks \nbehind him, still perplexed.  There is PROTECTIVE SCAFFOLDING \nEVERYWHERE, AND SANDBAGS PILED UP HIGH AROUND THE ALTARS, AND THE \nSTATUES.\n\nA SECOND FLARE.  Kip has appeared through A SECRET DOOR high in the \nchurch, literally emerging from one of the frescoes which are \nmomentarily visible.  He flings a rope over the rafters.\n\nNow Kip circles Hana with the rope, MAKING A SLING across her waist and \nshoulder.  He lights a smaller flair and hands it to her before \ndisappearing.\n\nHana stands holding the flare.  She can't see Kip, can only hear him \nscrambling.\n\n\t\t\tHANA\n\t\tKip?\n\nHe runs up the sandbags, right up into the rafters.  He collects the \nother end of the rope which is attached to Hana.  Holding onto it, he \njust STEPS OFF INTO THE DARKNESS.\n\nSIMULTANEOUSLY HANA IS SWUNG UP INTO THE AIR, her startled yelp echoing \naround the Church.  Kip touches ground, while Hana swings through \nspace, coming to rest about three feet from the FRESCOED WALLS, painted \nby Piero Della Francesca.  Hana's flare makes a halo around her head.\n\nNow Kip, on the ground, still holding the rope, walks forward and \ncauses Hana to SWING to the right.  She lets out a giddy laugh, \nexhilarated and nervous, and she flies, illuminating - en passant - \nfaces, bodies, angels.  Kip guides the rope as if they were making \nlove, which in a way they are.\n\nHana arrives, hovering, in front of THE QUEEN OF SHEBA TALKING TO \nSOLOMON. She's overwhelmed.  She reaches out to touch the giant neck of \nthe sad Queen.\n\nKip slowly lets her down, paying out the length of the rope.  Hana's \nface is full of tears.  He smiles, holds her.\n\n\n140\tINT.    THE PATIENT'S ROOM.    EVENING.\n\nCaravaggio is with the Patient.  He sits in the window.  Fiddles with \nthe bandages of his hands.\n\n\t\t\tTHE PATIENT\n\t\tThere was a general who wore a patch\n\t\tover a perfectly good eye.  The men \n\t\tfought harder for him.  Sometimes I\n\t\tthink I could get up and dance. \n\t\tWhat's under your bandages?\n\nCaravaggio goes to him, holding out his hands, the bandage ends \ntrailing.\n\n\t\t\tCARAVAGGIO\n\t\tHold the ends.\n\nThe Patient holds them.  Caravaggio walks backwards, the bandages \nunraveling and unraveling.  \n\n\n141*.\tINT.  TOBRUK.  BRITISH HEADQUARTERS.  JUNE 1942.  DAY.\n\nCaravaggio, thumbs intact and wearing a crumpled linen suit, walks \nthrough the mangled corridors of British HQ.  Smoke is rising from \nbuildings, the ominous scream of Stuka dive-bombers in the distance as \nthe harbor is pounded, the steady thud of explosions.  TOBRUK IS UNDER \nSIEGE.  BHQ is a place in the throws of dismantling itself.  \nSECRETARIES are visiting braziers manned by ARAB BOYS who stoke the \nfires as boxes of papers are fed into them.  ASHES hover in the air.\n\n\n142*.\tINT.   BHQ.    TOBRUK.    DAY.\n\nCaravaggio walks through a large room crowded with desks.  From one of \nthem, a young woman, AICHA, kisses him, frowning at the chaos and the \nshelling.\n\n\t\t\tAICHA\n\t\tHe's waiting for you.\n\nSome doors are open, revealing men and women in uniform urgently \nSHREDDING DOCUMENTS.  Caravaggio knocks at an office whose door is ajar \nand where the incumbent, FENELON-BARNES, is stripping the room of his \npersonal possessions-  photographs, stone branches, a cricket bat.\n\n\n142a*.\tINT.   FENELON-BARNES OFFICE.   BHQ.   TOBRUK.   DAY.\n\nCaravaggio enters.\n\n\t\t\tFENELON-BARNES\n\t\t\t\t(barely looking up)\n\t\tWhat a bloody flap, eh?  I heard from\n\t\tAlexandria this morning - apparently\n\t\tno-one there is accepting British pounds.\n\t\tAnd if you pick up a telephone \n\t\teverybody's practicing their German.\n\t\t\t\t(holds up some gramophone records)\n\t\tWhat do you do - do you take these\n\t\tthings?\n\t\t\t\t(then, awkward)\n\t\tLook, Moose, we need you to stay in\n\t\tTobruk.  A bit of a short straw but\n\t\tthe thinking is we'll be back - I mean,\n\t\twe will be back - but...and in the\n\t\tinterim we need eyes and ears on\n\t\tthe ground.\n\nA BIG BOMB lands nearby.  The building shudders and plaster dust drops \nfrom the ceiling.  Almost oblivious, the two men head out of the \noffice.  Fenelon-Barnes lugs the TRUNK last glimpsed in his tent by \nAlmásy, until Caravaggio takes over.\n\n\n143*.\tINT. CORRIDOR OF BRITISH HEADQUARTERS. TOBRUK. DAY.\n\nFenelon-Barnes and Caravaggio make their way down the stairs and to the \nentrance.\n\n\t\t\tCARAVAGGIO\n\t\tWe have 30, 000 troops in Tobruk.\n\t\tWhat are they going to be doing?\n\n\t\t\tFENELON-BARNES\n\t\t\t\t(continuing to pack)\n\t\tGiving Rommel a bloody nose. That's\n\t\tmy suggestion.  But did you hear\n\t\tthe BBC last nigh?  Tobruk is of no\n\t\tstrategic importance - makes you wonder.\n\nAICHA is at the bottom of the stairs.  She falls into step.\n\n\t\t\tFENELON-BARNES\n\t\tJerry's got our maps you know.  Swines.\n\t\tBefore the war we helped them run about\n\t\tthe desert making maps - and now they\n\t\tget spies into Cairo using our maps, they'll\n\t\tget Rommel into Cairo using our maps.\n\t\tThe whole of the desert like a bus route\n\t\tand we gave it to them.   Any foreigner who\n\t\tturned up - welcome to the Royal Geographic,\n\t\ttake our maps.  Madox went mad, you know -\n\t\tyou knew Peter Madox? - after he found\n\t\tout he'd been betrayed by his friend.\n\t\tAbsolutely destroyed the poor sod.  Shot\n\t\thimself in a church in Dorset.\n\nCaravaggio opens the door, Fenelon-Barnes goes through.\n\n\n144*.\tEXT.    BRITISH HEADQUARTERS.    TOBRUK.    DAY.\n\nThe Fenelon-Barnes trunk is taken from Caravaggio and joins the pile of \nluggage and artifacts, which wait to be shipped out.\n\n\t\t\tFENELON-BARNES\n\t\tI'd like to get that bastard Almásy -\n\t\tsettle the score, eh?  That's my\n\t\tfantasy - said he, clearing out.\n\t\tMust have been a spy all along.\n\n\n145\tDELETED.\n\n\n146*.\tEXT.    TOBRUK DOCKSIDE.    DAY.\n\nA GERMAN TROOP CARRIER rumbles forward passing a line of BEDRAGGLED \nBRITISH POWS as they're marched along the side of harbor.\n\n\n146a*. EXT.    TOBRUK RUINED QUARTER.    DAY.\n\nA HILL OF SALVAGED ARMY BOOTS is being explored by a couple of GERMAN \nSOLDIERS in search of better footwear.  Below them the POWS trudge by, \none of them barefoot.  ONE OF THE GERMANS tosses down a pair of boots \nthen continues his own perusal.\n\n\n146b*. EXT.    TOBRUK SQUARE.    DAY.\n\nA crowd of Tobruk CIVILIANS - French and Italians among the MOSTLY ARAB \nFACES.  Their papers are being thoroughly checked by officers sitting \nat open desks. IN A LINE, WEARING HIS SHABBY SUIT, IS CARAVAGGIO.  AN \nARAB WOMAN in front of him is arguing over the identity of her \nominously CAUCASIAN-LOOKING CHILD.  An INTERPRETER mediates.  The \nOFFICER doesn't believe the woman.  She's getting frantic at the \npossibility of losing her child.\n\nSuddenly there's a disturbance as a WOMAN is dragged along the line by \nher hair.  She's bloodied, and has been tortured, and it's hard to \nrecognize her as the pretty AICHA.  She touches a couple of people in \nthe line.  They're horrified.  Soldiers pull them away.  Caravaggio \ndoesn't look, stares straight ahead.  An officer watches him AS HE \nTURNS BRIEFLY AND HELPLESSLY OUT OF CONCERN FOR HER.  THEIR EYES CATCH \nFOR AN INSTANT AND THE OFFICER SEES IT.\n\nCARAVAGGIO RUNS, bolts for cover, vaulting the rubble which blocks one \ncorner of the square.  The CONGREGATION throws itself to the ground \nuntil the square has only standing soldiers and a running man.\n\n\n146c*. EXT.   TOBRUK.   INTERIOR OF RUINED BUILDING.   DAY.\n\nShots pursue Caravaggio as he disappears behind the rubble, then bobs \nup again as he darts inside a blasted building.  He clambers up some \nruined stairs, heaves over the wall.\n\n\n146d*. EXT.   TOBRUK.   FACADE OF RUINED BUILDING.   DAY.\n\nCARAVAGGIO grabs a metal bar on the facade of the building, from which \nhe hangs, looking for the next foothold.  Soldiers appear along the top \nof the building, shouting, rifles ready.  AN OFFICER arrives and stops \nthe soldiers firing, and the others begin to laugh as Caravaggio hangs \nfrom the bar fifteen feet above a balcony, slowly losing his strength.  \nAnother SOLDIER waits for him in the balcony below.  Now he starts to \nlaugh.  Caravaggio hangs.\n\n\n147*.\tINT. INTERROGATION ROOM. TOBRUK. NOVEMBER 13,1942. DAY.\n\nCaravaggio is slumped at a table, HIS HANDS MANACLED TO ITS THICK \nWOODEN LEGS.  There's A TELEPHONE at another table in the corner of the \nroom attended by a CLERK with A STENOGRAPHER working next to him.  The \nroom has stone walls which appear damp, and no windows.  SOLDIERS stand \nguard at the door.  It's a horrible room.  Caravaggio is trying to \nsleep, he's unshaven, and pasty-looking.  His interrogator, Müller, \nseems incredibly tired and aggravated.  He's on the phone.\n\n\t\t\tMÜLLER\n\t\t\t\t(in German)\n\t\tYes, yes, yes, yes, yes.\n\nHe slams down the phone and comes back to the table.\n\n\t\t\tMÜLLER\n\t\tDavid Caravaggio.\n\n\t\t\tCARAVAGGIO\n\t\tNo.\n\n\t\t\tMÜLLER\n\t\tPetty thief, six months imprisonment\n\t\tKingston Penitentiary, 1937.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(barely with humor)\n\t\tI keep explaining.  You've got the wrong\n\t\tman.  My name is Bellini - Antonio\n\t\tBellini.  Bellini, Caravaggio, both\n\t\tpainters, I think that is confusing you.\n\nMüller doesn't even pay attention, he's going through a file.  Pulls \nout some photographs, starts spreading them out.\n\n\t\t\tMÜLLER\n\t\tIs this you?\n\n\t\t\tCARAVAGGIO\n\t\tI don't know.\n\n\t\t\tMÜLLER\n\t\tIt is you.  This was taken in Cairo at\n\t\tBritish Headquarters - July 41.  And so was\n\t\tthis - August 41.  And this -February 42.\n\n\t\t\tCARAVAGGIO\n\t\tIt's impossible.  I was buying or selling\n\t\tsomething.  I've been to Cairo many times.\n\n\t\t\tMÜLLER\n\t\tYou are a Canadian spy working for\n\t\tthe Allies.  Code-name Moose.\n\nTHE PHONE rings again, is answered.  The Clerk calls to Müller who gets \nup, irritably.  Caravaggio addresses the room.\n\n\t\t\tCARAVAGGIO\n\t\tCould I have a doctor?  I am passing\n\t\tblood.  I must be bleeding internally.\n\t\t\t\t(to the clerk)\n\t\tCan you get a doctor?  Look -\n\t\t\t\t(he spits onto the table,\nthere's blood in his mouth)\n\t\tI'm leaking blood.\n\t\t\t\t(he indicates a Guard)\n\t\tHe kicks me.  He kicks me all the time.\n\nNobody responds.  Müller is irascible on the phone, checking his watch, \nnegotiating time.  The call finishes.\n\n\t\t\tCLERK\n\t\t\t\t(in German)\n\t\tHe's asking for a doctor.\n\n\t\t\tMÜLLER\n\t\t\t\t(to Caravaggio)\n\t\tYou want a doctor?\n\n\t\t\tCARAVAGGIO\n\t\tYes, I've been asking for weeks, a \n\t\tmonth, I don't know, also my leg was -\n\n\t\t\tMÜLLER\n\t\tWe don't have a doctor, but we\n\t\tdo have a nurse.\n\n\t\t\tCARAVAGGIO\n\t\tA nurse?  Well, sure, a nurse is great.\n\t\tA nurse?  Great.\n\nMüller nods at the Clerk, who instantly gets up.  Just then the \ntelephone rings again.  He hesitates.\n\n\t\t\tMÜLLER\n\t\t\t\t(in German)\n\t\tLeave it and get the nurse!\n\nThe Clerk exits.  The phone rings.  The Stenographer is plagued by \nflies.  Suddenly he slaps at one.\n\n\t\t\tMÜLLER\n\t\t\t\t(snapping)\n\t\tWhy is there so much nose?  I can't\n\t\thear myself think!\n\t\t\t\t(turns to Caravaggio)\n\t\tLook - give me something.  So we can\n\t\tall get out of this room.  A name.  A code.\n\t\t\t\t(wiping his face)\n\t\tIt's too hot.\n\n\t\t\tCARAVAGGIO\n\t\tI slept with the girl.  I've got a wife\n\t\tin Tripoli.  A girl comes up and points\n\t\tat you, you only see trouble.\n\nThe NURSE comes in.  She is Arab and her head is covered.\n\n\t\t\tMÜLLER\n\t\tI'll tell you what I'm going to do.  This\n\t\tis your nurse, by the way.  She's Moslem,\n\t\tso she'll understand all of this.  What's\n\t\tthe punishment for adultery?  Let's\n\t\tleave it at that.  You're married and \n\t\tyou were fucking another woman, so\n\t\tthat's - is it the hands that are cut off?\n\t\tOr is that for stealing?  Does anyone know?\n\nThere's silence.  Müller turns to Caravaggio.\n\n\t\t\tMÜLLER\n\t\tWell, you must know.  You were \n\t\tbrought up Libya, yes?\n\n\t\t\tCARAVAGGIO\n\t\tDon't cut me.\n\n\t\t\tMÜLLER\n\t\tOr was it Toronto?\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(ashen)\n\t\tDon't cut me.  Come on.\n\nNow the phone starts again.  The CLERK picks it up, there's a terse \nexchange, he puts the receiver on the desk, waits for the moment to \ninterrupt Müller.\n\n\t\t\tMÜLLER\n\t\tTen fingers.  How about this?  You\n\t\tgive me a name for every finger -\n\t\tdoesn't matter who.  I get something,\n\t\tyou keep something.  I'm trying to be\n\t\treasonable.  Fenelon-Barnes, we could \n\t\tcall that two names.\n\t\t\t\t(pauses, suddenly puzzled)\n\t\tAre thumbs fingers?\n\t\t\t\t(in GERMAN to the others)\n\t\tIs a thumb a finger?\n\nNo response.  Müller opens his palms to Caravaggio.\n\n\t\t\tMÜLLER\n\t\tI get no help from these people.\n\n\t\t\tCLERK\n\t\t\t\t(in German)\n\t\tThe telephone -\n\nMüller walks over, takes the receiver and slams it down.  an AIR RAID \nSIREN is going off somewhere, and now the faint sound of explosions is \nalso discernible, but all muffled in this room with the steady clack-\nclack of the STENOGRAPHER.  At that moment, Müller suddenly becomes \naware of what is happening.  He turns on the Stenographer.\n\n\t\t\tMÜLLER\n\t\t\t\t(in German)\n\t\tWhat are you doing?\n\n\t\t\tSTENOGRAPHER\n\t\t\t\t(awkward, in German)\n\t\tThat Geneva Convention.  I'm -\n\n\tMüller peremptorily rips out the paper, throws it on the floor.\n\n\t\t\tCARAVAGGIO\n\t\tYou can't do that!  Hey - come on!\n\nDURING THIS Müller's gone to the table, pulled out a drawer and \nproduced A CUT-THROAT RAZOR.  He hands it to the nurse, makes a line \nacross his own left thumb and jerks his head towards Caravaggio.  The \nnurse is extremely reluctant.  Müller claps his hands, pushes her \ntowards Caravaggio.\n\n\t\t\tMÜLLER\n\t\tGo!  Hey!  Go!\n\nCaravaggio is in terror.\n\n\t\t\tCARAVAGGIO\n\t\tOh Jesus.  Oh Jesus Christ.\n\nThe guards come away from the door and press down on Caravaggio's \nshoulders to prevent him from moving.  The nurse, grim-faced, \napproaches, kneels at the table. \n\n\t\t\tCARAVAGGIO\n\t\t\t\t(as she prepares to cut)\n\t\tListen, I'll give you a name.  What\n\t\tname did you say?  I knew them!\n\t\tI promise.  Please - please!\n\nAnd then he SCREAMS AND SCREAMS and jerks up, carrying the guards and \nthe table with him, all heaving off the ground, the nurse thrown off \nbalance.  He falls to the floor, ROARING WITH PAIN, blood everywhere, \nthe table on top of him.  The AIR RAID is continuing outside, the PHONE \nIS RINGING, the nurse stands, pale, blood all over her uniform.\n\n\t\t\tMÜLLER\n\t\tCut the other thumb.\n\nHe stabs at his own right thumb.\n\n\t\t\tMÜLLER\n\t\tThis one!  Come on!\n\nThe nurse, horrified, shakes her head.  Müller snatches the razor from \nher and heads towards the prostate Caravaggio.\n\nOne Guard has got to his feet and grips Caravaggio around the neck in \nhalf-nelson, others holding his legs, while Müller approaches.  \nCaravaggio can't move.  He's gurgling as the Guard almost strangles \nhim.  His eyes are streaming with tears.\n\nNow Müller is at his other hand, and the ROAR of pain again lifts \nCaravaggio to his feet, THE WHOLE TABLE RISING IN THE AIR, his \nmutilated hands slipping from the handcuffs lie Houdini, the drawers of \nthe table SPILLING their contents everywhere, before he sinks to his \nknees like a gored bull and BLACKS OUT.\n\n\n148\tINT.    INTERROGATION ROOM.    TOBRUK.    DAY.\n\nLATER, and Caravaggio comes round.  His eyes open and then his face \nspasms with pain.  He looks down at his ruined hands, then realizes \nhe's alone on the floor of the room, the papers still scattered, the \ntable on its side.  He gets up and staggers out of the open door and up \nthe stairs.\n\n\n149*.\tINT.  STAIRS FROM INTERROGATION ROOM.  TOBRUK.   DAY.\n \nThe corridor is deserted, but the body of a GERMAN SOLDIER sprawls on \nthe stairs leading up to daylight.  Outside Caravaggio can hear \nfighting.\n\n\n150*.\tEXT.    ROOF.    INTERROGATION BUILDING.    DAY.\n\nCaravaggio walks unsteadily along the roof of the building.  Grey and \nyellow gusts of smoke and the rat-ta-tat-tat of machine gun fire \naccompany him, and there's the sound of vehicles screeching and people \nshouting nearby, but no visual clues as to what's happening.\n\nSUDDENLY A PARACHUTE FLOATS DOWN BY HIM.  THEN ANOTHER.  THEN ANOTHER.  \nHE'S SURROUNDED BY PARACHUTES.  THE BRITISH ARE RECLAIMING TOBRUK.  A \nPARATROOPER LANDS ON THE ROOF, AND GESTURES TO CARAVAGGIO TO RAISE HIS \nHANDS.  HE SLOWLY DOES SO.\n\n\n151*.\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nCaravaggio stands in front of the bed, holding up his NAKED HANDS to \nthe Patient, like a man surrendering - two flaps like gills where his \nthumbs were.  The Patient reaches out to take his hands and gently \nlowers them.  Caravaggio finds his bandages, start to wrap them back \nround his fists.\n\n\t\t\tCARAVAGGIO\n\t\tThe man who took my thumbs, I found\n\t\thim eventually - he's dead.  The man who\n\t\ttook my photograph, I found him too -\n\t\tthat took me a year.  He's dead.  Another\n\t\tman took that man across the desert to\n\t\tCairo.  Now I intend to find him.\n\nThe LIGHTS FROM THE MOTORBIKE approaching the Monastery, its growl.  \nCaravaggio goes to the window and watches as Kip and Hana arrive.\n\n\n152\tINT.   AMBASSADOR'S RESIDENCE.   CAIRO, 1939.   NIGHT.\n\nLast seen at the Troops Christmas party, the INNER COURTYARD has been \ntransformed into an elegant outdoor banquet, with band. The \nAlmásy/Madox team is assembled for A FAREWELL DINNER.  They are waiting \nfor Almásy to arrive, his seat conspicuously empty.  He is very late.  \nAnd then he's there, dangerous drunk, terribly dashing.  He practically \ndances to his chair, which he drags violently away from its position \nopposite Katharine.  He bows to Lady Hampton.\n\n\t\t\tALMÁSY\n\t\tI believe I'm rather late.\n\n\t\t\tMADOX\n\t\t\t\t(ignoring the drama of this entrance)\n\t\tGood, we're all here?  A toast,\n\t\tto the International Sand club -\n\t\tmay it soon resurface.\n\n\t\t\tTHE OTHERS\n\t\tThe International Sand Club!\n\n\t\t\tALMÁSY\n\t\t\t\t(raising his glass)\n\t\tMisfits, buggers, fascists, and\n\t\tpaedophiles.  God bless us every one.\n\nThe others drink, trying to ignore his mood.\n\n\t\t\tALMÁSY\n\t\tOops!  Mustn't say International.  \n\t\tDirty word.  Filthy word.  His Majesty!\n\t\tDie Führer!  Il Duce.\n\n\t\t\tCLIFTON\n\t\tSorry, what's your point?\n\n\t\t\tALMÁSY\n\t\t\t\t(ignoring the remark)\n\t\tAnd the people here don't want us.\n\t\tAre you kidding?  The Egyptians are\n\t\tdesperate to get rid of the Colonials...\n\t\t\t\t(to an embarrassed Fouad)\n\t\t- isn't that right?  Their best people\n\t\tget down on hands and knees \n\t\tbegging to be spared a knighthood.\n\t\t\t\t(to his host, Sir Hampton)\n\t\tIsn't that right?\n\nRonnie Hampton shrugs.  They're all very uncomfortable.  Almásy glares \nat Clifton.\n\n\t\t\tALMÁSY\n\t\tWhat's my point?\n\t\t\t\t(standing up)\n\t\tOh!  I've invented a new dance - the\n\t\tBosphorus Hug.  Anybody up to it?\n\t\tMadox?  D'Ag?  Come on D'Aggers.\n\n\t\t\tD'AGOSTINO\n\t\tLet's eat first.  Sit down.\n\nThe Band is now playing Manhattan - Almásy, without missing a beat, \nbegins to sing, replacing the words with alternatives he knows.  He \nlurches around.  Katharine can't look at him.\n\n\t\t\tALMÁSY\n\t\t...We'll bathe at Brighton, the fish\n\t\twe'll frighten when we're in.  your\n\t\tbathing suit so thin will make the\n\t\tshellfish grin, fin to fin. --  Those\n\t\twere the words - actually - before\n\t\tthey were cleaned up.  Could be a\n\t\tsong for you, Mrs. Clifton -\n\t\t\t\t(a perfect English accent)\n\t\t#NAME?\n\nMadox gets up and pulls Almásy into his chair, taking charge.\n\n\t\t\tMADOX\n\t\tLook, either shut up, or go home.\n\n\t\t\tALMÁSY \n\t\t\t\t(darkly)\n\t\tAbsolutely right, shut up.  Lashings of\n\t\tapologies all round.\n\n\n153*.\tEXT.    AMBASSADOR'S RESIDENCE.    NIGHT.\n\nLater, now MOST OF THE GROUP ARE DANCING.  We see Katharine dancing \nwith Rupert Douglas, enjoying herself.  Bermann is there and even Madox \njogging and grinning foolishly.  Clifton looks at Katharine who, as the \ndance ends, excuses herself to go to the cloakroom.  Almásy hovers in \nthe shadows, unseen.\n\n\n154*.\tINT.    AMBASSADOR'S RESIDENCE.    NIGHT.\n\nKatharine comes along the familiar warren of rooms and corridors and is \nsuddenly confronted by Almásy, tortured and out of control.\n\n\t\t\tALMÁSY\n\t\tWhy did you hold his collar?\n\n\t\t\tKATHARINE\n\t\tWhat?\n\n\t\t\tALMÁSY\n\t\t\t\t(mimicking her inflection)\n\t\tWhat?  What?  That boy, that little boy,\n\t\tyou were holding his collar, gripping\n\t\this collar, what for?\n\n\t\t\tKATHARINE\n\t\tWould you let me pass?\n\n\t\t\tALMÁSY\n\t\tIs he next?  Do you drag him into your\n\t\tlittle room?  Where is it?  Is this it?\n\n\t\t\tKATHARINE\n\t\tDon't do this.\n\n\t\t\tALMÁSY\n\t\tI've watched you - on verandahs, at\n\t\tGarden Parties, at the Races - how\n\t\tcan you stand there?  How can you\n\t\tever smile?  As if your life hadn't capsized?\n\n\t\t\tKATHARINE\n\t\tYou know why?\n\nHe tries to hold her.  She resists\n\n\t\t\tALMÁSY\n\t\tDance with me.\n\n\t\t\tKATHARINE\n\t\tNo.\n\n\t\t\tALMÁSY\n\t\tDance with me.  I want to touch you.\n\t\tI want the things which are mine.\n\t\tWhich belong to me.\n\n\t\t\tKATHARINE\n\t\tDo you think you're the only one who\n\t\tfeels anything?  Is that what you think?\n\nSome women, flushed with dancing, turn the corner on the way to the \nLadies Room.  They collect Katharine in their train and leave Almásy to \nfall back into the shadows.\n\n\n155\tINT.    THE PATIENTS' ROOM.    NIGHT.\n\nHana sits with the Patient.  His eyes are full of tears.  He opens \nthem, sees her, watching over him.  He's embarrassed.\n\n\t\t\tTHE PATIENT\n\t\tWhy don't you go?\n\t\t\t\t(wiping his eyes)\n\t\tYou should sleep.\n\n\t\t\tHANA\n\t\tWould you like me to?\n\nHe nods.  She gets up, touches his hand, then leaves.\n\n\n156*.\tINT.    THE MONASTERY, LANDING AND STAIRS.    NIGHT.\n\nHana leaves the room, then turns and sees A TINY LAMP on the floor, \nit's made from a SNAIL SHELL and oil.  She bends to it curiously, then \nsees a second lamp half-way down the stairs, then a third further down.  \nShe smiles in the light, then follows the trail.\n\n\n157\tEXT.    THE MONASTERY CLOISTERS.    NIGHT.\n\n\nIn the Cloisters THE TRAIL OF SHELL LAMPS CONTINUES, like tiny cat's \neyes.  As they reach the hopscotch chalk marks, they outline the \nsquares.  Hana HOPSCOTCHES and then follows the light, disappearing \nround a corner.\n\n\n\n158\tINT.    THE MONASTERY STABLES.    NIGHT.\n\nHana comes through into the stables.  The lamps lead her, then they \nstop.  She peers into the shadows.\n\n\t\t\tKIP (O/S)\n\t\tHana.\n\nShe turns to the voice.  He steps out of the darkness.\n\n\t\t\tHANA \n\t\t\t\t(happy )\n\t\tKip.\n\nAnd he goes to her.\n\n\n159\tEXT.    THE MONASTERY STABLES.    EARLY MORNING.\n\nHardy knocks cautiously on the door of the stables.  Eventually Hana \nopens the door.\n\n\t\t\tHARDY\n\t\tI was looking for the Lieutenant Singh.\n\n\t\t\tHANA\n\t\tHe's sleeping.\n\n\t\t\tHARDY\n\t\tOnly we have to go to work.\n\n\t\t\tHANA\n\t\tI'll tell him.  What is it?  Is it a mine?\n\n\t\t\tHARDY\n\t\tA bomb.  At the Viaduct.\n\nShe closes the door, then reappears.\n\n\t\t\tHANA\n\t\tDoes he have to go?\n\n\t\t\tHARDY\n\t\tPardon me?\n\n\t\t\tHANA\n\t\tWhat if you couldn't find him...?\n\t\t\t\t(Hardy's bewildered)\n\t\tSergeant, not today, please.\n\t\tNot this morning.\n\nKip comes to the door, winding his turban.\n\n\t\t\tKIP\n\t\tWhat's happening?  Am I needed?\n\n\t\t\tHARDY\n\t\tI'm afraid so, sir.\n\nKip hurries to his tent.  Hana follows him.\n\n\t\t\tHANA\n\t\tDon't go.  I'm frightened.  I can love\n\t\ta coward, I can't love another dead man.\n\n\t\t\tKIP\n\t\tThis is what I do.  I do this every day.\n\nAnd he's ready, Hardy having wheeled out their motorcycles.  He gets on \nhis, and they're away, Hana hardly able to look.\n\n\n160\tEXT.    A VIADUCT NORTH OF THE MONASTERY.    DAY.\n\nKIP IS LOWERED BY A PULLEY INTO THE SHAFT THE SAPPERS HAVE MADE AROUND \nTHE BOMB.  Hardy supervises.  The bombs huge - 2, 000 lbs, and \nprotrudes ostrich-like from the pit, its nose sunk into a pool of \nsludge at the base of the viaduct.\n\nKip steps off and sinks knee deep in mud, grunting in disgust.   \nWarily, he touches his huge opponent, feeling the condition of the \ncase.  He wipes the metal.  Reveals a serial number, calls it out to \nHardy, who's perched on the bank.\n\n\t\t\tKIP\n\t\tSerial number - KK-1P2600.\n\nHe's hypnotized by the number: KK-1P: a bomb with his name on it.\n\n\n161\tEXT.    ROAD APPROACHING VIADUCT.   DAY.\n\nHana cycles along on Caravaggio's bicycle.  A TANK comes roaring up \nbehind her, then a second and a third, loaded up with people, citizens \nand soldiers, and children, waving flags and gesticulating.  She lets \nthe metal circus go by.\n\n\n162\tINT.    BOMB SHAFT.    DAY.\n\nBack in the shaft, Kip works away, his fingers shaking with the cold \nfrom the oxygen he's using to freeze the fuse.  Suddenly there's a \nVIOLENT TREMOR.  The ground is SHUDDERING, and the bomb slips horribly.  \nKip GRABS AT IT helplessly as if trying to stop a man from falling, \ninstead it falls on him pushing him into the sludge.\n\n\t\t\tKIP\n\t\tHardy!  Hardy!  What's happening?!\n\n\n163\tEXT.    VIADUCT.    DAY.\n\nThe TANKS are rumbling towards the Viaduct.  HORNS start sounding.  \nHARDY, below, bellows at his men above for explanation.\n\n\t\t\tHARDY\n\t\tCorporal!?  Dade!!\n\n\t\t\tDADE\n\t\tTanks, sir.  Don't know what it's about.\n\t\tGod only knows.\n\n\t\t\tHARDY\n\t\t\t\t(incredulous)\n\t\tWhat is this - a bloody carnival?\n\t\tStop them!\n\nThree Sappers run across the bridge towards the oncoming procession.  \nThey wave their orange flags, the tanks wave back wit their flags - \nStars and Stripes, Union Jacks.  Now SHOTS are ringing out.  In the \nshaft, oblivious, Kip slides out from under the bomb, the oxygen \nspurting everywhere, all over his clothes, hissing on the surface of \nthe water.  Hardy bends into the shaft, heedless of his own safety.\n\n\t\t\tHARDY\n\t\tYou've got to cut, sir, that frost\n\t\twon't last.\n\n\t\t\tKIP\n\t\tGo away.\n\n\t\t\tHARDY\n\t\tYessir.\n\n\t\t\tKIP\n\t\tThis is making me incredibly angry.\n\nHe rubs his hands to warm them up, locates his needle pliers and slips \nthem through the tiny gap.  His hand touches the casing and the freeze \nBURNS his hand.  He jerks back, DROPPING THE PLIERS into the sludge, \ncursing.\n\nNow he's on his hands and knees in the sludge, trying frantically to \nfind the pliers.  Hardy looks at his watch, he can't help.  The seconds \nrun out as Kip grovels in the mud.  Totally submerged, he suddenly \ncomes out with the pliers, goes straight to the fuse, no finesse, and \ncuts.  There's a snip.  Then nothing.  Then Kip laughs at Hardy.\n\n\t\t\tKIP\n\t\tKiss me.\n\nHardy is already at the winch, hauling it up.  Kip can hardly clip on \nthe halter - his hands numb and burned.  As the pulley jerks he just \nclings on, rising from the grip of the mud like an ancient corpse out \nof a bog.\n\nThe other sappers have gathered around the edge of the site.  Great \nelation on their faces.\n\n\t\t\tHARDY \n\t\tGet a blanket!\n\t\t\t\t(not getting attention)\n\t\tDade!  Get the Lieutenant a blanket.\n\n\t\t\tDADE\n\t\tIt's over, Sarge.  It's over.  Jerry's surrendered.\n\t\t\t\t(to Kip)\n\t\tSir, congratulations!\n\nKip shakes his hand.  Kip shakes Hardy's hand.\n\n\t\t\tKIP\n\t\tCongratulations.  \n\nAnd now they're all shaking hands, and slapping backs and the SOLDIERS \nFROM THE TANKS are there and the victory  celebrations begin.  Kip's \nblank, drained, not taking anything in, as Dade wraps a blanket around \nhis shoulders.\n\nHANA'S ON TOP OF THE VIADUCT, watching as Kip is wrapped in his \nblanket, the men celebrating.  She shouts with relief from the top of \nthe bridge.\n\n\t\t\tHANA\n\t\tKip!\n\n\n164\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\n\tA VICTORY CELEBRATION PARTY.\n\nThe gramophone plays Frank Sinatra.  Kip sits in the window, the \nshutters open, the village lit up behind his head, nodding to the \nmusic, sucking out of his condensed milk.  Elsewhere there is an open \nbottle of cognac, some wine.  The Patient has a beaker of wine.  \nCaravaggio is dancing with Hana.\n\n\t\t\tHANA\n\t\tKip - come and dance with me\n\n\t\t\tKIP\n\t\t\t\t(a sly wobble of the head)\n\t\tYes.  Later.\n\nCaravaggio swirls past the Patient - nodding at the cognac.\n\n\t\t\tCARAVAGGIO\n\t\tHave a drink.\n\n\t\t\tTHE PATIENT\n\t\tI've had a drink.  Fatal.\n\n\t\t\tCARAVAGGIO\n\t\tWell, anything you do is likely \n\t\tto be fatal, so you know -\n\n\t\t\tTHE PATIENT\n\t\tVery true!\n\n\n165\tEXT.    VILLAGE SQUARE.    NIGHT.\n\nA tiny PIAZZA where the Sappers and the Villagers are having their own, \nmore raucous, Victory Feste.  There are accordions, there's dancing, \nand there's HARDY, stripped to some exotic underpants, a large tattoo: \nDORIS inside a heart, clambering up the EQUESTRIAN STATUE IN THE MIDDLE \nOF THE FOUNTAIN.  He's astride the horse and now straining to get up to \nthe tip of the outstretched sword, so that he can hang the UNION JACK \nFLAG he has in his mouth.\n\nBLACKLER, one of the Sappers, is Hardy's assistant.  He's drunk and \nslips from his ladder, falling flat on his back into the fountain with \na great splash, to much hilarity.  \n\n\n166\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nHana and Caravaggio are still dancing.  The music has stopped.  \nCaravaggio changes the record.  Hana goes to Kip for a second, beaming, \nbefore Caravaggio has snatched her away again.  The Patient taps along \nto the music.\n\n\t\t\tTHE PATIENT\n\t\tWho knows the Bosphorus Hug?\n\n\t\t\tHANA\n\t\tNever heard of it.\n\n\t\t\tTHE PATIENT\n\t\tThat was a dance we invented at\n\t\tthe International Sand Club.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(cryptic)\n\t\tWhat?  You and Madox?  Or you\n\t\tand Katharine Clifton?\n\n\t\t\tTHE PATIENT\n\t\t\t\t(a small laugh)\n\t\tWhat?\n\nThere's a muddled thud in the distance, Kip's ears prick up.  He \nglances for an instant out of the window.\n\n\t\t\tHANA\n\t\t\t\t(anxious, of the noise)\n\t\tWhat was that?\n\nShe is spinning with Caravaggio.  When she comes round again, Kip has \ngone.\n\n\n167\tEXT.    VILLAGE SQUARE.    ITALY 1945.    NIGHT.\n\n\tKip's motorbike skids into the tiny PIAZZA.\n\nA MILITARY AMBULANCE IS ALREADY THERE.  Dade and SPALDING are presiding \nas the paramedics take two bodies into the rear of the truck.  The \nshattered fountain, the sluiced flagstones, shining wet and slick, give \nsome clues as to what's happened, as do the elderly standing in the \nshadows, the distressed girls, arm in arm.  ONE GIRL, young and quite \nstriking, is particularly inconsolable, her grief sobbed out at the \ndoors of the ambulance.\n\nSPALDING salutes Kip, who waves his salute away, just wanting to know \nwhat happened.\n\n\t\t\tSPALDING\n\t\tBooby trap.  They was running up the\n\t\tUnion Jack, sir, up off that statue -\n\t\tIt just went off.\n\n\t\t\tDADE\n\t\tShould have been me.  It was my idea\n\t\tbut Sergeant Hardy climbed up, sir,\n\t\thim and Blackler.\n\nKip goes to the ambulance.  Spalding tries to stop him.\n\n\t\t\tSPALDING\n\t\tSir - you don't want to look.\n\nKip steps into the back of the ambulance, bends over both bodies, does \nlook, then comes out, past the weeping girl.\n\n\t\t\tKIP\n\t\tWho's that girl?\n\n\t\t\tDADE\n\t\tHis fiancee, sir.\n\n\t\t\tKIP\n\t\t\t\t(astonished)\n\t\tHardy's?\n\n\t\t\tDADE\n\t\tKept it a bit dark.\n\n\n168\tEXT.    THE MONASTERY.    APPROACHING DAWN.\n\nKip has pulled out all of Hardy's gear.  Now he starts on the tent.  \nHana comes out into the step.  Kip turns, his eyes brimming, sees her, \nsighs, then turns back and kicks at the pegs, collapsing the tent.\n\nNow he's trying to fold a shirt.  Hana takes it from him.  She folds \nit.  Then together they start to fold the tent, Kip orchestrating, not \nwanting to talk.  Finally, Kip looks at Hana, stiff with emotion.\n\n\t\t\tKIP\n\t\tI was thinking yesterday - yesterday! -\n\t\tthe Patient, Hardy: they're\n\t\teverything that's good about England.\n\t\tI couldn't even say what that was.\n\t\tWe didn't exchange two personal words,\n\t\tand we've been together through some\n\t\tterrible things, some -\n\t\t\t\t(incredulous)\n\t\the was engaged to a girl in the village! -\n\t\tI mean -\n\t\t\t\t(looks at Hana)\n\t\tand us - he never once... He didn't\n\t\task me if I could spin the ball at\n\t\tcricket or the kamasutra or -\n\t\tI don't even know what I'm \n\t\ttalking about.\n\n\t\t\tHANA\n\t\tYou loved him.\n\n\n169*.\tINT.    THE PATIENT'S ROOM.    EVENING.\n\nCaravaggio, reading Dante aloud in Italian, smoking, walks over to the \nwindow, looks out.\n\n\n169*.\tEXT.    KIP'S TENT.    EVENING.\n\nHana is approaching Kip's tent, carrying a light.  She ducks inside the \ntent and the light disappears.\n\n\n169b*.\tINT.    THE PATIENT'S ROOM.    EVENING.\n\nCaravaggio turns back into the room, towards the Patient, still \nreading.\n\n\n170\tINT.    KIP'S TENT.    NIGHT.\n\nHana lies over Kip, unraveling his turban, slowly, sensual.\n\n\t\t\tHANA\n\t\tIf one night I didn't come to the tent,\n\t\twhat would you do?\n\t\t\tKIP\n\t\tI try not to expect you.\n\n\t\t\tHANA\n\t\tBut if it got late and I hadn't shown up?\n\n\t\t\tKIP\n\t\tThen I'd think there must be a reason.\n\n\t\t\tHANA\n\t\tYou wouldn't come to find me?\n\t\t\t\t(Kip shrugs)\n\t\tThat makes me never want to come here.\n\nBut she continues unraveling the turban.\n\n\t\t\tHANA\n\t\tThen I tell myself he spends all\n\t\tday searching, in the night he\n\t\twants to be found.\n\n\n171*.\tEXT.   BASECAMP AT THE CAVE OF SWIMMERS.  1939.  DAY.\n\nThe Expedition Team is packing up the Basecamp.  Madox and Almásy are \nloading things into the plane.  FOUAD, AL AUF and others work at the \ncars.\n\n\t\t\tMADOX\n\t\tHad a letter from my wife.  The wisteria\n\t\tis still out, which I'm looking forward\n\t\tto.  She says Dorset is gripped with\n\t\tInvasion Fever.  Wrong coast I\n\t\tshould have thought, still...\n\n\t\t\tALMÁSY\n\t\tRight.\n\n\t\t\tMADOX\n\t\tBermann thinks he'll be interned,\n\t\tpoor fellow.  I'm going to do what\n\t\tI can, but...  And D'Ag turns out \n\t\tto be a great admirer of Mussolini.\n\t\tSo now you can say I told you so.\n\n\t\t\tALMÁSY\n\t\tI told you so.\n\n\t\t\tMADOX\n\t\tWe didn't care about countries.\n\t\tDid we?  Brits, Arabs, Hungarians,\n\t\tGermans.  None of that mattered,\n\t\tdid it?  It was something finer than that.\n\n\t\t\tALMÁSY\n\t\tYes.  It was.  Thanks for the compass.\n\t\tI'll look after it for you.\n\n\t\t\tMADOX\n\t\t\t\t(shrugging this off)\n\t\tWhen's Clifton picking you up?\n\n\t\t\tALMÁSY\n\t\tTomorrow afternoon.  Don't worry.\n\t\tI'll be ready.\n\n\t\t\tMADOX\n\t\tI'll leave the plane in the hangar at\n\t\tKufra Oasis.  So if you need it...hard to\n\t\tknow how long one's talking about.  We\n\t\tmight all be back in a month or two.\n\nMadox kneels and takes A HANDFUL OF SAND, puts it into his pocket.  He \nthrows his haversack into the plane then turns.  Almásy puts out a \nhand.  This is a moment of great emotional weight for them both, \nconducted as if nothing were happening.\n\n\t\t\tMADOX\n\t\tI have to teach myself not to read\n\t\ttoo much into everything.  Comes of\n\t\ttoo long having to read so much into\n\t\thardly anything at all.\n\n\t\t\tALMÁSY\n\t\tGoodbye, my friend.\n\nThey shake hands.\n\n\t\t\tMADOX\n\t\tMay God make safety your companion.\n\n\t\t\tALMÁSY\n\t\t\t\t(a tradition)\n\t\tThere is no God.\n\t\t\t\t(smiles)\n\t\tBut I hope someone looks after you.\n\nMadox clambers into his plane, then remembers something, jabs at his \nthroat.\n\n\t\t\tMADOX\n\t\tIn case you're still wondering - this\n\t\tis called the supasternal notch.\n\nAlmásy nods, goes to the propeller.\n\n\t\t\tMADOX\n\t\tCome and visit us in Dorset.  When\n\t\tall this nonsense is over.\n\t\t\t\t(then shrugs)\n\t\tYou'll never come to Dorset.\n\nThe plane roars into life.  Almásy watches it taxi away - then heads \nback to continue with his packing up.\n\n\n172*.\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nMADOX SHOOTS HIMSELF BEHIND THE ALTAR IN THE ROOM.  The Patient's \nstertorous breathing, each intake accompanied by a small noise, a note, \nsuddenly stops.  Then steadies again.  He appears to be alone.\n\n\n173\tEXT.    GARDEN.    NIGHT.\n\nKip is in the tent, looking out of the flap, waiting for Hana.\n\n\n174*.\tINT.    THE MONASTERY KITCHEN.    NIGHT.\n\nKip walks in looking for Hana.\n\n\n174a*.\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nKip enters, sees Hana is not with the Patient, hears his uneven \nbreathing, then goes out.  From the shadows of the room, CARAVAGGIO \nshifts position.   He's slumped on the floor, staring at the man prone \nin the bed.\n\n\n174b*.\tINT.    HANA'S ROOM.    NIGHT.\n\nInto her bedroom, Kip can't find her there either.  He turns to go, \nwalking down the wooden stairs, until her voice stops him in his \ntracks.  She's in the shadows of the eaves.\n\n\t\t\tHANA\n\t\tSometimes I need you to find me.\n\n\n175*.\tINT.    THE PATIENT'S ROOM.     NIGHT.\n\nThe Patient's eyes open to see Caravaggio at the morphine.\n\n\t\t\tTHE PATIENT\n\t\tHana tells me you're leaving.\n\n\t\t\tCARAVAGGIO\n\t\t\t\t(preparing the injection)\n\t\tThere are going to be trials, they\n\t\twant me to interpret, don't they\n\t\tknow I'm allergic to courtrooms?\n\n\t\t\tTHE PATIENT\n\t\tWe shall miss you.\n\nHe delivers the injection.  The Patient sighs.  Caravaggio takes off \nhis jacket.  A pistol is stuck in his waistband.  The Patient sees it.\n\n\t\t\tCARAVAGGIO\n\t\tSo, I come across the Hospital Convoy\n\t\t\t\t(holds up the syringe)\n\t\tI was looking for this stuff, and some\n\t\tnurse, Mary, Hana's friend, tells me\n\t\tabout you and Hana, hiding in a\n\t\tmonastery, in purdah, whatever it is -\n\t\tretreat -\n\t\t\t\t(he administers his own injection, \nusing his teeth grip the sleeve)\n\t\thow you'd come in from the Desert\n\t\tand you were burned and you didn't\n\t\tknow your name but you knew the\n\t\twords to every song there was and\n\t\tyou had one possession -\n\t\t\t\t(picks it up)\n\t\t#NAME?\n\t\tfull of letters and cuttings, and then\n\t\tI knew it must be you.\n\n\t\t\tTHE PATIENT\n\t\tMe?\n\n\t\t\tCARAVAGGIO\n\t\tI'd seen you writing in that book.  \n\t\tAt the Embassy in Cairo, when I\n\t\thad thumbs and you had a face.\n\t\tAnd a name.\n\n\t\t\tTHE PATIENT\n\t\tI see.\n\n\t\t\tCARAVAGGIO\n\t\tBefore you went over to the Germans,\n\t\tbefore you got Rommel's spy across the\n\t\tdesert and inside British headquarters.\n\t\tHe took some pretty good photographs -\n\t\tI saw mine in that torture room in \n\t\tTobruk, so they made an impression.  \n\n\t\t\tTHE PATIENT\n\t\tAnd you thought you'd come and\n\t\tsettle the score?\n\n\t\t\tCARAVAGGIO\n\t\tYou were the only man who knew\n\t\tthe desert well enough, the only\n\t\tman who would cross seventeen\n\t\thundred miles of nothing.\n\n\t\t\tTHE PATIENT\n\t\tI had to get back to the desert. I made a\n\t\tpromise.  The rest meant nothing to me.\n\n\t\t\tCARAVAGGIO\n\t\tWhat did you say?\n\n\t\t\tTHE PATIENT\n\t\tThe rest meant nothing to me.\n\n\t\t\tCARAVAGGIO\n\t\tThere was a result to what you did.\n\t\tIt wasn't just another expedition.\n\t\t\t\t(holds up hands)\n\t\tIt did this.  If the British hadn't\n\t\tunearthed your nosey photographer\n\t\tin Cairo thousands of people could\n\t\thave died.\n\n\t\t\tTHE PATIENT\n\t\tThousands of people did die, just\n\t\tdifferent people.\n\n\t\t\tCARAVAGGIO\n\t\tBut you were among the British, they \n\t\twere your friends - why betray them?\n\n\t\t\tTHE PATIENT\n\t\t\t\t(a bitter laugh)\n\t\tIs that what you thought?  That I\n\t\tbetrayed the British?  The British\n\t\tbetrayed me.  The British betrayed me.\n\n\n176*.\tEXT.   BASECAMP AT CAVE OF SWIMMERS.   1939.   DAY.\n\nAlmásy sits on a ridge transferring map of information from his \nHerodotus onto a sheet of paper.  He looks up at the sound of Clifton's \napproaching Steerman.  He folds up the map and sticks it inside one of \nClifton's CHAMPAGNE BOTTLES and lodges it between the rocks.\n\n \n176a*.\tINT.    STEERMAN.    DAY.\n\nClifton is flying the STEERMAN up to Gilf Kebir.  From the air it's \npossible to make out Almásy scrambling down from the ridge towards \nwhere the stones indicate a landing area, carrying the last of the \nmaterials from the Cave of Swimmers.  Almásy waves in recognition and \nwelcome.\n\n\n177\tEXT.   BASECAMP AT THE CAVE OF SWIMMERS.   DAY.\n\nAlmásy watches as the plane drops towards him, shielding his eyes \nagainst the sun.  the plane bounces along the runway, not quite \nlanding.  Almásy continues packing the equipment.\n\nAlmásy looks up to see the plane swerve, now suddenly HEADING STRAIGHT \nTOWARDS HIM.  He's completely vulnerable, nowhere to run.  He dives at \nthe ground.  THE PLANE SMASHES AGAINST AN INVISIBLE RIDGE AND TURNS \nOVER AND OVER, the wings snapping off like twigs as it hurtles past the \nprostrate Almásy.  He gets to his feet and starts to run towards the \nwreckage.\n\nA blue line of smoke is uncoiling from the plane, but no fire.  Almásy \npulls away the debris to find  GEOFFREY - SLUMPED, NECK BROKEN, BLOODY.  \nHe tries to move him, and in the process reveals, to his ABSOLUTE \nhorror, KATHARINE, STARING GRIMLY AHEAD, UNABLE TO MOVE.  He's frantic.\n\n\t\t\tALMÁSY\n\t\tKatharine!  Oh dear God, Katharine -\n\t\twhat are you doing here?\n\n\t\t\tKATHARINE\n\t\t\t\t(eyes rolling, an incredible weariness)\n\t\tI can't move.  I can't get out.\n\nAlmásy starts to pull at the wreck around her.\nDURING THIS -\n\n\t\t\tALMÁSY\n\t\tWhy did he bring you?\n\n\t\t\tKATHARINE\n\t\tA surprise, he said.\n\nAlmásy inspects Clifton, tries to find a pulse.  The smoke circles \naround them.  Katharine looks at her husband.\n\n\t\t\tKATHARINE\n\t\tPoor Geoffrey.  He knew.  He must\n\t\thave known all the time.  He was\n\t\tshouting - I love you, Katharine, \n\t\tI love you so much.  Is he badly hurt?\n\t\tHis neck is odd.\n\nAlmásy puts his arm around Katharine to try and pull her clear.  She \ncan't stand the pain.\n\n\t\t\tKATHARINE\n\t\tPlease don't move me.  It hurts too much.\n\n\t\t\tALMÁSY\n\t\tWe've got to get you out of here.\n\n\t\t\tKATHARINE\n\t\tIt hurts too much.\n\n\t\t\tALMÁSY\n\t\t\t\t(can't bear to hurt her)\n\t\tI know, darling, I'm sorry.\n\nThe smoke thickens.  He pulls - hard - the pain from which causes \nKatharine to gasp, then pass out.  They slip haphazardly to the ground, \ncushioned a little by the sand.  He lifts her gently into his arms and \ncarries her from the danger of the place, then turns and runs back.  \nTHE PLANE SUDDENLY ERUPTS IN FLAMES.  Almásy dashes into the fire, \ndisappearing into the smoke before emerging with Clifton over his \nshoulder, fireman's-lift style.\n\n\n178\tEXT.    THE CAVE OF SWIMMERS.    DAY.\n\nHe has WRAPPED KATHARINE IN THE SILK FOLDS OF HER PARACHUTE and emerges \nfrom the near the familiar cleft in the rock, struggling with the \nexertion of the climb as they approach the Cave of Swimmers.  He has a \nlarge water bottle slung around his neck and a haversack, and is loaded \nlike a pack horse.  Katharine opens her eyes.\n\n\t\t\tKATHARINE\n\t\t\t\t(whispering)\n\t\tWhy did you hate me?\n\n\t\t\tALMÁSY\n\t\tWhat?\n\n\t\t\tKATHARINE\n\t\tDon't you know you drove everybody mad?\n\n\t\t\tALMÁSY\n\t\tDon't talk.\n\n\t\t\tKATHARINE\n\t\t\t\t(gasping)\n\t\tYou speak so many bloody languages\n\t\tand you never want to talk.\n\nThey stagger on.  He suddenly notices a stain of gold at her neck.  \nIt's saffron, leaking from a silver THIMBLE which hangs from a black \nribbon.\n\n\t\t\tALMÁSY\n\t\t\t\t(overwhelmed)\n\t\tYou're wearing the thimble.\n\n\t\t\tKATHARINE\n\t\tOf course.  You idiot.  I always wear it.\n\t\tI've always worn it.  I've always loved you.\n\nAlmásy CRIES as he walks - huge sobs, no words - convulsed with the \npain of it.  They approach the Cave.\n\n\n179*.\tINT.    CAVE OF SWIMMERS.    DAY.\n\nAlmásy comes through in shadows, carrying Katharine, blocking out the \nlight that pours into the entrance of the cave.  Once inside, he sets \nher down incredibly gently, makes a bed of blankets and the parachute.  \nHe turns on his flashlight.\n\n\t\t\tKATHARINE\n\t\tIt's so cold.\n\n\t\t\tALMÁSY\n\t\tI know.  I'm sorry.  I'll make a fire.\n\t\tI'll be back.\n\n\t\t\tKATHARINE\n\t\t\t\t(panicking suddenly)\n\t\tDon't leave me!\n\n\t\t\tALMÁSY\n\t\tI'm just going to find things for the fire.\n\n\n179a*.\tINT.    CAVE OF SWIMMERS.    TORCHLIGHT.\n\nAlmásy returns with the stocks of ACACIA TWIGS the Expedition had \ncached.  As he makes the fire, the light sends his shadow flitting \nacross the walls.\n\n\t\t\tKATHARINE\n\t\tShall we be all right?\n\n\t\t\tALMÁSY\n\t\tYes.  Absolutely.\n\n\t\t\tKATHARINE\n\t\t\t\t(with a laugh)\n\t\tOh dear.\n\n\t\t\tALMÁSY\n\t\t\t\t(as he works)\n\t\tListen to me, Katharine.  You've broken\n\t\tyour ankle and I'm going to have to try\n\t\tand bind it.  I think your wrist might be\n\t\tbroken, too - and some ribs, which is\n\t\twhy it's hurting you to breathe.  I'm\n\t\tgoing to have to walk to El Taj.  Given\n\t\tall the traffic in the desert these days\n\t\tI should bump into one army or another\n\t\tbefore I reach there - or Fenelon-Barnes\n\t\tand his camel.  And then I'll be back \n\t\tand we'll be fine, and I'll never leave you.\n\nThe fire is lit and he comes over to her, kneels beside her.\n\n\t\t\tKATHARINE\n\t\tDo you promise?  I wouldn't want to die\n\t\there.  I wouldn't want to die in the desert.\n\t\tI've always had a rather elaborate funeral\n\t\tin mind, with particular hymns.  Very\n\t\tEnglish.  And I know exactly where I\n\t\twant to be buried.  In our garden.  Where\n\t\tI grew up.  With a view of the sea.  So\n\t\tpromise me you'll come back for you.\n\n\t\t\tALMÁSY\n\t\tI promise I'll come back.  I promise\n\t\tI'll never leave you.  And there's\n\t\tplenty of water and food.  You\n\t\tcan have a party.\n\nHe kisses her tenderly.  Pulls out his HERODOTUS and lays it beside \nher.  Then he puts down the FLASHLIGHT.\n\n\t\t\tALMÁSY\n\t\tAnd a good read.\n\t\t\t\t(of the flashlight battery)\n\t\tDon't waste it.\n\n\t\t\tKATHARINE\n\t\tThank you.\n\t\t\t\t(clouds over)\n\t\tWill you bury Geoffrey?  I know\n\t\the's dead.\n\n\t\t\tALMÁSY\n\t\tI'm sorry, Katharine.\n\n\t\t\tKATHARINE\n\t\tI know.\n\n\t\t\tALMÁSY\n\t\tEvery night I cut out my heart but \n\t\tin the morning it was full again.\n\nHe's tearing strips from the parachute with his knife.  As he starts to \nbind her wrist he gets her to talk, trying to distract her from the \npain.\n\n\t\t\tALMÁSY\n\t\tTell me about your garden.\n\n\t\t\tKATHARINE\n\t\t\t\t(tries to focus)\n\t\tOur Garden, our garden - not so much\n\t\tthe garden, but the copse alongside it,\n\t\twild, a secret way plunging down to the\n\t\tshore and then nothing but water\n\t\tbetween you and France.  The Devil's\n\t\tChimney it was called -\n\t\t\t\t(he pulls tight on the binding)\n\t\tThe Devil's Chimney, I don't know why.\n\t\t\t\t(he kisses her)\n\t\tDarling.  My darling.\n\n\n180\tEXT.    THE DESERT.    DUSK.\n\nALMÁSY BURYING CLIFTON.  He's dug a narrow trench, and now he goes to \nthe body.  Clifton's face is oil stained, bloody.  Almásy takes his \nhandkerchief and, pouring his precious water into it, CLEANS GEOFFREY'S \nFACE.\n\n\t\t\tTHE PATIENT'S (O/S)\n\t\tSeventy miles, north - north west.\n\t\tI had Madox's compass.  A man can\n\t\twalk in the desert as fast as a camel.\n\t\tThat's about two and a half miles an hour.\n\n\n181\tEXT.    THE DESERT.    NIGHT.\n\nAlamos's walking.  He slides and collapses as he misjudges a dune, gets \nup, stumbles on.\n\n\t\t\tTHE PATIENT (O/S)\n\t\tI stopped at noon and at twilight.\n\t\tThree days there, I told her, then\n\t\tthree hours back by jeep.  Don't go\n\t\tanywhere.  I'll be back.\n\n\n182\tEXT.    THE DESERT.    DAWN.\n\nHe trudges on, his eyes opening and closing.  He's singing to keep \nawake.  Darktown Strutter's Ball. - I'll be down to get you in the \ntaxi, honey...  He does a little shuffle.  Looks behind at the crazy \ntrail of his footprints.\n\n\n182a*.\tEXT.    THE CHOTT.    DAWN.\n\nA vast flat expanse of dried salt lake.  A remorseless horizon.  Almasy \nwalks, checking the compass, squinting at the sun.  then he sees a \ncloud of dust traveling across the horizon.  It comes closer moving at \ngreat speed, reveals itself.  An OSTRICH.\n\n\n183\tEXT.    WELL.    DAY.\n\nAlmásy lowers himself by an old rope down into a gully.  He approaches \na pile of stones and removes them to reveal a brackish pool of filthy \nwater.  He drinks, pouring water over his head, grimacing at the taste, \nbut parched too.\n\n\n184*.\tEXT.    APPROACHING EL TAJ.    DAY.\n\nAlmásy gets his first sight of the fortress town of EL TAJ and sinks to \nhis knees, in relief and exhaustion.  Then he gets up and trudges \ntowards the town.  A CORPORAL with a rifle in his hands appears.\n\n\n184a*.\tINT.    EL TAJ.    DAY.\n\nThe Corporal brings Almásy into a square.  A young OFFICER appears from \nthe shadows of his office.  His JEEP is parked in the shade.\n\n\t\t\tOFFICER\n\t\tGood morning!\n\n\t\t\tALMÁSY\n\t\tCould I trouble you for some water?\n\n\t\t\tOFFICER\n\t\t\t\t(registering the accented English)\n\t\tYes, of course.\n\t\t\t\t(the Corporal has a water bottle,\nhands it to Almásy)\n\t\tSo, golly, where have you come from?\n\n\t\t\tALMÁSY\n\t\t\t\t(gulping the water)\n\t\tI desperately need a jeep.  There's\n\t\tbeen an accident.\n\n\t\t\tOFFICER\n\t\tI see.\n\n\t\t\tALMÁSY\n\t\t\t\t(brain racing)\n\t\tNo, I'm not thinking clearly - I need\n\t\ta doctor too, to come with me, can I\n\t\ttake this vehicle?  I'll pay, of course -\n\t\tand some morphine and...\n\t\t\t\t(calculating)\n\t\tSeventy miles - I can be back\n\t\there by dusk.\n\n\t\t\tOFFICER\n\t\tDo you have your papers, sir?\n\n\t\t\tALMÁSY\n\t\tWhat?\n\n\t\t\tOFFICER\n\t\tIf I could just see some identification.\n\n\t\t\tALMÁSY\n\t\tAm I not talking sense? -  forgive me,\n\t\tI'm, I've been walking, I've - there's a\n\t\twoman badly injured at Gilf Kebir,\n\t\tin the Cave of Swimmers.  I am a\n\t\tmember of the Royal Geographical\n\t\tSociety.\n\n\t\t\tOFFICER\n\t\tRight.  And what's your name, sir?\n\n\t\t\tALMÁSY\n\t\tCount Laszlo de Almásy.\n\nThe Officer is writing this down.  A glance at his Corporal.\n\n\t\t\tOFFICER\n\t\tAlmásy - would you mind just\n\t\tspelling that for me?  What\n\t\tnationality would that be?\n\n\t\t\tALMÁSY\n\t\tLook, listen to me.  A woman is dying -\n\t\tmy wife! - is dying seventy miles from\n\t\there.  I have been walking for three\n\t\tdays!  I don't want to spell my name, \n\t\tI want you to give me this jeep!\n\n\t\t\tOFFICER\n\t\t\t\t(writing)\n\t\tI understand you are agitated -\n\t\tperhaps you would like to sit down\n\t\twhile I radio back to HQ -\n\n\t\t\tALMÁSY\n\t\t\t\t(snapping)\n\t\tNo!  NO!  Don't radio anybody,\n\t\tjust give me the fucking jeep!\n\nAlmásy sets on the Officer, hauling him by the lapels, but them \nimmediately loses his balance.  As he stumbles up he gets the stock of \nthe Corporal's RIFLE across his head, KNOCKING HIM TO THE GROUND.\n\n\n185*.\tEXT.   EL TAJ STREET.    DAY.\n\nAlmásy, head pounding, is in the back of the jeep, chained to the \ntailgate.  He's desperate.  The Corporal is driving.\n\n\t\t\tALMÁSY\n\t\t\t\t(shouting hoarse)\n\t\tHey!  Hey!  Stop this jeep!  Let me\n\t\tout of here - there's a woman dying,\n\t\tthere's a woman dying while I'm - Hey!\n\n\t\t\tCORPORAL\n\t\tShut-up!\n\n\t\t\tALMÁSY\n\t\tPlease - I beg you, I beg you, I beg you,\n\t\tplease listen to me, this is a terrible\n\t\tmistake.  Just stop, please, and\n\t\tlisten to me.  My wife is dying.\n\n\t\t\tCORPORAL\n\t\tListen, Fritz, if I have to listen\n\t\tto another word from you I'll\n\t\tgive you a fucking good hiding.\n\n\t\t\tALMÁSY\n\t\tFritz?  What are you talking about?\n\t\tWho's Fritz?\n\n\t\t\tCORPORAL\n\t\tThat's your name innit?  Count\n\t\tFucking Arsehole Von Bismarck?\n\t\tWhat's that supposed to be then, Irish?\n\nAlmásy, berserk, starts to yank at his chains, screaming.\n\n\t\t\tALMÁSY\n\t\tLet me out, let me out, let me out -\n\t\tKatharine!  Katharine!\n\n\n186\tINT.    CAVE OF SWIMMERS.    TORCHLIGHT.\n\nKatharine has been writing in the Herodotus.  The torchlight FLICKERS.  \nShe shakes the torch.   It FLICKERS again.  Then goes out.  Absolute \nBLACKNESS.  The sound of her trembling breath.\n\n\n187*.\tEXT.    A TRAIN.    THE DESERT.    DUSK.\n\nA TRAIN scuttles through the desert.\n\n\n187a*.\tINT.    THE TRAIN.    THE DESERT.    DUSK.\n\nAlmásy is HANDCUFFED to the metal grille of the goods compartment.  \nHe's lying down amongst a bunch of other prisoners and their little \nbundles of possessions in this makeshift cell - some Arabs, some \nItalians.\n\nA SERGEANT pushes a lavatory-bound prisoner along the corridor, leaving \nbehind A YOUNG PRIVATE who sits on a packing case, with a rifle across \nhis lap, reading a Penguin edition of Gulliver's Travels.  Almásy is in \ncomplete despair to be on the train.  He tries to move, but he's locked \ntight to the grille.  He rattles the cuffs against the metal.\n\n\t\t\tALMÁSY\n\t\tExcuse me.\n\t\t\t\t(the Soldier looks up)\n\t\tI also need to use the lavatory.\n\n\t\t\tSOLDIER\n\t\tYou'll have to wait.\n\t\t\t\t(calls up the corridor)\n\t\tSarge!  Jerry wants to use the lav -\n\t\tsays it's urgent.\n\n\t\t\tALMÁSY\n\t\tWhere are we going, please?\n\n\t\t\tSOLDIER\n\t\tTo the coast.  Benghazi.  Soon be there.\n\t\tGet a boat home.  You'll be all right.\n\nALMÁSY CAN'T BEAR THIS NEWS.  The SERGEANT returns.\n\n\t\t\tSERGEANT\n\t\tWhat's up?\n\n\t\t\tALMÁSY\n\t\tCramps.  It's urgent.\n\n\t\t\tSERGEANT\n\t\tGo on then - you take him.\n\n\n188\tINT.    THE TRAIN CORRIDOR.    THE DESERT.    DAY.\n\nThe Soldier pushes Almásy along the corridor.  They arrive outside the \nlavatory.  The Soldier is distracted for a split second.  Enough for \nAlmásy to ELBOW HIM savagely in the stomach, winding him, then he KICKS \nHIM REPEATEDLY in the head.  He wraps his cuffs around the Soldier's \nneck and - yanking them together and twisting - produces a tiny, \nefficient and sickening snap.\n\nHe finds the KEY to the handcuffs, unlocks them, grabs the soldier and \ndrags him into the empty lavatory.\n\n\n189\tINT.    TRAIN.    THE DESERT.    EVENING.\n\nAlmásy arrives at the rear of the train, passes the Kitchen carriage, \nwhere Arabs sweat over the boiler.  He pulls open the back door only to \nsurprise a GUARD, who's lolling casually, enjoying the sunset.  Almásy \nSHOOTS HIM with his stole rifle.  He clambers over the guard rail and \nleaps off the train - tumbling into the desert sunset.\n\n\n190\tEXT.    RAILWAY TRACK.    THE DESERT.    EVENING.\n\nAlmásy, silhouetted against the evening sky, walks back down the track, \nTHREE HUNDRED MILES AWAY from the dying Katharine Clifton, no way now \nof saving her.  He is a tiny speck in the vast desert.  His heart \nbroken.  He sinks to his knees in despair.\n\n\n191*.\tINT.    THE PATIENT'S ROOM.    NIGHT.\n\nThe Patient is exhausted.  He has said aloud what has tortured him.  \nHis failure to save Katharine.  He looks at Caravaggio.\n\n\t\t\tTHE PATIENT\n\t\tSo yes.  She died because of me.\n\t\tBecause I loved her.  Because I \n\t\thad the wrong name.\n\n\n192\tINT.    THE MONASTERY STABLES.    DAY.\n\nKip is working at a BLACKSMITH'S FORGE in the Stables.  He is heating \npieces of metal.  He has arranged his material on a bench - a bayonet, \na rifle, a piece of bomb casting.\n\n\tHana enters, goes up, hugs him from behind.\n\n\t\t\tHANA\n\t\tWhat are you up to?\n\n\t\t\tKIP\n\t\tThat gun at Lahor, Kipling's cannon -\n\t\tZamzammah - remember?  That was \n\t\tmade out of the metal of ordinary things.  \n\t\tI want to make an ordinary thing\n\t\tout of guns.\n\nHis bayonet is thrust into the forge.  It's red hot.\n\n\t\t\tKIP\n\t\tWhen I went to England I was amazed at\n\t\twhat went on, the waste - I'd been taught\n\t\tto re-use everything, the dung from a cow\n\t\tto cool a radiator, a fork to fix a\n\t\ttypewriter - India could live for a \n\t\thundred years on what I saw thrown away.\n\n\t\t\tHANA\n\t\tI should go to the house, get breakfast.\n\n\t\t\tKIP\n\t\tThe lamp was burning all night in his\n\t\troom.  Caravaggio was there with him.\n\nShe goes to kiss him.   He is over the fire and protests.\n\n\t\t\tKIP\n\t\tThis is hot!\n\n\t\t\tHANA\n\t\t\t\t(teasing him)\n\t\tNya-nya-nya!\n\n\n193*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nCaravagio is injecting the Patient with morphine.\n\n\t\t\tCARAVAGGIO\n\t\tAnd did you never see Katharine?  You\n\t\tnever got back to the Cave?\n\n\t\t\tTHE PATIENT\n\t\tYes, I got back there finally to keep\n\t\tmy promise.  To come back for her.\n\t\tAnd then of course I couldn't... I\n\t\tcouldn't even do that properly.\n\n\n194\tINT.    THE MONASTERY STABLES.    DAY.\n\nKip hammers the metal into its new shape.  He stops, distracted by \nsomething he's listening to on his crystal set.  It's new he seems not \nto fully understand, about a bomb dropping on Japan.  A NEW KIND OF \nBOMB.\n\nTHE METAL GLOWS A VIVID RED ON THE ANVIL.\nSuddenly Kip slops it into the trough of water, sending a great hissing \ncolumn of steam.\n\n\n195*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nCaravaggio sits by the Patient.\n\n\t\t\tCARAVAGGIO\n\t\tYou get to the morning and the\n\t\tpoison leaks away, doesn't it?\n\t\tBlack nights, fucking black nights,\n\t\twhen you want to howl like a dog.\n\t\tI thought I would kill you.  You\n\t\tkilled my friends, you ruined my\n\t\thands.  But the girl was always\n\t\there, like some Guardian Angel.\n\n\t\t\tTHE PATIENT\n\t\tYou can't kill me.  I died years ago.\n\n\t\t\tCARAVAGGIO\n\t\tNo, now I can't kill you.\n\nKip storms into the room, walks straight up to the Patient and POINTS A \nGUN AT HIM.  Caravaggio is taken by surprise.\n\n\t\t\tCARAVAGGIO\n\t\tKip - what are - ?\n\n\t\t\tKIP\n\t\tStay out of this.\n\n\t\t\tTHE PATIENT\n\t\tKip?\n\n\t\t\tKIP\n\t\tI looked up to you, Uncle.  My brother\n\t\talways said I was a fool.  Never trust the\n\t\tBritish, he said: the deal-makers, the\n\t\tmap-makers; never shake hands with them.\n\n\t\t\tTHE PATIENT\n\t\tWhat are you talking about?\n\n\t\t\tKIP\n\t\tWhat have I been doing all this time?\n\t\tDo you know how many mines I've seen? -\n\t\tmore mines than there are soldiers, more -\n\t\thow many mines we've put in the ground\n\t\tourselves, stuffed in corpses, dropped\n\t\tout of the sky.  And now this.\n\nHe approaches the bed.  Caravaggio tries to intervene.\n\n\t\t\tCARAVAGGIO\n\t\tKip, listen -\n\nKip sings the rifle at him, KNOCKING HIM to the floor.\n\n\t\t\tKIP\n\t\tI said keep out of this!\n\nHe pulls of his earphones and rams them around the Patient's head, \ndropping the set onto the bed.  The Patient listens, coughing.\n\n\t\t\tKIP\n\t\tCan you hear?  Can you hear what they're\n\t\tcelebrating?  I listened to you, Uncle.\n\t\tSitting at your feet - always sitting at\n\t\tsomebody's feet - trying to learn.  The\n\t\tright way to hold a teacup, otherwise\n\t\tyou're out, the pukkah knot in your tie -\n\t\tas if everything can be explained in\n\t\tterms of a cricket bat and an accent.\n\n\t\t\tCARAVAGGIO\n\t\tKip -\n\n\t\t\tKIP\n\t\tKip! - it's not even my name because\n\t\tyou can't say it.  Kirpal Singh Bhuller\n\t\tis my name.\n\nHana runs in, alerted by the commotion, stunned by what she sees.\n\n\t\t\tCARAVAGGIO\n\t\tWell, then ask him his name!\n\n\t\t\tHANA\n\t\t\t\t(getting in between Kip and the Patient)\n\t\tWhat's happened?  Kip!  What's happening?\n\t\tDon't shoot, please, don't shoot anybody.\n\n\t\t\tKIP\n\t\tThey're excited!  They're happy about\n\t\tdestroying a whole city.  Would they\n\t\tdo that to a White Man's City?  Never!\n\n\t\t\tTHE PATIENT\n\t\t\t\t(pulling off the earphones)\n\t\tGo on, do it.  I don't need to hear any more.\n\n\t\t\tCARAVAGGIO\n\t\tKip, listen, he lost everything because\n\t\the wasn't English - Jesus! - shoot me,\n\t\tI'm more English than he is!\n\nKip levels the gun at the Patient.  Then breaks it open, throws it down \non the bed, next to the earphones, from which the news continues to \nleak, some words audible - Eunola Gay... Hiroshima... and from \ndifferent voices - It was beautiful!  just beautiful!  Bang! the \nbiggest bang you ever saw!\n\n\n196\tEXT.    KIP'S TENT.    LATE DAY.\n\nHana approaches.  Kip is inside the tent, the flap zipped.  She sees \nhis shadow move, then freeze as she calls his name.  It's like a \nconfessional.  The flap between them, the man in shadows, Hana \ncrouched, forlorn.\n\n\t\t\tHANA\n\t\tKip.  Kip.  It's me.\n\t\t\t\t(no response)\n\t\tWhy?  It's another bomb.  However\n\t\tbig, what's the difference?  There've\n\t\tbeen so many bombs.  What about\n\t\tCoventry?  What about Dresden?\n\t\tWhere were those cities?\n\t\t\t\t(no response)\n\t\tI don't understand.  Let me come in.\n\nThe shadow doesn't move.  Hana is at a loss.\n\n\n197\tINT.    THE PATIENT'S ROOM.    EVENING.\n\nThe Patient becomes aware of something in the room, opens his eyes, \nsquints into the darkness and sees A FIGURE hovering against the wall.  \nHe's in the Cave, he thinks, he's seeing the painted figures moving, \nhe's seeing the Swimmer.\n\nKIP - bare chested, no turban, hair loose - stands in the shadows at \nthe foot of the Patient's bed.\n\n\n198\tINT.    HANA'S ROOM.    EVENING.\n\nKip comes into the room.  Hana sits in the corner.  She is nervous of \nhim, his look, his intensity.\n\n\t\t\tKIP\n\t\tWill you come with me?\n\n\t\t\tHANA\n\t\tOf course.  When?\n\n\t\t\tKIP\n\t\tI mean home.  India.\n\n\t\t\tHANA\n\t\tKip... I -\n\n\t\t\tKIP \n\t\t\t\t(interrupting this)\n\t\tI know - here I am always a brown man,\n\t\tthere you would be always a white woman.\n\n\t\t\tHANA\n\t\tIs that what you think?  Is that what\n\t\tyou think I think?\n\n\t\t\tKIP\n\t\tIt's what I've learned.\n\n\t\t\tHANA\n\t\tI'm thinking about your heart, not\n\t\tyour skin.  And how to reach it.  And\n\t\tthat I don't think I can.  A bomb\n\t\thas ruined us, just not the bomb\n\t\tI thought would ruin us.\n\nShe stands, goes to him.\n\n\t\t\tHANA\n\t\tI've clung to you.  I've clung to you.\n\t\tKip.  Life  a raft.  \n\n\t\t\tKIP \n\t\t\t\t(clinging to her)\n\t\tThen come with me.\n\n\n199\tEXT.    THE MONASTERY.    DAY.\n\nNext morning and Kip has attached what he was making in the forge - A \nNEW HANDLE - to the pump.  Now he works it, producing a steady stream \nof water.  His motorbike is against the wall.  He goes to it.  \nCaravaggio is watching.  He hugs Kip, wrapping his arms around the boy \nlike a bear.\n\n\n199a*.\tEXT.    HANA'S VEGETABLE GARDEN.    DAY.\n\nHANA stands by her Vegetable Garden.  Kip stops the motorbike.  She \ngoes to him, stands, FASTENS THE TOP BUTTON of his coat.  You feel she \nmight jump on the seat behind him.  But she doesn't.\n\n\t\t\tHANA\n\t\tI'll always go back to that church.\n\t\tLook at my painting.\n\n\t\t\tKIP\n\t\tI'll always go back to that church.\n\n\t\t\tHANA\n\t\tSo one day we'll meet.\n\nHe nods, winds up the throttle, and is gone.\n\n\n200\tINT.    THE PATIENT'S ROOM.    DAY.\n\nHana comes in carrying FLOWERS and sets them down on the table next to \na clutch of MORPHINE AMPOULES.  She picks up the hypodermic to prepare \nhis injection.  She takes a phial.  THE PATIENT REACHES OUT AND PUSHES \nTWO MORE TOWARDS HER.   THEIR EYES MEET, THEN HE SHOVELS ANOTHER, THEN \nALL OF THEM.  She looks at him.  IT'S A MASSIVE, LETHAL DOSE.\n\nHana starts to prepare the injection, her eyes filling with tears.  The \nPatient nods, smiles, whispers.\n\n\t\t\tTHE PATIENT\n\t\tThank you.  Thank you.\n\nShe kisses him, gently on the mouth.  He closes his eyes.\n\n\t\t\tTHE PATIENT\n\t\tRead to me, will you?  Read me to sleep.\n\n\n201*.\tEXT.(NEAR THE) BASECAMP. CAVE OF SWIMMERS. 1942. DAY.\n\nThe familiar cleft in the rocks.  A PLANE is coming in to land.\n\n\n202\tINT.    CAVE OF SWIMMERS.    TORCHLIGHT.\n\nA flashlight flickers in the cave.  ALMÁSY APPEARS.\n\nKATHARINE'S CORPSE lies where he left her - a ghost on a bed of silk \nand blankets.  The chill of the cave has preserved her.  She could be \nasleep.  She clutches the Herodotus.\n\n\t\t\tALMÁSY\n\t\tKatharine, my darling.\n\nHe sobs, whispering to her.  He's terribly cold, exhausted.  He slips \nunderneath the covers to be next to her, and closes his eyes.\n\n\t\t\tALMÁSY\n\t\tI'm so tired.\n\n\n203*.\tINT.    THE PATIENT'S ROOM.    DAY.\n\nThe Patient is slipping away.  Hana is reading from the last pages of \nthe Herodotus where KATHARINE HAS WRITTEN IN THE MARGINS.\n\n\t\t\tHANA\n\t\tMy darling, I'm waiting for you - how\n\t\tlong is a day in the dark, or a week?\n\nThe Patient looks across AND WHAT HE SEES IS KATHARINE BESIDE HIM IN \nTHE BED, SMILING, STROKING HIS HEAD, SPEAKING TO HIM.\n\n\n204\tINT.    CAVE OF SWIMMERS.    FLASHLIGHT.\n\nKatharine is writing.  The FLASHLIGHT is faint.  She shivers.\n\n\t\t\tKATHARINE (O/S)\n\t\t...the fire is gone now, and I'm\n\t\thorribly cold.  I really ought to\n\t\tdrag myself outside but then\n\t\tthere would be the sun...\n\nShe passes the flashlight across the wall, the painted figures dancing \nin the pale light.\n\n\t\t\tKATHARINE (O/S)\n\t\tI'm afraid I waste the light on the \n\t\tpaintings and on writing these words...\n\n\n205\tINT.    THE PATIENT'S ROOM.    DAY.\n\nTHE BED IS EMPTY, THE MATTRESS STRIPPED.  Hana stands in the doorway, \nthen sees THE HERODOTUS on the bedside table.\n\nShe picks it up, goes to the page of Katharine's letter, continues to \nread.\n\n\t\t\tKATHARINE (O/S)\n\t\tWe die, we die rich with lovers and\n\t\ttribes, tastes we have swallowed...\n\n\n206*.\tEXT.    LANE OUTSIDE THE MONASTERY GARDEN.    DAY.\n\nCaravaggio is at the gate to the Monastery.  The TRUCK we saw before is \nwaiting with him.  The PARTISAN with his head bandana and shotgun \nremains the same, but now there are CHILDREN in the back and a WOMAN \nsits behind the man, nursing a two-year-old.\n\n\t\t\tCARAVAGGIO\n\t\tHana!  Come on!\n\nHe gets up into the BALUSTRADE, tentatively finds his balance, then \nstarts to walk, heel to toe - slowly, and then with more confidence - \nalong the long thin line of stone.  The children watch intently.  He \nturns and bows.\n\n\t\t\tKATHARINE (O/S)\n\t\t...bodies we have entered and swum up\n\t\tlike rivers, fears we have hidden in\n\t\tlike this wretched cave...\n\n\n207*.\tEXT.    THE MONASTERY CLOISTERS.    DAY.\n\nHana walks across the cloisters, passing the chalked hopscotch squares, \nleaving it all behind.  Then she stops, bends, retrieves A SNAIL SHELL, \nkeeps going.  KATHARINE'S VOICE CONTINUES.\n\n\n208\tINT.    THE CAVE OF SWIMMERS.    TORCHLIGHT.\n\nALMÁSY SMUDGES KATHARINE'S PALE FACE WITH COLOR.  OCHRE across her \nbrow, BLUE on her eyelids, RED on her lips.  He presses his cheek to \nhers, smoothes her hair.\n\n\t\t\tKATHARINE (O/S)\n\t\t...I want all this marked on my body.\n\t\tWe are the real countries, not the\n\t\tboundaries drawn on maps with the\n\t\tnames of powerful men...\n\n\n209*.\tEXT.    THE LANE OUTSIDE MONASTERY GARDEN.    DAY.\n\nKATHARINE'S VOICE CONTINUES.  Hana comes out to the truck, carrying her \nsmall bundle.  Caravaggio effects some introduction, beginning with the \nwoman driver, Gioia.  She and Caravaggio smile like lovers.\n\n\t\t\tCARAVAGGIO\n\t\tHana - this is Gioia.\n\nGioia smiles, shakes her hand.  Then Hana meets the others - Gioia's \nbrother and wife, their children.   She smiles at them.\n\n\t\t\tHANA\n\t\tBuon' giorno.\n\n\t\t\tCARAVAGGIO\n\t\tShe can take you as far as Florence.\n\n\t\t\tHANA\n\t\tI can get in the back.\n\nAnd she clambers up, sits down between the children.  They exchange \nsome small stiff, shy smiles, and then the truck bounces away.  Hana \ntakes one final look at the Monastery as it disappears around the bend \nand then turns and confronts the life insisting noisily in the truck.\n\n\n210\tEXT.    CAVE OF SWIMMERS.    DAY.\n\nAlmásy comes out of the cave, carrying the bundle of Katharine in his \narms, wrapped in the silks of her parachute.\n\n\t\t\tKATHARINE (O/S)\n\t\t...I know you will come and carry me\n\t\tout into the palace of winds, the rumors\n\t\tof water... That's all I've wanted -\n\t\tto walk in such a place with you, with\n\t\tfriends, on earth without maps.\n\n\n211\tEXT.    TIGER MOTH.    DAY.\n\nTHE PLANE growls and complains into the air.\n\n\n212\tINT.    TIGER MOTH.    DAY.\n\nINSIDE THE COCKPIT:  THE COUPLE AS AT THE FRONT OF THE FILM.  Almásy \nobliterated by goggles and helmet.  Katharine behind him, slumped \nforwards as if sleeping.\n\nAlmásy banks across the plateau of the Gilf Kebir and glances down.  In \na ravine is a sudden OASIS OF WHITE ACACIAS.  He is mesmerized.\n\nAnd then it's gone and he passes into the earth without maps - the \ndesert - as it stretches out for mile after mile.\n\n\t\t\tKATHARINE (O/S)\n\t\tThe lamp's gone out and I'm writing\n\t\tin the darkness...\n\nAlmásy, the English Patient, begins to sing - Szerelem, Szerelem - \nuntil that also fades and is replaced by the woman's tender lament \nheard at the beginning of the film, singing for all that has been lost.\n\nThe sound of gun fire...\n\n\nTHE END.\n\n\n\n\n\n\n\n\t\tCAST:\n\nCount László Almásy\t\t\tRalph Feinnes\nHana\t\t\t\t\t\tJuliette Binoche\nKatharine Clifton\t\t\t\tKristin Scott Thomas\nCaravaggio\t\t\t\t\tWillem Dafoe\nKip\t\t\t\t\t\tNaveen Andrews\nGeoffrey Clifton\t\t\t\tColin Firth\nPeter Madox\t\t\t\t\tJulian Wadham\nMajor Müller\t\t\t\tJürgen Prochnow\nSergeant Hardy\t\t\t\tKevin Whately\nFenelon-Barnes\t\t\t\tClive Merrison\nD'Agostino\t\t\t\t\tNino Castelnuovo\nFouad\t\t\t\t\t\tHichem Rostom\nBermann\t\t\t\t\tPeter Rühring\nMary\t\t\t\t\t\tTorri Higginson\nOliver\t\t\t\t\tGeordie Johnson\nJan\t\t\t\t\t\tLiisa Repo-Martell\nKamal\t\t\t\t\t\tSamy Azaiez\nRupert Douglas\t\t\t\tRaymond Coulthard\nCorporal Dade\t\t\t\tPhilip Whitchurch\nAl Auf\t\t\t\t\tHabib Chetoui\nOfficer, El Taj\t\t\t\tDominic Mafham\nCorporal, El Taj\t\t\t\tGregor Truter\nSergeant, Desert Train\t\t\tRoger Morlidge\nPrivate, Desert Train\t\t\tSimon Sherlock\nBeach Interrogation Officer\t\tAnthony Smee\nKiss Me Soldier\t\t\t\tJason Done\nLady Hampton\t\t\t\tPaul Kant\nSir Ronnie Hampton\t\t\tAmanda Walker\nAncient Arab\t\t\t\tAbdellatif Hamrouni\nAicha\t\t\t\t\t\tRim Turki\nArab Nurse\t\t\t\t\tSonia Mankai\nInjured Canadian Soldier\t\tMatthew Ferguson\n\n\nScreenplay Adapted and Film Directed by  Anthony Minghella\nProduced by  Saul Zaentz\nExecutive-Produced by  Bob Weinstein, Harvey Weinstein, \nand Scott Greenstein\nLine-Produced by  Alessandro von Norman\nCinematography by  John Seale\nProduction Design by  Stuart Craig\nCostume Design by  Anne Roth\nMake-up by  Fabrizio Sforza\nOriginal Music by  Gabriel Yared\nFilm Edited by  Walter Murch\nCasting by  Michelle Guish\nCinematography (Second Unit) by  Remi Adefarasin\nDirected (Second Unit) by  Peter Markham\nMusic Performed by  The Academy of St Martin-In-The-Fields\n\tConducted by  Harry Rabinowitz\n\n   \n\n\n\n\n\n\n\nEnglish Patient, The\nWriters :   Anthony Minghella\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:24:31.171625"}