{"title": "Erik the Viking", "film_link": "/Movie Scripts/Erik the Viking Script.html", "script_link": "/scripts/Erik-the-Viking.html", "info_raw": "\n\nErik the Viking Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (3.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Terry Jones\nGenres  Fantasy\n\nRead \"Erik the Viking\" Script\n\n\n", "script": "\n\n        Erik the Viking\n\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b> \n\n\n\n\n\n\n\n\n\nERIK THE VIKING - Terry Jones ---------------\nBlackness. Flames begin to lick upwards from the bottom of the screen. Suddenly all hell breaks loose. Screaming, yelling. Black figures flash across the foreground, with the flames still burning behind. There follows a confusion of burning,  raping, killing and looting - we don't clearly see what's going on. Suddenly we cut to the interior of a hut. The door is in the process of being broken down.  The  camera  pans  onto  the  close-up  face  of an attractive girl who is staring  in  horrified  fascination at the door. Her arms are white with fresh dough and flour. Suddenly the door bursts open and  a wild-looking Viking leaps into the hut. He holds a sword. He looks around wildly and then his eyes come to rest on the girl. This Viking, I'm afraid, is Erik. We are  about to see him in the worst possible light so be prepared. The girl,  whose  name  is  Helga,  cowers,  and  looks  terrified  but resolute. Erik glances round. Then slowly he advances on the girl, forcing her back onto a chest. Erik holds his sword to Helga's  throat  with his right hand, while his left hand searches to find the thongs holding up his trousers. He is clearly having difficulties  trying  to  hold  his heavy sword to Helga's throat at he same time as  undoing his trousers. He fumbles and lowers his sword for a moment.\nHELGA\nHave you done this sort of thing before?\nERIK\nMe? Of course! I've been looting  and pillaging up and down the coast.\nHELGA\n(looking sceptical)\nLooting and pillaging, eh?\nERIK\n(on the defensive)\nYes.\nHELGA\nWhat about the raping?\nERIK\nShut up.\nHELGA\nIt's obvious you haven't raped anyone in your life.\nERIK\nSh!\nHe covers her mouth with his free hand, and looks round to make sure no one's heard. Then he carries on trying  to undo his trousers, but he is now somewhat more than half-hearted about it. Helga watches suspiciously.\nHELGA\nDo you LIKE women?\nErik is clearly shocked and stung by the insinuation. He stops.\nERIK\nOf course I like women... I LOVE 'em.\nHELGA\n(pointing out the obvious)\nYou don't love ME.\nERIK\nNo... right... this  is  RAPE...  Mark  you,  I'm  not saying I couldn't get to  like  you...  in  fact...  well,  to  be quite honest, I prefer it when  there's  some  sort of mutual feeling between two people...\nHELGA\nWhat - rape?\nERIK\nNo. It isn't rape then, is it?\nHELGA\nOh, get it over with.\nERIK\n(hesitates again)\nI don't suppose... no...\nHELGA\nWhat?\nERIK\nI don't suppose you... you DO like me at all?\nHELGA\nWhat d'you expect? You come  in  here, burn my village, kill my family and try to rape me...\nThis is too much for Erik. We withers under the irony.\nERIK\nI'll kill you if you say anything about this to anyone.\nHELGA\n(puzzled)\nAbout raping me?\nERIK\nAbout NOT raping you...\nHELGA\nYou DON'T like it, do you?\nERIK\nWell it just seems a little bit crude, that's all.\nHELGA\nWhat about the killing and looting? That's just as crude, isn't it?\nERIK\nOh well - you've GOT to do them.\nHELGA\nWhy? Why have you got to go round killing and looting?\nERIK\nTo pay for the next expedition, of course.\nHELGA\nBut that's a circular argument! If the only reason for going on an expedition is the killing  and  looting  and the only reason for the killing and looting is  to pay for the next expedition, they cancel each other out.\nERIK\nOh! Stop talking as if we were married!\nHELGA\nWell you started it.\nERIK\nI just said I didn't feel like raping you.\nHELGA\nAnd I was just saying that  rape  is no MORE pointless or crude than all the killing and looting that goes on. Erik vents of his frustration on the already shattered door.\nERIK\nScream.\nHELGA\nAh.\nERIK\nLouder.\nHELGA\nAaagh! Rape!\nERIK\n(he'd forgotten about that)\nOh, thanks\nTwo more Vikings  burst  in  with  eyes  blazing.  They  have  the very unfortunate names of Ernest and Jennifer, but it doesn't really matter, for reasons which  will  become  obvious  very  quickly.  They are also slightly drunk.\nERNEST\nRape?\nJENNIFER\nWhere?\nJennifer the Viking sways and leans against a door post. The marauder's eyes come to rest on Erik  and  Helga  who are standing, fully clothed, about six feet apart. They look slightly puzzled.\nHELGA\nHe raped me standing up.\nThere is a pause. Erik looks up at Helga. Why has she saved his face by telling this lie? Jennifer the Viking turns to Erik.\nJENNIFER\nYou finished, then?\nERIK\nOh... yes... I suppose so...\nERNEST\nRight! Me first!\nJENNIFER\nNo! I asked!\nErnest leaps on top of Helga and pins her to the ground. Jennifer joins in. Erik looks stunned for a moment.  Then he suddenly leaps to Helga's defence.\nERIK\nLeave her alone!\nHe pulls Jennifer off, but  Jennifer  fights back. Erik forces Jennifer back until he falls into the  kneading  trough. They fight in the dough for some moments,  until  Erik  runs  Jennifer  through.  The  dough is stained red, and the  film  is  rid  of  such  an inappropriately named Viking once and for all. Erik then turns his attention on Ernest  who  is still on top of Helga. Without a moment's hesitation, Erik  runs  him through the back. Ernest screams. So does Helga. Erik turns white, and pulls out his sword. Ernest falls over into a  heap  with  his  co-misnomer, and Erik kneels beside Helga to  find  a  bloodstain  under  her  breast  where  he has inadvertently run her through. She is clearly not long for this world.\nHELGA\nThanks for saving me from a fate worse than death.\nERIK\nI didn't mean to!\nHELGA\n(gasping for breath)\nOh,  that's  all  right  then... it's the thought... that counts...\nErik cradles her head and tries helplessly to staunch the blood.\nERIK\nYou told them I raped you - why?\nHELGA\n(dying)\nI dunno... you looked so... so vulnerable...\nERIK\nWhy should you care?\nHELGA\n(dying)\nWhy... should YOU care?\nERIK\nTell me your name?\nHelga looks up at him, but  dies  in  his arms, without ever saying her name.\nERIK\nTell me... what IS it...?\nErik realizes she has gone. He  gazes  at  her  for some time. He looks around at the two dead  bodies  beside  them.  Then  he listens to  the sound of raping and slaughter  continuing  on  the outside. Screams and bloodthirsty shuts echo alongside the roar  of  flames and the cries of animals. The camera tracks into a big close-up on Erik. Superimpose the title: ERIK THE VIKING: Second title: TIM ROBBINS. Mix through to wide shot of  the  burning village. Figures running here and there. Superimpose the rest of the opening titles. By the last of the  opening  titles  the  last  of the flames are dying down. Cut to a close-up  of  a  very  loud-looking  Viking screaming into the camera, as he  hurls  an  axe.  This  Viking's  name is Thorfinn Skull- Splitter. The axe thuds into the  wall  a  few  inches  away  from  the face of a frightened girl, Unn, who is pinned to  the wall with her braids spread out. The Vikings are hurling  axes  at  her  a  la  Kirk Douglas in THE VIKINGS.  Several Vikings sitting at ale-bench, laugh in a rather unpleasant way. Erik, however, frowns. He is sitting at a  table on a dais, next to his grandfather, the chief of  the  village.  His grandfather almost chokes with merriment. Erik's mother glances at him with some hostility. Meanwhile the drunken Thorfinn has just lifted the totally legless Ivar the Boneless up off the  floor  and  presses  an  axe  into his hand. A tremor of nervousness ripples round the  females in the Mead Hall. Ivar is clearly in no  condition  to  throw  anything,  except, perhaps, the contents of his stomach. Unn winces. Finally, amidst much giggling, Ivar throws  wildly, and the axe smashes into a jug being carried by one of the serving girls. The menfolk erupt into  drunken  hysterics  at  this. The women clearly feel that the occasion is getting out  of  hand. But before any of them can work up enough  courage  to  intervene, Thorfinn Skull-Splitter has thrust an axe into  the  hands  of  the  even  more  plastered Sven the Berserk. Now Sven is not the  Viking  to  let  a little matter like not being able to see straight stop him  heaving the axe at a young maiden. He takes the axe and whirls  it  wildly  over  his head. Even the other drunken Vikings realize this could be  dangerous, and they cower behind the table. Sven lets go of the axe. Unn shuts her eyes prepared for the worst. There is a dull thud and a  grunt and then a whoop of mirth. Unn opens her eyes to find that the axe  has  come to rest in the back of a totally stupefied Viking who merely slumps forward onto the table he is sitting at. On the opposite side sits Harald Missionary, a rather seedy cleric who has long since  given  up  trying  to convert the pagans and found solace in their mead.  He  thinks  about intervening, but decides that it's a bit late really and  that  he  might as well finish off his ale-cup instead. GRIMHILD HOUSEWIFE  (his  only  admirer) refills it for him. At this moment, however, the axe-throwers have  run out of axes, so, as they go to retrieve the  ones  they've thrown, Harald Missionary salves his conscience by lurching across to the unfortunate Unn. He pokes his dog-eared bible under her nose.\nHARALD\nIf you were thinking of  converting,  my dear, this would be an IDEAL opportunity...\nUNN\nNot now!\nHARALD\n(who is used to rebuffs)\nNo,  of  course not...\n(he hesitates)\nYou might not get another chance, you know...\nUNN\nGo away.\nAt this moment another axe  thuds  into  the wall, speeding up Harald's desire to get back to the ale-bench.\nHARALD\nYes, of course... I'll pray for you anyway, my dear...\nSuddenly an axe shatters a large earthware vessel.\nHARALD\nYes.. That's what I'll do...\nHarald scuttles back to the ale-bench as fast as he can. Erik meanwhile, stares in astonishment  as,  for  a fleeting moment, he sees Helga, the girl he  accidentally  killed,  standing there with her braids spread out in place of  Unn.  He  shakes his head and the vision passes. In the meantime, however, Ivar's mum  (perhaps the toughest lady in the village) has decided that enough is enough.\nIVAR'S MUM\nLet her go!\nTHORFINN\nWhy?\nVIKINGS\nYes, why?\nSVEN THE BERSERK \nWhy should we let er go?\nTHORFINN\nWe haven't hit a single braid yet!\nThe Vikings all guffaw. Ivar's mum has had enough. She throws the contents of a jug of ale over Thorfinn. He is shocked, but  after  the  first  shock he grins evilly, because now he's been given  carte  blanche  to  do the thing he enjoys doing most. Without another thought he  throws  a vicious right hook at Ivar's mum and lays her out cold. Erik reacts with disgust. His grandad, however, gives a whoop of glee.\nGRANDAD\nWhoah! Heee! That showed her!\nMeanwhile a little shrivelled old man is jumping up and down.\nINGEMUND THE OLD \nHey! He hit my wife!\nIngemund starts to go for Thorfinn,  but  Thorhild beats him to it. She grabs one of  the  long-handled  cooking  griddles  from  the fires and swings it at Thorfinn. Thorfinn, however,  ducks,  and  the  red-hot  griddle  hits  Sven  the Berserk, who is standing with his back to Thorfinn. Sven screams and goes berserk,  turning  round and hitting Thorfinn who is now standing upright again.\nINGEMUND THE OLD\nLeave him alone.\nIngemund hits Sven. Thangbrand hits Ingemund and a general fight breaks out. Erik's grandad clearly considers  this  the  highlights of the evening, but Erik looks  at  it  in  disgust  and  at  his  grandad  in despair. Eventually he gets up and walk out of the Mead Hall. His grandad notices and  frowns.  He  knows  something's wrong with his grandson but hasn't a clue what  it  could be. Erik's mother frowns and nods to his grandad. Grandad gets up and fights his way through the melee to follow Erik out of the Hall. The snow lies thick over  the  village  as Erik's grandfather joins his grandson beside the little  quay.  Erik  is  staring  broodily into the night.\nGRANDFATHER\nWhat's the matter, son?\nErik doesn't reply. His  grandfather  glances  back  at  the Mead Hall, whence the sound of the fight drift across the snow.\nGRANDFATHER\nWe're missing all the fun...\nERIK\nWhat's it all about?\nGRANDFATHER\nWhat?\nERIK\nWe toil and labour, we  loot  and pillage, rape and kill... and  yet...\nGRANDFATHER\nYou talking piffle, son?\nERIK\nWhere does it all get us, Grandpa?\nGRANDFATHER\nWho have you been talking to?\nERIK\nI met this girl...\nGRANDFATHER\nIt's always the women that start the trouble.\nERIK\nShe got me thinking...\nGRANDFATHER\nSo? What'd you do to her?\nErik stops in his tracks - as if brought up short by the horror of what he has done.\nERIK\nI... I... KILLED her...\nGRANDFATHER\nThat's my boy!\nErik's grandfather gives him  a  paternal  hug.  Erik  looks at him and thinks about the generation gap. Cut to feet running in the snow. It is day.\nERIK\nFreya!\nErik looks around him and calls out again.\nERIK\nFreya!\nErik runs into the  distance  -  a  small  figure  against the dramatic wintry landscape.\nCut to a remote, barren mountainside. Erik climbs up into shot,  and  continues  climbing  until he reaches a cave. He enters it. As his eyes get used  to the dark he can make out a few signs of life: a cooking  pot  on  a  fire,  a straw bed, a pile of rune-sticks.\nERIK\nFreya? Freya?\nThere is a bundle of rags behind  Erik.  A  head rises from it. This is Freya.\nFREYA\nAh... Erik... Erik the \"Viking\"...\nIt is not clear whether her words are not a little mocking.\nFREYA\nNow what CAN you want with me, Erik the \"Viking\"?\nERIK\nI shouldn't have come.\nFREYA\nThey will make  fun  of  you  for  listening  to an old woman's stories?\nErik doesn't reply. Freya watches him craftily.\nFREYA\nYoung men are only interested in fighting and killing.\nErik looks up at her sharply. It is as if she has read his mind.\nERIK\nBut has it always been like  that, Freya? From the beginning of time?\nFreya doesn't reply. Instead she walks  to  the mouth of the cave. Erik follows her. They look out at the grey, desolate landscape. Nothing but arctic wastes, snow and desolation.  Above  them  the black clouds boil ceaselessly.\nFREYA\nWhat do you see, Erik?\nERIK\nI see the world.\nFREYA\nI it night or day, Erik?\nERIK\nIt is day, of course, Freya.\nFREYA\nIs it summer or winter, Erik?\nErik looks round at the snowy wastes and ten back at Freya, puzzled.\nERIK\nThe winter is past, thank goodness, Freya. It is summer.\nFreya puts her face close to Erik's and peers into his eyes.\nFREYA\nHave you ever seen the sun, Erik?\nERIK\nThe sun is up beyond the clouds - where it always is.\nFREYA\nBut have you ever seen it? Think back...\nERIK\nOf course not... but...  when  I  was  a child.... I remember a dream.... it was as if the whole sky was blue...\nFREYA\nThe sky WAS blue, Erik... once.\nErik looks at her.\nFREYA\nThe Old Stories tell of an  age  that would come such as this - when Fenrir the Wolf would swallow  the sun, and a Great Winter would settle upon the world. It was  to  be an axe age, a sword age, a storm age, when brother  would turn against brother, and men would fight each  other  until  the  world would finally be destroyed.\nErik looks out across the  bleak  and  gloomy  landscape and the black, boiling clouds in the sky.\nERIK\n(almost to himself)\nThen... this is the Age of Ragnarok?\nFreya turns to go back into the cave.\nERIK\nWait, Freya!\nErik re-enters the cave.\nERIK\nIs there nothing men can do?\nFREYA\nThe Gods are asleep, Erik.\nERIK\nI will go and wake them up!\nFreya  turns  and  looks  at  him.   She  clearly  enjoys  his  earnest enthusiasm, but is afraid he doesn't know what he is talking about.\nERIK\nTell me what I must do, Freya!\nFreya thinks for some moments. The she speaks.\nFREYA\nErik... Far out in the  midst  of  the Western Ocean there is a land... men call it Hy-Brasil. There  you will find a horn that is called Resounding. You  must  take  the Horn Resounding, and three times you must blow it.  The  first note will take you to Asgaard. The second will awaken  the  Gods,  and the third note will bring you home. But remember...  once you are in the spell of the Horn, hatred will destroy you. \nErik turns to go and then hesitates.\nERIK\nAnd will the dead ever return, Freya?\nFREYA\nThat I cannot tell you.\nCut to a big close-up  of  a  head  being  banged  on the ground. It is Thorfinn Skull-Splitter's. The person doing  the  banging is an enraged Sven the Berserk. Suddenly Erik pushes his way through the crowd and separates them. There is general disgruntlement all round, and murmurs of: \"Who does he think he is?\"\nERIK'S GRANDAD\nWhat are you doing, Erik? Thorfinn just said SVEN'S GRANDFATHER\ndied of old age.\nINGEMUND THE OLD \nThey must fight to the death.\nTHORFINN SKULL-SPLITTER \nThat's right! Sven must kill me.\nOTHERS\nYes. Stay out of this. What's it to do with you?\n(etc)\nSven grids his teeth and struggles  to  get at Thorfinn, but Erik still keeps them apart.\nERIK\nAren't you afraid of death, Thorfinn Skull-Splitter?\nThorfinn shrugs.\nTHORFINN\nNot death by the sword! It means I shall drink in Valhalla with the great warriors. \nCut away To Harald Missionary engaged in his usual business of chatting up any available female.\nHARALD MISSIONARY \nYou don't still believe in all that Valhalla stuff, do you?\nTHORHILD THE FEMALE \nGo away.\nHARALD\nFine... right... just checking.\nHe moves off.\nERIK\nAnd you, Sven, aren't you afraid of crossing the Rainbow Bridge to Asgaard?\nSVEN\nI will join my grandfather there.\nTHORFINN\nHe's not in Valhalla! He died of old age!\nSVEN\nYou liar!\nThey start trying to kill each  other  again, and crash through a fence into the pig-sty. Pigs squeal and run in all directions.\nERIK\nStop it!\nOTHERS\nLeave them alone! Keep out of it, Erik!\nThe others pull Erik away.\nGRANDAD\nThere's only one way to settle it.\nEVERYONE\nYes!\nTHORFINN\nHe MUST kill me!\nEVERYONE\nYes! That's right!\n(etc)\nSven struggles again to  oblige,  and  they  both  topple into the duck pond. Erik dives back to keep them apart.\nERIK\nThere is another way.\nGRANDAD\nWho gets killed?\nERIK\nNobody gets killed.\nTHORFINN\nOh, well...\nHe starts attacking Sven again. Erik  decides  there is only one way to make his  point.  He  lets  fly  with  his  fists  and  lays  both  the antagonists out for a moment.\nERIK\nBut it will be dangerous. Maybe none of us will return.\nSNORRI THE MISERABLE \nAh  well,  that's  much  more  sensible than just Thorfinn getting killed. Shall we all go and pack now?\nSVEN\nWhat are you talking about, Erik?\nERIK\nWhat if we could find Bi-Frost the Rainbow Bridge?\nThis causes a sensation amongst everyone watching, on the lines of \"You can't do that\" and so on. They scoff at Erik.\nTHORFINN\n(in disbelief)\nFIND the Rainbow Bridge?\nERIK\nFind it... AND cross it!\nSuper-sensation amongst everyone  -  except  for  Harald Missionary who shakes his head sadly.\nHARALD\nLook! You can't find somewhere that doesn't exist.\nGRANDAD\n(to Harald)\nShut up!\nHarald shrugs.\nSVEN\nOnly the dead reach Asgaard, Erik.\nERIK\nWhat's the matter? Are you afraid to try?\nThorfinn and Sven are put on the defensive.\nTHORFINN\nOf course we're not afraid to try, but...\nErik rounds on Thorfinn, sensing he had the advantage.\nERIK\n\"But\" what?\nTHORFINN\nBut...\nERIK\nWhat?\nThorfinn's mental powers find it hard  to articulate any proposition on such a vast metaphysical concept. Sven comes to his rescue.\nSVEN\nNobody's ever crossed the Rainbow Bridge to Asgaard.\nERIK\nWe'd be the first!\nSNORRI\nYou mean we'd be dead?\nERIK\nNo! We'd be the first living  men  to  set foot in the Halls of the Gods.\nPause. Uncomfortable shifting.\nSVEN\nBut HOW?\nERIK\nI don't know - but I'm not afraid to try.\nTHORFINN\nWell I'M certainly not, either.\nSVEN\nNeither am I.\nERIK\nThen you'll come.\nHARALD\nBut there isn't such a place as... Look...\nTHORFINN & SVEN\nShut up!\nERIK\nWhat d'you say?\nSVEN\nWell... I'm game.\nTHORFINN\nMe too.\nErik grins. He has persuaded them against their will.\nGRANDAD\nAren't you going to go on fighting?\nSVEN & THORFINN\nNo.\nOTHERS\nOh...\nThere is general disappointment all around.\nIVAR THE BONELESS \nOh, go on...\nGRANDAD\nJust have a bit of a fight.\nINGEMUND THE OLD \nI'LL fight someone.\nGRANDAD\nYou're too old.\nINGEMUND THE OLD \nNo, I ain't.\nCut to an adze striking  timber.  The  Viking's ship, GOLDEN DRAGON, is being repaired and fitted out for  a  JOURNEY. Erik is there, directing operations. The camera tracks through all the activity and finally comes to rest on Keitel Blacksmith. He is a magnificent  mountain  of a man in an Arnold Schwarzeneggarish sort of way. He hammers  a sword, and sparks fly, but his eyes keep returning  to  the  preparations  for the voyage. Clearly something is worrying him. His assistant, Loki, sidles up to him.\nLOKI\nWish you were going too?\nKeitel grunts angrily and plunges the  sword into cold water. Steam and bubbles.\nLOKI\nBut you CAN'T because you're too busy.\nKeitel pulls the sword out of the water and tests it. It slices like as razor, Loki watches.\nLOKI\nOoh, that's a good  one!  You  could charge Halfdan fifteen for that one.\nKEITEL\nYes, it is good. But I told him ten.\nLOKI\nYou could charge him what you like.\nLoki takes the sword from  Keitel  and  stacks  it alongside a lot more freshly made swords.\nLOKI\nYou just can't make  enough  swords  and  spears and knives and daggers to satisfy the demand.  You could charge Halfdan twenty and he'd pay it.\nKEITEL\n(shocked)\nOh, I couldn't do that! The Blacksmith's Code says...\nLOKI\nYes yes... of course.... the \"Blacksmith's Code\"...\nKeitel goes back to his forge and pulls out a fresh dollop of white-hot ore. Loki comes up behind him.\nLOKI\nIf this IS the Age  of  Ragnarok, Keitel Blacksmith, it is GOOD to us.\nKEITEL\n(banging with his hammer)\nCan't make enough swords!\nBang! Bang! Bang!\nKEITEL\nCan't make enough axe-heads!\nBang! Bang! Bang!\nLOKI\nBut, Keitel, if Erik  ever  finds  the Horn Resounding... if he ever crosses Bi-Frost, the Rainbow  Bridge... if he ever wakens the gods..\nKeitel stops smiting the metal on his forge. He stares into space.\nKEITEL\nThey chase Fenrir the Wolf from the sky...\nLOKI\nThe Age of Ragnarok ends...\nKEITEL\nThe bottom falls out of the sword business!\nLOKI\nIt's not just YOUR livelihood  that's  at stake but your son's, and the livelihood of ALL blacksmiths.\nKEITEL\n(this touches a nerve in his muscular mind)\nMy brother blacksmiths!\nLOKI\nThat's right.\nKEITEL\nThe Blacksmith's Code says I must...\nLOKI\nHonour and protect all blacksmiths.\nKEITEL\n(as if reciting his oath)\nTogether we stand!\nLOKI\nYou can't let Erik do THAT.\nLoki smiles. He has  Keitel  playing  into  his  hands, although Keitel doesn't realize it. Fade. Cut to some  days  later.  The  expedition  is  set  to leave. Thorfinn Skull-Splitter taking leave of his mum and dad.\nTHORFINN'S MUM\nAnd you've got BOTH axes?\nTHORFINN\nYes, Mother.\nTHORFINN'S MUM\nAnd something to sharpen them with?\nTHORFINN\nYes, Mum.\nTHORFINN'S MUM\nAnd don't forget: never let your enemy get behind you.\nTHORFINN\nNo, Mother.\nTHORFINN'S MUM\nAnd keep your sword greased.\nTHORFINN\nYes, Mother. Goodbye, Dad.\nTHORFINN'S DAD\nAnd don't forget to was - you know - ALL over.\nTHORFINN\nNo, Dad.\nTHORFINN'S MUM\nAnd if you  have  to  kill  somebody,  KILL them! Don't stop to think about it.\nTHORFINN\n(mildly)\nI never do...\nCut to Sven the Berserk  who  is  also  being  lectured. The lecture is coming from his father - Ulf the Maddeningly Calm.\nSVEN'S FATHER\n(sotto voce)\nIt's a tradition.\nSVEN\nI know, Dad.\nSVEN'S FATHER\nI was a Berserk for King Harald Fairhair...\nSVEN\nYou went berserk...\nSVEN'S FATHER\nI went berserk in every battle I ever fought for King Harald...\nSVEN\nSo did your father...\nSVEN'S FATHER\nSo did my father and his father before him.\nSVEN\nBut it's a responsibility...\nSVEN'S FATHER\nBut it's a responsibility being a Berserk.\nSVEN\nI must only let the red rage...\nSVEN'S FATHER\nYou must only let the red rage take hold of you in the thick of battle.\nSVEN\n(losing his temper)\nI KNOW! I'VE HEARD IT ALL I THOUSAND TIMES!\nA sudden silence falls, as all the  village turns to stare nervously at Sven. He goes berserk and demolishes  a  nearby  hut with his head. Ulf the Maddeningly Calm shakes his head.\nSVEN'S FATHER\nNo no... you'll never  make  a  Berserk.  If you let it out now you'll have nothing left for battle...\nIVAR'S MUM\nBesides... it's dangerous.\nSVEN'S FATHER\n(gloomily)\nIt's the end of a family tradition.\nIn another corner of the village  Leif  the  Lucky is standing with his pregnant girlfriend.\nGIRL\nBye, Leif.\nLEIF\nBye... sorry...\nGIRL\nYeah... well...\nLEIF\nYou will wait?\nGIRL\nWhat d'you expect me to do?\nShe takes a bracelet off her arm and gives it to Leif.\nGIRL\nWear this for luck.\nLeif looks at it.\nLEIF\nThat's why they call me... Leif the Lucky.\nGIRL\nPlease.\nCut to Harald Missionary  dumping  a  bag  on  board the ship. GRIMHILD HOUSEWIFE\nis helping him. Snorri looks at him in surprise.\nSNORRI\nYOU coming? You don't even believe in Asgaard.\nHARALD\nI thought I might do a bit of business on the way.\nSNORRI\nYou're wasting your time.\nHARALD\nListen. I've been in this dump  for sixteen years and I haven't made a single convert...\nSNORRI\nThere was Thorbjorn Vifilsson's wife. You converted HER.\nHARALD\nThorbjorn Vifilsson's wife became a Buddhist, not a Christian.\nSNORRI\nSame thing, isn't it?\nHARALD\nNo, it is NOT.\nMeanwhile in another part of  the  village,  Loki  is strapping a large consignment of swords onto a  pony.  He  glances  round and then sneaks surreptiously out of the  village,  over  the  barren  hills of Norway, under the boiling black skies of Ragnarok. Back at the quayside,  GOLDEN  DRAGON  is  ready  for the journey. Erik addresses the villagers.\nERIK\nWell... we'll be off now...\nErik's grandad waits for some time  before  he realizes that Erik isn't intending to say anything else.\nGRANDAD\nYou need to say a bit more than that!\nERIK\nOh... er... yes...\nThe faces of the village-folk  turn  towards  him. There are many moist eyes. Erik's mother starts to cry.\nERIK\nOh, there, Mum...\n(he  turns  and  addresses everyone)\nDon't be sad.... You all know why  we're  going,  so don't grieve. Maybe untold dangers do lie ahead of us,  and some of you may well be looking at the one you love for the last time...\nSomeone bursts out  sobbing.  Erik  desperately  tries  to  rally their spirits.\nERIK\nBut don't grieve! Even tough the  Hordes of Muspel tear us limb from limb... or the Fire Giants  burn  each and every one of us to a cinder...\nMore crying.\nERIK\n...though we may be swallowed by the Dragon of the North Sea or fall off the Edge of the World... don't cry.\nMore crying.\nERIK\nNo! Don't cry....\nBy this time most of the village is blubbering profusely. Cut to Harald Missionary. He has his arm round his weeping girlfriend.\nHARALD MISSIONARY \nSh... There... it's  all  fantasy,  there's  no Dragon of the North Sea, no Edge of the World...\nGRIMHILD HOUSEWIFE\nThat's what YOU say.\nERIK\n(aside to his Grandad)\nWhat's the matter with them?\nGRANDAD\nJust say something cheerful.\nERIK\nOh... right! \n(He  can't  think  of  anything)\nWell.... CHEERS everybody!\nErik smiles broadly and waves.  The  entire  village stares back at him with tears in their eyes,  and  biting  their lips. Suddenly one mother can't hold it back any more.\nTHORFINN'S MUM\nDon't go!\nAnother mother rushes out and grabs Ivar the Boneless.\nIVAR'S MUM\nMy son! I don't want you to go!\nIVAR\nI don't want to go, either...\nERIK\nOh gods! Please, everybody! Keep  calm! It's not certain ALL of us are going to die... and in  any  case we may not die HIDEOUS deaths...\nMore renewed sobbing. Grandad's eyes go heavenwards.\nGRANDAD\n(to Erik)\nI think we should go...\nERIK\nRight.\n(he turns for  a  last  salute)\nFarewell... for the last time... may the gods prevent...\nGRANDAD\nNo, don't say anything else!\nSuddenly Keitel  Blacksmith  steps  forward.  His  muscles  ripple. His handsome face radiates heroism and manliness.\nKEITEL\nWait, Erik!\nERIK\nKeitel Blacksmith?\nThey stop and turn.\nKEITEL\nYou can't go without me.  Who  will repair your swords and mend your shields?\nRenewed sobs from the women.\nWOMEN\nOh, no! Ah, lackaday! Not HIM too!\nERIK\nWhat's the matter now?\nUNN\nIf Keitel Blacksmith goes with you...\nTHORHILD\nWe'll have no one to do the things he did for us.\nTHORKATLA THE INDISCRETE \nOR sharpen our knives and make our pans.\nAn awkward silence. The others all  turn  on  her  and frown - a bit of shin-kicking goes on. It's  clear  that  Keitel  is popular amongst the womenfolk. Erik doesn't notice.\nERIK\nYou will have Keitel's assistant, Loki, to do all that.\nWOMEN\nLoki? Eurrgh!\nERIK\nWhat's wrong with Loki? He's become very good at blacksmithing.\nWOMEN\nYes... but...\nTHORKATLA\nHe's so small and...\nThe others all shush her up. More shin-kicking.\nTHORHILD\n(innocently)\nOh, yes... we've got Loki... That's true...\nCut to Loki leading his  pony  across  a bleak landscape. He eventually stops and looks ahead. There stands  a gibbet with two corpses dangling from it. He is nearing his destination. Cut back to Erik and his men getting into GOLDEN DRAGON. Erik notices Thorfinn and Sven quarrelling over Leif the Lucky.\nERIK\nHey, you two! What's going on?\nSVEN\nI was sitting there.\nLEIF\nNo, you weren't.\nTHORFINN\nLeif's sitting here. I need a bit of luck.\nLEIF\nSee.\nSVEN\nLook, I bagged it last week.\nERIK\nIt doesn't matter WHERE you sit!\nSVEN\nYes it does! We could be at sea for months.\nERIK\nWell, what difference does it make where you're SITTING?\nSVEN\nI don't want to have to sit next to Snorri all that time.\nSven nods towards Snorri the Miserable -  an Eeyore of a Viking if ever there were one.\nSNORRI\nThank you VERY much indeed.\nERIK\nNow stop it!\nSNORRI\nIt's SO nice to feel wanted.\nERIK\nLeif, you sit there. Even,  you sit there. Harald, you'd better sit over there...\nSNORRI\nTrust me to get the missionary.\nSuddenly Erik notices Sven's father climbing aboard.\nERIK\nWhat are YOU doing here?\nSVEN'S DAD\nYou may need a real Berserk.\nSVEN\nI AM one, Dad!\nERIK\nWe haven't got a spare place.\nIVAR\nHe can have my place. I don't want to go anyway.\nERIK\nWell, you ARE!\nKEITEL\nBjorn's not. He could have Bjorn's place.\nERIK\nWhat's the matter with Bjorn?\nTHORFINN\nNothing... Halfdan the Black chopped his hand off last night.\nERIK\nHE was lucky...\n(to Sven's dad)\nSit there.\nSNORRI\nYou can't have  Sven's  father  sitting  next  to Sven. They'll argue the whole time.\nERIK\nThat's true.\n(to Sven)\nYOU'D  better sit there.\n(to Sven's dad)\nYou there, and Ornulf there.\nSNORRI\nNow you've got all the big ones on one side.\nErik looks around. It is true that  all  the tall burly ones are on one side.\nERIK\nAll right, you go there. You here...\nSven's dad and Ornulf swap places.\nSVEN'S DAD\nOhh! I wanted to sit next to Leif.\nERIK\nShut up. You there. You there and you there.\nIvar and Ornulf swap places. Erik surveys this re-arrangement.\nERIK\nThat's better.\nSNORRI\nNow you've got all the ones with beards on one side and all the moustaches on the other.\nThis is true. Erik thinks some moments and then:\nERIK\nIt doesn't matter.\nThey start to haul the  sail  up.  Ropes  are released. The boat rocks. Suddenly a voice cuts through the crowd. It is Erik's mother.\nERIK'S MUM\nWait! Wait! Wait!\nERIK\nWhat is it?\n(he is clearly a little embarrassed)\nERIK'S MUM\nHere, son.\nShe tries to hand Erik what  looks  unmistakably like a pillow. Erik is dumbfounded.\nERIK'S MUM\nYour father always made sure he could rest his head at night.\nErik is mortified. The others snigger, though not without some sympathy for Erik. They've ALL been  embarrassed  by  their  mums at one time or another.\nERIK\nI can't take THAT on a voyage!\nERIK'S MUM\nIt was your father's!\nErik will find it hard to refuse now. But he hesitates.\nERIK'S MUM\nIt was the pillow HE took  with  him. He said it once saved his life.\nErik reluctantly takes the precious object. His mother kisses him. Everyone has fallen silent  now.  The  relatives  stand helpless on the shore as GOLDEN DRAGON starts to drift  away from them. The Vikings sit in their places, hands on the oars looking back at their loved ones. Erik stands at the prow of  GOLDEN  DRAGON.  For  a moment he thinks he sees the girl he  killed,  standing,  white  in  death, the spear-wound still fresh. Erik raises his hand in a half-goodbye. We cut back to the loved ones,  now  the  girl is no longer there. They too half-raise their hands. Erik suddenly turns and gives a shout:\nERIK\nHuuup!\nThe oars go up and then into the water, and GOLDEN DRAGON commences her voyage. Cut back to GOLDEN DRAGON at sea. Snorri is feeling queasy and gazing  gloomily at the receding coastline of Norway. Thangbrand is sitting near him and feeling equally queasy.\nSNORRI\nHave a good look... that's the last we'll see of old Norway.\nSnorri is desperately trying to control his insides.\nSNORRI\nGoodbye home...  goodbye  family...  goodbye  loved ones...\n(he starts to throw up)\nGoodbye lunch...\nTHANGBRAND\nOh! Shut up.\nHarald Missionary puts his arm around Snorri.\nHARALD\nYou know, my son, our lord said...\nSNORRI\nYOUR lord.\nHARALD\nQuite... MY lord... said: \"The  Prayer  of Faith shall have the sick.\"\nSNORRI\nI hope the Dragon of the North Sea gets YOU AND your lord.\nHarald Missionary gives him a condescending  smile and a weary shake of the head. He knows the Dragon of the North Sea does not exist.\nHARALD\nDarkness and ignorance...\nMeanwhile Ivar the Boneless  and  Sven  the  Berserk are both suffering from the effects of the sea.\nSVEN\n(keeping a wave of nausea down)\nIt's not so bad when you're rowing.\nTHORFINN SKULL-SPLITTER \nThat's right\nThorfinn gobs onto the whetstone with  which  he is sharpening his axe. Sven can control himself no longer. He rushes for the side.\nSVEN THE BERSERK \nI want to die.\nThis sets off Ivar.\nIVAR THE BONELESS \nUh oh!\nHe leaps up and pukes over  the  side.  Mass puking breaks out all over the boat. Keitel Blacksmith looks around  at  his  preoccupied  shipmates, and it slowly dawns upon him that this  might  be  the  moment to try a little sabotage. He goes to the ship's lodestone, which is hanging from the mast. Keitel glances around. No one is  looking,  but  this sort of covert behaviour goes against his normally sunny and open disposition.\nKEITEL\n(to himself)\nThe Blacksmith's Code...\nHe steels himself, takes down  the  lodestone,  snaps  out the piece of metal in the base and throws it over the side. Keitel hangs it up again on the mast.\nTHORFINN\nAre you all right?\nIVAR\nNo, I'm not.\nTHORFINN\nYou don't need to feel bad about being sea-sick, you know.\nIVAR\nHow can you help feeling bad when you're sea-sick?\nTHORFINN\nI mean many of the greatest sailors were.\nPause.\nIVAR\nI know. I know.\nTHORFINN\nOlaf Tryggvason used to throw  up on every single voyage... the whole time... non-stop... puke... puke... puke.\nIVAR\nLook! I don't feel BAD about it. I just feel ILL.\nThorfinn pauses and waits for a wave of nausea to creep up on Ivar.\nTHORFINN\nHe used to puke in his sleep.\nIVAR\nBastard.\nHe throws up. Meanwhile Erik is in the stern, gazing out behind them.\nERIK\nThorfinn... look over there.\nThorfinn leaves Ivar and joins Erik. On the horizon a sinister sail  is  following them. Thorfinn grins with evil pleasure. He scents a fight. Erik turns to the crew.\nERIK\nBreak out the oars!\nThorfinn's smile disappears and he spins round to confront Erik.\nTHORFINN\nWhat are you talking about?\nERIK\n(to his reluctant crew)\nCome on, move it!\nMost of the men are being sea-sick.\nMORD FIDDLE\nWe've only just started cooking lunch.\nThe crew glance at Mord Fiddle and then throw up again.\nERIK\nMove it!\nReluctantly  the  crew  take   up   their  rowing  positions.  Thorfinn buttonholes  Erik  (except  of   course   that   he  doesn't  have  any buttonholes).\nTHORFINN\nIt's Halfdan the Black!\nERIK\nI know. Snorri! Get your oar out!\nSnorri is sitting in position but without his oar. Keitel has meanwhile joined them. He, too, stares at the  horizon. He is a little puzzled by this turn of events. Loki has  said  nothing about Halfdan coming after them.\nKEITEL\n(uneasily)\nDo you suppose he wants to stop us waking the Gods?\nErik looks at Keitel with a  certain  amount of contempt. Keitel is not renowned even amongst these Vikings for his brain-power.\nERIK\nWhat do you think?\nKEITEL\nBut how could he know... unless...\nKeitel stops in mid-sentence as he realizes it must be Loki's doing.\nTHORFINN\n(scornfully)\nSo are you going to run away from him, Erik?\nErik turns to Thorfinn.\nERIK\nRow, Thorfinn Skull-Splitter.\nThorfinn hesitates.\nERIK\nAnd you, Keitel Blacksmith.\nKEITEL\nBut...\nKeitel shrugs and turns to take up  his  rowing position. He is still a little confused by this turn of events. Erik confronts Thorfinn.\nERIK\nI gave an order. Or didn't you hear?\nThere is something about Erik's  manner  that carries an authority that Thorfinn cannot argue with.\nERIK\nCome on, Ivar.\nErik manhandles Ivar over to his  drum  and thrusts his drumsticks into his hands. Halfdan's ship is twice the size  of  Erik's  and,  as Erik is only too well aware, consequently travels at twice  the  speed. There is no real chance of them escaping,  unless...  Erik  suddenly  catches sight of a thick bank of mist in the distance, and steers his ship towards it.\nIVAR\n(still feeling ill)\nI  want  to  die... \n(then, suddenly catching sight of Halfdan's ship behind him)\nNo, I don't!\nERIK\nRow! Row! Row!\nIvar tries to get into the new  rhythm,  but has a bit of difficult. As Halfdan's ship gains on them inexorably,  GOLDEN DRAGON glides into the sea mist. There is a  tremendous  roll  of  thunder very close. All the Vikings look scared. Erik, however, grins.\nERIK\nRow! Row! Row!\nHe doubles the speed. The drum beats faster.\nSVEN'S DAD\n(shouts out angrily)\nWe can't keep this up!\nErik grins and then leans  on  the  steering  oar. GOLDEN DRAGON curves around to its left. Then Erik lays his hand on Ivar's drum and silences it.\nERIK\nOars up!\nThe Vikings ship their oars  and  sit  there  in  the mist listening to beating of Halfdan's drum getting closer and closer. At the final moment, however, Halfdan  swings  his ship in the opposite direction from Erik's and the  sound  of  his  drum disappears into the mist. Erik's men breathe a sigh of relief... even Keitel Blacksmith... Fade. Fade up some time later. GOLDEN DRAGON is still drifting in the mist. Erik has his  fish-lodestone  and  is  trying  the  direction,  but the lodestone is just swinging round  uselessly.  After trying a few times, Erik gives up and throws the lodestone away into the boat. The men peer into the thick mist; they are lost. Suddenly Erik sees something ahead.\nERIK\nThe Gates of the World...\nMORD FIDDLE\nWhat?\nGOLDEN DRAGON silently guides between two weird islands.\nERIK\nWe have passed through the Gates  of the World\n(he looks around at the other)\nNo we are in the Unknown...\nGOLDEN DRAGON drifts on and the mist  gets thicker. There is a crash of thunder. Then a series of flashes  lights  up the mist around them. The Vikings are uneasy, sensing a storm brewing. Suddenly Erik points above them. The others look up too. They all gasp.\nERIK\n(hardly daring to breathe)\nSo THAT is what the sun looks like!\nAbove them hangs  a  luminous  yellow  globe,  its  light just breaking through the mist.\nVIKING\n(to each other)\nThe sun! It's the sun! Look!\nSVEN'S DAD\n(in wonderment)\nI never though I should live to see the sun again.\nHARALD MISSIONARY \nWhere?\nThe Vikings all gaze up above them in awe. Harald looks from one to the other and then tries to follow their eyelines. He clearly can't see it. Magic music fills the air. Suddenly  the  \"sun\"  swoops off to one side and starts swaying from one side to another.\nERIK\nShould the sun do that?\nHARALD MISSIONARY \nWhat are you looking at?\nERIK\nLook out!\nVIKINGS\nAh!\nThe Vikings scream and  flatten  themselves  against  the  sides of the boat, as the \"sun\"  suddenly  lurches  down  on  them  out  of the sky, revealing for the first time  that  it  is  NOT  the  sun  at all but a strange monster with a long neck that  disappears off into the mist and a glowing globe for a head,  and  huge  chomping jaws. The Vikings are, understandably, terrified.\nVIKINGS\nIt's not the sun! It's not the sun!\nHARALD MISSIONARY \nWhat is it?\nSNORRI\nIt's the Dragon of the North Sea!\nHARALD MISSIONARY\n(knowingly)\nAh! THAT'S why I can't see it.\nAs the Dragon  of  the  North  Sea  rises  up  again,  however, its jaw apparently drops off and falls to the deck, and lands on Snorri.\nSNORRI\nAaah!\nKeitel nervously picks it up and holds it  up for everyone to see. I is a strand of sea-weed. The  Vikings  are  non-plussed. They look back at their now jawless monster. Harald Missionary picks up the sea-weed.\nHARALD\nSome dragon! Ooh!\nHe tosses it back amongst  his  terrifies companions. Suddenly there is an incredibly loud clap of thunder and flames shoot out of the mist.\nSVEN\nLook out!\nAs... unbelievably... a huge monstrous visage  looms out of the mist... It is a creature from  the  nethermost  depths  of the ocean... and the incandescent globe is no more than a  sprouting on the end of its nose! More fire shoots out from its  nostrils  and sends all the Vikings (and even Harald Missionary) diving for  the  deck.  Then the monstrous head disappears back into the mist as  quickly  as it came, taking its light with it... The Vikings are paralysed with fear for one brief moment.\nERIK\nRow! ROW!\nThey all scramble for  the  oars  in  a  determined  hysteria. Ivar the drummer, in his panic, has set a  ridiculously fast rate and nobody can keep up with it.\nERIK\nSlower! Nobody can row at that speed!\nIVAR\n(hoarsely)\nSorry.\nHARALD\nWhat's all the panic about?\nSVEN'S DAD\n(in a panic, shouting back over his shoulder)\nThe Dragon...\nHarald gives a patronising smile.\nHARALD\nChildren afraid of the dark...\nSuddenly there is another roar, and  flames  shoot  out of the mist and across the deck  of  GOLDEN  DRAGON.  One  man,  Ornolf Fishdriver, who hasn't had much  to  say  so  far,  is  set  on  fire.  Another, Bjarni Jerusalem-Farer, who has and will  have  even  less  to say then Ornolf Fishdriver, leaps out of the way of the flames and falls over the side.\nTHORFINN\nMan over board!\nThorfinn starts trying to fish him  out.  Ivar has started to panic and is beating the drum too fast.\nERIK\nSlower! In... Out...\nIVAR\nSorry!\nSVEN\n(his eyes showing their whites)\nWe're being attacked! KILL! Kill! Kill!\nSVEN'S DAD\nNot now, Sven...\nSVEN\nI must KILL! Kill!\nSVEN'S DAD\nIt's no good going berserk against a dragon!\nSven's dad slaps him around the  face.  There  is another roar from the monster. Erik turns to Ivar.\nERIK\nFaster!\nIVAR\nMake your mind up.\nSuddenly the Dragon's head appears  out  of  the  mists above them once again. There is panic amongst the  Vikings  as some start to row faster than others. Screams.\nERIK\nKeep up the strike!\nThe Dragon's jaws open. Flame  licks  out,  and  down the centre of the vessel. There are screams as the Vikings leap out of the way. Sven goes berserk again.\nSVEN\nKILL! KILL!\nSVEN'S DAD\nStop it!\nThe Dragon's eyes dilate and its jaws open. The men throw themselves to the deck as if expecting  more  fire.  But instead the creature's fangs crash into the wood of the stern of GOLDEN DRAGON.\nERIK\nROW!\nSVEN\nDEATH!\nSVEN'S DAD\nShut UP!\nERIK\nRow!\nErik looks around at his terror-stricken  crew.  He realizes this is an important moment. It is up to  him  to  save the situation. Suddenly an idea occurs to him, as he catches  sight  of the pillow that his mother gave him.\nERIK\nKeep rowing!\nErik dashes to his sea-chest under the mast and pulls out the pillow.\nTHORFINN\nErik! Row! What are you doing?\nERIK\n(holding up the pillow)\nIt saved my father!\nErik starts to shin up the mast.\nSNORRI\nBarmy.\nSven's dad is desperately holding Sven back.\nSVEN'S DAD\nHOLD it! HOLD it in!\nSVEN\nDEATH TO DRAGONS!\nERIK\nRow!\nSNORRI\nHas anyone told him we've got a dragon eating our boat?\nErik has reached the top  of  the  mast  and  is  now right up with the incandescent globe on the end  of  the  long  stalk that grows onto the monster's nose.  He  grabs  hold  of  it  and  swings  across  onto the monster's nose. At his moment Sven  breaks  free  of his dad and throws himself onto one of the Dragon's teeth.\nSVEN\nRed mist!\nHe bangs his  head  against  the  monstrous  denture.  Sven's dad looks heavenward in despair. Cut to Harald Missionary who  is  offering  his  bible to the petrifies Vikings in the prow.\nHARALD\nIt's at time like this that  you'll find this book MOST useful, you know...\nKeitel takes the bible from him and hits him over the head with it.\nKEITEL\nRow! You idiot!\nThe monster's eyes dilate  wildly  as  they  try  to  focus on the tiny figure of Erik on its  snout.  Erik  shoves  the  pillow  up one of the Dragon's nostrils. Snorri  watches  Erik  incredulously.  He shakes his head.\nSNORRI\nHis father went crazy too...  Used  to  take forty winks in the middle of a battle...\nThorfinn frowns - he has a glimmering of an idea of what Erik is doing. Erik now plunges his sword through  the pillow in the Dragon's nostril, and feathers immediately fly into the air.\nERIK\nNow... take a deep breath.\nThe Dragon goes cross-eyed, trying to see what's going on on its snout.\nERIK\nGo on! Breathe in, you cod-brain!\nMeanwhile the Dragon's tongue suddenly licks out around its tooth. Sven instantly slices through it with  his  sword.  The bright blood spurts, like bursting a sausage. The Dragon gives  an agonized roar and a sharp intake of breath. The feathers that have leaked out from the pillow are instantly sucked inside and the  whole  pillow  disappears right up the Dragon's nose. For a moment  everyone  holds  their  breath.  The  Dragon's eye dilate wildly. Then it wrinkles its snout. Then it starts what is unmistakably a sneeze.\nTHE DRAGON OF THE NORTH SEA \nAh... ah... ah...\nERIK\nHold TIGHT!\nTHE DRAGON OF THE NORTH SEA \nAh... ah... ah...\nErik leaps back across the mast.\nTHE DRAGON OF THE NORTH SEA \nCHOO!!\nA hurricane of wind and  feathers  blasts  out of the Dragon's nostrils and hits all the Vikings at once. Everyone is disgusted by the Dragon's breath.\nSNORRI\nUrgh! What's it been eating?\nBut the blast has already  catapulted  the  boat  into  the sky, and it hurtles through the clouds. leaving  the  Dragon  of  the North Sea far behind. They all look up at Erik and cheer. Shot of Erik. He doesn't look too happy. Neither does Ivar the Boneless,  because  he  too has just noticed that they are now flying and the ocean  is several thousand feet below them. Ivar screams. The other all rush to the side to look too.\nERIK\nNo! No! Get back!\nUnfortunately they all rush to  the  SAME  side  and the boat tips over with far more instability  than  when  it  is  in  the  water. Leif and Thangbrand are catapulted down into the sea. We watch them descend into tiny dots and tiny unheard splashes below.\nTHORFINN\nWho was that?\nSNORRI\nLeif the Lucky.\nOthers are almost falling out. There is renewed panic.\nERIK\nGet back!\nPoor Erik is still  up  the  mast  but  has  been  dislodged and is now hanging on by his hands, dangling over the  open sea. Some of the men - Thorfinn and Sven the Berserk amongst  them - are hauling themselves up the almost vertical slope of the  deck,  trying to redress the balance. Meanwhile Keitel Blacksmith is dangling by one hand.\nKEITEL\nI can't hold on! I can't hold on!\nSven worms his way along the  edge  -  at  great peril to himself - and grabs Keitel's wrist just as his fingers slip.\nKEITEL\nAaagh!\nSVEN\nGot you!\nKeitel looks up in Sven's  eyes.  He  is  totally at Sven's mercy. What thoughts are going through his mind? How  is he going to betray Sven in future if he is rescued? Guilt suddenly overwhelms him.\nKEITEL\nLet me go, Sven.\nSVEN\nWhat are you talking about?\nKEITEL\nI'm not worth risking your life for.\nSVEN\nI've got you, Keitel Blacksmith. If you go... I go too...\nKEITEL\nFor your own sake... For the others... I...\nSVEN\nHang on...\nThe boat begins to right itself just  as Erik finally can't hold on any more, and he plummets, straight into  the  ship, and through the bottom up to his waist. His legs dangle. At the same moment the  prov  of  the  boat  tips and suddenly they are plummeting down towards the ocean. They  hit the water with an almighty splash. Erik is thrown clear of the hull  by the force of the water now cascading up through the hole he has made.\nSNORRI\nFirst we're flying - now we're sinking!\nERIK\nWell, come on!\nHe whisks off his helmet  and  starts  bailing.  All follow suit. Night falls. Some time later. The Vikings are still bailing out, but the water is up to their thighs.\nIVAR THE BONELESS \nWho are we fooling? It's hopeless!\nIvar flings down the helmet  with  which  he's been bailing. The others look at each other. They are reconciled to the fact that they are going to drown.\nHARALD MISSIONARY\n(hopelessly)\nLet's sing something!\nSNORRI\nAnyone know any good drowning songs?\nThe suggestion falls flat.\nERIK\nListen! Maybe we won't  get  to  Hy-Brasil! Maybe we won't find the Horn Resounding... but at least we've tried... and at least we shall have died like men.\nSNORRI\nLike fish.\nSVEN\nShut up.\nTHORFINN\n(raising his sword)\nErik's right! We'll all meet in Valhalla.\nIVAR\nI don'T want to die!\nHARALD MISSIONARY \nIsn't there ANYBODY who'd like  to be christened before we go down?\nSilence. A distinct lack of enthusiasm.\nHARALD\nIt can't do you any HARM...\nSVEN'S DAD\nWhat do we have to do?\nHARALD\nNothing... I just immerse you in water...\nTHORFINN AND OTHERS \nGet lost...\nThe ship creaks and starts to  go  under.  Erik picks his up his sword. The others follow suit.\nERIK\nDon't let me drown, Thorfinn!\nWater starts to pour over  the  sides  of  the  boat. Erik and Thorfinn raise their swords to each other.\nTHORFINN\nTill we meet in Valhalla.\nThey all prepare to run each other through. The boat sinks rapidly.\nIVAR THE BONELESS\nI'm too young! Oh  Odin!  Not  me! Please not me! Perhaps I'd rather drown...\nHARALD MISSIONARY \nI do WISH you'd let me convert you.\nThen Erik pauses in his attempt to  kill Thorfinn and looks around. The ship has sunk, but the prow and  the  stern posts are still sticking up out of the water,  and  the  Vikings  themselves  are  only up to their chests.\nERIK\nHow deep IS the ocean?\nTHORFINN\nVery deep... usually...\nThe realization gradually dawns on  the  Vikings that they're not going to sink any more.\nERIK\nWait! Nobody kill anybody!\nFade. Fade up on the sun  shining  down  from  a  blue  sky. The Vikings have fallen asleep where we last  saw  them  -  up  to their necks in water. Gradually the warmth of the  sun  coaxes  them  awake - Thorfinn is the first to look up and see the brilliant shining orb in the sky.\nTHORFINN\nWhat is it?\nIVAR THE BONELESS\n(he panics and turns)\nIt's the Dragon again!\nERIK\nNo.. no, it isn't...\nIvar has turned and is staring at something else.\nERIK\nLook, the sky is blue...\nSVEN'S DAD\nThe sun! That's it!\nIvar, meanwhile, is recovering from  the amazement that has immobilized him. He taps Erik on the shoulder. Erik turns and he, too, gasps.\nERIK\nLook!\nThey all turn to see  they  are  standing  in  the  shallow waters of a natural harbour. Above nestle the white  walls  of a beautiful city set in a green and pleasant land.\nVIKINGS\nYeaaaah!\nThe Vikings wade ashore,  enchanted  by  the  paradise  they see before them. All at once Thorfinn spies something. He draws his sword and they all approach with caution to find that under a weeping willow tree lies the most beautiful girl. She is raven-haired, scantily dressed and fast asleep. The Vikings approach  her  with  trepidation,  their swords and axes drawn. They glance around uneasily.\nSNORRI\n(whispers)\nShe's got no clothes on!\nTHORFINN\nIt's disgusting.\nERIK\nGet her weapons.\nSven kneels quietly  beside  the  girl.  She  stirs.  Sven freezes. The others look around fearfully.\nSVEN\n(whispers)\nShe hasn't got any.\nERIK\n(incredulous)\nShe MUST have a knife or something...\nBut they look. She hasn't.\nTHORFINN\nWhat kind of place IS this?\nIVAR THE BONELESS\nP... p...perhaps they've  got weapons we haven't even dreamed of...\nSuddenly the girl stirs again in her sleep. The Vikings retreat several paces and grip their  weapons,  and  glance  around  as if expecting an ambush.\nTHORFINN\nLet's hack her to pieces.\nERIK\nNo.\nKEITEL\nWell, what else do we do?\nERIK\nHow about making friends?\nSVEN\n(with disgust)\n\"FRIENDS\"?\nVIKINGS\nEurrgh!\nERIK\nWhat's wrong with making friends?\nTHORFINN\nYou don't go through all  the  hardships  of an ocean voyage to make \"friends\".\nSVEN\nWe can make \"friends\" at home...\nThis conversation has woken the girl, Aud.\nAUD\nWelcome!\nThe Vikings react with terror, take a  step back and raise their swords and axes.\nERIK\nWHAT did you say?\nAUD\nI said welcome.\nERIK\n(suspiciously)\nWELCOME?\nAUD\nWell, of course. We always welcome friends.\nThe Vikings look at each other  and  at  their swords. They don't think they look that much like friends themselves.\nERIK\nHow d'you KNOW we're \"friends\"?\nAUD\nWell, EVERYONE is friends here on Hy-Brasil.\nSVEN\nHy-Brasil?\nERIK\nIs THIS Hy-Brasil?\nAUD\nWell, of course.\nThe Vikings erupt into an  impromptu  dance  of joy, hugging each other and waving their swords in the air.\nAUD\nPlease! Please! What are those?\nERIK\nWhat are what?\nAUD\nThose things in your hands.\nERIK\nThese? What are THESE? They're swords.\nAud instantly recoils with terror.\nAUD\nOh no! NO! Out them down! PUT THEM DOWN!\nThe Vikings gradually cease their mock battles  and turn to look at Aud with incredulity.\nERIK\nWhat's the matter?\nAUD\nPLEASE! You don't know what you're doing!\nERIK\nWhat?\nAUD\nPut them down!\n(To Erik)\nPLEASE make them put them down.\nTHORFINN\nWhy?\nOTHERS\nYes, why?\nAUD\nWHY?\nERIK\nYes.\nAUD\nBut surely you know...?\nVIKINGS\nEr... n... no...\nERIK\nKnow what?\nCut to big close-up of King Arnulf.\nKING ARNULF\nThe wonderful blessing under which we live here on Hy-Brasil!\nThe king beams. The Vikings shift uneasily.  They look out of place and extremely scruffy in the  midst  of  the  scantily dressed courtiers of Hy-Brasil. Aud sits beside her father the King.\nERIK\nNo... we don't...\nKING ARNULF\nThe Gods decreed  that  if  ever  sword spills human blood upon these shores, the  whole  of  Hy-Brasil  will  sink beneath the waves.\nKing Arnulf beams rapturously  at  the  Vikings,  expecting  them to be overjoyed. Instead they are horrified.\nTHORFINN\nThat's terrible!\nERIK\nYou mean if just ONE PERSON gets killed?\nKING ARNULF\nYes!\n(He thinks: isn't it wonderful?)\nThe Vikings look at each other, feeling they haven't quite understood.\nTHORFINN\nYou mean... you can't kill ANYBODY?\nKING ARNULF\nRight! Isn't it wonderful?\nThe Vikings are non-plussed.\nTHORFINN\nWhat? Not being able to kill anybody?\nKING ARNULF\n(bemused)\nWell, of course.\nERIK\n(interested)\nHow?\nKING ARNULF\n(explaining the obvious)\nWell...  for  a start... er... there's no killing...\nERIK\nWell, OBVIOUSLY there's no killing.\nKING ARNULF\nWell... \n(isn't it great?)\nTHORFINN\nBut how d'you take revenge?\nKEITEL\n(guiltily)\nHow do you punish people?\nIVAR\nHow do you DEFEND yourselves?\nKING ARNULF\n(getting a little irritated)\nWe  don't have to. We're all terribly\nnice to each other. Aren't we?\nCOURT\nYes!\nAud catches Erik's eye and gives  him  a dangerously slow wink. A pause of disbelief from the Vikings.\nSVEN\nALL the time?\nKING ARNULF\nWell, of course! We HAVE to be.\nHe turns and conducts the courtiers, who chant in unison:\nCOURT\n\"Being nice to each other is what it's all about.\"\nKING ARNULF\n(rising as if to sing)\nYou see?\nWe're terribly nice to each other\nWe're friendly bold and free.\nWe never say anything nasty\n'Cause we dare not...\nCOURT\n(almost SINGING)\nNo sirreeeee!\nThey hold the note while King Arnulf looks anxiously at the Vikings.\nKING ARNULF\nWould you like us o sing to you?\nERIK\nThat's very  kind  of  you,  but  we're  in  rather  a hurry...\nWe're...\nKing Arnulf claps and the court stop singing.\nKING ARNULF\nWhat's the matter, don't you WANT to hear our singing?\nERIK\nOh... well, yes, of  course;  it's  just  we're looking for the\nHorn Resounding and -\nKING ARNULF\nYou don't think our singing's going to be good enough for you?\nERIK\nOh, no no no! It's just the Horn Resounding is...\nKING ARNULF\nA lot of people like our singing.\nERIK\nI'm sure it's lovely.\nKING ARNULF\nBut you don't want to hear it.\nERIK\n(changing tack)\nNo... no...\n(he looks at the others)\nWe'd love to hear it.\nWouldn't we?\nVIKINGS\nOh... yes.\nKING ARNULF\nWell, you'll have to ask us REALLY nicely.\nERIK\n(realizing he has to  be  diplomatic)\nEr...  well... we... we... would be\nTERRIBLY grateful if you... all... would sing for us.\nKING ARNULF\nYou're just saying that.\nSVEN\nWell, of course he is!\nSVEN'S DAD\nSh!\nThey restrain Sven.\nERIK\nOf course we're not; we'd genuinely like to hear you sing.\nKING ARNULF\nREALLY?\nERIK\nReally.\nKING ARNULF\nAnd you're not just saying it because you think we want you to?\nErik swallows hard.\nERIK\nNo.\n(He bites the lie)\nKING ARNULF\nRight! Summon the musicians!  We'll  do the one that goes \"TUM-\nTUM-TUM-TUM-TI-TUM-TUM\"\nCOURT\n(disappointed)\nOh...\nCHAMBERLAIN\nREALLY?\nKING ARNULF\n(apologetically to Vikings)\nIt isn't the one we're BEST at.\nCHAMBERLAIN\nCouldn't we do the one that goes \"TI-TUM-TI-TUM-TI-TUM\"?\nThe rest of the court look hopeful.\nKING ARNULF\n(whispering)\nNot when we've got guests.\nVOICE FROM COURT\nHow about the one that goes \"TI-TUM-TI-TUM-TI-TUM-TI-TI-TUM\"?\nKING ARNULF\nDon't be silly.\nCHAMBERLAIN\nThat was a stupid suggestion.\nVOICE\nSorry! I just thought they might like to hear something that we \ncan do.\nANOTHER\nYes! At least we know that one.\nYET ANOTHER VOICE \nNobody knows the \"TUM-TUM-TUM-TUM-TI-TUM-TUM\" one.\nREST OF COURT\nNo! Right! I agree!\nODD MAN OUT\nI do!\nREST OF COURT\nSh!\nANOTHER VOICE\nIt's too difficult!\nCHAMBERLAIN\nSh!\nKING ARNULF\nAll right. We'll  do  the  one that goes \"TI-TUM-TI-TUM-TI-TUM-\nTI-TI-TUM\". Ah! The musicians!\nThe musicians are huge, unshaven,  have  broken  noses and tattoos, and are covered in black oil -  like  mechanics. Their instruments are like heavy industrial machinery, pushed in large vats of black oil that drip all over the show.\nKING ARNULF\nRight... Oh dear...\n(he glances across at the Vikings)\nI'm sure\nyou're not going to like this...\nErik and the others smile reassuringly. There is a lot of coughing. The  King  raises his baton and then brings it down, humming to himself as he  does  so. There is a most awful din; caterwauling, crashing and banging, whining, screaming... The Vikings look at each other, trying  to pick out some tune, but it's impossible. Ivar the  Boneless  can't  stop  himself  bursting out into giggles and this eventually spreads  to  the other Vikings. King Arnulf notices and bangs the throne for silence. Gradually the din stops. King Arnulf sinks down in despair.\nKING ARNULF\n(tragically)\nWe're just not a very musical nation...\nERIK\nNo, no... It was very... er, nice.\nKING ARNULF\nNow I want you to be ABSOLUTELY, totally, genuinely honest with\nme. Did you really, truly, honestly like it?\nErik thinks for some moments and then decides to make a clean breast of it.\nERIK\nNo.\nKING ARNULF\n(goes hysterically)\nThey didn't like it! Oh God! I want to die!\nThe whole court looks as if it's  about to commit mass HARA-KIRI, while the musicians look rather dangerous. Erik  takes the moment to get down to business.\nERIK\nYour Majesty! We come  from  a  world  where there IS no music.\nwhere men live and die by the axe and by the sword...\nKING ARNULF\nWell, how d'you think I feel?\nERIK\nThe Gods are asleep, King Arnulf.\nKING ARNULF\nYOU try to  be  nice  to  people,  when they're rude about your\nsinging...\nErik feels he is making a mess of all this diplomacy.\nERIK\nWe must find the Horn Resounding!\nThe King glares at Erik.\nERIK\nIs is HERE in Hy-Brasil?\nKing Arnulf thinks for a moment and then speaks.\nKING ARNULF\nI'll tell you what...\nERIK\nYes?\nKing Arnulf hesitates - he bites his lip and then takes the plunge.\nKING ARNULF\nWe'll  do  the  one  that  goes  \"TUM-TUM-TUM-TUM-TI-TUM-TUM\".\nPerhaps you'll like that better.\nErik gives up. A  lot  of  throat  clearing.  Aud, the King's daughter, gives Erik another dangerously slow  wink.  The terrible \"music\" starts up, shattering the calm of the beautiful city. Fade. Fade up on GOLDEN DRAGON now afloat  once more, riding at anchor in the bay. Ivar is standing on guard  in  it. Suddenly he sees something that makes him gabe in  horror.  We  don't  find  out  what  it is, however, because we immediately Cut to Erik. He is deeply  in  love.  He  is  also  in  bed  with  the King's nubile daughter, Aud.\nAUD\nHave you ever felt like this about anyone else?\nERIK\nWhat... you mean \"got into bed with\" them?\nAUD\nNo, of course not, silly - I mean FELT like this about the?\nERIK\nYou mean... you HAVE got into bed with somebody else?\nAUD\nNo, I mean have you ever  felt  that for the first time in your\nlife you'd met somebody you  could  believe  in with your whole\nheart... someone whose goals suddenly  seem to be YOUR goals...\nwhose dreams seem to be YOUR dreams?\nERIK\nHAVE you ever been to bed with anyone else?\nAUD\nWhat does that matter?  But  you've... you've... FELT like this\nbefore...\nERIK\nIt was different...\nAUD\n(just for a moment it is Helga speaking)\nWhat was she like?\nERIK\nOh... oh, I didn't know her very well...\nAUD\nBut you LOVED her all the same...\nERIK\nWe never went to bed together.\nAUD\nWhy do you go on about that? What does it matter?\nERIK\nYou've been to bed with somebody else, haven't you?\nAUD\nI've never LOVED anybody!\nERIK\nI'VE never been to bed with anybody!\nSuddenly there is a banging on he door.\nKING ARNULF\n(v/o)\nOpen up! I know you're in there!\nAUD\nAh! It's my father!\nKING ARNULF (v/o)\nOpen up! I know you're in there!\nSuddenly the note from Ivar's horn rings  out across from the bay. Erik rushes to the window and looks out  to  see what Ivar saw previously: a black ship approaching on the horizon.\nERIK\nOh, no! Halfdan!\nThere is more banging on the bedroom door.\nKING ARNULF (v/o)\nAud! You've got someone in there again, haven't you?\nErik gives her a sharp look.\nAUD\nQuick! Throw this over you!\nShe throws a shabby bit of cloth over  Erik and at that moment the door bursts open, and King Arnulf enters.\nKING ARNULF\nRight! Where is he?\nAUD\nWho, Father?\nKING ARNULF\nWho? Who? Whoever you've got in here of course!\nAUD\nThere IS no one.\nThe King starts prowling round  the  chamber.  Erik stands there, naked and petrified, with the  cloak  hanging  over  his  head, just where it landed.\nKING ARNULF\nI can SMELL one of  those  strangers... That's who it is, isn't\nit?\nAud keeps mum.\nKING ARNULF\nThis is the fifth one this week.\nBefore he can stop himself, Erik blurts out:\nERIK\nFifth...\nAud motions him to be quiet, but it's too late. The King spins round to see who she is signalling to.  The  King appears to be looking straight at Erik. Erik can hardly bear the suspense.\nKING ARNULF\nWell... where is he?\nAUD\nThere's nobody here, Father. Look for yourself.\nKing Arnulf looks  around  the  chamber  carefully.  He  looks straight through Erik as if he weren't there.  Suddenly the King strides over to Erik and Erik instinctively  cowers  out  of  the  way.  The King walks straight over to a very small cupboard no more than a foot high, flings the door of it open, and starts throwing clothes around the room.\nAUD\nHe  wouldn't be a midget, Father!\nThe King turns on her.\nKING ARNULF\nAh! So you admit there IS someone!\nAUD\nYou're losing your temper!\nKING\n(becoming instantly pleasant)\nOf course I'm not. I never lose my temper...\nIvar's horn sounds again. A shadow passes over King Arnulf's face.\nKING ARNULF\nOh dear... more visitors!\nHe strides to the window and sees  Halfdan's  ship. As he does so, Erik has to leap out of the  way,  inadvertently  knocking a chest. The King spins round and addresses the chest.\nKING ARNULF\nCome out... come out like a man... I know you're in there...\nKing Arnulf flings the chest open. revealing nothing but clothes. He is baffled. He reluctantly starts to leave.\nAUD\n(gently)\nIt's all in your own  mind, Father... It's YOU who imagine that\nI'm always up here with some man or other....\nKING ARNULF\nI don't know how you do it, Aud... I sometimes think you've got\nsome of your mother's magic...\nHe suddenly spies a small trinket-box and looks in that. But he doesn't find any strange man in it.\nAUD\nThere is no magic, Father... My mother had no magic...\nKING ARNULF\nShe did, I tell you! She  could blind me as easily as the night\nthe day.\nAUD\nIt's your fantasy...\nKING ARNULF\nBut one day I'll catch you... Like I caught her...\nHe leaves. Aud closes the door.  Erik  throws  the cloak off and starts getting dressed.\nAUD\nThe Cloak Invisible. It was my mother's parting gift.\nERIK\n\"The fifth one this week\"!\nAUD\nOh, for goodness' sake!\nERIK\nAnd I thought you said it was something special...\nAud runs to his side and puts her arms around him.\nAUD\nThat's just what I was trying to tell you. You ARE...\nERIK\nFive this week; how many the week before?\nAUD\nYou're as bad as my father.\nERIK\nAnd the week before that?\nERIK\nErik...!\n(she is really  sincere)\nI  want  to  help you get to\nAsgaard.\nErik is torn. He doesn't  know  whether  to  believe her or not. Ivar's horn sounds for a third time. Erik  races  to the window. He looks out. Halfdan's ship is even closer.\nERIK\nWe mustn't let him land!\nAUD\nWho?\nERIK\nHalfdan the Black.\nAUD\nBut, Erik...\nBut Erik is off out of the door.\nAUD\nNo. Wait! My father will be -\nThere is a thump and a  yell  as  Erik  is  set  upon by the King's two musicians.\nKING ARNULF\nI might have known it was you!\nMUSICIAN 1\n(pinning Erik's arms behind him)\nI'm not hurting you, am I?\nERIK\nWhat?\nMUSICIAN 2\nYou WILL tell us if we hurt you?\nThey start to march Erik through the palace.\nERIK\nLet me go!\nErik struggles.\nKING ARNULF\n(to musicians)\nCareful!\n(to Erik)\nThey're not supposed to hurt you.\nERIK\nYou've got to let me go!\nMUSICIAN 2\nOh no! We can hold onto you - just so long we don't squeeze too hard or bump you.\nIn the distance we hear the horn again.\nERIK\nHalfdan the Black's here!\nThey have reached a cell. The musicians starts to chain Erik up.\nKING ARNULF\nIt's all part  of  our  safety  regulations. You see if someone\nwere to get hurt they might get angry and then... well...\nERIK\nThey'll be more than \"hurt\" if Halfdan the Black lands! Ow!\nMUSICIAN\nOoh! I'm terribly sorry.\nKING ARNULF\nWho is Halfdan the Black?\nERIK\nHe's trying to stop us waking the Gods.\nKING ARNULF\nWhy?\nERIK\nBecause that's how he makes his money, by war and plunder!\nKING ARNULF\nDon't talk nonsense.\nERIK\nHe wants to kill US!\nKING ARNULF\nNot when we explain about the Great Blessing.\nERIK\nYou don't know Halfdan the Black.\nKING ARNULF\nI know  that  the  Great  Blessing  has  kept  the  peace for a\nthousand years, and will keep it for the next thousand.\nThe horn sounds again. Erik is about  to argue this point when Thorfinn suddenly bursts in.\nTHORFINN\nErik!\nMUSICIAN 2\nWe're not hurting him!\nMUSICIAN 1\n(to Erik)\nAre we?\nERIK\nJust let me go!\nTHORFINN\nHalfdan the Black's here!\nERIK\nI know!\nTHORFINN\n(to the King)\nHe wants to KILL us.\nThey both look at King Arnulf. The King thinks.\nERIK\nYou don't want him to kill us ON Hy-Brasil! Do you?\nThe King thinks some more. The horn sounds once more. Cut to GOLDEN DRAGON. Erik  and  the  Vikings are scrambling into their war gear. They glance nervously over  to where Halfdan the Black's ship is riding on the waves.\nTHORFINN\nI feel strange.\nErik looks at Thorfinn, shocked.\nIVAR THE BONELESS\n(his throat dry)\nSort of wobbly and excited?\nTHORFINN\nSort of...\nIVAR\nThat's fear.\nSVEN\nBut Thorfinn doesn't know the meaning of fear.\nTHORFINN\nIs it sort of... like a sinking feeling in your stomach?\nIVAR\nThat's it!\nERIK\nBut. You're not even afraid of DEATH, Thorfinn!\nTHORFINN\nI know. I know.\nSVEN'S DAD\nIt's magic.\nERIK\nWhat \"magic\"?\nSVEN'S DAD\nI've heard stories of a  magic that strikes fear into the heart\nso you cannot fight.\nSVEN\n(deadly serious)\nYes... I can feel it.\nIVAR THE BONELESS\n(eagerly)\nI always feel like this!\nSuddenly Halfdan's ship rises up out  of  the water , and revealing the secret of its hidden power.  Under  the  water-line  is another line of oars! The Vikings are dumbfounded.  Ivar  drops trembling to his knees. The rest go white. Thorfinn draws his  sword. Erik realizes his men are rapidly talking themselves into a blue funk.\nERIK\nIt's not magic! It's just a trick!\nTHORFINN\n(turning on him angrily)\nDon't you FEEL it?\nErik looks around at his paralysed crew. He realizes he is the only one who can save the situation.\nERIK\nVery well! It they're using magic - we'll use magic of our own!\nHe leaps out of GOLDEN DRAGON  and  races  up  to the shore towards the city of Hy-Brasil. Erik races into the Forum and gazes up at the high walls of the Palace. Without a thought he produces  two  daggers  and  plunges them into the stonework. Then he hauls himself up the sheer cliff of wall up to Aud's bedchamber fist over fist. It is, indeed, a prodigious feat. He arrives at Aud's window exhausted. Aud, who  has  appeared at the window, looks at him curiously.\nAUD\nWhy didn't you come up by the stairs?\nErik looks around  and  notices  for  the  first  time  the magnificent flights of stairs leading up to the top of Aud's tower.\nERIK\n(rather miffed)\nJust give me a hand.\nAUD\nI mean, you could have killed yourself.\nErik clambers into Aud's room.\nERIK\nWhere's the Cloak Invisible?\nAUD\nWhy?\nErik looks around and is suddenly suspicious.\nERIK\nI can't see it!\n(Indignation  suddenly seizes him)\nHave you got\nanother man in here?\nErik starts feeling the air as if expecting to find an invisible body.\nAUD\nIt's in the chest.\nErik races over and grabs the cloak.\nAUD\nNo!\nERIK\nI'll bring it back.\nAUD\nErik. You don't understand.\nERIK\nNo. It's YOU who doesn't  understand,  Aud. Halfdan has come to\nkill and destroy. We brought him here. We must stop him.\nAUD\n(pointing at the cloak)\nBut you don't realize....\nERIK\nGoodbye, Aud...\nErik leaps out of the window.  For  a  moment Aud is surprised and then alarmed as she realizes he's jumped  out  of  the window, which is some forty feet off the ground.\nAUD\nErik!\nShe rushes to the window in time  to see Erik parachuting down, holding the four corners of the  cloak.  Erik  lands  safely and waves with the cloak.\nERIK\nAnd thanks for the Cloak Invisible!\nAUD\nNo! WAIT! ERIK! The Cloak!  The  CLoak Invisible! It only seems\nto work on my father!\nBut Erik cannot hear her. He is already racing back to his ship. Back on GOLDEN DRAGON, Thorfinn  is  taking \"Being Scared\" lessons from Ivar the Boneless.\nTHORFINN\nAnd a sort of slightly sick feeling?\nIVAR\nThat's it! AND you keep wanting to go to the lavatory.\nTHORFINN\nOh, yes! I hadn't noticed that!\nSNORRI\nOh, shut up, you two. You're making us ALL nervous.\nErik leaps into GOLDEN DRAGON brandishing the Cloak Invisible.\nERIK\nSo Halfdan the Black's using magic, is he? Well, I have a magic\nto match his!\n(he holds up the Cloak Invisible)\nKEITEL\nWhat is it?\nSNORRI\nA magic dishcloth.\nERIK\nTo the oars!\nTHORFINN\nD'you think I've got time to go behind that bush?\nIvar starts to drum and the  Vikings  begin to row. GOLDEN DRAGON heads out of the harbour. Cut to Halfdan the Black  flanked  by  his  advisers, Gisli Oddsson and Eilif the Mongul. He gives a nod and Eilif bangs his staff of office on the deck, as a signal for the  galley  slaves  to speed up. Down in the galley, the slave master (a diminutive  Japanese)\nstalks down the decks lashing  the  sweat-streaked  galley   slaves   and   cursing  them  in incomprehensive Japanese. Fortunately  (or  perhaps  unfortunately)\na  translation  appears  in subtitles.\nSLAVE-DRIVER\n(subtitled)\nRow!  You  incomprehensible,  horizontal-eyed, Western\ntrouser-wearers! Eurgh! You all  look  the  same  to  me! How I\ndespise your lack of subtlety  and your joined-up writing! You,\nwho have never committed ritual suicide in your lives!\nSLAVE\n(whispering to his neighbour)\nYou know, I don't think it would be so bad,\nif we knew what he was saying...\nSLAVE-DRIVER\nSILENCE! Unceremonious  rice-pudding  eaters!  How  I abominate\nyour milk-drinking and your  lack  of ancestor-worship and your\nfailure to eat your lunch out of little boxes!\nMeanwhile the Vikings  are  growing  increasingly  uneasy  as  they row towards Halfdan.\nSVEN'S DAD\nWhat \"magic\" have you brought, Erik?\nERIK\nYou'll see!\nAt this point, back on the  Black  Ship,  Halfdan gives another nod and Eilif raps out yet another command  with  his staff. This time the prow of the Black Ship opens up like a pair of jaws. The Vikings see it and panic.\nIVAR THE BONELESS \nI've done it!\nTHORFINN\nOh, yes...\n(he has too!)\nHalfdan nods again and another order is rapped out. This time a harpoon is fired from  the  prow.  It  thuds  into  gOLDEN  DRAGON  and  two of Halfdan's dog-soldiers start to winch  the  line  in. The two ships are hauled closer and closer. The Vikings panic even  more.  Erik  holds  up  the Cloak Invisible and grins round at his men, knowing he is going to surprise them.\nERIK\nHere! Here is the magic from the King's daughter!\nErik's men watch, half  sceptical  and  half  hopeful.  Erik enjoys the moment of suspense. The he throws the Cloak Invisible over his head and shoulders and grins round  at  his  men  triumphantly, imagining he has vanished from their sight.\nERIK\nThere! I have become the wind!\nThe Vikings look  at  him,  rather  puzzled.  Only  Harald  seems to be impressed.\nHARALD\nHow did he do that?\nSVEN'S DAD\nDo what?\nHARALD\nVanish into thin air?\nSVEN'S DAD\nHe hasn't.\nHARALD\nWell, where is he then?\nHarald looks around. He is the only one who can't see Erik.\nSVEN'S DAD\nHe's THERE!\nAt this point Halfdan's ship  suddenly  bites  into  the side of GOLDEN DRAGON. Erik leaps onto the  side  of  GOLDEN  DRAGON and swings across onto Halfdan's ship. The Vikings react  to the horror of Halfdan's ship biting into GOLDEN DRAGON  and  to  Erik's  blithe  leap onto the enemy boat. Erik lands on  the  deck  of  Halfdan's  ship,  and  grins at the ferocious skull-helmeted dog-soldiers.\nERIK\nOoh! Scary! Scary! Don't we look mean?\nTwo dog-soldiers look at each other, totally non-plussed. Erik grimaces at Halfdan's men, and does  a  little  pirouette  to show them all that he's invisible from every angle.\nERIK\nYou can't see me! But I can see you!\nHe breaks into a little dance. Halfdan glares at his advisers.\nHALFDAN\nWhat's going on?\nGISLI ODDSSON\nThat's Erik.\nHALFDAN\nWell, why isn't he scared of us?\nErik, meanwhile approaches  one  of  the  dog-soldiers  and makes silly faces at him.\nERIK\nBoo!\nThe dog-soldier topples  overboard.  The  galley  slaves  watch another dog-soldier fall into the hold amongst  them and lie there stunned. His sword falls onto the deck between the  slaves. One of the slaves throws down his oar, and picks  up  the  dog-soldier's sword. The slave-master suddenly appears. Once again he speaks immaculate JApanese.\nSLAVE-MASTER\n(subtitled)\nHey! What's going on?  Your big-breasted women give me\nno pleasure with their warmed-up fish and... Urgh!\nThe slave-master strides down the ship to flay the offending slave, but another slave trips him up and  in  a  twinkling  of an eye four others have  leapt  on  the  slave-master   (despite  their  chains)\nand  are extracting his keys.\nHALFDAN\nWhat's the matter? Haven't you seen anyone fight before?\nDOG-SOLDIER 1\nNo.\nDOG-SOLDIER 2\nThey're usually too scared of us.\nHALFDAN\nKILL him!\nErik, still  thinking  he's  invisible,  is  running  amongst  the dog- soldiers, having fun. He runs one dog-soldier through and kicks another overboard, then he runs past a  few  more, right up to Halfdan himself. He whisks the Cloak Invisible off his head for an instant.\nERIK\n(thinking he's revealing himself)\nHere I am!\nThen he turns and is off. Halfdan turns to his aides.\nHALFDAN\nWhat?\nBack on GOLDEN DRAGON, the Vikings' disbelief has turned to admiration.\nSVEN'S DAD\nThere! THAT'S a true Berserk.\nSVEN\nI'm just building up to it, Dad.\nSven starts banging his head on the side of the boat.\nSNORRI\nHe's gone batty!\nTHORFINN\nNo! The fear's gone!\nHalfdan grabs a sword off one  of  his dead dog-soldiers and thrusts it into the unwilling hands of his military adviser, Eilif.\nHALFDAN\nFight, damn you! Fight!\nCut back to GOLDEN DRAGON.  Now  Sven  leaps across onto Halfdan's ship followed by Ivar, yelling. Snorri looks back at Keitel.\nSNORRI\nWell! Come on!\nKEITEL\nI... I...\nKeitel is thinking: \"Maybe I should  let  Halfdan  win\" but he knows he can't let a thing like that happen, now he is faced with the reality of it. The companionship of the voyage has  brought them all too close for that.\nKEITEL\n(under his breath)\nHang the Blacksmith's Code!\nKeitel leaps to his feet and joins in the attack. Erik, meanwhile, is swinging across the deck from a rope.\nERIK\nI am the air! I am the wind!\nKeitel and Thorfinn are now fighting side by side.\nTHORFINN\nThis is life, eh?\nKeitel grins and strikes out. Ivar  turns  on Eilif who has reluctantly joined the fray. Maybe he's singled Ivar out as the most harmless. Ivar suddenly realizes he's only armed with drumsticks. Eilif smiles evilly.\nIVAR\nOoh... er...\nEilif's sword slices through Ivar's drumsticks.  Ivar turns to run, but is stopped by a dog-soldier.  Eilif  takes  the  opportunity to run him through from behind.\nIVAR\n(as he dies)\nOuch.\nErik sees Ivar's demise.\nERIK\nIvar!\nErik leaps to take revenge. He jumps  into the galley-pit and out again a la Douglas Fairbanks in  THE  THIEF  OF  BAGHDAD and dispatches Eilif with a single thrust. Sven and his  dad are fighting surrounded by dog- soldiers.\nSVEN'S DAD\nWell, go on! Go berserk!\nSVEN\nGIVE US A CHANCE, Dad!\nSnorri appears from behind.\nSNORRI\n(to Sven's dad)\nWhat about you? Why don't YOU go berserk?\nSVEN'S DAD\nI got to keep my eye on HIM...\nSven's  dad  looks  uneasy.  He  is   surrounded  and,  as  a  seasoned campaigner, knows they haven't much  chance. Halfdan smiles to himself. The battle is going his  way.  Thorfinn  meanwhile is fighting two dog- soldiers but is attacked from behind by a third.\nSVEN\nLook out! Thorfinn!\nBut it's too late. Thorfinn is run  through the back. Sven goes berserk and kills all three dog-soldiers. Sven's dad looks on, proud of his son for the first time. Maybe  their  relationship  will  never be the same again. Now Snorri sees something that cheers him up. SLaves are coming up from below to join the battle.  They  are  armed  with oars and swords. They join the fray, knocking dog-soldiers overboard with their oars. The dog-soldier are suddenly outnumbered. Halfdan's smile fades, and he looks around for an escape  route.  The  tide  of battle has now turned dramatically as dog-soldier after dog-soldier  is  tossed over the side or laid low by the combination of Vikings and slaves. Halfdan and Gisli slip into  a  lifeboat  and  sneak  off. The rats are leaving the sinking ship. Back on the deck,  all  the  dog-soldiers  are  dead  or overboard. The slaves and Vikings are cheering and  embracing each other. At the other end of the boat, Sven is cradling  the  dying Thorfinn in his arms. All around are jubilant slaves celebrating their freedom.\nSVEN\nThorfinn! You can't die!\nTHORFINN\nI'm not frightened... of anything...\nSVEN\nYou'll see my grandfather in Valhalla!\nTHORFINN\n(dying)\nNo... he's not... not... there...\nSVEN\nTell him I'm coming!\nThorfinn dies. Sven holds  him  and  a  tear  comes  down his face. The danger has made comrades of the two rivals. Erik, however, is still fighting a  last  lone dog-soldier; but just as he is about to run him through  the dog-soldier is stabbed in the back. He sinks to the floor, revealing  another dog-soldier. Erik is outraged by this act of treachery and turns on the assassin.\nDOG-SOLDIER\nNo! No\" Wait! Please wait, Erik!\nThe dog-soldier pulls his mask off to reveal he is, in fact, Loki. Erik is totally non-plussed.\nERIK\nLOKI! Where did YOU come from?\nLOKI\nHalfdan wanted to stop you waking the Gods... so... I disguised\nmyself to sabotage their plans.\nErik has meanwhile been joined by the remaining comrades.\nLOKI\nTo save YOU, Erik.\nErik is about to say \"But  how  can  you  see me? I'm wearing the Cloak Invisible.\"\nERIK\nBut -\nLOKI\nIt was my master Keitel's idea.\nAll eyes turn on Keitel who looks very uncomfortable.\nLOKI\nWasn't it, Keitel?\nKEITEL\nWell... I... I thought...\nKeitel is overcome b the power of Loki's will, but he is deeply ashamed of his complicity in Loki's deeds.  Snorri gazes at Keitel with growing suspicion.\nERIK\nBut... How is it you can  see  me?\n(he looks round)\nYou can all\nsee me?\nLOKI\nWhat d'you mean?\nSNORRI AND OTHERS\nWhy shouldn't we see you?\nHARALD\nI can't see him.\nERIK\nI'm wearing the Cloak Invisible....\nErik takes it off to demonstrate.\nHARALD\nOh! There you are!\nERIK\n(to the others)\nYou mean... you could see me all the time?\nThe Vikings look at each other, mystified.\nSNORRI\nWeren't we supposed to?\nERIK\nOh... I feel a little... oh...\nErik's knees give way and he faints onto the deck. Cut to King's  Hall  some  time  later.  A  victory  celebration  is in progress. It is a little bit  like  a Hampstead cocktail party, and the rough, battle-stained Vikings look  rather  out  of place holding their little canapes. Suddenly the King claps for silence.\nKING ARNULF\nWe are grateful to you, Erik, and to your men...\nCOURT\nYes, we are...\nKING ARNULF\nAnd there is only ONE way we can repay you... Musicians!\nKing arnulf claps his hands. Erik rushes  over to him, anxious to avoid another Hy-Brasilian concert.\nERIK\n(hurriedly)\nWell, we'd love to hear  you  sing again, but what we'd really\nappreciate would be if you could see your way to lending... not\ngiving of course...\n(continuing)... but just lending us the....\num... the, well, to be quite blunt... the Horn Resounding.\nAll the time Erik is talking the  doors  of the hall behind are opening and a vast lur or horn is carried in  by six bearers. One or two of the Vikings have turned  to  look  and  are  now  standing speechless. King Arnulf beams at Erik.\nKING ARNULF\nIt's yours.\nNow Erik finally turns and looks  at  what everyone else is looking at. Erik's jaw drops. Everyone in the court beams at Erik,except Aud who is looking sad and disappointed.\nERIK\n(when he can find his voice)\nIs THAT it?\nA cloud passes over King Arnulf's happy face.\nKING ARNULF\nIs there something the matter with it?\nERIK\nOh! No! No... of course  not...  it's just I hadn't expected it to be quite so big.\nKING ARNULF\nWell, it's not called  the Horn Resounding for nothing.\n(aside)\nYou DO know how to play the horn, don't you?\nERIK\nYes... oh, yes...\nKING ARNULF\nThen I expect you'll be leaving first thing in the morning.\nThe King manhandles Erik away  from  his  daughter. Perhaps we have the feeling that she's isn't going to  let  Erik go as easily as that...Mix through to later that night. The Vikings  are lying asleep on the Great Hall, beside the  Horn  Resounding.  The  camera  closes  in on Keitel. Suddenly a voice comes from the shadows:\nVOICE\n(whispering)\nKeitel! Keitel Blacksmith!\nKeitel opens his eyes and finds Loki close beside him.\nLOKI\nWhat's the matter,  Keitel  Blacksmith?  Have you forgotten why you came on this voyage?\nKeitel is silent.\nLOKI\nAre you going to let Erik wake the Gods?\nKEITEL\nHow can we stops him now?\nLoki looks around and then opens his hand  in front of Keitel. In it is the mouthpiece from the Horn Resounding.\nLOKI\nTake this and throw  it  from  the cliff heights. They'll never make the Horn Resounding sound without it.\nKeitel frowns. Then an obvious thought limps across his muscular mind.\nKEITEL\nBut why me? Why don't you do it?\nSomebody stirs.\nLOKI\nSh! Hurry!\nKEITEL\nYOU do it!\nLOKI\nYou'll be able to throw it further than I could.\nKeitel thinks. This is true.\nLOKI\nIt must go far out to sea.\nLoki  presses  the  mouthpiece   on   Keitel.   Keitel  takes  it,  but reluctantly. Another Viking stirs.\nLOKI\nSurely you haven't forgotten the Blacksmith's Oath?\nKeitel is about to reply and say he's been having second thoughts about it, but somehow he can't. Loki has such power over him.\nKEITEL\nI...\nSuddenly another Viking stirs, and Loki hisses at him.\nLOKI\nHurry!\nLoki pretend to go  back  to  sleep.  Keitel  (feeling  a bit lumbered) thinks about his task and hesitates...  Who  knows? Perhaps he is about to stand firm, but Loki plays his trump card.\nLOKI\n(without opening his eyes)\nOr  I  might  have  to tell Erik why you really came on this voyage.\nKeitel  is  caught.  He  closes  his   eyes  in  resignation  and  then reluctantly starts to make his way out  of  the Hall. As he gets to the doors he trips over Snorri, who wakes.  The mouthpiece falls a few feet away.\nSNORRI\nWho's that?\nKEITEL\nIt's me. I'm just  going  to  water  the  dragon...\n(he gives a false laugh)\nSNORRI\nOh...\nSnorri notices the silver mouthpiece on  the  floor, but he pretends he hasn't.\nSNORRI\nOh... clumsy idiot.\nSnorri pretends to go back to sleep,  but  he opens one eye and watches Keitel Blacksmith recover the mouthpiece,  and then follows Keitel out. Loki gets up too. He follows to keep an eye on Snorri. Cut to Aud on the shore, gazing moodily  out to sea. She is brooding in Erik's imminent departure. Suddenly a stone falls from above; she looks up and sees a figure appear on the cliff above. Hurriedly she withdraws into the shadows. Keitel Blacksmith  appears  on  the cliff-top. In his hands he holds the mouthpiece  of  the  Horn Resounding. e examines it, turning over in his mind whether  he  is  doing the right thing or not. then he decides he must.\nKEITEL\n(to himself)\nMy fellow blacksmiths.\nHe prepares to throw it.\nSNORRI\nKeitel!\nKeitel jumps out of his skin.\nKEITEL\nWhat?\nSNORRI\nWhat are you doing, Keitel Blacksmith?\nKEITEL\nGet away, Snorri.\nSNORRI\nWhat have you got there?\nSnorri advances towards Keitel. Keitel  backs away, dangerously near to the edge of the cliff. His boot  slips and he jerks himself forward. At the same time Snorri makes a grab for the mouthpiece. A scuffle ensues, during which the  mouthpiece  of  the  Horn  Resounding  is dropped. It bounces off the cliff and falls down  to the shore below. Aud steps out of the shadow and  picks  it  up.  She  frowns  and  looks up, and then screams, as she sees the men fighting.\nAUD\nNo!\nBut it's too late. Snorri goes white, gives a hideous gasp... and sinks slowly to his knees - revealing Loki  standing behind him with a bloody knife. As Keitel and Loki watch  Snorri  die,  a drop of blood from the knife falls to  the  ground.  The  moment  it  lands,  there  is a deep subterranean groan, and the earth  begins  to tremble violently. Keitel and Loki look around in alarm.\nKEITEL\nOh Gods! What have we done?\nBack in the King's Hall, Sven,  Sven's  dad  and Harald are wide awake, but for the moment paralysed, as bits of masonry crash around them. The cheerful figure of King Arnulf  appears  at  the  top of a stairway. He raises his hands.\nKING ARNULF\nStay calm! This is NOT happening.\nThe King then hurries out of a door at the top of the staircase.\nSVEN'S DAD\nWhat did he say?\nERIK\nLook out!\nThe doors of the Great  Hall  burst  open  and  a wall of water crashes through, knocking the Vikings  off  their  feet.  There is little doubt that the whole of Hy-Brasil is sinking  see  a street go down, a statue sink and then we Cut to a close-up of King Arnulf. He is standing at the  top  of  the  Forum  steps addressing a crowd of anxious citizens. They are keeping  surprisingly good order considering they are already standing ankle-deep  in  water,  and the whole town is rapidly sinking around them.\nKING ARNULF\nNow, I know what some  of  you  must be thinking... the day has come.... we're all going  down,  etc.  etc.  But let's get away from the fantasy and look at the FACTS. FACT ONE - The threat of  total  destruction has kept the peace for one thousand years. FACT TWO - The chances of  it  failing now are therefore one in three hundred and sixty-five thousand.  FACT THREE... \nBy this time the  water  is  up  to  people's  knees,  and several have crowded onto the lower steps to avoid getting wet.\nKING ARNULF\nFACT THREE - Our  safety  regulations  are the most rigorous in the world. We are all  nice  to  each  other, we never rub each other up the wrong way or contradict each other, do we?\nCROWD\nNo.\nRumble. The buildings sink and masonry falls.\nCITIZEN\nWe... er... do seem to  be  going down quite fast, Your Majesty - not trying to contradict you, course.\nKING ARNULF\nNo, of  course  you're  not,  citizen.  But  let's stick to the facts. There has  NEVER  been  a  safer,  more  certain  way of keeping the  peace.  So  whatever's  happening,  you  can  rest assured, Hy-Brasil is NOT sinking. Repeat, NOT sinking.\nWe cut to an unfortunate Hy-Brasilian who  looks out of a window to see if it's raining, but is immersed before he can find out. The citizens in the Forum, however,  are  reassured by the King's words - even though they are now  up  to  their  waists in water. One of them steps forward.\nANOTHER CITIZEN\nMay I just make a  point  in support of what King Arnulf's just said?\nKING ARNULF\nWe'd be delighted - wouldn't we?\nCITIZENS\nYes, we'd certainly like  to  hear  what  one  of us has got to say...\nErik, Sven, Sven's dad  and  Harald  struggle  out  of  the Great Hall, carrying their belongings and the Horn Resounding, while the citizen is still speaking most  articulately  in  support  of  the  King. They are ALMOST in a panic.\nERIK\nWhat are you all doing?\nCITIZEN AT THE BACK\n(cheerfully)\nIt's all right. It's not happening.\nERIK\n(urgently)\nThe place is sinking!\nCITIZEN AT THE BACK\nYes... I thought  it  was  too, but the King's just pointed out that it can't be.\nCITIZEN\n(still speaking in support of  the  King)\n...and, of course, we mustn't forget King Arnulf's EXCELLENT eye for flower-arranging.\nThere is a smattering of applause. A few people pull their robes up out of the wet. Erik leaps onto a wall and shouts to the crowd.\nERIK\nSave yourselves! Hy-Brasil... is sinking.\nThere are a lot of knowing smiles amongst the citizens.\nCITIZEN FROM MIDDLE \nLook, you don't know our safety regulations.\nKING ARNULF\nIt can't happen.\nERIK\nBut it IS! Look!\nKING ARNULF\n(ignoring Erik)\nThe important thing is not to panic.\nCITIZENS\nQuite... yes... we understand....\nKING ARNULF \nI've already appointed  the  Chancellor  as  Chairman of a committee to find out exactly  what  IS  going  on, and meantime I suggest we have a sing-song!\nCITIZENS\nGood idea!\nANOTHER\nCan we do the one that goes \"TUM-TI-TUM-TI-TUM-TI-TUM\"?\nErik looks around in despair. Meanwhile in another street someone is struggling in the floodwater.\nLOKI\nI can't swim! I can't swim!\nKEITEL\nRelax!\nLOKI\nI'm drowning! Help!\nLoki grabs Keitel round the neck.\nKEITEL\nLet go!\nBut Keitel is pulled under. He re-emerges spluttering.\nKEITEL\nUrrgh! Argh! Let go, you idiot!\nLOKI\nHelp!\nKEITEL\nYou'll drown us bo...\nBut they go under  again.  At  this  point  Erik,  Sven, Sven's dad and Harald swim round the corner, pushing the Horn Resounding. They see the figures disappearing under the water.\nKEITEL\nHelp!\nLOKI\nHelp!\nErik, Sven and Co. swim  as  fast  as  they  can to rescue the drowning pair. They struggle to overpower  the  panic-stricken Loki, but he puts up a manic fight. Unexpectedly,  Harald Missionary suddenly unleashes a vicious right hook and lays Loki out  cold. There is a moment's stunned silence that is no unmingled with indignation.\nSVEN\n(with hurt surprise)\nYou hit him!\nHARALD\nWell, it's what you're supposed to do... isn't it?\nSVEN'S DAD\nLook!\nThey look up as GOLDEN  DRAGON  sails  around  a  corner of the street, piloted by Aud.  As  the  Vikings  scramble  aboard,  the  sound of the \"sing-song\" reaches a particularly noisy  and discordant climax attract their attention. Back in what was the Forum,  a crowd of unconcerned-looking citizens is sitting on the  last  roof  and  just  coming  to  the  end  of another appalling song.\nCITIZENS\n...Te...Tum!\nKING\nYou know, I think we're getting better.\nCITIZEN 1\n(with genuine interest)\nHow can you tell?\nKING\n(a bit stumped)\nEr...\nAUD\nFather!\nThe King looks up.\nKING ARNULF\nIt's all right! It isn't happening!\nAUD\nBut, Father, it IS!\nERIK\nGet on board!\nCITIZEN 2\nNo THANKS!\nCITIZEN 3\nWho do you think YOU are?\nCITIZEN 1\nPanic-monger!\nThe roof  is  now  sinking  rapidly,  though  the  citizens  appear  as unperturbed as ever.\nCITIZEN\nLeave us alone!\nSVEN\nYeah. Leave 'em alone.\nAUD\nIt's sinking! Hy-Brasil is sinking!\nKING ARNULF\nWell, my dear, I think you'll  find it's all a question of what you want to believe in....  I  have slightly more experience of these matters than you...\nUnfortunately, at this point,  the  entire  gathering  of citizens, the King and the Forum Temple disappear below the waves.\nAUD\nFather!\n(tears spring to her eyes)\nHarald Missionary has put his arm around Aud in a fatherly way.\nHARALD MISSIONARY\nThere, my child... It's at times like this that this book can be a great help...\nErik shoos him away.\nHARALD MISSIONARY\n(with his usual promptness)\nRight!\nGOLDEN DRAGON spins alone in the wide ocean. Fade. Fade up some time later. They  are  all  gathered  in front of the Horn Resounding.\nERIK\n(to himself)\nWe must blow the first  note...  he note that will take us to Asgaard...\nSVEN\n(nervously and with awe in his voice)\nOver the Edge of the World.\nThe other men look up at the  Horn  Resounding, and begin to feel a bit nervous.\nERIK\nWe are going where only the dead have been before...\nErik takes a deep breath and then puts his lips to the Horn Resounding. He blows. There is a splutter,  and  one  or  two of the Vikings titter amongst themselves. He has another go. But  again, all he produces is a pathetic spluttering.\nSVEN\n(not unkindly in his manner)\nUh! Here! Give it to me!\nSven pushes Erik aside. Sven blow...  he becomes redder and redder. But all he produces is a splutter. He gets a bit angry.\nSVEN\nThor's blood!\nSven's dad looks heavenwards.\nSVEN'S DAD\nYou're not using the right technique.\nSven's dad tries to take it over.\nSVEN\nNo! I'm doing it!\nThey start to struggle.\nSVEN\n(getting angry)\nYou're always telling me... TELLING me!\nErik tries to separate them.\nERIK\nSven!\nSVEN\n(to his dad)\nLet me do something for myself for a change!\nSuddenly Aud comes forward.\nAUD\nNo! Don't quarrel!\nSven and his dad stop fighting, surprised by the vehement in her voice.\nAUD\nWe'll never get where we want to go if we fight.\nAud crosses to the Horn  and  inserts  the  mouthpiece. Loki glances at Keitel. He hadn't bargained for this!\nLOKI\nEr... don't blow it! You never know WHAT might happen...\nAUD\nIt has not spoken for a  thousand years... You must bring it to life with a kiss...\nShe puts her lips to the  mouthpiece  and  just touches it with them... almost a kiss... then... very gently... she begins to blow... a soft... slight note can just be  heard...  Aud  takes  her  mouth away from the mouthpiece... and the soft  note  goes  on...  reverberating... A sweet note... a magic note... the Vikings stand stock-still, enchanted by the sound... and the sound all  the  time  is  getting  louder and the Horn begins to vibrate with the  note.  As  the  volume increases the GOLDEN DRAGON itself begins to reverberate  with  the  sound. Rings of ripples begin to radiate out from  the  boat  across  the  calm water. The note grows louder and louder, and  the  Vikings,  who at first were laughing and cheering at Aud's success, begin to get rather alarmed. Louder and louder gets  the  note  and  the  Horn  shakes  and the boat vibrates. Things start to  be  shaken  loose,  and  fall onto the deck. Ropes uncoil and run loose. A heavy  block suddenly crashes down to the deck, crowning Harald and laying him  out flat. Louder and louder grows the note, and the Vikings have  to  stop  their  ears for the pain. The water around the ship becomes more and more agitated. And then another sound is  heard.  It  is  the  thunder of water in the distance like a million  distant  waterfalls.  And suddenly they notice the sea is running like a river  - all in one direction... sweeping the ship forward with incredible momentum. In  no time they are engulfed in a mist, still travelling at a rate of knots. Almost at once appointed rock looms out of the mist ahead of them. Erik flings himself at the steering oar, and everyone is thrown about as the ship veers wildly and just misses the rock, only to see another looming up ahead of them. The ship  veers  again,  as a third rock looms ahead. This time Sven has grabbed a coil  of  rope, and as they pass the third rock, he throws it like a lasso over  the rock. Loki and Keitel leap to grab the rope just as  the  rope  goes  taut  and  the  ship comes to a lurching stop, anchored by the rope,  but still swaying and buffeted in the racing waters. Those on board  shout  to  each other, soaked to the skin. It is difficult to make out what they are shouting.\nLOKI\nHelp!\nAUD\nWhat are you doing?\nLOKI\nWhat d'you think? Help! Somebody help us!\nSVEN\nShut up!\nLOKI\n(pointing at Aud)\nShe wants to kill us!\nKEITEL\nShe wants to take us over the Edge of the World!\nAUD\nYou want to get to Asgaard, don't you?\nLOKI\nHow do we know this is the way?\nERIK\n(shouting)\nWe blew the Horn Resounding.\nLOKI\n(screaming and pointing  an  accusing  finger  at  Aud)\nSHE blew the Horn\nResounding.\nKEITEL\n(shouting)\nDon't you see, Erik! She wants revenge!\nERIK\nWhat are you talking about?\nLOKI\n(to Keitel)\nShut up!\nKEITEL\nShe knows it was our fault!\nLOKI\nKeep your mouth shut, Keitel!\nKEITEL\nNo! It's YOU, Loki! I should never have listened to you!\nLoki looks around desperately.\nLOKI\nYou've lost your mind.\nKEITEL\nWe came to stop you  waking  the  Gods, Erik! But I didn't want anyone to get hurt!\nLOKI\nYou fool!\nSuddenly Loki produces his stiletto and  leaps onto Keitel, stabbing at him.\nLOKI\nI should have got rid of you long ago!\nKEITEL\nLike you got rid of Snorri!\nErik tries to separate them.\nAUD\nNo! No! We are in  the  spell  of the Horn! Hatred will destroy us.\nERIK\nThat's right!\nFor a split second Erik is distracted. He looks across at Aud and for a moment he sees Freya standing there.\nFREYA\nOnce you are in  the  spell  of  the  Horn, hatred will destroy you...\nThen it is Aud once more.  But  in  that  split second Loki has stabbed Erik.\nERIK\nArrgh!\nErik staggers back clutching his arm. Keitel  gives a roar of rage, and picks Loki up bodily and hurls him  out of the boat into the maelstrom. The other Vikings look on aghast. Keitel turns on them\nKEITEL\nHe killed Snorri! He caused the  land of Hy-Brasil to sink! SHE knew!\nAUD\nI didn't know!\nKEITEL\nNow she wants to send us over the Edge of the World!\nAUD\nHow else d'you think we're going to get to Asgaard?\nThe Vikings look at each other amidst  the roaring waters and the thick spray. Erik holds his bleeding arm  and  looks  at Aud. Should he trust her or not? Suddenly he turns on the others.\nERIK\n(shouting  above  the  din)\nDo  YOU  know  the  way  to  Asgaard,  Keitel Blacksmith?\nKeitel shakes his head.\nERIK\nDo YOU know the way to Asgaard, Sven?\nSven shakes his head.\nERIK\nThere is one road before  us,  and  that leads over the Edge of the World.\nHarald sits up as he returns to consciousness.\nHARALD\nThere IS no Edge of the World.\nSven's dad bonks him again. Erik  takes  the  rope and begins paying it out. With grim faces the Vikings  turn  and face towards the roaring of the waters, as Erik edge the ship  further  into the mist. The noise is deafening. It would be almost  impossible  to  hear any voice above it. The faces of the  Vikings  betray  their  fear  as they find themselves emerging from out of the mist at  the  Edge  of the World. They gape as they find themselves confronted by a  Waterfall of Seas - stretching on either side of them - as far  as  the  eye  can see - water falling and plunging over the lip of the world. And in front of them - the blue sky continues on down and down until  it  shades into blackness strewn with stars beneath their feet... Sven, Sven's dad and Keitel edge to the prow and gasp.\nAUD\nNo! Don't look over the Edge!\nErik lets out a little more rope, until the ship is protruding over the edge. Sven, his dad and Keitel peer  over the side, and stare down into the abyss. They gasp. From above we  see  the prow of GOLDEN DRAGON and the backs of the Vikings'  heads  in  plain  view against a backdrop of stars below them.\nERIK\nLet me see!\nAud holds him back.\nAUD\nNo. Don't look... The abyss will suck away your strength.\nERIK\nI MUST look! Keitel! Hold this!\nErik turns to see Sven and Keitel trembling... They hold onto the sides of the ship but their legs can barely support them.\nSVEN\nThere is nothing we can do...\nSVEN'S DAD\nHelpless...\nKeitel start to laugh.\nKEITEL\nHa ha...  I  believed  Loki...  I  believed  I  had  a  duty to blacksmiths! Ha ha ha!\nKeitel laughs a little hysterically. Aud turns urgently to Erik.\nAUD\nYOU still want to go to Asgaard?\nERIK\nOf course.\nAUD\nDo you believe I love you?\nERIK\nI... but I...\nAUD\nYou don't have to love me. Just: do you believe I love YOU?\nERIK\nYes - I believe you do.\nAUD\nThen let go!\nErik hesitates, then he decides to  believe  in Aud. He throws the rope away. At once the ship  shoots  off  over  the  Edge  of the World into space... Everything seems to slow down,  as the longship drops down and down... the ship twists slowly  as  it  drops....  round and round. The Vikings gaze about them in wonder,  as  they find their ship if falling in silence amongst the stars. Harald comes to once again.\nHARALD\nI'm still seeing stars.\nKeitel looks round at him.\nKEITEL\nWe're ALL seeing stars.\nHARALD\nNo! I was hit on the head.\nThe longship falls and  falls  through  the  star-strewn space until it softly lands in a white wilderness. On the deck the Vikings  are  huddles  up,  covered with rime-frost. It seems as if they  have  been  lying  there  half-frozen  for some time. Perhaps the entire adventure has all  been  a dream, and they have been stuck in the Arctic pack-ice the  whole time. The hallucinations of men near to death. Aud tries to wake Erik.\nAUD\nDon't sleep... wake... Look!\nErik opens his eyes and, for an  instant,  he sees Helga. He blinks and realizes it is Aud who is  calling  him back to consciousness. Suddenly coloured lights begin to play to his face.\nERIK\nBi-Frost... The Rainbow Bridge.\nAbove them the Aurora Borealis stretches up, magnificent and awesome in the sky. Erik makes his way through the other Vikings.\nERIK\nWake up!\nThe others slowly begin to rouse  themselves from their icy slumber and sit up, awed by the sight.\nKEITEL\n(whispering)\nAre we dead?\nVIKINGS\nThe Rainbow Bridge.\nThey all peer up at the  ever-changing  colours of the Aurora Borealis, hanging in the  sky  above  them  like  organ-pipes.  But  something is happening. The lights begin  to  fade  to  reveal  a  magical city on a mountain. The Vikings realize that this  is journey's end.... they have reached Asgaard... the City of  the  Gods.  The Vikings all catch their breaths and gaze in awe.\nERIK\nAsgaard!\nHARALD MISSIONARY\nWhere?\nSVEN'S DAD\nUp there, you fathead.\nHARALD MISSIONARY\nUp WHERE?\nHarald look round quizzically at the  others.  It  is clear that he can see nothing.\nERIK\nLook! It's real.\nHarald looks around at the others.\nHARALD\nHallucinations are real.\nIt's no use; Harald can  see  nothing.  The  Vikings, transfixed by the sight of their  fabled  home  of  the  Gods,  rise  to  their feet. Aud whispers to Erik.\nAUD\nThe second note.\nERIK\nThe second not to wake the Gods...\nErik kneels in front of the Horn.\nAUD\nGently...\nErik blows... a soft gentle note... He takes his mouth away, and smiles at Aud. Once  again  the  Horn  stars  to  vibrate  and  the  note gets louder... the ship starts to vibrate... louder and louder... The whole landscape starts to  vibrate...  louder  and louder grows the not until even the stars in  the  sky  are vibrating and then a magical thing starts to happen... The note  fades  as one by one the shimmering stars start to fall  out  of  the  night  sky...  they fall like silver snow... until the ship... the Vikings... Asgaard... the whole landscape is covered in sparkling dust... then  in  the ensuing silence the first light begins to glow in  the  Halls  of  Asgaard... then another... and another... Erik stares as is bewitched  and  slowly begins to climb out of GOLDEN DRAGON.... but Aud tries to pull him back.\nAUD\nErik! You've done what you came to do!\nERIK\nNot quite...\nAud looks at him.\nAUD\nBlow the third note! The note to take us home!\nERIK\nThere is something I must ask the Gods...\nAUD\nNo living man has ever set  foot in the Halls of Asgaard... The Gods will never let you return. \nErik looks at her... for a moment... But he knows he has no choice.\nSVEN\nI came to find my grandfather.\nERIK\nI have to go...\nAUD\nThen I shall come too.\nERIK\n(stares at her)\nNo... no..\nAUD\nI don'T want to live WITHOUT you.\nERIK\nBut, Aud... I... I came to find someone...\nAud is about to say \"Her?\", but she  bites the word back and looks down at the ground.\nERIK\nI'm sorry, Aud... I really am.\nAud kisses Erik, who then turns and climbs out of GOLDEN DRAGON and sets off across the ice. Sven follows.\nSVEN'S DAD\nWait for me! I'll be dead soon anyway...\nKEITEL\nYou can't go without me!\nThey follow. Even Harald Missionary starts to follow.\nHARALD\nWhere are they all going?\nAUD\nAren't you afraid?\nHARALD\nOh... There's nothing for ME to be afraid OF.\nHarald smiles and sets off  after  the  others.  Aud follows. The stars have fallen to form a shining,  winding  pathway  up to the City of the Gods. This is what the Vikings head for. Between them and the Citadel  strange  huge  forms rise up. The Vikings approach and find the vast skeletons  of  the slain giants. The Vikings are but tiny gnat-sized  figures  wending  their  way  between the vast figures. They climb  the  stairway-path  of  stars,  up  the  winding  road  and eventually fins themselves outside the massive doors of Asgaard.\nERIK\nValhalla...\nSven turns on Harald.\nSVEN\nThere! It's real! It's solid! Now do you believe us?\nHe pats the wall of Valhalla -  the Great Hall. Harald reaches out, but his hand goes right through the wall.\nHARALD\nThere isn't anything.\nHarald Missionary walks straight through  the  wall and disappears from sight. The Vikings  gasp,  and  run  up  to  feel  the  point  where he disappeared. The door is perfectly solid to them, and they jump pout of their skins as Harald suddenly reappears again.\nHARALD\nYou're having me on, aren't you?\nERIK\nIt's Valhalla - where the warriors slain in battle go.\nAUD\nIt doesn't exist for him.\nSVEN'S DAD\nHe's just s cynic.\nAt this moment there is a creak  and the great doors mysteriously swing open. As if mesmerized, the  Vikings  enter  the  Halls of Asgaard. The door slams behind them. They spin round, but the doors have vanished... No man has ever entered the Halls of Asgaard and left alive... Erik slowly starts to cross  the  vast  floor  looking around him as he does so. One by one the other Vikings follow. After a while Erik stops.\nERIK\nListen!\nThe Vikings listen.  They  hear  the  sound  of  children  laughing and shouting. Erik and his men follow through the columns towards a pool of light. The scene that greets their  eyes  is  not  at all what they had been prepared for. Valhalla is not full of the warriors  slain in battle, quaffing mead on the ale-bench and  reliving  old  battles  -  it  is,  instead  full of children romping, laughing, shouting,  quarrelling and playing games... chess, fencing... dice... tag, etc., around a wide hearth fire. Women are cooking and doing other housewifely things... weaving, making bread, etc. It is a  thoroughly  domestic  scene.  Suddenly one of them turns at Erik. It is Helga, whom Erik accidentally killed in Scene One. She is once again kneading dough. She has a red stain under her breast.\nHELGA\nOh good! It's Mr Wonderful!\nErik leaps to her side.\nERIK\nI've come to take you back to the land of the living.\nHELGA\nWhat a stupid idea.\nERIK\n(mortally hurt)\nWhy?\nHELGA\nWhat's the point of being dead in the land of the living?\nERIK\nI'll ask the Gods to give you life again!\nHelga looks at Erik very  sceptically.  She obviously thinks he doesn't know what he's talking about. Aud reacts. Erik takes Helga's hand - and gets covered in dough.\nHELGA\nHave you tried to ask the God for anything?\nERIK\nWell... no...\nHARALD MISSIONARY\nWho is he talking to?\nAUD\nSh!\nHELGA\nOdin!\nOne of the children, throwing pennies against the wall, looks round.\nCHILD ODIN\nI'm busy.\nThe Vikings are recovering from their surprise.\nVIKINGS\nOdin?\nHELGA\n(getting back to her kneating)\nHe's busy.\nERIK\nIs THAT Odin?\nHELGA\nYou'll have to wait till he's finished his game.\nERIK\n(shouting across)\nOdin!\nOdin leaves his game and saunters towards Erik.\nERIK\nWe have come from the world of Midgard...\nThe child whom Odin is  playing  with  points  his hammer at the ground near Erik and a lightning bolt zaps into it. Erik jumps.\nCHILD-THOR\nClear off.\nODIN\nNo, wait, Thor.\nERIK\nYou must help us.\nODIN\nWe don't HAVE to help anybody.\nERIK\nFenrir the Wolf covers the sun  - men fight and kill each other\nthe whole time.\nODIN\nWhy should WE care?\nERIK\nBecause... you're... you're the Gods....\nODIN\nSo?\nERIK\nBring the Age of Ragnarok to  an end and stop all this fighting and bloodshed.  Harald looks around at the Vikings in increasing desperation.\nHARALD\nThis is ridiculous.\nVIKINGS\nSh!\nHARALD\nRight!\nThe other Child-Gods have stopped playing  around now and are watching Erik and Odin.\nODIN\nErik the Viking! The things you seek  are not in our power. We don't make men love each other or hate each other.\nERIK\nBut you're the Gods!\nODIN\nLook... Erik...\nOdin whistles. The other children  look  over their shoulders. From out of the darkness of the perimeter of the Hall, shadows emerge... shadows that, as they shuffle and stumble  into the light, reveal themselves to be the heroes that the Vikings  had  expected  to find in Valhalla. But they are not hale and  hearty  giants  quaffing mead and reliving their great battles... they are, in fact,  a sorry lot... the slain-in-battle still bearing the hideous deformities of  their fatal wounds. Most have a sword or an axe buried in  some  part  of their anatomy. One has been cleft in twain... The Vikings react to this  grisly  gathering  as  more and more of them emerge from  the  shadows.  They  gasp  as  they  notice  Snorri, Ivar, Thorfinn, Loki and Leif the Lucky.\nERIK\nSnorri! Ivar!\nHARALD\nHere we are standing  on  a  bare  mountain top talking to thin air.\nWe notice that Harald's cloak is being blown about as if he were indeed on a bare mountain top.  The  other's  cloaks  are still. Sven's dad is gazing across at one horribly mutilated specimen.\nSVEN'S DAD\nDad!\nKEITEL\n(disbelievingly)\nHow can you tell?\nSVEN'S DAD\nI'll never forget him! The BASTARD!\nSven reacts. Sven's dad starts to go berserk.\nSVEN'S DAD\nHe drove me mad!\nSVEN\nEasy, Dad!\nSVEN'S DAD\nAll his \"you'll never be a Berserk if you lose your temper\"...\nSVEN\nDad!\nSVEN'S DAD\nI hate you! I hate you!\nSven's  dad   collapses   against   Sven   and   Sven   comforts   him, understandingly. A figure  emerges  from  the  throng  of  dead.  It is Thorfinn. Sven looks up at him.\nTHORFINN\nYou won, Sven.\nLOKI\nWhat right have YOU  to  try  and  stop  men fighting, Erik the Viking? There is glory in battle.  There  are riches to be made and won...\nKEITEL\nMade by YOU, Loki!\nLOKI\nBy YOU - Keitel Blacksmith!  Don't  you know, Erik, that is why he went with you? Ragnarok was good for his business...\nKEITEL\nIt's not my business any more!\nSuddenly there is a howl... a bitter  howl that echoes above and around the Halls of Asgaard  and  that  gets  more  distant  and more distant. Everyone (including the dead heroes and the Gods) freezes and looks up, listening. Perhaps we cut away to the boiling sky as it resolves itself into the shape of a wolf  that  snarls  and  slinks away. Odin turns to Erik as the howling recedes.\nODIN\nFenrir the Wolf has  gone,  Erik.  But  will men cease fighting each other? THAT is not in our power...\nOdin starts to laugh. All the  other  children  start to laugh... so do the dead heroes. Erik and his men look round uneasily.\nERIK\nI have one more request before we return...\nErik turns towards Helga, who is still  standing at her trough of dough with her arms up to her elbows  in flour. Aud watches Erik with sadness in her heart.\nODIN\nReturn? You have set your  foot  in the Halls of Asgaard, Erik.\nYou cannot return.\nAud looks round to see how the  others  react. It is as she had feared. Erik pales. The  blood  drains  from  the  other's  faces. Aud whispers something to Harald. Harald looks at her blankly.\nAUD\n(whispering)\nPLEASE!\nHARALD\nBut you're all imagining this... whatever it is.\nAUD\n(earnestly)\nYou're the only one who can. PLEASE.\nHarald look around  at  the  dumbfounded  Vikings.  Then  he shrugs and wanders off, disappearing through the closed doors of Valhalla.\nERIK\nYou mean... we must stay here forever?\nAs he says this Erik's  eyes  turn  again  towards Helga. He is clearly thinking at least there are compensations... Odin, however, is laughing again.\nODIN\nStay HERE? Ha ha! This is  Valhalla. This is reserved for those slain-in-battle.\nHORRIBLY SLAIN WARRIOR\n(grinning cheerfully)\nYeah! We're the LUCKY ones!\nA HORRIBLY SLAIN FRIEND OF HIS \nYeah. It's much better than dying of old age.\nThe ghastly and dismembered dead  warriors  all  chortle  no end at the dismay written on the face of Erik and  his men. At the same time there is a grinding, winching sound.  All  those around the hearth-place fall back as a vast  grating  is  winched  up  from  out  of the flames. The Vikings look at each other.\nODIN\nFor YOU there is only the Pit of Hel!\nAs Odin says this there is a roaring sound and the flames and smoke are suddenly reversed and as the  roaring  increases  the flames are sucked down altogether to reveal the black Pit  of Hel itself. And now the Pit is sucking the Vikings  into  it...  their  hair  blows...  they try to withstand the force that is drawing  them towards the abyss... The Gods look on in some amusement. But some of the dead are concerned.\nSVEN'S GRANDFATHER\nSon! My son!\nSVEN'S DAD\nGet lost!\nSVEN\nDad! Grandfather!\nSven tries to reconcile his father and grandfather, but it's no use. He is sucked towards the Pit.\nVIKINGS\nHelp!\nERIK\n(to Helga)\nI tried to save you!\nHELGA\nWhy should you care?\nERIK\nI don't know! I just did!\nErik can no longer withstand the force  that is sucking him down to the Pit of Hel. Suddenly, however, Snorri  has  leapt from the ranks of the dead. He grabs Erik and tries  to  stop  him sliding towards the Pit of Hel. But it's no good.\nERIK\nNo! Let go, Snorri!\nSNORRI\nI've got you!\nERIK\nYou'll be sucked down too!\nSNORRI\nNo! Arrgh!\nMeanwhile, Ivar and Thorfinn and Leif the Lucky have also leapt forward to  save  their  comrades.  They  put   up  a  fantastic  struggle  but remorselessly they are all sucked down.\nVIKINGS\nAagh!\nThe Vikings clutch at the  stone  floor,  their  fingers trace blood as they try to cling on... but to no avail. The first are already toppling into the Pit.\nVIKINGS\nNoooh!\nVIKINGS\nAh!\nAnd the rest - including Aud - soon follow. The mouth of the Pit of Hel, through which the Vikings are now tumbling higgledy-piggledy, is  a  round  white  disc  set  in  the  unutterable blackness of the pit. However, as  the Vikings free-fall slowly towards camera, they are lit up by a  faint,  reddish glow from below. They are staring, wild-eyed and  screaming  as  they  fall.  As  they fall, Erik manages to smash his axe into the  side  of the Pit. Thorfinn grabs his leg and holds onto Sven's  foot.  Leif  clutches at Sven's belt. Sven's dad hangs  onto  Sven's  foot.  Ivar  clutches  Thorfinn's  foot.  Erik clutches Ivar's leg and Aud clutches  Erik's. They dangle like this for some seconds, and look fearfully  beneath  them.  Then they can see the Infernal Regions of flame  and  molten  lava...  somehow suggesting the face of a huge and sinister  creature.  No wonder they're scared out of their wits. Meanwhile, Odin and Thor appear at  the  top  of  the Pit and look down with mild amusement. Thor casually  points  his  hammer and a streak of lightning zaps Erik's axe. It  instantly  glows  red hot. Erik screams. Suddenly we hear a new sound - a long, high, sweet note.\nAUD\nListen! LISTEN! The third note!\nBut it's no good. Erik  has  to  let  go  of  the red-hot axe. Everyone screams as they start to plunge down towards the Pit of Hel. Cut to GOLDEN DRAGON. Harald Missionary is blowing the Horn Resounding.\nHARALD MISSIONARY\n(to himself)\nI want to go home... Oooh!\nSuddenly GOLDEN DRAGON, the Horn Resounding and Harald Missionary shoot up into the air and disappear from sight. Cut back to the Pit of Hel.  The  Vikings are looking down as they fall - they are still  scared  but  gradually  start laughing... laughing as they fall down and down and down until they fall out of sight. We are left with a blackness and  just  the  white disc of the mouth of the Pit of Hel above, until  the  disc changes magically into the moon. There is a series of splashes. The note begins to fade and the  camera  slowly pans down to reveal the Vikings all fallen into the  duck  pond  back  at Ravensfjord. They are laughing and whooping and splashing each other.\nERIK\nI don't believe it... Ha ha ha! It brought us HOME!\nLEIF\nBut who BLEW it?\nIVAR\nOh! Who cares? We're HOME!\nTHORFINN\nMum! Dad!\nSVEN\nWe're back!\nSven embraces his father and dances him around with joy.\nALL\nYo hoo! We're here! We're...\nSuddenly the joy drains from their faces  and they each gape in horror. What is it they see? We cut to see that out of the  huts  the women and children and old men are emerging - but they are  anything  but  happy. In fact they are all bound and gagged. Behind them  emerge  the  sinister figures of Halfdan the Black, Gisli and maybe  half  a  dozen  armed  men. Halfdan and his cronies no longer look  sleek  and  self-assured.  They are haggard and desperate. Their faces are  streaked  with  dirt  and  sweat, and their clothes are torn and soiled.  They  have  clearly  been going through a lean time, since Ragnarok ended, and  have descended on the village for revenge and for  whatever  plunder  they  can  find.  They  have  a few sackfuls of booty with them. They herd  the women, children and old men into a pathetic  huddle  in  the  middle  of  the  village.  Halfdan is spitting evil and hatred.\nHALFDAN\nThrow down your weapons - or we shoot the children first.\nErik hesitates... The  others  look  at  him.  What  choice  have they? Reluctantly, Erik throws his weapons  into  the pond. The others follow suit. Halfdan watches. His men stand  around  him in a tight group with their backs to each other.\nHALFDAN\nGood...  Good...  Right,  now  we'll  just  shoot  the children anyway...\nErik is paralysed. What  can  they  do?  Half  Halfdan's men are aiming their crossbows at Erik and his  comrades,  and  half are aiming at the women and children. They raise  the  crossbows  to shoot. Their fingers tighten on the triggers. Suddenly there is a scream from above.\nHARALD\nLook out below!\nEveryone looks up and, amazingly,  out  of  the sky falls GOLDEN DRAGON and lands fair and square  on  top  of  Halfdan and his gang, squashing them flat. Harald Missionary staggers blearily from the wreckage.\nGRIMHILD HOUSEWIFE\nHarald!\nShe rushes to Harald, while  the  Vikings  rush  to release their loved ones. Great celebrations all round.\nIVAR\nLook!\nThey all turn and see  the  sun  rising.  The villagers gasp in wonder. They've never seen the sun before.  Erik looks around and sees Thorfinn and Sven with their arms round each  other. Aud looks up as Erik smiles at he and holds  her  to  him.  Then  they  all  turn  and  gaze at the spectacle of the sun returning to the world.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nErik the Viking\nWriters :   Terry Jones\nGenres :   Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:24:46.752303"}