{"title": "Escape From New York", "film_link": "/Movie Scripts/Escape From New York Script.html", "script_link": "/scripts/Escape-From-New-York.html", "info_raw": "\n\nEscape From New York Script\n\n\n\n\nIMSDb opinion  Snake Plissken is a badass ^_^\nIMSDb rating   (7 out of 10)\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Carpenter  Nick Castle\nGenres  Action  Adventure  Sci-Fi  Thriller\nScript Date :  1981\n\nRead \"Escape From New York\" Script\n\n\n", "script": "\nJohn Carpenter's Escape From New York\nwritten by John Carpenter and Nick Castle\ntranscript by Anjela F. Conner\n------------------------------------------------------------------------\nFADE IN\n\nCARD -- 1988\nFADE IN SECOND CARD -- The Crime Rate in the United States Rises Four\nHundred Percent.\n\nVOICE\nIn 1988, the crime rate in the United States rises four hundred percent.\n\nGRAPHIC -- Line-graphic of New York, MANHATTAN ISLAND highlighted.\n\nVOICE\nThe once-great city of New York becomes the one maximum-security prison\nfor the entire country.\n\nGRAPHIC -- MANHATTAN ISLAND lights up.  The word \"Prison\" is added.\n\nVOICE\nA fifty-foot containment wall is erected along the New Jersey shoreline,\nacross the Harlem river, and down along the Brooklyn shoreline.  It\ncompletely surrounds Manhattan Island.\n\nGRAPHIC -- The containment wall is added to the line graphic with the\ntag \"Containment Wall\".\n\nVOICE\nAll bridges and waterways are mined.\n\nGRAPHIC -- Dots symbolizing the bridges and waterways blink on and off.\n\nVOICE\nThe United States Police Force, like an army, is encamped around the\nisland.\n\nGRAPHIC -- Arrows symbolizing the police force are added.  TAG -- Statue\nof Liberty Island Security Control.\n\nVOICE\nThere are no guards inside the prison: only prisoners and the worlds\nthey have made.\n\nNEW GRAPHIC -- Outline drawing of New York.\n\nVOICE\nThe rules are simple.  Once you go in, you don't come out.\n\nGRAPHIC -- Outline drawing of the Statue of Liberty and the shoreline\nare added.\n\nCARD -- 1997\nFADE IN SECOND CARD -- NOW\nFADE OUT 1997\n\nEXT. STATUE OF LIBERTY SECURITY CONTROL -- NIGHT.\nA Jeep pulls up outside the base.  It comes to a stop and the driver\npulls out a walkie-talkie.\n\nDRIVER\nThis is Gotham 4, North Bay, Station 17.  I have an escape in progress.\nAn object in mid-bay moving toward the wall.\n\nTILT UP -- WALL\nEXT. CLOSE UP -- SIGN \"New York Maximum Security Penitentiary Manhattan\nIsland\"\n\nCONTINUED TILT UP -- EXT. WALL -- NIGHT\nTwo guards watch for the escapees in question.\n\nEXT. MANHATTAN ISLAND -- NIGHT\nA helicopter flies over the bay towards Manhattan Island.\n\nEXT. BOAT -- NIGHT\nThe two escapees paddle, trying to get across the bay.\n\nEXT. HELICOPTER -- NIGHT\nThe search light WHITES OUT THE SCREEN\n\nEXT. BOAT -- NIGHT\nThe two escapees continue paddling.  THEY'VE BEEN CAUGHT.\n\nHELICOPTER PILOT\nYou have 10 seconds.  Turn around.  Start back to the island.\n\nINT. HELICOPTER -- NIGHT\nThe pilot targets the boat on a computer screen in front of him.\n\nEXT. BOAT -- NIGHT\nTwo shots are fired directly in front of the escapees as a warning.\nThey ignore them and continue paddling away from the island.\n\nINT. HELICOPTER -- NIGHT\nEXT. CLOSE UP -- PILOT'S HAND\nThe pilot FIRES AGAIN.\n\nEXT. BOAT -- NIGHT\nThe boat EXPLODES.\n\nEXT. HELICOPTER -- NIGHT\nFollowing the helicopter as it returns to the base.\n\nEXT. BASE -- NIGHT\nRehme walks back to the main base, pulling out his walkie-talkie on the\nway.\n\nREHME\nGotham 4, confirm the kill.\n\nHELICOPTER PILOT\nCircled the base.  Over.\n\nREHME\nSecurity, this is Rehme.  We have confirmation from Gotham 4.  We have a\nkill in midharbor.  South of the battery.  Two in the water dead.\n\nSECURITY\nTwo confirmed.\n\nREHME\nVery well.\n\nEXT. BASE -- NIGHT\nRehme walks into a building labeled \"LIBERTY ISLAND SECURITY CONTROL and\npicks up a phone.\n\nREHME\nAir traffic, this is Rehme . . .\n\nEXT. AIR TRAFFIC -- NIGHT\nThe helicopter lands.  In the background, a BUS FULL OF PRISONERS comes\nup.\n\nEXT. BUS -- NIGHT\nS.D. \"SNAKE\" PLISSKEN gets off the bus, looks around, and is escorted by\nthree guards into the base.  He looks like the essence of cool.  His\nhair is long, wavy, and ratty, he lost his left eye somewhere along the\nline, and he's got a two-day beard thing going on.  He's wearing a black\nspandex/kevlar type shirt with zippers across the shoulders, and a pair\nof camouflage pants with lots of pockets.  His jacket is a brown leather\njacket that has seen far better days, and he's wearing a pair of\nhandcuffs that have, instead of the links we're used to, a straight\nmetal bar between them.  He's not resisting anything, but the police are\nnot taking any chances.\n\nINT. BASE -- NIGHT\nPlissken and the guards follow a winding stairway down to the main\nfloor.\n\nVOICE\nAttention.  You are now entering the debarkation area.  No talking.  No\nsmoking.   The next scheduled departure to the prison is in two hours.\nYou now have the option to terminate and be cremated on the premises.\nIf you elect this option, notify the duty sergeant in your processing\narea.\n\nINT. BASE -- NIGHT\nEXT. CLOSE UP ON SIGN -- \"No talking.  No smoking.  Follow the ORANGE\nline.\"\nEXT. CLOSE UP ON SNAKE.  He is not impressed.\nSTEADICAM VIEW OF THE HALL, SNAKE'S P.O.V. Guards, guards, more guards.\nWho cares.\n\nAs Snake rounds the corner:\n\nO.S. GUARD\nHold it.\n\nSnake stops, turns, directs an impertinent glance at the speaker.  He's\nstill not impressed by any of this.\n\nFADE OUT.\n------------------------------------------------------------------------\nFADE IN.\nEXT. BASE -- NIGHT\nRehme waits as a limo pulls up.  Out steps BOB HAUK.\n\nREHME\nWe've got a small jet in trouble, over restricted air space.\n\nHAUK\nWhere is it?\n\nREHME\nSeven miles out and closing.\n\nThe two of them walk AWAY.\n\nINT. BASE -- NIGHT\nHauk and Rehme walk down the stairs.  They turn TOWARD US and walk into\nthe AIR TRAFFIC ROOM.  Dozens of men sit in front of radar transmission\nscreens, wearing headsets and working.   Following Hauk and Rehme into\nthe room:\n\nINT. AIR TRAFFIC ROOM -- NIGHT\n\nREHME\nWe've been on the board for the last twenty minutes.  We haven't been\nable to reach them.  There was a transmission ten minutes ago.  He\nidentified as \"David 14.\"  Then all of a sudden he was cut off.\n\nHauk and Rehme stand behind a CONTROLLER.\n\nCONTROLLER\nDavid 14, acknowledge.  David 14, we are sending Air Rescue.  Squawk\n7700, contact on 121.5.\n(to Hauk and Rehme)\nThere's still no reply.\n(to his headset)\nBayonne.  I have a mayday in restricted space.\n\nO.S. CONTROLLER\nNew York, I have it.\n\nHauk pulls Rehme aside.\n\nHAUK\nWho is it?\n\nREHME\nI don't know.\n\nHAUK\nYou have the code?\n\nREHME\nThere's no David 14 on the computer.\n\nHAUK\nUnlisted?\n\nREHME\nUnregistered code.  We telexed Washington.  Still waiting for a reply.\n\nCONTROLLER\nI think I've got him, sir.\n\nHauk and Rehme walk back over to the controller.  He patches a voice-\nover through.\n\nREBEL VOICE\nIt's too late, assholes.  All your imperialist weapons and lies can't\nsave him now.  We're going down.  We're going to crash.\n\nCONTROLLER\nDavid 14, acknowledge!\n\nCODEMAN\nThe code's coming in, sir.\n\nHauk and Rehme dash over to the codeman.  He shows them a display.\n\"Aircraft Identified.  Code: David14.  Decode: AIR FORCE ONE.\"\n\n\"Air Force One\" blinks as Hauk and Rehme look at each other in shock.\n\nEXT. PLANE -- NIGHT\nThe plane is flying over New York.\n\nINT. COCKPIT -- NIGHT\nThe REBEL has killed the pilot and copilot and is working on her own.\n\nREBEL\nTell this to the workers when they ask where your leader went . . .\n\nShe pulls out a slip of PAPER and proceeds to read.\n\nREBEL\nWe, the soldiers of the national liberation front of America, in the\nname of the workers and all the oppressed of this imperialist country\nhave struck a fatal blow to the racist police stick!\n\nINT. PLANE -- NIGHT\nA secret service AGENT taps on the door with his rifle as the rebel\ncontinues.\n\nREBEL\nWhat better revolutionary example than to let the president perish in\nthe inhuman dungeon of his own imperialist prison?\n\nThe agent runs back down the plane to the President and his advisers.\n\nAGENT\n(to 2ND AGENT)\nUnlock the pod!\n\n2ND AGENT immediately runs off.\n\nPAN LEFT TO PRESIDENT.\n\nAGENT\nShe's bolted the door.\n\nPRESIDENT\nCan't you shoot off the lock?\n\nAGENT\nNo, sir, she's pressurized the cabin.\n\nPRESIDENT\nHow about lifting the door off of the hinges?\n\nAGENT\nNo, sir.\n\nEXT. CLOSE UP -- The President's wrist as he handcuffs his briefcase to\nit.\n\nPRESIDENT\nGet me to the pod.\n\nThe President and all his advisors stand up and move to the back of the\nplane.\n\nINT. POD ROOM -- NIGHT\nThe pod opens.  An expert attaches a locating device to the President's\nwrist.\n\nEXPERT\nSir, this is a locating device to trace you if you become separated from\nthe pod.  I'm activating it now.\n\nSCREENS on the pod begin to light up as the President gets into the pod.\nHe pushes a few buttons.\n\nPRESIDENT\nGod save me and watch over you all.\n\nEXT. BASE -- NIGHT\nA guard watches as Air Force One descends into New York.\n\nINT. BASE -- NIGHT\nRehme and Hauk watch a computer simulation of the plane.\n\nVOICE\nComputer simulation tracking Air Force One.\n\nEXT. NEW YORK -- NIGHT\nThe plane goes down.\n\nINT. BASE -- NIGHT\nEXT. CLOSE UP -- MONITORS\nAs the plane smashes into a building, a red dot drops through the\nbuilding.  It's the pod.\n\nO.S. MAN\nIt's down!\n\nHAUK\nIt's the escape pod.\n\nREHME\n40 degrees, 50 yards from impact.\n\nHAUK\nI'm going in.\n\nEXT. BASE -- NIGHT\nHelicopters prepare for, and execute, launch, and fly into New York.  A\nguard watches them.\n\nINT. BASE -- NIGHT\nRehme watches monitors as Hauk talks.\n\nHAUK\n1-W-Larry.  Over the battery.  We're moving down.  Direct sight ahead.\n\nEXT. NEW YORK -- NIGHT\nThe helicopters land.  A swarm of policemen run out, and Hauk hangs\nback.  He follows with a second swarm.  The first swarm assumes a\ndefensive position near the pod.  Hauk examines the pod.  It's\ndefinitely empty, and the rest of the jet is surrounded in flames.\n\nAn odd LAUGH from nowhere.\n\nWEIRDO walks out of the darkness.  He nods his head to Hauk.\n\nWEIRDO\nYou touch me... he dies.  If you're not in the air in thirty seconds...\nhe dies.  You come back in... he dies.\n\nWeirdo takes a package out of his shirt and unwraps it to reveal the\nPresident's middle finger, complete with ring.\n\nWEIRDO\nTwenty seconds.\n\nHAUK\nI'm ready to talk.\n\nWEIRDO\nNineteen.  Eighteen.\n\nHAUK\nWhat do you want?\n\nWEIRDO\nSeventeen.  Sixteen.\n\nHAUK\nLet's go.  Let's go!\n\nWeirdo grins in triumph as the police force swarms back to the\nhelicopters and hauls ass out of New York.\n\nINT. BASE -- NIGHT\nRehme stands behind a desk, talking on the phone.  Hauk is in the\nforeground, looking pensive.\n\nREHME\nYes, he's right here, Mr. Vice President.\n\nHauk picks up a phone.\n\nHAUK\nThis is Bob Hauk.  ...We can't.  If we move in with choppers, they'll\nkill him.  We're lucky if he's not dead already... They don't want\nanything yet.  By the time they figure out what they want, it'll be too\nlate.\n\nREHME\nTell him we have to go with your plan now.\n\nHauk waves him off.\n\nHAUK\nWe can't wait until tomorrow.  If we have to move in and take the\nisland, it's a last resort.  It's 8:45.  I want permission to try a\nrescue.  Thank you.\n\nINT. HAUK'S OFFICE -- NIGHT\nHauk calmly arms a .45 pistol.  He looks up from his desk.\n\nHAUK\nAll right.\n\nOVERPROTECTIVE SECURITY GUARD\nHe's dangerous, sir.\n\nHAUK\n(with quiet confidence)\nI know.  I'll be OK.\n\nHAUK'S P.O.V.\nWe see the silhouette of an unmistakable figure.  It's Snake Plissken\nall right, live and in the flesh.  The guards leave.  Snake walks into\nHauk's office and sits down in the chair across from Hauk.  He raises\nhis cuffed hands to Hauk as if to say \"Take these off me, asshole,\" but\nhe doesn't actually say anything.  Hauk shakes his head.\n\nHAUK\nI'm not a fool, Plissken.\n\nSNAKE\n(coooooool)\nCall me Snake.\n\nHauk puts on his glasses and proceeds to read a file.\n\nHAUK\nS.D. Plissken.  American Lieutenant.  Special Forces Unit, Black Flight.\nTwo Purple Hearts, Leningrad and Siberia.  Youngest man to be decorated\nby the President.  You robbed the federal reserve depository.  Life\nsentence, New York Maximum Security Penitentiary. I'm ready to kick your\nass out of the world, War Hero.\n\nSnake could not care less.  He reaches forward with his still-cuffed\nright hand, picks up a cigarette, picks up a match with his left hand,\nstrikes the match and takes a drag from his cigarette.  He lets out a\ncalm breath and says:\n\nSNAKE\nWho are you?\n\nHAUK\nHauk.  Police Commissioner.\n\nSNAKE\nBob Hauk...\n\nHAUK\nSpecial Forces Unit.  Texas Thunder.  We heard of you, too, Plissken.\n\nSNAKE\nWhy are we talking?\n\nHAUK\nI have a deal for you.  You'll receive full pardon for every criminal\nact committed in the United States.\n\nHauk shows Snake the pardon.  Snake's eye lights up.  This is something\nhe wants.  He's interested now, and can't hide it.\n\nHAUK\n(pressing his advantage)\nThere was an accident about an hour ago.  A small jet went down inside\nNew York City.  The President was on board.\n\nSNAKE\n(re-establishing control over the conversation)\nPresident of what?\n\nHAUK\nThat's not funny, Plissken.  (beat)  You go in, find the President and\nbring him out in 24 hours, and you're a free man.\n\nWe sense amusement from Snake.  This is not the first time the\ngovernment has asked him for a favor.  But he's not a soldier or a \"War\nHero\" anymore.  He knows they need him more than he needs their pardon.\nHe's holding the cards now, and he knows it.\n\nSNAKE\nTwenty-four hours, huh?\n\nHAUK\nI'm making you an offer.\n\nSNAKE\nBullshit.\n\nHAUK\nStraight just like I said.\n\nSNAKE\nI'll think about it.\n\nHAUK\nNo time.  Give me an answer.\n\nSnake turns away.  Hauk is pushing way too hard, and Snake is determined\nto be in the driver's seat.\n\nSNAKE\nGet a new president.\n\nHAUK\nWe're still at war, Plissken.  We need him alive.\n\nSNAKE\nI don't give a fuck about your war... or your president.\n\nHAUK\nIs that your answer?\n\nSNAKE\nI'm thinking about it.\n\nHAUK\nThink hard.\n\nSnake pauses to take a draw on his cigarette.  Next question:\n\nSNAKE\nWhy me?\n\nHAUK\nYou flew the Gullfire over Leningrad.  You know how to get in quiet.\nYou're all I've got.\n\nSNAKE\nI guess I go in one way or the other.  Doesn't mean shit to me.  Give me\nthe paper.\n\nHAUK\nWhen you come out.\n\nSNAKE\nBefore.\n\nHAUK\nI told you I wasn't a fool, Plissken.\n\nSNAKE\nCall me Snake.\n\nINT. WEAPONS ROOM -- NIGHT\nRehme talks as we PAN ACROSS a table full of weapons.  We see two guns,\na belt, grenades, several pouches full of various stuff, a flashlight, a\nUzi, throwing stars, and more.  Snake surveys them with a cool\nexpression.\n\nREHME\nSome of them have cars.  They took old junkers that were left behind and\nconverted them to steam.  We think they may also have a gasoline source\nin there, and power.  Greenhouses, rigged up generators.  Some areas\nhave streetlights. The crazies.  Live in the subways.  Complete control\nof the underground.  They're night raiders.\n\nSnake's not into this.  He'll figure it out when he gets there.  He\npicks up a bracelet with an eagle on it.\n\nHAUK\nTracer.  Sends a radio signal for fifteen minutes.  You push it, we can\ntrack you on radar.  Just like Leningrad.  But they added something.  A\nsafety catch.\n\nSnake pushes the safety catch.  Simple enough.  And yes, there's the\nbutton.  This is familiar.  He smiles.\n\nINT. HALL -- NIGHT\nSnake has his jacket slung over his shoulder now.  He walks down the\nhall to the medical room with Hauk.  Rehme has disappeared.\n\nSNAKE\nWhere am I landing?\n\nHAUK\nTop of the world trade center.  Only place you can land.  They won't see\nit, and you can take off from a free fall.  On the roof there's a\nservice elevator.  It's still operational.  We use it to infiltrate the\nprison.  There's a power box.  It'll activate the elevator down to\nfifty.  From there on down\nyou walk.\n\nSnake shrugs on his jacket.  He knows Hauk is just trying to assert his\nauthority, and it's not working very well.\n\nHAUK\nYou can locate the President by his vital signs bracelet, on his wrist.\nIt sends out a sig pulse.  Use this.\n\nHe hands Snake a homing device.\n\nHAUK\nHoming device.  Shows directions and distance.\n\nINT. MEDICAL ROOM -- NIGHT\nSnake and Hauk walk into the room.  They're met by a young medic.\n\nHAUK\nStrong antitoxin.  Stops bacteria and viral-proofs you for 24 hours.\n\nSnake braces himself against a table.  The medic is holding an\ninjection-type tech gizmo.\n\nMEDIC\nTake off the jacket.\n\nSNAKE\nI'll be OK.\n\nHAUK\nLet's go, Plissken.\n\nSnake shrugs off his jacket, disoriented by the place.  He's nervous.\nHis hackles are up.\n\nSNAKE\nI don't like needles.\n\nHauk straps a timer gauge onto Snake's left hand.  He activates it and\nthe time blinks on.  It's counting down as we speak.\n\nHAUK\nTwenty-two hours, twenty-nine minutes, fifty-seven seconds...\n\nSNAKE\nWe talked about twenty-four.\n\nHAUK\nIn twenty-two hours the Hartford Summit meeting will be over.  China and\nthe Soviet Union will go back home.  The president was on his way to the\nsummit when his plane went down.\n\nSnake snorts.\n\nHAUK\nHe has a briefcase attached to his wrist.  The tape recording inside has\nto reach Hartford in 22 hours.\n\nSNAKE\nWhat's on it?\n\nHAUK\nYou know anything about nuclear fusion?\n\nSnake turns away.  No.  Nuclear fusion is not his area of expertise.\n\nHAUK\nIt's about the survival of the human race, Plissken.  Something you\ndon't give a shit about.\n\nHauk steps aside.  The medic swabs Snake's neck on both sides.\n\nMEDIC\nI'm going to inject you.  It'll sting for a second or two...\n\nHe raises a couple of hypos and injects Snake with them.  Snake jumps a\nlittle; clearly, this is not one of the world's most pleasant things.\n\nHAUK\nThat's it, Plissken.\n\nSnake gets off the table.  The medic turns around.\n\nMEDIC\nTell him.\n\nSNAKE\nTell me what?\n\nHauk thinks he's got him this time.  Snake doesn't like that.\n\nHAUK\nThat idea you had about turning the Gullfire around 180 degrees and\nflying off to Canada.\n\nHauk shakes his head.  Snake puts his jacket down and turns to the\nmedic.\n\nSNAKE\nWhat did you do to me, asshole?\n\nHAUK\nMy idea, Plissken.  Something we've been fooling around with.  Two\nmicroscopic capsules lodged in your arteries.  They're already starting\nto dissolve.  In twenty-two hours, the cores will completely dissolve.\nInside the cores are that heat-sensitive charge.  Not a large explosive.\nAbout the size of a pinhead.  Just big enough to --\n(he gestures)\nopen up both your arteries.  I'd say you'd be dead in ten or fifteen\nseconds --\n\nHauk stops talking because Snake has grabbed him by the throat.\n\nSNAKE\nTAKE THEM OUT NOW.\n\nMEDIC\nThey're protected by the cores.  Fifteen minutes before the last hour is\nup we can neutralize the charge with X-rays.\n\nSnake lets go of Hauk to look at his watch.  22:57:38.  37.  36.  This\nis his life he's watching tick away.\n\nHAUK\nWe'll burn out the charges IF you have the President.\n\nSNAKE\nWhat if I'm a little late?\n\nHAUK\nNo more Hartford Summit.  And no more Snake Plissken.\n\nSNAKE\nWhen I get back I'm going to kill you.\n\nHAUK\nThe Gullfire's waiting.\n\nEXT. RUNWAY -- NIGHT\nSnake pulls up in a Jeep.  He walks up to the tiny plane called the\nGullfire.  Two guards stand by to make sure he just gets in the plane\nand does his job.  He throws his cigarette out onto the runway and\ncloses the overhead window.\n\nINT. GULLFIRE -- NIGHT\nSnake turns on his monitors.\n\nSNAKE\nI'm ready.\n\nHAUK\n21 hours.\n\nSNAKE\nSuppose he's dead, Hauk.  If I come back without him, you'll burn these\nthings out?\n\nINT. BASE --- NIGHT\nHauk and Rehme exchange a glance; Hauk's been expecting this question to\ncome up.\n\nHAUK\nGet them both back, Plissken.\n\nINT. GULLFIRE -- NIGHT\nSnake doesn't like the response, but figures he can't do anything about\nit.\n\nHAUK\nRemember, once inside you're on your own.\n\nSNAKE\nOh, you mean I can't count on you?\n\nHAUK\nNo.\n\nSNAKE\nGood.\n\nEXT. RUNWAY -- NIGHT\nA larger plane hauls the Gullfire into the air; the Gullfire is\nessentially a big hang glider.\n\nINT. BASE -- NIGHT\nHauk checks Snake's life clock, \"Master Life Clock\".\n20:17:43... 42... 41....\n\nINT. GULLFIRE -- NIGHT\nSnake's watch reads 20:17:40... 39... 38... 37... 36... 35...\nHe starts controlling the plane.  He flips the tracer open and hits the\nbutton, testing it.\n\nINT. BASE -- NIGHT\nThe master life clock shows the test confirmation.\n\nCOMPUTER\nTracer test confirmed at 20 hours, 17 minutes, 30 seconds.\n\nHauk, Rehme and the Vice President nod with relief.\n\nEXT. NEW YORK -- NIGHT\nSnake takes the plane in.\n\nINT. GULLFIRE -- NIGHT\nSnake looks over his monitors.  He sees New York coming up.\n\nINT. BASE -- NIGHT\nHauk waits at his microphone.\n\nHAUK\nAre you picking up the target blip?\n\nINT. GULLFIRE -- NIGHT\n\nSNAKE\nRight on course.\n\nEXT. NEW YORK -- NIGHT\nThe plane aims for the World Trade Center.\n\nINT. GULLFIRE -- NIGHT\n\nSNAKE\nIt's been a while . . .\n\nThe plane is aiming right at a building.\n\nHAUK\nHow's your altitude?\n\nSnake calmly angles the plane up.\n\nINT. BASE -- NIGHT\n\nHAUK\nPlissken?  Plissken?  Plissken, what are you doing?\n\nINT. GULLFIRE -- NIGHT\n\nSNAKE\nPlaying with myself.  I'm going in.\n\nSnake targets the World Trade Center.  He checks his instruments.\n\nEXT. WORLD TRADE CENTER -- NIGHT\nThe plane comes down.  It hits hard.  Snake puts on the brakes, adds a\ngrappling hook, and finally comes to a stop right at the edge.\n\nINT. BASE -- NIGHT\n\nHAUK\nPlissken?  Plissken?\n\nEXT. WORLD TRADE CENTER -- NIGHT\nSnake walks over to the elevator.  He uses the power box to get the\nelevator started.  He looks around, and the doors open.  He gets in the\nelevator.  The doors close.\n\nINT. BASE -- NIGHT\nSnake's voice comes through the radio.\n\nSNAKE\nI'm inside the World Trade Center on the 50th floor.  Just like\nLeningrad, Hauk.\n\nHAUK\nIs the glider intact?\n\nINT. WORLD TRADE CENTER -- NIGHT\nSnake stands with his walkie-talkie in the middle of the graffiti-\ncovered building.\n\nSNAKE\nYeah, but taking off is for shit.  I'll work it out.\n\nHAUK\nYou'll have to use the east stairwell.  It'll take you a little while to\nget to ground level.\n\nSnake checks his life clock.  19:22:44. 43. 42.\n\nHAUK\nCall me when you get outside.\n\nSnake puts his walkie-talkie away as someone runs past.  He doesn't\nnotice.  He walks on.\n\nFADE OUT.\n------------------------------------------------------------------------\nFADE IN.\nEXT. NEW YORK -- NIGHT\nSnake walks along with his tracer.  He goes through alleys and streets.\nHe draws his gun as he walks by a group of people.  He's armed and ready\nto fight.\n\nEXT. PLANE CRASH -- NIGHT\nThe plane is still burning.  Smoke is coming from everywhere.  The plane\nis severed in the middle.  The crash is very impressive.  Snake walks\nand notices a few people go by.  He pulls out his walkie-talkie.\n\nSNAKE\nI'm at the plane.  Nobody else made it, Hauk.\n\nSomething beeps.  His tracer.\n\nSNAKE\nWait a minute.\n\nHe looks at his tracer.  A small red dot lights up in the southeast\ncorner.\n\nSNAKE\nI've got his pulse.  Right up ahead, moving northwest.\n\nHe puts away his walkie-talkie and checks his life clock.  18:50:18.\n17.  16.\n\nDISSOLVE TO:\nImages.  Snake holding the tracer.  He gets closer and comes up to a\nbuilding, formerly a theater.  He walks in.\n\nINT. THEATER -- NIGHT\nThe pulse keeps getting stronger.  Snake walks in.  He holds his gun at\nthe ready.  There's a truly horrible musical going on.\n\nINT. STAGE -- NIGHT\n\nACTORS\nThis is hell!  This is hate!  (etc.)\n\nSnake looks around.  No sign of the president, but there is a CABBIE\nenjoying the show.  Time to move on.  He enters against his better\njudgment, but he's just passing through, so that's OK.\n\nINT. STAIRWELL -- NIGHT\nSnake keeps moving, but there's a noise.  He turns around, aiming his\ngun.  Cabbie holds up his hands.\n\nCABBIE\nHey!  You're Snake Plissken, ain't you?\n\nSNAKE\nWhat do you want?\n\nCABBIE\nNothin'.\n\nSnake lowers his gun.\n\nCABBIE\nI thought you were dead!\n\nSnake moves on.\n\nCABBIE\nHey!  You don't want to walk around down there, Snake!\n\nINT. BASEMENT -- NIGHT\nThe signal from the tracer keeps getting closer and closer.  Snake walks\npast a gang beating up and stripping a semi-conscious girl.  He doesn't\ntake much notice.  He keeps going.  He sees a BUM sitting by a fire.\n\nBUM\nHi, Chief.  Nice night.  Nice boots.  Niiiiice boots.  Hey.\n\nA guy tries to sneak up behind Snake.  Snake knocks him out and points\nhis gun at the bum.\n\nBUM\nEasy now, chief.  I'm walking.  I'm walking.\n\nThe bum walks away.  Snake keeps going.  A man beats up another man at a\nsink.  The beatee is wearing the President's life tracer.  Snake kicks\nthe beater and knocks him out.\n\nSNAKE\nMr. President . . .\n\nThe man wearing the life tracer looks up and smiles.  He's a DRUNK.\n\nDRUNK\nI'm the President?  Sure, I'm the President.  If I knew where I got this\nthing --\n(indicates the tracer)\nI'd be the President.\n\nSNAKE\nWhere did you get it?\n\nDRUNK\nI woke up, and there it was, just like a miracle . . .\n\nSnake slams the tracer against the sink.\n\nINT. BASE -- NIGHT\nThe President's life signs all fail.\n\nOFFICIAL\nOh my god . . .\n\nMEDIC\nIt . . . It may be just an impact on the mechanism itself . . .\n\nINT. BASEMENT -- NIGHT\nSnake pulls up his walkie-talkie.\n\nSNAKE\nHauk?!\n\nINT. BASE -- NIGHT\n\nHAUK\nI'm right here, Plissken.\n\nSNAKE\nI don't know who you assholes are looking at, but it's NOT the\nPresident.\n\nINT. BASEMENT -- NIGHT\nSnake holds the walkie-talkie up to the drunk.\n\nDRUNK\n(to the tune of Joy to the World)\nHail to the chief . . . La la la la la la . . .\n\nSNAKE\nAll right, get your machine ready.  I'm coming out.\n\nINT. BASE -- NIGHT\n\nHAUK\n18 hours, Plissken.\n\nINT. BASEMENT -- NIGHT\n\nSNAKE\nListen to me, Hauk.  The President is DEAD, you got that?  Somebody's\nhad him for dinner!\n\nINT. BASE -- NIGHT\n\nHAUK\nPlissken, if you get back in that glider I'll shoot you down.  You climb\nout, I'll burn you off the wall.  You understand that, Plissken?\n\nINT. BASEMENT -- NIGHT\nSnake stares at his walkie-talkie.\n\nSNAKE\nA little human compassion . . .\n\nEXT. NEW YORK -- NIGHT\nSnake walks on.  He's in an area with streetlights.  He keeps going.\n\nEXT. POD -- NIGHT\nSnake stares at the pod.  No clues.  He looks around.  Nothing.  As he\ncomes back up, he sets up a chair and sits down heavily.  He touches his\nneck.  It's like he can feel the cores dissolving.\n\nA crazy walks past, bangs on manhole covers.  Snake doesn't know what\nhe's doing, but he doesn't like it.  Especially not when the manhole\ncovers start to rise up.  He runs off.\n\nEXT. CHOCK FULL OF NUTS -- NIGHT\nSnake finds the restaurant, and runs inside.  No one follows.\n\nINT. CHOCK FULL OF NUTS -- NIGHT\nSnake backs into a corner.  The floor is weak and starts to go out from\nunder him once.  He gets into the shadows.  There's someone there.\n\nGIRL IN CHOCK FULL O' NUTS\nYou a cop?\n\nSnake levels his gun at her.\n\nSNAKE\nNo . . .\n\nGIRL IN CHOCK FULL O' NUTS\nYou've got a gun.  You got a smoke?\n\nSnake tosses her his cigarettes.  She lights one.\n\nSNAKE\nKeep your hand over it.\n\nGIRL IN CHOCK FULL O' NUTS\nIt's all right if we're quiet.  They won't hear us.\n(reacting to the cigarette)\nHey, this is a real one.  You just get in?\n\nSNAKE\nWhat's going on out there?\n\nGIRL IN CHOCK FULL O' NUTS\nCrazies.  It's the end of the month.  They're out of food.\n\nSNAKE\nDo you live here?\n\nGIRL IN CHOCK FULL O' NUTS\nSkulls?  You kidding?  I'm with the Turks now.  I just got caught in the\nstreet after dark and now I'm stuck here all night.\n\nSNAKE\nA plane crashed seven hours ago.  Did you see it?\n\nGIRL IN CHOCK FULL O' NUTS\nNo.\n\nSNAKE\nShit.\n\nGIRL IN CHOCK FULL O' NUTS\nYou're a cop.\n\nSNAKE\nI'm an asshole.\n\nGIRL IN CHOCK FULL O' NUTS\nHey, wait a minute.  I know who you are.  Yeah!  But I heard you were\ndead.\n\nSNAKE\nI am.\n\nGIRL IN CHOCK FULL O' NUTS\nWow, Snake Plissken.  All right!  What you doing in here with a gun,\nSnake?\n\nSNAKE\nLooking for somebody.\n\nGIRL IN CHOCK FULL O' NUTS\nWho?\n\nSNAKE\nThe President.\n\nGIRL IN CHOCK FULL O' NUTS\nCome on!  He really here?\n\nSNAKE\nSomewhere.\n\nGIRL IN CHOCK FULL O' NUTS\nWhen you find him, are you gonna take him out?\n\nSNAKE\nMm-hm.\n\nGIRL IN CHOCK FULL O' NUTS\nTake me out with you, Snake.\n\nSNAKE\nWhy?\n\nGIRL IN CHOCK FULL O' NUTS\nI can think of lots of reasons why . . .\n\nShe makes a move to kiss him, but there's a noise.  They split up, but\nshe gets sucked through the floor.  Snake tries to save her, but it's\ntoo late.  He gets the hell out of there.\n\nINT. BUILDING -- NIGHT, EXT. NEW YORK -- NIGHT, EXT. ALLEYS -- NIGHT\nSnake runs through the building, breaks a window, and climbs up a fire\nescape to get to a new floor.  He breaks a window to get in, then pulls\na cabinet in front of the window.  He shoots through the cabinet,\ncausing some crazy to scream.  He busts down a door, shoots open part of\na wall, busts through that, climbs out a window, and climbs down a\ntelephone pole.  He then climbs up a wall.  On the way he drops his\nwalkie-talkie.  He runs down an alley, and as he does, Cabbie pulls up.\n\nCABBIE\nWhere you goin', buddy?\n\nSnake points his gun at Cabbie.  He looks behind him, then gets in the\ncab.\n\nINT. CAB -- NIGHT\nSnake notices a tape player which is playing the theme from \"American\nBandstand.\"\n\nCABBIE\nBad neighborhood, Snake!  You don't want to be walking from the Bowery\nto 42nd street at night!  I've been driving a cab here for 30 years and\nI'm telling you, you don't walk around here at night!  Yes, sir!\nThey'll kill you and strip you in ten seconds flat.  Usually I'm not\ndown around here myself, but I wanted to catch that show.\n\nCabbie lights a rag stuffed down the neck of a bottle which is full of\ngasoline.\n\nCABBIE\nThis stuff is like gold around here, you know.\n\nEXT. CAB -- NIGHT\nCabbie throws the bottle into the alley, where it explodes.\n\nINT. CAB -- NIGHT\n\nCABBIE\nHey, Snake, when'd you get in?  I didn't even know they caught you.\n(laughs)\nOhhh, Snake Plissken in my cab.  Wait'll I tell Eddie!  Hey, hang on,\nSnake.\n\nEXT. CAB -- NIGHT\nCabbie makes a sharp turn.\n\nINT. CAB -- NIGHT\n\nCABBIE\nHey, what were you doing back there, Snake?\n\nSNAKE\nLooking for somebody.\n\nCABBIE\nWell, why didn't you ask me?  Hell, I know everybody in this town.  Yes,\nsir.  I've been driving this cab for thirty years, this very same cab.\n\nSnake points his gun at Cabbie.\n\nSNAKE\nI'm GONNA ask you.  Now where's the President?\n\nCABBIE\nThe Duke's got him!  Everyone knows the Duke's got him!  You don't have\nto put a gun to my head.  I'll tell you!\n\nSNAKE\nWho's the Duke?\n\nCABBIE\nThe DUKE!  The Duke of New York!  A-Number-1!  The big man, that's who!\n\nSNAKE\nI want to meet this Duke.\n\nCABBIE\nYou can't meet the Duke, are you crazy?  Nobody wants to meet the Duke!\nYou meet him once and then you're dead!\n\nSnake points the gun more insistently.  Tough.\n\nEXT. BRAIN'S BUILDING -- NIGHT\nCabbie parks the cab and he and Snake walk up to Brain's building.\n\nCABBIE\nI hate to leave her on the street.  Usually I don't leave her alone at\nall.  But you're a special case, Snake.\n\nHe and Snake walk up to the door.  Cabbie knocks on the door with his\nshoe.\n\nCABBIE\nIt's OK, Snake.  It's a better neighborhood.  You can relax.\n\nRelax?  Snake checks his life clock.  17:40:46. 45. 44.  Relax, my ass.\n\nSNAKE\nThanks.\n\nCABBIE\nBoy, they got a great place here.  Like a fortress!\n\nSNAKE\nThey?\n\nFrom the inside, someone answers.\n\nMAGGIE\nWho is it?\n\nCABBIE\nIt's me!\n\nMAGGIE\nWho's me?\n\nCABBIE\nCabbie!\n\nMAGGIE\nWhat do you want?\n\nCABBIE\nSomebody wants to see Brain, it's important --\n\nMAGGIE\nNo way, Cabbie --\n\nCABBIE\nNo, it's Snake!  Snake Plissken!\n\nMaggie opens the door.  She stands there and surveys the pair.\n\nMAGGIE\nYOU'RE Plissken?\n\nCABBIE\nHe wants to see Brain.\n\nMAGGIE\nWhy?\n\nSNAKE\nI want to meet the Duke.\n\nSnake and Maggie exchange a glance.  She leads them in.\n\nINT. BRAIN'S -- NIGHT\n\nCABBIE\nHey, what do you think of this place, Snake?  It used to be a public\nlibrary.  Oh, that Brain, he's the greatest!  Mr. Fabulous!  Duke loves\nhim.\n\nSNAKE\n(gesturing at Maggie)\nWho's that?\n\nCABBIE\nThat's Maggie.  Brain's squeeze.  The Duke gave him to Brain just to\nkeep him happy . . . see what I mean?\n\nSnake can tell that Maggie's more than just Brain's squeeze; she's his\nbodyguard, too.  She looks like she'd be willing to kill to protect\nBrain.\n\nMAGGIE\nHeard you were dead.\n\nINT. BRAIN'S ROOM -- NIGHT\n\nCABBIE\nBrain?  Brain!  I brought somebody to see you!\n\nSnake looks at Brain.  He knows this guy.\n\nSNAKE\nHarold Helman.\n\nBrain puts down his book and stands up.\n\nBRAIN\nSnake?\n\nMAGGIE\n\"Harold\"?\n\nSNAKE\nWhere you been, Harold?  It's been a long time.\n\nMAGGIE\nYou never told me you knew Snake Plissken, Brain.\n\nCABBIE\nIsn't that great?  Hey, Brain, I could use some gas if you can spare\nsome . . .\n\nNo one pays attention.  Snake advances on Brain.  Brain sits down.\n\nSNAKE\nI'm glad you remember me.  Yeah.  A man should remember his past.\nKansas City, four years ago.  You ran out on me.  You left me sitting\nthere.\n\nBRAIN\nYou were late.\n\nSNAKE\nWe were buddies, Harold.  You, me, and Fresno Bob.  You know what they\ndid to Bob?\n\nHis face changes.  He suddenly kicks Brain's chair into the wall and\npoints his gun.\n\nMaggie draws a knife and starts advancing on Snake.\n\nSNAKE\nYou want to see him sprayed all over that map, baby?\n(to Brain)\nWhere's the President?!\n\nBRAIN\nSwear to god, Snake, I don't know --\n\nSNAKE\nDon't fuck with me!\n\nBRAIN\nWhy do you want to know?\n\nSNAKE\nI want him.\n\nBRAIN\nWorking for the man now, huh?\n\nSNAKE\nThen I'll just beat it out of your squeeze --\n\nBRAIN\nMm-hm.  Maggie doesn't know EXACTLY where he is and unless you know\nEXACTLY PRECISELY where he is you'll never find him.\n\nSnake takes his gun away.  He contemplates Brain.\n\nSNAKE\nListen, I'll take you out of here.  Yeah.  Jet glider just a couple of\nblocks down the street.  And all you gotta do is get me to him.\n\nEveryone realizes the importance of this.\n\nCABBIE\nNo kidding?  On the level?  Will you take me, too?\n\nBRAIN\nWe've got to deal somewhere else.\n\nSNAKE\nNo glider.\n\nMAGGIE\nWe've got the President.  And the Duke's taking everybody out of here.\n\nSNAKE\nNever happen.  See, I know something you and the Duke don't know.  We've\nonly got so long before Mr. President don't mean a whole lot.\n\nBRAIN\nYou're lying.\n\nMAGGIE\nMaybe he's not . . .\n\nBRAIN\nI know him!  Look at his face, he's lying!\n\nSNAKE\nRight, Harold.  I'm lying.  So I might as well have some fun and keep\nlooking by myself.\n\nHe cocks his gun and points it at Brain again.\n\nMAGGIE\nBrain --\n\nSNAKE\nTalk to him, baby --\n\nMAGGIE\nBrain, he'll kill us both if you don't tell him --\n\nCABBIE\n(panicking)\nBrain, you've got to tell him!\n\nMAGGIE\n(panicking)\nBrain, you've got to tell him --\n\nCABBIE\n(panicked)\nTell him, tell him, tell him --\n\nBRAIN\nALL RIGHT!!!\n\nSnake lowers the gun.\n\nSNAKE\nYou always were smart, Harold.\n\nBRAIN\nJust one thing right now.  Don't call me \"Harold.\"\n\nEXT. BUILDING -- NIGHT\nSnake, Maggie, Cabbie and Brain all walk out.\n\nSNAKE\nSo you work for this Duke, huh?\n\nBRAIN\nYeah.  Make gas for him.  Figure out things for him.\n\nSNAKE\nLike what?\n\nBRAIN\n(showing off)\nLike how to get across the 69th street bridge -- it's mined, but I know\nwhere they're planted.\n\nMAGGIE\nWe got a diagram from a guy that got all the way across . . . before\nthey shot the poor bastard.\n\nBRAIN\nWe got a crew up there now clearing the way across the first barricade.\n\nCABBIE\nWhat a sight, Snake!  The whole camp rolling right across the bridge and\nthe President right out front!  Oh, that would have been so fine . . .\n\nMAGGIE\n(ironically)\nYeah, it would have been . . .\n\nCABBIE\nYeah, but we're going with Snake now.\n\nThe three of them cross into the street.  Cabbie panics.\n\nCABBIE\nThat's the Duke!  I know the sound of his engines.  Don't cross the Duke\n-- everybody knows that.\n\nWe get one glimpse of the Duke's car.  Then we realize that Cabbie is\ngone and his cab is racing away.\n\nMAGGIE\nCabbie, you slime!\n\nThe Duke's car heads right for us.\n\nMAGGIE\nNo, Brain!\n\nThe two of them run off.  After a while, Snake follows.  The three of\nthem hide.  The Duke's car is an old Chrysler with chandeliers suspended\nover the headlights.  It's in a caravan of three, leading the way.  A\nfourth car comes up later.  The Duke is sitting in the passenger seat of\na car with Weirdo in the back.  The Duke gets out of the car, Weirdo at\nhis side.  The Duke is wearing a cowboy hat, sunglasses, a snazzy\njacket, bluejeans, and boots.  He looks TOUGH.  He sends Weirdo to knock\non the door.\n\nMAGGIE\nHe's looking for you, Brain.\n\nSNAKE\nWhat does he want?\n\nBRAIN\nHe wants my diagram of the bridge.  When he finds out I'm with you he's\ngoing to want my life!  Shit, Plissken, I knew I shouldn't have listened\nto you --\n\nSNAKE\nWe've got to get to the President NOW, while he's busy.\n\nBRAIN\nForget it, he's on the other side of town and we got no wheels.  The\ndeal is off --\n\nSNAKE\nJust calm down.\n\nEXT. CAR -- NIGHT\nA lone man sits, looking bored.  Snake subtly goes up to him, knocks him\nout, and gets him out of the car.  He briefly considers shooting the guy\non the hood of the car.  Instead, the guy on the hood of the car walks\naround.  Snake knocks him out a second alter and then drives to get\nBrain and Maggie.  He knocks the other guy out of the car.\n\nBRAIN\n(panicked)\nI think they saw us!  Turn left, turn left here!\n\nINT. CAR -- NIGHT\n\nMAGGIE\nBrain, this is Broadway.\n\nBRAIN\nI know, I know, the Duke'll take Seventh Avenue, Broadway is five\nminutes --\n\nMAGGIE\nNo!!!\n\nBRAIN\nYes!!!  Just keep driving!\n\nSNAKE\nWhat's wrong with Broadway?\n\nEXT. BROADWAY -- NIGHT\n\nSNAKE\n(to the car)\nCome on sweetheart . . .\n\nPeople start throwing bricks.  Snake hands his gun to Brain, who passes\nit to Maggie, holding it like a dead rat (or like a macho guy would hold\na purse).  Snake drives as fast as he can, gunning off the bystander who\ngets on the car.  A bystander grabs Brain.\n\nBRAIN\nMaggie!\n\nMaggie protects him.  She shoots the people grabbing at him.  Snake\nangles the car through a pile of scrap metal and drives away.  He glares\nat Brain.  Everyone seems visibly shaken.\n\nSNAKE\nHold on.\n\nSnake backs the car through a bunch of piled cars.  He takes off, the\ncar a bit worse for wear but at least they got away from the crowd on\nBroadway.\n\nEXT. TRAINS -- NIGHT\nBrain points to the cars as Snake watches.\n\nBRAIN\nHe'll be in the third car from the end, by the last campfire.\n\nSnake looks around.  The Duke's caravan passes.  There are more cars\nthan there were before.\n\nBRAIN\nIt's all right.  He's got to go in the front way.  It'll take him five\nminutes.  If you're not back to the car in four minutes you're on your\nown.\n\nSNAKE\nWhen we get there, Harold, you just keep talking.\n\nThey drive off.  Snake gets to the trains.  No one notices.  Maggie and\nBrain get out of the car and Snake ducks into the train car.\n\nBRAIN\nHi, guys.  Hi . . . how's it going?  Cooled off a little, huh?\n\nHEAD DUDE\nWhat do you want, Brain?\n\nBRAIN\nDuke told us to wait inside.  He's on his way here now.\n\nHEAD DUDE\nHe didn't say nothing to us about it.\n\nBRAIN\nWell, you can't expect him to tell everybody in the joint, now can you?\nThat's why he's the Duke.\n\nThe camera angles back to show Snake walking on top of the railroad\ncars.  He hasn't found the President yet. But he doesn't have time to\nwonder if Brain double-crossed him.\n\nHEAD DUDE\nWhy don't we wait outside here for him?\n\nBRAIN\nWhy don't we wait inside for him?\n\nHEAD DUDE\n'Cause I got orders, that's why.\n\nBRAIN\nWhat are your specific orders, by the way?\n\nHEAD DUDE\nSpecific orders, Brain, was for me not to let no one go inside.\n\nBRAIN\nHow's the President holding up, by the way?  Any political discussion\nyou've had with him?\n\nINT. PRESIDENT'S TRAIN CAR -- NIGHT\nTwo guards sit with the President, talking.  The first guard is by the\nPresident.  The second is looking out the window.\n\nSECOND GUARD\nThat Brain is a real pain in the ass.  He's always sniffing around like\na dog.\n\nFIRST GUARD\nHe comes up with the gas.\n\nThe second guard looks out the window.  Snake grabs him by the neck, and\nbreaks it.  The first guard doesn't notice, but the President does, and\nthat tips off the guard.\n\nFIRST GUARD\nWhat are you looking at?\n\nHe turns and Snake throws a star at him.  It lodges right in his brain,\nbut not fast enough.  Snake is hit in the leg with a crossbow arrow.\n\nSnake limps over to the President and starts uncuffing him.  The\npresident still has the briefcase.  This is it, this is the big time.\nSnake keeps calm.\n\nPRESIDENT\nAre you from the outside?\n\nSNAKE\nStop shaking.\n\nPRESIDENT\nI can't!  Who are you?\n\nSNAKE\nHauk sent me.  We've got to move fast.\n\nPRESIDENT\nMove fast?  You're goddamned right I'll move fast.\n\nSNAKE\nQuiet!\n\nSnake limps away, President in the lead.\n\nEXT. TRAIN -- NIGHT\nSnake and the President keep moving.  Suddenly, Snake gets jumped.  Ten\nguys surround him and the President, and though Snake fights well, it's\nnot well enough.  Brain comes out with Maggie.\n\nBRAIN\nThey got him.  Now watch him.\n\nThe Duke steps out from the car, followed by Weirdo.\n\nDUKE\nFriend of yours, Brain?\n\nBRAIN\nHe had a gun on me, Duke, there was nothing I could do.\n\nDUKE\n(not believing it for a second)\nUh-huh.\n\nWeirdo points accusingly as he and Duke walk away.\n\nBRAIN\nMaggie . . .\n\nDuke walks up to Snake.  Snake isn't giving in even though he's pretty\nsure he's beat.\n\nDUKE\nWho are you?\n\nSnake doesn't answer.  Duke grabs the arrow still lodged in his right\nleg and pulls on it.  Snake writhes in agony.\n\nDUKE\nI said who are you?\n\nBRAIN\nSnake Plissken, Duke.  The Man sent him in here.  Something's going down\n. . . we need him.\n\nDuke recognizes the name.  He is impressed.  He lets go of the arrow.\nSnake hates him more than ever.\n\nDUKE\nSnaaaaaake Plissken.  I've heard of you.\n\nHe raises a crowbar over his head and smacks Snake with it, knocking him\nout.\n\nDUKE\nI heard you were dead.\n\nEXT. NEW YORK -- NIGHT\nA helicopter flies over the city.\n\nINT. HELICOPTER -- NIGHT\nThe pilot looks at a grid-view of New York.\n\nSURVEILLANCE 4\nThis is surveillance 4 to security control.  Nothing on the infrared\nbody scan.  Nothing in the searchlight. There aren't any fires on the\nstreet.  Nobody moving down here.\n\nINT. BASE -- NIGHT\nHauk, Rehme and the Vice President wait.\n\nSURVEILLANCE 5\nSurveillance 5 . . . security control . . . negative on infrared body\nscan . . . no movement in the searchlight . . . nothing strange going on\ndown there.\n\nThey look at the Master Life Clock.  12:27:39.  38. Where's Plissken?\n\nINT. ROOM -- DAY\nPlissken lies unconscious on a bed, crossbow pointed at his head.  Three\nguards are at the ready.\n\nINT. BASE -- DAY\n\nVICE PRESIDENT\nWe've got to go in now.\n\nHAUK\nWe hold.\n\nVICE PRESIDENT\nYou're countermanding my orders, Hauk.\n\nHAUK\nThis is my prison, I'll give the orders.\n\nVICE PRESIDENT\nI override all that!\n\nHAUK\nJust try.\n\nEXT. NEW YORK -- DAY\nUnbelievable smog.  Helicopters fly.\n\nSURVEILLANCE ?\n...still negative on the scan.\n\nSURVEILLANCE 4\nThis is Surveillance 4 to Security Control.  Nothing on the infrared\nbody scan.  Negative on the sweep.\n\nEXT. WALL -- DAY\nHauk stands on the wall, listening.\n\nSURVEILLANCE 10\nSurveillance 10.  Still negative on the scan.\n\nSURVEILLANCE 5\nSurveillance 5 still negative.\n\nSURVEILLANCE 4\nThis is Surveillance 4 to Security Control.  Nothing on the infrared\nbody scan.  Negative...\n\nINT. ROOM -- DAY\nSnake begins to come to.  We hear gunshots and cheering.  The guards go\nto announce Snake's consciousness.\n\nINT. HANGAR -- DAY\nBrain and Maggie move to the center of the gunshots and cheering\n\nINT. TARGET PRACTICE -- DAY\nThe Duke sits firing with Plissken's gun at the President, whose\nbriefcase is still chained to his arm.\n\nINT. ROOM -- DAY\nSnake sits up.  There are LOTS of crossbows aimed at him.\n\nGUARD\nDon't move, Snake.\n\nSnake turns to face him.  He stands up.  We see for the first time\nexactly why he's called \"Snake\" Plissken.  There's a snake tattooed on\nhis stomach.  The snake's tail disappears into his pants, but we have a\ngood idea of where it leads and what it becomes.  Ah ha.\n\nSnake's life clock is gone.  He has no idea how much time he's got.\nShit.\n\nINT. TARGET PRACTICE -- DAY\n\nDUKE\nI want that diagram, Brain.\n\nBRAIN\nOh. It's at my place, Duke.  Duke, that Plissken said something about a\ntime limit.\n\nDUKE\nWhat time limit?\n\nBRAIN\n(gesturing at President)\nOn him.\n\nDUKE\nThat's a lot of crap.\n(to the President)\nWhat did I teach you?\n\nPRESIDENT\n(weakly)\nYou... You are... the Duke of New... New York... You're... A-Number-One.\n\nDUKE\nI can't hear you.\n\nPRESIDENT\nYOU ARE... THE DUKE OF NEW YORK... YOU'RE A-NUMBER-ONE!\n\nDUKE\n(to Brain)\nGet me the diagram.\n\nBRAIN\nDuke... Don't kill Plissken.  We need him.\n\nThe Duke points the gun at Brain, but doesn't even give him a glance.\n\nDUKE\nGet moving, Brain.\n\nBrain moves, and Weirdo laughs that odd laugh.  The Duke fires at the\nPresident's briefcase.  Papers and a tape fall out.  Weirdo looks down\nand kicks the tape away.  He picks it up and holds it to his ear, then\nputs it in his pocket.  Guards come and unstrap the President.  The Duke\nhas decided to take Snake a bit more seriously than he had.\n\nWhich is not saying much.\n\nEXT. NEW YORK -- LATE AFTERNOON\nHelicopters fly above ground.  A group stands with a car, gesturing\nwildly.\n\nINT. HELICOPTER -- LATE AFTERNOON\n\nPILOT\nPeople out below in the park.  Can you see them?\n\nINT. BASE -- LATE AFTERNOON\n\nPILOT\nSurveillance 2 to Security Control.  We're getting that readout, mostly\nin the infrared.\n\nHauk and Rehme immediately check out the monitor.  At least something's\ngoing on.\n\nPILOT\nWe have a visual sighting on it.  It's a crowd of prisoners in Central\nPark.  They're waving at us.  Signaling us in the food drop area.\nThey're waving us down.\n\nEXT. CENTRAL PARK -- LATE AFTERNOON\nThe prisoners wave the helicopters down.  A group of guards lands and\nruns over to the station wagon.  They get the briefcase which has been\nsawed off the President's handcuffs.\n\nINT. ROOM -- LATE AFTERNOON\nSnake is awake and surrounded by guards.  The cheers are louder.\n\nINT. BRAIN'S -- LATE AFTERNOON\nMaggie walks across the room, loading a gun.  It's one of Snake's.\n\nBRAIN\nI still can't figure out whether that son of a bitch Plissken was\ntelling the truth or not.  God, I hate that guy.\n\nBrain stands in front of his maps.\n\nMAGGIE\nHe got in somehow.\n\nBRAIN\nYeah, yeah, but how?  You gotta land the glider and take off.\n(he gestures at the map)\nYou can't do it in Central Park, there's too many trees.  Port\nAuthority's too low to the ground.  Unless it was some...\n(he gets it... they don't call him \"Brain\" for nothing)\nSomeplace high up.  World Trade Center.  That's it.  There we go.  The\nWorld Trade Center.  And it's gonna be a hell of a lot easier for me to\ntake off than it was for him to land.\n\nINT. BASE -- LATE AFTERNOON\nHauk reads the note left in the briefcase.\n\nHAUK\n\"Amnesty for all prisoners in New York City in exchange for President.\n69th Street Bridge tomorrow, 12 Noon.  No bullshit or he's dead.\"\n\nVICE PRESIDENT\nWhere's the tape?\n\nHAUK\nNot here.\n\nHe reaches inside and removes a pair of goggles.\n\nREHME\nThey're Plissken's.\n\nYeah, they were on the table.  He never did use them, though, and only\nhalf of them is necessary in his case anyway.\n\nVICE PRESIDENT\nSo much for your man, Hauk?\n\nHauk hesitates.  This is the last thing he wants.\n\nHAUK\nWarm up the choppers.  We're moving in.\n\nEXT. BASE -- SUNSET\nHelicopters prepare for takeoff.\n\nINT. BASE -- SUNSET\nHauk sits at the microphone.\n\nHAUK\nPlissken?\n\nThe master life clock reads 1:56:38. 37. 36,\n\nINT. ROOM -- SUNSET\nSnake slowly gets to his feet.  He's still groggy, but it's time for him\nto move.\n\nGUARD\nCome on, get up!\n\nSnake limps through a hallway and into a stadium.\n\nINT. STADIUM -- SUNSET\nBoos greet Snake as he walks in.  In the center of the room is a\nfighting ring.  Snake climbs in, not without effort.  A huge and\nextremely ugly man climbs into the ring, amid loud cheers.  Snake\nnotices that the huge ugly dude is wearing his life clock.  In the\nbalcony above is the Duke.  The Duke stands up and raises his arms, and\neveryone gets silent.\n\nDUKE\nThey sent in their best man.  And when we roll down the 69th street\nbridge tomorrow on our way to freedom, we're gonna have their best man\nleading the way.  From the neck up.\n\nThe crowd cheers.\n\nDUKE\nOn the hood of my car!\n\nMore cheers.\n\nDUKE\nLet's do it!\n\nUgly and Snake take bats.  They circle each other.  Ugly strikes at\nSnake.  Snake ricochets off the ring.  He rolls around, fighting for his\nlife.\n\nINT. BUILDING -- SUNSET\nBrain and Maggie walk around.  They knock on a door and Weirdo answers.\nHe's wearing Cabbie's hat.\n\nWEIRDO\nHello.\n\nBRAIN\nWhere'd you get the hat?\n\nWEIRDO\nGot it from Cabbie.\n\nBRAIN\nYeah?\n\nWEIRDO\nTraded him.\n\nBRAIN\nFor what?\n\nWEIRDO\nWhat are you so nervous about?\n\nBRAIN\nI'm here to see the President.\n\nWEIRDO\nWho says?\n\nBRAIN\nThe Duke.\n\nWEIRDO\nNo he doesn't.\n\nBRAIN\nWell... I'll have to tell him you said that.\n\nWeirdo doesn't really believe it.  If it's not true, so what?\n\nBut if it IS true, the Duke will have him tortured to death.\n\nWEIRDO\nWait a minute.  Why?\n\nBRAIN\nHe's got something hidden in his clothing.  The Duke wants it.\n\nWEIRDO\nWhat?\n\nBRAIN\nI'll show you.\n\nWEIRDO\nYou'll tell me.\n\nBRAIN\nCyanide capsules.  The Duke don't want a dead president.\n\nBrain pushes his way in.\n\nINT. ROOM -- SUNSET\n\nBRAIN\nGentlemen.  Mr. President.\n\nWeirdo lets the door slide closed.  Brain starts checking the\nPresident's clothes.  The President has been dressed in a wig and tied\nto a chair with an American Flag on it.\n\nWEIRDO\nCyanide?\n\nBRAIN\nYeah.  He might try to take it tomorrow.\n\nWeirdo walks up to Brain.\n\nWEIRDO\nThat's bullshit.  You're not supposed to be in here, Brain --\n\nBrain stabs Weirdo, who dies with a gasp.  Maggie dispatches of the\nthree guards.  She smiles.  Brain unties the President's hand.  The\nPresident snatches off the wig in a rage.\n\nINT. TOURNAMENT -- SUNSET\nSnake notices a guard wearing the eagle tracer.  A trash can lid and a\nbat with spikes on it is handed to him.  The next round begins.\n\nEXT. HOUSE -- EVENING\nBrain, the President, and Maggie sneak out.  A guy in a cowboy hat\nnotices.\n\nINT. TOURNAMENT -- EVENING\nUgly and Snake keep fighting.  Snake is not doing very well.  But he's\ncatching up.  As Ugly tries to hit him, he nails Ugly in the groin, then\nin the back of the head.  The crowd begins cheering \"SNAKE!  SNAKE!\"\nThe Duke can't believe it.  Snake runs to the guard with the tracer and\nactivates it.\n\nINT. BASE -- EVENING\nThe Master Life Clock begins blinking \"Tracer Status: ACTIVATED.\"\n\nCOMPUTER\nTracer activated at one hour, thirty-five minutes, twenty-seven seconds.\n\nRehme jumps out of his seat.\n\nREHME\nHauk!!\n\nINT. TOURNAMENT -- EVENING\nSnake limps around, getting his stuff back together.  He looks at his\nlife clock.  1:34:54.  53.  He doesn't have much time.\n\nThe guy in the cowboy hat runs up to the Duke and yells for attention.\nDuke immediately gets up and leaves, as do his hangers-on.\n\nGUY IN COWBOY HAT\nLISTEN!!!  LISTEN!!!  LISTEN!!!\n\nThe crowd shuts up.\n\nGUY IN COWBOY HAT\nTHE PRESIDENT'S GONE!  BRAIN TOOK HIM!\n\nThe crowd rushes out.  Snake limps out of the ring and runs off as fast\nas he can.\n\nEXT. BASE -- EVENING\nRehme catches up to Hauk at the last second.  Hauk has been stalling.\n\nREHME\n(shouting over noise)\nHauk!  Plissken's tracer!\n\nHauk runs up to the head helicopter pilot.\n\nHAUK\nGet on the radio!  Keep them down!  Nobody move!\n\nINT. BASE -- EVENING\nTwo monitors show Snake's tracer.\n\nREHME\nHe's approaching the World Trade Center.\n\nHAUK\nI knew that son of a bitch was alive.\n\nREHME\nHe's inside.\n\nINT. WORLD TRADE CENTER -- EVENING\nSnake limps around.  He notices a cab.  Fifty flights of stairs with\nhis leg shot to hell.  He hesitates only for a second, then starts up.\n\nINT. BASE -- EVENING\nThe Vice President, Hauk and Rehme all stand, staring at the monitors.\n\nVICE PRESIDENT\nIt's gone.\n\nHAUK\nThe signal only lasts for 15 minutes.  Download the choppers.  We're in\na standby situation.\n\nRehme runs off.\n\nVICE PRESIDENT\nAnybody could have pushed that button.\n\nHAUK\nOnly Plissken knew there was a safety catch.  Now we'll give him a\nlittle more time, just to make sure.\n\nThe master clock shows 59:44. 43.\n\nEXT. WORLD TRADE CENTER -- NIGHT\nSnake gets out of the elevator.  Maggie, Brain, and the President all\ntake cover behind a chimney and try to get a gang to stop chopping down\nthe glider.  It doesn't work.  The glider floats away.\n\nBRAIN\nGoddamned redskins!  They're savages, Mr. President!\n\nSnake runs to get them.  They get in the elevator.\n\nINT. WORLD TRADE CENTER -- NIGHT\nSnake has the President by the arm and is leading everyone out.\n\nBRAIN\nListen, Snake, I swear to god, I thought you were dead --\n\nSNAKE\nYeah, you and everybody else.\n\nHe grabs Brain by the tie and aims the gun at his head.\n\nSNAKE\nThat's your car in the lobby?  The keys!  Quick!  Quick!  Diagram of the\nbridge!  Hey, hey, hey --\n\nSnake takes all the abovementioned items.\n\nBRAIN\nI'm the only one who knows how to read that, Snake --\n\nSNAKE\nStay out of my way, Harold.\n\nBRAIN\nBesides, you can't read and drive at the same time.  You need us!\n\nSnake is tired.  He's pissed.  He's got half an hour to live if that.\nHe doesn't have time for Brain's shit, and he lets him know it.\n\nSNAKE\nYou shouldn't have double-crossed me again, Brain.  Come on, let's go --\n\nHe suddenly notices there's nothing on the end of the President's chain.\nHe holds it in front of the President's face.\n\nPRESIDENT\nThey sawed it off...\n\nSNAKE\nThe tape?\n\nPRESIDENT\nGone... I don't know where...\n\nBRAIN\nI do.\n\nSnake shoots him a look.  Bullshit, his eyes say, but maybe Brain is\ntelling the truth.  Maybe.\n\nBRAIN\nSwear to god, Snake, I know where it is.  Just take us to the car and\nI'll take you right to it.\n\nSNAKE\nShit...\n\nHe tosses the diagram of the bridge to Brain.  They go down the stairs.\nSnake's in bad shape, but it's everyone else who's complaining.\n\nMAGGIE\nDon't talk.  Breathe.\n\nPRESIDENT\nCome on, come on, we're wasting time!\n\nSnake gets into the car.  It won't start.\n\nBRAIN\nWhat's wrong?\n\nSNAKE\nDead, Harold.\n\nBRAIN\nWhat?!\n\nSnake hands the keys to Brain.\n\nSNAKE\nHere, take these.\n\nSnake looks under the hood.  There's a man with a crossbow pointed\nstraight at him.  Shit.  They've been caught.  Again.\n\nDUKE\nCar trouble?\n\nSnake looks over the hood.  There's the Duke.  With a dozen guards.\nBrain steps out.\n\nBRAIN\nHi, Duke.\n\nDUKE\nThis whole deal of yours is over, Snake.  You and Brain just say good-\nbye to each other.\n\nThe Duke turns away and loses aim of his gun for a moment.  At that\nmoment, Snake pulls a gun and fires at the steam vent.  At the same\ntime, Maggie slams the hood shut on the guard with the crossbow.  Steam\nflies everywhere, enough for cover.  The four of them run for it.  The\nDuke runs after them.\n\nEXT. NEW YORK -- NIGHT\nA cab pulls up.  Its radio is playing \"American Bandstand\".  Guess who's\ndriving?  You got it!\n\nThe group of four runs up to the cab.  Snake runs around and makes\nCabbie scoot over.  He wants to drive.  Cabbie looks shocked.\n\nPRESIDENT\nGO, GO!\n\nThe Duke and his followers arrive too late.\n\nINT. CAB -- NIGHT\n\nBRAIN\n(trying to explain the map)\n...and then there's three more...\n\nSnake waves him off.  Cabbie's trying to make conversation.\n\nMAGGIE\nThey're behind us --\n\nBRAIN\nThey come in groups of threes!\n\nSnake pops the American Bandstand tape out of the tape player and puts\nit in his pocket.\n\nSNAKE\nWhere's the tape, Brain?\n\nCABBIE\nWhat tape?\n\nSNAKE\nWhere is it?\n\nBRAIN\nTape...\n\nPRESIDENT\nThe tape from the briefcase!\n\nCABBIE\nOh, that tape!\n\nHe pulls it out of his pocket.\n\nCABBIE\nHere it is!\n\nCabbie hands it to Snake.  Brain laughs, trying to cover his ass.\n\nBRAIN\nYou traded away your hat for it!\n\nCABBIE\nHow'd you know?\n\nBRAIN\nSee, see!\n\nSnake pops it into the deck.  It begins spewing out information.  It's\nthe right one.  He slips it into his pocket.\n\nPRESIDENT\nHere, give me that tape!\n\nHA!  No way!\n\nSNAKE\nNot just yet.\n\nSnake checks his life clock.  23:20. 19. 18. 17.  Didn't that guy say 15\nminutes before the last hour was up?  But Hauk said they'd been playing\nwith this, so the 15 minutes was built in already.  Still, 23 minutes.\nThat's cutting it pretty fucking close.\n\nEXT. CAB -- NIGHT\nSnake races as fast as the cab can go.\n\nINT. CAB -- NIGHT\nSnake checks to make sure they're not being followed too closely.\nThey're not.  The Duke is behind, but he's FAR behind.\n\nCABBIE\nEasy... easy!\n\nBRAIN\nGo for it, Snake!\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nSnake jumps the car over the first obstacle.  Cabbie looks like he's\nhaving a heart attack.\n\nSnake swerves on Brain's direction.  So far so good.  A mine goes off,\nbut it's behind them.\n\nThe Duke goes forward.  He's going by the seat of his pants.  But he\nknows the general direction of how Snake went.  A mine goes off behind\nhim, too.\n\nINT. CAB -- NIGHT\nBrain reads the map.  Cabbie continues to freak out.\n\nCABBIE\nYou've got to slow down a little, Snake...\n\nBRAIN\nI think there are three mines ahead, Snake.\n\nMAGGIE\nYou think?!\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nThe Duke continues in pursuit.\n\nINT. CAB -- NIGHT\n\nBRAIN\nStay left, stay left, stay left, and then jog right when I tell you.\n\nCABBIE\nYou're pushing her too hard, Snake.\n\nBRAIN\nOK, OK, NOW!\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nThe cab explodes, being cut right in half.  Everyone makes it except\nCabbie.  Cabbie had been driving that very same cab for thirty years.\nHe died with it.\n\nThe President, Snake, Maggie and Brain all keep going on foot.\n\nBRAIN\nI said JOG RIGHT!... you asshole.\n\nBrain leads the way as they keep crossing the bridge.\n\nBRAIN\nStay to the right, stay to the right, now jog left.  Hold it, left...\nleft... LEFT, DAMMIT!\n\nThe other three go right.  Brain goes left and a mine explodes under\nhim.  Maggie walks up to the body in shock.  Snake limps up to her.\n\nMAGGIE\nBrain...\n\nSNAKE\nKeep moving...\n\nThe Duke's car is coming.  Snake checks his life clock\n\nSNAKE\nMaggie... he's dead.  Come on.\n\nMaggie calmly holds out her hand.  Snake smiles and hands her his gun.\nHis grin grows.  It's one of respect for what she's about to do.  He\nruns off after the President.\n\nMaggie walks around to Brain, then steps in front of him.  She points\nthe gun at the Duke's car.  The first three shots don't connect.  The\nfourth nails the headlight, and then the Duke runs her over.  He keeps\ngoing.\n\nINT. BASE -- NIGHT\nRehme runs up to Hauk and the Vice President.\n\nREHME\nStation 19!  They spotted two cars on the 69th street bridge.\n\nHAUK\nIs it Plissken?\n\nREHME\nTaxicab and a Cadillac.  Taxi hit a mine.  There's four people on foot.\n\nVICE PRESIDENT\nFourteen minutes...\n\nHAUK\nGet a jeep with a winch over there fast.\n\nHe pulls out a phone.\n\nHAUK\nStrombaerden!  Get over to Station 19.  They're coming across the\nbridge.\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nThe President and Snake run on.\n\nEXT. WALL -- NIGHT\nA jeep pulls up.  Rehme's voice comes up over the loudspeaker.  The\nguards on the jeep ready the winch.\n\nREHME\n This is Rehme, Security Control.  We are in a standby situation.\nRepeat.  We are in a standby situation.  All helicopters, down.  Wall\nguard, do not fire on prisoners.  Repeat, do not fire on prisoners.  All\nvehicles, stand by.  Repeat, stand by.\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nSnake and the President are close enough to the wall to hear all this.\n\nEXT. WALL -- NIGHT\nThe wall guards grab the rope and prepare to lower it for the President\nand Snake.\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nSnake pushes the President up to the wall.  The winch comes down and\nSnake helps the President into it first.  The President goes up and\nover.  Snake's life clock reads 1:32.  But he doesn't have time to watch\nseconds tick away because the Duke is right behind him firing at him.\nSnake ducks for cover.  The wall guards die.  The winch comes down\nagain, and the Duke sees it.  He starts toward it.  Snake tackles him\nand beats him up, dazing him but not knocking him out.  He grabs the\nwinch.\n\nEXT. WALL -- NIGHT\nA hand stops the winch from moving.\n\nEXT. 69TH STREET BRIDGE -- NIGHT\nSnake comes to a stop.  He panics and starts pulling on the winch line.\nThe Duke comes to and stands up.  But he can't get anywhere because the\nPresident has found a machine gun and is now firing away.  He is very\naccurate.  He nails the Duke right away but keeps firing.\n\nPRESIDENT\n(manic voice)\nYeah, hey, Number One!  You're the Duke!  You're the Duke!\n\nThe President calms down somewhat.\n\nPRESIDENT\nYou're... the Duke... You're A-Number-One.\n\nThe President starts the winch again.  Snake climbs up and gets over as\nfast as he can without injuring himself.\n\nEXT. WALL -- NIGHT\nHauk and the medic pull up with the machine.  Hauk interrupts the medic.\n\nHAUK\nThe tape, Plissken.\n\nSnake reaches into his pocket, grabs the tape, and hands it to Hauk.  He\nis furious.  As soon as Hauk has the tape, he lets the medic come back.\nHe holds up two medal pads to Snake's neck.  They buzz, they buzz\nlouder, and then he takes them away.\n\nMEDIC\nThat's it.\n\nSnake continues to pant and fume.  He stares at them, then lifts his\nwrist to look at his life clock.  2 seconds.  One second.\n\nBeep.\n\nNothing.\n\nSnake lowers his wrist.\n\nEXT. PRESIDENT'S PRESS CONFERENCE SITE -- NIGHT\nA jeep pulls Rehme up.  He jogs to the President, who is being shaved\nand prepared for broadcast.\n\nREHME\nI radioed ahead, Mr. President.  They know the situation.  They're\nwaiting for your broadcast.\n\nPRESIDENT\nYeah.\n\nSnake approaches.  The President nods.\n\nPRESIDENT\nOh, it's all right.\n\nSnake walks up and looks the President straight in the eye.\n\nPRESIDENT\nI, uh... I want to thank you.  Anything you want... you just name it.\n\nSNAKE\nJust a moment of your time.\n\nAIDE\nThree minutes, sir.\n\nPRESIDENT\nYes?\n\nSNAKE\nWe did get you out.  A lot of people died in the process.  I just\nwondered how you felt about it.\n\nPRESIDENT\nI want to thank them.  This nation appreciates their sacrifice.\n\nThe President is full of shit after all.  Snake has reason for his\ncynicism.  The President is uncomfortable with Snake's glare and it\nshows.\n\nPRESIDENT\nLook, uh, I'm on the air in...\n(questioning his aide)\nTwo and a half minutes?\n\nAIDE\nYes, sir.\n\nSnake lights a cigarette and walks away.  Rehme watches.\n\nEXT. BASE -- NIGHT\nSnake walks away.  Hauk stands nearby.  Snake stops in his tracks.\n\nHAUK\nYou going to kill me now, Snake?\n\nSNAKE\nI'm too tired.  Maybe later.\n\nHAUK\nI've got another deal for you.  I want you to think it over while you're\nresting.  I want to give you a job.  We'd make one hell of a team,\nSnake.\n\nSNAKE\n(glaring)\nThe name's Plissken.\n\nHe limps away.\n\nEXT. PRESIDENT'S PRESS CONFERENCE SITE -- NIGHT\nThe President looks suitably freshened up.  He's even smiling a little.\n\nAIDE\nYou're on camera, Mr. President.\n\nPRESIDENT\nGood evening.  Although I shall not be present at this historic summit\nmeeting, I present this, in the hope that our great nations may learn to\nlive in peace.\n\nHe pops in the tape and presses the \"PLAY\" button...\n\n...and out comes \"American Bandstand\".\n\nThe President's face goes slack.  His career's over.\n\nEXT. BASE -- NIGHT\nSnake keeps limping.  He pulls a tape out of his pocket, yanks the\nmagnetic tape out, winds it around his hand, rips it to shreds, and\nthrows the tape away.\n\nFADE OUT.\n\n\n\n\n\n\nEscape From New York\nWriters :   John Carpenter  Nick Castle\nGenres :   Action  Adventure  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:24:49.302581"}