{"title": "Eternal Sunshine of the Spotless Mind", "film_link": "/Movie Scripts/Eternal Sunshine of the Spotless Mind Script.html", "script_link": "/scripts/Eternal-Sunshine-of-the-Spotless-Mind.html", "info_raw": "\n\nEternal Sunshine of the Spotless Mind Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.10 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Charlie Kaufman  Michel Gondry  Pierre Bismuth\nGenres  Drama  Romance  Sci-Fi\nScript Date : March 2003\nMovie Release Date : March 2004\n\nRead \"Eternal Sunshine of the Spotless Mind\" Script\n\n\n", "script": "\n\nEternal Sunshine of the Spotless Mind (2003)\nby Charlie Kaufman.\n\nINT. PUBLISHING HOUSE RECEPTION AREA - DAY\n\nIt's grand and modern.  Random House-Knopf-Taschen is etched\non the wall in large gold letters.  An old woman enters\ncarrying a tattered manuscript, maybe a thousand pages.  She\nseems haunted, hollow-eyed, sickly.  The young receptionist,\ndressed in a shiny, stretchy one-piece pantsuit, looks up.\n\n\t\tRECEPTIONIST\n\tOh, hi.\n\n\t\tOLD WOMAN\n\t\t(apologetically)\n\tHi, I was in the neighborhood and thought\n\tI'd see --\n\n\t\tRECEPTIONIST\n\tI think he's in a conference.\n\tUnfortunately.  I'm really sorry.\n\n\t\tOLD WOMAN\n\tWould you just try him?  You never know.\n\tAs long as I'm here.  You never know.\n\n\t\tRECEPTIONIST\n\tOf course.  Please have a seat.\n\nThe old woman smiles and sits, the bulky manuscript on her\nlap.  She stares politely straight ahead.\n\n\t\tRECEPTIONIST (CONT'D)\n\t\t(quietly into headset)\n\tIt's her -- I know, but couldn't you just\n\t-- Yes, I know, but -- I know, but she's\n\told and it would be a nice -- Yes, sorry.\n\t\t(to old woman)\n\tI'm sorry, ma'am, he's not in right now.\n\tIt's a crazy time of year for us.\n\nThe receptionist gestures toward a Christmas tree in the\ncorner.  Its ornaments are holograms.\n\n\t\tOLD WOMAN\n\tThis book -- It's essential that people\n\tread it because --\n\t\t(gravely, patting the\n\t\t manuscript)\n\t-- It's the truth.  And only I know it.\n\n\t\tRECEPTIONIST\n\t\t(nodding sympathetically)\n\tMaybe after the holidays then.\n\nINT. TILED HALLWAY - DAY\n\nThe old woman carries her manuscript haltingly down a subway\nhall.  She stops to catch her breath, then continues and\npasses several archway with letters printed above them.  When\nshe arrives at one topped by an LL, she slips a card in a\nslot.  A plastic molded chair drops into the archway.  She\nsits in the chair; it rises.\n\nINT. TUBE -DAY\n\nThe woman is still in the chair as it slips gracefully into a\nline of chairs shooting through a glass tube.  The other\nchairs are peopled with commuters.  We stay with the woman as\nshe and the others travel over New York City in the tube.\nThere are hundreds of these commuter tubes crisscrossing the\nskyline.  The woman glances at the manuscript in her lap.\nIt's called:\n\nEternal Sunshine of the Spotless Mind\n\nThis serves as the movie's opening title.  The other credits\nfollow, as the old woman studies commuters in passing tubes.\nTheir faces are variously harsh and sad and lonely and blank.\n\nINT. WAITING ROOM - DAY\n\nSUBTITLED: FIFTY YEARS EARLIER\n\nEvery doctor's office waiting room: chairs against the wall,\nmagazines on end tables, a sad-looking potted plant, generic\nseascape paintings on the walls.  The receptionist, Mary, 25,\ncan be seen typing in the reception area.  Behind her are\nshelves and shelves of medical files.  The door opens and\nClementine enters.  She's in her early thirties, zaftig in a\nfaux fur winter coat over an orange hooded sweatshirt.  She's\ndecidedly funky and has blue hair.  Mary looks up.\n\n\t\tMARY\n\tMay I help you?\n\n\t\tCLEMENTINE\n\t\t(approaching reception area)\n\tYeah, hi, I have a one o'clock with Dr.\n\tMierzwiak.  Clementine Kruczynski.\n\n\t\tMARY\n\tYes, please have a seat.  He'll be right\n\twith you.\n\nClementine sits.  She looks tired, maybe hungover.  She picks\nup a magazine at random and thumbs without interest.\n\nINT. INNER OFFICE AREA - CONTINUOUS\n\nMary pads down the hallway.  She knocks on a closed door.\n\n\t\tMIERZWIAK (O.S.)\n\tYes?\n\nMary opens the door, peeks in.  Howard Mierzwiak, 40's,\nprofessional, dry, sits behind his desk studying some papers.\n\n\t\tMARY\n\tHoward, your one o'clock.\n\n\t\tMIERZWIAK\n\t\t(not looking up)\n\tThanks, Mary.  You can bring her in.\n\nShe smiles and nods.  It's clear she's in love.  It's equally\nclear that Mierzwiak doesn't have a clue.  Mary turns to\nleave.\n\n\t\tMIERZWIAK (CONT'D)\n\t\t(looking up)\n\tMary...\n\n\t\tMARY\n\t\t(turning back)\n\tYes?\n\n\t\tMIERZWIAK\n\tOrder me a pastrami for after?\n\n\t\tMARY\n\tCole slaw, ice tea?\n\n\t\tMIERZWIAK\n\t\t(nodding)\n\tThanks.\n\n\t\tMARY\n\tWelcome, Howard.\n\nShe smiles and heads down the hall.  Stan, 30's, tall,\nspindly, and earnest in a lab coat pops out of a doorway.\n\n\t\tSTAN\n\tBoo.\n\n\t\tMARY\n\tHi.\n\nShe glances back nervously at Mierzwiak's open door.\n\n\t\tSTAN\n\tBarely seen you all morning, kiddo.\n\nHe leans in to kiss her.  She cranes her neck to keep him\noff.\n\n\t\tMARY\n\t\t(reprimanding whisper)\n\tStan... c'mon...\n\n\t\tSTAN\n\tSorry.  I just --\n\n\t\tMARY\n\t\t(somewhat guiltilly)\n\tIt's just...y'know... I mean...\n\n\t\tSTAN\n\tI know.  Anyway --\n\n\t\tMARY\n\tAnyway, I've got to do my tap\n\tdance here.\n\nShe indicates the door to the reception area.  Stan nods.\n\n\t\tSTAN\n\tSee you later, alligator.\n\n\t\tMARY\n\t'kay.\n\n\t\tSTAN\n\tHey, if you're ordering lunch for\n\tMierzwiak, would you --\n\n\t\tMARY\n\tI better do this, Stan.\n\nStan nods again and Mary opens the door to the waiting room.\n\n\t\tMARY (CONT'D)\n\tMs. Kruczynski?\n\n\t\tCLEMENTINE (O.S.)\n\tHi.\n\nAfter a moment, Clementine appears in the doorway.  Mary\nleads her down the hall, not looking back.\n\n\t\tMARY\n\t\t(professionally courteous)\n\tHow are you today?\n\n\t\tCLEMENTINE\n\tOkay, I guess.\n\n\t\tMARY\n\t\t(at Mierzwiak's office)\n\tHere we are.\n\nMierzwiak steps out from behind his desk.\n\n\t\tMIERZWIAK\n\tMs. Kruczynski, please come in.\n\nClementine enters the office.  Mary smiles at Mierzwiak and\ncloses the door, leaving them alone.\n\nINT. OFFICE - CONTINUOUS\n\nMierzwiak directs Clementine to a chair next to a coffee\ntable and a conspicuously placed box of tissues.  Mierzwiak\nsits across from her.  He smiles.\n\n\t\tMIERZWIAK\n\tHow are you today?\n\n\t\tCLEMENTINE\n\tOkay, I guess.\n\n\t\tMIERZWIAK\n\t\t(nodding sympathetically)\n\tWell, why don't you tell me what's going\n\ton?  Do you mind if I turn this on?\n\nHe indicates a tape recorder.\n\n\t\tCLEMENTINE\n\tI don't care.\n\nHe turns it on, smiles at her, gestures for her to begin.\n\n\t\tCLEMENTINE (CONT'D)\n\tWell, I've been having a bad time of it\n\twith um, my boyfriend, I guess.\n\n\t\tMIERZWIAK\n\tYou guess he's your boyfriend?  Or you\n\tguess you're having a bad time with hm?\n\n\t\tCLEMENTINE\n\tWhat?  No.  I don't like the term\n\tboyfriend.  It's so gay.\n\nMierzwiak nods.  He's attentive, pleasant, and neutral\nthroughout.\n\n\t\tCLEMENTINE (CONT'D)\n\tMaybe gay isn't the right word.  But,\n\tanyway, it's been rough with him...\n\twhatever the fuck he is.  Heheh.  My\n\tsignificant other... heh heh.  And I\n\tguess on a certain level, I want to break\n\tit off, but I feel... y'know... it's like\n\tthis constant questioning and re\n\tquestioning.  Do I end it?  Should I give\n\tit more time?  I'm not happy, but what do\n\tI expect?  Relationships require work.\n\tYou know the drill.  The thing that I\n\tkeep coming back to is, I'm not getting\n\tany younger, I want to have a baby... at\n\tsome point... maybe... right?  So then I\n\tthink I should settle -- which is not\n\tnecessarily the best word -- I mean, he's\n\ta good guy.  It's not really settling.\n\tThen I think maybe I'm just a victim of\n\tmovies, y'know?  That I have some\n\tcompletely unrealistic notion of what a\n\trelationship can be.  But then I think,\n\tno, this is what I really want, so I\n\tshould allow myself the freedom to go out\n\tand fucking find it.  You know?  Agreed?\n\tBut then I think he is a good guy and...\n\tIt's complicated.  Y'know?\n\n\t\tMIERZWIAK\n\tI think I know. I think we can help.  Why\n\tdon't you start by telling me about your\n\trelationship.  Everything you can think\n\tof.  Everything about him.  Everything\n\tabout you.  And we'll take it from there.\n\nShe nods, thinks.\n\n\t\tCLEMENTINE\n\tUm, well, he's a fucking tidy one --\n\nEXT. COMMUTER TRAIN STATION\n\nSUBTITLE: TWO WEEKS LATER\n\nThe platform is crowded with business commuters.  Joel is\namong them.  He is in his 30's, gaunt, and holding a\nbriefcase.  The platform across the tracks from him is empty.\nSuddenly he turns and makes his way through the crowd.  He\nclimbs the stairs, crosses the overpass to the empty\nplatform.  Soon an almost empty train pulls up to that\nplatform.  Joel gets on and watches the business commuters\nthrough the dirty window as his train pulls out of the\nstation.\n\nEXT. MONTAUK TRAIN STATION - LATER\n\nJoel talks on a phone.  The wind howls around him.  He tries\nto shield the mouthpiece as he talks.\n\n\t\tJOEL\n\tHi, Cindy.  Joel.  Listen, I'm not\n\tfeeling well this morning.  No.  Food\n\tpoisoning, I think.  Sorry it took me so\n\tlong to call in, but I've been vomiting.\n\nEXT. BEACH - DAY\n\nJoel wanders the windy, empty beach, with his briefcase.  He\npasses an old man with a metal detector.  They nod at each\nother.\n\nLater: Joel looks out at the ocean.\n\nLater: Joel sits on a rock and pulls out a notebook.  He\nopens it and writes with a gloved hand.\n\n\t\tJOEL\n\tJanuary 13th, 2006.  Today I skipped work\n\tand took the train out to Montauk.\n\t\t(thinks)\n\tIt's cold.\n\t\t(thinks some more)\n\tThe sky is gray.\n\t\t(thinks some more)\n\tI don't know what else to say.  Nothing\n\thappens.  Nothing changes.  I saw Naomi\n\tlast night.  We had sex.  It was weird to\n\tfall into our old familiar sex life so\n\teasily.  Like no time has passed.  After\n\ttwo years apart suddenly we're talking\n\tabout getting together again.  I guess\n\tthat's good.\n\nHe has no other thoughts.  He glances up, spots a female\nfigure in the distance, walking in his direction.  She stands\nout against the gray in a fluorescent orange hooded\nsweatshirt.  It's Clementine.  He watches her for a bit, then\nas she nears, he goes back to his writing, or at least\npretends to.  Once she passed, he watches her walk away.  She\nstops and stares out at the ocean.  Joel writes.\n\n\t\tJOEL (V.O.) (CONT'D)\n\tIf I'm constitutionally incapable of\n\tmaking eye-contact with a woman I don't\n\tknow.  I guess I'd better get back to\n\tNaomi.\n\nLater: Joel walks up near the beach houses closed for the\nseason.  He peeks cautiously in a dark window.\n\nLater: Joel digs into the sand with a stick.\n\nINT. DINER - DAY\n\nIt's a local tourist place, but off-season empty.  Joel sits\nin a booth and eats a grilled cheese sandwich and a bowl of\ntomato soup.  An elderly couple drink coffee at the counter.\nClementine enters, looks around, takes off her hood.  Joel\nglances at her bright blue hair.  She picks an empty booth\nand sits.  Joel studies her discreetly.  The waitress\napproaches her with a coffee pot.\n\n\t\tWAITRESS\n\tCoffee?\n\n\t\tCLEMENTINE\n\tGod, yes.  You've saved my life!\n\nThe waitress pours the coffee.\n\n\t\tWAITRESS\n\tYou know what you want yet?\n\n\t\tCLEMENTINE\n\t\t(laughing)\n\tAin't that the question of the century.\n\nThe waitress is not amused.\n\n\t\tCLEMENTINE (CONT'D)\n\tYou got grilled cheese and tomato soup?\n\n\t\tWAITRESS\n\tYeah.  We're having a run on it.\n\nThe waitress heads to the grill.  Clementine fishes in her\nbag, brings the coffee cup under the table for a moment,\npours something in, then brings the cup back up.\n\n\t\tCLEMENTINE\n\t\t(calling)\n\tAnd some cream, please.\n\nClementine looks around the place.  Her eyes meet Joel's\nbefore he is able to look away.  She smiles vaguely.  He\nlooks embarrassed, then down at his journal.  Clementine\npulls a book from her purse and starts to read.  Joel glances\nup, tries to see the cover.  It's blue.  He can't read the\ntitle.\n\nEXT. BEACH - DAY\n\nJoel stares out at the ocean.  Far down the beach Clementine\nstares at it, too.  Joel glances sideways at her then back at\nthe ocean.\n\nEXT. MONTAUK TRAIN STATION PLATFORM - LATE AFTERNOON\n\nJoel sits on the bench waiting for a train.  Clementine\nenters the platform, sees Joel, the only other person there.\nShe waves, sort of goofily enthusiastic, playing as if\nthey're old friends.  He waves back, embarrassed.  She takes\na seat on a bench far down the platform.  Joel stares at his\nhands, pulls out his journal and tries to write in order to\nconceal his awkwardness.\n\nINT. TRAIN - A BIT LATER\n\nJoel sits at the far end of the empty car and watches the\nslowly passing desolate terrain.  After a moment the door\nbetween cars opens and Clementine enters.  Joel looks up.\nClementine is not looking at him; she busies herself deciding\nwhere to sit.  She settles on a seat at the opposite end of\nthe car.  Joel looks out the window.  He feels her watching\nhim.  The train is picking up speed.  Finally:\n\n\t\tCLEMENTINE\n\t\t(calling over the rumble)\n\tHi!\n\nJoel looks over.\n\n\t\tJOEL\n\tI'm sorry.\n\n\t\tCLEMENTINE\n\tWhy?\n\n\t\tJOEL\n\tWhy what?\n\n\t\tCLEMENTINE\n\tWhy are you sorry?  I just said hi.\n\n\t\tJOEL\n\tNo, I didn't know if you were talking to\n\tme, so...\n\nShe looks around the empty car.\n\n\t\tCLEMENTINE\n\tReally?\n\n\t\tJOEL\n\t\t(embarrassed)\n\tWell, I didn't want to assume.\n\n\t\tCLEMENTINE\n\tAw, c'mon, live dangerously.  Take the\n\tleap and assume someone is talking to you\n\tin an otherwise empty car.\n\n\t\tJOEL\n\tAnyway.  Sorry.  Hi.\n\nClementine makes her way down the aisle towards Joel.\n\n\t\tCLEMENTINE\n\tIt's okay if I sit closer?  So I don't\n\thave to scream.  Not that I don't need to\n\tscream sometimes, believe me.\n\t\t(pause)\n\tBut I don't want to bug you if you're\n\ttrying to write or something.\n\n\t\tJOEL\n\tNo, I mean, I don't know.  I can't really\n\tthink of much to say probably.\n\n\t\tCLEMENTINE\n\tOh.  So...\n\nShe hesitates in the middle of the car, looks back where she\ncame from.\n\n\t\tJOEL\n\tI mean, it's okay if you want to sit down\n\there.  I didn't mean to --\n\n\t\tCLEMENTINE\n\tNo, I don't want to bug you if you're\n\ttrying to --\n\n\t\tJOEL\n\tIt's okay, really.\n\n\t\tCLEMENTINE\n\tJust, you know, to chat a little, maybe.\n\tI have a long trip ahead of me.\n\t\t(sits across aisle from Joel)\n\tHow far are you going?  On the train, I\n\tmean, of course.\n\n\t\tJOEL\n\tRockville Center.\n\n\t\tCLEMENTINE\n\tGet out!  Me too!  What are the odds?\n\n\t\tJOEL\n\tThe weirder part is I think actually I\n\trecognize you.  I thought that earlier in\n\tthe diner.  That's why I was looking at\n\tyou.  You work at Borders, right?\n\n\t\tCLEMENTINE\n\tUcch, really?  You're kidding.  God.\n\tBizarre small world, huh?  Yeah, that's\n\tme: book slave there for, like, five\n\tyears now.\n\n\t\tJOEL\n\tReally?  Because --\n\n\t\tCLEMENTINE\n\tJesus, is it five years?  I gotta quit\n\tright now.\n\n\t\tJOEL\n\t-- because I go there all the time.  I\n\tdon't think I ever saw you before.\n\n\t\tCLEMENTINE\n\tWell, I'm there.  I hide in the back as\n\tmuch as is humanly possible.  You have a\n\tcell phone?  I need to quit right this\n\tminute.  I'll call in dead.\n\n\t\tJOEL\n\tI don't have one.\n\n\t\tCLEMENTINE\n\tI'll go on the dole.  Like my daddy\n\tbefore me.\n\n\t\tJOEL\n\tI noticed your hair.  I guess it made an\n\timpression on me, that's why I was pretty\n\tsure I recognized you.\n\n\t\tCLEMENTINE\n\tAh, the hair.\n\t\t(pulls a strand in front of her\n\t\t eyes, studies it)\n\tBlue, right?  It's called Blue Ruin.  The\n\tcolor.  Snappy name, huh?\n\n\t\tJOEL\n\tI like it.\n\n\t\tCLEMENTINE\n\tBlue ruin is cheap gin in case you were\n\twondering.\n\n\t\tJOEL\n\tYeah.  Tom Waits says it in --\n\n\t\tCLEMENTINE\n\tExactly!  Tom Waits.  Which song?\n\n\t\tJOEL\n\tI can't remember.\n\n\t\tCLEMENTINE\n\tAnyway, this company makes a whole line\n\tof colors with equally snappy names.  Red\n\tMenace, Yellow Fever, Green Revolution.\n\tThat'd be a job, coming up with those\n\tnames.  How do you get a job like that?\n\tThat's what I'll do.  Fuck the dole.\n\n\t\tJOEL\n\tI don't really know how --\n\n\t\tCLEMENTINE\n\tPurple Haze, Pink Eraser.\n\n\t\tJOEL\n\tYou think that could possibly be a full\n\ttime job?  How many hair colors could\n\tthere be?\n\n\t\tCLEMENTINE\n\t\t(pissy)\n\tSomeone's got that job.\n\t\t(excited)\n\tAgent Orange!  I came up with that one.\n\tAnyway, there are endless color\n\tpossibilities and I'd be great at it.\n\n\t\tJOEL\n\tI'm sure you would.\n\n\t\tCLEMENTINE\n\tMy writing career!  Your hair written by\n\tClementine Kruczynski.\n\t\t(thought)\n\tThe Tom Waits album is Rain Dogs.\n\n\t\tJOEL\n\tYou sure?  That doesn't sound --\n\n\t\tCLEMENTINE\n\tI think.  Anyway, I've tried all their\n\tcolors.  More than once.  I'm getting too\n\told for this.  But it keeps me from\n\thaving to develop an actual personality.\n\tI apply my personality in a paste.  You?\n\n\t\tJOEL\n\tOh, I doubt that's the case.\n\n\t\tCLEMENTINE\n\tWell, you don't know me, so... you don't\n\tknow, do you?\n\n\t\tJOEL\n\tSorry.  I was just trying to be nice.\n\n\t\tCLEMENTINE\n\tYeah, I got it.\n\nThere's a silence.\n\n\t\tCLEMENTINE (CONT'D)\n\tMy name's Clementine, by the way.\n\n\t\tJOEL\n\tI'm Joel.\n\n\t\tCLEMENTINE\n\tNo jokes about my name?  Oh, you wouldn't\n\tdo that; you're trying to be nice.\n\n\t\tJOEL\n\tI don't know any jokes about your name.\n\n\t\tCLEMENTINE\n\tHuckleberry Hound?\n\n\t\tJOEL\n\tI don't know what that means.\n\n\t\tCLEMENTINE\n\tHuckleberry Hound!  What, are you nuts?\n\n\t\tJOEL\n\tI'm nut nuts.\n\n\t\tCLEMENTINE\n\t\t(singing)\n\tOh my darlin', oh my darlin', oh my\n\tdarlin' Clementine?  No?\n\n\t\tJOEL\n\tSorry.  It's a pretty name, though.  It\n\tmeans \"merciful\", right?\n\n\t\tCLEMENTINE\n\t\t(impressed)\n\tYeah.  Although it hardly fits.  I'm a\n\tvindictive little bitch, truth be told.\n\n\t\tJOEL\n\tSee, I wouldn't think that about you.\n\n\t\tCLEMENTINE\n\t\t(pissy)\n\tWhy wouldn't you think that about me?\n\n\t\tJOEL\n\tOh.  I don't know.  I was just... I don't\n\tknow.  I was... You seemed nice, so --\n\n\t\tCLEMENTINE\n\tNow I'm nice?  Don't you know any other\n\tadjectives?  There's careless and snotty\n\tand overbearing and argumentative...\n\tmumpish.\n\n\t\tJOEL\n\tWell, anyway... Sorry.\n\nThey sit in silence for a while.\n\n\t\tCLEMENTINE\n\tI just don't think \"nice\" is a\n\tparticularly interesting thing to be.\n\nThe conductor enters the car.\n\n\t\tCONDUCTOR\n\tTickets.\n\nJoel hands the conductor his ticket.  The conductor punches\nit and hands it back.\n\n\t\tCLEMENTINE\n\tWhat is nice, anyway?  I mean, besides an\n\tadjective?  I guess it can be an adverb,\n\tsort of.\n\nThe conductor turns to Clementine.  She fishes in her bag.\n\n\t\tCLEMENTINE (CONT'D)\n\tIt doesn't reveal anything.  Nice is\n\tpandering.  Cowardly.\n\n\t\tCLEMENTINE (CONT'D)\n\tAnd life is more interesting than that.\n\tOr should be.  Jesus God, I hope it is...\n\tsomeday.\n\t\t(to conductor)\n\tI know it's here.\n\nThe conductor and Joel watch as she gets more agitated.\n\n\t\tCLEMENTINE (CONT'D)\n\tI don't need nice.  I don't need myself\n\tto be it and I don't need anyone else to\n\tbe it at me.\n\n\t\tJOEL\n\tOkay.\n\n\t\tCLEMENTINE\n\tShit.  Shit.  I know it's here.  Hold on.\n\nShe dumps the contents of the bag onto the seat and sifts\nfrantically through.  Joel sees the book she was reading in\nthe diner.  It's The Play by Stephen Dixon.\n\n\t\tCLEMENTINE (CONT'D)\n\tDamn it.  DAMN IT!\n\t\t(there it is)\n\tOh.  Here.\n\nShe hands the conductor the tickets, smiles sweetly.  He\npunches it, hands it back to her, and walks away.\n\n\t\tCONDUCTOR\n\tNext stop Southampton.\n\nThe conductor heads into the next car.  Clementine shoves\nstuff back into her purse.  Her hands are a little shaky.\nShe pulls a airline-sized bottle of alcohol from her pocket,\nopens it, and downs it.  Joel is watching all of this but\npretending not to.  She looks out the window for a while.\nThe train pulls into the station.  The doors open.  Nobody\ngets on.  The doors close.  The train pulls out.\n\n\t\tCLEMENTINE\n\tJoel?  It's Joel, right?\n\n\t\tJOEL\n\tYes?\n\n\t\tCLEMENTINE\n\tI'm sorry I... yelled at you.  Was it\n\tyelling?  I can't really tell.  Whatever,\n\tI'm a little out of sorts today.\n\n\t\tJOEL\n\tThat's okay.\n\n\t\tCLEMENTINE\n\t\t(stares out window)\n\tMy embarrassing admission is I really\n\tlike that you're nice.  Right now,\n\tanyway.  I can't tell from one moment to\n\tthe next what I'm going to like.  But\n\tright now I'm glad you said, \"that's\n\tokay\" to me.  That was nice of you.\n\n\t\tJOEL\n\tIt's no problem.  Anyway, I have some\n\tstuff I need to --\n\n\t\tCLEMENTINE\n\tOh, okay.  Well, sure, I'll just...\n\t\t(stands, throws bag over\n\t\t shoulder)\n\tTake care, then.\n\n\t\tJOEL\n\t\t(pulling journal from\n\t\t briefcase)\n\tProbably see you at the book store.\n\n\t\tCLEMENTINE\n\t\t(heading toward other end of\n\t\t car)\n\tUnless I get that hair-color-naming job.\n\nClementine sits and stares out the window.\n\nINT. TRAIN - LATER\n\nThere are a few more people in the car now.  Clementine has\ninched a few seats closer to Joel.  She watches him.  His\nhead is immersed in his journal.\n\nINT. TRAIN - LATER\n\nIt's dark out.  The train is pretty crowded.  Joel stares out\nthe window.  Clementine sits closer still to Joel, eyes him.\n\nEXT. TRAIN STATION - EVENING\n\nThe doors open and Joel emerges along with others.  He heads\nto the parking lot, arrives at the car.  There's a big dented\nscrape along the driver's side.  He gets in.\n\nINT. CAR - MOMENTS LATER\n\nJoel drives.  He passes Clementine walking.  She looks cold.\nHe considers, slows, rolls down his window.\n\n\t\tJOEL\n\tHi.  I could give you a ride if you need.\n\n\t\tCLEMENTINE\n\tNo, that's okay.  Thanks, though.\n\n\t\tJOEL\n\tYou're sure?  It's cold.\n\n\t\tCLEMENTINE\n\tI don't want to take you out of your way.\n\n\t\tJOEL\n\tIt's okay.\n\n\t\tCLEMENTINE\n\tYeah?\n\nHe pulls over.  She climbs in.  They drive.\n\n\t\tJOEL\n\tWhere do you live?\n\n\t\tCLEMENTINE\n\tYou're not a stalker or anything, right?\n\n\t\tJOEL\n\tWell, I probably wouldn't say if I were,\n\tbut no.\n\n\t\tCLEMENTINE\n\tYou can't be too careful.  I've been\n\tstalked.  I've been told I'm highly\n\tstalkable.  I don't need that.\n\n\t\tJOEL\n\tI'm not a stalker.\n\n\t\tCLEMENTINE\n\t\t(beat)\n\tYou know Wilmont?\n\n\t\tJOEL\n\tYeah.\n\n\t\tCLEMENTINE\n\tWilmont.  Near the high school.\n\nJoel turns.  They drive in silence.\n\n\t\tCLEMENTINE (CONT'D)\n\tLook, I'm very sorry I came off sort of\n\tnutso.  I'm not really.\n\n\t\tJOEL\n\tIt's okay.  I didn't think you were.\n\nThere's a silence.\n\n\t\tCLEMENTINE\n\tSo you like bookstores, huh?\n\n\t\tJOEL\n\tI like to read.\n\n\t\tCLEMENTINE\n\tMe too.  It is Rain Dogs, by the way.\n\n\t\tJOEL\n\tYeah?  I can't remember that album very\n\twell.  I remember liking it.  But --\n\n\t\tCLEMENTINE\n\tThe song's 9th and Hennepin.  I spent\n\tmost of the train ride trying to\n\tremember.  \"Till you're full of rag water\n\tand bitters and blue ruin/And you spill\n\tout/Over the side to anyone who'll\n\tlisten.\"  Remember?\n\n\t\tJOEL\n\tSort of, um...\n\n\t\tCLEMENTINE\n\tRemember?  \"And you take on the dreams of\n\tthe ones who have slept there/And I'm\n\tlost in the window/I hide on the\n\tstairway/I hang in the curtain/I sleep in\n\tyour hat...\"\n\t\t(starts to cry)\n\tOh, shit.  I'm so stupid.  Sorry.\n\n\t\tJOEL\n\tWhat?\n\n\t\tCLEMENTINE\n\tI'm just a bit of a wreck.  \"I sleep in\n\tyour hat\" makes me cry.\n\t\t(pointing to a house)\n\tMe.\n\nJoel pulls over.\n\n\t\tCLEMENTINE (CONT'D)\n\tThanks very much.  That was very nice of\n\tyou.\n\n\t\tJOEL\n\tWell, I wouldn't want to be --\n\n\t\tCLEMENTINE\n\tOh, geez, I'm full of shit.  I already\n\ttold you that.\n\t\t(pause)\n\tAnyway.  See Ya.\n\nClementine opens the car door.\n\n\t\tJOEL\n\tTake care.\n\n\t\tCLEMENTINE\n\t\t(turning back)\n\tHey, do you want to have a drink?  I have\n\tlots of drinks.  And I could --\n\n\t\tJOEL\n\tUm --\n\n\t\tCLEMENTINE\n\tNever mind.  Sorry, that was stupid.  I'm\n\tembarrassed.  Good night, Joel.\n\nINT. CLEMENTINE'S APARTMENT - A FEW MINUTES LATER\n\nJoel stands in the living room, somewhat nervously.  He tries\nto calm himself by focusing on the surroundings.  He looks at\nthe books on her shelves.  Clementine is in the kitchen.  We\nsee her as she passes by the doorway several times, preparing\ndrinks and chatting.\n\n\t\tCLEMENTINE\n\tThanks.  I like it, too.  Been here about\n\tfour years.  It's really cheap.  My\n\tdownstairs neighbor is old so she's\n\tquiet, which is great.  And the\n\tlandlord's sweet, which is bizarre, but\n\tgreat, and I have a little porch in the\n\tback, which is great, because I can read\n\tthere, and listen to my crickets and...\n\nClementine is in the living room now with two gin and tonics.\n\n\t\tCLEMENTINE (CONT'D)\n\tTwo blue ruins...\n\nJoel is looking at a framed black and white photograph of\ncrows flying.\n\n\t\tCLEMENTINE (CONT'D)\n\tYou like that?\n\n\t\tJOEL\n\tVery much.\n\n\t\tCLEMENTINE\n\tThis... someone gave that to me, just\n\tlike, recently.  I like it, too.  I like\n\tcrows.  I think I used to be a crow.\n\nShe caws and hands Joel a drink.\n\n\t\tJOEL\n\tThanks.  That was good, that crow sound.\n\n\t\tCLEMENTINE\n\tDo you believe in that stuff?\n\tReincarnation?\n\n\t\tJOEL\n\tI don't know.\n\n\t\tCLEMENTINE\n\tMe neither.  Oh, there's an inscription\n\ton the back.\n\t\t(takes it off the wall, reads:)\n\tThe way a crow/Shook down on me/The dust\n\tof snow/From a hemlock tree/Has given my\n\theart/A change of mood/And saved some\n\tpart/Of a day I rued.\n\n\t\tJOEL\n\tFrost?\n\n\t\tCLEMENTINE\n\t\t(impressed)\n\tYeah.  I'm not, like, a Robert Frost\n\tlover by any stretch.  His stuff seems\n\tstrictly grade school to me.  But this\n\tmade me cry for some reason.  Maybe\n\tbecause it is grade school.  Y'know?\n\n\t\tJOEL\n\tIt's pretty.\n\n\t\tCLEMENTINE\n\tI miss grade school.  I don't know why\n\tI'm calling it grade school all of a\n\tsudden.  When I went we called it\n\telementary school.  But I like grade\n\tschool better.  Sounds like something\n\tsomeone from the forties would call it.\n\tI'd like to be from then.  Everyone wore\n\thats.  Anyway, cheers!\n\n\t\tJOEL\n\tCheers.\n\nThey click glasses.  Clementine giggles and takes a big gulp\nof her drink.  Joel sips.  She plops down on the couch and\npulls her boots off.\n\n\t\tCLEMENTINE\n\tGod, that feels so fucking good.  Take\n\tyours off.\n\n\t\tJOEL\n\tI'm fine.\n\n\t\tCLEMENTINE\n\tYeah?  Well, have a seat, anyway.\n\nJoel sits in a chair across the room.  Clementine finishes\nher drink.\n\n\t\tCLEMENTINE (CONT'D)\n\tReady for another?\n\n\t\tJOEL\n\tNo, I'm okay for now.\n\nShe heads toward the kitchen with her glass.\n\n\t\tCLEMENTINE\n\tWell, I'm ready.  Put some music on.\n\nJoel crosses to the CD's and studies them.\n\n\t\tJOEL\n\tWhat do you want to hear?\n\n\t\tCLEMENTINE (O.S.)\n\tYou pick it.\n\n\t\tJOEL\n\tYou just say.  I'm not really --\n\n\t\tCLEMENTINE (O.S.)\n\tI don't know!  I can't see them from\n\there, Joel!  Just pick something good.\n\nJoel studies the unfamiliar CD's.  He picks up Bang On a Can\nperforming Brian Eno's Music for Airports to look at.\nClementine reenters with her drink.\n\n\t\tCLEMENTINE (CONT'D)\n\tOh, excellent choice.\n\nShe grabs it and sticks it in the CD player.  The music is\ndreamy and haunting and slow.  Clementine falls back onto the\ncouch, closes her eyes and sips her drink.\n\n\t\tCLEMENTINE (CONT'D)\n\tMmmmmmm.  Way to go, Joel.  You pick\n\tgood.\n\nJoel sits down in his chair and drinks.  There's a silence,\nwhich seems fine to Clementine but makes Joel anxious.\n\n\t\tJOEL\n\tWell, I should probably get going.\n\n\t\tCLEMENTINE\n\tNo, stay.  Just for a little while.\n\t\t(opens her eyes, brightly)\n\tRefill?\n\n\t\tJOEL\n\tNo.  I --\n\n\t\tCLEMENTINE\n\tI know a man who needs a refill.\n\nShe grabs Joel's drink from his hand, takes it into the\nkitchen.\n\n\t\tCLEMENTINE (CONT'D) (O.S.) (CONT'D)\n\tGod bless alcohol, is what I say.  Where\n\twould I be without it.  Oh, Jesus, Mary,\n\tand Joseph, maybe I don't want to think\n\tabout that.\n\nShe giggles.  Joel looks around the room again.  There are\nseveral potatoes dressed as women in beautiful handmade\ncostumes: a nurse potato, a stripper potato, a schoolteacher\npotato, a housewife potato.  Clementine returns with Joel's\ndrink and a refill for herself.\n\n\t\tJOEL\n\tThanks.\n\n\t\tCLEMENTINE\n\tDrink up, young man.  It'll make the\n\twhole seduction part less repugnant.\n\nJoel looks a little alarmed.\n\n\t\tCLEMENTINE (CONT'D)\n\tI'm just kidding.  C'mon.\n\nShe sits back on the couch, closes her eyes.  Joel watches\nher, looks at her breasts.  She opens her eyes, smiles\ndrunkenly at him.\n\n\t\tCLEMENTINE (CONT'D)\n\tY'know, I'm sort of psychic.\n\n\t\tJOEL\n\tYeah?\n\n\t\tCLEMENTINE\n\tWell, I go to a psychic and she's always\n\ttelling me I'm psychic.  She should know.\n\tDo you believe in that stuff?\n\n\t\tJOEL\n\tI don't know.\n\n\t\tCLEMENTINE\n\tMe neither.  But sometimes I have\n\tpremonitions, so, I don't know.  Maybe\n\tthat's just coincidence.  Right?  Y'know,\n\tyou think something and then it happens,\n\tor you think a word and then someone says\n\tit?  Y'know?\n\n\t\tJOEL\n\tYeah, I don't know.  It's hard to know.\n\n\t\tCLEMENTINE\n\tExactly.  Exactly!  That's exactly my\n\tfeeling about it.  It's hard to know.\n\tLike, okay, but how many times do I think\n\tsomething and it doesn't happen?  That's\n\twhat you're saying, right?  You forget\n\tabout those times.  Right?\n\n\t\tJOEL\n\tYeah, I guess.\n\n\t\tCLEMENTINE\n\t\t(dreamy beat)\n\tBut I think I am.  I like to think I am.\n\n\t\tCLEMENTINE (CONT'D)\n\tIt's helpful to think there's some order\n\tto things.  You're kind of closed\n\tmouthed, aren't you?\n\n\t\tJOEL\n\tSorry.  My life isn't that interesting.\n\tI go to work.  I go home.  I don't know\n\twhat to say.\n\n\t\tCLEMENTINE\n\tOh.\n\t\t(considers this)\n\tDoes that make you sad?  Or anxious?  I'm\n\talways anxious thinking I'm not living my\n\tlife to the fullest, y'know?  Taking\n\tadvantage of every possibility?  Just\n\tmaking sure that I'm not wasting one\n\tsecond of the little time I have.\n\n\t\tJOEL\n\tI think about that.\n\nShe looks at him really hard for a long moment.  Joel tries\nto hold her gaze, but can't.  He looks down at his drink.\nClementine starts to cry again.\n\n\t\tCLEMENTINE\n\tYou're really nice.  I'm sorry I yelled\n\tat you before about it.  God, I'm an\n\tidiot.\n\n\t\tJOEL\n\tI do have a tendency to use that word too\n\tmuch.\n\n\t\tCLEMENTINE\n\tI like you.  That's the thing about my\n\tpsychic thing.  I think that's my\n\tgreatest psychic power, that I get a\n\tsense about people.  My problem is I\n\tnever trust it.  But I get it.  And with\n\tyou I get that you're a really good guy.\n\n\t\tJOEL\n\tThanks.\n\n\t\tCLEMENTINE\n\tAnd, anyway, you sell yourself short.  I\n\tcan tell.  There's a lot of stuff going\n\ton in your brain.  I can tell.  My\n\tgoal... can I tell you my goal?\n\n\t\tJOEL\n\tYeah.\n\n\t\tCLEMENTINE\n\t\t(ala Paul Simon)\n\tWhat's the goal, Joel?\n\t\t(laughs)\n\tMy goal, Joel, is to just let it flow\n\tthrough me?  Do you know what I mean?\n\tIt's like, there's all these emotions and\n\tideas and they come quick and they change\n\tand they leave and they come back in a\n\tdifferent form and I think we're all\n\ttaught we should be consistent.  Y'know?\n\tYou love someone -- that's it.  Forever.\n\tYou choose to do something with your life\n\t-- that's it, that's what you do.  It's a\n\tsign of maturity to stick with that and\n\tsee things through.  And my feeling is\n\tthat's how you die, because you stop\n\tlistening to what is true, and what is\n\ttrue is constantly changing.  You know?\n\n\t\tJOEL\n\tYeah.  I think so.  It's hard to --\n\n\t\tCLEMENTINE\n\tLike I wanted to talk to you.  I didn't\n\tneed any more reason to do it.  Who knows\n\twhat bigger cosmic reason might exist?\n\n\t\tJOEL\n\tYeah.\n\n\t\tCLEMENTINE\n\tYou're very nice.  God, I have to stop\n\tsaying that.  You're nervous around me,\n\thuh?\n\n\t\tJOEL\n\tNo.\n\n\t\tCLEMENTINE\n\tI'm nervous.  You don't need to be\n\tnervous around me, though.  I like you.\n\tDo you think I'm repulsively fat?\n\n\t\tJOEL\n\tNo, not at all.\n\n\t\tCLEMENTINE\n\tI don't either.  I used to.  But I'm\n\tthrough with that.  Y'know, if I don't\n\tlove my body, then I'm just lost.  You\n\tknow?\n\n\t\tCLEMENTINE (CONT'D)\n\tWith all the wrinkles and scars and the\n\tgeneral falling apart that's coming\n\t'round the bend.\n\t\t(beat)\n\tSo, I've been seeing this guy...\n\nJoel looks slightly crestfallen.\n\n\t\tCLEMENTINE (CONT'D)\n\t\t(off his reaction)\n\tWell, for the last week, anyway!  He's\n\tkind of a kid.  Kind of a goofball, but\n\the's really stuck on me, which is\n\tflattering.  Who wouldn't like that?  And\n\the's, like, a dope, but he says these\n\tsmart and moving things sometimes, out of\n\tnowhere, that just break my heart.  He's\n\tthe one who gave me that crow photograph.\n\n\t\tJOEL\n\tOh, yeah.\n\n\t\tCLEMENTINE\n\tThat made me cry.  But, anyway, we went\n\tup to Boston, because I had this urge to\n\tlie on my back on the Charles River.  It\n\tgets frozen this time of year.\n\n\t\tJOEL\n\tThat's scary sounding.\n\n\t\tCLEMENTINE\n\tExactly!  I used to do it in college and\n\tI had this urge to go do it again, so I\n\tgot Patrick and we drove all night to get\n\tthere and he was sweet and said nice\n\tthings to me, but I was really\n\tdisappointment to be there with him.\n\tY'know?  And that's where psychic stuff\n\tcomes in.  Like, it just isn't right with\n\thim.  Y'know?\n\n\t\tJOEL\n\tI think so.\n\n\t\tCLEMENTINE\n\tI don't believe in that soulmate crap\n\tanymore, but... he says so many great\n\tthings.  We like the same writers.  This\n\twriter Stephen Dixon he turned me on to.\n\tAnd he's cute.  It's fucked up.  Joel,\n\tyou should come up to the Charles with me\n\tsometime.\n\n\t\tJOEL\n\tOkay.\n\n\t\tCLEMENTINE\n\tYeah?  Oh, great!\n\nShe sits closer to him.\n\n\t\tCLEMENTINE (CONT'D)\n\tI'll pack a picnic -- a night picnic --\n\tnight picnics are different -- and --\n\n\t\tJOEL\n\t\t(shy)\n\tSounds good.  But right now I should go.\n\n\t\tCLEMENTINE\n\t\t(pause)\n\tYou should stay.\n\n\t\tJOEL\n\tI have to get up early in the morning\n\ttomorrow, so...\n\n\t\tCLEMENTINE\n\t\t(beat)\n\tOkay.\n\nJoel puts on his overcoat.  Clementine heads to the phone\ntable, pulls out a notepad.\n\n\t\tCLEMENTINE (CONT'D)\n\tI would like you to call me.  Would you\n\tdo that?  I would like that.\n\n\t\tJOEL\n\tYes.\n\nShe scribbles her phone number, hands it to him.  He puts it\nin his pocket.  He stands there uncomfortably for a moment,\nthen forces himself to speak.\n\n\t\tJOEL (CONT'D)\n\tI don't think your personality comes out\n\tof a tube.  I think the hair is just... a\n\tpretty topping.\n\nShe tears up, swallows, and kisses him on the cheek.  He's\nsurprised and pleased and nervous.\n\n\t\tJOEL (CONT'D)\n\t\t(shyly formal)\n\tSo, I enjoyed meeting you.\n\n\t\tCLEMENTINE\n\tYou'll call me, right?\n\n\t\tJOEL\n\tYeah.\n\n\t\tCLEMENTINE\n\tWhen?\n\n\t\tJOEL\n\tTomorrow?\n\n\t\tCLEMENTINE\n\tTonight.  Just to test out the phone\n\tlines and all.\n\n\t\tJOEL\n\tOkay.\n\nWe stay with Clementine as she watches Joel tromping through\nthe snow and getting in his car.\n\nINT. JOEL'S CAR - NIGHT\n\nJoel speeds through the suburban Rockville Center\nneighborhood.  There is no snow on the ground.  He seems\ndifferent, somehow foggy and disoriented.\n\nSUBTITLE:  THREE DAYS EARLIER\n\nHe arrives at his apartment building and parks.\n\nEXT. JOEL'S APARTMENT BUILDING - CONTINUOUS\n\nJoel gets out of his car, spots a van parked across the\nstreet.  There are two dark figures inside.\n\n\t\tVOICE-OVER\n\tThem.\n\nHe hurries inside the building.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel enters, dumps his overcoat on a chair, turns off the\nlights, crosses to look furtively out the window.  It's\nsnowing in large flakes which seem to fall only in the beam\nof a streetlight.\n\n\t\tJOEL\n\tIt was snowing.\n\n\t\tVOICE-OVER\n\tThere are two of them.  Couldn't make\n\tthem out.  The orange glow of a\n\tcigarette.\n\nJoel squints to see inside the van.  Two dark figures talk.\nOne sucks on a cigarette and s dim orange light momentarily\nilluminates the interior.  The figure in the driver seat\nrolls down his window and gives a cheery wave to Joel.\n\n\t\tJOEL\n\tThe driver waved.  So casual, friendly.\n\n\t\tVOICE-OVER\n\tI'm like a joke to them.\n\nJoel pulls away from the window, his face blanched.\n\n\t\tVOICE-OVER\n\tI guess they figure they can act like\n\tthey want.  They don't have to worry\n\tabout me remembering.\n\nHe paces, mulling things over.  As he does, the scene starts\nto change, almost as if it is drying out.\n\n\t\tJOEL\n\tI might be making a mistake.\n\n\t\tVOICE-OVER\n\tMaybe I'm making a mistake.  Maybe I just\n\tneed to learn to live with this.  First\n\tof all, I'll get over it.  Secondly, it\n\thappened.  Those who do not remember\n\thistory are condemned to repeat it.  Who\n\tsaid that?  Churchill?  I'm not sure.\n\tBut I don't care.  She did it to me.  I\n\thave to rid myself of this.  Fuck her.\n\n\t\tJOEL\n\tFuck you, Clementine.\n\nThe colors bleach, the surroundings become slightly vague.\nEven Joel's persona and voice-over seem to alter, his\nemotional intensity becoming diffused.  Joel does not seem\naware of this.  He stops pacing, takes a small vial from his\npocket, dumps the lone pill onto his palm.  He looks at it.\nIt's pink.  There's some illegible initials stamped on it.\n\n\t\tJOEL (CONT'D)\n\tPink.\n\t\t(beat)\n\tThere was a number on it.  I remember.\n\tAL 1718?\n\t\t(beat)\n\tI have to follow through with this.  I\n\thave no choice.\n\n\t\tVOICE-OVER\n\tThe pill was pink, I remember.  It had\n\tsome letters and numbers on it.  What\n\twere they?  AL 1718?  AL something.  Four\n\tdigits.  I don't like taking pills when I\n\tdon't know what they are.  I have no\n\tchoice.\n\nHe swallows it, peeks out the window again, takes off his\nclothes, slips into a pair of pajamas fresh from the store\npackaging.  He sits on the edge of the bed, dials the phone.\n\n\t\tJOEL (CONT'D)\n\tWe're sorry, the number you have\n\tdialed...\n\t\t(beat)\n\tScrew you, Clementine, for doing this ...\n\n\t\tRECORDED VOICE\n\tWe're sorry, the number you have dialed\n\tis no longer in service.  If you think\n\tyou have reached this recording in error\n\t-\n\n\t\tJOEL (CONT'D)\n\tBye.\n\nJoel hangs up and lies on his back on the bed.  By now the\nscene is lifeless, almost a husk.  He hears the apartment\nbuilding door open.  He hears footsteps.\n\n\t\tJOEL (CONT'D)\n\tIt's them.\n\n\t\tVOICE-OVER\n\tIt's too late.\n\nHis eyelids are getting heavy.  He closes his eyes.\n\nBLACK.\n\nHe hears a key in his apartment door.\n\n\t\tJOEL (CONT'D)\n\tFuck.\n\nINT. BOOKSTORE - NIGHT\n\nJoel sits in the bookstore coffee shop.  It's a jarring\ntransition, visually and emotionally.  Joel is in the midst\nof some traumatic state of mind.\nHe fingers the vial with the pink pill in it as he watches\nClementine stack books on shelves.  Her hair is bright orange\nnow.\n\n\t\tJOEL\n\tI should maybe talk to you.\n\n\t\tVOICE-OVER\n\tClementine.  I should just maybe talk to\n\ther.\n\nJoel rises and heads toward Clementine.\n\n\t\tJOEL\n\tI love you and if you knew that... if I\n\ttold you what happened...  I'll explain\n\teverything, what we meant to each other.\n\tI'll tell you everything about our time\n\ttogether.  You'll know everything again\n\tand...\n\n\t\tVOICE-OVER\n\tMaybe if I just explain what happened, I\n\twouldn't have to go through this and I\n\tcould tell you everything and it would be\n\tlike you knew and we could rebuild and we\n\tcould be happy again and...\n\nRight before Joel gets there, Patrick, a skinny young man\napproaches Clementine.  Joel stops, watches.  The young man\nseems out of breath.  He glances over at Joel, then taps\nClementine on the shoulder.  She turns, annoyed, sees who it\nis and her face lights up.\n\n\t\tJOEL\n\tClementine.\n\n\t\tVOICE-OVER\n\tThat's your look for me.\n\nClementine giggles, stands and pokes Patrick playfully in the\nribs.\n\n\t\tPATRICK\n\tI just thought I'd say hi.  I was in the\n\tneighborhood.\n\n\t\tCLEMENTINE\n\tYou were not.\n\n\t\tPATRICK\n\tI was not.\n\nJoel is mesmerized by their familiarity.  As he stands there,\nthe scene starts to dry out.\nClementine and Patrick continue their flirtation but it's\nturning lifeless, as if they are just reciting lines.  The\nbookstore start to lose its color and immediacy.\n\n\t\tCLEMENTINE\n\tCome over after I'm done here?\n\n\t\tPATRICK\n\tI can't.  I want to, but I have to study.\n\n\t\tCLEMENTINE\n\tYou rat.\n\n\t\tPATRICK\n\tI really want to, but tonight's\n\timportant.  Test tomorrow.\n\n\t\tJOEL\n\tHow could she have done this to me?  How\n\tcould anyone do this to anyone?\n\n\t\tCLEMENTINE\n\t\t(to Patrick)\n\tYou didn't say anything about my hair.\n\n\t\tPATRICK\n\tIt's so cool.  You're by far the most\n\tsensational person in the room.\n\n\t\tCLEMENTINE\n\tIn the room?\n\n\t\tPATRICK\n\tIn the world.\n\nJoel seems dazed, in some sort of dream confusion, as he\nrealizes the world around him is looking increasingly odd.\n\n\t\tJOEL\n\tWhat's happening here?\n\t\t(looks at watch; it's 9:30)\n\tOh, God!  I have to go home.  They'll be\n\tthere soon.\n\nJoel turns to leave.\n\nINT. JOEL'S CAR - NIGHT\n\nJoel drives fast, recklessly.  The intensity is back.  He's\nweeping as he drives.\n\n\t\tJOEL\n\tGotta get home.  How could she do this to\n\tme?\n\tHow could she not care about what we\n\tmeant to each other.  What a fuck!  What\n\ta fucking monster she is!\n\n\t\tVOICE-OVER\n\tOh, God.  I miss her.  I can't believe\n\tshe's with that guy now!  I'm never going\n\tto see her again.  I love her so much.\n\tWhat a fucking monster she is!\n\nThe scene is faded as he parks in front of his apartment\nbuilding, and gets out of the car.  Joel spots the parked\nvan.  We've seen this before, but it's dried out now.\n\n\t\tJOEL\n\tThem.\n\nEXT. NEW YORK STREET - DAY\n\nJoel trudges along carrying two big trash bags full of stuff.\nHe's been crying.  He looks behind him and finds himself\nlooking out the window of his apartment at the dark van on\nthe snowy street.  He turns back to the New York Street and\nspots the address he was looking for: 610 11th Avenue.\n\nINT. WAITING ROOM - DAY\n\nJoel sits in the small room with his bags.  A woman across\nfrom him cradles a box full of belongings in her lap.  Her\neyes are red from crying.  Mary, the receptionist, pokes her\nhead through her window into the waiting room.\n\n\t\tMARY\n\tHello again, Mr. Barish.  Good, you've\n\tgot your stuff.\n\nINT. HALLWAY - DAY\n\nJoel walks with his bags behind Mary.\n\n\t\tMARY\n\t\t(not looking back)\n\tHow are you today?\n\t\t(at lab)\n\tHere we are.\n\nINT. LABORATORY - DAY\n\nJoel enters.  Mierzwiak stands there with Stan in his lab\ncoat.\n\n\t\tMIERZWIAK\n\tAh, Mr. Barish.  This is Stan.  He'll be\n\tin charge of your procedure tonight.\n\nStan nods professionally.\n\n\t\tSTAN\n\tMr. Barish.\n\n\t\tJOEL\n\tHow exactly is this going to work\n\ttonight?\n\nAs Mierzwiak talks, the room colors start to fade,\nMierzwiak's tone of voice is also affected; it becomes dry\nand monotonous.\n\n\t\tMIERZWIAK\n\tWe'll start with your most recent\n\tmemories and go backwards -- There is an\n\temotional core to each of our memories --\n\tAs we eradicate this core, it starts its\n\tdegradation process --  By the time you\n\twake up in the morning, all memories\n\twe've targeted will have withered and\n\tdisappeared.  Like a dream upon waking.\n\n\t\tJOEL\n\tIs there any sort of risk of brain\n\tdamage?\n\n\t\tMIERZWIAK\n\tWell, technically, the procedure itself\n\tis brain damage, but on a par with a\n\tnight of heavy drinking.  Nothing you'll\n\tmiss.\n\nJoel looks quizzically at the eroding environment.  Suddenly\nhe gets it.\n\n\t\tJOEL\n\tIt's happening now!  I'm already in my\n\tbrain.\n\nMierzwiak looks at the fading room.\n\n\t\tMIERZWIAK\n\tYes, I suppose you are.\n\t\t(back in his faded memory\n\t\t persona)\n\tSo, let's get started -- If we want the\n\tprocedure underway tonight, we have some\n\twork to do.\n\nJoel is sitting in a chair.  Electrodes connect him to some\nelectronic machinery monitored by Stan.  Mierzwiak watches\nfrom the corner.\n\n\t\tSTAN\n\tWe use the articles you brought to create\n\ta map of Clementine in your brain.\n\tTonight while you sleep we'll be able to\n\ttrace the map and erase.\n\n\t\tJOEL\n\tBut you're tracing and erasing now.  It's\n\talready started.  I'm home in my bed.\n\nStan pulls a snow globe from one of Joel's bags, shows it to\nJoel.  The equipment registers Joel's reaction.\n\n\t\tSTAN\n\tVery good.\n\nStan pulls out a potato dressed as a Vegas showgirl.  Joel\nstudies it.  The machines register his response.\n\n\t\tMIERZWIAK\n\tWe'll dispose of these mementos when\n\twe're done here.  That way you won't be\n\tconfused later by their unexplainable\n\tpresence in your home.\n\nStan pulls out a coffee mug with a photo of Clementine\nprinted on it.  Joel looks at the cup.  The machines record\nhis reaction.\n\n\t\tSTAN\n\tGood.  We're getting healthy read-outs.\n\nThe room, Stan, and Mierzwiak are now vague and wispy.\n\n\t\tSTAN'S VOICE\n\tPatrick, do me a favor --\n\nJoel is watching Stan.  Stan is not speaking, yet his voice\ncontinues.\n\n\t\tSTAN'S VOICE (CONT'D)\n\t-- and check the voltage levels, I'm not\n\twiping as clean as I would like here.\n\nJoel looks up.  Stan's voice seems to be coming from above.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel lies on his back in fresh pajamas.  His eyes are closed\nand electrodes connect his head to several machines.  The\nmachines are operated by Stan, now in grubby street clothes\nand in need of a shave, and by Patrick, dressed similarly.\nThe monitor on one of the machines traces a myriad of light\nblips running like streams through an image of Joel's brain.\nStan presses buttons and operates a joystick, aiming for the\nlines.  Patrick (who we saw earlier with Clementine at the\nbookstore) studies a meter on one of the machines.\n\n\t\tPATRICK\n\tThe voltage looks fine.\n\n\t\tSTAN\n\tThen check the connections.\n\nPatrick fiddles with some jacks.\n\n\t\tPATRICK\n\tDoes that help?\n\n\t\tSTAN\n\tYeah, that looks better.  Thanks.\n\nINT. LAB ROOM - DAY\n\nThe memory is becoming vague, characters' affects flat.  Stan\npulls out a pile of loose-leaf pages.  Mierzwiak smiles.\n\n\t\tMIERZWIAK\n\tAh, your journal.  This will be\n\tinvaluable.\n\n\t\tSTAN\n\t\t(reading)\n\tDecember 15th, 2004.  I met someone\n\ttonight.  Oh, Christ:  I don't know what\n\tto do.  Her name is Clementine and she's\n\tamazing.  So alive and spontaneous and\n\tpassionate and sensitive.  Things with\n\tNaomi and I have been stagnant for so\n\tlong.\n\nThe scene is just a shell of itself as Stan rattles on.\n\n\t\tSTAN'S VOICE\n\tI think we got this one.  Let's push on.\n\nJoel looks up at the ceiling.\n\nINT. JOEL'S APARTMENT - DAY\n\nJoel, snapped into a new memory, cries as he fills two large\nplastic garbage bags with mementos of his relationship with\nClementine.  There are funny little gifts, wind-up toys, some\npotatoes dressed as women, some clothing Clementine has left\nthere, some CD's.  He pulls a big clump of pages out of his\nloose-leaf journal and dumps them in the bag.\n\nHe gets some clean loose-leaf paper and writes:\n\nDecember 15, 2004   Nothing much happened today.  I stayed\nhome.  Naomi worked on her dissertation.\n\nThe scene is fading as he continues to write.\n\nINT. HALLWAY - DAY\n\nJoel looks for an office number.  He finds it.  The plaque on\nthe door reads Lacuna Ltd.  Joel enters.\n\nINT. WAITING ROOM - DAY\n\nJoel enters the Lacuna waiting room.  Mary sits in the\nreception area.\n\n\t\tMARY\n\tMay I help you?\n\n\t\tJOEL\n\tMy name is Joel Barish.  I have an\n\tappointment.\n\n\t\tMARY\n\tPlease have a seat.  Dr. Mierzwiak will\n\tbe right with you.\n\nINT. OFFICE HALL - DAY\n\nMary leads Joel down the hall.\n\n\t\tMARY\n\t\t(without turning)\n\tHow are you today?\n\n\t\tJOEL\n\tNot great.\n\n\t\tMARY\n\t\t(at Mierzwiak's office)\n\tHere we are.\n\nJoel glimpses Mary smiling coquettishly at Mierzwiak.\n\nINT. MIERZWIAK'S OFFICE - DAY\n\nJoel and Mierzwiak are in the sitting area.  Joel looks at\nthe tape recorder.\n\n\t\tMIERZWIAK\n\tI'm sorry you saw one of our notification\n\tcards.  You never should have.\n\n\t\tJOEL\n\tWell... I did.\n\n\t\tMIERZWIAK\n\tWe can help you through this.  Why don't\n\tyou start now by telling me everything\n\tyou can remember about your relationship\n\twith Clementine.\n\n\t\tJOEL\n\t\t(thinks, then:)\n\tIt was a mess.  I don't know how it got\n\tthis way...\n\n\t\tPATRICK'S VOICE\n\tIt's kind of a dump, don't you think?\n\nJoel looks up, trying to locate the voice.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nPatrick is checking out the apartment.  Stan monitors the\nequipment.\n\n\t\tSTAN\n\t\t(uninterested)\n\tIt's an apartment.\n\n\t\tPATRICK\n\tNot a dump, then, but kind of plain.\n\tUninspired.  And there's a stale smell.\n\tSort of stuffy.  I don't know.  Stuffy.\n\n\t\tSTAN\n\tPatrick, let's just get through this.  We\n\thave a long night ahead of us.\n\n\t\tPATRICK\n\tYeah.\n\nPatrick returns to the bedside, focuses on the machines for a\nmoment.  He glances at the unconscious Joel.\n\n\t\tPATRICK (CONT'D)\n\tSo who do you think is better-looking, me\n\tor this guy?\n\nStan glances sideways at Patrick.\n\nINT. MIERZWIAK'S OFFICE - DAY\n\nMierzwiak sits with Joel in the sitting area.\n\n\t\tMIERZWIAK\n\tSo we'll need you to go home and bring in\n\teverything you ever received from\n\tClementine and anything that might remind\n\tyou of her...\n\nThe scene is faded and disappearing fast.  It's gone.\n\nINT. JOEL'S OFFICE - DAY\n\nJoel gets off the elevator and approaches the receptionist.\n\n\t\tJOEL\n\tSo then she just stops calling.\n\n\t\tVOICE-OVER\n\tI wasn't going to call her.  Not after\n\tthe way she was.\n\n\t\tJOEL\n\tAny messages, Carmen?\n\nCarmen the receptionist shakes her head.\n\nNext day: Joel approaches the receptionist.\n\n\t\tJOEL (CONT'D)\n\tAny messages for me, Carmen.\n\n\t\tCARMEN\n\tNothing, Joel.\n\n\t\tVOICE-OVER\n\tIt's bullshit.  She's punishing me for\n\tbeing honest with her.\n\nJoel is at his office desk on the phone.\n\n\t\tPHONE MACHINE VOICE\n\tYou have no messages.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel enters, checks his phone machine: zero messages.\n\nINT. JOEL'S OFFICE - DAY\n\nJoel gets off the elevator, approaches Carmen, who is in\nconversation with someone else.\n\n\t\tJOEL\n\tSorry, Carmen.  Any messages?\n\nCarmen shakes her head \"no\", goes back to her conversation.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel checks his machine: zero messages.\n\n\t\tVOICE-OVER\n\tThat's it.  I'm just gonna--\n\nWithout a moment's hesitation, he dials the phone.\n\n\t\tVOICE-OVER (CONT'D)\n\tI'm gonna tell her I'm through playing\n\tgames and --\n\n\t\tRECORDED VOICE\n\tThe number you have dialed has been\n\tdisconnected.\n\nJoel's eyes bug.\n\nINT. ROB AND CARRIE'S LIVING ROOM - NIGHT\n\nJoel sits across Rob and Carrie, mid-40's.\n\n\t\tJOEL\n\tWhy would she do that?\n\n\t\tVAGUE RECORDED VOICE\n\t-- If you think you have reached this\n\trecording in error, please check your\n\tnumber and dial again.\n\n\t\tCARRIE\n\tI don't know, honey.  It's horrible.\n\n\t\tJOEL\n\tShe's punishing me for being honest.  I\n\tshould just go to her house.\n\n\t\tROB\n\tI don't think you should go there, Joel.\n\n\t\tJOEL\n\tYeah, I don't want to seem desperate.\n\n\t\tCARRIE\n\tMaybe you need to look at this as a sign\n\tto move on.  Just make a clean break.\n\n\t\tJOEL\n\tI don't know.  I'm so... I can't believe\n\tshe'd be so goddamn immature!\n\n\t\tROB\n\tJoel, look, the thing is --\n\n\t\tCARRIE\n\t\t(agitated, interrupting)\n\tJoel, honey... We have to feed the dog.\n\tWould you just wait here?  Just a second.\n\nJoel nods, confused, as Rob and Carrie leave the room and\nclose the door behind them.  Joel hears a hushed argument\nensue in the hall.  He notices the dog asleep on the floor.\nHe grabs a magazine off the coffee table, flips through it\ndistractedly as he paces, puts it down, picks up another.  A\nsubscription card falls to the floor.  He picks it up and is\nabout to shove it back in the magazine when he sees it is not\na subscription card at all.  It reads:\n\n Clementine Kruczynski has had Joel Barish erased from her\n  memory.  Please never mention their relationship to her\n\t\t again.  Thank you.\n\n\t\t     Lacuna Ltd.\n\t\t     610 11th Avenue, NY, NY\n\nJoel stares at the card, incredulous.\n\nLater: Rob and Carrie are now back in the room.\n\n\t\tCARRIE (CONT'D)\n\tYou weren't supposed to see that.\n\n\t\tJOEL\n\tThey can't erase memories.  It's a joke.\n\tIt's a nasty Clementine hoax.\n\n\t\tCARRIE\n\tSweetie, we called the company.\n\nJoel just stands there.\n\nClose-up of a vague dictionary page.\n\n\t\tVOICE-OVER\n\tLacuna:  Noun.  A blank, a missing\n\tportion, especially in a manuscript.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel is on the phone pacing.\n\n\t\tCARRIE'S VOICE\n\tYou can't tell her, Joel.  They explained\n\tthat.  Like waking a sleepwalker.  It\n\tmight have a devastating effect.\n\nINT. JOEL'S CAR - NIGHT\n\nJoel drives past vague local landmark.\n\n\t\tCARRIE'S VOICE\n\tThink about it: to be told you lived an\n\texistence of which you have no\n\trecollection.\n\n\t\tJOEL'S VOICE\n\tBut what am I supposed to do?\n\n\t\tCARRIE'S VOICE\n\tMove on, sweetie.\n\n\t\tJOEL'S VOICE\n\tHow can I?  How can I move on when I know\n\tI'm the only one to carry this love we\n\thad?  How do I do that?\n\nINT. CAR - NIGHT\n\nJoel in his parked car next to a fence surrounding a drive-in\nmovie closed for the season.  He weeps.  The windows fog up\nuntil the outside is completely obscured.\n\nEXT. NEW YORK STREET - DAY\n\nJoel looks for an address.\n\nINT. ELEVATOR - DAY\n\nJoel gets off on the sixth floor.  He searches for a room\nnumber.  As he turns the corner, he sees that the hallway is\nfaded, vague and mostly erased.  He keeps walking, comes to\nthe door marked Lacuna and opens it.  Inside he can see\nvague, erased version of Mary the receptionist.\n\n\t\tMARY\n\t\t(dead monotone)\n\tHi, May I help you?\n\nThese degraded, faded memories allow Joel to detach himself\nand hear what's going on in his bedroom.\n\n\t\tSTAN'S VOICE\n\tSo, Mary's coming over tonight.\n\nJoel looks up.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nStan works the joystick.  Patrick sits on the bed with Joel.\n\n\t\tPATRICK\n\tYeah?\n\n\t\tSTAN\n\tJust wanted to let you know.\n\n\t\tPATRICK\n\tI like Mary.  I like when she comes to\n\tvisit.  I just don't think she likes me.\n\n\t\tSTAN\n\tShe likes you okay.\n\n\t\tPATRICK\n\tI wonder if I should invite my girlfriend\n\tover, too.  I have a girlfriend now.\n\n\t\tSTAN\n\tYou can if you want.\n\n\t\tPATRICK\n\tDid I tell you I have a new girlfriend?\n\n\t\tSTAN\n\t\t(re: memory on monitor)\n\tThis one's history.  Moving on...\n\n\t\tPATRICK\n\tThe thing is ... my situation is a little\n\tweird.  My girlfriend situation.\n\n\t\tSTAN\n\tPatrick, we need to focus.\n\nStan aims the joystick.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel distractedly reads a book, checks the clock, goes back\nto the book.  The door opens.  He looks up.  Clementine is\nstaggering in, drunk.\n\n\t\tCLEMENTINE\n\tYo ho ho!\n\n\t\tJOEL\n\tIt's three.\n\n\t\tVOICE-OVER\n\tShit.  The last time I saw you.\n\n\t\tCLEMENTINE (CONT'D)\n\tAnyhoo, sweetie, I done a bad thing.  I\n\tkinda sorta wrecked your car...\n\n\t\tJOEL\n\tI can't believe you wrecked my car.\n\n\t\tJOEL\n\tYou're driving drunk.  It's pathetic.\n\n\t\tCLEMENTINE\n\t...a little.  I was a little tipsy.\n\tDon't call me pathetic.\n\n\t\tJOEL\n\tWell it is pathetic.  And fucking\n\tirresponsible.  You could've killed\n\tsomebody.\n\nThe scene is starting to degrade.  The acting becomes anemic.\n\n\t\tJOEL (CONT'D)\n\tI don't know, maybe you did kill\n\tsomebody.\n\n\t\tCLEMENTINE\n\tOh Christ I didn't kill anybody.  It's\n\tjust a fucking dent.  You're like some\n\told lady or something.\n\n\t\tVOICE-OVER\n\tRight!  She called me an old lady here,\n\ttoo!  And I remember, I said...\n\n\t\tJOEL (CONT'D)\n\tAnd what are you like?  A wino?\n\n\t\tCLEMENTINE\n\tA wino?  Jesus, Are you from the fifties?\n\tA wino!\n\t\t(laughs)\n\tFace it, Joel.  You're freaked out\n\tbecause I was out late without you, and\n\tin your little wormy brain, you're trying\n\tto figure out, did she fuck someone\n\ttonight?\n\n\t\tJOEL\n\tNo, see, Clem, I assume you fucked\n\tsomeone tonight.  Isn't that how you get\n\tpeople to like you?\n\nThis shuts Clementine up.  She is stung and she starts\ngathering up her belongings, which are strewn about the\napartment.  Joel is immediately sorry he said this.  He\nfollows her around.\n\n\t\tJOEL (CONT'D)\n\tI'm sorry.  Okay.  I didn't mean that.  I\n\tjust... I was just... pissed, I guess.\n\nClementine is out the door.  Joel follows.\n\nEXT. STREET - NIGHT\n\nJoel looks at his dented car, looks at Clementine clomping\noff in the distance.\n\nINT. JOEL'S CAR - CONTINUOUS\n\nJoel drives to catch up with Clementine.  He rolls down his\nwindow to talk to her.\n\n\t\tJOEL\n\tLet me drive you home.\n\n\t\tCLEMENTINE\n\t\t(without turning)\n\tFuck you, Joel.  Faggot.\n\n\t\tJOEL\n\tLook at it out here.  It's falling apart.\n\tI'm erasing you.  And I'm happy.\n\nShe keeps clomping.\n\n\t\tJOEL (CONT'D)\n\tYou did it to me.  I can't believe you\n\tdid this to me.  By morning you'll be\n\tgone.  Ha!\n\nHe stops the car, gets out.\n\nEXT. STREET - CONTINUOUS\n\nIt's a street you might see in a dream, more an impression of\na quiet street than an actual one, with what little detail\nthere is obscured in darkness.  Joel wanders it.  In the\ndistance Clementine walks off, but as in an animated loop,\nshe doesn't get any farther away.  It's lonely.\n\n\t\tPATRICK'S VOICE\n\tSee, remember that girl?  The one we did\n\tlast week?  The one with the potatoes?\n\nJoel looks up, startled.\n\n\t\tSTAN'S VOICE\n\tYeah, that's this guy's girlfriend.  Was.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nStan watches the screen.  Patrick paces, fidgets, looks at\nthe unconscious Joel.\n\n\t\tPATRICK\n\tI gotta tell you something.  I kind of\n\tfell in love with her last night.\n\n\t\tSTAN\n\tShe was unconscious, Patrick.\n\n\t\tPATRICK\n\tShe was beautiful.  So sweet and funky\n\tand voluptuous.  I kind of stole a pair\n\tof her panties, is what.\n\n\t\tSTAN\n\tJesus, Patrick!\n\nEXT. STREET - NIGHT\n\nOn the vague street Joel listens to Patrick and Stan.\n\n\t\tPATRICK'S VOICE\n\tI know.  It's not like... I mean, they\n\twere clean and all.\n\n\t\tSTAN'S VOICE\n\tLook, just don't tell me this stuff.  I\n\tdon't want to know this shit.\n\n\t\tPATRICK'S VOICE\n\tYeah, okay.\n\n\t\tSTAN'S VOICE\n\tWe have work to do.\n\nThere's a click and Joel finds himself in --\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel and Clementine sit and eat dinner in front of the TV.\nIt's hard to make out what they're watching.\nThey sit on opposite ends of the couch.  They look bored.\nThe scene quickly degenerates.  The room fades.\n\n\t\tPATRICK'S VOICE\n\tOkay, but there's more.\n\nJoel listens.\n\n\t\tPATRICK'S VOICE (CONT'D)\n\tAfter we did her, I went to where she\n\tworked and I asked her out.\n\nJoel looks over at the faded Clementine across the couch.\nShe stares straight ahead at the TV.\n\n\t\tSTAN'S VOICE\n\tPatrick... do you know how unethical...\n\n\t\tJOEL\n\tThat must be the guy I saw you with.\n\n\t\tVOICE-OVER\n\tIn the bookstore that night.  The skinny\n\tguy.\n\nThere's a click and Joel finds himself in --\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel watches TV.  Clementine walks by in her underwear, looks\nat the TV.  She slips into a skirt.\n\n\t\tCLEMENTINE\n\tHow can you watch this crap?\n\n\t\tJOEL\n\tWhere are you going?\n\n\t\tCLEMENTINE\n\tI'm fucking crawling out of my skin.\n\nThe scene starts to fade.  Clementine puts on her shoes and\nheads out the door.\n\nEXT. ZOO - DAY\n\nJoel and Clementine walk around unhappily.  They barely look\nat the animals.  Clementine watches parents with babies.\n\n\t\tJOEL\n\tOh shit.  I remember this.\n\t\t(to Clementine)\n\tWant to go?\n\n\t\tCLEMENTINE\n\t\t(pissy)\n\tI want to have a baby.\n\n\t\tJOEL\n\tLet's talk about it later.\n\n\t\tCLEMENTINE\n\tNo.  I want to have a baby.  I have to\n\thave a baby.\n\n\t\tJOEL\n\tI don't think we're ready.\n\n\t\tCLEMENTINE\n\tYou're not ready.\n\n\t\tJOEL\n\tClementine, do you really think you could\n\ttake care of a kid?\n\nShe turns violently toward him, glaring.\n\n\t\tCLEMENTINE\n\tWhat?!\n\n\t\tJOEL\n\t\t(mumbly)\n\tI don't want to talk about this here.\n\n\t\tCLEMENTINE\n\tJoel, We're fucking gonna talk about it!\n\nJoel looks around.  People are watching.\n\n\t\tCLEMENTINE (CONT'D)\n\tYou can't fucking say something like that\n\tand say you don't want to talk about it!\n\n\t\tJOEL\n\tClem, I'm sorry.  I shouldn't have --\n\n\t\tCLEMENTINE\n\t\t(screaming now)\n\tI'd make a fucking good mother!  I love\n\tchildren!  I'm creative and smart and I'd\n\tmake a fucking good mother!\n\nThe scene starts to fade.  Clementine's rant continues but\nbecomes attenuated and vague.\n\n\t\tJOEL\n\tOh, thank God.  It's going.\n\n\t\tCLEMENTINE\n\tIt's you!  It's you who can't commit to\n\tanything!  You have no idea how lucky you\n\tare I'm interested in you!  I don't even\n\tknow why I am!  I should just end it\n\tright here, Joel.  Leave you in the zoo.\n\tMaybe you could find a nice sloth to hang\n\tout with!\n\nShe's crying now, but it's almost animatronic, no real\nemotion in it.  The scene is a husk.\n\n\t\tJOEL\n\tIt's going, Clementine.  All the crap and\n\thurt and disappointment.  It's all being\n\twiped away.\n\nShe looks up at him.\n\n\t\tCLEMENTINE\n\tI'm glad.\n\nTheir eyes lock.  She is fading before his eyes.\n\n\t\tJOEL\n\tMe, too.\n\nINT. BAR - NIGHT\n\nIt's noisy and crowded.  Joel and Clementine sit at a small\ntable.  She is drunk and staring off, blankly.\n\n\t\tJOEL\n\tSo, um --\n\n\t\tCLEMENTINE\n\t\t(swiveling head toward him)\n\tWould you get me another, Joely?\n\nJoel sighs, stands, and heads to the crowded bar.\n\n\t\tCLEMENTINE (CONT'D)\n\tThanky!  Thanky!\n\nJoel is at the bar, trying to get the bartender's attention.\n\nJoel is paying the bartender.  He turns with the drink to\nhead back to the table.  He sees Clementine flirting with a\nman in Joel's seat.\n\nJoel is at the table.  Clementine looks from her\nconversation.\n\n\t\tCLEMENTINE (CONT'D)\n\tJoel, this is Mark.  He likes my boobs.\n\tHe came over special to tell me that.\n\tIsn't that nice.  He doesn't think I'm\n\tfat.\n\nThe scene starts to fade.  Mark rises.\n\n\t\tMARK\n\tI didn't know she was with someone, man.\n\n\t\tCLEMENTINE\n\tS'okay, Mark.  Joel doesn't like my\n\tboobs.\n\t\t(stage whisper)\n\tI don't think he likes girls.\n\nThe bar gets quiet and vague.\n\n\t\tJOEL\n\tYou're drunk.\n\n\t\tCLEMENTINE\n\tYou're a whiz kid.  So perceptive, so --\n\nClementine keeps talking but there are no more intelligible\nwords, just a whisper -- like a breeze.\n\nA doorbell buzzes.  Joel looks up.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nPatrick opens the door.  Mary stands there in a winter coat,\ncarrying a backpack.\n\n\t\tMARY\n\t\t(coolly)\n\tOh, hey, Patrick.\n\n\t\tPATRICK\n\tHi, Mary.  How's it going?\n\nShe walks past him.\n\n\t\tSTAN\n\tHey, you.\n\nStan and Mary kiss.  She looks down at Joel as she takes off\nher coat.\n\n\t\tMARY\n\tIt's freezing out.\n\n\t\tSTAN\n\tYou found us okay?\n\n\t\tMARY\n\tYeah.\n\t\t(re: Joel)\n\tPoor guy.\n\t\t(looking around)\n\tHave anything to drink?\n\n\t\tSTAN\n\tWe haven't checked.\n\n\t\tMARY\n\tWell, allow me to do the honors.  It's\n\tfucking freezing and I need something.\n\nShe heads into the kitchen.  Stan turns back to monitor the\nslivers of light.\n\n\t\tPATRICK\n\tMary hates me.  I've never been popular\n\twith the ladies.\n\n\t\tSTAN\n\tMaybe if you stopped stealing their\n\tpanties.\n\n\t\tPATRICK\n\t\t(guilty beat)\n\tOkay, There's more, Stan --\n\nStan looks over at Patrick.  Mary returns with a bottle of\nscotch and two glasses.\n\n\t\tMARY\n\tHey, hey.\n\nShe pours the whiskey.\n\n\t\tMARY (CONT'D)\n\tOh, Patrick, you didn't want any, did\n\tyou?\n\n\t\tPATRICK\n\tNah, I don't know.\n\nMary hands a glass to Stan.  She holds hers up in a toast.\n\n\t\tMARY\n\tBlessed are the forgetful, for they get\n\tthe better even of their blunders.\n\nMary and Stan click glasses.\n\n\t\tMARY (CONT'D)\n\tNietzsche.  Beyond Good and Evil.  Found\n\tit my Bartletts.\n\n\t\tSTAN\n\tThat's a good one.\n\n\t\tMARY\n\tYeah, I can't wait to tell Howard!  It\n\tseems really appropriate.\n\n\t\tSTAN\n\t\t(a little sulky)\n\tIt's a good one all right.\n\n\t\tPATRICK\n\tWhat's your bartlett's?\n\n\t\tSTAN\n\tIt's a quote book.\n\n\t\tMARY\n\tI love quotes.  So did Winston Churchill.\n\tHe actually has a quotation in Bartlett's\n\tabout Bartlett's.  Isn't that trippy?\n\n\t\tPATRICK\n\t\t(trying to engage)\n\tYeah.  Cool.\n\n\t\tMARY\n\t\"The quotations when engraved upon the\n\tmemory give you good thoughts.\"\n\n\t\tPATRICK\n\tVery cool.  Trippy.\n\n\t\tMARY\n\tI like to read what smart people say.  So\n\tmany beautiful, important things.\n\n\t\tSTAN\n\tYup.\n\n\t\tMARY\n\tDon't you think Howard's like that?\n\tSmart?  Important?\n\n\t\tSTAN\n\t\t(beat)\n\tYup.\n\n\t\tPATRICK\n\tDefinitely!\n\n\t\tMARY\n\tI think he'll be in Bartlett's one day.\n\nStan focuses on the monitor.  Mary pours herself another\ndrink.\n\n\t\tPATRICK\n\tDefinitely.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nIt's dark.  Joel and Clementine are in bed.  The memory is\nalready in the midst of being erased.  Clementine is talking\nin a monotonous, robotic manner.\n\n\t\tCLEMENTINE\n\tYou don't tell me things, Joel.  I'm an\n\topen book.  I tell you everything.  Every\n\tdamn embarrassing thing.  You don't trust\n\tme.\n\n\t\tJOEL\n\tNo, it isn't that.\n\n\t\tCLEMENTINE\n\tI want to know you.\n\n\t\tJOEL\n\tI just don't have anything very\n\tinteresting about my life.\n\n\t\tCLEMENTINE\n\tJoel, you're a liar.\n\nThe scene is faded completely now and Joel just lies there\nfor a moment, registering Clementine's statement.\n\nINT. CHINESE RESTAURANT - NIGHT\n\nJoel and Clementine eat dinner in silence.  Joel looks around\nat other couples in the restaurant.  Some seem happy and\nengaged.  Others seem bored with each other.  He turns back\nto his food.\n\n\t\tJOEL\n\tHow's the chicken?\n\n\t\tVOICE-OVER\n\tIs that like us?  Are we just bored with\n\teach other?\n\n\t\tCLEMENTINE\n\tGood.\n\nHe watches her as she downs her wine and pours herself\nanother glass.  She holds the wine bottle up to Joel.\n\n\t\tCLEMENTINE (CONT'D)\n\tMore?\n\n\t\tJOEL\n\tNo.  Thanks.\n\nThere's a silence.\n\n\t\tCLEMENTINE\n\tHow's the fish?\n\nThe scene is fading.\n\n\t\tJOEL\n\tIt's good.\n\nThey continue to eat in silence as the scene dissolves.\n\n\t\tPATRICK'S VOICE\n\tHi, Clementine! -- Why, what's wrong? --\n\tOh, I'm sorry. -- Well, I'm not sure, I\n\tkind of have to study for my test --\n\nINT. JOEL'S APARTMENT - NIGHT\n\nPatrick is on the phone next to Joel's bed.  Stan watches the\nlights on the computer screen.\n\n\t\tPATRICK\n\tHold on.  Let me ask my friend.\n\t\t(covering mouthpiece)\n\tStan, can I leave for a little while?  My\n\tgirlfriend is very --\n\n\t\tSTAN\n\tPatrick, we're in the middle of --\n\n\t\tPATRICK\n\tShe's right in the neighborhood.  She's\n\tupset.\n\nMary is in the kitchen.  She pokes her head out.  She's got\nsome pie on a plate.\n\n\t\tMARY\n\tLet him go, Stan.  I can help.\n\n\t\tSTAN\n\t\t(sighing, to Patrick)\n\tGo.\n\n\t\tPATRICK\n\t\t(quietly)\n\tMary hates me.\n\t\t(into phone)\n\tI'll be right over, Tangerine.\n\nINT. CLEMENTINE'S APARTMENT - NIGHT\n\nCandles are lit.  Joel and Clementine are under a blanket on\nthe living room rug listening to music.\n\n\t\tCLEMENTINE\n\tJoely...\n\n\t\tJOEL\n\tYeah, Tangerine?\n\n\t\tCLEMENTINE\n\tDo you know The Velveteen Rabbit?\n\n\t\tJOEL\n\tNo.\n\n\t\tCLEMENTINE\n\tIt's my favorite book.  Since I was a\n\tkid.  It's about these toys.  There's\n\tthis part where the skin Horse tells the\n\trabbit what it means to be real.\n\t\t(crying)\n\tI can't believe I'm crying already.  He\n\tsays, \"It takes a long time.  That's why\n\tit doesn't often happen to people who\n\tbreak easily or have sharp edges, or who\n\thave to be carefully kept.  Generally by\n\tthe time you are Real, most of your hair\n\thas been loved off, and your eyes drop\n\tout and you get loose in the joints and\n\tvery shabby.  But these things don't\n\tmatter at all, because once you are Real\n\tyou can't be ugly, except to people who\n\tdon't understand.\"\n\nShe's weeping.  Joel is stroking her hair.  They kiss and\nbegin to make love under the blanket.  It's sweet and gentle\nand then it starts to fade.\n\n\t\tJOEL\n\t\t(screaming)\n\tNo!  Jesus, No!\n\nHe looks down and Clementine's tear-streaked face is fading.\nShe continues as if she's still being made love to, even\nthough Joel is completely beside himself.  He jumps up naked\nand yells at the ceiling.\n\n\t\tJOEL (CONT'D)\n\tPlease!  Please!  I've changed my mind!\n\t\t(looks down at fading\n\t\t Clementine, then at ceiling)\n\tI don't want this.  Wake me up!  Stop the\n\tprocedure!  Plea --\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel is unconscious on the bed, completely still.  Mary and\nStan watch the monitor and smoke a joint.  After a silence:\n\n\t\tMARY\n\tIt's amazing, isn't it?  Such a gift\n\tHoward gave the world.\n\n\t\tSTAN\n\t\t(a sigh)\n\tYeah.\n\n\t\tMARY\n\tTo let people begin again.  It's\n\tbeautiful.  You look at a baby and it's\n\tso fresh, so clean, so free.  And\n\tadults... they're like this messy tangle\n\tof anger and phobias and sadness...\n\thopelessness.  And Howard just makes it\n\tgo away.\n\n\t\tSTAN\n\tYou love him, don't you?\n\nMary seems surprised, taken aback, caught.  She is silent for\na long moment.\n\n\t\tMARY\n\tNo.\n\t\t(beat)\n\tBesides, Howard's married, Stan.  He's a\n\tvery serious and ethical man.  I'm not\n\tgoing to tempt him to betray all he\n\tbelieves in.\n\nStan takes another drag on the joint, passes it to Mary.\n\nEXT. STREET - NIGHT\n\nPatrick, bundled up and carrying a full backpack, trudges\nthrough the snow.\n\nINT. CLEMENTINE'S APARTMENT - CONTINUOUS\n\nClementine watches out the window as Patrick nears.  She's\ncrying.  He makes his way up her front stairs.  She swings\nopen the door and hugs him.\n\n\t\tPATRICK\n\tOh, baby, what's going on?\n\n\t\tCLEMENTINE\n\tI don't know.  I'm lost.  I'm scared.  I\n\tfeel like I'm disappearing.  I'm getting\n\told and nothing makes any sense to me.\n\n\t\tPATRICK\n\tOh, Tangerine.\n\n\t\tCLEMENTINE\n\tNothing makes any sense.  Nothing makes\n\tany sense.\n\nShe pushes herself out of the embrace and looks at Patrick.\n\n\t\tCLEMENTINE (CONT'D)\n\tCome up to Boston with me?\n\n\t\tPATRICK\n\tSure.  We'll go next weekend and --\n\n\t\tCLEMENTINE\n\tNow.  Now!  I have to go now.  I have to\n\tsee the frozen Charles!  Now!  Tonight!\n\n\t\tPATRICK\n\tUm, okay.  I'll call my study partner.\n\n\t\tCLEMENTINE\n\tYay!  It'll be great!  I'll get my shit.\n\nShe runs into the bedroom.  Patrick is at the phone and\nrealizes he doesn't know Joel's number.  After a moment's\nthought, he *69's.  The phone rings.\n\n\t\tJOEL'S VOICE\n\tHi, it's Joel.  Please leave a message\n\tafter the beep.\n\nBeep.\n\n\t\tPATRICK\n\t\t(whisper)\n\tStan, it's Patrick.  Pick up.\n\n\t\tSTAN'S VOICE\n\tHey, where are you?\n\n\t\tPATRICK\n\tI got into a situation with the old lady.\n\tCan you handle things tonight alone?  I'm\n\treally sorry, man.\n\nINT. JOEL'S APARTMENT - CONTINUOUS\n\nStan is on the phone.  He's really stoned and watches Mary,\nstoned herself, dancing in a sexy trance to something soft\nand low on the stereo.\n\n\t\tSTAN\n\tI can handle it.  He's pretty much on\n\tauto-pilot anyway.\n\nINT. CLEMENTINE'S APARTMENT - CONTINUOUS\n\n\t\tPATRICK\n\tThanks, Stan.  I owe you.\n\nPatrick hangs up, rifles quickly through his backpack.  He\npulls out a silver bracelet, puts it in his pocket, then\npulls out a journal, flips through it, keeping an eye on the\nbedroom door.  The handwriting is a woman's.  He finds what\nhe's looking for.  He reads:\n\n\t\tCLEMENTINE'S VOICE\n\tI took Joel to walk on Charles River with\n\tme last night.  It was so beautiful and\n\tcharming.  Joel was nervous about\n\tstepping onto the ice, but he wanted to\n\tplease me so much -- he's so sweet --\n\tthat he came out after me.    We lay down\n\tright in the center and watched the\n\tstars.  He took my hand and said \"I\n\tcould...\n\nEXT. CHARLES RIVER - NIGHT\n\nJoel and Clementine lie together holding hands on the frozen\nriver.  They look up at the stars.\n\n\t\tJOEL\n\t...die right now, Clem.  I'm just...\n\thappy.  I've never felt that before.  I'm\n\tjust exactly where I want to be.\n\nClementine looks over at him.  Her eyes are filled with love\nand tears.  Then they get vague.  The scene is being erased.\nJoel is panicked.\n\n\t\tJOEL (CONT'D)\n\tClem, no!  This can't keep happening.\n\tPlease!  Oh, fuck!  Please!\n\nCrazily, Joel runs off, passing through a series of decayed\nscenes: He and Clementine arguing in a car, having sex on the\nbeach, laughing and holding hands at a movie, eating grilled\ncheese and tomato soup together in bed, Joel watching her\nsleep, them drinking at a bar.  He arrives at a decayed\nversion of his first meeting with Mierzwiak.\n\n\t\tMIERZWIAK\n\tWe can help you through this.  Why don't\n\tyou start now by telling me everything\n\tyou can remember about --\n\n\t\tJOEL\n\tYou have to stop this!\n\n\t\tMIERZWIAK\n\tWhat?  What do you mean?\n\n\t\tJOEL\n\tI'm trapped in my head and everything I\n\tlove is being erased!  Stop it now!\n\n\t\tMIERZWIAK\n\tYes, but... I'm just something you're\n\timagining.  What can I do?  I'm in your\n\thead, too.\n\nINT. CLEMENTINE'S APARTMENT - NIGHT\n\nPatrick reads the journal.\n\n\t\tCLEMENTINE'S VOICE\n\t... and we made love right on the ice.\n\tIt was absolutely freezing on my ass!  It\n\twas wonderful.\n\nClementine enters, dressed for the cold.  Patrick puts the\nnotebook away.\n\n\t\tCLEMENTINE\n\tI'm so excited.  Yay!\n\n\t\tPATRICK\n\tI'm excited, too.  Oh, and I wanted to\n\tgive you this.  It's a little... thing.\n\nPatrick pulls the bracelet from his pocket, hands it to her.\n\n\t\tPATRICK (CONT'D)\n\tI didn't have a chance to wrap it.\n\n\t\tCLEMENTINE\n\tIt's gorgeous.\n\t\t(slipping it on)\n\tJust my taste.  I've never  gone out with\n\ta guy who brought me a piece of jewelry I\n\tliked.\n\t\t(kisses him)\n\tThanks.  So let's get going.  Long drive.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nStan and Mary have sex on the floor next to Joel's bed.\n\nEXT. FOREST - DAY\n\nJoel and Clementine are hiking, Clementine in front.\n\n\t\tCLEMENTINE\n\tSuch a beautiful view.\n\n\t\tJOEL\n\t\t(looking at her)\n\tYes indeed.\n\t\t(snapping out of memory)\n\tFuck!  They're erasing you, Clem!\n\n\t\tCLEMENTINE\n\tOh?\n\n\t\tJOEL\n\tI hired them to.  We're in my brain.  But\n\tI want it to stop, before I wake up and\n\tdon't know you anymore.\n\n\t\tCLEMENTINE\n\tWow.  Um, well... can't you just force\n\tyourself awake?\n\n\t\tJOEL\n\tI don't know.\n\nHe concentrates.  Nothing happens.\n\n\t\tJOEL (CONT'D)\n\tAaargh!  It's horrible!  I'm trapped!\n\nHe starts to have a fit, banging against trees, stomping his\nfeet, screaming.  But even while he's doing this the memory\nand Clementine are fading around him.\n\nINT. JOEL'S APARTMENT - DAY\n\nIt's raining out.  Joel is reading, slouched in a chair.  He\nlooks over at Clementine, stretched out on her belly in her\nunderwear.  She's reading, too.\n\n\t\tVOICE-OVER\n\tShe's so sexy.\n\n\t\tJOEL\n\tI loved you on this day.  I love this\n\tmemory.  The rain.  Us just hanging.\n\nClementine looks over at him, smiles.  Her brow furrows in\nthought.\n\n\t\tCLEMENTINE\n\tWhat if you hide me?\n\n\t\tJOEL\n\tWhat do you mean?\n\n\t\tCLEMENTINE\n\t\t(formulating)\n\tWell... if they're looking for me in\n\tmemories I'm in, what if you take me to a\n\tmemory I'm not in?\n\t\t(proud)\n\tAnd we can hide there till morning.\n\nJoel ponders this.  The scene and Clementine are beginning to\ndissolve.  Joel grabs Clementine's hand.  She giggles with\nglee.  He pulls her out of the scene as it degrades.\n\n\t\tJOEL\n\tWhere?  Where?  Where?\n\nHe drags her through the landscape of already decayed\nmemories and turns off into:\n\nINT. KITCHEN - DAY\n\nThe kitchen is dated and vague.  Joel and Clementine are in\nan oversized playpen; they're adults but small.  Joel wears\nfootsie pajamas with some vague little animals on them.  He\nholds a a red furry huckleberry hound doll.  Clementine is\nstill in her panties and bra.  An oversized woman in high\nheels, seen from a low angle, hurries back and forth\npreparing dinner.\n\n\t\tCLEMENTINE\n\tJesus.  What's this?\n\nJoel looks around at the kitchen, at his doll, at the woman.\n\n\t\tJOEL\n\tI must be about two.\n\t\t(oddly)\n\tI want my mommy.  She's busy.  She's not\n\tlooking at me.\n\t\t(back to himself, re: doll)\n\tLook, my Huckleberry Hound doll!  I told\n\tyou about this!\n\t\t(beat)\n\tI want my mommy!\n\nHe starts to cry.  Clementine tries to comfort him.  She hugs\nhim.\n\n\t\tJOEL (CONT'D)\n\t\t(crying still)\n\tI want my mommy.\n\t\t(adult, to Clementine)\n\tI don't want to lose you, Clem.\n\n\t\tCLEMENTINE\n\tI'm right here.\n\n\t\tJOEL\n\tI'm scared.  I want my mommy.  I don't\n\twant to lose you.  I don't want to\n\tlose...\n\n\t\tCLEMENTINE\n\tJoel, Joely, look... it's not fading.\n\tThe memory.  I think we're hidden.\n\nJoel sucks in some snot.  His mother scurries back and forth\nclanging pots.  The room is not decaying.  Joel smiles.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nStan and Mary lie on the floor, their stoned minds wandering\nafter sex.  Stan suddenly perks up.  He looks at the monitor.\n\n\t\tSTAN\n\tIt's stopped.\n\n\t\tMARY\n\tWhat?\n\n\t\tSTAN\n\tListen, it's not erasing.\n\nHe makes his way, naked, to the computer screen.\n\n\t\tSTAN (CONT'D)\n\tIt's not erasing.  He's off the screen.\n\n\t\tMARY\n\tWhere?\n\n\t\tSTAN\n\tI don't know.  He's not on the map.\n\nStan tries to break through his marijuana haze.  He fiddles\nnervously with the equipment.\n\n\t\tSTAN (CONT'D)\n\tI don't know what to do!  I don't know\n\twhat to do!  Crap.  Crap...\n\n\t\tMARY\n\tWell, what should we do?\n\n\t\tSTAN\n\tI don't know!  I just said that!\n\n\t\tMARY\n\tSor-ry\n\t\t(beat)\n\tWe have to do something.  He can't wake\n\tup half done.\n\n\t\tSTAN\n\tShit!\n\nHe jerks the joystick spastically.  Mary, also naked, gets up\nand looks over his shoulder at the screen.\n\n\t\tMARY\n\t\t(definitely)\n\tWe should call Howard.\n\nStan turns and looks at her.  He's stoned and trying to\nunderstand her motivation.\n\n\t\tSTAN\n\tNo way.  I can handle this.\n\n\t\tMARY\n\tThis guy's only half cooked.  There's no\n\ttime to fuck around, Stan.\n\nStan tries to think.  He paces.  Mary watches him.  Finally:\n\n\t\tSTAN\n\t\t(without making eye contact)\n\tOkay.\n\nHe dials the phone, waits.\n\n\t\tSTAN (CONT'D)\n\tHello, Howard?\n\nINT. MIERZWIAK'S BEDROOM - CONTINUOUS\n\nThe room is dark.  A groggy Mierzwiak is in bed on the phone.\nHis wife lies beside him, eyes open, listening.\n\n\t\tMIERZWIAK\n\tStan?  What's going on?\n\n\t\tSTAN'S VOICE\n\tThe guy we're doing?  He's disappeared\n\tfrom the map.  I can't find him anywhere.\n\n\t\tMIERZWIAK\n\tOkay, what happened right before he\n\tdisappeared?\n\n\t\tSTAN'S VOICE\n\tI was away from the monitor for a second.\n\tI had it on automatic.  I had to go pee.\n\n\t\tMIERZWIAK\n\tWell, where was Patrick?\n\n\t\tSTAN'S VOICE\n\tHe went home sick.\n\n\t\tMIERZWIAK\n\tJesus.  All right, what's the address.\n\n\t\tSTAN'S VOICE\n\t1062 Sherman Drive.  Apartment 1E,\n\tRockville Center.\n\nMierzwiak writes it down on a bedside not pad.  He hangs up.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nStan hangs up the phone, looks at Mary.\n\n\t\tMARY\n\tHe's coming?\n\n\t\tSTAN\n\tYou better go.\n\n\t\tMARY\n\tHell no.\n\nShe starts getting dressed.\n\n\t\tMARY (CONT'D)\n\tShit, I'm so stoned.  I don't want him to\n\tsee me stoned.  Stop being stoned, Mary!\n\nShe hurries into the bathroom with her bag.\n\n\t\tMARY (CONT'D) (O.S.) (CONT'D)\n\tGod, I look like shit!  God!\n\nMary slams the bathroom door.  Stan puts his head in his\nhands.\n\nINT. KITCHEN - DAY\n\nJoel and Clementine are in the playpen.  Joel's oversized\nmother reaches down as she hurries by and pats Joel on the\nhead.\n\n\t\tMOTHER\n\tHow's my baby boy?\n\nShe's gone.\n\n\t\tJOEL\n\tI really want her to pick me up.  It's\n\tweird how strong that desire is.\n\nClementine holds his hand.  He looks over at her.\n\n\t\tCLEMENTINE\n\tYou know, we're okay.  They're not\n\tfinding us.  You'll remember me in the\n\tmorning.  And you'll come to me and tell\n\tme about us and we'll start over.\n\n\t\tJOEL\n\tI loved you so much this day.  On my bed\n\tin your panties.  I remember I thought,\n\thow impossibly lucky am I to have you on\n\tmy bed in your panties.\n\nShe kisses him.\n\n\t\tCLEMENTINE\n\tYou remember what happened next?\n\n\t\tJOEL\n\tI came over to the bed and you smelled so\n\tgood, like you just woke up, slightly\n\tsweaty.  And I climbed on the bed with\n\tyou and you said something like --\n\n\t\tCLEMENTINE\n\t-- another rainy day.  Whatever shall we\n\tdo?\n\nHe laughs.  She unbuttons his pajamas.  They begin to make\nlove.  Joel's mother hurries around the kitchen.  Joel stops,\nlooks at Clementine.\n\n\t\tJOEL\n\tThere's this guy!\n\n\t\tCLEMENTINE\n\tWhat?\n\n\t\tJOEL\n\tThere's this guy.  I heard him talking in\n\tmy apartment.  He's one of the eraser\n\tguys.  And he fell for you when they were\n\terasing you, so he introduced himself the\n\tnext day as if he were a stranger and now\n\tyou're dating him.\n\n\t\tCLEMENTINE\n\tReally?  Is he cute?\n\n\t\tJOEL\n\tHe stole a pair of your panties while you\n\twere being erased!\n\n\t\tCLEMENTINE\n\tGross! You must remember to tell me this\n\tin the morning.  I'm, like, so freaked\n\tout now.\n\nINT. CLEMENTINE'S CAR - NIGHT\n\nIt's a rust bucket.  Clementine drives through the snow.\nShe's crying and holding Patrick's hand.\n\n\t\tCLEMENTINE\n\tWhat's wrong with me?\n\n\t\tPATRICK\n\tNothing is wrong with you.  You're the\n\tmost wonderful person I've ever met.\n\nShe glances gratefully over at him then starts to cry even\nharder.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nStan works on trying to get the signal back.  His hair is\ncombed and he's dressed neatly, looking professional but\nstill stoned.  Mary is pacing nervously to and from the\nwindow, looking out into the night.  She's dressed also, and\nshe's wearing more make-up now.  Her hair is pulled up into\nsome sort of style.  Suddenly she freezes at the window.\n\n\t\tMARY\n\tThere he is.  Oh my God.  Oh my God.  Do\n\tI look okay?\n\nShe doesn't say anything.\n\n\t\tMARY (CONT'D)\n\tI'm still stoned.  Are you?  Crap.\n\nShe looks in the mirror.\n\n\t\tMARY (CONT'D)\n\t\t(to Joel)\n\tYour Visine didn't do shit, fella.\n\nThe doorbell buzzes.  Mary lunges for the door, then calms\nherself before opening it.  Mierzwiak, holding an equipment\nbag, looks surprised.\n\n\t\tMIERZWIAK\n\tMary.  What are you doing here?\n\n\t\tSTAN\n\tShe came to help, Howard.\n\n\t\tMARY\n\tI wanted to learn as much about the\n\tprocedure as possible, Howard.  I think\n\tit's important for my job...to help\n\tcomfort the clientele.  You know.\n\nMierzwiak looks from Mary to Stan, nods, and enters.  Mary\ncloses the door.  Mierzwiak crosses to the equipment.\n\n\t\tMIERZWIAK\n\tLet's get to the bottom of this.  Shall\n\twe?\n\nHe sits down in front of the computer and does some fiddling.\n\n\t\tMIERZWIAK (CONT'D)\n\tOdd.\n\nHe fiddles some more.  Mary looks on, fascinated.\n\n\t\tSTAN\n\tI tried that already.\n\n\t\tMIERZWIAK\n\tDid you try going through C-Gate?\n\n\t\tSTAN\n\tYeah.  Of course.\n\nMierzwiak ponders.  He unzips his equipment bag, pulls out\nanother laptop computer and plugs it in to the system.\n\n\t\tMIERZWIAK\n\tI'm going to do a Spectrum search\n\tthroughout his memory, see if anything\n\tcomes up.\n\nMierzwiak presses some more buttons.  The program starts up.\nA much more complex and detailed human brain appears on this\nscreen.  It rotates.  Eventually Mierzwiak sees a small\ndistant light in the brain.  He zeroes in on it.\n\n\t\tMIERZWIAK (CONT'D)\n\tOkay, here it is.  I don't know why it's\n\toff the map like that, but --\n\nINT. KITCHEN - DAY\n\nJoel is being bathed in the oversized sink by his oversized\nmother.  Clementine sits in the water with him, laughing.\nThe mother doesn't seem to see her.\n\n\t\tMOTHER\n\tLittle baby getting awwwl cleean.  Awl\n\tclean.\n\n\t\tJOEL\n\t\t(to Clementine)\n\tI love getting bathed in the sink.  It's\n\tsuch a feeling of security.\n\n\t\tCLEMENTINE\n\t\t(giggling)\n\tI've never seen you happier.\n\nThe elements of the scene flash explosively away:  Joel's\nmother, his Huckleberry Hound doll, the details of the\nkitchen, Clementine.   Joel is thrown into:\n\nINT. CAR - NIGHT\n\nHe sits with Clementine in the parked car, outside a drive-in\nmovie theater.  The movie on the giant screen is partially\nobscured by a fence.  Joel and Clementine drink wine.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nMierzwiak looks up from the computer screen.\n\n\t\tMIERZWIAK\n\tOkay, we're back in.\n\n\t\tMARY\n\tThat was beautiful to watch, Howard.\n\tLike a surgeon or a concert pianist.\n\n\t\tMIERZWIAK\n\tWell, thank you, Mary.\n\n\t\tSTAN\n\t\t(sighing)\n\tYou get some sleep, Howard.  I'll take it\n\tfrom here.\n\n\t\tMIERZWIAK\n\tYeah, probably a good idea.\n\nINT. CAR - NIGHT\n\nClementine and Joel laugh as they try to give voice to what\nthe characters on the screen are saying.\n\n\t\tCLEMENTINE\n\tBut can't you see... I love you, Antoine.\n\n\t\tJOEL\n\tDon't call me Antoine.  My name is Wally.\n\n\t\tCLEMENTINE\n\tYes, but I can't love a man named Wally.\n\nShe starts to fade.  The scene starts to fade.  Joel\nremembers their previous plan.\n\n\t\tJOEL\n\tThey found us before.  The plan didn't\n\twork.  I don't know what to do now.\n\n\t\tCLEMENTINE\n\t\t(mouthing to woman on screen)\n\tHide me somewhere deeper?  Somewhere\n\tburied?\n\nJoel grabs her.  They run off just as the scene decays into a\nhusk behind them.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nStan is back at the controls.  Mierzwiak's at the door with\nMary.\n\n\t\tSTAN\n\tHoward, they've disappeared again.\n\n\t\tMIERZWIAK\n\tOh dear.\n\n\t\tMARY\n\tI'm so sorry, Howard, you must be tired.\n\nHe nods, distractedly.  She smiles to herself as he heads\nback to the equipment.\n\nEXT. SCHOOLYARD - AFTERNOON\n\nJoel, now the size of a junior high school kid and dressed\naccordingly, is peering around the corner of the school\nbuilding toward the bike rack.  Clementine is with him,\ndressed as she was in the parked car.\n\n\t\tCLEMENTINE\n\tLook at you, cutey!  What are we doing?\n\n\t\tJOEL\n\tThis kid, Joe Early, is going to beat the\n\tshit out of me.\n\n\t\tVOICE-OVER\n\tI'm terrified.  I thought if I hung\n\taround the art room long enough, he'd go\n\thome and I could get my bike.\n\nThey head toward the bike rack.  Joel's is the only bike\nremaining.\n\n\t\tCLEMENTINE (CONT'D)\n\tPoor Joel.\n\nThey're at the bike rack and a bunch of kids, including\ngiant, fat Joe Early come around the corner.\n\n\t\tJOE EARLY\n\tHi, Jill.\n\n\t\tJOEL\n\tHe calls me Jill.  Everyone calls me Jill\n\tafter this.\n\nThe other kids laughs.\n\n\t\tJOEL\n\tJust shut up, Joe.  I'm going home.\n\n\t\tJOE EARLY\n\tI don't think so.  We're fighting.\n\n\t\tJOEL\n\tI don't want to fight you.\n\nThe kids start chanting, \"fight, fight, fight...\"  Joe Early\nthrows a wild punch that hits Joel in the side.  joel falls\nand stays down, covering himself.\n\n\t\tJOE EARLY\n\tC'mon, Jill.  Get up, faggot.  C'mon.\n\nJoel doesn't say anything.  He peeks humiliated at\nClementine.  She's watching him.  She's got a tear in her\neye.  She kneels down beside him, puts her arm around him.\n\n\t\tJOEL\n\tI'm too scared to even throw a punch.\n\tWhen I tell people this story I leave\n\tthat part out.\n\nThe scene flashes violently to white and is gone.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nMierzwiak is at the machine.\n\n\t\tMIERZWIAK\n\tWe got him back.  Stan, I think I'm just\n\tgoing to have to get through this\n\tmanually.  We're running late.\n\nEXT. BEACH - DAY\n\nIt's cold.  Joel and Clementine walk, all bundled up.  She\npoints at a house up the beach.\n\n\t\tCLEMENTINE\n\tOur house!  Our house!\n\nShe runs ahead, laughing.  The scene is decaying.  Joel\nchases after her.\n\n\t\tJOEL\n\tClem, c'mon, we've got to hide you.\n\tRemember?\n\nHe grabs her arm and yanks and they are in:\n\nINT. BOY'S BEDROOM - NIGHT\n\nIt's dark.  Joel, junior high school size, is in bed\nmasturbating.  Clementine is in there, too, in her winter\ncoat, still laughing from before.  She realizes what's going\non.\n\n\t\tCLEMENTINE\n\t\t(mock offended)\n\tJoel!\n\n\t\tJOEL\n\t\t(continuing to masturbate)\n\tI don't like it either, but I'm just\n\ttrying to find horrible secret place to --\n\nJoel's mother pops her head in the door.\n\n\t\tMOTHER\n\tJoel, I was just --\n\t\t(sees what's going on)\n\tOh.  Um... I'll ask you in the morning,\n\thoney.  Have a good night.\n\nThe mother backs out, closes the door.  Joel cringes.\nClementine laughs, still in the mode of the memory she was\nswiped from.  Flash!  It's all gone.\n\nINT. RESTAURANT - NIGHT\n\nJoel and Clementine are laughing as she blows out the candle\non a slice of cheesecake in front of her.  Joel hands her a\nsmall wrapped box.\n\n\t\tJOEL\n\tHappy Birthday.\n\n\t\tCLEMENTINE\n\t\t(unwrapping the gift)\n\tThanks, Joely.  A present!  Oh boy!\n\nShe pulls out the bracelet.  It's the same bracelet Patrick\ngave her.\n\n\t\tCLEMENTINE (CONT'D)\n\tOh, Joel.  It's beautiful!\n\t\t(slip it on)\n\tI mean, you're the first guy who ever\n\tbought me a piece of jewelry I could\n\thonestly say that about.\n\nHe notices she's starting to fade.\n\n\t\tJOEL\n\tI scoured the city for it.\n\n\t\tCLEMENTINE\n\tI love it!\n\nShe leans across the table to kiss him.  He grabs her and\nruns through the decaying scene and into the vague night.\n\nEXT. SUBURBAN STREET - DAY\n\nJoel is one of a group of five year olds.  He holds a hammer\nand is poised to hit a dead bird in a red wagon.  The other\nboys are goading him.\n\n\t\tBOYS\n\tC'mon, Joel, you have to.  Do it already.\n\nJoel doesn't want to.  Clementine watches.\n\n\t\tJOEL\n\tI can't.  I have to go home.  I'll do it\n\tlater.\n\n\t\tVOICE-OVER\n\tI didn't want to do this.  But I had to\n\tor they would've called me a girl.\n\nJoel miserably smashes the bird repeatedly with the hammer.\nRed jelly guts cover the hammer and the wagon bottom.  The\nkids hoot.\n\n\t\tVOICE-OVER\n\tI can't believe I did that.  I'm so\n\tashamed.\n\nA live bird watches from a tree.  Clementine, still dressed\nfor her birthday dinner (wearing her new bracelet), pulls\nJoel away from the other boys.  The two of them walk down\nJoel's suburban street.\n\n\t\tCLEMENTINE\n\tIt's okay.  You were a little kid.\n\t\t(beat)\n\tThis is a great birthday present.\n\tGetting to see you as a boy.\n\nShe kisses him and they walk holding hands.\n\n\t\tJOEL\n\t\t(pointing)\n\tThat's where I live.  Lived.\n\nJoel looks down at her hand.  It's fading.  The bracelet is\ngone.  Clementine is gone.  His childhood house is gone.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nMierzwiak works the equipment.  He has located a small area\nof light in the brain imaging and eradicates them.\n\n\t\tMIERZWIAK\n\tI'm getting the hang of it.  I still\n\tunderstand it.  But I'm finding him\n\tquickly enough.  I'm hopeful there won't\n\tbe too much peripheral eradication.\n\nMary sits on the bed.\n\n\t\tMARY\n\t\t(a little giggly)\n\tI like watching you work.\n\nStan sighs, grabs his coat.\n\n\t\tSTAN\n\tI'll go out for a smoke.  If no one\n\tminds.\n\n\t\tMIERZWIAK\n\t\t(not looking up)\n\tThat's fine, Stan.\n\nMary doesn't say anything.  Stan huffs and is out the door.\nMierzwiak continues to find and erase points of light.  Mary\ngets up her courage to speak.\n\n\t\tMARY\n\tDo you like quotes, Howard?\n\n\t\tMIERZWIAK\n\tHow do you mean?\n\n\t\tMARY\n\tOh, um, like famous quotes.  I find\n\treading them inspirational to me.  And in\n\tmy reading I've come across some I\n\tthought you might like, too.\n\n\t\tMIERZWIAK\n\tOh.  Well, I'd love to hear some.\n\nMary is thrilled, beside herself.  She tries to calm down.\n\n\t\tMARY\n\tOkay, um, there's one that goes \"Blessed\n\tare the forgetful, for they get the\n\tbetter even of their blunders.\"\n\n\t\tMIERZWIAK\n\tIs that Nietzsche?\n\n\t\tMARY\n\tYeah, yeah it is, Howard.  And here I was\n\tthinking I could tell you something you\n\tdidn't know.\n\n\t\tMIERZWIAK\n\tIt's a good quote, Mary.  I'm glad we\n\tboth know it.\n\nHe smiles at her.  She's flustered, flattered.\n\n\t\tMARY\n\t\t(sputtering)\n\tThere's another one I like, I read.  It's\n\tby Pope Alexander.\n\n\t\tMIERZWIAK\n\tAlexander Pope?\n\n\t\tMARY\n\tYes, shit.  Oops, sorry!\n\t\t(puts hand over mouth)\n\tSorry.  It's just I told myself I wasn't\n\tgoing to say Pope Alexander and sound\n\tlike a dope and then I go ahead and do\n\tit.  Like I psyched myself out.\n\n\t\tMIERZWIAK\n\tIt's no big deal.\n\n\t\tMARY\n\tYou are such a sweetheart.\n\nThere's an embarrassed moment as that line hangs in the air.\nThen Mary plunges ahead to bury it.\n\n\t\tMARY (CONT'D)\n\tAnyway, the quote goes \"How happy is the\n\tblameless Vestal's lot!  The world\n\tforgetting, by the world forgot: Eternal\n\tsunshine of the spotless mind!  Each\n\tprayer accepted, and each wish resign'd\".\n\nShe smiles, proud and embarrassed.\n\n\t\tMIERZWIAK\n\tThat's lovely.\n\n\t\tMARY\n\tReally?  I thought it was appropriate\n\tmaybe.  That's all.\n\t\t(beat, then quickly)\n\tI really admire the work that you do.  I\n\tknow it's not proper to be so familiar\n\tbut I guess since we're outside the\n\tworkplace I feel a certain liberty to --\n\n\t\tMIERZWIAK\n\tIt's fine, Mary.  I'm happy to hear it.\n\n\t\tMARY\n\tOkay.  Good.  Great.  Thanks.\n\t\t(blurting)\n\tI like you, Howard... an awful lot.  Is\n\tthat terrible?\n\nMierzwiak seems momentarily taken aback, then returns to his\nunflappable self.\n\n\t\tMIERZWIAK\n\tYou're a wonderful girl, Mary.\n\nShe leans over and kisses him, then pulls away quickly.\n\n\t\tMARY\n\tI've loved you for a very long time.  I'm\n\tsorry!  I shouldn't have said that.\n\n\t\tMIERZWIAK\n\tI've got a wife, Mary.  Kids.  You know\n\tthat.\n\n\t\tMARY\n\t\t(suddenly weepy)\n\tI wish I was your wife.  I wish I had\n\tyour kids.\n\nMierzwiak comforts her with a hug.  It turns into kiss.  He\npulls away.\n\n\t\tMIERZWIAK\n\tWe can't do this.\n\n\t\tMARY\n\tNo you're right.  Once again.  You're a\n\tdecent man, Howard.\n\nHe smiles sadly at her.  She smiles courageously at him.\n\n\t\tMIERZWIAK\n\tI want you to know it's not because I'm\n\tnot interested.  If that means anything.\n\nThey look at each other a long while, then Howard goes back\nto locating and eradicating blips of lights.\n\nEXT. JOEL'S APARTMENT BUILDING - NIGHT\n\nStan sits in the van and smokes a cigarette.  He has an\nunobstructed view into Joel's bedroom window.  He watches\nMierzwiak and Mary.  They're talking as Howard works.  It\nappears to be a very serious discussion.  A car pulls up\noutside.  Stan turns to see.  A middle-aged woman gets out,\nchecks the address on Joel's building, approaches the only\nlit window, watches Mierzwiak and Mary inside.  Mierzwiak's\nresolve has apparently weakened and he and Mary kiss again.\nThis time it leads to groping, partial undressing, and\nfalling onto the bed alongside the unconscious Joel.  The\nwoman in the window is transfixed.  As Mierzwiak fumbles to\nunzip his pants, he catches sight of the woman in the window.\nHe practically shrieks and jumps up.\n\nEXT. COUNTRY ROAD - DAY\n\nJoel and Clementine walking, hand-in-hand, look up\nsimultaneously.\n\nINT. JOEL'S BEDROOM - CONTINUOUS\n\nMary looks confusedly at Howard.\n\n\t\tMARY\n\tWhat?\n\nShe follows his eyes and sees the woman in the window, who\nturns and walks off in a huff.\n\n\t\tMARY (CONT'D)\n\tOh my God!\n\nMierzwiak is already in his coat.  He's out the door.\n\nEXT. JOEL'S APARTMENT BUILDING - CONTINUOUS\n\nThe woman is at her car.  Stan watches from the van.\nMierzwiak is hurrying to the woman.\n\n\t\tMIERZWIAK\n\tHollis!  Hollis!\n\n\t\tHOLLIS (THE MIDDLE-AGED WOMAN)\n\tI knew it, Howard.  I don't even know why\n\tI bothered to copy the damn address.\n\n\t\tMIERZWIAK\n\tIt didn't start out to be this.  I came\n\there to work.  It's a one-time mistake.\n\nMary is right behind Mierzwiak now.  Hollis is in her car.\n\n\t\tMARY\n\t\t(heroically)\n\tMrs. Mierzwiak, it's true.  And it's not\n\tMr. Mierzwiak's fault.  I'm a stupid\n\tlittle girl with a stupid little crush.\n\tI basically forced him into it.  I swear.\n\nHollis turns, looks at Mary and then at Mierzwiak.\n\n\t\tHOLLIS\n\tDon't be a monster, Howard.  Tell the\n\tgirl.\n\nStan is out of the van now, listening.  Mary shivers in the\ncold, hugs herself.  There's a long silence.  Then:\n\n\t\tMARY\n\tTell me what?\n\nHollis and Mierzwiak have locked eyes.  Mary looks back and\nforth between them.  Hollis starts her car.\n\n\t\tHOLLIS\n\tPoor kid.  You can have him.  You did.\n\nShe drives off.  Mary watches Howard with increased\nforeboding.\n\n\t\tMARY\n\tWhat, Howard?\n\n\t\tMIERZWIAK\n\tWe... have a history.  I'm sorry.  You\n\twanted the procedure.  You wanted it\n\tdone... to get past.  I have to finish in\n\tthere.  It's almost morning.  We'll talk\n\tlater.\n\nHe shuffles inside.  Mary stands there, unable to digest\nthis, struggling in vain to remember.  Stan watches.\n\n\t\tSTAN\n\tLet me take you home.\n\nMary shakes her head \"no.\"  She walks off, dazed.\n\nEXT. CHARLES RIVER - NIGHT\n\nClementine and Patrick lie on their backs on the frozen river\nand look up at the night sky.\n\n\t\tPATRICK\n\tI could die right now, Clem.  I'm just\n\thappy.  I've never felt that before.  I'm\n\tjust exactly where I want to be.\n\nClementine looks over at him.  Their eyes meet.  She sobs.\n\n\t\tCLEMENTINE\n\tI want to go home.\n\nShe hurries toward the shore, slips on the ice, gets up, and\ncontinues, now running.\n\nINT. COMMUTER TRAIN - NIGHT\n\nMary, in shock, sits in the empty fluorescent car.  She tries\nto look out the window but can only see her own reflection.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nIt's deathly silent as Mierzwiak and Stan work on completing\nthe job.  Mierzwiak locates a light hidden very deep in the\nmap of Joel's brain.  He targets it.\n\nEXT. ROWBOAT - DAY\n\nJoel, the size of a ten year old, sits fishing with his\noversized father.  Clementine is naked and in the boat, too.\nShe's reading The Play by Stephen Dixon.\n\n\t\tCLEMENTINE\n\tI love this book, Joel.  Thank you so\n\tmuch for telling me about it.\n\nJoel is his father.  The father is drunk and sullen.  He\nfaces away from Joel, looks out at the lake.\n\n\t\tFATHER\n\tDon't be like me, son.  Don't waste your\n\tlife.  You'll come to a point someday\n\twhere it'll be too late.  You'll be sewn\n\tinto your fate...\n\n\t\tJOEL\n\tIt was horrifying, seeing my father like\n\tthat.\n\tThere was no hope for me if his life was\n\tsuch a failure.  And he saw failure in\n\tme, too, written in my future.\n\nClementine watches the frightened, confused Joel.\n\n\t\tCLEMENTINE (CONT'D)\n\tJoel, you're not sewn in.  He's wrong.\n\n\t\tFATHER\n\t...and there'll be nowhere to go except\n\twhere you're headed, like a train on a\n\ttrack.  Inevitable, unalterable.\n\nThe scene poops out of existence with a flash of light.\n\nINT. CHINESE RESTAURANT - NIGHT\n\nJoel finds himself eating Chinese food and sitting across\nfrom Clementine.  He is ragged and jarred.\n\n\t\tJOEL\n\tI'm done, Clem.  I'm just going to ride\n\tit out.  Hiding is clearly not working.\n\n\t\tCLEMENTINE\n\tYeah.\n\n\t\tJOEL\n\tI want to enjoy my little time left with\n\tyou.\n\n\t\tCLEMENTINE\n\tThis is our first \"date\" date.\n\n\t\tJOEL\n\tDo you remember what we talked about?\n\n\t\tCLEMENTINE\n\tNaomi, I guess.\n\n\t\tJOEL\n\tYeah.\n\n\t\tCLEMENTINE\n\tWhat was I wearing?\n\n\t\tJOEL\n\tGod, I should know.  Your hair was red.\n\tI remember it matched the wallpaper.\n\n\t\tCLEMENTINE\n\tEgad, were you horrified?\n\n\t\tJOEL\n\tNo!  I think you were wearing that black\n\tdress, y'know, with the buttons.\n\nShe is wearing the black dress.\n\n\t\tCLEMENTINE\n\tNo, you were with me when I bought that.\n\tAt that place on East 6th.  It was later.\n\nINT. DRESS SHOP - SHOP\n\nThe scene has already been erased.  It's just a decayed husk.\nA vague Joel watches a vague Clementine model a black dress.\n\nINT. RESTAURANT - NIGHT\n\nClementine wears a generic black dress now.\n\n\t\tJOEL\n\tRight.  Something black though.\n\n\t\tCLEMENTINE\n\tI'll buy that.  Black's always good.\n\n\t\tJOEL\n\tWe did talk about Naomi.\n\n\t\tCLEMENTINE\n\tI said: Are you sure?  You seem unsure.\n\n\t\tJOEL\n\tI'm sure, I said.\n\n\t\tCLEMENTINE\n\tBut you weren't.  I could tell.\n\n\t\tJOEL\n\tI was so nervous.  I remember I couldn't\n\tthink of anything to say.  There were\n\tlong silences.\n\nThere is a long silence.\n\n\t\tJOEL (CONT'D)\n\tI thought I was foolish.  I thought I'd\n\tmistaken infatuation for love.  You said:\n\n\t\tCLEMENTINE\n\tSo what.  Infatuation is good, too.\n\n\t\tJOEL\n\tAnd I didn't have an argument.\n\nINT. CAR - NIGHT\n\nJoel and Clementine pull up to Clementine's house.\n\n\t\tJOEL\n\tI dropped you off after.  You said --\n\n\t\tCLEMENTINE\n\t\t(Mae West)\n\tCome up and see me... now.\n\n\t\tJOEL\n\tIt's very late.\n\n\t\tCLEMENTINE\n\tYes, exactly.  Exactly my point.\n\nINT. CLEMENTINE'S APARTMENT - NIGHT\n\nJoel and Clementine are in the midst of awkward shy sex.\n\n\t\tJOEL\n\tThis was our first time.\n\nThe scene starts to fade.  Joel watches Clementine disappear.\n\nINT. LACUNA RECEPTION AREA - NIGHT\n\nMary enters the dark room, frazzled.  She flips on the\nfluorescent lights and searches the file folders, finds one\nwith her name on it.  Her jaw drops.  With a shaky hand, she\nputs the tape into the player on her desk and presses \"play.\"\n\n\t\tMIERZWIAK VOICE\n\tOkay, so just tell me what you remember.\n\tAnd we'll take it from there.\n\n\t\tMARY'S VOICE\n\t\t(shaky)\n\tUm, I liked you immediately.  At the job\n\tinterview.  You seemed so... important\n\tand mature.  And I loved that you were\n\thelping all these people.  You didn't\n\tcome on to me at all.  I liked that.  I\n\twas tongue-tied around you at first.  I\n\twanted you to think I was smart.  You\n\twere so nice.  I loved the way you\n\tsmelled.  I couldn't wait to come to\n\twork.  I had these fantasies of us being\n\tmarried and having kids and just...\n\t\t(starts to cry)\n\t...and so... then... when...\n\tthat one day, when I thought you looked\n\tat me back... like... Oh, Howie, I can't\n\tdo this?  How can I do this?\n\n\t\tMIERZWIAK VOICE\n\tIt's what's best, Mary.  You know that.\n\nMary slumps to the floor.  We move into her eyes.\n\n\t\tMARY'S VOICE\n\tYeah, I know.  Oh, God.  Okay, well, I\n\twas so excited...\n\nA SERIES OF MURKY IMAGES.  NO DETAIL.\n\nA flirtatious look from Mierzwiak.\n\n\t\tMARY'S VOICE (CONT'D)\n\t...Remember you bought me that little\n\twind-up frog?\n\nA vague shot of a wind-up frog.\n\n\t\tMARY'S VOICE (CONT'D)\n\tAnd you said...\n\nA vague shot of Mierzwiak mouthing to Mary's voice.\n\n\t\tMARY'S VOICE (CONT'D)\n\t\"This is for your desk.  Just a little\n\ttoken\"\n\nBack to Mary sitting on the floor, listening to the tape.\n\n\t\tMARY'S VOICE (CONT'D)\n\tI knew then... I knew something was going\n\tto happen... something wonderful.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel sits in the quiet living room.  The scene is fading.\n\n\t\tJOEL\n\tNaomi.\n\n\t\tVOICE-OVER\n\tOn the couch.  Dark.  Quiet.  I wondered\n\tif I had made a terrible mistake.  I\n\talmost reached for the phone about a\n\tthousand times.  I thought I could take\n\tit back, erase it, explain I had\n\tmomentarily lost my mind. Then I told\n\tmyself we weren't happy.  That was the\n\ttruth.  That what we were was safe.\n\tIt was unfair to you and to me to stay in\n\ta relationship for that reason.  I\n\tthought about Clementine and the spark\n\twhen I was with her, but then I thought\n\twhat you and I had was real and adult and\n\ttherefore significant even if it wasn't\n\tmuch fun.   But I wanted fun.  I saw\n\tother people having fun and I wanted it.\n\tThen I thought fun is a lie, that no one\n\tis really having fun; I'm being suckered\n\tby advertising and movie bullshit... then\n\tI thought maybe not, maybe not.  And then\n\tI thought, as I always do at this point\n\tin my argument, about dying.\n\nINT. ROOM - DAY\n\nAn elderly man sits.\n\n\t\tVOICE-OVER\n\tI projected myself to the end of my life\n\tin some vague rendition of my old man\n\tself.  I imagined looking back with a\n\ttremendous hole of regret in my heart.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel sits.\n\n\t\tVOICE-OVER\n\tI didn't pick up the phone to call you,\n\tNaomi.  I didn't pick up the phone.\n\nThe scene dissolves.\n\nINT. JOEL'S APARTMENT - DAY\n\nNamoi is red-eyed from crying.  She is packing things in\nboxes.  Joel paces, steals glances at her, doesn't know what\nto say.  She holds up a book.  The scene starts to fade.\n\n\t\tNAOMI\n\tYours?\n\n\t\tJOEL\n\tYou take it.  I don't know.\n\nShe tosses it in a box.\n\n\t\tJOEL (CONT'D)\n\tNaomi, I really value our relationship.\n\tI hope it's possible for us to stay in\n\ttouch.\n\n\t\tNAOMI\n\tDon't do this to me now, Joel.  Really.\n\nINT. JOEL'S BEDROOM - DAY\n\nJoel watches out the window as Naomi stuffs a final box in\nthe trunk of a car.  There's another woman down there with\nher.  They get into the car and drive off.\n\nINT. BORDER'S BOOKSTORE - NIGHT\n\nJoel talks to Clementine.  The scene is fogging over.\n\n\t\tJOEL\n\tI told her today I need to end it.\n\n\t\tCLEMENTINE\n\tIs that what you want?\n\n\t\tJOEL\n\tI did it.  I guess that means something.\n\nClementine shrugs.  The scene fades.\n\nEXT. PARK - DAY\n\nJoel walks with Naomi.\n\n\t\tNAOMI\n\tSo what's going on, Joel?\n\n\t\tJOEL\n\tI don't know, I've just been thinking,\n\tmaybe we're not happy with each other.\n\n\t\tNAOMI\n\tWhat?\n\n\t\tJOEL\n\tY'know, we've been, I don't know, sort\n\tof, unhappy with each other and --\n\n\t\tNAOMI\n\tDon't say \"we\" when you mean \"you.\"\n\n\t\tJOEL\n\tI think maybe, we're both so used to\n\toperating at this level that -- How can\n\tone person be unhappy?  If one person is\n\tunhappy, both have to be... by\n\tdefinition.\n\n\t\tNAOMI\n\tBullshit.  Who is it?  You met someone.\n\n\t\tJOEL\n\tNo.  I just need some space, maybe.\n\n\t\tNAOMI\n\tThe thing is, Joel, whatever it is you\n\tthink you have with this chick, once the\n\tthrill wears off, you're just going to be\n\tJoel with the same fucking problems.\n\n\t\tJOEL\n\tIt's not somebody else.\n\n\t\tVOICE-OVER\n\tI hate myself.\n\nNaomi walks off.  Joel watches her.  The scene fades.\n\nINT. BORDER'S BOOKSTORE - NIGHT\n\nJoel enters, looks around.  There's no sign of Clementine.\nJoel approaches a male employee.\n\n\t\tJOEL\n\tIs there a Clementine who works here?\n\n\t\tMALE EMPLOYEE #1\n\t\t(calling to another male\n\t\t employee)\n\tMark, is Clem on tonight?\n\n\t\tMALE EMPLOYEE #2\n\tOn my dick, bro.\n\t\t(turns, sese Joel, embarrassed)\n\tOh, hey.  Yeah, I think she's upstairs in\n\tPhilosophy.\n\nJoel climbs stairs, searches the aisle, spots Clementine.\n\n\t\tJOEL\n\tHi.\n\nShe turns.\n\n\t\tCLEMENTINE\n\tI didn't think you'd show your face\n\taround me again.  I figured you were\n\thumiliated.  You did run away, after all.\n\n\t\tJOEL\n\tSorry to track you down like this.  I'm\n\tnot a stalker.  But I needed to see you.\n\n\t\tCLEMENTINE\n\t\t(seemingly uninterested)\n\tYeah?\n\n\t\tJOEL\n\tI'd like to... take you out or something.\n\n\t\tCLEMENTINE\n\tWell, you're married.\n\n\t\tJOEL\n\tNot yet.  Not married.\n\n\t\tCLEMENTINE\n\tLook, man, I'm telling you right off the\n\tbat, I'm high maintenance.  So I'm not\n\tgoing to tiptoe around your marriage or\n\twhatever it is you got going there.  If\n\tyou want to be with me, you're with me.\n\n\t\tJOEL\n\tOkay.\n\n\t\tCLEMENTINE\n\tSo make your domestic decisions and maybe\n\twe'll talk again.\n\nShe goes back to stacking.  Joel stands there helplessly.\n\n\t\tJOEL\n\tI just think that you have some kind\n\tof... quality that seems really important\n\tto me.\n\nThe scene is disintegrating.  Clementine's speech is\ndelivered without passion.\n\n\t\tCLEMENTINE\n\tJoel, I'm not a concept.  I want you to\n\tjust keep that in your head.  Too many\n\tguys think I'm a concept or I complete\n\tthem or I'm going to make them alive, but\n\tI'm just a fucked-up girl who is looking\n\tfor my own peace of mind.  Don't assign\n\tme yours.\n\n\t\tJOEL\n\tI remember that speech really well.\n\n\t\tCLEMENTINE\n\t\t(smiling)\n\tI had you pegged, didn't I?\n\n\t\tJOEL\n\tYou had the whole human race pegged.\n\n\t\tCLEMENTINE\n\tProbably.\n\n\t\tJOEL\n\tI still thought you were going to save\n\tme.  Even after that.\n\n\t\tCLEMENTINE\n\tI know.\n\n\t\tJOEL\n\tIt would be different, if we could just\n\tgive it another go around.\n\n\t\tCLEMENTINE\n\tRemember me.  Try your best.  Maybe we\n\tcan.\n\nThe scene is gone.\n\nINT. ROB AND CARRIE'S CAR - NIGHT\n\nJoel sits forlornly in the back seat.  Rob drives and Carrie\nsits in the front passenger seat.  The car stops in front of\nJoel's apartment building.\n\n\t\tJOEL\n\tThanks, guys.\n\n\t\tCARRIE\n\tI hope you feel better, sweetie.\n\n\t\tJOEL\n\tYeah.\n\n\t\tCARRIE\n\tSay hi to Naomi.\n\nThe car door closes.\n\nINT. BUILDING STAIRWAY - NIGHT\n\nJoel climbs the stairs.\n\n\t\tVOICE-OVER\n\tI hope she's not up.  I need to think.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nThe lights are off.  Joel sits on a chair near the window,\nwriting in his journal.  The streetlight illuminates the\npaper.  Naomi sleeps in the bed.\n\n\t\tVOICE-OVER\n\tI met someone tonight at a party on the\n\tbeach.  Her name is Clementine.  There is\n\tsomething alive about her.\n\nNaomi turns over in bed, sees Joel.\n\n\t\tNAOMI\n\t\t(full of sleep)\n\tHi.\n\n\t\tJOEL\n\tHi.\n\n\t\tNAOMI\n\tHow was it?\n\n\t\tJOEL\n\tYou didn't miss much.  Rob Carrie say\n\thello.\n\n\t\tNAOMI\n\tHi, Rob and Carrie.\n\n\t\tJOEL\n\tGo back to sleep.\n\nThe room is starting to decompose.\n\n\t\tNAOMI\n\tYeah.  Come to bed.  I'm cold.\n\n\t\tJOEL\n\tIn a minute.\n\nNaomi turns over.  Joel goes back to his writing.\n\n\t\tVOICE-OVER\n\t\t(more and more emotionless)\n\tI don't know what to do about this.  I've\n\tbeen feeling so alienated and numb\n\tlately.  Forever.  The thought of not\n\tacknowledging my feelings again seems\n\tself-destructive.\n\tHow can I continue on this path toward a\n\tliving death, a life filled with\n\tobligation and guilt and responsibility\n\tbut joyless, hopeless?  I need to speak\n\twith Clementine.\n\nThe scene has turned to a husk.\n\nINT. JOEL'S APARTMENT - AFTERNOON\n\nJoel is at his closet, putting on a sweater.  Naomi is at the\ndining room table, papers spread out before her, writing.\nJoel turns and watches her for a moment.\n\n\t\tJOEL\n\tSo you don't mind?\n\n\t\tNAOMI\n\tI've got to finish this chapter anyway.\n\nThe scene is fading.\n\n\t\tJOEL\n\tOkay.  I wish you could come.\n\n\t\tVOICE-OVER\n\tThis is it.  The night we met.  My God,\n\tit's over.\n\n\t\tNAOMI (CONT'D)\n\tMe, too.\n\nHe approaches Naomi, kisses her on the top of the head.  She\ncontinues to write.\n\n\t\tNAOMI (CONT'D)\n\tSay hi to Rob and Carrie.  Have some fun!\n\n\t\tJOEL\n\tI hope you get your work done.\n\n\t\tNAOMI\n\t\t(sighing)\n\tYeah.\n\nINT. ROB AND CARRIE'S CAR - NIGHT\n\nRob drives.  Carrie fiddles with the radio dial in the front\npassenger seat.  Joel sits in the back.\n\n\t\tCARRIE\n\tI'm sorry Naomi couldn't make it.  You\n\tokay?  You seem quiet.\n\n\t\tJOEL\n\tJust a little overworked, maybe.\n\n\t\tVOICE-OVER\n\tThe trip to the party where I met\n\tClementine.  My first memory of her is\n\tnow my last memory of her.\n\nJoel looks out the window.  Carrie turns around and says\nsomething to Joel.  She is backlit, her hair a halo of frizz.\n\n\t\tJOEL\n\tI remember you turned around.  Your face\n\twas dark and your hair was backlit -- I\n\tcould see a halo of frizz -- you asked me\n\tif things were okay between Naomi and me.\n\n\t\tCARRIE\n\tI did.  You said, things were fine.\n\n\t\tJOEL\n\tI remember.\n\n\t\tCARRIE\n\tThis is the night you met Clementine,\n\tJoel.  I remember watching you walk down\n\tthe beach with her and I thought, oh\n\tshit.\n\n\t\tJOEL\n\tYeah, you told me that later.\n\n\t\tCARRIE\n\tI told you that later.\n\nJoel looks out he window.  He sees the husk of a memory on\nthe darkened roadside.  It's Joel and Carrie in:\n\nINT. ROB AND CARRIE'S KITCHEN - DAY\n\nFaded.  Carrie and Joel sit at the table with coffee.\n\n\t\tCARRIE\n\tWho was the girl you walked off with?\n\n\t\tJOEL\n\tNo one.\n\nEXT. BEACH PARKING LOT - NIGHT\n\nRob, Carrie, and Joel emerge from the car, parked amidst a\nsmall cluster of cars in an otherwise empty parking lot.\n\nEXT. BEACH - NIGHT\n\nJoel watches his shoes in the sand as he trudges along.\n\n\t\tCARRIE\n\tIs this the right way?\n\nEXT. BEACH - MOMENTS LATER\n\nJoel, Rob, and Carrie step out of the brush and see a bonfire\ndown the beach.  People and music can be heard.\n\nEXT. BEACH - LATER\n\nJoel sits on a log, a paper plate of chicken and corn on his\nlap.  People warm themselves at the fire.  Joel watches\ncouples talking, kissing, Rob sharing a joint with a guy.\n\n\t\tJOEL\n\tYou were down by the surf.  I could just\n\tmake you out in the dark.\n\nJoel looks down to the water.  There's Clementine, in her\norange hooded sweatshirt, looking out to sea.\n\n\t\tJOEL (CONT'D)\n\tYour back to me.  In that orange\n\tsweatshirt I would come to know so well\n\tand even hate eventually.  At the time I\n\tthought, how cool, an orange sweatshirt.\n\n\t\tVOICE-OVER\n\tI remember being drawn to you even then.\n\tI thought, I love this woman because\n\tshe's alone down there looking out at the\n\tblack ocean.\n\n\t\tJOEL (CONT'D)\n\tBut I went back to my food.  The next\n\tthing I remember, I felt someone sitting\n\tnext to me and I saw the orange sleeve\n\tout of the corner of my eye.\n\nA shot of the orange sleeve.  Joel looks up.\n\n\t\tCLEMENTINE\n\tHi there.\n\n\t\tJOEL\n\tHi.\n\n\t\tVOICE-OVER\n\tI was so nervous.  What were you doing\n\tthere, I wondered.  Your hair was lime\n\tgreen.  Green revolution.\n\nA shot of her green hair.\n\n\t\tJOEL\n\tYou said...\n\n\t\tCLEMENTINE\n\tI saw you sitting over here.  By\n\tyourself.  I thought, thank God, someone\n\tnormal, who doesn't know how interact at\n\tthese things either.\n\n\t\tJOEL\n\tYeah.  I don't ever know what to say.\n\n\t\tCLEMENTINE\n\tI can't tell you how happy I am to hear\n\tthat.  I mean, I don't mean I'm happy\n\tyou're uncomfortable, but, yknow... I'm\n\tsuch a loser.  Every time I come to a\n\tparty I tell myself I'm going to be\n\tdifferent and it's always exactly the\n\tsame and then I hate myself after for\n\tbeing such a clod.\n\n\t\tJOEL\n\tEven then I didn't believe you entirely.\n\tI thought how could you be talking to me\n\tif you couldn't talk to people?\n\n\t\tVOICE-OVER\n\tBut I thought, I don't know, I thought it\n\twas cool that you were sensitive enough\n\tto know what I was feeling and that you\n\twere attracted to it.\n\n\t\tCLEMENTINE\n\tBut, I don't know, maybe we're the normal\n\tones, y'know?  I mean, what kind of\n\tpeople do well at this stuff?\n\n\t\tVOICE-OVER\n\tAnd I just liked you so much.\n\n\t\tCLEMENTINE (CONT'D)\n\tYou did?  You liked me?\n\n\t\tJOEL\n\tYou know what I did.\n\n\t\tCLEMENTINE\n\tYeah, I know.  I'm fishing.\n\n\t\tJOEL\n\tYou said --\n\nShe picks a drumstick off of Joel's plate.\n\n\t\tCLEMENTINE\n\tI'm Clementine.  Can I borrow a piece of\n\tyour chicken?\n\n\t\tJOEL\n\tAnd you picked it out of my plate before\n\tI could answer and it felt so intimate\n\tlike we were already lovers.\n\n\t\tJOEL (CONT'D)\n\tI remember --\n\n\t\tVOICE-OVER\n\tThe grease on your chin in the bonfire\n\tlight.\n\nShot of a smudge of chicken grease on Clementine's chin.\n\n\t\tCLEMENTINE\n\tOh God, how horrid.\n\n\t\tJOEL\n\tI'm Joel.\n\n\t\tVOICE-OVER\n\tNo, it was lovely.\n\n\t\tCLEMENTINE (CONT'D)\n\tHi, Joel.  So no jokes about my name?\n\n\t\tJOEL\n\tYou mean, like...\n\t\t(singing)\n\tOh, my darlin', oh, my darlin', oh, my\n\tdarlin', Clementine... ?  Huckleberry\n\tHound?  That sort of thing?\n\n\t\tCLEMENTINE\n\tYeah, like that.\n\n\t\tJOEL\n\tNope.  No jokes.  My favorite thing when\n\tI was a kid was my Huckleberry Hound\n\tdoll.  I think your name is magic.\n\nShe smiles.\n\n\t\tCLEMENTINE\n\t\t(eyes welling)\n\tThis is it, Joel.  It's gonna be gone\n\tsoon.\n\n\t\tJOEL\n\tI know.\n\n\t\tCLEMENTINE\n\tWhat do we do?\n\n\t\tJOEL\n\tEnjoy it.  Say good-bye.\n\nShe nods.\n\nJoel and Clementine are walking near the surf.\n\n\t\tJOEL (CONT'D)\n\tSo you're still on the Zoloft?\n\n\t\tVOICE-OVER\n\tNext thing I remember we were walking\n\tdown near the surf.\n\n\t\tCLEMENTINE\n\tNo, I stopped.  I didn't want to feel\n\tlike I was being artificially modulated.\n\n\t\tJOEL\n\tI know what you mean.  That's why I\n\tstopped.\n\n\t\tCLEMENTINE\n\tBut my sleeping is really fucked up.\n\n\t\tJOEL\n\tI don't think I've slept in a year.\n\n\t\tCLEMENTINE\n\tYou should try Xanax.  I mean, it's a\n\tchemical and all, but it works... and it\n\tworks just having it around, knowing that\n\tit's there.  Like insurance.\n\n\t\tJOEL\n\tyeah?\n\n\t\tCLEMENTINE\n\tI'll give you a couple.  See what you\n\tthink.\n\n\t\tJOEL\n\tOkay.\n\n\t\tCLEMENTINE\n\tHave you ever read any Anna Akhmatova?\n\n\t\tJOEL\n\tI love her.\n\n\t\tCLEMENTINE\n\tReally?  Me, too!  I don't meet people\n\twho even know who she is and I work in a\n\tbook store.\n\n\t\tJOEL\n\tI think she's great.\n\n\t\tCLEMENTINE\n\tMe too.  There's this poem --\n\n\t\tJOEL\n\tDid this conversation come before or\n\tafter we saw the house?\n\n\t\tCLEMENTINE\n\tI think, before.\n\n\t\tJOEL\n\tSeems too coincidental that way.\n\n\t\tCLEMENTINE\n\tYeah, maybe.\n\nJoel and Clementine wander near some beach houses closed for\nthe winter.\n\n\t\tCLEMENTINE (CONT'D)\n\tDo you know her poem that starts \"Seaside\n\tgusts of wind,/And a house in which we\n\tdon't live...\n\n\t\tJOEL\n\tYeah, yeah.  It goes \"Perhaps there is\n\tsomeone in this world to whom I could\n\tsend all these lines\"?\n\n\t\tCLEMENTINE\n\tYes!  I love that poem.  It breaks my\n\theart.  I'm so excited you know it.\n\t\t(pointing to houses)\n\tLook, houses in which we don't live.\n\nJoel chuckles appreciatively.\n\n\t\tCLEMENTINE (CONT'D)\n\tI wish we did.  You married?\n\n\t\tJOEL\n\tUm, no.\n\n\t\tCLEMENTINE\n\tLet's move into this neighborhood.\n\nClementine tries one of the doors on a darkened house.  Joel\nis nervous.\n\n\t\tJOEL\n\tI do sort of live with somebody though.\n\n\t\tCLEMENTINE\n\tOh.\n\nShe walks to the next house, tries the door.\n\n\t\tCLEMENTINE (CONT'D)\n\tMale or female?\n\n\t\tJOEL\n\tFemale.\n\n\t\tCLEMENTINE\n\tAt least I haven't been barking up the\n\twrong tree.\n\nShe finds a window that's unlatched.  She lifts it.\n\n\t\tCLEMENTINE (CONT'D)\n\tCool.\n\n\t\tJOEL\n\tWhat are you doing?\n\n\t\tCLEMENTINE\n\tIt's freezing out here.\n\nShe scrambles in the window.  Joel looks around, panicked.\n\n\t\tJOEL\n\t\t(whisper)\n\tClementine.\n\n\t\tVOICE-OVER\n\tI couldn't believe you did that.  I was\n\tparalyzed with fear.\n\nThe front door opens and Clementine stands there beckoning.\n\n\t\tCLEMENTINE (CONT'D)\n\tC'mon, man.  The water's fine.  Nobody's\n\tcoming here tonight, believe me.  This\n\tplace is closed up.  Electricity's off.\n\n\t\tJOEL\n\tI hesitated for what seemed like forever.\n\n\t\tCLEMENTINE\n\tI could see you wanted to come in, Joel.\n\nHe walks cautiously toward the door.\n\n\t\tCLEMENTINE (CONT'D)\n\tAs soon as you walked in.  I knew I had\n\tyou.  You knew I knew that, right?\n\nINT. HOUSE - CONTINUOUS\n\nJoel enters the darkened and Clementine closes the door\nbehind him.\n\n\t\tJOEL\n\tI knew.\n\n\t\tCLEMENTINE\n\tI knew by your nervousness that Naomi\n\twasn't the kind of girl who forced you to\n\tcriminally trespass.\n\n\t\tJOEL\n\tIt's dark.\n\n\t\tCLEMENTINE\n\tYeah.  What's your girlfriend's name?\n\n\t\tJOEL\n\tNaomi.\n\nShe's searching through drawers for something.  She pulls out\na flashlight, shines it in Joel's face.\n\n\t\tCLEMENTINE\n\tAh-ha!  Now I can look for candles,\n\tmatches, and the liquor cabinet.\n\n\t\tJOEL\n\tI think we should go.\n\n\t\tCLEMENTINE\n\tNo, it's our house!  Just tonight --\n\t\t(looking at envelope on\n\t\t counter)\n\t-- we're David and Ruth Laskin.  Which\n\tone do you want to be?  I prefer to be\n\tRuth but I'm flexible.\n\t\t(opens cabinet)\n\tAlcohol!  You make drinks.  I'm going\n\tfind the bedroom and slip into something\n\tmore Ruth.  I'm ruthless at the moment.\n\nShe runs upstairs, giggling.  The room is drying out, turning\ninto a husk.\n\n\t\tJOEL\n\t\t(calling after her)\n\tI really should go.  I really need to\n\tcatch my ride.\n\n\t\tVOICE-OVER\n\tI didn't want to go.  I was too nervous.\n\tI thought, maybe you were a nut.  But you\n\twere exciting.  You called from upstairs.\n\n\t\tCLEMENTINE (CONT'D)\n\t\t(flat)\n\tSo go.\n\n\t\tJOEL\n\tI did.  I walked out the door.  I felt\n\tlike I was a scared little kid.  I\n\tthought you knew that about me.  I ran\n\tback to the bonfire, trying to outrun my\n\thumiliation.  You said, \"so go\" with such\n\tdisdain.\n\n\t\tCLEMENTINE (CONT'D)\n\t\t(poking her head downstairs)\n\tWhat if you stay this time?\n\n\t\tJOEL\n\tI walked out the door.  There's no more\n\tmemory.\n\n\t\tCLEMENTINE\n\tCome back and make up a good-bye at\n\tleast.  Let's pretend we had one.\n\nClementine comes downstairs, vague and robotic, making her\nway through the decaying environment.\n\n\t\tCLEMENTINE (CONT'D)\n\tBye, Joel.\n\n\t\tJOEL\n\tI love you.\n\nShe smiles.  They kiss.  It fades.\n\n\t\tCLEMENTINE\n\tI --\n\nEXT. BEACH - NIGHT\n\nJoel finds himself hurrying back to the bonfire.  This scene,\ntoo, is disintegrating.  It dries up and Joel is just\nstanding there on a faded beach at night, the bonfire frozen\nin the distance like a photograph.\n\nINT. CAR - NIGHT\n\nJoel sits in the back seat, Rob and Carrie are in the front.\n\n\t\tCARRIE\n\tDid you have fun?\n\nJoel nods glumly.\n\nCarrie continues to talk, but her voice goes under as Joel\nstudies the faded husks of memories, piled like refuse\noutside the moving car window.  He sees dried-out version of\nprevious interactions with Clementine playing out in loops.\nHe looks back and sees the memory of his ride home from the\nbeach with Rob and Carrie.  It, too, is decaying.  Soon all\nhas crumbled into dust.  Everything goes black.\n\nINT. JOEL'S BEDROOM - EARLY MORNING\n\nHoward watches the monitor.  The last specks of light are\nfading.  It grows dark.  He is tired, his eyes are hollow.\nHe turns to Stan, who is staring out the window at the dawn.\n\n\t\tHOWARD\n\tOkay.\n\nStan turns and wordlessly begins the clean-up.  He pulls the\nelectrodes off of Joel's scalp, coils cable, packs bags.\nHoward dials the bedside phone.  He waits as it rings.\n\n\t\tHOLLIS'S VOICE\n\tHi, you've reached the Mierzwiaks.  We\n\tcan't come to --\n\nHoward hangs up.\n\nEXT. JOEL'S APARTMENT BUILDING - EARLY MORNING\n\nStan and Howard load the last of the equipment into the back\nof the van.  He and Howard look at each other.\n\n\t\tSTAN\n\tSo, I've got to drop the van off.\n\n\t\tMIERZWIAK\n\tThanks, Stan.  Thanks.\n\nINT. PATRICK'S CAR - EARLY MORNING\n\nPatrick and Mary are heading home from Boston.  Mary is\nsilent and depressed.  Patrick tries to break the silence.\n\n\t\tPATRICK\n\tYou want to stop for coffee or something?\n\nMary shakes her head \"no.\"  Long silence.\n\n\t\tPATRICK (CONT'D)\n\tWell, it was sure beautiful on that\n\triver.  Thanks for sharing it with me.\n\nMary doesn't say anything.  Silence.\n\n\t\tPATRICK (CONT'D)\n\tWell do it again soon.\n\nEXT. PARKING STRUCTURE - EARLY MORNING\n\nStan pulls the van into space marked \"Lacuna.\"  He gets out,\ncrosses to his car.  Mary is sitting on the hood.\n\n\t\tSTAN\n\tHey.\n\n\t\tMARY\n\t\t(beat)\n\tDo you swear you didn't know?\n\n\t\tSTAN\n\tI swear.\n\n\t\tMARY\n\tAnd you never even suspected?  Never saw\n\tus behaving in any unusual way together?\n\n\t\tSTAN\n\tOnce, maybe.\n\nShe watches him closely, waiting for him to continue.\n\n\t\tSTAN (CONT'D)\n\tIt was here.  At his car.  I was coming\n\tback from a job and spotted you together.\n\tYou seemed caught.  I waved.  You\n\tgiggled.\n\n\t\tMARY\n\tHow did I look?\n\n\t\tSTAN\n\t\t(beat)\n\tHappy.  Happy with a secret.\n\nMary starts to cry.\n\n\t\tMARY\n\tAnd after that?\n\n\t\tSTAN\n\tI never saw you together like that again.\n\tSo I figured I was imagining things.\n\nMary says nothing.\n\n\t\tSTAN (CONT'D)\n\tI really like you, Mary.  You know that.\n\n\t\tMARY\n\tDo you remember anything else?  What I\n\twas wearing?  Was I standing close to\n\thim?  Was I leaning against his car like\n\tI owned it?  How did he look at me when I\n\tgiggled?  Tell me everything.\n\n\t\tSTAN\n\t\t(thinking)\n\tYou were in red.  That red sweater with\n\tthe little flowers, I think.  You were\n\tleaning against his car.\n\t\t(thinking)\n\tHe looked a little like a kid.  Kind of\n\tgoofy and wide-eyed.  I'd never seen him\n\tlook like that before.  Happy.  You\n\tlooked beautiful.  You looked in love.\n\n\t\tMARY\n\t\t(heading toward the levator)\n\tThanks, Stan.\n\nShe stops but doesn't turn to face him.\n\n\t\tMARY (CONT'D)\n\tYou're nice.\n\t\t(beat)\n\tBut I love him.  I knew I loved him.  Now\n\tI know.\n\nHe nods.  She waves, heads to the elevator.\n\nINT. JOEL'S BEDROOM - MORNING\n\nJoel awakens.  The apartment is neat, like when he went to\nsleep.  He gets out of bed and heads into the bathroom.\n\nEXT. COMMUTER TRAIN STATION - MORNING\n\nJoel waits on the crowded platform.  The platform across the\ntracks is empty.  Joel's train arrives.  It's packed.  He\nsqueezes on with all the other commuters.\n\nINT. OFFICE - DAY\n\nJoel works in his cubicle over the light table.  He seems\ndistracted.  He dials his phone.  He's nervous.\n\n\t\tJOEL\n\tHi... Naomi?  Yeah, hi!  How are you?  I\n\tknow, I know.  It's been a long time.\n\tNot too much.  You?  Oh, that's great!\n\tCongratulations!  Maybe I could buy you\n\tdinner to celebrate?  Tonight?  I'm free.\n\tOkay, good!\n\nINT. LACUNA RECEPTION AREA - DAY\n\nMary does paperwork at her desk.  She looks through her\nreception window at the sad people waiting in the lobby with\ntheir bags of stuff.\n\nINT. MIERZWIAK'S OFICE - CONTINUOUS\n\nMierzwiak dials his phone and waits.  He hangs up.  Mary\nenters with the papers.\n\n\t\tMARY\n\tI need this signed, Howard.\n\nHe takes it, unable to make eye contact.  He signs it, hands\nit back.\n\n\t\tMARY (CONT'D)\n\tThanks.\n\t\t(beat)\n\tSo... do we talk about this... or what?\n\n\t\tMIERZWIAK\n\tI don't know what I'm supposed say, Mary.\n\tI want to do the right thing here.\n\n\t\tMARY\n\tDo you love me?  Did you love me?\n\tSomething.  I listened to my tape.  I\n\tcan't believe I've been sitting right in\n\tfront of it for a year.  It's like\n\tlistening to someone else's story.  I\n\tmean, I hear myself talking about having\n\tsex with you and I can't even imagine you\n\tnaked.  I can't even say \"naked\" to you!\n\n\t\tMIERZWIAK\n\tI have a family, Mary.\n\n\t\tMARY\n\tYou made me have an abortion.\n\n\t\tMIERZWIAK\n\tIt was a mutual decision.\n\n\t\tMARY\n\tYou made me have you erased!  I loved\n\tyou.  I love you!  How could you --\n\n\t\tMIERZWIAK\n\tI didn't make you.  You thought it best.\n\t\t(off her stare)\n\tBut, look, I take full responsibility.\n\nShe looks at him for a long while.  Then, out of frustration,\nshe screams.\n\nINT. RESTAURANT - NIGHT\n\nJoel sits across from Naomi.\n\n\t\tNAOMI\n\t\t(oddly cautious)\n\tSo... you haven't been involved with\n\tanyone in all this time?\n\n\t\tJOEL\n\tIt's been a pretty lonely couple of\n\tyears.\n\n\t\tNAOMI\n\tI'm sorry.\n\n\t\tJOEL\n\tWell, it was my fault -- the break-up.\n\tI'm sorry.\n\n\t\tNAOMI\n\tOh, sweetie.  It really does cut both\n\tways.  We were taking each other for\n\tgranted and --\n\n\t\tJOEL\n\tI miss you.\n\n\t\tNAOMI\n\tMiss you, too.\n\t\t(awkward pause)\n\tI have been seeing someone for a little\n\twhile.\n\n\t\tJOEL\n\t\t(trying for enthusiasm)\n\tOh!  Great.  That's great!\n\n\t\tNAOMI\n\tA religion instructor at Columbia.  A\n\tgood guy.  He's a good guy.\n\n\t\tJOEL\n\tI'm sorry.  I really shouldn't have --\n\n\t\tNAOMI\n\tI'm glad you called.\n\nINT. JOEL'S BEDROOM - NIGHT\n\nJoel and Naomi are in bed having sex.  There are certain\nsexual routines, habits, they have fallen back into almost\nimmediately.  She sticks her tongue in his ear in a way\nthat's trying to be sexual but just feels embarrassing to\nhim.  They finish and lie there.\n\n\t\tJOEL\n\tSo you think the dissertation will get\n\tpublished?\n\n\t\tNAOMI\n\tI don;t know.  I'm not sure there's a big\n\tpublic demand for books on Calvinism and\n\tMisogyny.\n\nINT. CLEMENTINE'S APARTMENT - NIGHT\n\nClementine lies in bed with Patrick.\n\nEXT. COMMUTER TRAIN STATION - MORNING\n\nThe platform is crowded with business commuters.  Joel is\namong them.\nThe platform across the tracks from them is empty.  Suddenly,\nJoel turns and makes his way through the crowd.  He climbs\nthe stairs, crosses the overpass and makes his way to the\nempty platform.  An almost empty train pulls into that\nplatform.  Joel gets on the train and watches the business\ncommuters through the dirty window as his train pulls out of\nthe station.\n\nINT. MARY'S APARTMENT - MORNING\n\nMary gets out of bed.  She has been crying all night.  She's\na wreck.  She puts on some coffee then crosses into the\nliving room area.  Sitting there are piles of the files from\nwork.  She pulls the top one out, copies the name and address\nonto an envelope stuffs the file and tape cassette in.  She\npulls another file out.  This one has Joel's name on it.  She\ncopies it onto an envelope.\n\nINT. CLEMENTINE'S APARTMENT - NIGHT\n\nJoel says goodbye to Clementine.\n\n\t\tCLEMENTINE\n\tSo you'll call me, right?\n\n\t\tJOEL\n\tYeah.\n\n\t\tCLEMENTINE\n\tWhen?\n\n\t\tJOEL\n\tTomorrow?\n\n\t\tCLEMENTINE\n\tTonight.  Just to test out the phone\n\tlines.\n\n\t\tJOEL\n\tYeah.\n\nJoel exits.  We stay on Clementine as she watches Joel head\nto his car, tromping through the snow.\n\nINT. JOEL'S APARTMENT - NIGHT\n\nJoel enters, drops his overcoat on a chair, dials the phone.\n\n\t\tJOEL\n\tHi, Naomi, it's Joel.\n\n\t\tNAOMI'S VOICE\n\tHi.\n\n\t\tJOEL\n\tHow's it going?\n\n\t\tNAOMI'S VOICE\n\tGood.  I called you at work today.  They\n\tsaid you were home sick.\n\n\t\tJOEL\n\tI know.  I had to take the day to think.\n\n\t\tNAOMI'S VOICE\n\tYeah, I tried you at home.  Did you get\n\tmy message?\n\n\t\tJOEL\n\tI just got in.\n\n\t\tNAOMI'S VOICE\n\tLong day thinking.\n\nJoel flips on messages with volume down.\n\n\t\tJOEL\n\tYeah, I suppose so.\n\n\t\tNAOMI ON MACHINE\n\t\t(cheerful)\n\tHi.  They told me you were sick!  So...\n\tWhere are you?!  I had a really nice time\n\tlast night.  Just wanted to say hi, so...\n\thi.  Call me.  I'm home.  Call me!\n\n\t\tNAOMI'S VOICE\n\tThat's me.\n\n\t\tJOEL\n\tThere you are.\n\t\t(pause)\n\tNaomi, it's just... I'm afraid if we fall\n\tback into this fast without considering\n\tthe problems we had...\n\n\t\tNAOMI\n\tOkay, Joel.  I suppose you're right.\n\n\t\tJOEL\n\tI had a good time last night.  I really\n\tdid.\n\n\t\tNAOMI\n\tSo I'm going to get some sleep.  I'm glad\n\tyou're okay.\n\n\t\tJOEL\n\tWe'll speak soon.\n\n\t\tNAOMI\n\t'Night.\n\nShe hangs up and Joel stands there for a minute feeling\ncreepy, then he dials the number on a piece of paper.\n\n\t\tCLEMENTINE'S VOICE\n\tWhat took you so long?\n\n\t\tJOEL\n\tI just walked in.\n\n\t\tCLEMENTINE'S VOICE\n\tHmmm.  Do you miss me?\n\n\t\tJOEL\n\tOddly enough, I do.\n\n\t\tCLEMENTINE'S VOICE\n\tHa Ha!  You said, I do.  I guess that\n\tmeans we're married.\n\n\t\tJOEL\n\tI guess so.\n\n\t\tCLEMENTINE'S VOICE\n\tTomorrow night... honeymoon on ice.\n\nEXT. CHARLES RIVER - NIGHT\n\nClementine steps out onto it.  Joel follows nervously.\n\n\t\tCLEMENTINE\n\tDon't worry.  It's really solid this time\n\tof year.\n\n\t\tJOEL\n\tI don't know.\n\nShe takes his hand and he is suddenly imbued with confidence.\n\n\t\tJOEL (CONT'D)\n\tThis is so beautiful.\n\nShe squeezes his hand.\n\n\t\tCLEMENTINE\n\tIsn't it?\n\nShe runs and slides on the ice.  Joel is by himself now.\n\n\t\tJOEL\n\tI don't know.  What if it breaks?\n\n\t\tCLEMENTINE\n\tWhat if?\n\nClementine lies on her back and stares up at the stars.  Joel\nis paralyzed.  He looks back at the shore.\n\n\t\tJOEL\n\tI think I should go back.\n\n\t\tCLEMENTINE\n\tJoel, come here.  Please.\n\nHe hesitates then gingerly makes his way over to her.  She\nreaches for his hand and gently pulls him down.  He lies on\nhis back beside her, their bodies touching.  He wants to turn\nto her, but out of shyness, doesn't.  She holds his hand.\nThey look up at the stars.  She smiles, doesn't say anything\nand snuggles closer to him.\n\n\t\tJOEL\n\tListen, did you want to make love?\n\n\t\tCLEMENTINE\n\tMake love?\n\n\t\tJOEL\n\tHave sex.  Y'know --\n\n\t\tCLEMENTINE\n\tOh, um...\n\n\t\tJOEL\n\tBecause I just am not drunk enough or\n\tstoned enough to make that happen right\n\tnow.\n\n\t\tCLEMENTINE\n\tThat's okay.  I --\n\n\t\tJOEL\n\tI'm sorry.  I just wanted to say that.\n\tThis seems like the perfect romantic\n\texotic place to do it and --\n\n\t\tCLEMENTINE\n\tHey, Joel --\n\n\t\tJOEL\n\t-- and I'm just too nervous around you\n\tright now.\n\n\t\tCLEMENTINE\n\tI'm nervous, too.\n\n\t\tJOEL\n\tYeah?  I wouldn't have thought that.\n\n\t\tCLEMENTINE\n\tWell, you obviously don't know me.\n\n\t\tJOEL\n\tI'm nervous because I have and enormous\n\tcrush on you.\n\nShe smiles up at the sky.\n\n\t\tCLEMENTINE\n\tShow me which constellations you know.\n\nMONTAGE\n\nWe see people going to their mailboxes, finding manila\nenvelopes.  One by one they open the envelopes and pull out\ntapes.  We see stunned, confused, disbelieving reactions as\npeople listen to their tapes.\n\nEXT. CLEMENTINE'S APARTMENT - DAY\n\nJoel drops Clementine off.  She kisses him.\n\nINT. JOEL'S APARTMENT - A FEW MINUTES LATER\n\nJoel enters with his mail.  He opens a manila envelope, reads\nthe enclosed file, sticks the cassette tape in his stereo,\nlistens.  Joel dials the phone.\n\n\t\tCLEMENTINE'S VOICE\n\tYeah?\n\n\t\tJOEL\n\tDid you send this?  Is it a joke?\n\n\t\tCLEMENTINE'S VOICE\n\tI probably got the same thing as you.\n\n\t\tJOEL\n\tI mean, I haven't even told anyone I've\n\tmet you.  Who would even know to do this?\n\n\t\tCLEMENTINE'S VOICE\n\t\t(matter of fact)\n\tMaybe it's true then.  It's my voice on\n\tthe tape.\n\n\t\tJOEL\n\tThat's what you have to say?  How could\n\tit be true?  I never even heard of any\n\tprocedure like this.  It's a joke.\n\n\t\tCLEMENTINE\n\tMaybe.  Call someone who'd know.\n\nMONTAGE\n\nWe see the people we saw opening envelopes, now on the phone.\nWe hear over and over:  \"Is this true?\", \"Did this really\nhappen?\", \"Do I know you?\", \"Is it true?\"\n\nINT. ROB AND CARRIE'S KITCHEN - DAY\n\nCarrie is on the phone.  She pauses nervously, then speaks:\n\n\t\tCARRIE\n\tYes, Joel.  It is true.  We weren't\n\tsupposed to say anything.  They say it's\n\tlike waking a sleepwalker.\n\nINT. JOEL'S APARTMENT - CONTINUOUS\n\nJoel hangs up.  He dials the phone.\n\n\t\tJOEL\n\tIt's true.\n\n\t\tCLEMENTINE'S VOICE\n\tI know.  I spoke to my friend Magda.\n\nJoel is immersed in the several page document.\n\n\t\tJOEL\n\tLook, I have to go.  I have to think.\n\n\t\tCLEMENTINE'S VOICE\n\tJoel, we've fucked.  We've made love.\n\tLike a million times.  And we were so\n\tsweet and shy and inept with each other\n\tlast night.  Isn't that lovely?\n\nJoel doesn't know what to say as this registers.  He just\nstands there dumbly.\n\n\t\tCLEMENTINE'S VOICE (CONT'D)\n\tCome over here, sweetheart.  Please.\n\nINT. CLEMENTINE'S APARTMENT - LATER\n\nJoel and Clementine review their separate Lacuna packages\ntogether.\n\n\t\tCLEMENTINE\n\tSays you were closed off, non\n\tcommunicative, never told me what you\n\twere feeling.\n\n\t\tJOEL\n\tSays you were a bully...\n\n\t\tCLEMENTINE\n\t\t(laughing)\n\tA bully?  Moi?\n\n\t\tJOEL\n\tThat's what it says.  You drank too much,\n\tyou picked on me for being passive and\n\ttimid.\n\n\t\tCLEMENTINE\n\tWell, sounds like me.  Sorry, man.\n\t\t(reading)\n\tSays you were jealous and suspicious.\n\n\t\tJOEL\n\tSays you would sometimes disappear all\n\tnight, then brag to me about your sexual\n\tconquests.\n\n\t\tCLEMENTINE\n\tDid I use the term \"sexual conquests\" or\n\tis that your way of putting it.\n\n\t\tJOEL\n\tI don't know.\n\n\t\tCLEMENTINE\n\tDoesn't sound like me.\n\n\t\tJOEL\n\tSays you were a slob, leaving trails of\n\tpanties and dirty socks in your wake.\n\n\t\tCLEMENTINE\n\tSays you were constantly calling me a\n\tslob.\n\t\t(laughs)\n\tIt's sexy that we were like a married\n\tcouple, griping and overly-familiar and\n\tbored.  Don't you think?\n\n\t\tJOEL\n\t\t(considering)\n\tI sort of do.  But I only see it as a\n\tfantasy version of reality.  Cleaned up\n\tenough to be erotic.\n\n\t\tCLEMENTINE\n\tWe should have sex.  It's old hat for us.\n\nShe smiles at nervous Joel.\n\n\t\tCLEMENTINE (CONT'D)\n\tYou know my body like the back of your\n\thand.\n\nShe unbuttons her blouse.\n\n\t\tCLEMENTINE (CONT'D)\n\tEvery curve, every freckle.\n\nShe takes off her shirt.  He stares at her.  He has clearly\nnever seen this body before.\n\n\t\tJOEL\n\tYou're so beautiful.\n\nShe approaches him, kisses him, his arms wrap around her\nwaist for the first time.\n\nINT. LACUNA LTD. WAITING ROOM - MORNING\n\nStan enters the waiting room, now crowded with people holding\ntheir files, a stunned-looking lot.  There is a new woman in\nthe reception window.  The file cases behind her are bare.\n\n\t\tRECEPTIONIST\n\tMay I help you?\n\n\t\tSTAN\n\tI work here.  I used to work here.  Stan.\n\tPlease just tell Howard I'm here to clean\n\tout my desk.\n\n\t\tRECEPTIONIST\n\t\t(into phone)\n\tMr. Mierzwiak, Stan is here to -- Yes\n\tsir.\n\t\t(to Stan)\n\tHe says he needs to see you.\n\nINT. MIERZWIAK'S OFFICE - MOMENTS LATER\n\nStan enters.  Mierzwiak is pale and pacing.\n\n\t\tMIERZWIAK\n\tShe should not have done this, Stan.  As\n\tmad as she was... as justifiably --\n\n\t\tSTAN\n\tI don't know what you're talking about,\n\tHoward.\n\n\t\tMIERZWIAK\n\tMary has stolen our files and is sending\n\tthem back to people.\n\n\t\tSTAN\n\tJesus.\n\nMierzwiak turns up the volume on a small video monitor\nlooking in on the lab, where Patrick has clearly taken over\nStan's position.  He is in the process of interviewing a sad\nyoung woman.\n\n\t\tYOUNG WOMAN\n\t... so I called everybody I know and\n\tasked them to tell me everything.  Now I\n\tknow my entire history with him, but it's\n\tin the form of a story, I'm losing my\n\tmind.\n\n\t\tMIERZWIAK\n\tThis is why people must never be told.\n\tIt's like waking a --\n\n\t\tYOUNG WOMAN\n\tI don't know what to do.  Before I\n\tthought I was depressed for no reason.\n\tNow it's like I've been assigned a\n\treason.\n\n\t\tPATRICK\n\tThis never should've happened, ma'am.\n\tWe'll take care of it.\n\n\t\tMIERZWIAK\n\tI know you don't like me much, Stan, but\n\tplease talk to Mary.  She of all people\n\tshould know this is a dangerous thing\n\tshe's doing.\n\nINT. OFFICE - DAY\n\nJoel works over his light box.  His phone rings.\n\n\t\tJOEL\n\tHi, it's Joel.\n\n\t\tCLEMENTINE'S VOICE\n\tHey, lover.  Whatcha doing?\n\n\t\tJOEL\n\tI'm just, y'know, passing the time best I\n\tcan till I can see you.\n\n\t\tCLEMENTINE'S VOICE\n\tGod, I can't believe I ever hated you.\n\n\t\tJOEL\n\tYou must have been crazy.\n\n\t\tCLEMENTINE'S VOICE\n\tGuess what I'm wearing.\n\n\t\tJOEL\n\tI don't know.  Panties and --\n\n\t\tCLEMENTINE'S VOICE\n\tYour dried cum.\n\n\t\tJOEL\n\tJesus.\n\n\t\tCLEMENTINE\n\tYou're still excited by my irreverence.\n\tYou haven't yet started to think of it as\n\tmy \"gratuitous need to shock.\"\n\n\t\tJOEL\n\tI can't stop thinking about you.\n\n\t\tCLEMENTINE\n\tYay.  Meet me after work by the old mill.\n\n\t\tJOEL\n\tWhat old mill?  Is that somewhere we --\n\n\t\tCLEMENTINE\n\tI just wanted to say that.  Come by my\n\thouse.\n\nINT. MARY'S APARTMENT - DAY\n\nMary opens the door.  Stan stands there with two cups of take\nout coffee.\n\n\t\tMARY\n\tOh.\n\n\t\tSTAN\n\tHi.\n\n\t\tMARY\n\tWhat do you want, Stan?\n\n\t\tSTAN\n\tCan I... I brought some --\n\nShe steps aside for Stan to enter.  He does, looks around,\nsees the tapes and the stuffed envelopes on the floor.\n\n\t\tSTAN (CONT'D)\n\tWhat's this?\n\n\t\tMARY\n\tNothing.\n\n\t\tSTAN\n\tI know what it is.\n\n\t\tMARY\n\tThen why did you ask me?\n\n\t\tSTAN\n\tI don't know.  I just -- there are a lot\n\tof really confused people showing up at\n\tthe office.\n\n\t\tMARY\n\tThey have a right to know.  Howard is a\n\tthief.  He steals the truth.\n\t\t(suddenly weeping)\n\tI can't remember my baby!  I can't\n\tremember my baby.  It existed and I can't\n\teven remember.  Do you understand that?\n\nStan doesn't know what to say.  He stands there dumbly.  Mary\nslumps into a ball on a chair.\n\n\t\tSTAN\n\tMary, people come to him voluntarily.\n\n\t\tMARY\n\tI won't allow it.  Those who cannot\n\tremember the past are condemned to repeat\n\tit.  What do you think of that?  That's\n\tfrom my quote book.\n\n\t\tSTAN\n\tThe office is filled with people who want\n\ttheir memories re-erased.\n\n\t\tMARY\n\t\t(hysterically)\n\tRemember the Alamo!  Remember the Alamo!\n\n\t\tSTAN\n\tMary... please.  This is hurting people.\n\nLong pause, then:\n\n\t\tMARY\n\t\t(small)\n\tI don't want to hurt people.\n\t\t(breaking down)\n\tBut these things happened!  All these\n\tlittle sadnesses, the big ones.  What if\n\tno one remembers?  What does that do to\n\tthe world?\n\t\t(beat, quietly)\n\tSomeone has to remember, Stan.\n\nThey look at each other.\n\nEXT. PARK - AFTERNOON\n\nVague elliptical images of a young girl on a swig.\n\n\t\tSAD WOMAN'S VOICE\n\tI was by myself in the park because my\n\tfriend Davia was sick that day.  I was on\n\ta swing.  There was this smiling man\n\twalking a little bushy dog --\n\nVague shots of a man smiling, a scruffy dog on a leash.\n\n\t\tSAD WOMAN'S VOICE (CONT'D)\n\tThe man said something like, \"He's\n\tfriendly --\"\n\nVague shot of the man, his voice overlapping with the\nwoman's.\n\n\t\tSAD WOMAN'S VOICE (CONT'D)\n\t\"-- he won't bite.\"\n\n\t\tMAN\n\tHe won't bite.  You can pet him if you\n\twant...\n\nShot of the girl petting the dog.\n\n\t\tMAN\n\tDo you want to give him a biscuit?\n\nThe girl nods.\n\n\t\tMAN (CONT'D)\n\tThey're in my car.  Why don't you --\n\n\t\tDISTRAUGHT WOMAN'S VOICE\n\tExcuse me?  Hello?\n\nINT. LACUNA RECEPTION AREA - DAY\n\nMary, with a headset on, looks up, startled.  She switches\noff the tape.  She has been crying.  There's a pile of tapes\nnext to her.  The distraught woman is standing there.\n\n\t\tMARY\n\tMay I help you?\n\n\t\tDISTRAUGHT WOMAN\n\tI'm here for Dr. Mierzwiak.  My name is\n\tHelene Kernfeld.\n\n\t\tMARY\n\tYes, please have a seat.  The doctor will\n\tbe with you momentarily.\n\nThe woman sits.  Mary presses an intercom button.\n\n\t\tMARY (CONT'D)\n\tHoward, your 10:30.\n\nShe switches the tape back on.\n\n\t\tSAD WOMAN'S VOICE\n\tHe took me to his car and ...\n\nVague shot of the girl being raped.\n\nINT. COMMUTER TUBE - DAY\n\nThe old woman is staring off blankly, her giant manuscript in\nher lap, as she travels over the New York skyline.  We move\ninto her eyes.\n\nINT. VAGUE SPACE\n\nVague reenactments of memories intermingle in this undefined\nspace:\n\nThe young girl being raped by the man in the car.\n\nA soldier on a battlefield looking at his slaughtered\nfriends.\n\nA couple fighting, from the woman's point of view.\n\n\t\tMAN\n\tI...I... I... find you physically\n\trepulsive!  I can't even look at you!\n\nThey look at each other in silence.\n\nA little boy being called \"faggot\" by an endless succession\nof boys.\n\nThe aftermath of a car accident from the driver's POV.\n\nMary having an abortion.\n\nINT. COMMUTER TUBE - DAY\n\nThe old woman and her chair lift out of the line of\ncommuters.\n\nINT. WAITING ROOM - DAY\n\nIt's modern and well-appointed.  The old woman enters, sits\nbehind the reception desk, drops her manuscript into the\ndrawer.   She takes some pills with water.  An old man\nenters.\n\n\t\tOLD MAN\n\tHow are you today, Mary?\n\n\t\tOLD WOMAN (MARY)\n\tLet's see... Still dying, Howard.\n\n\t\tOLD MAN (HOWARD)\n\tYou don't have to jump down my throat.  I\n\twas trying to be nice.\n\n\t\tOLD WOMAN (MARY)\n\tWell, don't try.  It's unbecoming on you.\n\nOld Howard mutters something and disappears into the back.\nOld Mary pulls out a file from behind, removes a small disc,\nplaces it in a machine on her desk, slips on earphones and\nlistens, somewhat wearily but attentively.  We watch the\ncolor drain from her face, but don't hear the recording.\nAnother old woman enters the office.  Old Mary looks up,\nseems a bit startled, conceals it, turns off the tape.\n\n\t\tOLD WOMAN (MARY) (CONT'D)\n\tMay I help you?\n\n\t\tSECOND OLD WOMAN\n\tI'd like to make an appointment.\n\n\t\tOLD WOMAN (MARY)\n\tI think the doctor is free this morning.\n\tHe can probably take you right away for\n\tan initial consultation.\n\nThe second old woman smiles gratefully.\n\nINT. OLD MAN'S OFFICE - A FEW MINUTES LATER\n\nOld Howard works at his desk.  Old Mary enters with the\nsecond old woman.\n\n\t\tOLD WOMAN (MARY)\n\tDr. Mierzwiak, this is Clementine\n\tKruczynski.  She'd like to talk to you.\n\nOld Howard and the old Mary eye each other.\n\n\t\tOLD MAN (HOWARD)\n\tHello, Ms. Kruczynski.  Nice to meet you.\n\tPlease have a seat.\n\nHe indicates a sitting area.  She sits.  He joins her.\n\n\t\tOLD MAN (HOWARD) (CONT'D)\n\tWould you mind if I tape our discussion?\n\nShe shakes her hear.  He punches a couple of buttons on his\ncomputer console.  A tape recorder starts up and his computer\nscreen lights up so only he can see it.  On it we see a whole\nfile on Clementine Kruczynski: a list of fifteen dates of\nprevious erasures stretching back fifty years, all of them\ninvolving Joel Barish.\n\n\t\tOLD MAN (HOWARD) (CONT'D)\n\tSo, why don't you begin by telling me why\n\tyou've come here.\n\n\t\tSECOND OLD WOMAN (CLEMENTINE)\n\tWell, I met this man, Joel, three years\n\tago at a senior dance...  We'd both been\n\talone for so long and...\n\nINT. TUBE - NIGHT\n\nThe old woman (Mary) travels in the commuter tube over\nManhattan.  It's late, the tube is mostly empty.  She has\nearphones on.\n\n\t\tSECOND OLD WOMAN (CLEMENTINE) (V.O.)\n\tI remember Joel and I were having\n\tbreakfast --\n\nINT. VAGUE SPACE\n\nAn old man and the second old woman eat breakfast.\n\n\t\tSECOND OLD WOMAN (CLEMENTINE) (V.O.)\n\t-- I said something like we should go\n\tupstate and see the leaves change...\n\nThe old man looks up from his cereal and stares blankly.  The\nwoman smiles, but there is no response... just a dead stare.\n\n\t\tSECOND OLD WOMAN (CLEMENTINE) (V.O.)\n\t\t(CONT'D)\n\tHe just stared at me as if I didn't\n\texist.  As if I had never existed...\n\nINT. TUBE - CONTINUOUS\n\nThe second old woman's (Clementine) voice drones tinnily on\nin the distance.  The old woman with the earphones is dead,\nher eyes glassy and unseeing.\n\n\t\tSECOND OLD WOMAN (CLEMENTINE) (V.O.)\n\t-- his eyes used to be so filled with\n\tlove.  But it was gone.  How can I go\n\tback to being alone after seeing love?  I\n\twas alone for so long.  What had I done\n\twith my life?  I was alone so long.\n\nINT. SECOND OLD WOMAN'S APARTMENT - NIGHT\n\nThe old Clementine is unconscious on her bed, hooked up to\nmodern versions of the erasing machines.  Two young\ntechnicians monitor the equipment.  The woman's bedside phone\nrings.  Her machine picks up.  After a moment:\n\n\t\tOLD MAN'S VOICE\n\tHi, it's Joel.  What's going on, Clem?\n\tWhy won't you call me back?  Please call\n\tme.  We need to speak.\n\nThe machine clicks off.  One of the technicians reaches over\nand presses the \"erase\" button on the machine.\n\nBLACK.\n\nTHE END\n\n\n\n\n\nEternal Sunshine of the Spotless Mind\nWriters :   Charlie Kaufman  Michel Gondry  Pierre Bismuth\nGenres :   Drama  Romance  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:24:49.896678"}