{"title": "Evil Dead II: Dead by Dawn", "film_link": "/Movie Scripts/Evil Dead II: Dead by Dawn Script.html", "script_link": "/scripts/Evil-Dead-II-Dead-by-Dawn.html", "info_raw": "\n\nEvil Dead II: Dead by Dawn Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Sam Raimi  Scott Spiegel\nGenres  Horror  Fantasy  Comedy  Action\nScript Date : May 1986\n\nRead \"Evil Dead II: Dead by Dawn\" Script\n\n\n", "script": "\n\n\n\n   EVIL DEAD II seventh draft by Sam Raimi and Scott Spiegel\n\n\n\n   \n\n\n\n\n\n\n\n\n\n\n                        EVIL DEAD II\n\n                             BY\n\n                         Sam Raimi\n                       Scott Spiegel\n\n\n\n\n\n\n\n\n\n\nSEVENTH DRAFT - May 5, 1986\n\n\n\n\n\nFADE IN:\n\n                DE LAURENTIIS ENTERTAINMENT GROUP LOGO\n\n                                                        FADE OUT.\n\n\nFADE IN:\n\n                RENAISSANCE PICTURES LOGO\n\n                                                        FADE OUT.\n\n\n00    BLACKNESS                                             00\n\n      A sound is building.  Like a living wind.  A\n      thousand screams in agony.\n\n      From the blackness, gusts of smoke pull together\n      quickly, forming the Main Title against black:\n\n                         \"EVIL DEAD\"\n\n      Then beneath it, the Roman Numeral \"II.\"\n\n      A SLOW ZOOM brings it toward us.  And as the screams\n      reach their sharp crescendo the title zooms through us.\n\n      FADE IN:\n\n1     ANGLE - STOP MOTION ANIMATION                         1\n\n      Whisping smoke against a black background. EERIE\n      MUSIC.  In the distance, through the smoke, a\n      small object. It fans toward us quickly, filling the\n      frame. It is an ancient skin covered volume, with\n      the outline of a human face on it's cover. This is\n      the Book of the Dead.\n\n                              NARRATOR\n               Legend has it, that it was written by\n               the dark ones: NECRONOMICON EX MORTES;\n               Roughly translated...The Book of the Dead.\n\n      The face on the cover of the book pulls away from its\n      skin binding and leans toward the camera. EYES\n      on the book blink open and peer at us. It's mouth\n      opens and emits a hideous scream. The CAMERA races\n      into the blackness of the screaming mouth.\n\n                                             DISSOLVE THRU TO:\n\n\n1P    PLATE FOR PREVIOUS SCENE - SMOKE                      1P\n\n\n2     A SPINNING VORTEX - (3 PAINTINGS ON AN ANIMATION      2\n      STAND) - 12 SEC. PLATE\n\n      Spiraling downward.\n\n                              NARRATOR\n               To trace the origin of the Book, we\n               must go back...back...to a day when\n               spirits ruled the earth.\n\n      Wispy shapes of animated ghosts move through this\n      vortex, coming toward the CAMERA with WAILING and\n      MOANING  and then are gone.\n\n                              NARRATOR\n               When the seas ran red with blood.\n\n                                             DISSOLVE THRU TO:\n\n\n2P    PLATE FOR PREVIOUS SCENE - ROD PUPPET GHOSTS          2P\n\n\n3     STOCK FOOTAGE - (OPTICALLY COLOR SEPARATED)           3\n\n      A raging ocean of blood.  Great waves rise and swell\n      as if before a storm.\n\n                              NARRATOR (V.O.)\n               It was this blood that was used to ink\n               the book.\n\n                                             DISSOLVE THRU TO:\n\n\n4     AN OPEN COPY OF THE BOOK OF THE DEAD - ANIMATION      4\n      STAND - BLUE SCREEN IN BG\n\n      Through animation, the blank pages of the Book are\n      scripted in a strange hieroglyphic by an invisible hand.\n\n      Faster and faster the pages turn on the Book as the\n      blood red ink is scrawled across them. The pages flip\n      furiously until the Book snaps shut, reveal ing its\n      gruesome face on the cover.\n\n      The book flaps violently away from camera.\n\n                              NARRATOR (V.O.)\n               The Book of the Dead was last seen\n               in 1300 A.D.\n\n                                             DISSOLVE THRU TO:\n\n\n4A    OMIT                                                  4A\n\n\n4AP   OMIT                                                  4AP\n\n\n4B    OMIT                                                  4B\n\n\n4C    OMIT                                                  4C\n\n\n4D    OMIT                                                  4D\n\n\n4P    STOCK FOOTAGE - THE RIFT                              4P\n\n\n5     EXT. KANDAR CASTLE - DUSK - 4 WARRIORS - 4 HORSES     5\n\n      CAMERA panning down to reveal a magnificent newly built\n      castle of stone.  Bright banners fly from its turrets.\n      An ox grazes nearby.  4 Warriors on horseback in the BG.\n\n                              NARRATOR (V.O.)\n               It was then that the dark spirits\n               again rose up to battle the living.\n\n      The ground in front of the castle begins to split apart.\n      A red glow and smoke pour from the growing crevice.\n      Something evil is being unleashed.  A strong wind kicks\n      up blowing sand in a furious rage.\n\n\n5A    EXT. KANDAR CASTLE - DUSK                             5A\n      TRACKING SHOT - ASH\n\n      Through the blowing silt, a lone figure appears.  An\n      image of power and light.  His clothing is ragged,\n      and he holds what appears to be a jagged toothed\n      longsword.  Two massive columns of stone stand on\n      either side.  CAMERA slowly moves closer, but his face\n      is still hidden by the darkness and blowing sands.\n\n                              NARRATOR (V.O.)\n               It is said that a hero came from the\n               sky.  A man who defeated this evi and\n               buried the Book in the Castle of Kandar.\n               And there it lay for 700 years...\n\n                                             DISSOLVE THRU TO:\n\n\n6     EXT. CASTLE OF KAN DAR - DAY - RUINS                  6\n\n      As the raging dust storm clears to reveal the same\n      castle which we saw earlier, but now, in a ruined state.\n      It has aged 700 years.  The ox is gone.  Now only its\n      petrified skeletal remains stand in a weathered heap.\n\n                              NARRATOR (V.O.)\n               ...Waiting.\n\n      A four wheel drive vehicle roars PAST THE CAMERA and\n      toward the castle.\n\n\n7     INT. CASTLE OF KAN DAR - DAY - (STUDIO)               7\n      TRACKING SHOT\n\n      The CAMERA slowly tracks in toward the Book of the\n      Dead as it sits in the darkness of the stone tomb.\n      Next to it rests the KANDARIAN DAGGER, an ancient\n      knife, its handle fashioned from the skull of a\n      weasel. They rest upon a small pedestal covered\n      with cobwebs. Prominently displayed on the stone wall,\n      a bas relief of the \"Hero from the Sky\" holding his\n      unusual jagged edged weapon.\n\n                              NARRATOR (V.O.)\n               And then...\n\n      The grinding of rock scraping against rock is heard,\n      and a large stone is swung open on a secret hinge in\n      the wall behind the book. Wind sweeps in through the\n      tomb, along with the blinding light from outside. A\n      sharply silhouetted figure steps in the newly created\n      doorway. The figure lights a torch that he holds,\n      illuminating his face.  This is PROFESSOR RAYMOND\n      KNOWBY.  An intelligent, grey bearded man in his late\n      fifties. He lowers the cloth around his face that had\n      been protecting him from the sand.  He stares at the\n      Book, awestruck.\n\n      Behind him, two other figures appear in the entrance of\n      the tomb. The first is a large school-marmish woman,\n      the wife of Raymond Knowby, HENRIETTA. She moves to\n      Raymond's side and takes his hand.  Immediately behind\n      her is their daughter, ANNIE KNOWBY; twenty-four years\n      old, strong stance and beautiful.  Behind her a\n      handsome looking man, ED GETLY, enters the tomb.  He\n      moves to Annie's side.  They exchange excited glances.\n      The CAMERA PANS down to the Book.\n\n                                             DISSOLVE THRU TO:\n\n\n8     INT. STUDIO - BLACK                                   8\n      MED. SHOT - FOG\n\n      Billowing past the camera in front of a black drape.\n\n                                             DISSOLVE THRU TO:\n\n\n9     EXT. CABIN - NIGHT                                    9\n      LONG SHOT\n\n      An old log cabin, built in the valley of a dark forest.\n      A great wind billows fog about the place.\n\n                              NARRATOR (V.O.)\n               Professor Raymond Knowby and his wife,\n               HENRIETTA, brought the book to a small\n               cabin where they could study it\n               undisturbed.\n\n\n10    INT. CABIN MAIN ROOM - NIGHT                          10\n\n      Professor Raymond Knowby sits at a writing desk and\n      transcribes passages from the Book of the Dead.  A\n      small framed photograph of his daughter Annie sits\n      upon the table.  Behind him, HENRIETTA sits knitting in\n      a rocking chair.\n\n\n11    CLOSE SHOT - RAYMOND                                  11\n\n      He speaks the phonetic pronunciation of completed\n      sentences into the microphone of a tape recorder.\n\n                              RAYMOND\n               Kanda...Es-trata...Ta-toon...Hazan\n               sobar...Ear-Grets, Gat, ...Nos-feratos\n               ...Amantos...Kanda!\n\n      The sound of RAYMOND reciting the passages is faded\n      down AS THE CAMERA SLOWLY TRACKS away from RAYMOND and\n      over to HENRIETTA as she rocks back into the darkness\n      and forward into the light.  As she rocks forward into\n      the light, she comes into FULL CLOSEUP revealing that her\n      eyes have changed to a milky white.  She continues to\n      knit.\n\n                                             DISSOLVE THRU TO:\n\n\n12    INT. STUDIO - BLACK                                   12\n      MED. SHOT - FOG\n\n      Blowing past the camera in front of black drape.\n\n                                             DISSOLVE THRU TO:\n\n\n13    INT. CABIN CELLAR - NIGHT (STUDIO)                    13\n\n      A dank fruit cellar with shelves of half-rotten\n      preserves.  Raymond has his back to the stone wall.\n      He is dictating into the tape recorder, sweating and\n      distraught.\n\n\t\t\t\t\tRAYMOND\n               It has only been a few hours since\n               I've translated and spoke aloud the first\n               of the demon resurrection passages from\n               the Book of the Dead.\n\n      The sound of heavy footsteps.  Dust drifts down INTO\n      FRAME.  Raymond looks up to the ceiling of the cellar.\n      It is also the floor to the main room of the cabin.\n      He watches in horror as Henrietta's silhouette paces the\n      floor above him.  And then, the footsteps halt.\n\n\t\t\t\t\tRAYMOND\n               And now, I fear that my wife has become\n               host to a Kandarian demon.  May God forgive\n               me for what I have unleashed onto this\n               earth.\n\n\n13Y   REVERSE ACTION                                        13Y\n\n      The milky eyed possessed figure of HENRIETTA jolts quickly\n      into the frame, and shrieks in the voice of a demon!\n      Raymond Knowby screams.  He drops the microphone.\n\n\n13X   CLOSE SHOT - TAPE RECORDER                            13X\n\n      As the microphone falls atop it.  High pitched feed-\n      back screams from the speaker.\n\n\n13A   CLOSE SHOT - RAYMOND                                  13A\n\n      Screaming in terror.\n\n\n13B   CLOSER - RAYMOND                                      13B\n\n      His fearful eyes fill the screen as the scream continues.\n\n\n13C   EXTREME C.U. RAYMOND'S EYE                            13C\n\n      Darting about wildly and the scream continues.\n\n                                             DISSOLVE THRU TO:\n\n\n14    INT. DARK TUNNEL - DAY                                14\n      ROUNDY-ROUNDY - CAMERA MOUNTED ATOP VAN\n\n      CAMERA MOVING swiftly down a dark tunnel. A light\n      at the end growing closer. The SOUND of AIR RUSHING\n      BY. The Delta 88 Oldsmobile comes ROARING out of\n      the tunnel with a BLAST of AIR, and the sound of\n      loud rock and roll music.\n\n                              NARRATOR (V.O.)\n               It was one week later that a group\n               of college students came to the cabin.\n\n\n14A   EXT. CABIN - NIGHT - TRACKING SHOT                    14A\n\n      The Delta 88 Oldsmobile parked out front.  Fog roars\n      past the place.  We faintly hear waltz music from\n      within.  The silhouette of a woman sweeps by the rear\n      bedroom window.\n\n\n14B   INT. CABIN - REAR BEDROOM - NIGHT                     14B\n      ASH AND LINDA\n\n      LINDA, an attractive college student, is waltzing in\n      the semi darkness of the bedroom.  She wears a \"Michigan\n      State University\" sweatshirt.  She hums melodically to\n      the music as she moves.  Around her neck is draped a\n      delicate silver necklace.\n\n\n14C   MEDIUM SHOT - ASH AND LINDA                           14C\n\n      A handsome young man, ASH, is playing the waltz music\n      on an old wooden piano.  Linda dances behind him.  Ash\n      is not a very good pianist, and can only plunk out the\n      melody with two fingers.\n\n                              LINDA\n               Ash, what's that you're playing?\n\n                              ASH\n               Our song.\n\n      Ash begins to play faster.\n\n\n14D   MEDIUM SHOT - ASH AND LINDA                           14D\n\n      As she picks up the tempo, spinning and laughing,\n      until finally Ash moves to her, halting her in mid\n      spin.\n\n\n14E   CLOSE SHOT - LINDA                                    14E\n\n      Out of breath, hair tousled across her eyes, she\n      stares deeply into Ash's eyes.  Her lips, parted,\n      in a sensual manner.\n\n\n14F   CLOSE SHOT - ASH                                      14F\n\n      He returns her stare, lost in her beauty.  He pulls\n      her close.\n\n                              LINDA\n               Ow!\n\n\n14G   SHE PULLS AWAY SUDDENLY                               14G\n\n      And looks down to the tiny silver necklace that she\n      wears about her neck.\n\n\n14H   CLOSE SHOT - NECKLACE                                 14H\n\n      In its center is a magnifying glass.\n\n\n14I   MEDIUM SHOT - LINDA AND ASH - TULIP CRANE             14I\n\n      She looks from the necklace to Ash.\n\n                              LINDA\n               I really love it.  I'll never take\n               it off.\n\n      They kiss and now begin to dance together, to the\n      haunting waltz melody that sweeps up upon the soundtrack.\n\n                                             DISSOLVE THRU TO:\n\n                              NARRATOR (V.O.)\n               It was in the cabin's cellar that they\n               found the Professor's tape recorder,\n               and the Book of the Dead.\n\n\n14J   INT. CABIN MAIN ROOM - NIGHT                          14J\n\n      CAMERA tracks in toward the trap door.  It opens by\n      itself as we move down the steps into the blackness.\n\n\n15    MEDIUM SHOT - INT. CABIN CELLAR - NIGHT               15\n\n      The CAMERA pans down from the blackness to Ash who\n      finds a shotgun, Raymond Knowby's tape recorder,\n      tapes, the Kandarian dagger and...\n\n\n16    CLOSE SHOT                                            16\n\n      ...the shattered photograph of Annie Knowby and the\n      Book of the Dead.\n\n\n17    LONG SHOT - INT. CABIN MAIN ROOM                      17\n\n      The group of students sit about the fire as they listen\n      to the tape recorder. Coming from the speaker is the voice\n      of Raymond Knowby reciting the demon resurrection passage.\n\n                              PROFESSOR KNOWBY\n                         (on tape)\n               Kan Da, Es-trata ta-toon hazan sobar\n               ...Ear-Grets, Gat...\n\n\n18    MEDIUM SHOT                                           18\n\n      Linda takes Ash's hand.  She's frightened.  Ash smiles\n      to comfort her.  She nervously fingers the silver locket\n      she wears about her neck.\n\n\n19    CLOSE SHOT - TAPE RECORDER                            19\n\n                              PROFESSOR KNOWBY\n                         (on tape)\n               ...Nos-Feratos...Amantos...Kanda!\n\n\n20    EXT. CABIN - NIGHT                                    20\n\n      The cabin is in the distance.  In the foreground the\n      earth begins to swell, then rips apart as a red glow\n      emanates from beneath.  Something evil is being\n      unleashed.\n\n                              NARRATOR (V.O.)\n               One by one, they fell to the possession\n               of the dark spirits.\n\n\n21    OMIT                                                  21\n\n\n22    EXT. HILLSIDE - GRAVEYARD - NIGHT                     22\n      CLOSE SHOT - LINDA\n\n      Her eyes pop open.  They are bone white.  She has fallen\n      to the possession.\n\n\n22A   EXT. HILLSIDE - GRAVEYARD - NIGHT                     22A\n      ASH AND LINDA\n\n      Possessed Linda is coming after Ash.  Ash back peddles,\n      stumbles and falls.\n\n\n22B   ANGLE - ASH ON GROUND                                 22B\n\n      As the Shadow of approaching Linda envelops Ash,\n      he picks up a shovel from the ground.\n\n\n22C   LINDA LEAPS OVER THE CAMERA, TOWARD HIM.              22C\n\n\n22D   LINDA DUMMY                                           22D\n\n      Ash swings the shovel, slicing off Linda's head.\n\n\n22D1  LINDA'S DUMMY HEAD - ON WIRE                          22D1\n\n\n22E   ANGLE                                                 22E\n\n      Linda's head rolls down the hillside and disappears into\n      the darkness.\n\n\n22F   EXT. HILLSIDE GRAVEYARD - NIGHT                       22F\n      ASH AND LINDA\n\n      Ash buries Linda's headless body.  He jams a crude\n      wooden burial cross into the earth of the grave.  A bolt\n      of lightning strikes.\n\n\n22G   HILLSIDE - GRAVEYARD/CABIN - NIGHT - LONG SHOT - ASH  22G\n\n      As he runs from the grave site and toward the cabin.\n\n\n23    OMIT                                                  23\n\n\n24    OMIT                                                  24\n\n\n25    OMIT                                                  25\n\n\n26    INT. CABIN - MAIN ROOM - NIGHT - CLOSE SHOT - ASH     26\n\n                              NARRATOR (V.O)\n               One man, Ash, destroyed the Book.\n\n      Ash enters the cabin.  He sees The Book of the Dead\n      and tosses it onto the flames.\n\n\n27    CLOSE SHOT - MELTDOWN - MAIN ROOM (STUDIO)            27\n      STOP MOTION ANIMATION\n\n      A possessed demon begins to wither and melt. Flesh\n      shrinks away from its skull and dissolves to nothing.\n\n                              NARRATOR (V.O.)\n               But the evil that had been resurrected\n               from it, lives on.\n\n\n28    CLOSE SHOT - BOOK IN FIREPLACE                        28\n      STOP MOTION ANIMATION\n\n      The Book of the Dead is burned to cinders.  The face\n      upon the Book screams as it burns.\n\n\n29    OMIT                                                  29\n\n\n29A   INT. CABIN MAIN ROOM - NIGHT - HIGH SHOT              29A\n\n      Ash picks himself up from the floor.\n\n\n29B   INT. CABIN MAIN ROOM                                  29B\n\n      Ash stands and clutches the necklace of Linda, in\n      sorrow for his loss of her.\n\n\n29C   EXT. CABIN - DAWN - LONG SHOT                         29C\n\n      Ash staggers from the cabin.\n\n                                             FADE OUT.\n\n\n30    OMIT                                                  30\n\n\n31    EXT. CABIN - DAWN - RECREATION OF THE                 31\n      FINAL SHOT OF EVIL DEAD I\n\n      We are racing forward.  We have taken the POV of\n      an EVIL ENTITY as it glides with dark purpose through\n      a section of woods. It approaches the rear door of the\n      cabin.  The door is torn violently open.  The next door\n      falls away from us.  We approach the front door. SLAM! It\n      jigsaws in two and we are again outside, now in front of\n      the cabin.  Ash is seen in the distance.  He is staggering\n      away, his back to us as we race at him.  He turns suddenly\n      towards CAMERA and screams.\n\n\n32    EXT. WOODS - DAWN                                     32\n      INTERVOLOMETER STOP MOTION/CRANE - SAM-O-CAM\n\n      The final shot of Evil Dead I has a new ending; an\n      extension. Ash is caught by an invisible grip.\n      \"G\" force is distorting Ash's face as he is rocketed\n      backwards.  He is swept hand over foot through the\n      air.  He reaches the edge of the woods and begins\n      tearing through the branches and smaller trees,\n      clearing a path with his body.  He finally slams into\n      a large ungiving tree trunk and he is knocked\n      unconscious.\n\n\n33    WIDE SHOT - LOOKING UPWARD - ASH - DUMMY - DAWN       33\n\n      As he falls from the tree branch and plummets towards\n      the earth.\n\n\n34    ASH'S POV - (CRANING DOWNWARD) - UNDERCRANKED - DAWN  34\n\n      A puddle of mud below, which rushes up upon us quickly.\n\n\n35    MED. SHOT - MUD PUDDLE - ASH                          35\n\n      As his head splashes down into the muddy water.\n\n\n36    CLOSE SHOT - ASH - DAWN                               36\n\n      He lifts his face from the mud, and turns toward us.\n      His eyes have gone white. His skin is now a pale color,\n      his lips, jet black.  He is Possessed.  A bright edge of\n      morning sunlight moves across his face.  He turns his\n      beastly face skyward.\n\n\n37    EXT. RIDGE - DAY (STUDIO) - MATTE PAINTING            37\n      LONG SHOT - THE SUN (Miniature)\n\n      Rising over a mountain ridge.  Sunlight streaming\n      through a gaping hole in the parting clouds, in\n      bright shafts.  It pours through the trees.\n\n\n38    MED. SHOT - THE SUN - MATTE PAINTING - MINIATURE      38\n\n      Closer on the sun as it looms larger and brighter.\n\n\n39    CLOSE SHOT - THE SUN - MATTE PAINTING - MINIATURE     39\n\n      The frame is filled with the rising sun.\n\n\n40    EXT. WOODS - DAWN - CLOSE SHOT - ASH - MUD PUDDLE     40\n\n      The bright edge of morning sunlight spreading across\n      his face, he lets loose a demonic death shriek.\n\n\n41    EXT. WOODS - DAY - (STUDIO)                           41\n      EXTREME CLOSE SHOT - ASH'S FACE (STUDIO)\n      DUMMY HEAD - LIQUID EYE CHAMBER - MINIATURE\n\n      The white in Ash's eyes swirls about, and his pupils\n      change back to their original brown color.\n\n\n41A   EXT. WOODS - DAWN                                     41A\n\n      Ash, no longer possessed, collapses into the mud puddle,\n      unconscious.\n\n\n41B   EXT. WOODS - DAY - REVERSE ACTION - FOG - 3 ANGLES    41B\n\n      Streams of morning sunlight pierce the darkness of the\n      woods.  We hear the shriek of demons.  The sound of\n      SIZZLING.  A great wind blows back fog into the darker\n      sections of the woods.  The scene grows brighter and\n      the peaceful sounds of morning are faded up.\n\n                                             DISSOLVE THRU TO:\n\n\n42    EXT. WOODS - DAY                                      42\n      WIDE SHOT - ASH\n\n      As he lies unconscious.  Time passes.\n\n\n43    CLOSE SHOT - ASH - CRANE - UNDERCRANKED               43\n\n      His eyes open.  They stare blankly up at the sky.  Then\n      fear registers and we CRANE BACK QUICKLY, revealing a\n      vast area of empty woods around Ash.\n\n\n44    MEDIUM SHOT - ASH                                     44\n\n      He sits up slowly into frame, looking fearfully about.\n\n\n45    ASH'S POV                                             45\n\n      Panning the battered cabin and sections of the woods.\n      All is peaceful.  The sound of birds tweeting.\n\n\n46    CLOSE SHOT - ASH                                      46\n\n                              ASH (V.O.)\n               It's gone.\n\n      He looks up to the sky.\n\n\n47    EXT. RIDGE - DAY - (STUDIO) - MATTE PAINTING          47\n      LONG SHOT - THE SUN - LATE AFTERNOON\n\n      Just above the horizon.\n\n                              ASH\n               Sun's driven it away...\n               for now.  Gotta get the hell\n               out of here... before night falls.\n\n\n48    OMIT                                                  48\n\n\n49    OMIT                                                  49\n\n\n50    OMIT                                                  50\n\n\n51    CLOSE SHOT - ASH                                      51\n\n      As he nods to himself, then suddenly glances up beyond\n      the CAMERA.\n\n\n52    EXT. CABIN - DAY - MITCHELL CAMERA                    52\n      ASH'S POV - THE CABIN\n\n      A perfectly normal log cabin with one exception;\n      superimposed over the front of the place is...\n\n\n52P   PLATE FOR PREVIOUS SCENE - (BLACK STUDIO)             52P\n      MITCHELL CAMERA\n\n      A hideous human skull with living eyeballs that stare\n      out at us with evil malice.  The eyes stare out from\n      the two dark windows.  The dark nose area is the open\n      doorway, and the rotted teeth of the skull are the\n      whitewashed stones placed at the foot of the cabin.\n      Then it fades, leaving only the cabin.\n\n\n53    EXT. WOODS - DAY - WIND FAN                           53\n      CLOSE SHOT - ASH - MUD PUDDLE\n\n      He shudders uncontrollably as he picks himself up from\n      the mud.\n\n      Ash MOVES INTO A CLOSE UP.  His eyes shift back and forth\n      like a trapped animal as he looks about for a means of\n      escape.  He spots something.\n\n\n54    EXT. CABIN - DAY - ASH'S POV                          54\n      THE DELTA 88 OLDSMOBILE\n\n      Parked in front of the cabin.\n\n\n55    EXT. WOODS - DAY                                      55\n      CLOSE SHOT - ASH\n\n      He shifts his glance from the car to the road.\n\n\n56    EXT. ROAD - DRIVEWAY TO CABIN - DAY                   56\n\n      A narrow dirt road cutting through the woods. Then,\n      the Delta 88 roars down it, and past the CAMERA.  It\n      kicks up dust and gravel.\n\n\n57    INT. DELTA 88 - DAY                                   57\n      (CAR MOUNT)\n\n      Ash is driving.  He wipes the mud and blood from his\n      face with a rag.  As he pulls the rag away, his face\n      forms a sudden look of horror as he sees:\n\n\n58    EXT. BRIDGE - DAY (STUDIO MINIATURE W/BACKDROP)       58\n      CAR'S POV - TRACKING SHOT - STOP MOTION ANIMATION\n\n      A GIANT STEEL HAND LOOMS towards us. It is the twisted\n      remains of the steel and wood bridge that crossed\n      a great mountain chasm.  A LOUD SCREECH of brakes\n      is heard on the soundtrack on this cut.\n\n\n59    EXT. BRIDGE SIDE I - DAY                              59\n      MEDIUM SHOT - DELTA 88 - PARTIAL BRIDGE SET\n\n      As it pulls to a halt. Ash steps quietly from the car.\n      He looks at the bridge.\n\n\n60    EXT. BRIDGE - DAY (STUDIO MINIATURE W/BACKDROP)       60\n      ASH'S POV - BRIDGE\n\n      A sign hangs from the twisted girders.  It reads:\n      \"DANGEROUS BRIDGE - 2 TON WEIGHT LIMIT - CROSS AT OWN\n      RISK.\"  Beyond this we see the twisted remnants of the\n      former bridge and the rock cliffs far away on the other\n      side.\n\n\n60A   EXT. BRIDGE SIDE I - DAY - MITCHELL CAMERA            60A\n      FROM RAVINE, LOOKING UPWARD AT ASH AND DELTA\n      (5 FRAMINGS)\n\n      Ash gapes at the uncrossable chasm.\n\n\n60AP  TWO CLIFF EDGES - (STUDIO) - MINIATURE                60AP\n\n\n61    EXT. BRIDGE - DAY                                     61\n      CLOSE SHOT - ASH\n\n      He is stunned at the sight.  His only escape, gone.\n      He looks from the bridge to the West.\n\n\n62P1  PLATE FOR FOLLOWING SCENE                             62P1\n      ASH'S POV - LONG SHOT - MOUNTAIN RIDGE - INTERVOLOMETER\n\n      The sun is now resting on the horizon.  Lower than it was\n      before.  It is BLOOD RED, and sets in the course of seven\n      seconds.\n\n\n62    INT. STUDIO (BLUE SCREEN)                             62\n      MEDIUM SHOT - ASH - PULLING BACK\n\n      To reveal Ash as he looks from the sunset, to the ruined\n      bridge, to the road behind him.  He moves in halting\n      steps, not knowing which way to turn.\n\n      Ash opens his mouth, draws in his breath, and just as\n      he begins to scream, we CUT TO:\n\n\n62P2  OMIT                                                  62P2\n\n\n63    EXT. BRIDGE - TWILIGHT - POV OF EVIL FORCE            63\n      3 CAMERAS - BREAKAWAY TREES\n\n      As it rises up from what appears to be the mountain\n      chasm and reveals the opposite side of the twisted\n      girders which form the \"Giant Hand.\"  It spots Ash\n      immediately beyond.  It moves swiftly towaad him.\n      Ash looks up, sensing the evil and darts into the\n      Delta 88.  The FORCE moves through the twisted girders,\n      pushing them away violently and races towaad the car.\n\n      The Delta starts up and peels off.  The Evil Force\n      just misses it.  The car doesn't have the room to\n      complete the one hundred and eighty degree turn\n      necessary to head back down the road the way it\n      originally came, and is forced into a line of break-\n      away trees which explode into sawdust as the front of\n      the Delta 88 rips through them.  The car swerves\n      onto the road, headed back toward the cabin.\n\n\n64    INT. DELTA 88 - NIGHT                                 64\n      CLOSE SHOT - ASH - CAR MOUNT\n\n      As the broken bits of tree slam against his\n      windshield.\n\n\n65    CLOSE SHOT - CAR RADIO/TAPE DECK                      65\n\n      As the channel switches suddenly to the hard rock\n      song \"Journey to the Center of Your Mind\" which blares\n      within the car throughout the chase to follow.\n\n\n66    EXT. BRIDGE - NIGHT                                   66\n      POV - EVIL FORCE - UNDERCRANKED\n\n      As it gives chase to the Delta.\n\n\n67    TRACKING SHOT - DELTA - DRAGWAY - UNDERCRANKED - ATV  67\n\n      Alongside the car as it barrels along the wooded\n      road.\n\n\n68    EXT. DRAGWAY - NIGHT                                  68\n      TRACKING SHOT - DELTA - UNDERCRANKED - ATV\n\n      As he drives this wild course.\n\n\n69    POV - EVIL FORCE - UNDERCRANKED                       69\n\n      As it begins to gain on the speeding automobile.\n\n\n70    INT. DELTA 88 - NIGHT - UNDERCRANKED                  70\n      OVER ASH'S SHOULDER\n\n      Looking through the windshield, as branches beat and\n      smash themselves against the windshield, obscuring\n      our vision of the \"Road\" ahead.  Our view suddenly\n      clears, revealing a large tree that looms directly\n      ahead.\n\n\n71    CLOSE SHOT - ASH                                      71\n\n      Swerving the wheel.\n\n\n72    EXT. CABIN - NIGHT                                    72\n      ANGLE - DELTA - UNDERCRANKED\n\n      It swerves and slams into a rotted tree, stopping\n      it dead.\n\n\n73    INT. DELTA 88 - NIGHT                                 73\n      CLOSE SHOT - ASH - UNDERCRANKED\n\n      As he is rocketed forward from his seat.\n\n\n74    EXT. CABIN - NIGHT                                    74\n      ANGLE - FRONT OF DELTA - DUMMY OF ASH\n\n      As Ash comes ripping through the windshield and past\n      the CAMERA.\n\n\n74A   ASH'S POV                                             74A\n\n      As he approaches the ground with a great velocity.\n\n\n74B   MEDIUM SHOT - ASH                                     74B\n\n      As he slams into the earth with a rain of glass.  He\n      moans and gets to his feet.\n\n\n75    EXT. WOODS/CABIN - NIGHT                              75\n      POV - EVIL FORCE - BREAKAWAY TREES\n\n      As it sweeps down out of the woods, pushing over trees,\n      and approaches the Delta.  Steam pours from the hood of\n      the car.\n\n\n76    EXT. CABIN - NIGHT                                    76\n      CLOSE SHOT - ASH\n\n      As he runs.  His face is cut and bleeding.\n\n\n76A   ANGLE - OVER ASH'S SHOULDER                           76A\n\n      As he runs toward the cabin.  (Actually he is running\n      in place in the rear of a camera car that is slowly\n      backing away from the cabin.)  The more he runs, the\n      farther away from the cabin he gets.\n\n\n77    POV - EVIL FORCE                                      77\n      IMO CAMERA MOUNTED ON LONG POLE AND TRUCK - 3 DELTAS\n      \"RAM-O-CAM\"\n\n      It approaches the rear of the Delta, rips through the\n      back window, moves through the car's interior, music\n      still blasting, and bursts out the remains of the front\n      windshield.  We move through the steam of the radiator\n      and approach Ash as he runs for the cabin.\n\n\n78    CLOSE SHOT - ASH                                      78\n\n      As he runs toward the cabin not making much progress\n      as though caught running in a nightmare.  He shakes his\n      head \"No.\"\n\n\n78A   CLOSE SHOT - ASH'S FEET AS THEY RUN                   78A\n\n\n79    ANGLE - OVER ASH'S SHOULDER                           79\n\n      Now closer to the cabin.  (Again, Ash is running in\n      place in the camera car as it slowly backs away\n      from the cabin.)\n\n\n80    POV - EVIL FORCE                                      80\n\n      Now quickly gaining its lost ground.  Just a few feet\n      behind Ash.\n\n\n81    EXT. CABIN - LOCATION                                 81\n      SIDE SHOT - ASH\n\n      As he runs up the porch steps to the cabin.\n\n\n82    EXT./INT. CABIN - LOCATION                            82\n      POV - EVIL FORCE\n\n      We race into the cabin, splintering the hall door\n      which Ash had swung shut.  Ash retreats into the\n      rear hallway, and swings the hallway door shut.  We race\n      right up to the door and it shatters into many pieces\n      as we glide forward.\n\n\n83    INT. CABIN - STUDIO - \"MAZE SHOT\" - FORCE POV         83\n\n      Camera moves through the main room and up to the\n      Hallway door.  It shatters in front of us.  We close\n      in on Ash as he races down the hallway.  We lose him\n      as he swings into the back bedroom of the cabin and\n      slams the door behind him.  We rip through this door\n      and enter the rear bedroom, only to see Ash scrambling\n      for the door to the middle bedroom, which we approach\n      and he swings shut in our face.  We rip through to\n      reveal Ash scurrying into the Hallway.  We follow him\n      through the bathroom, the maze, and back out into the\n      Hallway.  We round the corner after him and see that\n      Ash has led us into the main room, but there is not a\n      trace of him.  We look about for him, but he is gone.\n      The hallway is bare except for a few dry leaves.\n\n\n84    INT./EXT. CABIN - LOCATION - POV EVIL FORCE           84\n\n      The force begins to pull back with an ever-increasing\n      speed, out the front door of the cabin, and deep into\n      the blackness of the woods.\n\n\n85    INT. CABIN MAIN ROOM - NIGHT                          85\n\n      A static shot of the fireplace.  All is quiet.  Smoke\n      from the near dead fire wafts up the chimney.  We hold\n      on this for a moment.\n\n\n85A   ANGLE - MIDDLE BEDROOM CLOSET - NIGHT                 85A\n\n      A static shot of a closet with it's door half open.\n      The door begins to swing slightly open, revealing\n      a rack of clothes inside.  We hold on this for a\n      moment.\n\n\n85B   ANGLE - CABIN MAIN ROOM - NIGHT - TRACKING SHOT       85B\n\n      A writing desk with some papers atop it.  They begin\n      to tremble and finally blow away from the light breeze\n      that sweeps through the cabin.  The CAMERA PANS down\n      from this desk to reveal a trap door in the floor of\n      the main room.  The trap door to the cellar.  It is\n      raised up on its hinge an inch or so and in that\n      slight space between the trap door and the floor we\n      see Ash's eyes, looking cautiously about.  He breathes\n      a sigh of relief.\n\n\n86    EXT. WOODS - NIGHT                                    86\n\n      The cabin in the distance.  Fog rolls past.\n\n\n87-128          OMIT                                       87-128\n\n\n128 A,B,C       OMIT                                   128 A,B,C\n\n\n129-143         OMIT                                     129-143\n\n\n143 A-F         OMIT                                     143 A-F\n\n\n143FP           OMIT                                     143FP\n\n\n144-149         OMIT                                     144-149\n\n\n149A-J          OMIT                                     149A-J\n\n\n149K  EXT. AIRSTRIP - NIGHT - LONGSHOT - ED                 149K\n\n      Ed Getly stands in the FG and watches as an older\n      style twin engine cargo plane flies over the camera\n      and lands.\n\n\n149L  AIRSTRIP - NIGHT - TRACKING SHOT - PASSENGERS         149L\n\n      The airplane rolls to a halt.  A man wearing a\n      jumpsuit ties the airplane off and blocks the wheels\n      while a redcap opens the hatch and helps out Annie\n      Knowby.  She carries a glass case in her hand as she\n      moves toward us.  Behind her five other passengers\n      emerge from the Plane.  Ed approaches Annie.\n\n                              ED\n               Annie!\n\n                              ANNIE\n                         (smiling at sight of him)\n               Hi.\n\n      They embrace and kiss.\n\n                              ED\n               How'd everything go on the expedition?\n\n                              ANNIE\n               Terrific.  I found the additional pages\n               from the Book of the Dead.\n\n                              ED\n               So you said in the telegram.  What\n               condition are they in?\n\n      She holds out the glass case for Ed to look at.\n\n\n149M\tCLOSE SHOT - GLASS CASE                               149M\n\n      Inside are 12 pages from the Book of the Dead.\n\n\n149N  AIRSTRIP - NIGHT                                      149N\n      TRACKING SHOT - ED AND ANNIE - THEY CONTINUE WALKING\n\n                              ED\n               Haven't aged a day in three thousand years.\n\n                              ANNIE\n               Maybe longer.\n\n                              ED\n               When do we begin the translations?\n\n                              ANNIE\n               Tonight.  Is everything all set with my\n               father?\n\n                              ED\n               Should be, but I haven't spoken to him\n               in a week, what with no phone in that\n               cabin.  Take us about an hour to get there.\n\n      They arrive at the parking lot.  Two new, sharp looking\n      cheverolets and Ed's old style cheverolet.\n\n                              ED\n               We'll take my car.\n\n      Ed opens the car trunk.  Behind him a redcap pulls up\n      a large steamer trunk on a hand dolly.  Ed and the redcap\n      hoist the steamer up into the car's trunk.\n\n                              ED\n               Annie, you hinted in your telegram that\n               your father was on to something with the\n               first part of his translations.  What's\n               the big mystery?  What has he found in\n               The Book of the Dead?\n\n                              ANNIE\n               Maybe nothing.  But just possibly...\n               the doorway to another world?\n\n      Annie slams the car trunk.\n\n\n149O  OMIT                                                  149O\n\n\n150   OMIT                                                  150\n\n\n151   EXT. WOODS/CABIN - W/ ASH - NIGHT                     151\n      CHEVROLET CAR TRUNK\n\n      CAMERA has taken the POV of the evil force as it glides\n      eerily through the woods, around trees and over rotted\n      stumps.  It moves over a rise revealing a clear view\n      of the boarded cabin in the distance.  It approaches.\n      It moves to the window, and peering through the cracks\n      in the boards we see Ash asleep in the rocking chair.\n\n\n152   INT. CABIN MAIN ROOM - NIGHT                          152\n\n      Camera begins on hammer, nails, and planking which\n      lay upon the cabin floor.  Camera pans to window #1.\n      It is boarded up tight.  Camera pans to door.  It\n      is repaired.  Camera pans to Ash who sleeps in the\n      rocking chair in front of another boarded window.\n\n      Ash awakens suddenly, sensing something, the\n      shotgun clutched in his lap.  He lifts his head and\n      turns to a whispering musical sound.  Harp like music.\n      It is coming from the back bedroom of the cabin.\n\n\n153   MAIN ROOM/MIDDLE ROOM/REAR BEDROOM                    153\n      MEDIUM SHOT - ASH\n\n      As he stands and moves cautiously towards the rear\n      bedroom.\n\n\n154   ASH'S POV - MIDDLE ROOM AND REAR BEDROOM              154\n\n      As he approaches the rear bedroom, the music grows louder.\n      As he enters the room he halts his gaze on the old wooden\n      piano.\n\n\n155   INT. CABIN/REAR BEDROOM - NIGHT                       155\n      MEDIUM SHOT - ASH\n\n      As he moves to the piano.  The sound is coming from\n      within.  Suddenly, the piano begins to play by itself;\n      Ash draws back from it.  It plays a waltz.  Now the\n      piano music mixing with the harp-like strings.  The\n      radiator next to the piano begins to release bursts of\n      musical steam, adding a wind section to this strange\n      orchestra.\n\n\n156   CLOSE SHOT - ASH                                      156\n\n      As he listens to this haunting version of a waltz melody.\n      He recognizes the music.  It is the same music that Ash\n      had played earlier, when Linda was dancing.\n\n\n157   CLOSE SHOT - PIANO AND RADIATOR                       157\n\n      As steam spouts from the radiator pipes.  As the piano\n      keys depress and release themselves.  The melody grows\n      louder.\n\n\n158   CLOSE SHOT - ASH                                      158\n\n      As he lowers his head.  His horror gives way to sadness.\n      From his pocket he removes Linda's delicate silver locket\n      that dangles from the end of a chain.  In the locket's\n      center is a magnifying glass.  He stares mournfully into\n      the glass.  BANG!  He looks up sharply toward the main\n      room.\n\n\n159   OMIT                                                  159\n\n\n159P1 OMIT                                                  159P1\n\n\n159P2 OMIT                                                  159P2\n\n\n159P3 OMIT                                                  159P3\n\n\n160   OMIT                                                  160\n\n\n161   INT. CABIN MAIN ROOM - NIGHT                          161\n      ASH'S POV - SHUTTERS\n\n      As they rip open, splintering Ash's reinforcements.\n      Wind sweeps in through the place as the curtains flutter\n      wildly.  Through the window is a sweeping fog.\n\n\n162   INT. CABIN MIDDLE ROOM - NIGHT                        162\n\n      Ash runs through this room and into the main room.  He\n      moves to the window and looks out.  Wind blowing on his\n      face from outside.\n\n\n163   EXT. HILLSIDE GRAVEYARD - NIGHT                       163\n      ASH'S POV - THE GRAVEYARD\n\n      A stark wooden cross marks Linda's lonely grave.\n\n\n164   OMIT                                                  164\n\n\n165   OMIT                                                  165\n\n\n166   EXT. HILLSIDE GRAVEYARD - NIGHT                       166\n      LONG SHOT - CABIN IN DISTANCE - STOP MOTION ANIMATION\n\n      The tiny figure of Ash can be seen looking off toward\n      this hill.  In the foreground is a crude burial cross\n      and a mound of earth.  The earth begins to crack and\n      splinter.  The wooden cross caves in and is swallowed\n      as the headless corpse of Linda pulls itself to its\n      feet.  The HAUNTING WALTZ MELODY sweeps through the\n      night air.\n\n\n166P  PLATE FOR PREVIOUS SCENE - EXT. CABIN - NIGHT         166P\n      ASH IN WINDOW - MITCHELL CAMERA\n\n\n167   INT. CABIN MAIN ROOM - NIGHT                          167\n      CLOSE SHOT - THROUGH THE WINDOW - ASH\n\n      His eyes, illuminated by a shaft of light, widen in\n      amazement and horror as...\n\n\n168   EXT. HILLSIDE GRAVEYARD - NIGHT (STUDIO)              168\n      (MINIATURE/STOP MOTION/REAR SCREEN) - 3 ANGLES\n\n      The WALTZ MELODY fills the sound track, and the rotting\n      corpse that was Linda begins to dance, bending and\n      swaying as she sweeps gracefully through the evening\n      fog.  A waltz of the dead.\n\n      The style of dance begins to change.  It becomes more\n      primitive.  The music changes to a more primal beat.\n      The dance becomes sexually oriented.  Erotic, with\n      sharp pelvic thrusts and gyrating hip motions.\n\n\n168P  3 PLATES FOR PREVIOUS SCENE - MITCHELL CAMERA         168P\n      EXT. HILLSIDE GRAVEYARD - NIGHT - FOG/WIND FAN\n\n\n169   INT. CABIN MAIN ROOM - NIGHT                          169\n      CLOSE SHOT - THRU THE WINDOW - ASH\n\n      Lost in the horrific beauty, he turns his head to a\n      rumbling sound.\n\n\n170   EXT. HILLSIDE GRAVEYARD - NIGHT - (REVERSE ACTION)    170\n      ASH'S POV\n\n      Linda's DECAPITATED HEAD rolls across the ground and\n      up the hillside graveyard.\n\n\n171   EXT. HILLSIDE GRAVEYARD - NIGHT (STUDIO)              171\n      (MINIATURE/STOP MOTION/REAR SCREEN) LINDA'S HEAD\n      3 ANGLES\n\n      As it leaps through the air and gracefully situates\n      itself atop Linda's neck, she begins to spin, yet her\n      head remains in place, never taking her eyes from Ash.\n      With a sensual twirl and leap, she disappears into the\n      evening mists.\n\n\n171P  3 PLATES FOR PRECEDING SCENE - MITCHELL CAMERA        171P\n      EXT. HILLSIDE GRAVEYARD - NIGHT - FOG W/WIND\n\n\n172   INT. CABIN MAIN ROOM - NIGHT                          172\n      CLOSE SHOT - THRU WINDOW - ASH\n\n      His eyes dart about, trying to catch another glimpse\n      of Linda through the fog.\n\n\n173   EXT. CABIN MAIN ROOM - NIGHT                          173\n      ASH'S POV - THRU WINDOW\n\n      Linda swings sharply into frame, completing the spin\n      of her dance immediately in front of Ash as the music\n      abruptly halts.\n\n                              LINDA\n               DANCE WITH ME!\n\n      Linda extends her dead arms towards Ash.\n\n\n174   INT. CABIN MAIN ROOM - NIGHT - CLOSE SHOT - ASH       174\n\n      He screams as...\n\n\n175   EXT. HILLSIDE - GRAVEYARD - NIGHT                     175\n      CLOSE SHOT - LINDA'S CORPSE (OVERCRANKED)\n\n      Linda's head rolls off of her neck and tumbles through\n      space.\n\n\n176   INT. BLACK STUDIO - NIGHT                             176\n      LINDA'S HEAD - ON WIRE\n\n      As it tumbles through a void of blackness, falling.\n\n\n177   INT. CABIN MAIN ROOM - NIGHT                          177\n      CLOSE SHOT - ASH\n\n      As he screams himself awake.  CAMERA PULLS BACK to reveal\n      him sitting in the rocking chair.  Ash halts his scream,\n      getting control of himself.  He looks to the window that\n      had blown open.\n\n\n178   ASH'S POV - THE BOARDED WINDOW                        178\n\n      Still boarded as though it had never been opened.\n\n\n179   CLOSE SHOT - ASH                                      179\n\n      Reassuring himself.\n\n                              ASH\n               That's all.  Just a crummy dr-\n\n      Linda's decapitated head falls into frame and lands in\n      Ash's hands.\n\n\n180   CLOSE SHOT - LINDA'S HEAD                             180\n\n      It opens its eyes and looks to Ash.\n\n                              LINDA'S HEAD\n               Hello lover, I came from the other\n               side of your dream to dance with you.\n\n\n181   CLOSER SHOT - LINDA'S HEAD (BACKWARD MOTION)          181\n\n      A four foot long blackened tongue emerges from her mouth\n      like a lashing serpent.\n\n\n182   MEDIUM SHOT - ASH - (BACKWARD MOTION)                 182\n\n      The tongue enters Ash's frame and forces itself into\n      Ash's mouth.  Screaming as he clutches at the head of his\n      former love.  The tongue instantly retracts inside her\n      head.\n\n\n183   CLOSE SHOT - LINDA'S HEAD                             183\n\n      As it bites deeply into Ash's right hand, drawing blood.\n\n\n183A  MED SHOT - ASH AND LINDA'S DUMMV HEAD                 183A\n\n      Ash stands and rushes across the room screaming, as he\n      tries to rid himself of the head.\n\n183 B-L  OMIT                                           183 B-L\n\n\n184   OMIT                                                  184\n\n\n185   OMIT                                                  185\n\n\n185A  OMIT                                                  185A\n\n\n186   EXT. CABIN - NIGHT - ASH AND DUMMY HEAD - LONG SHOT   186\n\n      As Ash staggers painfully around the side of the\n      cabin and towards the work shed; Linda's head still\n      clamped to his hand.\n\n\n187   INT. WORK SHED - NIGHT - LINDA DUMMY HEAD - ASH       187\n\n      The door to the place is kicked open, revealing Ash\n      and Linda's head on the end of his hand.  It is a room\n      full of sawdust, chains and power tools.  Old bones\n      hang from the walls.\n\n\n187A  MEDIUM SHOT - INT. WORK SHED - ASH                    187A\n\n      As he places Linda's head within the vice and\n      tightens it around her, then withdraws his hand.\n\n                              LINDA'S HEAD\n               Even now we have your darling Linda's\n               soul!  She suffers in torment!\n\n\n187B  CLOSE SHOT - ASH'S HAND                               187B\n\n      As it rips away an old tarp revealing the chalk\n      outline of where a chainsaw once was.\n\n\n187C  CLOSE SHOT - ASH - HEADLESS LINDA BODY                187C\n\n      Confused.  Wondering what has happened to the\n      chainsaw.  Behind him, the door to the shed bursts\n      open and in comes the flailing, headless, body of\n      Linda, charging at Ash with the chainsaw buzzing high\n      above her head.  Ash is screaming.\n\n\n187D  MEDIUM SHOT                                           187D\n\n      Ash grabs a large crowbar and swings it\n      toward the approaching blade.\n\n\n187E  CLOSE SHOT                                            187E\n\n      The crowbar hits the bottom of the blade with a\n      shower of sparks, sending the buzzing saw flipping\n      backward.\n\n\n187F  MEDIUM SHOT - HEADLESS LINDA DUMMY - 3 ANGLES         187F\n\n      The blade of the chainsaw swings upward and arcs\n      back into headless Linda, imbedding itself in her\n      neck.  She goes nuts as the chainsaw bites its way\n      into her chest cavity.  She spins wildly about the\n      room knocking into shelves as she tries to pull the\n      blade free.  She slams against the wall of the shed,\n      and slumps to the floor, the chainsaw still buzzing.\n\n\n187G  MEDIUM SHOT - ASH                                     187G\n\n      As he is splattered with black bile.  He reaches down.\n\n\n187H  MEDIUM SHOT - HEADLESS LINDA                          187H\n\n      As Ash dislodges the spinning chainsaw from her.\n\n\n187I  MEDIUM SHOT - ASH                                     187I\n\n      As he swings the chainsaw around and poises it above\n      Linda's head.\n\n\n187J  WIDE SHOT - ASH AND LINDA'S HEAD IN VICE              187J\n\n      From the chainsaw, fumes of blue amoke.  Ash turns\n      to the head and falters.\n\n\n187K  CLOSE SHOT - LINDA'S HEAD IN VICE                     187K\n\n      She is no longer possessed.  She looks as she did\n      earlier in the film.  A vision of beAuty.  She is\n      again Linda, the woman Ash loved.  Tears roll down from\n      her eyes.\n\n                              LINDA\n               Please Ash, help me.  I love\n               you, please don't hurt me.\n\n\n187L  CLOSE SHOT - ASH                                      187L\n\n      Trying to fight his feelings, he knows what he must\n      do.  He pumps the throttle on the saw.\n\n\n187M  CLOSE SHOT - LINDA                                    187M\n\n      Pleading with him.\n\n                              LINDA\n               You promised me we'd always be\n               together.  You swore to me!\n\n\n187N  CLOSE SHOT - ASH                                      187N\n\n      Agonized.\n\n                              ASH\n               NO!\n\n\n187O  CLOSE SHOT - LINDA'S HEAD                             187O\n\n      Once again fully possessed, and speaking in the voice\n      of the demon.  Her eyes again white, her flesh, rotten.\n\n                              LINDA'S HEAD\n               YES!  YOU LIED TO HER! YOU LIED TO\n               LINDA! YOUR LOVE WAS A LIE!  AND\n               NOW SHE BURNS IN HELL!\n\n\n187P  EXTREME CLOSE SHOT - LINDA'S DUMMY HEAD               187P\n\n      She opens her mouth and emits a jet stream of bile.\n\n\n187Q  CLOSE SHOT - ASH                                      187Q\n\n      As he's drenched in the face.  Linda begins to laugh at\n      him in a wild, high pitched squeal.\n\n      He gains control of himself and steadies the saw.\n\n                              ASH\n               Eat chainsaw.\n\n      He brings down the spinning blade.  And moves past\n      the CAMERA and towards the head.  We are left looking\n      at the wall of the work shed upon which we see the\n      stark shadow of the ghastly deed.  We hear the sound\n      of spinning steel meeting bone and the screams of a\n      demon.\n\n\n187R  CLOSE SHOT - LIGHT BULB                               187R\n\n      As it is splattered with blood.\n\n\n187S  MEDIUM SHOT - ASH                                     187S\n\n      Ash stumbles back into frame and falls against the\n      wall, now lit in crimson.  He looks at the off screen\n      carnage in terror.  He begins to shake as though in\n      shock.  He trembles as he looks down at his\n      hands; they are covered in Linda's blood.\n\n      He wipes his hands on his pants and shirt, trying\n      to rid himself of it, but only succeeds in painting\n      himself with the stuff.  Ash screams a wild scream of\n      fear and despair.  It echoes off into the night.\n\n\n188   CRANE SHOT - EXT. WORK SHED - NIGHT                   188\n\n      Ash in a confused state as he staggers from the\n      work shed and towards the cabin.  Again clutching\n      the chainsaw.\n\n\n189   INT. CABIN REAR DOORWAY - NIGHT                       189\n\n      Ash enters through the doorway.  He pushes the door\n      shut behind him and halts.  We hear a creaking sound.\n      It is coming from the main room of the cabin.  He\n      moves in the direction of the sound.\n\n\n189A  ASH'S POV - REAR HALLWAY - NIGHT                      189A\n      TRACKING SLOWLY FORWARD\n\n      Curtains flutter on the partially boarded windows of\n      the hall.  Ash moves slowly past them and towards the\n      main room ahead.  The gentle creaking sound grows\n      louder.  Ash tosses down the saw and picks up the gun.\n\n\n189B  INT. CABIN MAIN ROOM - NIGHT                          189B\n\n      Ash enters from the hallway and turns his head to the\n      sound.\n\n\n189C  MAIN ROOM - NIGHT - ASH'S POV - THE ROCKING CHAIR     189C\n\n      It rocks back and forth with a definitive motion,\n      halting for a moment at it's pints furthest forward\n      and backward, as if some invisible thing was sitting\n      there and rocking.\n\n\n189D  CLOSE SHOT - ASH                                      189D\n\n      He slowly approaches the chair, scared shitless.\n\n\n189E  MEDIUM SHOT - FROM BEHIND THE ROCKING CHAIR           189E\n\n      The chair rocks in and out of frame in the foreground\n      as Ash takes halting steps towards it.  Ash gathers\n      his courage and reaches out his hand to halt the\n      rocking motion.  Slowly his hand approaches the chair.\n      Just as his hand goes to touch it, the chair abruptly\n      halts, on its own accord.\n\n\n190   MEDIUM SHOT - ASH                                     190\n\n      In a confused state as he backs away from the chair and\n      into the wall.  He turns and comes face to face with\n      himself in a hanging framed mirror.  He clutches at his\n      face, trying to reassure himself of his sanity.\n\n                              ASH\n               I'm fine... I'm fine...\n\n\n191   INT. CABIN MAIN ROOM/MIRROR ROOM - NIGHT              191\n      MEDIUM SHOT - OVER ASH'S SHOULDER - ASH AND REFLECTION\n\n      Ash's reflection becomes an independent entity.  It\n      reaches out of the mirror and grabs ahold of Ash by his\n      throat.  The reflection looks like a Mr. Hyde version of\n      Ash.  Sweating and nasty looking.\n\n\n192   SIDE SHOT - SPLIT SCREEN - ASH AND REFLECTION         192\n      MITCHELL CAMERA (ASH AS MR. HYDE)\n\n      The reflection pulls Ash close and speaks to him in an\n      intimate whisper.\n\n                              REFLECTION\n               I don't think we're \"fine\".  We're\n               losing it...  starting to slip.  We\n               just cut up our girlfriend with a\n               chainsaw.  Does that sound fine?\n\n      The reflection tightens its hold on Ash's throat and\n      begins to strangle him.\n\n\n192P  PLATE FOR PREVIOUS SCENE                              192P\n      INT. CABIN MAIN ROOM - NIGHT\n      ASH - MITCHELL CAMERA\n\n\n193   CLOSE SHOT - ASH - DOLLY                              193\n\n      Two hands in the bottom of frame, throttling him.\n      CAMERA races back to reveal Ash's own hands on his throat.\n      There is no sign of Ash's evil reflection.  Ash has\n      been strangling himself.  He realizes this the same\n      moment we do.  He quickly pulls his hands away, looks at\n      them incredulously, then to the mirror.\n\n\n194   OVER ASH'S SHOULDER - INTO MIRROR                     194\n\n      His reflection is as it should be.\n\n\n195   CLOSE SHOT - ASH                                      195\n\n      He looks back down to his hands.\n\n\n196   INT. CABIN MAIN ROOM - NIGHT (STUDIO)                 196\n      CLOSE SHOT - ASH'S RIGHT HAND - DUMMY HAND\n      INTERVOLOMETER\n\n      The bite marks that Linda's teeth have left in the hand\n      stand out sharply.  The wound suddenly blackens and\n      spiderwebs it's infection across the entire surface of the\n      hand.\n\n\n197   INT. CABIN MAIN ROOM - NIGHT                          197\n      CLOSE SHOT - ASH - HAND IN FOREBROUND - MAKE UP BLADDER EFX\n\n      The hand quivers and shakes, now out of Ash's control.\n      The hand has taken a whitish cast.  It's veins throb and\n      pulsate.  It is possessed by the evil force.  The hand's\n      fingernails grow inches.  The wound oozes black fluid.\n      Ash is repulsed.\n\n\n198   CLOSE SHOT - ASH                                      198\n\n      Ash's demon hand makes a lunge at his face which is\n      countered by his good hand.\n\n\n199   MEDIUM SHOT - ASH                                     199\n\n      He slams the hand to the cabin floor.  He screams to\n      the air:\n\n                              ASH\n               You bastards.  Give me back my hand.\n\n\n200   EXT. CABIN - NIGHT                                    200\n\n      Wind and fog swirl about the place.  Ash's ECHOING\n      SCREAM is heard above the HOWLING GALE.\n\n                              ASH (0.S.)\n               Give me back my hand!!\n\n201   OMIT                                                  201\n\n\n201A  OMIT                                                  201A\n\n\n201B  OMIT                                                  201B\n\n\n201C  OMIT                                                  201C\n\n\n202   OMIT                                                  202\n\n\n203   OMIT                                                  203\n\n\n204   INT. CABIN MAIN ROOM/KITCHEN - NIGHT                  204\n\n      Ash rushes into the kitchen and places his hand in\n      the sink.  He turns on the faucet.\n\n\n205   INT. CABIN KITCHEN - NIGHT                            205\n\n      Cool water runs over Ash's burned hand.  Ash rests his\n      head on the kitchen counter and mumbles reassurances to\n      himself.\n\n                              ASH\n               Can't... can't be happening.\n\n\n206   CLOSE SHOT - THE HAND                                 206\n\n      As the water pours over it.  It grabs a plate sitting\n      in the dishwater and reaches up silently out of the sink.\n\n\n207   MEDIUM SHOT                                           207\n\n      The plate is shattered over Ash's head.  The\n      hand grabs Ash's hair and mercilessly slams his\n      head down upon the kitchen counter again and again.\n      Ash punches himself in the face and is sent reeling\n      backwards.  He smashes into a cupboard where dishes\n      and plates fall upon him.\n\n\n208   CLOSE SHOT                                            208\n\n      The hand picks up plates and begins breaking them over\n      Ash's head.  Then a bottle.\n\n\n209   MEDIUM SHOT                                           209\n\n      Ash is knocked unconscious.  The hand continues breaking\n      objects over his head.  Ash lies unmoving, but still\n      alive.\n\n\n210   CLOSE SHOT                                            210\n\n      The hand stops as though it senses something.  The\n      CAMERA PANS to a large meat cleaver which lies upon the\n      wooden floor.\n\n\n211   MEDIUM SHOT                                           211\n\n      The hand as it independently crawls towards the meat\n      cleaver.  The hand is stopped when it runs out of arm,\n      now anchored by Ash's unconscious body.\n\n\n212   CLOSE-SHOT - HAND                                     212\n\n      It digs its nails deep into the floorboards and begins to\n      pull...\n\n\n213   MEDIUM SHOT - ASH                                     213\n\n      ... as he is pulled along the kitchen floor.\n\n\n214   CLOSE SHOT - HAND - GELETIN HAND                      214\n\n      As it pulls Ash's unconscious body along after it. The\n      hand clutches the meat cleaver when a large knife comes\n      slicing through the demon hand, pinning it to the\n      floorboards.  CAMERA pulls over to reveal a revived Ash.\n\n                              ASH\n               Who's laughing now?\n\n\n214A  ANGLE - ASH - COMEDY KNIFE RIG                        214A\n\n      He reaches over with his good hand and pulls a fire\n      engine red chainsaw down from the shelf.\n\n      He holds the body of the machine between his legs and,\n      with his good hand, pulls the starter cord.  The\n      CHAINSAW ROARS to life.  The CAMERA TRACKS IN to Ash's\n      sweating face.\n\n                              ASH\n               Who's laughing now!?\n\n      He lowers the spinning blade of the chainsaw down out\n      of frame and toward the evil hand.  Blood flies up\n      into frame.\n\n\n215   OMIT                                                  215\n\n\n216   EXT. CABIN - NIGHT                                    216\n      LONG SHOT\n\n      We hear the BUZZING of the CHAINSAW as it slices through\n      bone and then falls silent.\n\n\n217   EXT. BRIDGE - NIGHT (SIDE II)                         217\n      CRANE\n\n      The CAMERA cranes down as Annie's car approaches from\n      the distance. It pulls to a halt. Ed and Annie step\n      from the car.\n\n\n218   ANNIE'S POV                                           218\n\n      A red tow truck with its orange lights flashing is\n      parked there. Painted on it's side is \"Jake's Gas\n      N' Go.\" Jake, a toothless, backwoods, greasemonkey is\n      setting up flares and wooden roadblocks.  Annie and Ed\n      approach.\n\n                              ANNIE\n               Excuse me.  This the road to the\n               Knowby's cabin?\n\n                              JAKE\n               Thas' right.  But you ain't goin' there.\n\n                              ANNIE\n               And why not?\n\n\n219   CLOSE SHOT - JAKE                                     219\n\n      As he reaches in his truck to pull on the headlights.\n\n\n220   CLOSE SHOT - TRUCK HEADLIGHTS                         220\n\n      As they snap on.\n\n\n221   MEDIUM SHOT - JAKE, ANNIE, AND ED                     221\n\n      All stand in the bright glare of the lights as the fog\n      swirls about them.  Annie and Ed gape in frightened\n      wonder at what they see.\n\n\n222   EXT. BRIDGE - NIGHT - (SIDE II) - (STUDIO MINIATURE)  222\n      THEIR POV - TABLE TOP MODEL GIRDERS\n\n      The piercing beams of light illuminate twisted remnants of\n      the destroyed bridge that leads to the cabin.  A road sign,\n      similar to the one on the other side of the bridge\n      reads: \"Dangerous Bridge - Two Ton Weight Limit\".\n\n\n223   EXT. BRIDGE - NIGHT - (SIDE II)                       223\n      CLOSE SHOT - ED AND ANNIE\n\n      Frightened as they view the wreckage.\n\n                              ANNIE\n               What happened?\n\n                              JAKE\n               Lady, I ain't never seen nothin' like\n               it.\n\n                              ED\n               Terrific.  Now what?\n\n                              ANNIE\n               There must be another way in.\n               Another road or something.\n\n\n224   JAKE, BOBBY JOE, ANNIE AND ED - TWO CAMERAS           224\n\n                              BOBBY JOE\n               Sure ain't no, road.\n\n      CAMERA pans over to reveal a brassy southern spitfire\n      of a woman, Bobby Joe.\n\n                              BOBBY JOE\n               Hell you wanna go there for, anyway?\n\n      Bobby Joe takes a pinch of chewing tobacco and stuffs\n      it into her mouth.  She doesn't like Annie and her\n      fancy clothes.  She stares at Annie like a cat.\n\n\n224X  MEDIUM SHOT - ANNIE AND ED                            224X\n\n      Annie steps forward.  She eyes Bobby Joe.\n\n                              ANNIE\n               None of your business.\n\n\n224Y  CLOSE SHOT - JAKE                                     224Y\n\n      He feigns surprise and pleasantness.\n\n                              JAKE\n               Hey!  I just remembered... Yeah,\n               that's right... There is a trail.\n               You could follow Bobby Joe and me.\n\n                              ED\n               That sounds all right.\n\n                              JAKE\n               But, it'll cost ya.\n\n                              ANNIE\n               How much?\n\n                              JAKE\n               Forty Fi...\n\n\n224A  ANGLE                                                 224A\n\n      Jake looks up suddenly at Bobby Joe who gives\n      a sharp shake of her head.\n\n                              JAKE\n               Hundred bucks.\n\n\n224B  CLOSE SHOT - ANNIE                                    224B\n\n                              ANNIE\n               Tell you what.  You take my bags\n               you got a deal.\n\n\n224C  CLOSE SHOT - JAKE                                     224C\n\n      He glances through the window of Annie's car.\n\n\n224D  JAKE'S POV                                            224D\n\n      The tiny case containing the missing pages of the Book\n      of the Dead, and a small handbag.\n\n\n224E  CLOSE SHOT - JAKE                                     224E\n\n      Looking back to Annie, a big smile on his near\n      toothless face.\n\n                              JAKE\n               Sure!\n\n\n225   EXT. WOODS - NIGHT                                    225\n\n      A hiking trail winds through the woods.  Bobby Joe\n      leads the way with flashlight in hand.  She pockets\n      some bills.  She is followed by Annie and Ed who\n      carry the glass case containing the missing pages\n      and the handbag.  A grunting and sweating Jake brings\n      up the rear, the large steamer trunk on his back.\n      He is cursing under his breath.\n\n                              JAKE\n               Jesus H. Christ!  I thought she\n               was talkin' 'bout them two goddamn\n               little pieces!\n\n\n226   OMIT                                                  226\n\n\n227   EXT. CABIN - NIGHT                                    227\n\n      The wind rushes fog about the place with a fury.\n      A large moon hangs in the night sky.\n\n\n228   INT. CABIN MAIN ROOM - NIGHT                          228\n      CLOSE SHOT - EVIL HAND\n\n      No longer attached to Ash's arm, it still writhes about\n      beneath Ash's foot which pins it to the floor.\n\n\n229   MEDIUM SHOT - ASH - HAND'S POV - EYEMO W/ MOUNT       229\n\n      As he grabs the steel wastebasket, dumps out the trash\n      lowers it quickly over the CAMERA, trapping the hand\n      within.\n\n\n230   MEDIUM SHOT - ASH                                     230\n\n      With a note of finality, Ash slams down a pile of books\n      atop the overturned wastecan, to anchor it.  The top\n      book's title reads \"Farewell to Arms\".\n\n\n231   FIREPLACE                                             231\n\n      Ash raises a red hot fireplace shovel that had been\n      resting upon the coals.  He grits his teeth.\n\n\n232   ANGLE                                                 232\n\n      Just out of frame, Ash thrusts the glowing shovel against\n      the stump to cauterize the wound.  Red steam hisses up\n      into frame as Ash screams.\n\n\n233   MEDIUM SHOT - ASH                                     233\n\n      He tosses aside the shovel and douses his smoldering\n      stump into a vase of fresh flowers.\n\n\n234   CLOSE SHOT - ASH                                      234\n\n      Unspooling a roll of duct tape.\n\n\n235   MEDIUM SHOT - ASH                                     235\n\n      He tapes the tablecloth into a makeshift bandage\n      about his wrist.  Behind him, the wastebasket\n      silently slides across the floor.\n\n\n236   MEDIUM SHOT - ASH                                     236\n\n      \"CLANG\"! He turns to see.\n\n\n237   CLOSE SHOT - THE WASTEBASKET                          237\n\n      Upon its side.  The Evil Hand is gone.\n\n\n237A  CLOSE SHOT - ASH                                      237A\n\n      He turns to a \"pitter patter\" sound.\n\n\n238   OMIT                                                  238\n\n\n238P  OMIT                                                  238P\n\n\n239   OMIT                                                  239\n\n\n240   OMIT                                                  240\n\n\n241   OMIT                                                  241\n\n\n242   OMIT                                                  242\n\n\n243   OMIT                                                  243\n\n\n244   OMIT                                                  244\n\n\n245   CLOSE SHOT - HAND                                     245\n\n      It scampers across the floorboards headed for a hole\n      in the wall.\n\n\n246   INT. CABIN MAIN ROOM - NIGHT (STUDIO)                 246\n      MEDIUM SHOT - ANIMATED HAND (4 SEC.)\n\n      Same action as above but covered now through animation.\n\n\n247   INT. CABIN MAIN ROOM - NIGHT                          247\n      HAND - POV\n\n      Low angle tracking shot approaching the hole in the wall.\n\n\n248   CLOSE SHOT - ASH AND HAND - SQUIB                     248\n      TRACKING WITH HAND, ASH IN BG\n\n      He raises the shotgun and FIRES.  BLAM!  The floor\n      next to the hand explodes.\n\n\n249   CLOSE SHOT - HOLE IN THE WALL - SQUIB - EFX. HAND     249\n\n      The hand leaps into the hole as a section of wall next\n      to it EXPLODES.  Blam!\n\n\n250   CLOSE SHOT - ASH                                      250\n\n      Ash quickly reloads both chambers of the gun.\n      He tracks the SOUND of the PITTER PATTER as the hand\n      scampers through the sapace behind the wall like a rat.\n\n\n251   OMIT                                                  251\n\n\n252   OMIT                                                  252\n\n\n253   OMIT                                                  253\n\n\n254   ASH'S POV - WALL - SQUIB                              254\n\n      The blasted hole at the bottom of the wall.  The hand\n      appears, still unhurt, waving and taunting at Ash.\n\n\n255   CLOSE SHOT - ANIMATED HAND - (7 SEC.)                 255\n\n      As it taunts ASH it inadvertently sidesteps into a\n      rusting mousetrap.  SNAP!  It springs shut upon the\n      hand.  It screams furiously and shakes violently in\n      an effort to get free the from trap.\n\n\n256   CLOSE SHOT - ASH                                      256\n\n      Throws back his head in a gruff bark of laughter.\n\n                              ASH\n               Ha!\n\n\n257   CLOSE SHOT - ANIMATED HAND - (7 SEC.)                 257\n\n      The hand throws the trap from itself and raises its\n      middle finger to ASH, flipping him the bird.\n\n\n258   CLOSE SHOT - ASH'S HAND                               258\n\n      He raises the gun, revealing his face as the\n      CAMERA PANS UP with his movement.\n\n\n259   ASH'S POV - OVER THE GUN BARREL                       259\n\n      Pointed directly at the hand.  But the hand dodges\n      away from the hole, disappearing again behind the\n      wall.  The gun continues to track the evil hand's\n      progress through its pitter patter sound.\n\n\n260   CLOSE SHOT - ASH'S EAR                                260\n\n      The pitter patter ebbs and then peaks in volume.\n\n\n261   ASH'S POV - OVER THE GUN BARREL - SQUIB               261\n\n      Both triggers are squeezed.  BLAM!  BLAM! A 2nd and\n      3rd hole are blown in the wall.  All is silent.\n\n\n261A  INSERT ASH'S FINGER PULLS THE FIRST, THEN             261A\n      SECOND TRIGGER\n\n\n261B  INSERT FLAME BELCHES FROM THE GUN TWICE               261B\n\n\n262   CLOSE SHOT - ASH                                      262\n\n      As he lowers the smoking gun.  Wondering if he has hit\n      the hand or not.\n\n\n263   CLOSE SHOT - HOLE IN WALL - 5 CAMERAS                 263\n\n      All is silent for a moment, and then a slight trickle\n      of blood comes dripping from the hole and down the\n      side of the wall.\n\n\n264   CLOSE SHOT - ASH                                      264\n\n      For the first time feeling victorious.  As Ash continues\n      to stare at the hole, his expression changes to one of\n      perplexity.\n\n\n265   CLOSE SHOT - HOLE IN WALL - 5 CAMERAS                 265\n\n      The trickle of blood has increased to a steady flow,\n      then, even this volume of blood multiplies.  It is\n      forced out of the wall with a greater and greater\n      pressure until blood pours from the wall like a fire\n      hose.\n\n\n266   CLOSE SHOT - ASH                                      266\n\n      Horrified, he spins his glance to the sound of more\n      gushing liquid.  He is hit in the face with a geyser\n      of deep red blood.\n\n\n267   CLOSE SHOT - 2ND AND 3RD HOLES IN WALL - 5 CAMERAS    267\n\n      The 2nd and 3rd holes in wall also begin to spew blood\n      in a geyser.  The CAMERA PANS over to the 4th of the\n      holes.  This, too, is an eruption of blood.  The blood\n      changes in color to a black fluid, then yellow, then\n      turquoise.\n\n\n268   CLOSE SHOT - ASH - 5 CAMERAS                          268\n\n      Screaming as he looks down at his wrist.  CAMERA PANS\n      DOWN to it.  The severed wrist begins dribbling blood.\n      Then in a burst, it too, erupts in a hellish fire hose.\n      It spouts blood under such great pressure that ASH is\n      driven against the walls of the cabin because of it.\n\n\n269   MED. SHOT - ASH - 5 CAMERAS                           269\n\n      We follow him as he slams from one wall into another.\n\n\n270   CLOSE SHOT - ASH - 5 CAMERAS                          270\n\n      In the midst of his scream, drowning in the blood, it\n      all suddenly stops.  The cabin is again deadly quiet.\n      ASH, soaked in blood and shivering, waits.  For what,\n      he's not sure.\n\n\n271   MEDIUM SHOT - ASH                                     271\n\n      As he slowly backs away from the walls and sits upon\n      the three legged chair.  It shatters beneath him,\n      dumping him on his butt.\n\n      CREAK!!!\n\n      ASH turns sharply to the low sound.\n\n\n272   ASH'S POV - CLOSE SHOT                                272\n\n      The mounted moose head upon the wall.  It is in a\n      different position.  It turns sharply towards ASH and\n      emits a hideous cackle.\n\n\n273   CLOSE SHOT - ASH                                      273\n\n      He pulls back in fear, then turns to the sound of more\n      laughter.\n\n\n274   ASH'S POV - CLOSE SHOT                                274\n\n      The desk lamp on its steel swivel rises and falls in\n      synchronization with its wheezing laughter.  Ah ha ha\n      ha ha.  Ahhhh ha ha ha ha!\n\n\n275   CLOSE SHOT - ASH                                      275\n\n      Terrified, he turns to more laughter.\n\n\n276   ASH'S POV - CLOSE SHOT                                276\n\n      A line of 12 old books upon the shelf flap open and\n      closed violently as they emit a chorus of sharp laughs.\n      Ash turns.\n\n\n276A  CLOSE SHOT                                            276A\n\n      Other books upon the floor laugh.\n\n\n277   MEDIUM SHOT - OVER ASH'S SHOULDER                     277\n\n      He turns sharply toward us and breaks into an\n      uproariously frightening bout of laughter.\n\n\n278   WIDE SHOT - ASH                                       278\n\n      The wooden door behind Ash comes to life.  It\n      stretches out as though it were elastic with each of\n      its own low and terrible laughs.\n\n\n279   WIDE SHOT - MAIN ROOM - TRACKING SHOT                 279\n      RIGGING FOR TRAP DOOR, CABINETS, CLOCK\n\n      Ash and everything in it are having the time of their\n      lives.  Ash leads the bunch laughing harder and\n      harder.\n\n\n279A  MEDIUM SHOT - HAND HELD - FRONT DOOR AND ASH          279A\n\n      KNOCK! KNOCK! KNOCK!\n\n      The room's laughter suddenly stops.  Ash instantly\n      terrified, grabs up the shotgun and fires into the\n      door.  Blam!  Blam!\n\n      PAN to the front door.\n\n      Two holes are blown into the door.  We hear a short\n      shrill scream and then all is quiet.\n\n\n280   OMIT                                                  280\n\n\n281   OMIT                                                  281\n\n\n282   OMIT                                                  282\n\n\n282A  MEDIUM SHOT - ASH                                     282A\n\n      Ash opens the front door.  It slowly swings inward\n      with a creak revealing the empty night.\n\n\n283   MEDIUM SHOT - ASH AND JAKE                            283\n\n      Ash approaches the front porch as Jake enters sharply\n      into his frame.  Jake tackles Ash.\n\n\n284   MEDIUM SHOT - SHOTGUN                                 284\n\n      As it slides across the floor.\n\n\n285   MED. SHOT - ASH, JAKE AND ED                          285\n\n      Ed enters and holds Ash down as Jake slugs him twice.\n      Ash's fist comes up into frame catching Jake on the\n      jaw.  Jake pulls back his fist and rockets a piledriver\n      blow to Ash's face, knocking him senseless.\n\n\n285A  C.U. ASH                                              285A\n\n\n285B  C.U. JAKE                                             285B\n\n\n286   MEDIUM SHOT - FRONT DOORWAY - THE GROUP               286\n\n      Annie and Bobby Joe enter.  Annie is taking off Bobby\n      Joe's coat.  Bobby Joe is wounded from the shotgun blast.\n      She holds her shoulder where the shell has grazed her.\n\n                              JAKE\n               You gonna be alright, honey?\n\n                              BOBBY JOE\n               I don't know.\n\n                              JAKE\n               You just sit still fer a minute.\n\n\n287   MEDIUM SHOT - JAKE, ED, ANNIE, AND BOBBY JOE          287\n\n      As Jake gives Ash a swift kick in the ribs.  Ash moans.\n      Jake turns to Ed, who is badly shaken.\n\n                              JAKE\n               You know this son of a bitch?\n\n                              ED\n               No.  We thought her -\n\n      Annie steps forward.\n\n                              ANNIE\n               Oh my God.  Where are my parents?\n\n      Annie sets down the glass case containing the pages\n      of the Book of the Dead.\n\n\n288   CLOSE SHOT - ANNIE                                    288\n\n      As she looks down to the floor.\n\n\n289   ANNIE'S POV - THE CHAINSAW                            289\n\n      As it lies in a pool of blood.\n\n\n290   CLOSE SHOT - ANNIE                                    290\n\n      Annie runs to Ash's semi-conscious body, grabs his\n      shirt and violently shakes him.\n\n                              ANNIE\n               What the hell did you do to them?\n\n      Ed pulls Annie off of Ash. She drops Ash's moaning head\n      to the floor and backs away from him, sobbing.\n\n\n291   MEDIUM SHOT - JAKE                                    291\n\n      Nursing his sore knuckles, he points with his elbow\n      to the trap door that leads to the cellar.\n\n                              JAKE\n               We'll throw him in there.\n\n\n292   MEDIUM SHOT - JAKE AND ASH                            292\n\n      Jake picks up Ash's body and drags him quickly to\n      the trap door. Half conscious, Ash feebly struggles\n      with Jake.\n\n                              JAKE\n               Crazy buck's gone blood simple.\n\n\n293   ASH'S POV - HAND HELD                                 293\n\n      As he approaches the trap door almost upside down.\n      Ed pries it open.\n\n\n294   CLOSE SHOT - ASH - HAND HELD                          294\n\n      In a dazed state as he is carried to the trap door.\n\n                              ASH\n               Wait... I made... a mistake...\n\n                              JAKE\n               Damn right, you flat mouthed\n               son of a bitch.\n\n\n294A  MEDIUM SHOT - ASH AND JAKE                            294A\n\n      Jake kicks Ash down into the open trap door.\n\n\n295   INT. CABIN CELLAR - NIGHT                             295\n      ASH DUMMY\n\n      Looking up at the open trap door as Ash's body falls\n      through frame.\n\n\n296   INT. CABIN CELLAR - NIGHT                             296\n      CLOSE SHOT - CELLAR STEP - ASH'S HEAD\n\n      As it slams into the wooden step. His feet tumble over\n      him as he begins to fall down the staircase.\n\n\n297   LONG SHOT - ASH - STUNT                               297\n\n      As he tumbles head over heels down the wooden steps.\n\n\n298   ASH'S POV                                             298\n\n      Racing down the steps.\n\n\n299   MEDIUM SHOT - ASH                                     299\n\n      As he slams to the dirt floor of the cellar.  Hard.\n      He moans.\n\n\n300   INT. CABIN MAIN ROOM - NIGHT                          300\n      LOOKING UP TO THEM FROM CELLAR\n\n      Jake, Ed and Bobby Joe.\n\n                              BOBBY JOE\n               I hope you rot down there!\n\n\n301   INT. CABIN CELLAR - NIGHT                             301\n      MEDIUM SHOT\n\n      Ash begins to realize where he is.  Growing terror on\n      his battered face.\n\n                              ASH\n               N... No.\n\n\n302   INT. CABIN CELLAR - NIGHT                             302\n      ANGLE LOOKING UP\n\n      Jake swings the trap door shut with a clanging of chains.\n\n\n303   INT. CABIN CELLAR - NIGHT (STUDIO)                    303\n      MEDIUM SHOT - ASH\n\n      The shaft of light from above disappears and he is\n      encased in the darkness of the cellar.\n\n      From above he hears the threading of chains through\n      eyeloops.\n\n\n304   INT. CABIN MAIN ROOM - NIGHT                          304\n      MED. SHOT - JAKE, ANNIE, BOBBY JOE, ED\n\n      Jake has just laid Bobby Joe down upon the couch.  He\n      dresses her wound with a towel.  Annie tosses down her coat\n      on the chair at the writing desk.\n\n\n304A  MEDIUM SHOT - ANNIE                                   304A\n\n      She spots the tape recorder and Kandarian Dagger.  She\n      moves to them.\n\n                              ANNIE\n               These are my father's things.\n\n      She turns on the tape recorder.  High pitched feedback\n      and the professor's screams come from the speaker.\n\n                              PROFESSOR KNOWBY\n                         (Voice on Tape)\n               Last night Henrietta tried to kill me.\n\n           ANNIE                          PROFESSOR KNOWBY\n    SHHH!  Listen!                    (Voice on tape)\n    My father's voice.       I know now, that my wife has\n                             become host to a kandarian demon.\n\n\n305   MED. SHOT - JAKE, BOBBY JOE AND ED                    305\n\n      As they turn their heads to the sound of:\n\n\n306   CLOSE SHOT - TAPE RECORDER - TRACKING                 306\n\n      Still playing, the tapes wind as we hear the wowing and\n      fluttering voice of Raymond Knowby.\n\n                              PROFESSOR KNOWBY\n                         (Voice on tape)\n               I cannot bring myself to dismember\n               my wife, yet I know that I must, to\n               halt the evil that lives within her.\n\n\n307   CLOSE SHOT - ANNIE - TRACKING IN                      307\n\n      Horrified.\n\n                              ANNIE\n               No.\n\n\n308   OMIT                                                  308\n\n\n309   INT. CABIN CELLAR - NIGHT (STUDIO)                    309\n      MED. SHOT - ASH - TRACKING AROUND HIM\n\n      As he lays in the center of the cellar's earth floor.\n      He strains his ears to listen to the tape playing in\n      the room above.\n\n                              PROFESSOR KNOWBY\n                         (Voice on tape)\n               It is October 1, 4:33 p.m.  Henrietta\n               is dead.  I could not bring myself\n               to dismember her corpse.  But I\n               buried her.\n\n\n310   CLOSE SHOT - ASH                                      310\n      TRACKING CLOSER\n\n      As he listens intently to the tape playing in the room\n      above.\n\n\n311   INT. CABIN MAIN ROOM - NIGHT                          311\n      TRACKING SHOT - TAPE RECORDER\n\n      CAMERA SLOWLY MOVING IN on the winding tape.\n\n                              PROFESSOR KNOWBY\n                         (Voice on tape)\n               I . . . buried her . . . in the\n               cellar.\n\n\n312   INT. CABIN CELLAR - NIGHT - (STUDIO)                  312\n      CLOSE SHOT - ASH - TRACKING CLOSER\n\n      Growing horror on his face as he realizes where he is.\n\n                              PROFESSOR KNOWBY\n                         (Voice on tape)\n               God help me, I buried her in the\n               earthen floor of the fruit cellar!\n\n\n313   OMIT                                                  313\n\n\n314   OMIT                                                  314\n\n\n315   INT. CABIN CELLAR - NIGHT (STUDIO)                    315\n      ASH'S POV - CLOSE SHOT - (STOP MOTION ANIMATION)\n\n      Ash's legs in the foreground.  Suddenly from the\n      earthen floor of the fruit cellar a half-rotten human\n      head juts up!  Just the eyes are above the surface of the\n      dirt.  They dart about wildly and halt upon Ash.  Worms\n      crawl from the rotted forehead.\n\n\n316   INT. CABIN CELLAR - NIGHT (STUDIO)                    316\n      CLOSE SHOT - ASH\n\n      He screams.\n\n\n317   MED. SHOT - OVER ASH'S SHOULDER - MOCK UP OF CELLAR   317\n      SET\n\n      Henrietta's arm rips through the earth and grabs Ash's\n      leg as he tries to back away.  The corpse that was\n      Henrietta pulls itself from the grave and emits a wail.\n      She turns her twisted body to face Ash.  Moths fly\n      about her in a flurry.\n\n                              HENRIETTA\n               Someone's in my fruit cellar!\n               Someone with a fresh soul!\n\n\n318   INT. CABIN MAIN ROOM - NIGHT                          318\n      MED SHOT. - THE GROUP\n\n      All eyes on the trap door.\n\n                              ED\n               Somebody's down there with him.\n\n                              ANNIE\n               No.  Can't be.\n\n\n319   INT. CABIN CELLAR - NIGHT (STUDIO)                    319\n      MED. SHOT - ASH\n\n      He runs up the steps to the trap door and begins\n      pounding furiously upon it.\n\n\n320   CLOSE SHOT - ASH                                      320\n\n                              ASH\n               Let me out!  Let me out!!!\n\n\n321   MED. SHOT - (REVERSE ACTION) - WIND FAN               321\n\n      Henrietta lets out a terrible laugh and approaches the\n      wooden staircase.\n\n\n322   INT. CABIN MAIN ROOM - NIGHT                          322\n      MED. SHOT - THE GROUP\n\n      All eyes are on the banging trap door.  ASH'S wild\n      screams are coming from beneath.  They look at one\n      another, not sure of what to do.  Jake holds the ring\n      of keys.\n\n                              ANNIE\n               Let him out.\n\n                              JAKE\n               It's a trick.  I know it.\n\n                              ANNIE\n               LET HIM OUT!\n\n\n323   INT. CABIN CELLAR - NIGHT (STUDIO)                    323\n      WIDE SHOT - ASH\n\n      At the top of the steps, pounding on the trap door,\n      screaming to be let out.  HENRIETTA ENTERS the FRAME at\n      the bottom of the steps.  A flutter of moths about\n      her.\n\n\n324   WIDE SHOT - (REVERSE ACTION)                          324\n\n      Henrietta begins to climb the steps.  Two at a time.\n\n                              HENRIETTA\n               Come to me.  Come to sweet\n               Henrietta.\n\n\n325   INT. CABIN MAIN ROOM - NIGHT                          325\n      MED. SHOT - JAKE\n\n      As he tries one key after another.\n\n\n326   CLOSE SHOT - KEYS                                     326\n\n\tAs they are forced into the lock.\n\n\n327   INT. CABIN CELLAR - NIGHT                             327\n      CLOSE SHOT - ASH\n\n      Sweating at the top of the steps, watching as Henrietta\n      approaches.\n\n                              ASH\n               No.\n\n\n328   CLOSE SHOT - HENRIETTA                                328\n\n      Extending her rotted and worm infested arm toward him.\n\n                              HENRIETTA\n               Yesssssss.  You and I.  We\n               shall spend eternity together.\n\n\n329   CLOSE SHOT - ASH                                      329\n\n      Marie's shadow envelops him. He is petrified.\n\n                              HENRIETTA\n               But first I'll swallow your soul !\n\n\n330   INT. CABIN CELLAR - NIGHT (STUDIO)                    330\n      CLOSE SHOT - HENRIETTA - (STOP MOTION ANIMATION/REAR\n      SCREEN)\n\n      With a sharp recoil, then spring, Henrietta makes a\n      lunge at Ash.  Her face contorting, her teeth\n      lengthening, her mouth opening impossibly wide\n      as though she were going to swallow his head, and all as\n      she lunges forward.  She changes to \"Pee Wee\" head.\n\n\n330P  INT. CABIN CELLAR - NIGHT - 35MM KODAKCHROME SLIDE    330P\n\n      Plate for previous scene.\n\n\n331   INT. CABIN CELLAR - NIGHT (STUDIO)                    331\n      CLOSE SHOT - ASH\n\n      He screams as a set of bloody hands grab his face.\n      But they are not Henrietta's.  He is pulled upward to\n      the main room of the cabin.\n\n\n332   INT. CABIN MAIN ROOM - NIGHT                          332\n      CLOSE SHOT\n\n      It is Jake who pulls Ash to safety.\n\n\n333   WIDE SHOT - MAIN ROOM                                 333\n\n      Jake finishes pulling Ash up from the trapdoor and\n      onto the floor of the main room.  The horrible face of\n      Pee-Wee head Henrietta pops from the cellar!\n\n\n334   CLOSE SHOT - ANNIE AND ED                             334\n\n      SCREAMING at the sight of the beast.\n\n                              ANNIE\n               For God's sake!  That's my mother!\n\n\n335   CLOSE SHOT - JAKE                                     335\n\n      One of Henrietta's rotted hands reach up from the cellar\n      grabbing Jake.\n\n\n336   CLOSE SHOT - ED                                       336\n\n      As he moves to help Jake, Henrietta swats at his jaw,\n      knocking him backward into a picture frame. He shatters it\n      with his head and slumps to the floor.\n\n\n337   MED. SHOT - ASH                                       337\n\n      As he moves toward the trapdoor.\n\n\n338   CLOSE SHOT - (STYROFOAM TRAPDOOR)                     338\n\n      Ash's foot kicks the trapdoor shut and crushes\n      Henrietta's Pee-wee head between the door and the\n      floorboards.\n\n\n339   MED. SHOT - DUMMY OF HENRIETTA - PEE WEE HEAD         339\n\n      Ash leaps down upon the trapdoor, slamming it to pin\n      Pee-Wee head sideways.  The pressure sends her left\n      eyeball popping from her head, like a cork from a\n      champagne bottle.\n\n\n340   CLOSE SHOT - EYEBALL FLYBALL                          340\n\n      Henrietta's eyeball and trailing optic nerve - mounted\n      on glass - panning with the eyeball as it sails through\n      space.\n\n\n341   CLOSE SHOT - BOBBY JOE (REVERSE ACTION)               341\n\n      As the eyeball is shot into her screaming mouth.\n      She begins to gag on it.\n\n\n342   WIDE SHOT                                             342\n\n      Jake kicks Marie's Pee-Wee head in the face, sending\n      her back down into the cellar. The trap door shuts.\n      Ash leaps atop it. The sound of Henrietta falling down\n      the cellar steps is heard along with the beast's wild\n      ravings.  Ash quickly threads the chains through the\n      eyeloops.\n\n\n343   CLOSE SHOT - ASH                                      343\n\n      He snaps the lock shut. Ash is shaking. Jake slowly\n      moves down into his frame. He is completely terrified.\n\n\n343A  CLOSE SHOT - TAPE RECORDER IN F.G.                    343A\n      ASH, JAKE, ANNIE AND BOBBY IN B.G.\n\n      The tape recorder continues to play.\n\n                              RAYMOND KNOWBY (V.O.)\n                         (Voice on tape)\n               I fear that whatever I have\n               resurrected from this book, is sure\n               to come calling for me.\n\n\n344   EXT. WOODS/CABIN - NIGHT                              344\n      (SHAKI-CAM)\n\n      The CAMERA takes the POV of the Evil Force as it\n      glides through the woods. Over a stump, around the\n      Oak trees, through a patch of fog, as the cabin comes\n      into view.\n\n\n345   OMIT                                                  345\n\n\n346   MED. SHOT - ANNIE, ASH, JAKE, BOBBY JOE AND ED        346\n\n      Ash turns to the group, Annie is placing her wet\n      bandana atop Ed's forehead.\n\n                              ASH\n               There's something out there.  That...\n               witch in the cellar is only part of it.\n               It lives out in those woods.  In the Dark.\n               Something that's come back from the dead.\n\n\n346A  OMIT                                                  346A\n\n\n346B  OMIT                                                  346B\n\n\n346C  OMIT                                                  346C\n\n\n346D  OMIT                                                  346D\n\n\n347   CLOSE SHOT - BOBBY JOE                                347\n\n      Interrupting Ash.\n\n                              BOBBY JOE\n               Jake, let's beat it the hell out\n               o'here, right now.  I gotta get out!\n\n                              JAKE\n               Now Bobby, you ain't in no condition.\n\n                              ASH\n               Nobody goes out that door.  Not till\n               daylight.\n\n\n347A  THE GROUP                                             347A\n\n      They freeze in their tracks as they hear a gentle voice\n      which sings a melancholy tune.  Annie turns her head\n      to the sound and the CAMERA PANS TO reveal HENRIETTA whose\n      head juts in the space between the floorboards and the\n      trap door.  She is no longer possessed.  She looks as\n      she did earlier in the film.  She is singing a gentle\n      song to Annie.\n\n\n347B  CLOSE SHOT - HENRIETTA                                347B\n\n                              HENRIETTA\n               Remember that song Annie?  I used\n               to sing it to you when you were a baby.\n\n\n347C  CLOSE SHOT - ANNIE                                    347C\n\n      Uncertain of what to do, but wanting to believe.\n\n                              HENRIETTA\n               Let me out, dear.  It's so cold and dark\n               in here.\n\n                              ANNIE\n               Mother?\n\n                              HENRIETTA\n               Unlock these chains.  Quickly.\n\n\n347D  MEDIUM SHOT - ASH AND ANNIE                           347D\n\n      Annie starts to follow the instructions, but Ash halts\n      her gently.  He shakes his head.  Annie snaps out of\n      it.  She shakes her head and looks to the cellar.\n\n                              ANNIE\n               No.  No.  I don't know what you\n               are but you're not my mother.\n\n      Annie begins to cry.\n\n\n347E  CLOSE SHOT - TRAP DOOR                                347E\n\n      Henrietta is crying also.\n\n                              VOICE OF HENRIETTA\n               How can you say that to me Annie?\n\n                              ANNIE\n               No!\n\n                              VOICE OF HENRIETTA\n               You were born September 2nd, 1962.  I\n               remember it well because it was\n               snowing.  So strange that it would\n               be snowing in September.\n\n\n348   CAMERA TRACKING IN ON ANNIE                           348\n\n      Confused and tearful, she screams to the others in the\n      room.\n\n                              ANNIE\n               That thing in the cellar is not\n               my mother!\n\n      Ed stands sharply into her frame.  His eyes bone white,\n      his skin, the pale color of the dead.  His mouth has\n      grown over large.  His lips are black.  He is possessed.\n      He shrieks.  Annie screams and jumps back out of frame.\n\n\n349   MED. SHOT - ED POSSESSED                              349\n      RIGGING - REVERSE ACTION\n\n      He flies up into the air and writhes about as if he\n      were a human marionette.  He lets out a demonic moan\n      and then begins to laugh.\n\n\n350   MED. SHOT - BOBBY JOE AND JAKE                        350\n\n      As they clutch in fear at one another.\n\n\n351   MED. SHOT - ANNIE AND ASH                             351\n\n      As they look on in horror.  Ash steps in front of\n      Annie as she gapes at this monstrosity that was Ed.\n\n\n352   CLOSE SHOT - ED POSSESSED                             352\n      RIGGING\n\n      As he floats about the room.  His laughter suddenly\n      stops and a second demonic voice comes from his body.\n      It is female, and wailing in lament.\n\n\n353   CLOSE SHOT - ASH                                      353\n\n      Watching in horror.\n\n\n354   MED. SHOT - POSSESSED ED\n      RIGGING - UP AND DOWN\n\n      The body of Ed turns sharply toward the group, not\n      really seeing.\n\n                              ED\n                         (In the voice of POSSESSED #1)\n               We are the things that were.\n                         (In the voice of POSSESSED #2)\n               And shall be again! HA HA HA HA HA!\n                         (In the voice of POSSESSED #1)\n               Spirits of the book.\n                         (In the voice of POSSESSED #2)\n               We want what is yours!  LIFE!\n\n      As he floats about, his head dips and swoons.\n\n                              ED\n                         (In the voice of POSSESSED #1)\n               Dead by dawn!\n                         (In the voice of POSSESSED #2)\n               Dead by dawn!\n\n\n355   CLOSE SHOT - HENRIETTA POSSESSED                      355\n\n      Sticking her gnarled head from the cellar.\n\n                              HENRIETTA\n               Dead by dawn!  Dead by dawn!\n\n\n356   WIDE SHOT - JAKE AND BOBBY JOE IN FOREGROUND          356\n      RIGGING - DOLLY CART\n\n      Ed floating, turns his head sharply to Bobby Joe.  The\n      Possessed body of Ed rushes through the air towards\n      her.  He opens his mouth wide open.\n\n\n357   ED'S POV                                              357\n\n      As he quickly rushes upon a screaming Bobby Joe.\n\n\n358   CLOSE SHOT - ED AND BOBBY JOE                         358\n\n      He bites into Bobby Joe's head. With a single motion\n      he rips out the bulk of the hair from her head with a\n      terrible RIIIIIIIIP SOUND.\n\n\n358A  MEDIUM SHOT - ED DUMMY                                358A\n\n      Stands up into frame with a clump of Bobby Joe's hair\n      in his mouth and swallows it.\n\n\n359   WIDE SHOT - GROUP                                     359\n\n      Bobby Joe collapses to the ground.\n\n\n360   MED. SHOT - HENRIETTA POSSESSED                       360\n\n      As she calls from the cellar.\n\n                              HENRIETTA\n               Free me!  Unlock these chains!\n\n\n361   MED. SHOT - POSSESSED ED                              361\n\n      He turns to the trap door and moves toward it.\n\n\n362   MED. SHOT - ASH AND ANNIE                             362\n\n      Both horrified.  Ash retreats.  Annie is shocked as\n      she watches Ash back into the middle bedroom and\n      disappear.\n\n\n363   CLOSE SHOT - ANNIE                                    363\n\n                              ANNIE\n              Where are you going?!  HELP\n              US!!  You filthy COWARD!\n\n\n364   ANGLE FROM TRAP DOOR - POSSESSED ED AND JAKE          364\n\n      Possessed Ed moves toward the trap door. Jake comes up\n      quickly behind Ed to grab his shoulder.\n\n\n365   JAKE'S POV - DUMMY OF POSSESSED ED                    365\n\n      As Jake's hand reaches for the shoulder of possessed Ed.\n      The head of possessed Ed spins around on its neck so that\n      it faces Jake.\n\n\n365A  CLOSE SHOT - POSSESSED ED                             365A\n\n                              ED\n                         (In the voice of a woman)\n               We see you!\n\n\n366   CLOSE SHOT - JAKE                                     366\n\n      Screaming as Ed's hand enters frame, and snags Jake's\n      face. He tosses Jake upward.\n\n\n367   CLOSE SHOT - ED POSSESSED                             367\n\n      As he tosses Jake upward.\n\n\n368   HIGH-WIDE SHOT - POSSESSED ED AND JAKE STUNTMAN       368\n      REVERSE ACTION - UNDERCRANKED\n\n      Jake flies upward towards the ceiling of the cabin.\n\n\n369   INT. CABIN CEILING - NIGHT (CEILING SET PIECE)        369\n      MED. SHOT\n\n      A prop light bulb \"Shining\" in its fixture.  Jake's\n      head comes flying up into frame, shattering it, and\n      slamming into the wood ceiling and then falling back\n      down again.\n\n\n370   INT. CABIN MAIN ROOM - NIGHT                          370\n      MED. SHOT - POSSESSED ED AND JAKE STUNT MAN\n\n      As Jake slams back down to the floor of the cabin.\n\n\n371   MED. SHOT - ASH                                       371\n\n      As he reappears in the doorway of the room.  Now he\n      clutches an axe in his single hand.\n\n\n372   MED. SHOT - POSSESSED ED                              372\n\n      As he grabs the chains that secure the trap door ready\n      to rip them loose.  He turns his head to see:\n\n\n372A  OVER POSSESSED ED'S SHOULDER                          372A\n\n      Ash approaches with the axe.\n\n\n373   MED. SHOT - ASH AND ANNIE AND OFF SCREEN              373\n      DUMMY OF ED\n\n      Ash exits the frame and we are left with Annie and the\n      stark shadow of possessed Ed which is cast upon the\n      wall behind her.  We watch as the shadow of Ash with the\n      axe, slices through the top portion of possessed Ed's\n      head.  Annie screams as she is splattered with green\n      bile.\n\n\n373A  CLOSE SHOT - POSSESSED ED DUMMY                       373A\n\n      Missing Ed's right hand portion of his head.\n      His brain, shriveled like the inside of a pumpkin.\n\n\n373B  POSSESSED ED'S POV - ASH - EYEMO CAMERA AND MOUNT     373B\n\n      Ash stands before us, his axe dripping green bile.\n      Ed's arms flail wildly on either side of the camera,\n      groping at the air.  He slowly falls over and slams\n      to the floor.\n\n374   OMIT                                                  374\n\n\n375   OMIT                                                  375\n\n\n376   MED. SHOT - POSSESSED ED (FRAMED WITH AND W/O HEAD)   376\n\n      Ed's body falls to the floor.  It lays quiet for a\n      moment and then begins to writhe and scream in its\n      demonic death throes.  Finally, he is silent.\n\n\n377   MED. SHOT - ASH AND ANNIE - POSSESSED ED DUMMY        377\n\n      Ash turns to her.\n\n                              ASH\n               Start up that saw and hand it here!\n               We're gonna cut him up.\n\n      Annie looks to the chainsaw and then to the unmoving body\n      of Ed.  She is repulsed at the thought.\n\n                              ANNIE\n               No.\n\n                              ASH\n               START IT UP!\n\n                              ANNIE\n               NO!\n\n      Possessed Ed stands up quickly into frame!  The evil\n      force having re-animated his lifeless body.\n\n\n377A  CLOSE SHOT ASH - OVER POSSESSED ED'S SHOULDER         377A\n      FLYING PLATFORM\n\n      As a hand grabs Ash's throat.  Possessed Ed exits\n      frame, revealing it to be Ash's evil hand on his own\n      throat.  It lifts him into the air.\n\n\n377B  CLOSE SHOT - ASH'S FEET                               377B\n\n      As they are lifted off the floor.\n\n\n377C  CLOSE SHOT ASH                                        377C\n\n      He pries the evil hand from his throat and falls.\n\n\n377D  ASH/EVIL HAND                                         377D\n\n      As he slams to the floor the evil hand scurries away\n      in the B.G.\n\n\n378   OMIT                                                  378\n\n\n379   OMIT                                                  379\n\n\n380   MED. SHOT - POSSESSED ED DUMMY AND ANNIE              380\n\n      Annie is screaming in horror.  Possessed Ed backhands\n      her across the face.\n\n\n381   MED. SHOT - WRITING DESK                              381\n\n      Annie slams into a desk shattering it to splinters\n      of wood.  She falls to the floor.\n\n\n382   MED. SHOT - ASH                                       382\n\n      As he grabs the axe.\n\n\n383   MED. SHOT - POSSESSED ED - DUMMY                      383\n\n      As he stands sharply into frame.  His mouth\n      wide open and screaming.\n\n\n384   MED. SHOT - ASH AND POSSESSED ED                      384\n\n      Terrified, as he moves toward possessed Ed with the\n      axe.\n\n\n385   MED. SHOT - ASH AND POSSESSED ED DUMMY                385\n      RUBBER AXE\n\n      Ash brings the axe down upon Ed's shoulder, knocking\n      him to the floor.  ASH swings the axe again and again.\n      Different colors of bile and blood fly up into frame as\n      Ash chops.\n\n\n385A  CLOSE SHOT - ANNIE                                    385A\n\n      Screaming at the sight.\n\n\n386   CLOSE SHOT - ASH                                      386\n\n      His axe blade rises and falls as black demon blood\n      flies up into frame.\n\n\n387   CLOSE SHOT - LOW ANGLE - FLOOR LEVEL                  387\n      ASH AND ED DUMMY PARTS\n\n      Ed's missing portion of his head sits upon the floor.\n      His eye in extreme C.U. in the foreground. It looks\n      wildly about into the CAMERA. In the background, we\n      watch Ash bring down the axe until all is silent.\n\n\n388   WIDE SHOT                                             388\n\n      Jake slowly stands into the empty frame. He is in shock\n      from what he has just seen.  Annie slowly rises into\n      frame - shaking her head in a silent \"No.\" Ash slowly\n      rises into frame, terrified. They are looking down at\n      the out-of-frame remains of possessed Ed.\n\n\n388A  OMIT                                                  388A\n\n\n389   EXT. CABIN - NIGHT - MITCHELL                         389\n\n      The moon has grown larger.  Fog billows past the cabin.\n\n\n389P  EXT. NIGHT - THE FULL MOON                            389P\n\n\n390   OMIT                                                  390\n\n\n390A  MAIN ROOM NIGHT - ASH, JAKE, BOBBY JOE AND ANNIE      390A\n\n      Jake sprays a can of air freshener about the room.\n      He holds his nose.  Ash tosses a bloodied sheet,\n      containing the remains of possessed Ed to the floor.\n      It lands with a sickening thud.  Wiping his face with a\n      rag, Ash moves off in disgust.  We hold on the bundled\n      sheet as the trap door next to it silently opens.\n      Henrietta's rotted hand emerges, unnoticed by the others\n      in the room.\n\n                              BOBBY JOE\n               Jake, I can't take no more of this.\n\n      Henrietta's rotted hand pulls the bundle of body\n      parts silently down into the cellar and quietly\n      closes the trap.\n\n\n390B  MEDIUM SHOT JAKE AND BOBBY JOE                        390B\n\n      Jake moves to the window and looks out.\n\n                              JAKE\n               That's funny.\n\n                              BOBBY JOE\n               What?\n\n                              JAKE\n               That trail we came in here on...\n               well, it just ain't there no more.\n               Like the woods jus' swallowed it.\n\n      The room goes quiet.  The sound of the wind outside\n      the cabin has died.  Jake and Bobby Joe cock their\n      heads to this new silence.\n\n\n391   OMIT                                                  391\n\n\n392   CLOSE SHOT - ANNIE AND ASH                            392\n\n      She looks about the room, getting scared.\n\n                              ANNIE\n               It's so quiet.\n\n      Ash stands slowly into frame.  He knows that it can't\n      be good.\n\n\n393   WIDE SHOT - THE GROUP                                 393\n\n      As they raise their heads to a distant pounding sound.\n      It grows louder.\n\n      BOOM - BOOM!\n\n      BOOM - BOOM!\n\n                              JAKE\n               What the hell is it?\n\n                              ASH\n               Maybe something... Something trying\n               to force its way into our world.\n\n      BOOM!\n\n      BOOM!\n\n      BANG!\n\n      BAM!\n\n\n393A  EYEMO CAMERA/MITCHELL CAMERA - GROUP                  393A\n\n      The cabin WALL.  Bang!\n\n\n393B  THE FRONT DOOR - GROUP - EYEMO/MITCHELL               393B\n\n\n393C  THE BOARDED WINDOW - GROUP - EYEMO/MITCHELL           393C\n\n      BANG!\n\n\n393D  THE CEILING BEAMS - GROUP - EYEMO/MITCHELL            393D\n\n      BAM!\n\n\n393E  A SECTION OF WALL - GROUP - EYEMO/MITCHELL            393E\n\n\n393F  A SECTION OF THE TONGUE AND GROOVE FLOOR              393F\n      EYEMO - MITCHELL - GROUP\n\n      BAM!\n\n\n393G  ASH - C.U.                                            393G\n\n\n393H  JAKE - C.U.                                           393H\n\n\n393I  ANNIE - C.U.                                          393I\n\n\n393J  BOBBY JOE - C.U.                                      393J\n\n\n394   MEDIUM SHOT - JAKE AND BOBBY JOE                      394\n\n      Bobby Joe runs to Jake's arms.  He clutches her tightly.\n\n\n395   MEDIUM SHOT - ANNIE AND ASH                           395\n\n      Annie runs to Ash.  He holds her.  The pounding sounds\n      halt.  Again they are left in silence.  Annie awkwardly\n      disengages herself from Ash.  They hear a sound coming\n      from the middle bedroom.\n\n                              BOBBY JOE\n               It's in there.\n\n\n396   MEDIUM SHOT - DOOR TO MIDDLE BEDROOM                  396\n\n      It is opened a crack.\n\n\n397   MEDIUM SHOT - THE GROUP                               397\n\n                              ASH\n               We'll all go in together.\n\n                              JAKE\n               Hell no, you're the curious one.\n\n\n398   MEDIUM SHOT - ASH AND ANNIE                           398\n\n      He moves toward the door.\n\n                              ANNIE\n               I'll go with you.\n\n      Ash nods to Annie in a show of thanks.  He grabs the\n      axe, and pushes open the door to the middle bedroom.\n      Annie follows with the flickering oil lantern.\n\n\n399   INT. MIDDLE BEDROOM - NIGHT                           399\n\n      The door to the main room creaks open.  Ash and Annie\n      cautiously enter.  They look about the place.\n\n\n400   ASH'S POV - MIDDLE BEDROOM - NIGHT                    400\n\n      As the CAMERA PANS the shadowed corners of the room.\n\n\n401   MEDIUM SHOT - ASH AND ANNIE                           401\n\n      An eerie whistling wind is heard.  It has an other\n      worldly sound, very far off.\n\n\n401A  MEDIUM SHOT - DOORWAY TO MIDDLE BEDROOM               401A\n\n      Bobby Joe and Jake enter the room, drawn by the sound.\n\n\n401B  CLOSE SHOT - BOBBY JOE                                401B\n\n      She looks about, frightened.\n\n\n401C  OMIT                                                  401C\n\n\n401D  MEDIUM SHOT - JAKE AND BOBBY JOE                      401D\n\n      Jake takes Bobby Joe's hand.  Bobby Joe smiles,\n      frightened.\n\n\n402   MEDIUM SHOT - ASH                                     402\n\n      Waiting.\n\n\n403   MEDIUM SHOT - PANNING THE DARK ROOM                   403\n\n      As the eerie whistling sound grows louder.  It is\n      followed by the angry sound of something moving violently\n      about the room.  A shattering of glass.\n\n\n404   OMIT                                                  404\n\n\n405   MEDIUM SHOT - THE GROUP                               405\n\n      WOOOOOSH!  The group is hit with a tremendous blast of\n      air.  They shiver from the cold.\n\n\n406   MEDIUM SHOT - ASH                                     406\n\n      The wind in the room suddenly stops.  He blows out his\n      breath and watches it vaporize.  The screaming face of\n      Raymond Knowby emerges from the wall.  A life like\n      spirit made of swirling smoke and mist.\n\n                              RAYMOND\n               Annie.\n\n\n406P  PLATE FOR PREVIOUS SCENE                              406P\n      BLACK STUDIO - RAYMOND\n\n\n407   CLOSE SHOT - ASH AND ANNIE                            407\n\n      They turn to the ghost in fear.\n\n\n408   MEDIUM SHOT - JAKE AND BOBBY JOE                      408\n\n      Awestruck.  Bobby Joe crosses herself.\n\n                              JAKE\n               Holy Mother O'Mercy.\n\n\n409   OMIT                                                  409\n\n\n410   OMIT                                                  410\n\n\n411   OMIT                                                  411\n\n\n412   OMIT                                                  412\n\n\n413   MEDIUM SHOT - THE GHOST OF RAYMOND                    413\n\n                              RAYMOND\n               There is a dark spirit here that\n               wants to destroy you.  Your\n               salvation lies in the pages\n               from the Book of the Dead.\n\n      The ghost of Raymond points to Annie's glass case.\n      CAMERA PANS to it.  Inside are the pages from the Book.\n\n\n413P  PLATE FOR PREVIOUS SCENE                              413P\n      BLACK STUDIO - RAYMOND\n\n\n414   CLOSE SHOT - ANNIE                                    414\n\n      Listening.\n\n\n415   ANGLE - THE GROUP AND THE GHOST OF RAYMOND            415\n\n                              RAYMOND\n               Recite the passages.  Dispel the evil.\n               Save my soul... And your own lives.\n\n      The ghost of Raymond screams and is gone.\n\n\n415P  PLATE FOR PREVIOUS SCENE                              415P\n      BLACK STUDIO - RAYMOND\n\n\n416   MEDIUM SHOT - THE GROUP                               416\n\n      Whoosh!  Again they are hit with a blast of air.\n\n\n416A  MEDIUM SHOT - JAKE AND BOBBY JOE                      416A\n\n                              BOBBY JOE\n               Jake, you squeezing my hand too tight.\n\n                              JAKE\n               I ain't got your hand, baby.\n\n                              BOBBY JOE\n               Then who...?\n\n      Bobby Joe raises her hand into frame, to reveal Ash's\n      Evil Hand clutched in hers.  Bobby Joe goes nuts,\n      screaming and flailing about trying to throw the hand\n      from her.  She slams into the lantern, knocking it out.\n      We lose them in the darkness.\n\n                              JAKE'S VOICE\n               Somebody get the light!\n\n      The sound of chairs being pushed over.  The sound of\n      a door opening and closing.\n\n\n417   CLOSE SHOT - ASH                                      417\n\n      As he lights the lantern illuminating the room.\n      CAMERA PANS over to reveal only Jake and Annie.\n\n\n418   CLOSE SHOT - JAKE                                     418\n\n      Looking about.\n\n                              JAKE\n               Hey.  Bobby Joe's gone!\n\n\n419   OMIT                                                  419\n\n\n420   OMIT                                                  420\n\n\n421   EXT. CABIN - NIGHT                                    421\n\n      Screaming, Bobby Joe makes a mad dash away from the\n      cabin.  It diminishes in size behind her, she has had\n      enough of it.\n\n\n422   EXT. WOODS - NIGHT - DRAGWAY                          422\n      MEDIUM SHOT - BOBBY JOE - TRACKING\n\n      As she races through the woods.\n\n\n423   CLOSER - JONES' CREEK                                 423\n\n      She runs deep into the woods, still looking behind her\n      as she slams into a twisted oak tree that stops her flat.\n\n      An angry face appears on the surface of the tree.  Its\n      gnarled bark folds open to reveal very human like oversized\n      eyes.  A large fold in its bark opens to form a gaping\n      mouth dripping tree sap saliva.\n\n                              TREE FACE\n               BAHHHH!\n\n\n423A  CLOSE SHOT - TREE FACE                                423A\n\n\n424   CLOSE SHOT - BOBBY JOE - (REVERSE ACTION)             424\n      JONES' CREEK\n\n      Screaming as she backs away from this living tree as\n      a flurry of snake like vines pick themselves up off of\n      the ground and come to life about her.\n\n\n425   CLOSE SHOT - BOBBY JOE'S LEGS - (REVERSE ACTION)      425\n      JONES' CREEK\n\n      Two living vines wind their way toward her legs and\n      coil around her ankles tightly.\n\n\n426   CLOSE SHOT - BOBBY JOE - JONES' CREEK - 4 RIPS        426\n\n      She lets out a short shrill scream, as her shirt\n      is torn away from her.\n\n\n427   MED. SHOT - (REVERSE ACTION) JONES' CREEK             427\n\n      Living vines wind around Bobby Joe's torso and breasts\n      in a furious wrapping motion.\n\n\n428   CLOSE SHOT - (REVERSE ACTION) JONES' CREEK            428\n\n      A living vine wraps around her throat.\n\n\n429   CLOSE SHOT - (REVERSE ACTION) JONES' CREEK            429\n\n      Tiny vines wrap around Bobby Joe's hand and fingers.\n\n\n429A  EXT. JONES CREEK - NIGHT                              429A\n      SHOTS OF VINES COMING TOWARDS CAMERA\n\n\n430   MED. SHOT - RIGGING - STUNT                           430\n      UNDERCRANKED - JONES' CREEK\n\n      Bobby Joe, wrapped in vines, is reeled backwards and\n      ripped through a wall of branches.\n\n\n431   MED. SHOT - PANNING - RIGGING EFFECT - STUNT          431\n      UNDERCRANKED - JONES' CREEK\n\n      At a great speed, Bobby Joe is pulled away from the\n      cabin and towards the forest by the vines.\n\n\n432   BOBBY JOE'S POV - OVER HER LEGS - RIGGING EFFECT      432\n      STUNT - UNDERCRANKED - REVERSE ACTION - DRAGWAY\n\n      As the vines rocket her on a speeding FAST MOTION\n      joyride along the forest floor.\n\n\n433   CLOSE SHOT - BOBBY JOE'S FACE                         433\n      RIGGING EFX - DRAGWAY\n\n      As she drags along the forest flctor, the smaller vines\n      force their way into Bobby Joe's nose and mouth and\n      then under the first layer of her facial skin.\n\n\n433A  TRACKING SHOT - DRAGWAY - DUMMY AND STUNT             433A\n\n      She is pulled along the ground and down into a\n      foxhole (dummy).  Camera continues tracking along\n      her original trajectory until we come to the second\n      foxhole where she emerges, now covered in mud, and\n      screaming.\n\n\n433B  ANGLE - DUMMY - JONES' CREEK                          433B\n\n      Bobby Joe rips through spikes extending from a log\n      and is dragged through two mud puddles.  The vines\n      wisk her away.\n\n\n434   EXT. SWAMP - NIGHT                                    434\n      PANNING SHOT - RIGGING EFFECT - STUNT\n\n      She hits a swamp with a giant splash, but even this\n      does not stop her.\n\n\n435   LONG SHOT - SWAMP                                     435\n      ROOSTERTAIL WATER SPRAY EFX - STUNT\n\n      She glides across the surface of the swamp with a great\n      roostertail spray of water, as if she were on water skis.\n\n\n436   ANGLE - RIGGING EFX - STUNT - SWAMP                   436\n\n      She hits the other side of the swamp and is rocketed out\n      of the water and across the forest floor.\n\n\n437   EXT. WOODS - NIGHT - JONES' CREEK - DUMMY             437\n      STATIC CAMERA - RIGGING EFFECT - STUNT - UNDERCRANKED\n\n      Bobby Joe comes roaring towards us, screaming.  She\n      rips past.\n\n\n438   STATIC CAMERA - RIGGING EFFECT - STUNT                438\n      UNDERCRANKED - JONES' CREEK\n\n      From BEHIND CAMERA Bobby Joe appears and goes racing\n      into the distance.\n\n\n439   BOBBY JOE'S POV - OVER HER LEGS - DRAGWAY              439\n      RIGGING EFFECT - UNDERCRANKED - STUNT\n\n      Darting in and around trees, a major stump is coming\n      right for her.  Bobby Joe's legs spread wide.  The\n      tree stump races closer.  Bobby Joe SCREAMS . . . her\n      last.\n\n\n439A  TREE STUMP'S POV - BOBBY JOE APPROACHES              439A\n      UNDERCRANKED\n\n\n439B  BOBBY JOE'S LEGS - STUMP - DRAGWAY                    439B\n      STOP MOTION - REVERSE ACTION\n\n      Girl meets stump.\n\n\n440   EXT. WOODS - NIGHT - OVERCRANKED                      440\n      LOW SHOT - LOOKING UPWARD PAST THE STUMP -\n      BLOOD GEYSER EFX\n\n      We hear the RIP!  And watch as a geyser of blood floods\n      up into the night sky.\n\n\n441   INT. CABIN - MAIN ROOM - NIGHT - OVERCRANKED          441\n      CLOSE SHOT - GLASS CASE CONTAINING PAGES FROM BOOK OF\n      THE DEAD\n\n      It falls away from the CAMERA and shatters on the table\n      beneath us.\n\n\n442   MEDIUM SHOT - ASH AND ANNIE                           442\n\n      As their hands scramble at removing the pages from the\n      bits of broken glass.\n\n\n443   MED. SHOT - JAKE IN FG - ASH AND ANNIE IN BG          443\n\n      Jake is looking out the boarded window of the cabin,\n      searching for some sign of Bobby Joe.\n\n\n444   EXT. WOODS - NIGHT                                    444\n      JAKE'S POV - THE DARK WOODS - WINDOW FRAME\n\n      All is silent as fog rushes in and around the woods.\n\n                              JAKE\n               Where the hell is she?\n\n\n445   INT. CABIN MAIN ROOM - NIGHT                          445\n      MED. SHOT - JAKE AND ASH AND ANNIE\n\n      Jake turns to Ash.\n\n                              JAKE\n               We gotta go out there and find\n               her!\n\n                              ASH\n               If she went out in those woods,\n               she's not coming back.\n\n      Jake turns back to the window.  Ash turns to Annie.\n      He glances down at the pages that Annie is looking over.\n\n\n445A  ASH'S POV - CLOSE SHOT - PAGES AND ANNIE              445A\n\n      One of the pages is a clear pictorial of Ash as the\n      \"Hero from the Sky.\"\n\n\n445B  ASH AND ANNIE                                         445B\n\n      Ash shudders.\n\n                              ANNIE\n               What is it?\n\n                              ASH\n               Felt like someone just walked over my\n               grave.  It's that picture.\n\n      Annie looks to it.\n\n\n445C  CLOSE SHOT - PAGE OF THE BOOK OF THE DEAD             445C\n      CONTAINING ASH'S \"HERO FROM THE SKY\" ILLUSTRATION.\n\n\n445D  ANNIE AND ASH                                         445D\n\n                              ANNIE\n               In 1300 AD.  This was the \"Hero from\n               the Sky,\" who was prophesized to destroy\n               this Evil.\n\n                              ASH\n               He didn't do a very good job.\n               What about the passages?\n\n\n446   CLOSE SHOT - ANNIE                                    446\n\n      As she quickly gives the pages a cursory glance.\n\n                              ANNIE\n               Here it is.  Two passages.\n\n      For the first time, she smiles at Ash.\n\n                              ANNIE\n               We've got it!\n\n\n446A - 446H    OMIT                                  446A - 446H\n\n\n447   CLOSE SHOT - ASH                                      447\n\n      Finally seeing his salvation, his face shows hope.\n\n\n447A  MEDIUM SHOT - ASH AND ANNIE                           447A\n\n      Annie reads through the pages.\n\n                              ANNIE\n               Recitation of the first passage will\n               make this \"Dark Spirit\" manifest itself\n               in the flesh.\n\n                              ASH\n               Why the hell would we want to do that?\n\n      Annie thumbs through one or two of the other pages.\n\n                              ANNIE\n               Recitation of the second passage creates\n               a kind of rift in time and space, and\n               the physical manifestation of this spirit\n               can be forced back through this rift...\n               to an earlier time and place.  At least\n               that's the best translation I can ....\n\n      CLICKITY CLICK\n\n\n448   MEDIUM SHOT - ASH AND ANNIE                           448\n\n      Annie and Ash look up to the source of the sound.\n\n\n449   MEDIUM SHOT - JAKE                                    449\n\n      He has just snapped a shell into the firing chamber of\n      the shotgun.  He points it at Ash and Annie.\n\n                              JAKE\n               I'm runnin' the show now.\n\n\n450   MEDIUM SHOT - ASH AND ANNIE                           450\n\n      Standing together, confused.\n\n\n450A  CLOSE SHOT - JAKE                                     450A\n\n                              JAKE\n               We're goin' outside into those woods\n               to look for Bobby Joe, an' once we\n               find her, we're gettin' the hell\n               outta here.\n\n                              ASH\n               If you want to look for her,\n               go ahead.\n\n                              JAKE\n               You two comin' with me.  I ain't goin'\n               out there alone.\n\n                              ASH\n               NO, YOU IDIOT.  You'll kill us all.\n               She's dead by now.  With these pages\n               we can...\n\n      Jake grabs the pages from Annie's hand.\n\n                              JAKE\n               Those pages don't mean shit.\n\n      Jake kicks the pages down into the cellar.  Ash and\n      Annie look on in horror.\n\n                              JAKE\n               'Sides.  Now you ain't got no, choice.\n\n      Jake pushes at Ash with the barrel of the shotgun.\n\n                              JAKE\n               Now move!\n\n      Ash hesitates.\n\n                              JAKE\n               Move you son of a bitch!\n\n\n451   EXT. WOODS/CABIN - NIGHT                              451\n\n      Ash, Annie and Jake exit the cabin.\n\n\n452   EXT. FRONT PORCH OF CABIN - NIGHT                     452\n      TRACKING BACKWARD\n\n      Ash, Annie and Jake walk towards the woods.  In the\n      FG is Ash.  He looks off past the CAMERA in fear.\n\n\n453   ASH'S POV - WOODS - NIGHT ROD PUPPETS - STUDIO        453\n\n      As he approaches a line of trees whose branches bend\n      and sway with a threatening motion.\n\n\n453A  EXT. CABIN - NIGHT - TRACKING BACKWARD                453A\n      ASH, JAKE, AND ANNIE\n\n                              ASH\n               No trail.  Which way do you\n               intend to go?\n\n\n453B  CLOSE SHOT - JAKE                                     453B\n\n      Looking confused and frightened.  He calls out\n      desperately.\n\n                              JAKE\n               Bobby Joe!\n\n\n453C  EXT. WOODS NIGHT - POV EVIL FORCE                     453C\n\n      As it glides through the woods.  We hear a muted\n      shout from Jake.\n\n                              JAKE (O.S.)\n               Bobby Joe, where are you girl?\n\n      And the POV of the force suddenly swings about to\n      reveal Jake, Ash, and Annie not to far away.\n\n\n453D  EXT. CABIN - NIGHT - TRACKING SHOT - ASH              453D\n\n      As he moves deeper into the woods.\n\n\n453E  EXT. CABIN - NIGHT - TRACKING SHOT - ANNIE            453E\n\n      As she searches the woods with her eyes in fear.\n\n\n453F  EXT. CABIN - NIGHT - TRACKING SHOT - JAKE             453F\n\n      As scared as the rest of them, but driven to find\n      Bobby Joe.\n\n\n453G  POV EVIL FORCE - EXT. CABIN - NIGHT                   453G\n\n      As it approaches the group.\n\n\n453H  EXT. CABIN - NIGHT - FOAM SHOTGUN STOCK               453H\n      JAKE, ASH, AND ANNIE\n\n                              JAKE\n               Bobby Joe!  Bobby Joe!\n\n      Ash approaches Jake.\n\n                              ASH\n               You'll get us all killed.\n\n                              JAKE\n               Shaddup!\n\n      Jake slams Ash across the face with the stock of\n      the shotgun.  Ash plummets to the ground.  Annie\n      screams!  She goes after Jake.  Jake slugs her and\n      she falls to the ground.\n\n\n453I  EXT. CABIN - NIGHT - JAKE, ASH, AND ANNIE             453I\n      POV - EVIL FORCE\n\n      It draws closer.\n\n\n453J  EXT. CABIN - NIGHT - JAKE - CLOSE SHOT                453J\n\n      Raging to the night!\n\n                              JAKE\n               Bobby Joe!\n\n\n453K  EXT. CABIN - NIGHT                                    453K\n\n      POV of Evil Force racing up to the group.\n\n\n453L  EXT. CABIN - NIGHT - CLOSE SHOT - JAKE                453L\n\n      Jake halts his screaming.  He listens in the silence\n      as possessed Ash juts up into the frame!  His eyes\n      are bone white, his flesh, the pale color of the dead.\n      His lips, black.  He bellows to the night!\n\n\n454 - 473  OMIT                                        454-473\n\n\n474   EXT. CABIN - NIGHT                                    474\n      CLOSE SHOT - ANNIE\n\n      She screams and stumbles backwards, towards the cabin.\n\n\n475   EXT. CABIN - NIGHT - CRANE                            475\n      MEDIUM SHOT - POSSESSED ASH - JAKE DUMMY - FLYING RIG\n\n      Possessed Ash lifts Jake up above his head and throws\n      him into a large tree.  It explodes in a blast of\n      sawdust as the dummy slams into it.\n\n\n476   INT. CABIN MAIN ROOM - NIGHT                          476\n      MEDIUM SHOT\n\n      Annie dashes inside and turns to look out the open\n      doorway.\n\n\n477   EXT. CABIN - ANNIE'S POV - THRU THE OPEN DOORWAY      477\n\n      All is quiet outside, no sign of Possessed Ash or\n      Jake, and then Possessed Ash is there, emerging from\n      the darkness suddenly.  He raises his finger and\n      points to Annie.  He speaks in the low garbled voice\n      of a demon:\n\n                              POSSESSED ASH\n               JOIN US!\n\n\n478   INT. CABIN - MED. SHOT - ANNIE                        478\n\n      She rushes to the door, hoping to get there before\n      Possessed Ash.\n\n\n479   MED. SHOT - ANNIE AND POSSESSED ASH                   479\n\n      She slams the front door shut just in time.\n\n\n480   MED. SHOT - ANNIE - WRITING DESK                      480\n\n      She picks up the Kandarian Dagger.  CREAK - SNAP!\n      A sound coming from somewhere in the rear of the\n      cabin.  She turns toward the door to the hallway.\n\n\n481 - 486      OMIT                                   481 - 486\n\n\n487   ANNIE'S POV - THE DOOR TO THE HALLWAY                 487\n\n      It is closed.\n\n\n488   OMIT                                                  488\n\n\n489   MED. SHOT - ANNIE                                     489\n\n      She moves to investigate the sound.  As she approaches\n      the rear door to the hall and slowly opens it.\n\n\n489A  ANNIE'S POV                                           489A\n\n      As the door to the hallway is pulled open, revealing\n      ... only the empty hallway.\n\n\n489B  INT. CABIN HALLWAY - NIGHT                            489B\n      ANNIE\n\n      She breathes a sigh of relief.\n\n\n490   ANNIE'S POV                                           490\n\n      As she moves down the hall.  It is dark.  Curtains\n      flutter on the boarded windows.\n\n\n491   CLOSE SHOT - ANNIE                                    491\n\n      As she moves towards the rear of the cabin.\n\n\n491A  INT. HALLWAY/EXT. CABIN - LOCATION - ANNIE'S POV      491A\n      THE WINDOW AND WOODS BEYOND\n\n      We approach the window and look out into the night.\n      Fog billows through the trees, and in the distance\n      the monster that is Ash emerges.  He heads toward the\n      cabin and disappears in a bank of fog.\n\n\n491B  INT. HALLWAY (STUDIO)                                 491B\n\n      Annie is frightened.  She spins her head to a sound.\n\n\n492   ANNIE'S POV - THE REAR DOOR OF THE CABIN              492\n\n      Creak!  The doorknob is turning.  Something is trying\n      to get in.\n\n\n493   ANNIE - MED. SHOT                                     493\n\n      She forces her back to the wall.  She tenses with the\n      dagger, ready to slay whatever should enter.\n\n\n494   CLOSE SHOT - ANNIE                                    494\n\n      She waits.\n\n\n495   CLOSE SHOT - THE KANDARIAN DAGGER                     495\n\n      Gripped tightly in Annie's sweating hands.\n\n\n496   CLOSE SHOT - DOORKNOB                                 496\n\n      Rattling violently now. And suddenly it opens.\n\n\n497   CLOSE SHOT - ANNIE'S HANDS                            497\n\n      As they swing the dagger.\n\n\n498   CLOSE SHOT                                            498\n\n      As the dagger imbeds in the intruder's chest.  CAMERA\n      PANS UP quickly to reveal a gasping Jake.\n\n\n499   MEDIUM SHOT - JAKE AND ANNIE                          499\n\n      Jake falls to the ground, half in and out of the doorway.\n      He is still alive.\n\n\n500   CLOSE SHOT - ANNIE                                    500\n\n      As she backs away in horror, clutching at her head.\n\n                              ANNIE\n               No!\n\n      She backs to a partially boarded window.\n\n\n501   MEDIUM SHOT - ANNIE                                   501\n\n      Possessed Ash juts up into frame in the window behind\n      her.  Annie screams and runs toward the open back door.\n      Possessed Ash spots the open door through the window\n      and begins to move around the side of the house.\n\n\n502   MED. SHOT - ANNIE                                     502\n\n      As she goes to slam the door.\n\n\n503   MED. SHOT - JAKE                                      503\n\n      As he lies moaning in the doorway, the door slams upon\n      him.\n\n\n504   MED. SHOT - ANNIE                                     504\n\n      As she reaches down and pulls Jake's body out of the\n      way.\n\n\n505   EXT. CABIN/REAR - NIGHT                               505\n      POSSESSED ASH\n\n      As he moves around the side of the cabin, tearing apart\n      a trellis that stands in his path, and three hanging\n      flowerpots as he approaches the open door.\n\n\n506   INT. CABIN BACK HALLWAY - NIGHT                       506\n      MED. SHOT - ANNIE\n\n      Again she tries to slam the door.\n\n\n507   MED. SHOT - JAKE'S DUMMY ANKLE                        507\n\n      Which lies in the door's path, preventing it from closing.\n\n\n508   EXT. CABIN/REAR - NIGHT                               508\n      OVER POSSESSED ASH'S SHOULDER\n\n      As he approaches the back door. He grabs the screen door\n      and tears it loose with a single motion.\n\n\n509   INT. CABIN REAR HALLWAY - NIGHT                       509\n      ANNIE\n\n      As she pulls Jake's ankle from the door and slams it.\n      All is again silent.\n\n\n509A  INT. CABIN - REAR HALLWAY - NIGHT - ANNIE AND JAKE    509A\n\n      Annie kneels down next to a moaning Jake, driving\n      the dagger in a little deeper by accident.  He cries\n      out in pain.\n\n                              JAKE\n               Get the axe.  Kill it.  Kill it.\n\n      Jake moans and dies.\n\n\n509B  CLOSE SHOT - ANNIE                                    509B\n\n      As she turns her head to the sound of breaking glass.\n\n\n509C  TRACKING SHOT - ANNIE - REAR HALLWAY - NIGHT          509C\n\n      As she cautiously approaches the main room.\n\n\n509D  ANNIE'S POV - REAR HALLWAY/MAIN ROOM - NIGHT          509D\n\n      As she moves towards the main room.\n\n\n509E  MAIN ROOM - NIGHT - ANNIE                             509E\n\n      Annie enters the room.  She shudders from the\n      cold.  CAMERA PANS with her glance to broken glass\n      upon the floor, and over to reveal the bashed out\n      window and the curtains fluttering in the wind.\n\n\n509F  MEDIUM SHOT - ANNIE                                   509F\n\n      Petrified.  Looking about.  Knowing that the\n      monster Ash may be lurking close.\n\n\n509G  WIDE SHOT - ANNIE                                     509G\n\n      As she moves about the main room, picking up the axe.\n      With her back toward us she doesn't notice Ash's hand\n      appear suddenly in the foreground atop the writing desk.\n      She turns suddenly towards camera.\n\n\n509H  OVER ANNIE'S SHOULDER                                 509H\n\n      Ash's evil hand sits upon the table.  It scampers off.\n      Annie turns and comes face to face with Possessed Ash!\n      He bellows at her and grabs her as she shrieks bloody\n      murder!\n\n\n510   OMIT                                                  510\n\n\n511   OMIT                                                  511\n\n\n512   INT. CABIN MAIN ROOM - NIGHT                          512\n      WIDE SHOT - POSSESSED ASH AND ANNIE - DUMMY\n\n      He picks her up and swings her across the room, into\n      the wall.  She slumps to the floor unconscious.\n\n\n513   MED. SHOT - POSSESSED ASH                             513\n\n      As he lumbers toward her.\n\n\n514   ASH'S POV - STAR FILTER - MIRROR NECKLACE             514\n\n      As he moves closer to her unmoving body.  A glitter of\n      light on the floor, next to her, catches his eye.\n\n\n515   CLOSE SHOT - POSSESSED ASH                            515\n\n      For the first time, calm, as he looks intently down at\n      the floor.  He kneels closer.\n\n\n516   ASH'S POV - (STAR FILTER)                             516\n\n      The NECKLACE of Linda.\n\n\n517   CLOSE SHOT - POSSESSED ASH                            517\n\n      The sight of the necklace strikes the human cord\n      within him.  He is confused, his evil self, battling\n      for control of his spirit and body.  He reaches to\n      pick it up.\n\n\n518   CLOSE SHOT - ASH'S HAND                               518\n\n      As he slowly picks up the delicate silver necklace.\n      He raises it to his face;\n\n                              LINDA (V.O.)\n               I'll never take it off.\n\n      And then it hits him.  The emotion of love lost. It\n      floods the monster that is ASH.  He clutches the\n      necklace tightly to his bestial chest.  And as the\n      Love/waltz theme sweeps up in volume on the sound\n      track, the monster begins to cry.\n\n\n519   WIDE SHOT - POSSESSED ASH AND ANNIE - TULIP CRANE     519\n\n      Ash raises his head and lets out a low, lamenting, and\n      pitiful wail.  A man trapped in the shell of a beast,\n      crying for the one he has lost.\n\n\n520   MEDIUM CLOSE SHOT - POSSESSED ASH - 50% POSSESSED     520\n\n      As he raises his head.  Tears stream down from his eyes,\n      washing away the caked on blood.\n\n\n521   CLOSE SHOT - POSSESSED ASH (REVERSE ACTION)           521\n      BLADDER EFX - 50 - 20% POSSESSED\n\n      His face begins to change.  His skin loses its white\n      pallor.  His blackened, infected cuts disappear.  The\n      swollen and cracked surface of his face begins to heal.\n\n\n522   INT. CABIN MAIN ROOM - NIGHT (STUDIO) - MINIATURE     522\n      EXTREME CLOSE SHOT - POSSESSED ASH - DUMMY HEAD\n      W/FLUID EYE CHAMBER\n\n      Ash's eyes change from white to brown.\n\n\n523   INT. CABIN MAIN ROOM - NIGHT                          523\n\n      As the last tears roll down Ash's face, he is once\n      again human.  Ash looks up suddenly with a start.\n\n\n524   MEDIUM SHOT - ASH - WOODEN AXE HEAD                   524\n      EXPLODING FLOOR\n\n      As he rolls out of the way a moment before the head of\n      the axe buries itself in the wooden floor.  Splinters\n      fly.\n\n\n525   MEDIUM SHOT - ASH - WOODEN AXE HEAD                   525\n      EXPLODING WALL EFX\n\n      Rolls to his feet and stands.  He ducks as Annie\n      enters frame, charging him with axe, screaming.\n\n                              ASH\n               No.  WAIT!\n\n      Annie swings the axe and again Ash ducks.  The head of\n      the axe slams into the plastered wall smashing right\n      through.\n\n\n526   CLOSER - ASH AND ANNIE                                526\n\n      Ash grabs her tightly with his remaining hand.\n\n                              ASH\n               Listen to me!  I'm all right\n               now.  That thing is gone.\n\n      Ash pushes her away.  Annie falls to the floor.  She\n      stands.\n\n\n527   CLOSE SHOT - ASH - WOODEN AXE HEAD                    527\n      EXPLODING WALL EFX\n\n      Catching his wind for a moment.  Then rolls to the\n      side as the axe again comes at him!  SLAM!  The head\n      of the axe slices into the wall only a few inches from\n      his head.\n\n\n528   MED. SHOT - ASH AND ANNIE                             528\n\n      As he grabs Annie by the face and forces her\n      backwards.\n\n                              ASH\n               GOD DAMN IT!  I said I was all\n               right!!\n\n      Annie is nearly choking.\n\n                              ANNIE\n               Okay.\n\n      Ash releases her gently.  She again looks to Ash,\n      cautiously.\n\n                              ANNIE\n               Are you sure?\n\n                              ASH\n               You'll be the first to know.\n               I'm fine.\n\n\n529   CLOSE SHOT - ANNIE AND ASH                            529\n\n                              ANNIE\n               Yeah, but for how long?\n               If we're going to beat this thing,\n               we need those pages.\n\n\n529A  CLOSE SHOT - ASH                                      529A\n\n      As he turns to the trap door.\n\n                              ASH\n               Then let's head down into that cellar...\n\n\n529B  CLOSE SHOT - TRAP DOOR                                529B\n\n      It lies silently against the floor.  A rasping\n      breath can be heard from below.\n\n\n529C  CLOSE SHOT - ASH                                      529C\n\n      He turns from the trap door to Annie.\n\n                         ASH\n               ...And carve ourselves a witch.\n\n\n530   EXT. WORKSHED - NIGHT                                 530\n\n      Ash's hand flips open the latch on the shed door.\n\n\n531   INT. WORKSHED - NIGHT                                 531\n\n      The door is kicked open, revealing the silhouette of\n      Ash and Annie as they stand in the doorway.\n\n\n532   WORKSHED SHELF                                        532\n\n      Rats scurry for safety as the shaft of light from the\n      door hits them.\n\n\n533   HANGING BULB                                          533\n\n      ASH'S hand pulls on the cord, turning on the light.\n\n\n534   WORKSHED TABLE                                        534\n\n      Ash's arm sweeping the chains and pieces of wood onto\n      the floor.\n\n\n535   OMIT                                                  535\n\n\n536   OMIT                                                  536\n\n\n537   OMIT                                                  537\n\n\n538   THE HOSE CLAMP                                        538\n\n      Is tossed down upon the workshed table.\n\n\n539   A SECOND HOSECLAMP                                    539\n\n      Is tossed down next to the first.\n\n\n540   ANNIE'S HANDS                                         540\n\n      Hold down a clamp as ASH'S hand, creates screw sized\n      holes in it with a battery powered drill.\n\n\n541   ANNIE'S HANDS                                         541\n\n      Attach the hoseclamps to a piece of red steel.\n\n\n542   ANNIE'S HANDS                                         542\n\n      Attach the red piece of steel to ASH'S stump, via\n      the clamps.\n\n\n543   ANNIE'S HANDS                                         543\n\n      Attach a \"V\" type hook Around Ash's neck, just above\n      his bicep.\n\n\n544   ASH'S HAND                                            544\n\n      Slams down the chainsaw upon the table.  It is missing\n      its side panel.  ASH'S arm enters frame and we see that\n      it is this missing side panel that has been clamped to\n      his stump.\n\n\n545   CLOSER SHOT                                           545\n\n      The panel slides into the side of the chainsaw with a\n      sharp \"CLICK\".\n\n\n546   ASH                                                   546\n\n      As he bends the chainsaw to his chest.\n\n\n547   CLOSE SHOT                                            547\n\n      The \"T\" shaped end of the starter cord falls neatly\n      into the \"V\" shaped hook that is strapped around Ash's\n      neck.\n\n\n548   CLOSE SHOT - ASH                                      548\n\n      He looks up to Annie, the moment of truth.\n\n\n549   CLOSE SHOT - ANNIE                                    549\n\n      Hair tousled over her sweating face, returns his\n      glance, expectant.\n\n\n550   WIDE SHOT                                             550\n\n      Ash extends his chainsaw arm, pulling on the starter\n      cord.  The CHAINSAW ROARS to life.  With his free arm\n      Ash raises the shotgun.  He lowers the blade of the\n      chainsaw down upon the barrel.  Sparks fly as the saw\n      cuts through it.  The long barrel falls to the floor.\n      Ash is left with a sawed off shotgun in one hand and a\n      chainsaw strapped to his other arm.\n\n      With a fancy style western flip to the gun Ash saddles\n      the shotgun in a makeshift holster, strapped\n      to his back.\n\n      The CAMERA SLOWLY TRACKS into Ash's face.\n\n                              ASH\n               Groovy.\n\n\n551 - OMIT                                                  551\n\n\n551A  EXT. CABIN/WORKSHED - NIGHT - INKY PUPPET             551A\n\n      In the distance, the tiny figures of Ash and Annie\n      as they move from the workshed to the cabin.  In\n      the foreground is a large oak tree.  A gnarled human-\n      like face can be made out on the surface of the tree.\n      It is lit from beneath and slolwly brought up on a\n      dimmer.  A horrible twisted tree face.  It suddenly\n      opens its mouth and breathes in a gust of air with\n      a terrible wheezing sound, as though in great pain\n      at being brought to life.  It turns sharply towards\n      the cabin.\n\n\n552   CLOSE SHOT - DINKY PUPPET                             552\n\n      Second tree face, brought up on a dimmer, opens its\n      mouth and loudly draws in air, also in agony.\n\n\n553   CLOSE SHOT - MOE PUPPET                               553\n\n      A third tree's twisted face, two human eyes opened wide\n      on its surface.  It breathes, then barks a guttural sound.\n\n\n554   MED. SHOT - (STUDIO MINIATURE)                        554\n\n      In the foreground is the base of a large oak tree.  The\n      cabin in the distance.  A rumbling is heard.  Then\n      suddenly the tree pulls one of its massive roots from\n      the earth.  The tree sets its root down a few feet closer\n      to the cabin.\n\n\n555   EXT. WOODS - NIGHT (STUDIO MINIATURE)                 555\n      WIDE SHOT - TREE PUPPETS\n\n      An entire line of trees.  All pull their roots free\n      from the soil and take an awkward and lumbering step\n      towards the cabin.\n\n\n556-564   OMIT                                      556-564\n\n\n565   INT. MAIN ROOM - NIGHT                                565\n      CLOSE SHOT - THE BLADE OF THE CHAINSAW\n\n      Begins cutting through the wood of the trap door.\n\n\n566   MED. SHOT - ANNIE                                     566\n\n      Tensing with her axe, ready for the beast to spring.\n\n\n567   CLOSE SHOT - CHAINSAW BLADE                           567\n\n      As it completes the second cut in the wood of\n      the trap door.\n\n\n568   MEDIUM SHOT - ASH                                     568\n\n      As he finishes the slicing job and kicks open the trap\n      door.\n\n\n569   LOW ANGLE - ANNIE AND ASH - FROM CELLAR LOOKING UP    569\n\n      The broken bits of the trap door fall past the camera,\n      as they cautiously peer down into the cellar.\n\n\n570   INT. CABIN CELLAR - NIGHT (STUDIO)                    570\n      ANNIE'S POV\n\n      Looking down into the cellar.  No sign of Henrietta.\n      The bottom of the steps disappear into blackness.\n\n                              ASH\n               Those pages are down there\n               somewhere.\n\n\n571   INT. CABIN MAIN ROOM - NIGHT                          571\n      MED. SHOT - ASH\n\n      He kicks aside the broken trapdoor and slowly descends\n      into the darkness.\n\n\n572   INT. CABIN CELLAR - NIGHT                             572\n      MED. SHOT\n\n      Ash arrives at the bottom of the steps.\n      He looks about the dark corners of the cellar trying\n      to find some sign of Henrietta or the pages.\n\n\n573   OMIT                                                  573\n\n\n574   OMIT                                                  574\n\n\n575   ASH'S POV                                             575\n\n      Panning the cobwebs and dark stone walls of the cellar.\n      Half hidden in the shadows we see two of the missing\n      pages.\n\n\n575A  CLOSE SHOT - ASH                                      575A\n\n      As he moves through the cellar and grabs the pages.  He\n      spots another page somewhat deeper into the cellar.\n\n\n575B  ASH'S POV                                             575B\n\n      A fourth and fifth page lay upon the earthen floor, at\n      the base of the cellar's rear door.\n\n\n575C  ASH - CLOSE SHOT                                      575C\n\n      Ash moves to pages and gathers them.\n\n      Annie's voice calls down.\n\n                              ANNIE (O.S.)\n               Did you find her?\n\n\n576   CLOSE SHOT - ASH                                      576\n\n                              ASH\n               She's playing hard to get...\n\n      He pumps the throttle on the buzzing saw.\n\n                              ASH\n               ... rid of.\n\n      Behind Ash, unseen by him, a shadow darts by.\n\n\n577   CLOSE SHOT - ASH                                      577\n\n      He hears a sound.\n\n\n577A  ASH'S POV -                                           577A\n\n      It is coming from the door to the cellar's rear room.\n\n\n577B  ANGLE - ASH                                           577B\n\n      He reaches for the door and opens it.  Revealing\n      darkness beyond.  Ash enters.  Again he hears the slight\n      sound, a gentle ticking.\n\n\n578   INT. CELLAR - REAR ROOM - NIGHT - ASH'S POV           578\n\n      The ticking sound is coming from behind a hanging drape.\n\n\n579   MEDIUM SHOT - ASH                                     579\n\n      He approaches the drape, reaches out his hand and pulls\n      it back sharply.  Revealing an old water heater, ticking\n      and steaming.\n\n\n579A  MEDIUM SHOT - ASH                                     579A\n\n      He breathes a sigh of relief as the half eaten skeleton\n      torso of Ed falls atop him!  Ash screams and steps suddenly\n      away.\n\n\n579B  ASH'S POV                                             579B\n\n      Ed's skeletal carcass falls to the earthen floor still\n      wrapped in the bloody sheet.\n\n\n579C  CLOSE SHOT - ASH                                      579C\n\n      Looking on in horror.\n\n                              ASH\n                         (In a whisper)\n               She got hungry.\n\n      Ash turns from the skeleton and quickly gathers up the\n      remaining pages from the Book of the Dead.  Getting\n      scared now, he backs into the cellar's front room.\n\n\n579D  INT. CELLAR - NIGHT - CLOSE SHOT - ASH                579D\n\n      As he moves towards the steps.  He tosses up the\n      bundle of pages.\n\n\n579E  MEDIUM SHOT - ANNIE                                   579E\n\n      Peering down into the cellar, she grabs the pages.\n\n\n579F  MEDIUM SHOT - ANNIE - MAIN ROOM                       579F\n\n      She rushes over to the writing desk and begins\n      translating.\n\n\n580   INT. CELLAR - CLOSE SHOT - ASH                        580\n\n      Getting scared now, decides to exit the cellar.  He\n      climbs the steps.\n\n\n581   CLOSE SHOT - ASH'S FEET                               581\n\n      As they climb. From behind the wooden steps, the\n      horrible head of Henrietta appears.  Her two rotting hands\n      grab at Ash's ankles.\n\n\n582   CLOSE SHOT - ASH                                      582\n\n      He looks down with a scream.\n\n\n583   CLOSE SHOT - HENRIETTA/ASH'S DUMMY FEET               583\n\n                              HENRIETTA\n               Come to me.  Come to sweet\n               Henrietta!\n\n      Her face pulls back behind the cellar steps.  Her\n      hands pull ASH's feet in after her.\n\n\n584   MEDIUM SHOT - ASH - CAMERA RIG                        584\n\n      As Ash falls, he slams his jaw down upon the bottom\n      step.\n\n\n585   CLOSE SHOT - CHAINSAW ARM                             585\n\n      As the spinning blade jams into the step, stalling\n      the engine.\n\n\n586   LONG SHOT - ASH DUMMY - AND HENRIETTA'S HANDS         586\n      (UNDERCRANKED)\n\n      In an instant, his entire body is pulled beneath the\n      steps.\n\n\n587   INT. CABIN - MAIN ROOM - NIGHT                        587\n      MEDIUM SHOT - ANNIE\n\n      As she sits at the writing desk, reciting the first\n      of the passages.\n\n                              ANNIE\n               Nos-feratos-allo-memnon-kanda!\n\n      She puts aside the pages and glances up suddenly at\n      the faint sounds of the struggle from the cellar.\n\n\n588   INT. CABIN CELLAR - NIGHT                             588\n      LONG SHOT - ASH - CELLAR STEPS (UNDERCRANKED)\n\n      Ash's badly mauled body rips through the staircase\n      with a great force.\n\n\n589   MEDIUM SHOT - ASH                                     589\n\n      As he slams into the earth floor of the cellar.  He\n      moans, and looks towards the steps.\n\n\n590   ASH'S POV - THE WOODEN STAIRCASE (REVERSE ACTION)     590\n\n      As a cackling Henrietta appears where the bottom section\n      of staircase used to stand.\n\n\n591   INT. CABIN MAIN ROOM - NIGHT                          591\n      MED. SHOT - ANNIE\n\n      As she races from the writing desk to look down into\n      the cellar.\n\n\n592   OVER ANNIE'S SHOULDER - UNDERCRANKED                  592\n\n      As she kneels down at the trapdoor, about to call down\n      to Ash when the witchlike figure of Henrietta floats\n      quickly up into the main room from the cellar.  A\n      flurry of moths about her.\n\n                              HENRIETTA\n               Free!  Free at last!\n\n\n593   WIDE SHOT - ANNIE                                     593\n\n      As Annie attempts to move from the trap door.  Henrietta\n      is clutching at Annie's hair and laughing with a demonic\n      malice, as she spins about the room in mid air.\n\n\n594   CLOSE SHOT - TRAP DOOR - ANNIE'S FEET                 594\n\n      Ash's bloodied arm slings itself over the edge of the\n      trapdoor.  He pulls himself up into the main room.\n\n\n595   MED. SHOT - OVER ASH'S SHOULDER -                     595\n      HENRIETTA AND ANNIE\n\n      Henrietta turns sharply to Ash with a growl.\n\n\n596   MED. SHOT - ASH                                       596\n\n      He stands and jerks out his chainsaw arm sharply.  The\n      cord is pulled and the engine roars to life!\n\n\n597   MED. SHOT - HENRIETTA                                 597\n\n      As she leaps through the air toward Ash.\n\n\n598   HENRIETTA'S POV - RACING AT HIM - MEDIUM SHOT - ASH   598\n\n      Ash swings his buzzing chainsaw.\n\n\n599   CLOSE SHOT - HENRIETTA'S GNARLED HAND                 599\n\n      As it grabs the body of the chainsaw, halting it in\n      mid swing.\n\n\n600   MEDIUM SHOT - ASH AND HENRIETTA                       600\n\n      As she keeps the buzzing chainsaw at bay with one hand,\n      while her other grabs at Ash's throat, strangling him.\n\n\n600A  CLOSE SHOT - ASH                                      600A\n\n      As he is slammed through the window.\n\n\n600B  ASH AND HENRIETTA                                     600B\n\n      Ash kicks her in the stomach.  Henrietta is furious.\n\n\n600C  CLOSE SHOT - POSSESSED HENRIETTA - MITCHELL CAMERA    600C\n      STOP MOTION ANIMATION/REAR SCREEN\n\n      She grits her teeth, concentrates, and her neck\n      begins to grow.  She begins to change to Pee Wee Head.\n\n\n600CP PLATE FOR PREVIOUS SCENE - MITCHELL CAMERA            600CP\n      INT. CABIN MAIN ROOM - NIGHT\n\n      CAMERA PANS UP on \"B\" wall.\n\n\n601   MEDIUM SHOT - HENRIETTA - MITCHELL CAMERA             601\n      STOP MOTION ANIMATION/REAR SCREEN\n\n      As the pee wee Head transformation continues, Henrietta's\n      neck grows, like a jack in the box.  It extends\n      a solid five feet upward, so that her head is now\n      looking down upon Ash baring its teeth.\n\n\n601P  PLATE FOR PREVIOUS SCENE - ASH - MITCHELL CAMERA      601P\n      INT. CABIN - MAIN ROOM - NIGHT\n\n\n602   CLOSE SHOT - ASH - TULIP CRANE                        602\n      CAMERA CRANING UP ON HIM\n\n      Ash gapes in fear at this monstrosity that looms\n      above him.\n\n\n603A  INT. CABIN - MAIN ROOM - NIGHT                        603A\n      POSSESSED HENRIETTA PUPPET - MEDIUM SHOT\n\n      Her neck undulating like a snake, she bites and\n      snaps.\n\n                              HENRIETTA\n               I'll swallow your soul, swallow\n               your soul!\n\n\n603B  ASH - CLOSE SHOT                                      603B\n\n      He reacts.\n\n\n603C  WORKING DUMMY HENRIETTA HEAD ON \"FLYING HEAD RIG\"     603C\n      AND ASH\n\n      Henrietta swoops at Ash as he keeps her at bay with the\n      buzzing chainsaw.\n\n\n603   INT. CABIN MAIN ROOM - NIGHT - (STUDIO)               603\n      STOP MOTION - REAR SCREEN - LOOKING UPWARD AT HENRIETTA'S\n      HEAD\n\n      She opens her mouth impossibly wide, exposing those\n      nasty rows of jagged shark like teeth.  She dive bombs\n      him.\n\n\n603P  INT. CABIN - MAIN ROOM - NIGHT - BART-O-FLEX          603P\n\n      Plate for previous scene.\n\n\n604   MEDIUM SHOT - HENRIETTA'S HEAD AND ASH                604\n\n      As her head springs down into frame and halts suddenly\n      inches from his face.  In the silence we hear the reason:\n\n      Annie's voice singing the same melody that her mother\n      had sung to her earlier from the cellar.  For a moment\n      Henrietta's face loses its evil malice.  She is confused\n      at this sound.\n\n      Henrietta halts.  She spins her head toward Annie.\n\n\n605   CLOSE SHOT - ANNIE                                    605\n\n      As she finishes the melancholy song.\n\n\n606   MEDIUM SHOT - HENRIETTA                               606\n      MAGIC BLADE AND GUIDE TRACK RIG\n\n      Still confused, suddenly she shrieks and the chainsaw\n      comes buzzing through her from behind.  The spinning\n      blade juts out from Henrietta's midsection.\n\n\n607   MEDIUM SHOT - ASH AND HENRIETTA                       607\n      BODY PARTS ON WIRES\n\n      Body parts (2 arms) fly past the camera on wire.\n      Ash slices and dices.  Henrietta screeches like a wild\n      banshee.\n\n\n608   CLOSE SHOT - HENRIETTA'S HEAD AND ANNIE IN B.G.       608\n\n      As Pee Wee Head spins toward Ash, furious.\n\n                              HENRIETTA\n               Swallow your soul!\n\n\n609   MEDIUM SHOT - ASH                                     609\n\n      Swings his chainsaw arm in a sharp arc.\n\n\n609A  ANGLE - HENRIETTA                                     609A\n\n      Henrietta's head is sliced from her neck with a\n      chainsaw.  Steam pours from her neck.\n\n\n610   CLOSE SHOT - HENRIETTA'S HEAD - OVERCRANKED           610\n\n      As it flies up into frame, sliced from its neck.\n\n\n610A  ASH                                                   610A\n\n      As he completes the arc of the chainsaw.\n\n\n611   CLOSE SHOT - DUMMY HENRIETTA PEE WEE HEAD             611\n      W/ SMALL SECTION OF NECK\n\n      As it hits the floor.\n\n\n612   MEDIUM SHOT - HENRIETTA'S BODY                        612\n\n      It's neck spouts steam, wagging about like a snake.\n      Behind her Annie watches as the body topples to\n      the floor.\n\n\n613   CLOSE SHOT - ASH                                      613\n\n      He looks down.\n\n\n614   CLOSE SHOT - HENRIETTA'S HEAD SCREAMING AT HIM:       614\n\n                              HENRIETTA'S HEAD\n               Swallow your soul!  Swallow your soul!\n\n      Ash's foot steps down upon her head, pinning\n      it to the floor.  Her neck still writhing.\n\n\n615   CLOSE SHOT - ASH                                      615\n\n      He unsaddles his sawed off shotgun from the holster on\n      his back.  He points the barrel at her head point blank.\n\n                              ASH\n               Swallow this.\n\n      He pulls the trigger.  BLAM!  Flame barks from the gun.\n\n\n616   3 CAMERAS - CLOSE SHOT HENRIETTA AND GUN BARREL       616\n      (OVERCRANKED) GELATIN HEAD - SQUIB\n\n      Her head explodes into a million pieces.\n\n\n617   MEDIUM SHOT - ANNIE AND ASH                           617\n\n      Annie is crying.  Ash holsters the gun.\n\n                              ASH\n               May she rest in pieces.\n\n\n618   MEDIUM SHOT - ASH AND ANNIE                           618\n\n      As they look at each other for a quiet moment of\n      relief.  Ash shuts off the chainsaw.  Annie moves\n      slowly to Ash's arms.  He holds her.\n\n\n619   CLOSER - ASH AND ANNIE - MAIN ROOM - KITCHEN IN B.G.  619\n\n      They pull apart and look into each others eyes.  Annie\n      holds the pages.  Maybe they can get away after all.  A\n      LOUD BOOMING echoes throughout the cabin!  As though the\n      outside walls of the place were being bombarded by cannon\n      balls.  The kitchen wall behind them buckles.\n\n\n620   3 CAMERAS - MEDIUM SHOT - ASH AND \"D WALL\"            620\n      SQUIB ON MIRROR\n\n      As the B - board of the wall behind Ash falls away\n      revealing battered logs.  The mirror shatters.\n\n\n621   3 CAMERAS - MEDIUM SHOT - ANNIE AND \"A\" WALL\n\n      The wall cracks beneath the terrific force of whatever\n      is outside hammering upon it.\n\n\tBOOM!\n\tBOOM!\n\tBOOM!\n\n\n622   3 CAMERAS - MEDIUM SHOT - ASH AND ANNIE - THE SOFA    622\n      \"B\" WALL\n\n      CAMERA TRACKS in on them as they look about in fear.\n      Dust is falling about them.  The cabin walls are\n      starting to break apart.  There is a tremendous \"Voyage\n      to the Bottom of the Sea\" type jolt to the cabin.  Ash\n      and Annie stagger for footing.\n\n\n623   MEDIUM SHOT - ASH - BOARDED WINDOW                    623\n\n      Ash grabs ahold of the window frame to brace himself.\n\n\n623A  CLOSE SHOT - VINES - INT. MAIN ROOM - NIGHT           623A\n      REVERSE ACTION - VINES\n\n      Vines wrap about the planks which cover the window.\n\n\n623B  MEDIUM SHOT - ASH - BOARDED WINDOW                    623B\n\n      Behind him, the planks in the window are ripped\n      away by finger-like vines.  A terrifying tree face\n      on the surface of a giant oak is revealed, as it peeks\n      in through the window at them.\n\n\n624   CLOSE SHOT - ANNIE                                    624\n\n      She screams.\n\n      She turns toward \"D Wall\" at a loud wrenching sound.\n\n\n625   MEDIUM SHOT - \"D\" WALL WINDOW                         625\n\n      As vines reach in the cabin, tearing away the planks\n      revealing an even more horrible tree face.\n\n\n626   EXT. CABIN - NIGHT (STUDIO MINIATURE)                 626\n      TREE PUPPET\n\n      A tree beats its branches furiously upon the EXT. wall\n      of the cabin.  It rips apart the cabin's stone chimney.\n\n\n627   ANGLE - (STUDIO MINIATURE)                            627\n      TREE PUPPET\n\n      A second gnarled tree slams its trunk against the rear\n      door of the cabin.\n\n\n628   LONG SHOT - (STUDIO MINIATURE)                        628\n      TREE PUPPET\n\n      The entire cabin is surrounded by a group of lumbering\n      oaks.  All working to get in at Ash and Annie.\n\n\n629   INT. CABIN MAIN ROOM - NIGHT                          629\n      CLOSE SHOT - ANNIE\n\n      Annie runs to the writing desk.  She flips through the\n      missing pages from the Book of the Dead.  Dust from the\n      ceiling drifts down.\n\n                              ANNIE\n                         (shouting above\n                          the noise)\n               No!  I only completed the first of the\n               passages.  And that was to make\n               the evil a thing of the flesh!\n\n\n630   EXT. WOODS/CABIN - NIGHT (STUDIO MINIATURE)           630\n      POV EVIL FORCE\n\n      As it roars out of the woods, and towards the distant\n      cabin faster than we've ever seen it.\n\n\n631   INT. CABIN MAIN ROOM - NIGHT                          631\n      MEDIUM SHOT - ASH\n\n      As he runs over to Annie.\n\n                              ASH\n               You didn't finish it?!\n\n                              ANNIE\n               There's still the second passage.\n               The one to open the rift and\n               send the evil back.\n\n                              ASH\n               Start reciting it.  Now!\n\n\n632   EXT. CABIN - NIGHT - (STUDIO MINIATURE)               632\n      POV EVIL FORCE\n\n      As it rockets towards the cabin doing 80 mph.\n\n\n633   INT. CABIN MAIN ROOM - NIGHT                          633\n      CLOSE SHOT - ANNIE\n\n      Shouting to be heard as she continues reading from the\n      passage:\n\n                              ANNIE\n               Tar-tra Kanda-Estra!  Hudsucker Proxy\n               -- Kanda!\n\n\n634   OMIT                                                  634\n\n\n634A  EXT. CABIN - WOODS - NIGHT                            634A\n\n      The forest at night.  Bubbling smoke appears, then\n      flame.  Through the smoke, the beginnings of a winding\n      spiral of a cloudlike material.\n\n\n634AP1 PLATE FOR PREVIOUS SCENE                            634AP1\n       SMOKE AND FLAME - MINIATURE (STUDIO)\n\n\n634AP2 PLATE FOR PREVIOUS SCENE                            634AP2\n\n      The rift.\n\n\n635   INT. CABIN MAIN ROOM - NIGHT                          635\n      MEDIUM SHOT - ANNIE\n\n                              ANNIE\n               Aton-Neran-Ofas!\n\n\n636   EXT. WOODS - NIGHT (STUDIO MINIATURE)                 636\n      POV EVIL FORCE\n\n      As it races right up to the front door of the cabin.\n\n\n637   INT. CABIN MAIN ROOM - NIGHT                          637\n      MED. SHOT - ANNIE - WIND FAN\n\n      Reading from the passage.  Behind her, the front door\n      rips open and in comes a giant rotten apple head of the\n      evil entity made flesh.  A SHRIEKING, BULBOUS BEHEMOTH!\n\n\n638   INT. CABIN MAIN ROOM - NIGHT - (STUDIO)               638\n      STOP MOTION ANIMATION\n      CLOSE SHOT - ASH - WIND FAN\n\n      Ash as he witnesses the most horrible sights a man can\n      behold.  Ash's black hair streaks white before our\n      eyes.  Behind him, two flowers in their pots wither\n      and die in seconds.\n\n                              ASH\n               Finish it!\n\n\n638P  INT. CABIN - MAIN ROOM - NIGHT                        638P\n\n      Plate for previous scene, with dying flowers.\n\n\n639   INT. CABIN MAIN ROOM - NIGHT                          639\n      CLOSE SHOT - ANNIE - WIND FAN\n\n                              ANNIE\n               Kanda!  Samonda Roba Areda\n               Gyes Indy En-zeen, Nos-Feratos -\n\n\n639A  CLOSE SHOT                                            639A\n\n      Annie as she gasps.\n\n\n639B  MED. SHOT - ANIMATED HAND - (3 SEC.)                  639B\n\n      Annie as she falls to the floor, dead.\n      Jutting from her back is the Kandarian dagger and\n      hanging onto the end of the dagger is Ash's demon\n      hand.\n\n\n639 C,D,E, OMIT                                        639 C,D,E\n\n\n640   MEDIUM SHOT - ASH AND WINDOW ON \"B\" WALL              640\n\n                              ASH\n               No!\n\n      CRASH!\n\n      Behind Ash a living tree branch rips through the cabin\n      window!\n\n\n641   MED. SHOT - ASH - WIND FAN - WRAPPING EFX BRANCH      641\n\n      Ash turns suddenly to get away.  Too late.  The living\n      branch wraps about ASH'S waist and lifts him,\n      screaming, OUT OF FRAME.\n\n\n642   MED. SHOT - ASH IN GRIP OF TREE BRANCH - WIND FAN     642\n\n      Ash is being lifted toward the gaping mouth of rotten\n      apple head.  Ash is frantically jerking out his arm in\n      an attempt to start the chainsaw strapped to his wrist.\n      PUTT, PUTT, PUTT.\n\n      It won't start.  As the face of rotten apple head\n      looms close, it opens its terrible mouth, ready to\n      consume him.\n\n\n643   CLOSE SHOT - ASH IN GRIP OF GIANT TREE BRANCH         643\n\n      From inside the creature's mouth looking out.  Ash\n      is screaming as he is brought towards its gnashing\n      teeth.  PUTT, PUTT, PUTT.  His chainsaw still won't\n      start.\n\n\n643A  CLOSE SHOT - ANNIE                                    643A\n\n      Half dead as she crawls to the pages on the floor and\n      gasps out the final sentences.\n\n                              ANNIE\n               Nos-feratos - Amen-non.  Ak-adeem!\n               Razin - Arozonia!\n\n\n643B  EXT. CABIN - NIGHT                                    643B\n      WIDE SHOT - REVERSE ACTION\n\n      The rift grows more powerful.\n\n\n643BP PLATE FOR PREVIOUS SCENE                              643BP\n\n      The rift.\n\n\n644   INT. CABIN - MAIN ROOM - CLOSE SHOT - ASH             644\n\n      Sweating and terrified. He draws closer.\n\n\n645   ASH'S POV                                             645\n\n      The CAMERA tracks in toward the mouth of rotten apple\n      head.  It's massive jaw jutts from the head, biting\n      and snapping.  Sap-like saliva drips from the orifice.\n      Ash's feet kick at the mouth of rotten apple head,\n      trying to keep it away.  Its jaws snap at his shoes.\n\n\n645A  C.U. - ASH'S FEET - PUSHING AT THE GUMS OF            645A\n      RAH'S MOUTH.\n\n      SNAP! The massive teeth snap together biting Ash's\n      foot in half.\n\n\n645B  C.U. ASH                                              645B\n\n      He screams, then looks down to his foot.\n\n\n645C  C.U. ASH'S FOOT - (OVERLARGE SHOE)                    645C\n\n      Missing the leather toe section, he reveals that\n      he still has his toes intact.\n\n\n646   CLOSE SHOT - ASH                                      646\n\n      As he sharply jerks his arm outward!  The CHAINSAW\n      ROARS to life!  He raises it high above his head and\n      plunges it forward.\n\n\n647   WIDE SHOT - ASH AND ROTTEN APPLE HEAD                 647\n\n      Ash thrusts the spinning chainsaw blade into the single\n      eye of the beast.\n\n\n648   INT. CABIN MAIN ROOM - NIGHT (STUDIO)                 648\n      CLOSE SHOT - CHAINSAW\n\n      As it punctures the giant eyeball and then pulls free.\n      Green sauce spouts from the creature's wound.\n\n\n649   INT. CABIN MAIN ROOM - NIGHT                          649\n      CLOSE SHOT - ASH\n\n      As he is doused in the green bile.  SPLAT!\n\n\n650   CLOSE SHOT - ROTTEN APPLE HEAD                        650\n\n      Eyeless, it screams in anger.\n\n\n650A  CLOSE SHOT - ANNIE                                    650A\n\n      With her last gasp.\n\n                              ANNIE\n               ....Kanda!\n\n\n651   EXT. CABIN - NIGHT (STUDIO MINIATURE)                 651\n      WIDE SHOT - (REVERSE ACTION)\n\n      As the rift pulls in fog and trees that surround the\n      house.\n\n\n651P1 PLATE FOR PREVIOUS SCENE                            651P1\n      SMOKE AND FLAME - MINIATURE (STUDIO)\n\n\n651P2 PLATE FOR PREVIOUS SCENE                            651P2\n\n      The Rift.\n\n\n652   INT. CABIN MAIN ROOM - NIGHT                          652\n      WIDE SHOT\n\n      As rotten apple head is sucked out the doorway of the\n      cabin.  The door slams shut behind it.  Its scream\n      echoes off into the distance.\n\n\n653   OMIT                                                  653\n\n\n654   INT. CABIN MAIN ROOM - NIGHT                          654\n      MED. SHOT - ASH\n\n      Slices through the bracch.\n\n\n654A  MEDIUM SHOT - ASH                                     654A\n\n      Ash and cut branch fall to the floor.\n\n\n655   MED. SHOT                                             655\n\n      The cabin becomes much more quiet.  The sounds of the\n      trees are gone.  Ash looks to Annie.  She is dead.  Ash\n      moves to her, strokes her hair and begins to cry.\n\n                              ASH\n                You did it.  By God you did it.\n\n      He lowers his head and begins to heave in sharp\n      convulsive breaths of despair.\n\n\n656 - 661 OMIT                                         656 - 661\n\n\n662   INT. STUDIO - (BLUE SCREEN)                           662\n      MEDIUM SHOT - ASH - WIND FAN\n\n      Behind Ash the front door RIPS open with a TREMENDOUS\n      BLAST.  The door is sucked down into the rift.  All\n      of the objects in the room are sucked through the open\n      doorway and down into the rift, including the pages\n      of the Book of the Dead.\n\n\n662P1 PLATE FOR PREVIOUS SCENE - THE RIFT                   662P1\n\n\n662P2 SECOND PLATE FOR PREVIOUS SCENE                       662P2\n      INT. CABIN MAIN ROOM - (STUDIO MINIATURE)\n\n\n662P3 EXT. PLATE/WOODS                                      662P3\n\n\n663   INT. CABIN MAIN ROOM - NIGHT                          663\n      WIND FAN\n\n      Ash grabs ahold of the kitchen window ledge so as not\n      to be swept outside by the force of the vacuum of the\n      rift.  Objects and papers fly past him.\n\n\n664   CLOSE SHOT - ASH'S HAND                               664\n\n      Upon the kitchen window ledge.  The ledge tears free.\n\n\n665   CLOSE SHOT - ASH                                      665\n\n      As he screams, flying backward, towards the open door.\n\n\n666   INT. CABIN MAIN ROOM - NIGHT (STUDIO/PARTIAL SET/     666\n      BLUE SCREEN)\n      MEDIUM SHOT - WIND FAN - SAM-O-CAM\n\n      The open doorway to the cabin.  Ash flies towards it\n      and is snagged from going through by the section of\n      ledge that he holds.\n\n\n666P  PLATE FOR PREVIOUS SCENE - THE RIFT                   666P\n\n\n666P1 EXT. WOODS - PLATE FOR PREVIOUS SCENE                 666P1\n\n\n667   EXT. CABIN FRONT PORCH - NIGHT (STUDIO)               667\n      MEDIUM SHOT - ASH - WIRE RIGGING FOR FLYING\n\n      His body is horizontal, his feet dangling in air, in the\n      direction of the rift.\n\n\n668   CLOSER -                                              668\n\n      Ash as he hangs on for dear life.\n      Objects continue to fly past on wires.\n\n                              ASH\n               For God's sake, how do you\n               stop it?\n\n\n669   INT. CABIN MAIN ROOM - NIGHT (STUDIO)                 669\n      BLUE SCREEN\n      CLOSE SHOT - FLYING RIG\n\n      The nails in the section of ledge that Ash holds\n      TEAR loose and the ledge SNAPS in two.  He spins\n      wildly away from us and towards the rift.\n\n\n669P  PLATE FOR PREVIOUS SCENE - THE RIFT                   669P\n\n\n669P1 EXT. WOODS - PLATE                                    669P1\n\n\n670   EXT. WOODS - NIGHT (STUNT) WIRE RIGGING               670\n\n      Ash is rocketed through the air, spinning somersaults.\n\n\n671   INT. STUDIO - (BLUE SCREEN)                           671\n      ASH ON FLYING RIG\n\n      Ash is sucked down into the swirling rift.  Like a\n      particle that is swallowed by a deep funnel of draining\n      water.  The rift closed behind him.\n\n\n671P1 PLATE FOR PREVIOUS SCENE - THE RIFT                   671P1\n\n\n671P2 EXT. WOODS - NIGHT                                    671P2\n\n      Plate for previous scene.\n\n\n672   INT. STUDIO - (BLUE SCREEN)                           672\n      ASH ON FLYING RIG\n\n      We are now within the vortex.  A swirling mass of colors\n      and clouds.  And nightmarish sound effects.\n\n      Objects come AT US from the distance and roar past, an\n      uprooted tree, the grandfather clock with its hands\n      winding backwards at an incredible rate, Ash spinning\n      AT US, hand over foot, screaming.  The chainsaw still\n      mounted to his wrist.\n\n\n672P  PLATE FOR PREVIOUS SCENE - THE VORTEX                 672P\n\n\n673   INT. STUDIO - (STOP MOTION/BLUE SCREEN)               673\n      ASH\n\n      The vortex is distorting Ash's features as he is\n      rocketed back through the dark void of time.\n\n\n673P1 OMIT                                                 673P1\n\n\n673P2 PLATE FOR PREVIOUS SCENE  (STOCK FOOTAGE)            673P2\n\n      A wild and rapid pictorial collage of human history\n      winding back from the present through the centuries\n      lasting seven seconds.\n\n\n674   INT. STUDIO - (BLUE SCREEN)                           674\n      WIDE SHOT\n\n      A hole opens in the air with a sharp CRACKLING SOUND.\n      Ash is spat from this hole and falls downward through\n      frame.\n\n\n674P  PLATE FOR PREVIOUS SCENE - MITCHELL CAMERA            674P\n      EXT. SKY - DAY\n\n\n674P2 PLATE FOR PREVIOUS SCENE - MINIATURE                 674P2\n      SMOKE AND FLAME\n\n\n675   EXT. CASTLE OF KAN DAR - DAY                          675\n      MED. SHOT - GROUND - ASH - CAR CRANE - DELTA SHELLS\n\n      Plunged to the dust.  Debris from the demolished cabin\n      rains down around him; his shotgun, the 1973 Delta 88\n      Oldsmobile and the old grandfather clock.\n\n\n676   ASH'S POV. - THE RIFT IN THE SKY - MITCHELL           676\n\n      As it seals shut, leaving only the blue sky and the\n      sound of tweeting birds.  Ash's view of the serene sky\n      changes abruptly as five steel helmets jut into his\n      line of sight.  Five armor-clad medieval WARRIORS\n      stand directly over him.\n\n\n676P1 PLATE FOR PREVIOUS SCENE - THE RIFT                  676P1\n\n\n676P2 PLATE FOR PREVIOUS SCENE - MINIATURE                 676P2\n      SMOKE AND FLAME\n\n\n677   OMIT                                                  677\n\n\n678   CLOSE SHOT - ASH AND WARRIORS                         678\n\n      As he looks to the warriors above him.\n\n      The first warrior raises a bloodstained longsword\n      and poises it above Ash's head.\n\n                              WARRIOR #1\n               Slay the beast!\n\n                              WARRIOR #2\n               'Tis a deadite!\n\n      All raise their swords ready for the kill.\n\n\n679   MED. SHOT - THE WARRIORS                              679\n\n      Halt as they hear a piercing, high-pitched SCREECH.\n      They turn their heads skyward.\n\n\n680   CLOSE SHOT - ASH                                      680\n\n      Follows the Warriors' gaze.\n\n\n681   EXT. CASTLE OF KAN DAR - DAY                          681\n      (STOP MOTION/REAR SCREEN)\n      MED. SHOT\n\n      A \"WINGED DEADITE,\" a female harpy like creature with\n      the tail of a sea horse and man-sized bat wings,\n      enabling it to fly.  The screaming beast swoops down\n      towards the warriors and horses. High above, the distant\n      shapes of other Winged Deadites circle.\n\n\n681P  PLATE FOR PREVIOUS SCENE - EXT. CASTLE OF KAN DAR     681P\n      WARRIORS AND HORSES FOR SWOOP SHOT\n\n\n682   EXT. CASTLE OF KAN DAR - DAY                          682\n      (STOP MOTION ANIMATION/REAR SCREEN)\n      CLOSE SHOT - WINGED DEADITE\n\n      She lets out a screaming banshee laugh, while\n      swooping down.\n\n\n682P  PLATE FOR PREVIOUS SCENE                              682P\n      EXT. KANDAR CASTLE - DAY\n\n\n683   WINGED DEADITE'S POV                                  683\n      (UNDERCRANKED) - CRANE - WIND FAN\n\n      As we swoop down toward the warriors and Ash.\n\n\n683A  OMIT                                                  683A\n\n\n683AP OMIT                                                 683AP\n\n\n684   OMIT                                                  684\n\n\n684P  OMIT                                                  684P\n\n\n685   EXT. CASTLE OF KAN DAR - DAY                          685\n      MED. SHOT - ASH AND WARRIORS\n\n      As he springs to his feet.  With a lightning thrust he\n      reaches behind him.\n\n\n686   CLOSE SHOT - ASH'S HAND                               686\n\n      As he grabs at the gun from its holster.  He swings it\n      around front and pulls the trigger.\n\n\n687   CLOSE SHOT - GUN BARREL - UNDERCRANKED                687\n\n      It discharges flame.\n\n\n688   CLOSE SHOT - DUMMY HEAD OF DEADITE BLOOD SQUIB        688\n      OVERCRANKED - STOP MOTION ANIMATION/REAR SCREEN\n\n      It explodes.\n\n\n688P  PLATE FOR PREVIOUS SCENE - MITCHELL                   688P\n      EXT. KANDAR SKY\n\n\n689   EXT. CASTLE OF KAN DAR - DAY                          689\n      (MINIATURE/STOP MOTION/REAR SCREEN)\n      WIDE SHOT - WINGED DEADITE\n\n      The beast continues to flap its wings and fly about a\n      moment before falling to a heap in the dust.\n\n\n689P  PLATE FOR PREVIOUS SCENE - EXT. CASTLE OF KAN DAR     689P\n      WARRIORS\n\n\n690   EXT. CASTLE OF KAN DAR                                690\n      CLOSE SHOT - WARRIOR #1\n\n      As he looks to Ash.\n\n\n691   MED. SHOT - WARRIORS                                  691\n\n      They follow his gaze.  The CAMERA PANS TO Ash.  He stands\n      alone on a small pile of rubble clutching his smoldering\n      shotgun.  He looks about dazedly.  He tries to get his\n      bearings.\n\n\n692   WIDE SHOT - WARRIORS                                  692\n\n      They falter.  Unsure of how to react to this strange\n      man, who a moment before was pronounced a Deadite.\n      From the crowd, the Warrior #1 calls out:\n\n                              WARRIOR #1\n               Hail he, who has come from the sky,\n               to deliver us from the terrors of\n               the deadites!\n\n                              WARRIOR #4\n               Hail!\n\n                              WARRIOR #5\n               Hail!\n\n      The cry is taken up by all. A line of medieval warriors\n      bow.  Then twenty.  Then fifty.  All remove their\n      helmets and kneel silently in the dust.\n\n      Somewhere in the distance a DRUM SOUNDS.  Ash stands\n      frozen.  Terrified, unsure of where or when he is.\n      Knowing only for the present, he is alive.\n\n      As the wind kicks up blowing dust, Ash strikes a\n      familiar pose.  It is the same image of the \"Hero\n      from the Sky\" that we saw earlier in the film.  The\n      strange \"jagged edged longsword\" is Ash's chainsaw.\n\n      The CAMERA PULLS BACK from him as a great medieval castle\n      rears up INTO FRAME.  It is seen to be the castle of\n      Kandar.  The same castle we saw in the beginning of the\n      film.  Now, however, the castle is not a ruin, but brand\n      new.  As the CAMERA continues to pull back from Ash, the\n      title \"EVIL DEAD\" appears on the screen acompanied by\n      the distant ROAR of some dying animal:  The SCREEN cuts\n      to BLACK WITH A THUNDEROUS BOOM.\n\n                             THE END\n\n\n   \n\n\n\n\n\n\nEvil Dead II: Dead by Dawn\nWriters :   Sam Raimi  Scott Spiegel\nGenres :   Horror  Fantasy  Comedy  Action\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:24:52.887805"}