{"title": "Ferris Bueller's Day Off", "film_link": "/Movie Scripts/Ferris Bueller's Day Off Script.html", "script_link": "/scripts/Ferris-Bueller's-Day-Off.html", "info_raw": "\n\nFerris Bueller's Day Off Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.88 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Hughes\nGenres  Comedy\nScript Date : July 1985\n\nRead \"Ferris Bueller's Day Off\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\"FERRIS BUELLER'S DAY OFF\" by John Hughes\n\n\n\n\n\n\n                         \"FERRIS BUELLER'S DAY OFF\"\n\n                                     by\n\n                                John Hughes\n\n\t\t\t\t\t\tSHOOTING SCRIPT\n\t\t\t\t\t\tJuly 24, 1985\n\n\n                         \"FERRIS BUELLER'S DAY OFF\"\n\n  1  BLACK SCREEN                                                  1\n\n     MAIN TITLES\n\n     IT'S SILENT. A BEAT...AND AN EXPLOSION OF SOUND.  A HOUSEHOLD\n     IN THE MORNING. KIDS GETTING READY FOR SCHOOL. CLOCK RADIOS.\n     KITCHEN APPLIANCES. SHOWERS. FIGHTING. PEOPLE YELLING. DOG\n     BARKING. APPLIANCES BUZZING. CAR HORNS. IT SOUNDS JUST LIKE\n     YOUR HOUSE DID. STREAMS OF ROCK'N ROLL FADE IN AND OUT. HUEY\n     LEWIS TO LIONEL RITCHIE TO HUSKER DU. SURROUND MAKES IT FEEL\n     LIKE YOU'RE IN THE ROOM. AN AURAL TOUR OF A HOUSE ON A\n     SCHOOL MORNING. BEGINING IN THE KITCHEN AND MOVING UPSTAIRS.\n\n                              FATHER'S VOICE (TOM)\n               Where's my wallet?!\n\n                              SEVEN YEAR OLD BOY (TODD)\n               YOU IDIOT!!\n\n                              TWELVE YEAR OLD GIRL (KIMBERLY)\n               MOM!\n\n                              TODD\n               SHUT-UP!\n\n                              EIGHTEEN YEAR OLD GIRL (JEANIE)\n               I NEED A TOWEL!!\n\n                              TOM\n               JOYCE!\n\n                              KIMBERLY\n                          (whispers, sadistic)\n               When you turn ten, your head's going\n               to swell up real big like a watermelon\n               and we're going to have to put you\n               to sleep like they do with a dog.\n\n                              TODD\n               MOM!\n\n                              TOM\n               JOYCE!!\n\n                              JEANIE\n               WHO PISSED ON THE TOILET SEAT!? MOTHER!!\n\n                              TOM\n               Where's Mom?\n\n                              TODD\n               Is my head going to swell up?\n\n                              TOM\n               What?!\n\n                              JEANIE\n               OH, MY GOD! THE TOILET PAPER'S ALL WET!!!\n\n                              MOTHER (JOYCE)\n                          (screams)\n               TOM!\n\n     The house falls dead SILENT. We hear footsteps thundering\n     through the house. A TENSE STRAIN OF MUSIC FADES UP.\n\n                              TODD\n               What's that?\n\n                              KIMBERLY\n               Wait! Hold still!\n\n                              TODD\n               What?!\n\n                              KIMBERLY\n               You heads starting to swell up!!\n\n     Todd screams. We hear the sound of Tom's footsteps running\n     through the kitchen, down the hall, up the stairs, up the\n     hallway. A door open.\n\n                              TOM\n                          (breathless)\n               What's the matter?\n\n                              JOYCE\n                          (worried)\n               It's Ferris!\n\n                              TOM\n               What's wrong?\n\n                              JOYCE\n                          (snaps)\n               What's wrong? For Christ's sake!\n               Look at him!\n\n  2  CLOSE-UP. FERRIS                                              2\n\n     An eighteen year-old boy. He's staring lifelessly at CAMERA.\n     His mouth's open. His eyes are bugged-out. His tongue is fat\n     and dry in his mouth. He's laying in bed, on his side.\n\n  3  INT. BOY'S BEDROOM                                            3\n\n     Ferris' parents, TOM and JOYCE BUELLER are standing at\n     bedside. They're in their late forties, early fifties.\n     Handsome, upper-middle class parents. They're both dressed\n     for work.\n\n                              TOM\n               Ferris?\n\n                              JOYCE\n               He doesn't have a fever. But he says\n               his stomach hurts and he's seeing spots.\n\n  4  CLOSE-UP. FERRIS                                              4\n\n     His lifeless eyes blink.\n\n  5  INT. BEDROOM. PARENTS                                         5\n\n     Tom bends down and touches Ferris' forehead.\n\n                              TOM\n               What's the matter, Ferris?\n\n                              JOYCE\n               Feel his hands. They're cold and clammy.\n\n     Tom takes one of Ferris' hands.\n\n                              TOM\n                          (discreetly)\n               Should you call the doctor?\n\n                              JOYCE\n                          (whispers)\n               He doesn't want me to.\n\n                              TOM\n               Why don't you want Mom to call\n               the doctor?\n\n     Ferris exhales loudly. He tries to speak but all he can\n     manage is a choked gasp.\n\n                              TOM\n               What?\n\n     Ferris tries again.\n\n                              FERRIS\n                          (raspy)\n               Don't make a fuss. I'm fine. I'll get up.\n\n     He starts to get up. Joyce gently pushes him back down.\n\n                              FERRIS\n               I have a test today. I have to take it.\n               I want to get into a good college\n               so I can have a fruitful life...\n\n                              JOYCE\n               You're not going to school like\n               this.\n                          (to Tom)\n               Maybe I should call the office and\n               tell them I won't be in.\n\n                              FERRIS\n               I'm okay, Mom. I feel perfectly...Oh, God!\n\n     He's gripped by a seizure. His body stiffens and he chokes.\n     His older sister, JEANIE, walks into the room. She's dressed\n     for school. She's cute and stuck-up. A major pill.\n\n                              JEAN\n               Oh, fine. What's this? What's his problem?\n\n                              JOYCE\n               He doesn't feel well.\n\n                              JEAN\n               Yeah, right. Dry that one out\n               and you can fertilize the lawn.\n\n                              TOM\n               That's enough, Jeanie.\n\n                              JEANIE\n               You're not falling for this, are you?\n               Tell me you're not falling for this.\n\n                              FERRIS\n               Is that Jeanie? I can't see that\n               far. Jeanie?\n\n                              JEANIE\n               Pucker up and squat, Ferris.\n\n                              JOYCE\n                          (annoyed)\n               Thank you, Jeanie. Get to school.\n\n                              JEANIE\n                          (angry, defeated)\n               You're really letting him stay home?\n               I can't believe this. If I was bleeding\n               out my eyes, you guys'd make me go to\n               school. It's so unfair.\n\n                              FERRIS\n               Please don't be upset with me, Jeanie.\n               Be thankful that you're fit and have\n               your health. Cherish it.\n\n                              JEANIE\n                          (to herself)\n               Oh, I wanna puke.\n\n     She glares at Ferris. Her eyes are mascara and vengence. She\n     slips out of the room. Ferris' brother, TODD and sister,\n     KIMBERLY peek into the room.\n\n                              KIMBERLY\n               Myocardial infarction?\n\n                              JOYCE\n               Get your stuff. Daddy'll be right\n               down.\n\n                              KIMBERLY\n               Syphilitic meningitus? That would be\n               a huge family embarrassment.\n\n                              TOM\n               Get downstairs!\n\n                              KIMBERLY\n               If he dies, I got dibs on his stereo.\n\n     She turns sharply and exits.\n\n                              TODD\n                          (worried)\n               Dad? Does my head look alright?\n\n                              JOYCE\n               Get downstairs! Now!\n\n                              TODD\n               Just answer me one question! Is it\n               swelling up? Kim said it was going\n               to get as big as...\n\n                              KIMBERLY (OC)\n               A WATERMELON!\n\n                              TODD\n                          (yells out the room)\n               Shut-up!\n\n                              JOYCE\n               Get downstairs! NOW!\n\n     Todd backs out of the room.\n\n                              FERRIS\n               I'll be okay. I'll just sleep.\n               Maybe I'll have an aspirin around\n               noon.\n\n                              JOYCE\n                          (to Ferris)\n               I'm showing houses to the family\n               from California today but I'll be in\n               the area. My office'll know where\n               I am, if you need me.\n\n                              TOM\n               I'll check it with you, too.\n\n                              FERRIS\n               It's nice to know I have such\n               loving, caring parents. You're\n               both very special people.\n\n  6  CU. FERRIS                                                    6\n\n     He acknowledges Tom with a pathetic flutter of his eyelids.\n\n  7  INT. BEDROOM. JOYCE                                           7\n\n     She strokes Ferris' hair.\n\n                              JOYCE\n               I hope you feel better, pumpkin.\n\n     She leans down and kisses his forehead. Tom pats his\n     shoulder.\n\n                              TOM\n               Get some rest.\n\n  8  CU. FERRIS                                                    8\n\n     Ferris lets out a wheeze. His glassy eyes follow his parents\n     to the door.\n\n                              JOYCE (OC)\n               We love you, sweetie.\n\n                              TOM (OC)\n               Call if you need us.\n\n     They close the door. The lock clicks. Ferris' eyes shift\n     from the door to CAMERA. A sly, little smile crawls across\n     his lips.\n\n                              FERRIS\n               They bought it.\n\n     The MTV theme music ROARS IN.\n\n  9  CU. TV SCREEN                                                 9\n\n     The TV at the foot of Ferris' bed. The MTV logo is playing.\n\n 10  INT. BEDROOM                                                 10\n\n     Ferris yanks open the drapes. The pall of the sickroom\n     disappears in the brilliant glow of morning sunlight.\n\n                              FERRIS\n               Incredible! One of the worst performances\n               of my career and they never doubted it\n               for a second.\n                          (looks out the window)\n               What a beautiful day!\n\n     He turns from the window.\n\n                              FERRIS\n               Parents always fall for the clammy hands.\n               It's physical evidence of illness. It's\n               a good, non-specific symptom. Parents are\n               generally pretty hip to the fever scams.\n               And to make them work you have to go a hundred\n               and one, hundred and two. You get a nervous\n               mother and you end up in a doctor's office\n               and that's worse than school.\n\n     He flips on his stereo and fills the room with the MTV\n     broadcast. A NEW SONG begins.\n\n                              FERRIS\n               Fake a stomach cramp and when you're\n               doubled over, moaning and wailing, just\n               lick your palms. It's a little stupid\n               and childish but then so if high school.\n               Right?\n\n     He equalizes the sound a little.\n\n                              FERRIS\n               This is my ninth sick day with semester.\n               If I go for ten, I'm probably going to\n               have to barf up a lung. So, I absolutely\n               must make this one count.\n\n     He exits into the hallway.\n\n 11  INT. BATHROOM                                                11\n\n     Ferris walks into the bathroom. It's littered with Jean's\n     debris. He turns on the shower water.\n\n                              FERRIS\n               I don't care if you're fifty five\n               or seven, everybody needs a day off\n               now and then. It's a beautiful day.\n               How can I be expected to handle\n               high school?\n\n     He bends down OUT OF FRAME as he loses his briefs. He pops\n     up.\n\n                              FERRIS\n               I do actually have a test. That wasn't\n               bullshit.\n\n     He steps into the shower. Through the pebbled glass of the\n     shower door we see Ferris' outline.\n\n                              FERRIS\n               That I care about it was.\n\n 12  INT. BATHROOM. SHOWER STALL.                                 12\n\n     Inside the shower. Ferris' hair is standing straight up.\n     It's moulded into a fin with shampoo.\n\n                              FERRIS\n               It's on European socialism. I mean,\n               really. What's the point? I'm not\n               European. I don't plan to be European.\n               So, who gives a shit if they're socialists?\n               They could be fascist anarchists and it\n               still wouldn't change the fact that I\n               don't own a car.\n\n     He turns the shower head around and uses it like a\n     microphone.\n\n                              FERRIS\n                          (sings)\n               WELL SHAKE IT UP, BABY,\n               TWIST AND SHOUT...\n\n 13  INT. HALLWAY. LATER                                          13\n\n     Ferris comes out of the bathroom with a towel wrapped around\n     his waist. He's drying his hair with another of a different\n     color.\n\n                              FERRIS\n               Not that I condone fascism. Or\n               and \"isms\". \"Isms\", in my opinion\n               are not good. A person should not\n               believe in an \"ism\". He should\n               believe in himself. John Lennon\n               said it on his first solo album.\n               \"I don't believe in Beatles, I\n               just believe in me.\" A good point\n               there. Afterall, he was the Walrus.\n\n     He opens a linen closet and tosses the towel in it.\n\n                              FERRIS\n               I could be the Walrus and I'd still\n               have to bum rides off people.\n\n     He passes CAMERA and goes into his room.\n\n                              FERRIS (OC)\n               I'm not very political? Let me\n               put that into perspective...\n\n 14  INT. BEDROOM                                                 14\n\n     Ferris tosses the towel he's dried hair with on the bed.\n\n                              FERRIS\n               My uncle went to Canada to protest\n               the war, right? On the Fourth of\n               July he was down with my aunt and he\n               got drunk and told my Dad he felt\n               guilty he didn't fight in Viet Nam.\n               So I said, \"What's the deal, Uncle\n               Jeff? In wartime you want to be a\n               pacifist and in peacetime you want\n               to be a soldier. It took you twenty\n               years to find out you don't believe\n               in anything?\"\n                          (snaps his fingers)\n               Grounded. Just like that. Two weeks.\n                          (pause)\n               Be careful when you deal with old\n               hippies. They can be real touchy.\n\n     He opens his door.\n\n 15  INT. CLOSET                                                  15\n\n     The door opens and Ferris rifles through his shirts.\n\n                              FERRIS\n               My mother was a hippie. But she\n               lost it. She got old. If she listens\n               to the White Album now? She doesn't hear\n               music, she hears memories. Nostalgia is\n               her favorite drug. It'll probably be\n               mine, too. I hope not.\n\n     He finds a shirt he likes. He steps back from the closet and\n     puts it on. He drops the towel.\n\n 16  INT. BEDROOM                                                 16\n\n     He walks across the room to his dresser. He opens his\n     underwear drawer. There's an old model of a submarine on the\n     top of the dresser. He picks it up.\n\n                              FERRIS\n               In eighth grade a friend of mine\n               made a bong out of one of these.\n               The smoke tasted like glue.\n\n     He pulls out a pair of underwear. He gets dressed as he\n     speaks.\n\n                              FERRIS\n               His name is Garth Volbeck. He's a\n               serious outsider. Not a bad guy, I\n               like him. I'm probably his only friend.\n               I do what I can for him. I mean, if\n               I was him, I'd appreciate it. Do unto others,\n               right? Anyway, his mother owns a gas station.\n               His father's dead and his sister's rumored\n               to be a prostitute, which is complete bullshit.\n               She only puts out so people will hang out\n               with her. It's sad but I don't hold it\n               against her. Better to hold it against the\n               guys who use her and don't care about her.\n                          (pause)\n               My parents never allowed Garth over here.\n               It was because of his family. Mainly his\n               older brother. He's in jail. I could see them\n               not wanting his brother here because he is\n               a registered psycho. I wouldn't want him here.\n               I once watched the guy eat a whole bowl of\n               artificial fruit just so he could see what\n               it was like to have his stomach pumped.\n               But Garth isn't his brother. It isn't his fault\n               that his brother's screwed-up. Alot of fights\n               with the parents on that point. I always felt\n               for Garth. I was sleeping at his house once\n               and I was laying on the dark worrying that\n               his brother was going to come in and hack me\n               to death with an ax and I heard Garth crying.\n               I asked him what was wrong and he said, \"Nothing\".\n               ... Nothing was wrong. There was no\n               specific thing he was crying about.\n               In fact, he wasn't really even aware that\n               he was crying. He just cried himself to\n               sleep every night. It was a habit. The\n               guy's so conditioned to grief that if\n               he doesn't feel it, he can't sleep. How\n               could you possibly dump on guy who has to\n               deal with that kinda shit? My parents\n               acknowledge the trudge of the situation\n               and I'm sure that deep down, they do feel\n               for him but still the guy's banned from\n               our house.\n\n     He looks at himself in the mirror on the back of his closet\n     door. He doesn't like what he's wearing. He continues his\n     speech as he disrobes.\n\n                              FERRIS\n               Unfortunately, now my parents have a\n               legit argument. Garth doesn't need his\n               brother to give him a rep anymore. He's\n               getting one on his own. He's lost. It's\n               over for him. He's eighteen. Gone from\n               school. Gone from life. His legacy is\n               a gas station.\n\n 17  INT. HOUSE. STAIRCASE                                        17\n\n     Ferris comes down the stairs. He's wearing a completely\n     different outfit.\n\n                              FERRIS\n               One very serious danger is playing\n               sick is that it's possible to believe\n               your own act.\n\n 18  INT. KITCHEN                                                 18\n\n     Ferris comes into the kitchen and crosses to the\n     refrigerator.\n\n                              FERRIS\n               That and boredom. Alot of people\n               ditch and feel great for about an\n               hour. Then they realize there's\n               nothing to do. TV and food. I myself\n               have ditched and gotten so bored I\n               did homework. Figure that shit out.\n\n     He takes a sip out of a bottle of orange juice.\n\n                              FERRIS\n               You have to plan things out before\n               you take the day off. Otherwise\n               you get all nervous worrying about\n               what to do and all you get is grief\n               and the whole point is to take it\n               easy, cut loose and enjoy.\n\n     He crosses to the pantry.\n\n                              FERRIS\n               You blow your day and at about three\n               o'clock, when everybody's out of school,\n               you're going to wish you'd gone to\n               school so you could be out having\n               fun.\n\n     He emerges from the pantry with a handful of Oreos.\n\n                              FERRIS\n               Avoid the misery. Plan your day.\n               Do it right.\n\n 19  INT. FAMILY ROOM                                             19\n\n     Ferris walks in and flops down in an armchair.\n\n                              FERRIS\n               There's alot of pressure at work\n               in my age group. And it's not always\n               recognized.\n\n     He reaches over and picks up the telephone. He sets it in\n     his lap.\n\n                              FERRIS\n               Some guy whose hair is falling out\n               and his stomach's hanging over his\n               belt and everything he eats makes\n               him fart, he looks at someone like\n               me and thinks, \"This kid's young and\n               strong and has a full, rich future ahead\n               of him, what's he got to bitch about?\"\n\n 20  CU. PHONE                                                    20\n\n     He punches out a number.\n\n 21  INT. FAMILY ROOM. FERRIS                                     21\n\n     He remote controls the TV on.\n\n                              FERRIS\n               That's just one reason why I need a\n               day off every now and then.\n\n 22  EXT. ANOTHER HOUSE                                           22\n\n     A sleek, modern house on a couple of deeply wooded acres. A\n     prime house in a prime location. A telephone rings OVER.\n\n 23  INT. BOY'S BEDROOM                                           23\n\n     It's a dark, dreary sick room. Shades drawn, floor strewn\n     with used tissues, nightstand a still-life of over the\n     counter remedies. A high school boy, CAMERON FRYE, is laying\n     in bed. We don't see his face, only a silhouette with a\n     thermometer sticking out his mouth. U2's SUNDAY BLOODY\n     SUNDAY is playing. He's mumbling random words.\n\n                              CAMERON\n               Food...shelter...no...yes...\n\n     The phone rings. His hand reaches back and hits the speaker\n     phone button.\n\n                              CAMERON\n                          (weak)\n               Hello?\n\n                              FERRIS' VOICE\n               Cameron! What's happening?\n\n                              CAMERON\n               Very little.\n\n                              FERRIS' VOICE\n               How do you feel?\n\n                              CAMERON\n               Shredded.\n\n                              FERRIS' VOICE\n               Is your mother in the room?\n\n     Cameron takes the thermometer out of his mouth.\n\n                              CAMERON\n               She's not home. Where are you?\n\n                              FERRIS' VOICE\n               Home.\n\n 24  INT. FERRIS' FAMILY ROOM. FERRIS                             24\n\n     Ferris is sprawled out in the chair.\n\n                              FERRIS\n               I'm taking the day off. Get\n               dressed and come over.\n\n                              CAMERON'S VOICE\n               I can't. I'm sick.\n\n                              FERRIS\n               It's all in your head. Come on over.\n\n 25  INT. CAMERON'S ROOM                                          25\n\n     Cameron's insistant.\n\n                              CAMERON\n               I feel like complete shit, Ferris.\n               I can't go anywhere.\n\n                              FERRIS' VOICE\n               I'm sorry to hear that. Now, come\n               on over and pick me up.\n\n     Ferris disconnects. Cameron slowly hangs up the phone.\n\n                              CAMERON\n               I'm dying.\n\n     The phone rings again. Cameron hits the speaker button.\n\n                              FERRIS' VOICE\n               You're not dying. You just can't think\n               of anything good to do.\n\n 26  INT. FERRIS' FAMILY ROOM                                     26\n\n     Ferris hangs up.\n\n                              FERRIS\n               If anybody needs a day off, it's\n               Cameron. He has alot of things to\n               sort out before he graduates. He\n               can't be wound this tight and go\n               to college. His roommate'll kill\n               him. I've come close myself. But I\n               like him. He's a little easier to\n               take when you know why he's like he\n               is. The boy cannot relax. Pardon\n               by French but Cameron is so tight\n               that if you stuck a lump of coal up\n               his ass, in two weeks you'd have a\n               diamond.\n                          (after-thought)\n               And Cameron would worry that he'd\n               owe taxes on it.\n\n 27  INT. SCHOOL. HALLWAY                                         27\n\n     We hear roll call as CAMERA MOVES ACROSS the tile floor. A\n     shoe's POV.\n\n                              TEACHER'S VOICE\n               Albers?\n\n                              BOY'S VOICE\n               Here.\n\n                              TEACHER'S VOICE\n               Anderson.\n\n                              GIRL'S VOICE\n               Here.\n\n     CAMERA enters a classroom. It travels past a teacher's Hush\n     Puppies and heads up an aisle of desk past dirty yellow\n     Reebocks, rotting Air Jordans, scuffed heels, pristine\n     loafers...\n\n                              TEACHER'S VOICE\n               Anheiser?\n\n                              BOY'S VOICE\n               Here.\n\n                              TEACHER'S VOICE\n               Busch?\n\n                              GIRL'S VOICE\n               Here.\n\n                              TEACHER'S VOICE\n               Bueller?\n\n     CAMERA reaches the last desk and rises slowly to reveal that\n     it's empty.\n\n                              TEACHER'S VOICE\n               Bueller?\n\n                              GIRL'S VOICE\n               He's sick.\n                          (pause)\n               My best friend's sister's boyfriend's\n               brother's girlfriend heard from this\n               guy who knows this kid who's going\n               with a girl who saw Ferris pass-out\n               at 31 Flavors last night. I guess\n               it's pretty serious.\n\n                              TEACHER'S VOICE\n                          (weary)\n               Thank you, Simone.\n\n                              GIRL'S VOICE\n                          (cheery)\n               No problem whatsoever.\n\n                              TEACHER'S VOICE\n               Drucker?\n\n                              BOY'S VOICE\n               What?\n\n     WOUND-OUT CAR ENGINES COME UP LOUD.\n\n 28  CU. TV                                                       28\n\n     THE ROAD WARRIOR is playing on video cassette. The big chase\n     at the end.\n\n     INT. FAMILY ROOM. FERRIS\n\n     He's sitting in the arm chair pretending it's Humongous' war\n     wagon. He's wearing a hockey mash. He's steering. He reaches\n     down and grabs an imaginary nitrous oxide valve.\n\n     CU. TV\n\n     Humongous reaches down and grabs a real nitrous oxide valve.\n     He gives it a twist.\n\n     CU. FERRIS\n\n     He throws himself back against the chair.\n\n     CU. TV\n\n     The force of the rapid acceleration of his vehicle throws\n     Humongous back in his seat.\n\n     CU. FERRIS\n\n     He bounces himself in the chair to simulate the bumpy high\n     speed ride.\n\n     CU. TV\n\n     The was wagon hurtles down the road.\n\n     CU. FERRIS\n\n     He rears back in horror.\n\n     CU. TV\n\n     The war wagon is heading for a head-on collision with the\n     tanker truck.\n\n     CU. FERRIS\n\n     Arms outstretched, head thrown back, braced for collision.\n\n     CU. TV\n\n     IMPACT!\n\n     MOZART COMES UP.\n\n 29  CU. FLOWERING TREE BRANCH                                    29\n\n     Outside a bedroom window. A flowering crabtree branch.\n     Petite pink flowers. WE PULL BACK FROM THE WINDOW INTO THE\n     ROOM. It's Jeanie's room. A pink and powder blue pig pen.\n     Clothes everywhere, make-up, books, records. Ferris is\n     sitting on her bed going through a purse.\n\n                          FERRIS\n               This is really degrading.\n\n     He comes up with a crumpled dollar bill.\n\n                              FERRIS\n               Financing my activities this way.\n               Very damaging to the self-image.\n               But, hey, I'm broke. In times of\n               crisis one must to what one must\n               to. I'll pay it back. With interest.\n\n     He comes up with a five.\n\n                              FERRIS\n               Regardless of how much shit sisters\n               make you eat, how often they rat on\n               you, how gross they act or how wicked\n               and insensitive they can be, you should\n               not alientate them. Because most likely\n               they have cash and it's usually very easy\n               to get your hands on.\n\n     He holds up a twenty and snaps it. PINK FLOYD'S \"MONEY\"\n     COMES UP.\n\n 30  INT. LIVING ROOM                                             30\n\n     The song plays as Ferris digs through the sofa cushions.\n\n     CU. SOFA\n\n     Ferris extracts a sticky quarter from a crevice.\n\n 31  INT. PARENTS' BEDROOM                                        31\n\n     Ferris is going through his father's pants pockets. Another\n     crumpled bill surfaces.\n\n 32  CU. WASHING MACHINE TOP                                      32\n\n     A couple of stiff, hard, bleached singles that have gone\n     through the wash lay on top of the washer. A hand scoops\n     them up.\n\n 33  CU. LUCITE ENCASED PROOF SET                                 33\n\n     An obvious gift from a grandparent. A U.S. Mint proof set. A\n     ten, a five and a single enclosed in a lucite frame. A\n     screwdriver tip wedges between the two pieces of Lucite and\n     pops them apart. A hand peels the bills off the backing.\n\n 34  CU. KITCHEN DRAWER                                           34\n\n     Hands ripping through the kitchen junk drawer. Locating a\n     dollar bill.\n\n 35  CU. COIN COLLECTION                                          35\n\n     The familiar blue collector's album. One-by-one, the\n     quarters are being popped out of their slots.\n\n 36  CU. VACCUUM CLEANER                                          36\n\n     The dusty, dirty contents of the bag are emptied on the\n     floor. Fingers pick a dime out of a matted wad of filth.\n\n 37  CU. SNOOPY BANK                                              37\n\n     It's being shaken furiously.\n\n 38  CU. BIRTHDAY CARD                                            38\n\n     It's a child's card. It's slowly opened to reveal a crisp,\n     new five.\n\n 39  INT. HALL CLOSET                                             39\n\n     The door opens and Ferris thrusts his hands into the pockets\n     of the coats. He comes up with a ball of Kleenex. A roll of\n     Tums. A squirt gun. Then a modest wad of bills. His face\n     lights up as he counts out the cash. He closes the door.\n\n 40  CU. FLOOR AND BED                                            40\n\n     Ferris' face appears between the bed and the floor. His arm\n     reaches out for a small metal bank hidden under the bed.\n\n 41  CU. BANK                                                     41\n\n     It's on a work bench. An awl is driven in between the door\n     and the jamb. It pries the door open. Inside are trading\n     cards, a charred doll's head, a Zippo lighter and, finally,\n     a five dollar bill.\n\n 42  INT. KITCHEN                                                 42\n\n     Ferris is on his hands and knees under the kitchen table.\n\n 43  CU. TABLE LEG                                                43\n\n     Ferris lifts the leg and removes a quarter that's been used\n     to balance the table.\n\n 44  INT. KITCHEN                                                 44\n\n     Ferris stands up and pockets the quarter.\n\n 45  CU. FERRIS' BED                                              45\n\n     A shower of coins and bills rain down on the sheets. The\n     SONG ENDS.\n\n 46  EXT. REAL ESTATE OFFICE. MORNING                             46\n\n     A suburban realty company. A cute little building in town.\n\n 47  INT. OFFICE                                                  47\n\n     Joyce is behind a desk. Across from her are two WOMEN.\n     They're also real estate agents.\n\n                              JOYCE\n               No one's going to consider a\n               house with a black living room.\n               Not even those jerks from Vermont.\n               Let's be realistic.\n\n                              AGENT 1\n               Mrs. Volbeck's dead set against\n               putting any money into the house.\n\n     Joyce's phone intercom buzzes. She take the call.\n\n                              JOYCE\n               Joyce Bueller.\n\n     Her eyes open wide with alarm.\n\n                              JOYCE\n               Oh, my God. I'm so sorry. I\n               completely forgot to call.\n\n 48  EXT. HIGH SCHOOL                                             48\n\n     A modern, suburban high school.\n\n                              MAN'S VOICE\n               Are you aware that your son is not\n               in school today?\n\n 49  INT. SCHOOL. HALLWAY                                         49\n\n     It's a passing period. The hall is clogged with students.\n\n                              JOYCE'S VOICE\n               Yes, I am. Ferris is home sick. I\n               had a meeting first thing this\n               morning. I should have called. It\n               completely slipped my mind.\n\n 50  INT. SCHOOL. DEAN'S OUTER OFFICE                             50\n\n     A SECRETARY is at work at her desk. We hear the dean inside\n     the office.\n\n                              DEAN'S VOICE\n               Are you also aware that Ferris does not\n               have what we consider an exemplary\n               attendance record?\n\n 51  INT. DEAN'S OFFICE. CU. DESK SIGN                            51\n\n     It reads, EDWARD R. ROONEY. DEAD OF STUDENTS. The dean's\n     feet are up on the desk, behind the sign. Moderately priced\n     dress shoes.\n\n                              JOYCE'S VOICE\n               I don't understand.\n\n                              DEAN'S VOICE\n               I just had his file up.\n\n     INT. OFFICE. CU. DEAN\n\n     ED ROONEY is sitting behind his desk. He's tough, clean and\n     straight as an I-beam. Short, neatly combed hair, suit and\n     tie. He's toying with a pencil. He's confident to the point\n     of arrogance.\n\n                              ROONEY\n               I just has his file up, Mrs. Bueller.\n\n     Behind him is a computer terminal. He removes his feet from\n     the desk and turns in his swivel chair.\n\n                              ROONEY\n               If Ferris thinks he coast this last\n               month and still graduate, he's sorely\n               mistaken.\n\n                              JOYCE'S VOICE\n               This is all news to me.\n\n     CU. COMPUTER MONITOR\n\n     The monitor on Rooney's desk displays Ferris' records.\n\n                              ROONEY'S VOICE\n               So far this semester alone, he's been\n               absent nine times. Including today.\n\n                              JOYCE'S VOICE\n               Nine times?\n\n     Under DAYS MISSED we see a number 9 suddenly change to a\n     number 2.\n\n     INT. OFFICE\n\n     Rooney turns to the monitor. He reads off the screen.\n\n                              ROONEY\n               I have it right here in front of me. He's\n               missed...\n\n     He looks closer at the screen.\n\n 52  INT. FERRIS' ROOM                                            52\n\n     Ferris is at his Macintosh computer. He has his record up\n     on the screen.\n\n                              FERRIS\n               I wanted a car. I got a computer. How's\n               that for being born under a bad sign?\n\n 53  INT. JOYCE'S OFFICE                                          53\n\n     She's still on the phone with Rooney.\n\n                              JOYCE\n               I can give you every assurance that\n               Ferris is home and that he is, in\n               fact, very ill. I debated whether\n               or not I should even leave him.\n               I can appreciate that at this time\n               of year children are prone to taking\n               the day off, but in Ferris' case,\n               he's truly a very sick boy.\n\n 54  INT. FERRIS' BEDROOM                                         54\n\n     MUSIC BLASTS. SOLO GUITAR.\n\n     CU. SPEAKER\n\n     The grille cloth is throbbing.\n\n     CU. LED METERS\n\n     The meters on the amplifier are totally in the danger zone.\n\n     CU. TV MONITOR\n\n     We see Ferris in his room with a guitar around his neck.\n     He's playing.\n\n     CU. VIDEO CAMERA\n\n     A home video camera is capturing Ferris on tape.\n\n 55  INT. CAMERON'S ROOM                                          55\n\n     He's sitting on the edge of the bed buttoning his shirt. He\n     sighs deeply and fall back on the bed.\n\n 56  INT. SCHOOL. HALLWAY                                         56\n\n     Jeanie is at her locker during a passing period. A\n     GIRLFRIEND comes up to her.\n\n                              GIRL\n               I'm really sorry about your brother.\n\n                              JEANIE\n               What're you sorry for? I have to live\n               with the trouser snake.\n\n                              GIRL\n               No, I mean I heard he's really sick.\n\n                              JEANIE\n               Who said he's sick.\n\n                              GIRL\n               A whole bunch of people. They said\n               he's like on the verge of death.\n\n     Jeanie stares incredulously at the girl.\n\n                              GIRL\n               This guy in my biology class said\n               that if Ferris dies he's giving\n               his eyes to Stevie Wonder? He's\n               really sweet isn't he?\n\n     She smiles and exits. Jeanie cocks her head in bewilderment.\n     She kicks her locker shut.\n\n 57  INT. FERRIS' ROOM                                            57\n\n     He's in bed on the phone.\n\n                              FERRIS\n               A sample of my blood was sent\n               to Atlanta to the Center for\n               Disease Control. I don't know,\n               man, I'm bricking heavily.\n                          (point to the\n                           phone)\n               Freshman.\n                              (to the phone)\n               Did you see Alien? When the guy\n               had the creature in his stomach?\n               It feels like that.\n\n 58  INT. SCHOOL. HALLWAY                                         58\n\n     A FRESHMAN BOY is on the pay phone. A couple of his BUDDIES\n     are standing at his side waiting anxiously for news.\n\n                              BOY\n               Goddamn! Are you kidding?\n\n                              SECOND BOY\n               What?\n\n                              BOY\n               Did you see Alien?\n\n                              SECOND BOY\n               No.\n\n                              BOY\n               You never rented the video cassette?\n\n     Second boy shakes his head, no.\n\n                              BOY\n               Oh. He's really wasted.\n\n                              THIRD BOY\n                          (to the Second Boy)\n               Who's he talking to?\n\n                              SECOND BOY\n               Ferris Bueller. You know him?\n\n                              THIRD BOY\n                          (excited)\n               Yeah. He's getting me out of summer\n               school.\n\n                              BOY\n               Anyway, I appreciate you letting us\n               know how you're doing. We gotta split.\n                          (pause)\n               Huh?...Yeah, sure. Hold on.\n\n                              SECOND BOY\n                          (to Third Boy)\n               Shit. I hope he doesn't die.\n               I can't handle summer school.\n\n     The boy snatches a passing GIRL.\n\n                              BOY\n               Did you see Alien?\n\n                              GIRL\n               Yeah, why?\n\n     He hands her the phone.\n\n                              GIRL\n               Hello?\n                          (pause)\n               Who?\n                          (pause)\n               Hi, Ferris. How's your bod?\n                          (jaw drops)\n               Oh, my God! You're dying?\n               Is it serious?\n                          (pause)\n               Shiit! Are you upset?\n\n 59  INT. DEAN'S OFFICE                                           59\n\n     Rooney's comparing his computer monitor to hard copy. His\n     SECRETARY is standing over his shoulder.\n\n                              ROONEY\n               I don't trust this kid any further\n               than I can throw him!\n\n                              SECRETARY\n               With your bad knee, you better\n               not throw anybody, Ed.\n\n     Rooney stares at her for a long beat.\n\n                              ROONEY\n               What's so dangerous about a character\n               like Ferris Bueller is that he gives\n               the good kids bad ideas. The last thing\n               I need at this point in my career is\n               fifteen hundred Ferris Bueller disciples\n               running around these halls.\n\n                              SECRETARY\n               He's very popular, Ed. Sportos, motorheads,\n               geeks, sluts, pinheads, dweebies, wonkers,\n               richies, they all adore him.\n\n                              ROONEY\n               That's exactly why I have to catch him\n               this time. To show these kids that the\n               example he sets is a first class ticket\n               to nowhere.\n\n                              SECRETARY\n                          (impressed)\n               Ooo. You sounded like Dirty Harry just\n               now.\n\n     Rooney looks up at her with a proud smile.\n\n                              ROONEY\n               Really?\n\n     He unconsciously does an Eastwood squint.\n\n 60  EXT. FERRIS' HOUSE                                           60\n\n     It's a glorious late spring day. A florist's truck drives\n     past the house.\n\n 61  INT. FERRIS' ROOM                                            61\n\n     He's on the telephone. As he speaks he does a little\n     MacPainting on his MacIntosh. A Modigliani nude.\n\n                              FERRIS\n               Cameron, if you're not over here\n               in fifteen minutes, you can find\n               a new best friend. I'm serious, man.\n               This is bullshit, making me wait\n               around the house for you.\n\n 62  INT. CAMERON'S BEDROOM                                       62\n\n     Cameron's back in bed.\n\n                              CAMERON\n               I'm sick. I feel like shit. Why can't\n               you leave me alone?\n\n                              FERRIS' VOICE\n               You're not up for some good times?\n               It's a beautiful day. It's almost\n               summer. If this was Hawaii, we'd be\n               surfing.\n\n 63  INT. FERRIS' ROOM                                            63\n\n     He's growing weary of Cameron's wimpishness.\n\n                              FERRIS\n               You want to stay home and try\n               to have the shits? Try to barf?\n               Try to feel worse?\n\n                              CAMERON'S VOICE\n               I don't have to try.\n\n                              FERRIS\n               Be a man. Take some Pepto Bismol\n               and get dressed. You're boring me\n               with this stuff.\n\n     The other phone line rings.\n\n                              FERRIS\n               Squeeze you buns for a second. I\n               got another call.\n\n     He puts Cameron on hold. He clears his throat and answers\n     the second line. He sounds like he's on his last breath.\n\n                              FERRIS\n               H--hell-o?\n\n 64  EXT. OFFICE BUILDING. DOWNTOWN                               64\n\n     A LaSalle Street office tower.\n\n                              TOM'S VOICE\n               Ferris?\n\n 65  INT. TOM'S OFFICE                                            65\n\n     He's behind his desk. Nice office. Two windows. Herman\n     Miller desk and chair.\n\n                              TOM\n               You sound miserable.\n\n                              FERRIS' VOICE\n               Really? Darn! I thought I was improving.\n\n                              TOM\n               Were you sleeping?\n\n                              FERRIS' VOICE\n               I was trying to do some homework.\n\n 66  CU. COMPUTER MONITOR                                         66\n\n     A closer view of the rude drawing Ferris is making.\n\n                              FERRIS (OC)\n               I'm so worried about falling behind.\n\n     INT. FERRIS' ROOM\n\n     He leans back from the monitor and sips a Coke.\n\n                              FERRIS\n               Dad? Can you hold on a second?\n\n                              TOM'S VOICE\n               Sure, pal. Are you alright?\n\n                              FERRIS\n               Just a little phlegm on the phone.\n               Hold on.\n\n     He puts his father on hold.\n\n                              FERRIS\n               Cameron? It's my Dad.\n\n                              CAMERON'S VOICE\n               Oh, that's just great. Are you busted?\n\n                              FERRIS\n               It's completely cool. He's just\n               checking up on me. Now, listen to\n               me. I'm working on getting some\n               heavy bucks out of him. So, the least you\n               can do is hurry up and get over here.\n               Bye.\n\n     He disconnects and gets his father back. He switches back to\n     his sick voice.\n\n                              FERRIS\n               Sorry, Dad. The moment before you\n               called, I had a chest spasm and I\n               blew lung fluid all over the place.\n               It was making me ill looking at it.\n               But gee, it's sure great of you to call.\n               I'm sure there're alot of fathers\n               who wouldn't take time out from\n               their busy schedules to call a dumb,\n               sick teenager.\n\n                              TOM'S VOICE\n               Hey, pal, what was I supposed to do?\n\n     Ferris reaches out and hits a key on his computer. The\n     screen dumps the drawing.\n\n                              FERRIS\n               Give yourself some credit, Dad. It\n               was a mammoth gesture. It's like those\n               savings bonds you used to give me\n               every Christmas.\n                          (looks at CAMERA and smiles)\n               It was that kind of concern.\n\n     CU. COMPUTER SCREEN\n\n     A message is flashing: \"TRANSMITTING DATA\".\n\n     INT. FERRIS' ROOM\n\n     He turns away from the computer and puts his feet up on the\n     desk. He lights a cigarette.\n\n                              FERRIS\n               You had to work hard for the money\n               to buy those things, right?\n\n                              TOM'S VOICE\n               Not any harder than anybody else.\n\n     Ferris mouths Tom's words as he says them.\n\n 67  EXT. CHICAGO LOOP. DIAMONDVISION SCREEN                      67\n\n     Ferris' drawing suddenly appears on the billboard.\n     Pedestrians stop to look.\n\n 68  INT. FERRIS' ROOM                                            68\n\n     He blows a smoke ring.\n\n                              FERRIS\n               You work so hard I'll bet you don't\n               even remember where those bonds are,\n               right?\n\n     Ferris points a finger in the air as a cue to his father.\n\n                              TOM'S VOICE\n               Wrong.\n\n     He nods.\n\n                              FERRIS\n               Oh, yeah? You're pulling my leg. You're\n               just trying to cheer me up.\n\n                              TOM'S VOICE\n               Like hell I am. They're in a shoebox\n               in my closet.\n\n     Ferris smiles. He looks at CAMERA. He's gotten exactly what\n     he wants.\n\n                              FERRIS\n                          (to CAMERA, normal\n                           voice)\n               Was that a class move or what?\n               The guy gave it up faster than\n               a drunk Catholic girl. I hope my\n               kids don't pull this shit on me.\n                          (thinks)\n               Of course, if they didn't, they'd\n               be dumb and abnormal and they'd\n               probably never move out of my\n               house and I'd have to support them\n               until I die. I take it back.\n                          (to the phone,\n                           sick voice)\n               Dad? All this talking has made me\n               kind of light-headed. I think\n               I better lie down.\n\n                              TOM'S VOICE\n               Okay, pal. You take care. I'll\n               call you after lunch.\n\n                              FERRIS\n               You don't have to, Dad.\n\n                              TOM'S VOICE\n               I want to. Bye now.\n\n     He hangs up. Ferris sighs.\n\n                              FERRIS\n               You win some, you lose some.\n\n     He turns his desk chair around and gets up.\n\n                              FERRIS\n               I'm so disappointed in Cameron.\n               Twenty bucks says he's sitting\n               in his car debating about whether\n               or not he should go out.\n\n 69  INT. CAR. CAMERON                                            69\n\n     He's sitting behind the wheel of his car.\n\n                              CAMERON\n               We're gonna get caught. No doubt\n               about it.\n\n     He cuts the engine.\n\n                              CAMERON\n               I'm not doing it.\n\n     He sits for half a beat.\n\n                              CAMERON\n               He'll keep calling until I come\n               over.\n\n     He sighs and restarts the engine. Another beat.\n\n                              CAMERON\n               Actually, what'll happen is I'll\n               get caught. Ferris'll escape.\n\n     Another beat. He stops the engine. A CRASH OF HORROR MUSIC.\n\n 70  CU. DRESSER DRAWER                                           70\n\n     Hands curl around the drawer pulls. The drawer is opened\n     slowly, ominously. The hands lift a sweater out. A HERALDIC\n     STING as we see a men's magazine beneath the sweater.\n\n     INT. FERRIS' ROOM\n\n     He takes out the magazine. He leafs through the pages for\n     the pictorials as he speaks.\n\n                              FERRIS\n               Cameron'll go on like that for a\n               good thirty minutes. The guy\n               is a shellfish when it comes to\n               making a decision. The reason\n               he doesn't fell good is, he\n               worries about everything. He's\n               the only guy I know who's deeply\n               concerned that when he grows up\n               there'll be a critical shortage\n               of strategic metals.\n\n     He exits the room.\n\n 71  INT. HALLWAY                                                 71\n\n     Ferris comes out of his room and heads down the hallway.\n\n                              FERRIS\n               Cameron's also the only guy\n               I know who knows what strategic\n               metals are.\n                          (waves the magazine)\n               Pardon moi.\n\n     He goes into the bathroom. We HEAR THE TOILET SEAT SLAM\n     DOWN.\n\n                              FERRIS\n                          (sings)\n               MAYBE I'M JUST LIKE MY MOTHER,\n               SHE'S NEVER SATISFIED...\n\n 72  INT. CLASSROOM. LATER                                        72\n\n     A stunningly beautiful girl, SLOANE PETERSON, is sitting at\n     her desk in a history class. She's staring out the window as\n     a tweedy MALE TEACHER delivers a dry, dusty lecture.\n\n                              TEACHER\n               Roosevelt's health had seriously\n               deteriorated by the time he met\n               with Churchill and Stalin at Yalta.\n                          (sneezes)\n               Pardon me.\n\n     The classroom door opens and the school NURSE walks in. For\n     a moment, the teacher thinks she's come in because she heard\n     him sneeze. She crosses to him and whispers in his ear.\n\n     SLOANE\n\n     She, like the others, watches the nurse curiously.\n\n     INT. CLASSROOM. TEACHER AND NURSE\n\n     The teacher's face drops as he's delivered an obvious piece\n     of disturbing news. He nods grimly to the Nurse. She looks\n     at the kids.\n\n                              NURSE\n               Sloane Peterson?\n\n     SLOANE\n\n     Sits up in her seat.\n\n     NURSE\n\n     She's a picture of compassion and understanding.\n\n                              NURSE\n               May I see you outside for a moment?\n               There's been an emergency.\n\n     SLOANE\n\n     A smile curls across her lips. As she gathers her books she\n     looks to the GIRL next to her.\n\n                              SLOANE\n                          (whispers)\n               Dead grandmother.\n\n 73  INT. HALLWAY                                                 73\n\n     The Nurse is gently holding Sloane's hand.\n\n                              NURSE\n                          (nods solemnly)\n               Dead grandmother.\n\n 74  CU. ROONEY                                                   74\n\n     He has a suspicious look on his face.\n\n                              ROONEY\n               Dead grandmother?\n\n     INT. DEAN'S OFFICE\n\n     Rooney's at his desk. His secretary is standing across from\n     him.\n\n                              SECRETARY\n               That's what Mr. Peterson said. I\n               had Florence Sparrow notify Sloane.\n\n                              ROONEY\n               Who's this girl's going with?\n\n                              SECRETARY\n               It's so hard to tell. I see her\n               alot with Ferris Bueller.\n\n     Rooney smiles. His suspicions are confirmed.\n\n                              ROONEY\n               Could you get me Mr. Peterson's\n               daytime number?\n\n     As the secretary starts out of the room, Rooney's phone\n     rings. She stops and answers the desk phone.\n\n                              SECRETARY\n               Edward Rooney's office.\n                          (pause)\n               Yes. Can you hold? Thank you.\n\n     She puts the call on hold.\n\n                              SECRETARY\n               It's Mr. Peterson.\n\n     Rooney is startled. He thinks for a beat then reaches for\n     the phone.\n\n                              SECRETARY\n               Do you still want his number?\n\n     Rooney answers her with an annoyed look. She smiles and\n     backs out. He punches the phone button.\n\n                              ROONEY\n               Ed Rooney.\n\n                              MAN'S VOICE\n               Ed? This is George Peterson.\n\n                              ROONEY\n               How are you today, sir?\n\n                              MAN'S VOICE\n               We've had a bit of bad luck this\n               morning as you may have heard.\n\n     Rooney rolls his eyes. It's so obvious it's not Mr.\n     Peterson.\n\n                              ROONEY\n               I heard. And, gosh, I'm all broken\n               up. Huh? Oh, sure. I'd be happy to\n               release Sloane. You produce a corpse\n               and I'll release Sloane. I want to\n               see this dead grandmother firsthand.\n\n     The secretary stops cold in the doorway. She turns to Rooney\n     in horror. He covers the phone.\n\n                              ROONEY\n                          (whispers)\n               It's Ferris Bueller. Nervy litttle\n               punk. I'm gonna set a trap and let\n               his walk right into it!\n                          (to phone)\n               That's right. Cart the stiff in and\n               I'll turn over your daughter. It's\n               school policy. Was this your mother?\n\n     Rooney's other line rings.\n\n 75  INT. SECRETARY'S OFFICE                                      75\n\n     She steps out of Rooney's office and picks up the other\n     line.\n\n                              SECRETARY\n               Ed Rooney's office.\n\n     Her jaw drops.\n\n                              SECRETARY\n               Hold, please.\n\n     She puts the call on hold and hangs up. She hurried into\n     Rooney's office.\n\n 76  INT. DEAN'S OFFICE                                           76\n\n     Rooney's chewing out the person on the other line.\n\n                              ROONEY\n               I'll tell you want, you don't\n               like my policies, you can just\n               come on down and smooch by big\n               old ugly ass. You hear me?\n\n     The secretary comes in. She's waving her arms furiously.\n     Rooney tries to wave her away. He's angry. She stomps her\n     foot. Rooney covers the phone.\n\n                              ROONEY\n               What!?\n\n                              SECRETARY\n               Ferris Bueller's on line two.\n\n     CU. ROONEY'S FOOT\n\n     It freezes in mid-tap.\n\n     CU. ROONEY'S HAND\n\n     The pencils falls from his fingers.\n\n     CU. ROONEY'S FACE\n\n     A mask of horror. He glances at the phone.\n\n     CU. PHONE\n\n     The second line light is flashing.\n\n     CU. ROONEY\n\n     He blinks, cocks his head, twitches.\n\n 77  INT. FERRIS' ROOM                                            77\n\n     He's zipping his pants, fastening his belt. The phone's\n     cradled against his shoulder. He speaks in the same voice he\n     used on his father.\n\n                              FERRIS\n               Mr. Rooney? I'm sorry to disturb\n               you at work but I was wondering if\n               it would be possible for my sister\n               to bring home any assignments from\n               my classes that I may need.\n\n 78  INT. DEAN'S OFFICE. ROONEY                                   78\n\n     He's staring blankly ahead.\n\n                              FERRIS' VOICE\n               Thank you, sir.\n\n     He nods.\n\n     CU. PHONE\n\n     Rooney's finger gingerly presses the button on the waiting\n     call.\n\n     CU. ROONEY\n\n     He winces as he returns to the first call.\n\n 79  INT. FERRIS' HOUSE. KITCHEN                                  79\n\n     Cameron's on the phone in the kitchen. He's doing a deep,\n     phoney \"father\" voice.\n\n                              CAMERON\n               You oughta be sorry for Christ's\n               sake! A family member dies and\n               you insult me. What's the matter\n               with you, anyway?\n\n 80  INT. DEAN'S OFFICE. ROONEY                                   80\n\n     He apologies profusely to Cameron. He's perspiring,\n     trembling.\n\n                              ROONEY\n               I don't know. I thought you were\n               someone else. You have to know,\n               sir, that I would never deliberately\n               insult you. I can't begin to tell\n               you how embarrassed I am.\n\n                              CAMERON'S VOICE\n               Pardon my French but you're an asshole!\n\n     Rooney nods enthusiastically.\n\n                              ROONEY\n               Absolutely! I most certainly am.\n\n 81  INT. KITCHEN                                                 81\n\n     Cameron lays into Rooney.\n\n                              CAMERON\n               This isn't over yet, buster. You\n               just make sure my daughter's out\n               in front of the school in ten\n               minutes. Do you read me?\n\n                              ROONEY'S VOICE\n               Load and clear, Mr. Peterson.\n\n                              CAMERON\n               Call me sir, goddamn it!\n\n                              ROONEY'S VOICE\n               Sir.\n\n                              CAMERON\n               That's better.\n\n     Ferris strolls into the kitchen to catch the last of the\n     conversation. Cameron covers the phone.\n\n                              CAMERON\n                          (to Ferris)\n               I'm scared shitless, Ferris! What\n               is Rooney guesses my voice!\n\n                              FERRIS\n               Impossible. You're doing great.\n\n     Cameron sighs and goes back to the phone.\n\n                              CAMERON\n                          (clears his throat)\n               I don't have all day to bark at you\n               so I'll make this short and sweet.\n\n     Ferris gives Cameron an enthusiastic thumbs up.\n\n                              FERRIS\n                          (mouths)\n               Great!\n\n     Cameron smiles proudly.\n\n                              CAMERON\n               I want my daughter out in front\n               of the school in ten minutes. By\n               herself. I don's want anyone around...\n\n     Ferris smacks Cameron. He's said the wrong thing. He covers\n     the phone.\n\n                              CAMERON\n               What'd I do?\n\n                              FERRIS\n               Out in front my herself? It's too\n               suspicious! He'll think something's\n               up, moron. Cover it.\n\n     Cameron panics. He holds the phone out to Ferris.\n\n                              CAMERON\n               You do it!\n\n     Ferris waves his arms angrily.\n\n                              FERRIS\n               Talk!\n\n     Cameron takes a deep breath. He clears his throat and puts\n     on his father's voice.\n\n                              CAMERON\n               I changed my mind, fella. You be out\n               in front with her! I wanna have a\n               few words with you!\n\n     Ferris slaps Cameron. The phone flies out of his hand.\n\n 82  CU. ROONEY                                                   82\n\n     He winces as the phone hits the floor with a loud CLONK!\n     We HEAR THE BOYS SCRAMBLING TO PICK UP THE PHONE, THEN\n     CAMERON CLEARING HIS THROAT.\n\n                              CAMERON'S VOICE\n               On second thought, I don't have\n               time to talk to you. We'll get\n               together soon and have lunch.\n\n     We HEAR A SLAP AND THE CALL DISCONNECTS.\n\n 83  INT. FERRIS' KITCHEN                                         83\n\n     Cameron's rubbing the side of his head.\n\n                              CAMERON\n               Why'd you hit me?!\n\n                              FERRIS\n               Where's your brain?!\n\n                              CAMERON\n               Why'd you hit me?!\n\n                              FERRIS\n               Where's your brain?!\n\n                              CAMERON\n               Why'd you hit me?\n\n                              FERRIS\n               Where's your brain?\n\n                              CAMERON\n               I asked you first.\n\n                              FERRIS\n               How can we pick up Sloane if Rooney's\n               going to be there with her?!\n\n                              CAMERON\n               I said for her to be there alone\n               and you freaked!\n\n                              FERRIS\n               My, God, you're so stupid!\n                          (aside)\n               I didn't hit you, I lightly slapped\n               you.\n\n                              CAMERON\n               You hit me. Look, don't ask me to\n               participate in your crap if you\n               don't like the way I do it!\n\n     Ferris is incredulous at Cameron's stupidity. Cameron's\n     anger is intensified by his embarrassment.\n\n                              CAMERON\n               I was home, sick. You get me out of\n               bed, being me over here, make me\n               jeopardize my future, make me do\n               a phoney phone call on a dean of\n               students, a man who could squeeze\n               my nuts into oblivion and then\n               you deliberately hurt my feelings.\n\n                              FERRIS\n               I didn't deliberately hurt your feelings.\n\n                              CAMERON\n               Oh, really?\n\n                              FERRIS\n               Yeah, really.\n\n     Cameron glares at Ferris.\n\n                              CAMERON\n               Hey, Ferris? Have a nice life.\n\n     He turns and heads out of the room. Ferris sighs.\n                              FERRIS\n               Cameron?\n\n                              CAMERON\n               Stick it up your ass, Ferris.\n\n                              FERRIS\n               Cameron, I'm sorry. I didn't mean\n               to jam you. It was uncalled for.\n\n     Cameron stops.\n\n                              CAMERON\n               You're serious?\n\n     He turns around.\n\n                              FERRIS\n               Dead serious.\n\n     Cameron smiles. He appreciates Ferris apology.\n\n                              CAMERON\n               Thanks.\n\n                              FERRIS\n               You did screw up through, right?\n               Not that is was necessarily all\n               you fault. Right?\n\n                              CAMERON\n                          (suspiciously)\n               Why?\n\n                              FERRIS\n               To fix this situation, I'm going\n               to have to ask you for a small favor.\n\n     Cameron's jaw drops.\n\n 84  INT. GARAGE                                                  84\n\n     The door opens slowly, dramatically as we hear a heraldic\n     fanfare. Light streams in to reveal Cameron and Ferris\n     looking at the car. Ferris is smiling with excitement and\n     awe. Cameron is frowning with trepidation and fear.\n\n     CU. FERRARI STALLION\n\n     The prancing black stallion. We move up from the stallion to\n     the erotic red hood of a 1958 Ferrari 250 GTS California.\n\n     CAMERON AND FERRIS\n\n     Cameron's face is ashen. The end of the world is at hand.\n     Ferris is in heaven.\n\n                              CAMERON\n                          (grim monotone)\n               1958 Ferrari 250 GTS California. Less\n               than a hundred were made. It has a\n               market value of $265,000. My father\n               spent three years restoring it. It\n               is joy, it is his love, it is his\n               passion.\n\n                              FERRIS\n               It is his fault he didn't lock the\n               garage.\n\n                              CAMERON\n               Ferris, my father loves this car more\n               than life itself. We can't take is out.\n\n                              FERRIS\n               A man with priorities so far out of\n               whack doesn't deserve such a fine\n               automobile.\n\n                              CAMERON\n               He never drives it, Ferris. He just\n               rubs it with a diaper.\n\n                              FERRIS\n               We can't pick up Sloane in your car,\n               Cameron. Rooney'd never believe Mr.\n               Peterson drives that piece of shit.\n\n                              CAMERON\n               It's not a piece of shit.\n\n                              FERRIS\n               It's a piece of shit. Don't worry\n               about it. I don't even have a piece\n               of shit. I have to envy yours. Look,\n               I'm sorry but there's nothing else\n               we can do.\n\n                              CAMERON\n               He knows the mileage, Ferris. He has\n               it tatooed on his wrist.\n\n                              FERRIS\n               He doesn't trust you?\n\n                              CAMERON\n               No.\n\n                              FERRIS\n               Alright, look, this is real simple.\n     He puts his arm around Cameron.\n\n                              FERRIS\n               Whatever miles we put on it, we'll\n               take off.\n\n                              CAMERON\n                          (suspicious)\n               How?\n\n                              FERRIS\n                          (big, proud smile)\n               We'll drive home backwards.\n\n     Cameron shakes his head, no.\n\n                              CAMERON\n               Forget it. I'm putting my foot down,\n               Ferris. You'll have to think of\n               something else...\n\n     CU. FERRARI GRILLE\n\n     Cameron's protests are drowned out by the distinctive roar\n     of the twelve cylinders.\n\n                              CAMERON'S VOICE\n               ...You're not talking me into this\n               one. I have to live with the man.\n               I'm sorry but...\n\n     The roar of the engine is overtaken by the sound of a\n     crowded school hallway.\n\n 85  INT. SCHOOL. JEANIE                                          85\n\n     She comes out of a classroom. She stops as Sloane and Rooney\n     walk past. Sloane has her coat on and she's carrying her\n     books. Jeanie watches her suspiciously.\n\n 86  EXT. SCHOOL                                                  86\n\n     The Ferrari is parked out in front. The top is down.\n\n 87  INT. FERRARI                                                 87\n\n     Ferris is driving. He's wearing a man's hat and sunglasses.\n     Cameron's in the back.\n\n                              CAMERON\n               Are you crazy?! Put the top back\n               up!\n\n                              FERRIS\n               This is perfect top-down weather.\n                              CAMERON\n               What about Rooney?\n\n                              FERRIS\n               Cameron, the more obvious we are,\n               the less likely we are to get\n               caught.\n\n                              CAMERON\n               That makes no sense whatsoever.\n\n                              FERRIS\n               The adult mind is a suspicious\n               machine.\n                          (look around at Cameron)\n               Stay down, man.\n\n     Cameron squeezes himself lower.\n\n                              CAMERON\n               Howcome it's my Dad's car and\n               I'm taking all the risk and I have\n               to ride back here?\n\n                              FERRIS\n               I don't have an explanation.\n\n 88  EXT. SCHOOL                                                  88\n\n     Rooney and Sloane come out the door.\n\n                              ROONEY\n               Once again let me say how deeply\n               saddened I am by your loss.\n\n                              SLOANE\n               Huh?\n\n                              ROONEY\n               Were you close to your grandmother?\n\n                              SLOANE\n               Oh. Um. Yeah. Very. She was a terrific\n               lady. Very hip. Very old. Yeah.\n\n                              DEEP VOICE\n               Oh, Sloane! Dear!\n\n     Sloane looks across at the Ferrari. Rooney looks.\n\n     THEIR POV\n\n     Ferris is looking out across the roof of the Ferrari. He's\n     careful to keep his nose and mouth below the roofline.\n\n                              FERRIS\n               Hurry along now!\n\n     EXT. SCHOOL\n\n     Rooney's suspicious. Sloane smiles and bids Rooney a hasty\n     farewell.\n\n                              SLOANE\n               I guess that's my Dad. Thanks.\n               See ya.\n\n     She hurries to the car. Rooney watches her. Something does\n     compute for him.\n\n 89  INT. SCHOOL. JEANIE                                          89\n\n     She's watching out the door. She sees the Ferrari pull away.\n\n 90  EXT. SCHOOL. ROONEY                                          90\n\n     He can't quite put his finger on what's bothering him.\n\n 91  INT. FERRARI                                                 91\n\n     Sloane shrieks with delight. She leans across the console\n     and gives Ferris a kiss.\n\n                              SLOANE\n               This is so great! I can't believe\n               it! Right in front of Rooney!\n\n     She laughs and turns to Cameron.\n\n                              SLOANE\n               Hi, Cameron. You comfortable?\n\n                              CAMERON\n               Hi. No.\n\n                              SLOANE\n               What a fabulous car!\n\n                              CAMERON\n               Enjoy it quick. It' s going home.\n\n                              FERRIS\n               It was risky, it was bold but\n               it was totally necessary.\n\n                              SLOANE\n               What're we gonna do?\n\n                              FERRIS\n               The question isn't \"what are we\n               gonna do\", the question is \"what\n               aren't we going to do.\"\n\n                              CAMERON\n               Don't tell me we're not going to\n               take the car home. Please.\n\n                              FERRIS\n                          (to CAMERA)\n               If you had access to a car like this\n               would you take it back right away?\n               Would you give up feeling like a\n               ton just to ease your best friend's\n               tension?\n\n     He smiles.\n\n                              FERRIS\n               Either would I.\n\n 92  EXT. STREET. FERRARI                                         92\n\n     It accelerates away like a shot.\n\n 93  EXT. SUBURBAN BANK                                           93\n\n     A fresh, modern bank building. The clock outside read 9:53.\n     The Ferrari pulls into the parking lot.\n\n 94  INT. BANK. DOORS                                             94\n\n     Ferris, Cameron and Sloane walk in. Ferris is cocky and\n     confident. Sloane's still intoxicated with her freedom.\n     Cameron's having stomach trouble. Ferris leads the way to an\n     open teller window.\n\n     INT. BANK. TELLER\n\n     A WOMAN about seventy with a silver blue beehive. It's about\n     four inches higher the highest beehive you're ever seen. As\n     she moves the beehive hits a small sign over her head. She's\n     been at the bank since they opened. She smiles when she sees\n     Ferris.\n\n                              TELLER\n               Ferris Bueller?\n\n     FERRIS\n\n     He's at the window. On either shoulder are Cameron and\n     Sloane. Ferris smiles. Cameron blanches.\n\n                              FERRIS\n               Hello, Mrs. Froeling. How are you?\n\n     TELLER\n\n     She pats the rock-solid mass of blue hair. In doing so she\n     locates a missing ball point pen. She withdraws it from the\n     hair and smiles at it's reappearance.\n\n                              TELLER\n               I passed a kidney stone Tuesday, so\n               I'm a little pooped but other than\n               that, I'm as chipper as can be.\n                          (something occurs to her)\n               Say, should you be in school?\n\n     FERRIS\n\n     He lays his savings bonds on the counter.\n\n                              FERRIS\n               Me?\n                          (polite laugh)\n               I'm out of school, Mrs. Froeling.\n               In fact. I'm married. This is my\n               wife...Madonna.\n\n     Sloane suppresses a laugh.\n\n                              FERRIS\n                          (to Cameron)\n               And this is my brother-in-law,\n               ZZ Top. ZZ, this is Mrs. Froeling.\n\n     Cameron isn't amused.\n\n                              TELLER\n                          (to Cameron)\n               Is Top a Slavic name?\n\n                              CAMERON\n               Yeah.\n\n                              FERRIS\n               I'd like to cash these in, please.\n               We're having a baby and we need the\n               cash for a crib, clothes, diapers,\n               food pellets, leash, water dish...\n\n     INT. BANK. TELLER WINDOW\n\n     Mrs. Froeling takes the bonds with a hearty smile. The\n     latter part of the conversation sails over her like a line\n     drive.\n\n                              TELLER\n               A baby!\n                          (to Sloane)\n               You must be so excited.\n\n     Cameron groans and turns away from the sham.\n\n                              SLOANE\n               I'm thrilled, ma'am. I'm especially\n               looking forward to wearing those\n               jeans with the stretch panel in\n               front.\n\n     Mrs. Froeling thumbs through the bonds.\n\n                              TELLER\n               Are you hoping for a boy or\n               a girl?\n\n                              SLOANE\n               Actually, we're hoping for a car.\n\n     CU. CAMERON\n\n     He's spooked by the games playing. He scans the bank\n     nervously. He blinks, focuses, blinks again.\n\n     HIS POV\n\n     Joyce is with a MIDDLE-AGED COUPLE and their bored,\n     sour-puss teenage son, BOYD. He's sitting in a chair with\n     his legs slung over the sides waving a Bic lighter back and\n     forth across his rump. The parents are Joyce's clients from\n     Vermont. A LOAN OFFICER is discussing the local financing\n     situation with them. His is an open office adjacent to the\n     teller windows. Joyce's back is to the tellers.\n\n     CU. CAMERON\n\n     It's like he's just witnesses an ax murder.\n\n                              CAMERON\n               Shit...\n\n     INT. BANK. JOYCE\n\n     Her back is to the teller windows. She's conducting her\n     meeting. Behind her we see Cameron grab Ferris and point her\n     out to him. He waves. Cameron slaps his arm.\n\n     INT. BANK. TELLER WINDOW\n\n     Mrs. Froeling shows Ferris the savings bonds.\n\n                              TELLER\n               These bonds aren't mature. If you hold\n               onto them another two years you'll get\n               an additional four dollars...\n\n                              FERRIS\n               I'm aware of that.\n\n                              TELLER\n               You're throwing away four dollars.\n\n                              FERRIS\n               No, ma'am, I'm giving it to the\n               government. They need it. Do you\n               know what an aircraft carrier's\n               going for these days?\n\n     INT. BANK. JOYCE\n\n     She concludes her meeting. She shakes hands with the loan\n     officer and stands. The Vermont Couple stands. Boyd scrapes\n     the bottom of his shoe on the desk, leaving a glob of mud\n     behind and he stands. Joyce turns into the bank. Ferris,\n     Cameron and Sloane are gone. She escorts her customers out.\n\n     INT. BANK. DOOR\n\n     Joyce and the Vermont Couple approach the doors. Boyd lays a\n     luggie in the drinking fountain. Mrs. Froeling passes with\n     the savings bonds. She stops when she sees Joyce.\n\n                              JOYCE\n               Mrs. Froeling, how are you?\n\n                              MRS. FROELING\n               I passed a kidney stone Tuesday.\n                          (shifts gears, to Joyce)\n               Say, you must be very proud.\n\n     Joyce doesn't know what she's talking about.\n\n                              MRS. FROELING\n                          (whispers)\n               I met Madonna.\n\n     She pats Joyce on the arm.\n\n                              MRS. FROELING\n               She told me everything. Keep me posted,\n               I'll want to send a gift.\n\n     She toodles on her way. Joyce and the Vermont Couple are\n     completely baffled.\n\n 95  EXT. BANK                                                    95\n\n     Joyce and the Vermont Couple walk along the side of the\n     bank, heading for the parking lot. Boyd's tagging along\n     behind. He picks up a stone and hurls it into the parking\n     lot.\n\n                              JOYCE\n               My son's home sick today. If\n               you wouldn't mind, on our way\n               back to the office, I'd like\n               to just run in and check up on him.\n\n     We HEAR A METALLIC PING! as Boyd's missle hits a car.\n\n                              MOTHER\n               Of course.\n\n     They pass a show window. As they pass, we hold on the\n     window. It's promoting saving for college educations. A\n     mannequin father is congratulating his mannequin son in a\n     mortar and gown as a stiff Sloane, Ferris and Cameron look\n     on proudly.\n\n 96  INT. DEAN'S OFFICE                                           96\n\n     His secretary is dialing a number for him.\n\n                              SECRETARY\n               This is the Peterson's home.\n\n     She hands the phone to Rooney.\n\n                              SECRETARY\n               Watch your mouth this time.\n\n     Rooney glares at her.\n\n                              ROONEY\n               Ferris Bueller's behind this. There's\n               no doubt in my mind. That's what I was\n               saying this morning. Why he has to be stopped.\n               He's got Sloane Peterson involved in this\n               thing now. See?\n\n     The secretary nods.\n\n                              SECRETARY\n               And her grandmother, too.\n\n 97  CU. PHONE ANSWER MACHINE                                     97\n\n     It clicks on. We hear a grieved woman's voice. It sounds an\n     awful lot like Sloane.\n\n                              SLOANE\n               We can't come to the phone right now.\n               We've had a death in the family. If\n               you need to reach us we'll be at\n               the following number...\n\n 98  INT. DEAN'S OFFICE                                           98\n\n     Rooney quickly takes down a number.\n\n 99  EXT. CAMERON'S HOUSE                                         99\n\n     His answering machine clicks on. We hear Cameron's voice.\n\n                              CAMERON'S VOICE\n               You have reached the Coughlin Bros.\n               Mortuary. We are unable to come to\n               the phone right now but if you'll leave\n               your name and number...\n\n100  INT. DEAN'S OFFICE                                          100\n\n     Rooney hangs up the phone.\n\n                              ROONEY\n               Something's going on, goddamn it.\n\n     The secretary's looking at a newspaper on Rooney's desk.\n     She's not listening to him.\n\n                              SECRETARY\n               There's a railroad strike.\n\n                              ROONEY\n               And I'm going to stop it!\n\n                              SECRETARY\n               My brother-in-law'll appreciate it.\n\n     Rooney looks at her, puzzled.\n\n                              ROONEY\n               What?\n\n                              SECRETARY\n               My brother-in-law rides the train\n               to work.\n\n     Rooney stares at her like she's crazy.\n\n                              ROONEY\n               Who gives a good goddamn?\n\n101  EXT. EDENS EXPRESSWAY                                       101\n\n     The major thoroughfare into the city of Chicago from the\n     suburbs. The Ferrari streaks past. In the distance we see\n     the Sears Tower, the Hancock Building and the Standard Oil\n     Building.\n\n102  INT. SCHOOL. HALLWAY                                        102\n\n     Jeanie's walking down the hall. She's stopped by a KID with\n     a Coke can.\n\n                              KID\n               Yo. We're collecting money to\n               buy Ferris Bueller a new kidney.\n\n     Jeanie stares at him. She's flabbergasted at the proportions\n     her brother's scan has reached.\n\n                              KID\n               They run about fifty g's so it\n               you could help out...\n\n                              JEANIE\n               Go piss up a flagpole!\n\n                              KID\n               Huh?\n\n     She knocks the can out of his hands and storms down the hall.\n     The kid yells after her.\n\n                              KID\n               Hey, babe! Some day you might\n               need a favor from Ferris Bueller!\n               Then where'll you be?!\n\n     He reaches for the can.\n\n                              KID\n               Heartless wench...\n\n103  EXT. CHICAGO LOOP. PARKING GARAGE                           103\n\n     The Ferrari pulls into a large parking garage.\n\n     EXT. GARAGE\n\n     Ferris, Sloane and Cameron get out. Cameron's having fits.\n\n                              CAMERON\n               We can't leave the car here!\n\n                              FERRIS\n               Why not?\n                              CAMERON\n               Because we can't! I want it back\n               home where it belongs!\n\n                              SLOANE\n               What could happen to it?\n\n                              CAMERON\n               It could get stolen, wrecked, scratched,\n               you name it.\n\n                              FERRIS\n               I'll give the guy a five to watch it.\n\n                              CAMERON\n               What guy?\n\n     CU. PARKING ATTENDANT\n\n     He smiles with relish at the car. 6'6\", 240. An IQ that\n     equals his hourly wage. Shoulder-length hair stuffed into a\n     hairnet Gold teeth. Earring. Goatee.\n\n     EXT. PARKING LOT\n\n     The Attendant swaggers over to the car. Ferris slips him a\n     give.\n\n                              FERRIS\n               You speak English?\n\n                              ATTENDANT\n               Since I was three.\n\n                              FERRIS\n               Great. I want to you take extra special\n               care of this vehicle, okay?\n\n     He pats the Attendant on the arm. He smiles.\n\n                              ATTENDANT\n               Like it's a beautiful woman.\n\n                              FERRIS\n               I appreciate it.\n\n     The Attendant very gingerly gets into the car. Ferris turns\n     to Cameron. The Ferrari pulls into the lot very slowly, very\n     carefully. No squealing tires, no revving engine.\n\n                              FERRIS\n               See what a finski can do to\n               a person's attitude? He's going\n               to treat it like a beautiful\n               woman.\n\n                              CAMERON\n               Yeah, sure. Whip it with a stick\n               and piss on the hood.\n\n                              SLOANE\n               Oh, please, Cameron. Do you have to\n               be so graphic?\n\n     She heads down the street.\n\n                              SLOANE\n               This is so right!\n\n     Ferris nudges Cameron on. They exit the garage and head\n     after Sloane. A long beat and the Ferrari creeps down the\n     exit ramp of the garage. It's gone in the entrance and out\n     the exit. Another attendant jumps in the passenger side.\n     He's skinny, tall, with a huge knit hat willed with dreads.\n     He lets out a spirited laugh and the Ferrari peels out of\n     the lot. It heads down the street away from Sloane, Ferris\n     and Cameron.\n\n104  EXT. FERRIS' HOUSE                                          104\n\n     Joyce's care pulls in the driveway. She gets out and heads up\n     the house.\n\n105  INT. FERRIS' ROOM                                           105\n\n     It's dark. There's a figure in the bed. We hear soft\n     snoring. A wire runs from under the bed covers to the closet\n     door to the door to the room itself.\n\n     INT. ROOM. DOOR KNOB\n\n     The wire is tied to the doorknob. It's taut. Downstairs, we\n     hear a door open and close.\n\n106  INT. HOUSE. STAIRWAY                                        106\n\n     Joyce quietly walks up the stairs.\n\n107  INT. HOUSE. HALLWAY                                         107\n\n     Joyce comes up the stairs and crosses to Ferris' room. She\n     listens at the door. WE HEAR THE SNORING.\n\n     CU. DOORKNOB\n\n     Joyce slowly turns the doorknob and pushes the door open a\n     crack.\n\n     HER POV\n\n     The door opens and the figure-like lump in the bed moves.\n\n     CU. JOYCE\n\n     She smiles and closes the door.\n\n108  INT. ROOM. CLOSET                                           108\n\n     The closet door is open. The wire from the bedroom door is\n     strung over the top of the closet door. A trophy is attached\n     to the end of the wire and it's resting on a yard stick. As\n     the bedroom door closes, the trophy lifts up off the\n     yardstick and the lump in the bed goes back down to it's\n     original position.\n\n     CU. FERRIS' SYNTHESIZER\n\n     Little LED's are lighting up to the rhythm of the snoring.\n     The snoring it simulated.\n\n109  INT. HALLWAY                                                109\n\n     Joyce listens at the door another beat. She's smiles with\n     relief and affection.\n\n110  EXT. SEARS TOWER. LATER                                     110\n\n     HELICOPTER SHOT moves in on the world's tallest building. As\n     it passes we see three figures pressed against the windows.\n\n                              FERRIS (VO)\n               This is the world's tallest building.\n               From our vantage point here on the\n               103 floor, we are provided with a\n               view of four states.\n\n                              CAMERON (VO)\n               Do you think the car's alright?\n\n                              FERRIS (VO)\n               Illinois, Michigan, Wisconsin and\n               my personal favorite, Indiana.\n\n111  INT. SEARS TOWER OBSERVATION DECK                           111\n\n     Ferris, Cameron and Sloane are standing against the window.\n\n                              CAMERON\n               I don't feel good, Ferris. Are\n               we gonna stay long?\n\n                              FERRIS\n               Take a step back...\n\n     Ferris steps back. Sloane and Cameron follow suit.\n\n                              FERRIS\n               Now, lean against the glass. Like\n               this...\n\n     He leans forward, putting all his weight on his forehead.\n\n                              FERRIS\n               And look down.\n\n     Sloane leans forward. Cameron follows, reluctantly.\n\n                              SLOANE\n               Oh, shit!\n\n     HER POV\n\n     The street far, far below. A dizzying view.\n\n     INT. OBSERVATION DECK\n\n     The three are leaning against the glass.\n\n                              SLOANE\n               What if the glass gives?\n\n                              FERRIS\n               Death.\n\n                              SLOANE\n               Cool.\n\n     CU. CAMERON\n\n     He's looking down.\n\n                              CAMERON\n               I think I see my Dad.\n\n112  EXT. STREET LEVEL                                           112\n\n     A middle-aged man, Cameron's father, HORACE FRYE, is\n     standing on the street corner. He's lean, clean, tough and\n     humorless. He's wearing a puzzled look on his face.\n\n                              CAMERON'S FATHER\n               I think I see my car.\n\n     HIS POV\n\n     The Ferrari screams down the avenue and disappears down the\n     underground ramp.\n\n113  INT. SEARS TOWER LOBBY                                      113\n\n     Ferris and Sloane bound down the escalator. Cameron follows\n     glumly. They dance past the giant Calder mobile. They're\n     singing.\n\n                              FERRIS AND SLOANE\n               I BEEN ALL 'ROUND THIS GREAT BIG WORLD\n               AND I'VE SEEN ALL KINDS OF GIRLS\n               YEAH, BUT I COULDN'T WAIT TO GET\n               BACK IN THE STATES\n               BACK TO THE CUTEST GIRLS IN THE WORLD\n               I WISH THEY ALL COULD BE CALIFORNIA\n               I WISH THEY ALL COULD BE CALIFORNIA\n\n114  EXT. STREET                                                 114\n\n     Ferris and Sloane burst out the doors garnering the annoyed\n     stares of the business people busily going in and out of the\n     building. Cameron politely waits his turn to exit. Ferris\n     and Sloane head down the street. Cameron follows.\n\n                              FERRIS AND SLOANE\n               I WISH THEY ALL COULD BE CALIFORNIA GIRLS!\n\n115  EXT. CHICAGO MERCANTILE EXCHANGE                            115\n\n     Giant old monolith.\n\n116  INT. CHICAGO MERCANTILE EXCHANGE. TRADING ROOM              116\n\n     Traders are frantically buying and selling commodities.\n\n117  INT. GALLERY                                                117\n\n     Ferris, Cameron and Sloane are sitting in the gallery\n     watching the proceedings.\n\n                              SLOANE\n               Do you love me?\n\n                              FERRIS\n               Do you love me?\n\n                              SLOANE\n               I asked you first.\n\n                              FERRIS\n               Yes. You?\n\n                              SLOANE\n               Yes.\n\n                              FERRIS\n               Would I trash a day of education to\n               be with you if I didn't love you?\n\n                              SLOANE\n               Yes.\n\n                              FERRIS\n               Would I risk damaging a deep and\n               wonderfully enriching relationship\n               with my parents if I didn't love you?\n\n                              SLOANE\n               Yes.\n\n                              FERRIS\n               Would I have introduced you as my wife\n               if I didn't love you?\n\n                              SLOANE\n               Wait a minute. That was a lie.\n\n                              FERRIS\n               True.\n\n     Ferris puts his arm around Sloane.\n\n                              FERRIS\n               Would you want to get married? I\n               mean if I wasn't an asshole.\n\n                              SLOANE\n               Sure.\n\n                              FERRIS\n                          (serious)\n               Today?\n\n     Sloane stares at him. Is he serious.\n\n                              FERRIS\n               I'm game.\n\n                              SLOANE\n               No way!\n\n                              FERRIS\n               I'll do it, if you will.\n\n     Cameron suddenly adds his two cents.\n\n                              CAMERON\n               You need a blood test.\n\n     Ferris looks around at him.\n\n                              FERRIS\n               Huh?\n\n                              CAMERON\n               If your blood's not compatible,\n               you could produce a pinhead. The\n               state requires a blood test.\n\n                              FERRIS\n               So?\n\n                              CAMERON\n               So, you can't get married today.\n\n                              FERRIS\n               Tomorrow?\n\n                              CAMERON\n               If you get a blood test today.\n\n                              SLOANE\n               I'm not getting married.\n\n                              CAMERON\n               I'm with you, babe.\n\n                              FERRIS\n               Why not?\n\n                              SLOANE\n               What do you mean, why not? Think\n               about it.\n\n                              FERRIS\n               Besides being too young and your\n               father hating my guts and not\n               having any place to live and feeling\n               awkward about being the only cheer-\n               leader with a husband, give me a\n               good reason why not.\n\n                              CAMERON\n               I'll give you two. My mother and\n               father.\n\n     Ferris and Sloane look at him curiously.\n\n                              CAMERON\n               They're married and they hate each other.\n                          (to Ferris)\n               You've seen them. Am I right?\n\n                              FERRIS\n               You're father's a toad and your\n               Mom's always wired out, but so what?\n               They're old. That's natural.\n\n                              CAMERON\n               It makes me puke. Seeing people\n               treat each other like that. It's\n               like the car. He loves the car.\n               He hates his wife.\n\n                              SLOANE\n               My parents are divorced. So what?\n               It's not like it doesn't happen\n               ten thousand times a day.\n\n                              CAMERON\n               Just because it happens doesn't\n               make it right. Are you comfortable\n               with it?\n\n                              SLOANE\n               No. It's not something I can get comfortable\n               with. I've tried. Are yours divorced?\n\n                              CAMERON\n               They may as well be.\n\n                              SLOANE\n               Do you think they're staying together\n               because of you?\n\n     Cameron hasn't seen it that way. He shrugs.\n\n                              SLOANE\n               Do they like you?\n\n     It hasn't occured to Cameron that his parents might not like\n     him. That parental love might not be a given.\n\n                              CAMERON\n               Yeah. Sure.\n\n                              SLOANE\n               Consider this...my father canned me\n               and my brother and my Mom for a\n               twenty five year old dipso with fake\n               tits. He dropped us like a rock. Everything\n               was cool at our house. I thought so.\n               We all thought so. Then BLAM! It's over.\n\n                              FERRIS\n                          (to CAMERA)\n               This is all news to me. She keeps a\n               pretty good secret.\n\n                              SLOANE\n                          (to Cameron)\n               It was pure selfishness. When I have\n               a kid, I don't care how much I want\n               something, if it's gonna screw-up the\n               kid, forget it.\n\n                              FERRIS\n                          (to CAMERA)\n               She's not lying.\n\n                              CAMERON\n               You could change.\n\n                              SLOANE\n               Yeah. But I'm gonna try not to.\n               I'm gonna think about it. I'm\n               gonna try to prevent it.\n\n                              FERRIS\n               This is optomism. It's a common\n               trait with my age group. Adults\n               think it's cute, it's like a charming\n               quick that infests youth. But it's\n               a cool thing and I think, deep down,\n               crusty old shits wish they had some.\n               They wish they had her, too.\n                          (points to Sloane)\n               Sorry. She's taken.\n\n                              CAMERON\n               I'd rather not have my family break\n               apart, thank you.\n\n                              SLOANE\n               Well, you know what? It ain't up\n               to you. It's out of your hands.\n\n                              CAMERON\n               So, I in other words, I should just\n               sit back and watch it crumble?\n\n                              SLOANE\n               You're merely an inhabitant in their\n               universe.\n\n                              FERRIS\n               Frightening choice of words.\n\n                              SLOANE\n               They call the shots. When you split\n               from them, you call the shots.\n\n                              CAMERON\n               So, you're saying I should run away?\n\n                              FERRIS\n               No. She's saying it's time for lunch.\n\n                              SLOANE\n               What?\n\n                              FERRIS\n               Let's go feed Cameron.\n\n     They stand up and head out. Ferris hangs back a moment. He\n     cups his hands to his mouth. He yells at the top of his\n     voice.\n\n                              FERRIS\n               BUY!\n\n     And he exits. Cool and casual.\n\n118  INT. CHICAGO MERCANTILE EXCHANGE.  TRADING FLOOR            118\n\n     It explodes with activity in response to Ferris' shout.\n     We HEAR A RADIO ANNOUNCER.\n\n                              ANNOUNCER\n               Commodity prices rose sharply today\n               in unusually heavy trading...\n\n119  EXT. RESTAURANT                                             119\n\n     A French restaurant on the Gold Coast.  It's noon.\n\n120  INT. RESTAURANT                                             120\n\n     Ferris, Sloane and Cameron are standing in the restaurant.\n     Ferris is looking at the maitre 'd's reservations book.\n\n     HIS POV\n\n     His fingers runs down to a party of three for 12:00.\n\n     INT. RESTAURANT\n\n     The maitre'd returns.\n\n                              MAITRE'D\n                          (to Ferris)\n               May I help you?\n\n                              FERRIS\n               Yes. I'm Abe Frohman. Party of\n               three for 12:00.\n\n     The maitre'd looks at Ferris curiously.\n\n                              FERRIS\n               Is there a problem?\n\n                              MAITRE'D\n               You're Abe Frohman?\n\n                              FERRIS\n               I'm Abe Frohman.\n\n                              MAITRE'D\n                          (chuckles)\n               I'm sorry, son. I'm very busy right\n               now. If you have trouble finding the\n               door...\n\n     Sloane tugs Ferris' sleeve. He ignores her.\n\n                              FERRIS\n               Are you suggesting that I'm not\n               who I say I am?\n\n                              MAITRE'D\n               Shall I call the police?\n\n                              CAMERON\n               Let's go...Abe.\n\n                              FERRIS\n               I'm not going anywhere.\n                          (to the Maitre'd)\n               Call the police. Go ahead. Better\n               yet...\n                          (grabs the phone)\n               ...I'll call myself.\n\n     Cameron chokes. Sloane grits her teeth. The maitre'd smiles\n     smuggly.\n\n     CU. PHONE\n\n     Ferris punches out a number. A beat and the restaurant's\n     second line lights up and the phone rings.\n\n     INT. RESTAURANT\n\n     The maitre'd motions for the phone so that he can answer the\n     call. Ferris waves him off angrily.\n\n                              FERRIS\n               You touch me and I yell \"rat!\"\n               There's another phone around here.\n               Find it.\n\n     The maitre'd backs off.\n\n                              CAMERON\n               Ferris, let's split, please?\n\n                              SLOANE\n               Cameron's right. We're gonna\n               get busted.\n\n                              FERRIS\n               Not a chance in the world.\n\n     He hands the phone to Sloane.\n\n                              FERRIS\n               Ask for Abe Frohman.\n\n     INT. RESTAURANT. LATER\n\n     Ferris, Sloane and Cameron are seated in the restaurant. The\n     maitre'd is hovering over Ferris.\n\n                              MAITRE'D\n               I appreciate your understanding.\n\n                              FERRIS\n               Don't grovel, Charles. Just leave\n               us to our repast and all will be\n               forgotten.\n\n                              MAITRE'D\n               Enjoy your luncheon.\n\n                              FERRIS\n               Thank you.\n\n     The maitre'd backs away. Ferris smiles. Sloane is impressed.\n     Cameron is flushed with nerves.\n\n                              FERRIS\n               Darling, you were wonderful.\n\n                              SLOANE\n               Oh, but I had a wonderful teacher.\n\n                              FERRIS\n               Cameron, dear friend?\n\n     Cameron looks to Ferris.\n\n                              FERRIS\n               And you thought we wouldn't have\n               any fun. Shame on you.\n\n     Ferris disappears behind his menu.\n\n121  EXT. SCHOOL                                                 121\n\n     We HEAR HALLWAY SOUNDS AND JEANIE.\n\n                              JEANIE (VO)\n               Ferris Bueller's days are numbered.\n\n122  INT. GIRL'S LOCKER ROOM                                     122\n\n     Jeanie's sitting on a bench in a field hockey uniform. She's\n     talking to a FRIEND.\n\n                              JEANIE\n                          (mean, vicious)\n               I'm gonna bust his buns.\n\n                              FRIEND\n               Why? What's the point?\n\n                              JEANIE\n               Why? Because I'm sick of the little\n               dope. He manipulates my parents, he\n               does whatever he wants, whenever he\n               wants and he never gets nailed.\n                          (wicked pause)\n               Well, babe, today I'm the hammer.\n\n     She yanks angrily on the velcro strap on her sneakers. The\n     straps rip off in her hand.\n\n                              FRIEND\n               I think he's cute.\n\n                              JEANIE\n               Sweetie, it's an established fact that\n               you have no taste. Ferris is not cute.\n               He's not charming. He's not nice. He's\n               not a wonderful person. He's an ignorant\n               mule and the sooner everybody in this\n               school comes to that realization the\n               better off we'll all be.\n\n     She displays the velcro straps to her friend.\n\n                              JEANIE\n               See? My brother strokes you, you\n               sympathize with him, I get pissed\n               off and this is what happens!\n\n     Jeanie tosses the straps on the floor.\n\n                              JEANIE\n               Let me tell you something. I study\n               hard, I work hard, I'm polite, I'm\n               considerate, I'm friendly and fair\n               to all kinds of people. Except\n               morons. I try to be everything a\n               good, decent person should be and\n               you know what?\n\n                              FRIEND\n               Everybody thinks you're an asshole.\n\n     Jeanie freezes with her next sentence pinned to her tongue.\n\n                              JEANIE\n               Excuse me?\n\n                              FRIEND\n               I don't think you're an asshole.\n\n                              JEANIE\n               Who does?\n\n     Her friend smiles sheepishly.\n\n                              JEANIE\n               Rachel?\n\n     Jeanie's friend shrugs, wags her head, does everything but\n     verbally confirm.\n\n                              JEANIE\n               Rachel's a dirt bag. Who else?\n\n                              FRIEND\n               I don't know. Just forget it.\n\n                              JEANIE\n               Forget that everybody thinks I'm an\n               asshole? Would you like everybody to\n               think you're an asshole?\n\n                              FRIEND\n               Not everybody thinks you're an\n               asshole. Mr. Rooney likes you.\n\n                              JEANIE\n               Oh, hey. That's exciting. A fat\n               fifty year old clod with B.O.\n               likes me.\n\n     Jeanie shakes her head in disbelief.\n\n                              JEANIE\n               Would everybody be happier if\n               maybe I were to die in a flaming\n               car accident or something?\n\n                              FRIEND\n               Maybe if you didn't cat like and\n               asshole...\n\n                              JEANIE\n               Am I acting like an asshole?\n\n                              FRIEND\n               I didn't mean it that way.\n\n                              JEANIE\n               I this a conspiracy to shit all\n               over me or something? Is my brother\n               behind this? Tell me if he is or I'll\n               sock your tits.\n\n                              FRIEND\n               You really do have a problem, Jeanie.\n\n                              JEANIE\n               Me? I have a problem?\n\n                              FRIEND\n               Somebody who threatens to sock people's\n               tits has a problem.\n\n                              JEANIE\n               Alright. How about if I sock your\n               face?\n\n     Jeanie's friend gets up.\n\n                              FRIEND\n               Take a walk, Jeanie.\n\n     Her friend exits.\n\n                              JEANIE\n                          (yells after her)\n               If it means anything to you, I\n               have my period! MY BODY'S RIDDING\n               ITSELF OF OLD EGGS, GODDAMN IT!\n\n     She snarls and slumps against the lockers.\n\n                              JEANIE\n               He's gone. He's over. He's monkey meat.\n\n123  INT. MEN'S ROOM. CHEZ PAUL                                  123\n\n     Ferris is standing at the urinal.\n\n                              FERRIS\n               She's a person who views life as\n               an ordeal that must be endured. Her\n               body is a transport vehicle for her\n               anger. I don't know where she gets\n               this shit. Basically, the family's\n               pretty cool.\n\n     He looks down at the urinal.\n\n                              FERRIS\n               I wonder if everybody shoots at\n               cigarette butts in urinals? Probably\n               not many women.\n                          (continues)\n               I used to think that my family was\n               the only one that had weirdness\n               in it. It used to worry me. Then I\n               met Cameron and I saw how his\n               family functioned.\n\n     He zips this trousers and steps away from the urinal.\n\n                              FERRIS\n               Cameron's home life is really shit.\n               He wasn't lying. That's why he's sick\n               all the time. It really upsets him.\n               What he said about his parents hating\n               each other? I refuse to sleep over at\n               his house. His parents fight all the\n               time. Even when I'm there. Is there\n               anything worse than being at somebody's\n               house when their parents are fighting?\n               It's the absolute height of social\n               discomfort.\n\n     He checks his hair in the mirror.\n\n                              FERRIS\n               When they go after each other, Cameron\n               tightens up. It's scary. He gets so\n               wadded-up, you couldn't pry his buns\n               apart with a crowbar. The thing with\n               taking his old man's car? It's good\n               for him. It teaches him to deal with\n               his fear. Plus, and I must\n               be honest here, I love driving it.\n               I highly recommend picking one up.\n\n     He exists the men's room. We hold a beat. A toilet flushes.\n     Another beat and Tom walks out of the stall. He crosses to\n     the sink.\n\n124  INT. RESTAURANT                                             124\n\n     Cameron and Sloane have been served their lunches. They're\n     staring at the plates.\n\n                              CAMERON\n               What is it?\n\n                              SLOANE\n               I don't know. But it looks like\n               it's already been eaten and digested.\n\n                              CAMERON\n               I knew it was a mistake letting\n               Ferris order for us.\n\n     Ferris slides over to the table and drops into his seat.\n\n                              FERRIS\n               What are you doing?\n\n     Cameron looks at Ferris.\n\n                              CAMERON\n               What is this shit?\n\n                              FERRIS\n               You got me. I don't speak French.\n\n     He puts his napkin in his lap and smells his plate.\n\n                              FERRIS\n               I think it's a land-based beefoid\n               creature.\n\n     He takes a bite. He savors the taste.\n\n                              FERRIS\n               Splendid.\n\n                              CAMERON\n               Really?\n\n                              FERRIS\n               Superb.\n\n     Cameron and Sloane try theirs. They chew tentatively.\n\n                              FERRIS\n               Good?\n\n     Sloane and Cameron shrug. It's not bad. A WAITER passes.\n     Ferris stops him.\n\n                              FERRIS\n               Yo, Clouseau!\n\n     The waiter stops and looks at Ferris indignantly.\n\n                              FERRIS\n               I have a growth on my brain that\n               causes memory lapses. Could you\n               tell me what we ordered here?\n\n     The waiter glances at the plates.\n\n                              WAITER\n               Sweetbreads.\n\n                              FERRIS\n               Uh, huh. And what might that be?\n\n                              WAITER\n               Pancreas.\n\n                              FERRIS\n               As in the gland that has important\n               functions in digestion and metabolism?\n\n     CU. SLOANE AND CAMERON\n\n     They stop chewing. They're holding their sweetbreads in their\n     mouths.\n\n     CU. FERRIS\n\n     He continues his questioning.\n\n                              FERRIS\n               ...That secretes a thick, colorless fluid\n               containing digestive enzymes? The home\n               of the world famous isles of Langerhans?\n\n     CU. WAITER\n\n     He nods broadly, knowing that he's spoiling the kids' meal.\n\n     CU. SLOANE AND CAMERON\n\n     They look at each other.\n\n     CU. FERRIS\n\n     He pats his mouth with his napkin. He looks to Cameron and\n     Sloane. He raises a finger, holds it a beat and gives a cue.\n\n     CU. WAITER\n\n     He turns away as Sloane and Cameron spit out their food.\n\n     CU. FERRIS\n\n     He watches Sloane and Cameron then glances at the waiter.\n\n                              FERRIS\n               Check, please!\n\n125  EXT. RESTAURANT                                             125\n\n     Tom and his two GUESTS are standing at the curb, talking. A\n     cab is waiting. The door's open. In the B.G. Ferris, Sloane\n     and Cameron come out of the restaurant. They approach the\n     cab. Tom's back it to Ferris. Ferris stops cold.\n\n     FERRIS, SLOANE, CAMERON\n\n     They turns on cue at Tom, now in the B.G., turns toward the\n     restaurant.\n\n                              FERRIS\n               40,000 restaurants in the downtown\n               area and I pick the one my father\n               goes to.\n\n                              CAMERON\n               We're gonna get nabbed, for sure.\n\n                              FERRIS\n               No way, Cameron. Only the meek\n               get nabbed. The bold survive.\n               Let's go.\n\n     He turns to the cab. Sloane and Cameron turn slowly.\n\n     EXT. STREET. CAB\n\n     Tom and his party are still jawing at curbside. Ferris,\n     Sloane and Cameron slowly approach the cab. Behind the backs\n     of the men, Ferris scoots Sloane into the cab. Cameron\n     dashes in. The Ferris hops the cab.\n\n     INT. CAB\n\n     Ferris slams the door.\n\n     CU. CAB DOOR HANDLE\n\n     A man's hand reaches for the handle as the cab pulls away.\n\n     EXT. RESTAURANT\n\n     Tom and his guests watch in bewilderment at their cab takes\n     off. MUSIC COMES UP.\n\n126  EXT. MUSEUM OR SCIENCE AND INDUSTRY                         126\n\n     The grand old Chicago museum.\n\n127  INT. MUSEUM. OVERHEAD SHOT                                  127\n\n     The main gallery is crowded with school kids.\n\n     INT. MUSEUM. FLOOR\n\n     A class of kids walking along holding hands. Among the\n     second graders are Ferris, Sloane and Cameron, holding hands\n     looking like giant grade schoolers.\n\n     INT. MUSEUM. DISPLAY CASE\n\n     Baby chicks are hatching in a huge, round incubator. Sloane,\n     Ferris and Cameron are intently watching the process.\n\n     INT. MUSEUM. COAL MINE\n\n     Sloane, Ferris and Cameron ride in the coal train in the\n     coal mine replica. Ferris and Sloane are making out.\n\n     INT. MUSEUM. INDUSTRIAL DISPLAY\n\n     Sloane operates a metal press to produce a tin ashtray.\n\n     INT. MUSEUM. HEART REPLICA\n\n     A giant, walk-thru replica of a human heart. Ferris staggers\n     out of it, clutching his heart, feigning a massive heart\n     attack.\n\n     INT. GERMAN U-BOAT\n\n     Ferris is examining the controls of the captured U-Boat. He\n     checks to see if he's being watched then he presses a button\n     and pulls a lever.\n\n     CU. PROPELLER\n\n     For the first time in forty years, the screw turns.\n\n     CU. HUMAN FETUS IN A BOTTLE\n\n     The famous stages of life display which features bottled\n     fetuses. The ninth month. A tiny human being in a jar.\n\n     CU. SLOANE, FERRIS, CAMERON\n\n     Sloane wants to cry. Cameron's stomach is in his throat.\n     Ferris is lost in thought. The MUSIC ENDS.\n\n                              SLOANE\n                          (remorsefully)\n               I wonder if he has a name?\n\n                              FERRIS\n                          (blank)\n               Ninth Month.\n\n128  EXT. CHICAGO RIVER. LONG, HIGH SHOT                        128\n\n     From the Merchandise Mart, looking down the fetid, green\n     swath of water. A boat is rolling up the man-made canyon.\n\n                              CAMERON (VO)\n               Are you guys worried about nuclear war?\n\n                              FERRIS (VO)\n               Cameron, it's a beautiful day, we've\n               won our freedom, we're traveling down\n               one of American's most scenic polluted\n               waterways and you have to bring up\n               nuclear war?\n\n                              SLOANE (VO)\n               It is kind of raggy subject, Cam.\n\n                              CAMERON (VO)\n               Regardless. It's with us every day.\n               The possiblity of global destruction.\n\n                              SLOANE (VO)\n               Don't you think it's an issue because\n               people need something to worry about?\n               They have to like, have some major\n               problem that puts all their little\n               bullshit into some kind of persepective?\n\n                              CAMERON (VO)\n               Maybe.\n\n                              FERRIS\n               They used to have Viet Nam. They\n               used to have the oil crisis stuff\n               and Iran. That's over and people\n               have to have their big issue. It's\n               not like somebody came up with the\n               nuclear holocaust yesterday at\n               noon, you know.\n\n                              SLOANE (VO)\n               To answer your question...No, I'm not\n               worried about it at all.\n\n                              FERRIS (VO)\n               We don't know when the bombs going\n               off. We do know, however, that college\n               starts in the fall.\n\n                              CAMERON (VO)\n                          (dramatic, deadly serious)\n               Do you know what a nuclear winter is?\n\n     Long beat.\n\n                              SLOANE (VO)\n               Yeah. Everybody's dead, it's real\n               cold and the skiing's for shit.\n\n     The boat makes the turn in the river and CLEARS FRAME.\n\n     EXT. BOAT DOCK\n\n     The three are sitting on the aft deck of the tour boat.\n     Their feet are up on the railing. Very casual, very relaxed.\n     Discussing the end of the world.\n\n                              SLOANE\n               My step-father's always going off about\n               how when he was young he was committed to\n               all these causes.\n\n                              FERRIS\n               He's full of shit. All the old hippies\n               are full of shit.\n\n                              SLOANE\n               He says I don't care about things like\n               he did.\n\n                              FERRIS\n               What's he care about now?\n\n                              SLOANE\n               Baldness, fatty meats and money.\n\n                              FERRIS\n               I rest my case.\n\n                              CAMERON\n               What's spooky is they still control\n               everything. They took over when they\n               were young and they never gave it up.\n\n                              FERRIS\n               One of the most frightening experiences\n               of my young life has been observing\n               my parents and our neighbors playing\n               the Baby Boom Edition of Trivial Pursuits.\n               It's chilling to see people crazed with\n               the minutia of their past.\n\n                              CAMERON\n               It's human nature to like what you had\n               better than what you have.\n\n                              SLOANE\n               Agreed.\n\n     A loud speaker on the boat identifies a point of interest.\n\n                              LOUDSPEAKER\n               TO YOUR LEFT IT THE WORLD'S TALLEST\n               BUILDING...\n\n     The three look to the left.\n\n                              LOUDSPEAKER, FERRIS,\n                              SLOANE, CAMERON\n               The Sears Tower.\n\n                              CAMERON\n               You know, this is all very interesting\n               but I'm starving.\n\n                              FERRIS\n               An hour ago you wanted to yack.\n\n                              CAMERON\n               I feel better now.\n\n                              FERRIS\n               Lean over and grab a fish.\n\n     Cameron looks over the side of the boat. An obtuse thought\n     flashes through Sloane's brain.\n\n                              SLOANE\n               What comes after a nuclear winter?\n\n                              FERRIS\n               Nuclear spring.\n\n129  EXT. SCHOOL                                                 129\n\n     Meanwhile...\n\n130  INT. HALLWAY OUTSIDE THE DEAN'S OFFICE                      130\n\n     Jeanie is having a small moral debate with herself.\n\n                              JEANIE\n               It's reprehensible to squeal on\n               your own flesh and blood...but it's\n               for his own good. His cavalier\n               attitude will get him into trouble\n               later in life...and it'll continue\n               to piss me off and I'll get so\n               wadded-up that it'll cause cervex cancer\n               and he'll ruin my life. Screw him.\n\n     She slips into the Dean's outer office.\n\n131  INT. DEAN'S OUTER OFFICE                                    131\n\n     Rooney's secretary is behind her desk. Jeanie walks in. The\n     secretary looks up and greets her with a weary smile.\n\n                              SECRETARY\n               Hello, Jeanie. Who's bothering\n               you now?\n\n     Jeanie scowls at her.\n\n                              JEANIE\n               Is Dean Rooney in?\n\n                              SECRETARY\n               I'm sorry, he's out. Can I help you?\n\n                              JEANIE\n                          (condescending)\n               I seriously doubt it. When's he back?\n\n                              SECRETARY\n               I don't know. He left the grounds\n               on personal business.\n\n132  EXT. STREET. CU. CURB                                       132\n\n     A car tire rolls into FRAME and stops. Slide across to the\n     sidewalk. Rooney's dress shoe steps out onto the pavement.\n     Move up to reveal Rooney standing at the door of his\n     bile-green LeBaron. Rooney peels off his shades and looks\n     around like he's Dirty Harry. In his mind he is Dirty Harry.\n\n     CU. FIRE HYDRANT\n\n     Rooney's dres shoe on the hydrant. He ties his lace and\n     pulls up his sock.\n\n     EXT. STREET\n\n     Rooney straightens his tie and jacket and slips into a rowdy\n     hot dog joint.\n\n133  INT. HOT DOG STAND                                          133\n\n     It's jammed with construction workers, secretaries, suburban\n     businessmen. It's loud and confusing. Rooney pushes his way\n     in and scopes the crowd.\n\n     HIS POV\n\n     A young person is playing a video game in a far corner.\n\n     CU. ROONEY\n\n     He suspects it's Ferris. It look sort of like Ferris. He\n     smiles and cuts into the crowd.\n\n     CU. THE BACK OF THE VIDEO PLAYER'S HEAD\n\n     MOVE IN on the player.\n\n                              ROONEY (OC)\n               I've been waiting a long time\n               for this.\n\n     The player looks up.\n\n                              ROONEY (OC)\n               Your ass is mine.\n\n     The player turns around. It's a GIRL.\n\n     CU. ROONEY\n\n     The blood evacuates his face. He stares at the girl.\n\n     CU. GIRL\n\n     She stares at him. She picks up her Coke. She puts the straw\n     to her lips and sucks.\n\n     CU. ROONEY\n\n     He's still staring. He can't think of anything to say.\n\n     CU. GIRL\n\n     Holding the straw in the mouth, she draws it out of the cup.\n     She raises it, pointing it directly in Rooney's face.\n\n     CU. ROONEY\n\n     He squints\n\n     CU. GIRL\n\n     She blows a strawful of Coke in Rooney's face.\n\n     CU. NAPKIN HOLDER\n\n     A hand yanks a napkin hold.\n\n     INT. HOT DOG STAND. SERVICE COUNTER\n\n     Rooney wipes his face. Behind him is the kitchen and a\n     grease-covered TV set broadcasting a Cubs baseball game.\n     There's a long foul ball. The TV camera follows the ball\n     into the stands. A kid makes a stab at the ball. Rooney\n     wipes his suit off. The TV camera zooms in on the boy\n     triumphantly holding the foul ball aloft. It's Ferris.\n     He does a little celebration dance. Rooney wads up the\n     napkin and tosses it in a trashbin. The TV camera returns to\n     the game. Rooney glances at the screen.\n\n                              ROONEY\n               What's the score?\n\n                              HOT DOG MAN\n               Zero to zero.\n\n                              ROONEY\n               Who's winning?\n\n                              HOT DOG MAN\n               Cubs.\n\n     Rooney nods and exits.\n\n134  EXT. WRIGLEY FIELD. STANDS                                  134\n\n     Ferris sits down with the baseball. He shakes his stinging\n     paw. On either side of him are Cameron and Sloane. Cameron's\n     scarfing nachos.\n\n                              FERRIS\n               I think I broke my thumb.\n\n                              SLOANE\n               Can we leave now?\n\n                              FERRIS\n               You want to leave? We just got here.\n\n                              SLOANE\n               You got a call, you broke your thumb,\n               what's left to do?\n\n     Cameron offers his nachos to Sloane. She looks at them with\n     disgust.\n\n                              SLOANE\n               No wonder you're always sick.\n\n     Ferris leans back, puts his hands behind his head and turns\n     his face to the bright sun.\n\n                              FERRIS\n               Do you realize that if I played by\n               the rules, right now I'd be in gym?\n\n135  EXT. HIGH SCHOOL. PLAYING FIELD                             135\n\n     A boy's gym class is doing laps. A blue Fiat pulls into the\n     shot.\n\n136  INT. FIAT                                                   136\n\n     Jeanie's at the wheel. She sneaks a glance at the school.\n\n                              JEANIE\n               I can't believe my brother's making\n               me put myself in a position where I\n               could get expelled. Selfish little\n               moron.\n                          (pause)\n               Ferris? You're overshadowed\n               me long enough. I'm gonna get\n               you, buddy.\n\n     She puts the car in gear and drives out of the shot.\n\n137  EXT. STATE STREET                                           137\n\n     A parade is underway. Floats and politicians. Marching\n     bands, drum and bugle corps, soldiers, school kids. Figure\n     skating club in outfits and skates performing their routines\n     on pavement. It's GERMAN-AMERICAN APPRECIATION DAY.\n\n     EXT. STATE STREET. FLOAT\n\n     Riding atop on a float is Ferris. He's waving to the crowd.\n     He and half a dozen homely German-American Beauty Queens.\n     He's leading the girls in singing, \"DANKE SHOEN\".\n\n     EXT. STATE STREET. SLOANE AND CAMERON\n\n     They're watching Ferris go by. They wave to him.\n\n                              SLOANE\n               I love him.\n\n                              CAMERON\n               It's hard not to.\n\n     Cameron breaks a smile. As worried as he is about the day\n     and getting caught, he has to admire Ferris for his lack of\n     inhabitions. Cameron mumbles a few words.\n\n                              CAMERON\n               Stop...water...want...\n\n                              SLOANE\n               Do you believe in reincarnation?\n\n                              CAMERON\n               Huh?\n\n                              SLOANE\n               Do you believe that you lived before?\n\n                              CAMERON\n               Yeah. Sort of.\n\n                              SLOANE\n               DO you ever wonder what you were?\n\n                              CAMERON\n               I don't have to wonder. I know.\n\n     Sloane looks at him with amazement.\n\n                              CAMERON\n               I was a tractor tire.\n\n     EXT. STATE STREET. FLOAT\n\n     Ferris is on his knees, reaching down from the float,\n     shaking hands with people in the crowd.\n\n                              FERRIS\n               Guten tag, dude!\n\n     EXT. STATE STREET\n\n     Sloane and Cameron continue their conversation.\n\n                              CAMERON\n               What were you in a previous life?\n\n                              SLOANE\n               I'm not sure but I think I know\n               who Ferris was.\n\n                              CAMERON\n               Hannibal.\n\n                              SLOANE\n               From the A-Team?\n\n                              CAMERON\n               No. The guy who rode the elephants\n               into Switzerland.\n\n     Sloane laughs at herself. They step out of the crowd and\n     head down the street in the direction the parade's heading.\n\n                              SLOANE\n               I think if he was anybody, he\n               was Magellan. You know, the guy\n               who went around the world.\n\n     Cameron nods.\n\n                              SLOANE\n               I could see him ignoring popular\n               belief and taking off on some\n               impossible mission.\n\n                              CAMERON\n               Yeah. As long as I've known him,\n               everything works for him. There's\n               nothing he can't handle. I can't\n               handle anything. School, parents,\n               the future. Ferris can do anything.\n\n     EXT. STATE STREET. FLOAT\n\n     Ferris is playing \"TWIST AND SHOUT\" on the accordian. The\n     girls on the float are singing.\n\n                              FERRIS\n               WELL, SHAKE IT UP, BABY, NOW!\n\n                              GIRLS\n               SHAKE IT UP, BABY\n\n                              FERRIS\n               TWIST AND SHOUT!\n\n                              GIRLS\n               TWIST AND SHOUT!\n\n                              FERRIS\n               COME ON, COME ON, COME ON, BABY ON!\n               COME ON AND WORK IT ON OUT!\n\n                              GIRLS\n               WORK IT ON OUT!\n\n     EXT. STREET. SLOANE AND CAMERON\n\n     They continue their conversation.\n\n                              SLOANE\n               The future's worse for a boy, isn't\n               it?\n\n     Cameron doesn't understand what she means.\n\n                              SLOANE\n               A girl can always bail out and\n               have a baby and get some guy\n               to support her.\n\n                              CAMERON\n               That's a pretty grim thought.\n\n                              SLOANE\n               True, but it's an option. No options\n               is worse.\n\n                              CAMERON\n               I don't know what I'm gonna do.\n\n                              SLOANE\n               College.\n\n                              CAMERON\n               Yeah, but to do what?\n\n                              SLOANE\n               What are you interested in?\n\n                              CAMERON\n               Nothing.\n\n                              SLOANE\n               Me either.\n\n     They walk on for a few beats. We HEAR \"TWIST AND SHOUT\"\n     GROWING LOUDER AND LOUDER. The sons is taking over all the\n     other tunes in the band. It's infecting the entire parade.\n\n                              CAMERON\n               What do you think Ferris is gonna\n               do?\n\n     EXT. STATE STREET. MARCHING BAND\n\n     They're playing TWIST AND SHOUT.\n\n     EXT. STREET. MOUNTED POLICE OFFICER\n\n     He's singing.\n\n                              POLICE OFFICER\n               YOU KNOW YOU LOOK SO GOOD!\n\n     EXT. STREET. PUNKS\n\n     A band of PUNKS are dancing on the roof of a news kiosk.\n\n                              PUNKS\n               LOOK SO GOOD!\n\n     EXT. STREET MOTHER AND HER CHILDREN\n\n     A WOMAN and her two TODDLERS sing along.\n\n                              WOMAN\n               YOU KNOW YOU LOOK SO FINE!\n\n                              TODDLERS\n               LOOK SO FINE!\n\n     EXT. STREET. BLACK TEENAGER\n\n     He's wearing a shower cap and a maroon overcoat.\n\n                              TEENAGER\n               COME ON AND TWIST A LITTLE CLOSER!\n\n     EXT. STREET. OLD NEWSPAPER SELLER\n\n     He singing along.\n\n                              NEWSPAPER SELLER\n               TWIST A LITTLE CLOSER!\n\n     EXT. STREET. CHOIR GROUP\n\n     They're marching down the parade. They're singing in their\n     angleic voices.\n\n                              CHOIR\n               AND LET ME KNOW THAT YOU'RE MINE!\n\n     EXT. STREET. STREET CLEANERS\n\n     With their brooms ready...\n\n                              STREET CLEANERS\n               KNOW THAT YOU'RE MINE!\n\n     EXT. STREET. DECK\n\n     The entire parade is singing and playing \"TWIST AND SHOUT\".\n\n     EXT. STREET. VIEWING STAND\n\n     The POLITICIANS and their WIVES stand up.\n\n                              POLITICIANS AND WIVES\n               AH!\n\n     EXT. STREET. VIEWING STAND\n\n     The CLERGYMEN stand.\n\n                              CLERGYMEN\n               AH!\n\n     EXT. STREET. VETERANS\n\n     Marching in formation and in WWII uniforms.\n\n                              VETERANS\n               AH!\n\n     EXT. STREET. FLOAT\n\n     Ferris leads the Beauty Queens in the rousing finale.\n\n                              FERRIS\n               AH!\n\n     EXT. STREET. WIDE AND HIGH\n\n     The entire parade is at frenzy pitch.\n\n                              PARADE\n               AHHHHH!\n\n     The SOUND OF THE VOICES blends with the SOUND OF A RED-LINED\n     HIGH PERFORMANCE ENGINE.\n\n138  EXT. CALUMET CITY                                           138\n\n     The Port of Chicago. Grim, gritty waterfront. Suddenly,\n     Cameron's father's car flies OVER CAMERA. Like the opening\n     shot in Star Wars. The Starship Ferrari. SLO-MO.\n\n     CU. FERRARI UNDER-CARRIAGE\n\n     It travels past to reveal a beautiful blue sky. SLO-MO.\n\n     CU. PARKING ATTENDANT\n\n     His eyes are wide with exhilaration. Mouth open, tongue out.\n     Maniac at the wheel. SLO-MO.\n\n     CU. RASTAMAN\n\n     His eyes are closed. Big smile. SLO-MO,\n\n     EXT. STREETS. KIDS\n\n     They're looking up in the air, following the car as it flies\n     over them. Broad, excited smiles. The car's shadow passes\n     over them. SLO-MO.\n\n139  CU. CAR GRILLE                                              139\n\n     It fills the frame and stops. We MOVE UP to reveal Rooney\n     behind the wheel of his car.\n\n     EXT. FERRIS' HOUSE\n\n     Rooney gets out of his car. He looks at the house, looks up\n     and down the street, then crosses to Ferris' house.\n\n140  INT. HOUSE. FOYER                                           140\n\n     Rooney's at the front door. We see him peek in a window at\n     the top of the door. The doorbell rings.\n\n141  INT. HOUSE. FERRIS' ROOM. COMPUTER                          141\n\n     It acknowledges the doorbell.\n\n     CU. CASSETTE PLAYER\n\n     It clicks on.\n\n142  EXT. HOUSE. FRONT PORCH                                     142\n\n     The house intercom activates. We HEAR FERRIS' VOICE.\n\n                              FERRIS\n               Who is it?\n\n     Rooney presses the intercom.\n\n                              ROONEY\n               This is Ed Rooney, Ferris. I'd\n               like to have a word with you.\n\n                              FERRIS' VOICE\n               I'm sorry I can't come to the door\n               right now. I'm very ill and I'm\n               afraid that in my weakened condition,\n               I could take a nasty spill down the\n               stairs and subject myself to further\n               school absenses.\n\n     There's a pause. Rooney presses the intercom again.\n\n                              ROONEY\n               B.S. Come down here.\n\n                              FERRIS' VOICE\n               You can reach my parents at their\n               places of business. Thank you for\n               stopping by. I appreciate your concern\n               for my well-being. It will be remembered\n               long after this illness has past.\n\n     His voice clicks off. Rooney presses the intercom again.\n\n                              ROONEY\n               I'm not leaving until you come\n               down and talk to me.\n\n                              FERRIS' VOICE\n               Have a nice day.\n\n     Rooney presses the intercom.\n\n                              ROONEY\n               I'm not leaving, Ferris.\n\n     There's no response. Rooney rings the doorbell again. The\n     pre-recorded litany starts over.\n\n                              FERRIS' VOICE\n               Who is it?\n\n     Rooney doesn't realize that he's listening to a recording.\n\n                              ROONEY\n               Don't get smart with me Ferris!\n\n                              FERRIS' VOICE\n               I'm sorry I can't come to the door\n               right now. I'm very ill and I'm\n               afraid that in my weakened condition...\n\n     Rooney leans back from the door. He can't quite figure out\n     what's going on. But's it's highly suspicious.\n\n143  INT. HOUSE. LIVING ROOM                                     143\n\n     Rooney steps through the hedges and peeks in the windows. We\n     HEAR FERRIS' VOICE inside.\n\n                              FERRIS' VOICE\n               You may reach my parents at their\n               places of business.\n\n144  INT. HOUSE. KITCHEN                                         144\n\n     Rooney tries to peak in the kitchen window.\n\n                              FERRIS' VOICE\n               I appreciate your conern for my\n               well-being. It will be remembered\n               long after...\n\n145  EXT. HOUSE. BACKDOOR                                        145\n\n     A black rubber doggie door. The type that allows a dog to\n     come and go as it pleases. Rooney is crouched down. He lifts\n     the doggie door and peeks in the house.\n\n     HIS POV\n\n     Along the kitchen floor. Through the kitchen, into the\n     dining room. We hear a LARGE DOG GROWL.\n\n     CU. ROONEY\n\n     He's peaking through the door. He hears the dog. His face\n     freezes.\n\n                              FERRIS\n               Have a nice day.\n\n     EXT. HOUSE. DOGGIE DOOR\n\n     A Rottweiler bursts through the doggie door in a fury of\n     gnashing teeth and foam.\n\n146  CU. LARGE BREASTS                                           146\n\n     Tassled pasties twirl like airplane propellers.\n\n     CU. CAMERON, FERRIS AND SLOANE\n\n     They're sitting in a booth in the garish, nearly deserted\n     strip joint. Cameron's mouth is open in amazement. Sloane is\n     embarrassed and revolted.\n\n                              CAMERON\n               How does she do that? One goes\n               one way, one goes the other.\n\n                              FERRIS\n               She's probably schizophrenic.\n\n                              SLOANE\n               Ferris, this is nauseating me.\n               Really. I'm losing respect for\n               you by the bucket.\n\n                              FERRIS\n               You don't think it's amazing that\n               we got in?\n\n                              SLOANE\n               Who wants to get in?\n\n                              FERRIS\n               Cameron looks like a toddler, for\n               Christ's sake. I'm talking about\n               a major achievement in false\n               identification.\n\n                              SLOANE\n               I'm not interested in watching\n               someone jiggle their mammary glands.\n\n                              FERRIS\n               Point well taken. But consider why\n               she does it. Why she does it and\n               you don't.\n\n                              SLOANE\n               I'm not a tramp.\n\n                              FERRIS\n               Maybe her life fell apart. Maybe she\n               lost somebody. A lover. A boyfriend.\n               A parent. A child...\n                          (to CAMERA)\n               This kind of thing makes me a little\n               depressed. You may think because I'm\n               the age I am that I'm a sex maniac.\n               That sex is all I think about.\n               But that's not true. I'm a romantic.\n               I think alot of people my age are.\n               We think about love and matters of\n               the heart. And SAT scores and acne\n               aside, we worry about lonliness. It's\n               a terrible thing. And we feel it. I\n               feel it.\n\n     He flips his collar up, curls his lip and affects an Elvis\n     impression. A sappy, do-wop track FADES UP. The club lights\n     go down. Cameron and Sloane disappear into darkness. Ferris\n     stands up from the booth. He strolls slowly through the\n     empty club as the stripper bumps and grinds in a pool of\n     blue light.\n\n                              FERRIS\n               You know, someone said the world's a\n               stage and each must play a part.\n               Fate had me playing in love, with you\n               as my sweetheart. Act one was when we\n               met. I loved you at first glance. You\n               read your lines so cleverly and never\n               missed a cue. Then came act two. You\n               seemed to change. You acted strange.\n               And why, I've never known.\n\n     He climbs up on the little runway. The stripper disappears\n     in darkness as Ferris takes over the spotlight.\n\n                              FERRIS\n               Honey, you lies when you said you\n               loved me and I had no cause to\n               doubt you. But I'd rather go on\n               hearing your lies than to go on\n               living without you. Now, the stage\n               is bare and I'm standing there with\n               emptiness all around and if you won't\n               come back to me, then they can bring\n               the curtain down...\n\n     Elvis fades up. The orignal recording. Ferris lip synchs\n     with the big, dramatic florish that was the King's trademark\n     ballad sign-off.\n\n                              ELVIS\n               IS YOUR HEART FILLED WITH PAIN?\n               SHALL I COME BACK AGAIN?\n               TELL ME DEAR, ARE YOU LONESOME TONIGHT?\n\n     Ferris drops his head. Like the King would.\n\n147  EXT. DOWNTOWN STREET. CAMERON'S CAR                         147\n\n     Cameron's father is looking at the car. He's studying it. It\n     looks terribly familiar. He leans into the open car and\n     reaches for the glovebox to see if the contents will confirm\n     if it's his. He freezes. He looks up slowly.\n\n     HIS POV\n\n     The Attendant and the Rastaman are glowering at him. They're\n     holding bags of fried chicken.\n\n                              ATTENDANT\n               You looking for something in my\n               car?\n\n     CU. CAMERON'S FATHER\n\n     He shakes his head, no.\n\n                              CAMERON'S FATHER\n               No.\n\n148  EXT. FERRIS' TOWN. JEANIE                                   148\n\n     Jeanie's standing at her car. She's staring incredulously\n     into the distance. Her mouth's open. She's shaking her head\n     slowly.\n\n     HER POV\n\n     Spray-painted on the town water tower in gigantic black\n     letters -- SAVE FERRIS BUELLER.\n\n     CU. JEANIE\n\n     She's furious.\n\n                              JEANIE\n               I'm gonna microwave his nuts...\n\n149  EXT. MICHIGAN AVENUE                                        149\n\n     Afternoon traffic.\n\n150  INT. TAXI CAB                                               150\n\n     Ferris, Sloane and Cameron in the backseat of a checker.\n     Ferris is on one window, Cameron on the other. Sloane's in\n     the middle. Ferris is talking to the DRIVER.\n\n                              FERRIS\n               So...\n\n     He leans forward and reads the driver's name off the city\n     license.\n\n                              FERRIS\n               So, Yuri, how long have you been\n               in America?\n\n                              DRIVER\n               One year.\n\n                              FERRIS\n               What's your overall impression?\n\n                              DRIVER\n               It's very good here.\n\n                              FERRIS\n               Better than Russia?\n\n                              DRIVER\n               Much better here than in Russia.\n\n                              FERRIS\n               Clearly you've never been to an\n               American high school.\n\n     Ferris sits back. He puts his arm around Sloane.\n\n                              CAMERON\n               It's getting late, Ferris. I have\n               to get the car home. I know you\n               don't care, but it means my ass.\n\n                              FERRIS\n               You think I don't care?\n\n                              CAMERON\n               I know you don't care.\n\n                              FERRIS\n               That hurts, Cameron.\n\n                              SLOANE\n               Jump back, Ferris, Cameron's been\n               a good sport.\n\n                              FERRIS\n               Cameron, what'd you see today?\n\n     Cameron looks at him.\n\n                              FERRIS\n               You saw four states, a submarine,\n               a giant heart, seventy five dollars\n               worth of cooked pancreas, two of the\n               most incredible breasts ever to come\n               out of modern plastics, major\n               league baseball and...\n                          (quizical look)\n               Are you gonna chuck your nachos?\n\n     Cameron's staring past Ferris. He's frozen. Ferris realizes\n     he's looking at something out the window. He turns. He\n     freezes.\n\n     HIS POV\n\n     In the gridlock traffic, their cab is squeezed tight\n     alongside another cab. In that cab is Tom. He's about a foot\n     from Ferris. He turns and looks right into CAMERA.\n\n     TOM'S POV\n\n     Ferris' frozen face.\n\n     FERRIS' POV\n\n     Tom glances back at his paper. He pauses. Looks up. Thinks.\n     Turns back to CAMERA.\n\n     TOM'S POV\n\n     Sloane is sitting where Ferris was. She's wearing\n     sunglasses, looking bored. She turns and glances out the\n     window. Fakes a yawn.\n\n     HER POV\n\n     Tom stares at her. He's baffled. He looks away.\n\n     INT. CAB. FLOOR.\n\n     Cameron and Ferris are on the floor. On their asses, with\n     their backs to the back of the front seat, feet up on the\n     seat.\n\n                              FERRIS\n                          (to Sloane)\n               What's he doing?\n\n                              SLOANE\n                          (revolted)\n               He's looking at me and he's licking\n               the glass and making obscene gestures\n               with his hands.\n\n                              FERRIS\n               What?!\n\n     Sloane bursts out laughing.\n\n                              SLOANE\n               Roast!\n\n     She licks her finger and touches Ferris knee. She makes a\n     sizzling sound. She collapes on the seat in hysterics.\n\n     INT. TOM'S CAB\n\n     Tom's looking into Ferris' cab.\n\n     HIS POV\n\n     Sloane's bouncing up and down.\n\n     CU. TOM\n\n     He can't quite figure out what's going on. He turns and\n     slowly raises his newspaper over his face. We see on the\n     back of the paper a small story with the headline: COMMUNITY\n     RALLIES AROUND SICK YOUTH.\n\n151  EXT. FERRIS' HOUSE. BACKYARD. DOG                           151\n\n     The Rottweiler's chewing on a shoe. Tearing it apart.\n\n     EXT. BACKYARD. ROONEY\n\n     He's standing outside the fence. He's missing a shoe. His\n     suit pants are torn from the crotch to the knee. His suit\n     coat pocket is torn off. His hair's messed and there're\n     grass-stains on his knees and elbows. He's looking in at the\n     dog.\n\n                              ROONEY\n               That's a $28.00 dress shoe, you\n               worthless mutt!\n\n     HIS POV\n\n     The Rottweiler leaps at CAMERA.\n\n152  EXT. CITY STREET                                            152\n\n     Ferris is leading the way down Michigan Avenue. He's\n     hustling through the crowd. He has Sloane by the hand. She's\n     jogging to keep up. Cameron's a few steps behind. He keeps\n     bumping into people. Ferris and Sloane make the turn at\n     Wacker Driver and disappear into the Stone Container\n     Building. Cameron follows, mumbling again.\n\n                              CAMERON\n               Money...tits...please...\n\n153  EXT. HOUSE. FRONT                                           153\n\n     A florist truck pulls up in front of the house. A DELIVERY\n     MAN gets out iwth a huge floral arrangement. He heads up to\n     the house.\n\n154  EXT. HOUSE. PORCH                                           154\n\n     Rooney's sitting on the porch patting a bloody knee with his\n     handkerchief. The delivery man hops up on the steps. Rooney\n     looks up at him. He greets Rooney cheerily.\n\n                              DELIVERY MAN\n               Howdy!\n\n     He presses the doorbell. A beat and we hear Ferris'\n     recording.\n\n                              FERRIS' VOICE\n               Who is it?\n\n     The Deliver Man presses the intercom.\n\n                              DELIVERY MAN\n               Focus on Flowers. I have a delivery.\n\n                              FERRIS' VOICE\n               I'm sorry but I can't come to the\n               door right now. I'm very ill and I'm\n               afraid...\n\n               ROONEY                              FERRIS' VOICE\n     It's a recording, asshole.        ...that in my weakened\n                                       condition, I could take a\n               DELIVERY MAN            nasty spill and subject\n     What's your problem?              myself to further school\n                                       absenses...\n               ROONEY                        (pause)\n     He's one of my students.          You can reach my parents\n                                       at their places of\n               DELIVERY MAN            business. Thank you for\n     Little bugger's dying.            stopping by. I appreciate\n                                       your concern for my well-\n               ROONEY                  being. It will be\n     What?                             remembered long after\n                                       this illness has passed.\n\n                          DELIVERY MAN\n               As I heard it from our mailman\n               he was supposedly born with only\n               half a kidney.\n\n                              FERRIS' VOICE\n               Have a nice day.\n\n                              DELIVERY MAN\n                          (to the intercom)\n               Thank you.\n                          (continues)\n               I don't know the details. But my\n               boss had to send to Milwaukee to\n               get more orchids. He's very\n               popular.\n\n     Rooney is flabbergasted.\n\n                              DELIVERY MAN\n               Nobody's home here?\n\n                              ROONEY\n               No.\n\n                              DELIVERY MAN\n               You gonna be around for awhile?\n\n                              ROONEY\n               I imagine so.\n\n                              DELIVERY MAN\n               You wanna keep an eye on these?\n\n     Rooney looks at the flowers. Then he looks at the Delivery\n     Man.\n\n                              DELIVERY MAN\n                          (happy sigh)\n               It really touches me that so many people\n               are rallying behind this guy. I guess\n               there's hope for the human race afterall.\n\n     He hands the arrangement to Rooney.\n\n                              DELIVERY MAN\n               Gotta run.\n\n     He bounds off the porch and trots to the truck. Rooney looks\n     incredulously at the arrangement. He opens the attached\n     card.\n\n                              ROONEY\n                          (defeated)\n               Oh, Christ...\n\n     CU. CARD\n\n     It's signed:\n\n               ALL OUR BEST FOR A SPEEDY RECOVERY\n               THE ENGLISH DEPT. FACULTY AND STAFF\n\n155  INT. RADIO STATION STUDIO                                   155\n\n     The number one afternoon FM rock'n roll D.J. is sitting\n     behind his microphone.\n\n                              D.J.\n               I don't know who that was or\n               what they were playing but I\n               apologize for it nonetheless.\n                          (pause)\n               I have a guest with me today...\n\n156  INT. STUDIO. FERRIS                                         156\n\n     He put his headphones on.\n\n157  EXT. FERRIS' HOUSE                                          157\n\n     Jeanie's car pull in the driveway. We hear her car radio.\n\n                              D.J.\n               His name is Ferris Mueller.\n\n                              FERRIS\n               Bueller. Ferris Bueller.\n\n     INT. CAR. JEANIE\n\n     She goes into shock. Her eyes blink, her head cocks.\n\n                              D.J.\n               Sorry about that.\n\n                              FERRIS\n               It's cool.\n\n     Jeanie draws back and punches out her radio.\n\n     CU. CAR ANTENNA\n\n     The impact of her blow to the radio shoots the antenna in\n     the air.\n\n158  INT. STUDIO                                                 158\n\n     Ferris leans forward and adjusts the microphone.\n\n                              D.J.\n               He has an incredible story.\n\n     Ferris turns to CAMERA.\n\n                              FERRIS\n               I'm going to tell a massive lie here.\n               It's going to by very thick and very\n               steamy. I think radio's a facinating\n               medium, it challenges the imagination.\n               Unlike television which provides the\n               images, radio...\n                          (pause)\n               You know this. Anyway, it's always been\n               a dream of mine to be on the radio.\n               I have what I consider to be an excellent\n               broadcast voice. I practise it in the\n               bathroom all the time. I used to play\n               records and do introductions to them.\n               But I've never had the chance to sit\n               behind a microphone and try it out\n               for real. This is a 50,000 watt outlet.\n               I'm going out to several million people\n               so let me just say, I'm in a very pleasant\n               groove right now.\n                          (clears his voice,\n                           speaks into the\n                           mike, affects a\n                           \"radio\" voice)\n               Well, Steve, you and your listeners are\n               probably not going to believe this but...\n\n159  INT. SCHOOL                                                 159\n\n     A group of kids are sitting around a blaster.\n\n                              FERRIS' VOICE\n               ...I'm the first Chicago area youth\n               to be selected to participate in\n               a space shuttle mission.\n\n160  INT. STUDIO                                                 160\n\n     Ferris turns from the mike to CAMERA.\n\n                              FERRIS\n               I was going to say I knew Springsteen's\n               home phone number and I was going\n               to give out the number of the New\n               Jersey State Police but I thought I\n               might get busted. After I got flunked\n               in driver's ed for sideswiping a mail\n               box, which was not in any way, shape\n               or from my fault. I was putting out a\n               cigarette, like I was told. It was weird.\n               I'm so used to getting in a car and\n               lighting up, because I'm not allowed to\n               smoke at home, that I got in the driver's\n               ed. car and spaced completely, pulled out\n               of the lot, lit up a 'boro and Mrs. Heller\n               looked at me like I'd just pulled a bunny\n               out of my nose or something and I realized\n               what the hell I was doing and I went to\n               put it out and hit the mail box. Anyway,\n               I was so pissed off at her reaction to\n               the whole thing that I considered running\n               an ad in a sleaze magazine for a school\n               teacher that does phone sex and I was gonna\n               use Mrs. Heller's home number but is cost\n               too much. I took it again and passed. But\n               I had to work at Burger King to get the\n               cash to pay for the driver's ed. car. The\n               car got fixed in auto shop for nothing and\n               I think Rooney pocketed the cash. But I\n               can't prove it? I'm in high school, remember?\n\n     He turns back to the DJ.\n\n                              D.J.\n               How did you get picked for this.\n\n                              FERRIS\n               It's kind of a long story but I've\n               been doing alot of programming for\n               NASA.\n\n161  INT. SCHOOL. HALLWAY                                        161\n\n     A even larger group of kids is listening to the blaster.\n     They're cheering him on.\n\n162  EXT. FERRIS' HOUSE. BACKYARD                                162\n\n     The Rottweiler is laying unconscious on the lawn. The flower\n     arrangement is scattered all over the yard and the ceramic\n     vase the flowers were in has obviously struck the dog. The\n     broken pieces are all around the dog's head.\n\n     EXT. FERRIS HOUSE. BACKYARD. ROONEY\n\n     He's smiling with great satisfaction.\n\n                              ROONEY\n               Sleep tight, pooch.\n\n     He hears something in the house. His head snaps around. He\n     drops down and peek in the windows.\n\n     HIS POV\n\n     A glimpse of a fleeting figure.\n\n     CU. ROONEY\n\n     His eyes dance in anticipation of revenge.\n\n163  INT. HOUSE. FERRIS' ROOM                                    163\n\n     Jeanie kicks the door open. The yardstick flings the covers\n     and the pillows beneath them in the air. She stomps in and\n     turns off the snoring synthesizer.\n\n                              JEANIE\n               I knew it!\n\n     She grabs the phone and sits down. She dials a number.\n\n164  EXT. HOUSE. FRONT                                           164\n\n     Rooney sneaks around the side of the house. He slinks up on\n     the porch. The front door's open. He peeks in.\n\n165  INT. FERRIS' ROOM                                           165\n\n     Jeanie's on the phone.\n\n                              JEANIE\n               Is Mrs. Bueller there? Where is she?\n               This is her daughter. Do you know where\n               she is? Do you know when she'll be back?\n               Do you know anything?\n\n     She slams the phone down.\n\n                              JEANIE\n               The worm has luck like clams\n               have body odor...\n\n     She's startled by a noise downstairs. A smile spreads across\n     her face. He's back and she's going to nail him.\n\n166  INT. HOUSE. FOYER                                           166\n\n     Rooney sneaks into the house. He looks around the foyer and\n     heads into the kitchen.\n\n167  INT. HOUSE. UPSTAIRS HALLWAY                                167\n\n     Jeanie tiptoes down the stairs.\n\n168  INT. HOUSE. KITCHEN                                         168\n\n     Rooney sneaks through the kitchen into the den.\n\n169  INT. HOUSE. FOYER                                           169\n\n     Jeanie comes down the stairs into the foyer.\n\n170  INT. HOUSE. KITCHEN                                         170\n\n     Rooney comes out of the den, back into the kitchen. He\n     crosses back toward the foyer.\n\n171  INT. FOYER                                                  171\n\n     Jeanie sneaks into the kitchen.\n\n172  INT. KITCHEN                                                172\n\n     Jeanie and Rooney come face-to-face. Jeanie squeals in\n     horror. She doesn't recognize Rooney as himself but as an\n     intruder. She drops into a karate stance and kicks Rooney in\n     the face. He hits the deck. She flees back up the stairs.\n\n173  INT. CAR                                                    173\n\n     Boyd is sitting in the backseat of Joyce's car listening to\n     the radio.\n\n                              FERRIS' VOICE\n               My input on the Star Wars defense\n               plan was pretty substantial so I\n               guess this is their way of rewarding\n               me. I'm pretty flattered.\n\n     EXT. CAR\n\n     Joyce and her clients leave a show house and head toward the\n     car.\n\n     INT. CAR\n\n     Boyd looks out the window as his parents and Joyce appear.\n\n                              D.J. VOICE\n               Can you stay around and take a few\n               phone calls?\n\n                              FERRIS' VOICE\n               I'd really like to but I have a kidney\n               operation in about an hour.\n\n     EXT. CAR\n\n     Joyce and her clients take one last look at the house.\n\n                              JOYCE\n               If you're willing to commit a\n               little time and a little money\n               to this place, you can really\n               have something to be proud of.\n               Don't let the black living room\n               throw you off.\n\n     She opens the car door.\n\n     INT. CAR\n\n     The door opens.\n\n                              D.J. VOICE\n               I wish you the best of luck.\n\n                              FERRIS' VOICE\n               Thanks, Steve.\n\n                              D.J. VOICE\n               A very interesting guy, Ferris Bueller.\n\n     Joyce gets in. The clients get in the other side. A song\n     starts.\n\n                              JOYCE\n                          (to the kid)\n               Well, Boyd, how are you bearing\n               up?\n\n     The kid stares at her.\n\n                              JOYCE\n               Did I tell you I have a son\n               your age?\n\n                              BOYD\n               Twice.\n\n                              JOYCE\n               His name is Ferris. I think you'd\n               like him.\n\n     Boyd sits up in the seat at the mention of Ferris' name.\n\n                              BOYD\n               Is he going up in the space shuttle\n               in September?\n\n     Joyce looks around at Boyd. She gives him a curious look.\n\n                              JOYCE\n               Not that I know of.\n\n                              BOYD\n               I knew he was bullshitting.\n\n                              MOTHER\n               Watch your mouth.\n\n                              BOYD\n               How do you watch your mouth?\n\n                              JOYCE\n               Do you know my son?\n\n                              FATHER\n               Don't pay any attention to him.\n               He thinks it's cute to bait adults.\n\n                              BOYD\n               I don't think it's cute. I think\n               it's fun.\n\n     Joyce give him a puzzled smile and starts the car.\n\n174  INT. FERRIS' ROOM                                           174\n\n     Jeanie's on the phone. She's in a panic.\n\n                              JEANIE\n               This is not a phoeny phone call. There's\n               an intruder, male caucasian, possibly armed,\n               certainly weird, in our kitchen.\n                          (pause)\n               My name is Bueller.\n\n     There's another pause. Jeanie's face drops.\n\n                              JEANIE\n               It's real nice that you hope my\n               brother's feeling better but I'm\n               in danger, okay? I'm very cute,\n               I'm very alone and I'm very\n               protective of my body. I'd rather\n               not have it violated or killed.\n               I need help!\n\n175  INT. KITCHEN                                                175\n\n     Rooney's plugging his bloody nose with paper towel. The\n     intercom goes on.\n\n                              JEANIE'S VOICE\n               Excuse me. If whoever's in the house\n               is still in the house, I'd like you\n               to know that I have just called the police.\n               If you have any brains whatsoever, you'll\n               get your ass out of my house real quick.\n\n     Rooney stiffens with fear.\n\n                              JEANIE'S VOICE\n               I'd also like to add that I have\n               my father's gun. And a scorching\n               case of herpes.\n\n176  EXT. STREET                                                 176\n\n     Rooney's car is hooked to a tow truck. It's parked in front\n     of a fire hydrant and the windshield is decorated with\n     parking citations. In the distance SIRENS WAIL.\n\n177  EXT. PARKING LOT                                            177\n\n     The three are waiting for the Ferrari. We HEAR TIRES\n     SQUEALING, AN ENGINE REVING-OUT. Then the Ferrari pulls down\n     the ramp and jams to a frightening stop. A BLACK GUY jumps\n     out. Ferris hands him the parking stub.\n\n                              FERRIS\n               Just out of curiosity, what was\n               your top speed coming down the\n               ramp?\n\n                              BLACK GUY\n                          (matter-of-fact)\n               About 60.\n\n                              FERRIS\n               Stunning!\n\n     He hands him a buck and opens the door and pulls the\n     passenger seat forward for Cameron.\n\n                              FERRIS\n               This is probably the last time you'll\n               have to ride back here. Keep that in\n               mind.\n\n     Cameron gives him a look and squeezes in.\n\n178  EXT. DOWNTOWN STREET                                        178\n\n     The Ferrari cruises through traffic.\n\n     INT. FERRARI\n\n     Sloane's in the passenger seat. Ferris is driving and\n     Cameron is crammed in the back.\n\n                              SLOANE\n               What's next.\n\n                              CAMERON\n               Nothing. We return the car.\n\n                              SLOANE\n               We could go to my house. My parents\n               aren't coming home until late.\n\n                              FERRIS\n               We have enough cash left for a quick\n               flight to Peoria and back.\n\n                              CAMERON\n               Very funny.\n\n     Ferris looks in the mirror and changes lanes. He glances\n     down at the speedometer, then to the road. And back to the\n     speedometer.\n\n                              FERRIS\n               Cameron? How many miles did you\n               say this thing had when we left?\n\n                              CAMERON\n               One hundred and twenty six and\n               halfway between three and four\n               tenths. Why? How many miles are\n               on it now?\n\n     He glances down at the speedometer.\n\n     CU. SPEEDOMETER\n\n     The odometer reads 432.7.\n\n                              FERRIS\n                          (to CAMERA)\n               Here's where Cameron goes berserk.\n\n     EXT. TRAFFIC\n\n     The Ferrari pulls up at a stop light. We HEAR A THUNDERING,\n     MUFFLED SCREAM.\n\n     EXT. EXPRESSWAY\n\n     The Ferrari is buzzing through traffic.\n\n     INT. FERRARI\n\n     Sloane turns in her seat and looks at Cameron. Her gesture\n     is one of genuine support.\n\n                              SLOANE\n               You okay?\n\n     CU. CAMERON\n\n     His eyes are frozen in a mindless, vacant stare.\n\n     CU. FERRIS\n\n     He looks at Sloane. He's concerned.\n\n                              FERRIS\n               Hey, Cameron. It's okay. We'll fix\n               it.\n\n     CU. CAMERON\n\n     He's still holding the stare. He starts to breathe heavily.\n     He's trembling.\n\n     CU. SLOANE\n\n     She whips around in the seat and grabs his arms.\n\n                              SLOANE\n               Cameron! Cut it out! What's\n               wrong?! Ferris!\n\n     CU. FERRIS\n\n     He shoots Sloane a look.\n\n                              FERRIS\n               Cameron, are you okay? It's\n               no problem, really. Your old\n               man won't know a thing. It's\n               completely fixable.\n\n     INT. FERRARI\n\n     Sloane fires an angry look at Ferris.\n\n                              SLOANE\n               Shut-up! It is a problem! For\n               him it's a problem. Nothing's\n               a problem for you. But it's\n               a problem for him! So, just\n               shut-up.\n\n     She turns back to Cameron.\n\n                              SLOANE\n               What can I do, Cameron?\n\n     CU. FERRIS\n\n     Eyes front. He knows what he's doing.\n\n179  INT. FERRIS' HOUSE. FOYER                                   179\n\n     The doorbell rings. The Ferris' tape is activated.\n\n                              FERRIS VOICE\n               Who is it?\n\n     We hear a MALE VOICE over the intercom.\n\n                              VOICE\n               Anybody home?\n\n                              FERRIS' VOICE\n               I'm sorry that I can't come to\n               the door right now...\n\n     The tape continues as Jeanie hurtles down the stairs.\n\n                              JEANIE\n               I'm saved! Thank you, God!\n               Thank you, thank you, thank you!\n\n     She jumps the last few stairs and slides to the front door.\n     She whips it open.\n\n180  EXT. HOUSE. FRONT DOOR                                      180\n\n     The door swings open.\n\n                              JEANIE\n               Thank...you...\n\n     Her jaw goes slack. She blinks her eyes.\n\n     HER POV\n\n     The Delivery Man and a young ASSISTANT are standing at the\n     door with floral arrangements. Spread all around them are\n     more flowers. A sexy singing NURSE and a BALLOON MAN steps\n     up on the porch.\n\n                              NURSE\n                          (sings)\n               WE HOPE YOU'RE FEELING BETTER\n               WE HOPE YOU'RE FELLING FIT\n               WE...\n\n     The door slams shut.\n\n181  EXT. NEIGHBORHOOD STREET                                    181\n\n     Rooney's walking down the street. A school bus is crawling\n     alongside him as kids hang out the windows. From inside we\n     hear SHOUTING and seventeen different SONGS PLAYING ON\n     BLASTERS. A top forty montage.\n\n                              KID\n               Hey, Mr. Rooney! What're you doing?\n\n     Rooney doesn't respond.\n\n                              ANOTHER KID\n               Did you get in a fight?\n\n     Rooney keep walking. The bus doors open. The DRIVER calls\n     out to him.\n\n                              DRIVER\n               You want a lift?\n\n     Rooney takes a few more steps. He stops. The bus stops.\n     Rooney takes a deep breath. He climbs aboard the bus.\n\n182  INT. BUS                                                    182\n\n     The bus is jammed with WONKS and WEINERETTES. The passengers\n     are silent as they watch Rooney shuffle down the aisle and\n     take an empty seat next to a skinny, myopic GIRL.\n\n     CU. GIRL\n\n     She looks at Rooney and smiles. She pushes her Coke bottle\n     glasses up on her nose.\n\n     CU. ROONEY\n\n     He looks vacantly at her.\n\n     CU. GIRL\n\n     She holds her smile.\n\n                              GIRL\n               I'll bet you never smelled a\n               real school bus before.\n\n     CU. ROONEY\n\n     He stares at her.\n\n     CU. GIRL\n\n     She holds up a candy package.\n\n                              GIRL\n               Gummi Bear?\n\n     CU. ROONEY\n\n     He stares at her.\n\n     CU. GIRL\n\n     She puts one in her mouth.\n\n                              GIRL\n               They've been in pocket. They're\n               real soft and warm.\n\n     CU. BOY\n\n     A rotund FRESHMAN BOY sitting across from Rooney is staring\n     at him.\n\n     CU. ROONEY\n\n     He looks across to the kid.\n\n     CU. BOY\n\n     He leans forward.\n\n                              FRESHMAN BOY\n               It's kind of like being in the\n               belly of the beast isn't it?\n\n     CU. ROONEY\n\n     He turns him eyes to the front. The bus jerks forward and\n     pulls away.\n\n183  EXT. BUS                                                    183\n\n     It grinds through the gears as it heads down the quiet\n     street. The BLASTERS go back on, the SHOUTING RESUMES.\n\n184  EXT. PARK                                                   184\n\n     Cameron's laying on a picnic table. Sloane's sitting beside\n     him on the table. She's stroking his hair. Ferris WALKS INTO\n     THE FOREGROUND. He addresses CAMERA.\n\n                              FERRIS\n               This may very well be for real. I\n               think Cameron might have blown a\n               micro-chip or two. He's always been\n               a little keyed-up. All I wanted to do\n               was give him a good day. We're\n               gonna graduate in a couple of months.\n               Then we have the summer. He'll work\n               and I'll work. And we'll see each\n               other at night and on the weekends\n               but then he'll go to one school and I'll\n               go to another. And basically that'll\n               be it. As much as we like each other,\n               the process of growing up will\n               separate us.\n\n     He begins to walk. We follow him.\n\n                              FERRIS\n               Sloane's a bigger problem. She still\n               has another year of high school. How\n               do I deal with that? I was serious when\n               I said I'd marry her. I would. This isn't\n               just teenage infatuation. That's what my\n               parents call it. What do they call what they\n               have? If that's love, I'll take infatuation.\n\n     CU. CAMERON\n\n     His eyes are closed. Sloane's stroking his hair.\n\n                              FERRIS (VO)\n               Cameron's never been in love. At\n               least no one's ever been in love\n               with him. He's gonna marry the first\n               girl he lays. And she's gonna treat\n               him like shit because he's gonna\n               kiss her ass for giving him what he's\n               built-up in his mind as the end-all,\n               be-all of human existance. She won't\n               respect him because you can't respect\n               someone who kisses your ass. It just\n               doesn't work.\n\n     CU. SLOANE\n\n     She's studying Cameron's face. She looks away.\n\n                              SLOANE\n               Ferris?\n\n     CU. FERRIS\n\n     He looks to the picnic table. Then back to CAMERA.\n\n                              FERRIS\n               I'm being tested here.\n\n     He starts back to the picnic table.\n\n                              FERRIS\n               My best friend has flipped-out.\n               Conventional wisdom would suggest\n               a visit to the nearest trauma\n               center. I wouldn't fault anybody\n               for doing that. My, personally,\n               I think this calls for something\n               new, something bold, something wet\n               and wild.\n\n185  CU. JACUZZI JET                                             185\n\n     UNDERWATER SHOT. A hyrdojet spews a gush of air bubbles.\n\n     CU. BLASTER\n\n     A finger pushes the PLAY button on the cassette. MUSIC COMES\n     UP.\n\n     CU. BEER CAN LID\n\n     The finger pops a beer.\n\n     CU. OREO PACKAGE\n\n     A painted fingernail pierces the cellophane wrapper.\n\n     INT. JACUZZI\n\n     Ferris and Sloane are in Sloane's parents' Jacuzzi. Their\n     clothes are tosssed around the deck. Cameron's been placed\n     in a patio chair at the edge of the Jacuzzi. He's still\n     catatonic. He's mummbling softly. Ferris is drinking a beer.\n     Sloane's eating Oreos.\n\n                              FERRIS\n               You feeling any better, Cameron?\n\n                              SLOANE\n               The water's really nice. I wish\n               you'd come in.\n\n     CU. CAMERON\n\n     Staring into space.\n\n                              CAMERON\n               Surgery...fire...move...\n\n     CU. SLOANE AND FERRIS\n\n     They look at each other. She offers him a cookie. He offers\n     her his beer.\n\n                              FERRIS\n               Cameron? Do you think this because\n               of the car or is it a combination\n               of everything shitty in your life?\n\n     CU. CAMERON\n\n     He doesn't respond.\n\n                              CAMERON\n               Music...kiss...attack...\n\n     CU. SLOANE AND FERRIS\n\n     Sloane sips the beer.\n\n                              FERRIS\n               You just can't deal with anymore\n               shit? The car took you into the\n               red zone? Time for a reality check?\n\n                              SLOANE\n               Cameron? I could flip real easy, too.\n               There's nothing wrong with it. At one\n               time or another, everybody goes to\n               the zoo.\n\n                              FERRIS\n               Maybe he was actually sick. Maybe\n               he wasn't bullshitting himself.\n\n     CU. CAMERON\n\n     No response.\n\n                              CAMERON\n               Gesundheit...God...mercy...\n\n     EXT. BACKYARD\n\n     Ferris and Sloane watch their catatonic friend.\n\n     CU. CAMERON\n\n     He smiles.\n\n     CU. SLOANE\n\n     She leans forward and stares at Cameron.\n\n     CU. FERRIS\n\n     He cocks his head, wondering what Cameron's up to.\n\n     CU. CAMERON\n\n     He keels over forward.\n\n     EXT. BACKYARD\n\n     Cameron falls out of the chair and splashes down,\n     face-first, into the water. Sloane screams. Ferris leaps for\n     him.\n\n     UNDERWATER\n\n     Ferris struggles with Cameron's lifeless bulk.\n\n     CU. SLOANE\n\n     She's screaming. Ferris thrashes around in the water.\n\n     UNDERWATER\n\n     Ferris grabs Cameron's collar and rips him out of the water.\n\n     EXT. BACKYARD\n\n     Ferris sits Cameron on the edge of the Jacuzzi.\n\n                              FERRIS\n               CAMERON!\n\n     CU. CAMERON\n\n     His eyes are closed. He's lifeless.\n\n     CU. FERRIS\n\n     His face is a mask of terror. He shakes Cameron.\n\n     CU. SLOANE\n\n     She's screaming.\n\n     CU. CAMERON\n\n     A smile spreads across his face.\n\n     CU. FERRIS\n\n     He sees the smile. He stops shaking Cameron.\n\n     EXT. JACUZZI\n\n     Ferris and Cameron are looking at each other. Sloane's still\n     screaming. She realizes that Cameron's okay. She stops\n     screaming.\n\n                              SLOANE\n               What?\n\n                              FERRIS\n                          (Cameron)\n               You asshole!\n\n     Cameron's smiling.\n\n                              SLOANE\n               What?\n\n     Ferris starts to laugh. Cameron explodes with laughter.\n     Sloane's bewildered.\n\n                              SLOANE\n               What's so funny?\n\n186  INT. POLICE STATION. WAITING ROOM                           186\n\n     Jeanie's sitting on a wooden bench with a WASTED TEENAGE BOY\n     in a Triumph t-shirt, long hair, torn jeans, creepers, studs\n     and chains. He's studying her.\n\n                              BOY\n               Drugs?\n\n                              JEANIE\n               No, thank you. I'm straight.\n\n                              BOY\n               I meant, are you here for drugs?\n\n     Jeanie stares at him.\n\n                              JEANIE\n               Why are you here?\n\n                              BOY\n               Drugs.\n\n                              JEANIE\n               I don't know why I'm here.\n\n                              BOY\n               Then why don't you go home?\n\n                              JEANIE\n               Why don't you put your thumb\n               up your butt?\n\n     The boy stares at her.\n\n                              BOY\n               You want to talk about your problem?\n\n                              JEANIE\n               With you? Are you serious?\n\n                              BOY\n               Yeah, I'm serious.\n\n                              JEANIE\n               Blow yourself.\n\n     Jeanie turns away. The boy crosses his legs. Jeanie looks\n     back at him.\n\n                              JEANIE\n               You really want to know what's wrong?\n\n     The boy shrugs.\n\n                              JEANIE\n               Alright. If you've got the time,\n               I've got the troubles. In a nutshell,\n               I hate my brother. How's that?\n\n                              BOY\n               That's cool. Did you shoot him or\n               something?\n\n                              JEANIE\n               No, not yet.\n\n     The boy nods. He understands the emotion.\n\n                              JEANIE\n               I went home to confirm that the\n               shithead was ditching school and\n               a guy broke into the house and I\n               called the cops and they picked me\n               up for making a phoney phone call.\n\n                              BOY\n               What do you care if your brother\n               ditches school?\n\n     Jeanie stares at the boy.\n\n                              JEANIE\n               Why should he get to ditch school\n               when everybody else has to go?\n\n                              BOY\n               You could ditch.\n\n                              JEANIE\n               I'd get caught.\n\n                              BOY\n               So, you're pissed at him because\n               he ditches and doesn't get caught?\n\n                              JEANIE\n               Basically.\n\n     The boy nods knowingly.\n\n                              BOY\n               Then your problem is you.\n\n                              JEANIE\n               Excuse me?\n\n                              BOY\n               Excuse you. You oughta spend a little\n               more time dealing with yourself and\n               a little less time worrying about\n               what your brother does. It's just\n               an opinion.\n\n     Jeanie stares angrily at him. Partly because he's so bold\n     and partly because he's so right.\n\n                              BOY\n               There's somebody you should talk\n               to.\n\n     Jeanie stares at him threateningly.\n\n                              JEANIE\n               If you say Ferris Bueller, you lose\n               a testicle.\n\n                              BOY\n               You know him?\n\n     CU. JEANIE'S HAND\n\n     It curls into a fist.\n\n187  CU. FERRARI TIRE                                            187\n\n     It's spinning rapidly.\n\n     CY. ACCELERATOR\n\n     A brick's resting on the accelerator, holding it down.\n\n     INT. CAMERON'S GARAGE\n\n     Ferris, Cameron and Sloane are sitting in the garage. The\n     Ferrari is jacked up. The wheels are turning. The engine's\n     racing.\n\n                              CAMERON\n               The whole time I was just thinking\n               things over. I was like, meditating.\n               I was thinking about the future.\n               And I realized it doesn't make\n               and difference if the present\n               goes to shit.\n\n                              FERRIS\n               I have a agree with you there.\n\n                              SLOANE\n               Really.\n\n                              CAMERON\n               I've been thinking all day that if\n               you could only have the use of one\n               word, what would it be?\n\n                              FERRIS\n               Sloane is naked before your eyes and\n               you're thinking about words?\n\n                              SLOANE\n               God bless you, Cameron.\n\n                              CAMERON\n               Thank you, Sloane.\n\n                              CAMERON\n               If you guys only had one word, what\n               would it be?\n\n                              FERRIS\n               I can't believe you'd think up something\n               like with a naked girl in a jacuzzi\n               right in front of you.\n\n                              SLOANE\n               Come on, Ferris, answer his question.\n\n                              FERRIS\n               Bathroom.\n\n                              SLOANE\n               I'd say...\n\n     She thinks.\n\n                              FERRIS\n               Cash.\n\n                              CAMERON\n               It's the only word you could\n               ever use.\n\n                              FERRIS\n               Hello.\n\n                              SLOANE\n               Love.\n\n                              FERRIS\n               And what is you loathe somebody?\n               Are you going to say \"love\" every\n               time you see them?\n\n                              SLOANE\n               It's better than \"hello\".\n\n                              FERRIS\n               Hellos' generic.\n\n                              SLOANE\n               You wanna be generic?\n\n                              CAMERON\n               It's help.\n\n     Cameron smiles at his wisdom. Ferris and Sloane think about\n     it. It's a good choice. Cameron gets up and walks to the\n     Ferrari.\n\n                              CAMERON\n               The word is help.\n\n     Cameron peeks in the window.\n\n     CU. ODOMETER\n\n     Nothing's happening.\n\n     INT. GARAGE\n\n     Cameron pulls his head out of the car.\n\n                              CAMERON\n               Ferris? It's not working.\n\n     Ferris looks up.\n\n                              CAMERON\n               The miles aren't coming off, running\n               it in reverse.\n\n                              FERRIS\n               I thought that might be a problem.\n               Let's crack open the odometer and\n               roll it back by hand.\n\n     Cameron shakes his head.\n\n                              CAMERON\n               I got a better idea. It's cool.\n\n     He walks back around behind the Ferrari.\n\n                              CAMERON\n               Seventeen years and I've never\n               taken a stand. Now, I'm gonna\n               do it. I'm taking a stand against\n               my father, against my family,\n               against myself, against my past,\n               my present and my future. I will\n               not sit idly by as events that affect\n               me unfold to change the course of\n               my life. I will take a stand and I\n               will defend it. When my father comes\n               home tonight, he's finally going\n               to have to deal with me. Good or\n               bad, I'm taking a stand.\n\n     CU. FERRIS\n\n     He turns to CAMERA.\n\n                              FERRIS\n               This is a big U-2 fan.\n\n     CU. SLOANE\n\n     She smiles proudly at Cameron. She applauds him.\n\n     CU. CAMERON\n\n     He's serious and determined. He has made up his mind and it\n     appears that it won't be changed by anyone but himself.\n\n     CU. TIRES\n\n     It's spinning wildly.\n\n     CU. MERCEDES BUMPER\n\n     Cameron's foot rests on the bumper. A beat and it gives a\n     mighty shove.\n\n     CU. TIRE\n\n     The spinning tires slam down on the cement.\n\n     INT. GARAGE\n\n     Cameron has kicked the Ferrari off the jack. It squeals out\n     of the garage in a cloud of blue tire smoke. A $50,000\n     unmanned investment heading backwards down a driveway.\n\n     CU. SLOANE AND FERRIS\n\n     They're in shock.\n\n     EXT. HOUSE\n\n     The Ferrari shoots down the driveway.\n\n     INT. GARAGE\n\n     Cameron watches the car go. He's strangely placcid about the\n     impending disaster. Ferris and Sloane are bewildered.\n\n     THEIR POV\n\n     The Ferrari travels down the driveway, across the street,\n     over the curb into the wooded property opposite the house.\n\n     CU. TREE\n\n     The Ferrari's brief journey ends as it smacks a tree trunk.\n\n     INT. GARAGE\n\n     Ferris and Sloane exchange baffled looks. They look at\n     Cameron. He's proud and bold.\n\n                              FERRIS\n               What was that about?\n\n                              SLOANE\n               This has to be a dream.\n\n                              FERRIS\n               Cameron? One quick question.\n               Why'd you do that?\n\n     Cameron holds his proud posture for a beat. Then a look of\n     bewilderment comes over his face. He shoots a look to\n     Ferris. A puzzled look.\n\n                              FERRIS\n               You trashed the car.\n\n     Cameron looks across the street.\n\n                              SLOANE\n               Why?\n\n                              CAMERON\n               I took a stand.\n\n                              FERRIS\n               No, Cameron. You wrecked a car.\n\n     Cameron thinks for a moment. Then he regains his confidence.\n\n                              CAMERON\n               It's okay.\n\n     Ferris looks across the street at the car.\n\n                              FERRIS\n               I have an idea. If you're interested.\n\n     Cameron looks at him. He shakes his head.\n\n                              CAMERON\n               I'm gonna handle it.\n\n                              FERRIS\n               I think this could work.\n\n                              CAMERON\n               No, thanks. I want to deal with\n               it by myself.\n\n                              SLOANE\n               What about your one word?\n\n                              CAMERON\n               You already did it. If I need it\n               again, I'll use it.\n\n     He smiles. He raises am impish eyebrow.\n\n                              CAMERON\n               It's cool. I'm loose.\n\n188  INT. POLICE STATION. OFFICE                                 188\n\n     Joyce is talking with the juvenile officer. Outside the\n     office, on the bench, we see Jeanie and the boy making out.\n\n                              JOYCE\n               She's never been in trouble before.\n               This is a shock to me. First, I\n               don't know why she wasn't at school.\n               Second, I don't know why she'd call\n               you with this story about a rapist.\n\n                              OFFICER\n               For whatever reasons she did it,\n               I think she'd had a good scare.\n\n                              JOYCE\n               I hope so. I appreciate your calling\n               me. I can assure you that her father\n               and I will have a long talk with her.\n\n     The gathers her purse and jacket and stands.\n\n                              JOYCE\n               Thank you.\n\n                              OFFICER\n               Oh, by the way, I hope you son's\n               feeling better.\n\n     Joyce looks at the officer curiously.\n\n                              OFFICER\n               Tell him, all the guys at the\n               station here are pulling for\n               him.\n\n189  INT. POLICE STATION. WAITING ROOM                           189\n\n     Jeanie quickly breaks the embrace with the boy as Joyce\n     steps out of the juvenile officer's room. She's still a\n     little bewildered that everybody knows Ferris was ill.\n     Jeanie wipes her lips and sits up straight. The boy adjusts\n     his pants to better hide his passion.\n\n                              JEANIE\n                          (to the boy)\n               If you keep this to yourself, I\n               think we can probably get it on\n               pretty good.\n\n                              BOY\n               For sure.\n\n     Jeanie stands up.\n\n                              JEANIE\n               Hi.\n\n                              JOYCE\n               Don't \"hi\" me, young lady. Get\n               your stuff.\n\n     Jeanie reaches down for her purse.\n\n                              BOY\n               What's your name?\n\n                              JEANIE\n               Jean. What's yours?\n\n                              BOY\n               Garth Volbeck.\n\n190  EXT. SLOANE'S BACKYARD                                      190\n\n     Sloane and Ferris are standing at the back fence.\n\n                              SLOANE\n               I had a great time today.\n\n                              FERRIS\n               Yeah. It was pretty cool.\n\n                              SLOANE\n               You think Cameron's gonna be\n               alright?\n\n                              FERRIS\n               Sure. He had to so it, I guess.\n               His old man had it coming. He'll\n               be okay. I'd be worried if he'd\n               taken my idea.\n\n     Sloane smiles knowingly.\n\n                              SLOANE\n               You didn't have an idea, did you?\n\n                              FERRIS\n               Not a glimmer.\n\n                              SLOANE\n               You're so smart.\n\n                              FERRIS\n               No. I'm just real loose.\n\n     He kisses her.\n\n                              FERRIS\n               I'll call you tonight.\n\n     Sloane nods. Ferris jumps the fence and takes off across the\n     backyards. Sloane watches him go. A huge smile spreads\n     across her face.\n\n                              SLOANE\n               I LOVE YOU!\n\n     She backs away from the fence. MUSIC FADES UP.\n\n                              SLOANE\n               He's gonna marry me. I know it.\n\n     She turns and runs into the house.\n\n191  EXT. BACKYARD                                               191\n\n     Ferris sprints across a backyard. He jumps a plaster elf.\n\n192  EXT. ANOTHER BACKYARD                                       192\n\n     Ferris vaults a fence. He runs directly for a swimming pool.\n     He's approaching it from the side. He leaps, hits the diving\n     board, springs off, does a flip and lands on the grass on\n     the other side of the pool.\n\n193  CU. BEDSPREAD                                               193\n\n     Neatly bundles stacks of bills and rolled coins. A\n     significant amount of cash.\n\n     CU. SLOANE\n\n     She's writing.\n\n     CU. PIECE OF PAPER\n\n     We see a portion of the typewritten letter as she signs it.\n\n               \"...in the amount of $1,765.33. It\n               gives us great pleasure to assist\n               you in performance of your worthy\n               and much needed survives to those\n               so desperately in need.\n\n                              Sincerely,\n\n                              Sloane Peterson\n                              Executive Director\n                              The Ferris Bueller Foundation\"\n\n194  EXT. FERRIS' STREET                                         194\n\n     He's running down the middle of the street. A car honks.\n     Ferris moves to the side. The car pulls around him.\n\n     INT. CAR.\n\n     Tom's at the wheel. He glances in the mirror. He does a\n     take.\n\n     HIS POV. MIRROR\n\n     We see Ferris cut across a front lawn and into a house.\n\n     CU. TOM\n\n     He realizes it couldn't be Ferris.\n\n195  INT. HOUSE                                                  195\n\n     Ferris runs through the kitchen, past a WOMAN, fixing dinner\n     and out her backdoor. The Woman looks up curiously.\n\n196  EXT. FERRIS' HOUSE                                          196\n\n     Tom pulls in the driveway. He parks and gets out. Joyce\n     pulls in from the other direction.\n\n197  EXT. HOUSE. BACK PORCH                                      197\n\n     Ferris tries the door. It's locked. He reaches down and\n     lifts the doormat.\n\n     CU. PORCH\n\n     The outline of a key in the dirt under the mat. The key's\n     gone. The toe of a chewed-up dress shoe steps INTO FRAME. An\n     OMNIOUS CHORD IS STRUCK.\n\n     CU. FERRIS\n\n     He stares up in horror.\n\n     HIS POV\n\n     Rooney's looking down at him. He's holding the house key.\n\n     EXT. PORCH\n\n     Ferris stands up. He smiles.\n\n                              ROONEY\n               Looking for this?\n\n                              FERRIS\n               Yes.\n\n                              ROONEY\n               I got you, Ferris. This time I finally\n               got you.\n\n     Ferris is caught. There's no way out. Rooney gloats\n     severely.\n\n                              ROONEY\n               How does another year of high\n               school sit with you?\n\n     Suddenly, the backdoor opens. Jeanie looks out. She feigns\n     joy and relief. She rushes Ferris and hugs him.\n\n                              JEANIE\n               Thank God, you're alright! We've\n               been worried sick!\n\n     CU. FERRIS\n\n     A moment of curiosity. Then it dawns on him what's\n     happening. He smiles.\n\n     CU. ROONEY\n\n     His eyes dart from Ferris to Jeanie to Ferris. His victory\n     is evaporating.\n\n     EXT. PORCH\n\n     Jeanie breaks the embrace.\n\n                              JEANIE\n                          (to Rooney)\n               Thank you for bringing him home,\n               Mr. Rooney.\n                          (to Ferris)\n               You better get up in bed tight\n               now.\n\n     Ferris limps into the house.\n\n                              JEANIE\n               Can you imagine someone as sick as\n               Ferris trying to walk home from the\n               hospital?\n                          (shakes her head)\n               Kids!\n\n     CU. ROONEY\n\n     He's dumbfounded.\n\n     CU. JEANIE\n\n     She raises her hands and strikes a karate pose. A huge smile\n     passes over her face.\n\n     CU. ROONEY\n\n     A look of terror as he realizes that is was Jeanie who\n     kicked him and that Jeanie knows it was he who she kicked.\n\n     EXT. PORCH\n\n     Jeanie steps into the house.\n\n198  INT. HOUSE                                                  198\n\n     The door closes on Rooney's defeated, lost, dejected,\n     bewildered face. Not only has he lost Ferris again, he has\n     Jeanie to deal with next year.\n\n199  EXT. YARD. CU. DOG                                          199\n\n     The click of the door wakes him up. His head pops up off the\n     grass.\n\n     CU. ROONEY\n\n     He senses new danger. We hear AN O.C. GROWL. Rooney squeezes\n     his eyes shut.\n\n200  INT. KITCHEN                                                200\n\n     Kimberly and Todd are sitting at the kitchen table watching\n     TV and eating cereal. They look up at Ferris as he comes in\n     from outside.\n\n                              TODD\n               Ferris?  Does my head look like\n               it's getting bigger?\n\n     Ferris leans against the counter as he tries to catch his\n     breath. He looks at his little brother.\n\n                              FERRIS\n               No, but Kimberly's is.\n\n     He crosses to the refrigerator and opens it. Kimberly feels\n     her head.\n\n                              KIMBERLY\n                          (to Todd)\n               Is he serious?\n\n                              TODD\n               I think so.\n\n                              KIMBERLY\n               Oh, shit!\n\n     Ferris takes out a bottle of orange juice out of the\n     refrigerator and drinks straight from the bottle. Jeanie\n     comes in.\n\n                              FERRIS\n               Thanks, Jeanie.\n\n                              JEANIE\n               No problem.\n\n                              FERRIS\n               By the way, I borrowed some cash\n               from you. I'll pay you back.\n\n                              JEANIE\n               You don't have to.\n\n                              FERRIS\n               I want to.\n\n                              JEANIE\n               You don't have to. I've been ripping\n               off your wallet for years.\n\n     Ferris gives her a proud smile.\n\n201  EXT. HOUSE                                                  201\n\n     Joyce and Tom head up to the kitchen.\n\n202  INT. KITCHEN                                                202\n\n     Ferris and Jeanie exit the kitchen as Joyce and Tom enter.\n\n                              JOYCE\n                          (to Todd and Kimberly)\n               Hi, guys.\n\n                              KIMBERLY\n               Is my head swelling up?\n\n203  INT. HOUSE. FOYER                                           203\n\n     The foyer is jammed with floral arrangements, plants and\n     gifts. Ferris and Jeanie step gingerly through the flowers\n     and head upstairs.\n\n                              JEANIE\n               I'm sorry I've been riding your\n               buns for so long.\n\n                              FERRIS\n               It's completely cool.\n\n                              JOYCE (OC)\n               Ferris!\n\n     Ferris continues up the stairs. He affects a sickly voice.\n\n                              FERRIS\n               Upstairs, Mom!\n\n204  INT. SECOND FLOOR LANDING                                   204\n\n     Ferris and Jeanie stop.\n\n                              JEANIE\n               Do you know a guy named Garth\n               Volbeck?\n\n                              FERRIS\n               Vaguely.\n\n                              JEANIE\n               Is he cool?\n\n                              FERRIS\n               He's cool. But stay away from his\n               brother.\n\n     Ferris walks into the room, brushes the crumbs off his hands\n     and peels off his shirt. He climbs into bed. No sooner are\n     the covers over him than the bedroom door opens and Joyce\n     and Tom walk in. They walk over to the bed. Joyce sits down.\n\n                              JOYCE\n               Honey?\n\n     CU. FERRIS\n\n     The same deathly face he had in the morning. Tongue out,\n     eyes bulging.\n\n                              TOM (OC)\n               Ferris? How do you feel?\n\n     He pulls in his tongue to speak.\n\n                              FERRIS\n                          (deathly gasp)\n               150% better, thank you.\n\n205  INT. BEDROOM                                                205\n\n     Tom and Joyce hover over him with deep concern.\n\n                              FERRIS\n               I'm much better, really. Please,\n               don't make me stay home again. I\n               want to go to school. I'm graduating\n               in June and I...\n\n                              TOM\n               Ferris. You're sick. There's no point\n               pushing yourself and making it worse.\n\n                              FERRIS\n               Maybe you're right, Dad.\n\n                              TOM\n               I know I'm right.\n\n     Joyce leans over and kisses him forehead.\n\n                              JOYCE\n               How did you get so sweet?\n\n                              FERRIS\n               Years of practice.\n\n     Tom pats Ferris on the rump. He and Joyce exit.\n\n     CU. FERRIS\n\n     The hideous face. A beat and we HEAR THE BEDROOM DOOR CLOSE.\n     Ferris looks at CAMERA.\n\n                              FERRIS\n                          (happy sigh)\n               Yeah, life is a carousel. A\n               great big crazy ball of pure\n               living, breathing joy and delight.\n\n     He rolls over on his back and puts his hands behind his\n     head.\n\n                              FERRIS\n               You gotta get one.\n\n     He smiles.\n\n     MUSIC UP BIG\n\n     END TITLES\n\n                              THE END\n\n\n\n\n\n\n\n\nFerris Bueller's Day Off\nWriters :   John Hughes\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:07.369449"}