{"title": "Final Destination", "film_link": "/Movie Scripts/Final Destination Script.html", "script_link": "/scripts/Final-Destination.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Final Destination Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Final Destination Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.34 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=James Wong\" title=\"Scripts by James Wong\">James Wong</a><br/>  <a href=\"/writer.php?w=Glen Morgan\" title=\"Scripts by Glen Morgan\">Glen Morgan</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : January 1999<br/>\n<br/>\n<a href=\"/scripts/Final-Destination.html\">Read \"Final Destination\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>FINAL DESTINATION</title>\n\n<pre>\n\n\n<b>\"FINAL DESTINATION\"   \n</b>\nOriginally Called \"FLIGHT 180\"\n\nBy James Wong and Glen Morgan\n\n\n\nJanuary 15, 1999\n\n\n\nAwaiting......each of us; a cold...dark...lonely place.\nDeny its finality. Deride its totality. Dread the inescapable\ninevitability......it will arrive.\n\nThe BLACK SILENT SCREEN senses this moment before a distant blues harp introduces a contemporary band's cover of Blood, Sweat, and Tears' campy, yet haunting, gospel, \"And When I Die.\"\n\nAs the Introduction closes, RESONATES... A FLASH OF LIGHTING!\n<b>A CRACK OF THUNDER!\n</b>\n<b>                                                CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - NIGHT - CLOSE - BED\n</b>\nAn airline ticket is tossed INTO FRAME beside a suitcase; \"EURO-AIR. FLIGHT #180. New York City (JFK) - Paris, Charles de Gaulle (CDG.) Departure: Thursday 13May. 16H25 - Arrival: Friday 14May. 05H40.\"\n\n\"And When I Die\" Continues throughout the MAIN TITLES:\n\n<b>AN OLD TABLE FAN\n</b>\nswivels beside and open window. Outside, a humid spring THUNDER STORM drops warm, ominous rain. The figure of a seventeen year old boy, ALEX BROWNING, packing for a trip, passing the fan...\n\n<b>THE BED\n</b>\nA Paris guidebook is tossed atop the plane ticket. CAMERA PUSHES IN ON THE BOOK as the fan's breezes flip through the pages.\n\n<b>THE TABLE FAN\n</b>\nturns, head swiveling away from the bed.\n\n<b>TIGHTER - THE GUIDEBOOK PAGES\n</b>\nstop flipping, REVEALING A GULLOTINE from the Reign of Terror.\nAs an American passport is dropped beside the guidebook...\n\n<b>THE TABLE FAN\n</b>\nswivels, returning towards the guidebook on the bed.\n\n<b>THE GUIDEBOOK PAGES\n</b>\nFLIP. FLIP. FLIP. Alex's faint shadow continues moving about the room. The fan head swivels away, allowing the pages to settle... upon a Louvre masterpiece, Francisco de Zurbarans Lying-in-the State of St. Bonaventura.\n\nCAMERA CREEPS IN, teasingly on the dark faced corpse. The pages begin to turn once again.\n\n<b>TIGHTER, OMINOUS ANGLE - THE DESK FAN\n</b>\nThere is more of a hint of conincidence as the blades whirl and head swivels. The boy's figure passes, blocking the breeze.\n\n<b>THE GUIDEBOOK PAGES\n</b>\nstop dead on... Jim Morrison's decorated tomb in the Cemetiere du Pere Lachaise. A pilgrim has spray painted \"This is the End.\" Which in fact, it is... of the MAIN TITLE.\n\n<b>                        BARBARA\n</b>            Alex...\n\nCAMERA ADJUSTS, to fully reveal Alex Browning as he turns toward the bedroom door. Alex is an average kid; handsome. A high school \"everyman.\"\n\nOne the wall amongst Yankee and Knicks posters, hangs a pennant;\n\"Mt. Abraham High School, New York. The Fighting Colonials!\"\nAlex's mother, BARBARA, 45, walks in, excited and a bit anxious.\n\n                        BARABRA (Cont'd)\n            Tod and George's dad just called,\n            he's picking you up at 10 in the \n\t\tmorning. Bus leaves the high school \n\t\tfor JFK at noon.\n\nBarbara moves towards the suitcase to help him pack. Alex's father, KEN BROWNING, 48 appears, leaning against the door threshold, smiling enviously at his son.\n\n\n<b>                        KEN\n</b>            My suitcase workin' out for ya?\n\nAlex nods and buckles it. Barbara reaches in to tear off an airline baggage I.D. ticket attached from the previous flight.\n\n<b>                       ALEX\n</b>            Whoa! Whoa! Mom, you gotta leave\n            that on. It's like... the tag\n            made the last flight without\n            crashin' or anything, right?\n            So, it should stay on, or with,\n            the bag for good luck.\n\n<b>                        BARBARA\n</b>            Where would you get a nutball\n            idea like that?\n\n\n<b>EXTREMELY CLOSE - THE AIRLINE BAGGAGE MARKER\n</b>\nis torn away from the suitcase handle.\n\n<b>RETURN\n</b>\nAs Barbara picks up the suitcase to place it on the floor... a dozen old baggage I.D. tickets spill from the outer compartment. She looks at Ken, as if \"you?\" The guilty party shrugs.\n\n<b>                        KEN\n</b>            I'm still here.\n\nBarbara shakes her head as Alex smiles at his dad.\n\n                        KEN (Cont'd)\n            Seventeen and on the loose. Ten \n\t\tdays in Paris. In the springtime! \n\t\tLive it up, Alex...\n\nCAMERA INCHES INTO KEN as he winks at his son...\n\n                        KEN (Cont'd)\n            Got your whole life ahead of you.\n\n<b>ALEX\n</b>\nCAMERA CREEPS IN as, oddly, the words strike him portentously...\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - LATER\n</b>\nThe storm has ceased. The room is QUIET.\n\nAs if itself a presence, CAMERA CREEPS across the dark and motionless room TOWARD Alex, sleeping soundly. CAMERA CRANES DOWN to the level of the bed until Alex is in the f.g. and the room is visible behind him.\n\nOn the rear wall, the Fighting Colonials pennant begins to flutter slightly, as if affected by the moving breeze. The path of which is continued toward the bed, rustling the sheets, subtly blowing Alex's hair and continuing OVER CAMERA.\n\nEven in his sleep, Alex shivers from the passing cold. His eyes open surprised to be suddenly awakened. He considers for a beat, then looks toward...\n\n<b>THE WINDOWS\n</b>\nwhich... are closed.\n\n<b>ALEX\n</b>\npuzzled, checks...\n\n<b>THE TABLE FAN\n</b>\nwhich is off.\n\n<b>ALEX\n</b>\nperplexed, rolls over toward his digital clock. It's 1:00 a.m., however... the middle digit bar in the first zero faintly flickers so this time appears to read... 1:80.\n\n<b>                        AIRPORT P.A. (V.O.)\n</b>                 (overlapping)\n            Attention airline travelers...\n\n\n<b>                                                 CUT TO:\n</b>\n<b>INT. JOHN F. KENNEDY AIRPORT - MORNING - TELEVISION MONITOR\n</b>\nFLIGHT 180 departs 4:25. Gate 39.\n\n<b>                        AIRPORT P.A. (V.O.)\n</b>            This airport does not support \n\t\tsolicitors...\n\nCAMERA ADJUSTS FROM the \"Arrival-Departure Schedule\" to REVEAL forty high school KIDS, four TEACHERS and several PARENTS are gathered inside the International terminal at J.F.K. Several of the students wear Fighting Colonial leterman's jackets or hats and shirts displaying \"Mt. Abraham High, New York.\"\n\n<b>                        AIRPORT P.A. (V.O.) (CONT'D)\n</b>            You are not required to give money \n\t\tto solicitors.\n\nAlex gathers his bags, as does his best friend TOD WAGGNER and his older brother GEORGE WAGGNER, standing before their father, JERRY WAGGNER. For Alex, any psychic tension from the night before seems forgotten in the fun and excitement of the trip.\n\n<b>                        MR. WAGGNER\n</b>            Alright, you guys got everything?\n\n<b>                        TOD\n</b>            Yeah, we're all set Dad.\n\nMR. MURNAU, the French teacher (any further description necessary?) and leader of the class trip waves his arm.\n\n<b>                        MR. MURNAU\n</b>            Les estudients, allons en France!\n\n<b>                        MR. WAGGNER\n</b>            Does that mean \"go?\"\n\nTod shrugs, \"I guess\" as he moves to his father and gives him a warm hug goodbye. Mr. Waggner then gives his older son a hug.\n\n<b>                        AIRPORT P.A. (V.O.\n</b>             Atencion senores pasajeros. No\n             es necesario contribuir...\n\n<b>                        MR. WAGGNER\n</b>             I'll miss you guys.\n\nTod and George gives a wave, as does Alex, who is slapped on the back by Mr. Waggner.\n\n<b>                        MR. WAGGNER\n</b>             Take care of those two, Alex.\n\n<b>                        ALEX\n</b>             I will. Don't worry.\n\nThe group begins down the airport toward the check-in counter. In the f.g., before the boys, strides a girl, CLEAR RIVERS, 17, reading the TROPIC OF CANCER. The loner in the group, Clear wears dark colors against the insecerity of her sex appeal. She appears aloof and more wordly then the other students.\n\nReadying his ticket and documents, Tod flips open his passport, checking out his photo.\n\n<b>                        TOD\n</b>           I didn't think anything could\n           worse than my yearbook picture.\n\n<b>                        GEORGE\n</b>           Now you know how I feel havin' to \n\t     look at you all the time.\n\n<b>                        AIRPORT P.A.  (V.O.)\n</b>           Avis aux passagers...\n\nMr. Murnau stops the group. Excited, he cups an ear with one hand while raising a finger toward the public address system.\n\n<b>                        MR. MURNAU\n</b>            Entendez classe, qu'est ce que\n            c'est l'announce?\n\nEveryone begrudgingly stops to listen.\n\n<b>                        AIRPORT P.A. (O.S. CONT'D)\n</b>            Vous n'etes pas dans l'obligation\n            de contribuer aux demandes des \n\t\tquemandeurs.\n\n<b>CARTER HORTON\n</b>\nis the class dickhead who mix and matches his role models in the most superficial manner. His hand is tucked into his girlfriend, TERRY CHANEY'S, waistband...\n\n<b>                        CARTER\n</b>                 (re: MURNAU)\n            What the fuck's he want?\n\nTerry, hot now, but with no idea what time will do to her in just five years, smiles obsequiously and mouths \"shh.\"\n\n<b>                        P.A. SYSTEM (O.S., CONT'D)\n</b>            cher aeroport n'est responsable\n            pour leurs activities.\n\nMr. Murnau scans the group, his expression looking for an answer. Clear Rivers keeps her head in her book as...\n\n<b>                        CLEAR\n</b>            The airport doesn't endorse \n\t\tsolicitors.\n\n<b>                        MR. MURNAU\n</b>            Tres bien, Clear! Tout droit!\n\nShe doesn't react. Her expression remains cool as Murnau leads the \nprocession forward. The boys continue. Alex sighs...\n\n<b>                        ALEX\n</b>            Fuh-ck, do we have to put up with \n\t\tthat shit the whole time?\n\nA hand reaches out to gently detain Alex. He looks up to find a HARE KRISHANA, dressed in everyday clothes, but head shaved and a mark on his nose.\n\n<b>                        HARE KRISHANA\n</b>            Death is not the end.\n\nCAMARA PUSHES IN ON ALEX... unsettled by the soft spoken, yet ominous, \"Solicitation.\" The Krishana offers a small book, REALITY BEYOND THE MATTER: VAISHNAVA PHILOSOPHY.\n\nAs he hands the book to Alex, a female form ENTERS FRAME between them. The women is MISS VALERIE LEWTON, 30, a feisty English teacher whose figure inspires all the boys' fantasies.\n\n<b>                        MS. LEWTON\n</b>            It will be for you if you harass\n            my students.\n\nShe places a hand on Alex's shoulder, herding him to the group.\n\n<b>                        HARE KRISHANA\n</b>                 (pissy)\n            Hare Rama.\n\nMs. Lewton turns and, while walking backward, flashes a smile...\n\n<b>                        MS. LEWTON\n</b>                 (mouths)\n            Fuck off.\n\nAs she turns her back and continues down the terminal...\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. CHECK IN DESK - AIRPORT - DAY\n</b>\nAlex's passport and ticket are set INTO FRAME and picked up by a female TICKET CLERK. Alex waits as she busily types into the computer and checks his passport...\n\n<b>                        TICKET CLERK\n</b>            I have a few questions to ask you \n\t\tthis afternoon.\n\nO.S., LOUD, EXAGGERATED plastic tiles rapidly CLICK and CLACK.\n\n<b>                        TICKET CLERK (CONT'D)\n</b>            Did you pack these bags yourself?\n\nThe CLACKING CONTINUES, demading Alex's attention. His eyes turn forward.\n\n<b>ALEX'S POV - THE FLIGHT INFORMATION BOARD\n</b>\nPlastic tabs CLACK rapidly, settling on the word... \"CANCELLED.\"\n\n<b>ALEX\n</b>\nCAMARA CREEPS IN on his dawning paranoia...\n\n<b>                        TICKET CLERK (CONT'D, O.S.)\n</b>            Have your belongings remained in your\n            possession the entire time?\n\nAlex absently nods. Again, O.S., CLACK CLACK CLACK. His eyes move to...\n\n<b>ALEX'S POV - (TIGHTER) - FLIGHT INFORMATION BOARD\n</b>\nThe plastic tabs FLIP and CLACK rapidly, stopping on... \"DEPARTED.\"\n\n<b>TICKET DESK\n</b>\nAlex is still considering the \"messages...\"\n\n<b>                         TICKET CLERK\n</b>            Have you recieved any packages\n            from persons unknown to you?\n\nAlex quickly runs the day through his head and flashes her the REALITY BEYOND MATTER book. She smiles, then leans over toward the baggage scales. Alex's eyes turn toward...\n\n<b>CLOSE - (MOTION SLOWED)- ALEX'S LUGGAGE\n</b>\na new airline I.D. marker is attached to his bag.\n\n<b>RETURN\n</b>\nAlex eyes the new tag hoping it's \"good luck.\" As the clerk returns his ticket and passport... CLACK, CLACK, CLACK.\n\n<b>                        TICKET CLERK\n</b>            Same as your birthday.\n\nAlex is puzzeled by the comment. He shakes his head if, \"pardon me?\" CAMERA INCHES INTO the ticket clerk gesturing pleasantly to the passport and ticket...\n\n<b>                         TICKET CLERK (CONT'D)\n</b>            April 25th. Four-twenty-five...\n            your birthday is the same as your\n            departure time.\n\nCLACK. CLACK. CLACK. Alex's eyes flash toward...\n\n<b>ALEX'S POV - (FULL FRAME) - FLIGHT INFORMATION BOARD\n</b>\nthe title settles upon... \"TERMINAL.\"\n\n<b>                                                 CUT TO:\n</b>\n<b>INT.  SECURITY AREA - AIRPORT - MONITOR\n</b>\nThe ghastly green and reds of the X-ray monitors flash as carry on bags flash through the machine. CAMERA MOVES COUNTER to the direction of the conveyor belt. The pace and excitement of the collective group escalates as departure approaches.\n\nCarter Horton and his girlfriend, Terry, take cuts in line with smug, bullying expressions. Unseen by the chaperones, no student, has the nerve to protest Carter's action. Alex, Tod, George and BILLY HITCHCOCK, heavyset with a New York Rangers jersey watches Carter and Terry with disgust.\n\n<b>                        BILLY\n</b>            I can't believe they let that \n\t\tdickhead on this trip.\n\n<b>                        GEORGE\n</b>            His parents bought a ton of those \n\t\ttrip certificates we had to sell, \n\t\tjust to get him out of their hair \n\t\tfor ten days.\n\nExcited, Tod speaks in a convert tone over Alex's shoulder.\n\n<b>                        TOD\n</b>            Dude, I so worked the ticket clerk\n            so you're sittin' next to Christa \n\t\tand I'm next to Blake.\n\nAlex looks up ahead of the metal detectors...\n\n<b>ALEX'S POV - TWO GIRLS\n</b>\nAttractive and they know it, CHRISTA MARSH and BLAKE DREYER appear clearly out of Alex and Tod's league.\n\n<b>                        TOD (CONT'D)\n</b>            That's seven hours and most of it is \n\t\tin the dark.\n\n<b>ALEX AND TOD\n</b>\nThe boys dump their change in a plastic bowl.\n\n<b>                        TOD\n</b>            Dude, if we don't get someone\n            going on this flight, we should\n            just call Dr. Kervorkian and put\n            ourselves out of our fuckn' misery.\n\nAs Alex and Tod pass through the metal detector, their eyes performing reconnaissance on Christa and Blake, the opening drum BLASTS of Boingo's \"No One Lives Forever\" OVERLAPS...\n\n<b>                                                     CUT TO:\n</b>\n<b>INT. AIRLINE GATE - AIRPORT - AFTERNOON - CLOSE - GATE 39\n</b>\nCAMERA ADJUSTS from the sign indicating GATE 39. The class is squirrely and  excited. Mr. Murnau, Ms. Lewton, and the parent chaperones are allowing kids to burn off steam at the gate, hoping for a calm flight.\n\nCAMERA MOVES ALONG the awaiting passengers... Carter and Terry are making out, a step away from heavy petting...\n\nBlake and Christa are flipping through Parisian fashion magizines... Billy Hitchcock lays into a Burrito Supreme...\n\nCAMERA MOVES to an empty seat. Clear Rivers ENTERS FRAME and sits, \nstruggling with her Walkman, coffee, books, and a cassette box handmarked \"Boingo\" (a cheat that We hear the song)\n\nAs she places her stuff on the unoccupied seat beside her, a Paris guidebook falls on the floor, opened but face down. A passing, unidentified, student reaches down and hands her the book, still open and face down.\n\n<b>                        CLEAR\n</b>            Thanks.\n\nThe student continues down toward the observation deck. Clear looks at the opened guidebook.\n\n<b>CLEAR'S POV - GUIDEBOOK\n</b>\nPrincess Di's Mercedes is totaled in a Paris tunnel. Besides the photo are two portraits of Diana and Dodi Al Fayed.\n\n<b>CLEAR\n</b>\nCAMERA INCHES IN as she shakes off a shiver down her spine. She looks up from the book toward the student who handed it to her, the identity of which is fully REVEALED to be Alex Browning.\n\nHe stands at the gate window, looking out at the plane.\n\n<b>ALEX'S POV - 747\n</b>\nIt is raining. In the distance, MUFFLED THUNDER RUMBLES.\n\nCAMERA CREEPS AWAY from the plane... huge, seemingly incapable of flight and yet we unquestioningly trust our lives in this machine. Emotionless. Cold. Lifeless, and yet soon full of life.\n\n<b>ALEX\n</b>\nCAMERA inches in on him.\n\n<b>                        TOD (O.S.)\n</b>            Dude, let's take a dump.\n\nTod MOVES INTO FRAME beside Alex...\n\n<b>                        ALEX\n</b>           \tMan, that is one George Michael\n           \tnotch from being gay.\n\n<b>                         TOD\n</b>           \tDude, get wisdom. We're about to \n\t\tboard a seven hour flight. The \n\t\ttoilets in coach are barely \n\t\tventilated closets. What if your \n\t\tbody wants that airplane food out of \n\t\tyour system and you have to go torgue\n            a wicked cable and then right after \n\t\tyou walks in Christa or Blake? You \n\t\twant them to associate with you with \n\t\tthat reflexive gag and the watery \n\t\tsting in their eyes?\n\nAlex takes a beat to consider...\n\n<b>                                                       CUT TO:\n</b>\n<b>INT. MEN'S ROOM - AIRPORT - OVERHEAD\n</b>\nCAMERA LOOKS DOWN on two stalls. Alex sits in one, Tod sits in the other. O.S., OVER the airports P.A. SYSTEM John Denver's \"Rocky Mountain High\" begins...\n\n<b>                        ALEX\n</b>            John Denver...\n\nUpon the mention, CAMERA CRANES DOWN, TURNING, TWISTING UNTIL FINDING ALEX in a straight on CLOSE-UP. He listens, tense...\n\n<b>                        JOHN DENVER (O.S.)\n</b>            He was born in the summer of his \n\t\ttwenty-seventh year...\n\n<b>                        ALEX\n</b>            He died in a plane crash.\n\nA P.A. ANNOUNCMENT breaks into the song...\n\n<b>                         P.A. SYSTEM\n</b>            Ladies and Gentlemen, thank-you for\n            your patience, at this time we would\n            like to begin pre-boarding of Euro-Air\n            Flight 180 to Paris through gate 39.\n\nReally for the first time, Alex appears a bit tentative and pale. It is intensified by the return of the song...\n\n<b>                        JOHN DENVER (O.S.)\n</b>            It's the Colorado Rocky Mountian High/\n            I've seen it rainin' fire in the sky...\n\n<b>                                                      CUT TO:\n</b>\n<b>INT. BOARDING AREA - GATE 39 - CLOSE - ALEX'S BOARDING PASS\n</b>\nis torn along the perforated edge and handed back.\n\n<b>ALEX\n</b>\nlooks down the paasenger ramp.\n\n<b>ALEX'S POV - RAMP TUNNEL\n</b>\nCAMERA CREEPS toward it... lit to cheat a feeling of no return.\nO.S., distant THUNDER RUMBLES...\n\n<b>WIDER\n</b>\nThere is something more emotionally tense about the moment of boarding than take-off. CAMERA PICKS UP Ms. Lewton searching...\n\n<b>                        MS. LEWTON\n</b>            Anyone seen Billy Hitchcock?\n            How'd we lose him?\n\nTod nudges Alex toward the tunnel, the three boys start down the ramp, passing Mr. Murnau who checks his list, counting heads...\n\n<b>                        MR. MURNAU\n</b>             Vingt huit, vingt neuf...\n\n<b>PASSENGER RAMP\n</b>\nAlex, Tod, and George catch up to Christa and Blake, excited. As always, everyone becomes bottlenecked just at the point of entering the plane. Alex looks out the ramp's side porthole window toward the back of the plane.\n\n<b>ALEX'S POV - THROUGH PORTHOLE\n</b>\nThe enormous engine. The expansive wings. Behind the tail, distant, a bolt of lightning FLASHES!\n\n<b>ALEX\n</b>\nlooks away. Just ahead, in the plane, FLIGHT ATTENDANTS greet the \npassengers. He is next to enter the plane.\n\n<b>CLOSE - FLOOR\n</b>\na slice of opening from where the ramp meets the plane provides a sense of how high up one actually stands.\n\n<b>ALEX\n</b>\nCAMERA PUSHES INTO HIM as he takes his first step into the plane.\n\n<b>CLOSE - AIRLINE CABIN FLOOR\n</b>\nAlex's Nikes land on the carpet.\n\n<b>INT. 747 - FIRST CLASS CABIN - AFTERNOON - CLOSE - BABY\n</b>\nSCREAMS! Its parents desperately comfort the child.\n\nCAMERA ADJUSTS, LEADING George, Alex and Tod through the aisles. Alex and Tod wince at the screaming child. George, however feels comforted.\n\n<b>                        GEORGE\n</b>            Good sign. Younger the better.\n            It would be a fucked-up God to\n            take down this plane.\n\n<b>INT. ECONOMY CLASS CABIN - 747 - AFTERNOON\n</b>\nIn the first row slumps a young man with Amyotrophic Lateral Sclerosis. A cannula is set in his nostrils leading to an oxygon tank beside him.\n\nThe kids sneak sympathetic yet anxious glances at the man while continuing in their seats. George whispers over his shoulder...\n\n<b>                        GEORGE\n</b>            A REALLY fucked-up God.\n\nAlex's tension increases as he continues up the aisle.\n\n<b>ALEX'S POV - OVERHEAD COMPARTMENTS\n</b>\nCAMERA INCHES IN ON \"Row 25. Seats H, I, and J.\"\n\n<b>ALEX\n</b>\nclimbs into the row, carrying his backpack. He takes his window seat and reaches up to the air flow valve.\n\n<b>CLOSE - AIR FLOW VALVE\n</b>\nturns, HISSING, air streaming full blast.\n\nCAMERA INCHES IN ON HIM as he takes in deep breaths of the stale air. He presses his face to the window.\n\n<b>ALEX'S POV - THE LEFT WING\n</b>\nRain falls. GEARS WHIR as the ailerons are tested.\n\n<b>CLOSE - ALEX\n</b>\nCAMERA CREEPS TOWARD HIM, face to the glass; eyes scanning the plane and outside area.\n\n<b>                        CHRISTA (O.S.)\n</b>            Alex?\n\nHe turns toward the aisle.\n\n<b>ALEX'S POV - CHRISTA AND BLAKE\n</b>\nMan, they look great and they're workin' the sex appeal.\n\n<b>                        CHRISTA\n</b>            Could you trade seats with Blake\n            so she and I can sit together? I\n            asked Tod, but he says he's got some\n            medical thing?\n\n<b>ALEX\n</b>\nsneaks a quick check with Tod.\n\n<b>ALEX'S POV - TOD\n</b>\nshakes his head. \"NO! NO! DON'T DO IT.\"\n\n<b>ALEX AND THE GIRLS\n</b>\nHe looks to them and knows he is just plain overmatched. Alex shrugs, \"Sure.\" In front of him Tod throws up his arms, disgusted. Alex climbs out of his seats. The girls are touchy-feely thankful, but only know guys dig that.\n\n<b>                        CHRISTA AND BLAKE\n</b>            You're so sweet. Thanks, Alex.\n\nAlex crames up into the aisles, making his way to Tod, sitting two rows up in 22 H.\n\nAlex climbs over Tod to take the window seat. Clear Rivers sits in the seat directly behind Alex.\n\n<b>                        TOD\n</b>                  (mouths)\n            Fag.\n\n<b>                        ALEX\n</b>            C'mon, man, like you really thought\n\t\tyou were gonna tittie fuck 'em over\n\t\tGreenland, or something?\n\n<b>                        TOD\n</b>            Because of you, I gotta sit here and\n\t\twatch fuckin' \"Stepmom.\"\n\nAs Alex sits, the tray table falls from its upright position.\n\nHe lifts the tray back up, but as he turns the latch, it BREAKS OFF in his hand. He briefly tries to jimmie the tray into postition, then gives up.\n\nCAMERA FOLLOWS ALEX'S HAND as it rises. CAMERA SWEEPS IN EXTREAMLY CLOSE to the ATTENDANT CALL BUTTON. As Alex's finger engages the button, it lights up orange.\n\n<b>ALEX\n</b>\nThe jet lurches. He looks...\n\n<b>OUT OF THE WINDOW - ALEX'S POV\n</b>\nThe 747 begins rolling out of the gate.\n\n<b>ALEX\n</b>\nAs he looks back, searching for the nearst flight attendant...\n\n<b>ALEX'S POV - THROUGH THE SEATS - CLEAR RIVERS\n</b>\nreads her book. Another leans to look out the window.\n\n<b>ALEX\n</b>\nlifts a bit out of his seat, searching for any flight attendant O.S., A PING.\n\n<b>                        CAPTAIN (V.O)\n</b>            Flight Attendants prepare for\n            departure.\n\nLooking fore in the cabin...\n\n<b>ALEX'S POV - NEAR THE FLIGHT DECK\n</b>\nThe flight attendants strap themselves in for take-off.\n\n<b>ALEX\n</b>\nO.S., the ENGINE VOLUME INCREASES in PITCH and INTENSITY as the jet begins to taxi. Alex sits back as the tray over his lap. He looks out the window.\n\n<b>ALEX'S POV - THE RIGHT WING\n</b>\nappears motionless in the f.g. as the tarmac and runway signs roll past the window. THE ENGINE PITCH RISES...\n\n<b>ALEX\n</b>\nThe ENGINES WHIR as the jet gathers SPEED. He checks the window.\n\n<b>ALEX'S POV- THE RUNWAY\n</b>\nis a blur. The airport terminals in the b.g. streak past. The wings lift, angled as the jet leaves the ground.\n\n<b>ALEX\n</b>\nO.S., his classmates CHEER and \"raise the roof.\" The trip has begun.\n\nCAMERA PULLS AWAY FROM ALEX, as if reflecting his easing of annoyance with the tray situation. He finally appears to notice the raucous reaction and settles back in his seat, slightly pushed by mild-g force. The upwarding angle increasing...\n\nThe cabin buffets, as if passing mild turbulance. Then...\n\nThe cabin sharply JOLTS! Everyone tenses, GASPS. CAMERA SWEEPS BACK TO ALEX. And just as he clenches his backpack... the cabin BANGS, ROCKS. THE ENGINES SPOOL TO A STALL. METAL TWISTS under extreme PRESSURE. The cabin dips, angles, sharply to the right.\n\n<b>ALEX'S POV - THE CABIN\n</b>\nPassengers SCREAM! Unrestrained personal belongings fly across the aircraft INTO CAMERA, which BUFFETS and SHAKES...\n\n<b>OXYGEN MASKS\n</b>\ndeploy from the overhead compartments. A prerecorded message, like that recorded by the black box of the crash of JAL# 123 August 12, 1985, BLARES over the P.A., with erie calm...\n\n<b>                        MESSAGE (V.O.)\n</b>            Fasten seat belts...put on oxygen \n\t\tmasks...\n\n<b>ALEX\n</b>\nhis hand trembles as he reaches for the oxygen mask and places it over his face. The ENGINES resuscitate. SCREAMING. WHINING. Alex checks out his window.\n\n<b>ALEX'S POV - OUT OF WINDOW\n</b>\nThe plane is on its side, losing altitude. A slow, sick spin.\n\n<b>ALEX\n</b>\nbreaths deep into his oxygen cup.\n\nThe JET ENGINES GRIND AND WHIR, as if the craft were in the midst of a last-ditch effort to regain stability; the sounds DEAFENING over the PASSENGERS' cruelly hopeless SCREAMS.\n\nThen...\n\n<b>KA-BOOM\n</b>\nA DEVASTATING EXPLOSION ERUPTS across the cabin, blasting a five foot hole in the fuseluge. Human limbs and blood spray, craft and passengers torn to shreds.\n\nDead students sit lifeless in their seats.\n\nEvery unrestrained object on board flies to the hole and through the fire; paper, books, luggage, pillows. A PARENT and a STUDENT clutch their seat in terror, SCREAMING before they are pulled into the sky.\n\nWind. Screams. Dying engines, a deafening blare.\n\n<b>ALEX AND TOD\n</b>\nSCREAM, pale, knowing there is no hope, no escape as the ENGINES DIE. The cabin begins to tilt downwards... then straight down. Debris tumbles toward the flight deck as if falling from a cliff.\n\nOUTSIDE... the sick familiar SOUND of an aircraft going down.\n\nALEX is strapped to his seat, upper body facing downward toward the water. FIRE, WIND, AND BLOOD WHIP across him. A BUILDING WHINE CRESCENDOES before a second EXPLOSION RIPS ACROSS FRAME...\n\n<b>                                              CUT TO:\n</b>\n<b>CLOSE - ALEX'S TERRIFIED EYES\n</b>\ndilating rapidly, as the shock of what appears to be happening before him washes over his very psyche.\n\n<b>                        CHRISTA (O.S.)\n</b>            Alex?\n\n<b>ALEX\n</b>\nDrenched with sweat, trembling in his seat, his eyes dart toward Christa and Blake. They look great and they're workin' the sex appeal.\n\n<b>                        CHRISTA\n</b>            Could you trade seats with Blake so\n\t\tshe and I can sit together? I asked \n\t\tTod, but he's got some medical thing.\n\nAlex turns sickeningly disoriented. His eyes dart about, searching for evidnece of the catastrophe. There are none to be found. Alex blots from his seat, startling the two girls. He scrambles toward Tod, who looks at his friend, concerned.\n\n<b>                        TOD\n</b>            Dude, what up?\n\nFrenzied, Alex climbs over his friend, on top of the seat. Alex's panic has alerted the other students and a MALE FLIGHT ATTENDANT who makes his way to the row.\n\n<b>ALEX\n</b>\ngrabs the tray table latch before the vacent seat. IT BREAKS OFF, JUST AS BEFORE. CAMERA PUSHES INTO ALEX, terrified. He begins to hyperventilate.\n\n<b>                        FLIGHT ATTENDANT\n</b>            Is there a a problem, sir?\n\nAlex's wild eyes and expression convey \"no fucking kidding there's a problem.\" The flight attendant realizes this passenger is experiencing a serious episode.\n\nDirectly across the aisle, Carter Horton and Terry look at him with severe expressions.\n\n<b>                        CARTER\n</b>            What's your fuckin' problem?\n\nMr. Murnau and Ms. Lewton unfasten their seat belts and rush toward Alex.\n\n<b>                        MR. MURNAU\n</b>            Alex? Qu'est-ce se?\n\n<b>                        ALEX\n</b>            Qu'est-ce se?! THE PLANE'S GONNA\n<b>            EXPLODE!\n</b>\nObviously, no one ever wants to ever hear that. The students tense.\n\n<b>THE FLIGHT ATTENDANT\n</b>\nimmediately turns to other attendants, signaling for assistance with a quick definite gesture. In the b.g., attendants hustle toward the economy class cabin.\n\n<b>CARTER AND TERRY\n</b>\n<b>               CARTER                TERRY\n</b>        Shut up, Browning!       You're not funny.\n\n<b>ALEX\n</b>\nfrenzied, begins moving toward the aisle.\n\n<b>                        ALEX\n</b>            We have to get out!\n\nThis frightens everyone. Not the \"prophecy,\" but his panicky, irrational behavior.\n\n<b>                        ALEX (CONT'D)\n</b>            We have to get off this plane!\n\n<b>CLEAR RIVERS\n</b>\nCAMERA PUSHES INTO HER, hearing Alex's declaration.\n\n<b>                        ALEX (CONT'D)\n</b>            Now! NOW!!\n\n<b>RETURN\n</b>\nAlex is desperately climbing over Tod, who is trying to calmly restrain his friend. Across the aisle, Carter Horton stands ready to quiet Alex, with force.\n\n<b>                  \tCARTER\n</b>\t      Sit! DOWN! Browning!\n\n<b>               TOD                             FLIGHT ATTENDANT\n</b>    Alex. Alex! Easy, man. Take it        Sir, if this is a joke,\n    easy.                                 we don't tolerate such \n\t\t\t\t\t\t\thumor.\n\nThe flight attendant restrains Carter with an extended forearm.\n\n<b>                             ALEX\n</b>                I'm not joking! I'm not joking!\n\nMs. Lewton and Mr. Murnau move to the seats. Flight attendants try \nrestraining Alex from reaching the aisle.\n\n<b>           MS. LEWTON               \t       MR. MURNAU\n</b>  Alex, Knock it off. It's alright.       Settle down, Alex.\n\n<b>                        ALEX\n</b>\t\tListen to me! This plane will \n\t\texplode on take-off!\n\n<b>                        FLIGHT ATTENDANT\n</b>            Sir, we will remove you from the\n            aircraft if this continues.\n\n<b>                        CARTER\n</b>            I'll remove him.\n\n<b>                         ALEX\n</b>            Fuck you! I'll remove myself!\n\nCarter reaches for Alex, who pushes back, trying to get out. Carter responds aggressivly and now the flight attendant, Tod, and the two teachers are in the midst of the melee.\n\nThe Co-Pilot arrives to secure the situation. He grabs Alex and begins forcibly ushering him up the aisle.\n\nA male flight attendant choke holds Carter from the back. Carter struggles but the attendant's postioning has the advantage. He begins removing Carter from the plane as well.\n\n<b>                        TERRY\n</b>            He didn't do nothin'!\n\nShe follows the attendant, hitting him to help her boyfriend.\n\nJust arriving in the cabin, Billy Hitchcock tries to fight past a \nSTEWARDESS to get to his seat. He is blocked by the mass of combatants as they are escorted out.\n\n<b>                        FLIGHT ATTENDANT\n</b>                  (he's had it)\n            Anybody in the aisle is off the \n\t\tplane!\n\n<b>                        BILLY\n</b>            No, wait, I was late... that's my \n\t\tseat right there!\n\nUnder protest, Billy gets pushed back off the plane. Mr. Murnau and Ms. Lewton follow the pack of students and airline personnel as they move toward the exit, calling out to seated teachers and parents while hustling up the aisles.\n\n<b>          MS. LEWTON                       MR. MURNAU\n</b>   Everybody just stay where you    Mr. Carpenter, keep an eye on\n   are. Just sit tight.             things for a moment.\n\nTod watches, amazed and concerned for his friend. He looks across the cabin to...\n\n<b>TOD'S POV - GEORGE\n</b>\nhis brother gestures, mouths... \"you should go with him.\"\n\n<b>TOD\n</b>\nstarts off down the aisles. CAMERA COUNTERS... ADJUSTING TO CLEAR RIVERS. Amongst the chaos, she considers for a beat, then grabs her backpack, stands and moves into the aisle to exit the plane.\n\n<b>                                               CUT TO:\n</b>\n<b>INT. BOARDING AREA/TUNNEL - GATE 39 - DAY\n</b>\nAlex, the co-pilot, Carter, the attendant, Mr. Murnau, Ms, Lewton, Terry, Tod and Billy proceed down the tunnel. Billy is confused by the chaos.\n\n<b>                        BILLY\n</b>            I didn't do anything! I have my \n\t\tticket right here!\n\nArriving SECURITY OFFICERS quickly have control of the situation. Alex is taken to a seat at the gate and dropped there by the co-pilot, who, winded, eyes the officers.\n\n<b>                        CO-PILOT\n</b>            You got this?\n\nThe officers nod. One moves toward Carter as he dropped in a seat away from Alex. Terry sits behind Carter.\n\nThe co-pilot and attendants start back toward the plane. Ms. Lewton hustles over to them and an airline representitive.\n\n<b>                        CO-PILOT\n</b>            No one gets back on board. That's my \n\t\tcall.\n\n<b>                        MS. LEWTON\n</b>            PLEASE... I've got forty students \n\t\tgoing to Paris...\n\nDuring these negotiations... CAMERA MOVES PAST Ms. Lewton and the Co-Pilot to the boarding ramp door...\n\nClear Rivers exits and takes a seat away from the others, aware she is unnoticed in the confusion. CAMERA INCHES IN as she looks up toward...\n\n<b>ALEX\n</b>\nCAMERA MATCHES THE MOVE TO HIM AS TOD and Mr. Murnau attempt to calm him down.\n\n<b>                        TOD\n</b>            It's alright. It's alright. You're \n\t\toff the plane. You're off the \n\t\tplane...\n\nRattled, Alex attempts to compose himself. Ms. Lewton appears, hurriedly pulling aside Mr. Murnau.\n\n<b>                        MS. LEWTON\n</b>             Airline's not taking this very well.\n             They'll let one of us back on and\n             the rest can grab a six-ten flight.\n             Gets in two hours later at DeGaulle.\n             It's alright. It's not that big of a\n             deal.\n\n<b>                        MR. MURNAU\n</b>            I'll stay.\n\n<b>\t                  MS. LEWTON\n</b>            No, you know the whole French thing. \n\t\tGet on the plane.\n\nMurnau understands this point and takes off toward the boarding ramp door. Pleading his case, Billy follows Murnau.\n\n<b>                        BILLY\n</b>            I was in the bathroom. The lock was \n\t\tstuck. I didn't fight with anyone!\n\nHustling toward the door. Mr. Murnau gestures toward Ms. Lewton as if \"talk to her.\" He disappears down the ramp. CAMERA PUSHES IN as airline personnel CLOSE THE DOOR...with an ominous THUD.\n\n<b>EXT. GATE 39 - AFTERNOON - CARTER, TERRY &amp; BILLY'S POV\n</b>\nFlight 180 pulls out of the gate, taxiing toward the runway.\n\n<b>INT. GATE 39 - OBSERVATION WINDOW - AFTERNOON\n</b>\nCarter turns over his shoulder, looking back angrily towards Alex. Terry wraps a calming/restraining arm around Carter's shoulder, but he starts towards Alex, seated with Ms. Lewton.\n\n<b>MENS ROOM ACROSS FROM GATE 39\n</b>\nTod races out of the bathroom with a dampened paper towel. CAMERA FOLLOWS as he hands it to Ms. Lewton seated next to Alex. The teacher places it on Alex's forehead.\n\n<b>                        TOD\n</b>            I called your mom and dad and \n\t\tthey're on their way.\n\n<b>                        MS. LEWTON\n</b>            Alex, talk to me. What happened?\n\nAlex looks at Tod, who nods. His friend's expression is soothing and open. With lowered tense tone, meant for only the two people beside him...\n\n<b>                        ALEX\n</b>            I... I saw it... like, I don't\n            know... the plane took off. I saw\n            it leave the runway... I looked down\n            and saw the ground...\n\nMs. Lewton and Tod exchange concered glances.\n\n<b>                        ALEX (CONT'D)\n</b>            And then the cabin banged and the\n            left side exploded. The the whole\n            plane... blew up. It was so real.\n            Exactly how everything goes.\n\n<b>                         TOD\n</b>            Been on many planes that blew up, \n\t\thave you?\n\nGood point. Alex looks away.\n\n<b>                         MS. LEWTON\n</b>            You must have fallen asleep.\n\n<b>                         CARTER\n</b>            We get thrown off the plane and blow \n\t\ta half day in Paris because Browning \n\t\thas a bad dream?\n                 (mocking Alex)\n            It's going to explode! It's going to \n\t\texplode!\n\n<b>                        TOD\n</b>            Fuck off, Horton.\n\n<b>                        MS. LEWTON\n</b>            Tod...\n\nA raw nerve, Alex stands.\n\n<b>                        ALEX\n</b>            Only trip you're gonna take is to \n\t\tthe fuckin' hospital.\n\nCarter scoffs while moving aggressively toward Alex.\n\nCarter makes a quick move and grabs Alex. The two security guards rush in to break it up. Chaos erupts agian as the two boys wrestle in the terminal.\n\n<b>OBSERVATION DECK\n</b>\nCAMERA PUSHES INTO Billy Hitchcock, depressed as he watches the plane take off...\n\n<b>                        BILLY\n</b>            There they go and here we stay.\n\n<b>AIRPORT TERMINAL\n</b>\nOne guard restrains Alex; another Carter. In the b.g. out of the observation deck window... Flight 180 lifts off the runway.\n\n<b>                        CARTER\n</b>             You're payin' for my trip, Browning!\n\n<b>                        ALEX\n</b>             I wish you were on the plane!\n\nIn the b.g. the 747 head and taillights suddenly, violently, ERUPT into a gigantic fireball of flame.\n\nIt takes a few seconds for the CONCUSSION to hit the terminal, but when it does... BOOM! A window SHATTERS! Chairs rock! People are knocked off their feet.\n\nCAMERA SWEEPS INTO ALEX... stunned as he turns to the window...\n\n<b>ALEX'S POV - FLIGHT 180\n</b>\nThe unceremonious speed of obliteration of hundreds of lives is cruel as flaming debris plummets from the early evening sky.\n\n<b>CLEAR RIVERS\n</b>\nCAMERA PUSHES IN ON HER, rattled, afraid, but aware of Alex as she is first to turn her eyes toward him.\n\n<b>GATE 39\n</b>\nBilly Hitchcock walks backward from the window, shocked by shocked step. Ms. Lewton drops to her chair as her legs give out.\n\nO.S., ALARMS BEGIN. The two security guards tear off toward more urgent duties. O.S., OUTSIDE, SIRENS WAIL as emergency vehicles race to the tragedy.\n\nCAMERA BEGINS TO MOVE toward ALEX... as Tod's head turns toward him, then Terry's... then Carter's. In the chair, beginning to cry, Ms. Lewton eyes Alex, as if afraid of him.\n\nCAMERA CONTINUES. SIRENS PIERCING. The emergency vehicles' strobing red lights reflect in Alex's eyes, now in TIGHT as he looks out, frozen with shock... upon the doomed FLIGHT 180.\n\n<b>                                                      CUT TO:\n</b>\n<b>INT. JFK INTERNATIONAL AIRPORT - PRESS ROOM #10 - NIGHT\n</b>\n<b>SILENCE\n</b>\nA pair of Airline REPRESENTATIVES sit with the seven survivors, each numb with shock. Everyone is too raw with residual fear to show any emotion. They sit on folding metal chairs in an empty room, too bright from the fluorescent lights. Beneath their obvious trauma resulting from the catastrophe... each feels uneasy by Alex's presance.\n\nThe others sit away from Alex and Tod. Alex appears wrought with guilt. He checks the others out of the corner of his eye.\n\n<b>ALEX'S POV - THE ROOM\n</b>\nMs. Lewton, Carter and Billy glare at Alex. Terry averts her eyes from Alex to bury her face in Carter's shoulder.\n\n<b>ALEX\n</b>\nfrightened as anyone over what has happened, tenses, defensive and scared. With softspoken strength...\n\n<b>                        ALEX\n</b>            You're lookin' at me as if I caused \n\t\tit. I did not cause this.\n\n<b>LEWTON, CARTER, TERRY, AND BILLY\n</b>\nmaintain their uncertain expressions. With strained apprehansion, as if not wanting to \"dabble in the occult,\" but needing an immediate answer.\n\n<b>                        MS. LEWTON\n</b>            Is everyone dead? Are there any\n            survivors?\n\n<b>WIDER\n</b>\nAlex is taken aback by the question, yet even his best friend looks at him for an answer.\n\n<b>                        ALEX\n</b>            How would I know? You think I'm\n            some sort of...\n\n<b>                        CLEAR\n</b>            He's not a witch.\n\nCAMERA PUSHES IN ON Alex, relieved and thankful, as he turns to her...\n\n<b>CLEAR RIVERS - ALEX'S POV\n</b>\nCAMERA MATCHES the move INTO HER as she looks up at Alex, not with fear or repulsion... but with knowledge of an unwanted but irrefutable connection.\n\n<b>WIDER\n</b>\nCausing a startle, the DOOR OPENS. Everyone's head whips reflexively toward the entrance. The strange event of the flickering lights is quickly forgotten.\n\nA half dozen MEN and WOMEN enter the room, displaying official badges and passes. All but two are dressed in casual clothing, having been called in from home; the pair being F.B.I. Special Agents WEINE and SCHRECK. HOWARD SEIGEL and DON HAWKS are representatives of the National Transportation Safety Board. EILEEN WHALE and JACK ARNOLD are members of the Euro-Air \"Trauma Team.\"\n\nThe officials are sympathetic and calm, exuding the confidence and security trauma victims look for at this time.\n\n<b>                        SEIGEL\n</b>            Hello. I'm Howard Seigel, National\n            Transportation Safety Board vice\n            chairmen. We've notified your families\n            and they are on their way. Does anyone\n            feel they need medical attention or\n            spiritual counseling at this time?\n\nAlthough the words are comforting, being in the position of having to hear them macabre. Ms. Lewton reacts, snapping...\n\n<b>                        MS. LEWTON\n</b>            Have they found any survivors?\n            What's going on?\n\nSeigel is calm, yet honest... carefully honest.\n\n<b>                        SEIGEL\n</b>            The cause of the explosion is \n\t\tundetermined. Nassau county\n\t\tauthorities are on the scene. Naval\n\t      search and rescue are en route.\n\nHe gestures... \"and that's all we know.\" The group slips deeper into despair.\n\n<b>                        WEINE\n</b>            We understand how you must be\n            feeling at this hour... and although\n            we know it may be difficult, we must\n            ask you some questions... regarding\n            today's events, while it's still\n            fresh in your minds.\n\nThe survivors dread the thought of recounting the horrible experience, yet collectively are ready to co-operate.\n\n<b>                        WEINE\n</b>            It may be valuable to our rescue\n            attempts, or any potential...\n            criminal investigation.\n\nThe agents, F.B.I. badges displayed in their pockets, turn their eyes, suspicioulsy, toward Alex.\n\n<b>ALEX\n</b>\nreacts, puzzled, as he realizes the Agents are focused on him...\n\n<b>                                                 CUT TO:\n</b>\n<b>INT. A ROOM - AIRPORT - NIGHT - CLOSE - SCHRECK &amp; WEINE\n</b>\nare direct and professional, with no hidden agenda in searching for the truth. Seigel and Hawks from the NTSB are behind them taking notes...\n\n<b>                        SCHRECK\n</b>            You said...\n                  (checks notes)\n            \"Listen to me! This plane will\n            explode on take-off.\"\n                  (to Alex)\n            How did you know that?\n\n<b>ALEX\n</b>\nCAMERA PUSHES IN as he looks up, nervous... not about suspicion toward him, but trying to explain what even he doesn't understand.\n\n<b>                        ALEX\n</b>            I got this... feeling... a weird\n            feeling... I can't explain it...\n\n<b>                        WEINE\n</b>            Did you take any seditives before\n            boarding, or on the plane. Sleeping\n            pills?\n\n<b>                        ALEX\n</b>            No. I saw it. I saw it!\n\nTears well as he grows frustrated trying to convey the unique experience. Being trained, veteran officers, Schreck and Weine obsereve; allow him to talk.\n\n<b>                        ALEX\n</b>            Not like a dream... more than that.\n\t\tI experienced the plane exploding... \n\t\tit was so horrible... I know what \n\t\tthey all went through tonight...\n\nThe officers remain quiet, gauging his explanation.\n\n<b>                        ALEX (CONT'D)\n</b>            I'm not a pyschic... I've never had\n            this happen before...\n\nThe officers study him, unsure yet carefully...\n\n<b>                        SCHRECK\n</b>            Did this \"weird feeling\" have\n            anything to do with you saying\n            you wished Carter Horton was on the\n            plane... just before it exploded?\n\nAlex looks up, stunned. He didn't even recall this until now.\n\n<b>                        ALEX\n</b>            No!\n\n<b>                        SCHRECK\n</b>            Why'd you say it?\n\nHe considers, owing them an explanation. The he realizes...\n\n<b>                        ALEX\n</b>            Because... I... never thought it \n\t\twould really happen.\n\nWeine leans foward...\n\n<b>                        WEINE\n</b>            If that's the case, Alex... why did \n\t\tyou really get off the plane?\n\nCAMERA INCHES IN as Alex considers, confused, emotional...\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. A ROOM - AIRPORT - NIGHT - TOD\n</b>\nCAMERA CONTINUES THE MOVE on Tod... as if just realizing...\n\n<b>                        TOD\n</b>            My brother... told me to keep an eye \n\t\ton Alex. He stayed... and I went to \n\t\tmake sure Alex was okay.\n                  (a whisper)\n            He told me to get off the plane.\n<b>\t\n</b><b>INT. A SECOND ROOM - AIRPORT - NIGHT - MS. LEWTON\n</b>\ndisplaying a similar sickened expression as Tod...\n\n<b>                        MS. LEWTON\n</b>            Larry Murnau told me to get back \n\t\ton... but I told him to go.\n                  (pause, guiltily)\n            I sent him back on the plane.\n\n<b>INT. A ROOM - AIRPORT - NIGHT - WEINE\n</b>\n<b>                        WEINE\n</b>            No one forced you to get off the\n            plane. You told us you aren't friends\n            with any that did... so, why did you\n            leave the airplane?\n\n<b>CLEAR RIVERS\n</b>\nCAMERA INCHES IN as she looks up. With total resolve...\n\n<b>                        CLEAR\n</b>            Because I saw and I heard Alex.\n            And... I believed him.\n\n<b>                                                       CUT TO:\n</b>\n<b>INT. JFK INTERNATIONAL BUILDING - PRESS ROOM #10 - NIGHT\n</b>\nThe surviviors have all returned to the room. They may be a group, but they are alone with their thoughts. The door is opened by Ms. Whale.\n\nAlex's Mother and Father lead by a group of parents into the room. Each moves with grief, yet relief, to their child.\n\nBarbara Browning grabs hold of Alex and holds him tight. The mother begins to cry. Ken Browning, eyes welling with tears, grabs his son's hand and squeezes. Alex does not cry. While holding his mother, he watches the others.\n\n<b>ALEX'S POV - CARTER AND TERRY\n</b>\nTheir parents are concerned, but do not demonstratively show affection. Carter appears as if he wants to hug his MOTHER, but he can't bring himself to betray his self-image.\n\n<b>ALEX\n</b>\nhis eyes moves toward...\n\n<b>CLEAR RIVERS\n</b>\nalone, hurt that no one has come to take her home.\n\n<b>ALEX\n</b>\nhis eyes find...\n\n<b>TOD AND HIS FATHER\n</b>\nJERRY WAGGNER holds his son, both of them releasing anguished tears. Through his grief, however, Jerry stares at Alex with an expression of anger and accusation.\n\n<b>ALEX\n</b>\nCAMERA PUSHES IN ON HIM as he holds his mother tightly. OVERLAPPING... A CRACK OF THUNDER!\n\n<b>                                                   CUT TO:\n</b>\n<b>INT. KEN BROWNING'S CAR - NIGHT\n</b>\nAlex sits in the back against the door, looking out the window at the storm. Clear Rivers is pressed against the other door. Everyone is slient. Outside, the STORM angrily rages.\n\nAlex is unaware that Clear is watching him, searching for some answer that she will not now find. She looks up.\n\n<b>                        CLEAR\n</b>            Here's good.\n\nThe car pulls over.\n\n<b>                        CLEAR\n</b>            Thank you for the ride.\n<b>\t\t\t\t\n</b>She opens the door and flashes one more look at Alex, but he appears unaware. She exits the car and as the door SHUTS...\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - NIGHT\n</b>\nThe room is empty, but the CAMERA is SLOWLY MOVING, as if ITSELF a PRESENCE. O.S., FOOTSTEPS move up the stairs. Alex appears, his parents behind him. He clicks on the light, sending a soft, safe, orange glow across the room.\n\n<b>ALEX\n</b>\nstands in the threshold of the doorway. His mother places a comforting hand on his shoulder.\n\n<b>ALEX'S POV - PENNANT\n</b>\nMt. Abraham High School Fighting Colonials.\n\n<b>ALEX\n</b>\nand now, the tears arrive. He begins crying, SOBBING, as his mother and father hold him. O.S., OUTSIDE... lighting FLASHES... THUNDER RUMBLES...\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. LIVING ROOM - BROWNING HOUSE - NIGHT - TV\n</b>\nCNN broadcasts video footage of the disaster. Seat cushions and personal belongings float in the harsh floodlights.\n\n<b>LIVING ROOM\n</b>\nIt is late and dark. Only the pale light of the TV spills across the living room. Ken and Barbara have fellen asleep, but their son remains awake.\n\nAlex's red eyes are locked on the screen, mortified. O.S., a VICIOUS CRACK of LIGHTNING and immediate THUNDER... as if calling Alex to the window. He remains fixed on the TV.\n\n<b>ALEX'S POV - TV\n</b>\nAn image of Hell as jet fuel burns on the ocean. O.S., as if furious at the slight, THUNDER BANGS...\n\n<b>ALEX\n</b>\nHe turns, stands... and moves to the picture window, pulling the curtains aside as CAMERA PUSHES IN ON HIM...\n\n<b>ALEX'S POV - THE STORM\n</b>\nIt is as if Nature is angry. Lightning BOLTS spiderweb across the sky. THUNDER BOOMS.\n\nA shard of lightning breaks across the front yard. Oddly, it does not make contact. In the split-second strobe of lightning flash, the bolt abstractly appears as if it were a hand pointing directly at Alex.\n\n<b>ALEX\n</b>\nhorrified, lurches away from the window, considering what he has seen. Just felt on the ROAR OF THUNDER...\n\n<b>                                             CUT TO BLACK:\n</b>\nOver black:\n\n<b>                        MINISTER (V.O.)\n</b>            Thirty-nine days have passed since\n            we've lost our thirty-nine loved ones,\n            friends, and teachers.\n\n<b>FADE IN:\n</b>\n<b>EXT. MT. ABRAHAM HIGH SCHOOL - DAY - CLOSE - ALEX\n</b>\nwearing a dark suit and tie, sits beside his parents on white folded chairs. His head is bowed, guilty and sad...\n\n<b>                        MINISTER (CONT'D)\n</b>            As each day passes without a\n            determining cause for the accident,\n            we ask ourselves, \"Why?\"\n\nAlex raises his eyes and looks across the ceremony...\n\n<b>ALEX'S POV - TOD\n</b>\nsits with his mother, LINDA WAGGNER and his father, Jerry. Destraught, Jerry stares off blankly at the minister.\n\n<b>                        MINISTER (CONT'D)\n</b>            Ecclesiastes tell us, \"Man no more \n\t\tknows his time than fish taken in \n\t\tthe fatal net...\n\n<b>ALEX\n</b>\nguiltily averts his eyes. Ken notes this and wraps a comforting arm around his son.\n\n<b>                        MINISTER (CONT'D)\n</b>            ...or birds trapped in the snare...\n\nAlex checks over his shoulder.\n\n<b>ALEX'S POV - OVER HIS SHOULDER - LAST ROW OF SEATS\n</b>\nSpecial agents Schreck and Weine subtly survey the area, taking notes. Although their eyes are beyond sunglasses, the tilt of their head indicates they are watching Alex.\n\n<b>                        MINISTER (CONT'D)\n</b>            ...like these the children of men...\n\n<b>ALEX\n</b>\nturns away, tense. He looks at the minister.\n\n<b>                         MINISTER (CONT'D)\n</b>            ...caught when the Time falls\n            suddenly upon them.\"\n\nCAMERA PUSHES INTO ALEX, feeling eyes upon them. He looks up...\n\n<b>ALEX'S POV - CLEAR RIVERS\n</b>\nis actually sexy and a bit scandalous in her black dress. Still, she is off by herself, eyes burning at Alex as if challenging him to challenge the words being spoken.\n\n<b>ALEX\n</b>\nself-consciously turns away, unable to face her, let alone the words being spoken.\n\n<b>                        MINISTER (CONT'D O.S.)\n</b>            And so before we can heal, before we \n\t\tcan escape the presence of Death\n\t\tTime, we must mourn and celebrate\n            theirs with this memorial.\n\n<b>WIDER\n</b>\nA student with a guitar and harmonica stands at the microphone. Without introduction, he begins Neil Young's \"Long May You Run.\"\n\nTwo other students remove a cloth, unveiling a memorial sculpture etched with the names of the departed. The gathered stand and begin paying their respects to the memorial.\n\n<b>MEMORIAL LINE\n</b>\nCarter and Terry appear IN FRAME. Terry holds a rose. As they move slowly up toward the memorial, Alex gets in line behind them. Carter knows Alex is there, but will not look at him.\n\n<b>                        CARTER\n</b>            Hope you don't think, Browning, that \n\t\tbecause my name ain't on this wall... \n\t\tthat I owe you anything.\n\n<b>                        ALEX\n</b>            I don't.\n\n<b>                        CARTER\n</b>                  (re: victims)\n            All I owe is these people.\n                  (turns to Alex)\n            To live my life to the fullest.\n\nAlex winces from Carter's breath...\n\n<b>                        ALEX\n</b>            Then maybe you should lay off the \n<b>\t\tJ.D.\n</b>\nCarter has an angry reflexive reaction, grabbing Alex threateningly by the forearm. Terry immediately tries to get Carter to release his hold.\n\n<b>                        CARTER\n</b>            Don't ever fucking again tell me \n\t\twhat to do. I control me. Not you.\n\nCarter and Alex lock eyes, Alex refraining from showing any pain caused by Carter's grip. Terry finally gets him to release.\n\n<b>                        CARTER\n</b>            I'm never gonna die.\n\nHe moves off. Terry, however, holds a beat, eyes Alex and gently rubs the area of his arm, as if this is the only manner she can extend her gratitiude in Carter's presence. As Alex pats her arm, Terry quickly moves off.\n\nShaken, Alex considers whether to move foward to the memorial. He steps aside to let the others go ahead as Billy Hitchcock, who has finished paying his respects, spots Alex and heads back up the line.\n\n<b>                        BILLY\n</b>            I took my driver's test this week at\n\t\tthe DMV...\n\nAlex turns to him, increudlously..\n\n<b>                        BILLY\n</b>            Got a 70. Lowest score, but I \n\t\tpassed. When I was done with the \n\t\ttest, the guy who drives with you\n\t\tduring the test, he goes, \"Young \n\t\tman, you're going to die at a \n\t\tvery young age.\"\n                 (beat)\n            That true?\n<b>\t\t\n</b><b>                        ALEX\n</b>            Not here, not now.\n                 (beat)\n            Not EVER!\n\nBilly sighs, and moves OUT OF FRAME, only to quickly RE-ENTER...\n\n<b>                        BILLY\n</b>            If I ask out Cynthia Paster, will \n\t\tshe say \"no?\"\n\nAlex flashes Billy an angry glare. He gets the message and moves off, for good. Alex returns in line, moving toward the memorial.\n\nValerie Lewton places a rose at the base of the memorial then studies the engraved names as the students move past behind her. Alex approaches, watching her as she reaches out with a trembling finger, touching the etched names...\n\n<b>CLOSE - MEMORIAL\n</b>\nLinda Krauss... Thomas Lewis... John McConnell.\n\n<b>RETURN\n</b>\nAlex stands near her, sympathetically, understanding her pain....\n\n<b>                        ALEX\n</b>            Ms. Lewton...\n\nHer eyes fill with tears and fear. Alex places a comforting hand on her shoulder, but she reacts quickly, pulling away from him, her eyes piercing at him.\n\n<b>                        MS. LEWTON\n</b>            Don't talk to me. You scare the hell\n            out of me.\n\nAlex is shattered as the teacher moves away. Tod ENTERS and faces the memorial.\n\n<b>                        TOD\n</b>                 (a greeting)\n            Hey.\n\nAlex notices Tod is in line behind him. Alex looks around for Tod's father. He is not in line...\n\n<b>                        ALEX\n</b>            I don't want to sound gay, or\n            nothin, but... I miss you.\n\nTod subtly nods, reaching out to the memorial.\n\n<b>CLOSE - MEMORIAL\n</b>\nTod's hand moves across his brother's name... GEORGE WAGGNER.\n\n<b>RETURN\n</b>\nAs Tod longs for his brother, then looks at his friend.\n\n<b>                        TOD\n</b>            Me, too.\n                  (beat)\n            But my dad doesn't understand. When \n\t\the's better; you and me, road trip \n\t\tto the City. Catch the Yanks.\n\n<b>                        ALEX\n</b>            That's a plan.\n\nTod nods. The two friends stand uncomfortably foar a beat before Tod gestures to the podium.\n\n<b>                        TOD\n</b>            I gotta go. This thing Ms. Lewton\n            showed me in her class, they're \n\t\tgonna let me read it. It says what \n\t\tI'm feeling.\n\nTod holds his friend's arm for strength as he passes. Clear Rivers appears in line, holding a rose. She looks at the memorial, before her startling eyes turn to Alex. Even away from these circumstances, Alex would have trouble handling her intense maturity. As he begins to step away, she thrusts the rose to him. He looks up, puzzled.\n\n<b>                        CLEAR\n</b>            Because of you... I'm still alive. \n\t\tThank you.\n\nAlex takes the rose and she walks away. CAMERA PUSHES IN ON HIM as he eyes... feels... the red flower.\n\n<b>                        TOD (V.O.)\n</b>            We say that the hour of death\n            cannot be forecast...\n\n<b>                                                       TIME CUT:\n</b>\n<b>EXT. MT ABRAHAM HIGH SCHOOL - DAY - THE PODIUM\n</b>\nTod nervously stands before the assembly, reading aloud with a sad, yet optimistic resolve. CAMERA PUSHES IN, at an ominous ANGLE and rhythm, to the podium.\n\n<b>                        TOD (CONT'D)\n</b>            But when we say this, we imagine \n\t\tthat the hour is placed in an \n\t\tobscure and distant future.\n\nAs he speaks, the sunlight suddenly turns to shadow.\n\n<b>ALEX\n</b>\nlooks up at the sky...\n\n<b>THE SKY - ALEX'S POV\n</b>\nWithin the deep blue, a single black cloud blocks the sun.\n\n<b>ALEX\n</b>\nCAMERA INCHES IN as, troubled, he looks back to Tod...\n\n<b>TOD\n</b>\nas he continues to read...\n\n<b>                        TOD (CONT'D)\n</b>            It never occurs to us that it has \n\t\tany connection with the day already \n\t\tbegun or that death could arrive \n\t\tthis same afternoon.\n\n<b>                                                  CUT TO:\n</b>\n<b>EXT. WAGGNER HOUSE - NIGHT - ESTABLISHING\n</b>\nStorm clouds devour a waxing crescent moon above a modest home set amongst the edge of the woods.\n\n<b>                        TOD (V.O., CONT'D)\n</b>            This afternoon... which is so \n\t\tcertain... and which has every hour \n\t\tfilled in advance.\n\n<b>INT. LIVING ROOM - WAGGNER HOUSE - NIGHT\n</b>\nA lone light glows. Jerry Waggner has fallen asleep, perhaps passed out, reclined in \"dad's chair.\" Tod's mother is asleep on the sofa, balls of tissue on the floor. Tod enters the room and stares sadly at his parents...\n\nTod picks up a glass and swigs the remainder of his father's scotch before moving off and climbing the stairs.\n\n<b>                                                     CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - NIGHT - CLOSE - TABLE FAN\n</b>\nswivels as it distributes its breeze.\n\n<b>ALEX\n</b>\nsits at his desk, dark circles beneath his eyes. Swamping the desk are printouts of Internet Web pages and newspaper articles concerning the crash of Flight 180, forensic engineering textbooks, NTSB reports on past airline disasters and... REALITY BEYOND MATTER: Vaishnava Philosophy.\n\nAlex studies his mountain of research, increasingly obsessed.\n\nAn O.S. paper FLUTTER draws his attention to the newspaper being blown by the fan. He reaches out and grabs it. Headlines and photos report on the memorial service.\n\nCAMERA PUSHES IN as he sighs, troubled...\n\n<b>ALEX'S POV - NEWSPHOTO\n</b>\nClear Rivers sits in her seat, legs crossed, alluring and sexy and \nmysterious.\n\n<b>ALEX\n</b>\ncloses the paper, puzzled by his reaction. He shakes it off and throws the paper on the desk. Alex considers for a beat, then pulls open a lower drawer. Digging through the mess inside, he finds his stash... the April 1997 issue of Penthouse.\n\n<b>                                                      CUT TO:\n</b>\n<b>INT. BATHROOM - WAGGNER HOUSE - NIGHT\n</b>\nAlight CLICKS on REVEALING an old, '20's built bathroom. The toilet is beside the bathtub/shower, with just enough knee space to the counter cabinets when one lifts the toilet seat.\n\nTod puts the lid down and UNSNAPS his jeans. As he turns, pulls his pants down and sits, CAMERA MOVES to the CURTAINS... still... until a cold soft breeze causes them to billow. CAMERA FOLLOWS the wind as it CONTINUES into the room, rippling across shower curtains.\n\nAs the breeze passes Tod, he pauses... as if sensing, but not \nunderstanding... this is more than a wayward autumn breeze. He moves to close the window, however, CAMERA CONTINUES as the air makes ITS way to the door.\n\nThe door is softly pushed closed by the breeze.\n\n<b>BACK OF THE TOILET TANK\n</b>\nTod sits, back to CAMERA, which CRANES DOWN the tank, STOPPING behind the locking nut and water line pipe.\n\nAs the toilet FLUSHES O.S., CAMERA NOW MOVES INTO the locking nut, which begins to slightly rattle. Drips of water stream from the tank onto the floor.\n\n<b>                                                    CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - NIGHT\n</b>\nAlex flips the magazine open to a centerfold.\n\n<b>PENTHOUSE PICTORIAL\n</b>\nThe model's pose and expression tempt Alex towards the momentary respite form his troubles. The caption beneath the centerfold pictorial reads, \"Tymme Has Come Today!\"\n\n<b>ALEX\n</b>\nconsiders the reports on the Flight 180 crash, then returns his attention to the magazine. He unzips his pants, then pauses... his eyes returning hesitantly to the newspaper photo of Clear...\n\n<b>                                                     CUT TO:\n</b>\n<b>INT. BATHROOM - WAGGNER HOUSE - NIGHT- CLOSE- RAZOR BLADE\n</b>\nwaits on the counter. CAMERA PULLS AWAY as Tod picks it up. He looks at his face in the mirror, as if behind him... a black indiscernible form, like a shadow, however, actually a presence incapable of reflecting light.\n\nTod whips around...\n\na puddle forms, creeping toward the heel of Tod's stocking feet.\n\n<b>TOD\n</b>\nturns on the faucet and grabs his toothbrush, squeezing paste onto the bristles.\n\n<b>CLOSE - FAUCET\n</b>\nthe f.g. running water is out of FOCUS. In the b.g. sits an unplugged radio.\n\n<b>TOD\n</b>\nnotes the radio. CAMERA FLLOWS HIS HAND as he grabs the plug.\n\n<b>THE PUDDLE ON THE FLOOR\n</b>\ngrows closer to his foot...\n\n<b>ELECTRICAL SOCKET\n</b>\nthe radio plug is inserted.\n\n<b>TOD\n</b>\nturns on the radio...\n\n<b>                        JOHN DENVER (V.O.)\n</b>            And they say that he got crazy\n            once and he tried to touch the sun.\n\nspooked, quickly turns it off, unplugs it and pushes it aside.\n\n<b>THE PUDDLE ON THE FLOOR\n</b>\ncontinues to grow...\n\n<b>                                               CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - NIGHT - NEWSPHOTO - CLEAR RIVERS\n</b>\nOdd how one can appear so erotic at a funeral.\n\n<b>ALEX\n</b>\nstudies the photograph, then notices the rose she gave him. Succumbing to guilt, feeling like the freak all teenagers believe they are, Alex sets the paper back on the desk. He grabs the Penthouse and turns, opening the desk drawer in order to return the magazine, however...\n\nA LOUD BANG turns Alex's head to the window!\n\n<b>ALEX'S POV - WINDOW\n</b>\nAn OWL has apparently smashed into the window, awkwardly flapping its large wings, then turns its head toward Alex, large yellow eyes shining like an alien creature.\n\n<b>WIDER\n</b>\nStartled, Alex reflexively throws the Penthouse across the room, pages tearing as it hits the sill. The giant bird flies off.\n\n<b>THE TABLE FAN\n</b>\nswivels, a page catching in the whirling blades.\n\n<b>A PIECE OF PAPER\n</b>\ntorn form the magazine flits across the room.\n\n<b>ALEX\n</b>\nCAMERA INCHES IN ON HIM as the piece of paper ENTERS FRAME, floating and flitting until landing on his knee. He picks it up and turns it over...\n\n<b>ALEX'S POV - PIECE OF PAPER\n</b>\nis torn in such a manner that the only lettlers remaining from the \ncenterfold's caption are \"...Tod...\"\n\n<b>                                                    CUT TO:\n</b>\n<b>INT. BATHROOM - WAGGNER HOUSE - NIGHT - SHOWER CURTAIN\n</b>\nis pulled aside REVEALING two pairs of Linda Waggner's nylons drying on a retractable clothesline.\n\n<b>THE PUDDLE ON THE FLOOR\n</b>\nhis foot slips...\n\n<b>TOD\n</b>\nfalls foward.\n\n<b>THE RETRACTABLE CLOTHESLINE\n</b>\nretracts! WHIPPING wildly!\n\n<b>THE SOAP DISH\n</b>\nTod's hand tries to grab anything to hold him. His hand slips, knocking over a bottle of shampoo.\n\n<b>TOD'S NECK\n</b>\nthe thin clothesline coils around his neck. The plastic anchor wraps beneath the cord, essentially creating a noose.\n\n<b>PUDDLE ON THE FLOOR\n</b>\nHe slips again.\n\n<b>TOD\n</b>\nfalls against the back wall of the shower stall, pulled by the retracting wire. He kicks with his feet, desperately trying to gain a footing.\n\n<b>SHOWER HEAD - TOD'S POV\n</b>\nquickly, reflected in the chrome... the dark shadow approaches...\n\n<b>BATHTUB\n</b>\nTod's feet slip in the slick shampoo and water.\n\n<b>CLOSE - TOD'S EYES\n</b>\nflare. Blood vessels burst. He GROANS, attempting to call out.\n\n<b>THE BATHROOM DOOR\n</b>\nis closed.\n\n<b>INT. LIVING ROOM - WAGGNER HOUSE - NIGHT\n</b>\nTod's parents remain asleep. O.S., a FAINT MUFFLE can be HEARD.\n\n<b>INT. BATHROOM - WAGGNER HOUSE - NIGHT - CLOSE - TOD'S NECK\n</b>\nhis hands tear at his flesh, desperately trying to pull the cord from his neck.\n\n<b>TOD'S EYES\n</b>\ndart desperately toward the counter.\n\n<b>ON THE COUNTER\n</b>\na pair of nose-hair scissors.\n\n<b>TOD\n</b>\nCHOCKING, GASPING, face turning purple, reaches for the counter.\n\n<b>ON THE COUNTER\n</b>\nTod's hand ENTER FRAME. The scissors, sadistically just out of reach.\n\n<b>TOD'S FACE\n</b>\nFALLS INTO FRAME, suspended by the cord, propped against the back wall of the shower stall, his bluish purple tongue grotesquely juts from his mouth.\n\n<b>TOD'S POV - DEATH\n</b>\nall four edges of FRAME appear to collapse as if by weight of the darkness until forming a myopic center. Then, from within the center... appears Tod's face. Although the expression is serene the pallor is grayish, until... suddnely, shockingly... Tod's face decays, as if ten years of rot in the grave is compressed into 72 FRAMES.\n\n<b>TOD\n</b>\nThe moment of realization...\n\n<b>HIS FEET\n</b>\nkick upon the slippery basin. After a beat... they stop.\n\n<b>TOD\n</b>\nAs his body settles... dies... CAMERA PULLS AWAY fully revealing his lifeless form. Once behind the toilet tank, CAMERA CRANES DOWN to the floor. The water eerily retreats from the floor, slipping back toward the base of the toilet and like a murderer, slips out of the night.\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. WAGGNER HOUSE - LATER - CLOSE - SIREN LIGHTS\n</b>\nwhirl and flash INTO CAMERA. CAMERA CRANES DOWN, ADJUSTING to REVEAL a Paramedics vehicle, a Sullivan County, N.Y. Sheriff's patrol car and unmarked sedan.\n\nCAMERA CONTINUES MOVING UNTIL REVEALING Alex Browning racing down the sidewalk. He runs into a CLOSE-UP, sweating, out of breath, expression horrified as he takes in the scene before him.\n\n<b>SPECIAL AGENTS SCHRECK AND WEINE\n</b>\nstand in the front yard. Schreck subtly redirects Weine's attention toward...\n\n<b>ALEX - SPECIAL AGENT'S POV\n</b>\nThe boy franically moves to a paramedic.\n\n<b>                        ALEX\n</b>            What happened? Is Tod alright?\n\n<b>SCHRECK AND WEINE\n</b>\nhearing this, they turn to one another, with an expression suggesting a deepening suspicion.\n\n<b>ALEX\n</b>\nsees the officers. Assuming they are sympathetic to his concern, he starts toward them, until...\n\n<b>                        CLEAR (O.S.)\n</b>            Alex!\n\nAlex stops, looks around. Behind the tree and in the shadows of the adjacent house, stands Clear Rivers.\n\n<b>                        CLEAR (CONT'D)\n</b>                 (a warning)\n            Get outta here!\n\nCAMERA PUSHES INTO ALEX, stunned, but before he can ask any further questions, a METALLIC CLACKING draws his attention back toward the house.\n\n<b>ALEX'S POV - A COVERED GURNEY\n</b>\nis rolled out of the front door by paramedics and an official with a jacket marked \"CORONER,\" Behind the body follows Tod's father. He pauses in the doorway as he spots Alex in the front yard.\n\n<b>ALEX\n</b>\nis pale, nauseous. His eyes follow his friend's dead body as it is rolled toward the paramedics vehicle. Tod's father approaches Alex, the agents stand nearby.\n\n<b>                        ALEX\n</b>            What... what happened?\n\nMr. Waggner glares at Alex, accusingly.\n\n<b>                        MR. WAGGNER\n</b>            Didn't you... \"see\" it?\n\nAlex is stung, guilty. He averts his eyes. Schreck and Weine note this reaction.\n\n<b>                        MR. WAGGNER (CONT'D)\n</b>            Couldn't you \"predict\" it?\n            Couldn't you read his mind?\n<b>\t\t\n</b>Alex remains silent, hurt.\n\n<b>                        ALEX\n</b>            Mr. Waggner...\n\n<b>                        MR. WAGGNER\n</b>            You caused Tod so much guilt over \n\t\tGeorge staying on the plane that...\n                 (breaking down)\n            He took his own life.\n\nAlex is stunned, defensive.\n\n<b>                              ALEX\n</b>                  He wouldn't do it!\n\nMr. Waggner turns toward the paramedics van, as if \"there's the proof.\"\n\n<b>                        ALEX\n</b>            He... he told me we would be friends\n            again after you got better. After \n\t\tyou got over George. Why would he \n\t\tmake plans for the future if he were \n\t\tplanning on killing himself?\n\n<b>                        MR. WAGGNER\n</b>            All my wife and I will ever know is \n\t\twe wouldn't have lost our youngest \n\t\tson... if you'd told our oldest to \n\t\tget off the plane.\n\nAlex is rocked as if having taken a punch to the face. Mr. Waggner begins to walk toward the peramedics vehicle. Alex eyes the F.B.I. agents, who, after studying for a beat, turn and move toward their vehicle.\n\nThe gathered spectators begin whispering to one another, clearly about Alex, causing him to search for, what appears to be, his only ally, Clear Rivers.\n\n<b>ALEX'S POV - ADJACENT YARD\n</b>\nClear is gone.\n\n<b>FRONT YARD\n</b>\neveryone has moved away from Alex, leaving him very alone. Alex's eyes remained locked on the peramedics' vehicle. As the ambulance doors CLOSE on the body of his best friend...\n\n<b>                                                    CUT TO:\n</b>\n<b>EXT. NEIGHBORHOOD - DAY - CLOSE - LEAVES ON TREES\n</b>\nA soft summer breeze passes through the leaves on a tree. A yellow leaf drops from the branch and flutters to the ground. CAMERA FOLLOWS until it falls upon an old cracked sidewalk.\n\nA pair of worn Nikes ENTER FRAME just as the leaf drops before them. The feet and CAMERA HOLD until CRANING UP to REVEAL Alex, staring at the leaf with an expression reminiscent of the torn paper's message about  \"...Tod.\"\n\n<b>                        CLEAR  (O.S.)\n</b>            Almost Autumn.\n\nAlex looks off toward a small unkept house, nestled at the edge of the woods. In the open garage stands Clear Rivers amongst cluttered artwork, supplies and tools. Her t-shirt's sleeves have been cut off and neck-line cut low. Her jeans have a revealing hole at the spot which once was a back pocket. She wears heavy black work shoes. A dog rests nearby on the floor.\n\n<b>                        ALEX\n</b>            It's only the end of June.\n\n<b>                        CLEAR\n</b>                  (shrugs)\n            Yeah, but everthing's always in\n            transition. If you focus, even now, \n\t\tone week into summer... you can feel \n\t\tAutumn coming.\n                  (beat)\n            Almost like bein' able... to see the \n\t\tfuture.\n\nAlex reads her intention loud and clear. She returns to her artwork. The dog GROWLS softly as Alex appraches the garage.\n\n<b>INT/EXT. GARAGE - CLEAR RIVERS' HOUSE - DAY\n</b>\nEntering the garage, Alex gets a closer look at her artwork. It's abstract sculpture and canvas work and pretty bad, at that.\n\n<b>                        CLEAR\n</b>            Know what this is?\n\nShe gestures to him to approach her. He tenses, awkward, but moves closer. Clear lifts a plastic cover off a canvas. Beneath is a mess of green and brown and orange; teen angst poorly communicated. Glued to the center is a twisted piece of metal.\n\n<b>                        ALEX\n</b>            Like, um... you're mad about\n            something?\n\nShe sighs, \"thanks a lot,\" then proud, but not enough to make her appear foolish over her bad artwork, indicates the metal.\n\n<b>                        CLEAR\n</b>            A piece of debris... from the plane. \n\t\tI went to the shore off the crash \n\t\tsite and it washed up on the beach.\n\n<b>                        ALEX\n</b>            You went there? I've wanted to go \n\t\tthere, but I thought it was off \n\t\tlimits.\n\n<b>                        CLEAR\n</b>            It is. But that didn't stop me.\n            Shouldn't stop you.\n\nAlex gently touches the piece of the plane, almost expecting to feel something more than cold metal. He looks to Clear...\n\n<b>                        ALEX\n</b>            Why were you there last night?\n\nWhile she cleans brushes with a can of turpentine...\n\n<b>                        CLEAR\n</b>            Look, I've seen enough T.V. to know\n            the F.B.I. doesn't investigate teen\n            suicides. But they were there last \n\t\tnight, that means: one, they still \n\t\tdon't have a clue what caused the \n\t\tcrash. Two, they haven't ruled out \n\t\tanything. And the fact that seven\n            people got off the plane is probably \n\t\tweird enough, not to mention, that \n\t\tone of those people had a vision, or \n\t\twhatever, of it exploding minutes \n\t\tbefore it did explode, is highly\n            suspicious. And it doesn't help that \n\t\tthe visionaries' friend just \n\t\tcommitted suicide.\n\nAlex eyes her for a long beat. She turns away from him, returning the can of turpentine to a shelf.\n\n<b>                        ALEX\n</b>            Why were you there last night?\n\nClear turns to Alex. The two couldn't appear more different. She moves to a sculpture, an ugly black and green globular sculpture with a white dot in the center.\n\n<b>                         CLEAR\n</b>            Know what this is?\n\nAlex, cocks his eyebrow probably thinking, \"a mess?\" but tactfully shakes his head \"no.\"\n\n<b>                         CLEAR\n</b>            It's you.\n\nRemaining dry and stoned faced, Alex tenses, uncomfortable.\n\n<b>                         CLEAR\n</b>            Not a likeness. It's how you make \n\t\tme feel, Alex.\n\n<b>                         ALEX\n</b>            I'm... really sorry.\n\n<b>                         CLEAR\n</b>            Like you, the sculpture doesn't even\n            know what, or why, it is. Reluctant\n            to take form. And, yet, creating an\n            absolute but incomprehansible \n\t\tattraction.\n\nUncertain, and yet moved, Alex listens.\n\n<b>                         CLEAR (CONT'D)\n</b>            Before that day, you were just \n\t\tanother suburban nothing that would \n\t\tnever have anything to do with my \n\t\tlife. And I'm sure you thought I was \n\t\tsome Marilyn Manson body-pierced \n\t\tfreak, or whatever.\n                       (beat)\n            But at that moment... on the plane... \n\t\tI felt what you felt. I didn't know \n\t\twhere all those emotions were coming \n\t\tfrom until you started freaking out.\n\nAlex sighs, embarrassed.\n\n<b>                        CLEAR (CONT'D)\n</b>            I didn't see what you saw, but I\n\t\tfelt it. Okay, I'm not into all that \n\t\tX-Files bullshit... but it was a \n\t\tpsychic connection. Why to me? Why \n\t\tto you?\n\nJarred, he eyes her, frightened.\n\n<b>                        CLEAR\n</b>            And you can still feel it, can't \n\t\tyou? Something from that day is \n\t\tstill with you. I know, because I \n\t\tcan still feel you.\n\nAlex is increasingly uncomfortable with the subject, but eased by Clear's apparent, somewhat, understanding. Lowering his tone...\n\n<b>                        CLEAR\n</b>            That's why I was there last night.\n\n<b>                        ALEX\n</b>            I've never dealt with death before.\n            I wasn't alive when my grandparents\n            died. I wish I could know. I mean, \n\t\tall this... could just be in our \n\t\theads. Now it feels like it's \n\t\teverywhere.\n\n<b>                        CLEAR\n</b>            \"It?\"\n<b>\t\t\t\t\n</b><b>                        ALEX\n</b>            What if Tod... is just the first...\n            of us?\n\nThe idea sends a shot of apprehension through Clear.\n<b>\t\t\t\t\n</b><b>                        CLEAR\n</b>            Is that something you're \"feeling?\"\n\n<b>                        ALEX\n</b>            I don't know. I wish I could just see\n            him... one more time, then, maybe... \n\t\tI would know.\n\n<b>                        CLEAR\n</b>            Then, let's go see him!\n\nAlex reacts, shocked and yet her impulsiveness is exciting...\n\n<b>                                                    CUT TO:\n</b>\n<b>INT. FUNERAL HOME - FOYER - NIGHT\n</b>\nCAMERA is LOW, moving across the paisley carpet. Dim light, spilling through the stained glass windows, falls upon the creepy decor, appearing as if designed by a morose Laura Ashley, floor model coffins and urns. CAMERA CONTINUES, TILTING UP to the CEILING, REVEALING a stained glass skylight. Outside, on the roof, two silhouettes appear...\n\nThe skylight hinges CRACK open. Clear leads the way. lifting the frame, then dropping it throught the skylight window.\n\nAlex is not as smooth as his socius criminus. Using his knee to slow his descent, he hangs from the sill for a moment before dropping to the carpet.\n\nCAMERA MOVES WITH Alex and Clear through the unsettling reception area; plastic flowers, gold candelabra, plaster cherubs and angels. A bronze plaque identifies: \"MT. ABRAHAM FUNERAL HOME. THE JOURNEY'S END. WILLIAM BLUDWORTH - INTERMEDIARY.\"\n\n<b>                        CLEAR\n</b>                  (whispering)\n            Gives me a rush...\n\n<b>                        ALEX\n</b>            This place?!\n\n<b>                        CLEAR\n</b>            Doin' somethin' I'm not supposed to.\n\nWith a hot, mischievous smile, Clear proceeds toward the hallway. Alex anxiously sighs... then follows.\n\n<b>INT. DOWNSTAIRS HALLWAY - FUNERAL HOME - NIGHT\n</b>\nAn elevator with collapsible metal door lowers INTO FRAME. Pushing the door aside, Alex and Clear proceed into the hallway, lined with morgue green tile. Stainless steel gurneys and porcelain equipment holding yellow surgical tubing and thick foot-long needles sit in the corridor.\n\nA faint light spills from beneath a doorway. Clear reaches out to the knob but Alex quickly grabs her hand. From a cart behind them, he pulls a latex glove out of a box and snaps it on.\n\n<b>                        CLEAR\n</b>            Good call. Very \"Quincy.\"\n\nAlex tries the doorknob. Locked. He looks at her, defeated. Clear quickly points to some mortician's tools on the cart.\n\nFrom it, Alex produces a thin six inch needle. He inserted the tool in the lock and jimmies the doorknob. CLACK!\n\n<b>INT. MORGUE - FUNERAL HOME - NIGHT\n</b>\nA lone desk lamp shines. Across the room, laying on a porcelain table, fluid draining tubes attached, lies Tod. A sheet is pulled up to his shoulders. He carries the macabre appearence of a corspe having been made up by a mortician. Hair combed and sprayed, skin tone too orange, blush too rouge and lips too red.\n\nAs Alex and Clear approach...\n\n<b>                        ALEX\n</b>            That... him?\n\n<b>                        CLEAR\n</b>            I think. But why'd they make him\n            up like... Michael Jackson?\n\n<b>                        ALEX\n</b>            That's him, but... he's not here. \n\t\tThat... whatever... that whatever \n\t\tmade him Tod is gone.\n\nSuddenly, Tod jerks; his hand lifting four inches...\n\n<b>            ALEX                         CLEAR\n</b>Ahhh! fuck! You fucking\t\t Ohmygod! OHMYGOD! OHMYGOD!\nasshole. You think this        He's not dead? \nis funny, you fucking \ndick? Tod, if you're \nnot dead I'm gonna\nfucking kill you!\n\n<b>                        MR. BLUDWORTH (O.S.)\n</b>            Please don't yell...\n<b>\t\t\n</b>Both are jolted again with shock, turning toward the voice...\n\n<b>MR. BLUDWORTH\n</b>\nCAMERA PUSHES, LOW ANGLE, INTO WILLAIM BLUDWORTH, an African-American man, early 50's, dressed in dark suit and tie.\n\n<b>                        MR. BLUDWORTH\n</b>            You'll wake the dead.\n\nHe flashes a dry mortician's smile, pleased by his wan pun. Alex and Clear haven't recovered from the corspe's actions to calmly address Bludworth..\n\n<b>                        ALEX\n</b>            Why..?\n\nAlex completes his question by raising his hand, ala Tod's dead body. Bludworth nods, understanding...\n\n<b>                        MR. BLUDWORTH\n</b>            Chemicals in the vascular flush\n            create cadaveric spasm.\n\nAs the startle of the situation settles, it dawns on Alex that they have been busted. He nervously offers an explanation.\n\n<b>                        ALEX\n</b>            I'm... a friend of his. His best\n            friend. See, his father...\n\n<b>                        MR. BLUDWORTH\n</b>                  (ominous)\n            I know who you are.\nThe mortician eyes Alex, understanding. Alex senses this and eases. Clear moves toward Tod's body, examining the neck area.\n\n<b>                        CLEAR\n</b>            They said he hung himself, but \n\t\tthere's no marks.\n\n<b>                        MR. BLUDWORTH\n</b>            I crafted a reconstruction of the \n\t\tLaryngeal prominence region with \n\t\tVelvetone Surgical Wax and \n\t\tPermaseal.\n\nClear moves in for a closer look, then calls Alex over to the body. After a beat of reluctance, Alex looks at Tod's neck.\n\n<b>                        ALEX\n</b>            What are all those tiny marks?\n\n<b>ALEX'S POV - CLOSE - TOD'S NECK\n</b>\nThe wounds have been filled with wax and covered by greasepaint. At this proximity, however, it is apparent tiny cuts line the area above and below the large cut made by the wire.\n\n<b>                        MR. BLUDWORTH (V.O.)\n</b>            Cuticle lacerations.\n<b>\t\t\t\t\n</b><b>WIDER\n</b>\n<b>                        ALEX\n</b>            Why would he pull at the wire if he \n\t\twere committing suicide?\n<b>\t\t\t\t\n</b><b>                         CLEAR\n</b>            Why would they say it was a\n            suicide... if it weren't?\n\nBecause of the supernatural \"message\" he recieved, Alex is reluctant to answer. He eyes Mr. Bludworth, who, with a wry half smile, eyes Alex as if aware of the reason behind his hesitation.\n\n<b>                        ALEX\n</b>            His father's pretty fucked up with \n\t\tdenial. Maybe he couldn't deal with \n\t\tthe thought of an other accident... \n\t\ttaking another son.\n\n<b>                        MR. BLUDWORTH\n</b>            In Death...\n\nCAMERA INCHES TOWARD the mortician. In this environment, lit with Fritz Lang shadows, Bludworth's tone, appearance... he could easily be mistaken for personification of the subject.\n\n<b>                        MR. BLUDWORTH\n</b>            ... there are no accidents. No\n            coincidencess. No mishaps.\n                  (smiles)\n            And no... escapes.\n\n<b>                        ALEX\n</b>            You saying Tod did kill himself?\n\nBludworth moves to Tod on the draining table, disconnecting the tubes connecting the body to the embalming chemicals.\n\n<b>                        MR. BLUDWORTH\n</b>            Suicide. Murder. Plane crash. What \n\t\tdoes it matter? He was going to end \n\t\tsomeday. From the minute you're cut \n\t\tloose from the womb... it's a one \n\t\tway ticket on a trip to the tomb.\n\nVile liquid oozes out of the body onto the porcelain table.\n\n<b>                        MR. BLUDWORTH\n</b>            You may not realize it, but we're\n            all just a mouse that a cat has by\n            its tail. Every single move we \n\t\tmake, from the mundane to the \n\t\tmonumental... the red light we stop \n\t\tat, or run; the people we have sex \n\t\twith, or won't with us; the airplane \n\t\twe ride, or walk out of... is all a \n\t\tpart of Death's sadistic design\n            leading to the grave.\n\n<b>                        ALEX\n</b>            Design?\n\nThe mortician considers as he drains some yellowish green fluid from the table. He shrugs then continues his work...\n\n<b>                        MR. BLUDWORTH\n</b>            If Life is like a box of \n\t\tchocolates... Death... Death is like \n\t\ta big Milton Bradley game of \"Mouse\n\t\tTrap.\" The day you're born is just \n\t\tthe boot, hanging from the \n\t\tstreetlamp, kicking the marble to \n\t\tget things rolling. Growing up is \n\t\tonly the marble rolling down the \n\t\tcurving chute. You feel immortal \n\t\thaving survived school, sex, drugs \n\t\t'n' rock 'n' roll, but you've really\n            only upset the big hand holding the \n\t\tsteel ball that falls into the \n\t\tbathtub. Marriage and kids and \n\t\tcareer seem to make it all worthwhile \n\t\tuntil the ball hits the see-saw and \n\t\tflips the diving man into the big \n\t\tbarrel. In the old folks home or the\n            hospital you just see the big cage \n\t\trattling down until it captures... \n\t\tthe mouse.\n                 (beat)\n            Game over.\n\nAlex considers as Clear eyes him, conveying \"this guys's whacked!\" Alex moves toward Bludworth...\n\n<b>                        ALEX\n</b>            Maybe there's no way to win... \n\t\tbut... if you figured out the \n\t\tgame... you knew where the \"steel \n\t\tball was rolling\" couldn't you \n\t\tavoid the trap and extend the \n\t\tplaying time? Couldn't you... cheat \n\t\tDeath at Its own game?\n\nMr. Bludworth looks directly at Alex. CAMERA MOVES IN ON EACH, \nINDIVIDUALLY... this between the two of them.\n\n<b>                        MR. BLUDWORTH\n</b>            You already did that by walking off\n            the plane. Now you gotta out when \n\t\tand how it'll come back at you.\n                  (beat)\n            Play your hunch, Alex. If you think\n            you can get away from it.\n                  (beat)\n            But beware the risk of cheating the \n\t\tplan, disrespecting the design... \n\t\tcould iniciate a horrifying fury that \n\t\twould terrorize even the Grim Reaper.\n                  (beat)\n            And you don't even want to fuck with \n\t\tthat Mack Daddie.\n\nAlex's eyes are locked on Bludworth's chilling, pleasant smile. The mortician yanks on a tube, REVEALING a foot long needle removed from Tod's spinal column. The horrific nature of death is vividly demonstrated to Alex.\n\n<b>                        ALEX\n</b>            I'm sorry we broke in.\n\n<b>                        MR. BLUDWORTH\n</b>            No harm. No foul.\n\nAlex grabs her arm, starting toward the door.\n\n<b>                        CLEAR\n</b>            We didn't find what we were looking\n            for.\n\nAlex looks at Bludworth...\n\n<b>                        ALEX\n</b>            Yeah, we did.\n\n<b>MR. BLUDWORTH\n</b>\nCAMERA PUSHES INTO the mortician, pleased the message has been recieved.\n\n<b>                        MR. BLUDWORTH\n</b>            I'll see you soon.\n\n<b>                                                      CUT TO:\n</b>\n<b>EXT. MAIN STREET - DAY\n</b>\nBRAKING LOUDLY, startlingly, a public bus PULLS INTO CAMERA and stops. The doors HISS open.\n\n<b>                        CLEAR (O.S.)\n</b>            The mortician was whacked.\n\nCAMERA ADJUSTS as Alex and Clear step off the bus and onto the street.\n\n<b>                        CLEAR (CONT'D)\n</b>            He was trippin' on formaldehyde.\n\nClear starts up the street, but Alex grabs her arm and steps back, assuring the bus moves off... safely. He nods, \"it's safe to go.\" Throughout the following, his eyes are searching for anything potentially deadly.\n\n<b>                        ALEX\n</b>            He said Death has a design. Even\n            before he said that I had been\n            seeing patterns.\n\n<b>                        CLEAR\n</b>                  (sarcastic)\n            As in flannels and plaids?\n\nUp ahead, scaffolds rise before a building being restored. O.S., HAMMERING and CONSTRUCTION WORK POUND from above. In the f.g., tools and metal spikes. After a \"thumbs up\" gesture, the rope is pulled UP AND OUT OF FRAME.\n\n<b>                        ALEX\n</b>            How many died on Flight 180?\n            From our group?\n\n<b>                        CLEAR\n</b>            Thirty-nine.\n\n<b>                        ALEX\n</b>            Remember the gate number?\n\nAs Clear takes a moment to consider, Alex steers them well around the scaffolds, eyes skyward during the move...\n\n<b>                        CLEAR\n</b>            No.\n\n<b>                        ALEX\n</b>            Thirty-nine.\n\nThis is a creepy fact. Even though past the construction, Alex checks over his shoulder to assure they are out of harm's way.\n\n<b>                        ALEX\n</b>            Remember the departure time?\n\n<b>                        CLEAR\n</b>            Like... 4:25.\n\nReaching an intersection, Alex pushes the pedestrian traffic light button, then steps well away from the curb.\n\n<b>PEDESTRIAN TRAFFIC SIGNAL\n</b>\nthe halting red hand is lit.\n\n<b>                        ALEX (V.O.)\n</b>            Do you know when I was born?\n\n<b>INTERSECTION\n</b>\nClear sighs, growing impatient with Alex.\n\n<b>                         CLEAR\n</b><b>            4:25.\n</b>\n<b>                         ALEX\n</b>            Right. April 25th.\n\n<b>                         CLEAR\n</b>            Wait. I thought you meant the time\n            of your birth. Four/Twenty-five, as\n            in, month and day... that's a reach.\n\n<b>PEDESTRIAN TRAFFIC SIGNAL\n</b>\nthe halting red hand turns to the little white walking man.\n\n<b>INTERSECTION\n</b>\nClear takes a step off the sidewalk and onto the street. Alex tugs her back, looking both ways while outraged by her challenge.\n\n<b>                        ALEX\n</b>            My birthday is the same as of the \n\t\ttime I was meant to die! That's a \n\t\treach!?\n\nVROOM! A car indeed makes a right, TEARING through the intersection. Once past, Alex takes Clear by the arm and hustles them across the street.\n\n<b>                        CLEAR\n</b>            You're sounding like those people\n            who, you know... \"Oswald shot \n\t\tKennedy from a warehouse and hid in \n\t\ta theatre and Booth shot Lincoln in \n\t\ta theatre and hid in a warehouse.\"\n\nCAMERA HOLDS REVEALING an unmarked sedan parked across and down from a Starbucks with outdoor seating. Schreck and Weine sit in the car, eyes coolly locked on Alex and Clear.\n\n<b>DOWN THE STREET - HEADING WEST\n</b>\nBilly Hitchcock rides toward the Starbucks on his bicycle.\n\n<b>EXT. STARBUCKS - DAY\n</b>\nsitting outside, Alex hunches over the table, increasingly anxious. Clear listens; expression skeptical.\n\n<b>                        ALEX\n</b>            I'm not just layin' down a bunch\n            of math here, with this. I'm talking\n            about indications... omens... that\n            day, that we were meant to die. That,\n            if, we have been aware of... would \n\t\thave saved everyone on the plane.\n\n<b>                        CLEAR\n</b>            That's total bullshit. You can find\n            death omens anywhere you want to.\n\nShe picks up her paper coffee cup.\n\n<b>                        CLEAR (CONT'D)\n</b>            Hey, look! \"Coffee\" starts with a \n\t\t\"C\" and ends with an \"E.\" So does \n\t\tthe word \"choke!\" We're going to \n\t\tchoke to death! Oh no! Starbuck was \n\t\ta whaler. We're going to be \n\t\tharpooned!\n\nAlex angrily glares at Clear. Clear drops her tone.\n\n<b>                        CLEAR (CONT'D)\n</b>            You'll go nuts if you start with\n            that shit.\n\nMs. Lewton appears from around the corner. She starts toward the entrance, but pauses, tensing when she sees Alex.\n\nHe cautiously flashes a greeting smile. The teacher, however, averts her eyes and continues into the coffee shop. Alex sighs, guiltily. Clear sympathizes with both of them.\n\n<b>                        CLEAR\n</b>            She's leaving the school. Moving \n\t\taway.\n\nAlex studies, appealing to her...\n\n<b>                        ALEX\n</b>            Clear, how do we know that by\n            just sitting here, breathing this\n            air or sipping the coffee, having\n            crossed the street... we haven't \n\t\tstarted in motion the events that \n\t\twill lead to our death? Fifty years \n\t\tfrom now. Ten years. Tomorrow.\n                 (beat)\n            You don't unless... you're able to \n\t\topen yourself to the signs I'm \n\t\twilling to show you.\n\nHe leans foward, removing a peice of paper from his pocket.\n\n<b>CLOSE - ALEX'S HAND\n</b>\nslides across the table. Opening his hand REVEALS the piece of paper reading, \"... Tod...\" Clear's hand ENTER'S FRAME to take the paper. CAMERA FOLLOWS AS SHE raises it, her expression obviously puzzled. As she eyes Alex for an explanation, CAMERA CRANES DOWN QUICKLY to the empty paper cups on the table...\n\n... a slight approaching BREEZE knocks them over.\n\n<b>DOWN THE STREET - HEADING WEST\n</b>\nA somewhat cherry 70's muscle car speeds in the direction of the Starbucks. Carter Horton is driving. Terry Chaney rides shotgun. Carter looks out the window.\n\n<b>CARTER'S POV - MOVING - ALEX AND CLEAR\n</b>\nShe holds the paper as Alex, apparently, explains the story.\n\n<b>CARTER'S CAR\n</b>\nCARTER scowls, his anger rising as he slows, staring at the perceived reasons for his problems.\n\n<b>ALEX AND CLEAR\n</b>\nHer eyes turn from the paper to Alex, concerned about him...\n\n<b>                        CLEAR\n</b>            I don't understand... did you see \n\t\tTod die? Did it happen again, like \t\ton the plane?\n\n<b>                        ALEX\n</b>            No, but it might as well be the\n            same thing. This was a message...\n            from someone, or something...\n            hinting... at the design.\n\n<b>                        CLEAR\n</b>            Alex, on the plane... you must have \n\t\texperienced... some kind of hyper \n\t\tawareness. But here... you're\n            suggesting Tod's death... and maybe\n            our own... will happen because of...\n            an active Presence.\n\nAlex nods, feeling she's understanding.\n\n<b>                        ALEX\n</b>            The mortician said Death has a \n\t\tdesign. Now... if you, me, Tod, \n\t\tCarter, Terry, Billy, Ms. Lewton \n\t\tmessed up that design, because, for \n\t\twhatever reason, I was able to see \n\t\tDeath's plan... then we cheated it.\n                  (beat)\n            But what if it was our time, what if \n\t\twe were not meant to get off that \n\t\tplane? What if it is still is our \n\t\ttime? If... It... is still not \n\t\tfinished with us? We will all still \n\t\tdie; now, not later.\n\nTroubled and deeply concerned, Clear studies Alex.\n\n<b>                        ALEX (CONT'D)\n</b>            Unless... we find the pattern. And \n\t\tcheat it again.\n\nClear sets the paper down, looking sadly at Alex.\n\n<b>                        CLEAR\n</b>            After hearing you, just now... I do \n\t\tbelieve...\n<b>\t\t\t\t\n</b>Alex leans back and sighs, relieved...\n\n<b>                        CLEAR (CONT'D)\n</b>            ...that Tod killed himself.\n\nAlex is taken aback, hurt and angry.\n\n<b>                        ALEX\n</b>            Then there's no one left who can help \n\t\tme.\n\n<b>CARTER'S CAR\n</b>\nHis eyes having never left Alex, Carter suddenly cranks the wheel hard to the left to make a tight U-Turn.\n\n<b>BILLY HITCHCOCK\n</b>\nrides his bike. He reacts, startled by...\n\n<b>BILLY HITCHCOCK'S POV - CARTER'S CAR\n</b>\nbarreling down towards him. The car cuts in front of the bicycle to complete the U-Turn.\n\n<b>WIDER\n</b>\nBilly SWERVES to the left, directly in front of an oncoming car. The car SWERVES right, as does Billy, avoiding a certain fatal collision for the cyclist. The oncoming car HONKS!\n\nCarter's car pulls up to the curb. Oblivious to the accident he almost caused, Carter gets out, strutting toward the tables outside the coffee shop. Inside the car, Terry sighs...\n\n<b>                        TERRY\n</b>            Baby, come on... not now.\n\nBut her boyfriend continues. She gets out and hustles after him.\n\n<b>ALEX AND CLEAR\n</b>\nTheir attention drawn by the commotion, Clear and Alex watch Carter Horton approach them, followed by Terry, who stops, irked, near the curb at the crosswalk.\n\n<b>                        TERRY\n</b>            Carter...\n\nAt that moment, Ms. Lewton exits with an ezpresso drink. Sensing trouble, she has no energy or desire to involve herself.\n\n<b>                        CARTER\n</b>            Kind of have a reunion, here.\n\n<b>                        TERRY\n</b>            Let it go!\n\nCarter steps before Ms. Lewton, blocking her exit...\n\n<b>                        CARTER\n</b>            When are you moving?\n\n<b>                        MS. LEWTON\n</b>            A couple of weeks.\n\nShe can't wait to leave. While trying to walk around Carter...\n\n<b>                        CARTER\n</b>            We're losing our favorite teacher.\n\n<b>                        ALEX\n</b>            Look, there's something you should\n            all know.\n\n<b>                        CLEAR\n</b>            Alex...\n\nCarter eyes Alex, continuing the taunt. He raises the volume of his words to drown out Alex's words and incite conflict.\n\n<b>            CARTER (CONT'D)              ALEX (CONT'D)\n</b>Lived here her whole life.        This'll be hard to believe.\n\nMs. Lewton's eyes flash to Alex, afraid of him.\n\n<b>            CARTER (CONT'D)               ALEX (CONT'D)\n</b>And now she has to move.          Listen to me, we may all\nAll because of Browning.          be in danger...\n\n<b>                        TERRY\n</b>            Shut up! The both of you!\n\nThe two boys stop their heated exchange.\n\n<b>                        TERRY (CONT'D)\n</b>            They died! We lived!\n                   (beat)\n            Get over it! I won't let that plane\n            crash be the most important thing in \n\t\tmy life. I'm moving on, Carter, and \n\t\tif you're gonna waste your life \n\t\tbeating the shit out of Alex \n\t\teverytime you see him, then you can \n\t\tjust drop fucking dead!\n\nHead and shoulders remaining angrily in Carter's direction, Terry takes a blind step off the curb and into the crosswalk, WITHOUT A CUT... a bus suddenly speeds INTO FRAME and, THUD! plows directly right into her...\n\n<b>ALEX, CLEAR, CARTER AND MS. LEWTON\n</b>\nare SPLATTERED with BLOOD before they can even recoil.\n\n<b>                                                           CUT TO:\n</b>\n<b>INT. BROWNING LIVING ROOM - NIGHT - CLOSE - ALKA SELTZER\n</b>\nFIZZLES in the glass, while O.S., a PHONE RINGS...\n\n<b>ALEX\n</b>\nhas crashed, watching CNN. It's a tense recline. Red circles rim the lids of his eyes. He sips from the glass to settle his stomach. Ken appears from the kitchen, hand over the reciever.\n\n<b>                        KEN\n</b>            It's that girl... Clear.\n\nNo response from Alex. Ken sighs, then into the phone...\n\n<b>                        KEN\n</b>            He's in the shower, Clear. Can I \n\t\thave him get back at ya? Sure... \n\t\tbye.\n\nKen returns to the living room, concerned about his son. Alex averts his eyes, stressed and ashamed. Ken sits nearby.\n\n<b>                        KEN (CONT'D)\n</b>            She's concerned about you.\n                  (beat)\n            I'm concerned about you.\n\nAlex turns his eyes to the glass.\n\n<b>                        KEN (CONT'D)\n</b>            Why don't you want to talk to her...\n            or me?\n\n<b>                        ALEX\n</b>            Dad... you and mom have helped me\n            out, so much. But there's... some\n            things I need to understand before\n            I can talk... to anyone about it.\n\nThe father respects this young man's wishes. Ken nods \"fair enough.\" In the silent moment, O.S., from the television...\n\n<b>                        CNN ANCHOR (O.S.)\n</b>            The National Transportation Safety\n            Board has a new theory tonight on the\n            possible cause of Euro-Air Flight 180...\n\nAlex quickly grabs the remote and turns up the VOLUME...\n\n<b>TELIVISION\n</b>\nA computer graphic illustrations the area of the lower fuselage.\n\n<b>                        CNN ANCHOR (CONT'D, V.O.)\n</b>            Deterioration of silicon insulation\n            on an electrical connector to the\n            scavenger pump may have leaked\n            combustible fluids.\n\n<b>ALEX AND KEN\n</b>\nAlex remains riveted to the screen.\n\n<b>                        CNN ANCHOR (CONT'D, V.O.)\n</b>            A spark in the fuel switch...\n\n<b>TELEVISION\n</b>\nThe graphic ZOOMS into the area in the rear right side, nearly above Tod's seat.\n\n<b>                        ALEX (O.S.)\n</b>            That's Tod's seat...\n\n<b>ALEX\n</b>\nCAMERA PUSHES IN as he listens...\n\n<b>                        CNN ANCHOR (CONT'D, V.O.)\n</b>            ... may have ignited the fuel line. And\n            proceeded to the fuel pump.\n\n<b>TELEVISION\n</b>\nThe high-tech computer image traces the path of the explosion through the plane. A red line representing the fuel line zigs through the body of the plane, making a sharp turn forward to the fuel pump, which explodes. Jagged lines show the direction of the explosion moving backwards toward the rear of the plane.\n\n<b>                                                MATCH CUT TO:\n</b>\n<b>INT. ALEX'S BEDROOM - DAY - 747 SCHEMATIC\n</b>\ndrawn in Alex's hand, and hundreds of steps down from CNN computer image, yet accurate as Alex's finger traces the path, away from the seats marked \"ME\" and \"CLEAR.\" The path starts over \"TOD,\" then moves to \"TERRY.\" The line moves forward away from \"CARTER\" toward the fuel pump.\n\nThe corresponding jagged picture of the explosion back is reminiscent of the \"hand of Death,\" seen earlier in the lightning. It is a graphic demonsration of the arbitrary nature of Death.\n\n<b>ALEX\n</b>\nis amped, intensely more frightened as he believes...\n\n<b>                        ALEX\n</b>            The path of the explosion...\n                  (a whisper)\n            That's Death's design.\n\nIt instantly, frightfully, occurs to him, he now knows who will be next...\n\n<b>CLOSE - SCHEMATIC\n</b>\nAlex's finger quickly moves along the fuel line. After \"TERRY,\" the seat intersecting the path of the fule line, over the fuel pump, is marked \"MS. LEWTON.\"\n\n<b>                                                       CUT TO:\n</b>\n<b>INT. VALERIE LEWTON'S HOUSE - NIGHT - VALERIE LEWTON\n</b>\nENTER'S FRAME, on the phone, wearing a t-shirt and sweats.\n\n<b>                        MS. LEWTON (O.S.)\n</b>            Some nights I'm woken up by the \n\t\tsound of my own voice, you know, \n\t\tinside my head, goin', \"No, you know \n\t\tthe whole French thing. Get on the \n\t\tplane.\"\n\nMoving boxes are stacked in the living room; organized disarray of \nrelocating. The house is old, been in the family forever. Dust marks the walls where framed photos and artwork were once displayed.\n\n<b>                        MS. LEWTON (CONT'D)\n</b>            Everything here reminds me... of \n\t\tsending Mr. Murnau back on the \n\t\tplane... Right, I'm hoping a change \n\t\twill help... I lived here my whole \n\t\tlife and wherever I looked were great\n            memories, you know... but now all I \n\t\tcan see is Mr. Murnau... those kids. \n\t\tJust looking out my own front yard... \n\t\tmakes me feel mothing but fear.\n\nShe peeks out of the front curtains and looks sadly upon her front yard. Her expression alters... alarmed...\n\n<b>EXT. LEWTON'S HOUSE - NIGHT - MS. LEWTON'S POV - FRONT YARD\n</b>\nThe figure is Alex Browning.\n\n<b>INT. MS. LEWTON'S HOUSE - NIGHT\n</b>\nMs. Lewton steps away from the curtains.\n\n<b>                        MS. LEWTON\n</b>                  (quickly)\n            Laura, I gotta call you back.\n\nShe immediately hangs up and speed dials.\n\n<b>                        MS. LEWTON (CONT'D)\n</b>            This is Valerie Lewton. I need Agent\n            Schreck...\n\n<b>                                                TIME CUT:\n</b>\n<b>EXT. LEWTON'S HOUSE - NIGHT\n</b>\nAlex has moved closer to her house, remaining in the shadows. He checks for any passers-by. Being sure there are none, he creeps toward Ms. Lewton's car. He visually inspects the exterior. As he kicks the tires... an unmarked sedan SCREECHES up. Doors open...\n\nStartled, Alex turns to find...\n\nSpecial agents Schreck and Weine standing in the street, backlit in the strong headlights of their car.\n\n<b>                        SCHRECK\n</b>            What are you doing?\n\n<b>ALEX\n</b>\nis nervous but determined. He tells the truth...\n\n<b>                        ALEX\n</b>            Checking the air in her tires to\n            make sure they're safe.\n\n<b>SPECIAL AGENTS SCHRECK AND WEINE\n</b>\nafter a beat of incredulity...\n\n<b>                        SCHRECK\n</b>            Get in the car.\n\n<b>INT. MS. LEWTON'S HOUSE - NIGHT - VALERIE LEWTON\n</b>\nis watching, peeking out her front curtains. O.S., CAR DOORS CLOSE. The vehicle ROARS OFF. She releases the curtains and moves back, feeling somewhat better, but still rattled.\n\nThen...\n\nThe curtains billow as if blown by a breeze. Ms. Lewton appears puzzled as she moves the curtains aside to find the windows closed. As CAMERA PUSHES IN ON HER, tensing and uneasy...\n\n<b>                                                       CUT TO:\n</b>\n<b>INT. INTERROGATION ROOM - POLICE STATION - NIGHT\n</b>\nAlex sits behind a table in the cinderblock room painted police station green. Sitting across from him, with a good cop tone, is Agent Weine, while Schreck stands with a hard-ass posture.\n\n<b>                        ALEX\n</b>            I believe that... Ms. Lewton's next.\n\n<b>                        WEINE\n</b>            \"Next?\"\n\n<b>                        ALEX\n</b>            Yes... see, there's this... \n\t\tpattern... that's occuring.\n\n<b>                        WEINE\n</b>                 (sarcastic)\n            Oh, you've noticed it, too?\n\n<b>                                                         CUT TO:\n</b>\n<b>INT. MS. LEWTON'S HOUSE - NIGHT\n</b>\nMs. Lewton moves to a closet door, opens it and CLICKS on an overhead light.\n\nKneeling down, she tugs on a heavy box and opens it to check the contents. Her expression warms, as if recalling a far off memory.\n\n<b>                        MS. LEWTON\n</b>            Oh... mom's favorite.\n\nShe slides a vinyl record album out of the sleeve and moves to the turntable on a shelf, thick with dust.\n\nValerie places the record on the stereo and sets the needle on the album. CAMERA SWEEPS IN CLOSE TO THE TURNTABLE, although spinning around and around... the bold letters of the center label can be read... JOHN DENVER... the opening acoustic guitar of \"Rocky Mountain High\" has never sounded so eerie...\n\n<b>                        JOHN DENVER (V.O.)\n</b>            He was born in the summer of his\n            twenty-seventh year...\n\nPleased with the feeling of a pleasant memory, Lewton moves off.\n\n<b>INT. INTERROGATION ROOM - POLICE STATION - NIGHT\n</b>\nSchreck moves closer to Alex.\n\n<b>                        SCHRECK\n</b>            Where'd you get this \"pattern\" from? \n\t\tYou have another \"vision?\" Maybe saw \n\t\tit in some T.V. static?\n\nAlex is insulted by the condescending tone.\n\n<b>                        ALEX\n</b>            I didn't ask for what happened to me\n            on the plane. You can make fun of me.\n            You can think I'm a nut. I'm used to \n\t\tit. I saved six lives but the entire \n\t\tschool acts like I'm a freak. Fine.\n\nAlex takes a nervous breath...\n\n<b>                        ALEX\n</b>            I'm not suffering from Post Traumatic\n            Stress. I haven't developed a\n            narcissistic deity complex. I'm not \n\t\tgoing Dahmer.\n                  (beat)\n            This just is. There's a pattern in \n\t\tplace for you. And you. There's a \n\t\tdesign for everyone.\n\nThe agents study Alex...\n\n<b>                        ALEX\n</b>                  (sighs)\n            And I'm not sure yet how... but I\n            intend to break this one.\n\n<b>                                                    CUT TO:\n</b>\n<b>INT. MS. LEWTON'S KITCHEN - NIGHT - SET OF CUTLERY KNIVES\n</b>\nheld in a wooden block, sits atop the kitchen counter.\n\nIn the b.g., Valerie removes the chrome teapot from the stove and moves it to the sink. JOHN DENVER CONTINUES in the next room. Ms. Lewton turns on the faucet, pours water into the kettle. Some water spills on the side of the kettle. As she wipes the pot with a blue checked hand towel, a dark shadow appears to cross behind her.\n\nLewton turns. CAMERA FOLLOWS, CIRCLING as she looks about the room only to find she is alone. Unsetteled, she absently tosses the towel on the counter the edge which, catches a knife blade held in the cutery block.\n\n<b>STOVE\n</b>\nMs. Lewton turns on the gas, adjusts it, however... the flames blow out. She pauses, nerves on edge. Her eyes cautiously move about the room and find nothing. She grabs a pack of nearby matches and strikes one.\n\n<b>                        JOHN DENVER (V.O.)\n</b>               He left yesterday behind him/\n               You might say he's born again...\n\nCAMERA PUSHES INTO the burner as the flames re-ignite and FILL THE FRAME...\n\n<b>                                                           CUT TO:\n</b>\n<b>INT. INTERROGATION ROOM - POLICE STATION - NIGHT\n</b>\nWeine sits across from Alex, symapthetic, but professional...\n\n<b>                        WEINE\n</b>            Alex, you got our attention, at\n            first, because you were under\n            suspicion in the plane explosion.\n\nAlex tenses, but Weine shakes his head.\n\n<b>                        WEINE (CONT'D)\n</b>            I know you didn't blow up that plane.\n\nAlex sighs, eases.\n\n<b>                        WEINE (CONT'D)\n</b>            I don't believe you have magical \n\t\tpowers. No one has any... control \n\t\tover life and death... unless... \n\t\tthat person is taking lives and \n\t\tcausing death.\n\nWeine leans forward toward Alex...\n\n<b>                        WEINE (CONT'D)\n</b>            Alex... can you promise me that \n      \tno one else will die?\n\n<b>                        ALEX\n</b>            No... I can't. As long as I'm in \n\t\there, it's outta my control.\n\nThe agents are taken aback by his answer; unnerved by his sincerity. Weine sighs and looks to his partner, who sighs, frustrated and turns away.\n\n<b>                        WEINE\n</b>            Alright, go on. Get outta here.\n\nAlex stands and, with no urgency, moves off. He exits the room.\n\n<b>                        SCHRECK\n</b>            Kid gives me the creeps.\n\n<b>                        WEINE\n</b>            We got nothing to hold him.\n\n<b>                        SCHRECK\n</b>            I don't mean that...\n                  (beat)\n            There's a couple of times, there...\n            I almost believed him.\n\nWeine considers, yet remains skeptical.\n\n<b>                        WEINE\n</b>            Sometimes, you give me the creeps.\n\n<b>                                                        CUT TO:\n</b>\n<b>INT. MS. LEWTON'S HOUSE - NIGHT - CLOSE - TEAPOT\n</b>\nWhistles.\n\n<b>                        JOHN DENVER (V.O.)\n</b>            When he first came to the mountains, \n\t\this life was far away...\n\n<b>COFFEE MUG - OVERHEAD\n</b>\ntwo tea bags are dropped inside, then the steaming hot water.\n\n<b>MS. LEWTON\n</b>\npicks up the cup, raising it toward her lips. She pauses, her expression turning tragic.\n\nOn a reflex, she spins toward the sink and throws the hot contents into the drain. She sits the mug down...\n\n<b>A COFFEE MUG\n</b>\nENTERS FRAME... displaying the logo of the Mt. Abraham Fighting Colonials.\n\n<b>MS. LEWTON\n</b>\nTrembling. She takes a deep breath, getting a hold of herself.\n\n<b>                        MS. LEWTON\n</b>            You gotta stop this! Stop this! It's \n\t\tjust a stupid mug.\n                  (composed)\n            You're outta here. Pretty soon...\n            you'll be gone.\n\nOpening the refrigerator frezzer, she grabs some ice and a bottle of pure Polish Vodka then deliberately turns back toward the same mug...\n\n<b>COFFEE MUG\n</b>\nthe ice cubes PLUNK. The cold alchohol pours into the hot mug. CAMERA PUSHES INTO THE MUG as... it slightly CRACKS, Vodka dripping out of the base.\n\nLewton's hand picks up the mug, oblivious to the crack. She moves off toward the living room, leaving a trail of alcohol.\n\n<b>                                                  CUT TO:\n</b>\n<b>EXT. POLICE STATION - NIGHT\n</b>\nAlex exits the police station, walking. He checks over his shoulder to see if he is being watched and increases his pace, legs whipping across FRAME...\n\n<b>                                                        CUT TO:\n</b>\n<b>INT. MS. LEWTON'S HOUSE - NIGHT\n</b>\n\nValerie Lewton tears off a piece of plastic bubble wrap. She stands over her desk, placed against the wall. On the desk is her desktop computer monitor.\n\n<b>                        JOHN DENVER (V.O.)\n</b>            It's the Colorado Rocky Mountain\n            High...\n\nShe pauses to swig from her cup of vodka.\n\n<b>EXTREMELY CLOSE - COFFEE MUG\n</b>\nalcohol drips from her mug...\n\n<b>EXTREMELY CLOSE - COMPUTER MONITOR VENT\n</b>\n... fluid drips inside the circuitry.\n\n<b>MS. LEWTON\n</b>\nsets the mug out of the way on the back edge of her desk.\n\n<b>CLOSE - COFFEE MUG\n</b>\nThe remaining vodka oozes from the crack, pools, then drips off the edge of the desk...\n\n<b>                        JOHN DENVER\n</b>            I've seen it rainin' fire from the\n            sky...\n\nCAMERA CRANES DOWN to REVEAL the moniter cabel inserted into an electrical wall socket. The vodka drip... drip... drips PAST FRAME. Then, Lewton's hand ENTERS and pulls the monitor plug, creating tiny SPARKS at the connection...\n\n<b>ON THE FLOOR\n</b>\nthe alcohol ignites...\n\n<b>MS. LEWTON\n</b>\nher back is to the desk, while pouring styrofoam peanuts into the box. In the b.g., FLAMES, nearly supernaturally, leap up the walland toward the computer monitor.\n\n<b>CLOSE - COMPUTER MONITOR - THROUGH THE VENTS\n</b>\nthe interior catches fire, causing an electrical POP!\n\n<b>MS. LEWTON\n</b>\nturns, holding her sheet of bubble wrap, shocked by the flames.\n\n<b>THE COMPUTER MONITOR\n</b>\nOn the screen, the reflection of the approaching shadow passes before the monitor... EXPLODES!\n\n<b>MS. LEWTON\n</b>\na large jagged shard from the monitor flies into her throat. Blood squirts from her neck onto the bubble wrap. Her stunned expression is sickeningly numb from shock.\n\n<b>                        JOHN DENVER (V.O.)\n</b>            Rocky Mountain High/ Colorad-oh.\n\nShe reaches up to reflexively pull the glass from her throat, creating a flood of spurting blood.\n\nShe drops the glass and quickly stumbles toward the kitchen, blindly banging the turntable as she passes. The needle skips, BUMPS... and settles... umercifully at the start of \"Rocky Mountain High.\"\n\n<b>                                                        CUT TO:\n</b>\n<b>EXT. NEIGHBORHOOD STREET - NIGHT\n</b>\nAlex walks quickly up the street. Smoke wafts before him. He turns to see a man burning leaves in the backyard.\n\nThe breeze intensifies, lifting the burning debris. The smoke swirls around him. CAMERA PUSHES INTO ALEX as he senses the Presence. He looks ahead.\n\n<b>ALEX'S POV - TWO DOZEN LEAVES\n</b>\nmystically float past him, each on fire.\n\n<b>ALEX\n</b>\nsenses the taunting message and breaks into a full sprint, passing through many of the burning leaves that break up into the bright orange cinders against the black sky.\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. LIVING ROOM - LEWTON'S HOUSE - NIGHT - THE FLAMES\n</b>\nreach the coffee mug, igniting the trickling stream leading to, and away from, the crack in the cup.\n\n<b>FLOOR\n</b>\nFlames ride the small trickle of vodka back toward the kitchen...\n\n<b>INT. KITCHEN - LEWTON'S HOUSE - NIGHT\n</b>\nValerie Lewton races in, desperately pressing her hand to her throat as she GURGLES and CHOKES on the blood from the wound. She leans over the now red sink. She turns pale from the blood loss.\n\n<b>THE STOVE\n</b>\nthe flaming stream shoots up the stove, lighting the burners.\n\n<b>MS. LEWTON\n</b>\nbehind her, the stove ERUPTS in FLAMES. They jump, leap like a tiger, landing on her shoulders and hair, which catch on fire...\n\n<b>                                                 CUT TO:\n</b>\n<b>EXT. LEWTON'S HOUSE - NIGHT\n</b>\nAlex approaches the front of the house. From here, nothing appears to be wrong. As he catches his breath, sweating, visually examining the house.\n\nFrom INSIDE, a hoarse, macabre SCREAM! CAMERA PUSHES IN ON ALEX, stunned, before he races off toward the house.\n\n<b>INT. LEWTON'S HOUSE - NIGHT - MS. LEWTON\n</b>\nDROPS INTO FRAME ON HER KITCHEN FLOOR, hair and sweatshirt aflame. She desperately rolls on the floor and manages to extinguish the flames.\n\nOn her back, on the floor, she is badly burned. Her open neck wound continues to bleed. Blood pools on the floor. In shock and moving on pure survial instincts, she reaches up...\n\n<b>LEWTON'S POV - (LOOKING UP) - THE HAND TOWEL\n</b>\nthe lower third of the towel dangles over the edge of the counter top. Her hand grabs it, and pulls.\n\n<b>COUNTER TOP\n</b>\nthe draped edge of the towel pulls over the cutlery block. The knives spill out, entangled with the hand towel.\n\n<b>                        ALEX (O.S.)\n</b>            Ms. Lewton!\n\n<b>KITCHEN DOORWAY\n</b>\nAlex rushes across the threshold as Ms. Lewton pulls the knives over the counter.\n\n<b>MS. LEWTON\n</b>\na half dozen knives, from small, but sharp, cutting blades to large butcher knives, cascade into her body.\n\n<b>                        JOHN DENVER (V.O.)\n</b>            They say that he got crazy once and \n\t\the tried to touch the sun...\n\nHer hand trembling, her expression horrified, Lewton grabs the handle of the largest blade, trying to pull it out. Alex quickly kneels next to her. She looks at him, in shock, her eyes pleading. Alex gathers his courage, places his hand on the handle of the largest blade. As he's about to remove it...\n\n<b>THE STOVE\n</b>\na gas line ERUPTS, creating a small EXPLOSION.\n\n<b>THE COUNTER TOP\n</b>\nthe cutlery block is knocked off of the counter...\n\n<b>MS. LEWTON\n</b>\nthe block lands directly on the butcher knife handle, driving the blade further into Ms. Lewton's body.\n\n<b>LEWTON'S POV - THE SHADOW\n</b>\ndescends, the FRAME COLLAPSING until her face, eerily peaceful, but lifeless gray, horrifically decays... flesh rotting, worms feeding on muscle until only a skull remains.\n\n<b>MS. LEWTON\n</b>\nas Death arrives, her eyes are macabrely focused above her.\n\n<b>ALEX\n</b>\nEven as blood squirts on him from her open wound, he appears to realize she is \"seeing\" the moment of death.\n\n<b>                        ALEX\n</b>            Ms. Lewton!\n\nFlames leap from the stove to the curtains, which catch fire.\n\nAlex grabs the knife and pulls it out. He quickly removes another and another... yet there is no reaction from the woman.\n\nKnowing she is dead, Alex pauses with guilt. He looks at the knife in his hand, then realizes how incriminating this could appear. In that moment, another small EXPLOSION from the stove brings Alex quickly to his feet. He drops the knife to the floor and races from the house. CAMERA TILTS DOWN to the shoe prints left in the pool of blood.\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. LEWTON'S STREET - NIGHT\n</b>\nAlex runs with all his strength away from Valerie Lewton's home. Billy Hitchcock is riding his bicycle in Alex's direction. He stops and gets off his bike.\n\n<b>                        BILLY\n</b>            Hey, Alex...\n\nAlex appears unaware as he simply runs past Billy, who curiously turns his head to watch Alex race up the street. O.S., the CRACKLING OF FIRE. CAMERA MOVES INTO Billy as he turns back, reacting with shock to Ms. Lewton's house.\n\n<b>THE HOUSE\n</b>\nfrom inside, an intense EXPLOSION propels glass from the windows. Flames engulf the entire house.\n\n<b>ALEX\n</b>\neven down the street, he is knocked to his feet by the blast. In the distance, SIRENS from approaching POLICE AND FIRE trucks are HEARD. He stands, looks to the now suspicious Billy... then opts to run off away from the scene. Escaping into the dark backyards of the neighborhood.\n\n<b>                                                       CUT TO:\n</b>\n<b>INT./EXT. GARAGE - CLEAR RIVERS' HOUSE - DAY - CLEAR RIVERS\n</b>\nTense, her eyes look left, then right...\n\n<b>                        CLEAR\n</b>            I don't know where he is. He's not\n            talking to me.\n\n<b>WIDER\n</b>\nAgents Schreck and Weine stand before Clear in her garage.\n\n<b>                        WEINE\n</b>            Why?\n\nShe studies the men before averting her eyes.\n\n<b>                        CLEAR\n</b>            Because I didn't believe him.\n\nThe agents study her. Weine accepts the explanation. Schreck's eyes take a walk around the artwork in the garage, pausing on a piece of twisted metal from the crash. Clear tenses, however...\n\n<b>                        SCHRECK\n</b>            If he should contact you, it\n            would be in the best interest\n            of your own safety to contact us.\n\nSchreck hands his card. She takes it and nods. Schreck pauses, once again eyeing the painting before moving out of the garage on their way to their car.\n\nCAMERA PUSHES IN ON CLEAR as she looks at the business card.\n\n<b>                                                       CUT TO:\n</b>\n<b>EXT. MT. ABRAHAM HIGH SCHOOL - NIGHT\n</b>\nCAMERA PUSHES IN ON Flight 180 Memorial, lit for dramatic effect at night, but only achieving an eeriness. Carter Horton and Billy Hitchcock ENTER FRAME, moving toward the monument. Billy is riding his bicycle, wearing a New York Rangers jersey with \"Hitchcock\" across the back of the shoulders. Nearing the shadows, the two boys stop looking at the monument.\n\nCarter pulls put a heavy pocket knife and starts attempting to cut into the stone.\n\nClear Rivers appears from the shadows.\n\n<b>                        CLEAR\n</b>            What are you doing?\n\n<b>                        CARTER\n</b>            Terry's name should be on this wall.\n\nClear is touched by the action.\n\n<b>                        CARTER (CONT'D)\n</b>            So, why'd you want us to meet you\n            here? Now?\n\n<b>                        CLEAR\n</b>            They're watching me, see if I go to \n\t\tAlex.\n\n<b>                        BILLY\n</b>            Are you?\n\n<b>                        CLEAR\n</b>            They'll follow my car.\n                 (beat)\n            That's why you're taking me.\n\n<b>                        CARTER\n</b>            Why would I want to see him?\n\nClear eyes the two of them. With the memorial standing behind them...\n\n<b>                        CLEAR\n</b>            Because he knows which one of us\n            is next.\n\nAs Carter and Billy feel the chill of their inner fears...\n\n<b>                                                       CUT TO:\n</b>\n<b>EXT. HIGHWAY - NIGHT\n</b>\nThe muscle car ROARS onto U.S. 17 on ramp. A sign near the road indicates: \n\"Middletown - 25 mi. New York City - 105 mi.\"\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nCarter checks the rearview mirror. Clear looks out the front passenger window. She shakes her head, as if \"no one's following us.\" Billy leans forward from the backseat...\n\n<b>                        BILLY\n</b>            Um... okay... drive the speed limit,\n            right?\n\nHe sits back, OUT OF FRAME, but quickly darts forward.\n\n<b>                        BILLY (CONT'D)\n</b>            And don't pass on the right.\n\n<b>                        CARTER\n</b>            Billy! I'm gettin' a vision!\n            You're the next one...\n<b>\t\t\n</b><b>                        BILLY\n</b>                  (nervous)\n            Hey, man, why'd you say that?!\n\n<b>                         CARTER\n</b>            'Cause if you say another word,\n            I'm gonna fuckn' kill ya!\n\nBilly sits back, gesturing, \"hear ya. Got it.\" Clear pays no attention to their exchange as she stare out into the darkness, her thoughts a million miles away.\n\n<b>EXT. SEASHORE - JONES BEACH SATE PARK - NIGHT\n</b>\nA posted sign indicates \"ACCIDENT SITE. ANY DEBRIS FOUND SHOULD BE REPORTED TO THE NTSB (212)555-NTSB.\" CAMERA FINDS Carter's car pulling up to a stop. Clear opens the passenger door and pauses in the car a while...\n\n<b>                        CLEAR\n</b>            He could be anywhere from here to a \n\t\tmile down the shore. You guys drive \n\t\tdown there, start this way and we'll \n\t\tmeet around the middle. It'll take \n\t\thalf the time.\n<b>\t\t\n</b>Clear closes the door. Carter and Billy drive off. As she looks to the beach.\n\n<b>                                                       CUT TO:\n</b>\n<b>EXT. BEACH - NIGHT\n</b>\nCAMERA, FACING the ocean, moves along the shore revealing a lone image sitting on the beach, looking into the Atlantic.\n\nThe waves are small bur rhythmic, an enternal metronome. Numb, Alex Browning sits in the sand searching for an answer somewhere in the darkness of the evening sea.\n\nBehind him, O.S., approaching in the sand, SOFT FOOTSTEPS. He listens, notes them. Yet rather than turn around... he looks up into the sky.\n\n<b>ALEX'S POV - THE SKY\n</b>\nThe shoreline lights cast an orange haze on the stars, breaking through, infinitely above.\n\n<b>                        ALEX (O.S.)\n</b>            Are they up there?\n\n<b>WIDER\n</b>\nClear Rivers approaches, barefoot in the sand. He neddn't turn to know who is behind him.\n\n<b>                        ALEX (CONT'D)\n</b>            Somehow... is 180 still in flight?\n            Somewhere... are they still safe?\n\nClear hasn't met eyes with Alex, but she sits nearby, looking into the sky.\n<b>                        CLEAR\n</b>            When I was a kid, like, six or \n\t\tseven... I used to worry so much \n\t\tabout my parents dying. Like lying \n\t\tawake at night... just worrying. I \n\t\tloved them so much. I didn't want\n\t\tthem to get hurt. And what would \n\t\thappen to me? What would life be \n\t\tlike?\n                  (beat)\n            Every night... it seemed.\n\nShe looks out at the stars. He doesn't eye her, either...\n\n<b>                        ALEX\n</b>            Most kids do, I guess.\n\n<b>                        CLEAR\n</b>            Most kids never have it happen.\n\nAlex hangs his head...\n\n<b>                        CLEAR\n</b>            When I was ten... my dad went into a\n            7-11 for cigerettes. I guess he heard\n            somebody say \"Don't turn around.\" So \n\t\ton reflex, or thinkin' a friend was \n\t\tjokin'... he did. And the guy blew \n\t\this head off.\n\nShe has lived this so many times, she is long beyond crying...\n\n<b>                        CLEAR (CONT'D)\n</b>            And, let me tell ya, I had every \n\t\treason to worry before... because \n\t\tlife became shit. I don't blame her, \n\t\tI guess, but my mom couldn't deal \n\t\twith it at all. She married this \n\t\tasshole, who my mom with my real \n\t\tdad would cross the street to avoid \n\t\tthis guy. He really didn't want a \n\t\tkid. And so my mom didn't either \n\t\tanymore, I guess.\n                  (beat)\n            If that was the design for my \n\t\tfather... and my family... then fuck \n\t\tDeath, FUCK IT!\n\nThe waves continue to shore. Clear looks up at the sky.\n\n<b>                        CLEAR (CONT'D)\n</b>            And so, anyway... I've thought of \n\t\tthat \"somewhere,\" Alex. It exists, \n\t\tthat place.\n\nHe looks at her.\n\n<b>                        CLEAR (CONT'D)\n</b>            Where my dad is still safe. Where he \n\t\thad a full pack of cigerettes and \n\t\tkept driving. A place where me and \n\t\tmy dad and my mom... are still \n\t\ttogether....and have no idea about\n            this second life, here.\n                  (beat)\n            A place where our friends are still\n\t\tin the sky... where everyone gets a \n\t\tsecond chance.\n\nShe looks at him...\n\n<b>                        CLEAR (CONT'D)\n</b>            But that place might only exist in \n\t\tmy heart. And maybe, now... yours. I \n\t\thaven't experienced too many second \n\t\tchances in my life. I haven't seen \n\t\tany. But because of all of this, I \n\t\tbelieve... because of you... I will \n\t\tget a second chance. Because of me, \n\t\tyou will. With you in my life... that \n\t\tplace, right now existing in our \n\t\thearts, will spring out... and become \n\t\ta real part of this life.\n\nAlex looks within her, as a soft ocean breeze blows through Clear's hair.\n\n<b>                        CLEAR\n</b>            And that is the only way we can beat \n\t\tDeath... by making something special \n\t\tout of Life.\n\nHis eyes well with tears. Only as she looks at Alex does Clear become emotional... they move closer, and kiss, the desire for each other, to defy the events around them; darkness; the isolation...\n\nThey dive into a deep feverish kiss. Embracing, as if the tighter, the safer. She pulls him back down to the beach and lifts his shirt over his head.\n\n<b>                        ALEX\n</b>            This won't be safe.\n\nClear looks down the beach, checking for any sight of Billy and Carter.\n\n<b>                        CLEAR\n</b>      \tThose guys are probably fifteen \n\t\tminutes away.\n\n<b>                        ALEX\n</b>            No.. I mean, I don't have anything \n\t\ton me. This won't be safe.\n\n<b>                        CLEAR\n</b>                  (sadly)\n            Nothing is... anymore.\n\nAlex looks to Clear, then kisses her with passion that reflects the defiance of death. He pulls open her shirt and falls into her arms. CAMERA CRANES UP as the young man and woman make love in the sand... consciously and defiantly oblivious, to anything around them... including the stars, possibly Flight 180, up above.\n\n<b>                                                     CUT TO:\n</b>\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nCarter drives. Billy rides shotgun. Alex and Clear are in the back. Everyone anxious, looking for cops.\n\n<b>                        ALEX\n</b>            I can't go home. After Lewton's,\n            they'll be after me.\n\n<b>                        CLEAR\n</b>            We're takin' you to a cabin in the\n            woods, it's only a couple miles from\n            my house.\n                  (to Carter)\n             Keep off the highways, they'll be \n\t\tlookin' for us.\n\nCarter, however, continually glances into the rearview mirror, checking Alex. Finally, hotheaded and unable to withhold it any further...\n\n<b>                        CARTER\n</b>            Alright, Browning, you fuckin' \n\t\twarlock... did you know about Ms. \n\t\tLewton, or what?\n\n<b>                        ALEX\n</b>            Why do you think I was hiding?\n\n<b>                        CLEAR\n</b>            Billy told the F.B.I. he saw you \n\t\trunnin' away from her house.\n\n<b>                        ALEX\n</b>            They blame me for everything. Her, \n\t\tTod, the plane crash...\n\n<b>                        BILLY\n</b>            Your shoe prints were in the blood. \n\t\tYour fingerprints on the knives...\n\n<b>                        ALEX\n</b>            I already told you...\n\n<b>                        CARTER\n</b>                  (interrupting)\n            I'm not talkin' about if you did it.\n            Or if you knew she was dead...\n                  (beat)\n            Did you know she was going to be \n\t\tnext... before she was?\n\nAlex looks at Clear, her expression asking the same question...\n\n<b>                        ALEX\n</b>                  (quietly)\n            Yeah.\n                  (almost to himself)\n            When she died... at that moment, I\n            could tell she saw something... horrible.\n\nThe three others turn quiet, considering what it must be...\n\n<b>                        CARTER\n</b>            Out of us... who's next to see it?\n\nAlex eyes them... hesitant to respond.\n\n<b>                        BILLY\n</b>            Please tell me I'm gonna get to see\n            the Jets win the Super Bowl.\n\n<b>                        CARTER\n</b>            Me, right? That's why you're not \n\t\tsaying.\n\nBilly looks out the window, despondent.\n\n<b>                         BILLY\n</b>            Shoulda felt up Tammy in the pool,\n            that time...\n\n<b>                         CARTER\n</b>                  (to Billy)\n            Whatta you whinin' about? He said I'm\n            next.\n\n<b>                        CLEAR\n</b>            He didn't say nothin'. Just drive.\n\n<b>                        CARTER\n</b>            You have a responsibility to tell me.\n\n<b>                        ALEX\n</b>            Is knowing going to make it easier? \n\t\tIt makes it harder.\n\n<b>                        CARTER\n</b>            You get off havin' control over me.\n            Let me choose how to deal with it.\n\n<b>                        ALEX\n</b>            It doesn't matter who's next...\n            we're all on the same list.\n\nThe three are silent.\n\n<b>                        CARTER\n</b>            Aww, fuck... really?\n\nCarter's expression becomes frightened, but he cannot have this. He counters with an irrational bravado.\n\n<b>                        CARTER\n</b>            Then why bother? What's the fuckin'\n            point? Terry and me will be back\n            together on the other side, so why\n            wait any longer?\n\nCarter bares down on the wheel, hits the GAS...\n\n<b>EXT. AN INTERSECTION - NIGHT\n</b>\nThe muscle car ROARS past a stop sign.\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nThe interior bounces as the car clears a dip past the intersection. Alex, Clear, and Billy tenses...\n\n<b>                        CLEAR\n</b>            Knock it off!\n\n<b>                        CARTER\n</b>            May as well go out under my own\n            free will, right?\n\n<b>                        CLEAR\n</b>            Not with us in the fuckin' car!\n\n<b>EXT. ANOTHER INTERSECTION - NIGHT\n</b>\nThe car GUNS IT through another stop sign.\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nEvery passenger hangs on as the car BOUNCES from the next dip.\n\n<b>              CLEAR                    BILLY\n</b>          Stop it!                Hey, c'mon, man...\n\n<b>                        CARTER\n</b>            What's your fuckin' worry? If it's \n\t\tnot your time...? I could get nailed\n\t\trunnin' this red light and you all\n            wouldn't get shit! Only me, right?\n\n<b>              ALEX                           CLEAR\n</b>         No!                           Knock it off!\n\n<b>EXT. TRAFFIC LIGHT INTERSECTION - NIGHT\n</b>\nRed light. A car approaches with the greenlighted right of way. Carter's car TEARS INTO FRAME, just missing being T-boned in the intersection as the other car HITS THE BRAKES, fishtailing.\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\n<b>                        BILLY\n</b>            And I fuckin' HATED FRENCH CLASS!\n\n<b>             ALEX                            CLEAR\n</b>       Carter, stop it, you          Get control of yourself!\n       fuckin' maniac!!\n\n<b>                        CARTER\n</b>            That's what I'm doin'!\n\n<b>                        CLEAR\n</b>            I know what you're doing! It's \n\t\talright to be scared, Carter. You \n\t\tdon't have to prove to us how big \n\t\tyour balls are. Not now.\n\n<b>                        CARTER\n</b>            I'm not afraid! I DECIDE WHEN IT'S \n\t\tTIME! I control my life! I control \n\t\tmy death!\n\n<b>                        BILLY\n</b>            Watch it! Watch it!\n\n<b>EXT. A SECOND TRAFFIC LIGHT INTERSECTION - NIGHT\n</b>\nCarter barrels through the intersection as a car makes a left turn at the intersection.\n\n<b>TURNING CAR DRIVER'S POV - CARTER'S CAR\n</b>\nflying down the road, appears to be heading straight towards him.\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nCarter takes his hands off the wheel and raises them in the air, like a terrorized child on a roller coaster...\n\n<b>EXT. A SECOND TRAFFIC LIGHT INTERSECTION - NIGHT\n</b>\nThe turning car HONKS, ROARING through the intersection as Carter's car nearly clips the rear end of the turning car.\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nCater hooks his elbow on the window and his right arm around the front seat, driving; no hands.\n\n<b>                  CLEAR                   ALEX\n</b>            Stop the car!              Let us out!\n\n<b>                        BILLY\n</b>            I am... so close to puking, you\n            don't wanna know.\n\n<b>                        CLEAR\n</b>            We're afraid, too, Carter, but we're \n\t\tnot going to quit. Maybe you are. You\n\t\tact like you're not, but you are!\n\nCarter eyes Clear in the rearview mirror.\n\n<b>                        CLEAR\n</b>            So, stop what you're doing and STOP\n            THIS CAR! Right fucking now!\n\n<b>EXT. BACKSTREET - NIGHT\n</b>\nIn the backseat, Alex and Clear ease... just as a railroad crossing arm drops INTO FRAME in the REAR WINDOW. O.S., the CLANG CLANG CLANG of a RAILROAD CROSSING ALARM.\n\n<b>OUT OF THE FRONT WINDOW\n</b>\nThe front crossing arm drops INTO FRAME before the car. Carter turns and flashes a \"that's why I stopped\" smile.\n\n<b>INSIDE THE CAR\n</b>\n<b>                        CLEAR\n</b>            Move it!\n\nCarter turns off the engine, then sits back into his seat and folds his arms, indicating he has no intention of moving.\n\n<b>                        ALEX\n</b>            Billy, get out!\n\nScared to death, Billy fumbles with the car door handle. From the front passenger seat, he looks up and to his left...\n\n<b>OUT OF THE DRIVER'S WINDOW - BILLY'S POV\n</b>\nA locomotive headlight arcs across the trees... approaching.\n\n<b>RETURN\n</b>\n<b>                 CLEAR                          ALEX\n</b>        Can't you open the door?!      Easy, Billy, just open it.\n\nBilly collects himself...\n\n<b>CLOSE - BILLY'S DOOR HANDLE\n</b>\nPOPS open!\n\n<b>EXT. TRAIN TRACKS - NIGHT\n</b>\nThe train appears around the blind bend...\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nBilly opens the door and pours out. Clear and Alex are quickly behind him. Carter remains in the drivers seat.\n\n<b>EXT. TRAIN TRACKS - NIGHT\n</b>\nThe train WARNING WHISTLE BLOWS as Alex, Clear and Billy hustle away from the car, on the same side of the tracks. They quickly turn around, desperate to convince...\n\n<b>                        CLEAR\n</b>                  Carter, get out!\n\n<b>           ALEX                         BILLY\n</b>    Don't do it! Don't do it!      It's coming! It's coming!\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nArms crossed, Carter remains in the front seat. As the interior fills with light from the headlight of the oncoming train, Carter turns and looks at them with a smart ass smile, pleased that he's shown how brave he truly is. With a beam of cocky definace...\n\n<b>                        CARTER\n</b>            It ain't my time.\n\nHe cooly turns back to the ignition, grabs the key and turns it over... only to be met with the DULL CLACK of a dead engine.\n\nCAMERA SWEEPS INTO HIM AS his EYES FLARE with tension...\n\n<b>CLOSE - IGNITION\n</b>\nhe turns it, again and again... nothing.\n\n<b>CARTER\n</b>\nlooks up...\n\n<b>EXT. TRAIN TRACKS - NIGHT - CARTER'S POV - THE TRAIN\n</b>\nis moments away.\n\n<b>ALEX, CLEAR AND BILLY\n</b>\nassess the situation...\n\n<b>                     ALEX                         CLEAR\n</b>     Get out! Get out of the car!        Get out! Get out of the\n     Get out of the fuckin' car!         car!\n\n<b>INT. CARTER'S CAR - NIGHT\n</b>\nAs he turns away from them, Carter sees something in the rearview mirror...\n\n<b>CARTER'S POV - REAR VIEW MIRROR\n</b>\nthe passing shadow is darker than any surrounding darkness.\n\n<b>CARTER\n</b>\nas if the image has effected him, he looks to his lap belt and CLACKS the button. He tugs at the restraint, but it will not move. He's strapped in.\n\nHe tries to open the door... it won't open. He pulls at the door handle... tugs at the seatbelt... panicked. Horrified, he whips towards the others.\n\n<b>                        CARTER\n</b>            I can't get out!\n\n<b>EXT. TRAIN TRACKS - NIGHT\n</b>\nAlex, Billy and Clear look at one another, equally frightened...\n\n<b>                        BILLY\n</b>            Man, he really is next.\n\nAlex takes off toward...\n\n<b>CARTER'S CAR\n</b>\nAlex hustles around the drivers' side. CAMERA SWEEPS INTO THEM as Alex desperately tries freeing the seatbelt.\n\n<b>THE TRAIN\n</b>\nthe WHISTLES SCREAMS!\n\n<b>CLEAR AND BILLY\n</b>\ntense, as the train nears...\n\n<b>ALEX AND CARTER\n</b>\nAlex grabs Carter by the shoulders and strains with all his might to pull the much more muscular kid out of the driver's window.\n\n<b>CLOSE - CARTER'S SEAT BELT\n</b>\nthe shadowy presence is reflected by the chrome buckle, however, after it passes... the seat belt begins to TEAR.\n\n<b>ALEX AND CARTER\n</b>\nAs CAMERA SWEEPS IN to ALEX and he releases a deep GROAN...\n\n<b>ACROSS THE TRACKS\n</b>\nThe train TEARS THROUGH the front end of the muscular car! GLASS and METAL ERUPT as the locomotive THUNDERS THROUGH FRAME.\n\n<b>CLEAR AND BILLY\n</b>\nmust turn away from the shower of metal and broken glass.\n\n<b>ALEX AND CARTER\n</b>\nAlex holds Carter by the shirt at the shoulders, dragging him away from the wreckage. The two boys collapse on the road as the trian continues to ROAR PAST...\n\n<b>TRAIN TRACKS\n</b>\nas the heavy train wheels THUNDER and CLACK, a broken two foot long shard of the car's debris BOUNCES upon the tracks, kicked about by the train wheels.\n\n<b>CLEAR AND BILLY\n</b>\nrun to the two survivors.\n\n<b>CLEAR\n</b>\nruns and falls into Alex's arms, holding him tight.\n\n<b>ALEX, CLEAR, CARTER AND BILLY\n</b>\nCarter lies on the road, urine stains around his crotch, hyperventilating and near tears.\n\n<b>                        CLEAR\n</b>            Scared now?\n\nCarter looks at the piece of seatbelt.\n\n<b>                        CARTER\n</b>            It broke!\n<b>\t\t\n</b><b>                        BILLY\n</b>            No one's that strong.\n\n<b>                        CLEAR\n</b>                  (to Carter)\n            Bullshit. He saved your life...again!\n\n<b>CLOSE - TRAIN WHEELS\n</b>\ncontinue to kick around the chunk of twisted metal...\n\n<b>RETURN\n</b>\nThe THUNDERING TRAIN intensifies the situation...\n\n<b>                        BILLY\n</b><b>            THAT'S RIGHT! HE'S RIGHT! YOU ARE \n</b><b>\t\tNEXT! I'M GETTING THE FUCK AWAY FROM \n</b><b>\t\tYOU!\n</b>\nBilly begins backing away from the others.\n\n<b>                        CARTER\n</b><b>            SHUT UP, BILLY!\n</b>\n<b>                        CLEAR\n</b><b>            WE DON'T NEED THIS NOW!\n</b>\nBilly continues backing away, horrified.\n\n<b>                        BILLY\n</b><b>            I DON'T NEED IT EVER! GET AWAY FROM \n</b><b>\t\tHIM! HE'S NEXT!\n</b>\n<b>CLOSE - TRAIN TRACKS\n</b>\nthe debris rattles beneath the wheels...\n\n<b>CARTER AND ALEX\n</b>\nstill on the ground...\n\n<b>                        CARTER\n</b><b>            FUCK YOU, BILLY! I'M NOT DEAD!\n</b>\n<b>BILLY\n</b>\nbacking away...\n\n<b>                        BILLY\n</b><b>            YOU WILL BE! YOU'RE DEAD! YOU'RE \n</b><b>\t\tDEAD!\n</b>\n<b>TRAIN TRACKS\n</b>\nthe debris bounces directly on the track. With great power and force, a train wheel runs over the debris, cutting it in half. It catches in the wheel and is spun around until shot out with the force of a missile...\n\n<b>BILLY\n</b>\n<b>                        BILLY (CONT'D)\n</b><b>            AND YOU AIN'T TAKIN' ME WITH YOU!\n</b>\nFWOOP! The metal tears ACROSS FRAME, ripping Billy's head from his \nshoulders.\n\n<b>ALEX, CLEAR AND CARTER\n</b>\nThe ROAR of the TRAIN seems exaggerated as they are frozen in horrified shock.\n\n<b>EXTREMELY WIDE - ACROSS THE TRACKS\n</b>\nThe train CLEARS FRAME and is gone... REVEALING, across the tracks, Alex, Clear and Carter can do nothing but watch Billy's decapitated body macabrely wobbling on its two front feet before falling to the ground.\n\n<b>                        CARTER\n</b>            Jesus fucking Christ!\n\nFor a beat, there is SILENCE... until, in the distance, SIRENS can be heard, approaching. As Alex stands and Carter manages to rise on wobbly legs... none of them can remove their eyes from Billy's body.\n\n<b>                        ALEX\n</b>                  (to Carter)\n            You should have been next. After\n            Lewton, you should've been next. \n\t\tThat's the only pattern. You should \n\t\tbe dead.\n\n<b>                        CARTER\n</b>            You're the fuckin' devil.\n\n<b>                        ALEX\n</b>                  (to Clear)\n            But I saved him. I intervened. Just \n\t\tlike the plane. That's the design.\n\n<b>                        CLEAR\n</b>            Police are coming.\n\n<b>                        ALEX\n</b>            That's why It skipped Carter and\n            went to the next one in the path\n            of the explosion; Billy.\n\nAlex looks at Clear as if expiriencing an intense epiphany.\n\n<b>                        ALEX (CONT'D)\n</b>            My intervention in the death of 180\n            surviviors will cheat the design.\n\n<b>                         CARTER\n</b>            \"Intervention?\" What are you, God\n             now?!\n\n<b>                          ALEX\n</b>            Of course not! Gods aren't afraid to\n            die! Gods don't die! We do!\n\n<b>                          CLEAR\n</b>            You're losin' it. The police will be\n            here. We have to go to the cabin.\n            You can hide there. Get your head \n\t\ttogether.\n\nAlex considers, mind racing... then realizes...\n\n<b>                        ALEX\n</b>            After Billy... it's me. And then you.\n\nClear grabs Clear and touches her face.\n\n<b>                        ALEX (CONT'D)\n</b>                  (to Clear)\n            Hey, I won't let it happen, okay.\n\nCarter turns to them; it's as far as he will go to admit he believes... or will help...\n\n<b>                        CARTER\n</b>            Then, get out of here.\n\nAs she moves to Alex, Clear nods her acknowledgement and appreciation to Carter. She takes Alex by the hand and the pair begin running away, off into the woods.\n\nIn the DISTANCE, a TRAIN WHISTLE BLOWS, eerie, as if Death was punctuating the moment.\n\n<b>                                                    CUT TO:\n</b>\n<b>EXT. CABIN - NIGHT\n</b>\nThe windows are boarded. The front steps are worn and dilapidated. In the early evening moonlight, the dwelling appears eerie and ghostly. CAMERA CREEPS TOWARD the house, a pre-storm breeze swaying branches and blowing leaves. In the distance... LIGHTNING...\n\n<b>INT. CABIN - DAY - A SMALL TABLE\n</b>\nA final piece of duct tape is applied to the corner of the table, dulling any sharp edges. Even though it is sunny outside, all the shades are pulled. The room sits in dark shadows broken by occasional bright shafts of light.\n\nCAMERA FOLLOWS a hand as it carefully picks up a Coleman lantern and sets it atop an empty can placed in the center and above the water line of a large metal tub; a fire protection moat.\n\n<b>ALEX\n</b>\nfinds his way to a chair in the center of the room, away from everything except a nearby table holding a fire extinguisher and a first aid kit, both at less than arm's reach.\n\nUnshaven, a week and a half's growth, and unkept, Alex looks horrible. An anxious zombie, especially in the dim glow of the lantern. Dark circles, from lack of sleep. Thin, from lack of food. Pale, from lack of sunlight.\n\nHe places workman's gloves on his hands before picking up a can of Underwood chicken spread. With some degree of difficulty, he works the gloves beneath the tab and pulls. Careful not to cut himself, he reaches out and drops the lid into a small trash can.\n\nAlex removes the gloves and, with a plastic spoon, begins to eat. CAMERA PUSHES IN as he begins to chew methodically, chewing and chewing and chewing with concentration until... after steadying himself... prepares to swallow... then, carefully does.\n\nPause... he's alright. He takes the spoon. Scoops some more. And the process begins again.\n\n<b>                                                      CUT TO:\n</b>\n<b>INT. BATHROOM - CLEAR RIVER'S HOUSE - DAY\n</b>\nA pink circle fills THE ENTIRE FRAME.\n\n<b>EXTREMELY CLOSE - CLEAR'S EYES\n</b>\nlook downward, anxious and full of thought.\n\n<b>A HOME PREGNANCY TEST\n</b>\nthe results are positive, two pink dots, confirming.\n\n<b>WIDER\n</b>\nClear sighs, frightened as she tosses the test upon a half dozen other discarded tests. You can never be too sure. Outside, WIND of an approaching storm blows. CAMERA tensely INCHES IN ON Clear...\n\n<b>                                                   CUT TO:\n</b>\n<b>INT. CABIN - NIGHT - CRACK BENEATH DOOR\n</b>\nThe resulting THUNDER RUMBLES. A breeze blows beneath the door, carrying some Autumn leaves. CAMERA FOLLOWS the breeze across the floor to Alex's pant legs which slightly flutter.\n\nCAMERA RISES TO ALEX, sitting in his safe chair. Paranoid and obsessively cautious, his eyes move towards the door, anticipating the consequential events. Following the path of the breeze, Alex turns around...\n\n<b>ALEX'S POV - TRASH BAG\n</b>\nthe brown shopping bag tips over. Amongst the trash spread on the floor, a can rolls out and across the floor.\n\n<b>ALEX\n</b>\ntenses. He doesn't look to where the can has been, but where it is going.\n\n<b>ALEX'S POV - CAN\n</b>\nrolls across the floor and gently hits the end of a fishing pole, propped in the corner. The pole teeters and falls over.\n\n<b>FISHING HOOK\n</b>\nfalls, hooking a closet door. The door begins to swing open.\n\n<b>ALEX\n</b>\nis quickly out of his safe chair, hustling towards...\n\n<b>THE DOOR\n</b>\nAlex slams the door shut before it can open. Behind the door, a CRASH as something falls. Alex cracks a wicked half smile, cocky he has caught Death before this attempt has brought to fruition.\n\nAlex removes the hook from the door and places the pole on the floor. He cautiously opens the door, REVEALING an old fish scaling knife embedded on the back side of the door, unaware. Removing the knife and securing it, his eyes turn towards the floor.\n\n<b>CLOSET FLOOR\n</b>\na tackle box has spilled thick, rusted old treble and aberdeen fishing hooks upon the floor. Alex bends down and examines them.\n\n<b>                        ALEX\n</b>                  (as if to Death)\n            Rusted. Tetanus. Nice touch.\n                  (defiant)\n            I overlooked it. You tried to\n            capitalize. But I caught you,\n            you fuck. I can beat you. Not\n            forever, but I got this cabin\n            rigged to beat you NOW!\n\nO.S., a sound. Like a THUMP near the cabin steps. He freezes, like an animal sensing danger. THUNDER RUMBLES. The light around him begins to flicker and sway.\n\n<b>COLEMAN LANTERN\n</b>\na draft creeps beneath the glass enclosure. The flame, dancing.\n\n<b>                                                    CUT TO:\n</b>\n<b>INT. BEDROOM - CLEAR RIVER'S HOUSE - DAY\n</b>\nENTERING FRAME, Clear peeks out the window, careful not to be seen.\n\n<b>EXT. CLEAR RIVER'S STREET - DAY - CLEAR'S POV\n</b>\nThe unmarked F.B.I. sedan maintains surveillance. Schreck and Weine sit inside.\n\n<b>INT. BEDROOM - CLEAR RIVER'S HOUSE - DAY\n</b>\nDistant... APPROACHING THUNDER RUMBLES as she steps away. The weight of the world on her shoulders, Clear paces, considering her options. She looks to a bookshelf...\n\n<b>CLOSE - AN OLD PHOTOGRAPH\n</b>\nA man, early thirties, holds a six year old girl in his arms, waving at the camera. Both appear happy and alive. They are standing before the cabin surrounded by the thick woods.\n\nThe photograph is turned over. On the back is marked in a young girl's handwriting, \"me and dad at the cabin. 1986.\"\n\n<b>CLEAR\n</b>\nAs CAMERA PUSHES INTO HER... considering life. Then, now and what is to come.\n\n<b>                                                        CUT TO:\n</b>\n<b>INT. UNMARKED CAR - NIGHT\n</b>\nWeine sits in the passenger seat looking through the pair of binoculars. Schreck is behind the wheel.\n\n<b>                        WEINE\n</b>            She was up there a minute ago...\n\nA figure steps into the drivers side window, from the rear. The two agents are startled as Clear Rivers leans into FRAME. She pauses, gauging their trustworthiness, then...\n\n<b>                        CLEAR\n</b>            I'm not turning him in. There's\n            another life that needs him now.\n\nThe two agents remain respectful...\n\n<b>                        CLEAR\n</b>            I go with you.\n\n<b>                        WEINE\n</b>            You can't.\n\nShe considers... and understands.\n\n<b>                        CLEAR\n</b>            Don't hurt him.\n\n<b>                        WEINE\n</b>            Tell us where he is. Wait at home, \n\t\tand I promise... we'll bring him \n\t\tback safe, in protective custody.\n\nAs she senses the agents' sincerity...\n\n<b>INT. CABIN - NIGHT\n</b>\nDistant THUNDER ECHOES. Alex kindles a fire in the fireplace, balling up old newspapers. He begins to crumble the local news... then pauses.\n\nA headline catches his attention. CAMERA INCHES IN ON HIM, tense, while THUNDER RUMBLES. As he unrolls the paper, his expression is rocked... anxious... he cocks his head to consider... recalling... as CAMERA PUSHES ALL THE WAY INTO...\n\n<b>HEADLINE - CRUMPLED NEWSPAPER\n</b>\n\"PARENTS TO ESTABLISH MEMORIAL SCHOLARSHIPS.\" Besides the headline are two yearbook photos; Christa Marsh and Blake Dreyer.\n\n<b>ALEX\n</b>\nhis expression reflects a terrifying revelation...\n\n<b>                        ALEX\n</b>            I... never moved. Christa asked\n            me to move, but I didn't change\n            seats. I would've moved up...\n            next to Tod... How could I not\n            remember... that... I never\n            moved. Clear's seat was in front\n            of mine...\n\nCAMERA PUSHES into a TIGHT CLOSE UP...\n\n<b>                        ALEX (CONT'D)\n</b>            She's next.\n\n<b>                                                       CUT TO:\n</b>\n<b>INT. CLEAR RIVER'S HOUSE - NIGHT\n</b>\nClear paces in her living room. She moves to the curtains and checks out the window. Although it is not raining, LIGHTNING CRACKS across the sky!\n\n<b>EXT. CLEAR RIVER'S HOUSE - NIGHT - POWER LINE\n</b>\nThe lightning STRIKES the top of the pole, SNAPPING two power lines, which whip in the wind.\n\n<b>INT. CLEAR RIVER'S HOUSE - NIGHT\n</b>\nThe power goes out. The room turns dark. Outside, brilliant bluish white arc lights CRACKLE. Clear moves to the window.\n\n<b>EXT. CLEAR RIVER'S HOUSE - NIGHT - CLEAR'S POV - POWER LINES\n</b>\nARC violently striking the ground and each other. Each line whips \nunpredictably like an uncontrolled garden hose with the water turned on full. And yet, there's a mean, angry and taunting personality to the two power lines. As if Death were within them.\n\n<b>INT. CLEAR RIVER'S HOUSE - NIGHT\n</b>\nShe assesses the situation and moves to a pair of candles on the mantle, lightning them with a Bic. O.S., from the backyard, a DOG BARKS. Clear brings the candle through the small house.\n\n<b>INT. KITCHEN - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nClear moves quickly to the kitchen, holding the candle. Outside, BLUE ARC LIGHT CRACKLES. She looks out the backyard.\n\n<b>EXT. BACKYARD - CLEAR RIVER'S HOUSE - NIGHT - CLEAR'S POV\n</b>\nAn old circular clothesline turns like a pinwheel in the wind. In the center of the yard is an oblong, tarped above ground pool. In the furthest corner of the yard, her dog is chained to a tree, BARKING AND FREAKED OUT. An old tire swing rocks in the storm. From the manner in which the house is situated and the length of the snapped power lines, one is capable of reaching the backyard.\n\nThe power line STRIKES the ground, \"closing in on\" the dog.\n\n<b>INT. KITCHEN - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nClear considers the danger of venturing out to get the dog.\n\nAlthough no window is open, and the power outage has shut off any air conditioning... the candle flame whips, then extinguishes. The blue smoke swirls ominously into the room.\n\n<b>EXT. BACKYARD - CLEAR RIVER'S HOUSE - NIGHT - CLOTHESLINE\n</b>\nSharp metal edges spin. Glinting blue arc light...\n\n<b>                                                    CUT TO:\n</b>\n<b>EXT. CABIN - NIGHT\n</b>\nAlex charges out the front door, leaping over the steps. O.S., SEVERAL CARS APPROACH, headlights pan across the trees. Alex stops dead in his tracks and runs off into the woods, just as the F.B.I umarked sedan and three Sheriff 4x4s THUNDER up to the cabin, siren lights swirling.\n\n<b>INT. UNMARKED CAR - NIGHT\n</b>\nWeine is driving, leading the other vehicles. Schreck points out the passenger window.\n\n<b>                        SCHRECK\n</b>            There!\n\n<b>EXT. CABIN - NIGHT - WEINE'S POV - THROUGH CAR WINDOW\n</b>\nFull sprint, Alex disappears into the dark forest.\n\n<b>WIDER\n</b>\nthe cars BRAKE to a stop, SKIDDING in the dirt. Sheriffs leap out of their vehicles. High powered flashlights shoot beams in Alex's direction. The officers take after the suspect.\n\n<b>                                                      CUT TO:\n</b>\n<b>EXT. BACKYARD - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nThe backdoor opens. Clear charges out into the backyard.\n\n<b>THE DOG\n</b>\nHelpless, chain wrapped around the tree. THUNDER RUMBLES.\n\n<b>CLEAR\n</b>\ncontinues to run...\n\n<b>THE CIRCULAR CLOTHESLINE\n</b>\nis whipped by a power line. SPARKS FLY as the base pole snaps in two.\n\n<b>CLEAR\n</b>\nthe metal poles punge into the ground just before and behind her, inches from impaling her. She stumbles, but quickly steps aside and continues toward the tree.\n\n<b>THE CIRCULAR CLOTHES-LINE FRAME\n</b>\nis rolled by the winds, across the yard toward...\n\n<b>ABOVE GROUND POOL\n</b>\nthe clothesline frame punctures the pool. Water streams from the rupture.\n\n<b>CLEAR\n</b>\nreaches the tree and begins unfastening the dog's collar from the chain.\n\n<b>THE POWER LINES\n</b>\nwhipping, strike one another causing an angry FLASH!\n\n<b>THE RIVETS\n</b>\nholding the pool frame begin to BREAK and POP. Water floods into the yard.\n\n<b>                                                         CUT TO:\n</b>\n<b>EXT. FOREST - NIGHT\n</b>\nCAMERA MOVES WITH Alex, blindly running through the forest, sheriffs' flashlight beams crossing behind him... in pursuit.\n\nLooing back to check the postition of the agents, Alex blindly runs over the lip of a downward slope...\n\n<b>GULLY\n</b>\nHe rolls and tumbles uncontrollably down the hillside. As he nears the base...\n\n<b>ALEX\n</b>\nstops with a CRUNCHING THUD... his face an inch from being impaled by a sharp, thick protruding branch. No time to catch his breath, he's up and running.\n\n<b>                                                           CUT TO:\n</b>\n<b>EXT. BACKYARD - CLEAR RIVER'S HOUSE - NIGHT - CLEAR'S FEET\n</b>\nwater floods, pooling the backyard, cascading over Clear's feet. She looks down, in the reflection of the puddle, the dark shadow passes. Clear whips up, checking the position of...\n\n<b>A POWER LINE\n</b>\ncoils, like a cobra, ready to STRIKE!\n\n<b>TREE\n</b>\nClear drops the chain and hits the dog on its backside.\n\n<b>                        CLEAR\n</b>            Run!\n\nThe dog starts to tear off toward the house. Clear runs toward the hanging tire. Leaps...\n\n<b>THE POWER LINE\n</b>\nwhips, the frayed wires hitting the puddle of water...\n\n<b>CLEAR\n</b>\nin mid-air, desperately grabs the tire, hanging on, literally for her life. O.S., the dog YELPS. Clear turns back...\n\n<b>CLEAR'S POV - THE DOG\n</b>\nconvulses in the small pool of water, burning from the overwhelming amounts of electricity.\n\n<b>                                                           CUT TO:\n</b>\n<b>EXT. FOREST - NIGHT - SMALL CREEK\n</b>\nDistant flashlights reflect in a small stream, barely two inches deep. Alex's foot splashes in the water. THUNDER RUMBLES.\n\n<b>ALEX\n</b>\nraces along the path of the stream.\n\n<b>SHERIFFS\n</b>\ncontinue their pursuit through the dark trees.\n\n<b>ABOVE\n</b>\nLightning CRACKS a tree branch.  SPARKS FLY! The tree tumbles down the branches.\n\n<b>ALEX\n</b>\nThe thick branch falls from above, landing on top of him. He's knocked to the ground and pinned... face down in the creek.\n\nCAMERA MOVES IN... his nose and mouth, just below the water line, but he cannot move. His eyes flash with panic, as he struggles... battles to move and avoid drowning in two inches of water.\n\nAs he struggles in the f.g., Weine and a pair of Sheriffs appear ten yards beyond him. They pause, confused, panning their flashlights across the forest.\n\n<b>WIENE'S POV - FOREST\n</b>\nthe lights actually expose the area where Alex lies. From their postition, however, he is covered by the branch and out of sight.\n\n<b>ALEX\n</b>\nstruggles to raise his head above the water, chest bursting...\n\n<b>WEINE AND SHERIFFS\n</b>\nbelieving Alex is not in the area, move ahead into the woods.\n\n<b>                                                           CUT TO:\n</b>\n<b>EXT. BACKYARD - CLEAR RIVERS'S HOUSE NIGHT\n</b>\nClear pulls herself up to a tree branch. Lighting and THUNDER CONTINUE amongst the ARCING, CRACKLING POWER LINES. She searches for an escape.\n\n<b>CLEAR'S POV - THE TREE BRANCH\n</b>\nextends toward the house.\n\n<b>CLEAR\n</b>\nstraining in the storm, begins moving up the branch...\n\n<b>                                                           CUT TO:\n</b><b>EXT. FOREST - NIGHT - CLOSE - ALEX'S EYES\n</b>\ndart open. Taking a tenth of a second to gather all of his strength, all his courage, he arches his back, pushing with his hands, anything to lift his face out of the stream.\n\nWith a DEEP GASP, he does so. Drinking up the air. It appears to infuse him with another blast of adrenaline as he manages to push with his arms and free himself from the pinning tree branch.\n\nHe pauses only for a couple gulps of air... and is off.\n\n<b>                                                         CUT TO:\n</b>\n<b>EXT. WINDOW - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nClear leaps from the end of the branch to her window, grabbing the sill awkwardly, she dangles outside the house. With a breath, she pulls herself inside, just as the power line bites, ARCING, at her feet.\n\n<b>                                                        CUT TO:\n</b>\n<b>EXT. FOREST - NIGHT\n</b>\nWeine RUNS INTO FRAME, looks around, frustrated...\n\n<b>                        WEINE\n</b>                  (into radio)\n            Lost him.\n\n<b>ANOTHER PART OF THE FOREST - SCHRECK\n</b>\ndeperately scans the area.\n\n<b>                        SCHRECK\n</b>            From the direction... there's only \n\t\tone place he can heading...\n\n<b>                                                         CUT TO:\n</b>\n<b>EXT. CLEAR RIVER'S HOUSE - NIGHT\n</b>\nThe power lines strike the rooftop.\n\n<b>INT. CLEAR RIVER'S HOUSE - NIGHT\n</b>\nClear River's stands in her bedroom just as it fills with blinding blue light. Her television screen BLOWS OUT. Sparks jet across the room. Blasts of FLAME erupt from the electrical outlets. She quickly turns, racing toward the hallway.\n\n<b>INT. HALLWAY - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nCAMERA IS LOW, RACING WITH HER as SPARKS EXPLODE FROM the lamps and electrical outlets. She cuts and leaps three steps at a time down the staircase...\n\n<b>                                                          CUT TO:\n</b>\n<b>EXT. EDGE OF THE WOODS/BACKYARD - NIGHT\n</b>\nAlex tears across the fenceless backyards towards Clear's house. Blue ARC light glowing from the front yard.\n\n<b>                                                    CUT TO:\n</b>\n<b>INT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nA mid-eighties Corolla is parked amongst Clear's artwork. A door, adjacent to the kitchen flies open. Clear hustles through, running to the car and entering via the passenger door, for the sake of expediency.\n\n<b>EXT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nThe power lines WHACK angerily against the door.\n\n<b>INT. COROLLA - NIGHT\n</b>\nClear scoots into the driver's seat. She CLICKS the automatic garage door opener...\n\n<b>GARAGE DOOR OPENER MOTER\n</b>\nconnected to a metal arm, attached to the door, remains motionless - there is no power.\n\n<b>INT. COROLLA - NIGHT\n</b>\nRealizing the motor is dead, Clear takes a beat, STARTS THE ENGINE and SHIFTS INTO REVERSE...\n\n<b>EXT. BACKYARD - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nAlex reaches the backyard. CAMERA PUSHES IN as he quickly tries to deduce the deadly situation. HE RUNS OUT OF FRAME...\n\n<b>INT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nClear guns the small car in reverse.\n\n<b>GARAGE DOOR\n</b>\nas the rear of the car makes impact with the door...\n\n<b>THE GARAGE OPENER\n</b>\ntrembles, the long metal arm collapses, falls...\n\n<b>EXT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nBAM! In reverse, the Corolla SMASHES through the garage door.\n\n<b>THE METAL ARM\n</b>of the garage door opener RIPS through the windshield, locking upon the windshield wiper grille. The other end remains attached to the garage roof interior, essentially acting as an anchor.\n\n<b>INT. COROLLA - NIGHT\n</b>\nThe car SHUDDERS, wheels spinning uselessly, as the arm \"holds\" onto the car.\n\n<b>INT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT - DOOR OPENER MOTER\n</b>\nthe screws holding the arm to the ceiling begin to pull away...\n\n<b>A METAL CAN\n</b>\non a shelf, is rocked as, O.S., the CAR rattles the garage, trying to break free. The can is marked \"TURPENTINE: EXTREMELY FLAMMABLE.\" The can tumbles over the shelf.\n\n<b>GARAGE FLOOR\n</b>\nthe can SMACKS on the floor, edgewise, REVREALING the can is sealed tight with a cap.\n\n<b>EXT. CLEAR RIVER'S HOUSE - NIGHT - POWER LINE\n</b>\nthick cable ARCS, snapping toward the car INTO FRAME.\n\n<b>INT. COROLLA - NIGHT\n</b>\nFoot to the floor, Clear SCREAMS for the car to move.\n\n<b>INT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT - DOOR OPENER MOTOR\n</b>\npulls away from the ceiling.\n\n<b>EXT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nThe Corolla lurches backward, freed from the grasp of the house.\n\n<b>INT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\na chunk of the ceiling collapses upon Clear's artworks, including the canvas incorporating a jagged piece of debris from Flight 180. The metal SLAMS to the floor, on top of...\n\n<b>THE CAN OF TURPENTINE\n</b>\nwhich causes the flammable liquid to stream out, toward the driveway.\n\n<b>EXT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nAs the Corolla lurches away from the house down the sloped driveway...\n\n<b>THE POWER LINE\n</b>\nTHUDS upon Clear's car.\n\n<b>INT. COROLLA - NIGHT\n</b>\nAn ear splitting CRACKLE. SPARKS FLY! The electrical system of the samll car erupts and the engine dies. The car stops.\n\n<b>EXT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nFrom the rear of the house appears Alex. CAMERA SWEEPS IN ON HIM as he reacts to the situation...\n\n<b>                        ALEX\n</b>            Don't move!\n\n<b>WIDER\n</b>\nThe power line sadistically rests atop the automobile. The exposed end of the cable flutters and whips like a cat's tail, SPARKING, CRACKLING, as it hits the ground.\n\n<b>INT. COROLLA - NIGHT\n</b>\nClear looks up desperately to Alex.\n\n<b>EXT. GARAGE - CLEAR RIVER'S HOUSE - NIGHT\n</b>\nAlex extends his hands. O.S., CARS approach THUNDEROULSY...\n\n<b>                        ALEX\n</b>            You're grounded in the car. Don't\n            touch anything. DON'T MOVE.\n\n<b>IN THE STREET\n</b>\nThe unmarked F.B.I. vehicle and two sheriff patrol cars pull up on the street. Schreck and Weine hustle out of the car.\n\n<b>                        WEINE\n</b>            Alex, get away from there!\n\n<b>                        SCHRECK\n</b>            Any part of that line touches you,\n            you're dead.\n\n<b>THE POWER LINE\n</b>\nSNAPS in ALEX'S DIRECTION.\n\n<b>ALEX\n</b>\nlurches back...\n\n<b>THE STREAM OF TURPINTINE\n</b>\nis ignited by a single spark fom the power line. It flows toward the car.\n\n<b>ALEX\n</b>\nbacks away, eyes locked with Clear's, assuring she's remaining in the car.\n\n<b>CLEAR\n</b>\nkeeps her eyes locked on Alex, watching him. Suddenly, a BURST OF FIRE FLASHES FROM BELOW FRAME...\n\n<b>ALEX\n</b>\nreacts, shocked. He realizes...\n\n<b>WIDER\n</b>\nthe underbelly of the Corolla has ignited from the stream of combustible fluid.\n\n<b>SCHRECK AND WEINE\n</b>\nstep forward...\n\n<b>THE POWER LINE\n</b>\natop the car, whips, ARCS, warning everyone away.\n\n<b>IN THE COROLLA\n</b>\nClear can see the flames, her instinct is to grab the handle to get out.\n\n<b>CLEAR'S POV - GARAGE WALL\n</b>\nThe fire roars angrily in the f.g., on the garage wall, however, the shadows do not match that of the flames, rather, the approaching form of Death appears.\n\n<b>ALEX\n</b>\nsteps closer...\n\n<b>                        ALEX\n</b><b>                  NO!\n</b>\nCAMERA PUSHES IN ON ALEX as he quickly considers, then moves toward the hood of the burning car...\n\n<b>SCHRECK AND WEINE\n</b>\n<b>                        WEINE\n</b>            Get back! You'll both die!\n\n<b>ALEX AND CLEAR\n</b>\nhearing this, Alex's mind is made up. He looks to Clear.\n\n<b>                        ALEX\n</b>            You know what to do.\n\n<b>                        CLEAR\n</b>            No! No! Don't!\n\n<b>                        ALEX\n</b>            When I do this.. it'll have skipped \n\t\tyou... and it'll all be over.\n\nAt that moment, Clear doesn't understand. She looks to him, scared...\n\n<b>                        ALEX\n</b>            You know what to do. I'll always be \n\t\twith you.\n\nHe reaches out and grabs the power line, falling back to pull it away from the hood of the car. The cable ARCS furiously.\n\n<b>COROLLA\n</b>\nClear opens the driver's side door and runs out, knocked to her feet as behind her the car EXPLODES.\n\n<b>ALEX\n</b>\nis engulfed in the flames.\n\n<b>ALEX'S POV - THE SHADOWS\n</b>\nthe edges of the FRAME are collapsing. Alex's face, gray and emotionless appears, yet, before it can transform into decay...\n\n<b>ALEX\n</b>\nthrough the flames, as if sensing the oncoming horror, defying the image...\n\n<b>                        ALEX\n</b><b>            NO!\n</b>\nHe looks toward...\n\n<b>CLEAR - ALEX'S POV\n</b>\nShe... is the last sight he'll ever see.\n\n<b>WIDER\n</b>\nThe power line ERUPTS! Alex disapears behind the wall of fire and sparks before falling limp on the driveway.\n\n<b>CLEAR\n</b>\nSchreck, Weine and PARAMEDICS rush to the girl. Schreck turns back, calling out to a paramedic, helplessly watching by ther burning car.\n\n<b>                        SCHRECK\n</b>            Is he alive?\n\n<b>CLEAR'S EYES\n</b>\nflash open, horrified, answering the question...\n\n<b>THE SKY\n</b>\na web of LIGHTNING CRACKS across the Heavens, as if Death was making a final angry proclamation.\n\n<b>SCHRECK AND WEINE\n</b>\nCAMERA EASES IN on the agents, exchanging rattled expressions that convey their unease in the proof that Alex was right.\n\n<b>CLEAR - OVERHEAD\n</b>\nAs a pair of paramedics work on her, a soft breeze blows across the girl, and only the girl. CAMERA MOVES DOWN TO HER FACE, her eyes opened... welling with tears... seeming to realize... to sense, he is gone.\n\n<b>                                                          CUT TO:\n</b>\n<b>INT. DELIVERY ROOM - DAY - CLEAR\n</b>\nSCREAMS, as if reacting to Alex's death, but in actuality it is a reaction to the pain of delivering her child.\n\n<b>DOCTORS AND NURSES\n</b>\nstand between Clear's legs in the stirrups...\n\n<b>                        DOCTOR\n</b>            A little more. Little more!\n\n<b>CLEAR\n</b>\nbreathes, pushes hard. Alex's parents stand on each side of her, holding her hand, wiping her forehead.\n\n<b>THE DOCTOR\n</b>\ncuts the umbilical cord.\n\n<b>                        DOCTOR\n</b>            He's here. A beautiful boy.\n\n<b>CLEAR, KEN AND BARBARA\n</b>\nsmile and fight back the tears. Clear begins to laugh euphorically through the tears.\n\n<b>                        CLEAR\n</b>            I felt him! When the baby was\n            born... I felt Alex pass through me...\n            like the night he died...\n\nClear lifts her head up, still battling the pain of labor...\n\n<b>CLEAR'S POV - THE BABY\n</b>\ncovered in goop, eyes shut... a new life arrives.\n\n<b>DOCTOR\n</b>\nlooks at the clock and reprots to an attending nurse. Another nurse cleans up the baby, wieghs him and places him in a hospital bassinet.\n\n<b>                        DOCTOR\n</b>            13th of May... 4:25 p.m.\n\n<b>CLEAR, KEN AND BARBARA\n</b>\nBarabra places a cool wet cloth on Clear's forehead...\n\n<b>                        BARBARA\n</b>            Exactly a year... to the minute.\n\nEveryone recognizes the eerie, yet beautiful coincidence. Clear leans her haed back, relieved, euphoric...\n\n<b>                        CLEAR\n</b>            We beat it, Alex.\n\nCleaned and wrapped in a swaddling blanket, the baby is placed in the mothers arms. The long retrospective harmonica of Neil Young's \"Long May You Run\" reprises as Clear looks at the I.D. braclet...\n\n<b>WRIST BRACLET\n</b>\n\"Alexander Chance Browning II.\"\n\n<b>DELIVERY ROOM\n</b>\nCAMERA PULLS BACK. The birthing room is quiet; the people introspective. The doctors. The family. The mother and child. A room of new life, in which, each recalls a life lost.\n\nAs \"Long May You Run\" OVERLAPS...\n\n<b>                                                   DISSOLVE TO:\n</b>\n<b>INT. ALEX'S BEDROOM - DAY - FLOWERS\n</b>\nA bright, colorful arrangment of flowers is carefully placed into a vase. CAMERA ADJUSTS to REVEAL Alex's bedroom is now lived in by Clear and the baby. Clear makes the final adjustment in the arrangement, then checks the sleeping baby in the bassinet.\n\nClear moves to her bed with a book. As she settles in, O.S., a faint RUSTLE. CAMERA INCHES IN ON CLEAR as she looks to...\n\n<b>CLEAR'S POV - THE FLOWERS\n</b>\na soft breeze causes the petals to flutter...\n\n<b>CLEAR\n</b>\nlooks toward...\n\n<b>CLEAR'S POV - THE WINDOWS\n</b>\nwhich are closed.\n\n<b>CLEAR'S POV - THE FAN\n</b>\nwhich... is off.\n\n<b>CLEAR\n</b>\nlooks across the room...\n\n<b>CLEAR'S POV - THE ROOM\n</b>\nThe breeze moves through the flowers... billows the cutains, posters and photos on the wall... until seemingly settling over the bassinet. The lace trim and blankets rustled by the breeze, it is hovering over the child.\n\n<b>CLEAR\n</b>\nCAMERA SETTLES, but her expression does not reflect fear. She knows Alex is here... and she smiles, tears welling in her eyes.\n\n<b>THE BABY\n</b>\nthe bassinet trim settles, as if the presence is leaving. Before it fully departs...\n\n<b>CLEAR\n</b>\nthe wind softly and rapidly passes over Clear. He smile remains as the room becomes still and her eyes looks across the room.\n\n<b>CLEAR'S POV - ON THE WALL\n</b>\nis a pencil rubbing, like people take away from the Vietnam veteran's Memorial. The name... \"ALEX BROWNING...\"\n\n<b>                                                          CUT TO:\n</b>\n<b>EXT. MT. ABRAHAM HIGH SCHOOL - DAY - CLOSE - MONUMENT\n</b>\n\"ALEX BROWNING\" is marked in the granite. CAMERA PULLS BACK TO REVEAL the name has been added to the memorial, along with Tod Waggner, Valerie Lewton, Terry Chaney and William Hitchcock.\n\nA hand ENTERS FRAME, fingers hover in space before they gently trace over \"Terry Chaney.\" CAMERA ADJUSTS TO REVEAL Carter Horton, staring at the name. Alone, he allows himself the moment to grieve. Carter glances up to find Clear approaching with the baby in the stroller.\n\nCarter straightens and nods, then begins to walk away. He hesitates, then turns back to Clear.\n\n<b>                        CARTER\n</b>            Alex was right.\n\nClear looks up.\n\n<b>                        CARTER (CONT'D)\n</b>            It did skip us.\n\nClear smiles. As she takes the baby out of the stroller...\n\n<b>                        CLEAR\n</b>            I believe... that's what Alex\n            believed. But how do we know... this\n            wasn't the design all along?\n\nClear holds baby Alex up to the monument, showing her son his father's name. Carter stands, watching. CAMERA WIDENS to REVEAL the entire monument against the deep blue sky. At the base in readable, but understandable lettering... \"FLIGHT 180.\"\n\nCAMERA HOLDS as \"Long May You Run\" CONTINUES... RETURNING each of us to the awaiting darkness.\n\n<b>                                                        FADE OUT.\n</b>\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Final Destination</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=James Wong\" title=\"Scripts by James Wong\">James Wong</a>  <a href=\"/writer.php?w=Glen Morgan\" title=\"Scripts by Glen Morgan\">Glen Morgan</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Final Destination Script.html#comments\" title=\"Final Destination comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:05:21.160669"}