{"title": "Final Destination 2", "film_link": "/Movie Scripts/Final Destination 2 Script.html", "script_link": "/scripts/Final-Destination-2.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Final Destination 2 Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Final Destination 2 Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/7-stars.gif\"/> (7.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=J. Mackye Gruber\" title=\"Scripts by J. Mackye Gruber\">J. Mackye Gruber</a><br/>  <a href=\"/writer.php?w=Eric Bress\" title=\"Scripts by Eric Bress\">Eric Bress</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<br/>\n<a href=\"/scripts/Final-Destination-2.html\">Read \"Final Destination 2\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>                    FINAL DESTINATION 2\n                          By J. Mackye Gruber and Eric Bress\n\n\n<b>FADE IN:\n</b>\n<b>INT. DARK ROOM - NIGHT\n</b>\n<b>TITLES OVER:\n</b>\nA padded wall is papered with NEWSPAPER CLIPPINGS that date back to\nthe early 1900s:\n\n\"LOCAL FOWLER BROTHERS LOSE $35 TICKETS TO BOARD TITANIC\" appears\nover \"FOWLER BROTHERS KILLED IN COAL MINE MISHAP.\" Another series of\narticles reads, \"JEWISH PROFESSOR DENIED ADMITTANCE TO HINDENBURG\"\nand \"PROFESSOR RABINOWITZ KILLED IN AVALANCHE.\" Etc...\n\nContinuing along the wall, the newspaper articles all focus on the\nfates of the original SURVIVORS of the FLIGHT 180 CRASH.\n\nWe DISSOLVE between the various headlines depicting the gruesome\ndeaths of Tod, Terry, Ms. Lewton, Billy Hitchcock, Carter and Alex\nBrowning.\n\nAlso in the mix are various CRIME SCENE PHOTOS of the deaths.\n\nDecapitated torsos, crushed, mangled bodies, the charred remains of\nanother and the face- down body of Alex Browning.\n\nMAPS line the walls as well, pinpointing the locations of numerous\ndeaths, perhaps seeking a pattern. Charts that timeline bizarre\ndeaths, seating charts of downed aircraft, etc...\n\nLATEX -GLOVED HANDS tear out the last article, apply fun- tack to its\ncorners and place it in the center of all the others:\n\n<b>A REMEMBRANCE FOR THE VICTIMS OF FLIGHT 180\n</b>\nFriday marks one year anniversary.\n\n<b>END TITLES.\n</b>\nFLASH TO BLACK as a HAND ENTERS FRAME, PULL BACK TO REVEAL:\n\n<b>EXT. KIMBERLY'S NEIGHBORHOOD - DAY\n</b>\nKIMBERLY BURROUGHS, 19, puts a folded AAA map in her mouth. She opens\nthe back of a RED NISSAN SUV, and pla ces her duffel bag inside.\n\nThat done, she lets the map drop from her mouth, catches it in her\nfree hand and turns to hug her father, MR. BURROUGHS.\n\n\n<b>                        KIMBERLY\n</b>               Thanks, Dad. I'll call you.\n<b>\n</b><b>                      MR. BU RROUGHS\n</b>             You have everything, Kimberly?\n             Credit card, cell phone, AAA card?\n\n<b>                      KIMBERLY\n</b>             Relax, Dad. It's Daytona, not\n             Mongolia.\n\n<b>                       MR. BURROUGHS\n</b>                     (playful)\n             Fix -A-flat? Road flares?\n             Sunblock? Mace?\n\n<b>                      SHAINA (O.S.)\n</b>             Condoms, handcuffs, lube?\n\nKimberly and Mr. Burroughs turn to see --\n\nSHAINA, 19, tall leggy brunette. Tan, tight tube top revealing her\npierced navel, Kimberly's best friend. She walks up the driveway with\nher bags.\n\n\n<b>                      SHAINA\n</b>             Just kidding, Mr. B. Don't worry,\n             I'll keep an eye on her.\n\n<b>                       MR. BURROUGHS\n</b>                     (sarcastic)\n             Oh, that makes me feel a lot\n             better.\n\nShaina throws her bags in, shuts the back and climbs in the SUV.\nKimberly hugs her dad, kissing him on the cheek.\n\n\n<b>                      KIMBERLY\n</b>             I know this is the first time we've\n             been apart since. But everything's\n             gonna be okay.\n\n<b>                      MR. BURROUGHS\n</b>             I know, honey. I just --\n\nKimberly hugs him tighter. Cutting him off.\n\n\n<b>                      MR. BURROUGHS\n</b>             Your mother would have been so\n             proud of the way you've handled\n             yourself through all of this...\n\n<b>                      KIMBERLY\n</b>                    (softly)\n             I know, Dad.\n\n<b>                       SHAINA (O.S.)\n</b>              Hello, the guys are waiting!\n<b>\n</b>Kimberly gives him a quick kiss, jumps behind the wheel, starts the\ncar and pulls away as Shaina cranks up the stereo.\n\n\n<b>                        MR. BURROUGHS\n</b>               Buckle up!\n\nMr. Burroughs waves as the girls roar off. As he looks down he spots\nan OIL STAIN left by Kimberly's SUV. As he drags his shoe across the\nstain, a SLIGHT BREEZE blows past his face.\n\nCAMERA PUSHES IN as a look of concern crosses his face.\n\n<b>EXT. HIGHWAY ON RAMP - DAY\n</b>\n<b>ON OLD WOMAN\n</b>\nAs she pushes her supermarket cart up the on ramp. A SQUEAKY WHEEL is\nshrill and disturbing.\n\nDRIVERS of several waiting vehicles avoid staring at her weathered\nface as she passes. Up ahead waiting in line, is Kimberly's red SUV.\n\n<b>UP AHEAD\n</b>\nWaiting in line, is Kimberly's red SUV.\n\n\n<b>                        SHAINA (O.S.)\n</b>               Watch it!\n\nKimberly accidentally KISSES the bumper in front of her while\ndaydreaming. She calls out to the driver in front:\n\n\n<b>                         KIMBERLY\n</b>               Sorry!   My fault!\n\nShaina looks over, concerned. In the backseat, the guys DANO and\nFRANKIE laugh hard and some of Frankie's milkshake comes out of his\nnose.\n\n\n<b>                        SHAINA\n</b>               Want me to drive?\n\n<b>                        KIMBERLY\n</b>               No, I'm good.\n\nShaina looks at Kimberly as a HAND suddenly hits Kimberly's window.\nKimberly spins around, startled.\n\nKimberly stares transfixed at the Old Woman, who stares back with\nchilling intensity.\n\nThe kids ad-lib \"Let's go\" and \"Fucking freak.\" The Old Woman's\nPLASTIC BAG BREAKS, sending oranges rolling down the on- ramp. The Old\n<b>\n</b>Woman breaks eye contact with Kimberly as she rushes to retrieve\nthem.\n\nThe signal turns from red to flashing yellow.\n\nKimberly pulls the SU V onto the highway, looking in the side view\nmirror to see the Old Woman look up at her in SLOW-MO.\n\n\n<b>                       FRANKIE\n</b>              Dano, shouldn't we go back and help\n              your mother?\n\n<b>                            DANO\n</b>              Blo w me.\n\n<b>CU ON KIMBERLY\n</b>\nAs she looks back from the mirror and reacts to an ominous electronic\nroad sign that flashes \"WARNING: CONSTRUCTION NEXT 180 FEET\".\n\n<b>NISSAN SUV\n</b>\nKimberly merging into traffic, NEARLY COLLIDES with a speeding yellow\nmini- bus carrying a high- school football team.\n\nKimberly nervously jerks the wheel to the right, then realizing she's\nspeeding towards the road construction barrels, she swerves back\nleft, right behind the mini-bus at the last moment.\n\n<b>CLOSE.\n</b>\nKimberly pulls around the mini-bus as rowdy football players tackle\neach other, yelling:\n\n\n<b>                            FOOTBALL PLAYERS\n</b>                 Pile up!    Pile up! Pile up!\n\nKimberly flicks on the radio and we hear HIGHWAY TO HELL by AC/DC at\nearsplitting volume. Kimberly and Shaina jump from the shock and\nreach to lower the volume.\n\nKimberly, disturbed by this, hits SEEK -- an oldies station. A GRISLY\nCAR CRASH from Nervous Norvus' TRANSFUSION album.\n\n\n<b>                          DANO\n</b>                 Christ, is this tribute to Princess\n                 Di Day or what?\n\nKimberly passes a car WEAVING on her right. The driver reaching into\nthe back seat to quiet a BARKING DOG hanging on its head out the\nwindow.\n\n\n<b>                            KIMBERLY\n</b><b>\n</b>                     (unnerved)\n              Jesus, all the crazies are out\n              today.\n\nA CLOUD passes Kimberly's head. She smells it and turns around,\ntaking her eyes off the road to see Dano smoking a joint.\n\n\n<b>                       KIMBERLY\n</b>              I told you no drugs in the car!    My\n              dad will freak!\n\nDano and Frankie exchange looks, God, what a geek!\n\n\n<b>                       DANO\n</b>                     (laughs)\n              Calm down, Kimmy.   It's not drugs,\n              just weed.\n\n<b>                       FRANKIE\n</b>              Yeah, you should have specified.\n\nKimberly turns to Shaina, helpless. Shaina spins around, her eyes\nwordlessly tell Dano, I know she's a priss, but put it out.\n\nThen Kimberly's CELL PHONE RINGS. She hits the speaker button.\n\n\n<b>                       MR. BURROUGHS (V.O.)\n</b>              Kimberly? It's Dad.\n\n<b>                       KIMBERLY\n</b>              Hey, Dad. What's up?\n\nDano defiantly blows more smoke toward Kimberly, then breaks into an\nunexpected coughing fit - looking over to see a HELLS ANGEL laughing\nat hi m. The biker's trashy GIRLFRIEND, also laughing, quickly FLASHES\nHER TITS at Dano over:\n\n\n<b>                       MR. BURROUGHS (V.O.)\n</b>              Your car's leaking either\n              transmission or brake fluid. I\n              want you to have it checked ASAP at\n              a gas station.\n\n<b>                       KIMBERLY\n</b>              You got it, Dad. I'll call you if\n              I have a problem.\n\n<b>                       MR. BURROUGHS (V.O.)\n</b>              I mean it. Take care of it.\n\n<b>                       KIMBERLY\n</b>              I will, Dad. Bye, luv you.\n<b>\n</b>Kimberly passes a STATION WAGON on her right, the DRIVER squinting at\na map while driving. A mattress and some furniture tied to the top\nSHIFT as the wagon hits a bump.\n\n\n<b>                        SHAINA\n</b>               Um, Kimberly, your dad's not gonna\n               call like every ten minutes is he?\n\nBefore Kimberly can answer, Dano sees a CHP speeding up behind him.\nHe lowers the joint at once.\n\n\n<b>                        DANO\n</b>                      (hiding bag of weed in\n                           pants)\n               Shit! There's a cop behind us.\n               Pull into the right lane now!\n\nKimberly, scared, does as she's told nearly colliding with a speeding\nflat bed semi hauling a huge load of logs !\n\nA HORN BLASTS. The truck swerves. Then speeds by on the right. A\nCOILED CHAIN drops down to the highway.\n\n\n<b>                        DANO\n</b>               Look first, idiot!\n\nShaina turns up the radio and leans over to Kimberly.\n\n\n<b>                        SHAINA\n</b>               Ignore 'em.\n\n<b>ON LOG TRUCK\n</b>\nOne end of the RUSTY CHAIN holding the logs in place rattles on the\npavement, sparking.\n\nLooking in her rearview mirror, Kimberly turns pale - the COP pulls\nin behind her.\n\n\n<b>                        KIMBERLY\n</b>               Dano, put that out NOW.\n\nDano takes one last drag and flicks the joint out the window. It\nbounces on the windshield of a FORD EXPEDITION to their left.\n\n<b>INSIDE THE EXPEDITION\n</b>\nKAT, 28, very corporate America, wears a navy blue power suit and\nspeaks into a phone headset while smoking a cigarette.\n\n\n<b>                        KAT\n</b><b>\n</b>             No, I'm stuck on Jury Duty so I\n             won't be able to pitch the\n             campaign. Let's get Silverstein to\n             come in and...\n\nKat sees the joint that smoulders in the dried leaves beneath her\nwindshield wipers. A moment later, a small FLAME crackles.\n\n\n<b>                      KAT\n</b>             What the hell?     No,   not you.\n\nKat flicks on her WINDSHIELD WIPER FLUID, successfully putting out\nthe joint, but her worn wipers smear ash and fluid around, impairing\nher vision.\n\nKat turns and looks at --\n\nDANO, dead serious all of a sudden. Staring straight ahead.\n\n\n<b>                      DANO\n</b>             What's the cop doing?      Did he see\n             that?\n\nKat sees the tailgating CHP, smiles, then resumes her conversation.\n\n\n<b>                       KAT\n</b>              Forget it, I'll call him myself.\n\nKat hangs up, then looks down at her cell phone, squints and dials a\nnumber...\n\n<b>PAN OFF KAT TO OFFICER THOMAS BURKE\n</b>\nEarly 20's, rookie cop, who seems to have missed the entire exchange.\n\n<b>INSIDE THE POLICE CAR\n</b>\nThomas speaks into his radio.\n\n\n<b>                      THOMAS\n</b>             I was supposed to be off today.\n             How did I get screwed?\n\n<b>                       DISPATCHER (O.S.)\n</b>              No biggie. Drake called in sick.\n\n<b>                      THOMAS\n</b>             Copy that.\n                    (switches off; annoyed)\n             Go on, sleep it off Drake.\n\nThomas tries to sip from a McDonald's coffee cup on the dashboard,\nbut it's TOO HOT. He places it back on the dash.\n<b>\n</b>The VIBRATIONS of the road make the COFFEE CUP slide closer and\ncloser to the edge of the dashboard.\n\n<b>BACK TO KIMBERLY'S SUV\n</b>\nDano nervously looks back.\n\n\n<b>                       FRANKIE\n</b>              Relax, dude.\n\nBut Kimberly still looks uneasy as her dashboard \"Check Engine\" light\nbegins flickering.\n\nKimberly spots a road sign -- Next Service 18 Miles.\n\n\n<b>                      KIMBERLY\n</b>             This trip better be wor th it.\n             What's the guy- girl ratio again?\n\n<b>                      SHAINA\n</b>             Get ready to smile, five guys per\n             girl.\n\n<b>                       KIMBERLY\n</b>              I can live with thaaaa --\n\nKimberly stops mid-sentence when the WHITE VAN in front of her\nsuddenly SLAMS ON ITS BRAKES and pulls onto the shoulder for no\nreason. Kimberly SCREAMS, swerving around the van just in time to\navoid an accident. Frankie instinctively SHOUTS at the van.\n\n\n<b>                       FRANKIE\n</b>              What's your problem, ya fuckin'\n              crack baby?!\n\n<b>INSIDE THE WHITE VAN\n</b>\nISABELLA CRUZ, late 20's and VERY PREGNANT, drives a delivery van\nfull of funeral wreaths, crosses and classic rose urns. Most are\nmarked: In Memory of Flight 180.\n\nShe chokes back sobs into a cell phone as she pulls over.\n\n\n<b>                      ISABELLA\n</b>             ...couldn't Keep your dick in check\n             for another month? I knew this\n             would happen when I got pregnant.\n\nShe pounds the steering wheel, furious.\n\n\n<b>                       ISABELLA\n</b>              What'd the doctor say? I have to\n              come in to test for STDs? Goddamn\n<b>\n</b>               you, Jorge.\n\nA CRATE in the back of her van topples over and CRASHES and a flurry\nof sunflower petals sails out the window. Isabella jumps in surprise\nand, wiping tears from her eyes, rolls up the windows as petals\nshower the visor of --\n\nEUGENE, the Harley Rider, who smears the petals (and some squashed\nbugs) around his visor and drops back.\n\n<b>INSIDE NISSAN SUV\n</b>\nKimberly falls back into the right lane and looks uneasy as she sees\na TRUCK DRIVER guzzling from a flask as it passes the SUV, revealing\nits side is an ad for FIRESTONE TIRES.\n\nIt finally clears frame, revealing a highway billboard that reads,\n<b>\"DRUNK DRIVING KILLS.\"\n</b>\nKimberly reaches back and pulls on her seatbelt in spite of laughter\nfrom the back seat.\n\nUp ahead, the RUSTY CHAIN seems to have more give to it. LOGS STRAIN\nagainst it.\n\nSuddenly, a black cloud of exhaust from a blue '83 Chevette in front\nof them causes everyone to roll up their windows.\n\nOIL DRIPS from its rusty exhaust pipe. The thick exhaust BLINDS\nKimberly.\n\n\n<b>                        FRANKIE\n</b>               Gas it around these idiots. We do\n               have 1200 miles to go, you know.\n\nKimberly tires to enter the passing lane, but she's blocked by a\nSUBURU WAGON. In the front seat, a seven- year old kid is sadistically\nSMASHING two toy cars together.\n\nKimberly passes the Suburu and pulls up to a PACER. The Harley roars\nby, startling her.\n\n<b>INSIDE PACER\n</b>\nNORA KESNER, 35, and her son TIM, 15. Tim drums on the dashboard with\ntwo ten-ounce Naya bottles.\n\n\n<b>                        NORA\n</b>               Tim, will you cut that out? I\n               can't even hear myself think.\n\nTim frowns and then winces, holding his jaw.\n\n\n<b>                        TIM\n</b><b>\n</b>              Damn, it really hurts, Mom.\n\n<b>                       NORA\n</b>              I know, we'll be there soon.\n\nTim drops the Naya bottles on the seat. One of them quietly falls to\nthe floor, rolls a bit, finally settling UNDER THE BRAKE PEDAL.\n\n<b>INSIDE NISSAN SUV\n</b>\nKimberly is still behind the smoke-spewing Chevette. She passes it on\nthe left. Frankie rolls down his window.\n\n\n<b>                       FRANKIE\n</b>                     (yells to driver)\n              Ever hear of the Ozone layer,\n              asshole?\n\n<b>INSIDE CHEVETTE\n</b>\nRORY, 27, leans down to snort a line of coke off a Def Leppard CD\ncase. S he looks up to see the Patrol Car is now behind him, he\nreflexively taps the brakes.\n\nRory, eyes like saucers, sits rigidly transfixed at the wheel and\nnonchalantly wipes the CD clean on his pants.\n\n<b>INSIDE NISSAN SUV\n</b>\nShe has dropped back behind the Chevette and CHP car and is running\ndown along side of a BLACK TRANS AM.\n\nUp ahead she sees the Hig hway Patrol Car flick on its LIGHTS and pull\ninto the shoulder around the Chevette and behind the Semi loaded with\nlogs.\n\n<b>INSIDE THE COP CAR\n</b>\nAs Thomas pulls in behind the log truck, his coffee cup lurches\nforward, spilling hot coffee all over his lap and the floor.\n\n\n<b>                       THOMAS\n</b>              Son of a bitch.\n\n<b>INSIDE TRANS AM\n</b>\nIts driver, EVAN SCHAEFFER, 21, flashes a cocky smile at Kimberly,\nclearly making Frankie jealous.\n\n\n<b>                       FRANKIE\n</b>              A Trans Am. That shit went out\n              with New Kids on the Block.\n\n<b>                       DANO\n</b><b>\n</b>              Yeah. Who does he think he is?\n              Knight Rider?\n\n<b>                       FRANKIE\n</b>                     (laughs; then)\n              Who?\n\nFrankie leans out and tosses milkshake on Evan's window.\n\n\n<b>                       DANO\n</b>              You know, Hasselhoff before he did\n              Baywatch.\n\nEvan, pissed off, flips off Frankie. The windshield wipers smear\naround the thick milky fluid. The sun blinding him.\n\n\n<b>                       KIMBERLY\n</b>              What's the chance of finding a nice\n              mature guy once we get to Daytona?\n\n<b>                       SHAINA\n</b>              How does a nice mature fuck sound?\n\nKimberly laughs, then leans in close to Shaina.\n\n\n<b>                       KIMBERLY\n</b>              Hey, thanks for talking    me into\n              this trip. Ever since     my mom... I\n              dunno, I just feel like    I'm\n              starting to live again,    you know?\n\nShaina smiles in understanding.\n\n<b>INSIDE POLICE CRUISER\n</b>\nThomas bends to wipe up the mess. He only glances at the road as he\ntries to soak up the coffee.\n\nSuddenly up ahead, THE RUSTY CHAIN SNAPS! The logs roll off the side\nof the truck onto the highway.\n\nOne bounces as it hits, and slams through Thomas' front winshield and\nout the back, taking Thomas' head with it.\n\nEUGENE slams on his brakes. His Harley slides out and he is SLAMMED\nto the ground, sliding at 60 miles per hour across the highway, right\nin front of the yellow mini-bus.\n\nThe MINI- BUS DRIVER brakes to avoid Eugene. The FOOTBALL PLAYERS\ntumble forward and hit him in the head. He loses control and slides\noff the road onto the grass median.\n\nHe blows a front tire and the mini-bus begins to flip, ROLLING\nseveral times int o the oncoming lanes of traffic, and is HIT by a\n<b>MACK TRUCK.\n</b><b>\n</b>Eugene slides into a huge log, and hits it with a sickening crunch.\nOnly to be HIT and CRUSHED by his sliding motorcycle.\n\nRory looks up too late and REAR ENDS Thomas' car, EXPLODING the gas\ntank and HURLING Rory's dead body halfway through the windshield\nwhere it remains half in/half onto the hood.\n\nKAT, dialing, looks up, slams on her brakes, but SKIDS on oil from\nthe Chevette.\nShe swerves into Kimberly, SIDE SWIPES her, then swerves to miss a\nhuge log -- only to run head on into two more, flipping the\nExpedition end over end right next to Kimberly.\n\nKimberly swerves back from being hit by Kat, just in time to see a\nhuge log ahead. She tries to turn hard to the right to avoid it, but\nhits it broadside --\n\nSending the SUV FLIPPING OVER the top of the log and SLIDING down the\nroad. Inside, Shaina, Dano and Frankie are tossed around like rag\ndolls, shredded by glass and shrapnel -- Frankie is EJECTED out the\nside window.\n\nKimberly's SUV slides to a stop on its side. She looks back to her\nmangled but still alive friends and up in time to see\n\n<b>NORA'S PACER\n</b>\nNora sees the collisions ahead and slams on the brakes but the fallen\nNaya bottle prevents her from braking, and she SLAMS into the back of\nKat's Expedition.\n\nThe crash test dummy collision folds her Pacer and it EXPLODES into a\nhuge fireball.\n\nEVAN, blinded by the smeared windshield, is too late. He swerves his\nTrans Am around the burning cars onto the wet grass.\n\nKimberly sees the topless Trans Am slowly roll out of a huge WALL OF\nFIRE and coast to a stop. Evan comes up battered and bloody but still\nalive. He is trapped in his burning car, screaming and trying to\nrelease the seatbelt.\n\nThen, just when she thought it was over, a HUGE SEMI slides thro ugh\nthe wall of fire, SMASHING the Trans Am out of the way, SPINNING it\nlike a top. With the back sliding at 90 degrees it keeps on coming.\n\n<b>KIMBERLY'S POV\n</b>\nThe semi's grill comes right at her!\n\n<b>CU ON KIMBERLY\n</b>\nShe screams and we --\n\n<b>CUT TO:\n</b>\n<b>THE HIGHWAY O N RAMP - NISSAN SUV - 8 MINUTES EARLIER\n</b><b>\n</b>Sweating profusely, Kimberly's eyes dart around, taking in her\nsurroundings...\n\n\n<b>                      DANO (O.S.)\n</b>             Flight 180. You know, that plane\n             crash with those kids from Mount\n             Abraham.\n\nThe Old Woman BUMPS the window - scaring the shit out of everyone.\n\nThe kids ad-lib \"Let's go\" and \"Fucking Freak!\"\n\nKimberly stares in horror as the Old Woman flashes an evil grin.\nKimberly's eyes lower to the bag of oranges --\n\nWhich BREAKS, exactly like before, and the Old Woman scurries after\nthem. The signal turns from red to flashing yellow.\n\n\n<b>                      FRANKIE\n</b>             Dano, shouldn't we stop and help\n             your mother?\n\n<b>                      DANO\n</b>             Blow me. Yellow means go,\n             Kimberly.\n\nKimberly hyperventilates in the driver's seat. Freaking. A yellow\nmini- bus with football players speeds past.\n\n\n<b>                          KIMBERLY\n</b>                 Oh my god, oh my god...\n\nDano, confused, rolls a joint.\n\n\n<b>                      SHAINA\n</b>             What is it? What are you?\n\n<b>                      KIMBERLY\n</b>             There's going to be a huge\n             accident! Everyone's gonna die.\n             All of us! I saw it!\n\nDano hums the Twilight Zone theme.\n\n\n<b>                          FRANKIE\n</b>                 That's it. My turn to drive.\n\n<b>CLOSE UP - KIMBERLY SCREAMS!\n</b>\n<b>AND WE'RE BACK\n</b>\n<b>THE HIGHWAY ON RAMP\n</b><b>\n</b>Sweating profusely, Kimberly's eyes dart around, taking in her\nsurroundings.\n\n\n<b>                      DANO (O.S.)\n</b>             Flight 180. Y'know, that plane\n             crash with those kids from Mt.\n             Abraham?\n\nThe Old Woman BUMPS the window - scaring the shit out of everyone.\n\nThe kids ad-lib \"Let's go\", \"Fucking freak.\"\n\nKimberly stares in horror as the Old Woman flashes an evil grin.\nKimberly's eyes lower to the bag of oranges, which breaks, exactly\nlike before and the Old Woman scurries after them.\n\nThe signal turns from red to flashing yellow.\n\n\n<b>                      FRANKIE\n</b>             Dano, shouldn't we stop and help\n             your mother?\n\n<b>                         DANO\n</b>              Blow me.    Yellow means go, Kimmy.\n\nKimberly hyperventilates in the driver's seat. Freaking. A yellow\nmini- bus with football players speeds by.\n\n\n<b>                       KIMBERLY\n</b>              Oh my God, oh my God...\n\nDano, confused, rolls a joint.\n\n\n<b>                      SHAINA\n</b>             What is it? What are you?\n\n<b>                      KIMBERLY\n</b>             There's going to be a huge\n             accident! Everyone's gonna die,\n             all of us, I saw it!\n\nDano hums the Twilight Zone theme.\n\n\n<b>                       FRANKIE\n</b>              That's it. My turn to drive.\n\nHONK! The drivers behind them start leaning on their horns. Kimberly\nleans out the window and sees the Chevette, the Pacer, The White Van,\nthe Trans Am, the Harley...all the familiar vehicles from the pile\nup. She turns on the radio, frantically scans the dial.\n\n\n<b>                         SHAINA\n</b><b>\n</b>              Relax, you need to chill the fuck\n              out.\n\n<b>                       KIMBERLY\n</b>              Highway to Hell, Highway to Hell.\n\n<b>                       SHAINA\n</b>              For Christ sakes girl, take a\n              breath.\n\n<b>                       D.J. (O.S.)\n</b>              Taking you into an all request\n              weekend with a classic from AC/DC.\n\nThe opening guitar riff to HIGHWAY TO HELL blares from the speakers.\nKimberly turns to Shaina with a \"believe me know?\" look, but Shaina's\nnowhere near on the same page.\n\nHONKING behind them.\n\nKimberly, shaking like a leaf, pulls the SUV forwards, turning it\nsideways to block off all traffic.\n\n\n<b>                       DANO\n</b>              What the hell are you doing?\n\nDano shifts in his seat and sees - a Highway Pat rol Car ominously\ncruising up the shoulder of the onramp. He shoves a bag of weed,\nalong with the joint, down his pants.\n\n\n<b>                       DANO\n</b>              Five-O's coming!   Let's fucking\n              roll, man!\n\nOfficer Thomas Burke stops the car behind them.\n\n\n<b>                       FRANKIE\n</b>              Jesus Christ! Here he comes!\n              Move!\n\n<b>                        KIMBERLY\n</b>              No!   We'll all die if we do!\n\nThe cop turns on his FLASHERS.\n\n\n<b>                       DANO\n</b>              I told you she'd ruin everything!\n\n<b>                       SHAINA\n</b>              Shut up, Dano, just stay cool.\n                     (to Kimberly)\n              He's just stoned.\n\nOfficer Thomas Burke exits his car and approaches the passenger side\nof the SUV, hand on weapon. Thomas taps the window with his knuckle.\n<b>\n</b><b>                        THOMAS\n</b>               What's going on here?\n\n<b>                        KIMBERLY\n</b>                      (incoherent, through\n                           tears)\n               There's going to be a pile up.\n               Logs. Bodies everywhere. I saw it\n               happen. It happened.\n\nThomas looks to the guys in back who shrug, \"we don't know her.\"\n\n\n<b>                        THOMAS\n</b>               Miss, please step out of the\n               vehicle.\n\nAs she does, Thomas discretely unsnaps his holster. RORY nervously\neyes the action. Sneaks a paper bundle into his sock. ISABELLA, the\npregnant woman in the White Van, gets out. She gives Thomas her\nfriendliest smile, milking the pregnant belly.\n\n\n<b>                        ISABELLA\n</b>               Excuse me, but is there some way we\n               could just drive around? I have a\n               delivery.\n\nHer CELL PHONE RINGS and she leans back inside to answer it.\n\n\n<b>                        ISABELLA\n</b>               Hey hon, you got a mysterious\n               caller on the answering machine\n               from Planned Parenthood. What's\n               going on?\n\nAs she listens, growing agitated, the Harley Rider dismounts and\npulls off his helmet. Revealing EUGENE DIX, 35, a nebbishy school\nteacher in cool leathers.\n\n<b>INSIDE PACER\n</b>\nNORA watches the SUV, distressed.\n\n\n<b>                        NORA\n</b>               What on Earth are they doing?\n\n<b>                        TIM\n</b>                      (picking up two Naya\n                           bottles)\n               Who am I, David Blane?\n\nNora gives Tim a hard stare, then they both break into smiles. Nora\ntousles his hair. And doesn't stop.\n<b>\n</b><b>                      TIM\n</b>                    (good-natured laughter)\n             Okay, quit it already.\n\nAs he laughs, something pains his jaw and he winces. THOMAS isn't\nquite sure what kind of insanity he's dealing with yet. Dano and\nFrankie, no help, stare dead ahead.\n\n\n<b>                      KIMBERLY\n</b>                    (trying to calm herself)\n             The radio played the same songs,\n             the old lady's bag broke the exact\n             same way it did in my premonition.\n\nKimberly erupts into a panic when she sees the LOG TRUCK speed past.\nShe grabs at Thomas for emphasis.\n\n\n<b>                      KIMBERLY\n</b>             THAT's the truck that's going to\n             kill everyone!\n\n<b>                      THOMAS\n</b>             Alright miss, calm down. I just\n             need this lane open. I need you to\n             pull your vehicle onto the\n             shoulder!\n\n<b>                      KIMBERLY\n</b>             You're not listening to me!   You\n             have to do something!\n\nEVAN impatiently yells out the window of his TRANS AM.\n\n\n<b>                       EVAN\n</b>              Arrest this whack-job, wouldja?\n              Some of us have lives, y'know.\n\nKimberly looks to Shaina for support, but even Shaina can't meet her\neyes.\n\n\n<b>                      KIMBERLY\n</b>             Why won't anyone listen to me?\n\nThomas, subtly reaching for his cuffs.\n\n\n<b>                      THOMAS\n</b>             I'm not going to tell you to calm\n             down again --\n\nA SERIES OF CRASHES AND EXPLOSIONS ARE HEARD. In the distance. It's\nneverending. Horrific. Kimberly's face crumbles. She screams in\nhorror and collapses against the SUV.\n\nThomas runs to his patrol car.\n<b>\n</b>The White Delivery Van makes a J- turn out of the line of cars and\nSPEEDS down the onramp in reverse, Isabella screaming angrily into\nher cell phone.\n\n\n<b>                       ISABELLA\n</b>              You couldn't keep your dick in\n              check for a month?!\n\nThe other drivers exit their cars, craning their necks to see what's\nhappened up ahead. Kat takes a deep drag off her smoke.\n\n\n<b>                       KAT\n</b>              Great, now I'm really gonna be\n              late.\n\nThomas barks into the radio handset --\n\n\n<b>                       THOMAS\n</b>              L.A. 51, I need assistance and\n              requesting paramedics for a major\n              T.A. At --\n\n<b>INSIDE THE SUV\n</b>\nFrankie watches the traffic start to back up as a couple of passing\ncars BRAKE HARD. Shaina anxiously watches Kimberly pacing behind the\n<b>SUV.\n</b>\n\n<b>                          SHAINA\n</b>                 Kimberly, what's going on?\n\nKimberly moves toward Shaina's window. As she leans her head into\nShaina's window, an ominous BREEZE blows back their hair and we hear\nthe BLARING HORN of a TRUCK.\n\nAnd Kimberly is unexpectedly yanked backward by Thomas!\n\nFrom nowhere, a SHRIEK of BRAKES as a JACK-KNIFED TRUCK plow s the SUV\nacross the frame! CRASH! Flying debris misses Kimberly and Thomas by\ninches!\n\nKimberly cries in horror into Thomas' shoulder as her friends burn up\nin the wreckage.\n\n<b>EXT. POLICE STATION - ESTABLISHING SHOT\n</b>\n<b>INT. POLICE STATION - CONTINUOUS\n</b>\nCHAOS. Evan, the driver of the Trans Am, impatiently speaks to\nDETECTIVE SUBY, late 40s, professional with an open face that makes\nhim a great listener.\n<b>\n</b><b>                      EVAN\n</b>             I don't know what you want from me.\n             Some crazy chic k blocks the highway\n             with her car, said there'd be an\n             accident and there was. Big deal.\n             Even a broken watch is right twice\n             a day...\n\nOfficer Thomas Burke passes by, heading into --\n\n<b>INT. A ROOM - CONTINUOUS\n</b>\nKat, Eugene, Nora, Tim, and Rory sit in a large room, waiting to give\nstatements. Unlike Evan, these witnesses are clearly distraught.\n\n\n<b>                      KAT\n</b>             Not to sound insensitive, but how\n             much longer is this going to take?\n\n<b>                      EUGENE\n</b>             If I don't get back to my classroom\n             soon, the kids'll tear the room\n             apart.\n\n<b>                      NORA\n</b>             Those poor people. To think it\n             would've been us if not for...\n\nPAN OVER TO REVEAL KIMBERLY. She's still in shock, her mind far away.\nThomas sits close to her, speaking softly.\n\n\n<b>                      THOMAS\n</b>             Tell me again how it started.\n\n<b>                      KIMBERLY\n</b>             Like I said, it was like I was\n             there. I remember everything. The\n             sounds of the crashes, the smells,\n             the look on Shaina's face...\n\n<b>                      THOMAS\n</b>             Do you remember what triggered it\n             all?\n\n<b>                      KIMBERLY\n</b>             The log truck...and everybody I\n             guess. Everyone was driving like a\n             maniac. And somehow I knew\n             something horrible was going to\n             happen, even before it did.\n\nSomething clicks for Thomas, but he forces himself to speak calmly,\nlike a lawyer leading a friendly witness.\n\n\n<b>                      THOMAS\n</b>             You knew? You just mean a hunch,\n             right? A bad vibe, maybe?\n<b>\n</b>The other drivers stare at Kimberly.\n\n\n<b>                       KIMBERLY\n</b>              More than that. All the songs on\n              the radio were about car crashes.\n              Some kid's banging toy cars\n              together.\n                  (lookin g at her)\n              She was dialing her cell phone with\n              her headset on.\n                  (points to Rory)\n              His car was leaking oil all over\n              the road.\n\n<b>                       RORY\n</b>              Hey, don't be knockin' the\n              Chevette.\n\nBut the others listen intently now. Especially Kat, who spies her\nheadset buried deep in her purse.\n\n\n<b>                       KIMBERLY\n</b>              Billboards about accidents. Kids\n              yelling \"pile up\" for no reason.\n              It all felt...just wrong.\n              Just like...\n                  (swallows; hesitates)\n\n<b>                       THOMAS\n</b>              Like what?\n\nKimberly sighs and looks down. The room becomes eerily silent, except\nfor the FLICKER of a florescent light.\n\n\n<b>                       KIMBERLY\n</b>              I know this sounds crazy...but you\n              all heard about Flight 180, right?\n              The kid who got off the plane?\n\nThomas' eyes widen -- then a startling CRASH as Rory, le aning back in\nhis chair, tips over. Thomas rolls his eyes as Rory grins sheepishly\nand picks himself up.\n\n\n<b>                       THOMAS\n</b>              You mean Alex Browning.\n\n<b>                       KIMBERLY\n</b>                  (looking down)\n              ...My Premonition was just like\n              his.\n\n<b>                       NORA\n</b>              What are you talking about?\n\n<b>                       EUGENE\n</b>                  (sarcastic)\n<b>\n</b>              Oh, you must have read about that\n              kid who had a dream about a plane\n              crash so he got his buddies off the\n              plane? Then the thing blew up just\n              like in the dream?\n\n<b>                         NORA\n</b>              Maybe...\n\nEugene sees Nora and Tim are hooked and speaks in scary campfire\ntones.\n\n\n<b>                       EUGENE\n</b>              But this is where it starts to get\n              freaky. So a month goes by,\n              everything seems cool, but then the\n              survivors start dying one boy one.\n              'Cause when your number's up, it's\n              up, right? Some people said Death\n              itself started coming for them,\n              hunting down every last one, until\n              they were all dead.\n\nEveryone tenses up.\n\n\n<b>                       THOMAS\n</b>              Well, not quite all of them. Clear\n              Rivers checked herself into a\n              padded room at Stoneybrook.\n\nKimberly, affected, looks to Thomas for confirmation.\n\n\n<b>                       KIMBERLY\n</b>              You do believe me, don't you?\n\nBANG! Everyone jumps as Detective Suby pounds on the door and opens\nit.\n\n\n<b>                       DETECTIVE SUBY\n</b>              Officer Burke? Could I see you in\n              here?\n\n<b>INT. OBSERVATION ROOM - CONTINUOUS\n</b>\nThe DOOR OPENS. Detective Suby enters, leading Thomas. Through a two -\nway mirror, they can see the others chatting anxiously.\n\n\n<b>                       DETECTIVE SUBY\n</b>              Tell me you didn't start up on that\n              Flight 180 shit again.\n                  (beat)\n              Did you?\n\n<b>                         THOMAS\n</b><b>\n</b>              Of course not. That would be\n              irresponsible and unprofessional.\n\nDetective Suby's persistent glare makes Thomas uncomfortable.\n\n\n<b>                       THOMAS\n</b>              Look, you weren't there. It was\n              weird. She knew that log truck was\n              gonna cause an accident, she knew.\n                  (beat)\n              Never mind.\n\n<b>                       DETECTIVE SUBY\n</b>              I thought we we re finished with\n              this bullshit. This is police\n              work, not the psychic Hot Line.\n\nBut Thomas isn't listening. He's glued to Kimberly's words. When\nDetective Suby realizes this, he stops and listens.\n\n\n<b>                       KIMBER LY\n</b>              But if I was never meant to pull\n              over, then we all should have died\n              in the pile up.\n\n<b>                       TIM\n</b>              Which means Death could be coming\n              for us.\n\nDetective Suby looks pissed o ff.\n\n\n<b>                       DETECTIVE SUBY\n</b>              Way to console the witnesses Burke.\n\nAt the same time, we watch Evan enter the other room, grab his jacket\nand wave goodbye to the others.\n\n\n<b>                       DETECTIVE SUBY\n</b>              You got 'em thinking Death is after\n              them? Shit, they're the luckiest\n              sons o' bitches on the planet. Get\n              this guy Evan Shaeffer; Yesterday\n              the kid wins the lotto and today\n              some looney bitch b locks traffic\n              and he avoids the worst pile up in\n              years. I should be so damn\n              unlucky.\n\n<b>INT. A ROOM - CONTINUOUS\n</b>\nKimberly, Nora, Tim, Kat, Eugene and Rory now seem affected by what\nthey've heard.\n\n\n<b>                       KAT\n</b><b>\n</b>               What if it's true? What if it's\n               happening all over again?\n\nThe fluorescent light above FLICKERS ominously. Nora, disturbed,\nstands up in a huff, grabbing Tim's arm.\n\n\n<b>                        NORA\n</b>               You're all certifiable, you know\n               that? I can't believe I've been\n               listening to this crap. Come on,\n               Tim, let's go outside.\n\n<b>                        TIM\n</b>               Jeez, Mom, stop trippin'.\n\n<b>                        EUGENE\n</b>               Look lady, we're just yankin' your\n               chain.\n\n<b>                        RORY\n</b>               Yeah, you're acting like we all\n               just got the Diff'rent Strokes\n               curse or something.\n\nEugene and Rory burst out laughin g. Nora shakes her head, disgusted.\n\n\n<b>                        NORA\n</b>               What's wrong with you people?\n\nNora pulls a reluctant Tim out of the room. As she opens the door,\nthe others watch Detective Suby and Thomas appear from nowhere to\ncalm her down . When the door swings shut, an awkward silence.\nSuddenly, the door opens again and Thomas leads Mr. Burroughs inside.\nMr. Burroughs sees Kimberly and chokes back tears.\n\n\n<b>                        MR. BURROUGHS\n</b>               Kimberly...\n\nThe sight of her fath er crying is enough to make Kimberly's own dam\nburst. She rushes over to him and buries her head in his chest,\nsobbing.\n\n\n<b>                        MR. BURROUGHS\n</b>               Can I take her home?\n\nThomas nods.\n\n\n<b>                        DETECTIVE SUBY\n</b>               Sure, you can all go.\n\nBy now, the fluorescent light flickers out of control. When Rory, Kat\nand Eugene stand up, Thomas looks helpless.\n<b>\n</b><b>                      KAT\n</b>             First I'm stuck with Jury Duty, now\n             this nonsense.\n\n<b>                      RORY\n</b>             Yeah, I hate to love and leave ya,\n             but I've been over this X-Files\n             shit since the sixth season.\n\nAs Thomas watches them file out, the fluorescent light POPS. Then\n<b>DARKNESS.\n</b>\n<b>INT. KITCHEN - DAY\n</b>\nKimberly sits at the table. Mr. Burroughs sets down a cup of tea\nbefore her. Both are shaken.\n\n\n<b>                      KIMBERLY\n</b>             I know it's crazy, but I'm really\n             scared for the others. I've got\n             this terrible feeling.\n\n<b>                      MR. BURROUGHS\n</b>             What feeling?\n\n<b>                      KIMBERLY\n</b>             That it's not over yet.\n\nShe picks up the tea, it clatters in her trembling hands.\n\n\n<b>                       MR. BURROUGHS\n</b>             Don 't worry. Everything will be\n             fine, you'll see.\n\n<b>INT. EVAN'S STAIRWELL - DAY\n</b>\nA dingy singly light bulb illuminates the narrow stairwell. Evan\nappears in the darkness, carrying a brand new television with some\npackages on top. He's unable to s ee the long rickety stairwell he\nclimbs.\n\nThe stairs are littered with Chinese take out MENUS and a TONKA TRUCK\napparently left by some kids.\n\nAs Evan slowly climbs the staircase, a FAT MAN comes down, forcing\nEvan to lean against -\n\nTHE RAILING - which CREAKS and BENDS. After the FAT MAN passes, Evan\nslowly continues up again, TEARING HIS SHIRT on a nail.\n\n\n<b>                      EVAN\n</b>             Motherfucker.\n<b>\n</b>A HEATING DUCT CLICKS ON. The air blows a TONKA TRUCK slowly toward\nthe center of the staircase, directly in Evan's path - but Evan just\nmisses it!\n\nHe continues past MORE TOYS, nearing the top stair -\n\nThe Airduct coughs, sending menus fluttering toward Evan's feet and\nhe slips on them! He juggles the TV - but ultimately rights himself\nand continues down the hallway.\n\n<b>INT. EVAN'S APARTMENT - CONTINUOUS\n</b>\nDim, cheap, probably roach-infested. As Evan enters, the small\npackages fall off the TV box and onto the floor.\n\nEvan places the TV by the door, looks at his torn shirt, but fuck it,\nwho cares; he's on a natural high. He peels his shirt off, revealing\nhis PIERCED NIPPLES, flicks on the radio and DANCES his way over to\nthe fridge and grabs a drink.\n\nIn the tiny kitchenette area, a small swarm of flies hovers over a\ngrease-filled frying pan.\n\nEvan recoils, throws open the window and throws the grease to the\nsidewalk five stories below. An ominous BREEZE enters --\n\nAnd a kitchen cabinet slowly BLOWS OPEN. Some FORKS and KNIVES slide\nforward on poorly stacked plates. Daring to fall into the toaster.\n\nEvan spills some cooking oil on the range while pouring it into the\nfrying pan, then dumps in some frozen mozzarella sticks. Evan puts\nthe frying pan on the stove and turns it on HIGH.\n\nHe then grabs a container of CHINESE FOOD and rests it on the counter\nnext to the fridge. On the fridge, several colorful MAGNETS spell out\n<b>HEY E.\n</b>\nPUSH IN on the H - which mysteriously drops into the Chinese food -\nthe word EY E remaining. Oblivious, Evan puts the food in the\nmicrowave and turns it on.\n\n<b>ANGLE ON STOVE\n</b>\nThe cooki ng oil creeps toward the range... Evan hits PLAY on his\nanswering machine and rushes across the room to tear open his\npackages...\n\n\n<b>                       VOICE (O.S.)\n</b>              Dude! You suck! You buy one\n              fucking ticket in your whole life\n              and win twenty grand? We're going\n              whoring in Prague, you know this!\n                     (whisper)\n              Hold on, the boss is coming.\n\nA CLICK, then hold MUZAK: AC/DC's HIGHWAY TO HELL.\n<b>\n</b>ANGLE ON MAGNET in Chinese fo od. SPARKING. It pops and fizzles. And\nugly sound.\n\nAs many similar messages continue, Evan unwraps a new ROLEX! He\nslides it over his wrist, admiring it.\n\n<b>ANGLE ON KNIFE\n</b>\nLazily sliding off the shelf and into the toaster, protruding about\nan inch and a half. Hardly noticeable.\n\nBy now, Evan has opened the next package; a gaudy gold and diamond\nencrusted horseshoe ring.\n\nHe carries the ring into the kitchenette, sees the Chinese food is\nFLAMING, and his hands flash out to turn it off -- A SMALL EXPLOSION\nfrom the microwave startles him.\n\nThe RING falls into his drain/garbage disposal!\n\n\n<b>                         EVAN\n</b>              Damn it!\n\nEvan reaches INTO THE DRAIN, his fingers searching for the ring. When\nhe tries to pull his hand back out, the ROLEX CATCHES.\n\nAnother small EXPLOSION from the microwave, this one cracking the\nGLASS. A Solo Plastic Cup nearby begins to melt.\n\nFlames sputter around the rim of the frying pan. In moments, the oil\nfrom the pan IGNITES. A small fire.\n\nEvan sees all this and YANKS with all his might. No use. As the FIRE\nslowly spreads to nearby cereal boxes, Evan starts to panic. He\ncontinues yanking... Stuck.\n\nHe sees a bottle of PALMOLIVE on the other end of the counter. His\nfingers reach for it.\n\nSlightly out of his grasp. But his fingertips are just long enough to\nknock the bottle backwards - where it rests against TWO SWITCHES.\n\nThe FIRE ALARM goes off. The PHONE RINGS.\n\nEvan desperately lifts his leg and tries to use his foot to edge the\nPalmolive over. By pushing the bottle up against the wall, it\nthreatens to turn on one of the switches.\n\n<b>ANGLE ON FINGERS\n</b>\nIn the GARBAGE DISPOSAL. A SWITCH is flipped - but the light goes on.\nAnd the Palmolive lazily falls, resting on the remaining switch.\n\n\n<b>                         EVAN\n</b><b>\n</b>              Come on, come on...\n\nEvan makes one last push with his foot - accidently flipping the\nSWITCH - the GARBAGE DISPOSAL GRINDS METAL!\n\nEvan, horrified, miraculously yanks his hand free, brushing against\nthe knife in the toaster.\n\nWhen the SHOCK goes through Evan's body, his other hand jerks out,\nknocking the flaming frying pan to the floor.\n\nThe entire kitchen is in flames, including the new TV blocking the\ndoor. The window slams SHUT! The room fills with smoke.\n\n\n<b>                       EVAN\n</b>              Jesus Christ!\n\nEvan grabs a fire extinguisher. A mere dribble of foam comes out. He\nbegins COUGHING in the smoke.\n\nEvan tries the window - STUCK! He has no choice but to smash the\nkitchenette window with the fire extinguisher to get to the fire\nescape.\n\nHe dr ops the fire extinguisher, starts to climb out the window, hears\na creak and looks up just as --\n\nA large jagged shard of glass comes CRASHING down at him -- Evan\njumps back just in time as it shatters before him. The fire\ncompletely engulfs the kitchen.\n\nHe bravely jumps through the window pane, landing on the fire escape.\nHe runs down the fire escape from floor to floor.\n\nA LARGE BLAST from his window showers him with glass and brick\nshrapnel, but ultimately, he makes it to the fire escape's lowest\nlevel, intact.\n\nHe tries to lower the rusty metal ladder to the ground. It budges\nonce, then twice, but won't go down. So he climbs over the railing\nand gently drops to the ground.\n\nSafe and sound, he breathes a sigh of relief and turns to walk --\n\nSUDDENLY he s lips on the very grease he threw out the window, his\nlegs shoot out from under him and he lands on his back.\n\nThe rusty ladder suddenly dislodges and hurls downward -- coming\nright for Evan's face -- but stops halfway!\n\nAs Evan laughs, breathing a final sigh of relief, it suddenly\nPLUMMETS again -- impaling Evan through his eye socket!\n\n<b>INT. POLICE STATION - COMPUTER ROOM - NIGHT\n</b><b>\n</b>Thomas sits at the computer terminal. He checks to make sure no one's\nwatching as he enters a SEARCH for Alex Browning.\n\nTen websites come up, all devoted to the Flight 180 Curse. Thomas\nscrolls around, seeing the death pix and autopsy photos of Flight 180\n\"survivors\".\n\nHeadlines blare, \"Freak Accident?\" \"Bizarre Coincidence?\" describing\nthe way the victims died. As Thomas begins a localized search of the\nword, \"PREMONITION\" --\n\nSPOOKY HUMMING from behind him.\n\nThomas whirls around to see Det. Suby looking over his shoulder,\nhumming the music from an old monster movie. Suby presses one hand to\nhis forehead, the other polishing an apple against his vest.\n\n\n<b>                      DETECTIVE SUBY\n</b>                    (as if entranced)\n             Ooooh, I see it now. Your\n             future... A transfer to another\n             department.\n\nSuby bites the apple, casually offering nothing more. Thomas,\nembarrassed, flicks off the computer, stands.\n\n\n<b>                       THOMAS\n</b>              You've made your point.\n\n<b>                      DETECTIVE SUBY\n</b>             Good. Cause we just got some new\n             info and I don't ne ed you getting\n             freaky on me.\n\n<b>                      THOMAS\n</b>             What?\n\n<b>                      DETECTIVE SUBY\n</b>             Evan Shaeffer's dead. Guess he\n             wasn't as lucky as we thought.\n\nDetective Suby shrugs and walks away, munching the apple. Thomas\nlooks stunned.\n\n<b>INT. KAT'S ROOM - NIGHT\n</b>\nKat cradles a phone to her shoulder. She watches television and\ncrushes Oreos into a bowl of ice- cream.\n\n\n<b>                      KAT\n</b>             No, Mom. Just turn on any station,\n             they've been playing it all day.\n                    (beat; rolls her eyes)\n             Yes, Mother. Channel four will do\n             just fine. Here it is, gotta go.\n<b>\n</b>She hangs up the phone, mesmerized by the report:\n\nFOOTAGE FROM A HELICOPTER shows the pile up wreckage.\n\n\n<b>                      ANCHOR MAN (V.O.)\n</b>             Route 18 was backed up for almost\n             nine hours today when a record\n             breaking pile up...\n\n<b>INT. NORA'S LIVING ROOM - CONTINUOUS\n</b>\nNora and Tim watch the same report.\n\n\n<b>                      ANCHOR MAN (V.O.)\n</b>             ...killed An estimated 18 people.\n             Emergency crews spent hours sifting\n             through the wreckage.\n\n<b>INT. EUGENE'S LIVING ROOM - CONTINUOUS\n</b>\nEugene looks up from grading midterm bluebooks to watch.\n\n\n<b>                      ANCHOR MAN (V.O.)\n</b>             ...hoping To recover any survivors\n             from this tragic collision. So\n             far, the police are refusing to\n             release the names of the victims\n             until their families are notified.\n\n<b>INT. KIMBERLY'S HOUSE - CONTINUOUS\n</b>\nMr. Burroughs numbly watches the same report. He doesn't see Kimberly\nenter behind him from the kitchen.\n\n\n<b>                      ANCHOR WOMAN (O.S.)\n</b>             The camera of a highway patrol car\n             managed to catch this shocking\n             footage --\n\nB/W CAMERA FOOTAGE from Thomas' car shows Thomas tackling Kimberly to\nthe ground just as a jack -knifed truck plows into the SUV.\n\n\n<b>                       MR. BURROUGHS\n</b>              My Lord...\n\nA GASP from behind him. Mr. Burroughs spins to see Kimberly fighting\nback tears and picks up the remote, prepared to click of the TV --\nbut she stops him.\n\n\n<b>                        KIMBERLY\n</b>              Don't.   I have to see this.\n<b>\n</b>Mr. Burroughs reluctantly keeps the newscast on.\n\n<b>INT. RORY'S APARTMENT - CONTINUOUS\n</b>\nIt's a party. Rory, surrounded by BUDDIES, shakes a triumphant fist\nat the television. HE WHOOPS with delight, spilling popcorn\neverywhere.\n\n\n<b>                     RORY\n</b>             Whoohoo! You see that shit? Right\n             there? That's my fuckin' car right\n             there! Oh God, that's dope.\n\nAfter high-fiving his peeps, he bends to table level and snorts a\nfreshly chopped line.\n\n\n<b>                      ANCHOR MAN (O.S.)\n</b>             In other news, a freak accident\n             took the life of a lotto winner.\n\nRory looks up to see the DMV photo of Evan. As he takes in the\nreport, his mood radically shifts. He looks like he's been hit by a\ntrain.\n\n<b>MONTAGE\n</b>\nOf Kimberly, Nora, Tim, Eugene and Kat watching. They all take the\nnews very hard as the FOOTAGE shows Evan's BODY being carried away by\nEMT workers. Eugene, however, shakes his head sadly but goes back to\ngrading blue books.\n\n<b>TIM'S BEDROOM - LATER\n</b>\nTim's eyes are glued to the latest Stephen King novel. Nora peers in.\n\n\n<b>                      NORA\n</b>             Come on, Tim, lights out already.\n\nTim starts at her voice, then reluctantly puts down the book.\n\n\n<b>                        TIM\n</b>             Mom?\n\n<b>                        NORA\n</b>             Yeah?\n\n<b>                      TIM\n</b>             You think... You think those guys\n             were b.s.-ing us today or what?\n\nNora swallows, trying to seem brave.\n<b>\n</b><b>                      NORA\n</b>             Oh, please. Some people just need\n             some serious rewiring, that's all.\n\nBut neither of them are convinced.\n\n\n<b>                      NORA\n</b>             Get some sleep.\n\nNora kisses his forehead and leaves the room. After she leaves, Tim\nopens his nightstand drawer, pulls out a dusty nightlight and plugs\nit in.\n\n<b>INT. NORA'S BEDROOM - MOMENTS LATER\n</b>\nNora closes her bedroom door. And locks it. She nervously checks the\ncloset and even lowers the blinds. Finally, she takes out a business\ncard and dials a number. She hangs up, then dials again.\n\n\n<b>                       NORA\n</b>              Officer Burke, please?\n\n<b>INT. KIMBERLY'S ROOM - CONTINUOUS\n</b>\nMr. Burroughs tucks a still-shaken Kimberly into bed. In one of his\nhands is a nearly empty glass of scotch.\n\n\n<b>                      KIMBERLY\n</b>             It's okay, Dad. I'm not ten\n             anymore.\n\nMr. Burroughs catches himself being overprotective.\n\n\n<b>                      MR. BURROUGHS\n</b>             I'm sorry. I'm just so happy that\n             you're safe.\n\n<b>                       KIMBERLY\n</b>              I love you too, Dad.     Goodnight.\n\nBut Mr. Burroughs isn't ready to leave. He finishes his drink.\n\n\n<b>                      MR. BURROUGHS\n</b>             You know, after your mother died...\n\nKimberly tenses, bracing for the worst.\n\n\n<b>                      MR. BURROUGHS\n</b>             There were so many times I didn't\n             think I could last another day. I\n             can't even tell you some of the\n<b>\n</b>               things I th ought about.\n\n<b>                        KIMBERLY\n</b>               I used to have those feelings, too.\n               But that's when I'd think of Mom.\n               Her strength...and courage. And\n               I'd pray that maybe I'd grow up to\n               be as brave as she was. And the\n               bad thoughts would go away.\n\n<b>                        MR. BURROUGHS\n</b>                      (choking up)\n               I don't know what I'd do if I lost\n               you.\n\nMr. Burroughs leans over, kisses her forehead and leaves. Just as\nhe's out the door, he braces at the distant sound of a CAR SKIDDING\nout of control. The ENDLESS SCREECH is nerve shattering. Mr.\nBurroughs stands frozen, tensing for the inevitable crunch. But there\nis none. And he leaves.\n\n<b>DISSOLVE TO:\n</b>\n<b>INT. KIMBERLY'S ROOM - NIGHT\n</b>\nThe room is dark except for one burning candle. Kimberly tosses and\nturns. The wind sends a single branch scraping against her window. A\nporch swing SQUEAKS back and forth. Adding to her anxiety.\n\nA BREEZE ENTERS, sputtering out the candle. Kimberly sits upright in\nbed and sees the WINDOW IS SHUT. Huh? She lights a match and sees the\ncandle wax dripped onto her table, forming the gooey shape of\na...180? The match goes out in her hand. The room is dark again.\n\nHeadlights fr om passing cars cast eerie shadows on her ceiling.\nShadows resembling PLANES seem to transform into a SKULL.\n\nKimberly, freaked out, looks around to see the blinking light from\nthe VCR: it flashes 18:0 a few times, then 12:00.\n\nShe can't take it anymore. She yanks the VCR cord from the wall and\nflicks on the lights, ridding the room of shadows. And anxiously\nturns on her computer.\n\n<b>EXT. STONEYBROOK HOSPITAL - DAY\n</b>\nKimberly drives a beat up Hyundai through an eerie morning mist that\nsurrounds the grounds of the Stoneybrook Hospital.\n\n<b>ANGLE ON\n</b>\nA computer printout in the shotgun seat: MAPQUEST directions to\n\"Stoneybrook Hospital\".\n\nAs Kimberly drives through the gate, the mist almost seems to follow\nher inside.\n<b>\n</b>A SIGN offers a choice between \"Emergency/Medica l Care\" or\n\"Psychiatric Treatment Center.\" Kimberly drives to the mental ward.\n\n<b>INT. MENTAL WARD - DAY\n</b>\nA PHYSICIAN in a lab coat leads a nervous Kimberly down the center of\na long corridor. The Physician consults a clipboard.\n\n\n<b>                      PHYSICIAN\n</b>             ...at the request of the patient,\n             you are to relinquish any sharp\n             objects such as nail files,\n             pencils, pens, safety pins, bobby\n             pins, no matches, lighters, belts,\n             belt buckles, earrings, chokers,\n             shoelaces...\n\nKimberly watches carefully as the Physician comes to a door and\npunches \"4514\" into the electronic lock. They continue down another\ncorridor.\n\nLights flicker,patients cackle and moan in the B.G.\n\n\n<b>                      PHYSICIAN\n</b>             ...paper clips, watches, food,\n             drinks, keys, poisons, pills and\n             medications.\n                    (looks at Kimberly)\n             You have a cell phone on you?\n\nKimberly nods, hands it over.\n\n\n<b>                       PHYSICIAN\n</b>              Then I think we're all done.\n\nThey arrive at a door to a padded room. The Physician punches in\nanother code.\n\n\n<b>                      KIMBERLY\n</b>             Wait. Is she...dangerous or\n             something?\n\n<b>                      PHYSICIAN\n</b>             No honey, but she expects you are.\n\n<b>                      KIMBERLY\n</b>             Jesus, how long are you going to\n             keep her locked up this way?\n\n<b>                      PHYSICIAN\n</b>             Depends on her, I guess.   She's\n             voluntary.\n\nThe door hisses open.\n<b>\n</b><b>INT. CLEAR'S PADDED ROOM - CONTINUOUS\n</b>\n<b>REVEAL CLEAR RIVERS\n</b>\nWhile still beautiful, this young woman bears few traces of her\nformer self. Her eyes dart around suspiciously, maddened by chronic\nparanoia. Her hair is patchy, her eyes dark and haunted. Bordering on\nsavage. Her movements are fidgety, erratic, always distracted by\nsomething unseen.\n\n\n<b>                      KIMBERLY\n</b>             Clear Rivers?\n\nClear looks Kimberly up and down and steps back, allowing her inside\nher inner sanctum. A mattress on the floor, a plastic bottle of\nwater, some paperbacks and a bedpan.\n\nKimberly's jaw drops when she sees the far wall: a SHRINE to flight\n180. The wall is papered with art icles about all the survivors (as\nseen in the opening title montage).\n\nThe door SLAMS. Kimberly jumps.\n\n\n<b>                      CLEAR\n</b>             Kimberly Burroughs, eh?    What do\n             you want?\n\n<b>                      KIMBERLY\n</b>             I thought...I thought you might be\n             able to help me.\n\n<b>                      CLEAR\n</b>                    (snicker)\n             Yeah, how?\n\n<b>                      KIMBERLY\n</b>             I had a premonition about the Route\n             18 pile up. .. I saved some people.\n             And now I think Death is after me.\n\n<b>                      CLEAR\n</b>             Nice work. Maybe if you're real\n             lucky, you'll wind up in here with\n             me.\n                    (gives Kimberly the once\n                         over)\n             But I doubt you'll survive that\n             long.\n\nKimberly flinches.\n\n\n<b>                      KIMBERLY\n</b>             It's not just about me. Someone I\n             saved died last night in a freak\n             accident. What if the others are\n             in danger, too?\n<b>\n</b><b>                      CLEAR\n</b>             Well, if you put them on the list,\n             they're already tits up.\n\n<b>                      KIMBERLY\n</b>             What list?\n\n<b>                       CLEAR\n</b>              Death's list. The precise order\n              you're going to die in.\n\nClear's eyes bore into a terrified Kimberly's.\n\n\n<b>                      CLEAR\n</b>             The survivors of Flight 180 died in\n             the exact order they were\n             originally meant to die in the\n             plane crash. That was Death's\n             original design.\n\n<b>                      KIMBERLY\n</b>                    (sudden realization)\n             Exact order? Then I'm next! I was\n             meant to die with my friends, so\n             I'm next!\n\nClear backs away from Kimberly as if she were lethal, then stops\nshort.\n\n\n<b>                      CLEAR\n</b>             But you said someone else died last\n             night. That means Death skipped\n             past you. Someone must have\n             intervened.\n                    (off Kimberly's confusion)\n             Sometime yesterday you must have\n             nearly died, but someone saved you.\n\nKimberly nods, recalling the events.\n\n\n<b>                      KIMBERLY\n</b>             Officer Burke pulled me away from\n             the crash that killed my friends.\n\n<b>                      CLEAR\n</b>             Congratufuckinglations. That makes\n             you last to go. But don't worry,\n             once the others are dead, it'll\n             come back for you. Always does.\n\n<b>                      KIMBERLY\n</b>             That still doesn't make sense. You\n             said you die in the same order you\n             were originally meant to. But Evan\n             Shaeffer died last in my\n             premonition, not first.\n<b>\n</b>Clear seems very disturbed by that.\n\n\n<b>                        CLEAR\n</b>               It's moving backwards?    Are you\n               sure?\n\nKimberly reluctantly strains to remember something...\n\n<b>HARD CUT TO:\n</b>\n<b>THE FINAL MOMENTS OF THE PILE UP\n</b>\nNora's Pacer folds like an accordion, then EXPLODES, followed by Evan\nscreaming in the Trans Am, which gets CREAMED by the semi!\n\n<b>BACK TO:\n</b>\nKimberly, shaken, does the math.\n\n\n<b>                        KIMBERLY\n</b>               Yes. In my premonition that Nora\n               woman and her kid died first, then\n               Evan and then...my friends.\n\nClear is oblivious when Kimberly breaks into silent sobs.\n\n\n<b>                        CLEAR\n</b>               Backwards...that's new.\n\nClear sees Kimberly crying and softens.\n\n\n<b>                        CLEAR\n</b>               That's good. Get all your tears\n               out now, you'll need your eyes.\n                      (off Kimberly's confusion)\n               For the signs.\n\n<b>                        KIMBERLY\n</b>               Signs?\n\n<b>                        CLEAR\n</b>               If you have the same power as Alex,\n               you'll be seeing signs soon. When\n               you see anything creepy or ominous,\n               an in-your- face irony kinda thing?\n               Don't ignore it. It usually means\n               the difference between life and\n               death.\n\n<b>                        KIMBERLY\n</b>                      (to herself)\n               The songs on the radio.\n                      (to Clear)\n               But wait. I don't understand.       Why\n               is this even happening to me?\n<b>\n</b><b>                      CLEAR\n</b>             That's what Alex used to ask\n             himself right up until...\n\nFor an instant, we see a gentle side of Clear.\n\n\n<b>                      KIMBERLY\n</b>             It's obvious you know what you're\n             talking about. You beat it. You\n             have to help us.\n\nClear suddenly toughens up, an abrupt mood shift.\n\n\n<b>                      CLEAR\n</b>             I didn't beat it; I hid from it.\n             If you were smart you'd put a down\n             payment on a burial plot and say\n             goodbye to the dog, because what\n             little life you have left is over\n             as you know it. Don't make new\n             friends, don't fall in love, and\n             don't ever bother trying to save\n             others. That's the worst killer of\n             them all.\n\n<b>                      KIMBERLY\n</b>             How can you say that?    What kind of\n             monster are you?\n\nAt once, Clear, enraged, is in her face, speaking through clenched\nteeth.\n\n\n<b>                       CLEAR\n</b>              My family is dead.   My friends are\n              dead. And Alex...\n\nClear angrily peels a Polaroid off the wall and shows it to Kimberly.\nWhile we don't see the photo, Kimberly's horrified face paints a\ngruesome picture on its own.\n\n\n<b>                      CLEAR\n</b>             And yes, that's the blade of a\n             fucking ceiling fan in his head.\n\nClear pounds on the door, apparently done with Kimberly. A GUARD\nopens the door. Kimberly, devastated, turns to leave, then summons\nher courage and turns back to Clear.\n\n\n<b>                      KIMBERLY\n</b>             Know what? I think you're a\n             coward. I think you hide out in\n             here because you're too damn bitter\n             and selfish to care about another\n<b>\n</b>              living soul. In my opinion, you're\n              already dead.\n\nKimberly leaves, giving Clear something to think about.\n\n<b>EXT. KIMBERLY'S HOUSE - DAY\n</b>\nAs Kimberly pulls into her driveway, she's surprised to see a STRANGE\nCAR parked there. Then --\n\nTHOMAS, wearing street clothes, peers through the front window of the\nhouse. He guiltily backs away as Kimberly gets out.\n\n\n<b>                       THOMAS\n</b>              I tried calling last night but your\n              father --\n\n<b>                       KIMBERLY\n</b>              Evan Shaeffer's dead.\n\nThoma s nods and leans against the large glass windows that reflect\nthe sky behind them.\n\n\n<b>                       THOMAS\n</b>              I know. I've gotten calls all\n              morning from everyone who was on\n              the onramp. We're all meeting at\n              my apartment tonight.\n\n<b>                       KIMBERLY\n</b>              Then you believe all this?? That\n              Death is working off a list?\n\nThomas hesitates before answering.\n\n\n<b>                       THOMAS\n</b>              I didn't. Until I was dispatched\n              to clean up one of the Flight 180\n              survivors.\n\n<b>                       KIMBERLY\n</b>              Clean up? I don't...\n\nSuddenly through the reflection of the window glass, Kimberly sees\nhundreds of pigeons dive bomb her at once!\n\nLike a scene out of THE BIRDS, Kimberly must duck and cover as the\npigeons assault her from every angle.\n\nBut when Kimberly turns away from the reflection, toward the actual\npigeons, THEY'RE GONE. ALL IN HER HEAD.\n\n\n<b>                       KI MBERLY\n</b>              Did you see that??\n<b>\n</b>Thomas, concerned for her, saw nothing.\n\n\n<b>                       KIMBERLY\n</b>              Pigeons... It's a sign! If Clear's\n              right about the order, then Nora\n              and Tim are going to be attacke d by\n              Pigeons!\n\n<b>                       THOMAS\n</b>              I'm not following you --\n\n<b>                       KIMBERLY\n</b>              They're next on the list.   We have\n              to find them.\n\n\n<b>EXT. MEDICAL COMPLEX - DAY\n</b>\n<b>ANGLE ON\n</b>\nWoman's N ike shoe on a down-moving escalator. Reveal Nora taking her\nson Tim to a dentist's office. The SHOELACE snags on a bolt of one of\nthe steel side panels, untying it...\n\n<b>                       TIM\n</b>                     (mischievous smile)\n              You think the tooth fairy's gonna\n              come tonight? I'm thinkin' like\n              fifteen bucks.\n\n<b>                       NORA\n</b>              Nice try, kiddo.\n\nTim smiles, then winces from the pain in his mouth.\n\nTHE DANGLING SHOELACE heads straight for the escalator grate. IT GETS\nSWALLOWED UP. As Tim steps off, Nora TRIPS forward. Her caught\nsneaker is pulled tighter into the innards of the metal staircase.\n\n<b>                       TIM\n</b>              Mom!\n\nTim watches helplessly as Nora reaches down, tug ging at her sneaker,\nfear mounting. Tim also grabs her sneaker and yanks. Finally, the\nshoelace SNAPS, and Nora's free again.\n\n<b>                       TIM\n</b>              You okay?\n\nNora puts on a brave face and begins tying one long shoelace to the\nstubby one.\n\n<b>                       NORA\n</b>              Sure hon. I'm fine.   Let's shake\n              it, we're late.\n\nTim nods. The wind picks up as they continue past a --\n<b>\n</b><b>CONSTRUCTION CREW\n</b>\nWho apply industrial suction cups to large, thick sheets of PLATED\n<b>GLASS .\n</b>\nTim stares in childlike fascination as they pass JACKHAMMERS, a\nCEMENT MIXER, and an EXCAVATOR.\n\n<b>INT. CLEAR'S PADDED ROOM - DAY\n</b>\nClear Rivers applies fun- tack to the back of a newspaper article and\nsticks it on the wall devoted to Flight 180.\n\n<b>REVEAL\n</b>\nA photo of Eva, \"Lotto Winner Killed By Ladder\".\n\nClear backs away, pausing to look at a group photo of the Survivors\nof Flight 180 just before take off. Smiling faces.\n\n<b>                       TIM\n</b>              Not so much.\n\nDr. Lees keeps a skeptical smile to himself.\n\n<b>INT. WAITING ROOM - CONTINUOUS\n</b>\nThe RECEPTIONIST appears next to the fallen fish food with a VACUUM.\nShe plugs it in an outlet below the fishtank.\n\nA startling GRIND as the vacuum turns on and coughs up a nail. She\nvacuums up the fish food around Nora's feet.\n\nThe DEAD FISH gets sucked into the water filter in the fishtank which\nsputters and stops. The water level RISES, spilling water over the\nside of the tank. The water TRICKLES closer to the outlet.\n\n<b>EXT. SUBURBAN STREET - DAY\n</b>\nThomas drives his car into a friendly neighborhood. Kimberly, riding\nshotgun, hangs up her cell phone.\n\n<b>                       KIMBERLY\n</b>              Turn around. The cleaning woman\n              said they're at the dentist's.\n              14th and Main.\n\n<b>                         THOMAS\n</b>              Hold on.\n\nThomas expertly skids into a U-turn.\n\n<b>INT. DENTIST OFFICE - CONTINUOUS\n</b>\nTim looks petrified as Dr. Lees unveils a tray full of PICS, CARVERS\nand EXTRACTING FORCEPS.\n<b>\n</b>The KA-CHUNG of construction outside makes it im possible to\nconcentrate, but, hands trembling slightly, Dr. Lees picks up a pic\nand mirror and starts examining Tim's mouth. CU of PIC gently\nprodding Tim's teeth.\n\n<b>                      DR. LEES (O.S.)\n</b>             I'm a little disappointed, Tim.\n             Does your mom know you've been\n             smoking?\n\nTim groans \"uh-uh\", then suddenly flinches.\n\n<b>                      DR. LEES (O.S.)\n</b>             Yeah, that'll have to be filled.\n\nA BANG from the window startles Dr. Lees. His HAND JERKS, but luckily\nthe pic was removed from Tim's mouth.\n\nDr. Lees whips around in time to see a PIGEON flutter away from the\nwindow.\n\n<b>                     DR. LEES\n</b>             Jesus. Every day at the same damn\n             time. Now this'll only sting for a\n             moment.\n\nDr. Lees picks up a large SYRINGE and moves it toward Tim's open\nmouth.\n\n<b>                       DR. LEES\n</b>              Open big. Wiiiiider...\n\nTim's eyes radiate fear. The MOUTH OPENS. Reluctantly. Tim nervously\neyes the window as the needle enters...\n\n<b>ANGLE ON\n</b>\nNEEDLE heading toward his gumline --\n\nBANG! Another pigeon takes a header into the reflection. Dr. Lees'\nhand jerks, nearly jabbing Tim's tongue. Tim squirms violently. Dr.\nLees looks towards the window angrily.\n\n<b>                      DR. LEES\n</b>             How the hell do they expect me\n             to... Would you rather have the\n             laughing gas?\n\nTim nods his head ferociously.\n\n<b>                         DR. LEES\n</b>             Jean?     I need you in here.\n                       (waits)\n             Jean??!\n\n<b>INT. WAITING ROOM - CONTINUOUS\n</b><b>\n</b>Jean continues vacuuming. The vacuum makes contact with Nora's foot.\n\n<b>INT. DENTIST OFFICE - CONTINUOUS\n</b>\nAfter a minute, Dr. Lees angrily switches on two compressors: Oxygen\nand Nitrous Oxide.\n\nBy now, the NO mask has been attached around Tim's nose. As Tim\ndrifts off, Dr. Lees lowers a DRILL into his mouth.\n\n<b>                       DR. LEES\n</b>              Open big. Wiiiiiider.\n\nExcruciating SOUNDS of the drill going through enamel.\n\n<b>INTERCUT KIMBERLY AND THOMAS\n</b>\nRacing to the medical complex throughout.\n\n<b>THE WAITING ROOM\n</b>\nThe WATER TRICKLES into the outlet. The vacuum sparks and dies just\nas --\n\n<b>BACK IN DR. LEES' OFFICE\n</b>\nBANG! SFX: BROKEN GLASS - it sounds like a pigeon finally crashed\nthrough the window. In the other room.\n\n<b>                       DR. LEES\n</b>              Goddamn it already.\n\nDr. Lees marches out of the room to investigate. Another quick\nelectrical surge and the OXYGEN COMPRESSOR flutters off. The needle\ndrops. But the NITROUS flow remains strong.\n\n<b>ANGLE ON FISH MOBILE\n</b>\nSpinning from a new breeze. Suddenly, a small round PUFFER FISH FALLS\ndirectly into Tim's mouth.\n\nSoft, gurgling and choking.\n\n<b>INT. WAITING ROOM - CONTINUOUS\n</b>\nNora stares at a pigeon with a broken wing frantically trying to fly\nright. Dr. Lees makes a half- hearted attempt to soothe and catch it.\n\n<b>BACK IN DR. LEES' OFFICE\n</b>\nSLOW DOLLY up to Tim. Choking, gurgling. His eyes are open, but\nrolled up. His hand limply reaches up...then drops.\n\nSounds of commotion in the next room seem to fade away as we continue\nour SLOW DOLLY into Tim's eyes.\n<b>\n</b>They GLAZE OVER...the choking stops. And a HAND reaches into frame\nand pulls the puffer fish out of Tim's mouth.\n\nREVEAL JEAN looking petrified at the close call, looking around to\nmake sure nobody saw...\n\n<b>EXT. MEDICAL COMPLEX - LATER\n</b>\nNora and Tim, feeling better now, walk past the CONSTRUCTION CREW. A\nCRANE OPERATOR smiles at Tim, who smiles back.\n\nFrom across the mall, the tiny running figures of Kimberly and Thomas\nappear in the dis tance, pointing and screaming.\n\n<b>                        TIM\n</b>               What are they doing here? And why\n               are they yelling \"pigeons\"?\n\nJust then, Tim and Nora walk into a large cluster of PIGEONS who\nsuddenly burst into flight, startling the Crane Operator, whose hand\ninadvertently jerks a lever -\n\nA METALLIC CHAIN RATTLE fills the air and Tim looks up just as a HUGE\nSHEET OF GLASS PLUMMETS downward toward him and CRUSHES him, his\nmangled body visible underneath.\n\nAs two pearly whites roll around on the sidewalk, NORA SCREAMS.\n\n<b>DISSOLVE TO:\n</b>\n<b>EXT. MEDICAL COMPLEX - LATER\n</b>\nEmergency vehicles everywhere. Thomas seems exhausted as he walks\nback to Kimberly, who stands by his car. In the BG, EMTs load a\nstretcher into an ambulance.\n\n<b>                        THOMAS\n</b>                      (shaking his head)\n               Nora's not coming. She refuses to\n               leave her son.\n\n<b>                        KIMBERLY\n</b>               We have to tell her she's in\n               danger!\n\n<b>                        THOMAS\n</b>                      (sadly)\n               I did. And right now, I don't\n               think she cares.\n\n<b>EXT. KIMBERLY'S HOUSE - DAY\n</b>\nThomas' car turns into the driveway and parks. Kimberly holds up her\nhand and watches it tremble.\n\n<b>                        KIMBERLY\n</b>               It's happening again.   It's fucking\n<b>\n</b>              happening again. I hoped we'd get\n              there and they'd be okay, that\n              Clear Rivers was full of shit and\n              Evan's death was just a freak\n              accident...\n\nThomas kills the engine to listen.\n\n<b>                       KIMBERLY\n</b>              But we're all going to die. We\n              can't stop it. It's just a matter\n              of time. I'm so scared.\n\nThomas takes her hand and squeeze s it reassuringly.\n\n<b>                       THOMAS\n</b>              I am too. But you can use that\n              fear. It'll sharpen your\n              instincts. Keep you alert fro\n              signs. It's the only way you'll be\n              able to sav e the others...and me.\n\nKimberly, seeming overwhelmed, pulls her hand back. Thomas senses\nhe's losing her, and softens her approach.\n\n<b>                       THOMAS\n</b>              I know you didn't ask for any of\n              this, Kimberly. But I don't think\n              you have it in you to quit either.\n\nKimberly stares straight ahead, the weight of the world sinking in.\nBANG! A startling pound on the roof of Thomas' car.\n\nKimberly jumps, then spins around to see:\n\nCLEAR RIVERS - standing in the driveway. A determined, powerful\npresence. Kimberly exits the car. A MOMENT where Kimberly and Clear\nstare each other down.\n\n<b>                       KIMBERLY\n</b>              Clear/Thomas. Thomas/Clear.\n\nClear nods absently to Thomas, still focused on Kimberly.\n\n<b>                       KIMBERLY\n</b>                     (bitter)\n              The second one just dies.   A 16\n              year old kid.\n\n<b>                       CLEAR\n</b>                     (nods; a faint trace of\n                          guilt)\n              I hope you're ready for this.\n\n\n<b>EXT. FUNERAL HOME - DAY\n</b><b>\n</b>Thomas' car pulls into a partially filled parking lot. Kimberly,\nThomas and Clear file out and head to the door.\n\n<b>                       KIMBERLY\n</b>              This is cheery.\n\n<b>                       THOMAS\n</b>              Who is this guy, anyway?\n\n<b>                       CLEAR\n</b>              A mortician. He seemed to know a\n              hell of a lot more about death than\n              he ever told us.\n\n<b>                       THOMAS\n</b>              Should we knock?\n\n<b>                        CLEAR\n</b>                      (looking ill)\n              He probably already knows we're\n              coming.\n\n<b>INT. FUNERAL HOME - MOMENTS LATER\n</b>\nKimberly, Thomas and Clear open the large wooden doors into a small\nchapel, creat ing a loud CREAK. A corpse in an open casket sits at the\nfront of the chapel, post -wake.\n\nKimberly, Thomas and Clear are forced to walk around the dead body to\nget to a side door.\n\n<b>INT. CORRIDOR - MOMENTS LATER\n</b>\nThe three slowly edge towards a room at the end of a creepy hallway.\nAn ORANGE GLOW flickers from the far room. The unmistakable sounds of\na furnace make it all the more eerie.\n\nAs they near the door, they're able to see inside the room; the\nshadow of a figure looms against a steel oven.\n\nThey edge closer. They peek inside the --\n\n<b>INT. CREMATORIUM\n</b>\nOddly there is no one there. As they enter, passing the furnace, a\nmomentary WHOOSH of flames startles them all!\n\nThey jump back - bumping right into:\n\nMR. BLUDWORTH, the dark, sinister mortician from FD1, who has\ninexplicably appear BEHIND THEM.\n\n<b>                       MORTICIAN\n</b>              Hello, Clear. I've been keeping an\n              eye out for you.\n\nThe mortician rolls a metal gurney carrying EVAN'S EYELESS BODY\ntoward the firing oven. Kimberly and Thomas are scared.\n<b>\n</b><b>                       KIMBERLY\n</b>              Oh my God. That's Evan Shaeffer.\n\nClear, however, seems to expect nothing less.\n\n<b>                       MORTICIAN\n</b>              Come to... Pick my brain?\n\nThe Mortician slides a gleaming set of medical pliers into Evan's\nmouth. And YANKS out a gold tooth. Kimberly recoils as he discards\nthe bloody tooth on a metal tray.\n\n<b>                      MORTICIAN\n</b>                    (to Kimberly)\n             Flesh and bone require 1,600\n             degrees for cremation. Gold,\n             prosthetics and other metals must\n             be removed before the final --\n\n<b>                       CLEAR\n</b>                     (not falling for this\n                          again)\n             Just a simple question and we'll\n             leave you alone with your new\n             friend.\n\nThe Mortician grins; he likes the new Clear. He crosses the room and\nhits a LEVER. KA- CHUNK! The oven begins to blaze.\n\n<b>                      MORTICIAN\n</b>             Fire away.\n\n<b>                      CLEAR\n</b>             How do you cheat Death once and for\n             all?\n\nThe Mortician, recrossing the room, passes Kimberly and stoops down\nto sniff, no INHALE, a terrified Kimberly's essence.\n\n<b>                        MORTICIAN\n</b>              Dead.   But still fresh.\n\nKimberly shudders as the Mortician moves back to Evan's body. Clear\nhas had about enough.\n\n<b>                      CLEAR\n</b>                    (to the Mortician)\n             Look, we drove a long way to get\n             here. So if you happen to know how\n             to get this death monkey off our\n             backs, it sure would be swell if\n             you told us.\n\nThe Mortician now CLAMPS THE PLIERS around Evan's NIPPLE RING.\n\n<b>                       MORTICIAN\n</b>              For what purpose? You seek a back\n              way out of a room with but one\n              door. You can't cheat Death; there\n<b>\n</b>              are no escapes.\n\n<b>                       CLEAR\n</b>              Bullshit. You told me Death has a\n              distinct design, a blueprint,\n              unalterable. But Alex and I\n              cheated Death not once, but dozens\n              of times. If the design is flawed,\n              it can be beaten.\n\nA sick smile crosses the Mortician's lips. He yanks the nipple ring\nOFF! Kimberly looks on both horrified and awed when Clear doesn't\nflinch back from the pliers, where a bloody nub dangles.\n\n<b>                       MORTICIAN\n</b>              Such fire in you now. People are\n              always most alive just before they\n              die. Don't you think?\n\nClear steps back from him, hate flashing in her eyes.\n\n<b>                       CLEAR\n</b>              It can be beaten.   And you know it.\n\nCREEEAAAK -SLAM! The Mortician rolls Evan's body into the oven.\n\n<b>                        MORTICIAN\n</b>              Some say that there is a balance to\n              everything. An equilibrium that is\n              the connective tissue of the\n              universe. They say that for every\n              lif e there is a death, and for\n              every death a life...\n\nHis words hang in the air. An ominous BREEZE enters.\n\n<b>                        MORTICIAN\n</b>              Solus novus anima licet evinco\n              mortis; Only new life can defeat\n              death.\n                     (off their confusion)\n              The list of life is forever set by\n              the Divine Plan, the guiding hand\n              that plots the course of the\n              universe, down to its tiniest\n              element s.\n\nThomas looks to Clear; what's he talking about? The Mortician focuses\non Kimberly as if the others had ceased to exist.\n\n<b>                       MORTICIAN\n</b>              The list accounts for every life;\n              from the dawn of man to the great\n              apocalypse. But the introduction\n              of life that was not meant to be, a\n              soul forbidden to roam the earth,\n              that could invalidate Death's list,\n              shatter its very existence.\n<b>\n</b>Evan's other eye POPS , startling Thomas and Kimberly.\n\n<b>                       THOMAS\n</b>              What the hell does that mean?\n\n<b>                       MORTICIAN\n</b>                     (with finality)\n              To figure that out you'll have to\n              follow the sign s.\n\nThe Mortician grabs Kimberly.\n\n<b>                       MORTICIAN\n</b>              But be warned. To disrupt the\n              grand design is to unravel the\n              tapestry of the universe. When you\n              pull all the threads apart, you may\n              find yourself hanging from them.\n\nThe Mortician finally lets Kimberly go.\n\n<b>                       CLEAR\n</b>              One last question. Why is Death\n              working backwards this time?\n\nThe Mortician glances at his watch - Evan's bran d new Rolex.\n\n<b>                       MORTICIAN\n</b>                     (shakes head; a sick\n                          smile)\n              Sorry, time's up.\n\n<b>EXT. GAS STATION - DAY\n</b>\n<b>CLOSE UP - GAS DRIPPING\n</b>\nFrom the nozzle in Thomas' car. Thomas fills the tank, watching for\nsigns of danger. Clear's hand is poised over the gas pumps' EMERGENCY\n<b>CUT-OFF VALVE\n</b>\nSome SKATE RATS exit the mini -mart with a pack of Camels, followed by\nKimberly, who carries a couple of Red Bulls and hands them out.\n\n<b>                       THOMAS\n</b>              New life defeats death? Follow the\n              signs? Where the hell did you find\n              that guy?\n\n<b>                       KIMBERLY\n</b>              Yeah, I thought he was supposed to\n              be helpful.\n\n<b>                       CLEAR\n</b>              He was. If we can use your ability\n              to see the signs, we can cheat\n              Death long enough to figure out\n              what \"new life\" means.\n                     (off their looks)\n              I know, it worries me that I\n<b>\n</b>                understand him.\n\nThomas tops off the tank. Some gas spills to the ground. Quick looks\nall around -- sure enough, one of the Skate Rats is about to strike a\nmatch.\n\nCLEAR'S HAND SLAPS the kid in the back of the head, stopping him mid -\nmotion.\n\n<b>                         CLEAR\n</b>                What the fuck are you thinking?\n\nThe startled Skate Rat shrinks back from Clear's rage.\n\n<b>                         SKATE RAT\n</b>                I'm thinkin', suck my junk, bee\n                yatch.\n\nThomas chuckles to himself and looks at Kimberly who --\n\n<b>SMASH CUT TO:\n</b>\n<b>EXT. LAKE - DAY\n</b>\nPOV DRIVER. Grease-covered female hands reach out toward a steering\nwheel of a white van speeding out of control TOWARD A LAKE!\n\nThe van crashes through a railing and PLUNGES into the water. In\nmoments, the van fills with water, the driver inside trapped.\nDrowning. Horrible.\n\n<b>SMASH CUT TO:\n</b>\n<b>INT. GAS STATION - DAY\n</b>\n<b>KIMBERLY\n</b>\nComes to Thomas' arms - GASPING uncontrollably for breath. Terror-\nstricken. She begins hyperventilating.\n\n<b>                         THOMAS\n</b>                What is it? What did you see?\n\nIt's so bad, Kimberly can't speak. She coughs and gags as if recently\ndrowned. Clear scans the perimeter for immediate dangers.\n\n<b>QUICK CUTS:\n</b>\n<b>A POWER REPAIRMAN\n</b>\nOn a cherry picker messes with the transformer, a LAWN BOY pull-\nstarts a WEED WHACKER close to broken glass, a MECHANIC on a tall\nladder changes out the gas price numbers, a female DOG WALKER with\nthree dogs approaches the ladder.\n\n<b>                         CLEAR\n</b><b>\n</b>             You have to tell us now.\n\n<b>                        KIMBERLY\n</b><b>             I...I...\n</b>\nClear shakes her head by the shoulders and barks commands like an\nangry drill sergeant.\n\n<b>                      CLEAR\n</b>             You're strong. Do you hear me?\n             You're a fucking warrior. Nothing\n             scares you. In fact you happen to\n             be the single most powerful woman\n             on earth. Now what did you see?\n\nThe words slowly take affect. Kimberly becomes centered, getting her\nbreath back, and speaks without a hitch.\n\n<b>                      KIMBERLY\n</b>             I was driving a white van. It\n             must've gone out of control because\n             it crashed into a lake and I\n             drowned. It was...horrible.\n\n<b>                      CLEAR\n</b>             You were there?\n\n<b>                      KIMBERLY\n</b>             I can practically taste the water\n             in my throat. And something else.\n             The smell of flowers...\n\n<b>                      CLEAR\n</b>                    (confused)\n             Then it wasn't just a sign. It was\n             a premonition?\n\nThomas gently releases her, paces.\n\n<b>                      THOMAS\n</b>             Remember the onramp? There was a\n             pregnant woman in a white delivery\n             van.\n\n<b>                      CLEAR\n</b>             Holy shit. He said \"only new life\n             can defeat death.\"\n                    (off looks)\n             If she gives birth to a baby that\n             was never meant to be born, a brand\n             new soul that was never part of\n             Death's Design...\n\n<b>                      KIMBERLY\n</b>             It throws the entire Death list out\n             of whack. And a new list has to be\n             rewritten f rom scratch. We all\n             start over with a clean slate.\n\n<b>                       THOMAS\n</b>              It sounds all well and good, but\n<b>\n</b>             what if we're wrong?\n\n<b>                      CLEAR\n</b>             Please, what else could it mean?\n\n<b>                       KIMBERLY\n</b>                     (to Thomas)\n              So if you give us the pregnant\n              lady's number, we can warn her\n              about the lake and she'll live long\n              enough to have the baby.\n\n<b>                       CLEAR\n</b>              So let's do it.\n\n<b>                      THOMAS\n</b>                    (realization)\n             Shit, I don't have her number. She\n             was never interviewed. She took\n             off right after the accident.\n\n<b>                      KIMBERLY\n</b>             How are we going to find her?\n             There must be thousands of white\n             vans in this state.\n\n<b>                      THOMAS\n</b>             Hey, I'm a police officer,\n             remember?\n\n<b>INT. A/V ROOM - POLICE STATION - LATER\n</b>\nThomas works a VCR, scanning BACKWARDS through the video footage from\nthe patrol car camera. We see the SUV's explosive collision with the\njack- knifed semi. Kimberly is taken by surprise by the sight of the\ncrash.\n\n<b>                       KIMBERLY\n</b>              Oh God...\n\nThomas sees Kimberly and quickly flicks off the monitor.\n\n<b>                       THOMAS\n</b>              I, uh...sorry.\n\nKimberly notices Clear watching her and toughens up. She forces back\nthe tears and qui ckly wipes the rest away.\n\n<b>                      KIMBERLY\n</b>             I know, I know. We need my eyes.\n\nClear sits beside Kimberly.\n\n<b>                      CLEAR\n</b>             It's all right.    I'll take watch.\n\nKimberly looks grateful, and a moment passes between them, but she's\nalready buried the need to cry.\n<b>\n</b><b>                       KIMBERLY\n</b>              I'm okay. Just caught me by\n              surprise. Put it back on.\n\nClear does, watching the cars seemingly pass in reverse.\n\n<b>                       CLEAR\n</b>              Make sure all these people will be\n              at the meeting tonight.\n\n<b>                       THOMAS\n</b>              Taken care of.\n\n<b>THE MONITOR\n</b>\nBack, back, back until the Patrol Car slowly creeps backwards down\nthe onramp.\n\n<b>                       KIMBERLY\n</b>              There it is.\n\n<b>                        THOMAS\n</b>              Got it.\n\nThomas hits play and we see footage from the patrol car cruising past\nthe White Van. A clean shot of the license plate. Jackpot.\n\nAs Thomas slides his chair to a data base and types in the plate\nnumber, the pause function dislodges, slowly advancing the tape frame\nby frame.\n\n<b>                       CLEAR\n</b>              I don't get it. Why is everything\n              happening so fast? After Flight\n              180. A month went by before anyone\n              died. And now five people are dead\n              in less than a day.\n\nThomas' computer screen finally fills with information.\n\n<b>                       THOMAS\n</b>              Here we go. The vehicle's a\n              delivery van registered to Jorge\n              and Isabella Cruz. And Christ,\n              there's almost a dozen domestic\n              disturbance complaints on these\n              two.\n\n<b>                       CLEAR\n</b>              We need to hurry.\n\nThey all get up and leave.\n\nOminously, THE MONITOR shows the NEXT VEHICLE creeping behind Nora's\nPacer - a white van!\n\n<b>INT. CRUZ HOUSE - NIGHT\n</b><b>\n</b>Thomas pulls up to an upper-middle class house. Thomas, Kimberly and\nClear get out and start up the unlit path. It's dark, hard to see\nwhere they're going, so they negotiate by feeling the bushes aligning\nthe walkway.\n\n<b>                      THOMAS\n</b>             Let's lay this on her gently now.\n             The stress alone could upset the\n             pregnancy.\n\nKimberly nods, ever creeping closer to the front door -- when\nAUTOMATIC LIGHTS FLASH from over the garage.\n\nAll three freeze for a moment, during which we hear STOMPING emanate\nfrom within the house, and the lights SHUT OFF.\n\nBut nothing else happens. No one comes to a door. Thomas sighs, and\nas if suddenly remembering his status, he walks fearlessly and\npurposefully to the front door.\n\nHe makes a fist, is about to knock - when the DOOR FLINGS OPEN and a\nROTTWEILER LUNGES for his throat - only to have its collar snagged at\nthe last second by its owner -\n\nJORGE CRUZ, late 30's, handsome, cocky. He speaks above Rotty's\n<b>BARKING:\n</b>\n<b>                       JORGE\n</b>             What?\n\n<b>                      THOMAS\n</b>             I'm Officer Burke.    I'm looking for\n             an Isabella Cruz.\n\nSuddenly, with an unexpected fury, Jorge SCREAMS at his dog.\n\n<b>                      JORGE\n</b>             Shut up!!!\n\nThe Rottweiler cowers, and Jorge shoves it to the floor, where it\nlands on its feet and fearfully trots away. Jorge's face is once\nagain pleasant, but it's a thin veneer.\n\nJorge sees Clear and Kimberly behind Thomas and frowns.\n\n<b>                      THOMAS\n</b>             Are you Jorge Cruz?\n\n<b>                        JORGE\n</b>              Maybe.   What's this about?\n\n<b>                       THOMAS\n</b>              May we come in?\n\n<b>                       JORGE\n</b>             No.   What's this about?\n<b>\n</b>ANGLE ON CLEAR - eyeing what appears to be DROPS OF BLOOD on the tile\nfloor. She takes in what she can see of --\n\n<b>THE ROOM\n</b>\nAs if a tornado had hit it. Wedding photos smashed and torn.\nFurniture over-turned.\n\n<b>                       THOMAS\n</b>                     (a little stern)\n              It's about your wife, Isabella.\n              Now is she here?\n\nJorge's eyes flicker ever -so- involuntarily behind him.\n\n<b>                        JORGE\n</b>              No.   I'm alone.\n\nBut by now, Thomas has seen everything Clear has and more. He stares\nthrough the house, into a bedroom and sees -\n\nA FEMALE FOOT lying half0buried under the bedspr ead.\n\n<b>                       THOMAS\n</b>              Look, pal, it's probably nothing.\n              But I need to see --\n\nJorge is already closing the door.\n\n<b>                       JORGE\n</b>              Forget it. You'll need a warrant.\n              I know, I'm a lawyer.\n\nClear rushes the door, shoulders it and expertly wriggles past\nJorge's grasp.\n\n<b>                        JORGE\n</b>              Stop!!!   You can't go in there!!!\n\nClear tears into the bedroom, grabs the bedspread and THROWS it to\nthe floor to reveal a YOUNG WOMAN, naked, trembling with fear, takes\na closer look at Clear.\n\n<b>                       YOUNG WOMAN\n</b>              We never meant to hurt you\n              Isa...You're not Isabella!\n\nMeanwhile, Jorge yells at Thomas.\n\n<b>                       JORGE\n</b>              I'm going to sue your ass!\n\n<b>                       KIMBERLY\n</b>              Whose blood is that on the floor?\n\nDefensively, Jorge holds up his arm. Freshly cut.\n<b>\n</b><b>                        JORGE\n</b>               Mine, you idiot. The dog went nuts\n               this afternoon. Now arrest her!\n\n<b>                        KIMBERLY\n</b>               Where's Isabella? Did you finally\n               kill her you fucking wife beater?\n\nJorge flinches. It's time to come clean.\n\n<b>                        JORGE\n</b>               We had a fight. Some things got\n               broken, the dog went crazy, she\n               left me. Wouldn't say where she\n               was going.\n\n<b>                        THOMAS\n</b>               What was the fight about?\n\n<b>                        JORGE\n</b>               Take a guess.\n\n<b>                        THOMAS\n</b>               Does she have a cell phone?   A way\n               we can contact her?\n\n<b>                          JORGE\n</b>               She did.\n\nHe eyes a SHATTERED CELL PHONE on the floor.\n\n<b>                        CLEAR\n</b>               We're wasting time with this piece\n               of shit. Let's just get to the\n               meeting.\n\nJorge turns to soothe the frightened Young Woman in the bed.\n\n<b>                        JORGE\n</b>               Hey, when you find her, tell her\n               the kid's half mine.\n\nClear mutters something as they exit the house.\n\n<b>                        CLEAR\n</b>               We can only pray it doesn't come\n               out retarded.\n\nJorge hisses something at the Rotty, which CHARGES them and SPRINGS!\nBut Thomas slams the door on the frothing dog just in time.\n\n<b>DISSOLVE TO:\n</b>\n<b>EXT. THOMAS' APARTMENT BUILDING - NIGHT\n</b>\nRory sits in his Chevette outside an apartment building, staring up\nat the address. He quickly snorts some powder off his key and wipes\nhis nostrils free of crystals. He takes a breath and exits the car.\n<b>\n</b><b>INT. THOMAS' APARTMENT BUILDING - NIGHT\n</b>\nRory follows some PEOPLE into the elevator. The elevator doors close\non his shoe -- trapping Rory in an awkward position.\n\nOne MAN frantically pushes the DOORS OPEN button to no avail.\nFinally, as the elevator rises, Rory YANKS his foot free.\n\n<b>                        MAN\n</b>               Jesus Christ. I wrote to\n               management two weeks ago about\n               these friggin' bumpers.\n\nRory bends down and inspects his shoe.\n\n<b>                        RORY\n</b>               Damn, is that dogshit?\n\nRory briefly holds the shoe too close to the Man's face - see? -\nbefore disgustedly slipping it back on.\n\nDING. The doors open. The man hurries out and the elevator DOORS\nCLOSE on Rory's smirking face.\n\n<b>HARD CUT TO:\n</b>\n<b>INT. THOMAS' APARTMENT - LATER\n</b>\nREVEAL - Nora, Rory, and Kat, mortified, sit on a couch. It's obvious\nthe bomb's been dropped, reality has set in. Clear and Kimberly await\ntheir reactions. Nora raises a trembling hand.\n\n<b>                        NORA\n</b>               Does anybody have a Valium?\n\nKat opens her purse and hands her a blue pill.\n\n<b>                        KAT\n</b>               You'll want to take --\n\nNora pops it in her mouth.\n\n<b>                        KAT\n</b>               -- half of that.\n\nNora chews, her eyes half dead from bereavement. Across the loft,\nThomas paces, phone in hand.\n\n<b>                        THOMAS\n</b>                      (quietly, into phone)\n               Any word yet on the Dodge van?\n               Damn.\n\nEugene alone seems unafraid. He uses a GRABBER - a long pole with\nmovable claw on the end - to OPEN THE SKYLIGHT. When done, he\nbalances the long pole precariously against the wall.\n<b>\n</b>An OMINOUS BREEZE enters. Clear notices MAGAZINE PAGES blowing over\nthe desk by the couch.\n\n<b>                      NORA\n</b>             So that would mean... I'm next.\n\n<b>                      EUGENE\n</b>             Nobody's next. This is crazy.\n             First death's stalking us and now\n             premonitions?\n\n<b>                      KAT\n</b>             This can't be happening. My\n             career's at a peak, I finally met a\n             cute guy, I just bought a new\n             house...\n\n<b>                      RORY\n</b>             Just shut the fuck up and maybe\n             you'll live.\n\nKat's hands ball into fists. The hatred is mutual. Clear reaches for\na nearby cardboard box on the desk, noticing MAGAZINE PAGES blowing\nover until their weight tips over a PENCIL HOLDER which spills pens\nout. She takes the box to Nora.\n\n<b>                      CLEAR\n</b>             You're not next, Nora. Nobody has\n             to be next. That's the point.\n             Last time, we didn't plan. We\n             weren't organized. Now we can help\n             each other.\n\nShe reaches into the box and passes out cell phones to Nora and the\nothers.\n\n<b>                      CLEAR\n</b>             Think what would have happened if\n             Kimberly had been able to warn you\n             with the word pigeons...\n\nNora's head falls. Kimberly senses her anguish and takes over.\n\n<b>                      KIMBERLY\n</b>             The point is, as long as you know\n             what to beware of, you have a\n             fighting chance. It can be beaten.\n             If I call you and say subway, get\n             to a high rise fast. A place where\n             no subway could possibly go, get\n             it?\n\nEveryone nods in understanding. Rory fidgets, sniffling, then POUNDS\nthe table in frustration. Startling Kat.\n\n<b>                      RORY\n</b>             Why the hell did I ever get on\n             Route 18 in the first place?\n             That's me, Mr. Dumb Fucking Luck.\n<b>\n</b>Clear, very alert, looks at the tipped PENCIL HOLDER. PENS ROLL\ntoward the end of the desk, toward a large White Pages directory\nwhich hangs precariously off the edge just so.\n\n<b>                       CLEAR\n</b>              Anyone read today's paper?   The\n              article on Evan Shaeffer?\n\nNo one says a word.\n\n<b>                      CLEAR\n</b>             The only reason he was on Route 18\n             was because he own the lottery and\n             had to collect the winnings.\n\n<b>                       RORY\n</b>              That lucky bastard.\n\n<b>                      CLEAR\n</b>             What about the rest of you?\n             Kimberly, you were driving to\n             Daytona. Was Route 18 your first\n             choice?\n\n<b>                      KIMBERLY\n</b>             The new freeway was faster, but\n             Route 18 was the way my mom used to\n             take, so...\n\nThey take turns going around the room.\n\n<b>                      THOMAS\n</b>             Route 18 is Drake's assignment, but\n             he called in sick so I got...\n                    (blanches)\n             Drake's never sick.\n\n<b>                       KAT\n</b>              I was my first day of jury duty.\n\n<b>                      EUGENE\n</b>             Jury duty? That's randomly\n             selected by social security\n             numbers.\n\n<b>                      CLEAR\n</b>             Random, sure.\n\n<b>                      EUGENE\n</b>             What, you think Death planned for\n             each of us to die in the pile up\n             weeks ago? You're nuts.\n\nClear fumes. Rory looks ill and reaches into his wallet.\n\n<b>                      RORY\n</b>             Last July I dialed a wrong number\n             and got a radio station by\n             accident. They asked me what\n             number means \"good luck\" in Jewish.\n<b>\n</b><b>                       KAT\n</b>              Eighteen. And it's \"Hebrew\".\n\n<b>                       RORY\n</b>              Anyway, I guessed it right and won\n              these.\n\nRory holds up two Yankee tickets.\n\n<b>                       RORY\n</b>              The best way to get to Yankee\n              Stadium is Route 18.\n\n<b>                       KIMBERLY\n</b>              I don't know what's weirder, the\n              dialing a wrong number part or that\n              Death would set you up nine months\n              in advance.\n\n<b>                       THOMAS\n</b>                     (realization)\n              Whoa, nine months?\n\n<b>                       KIMBERLY\n</b>              Are you thinking what I'm thinking?\n\n<b>INT. CHEAP MOTEL - NIGHT\n</b>\n<b>ANGLE ON ISABELLA'S PREGNANT BELLY.\n</b>\nREVEAL she's lying down, binging on take- out food, while speaking on\nthe motel phone. A disturbing metallic SQUEAK SCRAPE -SQUEAK can be\nheard, nearly drowning out the SCREAMING COUPLE next door.\n\n<b>                       ISABELLA\n</b>              Yes, I'd like to report a domestic\n              squabble - my name? Isabella Cruz\n              why, does it matter? I'm at the\n              Super 8 motel. Yes, I own a white\n              van. So what? Just get over here.\n\nIsabella hangs up, recoiling at VIOLENT THUMPS against her wall. PULL\nBACK AND UP TO REVEAL the source of the unsettling SQUEAK is a\nrickety, wobbling CEILING FAN.\n\n<b>INT. THOMAS' APARTMENT - NIGHT\n</b>\nKimberly whispers into the phone.\n\n<b>                       KIMBERLY\n</b>              I'm sorry, Dad, we're having a hard\n              time with Shaina's eulogy. I'll\n              stay here at Virginia's tonight and\n              see you tomorrow. I love you too.\n\nShe hangs up, looking guilty for having lied to her father. Clear\nkeeps her eyes on the pens that ROLL on the slightly canted table\ninto the about-to -fall White Pages directory.\n<b>\n</b><b>                      CLEAR\n</b>             Remember everyone, just because\n             Kimberly's got the power doesn't\n             mean we're not all capable of\n             seeing signs to some extent.\n\nThe pens softly tap the phone book one by one until it lazily tips\nover and PLOPS HEAVILY onto a GOOSE-DOWN THROW PILLOW.\n\nSmall feathers from the pillow are carried upwards by the breeze.\nEveryone in the room watches them rise.\n\n<b>                      RORY\n</b>             It's like Forrest Gump.\n\nThey float across the room, ultimately landing on a MOUSETRAP! SNAP!\nThe trap flies over and knocks into the base of the unstable Grabber\n- which tips and slowly slides down the wall.\n\nClear, in a chair, looks directly above her head at a LARGE SWORDFISH\nmounted on the wall.\n\nThe Grabber picks up speed, arcs downward and hits the mounted\nSWORDFISH. The supporting brackets give, causing the SWORDFISH TO TIP\nand SLIDE DOWNWARD!\n\nClear lurches back in her chair just in time - the razor sharp bill\nimpales the seat cushion between her legs!\n\n<b>                     CLEAR\n</b>             Fuck. Should have seen that\n             coming. The institution's made me\n             soft.\n\nClear gets up, carefully easing herself around the swordfish. Eugene\nisn't quite sure what to make of what he's just seen.\n\n<b>                      EUGENE\n</b>             If Death has got such a hard-on for\n             you, maybe you should get the hell\n             away from us.\n\n<b>                      KIMBERLY\n</b>             We need her. She's the only one\n             who's dealt with this before,\n             idiot!\n\nKimberly looks self-conscious by her outburst. Clear, however, looks\ngrateful.\n\n<b>                      CLEAR\n</b>             We're all going to have to open our\n             eyes from now on. Look out for\n             each other. Sleep in shifts.\n                    (looks around apartment)\n             And we've got to safeproof this\n             deathtrap.\n<b>\n</b><b>MONTAGE - SAFEPROOFING THE APARTMENT\n</b>\nEveryone but Nora and Eugene helps unplug appliances, put out the\nfire, take down hanging objects, switch off the gas, put sharp\nobjects away, affix padding to chart corners...\n\nKat, placing poisonous cleansers and flammable liquids in a box,\nnervously pulls out a pack of smokes. Thomas watches as he takes a\nhanging mirror off the wall.\n\n<b>                      KAT\n</b>             Screw this. I'm going outside for\n             a smoke.\n\n<b>                      THOMAS\n</b>             You think you should?     It's not\n             safe out there.\n\n<b>                      KAT\n</b>             So? Nora's gotta bite it before me\n             anyway, right?\n\nKat steps towards the front door, then remembers the cell phone and\ngrabs it just in case. Thomas smiles 'good job' at her.\n\nKimberly, unscrewing the light bulb, looks up when Nora rises from\nthe couch in a stupor and struggles to put on her jacket. Kimberly\nlooks concerned.\n\n<b>                      KIMBERLY\n</b>             Where are you going, Nora?    You\n             okay?\n\nNora fights the sleeve, dazed and defeated.\n\n<b>                      NORA\n</b>             Four years ago my husband died.\n             Now Tim. There's nothing left for\n             me.\n\nKimberly stops pouring liquor down the drain.\n\n<b>                      KIMBERLY\n</b>             Don't say that. Once you lose\n             hope, it's already too late.\n\nEugene snickers. Nora looks up, anger surfacing.\n\n<b>                       NORA\n</b>              If it's my time to go, to be in\n              heaven with my family, then I can\n              accept that.\n\n<b>                      KIMBERLY\n</b>             You can't give up. Don't accept\n             Death's plan. Trust me, you can\n             fight this. If we can just survive\n             long enough until that baby is\n             born, we can --\n<b>\n</b>Nora looks more resolute than ever.\n\n<b>                       NORA\n</b>              If you'll excuse me, I have a\n              funeral to prepare.\n\nEveryone looks crushed when Nora heads for the door. Except Eugene,\nwho stands up as well.\n\n<b>                      EUGENE\n</b>             Yeah, why am I listening to a girl\n             who just got out of the nut house?\n\nAs Eugene heads out, Kimberly becomes enraged and grabs him.\n\n<b>                      KIMBERLY\n</b>             Seeing you die once was enough for\n             me.\n\n<b>                      EUGENE\n</b>             Whatever. I control my life, not\n             fate.\n\n<b>                      CLEAR\n</b>             I'll be sure to put that on your\n             tombstone.\n\nRory presses a cell phone into Eugene's hand on his way out.\n\n<b>                      RORY\n</b>             Be careful. And even if you don't\n             believe, give this to Nora.\n\n\n<b>INT. THOMAS' APARTMENT BUILDING - NIGHT\n</b>\nEugene pushes the elevator button a thousand times. Nora nervously\nties her long hair back in a single braid.\n\n<b>INT. THOMAS' APARTMENT - CONTINUOUS\n</b>\nThe nervous group finishes safe-proofing the apartment.\n\nRORY, standing on the couch, pulls a POLICE ACADEMY DIPLOMA off the\nwall - and slips - stumbling BACKWARDS into the closet.\n\nStaggering, he accidentally knocks some COAT HANGARS and a VOLLEYBALL\nTROPHY from the high shelf to the floor.\n\nThomas whips around and sees that Rory's not hurt. He then lowers his\ngaze and sees --\n\nThe figurine of a VOLLEYBALL TROPHY is framed by a tangled jumble of\nwire COAT HANGARS. Suddenly, STREETLIGHT FLICKERS ON for the evening.\nOddly, it only illuminates the Trophy/Hangar array.\n<b>\n</b>From Rory's vantage point, it looks like a surreal sculpture of a man\nwith hooks emanating from his body. The sodium vapor lamp casts an\nOMINOUS GLOW around the image.\n\n<b>                      RORY\n</b>             ...man with hooks. I see a man\n             with hooks. Someone?!?!\n\nThe others look over, trying to see what he does.\n\n<b>                      THOMAS\n</b>                    (unsure)\n             I kinda see it, yeah. So...Nora's\n             going to be killed by a man with\n             hooks?\n\nKimberly and Clear stare at the volleyball trophy - the street lamp\nominously FLICKERS OUT AND DIES.\n\nEveryone looks around for a hesitant beat, then Thomas picks up his\ncell phone. Clear first walks, then RUNS out the door.\n\n<b>INT. THOMAS' APARTMENT BUILDING - CONTINUOUS\n</b>\nThe elevator finally comes. Eugene and Nora get inside, standing in\nfront of a gaunt looking man holding a cardboard box full of\n<b>PROSTHETIC LIMBS.\n</b>\nMUZAK plays AC/DC's HIGHWAY TO HELL.\n\n<b>                      EUGENE\n</b>             Going down, right?\n\nThe Gaunt Man says nothing. The DOORS CLOSE.\n\n<b>INT. ELEVATOR - CONTINUOUS\n</b>\nEugene stares blankly at the CONCAVE MIRROR in the upper corner. He's\ndisturbed by the WARPED REFLECTION OF:\n\nTHE GAUNT MAN leans closer to Nora's hair and as the doors finally\nclose, he leans over and SMELLS it. Creepy.\n\n<b>                      EUGENE\n</b>             Um, by the way, your shoe's untied.\n\nNora bends down to tie her shoelace (the one that snapped). She tries\ntying the long dangling shoelace to the stubby one as Eugene's cell\nphone VIBRATES in his hand. Startled, he drops it to the floor. Then\nlooks embarrassed.\n\n<b>                      EUGENE\n</b>             Probably for you, anyway.\n\nNora picks it up. STATIC CRACKLES. It's hard to make out Thomas'\nyelling.\n<b>\n</b><b>                          NORA\n</b>                 Officer Burke?   I can't hear...\n\nA beat of confusion, then she slowly turns to see the clawed hooks\nand hands of the Prosthetic limbs. Terror. She freezes.\n\n<b>                      EUGENE\n</b>             What is it? What's wrong?\n\nBut Nora's too frightened to speak. Eugene grabs the phone, hearing\nunintelligible STATIC.\n\n<b>INTERCUT CLEAR\n</b>\nAs she frantically hits the elevator button. When it fails to come,\nshe runs downstairs.\n\n<b>INT. ELEVATOR - CONTINUOUS\n</b>\nNora slowly rises to her feet, feverishly mouthing a prayer... As the\ndoor opens, Nora rushes out - unseen to her, her long braid gets\nsnagged on one of the PROSTHETIC HOOKS, YANKING her backwards.\n\n<b>                          NORA\n</b>                 Let me go let me go!\n\n<b>                      EUGENE\n</b>             Oh, watch it, you've caught your\n             uh...\n\nThe Guant Man's sweet voice and demeanor are a clear contrast to his\noutward appearance.\n\n<b>                      MAN\n</b>             Goodness gracious, darling, let me\n             help you with...\n\nNora panic,s as Eugene and the Man try to untangle her braid. Nora\ndesperately spins her body around, sticking her head back inside the\nelevator.\n\nKat appears in the lobby, smoking a cigarette.\n\n<b>                      KAT\n</b>             You alright, Nora?\n\nThe elevator DOORS begin to close, and CLAMP around Nora's neck, her\nhead inside, body outside the elevator.\n\nEugene pounds on the BUMPERS, but they don't seem to work!\n\n<b>                          NORA\n</b>                 My God, someone please let me out\n                 of this --\n\n<b>INTERCUT\n</b><b>\n</b>The UP BUTTON is lit. Clear rushes to the lobby.\n\nThe Elevator RISES!\n\nINSIDE THE ELEVATOR, Eugene watches Nora's head drop to floor level -\nthen he pounds the Emergency Button - which SHORTS OUT!\n\nNora's body lifts upwards from the force of the elevator floor!\n\nNora's screams of terror and agony fill the air as the elevator\nrepeatedly LURCHES UPWARDS.\n\nKat gasps in horror to see this poor woman suspended above the floor.\n\nIt lurches. And lurches. And lurches. The horror never ends.\n\nClear comes from the stairwell and is shocked by the sight. She runs\nto the elevator doors, trying to pry them apart to no avail.\n\nAll Kat can do, crying, is grab hold of Nora's flailing legs and try\nto pull her back down.\n\nThe elevator lurches a final time. NORA'S HEADLESS BODY fall down\ninto Kat's arms, knocking her to the floor. Kat freaks, skittering\naway as the body convulses.\n\n<b>INSIDE THE ELEVATOR\n</b>\nEugene balls his hands to his mouth in undeniable fear. A\nbloodcurdling moan escapes him. He stares transfixed as Nora's head,\nstill aghast in terror, rolls around the floor.\n\nThe sight clearly sends Eugene over the edge. He SCREAMS, CLAWS AND\nPOUNDS, desperate to escape the elevator.\n\n<b>INT. THOMAS' APARTMENT - MOMENTS LATER\n</b>\nEugene suddenly bursts through the door, babbling incoherently.\nKimberly, Thomas and Rory look on, bewildered.\n\n<b>                      EUGENE\n</b>             ...no escapes my ass. I control my\n             fate. I die on my terms, hear me\n             Reaper cockscuker?!\n\nEugene's in another world. He approaches Thomas and lunges for his\nGUN - yanking it from the holster!\n\n<b>                      THOMAS\n</b>             What the hell are you...?\n\n<b>                       EUGENE\n</b>              Ain't going out like that.   On my\n              terms!\n\n<b>                      THOMAS\n</b>             Just take it easy!\n<b>\n</b>A twisted insane smile comes to Eugene's face as he jams the\ngunbarrel to his temple. The others shrink back in terror.\n\nHe PULLS THE TRIGGER. CLICK! Eugene tries again. CLICK!\n\nThomas looks stunned as Eugene goes through every round, CLICK CLICK\n<b>CLICK CLICK CLICK CLI CK...\n</b>\nKimberly breaths a sigh of relief.\n\n<b>                      KIMBERLY\n</b>             You don't keep it loaded?\n\nThomas' eyes disagree. He reaches in and GRABS the gun away from\nEugene, who stands there trembling. Thomas cracks open the cylinder.\nLoaded.\n\n<b>                      RORY\n</b>             Maybe they were all duds.\n\n<b>                       THOMAS\n</b>              Six in a row? Never. Impossible.\n              That's like\n                     (sinking realization)\n              ...winning the lottery.\n\n<b>                       CLEAR (O.S.)\n</b>              It wasn't his turn to die.\n\nEveryone turns to see Clear and Kat, standing in the doorway,\nDRENCHED IN BLOOD. Kat trembles uncontrollably.\n\n<b>                      KAT\n</b>             Can we find the pregnant woman,\n             please?\n\n<b>                                 DISSOLVE TO:\n</b>\n<b>INT. THOMAS' APARTMENT - DAWN\n</b>\nFlashing lights from rescue vehicles illuminate the living room. In\nthe newly conformed safe house, Kat and Clear relax as best they can\nin Thomas' dry clothes.\n\nThomas makes another phone call. In the corner, Eugene shivers to\nhimself. Desperately looking for signs of danger. He looks over to\nClear.\n\n<b>                      EUGENE\n</b>             Um, Clear? I'm sorry...about\n             before. I...\n\n<b>                      CLEAR\n</b>             Your entire world view just went\n             out the window. I couldn't expect\n             a religious conversation overnight.\n             We'll get through this.\n                    (beat)\n             I promise.\n<b>\n</b>Eugene looks immensely relieved. Rory ambles over to Kimberly, his\ntypical callousness gone.\n\n<b>                      RORY\n</b>             Can I ask you a question?\n\n<b>                       KIMBERLY\n</b>              Sure.\n\n<b>                       RORY\n</b>              When I die. Is it gonna hurt?\n\n<b>                      KIMBERLY\n</b>             I...I don't know.\n\nRory nods. He expected as much. He fishes his LICENSE and KEYS out of\nhis pocket.\n\n<b>                       RORY\n</b>              And you're gonna die after me,\n              right?\n\n<b>                      KIMBERLY\n</b>             I guess so.\n\n<b>                      RORY\n</b>                    (re: keys and license)\n             Would you take these? And if I\n             die...\n                    (tears well up)\n             Could you throw all my drugs out?\n             Paraphernalia, porno, you know...\n             Anything that would break my mom's\n             heart.\n\nKimberly looks deeply into his eyes, looking for the punchline. When\nshe doesn't see one, she nods tenderly and takes the keys.\n\nThe PHONE RINGS. Rory jumps at the sound, paranoid eyes in scan mode.\nThomas answers, speaks softly, hangs up.\n\n<b>                      THOMAS\n</b>             A one very pissed off Ms. Isabella\n             Cruz is being detained up in\n             Greenwood. Let's finish this\n             thing.\n\n<b>EXT. COUNTRY ROADS - DAY\n</b>\nKat's Ford Expedition winds its way through rural New York.\n\nA SPORTS CAR speeds past on the left, then as it pulls in front of\nthe Exped ition, its slipstream sucks over some debris from the\nshoulder; a thin metal piece of trim, which bounces in front of Kat's\nExpedition's left front tire.\n\nCU KAT'S WHEEL WELL -- the metal trim is shot upward into the wheel\nwell, where it lodges firmly, its sharp metal edge GRINDING AGAINST\n<b>THE RUBBER.\n</b><b>\n</b><b>INSIDE THE CAR\n</b>\nKat drives, Thomas reading directions in the shotgun seat. Kimberly,\nEugene and Rory ride in back. In the CARGO area, Clear scans out the\nrear window for danger.\n\nRory fidgets.\n\n<b>                         RORY\n</b>                Is this safe, guys? I mean,\n                someone in this car is about to get\n                whacked. Do the rest of us really\n                feel like sitting next to him?\n                       (off Kat's glare)\n                Or her. Hopefully her.\n\nAn uncomfortable beat.\n\n<b>                         THOMAS\n</b>                Guys, let's not panic.   Isabella's\n                safe.\n\n<b>                          KIMBERLY\n</b>                 How do you know?\n\n<b>                         THOMAS\n</b>                You said she was going to drive\n                into a lake. How can she when\n                she's in protective custody?\n\n<b>INT. SHERIFF'S STATION - DAY\n</b>\nIsabella, pissed, is in a holding tank. Small town deputy STEVE\nADAMS, 30's, CLEANS HIS GUN in her direction.\n\n<b>                         ISABELLA\n</b>                What do you mean \"grand theft\n                auto?\" This is insane.\n\n<b>                          STEVE\n</b>                Hopefully the district judge can\n                straighten it all out by Monday\n                mor ning.\n\n<b>                         ISABELLA\n</b>                       (figures it out)\n                Jorge. When I get out of here I'm\n                going to sue his cheating ass off.\n\nAs she fumes, a rivulet of WATER streaks down her leg.\n\n<b>                          IS ABELLA\n</b>                 Oh my God.\n\nSteve, at first confused, sees the water and gasps.\n\n<b>                         STEVE\n</b>                Are you kidding me?!   Oh, man.\n<b>\n</b>He rushes across the room, pulls a lever, unlocking the cell.\n\n<b>                         STEVE\n</b>              C'mon.    Let's go.\n\nAs Steve throws on his jacket, we reveal its prominent emblem:\n<b>GREENWOOD LAKE SHERIFF DEPARTMENT.\n</b>\n<b>EXT. SHERIFF'S STATION - MOMENTS LATER\n</b>\nSmall town station. Only one patrol car. In the patrol car, Isabella\nbuckles up in the sho tgun seat, the belt stretched tightly across her\nbelly.\n\nDeputy Steve tries the ignition, but the car won't start.\n\n<b>                       STEVE\n</b>              Damn, they always stick me with the\n              clunker.\n\n<b>                       ISABELLA\n</b>              Take my van!\n\n<b>EXT. WESTCHESTER COUNTY - DAY\n</b>\nKAT'S EXPEDITION speeds through a yellow light and continues on.\n\n<b>CLOSE ON EXPEDITION'S LEFT TIRE\n</b>\nMetal sheers away more rubber.\n\n<b>INSIDE THE EXPEDITION\n</b>\nRory, antsy, rubbing his nostrils, stares at two Yankee tickets.\n\n<b>                       RORY\n</b>              Here's what I don't get. For nine\n              months, Death does all this shit to\n              make sure I win these tickets and\n              end up on Route 18 at exactly the\n              right time for the pile up...\n\n<b>                        KAT\n</b>              Yeah?\n\n<b>                       RORY\n</b>              But why single me out? What am I\n              in the great scheme of things?\n              You'd think I stepped off Flight\n              180 or something... Fucking weird,\n              man.\n\n<b>                       THOMAS\n</b>              You want weird? Last year, my\n              partner and I were heading out for\n              the graveyard shift. A call comes\n              in about a train wreck and Frank\n              decides to let me handle it alone.\n<b>\n</b>                    (beat)\n             Frank died that night in a\n             shootout. I'd be dead too if that\n             call had come in just ten seconds\n             later.\n\nEveryone nods in that 'life's weird' reverence kind of way.\n\n<b>                      KAT\n</b>             I got that beat. So like, last\n             May, I was supposed to stay at this\n             cheesy bed and breakfast in\n             Pennsylvania. There was a major\n             gas leak no one knew about and all\n             the guests suffocated during the\n             night.\n\n<b>                      RORY\n</b>             Yeah, so what happened?\n\n<b>                      KAT\n</b>             I never mad it. The Greyhound bus\n             I was on splattered some chick all\n             over the road and we had to stop.\n\n<b>                      CLEAR\n</b>             Was that in Mt. Abraham?\n\n<b>                        KAT\n</b>              Yeah.   How did you know?\n\n<b>                      CLEAR\n</b>                    (sinking realization)\n             That bus you were on? It killed\n             Terry Mathers. She was supposed to\n             die on Flight 180.\n\n<b>                      KAT\n</b>             I'm not sure I--\n\n<b>                       THOMAS\n</b>              Shit. The call about the train\n              wreck that saved my life? That was\n              the night I scraped up Billy\n              Hitchcock.\n\n<b>                       RORY\n</b>              Who?\n\n<b>                      KIMBERLY\n</b>             Another kid from Flight 180.\n\nA chill passes over the group.\n\n<b>INT. WINDING ROADS - DAY\n</b>\nDeputy Steve speeds the White Van up the narrow winding road.\nIsabella breathes Lamaze- style through intense pain.\n\n<b>                       ISABELLA\n</b>              Promise me...I won't have the\n<b>\n</b>              baby...in this van.\n\nSpeeding up the incline, Steve tries to speed around a Volkswagon\nBeetle, but cars scream by in the opposite direction.\n\n<b>                       ISABELLA\n</b>              Get around it!!!\n\nSteve leans on the horn and stomps the gas, dangerously riding the\nshoulder around the Beetle.\n\nWay ahead of the Beetle, on the left side, is a LAKE.\n\n<b>EXT. WINDING ROADS\n</b>\nBRIAN GIBBONS, 15, cheerfully drives a TRACTOR hauling a WHOODCHIPPER\nacross the high crest of the empty road toward a pile of thick\nbranches.\n\nThe Tractor unexpectedly stalls in the middle of the road. He tries\nthe ignition, pumps the gas. Nothing...\n\nOnly by standing on the tractor can Brian see the White Van speeding\nup the hill toward him. He jumps down and frantically tires starting\nthe tractor. Once, twice, nothing.\n\n<b>EXT. KAT'S EXPEDITION - CONTINUOUS\n</b>\nCU FRONT TIRE - METAL shreds away more rubber.\n\n<b>INT. KAT'S EXPEDITION - CONTINUOUS\n</b>\nRory excitedly makes a connection.\n\n<b>                      RORY\n</b>             Remember the theater in Paris that\n             collapsed last year, killed\n             everyone inside?\n\nEveryone nods, anticipating...\n\n<b>                      RORY\n</b>             I had tickets to go, but one day\n             I'm in Paris, trippin' on acid,\n             sippin' lattes an' such, and this\n             dude gets whacked by a falling\n             sign.\n\n<b>                        CLEAR\n</b>              Carter.\n\n<b>                      RORY\n</b>             Freaked me out so bad I hid in a\n             shopping cart for four hours.\n             'Course, missed the show...\n\n<b>                        CLEAR\n</b><b>\n</b>                 What about you, Kimberly?   Did you\n                 anyone from Flight- ?\n\nClear stops when she sees all the color has drained from Kimberly's\nface. Even Eugene looks concerned.\n\n<b>                      EUGENE\n</b>             Are you okay?\n\nThe car becomes completely silent (except for the slight SCRAPING) as\nKimberly prepares to tell her story.\n\n<b>                      KIMBERLY\n</b>             A little over a year ago, my mother\n             and I went to the mall. I was\n             supposed to meet her outside, but I\n             got caught up watching some news\n             report about some kid who committed\n             suicide. I kept thinking, \"How can\n             you strangle yourself in a\n             bathtub?\" That's retarded.\n\nThomas mouths, \"Tod?\" to Clear. Clear nods.\n\n<b>                          KIMBERLY\n</b>                 It felt wrong. And yet...\n                        (continuing)\n                 There were gunshots outside and I\n                 ran...\n                        (chokes up)\n                 Some kids tried to jack her car.\n                 She fought them off - she was a\n                 fighter - and they killed her.\n\nKimberly looks to Clear.\n\n<b>                      KIMBERLY\n</b>             After the funeral I had this\n             overwhelming feeling that it should\n             have been me. I figured that's how\n             everyone must feel. But I guess I\n             was right.\n\nThomas reaches between the seats and takes Kimberly's hand. As he\nlooks into her eyes, Kat takes her own eyes off the road to light a\ncigarette.\n\n<b>INTERCUT BRIAN\n</b>\nThe tractor is safely off the road next to a wood pile. Brian grabs a\ncord and starts up the whoodchipper.\n\n<b>INT. KAT'S EXPEDITION - CONTINUOUS\n</b>\n<b>                      CLEAR\n</b>             It's all starting to come together.\n             When Alex got us off Flight 180, it\n             didn't just change our lives. It\n<b>\n</b>               affected everyone and everything\n               we've come into contact with ever\n               since.\n\n<b>                        EUGENE\n</b>               I'm not sure I understand.\n\n<b>                        CLEAR\n</b>               Being alive after our time caused\n               an outward ripple - a rift in\n               Death's design.\n\nEugene nods, slowly getting it.\n\n<b>                        EUGENE\n</b>               So if you never got off the plane,\n               none of us would be ali ve in the\n               first place.\n\n<b>                        CLEAR\n</b>               That's why Death is working\n               backwards. It's tying up all the\n               loose ends, sealing the rift once\n               and for all ­\n\n\nThis chapter of the screenplay contains scene(s) that do not appear\nor occur elsewhere in the final movie. In order to maintain the\nintegrity of the screenplay, it has not been edited.\n\n<b>CU LEFT TIRE\n</b>\nA thick retread sheers itself onto the pavement.\n\n<b>BRIAN\n</b>\nThe wood chipper roar s loudly. Suddenly, some forgotten stray chunk\nSHOOTS from the spout --\n\nThe airborne chunk of WOOD CRACKS the White Van's windshield. Steve\nveers out of control.\n\nKat sees the White Van ahead swerving into HER LANE. She quickly\njerks the wheel to the right.\n\nKat's LEFT FRONT TIRE BLOWS! It sends rubber flying and the entire\nSUV pulls hard to the left, spinning her out of control into the\noncoming lane of traffic - toward the White Van!\n\nIsabella SCREAMS! Steve jerks the wheel to the left! The White Van\nhas a close near miss with the Expedition, and goes off the road\ntoward a LAKE!\n\n<b>                          STEVE\n</b>               Hang on!\n\nThe SUV misses the tractor -- but sails off the other side of the\nembankment, spinning and rolling towards --\n<b>\n</b><b>THE GIBBONS' FARM\n</b>\nAt the bottom of the hill of a large rural farm, a PROPANE TANK sits\nat the edge of the property!\n\nThe SUV barrels down the hill - coming right for it!\n\n<b>INSIDE THE SUV\n</b>\nAll Kat can do is cover her head with her arms.\n\n<b>THE WHITE VAN\n</b>\nSpeeding toward the lake! Isabella SCREAMS, in pain, not fear. The\nWhite Van is ready for splashdown.\n\nSteve finesses the hand brake while tapping the accelerator. He's\nable to right the van away from the water without so much as a hard\njerk.\n\n<b>                         STEVE\n</b>                We're okay, we're okay.\n\n<b>THE PROPANE TANK\n</b>\nIt's about to get creamed - but the bouncing Expedition just barely\nmisses it! It continues, backwards, CRASHING through a temporary\nfence and right into --\n\n<b>AN AGRICULTURAL CONSTRUCTION SITE!\n</b>\nThe Expedition plows past earth movers, crashing through irrigation\nditches and pipes, shrapnel flying everywhere.\n\nJust as the Expedition comes to a stop, an IRRIGATION PIPE ROCKETS\nthrough the rear window -- miraculously missing Clear and Rory --\ncoming to a rest just behind Kat's head.\n\n<b>INSIDE THE WHITE VAN\n</b>\nSteve sees the wreckage on the other side of the highway and slows\ndown. Isabella squeezes his hand white.\n\n<b>                          ISABELLA\n</b>                Please.   It's not going to wait.\n\n<b>                         STEVE\n</b>                I've got to stop and help those\n                people.\n\n<b>                          ISABELLA\n</b>                 Do you want to deliver this baby?\n\nSteve looks ill, then sees another car stopping by the crash. He\nfloors it and speaks into the shoulder mic of his cop radio.\n<b>\n</b><b>THE EXPEDITION\n</b>\nThe dust settles in the silent car. The only sound is a QUIET, WET\nWHEEZE. Clear, dazed, looks around carefully, avoiding the METAL\nSPIKE that skewers the vehicle.\n\nRory holds his trembling hand before his eyes as if amazed to see it.\nKimberly shakes her hair, spilling glass onto the floor. Kat tries to\nopen the door, but it won't budge.\n\n<b>                       KAT\n</b>              Not my time.     Amazing...\n\n<b>                          THOMAS\n</b>                 Is everybody alright?\n\n<b>A BLOODY HAND SEIZES HIS SHOULDER!\n</b>\nThomas turns to see\n\nEugene SPASMING in the back seat! He clutches his ribcage in agony\nand wheezes! Blood trickles from his mouth.\n\n<b>                       KAT\n</b>              He can't breathe!        He can't\n              breathe!\n\n<b>                          CLEAR\n</b>                 Oh my god, Eugene!?\n\nEugene's head tilts forward, unconscious.\n\n<b>EXT. GIBBONS' FARM - DAY\n</b>\nBRIAN GIBBONS jumps off the tractor and sprints down the hill toward\nthe accident. At the edge of the property is a common farm FENCE made\nfrom wooden posts bridged by two thick wires.\n\nBrian skillfully climbs between the wires and runs past a DEAD OAK\nTREE ten feet inside the fence. In the BG, MR. GIBBONS darts inside a\ndouble-wide construction trailer.\n\n<b>                        MR. GIBBONS (O.S.)\n</b>              Call 9- 1-1!\n\n<b>WE FOLLOW BRIAN\n</b>\nTo the crash site. Brian's jaw drops as he absorbs the chilling sight\nof a guy and a girl dragging a blood- soaked man from the back seat to\nperform CPR on him.\n\nAround Brian, voices mesh in a surreal haze.\n\n<b>                       THOMAS\n</b>              Stop it, don't move him!\n\n<b>                         KIMBERLY\n</b><b>\n</b>               He can't breathe damn it.   I think\n               his lung's collapsed!\n\n<b>                        CLEAR\n</b>               Someone call for help!\n\nWe STEADICAM around Brian to reveal a woman screaming from the\ndriver's seat. The sound is surreal.\n\n<b>                        KAT\n</b>               I can't move my fucking leg!\n               Please get me out of here before it\n               explodes!\n\nThe color drains from Brian's face as the dying man on the ground\ncoughs blood and the girl performing CPR recoils.\n\nThe moment is still surreal as Brian steps back, further away from\nthe horrors he can't face. Into the street --\n\nAnd Rory yanks him back from imminent death as an AMBULANCE SPEEDS\nonto the property.\n\n<b>                        RORY\n</b>               Watch it, dude!\n\nThat SNAPS Brian back to reality. Sounds become normal again. Brian\ncollects himself and SNIFFS the air. He then drops to ground level,\nlooking under the Expedition for something.\n\n<b>                        KIMBERLY\n</b>               Help us, we need help over here!\n\n<b>                        BRIAN\n</b>                      (to Kat, reassuringly)\n               I don't smell any gas. And none's\n               dripping, either.\n\nBrian sticks his head in Kat's window and peers down at her trapped\nleg. He swipes the broken glass away from the window with this thick\nflannel sleeve, reaches in, and tries to YANK the door open with all\nhis might.\n\nNo good, Kat SCREAMS in pain.\n\n<b>                        KAT\n</b>               Stop that! I still need this foot,\n               thank you.\n\nBrian steps back as the emergency vehicle speeds over.\n\n<b>DISSOLVE TO:\n</b>\n<b>EXT. GIBBON'S FARM - LATER\n</b>\nClear watches two EMTS lo ad Eugene into the back of an ambulance. An\noxygen mask has been placed over his mouth.\n<b>\n</b><b>                      CLEAR\n</b>             Be careful with that, check the\n             gages on the regulator and be\n             mindful of overdoses. Oh, watch\n             for potholes and puddles.\n\nAs Clear continues, the exasperated Paramedics do their best to\nignore her. When she tries to climb inside, she is pushed away.\n\n<b>                      CLEAR\n</b>             Look, I made him a promise --\n\n<b>                        PARAMEDIC\n</b>              Sorry.   There's no room.\n\nAgain, she's shoved away and steps back, helpless.\n\nThomas and Kimberly stand by Kat, still trapped in the SUV.\n\n<b>                      THOMAS\n</b>             Get that over here!   Move move\n             move!\n\nA RESCUE WORKER carries the JAWS of LIFE past Clear towards the\nExpedition.\n\n<b>                       RESCUE WORKER\n</b>              Excuse me, hot soup coming through.\n\nThe hydraulic hose that leads back to the Power Unite WRAPS AROUND\n<b>CLEAR'S LEG.\n</b>\nAs the hose tightens, Clear realizes she's surrounded by shards of\nglass and metal. She quickly WRESTLES herself free of the hose and\nwatches the Paramedics lock Eugene's gurney into place.\n\n<b>                      CLEAR\n</b>             One more thing.   Watch out for\n             power lines.\n\nThe doors slam, revealing the PHELPS MEMORIAL HOSPITAL logo. The\nambulance speeds off, spraying gravel at her.\n\nShe reaches into her pocket and withdraws a CRUSHED cell phone. Shit.\nShe runs back over to Thomas.\n\n<b>                       CLEAR\n</b>              We have to contact Isabella now!\n\nA NEWS VAN tries to weave through the emergency vehicles to get\ncloser to teh accident.\n\n<b>ANGLE ON NEWS VAN UNDERCARRIAGE\n</b>\nIt sinks into the loose dirt, SCRAPING A LARGE ROCK. The gas tank\n<b>PUNCTURES.\n</b><b>\n</b>EMT'S angrily wave the news van back to the road, where it parks near\nthe twin wire fence opposite the DEAD OAK TREE.\n\nImmediately, A CAMERA CREW exits the van to catch the action. Rory\nsteps behind the News Van, making sure he can't be seen, and digs\ninto his sock, coming up with a bindle. A SMILE...\n\n<b>                        THOMAS (O.S.)\n</b>              Rory!!!\n\nRory cringes at his name, pockets his stash, then EXITS FRAME. WE\nPUSH IN, the news van gas tank is leaking. A SMALL DRIP...\n\n<b>EXT. GIBBON'S FARM - CONTINUOUS\n</b>\nThomas, Kimberly, Clear and Rory watch the JAWS OF LIFE being clamped\nonto Kat's door.\n\n<b>                       THOMAS\n</b>              Where's the cell phone Clear gave\n              you?\n\n<b>                       RORY\n</b>              I dunno. I think I gave it to\n              Eugene back at your place.\n\n<b>                       THOMAS\n</b>              Damn it. We have to call the\n              Greenwood Police Station and warn\n              Isabella.\n\nThomas runs in the direction of some local POLICE. After he leaves,\nRory drifts away from the pack, hand in pocket.\n\nKimberly moves back to Kat, who chain -smokes in the front seat of the\nExpedition.\n\n<b>                       KIMBERLY\n</b>              You doing alright in there?\n\n<b>                       KAT\n</b>              My legs are starting to cramp up.\n              And God, why am I so thirsty? Does\n              anyone have any Fiji?\n\nThe KA-CHUNK of the Jaws of Life next to Kat startles her half to\ndeath.\n\n<b>                       KAT\n</b>              Christ, you wanna give me a heads\n              up next time, pal?\n\nBrian and Mr. Gibbons approach with a cup of tap water. They hand it\nto kat, who frowns but drinks anyway.\n\n<b>CUT TO:\n</b>\n<b>THE DRIP\n</b><b>\n</b>Of the leaking gas becomes a steady trickle. GAS SLITHERS over packed\ndirt, around debris, toward the crash site.\n\n<b>BACK TO:\n</b>\n<b>THOMAS DARK ROOM\n</b>\nSpeaks to another COP who clicks off his radio.\n\n<b>                       COP\n</b>              She's at Phelps Memorial. They're\n              prepping her to give birth right\n              now.\n\n<b>                       THOMAS\n</b>              Where's that?\n\n<b>                       COP\n</b>              A few miles up the road.   Near the\n              docks.\n\n<b>KAT\n</b>\nLights one cigarette off the other KA -CHUCNK! The sound makes her\nflinch, dropping the cigarette on the floor.\n\n<b>                       KAT\n</b>              Damn, can't you be quieter with\n              that thing?\n\n<b>                       RESCUE WORKER\n</b>                     (dripping scorn)\n              Sure, I'll just set it to the\n              \"quiet\" mode.\n\nKat rescues the glowing cigarette from around her feet and inhales.\nKA-CHUNK!!! She jumps again, but maintains her composure.\n\n<b>MEANWHILE\n</b>\nThe gasoline purposefully trickles down corrugated steel, through\npipes, closer and closer to the Expedition. At one point, the gas\neven disappears into a hole in the ground, only to resurface twenty\nfeet closer to the site...\n\n<b>KIMBERLY\n</b>\nLooks confused to watch Rory climb between the fence wires and drift\nthe Dead Oak Tree into the field. Thomas runs down the hill toward\nKimberly.\n\n<b>                       THOMAS\n</b>              We gotta go now.   Isabella's in\n              labor.\n\nRescue Workers pull off a large chunk of door. KA-CHUNK! Kat\nFlinches.\n<b>\n</b><b>                       KIMBERLY\n</b>              What about that?\n\n<b>                       CLEAR\n</b>                     (calls over to Kat)\n              How you doing in there, hero?\n\n<b>                       KAT\n</b>                     (re: spike behind head)\n              I guess it could be worse.\n\nBrian hands out drinks to Rescue Workers.\n\n<b>                       THOMAS\n</b>              So let's go...Where the hell is\n              Rory?!\n\nThomas sees Rory in the field and angrily hops the fence, heading\ndirectly under the dead Oak Tree.\n\nRory, his back to everyone, finally opens the BINDLE. Enraptured, he\ndelicately unfolds it...\n\n<b>KIMBERLY\n</b>\nIs put on alert by a fresh BREEZE. Her attention is caught by the\nWINDOW of an emergency vehicle. IN THE REFLECTION, Kimberly sees a\nman sitting on the Expedition, but when she spins ar ound, there's no\none there.\n\nKA-CHUNG! The door comes off the Expedition, finally freeing Kat!\nEveryone applauds!\n\n<b>                        KIMBERLY\n</b>              Wait!\n\nMr. Gibbons, applauding with everyone else, chooses that very moment\nto sit on the bumper.\n\n<b>DEPLOYING THE AIRBAG!\n</b>\nSLAMMING Kat's head backwards through the spike, HEAD-KABOB.\n\nKat's dead limp hand drops her last cigarette -- which bounces along\nthe hard dirt -- toward the oncoming gas. Closer, closer,.. The\nBREEZE KICKS UP, aiding the cigarette.\n\nWHOOSH, the gas fuse catches. The blusih flame travels through pipes,\nover rocks, racing toward the news VAN.\n\nKimberly , half-traumatized, watches an ominous BREEZE rustle through\nthe field, up to the trees, toward Thomas.\n\nThe GAS BURNS up an incline, and disappears into the ground... And\npops up twenty feet closer to the News Van.\n<b>\n</b>Kimberly follows the BREEZE to the dead oak tree under which Thomas\nstands. And blows a large branch until it snaps! A startled Thomas\nsees it fall just in time to DIVE to safety.\n\nClear, seeing the flame, instinctively runs from the van.\n\n<b>                      CLEAR\n</b>             Get back!\n\nBOOM! The news van's explosion hurls two fence posts just over\nThomas' head, end over end, the two lengths of wire stretched between\nthem. The flying garrote heads directly for --\n\nRory, who sorts hard, stands up with a satisfied smile - and is\nsliced into three sharp cuts of beef.\n\nThe silence from the emergency crew is deafening. Mr. Gibbons starts\ncrying hysterically.\n\n<b>                      MR. GIBBONS\n</b>             I didn't mean to do it - I didn't\n             know.\n\nKimberly numbly stares at the fallen branch, the one that caused\nThomas to step out of the path of the flying fence.\n\n<b>                      KIMBERLY\n</b>                    (to herself)\n             It wasn't his turn.   And it's not\n             my turn.\n\nKimberly sees the corpses of Kat and Rory, buries the pain, and\napproaches Mr. Gibbons.\n\n<b>                      KIMBERLY\n</b>             Give me the keys to your truck.\n             Now!\n\n<b>                      MR. GIBBONS\n</b>                    (hysterical)\n             Anything you want. Anything.      I\n             wish I knew. I didn't...\n\nMr. Gibbons hands Kimberly the keys.\n\n<b>EXT. WESTCHESTER COUNTY - MOMENTS LATER\n</b>\nKimberly drives Thomas and Clear in the Gibbons' truck. All are numb.\n\n<b>                      THOMAS\n</b>                    (buckling up)\n             Hurry up. There's no time.   She's\n             about to give birth.\n\nKimberly unbuckles her seatbelt and floors it.\n\n<b>                      CLEAR\n</b><b>\n</b>             What are you doing?     You're going\n             to kill us!\n\n<b>                      KIMBERLY\n</b>             No. If anyone dies from a crash\n             now, it'll be me. But I can't die\n             if Eugene and Isabella are still\n             alive. I'm last on Death's list.\n\n<b>                      CLEAR\n</b>             Are you crazy? What makes you\n             think you'd survive?\n\n<b>                      KIMBERLY\n</b>             What happened when Eugene tried to\n             kill himself out of turn?\n\n<b>                      CLEAR\n</b>                    (considering)\n             Six duds in a row.\n\n<b>                      KIMBERLY\n</b>             And when it was Rory's turn to die,\n             and Thomas was in the way?\n\n<b>                      THOMAS\n</b>             That branch fell and saved my life.\n             You're right, Death's maintaining\n             the order.\n\n<b>                       KIMBERLY\n</b>              Let's pray that Isabella's still\n              alive.\n\nThe truck speeds into the horizon.\n\n<b>EXT. PHELP'S MEMORIAL HOSPITAL - ESTABLISHING SHOT\n</b>\n<b>INT. DELIVERY ROOM - DAY\n</b>\nTypical chatter as the staff preps Isabella. Steve paces nervously in\nthe background.\n\n<b>                      STAFF\n</b>             ...contractions coming quicker now.\n             Take her pressure and CTG. One\n             centimeter dilation. Prep the\n             epidural stat.\n\nIsabella breathes Lamaze style in the hospital bed, her feet in\nstirrups. A NURSE rocks Isabella's body back and forth, until her\nback arches almost unnaturally forward.\n\nIn the BG, an OBSTETRICIAN, 50s, sterilizes his hands in a scrub\nsink.\n\nA female ANESTHESIOLOGIST hustles over, swabbing a LONG EPIDURAL\nNEEDLE. The nurse places a mask over Isabella's face. The\nAnesthesiologist lowers the needle to the base of Isabella's spine.\n<b>\n</b><b>                       ANESTHESIOLOGIST\n</b>              She's going to have to stop moving\n              if I'm going to --\n\nThe Nurse SNEEZES.\n\n<b>                       ANESTHESIOLOGIST\n</b>              Goddamn it, keep her still!\n\n<b>                       NURSE\n</b>              Sorry, doctor.\n\n<b>XCU NEEDLE\n</b>\nTracing skin between Isabella's constantly moving vertebra.\n\n<b>ANGLE ON BUMBLEBEE\n</b>\nIt buzzes about the room, darting between the he ads of the doctors\nand nurses, hovering above the --\n\nANESTHESIOLOGIST, who traces the long needle down Isabella's spine,\nfinding the proper vertebrae.\n\n<b>                       ANESTHESIOLOGIST\n</b>              Perfectly still now...\n\nEveryone freezes. SILENCE. As the tip of the needle presses the skin\ndown --\n\nThe BEE lands on the Anesthesiologist's ear. And STINGS!\n\n<b>FLINCH!\n</b>\nThe NEEDLE SINKS IN - a NURSE GASPS. Did something go wrong?\n\n<b>                       ANESTHESIOLOGIST\n</b>              Done.\n                     (tears welling)\n              Now could someone please find the\n              open window and fucking close it?\n\n<b>EXT. SUBURBAN STREET - CONTINUOUS\n</b>\nKimberly speeds the truck down some dangerously twisty roads slick\nfrom wet leaves.\n\n<b>                       KIMBERLY\n</b>              This makes no sense. Isabella was\n              supposed to crash her van into a\n              lake. Could we have altered her\n              destiny when we had her arrested?\n\n<b>                       CLEAR\n</b>              I don't think so. Alex's\n              premonitions happened exactly as he\n              saw them no matter how much we\n<b>\n</b>               tried to change it.\n\n<b>                        THOMAS\n</b>               Then the only way to survive is to\n               get to the hospital and protect\n               Eugene and Isabella for as long as\n               we can.\n\n<b>                        CLEAR\n</b>               If only Alex and I had done that\n               with the others, Alex might still\n               be...\n\nA somber beat. Then Thomas looks over at the speedometer.\n\n<b>                        THOMAS\n</b>               Um, Kimberly? This is a\n               neighborhood. You may wanna slow\n               it down.\n\n<b>                        KIMBERLY\n</b>               Don't worry. Nothing can happen to\n               us.\n\n<b>                        THOMAS\n</b>               I wasn't worried about us.\n\nSuddenly, Kimberly clutches her throat!\n\n<b>HARD CUT TO:\n</b>\n<b>INT. HOSPITAL ROOM - DAY\n</b>\n<b>UNKNOWN POV\n</b>\nA NURSE hovers over us in a hospital, WRESTLING us down by the look\nof things. There is SCREAMING all around. The image comes at us so\nfast, we see only the briefest glimpse of the NAMETAG on her uniform:\n\n<b>KALARJIAN\n</b>\n<b>                        THOMAS (O.S.)\n</b>               Kimberly! Slow down!\n\n<b>                                     BACK TO:\n</b>\n<b>INT. TRUCK - CONTINUOUS\n</b>\nKimberly \"comes to\" at the wheel -- FLAILING DESPERATELY at the\nsteering wheel. She even claws at Thomas who tries to control the\nneglected steering wheel.\n\n<b>                        CLEAR\n</b>               Slow down! We're...\n\nKimberly looks up as the truck comes around a blind curve, where cars\nare backed up at a stop sign. Kimberly screams and SLAMS on the\nbrakes.\n<b>\n</b>The truck SKIDS on wet leaves, completely out of control, towards a\nLANDSCAPING TRUCK parked on the shoulder.\n\nKimberly's truck hits the loading ramps and launches itself twenty\nfeet into the air, DUKES OF HAZZARD-style.\n\nAnd lands miraculously without a scratch! On a parallel road. And\nkeeps going. Dumb, insane fucking luck.\n\nKimberly shakes off her premonition and looks out the rear window.\nShe turns around with a cocky smile.\n\nShe rubs her throat and FLOORS IT again to Thomas' horror, more\ndetermined.\n\n<b>                       CLEAR\n</b>                     (eyes darting)\n              What did you see? What am I\n              looking for?\n\n<b>                       KIMBERLY\n</b>              No, it's not here. This one was\n              different. More like the pile up\n              and the van going into the lake.\n              It wasn't just a sign, I was there.\n\n<b>                       CLEAR\n</b>                     (confused)\n              Another premonition?\n\n<b>                       KIMBERLY\n</b>              Yes. I was in a hospital. There\n              was screaming... A nurse was\n              choking me. I couldn't tell wh at\n              she looked like, but the name tag\n              was right in my face. Kalarjian.\n\n<b>                       THOMAS\n</b>              Kalarjian?\n\n<b>                       KIMBERLY\n</b>              I think a nurse named Kalarjian is\n              going to choke Isabella to death!\n\n<b>INT. PRIVATE ROOM - DAY\n</b>\nWIPING FRAME, a NURSE enters a room and reads a clipboard on an\nunseen patient's bed.\n\nREVEAL EUGENE lying in a hospital bed, wired to the latest medical\nhardware. Nearby, a RESPIRATOR plunges up and do wn, the RESPIRATOR\nTUBE snaking down Eugene's throat.\n\nThe NURSE'S HAND reaches down to Eugene's neck...\n\nEugene WINCES when the Nurse gives the tube a friendly little SHAKE\nto check if it's stable.\n\n<b>                       NURSE\n</b><b>\n</b>              Sorry. Can you feel that in your\n              trachea?\n\nEugene rolls his eyes. Stupid question.\n\n<b>                       NURSE\n</b>              Quite complaining. I got burnt\n              babies in the Children's Ward\n              braver than you.\n\nShe sticks an electri c thermometer in his ear. Eugene opens his mouth\nas if to speak.\n\n<b>                       NURSE\n</b>              Don't bother. You won't be talking\n              for at least a month. Think you\n              can handle that, Jabberjaw?\n\nEugene looks ready to cry. The Nurse sits on the bed, jarring Eugene\nenough to make him WINCE again.\n\n<b>                       NURSE\n</b>              Don't worry. Everyone learns to\n              love me once they get used to my\n              sense of humor, okay?\n\nEugene looks grat eful to see a humane side to this creature.\n\n<b>EXT. WINDY ROADS - DAY\n</b>\nThe pick up truck races to the hospital. As Kimberly speeds past a\nbillboard, a POLICE CAR pulls in hot pursuit.\n\n<b>                       KIMBERLY\n</b>              Shouldn't we pull over?\n\n<b>                       THOMAS\n</b>              No time. Keep going. I wouldn't\n              know how to explain any of this\n              anyway.\n\nAt the next intersection, TWO MORE COP CARS APPEAR.\n\n<b>                       KIMBERLY\n</b>              Oh come on.\n\nThe pick up truck blows by the second pair of cop cars, which\ninstantly join the high speed chase. Kimberly takes a long look in\nthe rearview mirror at the TAILGATING COPS. She then inspects the\nroad ahead.\n\n<b>UP IN THE DISTANCE\n</b>\nA busy six-lane intersection.\n\n<b>                       KIMBERLY\n</b>              What do you want me to do?\n<b>\n</b><b>                      CLEAR\n</b>                    (hesitated beat)\n             Speed up.\n\n<b>                       KIMBERLY\n</b>              Yeah, fuck 'em.\n                     (to Thomas)\n              No offense.\n\nKimberly SPEEDS toward the intersection. She pulls her seatbelt\naside, making sure it offers ZERO protection. Thomas jumps in the\nbackseat, buckles up...\n\n<b>                      CLEAR\n</b>             Be alive, Isabella, please be\n             alive.\n\nKimberly's eyes widen in fear. Her foot hesitates over the brake\npedal as --\n\nThe truck blindly blazes through the busy intersection, miraculously\nmissing every car!\n\nThe police are just barely able to fishtail into 90 degree turns,\navoiding the intersection completely.\n\nKimberly's eyes open and she lets out a victory cry.\n\n<b>INT. PRIVATE ROOM - DAY\n</b>\n<b>ANGLE ON\n</b>\nOxygen valve. PAN OVER AND DOWN TO\n\nEugene tries to watch a news flash of HIS accident on the TV across\nthe room, but a bulky ORDERLY blocks his view.\n\n<b>                      ANCHOR MAN (O.S.)\n</b>             ...ironically impaled through the\n             head as a result of an emergency\n             airbag deploying.\n\nAs Eugene shudders with dread, the Orderly pushes a huge cart in\nfront of him, again obscuring his view. Eugene frantically pantomimes\nwriting.\n\n<b>                       ORDERLY\n</b>              Need a pen? Sure. If you like,\n              I'll bring crosswords for you, too.\n\nEugene tries nodding his thanks, but the tube in his throat hampers\nhis movement.\n\n<b>                       ANCHOR WOMAN (O.S.)\n</b>              ...police Have speculated that one\n              of the deaths may have been\n<b>\n</b>              narcotics related and urge children\n              to stay away from d rugs.\n\nFinally, the Orderly pushes the cart away, revealing the TV. An\nANCHOR MAN taps his pages on the desktop.\n\n<b>                      ANCHOR MAN\n</b>             Good advice, Sue. And stay in\n             school. Up next, Johnny Showers\n             has the weather...\n\nA WEATHERMAN dressed as a frog points out cloud formations.\n\nEugene, tormented, stares at the screen as the Orderly begins pushing\nthe huge cart out of the room.\n\nThe sound of a SKIDDING CAR fills the room. It comes from the TV\nwhich shows a PSA featuring CRASH TEST DUMMIES.\n\n<b>                       ORDERLY\n</b>              Jeez, it's freezing in here.\n\nThe Orderly flicks the thermostat and one by one, VENTS CLOSE just\nbelow the ceiling.\n\nEugene's eyes fill with terror - he knows something's wrong.\n\n<b>ANGLE ON OXYGEN HOSE -\n</b>\nBursting. It HISSES softly. We follow the OBLIVIOUS ORDERLY out of\nthe room.\n\n<b>INT. HOSPITAL CORRIDOR - CONTINUOUS\n</b>\nA hospital ADMINISTRATOR briskly strides up to the Orderly.\n\n<b>                      ADMINISTRATOR\n</b>             What are you doing? The Henzels\n             are still waiting for you in the\n             Children's Ward --\n\nThe Orderly smacks his forehead - shit. Totally forgot.\n\n<b>                      ORDERLY\n</b>             Right, right, right.     Gregory's big\n             day.\n\n<b>                      ADMINISTRATOR\n</b>             And Mrs. Dempsey in hydrotherapy\n             can't feel her legs.\n\nThe Orderly, nodding rapidly, is halfway down the hall by now. The\nAdministrator shakes his head in disgust and walks past.\n\nThe HUGE CART. Which now blocks the door on Eugene's room.\n<b>\n</b><b>EXT. PHELPS MEMORIAL HOSPITAL - CONTINUOUS\n</b>\nKimberly seems to have ditched the cops. She speeds the pick up\nthrough the medical facility.\n\n<b>EXT. EMERGENCY ROOM - DAY\n</b>\nThe pick up skids to a halt in front of the hospital. Kimberly,\nThomas and Clear run outside and into the building.\n\n<b>INT. PRIVATE ROOM - DAY\n</b>\nThe OXYGEN HOSE hisses, but is drowned out by the volume of the TV.\nEugene's eyes dart frantically as a blaring fast food commercial\nends. The n, a NEWS REPORT comes on. The BANNER:\n\n<b>ROUTE 18 TRAGEDY\n</b>\nFootage showing grieving families, wreaths on doors, yellow ribbons,\nand emergency crews pulling wreckage apart, dissolve together over:\n\n<b>                       ANCHOR    WOMAN (O.S.)\n</b>             Mor e tears were    shed this morning\n             in the wake of     yesterday's tragedy\n             that rocked the     Tri -State area...\n\nSuddenly, the FRAYED ELECTRIC CORD of Eugene's TV begins sparking.\nThe sound DROPS OUT, the picture SPUTTERS.\n\nEugene goes white with terror. He looks back to --\n\nThe broken OXYGEN TUBE. HISSING softly. The BEEPS of the EEG machine\nfrantically increase. Eugene reaches for the nurse call switch.\nMockingly out of reach by mere millimeters.\n\n<b>INT. NURSES STATION - DAY\n</b>\nClear, Kimberly and Thomas dash toward the main desk.\n\n<b>                       CLEAR\n</b>              Isabella Cruz.    What room's she in?\n\n<b>                       RECEPTIONIST\n</b>              I'm sorry, I can't give out that\n              info unless you're a relative.\n\n<b>                       CLEAR\n</b>              I'm her sister.\n\nThe Receptionist eyes her dubiously.\n\n<b>                      RECEPTIONIST\n</b>             I'll have to see your ID, Ms. Cruz.\n\nClear vaults over the counter, straight-arms the Receptionist and\nseizes the computer. Thomas and Kimberly look on, stunned.\n<b>\n</b><b>                      CLEAR\n</b>             Delivery rooms are downstairs.\n             I'll find Eugene and catch up with\n             you.\n\nKimberly and Thomas hurry to the elevator banks...then reconsider and\nenter the stairwell.\n\n<b>INT. PRIVATE ROOM - CONTINUOUS\n</b>\nEugene scratches the top sheet of the bed, trying to inch the call-\nswitch closer and closer to him. But it won't budge.\n\nA RAT APPEARS behind Eugene's pillow, CRAWLS over his chest and\ndisappears by his stomach!\n\nHe pounds desperately on the empty food tray, his side rails, looks\ntoward the door --\n\n<b>INT. HOSPITAL CORRIDOR - CONTINUOUS\n</b>\nOutside the door, you can't hear a thing in the bustling hallway as\npeople rush by. Kimberly and Thomas rush past his door, lost.\n\n<b>                          THOMAS\n</b>                 Hurry, I think she's this way.\n\n<b>BACK TO EUGENE\n</b>\nHis eyes scream insanely, but he respirator tube prevents any sound\nfrom escaping him. And that's when the RAT appears on the floor and\nbegins gnawing on the respirator's power cord!\n\nWhen Eugene sees this, the EEG machine climbs off the charts.\n\n<b>INT. NURSES STATION - CONTINUOUS\n</b>\nClear takes off down the hallway. The Receptionist, shaken, dials her\nphone.\n\n<b>                          RECEPTIONIST\n</b>                 Security?\n\n<b>INT. DELIVERY ROOM - CONTINUOUS\n</b>\nThe Obstetrician voices concern.\n\n<b>                          OBSTETRICIAN\n</b>                 Listen to me, Isabella, I need you\n                 to stop pushing.\n\n<b>                          ISABELLA\n</b>                 What's wrong? IS the baby all\n                 right?\n\n<b>                          OBSTETRICIAN\n</b>                 It's a breach. If I can't reverse\n<b>\n</b>              it, we may need to do a Caesarian.\n\nThe Obstetrician's hands go to work. Steve looks ill.\n\n<b>                       STEVE\n</b>              Maybe I should step outside.\n\n<b>INTERCUT KIMBERLY AND THOMAS\n</b>\nRunning down the corridor.\n\n<b>                       PA ANNOUNCEMENT\n</b>              Code Blue in Delivery Room 6.   Code\n              Blue!\n\n<b>INT. PRIVATE ROOM - DAY\n</b>\nThe rat GNAWS away at Eugene's power cord, Eugene looks trapped,\nhelpless, tortured.\n\nHis eyes dart from the sparking TV to the gnawed power cord to the\nuseless call- switch.\n\n<b>INT. HOSPITAL CORRIDOR - CONTINUOUS\n</b>\nClear walks up and down the corridor, scanning room numbers as she\npasses. A -169, A- 171, A-173...\n\n<b>                       CLEAR\n</b><b>              B-187...B-187...\n</b>\nA HAND suddenly GRABS Clear and shoves her against the wall. REVEAL A\nSECURITY GUARD leering at her.\n\n<b>                      SECURITY GUARD\n</b>             Just where do you think you're\n             going?\n\nClear struggles to get away, getting sympathetic looks from an OLD\nMAN walking a rolling IV STAND down the corridor.\n\n<b>INT. DELIVERY ROOM - CONTINUOUS\n</b>\nIsabella is pushing again.\n\n<b>                       OBSTETRICIAN\n</b>              Almost there. I see the head...\n\nThe NURSE takes a pair of SCISSORS off a tray.\n\n<b>INT. HOSPITAL CORRIDOR - CONTINUOUS\n</b>\nClear plays possum, offering no resistance to the Security Guard as\nthe Old Man wheels his IV STAND along.\n<b>\n</b>Suddenly, Clear grabs the stand - and WHAMS the heavy wheeled base\ninto the Guard's BALLS! As the Guard recoils, she thoughtfully hands\nthe IV back to the Old Man and runs.\n\n<b>INT. DELIVERY ROOM 0 CON\n</b>\nThe Nurse is startled when Kimberly and Thomas BURST THROUGH the\ndoor. In the BG, a puzzled Steve peeks inside until Kimberly pulls\nthe door closed.\n\n<b>                      NURSE\n</b>             What are you doing in here?    Get\n             the hell out! Right now!\n\nFinally we hear the BABY CRY! The Nurse immediately moves in to\nswaddle the newborn. Dr. Kalarjian beams at the very groggy looking\nIsabella.\n\n<b>                       OBSTETRICIAN\n</b>              Isabella, look down and see your\n              son.\n\nTo the confusion of everyone around them, Kimberly and Thomas BURST\nINTO CHEERS! They jump, dance and hug each other.\n\nIt's a magical moment --\n\n<b>EXT. EUGENE'S PRIVATE ROOM - CONTINUOUS\n</b>\nThe RAT stops gnawing. The TV stops sparking. A wave of intense\nrelief washes over Eugene. He pantomimes reaching into his shirt\npocket and lighting a victory cigar.\n\n<b>INT. HOSPITAL CORRIDOR - CONTINUOUS\n</b>\nRelaxed and invigorated, Kimberly and Thomas giddily exit the\ndelivery room as Clear runs up to them.\n\n<b>                      CLEAR\n</b>             A guard grabbed me before I could\n             find Eugene.\n\n<b>                      THOMAS\n</b>             Don't sweat it.   It's over.\n\n<b>                      CLEAR\n</b>             She had the baby?\n\n<b>                      KIMBERLY\n</b>             New life defeats death. We've done\n             it. Death has to rewrite the list.\n             We're safe.\n\nSteve watches, confused, as Clear whoops with delight and HUGS the\nothers.\nClear laughs with a relief that seems completely foreign to her.\nKimberly laughs with her, then is suddenly rocked by a vision --\n<b>\n</b><b>HARD CUT TO:\n</b>\n<b>UNKOWN POV\n</b>\nLooking up a the EEG machine. Flatlined!\n\n<b>                        THOMAS (O.S.)\n</b>               Kimberly! Are you okay?!\n\n\n<b>INT. HOSPITAL CORRIDOR - BACK TO PRESENT\n</b>\nKimberly, on the ground, looks frazzled as she SNAPS out of her\ntrance. Thomas helps her to her feet.\n\n<b>                        THOMAS\n</b>               Are you okay? You just face\n               planted!\n\n<b>                        KIMBERLY\n</b>               I know how it feels to be dead.\n\nHer lips blue, Kimberly shivers uncontrollably. Clear sees TWO\nSECURITY GUARDS round a distant corner and quickly walks the others\ntoward an EMERGENCY LOADING ZONE.\n\n<b>                        CLEAR\n</b>               What did you see?\n\n<b>                        KIMBERLY\n</b>               I was dead. And came back to life.\n               An EEG machine. Where's Eugene?\n\n<b>                        THOMAS\n</b>               But it's over. Isabella's baby was\n               the key. You saw her die and\n               everything, right?\n\n<b>                        KIMBERLY\n</b>               I don't...what if I made a mistake?\n\n<b>                        THOMAS\n</b>               Impossible. She was on the onramp.\n\nKimberly reluctantly closes her eyes and remembers.\n\n<b>CUT TO:\n</b>\n<b>PREVIOUSLY UNSEEN\n</b>\nMoment of the pile-up premonition. A WHITE VAN in fr ont of Kimberly\nsuddenly slams on its brakes and pulls onto the shoulder.\n\nKimberly screams, swerving around the van just in time to avoid an\naccident.\n\n<b>BACK TO:\n</b><b>\n</b>Kimberly, overcome with self- doubt.\n\n<b>                       KIMBERLY\n</b>              I'm not sure... I don't think\n              Isabella was ever destined to die\n              in the pile -up.\n\n<b>                       THOMAS\n</b>              Then what's the premonition of the\n              lake supposed to mean?\n\n<b>                       CLEAR\n</b>              Can you remember anything about it?\n\nKimberly shuts her eyes, remembering:\n\n<b>EXT. LAKE - DAY\n</b>\n<b>POV DRIVER\n</b>\nGrease-covered hands reach out toward a steering wheel of a white van\nspeeding out of control TOWARD A LAKE!\n\nThe van crashes through a railing and PLUNGES into the water. In\nmoments, the van fills with water, the driver inside trapped.\nDrowning. Horrible.\n\nAnd on the rearview mirror, six floral scented AIR-FRESHNERS.\n\n<b>BACK TO:\n</b>\nKimberly looks down at her grease -covered hands and looks ill.\n\n<b>                       KIMBERLY\n</b>              ...the Same hands from the van.\n\nFinally everything makes sense to Clear.\n\n<b>                       CLEAR\n</b>              It's you Kimberly. The\n              premonitions are about you.\n\nKimberly trembles, refusing to accept what she's hearing.\n\n<b>                        KIMBERLY\n</b>              No!   It can't be.\n\n<b>                       CLEAR\n</b>                     (suddenly remembering)\n              I have to save Eugene!\n\nClear leaves Kimberly and Thomas together. Kimberly verges on tears\nand Thomas consoles her with a hug.\n\n<b>IN THE BACKGROUND\n</b><b>\n</b>Clear looks at passing room numbers while hurrying down the corridor.\nShe comes to a room with a HUGE CART parked outside, blocking the\ndoor. She looks up to see - B -187.\n\nClear leans into it, pushing it out of the way of the door.\n\n<b>                           CLEAR\n</b>                Eugene?    Are you in there?\n\n<b>EUGENE'S ROOM\n</b>\nEugene strains to hear through the thick door.\n\n<b>                         CLEAR (O.S.)\n</b>                Can you hear me? I'm coming in .\n\nAn intense wave of relief washes over Eugene.\n\n<b>BACK TO:\n</b>\nAs Kimberly hugs Thomas, she watches Clear push the cart past the\ndoor.\n\n<b>                         ORDERLY (O.S.)\n</b>                Make way, make way lovebirds.\n\nKimberly spins as Eugene's Orderly passes her; a paper, pen and a\ncrossword book in one hand, A BIRTHDAY CAKE in the other.\n\nThe CAKE reads \"Happy Birthday Gregory\". The THIRTEEN SPARKLING\nCANDLES on top ODDLY FRAME Clear's head.\n\n<b>                           KIMBERLY\n</b>                Oh no...\n\nThe Orderly speeds down the corridor toward Clear, whose hand reaches\nfor Eugene's door handle. She leans into it --\n\n<b>                         ORDERLY\n</b>                       (to Clear)\n                Thanks hon, the Henzels are going\n                crazy for this thing.\n\n<b>THOMAS AND KIMBERLY\n</b>\nWatch as Clear opens the door, briefly revealing Eugene, a whoosh of\nOxygen --\n\n<b>BOOM!!!\n</b>\nClear's body is obscenely hurled END OVER END towards the CAMERA,\nheading straight for Kimberly and Thomas!\n\nThomas throws himself and Kimberly around the corner to prevent being\ncrushed by Clear's lifeless body!\n<b>\n</b>The hospital erupts in total chaos. Just as Kimberly is about to\nbreak down completely, she sees --\n\nA WOMAN hurrying down the hallway in their direction, pushing a crash\ncart.\n\nKimberly sees the nametag: KALARJIAN.\n\n<b>                         KIMBERLY\n</b>                Nurse Kalarjian...\n\n<b>                         DR. KALARJIAN\n</b>                Doctor Kalarjian. Excuse me,\n                please.\n\n<b>ANGLE ON CART\n</b>\nDEFRIBULATOR PADDLES rest on top. And then Dr. Kalarjian passes them\ntoward the area of the explosion.\n\nKIMBERLY OMINOUSLY TURNS, the camera following her view, until she\nsees a small lake across the street from the hospital.\n\n<b>                         KIMBERLY\n</b>                Oh my God. That's it. The lake.\n                The EEG machine. Nurse Kalarjian.\n\n<b>                         THOMAS\n</b>                What?\n\nJust then, an AMBULANCE SKIDS up to the nearest entrance. PARAMEDICS\njump out and run towards the blast site.\n\n<b>                         KIMBERLY\n</b>                You can't cheat destiny. I know\n                what I have to do to save us. I\n                have to die.\n\n<b>                         THOMAS\n</b>                That's crazy. You can't give up\n                now. We can still fight this\n                thing.\n\nBut Kimberly isn't listening. She stares through the glass doors at\nthe --\n\n<b>AMBULANCE\n</b>\nA red stripe down the side, but the hood is completely white. Six\nfloral scented air-fresheners hang from the rearview. The 'van' from\nher vision! And it's running!\n\n<b>                         KIMBERLY\n</b>                I have to do this.\n\nKimberly wipes tears from her eyes, kisses Thomas' cheek, then turns\nand runs before he can speak.\n<b>\n</b><b>EXT. HOSPITAL ENTRANCE - CONTINUOUS\n</b>\nKimberly heads right for the open ambulance. The driver's door almost\nseems to swing open for her as she gets in.\n\n<b>INT. HOSPITAL ENTRANCE - CONTINUOUS\n</b>\nThomas frantically tries to get through the electric doors, which\nSPARK and short out. He struggles to pry them apart.\n\n<b>EXT. HOSPITAL ENTRANCE - CONTINUOUS\n</b>\nKimberly shifts into gear and speeds off. Thomas squeezes through the\ndoors and runs after her. An EMT, the driver of the stolen ambulance,\nrushes outside.\n\n<b>                      EMT\n</b>             What the fuck?!\n\n<b>EXT. LAKE - DAY\n</b>\nThomas chases the ambulance, watching helplessly as it barrels over\ncurbs, pylons and a fence, ultimately plunging straight into the\nlake!\n\nThomas sprints to the lake as fast as he can - the EMT trailing far\nbehind.\n\n<b>INSIDE THE AMBULANCE\n</b>\nKimberly panics as the ambulance fills with water and she takes a\nfinal gasp of air --\n\n<b>ON THE LAKE'S EDGE\n</b>\nThomas stares in horror at the percolating air bubbles as the vehicle\ndescends below the surface -- and he dives in!\n\n<b>UNDERWATER\n</b>\nThomas swims into the dark, murky water. Deeper and deeper, he g ets\nto the ambulance and tries to open the door. Stuck. He withdraws his\nbaton and BANGS on the glass - nothing!\n\nHe tries coming up for air, but his pants snag on the jagged metal of\nthe twisted bumper. He squirms frantically...\n\nAnd as his exhausted body loses consciousness, everything --\n\n<b>FADE TO BLACK.\n</b>\n<b>INT. HOSPITAL ROOM - DAY\n</b>\n<b>BLACKNESS.\n</b><b>\n</b><b>                      DR. KALARJIAN (O.S.)\n</b>             Ready and...CLEAR!\n\nThe SHOCK of defribulator paddles brings Kimberly back to life.\n\n<b>KIMBERLY'S POV\n</b>\nLooking up at Dr. Kalarjian, all she can see is part of a woman's\nface and a partial nametage reading \"Kalarjian\".\n\nIt would appear as if she's choking Kimberly, but --\n\nAn EEG MONITOR turns from a flatline to a steady heartbeat, the same\nPOV as the premonition.\n\n<b>                      NURSE\n</b>             She's back!\n\n<b>                          DR. KALARJIAN\n</b>                 Five CC's of narcodon. I want her\n                 stabilized and prepped for ICU.\n\nKimberly turns her head to see\n\n<b>THOMAS\n</b>\nUnconscious, CPR being performed on him by the EMT (who's now soaking\nwet). Thomas doesn't respond.\n\nAn INTERN opens an eyelid, points a flashlight at his eyes. Shakes\nhis head, nothing. The sopping wet EMT goes back to performing CPR.\n\nFinally, Thomas coughs up water, chokes, gasps for air, then BOLTS\n<b>UPRIGHT.\n</b>\n<b>                      THOMAS\n</b>             Kimberly?!\n\nHe turns to see Kimberly reaching out for him. Immeasurably relieved,\nhe takes her hand and allows himself to be eased back down to the\nplatform. Kimberly's eyes fill with tears.\n\n<b>                      KIMBERLY\n</b>                    (whispering)\n             Welcome back. We did it.           For\n             real.\n\n<b>                           THOMAS\n</b>                 I know.   I can feel it too.\n\nOutside, a parting of dark clouds causes a shaft of sunlight to flood\ninto the hospital. Its light covers Kimberly and Thomas with an\nethereal glow. There are no more doubts; they've won.\n\nThey exchange meek, yet triumphant smiles in the smoky, chaotic\nhospital.\n<b>\n</b><b>SLOW DISSOLVE TO:\n</b>\n<b>EXT. PARK - DAY\n</b>\nWe are at a summer barbecue. Frisbee, lawn darts, croquet, et.\nEveryone's happy.\n\n<b>TITLE CARD: FIVE MONTHS LATER\n</b>\n<b>ANGLE ON\n</b>\nShish -Kabob entering a mouth.\n\n<b>REVEAL\n</b>\nKimberly taking a bite, relishing the taste and calmly pulling the\nmetal skewer from her mouth.\n\n<b>                       KIMBERLY\n</b>              My God, this is delicious. I can't\n              believe I used to be a vegan.\n\nThomas, out of uniform, takes a bite of his own. As the metal skewer\nis deep in his mouth --\n\nA running FRISBEE PLAYER accidentally bumps into Thomas! But no harm.\nThomas gives the guy a friendly pat and goes back to rewrapping his\nmouth around the shish-kabob.\n\n<b>                       MR. BURROUGHS (O.S.)\n</b>              So what's the deal, Thomas? Three\n              months and you still haven't asked\n              my daughter out on a date.\n\nKimberly turns red as Mr. Burroughs appears and takes a seat.\n\n<b>                       THOMAS\n</b>              What's wrong with a platonic\n              relationship?\n\n<b>                       MR. GIBBONS\n</b>              Platonic my ass. That's for ugly\n              women.\n\n<b>                       KIMBERLY\n</b>              For God's sake, leave him alone,\n              Dad.\n\n<b>                       THOMAS\n</b>                     (smiling)\n              Yeah, don't make me cite you for\n              harassment.\n\n<b>                       MR. GIBBONS\n</b>              Oh please. I'm not hurting anyone.\n                     (looking around, lowering\n                          voice)\n              Besides, if you can beat Death,\n<b>\n</b>             what's he got to worry about me\n             for?\n\nMr. Gibbons sits down at the table with two plates of food. His wife,\nMRS. GIBBONS, joins.\n\n<b>                      MR. GIBBONS\n</b>             You know, you still never explained\n             to us how you did it.\n\nIt seems by now everyone's familiar with the concept.\n\n<b>                      THOMAS\n</b>             Well, technically when we died, we\n             gave Death what it wanted. And by\n             the time we were revived, it had\n             already moved on to graver\n             pastures.\n\nMrs. Gibbons makes a face, finding the discourse distasteful. She\nchanges the conversation.\n\n<b>                      MRS. GIBBONS\n</b>             You know, I'm having the greatest\n             day?\n\n<b>                      KIMBERLY\n</b>             Food's great too, Mrs. Gibbons.\n             Big props to you and Brian.\n\n<b>                       MRS. GIBBONS\n</b>             Our...pleasure. So, ready for the\n             back-to -school season? NYU, right?\n\n<b>                      KIMBERLY\n</b>             Three short glorious weeks away.\n\n<b>                      MRS. GIBBONS\n</b>             Sounds wonderful. I wish I were\n             going myself.\n\n<b>                      MR. GIBBONS\n</b>                    (to Mr. Burroughs)\n             You may want to think twice about\n             letting her live in the village,\n             Bob. Our eldest daughter moved\n             there and came back with piercings\n             all over her face.\n                    (looks grave)\n             Among other places.\n\nA chorus of friendly laughter.\n\n<b>                      BRIAN (O.S.)\n</b>             Dad used to call her the\n             pincushion. From Hellraiser.\n\nBRIAN enters frame, soaking up fresh laughter. He holds a plate full\nof raw chicken fillets and some long, wooden matches.\n<b>\n</b><b>                        BRIAN\n</b>               Dad, you had the spatula last,\n               right?\n\n<b>                        MR. GIBBONS\n</b>               Sure, here.\n\nMr. Gibbons hands it over and Brian saunters away from camera,\nSLIGHTLY OUT OF FOCUS, toward the barbecue, his body framed between\nKimberly and Thomas' heads.\n\n<b>                        KIMBERLY\n</b>               Brian looks like he's having fun.\n\n<b>                        MR. GIBBONS\n</b>               Sure does. Owes it to that friend\n               of yours, in a way.\n\nMr. Gibbons immediately regrets having said that.\n\n<b>                        KIMBERLY\n</b>               How's that?\n\n<b>                        MR. GIBBONS\n</b>               Well, Brian was nearly hit by an\n               ambulance the day...but your friend\n               Rory pulled him back at the last\n               second.\n\nKimberly and Thomas ominously turn their heads around. In the BG,\nBrian fidgets in front of the barbecue.\n\n<b>                        MRS. GIBBONS\n</b>               You never told me that, Peter.\n               Boy, that was lucky.\n\nBOOM!!! The PROPANE TANK blows Brian to smithereens. A deafening\nsilence follows, punctuated when Brian's ARM lands on Mrs. Gibbons'\nplate. PLOP.\n\n<b>FADE TO BLACK.\n</b>\n<b>END CREDITS.\n</b><b>\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Final Destination 2</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=J. Mackye Gruber\" title=\"Scripts by J. Mackye Gruber\">J. Mackye Gruber</a>  <a href=\"/writer.php?w=Eric Bress\" title=\"Scripts by Eric Bress\">Eric Bress</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Final Destination 2 Script.html#comments\" title=\"Final Destination 2 comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:05:22.139159"}