{"title": "Flintstones, The", "film_link": "/Movie Scripts/Flintstones, The Script.html", "script_link": "/scripts/Flintstones,-The.html", "info_raw": "\n\nFlintstones, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Steven E. De Souza\nGenres  Comedy  Family  Fantasy\nScript Date : September 1987\n\nRead \"Flintstones, The\" Script\n\n\n", "script": "\nTHE FLINTSTONES\n\nWritten by STEVEN E. DE SOUZA\n\nBased on characters created by\n JOE BARBERA & WILLIAM HANNA\n\n\n\n Early Draft - September 1987\n\n\n\n\n   FOR EDUCATIONAL\n    PURPOSES ONLY\n\n                          THE FLINTSTONES\n\n    FADE IN:\n1   EXT. SLATE QUARRY - DAY                                    1\n\n    FRED FLINTSTONE, archetypical Everyman, sits atop his\n    faithful heavy-equipment dinosaur, cranking the winch\n    that makes the mighty beast rip and tear into the quarry\n    wall.\n\n2   THE QUARRY FOREMAN                                         2\n    looks down at his wristwatch. Well... actually, it's a\n    wrist sundial. And it's magic time... quittin' time...\n    Millerock time!\n    Now the foreman turns from his watch to a steam whistle\n    bird, and yanks its tail. The BIRD SQUAWKS the end of\n    the workday --\n\n3   ANOTHER ANGLE                                              3\n                             FRED\n               YABBA DABBA DO -- !\n    Fred happily discards his hard hat, leaps out of the\n    canvas-roofed cab on the dino's back, slides down the\n    tail and bounces right into the seat of his stone and\n    timber car! He gets up to a running start with the only\n    motor (his feet), slows to allow a \"time clock\" dinosaur\n    to punch his stone timecard, and then he's trotting back\n    up to speed and out of the gate! MUSIC comes UP and\n    OVER --\n                             MUSIC (V.O.)\n               'Flintstones,\n               Meet the Flintstones,\n               They're a modern\n               Stone age fam-i-ly --'\n\n    -- And so forth, as for the first time in \"his-tor-y\" we\n    see the Flintstones' OPENING CREDITS live!\n4   TIGHT ON A MAILBOX                                         4\n\n    reading \"FLINTSTONE.\" We WIDEN as Fred SKIDS to a halt\n    in the driveway of his three-bedroom ranch cave. A\n    moment later, WILMA and PEBBLES run out -- both looking\n    just like they should -- and get into the car. A beat\n    behind them are the Flintstone pets, Dino and the\n    saber-toothed cat.\n    Fred pauses, looks around... HONKS his HORN... BARNEY,\n    BETTY and BAM-BAM come out of the neighboring house, hop\n    in!\n                                              (CONTINUED)\n\n                                                        2.\n\n4   CONTINUED:                                                 4\n    Fred's feet slap on the street as the car starts\n    up --\n\n                               MUSIC (V.O.)\n                 'From the\n                 Town of Bedrock\n                 They're a page right\n                 Out of his-tor-y -- '\n5   DRIVE-IN MOVIE THEATRE - DUSK                              5\n\n    Fred and company pull in. He takes a giant sea shell\n    \"speaker\" off of its wooden stand and hooks it to his\n    car door. He leans over, puts his arm around Wilma.\n    (In the back seat, Dino pops his head up, tearing through\n    the canvas top.) Dino picks up Pebbles and Bam-Bam and\n    puts them on his head for a better view. CAMERA ZOOMS IN\n    ON the drive-in screen and the words that America has\n    waited twenty-five years to see in 70mm Dolby(TM) drop-\n    your-popcorn reality:\n                            THE FLINTSTONES\n    And as the MAIN CREDITS ROLL, we --\n                                              DISSOLVE TO:\n6   AN EERIE CARBONIFEROUS FOREST - DAWN                       6\n\n    Dew drips from strange multi-leafed plants. Giant\n    DRAGONFLIES BUZZ AND HUM to and fro. Bubbles rise from\n    a still pond, and weird lungfish move onto the land.\n    (The third one out carries a little suitcase.)\n\n    CAMERA PANS PAST the lungfish TO a muddy shore. With a\n    DRAMATIC MUSICAL STING, we DISCOVER a set of strange,\n    hideous clawprints. The CAMERA FOLLOWS these, then\n    WIDENS to reveal the make of these footprints: A seven-\n    foot tall and fearful beast we will call the Xenosaurus.\n    It looks around menacingly. (Oddly, it's carrying a\n    canvas sack, but we don't stress this.)\n\n    Suddenly a garbage truck appears out of nowhere and runs\n    over the Xenosaurus.\n\n7   NEW ANGLE                                                  7\n\n    Dazed, the Xenosaurus gets up. As it does, we realize\n    that we aren't deep in some primeval forest, but on the\n    shoulder of a gravel highway. A stone road sign reads\n    BEDROCK 1/2 MILE. ROCK VEGAS, BABYLON & EDEN NEXT THREE\n    EXITS. Now, the CAMERA CRANES UP ABOVE the sign and\n    we see -- Bedrock!\n                                              (CONTINUED)\n\n                                                           3.\n\n7    CONTINUED:                                                 7\n     Nestled incongruously in a savage landscape, the charming\n     protosuburbia gleams in the dawn's early Spielberg light.\n\n     The Xenosaurus grabs its sack and some silverware spills\n     out. Then it runs off into the bushes and out of sight.\n\n8    WITH THAT GARBAGE TRUCK                                    8\n\n     It reaches the crest of a hill where there's a \"WELCOME\n     TO BEDROCK\" billboard which bears greetings from the\n     Rotary Club, the Chamber of Commerce, and (of course)\n     The Loyal Order of Water Buffaloes. The garbage truck\n     guys drop their feet down through the floorboard and\n     trot over the rise, coast down to the street below.\n     The driver yanks a wooden brake and the truck stops, and\n     the rear guys hop off. One of them waves to --\n\n9    A MILKMAN                                                  9\n     who returns the wave, then takes a four-pack of stone\n     bottles out of his milk truck, heads towards a doorway.\n     As the milkman drops off the milk, he passes a big\n     TORTOISE with trash cans on its back. The Tortoise\n     nods familiarly to the milkman, then it waddles down the\n     curb, CAMERA FOLLOWING. The garbage men take the cans\n     off the Tortoise's back, dump them into the truck.\n10   REAR OF TRUCK                                              10\n     -- revealing   that the back of the truck is actually a\n     giant-jawed   CREATURE strapped onto the chassis. The\n     garbage men   dump the cans into its maw... it happily\n     swallows the   works, licks its lips, BELCHES.\n11   BACK TO SCENE                                              11\n\n     The garbagemen slam the cans back on the Tortoise, who\n     winces as they drive off.\n                                TORTOISE\n                         (under his breath)\n                  You can forget about a tip for\n                  Christmas...\n\n     It waddles back up the lawn... passing by a wooden \"lawn\n     timer\" box which now pops open.\n     Inside the box is a \"ROOSTERSAURUS\" which CROWS and flaps\n     its wings. The motion of the wings knocks loose two\n     round stones which roll down two long troughs a la Rube\n     Goldberg...\n\n                                                          4.\n\n12   FOLLOWING THE ROUND STONES                                12\n     They reach the ends of their respective paths, dislodging\n     a stick... that releases a coiled rope which in turn\n     spins a turntable which holds a little wooly mammoth. As\n     it begins to spin around, it squirts water out of its\n     snout.\n\n     Elsewhere on the lawn, other spinning MAMMOTHS repeat\n     this performance. After a moment, they gradually slow\n     their revolutions. The one closest to the house\n     scrunches its trunk with a GROAN.\n\n                             LITTLE MAMMOTH\n                      (sotto)\n               Oh, my aching sinuses...\n\n13   INT. FLINTSTONES' BEDROOM - DAY                           13\n\n     WIDEN FROM the windowsill, where a little sea shell\n     hearing aid trumpet AMPLIFIES another ROOSTERSAURUS\n     \"COCK-A-DOODLE-DOO\" into the ear of a \"CLOCK RADIO\n     WOODPECKER.\" The Woodpecker yawns, gets out of bed,\n     puts a timecard in a little clock. Then it turns\n     and begins pecking on a BELL, which RINGS PIERCINGLY.\n\n14   INT. BEDROOM - NEW ANGLE                                  14\n     Two shapes are visible under the bedclothes: One is a\n     great SNORING bulge, the other is a svelte and lithe\n     shape. As the BELL continues RINGING, the larger bulge\n     GRUNTS, MOANS, pulls a pillow over its head, and then\n     finally gropes under the bed for a slipper. The slipper\n     is thrown without aiming --\n15   THE WOODPECKER                                            15\n     ducks just in time.   It wipes its forehead nervously.\n\n                             RADIO WOODPECKER\n                      (sotto)\n               I hate this job... There's not\n               even a health plan...\n\n     He staggers back up to his perch, and then notices for\n     the first time that the dial on the side is pointed not\n     to \"ALARM\" but to \"ALARM & RADIO.\" The WOODPECKER SIGHS,\n     looks over at the bed where SNORING is still emanating.\n     Then the bird swings a little telescope around to point\n     out the window.\n16   WOODPECKER'S TELESCOPE - IRIS SHOT                        16\n\n     as the 'SCOPE PANS and FOCUSES, finally SETTLING ON a\n     distant stone building marked RADIO STATION B-ROK.\n                                                (CONTINUED)\n\n                                                              5.\n\n16   CONTINUED:                                                    16\n     Perched on top of the wooden radio tower are a monkey\n     and an octopus. The monkey holds up cue cards which the\n     octopus reads, and then waves nautical semaphore flags.\n17   BACK TO SCENE                                                 17\n\n     Our WOODPECKER squints, CLEARS his THROAT.\n\n                                RADIO WOODPECKER\n                         (deeper \"on-air\" voice)\n                  Good morning, Bedrock. This is\n                  station B-R-O-K with the morning\n                  weather and news...\n18   IN THE BED                                                    18\n\n     The big bulge GRUNTS and MUTTERS a bit, then one hand\n     gropes around, finds the curvaceous form under the\n     neighboring covers... feels it tentatively... then\n     the fingers \"walk\" upwards...\n                                RADIO WOODPECKER (O.S.)\n                  It will be fair and mild through\n                  the weekend, continuing for the\n                  next eight hundred years, followed\n                  by cooling breezes and a protracted\n                  ice age...\n     Those walking fingers have reached the top edge of the\n     covers... now they pull them down revealing the owner's\n     face... the face of Fred, his eyes at half-mast, his\n     face covered in fashionable \"Bedrock Vice\" stubble.\n                                FRED\n                         (with genuine charm)\n                  Wil-ma. Wil-ma? How about a\n                  great big good morning kiss for\n                  your Freddy-weddy?\n     And he pulls the covers down to reveal -- DINO, who is\n     immediately \"YI-YI-YI-YI-ING,\" hopping all over the bed\n     and showering Fred with sloppy kisses.\n                                 FRED\n                  Dino!   Dino, cut it out -- !\n\n                                RADIO WOODPECKER (O.S.)\n                  In the news, Bedrock civic and\n                  business leaders met yesterday to\n                  discuss the growing kibble crisis.\n                                (MORE)\n\n                                                     (CONTINUED)\n\n                                                              6.\n\n18   CONTINUED:                                                    18\n                                RADIO WOODPECKER (O.S.) (CONT'D)\n                  Ecological activist Ralph Naderock\n                  warned that if new supplies of\n                  kibble are not found, our animal-\n                  powered civilization itself may be\n                  threatened.\n\n     By now Dino's affection   attack has knocked both master\n     and pet to the floor in   a jumble of bedclothes, asses\n     and elbows. Dino begins    to roll Fred across the room\n     like a seal playing with   a ball.\n\n                                FRED\n                  Dino, that's enough -- here, look,\n                  Daddy has a nice dino bone for\n                  you, just please stop it --\n\n     Fred has now backed up to a dresser, where he grabs a\n     brightly-colored box labeled \"PURINROCK DINO TREATS.\"\n     Fred holds it up -- Dino gets up on two legs, eager for\n     the treat -- Fred shakes the box... alas, nothing comes\n     out.\n     DINO \"YI-YI'S\" again, propelling Fred into the next room.\n19   INT. FLINTSTONE KITCHEN - DAY                                 19\n     Five-year-old PEBBLES GIGGLES at the table as Fred and\n     Dino tumble into the room like Frank Buck and a lion.\n     Wilma turns at the noise. One look at her and we under-\n     stand Fred's romantic turn.\n                                RADIO WOODPECKER (O.S.)\n                  In other news, Bedrock police\n                  report that the Xenosaurus has\n                  struck again! Yes, the fiercesome\n                  intruder was sighted in the\n                  Bedrock Hills for the third time\n                  this month. Outlying shops and\n                  residencies report extensive\n                  looting and property destruction...\n\n                                WILMA\n                  Fred, stop playing with Dino and\n                  sit down. Your breakfast's\n                  getting cold.\n\n     Saying this, Wilma puts   a huge egg at Fred's place.\n     Meanwhile, Fred manages   to get to his feet, holds out\n     one arm to keep Dino at   bay. Fred does a big \"take,\"\n     looking out the window   --\n\n                                                     (CONTINUED)\n\n                                                              7.\n\n19   CONTINUED:                                                    19\n                                FRED\n                         (throwing open the\n                          door)\n                  Oooh, Dino, look -- there's a\n                  nice big dino bone laying out on\n                  the front lawn -- !\n\n     Pause.   Dino gives him a big look as if to say, \"Oh,\n     yeah?\"\n                                FRED\n                         (trying again)\n                  -- Gosh, look at that adorable\n                  little female dino --\n\n     \"YI-YI-YI-YI,\" DINO is out the door like a rocket. Fred\n     cackles, slams it shut, then sits down at the table.\n                                FRED\n                  -- That animal's gonna kill me\n                  with kindness. Do you know we're\n                  out of dino treats?\n                                WILMA\n                  So is everybody else in Bedrock.\n                  That kibble crisis is getting\n                  worse every day.\n     She puts two giant slices of bread into a toaster. Two\n     claw-like devices hold the toast, pulling it out of\n     sight.\n                                WILMA\n                  I'm afraid Dino's going to have to\n                  manage on leftovers from Pebbles\n                  and me.\n\n                                FRED\n                         (sitting down)\n                  And what's wrong with my leftovers?\n\n                                WILMA\n                  I'll let you know when I see\n                  some.\n\n                                RADIO WOODPECKER (O.S.)\n                         (finishing up)\n                  ... Scientists from B.C.\n                  University report that the\n                  footprints of the Xenosaurus match\n                  no known animal.\n\n                                                     (CONTINUED)\n\n                                                              8.\n\n19   CONTINUED:    (2)                                             19\n                                PEBBLES\n                  Mommy, is the bad Ze-ze-zenosaurus\n                  gonna get me and eat me up?\n                                WILMA\n                  Of course not, baby.\n\n                                FRED\n                  That's right, sweetheart. The\n                  only thing that's gonna eat you\n                  up is -- me!\n\n     And he grabs her and bites her and tickles her.\n                                PEBBLES\n                         (giggling, calming)\n                  I'm still a little scared...\n                                FRED\n                  Pebbles, don't worry. These\n                  stories are very exaggerated.\n                  Like, you know, the boogyman?\n                  There's no such thing as a huge,\n                  inhuman reptile that attacks\n                  without warning --\n     WHAM! Dino reappears, bounding through the window\n     and knocking Fred onto the floor. Once again Dino is\n     happily licking and loving and cuddling his callously\n     unresponsive owner. Fred struggles to avoid the\n     slurping tongue, pulls himself up to the window sill,\n     looks out.\n                                FRED\n                  -- Oh, look, everybody, the mailman\n                  is here --\n\n     \"YI-YI-YI-YI!\" DINO buys it again, runs to the door,\n     lets himself out. This time Fred puts a chair against\n     the door.\n\n     Meanwhile, Wilma turns at the sound of the TOASTER\n     POPPING UP. We see that the \"claws\" we saw earlier were\n     the actual claws of a LOBSTER in a little fireproof suit\n     who is tucked inside the toaster. As Wilma takes the\n     toast, the Lobster blows on his claws, wincing, then\n     looks TOWARDS the CAMERA.\n                                LOBSTER\n                  Well, it beats working in a\n                  seafood restaurant...\n\n                                                     (CONTINUED)\n\n                                                             9.\n\n19   CONTINUED:    (3)                                             19\n                                FRED\n                         (taking the toast)\n                  Thanks, Wilma...\n     Fred slaps jelly on the toast, takes a big bite, and then\n     something outside the window catches his eye.\n\n20   HIS POV - STREET                                              20\n     A paperboy on a wood-and-stone bicycle is coming rapidly\n     towards the house. In the bike's basket is a stack of\n     dried, rock-hard clay tablets.\n21   BACK TO SCENE                                                 21\n\n     Fred leans out the window, waving his hands.\n\n                                FRED\n                  Arnold! Arnold! Don't aim at\n                  the house -- please, not at the\n                  house --\n     WHAM! Fred ducks back just as the stone newspaper slams\n     into the window frame, SMASHING a FLOWERPOT, taking out\n     a chunk of wall, and continuing diagonally through the\n     kitchen and out another window. Fred follows this\n     action in time to see --\n22   HIS DRIVEWAY - THROUGH THE OTHER WINDOW                       22\n     The rock paper drops like a foul shot, rips through the\n     canvas roof of Fred's car, and then bangs a huge dent\n     in the hood.\n\n23   BACK TO SCENE                                                 23\n     Fred sighs, turns back to his breakfast.\n\n                                WILMA\n                  Lucky it wasn't the Sunday paper.\n\n                                 FRED\n                          (slight smile)\n                  Yeah.   What else can go wrong?\n\n     He slices through the big egg with his knife -- releasing\n     a baby PTERODACTYL which SQUAWKS and flaps, knocking Fred\n     over as it takes off through the window.\n                                                    DISSOLVE TO:\n\n24   EXT. FLINTSTONE DRIVEWAY - LATER                              24\n     Fred -- now dressed for work -- is forlornly trying to\n     fix his car.\n                                                (CONTINUED)\n\n                                                             10.\n\n24   CONTINUED:                                                    24\n     In the neighboring driveway, Wilma and Betty pile the\n     kids into Betty's car.\n\n                                BETTY\n                         (wiping their mouths)\n                  Come on, kids. Time for nursery\n                  school.\n\n                                PEBBLES\n                  'Bye-bye, Daddy.\n\n                                FRED\n                  'Bye, little sweetheart.\n                         (as Wilma clears\n                          her throat)\n                  'Bye, big sweetheart.\n\n     Fred kisses them both and they drive off. Fred sighs,\n     tries to stretch the canvas roof edges close enough to\n     stitch. Nearby, Dino struggles to drag the stone news-\n     paper inside the house. The twin headlines are, of\n     course, KIBBLE CRISIS GROWS and MYSTERIOUS XENOSAURUS\n     STRIKES AGAIN.\n\n     Suddenly a pink flamingo appears over the hedge. As its\n     mouth opens and closes, it appears to be talking, but\n     the voice is that of --\n                                BARNEY\n                  Nice morning, huh, Fred?\n                                FRED\n                  What's nice about it?\n\n                                BARNEY\n                  Heh, hey. That Arnold's got a\n                  real arm on him, don't he?\n\n     Now we see that Barney is holding the flamingo's stiff\n     legs which he scissors, making the bird's beak trim the\n     hedge.\n\n                                FRED\n                  This is the third ragtop this year\n                  ... say, shouldn't you be at work?\n\n                                BARNEY\n                  Ah, well, that appliance store and\n                  me, we kinda had a little\n                  adjustment --\n\n                                FRED\n                  You got fired, didn't ya?\n                                                    (CONTINUED)\n\n                                                               11.\n\n24   CONTINUED:    (2)                                               24\n                                BARNEY\n                  Fred, don't start on me again.    I\n                  donno, I'm just not a nine to\n                  five guy. I got dreams, Fred.\n                  Ideas --\n\n                                FRED\n                  Yeah, I know, I know, those\n                  crazy inventions of yours. Be\n                  honest with me, Barn... tell me\n                  one thing you invented that\n                  really caught on.\n                                BARNEY\n                  I invented fire.\n\n                                FRED\n                         (pause)\n                  You invented fire?\n                                BARNEY\n                  I told you that, Fred. But the\n                  coal conglomerate ripped me off.\n                  The case is still in court, but\n                  meanwhile I got lotsa other\n                  ideas --\n                                FRED\n                  Yeah, but did any one of them\n                  ever put bread on the table? How\n                  long are you and Betty gonna live\n                  on those penny-ante royalties you\n                  get?\n\n     Fred pulls his car hood off of its wooden hinges,\n     examines it with dismay.\n\n                                FRED\n                  If you ask me, pal, you're just\n                  blowing smoke up your own\n                  volcano...\n\n                                 BARNEY\n                  Maybe, Fred.   But first...\n\n     He uses the flamingo's jaws to snatch the car hood\n     from Fred's surprised grasp.\n                                BARNEY\n                  Let me try some of that smoke on\n                  your car.\n\n                                                     CUT TO:\n\n                                                           12.\n\n25   INT. BARNEY'S GARAGE/WORKSHOP - DAY                         25\n     We can still see Fred's car in the neighboring driveway.\n     (We can also see Dino, who drags the newspaper on a\n     bit more, then collapses from exhaustion).\n     Barney's garage is cluttered with all kinds of odds and\n     ends, plus various inventions and scale models in\n     different stages of completion. (Interestingly, a\n     number of these anticipate Leonardo da Vinci's work).\n     Many of the models are made of a strange celadon green\n     material.\n\n     Fred watches, skeptical, as Barney presses the car hood\n     into some soft clay between two big blocks of stone.\n                               BARNEY\n                        (as he works)\n                 -- See, the first step, we make\n                 a mold of the old car hood, smooth\n                 out the dent in the clay --\n     He tosses the original car hood aside with a crash.\n     Then, moving rapidly, he starts heaving a variety of\n     ingredients into the reverse imprint of the car hood.\n\n                               BARNEY\n                 -- Add some lava granules... some\n                 woca leaves... juice from two\n                 coo-coo berries...\n\n                               FRED\n                        (impressed)\n                 Two coo-coo berries?   You made of\n                 money, Barney?\n\n                               BARNEY\n                 Anything for a pal, Fred -- a\n                 lump of coal... bamboo sawdust...\n                 eucalyptus sap... a touch of the\n                 La Brea tarbrush -- and -- voila.\n     Barney dips a finger in this mess, \"tastes\" it;\n     satisfied, he yanks on a hanging rope and a giant rock\n     weight slams down on the whole mess, making Fred jump out\n     of his skin.\n\n26   NEW ANGLE                                                   26\n\n     Fred is caked with dust.   He coughs and spits.\n                               FRED\n                 Barney, why don't you try inventing\n                 a brain for yourself! Look at what\n                 you did to --\n                                                  (CONTINUED)\n\n                                                              13.\n\n26   CONTINUED:                                                     26\n     He stops as Barney cranks up the weight on a ratchet,\n     proudly lifts out a perfect (though greenish) duplicate\n     of the car hood. As Fred examines it, impressed despite\n     himself, we...\n                                                    CUT TO:\n\n27   BETTY'S CAR - TRAVELING                                        27\n     The two kids are in the back seat. Somehow both of the\n     kids' faces are messy again. Working together with\n     beautiful precision, they are carefully dismantling the\n     rear armrests and door handles.\n                                BETTY\n                         (in mid-speech,\n                          driving)\n                  ... Oh, it's not that I'm complaining,\n                  Wilma. I mean, Barney's sweet, but...\n                  well, he's just not cut out to punch\n                  a clock. And he's such a dreamer,\n                  you think he ever once picked up a\n                  hammer and chisel and tried to\n                  balance a checkbook?\n     They pull up in front of a pleasant-looking simple little\n     nursery school. MRS. GRANITE, a pleasant-looking 65, sees\n     them from the schoolyard, waves while Wilma and Betty un-\n     load the kids.\n                                BETTY\n                  No, Barney just keeps looking for\n                  that coo-coo berry pie in the sky,\n                  and I don't want to pop his balloon\n                  by talking about the price of\n                  mastodon ribs.\n\n     She wipes off Bam-Bam's mouth with a handkerchief. Wilma\n     does the same with Pebbles and then they kiss the kids,\n     who immediately run into the schoolyard.\n\n                                MRS. GRANITE\n                         (approaching)\n                  Mrs. Rubble, Mrs. Flintstone, I\n                  wanted to thank you personally.\n\n                                BETTY\n                  You're welcome, Mrs. Granite. But\n                  we wipe their mouths every day.\n\n                                MRS. GRANITE\n                  No, no, I mean for all your wonderful\n                  support the past few years. It's\n                  parents like you that make me think\n                  twice about retiring.\n                                                   (CONTINUED)\n\n                                                              14.\n\n27   CONTINUED:                                                     27\n     From the schoolyard comes the sudden sound of KIDS QUAR-\n     RELING and then a THUD and some CRYING.\n\n                                MRS. GRANITE\n                  On the other hand...\n\n     Wilma and Betty laugh.\n\n                                WILMA\n                  We're really going to miss you,\n                  too, Mrs. Granite.\n\n                                MRS. GRANITE\n                  Have you found another school for\n                  the children?\n\n                                BETTY\n                  We're still shopping around.\n                                WILMA\n                  Fortunately, we're both --\n     Wilma and Betty straighten... salute.\n\n                                WILMA & BETTY\n                         (they've done this\n                          routine before)\n                  -- Professional shoppers!\n\n     As the three women laugh, we...\n                                                    CUT TO:\n28   EXT. BEDROCK STREET - TRAVELLING - DAY                         28\n     Fred and Barney drive along. (Behind them, the same\n     houses and palms seem to be going by... duplex, palm...\n     split level, two palms... duplex, palm).\n     Barney grins, gestures towards the front of the car.\n\n                                BARNEY\n                  Not bad, eh? After it cures for an\n                  hour or so, it's solid as a rock.\n\n                                FRED\n                  Okay, you fixed a dented hood. But\n                  you call that a living? Face it,\n                  pal, this is the Stone Age, and it's\n                  a dino eat dino world. You want my\n                  advice?\n\n                                BARNEY\n                  Did I ever?\n\n                                                    (CONTINUED)\n\n                                                           15.\n\n28   CONTINUED:                                                  28\n                                FRED\n                  You stick with me today, cruise on\n                  down to the quarry and fill out a\n                  job application. I'm a big man\n                  there, Barney --\n\n                                BARNEY\n                  You're a big man anywhere, Fred --\n                                FRED\n                  I'm serious, pal. Me and Mr. Slate\n                  are just like this --\n     He takes his hand off the wheel to hold up two fingers...\n     ends up swerving instead.\n\n                                FRED\n                  -- just like that. I know, I know\n                  -- you're not a clock-punching guy\n                  -- but face it, Barney -- it's time\n                  to grow up and put your nose to the\n                  grindstone, batten down the hatches\n                  and join the ratasaurus race with\n                  the rest of us.\n                         (meaningfully)\n                  It's time to retire those dreams.\n     Barney looks glum, doesn't say anything.    Suddenly Fred\n     pulls over, stops the car.\n                                 FRED\n                  Barney.   Look.\n29   WIDE SHOT                                                   29\n     They're at the crest of a high wide hill.\n\n                                 BARNEY\n                  Hey.   Lava Lane.\n                                FRED\n                  Remember the old days, Barn? We\n                  used to race our go-carts here to\n                  impress the girls.\n\n                                BARNEY\n                         (wistful)\n                  Yeah, those were the days... we\n                  usta dream about coming back here\n                  some day with a real car and goin'\n                  for the goldrock...!\n\n     A look from one to another, and then down the hill...\n     Fred gets a malicious grin on his face.\n\n                                                  (CONTINUED)\n\n                                                              16.\n\n29   CONTINUED:                                                     29\n                                BARNEY\n                  Fred... I thought you said it was\n                  time to retire those old dreams.\n                               FRED\n                  Hey. Since when do I have to be\n                  consistent?\n\n     The two pals laugh, and then    with a whoop they begin\n     pedalling like mad. They go     over the top, gravity takes\n     over and they are flying past    that billboard with all the\n     Rotary Club welcomes on it.     But now we see a different\n     sort of welcome, as a POLICE    CAR ZOOMS out from behind it.\n30   POLICE CAR - CLOSER                                            30\n\n     Inside are SERGEANT FELDSPAR and his rookie partner,\n     OFFICER GRAVEL. Cackling with anticipation, Feldspar\n     opens a box marked radar detector. Out pops a little\n     bird in a police helmet. It has a stopwatch (actually,\n     stop-sundial) around its neck. Feldspar points -- the\n     bird salutes -- takes off!\n31   FRED AND BARNEY                                                31\n                               BARNEY\n                        (spotting the cops)\n                  Oh-oh! Fred, slow down -- !\n\n     Suddenly both Fred and Barney see the RADAR BIRD flying\n     alongside them. It checks its stopwatch, writes a note\n     to itself. Fred is so preoccupied he doesn't notice\n     as --\n\n32   THE POLICE CAR                                                 32\n     cuts in front of Fred. Fred SLAMS on the \"BRAKES,\" sits\n     helplessly as Feldspar gets out, walks over, grinning.\n                                FELDSPAR\n                  Well, Flintstone, looks like today's\n                  the day.\n                                FRED\n                  Sergeant Feldspar, I... I wasn't\n                  speeding... honest...\n\n     Fred reaches down to the floorboard as he speaks...\n33   ANGLE ON FLOORBOARD                                            33\n\n     There's a box there marked RADAR BUSTER.\n                                                     (CONTINUED)\n\n                                                                17.\n\n33   CONTINUED:                                                       33\n                                FELDSPAR (O.S.)\n                  Forget it, Flintstone. This time\n                  I got you dead to rights --\n     Fred opens the box. A scary-looking winged reptile\n     sticks out its head, smacks its hungry lips.\n\n34   BACK TO SCENE                                                    34\n     Confident, Feldspar jerks a thumb at the Radar Bird,\n     turns to his rookie partner.\n\n                                FELDSPAR\n                  Gravel. Get me the radar reading\n                  and I'll show you how we deal with\n                  scofflaws.\n\n     Gravel nods, steps towards the bird. The bird checks\n     its stopwatch... and then it notices the flying lizard\n     which is hovering nearby, licking its lips.\n                                 RADAR BIRD\n                  Whoa!   Wings, do your stuff -- !\n\n     The Radar Bird flies away at a hundred miles an hour,\n     leaving a cloud of dust and the stopwatch behind.\n     Feldspar catches the watch, startled.\n                                FRED\n                  Well, Sergeant, if you don't have\n                  a radar reading, I guess we'll --\n                         (quickly)\n                  -- justbeonourway -- !\n\n     A new cloud of dust appears as Fred ROARS away.\n                                 FELDSPAR\n                  Flintstone!   Flintstone, come back\n                  here -- !\n                                                      CUT TO:\n\n35   EXT. BEDROCK BUTCHER SHOP - DAY                                  35\n     Betty and Wilma   have just pulled up. We notice that next\n     to their legal   spot, a big limousine is parked in a \"no\n     parking\" zone.    But our law-abiding Betty in the next\n     space now drops   a stone coin in a parking meter.\n36   CLOSE ON THE METER                                               36\n\n     Inside the window we see a LITTLE BIRD. It \"bites\" the\n     coin to check it, then turns over an egg timer.\n                                                      (CONTINUED)\n\n                                                              18.\n\n36   CONTINUED:                                                     36\n                                LITTLE BIRD\n                         (with a sigh)\n                  Four years in accounting school\n                  for this...\n37   INT. BUTCHER SHOP - DAY                                        37\n\n     It's absolutely   mobbed. Customers push past each other\n     with armloads of   food. Gigantic cuts of meat hang from\n     above or are on   display behind the counter. MORRIS THE\n     BUTCHER looks up   from the chaos and manages a weak smile\n     for the girls.\n                                BETTY\n                  Morris, what on earth is going on?\n                  You giving away Bronto filets?\n\n                                MORRIS\n                  Ah, my two loveliest customers.\n                  It's this darn kibble crisis, Mrs.\n                  R... people are buying everything\n                  I got to feed their dinos...\n                                MRS. SLATE\n                  Young man, if you're through\n                  flirting, I'd like some service.\n38   NEW ANGLE                                                      38\n\n     REVEALING MRS. SLATE, who stands there, impatient and\n     overdressed.\n                                MORRIS\n                  Of course, Mrs. Slate.   Just take\n                  a number.\n     Wilma senses the tension, quickly steps forward to break\n     it with a smile.\n                                WILMA\n                  Ah, hello, Mrs. Slate.\n\n     Morris reacts with relief.    Mrs. Slate reacts with a\n     blank look.\n\n                                WILMA\n                         (prompting)\n                  We met at the quarry picnic?\n                                MRS. SLATE\n                  Oh, of course. Mrs. Flintstein.\n\n     She turns her back to Wilma, forces her way towards the\n     counter again. Wilma burns.\n\n                                                     (CONTINUED)\n\n                                                              19.\n\n38   CONTINUED:                                                     38\n                                MORRIS\n                  Ladies, the meat's not getting any\n                  fresher. Mrs. R, what'll it be?\n                                BETTY\n                  Oh, I'd like some ground mammoth\n                  patties and uh... some dodo\n                  drumsticks.\n                                 MORRIS\n                  Gino?   We got any dodo bird?\n\n     GINO turns, looks at his end of the counter.\n                                GINO\n                  There's one left -- and it's the\n                  last one!\n                                MORRIS\n                  Good.\n                         (handing him the note)\n                  Give it to Mrs. Rubble along with\n                  this.\n\n     Gino nods, smiling. He picks up a crate, begins to load\n     it with giant fryer parts and several manhole-sized meat\n     patties.\n                                MORRIS\n                         (turning to Betty)\n                  How about you, Mrs. F?\n                                WILMA\n                  I just need a few things for Fred.\n                                MORRIS\n                  'Fred...'?\n                         (calling into the back)\n                  David! Herman! Get Rob and BoBo\n                  and tell 'em to bring the big\n                  dolly!\n\n                                VOICE FROM BACK (O.S.)\n                  Flintstone again, huh?\n\n                                MORRIS\n                  You got it. Now then... Mrs.\n                  Slate?\n                         (pointing at the\n                          limo outside the\n                          shop)\n                  You're in a no parking zone there.\n                                                     (CONTINUED)\n\n                                                              20.\n\n38   CONTINUED:    (2)                                               38\n                                MRS. SLATE\n                  Well, if I get some service, I'll\n                  be out of it, won't I?\n     Mrs. Slate steps to the counter. Meanwhile, the staff\n     begin using a refrigerator dolly to bring out giant ribs,\n     steaks and sausages which they pile up in front of Wilma.\n\n                                MRS. SLATE\n                  I want a nice fresh, juicy\n                  chickensaurus, Morris. And not\n                  one you've had laying around on\n                  the shelf. I mean fresh.\n                                MORRIS\n                  Mrs. Slate, we're kind of busy\n                  now --\n                                MRS. SLATE\n                  I don't care if you're busy. What\n                  I care about is my adorable little\n                  grand nephew. He's staying with\n                  me for the summer and I intend to\n                  make his favorite dish... Southern\n                  fried chickensaurus! Now I want\n                  a fresh chickensaurus and I want\n                  it now!\n                                MORRIS\n                  Boys, you heard her... she said\n                  fresh.\n39   THE STAFF                                                       39\n\n     with a sigh, they buckle on elbow and knee protectors,\n     go to a side door, open it. Inside is another barred\n     door. They open it, go inside. Immediately we hear\n     loud SQUAWKING and CACKLING... THUDS, BUMPS...\n40   NEW ANGLE                                                       40\n\n     Suddenly the barred door slams open and a      giant chicken-\n     saurus comes bounding out, with Morris's      staff hanging\n     all over it like rodeo cowboys. They try       and restrain\n     it with ropes but it's enraged and flops      around the\n     store.\n\n                                MRS. SLATE\n                         (oblivious of the\n                          trouble)\n                  Morris, while you're at it, I'd\n                  like it plucked --\n                                                    (CONTINUED)\n\n                                                            21.\n\n40   CONTINUED:                                                   40\n     Suddenly the chickensaurus snaps the ropes, flaps its\n     wings and leaps through the front window --\n\n41   EXT. BUTCHER SHOP - DAY                                      41\n     The huge bird lands with a crunch atop Mrs. Slate's car,\n     which is practically squashed flat. Then it disappears\n     around the corner. (We hear CAR HORNS and SKIDDING TIRES\n     as it goes.)\n42   BACK TO SCENE                                                42\n\n                                MRS. SLATE\n                  My car -- !\n\n     Wilma and Betty try and hide their laughter.\n\n                                                  CUT TO:\n43   EXT. SLATE CONSTRUCTION - DAY                                43\n     Clouds of dust rise from behind the fence. We see the\n     heads of the heavy equipment dinos rising and falling.\n     A two-story office building is at one end of the site\n     with a big \"Slate Construction Inc.\" sign on the roof.\n     CAMERA ADJUSTS as Fred's car turns into the lot, Barney\n     seated beside Fred. The new green hood gleams in the\n     morning light.\n44   CLOSER - FRED'S CAR                                          44\n     Fred digs his feet into the ground, slams to a halt. He\n     gets out, surveys the activity. Immediately, the various\n     workers shout AD LIB greetings. Fred acknowledges these,\n     beaming in the respect he gets here.\n\n     He lovingly dusts off his construction helmet, puts it on,\n     knocks an offending speck from his parking sign (F.\n     Flintstone - Shop Steward). He leads Barney towards the\n     quarry area.\n\n                                FRED\n                  Barney, you won't regret this --\n                  hiya, Al -- fixing dents in cars\n                  is one thing, a career's another.\n                  Here, you're getting in on the\n                  ground floor of the first footstep\n                  of a new leaf -- hi, Wally, how's\n                  the old backhand? And with a guy\n                  like me ta show you the ropes, you\n                  can skip all the red tape, all the\n                  malarky, all the dino doo --\n\n                                                              22.\n\n45   NEW ANGLE                                                      45\n     Fred stands near the weight station booth, where a plump\n     GIRL in a beehive hairdo sits inside a trailer.\n\n                               GIRL\n                        (New York accent)\n                 Hi, Mr. Flintstone.\n\n                               FRED\n                 Hiya, Shirley. This is my very\n                 special neighbor and pal Barney\n                 Rubble. He needs an application\n                 form, okay?\n                               GIRL\n                 Anything for you, Mr. Flintstone.\n\n     She slams down two clay tablets and a stylus.\n                               GIRL\n                 Here you go.\n                        (smiling)\n                 Thanks again for the football tickets.\n                 My boyfriend and I both liked them.\n\n                               FRED\n                 My pleasure, Shirl.    Anytime.\n                               GIRL\n                 Okay. But do you think next time\n                 we could go to the same game?\n                               FRED\n                        (confidently)\n                 No problem.\n     Fred smiles at her, hands the forms to Barney. Fres steps\n     towards the quarry, admires the activity, hands on hips,\n     master of all he surveys. He waves to more friends.\n                               FRED\n                 Well, Barn, what did I tell you?\n                 When you're in with Flintstone,\n                 you're in like Flint.\n                              BARNEY\n                 Gee, Fred. I knew you were a big\n                 shot. I just didn't know how big.\n     Fred beams at that, and then follows Barney's gaze to\n     the read-out on the truck scale. Fred is standing on it\n     and it's pushing 250. With a scowl, Fred grabs Barney's\n     sleeve and they go into the quarry. As they move, the\n     CAMERA PANS and CRANES UP TOWARDS the window of the\n     Slate Construction Office.\n\n                                                    CUT TO:\n\n                                                         23.\n\n46   INT. OFFICE - PULLBACK FROM WINDOW                        46\n     The room here is dominated by a tabletop architectural\n     model of a large scale construction project. There's\n     acres of little development houses, then some tall office\n     buildings, a mall, you name it: There's even little foot-\n     powered model cars in the model parking spaces.\n\n     Near this we see MR. SLATE, a giant in the Bedrock con-\n     struction business (but not in height). Slate drinks\n     coffee from a \"Boss\" mug, listens with growing impatience\n     to JERRY LAVA. Several of Slate's lackeys listen, their\n     heads nodding up or down in sympathy with Slate's mer-\n     curial moods.\n                             LAVA\n               Uncle, if you'll look at this unit\n               cost projection... it intersects\n               here with --\n                             SLATE\n               -- how'd you like my fist to\n               intersect with your nose? I've\n               told you a hundred times, don't call\n               me uncle in the office! Now, I didn't\n               arrange your scholarship to Harvrock\n               University so you could waste my time!\n               So stop beating around the bushasaurus\n               and get to the bottom slime!\n                             LAVA\n               You'll be bankrupt in six months.\n     Slate does a Danny Thomas spit take all over the model.\n47   EXT. QUARRY - MOVING SHOT                                 47\n     Fred and Barney cross the busy lot, sidestepping workers\n     and animals. Fred does a lot of backslapping, waving.\n     Barney's filling out the forms on the move. Behind them,\n     we see the wide access ramp which spirals around the\n     quarry's sides.\n\n                             BARNEY\n                      (to himself)\n               Social Security number...\n               dependents... 'how learned of job'\n               ... newspaper ad, carrier pigeon...\n                      (writing)\n               ... Personal reference...\n     Hearing a loud SMASH, Fred looks up and sees --\n\n48   FRED'S POV - A WRECKING BALL OPERATOR                     48\n     A burly and rough looking guy named PILTDOWN, he grins in-\n     side his dino-topping cupola, winds his winch handles and\n     then propels his wrecking ball towards the...\n\n                                                            24.\n\n49   QUARRY WALL - ABOVE                                          49\n     -- where the huge stone BALL SMASHES into some walnuts\n     balanced on a boulder.\n\n50   WIDER                                                        50\n     Piltdown's compact buddy PYRITE cackles, sweeps  up the\n     walnuts. Munching them, he balances a new one   in place.\n     (It should be noted here that the relationship  and physi-\n     cal appearances of Piltdown and Pyrite mirrors  that of\n     our heroes... they're sort of an anti-Fred and  Barney.)\n\n                             PYRITE\n               Way ta go, Pilty baby. Five bucks\n               says you can't hit one on the fly.\n\n                             PILTDOWN\n                      (calling up)\n               Yer on, Pyrite --\n     Pyrite tosses a walnut, which bounces on the ledge.    The\n     wrecking BALL SMASHES into the stone wall.\n51   BELOW                                                        51\n\n     Workers near Fred duck as dust and debris fall down.\n     People grab for their construction helmets.\n                              FRED\n               Not again...\n     Fred hustles up a ladder to a ramp which leads him up to\n     the level of Piltdown's cab. Barney hurries to follow.\n                             FRED\n               All right, Piltdown, that's enough!\n               You're endangering your fellow\n               workers!\n\n                              PILTDOWN\n               Yeah?   Sez who?\n\n                             FRED\n               Says me, Fred Flintstone -- shop\n               steward of Amalgamated Neolithic\n               Workers 101.\n\n                             PILTDOWN\n               Yeah? Well, A.N.W. one-oh-one gives\n               us workers a snack break. So...\n                      (a nasty grin)\n               ... I'm breakin' some snacks.\n\n     He swings the wrecking ball again.\n\n                                                          25.\n\n52   UP ABOVE                                                    52\n     This time he's overdone it:   The wrecking ball flies past\n     the walnuts -- Pyrite ducks  for cover -- and then the\n     wrecking ball whips over and  around the handrail which\n     runs along here, twisting as  tightly as Indiana Jones'\n     whip. The handrail wobbles   dangerously in its\n     foundation --\n\n53   PILTDOWN'S DINO                                             53\n     SNORTS, backs up -- the crane SUPPORTS on its back begin\n     to CREAK and GROAN with the strain --\n\n54   WIDER                                                       54\n     Workers scatter, fearful of the imminent collapse.   Fred\n     runs to grab the dino's reins.\n\n                              FRED\n                Whoa, whoa, big fella --\n     He calms the beast by giving it a carrot.   As it munches,\n     Fred quickly ties the reins to a post.\n                              FRED\n                       (calling up to the cab)\n                You're on report, Piltdown! If it's\n                up to me you'll be pushing a\n                wheelbarrow!\n\n                              PILTDOWN\n                       (leaping down)\n                You've been asking for this,\n                Flintstone... I'm gonna kick your\n                fat butt --\n                              FRED\n                Fat butt? Hold me back, Barney --\n                       (sotto, very sincere)\n                -- Barney, hold me back --\n     Quickly the men form a circle around Piltdown and Fred.\n     Barney looks up and sees --\n55   THE CRANE ON THE DINO'S BACK                                55\n\n     It is shuddering and threatening to come crashing down.\n\n56   BACK TO SCENE                                               56\n                              BARNEY\n                Hey, maybe you guys oughta fix\n                that first.\n                              PILTDOWN\n                Why should we?\n                                                 (CONTINUED)\n\n                                                           26.\n\n56   CONTINUED:                                                  56\n                                BARNEY\n                  It looks dangerous. Besides, you\n                  can kick Fred's fat butt anytime.\n                                FRED\n                  Yeah.  That's right.\n                         (realizing, a glare\n                          at Barney)\n                  I mean -- this ain't over, Piltdown.\n                         (turning, shouting)\n                  Come on, guys. Let's clean up the\n                  mess.\n     With much grumbling, ropes and grappling hooks are\n     gathered and the crew hops to it...\n\n57   INT. SLATE'S OFFICE - SAME TIME                             57\n     Slate stands in a blubbering fury as Lava mops coffee up\n     from the model and Slate's face.\n                                 SLATE\n                  Bankrupt?   Are you crazy?\n\n     Lava holds up a clay tablet covered with figures.\n                                LAVA\n                  It's all here in hack and slice.\n                  When you committed to this housing\n                  development the price of dino kibble\n                  was a few clams per ton. Since then,\n                  it's gone up a hundredfold.\n                         (indicating the model)\n                  You can't build a project like this\n                  without the heavy equipment dinos,\n                  and we can't afford to feed those\n                  dinos.\n\n     Slate glowers, paces around the model.\n                                SLATE\n                  I'm two months behind schedule, my\n                  option's running out on the land\n                  and Donald Trumprock is just waiting\n                  to jump in and steal the whole deal\n                  ... meanwhile that damn union's on\n                  my back, hell, they'll probably want\n                  an eighty hour week or something...\n                         (frustrated)\n                  There's got to be an answer...\n\n     A LOUD COMMOTION outside the window attracts everyone's\n     attention.\n                                                  (CONTINUED)\n\n                                                              27.\n\n57   CONTINUED:                                                      57\n                                 SLATE\n                  What's that?\n\n                                LAVA\n                         (worried)\n                  Sounds like a worker's comp claim\n                  if I ever heard one...\n\n     All rush to the window.       They look out and see --\n58   THE QUARRY - WIDE                                               58\n\n     Supervised by   Fred, all    the workers are straining on the\n     ropes to haul   the rear    legs of the crane back into their\n     sockets on the   back of    the big dino. Only the last\n     critical rope   is still    dangling.\n\n                                 FRED\n                  Barney!   Grab that line!   Hurry!\n     Barney scrambles up Fred's back, shoving a foot in Fred's\n     face, but finally snatching the rope. He pulls on it...\n     Fred throws his own weight into the effort...\n\n59   THE CRANE                                                       59\n     THUDS into place on the dino's back -- the workers cheer --\n60   THE WRECKING BALL                                               60\n     alas, with its cable now twisted shorter, it's become an\n     immovable object, and as the shortened CABLE SNAPS, the\n     wrecking ball begins to roll down the quarry wall.\n\n61   NEW ANGLE                                                       61\n     Men and ANIMALS YELP and dive out of the way as the BALL\n     rolls downwards, SMASHING everything in its path.\n62   EXT. SLATE'S OFFICE WINDOW                                      62\n\n     The executives watch concerned as --\n63   THE WRECKING BALL                                               63\n\n     tumbles down, down, knocking scaffolding and ladders\n     aside, reaches the end of a ramp, and drops through the\n     air right onto --\n64   THE HOOD OF FRED'S CAR                                          64\n\n     -- where, astonishingly, the HOOD sinks in resiliently\n     like a trampoline and then with a loud \"SPROING\" the\n     wrecking ball flies straight back up into the air,\n     followed a beat behind by the unhinged hood itself.\n     Both hurtle TOWARDS the CAMERA --\n\n                                                             28.\n\n65   SLATE AND EXECUTIVES                                          65\n     react fearfully as they realize all this is coming\n     straight for them. With a howl, they all dive aside --\n\n66   INT. SLATE'S OFFICE - WIDER - DAY                             66\n     The wrecking BALL flies through the window, SLAMS onto\n     Slate's desk, crushing everything in its path and then\n     sails on SMASHING right into --\n67   THE MODEL DEVELOPMENT                                         67\n\n     -- where all of the lined up HIGH RISES SMASH ASIDE with\n     a sound like falling pins.\n68   IN THE QUARRY                                                 68\n\n     The workers pick themselves up and now their eyes follow\n     the path taken by the long-gone wrecking ball.\n                               FRED\n               Oh boy.    Goodbye pension fund --\n     They rush for the office building.\n\n69   INT. SLATE'S OFFICE - DAY                                     69\n     Dust is still settling. The staff rises from the mess,\n     coughing. Lava rummages in the debris, finds a stiff\n     body.\n                             LAVA\n               Uncle, Uncle, speak to me --\n     But it's only a statue of a golfer from one of Slate's\n     trophies.\n                             SLATE\n                      (sitting up)\n               I'm over here, you moron -- and\n               don't call me 'Uncle'!\n\n     Slate's eyes fall on Fred's car hood, swinging from a\n     bookshelf. He reaches for it -- pulls it -- it stays\n     put, and only releases a new deluge of rubble and plaster\n     which reburies him. At the same time, the door slams\n     open and Fred, Barney and the other workers tumble inside.\n\n70   THEIR POV - OFFICE                                            70\n     As they take in the destruction. Barney notices the\n     wrecking ball amidst the model buildings. As we watch,\n     the last remaining little HIGH RISE FALLS.\n                                                    (CONTINUED)\n\n                                                               29.\n\n70   CONTINUED:                                                      70\n                                BARNEY\n                  Hey, nice going, Fred.   You even\n                  got the spare --\n                                FRED\n                  Barney, shut up --\n                         (turning)\n                  Mr. Slate -- Mr. Slate -- are you\n                  all right?\n     Slate staggers to his feet, seething with fury. He\n     finally yanks the car hood free. It bounces and VIBRATES\n     in his hands like a hand saw.\n                                SLATE\n                         (eying the men)\n                  For five years Slate Construction\n                  has had the finest safety record\n                  in Bedrock.\n                         (pacing, angry)\n                  Our workers are trained in first\n                  aid, our equipment is first rate\n                  and our dinos are worm free. And\n                  then something like this happens\n                  ... I want to know how!\n     A cacophony of voices starts to answer.\n                                SLATE\n                  Shut up!\n                         (in the sudden silence)\n                  I want one person to answer me:\n                         (waving the car hood)\n                  Who's responsible for this?\n71   PILTDOWN                                                        71\n\n     nudges the wrecking ball off the edge of the table. It\n     falls on Fred's foot. Fred starts to scream and Piltdown\n     shoves a pencil holder into his mouth.\n\n                                PILTDOWN\n                         (quickly)\n                  It was Flintstone, Mr. Slate!\n\n                                PYRITE\n                  That's right, Mr. Slate, it was\n                  Flintstone!\n                                BARNEY\n                  That's a lie, Mr. Slate!\n\n                                 SLATE\n                  Who are you?\n\n                                                      (CONTINUED)\n\n                                                                 30.\n\n71   CONTINUED:                                                        71\n                                BARNEY\n                         (pointing to his forms)\n                  B. Rubble. White male personal\n                  reference --\n                                SLATE\n                         (pushing Barney aside)\n                  Flintstone, I have just one thing\n                  to say to you --\n     Fred cringes.       Piltdown and Pyrite smirk.\n\n                                SLATE\n                         (pumping his hand)\n                  Congratulations!\n\n                  FRED                                PILTDOWN\n        Huh?                               What?\n                                SLATE\n                  This stuff you had on your car is\n                  the most incredible building\n                  material I've seen in thirty years\n                  in the construction business!\n                         (testing it)\n                  It's strong --\n                         (twirling it)\n                  -- Light --\n                         (bending it)\n                  -- Resilient --\n     It rebounds, \"SPROINGING\" him on the chin.        He recovers,\n     shakes it off.\n\n                                SLATE\n                  Where on earth did you get it?\n\n                                FRED\n                  Oh, it's ah, just something I\n                  whipped up in the old garage\n                  workshop --\n                         (quickly)\n                  -- with a little help from my\n                  buddy Barney, right, Barn?\n\n                                BARNEY\n                  Well, actually, Fred, it was the\n                  other way ar--\n     Fred hisses between his teeth, repeats the \"Slate and me\n     are just like this\" gesture he made earlier, points at\n     Slate.\n                                                      (CONTINUED)\n\n                                                              31.\n\n71   CONTINUED:    (2)                                              71\n                                BARNEY\n                         (reluctant)\n                  Sure, Fred, right, right.\n     Slate nods, distracted, his eyes and hands running over\n     the smooth lines of the car hood.\n\n                                SLATE\n                  The rest of you men go back to work.\n                  I want to talk to Flintstone and\n                  the personal reference alone. Come\n                  on, move, move...\n     They go out, Piltdown looking furious.\n\n                                 SLATE\n                          (a man in love)\n                  Light  as a Pterodactyl feather...\n                  why, a  child could handle this...\n                  Lava,  we could cut construction\n                  costs  in half... in quarters... in\n                  uh...  whatchacallit --\n                                LAVA\n                         (patiently)\n                  Eighths --\n                                SLATE\n                  Eighths, right. Flintstone, what\n                  do you call this stuff?\n                                FRED\n                  Well, Mr. Slate, I call it --\n                         (hesitating, sotto)\n                  -- Barney, what do I call it?\n                                BARNEY\n                         (sotto)\n                  Fibrerock, Fred...\n                                FRED\n                  -- I call it Fibrerock Fred -- !\n                         (realizing)\n                  I mean, ah, 'Fibrerock'!\n\n                                SLATE\n                         (rolling it over\n                          his tongue)\n                  'Fibrerock'? 'Fibrerock'?\n                         (playing with it)\n                  'Fib-bre-rock' --\n\n     Slate's staff make disparaging noises.\n                                                     (CONTINUED)\n\n                                                                32.\n\n71   CONTINUED:    (3)                                                71\n                               SLATE\n                  I love it!\n\n                                 SLATE'S STAFF\n                         (instantly reversing\n                           themselves)\n                  Love it... great... has a nice\n                  ring... says it all, you know?\n                  (Etc...)\n     Slate takes the piece of material, leans it on the table\n     so it catches the light. Despite himself, Lava comes\n     over, examines the car hood... can't help but marvel at\n     it as well. Meanwhile, Slate puts his arms around Fred\n     and Barney.\n\n                                SLATE\n                         (to Lava)\n                  You see this, Lava? All those\n                  courses of yours at Harvrock\n                  University, and who saves my bacon?\n                  Two simple-minded run-of-the-mill\n                  nobodies.\n\n                                BARNEY\n                  Gee, thanks, Mr. Slate.\n     Lava glowers. Slate pulls Fred and Barney close with\n     genuine excitement.\n                                SLATE\n                  Boys, this is a small step for\n                  Slate Construction... a giant step\n                  for all mankind.\n     He points to the translucent material. CAMERA TIGHTENS\n     ON it. We see Fred, Barney and Slate's reflections in it.\n\n                                SLATE\n                         (dramatically)\n                  The Stone Age is over!    Let the\n                  Fibre Age begin!\n     As HEROIC MUSIC STINGS IN, we...\n\n                                                      CUT TO:\n\n72   BETTY'S CAR - TRAVELING - DAY                                    72\n     Mrs. Slate is in back, crammed in with groceries. Betty\n     pulls up in front of a building that looks like a Palm\n     Springs spa. This is \"L'ECOLE DES ENFANTS PREHISTORIQUE\n     HAUTE SUPERIOR.\"\n                                                      (CONTINUED)\n\n                                                                33.\n\n72   CONTINUED:                                                       72\n                                BETTY\n                  Here we are, Mrs. Slate.       Sorry you\n                  had to ride in the back.\n                                MRS. SLATE\n                         (getting out)\n                  Not at all. I'm used to being\n                  driven around.\n     And she's sashaying up the path.       Betty and Wilma burn,\n     then follow her.\n\n73   INT. SCHOOL - DAY                                                73\n     As elegant as we can get MMMCXV years before Louis XIV.\n     As the three women come in, we see CHILDREN with alliga-\n     tors on their deerskin shirts singing:\n                                CHILDREN\n                  'La hachette de ma tante\n                  est sur le roche de mon oncle -- '\n                                HEADMISTRESS\n                         (coming over, gushing)\n                  Madame Mrs. Slate, bonjour!\n                  Welcome to L'ecole des Enfants\n                  Prehistorique Haute Superior!\n                                MRS. SLATE\n                  Thank you, Marie.\n                         (showing a rock receipt)\n                  I ordered the hors d'oeuvres for\n                  the junior talent show. They were\n                  out of Ceolanth caviar so I got\n                  Mastodon brie instead. Oh, ah,\n                  these are my, uh, friends, Wilma\n                  Flintstein --\n\n                                  WILMA\n                  Flintstone --\n\n                                MRS. SLATE\n                  -- oh, it used to be Flintstein -- ?\n                  And this is ah, Becky... Betty!\n\n     The Headmistress reaches over, takes their hands\n     gracefully.\n                                  HEADMISTRESS\n                  Enchante.\n\n                                  WILMA\n                  I'm sure.\n                                                       (CONTINUED)\n\n                                                            34.\n\n73   CONTINUED:                                                   73\n                               BETTY\n                  Likewise.\n\n                                HEADMISTRESS\n                         (waving a hand)\n                  Well, Madame Slate, as you can see,\n                  we remain ze creme de la creme in\n                  the croissant of life known as\n                  Bedrock. Now, your leetle gran'\n                  nephew will be wiz us for two weeks,\n                  no?\n                         (opening a drawer)\n                  Here is ze application for him. An'\n                  mais oui, he weel participate in zee\n                  annual talent show, naturalment?\n\n     Mrs. Slate takes the parchment application. Meanwhile\n     the Headmistress looks appraisingly at Wilma and Betty.\n                                HEADMISTRESS\n                  An' your friends perhaps would like\n                  zum school applications for zere\n                  enfants?\n\n                                MRS. SLATE\n                         (amused)\n                  Them? Oh, Marie, really, you don't\n                  understand --\n\n                                BETTY\n                         (suddenly)\n                  That's right, you don't understand.\n                  My husband's business manager usually\n                  handles this sort of thing, but I\n                  don't mind.\n     And to Wilma's astonishment, Betty takes one of the\n     parchments.\n                                BETTY\n                  I know Bam-Bam --\n                         (correcting herself)\n                  -- pardonez-moi, 'Bem-Bem' will love\n                  attending your school and performing\n                  in the talent show. Thank you oh\n                  so much.\n\n     She gives Mrs. Slate an even and controlled look, and\n     sends some of it over in Wilma's direction as well.\n     Wilma makes her choice, smiles tightly.\n\n                                WILMA\n                  Let me have one of those, too.   For\n                  ma petite Pebbles.\n\n                                                   (CONTINUED)\n\n                                                              35.\n\n73   CONTINUED:    (2)                                              73\n                                HEADMISTRESS\n                  Of course. Any friend of Madame\n                  Slate is a friend of mine.\n     As Mrs. Slate reacts, we --\n\n                                                    CUT TO:\n\n74   INT. CAR - FRED AND BARNEY - NIGHT                             74\n     They're cruising along. Fred puffs on a cigar. Barney\n     flips the pile of legal sized tablets in his lap. In the\n     back seat are some boxes and bundles.\n                                BARNEY\n                  Gee, Fred, I don't believe it.\n                  Eight hours ago I didn't have a\n                  job and now look -- I got 1/2 of\n                  one percent of the after-taxes\n                  after-expenses net breakage profits\n                  on Fibrerock!\n                                FRED\n                  Just be thankful I was there to go\n                  over the fine print.\n                         (full of himself)\n                  It's like I told you this morning\n                  -- There's something noble about a\n                  man digging in with his hands and\n                  doing an honest day's work. Once\n                  you file those dreams under 'old\n                  business' and put your nose to the\n                  plow, well, the world is your\n                  oyster. And was I right?\n                                BARNEY\n                  No, Fred, you weren't. I didn't\n                  nose any grindstones and you didn't\n                  shoulder a wheel. We just hung out\n                  together and everything that\n                  happened was a total accident.\n\n                                FRED\n                         (after a moment)\n                  Details, Barney, details...\n                         (smiling)\n                  I just can't wait to see the girls'\n                  faces when we tell 'em the news...\n75   INT. FLINTSTONE HOUSE - NIGHT                                  75\n\n     The girls' frowns are a great contrast to their husbands'\n     smiles. Wilma's looking at the school enrollment forms.\n     Betty paces, looks at the clock.\n\n                                                    (CONTINUED)\n\n                                                              36.\n\n75   CONTINUED:                                                     75\n                                WILMA\n                         (seeing this)\n                  It's not like the boys to be so\n                  late.\n                                BETTY\n                  Unless they were forced to go\n                  bowling again. Remember that time\n                  a burglar pointed a gun at them\n                  and said, 'go bowling right now'?\n\n                                WILMA\n                  Betty, sometimes you're a little\n                  too gullible --\n\n                                BETTY\n                  Don't tell me. I still can't\n                  believe what I did today...\n                                WILMA\n                  No kidding.\n                         (indicating the forms)\n                  Do you have any idea of what the\n                  enrollment fee is? And get this...\n                  it's non-refundable --\n                                BETTY\n                  I know, I know! I just couldn't\n                  stand that woman's attitude! But\n                  we had to find a new school anyway,\n                  and there we were... the next thing\n                  I knew, I was in over my head...\n                  but why did you jump in, too?\n\n                                WILMA\n                  Oh, she was getting to me too with\n                  all that mastodon snort about her\n                  little nephew... and...\n                               BETTY\n                  And?\n\n                                WILMA\n                  And... if a friend can't help you\n                  do something stupid, who can?\n\n     Betty smiles, touched.    Then reality intrudes again.\n                                BETTY\n                  What do we tell the boys?\n\n                                WILMA\n                  What's wrong with the truth?\n                                                     (CONTINUED)\n\n                                                               37.\n\n75   CONTINUED:    (2)                                               75\n                                BETTY\n                  We put ourselves in debt so the\n                  kids can attend school with a\n                  family we can't stand?\n                                WILMA\n                         (pause)\n                  Maybe we could rephrase it...\n     Suddenly the door bursts open.     Fred and Barney run in\n     with candy and flowers.\n\n                                FRED AND BARNEY\n                  Surprise!\n\n     Pause.\n\n                                BETTY\n                  Flowers?\n                                 WILMA\n                  Rock candy?   That's nice, but...\n                  why?\n\n                                FRED\n                  Why? Oh, me and Barn, we suddenly\n                  realized that we had a little spare\n                  change.\n\n                                WILMA\n                         (sotto)\n                  Not anymore you don't...\n                                BARNEY\n                         (presenting flowers)\n                  Betty, these are for you. For\n                  sticking beside me during the\n                  tough times, and well... for\n                  making a little guy feel like he\n                  was ten feet tall.\n\n                                BETTY\n                  Aw, Barney... I... I don't deserve\n                  these. I did something really\n                  stupid today.\n\n                                BARNEY\n                  Hey. Fred does something stupid\n                  every day and I still love him.\n\n     Fred laughs good naturedly, grabs Barney in a headlock.\n\n                                FRED\n                  Noogy, noogy, ha, ha -- !\n\n                                                      (CONTINUED)\n\n                                                              38.\n\n75   CONTINUED:    (3)                                              75\n                                WILMA\n                         (observing this)\n                  Have you been drinking?\n     In reply, Fred whips a bottle of champagne into view.\n\n                                FRED\n                  Ready when you are.\n                         (noticing the label)\n                  Hey, '1'... a good year.\n\n     This confuses the girls even more.\n                                WILMA\n                  Fred, there's no easy way to say\n                  this so --\n\n     She closes her eyes, swings the enrollment forms over on\n     the table so that Fred and Barney can read them.\n     Fred and Barney look at them, look at each other... and\n     yawn.\n76   FAVORING WILMA AND BETTY                                       76\n     They can't believe this.\n                                BETTY\n                  Boys... did you see... the dollar\n                  signs there at the bottom?\n                                WILMA\n                  The non-refundable dollar signs?\n\n                                BARNEY\n                  Plenty more where that came from.\n\n                                FRED\n                  We see your dollar signs, ladies...\n                  and...\n\n     He tosses his stone contracts on top of the parchment\n     ones with a THUD.\n                                FRED\n                  ... we raise them.\n\n     Wilma and Betty look at each other, then at the contracts.\n     They blink, look again.\n\n                                WILMA\n                  Betty... these... these look...\n                  real --\n                                                     (CONTINUED)\n\n                                                             39.\n\n76   CONTINUED:                                                    76\n     Fred opens the champagne, which foams all over them.        The\n     girls squeal.\n\n                                FRED\n                  You bet they're real, sweetheart.\n                  They're as real as... as... well,\n                  as real as --\n                         (embracing the group)\n                  -- the best darn friends and\n                  neighbors in the whole world.\n\n     Barney squeezes back.\n                                BARNEY\n                  Yeah. And nothing's ever gonna\n                  change that... right, Fred?\n\n                                FRED\n                         (emotionally)\n                  Right, pal o'mine.\n     As they laugh and the girls slowly absorb the truth,\n     we --\n\n                                                   CUT TO:\n77   EXT. WATER BUFFALO LODGE - NIGHT                              77\n     A sign proclaims this as \"GRAND BEDROCK LODGE -- LOYAL\n     ORDER OF WATER BUFFALO.\" The parking lot outside is full\n     of vehicles. We hear the sound of a GAVEL BANGING...\n                                HERDMASTER (V.O.)\n                  Attention, fellow Water Buffaloes...\n78   INT. WATER BUFFALO LODGE - NIGHT                              78\n\n     The members are milling about the main room, schmoozing,\n     drinking, kibitzing. All wear the furry and horned\n     ceremonial Fez of the Buffalo.\n\n     One wall of the lodge displays a big version of the lodge\n     coat of arms (with the motto \"Ackus Ackus Adackus\" below);\n     a trophy case holds a mind boggling display of various\n     bowling trophies, balls and pins. At the lectern, the\n     HERDMASTER (a mustachioed, inspirational type) bangs\n     again for order.\n                                HERDMASTER\n                  Brothers, your attention!\n\n     It quiets a bit. He clears his throat, raises his chin,\n     and gives a strange mournful bellow.\n                                                   (CONTINUED)\n\n                                                           40.\n\n78   CONTINUED:                                                  78\n                                 HERDMASTER\n                         (\"ritual\" type tone)\n                  The herd is now called to the\n                  prairie.\n                         (holding fingers\n                           above ears)\n                  Antlers... up!\n\n     The entire Lodge dutifully imitates this gesture.\n                                ENTIRE GROUP\n                  Ack-ack-a-dack!\n                                HERDMASTER\n                         (banging gavel)\n                  This meeting of the Water\n                  Buffaloes is now in session.\n                  Sergeant-at-Arms, have we got any\n                  old business?\n     Barney stands, acknowledges his friends and Lodge\n     brothers.\n                                BARNEY\n                  Indeed we do, Brother Herdmaster.\n                  Tonight we are to hear speeches\n                  from prospective candidates for\n                  Lodge offices, such as good old\n                  Fred and some other guys.\n79   PILTDOWN                                                    79\n     Seated across the room with Pyrite and other cronies, he\n     immediately leaps to his feet, paws the ground, and gives\n     an eerie moan even stranger than the Herdmaster's earlier\n     call to order.\n\n80   BACK TO SCENE                                               80\n     After the CRY ECHOES away:\n\n                                HERDMASTER\n                  Brother Piltdown: You have given\n                  the Cry of the Gelded Buffalo at\n                  the Poisoned Water Hole. Do you\n                  wish to file an objection?\n\n                                PILTDOWN\n                  You bet I do. How come Flintstone\n                  is 'good old Fred' and me and the\n                  other candidates are just 'some\n                  other guys'?\n                                PYRITE\n                  Yeah, how come?\n                                                  (CONTINUED)\n\n                                                           41.\n\n80   CONTINUED:                                                  80\n                                BARNEY\n                         (rising)\n                  My apologies, Brother Piltdown.\n                  Allow me to rephrase. Tonight we\n                  will hear speeches from a whole\n                  bunch of good old guys...\n                         (pause)\n                  ... plus the one and only Fred\n                  Flintstone!\n     Cheers go up, which drown out Piltdown's renewed cry of\n     the poisoned water hole. Fred moves towards the podium\n     as the noise dies down.\n81   NEW ANGLE                                                   81\n\n     Barney moves to the wall, where he pulls a rolled up\n     tapestry from a hiding place behind a plant. He tacks it\n     to the wall, yanks a string. It unrolls. It's a big\n     \"VOTE FOR FRED FLINTSTONE\" poster.\n     Barney turns, gives Fred a \"thumbs up,\" and as he does,\n     Barney's hand brushes against a folded parchment in his\n     pocket. Barney pushes his way through the seats, catches\n     up to Fred and hands him the document. Fred takes it,\n     continues up to the podium. There, the Herdmaster hands\n     Fred the ceremonial hoof and antler, crossed over each\n     other like a Pharaoh's badges of office.\n\n     Fred does a Papal-like wave with these, sets them down,\n     and unrolls the crib notes Barney gave him.\n                                FRED\n                         (reading, at first\n                          wooden, then\n                          confident)\n                  Brother Buffaloes, honored\n                  Herdmaster, Junior Bucks and\n                  Apprentice Antlers, a great good\n                  evening to you all. Ahem. As you\n                  know, our organization has survived\n                  difficult times that have seen the\n                  extinction of such other lodges as\n                  the Order of Whooping Cranes and\n                  Brotherhood of Giant Sloths. But\n                  we here have come through the croo\n                  ... the crux...\n                                BARNEY\n                         (hissing)\n                  -- crucible --\n\n                                                  (CONTINUED)\n\n                                                            42.\n\n81   CONTINUED:                                                   81\n                                FRED\n                         (grateful)\n                  -- crucible with our fur fluffy\n                  and our hooves unscathed. Now,\n                  the future holds many promises and\n                  many problems. As your next\n                  Herdmaster, I would bring to you\n                  the same determination, courage\n                  and -- if I may say so -- bold\n                  thinking that I have brought to\n                  the workplace. Thank you, and\n                  ack ack a-dack.\n     Applause follows Fred's return to the floor.\n\n82   PILTDOWN AND PYRITE                                          82\n\n     The only ones in their row not clapping, they scowl as\n     Fred passes them...\n                                                  CUT TO:\n83   INT. LODGE - RECREATION AREA - LATER                         83\n\n     WIDEN as Barney propels   a bowling ball (stone, of course)\n     rumbling down the alley,   sending pins flying. The\n     Buffaloes cheer Barney's   strike. We notice that most (if\n     not all) of these Lodge   members also work at the quarry.\n\n84   AUTOMATIC PIN SPOTTER                                        84\n     It descends.    It consists of a bent snout creature which\n     \"cranks\" down   a shelf with several monkeys on it. The\n     monkeys grab   the pins with their tails, straighten them\n     up. Then the    shelf cranks back up.\n85   OTHER END OF ALLEY                                           85\n\n     Now it's Fred's turn. He trots up to the line, bowls...\n     another strike! More cheers, AD LIB complaints, etc.\n     The scorekeeper picks up hammer and chisel and fills out\n     the last frame.\n                                LODGE MEMBER\n                  Congratulations, Fred.\n\n                                FRED\n                  Hey, when you're hot you're hot...\n                  boys, lemme buy a round of drinks\n                  for everyone.\n\n                                BARNEY\n                  Thanks, Fred, but here at the\n                  lodge drinks are free.\n\n                                                  (CONTINUED)\n\n                                                            43.\n\n85   CONTINUED:                                                   85\n                                FRED\n                  But the principle is the same,\n                  Barn. Don't forget that.\n     Fred leads the group over to the bar. Piltdown and\n     Pyrite come along with a shrug... why not, for a brew?\n     Fred reaches --\n\n86   UNDER THE COUNTER                                            86\n     where he pulls out a hook-beaked little LIZARD --\n\n87   BACK TO SCENE                                                87\n     Fred uses this creature to open several beers.\n\n                                FRED\n                         (during this)\n                  Here you go, boys, nice and\n                  frosty...\n                                \"BOTTLE OPENER\" CREATURE (LIZARD)\n                         (aside)\n                  Go ahead, laugh. If I had a good\n                  orthodontist, my life woulda been\n                  different...\n     Fred tosses the \"Opener\" aside --\n\n88   UNDER THE COUNTER                                            88\n     The critter bounces into the shelf, slides... when it re-\n     covers, it realizes that its overbite has been straightened\n     out by the impact. Very happy, it grabs a hat and coat,\n     exits.\n89   BACK TO SCENE                                                89\n\n                                FRED\n                         (raising drink)\n                  Well, here's to...\n\n     He looks around, sees --\n90   \"PHOTO\" ON WALL                                              90\n\n     It's actually \"dots\" chipped into a stone. It shows the\n     young Fred, Barney and others gathered around soapbox\n     racers. A banner reads \"Junior Buffalo Day.\"\n\n                                                         44.\n\n91   BACK TO SCENE                                              91\n                             FRED\n               Here's to the greatest bunch of\n               lifelong Buffaloes a guy could\n               dream of leading.\n                      (an obvious prompt)\n               Anybody else got a toast...?\n\n                             BARNEY\n               'Here's to the Water Buffalo and\n               their next Herdmaster... Fred'!\n\n                             FRED\n               Aw, gee, Barn... you shouldn't say\n               that...\n                      (winking)\n               ... at least not till after next\n               week's election!\n                             LODGE MEMBER\n               Fred, what was all that stuff in\n               your speech about the workplace?\n               I thought the only decision you\n               made there was how many lunches to\n               eat --\n     Laughter. Fred accepts it good-naturedly, reaches into\n     his pocket.\n                             FRED\n               Well, Harry, it just so happens\n               that old Fred is moving up in the\n               world... Boys, you're looking at\n               Mr. Slate's new partner.\n\n                             PILTDOWN\n               You and Slate? Who are you\n               kidding, Flintstone? The only\n               partner you got is hanging over\n               your belt.\n     Pyrite laughs, a bit too much.\n\n                             FRED\n               Prepare to eat those words,\n               Piltdown.\n\n                             PILTDOWN\n               -- If I don't, you will --\n                             FRED\n                      (a tight smile)\n               Gentlemen, my card --\n     He passes them out, and the others take them, curious --\n\n                                                           45.\n\n92   INSERT - CARD                                               92\n     Of course it's a little stone tablet... but it does\n     indeed say \"SLATE CONSTRUCTION -- F. FLINTSTONE,\n     ASSISTANT JR. V.P. -- PUBLIC RELATIONS.\"\n93   BACK TO SCENE                                               93\n\n                             LODGE MEMBERS\n                      (AD LIB, impressed)\n               Hey, way ta go, Fred... Whoa,\n               gonna switch from a hard hat to\n               a top hat, Freddy boy...?\n\n                             PYRITE\n                      (examining the card)\n               Ah, it's probably a phony...\n\n     Saying this, he bites down on it... winces as a tooth\n     cracks.\n94   BARNEY                                                      94\n     tugs Fred's sleeve, pulls him close.\n                             BARNEY\n               Gee, Fred, how come I didn't get\n               any business cards?\n                             FRED\n               Barney, it's all part of the plan.\n                      (to the others)\n               Yes, boys, you see, I went up to\n               my pal, Mister Slate and single-\n               handedly made him an offer he\n               couldn't refuse --\n     (Barney reacts to the \"single-handedly\" --)\n\n                             FRED\n               -- 'Freddy boy,' he sez to me,\n               'We gotta talk turkey -- '\n\n                             BARNEY\n               Fred, we gotta talk turkey --\n                             FRED\n               That's right -- just like that --\n\n                            BARNEY\n               Fred -- !\n\n     Fred realizes Barney's got something on his mind.\n\n                             FRED\n               Ah, excuse us, boys...\n\n                                                             46.\n\n95   NEW ANGLE                                                     95\n     Fred pulls Barney into a quiet corridor. They stand near\n     a trophy case. There's some bowling trophies here with\n     a variety of names on them. (There's also trophies for\n     \"pie-eating contests\" and \"beer drinking chug-offs\";\n     these have only Fred's name on them.)\n\n                               BARNEY\n                 Fred... what's this single-handed\n                 stuff? I distinctly remember at\n                 least four hands and two of them\n                 were mine.\n\n                               FRED\n                        (lowered voice)\n                 Barney, we could tell everyone how\n                 you invented this Fibrerock stuff,\n                 how Slate and Lava found out about\n                 it by accident and all, but what\n                 would that be?\n                              BARNEY\n                 The truth?\n                               FRED\n                 This is big business, Barney. We\n                 can't start telling the truth,\n                 it'd create the wrong impression.\n                 Think about all the really big\n                 deals in history -- back to the\n                 beginning of recorded time.\n     Barney knits his brow in thought for maybe three seconds.\n                              BARNEY\n                 Okay.\n                                FRED\n                 What do they all have in common?\n                        (as Barney is\n                          stumped)\n                 I'll tell you. A front man. A\n                 guy who's out in the public eye\n                 running the point, fighting the\n                 crowds... and meanwhile... back\n                 in the corner is the silent\n                 partner.\n\n                               BARNEY\n                 I never knew that.\n\n                               FRED\n                 That's because the silent partner\n                 is always silent.\n                               (MORE)\n\n                                                    (CONTINUED)\n\n                                                              47.\n\n95   CONTINUED:                                                     95\n                                FRED (CONT'D)\n                  But while you're busy being\n                  silent --\n                         (conspiratorially)\n                  -- all along you're the brains\n                  behind the operation and I'm the\n                  brains in front of the operation.\n                  I'm out here running the guts of\n                  the operation but you got a cut.\n                  It looks like my mind, but you're\n                  really behind.\n\n                                BARNEY\n                  I get it. I got the brains, but\n                  you just pretend to have them.\n\n                               FRED\n                  Attaboy!\n     And a confident Fred shakes hands with an unsure \"silent\n     partner\"...\n                                                    CUT TO:\n\n96   EXT. FLINTSTONE/RUBBLE HOUSES - DAY                            96\n     Barney comes out of his front door, heads toward the\n     neighboring driveway and Fred's car. Betty comes out,\n     calls to her husband.\n                                BETTY\n                  Barney, wait a minute...\n97   CLOSER                                                         97\n     He stops, turns. Betty comes over and we see he's wear-\n     ing a sports jacket and an abysmally-tied tie. Betty\n     fixes the knot.\n                                BETTY\n                  There. That looks more like a\n                  captain of industry.\n                                BARNEY\n                  Thanks, Betty. What would I do\n                  without you?\n\n                                BETTY\n                  Hmm. Probably run off to the\n                  tropics with one of those\n                  executive secretaries.\n\n                                                    (CONTINUED)\n\n                                                           48.\n\n97   CONTINUED:                                                  97\n                                BARNEY\n                  Come on, Betty, it's only my\n                  first day. You have to have\n                  seniority to run off...\n     She giggles, kisses him.\n\n98   FRED                                                        98\n     is at the car door, lunch pail in hand, when Wilma calls\n     out to him.\n\n                                WILMA\n                  Fred! Wait a minute! There's\n                  something wrong with your lunch --\n\n                                FRED\n                         (\"weighing it\")\n                  Yeah... it does feel a little\n                  light...\n     He returns to her, opens the pail, is surprised to find\n     it's empty. Before he can comment, she smilingly\n     presents him with a spanking new briefcase. \"F.F\" is\n     embossed on it in gold.\n                                WILMA\n                  Fit for a king... my king.\n\n                                FRED\n                  Aw, Wilma... lookit, it's got\n                  buckles, a strap, a lock --\n     He opens it.    Inside is a huge drumstick and some ribs.\n                                FRED\n                  -- Baby, you're the greatest.\n\n                                WILMA\n                         (kissing him)\n                  Good luck.\n                         (pause)\n                  Watch out for those... you know...\n                  hostile takeovers.\n\n                                FRED\n                  I'm already taken.\n     He moves to the car.\n\n                                FRED\n                  Ah, Mister Rubble, I presume?\n                  Of the Fibrerock Rubbles?\n                                                  (CONTINUED)\n\n                                                               49.\n\n98    CONTINUED:                                                     98\n                                 BARNEY\n                   Yes, yes. Looking good, Mister\n                   Flintstone. I see you've\n                   recovered from that polo accident.\n                                 FRED\n                   Yas, yas. The water was too\n                   deep and my horse drowned.\n      They crack up at their own wit, drive off.\n\n                                                     CUT TO:\n99    SLATE QUARRY - LAVA'S OFFICE - DAY                             99\n\n      Lava's on the phone, very worried.\n\n                                 LAVA\n                   Ivan, look, okay, so I bought too\n                   much on margin... everyone said\n                   glaciers were here to stay, I\n                   mean, who knew? Just leverage my\n                   shares in Atlantis dry goods and\n                   -- what? When did that happen?\n      Piltdown enters, knocks on the open door.\n                                 PILTDOWN\n                   Mister Lava, the armored car is\n                   here.\n                                 LAVA\n                   Armored car...?\n\n                                 PILTDOWN\n                   Yeah. Must be a fortune in\n                   coo-coo berries on that baby.\n                   You know, for that Fibrerock\n                   stuff of Flintstone and Rubble's.\n                   You gotta sign here for it.\n\n                                 LAVA\n                          (into phone)\n                   I... I'll get back to you.\n\n      Lava comes over, signs the form.    Meanwhile he looks out\n      the window at --\n100   HIS POV - ARMORED CAR                                          100\n\n      The guards are unloading sacks of coo-coo berries.\n\n                                                             50.\n\n101   BACK TO SCENE                                                101\n      Lava signs the form, meanwhile looking Piltdown up and\n      down. Finally --\n\n                              LAVA\n                Piltdown, this Fibrerock program\n                is going to create a lot of\n                changes around the plant. I want\n                to make one more. You've been a\n                wonderful thug and goon for me.\n                Now, I'd like to expand your\n                duties. I want you to become a\n                provocateur.\n                              PILTDOWN\n                Gee, Mister Lava, I donno.   I\n                kinda like girls myself.\n\n                              LAVA\n                       (patiently)\n                What I mean, is, I'm going to use\n                you to double-cross your Lodge and\n                Union brothers, and make their\n                lives a living hell.\n\n                             PILTDOWN\n                Oh, okay.\n                              LAVA\n                Good. You and your little pal\n                will report directly to me and\n                take orders only from me.\n                       (slapping him on\n                        the back)\n                Now get out of here and start\n                screwing your former friends and\n                associates.\n\n      Piltdown leaves, smiling.   Lava rubs his chin,\n      thoughtful.\n                              LAVA\n                Coo-coo berries...\n                                                   CUT TO:\n\n102   EXT. QUARRY - DAY                                            102\n\n      Fred and Barney appear in Fred's car, make a very quick\n      turn into the quarry lot.\n\n103   CLOSER                                                       103\n\n      They both duck down behind the wheel. A moment later,\n      Feldspar's patrol car comes barrelling by.\n\n                                                   (CONTINUED)\n\n                                                              51.\n\n103   CONTINUED:                                                    103\n      Feldspar looks every which way, doesn't spot them.\n\n                                 BARNEY\n                          (when he's gone)\n                   Gee, Fred, driving with you is\n                   better than an 'E' ticket at\n                   Magerock Mountain.\n\n                                 FRED\n                          (getting out)\n                   Gets the old adrenaline going,\n                   Barn. Us big executives, we need\n                   that kind of jolt to get the old\n                   wheels turning.\n\n      Lava comes INTO VIEW, carrying an armload of plans.\n\n                                  LAVA\n                   Flintstone!   Rubble!\n                                 BARNEY\n                   Oh, hi, Mister Lava.\n                                 LAVA\n                   Please, call me Jerry. Uncle --\n                   I mean, Mister Slate told me to\n                   take you to your offices. If\n                   you'll follow me...?\n\n      They move along. Fred notices a hotbed of activity\n      nearby. Workers move scaffolding, animals labor.\n                                  FRED\n                   Hey.   What's going on?\n                                  LAVA\n                   The Fibrerock  assembly line.\n                   Unc -- Mister  Slate's had a crew\n                   working on it  all weekend. We're\n                   going to roll  out the first sheets\n                   of Fibrerock  by mid-week.\n\n                                 FRED\n                   Yes, yes. Quick, dynamic entry\n                   into the marketplace. I approve.\n\n                                 BARNEY\n                   But, Fred, it's right where the\n                   employee basketball court used\n                   ta be --\n\n                                                     (CONTINUED)\n\n                                                               52.\n\n103   CONTINUED:    (2)                                              103\n                                 FRED\n                   Hey, you're right...\n                          (resigned)\n                   ... Big business is hell, Barney.\n                   Trust me... you'll get used to it.\n\n                                  BARNEY\n                   I guess so.   You already did.\n      Lava leads them to a wood-sided trailer.\n\n                                 LAVA\n                   Well, gentlemen, here you are. As\n                   soon as you're settled, come over\n                   to the assembly line. We'll go\n                   over the Fibrerock formula before\n                   the first run.\n      He goes off.    Fred and Barney go --\n104   INSIDE TRAILER                                                 104\n      There're two tiny little desks at the far end, separated\n      by a flimsy divider. The single window here looks out\n      over the quarry scrap heap. (As we watch, somebody dumps\n      a load of debris.)\n      Threadbare furniture on a worn rug sits under a portrait\n      of \"Our Founder\" (Slate).\n105   BACK TO SCENE                                                  105\n      Fred and Barney look at all this in turn.     Pause.    Then\n      they whirl, give each other high-fives.\n                                 BARNEY\n                   All-right!\n\n                                 FRED\n                   Welcome to the top -- partner.\n\n      And as they shake, we --\n                                                    CUT TO:\n\n106   MONTAGE - ASSEMBLY LINE - DAY                                  106\n\n      Now, accompanied by heroic \"industrial\"-type MUSIC, we\n      see the Fibrerock assembly line in full operation.\n\n      This cannot be described    now with appropriate justice,\n      but it involves a series    of animal-powered conveyor\n      belts, Rube Goldberg-like    funnels, spouts and chutes,\n      and all sorts of gadgets,    gizmos, bells and whistles,\n      to wit:\n                                                    (CONTINUED)\n\n                                                             53.\n\n106   CONTINUED:                                                    106\n      At one end of the building, dino-powered dumpsters and\n      lifters drop off all the ingredients; these get stomped/\n      chewed/bashed and otherwise reduced to powder, which is\n      then (courtesy of some squirting Mastodans) mixed with\n      water into a foam, which bubbles through a long sawmill-\n      type trough and is held back by a gate.\n\n      Meanwhile, we see a sample item (in this case, a stone\n      sofa) as it is placed before two \"goatasauruses\" which\n      butt heads and smash the sofa between the two halves of\n      a clay mold. When the mold is opened and the sofa tossed\n      aside, Barney appears and personally \"aims\" the foam\n      trough at a funnel in the top of the mold. Pausing to\n      \"taste\" the mix, he smiles, then shouts --\n\n                                 BARNEY\n                   Ready... aim... fibre!\n      Barney pulls a rope which opens the trough.     \"Fibrefoam\"\n      pours into the mold.\n107   THE CLAY MOLD                                                 107\n      gets \"winched\" unpwards by monkeys, and then an alliga-\n      torsaurus whaps it with its tail.\n108   BELOW                                                         108\n      Presto! A Fibrerock copy     of the stone sofa drops neatly\n      out of the mold, bounces    lightly on the conveyor belt\n      below! It sparkles with     the tell-tale celadon-green\n      shimmer of Fibrerock. As     it chugs along, the process\n      repeats, and soon a score    of identical sofas is in view.\n\n109   END OF ASSEMBLY LINE                                          109\n      as a beaming Fred watches, workers easily stack the\n      Fibrerock sofas (often one-handed). Nearby, we see\n      Fibrerock window frames, doors, chairs, etc.\n110   UP ANGLE - SLATE'S OFFICE BALCONY                             110\n\n      Slate and Lava watch the progress, dollar signs in their\n      eyes.\n\n                                                   DISSOLVE TO:\n\n111   LONG MATTE SHOT - SLATE QUARRY - LATE AFTERNOON               111\n      Fibrerock products are stacked up everywhere, stretching\n      away like the inventory in Charles Foster Kane's\n      warehouse.\n      We see everything from Fibrerock bricks to Fibrerock\n      table lamps to Fibrerock toilets. MUSIC OUT.\n\n                                                            54.\n\n112   CLOSER - QUARRY YARD                                        112\n      Fred and Barney, weary, approach each other, shake hands\n      as they view the day's incredible output. Other weary,\n      but proud workers gather around them: Mr. Slate is about\n      to address them from his office balcony.\n                              SLATE\n                Men, this is a proud day for Slate\n                Construction. You have seen the\n                first pieces of Fibrerock roll\n                off the assembly line and into\n                history... a history you are all\n                part of... thanks to your very\n                own fellow worker, Fred Flintstone!\n113   WORKERS - FAVORING FRED AND BARNEY                          113\n\n      They cheer Slate's remarks, pat Fred on the back.\n114   BACK TO SCENE                                               114\n                              SLATE\n                No longer will man and beast bend\n                under the backbreaking load of\n                stone and rock and timber...\n                because Fibrerock is so light\n                that even a child can handle it.\n                       (pause)\n                That's why on Monday we're going\n                to hire two dozen children from\n                Bedrock Technical Junior High.\n                They'll be replacing the 36\n                heavy equipment operators, 15\n                shaft diggers and 22 laborers\n                we're laying off today. Your\n                pink slips will be in your final\n                pay envelopes along with a ticket\n                to the grand opening of Slate\n                City. It's non-transferable,\n                so hang on to it. Thank you, and\n                have a nice weekend.\n\n115   THE QUARRY YARD                                             115\n      The workers stand slack-jawed and stunned.\n\n                                WORKER #1\n                Laid off --?\n                                WORKER #2\n                Pink slip --?\n\n                              WORKER #3\n                Thanks to Fred Flintstone?\n                                                   (CONTINUED)\n\n                                                             55.\n\n115   CONTINUED:                                                   115\n                                 WORKER #4\n                   Flintstone! What kinda shop\n                   steward are you?\n      All eyes swivel and bore into Fred, who is as shocked as\n      anyone.\n\n                                BARNEY\n                   Fred. You gotta do something\n                   about this!\n\n                                 FRED\n                   I do?\n                          (realizing)\n                   I mean, I do, yeah!\n\n      He squares his shoulders, marches off.\n                                 BARNEY\n                          (proudly)\n                   That's my Fred...\n116   INT. SLATE'S OFFICE - DAY                                    116\n\n      Slate is practicing    hitting golf balls into an automatic\n      putting cup. Lava     and some office workers are checking\n      a blueprint against    a model of \"Slate City\" which is made\n      out of Fibrerock.     A ball shoots back at Slate, who tees\n      up again.\n117   INSIDE THE PUTTING CUP                                       117\n      A little MOUSE in a complete hockey outfit jumps to catch\n      the ball. Stopping it with his little hockey stick, the\n      Mouse gasps, raises its hockey mask.\n                                  MOUSE\n                   Whew.   And it's still pre-season.\n      He whaps the ball to Slate again.\n\n\n118   BACK TO SCENE                                                118\n      Slate tees up the ball again. Fred barges in, banging\n      the door. Startled, Slate drives the ball instead of\n      putting it. It sails across the room and SHATTERS a\n      PICTURE of Mrs. Slate.\n                                 SLATE\n                          (furious)\n                   Flintstone!\n                                                    (CONTINUED)\n\n                                                               56.\n\n118   CONTINUED:                                                     118\n                                 FRED\n                          (undeterred)\n                   Mr. Slate -- we gotta talk --\n                                  SLATE\n                   We do, eh?   About what?\n\n                                 FRED\n                   About those guys outside, Mr.\n                   Slate. Some of 'em, well, they\n                   been here for years. And you,\n                   well, you can't lay them off just\n                   like --\n                          (snapping fingers)\n                   -- that!\n\n      Slate looks at Lava, who shrugs. Slate looks back at\n      Fred, stays surprisingly calm. He toys with the putter,\n      balances it on his palm.\n                                 SLATE\n                   Of course I can, Fred. I can lay\n                   them off like --\n                          (snapping fingers)\n                   -- that, or like --\n                          (a different style\n                           snap)\n                   -- that, or like --\n\n      He does a really nifty snap which combines with a buck-\n      and-wing with the putter.\n                                 SLATE\n                   -- that.\n                                 FRED\n                          (bravura slipping)\n                   Oh, you can, huh?\n                                 LAVA\n                   Of course he can, Flintstone.\n                   It's his quarry.\n                                 SLATE\n                          (still calm, warm)\n                   That's right. Why --\n                          (chuckling)\n                   I could lock the front door and go\n                   fishing if I wanted!\n\n      Lava laughs along with the office staff and Slate.      Fred\n      chuckles a little to fit in.\n                                                      (CONTINUED)\n\n                                                               57.\n\n118   CONTINUED:    (2)                                              118\n                                 SLATE\n                          (winking)\n                   Why, I could even fire Lava here\n                   if I wanted.\n      Lava quivers with mock surprise.     Everyone really laughs,\n      now.\n\n                                 SLATE\n                   Or...\n                          (wiping away a tear)\n                   I could fire you, Fred.\n                                 FRED\n                          (guffawing)\n                   Me! Ah, ha, that's rich, Mr.\n                   Slate, that's --\n      Suddenly Fred stops laughing.\n                                 SLATE\n                   Flintstone, Lava, here,\n                   recommended that you be in charge\n                   of public relations to get\n                   Fibrerock off to a good start.\n                   I'm a member of that public,\n                   Flintstone, and I have to say...\n                   this isn't a good start. I'm\n                   getting a bad feeling about\n                   Fibrerock. A bad feeling about...\n                   you. You want that feeling to go\n                   away, don't you?\n                                 FRED\n                   Uh... well, gee, I... uh, yeah.\n                                 SLATE\n                   Good. Then turn around and walk\n                   out of here and we'll forget all\n                   about this.\n\n      Fred swallows, looks at Lava, goes meekly out.\n119   EXT. QUARRY YARD - DAY                                         119\n\n      All the Workers watch expectantly as Fred comes out.\n      They AD LIB --\n                                  WORKERS\n                   Well?   What'd he say...? Ol'\n                   Freddie  boy told him a thing or\n                   two...  Probably got us a raise...\n                   Right,  Fred...? Fred...?\n                                                      (CONTINUED)\n\n                                                             58.\n\n119   CONTINUED:                                                   119\n                                 FRED\n                   Akkk... something... noble... man\n                   ... job... nose... wheel...\n                   shoulder... grindstone... hommm...\n                   yggggg...\n\n                                  BARNEY\n                           (worried)\n                   Fred?\n      Fred staggers over to his locker, opens it... gets in,\n      and closes the door. We hear a MUFFLED SOB.\n120   A NEW ANGLE                                                  120\n\n      As the workers slowly realize the mighty Casey has struck\n      out.\n                                                   CUT TO:\n121   EXT. FLINTSTONE & RUBBLE LAWNS - DAY                         121\n      Betty and Wilma stand, determined, while the kids gripe.\n\n                                 PEBBLES\n                   But, Mommy, I wanna go roller\n                   skating...\n                                 BAM-BAM\n                          (mouth full)\n                   Yeagh... 'hend thugh guys wher\n                   ghoing --\n                          (swallow, munch)\n                   -- to play rockball at Paleolithic\n                   Park --\n      Betty wipes Bam-Bam's mouth, smiles sweetly.\n\n                                 BETTY\n                   Well, you're both going to change\n                   your plans. Your new school is\n                   going to have a talent show... and\n                   you're going to have some talent.\n                                 WILMA\n                   You don't have to win... honorable\n                   mention or most Kongenial Kids is\n                   perfectly acceptable.\n                                 PEBBLES\n                          (aside)\n                   As long as we beat the pants offa\n                   Mrs. Slate's nephew...\n                                                   (CONTINUED)\n\n                                                                59.\n\n121   CONTINUED:                                                      121\n                                 WILMA\n                   Young lady, this is not about\n                   beating pants, this is about\n                   becoming a well rounded child.\n                   Now, what kind of act will you do?\n\n                                 BAM-BAM\n                   How about a disappearing act?\n      He takes a tentative step away but Betty grabs him.\n\n                                 BETTY\n                   We're waiting.\n      Pebbles and Bam-Bam sigh, huddle.       We hear snatches of\n      discussion...\n\n                   PEBBLES                         BAM-BAM\n           ... Wanna recite something?     Nah, what are we, little\n           'Inky Dinky Spidersaurus...'?   kids? How 'bout magic\n                                           tricks? We could cut up a\n                                           newspaper --\n                   PEBBLES\n           But then we'd need a hammer             BAM-BAM\n           and chisel... oh, what about    That dumb thing?   You\n           that thing with Dino?           think so...?\n      Pebbles turns, the decision made.\n\n                                PEBBLES\n                   Okay. We're gonna sing a song\n                   with Dino.\n      Instantly, on cue, Dino leaps out of nowhere, holding a\n      straw hat and a cane.\n      Wilma and Betty look at each other, skeptical. Bam-Bam\n      reaches into his shirt and takes out a whistle. He blows\n      it --\n                                 PEBBLES\n                   A one-and-a-two and-a --\n122   WIDER                                                           122\n\n      MUSIC comes UP and Dino and his little friends do a dance\n      routine we will call \"The Dino Dance.\" It is a spectac-\n      ular blend of soft-shoe and the kind of dog-and-pony-show\n      gags usually seen in the circus or on the Ed Sullivrock\n      show. Most importantly, the routine includes the\n      following:\n\n      A)    Dino leaps back and forth through a hoop.\n                                                     (CONTINUED)\n\n                                                                60.\n\n122   CONTINUED:                                                      122\n      B)   The kids tie down a jump rope and Dino does a wire\n           walk.\n\n      C)   And finally, Dino uses his tail to flip the kids onto\n           his back, culminating in a big \"ta-da\" after they all\n           slide down the rope for a big finish.\n\n\n123   NEW ANGLE                                                       123\n                                 THE KIDS\n                          (winding up)\n                   You can keep the Twist,\n                   The Frug and Hop\n                   I don't need to Shimmy,\n                   I don't need to Bop\n                   'Cause I'm doin' doin' doin'\n                   The Igneous Rock!\n      Panting for breath, Pebbles, Bam-Bam and Dino wait for a\n      reaction.\n                                 BETTY\n                          (to Wilma, impressed)\n                   Well? Think they're ready for the\n                   talent show?\n                                 WILMA\n                   I think they're ready for Rock\n                   Vegas.\n      As they laugh and hug the kids and Dino, we --\n                                                      CUT TO:\n124   EXT. LODGE HALL - THAT NIGHT                                    124\n\n                                 HERDMASTER (V.O.)\n                   Fellow Water Buffalo. In a few\n                   moments we will cast our votes for\n                   the lodge officers.\n\n125   INT. LODGE HALL                                                 125\n\n      TIGHT ON Fred as he leans back in his usual chair.\n\n                                 HERDMASTER\n                   The election committee will make\n                   the preparations.\n\n                                 FRED\n                          (confident)\n                   Since when do you have to prepare\n                   for a landslide, right, guys?\n                                                    (CONTINUED)\n\n                                                               61.\n\n125   CONTINUED:                                                     125\n      Pause as Fred waits for a reply. He turns... SHOT WIDENS\n      as he realizes no one is sitting near him. He looks\n      around and sees --\n126   HIS POV - FRED'S POSTER                                        126\n\n      It's been altered to read \"Fred Finkstone.\" Also added\n      to Fred's image are horns, a beard and other choice\n      touches.\n127   BACK TO SCENE                                                  127\n\n      Fred looks around, sees Barney approaching, having just\n      left a group of angry Buffalo.\n\n                                 FRED\n                   Barn -- w-what's going on?\n                                 BARNEY\n                   They're mad at you, Fred... it's\n                   understandable, I mean, they all\n                   got laid off today --\n      Fred crosses to the other guys, puts on a big smile.\n                                 FRED\n                   Guys, guys, come on now -- what's a\n                   quarry fulla layoffs got to do with\n                   a lodge fulla Buffaloes?\n                                 BARNEY\n                   Is that a riddle? Give me a\n                   second --\n\n                                 PYRITE\n                          (stepping forward)\n                   I'll tell ya what! Mosta the guys\n                   in this lodge work for Mr. Slate --\n                                 PILTDOWN\n                   -- You mean used to work for him --\n                   until somebody opened their big\n                   mouth --\n                                 FRED\n                   Fellas, come on. We're all big\n                   boys here --\n      He gestures vaguely towards the outside world, then back\n      to the little band of brothers here.\n\n                                 FRED\n                   Surely we can separate in our minds\n                   work, and play... Job, and Lodge...\n\n                                                      (CONTINUED)\n\n                                                               62.\n\n127   CONTINUED:                                                      127\n                                 PILTDOWN\n                          (pointing at Fred)\n                   Candidate and double-crossing back\n                   stabber?\n                          (turning)\n                   Herdmaster! I move we commence\n                   the meeting... and the election!\n\n                                 PYRITE\n                   I second the motion!\n\n                                 HERDMASTER\n                   All in favor, say --\n                                 FRED\n                   Wait, wait... Your Antlerness,\n                   please, one second -- !\n      Fred grabs Barney by the shoulder, spins him around,\n      pushes him forward like a refrigerator on a dolly, stands\n      him up center stage.\n                                 FRED\n                   Barney, you gotta tell the other\n                   guys what really happened. Tell\n                   'em the story behind Fibrerock.\n                   The true story.\n      The room quiets.    Barney clears his throat.     Fred waits,\n      hopeful.\n                                 BARNEY\n                   Well, there's not much to tell.\n                          (trying to remember\n                           Fred's phraseology)\n                   True, I got a cut... but Fred's\n                   got a gut.\n\n                                 FRED\n                   No, no, the rest --!\n\n                                 BARNEY\n                   Oh, yeah, I remember! I got the\n                   mind, but Fred's got the behind.\n                   Right, Fred?\n\n      Barney turns, gives Fred a big wink.    Fred groans.\n                                 HERDMASTER\n                   Thank you, Brother Rubble. The\n                   Buffaloes will now have their\n                   secret vote.\n                          (a command)\n                   Fit... furs!\n\n                                                      (CONTINUED)\n\n                                                               63.\n\n127   CONTINUED:    (2)                                              127\n      Everyone pulls their horned fezzes down over their eyes.\n\n                                 HERDMASTER\n                   Paw... ground!\n      Everyone does a bull-like stomp and scrape.\n\n                                 HERDMASTER\n                   All for Piltdown, bellow now!\n      The room ECHOES with MOOSE-LIKE SNORTS.\n\n                                 HERDMASTER\n                   All for Flintstone, bellow now!\n\n      Fred snorts, sounding like Herb Alpert's lonely bull.\n      Even under his furry fez we see him \"looking around\"\n      desperately, hoping to hear one more snort.\n      He kind of sneaks in one more forlorn grunt which fades\n      away... finally, as Fred squirms miserably, there is one\n      more lonely snort...\n      ... from Barney, of course.\n                                   HERDMASTER\n                   Order furs!\n      The fezzes come up.\n                                 HERDMASTER\n                   The snorts have it! Brother\n                   Piltdown, it is my privilege to\n                   install you as the new Exalted\n                   Herdmaster Erect Antler and Big\n                   Buck of our Lodge. If you'll come\n                   forward, I will present you with\n                   the tokens of office.\n      Cheers and applause as Piltdown goes to the podium.\n\n128   FAVORING FRED AND BARNEY                                       128\n      Fred's a broken man.       Barney moves over, puts his arm\n      around him.\n\n                                 BARNEY\n                   I voted for you, Fred.\n                                 FRED\n                   Big deal, after you screwed\n                   everything up in the first\n                   place...!\n      Barney reacts, really hurt. He moves away on the bench.\n      Fred's so agitated he doesn't even realize it.\n\n                                                           64.\n\n129   WIDER                                                      129\n      Piltdown accepts the festooned fez and shoulder ribbon,\n      smiles at the group.\n\n                              PILTDOWN\n                Thank you, Brother Chairman.\n                Fellow Buffaloes, I'm a man of few\n                words. It's no secret that most\n                of our lodge members are also\n                members of Amalgamated Neolithic\n                101... which means that most of us\n                aren't gonna be able to make our\n                cave payments next month. So my\n                agenda for tonight... ends right\n                now. There's a time to be a\n                Buffalo... there's a time ta be a\n                brown nosin' double-crossin'\n                creep...\n      All heads turn and swivel to look at Fred... swivel back.\n                              PILTDOWN\n                ... and there's a time to stand up\n                and be a man! So let's go down\n                there and make the Slate shop into\n                slate scrap... then we'll see how\n                he gets along without the heavy\n                equipment operators of Neolithic\n                101! Meeting adjourned!\n\n      With angry grumbles and threats, the meeting breaks up.\n      Fezzes are thrown into cubby holes and hard hats are\n      slapped on. The Buffalo run out.\n      When the dust clears, we see that only one member has\n      avoided the herding instinct: Barney.\n      Now, he turns, runs into --\n\n130   BUFFALO LODGE - RECREATION AREA - NIGHT                    130\n      Fred is at the bar, opening a beer. He looks wistfully\n      at the old, framed picture on the wall -- reacts as he\n      sees --\n131   PICTURE                                                    131\n\n      Even his childhood shot has been defaced.\n132   BACK TO SCENE                                              132\n\n      He sets his jaw with a \"screw 'em\" expression, downs his\n      beer. Then Barney runs up, shakes him by the shoulders.\n                                                  (CONTINUED)\n\n                                                              65.\n\n132   CONTINUED:                                                    132\n                                 BARNEY\n                   Fred! Fred! The Buffalo are\n                   heading for big trouble -- !\n                                 FRED\n                   No kidding. They rejected the\n                   best candidate --\n\n                                 BARNEY\n                   No, no, not that! Piltdown's got\n                   the guys all worked up and they're\n                   heading down to the quarry!\n                   They're gonna wreck the assembly\n                   line!\n\n                                 FRED\n                          (genuinely worried)\n                   Oh, no! That -- that's horrible!\n                          (pause)\n                   We could end up with half a\n                   percent of nothing!\n                                 BARNEY\n                   No, Fred, if they do that they'll\n                   be breakin' the law! Our brother\n                   Buffalo could go to jail!\n                                 FRED\n                   Oh, yeah, yeah, that, too... come\n                   on, Barn, we gotta stop 'em!\n                                                    CUT TO:\n133   EXT. SLATE QUARRY - NIGHT                                     133\n      Silent, empty. CAMERA PANS FROM the still yard TO the\n      gate. Down the road, we see Piltdown leading the angry\n      mob. Quickly, they go to the gate, climb up and over it!\n                                 PILTDOWN\n                   Okay! Let's start with Slate's\n                   golf trophies and work our way\n                   up to the assembly line!\n      AD LIB angry cheers, and the mob storms into the plant,\n      knocking aside equipment and supplies.\n\n134   IN CAR - FRED AND BARNEY - NIGHT                              134\n      Both pedaling like mad.\n\n                                                    (CONTINUED)\n\n                                                               66.\n\n134   CONTINUED:                                                     134\n                                 FRED\n                   I don't believe this... how did\n                   things ever get this out of\n                   hand -- ?\n                                 BARNEY\n                   I know. Makes you wish things\n                   were back the way they were...\n                   before we was big executives.\n                                 FRED\n                   Well, I wouldn't go that far...\n      Suddenly they're interrupted by the sound of a SIREN.\n      Fred looks back and sees --\n\n135   FELDSPAR AND GRAVEL                                            135\n      Coming up from rear. Feldspar grabs his megaphone as he\n      pulls abreast of Fred.\n                                  FELDSPAR\n                   Flintstone!   Pull over!\n\n                                 FRED\n                   Oh, no, not now...\n      Feldspar signals Fred onto the shoulder.       Fred smiles,\n      nods...\n136   CLOSE ON FRED'S FEET                                           136\n      He slams them down through the floorboard --\n\n137   WIDER                                                          137\n      Fred's CAR SKIDS, spins out, whirling around like a\n      record on a turntable. It jerks to a halt 180 degrees\n      later, and then ROARS off in the opposite direction.\n138   FELDSPAR                                                       138\n\n      So astonished he follows this action with his head... a\n      bad move because --\n\n                                  GRAVEL\n                   Sarge!   Look out -- !\n139   NEW ANGLE                                                      139\n\n      The patrol CAR runs off the road, CRASHING into a stone\n      fire hydrant. Water squirts into the air. Feldspar and\n      Gravel are drenched. They're just coming to their senses\n      when the ground heaves -- the car's front wheels rise --\n\n                                                               67.\n\n140   NEW ANGLE                                                      140\n      As we see that the water spout is actually coming from\n      the blowhole of a whale which now sticks a bit of its\n      head up from under the broken curb.\n                                WHALE\n                  I'm gonna sue you for everything\n                  you got --\n\n                                                     CUT TO:\n141   SLATE QUARRY - NIGHT                                           141\n\n      Led by Piltdown, the workers have grabbed a big timber\n      which they're using like a battering ram on the doors of\n      the assembly line building. Suddenly, with a crash, the\n      doors go down! Piltdown and Pyrite stand back while the\n      angry workers rush past them.\n                                PILTDOWN\n                         (loudly)\n                  Now we'll show 'em who's boss!\n                                PYRITE\n                  They can't push us around!\n      Piltdown and Pyrite smash a few items to get everybody\n      juiced up, and then... when no one is looking...\n      ... they slip out the back!\n142   REAR OF QUARRY - NIGHT                                         142\n      Fred pulls into the lot, slams his feet down to stop --\n      we hear SKIDDING -- they fishtail all over, slam right\n      through a storage area for crates and barrels which\n      collapse all around them.\n\n      Finally they slam broadside into the main Quarry build-\n      ing, knocking a hole in the wall.\n143   NEW ANGLE                                                      143\n\n      Fred and Barney cough in the rising dust. Neither one of\n      them sees what we see, which is that visible in the hole\n      in the wall is the Slate Company's granite-doored safe...\n\n      ... and right beside it is the Xenosaurus, which now\n      jumps up, startled, dropping a crowbar and a big hand\n      drill.\n\n      Recovering its composure, the Xenosaurus grabs up the\n      tools as well as a big canvas bag and tiptoes away,\n      vanishing just as our heroes stir.\n                                                     (CONTINUED)\n\n                                                            68.\n\n143   CONTINUED:                                                  143\n                                 FRED\n                          (double-taking)\n                   Barn! Did you see that -- ?\n                          (peering through\n                           the dust)\n                   -- Huh, now it's gone... I\n                   coulda sworn...\n\n                                   BARNEY\n                   Come on Fred.    Time to earn those\n                   big bucks.\n\n      They rush into the plant.\n144   INT. ASSEMBLY LINE - NIGHT                                  144\n\n      As the workers continue their rampage, Piltdown and\n      Pyrite reappear.\n                                 PYRITE\n                   Darn that Flintstone and Rubble...\n                   they're gonna screw everything\n                   up...\n\n                                 PILTDOWN\n                   Not if we give 'em a nice long\n                   vacation... in the hospital.\n      Saying this, he grips tightly on a wrench. Then some\n      rampaging workers rush by. Piltdown gives them an encour-\n      aging cheer, and then he and Pyrite lead them up some\n      stairs to the assembly line catwalk. There, Pyrite\n      begins SMASHING some LIGHT FIXTURES with a club, while\n      Piltdown uses brute strength to snap big support beams\n      which he flings below.\n145   CLOSE - PYRITE                                              145\n\n      Winds up for another   baseball-type swing -- but as he\n      follows through, the   ball-shaped light fixture jerks up\n      on its cable. Unable    to stop in time, Pyrite spins\n      around, falls on his   ass.\n      Barney drops down INTO VIEW, hanging horizontally from\n      the rafters. He's holding the light fixture with his\n      free hand.\n\n                                 BARNEY\n                   Stee-rike one! Heh-hey.    Ready\n                   for a curve ball?\n\n      Pyrite doesn't have a sense of humor; club in hand,\n      he jumps up, starts chasing Barney through the rafters.\n\n                                                             69.\n\n146   PILTDOWN                                                     146\n      Spits on his hand, grabs another big beam. He pulls down\n      on it... but it doesn't snap, it goes right up again.\n      Puzzled, he pulls down on it again... there's another\n      see-saw motion...\n      ... This time Piltdown goes with the flow, pushes up and\n      peers under the beam...\n\n147   NEW ANGLE                                                    147\n      Fred is hanging on the other end.\n\n                                FRED\n                  Brother Piltdown... can we talk\n                  about this, antler to antler?\n\n      Piltdown roars, begins slamming the girder up and down.\n                                 FRED\n                  Guess not...\n      Fred inches down the shuddering beam, jumps off. Freed\n      of Fred's weight, the other end \"BOINGS\" down on\n      Piltdown's head. He groans, recovers in time to chase\n      after Fred.\n148   BARNEY AND PYRITE                                            148\n      Square off in the rafters.\n                                BARNEY\n                  Give me your best shot.\n      Pyrite swings. Barney ducks and Pyrite SMASHES a WINDOW\n      pane. Barney dodges again and the same thing happens.\n      Getting cocky, Barney does it one more time...\n\n      ... but this time the window is hinged in the center and\n      the swivel action after the hit whaps Barney on the back\n      and knocks him into Pyrite's next blow.\n\n149   FRED                                                         149\n      Is backpedaling away from Piltdown on the upper super-\n      structure of the assembly line. Fred scrapes one foot in\n      an arc in front of him.\n\n                                FRED\n                  Dare you to cross that line.\n\n      Piltdown crosses it.\n\n                                 FRED\n                  That line.\n\n                                                    (CONTINUED)\n\n                                                          70.\n\n149   CONTINUED:                                                 149\n      Piltdown crosses it. Fred \"marks\" another one. Piltdown\n      doesn't even wait for the challenge, takes a giant step.\n      Oops. Bad idea: The last \"line\" was at the edge of a\n      straight drop! Piltdown yelps, \"treads air\" in the best\n      cartoon manner -- and then desperately grabs a handful of\n      Fred's clothing! Both men fall -- at the last minute\n      Piltdown catches a ladder!\n\n150   BELOW - ASSEMBLY LINE                                      150\n      Fred lands with a thud right in the clay mold used to\n      form the Fibre products! Worse, the impact arouses the\n      goatasauruses out of their sleep. Dutifully, they rise,\n      and then ram both sides of the mold just as Fred is\n      struggling to his feet! Fred's yell is muffled by the\n      clay.\n\n151   OTHER ASSEMBLY LINE ANIMALS                                151\n      Aroused by the \"start up\" of the assembly line, they do\n      their job. Fibre foam begins to chug down the trough:\n      The alligator crane picks up the mold, shakes it.\n152   FRED                                                       152\n      is flung to the conveyor belt, stiffly caked in clay.\n153   THE FIBRE MOLD                                             153\n\n      shudders -- and shakes out a Fibre statue of... Fred!\n154   BELOW                                                      154\n      The real Fred, moving stiffly like a robot, is getting\n      to his feet when his Fibre doppleganger slams him to the\n      mat again! A moment later, another \"Fred\" drops down\n      beside him.\n\n155   PILTDOWN                                                   155\n      Has descended the ladder, hopping mad. Now, he sees\n      Fred coming toward him... Piltdown breaks a big lever off\n      the equipment, swings -- reacts astonished as \"FRED\"\n      SHATTERS.\n\n156   FRED                                                       156\n\n      Back down the line, he's seen this. His clay-caked\n      Adam's apple gulps. Quickly, he turns and tries to\n      \"tip-toe\" away -- then, with a CREAK and CRUNCH -- the\n      clay and Fibre all over him solidifies! Desperate, he\n      tries to move... can't!\n\n                                                             71.\n\n157   PILTDOWN                                                     157\n      Watches, confused, as dozens of Fred Flintstones chug\n      towards him on the belt. He shrugs, smashes the next\n      one in line. Another phoney. He smashes the next one...\n                                                   CUT TO:\n\n158   UP ABOVE - BARNEY                                            158\n\n      Dodging Pyrite's renewed attack. Now, Barney becomes\n      aware of the activated assembly line. Getting an idea,\n      he moves behind an inspection table, grabs a big rubber\n      stamp.\n      Pyrite comes around the    corner... Barney's head butts him\n      in the gut, dodges under    his legs! Then, as Pyrite\n      stumbles, Barney stamps    his ass with the word \"REJECT.\"\n      Pyrite looks back, sees    this, reddens... raises his club.\n                               PYRITE\n                 Reject, huh? Whaddya say we\n                 reject your head?\n      He raises the club... when an alligator swings down and\n      grabs him by the seat of his pants! Pyrite drops the\n      club, howls --\n159   WIDER                                                        159\n      The alligator crane swings him away and over a big bin\n      marked REJECTS -- and drops him.\n      Howling, Pyrite falls into a big bin of broken and\n      defective Fibrerock goods.\n\n160   BARNEY                                                       160\n      Chuckles to himself... and then looks down, reacts.\n      CAMERA ADJUSTS and we see that Piltdown has smashed yet\n      another of the duplicate Freds.\n      Worried, Barney looks around, sees that he's just above\n      the Fibrefoam chute. Without another thought, he jumps\n      into it -- slides downward like a passenger on the\n      Magerock Mountain Log Flume ride --\n\n161   BELOW                                                        161\n\n      Piltdown is about to swing at the real Fred -- when\n      Barney sails out of the end of the chute and slams into\n      him and Fred! All three of them roll across the floor\n      towards --\n\n                                                               72.\n\n162   THE END OF THE BUILDING                                        162\n      where a squad of policemen has just appeared -- led by a\n      dripping wet Feldspar and Gravel!\n\n                               FELDSPAR\n                All right!   You're all under arr --\n\n      Wham! Barney, Fred and Piltdown roll right into the\n      cops, who go flying like (what else?) tenpins, complete\n      with appropriate sound.\n                              BARNEY\n                       (sitting up)\n                Whattya know. Even got the spare\n                again...\n\n      Then he gasps as he looks over at Fred, whose head has\n      just fallen off!\n      Pause. Fred's real head slowly pokes up out of the clay\n      and Fibre shoulders. Before he can extricate himself\n      further, Feldspar and his men are dragging them out of\n      the building.\n                                                     CUT TO:\n163   INT. BEDROCK POLICE STATION - NIGHT                            163\n      Wooden bars delineate the holding cells. \"Wanted\"\n      posters of stone are hanging on the walls.\n      As we watch, the contrite buffalos are bailed out by\n      friends and relations. Wilma and Betty are just now\n      clunking down stone money on the night sergeant's desk.\n\n                              BETTY\n                Barney, I don't understand... what\n                came over you boys?\n\n                              EXITING BUFFALO\n                'Night, Barney.\n                       (to Fred)\n                So long, fatso.\n                              BUFFALO #2\n                See ya, Barn.\n                       (pause)\n                Flintstone, you're dead meat.\n                                BUFFALO #2\n                'Night, pal.    'Night, slimeball.\n\n                              WILMA\n                Fred, is there something you want\n                to tell me about the lodge meeting?\n\n                                                     (CONTINUED)\n\n                                                              73.\n\n163   CONTINUED:                                                    163\n                                 FRED\n                   I don't wanna talk about it.\n                   Besides, who cares about a bunch\n                   of jerks running around with furs\n                   on their heads? I'm more of a\n                   country club guy myself anyway...\n\n      He goes out, hardly looking at Barney. Wilma and Betty\n      look at each other, mystified... then Wilma follows Fred\n      out, puzzled.\n\n164   EXT. POLICE STATION - NIGHT                                   164\n      Lava stands in the shadows beside his Porscherock.\n      Piltdown and Pyrite are with him. In the b.g., Fred and\n      Wilma drive away.\n\n                                 LAVA\n                   A simple little heist -- I gave\n                   you everything but the keys and\n                   you blew it --\n                                 PILTDOWN\n                   Hey, we got the union guys to\n                   break in and create a distraction,\n                   didn't we? Who knew Flintstone\n                   and Rubble would show up, too?\n                                 LAVA\n                   The day after Slate City opens\n                   there's going to be an audit. If\n                   the stuff isn't gone by then we'll\n                   all be doing time until the\n                   Bronze Age.\n                                 PYRITE\n                   Don't worry, Mister Lava... we're\n                   on top of it.\n      They both turn and start down an alley... jamming\n      together as they do. Lava sighs... then jumps as Barney\n      comes up behind him and taps him on the shoulder.\n                                 BARNEY\n                   Excuse me, Mister Lava -- ? I\n                   think you oughta know... something\n                   could be wrong with the Fibrerock\n                   mix.\n                                 LAVA\n                          (thrown)\n                   How do you know that?\n                          (recovering)\n                   I mean... ah, why do you say that?\n\n                                                     (CONTINUED)\n\n                                                             74.\n\n164   CONTINUED:                                                   164\n                                 BARNEY\n                   It tastes different.\n\n                                 LAVA\n                   Tastes... different?\n\n                                 BARNEY\n                   Yup. See, ever since I started\n                   with Fibrerock -- I mean, since\n                   me and Fred started with it, I\n                   always take a little taste of the\n                   Fibre foam. And tonight's batch,\n                   well... I didn't get much of it,\n                   but it seems a little off.\n                          (smacking his lips)\n                   Can't fool the old taste buds,\n                   heh-heh. I think there might be\n                   an ingredient missing. So\n                   tomorrow, I'll run a couple of\n                   tests and stuff --\n                                 LAVA\n                   Rubble, Rubble! We're fighting a\n                   deadline to finish Slate City...\n                   and we're not pulling the plug on\n                   production to satisfy your\n                   tastebuds! If you ask me, you\n                   and your tastebuds are overworked\n                   ... overwrought... how long have\n                   you been with us, anyway?\n                                 BARNEY\n                   Nine days, Mister Lava.\n\n                                 LAVA\n                   Jumping Jurrasic, no wonder you're\n                   so run down.\n\n      He puts his arm around Barney, leads him towards the\n      car where Betty is waiting.\n\n                                 LAVA\n                   I'm authorizing a nice vacation\n                   for you, Rubble. Starting\n                   tomorrow. You can catch some rays,\n                   maybe invent something... hey,\n                   how about Fibrerock, the sequel,\n                   part II -- ?\n                                BARNEY\n                   But --\n\n                                 LAVA\n                   No, don't try and thank me.\n\n                                                   CUT TO:\n\n                                                           75.\n\n165   INT. SLATE'S OFFICE - DAY                                  165\n      Slate and Lava are examining a newer and larger model of\n      Slate City. It's even more grandiose than its\n      predecessor. Now the housing development has two huge\n      office buildings beside it, and then a convention center\n      beyond that.\n\n                              LAVA\n                ... As you can see, the Fibrerock\n                is so light we're using it for\n                construction, for furnishings...\n                for everything. You can't stack\n                a two-bedroom cave this high...\n                but the sky's the limit with\n                Fibrerock!\n\n                              SLATE\n                'Sky's the limit'... 'sky's the\n                limit'... why, these two buildings,\n                they... they practically scrape\n                the sky! We should call them...\n                Slate scrapers!\n                               LAVA\n                That's brilliant, Unc... Mister\n                Slate. In fact, maybe you can\n                help me with the centerpiece of\n                the complex...\n                       (indicating the\n                         convention center)\n                ... I wanna call 'em the\n                FibreSphere and the '____'\n                something Needle... but I just\n                can't...\n\n                              SLATE\n                       (modestly)\n                How about, 'Slate Needle'?\n\n                              LAVA\n                'Slate Need...'\n                       (astonished)\n                ... How do you keep coming up\n                with these? It's uncanny.\n                              SLATE\n                       (shrugging)\n                It's a gift...\n                              LAVA\n                       (casually)\n                Oh, that reminds me, sign these,\n                will you... just a few overruns\n                ... minor cost problems... that's\n                it... thank you...\n\n                                                  (CONTINUED)\n\n                                                             76.\n\n165   CONTINUED:                                                   165\n      Slate's so busy admiring his moment to himself he hardly\n      listens to what Lava's saying, just runs his stylus\n      through the wet clay of the statements, meanwhile\n      \"framing\" the model city in his hands.\n                                 LAVA\n                          (heading for the\n                           door)\n                   ... Oh, Mister Slate, we're going\n                   to hold the Bedrock Junior Talent\n                   Show in the uh, 'Slate Needle.'\n                   Good for public relations --\n      Lava breaks off.    He's just looked out the window and\n      seen --\n\n166   LAVA'S POV - QUARRY BELOW WINDOW                             166\n      A small figure appears behind some of the equipment,\n      tiptoeing from console to cabinet and thus towards\n      the assembly line.\n      Wearing sunglasses with attached nose and a hook-on\n      beard, it at first appears to be some sort of bizarre\n      hermit or bum... and then we realize, hey, this is\n      Barney!\n167   LAVA                                                         167\n\n      Looks around, spots Piltdown and Pyrite, now resplendent\n      in security guard uniforms. Lava whistles softly to get\n      their attention, can't. Then he sees one of Slate's\n      golf trophies. He shrugs, throws it.\n\n168   BELOW - PILTDOWN                                             168\n      Reacts as the trophy bounces off his head, then looks up\n      to see Lava gesticulating. Piltdown nods, grabs Pyrite\n      in tow.\n169   BARNEY                                                       169\n\n      Looking around carefully, Barney takes out a Thermos\n      bottle, unscrews the top, and quickly dunks it into the\n      Fibrerock foam. Then he tiptoes O.S., right into the\n      massive bulk of --\n\n170   PILTDOWN                                                     170\n      -- who looks down at him with a big smile, Pyrite at his\n      side.\n\n                                 PILTDOWN\n                   Can we help you... sir?\n\n                                                   (CONTINUED)\n\n                                                                77.\n\n170   CONTINUED:                                                      170\n                                 BARNEY\n                          (fake crotchety voice)\n                   Ah, yup, yup, young feller... jest\n                   show me the way to the personnel\n                   office... I'm lookin' fer a job\n                   as a custodian...\n\n                                   PYRITE\n                   Our pleasure.\n      Then they grab Barney with such force that the THERMOS\n      drops and SHATTERS, drag him O.S. --\n171   SLATE QUARRY - MAIN GATE - DAY                                  171\n\n      Barney is tossed outside, landing in a heap amidst the\n      picketing workers of Neolithic 101.\n                                 PILTDOWN\n                          (chuckling)\n                   Ya can start by cleaning the\n                   street with your pants!\n      Still laughing, Piltdown and Pyrite cross over to Lava,\n      who has come out of the office building.\n                                 LAVA\n                   That takes care of the half-pint.\n                          (pause)\n                   Now to deal with the half-wit.\n                                                      CUT TO:\n172   INT. LAVA'S OFFICE - DAY                                        172\n      Lava walks Fred from the door into the color-coordinated\n      high-style room.\n\n                                 FRED\n                          (on the move)\n                   ... But Barney doesn't want to\n                   take a vacation -- he says he's\n                   gotta be here to check up on the\n                   Fibrefoam --\n\n                                LAVA\n                         (pointedly)\n                   -- Oh? Or check up on us?\n      Emotionally, Lava turns, indicates a picture of Slate on\n      the wall.\n\n                                                      (CONTINUED)\n\n                                                              78.\n\n172   CONTINUED:                                                    172\n                                 LAVA\n                   Flintstone, that... that's a slap\n                   in the face of our founder... our\n                   employer... our uncle.\n                          (turning back,\n                           another tone)\n                   Unless, of course, you agree with\n                   Rubble... that Mister Slate isn't\n                   capable of running this operation\n                   ... that I'm not capable of\n                   running it?\n\n                                 FRED\n                          (nervous)\n                   Of course not, Mister Lava.\n                   But --\n\n                                 LAVA\n                   Call me Jerry. Sit down, please...\n      Fred complies. Lava winces as his designer FURNITURE\n      CREAKS under Fred's weight, but he only says --\n                                 LAVA\n                          (offering one)\n                   ... Cigar?\n                                 FRED\n                   Why, yeah, sure, Jerry.\n                                 LAVA\n                   Fred, let me get to the bottom\n                   slime. Some men -- you and me,\n                   for instance -- we're cut out for\n                   the big time, the big bucks...\n                          (eyeing Fred's\n                           girth)\n                   ... the big everything.\n      Lava smiles, prepares the tips on two cigars.      He puts\n      each one in turn in a gizmo on his desk.\n\n173   CLOSER - GIZMO                                                173\n      It's actually a frame supporting a little LIZARD. The\n      Lizard bites the tip off the cigar, practically chokes\n      on it, finally manages to spit it out with difficulty.\n                                 LIZARD\n                          (aside)\n                   When they say smoking is bad for\n                   your health, they're not kidding...\n\n                                                             79.\n\n174   BACK TO SCENE                                                174\n                               LAVA\n                And others?   Wellll...\n\n      Now Lava takes out a lighter, leans across the desk.\n175   CLOSER - LIGHTER                                             175\n\n      As Lava works the mechanism, two wooden twigs rub rapidly\n      across each other and ignite.\n176   BACK TO SCENE                                                176\n\n                              LAVA\n                ... Now, I know your pal Barney\n                had a small part in the preliminary\n                research and development of\n                Fibrerock...\n                              FRED\n                Well, actually, I wouldn't say\n                small part... I'd say...\n                              LAVA\n                Yes?\n                              FRED\n                ... Kind of a medium-sized... well,\n                almost medium-sized... well, really\n                a semi-partial assistant counsulting\n                type, of --\n                              LAVA\n                       (giving Fred a\n                        playful punch)\n                You're too kind, Flintstone,\n                that's what I like about you.\n                But you're a big guy with a big\n                decision to make. Are you gonna\n                keep covering for Barney, keep\n                pulling his acornsauruses out of\n                the fire... or are you going to\n                concentrate on your own important\n                duties?\n                              FRED\n                Well, gee, that's tough one --\n                       (pause)\n                -- Uh, what are my important duties?\n                              LAVA\n                Publicity, Flintstone, publicity!\n                              (MORE)\n                                                 (CONTINUED)\n\n                                                                 80.\n\n176   CONTINUED:                                                       176\n                                 LAVA (CONT'D)\n                   And that's why I've got a little\n                   surprise for you... for the man\n                   who made Fibrerock a household\n                   word, I want you to meet the man\n                   who's going to make you a household\n                   word...\n\n      Lava throws the door open.        Fred's jaw drops as he\n      sees --\n\n                                 FRED\n                   R-rockin' Leach?\n      Indeed, it is he, and he smiles, extends his hands.\n\n                                  LEACH\n                   'Ello,  Fred. I've 'eard a lot\n                   h'about  you from Mister Lava.\n                   H'at's  why we're going to put you\n                   on our  program.\n                                  FRED\n                   M-me?   On -- on television?\n                                 LAVA\n                          (patting his back,\n                           sotto)\n                   Right, Fred. As long as you\n                   forget all this nonsense about\n                   Barney.\n                                 FRED\n                          (still in a dazed\n                           thrill)\n                   Barney who?\n\n                                                      CUT TO:\n177   EXT. FLINTSTONE HOUSE - DAY                                      177\n\n      Three big dino-mounted trucks are parked in front. You\n      have to read the words on all three: \"ROCKSTYLES OF...\"\n      \"THE RICH...\" \"AND FAMOUS.\"\n\n      Technicians roll out gear, set up big spotlights, etc.\n\n178   CLOSER - YARD                                                    178\n      Rockin' Leach is surveying the place with an aide. Fred\n      and Wilma are with them. Leach makes a \"frame\" with his\n      hands, \"pans\" the area.\n                                                      (CONTINUED)\n\n                                                              81.\n\n178   CONTINUED:                                                    178\n                                 LEACH\n                   Hmm. Lovely little guest 'ouse,\n                   Mister Flintstone. So simple,\n                   so ordinary, so unexceptional...\n                   why, h'it's almost quaint. Let's\n                   say we start with the camera 'ere,\n                   except...\n\n      Leach breaks off, looks over the fence at the Rubble\n      homestead. He shakes his head sadly.\n\n                                 FRED\n                   W-what's wrong?\n                                 LEACH\n                   Well, just look at that yard over\n                   there... barbecues and trikes, not\n                   exactly the right image...\n                                 FRED\n                          (pointing)\n                   Maybe you could move those plants\n                   to block them out...?\n\n                                 LEACH\n                   Good idea. Rodney, get 'hoppin'\n                   with those greens.\n      The aide nods, gathers some workers. They start moving\n      the potted plants. Puzzled, Wilma comes over.\n                                 WILMA\n                   Fred, this was supposed to be a\n                   'typical evening' at the\n                   Flintstones, and you invited fifty\n                   people I don't even know. Now\n                   what's going on? Where are they\n                   taking my ficus-sauruses?\n                                 FRED\n                   It's the Rubble yard, Wilma.   It's\n                   just not the right image...\n      He starts away, suddenly notices his own barbecue and\n      trikes... quickly, without missing a stride, he tosses\n      a tarp over them, slides a potted plant over for good\n      measure.\n179   BARNEY AND BETTY'S HOUSE - SAME TIME                          179\n\n      Betty, hair and face done, but still in a slip, is\n      putting a reluctant Bam-Bam into a cute little blazer.\n      In the f.g., Barney finishes tying a black tie, then\n      struggles into a dinner jacket.\n\n                                                     (CONTINUED)\n\n                                                               82.\n\n179   CONTINUED:                                                     179\n                                 BETTY\n                   I don't know why you want to go\n                   to this thing... after the way\n                   Fred's been treating you lately --\n                                 BARNEY\n                   Fred's in a high-powered\n                   executive job, Betty. There's a\n                   lot of pressure on him.\n                                 BETTY\n                   Yeah... and it's all around his\n                   belt. If it wasn't for poor Wilma\n                   I wouldn't give him the Geological\n                   Time --\n\n                                 BARNEY\n                   Trust me, Betty. After the\n                   Fibrerock debut, he'll be the same\n                   old Fred.\n      Both react to the sound of HAMMERING and SAWING.\n      Curious, they go out the sliding bedroom door into the\n      yard and see --\n180   THEIR POV - THE FENCE                                          180\n      The television crew has just finished nailing boards up\n      over the top of the fence. Now the big potted plants\n      are dropped into place. With each hammer stroke or thud\n      a little more of the late afternoon sun is shut off\n      until Barney and Betty are in shadow.\n      Finally a canvas tarp is tossed as gracefully as pizza\n      dough, sails into the Rubble yard and covers their bird\n      bath. One last stray end lands on Barney's head.\n\n                                                     CUT TO:\n181   QUICK CUTS - FLINTSTONE YARD - ANGLE ON \"KLEIG LIGHTS\"         181\n\n      Inside each one, a little BIRD in hardhat and smoked\n      visor lights up the arc, gets knocked on his butt when\n      it catches.\n\n                                 BIRD\n                          (slowly getting up)\n                   I've heard of a flash in the pan,\n                   but this is ridiculous...\n\n182   ON DINO                                                        182\n\n      He's squirming uncomfortably under the attentions of two\n      crew members who are busy with scissors and combs and\n      brushes.\n                                                 (CONTINUED)\n\n                                                             83.\n\n182   CONTINUED:                                                   182\n      Finally, they're done and leave him.\n\n      He has been cut and trimmed like a French poodle. He\n      gets a glimpse of himself in the swimming pool and freaks\n      out. Then he arches his back, shakes out the hairstyle.\n\n183   CLOSER ON ROCKIN' LEACH                                      183\n\n      The MAIN TITLE of the show can be heard O.S.\n                                 ANNOUNCER (O.S.)\n                   And now... the man who brings you\n                   the romance and excitement you\n                   crave... from the casinos of\n                   Monte Carlrock to the glamour of\n                   Hollyrock, here's your guide to\n                   the Rockstyles of the Rich and\n                   Famous, Rockin' Leach!\n      Leach takes his cue from the director --\n                                 LEACH\n                          (INTO CAMERA)\n                   Good evening. Tonight we come\n                   to you live from the ah... charming\n                   pied a terre of the man of the\n                   'our, Fred Flintstone --\n      Leach pauses, hearing the sound of someone CHIPPING AWAY\n      at a stone tablet... he looks up at --\n184   HIS POV - FRED                                               184\n      He has just carved \"FREDERICK\" into a stone cue card\n      and points to it.\n185   BACK TO SCENE                                                185\n\n                                 LEACH\n                   'Ere we are at the 'ome of\n                   Bedrock's man o' the 'our,\n                   Frederick Flint--\n      More CHIPPING.    Leach looks up and sees:\n\n186   HIS POV - FRED                                               186\n\n      Now he's carved something grander.    Leach sighs, goes\n      on.\n\n                                 LEACH\n                   'Ere we are at the fabulous 'ome\n                   of Bedrock's man o' the 'our,\n                   Frederick von Flintstone --\n\n                                                          84.\n\n187   NEAR THE HOUSE                                            187\n      Barney and Betty appear, Bam-Bam in tow. They come out\n      into the yard. Betty waves at Wilma, who comes over,\n      whispers.\n                              WILMA\n                Thank heaven. There isn't one\n                person I know here.\n\n                              BARNEY\n                You mean beside Fred?\n\n                              WILMA\n                I mean including Fred.\n      They look over at --\n\n188   THE SET                                                   188\n      Where Leach has pulled Fred on camera. Fred is posing,\n      fluffing his ascot, etc. We notice a \"FVF\" embroidered\n      patch on his jacket.\n                              LEACH\n                Frederick, of course, is the man\n                behind Fibrerock -- the invention\n                that some predict will\n                revolutionize life in the future.\n                Frederick, 'ow does it feel to\n                know that you 'ave personally\n                brought the Stone Age as we know\n                it to a long-deserved end?\n                              FRED\n                       (very affected accent)\n                Well, Rockin', you're right, I\n                have affected destiny for all\n                mankind, and it's a sobering\n                thought. However, if I may add a\n                personal note at this time, I\n                myself cannot personally take\n                all the credit for Fibrerock...\n\n189   WILMA, BARNEY, BETTY                                      189\n      react with hopeful expressions --\n\n                               BARNEY\n                        (sotto, to them)\n                See?   What'd I tell ya?\n\n                                                             85.\n\n190   BACK TO SCENE                                                190\n                              FRED\n                No, I could never have done it\n                without the inspiration and\n                support of a very special person.\n                I'm speaking, of course, of my\n                close friend and associate,\n                Mister Slate, founder and C.E.O.\n                of Slate Construction...\n191   WILMA, BARNEY, BETTY                                         191\n\n      Barney's face falls.   So do Wilma and Betty's.\n                                                   CUT TO:\n\n192   EXT. SLATE CITY - NIGHT                                      192\n\n      Slate City! In the far future, Manhattan will have New\n      Jersey... Philadelphia will have Levittown... L.A. will\n      have Burbank... but today Bedrock has... Slate City!\n193   CLOSE ON \"SLATE NEEDLE\" AND FIBRESPHERE                      193\n      Both decorated in pennants and bunting, connected to each\n      other by a gangway six stories up. Block letters on the\n      Fibresphere proclaim \"Slate Construction brings you THE\n      WONDERFUL WORLD OF FIBRE.\" A heroic statue of Slate\n      himself stands close by the structures. (Sphere and\n      needle, of course, are dead on parodies of the Trylon\n      and Perisphere, centerpieces of the '39 World's Fair.)\n      A limousine pedaled by two chauffeurs pulls up. Mr. and\n      Mrs. Slate and Lava, and Lava's son, POINDEXTER, get out.\n      It is immediately evident that the little obnoxious acorn\n      hasn't fallen far from the tree.\n                              POINDEXTER\n                Wow! Is this ever keen! Dad, you\n                promise I can cut in all the lines?\n                              LAVA\n                Of course, Poindexter, of course.\n      They head for the mastodon    and pully-powered elevator.\n      Standing there are Piltdown    and Pyrite, both in security\n      guard uniforms. (Piltdown     is carrying a vaguely-familiar\n      satchel). Lava gives them     a big look. They nod. As\n      the elevator rises, his two    cronies duck into a stairwell\n      marked \"NO ADMITTANCE.\"\n\n                                                   CUT TO:\n\n194   RESUME - FLINTSTONE HOUSE                                    194\n      The party is in full swing.\n                                                   (CONTINUED)\n\n                                                               86.\n\n194   CONTINUED:                                                     194\n      We see Pebbles and Bam-Bam squirming uncomfortably in\n      their party clothes. They take some canapes off of a\n      table, take a bite... spit them out.\n195   FRED                                                           195\n\n      Stands beaming, nodding to his guests.\n\n                                 FRED\n                   Hello, hello. Bon soir. Good to\n                   see ya... glad you could make it...\n\n                                 GUEST\n                          (unconvincingly)\n                   Hello, Frank...\n\n                                 FRED\n                   Fred -- there's the bar, make\n                   yourself at home -- mi casa es\n                   votre casa, so, when in Rome and\n                   all that --\n                                 WILMA\n                          (coming over)\n                   Fred, can I talk to you -- ?\n                   Fred? Fred?\n                          (concerned)\n                   We have a serious problem with\n                   Betty and Barney.\n                                 FRED\n                          (alarmed)\n                   You mean you can see their\n                   house -- ?\n                                 WILMA\n                          (exasperated)\n                   I mean you're treating them\n                   horribly! What's come over you,\n                   Fred? Does a little money mean so\n                   much to you that you just turn\n                   your back on the things that\n                   really count?\n                                 FRED\n                   Wilma, I'm shocked. I wouldn't do\n                   that. Okay, I admit it: I'm\n                   trying to make an impression here,\n                   I wanna look good, I wanna be a\n                   success...\n\n      He takes her hand, looks into her eyes.       For a moment,\n      Wilma's face softens.\n                                                      (CONTINUED)\n\n                                                               87.\n\n195   CONTINUED:                                                     195\n                                 FRED\n                   ... But deep down inside, I'm\n                   still the same lovable guy you\n                   married --\n                          (pause)\n                   -- Frederick von Flintstone the\n                   third --\n\n                                   WILMA\n                   Arrrgh -- !\n\n      She throws up her hands, stalks away.\n                                   FRED\n                   What'd I say?\n\n196   PRODUCTION ASSISTANT                                           196\n      Hangs up the sea shell phone, runs over to Leach.\n                                 P.A.\n                   That was our location guy at Slate\n                   City. They just moved the ribbon\n                   cutting up by an hour. Guests are\n                   already starting to arrive.\n                                 LEACH\n                   Fabulous! I've 'ad enough crab meat\n                   and crabgrass to last me a year.\n                   All right, boys, that's a wrap!\n197   FRED                                                           197\n      In the middle of a tight little group which is pigging\n      out. Fred seems oblivious to the fact that they're\n      oblivious to him.\n\n                                 FRED\n                   ... Yas, yas, it's a challenging\n                   commodity market these days.\n                   Personally, I'm considering\n                   petrified forests, but they do\n                   say that volcano futures are\n                   ready to explode, ha, ha...\n\n      Suddenly Fred notices that his \"audience\" has evaporated.\n      He looks around, sees everyone headed for their cars,\n      the TV crew packing up, etc.\n                                 FRED\n                   ... Hey, whoa, what's happening --\n\n                                                      (CONTINUED)\n\n                                                               88.\n\n197   CONTINUED:                                                     197\n                                 LEACH'S AIDE\n                   What's happening isn't happening\n                   here. The action's over at Slate\n                   City. Oh, thanks for the booze,\n                   Ed --\n\n                                FRED\n                   Fred!\n      He stumbles through the thinning crowd, clutching at\n      elbows.\n\n                                 FRED\n                   Hey, what's the hurry? We got a\n                   cake shaped like a piece of\n                   Fibrerock... I got it, how about\n                   some charades? No, even better,\n                   twenty questions: 'Am I animal,\n                   mineral, or fossil'...? Oh, I\n                   heard a great one the other day\n                   ... a guy walks in a bar with a\n                   duckasaurus on his head and the\n                   bartender says -- this'll kill\n                   you, the bartender says --\n      Fred stops, running out of steam along with his moment of\n      glory. He stands alone on the lawn. Wilma slowly comes\n      up to him.\n\n                                 WILMA\n                   Fred... I... I'm sorry it's not\n                   working out...\n      Fred turns, puts on a big smile.\n                                 FRED\n                   Whaddya mean, not working out?\n                   They're goin' party hopping,\n                   that's all. That's what ya do in\n                   society, Wilma... you cruise\n                   around. They'll go over to\n                   Slate's shindig for a while,\n                   then they'll come back here.\n                                WILMA\n                   Fred...\n\n                                 FRED\n                   You go on over to Slate City,\n                   okay?\n\n                                 WILMA\n                   Fred, I want to be here with you --\n                                                      (CONTINUED)\n\n                                                            89.\n\n197   CONTINUED:    (2)                                            197\n                                 FRED\n                   Nah, me and some of the guys from\n                   the country club, we're gonna play\n                   poker, yeah, big stakes poker\n                   until everybody comes back. Go on\n                   with the others. The kids got\n                   their show to put on anyway... and\n                   I wouldn't want people to think...\n                   to think the Flintstones were\n                   party poopers.\n\n      She doesn't know what to say, or what she can say that\n      won't shatter his shaky image. She sighs, kisses him,\n      then calls out.\n\n                                 WILMA\n                   Come on, Pebbles. We're going to\n                   another party.\n                                 PEBBLES\n                   Will there be real food there?\n                                 WILMA\n                   We'll find out together.\n      She takes the girl's hand and goes to the door, where the\n      last of Leach's crew is just going out. Suddenly Betty\n      catches up to her, Bam-Bam in tow.\n\n                                  BETTY\n                   Wilma, wait.   I'm going with you.\n                                  WILMA\n                   Why?\n                                 BETTY\n                   If friends can't do something\n                   stupid, who can?\n      Wilma smiles, touched.\n\n                                 BETTY\n                   Besides...\n                          (lowering her voice)\n                   ... Maybe if we leave the boys\n                   alone...?\n\n      Wilma nods, hopeful.\n198   EXT. FLINTSTONE HOUSE - NIGHT                                198\n\n      The film crew caravan   is already leaving as Wilma, Betty\n      and the kids get into   the Rubble car. The last TV crew-\n      man extinguishes the   big spotlight. The house is dark,\n      forlorn in the fading   twilight.\n\n                                                            90.\n\n199   REAR OF YARD - NIGHT                                        199\n      Fred sits forlorn in the rubble of his party.   Dino comes\n      over, nuzzles his leg.\n\n                              FRED\n                Just you and me now, Dino. Yeah.\n                That's okay. Man and man's best\n                friend.\n\n      He gives Dino one of the canapes. Dino tastes it, makes\n      a face, spits it out. DINO runs off, going \"PTOOIE\" all\n      the way. We see him run to the corner, jump in Betty's\n      car and drive away.\n200   FRED                                                        200\n\n      sighs, looks around, down at his blazer and the \"FVF\"\n      patch. He suddenly rips it off in a fury. Then he looks\n      at --\n201   THE WALL IN FRONT OF BARNEY'S PROPERTY                      201\n202   BACK TO SCENE                                               202\n      Fred stares at it, his face slowly darkening. Then he\n      grabs a lawn chair from the yard, begins to smash it in\n      a fury against the divider. The wall cracks, splinters;\n      the potted plants go flying.\n203   FRED                                                        203\n      His anger spent, he stands panting, splattered with\n      dirt... then he sees --\n204   NEW ANGLE - ANOTHER DIRT-COVERED FIGURE                     204\n      -- standing in the ruins of the wall. The figure\n      sneezes, whacks dirt off of itself. It's --\n\n                              FRED\n                       (disbelieving)\n                B... Barney?\n\n                              BARNEY\n                       (moving closer)\n                Hiya, Fred.\n                       (noticing his ruined\n                        tuxedo)\n                Boy, the rental place is gonna\n                be mad...\n                       (eyeing the mess)\n                ... You feeling better, pal?\n\n                                                 (CONTINUED)\n\n                                                              91.\n\n204   CONTINUED:                                                    204\n                                 FRED\n                   'Pal'? How can you call me that?\n                   Barney, I... I've been such a...\n                   such a... such a...\n                                  BARNEY\n                   Creep?\n\n                                  FRED\n                   Well, yeah.   But more of a --\n\n                                   BARNEY\n                            (helpful tone)\n                   Fool?\n\n                                  FRED\n                   Well --\n                                 BARNEY\n                   Slimeball? Louse? Jackass?\n                          (snapping fingers)\n                   Stuck-up blimpasaurus?\n                                 FRED\n                          (wincing, but\n                           taking it)\n                   Barney... can... can you ever\n                   forgive me for being such a jerk?\n\n                                 BARNEY\n                          (stepping closer)\n                   Sure, Fred.\n                          (smiling)\n                   I've had lots of practice.\n                                 FRED\n                          (touched)\n                   Aw, Barn...\n      And he grabs Barney in a big bear hug. Tears in both\n      their eyes, they slap each other on the back, two\n      prehistoric sensitive guys.\n                                                    CUT TO:\n\n205   FIBRESPHERE & SLATE NEEDLE - NIGHT                            205\n\n      Little cupola cars are chugging around the upper level\n      of the Fibresphere, where they enter a tunnel-like open-\n      ing labeled \"THE WORLD OF FIBRE.\"\n\n      Wilma, Betty, the kids and Dino are in one of these.\n      Now, we FOLLOW them as they chug into --\n\n                                                          92.\n\n206   THE FIBRESPHERE \"WORLD OF FIBRE\" RIDE                      206\n      The cupolas rattle along in Disneyland style, passing a\n      sign which reads: \"FIBREROCK--TRANSFORMING THE HOME.\"\n      Here, mechanical figures in an all-Fibre home move\n      klutzily around the room.\n                              RECORDING (V.O.)\n                       (a la 'The Great\n                        Gildersleeve')\n                Welcome! Welcome to the fabulous\n                world of tomorrow... a world\n                brought to you by Fibrerock!\n\n207   REVERSE ANGLE                                              207\n      REVEALING that behind the hollow shells of the human\n      family is a veritable family of monkeys, all working the\n      figures like puppets. A PARROT at a stand-mounted\n      microphone is giving the narration.\n                              PARROT (RECORDING) (V.O.)\n                Here, we see a typical family of\n                the future, free of the cares and\n                worries of today... yes, the great\n                kibble crisis is a thing of the\n                past when you're living the good\n                life... the Fibrelife!\n208   NEXT EXHIBIT                                               208\n\n      The CARS CHUG past a display of tree trunks, leaves,\n      bubbling gunk... and those iridescent vegetable pearls\n      we've come to know... coo-coo berries. Iron bars and\n      vault-like doors separate the coo-coo berries from the\n      other items.\n                              ANOTHER PARROT\n                Here, gathered from the four\n                corners of the globe, are the\n                secret ingredients of Fibrerock...\n                some common, some rare... all\n                making life easier for you and\n                yours!\n209   THIRD EXHIBIT                                              209\n\n      The little CARS CHUG into an elegant salon, complete with\n      runway. There's another PARROT here in front of another\n      megaphone, but this parrot is chic and flamboyant.\n                              FASHION PARROT\n                But does Fibrerock belong only in\n                the kitchen, the garage, the\n                workplace? No, no, no, my\n                darlings!\n\n                                                             93.\n\n210   FASHION MODELS ON RUNWAY                                     210\n      As each girl struts forward, she shrugs off a bulky\n      animal fur and tosses it into a garbage can. Underneath\n      are all kinds of daring and tantalizing fashions woven\n      in the tell-tale fibre colors. The clothes are a blend\n      of the future and retro (that is, prehistoric retro).\n\n                              FASHION PARROT\n                Because the clothes of the Stone\n                Age are as extinct as stones\n                themselves! Yes, thanks to the\n                wonder of Fibrerockfibre, the world\n                of high fashion will be totally\n                transformed... by Fibre furs...\n                Fibre frocks... Fibre foundations\n                and Fibreshoes... it's to die\n                for!\n\n211   FOURTH EXHIBIT                                               211\n      Now, we see a display of Fibrerock props of all kinds --\n      appliances, toys, tools, etc... all of it upstaged by a\n      choir consisting of every animal, bird and critter we've\n      seen in this film. Wilma, Betty, the kids and Dino ooh\n      and ahh with the other guests as the mechanical animals\n      all sing in unison --\n                              FIBRE CHOIR (V.O.)\n                'It's a Fibre World you know,\n                It's a Fibre World you know,\n                It's a Fibre World you know -- '\n                                                   CUT TO:\n212   INT. BARNEY'S WORKSHOP - NIGHT                               212\n      Fred and Barney are surrounded by books and cartons and\n      memorabilia. They have their arms around each other and\n      are singing.\n                              FRED & BARNEY\n                'Now it's time to do or die, grab\n                that rock and kick it high, let's\n                fight, fight, fight for Bedrock\n                High!'\n\n      They break up laughing. Fred chuckles, looks at one of\n      the many old photographs strewn around.\n                              FRED\n                Boy, those were the days, Barney.\n                Bedrock High winning all those\n                games... and you and me right in\n                the middle of it.\n\n                                                            94.\n\n213   NEW ANGLE - FAVORING PHOTO                                  213\n      The photograph (dots in stone) shows the young Fred and\n      Barney in their cheerleading costumes. Barney has a\n      sweater and megaphone; Fred is in a Godzilla-like\n      \"mascot\" costume. He's holding the hideously-sculpted\n      head under his arm.\n\n                              BARNEY\n               Yeah.   Too bad we never made the\n               team.\n                             FRED\n               So what? We made the team spirit.\n               That's just as important...\n               whatever happened to those\n               cheerleader costumes?\n\n                             BARNEY\n               You know Betty. She never throws\n               anything away.\n      He hauls out an old footlocker, opens it.    There they\n      are.\n                               FRED\n                        (rummaging in it)\n               Boy.    Talk about memories.\n      Fred tosses the cheerleader sweater to Barney, who grins,\n      pulls it on. Fred also starts to get into his old\n      \"uniform,\" but has to suck his gut in mightily. Finally,\n      he can zip it up, stern to stem.\n                             FRED\n               Back then, we thought a pop quiz\n               was a big problem. We didn't\n               know how good we had it. No\n               problems, no worries...\n\n      Saying this, Fred attempts to put on the Godzilla-like\n      head. He has a hard time sliding it into a hinge rail\n      behind his neck, an even harder time swinging it down and\n      forward.\n                             BARNEY\n               Speaking of problems and worries,\n               shouldn't we get on over to\n               Slate's party?\n      Fred has finally \"clinked\" the monster head down into\n      place. Now, when he talks, the monster's mouth moves in\n      sync.\n\n                                                   (CONTINUED)\n\n                                                                95.\n\n213   CONTINUED:                                                      213\n                                 FRED\n                          (echo-y)\n                   What for? So him and all his\n                   fancy friends can look down their\n                   noses at us?\n\n      Completely covered in the ferocious-looking suit, Fred\n      steps over to Barney, stabs an angry claw in his\n      direction.\n                                 FRED\n                          (echo-y)\n                   All they've been doing is using us,\n                   Barney. And meanwhile --\n\n      Now Fred reaches up to take the head off. It sticks for\n      a moment. Finally he gets it to flip back on its hinge\n      where it hangs behind his neck like a ski parka hood.\n                                 FRED\n                          (normal voice)\n                   -- Meanwhile all the time they\n                   were laughing at us.\n\n                                  BARNEY\n                   Yeah?   When did you notice that?\n                                 FRED\n                   About an hour ago.\n                                 BARNEY\n                   Boy, there's no fooling you, Fred.\n      Suddenly, with a GROWING CREAKING, CRACKING and TINKLING,\n      a scale model of Slate City in the corner begins to fall\n      apart.\n\n      Fred and Barney look at each other, startled, then rush\n      over to the model. It's the interim version we saw\n      earlier.\n\n214   CLOSER - MODEL                                                  214\n      The decomposition continues, walls and supports turning\n      into sand and running down before our eyes. In a Rube\n      Goldberg-like continuum, the little houses go first,\n      falling like dominoes...\n                                 FRED\n                   Wha... what's happening?\n\n      Barney tries to stop the process, can't.\n                                                       (CONTINUED)\n\n                                                             96.\n\n214   CONTINUED:                                                   214\n                                 BARNEY\n                   I... I don't know... the Fibrerock\n                   it's... it's decomposing... but\n                   this shouldn't happen...\n                                 FRED\n                   Your old models are just fine...\n\n215   ANGLE                                                        215\n      Indeed, the older models from Barney's tinkering days\n      are rock solid.\n216   BACK TO SCENE                                                216\n\n                                 BARNEY\n                   It should be. There's enough\n                   coo-coo berry resin in there to\n                   petrify a brontosaurus --\n      Suddenly Barney gets it. He looks from the older models\n      to the now decomposing little Fibresphere with growing\n      awareness.\n\n                                 BARNEY\n                          (snapping his fingers)\n                   -- The coo-coo berries! Fred,\n                   that's it!\n\n                                FRED\n                   What's it?\n                                 BARNEY\n                   Remember I said the Fibrefoam\n                   tasted funny? It was the coo-coo\n                   sap that was missing!\n\n                                 FRED\n                   But.. why would --\n                                 BARNEY\n                   Why? Because coo-coo berries are\n                   as valuable as goldrock! And\n                   we've had tons of 'em delivered\n                   to the plant since we started...\n                   somebody musta got greedy --\n\n                                 FRED\n                   -- Not 'somebody' -- Lava!\n\n                                 BARNEY\n                          (alarmed)\n                   Fred, that sap acts as a fixative\n                   -- it's the glue that holds the\n                   whole formula together -- !\n                                                    (CONTINUED)\n\n                                                                97.\n\n216   CONTINUED:                                                      216\n                                 FRED\n                          (with mounting concern)\n                   Then... what's happening here...\n                                 BARNEY\n                          (finishing it)\n                   ... Is gonna happen for real in\n                   the real Slate City!\n                                 FRED\n                   Oh no... Barney! Wilma and Betty\n                   -- and the kids -- they're all\n                   there --\n      With a final WHIMPER, the little FIBRESPHERE CAVES IN\n      and then the nearby SLATE NEEDLE CRUMBLES, model story\n      by model story. Finally the \"DISK\" on top of the needle\n      is all that's left, wobbling around like a spun dinner\n      plate. It finally falls... EXPLODES.\n                                 FRED\n                          (worried)\n                   -- B-barney... what do we do?\n\n      Barney runs to a locker, grabs a big plunger-powered\n      flit gun, begins filling it with a red liquid.\n                                 BARNEY\n                   Coo-coo berry sap, Fred! It's\n                   our only chance -- their only\n                   chance!\n      Barney gives it a quick test squirt. Fred nods, and they\n      rush out of the room. CAMERA PUSHES IN ON the ruins of\n      the model \"Slate City\"...\n                                                      CUT TO:\n\n217   INT. SLATE NEEDLE - NIGHT                                       217\n      WIDEN FROM a young kid who is drinking a glass of water\n      and simultaneously singing with a ventriloquist's dummy.\n      Obviously, the talent show has begun.\n      In the audience, Lava fidgets with nervous and confident\n      energy... gives Wilma a big look.\n\n                                 LAVA\n                   You're certainly looking lovely\n                   this evening, Mrs. Flintstone.\n                   Life with a junior executive must\n                   agree with you.\n                                                      (CONTINUED)\n\n                                                          98.\n\n217   CONTINUED:                                                 217\n                                 WILMA\n                   Uh... thank you... I think.\n\n                                 LAVA\n                          (looking into her\n                           eyes)\n                   Yes. I think so, too.\n                          (smiling)\n                   Imagine how good you'd look\n                   with a senior executive.\n\n                                  WILMA\n                   Oh?   Is Fred getting promoted?\n      Lava laughs, sure she's kidding... then not so sure. The\n      ventriloquist finishes to scattered applause. The kid\n      bows, gets up... splashes across puddles of water on the\n      stage area. The Headmistress of L'ecole Superior et al\n      steps up. Behind her, the picture window displays the\n      expanse of Slate City: The twin Slatescrapers framing\n      endless rows of little tract houses stretching to the\n      distant volcanic ridge.\n                                 HEADMISTRESS\n                          (as applause dies)\n                   Sank you, ladies and gentlemen.\n                   An' sank you, Monsieur Slate for\n                   zis lovely setting. Zoot alors,\n                   zis will ze mos' fantas'tic\n                   recital in Bedrock 'istoree. Now,\n                   I would like to sank out mos'\n                   generous benefactress, Madame\n                   Slate for her fine support o'vair\n                   zee years --\n      She gestures into the audience, where Mrs. Slate stands,\n      waves a gloved hand like the Queen Mother.\n\n                                 HEADMISTRESS\n                   -- An' now, what better\n                   introduction could we 'ave for\n                   Mrs. Slate's vairy own gran'\n                   nephew... Poindexter Lava!\n      She steps aside. Curtain rises on little Poindexter.\n      He is carrying a leather-and-bone accordion. He begins\n      to play:\n                                 POINDEXTER\n                          (singing loudly)\n                   'Dino of Spain, I adore you\n                   Right from the moment I saw you -- '\n\n                                                             99.\n\n218   QUICK SHOTS - AUDIENCE                                       218\n      Their smiles become fixed. (Up on the spotlights, the\n      little birds who operate the lights put earplugs in their\n      ears.)\n      In the wings with Pebbles and Bam-Bam, DINO MOANS, hides\n      his head under his paws.\n\n      On the refreshment table, GLASSES CRACK... a cake falls.\n219   CLOSE ON LAVA                                                219\n\n      He surreptitiously checks his wrist watch...\n                                                   CUT TO:\n\n220   INT. EMPTY FIBRERIDE - TIGHT ON ANOTHER WATCH - NIGHT        220\n\n      This one a pocket job. (Like Lava's, it's really a\n      little sundial with a built-in burning match above it to\n      provide a shadow!) We WIDEN, and see that this watch\n      is held in a green, scaley claw.\n221   ANOTHER ANGLE                                                221\n\n      It's the xenosaurus, lurking behind the   exhibits! Now,\n      the CREATURE GRUNTS confidently, lights   up a cigar.\n      Then it picks up a canvas bag and a big   toolbox and\n      tiptoes into the deeper recesses of the   Fibre ride.\n\n                                                   CUT TO:\n222   INT. FRED'S CAR - TRAVELLING                                 222\n      Fred and Barney rush along, Fred at the wheel.\n                              FRED\n                What'll we do when we get there?\n\n                              BARNEY\n                We just tell Mister Slate that all\n                500 acres of his development are\n                going to crumble into dust any\n                minute.\n                       (holds up the\n                        flit gun)\n                Then we zap the stairs and\n                corridors with some of this\n                coo-coo sap. I just hope we have\n                enough to get everybody out --\n                whoops!\n\n      He's said this last because as he held up the flit gun,\n      the handle whacked the back of Fred's monster costume,\n      and the head has flipped down with a solid \"clink.\"\n\n                                                   (CONTINUED)\n\n                                                              100.\n\n222   CONTINUED:                                                     222\n                                 FRED\n                   Barney -- !\n                          (swerving all\n                           over the road)\n                   -- I can't see straight --\n\n      Barney gets up on his knees, grabs the wheel with one\n      hand and the monster head with the other.\n                                 BARNEY\n                   Hang on, hang on --\n\n      Oops. He rotates the head completely around. Fred\n      flails around. Barney grabs the wheel with one hand,\n      tries to help Fred with the other.\n\n223   EXT. CAR - NIGHT                                               223\n      It careens around even more wildly now.      There's several\n      near collisions.\n                                                    CUT TO:\n224   EXT. \"ROCKDONALD'S\" RESTAURANT - NIGHT                         224\n      \"Rockdonald's\" is, of course, complete with golden arches\n      of stone, a drive-up window, etc. It even has the oblig-\n      atory cops on a break... in this case, Feldspar and\n      Gravel. They're sitting in their patrol car eating from\n      little bamboo containers shaped just like McDonald's\n      Styrofoam. (Of course, the logo on the building behind\n      them proudly reads \"OVER 100 SOLD.\")\n                                 FELDSPAR\n                          (mouth full, bitching)\n                   Speed traps again! Face it,\n                   Gravel. I'm in a rut... and\n                   meanwhile, the guys who went\n                   through the academy with me,\n                   they're all big shots now:\n                   Sam Slate... Dirty Harock...\n                   Magma, P.I. And you know why?\n                   'Cause they got the breaks,\n                   that's why!\n\n      Suddenly both officers react to the sound of SKIDDING\n      TIRES and HONKING HORNS. They look out their window\n      at --\n225   FRED AND BARNEY - DRIVING PAST                                 225\n\n      both still battling the wheel and the resistant costume\n      head. (By now their gyrations have put Barney's face\n      inside the jaws of the monster mask.)\n\n                                                            101.\n\n226   BACK TO SCENE                                              226\n                              GRAVEL\n                S-sarge, d-did you see that? Some\n                sorta creature was attacking that\n                little guy -- !\n                              FELDSPAR\n                There's a lesson there, Gravel...\n                never pick up hitchhikers.\n                Besides --\n                       (realizing)\n                -- Did you say 'creature'?\n\n      They do a big double-take at the now-vanishing car.\n                              FELDSPAR & GRAVEL\n                The xenosaurus!\n\n      Excited, Feldspar bangs his dashboard and a DISPATCH\n      PARAKEET in a police uniform pops INTO VIEW. Feldspar\n      grabs it around the neck, holds it like a microphone.\n                              FELDSPAR\n                This is a xenosaurus alert.\n                Repeat, a xenosaurus alert. The\n                creature has been sighted on the\n                Slate City exit of the Venturock\n                Freeway! It is driving a brown\n                late model sedan and eating a\n                white male Caucasian. Car twelve\n                is in hot pursuit.\n      He releases the bird, which doesn't fly away right away,\n      but gives him a look.\n\n                              FELDSPAR\n                       (remembering)\n                Oh, yeay... over and out!\n\n      The bird nods, appeased, flies off.\n                              DISPATCH PARAKEET\n                       (as it goes)\n                Awwk! Car Twelve is on the way.\n                Car Twelve is on the way...\n\n                              FELDSPAR\n                       (thrilled)\n                Gravel, this could mean promotions\n                for both of us!\n                       (trotting up to\n                        speed)\n                Load the shotgun and turn on the\n                siren!\n\n                                                          102.\n\n227   FRED'S CAR - TRAVELLING                                    227\n      Barney is rocking Fred's head back and forth, finally\n      gives it one last mighty yank. Something breaks.\n      Barney falls back on the passenger side of the car.\n      Fred drives with one hand, \"raps\" the monster head.\n      It rattles. When Fred speaks again, the monster mouth\n      no longer opens and closes in sync.\n\n                              FRED\n                       (muffled, shouting)\n                Ho, gweat! Hoo bwoke hit,\n                Bahnee! Hi khnat twalk hennymore!\n      Suddenly both men (pardon, man and xenosaurus) react to\n      an approaching SIREN. They both look back at --\n\n228   FELSPAR'S PATROL CAR                                      228\n      Closing in. Gravel has produced a little sabre tooth\n      CAT and is \"cranking\" its tail. As it WAILS away, the\n      cops close in on our heroes.\n229   BACK TO SCENE                                             229\n\n                              FRED\n                Ho noh! Ahhrisser Felghspah!\n                       (turning to Barney)\n                Haybee whee hould shtop -- ?\n\n                              BARNEY\n                What, and explain what you're\n                doing in that costume? Start\n                talking about coo-coo berries and\n                Fibrerock? By then it'll be too\n                late!\n                              FRED\n                'Hen yore height, yore height...\n      Fred pours on more speed. They careen around a turn.\n      CAMERA WHIP PANS TO a road sign: SLATE CITY--1 MI.\n\n230   SLATE CITY - REAR GATE                                    230\n      A fence surrounds the empty housing development; in the\n      distance, we can see the dark Slate Scrapers, and past\n      them, the brightly-lit and gleaming Fibersphere and\n      Slate Needle.\n      We hear a SCREECH and then the CAMERA PANS BACK to pickup\n      Fred's CAR as it whips around a turn, two wheels off the\n      ground. It crashes right into the gate, knocking down a\n      sign reading \"SLATE CITY--DELIVERY GATE.\" The fence\n      collapses all around the car.\n\n                                                             103.\n\n231   NEW ANGLE                                                     231\n      Fred and Barney stagger out of the wreck. Barney,\n      covered with debris, rummages around and sighs with\n      relief when he finds the flit gun of coo-coo sap is\n      still intact.\n                                BARNEY\n                         (hearing a siren)\n                  We'd better split up; that way at\n                  least one of us can make it to the\n                  Slate Needle -- !\n\n                                 FRED\n                  'Ood hidea.   Ood whuk, ol' bhudee.\n      They slap hands together like basketball players, then\n      head off in two directions.\n\n                                                   CUT TO:\n232   INT. SLATE NEEDLE                                         232\n      CAMERA PANS the audience as the accordion recital con-\n      tinues. Several people look visibly ill. Finally,\n      CAMERA ADJUSTS to take in Poindexter's big finish as he\n      slides forward on his knees.\n      There's a scattering of half-hearted applause, led by\n      Lava and the Slates.\n\n                                HEADMISTRESS\n                  Sank you, sank you. Our nex'\n                  performance is Bam-Bam, Pebbles...\n                         (checking notes)\n                  ... an' friend.\n      She steps aside as a spotlight picks out --\n\n233   PEBBLES, BAM-BAM & DINO                                   233\n      poised in the stances we recognize as the \"first\n      positions\" of the \"Dino Dance.\" However, whereas the\n      previous version of this was done impromptu and\n      a cappella with only a few primitive props and straw\n      hats alone, this time the kids and Dino are fully\n      costumed, with sequins, batons and the like, and the\n      dance is completely choreographed.\n\n                                KIDS\n                  You can keep the twist,\n                  the frug and hop --\n\n234   VARIOUS ANGLES                                            234\n      As the Dino dance begins, FULL ORCHESTRATION OVER IT.\n      The audience seems to really like it -- all except --\n\n                                                             104.\n\n235   MRS. SLATE                                                    235\n      who glances over at the judges long enough to see that\n      they like this a lot better than the accordion act.\n      Suddenly Mrs. Slate jumps up, barges on stage. The\n      MUSIC DIES.\n                                 HEADMISTRESS\n                   Madame Slate, what ees wrong -- ?\n\n                                 MRS. SLATE\n                   I'll tell you what's wrong! This\n                   'act' is an absolute disgrace!\n                   This is supposed to be a talent\n                   show!  And a pedestrian animal act\n                   like this belongs in a circus!\n\n236   WILMA AND BETTY                                           236\n\n      React, furious, jump out of their seats.\n                                 BETTY\n                   A circus, huh? Well, if our kids\n                   belong in a circus with their act,\n                   then your little nephew belongs in\n                   a zoo with his --\n                                 WILMA\n                   Yeah -- a zoo where the animals\n                   are dead -- because if they aren't,\n                   they will be!\n                                 MRS. SLATE\n                   Why, how dare you! Mrs.\n                   Flintstein, I'll have you know\n                   that my little Poindexter has been\n                   trained by the finest tutors!\n                   Poindexter! Show them! Encore!\n\n      The kid jumps up, begins to play. Immediately another\n      GLASS SHATTERS. But then the CEILING FIXTURES CRACK,\n      and then the PICTURE WINDOW PANELS begin to SHATTER one\n      by one.\n\n                                 MRS. SLATE\n                          (alarmed)\n                   Ah... Poindexter... that's enough\n                   ... Poindexter...?\n\n      The kids stops... But another WINDOW PANEL EXPLODES.\n      Then one of the tables collapses.\n\n      Pause. Every head in the room swivels around and stares\n      at Poindexter. Nervous, he tosses the accordion aside.\n      But the destruction continues: Another WINDOW PANEL\n      SHATTERS. Then, the entire building shakes.\n\n                                                             105.\n\n237   SLATE                                                         237\n      Loses his balance, grabs onto Lava for support, ends up\n      pulling him down, too. Slate gets to his knees and looks\n      out the window... and his jaw drops in astonishment.\n238   HIS POV - SLATE CITY                                       238\n\n      In the distance, with a CRACKLING ROAR, the little rows\n      of Fibrerock tract houses are falling like dominoes in\n      a wave that is rolling toward the Slate Needle.\n239   SLATE CITY DEVELOPMENT - NIGHT                             239\n\n      A flashlight beam  rakes the CAMERA. Feldspar, shotgun\n      in one hand, light  in the other, looks around cautiously.\n      (The shotgun has a  slingshot mechanism; the flashlight\n      is a mirror-backed  candle.)\n\n      Behind him, FOOTSTEPS APPROACH.   Feldspar tenses, but\n      it's --\n                              GRAVEL\n                No sign of the driver...\n                              FELDSPAR\n                You kidding? By now he's a couple\n                of shinbones and a belch.\n      Gravel drops down on one knee, excited.   He shines his\n      light on Fred's big \"clawprints.\"\n                              GRAVEL\n                Holy cowasaurus! Look how deep\n                these tracks are! That xeno thing\n                must weigh a ton!\n      They aim their lights at the tracks, begin to follow\n      them. Suddenly they round a corner and come face to\n      face with --\n240   NEW ANGLE - FRED                                           240\n\n      He's stopped between two sample homes to wrestle with\n      the monster head again. Now, he freezes in twin flash-\n      light beams!\n\n                              FELDSPAR\n                Okay, lizard, reach for the sky!\n      Fred hesitates... then, hearing a CREAK and GROAN, he\n      looks at the HOUSE beside him. The stucco-like exterior\n      of Fibrerock is beginning to crumble.\n\n                                                   (CONTINUED)\n\n                                                              106.\n\n240   CONTINUED:                                                     240\n                                 FRED\n                   Offisser Fledapar, het me hexpwain\n                   -- his howse hiss maid uv\n                   fibahwock --\n      He reaches out to tap the nearby wall and -- WHAM -- it\n      collapses all around him, leaving a gaping hole in the\n      house!\n                                 FELDSPAR\n                          (frightened, backing\n                           away)\n                   Quivering quartzite, d-did you\n                   see that --\n\n                                 GRAVEL\n                          (following him)\n                   O-one flick of his paw... and\n                   he knocked down a wall -- !\n                                 FRED\n                   Nogh, wate, chum baggk --\n      As Fred \"roars\" and moves forward, Feldspar and Gravel\n      scream, panic, and run!\n241   FRED                                                           241\n      Tries to catch up and collides with the already damaged\n      house. It collapses totally, falling in on itself,\n      obscuring Fred. Finally the last TIMBER DROPS. Pause.\n      Fred staggers out of the rubble, realizes that the impact\n      has knocked the monster mask off his head and back on its\n      hinges. He rubs dust out of his eyes, turns and looks\n      at the Slate Needle. He's much closer to it now.\n\n      Quickly, he runs toward it.\n                                                    CUT TO:\n\n242   INSIDE THE SLATE NEEDLE                                    242\n      Everyone is rocking back and forth with the escalating\n      vibrations of the swaying building. The remaining table\n      of refreshments slides across the room.\n\n243   POINDEXTER LAVA                                            243\n      gets hit full force by a flying cake shaped like Slate\n      City. He falls on top of his accordion, smashing it with\n      one last dissonant squeeze.\n\n                                                               107.\n\n244   PARTYGOERS                                                      244\n      They pause in their panic to applaud gratefully.\n\n                                                     CUT TO:\n245   EXT. BASE OF FIBRESPHERE AND SLATE NEEDLE - NIGHT            245\n\n      The supporting pylons and cable anchors begin to slowly\n      decompose. A FLIGHT of STAIRS CREAKS AND GROANS.\n      Barney runs INTO the SHOT, sees the steps about to go,\n      dives for them... too late! He ends up with a face full\n      of Fibredust! Now, he whirls as Fred runs up, points --\n                                   FRED\n                   Barney!    The elevator -- !\n\n      Barney runs toward it, hits the button.\n246   OTHER SIDE OF WALL                                           246\n      REVEALING elevator mechanism. The button pokes a mouse\n      which runs out of a box. Seeing the mouse, a nearby\n      mastadon becomes frightened, begins running. A heavy\n      cable tied to the mastadon runs over a pulley and into --\n247   THE ELEVATOR SHAFT                                           247\n      -- where the elevator rises out of the sub-level and\n      INTO VIEW! Fred and Barny start towards it... when\n      suddenly the Fibrerock elevator begins to crumble!\n                                   FRED\n                   Quick!    Use your coo-coo gun -- !\n\n      Barney aims, pulls back the plunger... too late! The\n      elevator is gone. The cable swings back and forth\n      loosely, \"whapping\" the shaft walls as it shoots upwards.\n      Fred dives for the cable, misses! As he stumbles, Barney\n      leaps on Fred's back, catches the cable! As Barney\n      starts to whizz upwards, Fred garbs onto his ankles!\n\n248   ABOVE - FIBRESPHERE                                          248\n      Propelled upwards, the would-be rescuers shoot OUT of\n      the FRAME, disappear into the Fibresphere with a CRASH!\n\n                                                     CUT TO:\n249   INT. BEDROCK POLICE STATION - NIGHT                          249\n\n      The POLICE CHIEF looks skeptically at Feldspar and\n      Gravel, who are exhausted, covered with dust, uniforms\n      torn.\n                                                     (CONTINUED)\n\n                                                                 108.\n\n249   CONTINUED:                                                        249\n                                 CHIEF\n                   Feldspar, if you ask me, you've\n                   seen too many Rockzilla movies: In\n                   all the Xenosaurus sightings we've\n                   had reported, not one has had this\n                   kind of wholesale destruction --\n\n                                 FELDSPAR\n                   Chief, you -- you gotta believe me\n                   -- just one swipe of its paw and\n                   -- wham -- a whole house was\n                   pre-history -- !\n      Suddenly one of those police DISPATCH PARAKEETS comes\n      flying excitedly through the window, lands on a perch in\n      front of the Chief.\n\n                                 DISPATCH PARAKEET\n                   Calling all cars. Calling all cars.\n                   Unconfirmed reports of destruction\n                   and collapse at Slate City.\n                   Rescue vehicles are on the way.\n                   The xenosaurus has been spotted\n                   in the area. That is all. That\n                   is all.\n                                 FELDSPAR\n                          (excited)\n                   You see -- ? I told you --\n                                 CHIEF\n                   All right, Feldspar, I'm\n                   convinced! As of this moment\n                   you're completely in charge of\n                   operation...\n                          (dramatic)\n                   ... 'Xeno Dino'! Now, what do\n                   you need?\n      CAMERA TIGHTENS ON Feldspar.     This is the moment he's\n      waited for all his life.\n\n                                 FELDSPAR\n                          (firm-jawed)\n                   Artillery.\n\n                                                    CUT TO:\n250   INT. FIBRESPHERE - NIGHT                                      250\n\n      Dust and little fragments of construction material are\n      still tinkling down around our heroes. The elevator\n      cable sways from its uppermost pulley. Slowly, something\n      stirs in the pile of arms, legs and scaly limbs.\n\n                                                    (CONTINUED)\n\n                                                                    109.\n\n250   CONTINUED:                                                           250\n      First to sit up is Barney, who groans, rubs his head.\n      Next, Fred sits up. Damn! The impact has knocked Fred's\n      monster mask back on his head! Fred mutters angrily...\n      Barney starts to help... and then they both notice that\n      there's another monstrous head in the middle of their\n      group! There're big \"takes\" all around, and then the\n      xenosaurus leaps out of the tangle of bodies, treads\n      air, and runs away!\n                                 BARNEY\n                          (recovering)\n                   Fred, stop it! It might know\n                   the way inside!\n      Fred \"gets up to speed\" and chases the xeno.         Barney\n      follows.\n\n251   NEW ANGLE                                                            251\n      Fred and Barney both leap on the mysterious xenosaurus --\n      all crash through a wall --\n252   INT. SLATE NEEDLE - NIGHT                                        252\n\n      The panicked partygoers turn as a section of wall\n      collapses. Dust and debris billow upwards. The battered\n      monster mask breaks loose from Fred's costume, bounces\n      on the floor. Slowly, everyone gets up: Fred... Barney\n      ... and two halves of the xenosaurus:\n      The bottom half is Piltdown; the top-half is Pyrite.\n                  WILMA                        BETTY\n        Fred?                             Barney?\n                  PEBBLES                        BAM-BAM\n        Daddy!                            Pop!\n\n              FRED                             BARNEY\n        Piltdown?                         Pyrite?\n\n                                 SLATE\n                   What the devil's going on here?\n                                 FRED\n                   It's real simple, Mister Slate.\n                   Your boy Lava here has been\n                   stealing the coo-coo berries from\n                   the Fibrerock mix and fixing the\n                   books to hide it!\n\n                                 LAVA\n                   That's ridiculous, Flintstone!\n                   Nobody could get that many coo-coo\n                   berries off our premises!\n                                                    (CONTINUED)\n\n                                                               110.\n\n252   CONTINUED:                                                      252\n      Suddenly the bottom of Piltdown's canvas sack rips\n      open. Thousands and thousands of coo-coo berries tumble\n      out.\n253   LAVA                                                            253\n\n      Slaps his hands over his face.\n\n254   THE SCENE                                                       254\n                                 BETTY\n                          (dryly)\n                   These sure look like coo-coo\n                   berries to me --\n\n                                 LAVA\n                          (smoothly)\n                   They're convincing fakes, Mrs.\n                   Rubble -- part of our exciting\n                   display --\n                                PYRITE\n                   Fakes?\n                          (to Piltdown)\n                   Gee, Pilty, I thought the real\n                   ones were gonna be moved up here\n                   for us ta steal -- whatta waste\n                   a time --\n\n                                 PILTDOWN\n                   Pyrite, shaddup --\n                                 FRED\n                          (snapping fingers)\n                   Now I remember! These guys were\n                   pulling this xenosaurus act that\n                   night at the plant! What's this,\n                   Lava... 'Plan B'?\n                                 LAVA\n                   Uncle! Are you going to stand\n                   there while aspersions are being\n                   cast at the Slate family? This\n                   is absurd --\n\n                                 SLATE\n                   Of course it is! Why, without\n                   the coo-coo berry sap, Fibrerock\n                   would be completely --\n                          (realizing)\n                   -- unstable...\n\n      Suddenly the entire building shudders.      Dust falls from\n      the ceiling. Everyone looks at Lava.\n\n                                                      (CONTINUED)\n\n                                                              111.\n\n254   CONTINUED:                                                     254\n                                 LAVA\n                   All right, all right, I admit it!\n                   I got in over my head in the stock\n                   market... took some big losses...\n                   I had these guys pull jobs for me\n                   all over town disguised as a\n                   monster... but it still wasn't\n                   enough... and when I saw all those\n                   coo-coo berries being delivered\n                   every day, I guess I just lost my\n                   head... I figured with the Woca\n                   sap in the Fibremix, the berry\n                   juice as superfluous...\n                                 SLATE\n                   I'll tell you what's superfluous,\n                   Lava... your liver! So why don't\n                   we remove it -- !\n      He leaps, snarling, on top of Lava... Fred and Barney\n      pull them apart. Then, more falling dust and beams give\n      everyone more pressing problems --\n                                                    CUT TO:\n255   EXT. SLATE NEEDLE - NIGHT                                  255\n      Rescue VEHICLES and police CARS ROAR up, slam to a halt,\n      CAT SIRENS WAILING. The rescue workers jump out.\n      Firefighters carry circular trampolines of hide stitched\n      to bamboo frames; others go to the back of their trucks\n      and start to turn cranks on the hook and ladder trucks to\n      raise the ladders.\n256   CLOSE ON A HOOK AND LADDER TRUCK                           256\n\n      It's actually a wheeled carriage carrying a firesaurus,\n      which is a critter with a very tiny body and an incred-\n      ibly long neck. The bony plates on the creature's back\n      make perfect stairs.\n\n      However, the creature is noticeably listless and\n      uncooperative.\n\n                                 FIRE CHIEF\n                   Come on, come on, what's the hold\n                   up -- ?\n                                 FIREFIGHTER\n                   It's the kibble crisis, sir --\n                   the firesauruses have been on\n                   half-rations for a month!\n      Above them, the BUILDING SHUDDERS again.\n\n                                                             112.\n\n257   IN THE SLATE NEEDLE                                        257\n      Now, the remaining LIGHT FIXTURES CRASH down. When they\n      hit the floor, the oil lamps inside spills and fire\n      spreads.\n                               WILMA\n                        (pointing)\n                Fred!   There's a fire hose -- !\n\n      Indeed, it's on the back wall in a closed box marked FIRE\n      HOSE--IN CASE OF EMERGENCY BREAK GLASS. Fred and Barney\n      take a step towards it, but the fire quickly spreads and\n      cuts them off.\n      Helpless, they step back.\n\n      With a THUNDEROUS ROAR, the two SLATE SCRAPERS visible\n      through what's left of the picture window COLLAPSE. Then\n      the big statue of Slate just outside the window begins to\n      decompose. It falls in on itself like a sand sculpture\n      in a storm... finally, for a split second it is, well,\n      life-sized, and then the head of the statue snaps loose,\n      CRASHES through the only remaining pane of GLASS here\n      ... rolls up to Slate's feet.\n\n      Pause. Everyone looks at everyone else. This is it:\n      Titanic time. Fred embraces Wilma... Barney embraces\n      Betty. Their kids are pulled into the clinch. Even\n      Slate takes Mrs. Slate's hand. Talk about grace under\n      pressure... and speaking of --\n258   GRACE                                                         258\n      -- the star fashion model, suddenly her Fibrethread\n      costume decomposes, leaving her in her cute little\n      animal print undies.\n259   BETTY                                                         259\n\n      In the middle of going down with the ship, she turns\n      Bam-Bam's face away from this display.\n\n                              BAM-BAM\n                D-dad, are we gonna be okay?\n                              BARNEY\n                       (pause; false smile)\n                Sure, pal. We just gotta wait for\n                the fire department. Right, Fred?\n                              FRED\n                Y-yeah. Everything's gonna be\n                just -- Whoa, hoo-hah, aggh --\n                                                   (CONTINUED)\n\n                                                              113.\n\n259   CONTINUED:                                                     259\n      He's started yelping because he's realized his arm    is\n      on fire, and now he jumps up and the others begin    beating\n      at the arm with anything in their hands, and then    Fred\n      suddenly pushes away from them, stands there with    a small\n      flame flickering on his forearm like a Rock Vegas    stage\n      magician.\n\n                                 FRED\n                   -- Wait a minute -- I don't feel\n                   anything at all --\n\n      With his other \"claw\" he slaps tentatively at the flames,\n      and then confidentially snuffs it out.\n                                 BARNEY\n                   It must be the suit, Fred -- old\n                   Bedrock High built them things to\n                   last --\n      Fred looks over at the wall of flame separating the\n      guests from the fire hose. As everyone gets the same\n      idea, Dino rushes up, the costume head in his mouth.\n      All brighten.\n\n      Barney helps Fred with the head, twists it into place.\n                                  BARNEY\n                          (rapping on the head)\n                   -- Okay?\n                                 FRED\n                   Hist hust fine!\n      He lowers his head, runs through the fire, which licks\n      at him harmlessly. Then with his claw, he SMASHES the\n      amber GLASS --\n\n260   IN THE BOX                                                     260\n      A big PYTHONSAURUS is curled up inside,     SNORING. (Note\n      to herpetologists: The pythonosaurus is      not quite a\n      snake: it has little vestigial forepaws      the better to\n      emote with. Right now the snoring head      is in those\n      little paws.)\n\n      The Pythonsaurus stirs, looks at Fred, \"sniffs\" the\n      smoke. Then he raises one hand and finger as if to say\n      \"one moment.\" Then the pythonsaurus turns his head\n      towards a nozzle like the ones in hamster cages, slurps\n      loudly.\n\n      We hear gallons and gallons of WATER GURGLING away...\n\n                                                               114.\n\n261   IN THE MAIN ROOM                                            261\n      Everyone retreats from the fire. Slate picks up the head\n      of the statue, his only souvenir.\n\n262   WITH FRED                                                       262\n      Waiting impatiently until the pythonsaurus finally\n      finishes drinking. It wipes its mouth daintily with a\n      napkin, slaps a little fire helmet on its head, turns\n      and runs back into the other room. (Behind him, yards\n      and yards of pythonsaurus unroll from a hidden compart-\n      ment behind the box.) Water shoots out of the creature's\n      mouth.\n263   WIDER                                                           263\n\n      Fred turns in a semi-circle and puts out every lick of\n      flame in the room. All the guests cheer, rush forward\n      and slap Fred on the back. Pebbles jumps up on him and\n      kisses him.\n                                FRED\n                  Hit fuzz nudding... wheely...\n      The pythonsaurus looks around at the attention.\n                                PYTHONSAURUS\n                  Hey, what am I, chopped liver?\n                                BARNEY\n                  Come on, everybody -- we'll go\n                  out the way we came!\n      Barney squirts a pathway with his flit gun, solidifying\n      a route in the crumbling Fibrerock. Then Barney and\n      Fred stand back nobly, wave everyone on into the adjacent\n      Fibresphere.\n\n                                POINDEXTER\n                         (pushing and shoving)\n                  Outta the way -- outta the way --\n                  women and children first -- ! I\n                  mean, ah, children and women\n                  first, yeah, yeah, provided that\n                  uh, there's room for the women...\n\n      Meanwhile, the pythonsaurus gives Fred (or rather his\n      costume) a big look up and down, looks TOWARD the CAMERA.\n                                  PYTHONSAURUS\n                  Hey, not bad.    Wonder if she lives\n                  around here.\n\n      Just then Fred tilts back the monster head.        The\n      pythonsaurus reacts.\n\n                                                    (CONTINUED)\n\n                                                            115.\n\n263   CONTINUED:                                                   263\n                                   PYTHONSAURUS\n                   Heartbreaker!\n\n      Depressed, the pythonsaurus follows the others. Fred and\n      Barney cross over into the Fibresphere. As the do, Slate\n      Needle completely collapses.\n\n264   EXT. FIBRESPHERE - LONG SHOT                               264\n      The Slate Needle tumbles down, taking a big chunk of the\n      Fibresphere with it! But the rest of the huge globe\n      stays put... for now.\n265   RESCUE WORKERS BELOW                                       265\n\n      gasp, cry out --\n\n266   UP ABOVE                                                     266\n      Already the first partygoers are sliding down the\n      elevator cable.\n                                 HEADMISTRESS\n                          (panicking)\n                   Oh, geez, we're all gonna croak --\n                   I neva shoulda left Far Rockaway --\n      Wilma gives her a big suspicious look -- blanching,\n      the Headmistress slides down the cable --\n267   BELOW                                                        267\n      The rescue teams catch the people in nets as they hit\n      the ground.\n268   ABOVE                                                        268\n\n      Barney gives the dwindling circle of solid Fibre around\n      the group another shot of coo-coo juice. Poindexter Lava\n      pushes his way forward.\n\n                                 POINDEXTER\n                          (to anyone and everyone)\n                   Fifty clams for a piggy-back ride\n                   ... a hundred clams!\n\n                                 MRS. SLATE\n                          (aghast)\n                   Do you see that, Jerry? Do you\n                   see how my great-nephew is behaving\n                   at this moment of crisis?\n\n                                                   (CONTINUED)\n\n                                                              116.\n\n268   CONTINUED:                                                     268\n                                 LAVA\n                          (proudly)\n                   Yeah. Real chip off the old\n                   block, ain't he?\n      Embarrassed, Mrs. Slate grabs the kid by the neck,\n      practically throws him at the cable. She follows him\n      down, followed by Lava and Mr. Slate.\n269   REAR OF FLEEING PEOPLE                                       269\n\n      Fred and Barney have bravely held up the rear, their\n      families clutching to them. Barney's carrying Bam-Bam.\n                                 FRED\n                          (to Pebbles)\n                   Upsy-daisy, sweetheart -- piggy\n                   back time!\n      She jumps on his back... slamming the monster head\n      back in place.\n                                 FRED\n                          (resigned)\n                   Hohh... GWEAT!\n                                 BARNEY\n                          (to Betty)\n                   Go on, honey... I got Bam-Bam!\n                                 BETTY\n                   Barney... tonight you're the\n                   biggest man in Bedrock.\n\n      She kisses him, slides down.\n270   CLOSE ON WILMA AND FRED                                      270\n\n      Backlit romantically by the flames, just like Gable and\n      Leigh when Atlanta burned.\n\n                                 FRED\n                          (through the mask)\n                   Wilmagh, I jusght whunt to sagh\n                   thad I knogh shumtimes I dogh\n                   dumb thinks... Bhut hit's\n                   becaughse high luff yough sogh\n                   much thaght high whant yough to\n                   livgh likge a pwincess orgh a\n                   qween 'cause you reaally arggh\n                   rugg aaggg hummmmg higga!\n\n                                                     (CONTINUED)\n\n                                                          117.\n\n270   CONTINUED:                                                 270\n                                 WILMA\n                   Oh, Fred -- that's the most\n                   beautiful thing I've ever heard!\n      They kiss... she drops to safety...!\n\n271   BELOW                                                      271\n\n      Wilma slides into a rescue net, gets on unsteady feet\n      next to Betty.\n\n272   BACK UPSTAIRS                                             272\n                                 FRED\n                   Lhet's dogh it!\n\n      Their kids on their backs, Fred and Barney exchange a\n      heroic forearm-to-forearm gladiator-type handshake...\n      both put their hands on the cable... and then the whole\n      pulley mechanism falls right down between them and\n      through the hole! A second later, the entire remaining\n      structure collapses!\n273   BELOW                                                      273\n      Everyone reacts in horror --\n274   ABOVE                                                      274\n\n      Dust and smoke clear. When we can see again, well, it's\n      not a pretty sight. The entire fibresphere is gone. All\n      that's left, teetering on two spindly supports, are two\n      tiny islands of safety connected by a twisted maze of\n      rubble too small for a human to negotiate... and all\n      that's holding that up is a long guide wire leading to the\n      ground!\n\n275   CLOSER                                                     275\n      Figures on one of the islands stir: Fred. Barney.\n      Bam-Bam... Pebbles! The platform shudders again. Barney\n      aims the flit gun -- empty! The dads hold on to the\n      kids. It's all they can do.\n276   BELOW                                                      276\n\n      Wilma and Betty gasp... what can be done?\n277   THE SECOND ISLAND                                         277\n\n      Bricks and chunks of Fibre stir... a form sits up...\n      it's -- Dino! He looks around at the situation, becomes\n      agitated... he wants to help... but how?\n\n                                                            118.\n\n278   WILMA AND BETTY                                            278\n      Suddenly become inspired.\n\n                                BETTY\n                  W-wilma... those hoops of bamboo...\n                  those wires... do you think -- ?\n\n                               WILMA\n                  Yes! Yes! Betty, we have to try\n                  it -- ! Dino! Dino, look down\n                  here -- !\n\n279   DINO                                                         279\n      Obeys, puzzled --\n\n280   HIS POV - WILMA AND BETTY                                  280\n\n      Amazingly, they grab scraps of wood, borrow fire\n      fighter's helmets, and begin to do a buck and wing.\n                         WILMA   AND   BETTY\n                  You can keep   the   twist,\n                  the frug and   hop\n                  I don't need   to shimmy,\n                  I don't need   to bop --\n281   BIG CAMERA PUSH - DINO                                     281\n      MUSIC COMES UP DRAMATICALLY as he catches on! His eyes\n      fill with courage and he charges toward the spindly\n      bridge that leads to his master and friends.\n282   ANOTHER ANGLE                                              282\n\n      Dino dives through the hoops of bamboo, duplicating his\n      steps in \"The Dino Dance.\" He reaches the other island!\n      Without a beat, still keeping time, he puts the two kids\n      on his shoulders, just like in the dance! Then he\n      \"presents\" his tail to Fred -- Fred hands his tail to\n      Barney -- and then --\n\n283   LONG SHOT                                                    283\n      -- Dino slides down the long wire, carrying everyone to\n      safety! They all plow into the biggest rescue net as\n      Wilma and Betty wind up!\n\n                                WILMA AND BETTY\n                  Yes, I don't need to shimmy,\n                  I don't need to bop\n                  'Cause I'm doin', doin', doin'\n                  THE IGNEOUS ROCK!\n\n                                                            119.\n\n284   FRED                                                         284\n      rolls out of the net and away from the others. He's\n      slightly stunned, still in the suit. He sits up...\n      suddenly lights snap on all around him! Fred looks up\n      and sees --\n285   HIS POV - CORDON OF POLICE OFFICERS                       285\n\n      All with weapons aimed right at him. Spotlights on the\n      police car roofs (actually little fires with parabolic\n      mirrors) are operated by uniformed monkeys.\n\n      Feldspar is at the head of the group. He cocks his\n      shotgun. The elastic catapults at the hammers twitch\n      menacingly --\n\n                                FELDSPAR\n                  It's the xenosaurus -- stand back,\n                  men -- it's a vicious killer --\n                  Ready -- Aim --\n                                FRED\n                         (with desperate poignancy)\n                  High ham noght a zenosore! High\n                  ham hay hooman beeng -- !\n      BAM! WHAM! KABAM! Bullets and projectiles begin\n      slamming all around Fred! He ducks behind a big fallen\n      chunk of Fibrerock -- catches his breath as the bullets\n      and shells bounce off its resilient surface.\n286   CLOSE - FRED                                                 286\n      Momentarily safe, he tries desperately to remove that\n      stupid head -- bangs it against the wall, tears at it\n      with his claws --\n      -- meanwhile, the chunk of Fibrerock protecting him\n      decomposes! He's back in the line of fire!\n287   DINO                                                         287\n\n      Flanked by Wilma, Barney and the kids, who are shouting\n      for the police to stop, only Dino the wonder bronto has\n      the wits to act!\n\n      \"YI-YI-YI-ING,\" he races forward, CAMERA FOLLOWING --\n      and with lightning reflexes grabs the seat of Fred's\n      monster suit and -- de-pants him!\n      Instantly, Dino whirls Fred around, points to the now\n      revealed striped undershorts.\n\n288   WIDER                                                        288\n      Pause.\n                                                  (CONTINUED)\n\n                                                              120.\n\n288   CONTINUED:                                                     288\n      Then Officer Gravel takes a good look at that rear end.\n\n                                 GRAVEL\n                   Hey, those are the biggest shorts\n                   I've ever seen...\n                          (realizing)\n                   ... It... it must be Mister\n                   Flintstone! Cease fire!\n                          (to Feldspar)\n                   Gee, Sarge, now you don't have\n                   to shoot him -- !\n\n      Now Fred confirms Gravel's hunch as the costume head\n      finally pops off. All the cops lower their guns.\n      (Strangely, though, Feldspar still continues to raise\n      his gun -- even aims! Then an alarmed Gravel wrestles\n      it away from his superior.)\n289   THE FLINTSTONES AND RUBBLES - DAWN                           289\n      Safe, they all emotionally embrace. Fred even suffers\n      Dino's affection. (In the b.g., a police car holding\n      Piltdown, Pyrite and Lava drives past. Poindexter Lava\n      is chasing the car.)\n                                 POINDEXTER\n                          (distant)\n                   Dad! Dad! Can I use the\n                   Porscherock while you're in the\n                   slammer?\n      Suddenly the Slates push their way into the group hug.\n                                 SLATE\n                   Flintstone. Rubble. I... I\n                   don't know what to say. I... I\n                   treated you horribly... I ignored\n                   you, abused you... and then you\n                   come here and risk your necks like\n                   this... well, there's no price you\n                   can put on something like that,\n                   so I won't even try. But let me\n                   give you...\n                          (with great\n                           poignancy)\n                   ... a hearty handshake.\n\n                                 MRS. SLATE\n                   Dear, don't you think a little\n                   more than that is in order?\n\n                                 SLATE\n                   Honey, you're being hysterical,\n                   go lie down, okay?\n\n                                                     (CONTINUED)\n\n                                                               121.\n\n289   CONTINUED:                                                      289\n                                 MRS. SLATE\n                   I am not being hysterical, I am\n                   being fair -- now the Flintsteins\n                   and Rabbles saved all of our\n                   lives, not to mention your\n                   reputation.\n\n                                 SLATE\n                          (sighing)\n                   Okay, okay.\n                          (to Fred and Barney)\n                   Boys, I'm feeling guilty about\n                   how you've been taken advantage\n                   of, so I'll tell you what... I'm\n                   going to give you back all\n                   world-wide rights to Fibrerock,\n                   free and clear.\n      He picks up a fragment of stone, begins writing on it.\n                                 SLATE\n                   Your only obligation will be to\n                   cover oh, whatever legal expenses\n                   might surface at some later time...\n                                 BARNEY\n                   You think there's gonna be some?\n      Slate looks around at --\n290   HIS POV - THE RUINS AND DESTRUCTION                           290\n      Smoking desolation as far as the eye and CAMERA can see.\n      As we watch the last remaining fragment of Slate City\n      collapse, crushing a police car.\n291   BACK TO SCENE                                                 291\n\n                                 SLATE\n                          (casually)\n                   Oh, you never know...\n\n292   RESCUE DINOS                                                    292\n      Several sniff at the air, look curiously at a nearby\n      pile of crumbled Fibrerock. One and then another\n      shuffles over, tentatively tastes some... grins... and\n      digs in! Seeing this, the \"firesauruses\" crane out\n      their necks, also begin chowing down on the pile of\n      Fibrerock crumbs.\n\n293   FRED, BARNEY, SLATE AND OTHERS                                293\n      All turn at the growing sound of the ANIMALS PIGGING OUT.\n\n                                                      (CONTINUED)\n\n                                                                 122.\n\n293   CONTINUED:                                                        293\n      Now DINO \"YI-YI-YI'S\" past this group and leaps into the\n      pile, munching like crazy.\n\n      Barney puts out his hand as chunks of Fibrerock shower\n      down like rain from the feeding frenzy. Catching some\n      pieces, he nibbles on it a little.\n\n                                   FRED\n                   Barn...?    What's going on?\n                                 BARNEY\n                          (sniffing it)\n                   Lava Lava leaves... Woca sap...\n                   all still there, but now the\n                   nutrients are all released...\n                          (realizing)\n                   ... Fred, this... this is Dino\n                   kibble!\n                                 FRED\n                   Dino kibble...?\n      Disbelieving, Fred moves over to the happily-munching\n      animals. He has to get on his knees to wiggle in with\n      the pack. He grabs some, stuffs it in his mouth...\n      chews. His eyes widen...\n                                 FRED\n                          (mouth full)\n                   Dhinough khibble!!\n      He spits it out, takes out the chunk of contract\n      Slate wrote on.\n\n                                 FRED\n                   Barney, we -- we're rich!\n                   Yabba dabba do -- !\n\n294   SLATE                                                             294\n      Faints dead away!       The CAMERA PULLS BACK... BACK...\n      BACK --\n295   EXT. DRIVE-IN MOVIE THEATRE - NIGHT                           295\n\n      We're back where we began. As \"The End\" appears on the\n      drive-in screen, cars are streaming out of the drive-in\n      theatre. The Flintstone car is among them.\n296   EXT. DRIVE-IN RESTAURANT - NIGHT                              296\n\n      Fred and company roll into a '50's-style drive-in\n      restaurant. A sign advertises BRONTO BURGERS AND RIBS.\n                                                     (CONTINUED)\n\n                                                             123.\n\n296   CONTINUED:                                                    296\n      A pretty carhop on stone roller skates glides over.\n      Fred holds up one finger towards her. She nods, scampers\n      O.S. Fred rubs his hands and licks his lips with antici-\n      pation... and then the girl returns with a massive rack\n      of ribs on a car tray. She hooks it on the edge of\n      the driver's door... and the entire car tips over with a\n      crash.\n\n                                                CUT TO:\n297   EXT. FLINTSTONE HOUSE - NIGHT                              297\n\n      WIDEN FROM the mailbox. Fred and family pull up. Dino\n      runs in first, followed by Wilma with Pebbles already\n      asleep on her shoulder. Fred follows, the saber-tooth\n      cat on his heels. Fred stops in the doorway to put a\n      milk bottle on the doorstep, and then puts the cat down\n      beside it. He shuts the door.\n      Quick as a flash, the cat leaps through the side window.\n      Pause. The door opens and the cat puts Fred out, then\n      slams the door! Fred recovers from his shock, tries the\n      door... it's locked!\n\n                                 MUSIC (V.O.)\n                   We'll have a yabba\n                   dabba-do time\n                   A dabba-do time\n                   We'll have a gay old time!\n                                 FRED\n                          (knocking)\n                   Wilma...?\n                          (another knock)\n                   ... Wilma?\n      CAMERA CRANES UP, WIDENS as Fred becomes a tiny sil-\n      houette banging on the door.\n                                  FRED\n                   Wilma?   Wil-ma --!\n\n                                                FADE OUT.\n\n\n\n\n                                   THE END\n\n THIS SCRIPT WAS PREPARED\n   BY WARNER BROS. INC.\nSCRIPT PROCESSING DEPARTMENT\n      (818) 954-4632\n\n\n\n\n\nFlintstones, The\nWriters :   Steven E. De Souza\nGenres :   Comedy  Family  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:16.877189"}