{"title": "Four Feathers", "film_link": "/Movie Scripts/Four Feathers Script.html", "script_link": "/scripts/Four-Feathers.html", "info_raw": "\n\nFour Feathers Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Michael Chiffer  Hossein Amini\nGenres  Adventure  Drama  War\n\nRead \"Four Feathers\" Script\n\n\n", "script": "\n\n        \"Four Feathers\" -- by Michael Schiffer, revised by Hossein Amini - 3rd Draft\n\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b> \n\n\n\n\n\n\n\n\n\n\nFour Feathers\nScreenplay by Michael Schiffer\nrevised by Hossein Amini\nbased on the book by A.E. Mason\n\nEXT. TRAINING GROUND/ WESTMINSTER barracks/ LONDON - Day.\nThrough a veil of dust we see two lines of uniformed cavalry, stretched out across the parade ground. There's a tense silence except for the occasional flourish of hooves. A horseman steps out of each line. \nLIEUTENANTS HARRY FEVERSHAM and JOHN DURRANCE face each other across the wide expanse. Already we feel the keen sense of competition between them. DURRANCE raises his sabre first. His horse sets off at a slow trot. His troops follow in perfect time. HARRY waits a moment, then raises his own sword. A sea of sabres rises up in response. \nThe two lines approach each other at a steady canter. A smile of anticipation lights up DURRANCE's face. He's a born soldier, enjoying himself. HARRY looks more nervous. He's not as easy as Durrance in the saddle. It's a skill he's acquired over the years rather than been born to.\nDURRANCE seems to sense Harry's doubt. With a loud whoop he kicks his horse into a gallop and points his sabre forwards. His troops echo his war cry and descend on the opposing line at speed. HARRY checks his troops and responds. The two lines bear down on each other, hooves thundering, sabres pointed. \nDURRANCE charges recklessly. His eyes are fixed on Harry all the time. HARRY holds his gaze, but doesn't look as sure of himself. He's thinking too much, trying too hard. His horse senses it and slows a fraction. The troops behind him lose their cohesion as they draw level. \nDURRANCE sees the momentary lapse and waves his men on at full tilt. They pass through HARRY's troops in a perfect line, panicking their mounts, cheering triumphantly. HARRY's formation loses its shape. There's no doubt who's won the drill. DURRANCE wheels his horse around and grins at HARRY through the clouds of dust.\nCREDITS ROLL. \nINT. Changing room/ WESTMINSTER BARRACKS - day.\nMoving through clouds of steam we see the CAVALRY OFFICERS washing themselves in wooden bathtubs. There's a din of voices, soldiers re-living the day's drill, those on Durrance's side still crowing over their victory.\nDURRANCE walks with his arm around HARRY. With them is another friend, LIEUTENANT TRENCH, a squat bull of a man.\nDURRANCE\n...How many does that make it Harry?\nharry\nIt's not something I count.\nDURRANCE\nHow many Trench?\nharry\nTrench can't count.\nTRENCH grabs HARRY in a neck hold. He lets go as he spots another friend of theirs, LIEUTENANT CASTELTON, sitting in a bathtub, staring out. TRENCH sneaks up on CASTELTON, and ducks his head under the water. CASTELTON comes up, spluttering. He reaches for a bar of soap and hurls it after TRENCH.\nCASTELTON\n...Idiot.\nINT. WILLOUGHBY's rooms/ barracks - day.\nA fifth friend, LIEUTENANT WILLOUGHBY, stares at himself in the mirror. His hair like his uniform is perfect. There's a loud knocking on his door.\ntrench o/s\n...Miss Willoughby, Miss Willoughby we're waiting.\nWILLOUGHBY finally stops preening himself as he hears his friends picking the lock. He gets up reluctantly, taking one last look at his reflection in the mirror.\nEXT. BARRACK GATES/ LONDON STREET - DAY.                                                 \nThe OFFICERS pour out of the barrack gates in full regimental unifom, a sea of gleaming red. We pick out HARRY, DURRANCE, TRENCH, WILLOUGHBY, and CASTELTON, laughing amongst themselves, taking turns to tease each other, inseperable. \nINT. carriage/ HAnsom cab/ london streets - day.\nThe friends share a flask of whisky as they sit in the back of the carriage. WILLOUGHBY passes it on without taking a sip.\nharry\nWho are you planning to impress tonight?\ntrench\n(Grinning)\nAnna What's-her-name.\nDURRANCE\nAnna What's-her-name's father more like. Don't think we're going to take you any more seriously when you're promoted.\nwILLOUGHBY\n(Quietly confident)\nWe'll see about that.\nA chorus of mocking 'ooohs' from the others. TRENCH notices CASTLETON staring out of the window. \ntrench\nWhat's so interesting about a London street?\nCASTELTON\n(Reflecting)\nAsk me that when we're in Bombay.\nTRENCH rolls his eyes and turns to DURRANCE.\ntreNCH\nIs Ethne going to be there?\nWe catch a hint of shyness in DURRANCE at the mention of Ethne's name.\nDURRANCE\nI think so. \nHARRY watches DURRANCE, a little uncomfortably, as if he's holding something back.\nEXT. PARTY/ india office building/ london - night.\nCARRIAGES line the entrance to the India Office. INDIAN VALETS in turbans and robes escort the GUESTS to the entrance, holding umbrellas over them. \nThe five friends crowd under a single umbrella. WILLOUGHBY makes sure he's in the middle, he doesn't want to get his uniform wet. TRENCH nudges him into the rain.\nINT. The Durbar court/ party/ INDIA office - night.\nPalm trees and fountains dominate the room. The ladies are dressed in ballgowns, the Officers in regimental colours. The full pomp and ceremony of Empire is on display. HARRY, DURRANCE, WILLOUGHBY, CASTELTON and TRENCH have  gathered by the bar, a little overawed by the occasion.\ntrench\n(Admiring the passing women)\nI'm going to ask someone to dance.\nwilloughby\n(Admiring the passing Generals)\nYou said that ten minutes ago.\ntrench\nI'm waiting for Castelton.\nCASTELTON stares at the ARISTOCRATIC WOMEN, paralysed with shyness.\ntrench \n(Pouring him another drink)\n...Just look dreamy. I'll do the talking.\nDURRANCE smiles as he listens to them. He turns to HARRY.\nDURRANCE\nCan you see Ethne?\nharry\nNot yet.\nHARRY seems uneasy again. We sense there's something on his mind, something he wants to tell Durrance. DURRANCE doesn't pick up on it. He finishes his whisky and looks back into the throng.\nWILLOUGHBY\nHarry, your father...\nHARRY looks away from DURRANCE. He sees his father, GENERAL FEVERSHAM, shaking hands with some COLLEAGUES across the room.\nINT. seating area/ durbar court/ india office - night.\nGENERAL FEVERSHAM is deep in conversation with his friend, COLONEL SUTCH, a fellow veteran of the Crimean war. HARRY moves discreetly into their field of vision.\nGENERAL FEVERSHAM\n(His face lighting up)\nHarry...\nImmediately we feel the bond between father and son. \nharry\n(Greeting Colonel Sutch)\nHow are you Colonel?\nCOLONEL SUTCH\nFine Harry. Relieved to see a few familiar faces. When are you boys shipping out?\nharry\nNext month.\nCOLONEL SUTCH\nYour father and I served in Bombay.  There are worse places they could have sent you.\nharry\nYes Sir.\nHARRY smiles politely. SUTCH is sensitive enough to see that his mind is on other things. He lets father and son talk. \nGENERAL FEVERSHAM\nIs Ethne here?\nHARRY\nNot yet.\nThey both smile, as if they share a secret. GENERAL FEVERSHAM reaches out and straightens his son's collar, trying to make him look as presentable as possible.\nINT. dance area/ the durbar court/ india office - night.\nTRENCH and CASTELTON are dancing with two GIRLS: TRENCH waltzing boisterously, CASTELTON taking it all very seriously. \nINT. another area/ durbar court/ india office - night.\nWILLOUGHBY has found a place amongst a group of SENIOR OFFICERS. He stands next to COLONEL HAMILTON, the Commander of their regiment.  \nCOLONEL HAMILTON\n...If I had a choice we'd be on our way to the Sudan. Deal with this Dervish uprising once and for all.\n2nd colonel\nYou prefer a tour in the Sudan to India Willoughby?\nwILLOUGHBY\nI don't know about that Sir, but I agree with Colonel Hamilton, we're going to have to fight the Mahdi sooner or later.  \nWILLOUGHBY trails off, leaving COLONEL HAMILTON to continue.\nINT. bar area/ the durbar court/ india office - night.\nDURRANCE downs another whisky. He looks less sure of himself in this social whirl than he did in the barracks. A few WOMEN cast admiring glances in his direction but he doesn't notice them. His eyes keep searching the crowd for Ethne.\nINT. seating area/ durbar court/ india office - night.\nHARRY gazes through the crowd at DURRANCE. DURRANCE catches him staring and raises a glass. The two friends smile at each other.\nINT. STAIRWAY/ india office - night.\nA group of late arrivals hurry up the stairs towards the party. ETHNE EUSTACE, is several steps ahead of her father DERMOD, and her friend, CAROLINE ADAIR, a young widow in her 30's. \nINT. ENTRANCE/ durbar court/ india office - night.\nETHNE's eyes search the crowd as soon as she walks through. She stops as she sees DURRANCE at the bar. Her eyes stay on him a moment, but it's only to see if Harry's nearby. When she realises he isn't she looks away. Finally she sees him, standing with GENERAL FEVERSHAM and COLONEL SUTCH. She takes her father DERMOD's hand, and leads him in their direction.\nINT. bar area/ the durbar court/ india office - night.\nCASTELTON and TRENCH are back at the bar, arguing.\nCASTELTON\nYour sole purpose in life is to annoy me.\ntrench\nShe couldn't see me.\nCASTELTON\nI could see you. I can see you everywhere I look. Pulling those stupid faces at me.\nwilloughby\nNow Ladies.\nDURRANCE joins in the laughter but he seems distracted. He takes another gulp of whisky and looks around the crowd. His eyes stop as he sees ETHNE. A smile lights up his face, but it's short lived.\nAcross the courtyard HARRY appears, greeting ETHNE. Their hands touch briefly.\nThe noise fades in DURRANCE's head. He stares in silence. \nHARRY shakes DERMOD's hand warmly. DERMOD slaps him on the back, as if he's congratulating him. \nDURRANCE's eyes take in the smallest details now. Even though he can't hear a word, the scene before him reveals itself more and more clearly.\nCOLONEL SUTCH raises his glass. GENERAL FEVERSHAM, DERMOD, and CAROLINE ADAIR respond. HARRY and ETHNE move closer, a little coyly, as if the toast is for them.\nDURRANCE looks pale. We feel the disappointment in his eyes as he realises what's happened. HARRY's arm moves around Ethne's waist, a libery that can only mean they're engaged. \nINT. fountain area/ durbar court/ india office - night.\nHARRY and ETHNE glance at each other tenderly.\nETHNE\nDid you tell them?\nharry\nI was waiting for you.\nETHNE\nNot even Jack?\nharry\nNot even Jack.\nThe two of them look towards DURRANCE for the first time.\nINT. bar area/ the durbar court/ india office - night.\nDURRANCE looks up as ETHNE and HARRY make their way through the crowd. He gathers himself, and walks towards them, concealing his feelings:\nDURRANCE\nCongratulations. \nharry\nHow did you know?\nDURRANCE\nNothing escapes me Harry...\n(Kissing ETHNE on both cheeks)\nI'm delighted for you both.\nETHNE\nHarry wanted to tell you before anyone else. It's my fault. I asked him to wait.\nDURRANCE\nI'll still blame him.\nhARRY\n(Relieved that his friend's taking it so well)\nYou were the one who introduced us.\nDURRANCE\nDid I? I'll be more careful next time.\nDURRANCE takes HARRY in his arms, slapping him on the back. WILLOUGHBY, TRENCH, and CASTLETON appear behind them, realising something's up. DURRANCE turns to them, beaming:\nDURRANCE\nThree guesses for Trench, one for everyone else.\nThe friends let out a cheer as they realise what's happened. They crowd HARRY and ETHNE, congratulating them. \nINT. DANCE area/ the durbar court/ india office - night.\nTRENCH sweeps HARRY and ETHNE towards the dancefloor.\ntrench\n(As if they have to dance in public as a punishment)\n...Over there. Where we can see you. And remember you're not married yet.\nHARRY takes ETHNE in his arms. \nharry\n(Smiling ironically)\nAlone at last.\nTRENCH claps loudly as they dance. CASTLETON looks embarrassed by his friend. Behind them WILLOUGHBY congratulates DERMOD and GENERAL FEVERSHAM.\nINT. bar area/ the durbar court/ india office - night.\nDURRANCE watches the celebrations from the bar. He's smiling to himself, but it's the glazed smile of someone who's forcing himself to be happy. A quiet voice interrupts him:\nCAROLINE o/s\nWonderful news isn't it?\nDURRANCE turns around to see CAROLINE, Ethne's friend, gazing at him.\nDURRANCE\n(Smiling automatically)\nYes it is. \nCAROLINE\nHad Harry told you?\nDURRANCE\nI knew it was just a matter of time.\n(Changing the conversation)\nWhat can I get you to drink?\nCAROLINE\nNothing thank you. \nDURRANCE\n(Nervous under her gaze)\nI'd ask you to dance, only I'm not sure how steady I am on my feet. \nCAROLINE\n(With the quiet confidence of an older woman)\nI'd love to dance.\nDURRANCE grins sheepishly, at a loss, as he is with most women.\nINT. DANCE area/ the durbar court/ india office - night.\nThe waltz is in full swing. All the friends are out on the dance floor. TRENCH spins his GIRL around energetically, exchanging glances with other women as they pass. CASTELTON stares into his partner's eyes, already in love. WILLOUGHBY dances with an elderly WOMAN, probably some General's wife. DURRANCE waltzes with CAROLINE, avoiding her meaningful glances, looking over her shoulder for Harry and Ethne.\nEXT. PARTY/ india office building/ london - night.\nThe rain pours in torrents. HARRY and ETHNE stand in the shadows of the building. Harry tries to kiss her and hold an umbrella over her at the same time. \nETHNE\nWhat if I hold the umbrella?\nharry\nI'd have to kneel.\nETHNE\nNothing wrong with that.\nHARRY hands her the umbrella, bending under it. \nETHNE\n(With irony as he kisses her more and more passionately)\nYou're very distant tonight.\nharrY\nI'm locked in a barracks room all day. \nETHNE\nWhat are you going to do in India?\nharrY\nTake you with me.\nETHNE\nA Hindu wedding?\nharry\nWhy not.\nETHNE\nNot on your life.\nShe walks away with the umbrella, leaving him exposed in the rain. \nETHNE\nI want the full works. The Church near my home. A long speech from you. An entire regiment crossing swords. \nharry\n(Drenched)\nDone.\nETHNE\nI don't believe you.\nHARRY makes a rush and grabs her, eneveloping her in his arms.\nETHNE\nYou're soaking wet.\nHARRY\nWhose fault is that.\nETHNE squirms but loses herself in his embrace. As they start to kiss they're suddenly interrupted by TRENCH's braying voice in the distance.\ntrench o/s\n(A regimental song)\nGoodnight, Ladies...goodnight, Ladies...goodnight, Ladies, we hate to see you go...\nHARRY shakes his head in despair. \nTRENCH, castelton, willoughby and durrance together o/s\nMerrily we roll along, roll along, roll along...Merrily we roll along, until the morning comes...\nETHNE smiles.\nETHNE\nDuty calls. \nHARRY feels the quiet regret in her voice.\nharry\nWe've two days leave before we sail. Once I tell them we're engaged I'm sure they'll give me more. \nETHNE\nAs long as you promise to make me miserable. Argue with me all the time so I don't miss you a bit.\nHer lightness is forced. \nharrY\nYou'll be fine.\nETHNE\nYou don't have to reassure me. I'm a soldier's daughter. Everything under control. \nharry\nI've never kissed a stiff upper lip before.\nTRENCH's VOICE bellows out again as they kiss:\ntrench o/s\nGoodnight, Ethne's...goodnight, Harry's...Goodnight, goodnight, goodnight...\nHARRRY and ETHNE ignore him, the rain falling all around them.\nINT. REGIMENTAL HALL/ WESTMINSTER BARRACKS - night.\nThe regimental song turns into a deafening roar. All around the mess hall, OFFICERS are laughing and banging on tables. HARRY and DURRANCE stand on wobbly stools, downing pints of beer. As soon as their glasses are empty they set off down the hall at a sprint. It's an obstacle course. The two friends duck under two long tables, and crawl on their bellies, towards two more glasses. \nTRENCH and CASTELTON are busy laying bets on who'll win. DURRANCE and HARRY step over a bridge of chairs. They have to find a pint of beer hidden under one of them. DURRANCE finds his first. TRENCH looks at CASTELTON smugly, convinced he's going to win.\nHARRY and DURRANCE step-walk over two long benches. DURRANCE falls off. HARRY overtakes him. He throws his head back and finishes off another pint. CASTELTON stands up, cheering. \nHARRY and DURRANCE are level as they reach the last glass.  As they start to drink HARRY stops, spluttering.\nharry\nThis isn't beer, it's whisky.\ntrench\nDown in one!\nHARRY drinks again, but he's fallen behind. The pint of whisky disappears down DURRANCE's throat. Grinning, he makes his way towards the finish line. HARRY pours the whisky over his head, conceding defeat.\nEXT. TRAINING GROUND/ WESTMINSTER barracks/ LONDON - Day.\nAn obstacle course of a different kind. The CAVALRY are training, galloping at full tilt, HARRY and DURRANCE bringing up the front. At the sound of a bugle, they dismount their horses, and sprint towards a row of bayonets. They snatch up the weapons and charge a row of dummies.\nDRILL INSTRUCTOR\n...In. Out. On guard...\nThe blades tear into the dummies, exposing soft leaves and hard wood.\nDRILL INSTRUCTOR\n...Hold the line...and charge...\nThe OFFICERS charge towards a second set of targets. Teeth bared, they drive their bayonets into the stuffed dummies. CASTELTON's blade sticks in a chunk of wood.\nDRILL INSTRUCTOR\n...In and out, Castelton, in and out...\nCASTELTON pulls in frustation. He can't get the bayonet loose.\nDRILL INSTRUCTOR\n...They're coming at you boy. Rip it out or they'll stick you first.\nCASTELTON puts his foot on the dummy's head and tries to wrench the blade free. Even though it's only a training exercise, his panic is real. TRENCH slows down as he watches his friend struggling in vain.\nDRILL INSTRUCTOR\n...Move on Trench. Castelton's dead. Enemy spear through his throat.\nThe OFFICERS continue, bayonets thrust forward, leaving the struggling CASTELTON behind.\nEXT. STABLES/ training ground/ westminster barracks - day.\nThe men are washing up after exercises, dousing themselves with cold water.  Everyone's teasing CASTELTON, except for TRENCH. For once he keeps quiet, knowing how hard his friend's taking it. A SEARGENT-MAJOR enters and salutes.\nSERGEANT-MAJOR\nGentlemen... fifteen minutes, in the briefing room.\nAs he leaves, the MEN look at each other curiously.\nINT. BRIEFING ROOM/ westminster barracks - day.\nThe Officers are assembled.  HARRY, DURRANCE, TRENCH, WILLOUGHBY, and CASTELTON, take their places on the wooden benches. As he sits HARRY notices a map of Africa behind Colonel Hamilton.\nCOLONEL HAMILTON\n...Gentlemen... \n(when the room settles down)\nThe 1st Battalion Grenadier Guards have been ordered to forego their posting to India...\n(Off murmurs of surprise)\n...We ship out in three days, to establish a forward garrison in the Sudan...\nThere's a buzz of excitement. COLONEL HAMILTON can hardly contain his smile. He turns to GENERAL HOLMBY:\nCOLONEL HAMILTON\n...General Holmby, Sir.\nGENERAL HOLMBY, a severe looking military man, stands and faces the OFFICERS. Their eyes are lit-up with anticipation, all except Harry, who stares ahead, slowly turning inward. \nGENERAL HOLMBY\n...I'd like to apologise for not giving you men more notice. I know many of you will find it hard to see your families now. Unfortunately we had no alternative...\nHe turns to the map and points out the Sudanese desert.\ngENERAL HOLMBY \n...Three days ago, an army of Egyptian reserves led by General Hicks, was ambushed at Tashgil by the Mahdi's forces. Upoun attack the Egyptians fled, leaving General Hicks and the British Officers with him, to fight a heroic, but in the end hopeless rearguard action. All of them died, sword in hand... \nHARRY stares out silently, his whole world turned upside down.\ngeNERAL HOLMBY \n...I hesitate to call this a mission of vengeance, but the honour of our country is at stake. This Government has finally seen fit to send its own troops to war...\nThere's loud cheering from the men now, regimental pride and bravado covering any trace of nerves.\nEXT. COURTYARD/ westinster barracks - sunset.\nThe OFFICERS pour out into the courtyard, still exhilirated by the thought of seeing war. We hear TRENCH's voice rising above the others.\ntrench \n...I wish I had more than one life to give for my country. Two would make me feel a lot safer.\nHARRY laughs with the others, hiding his mounting anxiety.\nINT. HARRY and DURRANCE's ROOM/ BARRACKS - NIGHT.                     \nLaughter filters into Harry and Durrance's room. The two of them lie in their beds, watching the embers die out in the fireplace.\nDURRANCE\n(Gazing up at the ceiling where the noise is coming from)\n...I listen to them laugh, and I can't help wondering which ones won't be coming back. The worse part is I think I even know who they are.\nhaRRY\nAm I one?\nDURRANCE\nOf course not Harry. You're one of the lucky ones. Always have been.\nHARRY picks up the reference to Ethne but doesn't say anything. More laughter filters through. HARRY stares out in the darkness, tormented.\nDURRANCE\nWhat are you thinking?\nharry\n(Hesitating)\nI'm wondering what a Godforesaken desert in the middle of nowhere has to do with her Majesty the Queen.\nDURRANCE\nAsk Willoughby. He's on the Colonel's staff.\nharry\nI know what he'll say: 'It's not for us to question.'\n(A beat)\nDo you ever ask yourself why you're going?\nDURRANCE\nNot for the Queen. I hardly know her. \n(He smiles softly)\nNor for the regiment. There isn't much of a military tradition in my family...\n(A beat)\nI suppose I'm going because you're going. You, and Trench, and Castelton, and Willoughby... \n(A big grin)\nNot much of a reason I know, but it reassures me.\nHARRY smiles, but Durrance's words only make him feel more ashamed of the fear he feels inside. \nharry\nIs there anything that frightens you, Jack?\nDURRANCE\nI'm frightened of not coming back in one piece. Much more than dying. I wouldn't know what to do with myself in a wheel chair. And I couldn't stand to be pitied.\nHe puts the thought out of his head and grins.\nDURRANCE\nThere's a Church near our house. Next to the pub. Every night at ten the drunks spill out, shouting at the top of their voices. That's where I want to be buried. Where I can hear them.\nharry\nNothing's going to happen to you.\nDURRANCE\nIt's out of our hands anyway. Might as well sleep easy...\nDURRANCE rolls on his side. HARRY looks back at the fireplace, as the last embers fade.\nEXT. REGIMENTAL COURTYARD - dawn.\nA cold blue light hangs over the barracks. The courtyard is empty, except for a few sentries on duty. Wagons pull in, loaded with supplies.\nINT. HARRY and DURRANCE's ROOM/ BARRACKS - dawn.  \nHARRY buttons his uniform. He looks as if he hasn't slept. He turns to DURRANCE. His friend is still asleep. HARRY hesitates. He wants to wake him up, and talk, but in the end he turns away, and leaves the room.\nEXT. regimental COURTYARD - dawn.\nHarry walks slowly toward the Regimental Office. He glances up at the Regimental flag, flying beside the Union Jack.\nINT. ADCs' ROOMS/ THE REGIMENTAL OFFICE - dawn.\nWILLOUGHBY looks up from his desk as HARRY walks in. \nwilloughby\n(Grinning)\n...Harry. You're up early. \nHARRY smiles awkwardly but doesn't say anything. WILLOUGHBY senses something's wrong. \nwilloughby \n(Concerned)\n...What's the matter?\nHARRY looks at him for a moment, but then turns to Colonel Hamilton's other AIDE-DE-CAMP.\nHARRY\nI'd like to see the Colonel please.\nWILLOUGHBY stares in confusion. The AIDE-DE-CAMP disappears into the next door office.  HARRY still can't bring himself to look at his friend.\nwilloughby\nHarry, what's wrong?...\nHe's interrupted as the AIDE-DE-CAMP walks back in.\nAIDE-DE-CAMP\nThe Colonel will see you, sir.\nharry\nThank you.\nHARRY walks into Hamilton's office. WILLOUGHBY stares after him, bewildered.\nINT. COLONEL HAMILTON's office - day.\nCOLONEL HAMILTON glances at the letter HARRY has just given him. He stops reading after only a few words.\nCOLONEL HAMILTON\nWhat the hell is this?\nHARRY\nMy papers, sir.  I wish to resign my commission.\nCOLONEL HAMILTON doesn't appear to understand. He looks back at the piece of paper, as if he's misread something.\nCOLONEL HAMILTON\nIf it's leave you want, there's a different procedure. Normally I wouldn't consider it in the circumstances, but given you've got engaged...\nHARRY\n(Interrupting politely)\nI don't want any leave Sir. I wish to resign my commission.\nA long silence. COLONEL HAMILTON calmly puts the letter aside, and returns to his work, ignoring HARRY.\nharry \nSir...\nCOLONEL HAMILTON\nIt's nerves. We all have them.\nHARRY\nSir, I've made up my mind.\nCOLONEL HAMILTON\nAnd I'm asking you to reconsider.\nHARRY\nI have considered, sir.  And I've decided to leave the service.\nCOLONEL HAMILTON\nCome back to me when you've discussed it with your father.\nHARRY\nIt's not his decision, sir...\nHAMILTON explodes, all his repressed fury pouring out.\nCOLONEL HAMILTON\nI do not accept these \"papers,\" Lieutenant -- and do not accept that one of my men -- the son of a man with whom I was honored to serve -- would walk out on his Regiment --\nHARRY\nSir --\nCOLONEL HAMILTON\n-- on the very eve we're shipping off to war!  \n(holding out the papers)\nTake these back!\nHARRY\nI will not, sir.\nDead silence. \nharry\nI wish to resign my commission.\nHAMILTON stares at HARRY for what seems an eternity. He's struggling to make sense of something beyond his comprehension. Slowly he gathers himself and lowers his eyes, looking down at Harry's papers:\nCOLONEL HAMILTON\nVery well. Then as the coward and disgrace you are, you may take yourself out of my office...\n(Signing Harry's papers)\nPlease leave the barracks at once. You're belongings will be sent on. \nFace drained of color, Harry turns and leaves. \nINT. ADCs' ROOMS/ THE REGIMENTAL OFFICE - dawn.\nAs the door opens, WILLOUGHBY stares at HARRY, speechless. HARRY lowers his eyes and walks on.\nINT. STAIRWAY/ BARRACKS - DAwn.\nHARRY walks down the stairway, gripping the bannisters. Two SOLDIERS salute him on their way up, but he doesn't respond.\nEXT. regimental COURTYARD - dawn.\nThe supply wagons are being unloaded in the courtyard. HARRY walks between more SOLDIERS, his eyes fixed on the barrack gates. The only sound he hears in his head is the gentle flapping of a flag.\nINT. TRENCH and CASTELTON's ROOM/ BARRACKS - day. \nCASTELTON is packing his trunk, neat and fastidious, taking his time over every item. TRENCH waits for him impatiently.\ntrench\n...Why can't you do this after breakfast? We're not leaving till tonight.\nCASTELTON ignores him, folding his shirts. TRENCH turns to DURRANCE, exasperated.\ntrench \nHe packs three bibles. Can you believe it? Three bibles...\nDURRANCE grins. He glances up as WILLOUGHBY enters.\nDURRANCE\n...Field Marshall Willoughby...\nWILLOUGHBY doesn't smile. He looks ashen faced.\nDURRANCE\n...What's the matter?\nCASTELTON and TRENCH look up.\nwilloughby\nIt's Harry...\n(He still can't believe it)\nHe's resigned.\ntrench\nResigned what?\nwilloughby\n(Snapping at Trench)\nHis bloody commission. What do you think?!\nThere's a long silence. No-one knows quite what to say. DURRANCE finally speaks.\nDURRANCE\nWhat did Hamilton do? Refuse him leave?\nwilloughby\nHamilton didn't do anything. Harry went to see him of his own accord. Right after they changed our deployment.\nCASTELTON looks at TRENCH, as the insinuation sinks in.\ntrENCH\n...It's just a coincidence. He's having second thoughts about leaving Ethne.\nwilloughby\nHe was happy to leave her behind when we were going to India. No doubts then.\nDURRANCE\n(Jumping to Harry's defence)\nWhat's that supposed to mean?\nwilloughby\nYou tell me. He resigns his commission the very day we're sent to war.\nDURRANCE\nHarry's the best soldier in this regiment.\nwILLOUGHBY\nObviously not when it counts.\nDURRANCE\nWhy don't you say that to his face.\nCASTELTON\n(Intervening)\nWe don't know the circumstances yet. \n(Reasoning with Willoughby)\nI think we should give Harry a chance to explain.\nwilloughby\n(Bitterly)\nHarry's gone. He left this morning. Whilst you were all asleep.\nWILLOUGHBY turns away in frustration. He's as upset as the others, but he shows it in anger. TRENCH and CASTELTON look stunned. DURRANCE stares ahead in silence.\ntrench\nDid he say anything to you, Jack?\nDURRANCE\n(Quietly)\nNo. Nothing.\nDURRANCE remembers his conversation with Harry the previous night. \nWILLOUGHBY\nAn action like this dishonors the entire Regiment.\nDURRANCE\n(Suddenly venting his anger on Willoughby)\nWill you forget about your bloody Regiment for once! \nWILLOUGHBY\nAlright then, it dishonours us!\nHe stares at DURRANCE with conviction. \nwilloughby\nHe was my friend too, Jack...\n(A beat)\n...but a man who isn't prepared to give his life for his friends, isn't a man at all... \nFrom the look on their faces, it's clear TRENCH and CASTELTON are beginning to agree with him.\nwILLOUGHBY \nThis has to be answered.\nDURRANCE shakes his head, refusing to turn on Harry. He storms out of the room.\nINT. TRAIN to BINTREE - night.\nThe whistle of a train. HARRY sits in a crowded carriage, looking stiff in his civilian clothes. He glances out of the window, but sees only his own reflection in the glass.\nEXT. ethne's carriage/ BINTREE - day.\nETHNE drives the carriage through the country lanes, overjoyed to see HARRY.  \nETHNE\n...How many days leave have they given you?\nharry\nHow many days would you like?\nETHNE\nThey shouldn't have let you out of their sight. I'm going to kidnap you.\nharry\nI thought as much. This doesn't look like the way to your house.  \nETHNE laughs happily. HARRY can't quite bring himself to tell her yet.\nINT. village church near ethne's home - day.\nDappled light shines in the small stone Church. ETHNE takes HARRY under the arm, and walks him up the aisle.\nharry\nIsn't this supposed to be bad luck?\nETHNE\nSeeing me in the wedding dress is bad luck. This is practice. \nETHNE looks towards the church benches, as if she's greeting the guests.\nharrY \nSo I'm playing your father?\nETHNE\nYou have to be a little less steady on your feet. He's had a few to drink.\nharry\n(Taking slow deliberate steps)\nHow is he?\nETHNE\nFine. He'll be thrilled to see you.\nETHNE lets go of his hand as they reach the altar. She walks around him, and takes his other hand, as if he's the groom now.\nETHNE\n\"Do you Harry Feversham --\nharrY\n(Skipping the rest)\n-- You may kiss the bride.\"\nHe tries to kiss her.\nETHNE\n(Laughing)\nYou can't jump ahead like that. You have to let me enjoy my wedding. It's your fault the real one isn't for another year.\nHARRY hesitates, finally seeing his opportunity.\nharry\nThere's nothing to stop us getting married whenever we like, Ethne. I've handed in my papers.\nA long silence. ETHNE stares at him, not sure she's understood.\nETHNE\n...When?\nharry\nYesterday. I'd been thinking about it for a while. \nETHNE\nWhy didn't you tell me? Was it because of me?\nHARRY\nBecause of you. Because of me. I couldn't see the point of continuing. The moment I fell in love with you my career in the army was over.\nETHNE\nI would have supported your career. My mother did the same for my father. It's what's always been expected of me. \nharry\nI didn't think it was what you wanted.\nETHNE still looks conflicted.\nETHNE\n...It is my fault Harry. I gave you the wrong impression. I'm really much more stoical than that. It wouldn't have been easy, but I'd have coped. I love you far too much to let a year make a difference. \nhARRY\nIt wasn't what I wanted for us.\n(A hint of guilt as he hides the whole truth from her)\nI love this place. I love you in this place. We'll help your father with the farm. We'll get it going again. We'll begin our lives together.\nETHNE is silent, moved by his words.\nharrY \nAll I want is for you to be happy.\nETHNE\n(The smile slowly returns to her face)\nI am happy Harry. \nShe rests her head in his arms again.\nETHNE\nAs long as you're sure?\nhARRY\nOf course I'm sure.\nHe holds her close, kissing her hair, hiding his eyes from her.\nEXT. courtyard/ ETHNE'S HOME/ BINTREE - DAY                                                 \nDERMOD's dogs leap on HARRY as he jumps off the carriage. \nHARRY\nWhoa! You ought to train these beasts Dermod.\nDERMOD\nI have.  Trained them to scare away prospective son in laws.\nHARRY and DERMOD hug each other, already like father and son.\nINT. ENTRANCE/ ETHNE'S COUNTRY HOME - DAY                                                 \nA MAID hands ETHNE some letters and a parcel as she enters the house. HARRY follows her up the stairs.\nETHNE\nWhich room do you want?\nharry\nThe one with the connecting doors.\nETHNE\nYou must have imagined that one.\nINT. the guest room/ ethne's house. day.\nSunlight fills the room as HARRY throws open the blinds. He takes a long look at the fields outside.\nETHNE\n(Glancing through her letters)\nI see you've moved in already.\nharry\nWhy?\nETHNE\nThis one's addressed to you.\nShe holds out the small parcel. HARRY walks over curiously. \nETHNE\n(Teasing him)\nA secret admirer?\nharry\n(Teasing her back)\nI wonder which one it is. \nETHNE\nI'll open it, thank you.\nShe undoes the wrapping. There's a small white box underneath. She opens the lid. There's nothing inside, except three white feathers, pinned to three visiting cards. ETHNE's about to make a joke when she suddenly sees how pale HARRY looks.\nETHNE\nWhat is it?\n(Looking at the feathers again)\nWhat does this mean?\nHARRY\n(Slowly)\nThat there are some things that can't be hidden.\nETHNE\n(Beginning to look worried)\nI don't understand.\nharry\nThese are feathers of cowardice.\nETHNE laughs, nervously.\nETHNE\nWhat a horrible joke.\nharry\nIt isn't a joke Ethne. They were sent in earnest.\nETHNE\nBy whom? Who sent them? \n(Her anger rising)\nHow dare they!...\nharry\n(Reading the cards)\nWilloughby, Trench, and Castelton.\nETHNE\nYou see it is a joke. They're your friends.\nShe looks to HARRY for confirmation. \nHARRY\n(All he can say)\nYou're the most important thing to me.\nETHNE\n(Panicked by his tone)\nWhy are you saying that to me now?  What is it Harry?\nharry\nWe were told on Tuesday night that the regiment would be shipping out to the Sudan instead of India. That we'd be seeing war within a week. I handed in my resignation the following morning.\nThere's a long silence as ETHNE takes it in. Like Durrance she won't accept it.\nETHNE\nI don't believe that's why you resigned. You wouldn't have come to me like this. You wouldn't have been able to look me in the eye.\nHARRY stares at her guiltily, tormented.\nETHNE\n(The tears shining in her eyes)\n...I don't believe you. Three white feathers and our world is at an end. It can't be that simple...\nAnd still he doesn't answer. \nETHNE\n...Please Harry... You have to answer these charges...\nharry\n(Finally)\nI can't. All my life I've been following a path that's filled me with dread. I kept going because of the people behind me, and the people beside me, but all I wanted to do was turn and run. I didn't even have the courage to do that until I met you...\nETHNE\nDon't use me as an excuse.\nharry\nEthne --\nETHNE\n(Pulling away from him)\n-- This afternoon you told me you left the army because of me. Or at least you made me believe it. Tell me the truth? Would you have resigned if we weren't engaged?\nThere's a long silence. These are the hardest words Harry's ever had to speak.\nharry\nYes. I would have resigned. I wouldn't have gone to war for anything.\nETHNE stares at him a moment, then removes her engagement ring from her finger, and holds it out to him.  \nETHNE\nI've no right to call you a coward, but you are a liar. Please take this back.\nHARRY takes the ring without protest. ETHNE turns and walks away. As she leaves she sets the feathers on the table, and closes the door behind her.  \nHARRY listens to her footsteps fade. He walks towards the table. As he looks down he sees four feathers. Ethne has snapped the fourth from her fan. \nVery carefully, as if they were the most precious objects in the world, HARRY gathers them, his eyes shining with tears.\nEXT. LONDON DOCKS - NIGHT.                                                \nA burst of noise and colour. Rows of SOLDIERS march by, in perfect squares, proudly wearing their regimental colours. The wharf is lined with PEOPLE, cheering and waving flags, sending them off to inevitable victory.\nINT. stable deck/ troop ship/ LONDON DOCKS - NIGHT. \nWe can still hear the roar of the crowd outside. CASTELTON is trying to coax his horse into its box. TRENCH, and WILLOUGHBY, and DURRANCE wait for him.\ntrench\n...Come on Castelton. Give her a good kick. I want to wave to the ladies...\nEXT. wharf/ LONDON DOCKS - NIGHT.\nThe CROWD below cheers as the soldiers crowd the rails.\nEXT. rails/ troop ship/ LONDON DOCKS - NIGHT. \nTRENCH waves at the crowd as if he were the Queen. CASTELTON is lost in the scale of it all. DURRANCE stares at the tiny figures, wondering if Harry's amongst them. \nwilloughby\n(Interrupting his thoughts)\n...Jack, I wanted to apologise for the other day. My argument wasn't with you.\nDURRANCE\nIt's forgotten.\nDURRANCE keeps staring into the crowd below.\nEXT. wharf/ LONDON DOCKS - NIGHT.\nHARRY stares up at the ship, a ghost amongst the cheering faces. The SOLDIERS at the rails look like specks, but Harry knows his friends are somewhere up there. \nEXT. officer's stand/ wharf/ LONDON DOCKS - NIGHT.                                               \nA line of RETIRED OFFICERS, salute as the vessel finally sets off. Amongst them is GENERAL FEVERSHAM, Harry's father. He stands at attention. \nEXT. LONDON DOCKS - NIGHT.\nThe celebrations over, the CROWD moves away from the docks. HARRY searches through the throng for his father. \nEXT. HANSOM CABS/ LONDON DOCKS - NIGHT.\nGENERAL FEVERSHAM and COLONEL SUTCH wait in line for a hansom cab. The two old soldiers look frail in the falling rain. As they're about to climb onto a carriage, a voice calls out:\nHARRY (o.s.)\nFather...?\nThe General turns around. His eyes fill with emotion as his son approaches.\nHARRY\n...I need to talk to you, Sir.\nThere's a long silence as GENERAL FEVERSHAM gazes at his son. HARRY looks as if he hasn't slept in days. His eyes are swollen and bloodshot, full of heartbreak and shame. For a moment it seems as if the old man will take him in his arms and comfort him, but instead he averts his eyes, and climbs into the carriage. COLONEL SUTCH looks at HARRY regrettably, as if to say there's nothing he can do.\nEXT. LONDON STREETS - night.\nNEWSBOYS follow HARRY home, trying to sell him their newspapers, refusing to take no for an answer.\nNEWSBOY\n...It's a commemorative issue, Sir. War in the Sudan...\nHARRY buys a paper just to be rid of him, only for another NEWSBOY to take his place.\nSECOND nEWSBOY \nDifferent paper Sir, London Times. commerative issue...\nINT. HARRY'S APARTMENT - DAY.\nThe sound of guns echoes in the distance. HARRY looks up. His face is unshaven, his eyes glassy from lack of sleep. Another volley sounds outside. HARRY gets off the floor and walks over. As he does so we see the piles of newspapers that have gathered on his floor over the past few weeks. \nThe regimental guns boom outside. HARRY opens the window. He wants to hear them more clearly. He wants to be reminded of his shame.\nHe walks back to the day's newspapers and kneels down amongst the mess. We see headlines of massacres and slaughters, beneath them artist's impressions of the Mahdist atrocities. \nEXT. LONDON STREETS - day.\nThe NEWSBOYS run from HARRY now, mistaking him for a tramp. He catches up with one of them, forcing some money on him. \nNEWSBOY\n(Giving him a paper)\nBritish defeat in the Sudan! Hundreds dead!...\nHARRY flicks through the newspaper anxiously.\nEXT. war office/ LONDON - day.\nCROWDS have gathered outside the War Office. The mood has changed from celebration to panic. PEOPLE are stunned by the news of defeat, desperate to hear if their loved ones are alright. SOLDIERS hold back the surging mass. Only small groups are allowed in at a time.\nINT. corridor/ war office BUILDING/ LONDON - day.\nHARRY hurries down the corridor towards an area where the names of British casualties have been pinned to a notice board. PEOPLE swarm past him in the other direction. Some of them look relieved, others are overwhelmed by grief. HARRY hurries on, his heart pounding.\nINT. CASUALTY LIST/ war office BUILDING/ LONDON - day.\nHARRY pushes through the CROWD of peering heads. As he finally elbows his way to the front he glimpses the long list of casualties. His eyes look through the D's first. Durrance's name isn't there. No sign of Castelton under the C's. HARRY is jostled backwards as he searches for the other names. With a fierce effort he gets to the front again. No Trench under T, no Willoughby under W. They're all safe. HARRY's body slackens with relief.\nEXT. harry's appartment block/ LONDON STREET - day.\nHARRY looks drained as he reaches the front door of his building. As he opens it his LANDLADY walks out.\nlandlady\nThere's someone to see you Sir. They're waiting upstairs...\nHARRY doesn't wait for her to finish.\nINT. STAIRWAY/ harry's appartment block/ LONDON STREET - day.\nHARRY bounds up the stairs, expecting to see Ethne. He stops suddenly as he sees COLONEL SUTCH instead, waiting outside his door. He hides his disappointment with an awkward smile.\nhARRY\nColonel Sutch...\nSUTCH can't help staring at HARRY, shocked by the state he's in. \nINT. HARRY'S APARTMENT - DAY.\nHARRY tries to make the room look more presentable, gathering up the newspapers and maps off the floor. He finally stops what he's doing and turns around. \nharry\n(Quietly)\nHow is he?\nCOLONEL SUTCH\nHe's been very withdrawn. I've tried to persuade him to leave the house but he's a stubborn man.\nharrY\nWill he see me?\nCOLONEL SUTCH\nI don't think so...\n(He pauses)\n...but if it's money you need he won't cut you off. He hinted as much to me. \nharry\nI don't need money, Sir. \nHARRY turns away. SUTCH looks torn. As a soldier he disapproves of what Harry's done, but as a family friend he can't help feeling sorry for the boy.\nCOLONEL SUTCH\nYou were never cut out for this proffession. \nharrY\n(A thin smile)\nWas it that obvious?\nCOLONEL SUTCH\nIt was to me. Ever since you were a child. I only wish I'd said something to your father.\nHARRY turns and faces him. \nharrY\n(With an almost morbid curiosity)\nHow did you know I didn't have it in me?\nCOLONEL SUTCH\nWhat difference does it make?\nharrY\nIt does to me, Sir. It's all I think about. What makes a man a coward? \nCOLONEL SUTCH\n(Losing patience)\nThat's enough Harry. Get on a grip on yourself. You're no use to anyone, sitting here all day, driving yourself mad...\nThe outburst seems to release SUTCH from his soldier's reserve. He's all concern now.\nCOLONEL SUTCH\nWhat's done, is done.\nharrY\n(Quietly)\nNo Sir, it isn't.\nHARRY reaches into his pocket and pulls out a small white box. He opens it in front of SUTCH. There are four white feathers inside. SUTCH stares at the names on the cards. \nCOLONEL SUTCH\n(Stunned)\nWho sent you the fourth? Jack?\nharrY\nEthne.\nSUTCH looks up in surprise, beginning to realise the full extent of Harry's heartache.\n\nCOLONEL SUTCH\nThrow them away. They don't mean a thing.\nHARRY\nThey do to me, Sir. They're all I have left of my friends.\nCOLONEL SUTCH\nHarry, this is morbid.\nharrY\nI don't mean it that way...\n(Trying to make him understand)\nYou see, if there was something I could do, something so undeniable...I'm not saying it would change anything, it's too late for that...but if the feathers can be given, then they can be taken back.\nCOLONEL SUTCH\nHarry, your friends are in Egypt.\nHARRY\nYes Sir. In Alexandria. They transfer to Suakin in a fortnight.\nSUTCH doesn't understand at first. Then he looks at the newspapers and maps spread out across the floor, and begins to see the method in Harry's madness.\nCOLONEL SUTCH\n(In disbelief)\n...You're a civilian. Even if you find them, there's nothing you can do.\nharry\nI'm well aware of my chances.\nCOLONEL SUTCH\nThen what's the point!? \n(Staring at him in dismay)\nYou think Ethne will take you back? Is that what you think?!\nFrom the look in his eyes it's clear the thought had entered his head. Sutch's words bring him back down to earth. His voice is quieter now, resigned.\nharrY\nI don't have any choice... \n(With a terrible honesty)\nI'm not sure how much longer I can live with myself, here, like this... \nCOLONEL SUTCH stares at him with pity, seeing the depth of his anguish.\nhaRRY \nI'm leaving for Egypt tomorrow.\nCOLONEL SUTCH\n(He realises there's no point trying to dissuade him)\nDo you want me to tell your father?  \nharry\nOnly if something should happen to me. I'll write and let you know how I am, as often as I can.\nCOLONEL SUTCH\nWhat about Ethne?\nHARRY has to think long and hard about this. The thought of her fills him with sadness.\nhARRY\nI'd rather you didn't tell her anything. After all I've put her through the least I can do is let her forget me in peace. \nCOLONEL SUTCH looks moved by his predicament, and impressed by these first, grasping signs of nobility. \nharrY\nMaybe I'll come back sooner than I think -- hear the guns booming off the African coast, and take the first ship home.\nCOLONEL SUTCH\nI doubt it, Harry.\nCOLONEL SUTCH smiles weakly.\nEXT. HARRY's POV. VIEW OF THE AFRICAN COAST - day.\nThrough the shimmering heat we see the outlines of the African mountains: an arid moonscape, dust clouds blowing in the wind.\nEXT. port of ALEXANDRIA - DAY.\nThe same veil of dust blows through the crowded port. HARRY covers his eyes. His hair is longer now, his face gaunt and bearded. Clutching his suitcase, he moves through the throng.\nEXT. streets of ALEXANDRIA - DAY.\nThe alleyways look almost dreamlike through the shimmering heat. It's as if we're in Harry's head, reflecting his state of mind. A crowd of URCHIN BOYS are following his every step, imitating his langorous walk. HARRY doesn't notice them. His gaze is riveted by the sights around him: the MERCHANTS beckoning him into their shops; the BRITISH SOLDIERS on leave, sheltering in the cool hollows of the cafes and whorehouses; the BEGGARS, hunched up against the stone walls, their faces covered with flies.\nThrough the arches of the Souk, a wedding procession appears. The BRIDE and GROOM sit on brightly painted donkeys. All around them WOMEN and CHILDREN clap and shrill. HARRY catches a glimpse of the bride's face. She gazes at him for a moment, then looks away.\nINT. COLONIAL HOTEL/ ALEXANDRIA - DAY.\nThe colours of the Souk give way to the cool white emptiness of a colonial hotel. ENGLISH GUESTS talk in hushed whispers as EGYPTIAN WAITERS serve them tea. HARRY sits in a corner of the lobby, nursing his drink, observing a group of ENGLISH OFFICERS, laughing amongst themselves.\nHARRY looks thoughtful, wondering how to approach them. Suddenly he hears a commotion. A drunk BRITISH CORPORAL is escorted out of the hotel by a group of SENIOR OFFICERS. He shouts and swears, but they ignore him, throwing him out of the door. HARRY gets up as he sees his chance.\nINT. EGYPTIAN bar - brothel/ BAZAAR/ ALEXANDRIA - night.\nThe rhythmic beating of drums. Tattooed WOMEN dance on a makeshift stage, mesmerising the crowd of eager SOLDIERS. HARRY sits with the drunken BRITISH CORPORAL. The man's eyes keep drifting longingly towards the stage, as if he hasn't seen a woman in months. HARRY fills his glass.\nBRITISH CORPORAL\n(Resuming their conversation)\n...It's all reconnaisance trips. The river's too swollen to move troops in numbers. Her Majesty's army's rotting in Suakin.\nharry\nWhich other regiments were with you?\nBRITISH CORPORAL\nThey're all there: the Hussars, the Highlanders, the Grenadiers...Which newspaper did you say you were from?\nhARRY\nThe London Times.\nBRITISH CORPORAL\nYou must think I'm a disgrace? 'Sand happy'. That's what those Officers called me. \nharry\nHow much longer do you think the troops will be held up in Suakin?\nBRITISH CORPORAL\nAs long as they can if they're lucky.\n(He finishes his drink)\nDoes the Prime Minister read your paper?\nharrY\nI imagine so.\nBRITISH CORPORAL\nThen tell him from me we're on a losing wicket here. These bastards aren't scared of anything. If they saw death walking down the street they'd hide in an alleyway and try to pick him off with a stone. How do you fight people like that...\nHe tries to drain the last few drops from his empty glass, then looks over longingly, at the tattooed DANCERS. \nEXT. SAND STORM/ desert near SUAKIN/ sudan - DAY. \nThick gusts of sand blow at us. As the swirling clouds settle we see a group of misshapen figures, huddled together. As they finally rise and start to move, we realise they're BRITISH SOLDIERS, on camels. Amongst the dust caked faces we see TRENCH, CASTELTON, WILLOUGHBY and DURRANCE.\nEXT. DESERT near SUAKIN/ SUDAN - DAY. \nThe sand storm has cleared, and in its place a harsh desert sun beats down. The COLUMN OF BRITISH SCOUTS trudges forward. DURRANCE rides at the front, looking as if he were born here, eyes alert to every shimmer and nuance.  \nUp ahead he sees a large mound of stones standing out amongst the mud flat. He drives his camel forward. As he approaches he sees that it's a dervish burial mound. Skulls and skeletons are splayed across the rocks. WILLOUGHBY rides up through the ranks and joins him.\nWILLOUGHBY\nWhat do you think?\nDURRANCE\nI think they're trying to frighten us off. We should keep pressing forward. \nWILLOUGHBY offers DURRANCE his water flask. DURRANCE takes a drink.\nDURRANCE\n(Pulling a face)\nIt's bloody whisky.\nwILLOUGHBY\n(Grinning)\nMy camel drinks the water.\nEXT. burnt out fortress/ desert - day.\nAs the camels tread their way through the sun baked shingles a ghostly fortress appears on the horizon. The men start loading their rifles instinctively.\nEXT. courtyard/ burnt out fortress/ desert - day.\nAll that's left of the fortress is a grim skeleton. The Union Jack lies ripped to shreds, halfway down its flagpole. The BRITISH SOLDIERS gaze at the destruction. Their camels sense their tension and rear a little in the eerie silence. As ever, TRENCH is the first to break the ice.\ntrench\n(Jumping off his camel, walking towards the fortress well)\nI don't know about you lot, but I'm going to grab a drink before Mustapha does.\n\"Mustapha\" the camel whinnies as if he's understood every word. The MEN start laughing. \nDURRANCE\nThe water's probably poisoned.\ntrench\n(Leading his camel towards the well instead)\nMustapha, be my guest.\nThere's more laughter. DURRANCE smiles but his eyes are still alert. Above the fortress tower he sees a flock of birds taking flight, rising up gracefully towards the desert sun. Suddenly amidst the laughter and chatter, one of the SOLDIERS topples off his camel. His FRIENDS laugh:\nfriendS\n...Capshaw you dosy bastard...\n...Camilla's tired him out...\nCAPSHAW doesn't move. CASTELTON's the first to realise something's wrong. He jumps off his camel and turns CAPSHAW over. Half the soldier's face has been blown off. Raw bone glistens underneath. CASTELTON rears back in horror. \nCASTELTON\nSniper!\nPanic erupts. The SOLDIERS leap off their camels, using them as shields. \nThe sniper's bullet rings out and sends one of the animals crashing to the dirt. The men start to run now, seeking shelter in the surrounding hutments. The sniper's gun rings out repeatedly.\nEXT. HUTMENT/ burnt out fortress/ desert - day.\nDURRANCE and CASTELTON duck into the hutment. \nDURRANCE\n...Keep him pinned. He's up in the tower.\nCASTELTON unleashes a volley of shots. DURRANCE moves quickly to the other side of the hutment and climbs out of the window.\nEXT. courtyard/ burnt out fortress/ desert - day.\nThe camels circle around themselves in panic. TRENCH weaves his way between the rearing animals, protecting himself from the sniper. A shot rings out and spits dust in his face. \ntrench\n(Whispering in anger)\nYou bastard...\nEXT. outer perimeter/ burnt out fortress/ desert - day.\nDURRANCE runs around the back of the fortress, breathing hard.\nEXT. courtyard/ burnt out fortress/ desert - day.\nA second shot spins TRENCH round, grazing him in the arm.\ntrench\n(His voice rising)\nYou bastard!\nA third shot narrowly misses. TRENCH is up and running now, not waiting for the fourth.\ntrench \n(Shouting like a madman as he charges towards the hutment)\nYou bastard! You bastard! You bastard!\nEXT. outer perimeter/ burnt out fortress/ desert - day.\nDURRANCE has a clear view on the sniper's tower now. From below he can see the man's rifle edge out, fire, and then withdraw. DURRANCE heads quietly towards the tower stairs.\nEXT. STAIRS/ SNIPER's TOWER/ burnt out fortress  - day.\nSeveral of the steps are missing from the rickety stairway. DURRANCE climbs over them as lightly as he can. Up above he can hear the sniper's rifle ringing out. \nEXT. castelton's HUTMENT/ burnt out fortress/ desert - day.\nCASTELTON fires another round at the sniper's tower. TRENCH sits on the floor, cursing as he bandages his grazed arm.\nEXT. SNIPER's TOWER/ burnt out fortress  - day.\nDURRANCE raises his head cautiously. At the tower window he sees the DERVISH SNIPER firing his rifle. DURRANCE hesitates. He could kill the man easily, but it would mean shooting him in the back. He can't bring himself to do it:\nDURRANCE\nDrop it!\nThe DERVISH SNIPER stops still. He turns around slowly and looks DURRANCE in the eye. A contemptuous smile flickers across his face. Very slowly, he takes a bullet from his pocket and slips it in the rifle. He doesn't even look at DURRANCE. There's a terrifying, suicidal calm about him.\nDURRANCE studies his enemy, admiring his utter contempt for death, and then fires two bullets into his head.\nEXT. TENTS/ THE BRITISH CAMP/ suakin/ sudan - night.\nBonfires flicker across the British camp. DURRANCE sits outside his tent, bathed in firelight, watching some BEDU DANCERS performing for the BRITISH TROOPS. He seems far away, as if he's thinking about the day's kill. TRENCH's braying voice snaps him out of his reverie.\ntreNCH\n(Showing off his wound)\nLook at this beauty...\nTRENCH sits down between DURRANCE, CASTELTON, and WILLOUGHBY.\ntrench\n(Playful)\nIt's true what they say. You haven't lived until you've been shot.\nCASTELTON\nIt's only a scratch.\ntrench\nYou wouldn't understand. You haven't looked into the abyss.\nCASTELTON\nShut up Trench...\nDURRANCE joins in the laughter but he still seems far away. \nwiLLOUGHBY\n(Noticing)\nAre you alright, Jack?\nDURRANCE\n(Smiling)\nCouldn't be better.\nWILLOUGHBY sees the haunted look in his eyes, but doesn't say anything. A SEARGENT-MAJOR interrupts.\nseRGEANT-MAJOR\nLieutenant Durrance, Colonel Hamilton would like to see you in his tent, sir.\ntrench\nPoor Willoughby, they've passed you over.\nWILLOUGHBY grabs a handful of sand and throws it at TRENCH. DURRANCE gets up to see what HAMILTON wants.\nEXT. COLONEL HAMILTON's TENT/ BRITISH CAMP/ suakin - night.\nCOLONEL HAMILTON sits at a fold-up table, eating his dinner by candlelight. He turns around as DURRANCE walks in. He wipes his face with his knapkin and gestures for DURRANCE to sit.\nCOLONEL HAMILTON\n...Congratulations, it seems you had another successful day.\nDURRANCE\n(Too honest to accept the complement)\nWe killed one Dervish sniper, Sir.\nCOLONEL HAMILTON\nI'm giving you three weeks leave.\nDURRANCE looks surprised.\nDURRANCE\nI really don't need, or deserve any leave.\nCOLONEL HAMILTON\nYou certainly deserve it, every report I receive singles you out for praise.\nDURRANCE\nWith your permission, I'd like to stay here with the rest of the regiment.\nCOLONEL HAMILTON\nPermission refused.\nDURRANCE is too disciplined a soldier to protest.\nCOLONEL HAMILTON\n...Anyway the rest of the regiment is stuck here in Suakin until the Government agrees to send us to Khartoum... \n(Containing his frustration)\nYou and several other Officers will be going to London, to convince parliament, and more importantly public opinion, that it is necessary to pursue this campaign with the utmost vigour. Do you have any questions?\nDURRANCE\nYes Sir, why me?\nHAMILTON pauses. Then almost mischievously:\nCOLONEL HAMILTON\nBecause you're a hero.\nDURRANCE\nWith all due respect Sir, I don't think we've been fighting long enough to have any heroes in this campaign.\nCOLONEL HAMILTON\nThat's my point. It's all about perception.\nDURRANCE sees there's no point discussing it further. He salutes and turns to leave.\nCOLONEL HAMILTON\nA question Lieutenant?\nDURRANCE\nYes Sir?\nCOLONEL HAMILTON\nWhat is it you like about this place?\nDURRANCE chooses his words carefully.\nDURRANCE\nThe freedom Sir. The fact that one is reduced to what one really is.\nCOLONEL HAMILTON smiles softly, wondering if Durrance is insulting him, not giving a damn.\nEXT. desert between EGYPT and sudan - day.\nA searing white sun hangs over the desert. Somewhere amidst the rolling dunes and floating dust we see a caravan of camels, winding its way through the plateau.\nEXT. caravan/ desert between egypt and sudan - day.\nHARRY rides at the front of the caravan with GUSTAVE, a sun blackened french slave-driver. Behind them ride SAADI, his Dinka assistant, and three beautiful DINKA SLAVEGIRLS. \ngustave\n...The British soldiers rent my girls off me for three dhirrams an hour. Well worth the trip to Suakin. \nHARRY smiles distractedly. His eyes are fixed on the majestic landscape before him, miles and miles of rolling desert.\ngustave\n(Recognising the first time awe one feels for the desert)\nDon't fall in love too quickly. Nothing turns on you like the sand.\nHe looks back at the DINKA SLAVEGIRLS, who are whispering amongst themselves.\ngustave \nShut up!!... \n(To Saadi)\nKeep them quiet! What do I pay you for?!\nSAADI says something to the SLAVEGIRLS in their native Dinka tongue. From the deference in his voice it's clear the women are from a higher caste than him.\nEXT. desert between EGYPT and sudan - day.\nA breeze blows sand-drifts across the desert floor. As a veil of dust clears, HARRY sees the bones of a camel, forming a perfect skeleton on the floor.\ngustAVE\nBones are a good sign. We must be near a well.\nEXT. well/ desert between EGYPT and sudan - day.\nThe skeletons lie thick around the well: six or seven men in Bedu Robes, sprawled within yards of the precious water. \ngustave\n(As Harry stares at the bones)\nWhat else is there to fight for in a desert. At least it makes sense of war.\nSAADI hoists some water up in a goatskin canteen.  He offers the canteen to GUSTAVE. The French slave-driver is about to take a drink when he hears one of the DINKA SLAVEGIRLS murmuring in her native tongue. He wheels his camel around angrily.\ngUSTAVE \n(To Saadi)\nWhat did she say?\nBefore SAADI can make an excuse  for her, the DINKA SLAVEGIRL starts cursing in her native tongue, her eyes fixed on GUSTAVE. \nGUSTAVE lashes out with his whip. The SLAVEGIRL's camel rears, throwing her to the floor. GUSTAVE rides towards her, raising his whip, ready to beat her.\nHARRY's camel suddenly lurches between them. At first it looks like he's lost control of the animal, but as he steadies his mount, it becomes clear he's put himself in Gustave's way.\nGUSTAVE sneers. With inch perfect skill, he starts to circle HARRY, trying to get a clear view of the girl. With equal skill, HARRY twists his own camel round, keeping her blocked from him at every turn. \nGUSTAVE grows impatient. He raises his whip, threatening Harry. HARRY doesn't flinch. His eyes are fixed on Gustave the whole time. Finally GUSTAVE backs down, intimidated by the mysterious stranger. He stares at HARRY, half in anger, half in admiration.\ngustave\nYou ride well.\nWith that he rides his camel back to the well. The DINKA SLAVEGIRL doesn't look at HARRY. She's too proud to acknowledge his help.\nINT. cave/ desert between EGYPT and sudan - night.\nA howling sandstorm blows outside the cave. The camels screech in the night, terrified by the wind. SAADI and the DINKA GIRLS shelter in the furthest corner of the cave. HARRY and GUSTAVE sit by a flickering fire. \ngUSTAVE\n...What's your secret? Anyone who talks as little as you do must be hiding something? Did you kill a man? \nHARRY prods the fire, ignoring him. GUSTAVE turns around as he hears SAADI and one of the DINKA GIRLS whispering.\nguSTAVE \nTaiser vouz!\nSilence. GUSTAVE turns back to HARRY, looking pleased with himself.\nguSTAVE\nYou have to break them. For their own good. They'll only be happy again when they forget what it's like to be free.\n(He looks at Harry mischievously)\nIt's like a man who's been thrown over by a woman. At first he's defiant, then he's determined, but finally he longs to forget.\nHARRY gets up and walks to the other side of the cave. He hears GUSTAVE chuckling behind him.\ngUSTAVE\n...Any secrets you have, the desert will find you out.\nEXT. PASS/ CLIFFS/ desert between EGYPT and sudan - night.\nA screaming gale howls through the desert pass.\nINT. cave/ desert between EGYPT and sudan - night.\nIt isn't the storm that wakes HARRY up, but the sound of whispering. GUSTAVE is snoring by the fire.  HARRY looks past him. He sees SAADI and the DINKA SLAVEGIRL he rescued earlier, lying in each other's arms, making love as quietly as they can. \nHARRY can't help staring. Their act seems to represent the ultimate defiance, he ultimate affirmation of their freedom. He feels a spark of hope in their hope. \nSAADI and the DINKA SLAVEGIRL finally come to rest in each other's arms. HARRY listens as they continue to whisper in their native tongue. He's about to close his eyes when suddenly the DINKA SLAVEGIRL gets up.\nHARRY watches curiously as she walks across the cave. She picks something off the floor. As she walks towards GUSTAVE HARRY suddenly sees that it's a sharp jagged rock. \nBefore HARRY can say anything the girl falls to her knees and buries the rock deep into GUSTAVE's face. Almost simultaneously HARRY feels a sharp crack on the back of his head. He rolls away instinctively, but to no avail. \nThe blows rain down. As he tries to protect his face, HARRY sees SAADI, holding a thick wooden club over him. The club hammers down, splitting Harry's fingers, tearing into his face, knocking any resistance out of him. \nAs he stares up listlessly, HARRY sees SAADI standing over him, ready to finish him off. Suddenly a voice rings out, a woman's voice, calling Saadi off.  HARRY's eyes drift away.\nINT. ARMY/NAVY CLUB - LONDON - day.\nWe see ETHNE's face now, staring out. For a moment we think she's part of Harry's dream, but then the familiar noises of reality fade in, and we realise she's amongst a crowd of OFFICERS and JOURNALISTS, listening to DURRANCE lecturing about the Sudan:\nDURRANCE\n(Aware she's in the audience)\n...Each moment we delay, we imperil General Gordon's life. The Mahdi is concentrating all his forces on Khartoum. At most the garrison can hold out for a few more weeks...\nEXT. ARMY/NAVY CLUB - LONDON - day.\nDURRANCE stands at the club entrance with ETHNE and her friend, CAROLINE ADAIR. \nETHNE\n...Caroline read about your lecture in the Times. We're both very proud of you.\nDURRANCE\nI'm glad you came. \nDURRANCE tries not to stare at ETHNE too hard. \nCAROLINE\n...We have to be somewhere this afternoon, but if you're free this evening Lieutenant Durrance...\nDURRANCE\nI'm afraid I have to give another talk.\nETHNE\n(Suddenly)\nWould you mind if I didn't come with you Caroline? I don't know the Gilby's all that well...\nCAROLINE hesitates. We see the reluctance in her eyes, but she's far too dignified to show it.\nCAROLINE\nYou can do whatever you like, darling.\nEXT. LONDON/ STREET - day.\nDURRANCE and ETHNE walk along a crowded street. Passing WOMEN glance admiringly at DURRANCE in his uniform.\nETHNE\nThat's six I've counted.\nDURRANCE\nSix what?\nETHNE\nSix married women, gawping at you.\nDURRANCE smiles shyly, wondering if she's flirting with him. \nINT. tea shop/ LONDON - day.\nA tinkle of china and cutlery. ETHNE and DURRANCE sit in a tea shop. ETHNE can't help sending up the place. She dabs her lips with her napkin, pretending to be all prim and proper.\nDURRANCE\nDo you want to go somewhere else?\nETHNE\nNo, it's lovely here. I'm teasing.\nDURRANCE looks out of place in the surroundings, and nervous around ETHNE.\nETHNE\n(Trying to put him at ease)\nI want to hear all about the desert?\nShe leans towards him, like a child waiting to hear a tale. DURRANCE isn't sure if she's aware of the effect on him.\nDURRANCE\nIt grows on you. There's something about all that emptiness that concentrates the mind.\nETHNE\n(Looking into his eyes)\nOn what?\nDURRANCE\n(He hesitates)\nYou spend a lot of time thinking about the people you miss -- especially at night -- You have the most vivid dreams, it's hard to believe they're not real...\nHe stops as he sees the sadness in her eyes, reminded of the barrier between them.\nDURRANCE\nHave you heard from Harry?\nETHNE\n(A beat)\nNo. Have you?\nDURRANCE\nI went to see General Feversham. He refused to discuss it with me. \nETHNE\nI know they had a falling out. \nShe tries to sound casual, but DURRANCE feels how much the thought of Harry still pains her.\nDURRANCE\n(Testing her, almost in spite of himself)\nHe's one of the people I think about all the time.\nETHNE\n(Very deliberately)\nI don't as much as I used to.\n(Looking up at Durrance)\nI certainly wasn't until you brought him up.\nThere's a touch of reproach in her eyes, but also something flirtatious. It's as if she's forcing herself to put Durrance above Harry in her thoughts. \nETHNE\nWhen do you go back?\nDURRANCE\nFriday.\nETHNE\nSo soon?\nDURRANCE isn't sure how to read her disappointment. He feels conflicted about Harry, but he can't help being drawn to her.\nDURRANCE\n(Awkwardly)\nAre you sure I can't persuade you to stay in London a few more days? Listen to more of my boring lectures...\nETHNE\nI thought the talk was fascinating.\nDURRANCE\n(Steeling himself)\nI really would like to see you again before I leave.\nThere's something touching about Durrance's shyness: a contradiction between the fearless warrior and the tentative lover. ETHNE feels torn, but she wills herself on:\nETHNE\n(Lightly, but acknowledging his invitation nevertheless)\nYou could always visit us in Bintree. \nShe feels her eyes drifting away from him, but she forces herself to look back, and holds his gaze.\nINT. cave/ desert between EGYPT and sudan - day.\nHARRY opens his eyes painfully. His face is still battered and swollen from Saadi's beating. As he picks himself up he sees Gustave's body, lying exactly where the Dinka slavegirl killed him, the jagged rock still embedded in his face. HARRY looks away as he hears a camel whinnying outside.\nEXT. cave/ desert between EGYPT and sudan - day.\nThe camel is tied by some rope to a jutting rock, a goatskin canteen slung over its back. HARRY realises the Dinka girl he rescued has left them for him. He looks over the horizon. There's no sign of the Dinkas, only the vast desert waste.\nEXT. DUNES/ desert between EGYPT and sudan - day.\nHARRY urges his camel up the steep slope of a crescent dune. His battered face is burnt raw by the sun, his skin covered in blisters. He looks out hopefully as his camel finally conquers the sandy peak, but all he sees in its place are miles and miles of rolling dunes. \nEXT. water trough/ desert between EGYPT and sudan - day.\nHarry's camel noses its way into a shallow water trough. HARRY almost drops off the animal in his haste to drink. He digs his hands into the mud and cups some of the precious liquid in his palms. It's only after he's drunk that he realises there are dozens of tics, stuck to his arms, and face. \nEXT. desert between EGYPT and sudan - night.\nHARRY shivers in the cold night air, partly from the wind, but also from the fever he's caught off the tics. Hands trembling, he burns the blood gorged insects off his arm with a glowing stick from the camp-fire.\nEXT. shingles/ desert between EGYPT and sudan - day.\nHARRY's camel rears as it treads over the searing shingles. He topples off. Eyes half shut, he grabs the reins, making sure the camel doesn't run off. He takes a knife from his pocket.\nharry\n...I'm sorry, I'm sorry...\nHe cuts a slash in the camel's hide and puts his mouth to it. He sucks up what little blood he can, and rolls the liquid around his mouth.\nEXT. desert between EGYPT and sudan - night.\nHARRY talks to himself in the dark. His face is all puffed up with fever, his hair chalked with dust. Above him the stars glimmer, promising another day of relentless sun.\nEXT. DESERT HILLS/ desert between EGYPT and sudan - day.\nHARRY lies unconscious on the camel's back, roped to the animal. The CAMEL noses it's way through the desert floor, coming across a few shrubs. It tears them out of the earth, and starts up the hill, in search of more nourishment. HARRY slides precariously down the camel's back. Only the ropes hold him tight. As the camel finally reaches the top we see a vast plateau open up before us. The earth is still desert brown, but there are patches of green now -- and somewhere in the distance, the sky is blackening with rain.\nEXT. STREETS OF SUAKIN/ SUDAN - night.\nA torrential downpour floods the narrow streets of Suakin. A group of excited BEGGAR BOYS lead HARRY and his camel through the rain swept alleyways.\nEXT. LOCAL HOTEL/ SUAKIN/ SUDAN - night.\nHARRY lies shivering on a bunk bed, overwhelmed by fever. An ARAB DOCTOR treats his ravaged skin with balm. Behind them the BEGGAR BOYS argue with the ARAB HOTELIER, demanding more money for bringing the foreigner here. \nARAB DOCTOR\nEnglish?\nHARRY shakes his head no.\nEXT. marketplace/ STREETS OF SUAKIN/ SUDAN - day.\nSunlight dries out the previous night's storm. HARRY wanders through the marketplace, wearing long Bedu robes now, limping from his desert ordeal. PASSERSBY pull away as they see his face, mistaking the open blisters for leprosy. \nEXT. RIVERBANK NEAR THE BRITISH CAMP/ SUAKIN/ SUDAN - day.\nA crocodile rears out of the water and tears a lump of meat off a hook. It disappears back under the surface, avoiding the trap. There's a cry of disappointment from the riverbank. A group of LOCAL CHILDREN are trying to catch the beast. TRENCH is their leader. CASTELTON smiles at his friend's antics.\ntreNCH\n...Don't give up lads. Give the old porker another whack.\nThe BOYS have tied a pig to a stake, outside the water. They beat it with a paddle until it whines. Hearing the noise, the CROCODILE rears its head, and sweeps towards the remaining lump of meat on the hook. \nTRENCH and the BOYS swarm around the river expectantly. In their excitement they fail to notice the shrouded FIGURE watching them from the distance. It's HARRY, hidden beneath his Bedu robes. He gazes at his two friends longingly. Finally one of the BOYS sees him, and thinking he's a leper, starts throwing stones:\nsudanese boy\nImshi, imshi.\nThe other BOYS join in, yelling insults. TRENCH and CASTELTON pay no attention. They have no idea who it is. \nHARRY steps back slowly, the pebbles landing at his feet, still gazing at his friends. He knows he doesn't have the courage to face them yet, that it's too soon.\nINT. HAMILTON's TENT/ BRITISH CAMP/ SUAKIN/ SUDAN - night.\nColonel Hamilton's tent is lit in torchlight. Dozens of OFFICERS mill about, celebrating their orders to march on Khartoum. \nA MAJOR FROM ANOTHER REGIMENT\n...It's hard to imagine anyone changing the Prime Minister's mind.\nCOLONEL HAMILTON\nEven he reads the papers. They told him if he didn't send us to Khartoum he'd be indicted for murder...\nThere's laughter all around. Across the tent, DURRANCE stands on his own, feeling out of place. WILLOUGHBY arrives with two drinks.\nwILLOUGHBY\nYou're quite the hero tonight.\nDURRANCE\nThe Colonel seems to be taking a fair bit of credit.\nThey smile as they watch COLONEL HAMILTON holding forth.\nwILLOUGHBY\nSo you had a good time in London?\nDURRANCE\nBetter than I thought.\nwILLOUGHBY\n(Trying to make it sound casual)\nDid you look up Harry?\nDURRANCE\n(Hesitating)\nNobody knows where he is.\nwILLOUGHBY\nNot even Ethne?\nDURRANCE\n(A little put out)\nWhy should she? She's broken off their engagement.\nWILLOUGHBY notices the edge in his voice but doesn't say anything. DURRANCE feels a touch of guilt, surprised by his own jealous reaction. \nINT. HARRY's ROOM/ LOCAL HOTEL/ SUAKIN/ SUDAN - night.\nHARRY studies his face in the mirror: his blisters have dried into tough leathery skin, his eyes are hollow from recent hardships. He whispers to himself in broken Arabic, and dips his fingers into a dark, mud like substance. He applies it to his hair, his beard, and his teeth.\nEXT. COOLIES/ BRITISH CAMP/ SUAKIN - day.\nLong lines of DESERT AFRICANS have gathered outside the British camp, looking for work as coolies. There are Nuers, Dinkas, Somalis, Ethiopians, all of them wearing different clothes, and speaking different languages. Somewhere amongst them, we see HARRY, disguised in his Bedu robes. He's being examined by a BRITISH SEARGENT-MAJOR and an EGYPTIAN ORDERLY.\nBRITISH SEARGENT-MAJOR\nTell him to remove his shirt.\nHARRY waits for the ORDERLY to translate before he opens his robes. His body is lean and tanned and scarred.\nBRITISH SEARGENT-MAJOR\n(Impressed by his physique)\nThis one's been in the wars. Let me see his teeth.\nAgain HARRY waits for the Arabic translation before he opens his mouth.\nBRITISH SEARGENT-MAJOR\nGood bones. Put him on the boats.\nHARRY is ushered off. As he walks away he hears an argument start up behind him. The EGYPTIAN ORDERLY is protesting to the SEARGENT MAJOR about hiring a fierce looking NUBIAN warrior.\nEGYPTIAN ORDERLY\n...This man comes from a race of slaves. They have blood feuds with everyone. If you arm him it will mean trouble. None of the Egyptian soldiers will serve with him.\nThe NUBIAN stares ahead in silence, expressionless.\nBRITISH OFFICER\nAlright, put him on the boats.\nThe NUBIAN falls into line, behind HARRY.\nEXT. DRILL AREA/ BRITISH CAMP/ SUAKIN - day.\nWILLOUGHBY barks orders at the EGYPTIAN RESERVES, drilling them before departure. DURRANCE, TRENCH, AND CASTELTON walk out of their tent, imitating him.\nEXT. COOLIES/ BRITISH CAMP/ SUAKIN - day.\nHARRY watches his friends from afar. He sits amongst the COOLIES, holding out his soup bowl, waiting to be fed. The NUBIAN squats opposite him. HARRY can't help staring at the long white ostrich feather in his hair. \nThe EGYPTIAN ORDERLY arrives and pours a rancid looking gruel in HARRY's bowl. He turns to the NUBIAN.\nEGYPTIAN ORDERLY\n(In Arabic)\nIs this good enough for you slave?\nThe NUBIAN ignores him. The ORDERLY spits in the gruel before handing it to him.  The NUBIAN takes it, and calmly downs it in one. The ORDERLY moves on in disgust. The NUBIAN looks at HARRY. HARRY braces himself and swallows the stew. \nEXT. CATARACTS of the nile/ sudan - day.\nA heavy current rushes through the waters of the Nile. The cataracts are full of treachorous rocks, jutting out in all shapes and sizes. HARRY is force-marched with the other COOLIES, prodded on by the EGYPTIAN OVERSEERS. They drag the British supply boats through the cataract by hand, pulling on huge hemp ropes. \nIn front of HARRY, the NUBIAN is being singled out for punishment. The EGYPTIAN ORDERLY lashes him repeatedly. The NUBIAN keeps pulling, ignoring the stinging pain. He looks back at the ORDERLY as if to say; \"Is that all you've got?\"\nEXT. SUPPLY BOAT/ CATARACTS of the nile/ sudan - day.\nA supply boat rushes down a steep incline in the river.  TRENCH yells at the top of his voice as the spray hits his face. CASTELTON stands beside him, staring at the banks of the Nile, watching the hundreds of COOLIES, dragging their boat through the cataracts.\nEXT. COOLIE CAMP/ CATARACTS of the nile/ sudan - night.\nDrum beats fill the night sky. The reflection of the coolies' camp-fires glistens over the black water. Some are singing, others praying, but most lie fast asleep. HARRY sits on his own, warming himself by a fire, his body wracked with pain. As he reflects he hears the gentle tread of feet. He looks up to see the NUBIAN staring at him. The man squats down beside his campfire without asking.\nnubian (Abou fatma)\n(In English)\nMy name is Abou Fatma.\nhaRRY\n(Shaking his head as if he doesn't understand)\nBedu.\nABOU FATMA\nI was a scout for General Hicks.\nharry\nArabi --\nABU FATMA suddenly launches into a flurry of fluent Arabic. HARRY stares at him in silence, unable to respond.\nABOU FATMA\nThere are many in this camp who would serve the Mahdi. When they find out there is a British spy amongst them, watching them, they will kill him. \n(Quietly mocking)\nIt won't be long, Bedu.\nHe turns to leave. HARRY hesitates, then:\nharry\nShoukran.\nABOU FATMA\n(Correcting his Arabic)\nShoukhran.\nTheir eyes stay on each other a moment.\nharry\n(Finally speaking in English)\nWhy do you warn me?\nABOU FATMA\nFor money.\nharry\nI can't pay you.\nABOU FATMA\nI can't help you.\nHARRY smiles. He gazes at the mercenaries's powerful features, and the long white feather in his hair.\nharrY \nWhat's the feather for?\nABOU FATMA\nThe first time I killed a man.\n(Pointing to a feather earring in his left ear)\nFive men.\n(and an ivory bracelet on his wrist)\nTen men.\n(He takes a beaded necklace out of his pocket)\nThis I will wear soon. I'm a good soldier. I will protect you.\nHARRY stares at him a moment, then takes out a small box from his pocket. He shows ABOU FATMA the four white feathers inside. ABOU FATMA looks at them, unaware of the irony in Harry's gesture, thinking he's saying he doesn't need help. \nABOU FATMA\n(Gesturing to the welts on Harry's body)\nUnderneath the flesh is white, and weak. Even if the Mahdi's men don't find you out, the whips will.\nharry\nI'll pay you one shilling a day.\nABOU FATMA\nNo.\nABOU FATMA gets up, and walks away. HARRY can't help smiling as he stares after him.\nEXT. COOLIE CAMP/ CATARACTS of the nile/ sudan - day.\nScreams of agony fill the air. The EGYPTIAN ORDERLY lies in a pool of blood, his belly sliced open, holding his guts in his hands. \nHARRY stands amongst the gathered crowd, watching horrified, as a BRITISH OFFICER kneels beside the dying man.\nBRITISH OFFICER\nWho did this to you? Who did this?\nThe EGYPTIAN ORDERLY tries to speak, but all that comes out of his mouth is a froth of blood. His tongue has been cut out. HARRY looks around the crowd until he sees ABOU FATMA. The Nubian's eyes are expressionless. Around his neck he wears the beaded necklace now. \nEXT. CATARACTS of the nile/ sudan - day.\nThe white sails of the British supply boats float through the hazy water. On the riverbank HARRY and the hundreds of other COOLIES drag them along. The OVERSEERS glance at ABOU FATMA warily, but none of them dare raise a whip to him now.\nINT. DURRANCE's tent/ BRITISH CAMP/ CATARACTS - day.\nWe can still hear the noise of the coolies outside. DURRANCE sits at a table, writing a letter. We glimpse the words: 'Dearest Ethne...' He stops as he hears a commotion outside.\nEXT. BRITISH CAMP/ CATARACTS - day.\nDURRANCE walks out of the tent. In the distance he sees a handful of ragged looking BRITISH OFFICERS being helped off their camels. As he stares more closely DURRANCE notices that many of them have terrible wounds. Those that can still walk are lead off to the commander's tent.\nEXT. general wolsey's tent/ BRITISH CAMP/ CATARACTS - day.\nGENERAL WOLSEY and COLONEL HAMILTON are bent over a map of the Nile, discussing their progress with their AIDE-DE-CAMPS. WILLOUGHBY looks up as he hears the WOUNDED OFFICERS being led into the tent. He stops as he sees the terrible state they're in. Even WOLSEY and HAMILTON look shocked.\nGENERAL WOLSELEY\n(Slowly rising, saluting)\nWhat is it?\nWOUNDED CAPTAIN\nA letter, sir... from General Gordon.\nWILLOUGHBY notices one of the WOUNDED OFFICERS has tears in his eyes.\nGENERAL WOLSELEY\nWhat happened to you?\nWOUNDED CAPTAIN\nWe were ambushed, Sir. More than half our company were killed.\nGENERAL WOLSELEY\nSee that these men are tended to. \nAIDE-DE-CAMP\nYes, sir.\nThe WOUNDED OFFICERS are led out. WILLOUGHBY, like all the other Aide-de-Camps, looks dazed. GENERAL WOLSEY opens General Gordon's letter, and reads in silence. \nGENERAL WOLSELEY\n(Finally looking up at Colonel Hamilton)\nGordon says he can only hold out for forty more days. It took eleven for these men to get here.\nEXT. BRITISH CAMP/ CATARACTS - night.\nDURRANCE, WILLOUGHBY, CASTELTON, and TRENCH sit around a camp fire, trying to ignore the hideous cries of the wounded British soldiers coming from the hospital tent.\nwILLOUGHBY\n(Recounting what he's heard)\n...Wolsey's going to split the force. A River Column's going to continue down the Nile, whilst a Desert Column joins up with regiment at Abou Clea, and makes a dash for Khartoum. \nThe piercing screams start up again.\ntrench\nDon't tell me, we've drawn the short straw.\nEXT. BRITISH CAMP/ CATARACTS - day.\nSilence hangs over the British camp. The COOLIES are lined up under the scorching sun. The EGYPTIAN OVERSEERS walk past them, selecting some for the desert march, others for the river march. HARRY stands next to ABOU FATMA. Across the camp he can see DURRANCE, TRENCH, CASTELTON, and WILLOUGHBY, preparing their camels for the overland trek.\nhaRRY\n(Whispering to Abou Fatma)\nI need to travel with the desert detachment.\nABOU FATMA\nTwo Shillings.\nHARRY nods. The EGYPTIAN OVERSEER finally reaches them.\nEGYPTIAN OVERSEER\n(To Abou Fatma, in Arabic)\nWe'll keep you on the river.\nABOU FATMA\n(A calm, menacing look in his eyes)\nWith you?\nThe EGYPTIAN OVERSEER hesitates, remembering what happened to his friend:\nEGYPTIAN OVERSEER\n(Gesturing to the desert column instead)\nOver there.\nHARRY falls into line behind ABOU FATMA. The EGYPTIAN OVERSEER doesn't seem to care. He's too relieved to be rid of the Nubian.\nEXT. DESERT COLUMN/ BRITISH CAMP/ CATARACTS - day.\nThe Desert Column has assembled, fourteen hundred strong. \nSERGEANt at arms\nColumn... FOR-WARD... march!\nDURRANCE, TRENCH, CASTELTON, and WILLOUGHBY, ride off at the head of the column.  Behind them, the COOLIES carry heavy loads, HARRY and ABOU FATMA bringing up the rear.\nEXT. DESERT lanscape/ sudan - day.\nA region of jutting cliffs and giant rock formations. The Desert column rides through a narrow pass. DURRANCE's eyes are fixed on the ridges above them, any one of which could be hiding a Dervish sniper or scout. \nAt the back of the column, HARRY's equally alert. He looks across the cliff walls. Suddenly he notices one of the COOLIES in front of him, listening intently to a high pitched whine coming from a nearby gorge.\nHARRY studies the man. He's a powerfully built NUER TRIBESMAN, yellow streaks running down his long black hair. Every time he hears the distinctive noise, he looks up, concentrating. HARRY edges closer to ABOU FATMA:\nharry\n(Indicating the whining)\nDo you recognise that sound?\nABOU FATMA\nMountain goats.\nHARRY doesn't look convinced. He stares at the NUER TRIBESMAN, walking ahead of them, glancing up from his heavy load every time he hears the distinctive cry.\nEXT. OPEN DESERT/ sudan - day.\nThe wind blows gusts of sand into the camels' eyes. DURRANCE  stares through the shimmering heatwaves.\nDURRANCE\nThere's a sandstorm coming.\nCOLONEL HAMILTON looks at the clear blue sky, seeing nothing to indicate a storm, but trusting Durrance's instincts.\nEXT. DESERT CAMP - night.\nHARRY and the other COOLIES gather sticks and desert shrubs, building a makeshift wall around the camp. The wind has picked up, blowing thick gusts of sand in their faces. As they work in the darkness and the dust, HARRY hears the whining sound he heard earlier. It's quieter now, but closer. ABOU FATMA hears it too. \nharry\nIt's coming from inside the camp.\nThey look around, but the dust obscures everything. The whining starts up again. HARRY concentrates until he thinks he knows where it's coming from. He checks to make sure the ORDERLIES aren't watching them, and then signals for ABOU FATMA to follow him. \nEXT. EDGE OF THE DESERT CAMP - night.\nThrough the drifting clouds of sand we see a FIGURE crouching near the camp perimeter. It's the NUER TRIBESMAN Harry noticed earlier. Every time the wind picks up he calls out to the surrounding cliffs in a high piched whine.\nHARRY and ABOU FATMA watch him from behind a wagon. ABOU FATMA draws a knife from his boot.\nhaRRY\nWe need to find out who he's signalling.\nABOU FATMA replaces the knife reluctantly, and points to a makeshift corrall where the camels are gathered. \nINT. TENT/ DESERT CAMP - night.\nThe tent flaps blow in the storm. TRENCH, CASTELTON, and WILLOUGHBY shelter inside, sharing a bottle of whisky. DURRANCE sits apart from the others, reading a letter.\ntreNCH\nIs that the same letter you read over and over again, or do you get a different one each day?\nDURRANCE\n(He can't help a smile)\nIt's the same one, but it's twenty pages long.\nwILLOUGHBY\nHe writes them to himself. Go on Jack, read us a line.\nDURRANCE\nRead your own.\ntrench\nDon't be so coy, you're amongst friends.\nGrins all around. DURRANCE looks at letter and tempts them with a single line:\nDURRANCE\n\"...I often think about our walks by the river...\"\nHe stops enigmatically to a chorus of protest:\ntRENCH\nMore, more...\nDURRANCE hesitates, reluctant to break the confidence of a letter, but anxious to broach the subject with his friends.\nDURRANCE\n(Reading more quietly)\n\"...Your letter surprised and delighted me...If I appear indecisive it's because I'm thinking of both of us...In the meantime I hope the length of my reply gives you some assurance of how very much I care about you...\"\nDURRANCE lowers the letter and looks at his friends.\ntreNCH\nSo who's the lucky lady?\nDURRANCE\n(After a moment)\nEthne...I've asked her to marry me...You probably gathered that from the letter.\nThere's a long silence. Astonishment. Then suddenly TRENCH raises his glass and roars. \ntreNCH\nCongratulations.\nwILLOUGHBY\nThat's fantastic Jack. \nDURRANCE\nShe hasn't said yes.\ntrench\nOf course she will: \"I hope the length of  this reply gives you some idea of how much I bloody love you.\"\nDURRANCE\n\"How much I care about you.\"\ntreNCH\nSame thing.\nTRENCH fills his glass to the brim. DURRANCE laughs, relieved that his friends have taken it so well. It's only as he drinks that he catches a hint of disapproval in CASTELTON's eyes. CASTELTON raises his glass, trying to hide his feelings, but DURRANCE sees through him. The moment is interrupted by loud shouting outside:\nBRITISH CORPORAL o/s\n...Something's up with the camels.\nCASTELTON\nI'll go.\nCASTELTON looks relieved to leave the tent, worried that his conflicting emotions will betray him. DURRANCE stares after him, not entirely free of the memory of Harry himself.\nEXT. DESERT CAMP - night.\nCASTELTON follows the CORPORAL through the windswept camp. Up ahead they can hear the camels screeching. CASTELTON covers his eyes from the dust. Suddenly he sees the silhouettes of two RIDERS, charging out of the corral. One of them stops and stares at him momentarily.\nCASTELTON\n(He can't see the man's face clearly, but his outline seems hauntingly familiar)\nHarry?\nThe RIDER turns and charges out of the camp. The CORPORAL blows a whistle, reaching for his gun, firing after them. CASTELTON stares at the disappearing figures, wondering if what he saw was real, or a figment of his troubled conscience. \nEXT. HILLS ABOVE THE DESERT CAMP - night.\nHARRY and ABOU FATMA ride up a steep hill, shots ringing out behind them. \nEXT. RIDGE ABOVE THE DESERT CAMP - night.\nAs the sands sweep past we see the Mahdi's scouts for the first time: four NUER TRIBESMEN, standing on a ridge, looking down on the British campfires below. As they hear the shots, they turn away from the cliffside, and mount their camels.\nEXT. VIEW FROM A CLIFF/ DESERT - day.\nThe sand storm is still blowing, obscuring the sun. In the distance, the tiny figures of the NUER SCOUTS, can be seen riding across the arid sandscape. HARRY and ABOU FATMA watch them from the cliffs, and set off in pursuit.\nEXT. ridge/ VIEW on NUER's campfire/ DESERT - night.\nThe Nuer's camp-fire glows far below on the valley floor. HARRY and ABOU FATMA have built their own fire in a crevice on the cliff wall, hidden from view. HARRY's eyes are fixed on the Nuer scouts, ABOU FATMA's are fixed on him. \nABOU FATMA\nWhy would a British spy be hiding from his own people?\nHARRY looks up at the Nubian, realising he can't keep up the pretence any longer.\nhARRY\nBecause I'm not a spy.\nABOU FATMA\nYou're a deserter?\nharry\n(A long pause)\nSomething like that. I was sent to fight, and I ran away.\nABOU FATMA considers this for a moment.\nABOU FATMA\nAll soldiers run away. Only the good ones return.\nHARRY smiles.\nharry\nShoukran.\nABOU FATMA\nShoukhran.\nHARRY looks away. Down below the Nuer's camp fire goes out.\nEXT. OPEN DESERT - night.\nThe moonlight colors the dunes in blues and greens. HARRY and ABOU FATMA follow the Nuers' tracks through the virgin sands.\nEXT. crest of A hill/ OPEN DESERT - day.\nThe sunrise casts a blood red light over the horizon. The four NUER SCOUTS appear on the crest of a hill. We see them clearly now, their long black hair streaked yellow, their faces painted ghostly white. They survey the land beneath them and gallop off. \nEXT. THE same HILL/ desert - day.\nABOU FATMA and HARRY walk their camels quietly up the hill, following the Nuers' hoofprints. As they reach the top of the dune a vast plateau opens up beneath them. They see the NUER SCOUTS, riding along a winding trade route. At the end of the desert road stands a huge fortress.\nABOU FATMA\nThat is Abou Clea. A British fort.\nHARRY stares after the Nuer scouts, wondering why they're heading back into a British stronghold. The four riders merge into one of the caravans that dot the landscape.\nEXT. CARAVAN/ TRADE ROUTE TO ABOU CLEA - day.\nA long line of DINKA REFUGEES walk alongside one of caravans, begging for food. HARRY and ABOU FATMA ride near the back, their faces hidden by their Djellabas. \nEXT. FORTRESS OF ABOU CLEA - night.\nA village of tents has spread around the fortress walls. More STARVING REFUGEES clamour at the gates. HARRY gazes up at the garrison walls. BRITISH SENTRIES can be glimpsed high up. The fortress gates creak open to let the caravan through. HARRY lowers his eyes as he rides past the guards.\nEXT. courtyard/ FORTRESS OF ABOU CLEA - night.\nAs he looks up again, HARRY suddenly feels a rush of panic. The fortress courtyard is filled with DERVISH WARRIORS. There are no British faces anywhere. HARRY glimpses a familiar red uniform, but as he stares more closely, his relief turns to horror. The British uniform is stained with blood. Wearing it is a fierce looking DERVISH WARRIOR with long braided hair. \nHARRY looks back at the ramparts. All the soldiers he thought were British sentries are in fact Dervish warriors, wearing the bloody uniforms of their victims. As he turns around, HARRY sees the worst sight of all. Hanging from scaffolds, are the chalk white bodies of the real British soldiers. \nHARRY is shaken out of his horror by a sharp hissing sound. ABOU FATMA glares at him to keep calm. DERVISH WARRIORS grab hold of their camels, and lead them with the rest of the caravan towards the stables. \nINT. stables/ FORTRESS OF ABOU CLEA - night.\nHARRY and ABOU FATMA tether their camels. Behind them the DERVISH WARRIORS unload the caravan's shipment of rifles.\nABOU FATMA\n(Whispering to Harry)\nFollow me out. \nHARRY nods, still in shock. ABOU FATMA turns around and heads out of the stables, unchallenged.\nEXT. courtyard/ FORTRESS OF ABOU CLEA - night.\nHARRY follows ABOU FATMA through the crowded courtyard. His eyes are drawn to the torchlit faces all around him. The Mahdi's army is made up of dozens of different tribes: some in glowing war paint, others marked with ritual scars, wearing the dried viscera of their victims around their necks. The Dervishes' eyes seem to follow HARRY wherever he goes, staring out at him through their slit Djellabas. Suddenly HARRY feels a pair of hands grab him. He wheels around to see a huge DERVISH CAPTAIN towering over him. \nDERVISH CAPTAIN\n(In Arabic, studying Harry's features)\nCome with me.\nABOU FATMA\n(In Arabic)\nOur caravan is waiting outside.\nDERVISH CAPTAIN\n(Waving Abou Fatma away)\nImshi!\nABOU FATMA murmurs something to HARRY in his native Nubian tongue, slipping in the English words: 'I'll find you.' \nDERVISH CAPTAIN\n(To Harry, in Arabic)\nFollow me!\nEXT. gallows/ courtyard/ FORTRESS OF ABOU CLEA - night.\nHARRY's heart is pounding as he walks back through the hellish courtyard. He isn't sure if the DERVISH CAPTAIN has realised he's British. It's only as he points HARRY towards the gallows that he realises the predicament he's in.\nDERVISH CAPTAIN\n(In Arabic; gesturing to a mound of British dead)\nOver there.\nHARRY hesitates, then walks over to the pile of British corpses, convinced he's going to be shot amongst them. \nDERVISH CAPTAIN\n(In Arabic; gesturing to the uniforms)\nFind one that fits.\nHARRY stares at him, then slowly begins to understand. He's been picked out as a pale looking Arab, one that might pass as a British officer from a distance. As he looks around he sees other DESERT ARABS, grinning at him, wearing their own blood stained British uniforms.\nHARRY kneels beside the slaughtered British soldiers. One of them still has his pipe stuffed between his teeth. As HARRY stares at the obscenity, his fear slowly turns to anger. With trembling fingers he unbuttons the dead man's jacket. As he slips the bloodstained British uniform over his shoulders we begin to see the change in his eyes.\nEXT. ABOU FATMA/ courtyard/ FORTRESS OF ABOU CLEA - night.\nABOU FATMA wanders amongst the Dervish army, begging for alms, searching for Harry. Finally he spots him at the far end of the courtyard, sitting amongst the other DERVISH WARRIORS IN BRITISH UNIFORMS.\nEXT. HARRY/ courtyard/ FORTRESS OF ABOU CLEA - night.\nABOU FATMA grovels at the feet of the DERVISHES, before he approaches HARRY.\nABOU FATMA\n(In Arabic)\nAlms for the poor. \nHARRY turns around. His eyes are distant. He looks back at the spot he was staring at before. At first ABOU FATMA thinks he's in shock, but then he sees what HARRY's looking at. Across the courtyard stands a large tent, surrounded by flags. Waiting outside, are the four NUER SCOUTS.\nABOU FATMA\n(Beginning to see his intent)\nWe have to leave.\nharry\nWait for me at the gates.\n(As Abou Fatma starts to protest)\nImshi.\nThe other DERVISHES look at ABOU FATMA threateningly. ABOU FATMA gets up and walks away reluctantly. Across the courtyard, the NUER SPIES have been ushered into the tent.\nINT. WAR COUNCIL tent/ FORTRESS OF ABOU CLEA - night.\nThe MAHDI, a tall, gaunt, warrior in desert robes, listens to the NUER SCOUTS in silence. As they notify him of the British advance, he starts to draw a battle plan on the tent's sandy floor. His LIEUTENANTS move closer to see what he's planning.\nINT. WAR COUNCIL tent/ FORTRESS OF ABOU CLEA - night.\nOutside the tent more DERVISH WARRIORS have gathered to catch a glimpse of their revered leader. HARRY is amongst them. He stares at the white clad figures within. Suddenly he feels a pair of eyes on him. He turns to see the DERVISH CAPTAIN who stopped him earlier, watching him intently. HARRY moves off. The DERVISH CAPTAIN stares after him suspiciously. \nEXT. gates/ FORTRESS OF ABOU CLEA - night.\nABOU FATMA waits anxiously outside the fortress gates. The hordes of STARVING BEGGARS are pushed back as a troop of DERVISH WARRIORS ride out, carrying the naked bodies of the British dead. ABOU FATMA stares after them, wondering what's going on.\nEXT. HARRY/ courtyard/ FORTRESS OF ABOU CLEA - night.\nHARRY looks behind him. Through the milling crowd he sees the DERVISH CAPTAIN, still following him. His heart pounding, HARRY heads towards the stables, trying to give him the slip.\nEXT. HARRY/ STABLES/ FORTRESS OF ABOU CLEA - night.\nCamels kick and snort in the stable. HARRY crouches down. Through the animals' legs he sees the DERVISH CAPTAIN enter.\nSuddenly the DERVISH CAPTAIN shouts at the top of his voice. The camels scatter, leaving HARRY exposed. The DERVISH CAPTAIN stares at him menacingly.\nHARRY bows, and starts to walk towards him, in supplication. His hand slips behind his back, groping for the knife that's hidden there.\nThe DERVISH CAPTAIN barks at him to stay where he is. As he steps backwards, HARRY suddenly charges, and drives the dagger deep into his gut. The DERVISH CAPTAIN screams, but all that comes out is a terrible hissing sound. \nHARRY clamps his hand over the CAPTAIN's mouth and bends his head backwards. As they tumble to the ground, HARRY twists the knife in deeper. The Dervish bites down in agony, drawing a stream of blood from Harry's knuckles. HARRY rams his fist deeper into the man's throat, choking him slowly. Meanwhile his knife hand tears its way out of the Dervish's gut, and plunges back into his thigh.\nThe CAPTAIN's eyes water in pain and fear. HARRY stares at him, crushing his spirit with his own unflinching gaze. As he feels the man's grip weaken, he pulls away sharply, and swings the knife down with all his force. The blade sticks in the DERVISH CAPTAIN's chest, sending his eyes spinning out of focus, forcing a rush of blood out of his mouth.\nHARRY watches in horror, as the man's eyes roll around, desperately trying to find their focus, then stop still. He feels his enemy's dying breath on his face, and hears a horrible sucking sound, as he withdraws the knife. \nHARRY's arm is elbow deep in gore. He turns away and tries to retch, but nothing comes out. He stays like that for a moment, bent over the bloody sand, contemplating what he's just done. Finally he gathers himself, grabs the dead man by the ankles, and drags him further into the stable.\nEXT. courtyard/ FORTRESS OF ABOU CLEA - night.\nHARRY brushes past the crowds of DERVISH WARRIORS, his eyes fixed on the fortress gates ahead. He's only a few yards away, when a DERVISH SENTRY calls out:\nDERVISH SENTRY\n(In Arabic)\nThe gates are closed.\nHARRY stares at him dangerously. For an instant it looks like another fight may ensue, but then a calming voice calls out:\nABOU FATMA\n(In Arabic)\nLet him give us alms. It will bring you both fortune in battle.\nABOU FATMA sticks his hands through the fortress gates, along with the hundreds of other BEGGARS outside. HARRY begins to understand. He pulls out some coins from his robes, and approaches the BEGGARS. \nharry\n(Whispering to Abou Fatma, as he hands out alms)\nGo to the British camp. Tell them they're going to be ambushed. Tell them they have to change their route. It's a trap...\nABOU FATMA stares into HARRY's eyes, seeing the change that's come over them.\nEXT. BRITISH COLUMN/ DESERT VALLEY - day.\nDURRANCE rides at the front of the column. He suddenly stops, and stares ahead in horror. All across the desert floor he sees the marble white bodies of dead British soldiers. Wild dogs chew at their remains. The whole of the column seems frozen for a moment. Then TRENCH suddenly breaks rank, and charges the animals, screaming at the top of his voice, dispersing them with his whip.\nEXT. tents/ THE SLOPE OF A HILL/ DESERT VALLEY - day.\nThe column has set up camp until their dead comrades are buried. The OFFICERS dig the graves themselves, watched by the COOLIES now. A CORPORAL approaches WILLOUGHBY and salutes.\nCORPORAL\nA native to see you, sir. He says he has some intelligence regarding the route we're on.\nABOU FATMA is pushed forward by the EGYPTIAN SOLDIERS.\nwILLOUGHBY\n(Eyeing him suspiciously)\nWhat intelligence?\nABOU FATMA\nYou must leave this area. \nThe EGYPTIAN silences him with a slap to the head.\nEGYPTIAN CORPORAL\nThis man is lying. He's a deserter. He stole the camels --\nABOU FATMA\n-- I went to Abu Klea. The Mahdi's forces have captured your garrison. They will attack you in this place.\nTRENCH and DURRANCE have arrived to see what's happening. TRENCH stares at ABOU FATMA menacingly, still seething over the treatment of the British dead. \nwILLOUGHBY\n(To Trench and Durrance)\nThis is their idea of misinformation.\n(Toying with Abou Fatma)\nWho told you this?\nABOU FATMA\nA British Officer.\nwILLOUGHBY\n(Mockingly)\nA General no doubt.  What else did he tell you?\nABOU FATMA\n(With equal disdain)\nThat you wouldn't believe me.\nWILLOUGHBY smiles at the Nubian's gall, but TRENCH explodes at his insolence.\ntrench\n(Grabbing Abou Fatma by the neck)\nI'll show you a British Officer...\n(Forcing him on his knees in front of one of the butchered corpses)\nThis is a British Officer!...\n(Rubbing Abou Fatma's face into a patch of bloodstained sand)\nThis is a British officer's blood. Lick it up! Every bloody drop!...\nThe NUBIAN spins around, ready to strike. TRENCH draws his knife, daring him to make a move.\nABOU FATMA\n(Controlling his anger)\nThe Muslims bury their dead. Even the enemy dead. These bodies have been left here for a reason. To keep you here. To hold you up.\nwILLOUGHBY\n(Ignoring him)\nTake him away. Find out why he was sent here. Do whatever you have to do.\nThe SOLDIERS disperse. Only DURRANCE stays where he is, thinking about the Nubian's warning. \nEXT. courtyard/ FORTRESS OF ABOU CLEA - day.\nA chant of 'Allah Akbar' rises over the fortress walls. Hundreds of WARRIORS kneel and pray in unison. HARRY does the same.\nEXT. tent/ BRITISH CAMP/ DESERT VALLEY - day.\nABOU FATMA is on his knees, manacled to a tent pole. \nEGYPTIAN CORPORAL\n(In Arabic)\n...You work for the Mahdi!  \nABOU FATMA\n(In English)\nI fought the Mahdi...\nThe EGYPTIAN lashes him with a bull-whip.\nEGYPTIAN CORPORAL\n(In Arabic)\n...Who sent you?!\nABOU FATMA\nA British Officer.\nThe EGYPTIAN starts whipping Abou Fatma again, ready to kill him. DURRANCE finally intervenes.\nDURRANCE\nThat's enough...\nHe kneels down beside ABOU FATMA, staring into his eyes. ABOU FATMA sees no mercy in his gaze, but at least there's a glimmer of curiosity.\nDURRANCE\nWhy would you want to help us?\nABOU FATMA\nThe Mahdi is allied with slave traders...\n(pause)\nMy family were taken prisoners and sold as slaves.\nDURRANCE considers Abou Fatma's answer. There's something about it that has a ring of truth. DURRANCE glances at the BRITISH SOLDIERS, digging graves in the open desert, and then stares up at the surrounding hills. \nEXT. gates/ FORTRESS OF ABOU CLEA - night.\nThrough the clouds of dust we see the first of the Mahdi's army riding out -- ghostly DINKA WARRIORS, naked from head to foot, caked in white ash. Behind then come the NUERS, long streaked hair trailing in the wind, faces painted the colors of a nightmare. The HADENDOA spearmen follow, blood-stained feathers in their hair, banging on their calf skin drums. Last of all come the DERVISH RIDERS IN THEIR BLOODSTAINED BRITISH UNIFORMS. HARRY rides at the heart of the demonic troop, his eyes filled with dread.\nEXT. BRITISH CAMP/ DESERT VALLEY - day.\nDURRANCE surveys the surrounding hills. CASTELTON watches him curiously.\nCASTELTON\nWhat is it Jack?\nDURRANCE's eyes stare at the horizon, still not sure.\nEXT. HILLS beyond ABOU CLEA - day.\nAt a signal from the MAHDI, his army splits in two, some following the green flags, others the black. HARRY and the DERVISH RIDERS IN BRITISH UNIFORMS are told to wait.\nEXT. BRITISH CAMP/ DESERT VALLEY - day.\nWILLOUGHBY and TRENCH join CASTELTON and DURRANCE at the edge of the camp. DURRANCE is still staring at the ridges above them. As they listen, they can just make out a distant rumble of thunder. DURRANCE looks up. The sky is perfectly blue. \nDURRANCE\nWe'd better get the Gatling gun out.\nEXT. HILLS ABOVE THE BRITISH CAMP/ DESERT VALLEY - day.\nNUER SCOUTS, daubed in yellow camouflage, appear out of the rocks.\nINT. CASTELTON's TENT/ BRITISH CAMP/ DESERT VALLEY - day.\nCASTELTON walks into his tent and searches through his belongings. He finds one of his bibles, kisses it for luck, and slips it in his jacket pocket. As he turns around he sees TRENCH grinning at him.\ntrench\nYou haven't got a spare one have you vicar?\nEXT. SLOPE OF A HILL/ DESERT - day.\nThrough thick gusts of sand we see hundreds of bare feet and horses' hooves moving up the desert slope. The sand at their feet pours back down the slope like an avalanche.\nEXT. DURRANCE's POV/ CREST OF the HILL/ DESERT - day.\nAs DURRANCE gazes up, the first of the Mahdi's army appear on the crest of the hill, a handful of SCOUTS, riding back and forth, judging the British numbers. As the SCOUTS disappear, a curtain of dust rises up behind them. As it settles, DURRANCE sees thousands of figures appear along the length of the hill, their green banners fluttering in the wind.\nEXT. BRITISH CAMP/ DESERT VALLEY - day.\nAcross the camp, CASTELTON and TRENCH stare mesmerised, as another huge army appears on the opposite hill. This time their banners are black. Panicked voices ring out.\nofficers' voices\nForm a square...Form a square...\nEXT. CREST OF the HILL/ view of the british camp - day.\nThe Mahdi's armies stare down from the wind whipped slopes, thousands of expressionless faces, listening to the British bugles shrilling down below. From above we see the British fighting square taking shape: red and khaki colors separating into units, the bright blue of the Egyptian uniforms forming a larger wall around the perimeter.\nEXT. BRITISH CAMP/ DESERT VALLEY - day.\nThe GRENADIER GUARDS are crouched in formation, rifles ready. TRENCH changes position, asking one of the other SOLDIERS to swap with him, settling down next to CASTELTON.\ntrench\nYou can't get rid of me that easily.\nCASTELTON's fear seems to vanish in an instant. \nEXT. GREEN FLAGGED ARMY/ CREST OF the HILL - day.\nA cry of Allah Akbar is picked up by thousands all along the ridge, turning into a deafening roar as the Green flagged Army finally charges.\nEXT. BRITISH CAMP/ DESERT VALLEY - day.\nDURRANCE moves along the lines of RIFLEMEN, barking intructions over the wind.\nDURRANCE\nFire at the horses. Fire at will.\nA volley of shots answers his call.\nEXT. GREEN FLAGGED ARMY/ slope OF the HILL - day.\nEnemy horses and riders collapse, sliding down the slopes.\nEXT. DESERT VALLEY - day.\nThe British camp is shrouded in gunsmoke, flashes of orange light bursting through, the Gatling gun wreaking havoc.\nEXT. GREEN FLAGGED ARMY/ FOOT OF THE HILL - day.\nThrough the sand drifts, we see the camels' hooves rearing up, bursts of arterial blood as the bullets tear into their hide. The HADENDOA SPEARMEN leap over the walls of torn flesh, and charge the British lines in a suicidal frenzy.\nEXT. CASTELTON/ BRITISH CAMP/ DESERT VALLEY - day.\nCASTELTON aims at the PAINTED WARRIORS. Every time he fires, someone falls. Every time he kills, he murmurs a prayer. TRENCH bites his lip so hard, his mouth fills with blood. He spits it out as he drops yet another man.\nEXT. BLACK FLAGGED ARMY/ FOOT OF THE HILL - day.\nThe DERVISH HORDES keep coming, clambering over the bodies of their dead.\nEXT. HARRY/ ENTRANCE TO THE VALLEY - day.\nFar away, at the entrance to the valley, HARRY can hear the screams of the wounded and dying. Even the DERVISH WARRIORS seem apprehensive. Only the MAHDI is calm, waiting for his moment. He raises his hand, and signals for the horsemen in British uniforms to charge.\nEXT. DURRANCE/ BRITISH CAMP/ DESERT VALLEY - day.\nEnemy bullets crackle past DURRANCE's head, but he doesn't seem to notice. Through the smoke and dust he sees hundreds of enemy dead, lying in blood smeared heaps. The Dervish onslaught is less sustained now. The occasional STRAGGLER appears out of the haze and is blown away by a burst of gunfire. Suddenly DURRANCE hears the sound of a bugle.\nEXT. CASTELTON/ BRITISH CAMP/ DESERT VALLEY - day.\nCASTELTON and TRENCH hear the bugle too. They stop firing as they see the remnants of the black flagged army retreating into the hills. There's a moments confusion and then a roar of celebration around the camp as the SOLDIERS see a troop of BRITISH CAVALRY, riding out of the sand clouds towards them.\nEXT. HARRY/ DESERT VALLEY - day.\nHARRY stares in horror as he sees the BRITISH SOLDIERS, breaking rank, waving at the charging RIDERS, thinking they're British cavalry. HARRY kicks his horse and tries to weave his way out of the charging horde.\nEXT. BRITISH CAMP/ DESERT VALLEY - day.\nThe BRITISH SOLDIERS gather at the camp perimeter to welcome the approaching cavalry.  \nEXT. HARRY/ DESERT VALLEY - day.\nHARRY charges through the red uniformed Dervish ranks, ignoring orders to stay in line. At a signal from one of the DERVISH LIEUTENANTS, the horsemen raise their bows.\nEXT. DURRANCE/ BRITISH CAMP - day.\nDURRANCE stares curiously as a flicker of sunlight streaks across the heads of the distant riders. He watches the approaching dust cloud, wondering why it's coming at them so fast. Slowly he begins to make out the first figures. Something about them isn't right. Their uniforms hang too loosely. They ride too far apart. He reaches for his gun.\nEXT. HARRY/ DESERT VALLEY - day.\nHARRY breaks through the Dervish line. Behind him he hears the mounted ARCHERS stringing their bows. He drives his horse forwards, towards a lone BRITISH SOLDIER, standing on the camp perimeter.\nEXT. DURRANCE/ BRITISH CAMP - day.\nDURRANCE sees the lone rider, charging towards him, yelling at the top of his voice. He can't see the man's face or hear his voice, but he's convinced these riders are the enemy now.\nEXT. DURRANCE/ BRITISH CAMP - day.\nHARRY sees DURRANCE aiming his rifle, a moment too late. The gunshot sends his horse spinning to the ground. He feels the weight of the animal pin him down. As he looks up he sees the DERVISH RIDERS riding over him, letting their arrows fly.\nEXT. BRITISH CAMP - day.\nThe sky above flickers with light as the arrows catch the sun. The steel shafts hurtle down, plunging into exposed eyes and throats. All around him CASTELTON sees SOLDIERS totter and fall, arrows sticking out of them like quills. He pulls out his revolver and starts firing at the onrushing horses.\nEXT. DERVISH RIDERS/ PERIMETER OF BRITISH CAMP - day.\nThe DERVISH lances skewer the BRITISH SOLDIERS as they try to run back to their lines. Some of the DERVISH RIDERS dismount and finish them off with their daggers, and their bare hands.\nEXT. GREEN FLAGGED ARMY/ slope OF the HILL - day.\nOn the desert slopes, the retreating green flagged army wheels around and charges back into the fray.\nEXT. WILLOUGHBY/ BRITISH CAMP - day.\nWILLOUGHBY looks up, and sees the Mahdi's black flagged army, also swarming back towards the British ranks.\nEXT. HARRY/ PERIMETER OF BRITISH CAMP - day.\nHARRY is still pinned. He slits the dead horse's belly with his knife, and slides his leg under the gore. He gets to his feet and runs towards the fighting, desperate to reach his friends.\nEXT. DURRANCE/ BRITISH CAMP - day.\nDUURANCE yells at the top of his voice:\nDURRANCE\nClose the square! Close the square!\nCASTELTON and TRENCH fire at the charging horses. As they fall, the other GRENADIERS take courage, and rush at their RIDERS, bringing them down in a volley of gunfire. The SOLDIERS clamber over the dead bodies and link up with the rest of their Square.\nEXT. HARRY/ PERIMETER OF BRITISH CAMP - day.\nHARRY can't see the British square reshaping, but he can see its rippling effect all along the DERVISH line. He cuts his way through like a beserker. Whatever doubts and fears his civilized self felt his primitive self now rejects. He fights like a man possessed.\nEXT. grenadiers/ british square - day.\nThe BRITISH line pulls back, firing and reloading as it retreats.\nEXT. WILLOUGHBY/ PERIMETER OF BRITISH CAMP - day.\nWILLOUGHBY stares in horror at the bloodshed all around him. Through the hellish smoke he sees ABOU FATMA, still tied to the whipping post, staring at him in silent reproach.\nEXT. grenadiers/ british square - day.\nCASTELTON fires into the enemy ranks. He's out of ammunition. TRENCH is retreating with the other GRENADIERS. He sees his friend stalling and yells:\ntrench\nGet back! Get behind us!\nCASTELTON doesn't hear him. His parade ground training is taking over. He lowers the rifle and fixes a bayonet on it. \nEXT. HARRY/ AMONGST THE CHARGING DERVISHES - day.\nThrough the swarming ranks, HARRY glimpses CASTELTON, standing alone with his bayonet poised. He calls out as well.\nEXT. CASTELTON - day.\nCASTELTON hears nothing but the pounding of his own heart. The DERVISH WARRIORS swarm towards him. He disembowels the first WARRIOR, then swings his bayonet around to meet the next. The DERVISH impales himself, right up to his rib cage. CASTELTON tries to pull his blade free, but the bayonet is locked in bone now. \nEXT. TRENCH/ RETREATING grenadiers/ british square - day.\nTRENCH stares in horror as he realises what's happened. The noises around him seem to fade as he gazes at CASTELTON, straining as he did in the training ground, trying to pull the bayonet free.\nEXT. HARRY/ AMONGST THE CHARGING DERVISHES - day.\nHARRY runs as fast as he can, trampling over the dead soldiers and horses that litter the desert floor.\nEXT. CASTELTON/ ISOLATED FROM THE SQUARE - day.\nCASTELTON tries to loosen the blade, but it's no use. He looks up to see a storm of painted faces, rushing towards him, spears pointed at his eyes and guts. Somewhere amongst the screaming horde, he glimpses a familiar face, calling out. A smile flickers across his face. He mouths the words 'Harry' as the first of the Dervish spears sinks into his heart.\nEXT. TRENCH/ RETREATING grenadiers/ british square - day.\nTRENCH screams in agony as he sees CASTELTON disappear. He charges out of the retreating British line, swinging at everything in his way, breaking skulls and shattering bone. He's only yards away from CASTELTON when a blow to the back of the head sends him sprawling.\nEXT. DURRANCE/ RETREATING grenadiers/ british square - day.\nDURRANCE charges out of the British square as he sees his friends fall, firing round after round into the enemy ranks. Every time his gun empties, he picks up another from a dead soldier, and keeps going. \nEXT. HARRY/ AMONGST THE DERVISHES - day.\nHARRY drops to his knees, next to CASTELTON's body, protecting his friend's corpse from further abuse. \nEXT. TRENCH/ AMONGST THE DERVISHES - day.\nTRENCH stares up at the nightmare faces crowding all around him. The butt of a spear cracks open his head, reducing everything to a terrifying silence. He feels a sea of hands, reaching down, tearing his uniform, lifting him in the air. \nEXT. DURRANCE/ WALKING TOWARDS THE DERVISHES - day.\nDURRANCE charges towards the enemy, firing into their massed ranks, oblivious to any danger. One of his guns jams. DURRANCE keeps pressing the trigger. The gun suddenly backfires and blows up in his face.\nEXT. HARRY/ AMONGST THE DERVISHES - day.\nHARRY sees DURRANCE fall. He gets up and runs through the enemy ranks, pretending to be one of them. He leaps on DURRANCE as he tries to get up, pinning him to the ground, stopping him getting himself killed. The unsuspecting DERVISH WARRIORS sweep past them, towards their next victims.\nHARRY keeps DURRANCE pinned, until the enemy hordes disappear. Only then does he stand up. He looks down at his friend. DURRANCE doesn't seem to recognise him. At first HARRY thinks it's the sunlight blinding him, but then he sees the powder burns around DURRANCE's eyes. \nDURRANCE gropes around. He starts crawling away on his hand and knees. He crawls right into a mud bath of Dervish dead. He rears back in horror, and lets out a little cry of panic.\nHARRY slowly begins to understand. He watches in anguish, as his friend claws at his eyes, trying to rub the blindness out of them, his whimpers of panic turning into howls of agony.\nINT. BRITISH HOSPITAL SHIP/ ALEXANDRIA - day.\nThe screams of the wounded BRITISH SOLDIERS echo all around the hospital ship. CAPTAIN CALDER, the Regimental surgeon, stands over Durrance's bed. DURRANCE stares out, blindly.\nCAPTAIN CALDER\n...You ought to see a specialist once we're back.\nDURRANCE\nIs it part of your treatment to offer false hope?\nCAPTAIN CALDER\nOnly for some. \n(reaching in his pocket)\nThis came for you.\nHe hands over a letter. DURRANCE sticks it in his top pocket.\nDURRANCE\nI'll read it later.\n(Grinning as he realises Calder hasn't caught the joke)\nIf you wouldn't mind, Doctor...\nHe hands the letter back to CALDER to read for him.  \nCAPTAIN CALDER\n(Glancing over it)\n...\"Dear James, I hold in my heart all you have written me\"...\n(He looks up)\nI feel a little awkward reading this...\nDURRANCE\nDon't.\nThere's something strident in Durrance's voice, a brittleness that hides the insecurity inside. CALDER continues:\nCALDER\n...\"Knowing you as I do, and convinced as I am of your affections, I wish to go back on my previous fears. I'm writing now, to let you know how grateful I am to have you in my life -- and to say, with all my heart, how much I wish to be in yours...With all my love, Ethne.\"\nCALDER, lowers the letter, quietly moved.\nCAPTAIN CALDER\nCongratulations...\nDURRANCE stares out quietly.\nDURRANCE\nI knew a man once who went blind, a good man too, before...A year after you wouldn't have recognised him. He was the most selfish, exacting, egotistical human being you could ever meet. I wouldn't wish him on anyone...\nHe smiles ironically, hiding the heartbreak inside.\nDURRANCE\nThe one thing I want most in this life, finally comes to me when I can no longer accept it.\nINT. DRAWING ROOM/ CAROLINE's house/ OUTSIDE LONDON - day. \nETHNE stares out of the drawing room window, waiting. Her friend CAROLINE sits at a table, pretending to be absorbed in her book, listening just as intently. There's the jingle of a carriage outside.\nCAROLINE\nThat's him.\nETHNE\nIt isn't stopping.\nEXT. DURRANCE's carriage/ STREET/ caroline's house - day.\nDURRANCE stares ahead as the carriage passes Caroline's house.\nDURRANCE\n(To the Driver)\nDrive around once...Describe the entrance to me...\nINT. DRAWING ROOM/ caroline's house - day.\nETHNE turns away from the window.\nCAROLINE\nMaybe you should have gone to the station to meet him.\nETHNE\nHe might have thought I was going because I imagined he was helpless. I don't want him to feel like that.\nThere's a quiet resolve in Ethne's voice, as if she's been mulling over her future life with Durrance. The doorbell rings. \nETHNE\nThat must be him.\nCAROLINE gets up to answer the door. ETHNE walks to the window. Her movements are nervous, her eyes tense. The door finally opens. DURRANCE walks in, alone. As soon as ETHNE leaves the window he turns around and looks straight at her.\nETHNE\n(Startled)\nIt isn't true then, you can see...\nDURRANCE\n(Gently)\nIt's perfectly true. I can't see a thing.\nETHNE stops, feeling guilty.\nDURRANCE\nYou moved from the window, that's how I knew.\nETHNE\nI hardly made a noise.\nDURRANCE\nNo, but the window was open. The noise outside grew louder. \nShe tries to answer his smile.\nETHNE\nLet me get you some tea, and then we can talk.\nDURRANCE\n(Sensing her tension)\nYes, we have a lot to talk about.\nETHNE's hand trembles as she pours the tea. DURRANCE interprets every sound. She picks up the cup and walks over with a smile, holding it out for him.\nDURRANCE\nI hate to sound humble, but I don't trust myself with a cup of tea yet.\nETHNE feels stupid again. She sets the cup down on a table. \nDURRANCE\n(Gently)\nYou're not bound, you know.\nThere's a pause. ETHNE knows exactly what he means.\nETHNE\nBound by what?\nDURRANCE\nI wouldn't dream of holding you to your letter. Or a committment you made to a different man. \nETHNE stares at him in surprise, and then in quiet admiration.\nETHNE\nYou're not a different man.\nDURRANCE\nI don't say it begrudgingly. I'm not being particularly noble or heroic either. It's something I've thought about long and hard --\nETHNE\nJack --\nDURRANCE\n-- Please hear me out...\n(With difficulty)\nI'm thinking of myself as much as you. I have to learn to accept what's happened. I have to learn to respect the person I've become. The only way to do that is to start again.\nETHNE\nWhy does it have to be without me?\nHer words make him hesitate.\nDURRANCE\nBecause if I was with you, I'd spend every moment wondering how you really felt about me. \nETHNE\nIf you don't know how I feel about you, then that's a good reason to call off our wedding. Your blindness isn't.\nShe stares at him, determined. DURRANCE looks touched by her devotion, but still doesn't feel worthy of her love.\nDURRANCE\nIt has to be more than mere obligation Ethne, or even friendship. It has to be more than that...\nETHNE suddenly reaches out and touches his face. DURRANCE stops as he feels her fingers. He's lost for a moment, unsure of himself. ETHNE leans forward and kisses him, tenderly at first, but then more and more passionately, proving herself to him, proving herself to herself. DURRANCE kisses her back, close to tears.\nEXT. PATIO/ caroline's house -  DAY.          \nA sharp clatter of hooves. DURRANCE rides his horse with the help of a GROOM, his face fixed in concentration. ETHNE and CAROLINE watch him from the patio. \nETHNE\n(Gazing at him proudly)\nHe seems to need his eyes less and less each day. It's incredible. Nothing escapes him. Sometimes I think he reads me like a book.\nCAROLINE\nYou no longer have your face to screen your thoughts.\nETHNE doesn't notice the edge in her voice. She's lost in her own thoughts. DURRANCE climbs off his horse and strides towards them, looking pleased with himself. \nDURRANCE\n(Wrapping Ethne in his arms)\nYou smell wonderful.\nETHNE\nAnd you smell like a horse. Go wash.\nETHNE keeps smiling, even after DURRANCE has gone. CAROLINE watches her friend quietly, fighting the jealousy she feels within. A voice interrupts their separate thoughts:\nGARDENER o/s\n(Calling out)\n...Someone to see you Miss Eustace.\nETHNE looks up to see a UNIFORMED OFFICER, standing with the GARDENER, by the maze. She gets up curiously.\nEXT. garden/ maze/ caroline's house - day.\nAs ETHNE approaches the soldier she suddenly stops, recognising him. It's WILLOUGHBY. \nwILLOUGHBY\nI went all the way to Bintree to find you. Your father told me you were here. I'm sorry I came unannounced, I needed to talk to you alone... \nETHNE doesn't reply or return his smile. WILLOUGHBY seems to read her thoughts.\nwILLOUGHBY\nI understand how you feel, Ethne. All I can say is that we never set out to hurt you. What happened was between us and Harry, not the two of you.\nETHNE\n(Coldly)\nWhat do you want, Tom?\nWILLOUGHBY hesitates, bracing himself.\nwILLOUGHBY\n...I've seen Harry. In Suakin. He asked me to give you these...\nHe holds out TWO SOILED WHITE FEATHERS. ETHNE stares at them, unable to speak, her whole world turned upside down.\nwILLOUGHBY\nHe risked his life to save our regiment. He fought as if he'd been born to it.\nI've come to tell you I've withdrawn my accusation of cowardice against him, along with Castelton's.\nETHNE\n(All she cares about)\nIs Harry dead?\nwILLOUGHBY\nHe was fine when I saw him. He'd changed a great deal but he was in good health.\nETHNE\nChanged how?\nwILLOUGHBY\nI didn't spend much time with him. I don't know what else to tell you Ethne.\nETHNE\nTell me everything Tom. Please... \n(Imploringly)\nIf by your own admission you've hurt me, then I have a right to know.\nEXT. PATIO/ caroline'S house -  DAY.\nCAROLINE watches curiously from the patio, as ETHNE and the mysterious Officer, walk into the maze, deep in conversation.\nEXT. maze/ caroline's house - day.\nETHNE and WILLOUGHBY sit on a bench in the garden maze.\nwILLOUGHBY\n...Nothing prepared us for what happened. We were two miles short of Abou Klea when we were ambushed. We managed to hold off the enemy, but at a terrible cost. A few days later Khartoum fell and the whole expedition was called off...\nTIME DISSOLVE BACK TO:\nEXT. BRITISH EVACUATION CAMP - ON NILE - DAY.                     \nWOUNDED BRITISH SOLDIERS lie in the open sun, moaning in agony, plagued by clouds of dust and swarms of flies. WILLOUGHBY stares out, numb to their suffering, thinking only of his own lost friends. The SHADOW OF A MAN in Arab robes hovers over him.\nWILLOUGHBY\n...Get lost!...\nThe ARAB doesn't move.\nwILLOUGHBY\n(Looking up furiously)\nDidn't you bloody hear me! Get lost!...\nWILLOUGHBY suddenly stops. He stares at the Arab as if in a dream. \nwILLOUGHBY \n...Harry?...\nHARRY stares back at him through his black desert robes.\nHARRY\nI sent a man to you with a warning from Abou Klea. You wouldn't listen to him. You had him tortured instead.\nThe confusion and shock bring pent-up tears to WILLOUGHBY's eyes. \nHARRY\nHe told you a British Officer had sent him. Even if you didn't believe him, what would it have cost to take precautions. What more did I have to do?\nwILLOUGHBY\n(As the horror sinks in)\nI didn't know Harry...I didn't know it was you...\n(He still can't believe his eyes)\n...What are you doing here in God's name?...What are you doing?...\nHARRY opens his hand to reveal a soiled white feather. WILLOUGHBY stares at it, in bewilderment at first,then slowly beginning to understand.\nwILLOUGHBY\n(He gazes at the feather as if it's the symbol of his own disgrace now)\nGive me the others. Give them to me.\nharry\nThey're not yours to take back.\nWILLOUGHBY looks up at him through his tears. There's no condemnation in Harry's eyes, but no sympathy either. His experiences have changed him, turned him into a harder man.\nEXT. maze/ caroline's house - day.\nETHNE gazes silently at the feathers in her hand.\nwILLOUGHBY\n...He'd followed us all the way from Alexandria, looking for an opportunity to redeem himself. It was only after he left that I found out an Arab matching his description had also saved Jack Durrance's life.\nETHNE looks up in surprise.\nwilloughby\nJack doesn't know. That was the way Harry wanted it.\nEXT. FLASHBACK/ BATTLEFIELD/ DESERT/ SUDAN - DAY.  \nSmoke hovers over the corpse strewn battlefield. We see HARRY through the haze, carrying DURRANCE on his shoulders, staggering under his friend's weight.\nEXT. FLASHBACK/ HILLS ABOVE THE BATTLEFIELD/ SUDAN - DAY.\nHARRY and ABOU FATMA help DURRANCE up a steep mountain trail, as below them, the battle rages.\nEXT. FLASHBACK/ BANKS OF THE NILE/ SUDAN - DAY.\nDURRANCE's brow is beaded with sweat. HARRY cools his face with a wet cloth. DURRANCE murmurs questions in his feverish state, but HARRY remains resolutely silent.\nEXT. maze/ caroline's house - day.\nETHNE stares at WILLOUGHBY, thinking only of Harry. WILLOUGHBY thinks she's staring at the medals on his chest. \nwILLOUGHBY\n(Embarrassed)\nI tried to turn them down. I told the committee I'd done nothing to deserve them. They didn't care. I think they pick their heroes' names out of a hat.\n(Trying to ease her pain)\nYou asked me how he'd changed. All I can say is that you would have been proud of him.\nETHNE\nI should have been proud of him before. Or at least I should have tried to understand. \nwilloughby\nYou can't blame yourself.\nETHNE\nWhy not, if you can.\n(She won't forgive herself)\nWe all misjudged him, but I had the least excuse. He was the man I was supposed to love. \nSuddenly a voice calls out:\nDURRANCE O/s\nEthne...\nThey turn around, startled. DURRANCE stands at the entrance to the maze. WILLOUGHBY gets up nervously.\nETHNE\n(Whispering urgently)\nPlease, I don't want him to know you're here.\nWILLOUGHBY stops. DURRANCE looks in their direction.\nwILLOUGHBY\n(In disbelief)\nHe can see us.\nETHNE\nHe can't see a thing. \nDURRANCE reaches out and feels the hedge, finding his bearings, taking slow steps into the maze:\nDURRANCE\nEthne...?\nETHNE keeps quiet. \nDURRANCE\nEthne...?\nShe watches DURRANCE, wracked with guilt.\nwILLOUGHBY\n(Beginning to panic)\nI've got to say something.\nETHNE\nBe quiet.\nDURRANCE is only a few yards away from them now. He stares a moment, as if at ETHNE, then turns and walks back. \nEXT. window/ CAROLINE's house - day.\nCAROLINE sees DURRANCE, walking away from the maze, still calling out for Ethne.\nEXT. maze/ CAROLINE's house - day.\nDurrance's voice fades in the distance.\nETHNE\n(Struggling with her emotions)\nI didn't want him to find out what you just told me.\nwILLOUGHBY\nHarry was his best friend --\nETHNE\n-- I'm engaged to Jack. I'm going to marry him.\nWILLOUGHBY stares in surprise.\nwILLOUGHBY\n...I knew he'd proposed, I had no idea you'd accepted...\n(Considering the implications)\n...I'd never have told you if I knew. I'm sure Harry wouldn't have wanted me to.\nETHNE\nI'm glad you did. I needed to know.\n(Looking at him)\nDo you know where Harry is now?\nWILLOUGHBY hesitates.\nwILLOUGHBY\nHe didn't tell me anything; I didn't feel I had a right to ask --\nETHNE\n-- Please, tell me the truth.\nThere's no anger in her voice, only concern. WILLOUGHBY looks torn.\nwILLOUGHBY\nSome of our men were taken prisoner. The Dervishes took them South, in case we tried a rescue. Trench was among the missing.\nETHNE smiles sadly, as if she has her answer.\nwILLOUGHBY \n(Trying to give her hope)\nHarry may be determined but he isn't mad. He'll look for Trench and then he'll come back. \nETHNE\nHe'll do whatever he has to do. There are still two feathers left. \nEXT. window/ caroline's house - day.\nFrom her window, CAROLINE sees ETHNE and WILLOUGHBY, saying goodbye, walking off in different directions. As ETHNE approaches the house, CAROLINE sees her gazing at something in her hand.\nINT. stairway/ caroline's house - day.\nCAROLINE walks down the stairs. \nCAROLINE\nIs everything alright?\nETHNE\n(Forcing a smile)\nHe was a friend of father's. He apologised for not introducing himself. He was in a hurry.\nCAROLINE doesn't press. She notices the two white feathers in Ethne's hand.\nINT. LIVING ROOM/ CAROLINE's house - night.\nETHNE sits at the piano stool, still gazing at the feathers in her hand. She hears voices in the corridor. It's Durrance, asking Caroline where she is. ETHNE hears his footsteps approaching. She lifts up the piano lid and starts to play. The living room door opens. ETHNE ignores the quiet footsteps behind her. She feels DURRANCE listening to every note. His hands cover her eyes gently.\nETHNE\n(Trying to smile)\nWho could that be...\nShe removes his hands from her eyes, and kisses them. DURRANCE sits down beside her on the piano stool.\nDURRANCE\nWhat were you playing?\nETHNE\nThe Melusine overture.\nDURRANCE\nCheerful stuff.\nHe grins and starts to play the tune, perfectly. ETHNE looks on in admiration, trying to hide her feelings. \nDURRANCE\nJoin me.\nETHNE\nI'd rather listen.\nDURRANCE\nPlease...\nReluctantly ETHNE starts to accompany him. \nDURRANCE\nThey say you can tell a woman's heart by the way she plays.\nETHNE\nWhat if she can't play at all.\nDURRANCE\nIt isn't how well you play, it's how passionately you stroke the keys.\nETHNE presses the keys harder, pretending it's a joke, worried that he might see through her.\nDURRANCE\nI'd say you're in love.\nEven though it's said in jest, his words stick like a knife. The notes torture her. She suddenly gets up and walk away from the piano.\nDURRANCE\n(Following her footsteps)\nWhere are you going?\nETHNE\nI want to hear you play on your own.\nA moment's silence. Then DURRANCE turns back to the piano and starts to play -- quietly, tenderly. The haunting music breaks Ethne's heart. Almost involuntarily she starts to walk away from him, towards the open patio doors.\nDURRANCE\n(With a sudden flourish of the keys)\nThere you go, I'm in love too...\nHe swivels around and beams at her joyfully. ETHNE stares back at him, unable to speak.\nDURRANCE\n(Gazing at her adoringly)\nThese past few days have been the best days of my life, blind or otherwise...\nHis eyes shine in the candlelight, full of new-found hope. \nDURRANCE\n...Before I came here I'd given up. I put on all kinds of fronts and defences, but deep down I was petrified. I had no idea what was going on around me, what people were thinking behind my back. I imagined the worst, so that nothing would surprise me, no-one would catch me out...\nHe walks closer.\nDURRANCE\n...You've made me realise I can't live like that. Whether one can see or not, there's no way of knowing how people really feel about you, all you can do is put yourself in their hands, and trust them unconditionally...\nETHNE can't speak. \nDURRANCE\nI know how much you loved Harry...\n(A beat)\n...for the first time I'm not afraid to admit it, I'm not not afraid to bring it up between us...\n(A beat)\nI'm not afraid, because of you Ethne, because of the way you've made me feel...\nHe waits for an answer but all that greets him is silence. As he steps closer he suddenly loses her presence. A touch of panic enters his voice:\nDURRANCE\nEthne...?\nThe only sound he hears is the wind on the curtains. We see for the first time that Ethne's left, through the open patio doors. \nDURRANCE\nEthne...?\nHe turns around sharply as he hears a noise. CAROLINE stands in the doorway. DURRANCE walks towards her.\nDURRANCE\n(Touching her arm)\nI thought you'd disappeared.\nCAROLINE\nIt's Caroline. Ethne's gone.\nDURRANCE pulls back, embarrassed.\nDURRANCE\nI'm sorry.\nCAROLINE\nShe must be in the garden.\nDURRANCE\n(Trying to sound lighthearted)\nShe was here a minute ago. It must have been something I said.\nCAROLINE\n(Every word is calculated)\nI don't think it was anything you said. She's been upset all afternoon. Ever since she spoke to Lieutenant Willoughby.\nDURRANCE\nWilloughby?... \nHe looks perplexed.\nDURRANCE\nWilloughby was here? Why didn't he come and see me?\nCAROLINE\nI thought he did. I saw you walking into the maze to join them.\nShe feels the impact on him -- the fact that he called out and no-one answered.\nDURRANCE\n(Trying to justify it to himself)\nHe must have had his reasons. \nCAROLINE\nHe brought her two white feathers. That's all I know.\nDURRANCE looks up, startled.\nDURRANCE\n...Harry...\nCAROLINE watches his unseeing eyes trying to make sense of what's happened. She feels a touch of remorse as she sees him struggling with his emotions. Finally he looks up:\nDURRANCE\nEthne obviously didn't want me to know... \n(Curiously)\nWhy did you tell me?\nCAROLINE hesitates.\nCAROLINE\nI thought you should know.\nDURRANCE\nYou're her friend.\nCAROLINE\nYours too I hope.\nDURRANCE stares at her in silence, her intentions slowly becoming clear to him.\nDURRANCE\nYou're not fair to Ethne.\nCAROLINE\nAre you?\nHer meaning is clear. Her words sting him deeply.\nDURRANCE\nHow much of our conversation did you overhear?\nCAROLINE\nEnough.\nDURRANCE\nThen you should know I meant every word.\n(more with pity than anger)\nI love and trust Ethne unconditionally. Whatever doubts she's feeling, I know she'll resolve them.\n(With quiet dignity)\nI've put myself in her hands.\nA long silence. DURRANCE doesn't need to see CAROLINE to know she's in tears. \nCAROLINE\n...The only reason I told you, was because you mean the world to me.\nDURRANCE\n(A gentle rebuff)\nI'm sorry, Mrs Adair.\nEXT. garden/ caroline's house - night.\nETHNE sits in the garden alone, shivering in the wind, hating herself.\nEXT. THE CITY OF DONGOLA/ SOUTHERN SUDAN - night.\nThe peeling CORPSE of a British soldier is dragged through the streets by a rope tied to a camel's back. LOCAL WOMEN tear at the dead man's uniform, grabbing at his testicles, spitting on his bloated face. HARRY slips out of the crowd, horrified by what he's seen, relieved it isn't Trench.\nEXT. DONGOLA/ SUDAN - day.\nThe jeering women can be heard in the distance. ABOU FATMA sits in the shade, slurping an oily gruel. HARRY squats beside him. ABOU FATMA offers him the bowl. HARRY declines.\nABOU FATMA\nYou're surprised by the women?\nHARRY doesn't need to answer, his face says it all.\nABOU FATMA\nThey're always the most cruel. Amongst the Southern Tribes it's the custom for them to go into battle first, calling the men cowards until they're ready to fight.\n(Mischievously)\nIt is the same in your country, no?\nHARRY looks up to find ABOU FATMA grinning at him.\nABOU FATMA\nThe woman you spoke of. Go back to her. Tell her you're ready.\nhaRRY\nWhat did you find out about the British prisoners?\nABOU FATMA\nThere are very few of them left. \nHe offers HARRY his food again. This time HARRY takes the bowl and swallows the rancid meat as if it's nothing.\nharrY\nWhere are they being held?\nABOU FATMA\nYour Army abandoned them. The shame is no longer yours.\nharry\n(Provoking him)\nHave I paid you for nothing, Abou Fatma?\nThe Nubian looks up, stung by the talk of money, when he was only expressing concern.\nABOU FATMA\n(Coldly)\nTwelve British soldiers were taken by boat from here to Omdurman last month. \nhaRRY\nShoukhran.\nABOU FATMA\nYou're a foolish man. Even for a British Officer.\nhARRY\n(Smiling)\n'God protects the fool'.\n(Passing Abou Fatma the bowl)\nHow would I get into the prison at Omdurman?\nABOU FATMA\n(Sarcastically)\nUrinate in a holy well.\nharry\nThat carries a penalty of death. All I want is to be imprisoned there.\nABOU FATMA stops eating, realising HARRY is serious.\nABOU FATMA\nYou will die before your time.\nhaRRY\n'If it is the will of God.'\nABOU FATMA\n(Impatient now)\nThis man turned his back on you. Why should you give your life for his?\nharry\nBecause he'd do the same for me. No matter what had passed between us. \n(Looking at the Nubian)\nI hope I'd do the same for you too.\nABOU FATMA\nI have no need of such friends.\nThe Nubian returns to his food, betraying no sentiment. HARRY reaches into his pocket and holds out five shilling coins. \nABOU FATMA\n(Disdainfully)\nYou owe me two shillings a day. This is too much.\nHARRY can't help smiling. \nhaRRY\nYou still haven't answered my question?\nABOU FATMA\nYou answered it yourself. God protects the fool.\nEXT. night MARKET/ outside the city of OMDURMAN - night.\nHARRY stumbles around the marketplace, strumming on a broken zither, pestering people for money, pretending to be mad. The passing crowds laugh at him and push him away. ABOU FATMA watches from across the street.\nHARRY staggers through the torchlit stalls. He sees a group of DERVISH WARRIORS, gathered around a fire. Their leader, a sickly looking EMIR, smokes a hashish pipe as he listens to his men recounting their feats of war. Next to him, lies a beautiful, jewel encrusted scabbard.\nHARRY thinks a moment, then approaches the group, strumming his zither, grinning at the men. Seeing the crazed musician, the DERVISH WARRIORS cover their ears. Some of them toss chunks of meat at him. HARRY picks up the dusty morsels, chewing them with relish, grinning like a happy puppy.\nABOU FATMA watches as HARRY humiliates himself, playing his broken zither for the EMIR. The EMIR gazes back at him through bored, bloodshot eyes. \nAs the WARRIORS laugh, HARRY suddenly bends down and snatches the Emir's scabbard. He runs off with it at speed, waving it around his head like a sword, yelling at the top of his voice. The DERVISH WARRIORS give chase, still laughing as they run after the lunatic. \nHARRY stumbles over a tent pole deliberately. The DERVISH WARRIORS swarm around him, caning him with their sticks. HARRY protects his face with his hands, pleading:\nharry\n(In Arabic)\nGod loves the fool. God loves the fool...\nEXT. WELL/ outside the city of OMDURMAN - night.\nThe whole marketplace has gathered to watch the madman punished. The WARRIORS hoist HARRY up onto a well, and shout at him to walk around the rim. Holding out his hands, HARRY starts to step around the ledge. As he glances down he sees the drop is at least thirty feet deep. Two of the WARRIORS jump onto the ledge behind him, blowing bugles in his ear.\nDERVISH WARRIORS\n(In Arabic)\nFaster thief...Faster...\nHARRY starts to walk faster, clapping in time with the WARRIORS, performing for the CROWD.\nharry\n(In Arabic)\n...God loves the fool. God loves the fool...\nAnother WARRIOR steps out of the crowd and starts prodding HARRY with his spear. The CROWD roars as HARRY almost topples into the well. He regains his footing and laughs back at them, clapping his hands, wriggling his hips. \nspectator's voiCE \n(In Arabic)\nHere's someone for him to dance with...\nHARRY looks down to see a hideous, half-naked HAG, being pushed towards him. The crowd clears a space for the two lunatics to dance. HARRY forces a crazed giggle as the HAG starts to undulate and thrust her hips at him. He echoes her movements, staring into her deadened eyes.\nThe CROWD pushes them closer together. HARRY feels an overwhelming sense of pity and dread. The dreamlike intensity is getting to him. The tragic creature, shimmying before his eyes, is like a grotesque reminder of the woman he loved and lost. \nThe HAG starts murmuring to herself. As he listens, HARRY realises she's singing -- a tuneless lament, remembered from long ago, sung without any understanding now. The emotion wells up in HARRY's eyes, even as he laughs at her. It's as if he's gazing into a crazy, distorted mirror. \nThe EMIR stares curiously as he catches the emotion in Harry's eyes. He suddenly signals for his men to part the lunatics. HARRY is dragged away from the shrieking HAG, and flung before him. \nEMIR\n(In Arabic, suspicious now)\nPlay for me fool...\nHARRY picks up his zither, and starts to play a tuneless din.  \nEMIR\n(In Arabic)\nYou're not mad. \nHARRY pretends not to understand. The EMIR suddenly cracks his cane down on Harry's hands, breaking his fingers. HARRY screams in agony:\nharry\n(In Arabic)\n...God loves the fool...\nEMIR\n(In Arabic)\nThe fool feels no pain.\nThe EMIR beats him again with the cane. HARRY holds up his broken fingers in supplication, singing softly in his madman's gibberish. \nharry\n(In Arabic)\n...God loves the fool...\nThe EMIR's cane cracks open his face. He doubles over in agony, spitting out blood. ABOU FATMA watches, sickened, unable to do anything. Even the other spectators look shaken.  HARRY slithers away in the dust, whimpering like an animal. \nEMIR\n(In Arabic)\nYou're not mad. Tell me who are you? Tell me or I'll kill you...\nABOU FATMA stares in silence, willing HARRY to speak. Many in the CROWD turn away, fearing the worst. The EMIR raises his cane. With a surge of effort, HARRY lifts up his blood soaked face, and grins at the EMIR. He looks barely human, his face ripped open, swollen beyond recognition. \nharry\n(Singing softly in Arabic)\nGod loves the fool. God loves the fool...\nThe EMIR hesitates, convinced nobody in their right mind could take this much pain.\nEMIR\n(In Arabic)\nHe's mad. Take him to the prison. Let him sing for them there.\nHe turns away and disappears into the crowd. ABOU FATMA stares at HARRY, with both pity and admiration. He whispers a prayer for his friend's safety.\nEXT. PRISON of OMDURMAN/ BANKS OF THE NILE - night.\nThe evening prayers drift over the waters of the Nile. In the distance we see the prison of Omdurman, a huge dome of stone, surrounded by fifty foot walls on three sides, and the river itself on the fourth.\nINT. HOUSE OF STONE/ PRISON/ OMDURMAN - night.\nHundreds of shapes move forward in the darkness. At first they look like a herd of animals, but slowly we recognise the grunts and cries as human. Faces come at us out of the dark, screaming and cursing, shoving each other violently, raising their faces to the ceiling, gasping for air.\nAs our eyes adjust to the light, the vision of hell intensifies. The PRISONERS are manacled and herded into a space no more than thirty feet wide. They circle the room in a clockwise direction, pushed on by each other in perpetual motion, afraid that if they stop they'll be sucked under the maelstrom and trampled underfoot.\nThe most fortunate are those who've found a resting space in the corners of the room. They cling to the walls, fighting off anyone who tries to share their sanctuary. From somewhere amongst them we hear a familiar voice:\ntrench\nGet away! This is Ibrahim's space!\nTRENCH protects his corner, lashing out at anyone who tries to breach the space. He bellows at the top of his voice:\ntrENCH \nIbrahim, where are you?!\nA voice answers from the heaving mass. TRENCH holds out his hand and drags his friend, IBRAHIM, out of the scrum.\ntrench \n(Sounding half crazed)\nYou mustn't fall. You musn't fall.\nAs if to prove his point, a fight breaks out at the far side of the room. TRENCH stands on tiptoes, as eager as everyone else to see the outcome. TWO PRISONERS try to strangle each other with their chains, fighting for an inch of space. It's hard to make out anything in the dark, but the savagery of the fight is reflected in the speed of flailing fists and feet. One of the PRISONERS finally loses his footing. In an instant he's sucked under. The victor laughs maniacally. The loser's cries continue for a moment and then stop suddenly as the trampling feet break his neck. \nTRENCH turns to Ibrahim, with the knowing look of an expert.\ntrench \nWe mustn't fall Ibrahim. We musn't fall.\nSuddenly there's a cry from outside the cell door.\nprison guards o/s\n(In Arabic)\nBack! Get back!\nThe PRISONERS closest to the door push away. The head guard, the towering IDRIS-ES-SAIER, tosses in a blazing torch to clear some space. A NEW PRISONER is flung inside and the door slammed shut behind him. The other PRISONERS surge back, trying to reclaim their space. There are cries of pain as some of them tread on the blazing torch. The sheer weight of men quickly puts it out.\nThe NEW PRISONER holds onto anything he can to stop himself falling. From his corner TRENCH looks on grimly.\ntreNCH\nWatch Ibrahim. He's going to fall. \nThe NEW PRISONER is swept up in the savage wave. As he approaches TRENCH's corner he tries to claw his way to safety. TRENCH beats him back with a flurry of blows. The prisoner disappears under the heaving bodies, but then he pops up again, gasping for breath. He fights with all his might, swinging his fists, clutching at anyone in his way. TRENCH looks impressed, but he knows it won't be long.\ntrench \nHe'll fall. Youssef will get him.\nAs the NEW PRISONER swings towards them again, the prisoner behind him, YOUSSEF, slams his chains down on his head. The new arrival goes down hard. As he disappears, he screams out the name: \"Trench!!!\"\nTRENCH stares in disbelief, frozen for a moment, then bellowing like a bull, he charges out of his corner and flails his way through the heaving mass, trying to retrieve the fallen prisoner. \nTRENCH\nHelp me Ibrahim...!!!\nThe tall Arab fights his way to Trench. Together they pull the NEW PRISONER to his feet. They take him under each arm and fall in with the moving mass.\ntreNCH\nWe've lost our place. You mustn't fall. \nThe man almost collapses, but TRENCH holds him up. He and Ibrahim keep walking the prisoner, trying to keep him conscious, knowing they have to fight till daybreak now.\nINT. HOUSE OF STONE/ PRISON/ OMDURMAN - day.\nThe sound of early morning prayers drifts into the House of Stone. Sunbeams pick out bloodmarks and broken nails where prisoners have tried to claw their way to safety. Half a dozen BODIES lie crushed on the floor, those who didn't make it through the night. Those who did, are ushered outside by the PRISON GUARDS, into the merciless heat. TRENCH and IBRAHIM support the NEW PRISONER. A fat, oily looking Prison Guard, HASSAN, sneers at TRENCH on his way out.\nHASSAN\nYou've found a friend, English.\nTRENCH ignores him, blinking as he walks into the sun.\nEXT. courtyard/ PRISON/ OMDURMAN - day.\nThe PRISONERS collapse as they stumble into the prison courtyard, exhausted by the previous night's efforts. TRENCH and IBRAHIM help the NEW PRISONER to the river's edge.\nEXT. RIVERBANK/ courtyard/ PRISON/ OMDURMAN - day.\nTRENCH kneels beside the prisoner and pours some water over his face. The man opens his lips to swallow it.\ntreNCH\nDon't drink. It's dirty. Your body isn't strong enough.\nBeads of sweat shine on the bearded man's ravaged face. TRENCH studies his features, wondering who he is. He digs out a copper coin from his shoe. \ntreNCH\n(To Ibrahim)\nSee if Hassan will sell us some drinking water.\nIBRAHIM sets off towards HASSAN, who's busy beating the other PRISONERS to their feet. \ntreNCH\n(Looking back)\nYou speak English?\nnew prisoner \n(A trace of a smile appears on his cracked lips)\n...I hope so, after all this time...\nTRENCH stares at him in surprise.\ntreNCH\n...How do you know my name? \nnew PRISONER\nYou told it to me yourself...the first time we met...\n(Imitating Trench weakly)\n\"Trench by name, and Trench by nature. Good to meet you Feversham...\"\nTRENCH stares in astonishment. \ntrENCH\n...Harry?...\nHARRY's eyes move around and find him, twinkling mischievously, despite all the pain.\nharrY\n(With ironic good humor)\n...You look well...\ntreNCH\n(Breaking into a smile)\nNot half as well as you...\n(Overwhelmed)\nWhat the hell are you doing here?...\nhARRY\n...I'd come to rescue you...but now that you've rescued me...I have to save you twice...\nTRENCH stares at him in disbelief.\nhARRY\n...I have some money to bribe the guards...There's a man waiting for us across the river...With camels and provisions...\nTREnch\n(Snapping out of his reverie, hushing him)\nKeep your voice down. \nTRENCH looks across the courtyard to make sure no-one's watching them. HASSAN is busy bargaining with IBRAHIM over the cup of water. \ntreNCH\n(Under his breath)\nHow much money?\nharRY\nTwo hundred.\nTRENCH looks hopeful for the first time in weeks.\nTRENCH\n...I knew it wasn't true. The guards kept telling me our army had left us behind. How far away are they? \nhARRY\n(Regrettably)\nThey pulled out. Over a month ago.\nTRENCH stares in confusion.\nTRENCH\nThen who sent you?\nharrY\nYou did.\nTRENCH doesn't understand. HARRY slowly opens his fingers to reveal a crushed white feather in his hand. TRENCH stares at it in bewilderment. Then suddenly he starts to laugh, full of anguish and joy, amazed by the madness of the world. \nEXT. PRISON GATES/ courtyard/ PRISON/ OMDURMAN - day.\nThe compound gates rumble open. The Prisoners' RELATIVES are ushered inside, kept in order by the GUARDS' whips. The PRISONERS limp as fast as they can to receive any food their families have brought them. Before they can eat, the GUARDS have to be paid off, IDRIS first, then HASSAN and the others. As the feeding frenzy breaks out we hear Trench's voice:\ntrENCH v/o\n...Hassan's the only guard who's corruptible. For two hundred he'll get us on the graveyard detail... \nEXT. RIVERBANK/ courtyard/ PRISON/ OMDURMAN - day.\nWe see what he's talking about now. The dead bodies from the House of Stone are dumped in a row boat. The GUARDS order several PRISONERS onto the boat with them. They're too afraid to handle the corpses themselves.\ntreNCH v/o\n...The farthest the boat goes is a hundred yards from the opposite shore. We'll have to wait until you're strong enough to swim...\nHARRY watches the boat drift into the middle of the river. Ripples appear as huge CROCODILES move in to feed. The PRISONERS toss the bodies in the water. The corpses float for a moment, then suddenly vanish in a froth of blood. \ntreNCH\n(Smiling grimly)\nYou didn't think of that when you came?\nhaRRY\nI didn't think of much when I came.\nTRENCH looks at him, still unable to believe anyone could be so reckless and so brave.\ntrENCH\nAll for a feather?\nhARRY\n(Lightly)\nMore than one.\nTRENCH looks down at the sand, reflecting:\ntrENCH\nGive it to me Harry.\nhaRRY\nWhy?\ntreNCH\nSo I can show you it means nothing -- that if I throw it in the river it'll float away -- end up between some Croc's teeth.\nharry\n(Smiling softly)\nNot this feather. It's got the measure of me. It'll float back and find me.\nThe water laps quietly in the silence.\ntrENCH\nThere were a dozen British Officers here last month. Every time one of them died, the last words on his lips were: \"Don't worry about me lads. Our boys will come and get you.\" They never did. Just you. I'd say you've done enough.\nhaRRY\nNot until I get you out.\ntrENCH\nYou can hardly walk.\nharry\nI don't need to walk, I need to swim.\nHe smiles at TRENCH affectionately. Across the river, the boat returns, silhouetted against the sunset.\nEXT. house of stone/ PRISON/ OMDURMAN - day.\nThe PRISONERS are herded back into the House of Stone. HASSAN walks alongside TRENCH and HARRY, negotiating his bribe.\nhASSAN\n...God put you here for a reason, English. He tests us. I have fifteen starving children myself to care for.\ntreNCH\n(Taking his cue)\nI was thinking of your children Hassan. I'd like to help them. God favours the almsgiver.\nhASSAN\nFor three hundred I could feed them for a year.\ntreNCH\nI can afford two. From myself, Ibrahim, and the madman.\nHASSAN nods, accepting the offer, and walks ahead.\nINT. HOUSE OF STONE/ PRISON/ OMDURMAN - night.\nHARRY and TRENCH are in the thick of the crowd, fighting for space, trying to give each other strength. \ntreNCH\n...The first thing I do when I get back is book a table at Wilton's. A private room, all to myself, no bloody crowds...\nHe shoves into the man in front, gaining a few more precious inches for them to breathe in. \ntrench \n...I'll start with a half shell of crab, then I'll order the mallard, medium rare.\nharRY\nA glass of Burgundy to wash it down.\ntreNCH\nNothing foreign. A pint of Stout'll do me fine. \nharrY\n(Grinning)\nWell I'm getting on the first train to Bintree, crowded or not.\ntrENCH\nI'll drink to that...\n(He raises his hand, as if he's in a crowded pub, trying to get the Barman's attention)\nTwo pints please...\nThe two of them surge through the crowd, laughing like lunatics.\ntreNCH\nA few more days Harry. A few more days...\nINT. HOUSE OF STONE/ PRISON/ OMDURMAN - day.\nThe morning call to prayer brings sobs of relief from the PRISONERS. HARRY, TRENCH, and IBRAHIM, lie in a corner of the room, exhausted by the night's efforts. HASSAN steps over the dead bodies littering the floor, and orders them to get up.\nhassAN\n(As planned)\nYou three, take the bodies to the boat.\nHARRY and IBRAHIM get to their feet. TRENCH doesn't move. HARRY reaches down to give him a hand, when he suddenly sees how pale his friend is. He drops to his knees, feeling TRENCH's pulse. He's alive, but very weak. \nhasSAN \n(Looking at the unconscious Trench)\nYou see, English. God didn't want you to leave. He has given you Umm Sabbah.\nTRENCH moans, gripped by Typhus fever. HARRY tries to help him up, refusing to believe their plans are dashed.\nhARRY\n(Whispering)\nTrench, get up. Get up...\nhassAN\n(Shouting at Harry in Arabic)\nLeave him. Carry the dead to the boat.\nHARRY ignores him, cradling TRENCH in his arms. HASSAN steps forward and lashes him hard across the back.\nharry\n(Still trying to rouse Trench)\n...Get up Trench. Get up...\nHASSAN lashes him again. This time HARRY spins around and grabs the whip. He stares at HASSAN dangerously, the frustration and disappointment pushing him to the edge. \nHASSAN\n(In Arabic)\nHe paid me to release you. If you don't want to go, you can rot with him.\n(Turning to Ibrahim)\nWhat about you?!\nIBRAHIM looks at TRENCH guiltily, then gets up, and walks towards the dead bodies. HARRY gathers TRENCH in his arms, and holds him protectively, like a faithful slave. HASSAN sneers, and strides out of the House of Stone. HARRY looks at TRENCH. His friend shivers feverishly. HARRY brushes the wet hair out of his face:\nhARRY\nWe'll get you to Wilton's. Crab and Mallard, medium rare.\nEXT. RIVERBANK/ PRISON/ OMDURMAN - day.\nHARRY watches from the shore, as IBRAHIM tosses the corpses overboard. Suddenly the Arab takes his chance and dives. He's only yards away from the boat when he's lifted into air by a huge crocodile, and dragged below the murky depths. All is still again. HARRY looks back at TRENCH, lying by the river's edge, lost in his own feverish dreams.\nINT. STUDY/ GENERAL FEVERSHAM's HOUSE/ LONDON - DAY.\nETHNE sits across from GENERAL FEVERSHAM in the dimly lit room. There's bright sunshine outside but very little of it gets in. GENERAL FEVERSHAM seems much older than the first time we saw him, his eyes are withdrawn, his movements restless. He rings the handbell irritably.\nETHNE\nDon't worry about the biscuits General.\ngENERAL FEVERSHAM\nI wanted some myself. I need something sweet in the afternoons, otherwise I fall asleep.\n(Catching himself)\nNot today of course. \nETHNE tries to answer his smile, but neither of them is particularly convincing. \ngENERAL FEVERSHAM\nI'm very touched you've come all this way to tell me your good news. Jack'll make you a wonderful husband.\nETHNE\n(Hiding all her doubts)\nHe'll be pleased to hear that. \ngENERAL FEVERSHAM\nI'm very fond of the boy.\nGENERAL FEVERSHAM smiles weakly, and looks away. Whatever they talk about seems to come back to Harry. ETHNE finally broaches the subject:\nETHNE\nHave you heard any news from the Sudan?\nGENERAL FEVERSHAM hesitates. \ngENERAL FEVERSHAM\n...An old friend of mine came to visit me yesterday, Colonel Sutch. You probably remember him...\nETHNE nods, panicking inside, sensing the old man's grief.\ngENERAL FEVERSHAM\n...He used to receive the occasional letter from Harry, letting him know that he was alright... \n(His voice falters)\n...Harry made him promise not to tell me anything, unless the letters stopped. I'm afraid they did. Over a month ago. \nETHNE looks pale. She tries to hold back her tears for the General's sake.\nETHNE\nI'm sure it doesn't mean anything.\ngENERAL FEVERSHAM\nI asked some friends at the war office to make some enquiries. According to their spies, all the British prisoners are dead.\nETHNE can't speak. The old man fights his tears as well.\ngENERAL FEVERSHAM \nWould you like to see his letters? \nETHNE\n(Barely a whisper)\nI'm not sure I could cope right now.\ngeNERAL FEVERSHAM\nNo, of course not. I'm sorry...\nETHNE looks up, remembering his grief is as great as hers.\nETHNE\nHave you looked at them?\ngENERAL FEVERSHAM\nOh yes. They make wonderful reading...\n(His face lights up briefly)\nHe travelled all the way from Alexandria to Suakin. Across three hundred miles of desert. From there he followed the camel corp disguised as a coolie. He fought with them at Abou Klea, excelled himself by all accounts, saved dozens of lives. If he was still a soldier they'd have probably given him the Victoria Cross.\nETHNE\n(Her eyes shining with tears)\nYou must be very proud.\nThe old man nods, suffering again.\ngeNERAL FEVERSHAM\n...There isn't a trace of fear in the writing. That's what I find so hard to understand. That someone could be so terrified of going to war; and yet when the time comes to face it for real, he embraces it, almost gratefully...\nETHNE\n(Sharing his guilt)\nWe all misjudged him.\ngENERAL FEVERSHAM\nYou only knew him a short time. I had no excuse. \nSeeing him overcome by guilt and grief, ETHNE gets up and takes his hand. GENERAL FEVERSHAM holds hers tightly.\ngENERAL FEVERSHAM \nMy son loved Jack Durrance like a brother. I know he'd be happy for you. He'd want you to live your lives.\nETHNE nods gratefully, unable to speak, her whole world falling apart.\nEXT. courtyard/ PRISON/ OMDURMAN - day.\nThe PRISONERS tear and claw at each other like wild animals, desperately trying reach a scrap of meat that's fallen to the floor. HARRY is in the thick of the fighting, elbowing and head-butting people out of his way. He's changed beyond recognition, and it isn't just physical. He fights with a primal savagery, oblivious to everything except the precious scrap of food. He finally gets hold of it, and swings his elbow round, breaking another PRISONER's nose. \nEXT. RIVER's EDGE/ courtyard/ PRISON/ OMDURMAN - day.\nTRENCH lies by the riverside, sweating and shivering from fever, his eyes sunken back into his skull. HARRY kneels beside him, covered in blood. He holds out the scrap of meat.\nhARRY\n...Trench. Food. You have to eat. \nTRENCH can't move his jaw, let alone eat. HARRY chews the meat for him. When it's soft between his teeth, he spits it out, and feeds TRENCH with his fingers. For all the primal horror, there's a touching human tenderness in the moment. \nSuddenly a pair of hands grab HARRY by the hair, and drag him away from TRENCH. It's IDRIS. The giant prison guard tears the scrap of meat from HARRY's hands and kicks him in the ribs for good measure. Spitting out blood, HARRY crawls after him, no longer having to play the madman, he's halfway there.\nhARRY \n(In Arabic)\nFood master, food master please...\nIDRIS lashes him with his whip. HARRY's body arches in pain but his brain hardly registers. He kisses the ground at Idris's feet, still begging for his scrap of food back.\nhARRY \n(In Arabic)\nFood master. Food...\nIDRIS walks away in disgust. \nINT. HOUSE OF STONE/ PRISON/ OMDURMAN - night.\nHARRY holds up the semi-conscious TRENCH, as they're buffeted around in the House of Stone. The other PRISONERS try to push them under, but HARRY defends TRENCH with the savagery of a veteran. A PRISONER tries to blind TRENCH with his hands, but HARRY grabs his fingers, sinking his teeth in as far as they will go.\nINT. house of stone/ PRISON/ OMDURMAN - day.\nDaylight streams through the open doors. HARRY rests TRENCH against a wall, and scavenges amongst the bodies of the dead, searching for any money they may have hidden. \nEXT. courtyard/ PRISON/ OMDURMAN - day.\nHARRY runs over to HASSAN, and drops to his knees in supplication, holding out a copper coin:\nhARRY \n(Pleading in Arabic)\nFood master. Food. My master needs food.\nHASSAN holds out his arm to reveal a stump where his hand should be.\nhasSAN\n(In Arabic)\nThis is what Idris gave me for helping your master...\n(Spitting at Harry's feet)\nThere's some food.\nHASSAN turns and walks towards the fortress gates. The other PRISONERS scramble after him, desperate to receive their daily handout from their RELATIVES. HARRY thinks about wading in and fighting them for it, but he has no energy left. He collapses in the sand, staring up at the sun. As he closes his eyes, he suddenly hears a whisper:\nARAB BOY o/s\nEnglish...\nHARRY looks up to see a small ARAB BOY, approaching him. The BOY stops as he sees HARRY's ravaged face, frightened by his mad, staring eyes. HARRY sees the piece of chicken in his hand, and waves him over. The ARAB BOY finally kneels down, and offers him the chicken bone.  HARRY snatches it and gnaws on it like a hungry animal. It's only when he examines the meat, making sure there's enough left for Trench, that we realise how human he still is. He slips the half eaten chicken bone in his robes, and looks at the ARAB BOY gratefully. The ARAB BOY holds out some coins for him.\nARAB BOY\nFrom Abou Fatma.\nHARRY stares at the coins. It's all the money he's ever paid Abou Fatma.\nharrY\nMoney's no good anymore. We can't bribe the guards. I need him to buy food and medecine for my friend...\nHe stops as he realises the ARAB BOY doesn't understand a word. He gives him back the coins:\nharrY \n(In Arabic)\nTell Abou Fatma to buy us food. You bring me the food...\nHe points to the other RELATIVES as if to explain. The ARAB BOY nods that he understands. HARRY is about to ask him more when he suddenly spots IDRIS walking towards them menacingly. \nharrY \nGo. Thank Abou Fatma. Thank him for me.\nThe ARAB BOY gets up and walks away. HARRY watches him leave, already missing the human contact. As IDRIS approaches, he scrambles away, reduced to his bestial state again.\nEXT. courtyard/ RIVERside/ PRISON/ OMDURMAN - day.\nHARRY pours water over TRENCH's face. \nhARRY\n...You're better Trench. Much better. You may not feel it, but you look it...\nTRENCH opens his eyes, conscious enough for the first time in weeks, to see how much his friend has changed.\ntreNCH\n(Smiling weakly)\n...When I'm better...Will I look as bad as you?...\nHARRY smiles through bleeding gums and swollen cheeks. The evening prayer starts up behind them. TRENCH closes his eyes in despair.\ntreNCH \nI don't think of God anymore when I hear that sound. It used to give me hope. Now all I feel is dread.\nhARRY\nDon't talk like that. We're going to get you through this.\ntreNCH\nI don't want to get through this, Harry. What for? \nIn the distance they hear IDRIS shouting at the prisoners, driving them back into the House of Stone.\nTRENCH\n...There's only one thing that frightens me now. The thought that the closer I come, the more desperately afraid and sure I am that all this will end right here... when I so wish I could die at home...\n(fighting tears)\nIn my own country -- in my own village...to be buried beneath the trees I know -- in sight of the church and houses I know...beside the trout stream, where I fished when I was a boy...\n(Trying to smile)\nAre you laughing yet?...\nHARRY\nNo, I'm not laughing.\nHARRY fights his own pain.\ntreNCH\nI don't think I can take it anymore, Harry... \nHARRY finds it hard to argue. Staring at TRENCH's ravaged face and withered body all he can do is nod in sympathy. \nEXT. courtyard/ PRISON/ OMDURMAN - day.\nHARRY sits opposite the young ARAB BOY in the courtyard. There's a look of quiet resignation in his eyes as he stares at the small glass vial in his hand. \nhARRY\n(In Arabic)\nThank Abou Fatma for me. Ask him to pray for us.\nThe ARAB BOY nods sadly, as if he's seeing Harry for the last time. HARRY pats him on the shoulder, and gets up.\nINT. HOUSE OF STONE/ PRISON/ OMDURMAN - night.\nHARRY and TRENCH lean against a wall, watching as the House of Stone fills with PRISONERS. TRENCH's eyes are filled with dread.\nhARRY\n(Quietly)\n...We had a visitor today.\nTRENCH turns and looks at him. HARRY opens his hand to reveal the small glass vial. TRENCH stares at the dark liquid inside, slowly realising what it is. \nTRENCH\nAnything would be better than this.\nHARRY\nAre you sure?\nTRENCH nods, his decision made. \nhARRY\n(Slipping him the vial)\nThe poison will take a few hours to work. You won't feel any pain.\nTRENCH\n(Smiling grimly)\nThat'll make a change.\nHARRY looks at him sadly, then turns away, preparing for the inevitable charge from the other PRISONERS.\ntrENCH\n...One last thing, Harry... \nHARRY turns around.\ntrENCH\n...My feather...I'd like it back...\nHARRY stares in silence. TRENCH holds out his hand. HARRY takes it. As they finally let go, we see the soiled white feather in TRENCH's palm. TRENCH closes his fingers around it, gratefully.\ntreNCH \nI hope it gives me as much strength as it gave you.\nTheir eyes stay on each other, full of friendship and respect. Then, steeling himself, TRENCH snaps the vial, and starts to drink.\nHARRY\nHalf...\nTRENCH stops. \ntrENCH\n(Smiling sadly)\nI didn't mean to be a pig about it...\nHe holds out the vial for Harry. HARRY takes it and swallows the rest of the poison. He grins at TRENCH.\nhARRY\nWhat do you say, we give them one last night of hell.\ntrENCH\nI'll drink to that.\nShoulder first, HARRY charges into the massing PRISONERS. TRENCH follows him, laughing through his tears. \nINT. HOUSE OF STONE - DAWN.\nBlinding sunlight. The PRISONERS stumble out of the House of Stone, covered in blood from the previous night's fighting. IDRIS looks down at the broken bodies at his feet. HARRY and TRENCH are amongst the dead. IDRIS prods them both with his spear, making sure.\nIDRIS\n(In Arabic)\nTake them to the boats.\nEXT. courtyard/ RIVERside/ PRISON/ OMDURMAN - day.\nA dozen BODIES are dumped, one on top of the other, in two funeral boats. HASSAN takes charge of one, IDRIS the other.\nEXT. BOATS/ RIVER/ OMDURMAN - day.\nThe GUARDS hold onto the sides of the boat, steadying themselves in case a crocodile tries to ram. The PRISONERS charged with throwing the bodies overboard, stare into the water, terrified of the unseen monsters lurking below.\nEXT. hassan's BOAT/ RIVER/ OMDURMAN - day.\nThe corpses are piled high in Hassan's boat, a mass of chalk white flesh. As we follow a rivulet of blood into the heap, we see Harry's face. His eyes suddenly open. Very much alive. They move around, trying to locate Trench. Above him he feels the corpses being lifted off, easing the burden on his back. \nEXT. RIVER/ OMDURMAN - day.\nArrows break the surface, as the giant crocodiles move in.\nEXT. hassan's BOAT/ RIVER/ OMDURMAN - day.\nHARRY finally glimpses TRENCH. His friend is still unconscious. In tiny movements, HARRY slips through the ice cold flesh that separates them, and slides over TRENCH's body, trying to ensure he's thrown overboard first. \nEXT. idris's BOAT/ RIVER/ OMDURMAN - day.\nBlood boils around the boats as more bodies are tossed overboard. As IDRIS stares into the murky depths, he sees a fifteen foot monster, dragging away a translucent corpse.\nEXT. hassan's BOAT/ RIVER/ OMDURMAN - day.\nHARRY and TRENCH are the only bodies left in Hassan's boat. HARRY braces himself as he's lifted into the air. His body is swung out three times and thrown overboard.\nEXT. RIVER/ OMDURMAN - day.\nHARRY feels the warm water envelop him. Any trace of paralysis the poison has left, disappears in an instant, driven away by sheer terror. Through the eerie green haze he glimpses the dreamlike silhouettes of the crocodiles, feasting on the corpses, dragging them along the river bed. HARRY's instincts are to swim away as fast as he can, but even now he remembers TRENCH. The water above him explodes as TRENCH is hurled in. HARRY swims up to the surface and grabs hold of his friend.\nEXT. idris's BOAT/ RIVER/ OMDURMAN - day.\nIDRIS stares curiously as he watches the two bodies drifting away. The water around them is bubbling but there's no blood. It's only as he looks more closely that IDRIS realises one of the bodies is kicking his feet, swimming away.\niDRIS\n(In Arabic)\nHassan. Behind you!\nEXT. HASSAN's BOAT/ RIVER/ OMDURMAN - day.\nHASSAN turns around to see HARRY and TRENCH disappearing with the current. He takes out his pistol.\nEXT. RIVER/ OMDURMAN - day.\nHolding the unconscious TRENCH in his arms, HARRY swims towards the fastest point of the river, hoping the current will drag him away from the crocodiles and the boats.\nEXT. HASSAN's BOAT/ RIVER/ OMDURMAN - day.\nHASSAN aims the pistol with his good hand. He's about to squeeze the trigger, when there's a loud explosion from the opposite shore. A bullet smashes through his skull and hurls him into the water. \nEXT. opposite shore/ RIVER/ OMDURMAN - day.\nThe MAN who fired the shot lowers his rifle. It's ABOU FATMA. He kicks his camel, and gallops along the riverbank, trying to keep up with HARRY and TRENCH in the water.\nEXT. IDRIS's BOAT/ RIVER/ OMDURMAN - day.\nIDRIS stares after them in fury. He orders the GUARDS to row into the current and give chase.\nEXT. RIVER/ OMDURMAN - day.\nHARRY and TRENCH tumble through the churning water, the current boiling all around them. There are splashes of water as bullets explode.\nEXT. opposite shore/ RIVER/ OMDURMAN - day.\nABOU FATMA dismounts as he sees HARRY and TRENCH being picked off. He takes up a position near the riverbank, and fires at the pursuing boat.\nEXT. IDRIS's BOAT/ RIVER/ OMDURMAN - day.\nIDRIS ducks as one of his GUARDS is hit. He shouts at the remaining GUARDS to fire back at Abou Fatma.\nEXT. RIVER/ OMDURMAN - day.\nHARRY and TRENCH keep disappearing under the water. As he surfaces briefly, HARRY looks around. He sees the current hurtling towards a row of jagged rocks.\nEXT. RIVER/ OMDURMAN - day.\nIDRIS aims at the distant figure on the riverbank, and fires a volley of shots.\nEXT. opposite shore/ RIVER/ OMDURMAN - day.\nTwo bullets spin ABOU FATMA round, grazing him in the leg, knocking the rifle out of his hand. Limping as fast as he can, he takes cover behind the camels.\nEXT. IDRIS's BOAT/ RIVER/ OMDURMAN - day.\nIDRIS looks back at HARRY and TRENCH, ready to pick them off. Suddenly his eyes stop. He sees the jagged rocks in his path. He yells at the GUARDS to row against the current. \nEXT. RIVER/ OMDURMAN - day.\nThe current picks up speed as it hurtles towards the rocks. HARRY holds TRENCH tightly, anticipating the impact. The current sweeps them right through the rocks. \nEXT. opposite shore/ RIVER/ OMDURMAN - day.\nABOU FATMA watches from the riverbank as IDRIS's boat tumbles helplessly towards the rocks. \nEXT. IDRIS's BOAT/ RIVER/ OMDURMAN - day.\nThe GUARDS leap off the boat at the last moment, but the current sweeps them up, and dashes their brains against the rocks. Only IDRIS holds on. The boat breaks up all around him, but protects him from the full impact. \nEXT. RIVER/ OMDURMAN - day.\nHARRY and TRENCH surface on the other side of the rocks. Huge tree roots jut out near the riverbank. The current is still strong but it's swimmable.\nEXT. opposite shore/ RIVER/ OMDURMAN - day.\nABOU FATMA rides after the disappearing bodies. \nEXT. GIANT TREE ROOT/ RIVER/ OMDURMAN - day.\nHARRY reaches out and grabs a jutting tree root. With his legs clamped around TRENCH, he pulls them out of the fastest point of the current. As he looks behind him he sees IDRIS disappear under the torrent. Catching his breath, HARRY starts to clamber along the root, trying to make it to the safety of the riverbank. TRENCH groans, fully conscious now.\nharrY\nWe're going to make it.\nTRENCH stares at HARRY with an almost childlike trust.\nharrY \nSee if you can touch the bottom.\nTRENCH dips his feet under, nodding as they touch the riverbed. \nharrY \nGrab the root.\nTRENCH grips the root. HARRY swims around him.\nharry\nNow walk to the riverbank. \ntreNCH\nMy legs are broken.\nharry\nYour legs are fine. The poison paralyses the body. It's worn off.\nGripping the root, TRENCH starts to walk against the current, the water flowing up to his neck. Slowly the river shallows. HARRY looks relieved as his friend finally tumbles onto the riverbank and collapses. He's about to follow him, when suddenly a pair of hands shoot out of the water, and grab him around the neck. It's IDRIS. He's also managed to clamber his way to safety. With a howl of rage he pulls HARRY's face under the water. \nHARRY kicks and flails. With one huge hand IDRIS keeps him under the surface, with the other he holds onto the giant tree root. HARRY tries to loosen his grip, but he isn't strong enough. He reaches down into the riverbed, and gropes around until he finds a rock. He grinds it into IDRIS's wrist like a pummel stone.\nIDRIS whips his hand away in pain. HARRY is instantly sucked out of his grasp. The current smashes him headlong into another root, downriver. IDRIS stares at his escaped prey in fury. His anger clouds his reason. He lets go of his own root and lets the current drag him to HARRY's.\nEXT. RIVERbank/ OMDURMAN - day.\nHARRY drags himself towards the riverbank. He's only a few yards away when IDRIS's hands grab him again. HARRY turns around swinging and catches IDRIS on the jaw. Both of them tumble in the water. \nThey wrestle beneath the surface, then shoot up again, tearing at each other like wild animals. IDRIS grabs HARRY by the hair, and slams his face down on his knee, smashing his nose. The searing pain staggers HARRY. He tries to crawl away, but IDRIS stamps on his back, flattening him. He drops to his knees, and grinds HARRY's face into the riverbed.\nAs he pulls him back up by the hair, we see HARRY's mangled features -- a mask of blood, eyes staring out, jaws hanging open in defeat. For a moment time seems to slow, then suddenly, shaking his head free, HARRY screams a savage, primal cry, and drives his elbow back into IDRIS's face, shattering bone and cartilege.\nIDRIS falls back, stunned. HARRY has his chance to get away, but he's not interested now. He wades after IDRIS, an expression of pure, uncontrollable rage in his eyes. As IDRIS tries to pick himself up, HARRY slams both fists into his mouth, smashing his teeth down his throat. \nIt's IDRIS's turn to look scared. He tries to crawl away, but the bloody faced demon is on him in seconds, ramming his head back under the water. IDRIS manages to kick him away briefly, but it only enrages HARRY. He comes back at IDRIS with a large rock between his hands, cracking his face open. \nAnd still he isn't finished. Sitting astride the gurgling prison guard, HARRY raises both arms as high as they'll go, and smashes the rock into IDRIS's face, again and again. The guard's blood splatters all over him, but HARRY hardly seems to notice. He's gripped by a savage, primordial fury. Everything he's suffered has built up to this point. He's at his highest and lowest ebb. His hands whirr up and down, his eyes glow feverishly, his lips curl in a terrifying sneer. \nStrong arms grab him from behind, but HARRY ignores them, hammering away. He's beyond hatred, beyond compassion, face to face with his deepest, darkest self. Again the arms try to pull him off, but HARRY brushes them aside. The blood and tears stream down his cheeks. He howls like an animal. His hands finally slow as his arms reach exhaustion. \nThis time ABOU FATMA manages to pull him off. HARRY collapses in his arms and weeps like a baby, finally breaking out of the darkness, no longer sure who or what he is anymore. ABOU FATMA holds him tightly, hushing him, comforting him, understanding.\nEXT. country lane/ bintree/ england - day.\nA primal silence. Mist hovers over the emerald fields. In the distance a carriage approaches. As it draws nearer, we see HARRY, sitting in the back. His scars have healed, but his eyes have the far away look of someone who's seen too much. The outlines of the village church appear through the fog. HARRY hears a dog barking.\nhARRY\n(To the Driver)\nCould you stop here.\nEXT. church/ bintree - day.\nThe barking grows louder as HARRY enters the churchyard. He sees a Collie, tied to a post. It's Dermod's dog. HARRY bends down and strokes the animal. Then he looks up through the open church door.\nINT. church/ bintree - day.\nAt first HARRY doesn't see ETHNE. She sits quietly in one of the Church pews. It's only as she hears his footsteps that she turns around. Her eyes stop still. She stares at him in silence, taking in the ravages of time. All the diffidence and boyish charm she remembers have long since disappeared. In their place, there's an inner strength, and confidence. \nETHNE\nEveryone said how much you'd changed. I didn't believe them.\nhARRY\nDo I look that bad?\nETHNE\nTrench came to see me last week. He looked a good deal worse than you.\nhARRY\nHe's suffered more.\nETHNE\nThat isn't what he told me.\nShe stares at him with quiet pride.\nETHNE\nMay I have it back?\nhARRY\nThat isn't why I came.\nETHNE\nI'd still like it back.\n(She smiles sadly)\nI have three of them, I'd like four.\nHARRY stares at her, then takes out the fourth feather.\nhARRY\nI'm almost sorry to let it go. It's brought me a lot of luck these past few months. \nETHNE takes the feather, unable to look at him. She stares at it in silence.\nETHNE\nWhen did you get back?\nhARRY\nTwo weeks ago.\nShe looks hurt that it's taken him so long to come and see her, but she knows she has no right to expect more. \nETHNE\nI'm glad you did what you did, on your own, without anyone's help. I'm glad for you, Harry.\nhARRY\nI did nothing on my own. You were with me the whole time. \nThe tears begin to shine in her eyes. \nETHNE\nYou've heard our news?...\nhARRY\nYes.\nETHNE nods, unable to continue. \nhARRY\nI didn't come here to change your mind. \n(With quiet dignity)\nThe most I hoped for -- and I hoped for it every day -- was that I could do enough to save the memory of what we had. So that you wouldn't always be ashamed of the time we spent together. \nETHNE is too ashamed of herself to answer him. Her eyes drift to a crack of sunlight on the church wall, glinting through the stained glass windows. \nhARRY\nWhat are you thinking?\nETHNE\nYou'd laugh if I told you.\nharrY\nThat might not be a bad thing.\nETHNE\nI was thinking I'd get up and leave when that patch of sunlight disappeared. So far it's been quite resilient.\nShe smiles gently. For a moment they're the Harry and Ethne of old.\nETHNE\nI passed by your appartment the other day.\nhARRY\n(Surprised)\nWhen?\nETHNE\nWhen you didn't come and see me...\n(She smiles sadly)\nI was in London for the day. It took me hours to pluck up the courage. When I finally drove by, your lights were off. \nhARRY\nI've hardly been out since I got back.\nETHNE\nIt was last Friday. Between five and six.\nhARRY\n(Pausing)\nI'd gone to see my father.\nETHNE\n(Smiling ironically)\nSomeone must be watching over us.\nThe sunlight lingers precariously on the wall. \nETHNE\nIt will pass. You'll meet someone soon. Then you and her, and Jack and I, will sit over tea and chatter politely, as if there was never anything between us.\nhARRY\nThat won't happen.\nETHNE\nIt has to happen.\n(The tears fill her eyes)\nBecause I love you Harry...and I can't. I can't.\nThe sunlight on the wall finally fades. ETHNE wipes her tears and gets up to leave. As she tries to walk past him, HARRY takes her in his arms. She doesn't resist. If anything she's relieved. They stay like that for a moment, holding each other, unable to do anything else. We feel their desperate longing, but there's a self imposed wall that keeps them apart. ETHNE pulls away gently.\nETHNE\nI'll take you to the station.\nHe nods.\nhARRY\nI wanted to look in on Jack. I'll leave him a note.\nETHNE\n(Considering)\nNo, he'd love to see you. He's staying at the vicarage. It's on the way.\nThey're polite around each other now, like strangers. ETHNE slips past him with an awkward smile. HARRY waits before he follows her. They walk down the aisle, several feet apart.\nINT. DURRANCE's room/ vicarage/ glenalla - day.\nDURRANCE sits at a table, knotting his tie. There's a determination in his eyes, as if the smallest activity has become a battle to be won. Suddenly he hears the noise of Ethne's carriage outside. His face lights up. He feels his way towards the window. \nThe carriage door takes a long time to open. DURRANCE stares curiously. Finally he hears footsteps on the gravel. They're heavier than he expected. They stop a moment. DURRANCE knows whoever it is, is staring up at him in the window. He looks thoughtful now, as if he knows who it is. \nHe turns away from the window and finds a chair. He sits, facing the door, checking to make sure the carafe of Scotch and the crystal glasses are within easy reach. The footsteps climb the stairs. There's a knock on the door.\nDURRANCE\nCome in.\nHARRY enters. He stops as he sees his friend. DURRANCE's face has softened from inactivity. His skin seems pale compared to Harry's coarse, sunburnt features. \nDURRANCE\nIt's good to see you, Harry. \nhARRY\n(Quietly impressed)\nHow did you know?\nDURRANCE\nA calculated guess. \n(He grins)\nScotch alright?\nhARRY\nPerfect.\nDURRANCE\nI've got to cut down on the stuff. I'm putting on weight. \nhARRY\nYou look good.\nDURRANCE\nNot as good as you, I'm sure.\nHARRY watches his friend, taking the carafe, pouring two perfect glasses. Everything Durrance does, is designed to show him he's alright, that there's nothing to pity. \nDURRANCE\n(Handing him the drink)\nI heard Ethne's carriage outside?\nhARRY\nShe's giving me a ride to the station.\nDURRANCE\nWhy didn't she come up?\nhARRY\n(He knows the question isn't as casual as it sounds)\nI think she wanted to give us a few minutes alone. \nDURRANCE\nDo we need a few minutes alone? \nEven though he's smiling, the air is thick with tension.\nhARRY\nI came to thank you, Jack.\nDURRANCE\nFor what? \nhARRY\nFor standing by me.\nDURRANCE\nIf you're talking about the feathers, I wasn't there.\nhARRY\nWilloughby told me you were. He said you'd tried to talk them out of it. \nDURRANCE hesitates. \nDURRANCE\nYou don't owe me anything Harry. The wedding isn't for another month. Ethne's free to make up her own mind.\nhARRY\nYou don't owe me anything either, Jack. And she's made up her mind. You should trust her judgement.\nA long silence. DURRANCE is too proud to respond. HARRY stares at his friend, regretting the wall between them.\nhARRY\nI'd better go. I'll miss my train. I'll come and see you soon.\nHe finishes his drink and gets up. \nDURRANCE\nHave another one.\nhARRY\nI can't Jack.\nDURRANCE\nPlease.\nHis voice is softer now, more conciliatory. \nDURRANCE\nThe friendship was the best thing about that place. It's the one thing I haven't been able to hang onto. \nIt's his way of asking Harry to stay. HARRY sits again.\nDURRANCE\nI've become like one of those old soldiers we used to laugh at. Forcing my stories on everyone. Enough medals on my uniform to light up a Christmas tree.\n(Filling their glasses)\nHave they given you back your commission?\nhARRY\nThey haven't acknowledged me in any way.\nDURRANCE\nI suppose it wouldn't be the British Army if they admitted their mistakes.\nhARRY\nI don't know if it was a mistake. I was never a real soldier like you.\nDURRANCE\nA real soldier doesn't come back in a hospital ship. \n(Raising his glass)\nTo Castelton and all the others we left behind.\nHARRY watches his friend down his whisky, sensing the guilt and pain inside. \nhARRY\n(Reassuring him gently)\nYou did everything you could.\nDURRANCE\nYou saw it happen?\nhARRY\nFrom a distance. I remember the entire British Square retreating in perfect order, and then these two lunatics, charging out to save their friend.\n(He smiles affectionately)\nI remember thinking there wasn't a bullet in the world that could stop you that day.\nDURRANCE\n(Ironically)\nExcept my own.\nhARRY\nYou obviously weren't meant to die. You certainly tried your best.\nDURRANCE chuckles, close to tears, holding them back.\nDURRANCE\nIt's hard to talk like this with anyone else. They all want to know how many people you've killed, but the moment you mention the friends you've lost, their eyes glaze over.\nhARRY\nThey weren't there.\nDURRANCE\nNo.\n(A beat)\nDo you ever miss the desert Harry?\nhARRY\nI'm glad I'm home.\nDURRANCE\nIt was the best time of my life. Whenever anyone had a problem they came to me. I never felt so needed. __\n(He smiles)\nMaybe we should change places.\nHARRY isn't sure what he means. DURRANCE tops up their glasses.\nDURRANCE\nYou remember the first time we led a cavalry charge in public?\nhARRY\nYou wiped the floor with me. Most of my horses ended up in the bandstand.\nDURRANCE\nEthne was watching.\nhARRY\n(Hesitating)\nThat's right.\nDURRANCE\nWe'd met her the previous night, at the regimental ball.\nhARRY\nI remember.\nDURRANCE\nYou should. You were the only one she danced with.\nHARRY smiles but doesn't say anything. \nDURRANCE\nI've never been so jealous. I stayed up all night brooding. The next day I was determined to show you up -- prove to her I was the better soldier.\nhARRY\n(Affectionately)\nYou were always the better soldier. \nDURRANCE\nAnd it still didn't make a difference.\n(He smiles wistfully)\nShe was the first person I looked for in the crowd, and she was staring at you. Everyone else was applauding me, and she was staring at you.\n(A beat)\nI'm not sure if anything's changed.\nHARRY can't speak. He knows what DURRANCE is saying.  \nDURRANCE\n(Raising his glass)\nTo us Harry.\nHe leans over, grinning, and touches Harry's glass.\nDURRANCE\nTo you.\nEXT. churchyard/ glenalla - day.\nChurch bells chime, drowned out by the excited GUESTS. The Wedding party has gathered outside the chapel, waiting for the bride. There's a flurry of activity as Ethne's carriage finally draws up. FRIENDS and FAMILY run over to greet her.\nHARRY's PARTY stays behind at the Church door, preparing him for her imminent arrival. GENERAL FEVERSHAM and COLONEL SUTCH make last minute adjustments to HARRY's suit and tie. WILLOUGHBY reminds TRENCH to make sure he's still got the ring.\nETHNE finally emerges from the carriage, looking radiant in a white dress. HARRY tries to catch a glimpse of her, but TRENCH covers his eyes, as if it's still bad luck to see his bride. \nETHNE laughs as she walks past them into the church, accompanied by her FATHER. TRENCH waits until she's safely inside, before he removes his hands from Harry's eyes. HARRY looks around, hoping to see Durrance amongst the crowd. \nHis friend is nowhere to be seen. HARRY smiles at the other GUESTS, but he seems distracted, as if he knows in his heart Durrance won't show. Slowly the CROWD outside thins until only HARRY, TRENCH, and WILLOUGHBY remain. \ntrENCH\nReady?\nHARRY has one last look for Durrance, still hoping against hope, then he nods and follows his friends inside. \nThe noise of the choir fades as the doors close behind them. For a moment we're left in the balmly stillness of the churchyard, and then, in it's place, we hear the unmistakeable whisper of the desert wind.\nFADE OUT.\nCUT TO:\nINT. BACK ROOM - CHURCH AT GLENALLA - DAY (CHURCH ORGAN OVER)    155\nIn full dress uniforms, Colonel Sutch and General Feversham work Harry over -- adjusting his collar:\nGENERAL FEVERSHAM\nAll set... looking good.\nHARRY\n(mock nautical)\nAye, sir.\nGENERAL FEVERSHAM\nThat's enough out of you...\nAs they shove him through the door -- turning back to Sutch:\nHARRY\nBy the way, I must remember to thank you...\n(pause)\nFor telling everyone I was dead.\nSUTCH\nI've never been so happy to be wrong in all my life.  But I did what I thought was right..\nHARRY\nA terrible habit.\n(beat)\nRaises all kinds of hell...\nAs he heads out through the door, with the ORGAN PLAYING: \"THE WEDDING MARCH...\"\nSERIES OF SHOTS (MUSIC OVER):                                   156\n\n- THE CHAPEL: is filled with MILITARY MEN; Feversham family and friends; Mrs. Adair; and a church full of locals.\n- HARRY'S POV - ON ETHNE: walking down the aisle -- as beautiful as a bride can be.\nDISSOLVE TO:\n- HARRY AND ETHNE: kissing at the altar -- joined together as man and wife, as...\nGENERAL FEVERSHAM (v.o.)\n(bellows)\nOfficers...\n\nCUT TO:\nEXT. CHURCH - AFTER CEREMONY                                     157\nANGLE ON: the assembled military men -- in two lines, leading from the church door:\nGENERAL FEVERSHAM (CONT'D)\n(bellows)\nDraw...\nCLOSEUP: hands on hilts, as:\nGENERAL FEVERSHAM\n(bellows)\nSwooooords!!!\nTWO ROWS OF SWORDS ARE PULLED AND FLOURISHED -- INTO THE AIR!\nSunlight glinting off the blades, the Officers and former Officers of the 1st Battalion Grenadier Guards form a canopy, beneath which...\nHARRY AND ETHNE: exit the church, arm-in-arm, to the CHEERS of their families and friends... and the bitter-sweet tears of Mrs. Adair.  As they move down the steps, beneath the ceremonial swords...\nWITH AN ARMY BAND PLAYING A ROUSING MARCH...\nTRACK DOWN THE LINE TO REVEAL: the joyous faces of General Feversham, Colonel Sutch, Colonel Willoughby, and Captain Trench.  As their heads turn to follow the lovers...\nCONTINUE TRACKING TO REVEAL: an EMPTY SPACE -- amidst the row of Officers, in honor of the missing Durrance.\nTRACK IN TOWARD THAT EMPTY SPACE, AND RACK BEYOND IT TO REVEAL:\nHarry and Ethne, kissing for real... at last.\nFREEZE FRAME.\nAs the MILITARY MARCH PLAYS ON;\nCREDITS ROLL TO...\n\nTHE END.\n\n\n\n\n\n\n\n\n\n\n\nFour Feathers\nWriters :   Michael Chiffer  Hossein Amini\nGenres :   Adventure  Drama  War\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:18.460424"}