{"title": "Fracture", "film_link": "/Movie Scripts/Fracture Script.html", "script_link": "/scripts/Fracture.html", "info_raw": "\n\nFracture Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.33 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Dan Pyne\nGenres  Crime  Drama  Thriller\nScript Date : January 2005\nMovie Release Date : April 2007\n\nRead \"Fracture\" Script\n\n\n", "script": "\n\n\n \n                                      FRACTURE\n\n\n                                     Written by\n\n                                      Dan Pyne\n\n               \n                                Current Revisions by\n\n                                     Glenn Gers\n\n               \n\n               \n                                                           January 6, 2005\n\n               \n\n               CREDITS SEQUENCE: EXTREME CLOSE-UPS\n               An unfinished mechanical device: a scaffold of thin metal\n               pipes, levers, pulleys, wiring, serve-motors.\n               THOMAS CRAWFORD works on it: in his 40s, well-dressed but in\n               disarray, graying stubble, hair and clothes unkempt.\n               Magnifying glasses distort his eyes, making them huge and\n               strange.\n               He sets aside a tool, takes a marble-sized ball-bearing and\n               drops it into a slot at the top of the device.\n               His enlarged eyes follow the metal ball -\n               - as it rolls and flips and spirals through a Rube-Goldberg-\n               style maze, setting off bells, clicking past turnstiles -\n               - then missing a leap and clattering across the work-table.\n               Eyes on the device, Crawford's hand traps the ball.\n               He stays still, analyzing.\n               He selects a tiny screwdriver from a neat array of metal-\n               working and electronics tools. Makes a miniscule adjustment\n               to a single joint. Drops in another ball.\n               It rolls and flips and spirals all the way down.\n               Crawford doesn't react.   Just studies the machine.\n               Behind him, on a desk: a framed photograph of a beautiful\n               woman in her mid-30s.\n               His wife.\n\n               \n\n\n               INT. LUXURY BEACH-HOTEL ROOM - THE SAME TIME\n\n               JENNIFER CRAWFORD is just reaching orgasm -\n               - with ROB NUNALLY: mid-30s, good-looking, aging-boyish.\n               They clutch each other, shuddering, lost in passion. And\n               then, breathing heavily, caressing each other - Nunally rolls\n               off her - slowly coming back to earth.\n               Jennifer studies her lover, a quiet play of relief and\n               gratitude and satisfaction on her face -\n               - darkened by a troubled distance, maybe even fear.\n               She is, after all, having an affair.\n\n               \n\n                                                                              2\n\n               \n\n               \n\n\n               INT. CRAWFORD'S OFFICE - DAY\n\n               Crawford stares through the grotesque lenses, motionless,\n               expressionless.\n\n               He takes a deep breath and checks his watch.   Then he stands,\n               removing the glasses.\n\n               We now see his office: large, austere. Decor and equipment\n               related to aircraft engineering. Outside big windows, jets\n               take off from an industrial airstrip.\n\n               Crawford gets a brand-new bottle of Jack Daniels from a desk\n               drawer, uncaps it and swigs as he opens the door to a private\n               bathroom.\n\n               He gargles, spits into the sink. He pours out more, then\n               puts the half-empty bottle back on his desk.\n\n               He collects a home-made device from the workbench: it looks\n               like a PDA connected by wires to a blank credit card.\n\n               He puts it in the pocket of his suit jacket, which he sets on\n               the desk. Adjusts the placement of the open bottle, nearby.\n               Crawford goes to a light-box, studying a set of large X-rays:\n               dark strips of welding in a grayish fuzz of metal.\n\n               TINA, his assistant, appears in the doorway.\n\n                                        TINA\n                           The N.T.S.B. guys are here.\n\n                                        CRAWFORD\n                                  (Doesn't look up)\n                           Yep.\n\n               She hesitates a second, glancing at the bottle.\n               Crawford ignores her, pulling an x-ray off the light-box and\n               grabbing his jacket -\n               - which knocks over the bottle.   It skitters across the desk,\n               liquor spilling.\n               Crawford just walks out past Tina.\n\n               \n\n\n               INT. AIRPLANE HANGER - SOON AFTER\n\n               The twisted, torn and burned wreckage of a large private jet\n               is being reassembled on the big empty concrete floor.\n\n               \n\n                                                                             3\n\n               \n\n               \n               N.T.S.B. INVESTIGATORS in shirtsleeves and AIRCRAFT COMPANY\n               EXECUTIVES in suits cluster around work-boards covered with\n               photographs and diagrams of a crash site.\n               They look up, falling silent, as Crawford comes in carrying\n               the X-ray. A few exchange surprised, concerned glances; this\n               is not a man who skips a shave.\n               But when he gets to them, Crawford is laser-like - holding\n               the X-ray and pointing to a spot three inches above it:\n\n                                         CRAWFORD\n                            It's here.\n\n               He hands a startled Investigator the film and strides off\n               toward the giant open doors out to the airfield.\n               His foot knocks a piece of the carefully-laid-out wreckage in\n               passing; it clatters across the concrete, but Crawford\n               doesn't slow or look back.\n\n               \n\n\n               INT. LUXURY BEACH-HOTEL ROOM - SOON AFTER\n\n               Rob is still in the bed, naked under the sheet - watching\n               Jennifer adjust the straps of her bathing suit.\n\n                                         ROB\n                            What about dinner tonight?\n\n               She looks at him, surprised.    Smiles, comes to sit beside\n               him. Gently:\n\n                                         JENNIFER\n                            We go out to dinner - we might never\n                            come back.\n\n               Beat.   Rob nods.\n\n                                         ROB\n                            Okay.\n                                   (Beat)\n                            I want to wake up with you.    I want\n                            to...\n\n               He gropes for words, but it's too big and he relents - scales\n               back, sighing:\n\n                                         ROB\n                            ...at least see where you live.\n\n               She regards him tenderly, feeling the same reckless yearning.\n               But also fear. She rubs his hair.\n\n               \n\n                                                                             4\n\n               \n\n               \n\n                                        JENNIFER\n                           I live...here.\n\n               She leans over to kiss him delicately on the lips.\n\n               \n\n\n               EXT. SANTA MONICA STREET - DAY\n\n               A black Porsche speeds down a quiet street near the beach,\n               pulls into a parking space.\n               Crawford gets out, goes to a pay phone. He puts his cell\n               phone on top of it, drops in some change and dials.\n\n                                        OPERATOR (ON PHONE)\n\n                           L.A.P.D.\n\n                                        CRAWFORD\n                           Lieutenant Nunally, please.\n\n               He listens to hold music and checks the time.\n\n                                        OPERATOR (ON PHONE)\n                           He doesn't come on til six. You want\n                           his voice mail?\n\n                                         CRAWFORD\n                           No.  Thank you.\n                                  (beat)\n                           I'll see him later.\n\n               He hangs up, grabs his cell, and takes off down the sidewalk.\n\n               \n\n\n               INT. HOTEL LOBBY - DAY\n\n               Crawford enters. He knows where he's going - past the front\n               desk and outside to the -\n\n               \n\n\n               EXT. HOTEL POOL - DAY\n\n               Jennifer swims laps with strong, even strokes.   Rob is\n               enjoying the sun in a lounge chair.\n               Crawford eyes them as he passes on the other side of a low\n               fence. Unnoticed, he heads upstairs.\n\n               \n\n                                                                             5\n\n               \n\n               \n\n\n               INT. HOTEL CORRIDOR - DAY\n\n               Crawford stops at a room with a DO NOT DISTURB sign on the\n               knob. He takes out his PDA-device and slides its card into\n               the key-card slot of the lock.\n               The lock clicks to green.\n\n               \n\n\n               INT. HOTEL ROOM - DAY\n\n               Crawford enters, quietly closing the door behind him.\n               He just stands there, taking it all in. The unmade bed, the\n               ripped-open condom packet, the clothes on the floor.\n               He is silent.   Very still.\n\n               \n\n\n               EXT. CRAWFORD'S STREET - LATER\n\n               Jennifer drives her Mercedes convertible past expensive\n               houses in the late-afternoon light.\n               She goes up the driveway of the Crawfords' stark mordern home.\n               Across the street, MR. GIFFORD is playing catch with his\n               GRANDSON. He waves to Jennifer.\n               She waves back, friendly but distracted, on her way to the\n               front door.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - CONTINUOUS\n\n               Cold. Elegant. Metal planters with bamboo trees. Glass\n               doors out to a back garden. A fire in the fireplace.\n               In a corner is another of Crawford's Rube Goldbergs - this\n               one the size of a refrigerator. On a coffee table in the\n               center of the room, a big wooden bowl of ball-bearings.\n               Jennifer hurries in, dropping her keys on a table and -\n               - freezes, startled.\n               Crawford waits in the center of the room; despite the outer\n               \"disarray\", he is calm and focused.\n\n                                        JENNIFER\n                           You're - home early.\n\n               \n\n                                                                            6\n\n               \n\n               \n\n                                        CRAWFORD\n                           I just felt a sudden urge.\n\n                                        JENNIFER\n                           Are you...okay?\n               Crawford shrugs, smiling strangely.   He looks pained.\n\n                                        CRAWFORD\n                           I could use a hug.\n               Jennifer submits guiltily.   Crawford embraces her, tight.\n               She waits it out, until:\n\n                                        JENNIFER\n                           Have you been drinking?\n               He lets go and she steps back.   Studying him.   Scared.\n\n                                        CRAWFORD\n                           I've been watching you sleep.   At\n                           night.\n\n                                        JENNIFER\n                                  (Gently)\n                           That's creepy.\n\n                                        CRAWFORD\n                           Sometimes when I'm at work, I'll start\n                           thinking about you and I'll just get -\n                           just - overwhelmed.\n\n                                        JENNIFER\n                           Tommy -\n\n                                          CRAWFORD\n                           It's a dense, crushing -\n                           geophysical force. Like I'm\n                           pinned. At the core - where things\n                           change.\n                                   (beat)\n                           You ever get that way about me,\n                           Jen?\n\n                                        JENNIFER\n                           What are you talking about?\n\n                                        CRAWFORD\n                           I'm trying to describe my feelings.\n\n                                        JENNIFER\n                           Those don't sound like feelings.\n\n               \n\n                                                                                     7\n\n               \n\n               \n\n                                           CRAWFORD\n                           No?\n                                   (Beat)\n                           What's the sound of one feeling...in a\n                           forest?\n\n                                        JENNIFER\n                           You think you're so much smarter\n                           than I am. That must make you feel\n                           very powerful.\n\n                                        CRAWFORD\n                           Helpless, actually.\n               Silence.\n\n                                           JENNIFER\n                           Okay.     Maybe it's time to really talk.\n\n                                           CRAWFORD\n                           No.\n\n                                           JENNIFER\n                           No?\n               He shakes his head.     Frayed and worn, she sighs.\n\n                                       JENNIFER\n                           Fine. Whatever. I'll make you some\n                           dinner.\n               He watches her turn and head for the kitchen.          To her back:\n\n                                           CRAWFORD\n                           I know.     Everything.\n               She stops, exhales.    Looking down.   Afraid.    Grateful it's\n               happening at last.\n\n                                           JENNIFER\n                           I'm so sorry.\n\n                                         CRAWFORD\n                           Don't be. Knowledge is pain.         I'm\n                           used to that.\n               Jennifer winces, feeling some sympathy.     Preparing herself to\n               turn and end it, to grow, to move on.\n\n                                        CRAWFORD\n                           It's not like I don't let little\n                           pleasures, in return for the pain.\n\n               \n\n                                                                              8\n\n               \n\n               \n               She frowns and turns - and her eyes go big with fear.\n               Crawford is holding a semi-automatic pistol, aimed at her\n               face. Very still.\n               The gunshot explodes out of the muzzle - bright, harsh, loud.\n\n               \n\n\n               EXT. GIFFORD HOUSE - FRONT YARD - CONTINUOUS\n\n               Gifford and his Grandson turn to look at the Crawford house.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - CONTINUOUS\n\n               Crawford stands, tilting his head to watch the slow hypnotic\n               curl of smoke leaking from the gun in his extended hand. The\n               hand, we might notice now, wears a surgical glove.\n               He lowers the gun, bends to pick up the ejected shell-casing\n               from the floor. He wipes it and tosses it aside, on his way\n               to Jennifer.\n               He stands looking down at her: face-up on the floor, head in\n               a small pool of blood, eyes and mouth open.\n               The doorbell rings.\n\n               \n\n\n               EXT. CRAWFORD HOUSE - CONTINUOUS\n\n               Gifford leans on the frosted-glass panel next to the door -\n               hands cupped around his eyes, trying to see in.\n\n                                          GIFFORD\n                           Tom?   Jen?   Everything okay in there?\n\n               \n\n\n               INT. CRAWFORD FOYER - CONTINUOUS\n\n               Crawford steps in from the living room.\n\n                                        CRAWFORD\n                           Everybody just LEAVE US ALONE!\n               He calmly aims up at the frosted-glass transom and fires\n               three times - watching Gifford fling himself away.\n               Crawford collects the shell casings, wipes them, drops them\n               back on the floor.\n               Peeling off the rubber gloves, he crosses to the fireplace\n               and throws them into the flames. They curl and blacken.\n\n               \n\n                                                                              9\n\n               \n\n               \n               Crawford watches, expressionless - then looks around,\n               satisfied. Waiting.\n\n               \n\n\n               EXT. CRAWFORD'S STREET - DUSK\n\n               Helicopters overhead, SWAT teams setting up. Nearby houses\n               have been emptied, gawking NEIGHBORS and media vans moved\n               back to a block away.\n               UNIFORM COPS pull aside the barriers as a plain-wrap sedan\n               rolls through. It pulls up by the SWAT Command Truck.\n               ROB NUNALLY gets out, surveying the scene. The guy who spent\n               his afternoon with Jennifer Crawford in the hotel is an\n               L.A.P.D. Detective.\n\n                                        SWAT COMMANDER\n                           You the Negotiator?\n\n                                          NUNALLY\n                           Yeah.    What do we know?\n\n               \n\n\n               INT. CRAWFORD HOUSE - SOON AFTER\n\n               Crawford waits, with the gun.    The phone rings.   He picks up:\n\n                                           CRAWFORD\n                           Yes?\n\n                                                             INTERCUT WITH:\n\n               \n\n\n               EXT. CRAWFORD'S STREET - CONTINUOUS\n\n               Nunally is standing by the open trunk of his sedan, wearing a\n               Kevlar vest now - putting on his shoulder-holster over it.\n               Into his cell-phone:\n\n                                           NUNALLY\n                           Mr. Crawford?\n\n                                           CRAWFORD\n                           Who is this?\n\n                                        NUNALLY\n                           My name is Lieutenant Robert Nunally.\n                           I'm a hostage negotiator for the Los -\n               Crawford hangs up.   Thoughtful.\n\n               \n\n                                                                                10\n\n               \n\n               \n\n                                           NUNALLY\n                           Mr. Crawford?\n               Nunally grimaces, shuts his phone, shaking his head. But\n               then he turns - with the SWAT Commander and everyone else -\n               - as Crawford's front door unlocks and opens a few inches.\n               Nunally considers this, looks at the SWAT COMMANDER.\n\n                                         NUNALLY\n                           Okay then.   Here we go.\n               He pulls his suit jacket back on, then reaches into the trunk\n               for his back-up gun. He tucks it into the back of his belt,\n               concealed under the jacket.\n               He takes a walkie-talkie and starts for the house.\n               The spectators fall silent.    Radios crackle and hiss as he\n               heads up the driveway.\n\n               \n\n\n               INT. CRAWFORD HOUSE - CONTINUOUS\n\n               Crawford watches Nunally's silhouette appear on the frosted\n               glass, from across the living room.\n\n                                           NUNALLY (O.S.)\n                           Mr. Crawford?\n               The door pushes open very slowly.     Nunally stays in the\n               doorway.\n\n                                           NUNALLY\n                           Hey.\n               Crawford studies him, staying back.\n\n                                        CRAWFORD\n                           Get rid of the vampires.\n               Nunally is confused; Crawford gestures at the flood-lit lawn\n               outside. Nunally glances back, sees the SWAT teams and -\n               down the street - the distant barricades, the media.\n               He nods, steps in and lets the door shut.     Careful silence.\n\n                                        CRAWFORD\n                           Do I call you Rob?\n\n                                           NUNALLY\n                           If you want.\n\n               \n\n                                                                             11\n\n               \n\n               \n\n                                           CRAWFORD\n                           Not vampires.\n\n                                           NUNALLY\n                           What?\n\n                                           CRAWFORD\n                           Not vampires.     Ghouls.   Sorry.\n               Nunally nods, humoring him, glancing around. Sees the small\n               pool of blood where Jennifer fell. Plays it cool.\n\n                                        NUNALLY\n                           Mr. Crawford, what do you say you give\n                           me the gun - so I can pay more\n                           attention to what you're saying?\n               Crawford sighs.\n\n                                         CRAWFORD\n                           Is that your best shot?\n                                  (Beat)\n                           So to speak.\n\n                                        NUNALLY\n                           I just think - maybe it would -\n\n                                        CRAWFORD\n                           Tell you what: I will if you will.\n               Nunally frowns, wary.\n               Crawford moves to the coffee table in the center of the room,\n               holds his gun out over it.\n\n                                        CRAWFORD\n                           We both put down our guns.      At the\n                           same time.\n               Crawford gestures to a chair across the room - by the foyer\n               door, near Nunally.\n\n                                         CRAWFORD\n                           We set them down and step away.\n                                  (Beat)\n                           Then you can \"pay more attention\" to\n                           what I'm saying.\n               Nunally studies Crawford...and the gun, hovering above the\n               coffee table. Looking for a trick, a catch. But there isn't\n               one. If Crawford sets down his gun and steps away, he'll be\n               standing in the open center of the room.\n\n               \n\n                                                                           12\n\n               \n\n               \n\n                                        CRAWFORD\n                           Happy ending, then.\n               Nunally stares Crawford in the eyes -\n               - then slowly takes his gun from his shoulder holster.\n               Eyes on each other from across the room - moving very slowly -\n               the two men cautiously set down their guns -\n               - and step away.   Crawford smiles.\n               Nunally smiles, too, reassuring and false. Begins to edge\n               forward - alert to the possibility of a lunge for the gun or\n               having another weapon. But Crawford stays absolutely still.\n\n                                        NUNALLY\n                           Mr. Crawford, your neighbor mentioned\n                           that your wife -\n\n                                         CRAWFORD\n                           It's Tom.\n\n                                         NUNALLY\n                           I'm sorry?\n\n                                        CRAWFORD\n                           You can call me Tom.\n\n                                         NUNALLY\n                           Tom.   Your wife. Is she here?\n\n                                         CRAWFORD\n                           Yes.\n               Crawford gestures to a library alcove, behind him, out of\n               view.\n\n                                        NUNALLY\n                           Is she all right?\n               Nunally begins to drift slowly to the side, to see.\n\n                                        CRAWFORD\n                           I don't think she is.     I shot her,\n                           Rob.\n               Nunally's nodding, edging to look into the alcove -\n\n                                        NUNALLY\n                           You shot your wife.\n\n               \n\n                                                                             13\n\n               \n\n               \n\n                                        CRAWFORD\n                           It was like I just suddenly - snapped.\n                           We were arguing - and I got the gun.\n\n                                        NUNALLY\n                           - okay - I hear you -\n\n                                         CRAWFORD\n                           And I shot her in the head.   I know it\n                           was wrong.\n                                  (Beat)\n                           Are you listening to me?\n               But Nunally is not. He's frozen - staring, shocked, at the\n               back wall of the alcove - which he can now see.\n               There's a big framed black-white photograph: a portrait of\n               Jennifer Crawford.\n\n                                        NUNALLY\n                           Oh Jesus Christ.\n               Nunally fumbles for his walkie-talkie, rushing past Crawford\n               toward the alcove -\n               - kneeling by Jennifer, who lies, face-up in a red puddle -\n\n                                        NUNALLY\n                                  (into walkie-talkie)\n                           We need a medic in here! Get the\n                           ambulance up! RIGHT NOW! NOW! NOW!\n               Nunally feels her neck frantically for a pulse - looking in\n               her open, vacant eyes for some sign -\n\n                                        NUNALLY\n                           Oh no - God no - I can't - get a -\n               Nunally desperately starts C.P.R., his hands getting bloody.\n               He stops to check her neck for a pulse now and then -\n               - as Crawford slowly approaches from the living room,\n               standing behind Nunally. Cold.\n\n                                        CRAWFORD\n                           You know, I think I read somewhere\n                           that a good place to find a pulse is\n                           the femoral artery. It's on the inner\n                           surface of the upper thigh. If you\n                           put your fingers - you know, right up\n                           inside her dress -\n\n               \n\n                                                                             14\n\n               \n\n               \n               Nunally turns and lunges up, smashing a fist into Crawford's\n               face. Crawford reels backward with Nunally -\n               - the two of them falling with Nunally on top, beating\n               Crawford furiously, cursing -\n               - as SWAT COPS burst in, grabbing Nunally, dragging him back -\n               knocking into PARAMEDICS trying to get to Jennifer -\n               - Nunally kicking, flailing, spitting at Crawford - who's put\n               face-down on the floor, to get cuffed.\n               Nunally pulls free from the SWAT cops, distraught, angry -\n               going to retrieve his gun and shove it in his shoulder-\n               holster, struggling to regain control.\n\n                                        PARAMEDIC\n                           Wait a second - she's not dead!\n               Nunally whirls - everyone freezing, breathless, falling\n               silent.\n               The Paramedics kneeling around Jennifer work -\n               - as Crawford lies on the floor, staring at his wife. Like\n               she's a machine that defied astronomical odds and refused to\n               behave according to his calculations.\n\n               \n\n\n               EXT. CRAWFORD HOUSE - SOON AFTER\n\n               Jennifer's stretcher is loaded into an ambulance, doors\n               slamming shut and sirens kicking on -\n               - as Crawford, cuffed behind his back, is pushed into the\n               back seat of a police car. His eyes on the ambulance as it\n               pulls away, carrying his wife.\n\n               \n\n\n               INT. CRAWFORD HOUSE - SOON AFTER\n\n               A DETECTIVE uses a pencil to lift Crawford's gun from the\n               coffee table and carefully put it in an evidence bag.\n               Nunally stands back, watching the COPS and TECHNICIANS work\n               the scene - lost in his thoughts, shaken.\n\n                                        SWAT COMMANDER\n                           You all right?\n               Nunally \"wakes\" - nods.   Absently:\n\n               \n\n                                                                             15\n\n               \n\n               \n\n                                           NUNALLY\n                           Yeah.     I'm good.\n               To avoid talking more, he heads out to the glaring lights and\n               chaos outside.\n\n                                                              FADE OUT\n\n               \n\n\n               INT. WILLY'S APARTMENT - THE NEXT MORNING\n\n               The alarm clock shifts to 6:00 am and pops on to local news\n               and traffic -\n               - but the narrow futon bed is already empty.\n               WILLY SLOCUM works at a laptop on his second-hand desk, lit\n               by a solitary lamp.\n               He is in his late-20s, good-looking. Short hair, office-pale\n               but athletic, wearing mis-matched sweats from Eastern\n               Oklahoma State College.\n               He jots a final note, sets his yellow legal pad aside. As he\n               goes to the closet-sized bathroom, pulling off his sweatshirt\n               and starting the tiny pre-fab shower, we linger on the laptop\n               screen: rental listings for a new apartment.\n\n               TIME CUT\n               The bare overhead bulb is on, revealing the concrete floor\n               and painted-plywood walls. His clothes hang neatly on a\n               length of pipe suspended by ropes from the exposed rafters.\n               Law school texts fill cinderblock-and-board shelves.\n               The radio chatters.    Willy knots a tie in his crisp white\n               collar.\n\n               TIME CUT\n               Willy methodically packs legal folders from last night's\n               \"homework\" into his big, battered briefcase. He has to work\n               to stuff all the files in.\n               He pulls on his suit jacket, settles the shoulders, tugs at\n               his cuffs. Uncaps a pen, leans over a one-sentence letter\n               waiting on the desk. Reads it over.\n               As he signs, we glimpse:\n                   - hereby give notice that I will be resigning my\n                   position at the District Attorney's Office as of\n                   Novemb-\n\n               \n\n                                                                             16\n\n               \n\n               \n               Willy savors the moment.\n               Then he tucks the letter into an envelope, gets the heavy\n               briefcase - goes to shut off the light and open the door -\n               - which swings about six inches, then clonks into something.\n               Willy grimaces.   Peeks out, goes to pound on a wall.\n\n                                           WILLY\n                           Mrs. Demello?\n                                  (Beat)\n                           MRS. DEMELLO!    Your CAR!\n               Silence. He sighs.    Shuts the door and presses a button near\n               the light-switch.\n               There's mechanical grinding noise as the far wall slowly\n               rolls up, letting in daylight and revealing an alley beyond\n               the hanging clothes and cinderblock shelves.\n               He presses the garage-door-opener button again, and hurries\n               across the apartment to duck out under the closing door.\n\n               \n\n\n               EXT. ALLEY - CONTINUOUS\n\n               Willy straightens and takes a breath, re-settling his suit\n               jacket with an irritable glance at his landlady's car, parked\n               sloppily next to the garage, blocking his door.\n               As he walks away, down the alley, we rise up to reveal the\n               hazy sprawling landscape of L.A. - and the towers of\n               Downtown, rising ahead of Willy like Oz.\n\n                                        WILLY (V.O.)\n                           Come on, Phil: I called you as a\n                           courtesy, and you start looking to\n                           take advantage?\n\n               \n\n\n               INT. WILLY'S OFFICE - LATER THAT MORNING\n\n               An ancient fluorescent-lit cubby crammed with documents, case\n               files, notes, reference books. Willy on the phone:\n\n                                        WILLY\n                           I'm not knocking it down to a Class C.\n                           My backlog of open cases does not\n                           mitigate the fact that your client\n                           tried to kill his brother-in-law with -\n                           oh, right, a \"golfing accident\"? Your\n                           client owns one golf club and no golf\n\n                                        (MORE)\n\n               \n\n                                                                          17\n\n               \n\n               \n                                        WILLY (cont'd)\n                           balls - and the \"accident\" took place\n                           in the stairway of an illegal after-\n                           hours gambling club. Yeah, okay -\n                           I'll see you in court.\n               His cell phone rings.   As he gets it:\n\n                                        WILLY\n                           Well, I won't see you in court, but\n                           someone from this office will. You\n                           take it up with them, I gotta go.\n                                  (switching phones)\n                           Willy Slocum. Oh - hey, hi, yes.\n               Assistant District Attorney NORMAN CHANG (mid-30s) throws the\n               door open without looking:\n\n                                           NORMAN\n                           Wooton Sims?!\n               Willy holds up a finger, talking into his cell:\n\n                                           WILLY\n                           No, I didn't.     Wow.   Okay.\n               Norman mouths \"WOOTON SIMS?!\" repeatedly during:\n\n                                        WILLY\n                           No - short notice is...fine. No, I\n                           can. Black tie. Sure. What time?\n                           Okay. Yes. Thank her.\n               He hangs up, exhales slowly.    Looks at Norman.\n\n                                           NORMAN\n                                             Wooton - SIMS?!\n                           Wooton Sims?!\n\n                                        WILLY\n                           Please stop saying, \"Wooton Sims\" over\n                           and over. It's starting to sound like\n                           nonsense words.\n\n                                           NORMAN\n                           You asshole!\n\n                                        WILLY\n                           Okay: go back to \"Wooton Sims.\"\n               As Willy gets up and goes out, past Norman -\n\n                                        NORMAN\n                           How the hell did you get a job at\n                           Wooton Sims?! I can't even get an\n                           interview!\n\n               \n\n                                                                           18\n\n               \n\n               \n\n\n               INT. DISTRICT ATTORNEY'S OFFICE - DAY\n\n               Norman follows Willy out to a central bullpen area where the\n               shared ADMINISTRATIVE ASSISTANTS work: MONA and GLADYS.\n\n                                        NORMAN\n                           I've been here five years. I'm your\n                           supervisor. I graduated USC, summa!\n\n                                        WILLY\n                           We're just going to pretend he's not\n                           talking, okay?\n\n                          MONA                            NORMAN\n                 No problem.                     I'm serious.\n\n                                        WILLY\n                           I'm really jammed-up all day, and I\n                           need to rent a tuxedo - for tonight.\n\n                                         NORMAN\n                           A tuxedo?! Oh, come on!     You are so\n                           full of shit.\n\n                                        WILLY\n                                  (Jotting notes)\n                           There must be a place that does that,\n                           right - same day? I'm also gonna need\n                           a messenger to bring it here. This is\n                           my suit size and my shirt size...I\n                           really appreciate this.\n               Mona nods, taking notes as Willy gets out a credit card.\n               Other DDAs are gathering to soak up some vicarious kicks.\n\n                                        MONA\n                           What's going on?\n\n                                        WILLY\n                           Wooton Sims buys a whole lot of seats\n                           to this charity opera thing every\n                           year, because Bob Wooton is the\n                           chairman of this committee -\n\n                                        NORMAN\n                           \"Bob\" Wooton?!\n\n                                        WILLY\n                                  (Enjoying, mock-helpless)\n                           It's what the man told me to call him.\n\n               \n\n                                                                            19\n\n               \n\n               \n\n                                        GLADYS\n                           You're gonna need to pick out a style,\n                           Willy.\n\n                                           WILLY\n                           A style.\n\n                                        GLADYS\n                           For the tuxedo.\n               Willy hesitates, in over his head.   A DDA helpfully does the\n               Travolta finger-in-the-air pose.\n\n                                        WILLY\n                           I don't know - I just don't want to\n                           look like I'm going to the prom.\n\n                                        GLADYS\n                           You wanna go Classic.    Fix him up.\n\n                                        MONA\n                           We'll get you something Classic.\n                                  (Picks up a ringing phone)\n                           Willy Slocum's office.\n\n                                        NORMAN\n                           Make sure it comes with cuff-links and\n                           knee-pads.\n\n                                        WILLY\n                           Oh, that's very nice: it's good to be\n                           back in high school.\n\n                                          MONA\n                                    (Hanging up)\n                           Willy?\n               Her tone makes him - and everyone else - turn.\n\n                                        MONA\n                           God wants to see you.\n\n                                           WILLY\n                                  (Beat)\n                           Our God?\n\n                                        MONA\n                           Who art on the Eleventh Floor.\n               Willy, startled, looks around. Approving nods, raised\n               eyebrows. He tightens his tie and heads for the elevators.\n\n               \n\n                                                                           20\n\n               \n\n               \n\n                                        NORMAN\n                           There is no justice! There is no\n                           justice in the city of Los Angeles!\n\n               \n\n\n               INT. LOBRUTO'S OFFICE - SOON AFTER\n\n               District Attorney JOE LOBRUTO, 50-ish, sits behind a massive\n               oak desk, studying a thick file. Doesn't look up as a\n               SECRETARY shows Willy in.\n               Willy hesitates. Looks around: he's never been here. Flags,\n               wood panelling, leather furniture, windows overlooking the\n               city. Finally Lobruto looks up, takes Willy in.\n\n                                        LOBRUTO\n                           William No-Middle-Initial Slocum.\n\n                                        WILLY\n                           Yes sir.\n\n                                        LOBRUTO\n                           Sit.\n                                  (As Willy does:)\n                           Eighty-four-percent conviction rate.\n                           That's remarkable.\n\n                                        WILLY\n                           Thank you.\n\n                                         LOBRUTO\n                           With a case load thirty percent higher\n                           than any other first-year DDA.\n                                  (Beat)\n                           Of course - you also swapped more\n                           cases than the rest of them put\n                           together.\n               Willy considers his options.   He always does.\n\n                                        WILLY\n                           I offered my losing cases in exchange\n                           for two or three of anyone else's\n                           possible convictions. They couldn't\n                           handle their workloads, and I prefer\n                           not to lose.\n               Lobruto knew this; the question was would Willy admit it.\n\n                                        LOBRUTO\n                           You're going to need a middle initial.\n\n               \n\n                                                                           21\n\n               \n\n               \n\n                                           WILLY\n                           Sir?\n\n                                        LOBRUTO\n                           You're going to Wooton Sims.\n\n                                           WILLY\n                           In two weeks.\n\n                                        LOBRUTO\n                           You'll be able to afford a better\n                           suit. But those guys all play squash\n                           and have middle names. They go in for\n                           the mother's maiden name a lot.\n               Beat. Willy doesn't like the implied personal judgement, but\n               the only way it shows is how calm he stays.\n\n                                        WILLY\n                           My mother didn't have a maiden name.\n               Lobruto nods, unruffled by Willy's hard calm.\n\n                                        LOBRUTO\n                           So you're a bastard; sometimes I can\n                           be a son-of-a-bitch. Maybe you belong\n                           here.\n\n                                        WILLY\n                           I didn't work this hard to stay where\n                           I belong.\n\n                                        LOBRUTO\n                           You're a street-fighter, Willy. You\n                           should be in court. We can move you\n                           up to better cases.\n\n                                        WILLY\n                           I appreciate the offer.\n\n                                        LOBRUTO\n                           I didn't think so.\n                                  (Closes the file, stands)\n                           Well - you got your litigation\n                           experience. Your chops. And your\n                           juicy private sector job. Anything\n                           else the City of Los Angeles can do\n                           for you?\n               Willy's amused.    He stands, too.   As they shake hands:\n\n               \n\n                                                                             22\n\n               \n\n               \n\n                                        WILLY\n                           No, I think that's everything - thank\n                           you.\n\n                                        LOBRUTO\n                           The offer stands. If you get tired of\n                           carrying a spear.\n               Willy nods - but Lobruto notes the tiny flicker in his eyes:\n               not getting it and trying to cover. Lobruto smiles gently.\n\n                                        LOBRUTO\n                           It's an opera joke. Give my regards\n                           to Bob.\n\n               \n\n\n               INT. WILLY'S OFFICE - LATER\n\n               Willy's twisting in his rented tux, trying to adjust a buckle\n               on the side of the vest.\n               The phone rings and he gives up, frustrated - pushing the\n               plastic garment-bag aside to answer -\n               - knocking a full cup of take-out coffee on to his chair.\n               Which is where he left his suit.\n               Willy freezes. Watching the coffee seep into the fabric.\n               Into the phone, distracted:\n\n                                           WILLY\n                           Willy Slocum.\n\n                                                            INTERCUT WITH:\n\n               \n\n\n               INT. NORMAN'S OFFICE - THE SAME TIME\n\n               Norman's looking at a case file.\n\n                                        NORMAN\n                           I've got an Attempted Homicide.\n                           Conley caught it last night, but he's\n                           hung up in motions with Gardner.\n                           Arraignment in Part Seven, at three\n                           o'clock.\n\n                                        WILLY\n                           Three o'clock is in fifteen minutes.\n\n                                         NORMAN\n                           Thank you.   What's the temperature?\n\n               \n\n                                                                           23\n\n               \n\n               \n\n                                        WILLY\n                           I can't do it.\n\n                                        NORMAN\n                           You do still actually work here,\n                           Willy, right? I mean, you're still\n                           going to be cashing your paycheck for\n                           another two weeks and everything?\n\n                                           WILLY\n                              Just get somebody else for this one.\n\n                                           NORMAN\n                              Everybody's booked up. Look: it's not\n                              going to trial. There's a weapon with\n                              prints, and a confession. Take the\n                              arraignment and wait for the plea.\n\n                                            WILLY\n                                     (Beat)\n                              A real confession?\n\n                                           NORMAN\n                              Spontaneous and signed.   Come on,\n                              Willy.\n               Willy sighs.     Looking down at his coffee-soaked suit.\n\n                                            WILLY\n                              Okay.   Here's the problem.\n\n               \n\n\n               INT. NORMAN'S OFFICE - CONTINUOUS\n\n               Norman slowly smiles, listening.\n\n                                           NORMAN\n                              You know - I really wish I was going\n                              to see this.\n\n               \n\n\n               INT. COURTROOM - LATER\n\n               Willy slips self-consciously through the double-doors,\n               wearing the tuxedo.\n               He gets even more self-conscious when he notices a handful of\n               local REPORTERS. He hurries in -\n               - passing Nunally, in the back row. Nunally is making a good\n               show of keeping it together...but it's only a show.\n               JUDGE IRENE FELDMAN, 50-ish, looks over her half-glasses.\n\n               \n\n                                                                             24\n\n               \n\n               \n\n                                        JUDGE FELDMAN\n                           Mr. Slocum. Nice to see a man who\n                           dresses for court.\n\n                                        WILLY\n                           Sorry, your honor.    Long story.\n               Willy, hurrying to Prosecution Table, barely glances at the\n               Defense Table -\n               - but Crawford, sitting beside his PUBLIC DEFENDER in an\n               orange jumpsuit and handcuffs, never takes his eyes off\n               Willy, intrigued.\n\n                                        JUDGE FELDMAN\n                           Grapevine has it the punch-line is\n                           Wooton Sims.\n\n                                         WILLY\n                           Yes, ma'am.\n\n                                        JUDGE FELDMAN\n                           Good for you, double-oh-seven.\n                                  (Signaling the Bailiff)\n                           Let's see what public service is\n                           offering you by way of a send-off:\n\n                                        BAILIFF\n                           The State of California Versus Thomas\n                           Crawford.\n               The Defense rises; Crawford hardly pays any attention to the\n               Judge - glancing back and noticing Nunally, whose eyes bore\n               into him, haunted and burning.\n               Crawford stares at him impassively a second, then turns to\n               lean past his P.D. and watch Willy hastily skim the file.\n\n                                          JUDGE\n                           Mr. Crawford, you've been charged with\n                           section 664 slash 187 of the\n                           California Penal Code: Attempted\n                           Murder, with additional allegations of\n                           Assault With a Deadly Weapon - Penal\n                           Code section 245 dash A2, with Great\n                           Bodily Injury, P.C. Section 12022.07.\n                                   (Beat)\n                           Do you waive further reading of the\n                           complaint and complete statement of\n                           rights?\n\n               \n\n                                                                              25\n\n               \n\n               \n\n                          P.D.                              CRAWFORD\n                     (sotto)                    I do.     But, your honor -\n                 You do.\n\n                                        JUDGE FELDMAN\n                           And do you wish to enter a plea at\n                           this time?\n\n                                        CRAWFORD\n                           Not guilty. But I also want to waive\n                           my right to counsel, and represent\n                           myself.\n               Willy looks up from the file - startled.\n\n                                        JUDGE FELDMAN\n                           Do you have a problem with your\n                           appointed counsel, Mr. Crawford?\n\n                                        CRAWFORD\n                           No. I just want to do it myself.     I\n                           believe it's within my rights.\n\n                                        P.D.\n                           Your honor, if I could have a moment\n                           with my client -\n\n                                        CRAWFORD\n                           I'm not your client. Try and keep up,\n                           would you?\n               The P.D. shuts up, taken aback. The Judge considers\n               Crawford, thoughtful, then turns to Willy.\n\n                                        JUDGE FELDMAN\n                           Do the People have an objection or a\n                           comment for the record, Mr. Slocum?\n               Willy hesitates, held by Crawford's strange, amused gaze.\n               Shakes it off:\n\n                                        WILLY\n                           I'm sorry, your honor: we've got the\n                           weapon and a signed confession. I\n                           really think Mr. Crawford needs a\n                           competent attorney to - frankly -\n                           negotiate a plea.\n               Crawford reaches up with cuffed hands and adjusts an\n               imaginary bow-tie. Willy self-consciously touches where\n               Crawford indicated on his own collar, straightens his clip-\n               on.\n\n               \n\n                                                                             26\n\n               \n\n               \n               Crawford nods: you're welcome.    Willy turns to the Judge.\n\n                                        WILLY\n                           I - can't - this was supposed to be -\n                           with a pro se defendant, this is going\n                           to drag out for months - and I'm not\n                           even going to be here. The People\n                           request a continuance to -\n\n                                        CRAWFORD\n                           Excuse me? Your honor? I'm willing\n                           to waive my right to a preliminary\n                           hearing and go directly to a jury\n                           trial.\n                                  (To Willy)\n                           Does that help?\n\n                                        JUDGE\n                           You don't need to look out for Mr.\n                           Slocum, Mr. Crawford. The District\n                           Attorney's office can shift another\n                           prosecutor to the case -\n\n                                        CRAWFORD\n                           No, I like Mr. Slocum.\n               Beat.\n\n                                         JUDGE FELDMAN\n                           Mr. Slocum?   He likes you.\n\n                                         WILLY\n                           Terrific.\n\n                                        JUDGE FELDMAN\n                           Mr. Crawford seems to understand his\n                           rights and responsibilities.\n\n                                        WILLY\n                           All due respect, your honor, I'm\n                           worried this may turn into some sort\n                           of a - circus -\n\n                                        JUDGE FELDMAN\n                           I appreciate your concern for the\n                           dignity of my courtroom, Mr. Slocum -\n                           considering you're making the argument\n                           dressed as a game-show host.\n                           Unfortunately, the man is a tax-paying\n                           citizen, entitled by our Constitution\n                           to try and manipulate the legal\n                           system, like everybody else.\n                                  (turning)\n\n                                        (MORE)\n\n               \n\n                                                                              27\n\n               \n\n               \n                                       JUDGE FELDMAN (cont'd)\n                          As for you, Mr. Crawford, I strongly\n                          urge you to retain counsel. Lack of\n                          same will not be grounds for appeal.\n\n                                           CRAWFORD\n                           I understand.     Thank you.\n\n                                        JUDGE FELDMAN\n                           Are the People ready to go to trial\n                           without a preliminary hearing?\n               Willy hesitates, irritated. Looks through the file again.\n               Checks Crawford - waiting, polite.\n\n                                         WILLY\n                           Sure.   Why not.\n               Crawford smiles at him, as the Judge opens her calendar.\n\n               \n\n\n               INT. PARKING STRUCTURE - LATER\n\n               Willy, in his tux, comes out of a staircase and stops.   Rob\n               Nunally is waiting by Willy's parked car.\n\n                                        NUNALLY\n                           You're supposed to be good.\n               Willy takes him in - wary, seeing an edge of anger and fear\n               beneath the tough controlled cop manner.\n\n                                        WILLY\n                           Is that what I'm supposed to be?\n\n                                        NUNALLY\n                           I asked around. You're supposed to be\n                           top-notch - but to me it looks like\n                           you've got one foot out the door, and\n                           you're wiping the rest of us off the\n                           bottom of the other one.\n\n                                        WILLY\n                           I'm sorry to...disappoint you.\n               Nunally is silent - frustrated. The concrete walls and\n               ceilings echo from distant cars.\n\n                                        NUNALLY\n                           I took Crawford's confession.\n\n                                        WILLY\n                           And now you want mine?\n\n               \n\n                                                                            28\n\n               \n\n               \n\n                                          NUNALLY\n                             I'm here to warn you. Take this\n                             seriously, because it's serious. This\n                             guy is stone cold - and his wife - is\n                             lying in a hospital bed - with brain\n                             damage...\n               He struggles to keep himself under control.\n\n                                           WILLY\n                              Are you all right?\n\n                                           NUNALLY\n                              Are you gonna be on this, or what?\n\n                                           WILLY\n                              Yeah.  I'm on it.\n                                     (Gently)\n                              You got a confession. You took the\n                              gun out of his hand. It's done.\n\n                                           NUNALLY\n                              I'm just - telling you. Is that okay?\n                              Or are you too friggin' busy?!\n\n                                            WILLY\n                              No.   It's okay.\n               Willy waits.    Watching the tortured cop wrestle with demons.\n\n                                            NUNALLY\n                              Forget it.\n                                     (Beat)\n                              It's a lock. We're good.   Put him\n                              down. Bury him.\n               Willy nods.    Nunally turns and walks away, down a ramp.\n               Willy watches him go. Sad. Like he's watching Nunally\n               drown. But he's seen people drown before...and he's not\n               about to put out a hand. Might get pulled in himself.\n\n               \n\n\n               INT. CHANDLER PAVILION - LOBBY - LATER\n\n               Willy moves uneasily among clusters of laughing, chatting,\n               sparkling FORMAL-DRESSED PEOPLE.\n               NIKKI GARDNER joins him, strolling alongside. She's his age,\n               but her elegant dress, unlike his tux, was made for her.\n\n                                           NIKKI\n                              Are you a shark?\n\n               \n\n                                                                             29\n\n               \n\n               \n\n                                          WILLY\n                           Sorry?\n\n                                        NIKKI\n                           You've been circling the lobby for\n                           half-an-hour now, like if you stopped\n                           you'd die.\n\n                                        WILLY\n                           If I stopped, I'd be standing around\n                           with no one to talk to. At which\n                           point, death would be a relief.\n\n                                        NIKKI\n                           Why don't you talk to Bob?\n               Willy stops walking, getting a little careful.\n\n                                         WILLY\n                           \"Bob\" is talking to the Governor.\n                                  (Beat)\n                           Do I know you?\n               She puts a hand out, gently amused.\n\n                                        NIKKI\n                           Nikki Gardner. Senior Associate,\n                           Wooton Sims.\n\n                                        WILLY\n                                  (Shakes)\n                           Oh - hey, hi. It was your office that\n                           called, with the invitation.\n\n                                        NIKKI\n                           On Bob's orders.\n\n                                        WILLY\n                           Listen, I don't...actually know \"Bob.\"\n                           I mean, I've only met the man once.\n               Nikki nods, considering this.      And him.\n\n                                          NIKKI\n                           Interesting.\n               They're each conscious of an unexpected buzz of attraction.\n               The lobby lights flicker, breaking the spell a little. As\n               the CROWD begins to drift toward the auditorium doors:\n\n                                        NIKKI\n                           You like opera?\n\n               \n\n                                                                          30\n\n               \n\n               \n\n                                        WILLY\n                           Truth is, I haven't really had that\n                           much expos-\n\n                                           NIKKI\n                           Neither do I.\n               With a conspiratorial head-tip, Nikki moves toward the plaza\n               doors. Willy follows.\n\n               \n\n\n               EXT. ARTS CENTER - SOON AFTER\n\n               They stroll the emptying plaza, dressed to the nines.\n\n                                        NIKKI\n                           Bob assigned you to my team. I'll\n                           supervise your case-work, steer you\n                           through the office arcana, and\n                           generally keep an eye on you.\n\n                                        WILLY\n                           Kind of like a mentor.\n\n                                        NIKKI\n                           Kind of like a probation officer.\n               Beat. Willy nods, meeting Nikki's gaze as she looks to make\n               sure he's got it.\n\n                                           WILLY\n                           Okay.\n\n                                        NIKKI\n                           Wooton Sims expects absolute loyalty\n                           and a hundred-and-ten-percent\n                           performance. But: you get to work on\n                           legendary litigation. National,\n                           sometimes global, in scope. It's high-\n                           stakes. And cut-throat - even within\n                           the team. We burn out associates at\n                           an astonishing rate.\n\n                                        WILLY\n                           You're trying to scare me.\n\n                                           NIKKI\n                           Yes.\n\n                                        WILLY\n                           You're going to have to try harder.\n               She stops walking.   Studying Willy.\n\n               \n\n                                                                         31\n\n               \n\n               \n\n                                        NIKKI\n                           Can I ask you something personal?\n\n                                           WILLY\n                           Sure.\n\n                                           NIKKI\n                           Who are you?\n               Willy doesn't answer. Maybe uncertain what she means. Maybe\n               not wanting her to know. Or even not knowing, himself.\n\n                                        NIKKI\n                           We have a guy in our criminal\n                           division, fresh out of Yale, named\n                           Calvin Tyler. One of our very rich\n                           clients gets pulled over, D.U.I. -\n                           which is routine bullshit, so Calvin\n                           gets it. Against you. Next thing we\n                           know, Calvin is fired, and Bob Wooton,\n                           who has never even interviewed a\n                           junior associate before - let alone\n                           hired one - says you're on my team.\n               Willy weighs his options.    Decides to level:\n\n                                        WILLY\n                           It was a good bust, so Calvin came to\n                           me for a deal. I told him if he could\n                           arrange an interview for me with Mr.\n                           Wooton, I would throw the case. I\n                           laid out his arguments and evidence\n                           for him - and I showed him how I would\n                           lose. Calvin set up my appointment\n                           for the day after our court date.\n                           Then he did what I had suggested in\n                           court - and I wiped the floor with\n                           him. Your client got the maximum.\n                           Next day, I met with Mr. Wooton.\n                                  (Shrugs)\n                           Bob.\n               Beat.\n\n                                       NIKKI\n                           Wow. You know what's brilliant about\n                           that?\n\n                                           WILLY\n                           Yes.\n\n               \n\n                                                                          32\n\n               \n\n               \n\n                                        NIKKI\n                           You didn't actually do anything all\n                           that wrong.\n\n                                        WILLY\n                           Well - I wasn't entirely honest with\n                           Calvin.\n               His cell-phone rings.    He ignores it.\n\n                                        NIKKI\n                           You gonna get that?\n\n                                        WILLY\n                           Everyone I need to talk to is here.\n               They are both feeling the electricity in the air between them.\n               They wait the phone out, enjoying the forbidden insanity of\n               it. But then:\n\n                                        NIKKI\n                           We need to talk about your transition\n                           timetable.\n\n                                          WILLY\n                           All right.\n\n                                        NIKKI\n                           Bob believes in trial-by-fire. He\n                           wants you up-to-speed two weeks from\n                           Tuesday, because we're getting on a\n                           plane to Chicago for depositions in a\n                           class-action against our biggest\n                           client, Armstead Pharmaceutical.\n\n                                          WILLY\n                           No problem.\n               She studies Willy, trying to make sure he understands:\n\n                                        NIKKI\n                           That's catch-up on three years' work -\n                           and you haven't closed out your old\n                           job yet.\n\n                                        WILLY\n                           I'm good at trials.    Even by fire.\n               Beat.\n\n                                        NIKKI\n                           You know, a little bit of fear can be\n                           a very healthy thing to have.\n\n               \n\n                                                                                33\n\n               \n\n               \n\n                                        WILLY\n                           I'm looking forward to when I can\n                           afford the luxury of having some.\n               Nikki sighs, smiles.    Enjoying him, somewhat reluctantly.\n\n                                        NIKKI\n                           I'll have them put the Armstead\n                           materials in your new office.\n\n                                          WILLY\n                           Thanks.    Boss.\n               He watches her head off into the night. He remains, alone,\n               in his tuxedo, looking at the elegant glittering arts plaza.\n               Then he checks his cell-phone.     Dials.\n\n                                                               INTERCUT WITH:\n\n               \n\n\n               INT. FORENSICS LAB - LATER\n\n               MARCHAND, Senior S.I.D. (Scene Investigation Division) Tech,\n               works as he talks into a speaker-phone. He and Willy have\n               teamed-up often, and an underlying respect lets them mock\n               each other.\n\n                                          MARCHAND\n                           Marchand.\n\n                                        WILLY\n                           It's Willy Slocum.     What's up?\n\n                                        MARCHAND\n                           Your gun in that Palisades shooting is\n                           no good.\n\n                                        WILLY\n                           How can the gun be \"no good\"?\n\n                                        MARCHAND\n                           It's a perfectly good weapon. A\n                           Heckler & Koch nine-millimeter. It's\n                           just no good as evidence. It's never\n                           been fired.\n\n                                        WILLY\n                           It's the gun from the scene?\n\n               \n\n                                                                         34\n\n               \n\n               \n\n                                        MARCHAND\n                           Yep. Bought by Mr. Thomas Crawford\n                           and registered to his wife, about a\n                           month ago. Apparently a gift.\n\n                                        WILLY\n                           And between the shooting and arrest,\n                           this guy was locked inside his house.\n\n                                         MARCHAND\n                            Is that a question?\n\n                                         WILLY\n                            No, I mean, just: what's the point?\n                            Playing games with the gun. He's\n                            alone in the house with the victim,\n                            and he confessed - it's not like the\n                            gun's gonna get him off the hook.\n\n                                         MARCHAND\n                            Do you have a question I can answer?\n               Beat.   Willy shakes the puzzle off, irritated:\n\n                                         WILLY\n                            Look, our weapon is in that house\n                            somewhere. Get a team out to search\n                            it tomorrow morning.\n\n                                         MARCHAND\n                            Ya think?\n\n                                         WILLY\n                                   (Sighs, smiles)\n                            Thank you.\n               He shuts the phone. Takes a moment, looking around again at\n               where he is. Absently tugs at his tie and vest, lets the\n               case go. Heads in to the opera.\n\n               \n\n\n               INT. WILLY'S OFFICE - A WEEK LATER\n\n               Controlled chaos. A week's work has emptied the shelves and\n               cleared the surfaces, but the file-cabinet drawers are all\n               half-open: Willy sorts folders, neatly marking and packing\n               them. White \"trans-file\" storage boxes are piled all over.\n\n                                         MESSENGER (O.S.)\n                            Slocum?\n               Willy looks up, at a MESSENGER with another file box.\n\n               \n\n                                                                              35\n\n               \n\n               \n\n                                         WILLY\n                           Yeah.\n\n                                        MESSENGER\n                           Where do you want it?\n\n                                        WILLY\n                           The idea here is we're trying to take\n                           boxes out - not bring more in.\n\n                                        MESSENGER\n                           Is that the idea?\n               Willy sourly gestures to a chair; checks the label as the\n               Messenger sets it down -\n\n                                        WILLY\n                           Whoa - wait a second, this is a screw-\n                           up. I already have these documents.\n                           I sent this box: to the Defendant, at\n                           County.\n\n                                        MESSENGER\n                           I picked up at County.    Slip says\n                           bring 'em here.\n               Messenger holds out a clipboard. Willy reluctantly signs.\n               As the Messenger leaves, Willy cuts the tape and takes out a\n               folder. Opens it:\n               Crawford has scrawled NO in red marker across the top sheet.\n               Willy turns to the next page.     A big red NO across that, too.\n               Pulls out more documents - flips through: NO - NO - NO - NO -\n               red letters wriggling across the typed pages, like flip-book\n               animation.\n               Beat.   Disturbed, he picks up the phone, dials.\n\n                                                             INTERCUT WITH:\n\n               \n\n\n               INT. CRAWFORD HOUSE - THE SAME TIME\n\n               S.I.D. TECHS are taking the place apart: opening HVAC vents,\n               pulling books off shelves, upending chairs and tables,\n               removing drawers from cabinets.\n               Marchand, supervising, answers his cell-phone:\n\n                                         MARCHAND\n                            Marchand.\n\n               \n\n                                                                       36\n\n               \n\n               \n\n                                        WILLY\n                           Where are we on this gun?\n\n                                        MARCHAND\n                           We can't find it, Willy.\n\n                                        WILLY\n                           I'm in trial on Monday.\n\n                                       MARCHAND\n                           I know. I don't know what to tell\n                           you. I'm there now.\n\n                                        WILLY\n                           You said you'd get a team out a week\n                           ago -\n\n                                         MARCHAND\n                           I'm here now. My team has been here\n                           twice already.\n                                  (Beat)\n                           Do you really need it?\n\n                                        WILLY\n                           Do I need it?! The weapon?!\n               He takes a second.   Sighs, exasperated - but honest:\n\n                                        WILLY\n                           I don't know. Probably not.\n                           Defendant's a whack-job.\n\n                                        MARCHAND\n                           He went pro se, right?\n\n                                        WILLY\n                           Yeah. Just when you think they're not\n                           really stupid, they defend themselves.\n\n                                        MARCHAND\n                           You've got a confession and an\n                           airtight bunch of circumstantial.\n                                  (Apologetic)\n                           We've gone over this place top-to-\n                           bottom three times now, Willy.\n               Willy takes a breath.   Thinks it through.\n\n                                         WILLY\n                           Yeah, okay. Don't worry about it.\n                                  (Beat)\n                           Sorry - got a lot going on.\n\n               \n\n                                                                          37\n\n               \n\n               \n\n                                        MARCHAND\n                           Must be rough, figuring out what\n                           you're gonna do with all that money.\n\n                                        WILLY\n                           Hey, I had to sit through an opera\n                           last week.\n\n                                        MARCHAND\n                           Oh gee - lemme see if I can express\n                           how much sympathy I have:\n               Marchand snaps his phone shut.\n               Willy smiles, hangs up. But then his smile fades, as he\n               glances down again at Crawford's box of papers.\n               Hundreds of pages.   Every single one scrawled NO.\n               Willy considers them.\n\n               \n\n\n               INT. COUNTY JAIL - INTERROGATION ROOM - LATER\n\n               Metal chairs. Bad light. Crawford sits, cuffed, at a table,\n               waiting. Looks up as the door unlocks.\n               A GUARD lets Willy in, locks the door behind him.\n               Crawford watches Willy take a legal pad, files, pens from his\n               briefcase, set them on the table.\n\n                                        CRAWFORD\n                           How's my wife?\n\n                                           WILLY\n                           I don't know.\n\n                                        CRAWFORD\n                           I heard somewhere, I think it was on\n                           N.P.R., that you're supposed to talk\n                           to people in a coma. Play their\n                           favorite music. Supposedly it reaches\n                           them.\n               Willy, now ready, lets Crawford study him.\n\n                                        CRAWFORD\n                           You represent Jennifer. The voice of\n                           the victim, judicially speaking. But\n                           you haven't gone to see her?\n\n               \n\n                                                                    38\n\n               \n\n               \n\n                                        WILLY\n                           Not yet.\n\n                                        CRAWFORD\n                           Too busy getting up to speed on\n                           Armstead Pharmaceutical?\n               Beat.\n\n                                        WILLY\n                           I beg your pardon?\n\n                                        CRAWFORD\n                           I'm not judging you. I think anyone -\n                           coming from...what you came from -\n                           then paying your way through East-Okie\n                           Cowshit College and Tulsa Law by\n                           writing papers for Princeton kids on\n                           the internet - my God, it must have\n                           eaten your liver! Sixty-thousand\n                           dollars in debt, eighty-four percent\n                           conviction rate: you deserve this.\n               Willy tries to stay in control.\n\n                                        WILLY\n                           What the hell have you been doing.\n\n                                         CRAWFORD\n                           I'm permitted the use of a private\n                           investigator.\n\n                                        WILLY\n                           Not to investigate me!\n\n                                         CRAWFORD\n                           Why not?   You're investigating me.\n\n                                        WILLY\n                           You shot your wife.\n\n                                        CRAWFORD\n                           Allegedly. That's how it works,\n                           right? If I can't introduce something\n                           in court as evidence - it doesn't\n                           exist. Legally.\n\n                                        WILLY\n                           Look - I don't want to play games with\n                           you.\n\n                                        CRAWFORD\n                           I'm afraid you have to.\n\n               \n\n                                                                        39\n\n               \n\n               \n               Beat. Willy reconstructs his formal cool. Takes some pages\n               scrawled NO from a folder, pushes them across the table.\n\n                                        WILLY\n                           Is this some form of - communication?\n\n                                        CRAWFORD\n                           You sent me a box of papers.\n\n                                        WILLY\n                           It's called Discovery.       The State has\n                           a legal obliga-\n\n                                        CRAWFORD\n                           There's nothing in it, Willy. You\n                           haven't 'discovered' anything. Have\n                           you found the gun?\n               Beat.\n\n                                             WILLY\n                           Not yet.\n\n                                             CRAWFORD\n                           No.\n                                  (Beat)\n                           Does it bother you that I call you\n                           Willy?\n\n                                             WILLY\n                                    (Lies)\n                           No.\n               Crawford nods.    Pleased.    Leans forward.\n\n                                        CRAWFORD\n                           I'd like you to consider becoming my\n                           lawyer. I'll pay you. A lot of\n                           money.\n\n                                        WILLY\n                           I'm - prosecuting you.\n\n                                        CRAWFORD\n                           Yeah, but I'm offering you a chance to\n                           get on the right side of this whole\n                           mess while you still can.\n\n                                        WILLY\n                           Are you out of your mind?\n\n               \n\n                                                                             40\n\n               \n\n               \n\n                                        CRAWFORD\n                           I think - on advice of counsel - I'll\n                           decline to answer that one.\n               Willy studies him. Decides: it's an elaborate act.   Begins\n               to put away his papers.\n\n                                        WILLY\n                           I don't need the gun to convict you,\n                           by the way.\n\n                                        CRAWFORD\n                           She was cheating, you know.\n               Willy looks at him, slightly taken aback.   He didn't know; it\n               wasn't in the confession.\n               As he considers whether it makes a difference - he notices\n               Crawford watching, enjoying. Willy shuts his briefcase.\n\n                                        WILLY\n                           It doesn't matter what she did...Tom.\n                           What you did is a crime.\n\n                                        CRAWFORD\n                           Perhaps. But - maybe my so-called\n                           peers will look at me and see\n                           themselves. Betrayed. Frustrated.\n                           Humiliated. And you and I both know,\n                           Willy, that people have an infinite\n                           capacity for believing in their own\n                           innocence.\n\n                                         WILLY\n                           Great.   Take the stand. Tell your\n                           story.   I'd appreciate it.\n\n                                        CRAWFORD\n                           Not to mention the fact you have no\n                           actual evidence connecting me to the\n                           crime.\n               Willy smiles, gets up.\n\n                                        WILLY\n                           Except your confession.\n               Crawford watches him go to the door.\n\n                                        CRAWFORD\n                           My grandfather was an egg farmer.\n               Willy stops, annoyed.\n\n               \n\n                                                                      41\n\n               \n\n               \n\n                                         WILLY\n                            Is this gonna be about how you had a\n                            rough childhood?\n\n                                           CRAWFORD\n                            I used to candle eggs at his farm.\n                            You know what that is? You hold an\n                            egg up to a light, and look for\n                            imperfections.\n                                    (beat)\n                            The first time I did it, he told me to\n                            put the ones that were cracked or\n                            flawed in a bucket - for the bakery.\n                                    (beat)\n                            He came back an hour later and there\n                            were three hundred eggs in the bakery\n                            bucket. He asked me what the hell I\n                            was doing.\n                                    (beat)\n                            I found a flaw in every single one.\n                            Thin places in the shell, minuscule\n                            cracks.\n                                    (smiles)\n                            Look closely enough and you'll find\n                            everything has a weak spot...where it\n                            can break.\n\n                                         WILLY\n                            Looking for mine?\n\n                                         CRAWFORD\n                            No, I've found yours.\n\n                                         WILLY\n                            Illuminate me.\n               Crawford considers how to put it.\n\n                                         CRAWFORD\n                            You're a winner, Willy.\n               Silence.   Willy pushes the call-button by the door.\n\n                                            WILLY\n                            Huh. Well.      Joke's on me then, I\n                            guess.\n\n                                            CRAWFORD\n                            Yes.   It is.\n\n                                         WILLY\n                            I'll see you in court, Mr. Crawford.\n\n               \n\n                                                                           42\n\n               \n\n               \n               The door unlocks.   Crawford winks.\n               Willy hesitates for a second - then leaves.\n\n               \n\n\n               INT. WOOTON, SIMS - EMPTY OFFICE - LATER\n\n               It's big. It's got a window. It's got a sofa. Undecorated,\n               except for a pile of materials & boxes marked ARMSTEAD\n\n               PHARMACEUTICAL.\n               Willy is filling out forms - tax, citizenship, benefits.   He\n               doesn't notice Nikki when she comes to the door.\n\n                                          NIKKI\n                             Make sure you sign the one with the\n                             devil in blood. It's not binding\n                             otherwise.\n               He looks up, smiles.\n\n                                          WILLY\n                             Just want to be ready for Chicago.\n                             I'm all closed-out, downtown. Last\n                             trial starts Monday.\n               Beat.   Not pleased:\n\n                                          NIKKI\n                             You've got a trial Monday?\n\n                                          WILLY\n                             Yeah: attempted murder.\n\n                                          NIKKI\n                             That gives you three days. You told\n                             me - and I told Bob - that you would\n                             be ready to hit the ground r-\n\n                                          WILLY\n                             The man confessed.    And he's pro se.\n\n                                          NIKKI\n                             Willy, some but acting as his own\n                             lawyer - he could drag it out for\n                             months!\n\n                                          WILLY\n                             You want to hear his witness list?\n               Nikki nods.   Willy is silent.     She frowns.\n\n               \n\n                                                                              43\n\n               \n\n               \n\n                                           NIKKI\n                           No witnesses?\n               Willy leans in, enjoying this part - analyzing, even\n               admiring, Crawford's ploy:\n\n                                           WILLY\n                              It's kind of clever: this guy is\n                              trying to provoke the system into\n                              declaring him insane. I think he\n                              thinks we'll call in the doctors and\n                              he can fake 'em out by refusing the\n                              defense. He's acting out this really -\n                              organized plan to appear crazy.\n               Beat.   Nikki considers Willy.\n\n                                           NIKKI\n                              You're gonna miss being in court,\n                              aren't you?\n               He studies her, confident.    Gestures to the stacks of\n               Armstead materials:\n\n                                           WILLY\n                              I'm almost halfway through these. And\n                              I think I've already found about six\n                              disqualifiers in Delaware, Ohio, and\n                              Florida. I have to check case law in\n                              each state, but it looks good. I'll\n                              get the rest done over the long\n                              weekend.\n               Nikki sighs, smiles a little, against her will.      He's won her\n               over...again.\n               Willy shrugs, grins.    In the silence, the impossible\n               electricity returns.    After a moment - to defuse it:\n\n                                           NIKKI\n                              You don't go home for Thanksgiving?\n               Slight beat.\n\n                                           WILLY\n                              No.\n               She studies him a moment, thoughtful.    Careful.\n\n                                           NIKKI\n                              If you want - you're welcome at mine.\n                              My family's.\n\n               \n\n                                                                                44\n\n               \n\n               \n\n                                           WILLY\n                            Really?\n               She nods. Smiling a little, knowing her family and starting\n               to know Willy:\n\n                                         NIKKI\n                            I think it would be interesting.\n               Beat.\n\n                                           WILLY\n                            Yeah.    Okay, thank you.\n\n                                           NIKKI\n                            Cool.\n               Beat.   She leaves.    Willy doesn't go back to work right away.\n\n               \n\n\n               INT. COURTROOM - THE NEXT DAY\n\n               JUDGE ROBINSON presiding. A mid-sized crowd, including a few\n               REPORTERS. A UNIFORM COP is in the witness box, Willy stands\n               in the Prosecution Table.\n\n                                         UNIFORM COP\n                            We established a perimeter around the\n                            house and then waited for SWAT and the\n                            Negotiator. It was strictly by the\n                            book.\n\n                                         WILLY\n                            So the house was completely surrounded\n                            within how long of the first shots?\n               Crawford sits alone at the Defense Table. He wears an\n               expensive suit and no handcuffs, but two DEPUTIES sit behind\n               him. He's barely listening to the testimony - drawing on his\n               legal pad: intricate, dense complex diagrams of \"Rube\n               Goldberg\" contraptions.\n\n                                         UNIFORM COP\n                            Maybe ten minutes.\n\n                                         WILLY\n                            And when you arrived at the sc-\n               Crawford noisily tears a page off his pad.     Looks up - sees\n               Willy, and everyone else, turned to him.\n\n                                           CRAWFORD\n                            Sorry.\n\n               \n\n                                                                           45\n\n               \n\n               \n               Willy sighs, returns to the Cop.\n\n                                        WILLY\n                           When you arrived on the scene, was\n                           there a crowd?\n\n                                        UNIFORM COP\n                           Oh yeah. Neighbors, came out to look\n                           soon as it started.\n\n                                        WILLY\n                           And from what you could ascertain, no\n                           one went into or came out of the house\n                           until SWAT and the negotiator arrived?\n\n                                        UNIFORM COP\n                           Definitely not.\n\n                                         WILLY\n                           Thank you.   No further questions.\n\n                                           JUDGE ROBINSON\n                           Mr. Crawford?\n               Crawford looks up from his drawing.\n\n                                           CRAWFORD\n                           What?\n\n                                        JUDGE ROBINSON\n                           Your witness, Mr. Crawford.\n               Crawford takes in the Uniform Cop.\n\n                                        CRAWFORD\n                           No questions for this witness.\n               Willy watches Crawford return diligently to his doodles.\n\n                                                            DISSOLVE TO:\n\n               \n\n               CLOSE-UP: THE DEFENSE TABLE - LATER THAT AFTERNOON\n               It's a mess of loose legal-pad pages torn from Crawford's\n               pad, each covered in madly intricate schematics. He works on\n               yet another, head down, intent.\n               Dr. MARION KANG is on the stand, using a marker on a big\n               diagram of a head:\n\n               \n\n                                                                             46\n\n               \n\n               \n\n                                        DR. KANG\n                           - through the frontal cortex and the\n                           temporal lobe, coming to rest against\n                           the back of the skull.\n\n                                        WILLY\n                           So this bullet inflicted serious\n                           injury?\n\n                                        DR. KANG\n                           It inflicted serious and irreparable\n                           injury.\n               Willy nods, allowing the jury time on this. He checks a note-\n               card, glances at Crawford. Considers his options.\n\n                                        WILLY\n                           Dr. Kang, is it safe to say that\n                           someone inflicting this kind of wound\n                           intended to kill?\n               Judge Robinson gives Willy a warning look.\n\n                                        JUDGE ROBINSON\n                           Mr. Crawford, you might want to\n                           object. The witness can't know your\n                           state of mind.\n               Crawford doesn't even look up from his drawing.\n\n                                        CRAWFORD\n                           No thank you, your honor.\n               Willy gives Judge Robinson an I-told-you-so shrug.     Turns to\n               Dr. Kang.\n\n                                        KANG\n                           I would say so, yes.\n\n                                        WILLY\n                           Thank you, Dr. Kang.\n               Crawford tears off the page, starts another.\n\n               \n\n\n               INT. COURTROOM - LATER\n\n               Nunally on the stand.    Focused, professional.   Crawford\n               draws, ignoring him.\n\n                                        WILLY\n                           So after you put down your gun, what\n                           did Mr. Crawford do?\n\n               \n\n                                                                             47\n\n               \n\n               \n\n                                        NUNALLY\n                           He confessed to shooting his wife.\n\n                                         WILLY\n                           He confessed.\n                                  (Beat)\n                           Did Mr. Crawford appear confused or in\n                           any way intoxicated, impaired?\n\n                                       NUNALLY\n                           No. Not at all. He knew what was\n                           going on.\n\n                                        WILLY\n                           What did Mr. Crawford say?\n               Nunally looks at Crawford, enjoying the fatal blow:\n\n                                        NUNALLY\n                           He said, \"I got the gun and I shot my\n                           wife. God help me, I shot her in the\n                           head. I know it was wrong.\"\n\n                                        CRAWFORD\n                                  (low, still drawing)\n                           Objection.\n               Everyone turns, surprised.\n\n                                        JUDGE ROBINSON\n                           I'm sorry - Mr. Crawford, did you say\n                           something?\n               Crawford sets aside his pen for the first time.   Looks up.\n\n                                         CRAWFORD\n                           Yes.   I want to object.\n\n                                        JUDGE ROBINSON\n                           On what grounds?\n\n                                           CRAWFORD\n                           I don't know.\n\n                                           WILLY\n                           Your honor -\n\n                                        CRAWFORD\n                           I don't know what you'd call it. They\n                           - it wasn't the first time, either,\n                           but - I don't know the legal term.\n\n               \n\n                                                                            48\n\n               \n\n               \n\n                                        JUDGE ROBINSON\n                           Why don't you just explain it in\n                           layman's terms.\n\n                                        CRAWFORD\n                           Fucking the victim.\n               Uproar in the court.\n\n                                        JUDGE ROBINSON\n                           Mr. Crawford -\n\n                                        CRAWFORD\n                           You said layman's terms -\n\n                                          WILLY\n                           Your honor -\n\n                                        CRAWFORD\n                           I'm sorry - what would you call it -\n                           legally - when the officer who\n                           arrested you has been having sexual\n                           intercourse with your wife?\n               Utter silence. Willy whirls a look at Nunally.     The cop\n               meets his eyes - a deer in headlights.\n\n                                           WILLY\n                                  (Low)\n                           Oh - shit.\n\n                                        CRAWFORD\n                           I think it's objectionable - maybe I'm\n                           wrong.\n\n                                           WILLY\n                           Your honor...\n\n                                        JUDGE ROBINSON\n                           Detective Nunally?\n               Nunally looks down, silent.    Shaking his head.\n\n                                           CRAWFORD\n                           Rob?\n\n                                        WILLY\n                           Your honor, the People request a -\n               Nunally suddenly launches himself over the witness box rail\n               to attack Crawford - as the Deputies leap forward to stop him -\n               all of them flailing and cursing in a tangle -\n\n               \n\n                                                                          49\n\n               \n\n               \n               - spectators screaming, fleeing, gawking.   Chaos.\n\n               \n\n\n               INT. JUDGE ROBINSON'S CHAMBERS - SOON AFTER\n\n               The Judge grim, Willy panicked, Crawford calm.\n\n                                        WILLY\n                           He had my witness list.   He should\n                           have filed to suppress.\n\n                                        CRAWFORD\n                                  (Shrugs)\n                           My mistake. Sorry.\n\n                                        JUDGE ROBINSON\n                           Mr. Crawford, I warned you about\n                           representing yourself.\n\n                                        CRAWFORD\n                           What about the fact that it's true?\n                           I mean, isn't that the point here: to\n                           get to the truth?\n\n                                        JUDGE ROBINSON\n                           Mr. Slocum - is it true?\n\n                                        WILLY\n                           I don't know. I only heard about it\n                           five minutes ago.\n\n                                        CRAWFORD\n                           Put him back on the witness stand if\n                           you don't believe me.\n\n                                        WILLY\n                           We can't put him back on now! Not\n                           after what the jury just saw. Your\n                           honor, I told you this would turn into\n                           a circus. First he provokes the\n                           witness with an outrageous allegation -\n\n                                        CRAWFORD\n                           My Dick has evidence.\n               The Judge and Willy look at Crawford like he's truly insane.\n\n                                        JUDGE ROBINSON\n                           Excuse me?\n\n                                        CRAWFORD\n                           My investigator. I call him Dick. I\n                           guess I should call him as a rebuttal\n\n                                        (MORE)\n\n               \n\n                                                                                50\n\n               \n\n               \n                                         CRAWFORD (cont'd)\n                           witness? He's got phone records,\n                           credit receipts, photographs,\n                           videotapes - all documenting the\n                           affair. In graphic detail.\n                                  (Beat. Mildly:)\n                           Dick is good.\n               The Judge looks at Willy.    This is bad.    Thinking fast:\n\n                                        WILLY\n                           Okay - um: I'll stipulate that my\n                           witness was less than forthcoming\n                           ...and that can more or less cancel\n                           out the fact that the defendant\n                           withheld a crucial -\n\n                                        JUDGE ROBINSON\n                           Mr. Slocum - your witness was intimate\n                           with the victim, and he assaulted the\n                           defendant during the arrest.\n\n                                         CRAWFORD\n                           Actually, while obtaining my so-called\n                           \"confession.\"\n               Willy stares at Crawford, shaken.    Understanding the trap.\n\n                                         WILLY\n                           No way.   Your honor -\n\n                                        JUDGE ROBINSON\n                           He's got a point. They were alone in\n                           the house. The confession is no good.\n\n                                        WILLY\n                           Oh - come on!\n\n                                        CRAWFORD\n                           Is this a legal argument?       \"Oh come\n                           on\"?\n\n                                        WILLY\n                                  (Whirls on him)\n                           You want to get into it?!\n               Crawford raises his eyebrows. Awkward silence.         Willy takes\n               a deep breath. Turns to the Judge.\n\n                                           WILLY\n                           Sorry.\n                                  (Beat)\n                           He dictated and signed his confession,\n                           after that incident.\n\n               \n\n                                                                              51\n\n               \n\n               \n\n                                        JUDGE ROBINSON\n                           In police custody. Arguably, in fear\n                           for his life. I'm sorry, Mr. Slocum -\n                           it's all 'fruit of the tainted tree.'\n                           We have to exclude all versions of the\n                           confession and any evidence collected\n                           by Lieutenant Nunally or by other\n                           police officers on the night he was\n                           present.\n\n                                        WILLY\n                           This is insane!\n\n                                        CRAWFORD\n                           It's Biblical, isn't it?   The fruit\n                           and the tree and -\n\n                                        WILLY\n                           He set this up! Don't you see what\n                           he's doing?!\n\n                                        JUDGE ROBINSON\n                           Yes, I do. And I don't like it. But\n                           it's done, so we have to deal with it.\n\n                                        CRAWFORD\n                           Do you think I could go home today,\n                           your honor? With Thanksgiving around\n                           the corner -\n\n                                         JUDGE ROBINSON\n                           Don't push it, Mr. Crawford.\n                                  (Beat)\n                           What we're going to do is give Mr.\n                           Slocum a few days to regroup and come\n                           up with new evidence. If he doesn't -\n                           then you can go home. That's going to\n                           put us into the long weekend. We\n                           reconvene Monday morning.\n               Willy just stands there: blind-sided, shell-shocked.\n               Crawford smiles at him.\n\n               \n\n\n               INT. WILLY'S OFFICE - THAT EVENING\n\n               The end of a bad, bad day.   Willy flips on the lights as he\n               comes in, shaken.\n               A package is on the empty desk. Addressed in red marker.\n               The return address: TC, County Jail.\n               Willy just stands looking at it.\n\n               \n\n                                                                              52\n\n               \n\n               \n\n\n               INT. COUNTY JAIL - THE SAME TIME\n\n               Crawford sits on the metal bunk in his prison jumpsuit.\n               Alone. Looking down.\n\n               \n\n\n               INT. WILLY'S OFFICE - RESUME\n\n               As Willy takes a letter-opener from the desk drawer - the\n               phone rings. He answers it, eyes still on the package:\n\n                                           WILLY\n                           Willy Slocum.\n\n                                                             INTERCUT WITH:\n\n               \n\n\n               INT. GLAMOROUS BAR - THE SAME TIME\n\n               Crowded with UPSCALE YOUNG PROFESSIONALS.    Nikki is on her\n               cell-phone, hand over her other ear:\n\n                                        NIKKI\n                           Well - you've gotta admire the\n                           cleverness of it.\n               Willy begins cutting open the package as he talks:\n\n                                           WILLY\n                           Do I?\n\n               \n\n\n               INT. COUNTY JAIL - CONTINUOUS\n\n               Crawford very slowly raises his eyes, until he is looking\n               directly at us.\n\n                                        NIKKI (V.O.)\n                           Come on, Willy - give the devil his\n                           due.\n\n                                         WILLY (V.O.)\n                           Yeah. I'm just trying to figure out\n                           what that is.\n\n               \n\n\n               INT. WILLY'S OFFICE/GLAMOROUS BAR - RESUME\n\n\n                                        NIKKI\n                           Okay: then listen - I checked with Bob\n                           on how he wants you to handle this.\n\n                                        (MORE)\n\n               \n\n                                                                             53\n\n               \n\n               \n                                        NIKKI (cont'd)\n                           Has LoBruto tried to take you off the\n                           case yet?\n\n                                           WILLY\n                           No.\n\n                                        NIKKI\n                           Well, he pretty much has to if he's\n                           gonna save any face. So here's the\n                           strategy: you let him.\n               Willy cautiously lifts the box's flaps - pulls aside tissue\n               paper - to reveal:\n               A single eggshell.   Broken, empty.\n\n                                           WILLY\n                           I let him?\n\n               \n\n\n               INT. COUNTY JAIL - CONTINUOUS\n\n               Crawford begins to smile.\n\n                                        NIKKI (V.O.)\n                           Yeah, damage control. Stop getting\n                           your face on TV. As it is, I had to\n                           talk Bob down from cancelling your\n                           contract.\n\n               \n\n\n               INT. WILLY'S OFFICE/GLAMOROUS BAR - RESUME\n\n               Willy is staring down at the broken eggshell, barely\n               listening to Nikki.\n\n                                        NIKKI (CONT'D)\n                           But we've got to move fast and get out\n                           from under. Otherwise, and I quote:\n                           \"Stick a fork in this kid's ass and\n                           turn him over, he's done.\"\n\n                                        WILLY\n                           I can't just - walk away.\n\n                                        NIKKI\n                           Willy: today, you got killed. The\n                           issue now is saving your new life.\n               Willy can't take his eyes off Crawford's \"gift.\"\n\n                                        WILLY\n                           I guess...that would be the smart way\n                           of looking at it.\n\n               \n\n                                                                                   54\n\n               \n\n               \n\n\n               INT. COUNTY JAIL - CONTINUOUS\n\n               Crawford stares right at us.       Smiling.   Ice cold.\n\n               \n\n\n               INT. WILLY'S OFFICE/GLAMOROUS BAR - RESUME\n\n               Nikki is sympathetic, misunderstanding Willy's quiet:\n\n                                           NIKKI\n                              You want to come out and get drunk?\n\n                                           WILLY\n                              No. Thank you. I've got some stuff\n                              to take care of.\n\n                                             NIKKI\n                              All right.    Don't beat yourself up.\n\n                                             WILLY\n                              I won't.\n               He hangs up.    Considering the empty eggshell.       But then he\n               looks up:\n               District Attorney Lobruto is in his office doorway, trying to\n               decide whether to be angry.\n\n                                           LOBRUTO\n                              You don't look into who the victim\n                              was sleeping with?\n               Willy burns, ashamed.       But unable to admit it.\n\n                                           WILLY\n                              He - threw me off.\n                                     (Frustrated)\n                              Look, Crawford knew he'd be the prime\n                              suspect, so he gave us everything -\n                              but he made it all radioactive. The\n                              night this went down, it was over.\n\n                                           LOBRUTO\n                              But you still walked   it into court,\n                              Willy. We might not    have a case...but\n                              it didn't have to be   a public\n                              humiliation for this   office and the\n                              police department.\n               Silence.\n\n               \n\n                                                                    55\n\n               \n\n               \n\n                                       WILLY\n                          Are you taking me off?\n\n                                       LOBRUTO\n                          You're leaving anyway.\n\n                                       WILLY\n                          I'm starting to get a sense of this\n                          guy.\n\n                                       LOBRUTO\n                          That's not new evidence.\n\n                                       WILLY\n                          I can take him now: he thinks he's\n                          smarter than I am.\n\n                                       LOBRUTO\n                          It's not about you, Willy.\n\n                                       WILLY\n                          Yeah, it is. He made it that way.\n                                 (Shows him the egg)\n                          He likes me.\n\n                                       LOBRUTO\n                          What is that - some kind of Oklahoma\n                          insult?\n\n                                       WILLY\n                          Let me do this. I won't make you look\n                          bad.\n               Beat.\n\n                                         LOBRUTO\n                          No. You won't. That's what I need to\n                          make sure you understand. I remove\n                          you now: I'm covered, I took some\n                          action.\n                                  (Beat)\n                          If you go on with this, when you lose -\n                          blame has to come down. And it'll\n                          come down on you. I'll have to\n                          investigate you for improprieties,\n                          incompetence - anything I can. In\n                          public. I'll hang you out to dry.\n                          For the good of this office.\n               Silence.\n\n                                       WILLY\n                          If I lose.\n\n               \n\n                                                                             56\n\n               \n\n               \n\n                                           LOBRUTO\n                             What?\n\n                                          WILLY\n                             You said \"when.\"\n               Lobruto grimaces.     He shakes his head.    Sighs.\n\n                                           LOBRUTO\n                             All right.   It's yours.\n               Willy nods.   Stubborn.    Scared.\n\n               \n\n\n               INT. MOTEL ROOM - LATER THAT NIGHT\n\n               Local news on the TV: Willy pushing past media outside the\n               courthouse; official photo of Nunally; footage from the\n               standoff at Crawford's.\n               The sound is low, and Nunally isn't watching. He's sitting\n               on the edge of the bed...looking down at his gun, in his\n               hands.\n               A knock on the door \"wakes\" him. Beat. He sets the gun\n               aside, goes to peek out the curtains. Lets Willy in.\n\n                                          WILLY\n                             You're not easy to find.      I had to\n                             call Internal Affairs.\n\n                                          NUNALLY\n                             Yeah - they put me on a desk - 'til\n                             this gets...sorted out.\n               He uncomfortably watches Willy glance around at the half-\n               empty liquor bottle, the mismatched suitcases and paper bags\n               full of balled-up clothes. And the gun on the bed.\n\n                                          NUNALLY\n                             Got home - my wife already took the\n                             kids to her folks. Press is all over\n                             our front lawn. Friggin' vampires.\n               He falters, haunted by the echo.      Willy doesn't notice:\n\n                                          WILLY\n                             What the hell were you thinking.\n                             You're on the job and you get called\n                             to your girlfriend's house -\n\n               \n\n                                                                            57\n\n               \n\n               \n\n                                       NUNALLY\n                          I didn't know it was her house.      I'd\n                          never been there.\n\n                                           WILLY\n                              It was her name!\n\n                                           NUNALLY\n                              I didn't know her name!\n               Willy waits.    Nunally explains, reluctant to expose himself:\n\n                                           NUNALLY\n                              No last names. Her rules. We met at\n                              the same hotel room, twice a week - no\n                              phone calls, no questions. She didn't\n                              want us to know too much about each\n                              other. She said it was like...travel\n                              in a foreign country. No baggage -\n                              from our lives. Just us. Escaping.\n\n                                           WILLY\n                              Did you get the feeling she had rules\n                              because she had done it before? With\n                              other guys?\n\n                                            NUNALLY\n                              No.  I don't know. Maybe.\n                                     (Thinking, remembering:)\n                              No. It was all just this...crazy\n                              thing. For both of us. It was...\n                              real. You know? We didn't expect\n                              that, when we started. We didn't know\n                              where it was going. I had cheated so\n                              many times, I was numb - but she was\n                              ...new. And she made me feel like\n                              there was - some chance. To change.\n                              We were scared. It was like we were\n                              afraid to go forward, but we couldn't\n                              go back.\n                                     (Beat)\n                              You always think you have time. To\n                              work it out. Or make things right.\n                                     (Angry)\n                              What was I supposed to do?!\n\n                                           WILLY\n                              You were supposed to tell me!\n\n                                             NUNALLY\n                              I'm married!    I have kids!\n\n               \n\n                                                                               58\n\n               \n\n               \n\n                                        WILLY\n                           You thought nobody knew - so maybe you\n                           could just walk away clean.\n\n                                        NUNALLY\n                           No! I didn't think HE knew! OKAY?!\n                           Even - after. I thought it was just -\n                           massively fouled-up...bad luck. Like -\n                           God - telling me - something.\n                                  (Anguished)\n                           I'm there. My mind is going crazy. I\n                           know the confession won't hold if\n                           anyone finds out.\n                                  (Beat)\n                           I thought the guy was a whack!\n\n                                            WILLY\n                              Yeah?   Well, he's not.\n               Nunally won't look at Willy.      He just sits there, numb.\n\n                                           WILLY\n                              Is there anything else you can give\n                              me. Anything that might get us some\n                              evidence.\n               Nunally shakes his head.      Willy grimaces.   Goes to the door.\n\n                                           NUNALLY\n                              I...tried to warn you.\n               Willy stops.    Looks back.\n\n                                           WILLY\n                              You warned me he was smart. You\n                              didn't warn me you were stupid.\n               Nunally winces. Takes it. Willy feels a little badly.         Two\n               guys in a shabby motel room, in terrible trouble.\n\n                                           NUNALLY\n                              How do we get the confession back in?\n\n                                             WILLY\n                              We don't.\n\n                                           NUNALLY\n                              What are you gonna do?\n               Willy shakes his head.     Walks out.\n\n               \n\n                                                                             59\n\n               \n\n               \n\n\n               INT. CRAWFORD HOUSE - THE NEXT DAY\n\n               A massive search is under way.\n               Marchand's S.I.D. Team has been doubled, back-up by a dozen\n\n               SHERIFF'S DEPUTIES -\n               - passing hand-held metal detectors along the furniture -\n               - taking pictures down from the walls -\n               - turning over mattresses - patting-down every item hanging\n               in the closets -\n               - wriggling into crawlspaces - poking into light fixtures\n               recessed into the ceilings -\n               - opening the air-conditioning unit, up on the roof -\n               - ripping out Crawford's high-end home-theater system -\n               - taking apart the Porsche in the garage.\n               Willy paces the edges of the action, restless, edgy.\n\n               \n\n\n               INT. CRAWFORD HOUSE - KITCHEN - LATER\n\n               Willy stops in the doorway - watching a DEPUTY shut the\n               stainless-steel freezer, open a wired-glass cabinet and poke\n               around.\n\n                                          WILLY\n                             Shake the boxes.\n\n                                          DEPUTY\n                             Huh?\n\n                                          WILLY\n                             The cereal boxes - shake 'em. And\n                             there's a chicken in the freezer.\n                             Thaw it out, check inside.\n               The Deputy stares like he's nuts. Willy doesn't blink.    The\n               Deputy goes to shake the boxes, eyes on Willy: okay?\n               Willy nods.   Moves on.\n\n               \n\n\n               EXT. CRAWFORD HOUSE - FRONT DOOR - LATER\n\n               Hours have passed.\n\n               \n\n                                                                             60\n\n               \n\n               \n               Willy steps out of the front door, because he's going stir-\n               crazy inside. Stands watching two TECHS walk the lawn and\n               flower-beds with metal detectors.\n               He notices, past the S.I.D. vans and Sheriff's Dept. black-\n               and-whites parked in the driveway:\n               Nunally, in his parked car, across the street.\n               He meets Willy's eyes.    Worried.\n               Willy can't give him any news. So he pretends he didn't see\n               the question in Nunally's eyes, looks away. Takes a breath,\n               turns and goes back in to work.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - DUSK\n\n               It's getting dark out. Techs pack equipment cases, carry\n               them out. The place is a disaster area.\n               Marchand watches Willy pace the living room.\n\n                                          WILLY\n                           The garage?    Washer-dryer?\n\n                                        MARCHAND\n                           And the tool shed, and the roof, and\n                           the H.V.A.C. ducts.\n\n                                        WILLY\n                           What about the door frames?    The\n                           floors?\n\n                                        MARCHAND\n                           What did he do: rip open a door frame,\n                           hide the gun inside and re-plaster the\n                           wall before SWAT showed up?\n\n                                        WILLY\n                           What about the neighbors' property?\n                           He could have thrown it over the\n                           hedges.\n\n                                         MARCHAND\n                           We checked.\n                                  (Beat)\n                           He might have passed it off to\n                           somebody, Willy. Had an accomplice,\n                           waiting, out the back.\n               Willy shakes his head, grim.    Pacing.\n\n               \n\n                                                                            61\n\n               \n\n               \n\n                                        WILLY\n                           This isn't an accomplice sort of guy.\n               He slows. Looking across the room at the big Rube Goldberg\n               device. As he moves toward it:\n\n                                        WILLY\n                           This is a...guy who likes to show off.\n               He examines the intricate workings, eyes travelling the\n               clutter of metal and wires and motors.\n               Checks Marchand - who shakes his head.\n\n                                         WILLY\n                           You sure?\n\n                                         MARCHAND\n                           I'm sure.\n               Willy grimaces.   Fuming, relentless:\n\n                                        WILLY\n                           It's a physical object. It can't just\n                           vanish. We're missing something -\n                           some step in the story.\n               He begins walking through the crime, \"the stations of the\n               cross\" - re-enacting it, starting from the front door,\n               methodical, reciting it to himself:\n\n                                        WILLY\n                           The neighbor sees her get home. He's\n                           already inside. She lets herself in.\n                           A minute or two later: blood-pattern\n                           says she's standing over there - he's\n                           somewhere around here.\n               Willy stands where Crawford was.     Raises a finger-gun.\n\n                                         WILLY\n                           Boom.\n               As Willy goes to where Jennifer fell:\n\n                                        MARCHAND\n                           But then he carries her back there.\n                           Why?\n               Willy walks along the path defined by the drops of blood:\n\n               \n\n                                                                             62\n\n               \n\n               \n\n                                        WILLY\n                           Because he's gonna need time. To\n                           confess. When she's alone with the\n                           cop.\n               Willy stops in the alcove, looking down at the dried blood,\n               the discarded paramedic-supply-wrappers.\n\n                                        MARCHAND\n                           Neighbor comes to the door.\n               Willy nods, comes out - crosses to the foyer:\n\n                                        WILLY\n                           Crawford shouts, \"Leave us alone\" and\n                           fires three more rounds: boom-boom-\n                           boom.\n\n                                        MARCHAND\n                           So everybody knows he's dangerous -\n                           and she might still be alive.\n\n                                         WILLY\n                           So they'll call the Negotiator.\n                                  (Beat)\n                           Now he's got about ten minutes.\n               And that's it. He stands there with the imaginary gun in his\n               hand. Looking around. Trying to think like Crawford.\n               He can't.\n\n                                        MARCHAND\n                           I'm sorry, Willy.\n               Willy won't respond - because accepting the apology means\n               admitting he's got nothing left.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LATER\n\n               It's night. The house is empty. Except for Willy, turning\n               on lights as he gets to each room, turning them off as he\n               leaves.\n\n                                        WILLY (V.O.)\n                           Do you dare stay out?\n                           Do you dare go in?\n               Studying framed photos: Jennifer - now and then with Crawford -\n               in Italy, Bermuda, Colorado. Always a bit posed and formal\n               when they're together.\n\n               \n\n                                                                             63\n\n               \n\n               \n\n                                        WILLY (V.O.)\n                           And IF you go in -\n                           Should you turn left or right?\n                           Or right and three-quarters?\n                           Or maybe not quite.\n\n               \n\n\n               INT. CRAWFORD HOUSE - BATHROOM - SOON AFTER\n\n               Checking the contents of the medicine cabinet.\n\n                                        WILLY (V.O.)\n                           You can get so confused that you'll\n                             start in to race,\n                           Down long wiggled roads at break-\n                             necking pace\n               No longer really looking for the gun.   He's looking for\n               insight. Contact. A way in.\n\n               \n\n\n               INT. CRAWFORD HOUSE - DRESSING ROOM - SOON AFTER\n\n               Willy wanders through Jennifer's spacious dressing room.\n\n                                         WILLY (V.O.)\n                           And grind on for miles across weirdish\n                             wild space,\n                           Headed I fear, toward a most useless\n                             place.\n               He idly surveys the vanity, cluttered with cosmetics, skin-\n               care products. Lifts her perfume, sniffs.\n\n                                        WILLY (V.O.)\n                           The Waiting Place...\n                           For people just waiting.\n                           Waiting for a train to go\n                           Or a bus to come, or a plane to go\n               Notices a storage box on the floor, left partly-open in the\n               search. He shifts the lid aside.\n\n                                        WILLY (V.O.)\n                           Or the mail to come, or the rain to go\n                           Or the phone to ring, or the snow to\n                           snow\n               A high-school yearbook. An old photo album. A teddy bear.\n               A snow-globe. A well-worn book by Dr. Seuss.\n\n               \n\n                                                                             64\n\n               \n\n               \n\n                                        WILLY (V.O.)\n                           Or waiting around for a Yes or No\n                           Or waiting for their hair to grow.\n                           Everyone is just waiting.\n               Willy stares down at the souvenirs of a lost life.\n\n               \n\n\n               INT. HOSPITAL - I.C.U. - NIGHT\n\n               The room is dim, and silent except for the hiss-click of the\n               respirator, the monotonous beep of the heart monitor.\n\n                                        WILLY (V.O.)\n                           Waiting for the fish to bite\n                           Or waiting for wind to fly a kite\n                           Or waiting around for Friday night\n                           Or waiting perhaps for their Uncle\n                             Jake\n               Jennifer Crawford lies with her head wrapped in gauze, eyes\n               shut, plastic tubing down her throat held in place with tape.\n               Willy sits beside her bed, reading Dr. Seuss:\n\n                                        WILLY\n                           Or a pot to boil, or a Better Break\n                           Or a string of pearls, or a pair of\n                             pants\n                           Or a wig with curls...\n                           Or Another Chance.\n               He stops reading a moment.   Watching her:\n\n                                        RESIDENT (O.S.)\n                           What are you doing?\n               Willy turns. A work-weary RESIDENT comes past him to check\n               the I.V.'s and monitors. He's about Willy's age.\n\n                                        WILLY\n                           I heard it might - help - if somebody\n                           talked to her.\n\n                                        RESIDENT\n                           Who told you that?\n\n                                        WILLY\n                                  (Reluctantly)\n                           The man who shot her.\n               The RESIDENT looks up at Willy - who shrugs, uncomfortable.\n\n               \n\n                                                                     65\n\n               \n\n               \n\n                                        WILLY\n                           Is there any chance...she might come\n                           out of this?\n\n                                        RESIDENT\n                           Are you a member of the family?\n\n                                         WILLY\n                                  (Getting out ID)\n                           Sorry. I'm with the District\n                           Attorney's office.\n                                  (Beat)\n                           We don't have any other witnesses.\n\n                                        RESIDENT\n                           This woman had a bullet plow through\n                           her brain.\n\n                                         WILLY\n                           I know. But you hear about people\n                           waking up from comas. After everybody\n                           said pull the plug - they wake up.\n                                  (Beat)\n                           You hear stuff like that all the time.\n\n                                         RESIDENT\n                           You hear about Elvis and Aliens, too.\n                           All the time.\n\n                                        WILLY\n                           It's not impossible, though. Is it?\n                           I mean - why else are you keeping her\n                           like this?\n               Beat.   The Resident sighs.\n\n                                          RESIDENT\n                            No. It's not impossible. But even if\n                            she did, she might not remember how to\n                            talk - let alone anything about how\n                            she was shot.\n\n                                         WILLY\n                            When I was here alone before, she\n                            moved a little.\n\n                                         RESIDENT\n                            Are you just going to keep asking the\n                            same question in different ways until\n                            you hear the answer you want?\n               Beat.\n\n               \n\n                                                                              66\n\n               \n\n               \n\n                                        WILLY\n                           That's how it works with the law.\n\n                                        RESIDENT\n                           I knew I should have gone to law\n                           school.\n               Willy watches the Resident go out. Then he looks back down\n               at Jennifer. Listening to the machines.\n\n               \n\n\n               INT. CRAWFORD OFFICE - THE NEXT DAY\n\n               Willy wanders.   Tina, the assistant, waits in the doorway.\n               He's trying to conceal the fact that he's on a fishing\n               expedition.\n\n                                        WILLY\n                           So this is all exactly how he left it.\n\n                                         TINA\n                           Yes.\n               Browses a wall of framed photos: Crawford at crash sites,\n               universities, engineering test-labs - awards, certificates,\n               articles from industry publications lauding Crawford as the\n               Go-To-Guy for investigating mechanical failures of aircraft.\n\n                                        WILLY\n                           And he was - distraught.\n\n                                        TINA\n                           He was drinking. The past few weeks.\n\n                                        WILLY\n                           But he was working on this.\n               He stands over unfinished Rube Goldberg device.   Tools laid\n               out on the work table - meticulous, organized.\n\n                                        WILLY\n                           All distraught and everything.\n               It's not evidence.\n\n                                        TINA\n                           Do you want coffee.    He said I should\n                           ask.\n               Willy turns, a little rattled.    Beat.\n\n               \n\n                                                                          67\n\n               \n\n               \n\n                                         WILLY\n                            Tell him I said no thank you.\n\n               \n\n\n               INT. HOTEL ROOM - DAY\n\n               The room where Jennifer and Nunally met. Cleaned-up now,\n               anonymous, empty. Willy stands looking at it.\n               There's nothing to see. He grimaces, nods - heads out, past\n               the ASSISTANT MANAGER waiting in the doorway.\n\n               \n\n\n               INT. HOTEL CORRIDOR - CONTINUOUS\n\n               As Willy comes out of the room - he slows, noticing the\n               little gray plastic surveillance-camera-ball in the ceiling.\n\n                                         WILLY\n                            How long do you keep the tapes?\n\n                                             ASSISTANT MANAGER\n                            A month.\n               Willy considers it.     He's got nothing else to try.\n\n                                         WILLY\n                            Can I get a copy of October 9th?\n\n                                         ASSISTANT MANAGER\n                            I'll have it for you Friday.\n\n                                         WILLY\n                            I'm kind of under the gun here.\n\n                                         ASSISTANT MANAGER\n                            We're short-staffed tonight and\n                            tomorrow.\n               Beat.   Seeing Willy's confusion:\n\n                                             ASSISTANT MANAGER\n                            Thanksgiving?\n               Willy nods, trying to pretend he hasn't forgotten:\n\n                                             WILLY\n                            Right.   Okay.\n\n               \n\n                                                                             68\n\n               \n\n               \n\n\n               INT. GARDNER HOUSE - DINING ROOM - LATER\n\n               A faux-Tudor Hancock Park dining room.   Wealthy, but lived\n               in.\n               JUDGE LEWIS GARDNER, your basic Henry Fonda/Jimmy Stewart-\n               type patriarch, carves a turkey at the head of a long table,\n               wearing a worn and gravy-splattered apron. Platters\n               circulate in both directions among Nikki's older siblings\n               (BURTON and SANDRA), their spouses, their children.\n               Willy sits next to Nikki, who is high-stylish despite the\n               fact that she's dressed \"casual.\"\n\n                                        GARDNER\n                           White or dark, Willy?\n\n                                        WILLY\n                           Anything is fine, your honor.\n\n                                        GARDNER\n                           I'm off-duty, you can call me Lew.\n               While Gardner piles turkey on a plate and passes it:\n\n                                        WILLY\n                           So - is everyone in this family\n                           involved in the law?\n\n                                        SANDRA\n                           Well, Nikki's not.\n\n                                        NIKKI\n                           Ha ha.\n                                  (To Willy:)\n                           Burton's a counsel for Sierra Club,\n                           and Sandra's ACLU - so they use the\n                           holidays as an opportunity to give me\n                           a hard time, because I can buy and\n                           sell them.\n\n                                        SANDRA\n                           We're not actually for sale, Nick.\n               Nikki gives Willy a did-I-tell-you? look.\n\n                                        GARDNER\n                           Nicole decided early-on that black\n                           sheep was the most effective role in\n                           which to distinguish herself from her\n                           siblings.\n\n               \n\n                                                                     69\n\n               \n\n               \n\n                                         NIKKI\n                            You know of any other family in\n                            America where the corporate lawyer\n                            who's going to make partner by thirty-\n                            five is the \"black sheep\"?\n\n                                         GARDNER\n                            Well - you may be lost beyond\n                            recovery, but maybe we can still\n                            convince Willy that defending giant\n                            corporations against injured citizens\n                            is not the best use of his skills.\n\n                                         WILLY\n                            I don't think so, sir.\n                                   (smiles)\n                            It's where the money is.\n\n                                         GARDNER\n                                   (Scolding mildly)\n                            I believe that phrase refers to banks.\n                            And it was coined by a thief.\n               Beat.   Willy remains polite, but won't back down.\n\n                                         WILLY\n                            Times have changed.\n\n                                         NIKKI\n                                   (To Willy)\n                            You don't have to do this.\n\n                                          WILLY\n                            I don't mind; I get this kind of thing\n                            now and then.\n                                   (to Gardner)\n                            Almost always from people with money.\n\n                                         GARDNER\n                            Appearances can be deceiving, Willy.\n                            I grew up with eight brothers and\n                            sisters on a farm up in Fresno, and I\n                            promise you I saw my share of hard\n                            times.\n               Willy considers his options.\n\n                                         WILLY\n                            My mom OD'd fairly frequently, so they\n                            put me in a Group Home. My younger\n                            sister is dead and my older brother is\n                            doing twenty-five-to-life.\n\n               \n\n                                                                       70\n\n               \n\n               \n               Awkward silence.\n\n                                             GARDNER\n                             You win.\n               Beat.   Willy looks down, begins to eat again.\n\n                                             WILLY\n                             I usually do.\n\n                                            GARDNER\n                                      (Gently)\n                             Yes.    I see that.\n\n                                          BURTON\n                             I don't know if you will against the\n                             wife-shooter, though.\n               The click of silverware.\n\n                                             SANDRA\n                             Whoops.\n\n                                             NIKKI\n                             Nice, Burton.\n               Beat.   Willy looks up at Burton, steady.     Shrugs.\n\n                                          WILLY\n                             It's not over 'til it's over.\n\n                                          BURTON\n                             That looked pretty over.\n\n                                          NIKKI\n                             Anyway, Willy's been taken off the\n                             case.\n\n                                          GARDNER\n                             It might not seem like it now, but\n                             that's a blessing in disguise, Willy.\n               Willy nods.   Beat.     To Nikki, uncomfortable:\n\n                                             WILLY\n                             I wasn't.\n               Nikki looks at Willy.\n\n                                             NIKKI\n                             What?\n\n               \n\n                                                                          71\n\n               \n\n               \n\n                                         WILLY\n                           Taken off.\n\n                                        NIKKI\n                           That...doesn't make any sense.\n                           Lobruto has to do some kind of damage\n                           control -\n\n                                         WILLY\n                            I asked him not to.\n               Silence.   Nikki is staring at him.    Angry.\n\n                                         NIKKI\n                            You are really stupid, did you know\n                            that?\n               Willy doesn't know how to handle this; everyone else tries to\n               be polite, eating and pretending not to notice.\n\n                                         WILLY\n                            I'm - getting new evidence -\n\n                                         NIKKI\n                            Where? The Evidence Store?! Oh,\n                            that's right - they open early the day\n                            after Thanksgiving. You're gonna be\n                            fine!\n\n                                         WILLY\n                            Did it ever occur to you I might be\n                            good enough to still win?!\n\n                                          NIKKI\n                                        Who cares?!\n                            Win what?\n\n                                         WILLY\n                            The man shot his -\n\n                                         NIKKI\n                            You wanted corporate, right?! You\n                            wanted to play in the big leagues?!\n\n                                         WILLY\n                            Yeah, I'm just -\n\n                                         NIKKI\n                            You go to all that trouble getting\n                            yourself in - and then you just pay no\n                            attention to wh-\n\n               \n\n                                                                             72\n\n               \n\n               \n\n                                        WILLY\n                           Look - I'm sorry - can we not talk\n                           about this here?!\n               Nikki stops. Refusing to look around.     Ashamed at losing\n               control, turns back to her food:\n\n                                        NIKKI\n                           Fine.\n\n                                        WILLY\n                           Thank you.\n               Everyone eats in silence a moment - then Nikki tosses down\n               her napkin:\n\n                                        NIKKI\n                           I need to talk with you.\n               She gets up and walks out of the room. With an awkward\n               glance around, Willy excuses himself and follows her.\n\n               \n\n\n               EXT. GARDNER HOUSE - FOYER - CONTINUOUS\n\n\n                                        WILLY\n                           Look, I'm sorry I didn't tell you -\n\n                                        NIKKI\n                           Did you hear me, when I said Bob\n                           wanted you gone as soon as this thing\n                           broke?! Did you hear me say I went\n                           out on a limb to convince him -\n\n                                        WILLY\n                           Wouldn't it be better than damage\n                           control if I actually turn it around?\n\n                                        NIKKI\n                           And what if you don't?\n               Willy has no answer. He doesn't think that way. And she\n               sees that. She sees a young man from Oklahoma, in way over\n               his head. Desperate to get through:\n\n                                         NIKKI\n                           You don't get it at all, do you?! You\n                           pulled a stunt to get yourself this\n                           job. Fine: you're a hot-shot!\n                                  (Beat)\n                           Wooton Sims does not need hot-shots.\n                           Because you don't win. The firm wins.\n                           Bob wins.\n\n                                         (MORE)\n\n               \n\n                                                                           73\n\n               \n\n               \n                                          NIKKI (cont'd)\n                                   (Beat)\n                            And you just put yourself head-to-head\n                            in conflict with Bob.\n               Silence.   Shaken:\n\n                                         WILLY\n                            What am I supposed to do?\n\n                                         NIKKI\n                            We told the man you're getting on a\n                            plane to Chicago, Tuesday.\n               Painful silence.\n\n                                            WILLY\n                            Yeah.   Okay.\n               Nikki watches him dealing with it, sympathetic. The\n               impossible feelings always running under the surface for them\n               have developed a darker, aching tone. If anything, stronger.\n\n                                         WILLY\n                            I think maybe I'm gonna go now.\n\n                                          NIKKI\n                            All right.\n                                   (Beat)\n                            Call if you want.\n               He nods. Neither one moves. Judge Gardner enters cautiously\n               from the dining room - breaking the spell.\n               Nikki nods goodbye to Willy, and goes out quickly without\n               meeting her father's eye. Awkward pause.\n\n                                         WILLY\n                            I've got some work to do.\n                            I need to call a cab.\n               Gardner nods respectfully, but doesn't move quite yet.\n               Studying the torn-up young man.\n\n                                         GARDNER\n                            You know what nobody understands about\n                            certain kinds of underpaid public\n                            service work? Now and then you get to\n                            put a fucking stake in a bad guy's\n                            heart. We're not supposed to talk\n                            about that when we visit a third-grade\n                            class on Career Day, and it doesn't\n                            get you very far into the country-club\n                            locker room - but it's hard to beat\n                            when you actually get to do it.\n\n               \n\n                                                                               74\n\n               \n\n               \n               Willy looks at the kindly old judge, a little surprised.\n               Gardner shrugs: my two cents.      He goes to a side-table, finds\n               the Yellow Pages.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LATER THAT NIGHT\n\n               Empty.   Dark.   Willy lets himself in.\n               He looks for the light-switch - finds only a complex\n               computerized dimmer-panel. He tries it.\n               Accent lights come on, buried in the living room planters.\n               He can't get any other pre-sets to work.\n               The crime scene is creepy, lit like that. The dried blood is\n               black. Shadows stretch up the walls, strange.\n               Willy grimaces, moves through it - sees another panel by the\n               French doors to the garden. Goes over -\n               - and jumps back, startled -\n\n                                          WILLY\n                            Shit!\n               - by Nunally, on the other side of the glass.\n               Catching his breath, Willy stares. He unlocks the French\n               doors and Nunally steps in, uneasy, haggard.\n\n                                         WILLY\n                            The hell are you doing here?\n               Nunally looks around - taking a pint bottle from his overcoat\n               pocket, uncapping it.\n\n                                         NUNALLY\n                            We need to talk.\n               He drinks, then offers the bottle.     Willy hesitates, takes\n               it. As he drinks:\n\n                                         NUNALLY\n                            We have to find the gun.\n               Willy winces at the liquor and the remark, hands back the\n               bottle.\n\n                                         WILLY\n                            Thank you, Professor Einstein. It\n                            would also be good to find a couple of\n\n                                         (MORE)\n\n               \n\n                                                                                 75\n\n               \n\n               \n                                        WILLY (cont'd)\n                           eyewitnesses. If one could be the\n                           Dalai Lama, it would be even better.\n\n                                           NUNALLY\n                              No - Willy: we need to find the gun.\n\n                                           WILLY\n                              I've had three different teams here -\n\n                                            NUNALLY\n                              He didn't leave between the shooting\n                              and when we took him out in cuffs.\n                              The gun is here.\n                                     (beat)\n                              So we have to find it.\n\n                                           WILLY\n                              Well - we can't! You want to move on?\n               Nunally tosses something from an inside pocket of the coat -\n               - Willy catches it.       A Heckler & Koch nine-millimeter in a\n               plastic bag.\n               Willy stares down at it. Then at Nunally, who holds up: a\n               bullet, deformed by impact.\n\n                                           NUNALLY\n                              There's a guy in the Evidence Room,\n                              owes me a favor. Well - it's not so\n                              much a favor as I know stuff about\n                              him. He can trade this for the bullet\n                              from Jennifer, give us a ballistic\n                              match.\n               Beat.\n\n                                             WILLY\n                              It's a crime.\n\n                                           NUNALLY\n                              So who's gonna get away with a crime -\n                              this asshole, or us?\n               Willy sighs.    Tosses the gun back.\n\n                                             WILLY\n                              Go home.\n\n                                           NUNALLY\n                              What else have you got?!\n\n                                           WILLY\n                              I'll find a way.\n\n               \n\n                                                                                  76\n\n               \n\n               \n               Beat.\n\n                                           NUNALLY\n                           No you won't.\n               Willy watches Nunally stalk out through the big, strangely-\n               lit room. The front door opens, and slams.\n               A little worried, Willy takes a deep breath.       Gets to work.\n               He still has three days to break this open.\n               Walking through the crime again.\n               Playing it out in his mind. Standing in different places,\n               getting different perspectives.\n               Willy stands in the alcove.    Looking around.\n               There's something here.     But he can't get it.\n               His eye falls on the Rube Goldberg device.       Moves closer,\n               peering into the mechanism.\n               Turns away: no gun. But now he's facing the big wooden bowl\n               of ball-bearings, sitting out in the middle of the room on\n               the coffee table.\n               Hide in plain sight.\n               He walks over - pushes his fingers in, feels around.\n               Nope. He sighs. Takes a ball-bearing, rolls it in his hand.\n               Goes to the device - drops the ball in the slot.\n               The machine is amazing. The ball rolls and leaps and\n               clatters - lights flash, elevators rise and fall, at one\n               point the ball lifts on a jet of compressed air - then it\n               spirals out of sight and reappears somewhere unexpected -\n               - until at the end the ball suddenly catapults out and sails\n               across the living room -\n               - to land neatly back in the bowl on the coffee table.\n               Willy grimaces.   This guy is really good.\n\n               \n\n\n               INT. MARCHAND'S OFFICE - S.I.D. - SUNDAY AFTERNOON\n\n               A mess of courtroom exhibits, copies of evidence, lists,\n               depositions, photos, diagrams, take-out food containers and\n               coffee cups.\n\n               \n\n                                                                            77\n\n               \n\n               \n               Marchand surveys it.    The bleary end of a long day - sifting\n               clues, dead-ends.\n\n                                           MARCHAND\n                           Willy.     There's nothing here.\n               Willy has barely slept all weekend. He shakes his head,\n               reviewing the hotel surveillance tapes on a VCR/TV, stubborn.\n\n                                        WILLY\n                           Guns don't just walk out of crime\n                           scenes.\n               Marchand waves copies of Crawford's evidence - stills printed\n               from home-video Dick took at a hostage negotiation: Nunally\n               doing his job, his methods, his routine.\n\n                                        MARCHAND\n                           Two months before he shot his wife,\n                           this guy had his investigator watching\n                           the cop at work. He knew exactly how\n                           it would go down - and he didn't leave\n                           any loose ends.\n\n                                        WILLY\n                           Then what is this:\n               Willy uses the remote. On the TV, in black-and-white:\n               Jennifer and Nunally come out of their room and head for the\n               pool - indistinct figures zip jerkily in and out of rooms on\n               fast-forward -\n               - until he slows it: Crawford comes to let himself in.\n\n                                        WILLY\n                           Hotel surveillance.     From that day.\n                           He was there. Why?\n               Marchand watches over Willy's shoulder.    Shrugs.\n\n                                        MARCHAND\n                           Had to see it for himself.\n\n                                           WILLY\n                           See what?     They were out at the pool.\n\n                                        MARCHAND\n                           The unmade bed. Her panties. Man's\n                           gonna shoot his wife in the head, he\n                           needs to get himself all worked up.\n               Willy stares at the grainy black-and-white figure emerging\n               from the room, walking away down the corridor. Unconvinced:\n\n               \n\n                                                                               78\n\n               \n\n               \n\n                                           WILLY\n                           Yeah.     Worked up.\n               Marchand gets his jacket, pulls it on.\n\n                                        MARCHAND\n                           Willy, go home. Tomorrow you go back\n                           into court and take your lumps - then\n                           you start your cushy new life, and you\n                           forget all about this one.\n                                  (Hoping to get a smile:)\n                           And then you can lend me money and\n                           shit.\n               Willy says nothing.    Runs the tape back and then slow-motions\n               it forward again.\n               Marchand goes out.    Leaving Willy alone, watching Crawford.\n\n                                                             DISSOLVE TO:\n\n               \n\n\n               INT. WILLY'S APARTMENT - VERY LATE THAT NIGHT\n\n               Willy stands over crime scene photos and diagrams spread out\n               on his narrow futon. \"Walking the scene\" again, on paper.\n               The whole apartment is an array of law books, notes,\n               exhibits, marked-up depositions.\n               He's staring at evidence he's already stared at a hundred\n               times.\n               He grinds the palms of his hands into his eye sockets, a dull\n               moan rising into a yell -\n               - as he sweeps everything off his bed in a storm of paper -\n               throwing books - tearing up printouts - pulling out drawers,\n               emptying them, smashing them on the desk -\n               - yelling in a frenzy until his throat is hoarse, his shabby\n               garage apartment is trashed, and he's sitting, exhausted, in\n               his chair.\n               There's a knock on the door.\n               Willy frowns, checking the clock: it's two-thirty a.m.   He\n               goes to open it -\n               - revealing Nunally, standing in the darkness, a haunted\n               shadow of the boyish confident cop we met making love to\n               Jennifer Crawford.\n\n               \n\n                                                                             79\n\n               \n\n               \n\n                                        NUNALLY\n                           It's done. In the tool shed: taped to\n                           the blade, inside the lawn-mower.\n               Before Willy can say anything - Nunally walks away.\n               Willy doesn't move.   Watching the tormented cop disappear\n               down the alley.\n\n               \n\n\n               INT. DISTRICT ATTORNEY'S OFFICE - BULLPEN - THE NEXT MORNING\n\n               Willy - in a clean suit and crisp suit, carrying his\n               briefcase - hurries through, paying no attention to the\n               SECRETARIES and OTHER D.D.A.s who watch like he's on his way\n               to his own execution.\n               At his office door, he gestures for Mona to come in with him.\n               Surprised, she gets up - taking with her an envelope with a\n               messenger-receipt taped to the front.\n\n               \n\n\n               INT. WILLY'S OFFICE - CONTINUOUS\n\n               Mona watches Willy shut the door behind her.\n\n                                           MONA\n                           You okay?\n\n                                         WILLY\n                           Yeah.  Maybe.\n                                  (Hesitates)\n                           Can I ask you to do something for me\n                           this morning?\n\n                                           MONA\n                           Sure.\n\n                                        WILLY\n                           Write down your cell number.\n                                  (As she does)\n                           Once my trial is in session, wait\n                           outside. I might call - and just hang\n                           up. If I do, I want you to come into\n                           court and whisper to me that we got a\n                           tip about the murder weapon.\n\n                                           MONA\n                           You found it?\n               Beat.\n\n               \n\n                                                                             80\n\n               \n\n               \n\n                                        WILLY\n                           I haven't decided yet.\n               Mona studies Willy - then accepts it's don't-ask-don't-tell,\n               hands him her number. Willy nods, grateful.\n               Turning for the door, she remembers the envelope in her hand.\n\n                                        MONA\n                           Oh: this came for you.\n               He takes it, and as she leaves, checks the return address:\n               Wooton Sims.\n               Willy grimaces, opens it. Inside are an airline ticket to\n               Chicago - first class - and a handwritten note, on Wooton\n               Sims stationery:\n                             We only win the favor of the Gods\n                                   by making a sacrifice\n                                      See you tomorrow\n                                           - Nikki\n               He stands in his empty office, considering the ticket and the\n               note.\n\n               \n\n\n               INT. COURTHOUSE - CORRIDOR - CONTINUOUS\n\n               Willy steps off the elevator, into a crowd of REPORTERS AND\n               SPECTATORS outside the courtroom.\n               He's startled for a moment: it's worse than he expected - the\n               dense buzz of talk in the marble corridor and all the eyes\n               tracking him like he's walking into an arena - a freakshow\n               performer -\n               - but he doesn't slow, ignoring the comments and questions,\n               avoiding eye contact -\n               - until he sees Nunally by the courtroom doors, his eyes\n               fixed on Willy.\n               Willy meets Nunally's gaze...moving on, giving back nothing.\n               Nunally watches Willy disappear into the courtroom, stares at\n               the closing doors - uncertain, on edge. Lost, no matter\n               which way this goes.\n\n               \n\n                                                                             81\n\n               \n\n               \n\n\n               INT. COURTROOM - SOON AFTER\n\n               Mr. Gifford, the Crawford's neighbor, is on the stand.   Willy\n               questions him, standing by the Prosecution Table.\n               Behind him, the court is standing-room-only. REPORTERS,\n               SKETCH ARTISTS, SPECTATORS. Nunally, sitting near the front.\n               Lobruto, standing at the back.\n               Crawford writes intently on a legal pad, filling pages with\n               dense scribble.\n\n                                        WILLY\n                           So - between the time you heard the\n                           first gunshot and called 911, and the\n                           time of Mr. Crawford's arrest - you\n                           had the Crawford house in view?\n\n                                       GIFFORD\n                           Yes. I was very concerned about\n                           Jennifer. She was a lovely woman.\n\n                                        WILLY\n                           No one but Thomas Crawford came in or\n                           out?\n\n                                        GIFFORD\n                           That's correct.\n\n                                        WILLY\n                           Thank you, Mr. Gifford.    No further\n                           questions.\n\n                                           JUDGE ROBINSON\n                           Mr. Crawford?\n               Crawford glances up at the Judge. Then at Gifford, as if\n               he's just noticed him up there. Beat. Without getting up:\n\n                                        CRAWFORD\n                           Did you see the guy run out the back\n                           door?\n\n                                           GIFFORD\n                           What...\"guy\"?\n\n                                        CRAWFORD\n                           The other guy. The one who shot my\n                           wife. Did you see him run out the\n                           back of the house, carrying the gun?\n               Willy closes his eyes.   Gifford grimaces.\n\n               \n\n                                                                           82\n\n               \n\n               \n\n                                        GIFFORD\n                           I couldn't see the back of the house.\n                                  (Trying to salvage it:)\n                           I believe...the police went around\n                           back when they arrived.\n\n                                        CRAWFORD\n                           No further questions.\n               Willy immediately stands:\n\n                                        WILLY\n                           Re-direct, your honor.\n               But Crawford is standing too - with his handful of pages:\n\n                                        CRAWFORD\n                           I've also written a motion to dismiss.\n\n                                        WILLY\n                           Objection - I'm on re-direct!\n               The Judge hesitates.   Both men standing.\n\n                                        JUDGE ROBINSON\n                           On what grounds, Mr. Crawford?\n\n                                        CRAWFORD\n                           The prosecutor doesn't have any actual\n                           evidence.\n\n                                        WILLY\n                           I'm in the middle of presenting -\n\n                                        CRAWFORD\n                           All of his witnesses are going to\n                           testify to the same facts: that my\n                           wife was shot and that I was,\n                           tragically, in the house at the time\n                           ...a witness - and, in a way, a victim\n                           myself. I'll stipulate to Mr.\n                           Slocum's entire witness list right\n                           now, a request a directed verdict or\n                           dismissal, per California versus\n                           Collier, 1982, and the Appellate court\n                           decision, v. Watrus, 486.19.\n               Willy stares at Crawford, stunned. As the Judge reluctantly\n               nods to the Bailiff to collect Crawford's pages and opens a\n               law book:\n\n               \n\n                                                                                 83\n\n               \n\n               \n\n                                        JUDGE\n                           Your legal skills seem to have\n                           improved over the long weekend, Mr.\n                           Crawford.\n               While the Judge checks the citations, Crawford glances at\n               Willy. Amused.\n               Beat. Willy looks down - reaches into his briefcase, moves\n               his cell-phone out from under some papers. To where he can\n               get it easily.\n               Looks back up at Crawford.   Smiles slightly.\n\n                                         JUDGE ROBINSON\n                           Mr. Slocum?\n               Willy and Crawford turn to the Judge.\n\n                                        JUDGE ROBINSON\n                           Have you got any new evidence?\n               Beat.\n\n                                        WILLY\n                           May I have a moment, your honor?\n               The Judge nods.\n               Willy nods down. Trying to focus. He's got nothing, and\n               everyone in the room knows it. He can hear it, he can feel\n               it. There's a restless, hungry edge to the crowded\n               courtroom.\n               He stares into his open briefcase: the cell phone.\n               Next to it: the first class ticket and Nikki's note.\n               Willy glances back at the gallery. Nunally's eyes burn into\n               him. In the back: Lobruto frowns, concerned.\n\n                                         JUDGE ROBINSON\n                           Mr. Slocum?\n               Willy turns back to his briefcase.     He breathes.   Press the\n               MENU button - selects SPEED DIAL.\n               On the tiny screen, a list of names.    Selected: MONA/CELL.\n\n               \n\n                                                                                84\n\n               \n\n               \n\n\n               INT. COURTHOUSE - CORRIDOR - THE SAME TIME\n\n               Mona sits on a bench, a few steps down the corridor from the\n               courtroom doors. Cell phone in her hand.\n\n               \n\n\n               INT. COURTROOM - CONTINUOUS\n\n               Willy stands at the Prosecution Table.       Hearing his own\n               pulse.\n               Crawford studies Willy, curious.\n\n                                        CRAWFORD\n                           Your honor? Can we signal the\n                           prosecutor from here on planet Earth?\n               Willy's fingertip hovers over the cell phone keypad.       Press,\n               and a path is chosen. Possibly for life.\n               Next to the cell-phone, the ticket and the note.       See you\n               tomorrow.\n               Nunally sits forward.    Lobruto is watching intently.\n               Willy doesn't move.\n\n                                           JUDGE ROBINSON\n                           Mr. Slocum?     Now or never.\n               Willy won't look up.\n               Nunally stares, agonized.\n               Willy grimaces slightly, as if he feels his soul burning up,\n               turning to ash and blowing away -\n               - nods, closing the cell phone, sliding it under Nikki's\n               note. Shuts the briefcase. Looks at the Judge.\n\n                                        WILLY\n                           I have no further evidence at this\n                           time, your honor.\n               Crawford begins to smile.\n               Lobruto looks down.    A buzz rises in the gallery -\n               - as Nunally gets up, furious - stalks to the doors, slams\n               out.\n\n               \n\n                                                                              85\n\n               \n\n               \n               Judge Robinson looks at Willy a moment - then at Crawford,\n               who has been waiting, calm and polite. Very reluctantly:\n\n                                         JUDGE ROBINSON\n                            Motion to dismiss is granted.\n               Uproar.   The Judge bangs his gavel -\n\n                                        JUDGE ROBINSON\n                            Order! The jury is released, with our\n                            apologies -\n               - practically shouting over the chaos - REPORTERS hastily\n               heading for the doors, pulling out cell phones -\n\n                                         JUDGE ROBINSON\n                            - and the Defendant is free to go.\n               Crawford gives the Judge a gentlemanly bow of the head.\n               Willy begins to pack his papers into the briefcase.   Refusing\n               to look up.\n               The Judge and the Bailiff might be saying other things, but\n               no one is listening - SPECTATORS swarm up the aisles, out to\n               the hallway - and the Court starts to close down.\n               Crawford comes over to Willy, holds out a hand.\n               Willy looks him in the eye.   Doesn't move.   Crawford shrugs.\n\n                                         CRAWFORD\n                            Even a broken clock gets to be right\n                            twice a day.\n               He winks, and heads up the aisle.\n               As Willy watches Crawford go out the doors into a clamor of\n               lenses, hand-held mikes, white-hot halogen glare and flashes -\n               - he hears a buzzing noise. Looks down at his briefcase,\n               moves the papers aside: his cell phone is vibrating.\n               Willy stares at it, as if he'd forgotten the thing could be\n               used for an incoming call.\n               The caller ID reads: WOOTON SIMS.   He picks up -\n\n                                                             INTERCUT WITH:\n\n               \n\n                                                                              86\n\n               \n\n               \n\n\n               INT. WOOTON SIMS - NIKKI'S OFFICE - THE SAME TIME\n\n               Nikki sits at her beautiful desk with stellar views out the\n               windows behind her.\n\n                                            NIKKI\n                              Hey, you.\n\n                                            WILLY\n                                      (It's an effort)\n                              Hey.\n\n                                           NIKKI\n                              What did you think - I wasn't keeping\n                              tabs?\n\n                                           WILLY\n                              I don't know what I thought.\n               Awkward silence.      She tries to get past it:\n\n                                           NIKKI\n                              Listen: what do you say I take you out\n                              tonight and get you completely\n                              trashed? Tomorrow's just a travel da-\n               - there's a gun shot outside the courtroom.\n               Willy turns.    Shocked.    Screams and shouting in the corridor.\n\n                                            WILLY\n                              Hang on -\n               We move with Willy as he shuts the phone and heads for the\n               doors - faster, pushing out -\n\n               \n\n\n               INT. COURTHOUSE - CORRIDOR - CONTINUOUS\n\n               - into the echoing chaos of the corridor - trying to move in\n               the crowd -\n               - shoving through to where people are yelling and clustered\n               around a figure lying on the floor.\n               Willy pushes closer, until he catches glimpses of:\n               Nunally.   Lying on the marble floor. His gun in his lifeless\n               fingers.   Blood all over, from his head.\n               Willy stops pushing. Won't let himself look away - the\n               screams and commotion around him retreating into a numb blur.\n\n               \n\n                                                                             87\n\n               \n\n               \n               Then suddenly Willy looks up - as if he's been called -\n               - to find Crawford, standing very still, in the crowd, on the\n               other side of the body. Everyone else is moving, talking,\n               gawking at the body or averting their eyes -\n               - except Crawford.   He's looking straight at Willy.\n               Pleased.   Triumphant.\n               Willy stares into Crawford's eyes.\n\n               \n\n\n               INT. HOSPITAL ROOM - LATE THAT NIGHT\n\n               The life support system clicks and hisses and beeps.\n               Jennifer is curled into a fetal position, despite the tubes\n               and wires.\n               Willy sits by her bed. Still in his suit from court, the\n               jacket off, the tie loose.\n               He's been there a while.   But now he speaks.\n\n                                           WILLY\n                            Your husband said something...that I\n                            can't seem to shake loose of. He said\n                            I'm a winner.\n                                    (Beat)\n                            And he's right. I can't lose. I\n                            can't stand people who lose.\n                                    (Beat)\n                            I may have been working so hard to put\n                            some distance between me and...people\n                            like you - that maybe I messed up. I\n                            don't know if did anything wrong.\n                            Or what I should have done. I really\n                            don't know, any more...what I'm\n                            supposed to do.\n                                    (Beat)\n                            But I feel like I let you down.\n                            Somehow in the...process. And if I\n                            did, I'm sorry. That's all. I just -\n                            I hope you...have...just, some...\n                                    (Beat)\n                            Anyway.\n               He feels stupid. Takes a breath.     Looking at her pale,\n               drawn, comatose face.\n               He stands, goes to get his jacket, lying folded on a table by\n               the door. Pulls it on, settles the shoulders, tugs at his\n               cuffs. Gets his briefcase.\n\n               \n\n                                                                            88\n\n               \n\n               \n               He goes to the door, and as he opens it - he looks back.\n               Freezes.\n               Jennifer's eyes are wide open.\n               She's staring at him.   Willy stands, breathless, watching\n               her.\n\n               \n\n\n               INT. HOSPITAL - CORRIDOR - LATER\n\n               Sliding glass doors suck open, Willy walks with the Resident\n               from the other night:\n\n                                        WILLY\n                           She was looking at me.\n\n                                        RESIDENT\n                           Yeah, I understand -\n\n                                        WILLY\n                           No, she was looking at me.\n\n               \n\n               CLOSE UP - JENNIFER'S EYEBALL\n               A beam of light slides across it.\n\n               \n\n\n               INT. HOSPITAL ROOM - CONTINUOUS\n\n               The Resident tucks his flashlight in a pocket, draws a pin\n               from his lapel. Gently sticks Jennifer's cheek. Willy\n               winces, watching.\n\n                                        WILLY\n                           She's reacting.\n               The Resident ignores him. Pricks her forehead - her chin -\n               her big toe. Each time she twitches. He runs his thumb\n               along the sole of Jennifer's bare foot. It arches up.\n\n                                         WILLY\n                           You see?\n\n                                        RESIDENT\n                           The normal reflex goes downward.   Up\n                           indicates brain trauma.\n\n                                        WILLY\n                           She's in there. She was looking at\n                           me.\n\n               \n\n                                                                            89\n\n               \n\n               \n               The Resident sighs.   Sympathetic, but plain:\n\n                                        RESIDENT\n                           Sometimes we have to tape their eyes\n                           shut. They all move - they make\n                           sounds, they twitch. You think\n                           they're dreaming. But they're not.\n                           It's just what's left of the system,\n                           sending broken signals.\n\n                                        WILLY\n                           Can we do other tests? Like an M.R.I.\n                           or something? And I want a coma\n                           specialist to see her.\n\n                                        RESIDENT\n                           You're not authorized to order tes-\n\n                                        WILLY\n                           I'll get you authorization.      First\n                           thing tomorrow.\n               The Resident studies Willy.   Reluctantly:\n\n                                        RESIDENT\n                           You get the paperwork, I'll do what I\n                           can.\n               Willy nods, grateful. As the Resident heads out, Willy sits\n               by Jennifer's bed - protective, intent.\n\n               \n\n\n               INT. HOSPITAL - LOBBY - THE NEXT MORNING\n\n               Crawford comes in through the lobby: rested, well-dressed.   A\n               free man. He slows, surprised -\n               - seeing Willy come off the elevators. Willy hasn't left\n               Jennifer's bedside. He's in the same suit and carrying his\n               briefcase from the courthouse.\n\n                                         CRAWFORD\n                           Mr. Slocum.\n\n                                        WILLY\n                           Just...visiting.\n\n                                        CRAWFORD\n                           This isn't like you at all.\n\n                                         WILLY\n                           No?\n\n               \n\n                                                                      90\n\n               \n\n               \n\n                                          CRAWFORD\n                             You haven't got anything to gain.\n\n                                           WILLY\n                             Oh - right. That's my weak spot.\n                                    (Beat)\n                             Ever think about what yours might be?\n                             Your flaw?\n\n                                          CRAWFORD\n                             Of course I have.\n                                    (Leans in)\n                             The truth about me is, Willy...I'm\n                             really not very nice.\n               Willy nods.    Concealing the ace up his sleeve.\n\n                                          WILLY\n                             You sure do know a lot, though. Got\n                             everybody all figured out, everything\n                             set up, like one of your contraptions.\n                             Then you just sit back and watch it\n                             all fall right where you want it to.\n                             Must be kind of...boring. At that\n                             point.\n\n                                           CRAWFORD\n                             Not an ounce of sympathy, Willy?\n                                    (Beat)\n                             Imagine it - imagine she was yours.\n                             And you knew you were losing her.\n                                    (beat)\n                             Imagine days. Weeks. Going through\n                             her desk. Her purse. Her closet.\n                             Alone. Staring at her clothes. Her\n                             shoes. Knowing this is what it will\n                             be like. After.\n                                    (beat)\n                             Do you have any idea how hard it was\n                             to go on living - with her - every\n                             day, knowing?\n\n                                          WILLY\n                             But you had to, right? You needed\n                             time to set it all up...your \"crime of\n                             passion.\"\n\n                                          CRAWFORD\n                             There are many kinds of passion,\n                             Willy.\n\n               \n\n                                                                              91\n\n               \n\n               \n\n                                          WILLY\n                            Yeah.  There are.\n                                   (Beat)\n                            So - thank you.\n               Crawford frowns.     Starting to feel wary.   Willy sees it.\n               Enjoys it.\n\n                                          WILLY\n                            For sharing your wisdom. All your\n                            little helpful bits of information.\n                                   (Beat)\n                            You were right.\n\n                                           CRAWFORD\n                            About...?\n\n                                         WILLY\n                            Talking to her.\n               Beat.   Willy winks.    He goes past Crawford and out the doors.\n               Crawford doesn't move - except to turn and watch Willy.\n               Uncertain, for the first time since we've met him.\n\n               \n\n\n               INT. WOOTON SIMS - RECEPTION - LATER THAT MORNING\n\n               Willy - still unshaved, unslept, in yesterday's suit - comes\n               off the elevator, fishing out ID as he passes a RECEPTIONIST:\n\n                                         WILLY\n                            Hi, I'm just -\n               - going directly to the key-card slot by the glass double-\n               doors to the rest of the floor. He swipes his card and pulls\n               the handle -\n               - but it stays locked.     Willy swipes his card again.   No go.\n\n                                         WILLY\n                            Excuse me - I'm new, I just started -\n                            and there's something wrong with my\n                            card. Can you buzz me in?\n\n                                         RECEPTIONIST\n                            Who are you here to see?\n\n                                           WILLY\n                            I work here.    Willy Slocum.    I'm new -\n               He stops, realizing how he must look.\n\n               \n\n                                                                             92\n\n               \n\n               \n\n                                        WILLY\n                           Nikki Gardner. Willy Slocum, for\n                           Nikki Gardner.\n               As he calls in, Willy sees Nikki through the doors - one of\n               a half-dozen ASSOCIATES trailing in the wake of BOB WOOTON.\n               They all carry expensive business luggage, except Wooton -\n               who is powerful, perfectly groomed, and two decades older.\n\n                                        WILLY\n                           Wait a second - never mind, here she\n                           is, thank you.\n               Willy goes toward the glass doors as Wooton comes through -\n               nodding deferentially to the boss, semi-apologetic:\n\n                                        WILLY\n                           Hey...Bob -\n                                  (To Nikki)\n                           Can I talk to you for a second?\n               Wooton glances back at Nikki, eyes saying: don't take long.\n               She nods as Wooton and the team continue to the elevators -\n               staying back by the glass doors to talk with Willy:\n\n                                        WILLY\n                           You let him know what happened last\n                           night?\n\n                                         NIKKI\n                           I told him.\n\n                                        WILLY\n                           Great - who do I work with on it while\n                           you're gone?\n\n                                        NIKKI\n                           You don't work with anyone.\n\n                                        WILLY\n                           Nikki: the man has power-of-attorney\n                           and a health-care proxy, he can\n                           disconnect her life-support whenever\n                           he wants. If we don't move fast -\n               Nikki explodes - but quietly, not wanting the team to hear:\n\n                                        NIKKI\n                           Jesus, Willy, wake up! It's over!\n                           What is wrong with you - it's first\n                           year law: that woman could fully\n                           recover and swear he shot her and it\n\n                                        (MORE)\n\n               \n\n                                                                           93\n\n               \n\n               \n                                       NIKKI (cont'd)\n                          wouldn't matter. Double jeopardy!\n                          You can't take him back into court!\n\n                                        WILLY\n                           I told you - we bring a civil suit -\n\n                                        NIKKI\n                           You've got no standing.\n\n                                        WILLY\n                           It doesn't have to stick: we just need\n                           to get a court order for now - to keep\n                           Crawford from pulling the plug! With\n                           all the brain-power here, I'm sure\n                           somebody can come up with a pretext or\n                           call in a favor. Then we can tie this\n                           up in court while we arrange a state-\n                           appointed conservatorship - so we can\n                           protect her while we fight him on -\n\n                                        NIKKI\n                           What's the point, Willy?\n\n                                           WILLY\n                           The point?!\n               Willy stares. Because she's drawn a line in the sand. One\n               he already crossed, without truly understanding...and now\n               he's standing out there alone - feeling the sand slither away\n               under his feet.\n\n                                        WILLY\n                           This man is going to kill his wife.\n\n                                           NIKKI\n                           Yeah.\n                                  (Beat)\n                           What does that have to do with Wooton\n                           Sims?\n               Willy just breathes.   Vulnerable like we have never seen him\n               before.\n               He looks across the big reception area, at Wooton and the\n               team of associates. Some look away.\n\n                                           NIKKI\n                           I warned you.\n\n                                        WILLY\n                           No, this is insane.\n\n                                        NIKKI\n                           It's what it is.\n\n               \n\n                                                                                94\n\n               \n\n               \n               Ding!   The elevator.    Nikki grimaces, frustrated - and sad:\n\n                                            NIKKI\n                            I warned you.\n               She starts for the elevators, Willy following -\n\n                                         WILLY\n                            You're not really just gonna let this\n                            happen, are you?!\n\n                                         NIKKI\n                            Oh I'm supposed to lose my job over\n                            your problems?!\n\n                                         WILLY\n                            My problems?! Wait a second - this is\n                            not about my anything any more -\n               Willy grabs Nikki's arm to stop her, turn her around - and\n               she shoves him away, hard, tears welling in her eyes -\n               - Willy letting her go - as the Receptionist quietly calls\n               for help -\n               - and Nikki hurries into the waiting elevator.     The Associate\n               holding the doors lets them go.\n\n                                          WILLY\n                            This is about taking a couple of\n                            goddamn weeks off to try and save a\n                            woman's life!\n               The doors begin to close. Willy stands facing the cluster of\n               lawyers in expensive suits, their expressions ranging from\n               pity to contempt -\n               - except Nikki, whose eyes are full of shame and guilt and\n               defensive anger.\n               As the doors shut across them.\n               Willy doesn't move.     Confused, humiliated, frustrated.\n               He turns when a bunch of OTHER LAWYERS emerge from the\n               offices, ready to act as bouncers. People gawk from behind\n               the glass doors.\n               Beat.   Willy holds up his palms.\n\n                                            WILLY\n                            Don't bother.     I got it.\n\n               \n\n                                                                               95\n\n               \n\n               \n\n               \n\n               \n               He bangs open the paddle-sign on the stairway door, setting\n               off the fire alarms as he stalks out.\n\n               \n\n\n               INT. WOOTON SIMS - BUILDING STAIRWAY - SOON AFTER\n\n               Willy runs down the stairs furiously -\n               - the clanging alarm, several floors above now, a little\n               fainter.\n               He suddenly stops - clinging to the railing, bent over.    He\n               sways, dizzy, gasping -\n               - backs up until he's against the concrete wall. Presses\n               himself against. Listening to his own ragged breathing.\n               Scared out of his mind.\n\n               \n\n\n               INT. HOSPITAL ROOM - DUSK\n\n               Crawford stands by the bed, glancing over a set of forms on a\n               metal clipboard.\n               DR. LUNT, a senior neurologist, and a HOSPITAL ADMINISTRATOR\n               wait. The machines hiss and click, keeping Jennifer alive.\n               Crawford signs the forms, expressionless.\n\n               \n\n\n               EXT. COURTHOUSE - THE SAME TIME\n\n               Willy's walking alongside Judge Robinson, as they leave the\n               building. The Judge is wearing his \"civilian clothes.\"\n\n                                        JUDGE ROBINSON\n                           What do the doctors say?\n\n                                        WILLY\n                           People wake up out of these things.\n\n                                        JUDGE ROBINSON\n                           What did the doctors say, Mr. Slocum?\n\n                                        WILLY\n                           They said...there's no way to really\n                           know. I'm trying to get them to run\n                           more tests - but I was there, and I'm\n                           telling you.\n\n               \n\n                                                                             96\n\n               \n\n               \n\n                                        JUDGE ROBINSON\n                           I'm sorry. I have no probable cause\n                           to issue a court order against Mr.\n                           Crawford - and he's protected agai-\n\n                                        WILLY\n\n                           WHAT ABOUT HIS WIFE?!   WHAT'S\n\n                           PROTECTING HER?!\n               The Judge stops - giving Willy a hard eye: I'm sympathetic,\n               but yelling at me is not a smart approach.\n               Willy looks at the Judge a second - hapless, frustrated,\n               scared - then nods and shakes his head and turns away -\n               hurrying off through the homeward-bound crowds.\n               The Judge watches him go.   Grimaces.\n\n               \n\n\n               INT. CRAWFORD HOUSE - KITCHEN - THAT EVENING\n\n               Crawford is carefully preparing an elegant, solitary meal.\n               Music plays on his state-of-the-art sound system.\n               He stops, noticing a pair of Jennifer's reading glasses,\n               folded up by a note-pad and pen next to the telephone. He\n               picks them up. Stylish, feminine.\n               He goes to the trash, steps on the pedal to flip open the\n               lid, and drops the glasses in.\n               Goes back to cooking.\n\n               \n\n\n               INT. LOBRUTO HOUSE - LATER THAT NIGHT\n\n               Lobruto - at the dinner table with his family - looks up,\n               surprised, as the doorbell rings. He excuses himself -\n               - goes to open the door. Willy's outside: apologetic but\n               urgent, near the end of his rope.\n\n                                        WILLY\n                           I'm sorry - but nobody else seems to\n                           give a damn that sooner or later this\n                           guy is gonna finish what he started.\n               Beat.\n\n                                        LOBRUTO\n                           Have you been home at all today,\n                           Willy?\n\n               \n\n                                                                            97\n\n               \n\n               \n               Willy looks down at himself: he's unshaven, in the same\n               rumpled clothes he wore to court yesterday. Exasperated:\n\n                                        WILLY\n                           No - I've been trying to get some-\n\n                                        LOBRUTO\n                           There's a court order out against you.\n\n                                         WILLY\n                           What?\n\n                                         LOBRUTO\n                           A restraining order.\n                                  (Beat)\n                           You were at the hospital?       Talking to\n                           her doctors?\n               Willy nods. Lobruto looks out at the confused, frantic young\n               man - truly sorry that he can't help Willy fight his way back\n               toward doing some good in this mess.\n\n                                        LOBRUTO\n                           Crawford hired a lawyer this time.\n                           They saw Judge Gorman this afternoon.\n\n                                         WILLY\n                           Against me.\n\n                                         LOBRUTO\n                           You need to stay away from him, and\n                           his wife, and the hospital. He can\n                           have you arrested if you don't.\n                                  (Beat)\n                           I'm sorry.\n                                  (beat)\n                           I can't help you. I told you how it\n                           would go.\n               Willy stares a second, slowly understanding his situation.\n\n                                        WILLY\n                           Can you do anything for her?\n               Beat.\n\n                                        LOBRUTO\n                           I don't see how.\n               Willy grimaces.   But nods.   Turns away.\n\n               \n\n                                                                             98\n\n               \n\n               \n\n\n               EXT. LOBRUTO HOUSE - CONTINUOUS\n\n               We move with Willy out to the quiet street. The windows of\n               the houses he passes seem warm and safe - and very far away.\n               Behind him, Lobruto watches from his lighted doorway.\n               Willy walks, shaken, determined, into the night.\n\n               \n\n\n               INT. HOSPITAL - I.C.U. - THE NEXT MORNING\n\n               A NURSE checks Jennifer Crawford's vital signs. She then\n               begins to gently wash Jennifer's face, where it's not taped\n               or bandaged.\n               The monitor beeps, the ventilator hisses.\n\n               \n\n\n               INT. CRAWFORD HOUSE - THE SAME TIME\n\n               Crawford knots his necktie, studying himself in the mirror.\n               Expressionless.\n\n               \n\n\n               EXT. GARDNER HOUSE - DRIVEWAY - SOON AFTER\n\n               Judge Gardner pulls his car out to the street -\n               - swerving hastily, as Willy's car skids alongside and forces\n               him to the curb, horn honking.\n               Willy pulls to a stop, blocking Gardner's way, and gets out\n               of the car - holding up both palms: just wait.\n\n               \n\n\n               INT. HOSPITAL - CORRIDOR - LATER THAT MORNING\n\n               Dr. Lunt takes a chart from the I.C.U. Nurses' Station.\n\n                                        DR. LUNT\n                           Has Mrs. Crawford been prepared?\n\n               \n\n\n               INT. CRAWFORD'S CAR - SOON AFTER\n\n               Crawford drives, wearing a dark suit, sunglasses.   Calm.\n\n               \n\n                                                                             99\n\n               \n\n               \n\n\n               INT. JUDGE GARDNER'S CHAMBERS - SAME TIME\n\n               Willy watches GARDNER'S SECRETARY bring in a document, fresh\n               off the laser-printer. As Gardner signs:\n\n                                        WILLY\n                           Can I use your fax machine?\n\n                                        GARDNER\n                           These have to be served in person.\n\n               \n\n\n               INT. PARKING STRUCTURE - DOWNTOWN L.A. - CONTINUOUS\n\n               Willy brakes as he drives around a corner and sees a DRIVER\n               wrangling with the BOOTH GUY. He grimaces, looks around -\n               - backs up, tires squealing, heading for another exit.\n\n               \n\n\n               INT. HOSPITAL ROOM - CONTINUOUS\n\n               Dr. Lunt stands by Jennifer's bed, supervising the Nurse and\n               an Orderly as they prepare her.\n\n               \n\n\n               INT. HOSPITAL - LOBBY - CONTINUOUS\n\n               Crawford walks in, goes toward the elevators.\n\n               \n\n\n               INT. WILLY'S CAR - INTERSECTION - CONTINUOUS\n\n               He floors it, racing under a light going red - narrowly\n               misses getting broad-sided.\n\n               \n\n\n               INT. HOSPITAL ROOM - CONTINUOUS\n\n               Dr. Lunt looks up from making notes on Jennifer's chart, as\n               Crawford enters the room.\n\n               \n\n\n               EXT. EMERGENCY ROOM ENTRANCE - CONTINUOUS\n\n               Willy pulls into a NO PARKING zone and jumps out, papers in\n               hand - tossing the keys to an ORDERLY smoking a cigarette -\n\n                                        WILLY\n                           Move it if you need to!\n               - running through the automatic doors.\n\n               \n\n                                                                            100\n\n               \n\n               \n\n\n               INT. HOSPITAL ROOM - CONTINUOUS\n\n               Standing beside Dr. Lunt, Crawford watches, expressionless -\n               - as the Nurse and the Orderly work, efficient and silent,\n               disconnecting the oxygen tubes, unplugging the monitor -\n\n               \n\n\n               INT. HOSPITAL LOBBY - SOON AFTER\n\n               Willy dodges people, coming to the elevators - which open.\n               Too crowded.\n\n               \n\n\n               INT. HOSPITAL STAIRWAY - SOON AFTER\n\n               Willy gasps a little as he hurries up the stairs -\n\n               \n\n\n               INT. HOSPITAL - CORRIDOR - SOON AFTER\n\n               - comes out of the fire stairs, hurrying toward I.C.U. -\n\n               \n\n\n               INT. HOSPITAL ROOM - CONTINUOUS\n\n               - and into Jennifer's room, where he stops.     Shocked.\n               The bed is being stripped, the equipment rolled out.\n               Willy stares, breathless, overwhelmed.\n\n                                           NURSE\n                              You just missed her.\n\n                                           WILLY\n                              What?\n\n                                           NURSE\n                              She just went on up.\n               Willy struggles to control his emotions.     Looks down.\n\n                                           WILLY\n                              How long ago...did she die?\n\n                                          NURSE\n                           What?\n                                  (Beat)\n                           The roof.\n                                  (Beat)\n\n                                          (MORE)\n\n               \n\n                                                                           101\n\n               \n\n               \n                                        NURSE (cont'd)\n                           Medevac transfer. Out to a long-term\n                           care facility up in Santa Barbara.\n                           They just left, you can probably still\n                           catch 'em.\n               Willy tries to understand her.   With growing horror.\n\n                                        WILLY\n                           He's - moving her by helicopter?\n\n                                        NURSE\n                           Nothing but the best.\n               We hear the surge of a jet engine -\n               - as Willy runs out of the room.\n\n               \n\n\n               EXT. HOSPITAL ROOF - HELIPAD - LATER\n\n               A Sikorsky S-76 Medevac chopper is preparing to take off,\n               very loud and windy.\n               Through the open doorway and the thick windows, we can\n               glimpse Crawford sitting beside Jennifer, who is strapped on\n               to a gurney. She's connected to life-support equipment.\n               The MED TECH is outside, checking a few last supplies and\n               giving Crawford a moment alone with his wife.\n               Crawford moves. He may be whispering to her.    Or adjusting\n               her pillow. Hard to tell.\n               As he climbs out of the chopper -\n               - he sees Willy across the roof, arguing with Dr. Lunt, who\n               is skimming the court documents, shaking his head.\n               Crawford, curious, walks toward the two men.\n\n               \n\n\n               EXT. HOSPITAL ROOF HELIPAD - WILLY - THE SAME TIME\n\n               Dr. Lunt hands Crawford the court order. As Crawford reads\n               them, Lunt and Willy shout over the helicopter engine:\n\n                                        DR. LUNT\n                           This orders him not to take her off\n                           life support! He's not! We can't\n                           stop the man from -\n\n                                        WILLY\n                           Then just hold it - for a couple of\n                           hours! Have it inspected!\n\n               \n\n                                                                            102\n\n               \n\n               \n\n                                        DR. LUNT\n                           You're talking about a phenomenally\n                           expensive delay, Mr. Slocum - when the\n                           man has every right to move his wife!\n\n                                        WILLY\n                           She's not gonna get there!\n               He looks at Crawford: reading - amused, thoughtful.\n\n                                        WILLY\n                           This man is a mechanical engineer with\n                           expertise in air crashes! He has\n                           access to airfields and he knows\n                           exactly how to make it look like an\n                           accident! You know what he did! You\n                           know why she's like this!\n               Lunt hesitates, feeling a tiny edge of doubt.\n               Crawford checks his watch.   Looks into Willy's eyes -\n               - then gestures for Willy to join him, and turns back to walk\n               across the pad to the helicopter. Climbs in.\n               Willy stares, stunned.\n               Lunt looks at him: case closed. The rotors whirl faster,\n               engine noise rising to a scream.\n               From the open chopper doorway, Crawford looks at Willy again\n               and gestures for him to get on.\n               Willy doesn't know how to react.   Slowly, he starts to walk\n               toward the helicopter.\n\n               \n\n\n               INT. HELICOPTER - CONTINUOUS\n\n               Willy bends, coming to the door - wind-whipped, flinching.\n               Crawford holds out a hand to help him in.\n               Willy doesn't move.   The PILOT glances back.\n               Crawford's eyes are locked with Willy's.\n               Willy stares at Crawford, scared. But unable to back down\n               from the crude, plain challenge. Which Crawford is clearly\n               counting on.\n               Angry, at himself, Willy climbs in without taking Crawford's\n               hand. As he nervously figures out how to buckle himself in -\n\n               \n\n                                                                               103\n\n               \n\n               \n               - the Med Tech secures the door, the Pilot turns to face\n               front - and they lift off.\n\n               \n\n\n               EXT. ABOVE LOS ANGELES - SOON AFTER\n\n               Looking directly down at the Sikorsky as it glides over a\n               picturesque mapscape of streets and freeways, gray and terra-\n               cotta rooftops, blue kidneys and rectangles of pool.\n\n               \n\n\n               INT. HELICOPTER - SAME TIME\n\n               Willy watches Crawford, who stares back at him.       Calm.\n               Glances uneasily at the Pilot, bug-headed in sun-goggles and\n               headphones. Flying them, calm.\n               The Med Tech, adjusting Jennifer's portable ventilator.\n               Calm.\n\n               \n\n\n               EXT. ABOVE LOS ANGELES - SOON AFTER\n\n               The Sikorsky glides over cross-hatched parking lots, a pale\n               swath of beach -\n               - and the white foaming edge of the Pacific.\n\n               \n\n\n               INT. HELICOPTER - CONTINUOUS\n\n               Willy looks up from the view.       Scared.   Yells to the Pilot.\n\n                                        WILLY\n                           Why are we going out over the ocean?\n\n                                           PILOT\n                           Less traffic.\n               Willy looks at Crawford.\n\n               \n\n\n               EXT. ABOVE THE OCEAN - SOON AFTER\n\n               Deep dark vast blue.   The Sikorsky flies over.      Small.\n\n               \n\n\n               INT. HELICOPTER - SOON AFTER\n\n               Willy stares into Crawford's eyes.\n\n               \n\n                                                                            104\n\n               \n\n               \n               Then he looks around at the vibrating metal box carrying him\n               hundreds of feet above the earth. The sunlight glare in the\n               scratched windows. The blur of the rotors against the empty\n               sky. The edges of the door frame. The rivets in the roof.\n               Crawford's eyes.   Amused.\n               Willy unbuckles his seat-belt, lurches toward the Pilot -\n\n                                        WILLY\n                           We have to turn back!\n\n                                        PILOT\n                           Get in your seat!\n\n                                        WILLY\n                           He's doing something - we have to turn\n                           back!\n\n                                        PILOT\n                           Who's doing something?\n               Willy points to Crawford, who's just sitting there -\n\n                                         WILLY\n                           He is!   You have to get us DOWN!\n\n                                        PILOT\n                           Get back in your goddamn seat!\n\n                                        CRAWFORD\n                           Willy, I'm not doing anything.\n                           Everyone can see that.\n\n                                        WILLY\n                           I'm TELLING you, we have to TURN BACK!\n                           He's DOING SOMETH-\n               An alarm begins to shriek - on the ventilator.\n               Everyone turns as the Med Tech hastily kneels next to it -\n\n                                        WILLY\n                           What's happening?!\n\n                                         MED TECH\n                           I don't know - I'm - there's a -\n                           malfunction -\n               - Willy whips around to look at Crawford, with fury in his\n               glare: oh, you bastard.\n               Crawford almost smiles.\n\n               \n\n                                                                         105\n\n               \n\n               \n               The Med Tech is flipping switches, checking wires -\n\n                                        MED TECH\n                           I can't do anything with this, up\n                           here.\n               The Pilot turns - steeply, Willy falling over, the Med Tech's\n               supplies spilling - as the Med Tech hastily removes\n               Jennifer's breathing tube and prepares to begin C.P.R. -\n\n                                          CRAWFORD\n                           She's D.N.R.\n               The Med Tech looks up - startled.     Confused.\n\n                                          WILLY\n                           What is it?\n\n                                          CRAWFORD\n                           Check.\n               Willy watches, wide-eyed, as the Med Tech grabs up his\n               paperwork, searching it -\n\n                                          WILLY\n                           What?\n               The Med Tech looks up at Willy, scared.\n\n                                        MED TECH\n                           She's Do Not Resuscitate.\n               Willy turns on Crawford.   He shrugs.\n\n                                        CRAWFORD\n                           It's in her living will.\n               The Med Tech looks at Willy, paralyzed.\n\n                                          MED TECH\n                           She's D.N.R.    She signed it.\n\n                                        WILLY\n                           There's a restraining order - she's\n                           protected - I'm authorizing you to do\n                           it!\n               The Med Tech turns to Crawford, uncertain -\n\n                                      CRAWFORD\n                           No extraordinary measures.\n                                  (Turns to Willy)\n                           Unless your court order specifies\n\n                                      (MORE)\n\n               \n\n                                                                                  106\n\n               \n\n               \n                                      CRAWFORD (cont'd)\n                           contravening her living will. But I\n                           don't think it would. I think you got\n                           one that forbids me from disconn-\n               Willy throws himself at Crawford - attacking him, as the Med\n               Tech grabs him, drags him back -\n\n                                        PILOT\n\n                           WHAT THE HELL IS GOING ON BACK THERE?!\n               - the Med Tech holding Willy down on the floor by Jennifer's\n               stretcher - Willy struggles furiously -\n\n                                          WILLY\n                           Wait!    WAIT - LOOK!\n               Willy is pointing at Jennifer - shocked -\n               - as the Med Tech lets him up and they kneel by her, the Med\n               Tech taking her pulse - Willy, staring down at her, intent:\n               She's breathing.\n\n                                             WILLY\n                           Yes.     Yes.\n               Willy whirls around to Crawford.        Who's frowning.\n\n                                        WILLY\n                           You messed up. With all your plans\n                           and games.\n               Willy turns back to Jennifer. Delicately strokes the side of\n               her face. Her eyes flutter open -\n\n                                          WILLY\n                           Shhhh.    It's okay.       It's all right.\n               - she stares into Willy's eyes. He takes her hand.        Silent\n               awe in her eyes. Yearning. Fear.\n\n                                        WILLY\n                           You're gonna be okay?\n               She squeezes his hand.      Very weakly.\n               Crawford is looking daggers: die, bitch.\n               Jennifer's eyes - fixed on Willy - roll back.        She fights it.\n\n                                             WILLY\n                           Jennifer?       Hang on.\n               Something sad in her wordless gaze.        As it starts to fade.\n\n               \n\n                                                                                107\n\n               \n\n               \n\n                                           WILLY\n                           Jennifer?!     JENNIFER?!\n               She's slipping. Her eyes gone empty.        Her hand becoming\n               lifeless in his.\n\n                                           WILLY\n                           No.     Come on, Jennifer.    Fight back.\n               Tears well up in Willy's eyes, but he struggles against them -\n               feeling Crawford's gaze, refusing him the satisfaction.\n\n                                           WILLY\n                           Don't let go.\n               But she's gone. He stares down. Mourning her. Letting his\n               grief slowly burn into rage. He gently reaches up and closes\n               her eyes.\n               Then he looks up at Crawford, who smiles sympathetically.\n\n                                         CRAWFORD\n                           You pushed it, Willy. We didn't have\n                           to be here.\n                                  (Beat)\n                           But now you're my witness. You saw:\n                           I didn't touch anything, I didn't do\n                           anything. The machine went down.\n                           Anybody asks - you'll have to tell\n                           them. What you saw.\n                                  (Beat)\n                           That's really kind of perfect, isn't\n                           it?\n               Willy stares into his eyes. Cold.        Then he looks away.    Out\n               the window, into the sun-glare.\n\n                                                               SLOW DISSOLVE TO:\n\n               \n\n\n               INT. WILLY'S APARTMENT - A COUPLE OF DAYS LATER\n\n               The garage door is open, letting in daylight. We can see the\n               alley especially well, because there are only empty hangers\n               on the clothes-bar, and the cinderblock shelves have been\n               taken apart, stacked on the floor.\n               Willy is packing.    He's wearing jeans, an old t-shirt.\n               He carries a heavy pile of legal textbooks out to the trash\n               bins, throws them away.\n\n               \n\n                                                                         108\n\n               \n\n               \n               As he turns to go back in - he sees Lobruto coming along the\n               alley, wearing a suit. Surprised, waits.\n\n                                        LOBRUTO\n                           You're not answering your phone.\n               Beat.\n\n                                        WILLY\n                           That's kind of an answer in itself,\n                           isn't it?\n               Willy heads back in, starts to pack again.\n\n                                        LOBRUTO\n                           Where are you headed?\n\n                                        WILLY\n                           Haven't decided yet.    Just someplace\n                           else.\n               Lobruto nods.   Willy packs.\n\n                                         LOBRUTO\n                           I shouldn't have let it get so far out\n                           of control.\n                                  (Beat)\n                           We all lose, Willy.\n\n                                         WILLY\n                           Yep.\n\n                                        LOBRUTO\n                           We just have to live with that, and\n                           keep fighting the good fight.\n\n                                        WILLY\n                           That's not what I was doing.\n\n                                        LOBRUTO\n                           You belong in a courtroom.\n               Willy packs, thinking about that.   Shakes his head.\n\n                                        WILLY\n                           I need to - get to know myself better.\n\n                                        LOBRUTO\n                           You're a good lawyer. All this may\n                           have even made you a better lawyer.\n                           Don't waste it.\n               Willy turns on him - angry, confused, bitter:\n\n               \n\n                                                                            109\n\n               \n\n               \n\n                                        WILLY\n                           I didn't just lose a case!     I let a\n                           man get away with murder.\n               Lobruto nods. Respecting his pain.     Shrugs, accepts the\n               decision, with regret.\n               Willy nods his thanks, and turns back to packing.\n               Lobruto starts to leave.    But from the alley door:\n\n                                        LOBRUTO\n                           If it makes you feel any better -\n                           technically, you let a man get away\n                           with attempted murder.\n               Willy doesn't respond.    Keeps packing.\n               Lobruto goes out.\n               After a moment, Willy stops.    Looking up.   Something turning\n               over in his mind.\n\n               \n\n\n               EXT. ALLEY - CONTINUOUS\n\n               Lobruto is walking toward his car when Willy steps out of the\n               garage and calls after him:\n\n                                        WILLY\n                           His wife is dead!\n               Lobruto turns.   Uncertain what Willy is getting at.\n\n                                        WILLY\n                           We can still get him.    We can take him\n                           back to court.\n\n                                        LOBRUTO\n                                  (Gently)\n                           Willy...\n               Willy comes toward him - excited, insistent:\n\n                                        WILLY\n                           Double jeopardy doesn't apply! We\n                           bring a new charge - of homicide.\n\n                                         LOBRUTO\n                           Willy - what happened to you, on the\n                           helicopter - we don't even know if we\n                           could prove -\n\n               \n\n                                                                                  110\n\n               \n\n               \n\n                                         WILLY\n                           No: he shot her and she died. The\n                           fact that it took time - the fact that\n                           he went to trial in between, just for\n                           shooting her - doesn't matter. He\n                           fired a gun and caused her death, and\n                           that's murder.\n                                  (Beat)\n                           If he can twist the law around - then\n                           so can we.\n               Lobruto thinks it out.    Wary.\n\n                                        LOBRUTO\n                           A second indictment on the same\n                           incident?\n\n                                        WILLY\n                           A man burns down a house; we charge\n                           him with arson. There were people\n                           sleeping upstairs - and after weeks in\n                           the hospital, they die. We'd charge\n                           him with murder. Right?\n               Lobruto nods. On the fence, but seeing it now.         Impressed\n               with the young man's fervor, and his logic.\n               But he shakes his head.\n\n                                        LOBRUTO\n                           All your evidence is still toxic.      The\n                           confession, the arrest - it's all\n                           still inadmissible.\n               Willy grimaces.    Looks down.    Thinking, intense.\n\n                                        LOBRUTO\n                           I'm sorry, Willy. It was a good idea,\n                           but -\n\n                                        WILLY\n                           I'll get something new.\n\n                                          LOBRUTO\n                           How?\n               Willy looks up at him.    Calm now.\n\n                                        WILLY\n                           You don't want to know.\n\n                                        LOBRUTO\n                           Willy, you can't -\n\n               \n\n                                                                            111\n\n               \n\n               \n\n                                         WILLY\n                           I don't work for you.\n                                  (Beat)\n                           Right?\n               Beat. Lobruto sighs, as Willy nods and turns to start back\n               to the garage. With work to do.\n\n                                        LOBRUTO\n                           Don't do anything crazy.\n\n                                        WILLY\n                           What else have we got left?\n               Willy disappears inside.\n\n               \n\n\n               INT. S.I.D. LAB - LATER\n\n               End of the day. Marchand pulls on his coat, shuts down his\n               computer. He turns to go -\n               - Willy is standing in his doorway.\n\n                                        WILLY\n                           I need a favor.\n\n               \n\n\n               INT. POLICE EVIDENCE WAREHOUSE - SOON AFTER\n\n               Willy follows an EVIDENCE CLERK along an aisle between floor-\n               to-ceiling steel shelves of boxes marked with case numbers.\n\n                                        CRAWFORD\n                           These are from that thing at the\n                           courthouse, right?\n\n                                          WILLY\n                           Uh-huh.\n               The Clerk stops, checking a number against a slip of paper in\n               his hand - pulls down a box for Willy.\n\n               \n\n\n               INT. CRAWFORD HOUSE - THAT NIGHT\n\n               Crawford is building a new Rube Goldberg device, tools and\n               parts laid out precisely on a table.\n               Eyes enlarged by the glasses, he silently connects two tiny\n               pieces of metal -\n\n               \n\n                                                                            112\n\n               \n\n               \n               - when a French door suddenly implodes, a metal lawn chair\n               hurled in from the backyard smashing through it.\n               Crawford stands, taking off the glasses -\n               - as Willy walks in over the broken glass, carrying Nunally's\n               gun.\n\n                                         CRAWFORD\n                            Very dramatic.\n               Willy crosses the room to the alarm panel on the wall.\n\n                                         WILLY\n                            You ain't seen nothin' yet.\n               He presses the POLICE emergency button, then turns to\n               Crawford.\n\n                                         WILLY\n                            I want the gun.\n\n                                          CRAWFORD\n                            Why?   You've already got one.\n\n                                         WILLY\n                            I want the gun you shot your wife\n                            with. Now.\n               Crawford doesn't move.\n               Willy raises his gun, points it at Crawford's face.\n\n                                         WILLY\n                            One way or another, I'm going to see\n                            to it you receive justice tonight.\n               Crawford studies Willy.\n\n                                         CRAWFORD\n                            You're serious, aren't you.\n\n                                          WILLY\n                            Oh, yes.\n\n                                         CRAWFORD\n                                   (A smile dawning)\n                            Willy. You got religion, didn't you?!\n                            You care. That's...priceless.\n               He laughs.   Willy keeps the gun aimed at him.\n\n               \n\n                                                                         113\n\n               \n\n               \n\n                                        CRAWFORD\n                           No, it's very sweet. Really.\n\n                                        WILLY\n                           Gonna be a whole lot less funny in\n                           about a minute.\n               Crawford nods.    Considering the game.   Unruffled.\n\n                                        CRAWFORD\n                           Getting it like this: is that going to\n                           hold up in court?\n\n                                        WILLY\n                           I don't work for the D.A. any more.\n                           I'm just a guy who broke into your\n                           house. When the police arrest me -\n                           they'll inventory anything in my\n                           possession. If that happens to be\n                           crucial evidence in another case,\n                           well: some prosecutor just got lucky.\n               Silence. Crawford studies Willy's eyes, over the muzzle of\n               the gun between them.\n\n                                        CRAWFORD\n                           It takes a very special kind of person\n                           to look right into someone's eyes and\n                           pull the trigger. It takes a unique\n                           kind of strength.\n\n                                        WILLY\n                           I guess you'd know that.\n\n                                          CRAWFORD\n                           Yes.    I would.\n               Willy cocks the gun.\n               Crawford shakes his head.    Eyes on Willy.\n\n                                        CRAWFORD\n                           I don't think so.\n               Willy doesn't lower the gun.    But he doesn't pull the\n               trigger, either.\n\n                                        WILLY\n                           You don't know me.\n\n                                           CRAWFORD\n                           No?\n\n               \n\n                                                                         114\n\n               \n\n               \n               Beat.   Crawford smiles slightly.\n\n                                         CRAWFORD\n                            Then I'm in for a - rude awakening.\n               Willy glares over the gun.     Crawford shrugs.\n\n                                           CRAWFORD\n                            Tick-tock.\n               Willy's angry.   Frustrated.    Trapped.\n               His bluff called.     Refusing to back down.\n\n                                         CRAWFORD\n                            Where did you even get yourself a gun?\n\n                                         WILLY\n                                   (Bitter)\n                            It's Nunally's.\n               Crawford is thrown by this - but conceals it well.\n\n                                           CRAWFORD\n                            Nunally's.    Really.\n               Willy grimaces, over the gun still aimed at Crawford's face.\n\n                                           WILLY\n                            Yeah.    Really.\n               He has backed himself into a corner, and he's getting scared.\n               Because all of a sudden the threat he came to fake Crawford\n               out with -\n               - is starting to seem like his only way out.\n               Even Crawford sees it. In Willy's eyes. The uncertain edge\n               of the idea. He could just do it. End the game. Blow\n               Crawford's brains all over the wall.\n\n                                         WILLY\n                            There I was, with a perfectly good\n                            weapon just sitting in the evidence\n                            warehouse.\n               It would be so easy. With his life already a shambles.   With\n               everything already lost. At least he would have this.\n\n                                           CRAWFORD\n                            Willy.    Put it down.\n\n               \n\n                                                                         115\n\n               \n\n               \n\n                                        WILLY\n                           I thought you might appreciate the\n                           ...irony.\n               Willy's finger tightens on the trigger.\n\n                                         CRAWFORD\n                           Willy.   Think.\n               And Willy does.   Hesitating.\n               Distracted, by a thought.\n               Lowering the gun slightly, looking at it - remembering:\n\n               \n\n\n               INT. S.I.D. LAB - NIGHT (FLASHBACK)\n\n               Marchand, on the phone - holding the gun Crawford\n               surrendered, in its plastic EVIDENCE bag:\n\n                                        WILLY (V.O.)\n                           \"A perfectly good...Heckler and Koch\n                           nine-millimeter.\"\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n               Crawford is getting edgy, watching Willy study Nunally's gun:\n\n                                        CRAWFORD\n                           The police will be here very soon.\n\n                                        WILLY\n                           The exact same type of gun you bought\n                           your wife, a month before.\n               He looks up at Crawford.    Getting it.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (FLASHBACK)\n\n               Nunally setting down his pistol on the chair - as Crawford,\n               across the room, sets down his on the table.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n\n                                         CRAWFORD\n                           If they see you with a gun in your\n                           hand - they're not likely to ask a lot\n                           of questions.\n\n               \n\n                                                                            116\n\n               \n\n               \n\n                                         WILLY\n                            That's why you went to the hotel.\n\n               \n\n\n               INT. HOTEL CORRIDOR - DAY (FLASHBACK)\n\n               Surveillance-cam view: Crawford lets himself into the room -\n\n                                         WILLY (V.O.)\n                            That's why you went into the room.\n\n               \n\n\n               INT. HOTEL ROOM - DAY (FLASHBACK)\n\n               Crawford quietly closes the door behind him.     Stands, taking\n               it all in -\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n               Willy looks at Crawford.    Stunned.\n\n                                         WILLY\n                            You took his gun.\n\n               \n\n\n               INT. HOTEL ROOM - DAY (FLASHBACK)\n\n               Crawford checks the dresser drawers, the night-table - finds\n               Nunally's badge, holster and gun.\n\n                                         WILLY (V.O.)\n                            And you left him yours.\n               Crawford replaces Nunally's gun with his own matching pistol,\n               which was tucked into the back of his belt.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n               Beat.   Crawford shrugs - arrogant:\n\n                                         CRAWFORD\n                            I gave it back.\n\n                                           WILLY\n                            Yes you did.\n\n               \n\n\n               INT. CRAWFORD HOUSE - (FLASHBACKS - VERY QUICK)\n\n               Crawford fires at Jennifer - Crawford shoots at the transom -\n\n               \n\n                                                                            117\n\n               \n\n               \n\n                                        WILLY (V.O.)\n                           After you'd used it.\n               Crawford holds out the gun, to Nunally: making the offer -\n\n                                        WILLY (V.O.)\n                           Then you told Nunally you'd put it\n                           down - if he put down his.\n               Nunally setting down his pistol on the chair, as Crawford,\n               across the room, sets down his on the table.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n               Willy turns, looking into the alcove:\n\n                                        WILLY\n                           That's why you moved her back there -\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (FLASHBACK)\n\n               Nunally rushes past Crawford to kneel by Jennifer - shocked,\n               frantic -\n\n                                        CRAWFORD (V.O.)\n                           The truth is I could have done it\n                           right in front of the man and he\n                           wouldn't have noticed.\n               - ignoring Crawford behind him.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n\n                                        CRAWFORD\n                           He had...other things on his mind.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - NIGHT (FLASHBACK)\n\n               Nunally's calling for help on the walkie-talkie, desperately\n               starting C.P.R. -\n               - as behind him, Crawford picks up the murder weapon,\n               (Nunally's gun) from the table -\n               - and walks over to the chair where Nunally left Crawford's\n               gun (from his holster).\n\n               \n\n                                                                           118\n\n               \n\n               \n\n                                        WILLY (V.O.)\n                           And all you had to do was switch the\n                           guns back - in the commotion -\n               Crawford picks up his gun and sets the murder weapon on the\n               chair in its place.\n\n                                        WILLY (V.O.)\n                           - and then wait -\n               He then comes back to put his gun on the table, where it will\n               be mistaken for the murder weapon. Straightens, done.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - NIGHT (FLASHBACKS)\n\n               Nunally grabs up the murder weapon from the chair, upset,\n               distracted - puts it in his holster -\n\n                                        WILLY (V.O.)\n                           - until Nunally walked the murder\n                           weapon right out of the house.\n               A Detective drops Jennifer's gun into an evidence bag -\n               - as Nunally walks out.\n\n               \n\n\n               INT. CRAWFORD HOUSE - LIVING ROOM - (RESUME)\n\n               Willy stares at Crawford.    In real wonder.\n\n                                           WILLY\n                           Brilliant.\n\n                                        CRAWFORD\n                           You know, this is really kind of fun.\n                           It's like showing some caveman a\n                           cigarette lighter.\n               Willy looks down at the gun in his hand.    Thoughtful.\n\n                                        WILLY\n                           This caveman's gonna put you in prison\n                           for the rest of your life.\n\n                                        CRAWFORD\n                           It's still not evidence, Willy.\n                           There's no prints left by now.\n                           Nothing ties that gun to me.\n               Willy smiles, slow...    Enjoying himself, at last.\n\n               \n\n                                                                               119\n\n               \n\n               \n\n                                        WILLY\n                           No. That would be true.        Except for\n                           all those eggs.\n\n                                            CRAWFORD\n                           Those what?\n               Willy nods to himself, going to the wooden bowl of ball-\n               bearings - selecting one, carrying it to the Rube Goldberg\n               machine:\n\n                                        WILLY\n                           With all those little cracks and weak\n                           places. Like Nunally. Shooting\n                           himself, right there in the\n                           courthouse. I didn't think he was\n                           going to do that. Did you?\n\n                                            CRAWFORD\n                                   (Wary)\n                           No.\n               Studying the complex device, toying with Crawford:\n\n                                        WILLY\n                           I mean, we all knew he was going to\n                           fall apart sooner or later. That was\n                           part of your plan, right? Like a bank\n                           shot, on a pool table: you kill your\n                           wife - and destroy her lover. With\n                           one bullet.\n                                  (Turns)\n                           Well: four bullets, actually. Right?\n               Crawford frowns.   Trying to see what Willy's getting at.\n\n                                        WILLY\n                           First bullet goes into your wife.\n\n                                                       INTERCUT QUICK FLASHBACKS:\n               Crawford fires at Jennifer -\n\n                                        WILLY (V.O.)\n                           Then three more out the front of the\n                           house, to get some attention.\n               - and fires three times at the transom.\n\n                                        WILLY\n                           Then while you're waiting for the show\n                           to begin - you have to reload\n                           Nunally's gun.\n\n               \n\n                                                                          120\n\n               \n\n               \n               Crawford pushes new bullets into the clip -\n\n                                        WILLY (V.O.)\n                           I mean, you don't want him wondering\n                           where the hell four bullets went,\n                           considering he never fired his gun\n                           that night.\n\n               - and slides the clip back into the gun, pleased.\n               Willy nods, thinking it out.   Sure of himself.\n               He sets the ball-bearing into the slot at the top of the\n               machine -\n\n                                         WILLY\n                           And I'm betting you didn't worry about\n                           fingerprints.\n\n               Crawford reacts.\n               CLOSE: Crawford's fingers, putting the bullets in the clip.\n               Willy lets the ball go - watching it begin rolling down the\n               ornate tracks.\n\n                                        WILLY\n                           I mean, why would you? Nobody's going\n                           to be looking at his gun.\n\n               The ball tumbles and clatters - flipping and clicking through\n               the ingenious, precise, heartless machinery -\n\n                                        WILLY\n                           And sooner or later, life goes on,\n                           those four incriminating bullets would\n                           get used, and be gone forever.\n\n               - and Crawford is recognizing, slowly, his one mistake.\n               The gun in Nunally's limp dead fingers, glimpsed on the\n               marble courthouse floor, through the crowd.\n\n                                        WILLY (V.O.)\n                           Except Nunally only fired one of those\n                           bullets. Into himself.\n\n               Willy turns from the machine -\n               - which continues clattering and working, beside him.\n\n               \n\n                                                                              121\n\n               \n\n               \n\n                                         WILLY\n                           Which means there are still three left\n                           with your fingerprints on them - Tom.\n                           In this clip.\n\n               He holds the gun up.     Savoring Crawford's growing fear.\n               They can hear a car rolling up the driveway. Red and blue\n               lights sweep the frosted glass by the front door.\n\n                                        WILLY\n                           Everybody has a weak spot, right?\n                           Some place they break.\n\n               Without looking, Willy gently pushes the machine, moving it a\n               fraction of an inch on the floor -\n               - as the ball catapults out - sailing across the living room\n               in a perfect, graceful arc -\n               - that misses the bowl.\n\n               Outside, the police car doors open and then slam.\n               Crawford, going pale, watches the metal ball roll off the\n               coffee-table and across the floor toward him.\n               Crawford doesn't move.     Trying to focus.    His mind working.\n               The ball comes to rest against Crawford's shoe.\n               The doorbell rings.\n\n               Crawford looks up.     Meeting Willy's eyes.\n               Smiling slightly, Willy tucks Nunally's gun into his belt and\n               puts his hands in the air.\n               And gives Crawford a wink.\n               Crawford is staring at Willy, frozen - panic and hatred and\n               fear curdling in his eyes -\n               - as behind him, the police begin pounding on the front door.\n\n               \n\n               \n\n                                             THE END\n\n\n\n\n\n\nFracture\nWriters :   Dan Pyne\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:20.968772"}