{"title": "French Connection, The", "film_link": "/Movie Scripts/French Connection, The Script.html", "script_link": "/scripts/French-Connection,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>French Connection, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"French Connection, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Ernest Tidyman\" title=\"Scripts by Ernest Tidyman\">Ernest Tidyman</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : April 1971<br/>\n<br/>\n<a href=\"/scripts/French-Connection,-The.html\">Read \"French Connection, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>The French Connection</title>\n\n<pre>\n\n\n\n\n                                         Rev. April 26, 1971\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<b>                 THE FRENCH CONNECTION\n</b>\n                           by\n\n          ERNEST TIDYMAN and WILLIAM FRIEDKIN\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDIRECTOR: William Friedkin\n\nPRODUCER: Philip D'Antoni\n<b>\n</b>\n\n\n<b>EXT. LE VALLON\n</b>\nOpening shot - High angle on Lincoln along small bay with\nboats.\n\nExt. Bar - Waist to full figure Pan Right to Left.  Detective\ncomes out eating pizza, looking around.  He crosses street\nand stops against wall of impasse Michael.\n\nHe looks O.S. left,\n\nHis POV - L.S. of Lincoln behind fishing nets.\n\nWaist shot of Detective looking and eating.\n\nM.S. of Lincoln.\n\nC.S. of Detective looking O.S. Left.\n\nPan Right to Left with Charnier coming out from Fonfon with\nthree friends and they walk to the Lincoln.\n\nPan Left to Right with Lincoln passing in front of the\nDetective.\n\n<b>EXT. CAFE LA SAMARITAINE\n</b>\nHigh angle from balcony.  Zoom on Detective seated at the\ncafe, reading a newspaper.\n\nCut on Lincoln along sidewalk of the cafe, then zoom back to\ndiscover Detective seated.\n\n<b>EXT. MARSEILLE STREETS\n</b>\nLow angle from stairs Rue des Repenties and Pan Left to\nRight to Rue Sainte Francoise following the Detective.\n\nPan Left to Right with Detective from Rue des Repenties to\nRue Baussenque.\n\nLow angle between Rue des Moulins and Rue des Accoules with\nDetective passing by.\n\nExt. Rue du Panier - The Detective comes out from the bakery\ncamera Right and starts to climb up Rue des Moulins with his\nbread.\n\n<b>EXT. STREET\n</b>\nHigh angle - on No. 50 Rue des Moulins.  Pan Left to Right\nwith Detective coming up the street with his bread and going\ninside his house, starting to open his letter-box.\n<b>\n</b><b>                                                            2.\n</b>\n\n<b>INT. CORRIDOR\n</b>\nHigh angle - complete reverse.  As the Detective starts to\nopen his letter-box in B.G. a hand pointing a gun moves in\nforeground and blows off half of the French Detective's head\nwith the first shot.\n\nCut to Nicoli C.S. who just fired.\n\n<b>EXT. A BAR IN BED-STUY - DAY\n</b>\nA large man in a Santa Claus suit and white beard is\nentertaining a group of black children.  He leads them in\nthe singing of a Christmas Carol (Hark the Herald Angels\nSing).  The man is DETECTIVE FIRST GRADE JIMMY DOYLE.  His\nattention is split between the children and the activity\ninside the bar.\n\n<b>INT. THE BAR - DOYLE'S POV - DAY\n</b>\nThe place is crowded with mid-day drinkers.  Dimly outlined\nat the far end of the bar are TWO BLACK MEN involved in some\nkind of transaction in which a package is exchanged for\nmoney.  As the transaction seems to be completed, cut to\n\n<b>EXT. THE BAR - DAY\n</b>\nSanta Claus (DOYLE) starts to ring his big Christmas bell,\nabove the singing.  The bell is a signal to DETECTIVE SECOND\nGRADE BUDDY RUSSO.  At this moment RUSSO is in the clothes\nof a hot dog vendor and is in fact working behind a hot dog\nwagon.  At the ringing of DOYLE's bell he takes off his\napron, leaves the wagon, and runs toward the bar.\n\n<b>                         DOYLE\n</b>                   (as RUSSO passes him)\n            The guy in the brown coat.\n\n<b>INT. THE BAR - DAY\n</b>\nRUSSO enter the bar on the run.  He stops and looks over the\nroom.\n\n<b>RUSSO'S POV\n</b>\nThere are TWENTY or THIRTY MEN at the bar, at least TEN are\nwearing brown coats!  The TWO MEN involved in the deal see\nRUSSO and start to run.  One (THE BUYER) takes off out of\nthe back door.  The other (THE PUSHER) jumps over the bar\nand heads for the front entrance.\n<b>\n</b><b>                                                            3.\n</b>\n\n<b>EXT. THE BAR - DAY\n</b>\nTHE PUSHER dashes out past Santa Claus (DOYLE).  RUSSO\nfollows him and all three give chase.\n\n<b>EXT. BED-STUY TENEMENT ALLEY - DAY\n</b>\nTHREE FIGURES running down a New York tenement alley, the\nfirst in flight, the others in pursuit.  We pick up the\nincredible clutter of such an alley, mounts of rusting beer\ncans, paper bags of garbage bulging and ripping open, old\nbed springs, burned out mattresses, etc.\n\n<b>EXT. BED-STUY TENEMENT ALLEY - DAY\n</b>\nClose shot of BLACK PUSHER tripping on the tangle of trash\ngoing up against the wall in his stumble, face toward the\ncamera, and the figures of RUSSO and DOYLE leaping upon him\nfrom off-camera.  There is a blur or fast struggle as DOYLE\nand RUSSO try to get his arms and put him against the wall.\nBLACK PUSHER writhes loose and we close in on a knife in his\nhand, plunging rapidly into RUSSO'S left forearm.\n\n<b>                         RUSSO\n</b>            Son of a bitch!\n\nThe words are both warning and a grunt of pain.  As RUSSO\ntakes the blade and utters the words, we simultaneously go\nto DOYLE crouching and snatching his .38 out of the right\nankle holster.\n\n<b>EXT. BED-STUY TENEMENT ALLEY - DAY\n</b>\nClose shot of DOYLE and the BLACK PUSHER, DOYLE pistol-\nwhipping him into submission with three lightening chops of\nthe gun to the PUSHER'S head.  DOYLE continues to beat the\nman mercilessly into submission.\n\n<b>INT. DOYLE'S CAR - DAY\n</b>\n3-shot of BLACK PUSHER sitting between DOYLE and RUSSO.\nDOYLE is at the wheel.  BLACK PUSHER is sitting on his\nhands, wrists manacled behind him, his head down and dripping\nblood onto the jacket and the canary-yellow turtleneck.  All\nthree are breathing hard.\n\n<b>                         DOYLE\n</b>            What's your name, asshole?\n\n<b>                         BLACK PUSHER\n</b>            Fuck you, Santa Claus!\n\nDOYLE hits him across the face.\n<b>\n</b><b>                                                            4.\n</b>\n\n<b>                         RUSSO\n</b>            Your name is Willie Craven.\n\nBLACK PUSHER doesn't look up.\n\n<b>                         DOYLE\n</b>            Who's your connection, Willie?\n            What's his name?\n\nNo response.\n\n<b>                         RUSSO\n</b>            Who killed the old Jew in the\n            laundromat?\n\nBLACK PUSHER's brow furrows, looks up just a little.\n\n<b>                         BLACK PUSHER\n</b>            I don't...\n\n<b>                         DOYLE\n</b>            Ever pick your feet in Poughkeepsie?\n\n<b>                         BLACK PUSHER\n</b>            What?\n\n<b>                         DOYLE\n</b>            Did you ever pick your feet in\n            Poughkeepsie?\n\n<b>                         BLACK PUSHER\n</b>            I don't know what you're talkin'\n            about.\n\n<b>                         DOYLE\n</b>            Were you ever in Poughkeepsie?\n\n<b>                         BLACK PUSHER\n</b>            No... yeah...\n\n<b>                         DOYLE\n</b>            Did you ever sit on the edge of the\n            bed, take off your socks and stick\n            your fingers between your toes?\n\n<b>                         BLACK PUSHER\n</b>            Man, I'm clean.\n\n<b>                         DOYLE\n</b>            You made three sales to your\n            roaches back there.  We had to\n            chase you through all this shit and\n            you tell me you're clean?\n<b>\n</b><b>                                                            5.\n</b>\n\n<b>                         RUSSO\n</b>            Who stuck up the laundromat?\n\n<b>                         DOYLE\n</b>            How about that time you were\n            picking your feet in Poughkeepsie?\n\nThe BLACK PUSHER'S eyes go to RUSSO in panic, looking for\nrelief from the pressure of the inquisition.\n\n<b>                         RUSSO\n</b>                   (in pain)\n            You better give me the guy who got\n            the old Jew or you better give me\n            something or you're just a memory\n            in this town.\n\n<b>                         BLACK PUSHER\n</b>            That's a lot o' shit.  I didn't do\n            nothin'.\n\nThe BLACK PUSHER's eyes are on DOYLE, frozen in confusion\nand fear.\n\n<b>                         DOYLE\n</b>            You put a shiv in my partner.  Know\n            what that means?  All winter I\n            gotta listen to him gripe about his\n            bowling scores.  Now I'm gonna bust\n            your ass for those three bags -\n            then I'm gonna nail you for pickin'\n            your feet in Poughkeepsie.\n\n<b>EXT. HEADQUARTERS NARCOTICS BUREAU OF THE NYPD 12 OLD SLIP\n</b><b>AND SOUTH STREETS - NIGHT\n</b>\nDOYLE and RUSSO standing side by side on the front steps of\nthe old First Precinct on the Lower East Side of Manhattan.\nRUSSO has his overcoat over his shoulders as a cape.  The\nsleeve of his left arm is rolled up over a blood-stained\nbandage on the left forearm.\n\n<b>                         DOYLE\n</b>            Havin' trouble?  You're a dumb\n            guinea.\n\n<b>                         RUSSO\n</b>            How'd I know he had a knife.\n\n<b>                         DOYLE\n</b>            Never trust a nigger.\n\n<b>                         RUSSO\n</b>            He coulda been white.\n<b>\n</b><b>                                                            6.\n</b>\n\n<b>                         DOYLE\n</b>            Never trust anybody.  You goin' sick?\n\n<b>                         RUSSO\n</b>            Not a chance.\n\nRUSSO nods in acceptance of the remark.  The easy, synical\nrapport between them is obvious: they are partners in a\nbusiness where somebody is always getting hurt and pain is\npart of the inventory.\n\n<b>                         DOYLE\n</b>            Let's popeye around the Chez for a\n            half hour, catch the end of the\n            show and a couple drinks.\n\n<b>                         RUSSO\n</b>            Some other time Jimmy, I'm beat.\n\nDOYLE reaches into the right side pocket of BUDDY's suitcoat\nfor a cigarette and matches.  He lights up two in the pause,\nsticks one in RUSSO's mouth.\n\n<b>                         DOYLE\n</b>            Come on -- one drink.  Whatta you\n            say?\n\n<b>                         RUSSO\n</b>            Drink this.\n\n<b>                         DOYLE\n</b>            Whip it out.\n\n<b>INT. THE CLUB - NIGHT\n</b>\n<b>THE TITLES COMMENCE\n</b>\n<b>                    THE FRENCH CONNECTION\n</b>\nTitles over a close shot of a chorus line, with lots of tits\nand ass and lean, long legs in a brassy blare of music.  We\nzoom back to the area where DOYLE and RUSSO are beginning to\noccupy a table.  RUSSO takes the seat on the right, eyes\nimmediately on all that ginch, while DOYLE standing, gives\ntheir order.  We do not hear the dialogue but DOYLE asks\nRUSSO what he wants BUDDY looks up and says \"Cinzano.\" DOYLE\nturns and says \"Two of these.\" DOYLE slips into the chair\nopposite RUSSO and the titles roll on.  Unlike RUSSO who is\nconcentrating on the girls, DOYLE is digging the room and\nthe people who occupy the tables in it, as if he is the sort\nof man who cannot relax until he knows who is around him,\nwhy they are there.\n<b>\n</b><b>                                                            7.\n</b>\n\n<b>INT. THE CLUB - NIGHT\n</b>\nA long view from DOYLE's position of the room, a quick\ncertain survey that stumbles twice; on laughter that seems\ntoo raw and then over a flurry of activity by WAITERS and\nCAPTAINS serving a table on the main floor.  DOYLE's\nattention is apprehended by the noise and activity that\nemanate from the same large table.\n\n<b>                         DOYLE\n</b>            I make at least two junk connections\n            at that table in the corner.  The\n            guy is the stripe combo, I know him\n            too.\n\n<b>                         RUSSO\n</b>            Hey, I thought we come for a drink.\n\n<b>INT. THE CLUB - NIGHT\n</b>\nA long view of the table with DOYLE and RUSSO very close\nforeground, left and right.  DOYLE is leaning on an elbow.\n\n<b>                         DOYLE\n</b>            Who is that guy?\n\n<b>                         RUSSO\n</b>            Policy man in Queens.\n\n<b>                         DOYLE\n</b>            What about the last of the big-time\n            spenders.  You make him?\n\nRUSSO's eyes come off the show.  It is a direct line from\nDOYLE's gaze to the round, ruddy and arrogant face of SAL\nBOCA, the apparent host of the table of EIGHT MEN AND WOMEN,\nthe Men in dinner jackets with ties tucked under the collars\nof blue or white lace-trimmed shirts, the Women in a mixture\nof pant suits and Catskills cocktail party dresses, their\nhair coiffed towers.\n\n<b>                         RUSSO\n</b>            No, you?\n\n<b>                         DOYLE\n</b>            Hunh-uh.  Check the bread.  He\n            spreads it like the Russians are in\n            Jersey.\n\n<b>                         RUSSO\n</b>            He probably sells insurance.  Owns\n            a chicken farm in Hackensack.\n<b>\n</b><b>                                                            8.\n</b>\n\nZoom in slowly on SAL as he deals tips and orders.  Through\nDOYLE's eyes, we go from Guest to Guest at SAL's table,\ntaking apart their manners and styles as they talk and\nlaugh, lost in the show chatter.\n\n<b>INT. THE CLUB - NIGHT\n</b>\nDOYLE finishing his drink, still looking at the table.\n\n<b>                         DOYLE\n</b>            Dig who's just come over.  The\n            creep on the end.\n\n<b>INT. THE CLUB - NIGHT\n</b>\nThe camera pans down the table to dig the \"creep on the end.\"\n\n<b>                         RUSSO (VO)\n</b>            Jewish Lucky from the Bronx... He\n            don't look the same without a\n            number across his chest.\n\n<b>INT. THE CLUB - NIGHT\n</b>\nDOYLE close in right profile, SAL's table in the far blurred\nbackground.\n\n<b>                         DOYLE\n</b>            Whatta you say we wait and give him\n            a tail?\n\n<b>                         RUSSO\n</b>            Give who a tail?\n\n<b>                         DOYLE\n</b>            The greaser with the blonde.\n\n<b>                         RUSSO\n</b>            What for -- you wanna play Hide the\n            Salami with his old lady?\n\n<b>                         DOYLE\n</b>            Come on -- just for fun --\n\n<b>INT/EXT. DOYLE'S CAR - NIGHT\n</b>\nThe view from the back seat of DOYLE's car.  DOYLE is at the\nwheel, RUSSO packed uncomfortably into the corner at DOYLE's\nright.  Seventy-five yards away on the other side of the\nstreet the canopied entrance of the Club.  A Continental is\nparked in front of the club.  The DRIVER leaning on a fender\ntalking with the DOORMAN.  DOYLE frisks his own pockets for\na cigarette, coming up with a collection of laundry slips,\ncrumpled notes, toothpicks and matches.\n<b>\n</b><b>                                                            9.\n</b>\n\nOne of the slips of paper catches his eye as he is going\nthrough the ritual of the cigarette mooch, a slip bearing\nthe name of a girl.  His attention is really on the entrance\nof the Club and both his conversation and the cigarette\nbusiness are detached and incidental to the art of waiting\nthrough the stakeout.  He stuffs the cards back into his\npocket.\n\n<b>                         DOYLE\n</b>            Monica?  Who's Monica?\n\n<b>                         RUSSO\n</b>                   (handing him a cigarette)\n            A and A, that's all you're\n            interested in -- Arrests and Ass.\n\nAs soon as DOYLE has finished lighting the cigarette SAL and\nhis PARTY come bubbling out of the Club noisily, a little\ndrunkenly.  SAL waves to the attentive DOORMAN.\n\nDOYLE close, leaning forward over the wheel to put his hand\non the ignition key.  He does not turn it.  He is waiting\nfor the cover of noise from the starting of SAL's car.\nRUSSO is turning the opposite corner of the car into a bend,\nhis head back, arms across his chest.\n\n<b>                         DOYLE\n</b>            Cloudy, I'll lay odds he takes us\n            to Little Italy.\n\nDOYLE reaches under his seat for the straw surveillance\nhat - throws it up to read ledge of car.\n\n<b>                         RUSSO\n</b>            I'm telling you, Popeye, he owns a\n            bagel mine in the Bronx.\n\nA long view of the Club entrance.  SAL and ANGIE, a well-\nbuilt \"classy\" blonde with good legs, get into their black\nMercury sedan.  The Mercury takes off towards First Avenue.\nWe hear DOYLE's car start and we move off after them on the\nlast blink of tail-lights at the corner.\n\n<b>EXT. BROADWAY - NIGHT\n</b>\nCabs, Daily News and Times delivery trucks, bakery vans and\na few cruising cabs, one or two passenger cars and a coasting\ngreen and black police cruiser -- this is the 4:30 a.m.\ntraffic through which DOYLE moves.\n\nA rear-window view of SAL and ANGIE BOCA, in animated\nconversation.  His head is turned toward her, his hand\nraised in a gesture.  ANGIE is sitting in a corner with her\nback to the door, in profile to the back window.\n<b>\n</b><b>                                                           10.\n</b>\n\nHer blonde head bobbles with laughter over some remark SAL\nhas made.\n\nA long overhead view of the two cars wheeling in and out of\nthe sparse traffic.\n\nClose shot of the license plate on BOCA's car.\n\nClose shot DOYLE staring at license plate, memorizing it.\n\n<b>EXT. RATNER'S - DAY\n</b>\nBOCA and ANGIE exit restaurant, get into their car and drive\noff.  Hold for DOYLE's car as it passes through after them.\n\n<b>EXT. MULBERRY STREET - DAY\n</b>\nSide close view of SAL turning south into Mott Street\npanning to pick up the Italian names on the candy stores,\nfuneral parlors, bars, grocery stores, social clubs.\n\nA long view of SAL's car from the DOYLE-RUSSO auto, over the\nshoulders of the two cops.  DOYLE is leaning on the wheel of\nhis car.  He's against the curb about 100 yards behind SAL.\n\nMedium close view of SAL in the middle of Mott Street,\nwalking quickly toward the opposite side of the street,\nhands in the pocket of his white raincoat.  He glances over\nhis shoulder in the direction of DOYLE's car.\n\nClose of RUSSO who has come awake.  The smart-ass demeanor\nhas dropped away.  DOYLE turns to him and smiles.  This\ndistrict is the heart of every illegal activity in New York.\n\nClose rear view of DOYLE and RUSSO ducking down to the level\nof the dashboard, a reflex action.  He couldn't see them at\nthat distance, although SAL, lighted by his own headlights,\ncan be seen in the background walking around the cars,\nacross the sidewalk and stopped at a recessed doorway.\n\nMedium close shot of SAL and partially visible FIGURE at the\ndoorway.  With another glance up the street, SAL takes\nsomething out of his raincoat pocket and steps up and into\nthe doorway.\n\n<b>INT. DOYLE'S CAR - DAY\n</b>\nClose from the front of DOYLE and RUSSO low against the\ndashboard.\n\n<b>                         DOYLE\n</b>            It's a drop!\n\nDOYLE's face, close, light smile.\n<b>\n</b><b>                                                           11.\n</b>\n\nLong view of SAL walking down the sidewalk quickly for about\na quarter of a block while the headlights of his car, with\nANGIE apparently driving, move up with him.  At another\ndoorway, he looks back and then steps inside.\n\n<b>EXT. BROOKLYN BRIDGE - DAY\n</b>\nLong view of SAL's Mercury moving over Brooklyn Bridge.\n\nClose shot of the DOYLE-RUSSO car from RUSSO's side.  BUDDY\nnow interested, watching.\n\n<b>EXT. BROOKLYN - DAY\n</b>\nOverhead view of cars circling block, first Mercury turning\ncorner, then DOYLE's Ford.\n\nLong shot of the Mercury pulling up beside line of parked\ncars (as seen from DOYLE-RUSSO car) stopping and parking.\nHold on Mercury as SAL and ANGIE get out of it.  SAL locking\nit up, and starting to walk toward a line of parked cars.\n\nClose shot from rear seat of DOYLE and RUSSO glancing at\neach other.\n\nSAL and ANGIE stop in the street beside beat-up white Dodge.\nWithout a word they get in.  Hold as they get in, SAL starts\nand they begin to drive out of the spot.\n\nClose on DOYLE.\n\n<b>                         DOYLE\n</b>            It's startin' to cook, Cloudy, my\n            man is cookin'...\n\nA series of impressionist traveling shots of the white Dodge\nand DOYLE's Ford moving through Brooklyn Streets, picking up\nstreet signs of areas.\n\nMedium close shot of the white Dodge pulling into the curb.\nIn near background, a candy-confectionery store.\n\n<b>INT. DOYLE'S CAR - DAY\n</b>\nClose shot of DOYLE and RUSSO in profile driving past the\ncandy store as SAL and ANGIE open door and go in.\n\nClose shot of DOYLE and RUSSO parked.  DOYLE is looking in\nthe rear-view mirror while BUDDY is turned around on the\nseat, looking out the rear window.\n\nA long shot, from the DOYLE-RUSSO viewpoint of the candy\nstore.  The door is open, the street is deserted.  Lights\nare going on in the little shop.\n<b>\n</b><b>                                                           12.\n</b>\n\nHold on the storefront as SAL appears, this time in a candy\nstore operator's smock over a white undershirt, baggy slacks.\nHe's carrying a stack of newspapers.  Zoom in on SAL stacking\nthe Sunday Times and the Daily News on the rack in front of\nthe store as ANGIE appears in the doorway.  She's blackhaired\nnow, the blonde wig gone, also wearing a grey cotton smock\nover a plain skirt and sweater, holding a cup of coffee.  We\nhold on them for a beat, then\n\n<b>                                            CUT TO:\n</b>\nDOYLE and RUSSO close just looking at each other.  The look\nsays everything about the freak case they have stumbled into.\n\n<b>EXT. QUAY MARSEILLE SHIPYARD\n</b>\n1) Tight two shot then, 2) cut into blue prints.\n\n<b>                         CHARNIER\n</b>            En prolongeant les quais d'une\n            trentaine de mètres on pourra\n            recevoir des unités d'une cargaison\n            de 500 tonnes.\n\n3) While he shows the extension, clean P.O.V. Of each quay.\n\n4) Dolly Left to Right with Notre-Dame in background.  They\nfold the blue prints and moves.\n\n<b>                         FOREMAN MARCEL\n</b>            Et combien d'hommes supplémentaires?\n\n<b>                         CHARNIER\n</b>            Ca fera environ 10 hommes de plus\n            par équipe.\n\n<b>                         MARCEL\n</b>            Le Syndicat exigera un minimum de 12.\n\n<b>                         CHARNIER\n</b>            Quelle importance.  Ce qui compte\n            pour moi c'est d'avoir un chantier\n            qui puisse recevoir les plus grands\n            bateaux du monde.\n\n<b>                         MARCEL\n</b>            Dis moi vieille branche?  Comment\n            fais tu pour rester si jeune avec\n            la vie que tu mènes?\n\n<b>                         CHARNIER\n</b>            Quelle vie Marcel?  J'ai plus rien\n            foutu depuis que je suis descendu\n            de ces cabines.\n<b>\n</b><b>                                                           13.\n</b>\n\n<b>EXT. NUNNERY\n</b>\n<b>EXT. CORNICHE - HI-WAY (BERGER)\n</b>\nPan Left to Right Lincoln driven by Jean with Charnier behind.\n\n<b>EXT. CASSIS CROSSROAD IN FRONT OF MARSEILLE SIGN POST\n</b>\nLincoln passing by.\n\n<b>EXT. CASSIS HARBOUR FROM CASINO\n</b>\nPan Right to Left with Lincoln passing by.\n\n<b>EXT. CASSIS ROAD LEADING TO VILLA\n</b>\nPan Right to Left with Lincoln arriving from main road to\nVilla.\n\n<b>EXT. VILLA CASSIS\n</b>\nCamera in front of garage where the Lincoln stops.  Charnier\ncomes out with gift and walks Right to Left.\n\n<b>EXT. VILLA CASSIS\n</b>\nPan Left to Right with Charnier walking along terrace with\nCassis bay in B.G., and we discover his wife, Marie.  She\ngets up.  Dolly back.\n\n<b>                         CHARNIER\n</b>            Bonjour chérie.\n\nThey kiss each other and walk arm in arm back to us.\n\n<b>EXT. VILLA CASSIS\n</b>\nClose 2-shot favouring her.  He gives her the gift.\n\n<b>                         CHARNIER\n</b>            Tu sais j'ai réfléchi longuement à\n            ton cadeau pour le voyage.  Je l'ai\n            choisi moi-même.  Tiens.\n\n<b>                         MARIE\n</b>            Je peux l'ouvrir tout de suite?\n\n<b>                         CHARNIER\n</b>            Si tu veux.\n<b>\n</b><b>                                                           14.\n</b>\n\n<b>                         MARIE\n</b>                   (opening the gift)\n            Oh Alain!  C'est merveilleux!  Tu\n            me gâtes.  Je t'aime.  Attends, je\n            vais te montrer moi aussi ce que\n            j'ai acheté.\n\n<b>                         CHARNIER\n</b>            Encore du sho ping!\n\n<b>EXT. VILLA\n</b>\nL.S. Pan Right to left from under the trees following her as\nshe leaves Charnier to enter in the house.\n\n<b>EXT. VILLA\n</b>\nC.S. of Charnier along the terrace.  He throws a fishing\npole in the sea.\n\n<b>EXT. VILLA\n</b>\nPAN RIGHT TO LEFT with Marie coming back with a new coat.\n\n<b>                         MARIE\n</b>            Regarde mon pêcheur de baleine...\n            Tu sais il va faire très froid cet\n            hiver.\n\n<b>                         CHARNIER\n</b>            Avec ça tu pourras le supporter.\n\n<b>                         MARIE\n</b>            Mais non, c'est pour toi.\n\n<b>                         CHARNIER\n</b>            Pour moi?\n\n<b>                         MARIE\n</b>            Regarde, il te va parfaitement bien!\n\n<b>                         CHARNIER\n</b>            Formidable!  Sans toi je\n            m'habillerais encore en docker.\n                   (then, taking off coat)\n            Je suis passé voir Françoise.\n\n<b>                         MARIE\n</b>            Comment va-t-elle?\n\n<b>                         CHARNIER\n</b>            Je n'ai jamais vu tant de sérenité.\n            Elle m'a demandé de tes nouvelles\n            et si nous étions heureux.\n<b>\n</b><b>                                                           15.\n</b>\n\n<b>                         MARIE\n</b>            Le sommes nous?\n\n<b>                         CHARNIER\n</b>                   (he kisses her)\n            Non!\n\n<b>EXT. BOAT - CAR PARK\n</b>\nComplete Pan Left to Right with Lincoln passing in front of\nSamaritaine cafe.\n\nDriver pulls out.  Charnier comes out from Lincoln and we\nfollow him as he crosses Left to Right and jumps into the\nboat which moves out.\n\n<b>FROM BOAT\n</b>\nBack shot.  Charnier standing in the moving boat and smoking\nas Marseille diminishes in B.G.\n\n<b>OPENING SEA SHOT\n</b>\nFrom the boat approaching Chateau d'If.\n\n<b>ON PEER\n</b>\nPan Right to Left as Charnier gets out of boat and starts to\nclimb up.\n\nHigh angle thru first stone door with sea in B.G.  Charnier\ncomes up and turns Right to Left.\n\nHigh angle -- Pan Left to Right -- Low angle, with Charnier\ncoming up from 2nd arch to 3rd arch thru which we see the\ntower in B.G.\n\n<b>EXT. CHATEAU D'IF - 1ST PLATFORM\n</b>\nPan Left to Right with Charnier arriving on terrace.\n\n<b>EXT. CHATEAU D'IF - CHARNIER - HIS POV\n</b>\nNicoli back to us.  He turns left shoulder as we approach to\nhim.\n\n<b>EXT. CHATEAU D'IF - TWO SHOT\n</b>\nDolly back preceding Charnier and Nicoli after they meet and\nPan Left to Right to the Rotonde.\n\n<b>                         CHARNIER\n</b>            Ca a marché?\n<b>\n</b><b>                                                           16.\n</b>\n\n<b>                         NICOLI\n</b>            Au poil.\n\nThey turn around.\n\n<b>                         CHARNIER\n</b>            Sale boulot.\n\n<b>                         NICOLI\n</b>            Il fallait le faire.\n\n<b>                         CHARNIER\n</b>            Il est en retard.\n\n<b>                         NICOLI\n</b>            Je crois qu'on fait une erreur de\n            le prendre avec nous.\n\n<b>                         CHARNIER\n</b>            Une erreur!  C'est génial.  C'est\n            une vedette à la télévision.  Il\n            peut aller partout sans être\n            soupçonné... En plus il a besoin de\n            fric.\n\n<b>                         NICOLI\n</b>            J'ai pas confiance en lui.\n\n<b>                         CHARNIER\n</b>            Sois gentil avec lui.  On ne sait\n            jamais.  Il peut te faire travailler\n            à la télévision.\n\n<b>EXT. CHATEAU D'IF\n</b>\nCut on Devereau arriving.  He sees them.\n\n<b>EXT. CHATEAU D'IF\n</b>\nPan Left to Right bringing Charnier and Nicoli towards\nDevereaux to finish in 3-shot.\n\n<b>                         CHARNIER\n</b>            Henri c'est gentil d'être venu.  Je\n            vous présente mon associé, Pierre\n            Nicoli.  Henri Devereaux.\n\n<b>                         DEVEREAUX\n</b>            Enchanté.\n                   (they shake hands)\n            Alain, j'ai réfléchi à votre\n            proposition et j'ai décidé\n            d'accepter.\n<b>\n</b><b>                                                           17.\n</b>\n\nSURVEILLANCE MONTAGE OF SAL BOCA's activities.  From time to\ntime DOYLE and RUSSO are visible, but their dialogue is for\nthe most part VOICE OVER.\n\n<b>INT/EXT. BROOKLYN CANDY STORE - DAY\n</b>\nVarious shots of SAL and ANGIE.  Several shots of DOYLE and\nRUSSO in the CANDY STORE: reading magazines, having lunch\nseparately.  They are also seen in the LEATHER FACTORY\nacross the street observing the CANDY STORE.  Several\nCHARACTERS enter the CANDY STORE from time to time and go\ninto the BACK ROOM.\n\nFollowing are a series of cuts (MOS) to be used with the V.O.\ndialogue of RUSSO and DOYLE.\n\n<b>INT. CANDY STORE - DAY\n</b>\nSAL counts the receipts.  Two or three CUSTOMERS in the BG.\n\nSAL removes a tray of Ziti from the oven.  ANGIE makes an\norder to go.\n\nSAL removes garbage from the back area.\n\n<b>                         RUSSO (V.O.)\n</b>            Our friend's name is SALVATORE BOCA.\n            They call him SAL.  He's a\n            sweetheart.  He once was picked up\n            on suspicion of armed robbery.\n            Tried to hold up Tiffany's on Fifth\n            Avenue!  In broad daylight!  Could\n            have got two-and-a-half to five,\n            but they wouldn't prosecute.  Also\n            downtown they're sure he pulled off\n            a contract on a guy named DeMarco.\n\n<b>EXT. CANDY STORE - DAY\n</b>\nSAL putting garbage into cans.  Pan and Zoom to DOYLE and\nRUSSO in window of FACTORY across the street.\n\n<b>INT. CANDY STORE - DAY\n</b>\nANGIE carries bowl of hard-boiled eggs from rear of store to\nthe front.\n\n<b>                         DOYLE (V.O.)\n</b>            His old lady?\n\nANGIE makes a tuna sandwich on a roll.  A cigarette dangles\nfrom her lips.  SAL is in BG at cash register with customer.\n<b>\n</b><b>                                                           18.\n</b>\n\n<b>                         RUSSO (V.O.)\n</b>            Her name's Angie... Fast filly...\n            she drew a suspended for shoplifting\n            a year ago... only a kid, nineteen\n            according to the marriage license.\n\nFrom front of store looking to back.\n\n<b>                         DOYLE (V.O.)\n</b>            Yeah, nineteen goin' on fifty.\n            What else?\n\nRUSSO is at counter eating lunch with three others... ANGIE\nserving.  She wears a sleeveless sweater; shows lots of tit.\nRUSSO digs... she digs him.  A wise guy comes in, goes to\nthe back room.  SAL follows.\n\n<b>                         RUSSO (V.O.)\n</b>            He's had the store a year an'a\n            half... takes in a fast seven grand\n            a year.\n\n<b>EXT. CANDY STORE - DAY\n</b>\nPOV from FACTORY window... Two Wise Guys in big coats and\nhats pull up in a big car.  They enter store.\n\n<b>                         DOYLE (V.O.)\n</b>            So what's he doin' with two cars\n            and hundred dollar tabs at the Chez?\n\n<b>INT. CANDY STORE - DAY\n</b>\nAngie shooting from back of store towards front.  The Two\nWise Guys enter, go to Back Room.  SAL follows.  They close\ndoor.  DOYLE is at the magazine counter in front.  He sits\ndown with magazine.  Orders coffee.\n\n<b>                         RUSSO (V.O.)\n</b>            The Merc's in his wife's name.\n            Dodge belongs to his brother.\n\n<b>WARD'S ISLAND - DAY\n</b>\nA heavy-faced, dirty looking man in a Sanitation Dept.\nuniform in a group of men practising with Sanitation trucks.\n\n<b>                         RUSSO (V.O.)\n</b>            Lou... he's a trainee at the\n            Sanitation School on Ward's Island.\n            Served time a couple of years ago,\n            on assault and robbery raps.\n<b>\n</b><b>                                                           19.\n</b>\n\n<b>SEVERAL SHOTS - DAY\n</b>\n<b>EXT. CANDY STORE\n</b>\nLOU pulls up.  As LOU picks up SAL.  They drive to various\nbuildings in Brooklyn.  One or the other gets out briefly,\nthen goes on.  DOYLE and RUSSO watch from DOYLE's car.\n\n<b>SUYDAM STREET\n</b>\n<b>                         DOYLE\n</b>            If that's not a drop or a pickup,\n            I'll open a charge for you at\n            Bloomingdale's.\n\n<b>                         RUSSO\n</b>            Make it Alexander's, I like the toy\n            department.\n\n<b>                         DOYLE\n</b>            Toy wit' this will ya.\n\n<b>EXT/INT. \"MICKEY'S TWO DOOR\" - DAY\n</b>\n<b>                         RUSSO\n</b>            There's about a hundred years'\n            parole time in there night or day.\n\nSAL arrives alone.  DOYLE and RUSSO in parked car across\nstreet.\n\n<b>                         DOYLE\n</b>            They treat our boy like a king.\n            Wonder why he don't bring his old\n            lady?\n\nSAL flirts with the BARMAID.\n\n<b>                         RUSSO\n</b>            There's your answer...\n\n<b>THROUGH RIDGEWOOD - DAY\n</b>\nRestaurants, stores, etc.\n\n<b>                         DOYLE\n</b>            Who's the greaser?\n\nWith SAL and his FATHER.\n\n<b>                         RUSSO\n</b>            It's his father.\n\nDOYLE and RUSSO in parked car.\n<b>\n</b><b>                                                           20.\n</b>\n\n<b>                         DOYLE\n</b>            I think we oughta burn him on\n            suspicion.\n\n<b>                         RUSSO\n</b>            Suspicion of what?\n\n<b>                         DOYLE\n</b>            Makin' wine in the basement.\n                   (pause)\n            He looks like that wop stooge used\n            to drive for the Fracisi brothers.\n\nLOU joins them.  He and SAL leave together after each kisses\nand embraces the old man.\n\n<b>                         RUSSO\n</b>            Lay off with that wop stuff, will\n            you?\n\n<b>EXT. WEINSTOCK'S APT. BUILDING - DAY\n</b>\nIn the East 80's.  SAL exits.\n\n<b>                         DOYLE\n</b>            That's the third time he come here\n            this week.  You got anything on the\n            building?\n\nDOYLE and RUSSO in parked car.\n\n<b>                         RUSSO\n</b>            The building's clean.  I checked\n            the tenant list -- Don Ameche, the\n            actor lives there -- oh, and\n            somebody else.  Do the name Joel\n            Weinstock ring a bell?\n\n<b>TIME LAPSE\n</b>\nLate day.  WEINSTOCK leaving building, nodding to doorman.\n\n<b>                         DOYLE\n</b>            You're kiddin'\n\nDOYLE and RUSSO in parked car.\n\n<b>                         RUSSO\n</b>            No sir -- this is where Joel lives.\n\n<b>                         DOYLE\n</b>            He was the bank on that shipment\n            outta Mexico three years ago.\n<b>\n</b><b>                                                           21.\n</b>\n\n<b>                         RUSSO\n</b>            So I've heard.\n\n<b>EXT. CANDY STORE - NIGHT\n</b>\nSAL and ANGIE leaving.\n\n<b>                         DOYLE\n</b>            Whatta you know -- he's takin' his\n            wife out for a change.\n\nDOYLE and RUSSO in parked car.\n\n<b>INT. LEATHER FACTORY - DAY\n</b>\nAcross street from Candy Store.  DOYLE and RUSSO at the\nprinting machine.\n\n<b>                         DOYLE\n</b>                   (at leather printing machine)\n            Got a job for me when this is over,\n            Mrs. Levene?\n\nThey have a view of the Candy Store across street.  Various\npeople go in and out.  Next to DOYLE, at a stamping machine,\nis MRS. LEVENE, the factory owner.\n\n<b>                         MRS. LEVENE\n</b>            What are you fellows looking for?\n            What do you want from that nice\n            candy store?\n\n<b>                         DOYLE\n</b>            We have reason to believe it's a\n            front for the biggest counterfeiting\n            operation in the country.\n\n<b>                         MRS. LEVENE\n</b>            What?\n\n<b>                         DOYLE\n</b>            That's right.  They're trying to\n            steal the formula for Hershey\n            bars --\n\nDOYLE continues his work at the print-out machine, while\nobserving the candy store.\n\nWe see SAL leaving the store.  He crosses to his car, near\nthe RUSSO car.  As he passes it, he sees RUSSO locked in\nembrace with a lady in a babushka.  As SAL drives off, we\nget a closer look at the \"LADY\" in the babushka: DETECTIVE\n<b>JAMES DOYLE.\n</b><b>\n</b><b>                                                           22.\n</b>\n\n<b>INT. RUSSO'S CAR ON TRIBORO BRIDGE CROSSING TO WARD'S ISLAND\n</b>\n<b>                         DOYLE\n</b>            What the hell am I drivin' for?\n            I'm a first grade Detective.\n            You're a second grade guinea.\n\n<b>                         RUSSO\n</b>            I'm wounded.  Oh, oh.\n\nSAL up ahead in the Mercury.\n\n<b>                         DOYLE\n</b>                   (at the wheel)\n            What?\n\n<b>EXT. WARD'S ISLAND - BRIDGE\n</b>\nThe Mercury crossing the bridge to the Island.\n\n<b>                         RUSSO\n</b>            He's goin' to Ward's Island.  We'll\n            get spotted.  What the hell's he\n            goin' there?\n\nDOYLE-RUSSO car B.G.\n\n<b>                         DOYLE\n</b>            Maybe he's goin' to see his brother.\n\n<b>                         DOYLE\n</b>            Or could be another drop.  I guess\n            he gets a free ride.\n\n<b>EXT. BROOKLYN STREET - DAY\n</b>\nA Brooklyn slum street on a morning in November.  It is\nabout 11 o'clock and relatively quiet.  A scattering of\ntenement URCHINS give the street some sound and life.  There\nare a couple of dark shops on the street and a bar, all\nappearing to be closed.  We look down the street and pick up\nDOYLE and RUSSO coming down it, walking very quickly.  They\nare heading toward the bar.  A young man is coming out -\nthey grab him and throw him back.\n\n<b>INT. BAR ROOM - DAY\n</b>\nThe Young Man is thrown in, followed by DOYLE and RUSSO.\nThere are about 20 or 30 PUETRO RICAN and BLACK MEN in the\njoint, a couple of BLACK WOMEN.  They are in all manner of\ndress.  Half of them are wearing shades.  The bar is noisy\nwith conversation, laughter and music.\n<b>\n</b><b>                                                           23.\n</b>\n\nDOYLE and RUSSO standing in the doorway, DOYLE slightly to\nthe left, RUSSO a little behind him.  DOYLE's arms are at\nhis sides.  RUSSO's right hand is crossed over his belt,\nunder his jacket and on the butt of his .38, ready, waiting\nto back his partner's play or respond to any move within the\nbar.\n\nDOYLE moving into the bar alone.  He pulls the plug out of\nthe Juke Box, plunging the room to silence.\n\n<b>                         DOYLE\n</b>            Hands on your heads.  Popeye's here!\n\nTwenty men raise hands to their heads as one.  The raggle-\ntaggle swarm plays a kind of human chicken, refusing to move\nuntil the last moment then stepping out of his way.  One of\nthe customers doesn't.\n\n<b>                         DOYLE\n</b>            What's my name?\n\n<b>                         1ST MAN\n</b>            Doyle.\n\n<b>                         DOYLE\n</b>            What?\n\n<b>                         1ST MAN\n</b>            Mr. Doyle.\n\n<b>                         DOYLE\n</b>            Ever pick your feet in Poughkeepsie?\n\n<b>                         1ST MAN\n</b>            What?\n\nDOYLE raises his left arm and pushes the MAN aside.  The\nMAN's eyes go to RUSSO, off-camera at the door, and back to\nDOYLE.  He doesn't resist; he gets in line with the rest of\nthem, a line formed about four or five feet from the bar,\nrunning the length of it.\n\nClose of DOYLE at the bar, holding an ashcan and skimming\nthe metal underrailing with one finger, knocking off the\nmagnetized key boxes into the ashcan.  He isn't even looking\nat them.  His eyes are across the bar, staring down the\ncustomers.\n\nClose shot of the ashcan and the little metal boxes clinking\ninto it.\n\nClose shot of DOYLE, the ashcan now on the bar, opening one\nof the boxes, taking out the ten dollar bill, putting it on\nthe bar.\n<b>\n</b><b>                                                           24.\n</b>\n\nThen, opening another, taking out the glassine deck of\nheroin.  Then another, containing a glassine deck.  He\nempties the glassine envelopes on the bar into a cocktail\nmixer which he proceeds to shake.  The shaker is half-filled\nwith tomato juice.\n\nDOYLE leaning over the bar toward the glaring crowd, pours\nthe mixture into the ashcan.\n\n<b>                         DOYLE\n</b>            Milk shake anyone?\n\nHe wiggles his finger.  It is a command for THREE MEN to\nstep forward.  The MEN do not move at first.\n\n<b>                         DOYLE\n</b>            Move ass when I tell you.\n\nThey move, shuffling, hesitatingly.  But they move -- TWO\nBLACKS and A PUETRO RICAN.\n\n<b>                         DOYLE\n</b>            Put it on the bar.\n\nHands of the THREE MEN going into pockets.\n\nClose of a miscellany of keys, coins, cigarettes going onto\nthe bar -- with two hypodermics, six or eight marijuana\ncigarettes, a small plastic vial of barbiturates.\n\n<b>                         DOYLE\n</b>                   (collecting the works)\n            All right, you three clowns step\n            into those phone booths, you're\n            goin' in.  Go on.  Stand in there\n            till I'm ready for you.\n\nThe three men turn and enter the individual phone booths.\nThey stand, waiting, like contestants in the $64 Question.\n\n<b>                         DOYLE\n</b>            Everybody goes when the whistle\n            blows.\n\nRUSSO is with another man from whom he's just taken a set of\nworks.\n\n<b>                         RUSSO\n</b>            What's your story?\n\n<b>                         DANCER\n</b>            Gimme a break, Mr. Russo.  I'm in\n            show business.\n<b>\n</b><b>                                                           25.\n</b>\n\n<b>                         RUSSO\n</b>            You're in show business.\n\n<b>                         DANCER\n</b>            S'right.\n\n<b>                         DOYLE\n</b>            What do you do in show business?\n\n<b>                         DANCER\n</b>            I'm a dancer.\n\n<b>                         RUSSO\n</b>            All right, get up on that bar and\n            dance.\n\n<b>                         DANCER\n</b>            What?\n\n<b>                         RUSSO\n</b>            Get up on the bar and show me how\n            you work.  If I like it you don't\n            have to go in.\n\n<b>                         DANCER\n</b>            You're for real?\n\n<b>                         JERRY LEON\n</b>            Hey man, why don't you let the\n            fella alone.\n\n<b>                         RUSSO\n</b>                   (a shout)\n            Am I talkin' to you -\n\n<b>                         JERRY LEON\n</b>            No, but I'm talkin' to you.\n\n<b>                         RUSSO\n</b>            I'm tellin' you to shut up and\n            stand over there.\n\n<b>                         RUSSO\n</b>                   (to Dancer)\n            Get up there.\n\nThe man climbs up on the bar.\n\n<b>                         DANCER\n</b>            I got no music!\n\n<b>                         RUSSO\n</b>            Fake it.\n<b>\n</b><b>                                                           26.\n</b>\n\nThe man goes into a fast tap dance.  But he only gets in a\nfew steps --\n\n<b>                         DOYLE\n</b>            All right, that's enough, you're\n            under arrest.\n\nRUSSO pulls the man off the bar, sends him into one of the\nphone booths.\n\nDOYLE coming down the front of the bar.  He stops before\nanother man, who has just come out of the toilet.\n\n<b>                         DOYLE\n</b>            What about you?  Can you stand a\n            toss?\n\n<b>                         2ND MAN\n</b>            I'm clean.\n\n<b>                         DOYLE\n</b>            You don't use shit?\n\n<b>                         2ND MAN\n</b>            No.\n                   (he goes for his wallet)\n\n\n<b>                         DOYLE\n</b>            Did I say you could move that\n            hand -- I'm not gonna get stuck am I?\n\n<b>                         2ND MAN\n</b>            No - no.\n\n<b>                         DOYLE\n</b>            Cause if I do.\n\nDOYLE frisks the man.  Comes up with vial of pills and two\nroaches.\n\n<b>                         DOYLE\n</b>            Wise guy, huh?  Let's see what else\n            you got.\n                   (to RUSSO)\n            - Buddy!\n\nHe collars the man and shoves him towards the toilet.\n\nRUSSO, eyes moving everywhere, hand on the gun.\n<b>\n</b><b>                                                           27.\n</b>\n\n<b>                         RUSSO\n</b>            If I see any shit on the floor,\n            it's yours, so keep your eye on\n            your neighbor.\n\nInside the toilet of the bar.  The MAN is up against the\nwall.  DOYLE is only inches away.\n\nThe MAN is an AGENT and this is the only way DOYLE can get\nimmediate information from him without destroying the man's\ncover.  Their conversation is in whispers.  And very fast.\n\n<b>                         DOYLE\n</b>            How's everything?\n\n<b>                         2ND MAN\n</b>            Everything is everything.\n\n<b>                         DOYLE\n</b>            How come there's nothing out there?\n            That stuff is all milk.\n\n<b>                         2ND MAN\n</b>            There's nothing around.  Nobody's\n            holding.\n\n<b>                         DOYLE\n</b>            I got a name - Sal Boca, Brooklyn.\n\n<b>                         2ND MAN\n</b>            Boca?\n\n<b>                         DOYLE\n</b><b>            B.O.C.A.\n</b>\n<b>                         2ND MAN\n</b>            Doesn't register.\n\n<b>                         DOYLE\n</b>            Got a wife named Angie.\n\n<b>                         2ND MAN\n</b>            No, nothing.  There's only some talk.\n\n<b>                         DOYLE\n</b>            What?\n\n<b>                         2ND MAN\n</b>            Coming in this week, week after.\n            Everybody going to get well.\n\n<b>                         DOYLE\n</b>            Who brings it?\n<b>\n</b><b>                                                           28.\n</b>\n\n<b>                         2ND MAN\n</b>            Who knows?\n\n<b>                         DOYLE\n</b>            Where do you want it?\n\n<b>                         2ND MAN\n</b>            This side.\n\nDoor of toilet.  There is a hell of a crash and slamming\nbehind it.  Door opens and DOYLE steps out over the crumpled\nprostrate form of the INFORMER.  He has just decked the man\nto continue the protection of the cover.  He pauses halfway\ndown the line as if he's speculating on beating up another\none because he didn't get any information.  But he decides\nthat would be futile too.\n\n<b>                         DOYLE\n</b>            I'm goin' check on this address in\n            the Bronx, if you're bullshitting\n            me, it's your ass.\n\n<b>                         RUSSO\n</b>            Tell everybody we'll be back in an\n            hour.\n\n<b>                         DOYLE\n</b>                   (to all)\n            We're goin' now!  Goodbye.\n\n<b>EXT. PASSENGER SHIP - DAY\n</b>\nClose shot of DEVEREAUX, New York harbor in the background,\nbeing interviewed by television reporters on his arrival in\nthe U.S. abroad a passenger ship.  He is smiling, jovial,\ncharming.\n\n<b>                         REPORTER 1\n</b>            How long will you be here?\n\n<b>                         DEVEREAUX\n</b>            Not long enough.  Two... perhaps\n            three... weeks at most.\n\nMedium close shot of DEVEREAUX and THREE TV REPORTERS, as\nthey talk, a crane moves into action behind them and lifts\nout of hold.  LA VALLE is with DEVEREAUX as Translator and\nInterpreter.\n\n<b>                         GIRL TV REPORTER\n</b>            Why did you come by ship, Mr.\n            Devereaux?\n<b>\n</b><b>                                                           29.\n</b>\n\n<b>                         DEVEREAUX\n</b>            The next several weeks will be very\n            difficult and the middle of the\n            ocean is the only place where the\n            telephone isn't ringing all the time.\n\n<b>                         REPORTER\n</b>            What will be the viewpoint of your\n            documentary.\n\n<b>                         DEVEREAUX\n</b>            To make a Frenchman feel what it is\n            like to be a New Yorker.\n\n<b>                         LA VALLE\n</b>            That's enough now, ladies and\n            gentlemen.  M. Devereaux is due at\n            his hotel in half an hour.\n\nOverhead the Lincoln comes down from the hold of the ship.\n\n<b>EXT. WEST SIDE DRIVE - DAY\n</b>\nA long view of the pier from the opposite (east) side of\nWest Street, beneath the steel trusses and girders of the\nWest Side Drive and through the forest of cars that are\nparked there, the jam of traffic that develops around every\nunloading vessel.  It is a view that takes in the front end\nof the Lincoln inching off the pier.  HENRI DEVEREAUX at the\nwheel, turns to his right.  We watch until the point of view\non the sidewalk.  ALAIN CHARNIER and PIERRE NICOLI are\nstanding there watching.  When the car (off-camera) turns\neast on the way to the garage, NICOLI glances to CHARNIER.\nCHARNIER does not look back.\n\n<b>EXT. DORAL HOTEL - LINCOLN PULLS IN - DAY\n</b>\n<b>INT. POLICE OFFICE - NIGHT\n</b>\nClose shot of WALTER SIMONSON at desk in the large square\noffice he occupies as a Lieutenant of Detectives in charge\nof the Manhattan Narcotics Bureau.  He is the immediate\nsuperior of RUSSO and DOYLE, head of the 200-man narcotics\nsquad that polices Manhattan.\n\n<b>                         SIMONSON\n</b>                   (with coffee cup)\n            All that is great -- but you guys\n            work Bed-Stuy.  You're not supposed\n            to be in Ridgewood.\n\nDOYLE, RUSSO and SIMONSON\n<b>\n</b><b>                                                           30.\n</b>\n\n<b>                         DOYLE\n</b>            Detach us.  Let us have a shot at\n            it, at least until we see if\n            there's anything here or not.\n            Everybody wants Weinstock, right?\n            So maybe here's a lead.  We deserve\n            it.\n\n<b>                         SIMONSON\n</b>            You couldn't burn a three-time\n            loser with what you're bringing in\n            here.  You know you stiffs could\n            run yourselves an entrapment rap.\n            The guy has done nothing -- Brooklyn\n            is full of Candy Store guys with\n            two cars who like to go to\n            nightclubs.\n\n<b>                         RUSSO\n</b>            Put this little candy hustler\n            together with Joel Weinstock and it\n            could be we stumbled into a big\n            score.\n\n<b>                         SIMONSON\n</b>                   (moves to window)\n            Big score!  He's dealin' a few bags\n            here and there on the side.\n\n<b>                         DOYLE\n</b>            Simonson, I wouldn't be infringing\n            on your coffee break if I thought\n            he was a nickel and dimer.\n\n<b>                         SIMONSON\n</b>            Your hunches have backfired before,\n            Doyle.\n\nDOYLE, close, no comment.\n\nBack to SIMONSON.\n\n<b>                         SIMONSON\n</b>                   (moves back to stand\n                   at desk)\n            Jimmy, what the hell's happening\n            with you lately?\n                   (pause)\n            You got more collars than any Narc\n            in the bureau.  What was it.  Over\n            100 last year?  Terrific.  But who?\n<b>                         (MORE)\n</b><b>\n</b><b>                                                           31.\n</b>\n\n<b>                         SIMONSON (CONT'D)\n</b>            You stop and shake down a bellboy\n            because he's got three joints in\n            his sock.  You hit a high school\n            kid in short pants who looks like\n            he's got a twitch.\n\nRUSSO.  Getting it back on the track.\n\n<b>                         RUSSO\n</b>                   (moves in to desk)\n            We got information that there's no\n            shit in the street -- it's like a\n            desert full of junkies with a big\n            score coming in to make everybody\n            well.\n\n<b>DOYLE\n</b>\n<b>                         DOYLE\n</b>            This could be it, Walter.  This\n            Candy Store guy, putting on a big\n            show in a fancy nightclub with\n            known connections all over him.\n            Then on our own, after working the\n            whole day and night, we tail him\n            out to Brooklyn and sit on him for\n            a week practically, and who do we\n            come up with?  Joel Weinstock.\n                   (he leans forward)\n            You gotta let us have it.\n\n<b>THREE SHOT - RUSSO, DOYLE, SIMONSON\n</b>\n<b>                         SIMONSON\n</b>                   (pause, he turns to RUSSO)\n            You really believe all this crap?\n\n<b>                         RUSSO\n</b>            I go with my partner.\n\nA pause.\n\n<b>                         SIMONSON\n</b>            What'll it take?\n\n<b>                         RUSSO\n</b>            First a wire.\n\n<b>                         DOYLE\n</b>            Two wires.  One on the store and\n            one on his house.\n<b>\n</b><b>                                                           32.\n</b>\n\n<b>                         SIMONSON\n</b>            You know I have to get a court\n            order for wiretaps.\n\n<b>                         RUSSO\n</b>            Try... okay?\n\n<b>                         DOYLE\n</b>            We know you can do it, Walter.\n\nThey start to leave.\n\nClose on SIMONSON.\n\n<b>                         SIMONSON\n</b>            Popeye...\n\nClose on DOYLE at the door.  RUSSO beside him.\n\nBack to SIMONSON\n\n<b>                         SIMONSON\n</b>            You still pickin' your feet in\n            Poughkeepsie?\n\n<b>WIRETAP SEQUENCE \"A\"\n</b>\n<b>INT. BASEMENT\n</b>\nRUSSO on phones -- checking notes on SAL.  DOYLE reading\ncomics on cot.  Tape machine clicks on -- tape is activated.\nRUSSO sits attentively.\n\n<b>EXT. CANDY STORE - DAY\n</b>\nShot of wire.\n<b>\n</b><b>                                                           33.\n</b>\n\n<b>           SAL (V.O.)                     RUSSO\n</b>  What's this crap.  I just          (He raps on table\n  spoke to my wife and she           with a coffee cup.\n  says you're raisin' me a           Doyle gets up.)\n  halfa cent on the cups.        C'mere and lissen to your\n                                 big connection.\n           WHOLESALER                (DOYLE comes over)\n           (V.O.)                He's fightin' with somebody\n  Yeah, well you know I          about a halfa cent.\n  shoulda raised this here a\n  long time ago.  We got a                DOYLE\n  inflation period...            How we gonna keep Simonson\n                                 from hearin' this?\n<b>           SAL (V.O.)\n</b>  I got your inflation.  I can            RUSSO\n  get the same cups on Delancey  If he does, we'll be back in\n  Street for what I been         Bed-Stuyvesant tomorrow.\n  payin' you for the last\n  year -- That's all I gotta\n  do with you guys -- next\n  time it'll be two cents on\n  the cones, then two cents on\n  the seltzer --\n\n<b>           WHOLESALER\n</b><b>           (V.O.)\n</b>  C'mon Sal, I got my orders,\n  too --\n\n<b>           SAL (V.O.)\n</b>  Well, if you can't do better\n  than that, you can stick the\n  cups.\n\n<b>EXT. AUTO GRAVEYARD (HUNTS POINT AND EAST RIVER) - DAY\n</b>\nHIGH ANGLE: Close shot of CHARNIER, MARIE and LA VALLE\nwalking slowly together toward the camera.  They are at the\nauto graveyard and the scene of an auction of cars towed off\nNew York streets by the Police Department.  About twenty\nother men are walking around, looking at the cars.\n\nA POLICEMAN blows a whistle and the prospective car buyers\ngather around the auction trailer in the b.g.\n\n<b>                         LA VALLE\n</b>            There are four auto graveyards like\n            this one in the other boroughs,\n            handling about a thousand vehicles\n            a month.  Those that aren't claimed\n            are auctioned here once a month.\n\n<b>                         MARIE\n</b>            Just for mistakes of parking?\n<b>\n</b><b>                                                           34.\n</b>\n\n<b>                         LA VALLE\n</b>            No.  Many are involved in crimes\n            and confiscated... or just abandoned.\n            This is, as you know, your prime\n            source of scrap metal, M. Charnier.\n\n<b>                         MARIE\n</b>                   (off camera)\n            Darling, may I have this one?\n\nMedium close shot MARIE, standing next to an LTD.\n\n<b>                         MARIE\n</b>            It looks so lonesome here.\n\nCHARNIER and LA VALLE approach her.\n\n<b>                         CHARNIER\n</b>            It would look even more lonesome in\n            our garage.\n\n<b>INT. THE AUCTION TRAILER - DAY\n</b>\nWithin the large trailer, about TWENTY MEN are seated at two\nlong benches to each side.  Some are standing to the rear.\nAt the front, an AUCTIONEER stands at a lectern.  To his\nleft sits a CLERK at a small table.  The AUCTIONEER wears a\nsweater and hat.  The buyers are tough types, young and old.\nAll have inventory lists.  The atmosphere is informal.  The\nCHARNIERS and LA VALLE enter the trailer at the back.\n\n<b>                         AUCTIONEER\n</b>            Every car sold today must be\n            removed at the purchaser's own\n            expense.  We have no keys or\n            anything to start the vehicles with.\n            You buy 'em as you see 'em and\n            where you see 'em.  All right, the\n            first car offered is Number 24398.\n            A Plymouth sedan.  Do I hear\n            fifteen dollars?\n\nThe bidding goes up to forty dollars.  A large BURLY MAN\nwins the bid.  He goes up to the CLERK and accepts the bill\nof sale.\n\n<b>                         AUCTIONEER\n</b>            We go to 24399 -- A Pontiac Station\n            wagon.  Do I hear ten dollars?\n\n<b>                         LA VALLE\n</b>                   (aside to CHARNIER)\n            Notice he will never mention the\n            year of the car.\n<b>\n</b><b>                                                           35.\n</b>\n\n<b>                         AUCTIONEER\n</b>            I got a fifteen dollar bid going...\n            Do I hear anymore...\n            Eighteen... who'll say Eighteen?\n            Twenty...\n            Twenty-three...\n            Anymore...\n            Twenty-five.  Twenty-five once --\n            Do I hear twenty-eight...\n            All right, last call for twenty-\n            five...\n\nClose shot of CHARNIER\n\n<b>                         CHARNIER\n</b>                   (aside of LA VALLE)\n            And these are the cars we're buying\n            for shipment?\n\nClose shot of CHARNIER, MARIE and LA VALLE.  They are facing\nthe AUCTIONEER.\n\n<b>                         LA VALLE\n</b>            Yes, sir.  That man in the dark\n            jacket is our buyer.\n\nClose shot of THE BUYER, LOU BOCA.  He is very active and\nwins the present bid.\n\n<b>WIRETAP SEQUENCE \"B\"\n</b>\n<b>INT. BASEMENT\n</b>\nDOYLE and RUSSO playing Gin Rummy, listening at each end of\none phone - breaking up.\n\n<b>EXT. HOUSE - NIGHT\n</b>\nShot of wire.\n\n<b>                         ANGIE (V.O.)\n</b>                   (sleepy)\n            Where are you?\n\n<b>                         SAL (V.O.)\n</b>            Takin' care o' business, honey.\n\n<b>                         ANGIE (V.O.)\n</b>            Takin' care o' business -- it's\n            after midnight.\n\n<b>                         SAL (V.O.)\n</b>            You know I hadda meet some people\n            tonight --\n<b>\n</b><b>                                                           36.\n</b>\n\n<b>                         ANGIE (V.O.)\n</b>            -- Well finish all your meetin'\n            people and get back here now -- and\n            bring a pizza with you.\n\n<b>                         SAL (V.O.)\n</b>            Where'm I goinna get a pizza this\n            time o' night?\n\n<b>                         ANGIE (V.O.)\n</b>            Well try, okay?\n\n<b>                         SAL (V.O.)\n</b>            I don't know where I'm gonna find a\n            pizza joint open.\n\n<b>                         ANGIE (V.O.)\n</b>            Sal --\n\n<b>                         SAL (V.O.)\n</b>            Yeah?\n\n<b>                         ANGIE (V.O.)\n</b>            Don't forget anchovies.\n                   (she hangs up)\n\n\n<b>                         SAL (V.O.)\n</b>            This broad's crazy!\n\n<b>EXT. WARD'S ISLAND (UNDER WEST ABUTMENT OF THE HELLGATE\n</b><b>BRIDGE)\n</b>\nPick up CHARNIER, MARIE and MAURICE LAVALLE\n\nAs the camera plays over the bridge: (in French)\n\n<b>                         CHARNIER (V.O.)\n</b>            It's beautiful.\n\n<b>                         LA VALLE (V.O.)\n</b>            It was built in 1917 - and was one\n            of the two heaviest bridges in the\n            world.  The arch is still the\n            largest in the world.\n\n<b>                         CHARNIER\n</b>            Who financed it?\n<b>\n</b><b>                                                           37.\n</b>\n\n<b>                         LA VALLE\n</b>            Two railroads as part of a\n            connecting railway which provided\n            passage from New England to the\n            South.  It was actually the first\n            railroad through New York City.\n\n<b>                         MARIE\n</b>            Why is it called Hellgate?\n\n<b>                         LA VALLE\n</b>            The river at this point is the most\n            dangerous on the East Coast.  Years\n            ago, hundreds of ships went down\n            here.\n\n<b>                         CHARNIER\n</b>            If this bridge were in Europe, it\n            would be on every tourist's sight-\n            seeing list.\n\n<b>                         LA VALLE\n</b>            Most New Yorkers never notice it -\n            most Americans have never heard of\n            it.\n\n<b>                         CHARNIER\n</b>            Look how gracefully they conceived\n            that arch.  Like a bowstring.  It\n            was built from both ends.  With no\n            support in the middle.  Beautiful.\n\n<b>                         LA VALLE\n</b>            Mmm.\n\n<b>                         MARIE\n</b>            Alain is the only man I know who\n            can become as enthusiastic about a\n            bridge as he can about a woman.\n\n<b>                         CHARNIER\n</b>            Not any woman, Marie.  Just one.\n\n<b>EXT. OLD ROAD IN WARD'S ISLAND\n</b>\nCHARNIER, MARIE and LA VALLE walking.\n\n<b>(NEAR GARAGE)\n</b><b>\n</b><b>                                                           38.\n</b>\n\n<b>                         LA VALLE\n</b>            I'm afraid the rest of Ward's\n            Island isn't nearly as romantic - a\n            pollution plant, a hospital, a\n            training school for garbage men and\n            that area over there, where the old\n            cars are kept, prior to being\n            processed for shipment to, among\n            other places, The Charnier Shipping\n            Company, of Marseilles, France.\n\n<b>(NEAR CREMATORIUM)\n</b>\n<b>                         MARIE\n</b>            What is that old building?\n\n<b>                         LA VALLE\n</b>            Oh, it's been abandoned for years.\n\n<b>                         MARIE\n</b>            What was it?\n\n<b>                         LA VALLE\n</b>            It was a crematorium.\n\n<b>                         MARIE\n</b>            For garbage?\n\n<b>                         LA VALLE\n</b>            For dead bodies.\n\n<b>WIRETAP SEQUENCE \"C\"\n</b>\n<b>INT. BASEMENT\n</b>\nDOYLE on phones.\n\n<b>           CHARNIER (V.O.)\n</b>  Allo... Salvatore...\n\n<b>           SAL (V.O.)\n</b>  Who's this --\n\n<b>           CHARNIER (V.O.)\n</b>  ... Salvatore?...\n\nRUSSO enters with a bag of sandwiches and cigarettes.  DOYLE\nwaves him to the phone.\n<b>\n</b><b>                                                           39.\n</b>\n\n<b>           SAL (V.O.)                     RUSSO\n</b>  ... Oh... yes... yeah...       Who is it?\n  hello... this is Sal... How\n  are ya?                                 DOYLE\n                                 Sounds like a foreigner...\n<b>           CHARNIER (V.O.)\n</b>  Very well... you meet me                RUSSO\n  Wednesday at the hotel...          (listening at the\n  Okay?                              other phone)\n                                 French... It's a Frenchman...\n<b>           SAL (V.O.)\n</b>  Good... good... great!                  DOYLE\n                                 This is what we been waitin'\n           CHARNIER (V.O.)       for -- the stuff is here!\n  Will I expect you?             It's here!\n\n<b>           SAL (V.O.)\n</b>  What time?\n\n<b>           CHARNIER (V.O.)\n</b>  Twelve o'clock... yes...\n\n<b>           SAL (V.O.)\n</b>  Yes --\n\nThe phone clicks off.\n\nDOYLE and RUSSO round each other and jump up and down like\ntwo kids.\n\n<b>INT. WHIP GIRL'S APT.\n</b>\nClose shot of NICOLI's face.  He's being whipped, and is\ncaught in an ecstasy of pain and pleasure.  The tempo of the\nstrokes rises.  Suddenly it reaches a crescendo and he\nscreams out in orgasm.\n\nClose, full-length shot of a nude BLONDE GIRL, wearing only\nblack boots and silk panties.  She's walking away from the\ncamera, throwing aside a small cat-o-nine-tails flagellant\nwhip.  We can hear NICOLI's heavy breathing until the girl\nspeaks as she moves toward a couch.\n\nMedium close shot of NICOLI, tying his tie shrugging into\novercoat.\n\nMedium close shot of NICOLI, looking at the bills with a\npause to sort out the currency differences, then taking out\nfive twenties.\n\nClose shot of the WHIP GIRL taking the five then moving up\nto the look of annoyance and disappointment on her face.\n<b>\n</b><b>                                                           40.\n</b>\n\n<b>                         WHIP GIRL\n</b>            You're Fifty Dollars short.\n\nThe look of anger turns to one of consternation as NICOLI\nreacts to her.\n\n<b>                         WHIP GIRL\n</b>            M'sieru - the tab for this scene is\n            a hundred and a half.\n                   (he moves to door)\n            Hey Frenchie - if you don't come up\n            with the scratch, you're gonna run\n            into my man downstairs.\n\nMedium close shot of NICOLI advancing on the WHIP GIRL as\nshe backs away and begins to cringe.  He grabs her and hurls\nher back across the couch.\n\nClose shot of the GIRL.\n\n<b>                         WHIP GIRL\n</b>            Don't hit me.  Don't.  Please.\n\nWe hear the door slam as she sobs.\n\n<b>                         WHIP GIRL\n</b>            You filthy faggot sonofabitch.\n\n<b>INT. CUTTING ROOM - DAY\n</b>\nClose shot of two pro football players smearing each other\non the field, others falling on top of them.\n\nMedium close shot of DEVEREAUX at a Movie-ola working out\nhis narration (DIALOGUE IN FRENCH)\n\n<b>                         DEVEREAUX\n</b>            This is the new American religion,\n            professional football.  It is where\n            everybody goes instead of church on\n            Sunday to express that peculiar\n            American taste for bloodshed and\n            violence.\n\nSeveral close shots of the violent action.\n\nIntercut with faces of the crowd.\n\nClose shot of DEVEREAUX.\n<b>\n</b><b>                                                           41.\n</b>\n\n<b>                         DEVEREAUX\n</b>            These men, playing a \"game\" - make\n            more money each year than many\n            important business leaders, artists\n            or government officials.\n                   (zoom out)\n            It tells us something about this\n            country and how its men live, or go\n            to war with a smile, and sometimes\n            die without a cause.\n\nThe phone rings - it is CHARNIER.\n\n<b>                         EDITOR\n</b>            It's for you - Alain Charnier.\n\nHold close up of DEVEREAUX.\n\n<b>INT. MUTCHIE'S BAR - NIGHT\n</b>\nIn Lower Manhattan.  There are SIX or EIGHT MATRONS still\nthere, stevedores and truck drivers.  Most of them are\nclustered at the far end of the bar, where MUTCHIE, a gray-\nhaired gone-to-paunch Irishman with spectacles as thick as\npop-bottle bottoms stands behind the mahogany bar.  The\ncluster of customers is involved in a typical New York\nsaloon argument.\n\nDOYLE is ignoring the debate and watching the television.\nHe is approached by a small MAN in a long coat and baggy\nsuit with suspenders.  This is JESUS THE BOOSTER.\n\n<b>                         JESUS\n</b>            Hey, Bo.\n\n<b>                         DOYLE\n</b>            Hiya, Jesus.\n\n<b>                         JESUS\n</b>            Can you use a new suit for\n            Christmans?\n\n<b>                         DOYLE\n</b>            Whatta you got?\n\nJESUS reaches into his trousers and pulls out three suits\n(jackets and pants).  They are of the latest style and\ncolor, and still on hangers!\n\n<b>                         JESUS\n</b>            Whatta you?... a 44... 46?\n\nDOYLE examines one of the jackets.\n<b>\n</b><b>                                                           42.\n</b>\n\n<b>                         DOYLE\n</b>            Where'd you get this fag shit?\n\n<b>                         JESUS\n</b>            This is what the tough guys are\n            wearin'.  You know I only steal\n            from the best.  It's Bonwit Teller.\n\n<b>                         DOYLE\n</b>            Pass.\n\n<b>                         JESUS\n</b>            Forty dollars -- was $250.\n\n<b>                         DOYLE\n</b>            Whyn't you get it dry cleaned and\n            burned.\n\nJESUS blends into the crowd and we pick up the dialogue of\nMUTCHIE and his cronies, BAD EDDIE, LEE and PUGGY.\n\n<b>                         MUTCHIE\n</b>            A big man could alluz beat a little\n            man.  That's why Wilt Chamberlain\n            could murder Jim Brown if they ever\n            fought.\n\n<b>                         BAD EDDIE\n</b>            No chance.  Brown'd kill him.\n\n<b>                         MUTCHIE\n</b>            Chamberlain's seven foot tall,\n            right?  He's got a twelve-foot\n            reach.  It's geophysics.  He's\n            punchin' down on you with leverage.\n            He cave your chest in.\n\n<b>                         BAD EDDIE\n</b>            Best I ever seen was The Rock.  He\n            was the calmest and the meanest.\n            Guys like Sugar'd be pukin' before\n            a fight.  Jake LaMotta'd be pukin'.\n            Marciano was calm like he was goin'\n            to church.  What about the night he\n            fought LaStarza?  He hit him so\n            hard he broke the blood vessels in\n            LaStarza's arms.  He was the\n            strongest meanest bastard ever lived.\n\n<b>                         PUGGY\n</b>            Hey, Mutchie, give us another bullet.\n\nMUTCHIE pours him a straight Scotch in a shotglass.\n<b>\n</b><b>                                                           43.\n</b>\n\n<b>                         MUTCHIE\n</b>            Blackjack Burns coulds been the\n            greatest ever --\n\n<b>                         PUGGY\n</b>            -- He was a stone tanker.\n\n<b>                         MUTCHIE\n</b>            That's right, he couldn't fight\n            legit.  One night at the Garden\n            about 1950, '51 -- he fought either\n            Jake LaMotta or Gus Lesnevich, I\n            think it was -- he took one o'\n            those cream puff punches in the\n            sixth -- the laziest left you ever\n            seen -- missed him entirely.  Down\n            goes Blackjack without even workin'\n            up a sweat and the whole Garden\n            gets up in its feet and I swear to\n            Christ, everybody starts singin'\n            \"Dance With Me Henry.\"\n\n<b>                         LEE\n</b>            I fought a guy in Cleveland once.\n            I knew he was a dirty fighter so I\n            stick a crowbar in my crotch.\n            Right here.  Second round he gives\n            me a shot -- Boom -- he breaks his\n            hand, the fight's over.\n\n<b>                         PUGGY\n</b>            Fuck it, I like nitroglycerin,\n            that's my game.\n\n<b>                         MUTCHIE\n</b>            What about you, Doyle?  Who's the\n            best fighter you ever seen?\n\n<b>                         DOYLE\n</b>                   (a few drinks behind him)\n            Willie Mays.\n\n<b>                         BAD EDDIE &amp; LEE\n</b>            Willie Mays?!\n\n<b>                         DOYLE\n</b>            With a baseball bat!  One swing!\n            Knock your fuckin' head off.\n\nTIME LAPSE.  The DRINKERS are gone.  MUTCHIE is at the bar\ncleaning up.  DOYLE is in the open adjoining kitchen area\ncooking breakfast.\n<b>\n</b><b>                                                           44.\n</b>\n\n<b>                         MUTCHIE\n</b>            What ya doin' out so late?  Hidin'\n            from the cops?\n\n<b>                         DOYLE\n</b>            I hear the health department is\n            going to close this joint for\n            selling dirty beer.  I come by to\n            help you carry out your money.\n\n<b>                         MUTCHIE\n</b>            They'll close you down if they ever\n            get a look at those busted-valise\n            broads you run with.\n\n<b>                         DOYLE\n</b>            You want some eggs.\n\n<b>                         MUTCHIE\n</b>            Why not?\n\n<b>                         DOYLE\n</b>                   (looking around for bacon)\n            Hey, Mutch!  You want bacon?\n\n<b>                         MUTCHIE\n</b>            Yeah!\n\n<b>                         DOYLE\n</b>                   (rattling pans,\n                   looking around)\n            Where the hell is it?\n\n<b>                         MUTCHIE\n</b>            Where the hell do you think it is,\n            potato head?\n\nDOYLE opens the door to the icebox.\n\n<b>                         MUTCHIE\n</b>            No wonder there's so many Mafia\n            around.  Ya couldn't find a Puerto\n            Rican in Spanish Harlem.\n\nTIME LAPSE.  Almost morning.  Close on DOYLE and MUTCHIE\neating bacon and eggs.  MUTCHIE is standing behind the bar\nas he eats, DOYLE is sitting in front of it.  They both have\na bottle of beer.\n<b>\n</b><b>                                                           45.\n</b>\n\n<b>                         MUTCHIE\n</b>            I got this little chick I'm tryin'\n            to hit on.  She's about 20, 21... I\n            take her to Jilly's last night and\n            she's tellin' me about how she\n            wants to settle down one day, get\n            married... I says, \"Hey, this is\n            1971, baby, I'm just a dirty old\n            man lookin' to score with some\n            pussy.\"\n\n<b>                         DOYLE\n</b>            Strike out, eh?\n\n<b>                         MUTCHIE\n</b>            Yeah.  In the late innings.  Ya\n            look like a night's sleep wouldn't\n            kill ya.\n\n<b>                         DOYLE\n</b>            A piece of ass wouldn't kill me.\n\n<b>                         MUTCHIE\n</b>            When ya go back on?\n\n<b>                         DOYLE\n</b>            Morning.  Sometime.\n\n<b>                         MUTCHIE\n</b>            Whyn't ya stretch out on the pool\n            table for a couple hours.  The kid\n            comes in at six will wake ya.  A\n            couple eggs and a beer is cheaper\n            than keepin' a dog around the joint.\n\n<b>EXT. MUTCHIE'S BAR - DAY\n</b>\nClose of DOYLE going to his car.  He stops for a light.\nDOYLE is red-eyed and in need of a shave.  He fidgets\nthrough his pockets looking for a cigarette but doesn't find\none.  As he drives along a GIRL CYCLIST comes into view\nalongside.\n\nOur view is DOYLE's view of her long, lean tapered legs.  If\nhe looks further, and DOYLE always looks further, he will\nsee there is a bra-band sweater covering her well-formed\nbreasts.  The pendulous swing is there as she bends over the\nhandlebars.\n\nClose front view of DOYLE looking back to the light, then\nback to the legs.\n\nClose outside view, the cyclist, of DOYLE leaning out the\nwindow with his badge in his hand.\n<b>\n</b><b>                                                           46.\n</b>\n\n<b>                         DOYLE\n</b>            You got a pedaller's license?\n\n<b>                         GIRL\n</b>            What?\n\n<b>                         DOYLE\n</b>            You're under arrest.\n\n<b>INT. SIMONSON OFFICE - DAY\n</b>\nMedium close shot of RUSSO and SIMONSON.  PHIL KLEIN, a\nfederal narcotics agent, is reading aloud from an article in\nthe New York Daily News.  MULDERIG is listening and sipping\ncoffee.\n\nClose shot of BILL MULDERIG, a Fed narcotics agent.\n\n<b>                         MULDERIG\n</b>            Whatta you got -- four more years,\n            Walter?\n\nMedium close of SIMONSON and RUSSO\n\n<b>                         SIMONSON\n</b>            Three.\n\nClose shot of MULDERIG.\n\n<b>                         MULDERIG\n</b>            Christ, by the time you get out all\n            this shit'll be legal.\n\nWide shot of room, taking in SIMONSON, RUSSO, MULDERIG and\nPHIL KLEIN.  SIMONSON hands BUDDY a stack of warrants.\n\n<b>                         SIMONSON\n</b>                   (rises, to RUSSO)\n            The judge gave you ten days on\n            these.  Klein and Mulderig will be\n            sitting in for the Federals.  Tell\n            Doyle they'll make all the buys,\n            and that they're to be kept informed\n            of everything that goes down.\n\nSIMONSON turns to MULDERIG.\n\n<b>                         SIMONSON\n</b>            You know Doyle, don't you Bill?\n\nClose of MULDERIG.\n<b>\n</b><b>                                                           47.\n</b>\n\n<b>                         MULDERIG\n</b>                   (rises)\n            Sure, I know Popeye.  The Master of\n            undercover, whose brilliant idea of\n            disguise is to limp into a room on\n            his left foot and limp out on his\n            right.  Whose brilliant hunches\n            cost the death of a good officer --\n\nClose of RUSSO\n\n<b>                         RUSSO\n</b>            If that's how you're coming in, why\n            not stay home and save us all a lot\n            of grief.\n\nMULDERIG, close.\n\n<b>                         MULDERIG\n</b>            That's just my opinion.\n\nRUSSO, close.\n\n<b>                         RUSSO\n</b>            Whyn't you shove it up your ass!\n\n<b>EXT. DOYLE'S APARTMENT BUILDING - DAY\n</b>\nLong shot of RUSSO approaching housing project group of\nbuildings.  This is where DOYLE lives.\n\n<b>INT. HALLWAY TO DOYLE'S APARTMENT\n</b>\nRUSSO rings the bell.  No response.  He knocks.  Again\nnothing.  He hears a shower working inside the apartment.\n\n<b>                         RUSSO\n</b>            Popeye.\n\nNo answer.\n\n<b>                         RUSSO\n</b>            Popeye.\n\n<b>                         DOYLE\n</b>                   (off, weakly)\n            Yeah.\n\n<b>                         RUSSO\n</b>            It's Cloudy.  Open the door.\n\n<b>                         DOYLE\n</b>                   (off)\n            I can't.\n<b>\n</b><b>                                                           48.\n</b>\n\n<b>                         RUSSO\n</b>            Why not?\n\n<b>                         DOYLE\n</b>                   (off)\n            Let yourself in.\n\nRUSSO reaches into his jacket pocket and gets a celluloid\ncard, his PBA card, which he slides into the door at the\nlock.  He gives it a juggle and the lock is free but the\ndoor moves grudgingly.\n\n<b>INT. DOYLE'S APARTMENT - DAY\n</b>\nThe door to DOYLE's apartment, a close view from inside.\nThere's a bike propped against it and BUDDY RUSSO is trying\nto push it open from the outside.\n\n<b>                         RUSSO\n</b>                   (behind door)\n            What the hell you got holding the\n            door?\n\nThe bike teeters and falls with a crash and RUSSO comes into\nthe room puzzled, exasperated.\n\n<b>INT. APARTMENT - RUSSO'S POV - DAY\n</b>\nDOYLE is anklecuffed to the bedpost at the foot of the bed.\n\n<b>                         RUSSO\n</b>            What happened to you?\n\n<b>                         DOYLE\n</b>                   (sleepy)\n            The crazy kid handcuffed me to the\n            bed.  With my own cuffs.\n\nThe shower goes off.  RUSSO puts the bike upright on its\nstand and squeezes the horn, which makes a loud beep.\n\nThe BIKE GIRL appears in the bathroom door, wrapped in a\ntowel.\n\n<b>                         BIKE GIRL\n</b>            Oh!\n\nRUSSO sees key on dresser - tosses it to DOYLE.  There are\nclothes all over the place, the GIRL's cycling outfit,\nDOYLE's pants and shoes and socks.  The decor is completely\nimpersonal.  RUSSO looks up.\n<b>\n</b><b>                                                           49.\n</b>\n\n<b>                         RUSSO\n</b>                   (looking at scrapbook\n                   on dresser)\n            You oughta get plastic covers for\n            this stuff like I did - your\n            scrapbook's a mess like everything\n            else in your life.\n\nRUSSO goes to chair.\n\n<b>                         DOYLE\n</b>            Gimme my pants.\n\nRUSSO, who is half sitting on them, pulls the pants loose\nand hands them to DOYLE.\n\n<b>                         DOYLE\n</b>            You got the warrant?\n\n<b>                         RUSSO\n</b>                   (sitting)\n            We also got Bill Mulderig and Phil\n            Klein.\n\nClose on DOYLE, buttoning his pants.\n\n<b>                         DOYLE\n</b>            What do we need those pricks for?\n\nMedium close on RUSSO picking around through the clothes,\ncoming up with a pair of panties.  He holds them out.\n\n<b>                         RUSSO\n</b>            Because by actual count our bureau\n            has exactly nine hundred eighteen\n            dollars and fifty-four cents to\n            make buys and Mulderig's Feds can\n            get all of Uncle Sam's money he\n            wants by just asking.\n\nDOYLE sitting on bed, strapping the holster on his ankle.\nHe checks his gun.\n\n<b>                         DOYLE\n</b>            Throw 'em in the bathroom, will you?\n            How good are the warrants?\n\n<b>                         RUSSO\n</b>                   (on the move down\n                   hall, at bathroom door)\n            Sixty days.  Here.  Don't mention it.\n<b>\n</b><b>                                                           50.\n</b>\n\nDOYLE is checking various items that go in his briefcase -\nnotebook, handcuffs, book of laws, field reports, pencils,\nbinoculars, candy bars, etc.\n\nMedium close shot of RUSSO looking toward the bathroom door.\n\n<b>                         RUSSO\n</b>            Hi!\n\nRUSSO looks back to DOYLE.  There is the sound of a kickstand\nbeing kicked back in place, the door opening and the GIRL\nleaving.\n\nMedium close shot of DOYLE tying the shoes, wincing.  Looking\nup to the departing GIRL.\n\n<b>                         RUSSO\n</b>            Drive carefully!\n\n<b>EXT/INT. RUSSO'S CAR - DAY\n</b>\nClose shot of BILL MULDERIG in back seat.  BUDDY is in\nfront, next to DOYLE at the wheel.\n\n<b>                         MULDERIG\n</b>            Strictly small potatoes.\n\nWe can see DOYLE working to keep up with the black Mercury\nas they cross the Brooklyn Bridge in fairly heavy traffic.\nThe Mercury cuts around in and out, DOYLE plunges after him.\n\n<b>                         MULDERIG\n</b>            You really know how to pick 'em,\n            Doyle.\n\nRUSSO turns his head in anger.\n\n<b>                         MULDERIG\n</b>            Still wearing your gun on your ankle?\n\nNo answer.\n\n<b>                         MULDERIG\n</b>            Somebody told me the reason you did\n            that was so's when you met a chick\n            and rubbed against her she wouldn't\n            know you were a cop.\n\nNo answer.\n\n<b>                         MULDERIG\n</b>            I said that was bullshit.  It must\n            be some kind of fast-draw gimmick\n            or something.\n<b>\n</b><b>                                                           51.\n</b>\n\n<b>                         RUSSO\n</b>            Knock it off, Bill.\n\n<b>                         MULDERIG\n</b>            He's gettin' too far ahead.  You're\n            gonna lose him.\n\nDOYLE cuts into the next lane to a lot of horn-blowing and\ncomes to a dead, screeching stop.  DOYLE sits up sharply\nerect in the seat, craning to see where SAL is going.  He\nthrows open the door and hurls himself out.\n\n<b>EXT. BROOKLYN BRIDGE - DAY\n</b>\nRear medium close shot of DOYLE climbing up on the side of\nthe car to look ahead, then jumping down and running off.\n\nDOYLE running as hard as he can.\n\nMedium close side shot of SAL turning off the bridge onto\nthe FDR Drive, moving quickly and smoothly uptown.\n\nDOYLE running to a stop, and staring ahead.  Breathing hard,\nhorns are blowing on the bridge and they drown out the words\nas he curses, \"Dirty Sonofabitch.\"\n\n<b>INT. RUSSO'S CAR - DAY\n</b>\nRUSSO is on the blower.\n\n<b>                         RUSSO\n</b>            Phil -- it's Cloudy -- we lost\n            him --\n\nStatic comes over the two-way radio.\n\n<b>EXT. BOCA'S CAR COMES OFF RAMP, PAN TO\n</b>\n<b>INT. KLEIN'S CAR - DAY\n</b>\nKLEIN is parked on Pearl Street below the Brooklyn Bridge.\n\n<b>                         RUSSO (V.O.)\n</b>            He just got off the Bridge - He's\n            all yours if you can find him.\n            Sonofabitch!\n\nKLEIN starts his car.\n\n<b>EXT. A PARKING GARAGE IN THE EAST 40'S - DAY\n</b>\nSAL emerges from the garage and heads toward Madison Avenue.\nHe passes a man looking in a store window, PHIL KLEIN.\nKLEIN follows him.\n<b>\n</b><b>                                                           52.\n</b>\n\n<b>EXT. A STREET IN THE EAST 40'S - DAY\n</b>\nSAL stops abruptly at the corner and turns around.  KLEIN is\nforced to pass him and cross the street.\n\nSAL crosses the street to his left, at a right angle to KLEIN.\n\n<b>EXT. MADISON AVENUE - LATE DAY\n</b>\nSAL moving north on Madison Avenue.  He is walking in a\ntriangular trap of foot surveillance.  We begin to learn\nthis when we fall back twenty feet behind SAL and pick up\nthe figure of JIMMY DOYLE, moving at exactly the same pace.\nWhile he keeps looking forward after SAL, he also looks\nregularly to the left, across to the West side of Madison\nwhere we quickly zoom in on the figure of BILL MULDERIG, who\nis on an even line opposite SAL and moving almost precisely\nin step with the subject of their surveillance.  MULDERIG\nkeeps an eye on SAL but is also glancing north ahead of SAL\nto BUDDY RUSSO, who is 20 or 30 feet ahead of SAL, thus\nforming the triangle of the A-B-C tail.\n\nSAL bobbing along.\n\nDOYLE following.\n\nMULDERIG keeping pace.\n\nRUSSO up front.\n\nSAL suddenly turning East at the Northeast corner of 46th\nStreet, the block occupied by the Roosevelt Hotel.\n\nMULDERIG yanking at his right ear.\n\nRUSSO spinning around, hurrying back toward the corner.\n\nDOYLE turning East at the Southeast corner of 46th Street.\n\nRUSSO coming around the corner looking to DOYLE.\n\nDOYLE indicating the Roosevelt entrance with his chin while\nMULDERIG comes up to join DOYLE.\n\nRUSSO moving quickly into the Roosevelt entrance on 46th\nStreet between Madison and Vanderbilt.\n\n<b>INT. ROOSEVELT LOBBY - DAY\n</b>\nRoosevelt lobby stairs with ALAIN CHARNIER, PIERRE NICOLI,\nSAL greeting.\n\n<b>                         CHARNIER\n</b>            Excuse me.\n<b>\n</b><b>                                                           53.\n</b>\n\n<b>                         RUSSO\n</b>                   (he is moving through\n                   the jam they form on\n                   the stairs)\n            Excuse me.\n\nWe move into the lobby of the Roosevelt and then spin around\nquickly, to watch CHARNIER, NICOLI and SAL moving upstairs\nand out the door.\n\n<b>EXT. DAY\n</b>\nA distant view from the Northeast corner of 46th Street and\nMadison Avenue of the Roosevelt Hotel marquee and the three\nmen under it, CHARNIER, NICOLI and SAL.  They are in animated\nconversation.\n\nDOYLE and MULDERIG on the point-of-view corner across\nMadison, MULDERIG with his back to the camera, DOYLE talking\nand watching over Mulderig's shoulder.\n\nClose shot DOYLE's face, eyes bright with excitement.\n\nLong view of CHARNIER, NICOLI and SAL under the marquee from\nDOYLE's view, zooming in on CHARNIER, who continues to talk,\nlook up, then look back to SAL.\n\n<b>                         DOYLE\n</b>            You take Sal.  I'll stick with the\n            beard if they split.\n\n<b>EXT. MADISON AVENUE - DAY\n</b>\nRear view of ALAIN CHARNIER and PIERRE NICOLI strolling\nslowly down Madison Avenue in the Forties.\n\nAn overhead view of the pair, CHARNIER and NICOLI, including\nDOYLE 20 or 30 yards behind, RUSSO across the street, even\nwith him.\n\nCHARNIER and NICOLI window-shopping at Walter's Electric,\n49th and 3rd Avenue.\n\nRUSSO looking quizzically, puzzled, from a doorway.\n\nCHARNIER and NICOLI are engaged in a running conversation\nthat we cannot hear.  But what CHARNIER is saying is simply\nthat he wants to get a pack of cigarettes before they turn\nback and stop for dinner.\n\nRUSSO looking to DOYLE for a signal.\n<b>\n</b><b>                                                           54.\n</b>\n\n<b>EXT. A CIGAR STORE - DAY\n</b>\nDOYLE already beginning to feel the cold, rubbing his hands\ntogether, at the front of the place CHARNIER and NICOLI have\nentered, trying to figure it out as CHARNIER and NICOLI\nemerge, CHARNIER ripping the cellophane off a pack of\ncigarettes, and they turn back in DOYLE's direction.\n\nDOYLE, face to face with CHARNIER and NICOLI.  Straining to\nhear, he picks up a few words of French.  Without losing\nstride he steps off the curb and cuts across the street,\nmoving south, away from them, as they come north.  But\nhalfway across the street, we pick up RUSSO coming in his\ndirection, sharp enough to pick up the tail where DOYLE had\nto drop it.\n\n<b>EXT. RESTAURANT - DAY\n</b>\nMedium close view through window of ALAIN CHARNIER and\nPIERRE NICOLI sitting at a table near the front windows of a\nsmall restaurant.\n\n<b>EXT. STREET - DAY\n</b>\nA long shot of street zooming in on JIMMY DOYLE who is\nfreezing his ass off in the shadows of a doorway across the\nstreet from the restaurant.  He is dancing from one foot to\nthe other, his shoulders hunched, occasionally cupping his\nhands to his ears.\n\n<b>INT. RESTAURANT - DAY\n</b>\nA medium close shot of WAITER holding a bottle of Sainte\nEmillion out for CHARNIER's inspection.  CHARNIER looks,\nfrowns, shakes head negatively.\n\nDOYLE's feet.  He's standing on one foot, the other raised\nand he's squeezing it with a chapped hand, as if trying to\nget circulation back into it.\n\n<b>INT. RESTAURANT - DAY\n</b>\nMedium close shot of NICOLI watching the WAITER scoop coq au\nvin onto his plate.\n\nClose shot of CHARNIER taking a large forkful of food into\nhis mouth, chewing and nodding at NICOLI.\n\n<b>EXT. STREET - DAY\n</b>\nMedium shot of DOYLE looking up to RUSSO who comes bearing a\npaper bag which he hands to DOYLE.\n<b>\n</b><b>                                                           55.\n</b>\n\nMedium close shot of RUSSO standing in front of DOYLE while\nDOYLE fishes a piece of pizza out of the bag and lets it\nfold into his mouth, then licks his fingers.\n\n<b>                         RUSSO\n</b>            You want the red or the white?\n\n<b>                         DOYLE\n</b>            Pour it in your ear.\n\n<b>EXT. RESTAURANT - DAY\n</b>\nMedium close view of CHARNIER through the window of the\nrestaurant, sipping expresso.\n\n<b>INT. RESTAURANT - DAY\n</b>\nClose shot of the pastry tray, rows of Napoleons, strawberry\nand peach tarts, a frothing-frenzied rum cake, etc.\n\nNICOLI close, looking like he's about to have an orgasm,\nglancing toward CHARNIER and then the tray.\n\n<b>EXT. RESTAURANT - DAY\n</b>\nClose shot of RUSSO peering at the restaurant.  DOYLE's face\nright behind him, peering over RUSSO's shoulder, trying to\ndrink coffee from a paper container and also moving slightly\nagainst the cold and the pain of the shoes.\n\n<b>EXT. FIRST AVENUE - DAY (EXT. COPAIN)\n</b>\nRear long view of CHARNIER and NICOLI on Madison in the\nForties strolling to a corner where NICOLI is splitting for\nthe Edison Hotel (West 46th Street) while CHARNIER goes on\nto the Westbury on upper Madison.  They part with a wave and\na nod.  Hold on them as BUDDY RUSSO comes into view, moving\noff after NICOLI.  DOYLE follow CHARNIER.\n\n<b>EXT. WESTBURY HOTEL - CHARNIER ENTERS - DAY\n</b>\n<b>INT. WESTBURY HOTEL - DAY\n</b>\nClose shot of the elevator floor indicator rising from 1 to 6.\n\nMedium close shot of DOYLE turning away from the elevator\ndoors and walking toward the registration desk.\n\nClose shot of the DESK CLERK.\n\n<b>                         DESK CLERK\n</b>            Yes sir?\n<b>\n</b><b>                                                           56.\n</b>\n\nMedium close shot of DOYLE leaning on elbow on the counter,\nhalf-turned to keep an eye on the elevators.\n\n<b>                         DOYLE\n</b>            That guy just walked in.  What's\n            his name?\n\nClose on CLERK and DOYLE.\n\n<b>                         DESK CLERK\n</b>            I'm sorry, I don't know who you mean.\n\n<b>                         DOYLE\n</b>                   (showing badge)\n            He got off on six.\n\n<b>                         DESK CLERK\n</b>            We have four rooms and six suites\n            on six.  There's a man in almost\n            every one of them.\n\nClose of DOYLE.\n\n<b>                         DOYLE\n</b>            Little shorter than me.  Well-\n            dressed.  About forty-five or fifty\n            with salt-and-pepper hair, a beard.\n\nClose of CLERK.  Thinks it over.\n\n<b>                         DESK CLERK\n</b>            There's nobody like that on six.\n\n<b>DOYLE AND CLERK\n</b>\n<b>                         DESK CLERK\n</b>            Perhaps he's visiting a guest.\n\n<b>                         DOYLE\n</b>            No, I figure he stays here.  Where's\n            your registration?\n\nCLERK gets out registration log book, goes through list as\nDOYLE waits.\n\n<b>                         DESK CLERK\n</b>            There may be two... no, three who\n            could fit it.\n\n<b>                         DOYLE\n</b>            Names.\n<b>\n</b><b>                                                           57.\n</b>\n\n<b>                         DESK CLERK\n</b>            A Mr. Paul Ganapolos, he's here\n            alone.\n\n<b>                         DOYLE\n</b>            Where from?\n\n<b>                         DESK CLERK\n</b>            Des Moines.\n\n<b>                         DOYLE\n</b>            What's he do?\n\n<b>                         DESK CLERK\n</b>            Businessman.  Owns a department\n            store in Des Moines, I think.\n\nDOYLE is taking down the information on a pad.\n\n<b>                         DESK CLERK\n</b>            Mr. and Mrs. Alain Charnier, would\n            be another.  He's in shipping.\n\n<b>                         DOYLE\n</b>            Yeh?  Who else?\n\n<b>                         DESK CLERK\n</b>            And a Mr. Michael Lowenstein, I\n            don't know what he does.\n\n<b>                         DOYLE\n</b>            This Charnier guy.  He's in shipping?\n\n<b>                         DESK CLERK\n</b>            I think so.  But they're in Room\n            408.  On the fourth floor.\n\nClose of DOYLE.\n\n<b>                         DOYLE\n</b>            Where's he from?\n\n<b>CLERK\n</b>\n<b>                         DESK CLERK\n</b>            Marseilles.\n\n<b>DOYLE AND CLERK\n</b>\n<b>                         DOYLE\n</b>                   (gives him a dumb look)\n<b>\n</b><b>                                                           58.\n</b>\n\n<b>                         DESK CLERK\n</b>            That's in France.\n\n<b>                         DOYLE\n</b>            Yeah, I know.\n\n<b>EXT. WESTBURY HOTEL ON MADISON AVENUE - NIGHT\n</b>\nMedium close shot of DOYLE standing in another doorway, this\none in Madison Avenue, opposite and a little up the street\nfrom the Westbury.  It is about 2 o'clock in the morning and\nthere's not much traffic.  DOYLE looks like a man almost too\ntired to stand.  We hear a car pull up (off camera).\n\n<b>INT. RUSSO'S CAR - NIGHT\n</b>\nView from the front seat of a sedan of DOYLE falling into\nthe corner of the back seat.  RUSSO reaches across the seat\nfrom the camera to hand DOYLE a brown paper container of\ncoffee.  He opens it between his knees and scalds his mouth\nwith it.  RUSSO hands over another gift, a pint of Canadian\nClub.  DOYLE takes a big swig.\n\nRear close view of BILL MULDERIG at the wheel of the car,\nlooking at DOYLE in the rear-view mirror.\n\n<b>                         MULDERIG\n</b>            You about ready for a break?\n\nA view of MULDERIG at the wheel, RUSSO twisted around in the\nseat, looking back at DOYLE and putting the cap back on the\nbottle.  When DOYLE isn't sipping at the coffee-whiskey,\nhe's looking out the window of the car at the entrance of\nthe hotel.  He looks beat.\n\n<b>                         DOYLE\n</b>            The guy's a frog -- I'm pretty sure.\n            Also he made me.  Stayin' on four\n            but went up to six -- cute.\n\n<b>                         RUSSO\n</b>            The other guy's a frog too.  Checked\n            in at the Edison.  Had a hooker\n            sent up.\n\n<b>                         MULDERIG\n</b>            Christ you should o' collared him\n            right there.\n\n<b>                         DOYLE\n</b>            Who's on him?\n\n<b>                         RUSSO\n</b>            Phil Klein.\n<b>\n</b><b>                                                           59.\n</b>\n\n<b>                         DOYLE\n</b>            What about Sal?\n\n<b>RUSSO\n</b>\n<b>                         RUSSO\n</b>            We put him to bed for the night.\n\n<b>MULDERIG\n</b>\n<b>                         MULDERIG\n</b>            Why don't you do the same, Doyle?\n            You look like shit.\n\n<b>DOYLE AND MULDERIG - INTERCUT\n</b>\n<b>                         DOYLE\n</b>                   (to MULDERIG)\n            Look.  My partner and I found this\n            case and I don't want no Feds\n            screwing it up.\n\n<b>                         MULDERIG\n</b>            Case?  So far I haven't seen a damn\n            thing.\n\n<b>                         DOYLE\n</b>            Bill, keep shootin' your mouth off\n            and I'll knock you into the middle\n            of next week.\n\nRUSSO, close.\n\n<b>                         RUSSO\n</b>            Jimmy, cool it.  Nothin's goin'\n            down tonight.  Cop a few zzz's\n            while you can.\n\nClose shot, DOYLE.\n\n<b>INT. WEINSTOCK'S APARTMENT - NIGHT\n</b>\nClose shot of CHEMIST with a small lab layout spread in\nfront of him -- burner, test tubes, etc.  The MAN's wearing\nan ordinary business suit and both the table and the\nbackground indicate that this is not a lab, but somebody's\nlibrary or den -- and a fashionable one, with photos, a\nsigned picture of Lyndon Johnson, etc., on the panelled walls.\n\nThe CHEMIST is running a Thiele test on a small mound of\npowder.  Heroin from CHARNIER's shipment.\n\nMedium close shot of JOEL WEINSTOCK and SAL BOCA sitting\nopposite the CHEMIST.\n<b>\n</b><b>                                                           60.\n</b>\n\nSAL has a glass of beer in front of him, WEINSTOCK a brandy\nsnifter containing a splash of amber cognac.  Both are\ninterested; SAL quite nervously.\n\nThe CHEMIST immerses a capillary tube, a tiny instrument the\nsize of a needle into an open kilo of heroin.\n\nHe pours a small quantity of mineral oil into a burnmeister\ntest tube and preheats the oil over the open flame of a tiny\nalcohol lamp.\n\nHe removes a 15-in thermometer from its leather case,\nfastens the capillary tuve (now totally immersed in the\nheroin) to the bulb of the thermometer with a rubber band.\n\nHe places the bulb, with capillary attached, into an open\nrubber stop and inserts the entire apparatus into the\nburnmeister tube, about three inches in.\n\nWith a small metal clamp he holds the rig over the lamp.\n\nWe watch closely with the CHEMIST, WEINSTOCK and BOCA as the\nwhite heroin powder slowly, agonizingly dissolves into the\nmineral oil and\n\nThe mercury rises slowly up the thermometer to 220° - 230°.\n\nThe faces of the three men are filled with wonder and\nanxiety.  As the mercury continues to rise they become a\ncheering section, rooting the hometeam home.\n\nThe longer it takes for the powder to dissolve, the purer\nthe heroin.  The mercury stops at 240°!\n\n<b>                         CHEMIST\n</b>            Absolutely dynamite!  89.5 proof!\n            Best I've ever seen!  If the rest\n            is like this, you'll be dealing for\n            two years on this load.\n\nClose on WEINSTOCK, relaxed, smoking a large cigar.\n\n<b>                         WEINSTOCK\n</b>            Retail is not my end of the business.\n            Are you telling me it's worth the\n            half million?\n\nMedium close of the CHEMIST.\n\n<b>                         CHEMIST\n</b>            How many kilos?\n\n<b>                         SAL\n</b>            Sixty.\n<b>\n</b><b>                                                           61.\n</b>\n\n<b>                         CHEMIST\n</b>            Six kilos at eight big ones a\n            kilo...\n                   (he nods)\n            I'd say it should be able to take a\n            seven to one hit in the street.\n\n<b>                         SAL\n</b>            By the time it gets down to nickel\n            bags it's at least thirty-two\n            million!\n\nMedium close of WEINSTOCK and BOCA.\n\n<b>                         WEINSTOCK\n</b>            Thank you, Howard.  Take what's\n            left there with you and goodnight.\n\nThe CHEMIST packs his apparatus and leaves.\n\n<b>                         SAL\n</b>            I guess we got a deal, eh?\n\nMedium close shot of WEINSTOCK alone, appraising BOCA.\n\n<b>                         WEINSTOCK\n</b>            We got a test.  A deal for half a\n            million dollars, maybe.\n\nSAL, whose cool is easily shattered.\n\n<b>                         SAL\n</b>            Joel, the man is in a hurry.  He\n            wants the bread and he wants to go\n            back to France.  He ain't gonna\n            hang around and play games.  He's\n            one o' the shrewdest cats I ever\n            run across.\n\nWEINSTOCK, close.\n\n<b>                         WEINSTOCK\n</b>            What am I, a shmuck?  What's the\n            hurry?  He could see a couple of\n            shows and visit the top of the\n            Empire State Building.\n\n<b>INTERCUT SAL, WEINSTOCK\n</b>\n<b>                         SAL\n</b>            Joel, don't jerk me.  I spent a lot\n            o' time settin' this one up.\n<b>\n</b><b>                                                           62.\n</b>\n\n<b>                         WEINSTOCK\n</b>            So whatta you want a badge?  It's\n            your first major league game Sal.\n            One thing I learned, move calmly,\n            move cautiously.  You'll never be\n            sorry.\n\n<b>                         SAL\n</b>            I been damn careful up to now.\n\n<b>                         WEINSTOCK\n</b>            Which is why your phone lines are\n            tapped and the Feds are crawlin'\n            all over you like flies.\n\n<b>                         SAL\n</b>            I'm straight, Joel.  They haven't\n            got shit on me.  Look, I'm tellin'\n            you, he'll take the deal somewhere\n            else.\n\n<b>WEINSTOCK\n</b>\n<b>                         WEINSTOCK\n</b>            He could go someplace else with his\n            sixty kilos of heroin and see how\n            easy it is to pull together a half\n            million cash.  He wouldn't find\n            there was any hurry to do this kind\n            of business.\n\nSAL, a little desperate.\n\n<b>                         SAL\n</b>            Look, the stuff is here.  We could\n            set up the switch in an hour.  I'm\n            tellin' you, Mr. Weinstock, he'll\n            split if we don't move.  This guy\n            is everything they say he is.\n\nWEINSTOCK taking SAL apart with his eyes over the cigar.\n\n<b>                         WEINSTOCK\n</b>            What about you, Sal?  Are you\n            everything they say you are?\n\nClose of SAL's worried face.\n\n<b>EXT. NEIGHBORHOOD STREET - NIGHT\n</b>\nClose side view of DOYLE driving; popeyeing right and left,\nlooking for everything and nothing.\n<b>\n</b><b>                                                           63.\n</b>\n\nView over DOYLE's right shoulder through windshield of a\nyoung Black HOOKER leaning against a lamppost, smiling at a\npassing PEDESTRIAN.  Hold on her as the car moves on,\nDOYLE's head turning as he continues to move with the traffic.\n\nRear close view of DOYLE leaning over the back seat, looking\nas he backs the car.\n\nClose shot of the HOOKER looking up smiling, then the smile\nfading.\n\nMedium close view of DOYLE and the HOOKER.\n\n<b>                         DOYLE\n</b>            You own that lamppost?\n\n<b>                         HOOKER\n</b>            No.\n\n<b>                         DOYLE\n</b>            Then how come you're leaning on it.\n\nClose shot of HOOKER.\n\n<b>                         DOYLE\n</b>            I ever bust you?\n\n<b>                         HOOKER\n</b>            I never seen you before.\n\nDOYLE and the HOOKER.\n\n<b>                         DOYLE\n</b>            Get your ass in the car.\n\nDOYLE looking right and left, the form of the GIRL climbing\ninto the vehicle.  He puts surveillance hat on back seat.\n\n<b>INT. DAN'S LUNCH - DAY\n</b>\nDOYLE is standing at an island counter in a coffee-doughnuts\njoint.  The COUNTERMAN is paying no attention to him but is\ninstead emptying coffee from a large dispenser into a pot.\n\n<b>                         DOYLE\n</b>            You gonna wait on me or am I gonna\n            sit here all day?\n\nThe COUNTERMAN responds quickly to DOYLE's voice.\n\nClose shot of DOYLE biting into a huge jelly doughnut, the\njelly squeezing out onto his fingers.\n<b>\n</b><b>                                                           64.\n</b>\n\nA kid pushes a broom past, getting rid of a collection of\ncigarette butts, etc.\n\n<b>                         DOYLE\n</b>            Hey!\n\nClose shot of KID, about 16, looking up from the broom\ntoward DOYLE.\n\n<b>                         DOYLE\n</b>                   (off camera)\n            C'mere... C'mere!\n\nMedium close shot of DOYLE and the KID, DOYLE eating and\ndrinking.\n\n<b>                         DOYLE\n</b>            Can you stand a toss, Hector?\n\n<b>                         KID\n</b>            What you mean?\n\n<b>                         DOYLE\n</b>            You still dealin' shit?\n\n<b>                         KID\n</b>            Jesus, no, Doyle.  I'm clean.  I'm\n            working twelve hours a day here.\n\nClose shot of DOYLE talking around a mouthful of doughnut.\n\n<b>                         DOYLE\n</b>            When they going to make you chairman\n            of the board?\n\nMedium close shot of DOYLE and the KID.  DOYLE puts down the\ncoffee cup.  Waves the KID closer.  The KID moves closer,\nDOYLE frisks him quickly, expertly, then rips up the kid's\njacket and takes a 12-inch toadsticker out of the kid's\nwaistband.\n\nClose shot of DOYLE looking at the knife, snapping the\nbutton and watching the blade flash out.\n\n<b>                         DOYLE\n</b>            You clean your fingernails with this.\n\nClose shot of KID.\n\n<b>                         KID\n</b>            Rather be caught with it than\n            without it.\n<b>\n</b><b>                                                           65.\n</b>\n\nDOYLE, pushing button and letting the blade fall into closed\nposition.\n\n<b>                         DOYLE\n</b>            Yeah, I guess so.\n\nDOYLE hands the knife back to the kid.  HECTOR goes back to\nwork.  DOYLE eats.\n\n<b>EXT. DAN'S LUNCH - DAY\n</b>\nDOYLE climbing back into his car, knees on the seat, reaching\nover into the back.\n\nClose shot over the rear seat of DOYLE picking up the straw\nhat, which has been jammed into the corner by the contours\nof the Hooker's tail.  He straightens it as much as possible\nand throws it under the driver's seat.\n\n<b>EXT. MADISON AVENUE - DAY\n</b>\nMedium shot of DOYLE on foot popeyeing up Madison Avenue in\nthe vicinity of the Westbury.  As unobtrusively as possible,\nhe's looking for the tail that should be there covering\nCHARNIER.  DOYLE is on the East side of the street, and the\nWestbury is on the West.  He pokes his head into a couple of\ndoorways, checks the cars parked at the curb, looks up to a\ncouple of the mezzanine shops along the street.  He sees\nPHIL KLEIN and ANOTHER AGENT talking together totally\noblivious to the front entrance.  MULDERIG in a cigar store\nlooks to his wristwatch, then goes inside the store.\n\nClose shot of DOYLE frowning, puzzled.  There doesn't seem\nto be anybody alert.  He looks over to the hotel.\n\nWestbury Hotel entrance from DOYLE's Point of View.  CHARNIER\nsteps out of hotel entrance, turns south.  The two AGENTS\nand MULDERIG have not seen his exit.\n\nClose on DOYLE in a doorway.\n\nCHARNIER, carrying an umbrella, strolling blithely down the\nstreet, in DOYLE's direction but on the opposite side of the\nstreet.  Zoom in on his face, reflecting no concern, no\nproblems, then zoom back to DOYLE's position.  Pan to the\nhotel entrance as DOYLE looks for somebody else.  Where the\nhell is CHARNIER's surveillance?\n\nVery quickly, DOYLE's nervous glances.\n\nCHARNIER close.\n\nA long view of the street.\n<b>\n</b><b>                                                           66.\n</b>\n\nCHARNIER moving along.\n\nThe hotel entrance.\n\nClose shot of DOYLE going through the glancing movements,\nhis eyes showing CHARNIER getting farther and farther down\nMadison Avenue.  But there's still nobody following him.\n\nMedium close shot of DOYLE scrambling out of the doorway and\nmoving down the street after CHARNIER.\n\nRear view of CHARNIER stopping at a newsstand, buying a copy\nof the Times.\n\nDOYLE in a doorway, peering out and down the street.\n\nMedium close front view of CHARNIER strolling along, glancing\nat the headlines of the Times, an umbrella hooked over his\nleft forearm as he walks.\n\nClose shot of CHARNIER's polished shoes, moving quickly down\nsubway entrance stairs.  Hold on the empty stairs.  Then\nDOYLE's painful, scuffed shoes, follow.\n\n<b>EXT. SUBWAY PLATFORM - DAY\n</b>\nClose shot CHARNIER standing on the subway platform, looking\nat the Times, glancing toward the tracks and the rumble of a\ntrain in the distance.\n\nSide rear view of CHARNIER close in the foreground, DOYLE\nmoving into view in the background, not looking toward\nCHARNIER, keeping his face turned mostly away from the\nFrenchman.\n\nLong shot of the platform.  DOYLE right, CHARNIER left as\nthe train pulls in.  CHARNIER is folding up his paper to\nboard.  DOYLE is moving toward the train.\n\n<b>INT. TRAIN\n</b>\nCHARNIER getting on train toward camera.\n\nClose side shot DOYLE getting on train, leaning over to look\nafter CHARNIER's movements.\n\n<b>EXT. SUBWAY PLATFORM\n</b>\nCHARNIER getting off train.\n\nDOYLE puzzled, hesitating, then getting off his car.\n\nLong shot of CHARNIER opening the Times again.\n<b>\n</b><b>                                                           67.\n</b>\n\nMedium shot of DOYLE moving quickly to phone booth against\nthe wall.\n\nDOYLE close, barking into the phone.\n\n<b>                         DOYLE\n</b>            I'm sittin' on Frog One.\n\nMULDERIG in phone booth at Westbury.\n\n<b>                         MULDERIG\n</b>            Yeah, we got the Westbury covered\n            like a tent.\n\n<b>DOYLE\n</b>\n<b>                         DOYLE\n</b>            The Westbury?  Balls.  I got him\n            down at the subway at Times Square.\n            What the hell's goin' on?  I make\n            him coming right out of the hotel\n            free as a bird.  Not a soul awake.\n\nClose shot of CHARNIER strolling past the telephone booth,\nDOYLE looking down.\n\n<b>                         DOYLE\n</b>            I don't care how many bartenders\n            are sick.  I don't work in that\n            joint.  What the hell kind of a\n            union are you running down there?\n\nLong view of CHARNIER and DOYLE about thirty feet apart on\nthe platform, a second train approaching.\n\n<b>INT. SUBWAY TRAIN\n</b>\nA close view of DOYLE just inside the doors of the car\nsneaking a peek at the platform.  We can see that CHARNIER\nis not there.  He's on the train.  Suddenly CHARNIER\nreappears on the platform.  DOYLE steps off.\n\n<b>EXT. SUBWAY PLATFORM\n</b>\nLong view from DOYLE's vantage point of CHARNIER standing\nwith his back to the train, looking up like a man who can't\nmake up his mind, then turning to his left, away from DOYLE\nand getting back on the train.\n\n<b>INT. SUBWAY TRAIN\n</b>\nView from interior of DOYLE car of JIMMY DOYLE nipping back\nonto car.\n<b>\n</b><b>                                                           68.\n</b>\n\n<b>INT. TRAIN - CHARNIER'S CAR\n</b>\nClose view of subway doors hissing shut and an umbrella\nbeing raised at the last moment by an off-camera hand\n(CHARNIER's).  The doors jerk open in the safety spasm.\nThere is a blur of the a fabric moving across the camera,\nblocking the view of the doors.  It is only a moment.  When\nit clears, the doors are closed again, the umbrella is gone.\nBut we don't know what happened and the train isn't moving.\n\n<b>INT. SUBWAY TRAIN - DOYLE'S CAR\n</b>\nRear close view of DOYLE peeking into the forward car to see\nwhere CHARNIER is sitting.\n\n<b>INT. TRAIN - CHARNIER'S CAR\n</b>\nQuick, shocked close view of that car, revealing that\nCHARNIER isn't there among the twenty passengers dozing or\nmoping in their seats.  There is a blurred flash as if\nDOYLE's own eyes are spinning frantically back to the\nwindows of his own car.\n\n<b>EXT. SUBWAY PLATFORM\n</b>\nMedium shot of DOYLE jumping out of train, CHARNIER jumping\nback on - train takes off.\n\n<b>INT. SUBWAY TRAIN - CHARNIER'S CAR\n</b>\nA close view of CHARNIER's face.  He is smiling directly at\nDOYLE.  He gives him a little wave.\n\nA view from CHARNIER's position of DOYLE chasing the train,\nanger and hatred and frustration storming across his face.\n\n<b>EXT. HENRY HUDSON PARKWAY - MOSHOLU EXIT\n</b>\nA long view from the bottom of the steep embankments above\nHarlem River Drive in Washington Heights.  Sprayed along the\nface of the cliff is a disaster -- an overturned city bus\nand a car with which it apparently collided.  The scene is\nlighted with flares.  Police rescue WORKERS and FIREMEN are\nscrambling up and down the face of the cliff.  They are\ncarrying BODIES out of the bus and the car, COPS pulling\nthem out through the windows, leading them on stretchers.\nThere are shouted orders and some moans and cries from the\nwreckage.  In the foreground is LT. WALTER SIMONSON, involved\nin the operation, but also involved in a hassle with DOYLE,\nMULDERIG and RUSSO who are standing with him.  An officer\napproaches SIMONSON with a set of heroin works.\n<b>\n</b><b>                                                           69.\n</b>\n\n<b>                         OFFICER\n</b>                   (to SIMONSON)\n            This belonged to the kid who was\n            drivin' the sports car.  17 years\n            old.  His girlfriend OD'd in the\n            car.  We found this set of works in\n            her arm.\n\nMedium close shot of DOYLE and SIMONSON.  DOYLE couldn't\ncare if Rome was burning on the hill; he's only interested\nin his case.\n\n<b>                         DOYLE\n</b>                   (to MULDERIG)\n            Where the hell was the surveillance?\n            \"Go to bed.\" That's all you could\n            say.  You couldn't keep track of a\n            bleeding elephant in a snowbank.\n\nSIMONSON, eyes on the hill, glancing to DOYLE with irritation.\n\n<b>                         SIMONSON\n</b>            Jimmy, it doesn't matter anymore.\n            If there was a deal it must have\n            gone down by now.  We blew it!  We\n            blew our cover and we blew the\n            warrants --\n\n<b>                         MULDERIG\n</b>            Charnier and his wife checked out\n            of the Westbury.  Nicoli checked\n            out of the Edison --\n\n<b>                         RUSSO\n</b>            This fella Nicoli's got a record in\n            France, Walter.  He's wanted for\n            questioning in the murder of a\n            French cop.\n\n<b>                         DOYLE\n</b>            I say we keep sittin' on Boca.\n\n<b>                         MULDERIG\n</b>            That's crazy.  You lost the Frog in\n            the subway and you blew our cover.\n            If they haven't moved already\n            they're not gonna move now.\n\n<b>                         DOYLE\n</b>            Walter, I can make this case if the\n            Feds will get the hell out of my way.\n<b>\n</b><b>                                                           70.\n</b>\n\n<b>                         MULDERIG\n</b>            With pleasure -- it's all yours.\n            Walter, if anything develops outta\n            this charade give me a call.\n\nMedium shot of SIMONSON, DOYLE, MULDERIG and RUSSO.  Lights\nflashing around them; stretchers going by with bodies.\n\n<b>                         RUSSO\n</b>                   (to MULDERIG)\n            My ass.  The only reason you're in\n            this is because you've got a big\n            expense account for buying junk and\n            you like to see your picture in the\n            papers.\n\n<b>                         DOYLE\n</b>                   (to SIMONSON)\n            This is my case.  Get these guys\n            off my back and let me handle it.\n\n<b>SIMONSON\n</b>\n<b>                         SIMONSON\n</b>            For chrissake, will you come off\n            that \"my case\" bullshit.  This has\n            been a whore's dream from the start.\n\nDOYLE, close.\n\n<b>                         DOYLE\n</b>            The deal hasn't gone down yet\n            Walter -- I know it, I can feel it.\n\nClose shot of MULDERIG\n\n<b>                         MULDERIG\n</b>            The last time you were dead certain\n            we ended up with a dead cop.\n\nA fist, DOYLE's, comes from off-camera and connects with\nMULDERIG's chin.  As his head flies back.\n\nDOYLE and MULDERIG slugging and grappling with each other,\nRUSSO leaping in to yank them apart.  SIMONSON grabbing\nMULDERIG's arm and holding him back.\n\nSIMONSON, close.\n\n<b>                         SIMONSON\n</b>                   (roaring)\n            That's enough.  Get the hell out of\n            here.\n<b>\n</b><b>                                                           71.\n</b>\n\n<b>DOYLE\n</b>\nShot of SIMONSON, MULDERIG, DOYLE, RUSSO, in a cluster.\n\n<b>                         SIMONSON\n</b>                   (on way up hill,\n                   turning back)\n            Jimmy, you wasted two months - no\n            collars are comin' in while you two\n            been out jerkin' off.  Now go back\n            to work, you're off Special\n            Assignment.\n\n<b>EXT. LA GUARDIA AIRPORT - DAY\n</b>\nMedium close side view of SAL BOCA's Mercury pulling to the\nWashington-Boston shuttle parking lot at La Guardia airport.\nSAL takes his ticket from the automatic vendor and drives in.\nWe hold for the next car driven by PHIL KLEIN, a federal\nnarcotics agent who is on his tail.\n\n<b>INT. AIRPORT - DAY\n</b>\nMedium close shot of SAL BOCA writing out the ticket order\nform.\n\nClose shot of the form; SAL filling it out in an almost\nilliterate scrawl.  Under destination SAL fills in Washing...\nand the camera raises its eye to a close shot of PHIL KLEIN\non the opposite side of the counter, filling in his form.\n\nClose side shot of PHIL KLEIN standing right behind SAL in\nthe shuttle line.\n\n<b>EXT. DEPT. OF COMMERCE, WASHINGTON, D.C. - DAY\n</b>\nCHARNIER and an UNDERSECRETARY on the steps of the building,\nshaking hands.  Two other OFFICIALS are on hand and while we\ndon't hear their conversation, their manner is extremely\nattentive to CHARNIER.\n\n<b>                         CHARNIER\n</b>            It has been highly informative and\n            a personal pleasure to see you again.\n\n<b>                         UNDERSECRETARY\n</b>            I only hope we cut through to some\n            meaningful proposals in the next\n            month or so.  The pleasure was\n            mine, Mr. Charnier.  When will we\n            see you again?\n\n<b>                         CHARNIER\n</b>            Soon, probably in the Spring.\n<b>\n</b><b>                                                           72.\n</b>\n\nClose shot of CHARNIER.\n\n<b>                         CHARNIER\n</b>            Goodbye.\n\n<b>                         UNDERSECRETARY\n</b>                   (off camera)\n            Goodbye.  Good trip home.\n\n<b>EXT. WASHINGTON STREET - DAY\n</b>\nMedium long shot of CHARNIER walking across street,\ndiagonally toward the camera, removing the identification\ncard from his lapel.\n\nRear close shot of CHARNIER joining SAL BOCA on the sidewalk\nand the two of them moving off together.\n\nClose shot of SAL, somewhat nervous about trying to peddle\nhis problems to CHARNIER.\n\n<b>                         SAL\n</b>            Everything's smooth.  Beautiful.  I\n            will need a few more days though,\n            the boys think we oughta cool it\n            for awhile -- make sure there's no\n            heat.\n\n<b>                         CHARNIER\n</b>                   (manner outwardly pleasant)\n            You must take me for an imbecile.\n            Why do you think I asked you to\n            meet me in Washington?  I haven't\n            spent five minutes in New York City\n            without the company of a gendarme.\n\n<b>                         SAL\n</b>            Look, I'll level with you -- I need\n            a little more time -- I got to\n            shift gears.\n\n<b>                         CHARNIER\n</b>            Are you having trouble raising the\n            half million?\n\n<b>                         SAL\n</b>            Hell no -- my end is covered -- my\n            associates just feel we ought to\n            wait for a more opportune time to\n            make the switch.\n\nStop, Cover.\n<b>\n</b><b>                                                           73.\n</b>\n\n<b>                         CHARNIER\n</b>            It has to be by the end of this week.\n\n<b>                         SAL\n</b>            Look, Mr. Charnier, you got to be\n            reasonable.\n\n<b>                         CHARNIER\n</b>            It's your problem.\n\n<b>                         SAL\n</b>            It's yours too!\n\nFull length shot of CHARNIER and BOCA, CHARNIER leaning over\nto shake his hand.\n\n<b>                         CHARNIER\n</b>            So nice to have seen you again.\n\nCHARNIER turns and walks off, leaving SAL looking after him\nas we zoom back to a Point of View about a hundred yards\ndown the street.\n\nClose of PHIL KLEIN, just watching.\n\n<b>INT. AIRPLANE - DAY\n</b>\nClose shot of MRS. CHARNIER, sitting by the window of two\nseats on the shuttle, looking out and babbling at CHARNIER.\n<b>(DIALOGUE IN FRENCH).\n</b>\n<b>                         MARIE\n</b>            Look, darling, they sell these at\n            the Smithsonian.\n\nShe extracts a necklace and bracelet of shark's teeth from\nan elegant alligator bag.\n\nCamera moves back to take in CHARNIER looking from the Wall\nStreet Journal to the native craft bracelets.\n\n<b>                         CHARNIER\n</b>            Are you sure it is dead?\n\n<b>                         MARIE\n</b>            I'm going to put them on the cat.\n\n<b>                         CHARNIER\n</b>            That's a relief.\n\nClose shot of CHARNIER, tenderly, lovingly.\n<b>\n</b><b>                                                           74.\n</b>\n\n<b>                         CHARNIER\n</b>            You did find something for yourself,\n            of course.\n\nMARIE, close.\n\n<b>                         MARIE\n</b>            Of course.  But I am not going to\n            tell you what it is until we are\n            back in Marseilles.\n\nCHARNIER and MARIE.  He folds up the paper, smiling at her.\n\n<b>                         CHARNIER\n</b>            Excuse me a moment, darling.\n\nCHARNIER's view of the plane interior, walking back toward\nthe rear of the cabin.  The seats are occupied by military-\nbusiness-government TYPES making the shuttle run.  Not every\nseat is filled.  We come to an empty one on which someone\nhas deposited an attache case.  It is the seat next to\nPIERRE NICOLI, whose hand reaches out to remove it and we\nfollow the arm to NICOLI's face.\n\nClose shot of CHARNIER and NICOLI sitting. (DIALOGUE IN\n<b>FRENCH)\n</b>\n<b>                         CHARNIER\n</b>            I'm afraid they've become a bit...\n            over-cautious.  Our American friends.\n\n<b>                         NICOLI\n</b>            What happens to the schedule?\n\n<b>                         CHARNIER\n</b>            We must follow it.\n\n<b>                         NICOLI\n</b>            But will they?\n\nCHARNIER shrugs.\n\n<b>                         CHARNIER\n</b>            I don't know.  Boca is scared.\n            He's not strong enough.  He sees\n            policemen in his soup.\n\n<b>                         NICOLI\n</b>            He is not wrong.\n\n<b>                         CHARNIER\n</b>            Mmmmm.  That bastard who followed\n            me on the subway, he's the eager one.\n<b>\n</b><b>                                                           75.\n</b>\n\n<b>                         NICOLI\n</b>            Let me take him out.\n\nClose of CHARNIER.\n\n<b>                         CHARNIER\n</b>            There'll be someone else.\n\n<b>                         NICOLI\n</b>            What difference does it make?\n            We'll be out of the country Friday.\n\nClose shot of CHARNIER alone.\n\n<b>EXT. SIDEWALK OUTSIDE DOYLE'S APARTMENT BLDG. - DAY\n</b>\nA complex of buildings similar to Lefrak City.  A medium\nclose view of a LITTLE GIRL about to run DOYLE down with a\ntwo-wheel bicycle.  Two shots ring out in quick succession\nand tear up the concrete at a point where he would have been\nwalking a moment earlier.\n\nDOYLE diving for the cover of a tree.  The rifle goes off a\nthird time and MOTHERS begin to scream on the benches of the\nplayground area.\n\n<b>                         DOYLE\n</b>                   (yelling)\n            Everybody, down!  Get down on the\n            ground!\n\nDOYLE behind the tree, pulling his gun out of the ankle\nholster.  He holds the gun ready and tries to look around.\nPing, another shot that drives him back.\n\nLong panning view, DOYLE's view, from the ground, of all the\nrooftops in the area.  A blank.  The background sound is\nstill screaming crying. \"Call the police.\" \"The man's got a\ngun.\" \"Help!  Help!\" The view is still slow, careful under\nthe pressure of the panic.  There's another shot.\n\nLong shot of rifle smoke rising from NICOLI's sniper position.\n\nExterior view of the concrete tunnels, DOYLE running from\nthem toward the building, dodging and ducking behind\nplayground equipment and benches as he does.  He's shouting\nas he runs.\n\n<b>                         DOYLE\n</b>            Get down!  It's a sniper.  Get down!\n\nMedium shot of DOYLE dashing into the lobby of his building\nto a Spanish kid in the window of building.\n<b>\n</b><b>                                                           76.\n</b>\n\n<b>EXT. ROOFTOP - DAY\n</b>\nExterior shot of rooftop door opening slowly, DOYLE coming\nthrough the opening, gun at the ready.\n\nPanning shot of the rooftop, DOYLE's view, stopping for a\nbeat at the rifle and box of cartridges lying beside the\nparapet, moving on.  The roof's empty.  DOYLE sees NICOLI\nbelow, grabs rifle and cartridge.\n\nDOYLE running to the parapet, looking over.\n\nShot of the street, traffic, elevated tracks in the distance.\nLong searching look of the streets and the people.  The\nview, which is DOYLE's, passes over one man in a dark suit,\nstops and goes back.  Zap!  It's NICOLI walking quickly but\nnot in any panic toward the El.\n\nDOYLE's face.  He runs to parapet, fires at NICOLI.  Misses.\n\nDOYLE running across the roof and through the door.\n\nDOYLE bursting out of the elevator at the bottom, through a\ncrowd of WOMEN and KIDS who scream as they did in the\nplayground.\n\nMedium close view of DOYLE running as fast as he can.\n\nMedium close shot of the entrance to the El.  DOYLE coming\ninto view from off-camera, running to a stop deciding which\nto take.  He runs across the street to the downtown side\nfrom which he saw train approaching.\n\nDOYLE going over the turnstiles in a leap, gun still in his\nright hand.\n\n<b>EXT. PLATFORM OF EL - DAY\n</b>\nBroad view of platform, DOYLE emerging looking right and left.\n\nDOYLE's view across tracks.  There's NICOLI, standing with a\ngroup of people.\n\nDOYLE looking up tracks to see if he can get across.\n\nTraining pulling in an opposite side.  Train pulling in\nright in front of DOYLE.\n\n<b>                         DOYLE\n</b>            Stop that guy.  He's wanted by the\n            police!\n\nSide medium close shot of DOYLE turning and plunging back\nthrough the doorway of platform exit.\n<b>\n</b><b>                                                           77.\n</b>\n\n<b>INT. TRAIN CAR - DAY\n</b>\nIn one corner of the train is a transit policeman.  He's\nobserved Doyle shouting and gesturing at NICOLI who sits\nnervously aware of the policeman's presence.  Long longs\nbetween them.  Finally, the officer decides to approach\n<b>NICOLI.\n</b>\nNICOLI panics and runs.  The officer goes after him and\ntraps him against the door between cars.\n\n<b>INT. TOKEN BOOTH - DAY\n</b>\nClose shot of DOYLE with badge at token booth.\n\n<b>                         DOYLE\n</b>            Where's the next stop?  Going into\n            the city?\n\n<b>                         TOKEN ATTENDANT\n</b>                   (glancing out in\n                   direction the train\n                   was hurtling)\n            25th Avenue.\n\n<b>INT. TRAIN - DAY\n</b>\nNICOLI and the TRANSIT POLICEMAN struggle, as the handful of\npassengers watch.  NICOLI pulls his .45 and clobbers the\nofficer on the side of the head.\n\nClose of NICOLI going from one car to another, opening doors\non the rear, moving through yet another crowd.\n\n<b>EXT. STREET - DAY\n</b>\nMedium close shot of DOYLE running into the street, forcing\na driver to stop.  DOYLE moving so hard he falls against the\nhood of the car then dashes around to the door and jerks it\nopen.\n\n<b>                         DOYLE\n</b>            Police!\n\nMedium close shot of DOYLE dragging MIDDLE-AGED MALE DRIVER\nout from behind the wheel as he shouts.\n\n<b>                         DRIVER\n</b>            What the hell?\n\n<b>                         DOYLE\n</b>                   (diving behind the wheel)\n            Police!  Emergency!\n<b>\n</b><b>                                                           78.\n</b>\n\nDOYLE has a pistol in his hand.  The man falls back\nsputtering.  DOYLE jams car into gear and it roars off.\n\n<b>INT. SUBWAY TRAIN CAR - DAY\n</b>\nNICOLI pounds on the door of the Motorman's cab with his gun.\n\nAfter a long moment - the door cracks open.  Close shot\nNICOLI pushing his way into the cab of the subway MOTORMAN,\nsixtyish, worn and frail looking.\n\nMOTORMAN looks down.  He follows the glance to NICOLI's .45.\n\n<b>EXT. STREET - DAY\n</b>\nSide close view of DOYLE screeching to a stop to avoid\nplunging into a panel truck.  DOYLE sticks his head out the\nwindow to look up at the tracks as the DRIVER of the truck\nscreams.\n\n<b>                         TRUCK DRIVER\n</b>            Blind sonofabitch!\n\nOverhead view of the tracks, train roaring along them.\nDOYLE's view.\n\n<b>INT. SUBWAY TRAIN - DAY\n</b>\nThe tracks racing by from the view of the train.  We're\napproaching a station.\n\n<b>INT. MOTORMAN'S CABIN - DAY\n</b>\nNICOLI's close view of the MOTORMAN, the gun on the man.\n\n<b>                         NICOLI\n</b>            Don't stop!  Continue on to the\n            next station!\n\n<b>                         MOTORMAN\n</b>            I got to stop.\n\n<b>                         NICOLI\n</b>            Touch the brake and I'll blow you\n            in half.\n\n<b>                         MOTORMAN\n</b>            The signal lights are automatic.\n            If I go through a red I'll be\n            automatically braked.\n\nThe MOTORMAN pales, his hand goes to his left side in a\ngesture of anxiety, possibly pain.\n<b>\n</b><b>                                                           79.\n</b>\n\n<b>EXT. SUBWAY ENTRANCE - DAY\n</b>\nSide close view of DOYLE screeching to a stop, the car\nbumping up on the sidewalk and DOYLE plunging out the door\nwhich he leaves hanging open.  He races around the car for\nthe steps to the El.\n\n<b>EXT. SUBWAY PLATFORM - DAY\n</b>\nSide view of train roaring through the station without\nstopping.\n\n<b>INT. SUBWAY TRAIN - DAY\n</b>\nMedium close shot of CROWD on train pushing toward the\nMOTORMAN's cab.  They are upset over the missed stop.  The\nCONDUCTOR seems to be the most annoyed.\n\nHe's pushing hardest toward the camera to complain.\n\n<b>                         VOICES\n</b>            Didn't stop.\n            Went right through there...\n            Hey, man, that's my station...\n            Where the hell's he going?\n            Hey, stop the car...\n\nClose shot of NICOLI's back, half in the MOTORMAN's cab, as\nhe faces the CROWD.  Now the cries turn to:\n\n<b>                         VOICES\n</b>            He's got a gun...\n            The motorman's gone crazy...\n            Oh my God!\n\n<b>                         NICOLI\n</b>            Get back.\n\n<b>                         CONDUCTOR\n</b>            Hey, you can't...\n\nSide view of NICOLI, the MOTORMAN in the background the\nCONDUCTOR leaping at NICOLI.  NICOLI burns him; one gut shot.\nThe car turns to pandemonium of screams.  The CONDUCTOR is\nhurled back into the crowd by force of the blast.  The\nMOTORMAN throws back his head in fright, and the beginning\nof a coronary.\n\n<b>EXT/INT. DOYLE'S CAR - DAY\n</b>\nClose shot of DOYLE from back seat, twisting, turning the\ncar in a wild demonstration of pursuit driving around cars,\nbraking, roaring ahead.\n<b>\n</b><b>                                                           80.\n</b>\n\nWe move out through the windshield for a lurching, spinning,\ntwisting view of the tracks overhead, the street signs and\nlights flashing by in a reeling montage of movement, the\ntrain roaring above it all.\n\n<b>INT. SUBWAY TRAIN - DAY\n</b>\nClose side shot of NICOLI turning to cover the MOTORMAN, who\nis clutching in pain, slumping toward the controls.\n\n<b>                         MOTORMAN\n</b>                   (gasping)\n            I can't breathe.\n\nNICOLI glances quickly to his left, out the window to the\nnext station.\n\nLong, low view of the tracks, partially NICOLI's view.\nThere are red blinkers on the side of the tracks.  Red\nlights up ahead.  That's the back of another train.  It has\nstopped and we're hurtling toward it.\n\nWide shot of screaming pack of subway riders, fighting their\nway back from NICOLI, succeeding only in turning themselves\ninto a tightly contained mob.  Now the words they cry are:\n\n<b>                         VOICES\n</b>            We'll crash.\n            Won't somebody please help me.\n            Murder\n            He's a killer.\n            Crash.  We'll crash!\n            Stop.  Stop the train.\n\n<b>EXT. DOYLE'S CAR - DAY\n</b>\nSide close view of DOYLE driving while he's looking up.  He\nskids through a red light, narrowly missing a pedestrian and\nan oncoming group of cars.\n\nLong, low view of the train from DOYLE's position.\n\n<b>INT. SUBWAY TRAIN - DAY\n</b>\nClose shot of cord dangling above a sign that says \"Pull for\nEmergency Stop Only.\" It just dangles, wobbles, forgotten in\nthe panic.\n\n<b>EXT. DOYLE'S CAR - DAY\n</b>\nClose side shot of DOYLE driving, skidding on streetcar\ntracks, panning upward to show the car pulling ahead of the\ntrain.\n<b>\n</b><b>                                                           81.\n</b>\n\n<b>INT. SUBWAY TRAIN - DAY\n</b>\nClose shot of NICOLI from behind, looking out the window of\nthe car where we see ourselves hurtling toward the other\ntrain, now only about 100 yards away.  Hold on the train\nahead.  The MOTORMAN collapses over the throttle.\n\nRear close shot of NICOLI plunging into the panicky riders\nwith gun in hand, trying to get out with them to some rear\ncar.\n\n<b>EXT. SUBWAY STATION - DAY\n</b>\nMedium close of DOYLE arriving at the station.\n\n<b>INT. SUBWAY CAR - DAY\n</b>\nBack end of subway car looming up at high speed.\n\n<b>EXT. 62ND STREET STATION - THE TRACKS - DAY\n</b>\nThe leader train sits waiting about twenty yards out of the\nstation.  As the onrushing train approaches, it passes\nthrough the yellow signal light at the rear of the station.\n\n<b>EXT. CLOSE SHOT THE TRIP LOCK - DAY\n</b>\nAs the onrushing car pulls equal to the red signal light at\nthe front of the station, the tiny trip lock on the track\nsprings up, activating the safety brake.  The trains avoid\ncollision by a few feet as the front car screeches to a halt.\n\n<b>INT. THE ONRUSHING TRAIN - DAY\n</b>\nThe passengers are thrown violently to the ground.\n\nNICOLI gets to his feet and forces open one of the doors.\n\n<b>EXT. 62ND STREET TRACKS - DAY\n</b>\nNICOLI makes his way out of the train and runs along the\ntracks for a few yards, narrowly avoiding the third rail.\nHe climbs onto the station platform, to the shock and\namazement of several onlookers.  He is dazed and disheveled,\nno longer a hunter.\n\n<b>EXT. ENTRANCE TO THE 62ND STREET STATION - DAY\n</b>\nNICOLI staggers down the stairs to the street, unarmed.\n\nDOYLE is waiting at the foot of the stairs.\n\nNICOLI sees him, turns in desperation to run back up.\n<b>\n</b><b>                                                           82.\n</b>\n\nDOYLE has his .38 drawn.  He fires three shots into NICOLI's\nback.\n\nNICOLI stiffens and falls backward coming to rest at DOYLE's\nfeet.  DOYLE collapses next to him.\n\n<b>EXT. CANDY STORE - DAY\n</b>\nSAL and ANGIE emerge and get into the Mercury.\n\n<b>EXT. MANHATTAN STREET - DAY\n</b>\nLong shot of the Mercury stopped.  SAL gets out and walks\nquickly to the garage entrance and down the ramp as ANGIE\ndrives off in the Mercury.  Pan to\n\n<b>EXT/INT. DOYLE'S CAR - DAY\n</b>\nClose shot of DOYLE and RUSSO from the front.  DOYLE looks\nafter ANGIE's car.\n\n<b>INT. GARAGE - DAY\n</b>\nMedium close shot of RUSSO from the rear as he walks down\nthe ramp toward a glass attendant's booth in the background.\nWe pan around the garage looking for SAL but don't find him.\nAs RUSSO approaches the booth, we see the figure of a man\npartially obscured by the door and the entrance framework.\n\nClose shot of RUSSO from the front.\n\n<b>                         RUSSO\n</b>            Hey, Mac, have you seen...?\n\nClose shot of the man turning.  It is SAL BOCA.\n\nClose shot of RUSSO and BOCA in face-to-face confrontation.\n\n<b>                         RUSSO\n</b>            ...the guy who runs this joint?\n\nThere's a tense pause as BOCA looks at RUSSO.\n\nClose shot of BOCA.\n\n<b>                         SAL\n</b>            Yeh.  He's over getting my car.\n\nMedium close shot of GARAGE ATTENDANT holding the door of\nthe Lincoln open for SAL, shutting it and taking the ticket\nfrom the windshield.  As BOCA puts car in gear and drives\noff, we pan to BUDDY RUSSO standing there watching.  The\nATTENDANT walks up.\n<b>\n</b><b>                                                           83.\n</b>\n\n<b>                         ATTENDANT\n</b>            Can I help you...?\n\nMedium close shot of ATTENDANT and RUSSO.  BUDDY, ignoring\nthe ATTENDANT, watching the Lincoln take off, then breaking\nloose and running toward the ramp.\n\nClose shot of RUSSO from DOYLE's viewpoint, piling into the\ncar.\n\n<b>                         RUSSO\n</b>            He's in the brown Lincoln - foreign\n            plates.\n\nClose shot of DOYLE throwing the car into gear and shooting\ndown the street.\n\nLong view of the street from DOYLE's windshield of the\nLincoln in the distance.  We pick up speed and weave through\ntraffic in pursuit.\n\n<b>EXT. STREETS - DAY\n</b>\nImpressionistic shot of Lincoln and DOYLE's car winding\nthrough Brooklyn streets.\n\nLong shot of the Lincoln, SAL BOCA parking it, getting out\nand locking the doors, looking around and walking away.\n\nThe Mercury comes around a corner, ANGIE at the wheel.  The\ncar stops and SAL gets in.\n\nAs the Mercury takes off, Detective PHIL KLEIN follows in\nhis car.\n\nClose shot of DOYLE and RUSSO in their car parked several\ncar lengths and across the street from the Lincoln.\n\n<b>NIGHT\n</b>\nLong shot of the Lincoln, zooming on the glittering car.  In\nthe BG, eight youngsters are playing a game of street hockey.\n\n<b>INT. DOYLE'S CAR - NIGHT\n</b>\nClose shot through windshield of DOYLE and RUSSO.  MULDERIG\nand KLEIN in their car.\n\n<b>                         DOYLE\n</b>            Timezit?\n\n<b>                         RUSSO\n</b>            Four.\n<b>\n</b><b>                                                           84.\n</b>\n\n<b>EXT. DOYLE'S CAR - NIGHT\n</b>\nLong view over the hood of DOYLE's car to the street.  We\ncan see the Lincoln.  The lights of a car appear on the left\nand come down the street past the Lincoln, slowly, like a\nman looking for a place to park.  We can make out, but just\nbarely with the help of the street lights, four people in\nthe car.\n\nDOYLE in close profile, the foreground, picking up a corner\nof the Lincoln in the background.  While we are looking in\nsilence, there is a glimmering flow in the far corner, the\nbeginning of approaching headlights again.  They grown\nbrighter and DOYLE's foreground profile turns to watch it\ncome.\n\n<b>                         DOYLE\n</b>                   (softly)\n            Same car.\n\n<b>                         RUSSO\n</b>            Third time around.\n\nRUSSO and MULDERIG straightening up, leaning close to window\nto peer out.\n\nLong view over the hood of DOYLE's car of the approaching\nvehicle, which suddenly switches off its lights and turns on\nits parking blinkers.  It comes abreast of the Lincoln and\nstops.  The men get out and chase the Lincoln.\n\nView through windshield at the four men.  DOYLE is now up\nstraight and at the wheel.  He's leaning forward, his hand\non the key of the car.  He glances back to MULDERIG.\n\n<b>                         DOYLE\n</b>                   (to car radio)\n            Let's him 'em.\n\nView of the hood.  All hell breaks loose, headlights,\nincluding DOYLE's flash on and form a spotlight on the\nLincoln and the figures around it.  Frozen in the headlights,\nconfused, startled, and disbelieving are FIVE PUERTO RICANS\nwith a variety of auto-stripping tools in their hands: lug\nwrenches, tire irons, pinch bars, monkey wrenches, etc.\nDOYLE drives right up to them.  The camera leaps out of the\ncar with him and runs toward the men.  We hear voices\nshouting.\n\n<b>                         VOICES\n</b>            Police!  Don't move... get you...\n            hands up... you're under arrest...\n<b>\n</b><b>                                                           85.\n</b>\n\n<b>EXT. STREET - NIGHT\n</b>\nClose view of DOYLE holding his gun on one of the terrorized-\nlooking Puerto Ricans.  The KID's hands are rising\ntentatively.  He's too scared to move.\n\n<b>                         DOYLE\n</b>            Up!  Up, you sonofabitch!\n\nIn the background, the scene is being duplicated by two or\nthree others.\n\nOverhead view of this headlight and flashlight arena of\nabout 10 or 12 DETECTIVES forming small clusters, throwing\nthese guys up against cars, pulling their arms around behind\nthem and throwing cuffs on them while others rapidly frisk\nthem for weapons, taking away one pistol, a couple of knives.\n\nMULDERIG and DOYLE looking at their MAN up against the\nLincoln as RUSSO finishes snapping handcuffs on him.\n\n<b>                         DOYLE\n</b>            Of all the goddam cars they had to\n            pick to steal hubcaps.\n\nClose shot of the front end of the Lincoln, upended on a\nhoist attached to a police tow truck.  The area is less\nbrightly lighted by headlights now.  Some cars have departed\nwith the Puerto Rican AUTO STRIPPERS.  DOYLE's interest\nfocuses on the car.  We pick him up as we pan to him sitting\non the running board of the tow truck, talking with its\nDRIVER, who is making a report on a clipboard.  MULDERIG and\nRUSSO are standing nearby, talking to TWO PLAINCLOTHESMEN.\n\n<b>                         DOYLE\n</b>                   (looking up and around)\n            A bunch of lousy little spic car\n            thieves.\n\n<b>                         MULDERIG\n</b>            Nothing in there except a New York\n            street map.\n\n<b>                         DOYLE\n</b>            Tumble it.  One end to the other.\n\nRUSSO jotting in his note pad, then glancing up to the off-\ncamera DOYLE.\n\nDOYLE, medium close, hands jamming into his pockets, staring\nat the ground with RUSSO and MULDERIG.\n<b>\n</b><b>                                                           86.\n</b>\n\n<b>INT. POLICE GARAGE - DAY\n</b>\nA montage as the Lincoln is being disassembled.  First it is\nweighed.  We then see the MECHANIC drain the gas, pull apart\nthe transmission and check through the brake drums, rip out\nthe seats.\n\nMECHANIC ducking out from under the car, moving toward off-\ncamera DOYLE.\n\n<b>                         MECHANIC\n</b>            Nobody's been under there with\n            anything but a grease gun since if\n            came off the line.\n\nDOYLE's hand reaches out from off-camera and takes a\ncigarette package out of the MECHANIC's pocket.\n\n<b>                         DOYLE\n</b>            I don't buy it.  The stuff is on\n            this car.\n\n<b>                         MECHANIC\n</b>            Then you find it.  I can't.\n\n<b>INT. POLICE SERGEANT'S OFFICE AT GARAGE - DAY\n</b>\nShot of DEVEREAUX and LA VALLE.\n\n<b>                         LA VALLE\n</b>            The car was lost sometime this\n            evening.  First they send us to\n            Pier One -- then they send us\n            here --\n\n<b>                         DESK SERGEANT\n</b>            I don't understand why you had it\n            parked on the waterfront.  You're\n            staying at the Doral and you lose\n            your car somewhere out by the\n            Brooklyn Bridge.\n\n<b>                         LA VALLE\n</b>            In point of fact, M. Devereaux is\n            scouting locations for a film for\n            French Television.  He left the car\n            to look at some point of interest.\n\n<b>                         DEVEREAUX\n</b>                   (moving, excitable)\n            We were told by the Police\n            Commissioner's office that the car\n            was brought to this garage.  I\n            demand its immediate return.\n<b>\n</b><b>                                                           87.\n</b>\n\n<b>                         DESK SERGEANT\n</b>            If you'll be patient, Mr. Devereaux.\n\n<b>                         DEVEREAUX\n</b>                   (moving)\n            I have been patient enough.  There\n            is no reason I should have to waste\n            time with this red tape.\n\n<b>                         LA VALLE\n</b>            Mr. Devereaux is an extremely\n            important guest of this country.\n            He is working with the absolute\n            cooperation and participation of\n            your government.  Here are his\n            credentials from the French\n            Consulate.\n                   (showing them)\n            Unless you wish to see this episode\n            portrayed in his film I suggest you\n            locate his car immediately.\n\nShot of DOYLE and RUSSO near the Lincoln, now up on hoists.\nPolice MECHANIC in background.\n\n<b>                         MECHANIC\n</b>            What are you looking for?  Is it as\n            big as an orange or an elephant's\n            ass?  I've been over every inch --\n            top to bottom.  If you could give\n            me a club -- to the size...\n\n<b>                         RUSSO\n</b>                   (doing rough figures\n                   on a piece of scratch paper)\n            What was the weight of the car when\n            you got it, Irv?\n\n<b>                         MECHANIC\n</b>                   (consulting his notes)\n            4,839 pounds.\n\n<b>                         RUSSO\n</b>                   (consulting Lincoln\n                   Specification Book)\n            You're sure?\n                   (he does quick addition)\n            The manufacturer's spec says it\n            should weigh 4,719 pounds.  This\n            one's carrying roughly 120 extra\n            pounds somewhere.\n\nHe produces a copy of a ship's manifold.\n<b>\n</b><b>                                                           88.\n</b>\n\n<b>                         RUSSO\n</b>            When it was booked in at Marseilles\n            it weighed the same.  120 pounds\n            overweight.  Jimmy has to be right.\n\nThe THREE MEN turn again to stare at the Lincoln.  The\nMECHANIC lowers the hoist, thoughtfully.\n\n<b>                         MECHANIC\n</b>            I ripped everything out except the\n            Rocker panels.\n\n<b>                         DEVEREAUX\n</b>            What's that?\n\nThey look at each other for a long moment.\n\nMECHANIC starts to undo the side Rocker pans.  JIMMY pulls\nthe pan off and sticks his arm into the enclosure.  Feeling\naround inside he pulls out the first kilo-sized plastic\ncontainer as several others start tumbling out after.  BUDDY\nand DOYLE are smiling at each other as they continue to pull\nthe bags out.  Several of the other MECHANICS in the garage\nare gathered around the happy moment.  They repeat this\naction on the other side of the car.\n\nRUSSO enters garage sergeant's bullpen.  DEVEREAUX and LA\nVALLE are still arguing with the SERGEANT.\n\n<b>                         RUSSO\n</b>            Got it for you, Randy -- it just\n            came in from downtown.  Who's\n            Devereaux?\n\n<b>                         LA VALLE\n</b>            This is M. Devereaux.\n\n<b>                         RUSSO\n</b>            I'm sorry, Mr. Devereaux, but we\n            get reports on a couple hundred\n            vehicles a night.  Sometimes it's a\n            little tough to keep track.\n\n<b>                         DEVEREAUX\n</b>            You mean the car's here now?\n\n<b>                         RUSSO\n</b>            Yeah -- fine -- it's okay -- not\n            even a scratch.  You're all set.\n                   (handing DEVEREAUX keys)\n\n\nRUSSO walking with DEVEREAUX and LA VALLE.\n<b>\n</b><b>                                                           89.\n</b>\n\n<b>                         RUSSO\n</b>            Someone stole it right off the\n            street, huh?  You're gonna have to\n            pay the tow away charge.\n\n<b>                         DEVEREAUX\n</b>            I was told these things happen in\n            New York -- but one never expects it.\n\n<b>                         RUSSO\n</b>            Yeah.  Well, it's in perfect shape.\n            You must lead a charming life.\n\n<b>INT. HOTEL LOBBY - DORAL - DAY\n</b>\nMedium close shot of DEVEREAUX striding through the lobby\ntoward the camera. (DIALOGUE IN FRENCH)\n\n<b>                         CHARNIER\n</b>            Henri...\n\nMedium close shot of DEVEREAUX turning to face CHARNIER, who\nhas been waiting for him.\n\n<b>                         CHARNIER\n</b>            Did you pick up the car?\n\n<b>                         DEVEREAUX\n</b>            It is waiting for you in the garage.\n\n<b>                         CHARNIER\n</b>            Did they follow you?\n\n<b>                         DEVEREAUX\n</b>            I wasn't looking.\n\n<b>                         CHARNIER\n</b>            Henri... I need one more favor from\n            you.  I know I am imposing...\n\n<b>                         DEVEREAUX\n</b>            My friend, I am not sure about what\n            is going on -- but for me, I am\n            finished.\n\n<b>                         CHARNIER\n</b>            Not quite -- you are in it whether\n            you like it or not.  The police\n            know you brought the car into the\n            country.  This makes you an\n            accomplice.\n<b>\n</b><b>                                                           90.\n</b>\n\n<b>                         DEVEREAUX\n</b>            An accomplice to what?!  What have\n            you gotten me into, Alain?  You\n            asked me to do you a favor -- and I\n            did what you asked -- but you've\n            taken advantage of me.  I have my\n            reputation --\n\nCHARNIER pulls DEVEREAUX further aside.\n\n<b>                         CHARNIER\n</b>            Calm down -- Henri!  You must trust\n            me -- this is an extremely\n            complicated situation to which\n            there is a simple solution if you\n            do exactly what I tell you.  It's\n            worth more money to you.\n\n<b>                         DEVEREAUX\n</b>            Goodbye.\n\nDEVEREAUX turns and walks into the crowded lobby leaving\nALAIN standing alone.\n\n<b>EXT. HOTEL STREET - DAY\n</b>\nMedium close shot of the Lincoln.  We can't see the driver\nimmediately.  As we follow the car, it hesitates; horns\nsound and it moves ahead with a jerk.\n\n<b>INT. LINCOLN - DAY\n</b>\nClose shot of CHARNIER at the wheel of the Lincoln, trying\nto make out street signs and directions.\n\n<b>EXT. TRIBORO BRIDGE - DAY\n</b>\nMedium shot of the Lincoln going across the Triboro Bridge.\n\n<b>EXT. WARD'S ISLAND - DAY\n</b>\nCHARNIER's view through the windshield as he drives along\nthe new road and turns left on the old service road.\n\n<b>EXT. OLD SERVICE ROAD - WARD'S ISLAND - DAY\n</b>\nHellgate Bridge overhead in BG.  Lincoln drives along old\nroad and into abandoned garage.\n\n<b>INT. WARD'S ISLAND GARAGE - DAY\n</b>\nView from CHARNIER's POV out the window of the building.\nFaces appear beside the car.  First BOCA's, then WEINSTOCK's,\nthen LOU BOCA and two MECHANICS.\n<b>\n</b><b>                                                           91.\n</b>\n\n<b>                         BOCA\n</b>            Keep going.  Right in there.\n\n<b>                         FIRST MECHANIC\n</b>            Over there.  On the right.\n\n<b>                         SECOND MECHANIC\n</b>            The clear spot.\n\n<b>INT. GARAGE - DAY\n</b>\nMedium close shot of the Lincoln.  The Rocker panels are\nopen and the junk is being unloaded.  CHARNIER is standing\nby two suitcases of cash.  He takes a bundle out of the\nsuitcase, riffs the deck of bills with his fingers to make\nsure it's money all the way through; puts it in a separate\nstack that will go into the rocker panels of a nearby junk\ncar.  WEINSTOCK is standing next to the CHEMIST, with his\ntesting equipment.  The MECHANICS are under the Lincoln and\npassing out the kilos of heroin, BOCA is helping them.  The\nkilos are concealed in the floor boards of the old garage.\n\nClose shot of CHARNIER's hands, working on the money.\n\nClose shot of the CHEMIST taking a sniff, then a taste.\n\nClose shot of SAL BOCA and MECHANICS continuing to unload\npacket after packet after packet of heroin.\n\nClose shot of CHARNIER as the stacks of money are loaded\ninto the car.\n\nClose shot of BOCA taking a bottle of Seagram's Seven Crown\nout of a brown paper bag.\n\nCHARNIER extends his hand.  WEINSTOCK takes it; they shake.\n\nCHARNIER close, looking back at the car as the rocker panels\nare restored to the Lincoln.  The junk car with the money\nsecreted is removed.\n\nMedium shot of SAL BOCA and CHARNIER getting in the Lincoln.\nIn the b.g. a tow truck hauls the battered junk car out to\nawait shipment.\n\n<b>EXT. WARD'S ISLAND BRIDGE - DAY\n</b>\nLong view from the bridge of the Lincoln coming toward the\ncamera over a small rise.\n\nView from Lincoln, between SAL and CHARNIER, over the hood\nof the car and to the entrance to the bridge.  There is a\npolice blockade.  Standing in front of it are DOYLE, RUSSO,\nMULDERIG and PHIL KLEIN.\n<b>\n</b><b>                                                           92.\n</b>\n\n<b>CLOSE-UP CHARNIER.\n</b>\nCLOSE-UP DOYLE.  He gives CHARNIER a little wave.\n\nLong view of the Lincoln stopping in the middle of the\nbridge.  Zoom in on it as SAL hurriedly turns it around,\nsmashing into the side of the bridge as he does.\n\nMedium shot of the Lincoln racing back across the island.\nThe Mercury roars past WEINSTOCK's car, heading toward the\nbridge.\n\nWEINSTOCK's car coming to a stop.\n\nClose shot of the CHEMIST and WEINSTOCK in the car, turning\nback to the island.\n\n<b>INT. LINCOLN - DAY\n</b>\nClose shot of CHARNIER and SAL.  SAL driving, CHARNIER\nlooking out the back window.  The police cars, slowly, begin\nto gun engines and start the pursuit.  The sirens begin to\nwail.\n\n<b>INT. GARAGE - DAY\n</b>\nThe Lincoln roaring into the asylum toward the camera,\nscreeching to a stop.  SAL and CHARNIER leaping out.  They\nrun toward Crematorium Building.\n\nMedium long shot of SAL running off.\n\n<b>                         SAL\n</b>                   (shouting)\n            Bulls!\n\nCHARNIER hesitates.  Then runs into the darkness of the\nCrematorium.\n\n<b>EXT. CREMATORIUM - DAY\n</b>\nPolice cars screeching to a halt around the building.  Some\ncircling to the back to cut it off.  DOYLE, RUSSO, MULDERIG,\nKLEIN and others getting out and running toward the entrance,\ntaken by the Lincoln.\n\n<b>EXT. JUNK GRAVEYARD - DAY\n</b>\nClose shot SAL BOCA and the two MECHANICS at the auto\ngraveyard.  The MECHANICS start to run and are pursued by\nKLEIN and TWO OTHER COPS.  SAL decides to shoot it out.\nRUSSO in pursuit.\n<b>\n</b><b>                                                           93.\n</b>\n\nAfter a chase around the graveyard RUSSO burns SAL who dies\namong the wrecked cars.\n\nWEINSTOCK and the CHEMIST emerge from the cars.  Hands in\nthe air.  They give up without a struggle.\n\n<b>                         RUSSO\n</b>            Phil, you take that side, Bill, go\n            around the other way.\n\n<b>INT. CREMATORIUM - DAY\n</b>\nLong shot, we can see somebody running, hear his footsteps,\nbut can't tell who it is.\n\nShot of DOYLE entering.\n\nShot of DOYLE, gun in hand, going around corner of long\ncorridor, looking down it.\n\nShot of MULDERIG running down one of the corridors and into\na cell littered with abandoned furniture, sinks, toilets, etc.\n\nLong view of the hallway.  Halfway down, LOU pops out and\nfires wildly at the camera.\n\nDOYLE close, pulling back, then leaning out and blazing away\ntwice.\n\nLong shot of LOU, staffering into the corridor and collapsing.\n\nDOYLE running down the corridor leaping over LOU's body and\ncontinuing to run to bisecting corridor.\n\n<b>INT. CELLAR - DAY\n</b>\nDOYLE comes down the stairs and into the cellar.  In the\nforeground, behind a pile of ripped-out wall and floorboards,\nthere appears to be the crouched silhouette of a man.  DOYLE\nexits.\n\nDOYLE's view down second corridor.  At far end of it a\nfigure flitting past.\n\n<b>                         RUSSO\n</b>            Jimmy?\n\nClose shot of RUSSO at the head of a flight of stairs.\n\n<b>                         RUSSO\n</b>            Jimmy?\n\nDOYLE's P.O.V.: A shadow figure ducks into one of the rooms.\n<b>\n</b><b>                                                           94.\n</b>\n\nClose of DOYLE up against a wall.\n\n<b>                         DOYLE\n</b>                   (a whisper)\n            Cover the other side -- Frog Number\n            One is down there.\n\nRUSSO scrambling along the Crematorium wall.\n\nDOYLE moving slowly down the opposite wall.\n\nMedium shot of DOYLE approaching the end rooms.  A figure\nslips out of one of them, shrouded with shadows.\n\nClose of DOYLE firing twice into the camera.\n\nClose shot of the figure.  It's AGENT BILL MULDERIG spinning,\ndropping, his own service revolver clattering on the concrete.\n\nMedium close shot of DOYLE standing over MULDERIG's body,\ntwo or three COPS coming up, including RUSSO.\n\n<b>                         RUSSO\n</b>                   (leaning over the body)\n            He's gone, Jimmy.  Bill is dead.\n\nDOYLE full figure, close.  A long pause -- and then --\n\n<b>                         DOYLE\n</b>            The sonofabitch is in here somewhere.\n            I saw him -- I'm gonna get him.\n\nDOYLE exits down the corridor.  The others staring after him.\n\n<b>EXT. CREMATORIUM\n</b>\nWithin the building no one is visible.  Overhead, the\nHellgate Bridge, sounds of New York, jets, auto traffic, and\nan approaching Penn Central train.\n\n<b>                           THE END\n</b>\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>French Connection, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Ernest Tidyman\" title=\"Scripts by Ernest Tidyman\">Ernest Tidyman</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/French Connection, The Script.html#comments\" title=\"French Connection, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:05:40.778351"}