{"title": "Gamer", "film_link": "/Movie Scripts/Gamer Script.html", "script_link": "/scripts/Gamer.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Gamer Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Gamer.jpg\" title=\"Gamer Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/6-stars.gif\"/> (6.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Mark Neveldine\" title=\"Scripts by Mark Neveldine\">Mark Neveldine</a><br/>  <a href=\"/writer.php?w=Brian Taylor\" title=\"Scripts by Brian Taylor\">Brian Taylor</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : September 2007<br/>\n<b>Movie Release Date</b> : September 2009<br/>\n<br/>\n<a href=\"/scripts/Gamer.html\">Read \"Gamer\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                              GAMER\n</b>\n\n\n                            Written by\n\n                   Mark Neveldine &amp; Brian Taylor\n\n\n\n\n\n                                             September 2007\n\n<b>\n</b>\n\n    Some   of   them   want   to   use you\n    Some   of   them   want   to   get used by you\n    Some   of   them   want   to   abuse you\n    Some   of   them   want   to   be abused\n\n                                     - Eurythmics\n\n\n\n\n    Some years from this exact moment...\n\n<b>1   INT. TRAIN - DAY                                                  1\n</b>\n<b>    DARKNESS - NOW\n</b>\n    The beautiful CHIMING SOUNDS OF SPACE TRAVEL through the\n    COSMOS... DOTS OF LIGHT whiz past our face.\n\n    They could be stars at lightspeed, or... SUBWAY LIGHTS\n    FLICKER ON - in a flash we see PALE, SULLEN FACES, riding\n    into a bleak future, and hear the INDUSTRIAL CLATTER. It's\n    dark, claustrophobic, obscure... the rhythmic beat of track\n    and wheel-clicks engulf us. The lights flicker back on and\n    hold as we see a half dozen SOLDIERS in BROWN CAMO, steel-\n    eyed, prepared for whatever may be at the end of the TUNNEL.\n\n    ZERO IN on TWO:\n    KABLE, 30-something, roughneck... focused, determined; eyes\n    burning with internalized emotion...\n\n    ... and SANDRA, late 20s, undeniably hot but tough as hell -\n    both are in shackles &amp; cuffs, being roughly transported\n    through underground tunnels, knocked and shoved around.\n\n    Uniformed GUARDS roam the train, looking pissed off - their\n    swagger seems to mask FEAR.\n\n    KABLE is meditating, or exhausted - hard to tell.   The GIRL\n    makes eye contact w/ him.\n\n<b>                                   SANDRA\n</b>                  Sandra.\n\n    KABLE says nothing, just stares at her, stoic.\n\n                            SANDRA (cont'd)\n                  My name is Sandra.\n\n<b>                            GUARD\n</b>                  Shut the fuck up.\n\n    Because he can, the GUARD takes a swing at KABLE'S head with\n    a BILLY CLUB... CRACK!\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                    2.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>1   CONTINUED:                                                           1\n</b>\n    KABLE'S skull snaps back into the window. The GUARD swings\n    again, this time nailing KABLE square in the stomach.\n\n<b>                           SANDRA\n</b>                     (to the GUARD, a snarl)\n                 Putcher dick away...\n\n<b>                             GUARD\n</b>                 Get some.\n\n    CRACKK!! CRACK!! CRACKK!! ... CRACK!!     SANDRA is buckled\n    over, awkwardly, hands behind her back tethered to the seat,\n    head dripping blood. KABLE jerks against his restraints,\n    every inch of him wanting to RIP THE MOTHERFUCKER APART...\n    He uses his elbow to help her back up, but SANDRA fights\n    through it, sits back up and spits blood - she can handle\n    herself.\n\n    The CAMERA holds TIGHT on KABLE and SANDRA... KABLE lets a\n    glob of blood dangle from his mouth, biting his lip, bearing\n    it... we hear the CRUNCHING SOUND of the CLUB working on the\n    others... and the METALLIC RUMBLE and CLATTER of the TRAIN -\n    growing louder, POUNDING, slamming into our brains, blotting\n    out all thought... until...\n\n<b>2   INT. TUNNEL #1 - DAY                                                    2\n</b>\n    POV: we are RUNNING, ragged, full sprint, down a TUNNEL\n    towards dirty white DAYLIGHT...\n\n    NO MUSIC - just heavy breath, KABLE'S HEARTBEAT and the sound\n    of his boots bouncing off the concrete...\n\n    Others are running with us - SOLDIERS with weapons... at the\n    tunnel's end: vaguely defined shapes of buildings, smoke,\n    sky...\n\n    Our POV WHITES OUT as we...\n\n<b>3   EXT. SPAWN POINT #1 - CONTINUOUS                                        3\n</b>\n    ... smash into the DAYLIGHT.\n\n    Smoke plumes hang from a recent skirmish. KABLE climbs over\n    burning debris, gun raised, as SANDRA and the other soldiers\n    disappear into the grey mist.\n\n<b>4   EXT. SLAYERS BATTLEGROUND #1                                            4\n</b>\n    KABLE emerges from the smoke into...\n\n\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                3.\n</b><b>                         WHITE KABLE SCRIPT - 9/19/2007\n</b><b>4   CONTINUED:                                                       4\n</b>\n    ... a DESTROYED CITY - PHILLY? DETROIT? NY? Seemingly out\n    of character, he LEAPS THROUGH THE AIR SLO-MO and lands in an\n    OVERDRAMATIC, ROCKSTAR POSE (Nine Inch Nails, Coachella\n<b>    2005).\n</b>\n    In sequence, multicolored LEDs on his weapon COME TO LIFE -\n    accompanied by a low frequency hum that seems to pierce\n    somewhere below human hearing. The MULTIPLE TURRETS spin,\n    then snap into place. GO TIME.\n\n<b>5   OTHER SPAWN POINTS                                                  5\n</b>\n    Other BROWN SOLDIERS emerge like SNAKES out of DIRT HOLES and\n    INTO THE LIGHT. They crouch and spread out.\n\n<b>6   SLAYERS BATTLEGROUND #1                                             6\n</b>\n    What appear like BUZZING FLIES swarm thru the grey air - at a\n    closer look, they are like tiny BALL BEARINGS that move like\n    hummingbirds, magnetically controlled. The swarm splits\n    apart - each FLY connects with a different SOLDIER - they\n    hover one foot above and two feet behind the SOLDIER'S head.\n\n<b>7   SLAYERS BATTLEGROUND #1 - COVER                                     7\n</b>\n    KABLE slides behind a shredded telephone pole and TAKES\n    COVER. The sound of trains, weapons, soldiers all fade\n    away... until...\n\n<b>    NOTHING.   DEAD QUIET.\n</b>\n    SUDDENLY - A BULLET WHIZZES by KABLE's face - a pause - THEN\n    we hear a GUNSHOT.\n\n    Another BULLET WHIRS by his leg and another by his shoulder -\n    after the bullets pass, we hear the GUNSHOTS. See the\n    lightning, wait for the thunder.\n\n    In the peripheral a SOLDIER in DEEP BLUE CAMO runs from\n    behind an old car to a brick staircase.   Then another BLUE\n    runs the opposite way, closer in the foreground. BROWNS VS.\n    BLUES?? The SILENCE is crawling, deafening, and then...\n\n<b>    BOOM.\n</b>\n    ALL HELL BREAKS LOOSE. Suddenly we are in IRAQ TIMES TEN...\n    KABLE'S eyes glance down at his WEAPON - the turrets quickly\n    shift and rotate - he whips it up in a flash and RETURNS FIRE\n    into the mist:\n\n    THOOM! THOOM!   The shells puncture air and connect\n    distantly...\n\n\n<b>                                                          (CONTINUED)\n</b><b>\n</b><b>                                                                 4.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>7   CONTINUED:                                                        7\n</b>\n    The air ripples all around him, his world closing in... he\n    breaks free and runs toward an open street - THE TURRETS\n    READJUST - he efficiently wastes two BLUES with automatic\n    fire.\n\n<b>8   SLAYERS BATTLEGROUND #1 - OPEN STREET                                8\n</b>\n    A couple of PEDESTRIANS walk across the street, totally\n    IGNORING THE VIOLENCE. KABLE makes a perfect 90 degree cut\n    and wraps around a street-lamp and into the alley. A BUM\n    holds out a can with a couple of coins and SHAKES it.\n\n    From an aerial POV we see the area swarming with BROWN &amp; BLUE\n    combatants and a dozen CIVILIANS.   In the top right corner\n    of our frame we see the DULL REFLECTION of a FACE, somewhat\n    transparent, watching the battle, tungsten red (similar to\n    your own reflection on a TV).\n\n    We SNAP BACK to the ground - the whole area is a BATTLEZONE.\n    KABLE lines up another BLUE climbing the fire-escape to the\n    third floor window - and then, coming from the REAR SURROUND\n    SPEAKERS, behind us:\n\n    A VOICE - almost a whisper, too clean and distinct to be\n    outdoors in this environment... and TOO YOUNG to possibly\n    belong to KABLE.\n\n<b>                           VOICE (O.S.)\n</b>                     (clean, disconnected)\n                 Eat shit please.\n\n    THWIPPP!! The BLUE drops like a sack. KABLE perfectly cuts\n    back another 90 degrees and runs for an old store front.\n    Inside a CLERK \"air\" bags groceries for an empty store.\n\n    A BROWN SOLDIER sets up a TRIPOD MACHINE GUN and aims for a\n    bunker a hundred yards north. The distant BLUE targets seem\n    almost robotically unaware. The BROWN SOLDIER plants his\n    left hand on the ground for stability, right hand twisting\n    the grip-lock - and squeezing the trigger: TAT TAT TAT TAT\n    TAT TAT!!!! TATATATATATATATATA TAT!! The BLUES fall, some\n    clumsily colliding into each other before they crash to the\n    ground, dead.\n\n    Another team of BLUES rock their heads around to focus on\n    him. Uh oh...\n\n    BOOOOOSH!!!! The BROWN TRIPOD GUNNER is vaporized from the\n    knees up... the FOREARM that supported him is standing\n    straight up, cleanly severed at the elbow. It slowly wobbles\n    over and connects with the TWO LEGS severed at the knees.\n    The THREE LIMBS fall into each other, forming a flesh and\n    bone TRIPOD.\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                      5.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>8    CONTINUED:                                                              8\n</b>\n<b>     VROOOOOOSH!!! CHUKUNK, CHUKUNK!! A SNOWPLOW BARRELS THROUGH\n</b>     THE DESTRUCTION, pushing the bodies and debris out of the way\n     and clearing a path, one streaked with crimson red and burnt\n     flesh. It moves fast and vanishes into the smoke clouds.\n\n<b>9    SLAYERS BATTLEGROUND #1 - STREET                                        9\n</b>\n     Down the road, KABLE saves an EAST-INDIAN WOMAN from getting\n     obliterated by shoving her out of the way of the blazing\n     truck. As KABLE turns to waste another BLUE, the EAST-INDIAN\n     WOMAN gets right back up... walking into and getting\n     obliterated by another TRUCK.   It's creepy - robotic, but\n     violent and too real - like a programmed suicide.\n\n<b>                            VOICE (O.S.)\n</b>                  Can't say I didn't try...\n\n     We sense emotion in KABLE'S cold eyes - then they flicker to\n     the peripheral.\n\n<b>10   SLAYERS BATTLEGROUND #1 - 2ND FLOOR BUILDING                          10\n</b>\n     Tracking along a row of blown out windows a BLUE is taking\n     aim; we SNAP ZOOM in...\n\n<b>     SUPERIMPOSED OVER THE IMAGE:\n</b>\n     The transparent GHOST OF A FACE, as though projected on\n     glass. The LIPS MOVE in sync with:\n\n<b>                            VOICE (O.S.)\n</b>                  Shit! Shit!\n\n     KABLE spins, TOO LATE -\n\n     BUT: from the level directly below the SNIPER - through an\n     open doorway - we see a BROWN SOLDIER, BLASTING STRAIGHT UP\n     THROUGH THE CEILING! The BLUE is BLOWN TO CHUNKS.\n\n<b>11   SLAYERS BATTLEGROUND #1 - STREET                                      11\n</b>\n     The BROWN runs out and hits the curb; CONCRETE AND MEAT\n     collapse on the spot where she stood... it's SANDRA.\n\n     KABLE gives her covering fire as she heads his way. They\n     bolt for a corner - KABLE reaches protection first. He stops\n     to let SANDRA catch up, and in that instant -\n\n     HER BRAINS GET BLOWN TO JELL-O.          Blood and particles splatter\n     over KABLE's gear.\n\n<b>                             VOICE (O.S.)\n</b>                  Suckage.\n\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                  6.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>11   CONTINUED:                                                        11\n</b>\n     Without hesitation KABLE turns and wastes two more BLUES.\n\n     Up ahead HE SEES IT: an OCTAGON STEEL SHED with small\n     GLOWING EMERALD GREEN WINDOWS. He makes for it.\n\n     The little FLY following him is picked out of the air by a\n     stray shot - PLINK!\n\n                            VOICE (O.S.) (cont'd)\n                  ... what the...!\n\n     Bullets and shells chop up everything around KABLE, but he's\n<b>     QUICK...\n</b>\n     A SHELL smacks his shoulder HARD, almost knocking him off his\n     feet - shredding the BROWN CAMO and revealing the FLEXIBLE\n<b>     BODY ARMOR UNDERNEATH.\n</b>\n     He scrambles to the octagon's entrance and BAILS IN.\n\n<b>12   INT. SAVE POINT #1                                                12\n</b>\n     KABLE steps into the middle of the vacant steel room. The\n     second he breaks the GREEN LASER, FLOOD LIGHTS blast on all\n     around the BATTLEFIELD. A SUBMARINE ALARM sounds from\n     loudspeakers everywhere, echoing through the streets, CYCLING\n<b>     DOWN.\n</b>\n     The battle is over - session complete.\n\n<b>13   EXT. SAVE POINT #1                                                13\n</b>\n     KABLE steps out.    The LEDS on his weapon blink off in\n     sequence...\n\n     ARMED GUARDS are EVERYWHERE, rounding up the I-Con's.\n\n     [I-CONs (I-Convicts) are the combatants -- death row\n     inmates/lifers, of which there are never a shortage.\n\n     GENERI-CON's (Generic Convicts) are the street traffic that\n     lend unpredictability and realism to the battlefield... they\n     are computer controlled NPCs (non player characters)... petty\n     thiefs and criminals who are risking their lives by\n     participating to commute their sentences]\n\n     A DOZEN GUARDS collect weapons - TWO approach KABLE. His\n     eyes are pure MURDER; SANDRA'S brain matter still drips from\n     him.\n\n<b>     HE WHIPS UP THE WEAPON, POINTS IT AT A GUARD'S HEAD AND PULLS\n</b><b>     THE TRIGGER -\n</b>\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                          7.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>13   CONTINUED:                                                                13\n</b>\n     NOTHING. The GUARD doesn't even flinch. The WEAPON is DEAD,\n     dormant; they all knew it.\n\n     The GUARDS have a good LAUGH... KABLE is CLUBBED from behind -\n     we...\n\n<b>                                                             FADE TO BLACK.\n</b>\n<b>14   INT. TRAIN - LATER                                                        14\n</b>\n     Back on the rattling TRAIN, where we started. The SURVIVING\n     SOLDIERS - both BROWN and BLUE - are shackled to the rail -\n     wounded, exhausted, hollow eyed.\n\n<b>                            BLUE SOLDIER 1\n</b>                  Good run, Kable.\n\n     KABLE only looks to the floor.\n\n<b>                            KABLE\n</b>                      (quietly)\n                  My name's Tillman.\n\n<b>                            BROWN SOLDIER 1\n</b>                  Whatever your name is. You got to\n                  the save point fast.\n\n<b>                            BROWN SOLDIER 2\n</b>                  So the fuck what? No one's getting\n                  out of here alive.\n\n<b>                             BLUE SOLDIER 1\n</b>                  I am.   I'm going to make it.\n\n     The cynical BROWN just shakes his head.\n\n<b>                            BROWN SOLDIER 2\n</b>                  Sure you will.\n\n<b>                            BLUE SOLDIER 1\n</b>                      (tuning the BROWN out,\n                       turning his attention to\n<b>                       KABLE)\n</b>                  They say you only got three battles\n                  left til you get out...\n\n     KABLE says nothing.\n\n     The CAMERA pushes in on a TATTOO on his forearm: a simple\n     outline of a black box with the words inside: I AM RIGHT HERE\n<b>     WITH YOU.\n</b>\n     [MUSIC: Aldo Nova, \"LIFE IS JUST A FANTASY\" kicks in...]\n<b>\n</b><b>                                                                     8.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>15   INT. LAB - TIME INDETERMINATE                                        15\n</b>\n     A spartan, underground LAB.\n\n     A PLAIN-CLOTHES TECH sits on a stool holding a simple REMOTE;\n     on the table next to him is a SMALL METAL DISH. In front of\n     him, floating in the air, is one of the little metallic\n<b>     FLIES.\n</b>\n     He pokes at it - it instantly jukes left; again - it jukes\n     right... almost faster than the eye can follow. No way he\n     could ever touch it.\n\n     Semi-satisfied, he holds out the metal dish and clicks the\n     remote. The FLY drops into the dish - CLINK.\n\n     CLOSE-UP: the little gunmetal ball is black and dented on one\n     side - probably the one we saw get knocked out of the air.\n     There is a PINHOLE GLASS LENS on the other end.\n\n     The TECH picks it up with thumb and forefinger and holds the\n     lens up to his eyes. Switch to:\n\n     POV of the FLY CAM: the TECH'S face, extreme wide angle,\n     examining. The image flickers, glitches - then CUTS TO:\n\n<b>     WHITE NOISE.\n</b>\n<b>                                                         MATCH CUT TO:\n</b>\n<b>16   INT. TELNET CONTROL ROOM - DAY                                       16\n</b>\n     A CONSOLE of MONITORS cut from FUZZ to GRAPHICS.         TECH GUYS\n     and PRODUCERS scramble... it's SHOWTIME.\n\n<b>                         OFFSCREEN VOICE\n</b>               Counting down five... four...\n               three... two...\n\n     SWISH PAN and SNAP ZOOM across the room, through an open\n     door, to the CORRIDOR, where...\n\n<b>17   INT. TELNET NEWSROOM, CORRIDOR - CONTINUOUS                          17\n</b>\n<b>     [END: \"LIFE IS JUST A FANTASY\"]\n</b>\n     A REPORTER - GINA PARKER SMITH, sexy eager-beaver, focused -\n     a NEWS EXEC, 40s, and a CHIEF OF STAFF, 60s are walking\n     briskly along in a heated discussion.\n\n<b>                         CHIEF OF STAFF\n</b>               Do we have the damn interview or\n               don't we?\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                  9.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>17   CONTINUED:                                                        17\n</b>\n<b>                            PRODUCER\n</b>                  We're cunt hair close -\n\n<b>                            CHIEF OF STAFF\n</b>                  I can't blow off the Three-Asian\n                  War for \"close\".\n\n<b>                            PRODUCER\n</b>                  All respect, Bob, nobody cares\n                  about dead Orientals... they care\n                  about Ken Castle -\n\n<b>                            CHIEF OF STAFF\n</b>                  May I hear from Gina please?\n\n     GINA spins on him, looks CHIEF straight in the eyeballs.\n\n<b>                            GINA PARKER SMITH\n</b>                  OK, Bob? Bob. You realize Castle\n                  has clocked exactly - one - media\n                  appearance to date and that was\n                  Walters' last interview before she\n                  died - NINE FUCKING YEARS AGO!\n\n<b>                            CHIEF OF STAFF\n</b>                  Stop menstruating, just tell me we\n                  fucking have it -\n\n<b>                            GINA PARKER SMITH\n</b>                  We fucking have it!\n\n     The CHIEF OF STAFF bangs open a conference room door with his\n     fist as they blow by - veers off and disappears. GINA rolls\n     her eyes in disgust, keeps moving.\n\n                            GINA PARKER SMITH (cont'd)\n                  Palindromes.\n                      (she STOPS)\n                  Hold on. Focus: let's get lunch.\n                  Sushi, Iranian, or Mexican?\n\n<b>                            PRODUCER\n</b>                  Burger chili fry?\n\n<b>                            GINA PARKER SMITH\n</b>                      (considering)\n                  I'll freak a burger.\n\n     FREEZE FRAME on GINA - ZOOM and...\n\n<b>18   INT. NEWSCAST                                                     18\n</b>\n<b>     TV GRAPHIC:\n</b>\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                10.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>18   CONTINUED:                                                       18\n</b>\n     GINA'S BURGER-FREAKING face becomes part of an ANIMATED TITLE\n<b>     SEQUENCE.\n</b>\n<b>                                     A   LIVE\n</b>\n<b>                              WORLDLINK TONIGHT\n</b>\n<b>                                    EXCLUSIVE\n</b>\n                           with GINA PARKER SMITH\n\n     In this context it looks like she's freaking serious world\n     affairs.\n\n     NOTE: this telecast will play much faster than the page count\n     indicates - hyped up, quick cutting, overlapping dialog,\n     A.D.D. and hyper-caffeinated.\n\n<b>                            VOICEOVER\n</b>                  First... there was society...\n\n     Shots of several dozen young, trendily dressed people (we're\n     talking trends that haven't yet been invented) wandering\n     robotically around a BACKLOT-LOOKING CITY STREET,\n     occasionally bumping into one another... the graphic society\n     LOGO superimposed.\n\n                            VOICEOVER (cont'd)\n                  The ultimate SIM environment -\n                  where players don't control virtual\n                  animated characters - but actual,\n                  living, breathing human beings.\n\n     People are dancing, MAKING OUT on street corners... someone\n     tries to eat an ICE CREAM CONE, misses his mouth and pokes it\n     into his eye.\n\n                            VOICEOVER (cont'd)\n                      (quoting)\n                  They walked them, they talked them.\n                  They juiced them...\n\n     A HOT YOUNG GIRL in a WET T-SHIRT is SLAMMING a BOTTLE of\n<b>     JAGER.\n</b>\n                            VOICEOVER (cont'd)\n                  They rocked them.\n\n     A MIDDLE-AGED GUY in a shirt and tie is HEADBANGING FURIOUSLY\n     like an extra in a TWISTED SISTER VIDEO.\n\n                            VOICEOVER (cont'd)\n                  We all remember the slogan.\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                11.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>18   CONTINUED: (2)                                                   18\n</b>\n     SWITCH TO: ROWS OF PEOPLE in front of wall-sized VIDEO\n     MONITORS, transfixed, doing a kind of sign language with\n     their hands... JAPANESE lining up around the block...\n     COLLEGE STUDENTS and OFFICE WORKERS glued to screens...\n\n                         VOICEOVER (cont'd)\n               The creation of reclusive genius\n               Ken Castle, society took the world\n               by storm, becoming the number one\n               guilty pleasure of billions, either\n               playing or watching... and\n               generating one of the world's\n               largest private fortunes,\n               surpassing Steve Jobs and Bill\n               Gates practically overnight.\n\n     A FILE-FOOTAGE CLIP of KEN CASTLE - 30s, fresh and boyish,\n     Southern molasses accent - being interviewed on a news show:\n\n<b>                         KEN CASTLE\n</b>               I ain't complainin'!\n\n     FREEZE on CASTLE... the IMAGE DISTORTS in THREE DIMENSIONS,\n     offset red and blue channels shifting.\n\n<b>                          VOICEOVER\n</b>               Nine months ago, Castle unveiled a\n               new simulation - one that would\n               take gaming to new heights of\n               thrilling excess... and controversy\n<b>               - SLAYERS.\n</b>\n     SLAYERS LOGO over a slo-mo shot of BROWN and BLUE soldiers\n     walking towards CAMERA - BADASS, with BIG MOTHERFUCKING\n     WEAPONS slung at their sides...\n\n                         VOICEOVER (cont'd)\n               If society let us live thru\n               others...\n               SLAYERS would let us die thru\n               others.\n\n     Slick edited COMBAT FOOTAGE from the BATTLEFIELD.\n     Explosions, flame throwers, bullet hits... DUDES screaming,\n     unloading MASS ROUNDS...\n\n                         VOICEOVER (cont'd)\n               Slayers gives the gamer full\n               control of a flesh and blood human\n               being in full scale, kill-or-be-\n               killed combat. And when we say\n               flesh and blood, we mean flesh -\n\n     A QUICK CUT of a BROWN'S ARM BEING BLOWN OFF.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                      12.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>18   CONTINUED: (3)                                                         18\n</b>\n                         VOICEOVER (cont'd)\n               ... and blood.\n\n     An RPG EXPLODES - CHUNKS smack the lens and OOZE DOWN.\n\n<b>                                                             SWITCH TO:\n</b>\n<b>19   INT. TELNET - INTERVIEW STUDIO LIVE - CONTINUOUS                       19\n</b>\n     CASTLE is opposite GINA PARKER SMITH, both identified by\n     translucent animated CHYRONS. CASTLE is older now than in\n     the earlier clip; early 40s - his body is more solid; hair\n     cut shorter, conservative. But the eyes still SPARKLE.\n\n<b>                            GINA PARKER SMITH\n</b>               Slayers.\n\n<b>                         KEN CASTLE\n</b>                   (big smile)\n               Slayers.\n\n     CASTLE'S accent is like pure Georgia honey.           He's a rock-\n     ribbed charmer.\n\n<b>                         GINA PARKER SMITH\n</b>                   (down to business)\n               Why isn't it murder?\n\n     She leans in, playing the role of hard-hitting reporter to a\n<b>     T.\n</b>\n<b>                         KEN CASTLE\n</b>               Gina, when was the last time you\n               saw someone volunteer to be\n               murdered? I'm sure you know that\n               every last one of our Slayers is a\n               bona fide death row inmate -\n                   (points for emphasis)\n               ...each one offered a chance to\n               participate as an alternative to\n               their sentence. Stay alive for\n               thirty sessions and get set free...\n               that's not a bad God damned deal.\n\n<b>                         GINA PARKER SMITH\n</b>               I see - and has any one of these\n               men or women ever actually survived\n               long enough to be set free?\n\n     KEN just smiles, locks in on her eyes.\n\n\n\n\n<b>                                                                (CONTINUED)\n</b><b>\n</b><b>                                                                13.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>19   CONTINUED:                                                       19\n</b>\n<b>                            KEN CASTLE\n</b>                  I'd remind your audience that\n                  Slayers was put together with the\n                  full cooperation and approval of\n                  the United States federal\n                  government... that the revenue it\n                  produces is responsible for funding\n                  our entire prison system - keeping\n                  the bad guys behind bars... and\n                  that the prop was voted for by a\n                  cock solid 68% of the American\n                  public.\n\n<b>20   INT. STUDIO BOOTH, OFF CAMERA - SIMULTANEOUS                     20\n</b>\n<b>                            PRODUCER\n</b>                      (to BOARD OP)\n                  What'd he say?\n\n<b>21   INT. TELNET - INTERVIEW STUDIO LIVE - CONTINUOUS                 21\n</b>\n<b>                            GINA PARKER SMITH\n</b>                  ... in an election tainted by\n                  suspected digital fraud...\n                      (changing gears)\n                  let's talk about the so-called\n                  generi-cons.\n\n     VIDEO: a montage of slayers \"civilians\" - the bum shaking a\n     can in the midst of chaos, a group of pedestrians walking\n     robotically into a wall of flame, store clerks \"air-bagging\"\n     groceries...\n\n                            GINA PARKER SMITH (cont'd)\n                  Sent into the slayers environment\n                  with a set of pre-programmed\n                  actions, with no way to react and\n                  no one controlling them - their\n                  chances of survival are next to\n                  nil.\n\n<b>                            KEN CASTLE\n</b>                  There's a lot of men and women in\n                  prison that could never cut it as\n                  slayers... shouldn't they have the\n                  same opportunity to roll the dice\n                  for a ticket out? Besides - they\n                  only need to survive one session.\n\n     VIDEO: the East Indian Female generi-con from the first\n     battle gets smeared by a truck.\n\n\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                           14.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>21   CONTINUED:                                                                  21\n</b>\n<b>                               GINA PARKER SMITH\n</b>                  Right...\n\n<b>                                                              SUPERNOVA FLARE\n</b><b>                                                                          TO:\n</b>\n<b>22   EXT SLAYERS BATTLEGROUND                                                    22\n</b>\n     BULLET-CAM IMAGES of a SLAYERS SOLDIER leaping into action\n     and freezing in MID-AIR, a GRAPHIC SUPERIMPOSED:\n\n<b>                                 HOW DOES IT WORK?\n</b>\n<b>23   INT. TELNET - INTERVIEW STUDIO LIVE                                         23\n</b>\n     THROW TO the LIVE STUDIO BROADCAST -\n\n<b>                            GINA PARKER SMITH\n</b>                      (leaning in)\n                  Mr. Castle - how the hell does it\n                  work?\n\n<b>                               KEN CASTLE\n</b>                  Simple.\n\n     A 3-D ANIMATED GRAPHIC accompanies his explanation - the\n     VIRTUAL CAMERA zooms in to the FROZEN SOLDIER'S head - and\n     then INSIDE, passing thru transparent layers.\n\n                             KEN CASTLE (cont'd)\n                  It begins with a single nano-cell\n                  planted in the motor cortex of the\n                  brain -- this cell can replicate,\n                  replacing the cells `round it with\n                  perfect copies...\n\n     We see a cartoon image of a tiny nano-cell - labeled with a\n     bold, block letter N. The nano-cell approaches a normal cell\n     next to it... there is a flash; now the cell next to it has\n     turned into an exact copy of the nano. This continues,\n     multiplying exponentially, until we zoom back to reveal that\n     the entire brain has been converted to nano-cells.\n\n                             KEN CASTLE (cont'd)\n                  ... these copied cells contain\n                  remote access functionality.\n                  Therefore, nano plus cortex equals\n                  the nanex.\n\n     The graphic zooms back further to show a pair of hands\n     working a retro ATARI-style joystick... animated waves\n     indicate a wireless transmission from the joystick to the\n     Slayer, who unfreezes and flies into action.\n\n\n<b>                                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                15.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>23   CONTINUED:                                                       23\n</b>\n<b>                            GINA PARKER SMITH\n</b>                  Geek, geek, geek - come on, Castle,\n                  you promised us a demonstration.\n\n     CASTLE smiles broadly.\n\n<b>                            KEN CASTLE\n</b>                      (coy)\n                  Did I? You know I seem to recall\n                  that - let's just see...\n\n     CASTLE waves in his PERSONAL SECURITY:\n\n     A half dozen GEEKS in BLACK JEANS, BLACK T-SHIRTS w/ WHITE\n     SOCKS and SNEAKERS; BACKPACKS... yes, even FANNY PACKS. A\n     full range of GEEK VARIATIONS: beard/mustache combos, thick\n     glasses, pony tails, etc.\n\n     One GEEK brings out the CUTEST, SOFTEST little SPANIEL PUPPY\n     in the world and places it in CASTLE'S LAP.\n\n     Meanwhile several OTHERS are directing HANDHELD SENSORS at\n     GINA and thumb-clicking to establish TRACKING POINTS - her\n     slightest movements are scanned and interpreted as data in\n     real time.\n\n<b>                            GINA PARKER SMITH\n</b>                      (fighting it)\n                  Oh... my god. So cute.\n\n<b>                            KEN CASTLE\n</b>                  You like her? Her name is Gina.\n                  She's a good little bitch.\n\n     Somehow, in his sweet southern drawl this rolls off almost\n     acceptable. The CREW has a laugh off-screen; GINA blushes.\n\n<b>                            GINA PARKER SMITH\n</b>                  I beg your pardon?\n\n<b>24   INT. STUDIO BOOTH, OFF CAMERA - SIMULTANEOUS                     24\n</b>\n<b>                            PRODUCER\n</b>                  This motherfucker is off the\n                  charts.\n\n<b>                            CHIEF OF STAFF\n</b>                  You realize he could buy our\n                  network.\n\n<b>                            PRODUCER\n</b>                      (shrugs)\n                  Why would he?\n<b>                            (MORE)\n</b>\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                16.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>24   CONTINUED:                                                       24\n</b>                             PRODUCER (cont'd)\n                  Son of a bitch can pull 650 million\n                  pay-per-views for a single\n                  broadcast.\n\n     ON the MONITORS:\n\n     CASTLE is showing GINA how to make the dog roll over, sit up,\n     etc. GINA has her hands up, limp in front of her chin, like\n     a submissive puppy begging, and she is PANTING; she's clearly\n     getting into it... her every movement is MIRRORED by the\n     adorable dog.\n\n<b>                            BOARD OP\n</b>                  That's fuckin scary.\n\n<b>25   INT. TELNET - INTERVIEW STUDIO LIVE, CONTINUOUS                  25\n</b>\n     More COMBAT FOOTAGE, this time focusing on KABLE HIGHLIGHTS.\n\n<b>                            GINA PARKER SMITH\n</b>                  Isn't it true that each human that\n                  undergoes the procedure will have a\n                  distinct IP address -- like a\n                  notebook computer or mobile device?\n\n<b>                            KEN CASTLE\n</b>                  Similar, yep. But control is\n                  strictly localized to the\n                  parameters of our gaming\n                  environments.\n\n<b>     BACK TO THE STUDIO.\n</b>\n                            KEN CASTLE (cont'd)\n                  You take Society for instance: once\n                  a cast member leaves the workplace\n                  they are completely free from the\n                  control and monitoring of their\n                  player.\n\n<b>                            GINA PARKER SMITH\n</b>                      (incredulous)\n                  That's a relief.\n\n<b>                            KEN CASTLE\n</b>                      (teasing)\n                  To some, maybe... to some... don't\n                  you suspect a good many folks\n                  wouldn't mind an itty bit of\n                  control?\n\n<b>                            GINA PARKER SMITH\n</b>                  I don't... um...\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                17.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>25   CONTINUED:                                                       25\n</b>\n<b>                            KEN CASTLE\n</b>                  Someone else making all the\n                  decisions for you... no\n                  responsibilities, no tough\n                  choices... think about it.\n\n<b>                            GINA PARKER SMITH\n</b>                      (tough)\n                  We will, Mr. Castle. We will.\n\n     A SUPERNOVA FLARE throws to MUSIC and GRAPHICS:\n\n<b>                                       YOU\n</b>\n<b>                               ARE EXPERIENCING\n</b>\n                                      a LIVE\n\n<b>                              WORLDLINK TONIGHT\n</b>\n<b>                                    EXCLUSIVE\n</b>\n<b>26   INT. THE INTERVIEW STUDIO, CONTINUOUS                            26\n</b>\n     Back to handheld, non-broadcast REALITY.\n\n     KEN has GINA's hand in his hand, beaming. Her demeanor has\n     changed; she's like a LITTLE GIRL with her DAD at the fair.\n\n<b>                            KEN CASTLE\n</b>                  Good little talk.\n\n<b>                            GINA PARKER SMITH\n</b>                  My pleasure. Shit, can I tell you?\n                  I CAN. NOT. wait for the next\n                  Slayers. Kable has been\n                  unbelievable. His arms are just\n                  so... well, I know it's awful.\n\n<b>27   INT. STUDIO BOOTH, OFF CAMERA - SIMULTANEOUS                     27\n</b>\n<b>                            PRODUCER\n</b>                  What the hell is that?\n\n     The WORLDLINK GRAPHIC GLITCHES OUT, replaced by a BLUE SCREEN\n     - like an old school COMPUTER CRASH. THEN -\n\n     One letter at a time, in retro Apple chicago font,\n     accompanied by the exaggerated sound of COMPUTER KEYSTROKE\n<b>     CLICKS:\n</b>\n<b>                                     HUMANZ\n</b>\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                 18.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>27   CONTINUED:                                                        27\n</b>\n     Then a VOICE - deep, but speaking ARTIFICIALLY QUICKLY - like\n     in radio commercials, where they use time-compression\n     software to remove the silences between the words.\n\n<b>                            HUMANZ BROTHER\n</b>                  Ken Castle wants you to believe\n                  that you are living in a safer,\n                  better world. He's a liar. Mind\n                  control is slavery. We will all be\n                  his dog if we allow this evolution\n                  to continue.\n\n     Everyone in the STUDIO is speechless, watching the monitors -\n     including CASTLE; actually, he LOVES it... he's laughing his\n     ass off.\n\n<b>                            PRODUCER\n</b>                  Mr. Castle, we have no idea...\n\n<b>                             KEN CASTLE\n</b>                  Shush!\n\n     ON THE SCREEN, the humanz logo dissolves, 8-bit ARCADE STYLE,\n     replaced by:\n\n<b>                  THE EVOLUTION OF MAN ACCORDING TO CASTLE\n</b>\n     Underneath is the CLASSIC ILLUSTRATION showing the\n     progression from primitive EARLY MAN to the erect MODERN\n     HUMAN. In a crude ANIMATION the progression CONTINUES:\n     MODERN MAN bends back over on his hands and knees; in the\n     final stage he's wearing a DOG COLLAR, getting fucked in the\n     ass - then fed through a MEAT GRINDER, packaged &amp; sold as\n<b>     HAMBURGER.\n</b>\n     KEN looks over at the PRODUCER.\n\n                            KEN CASTLE (cont'd)\n                  That's a God damn hoot.\n\n<b>                             PRODUCER\n</b>                      (to his techies)\n                  Bypass orbital, reroute from the\n                  backup servers, NOW, for Christ\n                  sake, you dirty apes...\n                      (to CASTLE)\n                  Sorry, Mr. Castle, we can't hard-\n                  line a live broadcast. It's\n                  impossible to stop every virus that\n                  sneaks in.\n\n\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                             19.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>27   CONTINUED: (2)                                                 27\n</b>\n<b>                         KEN CASTLE\n</b>               Uh huh. You might wanna oughta let\n               my boys take a look at your\n               firewall.\n\n     The screen CUTS TO BLACK, COLOR-BARS blink, then an\n     advertisement streams in.\n\n     KEN stands, holding GINA'S hand, kisses it.\n\n                         KEN CASTLE (cont'd)\n                   (to GINA)\n               What about your firewall, sugar -\n               wonder if I might breach it one of\n               these sunny days.\n\n     He gives her a ROGUISH WINK.\n\n<b>                         GINA PARKER SMITH\n</b>               You're bad.\n\n<b>                            BOARD OP\n</b>               He's good.\n\n     On the monitors, we transition back into a paid commercial: a\n     VICTORIA'S SECRET PORN-looking GIRL in HANDCUFFS turns to\n<b>     CAMERA.\n</b>\n<b>                         PORN GIRL\n</b>               Wanna blow off a little steam?\n\n<b>                                                        CUT TO:\n</b>\n<b>28   EXT. PRISON YARD - DAY                                         28\n</b>\n     A PRISONER - shirtless, his upper body smeared with WHITE\n     POWDER, screaming, SLAMS HIS FIST DOWN INTO FACE. Blood\n     sprays on white.\n\n     We see that he is beating down a uniformed GUARD. The GUARD\n     wears a black gas mask, shattered and pouring blood. Other\n     prisoners, shackled together, stand by watching, forming a\n     half circle around the fight. They are shirtless, covered in\n     the same white powder - they look like tribesmen.\n\n     One of the prisoners, very distinctive, nods grimly, clearly        *\n     enjoying the show.\n\n<b>                         DISTINCTIVE PRISONER                            *\n</b>               Fuck him up.\n\n     The prison yard is a vast expanse of white - it could be a\n     chalk mine, or the surface of a strange planet. Distant\n     towers mark the perimeter.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                               20.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>28   CONTINUED:                                                      28\n</b>\n     Other groups of shackled prisoners can be seen in the\n     distance, trotting along in lines. Trails of thick magenta\n     smoke snake across the yard, sucked by the wind.\n\n     The ROGUE PRISONER stomps down on the GUARD'S face one last\n     time - his shoes are made of cloth. CRUNCH. The GUARD stops\n     moving.\n\n     The PRISONER starts to run for it across the white terrain.\n\n     A group of GUARDS appear to round up the remaining prisoners.\n     They club them down with the butts of rifles but pay no mind\n     to the fleeing ROGUE... they merely watch him go, impassive.\n\n     In a moment, we see why - when the ROGUE PRISONER crosses\n     between the two distant towers he is jerked to the ground by\n     an invisible field. Sound? Light? Magnetism? His body\n     goes into spasms; blood foams from his ears, mouth, eyes.\n\n<b>                                                          CUT TO:\n</b>\n<b>29   EXT. PRISON REC AREA - DAY                                      29\n</b>\n     Fingers run through white powder, making patterns.\n\n     A black shadow crosses the frame, accompanied by a low hum;\n     some sort of aircraft.\n\n     KABLE looks up as the shadow tracks across him; we never see\n     the craft. He looks out across the yard.\n\n     KABLE is sitting in what seems to be a minimal REC AREA cut\n     out of the white terrain. He sits by himself wearing a white\n     cloth hoodie, eyes dark, head down, silent. Across the yard\n     a group of prisoners are playing basketball; EVERY SINGLE\n     PLAYER is SKYING for dunks.\n\n     We focus in on KABLE'S TATTOO: I Am Right Here With You...\n\n     In the yard a CRIPPLE, his two legs stiff with braces, walks\n     ROBOTICALLY along on crutches. KABLE watches him,\n     expressionless. It triggers a memory...\n\n<b>                                                        FLASH TO:\n</b>\n<b>30   EXT. SUN-SOAKED EXTERIOR                                        30\n</b>\n     A LITTLE GIRL, no more than two, walks along on her DADDY'S\n     feet... giggling, trusting... her hands grip his big\n     fingers... taking each big ROBOT STEP with him...\n\n<b>                                                        FLASH TO:\n</b><b>\n</b><b>                                                                21.\n</b><b>                         WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>31   EXT. PRISON YARD - DAY                                           31\n</b>\n     A BASKETBALL comes out of nowhere and KNOCKS THE CRUTCH OUT\n     from under the CRIPPLE, sending him ass-up on the asphalt.\n     Prisoners JEER.\n\n<b>                         FREEK\n</b>                   (quiet, conspiratorial)\n               Kable. Kable.\n\n     We see that KABLE has drawn the pattern in his tattoo with\n     his finger in the white powder; at the sound of the voice he\n     runs his hand through it, wiping it away.\n\n     A wiry, jittery dude of indeterminate age is sitting next to\n     KABLE. KABLE doesn't even turn to look.\n\n<b>                         KABLE\n</b>               My name is Tillman, freak.\n\n<b>                         FREEK\n</b>               Tillmans, yeah, Tillmans, I knew\n               that, they said you name's was\n               Tillmans... just sittin, always\n               sittin, always lookin, just\n               lookin... like me, I keep my holes\n               down... you got to, man... a dude\n               inevitably start to break up, start\n               to crack and break up everyday,\n               never know you gonna die today or\n               live another two, three. You never\n               do know. All these niggaz gonna\n               snap, snap, snap, one by one, every\n               last one, all of em. Yeah but not\n               you. Twenty seven battles and three\n               to go... no one ever got that close\n               before, no one even done ten games\n               without gettin they brains shot...\n               but Kable, Kable, Kable, he just\n               sittin, lookin, like he got a plan,\n               he already somewhere else, he on a\n               mission, nothin' get in his way,\n               never break, never snap, never say\n               shit, just take care of his\n               business, niggaz get spooked by\n               that shit. You spooky.\n\n     KABLE turns slowly to look him in the eye, says nothing.\n\n                           FREEK (cont'd)\n               Spooky.\n\n     KABLE looks away.\n\n\n<b>                                                          (CONTINUED)\n</b><b>\n</b><b>                                                                   22.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>31   CONTINUED:                                                          31\n</b>\n                            FREEK (cont'd)\n                  Why they put you in here, Tillmans?\n\n     KABLE waits a good long beat.\n\n<b>                            KABLE\n</b>                  I killed my best friend.\n\n<b>32   INT. PRISON - NIGHT                                                 32\n</b>\n     A prisoner sings Metallica off key, but balls to the walls:\n\n<b>                            PRISONER\n</b>                  Master!\n                  Master!\n                  Master of Puppets I'm pulling your\n                  strings - Twisting your mind and\n                  smashing your dreams...\n\n     KABLE is alone in his cell.\n\n     At the base of the single door is a SLIDING COMPARTMENT to\n     push food through - it opens. But instead of a tray, someone\n     pushes through a wrinkled photograph.\n\n     KABLE picks it up and looks - a WOMAN, just a blur of golden\n     hair, laughing, and a LITTLE GIRL... the same one in KABLE'S\n     vision.\n\n<b>                            WOMAN (O.S.)\n</b>                  You want to get back to them.\n\n     KABLE is stunned, silent. He sits on the ground, shoulder\n     leaning against the heavy door, staring at the girl in the\n     picture.\n\n                            WOMAN (O.S.) (cont'd)\n                  It's all you think about. It's the\n                  only thing that keeps you alive.\n\n     Her words are like hammer blows to his guts; he wants to weep\n     but he's too strong, too internalized. He steels himself.\n\n<b>                            KABLE\n</b>                  Who's talking?\n\n     She pushes through a white NOTECARD and PEN.\n\n<b>                               WOMAN (O.S.)\n</b>                  Sign it.\n\n<b>                               KABLE\n</b>                  What?\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                       23.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>32   CONTINUED:                                                              32\n</b>\n     KABLE doesn't take it.\n\n<b>                            WOMAN (O.S.)\n</b>                  Sign it... please, Tillman. My son\n                  David is your biggest fan. He\n                  prays for you.\n\n     This takes KABLE by surprise; he reluctantly takes the pen\n     and card. He writes something on it and sticks it back\n     through the slider.\n\n     PFFHHT. The WOMAN stabs KABLE'S hand with a LANCET - she\n     draws out a little blood.\n\n     KABLE yanks his hand back out.\n\n                            WOMAN (O.S.) (cont'd)\n                  Need to prove it's authentic.\n                  Makes it worth more.\n\n<b>                            KABLE\n</b>                  Why would anyone want my name?\n\n<b>                             WOMAN (O.S.)\n</b>                  You don't even know what's going on\n                  out there, do you?\n                      (beat)\n                  Damn...\n\n     At the far end of the solitary block a BUZZER sounds - then\n     the SLIDE and SLAM of heavy steel.\n\n                              WOMAN (O.S.) (cont'd)\n                  Gotta go.\n\n     KABLE jumps up and pulls himself against the door - a\n     lifeline is slipping away...\n\n<b>                             KABLE\n</b>                  Wait.\n                      (he holds the wrinkled\n                        photo to the window)\n                  How did you get this picture?            Have\n                  you seen them?\n\n     He peers through the little window at the top of the door,\n     but she's GONE...\n\n     Instead, a group of PRISONERS are being led down the corridor\n     to their NEW CELLS. We recognize grim, battered faces from\n     the yard - these are the men that stood by as the GUARD was\n     being beaten down.\n\n\n\n<b>                                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                    24.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>32   CONTINUED: (2)                                                       32\n</b>\n     DISTINCTIVE PRISONER - hands cuffed behind his back, makes                *\n     eye contact with KABLE as he walks by.                                    *\n\n<b>                                                        FADE TO BLACK.\n</b>\n<b>33   EXT. PRISON RUNNING TRACK - DAY                                      33\n</b>\n     A desolate white RUNNING TRACK; a guard TOWER overlooks...\n     the field is empty but for ONE MAN: KABLE.\n\n     He's busting ass around the track, pouring sweat. We're\n     right there with him, CLOSE-UP - profile, full speed... we\n     hear the HARD BREATHING, the feet pounding dirt, like we're\n<b>     INSIDE HIS HEAD.\n</b>\n<b>                                                              CUT TO:\n</b>\n<b>34   EXT. URBAN DOWNTOWN #1 - SIMULTANEOUS                                34\n</b>\n     WIDE LOCK OFF - KABLE, 90 feet high, a MURAL painted on the\n     side of a BUILDING. It's an AD for SLAYERS: KABLE in FULL\n     COMBAT MODE, cutting loose with a FLAME THROWER.\n\n<b>35   EXT. PRISON RUNNING TRACK - SIMULTANEOUS                             35\n</b>\n     KABLE, running - we're even CLOSER NOW... he's pushing\n     himself beyond exhaustion, pure focus...\n\n<b>36   EXT. URBAN DOWNTOWN #2 - DAY                                         36\n</b>\n     Different city, same story - KABLE, a towering BILLBOARD\n     PROJECTION... endless lanes of FREEWAY GRIDLOCK sprawling\n     beneath...\n\n<b>37   EXT. PRISON RUNNING TRACK - SIMULTANEOUS                             37\n</b>\n     KABLE, staggering, near collapse, lungs burning...\n\n<b>38   EXT. TIMES SQUARE - DAY                                              38\n</b>\n     The ICONIC IMAGE of KABLE on the famous TIMES SQUARE VIDEO\n     WALL, now even more massive... the STOCK TICKERS reeling off\n     disaster... he's like GODZILLA frozen amongst the\n<b>     SKYSCRAPERS...\n</b>\n<b>39   EXT. PRISON RUNNING TRACK - SIMULTANEOUS                             39\n</b>\n     KABLE finally flames out... he breaks down to a jog, then\n     doubles over, hands on his knees, gasping for breath.\n\n     CUT OUT WIDE: KABLE is ant-size and insignificant on the\n     long, barren field, under a vast grey sky... ALONE.\n\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                       25.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>39   CONTINUED:                                                              39\n</b>\n     Hold for a long beat, and...\n\n<b>                                                           FADE TO BLACK.\n</b>\n<b>40   INT. A DOZEN DARK ROOMS - DAY                                           40\n</b>\n     MONTAGE of GAMERS' FACES, preparing to GET IT ON... All\n     shapes, colors and styles, but all RICH AND POWERFUL-looking.\n     Some are sweating, some calm, some beat red, others have\n     guitar-playing twitch faces...\n\n<b>41   EXT. SLAYERS BATTLEGROUND #2 - DAY                                      41\n</b>\n     SHOCK CUT into the HEAT OF BATTLE.\n\n     CHAOS, CONFUSION... KABLE blasts through a cloud of exploding\n     debris... A BROWN to his left is BLOWN IN HALF - the LEGS\n<b>     KEEP RUNNING...\n</b>\n<b>42   EXT. SLAYER BATTLEGROUND #2 - STREET                                    42\n</b>\n     TED NUGENT, in BROWN camo, lines up a BLUE SNIPER in a 3rd\n     story window with a CROSS-BOW. He releases the arrow and\n     pins the BLUE's HEAD to the window sill.\n\n<b>                            TED NUGENT\n</b>                  Damn, I gonna have to eat you now,\n                  son.\n\n     An UPSIDE-DOWN CAR comes SLIDING down the street on it's hood\n     and slams into TED NUGENT, VAPORIZING him...\n\n<b>43   EXT SLAYER BATTLEGROUND #2                                              43\n</b>\n     Another five BLUE SOLDIERS are taken out. Their bodies drop\n     to the ground, gruesome goodness. The FIVE BALL BEARING\n     CAMERAS quickly flock together and check out each body as a\n     swarming unit. From a wider shot, they look like flies on\n     shit... after checking out the recently deleted, they zip off\n     towards the closest save point...\n\n<b>                                                                 CUT TO:          *\n</b>\n<b>     SCENE 44 DELETED                                                             *\n</b>\n<b>45   INT. FRAT HOUSE - SIMULTANEOUS                                          45\n</b>\n     FIFTY beer slamming COLLEGE STUDENTS are going BERSERK...\n     they've got SLAYERS on a wall-sized screen, pay-per-view...\n     they're high fiving, SMASHING up the place...                                *\n<b>\n</b><b>                                                                26.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>46   EXT. SLAYERS BATTLEGROUND #2 - DRAINAGE DITCH - CONTINUOUS       46\n</b>\n     KABLE LEAPS for a drainage trench, makes it, and hustles\n     around the back of a burnt out building...\n\n<b>47   INT. SLAYERS BATTLEGROUND #2 - STAIRWAY                          47\n</b>\n     Up a stairway - the GHOST FACE on GLASS superimposed on the\n     image - the face is LAUGHING, GIDDY...\n\n<b>                         VOICE\n</b>               Oh shit... oh shit...\n\n<b>48   INT. SLAYERS BATTLEGROUND #2 - 2ND FLOOR                         48\n</b>\n     KABLE takes up a spot from a second level vantage point -\n     from here we see a small group of BLUES moving down the\n     block, scanning for survivors.\n\n<b>                         VOICE\n</b>               Wul hello thar...\n\n     KABLE watches himself SWITCH TURRETS on his WEAPON.   He\n     brings up a SNIPER SIGHT and locks in on a target.\n\n                         VOICE (cont'd)\n               Wait for it...\n\n     CLOSE-UP of KABLE'S EAR: just then he hears the SUBTLEST OF\n     SOUNDS creeping up behind. Whoever's controlling him doesn't\n     seem to have noticed - he's too focused on the enemies in the\n     sights.\n\n     We can see the tension in KABLE'S FACE - he's helpless,\n     trying to fight it, willing his player to take notice.\n\n<b>                         KABLE\n</b>                   (whispering)\n               Turn me around God damn it...\n\n<b>                         VOICE\n</b>               What'd he say?\n\n     A trickle of sweat runs down into KABLE'S EYE. The SOUND is\n     more distinct now, CLOSER... he's practically shaking from\n     the struggle to overcome the control.\n\n     POV: someone has reached the top of the stairs... KABLE, seen\n     from behind, comes into view crouched by the blown out\n     window.\n\n                          VOICE (cont'd)\n               My boy gotta take a piss or\n               something?\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                       27.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>48   CONTINUED:                                                              48\n</b>\n     FINALLY: SNAP ZOOM on a reflection in a shard of HANGING\n     WINDOW GLASS - the outline of a BLUE, raising his gun...\n\n                            VOICE (cont'd)\n                  D'oh.\n\n     KABLE SPINS - FAST. The TURRET is ALREADY REVOLVING when he\n     squeezes the trigger...\n\n     The ARMOR-PIERCING SHELL takes SNEAKY BLUE by surprise,\n     blowing him out the back of the building...\n\n     The BLUES in the street take notice. It's a matter of\n     seconds...\n\n     KABLE makes a run for it as the floor starts to DISINTEGRATE\n     behind him in a shitstorm of bullets. SHRAPNEL drills his\n     back, absorbed by the BODY ARMOR.\n\n<b>49   EXT. SLAYERS BATTLEGROUND #2                                            49\n</b>\n     He hits daylight and turns a corner in time to see a group of                *\n     BROWNS scattering... a live ARTILLERY SHELL skitters across                  *\n     the pavement, belching smoke.                                                *\n\n<b>     BOOM.\n</b>\n     KABLE is running... he looks to his right - A FROZEN MOMENT:\n\n     The SAVE POINT up ahead on the SPINNING RAILROAD.                            *\n\n     The MOMENT passes; KABLE looks back over his shoulder - a\n     rush of ROARING FLAME is COMING - FAST... at the moment of\n     IMPACT we -                                                                  *\n\n<b>                                                           SMASH TO BLACK\n</b>\n<b>50   INT. THE TRAIN - TIME INDETERMINATE                                     50\n</b>\n     SOLDIERS are charred, bleeding, wasted.\n\n     A BROWN is sobbing uncontrollably.\n\n<b>                            BROWN SOLDIER\n</b>                  Who are they... who the fuck are\n                  they... who's playing us?\n\n     KABLE watches him, wondering the same damn thing.\n\n<b>51   INT. SIMON'S HOUSE - DAY                                                51\n</b>\n<b>     MONTAGE, CLOSE UP:\n</b>\n     Two fat slices of WHOLE GRAIN BREAD, check.\n\n<b>                                                                 (CONTINUED)\n</b><b>\n</b><b>                                                                28.\n</b><b>                         WHITE KABLE SCRIPT - 9/19/2007\n</b><b>51   CONTINUED:                                                       51\n</b>\n     Big sloppy spoonfuls of lumpy green ORGANIC PISTACHIO BUTTER,\n     spread on SLICE A, check.\n\n     Welch's PURPLE GRAPE JELLY spread on SLICE B, check.\n\n     Combine; CONSUME.\n\n<b>52   INT. SIMON'S HOUSE - HALLWAY                                     52\n</b>\n     SIMON - 18, pale and lanky, unkempt shaggy hair; wearing a\n     vintage Guns `n' Roses T-shirt from the Appetite For\n     Destruction Tour - walks down a long, high ceilinged crystal\n     hall with marble floors, macking on the sandwich... passes\n     through a glass tunnel running through the interior of a\n     massive, exotic aquarium - he's alone in what appears to be a\n     vast, cold mansion.\n\n<b>53   INT. SIMON'S ROOM - CONTINUOUS                                   53\n</b>\n     SIMON'S ROOM is simple - FOUR WALLS and a CEILING, each one a\n     3-D, corner-to-corner VIDEO SCREEN. The HD level of the\n     screens is virtually ABSOLUTE - the flesh and blood SIMON\n     himself is just another element in a HIGH-DOLLAR/HIGH-TECH\n<b>     SPACE.\n</b>\n     The FLOOR is ALL BED. SIMON PADS IN, takes a spinning STUNT\n     JUMP and ROLLS onto his back in a big ass pile of pillows,\n     sandwich intact.\n\n     The SCREENS are a jumble of floating frames, competing for\n     prominence in the 3-D space... muted VID CHATS, STOCK\n     TICKERS, SPORTS SCORES, ultraviolent SLAYERS playback, etc.\n     Everything dynamic, everything moving.\n\n     One whole wall is apparently a REAL TIME monitor of the\n     SLAYERS BATTLEGROUND, with updated statistics... POINTS\n     LEADER, FRAG COUNT - we notice that KABLE leads these\n     categories; a video loop of KABLE in action beside his name\n     illustrates the point.\n\n     In the FOREFRONT of SIMON'S attention:\n\n<b>                    KABLE EARNS 800 UPGRADE POINTS\n</b>\n     A set of dynamic frames allow him to scroll through a series\n     of revolving images - WEAPONS, EQUIPMENT, BODY ARMOR.\n\n     SIMON interacts with the 3-D environment using HAND GESTURES -\n     he can SLIDE, SQUEEZE, PULL AND SCROLL the images just by\n     moving his fingers in the air.\n\n     He flips past various TRANSFORMERS-looking SUPER GUNS...\n\n\n\n<b>                                                          (CONTINUED)\n</b><b>\n</b><b>                                                                  29.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>53   CONTINUED:                                                         53\n</b>\n<b>                            SIMON\n</b>                  Gay... gay... gay... super gay...\n                  hm.\n\n     He stops on an animated graphic. A SEXY FEMALE VOICE breaks\n     it all down for us:\n\n<b>                            FEMALE VOICE\n</b>                  Swarmers. The latest innovation\n                  from Browning, this self detonating\n                  cartridge offers the widest and\n                  deadliest spray available from a\n                  full tracking, cornering ordnance.\n\n     A VIDEO DEMO shows the fired cartridge SPLIT into two-dozen\n     smaller shells that FLASH OUT like a swarm of bees, wind\n     around a corner and utterly SHRED a TEST DUMMY.\n\n<b>                            SIMON\n</b>                  Daddy like...\n\n     An ANNOYING GIRL'S VOICE pops in, along with a VID CHAT\n     SCREEN that takes over the MAIN WALL. She looks about 16 -\n     skinny, skanky, kind of hot.\n\n<b>                              ANNOYING GIRL\n</b>                  Simon!\n\n<b>                            SIMON\n</b>                  Fan-girl, stop hacking. If I want\n                  you unmuted I'll unmute you.\n\n<b>                            ANNOYING GIRL\n</b>                  You suck, Simon - you're going to\n                  get my boyfriend killed before he\n                  can get out of jail and fill me up\n                  with his hot seed.\n\n<b>                              SIMON\n</b>                  Uh huh.\n\n     Another GIRL - 17, cute, stoned - chimes in.\n\n<b>                            CUTE STONED GIRL\n</b>                  Simon, I just wanna play you.\n                  Forget about that star-fucker.\n\n<b>                            ANNOYING GIRL\n</b>                  Shut up bitch.\n\n     SIMON casually waves his hand at the frame, like flicking at\n     a fly; ANNOYING GIRL is wiped away, bringing CUTE STONED GIRL\n     to the forefront.\n\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                  30.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>53   CONTINUED: (2)                                                     53\n</b>\n<b>                         CUTE STONED GIRL\n</b>               Thanks baby. When can I meet you\n               for like reals?\n\n     SIMON notices a metallic sparkle from the GIRL'S TONGUE.\n\n<b>                         SIMON\n</b>               What is that?\n                   (like a dentist)\n               Aaaa.\n\n     He reaches out and \"pinches\" the screen, ZOOMING IN close as\n     she sticks out her tongue - it fills the wall... a dozen\n     wicked looking BLACK TONGUE RINGS stud the wet pink flesh,\n<b>     TEN FEET HIGH.\n</b>\n                            SIMON (cont'd)\n               Woah.\n\n     He quickly unsqueezes, zooming back out. The GIRL'S eyes are\n     rolled back in her head, euphoric; she's WASTED.\n\n<b>                         CUTE STONED GIRL\n</b>               You like me?\n\n     A THIRD GIRL pops in, filling the opposite wall.\n\n<b>                         SHELLY\n</b>               What's up, loser?\n\n<b>                            SIMON\n</b>               Hey sissy.\n\n     This is SIMON'S SISTER, SHELLY, 14.       Frosted up lips, eyes\n     and hair like a Tokyo hooker.\n\n<b>                         SHELLY\n</b>               Mom says - let me see, go to\n               college, move the fuck out, and...\n               oh yeah, you're a sick retard,\n               you're pathetic, and you smell like\n               Jeffrey Dahmer.\n\n<b>                         SIMON\n</b>               Wanna make out?\n\n<b>                         SHELLY\n</b>               You wish. I can't wait til they\n               cut you off, Simian.\n\n     With a wave of his hand he wipes her image off the screen.\n\n     TWO MORE video chats pop up - TWIN 21-YEAR OLD GIRLS,\n     stupidly hot.\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                 31.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>53   CONTINUED: (3)                                                    53\n</b>\n<b>                          TWINS\n</b>               Simon?\n\n<b>                          SIMON\n</b>               Maybe.\n\n<b>                         TWINS\n</b>                   (star struck)\n               Oh my god, it's really you!!!\n\n     Suddenly all of SIMON's screens are filled with the TWINS.\n\n<b>                          SIMON\n</b>               Nice.\n\n<b>                         TWINS\n</b>                   (in unison)\n               Do you wanna see our tits, Simon?\n\n<b>                         SIMON\n</b>                   (shrugs)\n               Uh, sure.\n\n     They lift their shirts, GIRLS GONE WILD style.      Perfect perky\n     C's with silver-dollar nipples.\n\n<b>                         TWIN 1\n</b>               Mmmmm, now that we have your\n               attention, here's another offer you\n               can't refuse.\n\n<b>                         SIMON\n</b>               Here we go.\n\n     When TWIN 2 speaks, it is with a MAN'S VOICE. The accent is\n<b>     EASTERN EUROPEAN.\n</b>\n<b>                         TWIN 2\n</b>               Fifty million euros for control of\n               Kable, instant transfer to the\n               account of your choice.\n\n<b>                         SIMON\n</b>               Question: do I look like I need the\n               money? We've discussed this before\n               - Kable is not for sale.\n\n<b>                         TWIN 1\n</b>                   (feeling herself up)\n               Baby... make it a hundred.\n\n<b>                         SIMON\n</b>               It's been real.\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                32.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>53   CONTINUED: (4)                                                   53\n</b>\n     SIMON snaps his fingers; all the windows close\n     simultaneously.\n\n     SIMON makes a clicking sound with his tongue in the new\n     silence. Peace at last.\n\n     BY THEMSELVES, the screens come BACK TO LIFE.\n\n                            SIMON (cont'd)\n               D'oh.\n\n     The instant chat boxes are gone, replaced by a soundless,\n     GRAINY VIDEO LOOP - there is something sinister about the lo-\n     fi image... it looks like the feed from an old SURVEILLANCE\n<b>     CAM:\n</b>\n     Two men are sitting in a room... it's silent, but one of them\n     seems to be SCREAMING - he lifts a gun...\n\n                         SIMON (cont'd)\n               What the fuh...?\n\n     ... waits a beat... and SHOOTS THE OTHER MAN IN THE HEAD.\n     Black blood pools. This is REAL. The loop repeats.\n\n     When the SHOOTER turns his face toward the camera, SIMON\n     freezes the frame with a gesture and ZOOMS IN.\n\n     It's KABLE.\n\n     A MESSAGE is typed across the screen one letter at a time -\n     we may recognize the retro chicago font from the HUMANZ video\n     prank earlier:\n\n                            want to talk to him?\n\n     Then, blinking, lo-fi in the lower right corner of the wall:\n\n                             WALKIETALKIE.exe\n                            SIMON (cont'd)\n               Um.\n\n<b>                                                           CUT TO:\n</b>\n<b>54   EXT. SOCIETY - DAY                                               54\n</b>\n     MUSIC: Bloodhound Gang, The Bad Touch:\n\n     Ha-ha, well now, we call this the act of mating\n     But there are several other very important differences\n     Between human beings and animals\n     That you should know about...\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                33.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>54   CONTINUED:                                                       54\n</b>\n     You and me baby ain't nothin' but mammals\n     So let's do it like they do on the Discovery Channel...\n\n     PAVEMENT flies by... sun SLAMS rainbow flares into the\n     lens... ROLLER SKATES break frame, outpacing us...\n\n     We're cruising along with a group of YOUNG, BEAUTIFUL PEOPLE,\n     skating like ROBOTS through a CITY PARK... Roller-Dolly\n     follows HOT GIRLS in DAISY DUKES, knee socks and tube tops,\n     belly rings and tatoos in the small of their backs...\n     ATHLETIC DUDES, shirtless, gun racks and six packs...\n\n     They SWING THEIR ARMS mechanically, identically... synced\n     with each other and the beat of the soundtrack... each face\n     plastered with an absurd, exaggerated GRIN... let's FUCKING\n<b>     PARTY!!!\n</b>\n     We are in a super-saturated world... NOT virtual/animated,\n     but absolutely real - yet the color and immediacy of it is\n     heightened, off-kilter.\n\n     On the GRASS, a gang of TOKYO POP PUNK ROCKERS are having a\n     WATER BATTLE, blasting and soaking each other with big\n     plastic WATER CANNONS like something out of SLAYERS...\n\n     A REDHEAD, soaking wet, is FEELING UP HER OWN BREASTS,\n     totally OBLIVIOUS to her surroundings... One of the SKATERS,\n     out of control, PLOWS RIGHT INTO HER at full speed... The\n     SKATER takes a ride on concrete, grinding flesh off her bare\n     legs... she wobbles to her feet, EYES STREAMING TEARS but\n     STILL GRINNING ecstatically...\n\n     A guy in a PRIEST OUTFIT holding brightly colored helium\n     balloons looks on impassively; then spots something of\n     interest and breaks off SPRINTING FULL SPEED...\n\n     People are DANCING - the corniest moves ever... MAKING OUT on\n     the ground... and in the middle of it all...\n\n<b>55   EXT. SOCIETY                                                     55\n</b>\n     CLOSE-UP: a SPARROW is pecking at a hunk of orange and yellow\n<b>     CANDY CORN.\n</b>\n     POP OUT WIDE to reveal that the BIRD is EATING OUT OF A\n<b>     GIRL'S HAND...\n</b>\n     This is ANGIE: 25, BLONDE/black roots... micro mini skirt,\n     fishnets, boots... green-eyes, haunted, with sadness behind\n     them; pretty - the clothes don't quite match her; it's like\n     someone dressed her up as a hooker.... She doesn't seem to\n     notice the little bird munching away; she stands in the\n     middle of the PARK, looking around, lost.\n\n\n<b>                                                         (CONTINUED)\n</b><b>\n</b><b>                                                                34.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>55   CONTINUED:                                                       55\n</b>\n     She spots a GUY standing by himself near a giant sculpture.\n     She walks over to him; the BIRD flutters away.\n\n     The GUY is young and attractive, dressed in casual business\n     attire. He is wearing a PLASTIC PIG SNOUT on his face, tied\n     with an elastic band.\n\n<b>                            GUY\n</b>                  Hey.\n\n     He smiles like a Driver's License photo.\n\n<b>                                                           CUT TO:\n</b>\n<b>56   INT. GORGE'S LIVING ROOM - CONTINUOUS                            56\n</b>\n     CLOSE-UP of LIPS, profile - by the looks of it, an OVERWEIGHT\n     MALE... sweat, stubble. The ROOM is DARK - lit by the\n     AMBIENT GLOW of a VIDEO SCREEN.\n\n<b>                            GORGE\n</b>                  Hi.\n\n<b>57   EXT. SOCIETY - DAY                                               57\n</b>\n     ANGIE echoes, practically overlapping.\n\n<b>                            ANGIE\n</b>                  Hi.\n\n     We will continue to CUT between the two locations.\n\n<b>                            GUY\n</b>                  So what's your damage?\n\n     He WINKS.\n\n     ANGIE strikes an exaggeratedly DEMURE, FLIRTATIOUS POSE -\n     then immediately snaps back to NEUTRALITY.\n\n<b>                             GORGE/ANGIE\n</b>                  You know, just hanging out.\n                      (beat)\n                  Looking to meet people.\n\n<b>                            GUY\n</b>                  Lucky you...\n\n<b>                                                           CUT TO:\n</b><b>\n</b><b>                                                                35.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>58   INT. DALE'S PLACE - CONTINUOUS                                   58\n</b>\n     A CLOSE-UP of LIPS to match GORGE'S, but facing the OPPOSITE\n     DIRECTION. An extremely butch, masculine FEMALE; trace of a\n     mustache.\n\n<b>                         DALE\n</b>               You met me.\n\n<b>59   EXT. SOCIETY - DAY                                               59\n</b>\n<b>                         GUY\n</b>                   (echoing)\n               You met me.\n\n     ANGIE laughs, a beat LATE. Across the street a WOMAN has\n     hiked up her skirt, squatted down and is TAKING A PEE on the\n     sidewalk.\n\n<b>                            GORGE/ANGIE\n</b>               I'm Nika.\n\n<b>                         DALE/GUY\n</b>               I'm Dale.\n                   (looks her up and down)\n               I like your fur.\n\n<b>                         GORGE/ANGIE\n</b>               Do you want to go somewhere?\n\n     She strikes the same FLIRTY POSE for the second time.\n\n<b>                         DALE/GUY\n</b>               We are somewhere.\n\n     He WINKS; reaches out and puts a hand on her WAIST. They\n     start to make out like TEENAGERS at the PROM. DALE/GUY LIFTS\n     UP HER SKIRT with one hand and SQUEEZES A BOOB with the\n     other.\n\n     He turns her around and presses ANGIE'S back up against the\n     base of the sculpture, ROUGH, hands all over her/inside her;\n     SLOBBERING down her neck and shoulders...\n\n     ANGIE just looks straight ahead... her EYES move to a nearby\n     building - the side is an ANIMATED BILLBOARD that has\n     switched to a promo for SLAYERS, with KABLE featured\n     prominently.\n\n     She watches KABLE'S face move... she lets out an involuntary\n     MOAN that is more like a whimper...\n\n                         DALE/GUY (cont'd)\n               Thanks for vagina.\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                36.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>59   CONTINUED:                                                       59\n</b>\n<b>     A SLAM OF AUDIO WITH THE SHOCK IMAGE OF A BLOODY, DEMONIC\n</b><b>     FACE -\n</b>\n     (recreating an internet-style video SHOCK PRANK)\n\n     ... the SCREEN GOES DEAD -\n\n     ... and another BLUE SCREEN OF DEATH, another MESSAGE:\n                            SOCIETY is RAPE\n                             SLAYERS is MuRder\n                                   - humanz\n\n<b>60   INT. GORGE'S LIVING ROOM - CONTINUOUS                            60\n</b>\n     We get our first wider view of the room. Much more cramped\n     than SIMON'S ROOM... like SIMON'S, the room is dominated by a\n     GIANT VIDEO SCREEN, but just the front wall... there are\n     other - smaller, paper thin - screens mounted in various\n     spots and leaning against walls; GARBAGE and TECH GEAR all\n     over the floor.\n\n     GORGE - late 30s, MORBIDLY OBESE - is contained by a massive\n     automated rolling chair, like the Escalade of Rascals.\n\n     The HUMANZ message has taken over his screen and he's GOING\n     FUCKING BALLISTIC, throwing shit at it and gesturing crazily\n     to the wall-mounted MOTION SENSORS with his hands, trying to\n     get the image back. It's NOT HAPPENING.\n\n<b>                            FEMALE NEWS HOST (V.O.)\n</b>                  ... a new video prank by the\n                  subversive group humanz caused a\n                  nationwide stir today...\n\n<b>61   INT. CASTLE'S STATIONARY BIKE ROOM - CONTINUOUS                  61\n</b>\n     The TV REPORT continues on screen, where a NEWS HOST is\n     backed by a graphic showing the \"society is rape\" screen with\n     footage of exaggeratedly CONFUSED, FRUSTRATED PLAYERS -\n     they're like the actors in INFOMERCIALS who can't manage to\n     peel a potato without losing their shit.\n\n<b>                            FEMALE NEWS HOST\n</b>                  All contact between Society City\n                  and an estimated quarter of a\n                  million players was shut down for\n                  over three hours while Castle techs\n                  worked to remove what they\n                  described as a \"Satellite\n                  Infection\"...\n\n     A TREE LINED, SUN DAPPLED MOUNTAINSIDE whisks by as feet work\n     the pedals of a MOUNTAIN-BIKE; we're moving around 20 mph.\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                       37.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>61   CONTINUED:                                                              61\n</b>\n<b>     SOUND: SLUUURRRRRRRP.\n</b>\n     CASTLE is cruising downhill in a 360 degree THREE-DIMENSIONAL\n     ENVIRONMENT that looks ABSOLUTELY REAL - except that he is on\n     a STATIONARY BIKE, and the NEWS REPORT is floating in the air\n     as a 3D WINDOW. He is wearing skintight Tour de France-style\n     gear and SLURPING A SMOOTHIE, one hand on the handlebar, the\n     other holding the cup.\n\n                            FEMALE   NEWS HOST (cont'd)\n                  Experts estimate   that the service\n                  interruption may   end up costing K-\n                  Soft billions in   lost revenue.\n\n<b>                            NEWS CO-HOST\n</b>                  Don't cry for Castle, he can cover\n                  that with the change under his\n                  couch cushions...\n\n<b>                            FEMALE NEWS HOST\n</b>                  On a personal note - that shit was\n                  fucking freaky.\n\n<b>                            NEWS CO-HOST\n</b>                  Oh - I literally pissed myself.\n\n<b>                            FEMALE NEWS HOST\n</b>                  Sounds like fun.\n\n<b>                            NEWS CO-HOST\n</b>                  Serious, these humanz cocksuckers\n                  are getting out of control, and\n                  someone should do something.\n\n<b>                            FEMALE NEWS HOST\n</b>                  Moving on to international\n                  headlines...\n\n     CASTLE closes the WINDOW in his FIST.\n\n<b>     SLUUURRRRRRP.\n</b>\n<b>                                                           FADE TO BLACK.\n</b>\n<b>62   INT. PRISON, WEIGHT ROOM - NIGHT                                        62\n</b>\n     The SCREAM would be comical if it weren't so HORRIFIC.\n\n     With a dozen CONS looking on: an ASIAN PRISONER is on his\n     knees, FINGERS DEEP into the back of his own skull.\n\n<b>                            ASIAN PRISONER\n</b><b>                  GET IT OUT OF ME...!\n</b>\n\n<b>                                                                 (CONTINUED)\n</b><b>\n</b><b>                                                                  38.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>62   CONTINUED:                                                         62\n</b>\n     He rips into his BRAIN STEM with a tiny piece of busted\n     RAZOR, hoping to pull out a chip, a wire, anything. He pulls\n     out something, and drops like a sack of potatoes to the floor\n     - FRIED POTATOES. He lands on a couple of dumbbells, his\n     head smashing into the weight bench, spinal cord SEVERED.\n\n     KABLE looks on, impassive, emotion internalized.       GUARDS push\n     through.\n\n<b>                            GUARD\n</b>                  What the hell happened to this one?\n\n     An old black dude - LIFER - answers.\n\n<b>                            LIFER\n</b>                  Look like he escaped.\n\n     The GUARDS roll their eyes; drag away the body.\n\n<b>                            GUARD\n</b>                  Back to your Jazzercise, girls...\n\n     Across the room KABLE notices a NEW GUY - a mean-looking\n     sunofabitch... in fact, if murder were personified it would\n     look exactly like HACKMAN.\n\n     HACKMAN stares straight at KABLE. There is something in his\n     ghost of a smile that says he'd be more than happy to\n     eviscerate you... it's off-putting to say the least.\n\n<b>                              KABLE\n</b>                  Freak.\n\n     FREEK is there.\n\n<b>                              FREEK\n</b>                  Tillmans.\n\n<b>                            KABLE\n</b>                  Who the hell is that?\n\n<b>                            FREEK\n</b>                  New dude, new dude... that's\n                  Hackman. They say he killed a whole\n                  mess of people, all kind of\n                  people... one day he just walk up\n                  and turn himself in, like he wanna\n                  be inside or some shit... never\n                  gonna run out of slayers long as\n                  they got that kind of motherfucka\n                  run around kill a mess of people...\n\n\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                             39.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>62   CONTINUED: (2)                                                62\n</b>\n     Now HACKMAN is looking at KABLE dead blank. A GUARD comes up\n     behind HACKMAN and SHOVES HIM. HACKMAN turns; the GUARD\n     gestures him to follow.\n\n<b>                            HISPANIC GUARD (O.C.)\n</b>               Hey Kable.\n\n     KABLE turns to look.\n\n                         HISPANIC GUARD (cont'd)\n               Let's go. Upgrades.\n\n<b>                                                        CUT TO:\n</b>\n<b>63   EXT. PRISON, TRAINING RANGE    - NIGHT                        63\n</b>\n     KABLE and the GUARD are ANT-SIZED in what looks like a\n     massive driving range. VIRTUAL TARGETS are holographically\n     projected in mid-air at various heights and distances. Other\n     PRISONERS are there too, a ways off; well out of earshot.\n\n     KABLE looks over a Swarmer cartridge, slams it into his\n     weapon; switches turrets, takes a bead on a VIRTUAL TARGET...\n\n     We see him intentionally PAN THE SIGHT OFF to the left of\n     target; he pulls the trigger - CLICK. The TARGET - and\n     several others close by - turns RED, BLINKS - a HIT. This\n     thing doesn't just take out individuals; it takes out\n<b>     VICINITIES.\n</b>\n<b>                            HISPANIC GUARD\n</b>               Who aims?\n\n<b>                         KABLE\n</b>                   (caught off guard)\n               What?\n\n<b>                         HISPANIC GUARD\n</b>               Who aims... the slayer? Or the\n               player?\n\n     KABLE narrows his eyes, focuses across the field, where other\n     PRISONERS are being briefed and UPGRADED... he spots HACKMAN.\n\n<b>                         KABLE\n</b>               Not much to aiming... it's just\n               hand/eye coordination. I'm the\n               hand... someone, somewhere else is\n               the eye.\n\n<b>                         HISPANIC GUARD\n</b>               That's tripped.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                40.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>63   CONTINUED:                                                       63\n</b>\n     KABLE glances at the GUARD... he struggles - part of him\n     feels like he's talking too much; but he can't help being\n     grateful for the human interaction.\n\n<b>                             KABLE\n</b>                  Sometimes... they take over - you\n                  know, completely. They move you.\n                  Like a robot.\n                      (beat)\n                  But it doesn't work so good... that\n                  part's just for show. You can't\n                  really fight that way.\n\n<b>                            HISPANIC GUARD\n</b>                  Why?\n\n<b>                            KABLE\n</b>                  There's a delay...\n\n<b>                            HISPANIC GUARD\n</b>                  Yeah, the ping... they talk about\n                  that. The time it takes the slayer\n                  to respond to the command... it's\n                  like, five millisecond ping, eight\n                  millisecond ping...\n\n     KABLE gets a bead for a headshot on HACKMAN.\n\n<b>                            KABLE\n</b>                  Whatever you call it. A slice of a\n                  second is the difference between\n                  living and dying out there. When\n                  the trigger pulls -\n\n     He pulls the trigger: a meaty CLICK.\n\n                            KABLE (cont'd)\n                  It's just me.\n\n<b>64   INT. PRISON LOCKER ROOM, NIGHT                                   64\n</b>\n     KABLE is ALONE, toweling off - privilege of being a TOP\n<b>     SLAYER.\n</b>\n     We see now   the DAMAGE his body has taken - he is covered in\n     dark, ugly   BRUISES from BULLET HITS the body armor has\n     absorbed -   including a flinch-inducing cluster of BLACK, BLUE\n     AND YELLOW   from the most recent session.\n\n     From down the row of lockers, a WHISPER:\n\n<b>                            HACKMAN\n</b>                  Hey. Kable.\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                41.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>64   CONTINUED:                                                       64\n</b>\n     KABLE turns to look. HACKMAN'S head is POKED OUT sideways\n     from around the corner; he's maybe 20 feet away.\n\n<b>                            KABLE\n</b>                  Not interested.\n\n<b>                            HACKMAN\n</b>                  No. Wait. Look.\n\n     He brings his HANDS out where KABLE can see them - they are\n<b>     SLICK WITH FRESH BLOOD.\n</b>\n                            HACKMAN (CONT'D) (cont'd)\n                  I just deleted someone.\n\n     HACKMAN is almost GIGGLING, high on it.\n\n                            HACKMAN (CONT'D) (cont'd)\n                  This is the blood. Look.\n\n     HACKMAN rubs his SLIPPERY HANDS together, relishing it; he\n     nods his head toward the area behind the lockers... to call\n     the situation CREEPY would be a serious understatement.\n\n                            HACKMAN (cont'd)\n                  He's back here. Want to see?\n\n<b>                            KABLE\n</b>                  Your head ain't on straight.\n\n     HACKMAN cracks his neck. Maybe not. KABLE pulls on his\n     PRISON GREYS quickly, refusing to make EYE CONTACT.\n\n<b>                            HACKMAN\n</b>                  I'm going to delete you too. On\n                  Sunday.\n\n<b>                            KABLE\n</b>                  Yeah, probably.\n\n<b>                            HACKMAN\n</b>                  That's why they put me here.\n\n     KABLE'S eyes narrow - What?\n\n     HACKMAN disappears; he starts to move along an ADJACENT ROW\n     OF LOCKERS, slamming the doors - SINGING fucking PINOCCHIO:\n\n                            HACKMAN (cont'd)\n                  I've got no strings... So I have\n                  fun... I'm not tied up to anyone...\n                  They've got strings\n                  But you can see\n                  There are no strings on me...\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                     42.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>64   CONTINUED: (2)                                                        64\n</b>\n     KABLE tenses up, ready for INSTANT VIOLENCE.\n\n                          HACKMAN (cont'd)\n                You got two whores, Kable...\n\n     If he didn't have KABLE'S attention before, THIS GOT IT.\n\n<b>                          KABLE\n</b>                - the fuck did you say?\n\n<b>                          HACKMAN\n</b>                On the outside... oh, I'm sorry - I\n                meant your pretty girls... You want\n                to get back to them but I'm going\n                to visit them first...\n\n     KABLE is instantly ALL BUSINESS - he's going to make HACKMAN\n     disappear RIGHT THE FUCK NOW...\n\n     He JAMS around the corner but HACKMAN is NOWHERE TO BE\n     SEEN... past another row of lockers - NOTHING... another...\n     another... WHERE THE HELL IS HE?\n\n<b>     NOWHERE.\n</b>\n     KABLE SLAMS a FIST into a locker, BUSTING it off it's hinges.\n\n<b>                                                         TRANSITION TO:\n</b>\n<b>65   INT. CASTLE ESTATE - TIME INDETERMINATE                               65\n</b>\n     The CAMERA ANGLE on HACKMAN begins to switch perspectives and\n     spin around, as though someone is manipulating it in three\n     dimensions.\n\n<b>                          CASTLE\n</b>                He's so perfect.\n\n     Snap out to reveal CASTLE in a dark lounge; the walls and\n     ceiling are pure black, making it impossible to tell the\n     dimensions of the room. Minimalist, expensive looking\n     furniture is scattered around. THERE'S NO ONE ELSE IN THE\n<b>     ROOM.\n</b>\n     CASTLE is standing, bare feet on white shag carpet. He is\n     manipulating the image of HACKMAN in the air by pulling,\n     squeezing, twisting with his hands - the interface is similar\n     to the one in SIMON'S room.\n\n     CASTLE is as pumped as a kid on Christmas morning. Then, from\n     behind him:\n\n<b>                          CASTLE 2\n</b>                He's scary.\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                  43.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>65   CONTINUED:                                                         65\n</b>\n     We see that a perfect double of CASTLE himself has appeared\n     in the room behind him.\n\n<b>                              CASTLE\n</b>                  Yeah...\n\n     He changes the angle on HACKMAN'S mug to give a better view -\n     then turns to face his DOUBLE...\n\n                             CASTLE (cont'd)\n                      (proudly)\n                  The new face of Slayers. Pure\n                  crystallized horror, two stories\n                  tall and covered in bloody red...\n                      (beat)\n                  He's so what they want.\n\n<b>                            CASTLE 2\n</b>                      (playing dumb)\n                  But they love Kable.\n\n     Another CASTLE appears to CASTLE'S left.\n\n<b>                            CASTLE 3\n</b>                  He's right.\n\n     CASTLE faces them.\n\n<b>                            CASTLE\n</b>                      (unaffected)\n                  They do now. But when my boy kills\n                  their hero right there in front of\n                  their eyeballs, so vivid it's like\n                  you can reach out and feel the wet\n                  flesh - Trust me, they'll change\n                  their point of view.\n\n<b>                            CASTLE 2\n</b>                  How can you be sure?\n\n<b>                            CASTLE\n</b>                  It's human nature. They'll be\n                  seduced by the power, the\n                  violence... the dominance...\n\n<b>                            CASTLE 3\n</b>                      (shaking his head)\n                  Guess we never figured on Kable\n                  blowing up as big as he did.\n\n\n\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                  44.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>65   CONTINUED: (2)                                                     65\n</b>\n<b>                         CASTLE\n</b>               Bigger than the game? No. Then\n               again, who ever would've imagined a\n               player could last over a dozen\n               sessions with the same I-con...\n\n<b>                         CASTLE 2\n</b>               Tillman is a perfect soldier, a\n               tactical killing computer - you\n               dropped him in with common\n               murderers. What did you expect?\n\n<b>                         CASTLE 3\n</b>                   (musing)\n               His instincts give him an edge.\n\n<b>                         CASTLE 2\n</b>               And in the hands of a talented\n               player...\n\n<b>                         CASTLE 3\n</b>               Of course we can never let him out.\n               Not after what we did to him.\n\n<b>                         CASTLE 2\n</b>               Tell me again why we don't just get\n               rid of the problem...\n                   (makes a throat slashing\n                    motion)\n               You know, off camera?\n\n     CASTLE pokes a finger at CASTLE 2.\n\n<b>                         CASTLE\n</b>               YOU - lack a flair for marketing.\n               The people would never accept that.\n               They need to SEE their gladiators\n               brought down.\n\n<b>                         CASTLE 3\n</b>               One thing I know is what makes\n               people tick.\n\n     Suddenly the room has gone dead silent. We swing the camera\n     around to reveal that CASTLE 3 is all alone in the room. He\n     stares into the void, calm and utterly in control.\n\n     The CAMERA moves past his head into PURE BLACK...\n\n<b>                                                        DISSOLVE TO:\n</b><b>\n</b><b>                                                                      45.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>66   INT. TUNNEL #2 - DAY                                                   66\n</b>\n     The black of the underground tunnel... the TUNNEL LIGHTS\n     streak past like vanishing stars... TRAIN TRACKS blur by...\n\n<b>67   INT. TUNNEL #2 - DAY                                                   67\n</b>\n     KABLE is SPRINTING down the TUNNEL towards DAYLIGHT.          The\n     VOICE comes from the rear surrounds:\n\n<b>                         VOICE (O.S.)\n</b>               Kable, dude. It's me.\n\n     KABLE shakes his head, thinking he's HEARING THINGS.\n\n<b>                            KABLE\n</b>               Who?\n\n<b>                          SIMON (O.S.)\n</b>               Simon.\n                   (beat)\n               I'm playing you, dummy.\n\n     KABLE knifes through the tunnel EXIT...\n\n<b>68   EXT. SPAWN POINT #3 - CONTINUOUS                                       68\n</b>\n     We are in the OVER-THE-SHOULDER POV of the FLY CAM as KABLE\n     breaks daylight and slides down the hillside... superimposed\n     over the IMAGE: SIMON'S REFLECTED FACE... the CAMERA pans,\n     centers and FOCUSES IN on the REFLECTION...\n\n     SNIPER BULLETS whistle by; KABLE DUCKS, ROLLS... the CAMERA\n<b>     PULLS BACK... OUT OF THE SCREEN...\n</b>\n<b>69   INT. SIMON'S ROOM - CONTINUOUS                                         69\n</b>\n     ... past the flesh and blood SIMON into an OVER-THE-SHOULDER -\n     SIMON controlling KABLE, PLAYING HIM - as...\n\n     KABLE LANDS in the ROCKSTAR POSE. SIMON mirrors him in front\n     of the GIANT SCREEN - whatever SIMON does, KABLE echoes.\n\n<b>70   EXT. BATTLEGROUND #3/COVER - CONTINUOUS                                70\n</b>\n     KABLE makes it to cover, HEART SLAMMING.           We hear the distant\n     THUMPS of MORTARS LAUNCHING.\n\n<b>                         KABLE\n</b>               How come I can hear you?\n\n<b>                         SIMON (O.S.)\n</b>               It's a mod.\n\n\n<b>                                                                (CONTINUED)\n</b><b>\n</b><b>                                                                  46.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>70   CONTINUED:                                                         70\n</b>\n<b>                            KABLE\n</b>                  Gamers can't talk to cons.\n\n<b>                              SIMON (O.S.)\n</b>                  I know.\n\n<b>71   INT. SIMON'S ROOM - SIMULTANEOUS                                   71\n</b>\n     SIMON POP-LOCKS - the breakdance arm wave.\n\n<b>                            SIMON\n</b>                  It's cool, yeah?\n\n<b>72   EXT. BATTLEGROUND #3/COVER - CONTINUOUS                            72\n</b>\n     KABLE finishes the POP-LOCK - it's goofy.\n\n     A SHELL impacts the dirt nearby and BLOWS A MASSIVE CRATER in\n     the firma; KABLE shields himself from the raining DEBRIS and\n     scrambles for better cover.\n\n<b>                            KABLE\n</b>                  No. Pay attention to the game.\n\n     They spot another BROWN advancing toward a group of\n     BUILDINGS; SIMON moves KABLE to join him. Just as KABLE gets\n     there a BLUE KICKS OUT A DOOR and opens up with an ASSAULT\n     SHOTGUN, shredding the BROWN.\n\n     Two more BLUES POP OUT of a DITCH on the OPPOSITE SIDE,\n<b>     TRIANGULATING.\n</b>\n     KABLE ROLLS - BIG AMMO displacing the air just inches above\n     his head and BLOWING OUT the windows/tires of an ABANDONED\n     CAR behind him - switches TURRETS and comes up FIRING...\n     armor-piercing shells: BOOM. BOOM.\n\n     A 180 spin... BOOM.      MINUS three BLUES.\n\n<b>73   INT. SIMON'S ROOM - SIMULTANEOUS                                   73\n</b>\n     In QUICK CUTS we see SIMON striking BADASS poses; on the 3D\n     screen KABLE ECHOES THEM - it's like a SYNCHRONIZED DANCE.\n\n<b>                                                             CUT TO:\n</b>\n<b>74   EXT. BATTLEGROUND #3/COVER - CONTINUOUS                            74\n</b>\n     KABLE keeps moving - he passes a BLUE, on his knees in the\n     mud; The BLUE has completely LOST HIS SHIT.\n\n<b>                            BLUE SOLDIER 4\n</b>                  This is real, this is real, this is\n                  real!!!!\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                47.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>74   CONTINUED:                                                       74\n</b>\n     KABLE doesn't bother to shoot him; he's UNARMED. But...\n\n     SHHHTUNK. A 50 CALIBER SHELL connects from somewhere distant\n     and the BLUE is VAPORIZED, a smear on the pavement.\n\n<b>                            SIMON (O.S.)\n</b>                  That was sick.\n\n<b>                            KABLE\n</b>                  Wait a minute... are you twelve?\n\n<b>                            SIMON (O.S.)\n</b>                  I'm nineteen.\n\n<b>                            KABLE\n</b>                  Bullshit. This is unbelievable.\n                  How am I not dead yet?\n\n<b>                            SIMON (O.S.)\n</b>                  Cause I'm a badass motherfucker.\n\n     KABLE doesn't even register this. His darting eyes pick up a\n     familiar face in the chaos: FREEK.\n\n     FREEK has apparently volunteered as a generi-con - he is\n     dressed as a postman, pulling a cart of mail behind him as he\n     walks across the street.\n\n<b>                            FREEK\n</b>                      (mumbling)\n                  Gotta keep my holes down... keep\n                  `em down. Freek's gonna make it,\n                  gonna cut, gonna scatter... gonna\n                  burn this joint...\n\n     It all happens too quickly: A BROWN scrambles behind FREEK\n     and ducks down, using him as a moving human shield; squeezes\n     off a few shots - FREEK is chopped up by incoming gunfire -\n     the BROWN keeps running... there's nothing KABLE can do.\n\n     An explosion nearby pushes them forward.\n\n<b>                            SIMON (O.S.)\n</b>                  Gibs.\n\n<b>                            KABLE\n</b>                  What?\n\n<b>                            SIMON (O.S.)\n</b>                  Like, giblets. Kibbles and bits.\n                  Chunks. Pieces.\n\n\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                48.\n</b><b>                         WHITE KABLE SCRIPT - 9/19/2007\n</b><b>74   CONTINUED: (2)                                                   74\n</b>\n<b>                         KABLE\n</b>                   (burning)\n               These are real humans, fucker.\n\n<b>                         SIMON (O.S.)\n</b>               Death row psychos, so what?          They\n               had it coming.\n\n     An exposed concrete stairwell leads into the bowels of a\n     collapsed building; it looks like it must've gotten the\n     OKLAHOMA CITY treatment in the early 2000s.\n\n<b>75   INT. UNDERGROUND PARKING - STAIRWELL                             75\n</b>\n     But there's still juice feeding the dim FLUORESCENTS... KABLE\n     makes his way DOWN. A distant voyeur's POV - maybe a\n     sniper's telescopic sight? - observes KABLE disappearing\n     underground.\n\n<b>                         KABLE\n</b>               Guess that goes for me too.\n\n<b>                         SIMON (O.S.)\n</b>               Yeah, but you're different.\n\n<b>                         KABLE\n</b>               Different how?\n\n<b>                         SIMON (O.S.)\n</b>               Dude, I don't know. Cause you're MY\n               psycho.\n\n<b>76   INT. UNDERGROUND PARKING LEVEL - CONTINUOUS                      76\n</b>\n     He emerges in an UNDERGROUND PARKING LEVEL. Forty or fifty\n     cars and SUVs, 2000-2009, lie dormant, covered in dirt,\n     dust, and debris. KABLE switches on a LIGHT built in to his\n     weapon.\n\n     The FLY CAM scans 360 degrees, independent of KABLE, giving\n     them two sets of eyes.\n\n<b>                         SIMON (O.S.)\n</b>               Damn, new area.\n\n     KABLE nods toward an EXIT at the opposite end, marked P-4.\n\n<b>                           KABLE\n</b>               That way.\n\n     They make for it.\n\n\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                49.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>76   CONTINUED:                                                       76\n</b>\n<b>                             SIMON (O.S.)\n</b>                  Think about it, Kable: all the shit\n                  we've been through together. What\n                  an epic run.\n                      (beat)\n                  It's going to suck to see it end.\n\n<b>                            KABLE\n</b>                  Are you kidding me?\n\n<b>                            SIMON\n</b>                  Well, yeah - I get that for you\n                  it's different.\n\n<b>77   EXT. SLAYERS BATTLEGROUND #3/NEAR RESTRICTED AREA - MOMENTS      77\n</b><b>     LATER\n</b>\n     KABLE emerges several blocks from where he started, on a\n     narrow block that seems distant from the heat of combat.\n     Buildings shelter the street on either side... several blocks\n     down a LOW WALL BLOCKS THE ROAD - marked with RED DIAGONAL\n     STRIPES and a warning: RESTRICTED.\n\n<b>                            KABLE\n</b>                  We should go that way.\n\n<b>                            SIMON (O.S.)\n</b>                  There's nothing there.\n\n<b>                            KABLE\n</b>                  Kid, trust me - I was going house\n                  to house in Tehran while you were\n                  still sucking mommy's nipple.\n\n<b>                            SIMON (O.S.)\n</b>                      (sarcastic)\n                  Uh, yeah dude, thanks for the\n                  visual, but it's a restricted area.\n                  It's beyond the borders of the\n                  game. I couldn't put you there if I\n                  tried.\n\n     KABLE just grunts; his eyes steal a last look down the block.\n     They head the other way...\n\n<b>     THOOM.\n</b>\n     CLOSE RANGE: a big ass armor piercing MORTAR SHELL PASSES IN\n<b>     FRONT OF KABLE'S FACE...\n</b>\n     Time STOPS; KABLE sees the shell moving through the air an\n     inch from his nose in ULTRA SLO-MO... his cheeks ripple from\n     the displaced air...\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                    50.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>77   CONTINUED:                                                           77\n</b>\n     then, REAL TIME - we whip around to follow the mortar as it\n     whistles into concrete and BLOWS OUT the front of a building.\n\n     KABLE is running.\n\n<b>78   EXT. BATTLEGROUND #3 - CRUSHED RIOT VAN                              78\n</b>\n<b>                            SIMON (O.S.)\n</b>                  ... shit shit shit!\n\n     He rolls behind a CRUSHED RIOT VAN and OPENS UP in the\n     direction the shell came from, ash and debris from the impact\n     still raining down... and then:\n\n     From behind, he's NAILED IN THE BACK by a SWUNG length of\n     IRON PIPE. He half crumples, spins - HACKMAN.\n\n     HACKMAN SWINGS AGAIN, knocking the WEAPON out of KABLE'S\n     hand; it skitters across the concrete.\n\n     SIMON is completely freaked - it's happening too fast, no\n     time to react... he tries to engage HAND-TO-HAND but every\n     move pings a step late...\n\n     KABLE swings a fist; HACKMAN dodges easily. HACKMAN is\n     moving too naturally - as if he's under his own control.\n\n     HACKMAN slams the    pipe off the side of KABLE'S head, DROPPING\n     HIM - then tosses    the pipe away... and pulls out a nasty,\n     high tech-looking    SHOTGUN. He stands over KABLE and points\n     the barrel at his    FACE.\n\n<b>                             HACKMAN\n</b>                      (friendly)\n                  Bye Kable.\n\n     He SQUEEZES the TRIGGER...\n\n     The SUBMARINE ALARM SOUNDS.       FLOODLIGHTS CRANK UP.\n\n     The LEDs on HACKMAN'S gun POWER DOWN with an audible down-\n     cycle... a shell, undetonated, drops from the barrel and\n     plops onto KABLE'S FOREHEAD.\n\n                            HACKMAN (cont'd)\n                  What happened?\n\n<b>                                                               CUT TO:\n</b>\n<b>79   EXT. SAVE POINT #3 - SIMULTANEOUS                                    79\n</b>\n     A BROWN CON walks slowly, on unsteady legs, out of the\n     OCTAGONAL SAVE SHACK - profile...\n\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                           51.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>79   CONTINUED:                                                                  79\n</b>\n     dudes look at him and back away... when he turns toward us we\n     see why: half his head, shoulder and one arm are blown off...\n\n<b>                                                                CUT BACK TO:\n</b>\n<b>80   EXT. SLAYERS BATTLEGROUND #3/CRUSHED RIOT VAN - SIMULTANEOUS 80\n</b>\n     KABLE seizes the opportunity to jam a foot up into HACKMAN'S\n     BALLS, buckling him. He twists HACKMAN'S LEGS into a pretzel\n     and throws him off.\n\n<b>                            KABLE\n</b>                      (to himself)\n                  Kid's gonna get me killed.\n\n<b>                               SIMON (O.S.)\n</b>                         (offended)\n                  Hey.\n\n     KABLE sees GUARDS appearing and BLUES hurrying away from\n     ambush positions - including the one who likely fired the\n     mortar... session complete.\n\n     KABLE cups a hand over his mouth, conspiratorially, and\n     speaks directly into SIMON'S ear:\n\n<b>                            KABLE\n</b>                  Listen to me. I don't know who's\n                  behind it, or why, but I was\n                  supposed to die today. They're\n                  gunning for us. I can beat them,\n                  but not with you controlling me.\n\n<b>                            SIMON\n</b>                  What the hell...?\n\n     This is unthinkable, dangerous talk.\n\n<b>                            KABLE\n</b>                  Turn me loose, kid.        You want to\n                  win, turn me loose.\n\n<b>                               SIMON\n</b>                  But-\n\n<b>                            KABLE\n</b>                  Find a way.\n\n     A GUARD grabs KABLE and the LINK BREAKS - we...\n\n<b>                                                              SMASH TO BLACK:\n</b><b>\n</b><b>                                                             52.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>81   INT. ANGIE'S APARTMENT - DAY                                  81\n</b>\n     A drab brownstone apartment.\n\n     Shades block out the oppressive nicotine sunlight; the\n     interior is mute, faded - claustrophobic. KABLE has his cell;\n     even though ANGIE is on the outside, and free, her\n     environment seems to parallel his.\n\n     A worn-out photo is taped to the fridge: the same little girl\n     in KABLE'S picture.\n\n<b>82   INT. ANGIE'S APARTMENT - BEDROOM                              82\n</b>\n     She stands in front of a closet mirror in the bedroom,\n     looking herself over. She's FULLY DRESSED... but not like we\n     saw her in society. Conservative. Pretty. NORMAL. She\n     rehearses a friendly smile, but has difficulty not breaking\n     into tears.\n\n     ANIMATED, COLORED LIGHT leaks in from outside through the\n     dark window blinds behind her - some sort of projected\n     advertising?\n\n<b>83   INT. ANGIE'S APARTMENT - BEDROOM                              83\n</b>\n     CUT TO: same room, later. ANGIE sits on the unmade bed. She\n     searches through her purse for a PILL JAR, rattles a few into\n     her hand... she DRY SWALLOWS them... leans forward, eyes\n     shut, struggling NOT TO PASS OUT... she has to pull herself\n     together somehow... the CAMERA pushes past her, toward the\n     window, where the ANIMATED COLORS play 24-7...\n\n<b>                                                        CUT TO:\n</b>\n<b>84   EXT. ANGIE'S APARTMENT - DAY                                  84\n</b>\n     ... the CAMERA pulls away, continuing the motion: we are on a\n     wide view of the outside of the building, a rundown\n     brownstone on a rundown street - animated advertising covers\n     half the side of the structure...\n\n     An ad for slayers is running - KABLE, in cinematic slo-mo,\n     and superimposed in wall-height block letters:\n\n\n<b>                                    FREE\n</b>     And then:\n<b>                                ORDER NOW!\n</b>\n<b>                                                        CUT TO:\n</b><b>\n</b><b>                                                              53.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>85   INT. SOCIAL SERVICES INTERVIEW ROOM - DAY                      85\n</b>\n     ANGIE sits uncomfortably in a hard plastic chair; the light\n     is flat, fluorescent... in front of her, behind a desk, is a\n     no-nonsense Social Services CASEWORKER, late 30s, CUBAN.\n\n<b>                         CASEWORKER\n</b>                   (looks over her paperwork)\n               So... Miss Roth.\n\n     ANGIE delivers the smile we saw her rehearse with all the\n     warmth she can muster; it's not convincing.\n\n                         CASEWORKER (cont'd)\n               Why are we here today... says you'd\n               like to apply for custody of your\n               child-\n\n<b>                          ANGIE\n</b>               Delia.   Her name is Delia.\n\n     The CASEWORKER looks over the paperwork while ANGIE shifts in\n     her seat... torture.\n\n<b>                         CASEWORKER\n</b>               Spouse incarcerated, life without\n               possibility of parole. You use\n               your maiden name.\n\n<b>                         ANGIE\n</b>               My husband - he... it's not\n               entirely true, regarding his\n               sentence. In fact, he's due to be\n               released soon...\n\n     She makes brief eye contact with ANGIE.\n\n<b>                         CASEWORKER\n</b>               Your husband was charged and\n               convicted of first degree murder,\n               Miss Roth. I can hardly consider\n               his release, if it was to occur, to\n               be a positive.\n\n     This is not going well. ANGIE holds her tongue with all of\n     her will, not wanting to make it worse. The CASEWORKER holds\n     all the cards.\n\n                         CASEWORKER (cont'd)\n                   (changes subject, back at\n                    the paperwork)\n               You're... an actor?\n\n     ANGIE nods.\n\n<b>                                                         (CONTINUED)\n</b><b>\n</b><b>                                                                54.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>85   CONTINUED:                                                       85\n</b>\n                            CASEWORKER (cont'd)\n                  Not sure if I've seen you in\n                  anything.\n\n<b>                            ANGIE\n</b>                  I work in society.\n\n<b>                            CASEWORKER\n</b>                  Acting, is that what they call it?\n\n<b>                            ANGIE\n</b>                  It's a job.\n\n     ANGIE is hanging on... be pleasant, be friendly, breathe...\n     but INSIDE she wants to cry, to scream, to fucking EXPLODE.\n\n<b>                            CASEWORKER\n</b>                  Miss Roth. Your child has been...\n                  exceedingly well placed. The new\n                  family is very wealthy. She'll\n                  never want for anything.\n                      (leans in)\n                  I understand you love your little\n                  girl, but... do you really think\n                  she'd be better off with people\n                  like you?\n\n<b>                               ANGIE\n</b>                  Yes, I do.     I'm her mother.\n\n     The CASEWORKER presses a buzzer, unlocking the door behind\n<b>     ANGIE.\n</b>\n<b>                            CASEWORKER\n</b>                  We will give your application all\n                  the consideration that it merits.\n\n     The words burn into ANGIE like battery acid, but there's not\n     a thing she can say.\n\n<b>86   INT. SIMON'S ROOM - NIGHT                                        86\n</b>\n     SIMON is lying on his bed, staring at the ceiling - a GIANT\n     VIDEO SCREEN playing back key moments of that day's Slayers\n     session in an endless loop. SIMON holds his fingers up in\n     front of his face, zooming and rewinding the video with\n     little fluid movements of his hands.\n\n     Suddenly the screen GLITCHES OUT, goes dead for a second -\n     and when it comes back the battle images are replaced by a\n     GIANT FACE, surrounded by black, STARING DOWN AT HIM:\n\n     HUMANZ BROTHER, early 30's; a savvy leader with an\n     unforgettable presence.\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                 55.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>86   CONTINUED:                                                        86\n</b>\n     His style is a throwback to another era; like a 70s Black\n     Panther Soul Brother transplanted into the high tech future.\n\n<b>                            HUMANZ BROTHER\n</b>                  You like the software?\n\n<b>                            SIMON\n</b>                      (confused)\n                  Software...\n\n<b>                            HUMANZ BROTHER\n</b>                  The walkie talkie, playa.\n\n     SIMON puts it all together.\n\n<b>                            SIMON\n</b>                  No shit... you're the guy from TV.\n                  The HUMANZ.\n\n<b>                            HUMANZ BROTHER\n</b>                  That's right, baby. You think\n                  about what the brotha said?\n\n<b>                            SIMON\n</b>                  To what, um, brotha do you refer...\n                  brotha?\n\n<b>                            HUMANZ BROTHER\n</b>                  Kable wants the freedom to ass-\n                  kick. Do shit his way. You gonna\n                  give it to him?\n\n<b>                            SIMON\n</b>                  You were listening.\n\n<b>                            HUMANZ BROTHER\n</b>                  We see and hear everything that\n                  goes on inside the so-called game.\n\n<b>                             SIMON\n</b>                  Alright, then.\n                      (considering)\n                  Kable said we got lucky - that they\n                  were gunning for us - what was that\n                  all about?\n\n<b>                            HUMANZ BROTHER\n</b>                  Kable got a past... he knows\n                  things. Things he don't even know\n                  he know.\n\n<b>                             SIMON\n</b>                  Huh?   What things?\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                               56.\n</b><b>                         WHITE KABLE SCRIPT - 9/19/2007\n</b><b>86   CONTINUED: (2)                                                  86\n</b>\n<b>                         HUMANZ BROTHER\n</b>               Things Castle's afraid of. As long\n               as your boy stay on the inside\n               Castle know he can keep him quiet -\n               but if ever got out...\n                   (shakes his head)\n               Uh uh. Castle will never let that\n               happen.\n\n<b>                         SIMON\n</b>               One battle left, I think I can\n               handle my bidness.\n\n     HUMANZ BROTHER just shakes his head.\n\n<b>                         HUMANZ BROTHER\n</b>               You're not hearing me - this is not\n               something you can control. They\n               gonna kill his ass, Simon. In the\n               eyes of the world. And then what?\n               You just another poor little rich\n               honky. No Kable, no pussy, no\n               shit.\n\n     SIMON can't deal.\n\n<b>                         SIMON\n</b>               This is, come on... too heavy... I\n               don't know what the hell you're\n               talking about... I just play games,\n               man. Games.\n\n<b>                         HUMANZ BROTHER\n</b>               Mm hm. That's right, it's a game.\n                   (changing gears)\n               You want to win it, don't you?\n\n<b>                         SIMON\n</b>               Yeah, dude, I intend to.\n\n<b>                         HUMANZ BROTHER\n</b>               Then you need to cutcho strings,\n               puppet-massa.\n\n     HUMANZ BROTHER slowly ZOOMS HIMSELF IN.\n\n                         HUMANZ BROTHER (cont'd)\n               Imagine a slayer that don't got to\n               wait to be told what to do. No\n               ping, you dig? A trained killing\n               machine... operating in real time,\n               on pure instinct.\n\n\n\n<b>                                                          (CONTINUED)\n</b><b>\n</b><b>                                                             57.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>86   CONTINUED: (3)                                                 86\n</b>\n     SIMON can't help but consider it, mind reeling. It's obvious\n     KABLE would royally fucking dominate, but... SIMON shakes it\n     off.\n\n<b>                         SIMON\n</b>               That... would be cheating.\n\n<b>                         HUMANZ BROTHER\n</b>               A mod, that's all. Like that\n               guidance system you hacked on three\n               weeks ago lets you track\n               motherfuckers around corners and\n               shit.\n\n<b>                         SIMON\n</b>                   (nervous)\n               Uhhh...\n\n<b>                         HUMANZ BROTHER\n</b>               The game got to mutate, after all.\n               It got to evolve, you feel me?\n\n<b>                         SIMON\n</b>               I do. I do feel you.\n\n     HUMANZ BROTHER leans back - he has him.\n\n<b>                         HUMANZ BROTHER\n</b>               Then let's rock, baby.\n\n     [MUSIC: TWISTED SISTER, \"I WANNA ROCK\" kicks in]\n\n     A WINDOW pops up on the screen:\n\n                              FreeNigga.exe\n\n<b>                                                        CUT TO:\n</b>\n<b>87   INT. PRISON - HACKMAN'S CELL - NIGHT                           87\n</b>\n     [ \"I WANNA ROCK\" continues...]\n\n     One light... HACKMAN'S FACE, glistening with sweat, is the\n     only thing partially visible in the inky black... the CAMERA\n     slowly ZOOMS into his EYES... twin pools of MADNESS... of\n<b>     MURDER...\n</b>\n<b>                                                        CUT TO:\n</b>\n<b>88   INT. PRISON, KABLE'S CELL - LATER                              88\n</b>\n     CLOSE-UP of the FADED PHOTO... gold hair, innocent\n     laughter... KABLE runs his thumb across it tenderly,\n     caressing the lines...\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                58.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>88   CONTINUED:                                                       88\n</b>\n<b>                            WOMAN (O.S.)\n</b>                      (whispering)\n                  Tillman.\n\n     KABLE looks up. It's the SAME VOICE as before - the one that\n     gave him the photo.\n\n<b>                               KABLE\n</b>                  You.\n\n<b>                            WOMAN (O.S.)\n</b>                  We know you talked to him... your\n                  Player.\n\n<b>                            KABLE\n</b>                  You're not a guard... who are you?\n\n<b>                               WOMAN (O.S.)\n</b>                  A friend.\n\n<b>                            KABLE\n</b>                  I don't have any.\n\n<b>                            WOMAN (O.S.)\n</b>                  Listen to me: Simon's going to give\n                  you what you want. What you asked\n                  him for.\n\n<b>                            KABLE\n</b>                  How do you know that?\n\n<b>                            WOMAN (O.S.)\n</b>                  I know something else: whether or\n                  not he's controlling you, you will\n                  never reach the save point. Castle\n                  won't allow it.\n\n<b>                               KABLE\n</b>                  We'll see.\n\n<b>                            WOMAN (O.S.)\n</b>                  No. Listen to me, Tillman - the\n                  game is unwinnable - they will not\n                  let you live. If you're want to\n                  get out and see the people in the\n                  picture you'll have to find another\n                  way.\n\n     KABLE doesn't answer; he absorbs her words, wondering if he\n     can believe them... finally:\n\n<b>                            KABLE\n</b>                  I need you to get me something.\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                     59.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>88   CONTINUED: (2)                                                        88\n</b>\n<b>                         WOMAN (O.S.)\n</b>               What, Kable... what can I get you?\n\n     KABLE stares into the DARK, turning it over in his head, then\n     looks up at the WINDOW in the door, a simple black rectangle -\n     and on the other side, his only LIFELINE.\n\n<b>                          KABLE\n</b>               Drunk.\n\n<b>                                                         FADE TO BLACK.\n</b>\n<b>89   INT. STAGING ROOM - TIME INDETERMINATE                                89\n</b>\n<b>     BLACK.\n</b>\n     Overhead fluorescents shock and hum to life, revealing a\n     CLAUSTROPHOBIC ROOM - four walls, metal grating underfoot -\n     and A LOCKER. KABLE is in his COMBAT BROWN.\n\n     He PRINT ACTIVATES the locker. The WEAPON is there... and\n     something else: a wrinkled BROWN PAPER BAG. What the hell?\n     He takes it out, trying not to glance too obviously at the\n     overhead SURVEILLANCE CAMERA.\n\n     CUT TO the POV from the CAM: KABLE is opening the bag...\n\n<b>                         VOICE (O.C.)\n</b>               What's he got there?\n\n     BACK in the room. Inside the brown bag is a FIFTH OF VODKA.\n     KABLE quickly slips it into his side cargo-pocket.\n\n                         VOICE (cont'd)\n               Kable, what the hell is that?!\n\n     Behind KABLE a DOOR SLIDES OPEN automatically, revealing a\n     CONCRETE TUNNEL, like the PLAYERS' entrance to a FOOTBALL\n     STADIUM... the WHITE LIGHT is BLINKING ON and OFF... SOLDIERS\n     sprint for the daylight, trying to escape the TORTURE... it's\n<b>     CHAOS.\n</b>\n                         VOICE (cont'd)\n               Fuck-face - remove the `molotov'\n               from your pants and discard into\n               the recycle bin, now!\n\n     KABLE grabs the bottle from his pocket, struggling to\n     maintain as the LIGHT slams into his brain, AGONY.\n\n                         VOICE (cont'd)\n<b>               PUT IT DOWN!\n</b>\n\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                  60.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>89   CONTINUED:                                                         89\n</b>\n     ALL SURVEILLANCE CAMERAS POINT AT KABLE. KABLE - no choice -\n     makes the decision, twists the cap, tilts his head back, and\n<b>     SLAMS THE ENTIRE BOTTLE.\n</b>\n     He wails the BOTTLE at one of the CAMERAS, shattering it -\n     and joins the others rushing into combat.\n\n<b>90   EXT. SPAWN POINT #4 - MOMENTS LATER                                90\n</b>\n     KABLE breaks the DAYLIGHT - but without a smooth LEAP AND\n     ROLL, and no ROCKSTAR POSE - instead, he TRIPS and tumbles\n     ASS OVER END down an embankment, landing in a heap at the\n     bottom.\n\n<b>                            SIMON (O.S.)\n</b>                      (sarcastic)\n                  I can see turning you loose was a\n                  great idea.\n\n<b>                            KABLE\n</b>                      (woozy)\n                  What happened.\n\n<b>                            SIMON (O.S.)\n</b>                  YOU happened, jackass. You wanted\n                  control, you got it.\n\n     KABLE tests his hands, clenching and unclenching - THE KID\n     WASN'T LYING ... while starting to trip hard on the VODKA,\n     which is kicking in INSTANTLY...\n\n<b>                               KABLE\n</b>                  No shit...\n\n<b>                             SIMON (O.S.)\n</b>                  Yeah, that's right. So please don't\n                  fuck up...\n\n     An EXPLOSION ROCKS THE DIRT just a few feet away, BLINDING,\n     DEAFENING - and KABLE shifts into ANOTHER WORLD...\n\n<b>91   EXT. SLAYERS BATTLEGROUND #4                                       91\n</b>\n     He's MOVING FAST... SOUND is just an idea, disconnected from\n     reality... BODIES AND BULLETS drift by without gravity... his\n     vision doubles and bleeds...\n\n<b>                            SIMON (O.S.)\n</b>                  What's the matter with you Kable?\n                  Kill something!\n\n     BLUES. Lots of them.        KABLE starts shooting wildly - HITTING\n<b>     NOTHING.\n</b>\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                   61.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>91   CONTINUED:                                                          91\n</b>\n                            SIMON (O.S.) (cont'd)\n                  This is unbelievable.\n\n<b>92   EXT. SLAYERS BATTLEGROUND #4                                        92\n</b>\n     KABLE is running erratically at least... hard to HIT... but\n     definitely HEADED SOMEWHERE.\n\n     A SHELL SMACKS KABLE'S shoulder, knocking him off his feet;\n     the armor absorbs it, but he's out of time... he's shooting\n     air...\n\n<b>                            SIMON (O.S.)\n</b>                      (frustrated)\n                  Fuck it.\n\n     We see SIMON'S fingers glide, dial up the SWARMER...\n\n     KABLE is still firing randomly as the turret shifts - the\n     SWARMER goes STRAIGHT UP, then locks on BLUE and swerves down\n     on them like HELL FROM THE SKY, turning skulls to swiss\n     cheese.\n\n     Too close.\n\n                            SIMON (O.S.) (cont'd)\n                      (the voice of reason)\n                  Kable. Listen: it's the last game.\n                  You're going to be dead and I'm\n                  going to look like a total asshole\n                  if you don't pull your balls\n                  together!\n\n<b>                               KABLE\n</b>                  Blow me.\n\n     He scrambles to his feet and charges for the entrance to the\n<b>     UNDERGROUND GARAGE.\n</b>\n<b>                               SIMON (O.S.)\n</b>                  Dammit!\n\n<b>93   INT. UNDERGROUND PARKING LEVEL - MOMENTS LATER                      93\n</b>\n     KABLE slams open a door marked P4 and stumbles into the CAR\n<b>     GRAVEYARD...\n</b>\n     Reality is ROARING, SPINNING... KABLE slams into the side of\n     a parked car, legs rubber... he looks it over - TIRES FLAT,\n     NO GOOD... he stumbles to the next, then another...\n     another... his head hits a passenger side window,\n<b>     SPIDERWEBBING IT...\n</b>\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                             62.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>93   CONTINUED:                                                                    93\n</b>\n     FINALLY, the ONE: A FORD F-250 SUPER CHIEF... GUN METAL GREY,\n<b>     PRISTINE.\n</b>\n     Note: the F-250 is a CONCEPT TRUCK - a future design for\n     FORD'S F-line. In our world this is a 2009 factory model,\n     which makes it old, but not antique. The truck is about as\n     BADASS as you could want, with dark, narrow windows, big ass\n     wheels and a FRONT END that looks like it could PUNCH THROUGH\n<b>     A BUILDING OR TWO.\n</b>\n     KABLE gets to the FUEL CAP DOOR and pries it open... ENGRAVED\n     under the cap is a prominent WARNING:\n\n                                  Ethanol Only\n\n<b>                            SIMON (O.S.)\n</b>                  Kable. Dude. What are you doing?\n\n     KABLE unscrews the cap and sticks his finger down his throat.\n\n     Dry heave. He does it again - this time puts his mouth on\n     the hole and PUKES PURE LIQUID INTO THE TANK.\n\n                            SIMON (O.S.) (cont'd)\n                  What the hell?\n\n     He stops, doubled over, gasping for breath... then the\n     feeling hits him again - and he heaves another fountain down\n     the hole. A BLUE shows up in the opposite stairwell - KABLE\n     brings his WEAPON up to hip level and BLOWS HIM AWAY WITHOUT\n     LOOKING. His head is clearing.\n\n     KABLE looks around, unzips his pants and PISSES INTO THE\n     TANK. SIMON is slack-jawed, speechless.\n\n     KABLE shakes out his head; we can see in his eyes that he's\n     regaining his senses; focusing in. He busts out the DRIVER'S\n     SIDE WINDOW, gets in; tears open the steering column - A\n     BLUE SLAYER shows up in the mirror - fuck! - He CRANKS THE\n<b>     IGNITION... VRUUUUMM, KACHUNK, KACHUNK...\n</b>\n     BOOOM! A 50mm SHATTERS the back window and punches a hole\n     into the dashboard.\n\n     KABLE checks what's left of the mirror.               HACKMAN and six\n     other BLUE SLAYERS are coming fast.\n\n                            SIMON (O.S.) (cont'd)\n<b>                  GO, GO, GO!\n</b>\n<b>                            KABLE\n</b>                  Yeah? Anything else ya fuckin\n                  cheerleader?\n\n\n<b>                                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                63.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>93   CONTINUED: (2)                                                   93\n</b>\n     VRUUUUUM, VRUUUM... KABLE hammers on the pedal again,\n     knocking out the old ghosts - VRROOOOOOMM!!\n\n     He SLAMS it into gear and PEELS OUT.\n\n     HACKMAN leaps onto the side of the moving truck and points\n     50mm directly at the side of KABLE'S head. In a split instant\n     KABLE grabs the nose of the weapon and points it up -\n\n     BOOM! A close range shell blows through the roof of the\n     truck. KABLE slams the brakes, spinning the truck, and\n     launches HACKMAN into a row of parked cars.\n\n     HACKMAN gets in one last shot as KABLE punches it out of the\n     garage, disintegrating a concrete column.\n\n<b>                         HACKMAN\n</b>               Fuuuuck!!!!\n\n     He slams his head into the windshield of a parked car, caving\n     it in.\n\n<b>94   EXT. SLAYERS BATTLEGROUND #4/F250 (DRIVING) - MOMENTS LATER      94\n</b>\n     KABLE DRIFTS the F-250 onto the street, sideways, tires\n     shrieking... wiping out two unlucky BLUES... pops it and\n<b>     TAKES OFF...\n</b>\n     He is headed STRAIGHT INTO THE RESTRICTED AREA.\n\n<b>95   INT/EXT. SLAYERS BATTLEGROUND #4/F250 (DRIVING)                  95\n</b>\n     The FLY CAM is right there, taking the hot turn right on the\n     truck's tail, giving SIMON the POV of a classic 3D DRIVING\n     GAME. He activates DYNAMIC CAMERA CONTROL with a gesture -\n     now he can manually choose his view... he pushes the CAMERA\n     forward, next to the driver's window...\n\n     The CAMERA looks to the side at KABLE, driving like he's on a\n     mission to HELL. SIMON barks in his head.\n\n<b>                         SIMON (O.S.)\n</b>               Kable, PLEASE... get back in the\n               game! YOU'RE SCREWING MY ASS,\n<b>               KABLE!!!\n</b>\n     KABLE ignores him; he picks up his WEAPON, points it out the\n     window at the FLY and FIRES... the FLY jukes out of the way,\n     barely... it spins off OUT OF CONTROL and SMASHES through the\n     window of a building. Bye, FLY.\n\n<b>                                                        CUT TO:\n</b><b>\n</b><b>                                                                64.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>96    INT. SIMON'S ROOM - CONTINUOUS                                  96\n</b>\n      SIMON'S screen is filled with a GLITCHED OUT view of NOTHING,\n      under a pile of glass and concrete.\n\n<b>                          SIMON\n</b>                Um.\n\n<b>97    EXT. SLAYERS RESTRICTED AREA - CONTINUOUS                       97\n</b>\n      The SUBMARINE ALARM is sounding across the BATTLEGROUND.\n      KABLE is heading deep into RESTRICTED TERRITORY, slamming\n      through and swerving around obstacles.\n\n<b>98    INT/EXT. RESTRICTED AREA/F250 (DRIVING)                         98\n</b>\n      WITHOUT WARNING: a SNOWPLOW comes blasting out of nowhere\n      going 80, trying to ram the driver's side... it's a tick\n      late, clipping the back end instead, sending KABLE into a\n      SPIN... KABLE is knocked around in the cab and PUKES all over\n      the passenger seat. He recovers, straightens out and keeps\n      going.\n\n<b>                          KABLE\n</b>                    (relieved)\n                Ughh, that was the one.\n\n<b>99    INT. SIMON'S ROOM - SIMULTANEOUS                                99\n</b>\n      SIMON is switching from CAMERA to CAMERA, trying to pick up a\n      view of KABLE... finally he comes across a RUMBLING CHASE\n      CAM, coming up on KABLE'S truck from behind...\n\n<b>100   EXT. RESTRICTED AREA/F250 (DRIVING) - SIMULTANEOUS              100\n</b>\n      The CAMERA is mounted on a SNOWPLOW, one of a pair gaining on\n      KABLE, slamming through rubble and debris.\n\n<b>101   INT. RESTRICTED AREA/F250 (DRIVING)                             101\n</b>\n      KABLE spots them in the REAR VIEW MIRROR.\n\n      He SLAMS HIS HEAD against the steering wheel to clear it -\n      despite the purge he's still pretty FUCKED UP.\n\n      KABLE pops the driver's door and leans out, GETTING A BEAD on\n      the nearest PLOW...\n\n<b>102   INT. SIMON'S ROOM - CONTINUOUS                                  102\n</b>\n      From the SNOWPLOW'S POV we see KABLE leaning out, POINTING\n      THE WEAPON AT US. Then big ass MUZZLE FLASHES: THOOM! THOOM!\n\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                        65.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>102   CONTINUED:                                                              102\n</b>\n<b>                             SIMON\n</b>                   Shit, shit, SHIT!\n\n      A shell comes RIGHT AT US - the screen GLITCHES, FREEZES -\n      and goes BLACK.\n\n                               SIMON (cont'd)\n                   I'm dead.\n\n<b>103   EXT. RESTRICTED AREA/F250 (DRIVING) - CONTINUOUS                        103\n</b>\n      In KABLE'S REAR VIEW: The LEAD SNOWPLOW SPINS OUT,\n      hemorrhaging black smoke; then SLAMS into the SECOND, sending\n      it into the side of a building.\n\n<b>104   INT. F250                                                               104\n</b>\n      KABLE'S TRUCK HICCUPS - FUEL is on EMPTY, but still charging\n      ahead.\n\n<b>105   INT/EXT. RESTRICTED AREA/F250 (DRIVING)                                 105\n</b>\n      A LOW CONCRETE WALL surrounds the perimeter, and it's COMING\n      UP FAST; beyond it: more abandoned urban wasteland.\n\n      KABLE has got too much speed at this point to do anything but\n      slam the thing SIDEWAYS into a SICK POWER SLIDE - the TRUCK\n      hits the barrier and FLIPS OVER IT, CORKSCREWING four times\n      before GRINDING TO A STOP on it's hood. The AIRBAGS DEPLOY,\n      smashing KABLE into his seat...\n\n<b>106   EXT. RESTRICTED AREA - SUBWAY ENTRANCE                                  106\n</b>\n      KABLE scrambles out of the vehicle; he spots a half collapsed\n      SUBWAY ENTRANCE and runs for it...\n\n<b>107   EXT. RESTRICTED AREA - SKY                                              107\n</b>\n      Behind him, two SMART MISSILES are streaking high across the\n      grey sky... they change direction and DOUBLE THEIR SPEED -\n      it's fucking HORRIFIC... and CONVERGE on the downed TRUCK in\n      an EYEBLINK.\n\n<b>      BOOM.\n</b>\n<b>108   EXT. RESTRICTED AREA - SUBWAY ENTRANCE                                  108\n</b>\n      KABLE is LIFTED OFF HIS FEET and blown into the SUBWAY\n      ENTRANCE, which COLLAPSES BEHIND HIM.\n\n<b>                                                            FADE TO BLACK.\n</b><b>\n</b><b>                                                              66.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>109   INT. FRAT HOUSE - DAY                                         109\n</b>\n      The FRAT GUYS are standing there with their beers, frozen,\n      mouths hanging open.\n\n      On screen is a THREE DIMENSIONAL TEST PATTERN accompanied by\n      a SEXY FEMALE VOICE:\n\n<b>                          FEMALE VOICE\n</b>                Please stand by... Please stand\n                by... Please stand by...\n\n<b>                          FRAT GUY\n</b>                What just happened?\n\n<b>110   EXT. MONTAGE, NEWS REPORT - DAY                               110\n</b>\n      The REPORT plays on a variety of PUBLIC SCREENS:\n\n<b>                          FEMALE NEWS HOST\n</b>                To recap: initial reports are that\n                Kable, the most recognizable face\n                of the Slayers phenomenon next to\n                Ken Castle himself - is officially\n                listed as fragged...\n\n<b>                          NEWS CO-HOST\n</b>                    (bitter)\n                That's bullshit.\n\n<b>                          FEMALE NEWS HOST\n</b>                ... just one session away from\n                being the first slayer ever to win\n                a full pardon and release.\n\n<b>                                                         CUT TO:\n</b>\n<b>111   INT. COMMUTER TRAIN - DAY                                     111\n</b>\n      A drab, above ground commuter train; somehow reminiscent of\n      the train to the slayers battleground - except the population\n      here is strictly civilian: young, eccentric, mostly\n      attractive, but their eyes are burned out, dead... lost.\n      Dishwater daylight filters through the windows.\n\n      The news broadcast continues, fed over video monitors that\n      line the ceiling of the train. The passengers' eyes are glued\n      to the screens...\n\n\n\n\n<b>                                                         (CONTINUED)\n</b><b>\n</b><b>                                                                 67.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>111   CONTINUED:                                                       111\n</b>\n<b>                             FEMALE NEWS HOST\n</b>                   In a NETCAST plagued by technical\n                   difficulties and dead spots the\n                   report could NOT be confirmed -\n                   however KABLE - born John Tillman\n                   of Albany, New York and convicted\n                   of murder just four years ago - has\n                   been removed from Slayers rosters\n                   and upcoming events listings.\n\n      ... including, we reveal: ANGIE. She is stunned; her eyes\n      well up with tears. No one notices.\n\n                             FEMALE NEWS HOST (cont'd)\n                   His player, gaming megastar Simon\n                   Silverton - could not be reached\n                   for comment.\n\n<b>112   EXT. BROOKLYN/BROWNSTONE - DAY                                   112\n</b>\n      GRAFFITI on concrete, stenciled:\n\n                          slayers is bad tv - humanz\n\n      KABLE is standing across the street from a BEAT DOWN\n      BROWNSTONE, watching the second floor window.\n\n      A funky OFF-ROAD MOTOCROSS BIKE buzzes by him and up onto the\n      sidewalk, FARTING SMOKE. KABLE IGNORES the RIDER, who parks,\n      gets off, loses the brain bucket and steps up to his side.\n\n<b>                             TRACE\n</b>                   She's not home.\n\n      KABLE turns - the RIDER is a green-eyed 22 year-old girl w/\n      black rimmed WEEZER glasses; SMART AND CUTE as hell... this\n      is TRACE.\n\n                              TRACE (cont'd)\n                   But Castle's personal security will\n                   be, soon enough - trust me, you\n                   don't want to meet them.\n                       (beat)\n                   You know, it's pretty obvious that\n                   you'd come here first.\n\n<b>                             KABLE\n</b>                   Who are you?\n\n      TRACE smiles.\n\n<b>                             TRACE\n</b>                   You asked me that once before.\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                    68.\n</b><b>                              WHITE KABLE SCRIPT - 9/19/2007\n</b><b>112   CONTINUED:                                                          112\n</b>\n<b>                             KABLE\n</b>                   Your voice...\n\n      We might recognize it too - it's the VOICE from the other\n      side of the CELL DOOR.\n\n<b>                             TRACE\n</b>                   You should really come with me...\n\n      She glances skyward toward the SOUND OF HELICOPTERS.\n\n                             TRACE (cont'd)\n                   ... like, NOW.\n\n      KABLE considers his options...\n\n      They TAKE OFF on the MOTO, TRACE driving.\n\n<b>113   EXT. STREETS OF NEW YORK - DAY                                      113\n</b>\n      TRACE darts nimbly thru traffic and pedestrians, finally\n      ZAGGING up onto the sidewalk and down a side alley...\n\n<b>114   EXT. ALLEY - ADULT STORE ENTRANCE                                   114\n</b>\n      There's an open doorway to the left - NEON SIGN above:\n\n                                    adult xxx video\n<b>                                         3D-ID\n</b>                                      novelty toy\n\n      She CUTS HARD 90 degrees, straight into it, leaving tread on\n      the concrete - through hanging black rubber strip curtains...\n\n<b>115   INT. ADULT STORE - NARROW STAIRWELL                                 115\n</b>\n      and STRAIGHT DOWN A NARROW STAIRWELL, taking the stairs\n<b>      MOTOCROSS...\n</b>\n      She cuts HARD RIGHT at the bottom...\n\n<b>116   INT. FREIGHT ELEVATOR                                               116\n</b>\n      ...down a concrete corridor and onto a minimal FREIGHT\n      ELEVATOR - open on the sides... punches the down button, BIKE\n      still idling... KABLE coughs from the fumes...\n\n      Halfway down there is a SQUARE OPENING in the wall of the\n      elevator shaft - a TUNNEL TO BLACK.\n\n<b>                                TRACE\n</b>                   Hang on.\n\n\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                     69.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>116   CONTINUED:                                                           116\n</b>\n      TRACE REVS up the bike - and as they pass the tunnel, she\n      POPS IT. They're GONE.\n\n<b>117   INT. HUMANZ HEADQUARTERS - MOMENTS LATER                             117\n</b>\n      A DARK, underground VIDEO ARCADE... low ceilings, concrete;\n      OLD SCHOOL - sort of a graveyard of lost games... the\n      classics of the 80s - MISSILE COMMAND, DEFENDER, ROBOTRON,\n      CRANK, etc. The dimensions of the room are impossible to\n      determine. A dozen or so PEOPLE - just BLACK SILHOUETTES in\n      the CATHODE RAY GLOW - are scattered around, banging buttons,\n      giving it body english, racking up scores.\n\n      TRACE leads KABLE through, toward the one BRIGHTLY LIT SPOT:\n      at the center of the arcade, an AIR HOCKEY table is blasted\n      with WHITE LIGHT from above. HUMANZ BROTHER, who we\n      recognize from SIMON'S vid screen, and HUMANZ DUDE - mid 20s,\n      long hair - are playing: CLACKCLACK, CLICK, CLACKCLUNK,\n<b>      CLACK...\n</b>\n      They are so wrapped up in their game that they don't appear\n      to notice KABLE.\n\n      HUMANZ BROTHER smacks a random 3-bank           WINNER.\n\n<b>                             HUMANZ BROTHER\n</b>                   You a fool.\n\n<b>                             HUMANZ DUDE\n</b>                   Stop playing that freaky shit off\n                   the rail.\n\n<b>                             HUMANZ BROTHER\n</b>                   It's a game of deception.\n\n<b>                             HUMANZ DUDE\n</b>                   Whatever, that's cuz you got no\n                   power...\n\n      HUMANZ DUDE measures a shot, rolling the paddle with one\n      finger - then LETS IT RIP - slamming the GAME WINNER in a\n      STRAIGHT LINE past HUMANZ BROTHER'S frozen paddle - SCORE: 7-\n<b>      5.\n</b>\n                              HUMANZ DUDE (cont'd)\n                       (getting in his face)\n                   Huh? What?\n\n<b>                               HUMANZ BROTHER\n</b>                   Bullshit.\n\n<b>                             KABLE\n</b>                   You guys suck.\n\n\n<b>                                                                (CONTINUED)\n</b><b>\n</b><b>                                                                  70.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>117   CONTINUED:                                                        117\n</b>\n      They turn, suddenly aware of him. HUMANZ DUDE'S paddle hand\n      goes limp; the puck limps in and scores, meaninglessly.\n\n<b>                             HUMANZ DUDE\n</b>                       (impressed)\n                   Kable. Holy shit.\n\n<b>                             HUMANZ BROTHER\n</b>                   His name's Tillman.\n\n<b>                             HUMANZ DUDE\n</b>                   Whatever.\n                       (to KABLE)\n                   You made it. You're really here.\n\n      KABLE looks them over - he's not sure what he expected, but\n      it wasn't this.\n\n<b>                             KABLE\n</b>                   You're the ones who broke me out?\n\n<b>                             TRACE\n</b>                   We only freed your mind.\n\n<b>                             HUMANZ BROTHER\n</b>                   Your ass followed.\n\n<b>                             HUMANZ DUDE\n</b>                   Hey, Kable...\n\n      DUDE seems to be the most affected by KABLE'S presence -\n      BROTHER is calm, in the moment; TRACE is focused, all\n      business... DUDE is pure FANBOY.\n\n                             HUMANZ DUDE (cont'd)\n                   You're... great.\n\n      HUMANZ BROTHER gives HUMANZ DUDE a look and shakes his head.\n\n<b>                             HUMANZ BROTHER\n</b>                       (to Kable)\n                   You got questions.\n\n<b>                              KABLE\n</b>                   A few.\n\n      He glances over at TRACE.\n\n                             KABLE (cont'd)\n                   She took my blood. Why?\n\n<b>                             HUMANZ DUDE\n</b>                   The nanex modifies the actual cell\n                   structure of your brain...\n<b>                             (MORE)\n</b><b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                 71.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>117   CONTINUED: (2)                                                   117\n</b>                          HUMANZ DUDE (cont'd)\n                we can crack it, but it's not one\n                size fits all; we needed your DNA\n                to generate custom code.\n\n<b>                            KABLE\n</b>                Alright.    Why me?\n\n<b>                          HUMANZ DUDE\n</b>                Because Castle's scared of you.\n\n<b>                          HUMANZ BROTHER\n</b>                It ain't just a game, you know,\n                Tillman. Everyday there's more\n                people steppin forward, wanna be a\n                part of Castle's world. Throwing\n                away everything it means to be\n                human.\n\n<b>                          TRACE\n</b>                Right now it's the desperate\n                ones... convicts, addicts... the\n                sick, the poor... the ones that\n                fell through the cracks... they\n                have no choice.\n\n<b>                          HUMANZ DUDE\n</b>                But this is only the beginning.\n\n<b>                          HUMANZ BROTHER\n</b>                Think about it: the federal prison\n                system is growing out of control,\n                set to bankrupt the whole damn\n                USA... Castle rides in on a white\n                horse, says he got a plan to bail\n                us out and everyone just fall in\n                line.\n\n<b>                          TRACE\n</b>                So what's next? The health care\n                system is collapsing - Castle comes\n                to the rescue again...\n\n<b>                          HUMANZ BROTHER\n</b>                This time he's pushin total control\n                of genetic disease... birth defects\n                a thing of the past... all we gotta\n                do is exchange our cells for the\n                ones he wanna give us.\n\n<b>                          TRACE\n</b>                The promise of a longer life and a\n                fatter wallet - you think people\n                will refuse?\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                    72.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>117   CONTINUED: (3)                                                      117\n</b>\n<b>                             HUMANZ DUDE\n</b>                Hell no.\n\n<b>                          HUMANZ BROTHER\n</b>                They'll be standing in line to hand\n                their babies over to him. Next\n                thing you know, we all slaves.\n\n<b>                          TRACE\n</b>                We can't let that happen.\n\n<b>                          HUMANZ DUDE\n</b>                Gotta bring the man down.\n\n<b>                          TRACE\n</b>                You can help us, Tillman.\n                    (with urgency)\n                You have to help us.\n\n      KABLE takes this in, and starts to WALK AWAY.\n\n<b>                          KABLE\n</b>                I can't help you.\n\n<b>                             HUMANZ BROTHER\n</b>                Tillman.\n\n      KABLE ignores him - he's OUT.        But HUMANZ BROTHER FREEZES him\n      in his tracks:\n\n                          HUMANZ BROTHER (cont'd)\n                We know where she is.\n\n<b>118   INT. FBI INTERROGATION - TIME INDETERMINATE                         118\n</b>\n      SIMON is in a stark interrogation room, alone, drumming his\n      fingers on the table - thumb-to-pinky, pinky-to-thumb. Trying\n      not to show how scared he is.\n\n      The door clicks open and SEVERAL MEN enter. One SITS. We only\n      see them from behind, not their faces; SIMON nods waddup.\n\n      The SEATED MAN pushes several PHOTOS across the table to\n      SIMON. SIMON glances at the top photo as casually as he can\n      manage - it shows SIMON in an MTV TRL-type setting, being\n      interviewed in front of a live audience of teenage girls.\n\n      When AGENT KEITH speaks, he is calm, conversational.\n\n<b>                          AGENT KEITH\n</b>                Guess you remember that day.\n\n      SIMON nods, noncommitally.\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                   73.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>118   CONTINUED:                                                         118\n</b>\n                             AGENT KEITH (cont'd)\n                   You'd just gotten Kable through his\n                   tenth consecutive session alive...\n                   no one ever thought an I-con could\n                   last that long.\n\n      Another photo shows SIMON on a JUMBOTRON posing with his\n      fingers in the camera's face, throwing the motion control\n      hand signal for FIRE and KILL... in another, he's being\n      mobbed at an event, signing an amazing pair of breasts with a\n      black marker.\n\n                             AGENT KEITH (cont'd)\n                   Pretty hot shit, aren't you? King\n                   Player.\n\n<b>                             SIMON\n</b>                   Good times.\n\n<b>                            AGENT KEITH\n</b>                   Sure. On the outside.        Now look at\n                   these.\n\n      A new series of graphic photos show bloody, mangled remains -\n      the aftermath of a slayers session.\n\n                              AGENT KEITH (cont'd)\n                   This is what it's like on the\n                   inside.\n                       (beat)\n                   Wonder how long you'd last on the\n                   other side of the screen.\n\n      This SITS IN THE ROOM for a BEAT - SIMON considers several\n      responses, chooses NONE OF THEM.\n\n                             AGENT KEITH (cont'd)\n                   Simon, you're being held today\n                   suspected of aiding in the escape\n                   of a convicted murderer from a\n                   maximum security penitentiary. The\n                   charge is... beyond serious. Your\n                   hard drives have been seized -\n                   forensics is decrypting the\n                   contents as we speak. Your\n                   internet activity over the last ten\n                   years is being scrutinized and\n                   catalogued in minute, vivid\n                   detail...\n\n      SIMON FLINCHES at this one.\n\n\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                     74.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>118   CONTINUED: (2)                                                       118\n</b>\n                           AGENT KEITH (cont'd)\n                In addition, your father's bank\n                accounts have been frozen pending\n                further investigation - naturally,\n                seeing it was his money that\n                essentially funded Mr. Tillman's\n                escape.\n                    (beat)\n                I'm going to need you to tell me\n                everything that happened leading up\n                to yesterday afternoon. Everyone\n                you talked to, everything you\n                heard, everything you did. I need\n                you to do that... right now.\n\n<b>                          SIMON\n</b>                Yeah, um... I need something too.\n\n<b>                          AGENT KEITH\n</b>                    (ice cold)\n                Do you now? And what might that be?\n\n      SIMON swallows hard.\n\n<b>                          SIMON\n</b>                Could you dudes do a sandwich like:\n                peanut butter, almond butter,\n                walnut butter... pecan butter,\n                pistachio butter... pretty much any\n                kind of, you know, nut butter. And\n                Welch's grape.\n\n      Dead silence. SIMON chews a HANGING CHAD off of a FINGERNAIL.\n\n<b>                          AGENT KEITH\n</b>                Pistachio. They make that?\n\n<b>                          SIMON\n</b>                It's awesome.\n\n<b>                                                         FADE TO BLACK.\n</b>\n<b>119   INT. GORGE'S LIVING ROOM - DAY                                       119\n</b>\n      FAT FINGERS squeeze air.\n\n      ANGIE, in a white tank top and panties, is pulled to 3-D LIFE-\n      SIZE DIMENSIONS on GORGE'S video wall, standing impassively\n      in space.\n\n      A FAT TONGUE wets FAT LIPS.\n\n\n\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                        75.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>119   CONTINUED:                                                              119\n</b>\n      GORGE scrolls through options... hair, clothes, makeup...\n      from slutty to sci-fi to quirky to casual, and back to\n      slutty... as he SELECTS OPTIONS they appear on ANGIE,\n      ROTATING HER in three dimensions to model; she's a living,\n      breathing BARBIE DOLL.\n\n      ORANGE SHERBET HAIR, then a PLATINUM WHITE Judy JETSON\n      PONYTAIL... black CAT-SUIT, DAISY DUKE, Darryl Hannah's PUNK\n      REPLICANT from Blade Runner... he chooses a LOOK and LOCKS IT\n<b>      IN...\n</b>\n      GORGE lifts an OXYGEN MASK to his face and breathes deep...\n      he GOES LIMP in his chair - eyes rolled up in his head, head\n      clocked back to face the ceiling... bathed in sweat... the\n      MASK falls away... and we...\n\n<b>                                                            FADE TO BLACK.\n</b>\n<b>120   EXT. SOCIETY - DAY                                                      120\n</b>\n      ANGIE is on the sidewalk, a little unsteady on high heels -\n      wearing the outfit GORGE CHOSE.\n\n      OTHER PEOPLE are wandering around everywhere. A DEBUTANTE-\n      type in a pink ensemble has a poofy SHITZU on a leash; the\n      SHITZU is PISSING ON IT'S OWNER'S LEG, but she doesn't seem\n      to notice. A TAXI speeds by with FOUR PEOPLE crushed in the\n      back seat having CRAZY ANIMAL SEX. ANGIE starts walking.\n\n      She passes a FAMILIAR FACE, who turns to watch her go,\n      without expression - is that GINA PARKER SMITH?\n\n      ANGIE walks around the corner to a BAR and goes in.\n\n<b>121   INT. THORAX BAR - CONTINUOUS                                            121\n</b>\n      The THORAX BAR is small, intimate, but ULTRA-STYLED... the\n      theme is insect. All manner of exotic bug preserved in\n      glass, suspended in ice... one wall is a giant, black-lit ANT\n      FARM... green, glowing FIREFLIES dart through the air...\n      people lounge on plush seating, gobbling up creatively\n      prepared bug delicacies - FRIED PINK GRASSHOPPERS, fat yellow\n      GRUBS with red chili oil...\n\n      ANGIE takes a seat at the BAR.\n\n<b>                                BARTENDER\n</b>                   The usual?\n\n      She just WINKS, flirtatious.\n\n      The BARTENDER returns a smile and shakes up an AQUA BLUE\n      MARTINI... to finish, he plops in a LIVE, WHITE LARVA...\n\n\n<b>                                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                    76.\n</b><b>                              WHITE KABLE SCRIPT - 9/19/2007\n</b><b>121   CONTINUED:                                                          121\n</b>\n      it curls and twists in the liquid, soaking the alcohol into\n      it's pulp...\n\n      She takes a SIP, letting the LARVA curl around her tongue...\n      swallows it down... as a GUY takes a seat to her left - his\n      hair is shiny, slick black licorice.\n\n<b>                                RICK RAPE\n</b>                   Hi Nika.\n\n<b>                             ANGIE\n</b>                   Oh. Hi. Rick Rape, right?\n\n      In GORGE'S apartment his lips move, ANGIE'S echoing to match.\n\n                             ANGIE (cont'd)\n                   I thought you weren't allowed to\n                   come here anymore.\n\n      RICK RAPE laughs, throwing his head back and slapping his\n      knee - EXAGGERATED.\n\n<b>                             RICK RAPE\n</b>                   That was just last month. I was a\n                   bad boy.\n\n      ANGIE yawns.\n\n<b>                             ANGIE\n</b>                   Are you still a bad boy?\n\n<b>122   INT. ANGIE'S BUILDING, HALLWAY - DAY                                122\n</b>\n      ANGIE EXITS the ELEVATOR on the 3rd floor - a modern,\n      minimalist building... RICK RAPE is with her, close behind.\n\n      They come to an apartment door; RICK RAPE pushes her, from\n      behind, up against the door - VIOLENT... her right hand SLAPS\n      a PALM IDENTIFICATION SENSOR alongside the door and it\n<b>      WHISPERS OPEN.\n</b>\n      ANGIE snaps a heel; they stumble in.\n\n<b>123   INT. ANGIE'S APARTMENT - CONTINUOUS                                 123\n</b>\n      ANGIE'S place is some kind of overdecorated, SCHITZOPHRENIC\n      blend of GIRLIE/GEEKY/PORN. Shafts of NICOTINE SUNLIGHT\n      filter through patterned curtains.\n\n      She crawls along a plush WHITE FUR RUG... RICK RAPE\n      follows... he licks his lips - an automatic gesture - and\n      begins to UNBUTTON HIS PANTS. ANGIE, on her hands and knees,\n      back to him, doesn't even bother to look, until...\n\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                 77.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>123   CONTINUED:                                                       123\n</b>\n<b>                             RICK RAPE\n</b>                   Urkk.\n\n      She TURNS.\n\n      KABLE has RICK RAPE up in the air, holding him like a BARBELL\n      - with one hand CRUSHING HIS THROAT, the other his BALLS. He\n      brings him down over his knee, SNAPPING HIM like a BROKEN BAT\n<b>      - KKRRUNCH.\n</b>\n      ANGIE'S FACE is passive, neutral... but her EYES are NUCLEAR\n      with EMOTION.\n\n      KABLE tosses RICK RAPE'S broken body into the bedroom... then\n      falls to his knees in front of ANGIE and takes her face in\n      his palms, gently - EYES LOCKED INTO HERS.\n\n      GORGE is paralyzed.\n\n<b>                             GORGE/ANGIE\n</b>                   Please don't kill me.\n\n      ANGIE says the words, but they don't match her eyes.     KABLE\n      just shakes his head, trying to grasp the situation.\n\n                             GORGE/ANGIE (cont'd)\n                   I'll do anything.\n\n<b>                             KABLE\n</b>                   Don't say that.\n\n      GORGE holds out his hands; ANGIE'S fingers caress KABLE'S\n      chest and move toward his crotch...\n\n                             KABLE (cont'd)\n                   Stop.\n\n      He pushes her hands away, gently.\n\n                             KABLE (cont'd)\n                   This isn't you.\n\n      ANGIE'S eyes WELL UP with TEARS.\n\n                              KABLE (cont'd)\n                       (trying to contain his\n<b>                        RAGE)\n</b>                   God damn it... YOU - in there...\n                   controlling her... let her talk,\n                   motherfucker.\n\n      GORGE swallows; KABLE is staring straight into his eyeballs.\n\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                 78.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>123   CONTINUED: (2)                                                   123\n</b>\n<b>                             GORGE/ANGIE\n</b>                I can't.\n\n      KABLE buries his face in his hands; it's TEARING HIM UP.\n\n                          GORGE/ANGIE (cont'd)\n                She has to say what I tell her.\n\n      KABLE looks deep into ANGIE'S eyes.\n\n<b>                           KABLE\n</b>                     (almost whispering)\n                You can hear me, baby. I know you\n                can.\n\n      He WIPES AWAY A TEAR from her cheek with his thumb.     After\n      all he's been through he begins to BREAK DOWN.\n\n                          KABLE (cont'd)\n                I love you... love you...\n\n<b>                          GORGE/ANGIE\n</b>                I love you too.\n\n<b>                           KABLE\n</b>                    (snapping)\n<b>                SHUT UP!!!\n</b>\n      He's SCREAMING directly at GORGE, who cowers in his chair as\n      if KABLE were in the room with him.\n\n                          KABLE (cont'd)\n                Say anything else and I'll find\n                you... I'll rip you TO FUCKING\n                PIECES, do you understand me?\n\n      GORGE/ANGIE nods.\n\n                          KABLE (cont'd)\n                    (to ANGIE)\n                I'm getting you out of here.\n\n<b>124   INT. ANGIE'S BUILDING, HALLWAY - DAY                             124\n</b>\n      KABLE pulls ANGIE out the door and down the hall, in tactical\n      mode, WEAPON ready... he heads to the ELEVATOR, punches up a\n      ride. No sign of trouble.\n\n<b>                           KABLE\n</b>                    (quiet)\n                I'm going to take you someplace\n                where they can turn it off... the\n                program...\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                   79.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>124   CONTINUED:                                                         124\n</b>\n      GORGE/ANGIE says NOTHING.       The ELEVATOR DOOR whispers open -\n\n      HACKMAN is standing there with an ASSAULT SHOTGUN.\n\n<b>                              HACKMAN\n</b>                       (friendly)\n                   Hi, Kable.\n\n<b>      BOOM.\n</b>\n      KABLE TAKES IT IN THE CHEST; he's BLOWN OFF HIS FEET, through\n      a wall and into an apartment opposite the ELEVATOR.\n\n      HACKMAN grabs ANGIE'S wrist, drags her onto the ELEVATOR and\n      waits a BEAT, smiling pleasantly. The ELEVATOR DOOR CLOSES.\n\n<b>125   INT. APARTMENT - DAY                                               125\n</b>\n      KABLE is ON HIS BACK in rubble. His chest is a BLACK,\n      SMOKING HOLE... but as the smoke clears we see that his BODY\n      ARMOR has ABSORBED THE BLAST. He's groggy, in excruciating\n      pain, wind knocked out of him - but ALIVE.\n\n      TWO GUYS in GAS MASKS and RUBBER SUITS are watching him from\n      the next room as he attempts to STRUGGLE TO HIS KNEES; KABLE\n      has obviously interrupted something.\n\n<b>126   INT. ELEVATOR - SIMULTANEOUS                                       126\n</b>\n      HACKMAN and ANGIE are having a pleasant ride down, HACKMAN'S\n      hands folded in front of him, patiently; the SHOTGUN - still\n      smoking - shoulder strapped.\n\n<b>                             HACKMAN\n</b>                       (to ANGIE)\n                   Anybody in there?\n\n      The ELEVATOR stops and picks up TWO PASSENGERS: a GIGGLING,\n      NECKING COUPLE. The doors CLOSE.\n\n      HACKMAN gives GORGE/ANGIE a wink and flashes a NINE INCH\n      BOWIE KNIFE, carbon steel, nasty. ANGIE'S eyes go wide with\n      TERROR. The COUPLE is oblivious.\n\n      GORGE can't hold back, the SICK FUCK; he squirms in his\n      chair, sweating buckets, feeling himself up. And when he\n      speaks, ANGIE echoes:\n\n<b>                             GORGE/ANGIE\n</b>                   Come on... do it...\n\n      HACKMAN raises his eyebrows - he wasn't expecting that one...\n      but he OBLIGES. A flex of his shoulder; the NECKING GIRL'S\n      legs buckle under her and she goes down without a peep.\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                  80.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>126   CONTINUED:                                                        126\n</b>\n      The GUY is confused - where'd she go? He looks to ANGIE.\n      HACKMAN headlocks him from behind, and slowly - making eye\n      contact with GORGE/ANGIE the entire time - SNAPS HIS NECK.\n\n      ANGIE'S eyes stream tears; GORGE is in ECSTASY.\n\n      HACKMAN lets the second body DROP, chuckling, as the ELEVATOR\n<b>      DOOR OPENS...\n</b>\n      KABLE is waiting.\n\n<b>127   INT. ANGIE'S BUILDING, LOBBY - CONTINUOUS                         127\n</b>\n      KABLE grabs HACKMAN with both hands, RIPS HIM OUT OF THE\n      ELEVATOR and SLAMS HIM into a WALL. A BRUTAL HEAD-BUTT to\n      the FACE, smashing bone... ANOTHER. HACKMAN'S FACE erupts\n      with BLOOD.\n\n      HACKMAN SWINGS BLIND with the BOWIE KNIFE, once, twice - the\n      blade misses KABLE, backpedaling, by fractions of inches;\n      displacing some SERIOUS AIR... HACKMAN lets it FLY. The\n      BOWIE whistles past KABLE'S FACE and THUNKS into the wall\n      behind him, four inches deep.\n\n      HACKMAN smears the BLOOD from his eyes and brings up the\n      SHOTGUN, but KABLE is quick - instead of trying to move away,\n      HE STEPS IN, pushing the barrel STRAIGHT DOWN as HACKMAN\n      FIRES. The BIG HIT puts a CRATER in the floor and takes out\n      a set of HACKMAN'S toes.\n\n      KABLE kicks the SHOTGUN from HACKMAN'S hands and brings up\n      his own WEAPON to close the deal...\n\n      ... as the GLASS WALLS of the LOBBY EXPLODE.\n\n      MORE SLAYERS are MOVING IN.\n\n      KABLE releases a barrage of cover fire, grabs ANGIE and\n      breaks for the BACK EXIT.\n\n<b>128   EXT. SOCIETY - DAY                                                128\n</b>\n      KABLE and ANGIE hit WHITE HOT DAYLIGHT. A BLUE SLAYER breaks\n      the corner of the building and KABLE FRAGS HIM.\n\n      KABLE grabs ANGIE by the shoulders and yells directly at\n<b>      GORGE:\n</b>\n<b>                              KABLE\n</b><b>                   YOU!   WHERE THE HELL DO WE GO?\n</b>\n      CONTINUOUS SHOT: GORGE/ANGIE starts running across the\n      street, leading the way;\n\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                  81.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>128   CONTINUED:                                                        128\n</b>\n      KABLE takes out another BLUE at a distance, following close\n      behind her. They run into a GENERIC, UNMARKED BUILDING...\n\n<b>129   INT. SOCIETY BUILDING - CONTINUOUS                                129\n</b>\n      ... the SHOT CONTINUES, across the LOBBY, through an\n      anonymous grey door...\n\n<b>130   INT. STAIRS/PINK CORRIDOR                                         130\n</b>\n      ...and down a FLIGHT OF STAIRS... MUFFLED MUSIC is THUMPING,\n      getting LOUDER... down a PINK CORRIDOR and into...\n\n<b>131   INT. UNDERGROUND RAVE - CONTINUOUS                                131\n</b>\n      ... a 24 HOUR UNDERGROUND RAVE, in full effect.\n\n      This thing is FUCKING HUGE... in the DARK it's impossible to\n      tell just how big... hundreds of writhing SOCIETY DUDES,\n      CHICKS and OTHER... DAY-GLO, moving spotlights, strobes...\n      the BUBBLE GIRLS from CRANK make an appearance... along with\n      the DISCOVERY CHANNEL SKATERS from the PARK, now in GOTHED-UP\n<b>      GEAR...\n</b>\n      KABLE gathers it all... he takes ANGIE'S arm and begins to\n      wade through the CHAOS... the BLOOD SPATTERS on his face POP\n      in sharp, inverse DAY-GLO, like HARTIGAN'S SCAR in SIN\n<b>      CITY...\n</b>\n      A SKATER GIRL takes a hold of the glowing, smoking barrel of\n      KABLE'S WEAPON and starts to SKATE CIRCLES around him, ring-\n      around-the-rosie... he wrenches it hard, sending her flying\n      into a crowd that goes down like BOWLING PINS.\n\n      They continue MOVING... KABLE happens to notice RED LASERS\n      moving through the DARK... probing... RAVE LIGHTS? No...\n\n<b>      THOOM.   THOOM THOOM.\n</b>\n      LIGHTNING FLASHES, EXPLOSIONS... a RAVER nearby\n      disintegrates, BLOOD and GUTS a DAY GLO VOLCANO.      DANCERS\n      slip and FALL ON THEIR ASSES in the viscera.\n\n      The SLAYERS are moving thru the RAVE, hunting. Everyone but\n      KABLE and ANGIE are so out of it they don't even notice.\n\n<b>                             KABLE\n</b>                       (to GORGE)\n                   You. Run.\n\n      ANGIE runs.\n\n      KABLE goes COMMANDO, evading the HUNTERS, ducking under\n      EXPLODING SHIT... he moves to FLANK them...\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                 82.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>131   CONTINUED:                                                       131\n</b>\n      the DJ is DECAPITATED by a stray 50 caliber round but the\n<b>      GROOVE DON'T STOP...\n</b>\n      LIGHTNING STRIKES FREEZE the ACTION as KABLE engages the\n      BLUES, one by one... he takes out THREE of them with CLOSE\n      RANGE BLASTS and another HAND-TO-HAND-TO-HEADSNAP - then\n      notices more BLUES moving in... too many...\n\n      He catches up to ANGIE and they make for an EXIT, any EXIT...\n\n<b>132   INT. RAVE - LOUNGE AREA                                          132\n</b>\n      They find CURTAINS, run past freaky CHILL LOUNGES and SMOKE\n      OUT ROOMS... KABLE blows a hole in a locked maintenance door\n      and they duck out of RAVE WORLD into...\n\n<b>133   INT. RAVE - INDUSTRIAL CONCRETE CORRIDOR                         133\n</b>\n      ...an industrial CONCRETE CORRIDOR... MUFFLED BLASTS,\n      SCREAMING in the REAR SURROUNDS tell KABLE the BLUES are\n      close behind... up more stairs, they SLAM through a SERVICE\n      DOOR and back into...\n\n<b>134   EXT. SOCIETY - DAY, CONTINUOUS                                   134\n</b>\n      ... blinding DAYLIGHT.\n\n      A SCOOBY DOO-looking VAN pulls up to the CURB in front of\n      them; the back doors SWING OPEN.\n\n<b>                             GINA PARKER SMITH\n</b>                   I can get you out.\n\n      Not much choice. KABLE and ANGIE climb in. The ELECTRIC VAN\n      drives quietly away, attracting no attention.\n\n<b>135   INT. VAN - CONTINUOUS                                            135\n</b>\n      KABLE slumps against the wall of the VAN, cradling ANGIE in\n      his arms - exhausted. ANGIE'S eyes are POST-TRAUMATIC,\n      searching.\n\n      GINA is PUMPED.\n\n<b>                             GINA PARKER SMITH\n</b>                   I can't believe it's you. This\n                   is...\n                       (gathering herself)\n                   Listen: you can trust me, Kable.\n\n<b>                             KABLE\n</b>                       (quietly)\n                   If not...\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                        83.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>135   CONTINUED:                                                              135\n</b>\n      He looks her straight in the eye.\n\n                             KABLE (cont'd)\n                   You're dead.\n\n      GINA pales. He's not lying.\n\n<b>                                                            FADE TO BLACK.\n</b>\n<b>136   INT. HUMANZ HEADQUARTERS, BACK ROOM - TIME INDETERMINATE                136\n</b>\n      CLOSE-UP: a LANCET is prepared... it PUNCTURES SKIN and\n<b>      SUCKS.\n</b>\n      ANGIE is lying on a      black leather couch, unconscious -\n      breathing deeply...      TRACE pops the LANCET out of ANGIE'S\n      fingertip and plops      a RED DROP into a glass tube of liquid.\n      KABLE kneels beside      ANGIE, stroking her hair.\n\n      HUMANZ DUDE, HUMANZ BROTHER and GINA PARKER SMITH are all\n      there.\n\n<b>                               KABLE\n</b>                   Now what?\n\n<b>                             HUMANZ DUDE\n</b>                       (shrugs)\n                   The crack works - you're the\n                   proof... we put the DNA in the\n                   soup, light it up, extract it -\n                   then feed my girl's sequence into\n                   the code and we're good to go.\n\n<b>                             GINA PARKER SMITH\n</b>                       (thinking out loud)\n                   It's an anti-spyware program.\n\n<b>                             HUMANZ DUDE\n</b>                   Basically. We can't quarantine the\n                   foreign cells per se but we can\n                   disable their ability to transmit\n                   and receive.\n\n      GINA'S not buying this I.T. GUY shit.\n\n<b>                             GINA PARKER SMITH\n</b>                   Fuck that. I'd make you cut it out\n                   of me.\n\n      TRACE gives her a glance: dumb bitch.\n\n<b>                             TRACE\n</b>                   That would be like cutting out part\n                   of your brain.\n<b>                             (MORE)\n</b><b>                                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                    84.\n</b><b>                              WHITE KABLE SCRIPT - 9/19/2007\n</b><b>136   CONTINUED:                                                          136\n</b>                             TRACE (cont'd)\n                   The nanocells replace the cells\n                   they replicate... they become you.\n\n      GINA has no answer.\n\n<b>                             KABLE\n</b>                   How long will she sleep?\n\n<b>                             TRACE\n</b>                   We're going to have to keep her\n                   sedated until we can kill the\n                   link... otherwise she's\n                   broadcasting everything she sees or\n                   hears.\n\n<b>                             HUMANZ DUDE\n</b>                   Thirty minutes... you give us a\n                   robot, we give you back a super hot\n                   human.\n\n      TRACE rolls her eyes.\n\n<b>                                HUMANZ BROTHER\n</b>                   Tillman.\n\n      KABLE looks.\n\n                             HUMANZ BROTHER (cont'd)\n                   We need to talk, my man.\n\n<b>                                KABLE\n</b>                   So talk.\n\n<b>                                HUMANZ BROTHER\n</b>                   Come on.\n\n<b>                                                               CUT TO:\n</b>\n<b>137   INT. HUMANZ HEADQUARTERS - MOMENTS LATER                            137\n</b>\n      Primitive, 8-BIT ARCADE DEMO SCREENS: missiles obliterate a\n      city in MISSILE COMMAND, line-vector TANKS track 3D targets\n      in BATTLEZONE, etc.\n\n<b>                             HUMANZ BROTHER (V.O.)\n</b>                   Ken Castle made his first billion\n                   designing virtual reality\n                   simulators for the US military.\n                   Six years ago he brought them\n                   something new - a breakthrough so\n                   profound, he said, that history\n                   would be divided up between\n                   everything before and everything\n                   that came after.\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                 85.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>137   CONTINUED:                                                       137\n</b>\n      HUMANZ BROTHER and KABLE walk through the DARK ARCADE, past\n      rows of machines... the lights and patterns of 8-BIT DEMO\n      SEQUENCES and HI SCORE SCREENS flash across their faces.\n\n                             HUMANZ BROTHER (cont'd)\n                   They tested it on soldiers... the\n                   first volunteer was Corporal Travis\n                   Scotch - a friend of yours, I\n                   believe.\n\n      They stop.\n\n<b>                             KABLE\n</b>                   Yeah. He was.\n\n<b>                             HUMANZ BROTHER\n</b>                   The second was you.\n\n      KABLE fights difficult memories.\n\n<b>                             KABLE\n</b>                   The idea was to replace your brain,\n                   bit by bit, cell by cell,\n                   gradual... the new tissue would\n                   never break down, never\n                   deteriorate.\n                       (bitter)\n                   A new era in human longevity is\n                   what they told us. We were doing\n                   the world a favor.\n\n<b>                              HUMANZ BROTHER\n</b>                       (nods)\n                   Nine weeks later Scotch was dead\n                   and you were serving life in\n                   maximum. Castle's project was shut\n                   down... but the shit wasn't a total\n                   loss: the same technology\n                   resurfaced within a year... in a\n                   game. Castle called it society.\n\n<b>                             KABLE\n</b>                   Thank you for the history lesson.\n\n<b>                             HUMANZ BROTHER\n</b>                   Dig me, Tillman. Whatever happened\n                   in that project is something Castle\n                   wanna be buried. We need that shit,\n                   baby: what you saw, what you know.\n\n<b>                             KABLE\n</b>                   I don't know what to tell you.\n\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                    86.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>137   CONTINUED: (2)                                                      137\n</b>\n<b>                           HUMANZ BROTHER\n</b>                You ain't gotta tell me shit,\n                Tillman.\n                    (beat)\n                I want you to show me.\n\n<b>138   INT. HUMANZ HEADQUARTERS, BACK ROOM - TIME INDETERMINATE            138\n</b>\n      Slow PUSH IN on unconscious ANGIE. We hear TRACE interacting\n      with HUMANZ TECHS off-CAMERA as a heart monitor BEEPS\n      steadily.\n\n<b>                          TRACE (O.C.)\n</b>                Alright. We're ready to rock.\n\n      A sequence is punched in on a keyboard.\n\n                          TRACE (O.C.),(cont'd)\n                Let's transmit in three... two...\n                one...\n\n<b>      CLICK.\n</b>\n      With a GASP, ANGIE'S EYES SNAP OPEN.\n\n<b>                                                         MATCH CUT TO:\n</b>\n<b>139   INT. GORGE'S LIVING ROOM - NIGHT, SIMULTANEOUS                      139\n</b>\n      GORGE'S EYES SNAP OPEN. He SPAZZES OUT like a turtle on it's\n      shell, a moment of panic - he's been PASSED OUT in his chair\n      and doesn't immediately know where he is. He looks around the\n      DARK ROOM nervously; takes a hit of OXYGEN.\n\n      On the SCREEN, society is gone - there is only a nebulous\n<b>      TEST PATTERN.\n</b>\n      Behind him, a SOUND.\n\n<b>                          GORGE\n</b>                Hooz there?\n\n      He runs his hand along the CHAIR'S TRACKBALL CONTROL, it\n      SPINS around and rolls forward a bit.\n\n      CASTLE'S GEEK SQUAD is standing in the room, silhouettes in\n      the dark - scary.\n\n                           GORGE (cont'd)\n                     (freaked)\n                What are you doing here? Who are\n                you?\n\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                        87.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>139   CONTINUED:                                                              139\n</b>\n<b>                             GEEK LEADER\n</b>                   Tech support.\n\n<b>                                                            FADE TO BLACK.\n</b>\n<b>140   INT. HUMANZ HEADQUARTERS, TECH ROOM - NIGHT                             140\n</b>\n      A screen glitches - pixellated, fucked up, highly compressed,\n      like an internet feed through a busted satellite. We begin\n      to make out a coherent image:\n\n      It is a POV, walking, of an industrial corridor.            Cameras\n      mounted and doors with square glass windows.\n\n      We back away from the screen to reveal -\n\n      HUMANZ DUDE, HUMANZ BROTHER and GINA PARKER SMITH are\n      watching the image on a LO-FI computer monitor. HUMANZ DUDE\n      runs his fingers along a touchpad, MOVING FREQUENCIES around\n      on a WAVEFORM MONITOR, trying to dial the picture in better.\n\n      We see KABLE through an OBSERVATION WINDOW, slumped over in a\n      chair... DREAMING? Or just CONCENTRATING?\n\n<b>                             GINA PARKER SMITH\n</b>                   What are we looking at?\n\n<b>                             HUMANZ BROTHER\n</b>                   His memories... translated as raw\n                   audiovisual data.\n\n<b>                             GINA PARKER SMITH\n</b>                   I read something about this. But\n                   that tech is supposed to be a\n                   decade away...\n\n      HUMANZ DUDE smirks, shakes his head.\n\n<b>                             HUMANZ DUDE\n</b>                   Current exponential rate of growth,\n                   I can't imagine a piece of tech\n                   that will take that long to come\n                   around.\n\n      He bangs on a key, beating up the interface.\n\n                             HUMANZ DUDE (cont'd)\n                   They'll have better shit than this\n                   in Best Buy within 18 months.\n\n<b>141   INT. MILITARY FACILITY - TIME INDETERMINATE                             141\n</b>\n      KABLE - younger, in UNIFORM - walks down a sterile corridor.\n      He is dead calm, emotionless.\n\n<b>                                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                        88.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>141   CONTINUED:                                                              141\n</b>\n      Tiny SURVEILLANCE CAMERAS track his movements.            He comes to a\n      DOOR; it whispers open and he STEPS IN.\n\n<b>142   INT. MILITARY FACILITY, DEBRIEFING ROOM - CONTINUOUS                    142\n</b>\n      A WHITE, MINIMAL ROOM - TABLE, TWO CHAIRS. We may recognize\n      it from the VIDEO the humanz sent to SIMON. In one chair: a\n      MAN, 30s, beard and mustache grown out thick; in UNIFORM.\n      KABLE sits down in the other.\n\n<b>                             SCOTCH\n</b>                   Tillman. Never thought I'd be so\n                   glad to see your ugly grille.\n\n<b>                               KABLE\n</b>                   Scotch.\n\n<b>                             SCOTCH\n</b>                       (mimicking him)\n                   Scotch.\n                       (back in character)\n                   I'll tell you what man: this place\n                   sucks.\n\n<b>                                                                  CUT TO:\n</b>\n<b>143   INT. HUMANZ HEADQUARTERS, TECH ROOM - SIMULTANEOUS                      143\n</b>\n      On the COMPUTER SCREEN: SCOTCH gestures to indicate the WHITE\n      ROOM, the FACILITY...\n\n<b>                             SCOTCH\n</b>                       (to KABLE, grinning)\n                   They got me hooked up to computers\n                   five hours a day... nurses feeding\n                   me vitamins, giving me shots,\n                   wiping my butt - male nurses, I\n                   might add...\n\n<b>                                                              CUT BACK TO:\n</b>\n<b>144   INT. MILITARY FACILITY, DEBRIEFING ROOM - CONTINUOUS                    144\n</b>\n      SCOTCH chuckles, conspiratorial.\n\n<b>                             SCOTCH\n</b>                   What about you? You're dressed like\n                   a semi-human being... they let you\n                   out already?\n\n      KABLE'S response doesn't match SCOTCH'S energy - he's bland,\n      generic.\n\n\n\n<b>                                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                         89.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>144   CONTINUED:                                                               144\n</b>\n<b>                             KABLE\n</b>                   I'm not getting out.\n\n<b>                               SCOTCH\n</b>                         (confused)\n<b>                   OK.\n</b>                       (beat)\n                   Tillman... dude. Are you good?\n\n<b>                                KABLE\n</b>                   I'm fine.\n\n<b>                             SCOTCH\n</b>                   Uh huh. You don't look good.\n\n<b>                                KABLE\n</b>                   I'm sorry.\n\n      KABLE'S \"sorry\" seems to refer to something only KABLE knows.\n\n<b>                             SCOTCH\n</b>                       (hesitant, making light)\n                   Well, it's not like you ever looked\n                   that good...\n\n      A BEAT.   SCOTCH is suddenly conscious of the SURVEILLANCE.\n\n      KABLE'S eyes flicker away from SCOTCH'S. He calmly removes\n      his military issue .45 from it's holster and lets it rest on\n      the table between them. He stares at it intensely, emotion\n      starting to seep through the icy lines of his face.\n\n                             SCOTCH (cont'd)\n                       (quietly)\n                   Tillman, what did they do to you?\n\n<b>145   INT. HUMANZ HEADQUARTERS, TECH ROOM - CONTINUOUS                         145\n</b>\n      The IMAGE on the SCREEN begins to BREAK UP.             Hard to make\n      out...\n\n<b>                             GINA PARKER SMITH\n</b>                   What's happening?\n\n      HUMANZ BROTHER holds up a finger: shhh.\n\n      Through the OBSERVATION WINDOW we see present-day KABLE jerk\n      and spasm in the chair.\n\n<b>146   INT. MILITARY FACILITY, DEBRIEFING ROOM - CONTINUOUS                     146\n</b>\n      KABLE starts to shake; the gun rattles on the table top. A\n      bead of sweat creeps down his forehead. It's apparent that\n      he is locked in a paralyzing internal struggle...\n\n<b>                                                                   (CONTINUED)\n</b><b>\n</b><b>                                                                               90.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>146   CONTINUED:                                                                     146\n</b>\n      A low hum in the room starts to swell and throb, numbing,\n      disorienting...\n\n<b>                              SCOTCH\n</b>                       (freaked)\n                   Tillman...\n\n      It seems to take all of KABLE'S strength to answer.                His\n      voice is halting, human - not robotic like before.\n\n<b>                             KABLE\n</b>                   I can't stop it... can't...\n\n      KABLE'S eyes meet SCOTCH'S; they are red, rimmed with tears.\n\n<b>                             SCOTCH\n</b>                   Who are you?\n\n<b>                                                                    CUT TO:\n</b>\n<b>147   INT. SURVEILLANCE ROOM - SAME TIME                                             147\n</b>\n      We punch in on a wall of TWO WAY GLASS behind SCOTCH,\n      pixellated visual noise resolving to murky detail as we move\n      in - we punch through the glass to reveal a familiar\n      silhouette -\n\n      CASTLE brings up his hand, miming a gun.              He smiles.\n\n<b>                                                                    CUT TO:\n</b>\n<b>148   INT. MILITARY FACILITY, DEBRIEFING ROOM - SAME TIME                            148\n</b>\n      KABLE BRINGS UP THE GUN, points it at SCOTCH'S forehead...\n      SCOTCH is too stunned to react.\n\n<b>                             KABLE\n</b>                   I'm sorry...\n\n<b>      KABLE SCREAMS -\n</b>\n      CUT TO the SILENT, fixed SURVEILLANCE CAM FOOTAGE that humanz\n      sent to SIMON: KABLE pulls the trigger, SOUNDLESS. SCOTCH\n      falls over. Black blood pools.\n\n<b>149   INT. HUMANZ HEADQUARTERS, TECH ROOM - CONTINUOUS                               149\n</b>\n      The humanz monitor GOES DEAD.\n\n<b>                             HUMANZ DUDE\n</b>                   Not the best commercial for K-soft\n                   technology.\n\n\n\n<b>                                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                   91.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>149   CONTINUED:                                                         149\n</b>\n      GINA PARKER SMITH is practically moist, visions of monster\n      ratings dancing in her head.\n\n<b>                             GINA PARKER SMITH\n</b>                   You can say that again.\n\n<b>                             TRACE\n</b>                       (bitter)\n                   He made him do it.       Castle made him\n                   do it.\n\n<b>                               HUMANZ BROTHER\n</b>                   A test.\n\n      Everyone's eyes had been glued to it - now they look up,\n      through the OBSERVATION WINDOW...\n\n      The room is empty.       The CHAIR is knocked over on the floor;\n      KABLE is gone.\n\n<b>150   INT. HUMANZ HEADQUARTERS - MOMENTS LATER                           150\n</b>\n      KABLE is slumped against concrete, on his knees... RELIVING\n      THE MURDER has knocked the hell out of him, but he's DEALING\n<b>      WITH IT.\n</b>\n      A pair of SKINNY LEGS walk up and kneel next to him: ANGIE.\n\n      He touches her face, looks deep into her EYES - they are wet\n      with emotion.\n\n<b>                               KABLE\n</b>                   It's you.\n\n      She just NODS.    They embrace... finally, for real.\n\n<b>                             ANGIE\n</b>                   I missed you... so much...\n\n<b>                             KABLE\n</b>                       (softly)\n                   Delia.\n\n      ANGIE says nothing, just holds him tighter. KABLE pushes her             *\n      hair back - he searches her eyes, desperate with emotion.                *\n\n                             KABLE (cont'd)\n                   Baby... what did they do?                                   *\n\n<b>                             ANGIE                                             *\n</b>                   I couldn't stop them.                                       *\n\n      ANGIE shakes her head, won't meet his eyes.\n\n\n<b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                    92.\n</b><b>                              WHITE KABLE SCRIPT - 9/19/2007\n</b><b>150   CONTINUED:                                                          150\n</b>\n<b>                             TRACE (O.C.)\n</b>                   Nobody could.                                                *\n\n      KABLE turns to FACE HER.                                                  *\n\n                             TRACE (cont'd)\n                   Your daughter was taken into foster\n                   care by the state two years ago.\n\n      KABLE tries to understand...                                              *\n\n                             TRACE (cont'd)\n                   The foster parent paid good money\n                   to remain anonymous... to make sure\n                   the girl would be untraceable. But\n                   there's always a data trail, if you\n                   know where to look.\n                       (shrugs)\n                   We do.\n\n      KABLE is gathering himself, focusing... a FURY building.\n\n<b>                             KABLE\n</b>                   Where is she?\n\n<b>                             TRACE\n</b>                   I'm sorry, Tillman. Guess he needed\n                   an insurance policy.\n                       (long BEAT)\n                   She's with Castle.\n\n<b>                                                               CUT TO:\n</b>\n<b>151   EXT. NYC STREET - NEAR HUMANZ ALLEY - NIGHT                         151\n</b>\n      KABLE slams through CROWDS - he's on a mission. The ALLEY\n      leading to the UNDERGROUND HEADQUARTERS is right around the\n      corner.\n\n<b>                                GINA PARKER SMITH\n</b>                   Tillman!\n\n      GINA fights to catch up to him. She gets a hand on his\n      shoulder... he SPINS.\n\n                             GINA PARKER SMITH (cont'd)\n                       (out of breath)\n                   Wait. I want to come with you.\n\n      KABLE'S eyes leave no room for doubt: not a chance.\n\n<b>                             KABLE\n</b>                   That's all the story you're going\n                   to get.\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                                 93.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>151   CONTINUED:                                                       151\n</b>\n      He BAILS, leaving her there.\n\n      JUST THEN: matching BLACK SUVs pull up to the curb just TEN\n      FEET from where she stands.\n\n      CASTLE'S GEEK SQUAD piles out... GINA sees them, recognizes\n      them from the interview with CASTLE; she TURNS AWAY just in\n      time to avoid being recognized by a GEEK as he scans the\n      crowd.\n\n      But they're not after her... they head straight for the\n<b>      ALLEY.\n</b>\n<b>                                                            CUT TO:\n</b>\n<b>152   INT. CELL - TIME INDETERMINATE                                   152\n</b>\n      BLACK. A door opens, a switch is thrown... and SIMON is\n      blinded by harsh fluorescent light. He sits up on a cot,\n      wearing a white T-shirt and pajama pants; fucked up hair,\n      groggy. He BELCHES.\n\n<b>                             AGENT KEITH (O.C.)\n</b>                   Alright, Silverton. Get up and get\n                   out.\n\n<b>                             SIMON\n</b>                   Cool.\n\n<b>                             AGENT KEITH\n</b>                       (sarcastic)\n                   Yeah, ain't it? Looks like someone\n                   up the chain decided you're no\n                   longer a threat.\n\n<b>                                                            CUT TO:\n</b>\n<b>153   INT. SIMON'S ROOM - TIME INDETERMINATE                           153\n</b>\n      SIMON slides open the door to his room, peaks inside\n      hesitantly.\n\n      It's TRASHED. The FLOOR is littered with busted up\n      electronics and garbage. The wall-sized screens are all\n      running the same thing - a SINGLE WORD, repeated in columns,\n      by the thousands - scrolling fast, a digital waterfall of\n      words, white on black:\n\n<b>                                      CHEATER\n</b>\n      It's over.\n\n      SIMON sits down in the middle of the detritus, in a state of\n      mild SHOCK - he's LOST EVERYTHING.\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                                           94.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>153   CONTINUED:                                                                 153\n</b>\n      He gestures at the screen and closes out the SCROLLING\n      LOOP... then once again, attempting to activate SLAYERS\n      control; the screen shows the same nebulous TEST PATTERN we\n      last saw on GORGE'S screen.\n\n<b>                             FEMALE VOICE\n</b>                   No link... no link.\n\n      SIMON slumps against the wall, DEFEATED.\n\n<b>                                                              FADE TO BLACK.\n</b>\n<b>154   EXT. CASTLE ESTATE - NIGHT                                                 154\n</b>\n      CASTLE'S ESTATE is like a DESERTED CITY.\n\n      Balconies, underlit DOMES, lush landscaping, abstract\n      statues, waterfalls... tiny cameras everywhere... and not a\n      soul in sight.\n\n      KABLE drops over a wall and onto grass.               Wind in the leaves,\n      cricket music - otherwise DEAD SILENCE.\n\n      He keeps to the trees, making his way toward the central\n<b>      MANSION.\n</b>\n      THEN: the sound of DOGS... they come in a PACK, loping across\n      the lawn - grey, more like WOLVES...\n\n      KABLE readies his gun to take them out - but the DOGS run\n      RIGHT PAST HIM. They round a corner and DISAPPEAR. Weird.\n\n      KABLE looks up, spots a CAMERA... and another, and another...\n      stands to reason he's been MARKED already.\n\n      He walks out INTO THE OPEN.\n\n<b>155   INT. CASTLE'S MANSION - NIGHT                                              155\n</b>\n      The GIANT FRONT DOORS of the MANSION are OPEN.              KABLE walks\n      right in.\n\n      The interior is HUGE... and EMPTY. NO FURNITURE, no art; no\n      people of course. Could anyone possibly live here?\n\n      He explores...\n\n<b>156   INT. CASTLE'S MANSION - EMPTY HALL - NIGHT                                 156\n</b>\n      AND THEN - at the FAR END of a large, empty HALL:\n\n      A LITTLE GIRL, 5 - is sitting on the floor by herself,\n      playing with DOLLS, making them walk and talk.\n\n\n<b>                                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                    95.\n</b><b>                              WHITE KABLE SCRIPT - 9/19/2007\n</b><b>156   CONTINUED:                                                          156\n</b>\n      KABLE'S eyes go wide.        He starts to walk toward her, slowly\n      at first...\n\n<b>                                KABLE\n</b>                   Delia...\n\n      ... and finally breaking into a run - until:\n\n      He SLAMS into what seems to be an INVISIBLE WALL, crumpling\n      to the ground. The GIRL doesn't react. KABLE pounds on the\n      glass...\n\n                                KABLE (cont'd)\n<b>                   DELIA!\n</b>\n      ... then looks closer, running his fingers across the SMOOTH\n<b>      SURFACE.\n</b>\n<b>                             KEN CASTLE (O.S.)\n</b>                   Not bad for video, eh?\n\n      The VOICE comes from UNSEEN SPEAKERS; it seems to be\n      everywhere at once, intimate.\n\n                             KEN CASTLE (O.S.) (cont'd)\n                   The latest and greatest... defy you\n                   to tell it from real life. You\n                   imagine porn on this thing?\n\n      KABLE wants to EXPLODE - but he contains himself. He's\n      playing CASTLE'S GAME, and the RULES are still UNDEFINED.\n\n      Then - MUSIC: The SOUND of a SWINGIN' HI-HAT from down a long\n      corridor -\n\n      t - t - tssss, t - t - tssss, t - t - tsss...\n\n      KABLE walks toward the source; a bass and piano pick up the\n      groove.\n\n<b>157   INT. CASTLE'S MANSION, BALLROOM - CONTINUOUS                        157\n</b>\n      He comes to a BALLROOM - empty, like everything else; shiny\n      hardwood floor for DANCING.\n\n      A SPOTLIGHT pops on from above, illuminating KEN CASTLE.\n      He's wearing a T-SHIRT and JEANS. Every instinct tells KABLE\n      to go after him - but he holds back. Who knows if it's even\n      real? And then CASTLE starts to SING...\n\n      ... or more precisely, LIP SYNC - the VOICE is SINATRA, I've\n      Got You Under My Skin... CASTLE is doing a spot-on KARAOKE:\n\n      I've got you under my skin\n\n<b>                                                               (CONTINUED)\n</b><b>\n</b><b>                                                              96.\n</b><b>                        WHITE KABLE SCRIPT - 9/19/2007\n</b><b>157   CONTINUED:                                                    157\n</b>\n      I've got you deep in the heart of me\n      So deep in my heart, that you're really a part of me\n      I've got you under my skin...\n\n      He's snapping his fingers, putting on the moves... THEN -\n      from behind curtains - a half dozen SLAYERS appear. We\n      RECOGNIZE THE SCARRED, BATTLE-TOUGH FACES from the prison,\n      the game, the pursuit... only instead of BLUE, they are\n      wearing TUXEDOES with BLUE BOW-TIES.\n\n      KABLE grips his weapon, but the men are UNARMED; instead,\n      they fall in on the beat and go into a CHOREOGRAPHED DANCE\n      behind CASTLE...\n\n      I'd sacrifice anything come what might\n      For the sake of having you near\n      In spite of a warning voice that comes in the night\n      And repeats, and repeats in my ear...\n\n      KABLE notices SHADOWY FIGURES around the perimeter of the\n      room... glasses, beards, pony tails - silently, the GEEK\n      SQUAD has moved in and taken position. They move their hands\n      in rhythm, synchronized... each one seems to control a\n      DANCER: they TWIRL A FINGER and the SLAYER SPINS... kick\n      with TWO FINGERS FOR LEGS and the SLAYER KICKS like a\n<b>      ROCKETTE.\n</b>\n      Suddenly, ON A MUSICAL HIT, everyone - CASTLE, the GEEKS, the\n      SLAYERS - points dramatically up at the wall, where a VIDEO\n      SCREEN BEGINS TO PLAY: it is footage of the GEEK SQUAD\n      busting into humanz headquarters and EFFICIENTLY KILLING\n      EVERYONE. ANGIE is tasered unconscious and dragged away.\n\n      Don't you know, little fool, you never can win?\n      Use your mentality, wake up to reality...\n      But each time I do just the thought of you makes me STOP -\n      before I give in\n      Cause I've got you, under my skin...\n\n      KABLE hits his breaking point. He brings up his WEAPON to\n      open up on the SLAYERS... CLICK. It's DEAD. The GEEKS have\n      taken care of that.\n\n      KABLE tosses it aside and sprints for CASTLE, but the SLAYERS\n      break off from the choreography to ENGAGE HIM; turns out\n      they're flesh and blood after all.\n\n      CASTLE backs away, whistling the melody, and continues his\n      SOFTSHOE to the music as KABLE wades into brutal hand-to-hand\n      combat... breaking necks, snapping arms, smashing faces...\n      it's a full-on BALLET OF DEATH... finally, THE MUSIC ENDS,\n      right on cue: KABLE is finishing off the last of the men,\n      blood on his hands.\n\n\n<b>                                                         (CONTINUED)\n</b><b>\n</b><b>                                                                       97.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>157   CONTINUED: (2)                                                         157\n</b>\n      CASTLE applauds; the GEEKS follow suit.\n\n<b>                          KEN CASTLE\n</b>                    (genuinely stoked)\n                You're awesome.\n\n<b>                            KABLE\n</b>                Castle.\n\n<b>                            KEN CASTLE\n</b>                Kable.\n\n      They speak simultaneously:\n\n<b>                  KABLE                               KEN CASTLE\n</b>      I don't care about you.               You don't care about me.\n\n                          KEN CASTLE (cont'd)\n                ... you just want your little sugar\n                pie, I know. So don't do anything\n                stupido. My house, my rules.\n\n      CASTLE walks away, leaving his back open to KABLE seemingly\n      without concern, toward a side door.\n\n                           KEN CASTLE (cont'd)\n                Come on, I want to show you\n                something.\n\n<b>158   INT. CASTLE'S MANSION, HALLWAY - CONTINUOUS                            158\n</b>\n      Tracking along the hallway, MEDIUM CLOSE, profile:\n\n      CASTLE walks along, confidently, KABLE following. The\n      background is a black, glittering STARSCAPE.\n\n<b>                          KEN CASTLE\n</b>                I've got to thank you for leading\n                me to them, by the by - the human-\n                zuzz that is...\n\n      Snap out WIDE: the hallway seems to run along the SURFACE OF\n      THE MOON - another 3-D projection, no doubt. CRATERS and\n      LUNAR DEBRIS stretch to the horizon. The GEEK SQUAD walks\n      along behind CASTLE and KABLE at a distance... they are all\n      tiny MOON ANTS in the vast lunar panorama... the PLANET EARTH\n      rising majestically in the dark heavens.\n\n                          KEN CASTLE (cont'd)\n                Of course, soon enough they'd be\n                whistling my tune like everybody\n                else... but meantime it was that\n                little cracker program they dreamed\n                up that got my attention...\n<b>                          (MORE)\n</b><b>                                                              (CONTINUED)\n</b><b>\n</b><b>                                                                      98.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>158   CONTINUED:                                                            158\n</b>                             KEN CASTLE (cont'd)\n                   that was a genuine nuisance, no\n                   doubt about it... One thing even\n                   they didn't know, though: I'm wired\n                   too.\n\n      SNAP back to CASTLE, MEDIUM       CLOSE.     His eyes are FUCKING\n<b>      CRAZY.\n</b>\n                             KEN CASTLE (cont'd)\n                   I replaced 98% of my own noodle\n                   with nano-tissue years ago...\n\n<b>159   INT. CASTLE'S COURT - CONTINUOUS                                      159\n</b>\n      They leave the hallway and step on to an indoor, NBA\n      regulation BASKETBALL COURT; electronic scoreboard,\n      bleachers, the whole nine. It's dark, moody - only one bank\n      of OVERHEAD FLOODS is turned on.\n\n      At the FAR END of the COURT, HACKMAN is in WARM-UPS, shooting\n      baskets. ONE leg - the one with the ABBREVIATED TOES - is in\n      a FLEX BRACE.\n\n      The GEEK SQUAD grabs seats in the BLEACHERS.\n\n<b>                             KEN CASTLE\n</b>                   But mine's different.\n                       (taps his FOREHEAD)\n                   Built to send - to transmit .\n                   Whereas every other K-soft cell out\n                   there - including the ones in...\n                       (taps KABLE'S forehead )\n                   your head, Kable - is designed to\n                   receive. I think it, you do it.\n\n      CASTLE looks across the court at HACKMAN; nods toward him...\n      HACKMAN drops the ball and begins to POP LOCK.\n\n                             KEN CASTLE (cont'd)\n                   We're talking every Slayer,\n                   everyone in Society City... I\n                   believe your better half would fall\n                   under that category... provided\n                   they're within range of my\n                   transmitters...\n\n      CASTLE chuckles at HACKMAN; HACKMAN stops dancing, jogs over,\n      picks up the ball and resumes shooting.\n\n<b>                             KABLE\n</b>                       (sarcastic)\n                   Very nice, Castle. So you've got an\n                   army of psychotics and deviants to\n                   dance around for you.\n\n<b>                                                                (CONTINUED)\n</b><b>\n</b><b>                                                                 99.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>159   CONTINUED:                                                       159\n</b>\n      CASTLE narrows his eyes, amusement edging out irritation; he\n      walks over to a bin of GRIP POWDER.\n\n<b>                             KEN CASTLE\n</b>                   You're thinking small, Kable. But\n                   not as small as me.\n\n      He sinks his hands into the POWDER, brings them out and\n      CLAPS, making WHITE DUST CLOUDS. KABLE waves the dust AWAY\n<b>      FROM HIS FACE.\n</b>\n                             KEN CASTLE (cont'd)\n                   See, nano cells are real small, a\n                   thousand times smaller than even\n                   these dust particulates...\n                       (KABLE coughs)\n                   Inhale it and they go to work:\n                   replicating, spreading... like a\n                   virus, multiplying in\n                   exponentials... six months time I\n                   could have 100 million people\n                   converted - ditch diggers, porn\n                   stars, presidents - and not one\n                   would be the wiser.\n\n      Behind KABLE, HACKMAN lets the ball roll away and silently\n<b>      TURNS TOWARD US.\n</b>\n                             KEN CASTLE (cont'd)\n                   A hundred million folks that will\n                   buy what I want them to buy, vote\n                   how I want them to vote, do pretty\n                   much damn well anything I figure\n                   they ought to do.\n\n      HACKMAN comes running at KABLE from behind, eyes burning, at\n      a full charge... running into FOCUS... holding the BOWIE\n<b>      KNIFE...\n</b>\n                              KEN CASTLE(cont'd)\n                   For instance.\n\n      KABLE hears HACKMAN at the last second, spins and ABSORBS THE\n      TACKLE. The men GO TO THE GROUND, grappling, UFC-style.\n      KABLE has HACKMAN'S KNIFE HAND by the wrist, stopping it -\n      but leaving his face UNPROTECTED...\n\n      HACKMAN brings his free ELBOW down on KABLE'S face,\n      connecting and opening a CUT under his eye; then AGAIN - this\n      time KABLE catches the elbow with his own free hand and\n      WRENCHES IT IN SIDEWAYS, dislocating HACKMAN'S shoulder with\n      a sickening POP.\n\n\n\n<b>                                                            (CONTINUED)\n</b><b>\n</b><b>                                                             100.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b><b>159   CONTINUED: (2)                                                159\n</b>\n      KABLE works around HACKMAN, gets him in a HEADLOCK and\n      SQUEEZES... still gripping the knife hand, immobilizing it...\n      HACKMAN is choking, BEAT RED... for long, brutal seconds the\n      life drains out of him... finally, HACKMAN'S eyes roll back;\n      he GOES LIMP. KABLE takes the BOWIE KNIFE from HACKMAN'S\n      dead fingers.\n\n      He struggles to his feet, dripping sweat and blood.\n\n<b>                          KABLE\n</b>                You should've let him fight for\n                himself, Castle - he might've had a\n                shot.\n\n<b>                          KEN CASTLE\n</b>                    (pleasant)\n                I think you're missing the point,\n                my man.\n\n<b>                          KABLE\n</b>                No, I get it - you're pulling the\n                strings on all of this...\n                    (starts to move toward\n                     CASTLE with BAD INTENT)\n                ... which makes my next move pretty\n                easy to figure.\n\n      KABLE comes at CASTLE FAST, bringing the KNIFE around to open\n      his throat like a PEZ DISPENSER...\n\n      His arm FREEZES IN MID AIR, the BLADE inches from contact.\n\n<b>                          KEN CASTLE\n</b>                Neglected to mention: my smart boys\n                reversed that hack those fellas\n                worked for you - easy breezy, once\n                we had access to their drives...\n\n      This is gut-wrenching for KABLE -- after tasting freedom, he\n      feels his will ripped away from him... HE'S BEING PUPPETED BY\n<b>      THE MAN HE HATES THE MOST.\n</b>\n                          KEN CASTLE (cont'd)\n                You're mine, boy.\n\n      With a twitch of CASTLE'S eyes KABLE brings the KNIFE down\n      and SLICES OPEN HIS OWN LEG.\n\n<b>                                                        CUT TO:\n</b>\n<b>160   INT. SIMON'S ROOM - SIMULTANEOUS                              160\n</b>\n      SIMON is sitting on the floor, head hung low, in front of the\n      dead wall... a glitch, a flicker... the screen comes to life:\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                     101.\n</b><b>                           WHITE KABLE SCRIPT - 9/19/2007\n</b><b>160   CONTINUED:                                                            160\n</b>\n      It's KABLE'S POV of KEN CASTLE.          CASTLE is stripping off his\n      shirt.\n\n<b>                             KEN CASTLE\n</b>                       (on SCREEN)\n                   Come on, lets boogie woogie rock\n                   and roll.\n\n<b>                              SIMON\n</b>                   Ummm.\n\n<b>                                                            CUT BACK TO:\n</b>\n<b>161   INT. CASTLE'S COURT - CONTINUOUS                                      161\n</b>\n      CASTLE throws a funky KARATE KICK and nails KABLE in the\n      jaw... then a haymaker to the GUT, doubling KABLE over.\n\n      He lets KABLE swing the KNIFE just short of his face as he\n      backs away.\n\n<b>                             KEN CASTLE\n</b>                   Biggest, baddest Slayer in the\n                   game... don't seem like much, does\n                   he?\n\n      CASTLE is enjoying the hell out of himself. He uppercuts\n      KABLE, snapping his head back... then shakes out his\n      knuckles.\n\n                              KEN CASTLE (cont'd)\n                   Oww!\n\n      KABLE swings his OPEN HAND around - CASTLE choreographs it\n      perfectly: KABLE'S nails rake across CASTLE'S STOMACH,\n      MARKING HIM UP like BRUCE LEE in Enter The Dragon. CASTLE\n      strikes a pose to match.\n\n                             KEN CASTLE (cont'd)\n                   Lucky shot.\n                       (grins)\n                   OK, not really.\n\n      He brings a passable REVERSE CRESCENT KICK that drops KABLE\n      to the floor.\n\n                             KEN CASTLE (cont'd)\n                   I need an audience, boys.\n\n      A DOOR OPENS at the far end of the court; KABLE looks up\n      slowly, afraid of what he knows he'll see:\n\n      ANGIE and DELIA are led into the room. ANGIE presses herself                *\n      close to DELIA, holding her shoulders protectively.                         *\n\n<b>                                                                (CONTINUED)\n</b><b>\n</b><b>                                                                 102.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>161   CONTINUED:                                                        161\n</b>\n      She keeps her distance from the GEEK SQUAD escorts and tries            *\n      to block DELIA from them - there is raw fear and anger in her           *\n      eyes; the GEEK SQUAD are not overtly violent or menacing, but           *\n      ANGIE seems acutely aware that they are lethal. DELIA seems             *\n      oddly neutral and unaffected by the entire situation.                   *\n\n      CASTLE kicks KABLE across the floor, toward them.\n\n                             KEN CASTLE (cont'd)\n                   That's right, you crawl on your\n                   belly like a toad...\n                       (he looks to the GEEK\n                        SQUAD, sheepish)\n                   Is this bad? I'm really bad.\n\n      He gives KABLE a last kick; KABLE collapses in front of his\n      DAUGHTER... she looks down at him, curiously.                           *\n\n      He looks up at DELIA, eyes soaked with emotion... then to               *\n      ANGIE. They share a moment of intense eye contact - we feel             *\n      that ANGIE wants desperately to go to him but is unsure of              *\n      what is the best action to take strategically; she is looking           *\n      to KABLE for a clue.                                                    *\n\n      KABLE'S eyes go back to DELIA; he tries to reach up and                 *\n      gently touch her face...\n\n                             KEN CASTLE (cont'd)\n                   That's sweet.\n\n      CASTLE steps on KABLE'S hand, pinning it to the floor.\n\n                             KEN CASTLE (cont'd)\n                   Alright boys, you ready? A true\n                   test.\n\n      He steels his eyes on KABLE and concentrates.\n\n      KABLE slowly brings up the KNIFE toward DELIA'S THROAT.\n\n      ANGIE moves to pull DELIA away - CASTLE merely glances up at            *\n      her and she FREEZES, paralyzed. We can see her body strain              *\n      against invisible control, raw panic in her eyes...                     *\n\n<b>                               KABLE\n</b>                         (desperate)\n                   No.\n\n<b>                             KEN CASTLE\n</b>                   Just like last time. Remember?\n\n      KABLE is FIGHTING IT with all his will, his whole body\n      shaking...\n\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                   103.\n</b><b>                         WHITE KABLE SCRIPT - 9/19/2007\n</b><b>161   CONTINUED: (2)                                                      161\n</b>\n                            KEN CASTLE (cont'd)\n                  You're stronger now... a little\n                  more fight in you... but I think\n                  the end result will be about the\n                  same...                                                       *\n\n                            KEN CASTLE (cont'd)\n                  Shh.\n\n      The GEEKS look on, impassive. The BLADE is inches away... He              *\n      looks into ANGIE'S eyes - she and KABLE are like one; he                  *\n      seems to draw strength from her... finally, KABLE WILLS                   *\n      EVERYTHING HE HAS and STABS THE KNIFE INTO THE FLOORBOARDS.               *\n\n      Suddenly:\n\n      KABLE's head SNAPS around, his eyes confused... and in one\n      quick, smooth movement, KABLE YANKS THE KNIFE out of the\n      floor, RISES TO HIS FEET AND SPINS ON CASTLE. He claps a\n      hand around CASTLE'S neck and tries to jam the knife up into\n      his GUT - but CASTLE is able to FREEZE HIM just short...\n\n                            KEN CASTLE (cont'd)\n                      (freaked)\n                  What the hell was that?\n\n      The GEEKS break out tiny devices and start quickly scanning.\n      Not even KABLE understands this.\n\n<b>                            PONYTAIL GEEK\n</b>                  There are 2 networks accessing the\n                  same IP address.\n\n<b>                            GEEK LEADER\n</b>                  Someone on the outside is sending\n                  him commands...\n\n<b>                                                              CUT TO:\n</b>\n<b>162   INT. SIMON'S ROOM - SIMULTANEOUS                                    162\n</b>\n      SIMON is on his feet, in full BADASS GAMER MODE.\n\n      His body is positioned exactly like KABLE'S - right hand\n      gripping the virtual blade for an underhand thrust; left hand\n      clutching CASTLE'S THROAT... he FORCES HIS RIGHT HAND\n<b>      FORWARD...\n</b>\n<b>                                                          CUT BACK TO:\n</b><b>\n</b><b>                                                                104.\n</b><b>                       WHITE KABLE SCRIPT - 9/19/2007\n</b>\n\n\n<b>163   INT. CASTLE'S COURT - CONTINUOUS                                 163\n</b>\n      ... KABLE'S KNIFE HAND begins to inch forward. Now CASTLE is\n      the one struggling for control; he claws weakly at KABLE'S\n      hand, trying to loosen it off his neck...\n\n<b>                          KEN CASTLE\n</b>                    (panicking)\n<b>                JAM THE SIGNAL YOU GOD DAMN\n</b><b>                RETARDS!\n</b>\n<b>                          GEEK\n</b>                    (irritated)\n                Working on it...\n\n      KABLE'S eyes are locked in on CASTLE'S... straining with\n      everything he has... his strength and will overpowering\n      CASTLE, but-\n\n<b>                          KEN CASTLE\n</b>                    (like he's explaining the\n                     obvious to a child)\n                I think it.\n\n      KABLE, succumbing to CASTLE'S control, begins to move the\n      knife away from CASTLE'S belly.\n\n                          KEN CASTLE (cont'd)\n                You... fucking... do it...\n\n      CASTLE delivers a CRUNCHING HEADBUTT to his NOSE, KABLE loses\n      his footing, sweat pouring down his face, bloody, drained...\n      CASTLE pushes the KNIFE back towards KABLE. He fights back -\n      every muscle in his arm fighting against another like Yin &amp;\n      Yang, veins rising in his neck...\n\n      Then KABLE senses an opportunity:\n\n<b>                          KABLE\n</b>                Look at this knife... imagine me\n                sticking it into your gut... think\n                about it... make it real.\n\n      CASTLE laughs... BUT HIS EYES FLICKER TO THE KNIFE - of\n      course he can't help but picture it...\n\n      ... and in that instant KABLE JAMS IN THE BLADE...\n\n<b>                          GEEK LEADER\n</b>                    (blank)\n                Oops.\n\n\n\n\n<b>                                                           (CONTINUED)\n</b><b>\n</b><b>                                                                 105.\n</b><b>                            WHITE KABLE SCRIPT - 9/19/2007\n</b><b>163   CONTINUED:                                                        163\n</b>\n      ... CASTLE focuses, trying to pull it back out, but KABLE\n      shoves it in deeper - CASTLE'S EYES BULGE. Finally KABLE\n      TWISTS the KNIFE and lifts CASTLE OFF THE GROUND.\n\n      The paralysis breaks from ANGIE - she lunges forward to throw           *\n      her arms around her daughter.                                           *\n\n<b>164   INT. SIMON'S ROOM - CONTINUOUS                                    164\n</b>\n<b>                             SIMON\n</b>                       (triumphant)\n<b>                   YES!!!\n</b>\n      He drops down into the badass, ROCKSTAR pose...\n\n<b>165   INT. CASTLE'S COURT - SIMULTANEOUS                                165\n</b>\n      ... and KABLE does the same.                                            *\n\n<b>                             KABLE\n</b>                   Damn it, kid...\n\n      CASTLE collapses to his knees in front of KABLE, glass-eyed,\n      draining life... they are FACE to FACE.\n\n                              KABLE (cont'd)\n                   ... is the fuckin pose really\n                   necessary?\n\n      CASTLE face-plants on the COURT.\n\n<b>                               SIMON\n</b>                   Sorry.\n\n      KABLE'S body relaxes; he tosses the knife across the floor...\n      then turns to face his family.\n\n      When DELIA finally speaks there is a trace of CASTLE'S\n      Georgia peach accent.\n\n<b>                             DELIA\n</b>                   Are you my Daddy Tillman?\n\n      He gathers DELIA in his arms and lifts her off her feet,\n      squeezing her close; she SQUEEZES BACK. KABLE grabs ANGIE\n      with his other arm and pulls her in.\n\n      The GEEKS look at one another - realize that their employment\n      contract with CASTLE has just been terminated... shrug;\n      pocket their shit, zip up their backpacks and fanny packs,\n      get up and start to file out.\n\n<b>                               KABLE\n</b>                   Wait.\n\n<b>                                                             (CONTINUED)\n</b><b>\n</b><b>                                                                         106.\n</b><b>                             WHITE KABLE SCRIPT - 9/19/2007\n</b><b>165   CONTINUED:                                                                165\n</b>\n      GEEK LEADER stops.\n\n                             KABLE (cont'd)\n                   Shut it off.\n\n<b>                                GEEK\n</b>                   Pardon?\n\n<b>                                KABLE\n</b>                   The nanex.     Set us free.\n\n      The GEEKS look at one another.\n\n                             KABLE (cont'd)\n                   It's nothing to you. A mouse-\n                   click.\n\n      GEEK LEADER shrugs.\n\n<b>                                GEEK LEADER\n</b>                   True dat.\n\n      He nods to PONYTAIL GEEK: do it.\n\n      The GEEK LEADER betrays a ghost of a smile.\n\n                             GEEK LEADER (cont'd)\n                   Well played, Kable.\n\n      KABLE doesn't answer; but his eyes say: how was any of this a\n      fucking game?\n\n<b>                              DELIA\n</b>                   Mommy. Why did Daddy Tillman hurt\n                   Daddy Ken?\n\n<b>                                                              FADE TO BLACK.\n</b>\n<b>166   INT. BATHROOM - TIME INDETERMINATE                                        166\n</b>\n<b>      A VIDEO PLAYER WINDOW POPS UP:\n</b>\n      It's TRACE, filming        herself.\n\n<b>                             TRACE\n</b>                   This is for you, you dumb bitch.           I\n                   hope you do the right thing with\n                   it.\n\n      The IMAGE switches to the CAPTURED FOOTAGE of KABLE in the\n      military facility... leading up to SCOTCH'S murder.\n\n      The light from the screen reflects on GINA PARKER SMITH'S\n      face - she's wide-eyed, stunned.\n\n<b>                                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                       107.\n</b><b>                          WHITE KABLE SCRIPT - 9/19/2007\n</b><b>166   CONTINUED:                                                              166\n</b>\n<b>                             GINA PARKER SMITH\n</b>                   Oh, baby...\n\n<b>                                                           FADE TO BLACK.\n</b>\n<b>167   INT. KABLE'S CAR - DAY                                                  167\n</b>\n      SHOOTING STARS fly past us in the dark... the SAME IMAGE WE\n      STARTED WITH... only instead of an underground train carrying\n      SOLDIERS to battle...\n\n      The TUNNEL ENDS; we break from the side of a mountain into\n<b>      BLUE SKY AND SUNLIGHT.\n</b>\n      KABLE is driving on the open highway... ANGIE is in the\n      passenger seat, asleep, head pressed up against the window\n      glass.\n\n      KABLE checks the rear view window; makes eye contact with\n      DELIA, who is suspended in a lightweight car seat in the back\n      seat.\n\n<b>                             KABLE\n</b>                   You good, sweetheart?\n\n      DELIA nods.\n\n      KABLE allows himself a smile, puts his eyes back on the road.\n      ANGIE slowly reaches for KABLE'S hand, she rubs her thumb on\n      his tattoo - \"I am right here with you\" - and falls back\n      asleep.\n\n      The CAMERA tilts up, stares out the front window and moves\n      into the giant sun.\n\n\n\n<b>                                                           SMASH TO BLACK.\n</b>\n\n<b>                             THE END\n</b>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Gamer.jpg\"/>\n</td><td><h1>Gamer</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Mark Neveldine\" title=\"Scripts by Mark Neveldine\">Mark Neveldine</a>  <a href=\"/writer.php?w=Brian Taylor\" title=\"Scripts by Brian Taylor\">Brian Taylor</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Gamer Script.html#comments\" title=\"Gamer comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:06:02.253141"}