{"title": "Game, The", "film_link": "/Movie Scripts/Game, The Script.html", "script_link": "/scripts/Game,-The.html", "info_raw": "\n\nGame, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Brancato  Michael Ferris  Larry Gross  Andrew Kevin Walker\nGenres  Mystery  Thriller\nScript Date : February 1996\n\nRead \"Game, The\" Script\n\n\n", "script": "\n\n\n\n   \"The Game\", early draft, by John Brancato & Michael Ferris\n\n\n\n   \n\n\n\n\n\n\n\n\n\n                              The Game\n\n\n                                 by\n\n\n                    John Brancato & Michael Ferris\n\n\n\n\n\n\n\n\n\n                                                  REVISED\n                                                  October 19, 1995\n\n\n\n\n\n\n     A1. TITLES OVER \"HOME MOVIES\" from the 1960's -- FLICKERING, GRAINY,\n     HAND-HELD, KODACHROME COLORS.  MUSIC OVER.\n\n     1.  E X T .   V A N   O R T O N   H O U S E  -  D A Y  (HOME MOVIES)\n\n     A SEVEN-YEAR-OLD BIRTHDAY BOY with a blindfold spins round and\n     round, the HANDS of OTHER CHILDREN keep him spinning.  MAIN TITLE.\n     It's a game of pin-the-tail-on-the-donkey.  The dizzy boy is given\n     a strip of felt, and the CAMERA follows as he stumbles toward a\n     large cardboard donkey.  He pins the tail on its nose.\n\n     2. QUICK, RAGGED CUTS-- the BOY blows out candles... opens gifts...\n     a CLOWN ties balloon animals.  CHILDREN, MAIDS and BUTLERS hover\n     about; there's even a real-live PONY.  The party take splace in the\n     gardens of a massive Pacific Heights MANSION.\n\n     3. THE BOY is SCHUYLER VAN ORTON (7), and this is his birthday\n     party.  He's a serious-looking child, who adjusts his glasses as he\n     poses for a shot with his mother, MRS. VAN ORTON, a stiff-looking\n     society matron.  A NANNY brings over an INFANT and gently places\n     the baby in Schuyler's arms.  Schuyler is ultra-careful, over-\n     whelmed by the responsibility of holding his tiny BROTHER (DAVID).\n\n     4. THE BOY and the other children sit spellbound, watching a magic\n     show in the front GARDEN-- a MAGICIAN waves a colored handkerchief,\n     a DOVE FLIES OUT.  CAMERA FOLLOWS the bird UP toward the house...\n\n     5. THE CAMERA FINDS MR. VAN ORTON, a pinched, depressive man of\n     about 40, wearing glasses.  He stands on a high balcony at the top\n     story of the mansion, in a bathrobe, smoking a cigarette.  The\n     unseen photographer ZOOMS IN jerkily on the man.  When he realizes\n     he's being photographed, Mr. Van Orton turns his back and goes\n     inside the house.  The film SOLARIZES and runs into LEADER--\n\n                                                       CUT TO:\n\n     6.  E X T .   V A N   O R T O N   H O U S E  -  D A Y  (PRESENT DAY)\n\n     TITLES CONTINUE.  Early morning, the same mansion (ideally an\n     ornate Victorian or Arts & Crafts).  The landscaping has changed,\n     there are some modern touches, such as an iron gate surrounding the\n     carriageway, a black 500-class MERCEDES in the drive.\n\n     MUSIC DOWN, SEGUE to a CNN NEWS BROADCAST OVER as the CAMERA MOVES\n     IN ON THE UPPER BALCONY where we'd seen Mr. Van Orton earlier...\n     it's now COVERED and GLASSED-IN.  We move THROUGH THE GLASS...\n\n     7.  I N T .   M A S T E R   B E D R O O M  -  D A Y \n\n     TRACK THROUGH a large master bedroom; neat, masculine and Spartan,\n     free weights, a treadmill.  Atop the bed a LAPTOP COMPUTER runs\n     STOCK QUOTES.  A LARGE-SCREEN TV plays UNWATCHED, a familiar CNN\n     ANCHOR (we'll assume BERNARD SHAW).  The Bang & Olufsen CLOCK RADIO\n     CLICKS ON, 6:30 am; CLASSICAL MUSIC now DUELS with the TV report.\n     HAND-ANNOTATED PAPERWORK and STOCK READOUTS cover a NIGHT TABLE,\n     where the ringing multi-line TELEPHONE JOINS the cacophony. \n\n     END TITLES as we MOVE TOWARD a DOOR, it's open a crack-- from this\n     adjacent bath we hear the SOUND OF A SHOWER RUNNING...\n\n     8.  I N T .   M A S T E R   B A T H R O O M  -  D A Y \n\n     In the steam-filled bathroom, we make out SCHUYLER VAN ORTON, now\n     38.  He's handsome, fit and apparently in complete control of his\n     world.  He steps out of the shower, wraps a towel around himself\n     and grabs the BATHROOM PHONE. \n\n                             SCHUYLER (on phone)\n                     Van Orton... Yes, it is my \n                     birthday, Bob, is that why you\n                     called...?  Ah... No, I'm not \n                     carrying Alan Baer another inch, \n                     fuck him, BG Lumber is history... \n\n     As he speaks, he continues his morning ritual-- hair combing, Q-\n     tips, etc.  (Schuyler is a man in almost constant motion.) \n\n     9.  E X T.   S A N   F R A N C I S C O   S T R E E T S  -  D A Y \n\n     The black Mercedes moves quickly through morning traffic.\n\n     10.  I N T .   S C H U Y L E R ' S   C A R  -  D A Y \n\n     SCHUYLER is on his car phone, NEWS RADIO LOW in BG, maneuvering \n     aggressively through traffic.  His laptop RUNS in the passenger\n     seat, its cellular antenna up. \n\n                             SCHUYLER (on carphone) \n                     Ignore the rumors, Alan, you know\n                     me, of course I'm behind Baer- \n                     Grace a hundred per cent... great,\n                     see you at the shareholders'\n                     meeting next month... \n\n     He hangs up and HONKS at another driver, displaying no emotion.\n\n     11.  I N T .   V A N   O R T O N   O F F I C E S  -  D A Y \n\n     TRACK WITH SCHUYLER through an elegant suite of offices.  He passes\n     a discreet sign: \"THE VAN ORTON GROUP.\"  Schuyler is on a cell-\n     phone, carrying the laptop, trailed by MARIA, his middle-aged\n     secretary.  She bears paperwork and patiently awaits his attention. \n\n                             SCHUYLER (on cellphone) \n                     I've got buyers for the BG paper mill,\n                     goose the lawyers, final papers in \n                     three weeks... sure it's sad, but an\n                     old dog loses its teeth and pisses\n                     itself, you put it to sleep... \n\n     As Schuyler walks, he's GREETED by passing UNDERLINGS, whom he\n     ignores.  He SHUTS OFF the phone, Maria hands him a couple of\n     items, follows him into his office. \n\n                             MARIA \n                     Carol from the museum called. \n                     She's sending architect's sketches\n                     of the wing...\n\n     12.  I N T .   S C H U Y L E R ' S   O F F I C E  -  D A Y \n\n     The office is large, tasteful, reeks of old money.  A window\n     overlooks the San Francisco skyline and the Bay. \n\n                             MARIA \n                     That Business Week reporter called again-- \n\n                             SCHUYLER \n                     Tell him to fuck himself.  Nicely. \n\n                             MARIA \n                           (awkwardly) \n                     --and, um, somebody who identified\n                     himself as, um, P.P. Willy. \n\n     SCHUYLER FREEZES at this, stares at her. \n\n                             MARIA \n                     Sorry, I figured it was a crank, but\n                     he swore you'd know who he was.  He \n                     wanted to meet you for lunch, I told\n                     him you had appointments all-- \n\n                             SCHUYLER \n                     Cancel.  Cancel the whole afternoon. \n\n                             MARIA\n                     But you-- \n\n                             SCHUYLER \n                     Do it.  Did he leave a number? \n\n                             MARIA\n                     No.  He just said he'd be at Leo's\n                     in the Haight.  At noon. \n\n     Maria hands him a slip of paper, lingers, awaiting explanation...\n\n                             SCHUYLER \n                     That's all, Maria. \n\n     She heads out quickly.  Schuyler stares at the slip, then turns to\n     look out the window, lost in thought. \n\n                                                       CUT TO:\n\n     13.  I N T .   L E O ' S  -  D A Y \n\n     A working class bar, an ALCOHOLIC or two, pinball machines. \n     SCHUYLER sits a table near a window, checking his watch, it's not\n     his kind of place.  A WAITRESS arrives in a too-small uniform--\n     young, multiple earrings, CHRISTINE according to her name tag. \n\n                             CHRISTINE \n                     Can I take your order? \n\n                             SCHUYLER\n                     I haven't seen the menu. \n\n                             CHRISTINE\n                     Oh, right.  Here, see ya. \n\n     She hands him a menu and starts off.  Schuyler calls after her. \n\n                             SCHUYLER \n                     An iced tea, please-- \n\n     She waves a hand, \"yeah, right,\" without looking back.  Schuyler \n     sighs and opens the menu.  Suddenly, someone BACKHANDS the side of\n     his skull, he assumes a defensive posture.  Schuyler sees his\n     LAUGHING brother:  DAVID VAN ORTON. \n\n                             DAVID \n                     Yo, Sky.  Happy birthday. \n\n                             SCHUYLER \n                       (rubs his head, annoyed) \n                     Thanks, \"Pee-pee.\"  I never get\n                     tired of that. \n\n     DAVID slides into the seat opposite him.  He's in his early 30's,\n     good-looking but unkempt, wears bright, funky clothes, an earring\n     and a perpetual grin.  There's an intense, edgy quality to him\n     which Schuyler has some trouble readjusting to. \n\n                             SCHUYLER \n                     Well... long time. \n\n                             DAVID \n                     Yeah, since Mom died-- what, five\n                     years? So how you been? \n\n                             SCHUYLER \n                     Business as usual... \n\n                             DAVID \n                     How's Elizabeth?  Any kids? \n\n                             SCHUYLER\n                     A little girl. \n\n                             DAVID\n                     Congrat-- \n\n                             SCHUYLER \n                     It's not mine, she married a\n                     pediatrician in Sausalito. \n\n                             DAVID \n                     You're divorced... \n                        (off Schuyler's nod) \n                     Too bad, she was actually interesting. \n\n                             SCHUYLER \n                     She stopped drinking, I guess \n                     getting rid of me was the 13th step. \n\n                             DAVID \n                     So you're all alone in the House of Pain. \n\n                             SCHUYLER \n                     I redecorated.  Where have you been? \n\n                             DAVID \n                     All over.  Nowhere in particular.\n                     Didn't your fucking gumshoes keep \n                     you informed of my every movement? \n\n                             SCHUYLER \n                     I called them off two years ago, \n                     David.  You'd kicked the heroin, you'd\n                     left the ashram, you were windsurfing\n                     somewhere in Central America...\n\n                             DAVID \n                     It's gorgeous down there... you\n                     should go sometime. \n\n                             SCHUYLER \n                     Look, are you in trouble, is there\n                     anything you need?  You can't have\n                     gone through the trust fund... \n\n                             DAVID \n                         (looks at him, hurt) \n                     That's not why I'm here, Sky, I\n                     just wanted to see you... I even\n                     brought a gift, for a change. \n\n                             SCHUYLER \n                     You didn't bake me a cake, did you?\n\n                             DAVID \n                     You can't still be mad about the\n                     hash brownies... \n\n     Schuyler's unamused by the memory.  David grins and pulls a small\n     envelope out of his pocket, tosses it on the table in front of him. \n\n                             DAVID \n                     Happy birthday, bro. \n\n                             SCHUYLER\n                     What is this. \n\n                             DAVID\n                     It's a bomb.  Open it! \n\n     Schuyler shrugs, opens the envelope and shakes out-- \n\n     A BUSINESS CARD in BLUE and ORANGE:  \"CONSUMER RECREATION SERVICES.\" \n     The C, R and S are HIGHLIGHTED, a PHONE NUMBER at the bottom.\n\n     SCHUYLER picks up the card, fingers it. \n\n                             SCHUYLER \n                     Consumer Recreation Services.  OK...\n\n                             DAVID \n                     I can't tell you very much about it,\n                     that'd ruin the surprise.  Just \n                     promise me you'll give 'em a call. \n\n                             SCHUYLER \n                     I don't get it. \n\n                             DAVID \n                     Just call 'em.  OK look, it's simple,\n                     really.  They entertain you. \n\n                             SCHUYLER \n                     Is this an escort service? \n\n                             DAVID \n                     No, it's nothing like that. \n                     They're a business, they're for\n                     real... They guarantee just one\n                     thing-- you won't be bored. \n\n     Schuyler gives him a bored, blank look.  David throws up his hands.\n\n                             DAVID \n                     They make your life fun. \n\n                             SCHUYLER\n                     Fun. \n\n                             DAVID \n                     You've heard of it. \n\n     Christine the waitress has shown up with Schuyler's iced tea.  She\n     puts it down hastily, spilling some across the table.  Schuyler\n     shies away, grabbing a napkin and blotting it up before it can drip\n     into his lap.  Cracking gum: \n\n                             CHRISTINE\n                     Sorry. \n\n     She moves off as Schuyler tries to order, raising a finger--\n\n                             SCHUYLER\n                     Just a cheesebur... how'd you find\n                     this place?\n\n                             DAVID \n                     Old connection used to meet me\n                     here.  So you gonna call 'em? \n\n                             SCHUYLER \n                        (a sigh, carefully) \n                     You know, David, this is sweet, but \n                     it's an awfully busy time, I'm in the\n                     midst of a delicate liquidation-- \n\n                             DAVID \n                       (mimicking him bitterly) \n                     \"A delicate liquidation,\" God, you\n                     would do this... \n\n                             SCHUYLER\n                     David-- \n\n                             DAVID \n                     We can't get together once without \n                     you making me feel like shit.  That's\n                     important to you, isn't it? \n\n                             SCHUYLER \n                     What are you talking about? \n\n                             DAVID \n                     Forget about it, don't bother. \n\n     David slumps in his seat, won't meet Schuyler's eyes. \n\n                             SCHUYLER \n                     Are you still on medication...? \n\n     David glares at him.  With the impeccable timing of all waitresses,\n     CHRISTINE appears, chipper. \n\n                             CHRISTINE \n                     You guys know what you want? \n\n                             DAVID\n                     Go away. \n\n     She curls her lip and departs before Schuyler can open his mouth.\n     He sighs, resigned to the idea of not eating.  Calmly:\n\n                             DAVID \n                     I just thought you'd like it.  I did,\n                     it was a blast, best thing that ever\n                     happened to me.  And for your \n                     information, I'm not on anything\n                     anymore, I'm not even seeing a \n                     shrink, I'm in a better place than \n                     I've ever been, I'm even happy-- but\n                     that's something else I wouldn't be\n                     able to explain to you. \n\n                             SCHUYLER \n                     OK, OK, I'll give them a call... \n\n                             DAVID\n                     Whatever. \n\n                             SCHUYLER \n                     Look, take a pill.  Just be normal \n                     for thirty seconds and tell me what\n                     this is.  I hate surprises. \n\n                             DAVID\n                     I know. \n\n     David WINKS, puts a finger to his lips-- not another word. \n\n     CLOSE as Schuyler slips the brightly-colored CARD into his pocket.\n\n                                                       CUT TO: \n\n     14.  E X T .   V A N   O R T O N   O F F I C E   B U I L D I N G  -  N I G H T\n\n     ESTABLISH the moonlit exterior of an older, classy building in \n     downtown San Francisco.  MOVE IN on a high window, one of the few\n     LIT at this hour.  We hear the SOUND OF A PHONE CHIRPING OVER. \n\n     lS.  I N T .   S C H U Y L E R ' S   O F F I C E  -  N I G H T \n\n     COMPUTERS run, stacks of PAPERWORK, etc. PHONE continues to RING. \n\n     FIND SCHUYLER as he punches the SPEAKER:\n\n                             SCHUYLER\n                     Van Orton. \n\n                             ELIZABETH (on speaker)\n                     Hello, Schuyler. \n\n     ELIZABETH is Schuyler's ex-wife-- an earnest woman, a stranger to\n     subtlety.  STAY WITH SCHUYLER, who half-smiles, looks at his watch. \n\n                             SCHUYLER \n                     Eleven forty, you almost didn't\n                     make it. \n\n                             ELIZABETH (on speaker) \n                     I always call on your birthday.\n                     How was it? \n\n                             SCHUYLER \n                     Oh, the usual, big party, circus\n                     clowns, naked lady in a cake... \n\n                             ELIZABETH (on speaker) \n                       (slight chuckle; serious)\n                     How are you, Sky? \n\n     She has the concerned, forthright tone of a \"recovery person,\"\n     someone who's been through a lot of therapy and wants to reach out.\n     Schuyler GRIMACES, then mimics the tone: \n\n                             SCHUYLER \n                     I'm just fine.  How are you? \n\n                             ELIZABETH (on speaker)\n                     It wasn't a trick question. \n                     Thirty-eight, I thought that might\n                     be a-- a difficult year for you... \n\n                             SCHUYLER \n                     Hm?  Just another birthday, \n                     another year closer to death. \n\n                             ELIZABETH (on speaker) \n                     I meant-- because of your father. \n\n                             SCHUYLER \n                     Oh that's right, I guess he was 38,\n                     wasn't he?  I hadn't thought about \n                     it, to tell the truth, but thank you\n                     for the reminder. \n\n                             ELIZABETH (on speaker)\n                     Why do I call you... \n\n                             SCHUYLER \n                     I honestly don't know, but it's a\n                     nice change of pace from talking\n                     to your attorneys.  So, still\n                     working at the hospice? \n\n                             ELIZABETH (on speaker)\n                     Mm-hmm, couple days a week... \n\n                             SCHUYLER \n                     Great, that's great.  Well, give my\n                     regards to Dr. Mel and the baby-- \n\n                             ELIZABETH (on speaker) \n                     She has a little brother on the \n                     way... we just did the ultrasound. \n\n                             SCHUYLER \n                     Really.  Congratulations-- two \n                     kids, an official nuclear family,\n                     you must be very happy. \n\n                             ELIZABETH (on speaker)\n                     We are, Sky.  Very happy. \n\n                             SCHUYLER \n                     Well, you deserved someone who \n                     wanted the same things you did-- \n\n                             ELIZABETH\n                     Are you?  Happy? \n\n     SCHUYLER hates this question.  He quickly changes the subject. \n\n                             SCHUYLER \n                     Speaking of little brothers, I saw\n                     David today. \n\n                             ELIZABETH (on speaker)\n                     Really? \n\n                             SCHUYLER \n                     He asked about you.  He's on a new \n                     kick, some personal improvement cult.\n                     I'm gonna check it out, I'm sure he's\n                     getting fleeced again. \n\n                             ELIZABETH (on speaker) \n                     Who knows, maybe it'll be good for \n                     you.  Send David my love. \n\n                             SCHUYLER\n                     Right.  Well, thanks again for\n                     calling, Elizabeth, take care. \n\n                             ELIZABETH (on speaker) \n                     You too, Schuyler-- I mean that-- \n\n                             SCHUYLER \n                     Mm, good luck, bye. \n\n     He PUNCHES off the phone in the middle of her \"Good-bye.\"  Schuyler\n     returns to his work, as if the call hadn't taken place-- but a few\n     seconds later, we see his concentration is completely shattered, he\n     leans back in his SQUEAKING deskchair. \n\n                                                       CUT TO:\n\n     16.  E X T .   P A C I F I C   H E I G H T S  -  N I G H T \n\n     SCHUYLER'S MERCEDES cruises on the hilly streets, past impressive\n     mansions on all sides, a CRESCENT MOON overhead. \n\n     17.  I N T .   S C H U Y L E R ' S   C A R  -  N I G H T \n\n     CLASSICAL MUSIC plays.  SCHUYLER drives, looking unsettled. \n\n     18.  E X T .   P A C I F I C   H E I G H T S  -  D A Y  (60'S/FLASHBACK) \n\n     POV DRIVING SHOT, from the backset of a LIMOUSINE.  PERIOD CARS,\n     FASHIONS, etc.  MUSIC CONTINUES OVER. \n\n     19.  I N T .   S C H U Y L E R ' S   C A R  -  N I G H T \n\n     SCHUYLER changes the RADIO STATION, trying to drown out his\n     thoughts with LOUD ROCK AND ROLL. \n\n     20.  E X T .   V A N   O R T O N   H O U S E  -  N I G H T \n\n     THE ELECTRIC GATE slides open, and Schuyler's Benz pulls in. \n\n     21.  E X T .   V A N   O R T O N   H O U S E  -  D A Y  (FLASHBACK) \n\n     A LIMOUSINE pulls into the ungated carriageway.  THE BACK DOOR \n     OPENS and SCHUYLER (7) emerges from the backseat, carrying \n     elementary schoolbooks.  As he approaches the front steps, he looks\n     upward at something, blinks and squints. \n\n     ANGLE UP-- MR. VAN ORTON, in his robe, stands on the balcony \n     railing, looking up at the sky.  He turns his gaze slowly downward. \n\n     YOUNG SCHUYLER is puzzled, gives his dad a tentative wave.\n\n     MR. VAN ORTON waves back, his eyes dead, expression blank. \n\n     YOUNG SCHUYLER opens his mouth to call to his father-- instead we\n     hear an URGENT ELECTRONIC BEEPING-- \n\n     22.  I N T .   S C H U Y L E R ' S   K I T C H E N  -  N I G H T \n\n     A MICROWAVE OVEN BEEPS that the meal is \"READY.\"  SCHUYLER opens\n     the door, takes out his upscale junk food, grabs a fork. \n\n     23.  I N T .   S C H U Y L E R ' S   D E N  -  N I G H T \n\n     ON A BIG-SCREEN TV, a CNN NEWSCAST shows a FIRE OUT OF CONTROL.\n     MOVE FROM THIS through the manly, book-lined den.  The house is\n     traditional, opulent, densely decorated with \"good pieces\"-- and it\n     feels like a mausoleum. \n\n     FIND SCHUYLER peeling open the plastic food container.  He sits in\n     a leather armchair.  A BOTTLE OF DOM PERIGNON sits on the coffee\n     table, near a champagne flute glass, a CUPCAKE with a CANDLE in it.\n     The LAPTOP computer is RUNNING.\n\n     ON TV, BERNARD SHAW comes out of the story. \n\n                             BERNARD SHAW (TV) \n                     --for the residents of the \n                     Crescent Heights project, a truly \n                     tragic day is over at last--\n\n                             SCHUYLER \n                     I'll drink to that. \n\n     SCHUYLER raises his champagne glass to the TV, his birthday done.\n     Then he toasts in the direction of a FRAMED PICTURE on the coffee\n     table-- a WEDDING PHOTO OF SCHUYLER and ELIZABETH. \n\n                             BERNARD SHAW (TV) \n                     --up next, the latest in sports.\n                     For all of us here at CNN, thank\n                     you for watching-- \n\n     SCHUYLER reaches for the REMOTE CONTROL.  He settles back on the\n     sofa, CHANNEL HOPPING.  He despairs of this quickly, points the\n     remote at his own head-- CLICK, CLICK.  He closes his eyes. \n\n     24.  E X T .   V A N   O R T O N   H O U S E  -  D A Y  (FLASHBACK) \n\n     MR. VAN ORTON stands on the edge of the balcony, waving as before.\n     He looks skyward one last time, then suddenly LAUNCHES HIMSELF INTO\n     SPACE in a head-first dive.  We hear what sounds like a SCREAM-- \n\n                                                       CUT TO:\n\n     25.  E X T .   C R S   B U I L D I N G   -  D A Y \n\n     --it's a CAR HORN.  The vehicle passes to reveal SCHUYLER striding \n     toward a postmodern building in the financial district; a ramp \n     leads to a parking garage beneath.  Casually dressed, he glances up\n     at the facade for a few moments, then goes in. \n\n     26.  I N T .   C R S   L O B B Y   A N D   A T R I U M   -  D A Y \n\n     The very new, dramatic structure is built around a central twelve-\n     story atrium narrowing to a SKYLIGHT above.  There's still some\n     minor construction underway on the ground floor, scaffolding about.\n     Schuyler crosses to a bank of lobby elevators. \n\n     27.  I N T .   C R S   E L E V A T O R  -  D A Y \n\n     Schuyler looks out the glass elevator as it rises vertiginously.\n     HIS POV as the atrium shrinks below him. \n\n     28.  I N T .   C R S   O F F I C E S  -  D A Y \n\n     Partitioned work areas, terminals, clutter and disarray.  Office\n     doors open off a reception area.  CRS EMPLOYEES move about\n     hectically.  Schuyler enters, wanders about for a moment, confused.\n     A friendly female RECEPTIONIST glances up from her desk. \n\n                             RECEPTIONIST\n                     Can I help you? \n\n                             SCHUYLER \n                     Is this Consumer Recreation\n                     Services?  I have an appointment, \n                     the name's Van Orton. \n\n     The woman flips through an appointment book with a logo, CRS.  IN\n     BG, JIM FEINGOLD pays a CHINESE DELIVERY GUY for a BAG OF FOOD. \n\n                             RECEPTIONIST \n                     Hm... I don't seem to-- \n\n                             SCHUYLER \n                     Schuyler Van Orton, I called last week. \n\n     The woman shakes her head.  FEINGOLD slows as he crosses past\n     Schuyler, carrying the bag.  He's 30-40, a no-nonsense engineer,\n     looks a bit dull, but he exudes competence and trustworthiness. \n\n                             FEINGOLD\n                     Problem? \n\n                             RECEPTIONIST \n                     This gentlemen says he has an\n                     appointment, but... \n\n     Feingold glances at Schuyler, shrugs. \n\n                             FEINGOLD \n                     Van Orton, huh?  I'll take him.\n                        (shakes his hand) \n                     Jim Feingold, v. p. in charge of\n                     engineering and data analysis. \n\n     The man leads Schuyler to a row of open boxes on the floor, looks\n     in a couple, then finds what he's after.  He snatches up a couple \n     of pages, hands them to Schuyler.  Then he finds a clipboard on the\n     floor, tosses it to him like a frisbee. \n\n                             FEINGOLD \n                     Sorry about the chaos, we're still\n                     in the process of moving...\n                     follow me, I've got an office\n                     around here someplace. \n\n     He reaches into a box of PENS, passes one to Schuyler.\n\n     CLOSE ON PEN-- the CRS LOGO. \n\n                                                       CUT TO: \n\n     29.  I N T .   F E I N G O L D ' S   O F F I C E / H A L L W A Y  -  D A Y \n\n     A modern, dramatic office.  Swoopy furniture, imposing ART, all \n     very cool-looking.  Feingold moves behind the desk, unpacks a\n     couple of white cartons. \n\n                             FEINGOLD \n                     I can't remember the last time I ate\n                     in a restaurant, all I do is work... \n\n     SCHUYLER sits on a couch, looking at the forms. \n\n                             SCHUYLER \n                     I know what you mean.  Look-- what\n                     is all this? \n\n     The fast-talking Feingold moves energetically through the office,\n     occasionally picking at his food or poking at the air with \n     chopsticks-- he's a bit hyper and fidgety in general. \n\n                             FEINGOLD \n                     Application, MMPI and TAT tests,\n                     financial statement...\n                        (indicating food) \n                     Want some?  Tung Hoy, best in Chinatown...\n                       (as Schuyler shakes his head) \n                     The tests serve a threefold purpose.\n                     First off, are you right for us? \n                     Are we right for you?  Unfortunately,\n                     there's a limited number of slots-- \n\n                             SCHUYLER \n                     Let's back up here-- \n\n                             FEINGOLD \n                            (over him) \n                     B, we need an idea of your abilities\n                     and limitations, what turns you on, \n                     and off.  Numero tres, our insurance\n                     company requires it. \n                        (a beat, studying Schuyler) \n                     You're familiar with our service,\n                     aren't you? \n\n                             SCHUYLER \n                     Not at all.  What are you selling? \n\n                             FEINGOLD \n                     Well... it's a game. \n\n                             SCHUYLER\n                     A game. \n\n                             FEINGOLD \n                     Recharges the batteries, gets you\n                     off the treadmill, it's an \n                     experience.  Sort of a-- vacation \n                     for the guy who's been everywhere. \n\n                             SCHUYLER \n                     This really doesn't sound like my\n                     sort of-- \n\n     Feingold sits on the edge of his desk, arms crossed, nodding and\n     smiling condescendingly-- he raises a hand to stop Schuyler. \n\n                             SCHUYLER \n                     What's so amusing? \n\n                             FEINGOLD \n                     Nothing.  I know who you are. \n                     You're David Van Orton's brother,\n                     he got you in here. \n\n                             SCHUYLER\n                     So. \n\n                             FEINGOLD \n                       (remembering fondly) \n                     David was-- impressive, one of the\n                     better I've seen.  But frankly, I\n                     can see you're not the type.\n\n                             SCHUYLER\n                     The type. \n\n                             FEINGOLD \n                     You know, a player. \n\n                             SCHUYLER \n                     I'm not a player. \n\n                             FEINGOLD \n                     I don't mean anything personal by it--\n                     I know you're an important guy, \n                     powerful guy, you're used to being on\n                     top.  It's just, this isn't for \n                     everyone.  Not everyone can handle it. \n\n                             SCHUYLER \n                       (nearly losing it) \n                     What kind of fu-- game is this? \n\n                             FEINGOLD \n                     The ultimate fucking game.  I wish I\n                     could tell you more, but it's\n                     different every time.\n                             (rising) \n                     Thanks for coming in-- \n\n                             SCHUYLER \n                          (doesn't move) \n                     I'm not an idiot.  I see what you're \n                     doing.  First the vague yet intriguing\n                     pitch, then I'm supposed to feel like\n                     my manhood's in question because I'm\n                     not up for, what, some motivational\n                     role-playing fantasy nonsense-- \n\n                             FEINGOLD \n                     Interesting, you don't know the first\n                     thing about it but you've already\n                     decided what it is... Listen, I\n                     don't wanna waste any more-- \n\n                             SCHUYLER \n                     Please, Jim, cut the hard-to-get\n                     shit.  I've got the afternoon \n                     free, I'll take your silly tests.\n\n     Feingold cocks his head, reappraising him.  Then, with a smile, he\n     calls to an attractive young WOMAN passing in the hall; Schuyler,\n     meanwhile, flips through the pages of the tests. \n\n                             FEINGOLD \n                     Ms. Nelson, are you busy?  We need\n                     someone to run Mr. Van Orton. \n\n                             MS. NELSON\n                     This way, sir... \n\n     As she leads Schuyler out the door, Feingold WINKS at him. \n\n                             FEINGOLD \n                     I'll catch up with you after the physical. \n\n     Schuyler reacts-- a physical?  He throws up a hand and follows the\n     woman into the hall.  Alone now, Feingold cracks a fortune cookie\n     and glances at the slip of paper inside.  He furrows his brow with\n     concern at the fortune-- then tosses it aside.\n\n                                                       CUT TO:\n\n     30. CRS OFFICES - SERIES OF SHOTS\n\n     During the following QUICK CUTS, SOUNDS will be layered in and\n     CONTINUE over one another, e. g. the SOUND of a scraping pencil,\n     the BLIPS of machinery, HEAVY BREATHING, MURMURING VOICES of\n     TECHNICIANS giving instructions...\n\n     A. X-CLOSE:  A #2 pencil FILLS IN box after box on a long MMPI \n     form.  CLOSE on a couple of these:  \"I sometimes hurt animals... I\n     feel guilty when I masturbate...\" each followed by TRUE and FALSE\n     boxes. \n\n     B. A WHITE-WALLED ROOM:  Schuyler concentrates on a drawing held by\n     a stone-faced PSYCHOLOGIST, a TAT test; he laughs as he speaks into\n     a tape-recorder, analyzing the pictures. \n\n     C. X-CLOSE:  The DRAWING, a large ant with an apron feeding a TV\n     dinner to a human child.  The card moves just as we register it to\n     reveal another DRAWING of a smiling man toppling backwards in a\n     chair, perched on the edge of a cliff. \n\n     D. A LAB:  Electronic MONITORS and PRINTERS record Schuyler's EEG\n     and EKG.  We see him on a doctor's table, wearing a medical gown\n     with the CRS logo.  He's hooked up to the wires, a female\n     TECHNICIAN studying the readouts while a NURSE takes his blood\n     pressure. \n\n     E. X-CLOSE:  The traveling trace of intersecting colored waves. \n\n     F. A DARKENED ROOM:  Schuyler in FG, still in the gown, watches a\n     screen as images FLASH-- geometric SHAPES, WORDS, PHOTOS.  His\n     finger hovers over a bank of three buttons, he presses different\n     ones from time to time.  There's a MIRROR to one side of the room-- \n\n     G. X-CLOSE:  A COMPUTER SCREEN shows green columns of NUMBERS--\n     SCHUYLER'S NAME is steady at the top of the screen, with an account\n     number.  CAMERA MOVES FROM THE SCREEN to show an unseen COMPUTER\n     OPERATOR watching Schuyler through the one-way glass. \n\n     The CACOPHONY of the MONTAGE ends abruptly as we CUT TO:\n\n     31.  I N T .   C U B I C L E  -  N I G H T \n\n     Schuyler, in the gown, sits on an examination table with his hands\n     in his lap in a small, featureless cubicle-- he seems vulnerable, \n     looks around blankly.  To himself, irritated and bemused: \n\n                             SCHUYLER \n                     David, you suck. \n\n     FEINGOLD BURSTS IN, a slew of COMPUTER PRINT-OUTS under his arm. \n\n                             FEINGOLD \n                     Sorry to keep you waiting, \n                     a client's head exploded...\n                             (grins) \n                     You can get dressed, we're done. \n\n     He throws open a closet door.  Schuyler reaches inside for his\n     clothes, which are neatly folded and on hangers.  Feingold turns\n     his back on him as he DRESSES, perching on the examination table\n     and studying the unburst print-outs. \n\n                             FEINGOLD \n                     Looks promising at this point. \n                     You test well, you're in decent\n                     shape for someone in your tax \n                     bracket... Hm, some resistance to\n                     the psych questions, but we got \n                     the general idea... \n\n     He heads out, beckons for Schuyler to follow. \n\n     32.  I N T .   C R S   M A I N   F L O O R  -  N I G H T \n\n     Feingold leads him through the office-- SECRETARIES and other \n     WORKERS pack up at the end of the day. \n\n                             FEINGOLD \n                     We design the game around your \n                     schedule, you're free to give it\n                     as much or as little time as you \n                     wish.  And of course, you can call\n                     it quits at any point. \n\n                             SCHUYLER \n                     This was actually a gift.  Did my\n                     brother pay in advance? \n\n                             FEINGOLD \n                     You'd have to ask our billing \n                     department... the price varies.  But\n                     our service comes with a guarantee.\n                     If you're not satisfied, there's no \n                     charge.  And we've never had an\n                     unsatisfied customer... \n\n                             SCHUYLER \n                     You mean dissatisfied. \n\n                             FEINGOLD \n                        (looking at a form) \n                     Mm, that's right-- you're a left-\n                     brain word fetishist. \n\n                             SCHUYLER\n                     I get that all the time. \n\n     Feingold smiles tightly and leads Schuyler back into his office.\n\n     33.  I N T .   F E I N G O L D ' S   O F F I C E  -  D A Y \n\n     CLOSE ON PAPERWORK as it's dropped on the desktop. \n\n     SCHUYLER, CRS pen in hand, looks at this dubiously.\n\n                             SCHUYLER \n                     So I'm supposed to sign up for a \n                     game when I don't know the rules,\n                     I don't know the object, I don't\n                     know how much it costs... \n\n                             FEINGOLD \n                     It's a leap of faith.  But at this\n                     stage, there's no commitment-- we\n                     just need to process your \n                     application.  And if you qualify,\n                     you're in for the ride of your \n                     life.  What have you got to lose? \n\n     Schuyler CLICKS the ballpoint pen, they both lean over the papers. \n\n                             FEINGOLD \n                     Initials-- initials-- sign here. \n\n     Schuyler's about to sign when Feingold grabs his wrist. \n\n                             FEINGOLD\n                     In blood. \n                             (a WINK)\n                     ---Just kidding. \n\n     CLOSE, as Schuyler SIGNS on the dotted line. \n\n     FEINGOLD snatches up the forms, suddenly seems in a hurry for\n     Schuyler to go. \n\n                             FEINGOLD \n                     Very good, Mr. Van Orton.  Please,\n                     keep the pen. \n\n     Schuyler shrugs, sticks it in his breast pocket, starts out. \n\n                             SCHUYLER \n                     When can I expect to hear-- \n\n                             FEINGOLD \n                     We'll be in touch. \n\n     Feingold gently shuts the door on schuyler's face.\n\n     S C E N E   3 4   D E L E T E D \n\n                                                       CUT TO: \n\n     35(NEW).  I N T .   R A C Q U E T B A L L   C O U R T / C O R R I D O R  -  D A Y\n\n     WHAM, a BALL SLAMS against a wall. \n\n     THROUGH A WINDOW, we see SCHUYLER playing violently, pumping \n     sweat... he's alone.  We hear the sound of a PHONE CALL OVER: \n\n                             SCHUYLER (V. O.) \n                     David, where the hell are you, we \n                     were supposed to meet at the club-- \n\n                             DAVID (V. O.) \n                     Oh, shit, sorry Sky, I spaced--\n                     next Tuesday?\n\n                             SCHUYLER (V. O.)\n                     I'll be in Seattle. \n\n                             DAVID (V. O.) \n                     Buy you lunch soon as you get\n                     back, I swear... \n\n     Fed up with playing alone, Schuyler lets the ball bounce, exits the\n     court and heads for a LOCKER ROOM down the hall...\n\n                             SCHUYLER (V. O.) \n                     I checked out CRS by the way-- \n\n                             DAVID (V. O.) \n                     Hey, great, you gonna go for it? \n\n                             SCHUYLER (V. O.)\n                     Haven't decided yet...\n\n     S C E N E   3 6   D E L E T E D \n\n     37(NEW).  E X T .   C O U N T R Y   C L U B   B A R  -  D A Y \n\n     SCHUYLER, in casual clothes, hair still wet from a shower, comes \n     out of a locker room area toward an outdoor BAR by a SWIMMING POOL\n     at this upscale country ciub.  He passes PETE and JOHN, two middle- \n     aged RICH MEN sitting at a table near the bar; he overhears a\n     snippet of their conversation-- \n\n                             JOHN \n                     --like fuckin' wildfire, just \n                     opened an office in Frisco here-- \n\n                             PETE \n                     I played my game in New York...\n                     What do you think John, will CRS\n                     ever go public? \n\n                             JOHN \n                           (laughs) \n                     Not likely, would you? \n\n     Schuyler slows down, eavesdropping, then moves toward the bar,\n     addresses the BARTENDER with a nod toward John and Pete. \n\n                             SCHUYLER\n                     New members? \n\n                             BARTENDER\n                     I believe so. \n\n                             SCHUYLER \n                     This round's on me. \n\n     Schuyler moves casually toward the men--\n\n                                                  DISSOLVE TO: \n\n     38(N). SAME LOCATION, LATER, the bartender brings another round of\n     drinks to the table, Schuyler and the men have been chatting a \n     while, all seem relaxed.  Pete, the friendlier (drunker) of the\n     two, puffs a CIGAR as he speaks: \n\n                             PETE \n                     ...last time I played Pebble, I swore\n                     I'd never pick up a club again... \n\n     The others CHUCKLE knowingly.  Schuyler sips his drink, blinking\n     and coughing discretely at the smoke; there's a slight pause. \n\n                             SCHUYLER \n                     Great thing about golf, the way it\n                     takes you out of your life...\n                     Speaking of games-- I take it you\n                     two are familiar with CRS...? \n\n                             JOHN \n                     Uh-oh.  Time to piss... \n\n     He slides off his stool.  Pete studies Schuyler, sizing him up. \n\n                             PETE \n                     Why do you ask, Schuyler? \n\n                             SCHUYLER \n                     I couldn't help overhearing-- \n\n                             PETE \n                     We don't usually talk about it. \n\n                             SCHUYLER \n                     I only bring it up because, well,\n                     I recently tested for it. \n\n                             PETE \n                     Did you?  Kudos. \n\n                             SCHUYLER \n                     I just wasn't sure if they're for\n                     real, whether it's worth it-- \n\n                             PETE \n                     Worth it... Gee, I dunno... they did\n                     save my fucking life... \n\n                             SCHUYLER\n                     Sorry? \n\n                             PETE \n                     Look, I don't know you, you don't know\n                     me, but... I hit a certain point, \n                     nothing meant anything.  My work, the\n                     wife and kids-- hell with 'em, I was \n                     sick of it all, y'know?  But CRS... they\n                     changed everything.  \"Are they for \n                     real?\"  Who cares, maybe nothing is.\n                        (raises his glass)\n                     To reality. \n\n     Schuyler raises his glass, numbed by this outpouring.  Pete drains\n     his drink, chuckling to himself.  His friend comes back, looking\n     concerned, takes the man's arm. \n\n                             JOHN\n                     C'mon Pete. \n\n                             PETE \n                       (winks at Schuyler) \n                     Good luck, pal.  You'll need it. \n\n     Schuyler stares after the two men dubiously as they move off.\n\n                                                       CUT TO:\n\n     39.  I N T .   L A W   F I R M   C O N F E R E N C E   R O O M  -  D A Y \n\n     A slick, designery conference room, filled with BABBLING LAWYERS-- \n     at the head of the table stands BOB PLYMPTON, a trustworthy man in\n     his late 50's.  MURMURING CONTINUES during Plympton's address. \n\n                             PLYMPTON \n                     Excuse me.  Excuse me!  Postponing\n                     the Baer-Grace meeting is out of \n                     the question.  Schuyler gets on a\n                     plane for Washington tomorrow\n                     morning at seven with every \n                     contract, every side agreement, \n                     the complete closing package!\n\n     Schuyler has been going through paperwork in the back of the room,\n     he steps forward during the above. \n\n                             LAWYER \n                     But there's simply no-- \n\n     THWAP!  Schuyler DROPS the stack of papers on the table, SILENCE. \n\n                             SCHUYLER \n                     No is not an option.  If you fail\n                     to recognize that, I'll find ten\n                     other law firms in the yellow \n                     pages that can get the job done-- \n\n     CHIRP.  Schuyler's CELL-PHONE has started RINGING during the above.\n     He finally removes it from his pocket and moves to a quiet corner. \n\n                             SCHUYLER\n                           (impatient) \n                     Yes. \n\n     QUIET COMMOTION resumes IN BG during the following.  On the other\n     end of the line, there's the bland, bureaucratic VOICE of CYNTHIA:\n\n                             CYNTHIA (filter)\n                     Mr. Van Orton? \n\n                             SCHUYLER \n                     Yes, who is this? \n\n                             CYNTHIA (filter) \n                     This is Cynthia at CRS... \n\n                             SCHUYLER \n                     What?!  How did you get this number? \n\n                             CYNTHIA (filter) \n                     I'm just calling to inform you\n                     that we've finished processing\n                     your application-- \n\n                             SCHUYLER \n                     I'm in a meeting-- \n\n                             CYNTHIA (filter) \n                     --and I'm afraid you didn't qualify. \n\n                             SCHUYLER \n                     --so I don't have time for--\n                       (beat, then quickly) \n                     Excuse me, what was that? \n\n                             CYNTHIA (filter) \n                     Well... your application was rejected. \n\n                             SCHUYLER\n                     ...Why? \n\n                             CYNTHIA (filter) \n                     Oh, I'm afraid I don't have that \n                     information, but-- many applicants\n                     don't meet the criteria.  We\n                     apologize, we hope it hasn't \n                     caused you any inconvenience-- \n\n                             SCHUYLER\n                     This is absurd-- \n\n                             CYNTHIA (filter) \n                     Thank you for thinking of CRS. \n\n     CLICK and a DIAL TONE.  Schuyler shuts the phone and replaces it in\n     his pocket, his mind suddenly far away from the meeting at hand.\n     PLYMPTON, a wel1-meaning man with a fatherly attitude toward\n     Schuyler, steps close to him and speaks quietly, concerned: \n\n                             PLYMPTON\n                     Bad news, Sky? \n\n                             SCHUYLER \n                     No, nothing.  Sorry, Bob.\n                        (loudly, to boardroom) \n                     So were there any more questions, or\n                     may I assume it's under control... \n\n                                                       CUT TO: \n\n     40.  E X T .   V A N   O R T O N   H O U S E  -  N I G H T \n\n     SCHUYLER pulls up in his MBZ, the electric gate glides shut.  He\n     gets out of the car and SETS THE ALARM.  He heads for the front\n     steps of his home-- then freezes, blinks-- \n\n     ON HIS DOORSTEP lies a body, face-down, apparently a WINO, in a\n     tattered, filthy overcoat. \n\n                                                  FLASH CUT TO:\n\n     41.  E X T .   V A N   O R T O N   H O U S E  -  D A Y  (FLASHBACK) \n\n     SAME ANGLE, QUICK SHOT of the body of MR. VAN ORTON, sprawled \n     across the steps in much the same position as the wino, flat on his \n     stomach, head twisted at a grotesque angle.  His bathrobe is even\n     similar in color to the wino's overcoac. \n\n                                                  CUT BACK TO:\n\n     42.  E X T .   V A N   O R T O N   H O U S E  -  N I G H T \n\n     SCHUYLER shakes off the memory, looking alarmed.  He calls out:\n\n                             SCHUYLER \n                     Hello!  What are you doing here? \n\n     THE BODY doesn't stir.  He approaches gingerly.\n\n                             SCHUYLER \n                     Wonderful.  You OK?  You dead? \n\n     He crouches by the wino, winces at a strong smell, covers his nose.\n     He reaches out to touch the body, but hesitates, pulls back.  Alive\n     or dead, he doesn't want to have anything to do with this person. \n\n                             SCHUYLER \n                     Shit, shit, shit...\n\n     The \"wino\" suddenly SPRINGS UP like a jack-in-the-box, bending\n     backwards impossibly at the hips.  Schuyler lets out a CRY and \n     scrambles back toward his car.\n\n     THE HEAD swivels to face him-- it's a grotesque HARLEQUIN, its head\n     made of COLORED GLASS, LIT from within.  The MOUTH DROPS OPEN and a \n     tongue in the shape of a corkscrew SPRINGS OUT. \n\n     A SMALL KEY ON A HOOK dangles from the tip of the tongue.  One of\n     the harlequin's glass eyes WINKS. \n\n     SCHUYLER stares in amazement for a few moments. \n\n     CLOSE on the dangling KEY as Schuyler fingers it.  The key catches\n     the light and we see the letters \"CRS\" embossed on it. \n\n     42B(NEW).  I N T .   S C H U Y L E R ' S   F O Y E R  -  N I G H T \n\n     THE DUMMY is dumped in a straight-back chair in the foyer. \n\n     SCHUYLER takes a step back and studies it.  He crosses its legs,\n     smirks and shakes his head, ascending the stairs. \n\n     CLOSE ON the disturbing empty stare of the DUMMY...\n\n                                                       CUT TO: \n\n     43.  I N T .   S C H U Y L E R ' S   B A T H R O O M / B E D R O O M  -  N I G H T \n\n     CLOSE ON SCHUYLER'S EYE as he blinks and removes a CONTACT LENS.  A\n     NEWSCAST is barely audible in BG. \n\n     WIDER, Schuyler, squinting, in a bathrobe, enters from the bathroom\n     off the bedroom, putting his contact lens case into a toiletries\n     case.  He's been packing a leather GARMENT BAG, which hangs from a\n     door, slips the toiletries into a \"side pouch.  The TV PLAYS in BG,\n     Bernard Shaw delivering the news. \n\n                             BERNARD SHAW (on TV) \n                     ...the bill goes before the House\n                     next week, where it's expected to\n                     meet stiff opposition-- \n                         (beat, touches his ear)\n                     Wait, this just in... \n\n     This gets Schuyler's attention, he squints toward the television. \n\n                             BERNARD SHAW (cont., on TV)\n                     The U. S. geological service has \n                     detected a massive disturbance in the \n                     earth's crust deep beneath the northern\n                     segment of the San Andreas fault... \n\n     SCHUYLER scrambles for his glasses, as Shaw struggles to continue. \n\n                             BERNARD SHAW (cont., on TV) \n                     ...they have issued a warning that a\n                     major earthquake of magnitude eight\n                     or greater is likely to hit the San\n                     Francisco Bay area within...\n                             (a beat) \n                     Oh my God, the next fifteen minutes-- \n\n     SCHUYLER sits on the bed, breathes hard, stares at the tube. \n\n                             BERNARD SHAW (cont., on TV)\n                     There is no time for an evacuation.\n                     The federal government has issued \n                     the following instructions for all\n                     residents of central and northern\n                     California... \n\n     SCHUYLER is freaking out, paces frantically, moves toward a phone--\n     who's he going to call?  He makes a low MOAN. \n\n     SHAW'S voice CRACKS, he speaks very rapidly. \n\n                             BERNARD SHAW (cont., on TV)\n                     Locate emergency shut-offs for all\n                     power and gas-- \n\n     SCHUYLER starts moving out of the room-- \n\n                             BERNARD SHAW (cont., on TV) \n                     Wait, there's no time for that-- just\n                     stay away from windows and doors-- \n\n     SCHUYLER doubles back, avoiding a window, his panic mounting-- \n\n                             BERNARD SHAW (cant., on TV) \n                     Find a heavy piece of furniture such as\n                     a desk or table and get under it-- \n\n     SCHUYLER looks around, sees no such appropriate spot in the room. \n\n                             BERNARD SHAW (cant., on TV)\n                     If no such furniture is immediately\n                     available, go to a window or doorway-- \n\n     SCHUYLER blinks, hesitates starts to move toward the doar-- \n\n                             BERNARD sHAW (cant., on TV) \n                     But first turn off all power and gas.\n                     Crouch in a comfortable position, put \n                     your head between your knees and cover\n                     it with your arms-- \n\n     SCHUYLER, confused, crouches as instructed--\n\n                             BERNARD SHAW (cant., on TV) \n                     Then KISS YOUR LILY-WHITE ASS GOODBYE! \n\n     On this last line, Shaw's voice starts to ECHO and CHANGE.\n\n     SCHUYLER rises, staring at the TV, mouth agape.\n\n     SHAW WINKS.  His VOICE is utterly transformed.\n\n                             BERNARD SHAW (on TV) \n                     Howdy Sky. \n\n     HIS FACE RIPPLES and MORPHS into a SKULL, it's becoming clear that\n     this is a computer-generated Bernard shaw. \n\n                             CYBERSHAW (on TV)\n                     Que pasa? \n\n     As CYBERSHAW speaks, his face will continue to transform, sometimes\n     back to a recognizable human state, other times into abstract\n     images, a talking piano, a dog, etc. \n\n                             CYBERSHAW (on TV)\n                     Welcome to the Game! \n                     Congratulations on your decision\n                     to let Consumer Recreation\n                     Services entertain you. \n\n     The combination of relief, amazement and anger is a bit much for\n     Schuyler to absorb.  Smiling sickly: \n\n                             SCHUYLER \n                     Fuckers! \n\n                             CYBERSHAW (on TV) \n                     This might be a good time to lay out\n                     a few ground rules, help you enjoy \n                     your adventure.  You've received the\n                     first key.  There will be others. \n                     Pay attention-- you never know where\n                     you'll find 'em, you never know when\n                     you'll need 'em, so keep 'em with\n                     you at all times... \n\n     As he speaks, Schuyler reaches for the gold key on his bedside\n     table.  He starts putting it onto his keychain. \n\n     ON TV SCREEN-- below CyberShaw, a PHONE NUMBER SCROLLS PAST. \n\n                             CYBERSHAW (on TV) \n                     You might want to write this number \n                     down, it's the CRS hotline, operators\n                     are standing by to assist... but \n                     please don't call to ask what the \n                     object of the game is-- figuring that\n                     out is the object of the game...\n\n     SCHUYLER has snatched up the CRS pen to write down the number-- it\n     doesn't work.  SWEARING, he tosses it aside, grabs another. \n\n     ON TV, CyberShaw MORPHS back into the original Bernard Shaw. \n     There's a quick VISUAL GLITCH on the tube as the original TV feed\n     resumes-- Bernard Shaw is delivering a normal news story. \n\n                             BERNARD SHAW (on TV) \n                     --reaction on wall Street was muted \n                     following the Fed's announcement of... \n\n     SCHUYLER is taken with the display of electronic pyrotechnics, in\n     spite of himself.  He hits the speaker button on his phone, dials. \n\n                             OPERATOR VOICE (filter)\n                     You've reached CRS... \n\n                             SCHUYLER \n                     Yeah, this is pretty impressive \n                     but listen-- \n\n                             OPERATOR VOICE (filter) \n                     Our office is closed.  Please call\n                     back during business hours.\n                              (BEEP) \n\n                             SCHUYLER \n                     My name is Schuyler Van Orton, my \n                     game just started.  Look, this is a\n                     bad time, I'm about to leave town-- \n\n     A DIAL TONE, CRS doesn't take messages.  Schuyler sighs, HANGS UP. \n\n     44.  E X T .   V A N   O R T O N   H O U S E  -  N I G H T \n\n     SCHUYLER crouches by a coaxial cable line emerging from the side of\n     the house.  He fingers a box with a miniature LOOP and RABBIT EAR\n     ANTENNA that's been spliced into the line with a tiny S-shaped \n     WIRE.  He starts to unscrew it, then thinks twice, heads back in. \n\n     WIDER, as Schuyler enters his mansion, a GIBBOUS MOON OVERHEAD.\n\n                                                       CUT TO:\n\n     45.  E X T .   S E A - T A C   A I R P O R T  -  D A Y\n\n     Mist in the air, a jet taxis to a terminal. \n\n     46.  I N T .   S E A - T A C   T E R M I N A L  -  D A Y \n\n     SCHUYLER comes out of the gate with the garment bag and a \n     briefcase.  He joins up with a DRIVER carrying a sign that says VAN\n     ORTON, the man takes his bag for him. \n\n                             SCHUYLER \n                     I'm expecting a package with some\n                     documents.  Did it arrive? \n\n     The man shakes his head, Schuyler, exasperated, whips out his cell-\n     phone and dials.  As he and the driver move through the CROWD, they\n     pass a red-eyed, dredlocked, homeless-looking RASTA MAN in a \n     BRIGHTLY COLORED outfit with knit cap, hassling other TRAVELERS.\n     He turns his attention to Schuyler and begins walking alongside. \n\n                             RASTA MAN \n                     Ay mon, got sometin' fo you mon. \n\n                             DRIVER \n                         (to the rasta)\n                     Get lost, pal. \n\n                             RASTA MAN\n                     No can do. \n\n                             SCHUYLER (on phone) \n                     Bob, it's Sky, what the hell is \n                     going on?  No, the papers aren't \n                     here, you'll have to fax signature\n                     copies straight to the BG offices\n                     now.  Yeah I'll hold. \n\n     The driver and Schuyler climb into a little white people mover \n     cart, the driver starts forward, BEEPING at folks in the way.  The\n     rasta man continues to badger Schuyler. \n\n                             RASTA MAN \n                     You want what I got, mon. \n\n                             SCHUYLER \n                        (hand over the phone)\n                     No thank you. \n\n                             RASTA MAN \n                     Dere are many paths to \n                     enlightenment, but you must choose\n                     one and stay on it-- or you will\n                     surely die in the darkness-- \n\n                             SCHUYLER \n                     I'll take my chances.\n\n     The rasta man jogs alongside, holds up a stained, newsprint\n     religious TRACT, Schuyler glances at it without taking it-- \n\n     CLOSE-- we see the words \"CRISIS, REVELATION, SOLUTION.\"  The\n     letters C, Rand S are printed in a different color from the rest. \n\n     WIDER-- Schuyler ignores the tract, he's talking to Bob again on\n     the phone.  The driver SPEEDS UP as they pass a guard, entering a\n     restricted access area. \n\n                             SCHUYLER (on phone)\n                     What?!  Fire their asses, that's it. \n\n     The Rasta Man runs out of breath as the cart SPEEDS UP.  He calls\n     after Schuyler:\n\n                             RASTA MAN \n                     Jah Love mon, dat's the key, dat's the key... \n\n     47.  E X T .   S E A - T A C   T E R M I N A L  -  D A Y \n\n     Cold and bleak.  The little white truck emerges from the terminal,\n     crosses the tarmac, heading toward an IDLING HELICOPTER, where is\n     stops.  From the chopper, ALAN BAER emerges-- he's an elderly,\n     muscular man, bluff, once blue-collar.  He gives Schuyler a firm\n     handshake.  They have to SHOUT over the WHIRRING BLADES: \n\n                             SCHUYLER \n                     Alan!  What's wrong with a car-- \n\n                             BAER \n                     I'm giving you an overview of our \n                     little operation!  You gotta see the\n                     new breed of high yield saplings... \n\n     SCHUYLER looks uncomfortable with this prospect.  The driver is\n     already loading his bag into the chopper.  Baer claps a hand on \n     Schuyler's shoulder, leading him under the wash, into the chopper. \n\n     THE RASTA MAN is walking slowly across the tarmac nearby.  He\n     watches the HELICOPTER ASCEND with a half-smile. \n\n     48.  I N T .   H E L I C O P T E R  -  D A Y \n\n     SCHUYLER and BAER in the back of the chopper. \n\n                             BAER\n                     How was your flight? \n\n                             SCHUYLER\n                     Fine. \n\n     Schuyler looks out the window. \n\n     SCHUYLER'S POV - On the PASTA MAN in his colorful clothes, now\n     holding up a dangling KEY on a chain.  Moments later, he's\n     invisible in the MIST. \n\n     ON SCHUYLER, looking disappointed, and annoyed with himself-- he\n     realizes he's missed something.  He reaches into his pocket as Baer\n     DRONES ON beside him.  Schuyler pulls out his KEYS, fingers the\n     gold one with the CRS logo, thinking. \n\n                                                  DISSOLVE TO:\n\n     49.  E X T .   M O U N T A I N S  -  D A Y \n\n     The HELICOPTER swoops low over a beautiful FORESTED MOUNTAINSIDE.\n\n                                                  DISSOLVE TO: \n\n     50.  I N T .   B A E R - G R A C E   O F F I C E S  -  D A Y \n\n     PAN from a WINDOW.  Outside, we see a sign-- BAER-GRACE LUMBER-- \n     and the helicopter, now idle on a pad.  MOVE PAST a HUMMING FAX\n     MACHINE, find Schuyler addressing Alan Baer across a table.  A\n     couple of other LUMBER EXECS are present.  Everyone wears a\n     stricken expression, Schuyler's tone is matter-of-fact. \n\n                             BAER \n                     You've been planning this for months,\n                     haven't you?  Sandbagging me like \n                     this, selling us for scrap... \n\n                             SCHUYLER \n                     BG lumber is not profitable and \n                     hasn't been for years, my duty is to\n                     salvage what I can.  These are the\n                     closing papers, in ten minutes I'm\n                     going to present the sale terms to\n                     the shareholders and elect my new \n                     management team. \n\n     As he speaks, Schuyler moves to the fax machine.  A TRANSMISSION\n     has come through, he picks up the sheaf of papers. \n\n                             BAER \n                     I was friends with your father, you\n                     bastard, I watched you grow up, and\n                     now you kick me in the balls-- \n\n     Schuyler squints at the papers in his hand, flipping through them. \n\n     CLOSE, the entire transmission has been GARBLED.  The words all\n     BLEED TOGETHER incomprehensibly, it looks like a child's scribbles. \n\n                             BAER (O.S.) \n                     That's not how you play the game. \n\n     SCHUYLER turns on him, a suspicion forming...\n\n                             BAER \n                     You could've fucking told me! \n\n                             SCHUYLER\n                     What game? \n\n     Schuyler studies the SENSELESS PAGES for a moment then puts them\n     down, shaking off his apprehensions. \n\n                             SCHUYLER \n                     Never mind... we'll just have to\n                     go with the earlier draft. \n\n     In BG, one exec picks up a page, WHISPERS to an ASSISTANT, who\n     moves out of the room.  Schuyler moves to his briefcase.  It's\n     LOCKED.  He starts patting his pockets. \n\n                             BAER\n                     Can't find your keys? \n\n     Baer has a malevolent expression.  Schuyler looks at him. \n\n                             SCHUYLER\n                     Where are they. \n\n                             BAER\n                     Up your ass?\n\n     A couple of execs stifle chuckles.  Schuyler's suspicions mount. \n\n                             SCHUYLER\n                     Up my ass, very funny... \n\n     His eyes drift to a piece of CORPORATE STATIONARY on the table in\n     front of him.  He picks it up:\n\n     INSERT - UNDER BAER-GRACE LETTERHEAD we see a handscrawled note:\n     \"CRS CALLED.\"  We don't see what's written below. \n\n     SCHUYLER is reeling, paranoia confirmed. \n\n                             SCHUYLER \n                     I don't-- OK.  OK, you're with CRS... \n\n     Baer stares at him blankly.  Schuyler puts a hand over his eyes,\n     seems disoriented, trying to piece it all together. \n\n                             SCHUYLER\n                     So the game, it's just a screen, to\n                     blow this deal...\n\n                             BAER \n                     I'm not following you. \n\n                             SCHUYLER \n                     Like hell you aren't.  How did you\n                     get my brother involved, that's\n                     unforgivable.\n\n     The assembled execs are looking at Schuyler in utter confusion.  As\n     he speaks, the ASSISTANT returns with some PAPERWORK.  Schuyler\n     stares at him menacingly.  Hesitantly: \n\n                             ASSISTANT \n                     Um... sorry to interrupt.  We've\n                     been having some trouble with this \n                     fax, so they re-sent the material.\n                     It's all OK now. \n\n     The assistant comes over, cheerfully places the crucial documents\n     in front of Schuyler.  The assistant fishes in his pocket. \n\n                             ASSISTANT \n                     Oh and Mr. Van Orton-- are these \n                     yours?  The pilot found 'em on the\n                     floor of the chopper... \n\n     Schuyler gingerly takes the KEYS which the assistant holds out,\n     looks from them to the paperwork.  Then he glances back at the\n     handwritten note on the table: \n\n     INSERT NOTE:  It actually reads \"CBS CALLED.\"  (Schuyler's thumb or\n     a Post-It note covered the base of the B before, making it look \n     like an R.)  It continues \"Re: Interview with Alan B. on Sun...\" \n\n     SCHUYLER takes a breath, reassembles his composure and consults his\n     watch.  He rises, anxious to put the last few minutes behind him. \n\n                             SCHUYLER \n                     Everything seems to be in order. \n                     Please disregard my last comments.\n                     The shareholders meeting is about\n                     to get underway... Shall we? \n\n     He heads for the door.  As he leaves, the execs exchange looks. \n\n                                                       CUT TO:\n\n     51.  I N T .   S E A - T A C   T E R M I N A L  -  N I G H T \n\n     Schuyler wanders through the terminal, carrying his bags, glancing \n     periodically at the DEPARTURES monitor and the clock.  His manner\n     now has changed, he eyes every PASSERBY, especially the ODD ONES. \n\n                             P. A. VOICE (filter) \n                     Flight 177 to San Francisco is now\n                     boarding at Gate 14... \n\n     Suddenly a leg is thrust out from behind an advertising kiosk, \n     Schuyler TRIPS and goes sprawling.  The Rasta Man steps out, now\n     wearing SUNGLASSES with PINK LENSES. \n\n                             RASTA MAN \n                     Shit mon sorry oughta pay more attention. \n\n     Schuyler gets up, dusts himself off.  As calmly as possible:\n\n                             SCHUYLER \n                     Listen, I quit.\n\n                             RASTA MAN \n                     Free at last... you won't be\n                     needin' this, then. \n\n     He snatches up the briefcase, dances back a few paces.  Schuyler\n     speaks as if to a child. \n\n                             SCHUYLER \n                     No, cretin.  I'm quitting the game. \n\n     The rasta man keeps backing away, puts a hand to his ear. \n\n                             RASTA MAN \n                     Wha's that, mon?  I didna hear you. \n\n     Schuyler is pursuing the man, walking faster and faster.\n\n                             SCHUYLER\n                     I said I-- shit! \n\n     The rasta turns and RUNS, Schuyler bolts after him, unable to \n     believe this is happening.  They draw a lot of looks during the \n     brief chase through the terminal, the suited businessman, garment\n     bag flapping behind him, in pursuit of the crazy rasta. \n\n                             RASTA MAN \n                     Help, help!  The mon is crazy! \n\n     He runs into a MEN'S ROOM, Schuyler follows a moment later. \n\n     52.  I N T .   A I R P O R T   M E N ' S   R O O M  -  N I G H T \n\n     Schuyler has the rasta cornered now-- but he doesn't have the\n     briefcase.  Both are out of breath.  PISSING MEN look wary. \n\n                             SCHUYLER\n                     Where is it? \n\n                             RASTA MAN \n                     Got something better. \n\n     The rasta men holds out a SHINY KEY on a chain.  Schuyler narrows\n     his eyes, he's trying not to lose control of his temper. \n\n                             SCHUYLER \n                     I realize you're just some bit \n                     player, but I'd like you to get a\n                     message to your employers.  This\n                     bullshit is interfering with my \n                     work, it's breaking my concentration\n                     and I can't allow that to happen-- \n\n     THE RASTA makes a sad face, SNIFFLES, still dangling the key. \n\n                             SCHUYLER \n                     If I take that stupid key, will you \n                     give me back my briefcase and go away? \n\n     The rasta nods with a big grin.  Schuyler steps forward, hand\n     extended.  The rasta flings open the door of a STALL beside him and\n     hurls the key into the TOILET.  Instinctively, Schuyler moves to\n     grab it, reaches into the toilet, pulls out the chain, his hand and\n     sleeve DRIPPING.  The key is missing from the end of the chain. \n\n                             SCHUYLER \n                     What the fuck am I doing?! \n\n                             RASTA MAN \n                     Don' worry, mon, it's a world a shit. \n\n     He drops the rasta schtick, speaks with an Ivy League accent: \n\n                             RASTA MAN \n                     So try looking at it through rose-\n                     colored glasses... here. \n\n     He takes off his sunglasses, folds them and tucks them in the\n     pocket of Schuyler's suit.  Then he reaches above him and pulls \n     down the briefcase, which was perched on top of the stall.\n     Schuyler grabs it from him, raises his voice: \n\n                             SCHUYLER \n                     I told you, this is over!  I quit! \n\n                             RASTA MAN \n                     They all say that at first. \n\n     He gives Schuyler a hearty SLAP on the back and strolls off,\n     HUMMING.  Schuyler leans against the wall, shaking his head.  He\n     puts down his luggage, pulls the sunglasses from his pocket. \n\n     CLOSE ON SUNGLASSES-- there's the image of a tiny GOLD KEY embossed\n     on each of the arms. \n\n     SCHUYLER puts them on, looks around for a moment, catches a GLIMPSE\n     of himself in the mirror-- he looks silly.  He quickly takes them\n     off.  As Schuyler heads out the door we see him from behind... the\n     Rasta has slapped a colorful SIGN that reads \"KICK ME\" on his back. \n\n                                                       CUT TO:\n\n     53.  E X T .   L E O ' S  -  D A Y\n\n     THE NEON SIGN FIZZLES in front of this low-rent establishment.\n\n     54.  I N T .   L E O ' S  -  D A Y \n\n     BELLS RING and LIGHTS FLASH as a DRUNK plays a PINBALL MACHINE with \n     a lot of body English.  SCHUYLER, stuck at a table right next to \n     the machine, winces at the noise, checks his watch and rises.  He\n     makes his way through the lunch hour CROWD to the bar, leans toward\n     the bartender, a gravelly-voiced woman-- RONNIE. \n\n                             SCHUYLER \n                     I was supposed to meet someone \n                     here, a David Van Orton-- I was \n                     wondering if he'd left a message. \n\n                             RONNIE \n                     'Fraid not, sorry. \n\n     He drums his fingers, then whips out a CELLPHONE, spins around\n     quickly as he starts to dial-- \n\n     --and SMACKS into Christine the waitress as she emerges from the\n     kitchen carrying a tray-- \n\n     --SCHUYLER gets hit in the chest with a TRAY OF DESSERTS, colorful\n     JELLO, CREAM PIE, etc.  He stands there, stunned and DRIPPING. \n\n                             CHRISTINE\n                     Fuck me! \n\n     She starts picking up plates and silverware, oblivious to \n     Schuyler's own plight; Ronnie charges out from behind the bar. \n     After the first shock, Schuyler CHUCKLES with annoyance.  He wipes\n     the phone clean, pocketing it. \n\n                             SCHUYLER \n                     Oh this is cute.  Very cute. \n\n                             RONNIE \n                     What happened here, you OK? \n\n                             CHRISTINE \n                     It was an accident-- \n\n                             SCHUYLER\n                     No it wasn't. \n\n     Ronnie gives Christine a look as she starts wiping at Schuyler with\n     a rag.  He picks at his chest, examines the WHIPPED CREAM, tastes \n     it.  Schuyler addresses the kneeling Christine: \n\n                             SCHUYLER \n                     What's next, a giant banana peel? \n\n     CHRISTINE squints up at him, puzzled. \n\n                             CHRISTINE \n                     Huh?  Oh I get it-- you're nuts. \n\n                             RONNIE\n                     Chrissy, just apologize... \n\n                             CHRISTINE \n                     Dickhead here was on the phone, he\n                     walked right into me! \n\n                             SCHUYLER \n                     Drop the act, you've been waiting\n                     all day for this moment. \n\n                             CHRISTINE\n                     Shut the fuck up. \n\n                             RONNIE\n                     Go home, you're fired. \n\n                             CHRISTINE\n                     What?... \n\n                             RONNIE\n                     You heard me. \n\n                             CHRISTINE\n                     Fuck you too. \n\n     She THROWS a plate on the ground, it shatters, then storms off into\n     the kitchen.  Schuyler CHUCKLES angrily, pushing through the slop\n     on the floor with his shoe, looking for something. \n\n                             SCHUYLER \n                     Let's get this over with... Where's\n                     the next key?  Does she have it? \n\n     Ronnie stares, uncomprehending... Schuyler goes after Christine.\n\n     55.  I N T .   L E O ' S   K I T C H E N  -  D A Y \n\n     He crosses past a short-order COOK in the grimy industrial kitchen,\n     pulling a cube of JELLO out of his lapel pocket.  He finds\n     Christine in an alcove with a couple of lockers, as she finishes\n     changing into her street clothes.  Her brown uniform hangs from a\n     locker door, the nameplate \"CHRIS\" prominent. \n\n     CLOSE as his fingers touch the CRS of CHRIS-- they even look a bit\n     brighter than the H and the I. \n\n                             SCHUYLER \n                     I wish you people could be a\n                     little more subtle. \n\n     CHRISTINE notices him for the first time. \n\n                             CHRISTINE \n                     Asshole, just send me the goddamn\n                     dry-cleaning bill.  Could you--? \n\n     She waves a hand at him, \"go away\" and ducks out of view, finishing\n     dressing into punk-grungy street clothes.  She SLAMS the locker,\n     starts to push past him, pulling on her backpack bag. \n\n                             SCHUYLER \n                     Don't you have something for me? \n\n                             CHRISTINE \n                     Uh-huh sure, here you go. \n\n     She puts her hand into her side pocket, pulls it out with her\n     middle finger extended, moving away from him in a hurry.\n     Schuyler's face falls-- he made another mistake. \n\n                             SCHUYLER \n                     Wait, you really work here-- \n\n                             CHRISTINE\n                     Not anymore, thanks to you. \n\n     She's out the SWINGING kitchen door.  Schuyler absorbs his blunder\n     for a moment, then hurries after her. \n\n     56.  E X T .   L E O ' S  -  D A Y \n\n     Schuyler catches up as Christine hurries toward a MUNI station,\n     LIGHTING a cigarette.  A few PEDESTRIANS come off the steps from\n     the arriving elevated train in this residential SF neighborhood. \n\n                             SCHUYLER\n                     Slow down-- you don't understand, I\n                     thought it was a gag. \n\n                             CHRISTINE \n                     No, you don't understand.  I carry\n                     mace and I know how to use it. \n\n     She reaches into her purse/backpack, Schuyler backs off. \n\n                             SCHUYLER \n                     I was only trying to apologize. \n\n                             CHRISTINE \n                     Shit, it's in here somewhere-- \n\n                             SCHUYLER\n                     Fine. \n\n     He starts to move away, then they both hear GASPING O. S.-- \n\n     ON THE STEPS, a HEAVY MAN, 60, in a coat and tie has collapsed, \n     struggling for breath, very pale.  Christine and Schuyler are the\n     only pedestrians around now. \n\n                             CHRISTINE\n                     Shit-- \n\n     She rushes to help the guy, loosening his tie-- he JOLTS. \n\n     SCHUYLER looks up at them dubiously, brushing a scrap of food still\n     clinging to his suit. \n\n     CHRISTINE reaches in to clear the guy's throat, starting CPR.  She\n     shoots a look at Schuyler. \n\n                             CHRISTINE \n                     You got a fucking phone, call an\n                     ambulance! \n\n     Schuyler approaches slowly, pulling out his phone, studying the guy as\n     Christine gives him mouth-to-mouth. \n\n                             SCHUYLER \n                     This is just too weird-- it can't\n                     be real-- \n\n                             CHRISTINE \n                     You really are insane! \n\n     SCHUYLER leans close to look at the man. \n\n     ON THE MAN'S FACE-- sweating, contorted, unnaturally pale, his eyes\n     rolling back as he GAGS his last...\n\n     CHRISTINE grabs the phone away from Schuyler, dials. \n\n                             CHRISTINE \n                     We need an ambulance, guy's having a \n                     heart attack near the MUNI station at\n                     5th and Market-- \n                          (to Schuyler) \n                     What's the number on this thing?! \n\n                             SCHUYLER \n                     I don't give it out-- \n                       (off her horrified look)\n                     731-5723-- \n\n                             CHRISTINE \n                     731-5723-- yeah, thanks--\n\n     She stuffs the phone in a pocket and pumps the man's chest, returns\n     to the mouth-to-mouth.  Schuyler looks around uncomfortably, \n     starting to believe this is a real heart attack. \n\n                             SCHUYLER \n                     Is there anything I can do? \n\n     CHRISTINE ignores him, all attention on saving this guy's life...\n\n     56A. WIDE as an AMBULANCE pulls up, SIREN BLARING.  A couple of\n     MALE PARAMEDICS hurry out with a stretcher. \n\n     ON THE STEPS, the two PARAMEDICS lift the unconscious HEAVY MAN\n     onto the stretcher while Christine and Schuyler stand aside.  Both\n     have small EARPIECES that look like hearing aids, with wires into\n     their clothes.  Throughout the following, there's a lot of MEDICAL\n     BUSINESS-- feeding the victim OXYGEN, giving him INJECTIONS, etc. \n\n                             PARAMEDIC #1\n                          (to Schuyler) \n                     Could you come with us, help us\n                     fill out a few forms-- \n\n                             SCHUYLER \n                     No!  I have work to do-- \n\n                             CHRISTINE\n                     I'll go. \n\n     She climbs into the back, they start to shut the doors. \n\n                             SCHUYLER \n                     Wait a minute, you've got my phone-- \n\n     He climbs in to get it back, they SLAM THE DOORS and start moving. \n\n     THE AMBULANCE peels out.  We now see the LOGO on the back:\n     \"CITYWIDE RESCUE SYSTEMS,\" with the C, R and S in RED. \n\n     57.  I N T .   A M B U L A N C E  -  D A Y \n\n     The PARAMEDICS are intent on the gasping man.  The SIREN BLARES, a\n     bit MUFFLED in here.  Schuyler, looking out the back, is extremely\n     pissed, makes a fist and almost punches the wall of the ambulance. \n\n                             CHRISTINE \n                     Chill, will you?! \n\n                             SCHUYLER\n                     I don't want to be here. \n\n                             CHRISTINE \n                     Neither do I, now siddown, get\n                     outta their way! \n\n     A BUMP almost sends him flying atop the stretcher.  Schuyler sits\n     near Christine on a ledge near the back doors.  Petulant: \n\n                             SCHUYLER \n                     I'd like my phone back please. \n\n                                                       CUT TO:\n\n     58(NEW).  I N T .   H O S P I T A L   E N T R A N C E / G A R A G E  -  D A Y \n\n     An UNDERGROUND RAMP, signs reading \"EMERGENCY VEHICLES ONLY,\" a set\n     of DOORS leading into the lobby of an EMERGENCY ROOM; MEDICAL\n     PERSONNEL visible inside, INJURED PEOPLE, etc., a few PEOPLE mill\n     outside the doors. \n\n     THE AMBULANCE SCREECHES to a stop, the back doors fly open, the\n     PARAMEDICS wheel out the dying man and rush into the entrance,\n     automatic doors OPEN and CLOSE for them.  Schuyler and Christine\n     climb out, disoriented, walking more slowly to the doors.  The\n     AMBULANCE pulls away behind them.  Schuyler nearly slips in a\n     mysterious dark PUDDLE. \n\n                             SCHUYLER \n                     Oh, this day keeps getting better. \n\n                             CHRISTINE \n                     What is your problem, you think \n                     the whole fucking world revolves\n                     around you? \n\n     As she says this, she walks right into the ELECTRIC DOORS, which\n     fail to open for them. \n\n     THEIR POV-- THROUGH THE DOORS the gathered STAFF and PATIENTS all\n     turn at once to regard Christine and Schuyler.  They GRIN and WINK. \n\n     ON SCHUYLER AND CHRISTINE, who barely get the chance to register\n     this before-- \n\n     THE LIGHTS GO OUT... PITCH BLACKNESS and SUDDEN SILENCE.  We hear \n     only SCHUYLER'S BITTER LAUGHTER.  Dialogue OVER DARKNESS: \n\n                             SCHUYLER \n                     As a matter of fact... \n\n                             CHRISTINE \n                     What the fuck is going on?! \n\n     We hear RUSTLING in a purse, but still see next to nothing. \n\n                             SCHUYLER \n                     It's a little hard to explain...\n\n                             CHRISTINE\n                     Try! \n\n     We hear the STRIKING OF A MATCH, there's some ORANGE LIGHT--\n     CHRISTINE holds the match.  The whole area is DESERTED, except for \n     the two of them.  SCHUYLER kicks at the glass doors-- they're not\n     going to give, nothing is visible beyond them. \n\n                             SCHUYLER \n                     I seem to be playing a game.  This\n                     is supposed to be funny-- \n\n                             CHRISTINE\n                     I don't get it.\n\n                             SCHUYLER\n                     --a challenge, a puzzle. \n\n                             CHRISTINE \n                     OK, I'm puzzled.  Where are we? \n\n     SCHUYLER has found a STEEL DOOR with a GLOWING RED SIGN:  EMERGENCY\n     USE ONLY.  He yanks it open and a PAIL swings down, dumping WATER\n     on his head.  He's facing a BRICK WALL through the door. \n\n     CHRISTINE can't help but LAUGH, then YELPS in pain as the match\n     burns her fingers.  LIGHTS another.  Schuyler flips open his phone.\n\n                             SCHUYLER \n                     Damn it, no signal. \n\n                             CHRISTINE \n                     Here's a lightswitch-- \n\n                             SCHUYLER\n                     I wouldn't-- \n\n     She flips it on, A BLINDING STROBE FLASHES for a few seconds-- both \n     CRY OUT-- then the BULB EXPLODES in a shower of sparks. \n\n                             SCHUYLER \n                     I don't know the rules, if there are\n                     any, but it seems the obvious move\n                     usually backfires...\n\n                             CHRISTINE \n                     Of course.  I have no idea what \n                     you're talking about.\n\n     They've taken a few steps forward, exploring the DARK.  She LIGHTS\n     a cigarette with the next match, nearly running into ANOTHER DOOR.\n     She RATTLES it-- locked. \n\n                             CHRISTINE\n                     Son of a bitch. \n\n                             SCHUYLER \n                     I think I have a key. \n\n     Schuyler pulls out his keyring and tries the gold CRS key-- nope. \n\n                             SCHUYLER\n                     Damn it... \n                       (a beat, thoughtful)\n                     Wrong key... \n\n                             CHRISTINE\n                     Last match. \n\n     In the matchlight, we see Schuyler fumbling in his pockets, pulling\n     out the ROSY SUNGLASSES from the Rasta.  He puts them on. \n\n                             CHRISTINE\n                     Too bright for you, is it? \n\n     SCHUYLER'S POV as the last MATCH GOES OUT-- CHRISTINE GLOWS RED in\n     the matchlight for a moment, then as soon as it goes out, we see a\n     GLOW of FLUORESCENT PAINT on the ground... a series of STRIPES and\n     ARROWS in DIFFERENT COLORS, GLOWING.  These start PARALLEL near\n     where he stands, then RADIATE in different directions.  CHRISTINE\n     is but a SILHOUETTE against the COLORED LINES.\n\n                             SCHUYLER \n                     I can see now.  Grab my arm. \n\n                             CHRISTINE \n                     No way!  You're crazy! \n\n     CHRISTINE moves away from him. \n\n                             SCHUYLER\n                     Stay on the path! \n\n     A BURST OF FLAME erupts from the GROUND close enough to scare the\n     shit out of CHRISTINE, who SCREAMS.  SCHUYLER hurries toward her. \n\n     The FLAMES VANISH, she lurches in a differrent direction-- \n\n                             SCHUYLER \n                     Christine, don't move! \n\n                             CHRISTINE\n                     Leave me alone!\n\n     She LOSES HER FOOTING on a slippery surface, falls, sliding down a\n     gentle SLOPE. \n\n                             CHRISTINE\n                     Help! \n\n     SCHUYLER follows.  FALLING himself.  They try to reach toward each \n     other for purchase, but it's no good, the slope is getting steeper.\n\n     58A. In a moment SCHUYLER tumbles on top of Christine in a four-\n     foot deep round CHILDREN'S POOL, but it isn't full of water.\n     There's a bit of BLACK LIGHT here, enough to make out-- \n\n     --COCKROACHES, thousands of them, a TEEMING ROIL OF INSECTS in a\n     CHURNING LIQUID.  There's a BUZZING NOISE, both SCREAM. \n\n                             CHRISTINE\n                     Aaggh!  BUGS!! \n\n     SCHUYLER quickly helps lift Christine out.  She starts to pull him\n     upward, but-- \n\n                             SCHUYLER \n                     Where are the glasses?! \n\n                             CHRISTINE\n                     Fuck the glasses! \n\n                             SCHUYLER \n                     We can't get out of here without them! \n\n     He steels himself and rummages amidst the bugs, about to get sick,\n     finally coming up with the glasses.  He shakes them free of INSECTS\n     and clambers out to join Christine, who's GASPING and brushing the\n     bugs off of her.  SCHUYLER puts on the glasses and holds up a BUG. \n\n                             SCHUYLER \n                     They're rubber.  Hold onto me,\n                     I'll get us out of here.\n\n                             CHRISTINE\n                     Ha! \n\n                             SCHUYLER\n                     Fine, stay. \n\n                             CHRISTINE\n                     No! \n\n     She grabs his arm; both are now covered in MUCK from the bug soup. \n\n                             SCHUYLER \n                     What's your favorite color?\n\n                             CHRISTINE\n                     ...Blue? \n\n     He takes off the glasses, puts them on her.  She looks around.\n\n     HER POV-- the RAINBOW of COLORED LINES on the FLOOR...\n\n                             CHRISTINE \n                     Wow... OK, this is kinda cool.  Hey! \n\n     SCHUYLER slips the glasses off her, puts them back on.\n\n                             SCHUYLER \n                     Sorry, it's my game.  But we'll\n                     take blue. \n\n     HIS POV-- a BLUE LINE moves in a snaking path ahead of them, going\n     in circles now and then, INTERSECTING or moving PARALLEL to other\n     colors, up a series of ramps.  This space sometimes resembles a\n     PARKING GARAGE, scmetimes a SEWER or a STEAM TUNNEL. \n\n     CHRISTINE keeps a hand on Schuyler as he follows the path. \n\n                             CHRISTINE\n                     Talk about the blind leading the\n                     blind... what's your name anyway? \n\n                             SCHUYLER\n                     Sky Van Orton. \n\n                             CHRISTINE \n                     Sky?  Were your folks hippies or\n                     something? \n\n                             SCHUYLER\n                     Far from it. \n\n                             CHRISTINE \n                     I'm Christine Kaminsky. \n\n                             SCHUYLER\n                     Nice to meet you. \n\n     58B. LATER, CHRISTINE almost hugs Schuyler now, as they move in a\n     seemingly random pattern in the darkness. \n\n                             SCHUYLER \n                     It's a company called Consumer \n                     Recreation Services, CRS.  I never\n                     know what's gonna happen next. \n\n                             CHRISTINE\n                     Well, who does. \n\n                             SCHUYLER \n                     Until recently, I had a pretty\n                     good idea... Duck. \n\n     The BLUE LINE has led them into a NARROW TUNNEL, soon they're\n     crawling on hands and knees. \n\n                             CHRISTINE \n                     So are you like a serious masochist,\n                     or just really, really bored? \n\n                             SCHUYLER \n                     I'm sorry, you shouldn't have been\n                     dragged into this. \n\n                             CHRISTINE\n                     Well... I have to tell you \n                     something.  Some guy came into \n                     Leo's yesterday, showed me your \n                     picture, offered me 250 bucks to\n                     spill that food on you. \n\n                             SCHUYLER\n                     Ah. \n\n                             CHRISTINE \n                     Said it was a practical joke.  I\n                     figured what the hell, I can use\n                     the money-- I got him up to 500. \n                     I hated that fucking job anyway-- \n\n                             SCHUYLER \n                     Wait, so the heart attack, you\n                     knew that was a joke too-- \n\n                             CHRISTINE \n                     No!  It scared the shit out of me-- \n\n                             SCHUYLER \n                     But that CPR routine-- \n\n                             CHRISTINE \n                     I used to be a lifeguard. \n\n                             SCHUYLER\n                             (points) \n                     We're getting somewhere... \n\n     The TUNNEL has opened up again.  There's even a tiny bit of VISIBLE\n     LIGHT now.  He takes off the glasses, gives them to her. \n\n     HER POV-- the COLORED LINES are all joining up from different\n     directions.  A few steps onward they all converge at a point, like\n     the spokes of a wheel, at a WHITE SPOT on the ground...\n\n     SCHUYLER AND CHRISTINE look around, then Schuyler points upward-- \n\n     A WHITE RING overhead... it looks like the underside of a MANHOLE\n     COVER, with an illuminated CIRCLE OF LIGHT around the rim, a halo. \n\n                             CHRISTINE \n                     How do we get up there? \n\n     SCHUYLER steps on the circle of WHITE-- it's a BUTTON.  A ROPE\n     LADDER drops down. \n\n     59.  E X T .   W A L K W A Y  -  E V E N I N G \n\n     A MANHOLE COVER slides aside, SCHUYLER climbs out and helps\n     Christine up.  It's a short, covered WOODEN WALKWAY in an alley. \n\n                             CHRISTINE\n                     Well, that was pointless... but\n                     different... kind of fun... \n\n                             SCHUYLER \n                     Mm, a different kind of fun.\n                     What's your middle name? \n\n                             CHRISTINE\n                     Louise... why? \n\n     SCHUYLER points to some GRAFFITI-- a HEART with \"SVO + CLK.\" \n\n                             SCHUYLER \n                     You're supposed to be here... they\n                     picked you for a reason. \n\n                             CHRISTINE\n                     But-- why? \n\n     They start to move shakily down the CONSTRUCTION WALKWAY, both\n     bedraggled, covered in goo.  HANDBILLS cover one wall. \n\n                             SCHUYLER \n                     Probably knew you'd play Good \n                     Samaritan for that guy, drag me \n                     along-- but they could have hired an \n                     actor for that, less of a risk...\n\n     ON THE WALL, a series of HANDBILLS say, \"AREN'T YOU FORGETTING\n     SOMETHING?\"  SCHUYLER puzzles over these as they move, gets to one\n     last one-- \"BEHIND YOU, STUPID.\" \n\n     SCHUYLER looks back toward the end of the alley-- \n\n     A YELLOW DUMPSTER with the logo, \"CONSOLIDATED REFUSE SUPPLY\" and\n     the smaller image of a KEY.  SCHUYLER moves quickly to it, throws\n     open the lid. \n\n     ANGLE IN DUMPSTER-- a MOUNTAIN of SHREDDED PAPER. \n\n     SCHUYLER rolls his eyes, sorting through it.  Christine approaches.\n\n                             CHRISTINE \n                     This is really sick.  I think\n                     they're trying to fix us up. \n\n                             SCHUYLER \n                     Maybe you can't play alone-- \n\n                             CHRISTINE \n                     Who says I want to play?\n                             (a sigh) \n                     OK, what the fuck are you doing in\n                     the dumpster. \n\n                             SCHUYLER \n                     There's something in here I need. \n\n     He climbs inside, dives in... and pops up again in a moment with-- \n\n     CLOSE-- A Z-SHAPED WINDOW CRANK.  Sure enough, there's a KEY\n     embossed on the side. \n\n     SCHUYLER climbs out again, brandishing the small crank. \n\n                             CHRISTINE\n                     What's that for? \n\n                             SCHUYLER\n                     I imagine I'll find out. \n\n     60.  E X T .   C R S   B U I L D I N G  -  E V E N I N G \n\n     SCHUYLER pockets the crank as he and CHRISTINE emerge from the\n     alley.  PEDESTRIANS give them a wide berth.  To a PASSERBY: \n\n                             CHRISTINE \n                     What are you looking at? \n\n     Schuyler heads straight for the CRS doors, the large numbers 636\n     printed above-- it's LOCKED.  He tries his little GOLD KEY on a\n     deadbolt, it's USELESS of course. \n\n                             SCHUYLER \n                     This is their offices.  We must\n                     have been in their garage... my \n                     office is just a few blocks from \n                     here, we can get cleaned up there. \n\n     He walks a few steps on, she stands still for a moment, then nods\n     agreeably and follows. \n\n                                                       CUT TO:\n\n     61.  I N T .   S C H U Y L E R ' S   O F F I C E  -  N I G H T \n\n     START ON THE SKYLINE-- SCHUYLER moves from the window, as we hear a \n     DOOR OPEN.  CHRISTINE emerges from the attached dressing area and\n     bath, toweling damp hair, in an oversized Harvard sweatshirt and\n     gym shorts, with a large plastic bag containing her filthy clothes.\n     She looks good, clearly she put some effort into her make-up. \n\n                             CHRISTINE\n                     Your turn. \n\n                             SCHUYLER \n                        (moving past her) \n                     Find everything you need? \n\n                             CHRISTINE \n                     You're outta conditioner. \n\n                             SCHUYLER \n                     My apologies, I'll have it taken care\n                     of.  Help yourself to the fridge. \n\n     He points to a MINI-FRIDGE, shuts the door, a moment later we hear\n     WATER RUNNING.  She looks around the office, letting down her\n     facade.  She seems quite impressed, and intimidated, by the place.\n     She looks back toward the bathroom door-- maybe this guy isn't so\n     bad after all.  From this point, she takes a more seductive tack. \n\n     62.  I N T .   D R E S S I N G   A R E A / B A T H  -  N I G H T \n\n     LATER, Schuyler has cleaned up, is finishing dressing, pulling a\n     pair of jeans over boxer shorts, tucking in a sport shirt.\n     Christine talks through the closed door. \n\n                             CHRISTINE (O. S.)\n                     So um... how rich are you anyway? \n\n                             SCHUYLER \n                             (amused) \n                     Rich enough.  Bit forward, aren't you? \n\n                             CHRISTINE (O. S.) \n                     Well, what exactly do you do? \n\n                             SCHUYLER \n                     Manage investments, some venture \n                     capital, I'm on the board of a number\n                     of publicly traded companies... \n\n                             CHRISTINE (O. S.) \n                     So you just like, move money around? \n\n     63.  I N T .   S C H U Y L E R ' S   O F F I C E  -  N I G H T\n\n     Schuyler emerges, shoes in hand.\n\n                             SCHUYLER \n                     Basically.  Beats working, huh? \n\n     Christine sits on his desk, with her bag slung over her shoulder,\n     eating an APPLE.  She slides off the desk, flirting rather bluntly. \n\n                             CHRISTINE \n                     You don't look so bad, without the tie. \n\n                             SCHUYLER \n                     Look, I hope you haven't been too\n                     put out... I could probably get\n                     you another job, I have a stake in \n                     a couple of restaurants--\n\n                             CHRISTINE \n                     I'm not much of a waitress, really.\n                     Y'know, today's been kind of-- \n\n                             SCHUYLER\n                     Can you type? \n\n                             CHRISTINE \n                     Kind of a turn-on, you know?\n                       (getting no response) \n                     I didn't mean-- just, the danger...\n                     Like fucking in a graveyard. \n\n                             SCHUYLER \n                     Mm.  So where do you live? \n\n     Christine realizes her come-on is falling flat, she pulls back,\n     tossing her unfinished apple in the trash. \n\n                             CHRISTINE \n                     Out in Concord, with my folks,\n                     unfortunately.  They're never\n                     gonna believe that I've been \n                     hanging out with a guy like you. \n\n                             SCHUYLER \n                     What do you mean? \n\n                             CHRISTINE \n                     Nothing, just-- most of the guys I\n                     see have tats, y'know? \n                       (off his confused look)\n                     Tattoos... \n\n                             SCHUYLER \n                     Of course.  We'd better head \n                     downstairs, the limo's waiting. \n\n     Christine nods disappointedly as Schuyler moves to the door. \n\n                                                       CUT TO:\n\n     64.  I N T .   L I M O  -  N I G H T \n\n     Schuyler and Christine ride in silence in the back seat. \n\n                             CHRISTINE \n                     Mind if I smoke in here? \n\n                             SCHUYLER\n                     Yes. \n                        (leaning forward)\n                     Up here on the left. \n\n     As the limo pulls over, he and Christine turn to each other.  It's\n     a somewhat awkward moment. \n\n                             CHRISTINE \n                     So what's our next move?  I mean, in \n                     the game.  Obviously we need to figure\n                     out what that crank thing is for-- \n\n                             SCHUYLER \n                     I'm not playing anymore. \n\n                             CHRISTINE \n                          (disappointed)\n                     Why not? \n\n                             SCHUYLER\n                     I have a life.  Jack'll take you\n                     home, or wherever you want to go. \n\n                             CHRISTINE \n                     Yeah, maybe I'll get in a little\n                     ballroom dancing before bed-- \n\n     The limo has stopped now.  Schuyler has started to open the door. \n\n                             CHRISTINE \n                     Wait, what about your clothes? \n\n                             SCHUYLER \n                     Forget it. \n\n                             CHRISTINE \n                     C'mon it's a brand new sweatshirt. \n\n     So saying, she pulls it off.  She's wearing a black bra... a ROSE\n     is tattooed on her shoulder.  Schuyler can't help but react.  She\n     thrusts the shirt at him, he's half out of the car. \n\n                             SCHUYLER \n                     No, it's not-- just-- back from\n                     the cleaners. \n\n                             CHRISTINE\n                            (throatily) \n                     You dry clean your sweatshirts... \n\n     He nods slightly... as he reaches to take it-- \n\n     --CHRISTINE leans forward, cups the back of his head and gives him\n     a LONG, HARD KISS. \n\n     JACK THE DRIVER, middle-aged and trustworthy, turns and catches a\n     glimpse of this, quickly turns away. \n\n     CHRISTINE breaks the kiss, sinks back against the red leather seat,\n     waiting for Schuyler to make the next move. \n\n                             CHRISTINE\n                     See ya. \n\n     Schuyler nods again, torn.  She's looking at him expectantly.  He's\n     clearly aroused, but this is such an inappropriate female.  Sadly,\n     he waves a hand. \n\n                             SCHUYLER\n                     Good night. \n\n     65.  E X T .   L E O ' S  -  N I G H T \n\n     Schuyler shuts the door, sweatshirt in hand, the dome light slowly\n     DIMS OUT out on the crestfallen Christine-- we see her mouth a \n     CURSE.  Schuyler moves toward his MBZ, the limo IDLING.  He's about\n     to get inside when he sees a TICKET IN AN ENVELOPE under the\n     windshield wiper.  He SNORTS-- insult to injury-- tosses it on the\n     dash as he climbs in. \n\n     66.  I N T .   S C H U Y L E R ' S   M B Z  -  N I G H T \n\n     He sits behind the wheel, watching the lights of the limo \n     disappear.  He sniffs the sweatshirt a moment, then STARTS at the\n     sound of a MOTOR STARTING across the street. \n\n     ANGLE THROUGH SIDE WINDOW-- an MBZ the same year, model and color\n     as Schuyler's-- pulls away from the curb, Schuyler gets a glimpse\n     of something REFLECTING STREET LIGHT in the window of the car-- a \n     gun?  A camera with a long lens?  The car makes a quick U-turn and\n     drives in the same direction as the limo. \n\n     SCHUYLER, curious, STARTS THE ENGINE as if to pursue.  Then he\n     glimpses the envelope on the dash out of the corner of his eye.  He\n     doesn't put the car in gear, picks up the envelope instead... \n\n     CLOSE ON ENVELOPE-- The words \"OPEN ME\" are printed in BLOCK \n     LETTERS on the outside.  He opens it quickly-- there's no ticket\n     inside, but he shakes out a RAINBOW-COLORED CONDOM in a clear \n     wrapper and a NOTE in KIDNAPPER LETTERS:  \"BETTER SAFE THAN SORRY.\" \n\n     SCHUYLER frowns at this and throws the note aside.  He flips on the\n     WINDSHIELD WIPERS (it's started to DRIZZLE) and pulls out. \n\n     POV THROUGH WINDESIELD-- A DARK FIGURE runs from the curb by Leo's,\n     right in front of the car, SCHUYLER SLAMS on the BRAKES-- \n\n     --It's DAVID.  He hurries around to the passenger door and jumps\n     in, looking haggard, scared, a man on the run. \n\n                             DAVID\n                     Drive.  Anywhere. \n\n                             SCHUYLER \n                     Jesus, David, you scared the shit\n                     out of me-- \n\n                             DAVID \n                     I'm sorry Sky, just drive, please-- \n\n     SCHUYLER pulls forward. \n\n                             SCHUYLER \n                     Where were you today? \n\n                             DAVID \n                     I almost didn't make it at all.  I\n                     been in the bar for hours, waiting\n                     for you to come back to your car-- \n                     Jesus, I can't believe I did this to\n                     you, I'm so sorry-- \n\n                             SCHUYLER \n                     Slow down, take a breath-- what\n                     are you talking about? \n\n                             DAVID \n                     The game!  It just doesn't stop! \n                     I thought I'd finished playing a\n                     long time ago, I paid the bill,\n                     then it started all over again,\n                     they won't leave me alone-- \n\n                             SCHUYLER \n                         (slowly, evenly) \n                     Calm down.  What are they doing to you? \n\n                             DAVID \n                     Everything.  It just doesn't stop. \n\n                             SCHUYLER \n                     Look.  That's crazy.  Yes, it's a \n                     pain in the ass, but why would they\n                     keep playing once you paid them? \n\n                             DAVID \n                     I don't know!  I paid them MORE to\n                     make it stop, God help me I even \n                     gave you to them... but they won't\n                     leave me alone! \n\n     He sees the crumpled note on the floor, picks it up-- \n\n                             DAVID\n                     What's this? \n\n                             SCHUYLER \n                     It was on my windshield-- \n\n                             DAVID\n                     Oh shit, oh SHIT they must be\n                     following us-- \n\n     He cranks his neck around, looking for pursuers.  Schuyler looks at\n     him for a beat-- BANG!  He almost loses control of the wheel.\n\n     SCENES 67-71 DELETED \n\n     72.  E X T .   C I T Y   S T R E E T  -  N I G H T \n\n     A TIRE HAS BLOWN.  Schuyler drives ON THE RIM, struggles to get \n     over to the curb, BRAKES hard and stops. \n\n     73.  I N T .   S C H U Y L E R ' S   M B Z  -  N I G H T\n\n     David's losing it, looking around.\n\n                             DAVID \n                     They're shooting at us!\n\n                             SCHUYLER \n                     David, get a grip, it's just a\n                     flat tire! \n\n     He picks up the phone, punches buttons, gets nothing. \n\n                             SCHUYLER \n                     Damn it, the phone's not working-- \n\n                             DAVID\n                     Of course not. \n\n                             SCHUYLER\n                          (climbing out) \n                     Fine, I'll change the fucking\n                     thing myself. \n\n                             DAVID \n                     Just hurry-- I'll pop the trunk. \n\n     David reaches for the glovebox. \n\n                             SCHUYLER \n                     No, you can't do it from-- \n\n     CLOSE ON GLOVEBOX-- it POPS OPEN and KEYS SPILL OUT.  There are at\n     least fifty of them jammed in there, all kinds, silver and gold...\n     and all have CRS stamped on them. \n\n     SCHUYLER leans closer, intrigued.  David's eyes go wide as he\n     fingers a few of these keys. \n\n                             SCHUYLER \n                     What the fuck are those-- \n\n                             DAVID \n                        (whirling on him) \n                     Like you don't know.  Sonofabitch, \n                     they got to you first, didn't they? \n\n                             SCHUYLER \n                     Um, David-- hello? \n\n     74(NEW).  E X T .   G O L D E N   G A T E   P A R K  -  N I G H T \n\n     David gets out of the car in a hurry, amidst the greenery in the\n     park.  RAINING HARDER now. \n\n                             DAVID \n                     It's more than that isn't it?  You're\n                     part of it, you're one of them!  Of \n                     course, it makes perfect sense! \n\n                             SCHUYLER \n                     They planted those keys!  I don't\n                     know what the hell they're for-- \n\n     Schuyler tries hard to be rational, but David is over the edge.\n\n                             DAVID\n                     You're behind the whole thing aren't \n                     you?  You and your sick fucking\n                     friends set it up-- \n\n                             SCHUYLER \n                     What?!  What friends?  Get a grip,\n                     David-- why would I do that? \n\n                             DAVID \n                     I don't know, out of boredom, to\n                     get back at me--\n\n                             SCHUYLER\n                     For what?! \n\n                             DAVID \n                     For being a weirdo, for trying to\n                     be happy?  Well, congratulations,\n                     you win.  Now make it stop! \n\n                             SCHUYLER \n                          (grabbing him) \n                     I can't!  Listen to me-- \n\n                             DAVID\n                     Fuck you! \n\n     David SLUGS HIM in the face, Schuyler staggers back, clutches his \n     BLEEDING nose.  David runs, full tilt, into the woods near the\n     Japanese Tea Garden. \n\n     SCHUYLER pursues amidst the trees and vegetation, running out of\n     breath, calling after David, who's vanished.  He leans against a \n     tree, PANTING, dabbing at his bleeding nose with a SCRAP OF TISSUE\n     from his pocket.  He hears a PHONE RINGING, moves toward it,\n     emerging through bushes near the ACADEMY OF SCIENCE... \n\n     He pauses at the RINGING PAYPHONE.  He decides not to pick it up, \n     looking around at the deserted MUSEUM BUILDINGS and hurrying toward\n     civilization.  He passes other PAYPHONES en route to the park \n     exit... each one STARTS RINGING as he approaches it.  He moves\n     faster, freaked.  At the edge of the park, he snatches one up-- \n\n                             SCHUYLER (on phone) \n                     What have you done to my brother,\n                     you bastards?!  This is over, I'm\n                     not playing anymore--\n                              (beat) \n                     Hello, is anyone there-- \n\n                             PHONE VOICE \n                     If you'd like to make a call, \n                     please hang up and dial again-- if\n                     you need help-- \n\n     SCHUYLER slams the phone down.  He dabs his nose one more time,\n     tosses the paper scrap into the trash. \n\n     CLOSE ON SCRAP-- \"CRS\" with the emergency NUMBER, the blue ink has\n     BLED with the rain and Schuyler's BLOOD...\n\n     SCENE 75 DELETED \n\n     76(NEW).  E X T .   F U L T O N   S T R E E T  -  N I G H T \n\n     POV THROUGH CAR WINDSHIELD, as Schuyler emerges from the park.  The\n     car suddenly MOVES FORWARD-- \n\n     WITH SCHUYLER.  He walks to the curb, distractedly raises a hand\n     for a cab, which pulls up instantly.  He climbs in.\n\n     77.  I N T .   C A B  -  N I G H T \n\n     An aged, battered CAB; PLEXIGLAS between the CABBIE and the back.\n\n                             SCHUYLER \n                     Six three six Mission, please.\n\n     The cabbie nods and hits the gas. \n\n     78.  E X T .   S A N   F R A N C I S C O   S T R E E T  -  N I G H T\n\n     The cab roars down the street, KICKING UP WATER from the gutters. \n\n     79.  I N T .   C A B  -  N I G H T \n\n     Schuyler bites his cuticle, not watching where they're going; the \n     windows are wet and fogged.  Then he looks out, narrows his eyes\n     and RAPS on the PLEXIGLAS PARTITION. \n\n                             SCHUYLER \n                     You're heading the wrong way. \n\n                             CABBIE (filter) \n                     Relax, pal, you'll get where\n                     you're going. \n\n     The cabbie turns IN PROFILE for a moment.  He appears to be wearing\n     a HEARING AID, a round piece of plastic, a tiny WIRE disappearing\n     into his shirt.  And there's something familiar about his face.\n     Schuyler glances at the driver ID on the back of the seat-- \n\n     CLOSE ON PHOTO, the man is the RASTA from the airport, with a new\n     hairdo.  The COMPANY NAME-- \"CONSOLIDATED REGENCY SEDANS.\"  CRS. \n\n     SCHUYLER rubs his head, very angry.\n\n                             SCHUYLER \n                     Why are you doing this-- \n\n                             CABBIE/RASTA (filter) \n                     We do it all for you!  We're the best\n                     friends you got, no one ever worked \n                     so hard to make you feel alive... but\n                     you gotta let it happen...\n\n     The cab STOPS at a RED LIGHT.  SCHUYLER tries the doorhandle-- it\n     doesn't work. \n\n     80.  E X T .   S A N   F R A N C I S C O   S T R E E T  -  N I G H T \n\n     The cab PEELS OUT when the light turns green, heads for a pier.\n\n     81.  I N T .   C A B  -  N I G H T \n\n     Schuyler looks around in increasing panic. \n\n                             SCHUYLER \n                     What the fuck is this-- \n\n                             CABBIE/RASTA\n                     Have a nice day...\n\n     The cabbie opens his own door and leaps out of the MOVING CAB-- \n\n     82.  E X T .   W H A R F  -  N I G H T \n\n     The cabbie/rasta hits the ground and ROLLS in a perfect stunt fall.\n     The cab rockets to the end of the disused wharf and-- \n\n     --GOES FLYING off the edge into the San Francisco Bay, illuminated\n     by SPOTLIGHTS from the end of the wharf.\n\n     83.  I N T .   C A B  -  N I G H T \n\n     Schuyler SCREAMS as the cab plunges and HITS the water.\n\n     84.  E X T .   B A Y  -  N I G H T \n\n     The STEAMING cab's nose slowly DIPS below the surface. \n\n     85.  I N T .   C A B  -  N I G H T \n\n     FILLING WITH WATER from the car's floor, from overhead.  EERIE \n     LIGHT from the front of the cab.  Schuyler tries to roll down the \n     window, the handle SPINS, nothing happens.\n\n     86.  E X T .   B A Y  -  N I G H T\n\n     The cab GOES UNDER with a BURBLE of BUBBLES.\n\n     87.  I N T .   C A B  -  N I G H T \n\n     Schuyler CRANKS the other window handle desperately, now up to his\n     waist in water, water GUSHING IN now.  INCREASING BLACKNESS through\n     the windows as he sinks.  The handle falls off in his hand.\n\n     88.  U N D E R W A T E R   S H O T  -  N I G H T \n\n     The sinking cab, HEADLIGHTS and INTERIOR LIGHTS STILL ON, Schuyler \n     inside KICKING at the windows and the Plexi, without any success.\n\n     89.  I N T .   C A B  -  N I G H T \n\n     Schuyler stops his frantic kicking, tries to think coolly.  He's up \n     to his neck by now. Angry at himself for not realizing it sooner,\n     he pulls what he needs out of his pocket-- the HANDCRANK he found\n     in the dumpster.  He takes a deep breath and-- \n\n     90. SUBMERGES.  UNDERWATER he inserts the crank into the window\n     handle hole... a perfect fit.  He CRANKS FAST, WATER FLOODS IN. \n\n     91.  U N D E R W A T E R   S H O T  -  N I G H T \n\n     Schuyler SLITHERS OUT the open window.  Cheeks puffed out, he kicks\n     frantically for the surface. \n\n     92.  E X T .   B A Y  -  N I G H T \n\n     He BURSTS to the surface, SPLUTTERING, catching his BREATH.  A\n     FLASHLIGHT BEAM catches him.\n\n                             GIRL \n                     Mister-- are you all right?! \n\n     Schuyler, treading water, turns around-- \n\n     A CABIN CRUISER at the dock nearby.  A very beautiful GIRL in a\n     yellow rain slicker, holding a powerful FLASHLIGHT leans over the\n     edge, tosses him a life preserver, hauls him toward her. \n\n     93.  E X T .   C A B I N   C R U I S E R  -  N I G H T \n\n     SCHUYLER clambers onto the rear ladder with the girl's help, teeth\n     CHATERING.  HOLD ON the boat's colorfully painted name on the\n     stern:  \"POSEIDON'S CURSE,\" and in small letters, \"COSTA REY SOL.\" \n\n     SCHUYLER boards the large, ritzy craft. \n\n                             SCHUYLER \n                     Thank you... I'm very grateful. \n\n                             GIRL \n                     Shouldn't swim in the Bay, you \n                     could get hepatitis. \n\n     Schuyler nods, looking around, recovering from the shock.\n\n                             SCHUYLER\n                     I have to get in touch with the police.\n\n                             GIRL \n                     You're freezing, I got some dry\n                     clothes below. \n\n     94.  I N T .   B O A T   C A B I N  -  N I G H T \n\n     Schuyler's wet clothes hang from a hook, he's in a towel, starting\n     to pull on a fresh set of casual clothes.\n\n                             GIRL\n                     Do you need any help? \n\n     His back is turned as the girl climbs down, opens her raincoat--\n     only a STRING BIKINI beneath.  She could be a Playboy centerfold. \n\n                             SCHUYLER \n                     Uh, no.  I'm fine.  These fit...\n                       (buttoning his pants)\n                     ...perfectly. \n\n     He turns slowly, just as the girl reaches behind her. \n\n                             GIRL \n                      Sure I can't do something for you? \n\n     She WINKS as she lets her top drop.  Schuyler smiles strangely. \n     She takes this for lust, approaches him with open arms.  He GRABS\n     her by the hair.  Menacingly: \n\n                             SCHUYLER \n                     I am finished playing. \n\n                             GIRL\n                     OW!  Let go! \n\n     She pounds at him, tries to kick.  He wrestles her to the floor,\n     kneels on top of her.  He seems about to hit her. \n\n                             SCHUYLER \n                     This has got to fucking STOP! \n\n                             GIRL \n                     You're hurting me! \n\n                             SCHUYLER\n                     Who are you!? \n\n                             GIRL \n                     I just got hired to show you a good\n                     time!  C'mon please get off me... \n\n     Schuyler gets his rage under control, horrified at himself.  He\n     climbs off her, she scrambles away, afraid, covering herself.\n\n                             GIRL \n                     I am not into this kinda shit! \n\n                             SCHUYLER\n                     Who hired you. \n\n                             GIRL \n                     I don't know, the service set it up. \n\n                             SCHUYLER\n                     The service? \n\n                             GIRL \n                     Y'know, Fantasy Girls.  They said\n                     you had this wild fantasy, I \n                     should just wait in the boat...\n\n     Schuyler realizes he's not going to get anything more out of her,\n     pulls on a shirt, grabs his wet clothes and leaves the cabin. \n\n     95.  E X T .   W H A R F  -  N I G H T \n\n     Schuyler leaps off onto the wharf.  The girl, pulling the raincoat\n     on, leans over the deck. \n\n                             GIRL\n                     Doncha want your thing?  I'm supposed\n                     to give you this, this key thingie...\n\n     Schuyler pauses, turns slowly, approaches. \n\n                             SCHUYLER\n                     A key. \n\n     THE GIRL nods quickly, reaches over the railing to hand him a SMALL\n     WOODEN COFFIN with a BLACK BOW and a RED KEY BURNED into the lid. \n\n                             GIRL \n                     They said you'd figure out what to\n                     do with it. \n\n     SCHUYLER takes it from her gingerly, undoes the bow, opens the lid:\n\n     ANGLE IN COFFIN-- an ornate HATCHET with a KEY DESIGN on the blade.\n\n     SCHUYLER REMOVES it from its QUILTED resting place.  THE GIRL backs\n     away, nervous to see SCHUYLER with a weapon. \n\n                             SCHUYLER \n                     I'm supposed to carry a fucking\n                     hatchet around...?  Relax.  I\n                     don't want it. \n\n     He drops the AXE and the COFFIN into the water with a SPLASH-- \n\n     95PT. THEY GO UNDER and DISAPPEAR...\n\n                                                       CUT TO:\n\n     96.  E X T .   C R S   B U I L D I N G  -  D A Y \n\n     Early morning, the RAIN has stopped-- a RAINBOW arcs behind the \n     office building.  TWO COP CARS, marked and unmarked, pull up at the\n     curb, lights FLASHING.\n\n     97.  I N T .   C R S   L O B B Y  -  D A Y \n\n     Schuyler, in the clothes from the boat, and Plympton, his lawyer,\n     are joined at the elevators by two plainclothes detectives--\n     BARNETT and GALLO-- and two UNIFORMS.\n\n                             PLYMPTON \n                     Thank you for your promptness, \n                     officers.  I'm Robert Plympton,\n                     Mr. Van Orton's attorney-- \n\n                             SCHUYLER \n                     Let's go.  Seventh floor.\n\n     98.  I N T .   C R S   O F F I C E S  -  D A Y \n\n     Schuyler enters, followed by the others.  He stops short, reacts.\n     WIDE SHOT reveals-- the same offices, now entirely empty.  The\n     partitions, the desks, everything has been removed.  A small amount\n     of TRASH is scattered on the floor-- the move was evidently hasty. \n\n                                                       CUT TO: \n\n     99. LATER.  UNIFORM #1 SPEAKS into his walkie-talkie, COP TALK; #2\n     pokes around in a box full of SHREDDED PAPER; Plympton CONFERS with\n     Barnett, nods, then both of them cross to Schuyler, who sits on the\n     carpet, back to an empty wall.  Barnett checks his notes. \n\n                             BARNETT \n                     Management company for the building \n                     said this floor hasn't been rented.  We\n                     checked with the Secretary of State and\n                     the county recorder, there's no listing\n                     of a \"consumer research service.\" \n\n                             PLYMPTON \n                     Recreation service. \n\n                             BARNETT \n                     Right.  No sign of the boat or the \n                     girl.  Divers got the cab's vehicle \n                     ID, the company junked it a month ago. \n\n     Gallo, who'd been talking on a phone IN BG, approaches. \n\n                             GALLO \n                     The numbers you gave us are \n                     disconnected, sir, this was the only\n                     address the phone company had.  And\n                     we found your car-- it's in impound. \n\n                             BARNETT \n                     I'm a little confused as to motive \n                     here.  You said your brother sent you\n                     to these people...\n\n                             SCHUYLER \n                     It's not his fault, he's unstable,\n                     he didn't know what he was doing-- \n\n                             BARNETT\n                     And they were supposed to show you\n                     a, a good time? \n\n                             GALLO \n                       (a cautioning look at Barnett)\n                     My guess is this Feingold guy's\n                     using an alias... is there anything \n                     else you can tell us about him? \n\n     Schuyler spots an empty CHINESE FOOD CARTON crumpled in the corner.\n\n     CLOSER as SCHUYLER picks up and fingers the container-- Chinese \n     characters on it, the name TUNG HOY. \n\n                             SCHUYLER\n                     He likes Chinese food...\n\n                             BARNETT \n                     Don't worry, Mr. Van Orton, we'll\n                     get these jokers. \n\n     SCHUYLER nods, unconvinced. \n\n                                                       CUT TO:\n\n     100(NEW).  E X T .   V A N   O R T O N   M A N S I O N  -  D A Y \n\n     PLYMPTON pulls up in his LEXUS, SCHUYLER gets out wearily. \n\n                             PLYMPTON \n                     There's clearly a civil case once\n                     we locate the defendant...\n\n                             SCHUYLER\n                     Whatever. \n\n                             PLYMPTON \n                     Y'know, Sky, things are quiet \n                     since the closing-- you could take\n                     some time off. \n\n     SCHUYLER sighs and nods, closes the car door and waves good-bye.\n     He climbs the steps to his front door and Plympton pulls away.\n\n     101(NEW).  I N T .   S C H U Y L E R ' S   F O Y E R  -  D A Y \n\n     SCHUYLER enters and automatically reaches for a LIGHTSWITCH-- \n\n     BLUE SPARKS leap to his fingers, the switch has been RIPPED OUT, \n     leaving exposed WIRING. \n\n     SCHUYLER CURSES and shakes his hand out.  He looks around in\n     disbelief-- the walls are covered in GRAFFITI. \n\n     \"GAME OVER\" is the first one we see in the foyer, above the\n     HARLEQUIN, who still sits in the only upright chair... but now a\n     GLOSSY BLACK AND WHITE PHOTO is stuck in its teeth. \n\n     SCHUYLER pulls out the picture, looks at it, hand trembling-- \n\n     A POLICE PHOTO of MR. VAN ORTON, his body sprawled in a pool of \n     blood.  It's stamped \"PROPERTY SFPD\" in red...\n\n                             SCHUYLER\n                     Oh, God-- \n\n     SCHUYLER tosses the picture aside, moves into his living room--\n\n     101B(NEW).  I N T .   S C H U Y L E R ' S   L I V I N G   R O O M  -  D A Y\n\n     More GRAFFITI everywhere:  \"FUCK THE POLICE,\" \"SORE LOSER!,\" \"NO \n     FUTURE,\" \"CRS RULES,\" assorted OBSCENITIES.  BOOM, as Schuyler\n     moves through the living room, CONTACT EXPLOSIVES on the floor\n     EXPLODE beneath his feet, making him LEAP and DANCE. \n\n     OVER THE MANTLEPIECE, A NOTE is stuck into a PAINTING with a\n     KITCHEN-KNIFE.  SCHUYLER approaches and rips this down. \n\n     INSERT NOTE, PAN DOWN SLOWLY, X-CLOSE:  \"Like my father before me,\n     I kill what I love.  Goodbye, cruel world, blah blah blah...\"  A\n     RED SIGNATURE ARROW is affixed by a DOTTED LINE at the bottom,\n     \"PLEASE SIGN HERE.\"\n\n     SCHUYLER GROANS and crumples the note.  He reaches for a phone-- he\n     PICKS up the receiver, it's been MELTED into the body of the \n     telephone.  He throws it aside.  He hears VOICES from the next \n     room, enters cautiously, picking up a SMALL SCULPTURE as a weapon-- \n\n     lOlC(NEW).  I N T .   S C H U Y L E R ' S   S T U D Y  -  D A Y \n\n     THE TELEVISION is on, playing a silly-looking CARTOON.  ACTION\n     HEROS fly through the air, shooting LIGHT from their eyeballs, etc. \n\n     SCHUYLER lowers his weapon, moves to shut off the tube.  More\n     GRAFITTI over the walls, the books, etc.:  stick figure drawings of\n     a MAN HANGING HIMSELF, a BROKEN HEART, a PENIS, a NAKED WOMAN, etc.\n     Across the walls, over the TV, are the words, \"YOU ARE NOT ALONE.\"\n\n     SCHUYLER presses the on-off switch-- nothing happens. \n\n                             ACTION HERO (on TV)\n                     Don't touch that dial, Sky! \n\n     ON SCREEN, THE MASKED ACTION HERO stands proudly, hands on hips,\n     before a colorful MOVING BACKGROUND.  It speaks in a cheezy HE-MAN\n     VOICE, an ANIMATED MOUTH.  There's a CRS LOGO on its chest. \n\n                             CRS-MAN (on TV) \n                     Boy oh boy, you fucked up big-time! \n                     Bringing in the cops-- real mistake! \n\n     SCHUYLER covers his eyes, leans against a chair; this is too much. \n\n                             SCHUYLER\n                     No no no-- \n\n                             CRS-MAN (on TV) \n                     Oh you're always so negative...\n\n     Schuyler realizes this is a two-way conversation as the CRS-MAN\n     WINKS at him, making a stiff WAVE. \n\n                             SCHUYLER\n                     You people are insane...\n\n                             CRS-MAN (on TV) \n                     Hey, look who's talking to their\n                     TV set. \n\n                             SCHUYLER \n                     How did you do this, how did you\n                     get in here? \n\n                             CRS-MAN (on TV) \n                     Simple, we duped your keys the day you\n                     came in for your physical, wired the\n                     whole house while you were at work. \n                     You rich people all have alarms, but\n                     you never set 'em, do you? \n\n                             SCHUYLER \n                     Look, at least leave my brother \n                     alone, he's fragile enough as it is-- \n\n                             CRS-MAN (on TV) \n                     Don't worry about him, he's just\n                     playing his own game-- at a more\n                     advanced level, you might say... \n\n                             SCHUYLER \n                     You can't just fuck with people\n                     like this, you don't know who\n                     you're dealing with! \n\n                             CRS-MAN (on TV)\n                             (LAUGHS) \n                     We know exactly who we're dealing\n                     with, that's the whole idea!  For\n                     a guy with your test scores, \n                     you're pretty slow on the uptake. \n\n                             SCHUYLER \n                     What the fuck do you want from me?! \n\n                             CRS-MAN (on TV) \n                     Sky, I just came to say good- \n                     bye... Too bad it didn't work\n                     out, better luck next time.  Uh, \n                     there might be a few loose ends \n                     for you to tie up, but remember--\n                     it's not whether you win or lose \n                     that counts, it's how you play the\n                     game... ya big loser you... \n\n     THE SCREEN IMPLODES as SCHUYLER SMASHES IT with the sculpture-- \n\n                             CRS-MAN (filter) \n                     Ouch!  Take it easy, my hot-headed friend! \n\n     Schuyler peers into the SMOKING electronics, pulls out a battery\n     pack, a small video camera, a loop antenna; the SPEAKER's not dead. \n\n                             CRS-MAN (filter) \n                     Holy smoke, this was an expensive TV-- \n\n     He BASHES the equipment repeatedly on the floor with all his might.\n     The speaker SPUTTERS OUT, the CRS-MAN'S VOICE at last SILENCED. \n\n     The PHONE has started ringing during the above.  Schuyler,\n     breathless, moves around the room now, trying to find it.  He\n     finally tracks it down in the bottom of a GARBAGE CAN, covered with\n     disgusting SLIME which he wipes on his shirt. \n\n                             SCHUYLER (on phone)\n                     Now what?! \n\n                             MANAGER (filter)\n                             (beat) \n                     Is this Schuyler Van Orton? \n\n                             SCHUYLER (on phone)\n                     Yeah, who's this? \n\n                             MANAGER (filter) \n                     I'm calling from the Claremont \n                     Hotel in Berkeley... we have your \n                     American Express card, you left it\n                     at the check-in desk...\n\n                             SCHUYLER (on phone) \n                     What?  That's impossible, I've\n                     never stayed there-- \n\n                             MANAGER (filter)\n                     Are you sure, sir? \n\n     SCHUYLER pulls his wallet, spreading his credit cards on the floor. \n\n                             SCHUYLER\n                     Son of a bitch. \n\n     101D(NEW).  I N T .   S C H U Y L E R ' S   F O Y E R  -  D A Y \n\n     START ON THE DUMMY, propped in a chair-- SCHUYLER seizes it,\n     SMASHES IT against the wall, the glass head SHATTERS. \n\n                                                       CUT TO:\n\n     102(NEW).  E X T .   C L A R E M O N T   H O T E L  -  D A Y \n\n     LATE AFTERNOON, the COMPANY LIMO pulls up and Schuyler emerges.\n\n     102B(NEW).  I N T .   C L A R E M O N T   H O T E L  -  D A Y \n\n     SCHUYLER crosses the opulent lobby to the desk.  A passing BELLHOP\n     gives him a nod and a smile. \n\n                             BELLHOP \n                     Hello, Mr. Van Orton. \n\n     Schuyler stares after the bellhop, whom he's clearly never seen\n     before.  He proceeds to the check-in desk.  Before he can even \n     introduce himself, the DESK CLERK turns to him with a tight smile-- \n\n                             DESK CLERK \n                     Mr. Van Orton.  Here's your credit\n                     card... and the maid found this\n                     under the bed... \n\n     From under the desk he removes a small ATTACHE CASE, places it\n     gingerly in front of Schuyler. \n\n                             SCHUYLER\n                     That isn't mine. \n\n                             DESK CLERK \n                     It has your initials on it, sir. \n\n     SCHUYLER examines the case closely for the first time, sees the\n     gold monogram, \"S. V. O.\" \n\n                             DESK CLERK \n                     We'd just as soon you took it with\n                     you, in any event... and in the\n                     future, you might consider \n                     choosing another hotel for your...\n\n     The man trails off and moves away. \n\n                             SCHUYLER \n                     I've never been here before in my life! \n\n     The man ignores him now.  Schuyler pockets his credit card, thinks\n     a beat, then grabs the briefcase. \n\n     SCENES 103-104 DELETED \n\n     105.  I N T .   C O M P A N Y   L I M O  -  D A Y \n\n     JACK drives, Schuyler in back, studying the open briefcase in his \n     lap.  He seems extremely upset, fighting to maintain his wits...\n\n                             SCHUYLER \n                     Jack... the woman you took home \n                     the other night, where did you go? \n\n                             JACK \n                           (puzzled) \n                     Out to Concord... \n\n                             SCHUYLER \n                     I know, what was the address? \n\n     JACK is a bit nervous, he doesn't want to piss off the boss. \n\n                             JACK \n                     Mmm... it was... Beulah Drive, I\n                     think, yeah, offa Oakdale... but\n                     didn't you-- never mind. \n\n                             SCHUYLER\n                     What? \n\n                             JACK \n                     Just-- I thought you followed us \n                     there.  There was a black 500SE behind\n                     us the whole way, I just assumed...\n\n                             SCHUYLER \n                     Shit.  Shit!  It wasn't me, Jack. \n\n                             JACK \n                     Of course, sir.  It was a white \n                     house, I remember... big tree in\n                     the front... with one of those,\n                     you know, tire swings...\n\n                             SCHUYLER \n                     Jack, I'm serious.  It wasn't me. \n\n                             JACK \n                     It wasn't you, sir.\n\n     Schuyler looks at the man, who stares straight ahead, not believing \n     him for a second.  Schuyler shakes his head, looks down at the open\n     briefcase in his lap. \n\n     ANGLE IN BRIEFCASE-- a set of HANDCUFFS, assorted BONDAGE GEAR...\n     and a few BLURRY POLAROID PHOTOS, showing a NAKED WOMAN with a\n     LEATHER MASK chained to a bed.  ONE SHOT shows her shoulder\n     clearly-- we see a ROSE TATTOO.\n\n                                                       CUT TO:\n\n     106.  E X T .   I M P O U N D   L O T  -  D A Y \n\n     A female IMPOUND WORKER with paperwork leads SCHUYLER through a\n     maze of SMASHED CARS, etc.  IN BG, the COMPANY LIMO pulls away. \n\n                             IMPOUND WORKER \n                     Triple A changed your tire... bad\n                     blow-out was it?  Anyone hurt? \n\n     Schuyler shakes his head.  They've reached his MBZ.\n\n                             IMPOUND WORKER \n                     Oh.  Just... we were a little curious\n                     about the mess in the back... \n\n     SCHUYLER bends down to look in the window. \n\n     HIS POV-- THE BACKSEAT has been SLASHED.  A few SPLASHES OF BLOOD,\n     not too much.  Schuyler's HARVARD SWEATSHIRT is torn and STAINED\n     with blood, crumpled in a corner of the seat. \n\n     SCHUYLER swallows, recovers quickly. \n\n                             SCHUYLER \n                     A friend's dog-- he'd been hit by a\n                     car, I drove him to the vet...\n                        (as the cop nods slowly) \n                     Golden retriever, beautiful animal. \n\n                             IMPOUND WORKER \n                        (handing Sky a receipt)\n                     He OK? \n\n                             SCHUYLER\n                     Too early to say. \n\n     He quickly gets behind the wheel. \n\n                                                       CUT TO:\n\n     SCENE 107 DELETED \n\n     108.  E X T .   C H R I S T I N E ' S   N E I G H B O R H O O D / H O U S E  -  E V E N I N G\n\n     SCHUYLER'S MBZ cruises past rows of similar-looking, lower-middle- \n     class homes, a pretty shabby neighborhood.  He parks the Benz.  A\n     WHITE VAN is parked just up the street, a LOOP AND RABBIT EAR on\n     the roof.  PAN to show THE DRIVER'S SIDE DOOR... A cartoonish logo\n     with the CRS MAN holding a wrench by a TV SET in front of a\n     RAINBOW, the words \"CABLE REPAIR SPECIALISTS.\"\n\n     ON THE HOUSE, MOVE from a WHITEWALL TIRE hanging on a rope from a\n     tree to SCHUYLER as he RINGS the front doorbell of a WHITE HOUSE. \n\n     AT THE DOOR, an older, working-class man in a T-shirt appears--\n     Christine's dad, MR. KAMINSKY.\n\n                             MR. KAMINSKY \n                     Yes? \n\n                             SCHUYLER \n                     Mr. Kaminsky?  Schuyler Van Orton-- \n\n                             MR. KAMINSKY \n                     Is that a name?  Look, I'm kinda busy.\n                       (starts to close the door) \n\n                             SCHUYLER \n                     You have a daughter named \n                     Christine?  I'm afraid she might\n                     be in danger. \n\n     MR. KAMINSKY narrows his eyes at him as we hear--\n\n                             CHRISTINE (O. S.)\n                     Daddy?  Who is it? \n\n     Schuyler, very surprised, peers around Mr. Kaminsky-- \n\n     109.  I N T .   C H R I S T I N E ' S   L I V I N G   R O O M  -  E V E N I N G \n\n     Schuyler does a double-take as CHRISTINE comes down the staircase,\n     wearing a sweatshirt and shorts.  She lights up when she sees him, \n     then quickly hides her excitement. \n\n                             CHRISTINE\n                     Sky?  Hi, Sky. \n\n     MR. KAMINSKY allows the relieved Schuyler to enter now. \n\n                             DAD \n                     Well, I'm gonna get back to that\n                     carburetor... nice meeting you. \n\n     Christine's dad WINKS at his daughter as he moves back to the\n     basement.  She rolls her eyes, but mouths, \"thanks,\" and then moves\n     to sit beside Schuyler in the modest, over-knick-knacked living\n     room:  religious pictures and statues, family photos, etc. \n\n                             CHRISTINE \n                     I didn't think I'd-- what are you\n                     doing here? \n\n     SCHUYLER is smiling at himself now, shaking his head.  Christine\n     reaches across him to FLIP ON a lamp. \n\n                             SCHUYLER \n                     Last night, when Jack dropped you\n                     off-- did anything happen? \n\n                             CHRISTINE \n                     No... unfortunately.\n\n                             SCHUYLER \n                     I thought-- eh, you don't wanna know. \n\n                             CHRISTINE\n                     Come on-- \n\n                             SCHUYLER \n                     I thought they kidnapped you,\n                     tortured you-- \n\n                             CHRISTINE\n                     What?  Who? \n\n                             SCHUYLER \n                     CRS... I saw pictures, girl with a\n                     tattoo on her shoulder like yours-- \n\n                             CHRISTINE \n                        (touches her shoulder) \n                     Ssh, my folks don't know about\n                     that yet.  So, what-- they wanted\n                     ransom from you or something? \n\n                             SCHUYLER \n                     No, I thought they were trying to \n                     frame me, they planted evidence... \n\n                             CHRISTINE \n                     Why would they do that? \n\n                             SCHUYLER \n                     I have no idea, nothing they do makes any\n                     sense.  Forget it, it's just a game. \n\n                             CHRISTINE \n                     So that's the only reason you came \n                     out here to East Hell, your stupid\n                     goddamn game. \n\n                             SCHUYLER \n                     I was worried about you.  I wanted to\n                     see you again.\n\n                             CHRISTINE \n                       (thinks for a beat) \n                     If you pretend to mean that, I'll \n                     pretend to believe it.  Well, looks like\n                     your pals are trying to keep us \n                     together.  Buy me dinner at least? \n\n                             SCHUYLER\n                     Sure, why not. \n\n                             CHRISTINE\n                             (rises) \n                     I look like a slob, let me change. \n\n     She hurries upstairs.  Schuyler sighs, wondering what the hell he's\n     doing here.  He glances at a VIRGIN MARY statue, squints-- then\n     unscrews the head, it's a decanter.  He takes a sniff and puts it\n     back with a bemused expression.  He takes another sniff, noticing\n     something else in the air...\n\n     A WISP OF SMOKE rises from the lamp Christine turned on. \n\n     SCHUYLER peers beneath the shade.  On the table is a framed\n     PHOTOGRAPH of a LITTLE GIRL who could be Christine in a frilly\n     white dress, holding flowers. \n\n     ANGLE INSIDE LAMPSHADE-- a new PRICETAG dangles from the shade\n     against the bulb, starting to TURN BROWN, smoking. \n\n     SCHUYLER licks his fingertips, reaches inside the shade to PULL OFF\n     tag-- in doing so, he burns his fingers on the hot bulb, STIFLES a\n     curse and jerks his hand away.  He KNOCKS OVER the picture, which\n     FALLS to the floor.  Shaking his hand, he rises distractedly, pokes\n     his head through a swinging door. \n\n     110.  I N T .   C H R I S T I N E ' S   K I T C H E N  -  N I G H T \n\n     DIMLY LIT from outside.  Modest, surface clutter, hanging pots,\n     etc.  Schuyler moves to a sink, turns on the tap and RUNS WATER \n     over his burned fingertips.  He SHUTS OFF the tap, looks around for\n     a towel, shaking his hand-- the paper towel dispenser has no roll\n     on it.  He pulls open a kitchen drawer--\n\n     ANGLE IN DRAWER-- completely empty.\n\n     SCHUYLER, curious now, opens a cabinet, absently drying his hand on\n     his shirt-- also empty.  He tries another couple of drawers, finds\n     nothing but scraps of paper, matches.  No utensils.  He exits, a\n     disturbing thought forming. \n\n     111.  I N T .   C H R I S T I N E ' S   L I V I N G   R O O M  -  N I G H T\n\n     SCHUYLER picks up the photo to replace it on the table. \n\n     ANGLE ON PHOTO:  Schuyler slips the picture from its cardboard \n     mount-- it's an ADVERTISEMENT clipped from a glossy magazine, TEXT\n     printed on the portion previously unseen. \n\n     SCHUYLER quickly returns the clipping to its mount, puts the photo\n     back on the table as Christine comes downstairs, dressed and made-\n     up for a night on the town. \n\n                             CHRISTINE \n                     Can you get us into Chez Panisse?  I\n                     always wanted to eat there-- \n\n     Schuyler nods casually toward the photo as she sits beside him. \n\n                             SCHUYLER\n                     Is that you? \n\n                             CHRISTINE \n                          (quick glance) \n                     Mm-hmm, First Communion.\n                        (touches his hair) \n                     What's the matter, you look a \n                     little green around the gills-- \n\n     He grabs her hand away.  Icily:\n\n                             SCHUYLER\n                     Don't touch me. \n\n     His tone alarms her-- he stares at her with hatred.  A silent BEAT\n     between them, each tries to assess the new situation.  She realizes\n     he's onto her.  She swallows, makes a quick decision.  Suddenly she\n     leans close to him, reaching around him to SHUT OFF the table lamp.\n     She leaves her arms around him and HISSES in his ear-- she drops\n     her lower-class accent, speaks in a clipped, educated voice: \n\n                             CHRISTINE \n                     Don't be stupid.  Don't say anything,\n                     not here, they're watching. \n\n                             SCHUYLER \n                        (sickened; to himself)\n                     God damn it... \n\n     She kisses him, he doesn't open his mouth, neither shuts their\n     eyes.  Then she gets up quickly, moves to a corner of the room. \n\n                             CHRISTINE \n                       (back in character, accented) \n                     OK, I know a good place we could\n                     go and like, be alone...\n\n     She glances up quickly to indicate something on the ceiling-- \n\n     ON CEILING, a large SMOKE DETECTOR with a RED LIGHT, a cable from\n     it-- there's a small LENS in the center... A HIDDEN CAMERA. \n\n     SCHUYLER looks at this, starting to rise.  She moves to a window,\n     out of range of the camera, beckons him over. \n\n                             CHRISTINE \n                     It's a beautiful night, isn't it? \n\n     Schuyler comes up beside her, she nods for him to look outside--\n\n     POV-- THROUGH WINDOW-- the CRS VAN.  Christine WHISPERS urgently: \n\n                             CHRISTINE\n                     There's four of them in the van,\n                     they're armed.  Just play along,\n                     I'll get us out of here-- \n\n     SCHUYLER turns to her, his voice is tired. \n\n                             SCHUYLER\n                     Fuck you. \n                      (to surveillance camera) \n                     OK, that's it, game over-- \n\n     112.  I N T .   C R S   V A N  -  N I G H T \n\n     CLOSE on a video monitor, Schuyler framed in a FISHEYE SHOT:\n\n                             SCHUYLER (FILTER) \n                     --you can come out now, assholes-- \n\n     He moves toward the front door, a panicked Christine behind him--\n\n                             RASTA MAN'S VOICE \n                     We're blown, let's do it-- \n\n     We hear MEN GETTING TO THEIR FEET, see BODIES MOVE in FG. \n\n     113.  I N T .   C H R I S T I N E ' S   L I V I N G   R O O M  -  N I G H T\n\n     Christine's furious and terrified, dashes in front of him, LOCKS \n     and THROWS A CHAIN across the front door. \n\n                             CHRISTINE \n                     You idiot!  Come on!\n\n     She starts to pull him away from the door, he throws off her arm. \n\n                             SCHUYLER \n                     No, enough already.  I've had it. \n\n     He goes to the window and opens the curtain. \n\n     THROUGH WINDOW-- the Hack/Cabbie, the Rasta/Pilot and a pair of CRS\n     AGENTS (JOHN and PETER from the men's club) hurry toward the house,\n     the older men reach inside their jackets-- \n\n                             SCHUYLER\n                     Now what. \n\n                             CHRISTINE \n                     Get away from there!!\n\n                             SCHUYLER \n                        (steps toward her) \n                     Oh, now I suppose they're going to-- \n\n     THE WINDOWS BLOW IN, GUNFIRE, Christine TACKLES HIM and pulls him\n     to the ground as--\n\n     KNICK-KNACKS fly to pieces directly behind where he was standing.\n\n     CHRISTINE AND SCHUYLER keep low as they dash for the kitchen-- \n\n                             SCHUYLER \n                     Holy shit!! \n\n     114.  I N T .   C H R I S T I N E ' S   K I T C H E N  -  N I G H T\n\n     Christine pulls him toward a basement door-- \n\n     115.  I N T .   C H R I S T I N E ' S   G A R A G E  -  N I G H T \n\n     They dash down steps to the darkened one-car garage, mostly empty \n     with a few random tools.  MR. KAMINSKY looks up from a game of\n     SOLITAIRE, a day player confused by the sudden commotion. \n\n                             SCHUYLER\n                     What is this!? \n\n                             CHRISTINE \n                     God, wake up, it's a con game! \n\n     THE GARAGE DOOR OPENS, Christine pulls Schuyler against a wall-- \n\n     A \"PARAMEDIC\" charges out of the shadows, pulling a handgun--\n\n     IN BG MR. KAMINSKY dives for cover with a frightened NOISE--\n\n     CHRISTINE grabs a WRENCH and CLUBS THE PARAMEDIC, who falls with a\n     CRY, clutching his skull.  They hear FOOTSTEPS on the stairs they \n     just came down.  Christine hustles the dazed Schuyler out of there. \n\n     116.  E X T .   C H R I S T I N E ' S   H O U S E  -  N I G H T \n\n     Christine and Schuyler dash for the Benz, climb in and SCREECH OFF.\n     CRS MEN run for their van to pursue. \n\n     117.  I N T .   S C H U Y L E R ' S   M B Z  -  N I G H T \n\n     Schuyler drives for all he's worth, Christine watching behind.\n\n     118.  E X T .   S U B U R B A N   S T R E E T S  -  N I G H T\n\n     A brief CHASE, the van pursues the MBZ. \n\n     119.  I N T .   S C H U Y L E R ' S   M B Z  -  N I G H T\n\n     Christine turns forward, her eyes widen--\n\n                             CHRISTINE \n                     Watch out!!\n\n     120.  E X T .   S U B U R B A N   S T R E E T  -  N I G H T \n\n     The MBZ SIDESWIPES a car as Schuyler runs a light, his WINDSHIELD\n     CRACKS, the side of the car's CRUNCHED IN, but he keeps driving. \n     He crosses lanes directly in front of an oncoming TRUCK-- the VAN\n     HITS THE BRAKES to avoid getting squashed. \n\n     Schuyler SKIDS into a narrow alley.  THE VAN, having lost a half a\n     block, misses this and continues straight. \n\n     121.  I N T .   M B Z  -  N I G H T \n\n     Christine's looking behind as Schuyler drives.\n\n                             CHRISTINE\n                     OK, we lost 'em-- \n\n     She's THROWN FORWARD as Schuyler SLAMS ON THE BRAKES, reaches \n     across her and THROWS OPEN the passenger door, which CREAKS from \n     the collision.  He gives her a shove, she clings to the doorframe-- \n\n                             CHRISTINE \n                     What are you doing!? \n\n                             SCHUYLER\n                     Get out of my car. \n\n                             CHRISTINE \n                     I coulda handed you to them!  They\n                     find me now I'm dead-- \n\n     Schuyler pushes harder. \n\n     122.  E X T .   S U B U R B A N   A L L E Y  -  N I G H T\n\n     Christine tumbles into the wet gutter.\n\n                             CHRISTINE\n                     Listen to me you bastard-- I know\n                     what's going on!  No one else is\n                     gonna tell you! \n\n     Schuyler pulls the door shut, the car starts BACKING AWAY. \n     Christine gets to her feet, looks after him.  He reaches the end of\n     the alley and stops-- then SCREECHES FORWARD.  She jumps to the \n     edge of the alley, fearing he's trying to run her down.  Schuyler\n     HITS THE BRAKES a few feet away.  He leans across, calls to her. \n\n                             SCHUYLER\n                     Get in. \n\n     123.  I N T .   S C H U Y L E R ' S   M B Z  -  N I G H T \n\n                             SCHUYLER \n                     You can talk while I drive to the\n                     police station. \n\n     Christine puts a hand on the wheel before he can back up again. \n\n                             CHRISTINE \n                     No cops, I got an outstanding warrant.\n                        (off his look) \n                     Mail fraud.  I'll get nailed, but \n                     you'll never be able to prove a thing.\n                     Just drive. \n\n                                                       CUT TO:\n\n     124.  E X T .   H I G H W A Y  -  N I G H T \n\n     The MBZ SPEEDS out of a tunnel on the highway toward SF.\n\n     125.  I N T .   M B Z  -  N I G H T \n\n     Christine looks out the side window, lights a cigarette.\n\n                             CHRISTINE\n                     Heard about this big swindle and--\n                     I needed the money.  You wouldn't\n                     know what that's like. \n\n                             SCHUYLER \n                     Spare me the snide comments.  And\n                     please don't do that in here-- \n\n                             CHRISTINE \n                     Second-hand smoke is the least of\n                     your problems. \n                        (blows it in his face) \n                     Shit, they really screwed up, I can't\n                     believe they didn't take the time to\n                     get the house right. \n\n                             SCHUYLER \n                     Wait, how did-- before the game,\n                     you were working in that bar-- \n\n                             CHRISTINE \n                     They planted me in advance, your\n                     brother set you up. \n\n                             SCHUYLER \n                     Oh God, David's in on it...? \n\n                             CHRISTINE \n                     It's not his fault, he thought it was \n                     the only way out... just another victim. \n\n                             SCHUYLER \n                     How the hell did they think they \n                     were gonna get my money?\n\n                             CHRISTINE \n                     Honey, they already got it. \n\n     She gives him a pitying look.  Schuyler throws her a sidelong\n     glance; this is absurd.  She gestures at his car phone. \n\n                             CHRISTINE \n                     You don't believe me, check your \n                     bank accounts.  Listen, that night\n                     in your office, remember?  I \n                     downloaded files off your computer\n                     while you were in the shower...\n\n     CAMERA MOVES IN ON SCHUYLER'S FACE during the following and--\n\n                                                  DISSOLVE TO: \n\n     126. --SCHUYLER'S DESKTOP COMPUTER as CHRISTINE'S HAND inserts a \n     FLOPPY DISK and starts hitting keys. \n\n                             CHRISTINE (V. O.) \n                     I stuck in a code-breaking program\n                     to glve CRS remote access to Van\n                     Orton Group files...\n\n     127. --RAPID INSERTS from the CRS OFFICES-- Schuyler's SIGNATURE, \n     financial FORMS, a TAPE RECORDER, TEST FORMS, etc.\n\n                             CHRISTINE (V. O.) \n                     --you'd already given them everything\n                     else they needed.  Your handwriting, \n                     voice samples, personal information, all\n                     the tests you took... they used the data\n                     to generate your passwords. \n\n     --ON A CRT SCREEN as various combinations of letters and numbers\n     SCROLL BY, too quickly for the eye to read. \n\n                             CHRISTINE (V. O.) \n                     From there they just had to break into\n                     the financial networks, transfer your\n                     holdings into some dummy accounts-- \n\n     --PAN OVER BANKS Of COMPUTER TERMINALS in DARK OffICES as financial\n     READOUTS FLIP and CHANGE, VANISH.  HIGH NUMBERS go to 0.00. \n\n                             CHRISTINE (V. O.) \n                     Remember Jim Feingold, guy who \n                     signed you up?  He's one of the \n                     original hackers, did a five-year\n                     stretch for zapping Citibank. \n\n     --MOVE FROM deft fingers at a computer keyboard UPWARD toward the \n     screen.  POLARIZE to show, in reflection... FEINGOLD'S FACE, LIT BY\n     the BLUE-GREEN CRT LIGHT, a mask of evil. \n\n                             CHRISTINE (V. O.) \n                     He's not some dweeb flunkie, he runs\n                     the whole show. \n\n     END SERIES OF SHOTS, DISSOLVE TO: \n\n     128. SCHUYLER'S FACE... LIGHTS through the FRAGMENTED WINDSHIELD \n     cast weird PATTERNS on it.  He's pumping sweat now, reaches for his\n     cell phone, dials, hand shaking.  Christine flicks her cig out the\n     window; she sounds regretful. \n\n                             CHRISTINE \n                     I'm sorry.  They already did your\n                     brother, I guess they figured you\n                     for a family of suckers...\n\n                             SCHUYLER (on phone) \n                     Overseas operator?  Please dial the \n                     number for Allgemeine Bank in Zurich... \n\n                             CHRISTINE \n                     Bet you haven't really been taking \n                     care of business the past few days,\n                     huh?  This \"game,\" the psych shit\n                     about your dad going sui...\n\n                             SCHUYLER (on phone)\n                     Guten tag-- Vilen dank, Englisch... \n\n                             CHRISTINE \n                     All of it was just to buy time,\n                     keep you from paying attention... \n\n                             SCHUYLER (on phone) \n                     Blue Two-Five... 6-9-0-D... Yes, I\n                     consent to voice-print... My name\n                     is Schuyler Van Orton.  I'd like \n                     to know my balance, please... that\n                     account is closed?! \n\n                             CHRISTINE (nervously) \n                     I think maybe you should pull over...\n\n     Schuyler sets his jaw, drops the phone-- and turns the wheel hard.\n\n     129.  E X T .   H I G H W A Y  -  N I G H T\n\n     The MBZ SCREECHES for an offramp. \n\n     130.  E X T .   C O N V E N I E N C E   S T O R E  -  N I G H T \n\n     Schuyler's on his portable phone at a gas station/convenience \n     store, leaning on the Benz as he pumps gas.  Christine stands out\n     of earshot, arms folded, staring at the dark horizon. \n\n                             SCHUYLER (on phone) \n                     Bob, listen carefully, this is an \n                     emergency.  Feingold and his people,\n                     I've called all my banks, they've \n                     drained the accounts, personal and \n                     corporate, everything-- tell the cops\n                     I've got one of them with me, we'll \n                     make her testify.  They're trying to\n                     kill us, I'm heading for the island\n                     in Oregon, if I can still find it. \n                     Bob-- call when you get this message\n                     and-- be extremely careful... \n\n     131.  I N T .   C O N V E N I E N C E   S T O R E  -  N I G H T \n\n     START ON-- a thermos full of coffee, foodstuffs, miscellaneous \n     camping supplies as a CLERK holds a credit card, hangs up a phone.\n     He looks up at SCHUYLER and CHRISTINE.\n\n                             CLERK \n                     They say I gotta confiscate your card... \n\n     Schuyler sighs, \"of course,\" Christine fishes in her pocket. \n\n                             CHRISTINE\n                     I think I have some cash. \n\n     132.  E X T .   C O N V E N I E N C E   S T O R E  -  N I G H T \n\n     They emerge from the store with a couple of grocery bags, Christine\n     sucks an ice cream pop.  They toss the bags in the trunk.\n\n                             CHRISTINE \n                     Money isn't everything, right? \n\n     Schuyler is seething, clutching the trunk lid for a beat, then\n     SLAMS it hard when she steps back, making her jump.\n\n                             SCHUYLER \n                     It might be best if you didn't \n                     speak.  I very nearly crushed your\n                     skull just now. \n\n                             CHRISTINE \n                     C'mon chill, what'd they take you for, a\n                     couple hundred G's?  Chump change for a\n                     guy like you, chalk it up to experience. \n\n                             SCHUYLER \n                       (quietly, restraining himself)\n                     Just under a billion dollars. \n\n                             CHRISTINE\n                     A bil--? \n                          (nervous laugh) \n                     You're kidding, right? \n\n                             SCHUYLER \n                     Do I look like I'm kidding?\n                     This is about more than my \n                     personal lifestyle-- your pals \n                     raided pension plans, charitable\n                     foundations, company payrolls...\n\n                             CHRISTINE\n                     Oh my God-- \n\n                             SCHUYLER \n                     I don't know what kind of jerk-off\n                     con games you've played in the \n                     past, but now you're in the big\n                     leagues, hon.  You just helped\n                     sabotage a small portion of the \n                     national economy-- and destroy a\n                     whole lotta lives. \n\n     He stares at her, she looks sick and truly scared.  He climbs in\n     the car.  For once without a comeback, she gets in the car quietly. \n\n                                                       CUT TO:\n\n     133.  E X T .   D I R T   R O A D  -  D A W N \n\n     The Benz ZIPS AROUND a logging truck on a DIRT ROAD.\n\n     134.  I N T .   S C H U Y L E R ' S   C A R  -  D A W N \n\n     Schuyler, bleary-eyed, drains coffee from the thermos and tosses it \n     aside.  He glances over at the sleeping Christine, her head tilted\n     toward his shoulder; she looks pretty sexy.  He stares at her for a\n     moment, SIGHS and turns away. \n\n                                                       CUT TO:\n\n     135.  E X T .   O R E G O N   L A K E  -  D A Y \n\n     A beautiful Northern lake-- dense forests on the mainland, pines \n     and fall foliage.  A STORM coming in, ominous CLOUDS.  The Benz is\n     parked at the shoreline.  MOVE TO FIND Schuyler and Christine, as\n     they paddle a rowboat toward a small island with a surprisingly\n     humble, somewhat decrepit cabin on it.  A FLASH OF LIGHTNING. \n\n                                                       CUT TO: \n\n     136.  I N T .   O R E G O N   C A B I N  -  D A Y\n\n     CHRISTINE pours a cup of coffee from a metal pot on a wood-burning\n     stove in which a FIRE CRACKLES.  This cabin is genuinely rustic and\n     run-down-- hewn wood, fishing rods, cobwebs, rain damage, dust.\n     WATER DRIPS from the ceiling in a few places.  LIGHTNING FLASHES in\n     BG through the scene, the STORM has gotten pretty bad. \n\n     SCHUYLER finishes taking out his contacts, DROPPING them in cups\n     full of water. He slips on his glasses, then looks at a few framed\n     family photos on the coffee table in front of him.  Christine,\n     barefoot, brings him a cup of coffee, which he sips gratefully. \n\n                             SCHUYLER \n                     You're not having any? \n\n                             CHRISTINE \n                     Never drink it.  Makes my tits hurt. \n\n     Schuyler gives her a sidelong glance, looks back at a photo. \n\n     ON PHOTO-- he rubs away the dust from a shot showing Schuyler's\n     father, with young Schuyler, on a boat with fishing equipment. \n\n     CHRISTINE takes a step and CRIES out, clutching her foot and \n     sitting beside Schuyler.  A small FISHHOOK protrudes from her foot, \n\n                             SCHUYLER\n                     Hold still. \n\n     He talks while he carefully removes the hook from her foot. \n\n                             SCHUYLER \n                     Sorry, this place hasn't been cleaned\n                     in a while.  My dad built it himself,\n                     spent a lot of time here alone.\n                         (regards a LEAK)\n                     Rotten carpenter...\n\n     He pulls out the hook, puts it aside; she rubs her foot. \n\n                             CHRISTINE\n                     Thank you. \n\n     SCHUYLER suddenly starts LAUGHING, wipes tears from his eyes. \n\n                             CHRISTINE\n                     What's so funny? \n\n                             SCHUYLER \n                     Just-- private joke...\n\n                             CHRISTINE\n                     Tell me. \n\n                             SCHUYLER \n                     Well... I always told myself I \n                     wasn't gonna end up like him.  And\n                     now here I am, running his \n                     corporation, living in his house,\n                     hiding in the cabin where he went\n                     to hide right before he... I even\n                     look like the bastard. \n\n     Christine looks at the photo of MR. VAN ORTON, then at Schuyler. \n\n                             CHRISTINE\n                     Not that much. \n\n                             SCHUYLER \n                     Mm, plus I'm a helluva lot more\n                     gullible than he ever was...\n\n     THE CELL-PHONE CHIRPS, Schuyler shakes off his self-pity, snatches\n     up the handset. \n\n                             SCHUYLER\n                     Yes. \n\n     CHRISTINE mouths, \"Who is it?\" \n\n                             PLYMPTON (filter) \n                       (careful, worried)\n                     It's me, Schuyler... I got your message... \n                     I'll admlt, I was very disturbed... \n\n                             SCHUYLER \n                        (hand over phone)\n                     My, lawyer. \n                          (to Plympton)\n                     So.  What's our next move? \n\n     During the following, Christine's eyes go wide, she shakes her head\n     frantically, draws a finger across her throat-- \n\n                             PLYMPTON (filter) \n                     I've been on the phone all morning... your\n                     funds are intact, nothing's changed, \n                     there's been no activity whatsoever...\n\n     SCHUYLER struggles to absorb the import of this as well as\n     Christine's behavior.  She shakes her head with a sigh, rises to\n     refill his coffee cup. \n\n                             SCHUYLER\n                     Wait-- that's not true-- \n\n                             PLYMPTON (filter)\n                             (firmly) \n                     It is true, no one is after your \n                     money, no one is trying to hurt you-- \n\n     SCHUYLER looks at Christine with horror.  She nods and WHISPERS: \n\n                             CHRISTINE\n                     He's in on it. \n\n                             SCHUYLER\n                     Oh, God...\n\n                             PLYMPTON (filter)\n                     Listen to me, Sky! \n\n                             SCHUYLER \n                     What are they paying you, Robert?\n                     Piece of the action? \n\n                             PLYMPTON (filter) \n                     Schuyler!  Look, you've done the \n                     right thing going up there, maybe \n                     it's best if you just sit tight for\n                     a while, forget about everything,\n                     it's all under control-- \n\n     Schuyler HANGS UP, breathing hard, pacing, clutching the phone. \n\n                             SCHUYLER \n                     We have to get out of here! \n\n     Christine approaches him with a fresh cup of coffee, which he sips.\n     The PHONE CHIRPS again, Schuyler THROWS it violently against the \n     wall, it's silenced.  He gulps more coffee, rising again, looking\n     at the smashed phone, sickened by his own loss of control. \n\n                             SCHUYLER \n                     Well, that was stupid. \n\n     Christine watches him closely.  He keeps balling his hands into\n     fists as he paces, trying to think out his next play. \n\n                             SCHUYLER \n                     OK, they've gotten to him.  OK.\n                     Is there anyone I can trust? \n\n                             CHRISTINE \n                     Mm... I wouldn't worry about it. \n\n                             SCHUYLER\n                             (a beat) \n                     What do you mean? \n\n                             CHRISTINE \n                     It's out of your hands. \n\n     He takes a step, stumbles, shakes his head to clear it.  She rises,\n     picks up his half-empty cup and heads for the kitchen area.  His\n     gaze follows this, he realizes he's been drugged. \n\n                             SCHUYLER\n                     Christine!!\n\n                             CHRISTINE \n                     That's not my name. \n\n     With a CRY OF RAGE he lunges after her, but CRASHES into the wall,\n     clutching at a hanging ROD, which falls when he does-- he KNOCKS\n     OVER the table of photos as he goes down, PANTING for air like a\n     fish out of water, clutching his stomach, nauseated. \n\n     HIS POV-- SIDEWAYS, LOW ANGLE.  SFX, BLOOD POUNDING in his head.\n     Schuyler's eyes FOLLOW the GROOVES of the wet, warped hardwood\n     floor, they lead to-- and almost seem to point to-- Christine. \n\n     ANOTHER ANGLE, CLOSE-- from the counter she picks up a small vial\n     with a bit of powder at the bottom, slips it into her pocket. \n\n     SCHUYLER's eyes roll into his head as he struggles against the\n     effects, tries to get to his hands and knees.  He gasps:\n\n                             SCHUYLER\n                     Why...\n\n     CHRISTINE approaches, stands a few feet away, lights a cigarette, \n\n                             CHRISTINE \n                     We needed you to call your banks. \n                     Cellular calls can be intercepted,\n                     rerouted, y'know.\n\n     She crouches by him, flicking ashes a few inches from his nose. \n\n                             CHRISTINE \n                     All those calls to Switzerland and \n                     Chase Manhattan-- you were talking to\n                     our people.  See, we were still\n                     missing a lotta pieces-- access \n                     codes, passwords, stuff even Plyrnpton\n                     didn't have-- but now we have \n                     I everything.  I guess you are pretty\n                     fucking stupid-- but thanks. \n\n     He CLAWS at her helplessly with a GROAN, but misses.  His glasses\n     fall off, he collapses again.\n\n     SCHUYLER'S POV-- everything a BLUR NOW, except in EXTREME FG-- the \n     photo of himself and his father, which now lies on the floor.\n\n     137. FLASH-CUT TO:  FLASHBACK POV-- THE MOMENT OF IMPACT, as MR. \n     VAN ORTON'S FACE SMASHES into the ground, his GLASSES SHATTERING,\n     BLOOD SPRAYING from his head. \n\n     138. CUT BACK TO:  SCHUYLER writhes, fighting the drug. \n\n     139. FLASH-CUT TO:  The moment of his father's jump-- only in this\n     HALLUCINATION, SCHUYLER himself wears the robe, leaps into space. \n\n     140. SCHUYLER'S POV-- FROM FLOOR-- Christine moves INTO FOCUS,\n     crouches near him, studying her victim almost clinically. \n\n                             CHRISTINE\n                     It's over.  Just let go...\n\n     The SFX POUNDING STOPS, and-- \n\n                                                  CUT TO BLACK\n\n     BREATHING... THEN SCREAMING, POUNDING and KICKING...\n\n     141.  I N T .   C R Y P T  -  D A Y \n\n     A WOODEN LID SPLINTERS as SCHUYLER pounds his way out of a COFFIN.\n     DIM LIGHT through CRACKS in the walls, this is an old and moldering\n     MAUSOLEUM, other COFFINS nearby.  FRESH FLOWERS surround his \n     resting place, otherwise everything is completely DECAYED.\n\n     By the time SCHUYLER gets out of the coffin, his arms are BLOODIED.\n     He's been dressed in an ALL-WHITE BURIAL SUIT.  A RED ROSE is TAPED\n     to his chest.  He blinks and stares about wildly-- \n\n     HIS POV-- BLURRY, can't make out much. \n\n     SCHUYLER blinks, breathing hard, utterly freaked.  He notices the\n     ROSE on his chest, tears it off, SNIFFS it, then THROWS IT aside\n     with a frustrated CRY.  He stumbles to the heavy door of the crypt,\n     tugs, then realizes it opens the other way-- he gives it a PUSH-- \n\n     142.  E X T .   C E M E T E R Y  -  D A Y \n\n     IT COLLAPSES immediately.  SCHUYLER tumbles out of the crypt into\n     the HOT SUNLIGHT.  He's in a ramshackle city of the dead, a SPANISH\n     GRAVEYARD.  There are endless rows of TOMBS, rioting tropical\n     VEGETATION, many FLOWERS, impossibly bright COLORS.  It should be\n     quite beautiful and peaceful...\n\n                             SCHUYLER\n                     What? \n\n     He walks around tentatively, SQUINTING.  AN OLD WOMAN in black sits\n     contemplating a grave, fingering her rosary.  SCHUYLER slips a hand\n     absently into his pocket, and finds something there, pulls it out-- \n\n     SCHUYLER'S POV-- BLURRY shot of a NOTE in SPANISH, with a KEY on\n     the stationery...\n\n     SCHUYLER blinks, slips the note in his pocket. \n\n                                                       CUT TO: \n\n     143.  E X T .   C E N T R A L   A M E R I C A N   S T R E E T  -  D A Y \n\n     TIGHT SHOT on Schuyler blinking, disoriented, JOSTLED by a sea of \n     HISPANIC PEOPLE on this busy street. \n\n     SCHUYLER'S POV-- WALKING TENUOUSLY.  The world's a BLUR, FACES move\n     in and out of FOCUS.  They're dark, foreign, many POOR PEOPLE, \n     poverty-scarred features.  Scraps of SPANISH.  He grabs a DARK MAN.\n\n                             SCHUYLER\n                     Where am I?! \n\n     The man replies with an EXCLAMATION in SPANISH, pushes Schuyler\n     away, CAMERA TUMBLES-- \n\n     OBJECTIVE SHOT-- Schuyler's on his knees in the middle of this\n     third-world thoroughfare, utterly disoriented.  STREET VENDORS sell\n     weird-looking foods, squads of SQLDIERS march with rifles, \n     MUSICIANS PLAY odd instruments... Schuyler clutches his head, as if\n     trying to wish it all away. \n\n     A COP IN BEIGE UNIFORM suddenly prods at him with a nightstick,\n     YELLING AT HIM in SPANISH to move on. \n\n     SCHUYLER'S POV-- the COP looming over him, a BLURRY menace, the end\n     of the nightstick SHARP in FG as it POKES at him. \n\n     ANOTHER ANGLE-- Schuyler pleads with the man: \n\n                             SCHUYLER \n                     Please, help me, I'm an American!\n                     I'm lost!  Please!! \n\n     This doesn't seem to help.  He tries to get away from the stick,\n     but the cop pursues.  He bangs into people as he tries to move\n     quickly, the stick right behind him. \n\n     Schuyler FALLS over a BEGGAR on the ground, in far worse shape than\n     he is.  The cop YELLS at him.  Schuyler covers his head, holding \n     out the NOTE WITH THE KEY, which the cop finally snatches away.  He\n     studies it for a moment, then BARKS with LAUGHTER. \n\n     SCHUYLER'S POV-- the cop reaches down to him-- \n\n     OBJECTIVE ANGLE-- Schuyler cringes, expecting a blow, but the cop\n     just pulls him to his feet.  He drags him away with him, speaking\n     more gently IN SPANISH, amused.  Schuyler nods thankfully. \n\n     HIGH ANGLE-- the THRONGS on this crowded street. \n\n                                                       CUT TO:\n\n     144.  I N T .   F O R E I G N   P O L I C E   S T A T I O N  -  D A Y \n\n     A DESK SERGEANT studies the note, approaching SCHUYLER, whose face\n     is now red, SUNBURNT.  He sits on a bench with a VAGRANT or two.\n\n                             SCHUYLER \n                     Hello.  Where am I? \n\n                             DESK SERGEANT\n                     Tegucigalpa. \n                       (off Schuyler's blank look)\n                     Tegucigalpa.  Tegucigalpa? \n\n                             SCHUYLER\n                     That's gibberish! \n\n                             DESK SERGEANT\n                            (annoyed) \n                     It is the capital of Honduras. \n\n     SCHUYLER buries his face in his hands, nods.  He's relieved to have\n     found an English speaker at least. \n\n                             SCHUYLER\n                     Right. \n\n                             DESK SERGEANT \n                     So-- you have become, lost from,\n                     from your father...? \n\n                             SCHUYLER \n                     My father's dead, God damn it.  I have\n                     to get to the United States embassy. \n\n     The sergeant cocks his head, confused.  Indicating the note:\n\n                             DESK SERGEANT \n                     Do you know what this says? \n\n                                                       CUT TO:\n\n     145.  I N T .   A M E R I C A N   E M B A S S Y   L O B B Y  -  D A Y \n\n     An Hispanic embassy WORKER behind a desk with a U. S. flag\n     TRANSLATES THE NOTE aloud in amazed, unaccented English. \n\n                             WORKER \n                     \"I am an American.  I am an idiot.\n                     My father is very rich.  If I \n                     become lost, please take me to the\n                     police.  There is a reward.\" \n\n     ANOTHER ANGLE-- Schuyler, utterly humiliated, sits in a chair on\n     the other side of the desk. \n\n                             WORKER \n                     Mr. Van Orton... is this a joke of \n                     some sort?  What are you doing here? \n\n                             SCHUYLER\n                     I don't know. \n\n                             WORKER \n                             (a beat) \n                     Well, without any identification it \n                     will take at least a week to get you\n                     a temporary visa-- \n\n                             SCHUYLER\n                             (rising) \n                     A week?!  Christ knows what they\n                     can do in a week-- and what the\n                     hell am I supposed to, to live\n                     on?!  What day is it anyway? \n                        (squints at his watch, thinks)\n                     Where's the nearest pawn shop? \n\n                                                       CUT TO:\n\n     146.  I N T .   W E I R D   B O D E G A  -  D A Y \n\n     A middle-aged Latina-- the BODEGA LADY-- counts out a stack of\n     bills on the counter, beside Schuyler's watch.  Her store displays\n     JEWELRY, KNIVES, MUSICAL INSTRUMENTS, as well as mystical CANDLES,\n     POTIONS and BOTTLES with DEAD ANIMALS in formaldehyde. \n\n                             PAWN SHOP OWNER \n                     This will buy you a plane ticket.\n\n     On the other side of the counter, SCHUYLER Sorts through A BOX OF\n     EYEGLASSES, trying on different pairs. \n\n                             SCHUYLER \n                     Yeah, well I, I seem to have lost my\n                     passport... \n\n     The pawn shop owner nods knowingly.  There's one other CUSTOMER, a\n     shabbily-dressed but honest-looking HONDURAN MAN, looking through a\n     BIN full of sports equipment.  He seems to have been eavesdropping,\n     the pawn shop owner now exchanges a few words with him IN SPANISH,\n     clearly they're coming to some kind of deal.  Meanwhile, Schuyler\n     puts on a rhinestone-studded pair of woman's glasses, looks around. \n\n                             SCHUYLER \n                     Huh, close enough...\n\n                             PAWN SHOP OWNER\n                     I throw them in. \n                        (indicating the man) \n                     This man says he can help you...\n\n     Schuyler narrows his eyes at the Honduran man, who flashes a\n     crooked-toothed smile. \n\n                                                       CUT TO:\n\n     147.  E X T .   G U A T E M A L A N   H I G H W A Y  -  D A W N \n\n     A large, covered STAKE TRUCK RUMBLES BY on a hilly jungle highway.\n\n     148.  I N T .   S T A K E   T R U C K  -  D A W N \n\n     In the back of the truck, Schuyler rides among HUNDREDS OF BAGS of\n     COFFEE BEANS, marked \"CAFE, PRODUCTO DE HONDURAS.\"  He wears the\n     silly rhinestone glasses, as well as cheap new clothes-- shorts, a\n     Spanish message T-shirt, sneakers.  He munches on a mango, peeks\n     out a hole in the tarp at the passing scenery.\n\n     HIS POV-- a VISTA of spectacular beauty, ideally jungle-encrusted\n     MAYAN RUINS against the backdrop of the rising sun. \n\n     SCHUYLER's quite taken with the view, despite his troubles. \n\n                                                  DISSOLVE TO:\n\n     149.  E X T .   B O R D E R   C R O S S I N G  -  E V E N I N G \n\n     The stake truck is parked at a U. S. BORDER CROSSING in the desert. \n     The Honduran man-- the truck's driver-- shows his papers to an\n     INSPECTOR as he walks him to the back of the IDLING truck. \n\n     ANGLE FROM INSIDE TRUCK as a tarp is lifted.  The inspector glances\n     inside, examines a couple of COFFEE BAGS.  IN FG, Schuyler hides\n     below a bag or two, holding his breath.  The tarp falls again,\n     Schuyler exhales with relief in the darkness. \n\n                                                       CUT TO: \n\n     150(NEW).  E X T .   B U S   T E R M I N A L  -  N I G H T \n\n     MOS, SCHUYLER has been reduced to pan-handling for bus fare in \n     front of a San Antonio BUS STATION.  An OLDER MAN takes pity, gives\n     him a bill, he moves on to a couple who shake their heads and avoid\n     looking at him.  He hurries off at the sight of a disapproving COP.\n\n                                                  DISSOLVE TO:\n\n     150B(NEW).  I N T . / E X T .   B U S  -  D A Y \n\n     ANGLE ON BUS WINDOW, ARIZONA/UTAH SCENERY reflected in the glass... \n\n     POLARIZE to show SCHUYLER through the bus window, exhausted, numbly\n     taking in the glorious view. \n\n                                                  DISSOLVE TO:\n\n     151.  E X T .   S C H U Y L E R ' S   H O U S E  -  N I G H T \n\n     All seems quiet, the house dark-- late at night.  There's a \n     movement in the bushes near the street-- SCHUYLER emerges, on the \n     lookout for any surveillance.  It seems safe.  He digs out a hidden\n     KEY from within a FAKE ROCK then goes to the front door, gathers up\n     NEWSPAPERS and a thick stack of MAIL from his box.  He flips \n     through it quickly, finds a postcard that interests him and shoves\n     it in his pocket-- the rest of the mail he leaves in the box.  He \n     punches in his code on the alarm pad, unlocks the door and enters. \n\n     CLOSE ON ALARM PAD-- the light goes from GREEN to RED.\n\n     152.  I N T .   S C H U Y L E R ' S   H O U S E  -  N I G H T \n\n     SCHUYLER blinks as he enters the house-- the graffiti is gone, the \n     mess cleared up, it actually looks cleaner than ever. \n\n     QUICK SHOTS, JUMP-CUTS, the rhythm jarring.  LIGHTS LOW throughout,\n     Schuyler wants to attract as little attention as possible... \n\n     152A(NEW). IN THE KITCHEN, SCHUYLER gobbles handfuls of dry cereal,\n     grabs for anything he can find in the refrigerator. \n\n     153. IN THE SHOWER, Schuyler scrubs away the grime.\n\n     154. IN THE BATHROOM, he inserts a CONTACT LENS. \n\n     154A. IN A DESK DRAWER he finds a few $20.00 bills. \n\n     154B. IN THE BEDROOM-- Schuyler changes into jeans and a sport\n     jacket, tucking the MONEY and the POSTCARD into the pockets.  As he\n     turns to leave, he spots something on his dresser-- \n\n     A WHITE ENVELOPE, with a handwritten \"TO WHOM IT MAY CONCERN...\"\n\n     SCHUYLER frowns at this. tears it open. reacts with fear...\n\n     155. IN THE KITCHEN, SCHUYLER holds the handwritten note to the \n     BLUE FLAME.  He tosses the BURNING PAGE into the sink. \n\n     CLOSE SHOTS on the curling, burning note, we make out KEY WORDS: \n\n     \"MY FATHER WAS RIGHT,\" \"NO REASON TO CONTINUE,\" \"TAKE MY OWN LIFE,\"\n     \"I WANT ONLY DEATH...\" and finally the signature, \"SCHUYLER VAN\n     ORTON...\"  This suicide note is no joke. \n\n     SCHUYLER backs away from the sink.  Quiet, determined:\n\n                             SCHUYLER \n                     No.  Fuck you... I'm going to live...\n\n     156.  I N T .   S T U D Y  -  N I G H T \n\n     Schuyler moves to a bookshelf, looking for a volume, finds--\n\n     CLOSE-- a large, leather-bound BLACK BOOK with no title. \n\n     SCHUYLER clutches the volume.  HEADLIGHTS shine in the window, a\n     VEHICLE in the drive.  Schuyler moves for a back door.\n\n     157.  E X T .   V A N   O R T O N   H O U S E  -  N I G H T \n\n     A CAR DOOR CLOSES, we see a UNIFORMED FIGURE MOVE O. S., revealing \n     A POLICE STYLE CREST, the words \"CALIFORNIA RESIDENTIAL SECURITY,\"\n     the initials \"CRS\" in the center. \n\n     SCHUYLER, sneaking around the side of the house, takes this in,\n     waiting for the RENT-A-COPS with FLASHLIGHTS and WEAPONS to enter\n     his house.  Then he hurries away, book under his arm. \n\n     157A(NEW).  E X T .   P A C I F I C   H E I G H T S   S T R E E T  -  D A W N \n\n     UNDER A STREET LAMP on a hilly street, SCHUYLER reaches into his\n     pocket and squints at THE POSTCARD-- \n\n     INSERT POSTCARD, the message side:  \"S - IT'S SAFE HERE - D.\"  An \n     ARROW points to a printed ADDRESS.  Schuyler FLIPS the card over--\n     a PAINTING of a COLONIAL MANSION down a tree-lined DRIVE... \n\n                                                  DISSOLVE TO:\n\n     158.  E X T .   M A N S I O N   G A T E S  -  D A Y \n\n     THE SAME VIEW of the same mansion, a very beautiful, peaceful spot.\n     SCHUYLER moves down the drive toward the entrance.  He carries the\n     thick book, as he will through following scenes.\n\n     159.  I N T .   S A N I T A R I U M   C O R R I D O R  -  D A Y \n\n     A NURSE leads Schuyler down a door-lined corridor, no one in sight.\n     This place turns out to be an incredibly ritzy SANITARIUM. \n\n                             NURSE \n                     The medication seems to be helping. \n                     Unfortunately we're going to have to\n                     transfer your brother to a public \n                     institution in a few days, his funds \n                     are entirely exhausted-- unless you're\n                     prepared to take responsibility...\n\n     She KNOCKS at a door, OPENS IT a crack and lets Schuyler in.\n\n     160.  I N T .   S A N I T A R I U M   R O O M  -  D A Y \n\n     A pleasant bedroom, and safe-- no sharp objects or primary colors \n     in sight, discreet decorative BARS on the window. \n\n     DAVID, in pajamas, sits in a chair, eating bland food from a \n     plastic lunch tray.  He watches a GOLF MATCH on a tiny WATCHMAN TV,\n     we'll hear it IN BG-- CLAPPING, etc.  He doesn't react as Schuyler\n     enters, moves to his side. \n\n                             SCHUYLER\n                     David... \n\n     David turns to him, half-smiles; food particles on his lips. \n\n                             DAVID\n                     Hello Sky...\n\n     Schuyler sits close to David, upset. \n\n                             SCHUYLER\n                     What are you doing here? \n\n                             DAVID \n                     Sorry, I was just eating...  I'm\n                     much better.  Really. \n\n     David does seem in control now, if a little hazy. \n\n                             SCHUYLER \n                     Thank God... Listen, I know you put\n                     them onto me-- but I understand, \n                     we're both victims of this thing...\n                     They've stolen everything we ever\n                     had, they're trying to drive us both \n                     crazy-- but we won't let them. \n                     We'll find a way.  There's gotta be \n                     a way to beat these bastards!  We're\n                     in it together...\n\n     He clutches his brother's hand.  David narrows his eyes, confused. \n\n                             DAVID \n                     In what together? \n\n                             SCHUYLER\n                     The game. \n\n                             DAVID \n                     Oh, Schuyler, there is no game.  It\n                     was just a fantasy of mine, a self-\n                     aggrandizing delusion... I can't \n                     believe you took that shit seriously. \n\n                             SCHUYLER\n                       (clutching his hand)\n                     No, David-- please... \n\n                             DAVID \n                         (pulling away) \n                     Oh, man, stop fucking with me! \n                     You know the game doesn't exist...\n                     it never did!  It never did...\n\n     Schuyler stares at him for a beat-- no getting through.  David\n     leans forward, turns UP THE TV VOLUME, aiming the set at Schuyler. \n\n                             DAVID\n                     Can you see? \n\n     ON SCREEN-- a golf ball rolls on a green and PLOPS into the cup.\n\n                                                       CUT TO:\n\n     161.  I N T .   S F   P O L I C E   S T A T I O N  -  D A Y \n\n     Barnett, the detective from earlier, has come out to the reception \n     area to speak with Schuyler, who's trying very hard to be rational. \n\n                             BARNETT \n                     So the waitress was in on it--\n\n                             SCHUYLER \n                     She isn't really a waitress. \n\n                             BARNETT \n                     --and now you're brother's been \n                     institutionalized... is there a history\n                     of mental illness in your family? \n\n     SCHUYLER narrows his eyes at the question.  GALLO, beyond a METAL\n     DETECTOR in the rear area of the station, gestures to Barnett, who\n     holds up a finger. \n\n                             BARNETT \n                     'Scuse me. \n\n     Moving away, Barnett glances at the leatherbound book, which\n     Schuyler clutches very possessively. \n\n                             BARNETT \n                     Whatcha reading? \n\n                             SCHUYLER\n                     Nothing. \n\n     Barnett purses his lips, nods, steps around the metal detector to\n     chat with Gallo. \n\n     WITH GALLO AND BARNETT \n\n                             GALLO \n                     I just spoke with his lawyer \n                     Plympton, he thinks Van Orton's\n                     having a nervous breakdown, we \n                     should probably hold onto him till \n                     his people can get down here...\n\n     WITH SCHUYLER as GALLO AND BARNETT glance in his direction, gesture\n     for him to approach.  Gallo WINKS casually at Schuyler. \n\n     SCHUYLER, wary now, moves toward them through the METAL DETECTOR--\n     which GOES OFF with a WHINE.  The ALARM MONITOR woman approaches\n     with a wand-- but Schuyler steps back, wide-eyed. \n\n                             ALARM MONITOR\n                     Probably just your keys, sir-- \n\n     SCHUYLER turns and moves quickly for the exit. \n\n                             BARNETT\n                     Yo, Schuyler, wait up-- \n\n     He's through the door.  The WHINE OF THE DETECTOR continues as we--\n\n                                                       CUT TO:\n\n     162.  E X T .   B A R T   T R A I N  -  N I G H T \n\n     THE WHINE dissolves into the SCREECHING of a TRAIN on an EL TRACK.\n\n     163.  I N T .   B A R T   T R A I N  -  N I G H T \n\n     LIGHTS FLICKER on and off in a moving train car. \n\n     SCHUYLER scribbles intently in a brand new kid's school notebook, \n     open in his lap.  He sits at the end of the moderately crowded \n     train car.  Suddenly, he looks up, eyes wild, starts SCANNING the \n     subway car slowly, sensitive to it all.  By now he's definitely the\n     sort of person you'd avoid in a public place. \n\n     INTERCUT POV with his REACTIONS, as everything falls into place in\n     his increasingly febrile mind...\n\n     SCHUYLER'S POV-- SLOW PAN OVER the assortment of nighttime RIDERS--\n     a couple of TEENAGERS, an OLDER WOMAN with shopping bags, a DRUNK. \n\n     CAMERA PAUSES on a patch of GRAFITTI:  typically unreadable SCRAWL,\n     but the letters could be CRS. \n\n     CAMERA MOVES to the overhead ADVERTISEMENTS:  one for hemrnorhoids,\n     a seasonal bank ad featuring the EASTER BUNNY... PAUSE ON a PHOTO\n     of an ecstatic CALIFORNIA LOTTERY WINNER holding up a wad of cash\n     with the words \"YOU CAN'T WIN IF YOU DON'T PLAY.\"\n\n     A MAN READS the SPORTS PAGE:  \"GAME FINAL 23-2.\" \n\n     ON THE FLOOR, a CANDY BAR WRAPPER with A GOLD KEY printed on it,\n     part of a contest. \n\n     SCHUYLER picks this up, examines and discards it. \n\n     SCHUYLER' S POV-- an ELDERLY MAN with a clunky HEARING AID is \n     looking at Schuyler with a blank expression.  The man suffers from\n     a facial TWITCH that causes one eye to BLINK rapidly. \n\n     SCHUYLER narrows his eyes at the man, then looks away pointedly.\n     He puts the notebook into A PLASTIC BAG.  Beneath it, cradled in\n     his lap, is the mysterious black book.  He opens this carefully-- \n\n     CLOSE, the book is hollow.  Inside is an expensive HANDGUN. \n\n     WIDE SHOT from the next train car-- A FIGURE IN FG is staring\n     through the scratched, fogged window AT SCHUYLER as he puts the\n     leather book into the bag with his notebook... \n\n     164.  E X T .   B A R T   T R A C K S  -  N I G H T\n\n     The train car SHOOTS into a tunnel. \n\n                                                  DISSOLVE TO:\n\n     165.  I N T .   B A R T   C A R  -  D A W N \n\n     Schuyler is using the plastic bag and his jacket as a pillow, his \n     eyes closed.  Suddenly there's a KNIFE at his throat. \n\n                             PUNK\n                     End of the line, man. \n\n     SCHUYLER starts; the PUNK keeps the knife on him.  He's a young,\n     glassy-eyed junkie.  He wears a RADIO EARPLUG in one ear, a wire\n     heading down to his waist.  Schuyler nods, starts studying the\n     man's arms, heavily TATTOOED with crude cabalistic SYMBOLS. \n\n                             SCHUYLER \n                     Are the tattoos supposed to mean\n                     something? \n\n                             PUNK \n                       (momentarily thrown) \n                     Yeah, they mean you're dead, you\n                     don't gimme what you got. \n\n                             SCHUYLER \n                      (touches the punk's arm)\n                     OK, there's the C... \n\n                             PUNK \n                     Give me the fucking bag! \n\n                             SCHUYLER \n                          (cold, deadly) \n                     Come on, you're not going to put \n                     me through all this shit and then\n                     kill me on a fucking train, it\n                     won't look like a suicide... \n\n     As Schuyler speaks he sits up, the PUNK grabs the bag-- Schuyler \n     grabs the guy's knife hand, they wrestle on the floor of the car,\n     clawing at each other.  The punk drops the knife, it gets knocked\n     beneath the seat, both men reach for it...\n\n                             TRANSIT COP\n                     Freeze assholes! \n\n     Schuyler and the punk look up to see a TRANSIT COP pointing his\n     WEAPON.  The punk throws his hands up, scrambles to his feet-- \n\n                             PUNK \n                     Psycho pulled a knife on me! \n\n     The cop has grabbed the still prone Schuyler, flipping him over and\n     slapping a handcuff on him-- \n\n                             SCHUYLER \n                     What do you think you're doing,\n                     this guy attacked me! \n\n     The cop has dropped his guard; the punk spins and bolts into the\n     next car, squeezing through the door.  The TRANSIT COP hastily\n     cuffs Schuyler to an armrest-- \n\n                             TRANSIT COP\n                     Wait here--\n\n     He dashes into the next car after the punk.  Schuyler looks at the\n     floor of the car, sees-- \n\n     THE SMALL RADIO and its EARPLUG attached by a WIRE.  The radio has\n     a tiny LOOP/RABBIT EAR antenna on it.  He snatches it up, then\n     YANKS at the cuff.  He spots the knife under the seat, grabs it,\n     starts using the blade to unscrew the armrest from its post.\n\n     FROM THE NEXT CAR he hears SHOUTS, SCREAMS, a serious commotion\n     going on, he doesn't know who's winning.  Schuyler's almost gotten\n     free as the TRAIN SLOWS, when-- \n\n     --the DOOR at the far end of the car opens, it's the PUNK, bruised\n     and bloody, ready to kill. \n\n     He lunges at Schuyler just as he PRIES THE ARMREST off the seat and\n     CLOBBERS him with it.  The punk reels back.  The train has stopped,\n     the doors have opened-- Schuyler grabs his bag and squeezes out\n     onto the platform just before they shut again. \n\n     166.  I N T .   B A R T   S T A T I O N  -  D A Y \n\n     SCHUYLER locks the free cuff on to the same wrist as the other,\n     sliding his jacket over them, moving briskly up the stairs. \n\n     167.  E X T .   B E R K E L E Y   S T R E E T  -  D A Y \n\n     SCHUYLER emerges and walks quickly, checking over his shoulder,\n     BLINKING IN THE BRIGHT MORNING SUN.  He fiddles with the RADIO, the\n     PLUG to his ear.  We hear STATIC, BLEEPING NOISES, FILTERED VOICES.\n     For a few moments the VOICES ON THE RADIO become CLEARER. \n\n                             RADIO VOICE #1 \n                     --can't let him get away with this,\n                     he's outta control!  The next thing\n                     you know, he'll push the wrong\n                     button and we'll all be dead-- \n\n     SCHUYLER listens intently, leaning against a wall in the shadows,\n     breathing hard.  He stares nervously at a couple of nearby STREET\n     PEOPLE huddled by a shopping cart, they stare back.  Another VOICE\n     on the radio talks OVER the first: \n\n                             RADIO VOICE #2 \n                     --Whoah whoah whoah-- OK the guy's a\n                     moron, sure, but he doesn't have the \n                     balls to end the world!  Anyway I'm\n                     sicka talking politics, let's get back\n                     to the business of nipple piercing--\n                     you got a ring, don't ya Robin? \n\n     We hear the HYSTERICAL GIGGLING of ROBIN QUIVERS.  SCHUYLER blinks,\n     recognizing the voice of RADIO DJ HOWARD STERN. \n\n                             RADIO VOICE #2 (HOWARD STERN)\n                     Ugh, we gotta do commercials, this is\n                     the Howard Stern show...\n\n     SCHUYLER fiddles frantically with the dial and antennas, calling up\n     RANDOM RADIO MUSIC, COMMERCIALS, etc.\n\n     CLOSE ON A TRASH CAN-- Schuyler tosses his hollowed leather book\n     into it.  It falls open, we see the gun is gone. \n\n                                                       CUT TO:\n\n     168(NEW).  I N T .   H O S P I C E  -  D A Y \n\n     TRACK DOWN an institutional corridor, a few EMACIATED PATIENTS in\n     wheelchairs... they only come here to die.  ELIZABETH, Schuyler's\n     ex, 4Oish, fit and attractive, a few months pregnant, READS to a\n     couple of sad PATIENTS in a lounge area.  She trails off as she\n     looks up, astonished to see-- \n\n     SCHUYLER, bruised, frightened, almost looking like he belongs here. \n\n                             SCHUYLER \n                     Hello Elizabeth...\n\n     168A(NEW).  I N T .   S P O R T S   C A R  -  D A Y \n\n     Elizabeth backs out of a parking lot in a 3OO-ZX CONVERTIBLE and\n     pulls into traffic, Schuyler beside her, babbling emotionally. \n\n                             SCHUYLER \n                     I'm sorry, I shouldn't be \n                     bothering you-- you're a genuinely\n                     good person, your work is \n                     important, it's real, nothing that\n                     happens to me is real anymore-- \n\n                             ELIZABETH \n                     What has happened to you, Sky? \n\n                             SCHUYLER \n                     I need your help, you're the only \n                     one left, the only one I can trust--\n                     not that I deserve your help, God \n                     how could you have even married me,\n                     I was a shit to you-- \n\n                             ELIZABETH\n                     No you weren't-- \n\n                             SCHUYLER \n                     Yes I was.  Sometimes I think I'm\n                     being punished for my sins, I\n                     mean, there has to be a reason...\n\n                                                       CUT TO:\n\n     169.  I N T .   B R E A K F A S T   P L A C E  -  D A Y \n\n     ELIZABETH FLIPS THE PAGES of Schuyler's notebook-- page after page \n     of psychotic-looking scribbling, dense UNDERLINES, many EXCLAMATION \n     POINTS.  ON ONE PAGE-- \"CRUEL RANDOM SHIT.\" \n\n     WIDER-- a few BUSINESS PEOPLE read papers, pick at eggs; A LARGE-\n     SCREEN TV plays MORNING PROGRAMS.  Schuyler stares at Elizabeth,\n     awaiting reaction... she seems incapable of speech.  He puts the\n     tiny radio and earplug on the table between them. \n\n                             SCHUYLER \n                     This is one of their devices, I\n                     pulled it off their assassin in\n                     the subway.  It's how they \n                     communicate with each other. \n\n     Elizabeth picks the thing up, studies it, puts the plug to her ear. \n\n                             ELIZABETH\n                     It's... a radio... \n\n     Schuyler waves dismissively, \"you don't understand,\" takes the\n     radio back from her and pockets it. \n\n                             SCHUYLER \n                     I can't find the right channel...\n                     Listen, I may not make it through \n                     this-- if anything happens, get that\n                     notebook to, to, the press, or the\n                     FBI or something.  Someone you can \n                     trust, I don't know, assuming you can\n                     trust anyone.  I just want you to \n                     know I'm not crazy, and I didn't kill\n                     myself, no matter what they say-- \n\n     She stares at him, trying to be strong, but she's very freaked out.\n     A BARMAID brings their order.  Schuyler stares at the barmaid\n     suspiciously as she puts a cup of coffee before Elizabeth, and\n     gives him a bottle of water and a glass.  He tests the seal.\n\n                             SCHUYLER \n                     Has this been opened? \n\n                             BARMAID \n                     No sir.  Just like you said. \n\n     He watches her as she retreats, leans toward Elizabeth, puts his\n     hand on top of her cup. \n\n                             SCHUYLER \n                     I don't think coffee is safe. \n\n     Schuyler opens the bottle and drinks straight from it thirstily.\n     Elizabeth registers the CLINKING HANDCUFFS on his left wrist. \n\n                             ELIZABETH \n                     Schuyler, try and listen to me.  I\n                     love you, I always have, I always\n                     will.  And maybe this is... good.\n                     Maybe this a point you had to\n                     reach, before-- \n\n                             SCHUYLER \n                         (staring at her)\n                     Before what? \n\n                             ELIZABETH \n                     Before-- I'm just glad you came to\n                     me for help.  I don't know if I'm\n                     strong enough to, to handle this\n                     on my own but I know a lot of\n                     excellent crisis people-- \n\n                             SCHUYLER \n                     Crisis people.  Crisis people?\n\n     A CELL-PHONE RINGS in her purse, she makes an exasperated noise and\n     pulls it out, with a \"one sec\" gesture at Schuyler.  He rises \n     during her conversation, a new look on his face-- he can't trust\n     her either. \n\n                             ELIZABETH \n                     Hello?  Hi, hon, I'm OK... um,\n                     could I call you back...?\n\n     Schuyler's distracted by something on the TV... he lets out a\n     STRANGLED CRY.  Elizabeth turns her head to see. \n\n     ON TV SCREEN-- It's JIM FEINGOLD, clutching his head, rubbing his\n     temples with a look of pain.  CHEESY MUSIC, THROBBING SPFX. \n\n     SCHUYLER approaches the set, shouting at it. \n\n                             SCHUYLER \n                     You bastard!  You fucking bastard!\n                     How did you find me here!? \n\n     Elizabeth gets up, tries to pull him back to the booth, he pushes\n     her away, not taking his eyes from the set.  PATRONS react\n     nervously to the deranged man. \n\n                             FEINGOLD (ON TV, filter)\n                     Ooof-- my head is killing me! \n\n                             SCHUYLER\n                     Fuck you! \n\n     THE TV IMAGE WIDENS, a COMMERCIAL ACTRESS rubs Feingold's neck.\n\n                             SCHUYLER\n                     Who are you? \n\n                             ACTRESS (ON TV, filter)\n                     Honey, have you taken anything? \n\n                             FEINGOLD (ON TV, filter) \n                     Sure, some aspirin-- \n\n     The actress CLUCKS her tongue, shakes her head.\n\n     SCHUYLER's starting to get the picture.\n\n                             SCHUYLER\n                     He's an actor... \n\n                             ELIZABETH \n                     Of course he's an actor, it's a commercial. \n\n                             SCHUYLER \n                          (a revelation) \n                     He's just a fucking actor... \n\n     ON TV-- Feingold holds up a colorfully marked bottle of pills,\n     studies them with a shit-eating grin.  SOOTHING MUSIC.\n\n                             FEINGOLD (ON TV, filter)\n                     My head feels great!  Thanks to \n                     Ambutol, I'll never use aspirin again! \n\n     FEINGOLD gives way to the image of A BOX OF AMBUTOL. \n\n     SCHUYLER lets Elizabeth escort him back near the booth.  He's\n     completely absorbed in his own thoughts. \n\n                             ELIZABETH\n                     Have you taken something? \n\n                             SCHUYLER\n                     What? \n\n                             ELIZABETH\n                     Are you on drugs?\n\n     He shakes his head, waves his hand dismissively.  He's thinking\n     about something else.  Elizabeth starts dialing. \n\n                             ELIZABETH \n                     Schuyler, I'm calling a friend \n                     right now, I want you to wait here\n                     with me until-- \n\n     Schuyler tries to sound normal, claps her on the arm.  WHILE HE\n     TALKS, CAMERA FINDS Schuyler's other hand, which slips stealthily \n     into her PURSE, lying on the seat of the booth. \n\n                             SCHUYLER \n                     Elizabeth, please... I'm sorry, \n                     I'II be alright, it's just been a\n                     hard day... Listen, I gotta use\n                     the restroom, be right back-- \n\n     He moves quickly down a corridor marked RESTROOMS and EMERGENCY \n     EXIT.  She looks after him, quite puzzled, phone still to her ear. \n\n     170.  E X T .   R E S T A U R A N T   P A R K I N G   L O T  -  D A Y \n\n     Schuyler emerges from a back exit, looking behind him, the \n     EMERGENCY ALARM SOUNDING.  He twirls Elizabeth's car keys on his\n     finger as he jogs toward her sports car.  He unlocks it and the\n     ALARM SCREAMS for a moment before he figures out how to shut it\n     off, then he starts it and PEELS OUT. \n\n     SCENE 171-172 DELETED \n\n                                                       CUT TO:\n\n     173.  E X T .   C H I N A T O W N  -  D A Y \n\n     Elizabeth's car zips through traffic in a Chinatown neighborhood \n     full of festive restaurants and shops.\n\n     SCENE 174 DELETED\n\n     175.  E X T .   T U N G   H O Y  -  D A Y \n\n     Hanging red ducks in the window, a SIGN with a phone number in the \n     window:  \"TUNG HOY-- WE DELIVER\" in English and Chinese.  SCHUYLER\n     argues with an OLD CHINESE WOMAN behind the counter-- \n\n     175A(NEW).  I N T .   T U N G   H O Y  -  D A Y \n\n     A cramped, funky restaurant, rows of CELEBRITY HEAD SHOTS on a wall\n     behind the delivery counter.  SCHUYLER pursues the CHINESE WOMAN as\n     she serves bowls of noodles to a CHINESE FAMILY. \n\n                             SCHUYLER \n                     He's an actor, does TV \n                     commercials, I know he's ordered \n                     from you, he had food delivered to\n                     an office building on Mission-- \n\n                             CHINESE WOMAN \n                     Many customers, very busy, I don't\n                     know, I don't know--\n\n                             SCHUYLER \n                     Damn it! \n\n     Schuyler stalks away from her, finds himself facing the wall of \n     signed photographs--\n\n     ON WALL, old and stained pictures, the most famous being the likes\n     of ED McMAHON and CHARO.  Among them is a newer HEAD SHOT of \n     FEINGOLD with a shit-eating grin... below, the name WILLIAM FISHER. \n\n     SCHUYLER leaps on the counter and tears the photo off the wall-- \n\n                             CHINESE WOMAN \n                     Stop that, what you doing?! \n\n     Schuyler's already leapt off the counter, bolts out the door.\n\n     175B(NEW).  I N T .   E L I Z A B E T H ' S   C A R  -  D A Y\n\n     SCHUYLER is on the CARPHONE, glances from the road to-- \n\n     THE OBVERSE OF THE HEAD SHOT in his hand, a PHONE NUMBER before the \n     (short) list of credits, he flips it to show Feingold/Fisher. \n\n                             SCHUYLER (on phone) \n                     Yes, Mrs. Fisher, I know it's \n                     short notice but we were hoping \n                     your husband could come in for an\n                     audition today, he's perfect...\n\n     SCHUYLER looks annoyed at what he's hearing. \n\n                             SCHUYLER\n                     Isn't there any way we can get in\n                     touch with him now...?  I see... \n\n     He makes a quick U-TURN, the tires SCREECHING.\n\n     SCENES 176-179 DELETED\n\n     180.  E X T .   Z O O  -  D A Y \n\n     Late afternoon.  PAN FROM THE ENTRANCE to find SCHUYLER buying a \n     ticket and hurrying in. \n\n     181. IN THE ZOO, Schuyler prowls the crowd with manic energy. \n\n     SCHUYLER'S POV-- ZOO-GOERS gazing at the ANIMALS... CAMERA FINDS \n     Feingold/Fisher, wearing casual clothes, eating a popsicle.  He's\n     doing his best to supervise THREE OBNOXIOUS CHILDREN, two boys and\n     an older girl.  He's just another dad at the zoo, far from \n     impressive-- the Wizard of Oz after the curtain's been pulled. \n\n     When he makes eye contact with Schuyler, he pales, trying to herd\n     the children together as Schuyler moves in on him... he can't get \n     away.  Schuyler grabs the man's shirt. \n\n                             SCHUYLER \n                     Bill Fisher, hi!  I really admire\n                     your work... \n\n                             FEINGOLD \n                     Oh please... I got my kids here... \n\n     Schuyler releases him, Feingold sheepishly avoids his eyes.\n     Schuyler casually shows him the gun, the man's eyes widen. \n\n                             SCHUYLER\n                     Get rid of them. \n\n                             FEINGOLD \n                          (to the kids) \n                     Hey, everyone-- here's a twenty!\n                     Snack time!\n\n     He dangles the bill over their heads, the KIDS CHEER, leap like\n     dolphins after fish.  The girl's tallest, grabs the cash, they run\n     for a nearby concession.  Schuyler and Feingold stroll together. \n\n                             FEINGOLD \n                     Look, buddy, it was just a job-- \n                     nothing personal, y'know?  I play\n                     my part, improvise a little, \n                     that's what I'm good at, I still\n                     do a little stand-up-- \n\n                             SCHUYLER \n                     I've seen your resume.  I'm sick\n                     of foot soldiers, I've gotta get\n                     to whoever's in charge. \n\n                             FEINGOLD \n                     Of CRS?  Christ, nobody knows, nobody\n                     gets the big picture--\n                          (looking away) \n                     Jason, Tommy, cut it out! \n\n     FEINGOLD'S BOYS ARE THROWING ROCKS at the monkeys.  They give their\n     father a look and saunter along. \n\n     SCHUYLER's not interested in the zoo drama. \n\n                             FEINGOLD \n                     Goddammit, why do they do that. \n\n                             SCHUYLER \n                     How do I find them!?  Their\n                     offices were abandoned-- \n\n                             FEINGOLD \n                     They own the whole building, they\n                     just move from floor to floor. \n\n     Schuyler takes this in for a moment, thinking. \n\n                             SCHUYLER \n                     OK... They know you, you've worked for\n                     them.  You're going to get me inside. \n\n                             FEINGOLD \n                        (shaking his head) \n                     Uh-uh, I'm sorry and all, but-- \n\n                             SCHUYLER \n                     Tell them anything, tell them the cops\n                     are after you, you've gotta talk to\n                     someone or you'll blow the whistle. \n\n                             FEINGOLD \n                     No way, it's too dangerous.\n\n     Schuyler cocks his head, steps in front of him.  Right in his face:\n\n                             SCHUYLER \n                     You don't seem to understand.  Right\n                     here, right now-- I'm the danger. \n\n     Feingold gets the message. \n\n                                                  DISSOLVE TO:\n\n     182.  E X T .   C R S   B U I L D I N G  -  N I G H T \n\n     LIGHTS OFF in the building.  A battered STATION WAGON rounds a\n     corner, PAUSES before the ramp to the garage entrance-- the same\n     garage he and Christine were once tormented in. \n\n     183.  I N T .   S T A T I O N   W A G O N  -  N I G H T \n\n     FEINGOLD drives, looking very tense; a kiddie seat strapped next to\n     him, junk galore; he's apparently alone. \n\n                             FEINGOLD \n                     We're here, Sky.  They said they're on\n                     the twelfth floor. \n\n     BEHIND THE SEAT-- Schuyler crouches under a blanket. \n\n                             SCHUYLER\n                     Drive in, then. \n\n                             FEINGOLD \n                     Look-- what are you gonna do?  Really? \n\n                             SCHUYLER \n                     Really-- I don't know.  Improvise.  Go! \n\n     183A.  I N T .   C R S   G A R A G E  -  N I G H T \n\n     The station wagon stops at the bottom of the ramp.  A BEEFY GATE\n     GUARD behind glass glares at Feingold, who waves timidly.  The\n     STEEL GATE RISES and the station wagon drives in. \n\n     THE STATION WAGON parks near an elevator bank; a handful of CARS, a\n     few white CRS SECURITY VEHICLES and VANS parked nearby.  Feingold\n     climbs out, trying hard not to look scared.  ELEVATOR DOORS OPEN \n     and a beefy, frightening-looking SECURITY MAN in a suit steps out.\n     He looks around carefully as Feingold joins him.  He takes\n     Feingold's arm and pulls him toward the elevator.  They wait.\n\n     SCHUYLER'S POV from the back seat-- just as the DOORS OPEN, the\n     Gate Guard steps up behind Feingold, puts a gun in his back. \n\n                             GATE GUARD \n                     You're not authorized to be here. \n\n     HE FIRES-- Schuyler glimpses a SPRAY OF BLOOD, Feingold collapses.\n     The Security Man grabs the body as it falls, starts dragging it out\n     of sight while the Gate Guard puts a hand to his ear, talks into a\n     mini-transmitter in his other hand.  He follows the Security Man\n     out of sight.  The elevator doors remain open. \n\n     With the guards out of sight, Schuyler rises slowly.  He looks\n     stunned and sickened as he lets himself out cautiously, sneaking \n     behind vehicles.  The main gate is sealed, he has no idea how long\n     the guards will be gone.  THE OPEN ELEVATOR DOORS beckon. \n\n     Schuyler crawls on his belly the last few yards, starts, finding--\n\n     CLOSE, a RUBBER BUG on its back. \n\n     SCHUYLER creeps military style, on hands and knees, the rest of the \n     way to the elevator.  He puts a hand in some of Feingold's BLOOD,\n     winces, then gets in the elevator. \n\n     184.  I N T .   C R S   E L E V A T O R  -  N I G H T \n\n     SCHUYLER presses the button for 12-- the top floor. \n\n     ON PANEL-- nothing happens, the button LIGHTS for an instant but \n     GOES OUT again.  The elevator won't move.\n\n     SCHUYLER's getting exasperated. \n\n     ON PANEL-- he tries BUTTONS allover, same story. \n\n                             GATE GUARD\n                     Yo! \n\n     ANGLE INTO GARAGE-- the gate guard jogs TOWARD the elevators,\n     pulling his gun. \n\n     SCHUYLER starts to panic, pulls his own gun and POINTS IT AT THE\n     GUARD, who freezes and raises his hands.  Behind him, the Security\n     Man approaches Schuyler from a different angle, his gun out. \n\n     Schuyler can't get a bead on both of them. \n\n                             SECURITY MAN\n                     You're a dead man. \n\n     Schuyler looks one more time at the elevator panel-- \n\n     AT BASE OF PANEL, a gold keyhole.  CLOSER-- the letters CRS are\n     printed beneath it, very small. \n\n     SCHUYLER shakes his head-- it couldn't be; but what else can he do?\n\n     ANGLE INTO GARAGE-- the guards are fanning out and getting closer. \n\n     SCHUYLER reaches with one hand for his keys, fumbling for the small \n     gold key he received at the start of the game. \n\n     ON PANEL-- his hand shakes as he tries to insert the gold key... it\n     fits into the hole; he turns it and PUSHES THE BUTTON for 12. \n\n     WIDER-- as the DOORS CLOSE, both guards train their guns-- but too\n     late.  Schuyler's on his way up. \n\n     184A. THE GLASS ELEVATOR RISES through completely blackened spaces. \n\n     SCHUYLER stares at a BULLET HOLE in the back of the glass elevator,\n     a remnant of Feingold's murder.  He holds the gun in front of \n     himself in both hands... then he closes his eyes, steeling himself,\n     almost in an attitude of prayer. \n\n     185.  I N T .   A T R I U M  -  N I G H T \n\n     PITCH BLACK but for the LIT ELEVATOR ascending swiftly through the\n     darkness... Schuyler, like a solitary spaceship pilot, looks upward\n     toward his unknown destination. \n\n     186.  I N T .   C R S   E L E V A T O R  -  N I G H T \n\n     The DIGITAL READOUT slows as it comes to 10, 11 and STOPS at 12. \n\n     SCHUYLER comes out of his trance, slips the revolver back into his \n     jacket pocket, keeps a hand there, and stands against a wall of the\n     elevator as the DOORS OPEN ON-- \n\n     187.  I N T .   1 2 T H   F L O O R   C O M M I S S A R Y  -  N I G H T \n\n     --A BUSTLING, NOISY COMMISSARY.  Schuyler keeps the gun concealed\n     as he steps out of the elevator-- nobody here is paying any \n     attention to him anyway.  There's a cafeteria style counter along\n     one wall, people CHATTING and LAUGHING at Formica tables... amongst\n     others, everyone from his game appears to be here... there's the \n     RASTA, the PARAMEDICS with the HEART ATTACK VICTIM, JOHN and PETE\n     from the men's club, the GIRL from the boat, the DESK CLERK and \n     BELLHOP... also the HONDURAN TRUCK DRIVER, the SECURITY PEOPLE from\n     his house, the PUNK and the TRANSIT COP... and a lot of ENGINEERS. \n\n     SCHUYLER inches into the room, meets the eyes of-- \n\n     CHRISTINE, who's just come away from the cafeteria counter with a\n     tray of food.  She nearly drops it, looks over her shoulder to see\n     if anyone is watching.  Suddenly, Schuyler is in front of her, \n     backs her into an alcove-- she holds the tray between them as if to\n     protect herself.\n\n                             CHRISTINE \n                     What are you doing here? \n\n     For a moment, Schuyler's not sure.  His voice is flat, monotonal:\n\n                             SCHUYLER \n                     I'm back from the dead. \n\n                             CHRISTINE \n                     Listen, everything's OK, nobody \n                     touched your money, nobody stole a\n                     thing, that's impossible-- \n\n                             SCHUYLER \n                     I don't give a fuck about the money,\n                     I wanna know who's behind this, who \n                     did this to me, how, why-- \n\n                             CHRISTINE\n                     It's just a game! \n\n     Even though she's keeping a surface cool, he notices the GLASS and\n     SILVERWARE on her tray RATTLING.  She starts to move toward a\n     table, he blocks her path. \n\n                             SCHUYLER \n                     You're not going anywhere. \n                     Feingold, or or Fisher, was that\n                     just a game too? \n\n                             CHRISTINE \n                     What are you talking about?\n\n                             SCHUYLER \n                     I watched him die...\n\n     Schuyler shows her his BLOOD-STAINED HAND.  Christine looks utterly\n     perplexed, then shrugs, finding a place to put down her tray. \n\n                             SCHUYLER \n                     Seemed like a nice guy, actually,\n                     father of three-- \n\n                             CHRISTINE \n                     Well, look, I'm sure it's just\n                     another stunt-- that can't be \n                     real, taste it.\n\n                             SCHUYLER \n                     You taste it, you fucking vampire. \n\n     He pushes his palm in her face, she flinches, swipes him away, then\n     puts a finger to her ear as-- \n\n     THE ELEVATOR DOORS OPEN and the guard and security man from\n     downstairs burst into the commissary. \n\n     Suddenly the ROOM QUIETS, many others are touching their ears. \n\n     They all TURN in the direction of Schuyler and Christine.  The gate\n     guard gestures at Schuyler, attempting a smile. \n\n                             GATE GUARD \n                     Could you come with us, please? \n                     You're not authorized to be here. \n\n     Schuyler grabs Christine, wraps an arm around her throat, puts his\n     GUN to her neck. \n\n                             SCHUYLER\n                     Back off.  Everybody back off. \n\n     He uses his knee in the small of her back to push her brutally\n     toward the nearest door, she CHOKES and GASPS.\n\n     188.  I N T .   S T A I R W E L L  -  N I G H T \n\n     The door shuts behind them, the stairs only lead UP.\n\n                             SCHUYLER\n                     Shit, how do we get out-- \n\n     Christine STOMPS his foot and ELBOWS his gut, breaks free and bolts\n     up the stairs.  Schuyler catches his breath and pursues.  Beneath\n     him, the stairwell door opens, GUARDS PURSUE. \n\n     189.  E X T .   C R S   R O O F  -  N I G H T \n\n     A HIGH LEDGE surrounds the roof on all four sides, a ROOF ENTRANCE\n     at each side as well.  The NUMBER \"636\" is painted large for\n     helicopters; there are air conditioning vents, ducts, etc.  A\n     MUFFLED ALARM sounds as Christine bursts through the door, followed\n     by Schuyler.  She spins, her back to the EDGE of the atrium, a \n     black pit in the center of the roof with a sunken GLASS SKYLIGHT, a\n     white RAILING around it. \n\n     Schuyler SLAMS the door, a large number 1 painted on it in BLUE.\n     He throws the HEAVY BOLT.  He and Christine circle each other \n     warily, his gun trained on her.  POUNDING from the other side,\n     MUFFLED VOICES that can't be heard. \n\n     For the first time, Christine focuses on the gun in his hand, then\n     clutches the railing. \n\n                             CHRISTINE \n                     Wait a minute.  What's that? \n\n     Schuyler addresses her as if speaking to a child: \n\n                             SCHUYLER\n                     It's my gun...\n\n                             CHRISTINE \n                     We didn't give it to you?  Where did\n                     it come from? \n\n                             SCHUYLER\n                     A gun store. \n\n                             CHRISTINE \n                     We searched your house! \n\n                             SCHUYLER \n                     Guess you fucked up again. \n\n     Christine touches her ear, listening to something, then puts her\n     hand to her mouth, speaks urgently. \n\n                             CHRISTINE \n                     He's armed, he's got a real gun. \n                     Real Situation, real-- \n\n     Schuyler steps forward and violently wrenches the EAR PIECE and\n     HAND MIKE away from Christine, the wire tears her blouse open. \n\n                             SCHUYLER \n                     Yeah, it's real all right. \n\n                             CHRISTINE \n                     Schuyler this is all fake, tricks,\n                     it's all part of the game--\n\n                             SCHUYLER\n                     Stop it.  Every word out of your\n                     mouth is a lie-- \n\n     Christine's desperately panicked, fumbling for words. \n\n                             CHRISTINE \n                     The key!!  They, we gave you a key\n                     to the elevator!  Why would we do \n                     that?!  We wanted you to come up-- \n\n                             SCHUYLER \n                     Of course you did.  So you could kill \n                     me or, or frame me for murder--\n\n                             CHRISTINE\n                     No, no, it's THE GAME!!  Blanks, \n                     squibs, high-tech special effects,\n                     none of it's real!  Just open that\n                     door and I'll show you! \n\n     Schuyler hesitates a moment, looking in the direction of the door. \n\n                             SCHUYLER \n                     I open the door and I die. \n\n     ON THE DOOR-- POUNDING DESPERATE, but the ALARM DROWNS out the\n     sounds of VOICES on the other side. \n\n     SCHUYLER turns quickly as she takes a step towards him.  He points\n     the gun at her again.  He looks ready to use it.  The following\n     DIALOG overlaps and collides, growing AURAL CHAOS-- \n\n                             SCHUYLER \n                     You move again I swear I'll kill\n                     you, you bitch. \n\n                             CHRISTINE\n                     THINK ABOUT IT!!  They followed you\n                     every step of the way, the cab, in \n                     the trunk, we had a diver--\n\n                             SCHUYLER\n                     They?  We?\n\n                             CHRISTINE\n                     --the guy in Honduras, the cop on\n                     the train, there was always a\n                     safety net, always-- \n\n                             SCHUYLER\n                     Shut up, shut the fuck up!! \n\n     AXES DENT the metal door, which BULGES. \n\n     He looks at the monitor in his hand, the one he tore from her body,\n     putting it in his own ear, letting the rest of the device dangle. \n\n                             RADIO VOICE (filter)\n                     --just hang in there, keep talking\n                     him down, we're on our way-- \n\n                             CHRISTINE\n                     We've been trying to end it since\n                     you got back, our people came to\n                     your house, they tried to bring \n                     you in from the subway, you kept\n                     running, you weren't supposed to\n                     keep getting lost-- \n\n                             SCHUYLER \n                     You just said you wanted me to \n                     come here-- you're making this up\n                     as you go along! \n\n                             CHRISTINE\n                     Please Sky, please.  Take a breath\n                     and think about it! \n\n                             SCHUYLER\n                     Stop.  Fucking.  With my head! \n\n     Schuyler runs a hand over his sweating forehead, the gun TREMBLING\n     in his hand.  Christine's regaining control.  Schuyler's mind\n     whirls, he GROANS, almost crying as he considers for the first time\n     that she might be telling the truth.  She steps closer.\n\n                             CHRISTINE \n                     You're all right, it's OK, just relax... \n\n                             RADIO VOICE (filter) \n                     Are you there?  How's he doing?\n\n                             CHRISTINE\n                     Please... when you open the door, the \n                     game ends... just open the door... Bill\n                     Fisher's out there, he's fine, nobody\n                     got hurt.  Why would we do the crazy \n                     things we did, if it wasn't part of a\n                     game?  We thought you knew that... \n\n     He looks at her, almost ready to lower the gun.  He raises his\n     bloody hand to his lips, about to taste it. \n\n                             RADIO VOICE (filter) \n                     --we're at the North entrance, \n                     Number 2, just a few more seconds\n                     and we'll nail him-- \n\n     Schuyler's eyes dart toward--\n\n     ANOTHER DOORWAY, on the other side of the atrium, like the one\n     that's bolted.  The number 2 is painted on it in RED.  The handle\n     starts to TURN just as-- \n\n     --CHRISTINE LUNGES AT HIM to wrest the gun away. \n\n     SCHUYLER comes to his senses, struggling.  The GUN GOES OFF, the\n     report should be DEAFENING. \n\n     He spins, points the gun at Door #2 and FIRES again, several times.\n     THE ALARM STOPS-- SILENCE. \n\n     Christine STIFFENS, falls backwards onto the ground, clutching her\n     BLOOD-DRENCHED stomach.  Schuyler just stares.  Dark blood SPILLS \n     from her mouth as she CHOKES in pain...\n\n                             CHRISTINE\n                     Oh God.  I blew it... we blew it...\n\n     DOOR #2 OPENS and-- \n\n     DAVID steps through.  He wears a brightly colored, silly looking\n     PARTY HAT, carries a magnum of CHAMPAGNE bearing a huge BOW that\n     reads, \"SURPRISE.\"  BLOOD PUMPS from HIS CHEST.  He DROPS THE\n     BOTTLE, which SHATTERS... David collapses amidst the broken glass. \n\n     A BLOW OF THE AXE SEVERS the deadbolt and Door #1 flies open behind\n     Schuyler.  FEINGOLD is the first of a group to come charging \n     through, he wears a TUXEDO with a ROSE in the lapel, holds the axe.\n\n     SCHUYLER spins, points the gun at this axe-wielding man, then,\n     utterly stunned, lowers it in disbelief. \n\n     FEINGOLD looks from Schuyler to the wounded Christine-- her agony\n     is painful to watch.  He drops the axe with a CLATTER and runs to\n     her side, kneels.  His voice CRACKS. \n\n                             FEINGOLD \n                     You shot her!?  No!\n                       (looking toward David) \n                     Qh God no... \n\n     THE GUARD and SECURITY MAN come out on the roof looking very\n     disturbed, followed by the RASTA and a few OTHERS.  Many are\n     dressed for a party now.  Feingold looks to their horrified faces. \n\n                             FEINGOLD \n                     He fucking shot them!! \n\n                             RASTA \n                     I'll call an ambulance. \n\n     The Rasta dashes downstairs.  Schuyler backs away, drops the gun,\n     staggers over to David.  He's GASPING for breath.  CRS EMPLOYEES \n     give the brothers a wide berth, move toward Feingold and Christine.\n\n                             SCHUYLER \n                     David, David, no, no-- \n\n                             DAVID \n                     Oh God, Oh God, Sky, save me, I \n                     don't wanna die, I don't wanna-- \n\n                             SCHUYLER \n                     You're not gonna die.  I'm here,\n                     you're not gonna die... \n\n     David's already DEAD, eyes wide, body limp. \n\n     WITH FEINGOLD and CHRISTINE.  He holds his colorful cummerbund over \n     her stomach to staunch the bleeding.  She CHOKES in pain.\n\n                             FEINGOLD\n                     Hang on, just hang on, you're\n                     gonna make it-- \n\n                             CHRISTINE\n                     That stupid... \n\n     They stare over at Schuyler, registering David's death.  Schuyler\n     is now drenched in his brother's blood, rocking him in his arms.\n     Most of the assorted CRS people move to get out of the building\n     before the cops show, MURMURING amongst themselves in fear. \n\n                             FEINGOLD \n                     Oh God.  I thought you could \n                     handle it.  All the tests... they\n                     said you could handle it...\n\n     CHRISTINE yells at Schuyler, unable to stand-- \n\n                             CHRISTINE \n                     You fucking psycho, you piece of \n                     shit, how could you-- \n\n     SCHUYLER gently lowers his brother and rises, like a zombie now.\n     The big security man picks up his gun and backs away with it,\n     keeping it out of his reach. \n\n     Schuyler backs away from the body, starts to SHAKE, looks as if he\n     really has lost his mind.  Feingold SOBS aloud.\n\n                             FEINGOLD \n                     God, why-- there was no point.  It was\n                     supposed to be fun...\n\n     Schuyler looks back and forth from the wounded Christine-- who\n     GASPS silent curses, beyond speech-- to David's body...\n\n     He slowly turns to the Atrium pit directly in front of him.  He's\n     strangely calm...\n\n                             SCHUYLER\n                     Fun... \n\n     SHIFT TO SLOW MOTION: \n\n     SCHUYLER moves for the edge of the atrium pit...\n\n     THE OTHERS react in HORROR, SHOUT \"NO!!\", lunging TOWARD HIM...\n\n     DAVID'S HEAD suddenly MOVES, he BLINKS...\n\n     SCHUYLER leaps onto the safety barrier around the atrium pit.\n\n     CHRISTINE jumps to her feet, perfectly alert, a hand extended,\n     SCREAMING, just as-- \n\n     SCHUYLER CATAPULTS HIMSELF INTO SPACE, and--\n\n     DAVID SITS BOLT UPRIGHT. \n\n                             DAVID \n                     SKY, NOOOO!!\n\n     SCHUYLER sees this, too late-- \n\n     HE AND DAVID make terrified, helpless eye contact across the void, \n     arms outstretched.  Schuyler has time to register his irrevocable\n     error as he seems to hang suspended above the glass skylight for an\n     agonizing MOMENT. \n\n     THEN HE FALLS...  LEAVE SLOW MOTION.\n\n     190.  I N T .   A T R I U M  -  N I G H T \n\n     SCHUYLER CRASHES through the skylight, TUMBLING-- SPARKLING SHARDS \n     surround him like stars as he PLUNGES, SPINS, SCREAMING. \n\n     191. RAPID CUTS-- the CLOWN, CHRISTINE's face, SCHUYLER and DAVID\n     as CHILDREN, HIS FATHER's head striking the landing.  These FLASH\n     PAST so rapidly we can't quite process them. \n\n     192. INTERCUT WITH:  INCREASING DARKNESS, GROUND RUSHING CLOSER... \n\n     ON SCHUYLER'S FACE as he experiences the epiphany that comes before\n     the end.  BRILLIANT ANGELIC LIGHT suddenly illuminates him, his\n     eyes roll into his head, closing-- \n\n     ANGLE FROM ABOVE-- the LIGHTS are real, they've COME ON to show-- \n\n     SCHUYLER'S IMPACT-- he LANDS on his back, arms outstretched, eyes\n     squeezed shut-- \n\n     --and is swallowed by an ENORMOUS INFLATED LIFESAVING CUSHION that\n     covers the floor of the atrium. \n\n     SCHUYLER BOUNCES in the cushion a few times, gradually coming to a\n     rest, harmless bits of BREAKAWAY GLASS showering down around him. \n\n     He doesn't move a muscle, his eyes still closed. \n\n     CLOSER ON HIS FACE... muscles twitch.  His eyes open. \n\n     HIS POV-- UP the now illuminated tunnel formed by the walls of the \n     building around the atrium.  THE FULL MOON in the very center\n     through the hole in the glass. \n\n     All the lighted GLASS ELEVATORS COME TO EARTH, packed with people.\n\n     SCHUYLER stares upward, mouth open, motionless. \n\n     DAVID comes running from an elevator, leaps up onto the cushion and\n     bounces over to Schuyler, a huge smile on his face. \n\n                             DAVID \n                     Hey, bro, how you doin'? \n\n     Getting no response, David hops closer, squats by Schuyler's side. \n\n                             DAVID \n                     Admit it, you weren't bored...\n\n     SCHUYLER remains motionless, David's worried now, grabs his arm and\n     starts shaking him.\n\n                             DAVID \n                     Jesus.  Sky, c'mon Sky-- \n\n     SCHUYLER begins to LAUGH, a tremendous catharsis.  DAVID laughs\n     too, greatly relieved as he helps Schuyler to his feet. \n\n     THE TWO BROTHERS clutch each other for support on the BOUNCING \n     surface, LAUGHING.  CRS EMPLOYEES have gathered around the cushion,\n     CHEERING and APPLAUDING. \n\n     SCHUYLER wipes his eyes, shaking his head with amazement.  Then he\n     hauls back and SLUGS DAVID in the jaw, sending him flying onto his \n     back on the cushion.  MORE CHEERS from the crowd, as if they were\n     watching a boxing match. \n\n                                                       CUT TO:\n\n     193.  I N T .   C R S   L O B B Y  -  N I G H T \n\n     THE HALLELUJAH CHORUS from Handel's \"Messiah\" plays.  SCHUYLER and \n     DAVID enter together from the atrium, the CUSHION deflates behind\n     them.  David licks blood from his lips, rubs his jaw. \n\n                             DAVID \n                     You've been wanting to do that for\n                     a long, long time, haven't you? \n\n     Schuyler half-smiles.  The SECURITY MAN unlocks Schuyler's \n     handcuffs, giving him back his gun, which Schuyler stares at. \n\n                             DAVID \n                     Like they'd really leave a loaded gun\n                     lying around.  They went over the \n                     whole place with a metal detector, \n                     then packed that thing with blanks. \n\n     They turn a corner into the main lobby, Schuyler absently pockets\n     the gun, looks up in wonder...\n\n     SCHUYLER'S POV-- a SURPRISE PARTY:  A STEREO, STREAMERS and\n     BALLOONS, a CHAMPAGNE FOUNTAIN, CAKE and FOOD.  CRS EMPLOYEES\n     (mostly ordinary-looking office workers) CLAP and CHEER for\n     Schuyler.  They wear PARTY HATS, blow PLASTIC HORNS. \n\n     SMILING PEOPLE eager to offer CONGRATULATIONS surround him.  He's\n     pretty shaky, like a newborn calf.  JOHN and PETE shake his hand.\n\n                             JOHN \n                     Good one, buddy, really had you\n                     going, didn't we? \n\n                             PETE \n                     Wait'll you try level two...\n                             (a wink)\n                     Joke. \n\n     The RASTA SLAPS his back, Schuyler instinctively looks over his\n     shoulder for a gag message.\n\n                             RASTA \n                     That look on your face up there?\n                     Shit, man, I almost lost it. \n\n     The RECEPTIONIST POPS a bottle of Dom Perignon, hands it to Sky. \n\n                             RECEPTIONIST \n                     Awesome game-- best I've seen. \n\n     Not knowing what else to do, Schuyler takes a slug.  The GIRL from\n     the boat KISSES his cheek.  TECHNICIANS, men with STUNTS UNLIMITED\n     T-SHIRTS, the NURSE from the asylum, the SECURITY PEOPLE, CRS\n     GUARDS, AGENTS, all want a piece of him at once. \n\n     The \"MESSIAH\" FADES and an R & B BAND breaks into ROUSING MUSIC as\n     Feingold approaches and sticks a CIGAR in his mouth, LIGHTS it. \n\n                             FEINGOLD \n                     Sure glad you jumped, compadre. \n                     Otherwise I was supposed to throw\n                     you off. \n                           (whispering) \n                     It's not strictly legal, so don't \n                     tell anyone... \n                        (a beat, off Schuyler's look)\n                     The cigar.  It's a Monte Cristo,\n                     straight from Havana. \n\n     Christine approaches, wobbly and dazed herself; she touches his\n     arm.  Her voice is soft for the first time, accents gone. \n\n                             CHRISTINE \n                     Hey... you all right? \n\n                             SCHUYLER \n                          (nods slowly)\n                     I think so.  You? \n\n                             CHRISTINE \n                     Little shook.  I'm pretty much a\n                     method actress, y'know? \n\n                             SCHUYLER \n                     What's your name? \n\n                             CHRISTINE \n                     Susan.  Susan Waters. \n\n                             SCHUYLER \n                     Nice to meet you, Susan...\n\n                             CHRISTINE \n                     Can I have a puff? \n\n     He gives her a DRAG on his cigar.\n\n                             SCHUYLER \n                     Look, I have to know.  Who's\n                     really in charge? \n\n     She shrugs, blows a SMOKE RING and sticks her finger through it.\n\n                             CHRISTINE\n                     God?\n\n     She winks and strolls off.  Schuyler smiles, looking after her. \n\n     DANCING is starting up IN BG.  A clutch of non-CRS people approach\n     tentatively-- including PLYMPTON, ELIZABETH, MARIA and JACK.  They\n     all look very confused. \n\n                             PLYMPTON \n                     What is this, Sky?  We got a call\n                     from your brother, said there was\n                     a surprise party...\n\n                             ELIZABETH \n                     Kind of late for your birthday,\n                     isn't it? \n\n     Schuyler LAUGHS, gives her a hug, surprising her.  He still has a\n     giddy smile plastered on his face. \n\n                             ELIZABETH \n                     If you wanted to borrow my car,\n                     you could've just asked-- \n\n                             SCHUYLER \n                     I know, Liz, I've been an idiot,\n                     and I'm sorry...\n\n                             PLYMPTON\n                     You OK? \n\n                             SCHUYLER \n                     Yeah-- I'm good, really.  Happy to \n                     be alive... Listen, it's great to \n                     see all of you, thanks for coming--\n                     but there's something I have to do.\n                     Excuse me. \n\n     He moves away quickly.\n\n     SCENES 194-197 DELETED \n\n     198(NEW).  I N T .   M E N ' S   R O O M  -  N I G H T \n\n     SCHUYLER FLUSHES and moves away from a urinal.  David waits a few\n     feet away by the sinks and mirrors; Schuyler starts slightly. \n\n                             DAVID \n                     So what's the object of the game? \n\n                             SCHUYLER\n                             (a beat)\n                     What game? \n\n                             DAVID\n                     Very good... \n\n                             SCHUYLER \n                       (rinsing his hands) \n                     Is it always like this? \n\n                             DAVID \n                     Mine was a little weirder.  Tell\n                     you about it sometime. \n\n     David pulls out A COLORED ENVELOPE, slips it into Schuyler's shirt.\n     Schuyler looks at him curiously as he dries his hands. \n\n                             DAVID \n                     The bill.  It's itemized.  Don't\n                     bother opening it now...\n\n                             SCHUYLER \n                           (opening it) \n                     I thought it was a gift. \n\n                             DAVID \n                     Well, no, the card was the gift,\n                     the rest was up to you. \n\n     CAMERA FOLLOWS as David hurries out of the rest room, Schuyler\n     behind him, flipping pages of a long, long bill--\n\n     199(NEW).  I N T .   C R S   L O B B Y  -  N I G H T \n\n     --we rejoin the PARTY, which is now in full swing.  Schuyler stands\n     alone at the periphery of the dance floor with the bill.  He hits\n     the bottom line... he blinks and GASPS. \n\n     CHRISTINE appears, taking his hand and pulling him away. \n\n                             SCHUYLER \n                     What?  Where are we going? \n\n                             CHRISTINE\n                     Does it matter? \n\n     They move into a stairwell and start climbing O. S., their hands\n     all over each other.  We hear the MUSIC and FESTIVITIES continuing\n     in BG. \n\n     CAMERA HOLDS for a beat on a SIGN painted on the wall with an arrow\n     upward:  \"LEVEL 2...\" \n\n                                                  CUT TO BLACK\n\n\n\n\n\n\n\n   \n\n\n\n\n\n\n\nGame, The\nWriters :   John Brancato  Michael Ferris  Larry Gross  Andrew Kevin Walker\nGenres :   Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:42.143650"}