{"title": "Gangs of New York", "film_link": "/Movie Scripts/Gangs of New York Script.html", "script_link": "/scripts/Gangs-of-New-York.html", "info_raw": "\n\nGangs of New York Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Jay Cocks  Steven Zaillian  Kenneth Lonergan\nGenres  Crime  Drama\nScript Date : February 2002\n\nRead \"Gangs of New York\" Script\n\n\n", "script": "\nGangs of New York \n\n\n\n\tGangs of New York \n      by Jay Cocks, Steven Zaillian, Kenneth Lonergan.\n      3rd Draft (1993).\n      More info about this movie on imdb.com\nINT. ROOM OLD BREWERY DAY \n\nHalf in shadow, a man named VALLON, dressed in black, fastens a clean\nwhite clerical collar around his thick neck. He raises a jagged razor to\nhis face, RAKES it across his right cheek, drawing BLOOD. He does not\nflinch.\nThe sharp SCRAPING of the jagged blade against skin is the first SOUND we\nhear.\nVALLON cuts himself similarly on the left cheek, then hands the razor\nceremoniously to a BOY standing beside him. The boy, no more than twelve\nyears old, looks at VALLON worshipfully, keen eyes shining with fear and\nexcitement. He starts to wipe the razor blade on the bottom of his jacket.\n\nVALLON\nNo. Never. The blood stays on the blade, son.\n\nHe hands the boy a dark red velvet pouch. Very carefully, the boy, known\nas AMSTERDAM, wraps the razor up, hands it back to his father.\nFrom the shadows, VALLON now raises a long pole with a beautiful golden\ncrucifix mounted on the end, then holds his free hand out to his son.\nAmsterdam squeezes tight.\nVALLON nods toward the door. Amsterdam pulls it open. Outside is a dim\nhallway. We hear SOUNDS that might be animal or human.\nMUSIC begins: a steady, driving cadence somewhere between a march and a\nhymn.\n\nCUT TO\n\n2 INT. HALLWAY\n\nVALLON strides in long measured steps. Amsterdam has trouble keeping up\nwith him.\nThey are walking down a long corridor that's like a tunnel. Patches of\nLIGHT stain the darkness. Sometimes Amsterdam glimpses a FACE peering out\nfrom the gloom. Once or twice he almost stumbles over a BODY stretched\nacross his path.\n\nCUT TO\n\n3 INT. ROOM\n\nAnother room, even smaller. The only decoration is a bizarre rendering of\na Madonna and child painted on the wall.\nA beefy man picks up a home-made PIKE, its iron tip sharpened to a lethal\npoint. He is smiling. The grin is huge, but cockeyed. It occupies only\nhalf of his face. The grotesque, unending grin is the result of facial\nparalysis, and has given him a nickname: HAPPY JACK MULRANEY.\nJack lifts the pike carefully, then takes a candle from the wall and bends\ndown over a wooden cage full of rabbits. He slowly moves the candle back\nand forth across the cage top. Wax falls on the cage, splattering an\nunlucky rabbit.\nJack thrusts the pike between the wooden bars, impaling the rabbit's body.\nHe pulls the pike from the cage and leaves.\n\nCUT TO\n\n4 INT. HALLWAY\n\nJack falls into step beside VALLON and Amsterdam. He holds the pike with\nthe dead rabbit high, next to VALLON's cross.\n\nHAPPY JACK\nDid you bring the boy for a charm, Priest?\n\nVALLON\nNo, Jack. For a baptism.\n\nNow a WOMAN joins them. She's dressed in man's clothes, her pants held up\nby suspenders. She wears a set of IRON CLAWS.\nMUSIC builds, growing more insistent and more ominous.\nNow a figure looms before them. Over his street clothes, this WARRIOR\nwears a rig of home-made armor made from fracgments of steel, lengths of\nchain and bits of leather. He carries a battle-axe as lightly as if it\nwere a twig.\n\nRABBIT WARRIOR\nWe'll send a few across the river today, Priest.\n\nHe joins the procession. Another woman, as tough as the first and half\nagain as large, and several more men, all armed with implements of\ndestruction, fall in beside him. Their faces are marked with blood, like\nVallan's, or covered with ritual markings made with paint and ink.\nThe group grows ever larger and more forbidding. occasionally PEOPLE dart\naround them in the tunnel and scamper out of their way like animals\nfrightened in a burrow.\n\nCUT TO\n\n5 INT. ROOM\n\nVast and dank, like a cavern. We start CLOSE on...\n... the body of a dead rat being filled with some pieces of lead.\nThen a little WIDER to reveal: an eager boy, SHANG DRAPER, about the same\nage as Amsterdam. He drops the last few pieces of lead into the mouth of\nthe rat, then sews it closed. He hefts the animal by the tail, swinging it\nas he stands up.\nHe is near a primitive forge where a half-drunk SLACKSMITH hammers crude\nweapons into shape and distributes them to OTHER MEN and WOMEN. The floor\nis covered with bits of lead and steel, which Shang has been using to sew\ninto his rat.\nShang FOLLOWS the crowd of men and women with their weapons. And now we\nsee this room full. It is huge: the main room of the Old Brewery, crowded\nwith families huddled together for warmth and comfort, or out of fear; men\nand women, together or separately, drunk or passed out. They are like zoo\nanimals in a pit. There are sticks of furniture jammed in corners, or,\nmore often, arranged at angles in the middle of the room to form tiny\nenclaves where the ancient brewery machinery forms irregular boundaries.\nAbove Shang's head, VALLON and his gang walk across a plank bridge that\nspans the room a hundred feet beneath them. Armed men and women from the\nBrewery are climbing a rope ladder to join them. Shang SCURRIES up after\nthem.\nThe men and women from the Brewery fall in behind VALLON and the others in\nthe lead. Shang SPOTS someone near his own age toward the front:\nAmsterdam. He presses through the crowd like a hunting dog.\n\nSHANG\nWhat's the fight?\n\nAMSTERDAM\nThe Dead Rabbits against the Native Americans, same as ever. But it'll all\nbe settled today.\n\nSHANG\nAre you Native or Rabbit?\n\nAMSTERDAM\n(points to rabbit on pike)\nWhat do you think?\n\nSHANG\nLooks alright. I'll stand by you, then.\n\nCUT TO\n\n6 INT. HALLWAY\n\nThe group now turns down the last corridor, as dim and long as a tunnel.\nIn the distance, there's a faint glimmer of light and the figure of a MAN\n(MONK EASTMAN). VALLON stops near the door.\n\nVALLON\n\nI don't know you.\n\nMAN\n(lightly)\nI suppose there's to be a fight.\n\nVALLON catches the heavy Celtic inflection in the man's voice.\n\nVALLON\nDerry?\n\nMAN\nDonnegal. Name's Monk Eastman.\n\nVALLON\nAnd you want to fight, Mr. Eastman?\n\nMONK\nlf there's money in it.\n\nVALLON\nFight for the Natives. They have a proper war chest.\n\nMONK\nWell, I might at that. But I thought I'd ask you first, seeing as how I'm\nnot quite a Native American myself.\n\nVALLON\nLet's see your skills, and we'll talk of payment later.\n\nMONK\nFine. But if you like what you see, pay me double.\nMonk turns to the door with the grace of a dancer and delivers a\nSHATTERING kick, sending it flying off its hinges. Clear white LIGHT\nstreams in, and we see Monk Eastman plain for the first time: a huge man,\nin stature and girth, wearing a small DERBY that intentionally makes his\nhead look even bigger.\n\nVALLON\n(as the door splinters settle)\nStand with us then.\n\nCUT TO\n\n7 EXT. STREET DAY (WINTER)\n\nWINTER WIND blows across a scene as strange and bleak as an alien planet.\nVALLON, carrying his cross high, steps through the doorway. The OTHERS\nslowly follow VALLON out of the building, which is three stories high and\nmaybe a block long. A dilapidated sign identifies it as the 5 Paints\nBrewery.\nIt is the tallest structure in the midst of low, squalid SHACKS, winding\nALLEYS as narrow as a snakels back, and DIRT STREETS filled with ruts, mud\nand filthy snow. A few PIGS wander forlornly about, rooting for garbage.\nWASH hangs stiff, in the middle of the square, from a peculiar monument\nerected to some forgotten war hero.\nThe Brewery occupies one side of a SQUARE surrounded by some storefronts\nand a couple of collapsed wooden sidewalks. If this place resembles\nanything at all, it's a horrible hybrid of London's Limehouse and a\npioneer town in the American West whose best days have long passed--or\nnever came at all.\nVALLON stands still, staring across the square past the monument. His\nbattalion of irregulars waits for his signal.\nNow... very, very slowly...from around both sides of the monument comes\nANOTHER GANG, in size the same as VALLON's, men and women both, armed like\nVisigoths with HOMEMADE WEAPONS: knives, pitchforks, building blocks and\nbricks, boards with sharp nails protruding from the ends. Every member of\nthis second group is dressed in a long DUSTER which reaches to the ankles.\nSeveral MEN in front of the group sport dusters made of leather.\n\nVALLON\nBill Poole! on whose challenge are we assembled?\nA MAN in a leather duster (BILL THE BUTCHER) steps forward. He is young,\nlean and fierce. And then there are his eyes. They do not match. One is\nreal. The other is a huge, bulging PEARL upon which has been engraved,\ninstead of a pupil, a full-color portrait of the AMERICAN EAGLE.\n\nOn the side of the square, arranged to get a good view of the impending\ncombat, is a group of STREET KIDS, girls and boys, none older than eight.\nThey talk and laugh excitedly among themselves, picking their own\nfavorites among the gangs as if the warriors were players on a team.\n\nBILL THE BUTCHER\nOn the challenge of the Native Americans, to settle for good and all who\nholds sway.\n\nVALLON\nBene.\n\nBILL THE BUTCHER\nBy the ancient laws of combat, we offer our bodies to the ghosts of those\nwarriors who have gone before us. Valor is avid for glory, and glory is in\nour wounds.\n\nVALLON\nBut this time can you bear to look on the glory when it comes, Bill? Can\nyou see it clear with your single eye?\n\nBILL THE BUTCHER\nWhoever fights untouched in battle has skill, but the warrior who returns\nwounded has been touched by God.\n\nVALLON\nIt wasn't God who touched your eye.\n\nBILL THE BUTCHER\nIt was God gave me guidance. Will you be able to look on the death blow\nlike a gladiator, and not look away? No honorable man turns an eye from\nhis death.\n\nVALLON\nI don't expect a death blow from your hand, Butcher. Let's have at it.\n\nBILL THE BUTCHER\nThere is another matter.\n\nVALLON\nSay it out and quick, before spring gets here.\n\nBILL THE BUTCHER\nNo Native American Warrior will dishonor himself with the blood of the\nhalt and maimed.\n\nVALLON\nSo?\n\nBILL THE BUTCHER\nSo we would like to know whether Squire Jack Mulraney of the Dead Rabbits\ncan smile out of both sides of his face.\n\nA pause of a single second. Then HAPPY JACK takes the dead rabbit off the\ntip of his pike and hurls it across the square. It lands right at BILL THE\nBUTCHER's feet.\nIn a flash, BILL THE BUTCHER opens his coat. Inside, on a special belt he\ncarries a CLEAVER, a CARVING KNIFE and other instruments of the butcherls\ntrade, all stained with blood and gristle. Now the MAN standing next to\nhim removes the broad BELT from around his coat. The brass buckle is\nsharpened to a point, the leather studded with glass.\nThe gallery of Street Kids tenses for action: they are thrilled.\n\nVALLON reaches up to the CROSS, pulls off the top piece, to disclose,\nunderneath, a gleaming sword point. He folds the arms of the cross down,\nlike the blades of a jackknife.\n\nVALLON\nPrepare to receive the Lord.\n\nAnd the air is full of screams and battle cries as the two gangs hurl\nacross Paradise Square into BATTLE.\nVALLON draws first blood. He impales a Native American on the sword end of\nhis cross and turns to fight again.\nAmsterdam and Shang exchange a glance of frightened, worried wonder.\n\nThen a Native American rushes at them, shouting for blood. The boys act\ntogether. Amsterdam dives down in front of the man, sending him sprawling.\nShang BLUDGEONS the fallen warrior, using his lead-filled rat like a\nblackjack as Amsterdam kicks him savagely; the Native collapses\nunconscicus at their feet. Before the boys can thank one another, however,\nthey are separaten by the SURGING GANGS all around them.\nBILL THE BUTCHER leaves his meat CLEAVER imbedded in the middle of a man's\nskull, then WADES through the combat as if shielded by a charm.\nThe gallery of Street Kids is thrilled by this display and reacts with\nCHEERS.\n\nVALLON BATTLES three Natives who come at him at once.\n\nMonk Eastman grabs a Native in his arms like a groom hugging a bride. He\nraises his knee and brings the man crashing down across it, BREAKING his\nspine like a Thanksgiving wishbone.\nThe gallery of Street Kids is awed by this display of power from a new\nstar in the making.\n\nThe Rabbit Warrior in the home-made armor grins at an intrepid Native and\nlowers his battle-axe. The Native rushes as the\nRabbit Warrior swings and SEPARATES the man from his legs.\n\nA NATIVE WOMAN lowers her head and charges her Dead Rabbit adversary,\ndelivering a shattering BUTT to his stomach.\n\nA NATIVE BOY holds a rusty old pistol, which he uses at pointblank range\nagainst several Rabbits.\n\nA RABBIT WOMAN flies into a Native, using her IRON FINGER EXTENSIONS to\nGOUGE his face.\n\nThe NATIVE with the deadly belt uses it to TEAR a piece out of a Rabbit's\nface.\n\nAmsterdam, beginning now to be overwhelmed by the hellish fight, looks\naround in growing PANIC for his father.\n\nSHANG uses his lead-rat blackjack to clear an escape back toward the\nBrewery. The Street Kids can tell he's trying to escape, and start BOOING\nhim...\n... as Shang's GRABBED from behind and pulled off his feet by a PEG-LEGGED\nNATIVE. He THROWS the boy to the ground and pins him by holding the\nsword-sharp point of his wooden leg against Shang's throat.\n\nSHANG\n(desperate)\nI run with you! I'm one of you! Born a Native American from the blood of\nfive generations!\n\nPEG-LEG\nYeah? Then you oughta be a red Indian.\n\nHe pushes down. Shang starts to bleed. But now PEG LEG is distracted by\nthe sudden SOUND of bells and whistles. He watches the BOY trembling on\nthe ground, then moves off him, making for the sound of the bell, leaving\nthe BOY quaking.\nThe SOUND grows louder as TWO HORSE-DRAWN CARTS full of battle ready\nPOLICE tear around the curve of a narrow thoroughfare and stop in Paradise\nSquare.\nThe BELLS on the carts toll loudly and work magic. The fighting stops.\n\nThe POLICE, all carrying clubs and wearing leather helmets, LEAP OFF the\nwagons.\n\nThere are several moments of ABSOLUTE SILENCE, broken only by the SOUND of\nthe wind and the GROANS of the wounded.\nThen, as one, the Dead Rabbits and the Native Americans RUSH the police\ntogether, hurtling stones and brandishing weapons. Even the Street Kids\nget into the act, kicking and biting and generally having a fine time.\nThe gangs SWARM all over the police, driving them back. Some lucky cops\nclimb back on the wagons and try to get away. The unlucky police remain\nbehind, dead on the ground.\nThe GANGS cheer, jeer and continue to throw things at the retreating\nPOLICE. When the second wagon disappears from view, the GANGS confront\neach other once again.\nAnother brief moment of QUIET. The Street Kids settle back into their\nspectator role. Then the GANGS go at each other with fresh intensity.\nAmsterdam finally SEES his father and starts to PUSH his way toward him.\nVALLON and BILL THE BUTCHER stand facing each other in the midst of battle\nlike two titans: then they rush at each other, joining with a terrible\nfury.\nShang, still blindly SWINGING his blackjack, makes his way closer to the\nrelative safety of the Brewery, his face stained with tears of fear. He\nhits someone. The MAN turns, swats him down. Shang sprawls on the street,\nwhich is a SWAMP of mud and blood and dirty snow, and finds himself face\nto face with a departed PEG LEG. Someone has removed his artificial limb\nand driven it through his heart.\nAcross the square, Amsterdam has reached his father in time to see a\nNATIVE AMERICAN sneaking up behind him. Amsterdam grabs a long TRUNCHEON\nfrom a fallen warrior and uses it to hit the man a strong blow behind the\nknees.\nThe MAN falls, howling. AMSTERDAM HITS him again. And again. He is\nhysterical.\n\nVALLON and BILL THE BUTCHER keep fighting. Amsterdam sees, with a single\nlook, that his father is in the fight of his life. He looks for a weapon\nto help...\n... sees a HATCHET lying by the body of the Rabbit he has just beaten\nsenseless. He grabs it and runs forward, looking for an opening between\nthe Butcher and his father...\nAs the two combatants move, Amsterdam MOVES. Bobbing, weaving, feinting,\nfalling back... looking for his chance...\n... as Bill deals VALLON a blow that ROCKS him back and throws him off\nbalance...\n\n...just as Amsterdam has made his move. He RUSHES forward, sees his father\nFALLING, tries to turn but...\n\n... too late. The boy's hatchet SLASHES his father in the leg. VALLON\nfalls to one knee, gestures frantically to the stunned Amsterdam to get\naway...\n... and Bill is upon VALLON, SINKING his knife into his chest. VALLON\nscreams and falls on his back, Bill kneeling over him. He looks into his\nenemy's eyes ... and VALLON's EYES LOCK ON HIS. For all his suffering,\nVALLON's eyes HOLD Bill ... he forces himself to look at Bill...it's a\nterrible struggle... but VALLON will not look away.\nAmsterdam, hysterical, RUSHES at the Butcher. The Butcher grabs Amsterdam\nby the arm, making him drop his hatchet.\n\nBILL THE BUTCHER\nYou need a weapon? Use a knife.\nHe puts the struggling boy's hand on the hilt of the knife that the\nButcher sunk into his father's chest.\n\nBILL THE BUTCHER\nIt makes a deeper cut.\nAnd, HIS HAND GUIDING THE BOY'S, he RAMS his knife deep into VALLON's\nheart.\n\nBILL THE BUTCHER\nSay a benediction, Priest.\n\nVALLON bellows in agony. Amsterdam screams at the very same moment, his\ncry mingling with his fatherls tearing through the air.\n\nBILL THE BUTCHER\n(to Amsterdam)\nHold this close to mind, boy, should you ever think of going up against\nthe Native Americans.\nBill the Butcher rises and all around him, as if on some mysterious\nsignal, the fighting subsides. A DEAD RABBIT sees the fallen Vallon, takes\na battered brass HORN from his belt and sounds THREE NOTES, quick and\nsharp. As the notes fade away, the fighting stops completely.\n\nBILL THE BUTCHER\n(announcing)\nEars and noses will be trophies of the day.\n\nThe Rabbits SCAMPER to collect their dead and wounded before the Natives\ncan get to them to slice off the battle souvenirs. But there are many\ncorpses maimed. The Street Kids DISPERSE. The main battle is over, and the\nNatives have clearly carried the day.\nThe Rabbits file past Vallon, rorming a protective CIRCLE around him.\nAmsterdam kneels at his side. Vallon tries to speak. Blood bubbles in his\nthroat.\n\nVALLON\nCan't..can't cross the river... with steel through my heart.\nAmsterdam looks around. None of the Rabbits makes a move. This is clearly\nsomething he is meant to do himself.\nAmsterdam grabs the tortoise handle of the knife, PULLS on it. Vallon\ntries not to cry out. The knife does not move.\nAmsterdam tries again. He can't budge the knife. Vallon MOANS. Nearly\nwild, Amsterdam PULLS with all his strength. Vallon SCREAMS in agony.\nAmsterdam is pulling so hard he raises his father's back four inches off\nthe ground. Still the knife will not move. Vallon passes out from the pain.\nNow, finally, someone steps forward: Monk Eastman. He leans over but\nAmsterdam, berserk with grief, pushes him away, turns back to his father,\nand, with a last desperate pull, DRAWS the knife from his father's heart.\nHe throws it on the ground. Monk picks it up, wipes the blade on his arm,\ncloses the knife and hands it to Amsterdam.\n\nMONK\nThat's yours, rightfully.\nNow Monk leans over the lifeless body and reaches inside Vallon's coat,\nREMOVING some money.\n\nMONK\nAnd this is mine. Only what's owed. Use the rest for funeral.\n\nAMSTERDAM\nNo!\nHe tries to shove Monk away from his father, when the Native Warrior\nintervenes.\n\nHAPPY JACK\nIt's fair.\n\nAmsterdam, wild with shock and grief, turns back to his father as Monk\ntakes what's owed him. Amsterdam bends over to KISS Vallon on both cheeks,\nthen on his left eye.\nThe boy is just about to kiss his fatheros closed right eye when the lid\nsprings OPEN - Amsterdam jumps back despite himself. Vallon stares at him:\na last moment of recognition.\nVALLON\nHon ...\nAMSTERDAM\nNo, Pa!\n\nVALLON\n... honor me... think of me ... don't never look away.\nVallon convulses and DIES. Amsterdam shakes him to revive him.\n\nRABBIT WOMAN\nTake the body. Bring the boy.\nSeveral RABBITS take a step or two forward, but Amsterdam springs up at\nthem, like an animal.\n\nRABBIT WARRIOR\nCome an, lad. Therels nothing to be done now.\n\nAMSTERDAM\nGet away! Get away!\n\nHAPPY JACK\nLeave him be. He's his to mourn.\n\nAnd the RABBITS turn away, going back to the Old Brewery or vanishing down\nthe narrow streets.\nNow a few CITIZENS venture out into Paradise square. A couple of\nSCAVENGERS scoot about, looting bodies.\nAmsterdam stays in the center of the square unmoving, undisturbed, keeping\nsolitary vigil over his father.\n\nA TITLE is superimposed across this scene:\n\nNEW YORK CITY 1844\n\n8 EXT. HARBOR DAY WINTER (MATTE)\n\nThe same afternoon. As the sun goes down, we have our first full look\n(MATTE) at the low pale outlines of the city.\nThe harbor is crowded with the high masts of sailing ships. Just north of\nthe island tip is the steeple of the city's tallest structure, Trinity\nChurch. The buildings of Wall Street are masses of concrete and wood, the\nstreets surrounding them paved with cobblestones. Just above the financial\ndistrict are the sloping buildings and rutted avenue of the Five Points .\nThe Old Brewery stands tall and forbidding over Paradise Square.\nAbove the Five Points, in the distance, we can glimpse some finer, newer\nbuildings. One wide street--Broadway--seems to run from the very tip of\nthe island clear up into the woods just a few miles north of the harbor.\nThe only SOUNDS are the lapping of the harbor water against the boats, the\ncreaking of masts in the winter WIND.\n\nCUT TO\n\n9 EXT. HARBOR DAY\n\nA closer view - The TITLE fades off. We see an imposing edifice on the\nedge of the harbor with a wooden sign identifying: \"IMMIGRATION\nDEPARTMENT, UNITED STATES OF AMERICA.\"\nThe sun has nearly set. A boy--about 10 years old--sits on the edge of the\nCastle Garden dock, gazing down at the frozen Hudson. He can just about\nmake out his reflection in the dull sheen of the ice. His name is JOHNNY\nSIROCCO, and he watches himself with bewildered seriousness.\nAbruptly, he reaches down and SMASHES through the ice with his fist. In\nSLOW MOTION, we watch the ice fragments drift apart in the river current,\neach bearing away a REFLECTION of Johnnyls face, like pieces of a puzzle.\n\nPOLICEMAN\nWhere's your family, sonny?\n\nJohnny sees a POLICEMAN scrutinizing him.\n\nJOHNNY\n(lilting brogue)\nMy mother's just there.\n\nHe gestures toward a ship, where MEN are unloading cargo. In a hoist, they\nare lowering a thin pine COFFIN to dockside.\n\nJOHNNY\nOn the trip, her insides all broke up. She wasn't dead and there was three\nothers fighting for her bed.\n\nPOLICEMAN\nAnd your father? Where's he, then?\n\nJOHNNY\nI never knew him.\n\nPOLICEMAN\n(taking Johnny's hand)\n\nWe better see to you, then.\n\nCUT TO\n\n10 EXT. STREET NIGHT\n\nThe Policeman leads an awed Johnny through the TEEMING streets of the Five\nPoints.\n\nPOLICEMAN\nWhere all those streets come together right ahead is the true Five Points.\nBut most speak of the Five Points and mean anywhere between the Battery\nand the Bowery.\nAlthough the night's cold, the streets are jammed. WHORES painted like\ncarnival Gypsies sell themselves to any man sober enough to stand up.\nSOUNDS of laughter and combat filter out from garish SALOONS like the\nLittle Naples, the Hell Hole, the Egyptian Hall.\nIn the midst of all this highlife are BEGGARS and the SICKLY, looking for\ncharity, scrounging garbage in the street. An INDIGENT battles a CRIPPLE\nfor a meager scrap of faod. A richly dressed WOMAN, riding by in a\ncarriage, hides her eyes by raising a HUGE BOUQUET OF FLOWERS in front of\nher face.\n\nPOLICEMAN\nStreets hereabouts are lively of an evening. The city comes here to sport.\nBut there's places to put up a boy on his own.\n\nThree WOMEN, exquisitely costed, burst from the door of the Egyptian Hall.\nUnder the harsh glare of a nearby gas lamp, their faces are no longer\nstriking. Johnny STARES; there is something not right about these faces.\n\nJOHNNY\nAnd those? What are those?\n\nPOLICEMAN\nWell, those. Those are, as you might say, a sort of...\n\nWe SEE one of the women's faces, suddenly harsh under gaslight: under\nthickly caked make-up is a smiling TRANSVESTITE.\n\nPOLICEMAN\n... sort of whatnot.\n\nTRANSVESTITE\nSay, policeman. I'll buy your bonny friend.\n\nThe Policeman fetches the Transvestite a strong WHACK with his nightstick.\nThe Transvestite screams and falls ... and Johnny RUNS.\n\nPOLICEMAN\nHey!\n\nBut Johnny's off, already lost in the mad street life.\n\nCUT TO\n\nINT. MORTUARY NIGHT\n\nA funeral chapel.\n\nVallan's body lies in state. He is wearing his gang regalia, and all the\nDead Rabbits FILE PAST his coffin in solemn tribute. A WOMAN bends down\nand kisses the body. Happy Jack Mulraney holds Vallon's crucifix, which he\nhas obviously inherited. As a disreputable looking Minister mutters\nPRAYERS, Happy Jack whispers to a silent Amsterdam.\n\nHAPPY JACK\nWe passed the plate amongst ourselves. Come up with enough ned to carry\nall this, and carry you a while, too.\n\nHe stuffs some money in Amsterdam's pocket.\n\nAMSTERDAM\nWhere will my father rest?\n\nHAPPY JACK\nPotters Field, with everyone else.\n\nAMSTERDAM\nMy father won't be buried with everyone else. He'll lie separate in fresh\nground, facing east.\n\nHAPPY JACK\nWhat difference where he faces?\n\nAMSTERDAM\nHe'll face east for the second coming of Christ.\n\nHAPPY JACK\nFine, son. When Jesus gets to the Battery you show Him the way from there.\n\nThe Minister finishes the service. MR. CORNELIUS, a funeral director who\nresembles one of his own customers, ushers in a WOMAN (MAGGIE) pulling a\nlovely 10 year old GIRL (JENNY EVERDEKNE) by the hand. The woman is\nobviously drunk, the girl frightened.\n\nMR. CORNELIUS\nWill you have music, entlegen\n\nWOMAN (MAGGIE)\nMy daughter'11 do any song you like.\n\nHAPPY JACK\nNot tonight, Maggie, we got...\n\nMonk Eastman interrupts from the Background.\n\nMONK\nHow much?\n\nMAGGIE\nAny ned in your pocket, sir.\n\nMONK hands MAGGIE some coins.\n\nMONK\nShe sing sweet as she looks?\n\nMAGGIE\nPure celestial, sir.\n(to girl)\nGo on, Jenny.\n\nJenny's voice is sweet as promised. The song she SINGS, however, is a\nbawdy saloon song. Maggie cuts her off fast.\n\nMAGGIE\nNo, Jen, the other.\n\nJenny starts to sing a HYMN. To avoid looking at the corpse, she lets her\neyes rove all around the chapel until she SEES Amsterdam. She locks\nstraight at him until the hymn is over. And he does not take his eyes off\nher.\n\nCUT TO\n\n12 INT. MORTUARY HALLWAY NIGHT\n\nMr. Cornelius is about to escort Maggie and Jenny into another room\ncrowded with mourners when a smartly-dressed man (DANIEL KILLORAN)\ngestures to him from the shadows.\n\nKILLORAN\nMr. Tweed would like a word, Mr. Cornelius.\n(Cornelius hesitates)\nTweed of Tammany.\n\nAt the mention of the name, Cornelius shoos Maggie and Jenny into the\nmourning room and shuts the door behind them. Then he gives Killoran his\nfull attention.\n\nKILLORAN\nIn your office. At your pleasure, of course.\n\nCUT TO\n\n13 INT. MORTUARY OFFICE\nAs the door opens, we see a man gazing out the narrow window onto the\nspectacle in the next building. He is in his late 20s, already a little\nfleshy but dressed with dash: WILLIAM TWEED... \"BOSS\" TWEED. He shows a\nbemused, almost schalarly interest in the goings-on next door.\nThis mortuary is located next to a bordello, where the windows are\nuncurtained and the energy and variety of the\nactivities inside is astounding.\n\nTweed finally TURNS as Killoran opens the door.\n\nTWEED\nMr. Cornelius. With a view like this I'm surprised the dead can rest in\npeace.\n\nCORNELIUS\nIs there anything I can...\n\nTWEED\n(interrupting)\nYes. A favor.\n\nCORNELIUS\nHappy to serve, Mr. Tweed.\n\nTWEED\nExcellent. Lend me something.\n\nCORNELIUS\n(puzzled)\nOh, I don't know what I could ...\n\nTWEED\nI believe in form and appearance, you see. Just like yourself, sir. And I\nbelieve in law, and the power of example. Our city is a lawless\nwilderness, sir. I'm asking you to help chasten it.\n\nCORNELIUS\nA matter of civic duty, then.\n\nTWEED\nAnd civic pride. I want you to help me set an example.\n(smiles)\nI only need to borrow one of your clients.\n\nCUT TO\n\n14 INT. MORTUARY NIGHT\n\nTwo native Americans open the door where Vallon is laid out and Bill the\nButcher STRIDES into the room.\nThere is immediate TENSION, like an electric charge, as other Natives\nstand in the doorway and crowd the hall stand while Bill walks over to the\ncoffin. He places a BLACK ROSE in Vallon's folded hands.\n\nBILL THE BUTCHER\nTomorrow your cortege will cross Paradise Square, into territory protected\nby the Native Americans. You will be permitted undisputed passage both\nways. That is our tribute. After that, any Rabbits wishing to join the\nNative Americans and willing to swear blood loyalty will be welcomed. All\nothers will be dispatched.\nHe starts out of the silent room, but STOPS when he sees Mank Eastman\nlooking at him with easy interest. Bill the Butcher\nSTARES him down, but Monk's gaze never wavers.\n\nBILL THE BUTCHER\nI'll expect you first.\n\nMONK\nMe? Oh, I don't know. All that talk of blood loyalty makes me quake. I'll\nspill blood when the price is right. But blood for ceremony? I prefer holy\ncommunion.\n\nBILL THE BUTCHER\nYou saw us fight today. You know we can pay any price.\n\nMONK\nNot mine. Not now, and not any time after.\n\nBILL THE BUTCHER\nWe'll see. Independence is a slippery thing. But being a rival ... well,\nthat's dead dangerous.\nBill brushes past Monk and leaves, followed by the NATIVES.\nNow the RABBITS file out, with Monk among them.\n\nHAPPY JACK\nCome on, boyo. I'll put you up tonight.\n\nAMSTERDAM\nI'll do for myself, Jack.\n\nHAPPY JACK\nYou can't.\n(Amsterdam stares at him)\nThere's no mistaking you're his son.\n\nHappy Jack leaves Amsterdam alone in the room.\n\n\nNow, by himself, sure of no one seeing, Amsterdam CRIES.\n\nCUT TO\n\n15 INT. MORTUARY NIGHT\n\nMr. Cornelius is seated in his office, enjoying a late supper while\nlooking out his window at the bordello activity across the alley. A NOISE\nat the door disturbs him: Amsterdam.\n\nAMSTERDAM\nWhat's the cost to bury my father proud and proper?\n\nMR. CORNELIUS\nFor a plot, a headstone, hands to break the earth...\n\nAMSTERDAM\nHow much?\n\nMR. CORNELIUS\nWhat are your current means?\n\nAmsterdam turns out his pockets, which contain Bill the Butcher's pirate\nknife as well as the cash Happy Jack pressed on him. Cornelius TAKES it\nall.\n\nMR. CORNELIUS\nOf course you'll have to wait three days for a city permit. But all this\nmay do for part.\n\nAMSTERDAM\nNo.\n\nAmsterdam takes the knife back from Cornelius.\nAMSTERDAM\nThat's owed another.\n\nCUT TO\n\n16 EXT. STREET/PARADISE SQUARE DAY\n\nA grey day. Amsterdam stops in front of a window. He STRUGGLES with his\nscarf, trying to keep himself warm. His eye strays for a moment, and he\nsees he is outside Mr. Cornelius' Establishment. Then he NOTICES something\nelse....\n.... his FATHER, propped up in a coffin, on public display. There is a\nlarge sign beside the body: \"The Dead End of Lawlessness. Tammany Abhors\nCrime. Tammany Means Justice.\"\nA sizeable CROWD is goggling at the body. Amsterdam BULLS his way through\nthe people to the street. He looks in the gutter, then looks up quickly.\nSomeone is watching him: Johnny. He's carrying an armful of wood.\n\nJOHNNY\nFirewood?\n\nAmsterdam grabs the longest plank Johnny has.\n\nJOHNNY\nIt's a penny the load.\n\nAMSTERDAM\nLater.\n\nHe turns with the plank in his hand and starts to RUN back through the\ncrowd.\n\nJOHNNY\nHey!\n\nJohnny manages to GRAB the other end of the plank. But Amsterdam's so\nstrong he YANKS him right along. The Crowd YELLS as it parts for\nAmsterdam, who CHARGES through using the plank like a battering ram, with\nJohnny on the far end, born along by stubbornness and momentum...\n... toward Mr. Cornelius' window. Amsterdam SHATTERS the window and the\nCrowd SCATTERS in a blizzard of GLASS.\nAmsterdam stumbles into the window and against the coffin, which falls\nover, spilling Vallon's BODY, knocking the boy over. Amsterdam picks\nhimself up as Johnny stands frozen.\n\nAMSTERDAM\nHelp me.\n\nHe starts to pull his fatherls body from the window.\n\nAMSTERDAM\nCome on! Help me, goddamn it!\n\nIn a daze, Johnny steps forward and HELPS Amsterdam pulls the body onto\nthe street.\n\nNow: the SOUND of WHISTLES and WHEELS and RUNNING HORSES as a wagon full\nof POLICE arrives on the scene. Behind them, the Crowd returns, yelling\ninsults.\n\nThe police RUN toward the window. Mr. Cornelius dithers at the front of\nthe crowd.\n\nAmsterdam and Johnny exchange a look. Then Johnny RUNS for it. Amsterdam\nstays with the body...\n\n... as the cops close in, SWINGING clubs. Amsterdam's grabbed and hit a\ncouple of times. The Crowd yells. A COP swings his arm back to give\nAmsterdam a good wallop...\n\n... and someone grabs his arm: Bill The Butcher.\n\nBILL THE BUTCHER\nEasy, crusher. What's this all about?\n\nCRUSHER\nAsk the boy.\n\nAMSTERDAM\nI paid Cornelius for my father to rest in honor. He told me I had to wait\non a permit, but he only wanted time to...\n\nBILL picks up the Tammany sign from the ground.\n\nBILL THE BUTCHER\nMake another Arrangement, looks like. For advertising.\n(to cop)\nBetter go along. I'll see to all this.\n\nCOP\nThe boy...\n\nBILL THE BUTCHER\nTake the little malefactor.\nThe Cops YANK the wildly flailing Amsterdam to his feet and DRAG him off\nto their wagon. Bill The Butcher approaches Cornelius.\n\nBILL THE BUTCHER\nGive the boy what he paid for.\n\nCUT TO\n\n17 EXT. STREET/PARADISE SQUARE DAY\n\nAmsterdam is HURLED into the police wagon. The door is locked behind him.\nHe pulls himselt to his feet, looks out the tiny barred window, SEES ...\n\n... Dead Rabbits join up in a rough funeral procession. SEVERAL help LOAD\nVallon's body back into the coffin and place it onto Mr. Cornelius' fancy\nfuneral wagon. Monk Eastman LEAPS up onto the wagon and closes the coffin\nlid tight.\n\nThere are PEDDLERS everywhere. One dispenses drinks from a portable\nsamovar. A SAILOR hawks ships in a bottle, repeatedly shouting the same\nadvertisement: \"Encourage the work of a landswamped sailor!\" A SILHOUETTE\nARTIST offers to draw portraits of passersby.\nFuneral music is furnished by STREET MUSICIANS: a drummer, a fiddle\nplayer, and a horn player, with a couple of BUSKERS performing along side\nfor good measure.\nMr. Cornelius takes the wagon reins and guides the horses out of the\nsquare. The gang FOLLOWS solemnly behind.\n\nAnd across the square, the police wagon carrying Amsterdam starts MOVING\nOFF in the opposite direction. He keeps looking out the tiny wagon window.\nThe funeral procession leaves the square and activity returns quickly to\nnormal. Peddlers' CRIES once again fill the air. The Buskers start PLAYING\na snappier tune. SNOW begins to fall.\n\nCUT TO\n\n18 INT- TOMBS DAY\n\nA huge, awful prison building modeled on an Egyptian mausoleum.\nAmsterdam--trying to hide his growing fear--waits on line with other\nPRISONERS, all of them older than he.\nAt the head of the line, prisoners are being processed by a JAILER and a\ncouple of COPS. Each prisoner is asked several cursory questions, then\ntold to strip. Every one of the men is SCARRED in some way.\nAMSTERDAM nears the front of the line. The MAN just ahead of him\nundresses. His left buttock is missing, and his back is covered with whip\nscars. A PRISONER behind Amsterdam WHISPERS loud enough for Amsterdam to\nhear...\n\nPRISONER\nAin't his first Tombs trip.\n\nANSTERDAM steps up to the desk. The JAILER hardly takes notice of him.\n\nJAILER\nWhat do they call you?\n\nAnd this is the first time in the film we have heard his name.\n\nAMSTERDAM\nAmsterdam.\n\nThe JAILER looks him over.\n\nJAILER\nYour full name.\n\nAMSTERDAM\nVallon.\n\nThe JAILER writes this down with a scratchy pen.\n\nJAILER\nFirst name?\n\nAMSTERDAM\nI told you.\n\nJAILER\n(skeptical, resigned)\nAddress?\n\nAMSTERDAM\nGot none.\n\nJAILER\nI'll put city. Now what's your age?\n(Amsterdam shrugs.)\nMaybe twelve. Got a family?\n\nAMSTERDAM\nNo more.\n\nJAILER\nWell, where was they from when you had one?\n\nAMSTERDAM\n(beat)\nCity.\n\nJAILER\n(writing)\nDisrobe.\n\nAs Amsterdam obeys, the Jailer turns to the Cop in the leather helmet\nstanding at his side.\n\nJAILER\nWhat's the charge, Asbury?\n\nCOP\nTheft. Assault. Creating a ...\n\nThe Jailer finishes writing. Amsterdam stands naked.\n\nJAILER\nThrough that door there.\n(lowers his voice)\nAnd don't stand too near no one else.\n\nCUT TO\n\n19 INT. CREMORE NIGHT\n\nThe largest, noisiest, gaudiest dive we have yet seen, full to bursting\nwith bawdy CUSTOMERS even at this late hour. Therels a long bar, where men\nand women stand three deep; lots of small tables; a dance floor; and a\nstage on which four blowsy DANCING GIRLS are giving out with a ribald\nnumber titled \"My Father's Teeth Were Plugged With Zinc.\"\nOne end of the bar is entirely taken up by a huge woaden keg with an\nattached hose. BAR ATTENDANTS DUMP the unfinished contents of glasses into\nthe open barrel top as a line of FAR GONE DRUNKS wait their turn for the\nhose. Maggie, Jenny's mother, is close to the front of the line, very\ndrunk, hanging on to a mush-faced HOODLUM.\n\nTwo VISITORS watch. One has a pad and makes quick SKETCHES.\n\nVISITOR ONE\nOught to be served in a trough, properly. Will you try some?\n\nARTIST\nProbably. What is it?\n\nVISITOR ONE\nAll-Sorts. It's made of all that's poured and not drunk, and any they can\nsalvage that's spilt.\n\nMaggie GRABS the hose, staring at the Artist as she takes a drink. His\nhand moves quickly an the page, SKETCHING her.\n\nVISITOR\n(to Maggie)\nYour health.\n\nShe SPITS at him, insulted. The Artist steps forward, puts some of the\nAll-Sorts from the hose into his glass, and toasts Maggie. She nods and\nturns away....\n...as Johnny enters, dragging a large SACK across the crowded floor toward\na far door.\n\nCUT TO\n\n20 INT. CREMORE BACK ROOM NIGHT\n\nJohnny RUSHES toward a wooden pen in the center of the room. There are\ncries from the crowd of SPORTSMEN of \"Hurry it up\" and \"More speed!\"\nJohnny dodges a kick or two before he finally arrives at the pen.\nHe UPENDS the sack over the pit and a dozen live RATS tumble out. A\nGAMEMASTER slips Johnny a couple of cents as he starts his spiel.\n\nGAMEMASTER\nAlright, gents and ladies, your bets now on Towser against the vermin, the\ncount to beat is ten rodents in three minutes.\n\nThe crowd starts to place bets. A sleepy Johnny settles down close to\nringside to watch the show.\n\nAt a signal from the Gamemaster, a TRAINER tosses TOWSER--A fierce\nmongrel--into the ring. The crowd cheers lustily, continuing to shout out\nbets, as the dog goes after the rats.The rats, fighting for their lives,\nbite the dog, attaching themselves to his body. Towser retaliates by\ngnawing the rats, SNAPPING them in half and spitting them out.\n\nAs the CROWD cheers, and Towser kills, and money changes hands, Johnny\ncurls up and goes to sleep.\n\nCUT TO\n\n21 INT. TOMBS NIGHT\n\nA row of cells, noisy and cold. The GUARD shoves Amsterdam into a cell.\n\nGUARD 2\nYou get to live private until they come from the orphan's asylum. On\naccount of your tender years.\n\nThere is nothing in the cell but a board for a bed, and a window through\nwhich Amsterdam can see the late winter moonlight. He looks for stars in\nthe sky, but can see none.\n\nCUT TO\n\n22 INT- MAIN ROOM/OLD BREWERY\n\nJenny Everdeane and a girl FRIEND, her own age, huddle together in a dark\ncorner of this huge space. The Friend opens her hand to show Jenny a\nglimpse of what she's clutching: a penny.\n\nJENNY\nLet me see! I don't believe it.\n\nFRIEND\n(closing her hand)\nNo! It's a danger.\n\nJENNY\nOh come on! It's not.\n(Friend shakes her head)\nThen tell me where you got it.\n\nFRIEND\nFrom some man. He took me in his carriage. He only wanted to do something\nto me fast.\n\nJENNY\nWhat?\n\nFRIEND\n(shrugs)\nI didn't understand.\n\nJENNY\nWould he do the same with me?\n\nFRIEND\nI won't tell you if he's around again.\n(clutches penny tight)\nHe's my secret.\n\nJENNY\nBetter keep it more careful, then.\n\nThe Friend GETS UP and starts across the Brewery floor, acting nonchalant.\nBut she looks around her, across the sleeping, passed-out bodies, past the\ndesperate families and their squalling infants, to see if she's been\nnoticed.\nA man and two women cast a glance her way. She looks away, but the TRIO\nkeeps watching her... then FANS OUT and starts to FOLLOW her.\nThe Friend looks over her shoulder again. SEES the Man. Locks in another\ndirection, SEES: the woman. And then: the second woman. All closing on her.\nThe Friend starts to RUN. The Trio runs after her. And no one else pays\nattention. The Friend PLUNGES into one of the warren of TUNNELS that lead\noff the Brewery floor.\nCAMERA plunges through the darkness, after her. Her footsteps ECHO; there\nis the SOUND of stumbling, falling, an angry CURSE and a BLOW being\nstruck. The FRIEND picks herself up out of the darkness and keeps running,\nCAMERA following down the dank halls.\nSuddenly the TRIO runs AHEAD of the camera. There is a SCREAM. CAMERA\nstaps. And others SOUNDS follow quickly now: the dull THUD of a heavy\nobject against bone, REPEATED several times; and then, very soon after,\nthe most terrible sound of all: silence.\nThen Two Women emerge from the darkness of the tunnel, fighting over the\npenny. The Man, several steps behind them, throws an object to the dirt\nfloor: it's a STONE, and it is covered with blood. He comes up behind the\nTwo Women quickly and GRABS the penny from them with a hand that still\nDRIPS blood and gore. They CHASE after him across the crowded Brewery\nfloor.\n\nCUT TO\n\n23 INT. HALLWAY/TAMMANY NIGHT 2\n\nCAMERA races along the ornate corridor, past PORTRAITS of many affluent\nand self-important GENTLEMEN... through a door and into...\n\n24 INT. TWEEDIS OFFICE/TAMMANY NIGHT\n\n... Tweed's domain. Small in size, but there are dozens of CAGES OF\nCANARIES all around. Tweed looks up startled as the door flies open. The\nbirds set up a COMMOTION.\n\nCAMERA bears down on Tweed as a pair of HANDS grabs him and hurls him\nagainst the wall.\n\nBill The Butcher GLARES at Tweed. Some NATIVES come into the room behind\nhim.\n\nBILL THE BUTCHER\nYou come into the Five Points and you stole from me.\n\nTWEED\nI don't know...\n\nBILL THE BUTCHER\nYou stole Vallon. He was my kill. My example, of my power. You took him\nand made him yours.\n\nTWEED\nYou're a lunatic to come here like...\n\nIn the background, same of the NATIVES have begun to play CATCH by\nremoving the CANARY CAGES from their places and tossing them all over the\nroom.\n\nBILL THE BUTCHER\nThank you. Just listen good. The Native Americans holds the Five Points.\nWe have prevailed. What you do outside the Points is your deciding.\nOutside is your city. Inside the Points is mine. Anyone who says\ndifferent, or does different, or thinks different...\n(smiles)\n... theylll draw my unwelcame attention. You understand?\n\nBOSS TWEED\nI do understand, yes.\n\nBILL pushes him away and starts out.\n\nBOSS TWEED\nBut you don't understand at all.\n\nBill keeps walking.\n\nBOSS TWEED\nThere's a whole city to share and all you see is your own narrow streets.\n\nBILL THE BUTCHER\n(turns now)\nYou just stay out of my place.\n\nBOSS TWEED\nYes, alright. Gladly. It's all blackjack jobs and panel games and killings\nfor a fiver.\n\nBill waits for Tweed to continue. But Tweed stoops and tries to soothe a\ncanary in a cage.\n\nBILL THE BUTCHER\nIt's good work.\n\nBOSS TWEED\nAs far as it goes.\n\nBILL THE BUTCHER\nYou wouldn't be talking to me otherwise.\n\nBOSS TWEED\nBut we're talking about different things, Bill. You describe the present.\nI see the possibilities. Look to the future. There is so much more.\n\nThe Butcher starts to look interested.\n\nCUT TO\n\n25 INT. TWEED'S OFFICE NIGHT\n\nLater. The Natives have cleared out; only Tweed and the Butcher remain.\nThe cages have been restored to their proper places and the room has been\nstraightened. Bill stands beside the door, while Tweed relaxes in a chair.\n\nBOSS TWEED\nThere's things demanding to be done that no police force can do, not even\nan obedient one. There's contributions from every dive and brothel.\nLoyalties to be secured and debts to be collected.\n\nBOSS TWEED (Cont'd)\nAnd now you and your Natives have emerged as the foremost force in the\nFive Points, I'm prepared to extend you an opportunity. You can work for\nTammany...\n\nBILL THE BUTCHER\nWe work for no one.\n\nBOSS TWEED\n... beside Tammany... in the performance of these civic obligations. And\nfor a satisfactory... I'm prepared even to say equitable... financial\nparticipation. It's not the sort of responsibility the founding fathers\nmight have recognized. But then, the founding fathers never imagined the\ncity New York has become.\n\nBILL THE BUTCHER\nMaybe you Tammany boys should do your own lifting and carrying and muscle\nwork. Might build you up.\n\nBOSS TWEED\nWe'd like to. I do miss it. But it's wiser for men in the public life to\ngive an appearance of probity.\n\nBILL THE BUTCHER\nThen get cops to do it.\n\nBOSS TWEED\nOh Jesus, no. The appearance of law must be upheld, especially while it's\nbeing broken.\n\nBILL THE BUTCHER\nAppearance means nothing.\n\nBOSS TWEED\nPerhaps not within the Points. But the smart man could go higher.\n\nBill looks at Tweed for a long moment. The he SHOVES himself away from the\nwall, pulls away the chair on which Tweed has been resting his feet and\nsits down close to him.\n\nBILL THE BUTCHER\nIf you can talk plain, maybe we can do business.\n\n26 EXT. STREET NIGHT\n\nA small slum thoroughfare congested by a splendid FIRE-WAGON labeled\n\"Americus Co./Tammany Hall.\" Curious SPECTATORS and panic-stricken\nRESIDENTS crowd around to watch a ramshackle building going up in FLAMES.\nAs Johnny presses through the crowd to get a good look at the fire, Tweed,\nin a white coat and fancy fire helmet, steps off the fire wagon to address\nan ONLOOKER.\n\nTWEED\nAnyone inside?\n\nONLOOKER\nNo, praise God, but all we own...\n\nTWEED places a bucket over the only fire plug in the vicinity, then sits\non it.\n\nONLOOKER\nWell?\n\nTWEED\nWaiting on reinforcements.\n\nThe SOUND of another bell, nearby. Down the street from the opposite\ndirection come TWO MORE FIRE-WAGONS. The crowd starts cheering. Tweed does\nnot move from the plug.\n\nTWEED\nThat's not them. It's only the Black Jokes. Seems your fire interrupted\ntheir festivities.\n\nThe wagons pull up next to the fire plug. Each of them has the words\n\"Black Joke Fire Co.\" written large on the side, but the FIREMEN wear\nparty costumes, not regular uniforms. Some are dressed as British\nRedcoats, still others as Indians.\nThe FLAMES continue to devour the building, but Tweed does not budge from\nthe plug. He is approached by the Black Jake chief, who is dressed as an\nIndian chief.\n\nCHIEF\nMay I point out that the building is burning to ashes?\n\nTWEED\nCertainly. And may I then remind you, Pocahontas, that this entire area is\nthe province of the Americus company, and you will kindly keep your\ndistance.\nImpasse. The rival Fire Companies size each other up and start toward each\nother. The building continues to burn. Tweed remains regal and unperturbed\natop the fire plug.\nAs the two COMPANIES are about to close with each other, a second BELL\nsounds. Tweed's \"reinforcements\" have arrived: the Native Americans, led\nby Bill The Butcher. They PILE OFF the wagons before the horses halt. Now\nthe Black Joke Co. is outnumbered, and it FALLS BACK. As the Crowd CHEERS,\nTweed takes the bucket off the fire plug.\n\nTWEED\nAlright, boys! To work!\n\nThe MEN of the Americus Co. give a great SHOUT and start firefighting: a\nhose is hitched up to the plug, buckets are filled, a primitive pump sends\nwater spluttering everywhere.\nBut there is not much blaze left to combat and the Men quickly grow\nfrustrated. Tweed realizes this immediately.\n\nTWEED\nNext building over, boys! Mustn't let it spread!\n\nThe men charge into a neighboring building, STOMPING down doors, CLIMBING\nthrough windows and SWINGING AXES with gusto, all to save a building that\nis in no danger at all.\nA local poll named DANIEL KILLORAN detaches himself from the crowd and\napproaches Tweed, giving him a hearty SLAP on the back.\n\nKILLORAN\nAnother proud night for Tammany, Bill.\n\nTWEED\nJust tell them...\n(lowers his voice)\n... to take enough to share. And not to steal so in the open.\n\nIndeed, the Men are leaving the building with lots of LOOT. CITIZENS who\nquestion their right to do this are promptly KNOCKED DOWN. Killoran GRABS\nBill The Butcher as he rushes by.\n\nTWEED\nJesus! Boss says to tell you to fight the fire from the front and loot out\nthe back.\n\nBill grins and leaves to spread the word as an angry WOMAN approaches\nTweed.\n\nTEARFUL WOMAN\nThe Black Joke could have saved my house!\n\nTWEED\nBlack Joke had no business here, Madam.\n\nTEARFUL WOMAN\nTheir business was to save my house!\n\nTWEED\nTammany's your business. When we're here to call upon there's no need of\nother. We understand loss, Madam, and take care of our own.\n\nAs Tweed leads her off, away from the blaze and the thieving, he passes a\nboy sitting an the curb, watching the fire ... and watching Tweed ... with\nadmiration. It's Johnny.\n\nThe FLAMES light up his EYES as we...\n\nDISSOLVE TO\n\n27 INT. BREWERY NIGHT 2\n\nJenny's face, as she tries to sleep on a narrow, filthy mattress. Her\nmother Maggie lies beside her, crowding her, THRASHING about in a\ntroubled, drunken sleep.\n\nDISSOLVE TO\n\n28 INT- ROOM/HIGH BRIDGE ORPHANS ASYLUM 2\n\nAmsterdam, eyes wide, lying on a cot in the middle of a long room crowded\nwith KIDS - This place is a step or two up from the Brewery--but not a big\nstep. He stares at the ceiling, eyes grave, untroubled by the small cries\nof loneliness and fear that come from some of the beds surrounding him. As\nwe move CLOSE on his EYES we...\n\nDISSOLVE TO\n\n29 EXT. HIGH BRIDGE ORPHANS ASYLUM DUSK\n\n... the same eyes. But OLDER. Smart and full of savagery.\n\nIt is Amsterdam. He is now in his early 20s, fully grown and no man to\ntrifle with. Moving with jungle stealth and strength he ...\n\n... BURSTS out the door within the massive frame of a great iron gate over\nwhich hangs the sign \"High Bridge Orphan Asylum.\" He starts to RUN and a\nTITLE comes up...\n1852\n\nPursued by GUARDS, Amsterdam runs hell-for-lather for a long vaulted\nbridge. It's a beautiful, stern old Romanesque span across the Harlem\nRiver with rolling banks of leafy trees on the far side. Even in the\ntwilight, we can see that it is late spring, the end of a long afternoon.\n\nCUT TO\n\n30 EXT. HIGH BRIDGE DUSK (MATTE)\n\nAmsterdam is on the bridge. But he does not slow up until ....\n\n... two orphanage GUARDS suddenly TACKLE him. A THIRD GUARD beats him with\na billy club. Amsterdam moans and curses, as much from frustration as pain.\n\nSECOND GUARD\nIt's Blackwell's Island certain now, boyo.\n\nThe SECOND GUARD pulls AMSTERDAM up by the hair.\n\nTHIRD GUARD\nAre you hurting? Let's hear you!\n\nAmsterdam won't give him the satisfaction. The Guard hits him. Amsterdam\ngoes down, biting his lip so he won't cry out. Instead, he forces a SMILE.\n\nSECOND GUARD\nThere's nothing funny, boyo! You been beat and turned back four times now.\n\nAMSTERDAM\nBut every time you bring me back... you got to come further to catch me.\n\nCUT TO\n\n31 EXT. CORLEAPS' HOOK PIER NIGHT\nThrough the THICK FOG comes a ghostly apparition: a tattered SKULL AND\nCROSSBONES, made of rags, fluttering from the mast of a leaky, unstable\nvessel.\nThe bow of the small boat breaks the fog, and on board we see: a hulk\ncalled SHEENY MIKE KURTZ and a huge black kid named JIMMY SPOILS, manning\nthe cars. Johnny Sirocco, grown wary and wiry, peers into the fog like a\nlookout, while Shang Draper, at the tiller, looks anxious.\nThe HULL of a large boat suddenly laoms in front of them, not five yards\naway.\n\nJOHNNY\nHard starboard, Shang! Hard starboard!\n\nSHANG\n(panic)\nI told you forget that sailor stuff! Which way's star...\nToo late. Their Ticket craft crashes into the side with enough force to\nmake a LOUD THUMP and to send Shang sprawling.\n\nSHEENY MIKE\n(sarcastic)\nWhy don't we just knock on their front door?\n\nShang gestures for QUIET. They wait and listen. No sound from the deck of\nthe boat above them. The boys throw two ROPE LADDERS over the rail of the\nlarger ship and start climbing.\n\nCUT TO\n\n32 EXT. SHIP NIGHT\n\nThe boys board the ship and gather on deck. They look around uneasily,\nspooked by the silence and the fog.\n\nSHANG\nSpread out and make for the cabin.\nMoving slowly, the boys FAN OUT and move toward the cabin at the far end\nof the deck. Johnny stays close to Shang, holding onto the shipls rail for\nsupport.\n\nSHANG\n(whispering)\nNothing. Looks picked clean.\n\nJohnny stops. His hand, on the railing, is BLOODY. On the other side of\nthe deck, Sheeny Mike discovers more traces of blood and SIGNALS Shang.\n\nSHANG\nBill and the Natives must have got here first.\n\nJohnny freezes in terror.\n\nSHANG\nWhat ...\n\nA long SHADOW falls across his shoulder. Shang jumps.\n\nStanding before him, holding a musket and covered in blood, is the ship's\nCAPTAIN. A BUTCHER'S CLEAVER is imbedded between his neck and shoulder.\nWith his dying energy, the Captain takes AIM at a petrified Shang and\nfires his musket.\nJimmy Spoils JUMPS the Captain from behind, sending the musket ball way\nwide. But the SOUND of the musket is thunderaus, and echoes through the\nharbor. The boys panic and head for the side.\n\nSHEENY MIKE\nThat'll bring the Harbor cops for sure.\n\nJOHNNY\n(about the dead man)\nWait! Take him. If he's still alive he's good for ransom!\n\nSHEENY MIKE\nHels dead as Good Friday, can't you...\n\nJOHNNY\nThen we'll take Bill the Butcher's cleaver and sell the body to the\nmedical students. They'll go five dollars for it anyway.\n\nSHANG\nCome on. We'll get something out of this.\n\nShang and Johnny start DRAGGING the body. Pushing, pulling and mostly\npanicked, the others help. As they boost the body over the side, the SOUND\nof a bell cuts through the fog.\n\nSHEENY MIKE\nThe Harbors!\n\nShang shoves the body off the side and into the boat. It lands with a\nresounding THUD. The boys CLAMBER after it.\n\nCUT TO\n\n33 EXT. BOAT/RIVER NIGHT\n\nPUSHING OFF with cars, tearing their rope ladders from the side of the\nship, stumbling over the captain's body, the boys slip off into the fog.\nThe Harbor Police are so close to them they can see a police LANTERN\nshining. The boys stay absolutely still. Suddenly, WE SEE: the POLICE\nBOAT, breaking through the fog, then\nDISAPPEARING again.\n\nSHEENY MIKE\nWe can't go back to Corlears Hook, they'll be watching...\n\nSHANG\nWe'll make for Blackwells.\n\nJIMMY SPOILS\nAnd which way's that through this fog?\n\nJohnny throws his hands up for quiet. From close by comes the SOUND of\nCOP'S VOICES. They are near. Very near. The boys stay as still as they\ncan...\n... and the VOICES recede again in the thick fog.\n\nJIMMY SPOILS\nShould have asked them directions as they drifted by, Shang.\n\nSHANG\nYou'd have liked that, wouldn't you Coal Face? You're the only one they'd\nmiss in the dark.\n\nSHEENY MIKE\nLet's quiet, or we'll all be found out!\n\nAs the BOYS stay still, their boat DRIFTS against an outcropping of land\nand STOPS.\n\nSHANG\nAlright. We lay up here till first light. Then we run back across the\nriver.\n\nJIMMY SPOILS\n(contemptuously)\nRiver pirates!\n\nSpoils settles back and tries to sleep. Johnny watches Shang in the bow.\nShang is too agitated to notice Johnny's stare. He looks away, waiting for\nthe sun.\n\nCUT TO\n\n34 EXT- BLACKWELLS ISLAND DAWN\n\nShang drowses in the boat, fighting fatigue, then succumbing to it. But\nh's brought awake suddenly by a loud SPLASH. He looks in the direction of\nthe noise, SEES ...\n... the BODY of the slaughtered ship's captain floating away in the\ncompany. He starts to cry out but Amsterdam GRABS him, locking his throat\nin the crook of his arm.\n\nAMSTERDAM\n(to everyone)\n\nPush off! Or his pipe snaps!\nThe other boys are too stunned to resist. They push the boat away from the\nisland.\n\nAMSTERDAM\nHead straight out, then turn for the current.\n\nHe pushes Shang away from him. The two boys stare at each ather, finally\nremembering...\n\nSHANG\n(breathing hard)\nFigured you for dead.\n\nAMSTERDAM\nClose enough.\n\nSHANG\nThis is my crew. And welcome to join, if you've the mettle. We're river\npirates and quick thieves and street brawlers...\n\nAMSTERDAM\n(casual disdain)\nYou're lost.\n\nSHANG\nYeah? You've no business saying anything against us! Do you know how much\nyou cost us? You know how much that body's worth?\n\nAMSTERDAM\nI doubt it's worth the water it's floating in.\n\nSHANG\nFifteen dollars! Fifteen dollars from them medical ghouis.\n\nAMSTERDAM\nI'll make it back for you whatever it is, once we're in the city. Just\nkeep sailing, or we're all done for.\n\nSHANG\n(beat; to crew)\nGo ahead then.\n(beat; to Amsterdam)\nHe was in his prime. He'd have fetched thirty dollars easy.\n\nCUT TO\n\n35 INT. HIDEOUT DAY\n\nA ramshackle room near the docks. It is part meeting hall, part living\nquarters for the gang, and part clearing house forstolen goods. SHANG\npresides over a boisterous meeting.\n\nJIMMY SPOILS\nYou're as flat as Broadway going north. We can't run the river no more.\nWe're poaching the Natives and the Harbor cops are looking for us.\n\nSHANG\nThe cops can go to blazes. Who cares about them?\n\nSHEENY MIKE\nYoulre all sand when it comes to cops, Shang. But do you have the sand to\ngo against the Natives?\n\nSHANG\nIt ain't the time to go against the Natives. We've got to build first.\nThen we go.\n\nJIMMY SPOILS\nIf we go like we did in the river, all of us'll sink.\n\nAmsterdam is sitting off to the side, watching this ongoing debate with\ncontemptuous detachment. Johnny sits next to him.\n\nAMSTERDAM\nDoes Shang have the sand to ever go against the Natives?\n\nJOHNNY\nI don't know. He acts like it.\n\nAMSTERDAM\nIf he only acts, held be better on the stage.\n(looks away)\nLike her.\n\nHis tone of voice has changed. Jenny Everdeane passes before him; she's\nravishing. Amsterdam STARES, as if he's trying to see into her heart.\nJenny pays him scant attention as she moves across the room toward Shang.\n\nJOHNNY\nJenny Everdeane. Shang turned her into the best bludget in the Points.\n\nJenny gives Shang silk scarfs, wallets and several purses from her coat.\n\nAMSTERDAM\nShes his mort, is she, as well as his best provider?\n\nJOHNNY\nYeah. But Jenny says she's anyone's she chooses.\n\nJenny's haul is impressive. Shang picks a BRIGHT RED SILK SCARF with a\ndistinctive PAISLEY design from the pile of stolen goods. He examines it\nwith a shrewd, appreciative eye.\n\nSHANG\nThat's the prize of the month. Spice Islands silk.\n\nHe puts the scart in his coat pocket with a FLOURISH, then throws his arm\nabout Jenny in a proprietary way.\n\nSHANG\nYou'll learn our way if you're going to be one of us, Amsterdam.\n\nJenny reacts slightly to the mention of the name: she looks over and\nRECOGNIZES Amsterdam now.\n\nSHANG\nEvery one of us gives a portion of all they steal to the gang. Morts more\nthan men, being morts.\n\nAMSTERDAM\nYeah? And why is that?\n\nSHANG\nBecause morts have more resources. Men can work only on their feet, but a\nmort can turn out on her back.\n\nAMSTERDAM\nI mean, why give at all? Why don't they keep for themselves?\n\nSHANG\nIf you think there's something off about my way of running things, you got\nno place in this gang.\n\nAMSTERDAM\nI got no place anyway, and you got no gang. This ain't a gang, no matter\nwhat you say. It's a mob.\n\nThere's a tense hush in the grubby room. Shang takes his arm from around\nJenny, wanting to be restrained.\n\nJENNY\n(smiling)\nIt's all your play now, Shang. Maybe you can set him right.\n\nJenny hands him a cane. Barely managing to hide his reluctance, he\nstarts--slowly--toward Amsterdam, who stands his ground. The gang steps\nback to give them room in this tiny space. Shang pulls the cane apart:\nit's a SWORD CANE, but Amsterdam shows no fear. He shifts his weight a\nlittle, watching ... and they're interrupted by a...\n\nVOICE (HAPPY JACK)\nYou boys settle with me before you settle each other.\n\nThey turn to him.\n\nHAPPY JACK\nI've come for my due and proper, Shang.\n\nHappy Jack Mulraney (the Dead Rabbit gang member with the halfparalyzed\nface) stands before them in a POLICEMAN'S UNIFORM-sparkling clean and\nsplendid--a leather helmet and long coat. In his hand, he twirls a\nNIGHTSTICK.\n\nSHANG\nAs agreed, then, Jack. Refreshment?\n\nShang OPENS the top of the gold-handled sword cane. Inside are large,\nsolid LUMPS of cocaine. Jack reaches for the choicest.\n\nAMSTERDAM\nStill smiling, are you?\n\nHAPPY JACK\n(sizing him up)\nIt's the young Vallon, is it? I hardly recognized you.\n\nAMSTERDAM\nI hardly knew you under that hat, Jack.\n\nBy now, Jack has taken not only the cocaine, and the money and swag Shang\noffers, but several of the purses and wallets Jenny delivered. Jenny\nstares at him with contempt, and he laughs, tossing one of the purses back\nat her.\n\nJACK\nThere. For your respect.\n\nJack turns to leave but a BRASH BOY blocks his way. Moving fast and fancy,\nJack bashes the Boy to the floor with his nightstick.\n\nHAPPY JACK\nAnybody else? Any number at all, come on.\n\nSeveral of the gang make a move toward Jack, but Shang WAVES them back.\nJack departs UNHARMED, to general disgust. Jenny walks back across the\nroom to help the Brash Boy. Shang GLARES at Amsterdam, slides his sword\nback into his cane and follows Jenny, trying to explain himself.\n\nAMSTERDAM\nIs that sand we've just seen?\n\nJOHNNY\nIt's politics.\n\nCUT TO\n\n36 EXT. PARADISE SQUARE DAY\n\nA hot summer day. All the TRADESMEN are out in force, jamming the square\nand the side streets leading to it. Amsterdam walks fast through the\ncrowd, enjoying the freedom and the bustle, as Johnny tags along close\nbehind him.\n\nAMSTERDAM\nI've got my own way to go, why don't you find yours?\n\nJOHNNY\nBecause your way's different, and I want to see where it goes.\n(Amsterdam looks at him)\nUnless you say otherwise. Amsterdam shrugs and keep walking.\n\nJOHNNY\nYou act like you have something in mind, like you know every day what\nyou'll be doing the next. Me, I don't figure on tomorrow.\n\nAMSTERDAM\nWell, if you shut up a while maybe it'd come on its own.\n(he stops, looks)\nNow what the hell's that?\n\nJOHNNY\n(following his glance)\nOh that's heaven.\n\nWE SEE what they're looking at: the Old Brewery. In worse shape than ever\nbefore, but shut-down, abandoned. A tattered banner flaps against the\nfront door: \"Future Home of the Five Points Mission/ Praise God!/ The\nReverend Shadrach Raleigh, Pastor.\"\n\nJOHNNY\nThe city shut down the Brewery as unfit to live and Tammany gave it over\nto this minister.\n\nAMSTERDAN\nWhat's Tammany?\n\nJOHNNY\nWhy Tammany ... you don't know? Tammany makes the city run. A political\norganization that's like... like the Native Americans, only ranging over\nthe whole city.\n\nCUT TO\n\n37 MONTAGE\n\nAs Johnny continues to speak, we see Tammany tactics in action:\nWARD-HEALERS dispensing coal to the poor, and TOUGHS stealing meat off of\nbutcher's wagons; a political PARADE with fife and drum-and\npoliticians--including Boss Tweed--in ceremonial Indian costume, and a\ngroup of GOONS busting up a saloon; Tweed making a speech to enthusiastic\nCONSTITUENTS and a Tammany Fire Company tearing through the streets,\nscattering everyone in their way, finally revealing they are not rushing\nto a fire but are CRASING OFF a rival fire company.\n\nJOHNNY\nThey seem like the law, but they got a way of acting outside the law.\nAnything that happens in this city, on the straight or on the sly,\nTammany's a part of, and Boss Tweedls the heart of Tammany.\n\nCUT TO\n\n38 EXT. PARADISE SQUARE,/OLD BREWERY DAY\n\nAmsterdam studies Johnnyls enthusiastic face.\n\nJOHNNY\nThey're the best gang there is.\n\nAMSTERDAM\nSo if Tammany's the best, go with Tammany. What are you running with this\nmob for?\n\nJOHNNY\n'Cause they're more my size for now. With Tammany, you got to do something\nlarge, something that makes them take notice of you.\n\nAMSTERDAN\nYou're better oft without their notice. You can run free, work your own\nschemes.\n\nJOHNNY\nBut if your schemes have size, you need size to bring them off.\n\nAMSTERDAM\nWhat are you thinking?\n\nJohnny shrugs, grins: he doesn't want to give anything away. Amsterdam\nunderstands, turns toward the Brewery.\n\nAMSTERDAM\nLet me in if you ever get it figured.\n\nAmsterdam starts toward the Old Brewery, Johnny keeping step.\n\nAMSTERDAM\nI'll go on my own from here.\n\nJohnny STOPS and Amsterdam continues on by himself.\n\nCUT TO\n\n39 INT. MAIN ROOM/OLD BREWERY\n\nEchoing. Dank. Amsterdam holds a candle high for light. RATS skitter. He\ncrosses the main floor, enters one of the side tunnels.\n\nCUT TO\n\n40 INT. ROOM/OLD BREWERY\n\nA tiny room we recognize from the first scene: this is the place where\nAmsterdam lived with his father. He crouches and TEARS UP some\nfloorboards, then quickly LOWERS HIMSELF into the hole.\n\nCUT TO\n\n41 INT. UNDER FLOOR/OLD BR.EWERY\n\nA short tunnel under the Brewery floor, the kind a kid might make.\nAmsterdam has trouble crawling through it. DIRT and ROCK sprinkle him\nuntil he finds what he wants stuck in a shallow hole; a battered leather\nMONEY PURSE; and a PAPER-WRAPPED PACKAGE.\n\nAmsterdam snaps open the purse to make sure the little bit of MONEY is\nstill there, then turns his attention to the package. He TEARS it open.\nInside is the PIRATE KNIFE that Bill the Butcher used to kill Amsterdam's\nfather.\n\nAmsterdam handles the knife carefully as he opens it. The candle light\nmakes the blade GLEAMS.\n\nCUT TO\n\n42 EXT. ALLEY/OLD BREWERY DAY\n\nA shock of summer SUNLIGHT as Amsterdam emerges from one of the back\nentrances of the Brewery onto a fetid alley filled with rotted barrels,\nbroken glass and insensible drunks.\n\nAmsterdam looks carefully up and down the alley, letting his eyes adjust\nto the bright light. Ahead of him, he SEES ...\n\nShang Draper, in jovial conversation with a SECOND MAN we do not\nrecognize. The man is bareheaded, and has a deep scar running back to\nfront clear down the center of his bald head. Amsterdam waits, WATCHES.\n\nShang takes the RED SILK SCARF he got from Jenny's swag and hands it to\nthe Second Man. He and Shang SHAKE HANDS, as if they have concluded a\nbusiness deal, and the Second Man walks away.\n\nAmsterdam PRESSES himself close to the door as Shang LOOKS AROUND...\ndoesn't see Amsterdam... and walks off in the opposite direction, across\nParadise Square.\n\nCUT TO\n\n43 INT- RECEPTION ROOM AND TWEED'S OFFICE DAY\n\nThe main room is as loud and as prosperous as the stock exchange. Bill the\nButcher makes his way past Small GROUPS of men engaged in heated political\ndealings of dubious virtue.\n\nBill knocks on the door to Tweed's private office while he's opening it.\nInside is Boss Tweed, seated in a large WOODEN BOX like a primitive sauna.\nAround him are various PETITIONERS, and his assistant Daniel Killoran.\n\nTWEED\nI dread city stimmers. They bring illness and beget vermin.\n\nPETITIONER #l (GLEASON)\nMy plague box fends off all pestilence. Its elixir combats ill humors...\n\nKILLORAN\nWe can't have every citizen of the Five Points boxed up like cargo.\n\nTWEED\nBut the season is vicious, and I must take thought of our constituents.\nMr. Gleason, I'd like you to shake hands with Mr. Barnett Baff...\n\nGleason, dubious, shakes hands with PETITIONER #2 as Bill the Butcher\nlooks on with amusement.\n\nTWEED\nA friend and owner of an estimable carting service. Work out an\narrangement whereby the citizenry can receive the benefit of Mr. Gleason's\nwondrous elixir outside this excellent box. At a cost, Mr. Gleason, of how\nmuch the barrel ...\n\nGLEASON\n(figuring rapidly)\nOh, perhaps twenty-five dollars.\n\nTWEED\n...and how much, Mr. Baff, for haulage and distribution...\n\nBAFF\nThe same again. At least.\n\nTWEED\nAt least. That's a price of fifty dollars. And greedy, low piracy at that\n(Gleason and Baff splutter)\nBut a price that Tammany, in its generosity, will meet. Merely submit a\nbill for a hundred. We'll each have half. And I'll retain this box for\nfurther experiment. Hello, Bill.\n\nKilloran LEADS the astonished Gleason and Baff away as Bill APPROACHES.\n\nTWEED\nBolt the door.\n\nBill complies. As Tweed speaks and the anti-plague VAPORS SWIRL around his\nhead, he keeps his eyes closed.\n\nTWEED\nScotchy Lavelle's gone wrong in his accounts.\n\nBILL THE BUTCHER\nI know. Scotchy's a good man.\n\nTWEED\nNot good enough to rake thirty percent of our share from Sparrow's and use\nit for his own.\n(opens his eyes)\nYou got to give him over, Bill.\n\nBILL THE BUTCHER\nI can't do that. No matter what he steals, I still get more from him than\nany two others. As do you.\n\nTWEED\nAlright then. What about Charles McGloin? He's running a panel game off to\none side. Did you know that?\n(Bill shrugs)\nI can't get a day's work done for all the good citizens pouring in here\ncomplaining about crime and corruption all over the Points. They accuse\nTammany of carelesoness. Some even suspect ... a few practically suggest.\n(eying Bill significantly) \n... our complicity with this rampant criminality. We must show them\nTammany stands behind the letter of the law. We need to set an example. \nBILL THE BUTCHER\n(beat)\nCharles McGloin will do.\n\nTWEED\nI'll set the trial for Friday.\n\nCUT TO\n\n44 EXT- TOMBS DAY\n\nCAMERA moves high along the outside wall, past small rectangular slits\nthat pass for jail windows. EYES peer out, as if a peep show is underway\ndirectly below in the Tombs courtyard. A PRISONER is being readied for the\ngallows by having a hood tied to his head.\n\nThe CROWD is in a carnival mood; HOT CORN GIRLS, STREET VENDORS,\n\"HOKEY-POKEY\" (i.e., ice cream) MERCHANTS, even BUSKERS, all add to the\nholiday spirit.\n\nJenny works through the crowd, pushing and smiling her way past groups of\nraucous merrymakers. She stops once or twice to have a word with a\nGENTLEMAN, flirts for a moment, then moves on.\n\nFurther back in the crowd, Amsterdam NOTICES her. He watches her go\nthrough the crowd with an admiration that quickly turns to FASCINATION as\nhe realizes what she's doing: picking pockets. The best bludget in the\nFive Points. He starts to FOLLOW her.\n\nJenny has worked her way close to the hanging platform, but she's so\nintent on her job she has not noticed Amsterdam. The closer the platform,\nthe closer the spectacle and richer the pickings: Jenny's concentration is\nabsolute. On the platform, an ASSISTANT HANGMAN addresses the Crowd.\n\nASSISTANT HANGMAN\nThose interested in the effects of the condemned please come forward.\n\n44 CONTINUED:\n\nPart of the Crowd PRESSES in toward the platform, temporarily blocking\nAmsterdam's view of Jenny. He is right against the platform.\n\nASSISTANT HANGMAN\nWhat am I bid for this coat? A coat of some wear but excellent cut...\ncontaining a rather remarkable pocket silk...\n\nMAN IN CROWD\nBid a quarter!\n\nHANGMAN\nA quarter, thank you. Do I hear fifty cents? Fifty cents?\n\nThe Hangman is holding up the condemned man's coat which contains the RED\nSILK SCARF Amsterdam saw Shang give away. Amsterdam flips the HANGMAN a\nquarter, reaches out and GRABS the handkerchief.\n\nAMSTERDAM\nHere. Just for the silk.\n\nHe stuffs it into his pocket and starts to PUSH his way through the crowd.\nOn the platform, the WARDEN steps forward holding a primitive megaphone.\n\nWARDEN\nDo you have any last remarks, Charles McGloin?\n\nMcGloin grunts from underneath the hood.\n\nMCGLOIN\nNot from under this hood I don't.\n\nCrowd near the platform begins to CHANT \"No hood, no hood, no hood!\" The\nWarden puts his hand on the hood, starts to remove it...\n\n... and the Crowd CHEERS. Amsterdam turns, SEES: Charles McGloin. Bald,\nwith a deep scar running front to back on his head. The very SAME MAN he\nsaw in the alley with Shang.\n\nMcGloin acknowledges the cheers of the crowd. The Warden holds to\nmegaphone close and McGloin bellows...\n\nMCGLOIN\nI never struck a foul blow or turned a card and may God greet me as a\nfriend!\n\nThe Crowd ROAR approval at these words. Amsterdam PUSHES through the\ncrowd, looking for Jenny ... SPOTTING her finally...\n\n... while up on the platform, the NOOSE is placed around McGLOIN's neck,\nand he is HOISTED UP in no time. We hear his neck SNAP. His feet kick\nafter death. The Crowd raises a zighty cheer.\n\nCUT TO\n\n45 EXT./INT. BROADWAY AND BROADWAY STAGE DAY\n\nAmsterdam walks with a crowd toward a waiting Broadway stage, a vehicle\nthat looks like a horsedrawn train car. The stage will take spectators\nback uptown from the hanging.\n\nHe is working his way toward Jenny, who is now BOARDING the stage.\nAmsterdam DASHES through the crowd and SQUEEZES onto the stage, which\nmoves forward with a JOLT.\n\nOnce on board, Amsterdam looks through the jammed car, SEES: Jenny, about\nto sit down - A MAN has offered her his seat. She smiles dazzlingly as she\nsits...\n\n... and arranges her hands genteelly on her lap. The Man looks down on her\nand she smiles up at him again. He is bequiled.\n\nAmsterdam manages to get a little closer.\n\nMAN\nI hope you won't think me rude if I speak.\n\nJENNY\nNo, sir. You look a proper Gentleman down to the ground.\n\nAs this conversation continues, we watch-not only Jenny and The Man in\nconversation, and Amsterdam watching them; but we begin to notice what\nAmsterdam SEES. Although Jenny's hands apparently remain folded on her\nlap, her RIGHT HAND moves SLOWLY out from her wrap... toward The Man...\n\nMAN\nWell, I wouldn't want you to think me forward, you see.\n\n... and BRUSHES past his jacket. He does not notice or feel a thing.\nJenny's hand GLIDES past his THIGH ... nearly brushing it ... moving up\nacross his pelvis and around his buttocks...\n\nJENNY\nDoes it matter to you what I think?\n\nMAN\nWell, I might like it to.\n\nJENNY\nOh.\n\n...toward his pocket. The Man is in Jenny's thrall. He feels nothing and\ncontinues to have no idea what is going on. But Amsterdam KNOWS. Every\nsilken, surreptitious move of her HAND across The Man's body is like a\nCARESS that Amsterdam can feel. Jenny's grace is balletic and EROTIC. As\nshe picks The Man's pocket, she is, without knowing it, also seducing\nAmsterdam\n\nMAN\nI mean, if you would like.\n\nJENNY\nI might like, sir. But I can't say now.\n\nHer hand HOVERS above his pocket, waiting for the SWAY of the stage to\nmatch and mask her movement....\n\nMAN\nWhy?\n\n... and she starts to get up as soon as the stage JOSTLES. The entire car\nfull of passengers LEANS into one another...\n\n... and Jenny's hand SLIDES the Man's WALLET from his trousers as\n\nhe recovers his balance. Amsterdam watches her withdraw her HAND in a\nflash and hide it beneath her wrap.\n\nJENNY\nBecause this is my stop.\n\nMAN \nMay I walk with you a little, then? \nJENNY\n(firmly)\nThat would be too bold.\n\nMAN\nBut I'll never see you again.\n\nJENNY\nI come every Thursday to the Tombs to see my father.\n\nMAN\nI'll look for you.\n\nJenny fetches him another fine SMILE--it's almost demure--and takes her\nway off the rear entrance of the stage.\n\nlt PULLS AWAY up Broadway and Jenny walks briskly toward an alley.\n\nCUT TO\n\n46 EXT. ALLEY/BROADWAY DAY\n\nJenny looks to make sure she has the alley to herself, then moves her body\na little...\n\n... and her arms seem to come off. She has been wearing a set of\nARTIFICIAL ARMS, hollow inside, which she can leave folded on her lap\nmisleadingly while she goes about her pickpocketing.\n\nShe's folding up the appliance--cotton sewn over a soft form-when a VOICE\nbehind her makes her turn.\n\nAMSTERDAM\nMay I walk with you a little, then?\n\nCUT TO\n\n47 EXT. BROADWAY DAY\n\nAs Jenny and Amsterdam walk through the noisy bustle of the city's main\nthoroughfare.\n\nJENNY\nAre you a spy, then?\n\nAMSTERDAM\nGot no one to spy for. I'm an appreciator, you might say.\n\nJENNY\nAppreciator of what?\n\nAMSTERDAM\nA good touch.\n\nShe STOPS in the street, looks him straight in the eye.\n\nJENNY\nDon't bother with the chat. If you want me, we come to a business\narrangement. lf the terms is right, then I decide how you suit me. Then I\ndo it or not.\n\nAMSTERDAM\nJust take a minute, I was Just...\n\nJENNY \nI know what you was just. I had years already of what you was just. You\nknow how I got so good at thieving? So's I wouldn't have to lay down for\neveryone who had the ned. Now I do it when I want to for how much I want\nto. Otherwise I don't do it, and don't have to do it, and to hell with\nanyone's rules but my own. \nAMSTERDAM\nWhat about Shang's rules? You pay a lot over to him. The better your day,\nthe better his. It don't seem gute right.\n\nJENNY\n(a little curious now)\nWhat's it to you?\n\nAMSTERDAM\nGive him this.\n\nHe hands her the RED SILK SCARF. She recognizes it instantly as the same\none she gave Shang.\n\nAMSTERDAM\n\nAnd you can keep a little more of what you earned.\n\nJENNY\nHow'd you come by this?\n\nAMSTERDAM\nI got my own touch.\n\nJENNY\nAre you making me a present, or making an Arrangement?\n\nAMSTERDAM\nIt's your rules, right? So you decide.\n\nShe looks at him for a moment, then starts to TIE the scarf around her\nneck like a kerchief.\n\nCUT TO\n\n48 INT. HIDEOUT\n\nA gentlemen's WALLET skims across a pitted wooden table, straight into\nShang's hand. Jenny is giving him her CUT. He opens the wallet, looks up\nat Jenny. No more goods are forthcoming. Amsterdam, hanging back, watches\nthem both.\n\nShang SEES the RED SILK SCARF, tied around her neck.\n\nSHANG\nPretty slim cut for a hanging day. Where'd you get that?\n\nJENNY\nFrom Amsterdam.\n\nSHANG\n(beat)\nIt don't suit you.\n\nCUT TO\n\n49 EXT. STREET AND PARADISE SQUARE NIGHT\n\nA SWELTERING evening. The streets are jammed with REVELERS and RESIDENTS.\nSome people sleep in doorways in futile search for fresh air. Happy Jack\nMulraney leads a group of apprehensive UPTOWN CITIZENS past drunks and\nwhores.\n\nJACK\nCommissioner Brunt said to spare you nothing concerning conditions.\n\nCITIZEN\nNothing but our safety, of course.\n\nJACK\nAll's snug around Paradise Square in my company, squire. See there.\n\nHe gestures toward the street, down which one oi Mr. Barnett Baff's CARTS\nis being drawn by a team of WHEEZING NAGS.\n\nThe cart bears massive barrels of what a colorful banner advertises as \"an\nanti-pestilence influenza-thwarting solution... a service of Tammany\nHall.\" As the wagon draws abreast of a large group of languishing\nRESIDENTS, HOSES spurt waves of solution all over the streets. Many people\nare SOAKED. Jack and his Citizens jump back just in time.'\n\nJACK\nTammany makes the streets nanitary, I make 'am safe.\n\nWOMAN CITIZEN\n(apprehensive)\nEven against them?\n\nA small distance behind the anti-plague cart, moving in rough formation,\ncome some of Shang's mob, heading aimlessly across the Square cruising for\naction\n\nJACK\nAgainst them especially. Let me demonstrate.\n\nJack takes out his GOLD WATCH AND CHAIN, which he HANGS carefully over a\nnearby lamppost. Then, very casually, he leads the Citizens off.\n\nJACK\nWe'll be back for this at our leisure.\n\nWOMAN CITIZEN\nYou dare leave it here?\n\nJACK\nSafe as a vault, lady. Since all knows it's mine.\n\nThe Gang draws abreast of the lamppost. No one makes a move to take the\nwatch until one of the YOUNGEST BOYS reaches out ... but\n\nShang knocks his hand away. Jack, at a distance, NODS approvingly.\n\nSHANG\nYou know that's Jack's.\n\nBOY\nSo what?\n\nAMSTERDAM \nIt should be hangin' off Jack's vest, then. Not here, like some war flag. \nSHANG\nThat watch is a small price for free run of the Points.\n\nAMSTERDAM\nIf it's free, how come we pay so much? Wo shouldn't pay for what's our due.\n\nSHANG\nWe don't tight when we don't have to. It's not warring that counts. It's\nthe living day to day.\n\nANSTERDAM\n(smiles)\nIs that right? Did I hear that correct? John, did we hear that correct?\n\nEyes now on Johnny. Jenny looks at him with great interest.\n\nJOHN\n(uneasy pause)\nWe heard the same.\n\nAMSTERDAM\nSo then.\n\nHe reaches for the watch.\n\nCUT TO\n\n50 EXT. STREET AND PARADISE SQUARE NIGHT\n\nHappy Jack stands at the lamppost, aghast. A WOMAN lowers her head and\nretches. Jackls watch and chain are still in place.\n\nBut the watch has been SMASHED. And hanging from the chain is a BLACK CAT,\nskinned and strangled.\n\nCUT TO\n\n51 INT- HIDEOUT\n\nHappy Jack stands with his Citizens. The room QUIETS as, one by one, the\nmob notices him.\n\nJACK\nYou!\n\nHe GRABS the Young Boy who had reached for his watch on the lamppost and\nstarts to BEAT him.\n\nJACK\nWhat'd you do to my watch, you dirty little bastard...\n\nJack breaks the Boy's hand with his nightstick. The Boy SCREAMS\n\nand FAINTS. So does one of the Women in the group. Jack takes the Boy's\nother hand.\n\nJACK\nHands won't be so quick in future.\n\nSHANG \nThat's enough sport this evening, Jack. \nJOHNNY\n(stepping forward)\nIt wasn't him.\n\nAll turn to look at Johnny. Jack drops the Boy's hand.\n\nJOHNNY\nI have word for you from who did it. You're to meet him at Sparrow's\nChinese Pagoda.\n\nCUT TO\n\n52 INT. SPAPROW'S CHINESE PAGODA NIGHT\n\nA low and lunatic place: a combination of an opium dream out of the\nArabian Nights and a panel from a Bosch triptych. FAN-TAN games played by\nOrientals; WOMEN and CHILDREN of various colors suspended in cages from\nthe ceiling as MEN and WOMEN in a secondfloor GALLERY point at them and\nJOKE. On the main floor, a long line waits for a shot at the barrel of\nAll-Sorts. Jack charges in the front door, looks around.\n\nJACK\nAll right, step out, you yellow...\n\nAll the NOISE subsides. Only the Fan-Tan game continues;\n\nnothing is so interesting that these Orientals will stop gambling.\n\nNow Amsterdam STEPS right in front of him. It's a grandstand play.\n\nAMSTERDAM\nHello, Happy Jack. I'm the one you're looking for.\n\nJACK\nThen you're marked for dead.\n\nJack lunges ahead, swinging his NIGHT STICK. Amsterdam throws a chair\nacross his path. Jack stumbles, goes down, dropping his night stick.\nAmsterdam grabs it, jumps on top of him, HITS him twice on the side of the\nhead. There is a CRACKING SOUND. The PATRONS of the Pagoda gather round.\n\nCUT TO\n\n53 INT. SPARROW'S CHINESE PAGODA NIGHT\n\nLater. Festive again. And no sign of Amsterdam.\n\nTwo PATRONS step away from the all-sorts barrel. Hanging from the spigot\nlike the cat from the watch chain is the BODY of Happy Jack Mulraney. The\nbelt has been removed from his trousers, tied like a NOOSE around his\nthroat, then looped over the spigot. His TEETH lie scattered on the floor\naround him. His NIGHT STICK has been jammed down his throat.\n\nCUT TO\n\n54 EXT. DOCKS/HIDEOUT NIGHT\n\nAmsterdam holds the FANCY COAT from Jack's uniform over his arm.\nCarefully, he DRAPES the coat over Jenny's shoulders. SHANG steps forward.\n\nSHANG\nI gave no order for this.\n\nAmsterdam says nothing at first, just holds his hand out: he's holding the\nRED SILK SCKRF.\n\nAMSTERDAM\n(very quietly) \nNever mind giving orders. What were you giving this for? \nSHANG\nI'm calling you out, Amsterdam.\n\nAMSTERDAM\nI got this at the hanging. It was Charles McGloin's. Everybody here saw\nyou take it from Jenny. What was MCGloin doing with it? What'd you give it\nto him for?\n\nSHANG\nI didn't give it to him. Why would I give it to him?\n\nAMSTERDAM\nI gaw you give it to him. Last week, behind the Old Brewery.\n\nSHANG\n(to group)\nHe's gone flat. I got no reason to trade with the Native Americans.\n\nAMSTERDAM\nWhat about stepping up in the world, as it were, and leaving the rest of\nus behind. There's a reason. Making a separate arrangement for yourself\nwith the one Native so stupid and luckless that he got hung. That's you to\nthe ground, Shang.\n\nSHANG\n(very edgy now; to group)\nWho believes what he's saying? Can any of you believe what he's saying?\n\nAMSTERDAM\nBene. We'll see. Any of you that believes I did proper by Happy Jack\nMulraney tonight, stand beside me. Any of you that still likes Shang's way\nwith the cops, and Shang's way with the Natives, go to him.\n(to Shang)\nOr should we settle right now, you and me, and just see which of us is\nleft standing?\n\nSHANG\nLet see where they stand.\n\nJenny rises, stands next to Amsterdam. Jimmy Spoils, Johnny, Sheeny Mike\nare next. Now the other members of the mob move in clusters to all STAND\nwith Amsterdam.\n\nAMSTERDAM\nWhat's your pleasure, Shang?\n\nOne of the YOUNG BOYS has a dead rat blackjack hanging from his belt.\nShang grabs it. He BITES the head oft the rat and spits it across at\nAmsterdam. Amsterdam almost smiles at him. Shang sneers, drops the body of\nthe rat, and LEAVES.\n\nAMSTERDAM\nThis mob ever have a proper name?\n\nJOHNNY\nWe was called after Shang when we was named at all.\n\nAMSTERDAM\nWe're the Dead Rabbits from now. They were the best. They were history.\nThey were legend, and we'll live up to them.\n\nCUT TO\n\n55 EXT. DOCKS/WATERFRONT NIGHT\n\nAmsterdam sits on an empty pier, watching the ships in the river. There's\na SUDDEN RUSTLING NOISE as a NOOSE coils around his neck.\n\nIt's Jenny. She's slipped the SILK Amsterdam gave her close to his throat,\nand she's TIGHTENING it. Amsterdam starts to resist. Then he sees how's\nshe's looking at him.\n\nShe uses the silk to bring his face closer to hers. She KISSES him.\n\nAMSTERDAM\nWhat's this then?\n\nJENNY\nPayment for the silk.\n\nThen DROPS the silk from his throat and starts to touch him. Then his\nhands are under her skirt. Then, under the cloudy moonlight, they start to\nmake love.\n\nCUT TO\n\n56 EXT. DOCKS/WATERFRONT NIGHT\n\nLater. Amsterdam pulls Happy Jack's uniform COAT over Jenny to keep her\nwarm in the chill air.\n\nJENNY\nYou were waiting for me out here, weren't you?\n\nAMSTERDAM\nMaybe I was, yeah.\n\nJENNY\nYou was that sure of me?\n\nAMSTERDAM\nSure enough to wait, anyway. Waiting don't cost nothing.\n\nJENNY\nIt don't do to be sure. I could go away just as easy.\n\nAMSTERDAM\nAlright.\n\nHe sweeps the coat away from her body, allowing her to leave.\n\nJENNY\nI'll say when I want to, not you.\n\nAMSTERDAM\nStay then.\n(beat; smile)\nOne way or another, I get what I want.\n\nJENNY\n(looking at him)\nYeah. If it was just a shag you wanted.\n\nAMSTERDAM\nYou're a gypsy, are you, come to tell my fortune? Go ahead then. Tell me\nwhat I'm wanting.\n\nJENNY\nYou got blood in your eye for someone.\n\nAMSTERDAM\nIt's just I can't look away, that's all.\n\nJENNY\nWho from?\n\nAMSTERDAM\nBill Poole.\n\nJENNY\nYou better get someone else in your sights. No one's ever taken him.\n\nAMSTERDAM\n'Cause he's mine, that's why. I'll take his one eye, and then the rest of\nhim, piece by small piece.\n\nJENNY\nYou have a plan for this? You going to raise a militia? I'll wager Bill\nthe Butcher don't even know about you or care if he does.\n\nAMSTERDAM\nHe'll know about me soon enough.\n\nJENNY\nAnd after the Butcher?\n\nAMSTERDAM\nYou.\n\nJENNY\nIs that so?\n\nAMSTERDAM\nYou'll be in love with me.\n\nJENNY\nLove you? You just had me. You can have a mort any time you want. So why\nlook for more than that.\n\nAMSTERDAM\nThat's taking love, not giving it. I want it to be just you and me, no one\nelse for either.\n\nJENNY\nWhy?\n\nAMSTERDAM\n'Cause none of us means nothing in life except one to the other.\n\nJENNY\nI don't know I want to mean something, to you or anybody. Can there be\ngood in that?\n\nHe stares at her.\n\nAMSTERDAM\nWe'll see.\n\nJenny pulls the coat tighter around her.\n\nJENNY\nIt'll take a while if we do. If we ever do.\n\nAMSTERDAM\nAnd what about the meantime?\n\nJENNY\nMeantime's business.\n\nCUT TO\n\n57 EXT PARADISE SQUARE DAY\n\nA CROWD gathers in one of the main thoroughfares bisecting the 5 Points. A\nbeefy SPEAKER is making an anti-Irish speech on behalf of James W. Barker,\na mayoral candidate supported by Tammany's current rivals, the\nKnow-Nothing Party. Hand-painted signs are everywhere, bearing Barker's\nunsavory likeness. A couple of BUSKERS provide a musical score for the\npolitical spiel.\n\nSPEAKER\nThe potato is a thick vegetable. Heavy. Meaty. Comes out of the ground\ndirty and stays that way unless you scrub it and boil it to death!\n(cheers and laughs from crowd)\nWe don't want to keep lem out of the country! We'll even give 'em a place\nat our table! But we ain't gonna vote 'em into office.\n\nMuch CHEERING and jovial approval from the Crowd. On its fringes,\nAmsterdam and the Dead Rabbits make their way roughly across the Square.\n\nSHEENY MIKE\nAny Irish hears that will be out for blood.\n\nAMSTERDAM\nThe Irish is too busy building up Tammany. That's where their brains and\nmuscle goes. Once they're inside with their cronies, they turn on their\nown outside. Tammany'd steal the air and rent the daylight if they could.\n\nSHEENY MIKE\nWe'd do the same.\n\nAMSTERDkM\nNot against our own we wouldn't. That's the difference.\n\nJOHNNY\nTammany earns better. That's the difference.\n\nAMSTERDAM\nI ain't seen their ned yet.\n\nJohnny stops walking, betraying slight annoyance that he has to explain\nthe day's deal.\n\nJOHNNY\nYou will at day's end, that's our arrangement. A quarter a voter, whether\nthey're repeaters or not. I'm telling you, we got a square deal.\n\nSHEENY MIKE\nIt's sound, Amsterdam.\n\nAMSTERDAM\nYeah? Well, it's ned anyway. Just make sure you count it when we get it.\n\nJOHNNY\nIt's just a day's job, we don't have to make it a life's work. We work for\nTammany today and kill them tomorrow, if that's our pleasure.\n\nJIMMY SPOILS\nSo we're politicians just for today.\n\nAMSTERDAM\nNot for a minute. We're better than that. We're thieves.\n\nCUT TO\n\n58 MONTAGE\n\nThe Dead Rabbits go about the business of rounding up Tammany voters. They\npick up DRUNKS in alleys; Jenny and some of the Dead Rabbit MORTS raust\nPATRONS in a whore house; Rabbits shanghai SAILORS from saloons; corral\nCITIZENS as they walk along the street, either wheedling or bullying to\nget them to vote. It's the strong arm of democracy.\n\nCUT TO\n\n59 EXT. POLLING PLACE DAY\n\nOn one side of the door, some Dead Rabbits, with a RABBLE of potential\nvoters; on the other, POLICE doing their best. Behind and all around,\nvarious WARD HEELERS and SMALL-TIME POLITICIANS, representing both the\nKnow-Nothing candidate Barker and Tammany's Fernando Wood. Varicus\nfactions push and pull at one another as they wedge their VOTERS into the\npolls.\n\nJIMMY SPOILS \nHe's got the right to vote, damn you! \nCOP\nNot four times he don't.\n(shoves a Voter)\nThere'll be no damned repeaters here!\n\nThe Cop and Jimmy play tug-of-war with a besotted VOTER, while other gang\nmembers rush to GRAB VOTERS leaving the polls.\n\nPANDEMONIUM.\n\nCUT TO\n\n60 INT. TAMMANY HALL DAY\n\nThe main floor is jammed with CLUBMEN and PARTY RACKS. Daniel Killoran\nbustles from group to group, making promises, taking notes and searching\nout Boss Tweed, who is holding court in a far corner, surrounded by\nJOURNALISTS.\n\nBOSS TWEED\nI would never speak ill of a rival. I would never say that every\nKnow-Nothing is a horse thief. It is my observation, however, that every\nhorse thief is a Know-Nothing.\n\nGood-natured LAUGHING all around. Even TWEED seems amused. Killoran\ncatches the Boss' eye and whispers to him.\n\nKILLORAN\nThe Know-Nothings are already finished, and there's four more hours at the\npolls yet.\n\nBOSS TWEED\nKeep our men voting. Everybody works today. It's not a victory we need,\nDaniel. I want a triumph.\n\nCUT TO\n\n61 INT. DON WHISKERANDOSO BARBER SHOP DAY\n\nAmsterdam roughly deposits REPEAT VOTERS in the barber chairs, as the\nBARBERS work FRANTICALLY to cut their hair, prune beards, and otherwise\nalter appearances. As soon as one customer is done, Sheeny Mike douses him\nwith bay rum and pushes another REPEATER down in his place. Johnny keeps\ncount of the turnover.\n\nDON WHISKERANDOS (BARBER)\n\nNow that's eight... and how many still to come ...\n\nHe looks toward the door, where more Repeaters are lined up, waiting their\nturn under close supervision.\n\nREPEATER\nI already voted once today. Cast for Tammany, by God, and Fernando Wood.\n\nAMSTERDAM\nOnce? Come here and do your duty.\n\nAmsterdam GRABS him and SLAMS him down in a chair.\n\nCUT TO\n\n62 INT. FAN-TAN PARLOR DAY\n\nAmsterdam and some RABBITS BURST into the front door, frightening and\nscattering all the Chinese GAMBLERS.\n\nAMSTERDAM\n(barking orders)\nLine up like soldiers!\n\nSHEENY MIKE\nThey got no notion what you're talking about.\n\nAMSTERDAM\n(To Johnny)\nYou explain their democratic right. Illl see they unterstand.\n\nAmsterdam GRABS the nearest two CHINESE by their PIGTAILS and\nHURLS them against the wall.\n\nCUT TO\n\n63 INT. OPIUM DEN\n\nAmsterdam and the Rabbits PROWL the murky darkness where OPIUM EATERS lie\nin bunks stacked high against the walls. The Rabbits start ROUSING and\nrounding up the Opium Eaters. Jimmy Spoils SLINGS a couple over his\nshoulder like flour sacks. Amsterdam SHOVES two more out the door, past an\nadmiring Daniel Killoran.\n\nKILLORAN\n(to Johnny)\nI come to see if our counts square. You boys have made a remarkable\nshowing....\n\nAMSTERDAM\nWho the hell's this?\n\nJOHNNY\nHe's our Tammany man.\n\nKilloran compares his figures to the piece of paper where Johnny has been\nkeeping his own count.\n\nKILLORAN\n... remarkable...\n\nAMSTERDAM\n(With an edge)\nOur own Tammany man. We are coming along. Happy to meet any friend of\nJohnny Siroccols.\n\nKILLORAN\nLikewise. Pleasure to meet the best but one in the whole Five Points.\n\nAMSTERDAM\nBest but one? Who's better?\n\nKilloran looks up. Johnny, standing behind Amsterdam, SHAKES his head \"NO\"\nVIGOROUSLY. Killoran gets the message.\n\nKILLORAN\n(smooth)\nMaybe nobody. But when the count's done the numbers will tell who's come\nout in front.\n\nAMSTERDAM\nI'm in no race. Just pay us what you owe.\n\nKILLORAN\nTonight. At the victory celebration.\n\nCUT TO\n\n64 INT. SPARROW'S CHINESE PAGODA\n\nA Tammany victory celebration. When we last saw this place--as Amsterdam\nconfronted Happy Jack--the place was busy, alive. It's RIOTOUS now, jammed\nto bursting with POLITICIANS, CRIMINALS, GANG MEMBERS, MORTS, WHORES,\nHANGERS-ON, UPTOWN THRILL-SEEKERS, JOURNALISTS and COPS, not all of them\noff duty. The SOUND of the place is a cacophony of SHOUTING, SINGING,\nGAMBLING and STRANGE MUSIC--which we can't identify at first. We START\nCLOSE on a huge ruby ring and we HEAR...\n\nBOSS TWEED\n(V.O.)\nRead what it says there, alongside the ruby...read it out ...\n\n... and WE MOVE OUT as a WELL-WISHER reads the Latin inscription.\n\n64 CONTINUED:\n\nWELL-WISHER\n\"Fortuna Juvat Ordentes.\"\n\nTWEED\nA grand victory gift from the men of Tammany. Now, tell 'em what it means,\nMayor Wood.\n\nWOOD\n\"Fortune favors the bold.\"\n\nTWEED gives him a resounding slap on the back.\n\nBOSS TWEED\nWhat do you think? Would that make a fit motto for our fair City?\n\nWOOD\nWell, I could certainly see ...\n\nKILLORAN\n(interrupting)\nWe've got a motto.\n\nBOSS TWEED\nwhat is it?\n(no one knows)\nWell, hell, let's get one we can remember. We're going to build a new City\nhall, we better have something to put over the front door. And Mayor,\nyou'll make sure the Latin's right?\n\nAs Wood nods his assent, CAMERA MOVES across room...\n\n... past the gilded CAGES suspended ten feet over the floor, where the\nwomen and children look down at the action just below them with a mixture\nof trepidation and resignation. Occasionally a REVELER will jump up to try\nand GRAB one of the caged inhabitants. Still MOVING, CAMERA...\n\n... passes a stage, where we finally SEE the source of all the strange\nMUSIC we've been hearing: the music is provided by\n\nCHINESE MUSICIANS, a woman SINGER, a DANCER and some ACROBATS. They\nperform some weird, mangled Five Points version of Chinese opera. The\nmusic and performance continues as we MOVE PAST...\n\n... across a PEWTER FAN-TAN TABLE, where CHINESE GAMBLERS play with fierce\nanimation and concentration. By comparison, the Occidental types playing\nbeside them seem like tourists.\n\nEveryone SHOUTS and SCRAMBLES to place bets with the FAN-TAN DEALER.\n\nAbove the Dealer is an oval opening in the ceiling, through which OTHER\nPLAYERS may watch the action below. These FAN-TAN PLAYERS lean over an\nelegantly carved rail, peering at the action on the table below, placing\ntheir bets and collecting their winnings by means of a BASKET attached to\nWIRES that whirrs constantly overhead. We continue to MOVE PAST...\n\n... until we are at the door of the place, where Amsterdam, Johnny and the\nRabbits are having words with a BOUNCER.\n\nBOUNCER\nI don't know you, you don't enter.\n\nAMSTERDAM\n(enjoying himself)\nCome on, what are you saying? If you don't know us now, you'll know us\ntomorrow and you'll be working for us next week.\n\nJOHNNY\n(more temperate)\nDaniel Killoran knows us.\n\nBOUNCER\nOh he does?\n\nJOHNNY\nWe work for him.\n\nAMSTERDAM\nThe hell we do.\n\nJOHNNY\n(to Amsterdam)\nTampen down, will you?\n\nBOUNCER\nWhy don't you all get the hell out of here and go fix on a story? Go on!\n\nHe SHOVES Johnny, who STUMBLES back into Amsterdam. They're both mad now,\nand they step forward together toward the Bouncer...\n\n... until Killoran intervenes.\n\nKILLORAN\n(to Bouncer)\nIt's all right, Nat. They're saying the truth. They gave a good day's work\nfor a good wage.\n\nKilloran HANDS OVER a paper-wrapped parcel of money, which Amsterdam takes\nfirmly.\n\nKILLORAN\nA fine first showing. But second best.\n\nAMSTERDAM\nSecond, eh? You don't say so.\n\nKILLORAN\nIt's no shame to be bested by veterans. The Native Americans always sweep\nthe field.\n\nAMSTERDAM\nWhat?\n\nKILLORAN\nWe count on them sure as mass comes an Sunday.\n\nAMSTERDAM\n(to Johnny, glaring)\nDid you know this? Is this some scheme of yours?\n\nJOHNNY\nNo, I didn't have no idea ...\n\nAMSTERDAM\nI was working the same side as the Natives? The Natives?\n\nKILLORAN\nThat's only right. Bill the Butcher's our ambassador throughout the\nPoints, as you might say. It's deemed an honor to work with him. Everyone\nknows Bill Poole, everyone fears him, everyone ...\n\nAMSTERDAM\nI sure as hell don't fear him. And I sure as hell won't stand with him, or\nany who calls him one of theirs.\n\nKILLORAN\nWell, if it's matter of personal honor, the money can only be a further\ninsult. I have no wish to rile you further, so if you'll allow me...\n\nHe REACHES to take back the parcel of money, but Amsterdam BATS his hand\naway.\n\nAMSTERDAM\nWhere is he? Where's Bill the Butcher?\n\nKILLORAN\nListen, buck. This is a Tammany night. If you and Bill Poole have matters\nto settle, you can do it any other time, any other place, I don't give a\ngood dancing goddamn. But you do it here tonight and all the Five Points\nwill be down on you like the righteous wrath of heaven. or you could, as\nthe Book says, put away childish things. Join the celebration. Personally,\nI always find the least strenuous solution the most appealing. Don't you?\n\nAmsterdam stares at him as we...\n\nCUT TO\n\n65 INT. SPARROW'S CHINESE PAGODA\n\nAs a CHINESE ACROBAT TWIRLS in the air, off the stage, and lands in the\nmiddle of the audience. The crowd is raucously appreciative as the Acrobat\ndoes GYMNASTIC MOVES among them...\n\n... past a table where the Dead Rabbits have settled. it is later in the\nevening, and everyone has been drinking.\nAmsterdam, sullen, intense, WATCHES ...\n\n..Bill the Butcher, across the room. He is like a prince regent. Everyone\npays him court, including several uniformed COPS, TAMMANY HANGERS-ON, and\nNEWSPAPERMEN. Bill receives the attention as his due....\n\n... while Amsterdam keeps watching, contempt and hatred gleaming in his\neye. He pays attention to none of the gang around, including Jenny. Johnny\ntakes advantage of the situation.\n\nJOHNNY\nI got experience. It's the education I lack.\n\nJENNY\nAnd you heard I was a good teacher?\n\nJOHNNY\nI don't listen to talk, I figure for myself. And I figured you'd be good\nat everything you did.\n\nJENNY\nThat's right.\n\nJOHNNY\nAnd tonight I got the ned.\n\nJENNY\nAnd now what?\n\nJOHNNY\nNow I'm ready for you. Unless there's an arrangement between you and\nAmsterdam.\n\nJENNY\n(glancing over at Amsterdam)\nNot to my thinking.\n\nJOHNNY\n(needs to be sure)\nAmsterdam... listen up, Amsterdam...\n\nAmsterdam glances over at them.\n\nJENNY\n(to Johnny)\nYou going with me or him? It's my thinking matters here. You don't have to\nask him nothing.\n\nAMSTERDAM\nWhat?\n\nJOHNNY\n(makes his decision)\nHow's the evening passing?\n\nAMSTERDAM\nFine. Why?\n\nJOHNNY\n(puts his arm around Jenny)\n'Cause it's treating me fine too.\n\nShe gets up and starts toward the stairs to the second floor, Johnny\nfollowing her, holding her hand. As they pass Amsterdam he LEANS toward\nJenny.\n\nAMSTERDAM\nThis is no game, you and me. Don't go on like it's a game.\n\nJENNY\nI said already, it's not a game. It's business.\n\nJohnny pulls her away. As he watches her go through the crowd, Amsterdam's\ngaze falls on Bill the Butcher again...\n\n... and for the first tine their EYES MEET. Bill's eyes rest on Amsterdam,\ntake him all in... but DON'T REMEMBER him. He looks away as a TAMMANY HACK\nsteps up to pay court....\n\n.... and a MASTER OF REVELS, center-floor, SHOUTS ...\n\nMASTER OF REVELS\nGentlemen and gentlewomen, if you please ... we will now... raise the\ncages and start the bidding!\n\nThe Crowd CHEERS and KIDS PULL on a series of ropes and pulleys to RAISE\nthe CAGES further above the floor until they are parallel with the\nsecond-floor gallery of the Pagoda. WOMEN AND MEN call out BIDS even as\nthe cages rise through the air. Depending on their age, the Women and\nchildren inside the cages respond to the auction with grim resignation,\ntrepidation or fear. A few, drugged or drunk on all-sorts, lie insensible\nin their impossibly cramped space.\n\nJohnny and Jenny make their way along the second floor gallery until she\nspots a COUPLE LEAVING a room and walks inside. Johnny CLOSES the door\nbehind them as a BURST of APPLAUSE...\n\n... rises from the main floor, where Bill the Butcher stands in the dead\ncenter of the room. He slowly removes his coat and hands it to a FLUNKY.\nHe is wearing his battle vest underneath, and it is fully rigged with all\nhis butcher's implements.\n\nThe place QUIETS. KIDS swarm silently, like busy ants, all over a huge\nwooden CHANDELIER, LIGHTING its HUNDREDS of CANDLES. Only the noise from\nthe Chinese playing fan-tan in the far corner of the room can be heard now.\n\nThe Kids finish lighting the candles and the chandelier is RAISED toward\nthe Pagoda ceiling, casting the whole place into a new riot of LIGHT and\nSHADOW as The Butcher prepares himself.\n\nNow the Chinese Opera DANCER steps forward and stands near Bill. He NODS.\nThe unsprung MUSIC begins. The DANCER starts to move, sinuously...\n\n...and Bill, with amazing skill, starts THROWING his KNIVES. The knife\nMISSES the Dancer by a hairsbreadth, landing in the floor near her foot.\nShe doesn't flinch. She keeps dancing. And Bill keeps THROWING...\n\n... the KNIVES, which follow the Dancer around the room in a careful,\ndeadly choreography. They land just inches from where she has just been,\nor will be: in a wall; a pillar; the apron of the small stage; the bar;\nthe barrel of all-sorts. After each knife LANDS, kids retrieve it. When\none of the KNIFE KIDS pulls the blade from the all-sorts barrel, DRUNKS\nknock each other over to drink from the stream that flows from the hole.\n\nNative Americans, meanwhile, WORK THROUGH the awed, attentive Crowd. They\nAVOID Cops, Tammany Members and anyone who looks too prosperous or too\nsober. But when one of the Natives SPOTS a MARGINAL CITIZEN, they GRAB his\nhand and examine it as if they were telling fortunes.\n\nCenter floor, Bill pulls TWO KNIVES out, BALANCES one in each hand ...\n\n... as a WHORE in the crowd pushes a guy who's groping her toward a couple\nof Natives. Hels wearing a large RING. As soon as the Natives SEE the ring\nthey throw their arms around the GROPER like a long-lost pal and escort\nhim to Bill ...\n\n... who THROWS both knives rapidly at the Dancer. They land on the floor,\ninches from her dancing feet. She SPINS AWAY to great applause as the\nNatives bring the Groper to Bill.\n\nBILL THE BUTCHER\nEvening, sir. Are you prepared to be celebrated? Are you ready to be\nfamous?\n\nGROPER\nHow much will it cost?\n\nBILL THE BUTCHER\nJust a moment of your time. My men will assist you.\n\nThey do quite a bit more than that: they GRAB the Groper and KNOCK him to\nthe floor. In the crowd, one SPECTATOR turns to his companion.\n\nPAGODA SPECTATOR\nWatch this careful. I've never seen the like, not even in Barnum's Museum.\n\nThe Groper CRIES OUT as the Natives PIN HIM to the floor, SPREADEAGLED.\nBill has one weapon left... in a special pocket, inside his vest. It's his\nCLEAVER. He takes it out slowly, SAVORING the moment.\n\nThe Pagoda goes QUIET. Only the gambling continues. The MUSIC dies. The\nonly SOUND beside the noises of the Chinese at their fan-tan is the\nGroper, who HOLLERS for help as soon as he sees the cleaver.\n\nBill HEFTS the cleaver in his hand, feels its weight, calculates timing,\nfigures distance .... and starts THROWING it in the air...\n\n... CATCHING it by the handle ... then throwing it again... higher, FASTER\nand HARDER with every toss.\n\nBILL THE BUTCHER\n(in full control)\nWhat's it so quiet for? I don't need quiet.\n\nThe Chinese opera MUSIC commences with a dissonant CRASH...\n\n... and Bill catches the cleaver again. But EVERY TIME he throws it and\nevery time he catches it by its handle ...\n\n... he also MOVES CLOSER to the terrified Groper. Now... standing\nvery close... he gives the cleaver a mighty toss ...\n\n... sending it SPINNING high in the air... up past the cages ... past the\nsecond-floor gallery, jammed with appreciative spectators ... until it\nSLOWS ... seems to HANG in the air... then starts its descent...\n\n... FALLING FASTER... towards Bill's waiting, STEADY HAND.\n\nThe Groper SCREAMS in fear. Bill SMILES confidently, holding his hand out\nuntil ... just as smoothly, just as confidently...\n\n... he PULLS his hand AWAY and the cleaver FALLS with terrific impact on\nthe SPLAYED HAND of the Groper, cleanly SEVERING it at the wrist. The\nGroper FAINTS dead away as a TREMENDOUS CHEER greets Bill's amazing feat.\nOne of the Natives TOSSES Bill the severed hand.\n\nBill SLIDES the ring off the finger and TOSSES it to the Chinese Dancer.\n\nBILL THE BUTCHER\nThere's for your beauty and your song.\n\nThe Dancer puts the ring on her finger and DANCES OFF. Bill TOSSES the\nhand to the floor and walks back to his table. The Crowd PARTS, murmuring\ncompliments on his dexterity, and the Knife Kids reverently RETURN the\nButcher's implements.\n\nNow two DOGS from the rat pit in the back room RUN through the crowd and\nFIGHT FRENZIEDLY over possession of the bloody hand.\n\nThe Crowd PASSES the Groper overhead and WE SEE from ABOVE: the Groper's\nunconscicus BODY being passed from hand to hand. The Crowd looks like a\nwave bearing the body toward the door. The Groper's stump BLEEDS on them\nas he passes overhead, sprinkling drops of blood and flesh like a moveable\nsacrament.\n\nBill approaches his table, acknowledging the continuing adulation, and is\nabout to sit down when a VOICE rises above all others.\n\nAMSTERDAM\nMr. Poole!\n\nBill turns, searching out the voice ...\n\nAMSTERDAM\nBill Poole!\n\nAnd SEES Amsterdam, standing at his own table. His attitude is calm,\nsmiling, respectful. But his eyes are demonic.\n\nAMSTERDAM\nMy compliments on your exhibition, sir.\n\nBILL THE BUTCHER\nThank you, sir.\n\nAMSTERDAM\nIt was like watching a dance.\n(Bill nods his thanks)\nSome great grand goddamned dance. (Bill looks at him more closely)\nYou know me, sir.\n\nBILL THE BUTCHER\nDo I? Are you missing a finger?\n\nAppreciative laughter from the crowd.\n\nAMSTERDAM\nNo. A father.\n\nThe laughter turns a little uneasy. Bill the Butcher sizes up the younger\nman.\n\nBILL THE BUTCHER\nDo you have a name?\n\nAMSTERDAM\nAmsterdam.\n\nBILL THE BUTCHER\nThat's a New York name.\n(suddenly smiles)\nshall we drink to it?\n\nAMSTERDAM\nIndeed.\n(they drink)\nAnd to my other name. Vallon. Will you drink to that?\n\nBILL THE BUTCHER\nPriest Vallon's son?\n(Amsterdam nods)\nOf course I'll drink to that. Your father was a worthy man.\n\nAMSTERDAM\nNot worthy of you. Those dogs ain't worthy of you. You ain't worth what\nthey feed on, and what they shit's too good for you.\n\nDEAD QUIET. Absolute. Breathless. Only the Chinese Gamblers at their\nfan-tan ignore this confrontation.\n\nBILL THE BUTCHER\nWhat do you want, boyo?\n\nAMSTERDAM\nI got to give you something, Butcher. Something from my father.\n\nAmsterdam PULLS OUT the piratels knife which Bill the Butcher used to kill\nhis father almost 12 years before.\n\nBILL THE BUTCHER\nYou got the sand to draw a blade in front of me? You will make good sport.\nCome ahead and give it here, you son of a bitch.\n\n \nAnd Amsterdam THROWS the knife, the bright blade FLASHING OUT of his hand\nlike lightning.\n\nAnd just as quickly the Buitcher PICKS UP his table, sending glasses\nflying and breaking, using it as a SHIELD...\n\n... and the knife THUMPS into it dead center. The Butcher HEAVES the table\nat Amsterdam...sending PATRONS yelling and SCATTERING.\n\nAmsterdam LEAPS out of the way of the table, then RUNS AT Bill the\nButcher...\n\n... who's already coming for him. As they CLASH and GRAPPLE with each\nother...\n\n... PATRONS all over the Pagoda crowd around for a good view of the action\nand start to MAKE BETS on the outcome. The odds do not favor Amsterdam.\n\nAnd neither does the fight. Amsterdam fights with real blood lust, but he\ndoesn't have the Butcher's skill, or experience, or dispassion. He breaks\nthe Butcher's CLINCH... HITS him once in the face... then a second time\n... and then gets FLOORED by a well placed kick. The Crowd cheers.\n\nAnd, on the second floor, Jenny and Johnny come out of the room. Still\narranging her clothes, Jenny looks over the gallery rail onto the floor\nbelow, sees the fight... and starts to RUN down the stairs. Johnny WATCHES\nher go ... looks at the fight again, for a second... then follows Jenny to\nthe main floor.\n\nThe Butcher is on top of Amsterdam now. He HITS him upside the head with\nthe wood and brass handle of his cleaver. Then hits him again. AND AGAIN.\n\nIn the Crowd now, Jenny finds Sheeny Mike.\n\nJENNY\nThe Butcher'll kill him if we don't do something.\n\nSHEENY MIKE\nIt was Amsterdam's own doing. And it'll be our death too if we try to stop\nit.\n\nJOHNNY\n(finally catching up)\nThat's the truth.\n\nJENNY\nThe truth is you don't give a damn about him.\n\nSHEENY MIKE\nYeah, well, if he gave a damn about us he wouldn't have called out the\nButcher in the first place.\n\nJenny looks at him with contempt, then STARTS into the crowd. Johnny grabs\nher ARM but she pushes him off.\n\nOn the floor, Bill uses the FLAT SIDE of the cleaver to SMACK the barely\nconscious Amsterdam on one side of his face... then on the other...\nREPEATEDLY... until Amsterdam is barely sensible. Bill grabs him by the\nhair. Amsterdam's body is slack.\n\nBILL THE BUTCHER\nWhat do you say? Loin or shank? Rib or chop?\n\nThe Crowd YELLS their choices. Jenny tries to PLUNGE through toward\nAmsterdam, but a HALF-DOZEN MORTS and WHORES put hands on her and HOLD her\nback.\n\nBILL THE BUTCHER\nCome on, let me hear you!\n(the Crowd yells louder)\nYou're all talking at once, I can't hear you!\n(a near frenzy)\nI don't hear the choicest cut! The best, the vital!\n(they quiet a little to listen)\nThe heart. I think I must have the heart!\n\nThis is greeted with the biggest CHEER of the night. The newlyelected\nMayor Wood seems to feel as if he should do something to stop the\nslaughter, but Boss Tweed calms him with a single dismissive GESTURE. Even\nthe Boss himself is excited by the prospect of this ritual sacrifice.\n\nBILL THE BUTCHER\nCome on, look at it! You fancy yourself a gladiator, act a gladiator!\n(raises his cleaver)\nWatch the death blow when it comes to you. Go to hell with open eyes!\n\nBill the Butcher readies himself to deliver the blow... and a HAND GRABS\n\nhis wrist, STOPPING his arm.\n\nWho would dare do this to Bill the Butcher? Bill turns, incredulous, to\nlook into...\n\n... the untroubled face of Monk Eastman.\n\nMONK EASTMAN\nIt's been a full evening's fun now, Butcher. It's enough.\n\nBILL THE BUTCHER\nYou got nothing to do with this, Monk.\n\nMONK EASTMKN\nWell I'm the game warden, you might say. I'm telling you this buck's too\nyoung yet. Wait till he's aged for a proper kill.\n\nBILL THE BUTCHER\nThe hell.\n\nWith his gigantic strength, Monk actually PULLS the Butcher off Amsterdam\nand onto his feet.\n\nMONK EASTMKN\nJust settle yourself Bill ...\n\n... and he part SHOVES, part THROWS Bill back a good twenty feet.\n\nMONK EASTMKN\n... and let the merrymaking continue.\n\nThe Dead Rabbits have scampered forward, and they're picking Amsterdam up\noff the floor. Monk looks at Jenny and Johnny, who each have Amsterdam by\nan arm.\n\nMONK EASTMAN\nIt was his father took me in first, and it's thanks I'm returning now.\n\nBILL THE BUTCHER\nEastman!\n\nMONK EASTMAN\n(ignoring Bill)\nThis squares any debt. Get him out of here.\n\nBILL THE BUTCHER\nMonk Eastman!\n\nAs the Rabbits CARRY Amsterdam toward the door, Monk finally turns his\nattention back to Bill.\n\nBILL THE BUTCHER\nI'll have you then!\n\nMONK EASTMAN\nCome ahead, Bill. Unless you're wanting to shout me to death.\n\nAnd Bill comes forward, BRANDISHING his cleaver. Monk Eastman stands his\nground, unmoving, untroubled. Everyone looks on in awe at this contest ...\n\n... except Boss Tweed.\n\nBOSS TWEED\n(to Killoran)\nIf these two are going to combat, it aught to be a worthier occasion. And\nmore rewarding for all.\n\nTweed SIGNALS to Bill: STOP. The Butcher sees the signal but can't believe\nit. He SHAKES his head. His blood is up. He won't stop.\n\nTweed SIGNALS AGAIN. Bill KEEPS COMING.\n\nTweed signals Killoran, who STANDS himself. And, when he stands, every COP\nand TAMMANY LOYALIST in the place--a hundred of them anyway--STAND behind\nBoss Tweed.\n\nAs Bill keeps coming, and Monk stands easy, waiting...\n\n... the Natives and their ALLIES now stand, facing the Tammany crew. The\nTammany backers, dressed flush and fancy, face the scruffier, more savage\nFive Points bunch: the twin factions of the criminal underworld, so\ndifferent in style and so similar in purpose, SIZE EACH OTHER UP from\nopposite sides of the room.\n\nBill STOPS. The odds are shifting, the stakes are climbing. Even the\nChinese STOP GAMBLING. For the first time all evening the room is\nabsolutely STILL. Even the Dead Rabbits have turned, at the door, to see\nwhat will happen.\n\nTweed and the Butcher LOCK EYES: neither blinks. Then after a moment ... a\nvery long moment ... a calm, bemused Tweed RAISES his glass.\n\nBOSS TWEED\nI only wanted to thank you, Bill, for the customary good job today... and\nan equally bright future for us both.\n\nAnother pause. Bill does not look placated. The whole place seems ready to\nexplode...\n\n... until Boss Tweed RISES to his feet, and RAISES his glass higher.\n\nBOSS TWEED\nWill you drink with me, Bill, as a friend? An honored friend.\n\nBill weighs the proposition... then looks to his men, NODS his head to\ncall them off. He GRABS a glass off a table to join Tweed's toast.\n\nThe MUSIC begins again. The gambling recommences. Patrons take their\nseats. The Dead Rabbits help Amsterdam out the door.\n\nMonk Eastman sidles up to Bill the Butcher.\n\nMONK EASTMAN\nIf there's one thing I can't abide, it's fighting for free.\n\nHe takes the Butcher's glass from his hand, raises it in salute, DRINKS\nDEEP and hands it back to him.\n\nAt the door of the Pagoda, a badly beaten Ansterdam starts FLAILING and\nfighting by brute instinct. He HITS Jenny, and she goes down. Johnny\ngrapples with him as Jenny PICKS HERSELF up and struggles to help SUBDUE\nAmsterdam.\n\nJENNY\nGo easy! Go easy. It's over.\n\nJOHNNY\nHe knew what he was doing, hitting you.\n\nJENNY\nLet's get him up.\n\nShe grabs Amsterdam's arm and, with Johnny's help, tries to HOIST him back\nto his feet.\n\nJENNY\n(Looking at Amsterdam's bloody face)\nTherels too damn little of him left to know anything.\n\nThey start across Paradise Square, holding him up...\n\n... as the rest of the Dead Rabbits join to help them... all growing\nsmaller in the distance against the primeval nighttime landscape of the\nFive Points...\n\n... and the Bouncer CLOSES the door.\n\nDISSOLVE TO\n\n66 INT. DON WHISKERANDOS BARBER SHOP DAY\n\nAnother DOOR OPENS, and Amsterdam stands on the threshold. A week or so\nhas passed since the big night at Sparrow's Pagoda, but Amsterdam's face\nstill shows the marks of Bill's beating.\n\nDon Whiskerandos is ministering to Monk Eastman with a straight razor,\ngiving him a close and careful shave. Monk is thoroughly relaxed, doesn't\neven glance over when the door opens, hardly reacts when Don Whiskerandos\nsays ....\n\nDON WHISKERANDOS\nSomeone's here for you.\n\nMONK EASTMAN\nThat so? What's he look like?\n\nDON WHISKERANDOS\nHe looks pretty damned sorry.\n\nMONK EASTMAN\n(looks at Amsterdam)\nIndeed.- Can I buy you a shave?\n\nAMSTERDAM\nNo thanks.\n\nMONK EASTMAN\nFace is too sore, eh? I understand.\n\nAMSTERDAM\nNo. I'm beholden enough to you as it is. I don't like to be beholden.\n\nMONK EASTMAN\nWe're all even, son. There's nothing more between us.\n\nAMSTERDAM\nI'd like it if there was.\n\nMONK EASTMAN\nAre you proposing employment?\n\nAMSTERDAM\nA collaboration. The Dead Rabbits got to get strong before we make another\nmove. I figure you're the one to make us strong. There's a lot we can\nlearn from you.\n\nMONK EASTMAN\nBoyo, I'm a freebooter and a mercenary, not a teacher. I can't learn\nnothing from you and I can't earn nothing from you either.\n\nAMSTERDAM\nThe Dead Rabbits is going to be glorious again. We're going to reign over\nthe Points.\n\nMONK EASTMAN\nAnd Bill Poole's Natives? What will they have to say?\n\nAMSTERDAM\nNothing. They won't have tongues left to speak.\n\nMONK EASTMAN\nDon't worry about what theylll have in their mouths. You think about what\nthey got in their hands.\n(beat)\nListen, son... take a word from a man who was honored to fight beside your\nfather. Temper yourself like a sword, and pay attention to balance. Anger\nspoils an edge.\n\nAMSTERDAM\nThen you say no?\n\nMonk SIGHS and points to a huge WAR CLUB which hangs in a place of honor\nabove the shop mirror. It has deep marks running along its front, like\nNOTCHES-\n\nMONK EASTMAN\nYou see my instrument there? First notch represents two dollars and fifty\ncents. That's how much I got for my first kill. There are forty-eight more\nnotches after it, and my fee has grown with each one. I can accommodate\nyou alright, but you got to afford me. So do business with me or do it on\nyour own.\n\nAMSTERDAM\nEverything I got is still to come. So I guess it's on my own, then.\n\nMONK EASTMAN\nFair enough. You'll find independence a fine thing, a fierce thing.\nAlthough I do hold money preferable to all.\n(Amsterdam turns to leave)\n\nBut I'm sure we'll have news of each other.\n\nAMSTERDAM\nBound to.\n\nAs he shuts the door of the shop, Monk Eastman gestures to Don\nWhiskerandos for another hot towel.\n\nCUT TO\n\n67 EXT. STREETS OFF PARADISE SQUARE DAY\n\nA large wagon bearing a Tammany banner and carrying dozens of small sacks\nof coal moves slowly down the narrow street. Boss Tweed sits on the front\nseat, next to the driver, as his minions HAND him coal sacks. Tweed\ndistributes them with a smile to the NEEDY who trot next to the wagon.\n\nBOSS TWEED\n(to the people as they grab the coal)\nTammany's here to take the chill off the winter and the weight off your\nheart. It's Tammany can make this city a fit place, with the help and vote\nof all you good people...\n\nAs he continues, Bill the Butcher JUMPS onto the wagon and sits down\nbeside him. Boss Tweed hardly gives him a glance.\n\nBILL THE BUTCHER\nYou sent me word.\n\nBOSS TWEED\nWe could use help here. Grab a sack.\n\nBILL THE BUTCHER\nI keep my hands clean.\n\nBOSS TWEED\n(now he looks at him)\nSo I've observed.\n\nBILL THE BUTCHER\n(tense)\nBetter be on your mark to talk like that to me. It was you stopped me at\nthe Pagoda. I would have cut Monk inside out.\n\nBOSS TWEED\nWhat if you hadn't? Think of the embarrassment. And what if you had?\nConsider the waste. Next time you're in a dust-up like that, think ahead\nand make proper plans. It'd be a grand source of revenue, whoever prevails.\n\nBILL THE BUTCHER\nIt touches my heart how you always. have our best interests in mind.\n\nBOSS TWEED\nOur mutual interests. That's why I want you to contact Monk Eastman.\n(Bill's incredulous)\nI want you to extend a proposition. I want him to join US.\n\nBILL THE BUTCHER\nWhat?\n\nBOSS TWEED\nOh, not Tammany, of course not. We could no more have him there than you.\nBut he should throw in with the Native Americans, become aware of our\nArrangement and ... well, use his influence, shall we say, to enrich us\nall.\n\nBILL THE BUTCHER\nYou're saying I can't do everything you need? You don't think the Natives\nhas been doing good and right? You think there's something more he can do\nthat I ...\n\nBOSS TWEED\n(interrupting)\nIt's none of that, Bill. None of that. His independence is like a rebuke\nto Tammany. And an insult to you.\n\nBILL THE BUTCHER\nThen you should have let me have him at Sparrow's.\n\nBOSS TWEED\nI should. If I'd been confident-absolutely certain--that you would have\nprevailed. Monk is an unpredictable power, and a figure of size. He needs\nto be reckoned with.\n\nBILL THE BUTCHER\nHe needs to be killed.\n\nBOSS TWEED\nNo. He's an elemental force. Them you don't destroy. But you can contain\nthem and use them for the good they give off.\n\nHe hands Bill a sack of coal.\n\nBOSS TWEED\nCoal?\n\nBill doesn't answer. He HOPS DOWN off the moving wagon, and the Needy give\nway quickly before him, then regroup and SWARM after Tweed and his coal.\nThe Boss continues with his Tammany spiel-enjoying all the attention--as\nthe Butcher watches, disdainful of Tweed but filled with angry\nfrustration. From his face we ...\n\nDISSOLVE TO\n\n68 INT. DON WHISKERA.NDOS BARBER SHOP DAY\n\n... the incredulous face of Monk Eastman, as he looks at Bill the Butcher.\n\nMONK EASTMAN\nAnd this is your offer?\n\nBILL THE BUTCHER\nIt's Boss Tweedls offer.\n\nMONK EASTMAN\nHow do you think we'd sit as allies, Bill?\n\nBILL THE BUTCHER\nThe only way we could tolerate being near each other would be stretched\nout dead.\n\nMONK EASTMAN\nMy thoughts exactly. Then why are you here? Because you were asked to be.\nYou were ordered to be. And who would order me among the Natives? You? And\nwould you follow my orders, even if they was being relayed from William\nMarcy Tweed himself?\n\nHe EASES himself out of the barber chair. The Butcher TENSES as Monk comes\ntoward him.\n\nMONK EASTMAN\nDubious and doubtful, my friend. But your offer--pardon, the offer you\nbring--is the most generous that's ever been extended. I favor the terms,\nif not the personalities. So let us decide the way any Native American\nwould appreciate. We'll do it the democratic way.\n\nHe throws open the door of the barber shop and stands there, beside Bill\nthe Butcher, his arm thrown carelessly around him. PASSERSBY stop in\nwonderment as Monk ADDRESSES them.\n\nMONK EASTMAN\nCitizens of the Five Points! It seems the Native Americans have come to\ntrouble. They have grown so weak that now they seek my help. They can pay\nany wage I ask. But I ask you now. Even for money, should I carouse and\nconspire alongside a boyo like this with gristle on his knife and spittle\non his chin every time his cock gets hard?\n\nMonk is beaming, the Butcher is appalled. His body tenses like a snake\nready to spring. But the people in the street just STARE- They can't\nbelieve what they've just heard.\n\nMONK EASTMAN\n(to Bill)\nThere. You see. I'm afraid the people have spoken.\n\nBILL THE BUTCHER\nI'll see you again, you bog Irish bastard.\n\nMONK EASTMAN\nWell, if it's a fight you want now, Bill, remember to come back with a\nbankroll.\n\nMonk returns to the shop and the comfort of his chair. Bill GLARES at the\npeople in the street. One lock from him starts them moving fast. But they\ndo not look away from him quite so fast, or at him, either, with quite the\nsame fear.\n\nCUT TO\n\n69 INT. MISSION (FORMERLY OLD BREWERY) NIGHT\n\nThe vast main room has been changed into a dance floor and decorated for\nthe evening. An altar has been hung with bunting; SHIP'S LANTERNS and\nCANDLES illuminate the place. The REVEREND SHADRACH RALEIGH GREETS\neveryone. The room, already crowded with CELEBRANTS of all ages, grows\nquiet as the Dead Rabbits, done up in their party best, show up for the\nrevelry.\n\nREVEREND RALEIGH\nAh, the Native Americans, is it now?\n\nAMSTERDAM\nAre they coming?\n\nJENNY\nWe don't want a ruckus, minister.\n\nREVEREND RALEIGH\nNor do I. I intended no disrespect. I'd heard the Native Americans were\nfigures of the greatest prominence here.\n\nAMSTERDAM\nIndeed they are, just for the moment. Let them come. Happy to have them.\nEveryone's welcome in a house of God, isn't that right, Reverend?\n\nREVEREND RALEIGH\nAs all are welcome in heaven.\n\nSHEENY MIKE\nIld like to go to heaven. Ild like to go to heaven and bite off Gabriells\near.\n\nREVEREND RALEIGH\nYou're still welcome, even with such peculiar appetites.\n\nAMSTERDAM\nBut if the Natives do come, Father...\n\nREVEREND RALEIGH\nI'm not a priest, son ...\n\nAMSTERDAM\n... there's no accounting for what may follow.\n\nREVEREND RALEIGH\nI'm sure God's hand will guide us in that. Just as He guided you here at\nthe right perfect time, with a right perfect regent. The young lady with\nthe sunset hair. Miss ...\n\nJENNY\nEverdeane. Jenny Everdeane.\n\nREVEREND RALEIGH\nMiss Everdeane. Step forward, please.\n\nRadiant and curious, Jenny joins the Reverend Raleigh in the center of the\nroom.\n\nREVEREND RALEIGH\nAnd the evening's regent chooses her evening's partner.\n\nThere is much MUTTERING about this from everyone. Someone makes a wet,\nfarting SOUND.\n\nREVERAND RALEIGH\n(unfazed)\nHere we make only joyful noises to the Lord.\n\nUnder the instruction of the bustling Reverend and his HELPERS, the Women\nskeptically stand away from the Men, who allow themselves to be arranged\ninto a LINE. The Reverend Raleigh escorts the delighted Jenny to a chair\nthat has been placed, by itself, in the center of the room. Jenny sits\ndown, facing away from the rest of the guests. She holds a MIRROR in her\nhand.\n\nREVEREND RALEIGH\nNow. The men, please. One by one.\n\nThe first volunteer Reverend Raleigh brings forward is a reluctant Sheeny\nMike. There are RUDE COMMENTS as he leads Mike slowly to the center of the\nroom, coming up behind Jenny until she can see Mikels face reflected in\nthe mirror. She SHAKES her head.\n\nREVEREND RALEIGH\nNext Gentleman, please.\n\nMore laughing. The BOYS push out one CANDIDATE. Rejected.\n\nNow ANOTHER CANDIDATE comes forward. And STILL ANOTHER- Jenny rejects each\nwith the composure of a princess.\n\nNow it is Johnny's turn. He WALKS slowly across the big room, and stands\nbehind Jenny, trying to look confident. The moment is long, the room's\ntense... until--just once but very decisively-Jenny SHAKES her head.\n\nJenny watches Johnny's face in the mirror. She stays still. Finally, he\nwalks back to the GANG.\n\nNow Amsterdam starts toward the center of the room. He keeps his eyes\nfixed on Jenny.\n\nJenny catches Amsterdam's reflection in the mirror. He STOPS. She NODS her\nhead. Yes. Him.\n\nA small BAND strikes up a barely recognizable version of \"A Mighty\nFortress Is Our God,\" arranged in waltz time. Jenny rises and holds out\nher arms to Amsterdam. They start to DANCE, a little clumsily, as other\nCOUPLES join them.\n\nAMSTERDAM\nSo you accept?\n\nJENNY\nWhat?\n\nAMSTERDAM\nYou accept to be my mort and no one else's.\n\nJENNY\n(teasing)\nNo, it's just that I didn't recognize you in the mirror. You still got\nsome of the face the Butcher gave you.\n\nAMSTERDAM\n(going along with the joke)\nIt's not the Butcher, it's the dancing. It shifts my face all around.\n\nJENNY\nMaybe you'll look better later.\n\nThe Reverend Raleigh and his Helpers DASH among the dancers, distributing\nLIGHTED CANDLES, which the COUPLES take and hold as they move around the\nfloor.\n\nAMSTERDAM\nI will if we're together later.\n(she smiles)\nAnd what about after that? After tonight?\n\nJENNY\nI chose you just for tonight. If that's not good enough I'll go with\nsomeone else.\n\nShe takes a candle from the Reverend and holds it so the light FLICKERS on\nAmsterdam's face.\n\nAMSTERDAM\nI'll have tonight. But after this don't come to me no more till you're\nready. No more.\n\nHis eyes, in the candlelight, show both his love and his Resolution. Jenny\nNODS and they DANCE AWAY ...\n\n... losing themselves now among the dancers, all moving and holding\ncandles. As they dance, their movement becomes SPLIT, SEQUENTIAL, a study\nin motion like an old Gjon Mili photograph. Their bodies create a RUSH OF\nYELLOW LIGHT ACROSS the screen like the tail of a comet.\n\nCUT TO\n\n70 INT- DEAD RABBITS HOUSE NIGHT\n\nIn the hallway. JOHNNY stands pressed against a door.\n\nJOHNNY\n(whispering)\nAmsterdam.\n(louder; hissing)\nAmsterdam!\n\nAMSTERDAM (V.O.)\nWho is it?\n\nJOHNNY\nMe.\n\nAMSTERDAM\nCome on in.\n\nJOHNNY\nI don't want to come in! You come out.\n\nAMSTERDAM\nJust a damn minute.\n\nAMSTERDAM comes to the door, half-dressed and sleepy. We see Jenny asleep\non the floor inside.\n\nAMSTERDAM\nWhat do you want?\n\nCUT TO\n\n71 EXT. PIER/DEAD RABBITS HOUSE NIGHT\n\nJust before dawn. The streets are empty, the river is quiet. AMSTERDAM\nfollows JOHNNY out of the house.\n\nJOHNNY\nI'm going to fight you.\n\nAMSTERDAM\nOh, Jesus, Johnny, I'm tired. How about sometime else?\n\nJOHNNY\nNow.\n\nAMSTERDAM\nYou want to tell me what this fight's over? Is it The Butcher? Jenny?\n(Johnny turns, determined)\nAlright, alright. Then tell me why like this?\n\nJOHNNY\nSo when I lose no one will see.\n\nAnd he SLUGS him. Hard. Harder even than he thought he could. AMSTERDAM\nstumbles, stunned, then pulls himself up. And CHARGES at Johnny, knocking\nhim down.\n\nThe two friends PUNCH, WRESTLE, BITE and PUMMEL EACH OTHER with such\nextravagant energy that they soon...\n\n... ROLL OFF the pier...\n\nCUT TO\n\n72 EXT. PIER DAWN\n\n... onto the muddy ground underneath the pier. They LAND with a shuddering\nSPLASH in the soggy earth, but they keep fighting ....\n\n... as a PACK OF ORPHANS, eyes glinting like night animals, scatter like\nwild beasts disturbed in their burrow.\n\nAmsterdam has the physical advantage, and more skill. But Johnny has the\nfury. All the feeling and the frustration rain out of him physically,\nmaking the match nearly even.\n\nThe Orphan Pack watches the fight silently, showing no favoritism or\nemotion, just an edge of curiosity.\n\nAmsterdam HITS Johnny a wicked combination that makes him SINK to one knee\nin the mud. But Johnny will not go down. Amsterdam, hurt himself, just\nstares at Johnny in wonderment.\n\nAMSTERDAM\nSatisfied?\n\nJOHNNY\nSatisfied? It wasn't me that's been dancing and shagging all night.\n\nAnd he pulls himself to his feet and THROWS a roundhouse at Amsterdam, who\nhalf-staggers out of the way. The moment throws Johnny off balance, and he\nfalls in the mud again, this time on all fours. Amsterdam SINKS down\nbeside him.\n\nAMSTERDAM\nEnough.\n\nJohnny won't stop: he throws a punch that Amsterdam can see coming a block\naway. But he's too tired too duck; or maybe he's just fed up. He takes the\npunch and FALLS on his back.\n\nAMSTERDAM\nThat's it then.\n\nJOHNNY\nThe hell.\n\nAnd he THROWS HIMSELF on Amsterdam. It's more like he rolls over onto him\nthan anything, but he's on top of him now, hitting him in the face with\nall he's got left in him.\n\nAMSTERDAM\nGoddamn it.\n\nAmsterdam HEAVES Johnny off and pops him a solid SWIPE to the jaw. That\ndoes it. Lights out. Johnny falls unconscious into the slime beneath the\npier.\n\nThe Orphan Pack keeps staring from the shadow with their ferret eyes.\nStill silent. Amsterdam STRUGGLES to his feet, stops at the river's edge\nto get a handful of water to revive himself. Then he looks over, sees his\nunconscious friend.\n\nAMSTERDAM\nGoddamn you anyway.\n\nHe grabs Johnny's body by the shoulders and pulls him to the river's edge.\nHe gets some water on his hand, lets it drip over Johnny's face, washing\naway a little of the blood. Not enough. He draws some more water, and RUBS\nit gently onto Johnny's face.\n\nCLOSE: on the motion of his hand. It is nearly gentle.\n\nCUT TO\n\n73 INT. DON WHISKERANDOS BARBER SHOP DAY\n\nAs Don Whiskerandos' hand, holding a razor, travels over the great plains\nof Monk Eastman's face. His hand is shaking.\n\nMONK EASTMAN\nWhat's the trouble, Don?\n\nDON WHISKERANDOS\nThere's someone here.\n\nMonk bestirs himself in the chair, SEES: Bill the Butcher, standing in the\ndoorway.\n\nMONK EASTMAN\nIt's just a man of commerce.\n\nMonk settles back in the chair as Bill the Butcher walks into the shop.\n\nBILL THE BUTCHER\nYou're right enough this time, Monk.\n(to Don Whiskerandos)\nGo ahead.\n(the barber hesitates)\nGo on with your work. I'll finish my business.\n\nDon Whiskerandos picks up a pair of SCISSORS and NERVOUSLY starts to TRIM\nMonk's hair.\n\nMONK EASTMAN\nCome out with it then.\n\nBill NODS emphatically at Don Whiskerandos, who is clearly terrified. Bill\nnods again, almost vehemently. Don Whiskerandos SHAKES his head. Bill\nGLARES at him. The Barber takes a STEP BACK. Monk opens his eyes, starts\nto size up the situation.\n\nBILL THE BUTCHER\nYou damn craven, do it!\n\nBill LEAPS forward, grabs the trembling barber's arm and pushes it toward\nMONK...\n\nMONK EASTMAN\n(rising from his chair)\nWhat the hell...\n\n...and the scissors, held by Don Whiskerandos and pushed by Bill the\nButcher, meet Monk full in the face as he bolts from the chair. The long\nscissor BLADE SINKS into Monkls right eye.\n\nMONK BELLOWS, staggers toward Don Whiskerandos, who shrinks against the\nwall. The scissor protrudes from Monk's eye as he RAGES, blinded by blood,\nnow reaching out for the Butcher\n\nBILL THE BUTCHER\nYour eyes was open for that alright. And you still got one to see this.\n\nBill the Butcher reaches above him for Monk's war club, which hangs on the\nwall. He grabs tight hold of it and, with Monk nearly upon him, swings it\nviciously at Monk's head. The BLOW sends the scissor FLYING out of Monk's\neye, with the eyeball still attached. It also SMASHES in the side of\nMonk's face. He FALLS, still GRABBING desperately for the Butcher...\n\n... who now stands over him, beating him incessantly with the war club.\nCAVING his head in. KILLING him.\n\nDon Whiskerandos looks at Bill in a virtual paralysis of terror. The\nButcher lets the CLUB FALL, reaches in his pocket and throws some MONEY at\nthe barber.\n\nBILL THE BUTCHER\nIf I was you I'd use that to open in a new location. Consider St. Louis.\n\nThe enormity of what he's done is beginning to sink in. He turns to leave\nthe shop ... but STOPS in the doorway.\n\nOutside, CITIZENS of the Points are staring at the fallen Monk in mute\nwonder. They have just witnessed a moment in history.\n\nBill the Butcher surveys them all silently, then calls out to Don\nWhiskerandos.\n\nBILL THE BUTCHER\nThe war club.\n\nThe barber steels himself to CARRY the bloody club to the Butcher, who\nhefts it slowly in his hands, in view of all.\n\nHe takes a knife from his vest, and CUTS the LAST NOTCH in the club. Then,\nslowly...\n\n... he steps down into the crowd, which PARTS before him. He\n\nwalks among them in regal splendor, the war club at his side, dripping\ngore.\n\nAs the crowd falls back, Bill spots Amsterdam, Johnny and some of the\nother Dead Rabbits, watching his every mave. He STOPS.\n\n \nHOLDS OUT the bloody war club in front of him... straight in front of\nhim... POINTING IT right at Amsterdam.\n\nBILL THE BUTCHER\nI promise you, Amsterdam. I promise you.\n\nThen he grins, turns away and walks through the crowd: prince of all he\nsurveys.\n\nCUT TO\n\n74 INT. RESTAURANT/PARK ROW\n\nBoss Tweed reigns in the banquet room of a vast, gaslit restaurant, at a\nlong table overburdened with food. Seated along both sides of the table is\nan array of the city's POWER BROKERS, with whom Tweed and his Tammany\nMINIONS mix easily. Their attitude toward the Power Brokers is a mixture\nof ribald fawning and fine condescension; the Power Brokers, in turn,\nenjoy the food, and the MUSIC from a small BAND, and the DANCING GIRLS who\nflirt and entertain them, while exuding the unmistakable impression of\namateur anthropologists exploring a decaying civilization.\n\nTweed is courting and joking with a bewhiskered HORACE GREELEY, editor of\nthe influential Tribune.\n\nGREELEY\nI may enjoy the bounty of your table and the pleasures of your company,\nMr. Tweed ...\n\nBOSS TWEED\nAnd the pleasures of the company provided you, Mr. Greeley.\n\nGREELEY\n...without the Tribune endorsing your politics.\n\nBOSS TWEED\nI suppose you can at that. Take with one hand, flay with the other.\nVirtuels on your conscience, Horace, but Tammany's in your heart.\n\nKilloran materializes at Tweed's side and whispers something quickly,\ndiscreetly in his ear. Tweed EXCUSES himself, rises quickly and WALKS\nacross the restaurant floor...\n\n... past the Band and the Dancing Giris ...\n\n... to the swinging doors of the kitchen. As he pushes open the SWINGING\nDOOR, his face has lost its humor.\n\nCUT TO\n\n75 INT. KITCHEN/RESTAURANT/PARK ROW\n\nA madhouse of activity. WAITERS in black suits, vests and serving outfits\nSTREAM by carrying huge TRAYS of food while the KITCHEN STAFF works\ndouble-time to keep up with the unceasing volume.\n\nAs Boss Tweed walks in, Bill the Butcher PLUCKS a piece of roasted poultry\noff a tray as it's carried out the door.\n\nBILL THE BUTCHER\nI'm not good enough for your table, so I eat where I can. (takes a big\nbite)\nIt's good, what is it?\n\nBOSS TWEED\nPheasant.\n\nBILL THE BUTCHER\nIs that like pigeon? I killed a pigeon once but it didn't taste nothing\nlike this.\n\nBOSS TWEED\nYou killed a bull this morning. I told you to make an Arrangement with\nhim, and you come back with his blood on your hands.\n\nBILL THE BUTCHER\n(chewing his food)\nHe insulted me. He aggravated me. I couldn't stand for that, for no one.\n\nBOSS TWEED\nYou stand for anything if I tell you.\n\nBILL THE BUTCHER\nYou think I should be afraid of you. You act like lightning strikes when\nyou talk.\n\nAs they talk, and the tension builds between them, the two men are\nconstantly BUFFETED by the swinging doors and the unending stream of\nWAITERS.\n\nBILL THE BUTCHER\nI never was afraid of you, so don't think I was or act like I was, you\nain't earned it.\n\nBOSS TWEED\nWhat did you earn us, killing Monk?\n\nBILL THE BUTCHER\nWhere'd you earn the right to ask that question? You raised some dust in\nthe streets a while back, but no more. You got power but you ain't got\nmuscle and you ain't got a notion what it means to be a warrior.\n\nBOSS TWEED\nI see it lost you a lot of God's sense, along with that eye.\n\nBILL THE BUTCHER\nYou don't know nothing about that! It was my doing! It says in The Book,\n\"If thy eye offend thee, pluck it out.\" I followed that law with my own\nknife and hand. The first I ever fought Priest Vallon, he bested me. And\nwhen he came to bring me to death, I looked away and he watched me and he\nlet me go. The shame was worse than the killing. I would have cut out both\neyes if I could still have fought, but cutting just the one gave me heart.\nWhen I killed Priest Vallon, that restored me. Now I sent Monk Eastman\nover I got glory. I got all there is, and small thanks to you, squire.\n\nBOSS TWEED\n(measured, conciliatory) You need two eyes to see the depth, Bill. That's\nhow we help each other. If it wasn't for me would be happy enough to\nplunder the Points and put the fear into people who don't know nothing\nelse. But Bill, I'm only saying... I'm counselinm... look in the distance.\nYou want to sit at my table, fine. But you must always remember who the\nhost is. It's not a matter of courage welre talking. It's manners.\n\nBill grabs another piece of food from a tray.\n\nBILL THE BUTCHER\nHowls these manners?\n\nBOSS TWEED\nFine, if you're hungry.\n\nBILL THE BUTCHER\nI'm always hungry.\n\nBOSS TWEED\nI've always told you, Bill. There's plenty for all, and more for us\ntogether than separate. We'll dine together sometime.\n\nBill the Butcher nods, appeased, and leaves, swaggering his way through\nthe kitchen chaos, making everyone get out of his way. Boss Tweed watches\nhim go, his expression changing from bemused appeasement to molten rage.\n\nCUT TO\n\n76 INT. RESTAURANT/PARK ROW\n\nLater. Everyone's gone except some WAITERS, cleaning up, and Boss Tweed\nand Daniel Killoran, who sit at the end of the banquet table. Leftover\nplates of food have been massed at Tweedls place and, as he talks, he\nPICKS from them.\n\nBOSS TWEED\nLet me put this to you, Daniel. Now that the Butcher has killed the single\nmost prominent figure in the Five Points--a man of myth and moment--who is\nthere to take his place?\n(as Killoran starts to answer)\nOf course. Then what do we do about the Butcher? He's too useful to be\nkilled, but he must be checked.\n\nKILLARAN\nIt could be a police matter.\n\nBOSS TWEED\nImpossible! Any cops who might have the mettle to go against the Butcher\nhave blood ties to the gangs. They can't be trusted. And any cops that can\nbe trusted are too craven to be any use. If Bill's to be checked, it must\ncome from within the Points, not without.\n\nKILLORAN\nThe Dead Rabbits did a proud job for elections. That Amsterdam boy has\nsand.\n\nBOSS TWEED\nThat so? The last time I saw him he was under the Butcher's knife looking\nlike a fine filet. Who else is there?\n\nKILLORAN\nWell, the Rough and Tumble Boys over to Slaughterhouse Point. There's\nCountry McCleesterls bunch, too, and the Plug Uglies, but there's none\nthat have the promise of the Dead Rabbits, or the stake, neither.\n\nBOSS TWEED\nWhat would that be?\n\nKILLORAN\nThe boy Amsterdam has a blood feud with the Butcher. He's sworn revenge\nfor the death of his father, and he's got the heart to carry it forward.\nHe'll have the skill and power soon enough.\n\nBOSS TWEED\nBlood will make a man intrepid. Bring them along, then. Nurture the\nRabbits with neglect. Let them roam where they like.\n\nKILLORAN\nAnd if they roam into some portion of our own revenues?\n\nBOSS TWEED\nI'd tolerate a little trespassing if it was for a higher good and use.\nThey'll cross with the Natives soon enough and keep each other occupied.\n\nKILLORAN\nBill's got to be a lot more than occupied.\n\nBOSS TWEED\nI'll hold Bill in check. If he becomes unwieldy ... well, damn it all,\nDaniel, I might just have to oil up my old musket. What do you think of\nthat, eh?\n\nBoss Tweed gets up from the table. A WAITER is DIMMING the gaslights,\nfilling the room with deep shadows.\n\nKILLORAN\nIt'd be gratifying, Mr. Tweed. Even edifying.\n\nBOSS TWEED\nBut poor politics, eh? Well, we musn't have that.\n(as he walks away)\nI do miss those roistering days, though. Oh, and bring some of that food\nfor the canaries.\n\nCUT TO\n\n77 EXT. STREET/THE BLOODY ANGLE DAY\n\nThe sharply-angled turn of Doyers Street, nicknamed \"The Bloody Angle.\"\nSOUND of a horse and cart as we see a row of UPTURNED mostly WOMEN and\nYOUNG CHILDREN.\n\nA NATIVE AMERICAN drives a cart carrying large barrels of MILK. A SECOND\nNATIVE rides beside him on the seat, holding a rifle, looking impassively\nat the faces turned up to him. A WOMAN holding a BABY in one arm and a\nCHILD by the hand steps in front of them. They almost run her down.\n\nWOMAN\nWe ain't had no milk this week.\n\nNATIVE 2\nYou can have as much as you can pay for.\n(to crowd)\nAnyone that's got the ned, step up with your pitchers. Any not, come back\nwhen you do.\n\nThe Woman gives her children to other WOMEN in the crowd and advances\ntoward the wagon. Native 2 cocks his rifle...\n\n... and Jenny steps from the watchful Crowd.\n\nJENNY\nI got ned enough for all. See? Fair enough?\n\nShe holds her hand out as she WALKS slowly toward the milk wagon. She's\ncarrying a huge fistful of GLEAMING COINS. The Natives on the wagon watch\nher warily...\n\n... and are JUMPED from behind by a couple of Dead Rabbits. Amsterdam\ngrabs a milk pitcher from a WOMAN in the crowd, AXES open the spigot on a\nmilk barrel and FILLS the pitcher to overflowing. Jenny JUMPS up on the\nwagon seat.\n\nJENNY\n(to Amsterdam)\nWhat's our rate? What do we charge?\n\nAMSTERDAM\nJohnny worked it out to a nickel less than the Natives. Just till we're\nestablished. Then we raise it a penny more than now.\n\nJENNY\nRaise it? Is that what you want?\n\nAMSTERDAM\nYou say, then.\n\nJENNY\n(beat; then, to Crowd) There'll be no paying at all this day. Or this\nweek, neither. This is Dead Rabbits business from now on.\n\nThe Crowd scrambles for milk and the Rabbits try to keep ORDER.\n\nJENNY\n(to Crowd)\nWe'll take ned if you got it, now or in future. But no one will go without.\n\nAMSTERDAM\n(to Jenny)\nExcept us. You opening a charity?\n\nJENNY\nThey'll pay us what they owe, in loyalty if not in cash. Tammany gives\ncoal, we give milk.\n\nAMSTERDAM\nThey can afford it.\n\nJENNY\nCan't we?\n\nCUT TO\n\n78 INT. MOTHER JOYCE'S BORDELLO DAY\n\nThe midday sun shining through the windows makes the place look tatty and\nslightly desperate: this is a place that needs low light and long shadows\nto look good.\n\nAmsterdam and Johnny are at a long bar, talking to Mother Joyce, a beefy,\nwised-up woman with pornographic tattoos an both forearms.\n\nMOTHER JOYCE\nThis place is so clean it's the next thing to chaste. And safe as a\nconvent, too.\n\nAMSTERDAM\nFrom the Natives, maybe. But not from us.\n\nMOTHER JOYCE\nYou're saying I got to worry about your mob too?\n\nJOHNNY\nNo worries at all. You throw in with the Dead Rabbits and we'll worry\nabout the Natives.\n\nAcross the room, Jenny is sitting talking to a few of the WHORES, one of\nwhom is a mixed-blood Eurasian with long black hair named Emma Loss. She\ngets up lazily and heads for the bar. As she passes a DRUNK, he reaches\nout to grab her. She's used to this, and she knocks his hand away. He\nkeeps after her.\n\nAt the bar, Mother Joyce notices Emma being hassled, but pays no\nattention: her girls can take care of themselves.\n\nMOTHER JOYCE\n(to Amsterdam and Johnny)\nAnd if someone else comes along, do I pay them too?\n\nAMSTERDAM\nYou only pay us. We see you safe from everyone.\n\nJohnny has been watching the drunk bothering Emma Loss. Without saying\nanything to Amsterdam or Mother Joyce, Johnny LEAVES the bar, walks over\nto the drunk and SHOVES him away.\n\nJOHNNY\nLeave off her. She don't want you. Not even if you could pay her.\n\nEMMA LOSS\nHey, just a minute.\n\nJOHNNY\n(to Emma)\nHe can't pay. I can pay.\n\nAMSTERDAM\n(watching this)\nMaybe I should offer Johnny as a bouncer for your busy nights.\n\nMOTHER JOYCE\n(laughs)\nA bouncer! I don't know if he could bounce on a feather bed. He wants to\nbe a character like you, is that it?\n\nAMSTERDAM\nHe's got his own ideas. Too full of Tammany, maybe, but he's a fast friend.\n\nAcross the room, Johnny is talking to Emma Loss. She NODS and starts to\nLEAD him upstairs.\n\nMOTHER JOYCE\nBut in my trade you go on your instincts. My instincts says to heed you,\nand my memory of your father says I'm right. We'll shake on it.\n(Amsterdam grabs her hand)\nAnd have one of my best to seal the bargain. Megs!\n\nA lanky blonde, seated across the room near Jenny, bestirs herself.\n\nMOTHER JOYCE\nCome here and show my new friend why we're worth special care.\n\nJenny watches MEGS move toward Amsterdam.\n\nCUT TO\n\n79 INT. ASSIGNATION ROOM/MOTHER JOYCE'S\n\nBig enough to contain a half-gutted mattress supported by a rickety bed,\nsome worn sheets and a few GUTTERING CANDLES.\n\nJohnny undresses as Emma sits on the bed and starts to take off her dress.\n\nJOHNNY\nYou liked that old man? You would have gone with him?\n\nEMMA LOSS\nI like anyone that pays, that's all.\n\nJOHNNY\nTell me what he wanted you to do.\n\nEMMA LOSS\nHe mostly wanted comforting.\n\nJOHNNY\nI never seen hair so black. Can you take the pins out?\n\nEMMA LOSS\nIt takes so long to do back up.\n\nHe sits beside her and starts slowly, almost tenderly, to remove the pins.\n\n79 CONTINUED:\n\nJOHNNY\nDid your mother have the same color?\n\nI don't know.\n\nJOHNNY\n(as the hair cascades over her bare shoulders)\nLie back, I want to look at you.\n(his eyes glide along her body)\nWhat's that mark?\n\nEMMA LOSS\nI always had it.\n\nJOHNNY\n(touching her lightly)\nAnd there? Is that a scar?\n\nEMMA LOSS\n(she looks at her naked belly)\nThere was a baby. They cut it out.\n\nJOHNNY\nAnd that on your shoulder? That looks old.\n\nEMMA LOSS\nYeah, I got that when I ...\n\nJOHNNY\n(interrupting, quiet)\nI don't want to know when. Don't tell me about before or what you used to\nbe, I don't want that.\n\nEMMA LOSS\nWhat about your scars. Do you have scars?\n\nJOHNNY\nNone I ever seen. Maybe you can find them.\n\nHer hands and mouth cover his body. He closes his eyes.\n\nCUT TO\n\n80 INT. ASSIGNATION ROOM/MOTHER JOYCEIS\n\nAnother room. Amsterdam and Megs are undressing each other when Jenny\nwalks in.\n\nAMSTERDAM\nGo on. I can see you later.\nMegs leaves, brushing past Jenny.\n\nJENNY\nWhat are you doing?\n\nAMSTERDAM\nI couldn't decline what Mother Joyce offered. It's in the interests of\nbusiness. You understand business.\n\nJENNY\nSure I do. But there's something else I still don't understand. At\nSparrow's Pagoda, did you hit me, knowing it was me?\n\nAMSTERDAM\nYeah. I did.\n\nShe HITS him. In the face. Hard. Not a slap. A solid PUNCH. His nose\nstarts to gush blood. He puts his arm under it to staunch the flow,\nkeeping his eyes an her.\n\nJENNY\nMeantime's over.\n\nAMSTERDAM\nOh fine. That's fine. I'd be celebrating but I'm losing too much blood.\n\nJenny tears part of the sleeve from her blouse and puts it against his\nnose.\n\nJENNY\nPut your head back.\n\nAMSTERDAM\nThat don't work.\n\nJENNY\nPut your head back I said.\n\nAMSTERDAM\n(as she tends to him)\nSo why so sudden, then?\n\nJENNY\nSudden? Every day I see you and you complain I can't decide. Now I decide,\nyou say it's sudden.\n\nAMSTERDAM\nIt's the whore did it, then.\n\nJENNY\nDon't flatter yourself.\n\nAMSTERDAM\nIt's because you're jealous.\n\nJENNY\nIt's because you didn't lie about hitting me.\n\nAMSTERDAM\nChrist, I wish I had. Come here, then.\n\nHe reaches to pull her down on the bed.\n\nJENNY\nNot here. There's too much past.\n\nCUT TO\n\n81 INT. ROOM/DEAD RABBIT HOUSE\n\nThe room where Johnny fetched Amsterdam out for the fight. Amsterdam and\nJenny have just made love.\n\nJENNY\nIt must be morning.\n\nAMSTERDAM\nI don't care, I'm not getting up.\n\nJENNY\nThis is what you meant, then? It's going to be just the same from now on?\n\nAMSTERDAM\nWhat?\n\nJENNY\nEvery morning I wake up next to you.\n\nAMSTERDAM\nOr you don't wake up at all.\n\nJENNY\nWe only just started in and you're already threatening me.\n\nAMSTERDAM\nIt's not a threat.\n(no teasing now)\nIt's a declaration of love.\n\nJENNY\nI prefer my kind. This kind.\n\nShe reaches beneath the pillow and pulls out a fine DIAMOND RING, which\nshe slips on his finger. Amsterdam reacts with surprise, gratitude and (of\ncourse) suspicion.\n\nAMSTERDAM\nWhat's this? Where'd you get this?\n\nJENNY\nYou said I was the best thief in the Five Points. But I got\nrestless. Will you wear something I got?\n\nCUT TO\n\n82 EXT- UPTOWN STREET DAY\n\nA long street of tree-shaded houses. Spacious lawns. North of the Five\nPoints. Considerably north. This is the first time we have been outside\nthe Five Points and Paradise Square. The city\nrent place.\n\nJenny and Amsterdam stand near a residence at the end of the street.\nAmsterdam, dressed in a suit, can't quite conceal his wonder as he stands\nstaring at the house.\n\nAMSTERDAM\nWhat is this place?\n\nJENNY\nMy jeweler's.\n\nShe GESTURES for him to follow her and we see now that she is dressed in a\nmaid's outfit.\n\nJENNY\nCome on.\n\nAMSTERDAM\nI don't see nobody.\n\nJENNY\nThat's the best time. They're all having lunch.\n\nCUT TO\n\n83 EXT. UPTOWN HOUSE DAY\n\nAt the back door of the grand house, as Jenny OPENS it slowly and glances\ninside.\n\nAMSTERDAM\nYou're off your head.\n\nJENNY\n(pleased, showing off)\nYou can wait on me a minute. Or I'll see you back in the Points if you're\nscared.\n(Amsterdam looks at her)\nDon't worry. I know every house on this street. They all leave their doors\nopen. They live like they're not in New York.\n\nShe GOES IN the house. Amsterdam WATCHES through the window, sees her\ngoing up stairs. Then he looks at the dining room, visible distantly\nthrough an open kitchen door.\n\nHe WATCHES, fascinated, fragments of the everyday rituals of a world he's\nnever seen. As SOUNDS drift listlessly from the street beyond, and a light\nBREEZE blows, WE SEE IN A SERIES OF DISSOLVES the serving of a meal;\nSERVANTS carrying and passing plates; FAMILY MEMBERS reaching for dishes\nand passing them; the LOW KURMUR of Konversation in accents he has never\nheard. It's not so much that these people and their life are foreign to\nhim. It is as if he has stepped into another Dimension.\n\nHe loses his sense of time, and of danger. So that when Jenny TOUCHES his\narm she surprises him thoroughly.\n\nJENNY\nCome on. I might still be taken for a maid. But you're nobody's notion of\na butler.\n\n84 EXT. UPTOWN STREET DAY\n\nAs Jenny and Amsterdam walk away from the house. She holds his arm. They\nlook young and full of hope, like a servant couple just over from the old\ncountry enjoying a day off.\n\nJENNY\nThe Police Commissioner lives the next street over. I was thinking of\nvisiting him next month, but cops don't buy goods. They keep all their\ngraft in cash.\n\nAmsterdam looks at the houses with wonder that he tries to make casual.\nShe opens her satchel a little way, then NUDGES him to have a lock at the\nswag inside.\n\nJENNY\nHow's that for ten minutes?\n\nAMSTERDAM\nIt's a lot to fence.\n\nJENNY\nI'm not going to fence it. I'm going to keep it and take it where no one\nwill recognize it.\n\nAMSTERDAM\nWhere would that be?\n\nJENNY\nSomewhere west. Far west. Past the Mississippi River, somewhere into that\nterritory.\n\nAMSTERDAM\nThat's a hard journey for a woman alone.\n\nJENNY\nYou'd be with me.\n\nAMSTERDAM\nYou got it all planned and straight, is that it?\n\nJENNY\nOnce I said I'd be with you I wanted someplace we could be together.\nSomeplace better than here. What's the matter with that?\n\nAMSTERDAM\nNothing. Except there's no place but here for me right now. I got to\nsettle things.\n\nJENNY\nYeah, I know, but I'm talking about settling down, not settling debts.\n\nAMSTERDAM\nYou don't have my obligations.\n\nCUT TO\n\n85 EXT. PARADISE SQUARE DAY\n\nThe Dead Rabbits SWEEP across the bustling square, Johnny and Amsterdam in\nthe lead.\n\nJOHNNY\nIt's a fair day's wage. We just move the people out of the building, and\ncollect.\n\nAMSTERDAM\nWho from?\n\nJOHNNY\nWho owns the building.\n(points)\nThem.\n\nThe gang approaches a tumbledown BUILDING called Jacob's Ladder because of\nthe iron rungs that run straight up its front to the roof. Two\nwell-dressed GENTS stare at the building fretfully.\n\nGENT 1\n(to Johnny)\nI'm glad you came in force. There's half a hundred people still in there.\n\nGENT 2\nMaybe more.\n\nGENT 1\nAnd not one's given rent the whole year.\n\nAMSTERDAM\nYou live here?\n\nGENT 1\nNo, no, of course not.\n\nAMSTERDAM\nI mean in the city. A ways north, I'll bet.\n\nGENT 2\nYes. Why?\n\nA RIFLE SHOT sounds from an upper window and a Rabbit falls wounded. They\nall DUCK FOR COVER.\n\nJOHNNY\nIt's not just citizens in there?\n\nGENT 1\nOf course it is.\n\nJOHNNY\nwith arms?\n\nGENT 2\nFrom their damned gang. Some of them live there.\n\nAMSTERDAM\nSome of who?\n\nGENT 2\n\nThe Native Americans.\n\nJOHNNY\nWe didn't contract for that.\n\nGENT 1\nWe'll pay extra for the danger.\n\nAMSTERDAM\nNo danger. But you will pay extra.\n(turns; to gang)\nLet's go and greet some Natives.\n\nUnder SCATTERED RIFLE FIRE and a barrage of ROCKS, the GANG STORMS the\nbuilding, charging inside and starting up the ladder as if they were\nattacking a medieval fortress. ARMS reach out from windows to try and pull\nthem off. The Rabbits respond with knives and PISTOL SHOTS. As they charge\ninside, the CAMERA RISES to an OVERHEAD shot and we ...\n\nDISSOLVE TO\n\n86 EXT. PARADISE SQUARE DAY\n\nLater. The same OVERHEAD ANGLE. BODIES litter the street everywhere. Some\ndead and wounded Rabbits lie near NATIVES who have gone to their reward.\nSome BUILDING RESIDENTS wander the street in a daze. JOHNNY is collecting\nmoney from the Two Gents, who look very pleased as Amsterdam approaches\nwith Jenny. He's carrying a rifle he took from the building.\n\nAMSTERDAM\n(to Gents)\nAlright, then?\n\nGENT 2\nVery much alright. Quite a spectacle.\n\nAMSTERDAM\nOh really? Just the entertainment you favor, is it? Pardon me for a\nmoment, gents.\n(he turns to Jenny)\nYou wanted to settle, you and me. That's so, isn't it? You did agree, did\nyou not.\n\nJENNY\nI did, yes.\n\nAMSTERDAM\nGood, because I didn't want to act hasty. I can never tell for sure what\nyou're thinking, and sometimes I'm not always sure what you're saying...\n\nGENT 2\n(interrupting)\nExcuse me, we have to finish and...\n\nAMSTERDAM\n(to Gent 2)\nExcuse me. We'll conclude in a moment.\n(back to Jenny)\nWhere do you settle?\n\nJENNY\nAmsterdam, what are you saying?\n\nAMSTERDAM\nI'm asking, where does anyone settle?\n\nJENNY\nI don't know, you mean a place, a home?\n\nAMSTERDAM\nA home yes.\n\nGENT 1\nExcuse me, but we really must conclude.\n\nAMSTERDAM\n(ignoring him)\nWell, I'm saying to you then, Jenny Everdeane, welcome home.\n\nNo one sees it coming. Amsterdam FLASHES around, swinging the BUTT of his\nrifle into Gent l's midsection, doubling him over and sending him\nbreathless to the ground. Amsterdam SPINS again and swings the butt into\nGent 2's face, knocking him cold.\n\nAMSTERDAM\nFine place. Room enough for all.\n(to Johnny)\nGet them out of here.\n\nGENT 2\nThey'll come back looking for you.\n\nAMSTERDAM\nWith whose help? The Natives? They won't help these flourishing bastards\neven for ned.\n(to Jenny)\nTell any who wants they can stay. If they can't pay rent they can join the\ngang. But make sure the best rooms go to us. Look around ...\n\nJENNY\n(interrupting)\nI know this building.\n\nCUT TO\n\n87 INT. UNDERGROUND/JACOB'S LADDER\n\nAs Jenny leads Amsterdam through a narrow tunnel. The place is like a\nweird catacomb: it is narrow and dank, filled with bones of dead animals,\nof the two- and four-legged variety.\n \nJENNY\nThese lead all under the Square, into the Brewery and out again from\nthere. They're closed off and forgotten since the Reverend opened the\nmission. Pass me the candle.\n\nAmsterdam hands Jenny a stump of candle, which she holds high enough to\nsee...\n\n... that the tunnel has opened onto a small room just above the foundation\nof Jacob's Ladder. It's a graveyard, memorializing gang members gone to a\nbetter world--or worse. Trophies from many gangs--including the bones and\nskulls of some Dead Rabbits-litter the place in loose ritual fashion, as\nif this were a catacomb in Palermo.\n\nStooping low, Jenny walks to a narrow corner of the room, where several\nPAVING STONES have been laid in the rough pattern of a cross. A slab of\nslate serves as a headstone, and on it, in fading paint, barely legible,\nis the name \"Maggie Everdeane.\"\n\nJENNY\nWe lived in this building till she lost her seamstress work and we went to\nthe Brewery. One day she slept so drunk she never woke and I brought her\nback here. Dug this myself.\n(beat)\nFamilies. Give here what I gave you.\n\nAmsterdam hands her a chest that looks like a small version of\nBlackbeard's treasure box. She opens it and holds the candle close: inside\nis the swag from all her cat burglaries. There's a lot of it, GLITTERING\nwith promise in the GUTTERING flame. Jenny starts to dig in her mother's\ngrave.\n\nJENNY\nShe'll keep an eye on this for us. How about some help?\n\nHe KNEELS beside her and they dig at the grave with stones and bones.\n\nAMSTERDAM\nYou trusting me with your treasure, then?\n\nJENNY\nJust take another look at it to remind you. I can always do fine on my own.\n\nAmsterdam reaches inside the chest, pulls out a ring and SLIPS it onto\nJenny's dirt-covered finger. She KISSES him.\n\nJENNY\nWhat's mine is yours, is that it?\n\nAMSTERDAM\nI could use this, too.\n\nFrom the bag he holds up a small GOLD CROSS.\n\nJENNY\nYou making an offering to the Reverend Raleigh?\n\nAmsterdam slips the cross into his pocket without answering and starts to\ndig again.\n\nAMSTERDAM\nAre you sure we can trust your mother?\n\nCUT TO\n\n88 INT. HALLWAY/TAMMANY\n\nBOSS TWEED listens to an angry BILL THE BUTCHER as they walk briskly down\na long marble corridor lined with formal portraits of former Tammany\nworthies.\n\nBOSS TWEED\nThe building and how many?\n\nBILL THE BUTCHER\nA dozen at least of my Natives.\n\nBOSS TWEED\nThe Dead Rabbits are a wooly bunch alright.\n\nBILL THE BUTCHER\nI want at them. All of them, and Amsterdam especial. Now.\n\nBOSS TWEED\nNot just now. It's between too late and too soon. They've become a little\ntoo prominent for comfort, but they're still too small for you to soil\nyour hands. The man who killed Monk Eastman pushing around a mob of\nupstarts. It's practically undignified.\n\nBILL THE BUTCHER\nTo hell with any of that.\n\nTweed stops under a grand new PORTRAIT of himself.\n\nBOSS TWEED\nVery well, and to hell as well with any plans you and I may have for\ngrowth and change and even greater reward. You'll never advance anywhere\nbeyond the limited perimeter of your imagination.\n\nBILL THE BUTCHER\nI don't got to advance anywhere further.\n\nBOSS TWEED\nGot to, no. But ought to.\n\nHe hands him a fancy embossed envelope.\n\nBILL THE BUTCHER\nWhat's this?\n\nBOSS TWEED\n(eyes merry)\nAn invitation. To dinner.\n\nCUT TO\n\n89 INT. JENNY AND AMSTERDAM'S ROOM/JACOB'S LADDER DAY\n\nBetter by a little than their place in the old hideout. There's even a\nwindow that throws some LIGHT an the few bits of castoff furniture in the\nroom... an the bed where Jenny sleeps with her face turned to the dawn\nlight... and an Amsterdam, who is dressing quietly in the corner. He\nchecks in his coat Pocket,...finds the gold cross ... and leaves. Jenny\ndoes nat stir.\n\nCUT TO\n\n90 EXT. GRAVEYARD DAY\n\nSTART CLOSE on: Amsterdam's hand, as he places the gold cross in a small\nhole at a grave site, then covers it over with dirt.\n\nThen WE SEE: Amsterdam is kneeling at his father's grave.\n\nAMSTERDAM\nHe never had his own cross. Thanks.\n\nNow he STANDS and TURNS. Jenny is half-hidden behind an elm tree.\n\nAMSTERDAM\nYour touch is light, but as a tracker you work awful heavy. Come ahead.\nNow that I met your mother, you should come and meet my father.\n\nAs Jenny starts to WALK towards the grave, we see for the first time ...\n\n... that we are in the country, a graveyard in an open field with an\nastonishing PANORAMA of New York and the East River. (MATTE) The cemetery\nis atop a hill, and the East River, busy with ferries and vessels of\ntrade, glistens in the near distance. Just beyond it is Manhattan Island:\nlow buildings, winding narrow streets, houses surrounded by open land. A\nBREEZE off the river rustles Jenny's dress and blows her hair as she steps\nup to the grave site, looks at the headstone and sees ...\n\n... it is blank. No name, no date. Clean stane.\n\nJENNY\nYou should finish the stone.\n\nAMSTERDAM\nIt'll be finished when everything's finished. That's when helll rest. The\nhand that killed him is the hand that will bury him in peace.\n\nHe holds up his open hand, covered in dirt.\n\nJENNY\nIt was Bill killed him, not you.\n\nAMSTERDAM\nWith my hand on the knife.\n\nJENNY\nAnd his hand on yours!\n\nAMSTERDAM\nAnd me feeling the life go out of my father! He looked at me ... he looked\nat me and he swore me with his eyes. I could feel his spirit... I say I\ncould feel it rising... flowing through the knife like blood into my own\nheart.\n\nJENNY\nYou talk like he lives in you.\n\nAMSTERDAM\nI don't want him to live, I want him dead! I kill Bill and I'm free of\nthem both!\n\nJENNY\nYou think you can be free that easy? You need your way so clear, and\nyou''' use anything to clear it. Anyone, too. Me, everybody, we're all\njust a way for you to settle your damned ghosts.\n\nAMSTERDAM\nYou're part of me now, like the gang is part of me and my father both. If\nI can bring us to glory, then my father... like The Book says...my father\ncan enter his house justified.\n\nAs Amsterdam continues to talk we ...\n\nDISSOLVE TO\n\n91 MONTAGE\n\nThe growth of the Dead Rabbits, as we continue to HEAR Amsterdam speak\npassionately to Jenny. We first see the Rabbits surrounding and\nOVERTURNING a fire wagon; this starts as a live action scene but soon\nBLEEDS into SEPIA, then freezes like an old magazine illustration.\n\nAMSTERDAM (V.O.)\nAll of us is set on the same road together. The gang can have everything\nthey ever wanted and get me what I want while they're doing it. We're not\ninterfering with each other, we're helping each other. It's all the same,\nwe're all one together.\n\nWe CONTINUE with sepia illustrations: of Dead Rabbit morts picking pockets\nand purses along a crowded Broadway; climbing onto a wagon distributing\nnewspapers and tossing off the occupants, taking over the route\nthemselves; swarming all over a merchant ship in the harbor as the captain\ndoles out protection money to have his cargo unloaded.\n\nAMSTERDAM (V.O.)\nWe'll all have a share of the profit like we'll all have a portion of the\nfame. If we come to be notorious, that only means we're strong, and if\nwe're strong that means we're ready.\n\nA sepia illustration of a fire wagon rounding a corner, refurbished and\nmanned by Rabbits, all wearing striking uniforms with short capes called\nTAMLAS. (N.B.: they will be seen wearing the tanlas from these uniforms\nduring all gang activity throuqhout the rest of the film. Only Johnny,\nAmsterdam and Jenny do not wear them.)\n\nThe sepia illustration turns to live action as the fire wagon TEARS around\nParadise Square, SCATTERING everyone in its path, the Dead Rabbits\nlaughing, their tamlas FLYING behind them.\n\nAMSTERDAM (V.O.)\nAnd I'll know that time, know it right off when it comes. Just like I knew\nyou.\n\nThe live action DISSOLVES TO...\n\n... the last image in the montage: an ILLUSTRATION of Amsterdam, a\nhalf-decade older, turned out in fancy clothes, but with all his\nfierceness intact. This is a magazine illustration, and there is a dated\nheadline over his picture: \"Fresh Scourge of the Five Points.\" The date\nreads \"June, 1863.11\n\nAMSTERDA.M (V.O.)\nAnd just like that, there'll be no way of stopping till it's ended.\n\nFrom this illustration, we quickly...\n\nDISSOLVE TO\n\n92 EXT. RIVER DAY\n\n... Amsterdam, as he is in the picture, but in live action, SPRINGING to\n\nhis feet and YELLING at a couple of PRIZEFIGHTERS doing battle in a ring.\n\nAMSTERDAM\nNow! Finish him now!\n\nFar up the sparkling Hudson, a RAFT floats slowly upstream. It's a huge\nthing (perhaps half a city block in size) crowded with SPORTSMEN. They\nform a LARGE RING around two mammoth PRIZEFIGHTERS who are brawling with\nbare knuckles. Amsterdam and Johnny are among the spectators.\n\nJOHNNY\nOur man will take him in another five. What puts you in such a hurry?\n\nFIGHTER 1 fetches FIGHTER 2 a powerful roundhouse punch that sends him\nCRASHING to the deck. As soon as he hits the floor, a CARD GIRL appears\ncarrying a sign announcing \"Round 37.11 SECONDS drag the stupefied Fighter\n2 to his corner, while two BOYS minister to Fighter 1, SUCKING THE BLOOD\noff his knuckles.\n\nA GONG sounds to announce the appearance, in the center of the ring, of\nthe fight promoter, a florid and fulsome P.T. Barnum .\n\nBARNUM\nI want to extend thanks and admiration not only to our two combatants\ntoday, but to their sponsors, the Dead Rabbits ...\n(indicates one side of the ring)\n... and the Native Americans.\n\nHe FLINGS an expansive arm toward the opposite side of the ring, where\nBill the Butcher sits with Daniel Killoran and a large group of Natives.\nAmsterdam and the Butcher eye each other with all the old animosity: it's\nalmost ceremonial now, part of the Tradition.\n\nBARNUM\nTheir generous support allows me to bring you this splendid exhibition.\nWith their indulgence I'd like to remind you also of the further wonders\nthat await you at my new Museum, located on Broadway...\n\nThere are BOOS from the crowd at such untoward commercialism.\n\nBARNUM\n... P.T Barnum's gallery of wonders from worlds natural and unnatural,\nfrom nature and from myth!\n(continued boos)\nAnd to encourage you also in the view that new Albany ordinances\nforbidding sportive violence on land shouldn't dampen your enthusiasm for\nwagering. Bets down, entlegen, and you gents..\n(indicated fighters)\n... fists up!\n\nThe Fighters come to center ring, circle each other, then start slugging.\nA flurry of punches, and Fighter 2 GOES DOWN again. As he hits the deck,\nthe round automatically ends and the between-rounds ritual takes place\nagain.\n\nJOHNNY\nDobbs will take him this round. That'll be something. The Natives has\nnever lost before.\n\nAMSTERDAM\nBecause there's never been a Dead Rabbit fighting before.\n\nJOHNNY\nThat'll shame them thorough.\n\nAMSTERDAM\nThere'll be worse than shaming. We only got the Natives in range.\n\nIt's time to squeeze the trigger, John.\n\nThe next round begins and the Fighters set to, MAULING each other\nfuriously.\n\nJOHNNY\nDon't push the Natives too far, Amsterdam. Otherwise it'll be Tammany\npushing back.\n\nAMSTERDAM\nThat don't matter any more.\n\nJOHNNY\nIt does matter, and it's going to matter even more. Tammany's the heart\nand future of this city. If the Rabbits is going to keep growing, we're\ngoing to have to throw in with Tammany some way.\n\nThe action in the ring is FURIOUS. The Crowd cheers. Fighter 1 seems about\nto go down, but recovers and starts returning punishment to Fighter 2.\n\nJOHNNY\nThey got that Conscription Act from Washington keeping them busy, but they\nwon't leave us alone forever. And the Natives is strong as they ever been!\n\nIn the ring, Fighter 1 drives Fighter 2 to the deck again, and this time\nKNOCKS HIM COLD.\n\nAMSTERDAM\n(indicates Fighter 1)\nYou call that strong, John?\n\nIn the ring, a couple of agitated NATIVE AMERICANS are trying to get at\nthe Rabbit-sponsored winner. RABBITS start to RUSH the ring but Amsterdam\nWAVES them back.\n\nAMSTERDAM\n(to Johnny)\nThis is our time now!\n\nBARNUM\n(trying to make official announcement)\nThe winner... gentlemen, please! ... the winner in the 39th round is the\nDead Rabbits champion, High Water Dobbs ... please, gentlemen!\n\nThe unofficial ring COMBAT continues, knocking Barnum about, as the new\nchamp throws marauding Natives around like empty flower sacks. Amsterdam\niumps into the fray, PUSHES some Natives away. They start for him but the\nchamp stands them off while Amsterdam WHISPERS to Barnum.\n\nBARNUM\nJust a moment, please, gentlemen! There's a word for us all. Amsterdam\npromises ...\n(Amsterdam whispers to him briefly)\n\n... something large, something grand, something epic. The greatest these\nare my own words, of course the greatest righting of the gravest wrong\never done in the Five Points.\n\nThe crowd quiets, their sporting blood still up, curiosity engaged. Only\nJohnny seems glum, concerned.\n\nThis is to be a duel not for money, but for honor! A fight to the death...\n\nAMSTERDAM\n(interrupting, emphasizing)\nTo the death. If he can stand up to it.\n\nBARNUM\n... on which money, I hasten to add, may certainly be wagered. The names\nof the two champions are Amsterdam Vallon, here beside me, and ... and Mr.\nWilliam Poole, known to all as ...\n\nBILL THE BUTCHER\n(leaping up)\nThey know me by any name, you son of a bitch!\n\nThe crowd ERUPTS: this is a death match between Olympians. Only Johnny\ndoes not rejoice. He looks at Amsterdam's face, flush with the belief that\nthe right moment has finally come, and he has to turn away. He walks away\nfrom the ring as Killoran tries unsuccessfully to PULL the Butcher down\nand cool him off.\n\nBILL THE BUTCHER\n(yelling)\nI'll have him stretched on a spit!\n\nKilloran is beside him now, whispering urgently. Bill the Butcher shakes\nhis head vehemently.\n\nBILL THE BUTCHER\n(to Killoran)\nYou got no more to say about this now.\n\n92 CONTINUED:\n\nAMSTERDAM\nCome on, Bill! Let go of your Tammany wet nurse! My challenge, your terms.\n\nKILLORAN\n(to Bill)\nDon't do it, you can't do it! There's the Conscription to deal with, and\nelections coming, too. That's your calling now, not these ancient quarrels.\n\nBILL THE BUTCHER\nI'll do my work. But this is a shame, a public shame. It demands my\nattention.\n(yelling to Amsterdam)\nFine, then! Fine and welcome! Day after elections, we'll meet with seconds\non neutral ground to work out time and terms. It will be done and done.\n\nHe walks to the ring, holds his HAND out to Amsterdam.\n\nBILL THE BUTCHER\nYou know this hand. Last time it was this close, it was on your throat.\n\nAMSTERDAM\nI remember it better from another time.\n\nHe takes the Butcher's hand. The duel is on.\n\nCUT TO\n\n93 INT./EXT. DRAFT REGISTRATION OFFICE\n\nSTART CLOSE ON: money being counted out: $300. And a RECEIPT quickly\nwritten and given. We think at first this must be a bet being made on the\nduel between Amsterdam and Bill the Butcher-\n\nBut we go WIDER to reveal: an office, tables and chairs, and a line. Two\nlines, in fact. One, very long, filled with young man. And the second,\nvery short, in which a CLERK is handing the receipt to a PROSPEROUS YOUNG\nMAN.\n\nCLERK\nYour release from service, according to the terms of the Conscription Act.\nKeep it somewhere safe.\n\nPROSPEROUS YOUNG MAN\nI'll keep it with me.\n\nThere is only one OTHER PERSON standen behind the Prosperous Young Man,\nand he steps up quickly and hands $300 to the Clerk as the Prosperous\nYoung Man heads for the door...\n\n... past the second line, which snakes out into the street, filled with\ndraftees who SHOUT at the Prosperous Young Man as he leaves.\n\nDRAFTEE 1\nHey, tell your Papa to pass me three hundred dollars too.\n\nDRAFTEE 2\nTell him if he don't we'll come get you on our way to Gettysburg.\n\nThe Prosperous Young Man HURRIES away, but spots Boss Tweed and Daniel\nKilloran as he leaves.\n\nPROSPEROUS YOUNG MAN\nOh, Mr. Tweed, I'd take the time to say proper thanks but...\n\nBOSS TWEED\nNo thanks owed, son. Conscription's Federal Law, and so's the $300\nexemption. You might remind your father, though, that you saw me here\ntoday, minding that the law's strictly and equitably enforced.\n\nThe Prosperous Young Man hurries out, as the Draftees continue to holler\nabuse. Boss Tweed HEADS for them, followed by Killoran.\n\nKILLORAN\nYou see how much they like this damned law? Enforcing it's going to hurt\nus in elections.\n\nBOSS TWEED\nIt's not my law, and not my liking, either. But Washington's always\ntreated us with sufferance, and we must extend the same regard to them.\n(to Draftees)\nBoys, we are bound by honor and love of country to fight in this time of\ncrisis!\n\nDRAFTEE 4\nWe're bound by our wallets and the emptiness in them, that's what!\n\nBOSS TWEED\nBoys, the union is in distress, our land is wounded deeply, our future is\nsuddenly a frail and finite thing. We must ask ourselves how...\n\nDRAFTEE 5\nYeah, you could talk a dog off a meat wagen, Tweed. But let's see you\nfight!\n\nDRAFTEE 6\nThat'd be worth twice three hundred dollars to see!\n\nBOSS TWEED\n(as he backs off)\nThank you, boys, thank you for your understanding.\n(to Killoran)\nHoly Mother.\n\nTweed hustles Killoran outside, where the line of Potential draftees\nsnakes down the block and into Paradise Square.\n\nBOSS TWEED\nDaniel, between the blindness of Washington and the damned brass of Bill\nPoole Tammany will fall like an autumn leaf. We must take what measures we\ncan. Attend to the Butcher. After the elections, of course. Unless you\nthink Amsterdam will do our work for us first.\n\nKILLORAN\nHe could at that. Then he would become a fresh concern\n\nBOSS TWEED\nNot so daunting as this.\n(turns to the Draftees in the street)\nBoys, I've just had a word with your compatriots inside, and if you show\nhalf the sand and a fraction of the spirit they have manifeste for joining\nthis great struggle...\n\nThere is a chorus of BOOS and JEEPS from the Draftees outside.\n\nOUTSIDE DRAFTEE\nPut a rope around it, Tweed, and swing in your own wind!\n\nBOSS TWEED\nGreat weeping Jesus, Daniel, whatever happened to the halcyon days?\n\nCUT TO\n\n94 EXT. POLLING PLACE/PARADISE SQUARE DAY\n\nElection Day pandemonium. The Dead Rabbits aren't working the repeaters\nthis day, but Johnny observes the action as Native Americans--identifiable\nbecause of their long dusters--strongarm REPEATERS into the polls.\n\nHis attention is drawn to a HARRIED TELEGRAPH OPERATOR, who is being\nSHOUTED at by Natives as he is inundated by pieces of paper and teetering\nvolumes of the voting registry. It's chaos. The poor Operator can't cope.\n\nCUT TO\n\n95 INT. TAMMANY HALL\n\nIt's chaos here, too. The large main room is filled with TELEGRAPH\nOPERATORS receiving election returns. There is SHOUTING and CONCERN\nthroughout the room. Even Boss Tweed shows signs of worry.\n\nBOSS TWEED\nI swear that science will be the death of industry.\n\nKILLORKN\nThe telegraph moves the voter tabulation by wire faster than we can get\nthe repeaters in and out.\n\nBOSS TWEED\n(losing patience)\nYour role is to expedite, Daniel, not to explain.\n(Killoran looks at him blankly)\nDo something!\n\nJOHNNY\nIf you'll allow me.\n\nThey both TURN to see Johnny standing coolly before them.\n\nJOHNNY\nThere's a scheme we might try.\n\nKILLORAN\nYou got no place among us, get the hell out of here however you come in.\n\nBOSS TWEED\nA moment please, Daniel. One moment.\n(to Johnny)\nYou're a Dead Rabbit, aren't you? Friend to Amsterdam?\n(Johnny nods)\nAnd therefore no particular friend to us. What brings you here?\n\nJOHNNY\nOpportunity. Science and opportunity.\n\nKILLORAN\nYou got opportunities enough among your own.\n\nJOHNNY\nI did have. But times change faster than people. Some people, anyhow. And\nI like to stay with the advantage.\n\nBOSS TWEED\nWell, then, a Gentleman of foresight! Are you suggesting... or perhaps\nyou're even saying... that your friend and your gang may be ... well,\nlagging behind the great march of history?\n\nJOHNNY\nSomething like that, yeah.\n\nBOSS TWEED\nWell fine, step up to history then and tell us what you have in mind.\n\nCUT TO\n\n96 EXT. POLLING PLACE/PARADISE SQUARE DAY\n\nSTART CLOSE ON: telegraph wire, HUMMING with the election returns. And,\nbelow it--far below--Johnny, Killoran and a couple of TAMMANY BOYOS,\nlooking up at the wire.\n\nBOYO 1\nI ain't goin' up there. I got my election suit on.\n\nJOHNNY\nThis election'll be over unless we get up there.\n\nKILLORAN\n\"We?\" This was your notion, you go up there.\n\nBOYO 2\n(looking at polling place)\nHim. He looks likely, and he ain't workin'.\n\nHe points over at Sheeny Mike Kurtz, who is observing the action at the\npolls.\n\nJOHNNY\n(calls to him)\nSheeny Mike, you want to make ...\n(to Boyo 1)\n...how much?\n\nBOYO 1\nA dollar.\n\nJOHNNY\n(to Sheeny Mike)\nFive dollars? Just to help us?\n\nSHEENY MIKE\n(a bit wary)\nWhat's the pitch, Johnny? Amsterdam wouldn't like it, working with Tammany.\n\nBOYO 2\nWell, now, if Amsterdam wouldn't like it ...\n\nJOHNNY\n(interrupting)\nHe knows about it. Welre working a whole new scheme. But I won't tell him\nyoulre helping, if that's the way you want it. And you can keep the full\nfive. Just start climbing.\n\nSHEENY MIKE\n(beat)\nWhere's the ned?\n\nBoyo 2 hands Sheeny Mike five bucks, which he pockets as Boyo 1 gives him\na large pair of SHEARS. Mike wipes his palms on his pants and STARTS UP\nthe pole.\n\nFor Killoran and the Tammany Boyos, this is like a circus stunt. They\nwatch Mike's ascent with pleasure.\n\nSheeny Mike is quite pleased with himself as he nears the top of the pole.\nHe turns to look at Johnny and the Tammany group below. A couple of\nSPECTATORS have stopped to watch as well.\n\nMike gets to the top of the pole, REACHES OUT--STRETCHES OUT-toward the\ntelegraph wire with the shears...\n\n... strains... reaches ... MAKES THE CUT.\n\nOn the ground, Johnny looks relieved. The Boyos offer a partmocking round\nof applause.\n\nIn the spirit of things, Sheeny Mike TURNS to acknowledge the applause.\nJust briefly. But long enough so he's distracted. He sees the upturned\nFACES fill suddenly with fear, and he TURNS when he HEA.RS a sharp, odd\nWHISTLING NOISE.\n\nA LIVE TELEGRAPH WIRE is coming at him. He doesn't even have time to\nscream. The wire hits him, whipping around him as JOLTS OF NT leap through\nhis body and he FALLS to the ground.\n\nCUT TO\n\n97 EXT. PARADISE SQUA.RE DAY\n\nHANDS pick up the lifeless body of Sheeny Mike and start to carry it\noff... past Amsterdam and Jenny, who stand on one side of it, watching...\nand Johnny, who is on the other.\n\nJOHNNY\nHe was working a Tammany job, Tammany will see to him.\n\nAMSTERDAM\nHe wasn't Tammany. Not like you.\n\nJOHNNY\nHe made the right choice.\n\nAMSTERDAM\nYou don't know what you're saying! You killed one of our own. One of your\nfamily!\n\nJOHNNY\n(slowly)\nI didn't know he was going to die, Amsterdam. And don't tell me what's my\nown and what isn't. You're not my family. And I swear, I swear on the\nVirgin Mother's eyes ... I know what I'm doing, Amsterdam. It's you that's\nalways been blind.\n(they look at each other)\nI'll say my farewells.\n\nJohnny KNEELS down beside Mike's body, brushes the hair from his brow.\n\nJOHNNY\nYou still smell like drink.\n\nHe nods to the Rabbits to carry the body on and, as he RISES a half-dozen\nNEWSBOYS DASH into the square, carrying fresh copies of the Tribune and\ncrying...\n\nNEWSBOYS\nNew Tammany victory! Fernando Wood elected to third term! Tammany ticket\nprevails by narrow margin! Boss Tweed vows\nArmageddon for crime!\n\nJOHNNY\n(looking at Amsterdam and Jenny)\nCan't you hear the future?\n\nHe walks away from the gang, through the rushing Newspaper Boys.\n\nCUT TO\n\n98 INT. SPARROW'S CHINESE PAGODA\n\nThe place has been cleared out for a war council: Amsterdam with a couple\nof Dead Rabbits, and Bill the Butcher with a few Natives. They sit at a\nround poker table with a green felt top.\n\nJIMMY SPOILS\nWe say the Square is the place. Let Barnum sell the tickets for a share of\nthe price...\n\nNATIVE SECOND\n(interrupting)\nA small share.\n\nJIMMY SPOILS\nAnd the Rabbits and Natives will split the majority portion equal.\n\nNATIVE SECOND\nWho works the crowd?\n\nAMSTERDAM\nNobody. This is a day of honor. No pickpockets, no lush-rollers, nothing.\n\nBILL THE BUTCHER\nI'll cut their hands off. After the fight.\n\nNATIVE SECOND\nWe got to fix positions for everyone so there won't be no other fighting.\nI know for fact the Roach Guards has sworn blood against the Black Birds,\nand the Forty Thieves don't tolerate the Chichesters.\n\nAs these delicate negotiations continue, the only two outsiders in the\nplace, Mother Joyce and a Bartender, are listening intently on the far\nside of the room.\n\nBARTENDER\nAmsterdam will make the Butcher a fine banquet.\n\nMOTHER JOYCE\nMy ned's on the boy. He's got the youth, and he's got the hunger.\n\nBARTENDER\nIs he so hungry you'll put up a hundred?\n\nMOTHER JOYCE\nTwo.\n\nCUT TO\n\n99 EXT. PARADISE SQUARE DAY\n\nOFFICIALS stand on a high wooden platform facing a JEERING CROWD. Banners\nannounce a \"DRAFT LOTTERY.\" OFFICIALS are preparing to draw the first\nnumbers as Boss Tweed gives out with a speech.\n\nBOSS TWEED\nYour honor... yes, and the law of the land... lies in the balance. The\nConscription Act of 1863 was handed down by President Lincoln himself ...\n\nCROWD MEMBER\n(shouting)\nIf Lincoln signed it, then let Lincoln fight!\n\nCROWD MEMBER 2\nIt's an army of the poor fighting for a bunch of rich slackers!\n\nCROWD MEMBER\nTammany's been our voice, let Tammany pay the exemption for all!\n\nA YOUNG MEMBER of the crowd steps forward as Boss Tweed turns to look at\nthose backing him on the platform: Killoran, a CAVALRY OFFICER in fancy\ndress ... and, out of sight of the crowd, Johnny Sirocco. Their\nexpressions are not reassuring.\n\nYOUNG CROWD MEMBER\nYour first payment, m'lords.\n\nThe Young Crowd Member hurls a STONE through the front window of a nearby\nstore. The CROWD cheers and runs to sack the store, and others SURGE\ntoward the platform. Johnny'and Killoran grab a fearful Tweed and rush him\nto safety. But the Cavalry Officer stands his ground with sword and\npistol. He SHOOTS.\n\nThat STOPS them. But only for a fractured, eerie moment. Then they jump on\nthe Cavalry Officer, PULL him to the ground, begin to KICK and BEAT him.\n\nCUT TO\n\n100 EXT. STREET/JACOB'S LADDER NIGHT\n\nA building burns at the end of the street, spreading a silhouette of smoke\nand flame in the air...\n\n... as a LION CHARGES down the street, growling, scattering RIOTERS in its\nwake. It's a mad, frightening sight, like a fulfillment of the Biblical\nprophecy produced by P.T Barnum, whose Museum is burning in the distance.\n\nSCREAMS, YELLS, CURSES and GROANS. CRIES of pain and fear as RIOTERS jump\nout of the way of the wild animal, then course up the street toward\nBroadway burning in the distance.\n\nFrom ABOVE, on the roof of Jacob's Ladder, Amsterdam and Jenny watch the\nmadness below.\n\nAMSTERDAM\n(watching lion)\nThat must be the vanguard of Barnum's army.\n\nJENNY\nThis city will burn like Gomorrah.\n\nAMSTERDAM\nThen we'll take what we can before it gets too hot.\n\nJENNY\nI think it's past that already.\n\nAMSTERDAM\nIt'll never come to that. These people ain't gang-led and they have no\npurpose.\n\nThey'd rather die for themselves than the army, that's the purpose. What\nwould you do?\n\nAMSTERDAM\nFight better and not get so mad. They're only doing what they should have\ndone years ago. Why'd they ever think there was another way to live?\n\nJENNY\nThey believed what people told them, that's all.\n\nAMSTERDAM\nWhat people is that? The Reverend at the mission? Boss Tweed? Daniel\nKilloran? People like Johnny Sirocco?\n\nJENNY\nYou believed Johnny.\n\nAMSTERDAM\nHell.\n\nJENNY\nAnd I believed you.\n\nAMSTERDAM\nI ain't done nothing different than what I told you, Jen.\n\nJENNY\nI believed what you said abaut being with me, with me alone. But you lied\nto me. It's not me alone, it's just you and Bill Poole. Youlre so\nblood-blind you can't see nothing else, not even this!\n\nAMSTERDAM\nI don't care a fine damn about what they want! It's what I want! They\nwon't dare harm the Points, that's all I care about! Let them turn the\nrest of the city into hell! It's another country anyway.\n\nJENNY\nIt's not a country for me, Amsterdam. I don't know about you. Will you\ncome with me?\n\nAMSTERDAM\nNot now.\n\nJENNY\nNow is when I'm going. Will you come?\n\nAMSTERDAM\nI don't want all this fighting to go to waste, Jen. I want to come out of\nit with something. And I got to be waiting for the Butcher.\n\nCUT TO\n\n101 INT. UNDERGROUND/JACOB'S LADDER\n\nJenny digs out her treasure from her mother's grave, throws open the box,\nstarts to GRAB all the swag she can and hide it on her person... in her\npockets, under her clothes, anywhere. She takes as much as she can, but\nshe has to travel fast.\n\nCUT TO\n\n102 EXT. STREET NIGHT\n\nBeginning a swift series of scenes that are like a laudanum nightmare.\n\nThe street is JAMMED with people fleeing and people fighting... as Jenny\nforces her way through, trying to escape.\n\nA small mob starts to ATTACK a house where a TERRIFIED FAMILY stands in\nthe doorway.\n\nFAMILY MAN\nWe're with you, don't harm us!\n\nMOB MAN\nShow us your spirit and come out with us then!\n\nMOB WOMAN\nAnd put a candle in the window to show you're one with us! Every light is\na flame against the draft!\n\nThe WIFE begs her husband not to join the mob, but they PULL HIM out into\nthe street. The Mob Woman hands the Wife a candle, then runs back to join\nthe mob.\n\nJenny starts to cross Paradise Square now... tries to cross, anyway... and\npasses the stand where Tweed delivered his speech that very morning. She\nsees: the Cavalry officer. Several MOB WOMEN have revived him with water.\nHe has been beaten terribly, but as he MOANS and starts to regain\nconsciousness, the MOB WOMEN fall upon him with fresh fury, KICKING and\nHITTING his helpless body. They BREAK his bones with rocks and TEAR OFF\nthe fancy braid of his uniform to hang around their necks.\n\nNow a SECOND MOB RUSHES toward the first from the opposite side of\nParadise Square. Chaos. Jenny is buffeted wildly. It's like being in a\nwhirlpool. She grabs a LITTLE GIRL whose face is bruised and blaody but\nwhose eyes shine wildly.\n\nJENNY\nWhat is it?\n\nLITTLE GIRL\nCops has everything closed to the north, and the militia's coming.\n\nCUT TO\n\n103 EXT. STREET/FIVE POINTS NIGHT\n\nAs Jenny presses her way through the mob-devoured streets. She sees: MEN,\nWOMEN and CHILDREN attacking a small group of BLACKS.\n\nBOY\nMy Daddy don't have to die for you! Why should he fight and die for you?\n\nJenny looks ahead, sees: the river, in the distance. And flames. She runs\nforward, STUMBLES. Some of the swag FALLS to the street. She SCRAMBLES to\npick it up as Rioters rush by her.\n\nCUT TO\n\n104 EXT. PIERS HUDSON RIVER NIGHT\n\nMATTE: The surface of the water looks like a mirror made of flame. The\npiers are BURNING. The docks are ash.\n\nSAILORS battle a MOB for possession of a small rowboat. As they fight, the\nboat starts to DRIFT. Jenny spots it, RUNS for it\n\n... but so does ANOTHER GIRL. Younger than Tenny--20 maybe, Jennyls age\nwhen Amsterdam fell in love with her. They both get to the boat at the\nsame time. Each grips it by a gunwale, and they STARE at each other like\ntwo jungle beasts over a kill.\n\nJENNY\nI'd kill you for this.\n\nThe Girl lunges at her with a knite, and Jenny SHOOTS. The GIRL slides\ninto the flame-reflecting Hudson as if she drowning in a pit of lava.\n\nJenny climbs into the boat and frantically starts to row. We stay CLOSE on\nher ... working the oars clumsily, furiously ... moving the boat across\nthe water, trying to get away from the city...\n\n... and we go WIDER now. A huge line of IRON--like the side of a\nglacier... bisects the frame, then starts to move. Jenny\nturns, SEES it. It is ...\n\n... the looming hull of an ironclad war ship (MATTE). It LOBS cannon fire\ninto the city, setting off tremendous explosions.\nJenny TURNS back for the shore...\n\n... as cannonballs land, devastating rioters.\n\nCUT TO\n\n105 EXT. SHORE/RIVER NIGHT\n\nMATTE: Police and MILITIA push the rioters back toward the river like\nrats. A cannanball EXPLODES in their midst...\n\n... injuring many more cops and militia than rioters. The rioters rally,\nRUN over the bodies of fallen cops and soldiers. Now the advantage is\ntheirs; cops and militia are in retreat.\n\nJenny climbs up on shore and joins the mob as it presses back inland.\n\nCUT TO\n\n106 EXT. DOYERS STREET/THE BLOODY ANGLE NIGHT\n\nFurther from the docks. Shells still exploding in the distance. Jenny\nmoves with the marauding mob, recognizes Doyers Street. She splits away\nfrom the mob, moves stealthily into the street known as the Bloody Angle.\nAnd STOPS.\n\nWeird shadows dance on the walls of the buildings. SMOKE and EERIE LIGHT.\nThe angle is lined with lampposts. And from every lamppost dangles the\nBODY of a black man. Or woman. Or child. Some are still smouldering.\n\nAt the base of a lamppost, a group of RIOTERS have cut open the hog-tied\nCORPSE of a black man and are pouring oil into it. One of the Rioters sees\nJenny, grins and holds out the TORCH he's holding. She shakes her head and\nstarts to BACK out of the alley.\n\nThe Rioter touches the torch to the oil in the wound of the corpse. The\nbody IGNITES in flame. The RIOTERS pull on a rope and the body rises,\nburning, to the top of the lamppost ...\n\n... where its awful shadow joins all the others in the madhouse\nrefractions on walls all up and down the street. On the street, as the\nflames dance and the bodies burn, rioters DANCE and SING. Walpurgis Night.\nFrom these mad SHADOWS, we...\n\nDISSOLVE TO\n\n107 EXT. ROOF/JACOB-S LADDER NIGHT\n\n... the face of Amsterdam, stepping out of the SHADOWS of the roof. There\nare flames in the distance. The whole gang is assembled, facing him as he\nspeaks.\n\nAMSTERDAM\nNo we ain't going to fight, but we can take something for ourselves out of\nthis.\n\nJIMMY SPOILS\nI want to know who hung them bodies in the Bloody Angle. I want to address\nwho done it.\n\nAMSTERDAM\nFive thousand people in the street done it! Boss Tweed done it! Abe\nLincoln done it! There's nothing you can do about any one of them but stay\nwith us. You'll have a little of your own back.\n\nJIMMY SPOILS\nHow's that?\n\nAMSTERDAM\nThese riots are a gift. They...\n\n... he PAUSES just for a moment as he sees a hand on the last rung of the\noutside ladder leading to the roof: it's Jenny, returning.\n\nAMSTERDAM\n... they've made everything clear, as you might say.\n(to Jenny)\nAre you with us, then?\n\nJENNY\nUntil I can get out. I'll go with you...\n(straight at Amsterdam)\n...meantime.\n\nAMSTERDAM\nGood. We're going for the Armory at Canal Street.\n\nJIMMY SPOILS\nThe Armory! We'll have to beat the militia to get there.\n\nAMSTERDAM\nThere's a way through the lines. Jen, did you see the cops and militia?\n\nJENNY\nI can show you from here where they are. I doubt they'll get to the Armory\nin force before midday tomorrow.\n\nAMSTERDAM\nWe'll get there first. We'll take everything we can carry, and destroy the\nrest so no one else has the use of it, the militia, the Natives, nobody.\nThen we'll turn to real business. We'll go down to the Battery.\n\nJIMMY SPOILS\nWhy, we going to take a sail to Europe?\n\nAMSTERDAM\nNo. But we could, after this. We're going...\n(slowly, savoring this)\n...we're going to take the banks. The government banks.\n(awed silence from all)\nAre we not?\n\nJENNY\n(beat; steps forward)\nSeems we are.\n\nOne by one, then in small groups, the entire gang FOLLOWS her. They are\nuncertain, reluctant, even frightened at the audacity of the scheme. But\nthey stand with Amsterdam.\n\nCUT TO\n\n108 INT. MAIN ROOM/TAMMANY HALL NIGHT\n\nThe crowded main room of Boss Tweed's domain, jammed with anxious\nPOLITICOS and OFFICIALS, as well as a harried group of TELEGRAPH OPERATORS\nwho receive news of the riots from all over Manhattan. There is a huge map\nof the city against one wall: the place has been converted from a\npolitical princedom to an operational headquarters. Johnny Sirocco and\nBill The Butcher are there. Other guests include the GOVERNOR, Mayor\nFernando Wood, and a badly shaken Horace Greeley.\n\nGREELEY\nThey attacked me! I had every sympathy for them at first...\n\nBOSS TWEED\nToo much sympathy, Horace. Writing these riots were a rising against\n\"unjust laws and unsuitable law-givers.\" The shame!\n\nGOVERNOR\nI suspended the draft at noon but the mobs only grew more virulent. It is\na criminal rising of the lowest class, of the Gangsters and rabble who\nhave been allowed by Tammany to run lawless!\n\nBOSS TWEED\nIt was Tammany and the rabble that elected you, Governor. And it's Tammany\nand the gangs who'll stop it. Isn't that so, Bill?\n\nBILL THE BUTCHER\n(nods at Johnny)\nI won't say nothin' in front of him. Who knows what business he's here on?\n\nBOSS TWEED\nHe's here on our business and my invitation. He's already been of great\nhelp. What's the opposition strength, John?\n\nTo answer, Johnny yanks back a CURTAIN drawn across a high window. The\nview, looking downtown, is one of almost continual ILLUMINATION-- every\nplace the eye falls, CANDLES burn in sympathy for the rioters.\n\nJOHNNY\nEach candle is against you, gents.\n\nMAYOR\n\"Against you,\" sir? Don't you mean \"us\".\n\nJOHNNY\n(diplomatic)\nSome of us come from those people, Mayor. I'll not deny they still claim\npart of me.\n\nMAYOR\nWhich part? Perhaps your heart.\n\nBOSS TWEED\nGentlemen, I'm sorry you find it necessary to question the loyalty of my\nfriend here, and by extension, my own judgement. So as proof ... John,\nwhere will the mob go? What will the gangs do?\n(Johnny is uneasy about answering)\nGo on, tell them what you told me.\n\nJOHNNY\nThere's no telling about the mob. Or the small gangs. But the Dead Rabbits\n... if I was Amsterdam...\n\nBOSS TWEED\n(interrupting)\nAs indeed you nearly was. Were.\n\nJOHNNY\n... if I was ... I'd figure to take the Rabbits to the Armory.\n\nBOSS TWEED\nWould you agree with that, Bill? Wouldn't you do the same? If you were\nfighting against the militia instead of beside them?\n\nBILL THE BUTCHER\nBeside them? What are you talking... ?\n\nBOSS TWEED\n(interrupting)\nYou will have to fight beside them to take the Armory. It cannot fall into\nunfriendly hands.\n\nBILL THE BUTCHER\nI can't stand with the militia against the people. I could never work the\nPoints no more if I did.\n\nBOSS TWEED\nWe're all of us swept up in a great tide of events, Bill. Have you learned\nto swim?\n\nFrom Bill's face, struggling to make sense of this, knowing Tweed's right\nbut not wanting to believe it, we ...\n\nDISSOLVE TO\n\n109 INT. MAIN ROOM/TAMMANY HALL NIGHT\n\n... Johnny's face, as Tweed talks to him. It is later, and the Butcher has\nleft. The activity is still frantic all around, but Tweed speaks in\nunhurried tones.\n\nBOSS TWEED\nI'm sure that Bill will do his usual splendid job. But after that ...\nwell, I'm afraid he's grown away from us.\n(Johnny looks puzzled)\nHe shows distressing signs of... shall we say, free-thinking. Crime\nflourishes in chaos, and these riots could encourage Bill to overstep\nhimself. He no longer inspires in me the same trust... well, that you\nmight. If you can prove yourself further.\n\n109 CONTINUED:\n\nJOHNNY\nYou already said in front of everyone you trusted me.\n\nBOSS TWEED\nIn vital things. Would I be talking to you now otherwise? Vital things,\nbut small things. Are you equal to greater responsibility and opportunity?\n\nJOHNNY\nSuch as what?\n\nBOSS TWEED\nRidding me of Bill the Butcher.\n(Johnny is startled)\nHe may question your loyalty to me, but Bill would never believe you had\nthe sand to go against him. He'd never expect it. Do you have the sand?\n\nFrom Johnny's face, struggling to make the right answer, we...\n\nDISSOLVE TO\n\n110 INT. JACOB'S LADDER\n\n... Ansterdam's face, as he looks up from preparing a brace of pistols for\nthe next day's scheme.\n\nAMSTERDAM\nLet him in.\n\nJohnny enters the common room of Jaccb's Ladder, where the Dead Rabbits\nhave gathered to ready themselves. As they work over their weapons and\nprepare battle dress, Johnny walks through their midst. They do not\nacknowledge him... except for Jenny.\n\nJENNY\nDid you miss us, John?\n\nJOHNNY\nNot a bit.\n\nAMSTERDAM\n(rising to meet him)\nAre you here to spy?\n\nJOHNNY\nI don't have to spy.\n\nAmsterdam leads Johnny off to a shadowy corner of the room where they can\ntalk privately.\n\nJOHNNY\n(as they walk)\nI know what you're doing. I told Tweed what you're doing.\n\nAMSTERDAM\nYou don't know what I'm doing.\n\nJOHNNY\nYou're going after the Armory.\n\nAMSTERDAM\nAm I now? Why do you think that?\n\nJOHNNY\n'Cause that's what I would do, and you and I think alike.\n\nAMSTERDAM\nNo more. And it don't seem worth a visit to tell me something you already\nthink I'm doing.\n\nJOHNNY\nThere's something else alright. Tweed's arranged to kill Bill the Butcher.\n\nAMSTERDAM\n(disbelieving)\nWho could Tweed get to do that?\n\nJOHNNY\nOne of his own.\n\nAMSTERDAM\nThere's no one around him...\n\nJOHNNY\n(interrupting)\nListen, it don't matter who, it's going to be done, that's all! Tweed\nain't going to wait around\nfor you and Bill to settle yourselves. I'm telling you so you have a\nchance.\n\nAMSTERDAM\nChance of what?\n\nJOHNNY\nA chance... a chance to do what you want. Bury the Butcher, draw what\nblood you got to. But you better make speed. The Natives will move on the\nArmory too.\n\nAMSTERDAM\nAnd what's any of it mean to you?\n\nJOHNNY\nIt means whatever's left of friendship, I don't know. There's still part\nof me here. I don't\nwant to see you lose everything in your life at once.\n\nAMSTERDAM\nI'm going to lose nothing.\n(beat)\nIf you believe me, you can stay.\n\nJOHNNY\nI got to go.\n\nHe turns so Amsterdam can't see his face and LEAVES-\n\nJENNY\nSo Tammany's going to kill the Butcher. That puts you and Tweed on the\nsame side. Does that make the path clear enough to suit you?\n\nFrom Amsterdam's face, trying to work out all the new angles, we...\n\nDISSOLVE TO\n\n111 INT. NATIVE AMERICAN HIDEOUT\n\n... Amsterdam's face, full of resolve, staring unblinking as ...\n\n... the barrels of two dozen RIFLES SURROUND the edges the screen, boxing\nAmsterdam in, as if his head were in a frame.\n\nAnd Bill the Butcher gazes at him with astonishment. We are, for the first\ntime, in the Natives' lair, a house hung with American flags of all shapes\nand vintages, some of them torn by battle, others by years of weather and\nuse. Some of them go back to the early days of the republic. There is not\nan inch of wood or wall space to be seen for all the stars and stripes.\n\nBILL THE BUTCHER\nMurder Me? No one's going to murder me.\n\nAMSTERDAM\nThen you better learn to fight locking over your shoulder, Bill, because\nthat's the only way you'll ever see it coming.\n\nBILL THE BUTCHER\nI don't believe it, and I don't believe it's you telling me. You got no\nreason to care about any danger to me.\n\nAMSTERDAM\nOne reason. You're my kill, Butcher. No one else is going to have you, not\nTweed, not Tammany, not those pigs in the street. No one--not even you,\nBill--will ever take the pleasure of your death away from me. I'd do\nanything to keep you for my own, even if I have to protect you.\n\nBILL THE BUTCHER\nYou protect me? Get out of here and go to hell.\n\nAMSTERDAM\nFine, so long as I pass you on my way.\n\nBILL THE BUTCHER\nMaybe I'd believe you more if I knew who was talking to you.\n\nAMSTERDAM\nSomeone I credit.\n\nBILL THE BUTCHER\nThat means nothing to me. None of this means nothing to me because I am\nTammany. Without me and my Natives they're nothing but a bunch of old\nhorses at a trough.\n\nAMSTERDAM\nYou join with me and we fight against Tammany, fight them back and out of\nthe Points. Then you and me can settle. But if you don't join with me,\nthen there won't be no settlement because you'll be murdered in the street\nand the whole Points will be mine.\n\nBILL THE BUTCHER\nI relish the thought... just the thought... of cutting you up and opening\nyou wide. So if just thinking about it gives me such pleasure, imagine how\nI'm going to enjoy doing it.\n\nAMSTERDAM\nWhy don't I make it easy for you, then.\n\nHe TURNS his back on the Butcher and starts to walk out, through the\nentire gang of Natives.\n\nAMSTERDAM\nSame as you're making it easy for Tweed.\n\nHe keeps walking... through the Natives ... dozens of ancient enemies\nglowering at him.\n\nBILL THE BUTCHER\nAmsterdam!\n(Amsterdam looks around)\nDon't be like your father. Don't make it too easy.\n\nAmsterdam struggles to keep his temper. But he turns and keeps walking\nthrough the enemy camp as we...\n\nDISSOLVE TO\n\n112 INT. JACOB'S LADDER\n\n....Amsterdam walking. But this time, he is WALKING among his gang. All\nthe Dead Rabbits are assembled, weapons ready. Jenny is beside him. Then\nJimmy Spoils. Then a few others.\n\nAs the group passes, others STAND and walk with them...\n\n... until the whole gang is rallied...\n\n... and bound for the passageway in the corner of the room that leads\nunder the building.\n\nDISSOLVE TO\n\n113 INT. BASEMENT\n\nAs Amsterdam and the gang heads through the catacomb-like basement, past\nthe graves, into a tunnel. Torchlight GUTTERS all around. Their steps echo\nlike repeated rifle shots.\n\nDISSOLVE TO\n\n114 INT. TUNNEL\n\nThe whole gang MARCHES down a tunnel under the Old Brewery. Except for\nAmsterdam and Jenny, they all wear their tamlas. Many have marks and gang\ninsignia on their faces. All of them have weapons. A lot of weapons.\n\nFrightened FACES--people seeking shelter and safety from the riots--appear\nin the darkness, then vanish like ghosts.\n\nAs the Rabbits walk, they summon memories of the first fight, that same\nmarch through the tunnels when Amsterdam marched beside his father.\nAmsterdam's face gives little away. But perhaps he is remembering that day\ntoo.\n\nDISSOLVE TO\n\n115 INT. TUNNEL\n\nThe last tunnel.. Shreds of light from a door in the distance. Amsterdam\nwalks up to the door and--just as Monk Eastman did years before--KICKS it\ndown. Dim dawn LIGHT FLOODS the tunnel as the Dead Rabbits step out.\n\nCUT TO\n\n116 EXT. CANAL STREET DAWN\n\nThe first thing we see is an ELEPHANT, who trumpets fearfully at the\nsudden sound of the sattere door. The gang stops, wary of this huge\nrefugee from Barnum's Museum, but the animal is more frightened of them.\nIt hurries on down the street...\n\n... revealing behind it a group of several dozen RIOTERS who carry a huge\nAmerican flag and a long wooden plank bearing the legend \"No Draft.\" They\nstare at the Rabbits with something near reverence.\n\nAMSTERDAM\nWhere's the Native Americans?\n\nRIOTER\nAin't seen them. Ain't here.\n\nAMSTERDAM\nAnd the militia?\n\nRIOTER\nThere's a detachment coming on from two streets over. The rest is still\nnorth of here. What are you after?\n\nAmsterdam POINTS to a formidable building a block away: the Armory. It\nlooks like a fortress.\n\nRIOTER\nThe Devil himself couldn't take that place.\n\nAMSTERDAM\nThat's why he sent us.\n\nCUT TO\n\n117 EXT. STREET NEAR ARMORY/ DAY\n\nThe DETACHMENT of militia proceeds warily towards the Armory. They are a\nyoung, uncertain-looking outfit; their COMMANDER looks like an upstate\nfarm kid. He tenses and his eyes widen as he sees Jenny walking toward\nhim, carrying a BOY in her arms.\n\nJENNY\n(crying)\nHelp me. Oh please help me. He's shot, we need a doctor, please help.\n\nDETACHMENT COMMANDER\nMiss, we ain't a medical outfit. The main unit's ten minutes behind us,\nthey'll have...\n\nHe doesn't get the chance to finish. Jenny DROPS the Boy from her arms and\nshoots the Detachment Commander once, cleanly...\n\n... as the Boy roles into a prone position and FIRES two shots into the\nstunned Detachment...\n\n... while the Dead Rabbits SWARM from every doorway along the street,\nFIRING GUNS and brandishing weapons.\n\nIt's over in seconds. The Detachment has hardly gotten off a shot. Every\none of them lies dead or wounded in the street...\n\n... as the Rabbits CROUCH over their bodies.\n\nCUT TO\n\n118 EXT. ARMORY DAY\n\nA rifle emplacement manned by a dozen GUARDS- They stand anxious post in\nfront of the Armory. Each window is barred and fortified, and the front\ndoor is massive. But the tension in the Guards' faces eases a little when\nthey see ...\n\n... the Detachment of militia heading towards them down the street. Some\nof the Detachment are wearing bloody uniform jackets; several are being\ncarried. The Detachment, unrecognized by the Guards, is made up entirely\nof Dead Rabbits.\n\nAMSTERDAM\nHelp us, we got wounded!\n\nGUARD 1\nWe can't leave the post.\n\nAMSTERDAM\nOpen the damn doors then! We're bad hurt!\n\nGUARD 1\nWhere's the others?\n\nAMSTERDAM\nJust behind us! But I got our major here wounded so bad half his guts is\nout!\n\nGuard 1 SIGNALS for the doors to be opened to the Armory as the Detachment\ndraws close to the emplacement.\n\nGUARD 1\nGod, it's good to see you!\n\nAMSTERDAM\nLikewise.\n\nAinsterdam SHOOTS him where he stands as the Rabbits OVERWHELM the\nemplacement.\n\nAMSTERDAM\n(shouting)\nMove fast! We got to get out with everything we can before the militia\ngets here!\n\nAs the Armory Guards return fire, the Boy Jenny carried in the previous\nscene RUNS for the telegraph pole and starts to CLIMB. A SHOT makes the\nwood fly inches from his face...\n\n... as the Rabbits storm into the Armory, FIRING wildly.\n\nThe Boy reaches the top of the telegraph pole and CUTS the wire. He\nshinnies back down the pole as the wire SWINGS ineffectually in the air\nand we ...\n\nDISSOLVE TO\n\nINT. Y HALL/MAIN ROOM 119\n\n..a telegram, held in Killoran's hand. He passes it to Tweed.\n\nKILLORAN\nIt's from the Armory Guards. That's the last before the wire went dead.\n\nBOSS TWEED\n(reading, furious)\nIf the Rabbits are already at the Armory, where the hell is Bill and the\nmilitia?\n\nHe THROWS the telegram onto the floor, where it joins a whole SEA of\nyellow telegraph forms. They are shin-high; there must be thousands of\nthem.\n\nKILLORAN\nThey got to be near.\n\nJOHNNY\nSo long as they're near, it's alright. The Rabbits can take the Armory,\nbut they can't hold it. If Bill can get into position, he can make sure\nthey don't get out.\n\nBOSS TWEED\nAlright then, John, you pray to any God you choose that's the fact of it.\nIf Bill thinks he can best the Natives, that is your opportunity. That is\nyour moment.\n(Johnny hesitates)\nAre you a Bible man? The Book says in Revelations, \"I saw a new heaven and\na new earth.\" If the hand of God's not on you to fulfill that prophecy,\nthen the hand of Tweed will be. Go on and God bless.\n\nJohnny looks like he is about to say something, but he stops; looks at\nTweed a moment longer; then nods acknowledgment and leaves.\n\nGOVERNOR\nI don't believe he can do it, Tweed.\n\nBOSS TWEED\nOh, I think he can. Whether it's one man against another or a mob against\nthe city, the mathematics remain the same. You never enjoyed the\nenlightenment of poverty, did you, Governor? If you had, you'd know you\ncan always hire half the poor to kill the other half.\n\nCUT TO\n\n120 EXT. ARMORY DAY\n\nA TREMENDOUS VOLLEY of GUNFIRE, as if to illustrate the Tweed theory of\nclass warfare. Bodies fall in the street. Bodies fall from the Armory. The\nbuilding is under siege by the main unit of the MILITIA and by Bill the\nButcher and the Natives. The Dead Rabbits are trapped.\n\nJohnny SNAKES through the Native American lines, over dead bodies, moving\ntowards Bill, who he sees a hundred yards away...\n\n... running over corpses of comrades and enemies toward the MILITIA\nCOMMADER. As SHOT WIDENS, the carnage is revealed. Bodies of Natives, in\ntheir uniform dusters, and Rabbits, in their tamlas, lie side by side in\nthe street.\n\n120 CONTINUED:\n\nFIRING continues from both sides as the Butcher shouts at the Militia\nCommander.\n\nBILL THE BUTCHER\nWe move now and we can drive them out! We press them and they'll break!\n\nMILITIA COMMANDER\nI can't spare the men or stand the risk! We stay fast and smoke lem out!\n\nBILL THE BUTCHER\nTweed put me in charge of this! I say we move, and by the crucified Christ\nwe will move!\n(turns to his men)\nNative Americans, come with me! Any militia that wants to live upright\ninstead of die hunkered down, come with us!\n\nBill STALKS through the lines, rallying the men. And Johnny starts to\nFOLLOW.\n\nBILL THE BUTCHER\nWe'll show you gladiators' greatness! Come on!\n\nThe men start to JOIN the Butcher; even some militia fall in. Johnny SLIPS\nthrough the men gathering near the Butcher. He's closer to Bill than ever.\n\nBill starts to mount their BARRICADE. There is MOVEMENT and commotion all\naround him as Natives and militia fall into rough formation. It threatens\nto obscure Bill from Johnny's view. Shield him.\n\nHe has to make his move. NOW. He DRAWS a revolver as militia and Natives\npass in front of him... he AIMS ... he's anxious, confused ... his HAND\nshakes ... he fires... too soon! ...\n\n... and HITS a Native, who falls dead. Right near Bill.\n\nThe Butcher turns in the direction of the shot, SEES Johnny. Their eyes\nlock. Johnny FIRES again ... WINGS Bill ...\n\n... and Bill SHOOTS him. Johnny FALLS with the first shot. Bill's above\nhim now, looking down at him.\n\nBILL THE BUTCHER\nWas it Tweed or your friend put you to this?\n\nJOHNNY\nTweed.\n\nBill SHOOTS him again, point blank. Johnny screams.\n\nBILL THE BUTCHER\nYou'd lie to save your friend.\n\nJOHNNY\n(in terrible pain)\nNo. There's no friends for me.\n\nBILL THE BUTCHER\nMe the same. Pity us both.\n\nHe EMPTIES his revolver into Johnny.\n\nBILL THE BUTCHER\n(to his men)\nHold your fire!\n(toward the Armory)\nIn there! Hey in there! I want to talk to Amsterdam!\n\nThe Militia Commander is aghast at this proposition and starts forward,\ngun in hand. But a Native STOPS him.\n\nAmsterdam's face APPEARS in a front window of the Armory.\n\nAMSTERDAM\nGo on, then, talk.\n\nBILL THE BUTCHER\nYou and me.\n\nAMSTERDAM\n(beat)\nCome ahead then. And bring my friend's body.\n\nBill the Butcher SLINGS Johnny's body over his shoulder as easily as if it\nwere an empty sack of flour...\n\n... and starts walking thraugh the lines toward the Armory. The Militia\nwatches in disbelief, the Natives in confusion. The Dead Rabbits keep the\nButcher in their sights. But no one fires. No one moves.\n\nAnd Bill the Butcher enters the front doors of the Armory.\n\nCUT TO\n\n121 INT. ARMORY DAY\n\nAs the Butcher is admitted through the huge doors which clang SHUT quickly\nbehind him. It's a scene of devastation inside-dozens of dead and wounded\neverywhere. And enough rifles and munitions to sink Manhattan island.\n\nBill the Butcher stands dead center in the middle of the Armory floor as\nAmsterdam walks toward him. The Butcher DROPS Johnny's body in a heap at\nhis feet.\n\nBILL THE BUTCHER\nYour friend made different friends lately.\n\nAMSTERDAM\nTammany's put us all in the same place. You want to get out alive?\n\nBILL THE BUTCHER\nIt don't matter to me. I got enemies outside, enemies in here. The militia\ncan move on me anytime. You could drop me before I get to the door.\n\nAMSTERDAM\nI don't want to lose you so easy. You'll never get past the militia unless\nyou come with the Dead Rabbits.\n\nBILL THE BUTCHER\nYou'd lay aside what's between us?\n\nAMSTERDAM\nI'm not forgetting where I put it.\n\nBILL THE BUTCHER\nIf you do, I'll remind you.\n(he turns, leaves)\n\nAMSTERDAM\nWhat's your call, Bill?\n\nBILL THE BUTCHER\nI'm considering where's my better chance.\n\nHe walks to the doors. The Rabbits guarding it don't make a move. He OPENS\nit himself and strides out into the street.\n\nCUT TO\n\n122 EXT./INT. ARMORY DAY\n\nBill walks alone toward the Native/militia lines.\n\nFrom inside... from every window ... the Dead Rabbits watch him.\n\nThe sun is high, but the street is eerily quiet. There are FARAWAY SOUNDS\nof battle, but here there is only the sound of distant, unheard\nconversation between Bill, the Militia Commander and some Natives.\n\nAmsterdam WATCHES intently.\n\nThe Butcher and the Militia Commander argue, but we still can't hear what\nthey're saying. There is still no sound...\n\n... until, SUDDENLY, we see the Militia Commander's face. Huge. EYES WIDE\nwith surprise as we HEAR the thunderclap of a SHOT.\n\nBill the Butcher has just gutshot the Militia Commander.\n\nAs if the shot were a signal, the Natives TURN on the militia. It's\nhellish, close-quarter combat. Guns fired inches from enemies who had just\nbeen allies. Knives, swords, bludgeons, kids with dead-rat blackjacks,\nwomen with hob-nailed wooden planks, attacking better-armed but totally\nstunned soldiers.\n\nBill the Butcher falls back toward the Armory, the Natives following him.\n\nInside the Armory, Amsterdam turns to his own greatly diminished gang.\n\nAMSTERDAM\nGo ahead them, give them cover! Give them some damn cover!\n\nThe Rabbits are so stunned to be fighting on the same side as their sworn\nenemies that, even with Amsterdam's order, no one makes a move. It's\nAmsterdam who FIRES the first shots. And that unleashes a great VOLLEY\nfrom the Armory...\n\n... toward the militia.\n\nThe Butcher and the Natives are closer to the Armory now... and the Armory\ndoors start to open...\n\n... when a MILITIA LIEUTENANT SIGNALS ...\n\n... and MILITIA on the surrounding roofs, waiting for this moment,\nsuddenly open fire...on the Natives below and on the Rabbits on the roof\nof the armory. Many drop in the street and fall from the Armory roof...\n\n... as the Armory doors SWING WIDE to admit the Natives. As they run or\nstagger inside, the Rabbits start to close the doors. Some Rabbits are cut\ndown by the fire from the rooftops. Other Natives never make it to the\ndoors. And a few are shot...\n\n... when the doors close before they can get through.\n\nCUT TO\n\n123 INT./EXT. ARMORY DAY\n\nThe Dead Rabbits keep firing, but they have sustained grave losses. The\nButcher looks around at the Natives who have made it inside with him: he\nhas perhaps one-quarter of his original strength.\n\nBILL THE BUTCHER\nWell, it seems like between us we got two mobs that might make a gang.\n\nAMSTERDAM\nWhose gang might it be?\n\nBILL THE BUTCHER\nNot William Tweed's.\n\nJimmy Spoils and a crew of Natives PUSH a cannon toward the rear of the\nArmory.\n\nAMSTERDAM\nWhich way you pointing that?\n\nJIMMY SPOILS\nAny way you say. One direction could let us out, the other will let them\nin.\n\nBILL THE BUTCHER\nThey got to come in if we're going to fight them.\n\nAMSTERDAM\nWho do you want to fight, Bill?\n\nAmsterdam MOTIONS toward the rear wall and Jimmy swings the cannon around.\n\nEverything surrounding them is MOVEMENT and COMMOTION as the remaining\nmembers of both gangs TAKE whatever weapons they can carry from the Armory\nstockpile...\n\n... and Jenny steps forward with a torch, LIGHTING the fuse of the\ncannon...\n\n... which ROARS and BLOWS a huge hole in the rear wall of the Armory.\n\nAMSTERDAM\n(to Bill the Butcher)\nSee you in the street.\n\nThe gang members RUSH for the opening, carrying whatever they can manage.\n\nOutside, the MILITIA LIEUTENANT hears the cannon blast... sees no damage\nto the front of the building... and SIGNALS for a frontal ASSAULT on the\nArmory.\n\nHIGH ANGLE FROM ABOVE, CAMERA MOVING as the militia CHARGES ... following\nthem forward, then moving ahead to the Armory\n\n... SHOOTING straight down inside (no roof or ceiling) as the Gangs HURTLE\nthrough the still-smoldering hole in the wall ...\n\n... and drop twenty feet to an alley below...\n\n... where militia on the roof try to pick them off. As the militia presses\ncloser from the front, gang defenses start to fall back inside the Armory.\nEveryone wants to get through that hole.\n\nAmsterdam, Jenny, Jimmy Spoils and some of the other gang nembers are\ncarrying TORCHES. Jenny HANDS a torch to the Butcher. Amsterdam MOTIONS\nthem all toward the back of the Armory.\n\nBut he stays behind. Just for a moment. He BENDS over the crumpled body of\nJohnny Sirocco, ARRANGES it, folding JOHNNY'S HANDS across his chest.\n\nAMSTERDAM\nYou'll have a warrior's funeral anyway, John.\n\nHe STANDS and RUNS for the hole in the wall, where Jenny and the others\nstand waiting.\n\nHe TURNS, takes a last look inside the Armory. The militia is BATTERING\nDOWN the front doors. Then he raises his TORCH over his head... and HURLS\nit through the air. Jenny and the others do the same.\n\nHis single torch BLAZES a path of light across the screen. The others,\nJOINING it, make a fiery CONSTELLATION.\n\nCUT TO\n\n124 EXT. REAR OF ARMORY/STREETS BEHIND ARMORY DAY\n\nAs Jenny, Jimmy Spoils, Bill the Butcher and Amsterdam HURTLE through the\nhole into the alley below...\n\n... and start to run through the withering GUNFIRE of the militia on the\nroof...\n\n... getting away... just barely away.\n\nAs Jenny runs, her swag drops and FALLS from under her clothes. She TURNS\nto pick it up but Amsterdam PULLS her on....\n\n... and just away from the titanic EXPLOSION of the Armory. The CONCUSSION\nthrows some of the militia from their perches on the roof. It sends a\nfountain of FLAME and RUBBLE high into the sky. It is VOLCANIC in its\nbrilliance and intensity. The sky turns BLACK with powder, BLAZING ORANGE\nwith flame.\n\nIn the small streets BEHIND THE ARMORY, many gang members are CRUSHED by\ndebris or burned by FIREBALLS breaking off from the central flame.\n\nThe Armory is gone. Much of the surrounding area is gone with it.\n\nOn the ground, everything is smoke, flame, dirt, death, confusion, Corpses\neverywhere. Gang members and kids running all over, desperate. It looks\nlike the last day of mankind on earth.\n\nBill the Butcher HELPS a couple of fallen Natives, then SEES through the\nsmoke and flame and storm of ash ... Amsterdam.\nComing towards him.\n\nBILL THE BUTCHER\nWe're finished, all of us.\n\nAMSTERDAM\nBut you and me ain't settled.\n\nBILL THE BUTCHER\nWe got the same now, a full share of nothing. There's nothing to settle.\nThere's nothing left.\n\nAmsterdam takes a weapon from his pocket, OPENS it for the Butcher to see:\nit is the pirate's knife which the Butcher used to kill Priest Vallon.\n\nAMSTERDAM\nThen let's start over.\n\nBill the Butcher looks tired, sorrowful. He BURIES his face wearily in his\narms. And for a moment we think he has given everything up. Amsterdam\nMOVES toward him, throu\n\n\n\nGangs of New York\nWriters :   Jay Cocks  Steven Zaillian  Kenneth Lonergan\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:45.573447"}