{"title": "Getaway, The", "film_link": "/Movie Scripts/Getaway, The Script.html", "script_link": "/scripts/Getaway,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Getaway, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Getaway, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Walter Hill\" title=\"Scripts by Walter Hill\">Walter Hill</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : February 1972<br/>\n<br/>\n<a href=\"/scripts/Getaway,-The.html\">Read \"Getaway, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>THE GETAWAY\n\nby Walter Hill\n\nThis screenplay is dedicated to Raoul Walsh\n\nBased on the novel\n\nby\n\nJim Thompson\n\n<b>FINAL REVISED SHOOTING SCRIPT\n</b>\nFebruary 23 1972\n\n<b>NOTE: SCENE NUMBERS AND \"OMITTED\" SLUGS WERE REMOVED FROM\n</b><b>THIS COPY.\n</b>\n\n\n<b>                                                       FADE IN:\n</b>\n<b>CARD OVER: SANDERSON PRISON\n</b>\n<b>EXT. PRISON YARD - TITLES OVER - DAY\n</b>\nDOC McCOY IS BEING WALKED ACROSS THE COMPOUND BY A UNIFORMED\nGUARD, carrying a riot gun. Other Prisoners around the yard\nturn and stare as the two men head for the main building.\n\n<b>INT. PRISON CORRIDOR\n</b>\nDOC WALKS DOWN THE BLEAK HALLWAY: A BLACK PRISONER PASSES Doc\nin the corridor, they slap hands... the Guard remains at his\nshoulder. Near the end of the passage another Guard clangs\nopen a barred door and allows Doc and the First Guard to\nenter the room where he stands sentry.\n\n<b>INT. HEARING ROOM - DAY\n</b>\nA LONG TABLE HAS BEEN SET UP AT THE HEAD OF THE ROOM, several\nPrison Officials and Parol Board Members are seated facing\nthe length of the room.\n\nSeated at one end of the table is an Irish looking Man;\nfloridly handsome and a bit overweight, his red hair is\nbeginning to grey. The Nameplate in front of him reads J.\n<b>BEYNON.\n</b>\nDoc enters the room and seats himself near two other\nPRISONERS, the GUARD stands back against the wall.\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             2.\n</b><b>CONTINUED:\n</b>\n\nAnother table has been set up; this one near the seated\nPrisoners, for their LEGAL COUNSELS -- SEVERAL LAWYERS\nexamine papers before them, waiting for the hearing to begin.\n\nA MAN at the center of the large table clears his throat,\nthen begins to speak.\n\n<b>                    CHAIRMAN\n</b>          I think we can begin... First parole\n          request Carter \"Doc\" McCoy... is legal\n          counsel present?\n\nA MAN rises from behind the lawyers' table.\n\n<b>                    LAWYER\n</b>          Yes. Eugene Stewart representing Mr.\n          McCoy.\n\n<b>                    DOC\n</b>          watching... taking it all in.\n\n<b>AT THE TABLE\n</b>\nThe Man checks the papers before him.\n\n<b>                    CHAIRMAN\n</b>              (his voice a bored drone)\n          Carter McCoy, one to five years sentence\n          for armed robbery, first offense in the\n          State of Texas, wanted by the State of\n          Ohio for assault with a deadly weapon and\n          armed robbery...\n\n<b>                    LAWYER\n</b>          The State of Ohio has waved jurisdiction,\n          Mr. Chairman. They no longer seek Mr.\n          McCoy in connection with that case.\n\n<b>                    CHAIRMAN\n</b>              (adjusting his papers)\n          That is correct. Very well. Mr. McCoy has\n          served four years of his sentence. Prison\n          record satisfactory. Applied for parole\n          on September 5th of this year...\n\nThe Chairman lowers the paper, looks across to the lawyer.\n\n<b>                    CHAIRMAN (CONT'D)\n</b>              (continuing)\n          Remarks?\n\n\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                           3.\n</b><b>CONTINUED:\n</b>\n\n<b>                    LAWYER\n</b>          We would only again like to call the\n          committee's attention to Mr. McCoy's\n          satisfactory behavior as a prisoner.\n\n<b>                    CHAIRMAN\n</b>          Notice is taken.\n\nHe looks down the table at the dark-suited men.\n\n<b>                    CHAIRMAN (CONT'D)\n</b>              (continuing)\n          The Board met in closed chambers last\n          week... have you reached a decision\n          regarding Mr. McCoy's request for parole?\n\n<b>                    DOC\n</b>          His face is taut.\n\n<b>AT THE TABLE\n</b>\nA Second MAN looks across to the Chairman.\n\n<b>                    SECOND MAN\n</b>              (seated near Beynon)\n          Request for parole is denied. The\n          prisoner may re-apply in one calendar\n          year.\n\n<b>                    DOC\n</b>          lowers his eyes, then looks up at his\n          lawyer. The lawyer avoids Doc's glance.,\n          he shuffles the papers in front of him,\n          begins stuffing them into his briefcase.\n\n<b>AT THE TABLE THE CHAIRMAN FLIPS HIS PAPERS TO A NEW PAGE\n</b>\n<b>                    CHAIRMAN\n</b>              (still totally without emotion)\n          Very well. The next request for parole is\n          from John Doty. Is legal counsel present?\n\n<b>                    VOICE (O.S.)\n</b>          Yes.\n\n<b>                    CHAIRMAN\n</b>          Mr. Doty is serving five to twelve years\n          for embezzlement of corporate funds.\n\n<b>DOC'S JAW TIGHTENS... HE AGAIN LOOKS AT THE FLOOR\n</b>\n<b>DOC PLAYING CHESS WITH AN OLD CON IN A BLEAK WORK ROOM -\n</b>torn, magazines, beaten up radio, butt cans filled with sand.\n<b>\n</b><b>                                                              4.\n</b>\n\n\n<b>EXT. PRISON GATE - ANGLES\n</b>\nDOC AND OTHER PRISONERS RUN OUT OF THE GATE LEADING TO the\ntractor driven carts that will take them to their work area.\n\n<b>EXT. EDGE OF FOREST\n</b>\nDOC AND WORK PARTY HAVE ALREADY ARRIVED AT THE FOREST and\nbegin to cut, file and burn brush. They are always guarded by\nguards, some on horseback.\n\n<b>EXT. PRISON COMPOUND - DAY\n</b>\nDOC LEANS AGAINST A WIRE FENCE CHEWING ON AN OVEN match, he\nwatches the other prisoners aimlessly wander around the\nexercise yard.\n\n<b>INT. PRISON COMMISSARY - DAY\n</b>\nDOC IS STANDING IN LINE WITH THE OTHER PRISONERS, starchy\npuddles of food are being ladled out onto the metal trays...\n\n<b>INT. PRISON TOILETS - DAY\n</b>\n<b>DOC WORKING WITH SEVERAL PRISONERS, ALL OF THEM ON THEIR\n</b>HANDS AND KNEES, cleaning a long line of open, filthy\ntoilets... a Guard stands nearby.\n\n<b>DOC SHOWERING IN AN OPEN STALL WITH TWENTY MEN\n</b>\ncoarse soap and brownish yellow water... Doc has an American\nEagle tattooed on one shoulder.\n\n<b>A SENTRY TOWER - DUSK\n</b>\nA GUARD LOOKS OUT OVER THE EMPTY EXERCISE YARD... buildings\ncontaining bleak cell blocks stand beyond the open compound.\n\n<b>INT. CELL BLOCK - NIGHT\n</b>\nA WARDER JANGLES HIS KEY RING AS HE PASSES BY THE IRON doored\ncells.\n\n<b>INT. TEXTILE MILL - A SERIES OF ANGLES - DAY\n</b>\nDOC AND OTHERS WORKING. THE NOISE OF MACHINERY IS deafening.\nThe clatter of the constantly working parts is maddening.\n\n<b>INT. CELL - NIGHT\n</b>\nDOC LIES ACROSS A SMALL COT WITHIN HIS SHADOW-CROSSED cell.\nHe works carefully at a toothpick suspension bridge. Doc\nglues the final pieces into place...\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                              5.\n</b><b>CONTINUED:\n</b>\n\nAround the cubicle his personal effects can be seen, a\npicture of an attractive woman, several battered paperbacks.\n\nDoc continues looking at the bridge... then suddenly begins\nsmashing it to pieces with his right fist.\n\n<b>INT. PRISON - VISITING BUNGALOW - DAY\n</b>\nDOC IS SEATED... WAITING. CAROL enters the darkened room and\nseats herself opposite Doc. They are separated by a wide\ntable and net of wire meshing that springs upward from mid-\npoint between them.\n\n<b>                    CAROL\n</b>              (big smile, she wants the\n               moment to be an upper)\n          Hello, Doc.\n\nHe simply stares back at her. Carol's finely honed features\ncompliment a face that at first glance is pretty,at a second\nglance shows willful strength. Doc continues looking at\nCarol.\n\n<b>                       CAROL (CONT'D)\n</b>          I'm sorry.\n\nDoc is silent.\n\n<b>                    CAROL (CONT'D)\n</b>          It's been raining a lot the last few\n          days.\n\nDoc is silent.\n\n<b>                    CAROL (CONT'D)\n</b>          We'll try again.\n\n<b>                    DOC\n</b>          No way. I've got to get out now.\n\nGet to Beynon, tell him I'm for sale. His price.\n\nShe looks at him.\n\n<b>                       DOC (CONT'D)\n</b>          Do it now.\n\nShe hesitates, tries to touch him through the mesh. Gets up\nand leaves. Doc remains unmoving.\n\n<b>EXT. COUNTRY COURTHOUSE - SAN MARCOS, TEXAS - DAY\n</b><b>\n</b><b>                                                             6.\n</b>\n\n\n<b>CAROL MOVES TO THE BACK OF THE LARGE BTJILDING AND UP A REAR\n</b><b>STAIRWAY TOWARD THE OVERHEAD OFFICE.\n</b>\n<b>INT. COURTHOUSE\n</b>\nCAROL ENTERS A LEGAL OFFICE, WEARING A SOFT BILLOWY dress.\nShe looks very good.\n\nA middle aged SECRETARY looks up at Carol. A short balding\nman (THE ACCOUNTANT) in his forties works at a large desk\nacross the room from the Secretary. He seems totally occupied\nwith his bookwork.\n\n<b>NEAR THE ACCOUNTANT THREE MEN ARE SEATED ON A DAVENPORT\n</b>\nThey are dressed casually; by the look of them they might be\nanything at all but all three have commonality; they are\nprofessionals.\n\nHAYHOE - Thirty years old, buck teeth and blue eyes, a bitter\nender.\n\nCULLY - Well padded strength, large hands and wrists that pop\nout of his buttoned shirtsleeves...\n\nSWAIN - a little older and a little smarter than the other\ntwo, his narrow features allow no warmth.\n\n<b>                                              AFTER A MOMENT:\n</b>\nSECRETARY Yes?\n\n<b>                    CAROL\n</b>          I want to see Jack Beynon.\n\nThe Accountant nods to the Secretary, she points Carol\ntowards a door leading to an inner office.\n\n<b>                    SECRETARY\n</b>          Go right in, Mrs. McCoy.\n\nDOC AND CAROL - PACES, PARTS OP BODIES, EMPHASIS ON HANDS, in\nbed... his hand touching the soft white skin beneath her\nstomach.\n\n<b>BACK WITHIN THE OFFICE THE THREE MEN LOOK AFTER CAROL\n</b>\n<b>                    CULLY\n</b>          Class - regular?\n\n<b>                    SWAIN\n</b>          No. Doc McCoy's old lady.\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                              7.\n</b><b>CONTINUED:\n</b>\n\nCully looks startled.\n\n<b>                    CULLY\n</b>          Jesus. Carol Ainsley?\n\n<b>                    SWAIN\n</b>          The very same.\n\n<b>                    CULLY\n</b>          The Doctor took out McGovern for her.\n\n<b>                    SWAIN\n</b>          She only rides winning - Class easy\n          class.\n\n<b>                       ACCOUNTANT\n</b>          Shut up.\n\n<b>INT. BEYNON'S OFFICE\n</b>\n<b>CAROL ENTERS.\n</b>\n<b>A WOMAN'S LIPS - FLASH CUT\n</b>\npressed against a man's neck. She kisses, then bites a tiny\nportion of skin.\n\n<b>BACK TO BEYNON'S OFFICE. HE IS POURING A DRINK.\n</b>\n<b>                    BEYNON\n</b>          How are you, Mrs. McCoy?\n\n<b>CAROL APPROACHES BEYNON'S DESK WITH A NERVOUSLY\n</b>\n<b>DETERMINED STRIDE\n</b>\n<b>                    CAROL\n</b>          Ready to talk about my husband, Mr.\n          Beynon.\n\n<b>                     BEYNON\n</b>          So the good Doctor comes up again.\n              (then)\n          Please sit down.\n\n<b>                    CAROL\n</b>          He's asked me to come and see you.\n\nBeynon looks at her... then lets their eyes meet.\n\n<b>                    BEYNON\n</b>              (handing her a drink)\n          Why? Can I help?\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                              8.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>          Yes, I think you can.\n\nA MAN'S FINGERS STARING AT THE ANKLET ON THE WOMAN'S LEG then\ndrawing an imaginary line upward... a woman's hand wearing a\nwedding ring comes up to meet it.\n\n<b>INT. SANDERSON PRISON OFFICE CORRIDOR - DAY\n</b>\nA UNIFORMED GUARD LEADS DOC DOWN THE HALLWAY, they turn a\ncorner and go into a small private room, Doc is now dressed\nin civilian clothes.\n\nDoc catches sight of himself in a small mirror. He stops\nlooking uncertainly at the image... and then moves on with\nthe guard.\n\n<b>EXT. PRISON - DAY\n</b>\n<b>DOC EXITS THE PRISON AND STANDS WAITING NEAR THE AUTO GATE.\n</b>He looks down the two-lane blacktop road that runs along the\nedge of the penitentiary... Doc turns, looks again at the\nprison... four years is a long time.\n\nA dark Caddy is parked down the road.\n\n<b>INT. CADDY - DAY\n</b>\nTHE ACCOUNTANT OR SWAIN SITS BEHIND THE WHEEL. He stares at\nDoc. Doc crosses to him.\n\n<b>                    ACCOUNTANT\n</b>          Mr. Beynon will see you the day after\n          tomorrow 12:30 at the River Walk.\n\nHe gestures and drives away.\n\n<b>                                                  DISSOLVE TO:\n</b>\n<b>DOC IS STILL WAITING\n</b>\nHe leans against a low stone wall that lines the entrance\nway... The duffel bag rests beside him.\n\nA late model Ford approaches, stops near Doc... the passenger\nside door opens from the inside... Carol is driving... Doc\nand Carol look at one another, their eyes holding several\nmoments.\n\n<b>INT. FORD - DAY\n</b><b>\n</b><b>                                                              9.\n</b>\n\n\n<b>BOTH CAROL AND DOC ARE VERY TENSE.\n</b>\n<b>                     CAROL\n</b>           Hello, Doc.\n\n<b>                        DOC\n</b>           Hi.\n\n<b>                        CAROL\n</b>           You okay?\n\n<b>                      DOC\n</b>                (big smile)\n           I'm a lot better off than I was an hour\n           ago.\n\nThey look at each other for a moment. Carol leans forward...\nDoc, inhibited by the closeness of the prison walls, kisses\nher lightly, but with affection...\n\n<b>                     CAROL\n</b>           You want to drive?\n\n<b>                     DOC\n</b>           My license expired, let's get out of\n           here.\n\n<b>                        CAROL\n</b>           Sure...\n\nShe starts the car, slips it into gear.\n\n<b>EXT. HIGHWAY\n</b>\nTHE FORD MOVES ALONG THE DESERTED ROADSIDE, crossing the\nborder and passing into the State of Texas.\n\n<b>INT. THE FORD\n</b>\nDOC ALTERNATELY STARES AT THE PASSING SCENERY, THEN BACK to\nCarol.\n\n<b>                     CAROL\n</b>           I'm sorry I was late... I got my hair\n           done... the girl was slow.\n\n<b>                     DOC\n</b>           It looks fine.\n\nA pause.\n\n<b>                        CAROL\n</b>           Feel good?\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                            10.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>          Yeah.\n\n<b>                    CAROL\n</b>          Where do you want to go?\n\n<b>                    DOC\n</b>          I want to take a walk.\n\nHe smiles, then reaches over and gently touches a strand of\nCarol's hair.\n\n<b>EXT. RIVER - GRASSY BANK - SERIES OP ANGLES - DAY\n</b>\n<b>THEY PARK THE CAR AND EXIT. DOC MOVES A LITTLE AHEAD OF\n</b>Carol. He sits on the bank watching the kids play.\n\n<b>YOUNG BOYS SWING ON A ROPE THAT HANGS OVER THE PALLS\n</b>\nCOLLEGE KIDS, SOME ARE SWIMMING, SOME STUDYING, SOME just\ngrooving.\n\n<b>AN OLDER COUPLE SIT ON THE BANK, THEIR FEET IN THE WATER\n</b>\n<b>CAROL SITS DOWN NOT TOO CLOSE. DOC IS SILENT FOR LONG\n</b>moments. Carol starts to speak but doesn't. He is\npreoccupied, lost in his own thoughts.\n\nFinally he stands, looking down at her. He slowly takes off\nhis coat, folds it, lays it on the grass, then turns and\nstarts walking towards a tree.\n\nSuddenly he takes off his shoes, breaks into a run and dives\nfor the rope.\n\nCAROL IS ALREADY ON HER FEET, HER SWEATER OFF, SHOES kicked\naside, she runs after him and hits the water with an awkward\nsplash. She is a brief second behind him.\n\nTHEY COME UP TOGETHER, AND HE LAUGHS WITH THE PURE JOY of\nbeing free and alive. She joins him, in his laughter and with\ntheir arms around each other, they turn as they are swept\ndown stream.\n\n<b>INT. EL OSO CONDOMINIUM - NIGHT\n</b>\n<b>THROUGH AN OPEN WINDOW A PORTION OF THE EXTERIOR BUILDING CAN\n</b>BE SEEN... The interior is cozy and Carol. Carol has lived\nhere almost two years. On the wall there is a poster (which\nwill be on the wall of every room that they stay in from now\non).\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                           11.\n</b><b>CONTINUED:\n</b>\n\nAround the room are drying clothes. Carol is ironing with a\nsteam iron.\n\nDoc is sitting at a table with a Colt .45 in front of him and\na .32 automatic. He is field stripping. There is a bowl of\npeaches on the table.\n\n<b>                    DOC\n</b>              (pointing to the poster)\n          It doesn't look like that.\n\n<b>                    CAROL\n</b>          What do you mean? You've never been\n          there.\n\n<b>                    DOC\n</b>          I've been there every day for the last\n          four years.\n\nShe crosses to him and gives him a hug, then returns to her\nironing.\n\n<b>                    DOC (CONT'D)\n</b>          What's Beynon got set up?\n\n<b>                    CAROL\n</b>          Small town, small bank, big money.\n\nShe holds up some 11 by 14 photographs in front of him.\n\n<b>                    DOC\n</b>          Where did you get those?\n\n<b>                    CAROL\n</b>          I've been doing my homework.\n\n<b>                    DOC\n</b>          Just like old times?\n\n<b>                    CAROL\n</b>          Better than old times.\n\n<b>                    DOC\n</b>          I hope so. I am not looking forward to\n          another stretch.\n\n<b>                    CAROL\n</b>          I made a mistake. I'll never make another\n          one.\n\n<b>                    DOC\n</b>              (after a moment)\n          Where did you get them developed?\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                            12.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    CAROL\n</b>          Assumed name... Houston.\n\n<b>                    DOC\n</b>          Good.\n\n<b>RAFTER A MOMENT)\n</b>\nHow much is the score?\n\n<b>                    CAROL\n</b>          Half a million.\n\n<b>                    DOC\n</b>          That Beynon's got a long arm.\n\n<b>                    CAROL\n</b>              (after a moment)\n          What do you want for dinner?\n\n<b>                    DOC\n</b>          Whisky and a peach.\n\nShe laughs softly, and goes to a cupboard and takes out four\nbottles of whisky, four glasses and a bowl of ice. Doc smiles\nat her and begins sampling.\n\n<b>                    CAROL\n</b>              (as Doc eats a peach with a\n               sharp knife)\n          How does it taste?\n\n<b>                    DOC\n</b>          Just the way I remembered.\n\nDoc reaches across the table and touches her hand gently.\n\n<b>                    DOC (CONT'D)\n</b>          You been okay?\n\n<b>                    CAROL\n</b>          Pretty good... Made a quick trip to\n          Oregon, saw my brother and the kids.\n          Figured it would be my last chance,\n          unless they wanted to travel.\n\n<b>                    DOC\n</b>          How's Estelle?\n\n<b>                    CAROL\n</b>          Fatter... some things never change.\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                            13.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>          Boring.\n\n<b>                    CAROL\n</b>          Nothing's been boring since you found me.\n\n<b>                    DOC\n</b>              (carefully)\n          That's not all of it.\n\n<b>                    CAROL\n</b>          No. It's been a long time.\n\nA pause. He continues stroking her arm.\n\n<b>                    DOC\n</b>          You go out much?\n\n<b>                    CAROL\n</b>          After four years and now the question\n          comes up.\n\n<b>                    DOC\n</b>          Couldn't handle it then. Now I can.\n\n<b>                    CAROL\n</b>              (with warmth and a smile)\n          I'm still here, Doc.\n\nHe stands, kisses her gently. She stands and they move toward\nthe stairs.\n\n<b>INT. BEDROOM\n</b>\n<b>THEY ENTER THE BEDROOM AND SIT SIDE BY SIDE ON THE DOUBLE\n</b>bed. They both sit rigidly. Doc's eyes are on Carol, she\nstares vacantly expectant.\n\nDoc begins to unbutton her blouse, it comes undone with\nagonizing slowness... Carol pulls her shoulders back helping\nDoc drop the garment down to her waist.\n\nDoc hesitates, then carefully touches her shoulder... her\nhair... he kisses her... Doc gently eases himself away from\nCarol.\n\n<b>                    DOC\n</b>              (he is very tight)\n          Oh Christ...\n\nHe again moves close... Doc reaches around to unsnap her bra\nas Carol places both of her arms around him, holding him\ntightly...\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                            14.\n</b><b>CONTINUED:\n</b>\nDoc unsnaps the top fastener, the second one catches, remains\nunyielding... He closes his eyes for a second... The pressure\nof the moment is again too intense for Doc. Once more he\npulls gently away from her. Carol looks at him, her eyes very\nreassuring.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing)\n          I guess I'm kind of...\n\n<b>                    CAROL\n</b>          It's all right.\n\n<b>                    DOC\n</b>              (explaining the obvious)\n          It's just been a while.\n\n<b>                    CAROL\n</b>          We've got time. We've got a lot of time.\n          I can help you.\n\nShe stands, begins to remove her skirt.\n\n<b>                    DOC\n</b>          Wait... give me a minute.\n\n<b>                    CAROL\n</b>          Sure.\n\nShe sits beside him again, takes his hand in hers...\n\n<b>                    DOC\n</b>          I'll be okay.\n\n<b>                    CAROL\n</b>          Listen, I'm just as nervous as you are.\n\n<b>                    DOC\n</b>          Really?\n\n<b>                    CAROL\n</b>          Really.\n\nThey look at one another. A pause. He kisses her; their\nembrace pulls them back across the bed.\n\n<b>                    CAROL (CONT'D)\n</b>              (continuing)\n          Let me make you feel good, Doctor.\n\nBut she has little chance as he begins to make love to her.\n\n<b>                                                    DISSOLVE TO:\n</b><b>\n</b><b>                                                             15.\n</b>\n\n\n<b>A DIFFERENT ANGLE\n</b>\n<b>DOC AND CAROL ARE LYING IN BED.\n</b>\n<b>                    CAROL\n</b>          How was it?\n\n<b>                    DOC\n</b>          Better than I remembered.\n\n<b>INT. KITCHEN - MORNING\n</b>\nDOC WEARING A ROBE IS COOKING EGGS AND DRINKING WHISKY. Carol\nenters.\n\n<b>                    CAROL\n</b>          I was going to fix you breakfast.\n\n<b>                    DOC\n</b>          You were asleep.\n\n<b>                    CAROL\n</b>          I bought you a lot of new things.\n\nShe exits and returns with some clothes. He looks at them.\n\n<b>                    DOC\n</b>          Yeah, well, I think I'll stick with what\n          I've got.\n\n<b>                    CAROL\n</b>          Suit yourself.\n\nThey start eating.\n\n<b>                    DOC\n</b>          How much does Beynon get?\n\nA pause. Carol looks directly at Doc.\n\n<b>                    CAROL\n</b>          $250,000 right off the top.\n\n<b>                    DOC\n</b>          Is he straight?\n\n<b>                    CAROL\n</b>          You got the parole, didn't you?\n\nHe picks up a fork and looks through it, as if it is prison\nbars. She takes his hand and gently takes the fork from him.\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                          16.\n</b><b>CONTINUED:\n</b>\n\n<b>                     DOC\n</b>          Thanks again.\n              (then)\n          I 'm glad you waited.\n\n<b>                    CAROL\n</b>              (simply)\n          I couldn't have... much longer.\n\n<b>                    DOC\n</b>          Yeah... I know.\n\n<b>                    CAROL\n</b>          But I got you out. Didn't I, Doc. I did\n          it. I got you out.\n\nCarol begins to laugh softly.\n\n<b>                    DOC\n</b>          Why are you laughing?\n\n<b>                    CAROL\n</b>          I laugh when I feel happy. Sometimes just\n          thinking of you made me laugh. I had a\n          lot of that. And other times that wasn't\n          enough. I had a lot of that too. I know\n          you find it hard to believe, I'm happy\n          just loving you.\n\n<b>                    DOC\n</b>          That doesn't hurt.\n\n<b>                    CAROL\n</b>          But sometimes I cried a lot too.\n\n<b>                    DOC\n</b>              (trying to smile)\n          I didn't. I just waited.\n\n<b>                    CAROL\n</b>              (deeply moved)\n          Want to cry now?\n\nDoc smiling, still holding her hand, leads her from the\ntable.\n\nTHEY CAN'T KEEP THEIR HANDS OFF EACH OTHER AND LAUGHING with\ncomplete release they half carry each other into the bedroom.\n\n<b>EXT. RIVER WALK CANAL - SAN ANTONIO - DAY\n</b><b>\n</b><b>                                                              17.\n</b>\n\n\n<b>BEYNON IS IN THE BOAT. LUNCH HAS BEEN SET. DOC COMES ABOARD.\n</b>\n<b>                      DOC\n</b>            You gotta be kidding.\n\n<b>                      BEYNON\n</b>            Not at all, just a pleasant way to have\n            lunch.\n\nDoc sits.\n\nPedal boats cut through the water in the background.\n\n<b>                      BEYNON (CONT'D)\n</b>            Glad to see you in civilian clothes.\n\nThe Accountant and Swain are with Beynon in the boat. Apart\nfrom them two pedal boats come up behind Beynon's boat. Cully\nand Hayhoe are in one, and two other men are pedalling along\nin a boat numbered 13.\n\n<b>                      DOC\n</b>            All it takes is a long arm.\n\n<b>                      BEYNON\n</b>            Hard to judge how these things happen.\n            The Parole Board almost never reverses\n            their decisions.\n\n<b>                      DOC\n</b>                (sarcastic)\n            I guess it was because I was a model\n            prisoner.\n\n<b>                      BEYNON\n</b>            This is the only time you and I meet in\n            public. Any business with me, handle it\n            with him...\n\nBeynon nods toward the Accountant. He then turns and gestures\ntoward the other two men.\n\n<b>                      BEYNON (CONT'D)\n</b>                (continuing)\n            You're back with your own people now. Got\n            you some professionals.\n\n<b>                      DOC\n</b>                (flat, hard)\n            I get my own help.\n\n\n\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                             18.\n</b><b>CONTINUED:\n</b>\n\n<b>                    BEYNON\n</b>              (quiet strength)\n          You run the job, but I run the show. You\n          got two weeks to set it up.\n\nIt's not a big bank but it handles cash deposits for an oil\ncompany... half a million... it's a family thing, the brother\nof the bank director is on the board of directors at Con-Sol\nOil... Beacon City.\n\nBeynon nods to the two men and they immediately begin to\napproach in their paddle boat.\n\nRUDY BUTLER -- hard eyes and an easy smile; obviously a heavy\ngun...\n\nPRANK JACKSON -- young, mid-twenties, ruddy face and blond\nhair; a small man with blank, insensitive features.\n\n<b>                    DOC\n</b>              (nods to Cully, Swain and\n               Hayhoe)\n          What about them?\n\n<b>                    BEYNON\n</b>          They're mine. The one with the moustache\n          is my brother. They stay out of it. We\n          stay clean.\n\nAs the two men arrive...\n\n<b>                    BEYNON (CONT'D)\n</b>              (continuing)\n          Rudy Butler, Frank Jackson...\n\n<b>                    DOC\n</b>              (to Rudy)\n          I heard about you. You work with Miller.\n\n<b>                    RUDY\n</b>          You're out of touch. Cops blew him up.\n\n<b>                     DOC\n</b>          Where?\n\n<b>                     RUDY\n</b>          Chicago.\n\n<b>                    DOC\n</b>          You were with him?\n\n<b>                    RUDY\n</b>          Yeah. I got out.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                             19.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    DOC\n</b>              (to Jackson)\n          What about you?\n\n<b>                    JACKSON\n</b>          I was backup man on a payroll job.\n              (as Doc looks hard at him)\n          I hit some liquor stores... I drive good.\n\n<b>                     RUDY\n</b>          I drive.\n\n<b>                    DOC\n</b>          Sure,\n              (to Beynon)\n          You're working on the passports...\n              (as Beynon nods)\n          ... and visas?\n\n<b>                    BEYNON\n</b>          They will be ready. You guys do your job.\n\n<b>                    DOC\n</b>              (irritated)\n          I'll take care of my end.\n\n<b>                    BEYNON\n</b>              (big smile)\n          Stay clean.\n\n<b>INT. HOTEL ROOM BEACON CITY - DAY\n</b>\n<b>THREE TRIPODS HAVE BEEN SET UP NEAR THE HEAVILY CURTAINED\n</b>window. On two of them huge sets of binoculars have been\nracked into place, beside them on a tripod is a lectern with\nnotepad and pencil... Doc and Carol peer through the\nbinoculars then write several notations on the paper.\n\nBoth Doc and Carol drink coffee from paper cups... the\nresidue of dinners served on hotel trays lie about the room.\nDoc and Carol share a sandwich as they work.\n\n<b>INT. BANK OP BEACON CITY - BINOCULARS' POV THROUGH BANK\n</b><b>WINDOWS\n</b>\nTHE BANK CARRIES ON ITS NORMAL MID-DAY ACTIVITY. A Guard\nenters the building quickly followed by the bank President.\n\n<b>BACK IN THE HOTEL ROOM CAROL AND DOC CONTINUE TO EAT WHILE\n</b>making further notations.\n<b>\n</b><b>                                                             20.\n</b>\n\n\n<b>INT. BEACON CITY BANK - ANOTHER DAY\n</b>\n<b>CAROL WEARING INCONSPICUOUS WARDROBE STANDS QUIETLY IN LINE\n</b>before a teller's window.\n\nAs she reaches the window:\n\n<b>                    CAROL\n</b>          I'd like an application for a checking\n          account.\n\nShe gets it, moves to:\n\n<b>A TABLE. CAROL MAKES OUT THE APPLICATION AS SHE COOLLY AND\n</b>unobtrusively eyes the bank.\n\n<b>INT. BEACON CITY BANK - DAY 5^\n</b>\n<b>DOC, WEARING HIS SUIT AND GLASSES, STANDING AT A TELLER'S\n</b>window. He moves to the head of the line.\n\nHe notices a TV camera and a wanted poster showing the faces\nof wanted bank robbers.\n\n<b>                    DOC\n</b>              (with a smile)\n          Could I get change for this fifty please?\n\nHis eyes alert and probing.\n\n<b>EXT. MAIN STREET BEACON CITY - ANGLES - DAY\n</b>\n<b>DOC DROPS A LETTER INTO A CORNER MAIL BOX, THEN BUYS A PAPER\n</b>from a coin dispenser. His eyes find a Beacon City Policeman\nidly talking to a citizen... a police car is near the\nOfficer, the driver's side door open... mounted on the dash\nis a shotgun. Doc tucks the paper under his arm and moves off\ndown the street.\n\n<b>INT. COUNTY ENGINEER'S OFFICE - DAY\n</b>\nDOC WITH BRIEFCASE IS TALKING TO A CIVIL ENGINEER. They both\nstudy the detail map of a city sewage system...\n\n<b>INT. HARDWARE STORE - BEACON CITY - DAY\n</b>\n<b>JACKSON PURCHASES A LARGE PAIR OF WIRE CUTTERS.\n</b>\n<b>INT. BEACON CITY HOTEL - DAY\n</b>\n<b>CAROL CUTTING PIECES OF MATERIAL OUT OF SEVERAL WATCH CAPS\n</b>with a pair of scissors.\n<b>\n</b><b>                                                            21.\n</b>\n\n\n<b>EXT. USED CAR LOT - BEACON CITY - DAY\n</b>\n<b>RUDY, RANCH DRESSED., IS BUYING A LARGE FLAT BED.\n</b>\n<b>INT. HIGH WALLED ROOM - DAY\n</b>\n<b>A LARGE ROOM WITHOUT WINDOWS. NEAR THE CENTER SITS A BIG\n</b>table piled with equipment, watch caps, several different\ncolored raincoats, a huge pair of wirecutters, road maps,\nchemical containers and four sticks of dynamite, four visas\nand two passports and several padded U.S. Army, super bullet\nproof vests which are not vests at all, more a shield.\n\nRudy and Jackson stand near the table. Carol is seated. She\nnervously runs her hand along the edge of one of the road\nmaps. Doc is holding one of the vests.\n\nThe wall behind the table is dominated by diagrams and maps,\nand photos which show the interior of the Beacon City Bank,\nthe Bank vault, and several diagrams of the main street of\nBeacon City, a Beacon City Police car, and a detailed\nreproduction of the Beacon City main sewage system, including\nelectrical wiring, a detailed road map of the town and\nvarious photos of a farmhouse and barn.\n\n<b>                    DOC\n</b>          ... Bank President, three tellers and one\n          guard...\n\n<b>                    CAROL\n</b>              (cutting in)\n          Usually on the right side as you go in.\n\n<b>                    DOC\n</b>          Nail him first, be careful he doesn't\n          panic and want to shoot somebody. Local\n          police have one car, a rover, shouldn't\n          be in the vicinity at the time we hit\n          unless it's answering an emergency\n          call... if the cop car shows up remember\n          it doesn't have any automatic weapons.\n          Only a shotgun braced on the dashboard.\n          Get into a tight spot, you'll be out of\n          range at forty yards. Then they're down\n          to their side guns.\n\n<b>                    CAROL\n</b>          For exits off Main Street.\n\n<b>                    DOC\n</b>          Should be light traffic that time of\n          day... the Bank Guard carries a .38.\n          These will stop an M.2 at fifty yards.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                            22.\n</b><b>CONTINUED:\n</b>\n\nHe throws the vest on the table.\n\n<b>                    DOC (CONT'D)\n</b>          Just in case someone gets a shot off.\n\n<b>                    RUDY\n</b>          I worked ten years without one, I don't\n          need one now.\n\n<b>                    DOC\n</b>          Suit yourself.\n\n<b>                    RUDY\n</b>          Okay. How many bank exits?\n\n<b>                    DOC\n</b>          Two.\n\n<b>                    RUDY\n</b>          What about the vault?\n\n<b>                    DOC\n</b>          Chambers - Reilly. Time lock opens 20\n          minutes before they start doing\n          business...\n\n<b>                    RUDY\n</b>          Wire pull over?\n\n<b>                    DOC\n</b>          One-inch stuff on a three-number\n          combination.\n\n<b>                    RUDY\n</b>          I'm good at that.\n\n<b>                    DOC\n</b>          I 'm handling the fine stuff. You're back\n          up all the way...\n\n<b>                    RUDY\n</b>              (smile)\n          Whatever you need.\n\nTo Rudy and Jackson, Doc points to the map and farmhouse\npicture:\n\n<b>                    DOC\n</b>          Keep going over these. I don't want\n          anybody getting lost.\n\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                          23.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    CAROL\n</b>              (holding two passports and four\n               visas held together by a\n               rubber band)\n          If we are clean Gollie will take us over\n          at Nogales. If we are hot we'll have to\n          try Laughlin at El Paso.\n\nShe hands Doc the visas, as she puts the two passports in her\nbag.\n\n<b>                     DOC\n</b>          I'll hang on to these. We don't need them\n          till we get to Gollie«s. Okay. Any\n          questions?\n\n<b>                    RUDY\n</b>          Aren't we going a little hard?\n\n<b>                    DOC\n</b>          What do you have in mind?\n\n<b>                    RUDY\n</b>          It's just a walk-in bank. You don't have\n          to be Dillinger for this one.\n\n<b>                    DOC\n</b>              (a long look at Rudy)\n          Dillinger got killed.\n\nJackson and Rudy begin to exit. The Accountant enters.\n\n<b>                    DOC (CONT'D)\n</b>              (to Accountant)\n          Tell Beynon I want no mistakes.\n\nI make four phone calls, his boys better pick up.\n\n<b>                    ACCOUNTANT\n</b>          I understand.\n\n<b>                    DOC\n</b>          Beynon has to be alone at the drop ...\n          one car at the ranch and that's it. I\n          won't have the money... she won't know\n          where it is until I'm sure it's clear.\n\n<b>                    ACCOUNTANT\n</b>          He understands.\n\n<b>                    DOC\n</b>          Make sure everybody does.\n<b>\n</b><b>                                                            24.\n</b>\n\n\n<b>INT. BEACON HOTEL - NIGHT\n</b>\nDOC AND CAROL ARE GETTING READY FOR BED. It is the night\nbefore the robbery. Carol stands looking in the mirror.\n\n<b>                    CAROL\n</b>          You know how I feel?\n\n<b>                    DOC\n</b>          My mind's not on guessing games.\n\nCarol turns away from the mirror.\n\n<b>                    CAROL\n</b>          Promise you won't laugh.\n\n<b>                    DOC\n</b>              (shakes his head; smiles)\n          If it's funny I'm going to laugh.\n\n<b>                    CAROL\n</b>          I feel like the night before the first\n          day of school.\n\n<b>                      DOC\n</b>          That bad?\n\nCarol laughs.\n\n<b>                    DOC (CONT'D)\n</b>          You promised not to laugh.\n\nThey both laugh. Long beat. Carol gets into bed. Doc is\nalready in bed.\n\n<b>                    CAROL\n</b>          It will be such a relief not to have to\n          think about it any more.\n\n<b>                    DOC\n</b>          Waiting's hard. You never learn how.\n\n<b>                    CAROL\n</b>          You know I've actually gotten tired\n          waiting sometimes... worn out waiting.\n\n<b>                    DOC\n</b>          At least you were outside.\n\n<b>                    CAROL\n</b>          It doesn!t make much difference where you\n          are, if you're waiting, Doc.\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                          25.\n</b><b>CONTINUED:\n</b>\n\n<b>                       DOC\n</b>          Bullshit.\n\n<b>                       CAROL\n</b>          I mean it.\n\n<b>                    DOC\n</b>          I know you do. But it is different.\n              (before she can interrupt\n               suddenly up a notch)\n          It's different.\n              (quieting down)\n          We'll be all right tomorrow.\n\n<b>                    CAROL\n</b>          We are always going to be all right\n          tomorrow. I'd like to be all right a few\n          todays.\n\n<b>                    DOC\n</b>          We're going to have a lot of those,\n              (easy, embracing her tightly)\n          We're just going to get the money and\n          then go all the way.\n\n<b>                    CAROL\n</b>              (smiling at him)\n          ... and live happily ever after.\n\n<b>INT. VAN - A WATCH FACE - DAY\n</b>\n<b>SWEEP SECOND HAND TURNING 8:35.\n</b>\n<b>DOC'S HANDS - SETTING A BOMB-TIMING MECHANISM ATTACHED TO TWO\n</b>STICKS of dynamite, two tubes of Naptha, a lot of prima cord\nand one small, dark percussion cap.\n\nCAROL SITS BEHIND THE WHEEL OF THE GREY PANEL TRUCK as it\nprowls smoothly down a brush-lined Central Texas road. Carol\ndrives calmly, professionally...\n\n<b>                    ANGLES\n</b><b>          DOC IS BEHIND CAROL, AT THE BACK OF THE\n</b>          VAN. He wears a jacket and watch cap. Doc\n          is squatted down, quickly activating\n          another timing mechanism, checking the\n          clock-face on the bomb against his\n          wristwatch... with a quick, dexterous\n          movement, he places a bomb into the two\n          large grocery bags at his feet. After\n          burying the explosives within each sack,\n          he covers the bombs with crumpled\n          wastepaper.\n<b>                    (MORE)\n</b><b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                            26.\n</b><b>CONTINUED:\n</b><b>                       ANGLES (CONT'D)\n</b>             The grocery bags are then gently shoved\n             forward, resting against the wheel well\n             of the truck.\n\nAs Doc looks at Carol...\n\n<b>INT. A '65 BUICK - RUDY\n</b>\nPARKED ALONG A SECLUDED PATHWAY, facing the highway which\nlies a quarter of a mile away.\n\nHe has on a trench coat buttoned to the neck and his sailor's\nwatch cap... he stares at the highway.\n\n<b>THE PANEL TRUCK SLIDES BY...\n</b>\n<b>EXT. HIGHWAY\n</b>\n<b>A FULLY-LOADED HAY TRUCK RUMBLES DOWN THE ROAD .\n</b>\n<b>INT. CAB - HAY TRUCK\n</b>\n<b>JACKSON IS DRIVING, HE WEARS A DARK RAINCOAT AND WATCH CAP.\n</b>\n<b>INT. BUICK\n</b>\nRUDY CHECKS HIS PISTOL. He shoves the pistol into the side\npocket of his raincoat. Rudy starts the engine... then slides\nthe car into gear...\n\n<b>EXT. MAIN STREET - BEACON CITY, TEXAS - DAY\n</b>\nA sleepy, traditional municipality...\n\n<b>A DAPPER GENTLEMAN IN HIS EARLY FIFTIES WALKS ALONG THE\n</b>SIDEWALK. He is the PRESIDENT of the First Bank of Beacon\nCity -- nodding to a few passersby, he stops at the front\ndoor of the bank, knocks twice. A BANK GUARD opens the door\nand the Bank President moves inside.\n\n<b>VISIBLE ON THE GLASS DOOR\n</b>\nsign that reads:\n\n<b>FIRST BANK OF BEACON CITY\n</b>\nFounded 1911 Hours: 9:00 AM to 2:00 PM Weekdays Only\n\n<b>INT. THE BANK\n</b>\nTHE PRESIDENT SNAPS ON A BANK OF IRRIDESCENT LIGHTS. Several\nTELLERS have begun setting up for the day's commerce...\n<b>\n</b><b>                                                            27.\n</b>\n\n\n<b>INT. PANEL TRUCK\n</b>\nDOC SHIFTS HIS POSITION SLIGHTLY, THEN   PULLS HIS .45 OUT from\nbeneath his jacket. Doc breaks out the   clip, examines it,\nsnaps it back to position. He replaces   the gun under his\njacket -- the gesture seemingly more a   mannerism than a\nprecaution.\n\nA huge pair of tongs and the massive wire cutters rest on the\nfloor of the truck near Doc, along with a black leather\nsuitcase.\n\nCAROL IN THE DRIVER'S SEAT, Beacon City appears on the\nhorizon through the windshield...\n\n<b>INT. BANK\n</b>\nTHE PRESIDENT BEGINS TURNING THE COMBINATION on the massive\ndoor as the vault begins to open...\n\nRUDY - IN THE BUICK - DRIVING DOWN THE ROADWAY near the\noutskirts of town. A Texas Highway Patrol car passes, moving\nin the opposite direction...\n\n<b>JACKSON - IN THE HAY TRUCK - PULLS ON A PAIR OF BLACK GLOVES,\n</b>then checks his watch.\n\n<b>A WATCH FACE SHOWS THE TIME AT 8:56.\n</b>\nTHE WATCH BELONGS TO DOC. He looks expectantly towards Carol.\n\nTHE PANEL TRUCK is now within the commercial district of\nBeacon City. Rudy's Buick is visible a hundred yards behind.\n\nTHE HAY TRUCK drives off Main Street and into an open field\nnear a corner of the town.\n\nJackson jumps down out of the cab of the truck and crosses to\nthe sidewalk.\n\nRudy's Buick pulls over and Jackson gets into the passenger\nseat. The Buick then cruises back out onto Main Street...\n\nCAROL - IN THE VAN - APPROACHES AN INTERSECTION. Through the\ntruck's window a traffic signal appears.\n\nRUDY PULLS THE BUICK OFF THE MAIN DRAG and onto a side\nstreet. Another turn and he again moves parallel to the Main\nStreet...\n<b>\n</b><b>                                                           28.\n</b>\n\n\n<b>INT. BANK\n</b>\nTHE BANK PRESIDENT LEAVES THE VAULT, allowing the heavy door\nto stand open.\n\nA LATTICE-WORK BARRIER made of wrought-iron is pulled across\nthe vault opening... the Bank President snaps the latch-lock\nclosed.\n\nCAROL - IN THE PANEL TRUCK. She pulls the van carefully to a\nstop at the intersection as the stoplight blinks red... She\nturns her eyes back to Doc...\n\nDOC, CATCHES HER LOOK, then instantly springs into action. He\nreaches down, pulls a hatch-like cover up from the floor of\nthe truck, revealing the road below... a portion of a manhole\ncover is visible.\n\n<b>                      DOC\n</b>                (barking the words)\n            Two feet forward...\n\n<b>CAROL ROLLS THE TRUCK SLIGHTLY FORWARD\n</b>\nON THE STREET - SEVERAL CARS can be seen moving up behind the\npanel truck.\n\nDOC GRABS THE TONGS, inserts the ends into the manhole cover\nnotches. He lifts the tongs and slides the manhole cover\nforward. Doc drops down through the truck hatchway and into\nopen manhole, carrying the huge cutters with him. As he\ndisappears from sight...\n\n98 RUDY DRIVING ON THE SIDE AVENUE, still moving parallel 98\nto Main Street. The Buick is now geographically well forward\nof the panel truck. Jackson stares at his watch.\n\n<b>                      JACKSON\n</b>            Now!\n\nRudy makes a sharp left. The car accelerates, its wheels\nbegin to quietly whine.\n\nMain Street comes back into view...\n\nCAROL WATCHING THE SIGNAL... still red...\n\nA MAN IN A PONTIAC eases to a stop behind the panel truck. He\nwatches the signal.\n\nDOC STANDING IN THE SEWER PIPE. He turns on a flashlight,\nmoves ahead. His feet slosh through the six-inch-high murky\nwater.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             29.\n</b><b>CONTINUED:\n</b>\nDoc shines the light on several ankle-thick conduit lines\nthat run along the sewer wall... He moves down the dark oval\ncorridor...\n\n<b>EXT. THE BANK\n</b>\nTHE GUARD OPENS THE FRONT DOOR, allowing the morning PATRONS\nto enter.\n\n<b>INT. THE BANK\n</b>\nTHE PRESIDENT SMILES UPON SEEING THE CUSTOMERS. He looks over\nto the wood-frame clock on the far wall.\n\n<b>THE CLOCK READS 9:00 EXACTLY\n</b>\nRUDY - IN THE BUICK - MAKES ANOTHER LEFT TURN, now back onto\nMain Street.\n\nTHE BANK APPEARS A HALF-BLOCK AWAY through the car window.\nRudy and Jackson pull their watch caps down over their faces;\nthe holes cut into the caps are wide enough to recognize a\ndisparity between their features...\n\nMAIN STREET - THE TRAFFIC SIGNAL has now blinked to green.\n\nCAROL IS GRINDING AWAY AT THE DEAD ENGINE of the panel\ntruck...\n\nTHE MAN IN THE PONTIAC leans on his HORN... other cars behind\nhim begin to HONK.\n\nCAROL LEANS OUT OF THE CAB OF THE PANEL TRUCK and gestures\nfor the cars to pass her. She again GRINDS away at the\nengine.\n\n<b>DOC'S WATCH - SHOWING 9:01.\n</b>\nDOC STANDS AT A MASSIVE CONNECTING BOX where four 112 strands\nof the conduit intersect. He puts the wire cutters to the\nfirst conduit, grasps the insulated handles and with a\ncrunching POP, he cuts through the conduit with one bite. Doc\nimmediately starts on the next strand.\n\nCAROL - ON MAIN STREET - trying to start the engine.\n\nTHE BUICK SLAMS TO A STOP IN FRONT OF THE BANK. Rudy Il4 and\nJackson pull open the car doors.\n\n<b>DOC CUTTING THE LAST AND LARGEST CONDUIT.\n</b><b>\n</b><b>                                                             30.\n</b>\n\n\n<b>INT. THE BANK\n</b>\nTHE BANK GUARD is placing a local high school basketball\nschedule and display into position.\n\nSEVERAL PATRONS have formed small lines and are transacting\nbusiness with the Tellers.\n\nThe wall clock shows the time at 9:02.\n\nRUDY AND JACKSON BURST THROUGH THE GLASS DOOR. They stand\nshoulder to shoulder, guns extended the full length of their\narms. Beneath the mask Rudy's smile is visible.\n\nTHE BANK GUARD LOOKS UP PROM THE BASKETBALL DISPLAY. His eyes\nwiden... both guns are leveled directly at him...\nsimultaneously the lights go out...\n\nTHE BANK PRESIDENT DESPERATELY PUSHES THE ALARM BUTTON near\nhis desk. (INSERT: Button and bell.) Nothing happens.\n\nCAROL - ON MAIN STREET - trying to start the engine.\n\n<b>INT. A DENTIST'S OFFICE\n</b>\nTHE D.D.S. TORTURES A BALDING PATIENT with a drill. The\nPATIENT groans, lifts one leg in the air from the pain.\n\nWhen the power goes, the Dentist quizzically raises the drill\nand examines it. The Patient pants in relief.\n\n<b>                    DENTIST\n</b>          Superior technology, my ass.\n\nAN ELECTRIC WEATHER/TIME INDICATOR - above the town square...\nas the bulbs dim...\n\nDOC RUNNING DOWN THE SEWER; stopping at the manhole he\nscrambles up the permanent ladderway, tossing his wire\ncutters up into the truck parked over him.\n\nCAROL - IN THE DRIVER'S SEAT - again she tries to start the\nengine.\n\nDOC PULLING HIMSELF BACK UP INTO THE VAN with a gymnastic\nthrust he quickly slides the manhole cover with the tongs.\n\nCAROL - the engine still won't start.\n\nDOC DROPS THE HATCH DOOR back down into place on the floor of\nthe truck...\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             31.\n</b><b>CONTINUED:\n</b>\n\n<b>                       DOC\n</b>                 (snapping his look to Carol)\n             Okay.\n\n<b>CAROL TURNS THE IGNITION SWITCH BACK ON...\n</b>\nCAROL - AS THE ENGINE ROARS TO LIFE she engages the\ngearshift. The truck begins to move forward. Suddenly, the\nmotor does STALL.\n\nDOC'S PACE TIGHTENS. The cars behind the van continue\n<b>HONKING.\n</b>\nCAROL - AGAIN GRINDING AWAY AT THE ENGINE. Her lips are\ncompressed into a thin line... After a moment... the motor\ncatches, the truck again moves forward.\n\nDOC PICKS UP THE LARGE BLACK SUITCASE from the floor of the\npanel truck, then begins to move toward the cab and Carol.\n\nTHE PANEL TRUCK WHIPS OFF MAIN STREET and onto a side avenue.\nCarol pulls the van up to the curbway, jerking to a stop.\n\nDOC IS NOW IN THE FRONT SEAT BESIDE CAROL. He pulls the truck\ndoor open, then hesitates. He touches her arm, their eyes\nmeet briefly, both their faces warming for a moment. Doc\ngives her a casual wink then quietly exits the truck.\n\n<b>ON THE SIDEWALK\n</b>\nDOC TURNS AND BEGINS WALKING toward an open alleyway. Behind\nhim the panel truck pulls smoothly away.\n\n<b>WALKING UP THE ALLEY - DOC PULLS ON A PAIR OF BLACK GLOVES.\n</b>He turns again, now moving down a totallydeserted side alley.\n\nThe alley opens at one end onto a back street; the opposite\nend is bounded by a large brick building. Doc removes his\npistol from his coat pocket, then approaches a doorway along\nthe side of the brick building. At the last moment he pulls\ndown the watch cap mask.\n\n<b>INT. BANK\n</b>\nRUDY DISENGAGES THE LATCH on the side door.\n\n<b>EXT. ALLEY\n</b>\nDOC KICKS THE DOOR OPEN with a violent jerk of his leg.\n<b>\n</b><b>                                                            32.\n</b>\n\n\n<b>INT. THE BANK\n</b>\nRUDY'S GUN IS TRAINED PROM THE BACK OF THE BUILDING over the\nTellers and Patrons, spread-eagled across the floor. Their\nheads are down; several of them are trembling.\n\nDOC STANDS HOLDING THE .45 IN ONE HAND, suitcase in the\nother. He moves into the building, shutting the door behind\nhim.\n\nRUDY IS NOW STATIONED NEAR THE FRONT DOOR, ready to intercept\nany incoming bank patrons -- he covers the room from the end\nopposite Jackson.\n\nRudy stands near the Bank Guard's outstretched right hand --\nThe Guard's head is bloodied from Rudy's pistol whipping. His\ngun has been kicked against the wall. A short distance away\nRudy is watching.\n\nTHE BANK PRESIDENT lies face down on the floor, directly\nunder the arc of Jackson's gun... who is continually turning\nto watch the Guard.\n\nDOC QUICKLY CROSSES THE DISTANCE between the side door and\nthe vault, passing the Bank President. He slips the .45 into\nhis jacket side pocket, sets down the suitcase, then either\ncuts the lock or picks it.\n\n<b>                    RUDY\n</b>              (looking at his watch)\n          19 seconds.\n\nCAROL - IN THE VAN - She has stopped the panel truck near the\ndeserted lot where the hay truck is parked.\n\nShe drops the bomb-laden grocery bag inside the truckbed. She\nmoves back towards the van...\n\n<b>IN THE BANK\n</b>\nDOC FINISHES,, RIPS THE DOOR OPEN, lifts the suitcase and\nmoves into the vault.\n\nRUDY LOOKS AT THE BLOODIED GUARD, notes the distance\nseparating the man from his gun. Though unconscious, the\nGuard's head begins to move.\n\nJACKSON HOLDS HIS GUN HAND FULLY EXTENDED. Again he takes a\nbrief moment to glance nervously over to the open vault and\nat the Guard.\n\nANGLES AND INSERTS - THE VAULT is lined with safety deposit\nboxes and large cabinet drawers.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             33.\n</b><b>CONTINUED:\n</b>\n\nA metal table stands off-center, the black suitcase resting\non its surface. Doc opens the satchel. He then pulls open one\nof the cabinet drawers nearby and begins tossing banded money\npads into the open suitcase.\n\nTHE BANK PRESIDENT LIES NEAR THE OPEN VAULT. He listens to\nthe SOUNDS of Doc at work. He slightly cranes his neck,\ntrying to get a look at the thief inside the vault.\n\nRUDY WATCHING THE FRONT DOOR. A PATRON enters; Rudy gestures\nwith the gun... she hits the deck.\n\nJACKSON IS GETTING MORE NERVOUS by the minute...\n\nDOC continues working within the vault.\n\nTHE WOMAN, now on the floor, quietly crying.\n\nJACKSON watching the Guard.\n\nRUDY watching Jackson. Calling out time.\n\nTHE BANK GUARD, glassy-eyed, but conscious; he has the look\nof a prizefighter who has just suffered a knockout, but is\nready for one more round.\n\nTHE BANK PRESIDENT in his prone position. He looks at\nJackson, then to the vault.\n\nTHE PANEL TRUCK - now at the other end of Main Street.\n\nCAROL EXITS THE VAN, carries the second sack to a large\nrubbish bin in front of an empty store. She deposits the\ngrocery bag...\n\nDOC WORKING. The suitcase is now filled. He snaps the\nfasteners shut .\n\nDOC EXITS THE VAULT after withdrawing his .45 from his coat\npocket .\n\nJACKSON SEES DOC LEAVE THE VAULT. He edges around the side of\nthe tellers' cages toward the front of the bank.\n\n<b>DOC MOVES TOWARDS JACKSON'S OLD VANTAGE POINT NEAR THE SIDE\n</b>DOOR. He passes the bank president.\n\n<b>RUDY NOW WATCHES DOC\n</b>\nDOC CARRIES THE HEAVY SUITCASE IN HIS LEFT HAND. He gestures\nto Rudy and Jackson with his pistol while moving towards the\nside door.\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                             34.\n</b><b>CONTINUED:\n</b>\n\n<b>JACKSON HALF RUNS PASSING RUDY ON HIS WAY TO THE FRONT\n</b>ENTRANCE still watching the Bank Guard.\n\n<b>THE BANK GUARD STILL PUNCH DRUNK PULLS HIMSELF UP TO HIS\n</b>HANDS and knees... the Guard looks at his pistol.\n\n<b>DOC STOPS AT THE KICKED IN SIDE DOOR. HE COVERS THE ENTIRE\n</b>bank with his gun.\n\n<b>THE BANK GUARD BEGINS TO CRAWL WITH AGONIZING SLOWNESS\n</b>towards his pistol.\n\n<b>RUDY EYES STILL ON DOC\n</b>\n<b>JACKSON NOW AT THE FRONT DOOR IS PARALYZED WATCHING THE\n</b><b>GUARD.\n</b>\n<b>DOC GESTURES TO RUDY AND JACKSON TO GET MOVING.\n</b>\n<b>EXT. STREET - DAY\n</b>\n<b>CAROL PARKS THE VAN, CROSSES TO A FORD, GETS IN, DRIVES AWAY.\n</b>\n<b>INT. BANK\n</b>\n<b>THE GUARD HAS MORE THAN HALF CLOSED THE DISTANCE TO THE .38.\n</b>\n<b>JACKSON LEVELS HIS .44.\n</b>\n<b>DOC AND RUDY. BOTH SEE WHAT IS ABOUT TO HAPPEN.\n</b>\n<b>                      DOC\n</b>                (shouts)\n            Just pick it up.\n\n<b>                      RUDY\n</b>            Don't!\n\n<b>JACKSON PULLS THE TRIGGER THREE TIMES.\n</b>\nTHE BANK GUARD'S BODY turns end-over-end from Jackson's\nbullets. Some of the bank Patrons SCREAM, others SOB with\nfright.\n\nDOC - His eyes are furious.\n\nRUDY AND JACKSON - Rudy shoves Jackson out the front door.\n\nDOC COVERS THEIR EXIT, then slips out the side door and into\nthe alley.\n<b>\n</b><b>                                                             35.\n</b>\n\n\n<b>EXT. MAIN STREET\n</b>\nRUDY GUNS THE BUICK FORWARD, the wheels tearing at the\nasphalt. Jackson's shoulders rock back as the big car\naccelerates.\n\n<b>                    THE ALLEY\n</b>          DOC, GUN AND SUITCASE IN HAND, nears the\n          end of the alleyway.\n\nCAROL - IN A FORD - suddenly pulls up, filling the roadway\nopening.\n\nDOC TOSSES THE SUITCASE into the back of the car... then\nslides the pistol under his coat and slips behind the wheel\nas Carol slides over to the passenger seat.\n\n<b>INT. THE FORD\n</b>\nDOC PULLS OFF THE WATCH CAP MASK; his face taut.\n\nTHE FORD SMOKES OFF as Doc kicks it into gear...\n\n<b>MAIN STREET BEACON CITY A SERIES OF ANGLES\n</b>\nTHE BUICK STREAKS DOWN THE CENTER OF THE ROADWAY... Two bombs\ndetonate into fireballs... The Hay truck blazes upward, bales\ninstantly igniting.\n\nThe grange at the opposite end of town becomes an orange-\nflame inferno...\n\nTraffic stalls on the boulevard; Drivers and Pedestrians gawk\nat the twin blazes.\n\nRUDY ZIG ZAGS THE BUICK ALONG. Maneuvering through the\nstopped traffic.\n\nDOC SLIDES THE FORD THROUGH A RIGHT AND LEFT TURN, emerging\nonto smoke-covered Main Street.\n\nThe speeding Ford avoids a halting car, then suddenly spins\nout of control, jumps across the sidewalk, splinters a wood\nbench, and finally slides in a complete circle across the\ngrass of a small park.\n\n<b>INT. FORD '\n</b>\n<b>DOC LOOKS MORE THAN A LITTLE EMBARRASSED AS CAROL STARES\n</b>\nAT him.\n\n<b>POLICE CARS ROAR BY THEM.\n</b><b>\n</b><b>                                                           36.\n</b>\n\n\n<b>EXT. SMALL PARK\n</b>\n<b>DOC ZIPS THE CAR OFF THE GRASS AND BACK ONTO THE TRAFFIC\n</b><b>CLOGGED ROADWAY.\n</b>\nRUDY DRIVING THROUGH THE BEDLAM. Suddenly a gun appears in\nhis right hand, aimed at Jackson. The pistol roars bucks,\nroars, bucks again. Jackson is shot through the head twice.\n\n<b>THE FORD IS SEVERAL BLOCKS BEHIND RUDY. DOC DOWNSHIFTS\n</b>avoiding stalled cars. Carol grasps at both the seat and the\ndashboard handholds to maintain her balance.\n\nTHE BUICK EMERGES THROUGH DENSE PLUMES OF SMOKE. Fire licks\nalong the one edge of the sidewalk.\n\nRUDY IN THE BUICK HAS NOW ALMOST CLEARED THE TOWN. He tears\nalong the highway... sweating a little but becoming cool. He\nis a pro. His watch cap is now removed.\n\nON THE CURVE - Jackson's body is kicked out of the automobile\nand bounces across the pavement.\n\nDOC IN THE FORD POWERS ALONG. He approaches the flaming\nbuilding, then hits the brakes as ...\n\nA BIG DIESEL TRUCK AND TRAILER is coming in the opposite\ndirect ion,, jack-knifes across the road, desperately trying\nto avoid the cars stopped in the middle of the street .\n\nDOC, AS THE TRUCK AND TRAILER SUDDENLY APPEAR THROUGH the\nsmoke in front of him, throws the car broadside into a four\nwheel drift. Now sideways, then straight, he bumps across the\nsidewalk, over a patio of a house, knocking down two pillars,\nthrough a parking lot, taking with it a large cleaners sign,\nthen bores back onto the road.\n\nRUDY IN THE BUICK STROKING ALONG THE OPEN HIGHWAY. Looks in\nthe rear view mirror.\n\nRUDY'S POV - THROUGH THE BUICK'S REAR WINDOW, BLACK smoke is\nvisible billowing skyward.\n\nDOC AND CAROL IN THE FORD NOW DRIVING CALMLY THROUGH the\ncountryside. A police car with light turning and siren\nwailing passes them, heading for the conflagration in Beacon\nCity. Doc's eyes follow the Patrol Car until it disappears\nfrom sight.\n\nTHE BUICK - SERIES OF ANGLES - IT pulls off the highway and\nbumps down a dirt road. Rudy strains to hold the big car on\nthe rutted pathway.\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             37.\n</b><b>CONTINUED:\n</b>\n\nThe dirt road becomes a lane.\n\nA farm house and barn appear at a clearing. Rudy powers the\ncar up a fairly steep hill, the crest of which is occupied by\na seemingly abandoned and dilapidated house barn.\n\nRUDY JUMPS OUT OF THE BUICK, trots to the front of the barn\nand pulls the double-doors open. A station wagon with wooden-\npanel or the usual painted panel sides can be seen within...\n\nTHE FORD SWEEPS OFF THE HIGHWAY and onto the dirt road.\n\nWITHIN THE FORD - DOC IS DRIVING. Carol peels off her\nsweater. She has worn a faded blouse underneath... She pulls\na ribbon; her hair falls changing her appearance.\n\nRUDY - IN THE BARN - The Buick is now parked near the Station\nWagon. Standing in the shadows, he intently reloads his gun,\nthen moves towards the large doors of the barn.\n\nCAROL - IN THE PASSENGER SEAT OF THE FORD - she watches as\nDoc drives up the lane...\n\nRUDY stands outside the barn as the car approaches.\n\nDOC STUDIES RUDY THROUGH THE WINDSHIELD, watching him wipe\nhis face with a soiled rag as the car pulls closer...\n\n<b>INT. BARN\n</b>\nDOC PULLS THE FORD TO A STOP just within the double doors. He\npasses Rudy, leaving a clear exit pathway for the getaway\nstation wagon.\n\nDOC JUMPS OUT OF THE FORD AS SOON AS the ignition switch is\ncut; Carol a beat behind him on the opposite side.\n\nRudy moves into the archway created by the barn's open doors.\nHe stands almost in silhouette as the bright sunlight breaks\naround him.\n\nDoc snaps open the door of the car, his back turned to Rudy.\nHe reaches into the back seat and grasps the black suitcase,\nnot by the middle handle but by each end, as if it contained\na great weight.\n\n<b>                      DOC\n</b>                (speaking over his shoulder,\n                 not looking at Rudy)\n            Where's Jackson?\n\nRudy withdraws the pistol from under his raincoat.\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             38.\n</b><b>CONTINUED:\n</b>\n\n<b>                    RUDY\n</b>              (pointing his gun lazily at\n               Doc, supremely confident)\n          He didn't make it, Doc... you didn't\n          either.\n\nDoc straightens, still holding the suitcase. He starts to\nturn to Rudy, eyes wide, helpless. Carol fumbles for the gun\nin her purse.\n\nRudy extends his arm, ready to begin the execution. Doc\nswings the suitcase around slowly, seemingly ready to face\nRudy's bullets... then he shoots Rudy in the middle of the\nchest, Doc's .45 slug driving him backward.\n\nDoc has concealed the pistol in his hand with the satchel. He\ndrops the suitcase with his first shot, FIRES again, blasting\nRudy in the middle. Two large holes now show at the chest of\nRudy's raincoat.\n\nRudy is knocked back over the hillock, tumbling down the\nprecipice and into a grassy meadow below. Doc stands at the\ncrest of the hill. He looks down as Rudy's body stops\nturning. Doc shifts the .45 to his right hand.\n\nRudy's body lies still.\n\nDOC TURNS QUICKLY AWAY PROM THE HILLTOP, not giving Rudy's\nbody a second glance. Carol, gun in hand, stands outside the\nbarn, transfixed.\n\n<b>                    CAROL\n</b>          How did you know?\n\nDoc doesn't answer, motioning her into the car... the getaway\ncar... as she starts to change clothes... he reloads. Doc\ntakes a long look at Carol.\n\n<b>THEY GET IN THE CAR AND LEAVE.\n</b>\n<b>EXT. BOTTOM OP HILL - DAY\n</b>\nCAROL IS DRIVING., tooling comfortably along a country road.\nDoc is beside her, the suitcase resting in the back seat.\nAfter several moments of silence:\n\n<b>                    CAROL\n</b>          What about the bank?\n\n<b>                    DOC\n</b>              (after a moment)\n          Jackson panicked and nailed the guard.\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                          39.\n</b><b>CONTINUED:\n</b>\n\nCarol takes a deep breath,, then turns her look at the side\nwindow.\n\n<b>                    CAROL\n</b>          Oh, Christ.\n\nDoc leans forward., snaps on the radio.\n\n<b>EXT. ABANDONED FARM - DAY\n</b>\nRUDY BUTLER STUMBLES BACK OVER THE CREST OP THE HILLOCK and\nonto the pathway in front of the barn. His figure is slightly\ngrotesque; the raincoat shows two holes from Doc's .45 slugs,\nalong with considerable dirt and grass stains picked up on\nhis ass-over-tea kettle trip to the bottom of the hill. He is\nobviously in some pain, his walk is a half-lurch.\n\n<b>EXT. SIDE OF THE BARN - DAY\n</b>\nRUDY TURNS ON A RUSTED TAP which sends all-pocketed water\ngurgling down into a mold-covered trough. Rudy pulls off the\nyellow raincoat, revealing the fact he has worn one of the\npadded bullet-proof vests. Rudy undoes the vest, lets it fall\nto his feet. A huge crimson stain shows at his collarbone.\n\nRUDY TOUCHES THE BLOOD WITH HIS RIGHT HAND, then looks at his\nhand. Breathing heavily he kneels down and begins to splash\nthe purling water across his face and then he laughs.\n\n<b>INT. STATION WAGON - DAY\n</b>\n<b>DIALOGUE COMES ON THE RADIO DESCRIBING THE ROBBERY. $750,000\n</b>stolen.\n\n<b>                    DOC\n</b>          We got between four and five.\n\nCarol starts to open the bag and count.\n\nDoc flicks off the radio then cracks open the windwing. Doc\nreflectively studies the roadside ahead. They are heading\nalong a comfortable tree and meadowlined thoroughfare that\ncarries only a sparse amount of traffic.\n\nDoc's eyes suddenly narrow on the road ahead.\n\n<b>                    CAROL\n</b>              (now noticing the road)\n          Doc...\n\n<b>                     DOC\n</b>              (flat)\n          I see it...\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             40.\n</b><b>CONTINUED:\n</b>\n\nON THE ROAD AHEAD HIGHWAY PATROLMEN HAVE FORMED a traffic\nbarricade. Several cars and trucks are being waved through\nthe check-point. Wearing sunglasses and Stetson hats, the\nUniformed officers make a cursory glance into each passing\nvehicle.\n\nDOC ANALYZES THE SITUATION WITHOUT CHANGING EXPRESSION He\nslips the station wagon up behind a pickup truck in the line\nof slowly-passing vehicles.\n\nShe turns, starts to reach into the back. Doc gently catches\nher arm, preventing her from moving further.\n\n<b>                    DOC (CONT'D)\n</b>          They're looking for three men...\n          remember?\n\nA YOUNG OFFICER looks into the cab of the pickup, then\nglances at the empty flatbed. Another PATROLMAN flanks the\nother side of the truck, repeating the procedure. Several\nPatrol Cars, fully loaded with additional OFFICERS, are\nparked nearby. The pickup truck is waved through. The station\nwagon rolls up to the check-point.\n\nDOC ROLLS DOWN HIS WINDOW. He smiles and nods to the Young\nPatrolman.\n\n<b>                    DOC (CONT'D)\n</b>              (big smile)\n          What's the problem?\n\nCAROL STUDIES THE OFFICER on her side of the car through the\nclosed window... the Officer peers back at her then into the\nrear seat.\n\nTHE STATION WAGON is waved ahead without a second glance by\nthe Patrolman; Doc accelerates away from the roadblock...\nAfter a moment, Doc leans forward, snapping on the radio.\n\n<b>EXT. THE FARM - RUDY - DAY\n</b>\nInside the barn, behind the wheel of the panel truck, Rudy's\nmatted black hair is in contrast to his blanched face. He\nstarts the engine, painfully bringing it to a ROAR. The panel\ntruck leaps crazily forward, careening across the barn floor,\nSMASHING through the edge of the wooden doors as it bursts\nout into the sunlight.\n\n<b>EXT. SMALL TOWN - DAY\n</b>\nThe station wagon rolls down the main street and stops near\nan outdoor phone booth at a filling station.\n<b>\n</b><b>                                                         41.\n</b>\n\n\n<b>INT. STATION WAGON\n</b>\n<b>DOC SHUTS OFF THE ENGINE, PULLS OPEN HIS DOOR.\n</b>\n<b>DOC MOVES INSIDE THE PHONE BOOTH CARRYING A FIST-FULL\n</b>\nof loose change. He begins to dial...\n\n<b>INT. BEYNON'S OFFICE - DAY\n</b>\n<b>THE PHONE RINGS. THE ACCOUNTANT LIFTS THE RECEIVER.\n</b>\n<b>                       ACCOUNTANT\n</b>          I 'm here.\n\nHe presses a button on the intercom.\n\n<b>ANOTHER PHONE IN THE OFFICE 234\n</b>\n<b>                       CULLY\n</b>          Yeah.\n\nHe presses a button on the intercom.\n\n<b>ANOTHER PHONE IN THE OFFICE.\n</b>\n<b>HAYHOE PICKS UP THE PHONE.\n</b>\n<b>                       HAYHOE\n</b>          Yeah.\n\nHe presses a button on the intercom.\n\n<b>ANOTHER PHONE IN THE OFFICE\n</b>\n<b>SWAIN TURNS AND REACHES FOR THE RECEIVER.\n</b>\n<b>EXT. SMALL TOWN\n</b>\n<b>DOC MOVES TOWARDS THE WAGON, CLIMBS INSIDE.\n</b>\n<b>INT. STATION WAGON.\n</b>\n<b>DOC SLAMS THE DOOR SHUT. CAROL LOOKS ACROSS AT HIM.\n</b>\n<b>                    DOC\n</b>          They checked in.\n\n<b>                    CAROL\n</b>          Call the ranch, tell Beynotr we'll leave\n          his cut here --\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                            42.\n</b><b>CONTINUED:\n</b>\n\n<b>                     DOC\n</b>          Why?\n\n<b>                    CAROL\n</b>          There are three men dead.\n\n<b>                    DOC\n</b>          So what. I've got to give him his money.\n          That was our end of the deal.\n\n<b>                    CAROL\n</b>          He might be ready to chop us up.\n\n<b>                    DOC\n</b>          Do it my way.\n\nHe starts the engine. The station wagon pulls away.\n\n<b>INT. STATION WAGON\n</b>\n<b>AS IT PULLS OUT OF THE SMALL TOWN.\n</b>\n<b>                    DOC\n</b>          Tell me about Beynon's ranch.\n\n<b>                    CAROL\n</b>          I've never \"been there... When we met it\n          was in his office.\n\nDoc looks at her for a moment.\n\n<b>                    CAROL (CONT'D)\n</b>              (continuing; hesitant)\n          Do you trust him?\n\n<b>                    DOC\n</b>          I just figure the percentages. He\n          wouldn't try a cross until he's got the\n          money.\n\n<b>                    CAROL\n</b>          Let's send his cut back -- Just keep\n          going.\n\n<b>                    DOC\n</b>          If we make a mistake., he'll burn us. You\n          make a deal, you're always better keeping\n          your end up.\n\n<b>                    CAROL\n</b>          I don't want to go there.\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                             43.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>          Do it my way.\n\nThe wagon continues moving down the road.\n\n<b>EXT. A NARROW DIRT ROAD - LATE AFTERNOON\n</b>\nTWO HOURS BEFORE SUNSET. A CHILL SOUTHWEST WIND is blowing.\nThe station wagon appears, moving slowly down the roadway,\nbouncing along its rutted surface.\n\nAT A SMALL INTERSECTION TWO MAIL BOXES STAND CLOSE to one\nanother. The name Beynon is printed in black paint on one of\nthe letter bins. Doc stops the wagon momentarily, looks at\nthe box, then turns down the indicated road.\n\n<b>EXT. THE STATION WAGON - LATE AFTERNOON\n</b>\nTHE STATION WAGON clears the crest of a sage brush hill and\npasses camera.\n\n<b>INT. STATION WAGON - LATE AFTERNOON\n</b>\nDOC PARKS THE WAGON UNDER A GNARLED COTTONWOOD TREE in front\nof the house. As he shuts off the engine, he pulls the .45\nout of his coat pocket and shoves it into his waistband.\nCarol watches the gesture. Doc starts to open the car door,\nthen hesitates.\n\n<b>                    DOC\n</b>          You can wait here... I'll wrap it up\n          fast.\n\nDOC STEPS OUT OF THE WAGON, then pulls the leather suitcase\nout of the back. He quietly shuts the car door and moves\naround the side of the house, toward the barn/garage at the\nrear.\n\nHE LOOKS CAREFULLY around the area, his eyes searching for\nsigns of Beynon's men. Nothing seemingly amiss, he moves\ntoward the front door, tries it, moves away.\n\nDoc crosses to the back screen door of the house. After\nanother moment, Doc quietly opens the screen door and enters\nthe house.\n\n<b>INT. HOUSE - LATE AFTERNOON\n</b>\nDOC MOVES THROUGH THE SERVICE PORCH/PANTRY and into the\nkitchen.\n<b>\n</b><b>                                                          44.\n</b>\n\n\n<b>INT. KITCHEN - BEYNON - LATE AFTERNOON/NIGHT\n</b>\nBEYNON SITS AT THE LONG KITCHEN TABLE] head on hand, eyes\nslightly glared... on the checkered oilcloth in front of him\nis a quart bottle of Jim Beam, now half full. He's drinking\nthe sour mash straight with a water chaser.\n\nDOC LOOKS STEADILY AT BEYNON for a moment,, sets the suitcase\ndown on the floor, then crosses to the sink, picks up a glass\nand sits down at the table. Doc pours himself a drink, takes\na sip.\n\n<b>                    BEYNON\n</b>          Hello, McCoy.\n\n<b>                     DOC\n</b>          Beynon.\n\n<b>                    BEYNON\n</b>              (swishing the drink)\n          News said two persons killed.\n\nExcept for a faint thickness of speech, Beynon seems quite\nsober. Beynon wears a .38 Detective Special C.T.G. in a worn\nleather belly holster.\n\n<b>                    DOC\n</b>          Three... Rudy got ambitious.\n\n<b>                    BEYNON\n</b>          And you got him...\n\n<b>                    DOC\n</b>          That's right.\n\nDoc looks at Beynon, notes his gun, then continues stacking\nthe money.\n\n<b>                    BEYNON\n</b>          What about your wife?\n\n<b>                    DOC\n</b>          What about her?\n              (moving right to the business\n               at hand)\n          Let's c ut up the money, I want to get\n          North.\n\n<b>INT. STATION WAGON\n</b>\n<b>PARKED UNDER THE COTTONWOOD AT THE FRONT OF THE HOUSE. CAROL\n</b><b>SITS CHEWING GUM... LINES OF STRAIN HAVE FORMED ACROSS HER\n</b><b>FACE.\n</b><b>\n</b><b>                                                            45.\n</b>\n\n\n<b>INT. KITCHEN\n</b>\n<b>DOC LISTENS CAREFULLY TO BEYNON.\n</b>\n<b>                    BEYNON\n</b>          Your wife told me no one would be killed.\n\n<b>                    DOC\n</b>          You hired Jackson and Rudy., not me.\n\n<b>                    BEYNON\n</b>          They may nail me into this now, McCoy.\n\n<b>                    DOC\n</b>          That's your problem.\n\n<b>                    BEYNON\n</b>              (smiles)\n          You know, you and I may be two of a kind.\n\n<b>                    DOC\n</b>          No way. I always do my own work.\n\nBeynon smiles and slops three fingers of whiskey into Doc's\nglass.\n\n<b>                    BEYNON\n</b>          Here. I understand the way you feel. As a\n          matter of fact, you and I might share a\n          great many feelings...\n\nBeynon drinks from his glass. Doc continues counting the\nmoney.\n\n<b>                    DOC\n</b>              (snaps the words)\n          I'm in a hurry.\n\n<b>                    BEYNON\n</b>          You still don't get the picture do you?\n          I've always heard what a smart ass\n          operator you are.\n\n<b>                    DOC\n</b>          No applause!\n\nBeynon pauses a moment. Doc looks steadily across the table\ninto BeynonTs eyes. Prom beyond there might be the quiet\nsound of a screen door opening. Beynon gets out of the chair,\nstands beside the table.\n\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                             46.\n</b><b>CONTINUED:\n</b>\n\n<b>                    BEYNON\n</b>          Let's examine the situation. One, an\n          extremely attractive woman. Then, there's\n          the woman's husband, a skillful bank\n          robber serving a long sentence in prison.\n          Three, a man with political influence, a\n          man who can easily get a parole for a\n          convict... why should he?\n\nBeynon sips his glass slowly. Doc's hand edges down toward\nhis waist band.\n\n<b>                    BEYNON (CONT'D)\n</b>              (continuing)\n          A simple reason, McCoy. The obvious\n          reason. To rob a bank.\n\n<b>                    DOC\n</b>          I knew that life didn't add up to the\n          obvious when I was 8.\n\n<b>                    BEYNON\n</b>              (cautiously)\n          What do you add up to here?\n\n<b>                    DOC\n</b>          One. The radio's rappin' about $750^000.\n          We only got a half a million.\n\n<b>                    BEYNON\n</b>          A little more was taken out before.\n              (a beat)\n          My brother's a director of that Bank, Mr.\n          McCoy... I had a few pressing debts.\n\n<b>                    DOC\n</b>          So we did that crackerbox... to cover for\n          you.\n\n<b>                     BEYNON\n</b>              (smiles., nodding)\n          The obvious.\n              (as his smile fades)\n          But we are both not interested in that\n          right now.\n\n<b>                    DOC\n</b>          No.\n              (a long beat)\n          My old lady must have made a lot of\n          promises.\n\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                           47.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    BEYNON\n</b>          Close... but it takes a hell of a lot\n          more than promises to pull the kind of\n          strings I pulled.\n\n<b>                    DOC\n</b>          I bet.\n\nDoc senses a movement from the shadows behind Beynon. Turning\nhis head slightly, Doc can see Carol standing at the entrance\nto the kitchen. She holds a .32 automatic... the pistol seems\nto be pointed directly at Doc.\n\n<b>                    BEYNON\n</b>          You wouldn't have come here when you were\n          eight3 Mr. McCoy.\n\nAs the gun continues to be pointed directly at Doc.\n\n<b>                    BEYNON (CONT'D)\n</b>              (continuing)\n          Don't think too badly of her... After\n          all, you were in jail a long time and she\n          is a healthy young woman.\n\n<b>                    DOC\n</b>              (riding over Beynon's words)\n          Get it over with...\n\nCAROL FIRES the automatic. The big gun belches the full slip\nin a stuttering EXPLOSION... the slide remains back and in an\nejected position.\n\nBEYNON is driven back to the kitchen wall. He SHRIEKS aloud,\nthe noise strangely like laughter... his body flattens\nagainst the surface, slips downward^ riddled by the big bore\nslugs... Doc stands momentarily frozen against the overturned\ntable. He looks up from Beynon's crumpled body. Carol takes\ntwo steps forward, then drops the automatic, sending it\nclattering and spinning away across the floor.\n\nDOC looks at Carol, their eyes find each other. He turns,\nmoves to the sink, splashes water across his face, then fills\na glass of water from the tap ... drinks it; he looks back at\nher.\n\nCAROL stands watching Doc, tears scream down her cheeks.\n\nDOC crosses to Carol, takes her arm, picks up the gun, spent\nshells and the suitcase, then leads her out of the kitchen\ntoward the back door. Beynon's body has slipped from sight,\nonly a few traces of blood show along the white wall.\n<b>\n</b><b>                                                             48.\n</b>\n\n\n<b>INT. PANEL TRUCK - DUSK\n</b>\nRudy is driving along an open highway. Rudy mouths inane\nlyrics to the radio, one arm on the wheel, the other\nclutching his wound. A small sign near a mailbox catches\nRudy's eye. He swings the panel truck around in a U-turn,\nthen pulls into the long dirt driveway of an isolated farm\nhouse.\n\n<b>THE SIGN READS\n</b>\n<b>HAROLD CLINTON, D.V.M.\n</b>\nPractice of Veterinary Medicine.\n\n<b>                                                   DISSOLVE TO:\n</b>\n<b>EXT. DESERTED HIGHWAY - DUSK\n</b>\nTHE STATION WAGON IS PARKED ALONG THE CEMENT ROAD, standing\nin isolation against the vast Texas b.g.\n\nDoc stands away from the car, his back turned to it ...\ngazing at the horizon.\n\nCarol is in the wagon but the passenger side door is open,\nher legs dangle outside the car as she looks steadily at the\nground. Doc suddenly turns, walks to her and gives her a\nstinging slap across the face.\n\n<b>                    DOC\n</b>          Stupid.\n\nTears begin to roll down Carol's face.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing)\n          Why didn't you tell me?\n\n<b>                    CAROL\n</b>          There wasn't any way to explain it.\n\n<b>                    DOC\n</b>          Yeah.\n\n<b>                    CAROL\n</b>          You sent me to him.\n\n<b>                    DOC\n</b>          When I got out, why didn't you tell me\n          where it was?\n\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                            49.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>          What the hell do you want? Mary Tyler\n          Moore?\n\n<b>                       DOC\n</b>          Who's she?\n\n<b>                    CAROL\n</b>          She's on TV.\n\n<b>                    DOC\n</b>          If you don't start telling the truth...\n              (breaks off)\n\n<b>                    CAROL\n</b>          What do we do?\n\n<b>                    DOC\n</b>              (quietly)\n          We keep going.\n\n<b>INT. BEYNON'S OFFICE - NIGHT\n</b>\nSwain sleeps on the davenport. Cully and Hayhoe sit at two\nsides of Beynon's large desk, playing a game of checkers...\nHayhoe seems to have Cully badly beaten ... The Accountant\nenters the room. The block on the wall shows eight o'clock\nstraight up.\n\n<b>                       ACCOUNTANT\n</b>          Let's go.\n\nThe two men abandon their game. Cully kicks the sofa,\nawakening Swain. He groggily gets to his feet.\n\n<b>INT. MULTI-STORIED AUTO PARK - SAN ANTONIO - DAY\n</b>\nThe station wagon enters the building. Doc takes a bright\norange ticket from an ATTENDANT behind a glass window, then\naccelerates the wagon up a rampway leading to the upper\nlevels of the building.\n\n<b>                    DOC\n</b>          checks his watch momentarily as he prowls\n          the wagon between long rows of\n          automobiles.\n\n<b>THE STATION WAGON'S TIRES\n</b>\nWHINE through a sweeping turn within the auto park's\nuppermost level -- through the building's portals the bright\nmorning sun can be seen reflecting off the city's rooftops.\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                           50.\n</b><b>CONTINUED:\n</b>\n\nDOC PULLS THE WAGON to an abrupt halt within a parking stall -\n- at an isolated area. He steps out onto the concrete\nflooring, slams the door shut.\n\nDoc turns away from the car. As he approaches the elevator,\nDoc tears the orange auto park stub into fragments and drops\nthem into a trash bin without missing a stride.\n\n<b>INT. TRAIN STATION - MORNING\n</b>\nCAROL IS STANDING IN A TICKET LINE THAT MOVES slowly foward.\nShe struggles, clutching the heavy, money laden suitcase and\nher oversize purse between both arms. The line of ticket\nbuyers moves forward .just fast enough to make it impractical\nto set the suitcase down. The station is ancient, vaultlike.\nBaggage lockers line the perimeter of the lobby and extend\noff into clumped rows within the wings of the station.\n\nCAROL APPROACHES THE TICKET WINDOW. She places the suitcase\nflush against the base of the counter and holds it tightly in\nplace with one leg. Carol pops open her purse... a clumsy\nitem in itself... as she lifts her wallet and the elderly\nticket-seller looks across to her.\n\n<b>                    CAROL\n</b>          Two day coach tickets -- on the Flyer.\n\n<b>                    TICKET-SELLER\n</b>          Thirty-four fifty-six with tax leaves in\n          forty-five minutes, gate three.\n\nCarol pays the tariff, places the tickets into her purse\nalong with the change. Wearily, she labors the satchel back\ninto her hand, then turns and begins to slowly walk down the\nseemingly acres-wide station promenade.\n\nNEAR A PORTICO WITHIN THE MAIN LOBBY, Carol sits\nuncomfortably on a shiny wooden bench -- the suitcase rests\non the floor pressed tightly between her ankles. She glances\nacross the promenade walls, her eyes finding:\n\n<b>A CLOCK READING: 9:40\n</b>\n<b>ON A LOBBY BENCH - LATER\n</b>\nCAROL STARES ACROSS THE ROOM at the scattering of passengers\nwaiting on the wooden seats opposite from her.\n\nCarol's nervous boredom increases; she looks down at her lap,\npretends to find something wrong with her nails and begins\nrubbing the cuticles. Carol finally rises impulsively from\nthe bench, immediately reaching for the brown leather\nsatchel.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                            51.\n</b><b>CONTINUED:\n</b>\n\nCAROL WALKS BACK DOWN THE PROMENADE while carrying   the\nsuitcase. As other baggage-laden passengers scurry   around\nher, she looks across the arcade, her eyes finding   a glass-\nwalled Cocktail Lounge. She hesitates, then begins   to trudge\nin that direction.\n\nA BANK OF LOCKERS STANDS NEAR THE COCKTAIL LOUNGE. As Carol\napproaches, an elderly WOMAN deposits a coin in one of the\nnumbered lockers, opens the metal door and places a small\nsuitcase inside. Closing and re-locking the door, the Woman\nquickly moves away. Having noted the woman and more than\ntired of hauling her burden around the station, Carol steps\nto the end locker, takes a quarter out of her purse, then\nstudies the time scarred operating instructions on the face\nof the locker. She slips the quarter into the slot and opens\nthe locker door. As Carol bends to pick up the suitcase, the\nlocker door swings closed... She tries to open it but the\ndoor has re-locked itself... Carol quite disgusted with her\npredicament, again sets the suitcase down and pulls a quarter\nout of her change purse. As she again reads the numbered\ndirections, a YOUNG MAN appears at her shoulder.\n\nTHE MAN IS A PROTOTYPE OF URBAN SLEAZINESS, Doberman Pinscher\nfeatures are broken by a weedybrown moustache, a cheap\ncorduroy suit is set off by an oddly matched bow tie. The\nMan's appearance suggests a kind of drug store dapperness.\n\n<b>                    DAPPER MAN\n</b>          Kind of tricky, isn't it?\n\nShe turns, startled by his sudden proximity. In one smooth\nmovement the Dapper Man plucks the quarter from Carol's hand,\ndeposits it in the slot and swings the locker door open.\nSetting the heavy suitcase inside, he closes the door, tests\nit to show that it\n\nhas been re-locked, then removes the key from the lock and\nputs it into Carol's hand. She is intimidated momentarily by\nthe Man's sudden appearance and forcefulness, as well as his\nintentions.\n\n<b>                       CAROL\n</b>          Thank you.\n\n<b>                    DAPPER MAN\n</b>              (toothy grin)\n          No trouble lady.\n\nStepping backward, his canine features disappear into a\nwelter of station activity. Carol watches his receding figure\nfor a moment, then simultaneously placing the key into her\npurse, she turns and begins moving towards the Cocktail\nLounge.\n<b>\n</b><b>                                                            52.\n</b>\n\n\n<b>INT. BARN - DAY\n</b>\n<b>EMPTY CAGES STACKED ALONG A WOODEN WALL\n</b>\nA YOUNG KITTEN IN A CARDBOARD BOX wrestling with the barrel\nof a .44. A thick veined hand gently rubs the gun over the\nfur along the cat's neck and backbone.\n\nRUDY BUTLER IS PREOCCUPIED WITH THE CAT, giving little\nattention to the thirtyish Man standing nearby.\n\nHAROLD CLINTON puts away a large syringe then snaps shut the\nmedical bag. Rudy lies across a cot in one corner of the barn-\nlike Animal Hospital. The large room is lined with stalls,\ncages and pens, many of them vacant.\n\nThe wonded criminal is bare-chested. A plaster cast has been\nattached to his left arm and shoulder.\n\nFRAN CLINTON SITS ON A HIGH WOODEN STOOL opposite   Rudy. Five\nyears younger than her husband, tight sweater and   skirt,\nbright scarlet fingernail polish, well-built, her   face\nsuggests sensuality. Fran's bare, milk-white legs   are crossed\nunder her rumpled skirt.\n\n<b>                    RUDY\n</b>              (to Harold)\n          What's the damage?\n\n<b>                    HAROLD\n</b>          Collar bone is broken. No infection\n          yet... the bandages should be changed\n          twice a day.\n\n<b>                    RUDY\n</b>          I got a nurse in mind.\n\n<b>                    HAROLD\n</b>              (going along, oblivious to the\n               implication)\n          The glucose will begin working in half an\n          hour. You'll feel better then...\n\n<b>                     RUDY\n</b>              (flashing a grin despite the\n               pain)\n          The three of us are going to do some\n          traveling. We're going to take your car\n          to El Paso.\n\n<b>                    HAROLD\n</b>          That's not possible. We can't leave\n          here... we've got all this.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                           53.\n</b><b>CONTINUED:\n</b>\n\nRudy smiles at Mrs. Clinton. He's never met Fran before, but\nhe's known her for years.\n\n<b>                    RUDY\n</b>          Is it possible, Mrs. Clinton?\n\n<b>                    FRAN\n</b>              (scared, but trying to be\n               friendly)\n          Just... tell us what you want.\n\nRudy looks back down at the gun and cat. The following\nsilence is like a scream. Finally:\n\n<b>                    RUDY\n</b>          What kind of car do you have, Harold?\n\n<b>                    FRAN\n</b>              (cutting in)\n          A Ford... We have a Ford.\n\n<b>                    RUDY\n</b>          That's good. That's very good. Now\n          Harold, you go out and gas up the Ford,\n          check the oil and tires, we don't want\n          any problems on the road. One more\n          thing... If anybody but you comes back...\n\nHe points the gun at Mrs. Clinton.\n\n<b>                    RUDY (CONT'D)\n</b>              (continuing)\n          She gets her clock fixed right away...\n          You understand that, Harold?\n\nA long pause.\n\n<b>                    FRAN\n</b>          You do what he says, Harold.\n\n<b>                    RUDY\n</b>          After you come back I'll listen while you\n          make some phone calls, tell a few friends\n          you've got to leave for a week or two...\n          You have to call another Vet about the\n          animals. You tell him to come over and\n          take good care of them starting\n          tomorrow... no slip-ups on that. They got\n          to be looked after...\n\n<b>                    HAROLD\n</b>          We really don't have too many friends.\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                             54.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    FRAN\n</b>          They don't think he married well.\n\n<b>                    RUDY\n</b>              (smiling)\n          That makes things a little easier for us\n          then, doesn't it?\n\n<b>INT. TRAINS STATION BAR - DAY\n</b>\nCarol sits in the bar. A young SOLDIER approaches and sits\ndown at the counter next to her. She is finishing a vodka\ngimlet.\n\n<b>                    SOLDIER\n</b>              (to a bartender)\n          Beer.\n\nCarol glances at her watch.\n\n<b>                    SOLDIER (CONT'D)\n</b>              (continuing - begins with the\n               obvious)\n          Guess you have to catch a train?\n\n<b>                    THE SOLDIER\n</b>          pink-cheeked and freckle-faced, he has to\n          shave maybe twice a week; twenty-one\n          years old, not good-looking (his best\n          feature is his gentle, easy grin) and not\n          a hustler. He just wats to meet a girl.\n\n<b>                    CAROL\n</b>              (not too patronizing)\n          That's right.\n\n<b>                    SOLDIER\n</b>          Me, too. Got twenty-four days of furlough\n          and I'm goin' home.\n\nThe soldier's beer arrives.\n\n<b>                    CAROL\n</b>          Where's home?\n\n<b>                    SOLDIER\n</b>          Utah, the Bee-Hive state. I'm from Orem,\n          right near Salt Lake ... Say, you\n          wouldn't happen to be a Mormon, would\n          you?\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                          55.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>              (chuckles)\n          No, I'm not.\n\n<b>                    SOLDIER\n</b>          Me, neither. There's about twelve people\n          in the state that aren't Mormons and I'm\n          one of them.\n\n<b>                     CAROL\n</b>          That certainly makes you kind of\n          special...\n\n<b>                    SOLDIER\n</b>              (awkward)\n          Yeah... I guess it does.\n\nCarol pushes aside her glass.\n\n<b>                    SOLDIER (CONT'D)\n</b>              (c ont inuing)\n          You wouldn't be taking the train to Salt\n          Lake, would you?\n\n<b>                    CAROL\n</b>              (smiles across to him)\n          No, I'm afraid not.\n\n<b>                    SOLDIER\n</b>          I never have any luck.\n\nCarol smiles at the soldier. Her features suddenly freeze as\nshe glances toward the entrance to the bar.\n\n<b>AT THE DOORWAY\n</b>\nDOC STANDS LOOKING AT CAROL and the soldier.\n\n<b>                    CAROL\n</b><b>          STANDS AND PAUSES FOR A MOMENT.\n</b>\n<b>                    CAROL (CONT'D)\n</b>          I really hope you have a nice trip.\n\n<b>                    SOLDIER\n</b>          Thanks. I hope yours is okay, too.\n\nCarol moves towards the exit.\n\nThe soldier quietly sips his beer, his face a bit grim.\n\n<b>AT THE DOORWAY\n</b><b>\n</b><b>                                                             56.\n</b>\n\n\n<b>CAROL STOPS NEAR DOC.\n</b>\nThey look at each other...\n\n<b>                    DOC\n</b>          Where's the suitcase?\n\nCarol continues looking at Doc for a moment.\n\nThen, suddenly moves past him, leading him out into the main\nlobby.\n\n<b>                                       BACK WITHIN THE PROMENADE\n</b>\n<b>SERIES OF ANGLES\n</b>\nCAROL EMERGES FROM THE COCKTAIL LOUNGE followed by Doc.\n\nThey cross to the lockers.\n\nShe retrieves the key from her purse and thrusts it into the\nproper slot. It doesn't turn. Puzzled she tries again, then\nforcing the key, shakes the lock violently.\n\nHer eyes widening into a quiet panic, she next looks at the\nlocker number and then the number on the key. Her features\nare now totally ashen.\n\nShe walks up the bank of lockers... puts the key in another\nlocker, the door opens, the compartment is empty.\n\nCarol turns away from the locker, eyes glazed with fear...\nDoc at her shoulder.\n\n<b>                    CAROL\n</b>          A man helped me open it...\n\n<b>                    DOC\n</b>              (deceptive calm)\n          And switched keys.\n\n<b>                    CAROL\n</b>          He must have.\n\n<b>                    DOC\n</b>              (angrily)\n          It isn't another boyfriend, is it?\n\nCarol winces, containing her anger.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing - icily)\n          How long ago.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                            57.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>          Fifteen minutes.\n\n<b>                    DOC\n</b>          Sure?\n\nCarol nods.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing - with quick\n               calculation)\n          He'd figure you for longer, enough time\n          to try another hit. He's probably still\n          in the station.\n\nAs Doc pushes Carol forward.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing - lashing out)\n          There better be a guy with the\n\n<b>                    CAROL\n</b>              (lashing back)\n          You bastard...\n\nWalking at a rapid pace, they start through the station, Doc\nforcing their speed, clutching Carol under her elbow. They\nreach the main concourse after moving down the length of the\npromenade... eyes straining.\n\nCAROL STOPS SUDDENLY. SHE STARES DOWN THE LONG CORRIDOR her\neyes finding the thief. He stands near another bank of\nlockers, the black suitcase at his feet.\n\nTHE THIEF LOOKS UP AT CAROL - virtually within the same\nmoment that she spots him. His expression never changes. He\ntakes a step towards her, smiling... Then, with a movement\nthat is both abrupt and casual, he snatches up the money bag\nand disappears behind the constant traffic of train patrons.\n\nDOC HAS SEEN THE THIEF. Recognizing the suitcase he moves\nimmediately after him. Carol follows Doc but is unable to\nkeep up. She watches as Doc vanishes behind the row of\nlockers.\n\nCAROL ROUNDS THE LAST LOCKER IN THE ROW but both men have now\ndisappeared from view. She sags back against the edge of the\nmetal compartments, exhausted, fearful.\n\n<b>                    LOUDSPEAKER VOICE\n</b>              (indistinct above the roar of\n               the station)\n          Attention please.\n<b>                    (MORE)\n</b><b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                             58.\n</b><b>CONTINUED: (2)\n</b><b>                    LOUDSPEAKER VOICE (CONT'D)\n</b>          The Flyer now boarding at gate three. The\n          Flyer now boarding at gate three.\n\nCarol again raises her eyes. Still breathless, her face glows\nwith moisture.\n\n<b>INT. THE CLINTON'S BARN - (MORNING)\n</b>\nFRAN IS STILL SEATED ON THE STOOL. Rudy stares at her from\nthe cot. Harold is now absent.\n\n<b>                    FRAN\n</b>          I don't think you have to worry much\n          about Harold. He won't do anything.\n\n<b>                    RUDY\n</b>              (he speaks very politely)\n          That right?\n\n<b>                    FRAN\n</b>          You can trust him...\n\n<b>                    RUDY\n</b>          How long have you been married?\n\n<b>                       FRAN\n</b>          Two years.\n\n<b>                    RUDY\n</b>          Can he trust you?\n\n<b>                    FRAN\n</b>              (smiles)\n          That's what matters, isn't it?\n\nRudy continues looking at her.\n\n<b>                    RUDY\n</b>          Come over here a minute...\n\nHe gestures with his gun. Fran crosses the distance slowly,\nmoving with apprehension.\n\n<b>                     FRAN\n</b>          Look, I'm not going to be any trouble to\n          you either, fact is, this may sound\n          funny, but maybe you and I could be close\n          friends...\n\nRudy gestures her closer...\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             59.\n</b><b>CONTINUED:\n</b>\n\n<b>                    FRAN (CONT'D)\n</b>              (continuing)\n          You don't always have to have your gun\n          out. I'll get whatever you want. Really,\n          I will...\n\nFran smiles. She is now standing over the cot, looking\ndirectly down at Rudy. He jerks her down.\n\n<b>                    RUDY\n</b>              (still polite)\n          Get rid of that nail polish, I don't like\n          it, and when I tell you to come over here\n          you move fast. You and I are going to get\n          along because I've known a lot of people\n          like you, so don't tell me about it\n          because I got your ticket going in. Now\n          get up and get that paint of your\n          fingers... okay?\n\nRudy smiles.\n\n<b>INT. TRAIN STATION - A SERIES OF ANGLES - DAY\n</b>\nDOC MOVING LIKE A GUN DOG ON THE HUNT between the rows of\nlockers; catching sight of the thief momentarily, he closes\nin.\n\nAfter a series of criss-crossed movements among the banked\nlocker corriders, Doc again loses sight of the thief as the\nslender criminal dodges off onto a main passenger concourse.\nDoc is faster and more agile than the thief, but the station\nis unfamiliar territory to him. Both Doc and the Thief move\ncarefully, they must not arouse enough attention to make\nthemselves conspicuous, thus risking police interference.\n\nTHE THIEF HURRIES ALONG THE MAIN CONCOURSE weaving between\nthe incoming and departing passengers that dot the long\ncorridor.\n\nDOC IN PURSUIT DOWN THE CONCOURSE, he passes several sealed\noff departure/arrival gates.\n\nTHE THIEF STEPS OFF THE CONCOURSE INTO GATE THREE, an open\nstairway winding downward.\n\nDOC FOLLOWS HIS QUARRY DOWN THE STAIRWAY to the train area\nwhere he immediately skips over the winding ramp and onto the\nloading platform. Emerging from the short tunnel, Doc isn't\nsurprised that the Thief is again nowhere in sight. Doc steps\nbehind a pillar -- he waits watchfully... After a moment or\ntwo, the Thief edges out from behind another column and\nstarts back up the platform towards the concourse.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             60.\n</b><b>CONTINUED:\n</b>\nDoc moves quickly to intercept his opponent but, as the Thief\nspots his approach, he turns and Joins several passengers\nscurrying toward the awaiting train...\n\nTHE FLYER STANDS GLEAMING AT TRACKSIDE, perpendicular to the\nboarding gate. Two doors to the train stand open, one in the\npullman section, the other entrance admitting day coach\npassengers.\n\nCAROL - ON THE MAIN CONCOURSE - MOVING ALONG WITH THE FLOW of\nabout-to-depart passengers... the Flyer comes into sight,\nvisible on the next level below.\n\nTHE CONDUCTOR - AT TRACKSIDE - STANDS SMILING BROADLY by the\ncoach entrance. He grins at the boarding PASSENGERS as he\nspeaks to a nearby BRAKEMAN. The Thief skirts around a\nbaggage-laden elderly COUPLE and moves up the two-step and\ninto the rail car passageway.\n\nDOC MOVING QUICKLY AGAIN. He sees the Thief slip past the\nconductor and into the train.\n\nTHE THIEF IS NOW INSIDE THE DAY COACH. He heads toward the\nforward compartments.\n\nDOC EXPERTLY SQUIRMS THROUGH THE BOARDING THRONG and\ndisappears past the conductor up into the passenger car\nvestibule.\n\n<b>ON THE CONCOURSE\n</b>\nCAROL WATCHES AS A BLONDISH MAN in a grey suit skips aboard\nthe Flyer standing below. She is unable to get a clear look\nat the man, and is unsure as to whether or not it was Doc.\nShe hesitates, then moves forward to Gate Three which will\ntake her down to trackside...\n\nCarol stands at the edge of the gate -- the last of the crowd\nhaving already passed through. She hesitates again, staring\ndown at the shining train.\n\n<b>INT. FLYER - DAY COACH\n</b>\nTHE AISLE IS CLOGGED WITH PASSENGERS. People hesitate over\ntheir selection of seats, put baggage into overhead racks,\nclumsily remove their overcoats... The Thief continues to\nmove forward, squirming around the passengers at a hurried\nbut controlled pace.\n<b>\n</b><b>                                                             61.\n</b>\n\n\n<b>AT THE END OF A PULLMAN\n</b>\nDOC ENTERS, THREADING HIS WAY FORWARD, scanning faces. He is\none car behind the Thief and losing ground, due to the fact\nthat Doc must carefully note the occupants of each seat as he\npasses. Doc is further delayed by a WOMAN blocking the aisle.\nShe struggles painfully, trying to fit a suitcase into an\noverhead carriage.\n\nDoc, with the most forced of smiles, reaches up to help her.\n\n30? THE THIEF MOVES THROUGH ANOTHER VESTIBULE and into an 30?\nempty car -- now unobserved, he immediately breaks into a\nrun.\n\n<b>DOC LOOKING, MOVING NIMBLY INTO ANOTHER VESTIBULE AND CAR.\n</b>The passengers have become fewer and fewer as he nears the\nfront of the train.\n\n<b>THE THIEF RUNS THROUGH ANOTHER VESTIBULE AND INTO A SMOKER.\n</b>This car also deserted, he maintains his trotting pace,\nswinging the heavy suitcase as he goes... reaching the end of\nthe smoker, he enters the next vestibule and attempts to move\ninto the following car, but the Thief is brought to a halt by\nthe sudden dead end of the passageway. The next car holds\nonly baggage. He has reached furthest forward passenger car.\nThe Thief desperately tries to open the vestibule door,\nhoping to escape by jumping off the train, but the doors are\ntightly locked. He begins to retrace his steps.\n\nDOC MOVES CAREFULLY INTO THE NEXT CAR FORWARD, still\nunknowingly two cars behind the Thief.\n\n<b>THE THIEF PASSES BACK TO THE VESTIBULE AT THE REAR OF THE\n</b>SMOKER, his eye suddenly catching the Men's Lounge. He tries\nthe door -- locked. The Thief snaps out a pen knife, picks\nthe lock with a deft movement. Passengers are visible behind\nhim as he works, filtering into the pullman car following the\nsmoker. None of them notes his activity. The restroom door\nswings open.\n\n<b>INT. MEN'S LOUNGE\n</b>\nThe Thief immediately snaps the bolt-lock shut behind him,\ncrosses the small, murky room and tries to lift the window.\nHe strains mightily but the glass remains hopelessly\njammed...\n\nDOC ENTERS THE FINAL PASSENGER CAR, notes the half 313 dozen\ntravelers and continues moving forward, going next into the\nsmoker.\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                               62.\n</b><b>CONTINUED:\n</b>\n\nTHE SMOKING CAR IS EMPTY, although several Passengers and a\nPORTER enter it moments after Doc leads the way. Doc passes\nthrough the length of the car, moves into the vestibule and,\nlike the Thief a few moments before, finds his passage\nblocked by the baggage car. Doc hesitates, then turns and\nbegins going back in the opposite direction.\n\nDOC STOPS AT THE MEN'S LOUNGE -- staring hard at the door for\na moment. He tries the handle. The door remains firmly shut.\n\n<b>                       PORTER\n</b>                 (appearing suddenly at Doc's\n                  shoulder)\n             Be open five minutes out of the station.\n\nDoc nods and moves away, continuing to retrace his steps\ntoward his point of entrance onto the train.\n\nTHE THIEF, HAVING ABANDONED THE JAMMED WINDOW, is now undoing\nthe snaps and straps holding the suitcase closed. The lid\npulls upward and stacks of money appear under his hands. The\nThief grabs a money pad, runs his thumb over it, then shoves\nthe stack of greenbacks into his coat's inside breast pocket.\n\nDOC MOVES WITH DETERMINATION back through the passenger cars.\n\n<b>INT. MEN'S LOUNGE\n</b>\nTHE THIEF HAS AGAIN CLOSED THE SUITCASE. He nervously looks\nabout his tight-walled sanctuary, then crosses back to the\nwindow and stares out through a corner of the pane. He pulls\nthe shade lower.\n\n<b>EXT. TRACK\n</b>\nMETAL WHEELS GRIND AGAINST THE RAILS, the train SHUDDERS,\nthen begins to move forward.\n\nTHE THIEF IS WATCHING THROUGH THE MEN'S ROOM WINDOW as the\ntrain edges forward. His body suddenly tightens. He sees Doc\noutside the train, walking slowly between a narrow passage of\nmoving passenger cars and several parked tinders.\n\n<b>                       THIEF'S POV\n</b><b>             DOC GLANCING BETWEEN PARKED PASSENGER\n</b>             CARS, walking cautiously ahead. As the\n             Flyer continues to move slowly forward,\n             Doc disappears from view.\n\nTHE THIEF ALLOWS HIMSELF A QUICK SMILE. Turning away from the\nwindow he picks up the suitcase, unbolts the lock and steps\nback out into the vestibule.\n\n\n<b>                                                       (CONTINUED)\n</b><b>\n</b><b>                                                             63.\n</b><b>CONTINUED:\n</b>\n\nAT THE BACK OF THE SMOKER, the Thief seats himself next to a\nwindow and places the suitcase on the cushioned chair\nopposite from him. In the forward position of the car, well\nbehind the Thief's back, a dozen Passengers are scattered\nabout the lounge chairs. A Conductor appears at the end of\nthe smoker opposite the Thief and begins to collect and punch\ntickets.\n\nAs the train begins to pick up speed, the Thief lifts an\nabandoned copy of the newpaper off the cushion next to him.\nHe glances at the front page, then unfolds the width of the\npaper. As a precaution against regaining poverty, the Thief\nrests one foot against the suitcase. All seems secure. Then,\nDoc sits down next to the Thief.\n\n<b>DOC COMPANIONABLY SLIDES AN ARM BEHIND THE BACK OP THE\n</b>THIEF'S NECK, pulling him close.\n\n<b>                    DOC\n</b>              (softly almost gently)\n          When you pop a lock don't mark it.\n\nThe Thief's knife instantly flashes into his hand, but before\nhe can bring it into play, Doc catches his arms.\n\nTHE KNIFE IS TIGHTLY WEDGED INTO THE THIEF'S HAND. Doc's\nfingers are vise-like at his wrist.\n\nTHE OTHER PASSENGERS REMAIN PRE-OCCUPIED AT THE OTHER end of\nthe car, taking no note of the quiet encounter.\n\nTHE CONDUCTOR IS STILL AT THE OPPOSITE END OF THE CAR from\nDoc and the Thief. He continues collecting and punching\nfares.\n\n<b>INT. STATION GATE - DAY\n</b>\n<b>CAROL IS EXITING. THERE IS AN ANNOUNCEMENT OVER THE\n</b>\nLOUDSPEAKER -- the train has left.\n\n<b>INT. TRAIN - DAY\n</b>\nTHE CONDUCTOR AS SEEN BY THE THIEF'S WIDENING EYES. He\nmethodically punches the tickets, never looking more than two\nseats ahead.\n\nTHE THIEF'S EYES BULGE AS DOC CHOPS HIM ON THE WINDPIPE. The\nThief goes out. Is he dead?\n\n<b>DOC CHOPS HIM AGAIN. IF HE ISN'T DEAD HE LOOKS IT.\n</b>\nDoc pulls the Thief's hat down over his head.\n<b>\n</b><b>                                                            64.\n</b>\n\n\n<b>INT. STATION - DAY\n</b>\n<b>CAROL CROSSES INTO THE STATION, TAKES A DEEP BREATH.\n</b>\nSits... waiting. The soldier comes by, stops. She doesn't\nrecognize anything.\n\n<b>INT. TRAIN - DAY\n</b>\n<b>THE CONDUCTOR ARRIVES AT THE LOUNGE CHAIRS WHERE DOC AND THE\n</b>thief are seated. He stops in the aisleway, expectantly\nleaning in Doc's direction.\n\n<b>                     CONDUCTOR\n</b>          Tickets?\n\nAs Doc takes out his wallet, peels a fifty out and gives it\nto him.\n\n<b>                    DOC\n</b>          End of the line. Two.\n\n<b>                     CONDUCTOR\n</b>              (grumpily)\n          All right.\n\nThe conductor cuts the fare receipt and begins to make\nchange.\n\n<b>THE THIEF SITS FACING THE WINDOW LOOKING VERY DEAD\n</b>\n<b>INT. CLINTON'S FORD - DAY\n</b>\n<b>RUDY SITS IN THE BACK SEAT AS HAROLD CAUTIOUSLY MOTORS\n</b>\nDOWN the highway. With his one good arm, Rudy cares for the\nkitten resting in the cardboard box on the back seat.\n\n<b>                    RUDY\n</b>          Talk a little, Harold, loosen up... good\n          for you.\n\nHarold works his jaw, his grip tightens on the wheel.\n\n<b>                    FRAN\n</b>              (chuckling at Harold)\n          Something ought to loosen him up ... how\n          comes we're going to El Paso, Rudy?\n\n<b>                    RUDY\n</b>          I Just want to find a suitcase.\n<b>\n</b><b>                                                             65.\n</b>\n\n\n<b>INT. KITCHEN - BEYNON'S RANCH - DAY\n</b>\nBEYNON'S BODY REMAINS OUT OF SIGHT behind the overturned\nkitchen table... a small trickle of blood oozes out from\nunder one of the table legs.\n\nThe Accountant stands with Cully, Hayhoe and Swain staring\ndown at Beynon's body.\n\n<b>                    ACCOUNTANT\n</b>          They may still be going to Nogales.\n\n<b>                    SWAIN\n</b>          What about Laughlin in El Paso?\n\n<b>                    ACCOUNTANT\n</b>          Cover both, get someone down there...\n          either Rudy and McCoy's got half a\n          million.\n\n<b>                    SWAIN\n</b>          They've got to switch cars.\n\n<b>                    ACCOUNTANT\n</b>          Put out the word.\n\n<b>                    HAYHOE\n</b>              (looking back at Beynon)\n          What about Jack?\n\n<b>                    ACCOUNTANT\n</b>          Tonight... take him out in the country,\n          throw him down a dry well, if you can\n          find one.\n\n<b>INT. PULLMAN CAR - DAY\n</b>\nAS DOC THUMBS IDLY THROUGH THE NEWSPAPER. He is suddenly\nshowered with spurting water. He lowers the paper and looks\nto the aisle, seeing:\n\nA SEVEN YEAR OLD BLACK PANTHER, dressed appropriately and\nholding a water pistol.\n\n<b>                    KID\n</b>          Stick 'em up!\n\nDoc looks at the brat.\n\n<b>                    KID (CONT'D)\n</b>              (continuing)\n          I'm gonna shoot you...\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                            66.\n</b><b>CONTINUED:\n</b>\n\nHe squeezes the pistol's trigger, two bursts of water land on\nDoc's shirt front. Doc continues staring at the boy. The kid\nlooks hard at Doc, not giving an inch.\n\n<b>                    DOC\n</b>          Come here a second...\n\nDoc takes the boy's arm, gently pulls him closer.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing)\n          Look, I'm sure you're a nice kid and that\n          your mother's nearby...\n\nNow you better get back to her real quick or I'm going to\nbreak your little arm... okay?\n\nDoc releases the boy. The kid looks at Doc for a moment then\nbursts into tears and retreats at a dead run back down the\npassenger car aisleway. Doc again lifts the paper, turning to\nthe sports page.\n\n<b>INT. STATION - DAY\n</b>\n<b>CAROL WAITS IN THE STATION. (A SERIES OP ANGLES AND\n</b><b>DISSOLVES)\n</b>\n<b>INT. PULLMAN - DAY\n</b>\nDOC LIFTS THE SUITCASE AS THE CONDUCTOR APPEARS at the\nvestibule at the opposite end of the car and announces the\nnext stop. Doc prepares to get off. The passenger car remains\nsparsely populated. No one occupies the seats near the\ncorpse.\n\n<b>EXT. FIRST TRAIN CONCOURSE - SERIES OF ANGLES AND DISSOLVES -\n</b><b>EARLY MORNING\n</b>\nCAROL SITS WATCHING THE PEOPLE -- she gets up, doesn't know\nwhere to go... sits down again... fear and anticipation on\nher face... stands up... ready to go where? Ready to sit down\nagain, she looks up.\n\nDOC CROSSES SLOWLY TO HER CARRYING THE SUITCASE. Carol\nreacts... pleased to see him... pleased that he's back...\nuntil.\n\n<b>                    DOC\n</b>              (steely)\n          Your kind of mistakes are going to land\n          me back in Huntsville.\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                          67.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>              (nailing him)\n          I wouldn't worry Doc. I can always get\n          you out... I'll screw every prison\n          official in Texas if I have to.\n\n<b>                    DOC\n</b>          Texas is a big state.\n\n<b>                    CAROL\n</b>          I can handle it.\n\n<b>                    DOC\n</b>          I'll bet you can.\n\n<b>                     CAROL\n</b>          You'd do the same for me, wouldn't you,\n          Doc?\n               (rising tone)\n          If I was caught, wouldn't you?\n\nDoc is silent. After a long pause.\n\n<b>                     CAROL (CONT'D)\n</b>              (continuing - quietly)\n          When we had trouble before it was\n          different.\n\n<b>                    DOC\n</b>              (nodding)\n          You don't like the way things are, I\n          don't like the way things\n\n<b>                    CAROL\n</b>          What do you want to do?\n\n<b>                    DOC\n</b>          Maybe we should split up... I'll cut the\n          money with you.\n\n<b>                    CAROL\n</b>          Do you mean that?\n\n<b>                       DOC\n</b>          I mean it.\n\nA long pause. Maybe she wonders; what if he is lying but what\nif he isn't? Temptation? She makes up her mind.\n\n<b>                    CAROL\n</b>          No... I don't want to leave.\n<b>\n</b><b>                                                           68.\n</b>\n\n\n<b>INT. PASSENGER TRAIN - EARLY EVENING\n</b>\nDOC AND CAROL WATCH THROUGH THE DOUBLE WINDOWS AS THE train\nyard lights of a town go strobing by.\n\n<b>EXT. SECOND TRAIN CONCOURSE.\n</b>\nDOC AND CAROL COME DOWN OUT OF THE GANGWAY OF ANOTHER train\nand turn up the pavement toward the main part of the depot.\nDoc continues holding the suitcase as they walk.\n\n<b>                    DOC\n</b>          We'll grab a room for tonight then you go\n          out tomorrow and buy yourself some new\n          clothes, pick some up for me... Grab some\n          food now, paper bag it, we eat in the\n          room.\n\n<b>                    CAROL\n</b>              (cutting in)\n          You've got all the answers. What about\n          when they find the body on the train?\n\n<b>                    DOC\n</b>          When they find it, they find it.\n\nTo the cops a description's only good if there's a channel\nfor it, and there's no connection between that stiff and the\nrobbery.\n\n<b>                    CAROL\n</b>          You've got it all figured.\n\n<b>                    DOC\n</b>              (looking at Carol and thinking\n               about Beynon)\n          No... there's a couple of things I'm\n          still working on.\n\n<b>                       CAROL\n</b>          Like what?\n\nBut Doc doesn't answer.\n\n<b>INT. TRANSIT HOTEL - NIGHT\n</b>\nDOC LIES NEXT TO CAROL. Carol is eating a hamburger wrapped\nin wax paper. She passes one over to Doc along with some\ngreasy french fries and a couple of napkins .\n\nThe Suitcase has been placed on the small writing desk across\nthe room. Doc silently munches his hamburger.\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                             69.\n</b><b>CONTINUED:\n</b>\n\nDoc glances at the poster rolled up. Carol hasn't put it up\non the wall yet.\n\n<b>                                                         CUT TO:\n</b>\n<b>INT. FIRST TRAIN - NIGHT\n</b>\nTHE TRAIN GOES CLICKETY CLICK THROUGH THE NIGHT, the young\npanther is stalking and prowling among the sleeping\npassengers. His Mother catches him, takes him back to his\nseat.\n\n<b>INT. TRANSIT HOTEL - NIGHT\n</b>\n<b>CAROL IS BUSY UNBANDING THE MONEY PADS. A LARGE STACK OF\n</b>discarded wrappers have been placed in a metal trash can near\nher leg. Behind her, Doc, now in his undershirt, reads a\nTexas newspaper.\n\nCAROL CONTINUES TO LOOSEN THE GREENBACKS. She is surrounded\non the double bed by stacks of money. She lights a match,\ndrops it into the wastebasket. The money bands quickly burst\ninto flames, consume themselves, then die back into crinkly\nashes.\n\n<b>                    DOC\n</b>              (not looking up)\n          There may be a hunting party.\n\n<b>                    CAROL\n</b>          Why, there's nothing on the news?\n\n<b>                    DOC\n</b>          I didn't mean police.\n\nHe continues thinking. Carol watches him for a moment.\n\n<b>                    CAROL\n</b>          Tell me about it.\n\nDoc looks across at her.\n\n<b>                    DOC\n</b>              (calmly)\n          Loredo is out. I've been thinking about\n          Rudy. If he was on his own, we're okay.\n          If Beynon bought him out...\n\nDoc looks at her.\n\n<b>                    CAROL\n</b>          What?\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                             70.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>          If Beynon bought him out, and he talked\n          then maybe Beynon's boys will be waiting\n          for us in El Paso.\n\nRudy knew about Laughlins.\n\n<b>                    CAROL\n</b>          You're full of ifs.\n\n<b>                    DOC\n</b>          I think you liked it with him.\n\nI think he got to you.\n\n<b>                    CAROL\n</b>          Maybe. At least I got to him.\n              (pause)\n          Where do we go from here?\n\n<b>                     DOC\n</b>          El Paso.\n\n<b>INT. FIRST TRAIN - NIGHT\n</b>\n<b>A WATER PISTOL APPEARS AROUND THE CORNER   OF AN EMPTY\n</b>PASSENGER CHAIR. The seven year old brat   squeezes off several\nplumes of water. The Thief is hit by the   gun's spray, water\nruns slowly down his ear and the back of   his neck.\n\n<b>                     KID\n</b>          Bang!\n\nTHE BOY WATCHES THE IMMOBILE MAN. He fires again, once again\nthere is no reaction. The brat steps forward... smiling, he\npushes the thief's arm, pushes harder.\n\nTHE THIEF'S BODY SUDDENLY FALLS BACK ACROSS THE CHAIR. His\neyes roll upward... staring at the panther. His neck is\nbruised, he pushes his hat back slowly.\n\n<b>                    THIEF\n</b>              (very hoarsely)\n          Get me a doctor.\n\n<b>INT. HOTEL ROOM - NIGHT\n</b>\nCAROL SLEEPS ON HER STOMACH, her head resting across one arm.\nDoc lies beside her, eyes open. He looks over at Carol a\nmoment, noting the long strands of hair that move\nrhythmically back and forth from her gentle breathing. After\na moment Doc quietly stands, moves to the writing table and\nstares at the black suitcase.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                          71.\n</b><b>CONTINUED:\n</b>\nHe opens the valise and lifts the large stack of greenbacks\ninto a shaft of light coming through a crack in the drawn\nshade. Still holding the money, Doc looks back at Carol.\n\n<b>ONE LAST TIGHTLY BOUND MONEY PAD - NIGHT\n</b>\nPrinted clearly on the brown wrapper.\n\n<b>FIRST BANK OF BEACON CITY\n</b>\n<b>BEACON CITY\n</b>\n<b>COMMONWEALTH OF TEXAS\n</b>\n<b>INT. POLICE STATION - NIGHT\n</b>\nA PLAINCLOTHES OFFICER HOLDS A SIMILAR MONEY PAD with his\nhandkerchief. The Panther is sitting with his mother on a\nnearby seat. Still dressed in his panther suit, but no longer\na brat. His face reflects both fear and shock.\n\n<b>THE THIEF IS WITH THEM, BANDAGED AROUND THE THROAT\n</b>\n<b>                    PLAINCLOTHES OFFICER\n</b>              (to the Thief)\n          Where did you get it?\n\n<b>                    THIEF\n</b>              (hoarsely)\n          It was a gift.\n\n<b>INT. BEDROOM - MORNING\n</b>\nCAROL COMES IN. SHE IS WEARING A NEW SUIT, SANDALS It looks\ngreat... She tosses a package on the bed.\n\nDoc looks at her outfit and opens his. They are too flashy.\n\n<b>                    DOC\n</b>          Thanks.\n              (as Carol starts to speak)\n          You look great, just great...\n\nThey could pick you up for soliciting in ten minutes.\n\n<b>                    CAROL\n</b>          That would be the first time.\n\n<b>                    DOC\n</b>              (angry)\n          When are you going to learn?\n\n<b>                    CAROL\n</b>          I did I killed a man.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             72.\n</b><b>CONTINUED:\n</b>\n\nDoc throws his clothes away.\n\n<b>                    DOC\n</b>              (laughing)\n          And that could be all for you., baby.\n\nCarol suddenly angered slaps him.\n\nDoc immediately delivers her a stinging blow.\n\nCarol hits the wall then stands stunned as he quietly ties\nhis laces and pulls on his jacket. Doc stuffs the Colt .45\ninto the flapped outside pocket along with 2 clips. He turns\nto the bed and picks up the suitcase.\n\nCarol continues looking at Doc.\n\n<b>                    DOC (CONT'D)\n</b>          Now you learn3 this time it could be the\n          chair for both of us.\n\nCarol starts to speak.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing)\n          From now on you just shut up and do as\n          you're told.\n\n<b>                    CAROL\n</b>          If I hadn't killed Beynon., you would\n          have.\n\nDoc doesn't answer. He turns and exits. She follows.\n\n<b>INT. POLICE STATION - MORNING\n</b>\n<b>THE CONDUCTOR, THE THIEF AND THE PANTHER STUDY THREE TELEX\n</b><b>PICTURES OF MEN LOOKING SOMETHING LIKE DOC.\n</b>\nPrinted at one side of the photographs are their criminal\nrecords.\n\n<b>THE SENIOR DETECTIVE AND THE TWO PLAINCLOTHES\n</b>\nOFFICERS are seated within the Communication room of the\ndepartment. The transcriber comes to life as the cylinder\nreceiver begins to turn.\n\n<b>THE CYLINDER RECEIVER - ANGLES\n</b>\nTHE CYLINDER NOW REVEALS DOC MeCOY'S FACE.\n<b>\n</b><b>                                                           73.\n</b>\n\n\n<b>CONDUCTOR, MOTHER AND SON AND THIEF\n</b>\nYes, that's him. No question about it. That's him.\n\n<b>                    DETECTIVE\n</b>              (pointing to the thief)\n          How about him?\n\n<b>                    THIEF\n</b>              (hoarsely)\n          Listen, I'm a friend of the Court.\n\n<b>                    DETECTIVE\n</b>          You are here because you're under arrest.\n\n<b>A TRANSISTOR RADIO - MORNING\n</b>\nON A BEDSTAND. THE FREQUENCY HAND INDICATOR GLOWS with a\nyellow light.\n\n<b>                    RADIO\n</b>          ... The man has been positively\n          identified as Carter Doc\" McCoy, only\n          recently paroled from a penitentiary\n          where he was serving time for armed\n          robbery. He is believed to be travelling\n          with his wife, Carol Ainsley McCoy...\n              (ad libs)\n\n<b>INT. AUTO COURT MOTEL - MORNING\n</b>\nRUDY REACHES OVER TO THE NIGHTSTAND AND SHUTS OFF the radio.\nHis eyes stare vacantly ahead for a moment.\n\nHAROLD CLINTON IS TIED SECURELY INTO A CHAIR, his mouth\ntightly gagged.\n\nRUDY BEGINS TO SMILE. FRAN IS NEXT TO RUDY WITHIN THE bed,\nwearing only a bra, sleeping, one arm wrapped around Rudy's\nmiddle.\n\n<b>                    RUDY\n</b>          How you doing over there, Harold? You\n          sleep okay last night? Good. I'm glad to\n          hear it. Did you listen to the news? That\n          means we don't have to drive so hard\n          today, Harold... we're gonna be\n          travelling a lot faster than they are...\n          We got a lot more time than I figured.\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                          74.\n</b><b>CONTINUED:\n</b>\n\nRudy continues smiling. He pulls the sheet away from Frank,\nthen allows his hand to reach down, cupping her breast from\ninside the bra. Fran half awakens, pulls herself closer to\nRudy.\n\n<b>INT. ACCOUNTANT'S OFFICE - DAY\n</b>\nHAYHOE, THE ACCOUNTANT and the rest of the boys are sitting\nin the office waiting.\n\n<b>INT. CAR - DAY\n</b>\nRUDY IS DRIVING NOW, Fran and Harold are not speaking.\n\n<b>INT. CAR - DAY\n</b>\nDOC AND CAROL. DOC IS DRIVING. They are also silent.\n\n<b>INT. LAUGHLIN HOTEL - EL PASO - MORNING\n</b>\nCANNON (one of the Accountant's boys, whom we have not seen\nbefore) ENTERS THE DARK NEARLY DESERTED LOBBY and approaches\nthe reception desk. The large room is populated by\noverstuffed and threadbare furniture.\n\nLAUGHLIN looks very much like Dub Taylor and speaks Spanish\njust about as badly. He flashes a quick grin from behind the\ncounter as Cannon draws near. At the switchboard behind\nLaughlin, CARMEN, maybe 35, sits next to the telephone jacks\n(all of them idle) readinc a movie magazine.\n\n<b>                    CANNON\n</b>          You Laughlin?\n\n<b>                    LAUGHLIN\n</b>              (Mr. Friendly)\n          Yes, sir, and that's my wife and that's\n          Junior.\n\nLaughlin indicates a seventeen year old BELLBOY sleeping in\none of the overstuffed chairs.\n\n<b>                    CANNON\n</b>          Congratulations. I need a room.\n\n<b>                    LAUGHLIN\n</b>          No trouble. You came to the right place,\n          one thing we got is a lot of rooms. What\n          else can I do for you?\n<b>\n</b><b>                                                             75.\n</b>\n\n\n<b>INT. DOC AND CAROL'S CAR - DAY\n</b>\nAS IT MOTORS DOWN THE TEXAS HIGHWAY. The black suitcase is\npropped up between Doc and Carol in the front seat. Doc,\nseated on the passenger side, bangs the car radio with his\nhand. The radio is obviously not working as he turns the\ndials and pushes the buttons.\n\n<b>                    DOC\n</b>              (cajoling it)\n          C'mon workl I\n              (almost pleading)\n          C'mon.\n\nWe hear garbled words for a moment, pleasing Doc... and then\nthe radio conks out again. This time Doc hits the radio hard.\n\n<b>                    DOC (CONT'D)\n</b>              (angrily to the radio)\n          Give me the news!!\n\nWhen it is clear that the radio won't work:\n\n<b>                    DOC (CONT'D)\n</b>          You can't trust anything these days.\n\n<b>                    CAROL\n</b>          I'll tell you something, Doc. One day\n          you're going to have to trust somebody...\n\nDOC SLAMS THE BRAKE, GRABS THE WHEEL as the car veers over to\nthe side of the road.\n\n<b>                     DOC\n</b>          I trust...\n              (he opens the black suitcase)\n          Want to see what I trust... In God we\n          trust...\n              (he pulls out a bill and points\n               at it)\n          The word's on every bill!!!\n\n<b>                    CAROL\n</b>              (slamming the suitcase closed)\n          You keep it up and it won't matter how\n          far we get away, because it's going to be\n          all over between you and me. Do you\n          understand that? There won't be anything\n          left.\n\nShe starts the car up again, and continues driving, her\nknuckles tightening around the steering wheel.\n<b>\n</b><b>                                                          76.\n</b>\n\n\n<b>INT. CLINTON'S FORD - ANGLES - DAY\n</b>\n<b>AS IT LEISURELY MOVES ALONG THE ROADWAY BORDERED BY MILES OF\n</b>SAGEBRUSH. Harold drives, Fran is again in the front seat\nbeside her husband... a scrunched up sack of food beside her.\nShe wipes her mouth with a napkin, shoves it inside the paper\nbag, then turns to watch the passing scenery. Rudy sits in\nthe back, eating spareribs. He suddenly throws a just\nfinished bone at Fran, hitting her on the shoulder.\n\n<b>                    RUDY\n</b>          Have a bone, baby.\n\nHe throws another sparerib at Fran.\n\n<b>                    FRAN\n</b>              (shouts)\n          Oh, Christ, you wrecked my blouse.\n\nGod damn it, Rudy, what did you do that for? Jesus.\n\n<b>                     RUDY\n</b>              (laughing)\n          I'll tell you why I did it... it makes me\n          feel good.\n\nHe laughs and again throws another bone at Fran. She suddenly\ncatches his mood and begins laughing herself ... tossing a\nbone back at Rudy.\n\nHAROLD CONTINUES DRIVING. His knuckles whiten around the\nsteering wheel as a sparerib bounces off the window in front\nof him.\n\nTHE KITTEN IS SLEEPING WITHIN the cardboard box, oblivious to\nRudy and Fran's laughter. (That will be the day.)\n\n<b>EXT. SMALL TEXAS TOWN - DAY\n</b>\nTHE CHEVY MOVES ALONG with the light mid-day traffic, passing\nvarious roadside business establishments, then pulls up\nbefore a radio/TV repair and sales shop.\n\n<b>INT. RADIO/TV STORE - DAY\n</b>\nALL THE LATEST MODEL RADIOS are stacked on shelves around the\nsmall room... a television display featuring several models\nis in one corner of the shop. Another TV is playing near the\ncounter and the PROPRIETOR'S desk.\n\n<b>                    DOC\n</b>          A portable.\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                            77.\n</b><b>CONTINUED:\n</b>\n\n<b>                    PROPRIETOR\n</b>          Transistor?\n\n<b>                    DOC\n</b>          Yeah.\n\nThe Proprietor moves to a shelf.\n\nTHE SCREEN. As Doc's picture suddenly flashes onto the tube,\nwith appropriate dialogue.\n\nDOC STARING AT THE TELEVISION, then he quickly reaches over\nand snaps the set off.\n\nTHE PROPRIETOR BRINGS OUT SOME RADIOS, seemingly oblivious to\nDoc's action.\n\n<b>                    PROPRIETOR\n</b>          15 to 55 dollars -- take your pick.\n\nDOC TURNS, then looks at the corner of the small shop.\n\nALL THE TELEVISION SETS have Doc's picture on them.\n\nDOC TURNS BACK TO THE PROPRIETOR -- the man is looking at him\nnot at the sets.\n\n<b>                    DOC\n</b>              (paying)\n          Fifty --\n\nTaking a set, he exits.\n\n<b>                    PROPRIETOR\n</b>          You have change.\n\nBut he doesn't answer.\n\n<b>INT. CAR - DAY\n</b>\nCAROL TURNS AS DOC STICKS HIS HEAD through the open door,\nhands her the set.\n\n<b>                    DOC\n</b>          We got trouble. Let's take a walk.\n\nDOC AND CAROL WALKING UP THE SIDEWALK OP THE SMALL TOWN. They\nturn into a Sporting Goods Store. The Chevy is behind them, a\nblock away.\n<b>\n</b><b>                                                             78.\n</b>\n\n\n<b>INT. RADIO/TV STORE\n</b>\nTHE PROPRIETOR LOOKS CAREFULLY OUT THE WINDOW AT THE empty\ncar, then turns and grabs his telephone.\n\n<b>INT. SPORTING GOODS STORE\n</b>\n<b>CAROL REMAINS BY THE FRONT WINDOW, PRETENDING TO\n</b>\nEXAMINE some fishing equipment as she keeps her eye on the\nstreet.\n\nDoc moves to the counter at the rear of the store. An\nATTENDANT moves up to help Doc.\n\n<b>                    SALESMAN\n</b>              (with a smile)\n          Can I help you?\n\n<b>                    DOC\n</b>          Sure can. I'd like an Invicta 12-gauge\n          pump with the twenty-inch barrel.\n\n<b>                    SALESMAN\n</b>          All right. Shells?\n\n<b>                    DOC\n</b>          Two boxes of double-ought buck.\n\n<b>                    SALESMAN\n</b>          Gonna knock down a wall?\n\n<b>                    DOC\n</b>              (big smile)\n          Might try that.\n\nThe Salesman puts a form in front of Doc then goes to the gun\nrack behind him, lifts off a short-barreled shotgun and\nbegins to wrap it.\n\n<b>                       SALESMAN\n</b>          Sign here.\n\n<b>CAROL, AT THE FRONT OP THE STORE, WATCHES THE STREET INTENTLY\n</b>\n<b>EXT. THE STREET\n</b>\nTHE RADIO-REPAIRMAN EXITS THE SHOP AS A POLICE CAR comes down\nthe street and makes a U-turn... stopping near the Chevy.\nAfter a brief conversation the Radio-Repairman goes back\ninside his store and the police car pulls forward, down the\nstreet from the Chevy.\n<b>\n</b><b>                                                             79.\n</b>\n\n\n<b>INT. POLICE CAR\n</b>\nTHE TWO COPS LOOK LIKE HOMER AND JETHRO. Both men stare hard\nat the now staked-out Chevy.\n\n<b>CAROL -- WATCHING PROM THE WINDOW OP THE SPORTING GOODS STORE\n</b>\n<b>AT THE COUNTER THE SALESMAN LAYS OUT THE GUN AND THE BOXES OF\n</b>SHELLS. As Doc empties the loose shells into his coat pocket:\n\nCAROL TURNS, LOOKS AT DOC, THEIR EYES MEET. Doc reads her; he\nknows that the police are in the street.\n\n<b>AT THE COUNTER THE SALESMAN PUTS A STRING AROUND THE BROWN\n</b><b>PAPER\n</b>\n<b>                    SALESMAN\n</b>          Be one hundred and eighty-five thirty-\n          two.\n\nDoc quickly pays the man.\n\n<b>                    DOC\n</b>          Much obliged.\n\nDoc turns as the Salesman drifts over to another Customer --\nhe approaches Carol at the store window.\n\n<b>                    CAROL\n</b>          Only one car.\n\n<b>                    DOC\n</b>          Let's do it.\n\nCarol moves ahead of Doc,, exits the Sporting Goods Store and\nstarts up the sidewalk.\n\n<b>DOC WATCHES HER FOR A MOMENT, THEN HEADS FOR THE DOOR HIMSELF\n</b>\n<b>EXT. SIDEWALK\n</b>\n<b>CAROL WALKS ALONE BACK TOWARDS THE CAR.\n</b>\n<b>INT. POLICE CAR\n</b>\nHOMER AND JETHRO CONTINUE STARING AT THE CHEW. Their car is\npointed towards the Radio Store, its back to the Sporting\nGoods house.\n\nDOC LEAVES THE SPORTING GOODS STORE, CROSSES THE STREET and\nbegins walking up the opposite sidewalk, back towards the\nChevy.\n<b>\n</b><b>                                                             80.\n</b>\n\n\n<b>CAROL PASSES THE POLICE CAR AND NEARS THE CHEVY\n</b>\n<b>INT. POLICE CAR\n</b>\nTHE TWO RURAL COPS MOVE INTO ACTION; their car pulls forward\nand parks diagonally across the street, partially blocking\nthe roadway as xvell as nearly obstructing the Chevy.\n\n<b>CAROL STANDS FROZEN AS HOMER AND JETHRO HOP OUT OF THE POLICE\n</b>car, guns drawn.\n\n<b>DOC CROSSES THE STREET BEHIND THE COP CAR\n</b>\nHE LEVELS HIS big gun...\n\nDoc FIRES the shotgun through the \"brown wrapping paper point\nblank into the squad car, caving in one side of the machine\nand blasting the radiator into a steaming wreck.\n\nHomer and Jethro hit the ground, paralyzed with fright as\ntheir car EXPLODES behind them.\n\nWith three more BLASTS Doc blows most of the top off the\npolice car then calmly reloads.\n\n<b>                    DOC\n</b>          Slide those guns!\n\nThe two cops send their guns clattering across the pavement.\n\nCAROL HAS INSTANTLY MOVED BACK INTO THE CHEVY, started the\nengine and begun maneuvering it out onto the street. She\nmakes a U-turn, then pulls up near Doc.\n\nDOC STEPS FORWARD, KICKS THE TWO PISTOLS BACK UNDER the\npolice car near the gas tank.\n\nHe walks to the back of the car.\n\nCarol throws open the passenger door of the Chevy.\n\nDoc SHOOTS the gas tank of the squad car, it instantly\nignites.\n\nWalking calmly around the burning police car Doc then starts\nto climb into the Chevy.\n\nCarol REVS the engine.\n\nDoc pauses a moment, looking back at the prone police\nofficers and the blazing automobile.\n\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                             81.\n</b><b>CONTINUED:\n</b>\n\nCarol guns the car forward -- Doc, unprepared for the Chevy's\nsudden movement, falls flat on his face across the pavement.\n\nCAROL THROWS THE CHEVY INTO REVERSE, AND ROARS back to pick\nup Doc.\n\nDOC, A LITTLE CHAGRINED, PICKS HIMSELF UP, GRABS his gun and\njumps into the Chevy. He slams the door closed, Carol again\ntears forward -- tires peeling down the pavement.\n\nHOMER AND JETHRO RAISE THEMSELVES. With very long faces they\nstudy the burning remains of their once proud squad car.\n\n<b>EXT. HIGHWAY\n</b>\nTHE CHEVY SPEEDS OUT OF TOWN,, onto an open stretch of road.\n\n<b>INT. CHEVY\n</b>\nDOC JAMS ONE MORE SHELL INTO HIS PAPER-WRAPPED gun -- Carol\ngrips the wheel tightly concentrating on the road... the\nChevy continues to accelerate.\n\n<b>EXT. HIGHWAY\n</b>\nTHE CHEVY CROSSES THE ROAD'S BROKEN WHITE LINE and passes a\nlumbering Greyhound bus.\n\nDOC, STARING AT THE HIGHWAY BEHIND THEM; the bus fades off\ninto the horizon...\n\n<b>                       DOC\n</b>                 (finally)\n             Here.\n\nTHE CHEVY PULLS OFF THE HIGHWAY, MOVES UP A DIRT road for\ntwenty yards then pulls into a cornfield of a well laid out\nfarm, smashing through the six foot high stalks. Well out of\nsight, the Chevy slams to an abrupt halt.\n\n<b>DOC AND CAROL, RUNNING THROUGH THE CORNFIELD AND BACK UP THE\n</b>DIRT road toward the highway. Doc still carries his gun in\nthe brown wrapping paper. Carol labors with the suitcase as\nshe runs.\n\nON THE HIGHWAY DOC STANDS IN THE MIDDLE OF THE ROAD, waving\nboth arms overhead. The Greyhound bus comes to a lurching\nhalt, Doc and Carol scramble aboard.\n\n<b>INT. BUS\n</b>\nDOC BUYS TWO FARES FROM THE SCOWLING GREYHOUND DRIVER. The\nbus again moves forward.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                          82.\n</b><b>CONTINUED:\n</b>\n\nDOC AND CAROL SITTING TOGETHER ON THE BUS, Doc hold- 4l4 ing\nhis camouflaged gun. They lean back on their padded seats as\nthe bus jostles along the road.\n\nSuddenly... Two Police Cars pass the bus, SIRENS screaming,\nlights turning...\n\nDoc and Carol's eyes meet...\n\nOne more Black and White passes the bus and races on down the\nroad.\n\n<b>                                                 DISSOLVE TO:\n</b>\n<b>EXT. TEXAS TOWN - AFTERNOON 4L\n</b>\n<b>DOC WEARS A SUNBEATEN LEATHER JACKET, READING A NEWSPAPER,\n</b>while leaning against a hot dog stand. One foot rests on the\nsuitcase. The Invicta has been re-wrapped in a laundry bag.\nThe paper is filled with news of the robbery and a mug shot\nof Doc.\n\nA GREY MERCURY PULLS UP NEAR THE DOGGIE DINER. Carol is\ndriving. Doc walks up to the window of the car.\n\n<b>INT. MERCURY\n</b>\n<b>DOC LEANS IN THROUGH THE WINDOW.\n</b>\n<b>                    DOC\n</b>          Where are you going?\n\n<b>                      CAROL\n</b>          El Paso.\n\nDoc opens the door and moves into the driver's seat.\n\n<b>                      DOC\n</b>          How much?\n\n<b>                    CAROL\n</b>          Twenty eight hundred.\n\nAs she looks at him, he smiles:\n\n<b>                    DOC\n</b>          Are you hungry?\n\n<b>                      CAROL\n</b>          Not now.\n\nHe drives off.\n<b>\n</b><b>                                                           83.\n</b>\n\n\n<b>INT. CLINTON'S STATION WAGON - LATE NIGHT\n</b>\n<b>FRAN IS CUDDLING WITH RUDY IN THE BACK SEAT.\n</b>\n<b>                    HAROLD\n</b>          I've got to stop.\n\n<b>                    RUDY\n</b>              (as Fran!s hands move over him)\n          I'll tell you when.\n\n<b>EXT. HIGHWAY - TEXAS - MIDNIGHT 4L\n</b>\n<b>A FRONTAGE ROAD BORDERING THE EDGE OF A GOOD-SIZED TOWN.\n</b>Carol now driving,, pulls off the highway and into an \"Oasis\"\ndrive-in restaurant.\n\nTHE MERCURY COMES TO A STOP WITHIN A ROW OF CARS FACING the\nindoor portion of the restaurant.\n\nDOC AND CAROL - INSIDE THEIR AUTOMOBILE AS THE CAR HOP - a\nskinny girl, wearing a brown jacket and slacks, approaches\nthe car carrying two menus. She arrives with a smile. Doc\nleans forward, looking past Carol at the waitress, he lifts\nhis hand, not accepting the bill of fare.\n\n<b>                    DOC\n</b>          That's okay, honey. Two cheeseburgers;\n          two coffees and a milkshake.\n\n<b>                    GIRL\n</b>          How about fries?\n\n<b>                    DOC\n</b>              (big smile)\n          Why not?\n\nThe Car Hop walks back across the raised cement sidewalk\ntowards the kitchen area...\n\n<b>INT. MOTEL - NIGHT\n</b>\nHAROLD IS TIED TO A CHAIR, RUDY IS LYING ON THE BED, half-\nclothed, eating chicken, drinking a beer, while Fran slowly\nstrips down to bra and panties.\n\n<b>INT. MERCURY AT THE DRIVE-IN RESTAURANT\n</b>\nDOC AND CAROL WATCH AS THE CAR HOP PREPARES to bolt the\nserving tray onto the car-door window.\n\n<b>                    GIRL\n</b>          Could you roll it up part way?\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                             84.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>          Sure thing.\n\nThe girl clamps the tray to the window. The Car Hop narrows\nher features, looking at Doc and Carol then smiles and turns\nand heads back toward the kitchen.\n\n<b>DOC REACHES UP AND CASUALLY ADJUSTS THE REAR VIEW MIRROR\n</b>\n<b>THE MIRROR HAS BEEN TURNED TO REVEAL THE HIGHWAY AND THE\n</b><b>ENTRANCE TO THE DRIVE-IN'S PARKING LOT\n</b>\nCAROL BEGINS TO EAT, she looks casually at the mirror.\n\n<b>DOC SLOWLY EATS HIS CHEESEBURGER, TAKES A SIP OF MILKSHAKE\n</b>\nCAROL REACHES FOR HER COFFEE, spills it and then reaches for\nthe light switch knob on the dashboard.\n\n<b>THE MERCURY'S HEADLIGHTS BLINK ON\n</b>\nTHE CAR HOP AT THE PICK-UP STAND, notes the lights 429 then\nturns her head the opposite direction, pretending not to see.\n\n<b>DOC WATCHES THE WAITRESS TURN AWAY\n</b>\nTHE CAR HOP STARES AT THE CEMENT PAVEMENT. Within the kitchen\nbehind her the cooks all look toward the parking lot... their\nfaces expectant.\n\n<b>DOC WATCHING THE WAITRESS\n</b>\n<b>                    DOC\n</b>          She made us.\n\nCarol looks into the rear view mirror. Across the wide lot a\npolice car appears, cutting in off the highway.\n\nDoc goes into the back seat, Carol kicks the engine over,\njams the stick into gear. All this is accomplished while\nstaring into the rear view mirror.\n\nDOC LIFTS THE LAUNDRY BAG-COVERED SHOTGUN onto his lap.\n\nTHE POLICE CAR cruises slowly along the line of autos...\n\n<b>INT. POLICE CAR\n</b>\n<b>TWO OFFICERS SCAN THE PARKING LOT. THE PASSENGER COP CRADLES\n</b>a riot gun.\n\n<b>                     PASSENGER COP\n</b>          Mercury.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                           85.\n</b><b>CONTINUED:\n</b>\n\nTHE SQUAD CAR PULLS TO A STOP FIFTEEN FEET behind the\nMercury, seemingly blocking the way.\n\n<b>                    DOC\n</b>          Now.\n\nCAROL STANDS ON THE ACCELERATOR. THE MERCURY GOES screaming\nforward, as Doc shoots out the back window. Then, as the\nterrified cops duck to the side, he shoots out their front\nwindshield. The Mercury bounces up across the sidewalk as the\nempty plates and glasses topple off the serving tray and roll\nacross the concrete. The car slams back down through a vacant\nspace on the opposite side, and moves around in a semicircle\nacross the asphalt, heading for the highway exit.\n\nDOC SMASHES OUT THE REAR WINDOW with the butt of his shotgun.\n\nTHE BLACK AND WHITE NOW IN REVERSE, ZOOMING BACK, trying to\nget between the Mercury and the highway.\n\n<b>CAROL BRINGING THE CAR AROUND, SHE CAN SEE THE SQUAD CAR\n</b>streaking backward. She pulls the wheel to the right and\nbrings her car across the front of the still stopping Police\nCar.\n\nTHE OFFICERS TRY TO BRING THEIR GUNS INTO PLAY AS THE Mercury\nstreaks in front of them.\n\n<b>DOC FIRES THE SHOTGUN TWICE\n</b>\nTHE POLICE CAR EXPLODES. THE HOOD IS LIFTED OFF THE CAR. Both\nOfficers jump out of the vehicle, pouring shots after the\nretreating Mercury.\n\n<b>CAROL - SCREAMING AS THE FRONT AND BACK WINDSHIELDS SHATTER\n</b>around her.\n\n<b>THE MERCURY, BADLY RIDDLED, PULLS OUT ONTO THE HIGHWAY\n</b>\nANOTHER SQUAD CAR COMES SPEEDING UP in the opposite\ndirection. The Driver hits the brakes, the tires smoke along\nthe street as the Black and White SCREAMS to a stop.\n\n<b>CAROL PULLS THE MERCURY BY THE SQUAD CAR\n</b>\n<b>DOC FIRES ANOTHER TWO BURSTS...\n</b>\nTHE POLICE CAR - THE FRONT AND BACK FENDERS ARE HIT; the\nwheels disintegrate - the impact of the shells rocks the\nBlack and White upward.\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             86.\n</b><b>CONTINUED:\n</b>\n\nTHE SECOND PASSENGER COP, FIRING A .38 OUT HIS BACK WINDOW at\nthe Mercury as it streaks down the road. Three holes open up\non the trunk of the auto.\n\nDOC CAN SEE BOTH OFFICERS JUMP OUT OF THE SECOND Black and\nWhite through the rear window. Carol makes a quick turn off\nthe highway.\n\n<b>THE MERCURY ROARS DOWN THE DARK STREET INTO THE CITY'S\n</b>COMMERCIAL SECTION, suddenly slow, makes another sharp turn -\nthis time through a red light.\n\n<b>DOWN A SMALLER STREET FILLED WITH SHOPS - CAROL ROUNDS THE\n</b>CORNER, whips up to the curb - Doc and Carol jump out of the\ncar. She carries the suitcase, he hangs onto his big gun.\n\nDOC AND CAROL, MOVING DOWN A DESERTED SIDEWALK; the SOUND of\nsirens. They round a corner, then quickly move into an alley.\n\nTHE ALLEY IS NARROW, DESERTED. DOC AND CAROL pull back into\nan alcove as a prowl car goes SCREAMING down the street and\noff into the night. They continue down the alley.\n\nTHE OPPOSITE ENTRANCE TO THE ALLEY IS BLOCKED BY a large\nmetal garbage container, and the DRIVER empties two cans of\ngarbage into it. Then he starts across the narrow street\nbeyond in order to grab several others.\n\nDOC LOOKS BEHIND HIM, THEN GRABS CAROL'S ARM. They run for\nthe container. Doc tosses the suitcase into the container,\njumps in, reaches back, pulls Carol in beside him. SIRENS\nagain sound close by.\n\nAFTER A MOMENT, A LARGE GARBAGE TRUCK PULLS UP, lifts the\ncontainer with hooks and dumps the garbage and Doc and Carol\ninto the truck.\n\n<b>A SERIES OP ANGLES AS A CRUSHER BEGINS TO MOVE TOWARDS THEM\n</b>INSIDE THE TRUCK. Doc and Carol start to panic, but they have\nroom enough.\n\nWITHIN THE TRUCK DOC WIGGLES HIS .45 out of his jacket and\ninto his hand. He, Carol and the suitcase are crushed tightly\namongst the garbage. A moment after Doc frees his gun, a load\nof garbage descends on their shelter, partially obscuring\nthem.\n\n<b>THE TRUCK PULLS OUT\n</b>\nDOC AND CAROL SWEATING... BREATHING HARD. Again the SOUND of\nsirens... the truck lurches forward.\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             87.\n</b><b>CONTINUED:\n</b>\n\nTHE TRUCK MOVES ALONG THE EMPTY STREETS, passing several\nprowling squad cars.\n\n<b>EXT. STREETS - SERIES OF ANGLES - SUNRISE\n</b>\nTHE GARBAGE MAN DRIVING THE TRUCK, MAKING STOPS, throwing in\nmore refuse. The truck continues along.\n\nDOC AND CAROL - THEIR FACES COVERED WITH PERSPIRATION and\nflies... buried within their enclosure under the moist\ngarbage.\n\n<b>A GARBAGE DUMP - MORNING\n</b>\nTHE TRUCK GROWLS ALONG THE RUTTED PATHWAY surrounded by acres\nof open trash. Areas within the dump reveal the slow,\nsmouldering fires...\n\n<b>THE TRUCK BACKS UP TO A HUGE CRATER HALF-FILLED WITH REFUSE\n</b>\n<b>THE DRIVER REVS THE ENGINE, PULLS THE BED LIFT GEAR\n</b>\nTHE TRUCK BED RISES AND TILTS FORWARD, as the load of trash\ntumbles down the face of the crater.\n\nDOC AND CAROL SLIDE DOWN THE MOUNTAIN OF FILTH, and stumbling\nforward they climb into a large cardboard box.\n\nTHE DRIVER GETS OUT OF THE CAB, checks to see that the\ngarbage is gone from the truck bed. On his way back to the\ncab he finds a magazine to his liking near a shredded auto\ntire. With his newly-found prize, the Driver re-enters the\ntruck and drives away.\n\nTHE BOX LIES AT THE BOTTOM OF THE CRATER AMONGST the broken\nbottles, melon rinds, flashlight batteries, tin cans, used\ntires.\n\nDOC SAWS AT A CORNER OF THE CARDBOARD BOX with his penknife.\nThe matted paper gives away, allowing them more room within\nthe box.\n\n<b>                    DOC\n</b>          Okay?\n\n<b>                    CAROL\n</b>          I think so... I don't know.\n\nDoc puts his hand to her face, wiping away a thin trace of\nblood from a scratch.\n\n<b>                    DOC\n</b>          It's not deep.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                             88.\n</b><b>CONTINUED:\n</b>\n\nCarol tries to smile for the first time in quite a while.\n\n<b>                       CAROL\n</b>          No scars?\n\n<b>                       DOC\n</b>          No scars.\n\nDoc looks across the garbage through the open end of the\ncrate.\n\nTHE HEAT AND THE FLIES HAVE BECOME UNBEARABLE. Carol begins\nto scratch her leg.\n\n<b>                     DOC (CONT'D)\n</b>          Don't scratch it, just rub, you'll get an\n          infection.\n\nCarol ignores him, she is in bad shape.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing)\n          Do what I tell you, it's not a game.\n\n<b>                    CAROL\n</b>          It's all a game, don't bother me.\n\nDoc stares at the garbage around them.\n\n<b>                    DOC\n</b>          We better stick here till tonight.\n\n<b>                       CAROL\n</b>              (down)\n          Yeah.\n\nDoc smiles, trying to get her to smile again.\n\n<b>                    DOC\n</b>          We're going to make it.\n\n<b>                    CAROL\n</b>              (further down)\n          Sure...\n\nCarol rubs one hand along her now terribly soiled, tweed\nsuit.\n\nShe looks away from Doc. Doc stares at her mussed hair and\ntear-stained cheeks.\n\n<b>                    DOC\n</b>          I want to say something.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                            89.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                     CAROL\n</b>               (quiet defeat)\n           I don't want to hear it.\n\n<b>                     DOC\n</b>               (softly)\n           Listen to me. It's hard enough.\n\nCarol turns back, faces Doc. Their eyes find one another.\n\n<b>                     DOC (CONT'D)\n</b>               (continuing)\n           Look, what you said yesterday... I guess\n           that was right. It isn't worth anything\n           if we don't make it together.\n\n<b>                     CAROL\n</b>           I don't think we can any more... If we\n           ever get out of here, maybe I should take\n           off...\n\n<b>                     DOC\n</b>           We got this far.\n\n<b>                     CAROL\n</b>           We've come a lot of miles. But we're not\n           close to anything.\n\n<b>                     DOC\n</b>           I guess you're right.\n\nA pause.\n\n<b>                     CAROL\n</b>           I always thought jails make people hard.\n           Not you. You're just not tough enough to\n           forget about Beynon. I chose you, not\n           him.\n\n<b>                     DOC\n</b>           Either we pick it up or else we leave it\n           right here. We got to go one way or\n           another.\n\n<b>                     CAROL\n</b>               (setting the condition)\n           No more about Beynon.\n\n<b>                     DOC\n</b>           Whatever happens it's over.\n\nA pause.\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                            90.\n</b><b>CONTINUED: (3)\n</b>\n\n<b>                    CAROL\n</b>              (not trusting his mouth)\n          Sounds good.\n\n<b>                    DOC\n</b>          You want to try with me?\n\n<b>                    CAROL\n</b>              (smiling)\n          Things can't get much worse can they?\n\n<b>                    DOC\n</b>          I don't see how.\n\nA long moment.\n\n<b>                    CAROL\n</b>              (finally talcing Doc's arm)\n          Okay.\n\n<b>                    DOC\n</b>              (slow smile)\n          You and me.\n\n<b>                    CAROL\n</b>          Can we make it?\n\n<b>                    DOC\n</b>          We get to Mexico, we can have a life.\n\n<b>                    CAROL\n</b>          That's all I want... It's the only thing\n          I have ever wanted.\n\nAs she pulls herself against him:\n\n<b>                    DOC\n</b>          I'm going to try and get it for you.\n\nThey pull each other closer, tightly holding one another.\n\n<b>RUDY IS LYING IN BED READING A NEWSPAPER PILLED WITH DOC AND\n</b>CAROL. The fact that they have been seen in the North. He\nsmiles.\n\nFran is in the bed beside him asleep naked under the sheets.\n\n<b>                    RUDY\n</b>              (calling softly)\n          Harold, you've had ten minutes, get out\n          of there.\n\nNo answer. Rudy gets up and crosses to the bathroom.\n<b>\n</b><b>                                                             91.\n</b>\n\n\n<b>INT. BATHROOM - DAY\n</b>\nHAROLD IS HANGING FROM A BRACKET. Very dead and not very\npretty. Rudy looks at him, then sits on the John continuing\nto read his paper.\n\n<b>EXT. GARBAGE DUMP - LATE DAY\n</b>\n<b>CAROL AND DOC CLIMB OUT OF THE GARBAGE AND BEGIN WALKING HAND\n</b><b>IN HAND.\n</b>\n<b>INT. CATTLE CAR - NIGHT 48L\n</b>\n<b>DOC AND CAROL HUDDLED TOGETHER ON THE FLOOR OF THE EMPTY CAR.\n</b>They hold one another tightly fighting the cold and the\nrelentless roar of metal wheels.\n\n<b>INT. EL PASO SELF-CLEANING STORE - EARLY MORNING\n</b>\nCAROL AND DOC ARE THE ONLY CUSTOMERS. They sit in booths\nwhile their clothes are being cleaned (doors open at bottom).\n\n<b>INT. MEN'S ROOM SERVICE STATION - DAY\n</b>\n<b>DOC AND CAROL WASH THE GRIME FROM THEIR HANDS AND FACES.\n</b>\n<b>EXT. NEW CONSTRUCTION - EL PASO - EARLY EVENING\n</b>\n<b>DOC AND CAROL WALK THROUGH LIKE TOURISTS.\n</b>\n<b>INT. LOBBY OF LAUGHLIN'S HOTEL - EL PASO - MORNING\n</b>\n<b>RUDY AND FRAN ENTER THE HOTEL, EACH OF THEM CARRYING\n</b><b>OVERNIGHT BAGS.\n</b>\nCannon watches them from across the room, carefully cleaning\nhis teeth with a cinnamon toothpick.\n\n<b>INT. FOURTH FLOOR CORRIDOR LAUGHLIN HOTEL - MORNING\n</b>\nLAUGHLIN LEADS RUDY AND FRAN down the dark-walled hallway,\nstopping before room number 4l8. Laughlin turns the key in\nthe lock, opens the door.\n\n<b>                    LAUGHLIN\n</b>          It's hard to figure. There's something\n          about the composition of the track at\n          Pimlico... You can't go by the clock, any\n          speed horse, take a second off any other\n          track in the country.\n\n<b>INT. ROOM 418\n</b><b>\n</b><b>                                                          92.\n</b>\n\n\n<b>AS THE GROUP ENTERS.\n</b>\n<b>                    LAUGHLIN\n</b>              (continuing)\n          ... but a speed horse is the only thing\n          that consistently holds form. They got to\n          let 'em run, dumb God damn trainers try\n          to rate 'em, just breaks their heart.\n\nRudy kicks the door shut with a slam, grabs Laughlin's\nshoulder, spins him around, hits him full in the stomach. As\nLaughlin begins to fall Rudy catches him, wallops him again\nin the mid-section, then throws him back into a ratty\narmchair. Rudy instantly pulls out his .44 and shoves it hard\nagainst Laughlin's mouth.\n\n<b>                    RUDY\n</b>          Okay, sweetpea, you get two choices. Live\n          or die.\n\n<b>                    RUDY (CONT'D)\n</b>          Do what I tell you, you not only get to\n          live, but maybe you'll pick up some\n          money.\n\n<b>                    LAUGHLIN\n</b>              (still breathless)\n          Just tell me.\n\n<b>                    RUDY\n</b>          First things first. Main thing, you work\n          for me, otherwise I get you. If I don't,\n          six months from now one of my friends\n          will.\n\n<b>EXT. EL PASO STREET - DAY\n</b>\n<b>CANNON AT PHONE BOOTH. HE SLIPS A DIME INTO THE SLOT.\n</b>\n<b>INT. ACCOUNTANT'S OFFICE - DAY\n</b>\n<b>THE ACCOUNTANT HANGS UP THE PHONE.\n</b>\n<b>                    ACCOUNTANT\n</b>          El Paso. Laughlin's. Rudy's arrived.\n\n<b>DOC IN PHONE BOOTH PLACES CALL\n</b>\n<b>INT. LAUGHLIN'S HOTEL\n</b><b>\n</b><b>                                                             93.\n</b>\n\n\n<b>LAUGHLIN PICKS UP THE PHONE.\n</b>\n<b>                    LAUGHLIN\n</b>          Sure, Doc. I can do it. Just like old\n          times... Yeah, it's a nervous way to\n          live.\n\n<b>EXT. EL PASO STREET - NEXT DAY - EARLY AFTERNOON\n</b>\n<b>CAROL AND DOC SIT ON A WOODEN BENCH AT A PARK NEAR THE HOTEL.\n</b>THE BLACK SUITCASE is on the ground.\n\nACROSS THE STREET FROM THE BENCH IS LAUGHLIN'S. FOUR stories\nof red brick.\n\n<b>A DOC GETS UP AND CROSSES TO THE HOTEL WITHOUT THE BAG\n</b>\n<b>INT. LAUGHLIN'S HOTEL - DAY\n</b>\n<b>DOC ENTERS AND CROSSES TO LAUGHLIN WHO IS BEHIND THE DESK.\n</b>The switchboard is now vacant.\n\n<b>                    DOC\n</b>          Jimmy. How's it going?\n\n<b>                    LAUGHLIN\n</b>              (shaking hands, laughing)\n          Good to see you, Doc.\n              (handing him a paper)\n          It's all there, departure, arrival -\n          everything except the $500.\n\nDoc pays him, looks closely into his eyes. Jimmy hasn't\nchanged and it's set.\n\n<b>                    DOC\n</b>          How's Mama and the kids?\n\n<b>                     LAUGHLIN\n</b>          Growing -- all of them - every day.\n              (then)\n          318, you'll be the only ones on the\n          floor.\n\n<b>                    DOC\n</b>          My lady'11 come in in about five minutes.\n          Have some food sent up in half an hour.\n\n<b>                    LAUGHLIN\n</b>          Just sandwiches...\n\n<b>                    DOC\n</b>          Right.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                             94.\n</b><b>CONTINUED:\n</b>\n\nHe picks up the room key. Doc starts for the elevator.\n\n<b>                    DOC (CONT'D)\n</b>          When she gets here, have that kid of\n          yours help her with the suitcase.\n\n<b>                    LAUGHLIN\n</b>          He took the day off.\n\n<b>                    DOC\n</b>          Then you do it.\n\n<b>                    LAUGHLIN\n</b>          Can't leave the desk.\n\nDoc gives Laughlin a half-pissed look, then crosses to the\nelevator and pulls the cage door open.\n\nLAUGHLIN WATCHES THE RICKETY, self-service elevator move\nupward. He reaches for the desk phone.\n\n<b>INT. ROOM 4L8 - DAY\n</b>\nFRAN, WEARING ONLY A BATHROBE, is doing her nails while\nwatching an old movie on the black and white tube, seated on\nthe bed. The phone begins to RING.\n\nFran looks over to Rudy from her overstuffed armchair.\n\n<b>                    RUDY\n</b>          Okay, Grunt, pick it up.\n\n<b>ELEVATOR DOORS - THIRD FLOOR\n</b>\n<b>CAROL EMERGES THROUGH THE SLIDING DOOR AND TURNS DOWN THE\n</b>CORRIDOR. She walks slowly, carrying the heavy suitcase.\nReaching the door to room 31oj Carol knocks rapidly three\ntimes, waits, then raps out two sets of two knocks. The door\nswings open and Doc stands within the archway. She enters.\nDoc shuts the door and slips his arms around Carol, revealing\nhis .45 automatic in one hand.\n\n<b>INT. RUDY'S HOTEL ROOM\n</b>\nRUDY IS SPINNING THE CHAMBER on his .44 then shoves it into\nhis coat pocket. Fran is getting dressed in the middle of the\nroom, her breasts and thighs ripple outward from the confines\nof the bra and girdle.\n\nTHE CALICO KITTEN SLEEPS PEACEFULLY IN ITS cardboard box.\n<b>\n</b><b>                                                              95.\n</b>\n\n\n<b>INT. BATHROOM 3L8\n</b>\nCAROL IS IN THE SHOWER, STEAM HANGS IN THE AIR as she\nvigorously soaps her body, cleansing herself of the residue\nleft from their cross-country flight.\n\nDOC IN THE MAIN ROOM IS STANDING AT THE LARGE windows facing\nacross to the building next to Laughlins. The fire escape is\none story beneath him. Doc crosses, throws the suitcase on\nthe bed, undoes the straps and snaps, lifts the lid open. He\nstares at the huge amount of money for a moment, then digs\ninto the suitcase, reaching down to the bottom. He withdraws\nhis hand, holding four visas.. He puts two of them on the\nbureau drawer top... the other two he begins to tear into\nsections and places them into a large ashtray. He touches a\nmatch to the scraps.\n\nTHE FLAMES CURL AROUND RUDY'S PHOTOGRAPH in the ashtray.\n\n<b>EXT. AIR TERMINAL - EL PASO ENTRANCE - DAY\n</b>\n<b>THE ACCOUNTANT., SWAIN, CULLY AND HAYHOE APPROACH A PARKED\n</b><b>OLDSMOBILE... A HOOD IS DRIVING.\n</b>\n<b>INT. ROOM\n</b>\n<b>ON THE BED IN DOC AND CAROL'S ROOM, THE SUITCASE IS NOW\n</b>CLOSED; the .45 automatic sits beside it... Doc's overcoat\nalso lies across the bedpsread, near it the wrapped shotgun.\nThe poster is again on the wall.\n\nCAROL still in the bathroom of room 318. She wears only a\nslip. Carol is washing out her bra and panties in the\nwashbasin, using a coarse bar of soap. Doc enters; he begins\ntaking off his shirt.\n\n<b>                      DOC\n</b>            We've got some food coming, should be\n            here any minute.\n\n<b>                      CAROL\n</b>            Great. I'm going to sleep twelve hours.\n\n<b>                      DOC\n</b>            Ten. Laughlin's going to take us across\n            at four A.M.\n\n<b>                      CAROL\n</b>                (mild complaint)\n            Oh, Jesus... how?\n\n\n\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                          96.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>          Jeep. There's a dry river bed fifteen\n          miles east. He takes us to the Mexican\n          side, drops us off at the airfield by\n          breakfast... we've got a 9 o'clock\n          flight.\n\n<b>                    CAROL\n</b>              (smiles)\n          I'll be ready.\n\n<b>                       DOC\n</b>              (down)\n          Yeah.\n\n<b>                    CAROL\n</b>          What's wrong?\n\n<b>                    DOC\n</b>              (shrugs)\n          I don't know.\n\n<b>                    CAROL\n</b>          Get in the shower. You'll feel okay.\n\n<b>                    DOC\n</b>              (smile)\n          Whatever you say.\n\n<b>INT. FOURTH FLOOR HALLWAY\n</b>\nAS RUDY AND FRAN EMERGE FROM THEIR ROOM. The door shuts\nbehind them, Rudy guides Fran to the stairs.\n\n<b>INT. BATHROOM 318\n</b>\n<b>DOC STANDS IN THE SHOWER, THE HARD SPRAY BREAKING OVER THE\n</b>BACK OF HIS SKULL. Tired, he closes his eyes, rests the side\nof his head against the tile.\n\n<b>INT. BEDROOM 318\n</b>\nCAROL STILL WEARING THE SLIP, she lies back across the bed.\nHer eyelids slowly fall shut. Carol has pushed the suitcase,\novercoat and .45 off to one side.\n\nRUDY AND FRAN COME DOWN THE STAIRS. Rudy puts one hand inside\nhis overcoat.\n\n<b>INSIDE THE OLDSMOBILE - EL PASO CITY STREETS\n</b>\n<b>AS THE HOOD DRIVES, SWAIN IS BESIDE HIM IN THE FRONT, CULLY,\n</b>THE ACCOUNTANT AND HAYHOE ride in the back seat.\n<b>\n</b><b>                                                              97.\n</b>\n\n\n<b>INT. ROOM 318\n</b>\nCAROL IS NAPPING LIGHTLY ON THE BED AS DOC BURSTS out of the\nbathroom... again dressed in his shorts, holding his pants in\none hand.\n\n<b>                      DOC\n</b>            Get upI Carol's eyes snap open.\n\n<b>                      DOC (CONT'D)\n</b>                (continuing)\n            We're moving now!\n\nHe quickly pulls his pants on...\n\n<b>                      CAROL\n</b>            What is it?\n\n<b>                      DOC\n</b>            Laughlin. He's always got his family\n            around... that wife and kid of his have\n            to stand by his side to make sure he\n            stays off the juice and horses.\n\n<b>                       CAROL\n</b>            So what?\n\n<b>                       DOC\n</b>            If they are not here, he must have sent\n            them away.\n\n<b>INT. CORRIDOR THIRD FLOOR\n</b>\nRUDY AND FRAN STEP INTO THE HALLWAY TOWARD ROOM 3l8a passing\nseveral rooms. Fran's face is taut. Rudy starts his nervous\ngrin.\n\n<b>INT. ROOM\n</b>\n<b>DOC SNAPS HIS ZIPPER CLOSED, REACHES FOR HIS SHIRT.\n</b>\n<b>                      CAROL\n</b>            You're crazy.\n\n<b>                       DOC\n</b>                (hard)\n            Get your clothes on, move your butt.\n\nShe looks at him, doesn't move.\n\n<b>                       CAROL\n</b>            Sorry. Look, I'm clean. I want to get\n            some rest.\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                            98.\n</b><b>CONTINUED:\n</b>\n\nShe is interrupted by a hard knock on the door. Doc drops his\nshirt to the floor. He quickly reaches down, lifts his .45.\nDoc gestures to Carol... she moves towards the door.\n\n<b>                     CAROL (CONT'D)\n</b>              (continuing; now at doorway)\n          Who is it?\n\n<b>INT. HALLWAY\n</b>\nFran stands at the door to 318. Rudy is at her shoulder; he\nhas taken out his revolver.\n\n<b>                    FRAN\n</b>          It's your food, I brought up your\n          sandwiches...\n\n<b>                    INSIDE 318\n</b>          Carol standing near the door., looks at\n          Doc. He mouths and half-whispers:\n\n<b>                    DOC\n</b>          Stall.\n\nDoc whips his pen knife out of his pocket, crosses the room\nto the locked door of an adjoining hotel room. He begins\nforcing the lock.\n\n<b>                    CAROL\n</b>          Just leave it outside the door... I'm not\n          dressed right now.\n\nAfter a moment:\n\n<b>                    FRAN\n</b>          I can't do that, ma'am. You have to pay\n          now so I can pay back the boy that went\n          out and got the food...\n\nDOC working on the door; his .45 shoved into the waistband of\nhis pants.\n\nCAROL thinking hard...\n\n<b>                    CAROL\n</b>          All right. You'll have to hold on a\n          minute, my husband's in the shower...\n\nDOC breaks the lock and opens the door -- he quickly crosses\nthe dark apartment, moves to the front door, slips out his\nautomatic, then gingerly cracks the door. His eyes tighten in\namazement as he sees:\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                             99.\n</b><b>CONTINUED:\n</b>\n\nRUDY STANDING SLIGHTLY BEHIND FRAN, his .44 held tightly up\nto the door jamb, ready for instantaneous use. Rudy and Fran\nare 15 feet down the hallway from Doc's slightly opened door.\nThey both have their backs turned to him in three-quarter\nfashion.\n\nDOC BAREFOOTED., BARE-CHESTED; he decides on a course of\naction. The door swings quietly open.\n\nWITHIN THE HALLWAY, DOC CLOSES THE DISTANCE between himself\nand Rudy in two swift strides, Rudy turns,, swinging his gun,\ntoo late, as Doc's .45 crashes against his head. Rudy drops.\nFran screams. Rudy looks at Doc, still smiling, eyes glazed.\n\nHe falls abruptly. Doc stands over the fallen body. Fran\ncontinues to scream. Doc finally turns away from Rudy,\nlooking now at the screaming woman. He flattens her with a\nleft hook to the jaw. Fran drops to the floor as if she had\nbeen shot. Suddenly everything in the corridor is silent.\n\nRUDY'S HEAD IS BLOODIED. He lies without movement.\n\n<b>DOC NOW SLAMS AT THE DOOR OF 318\n</b>\n<b>                    DOC\n</b>          Open it up, it's me.\n\nCarol swings the door open. Doc bursts back into the room,\ngrabs his shirt, begins to button it.\n\n<b>                    DOC (CONT'D)\n</b>              (continuing)\n          Come on, come on.\n\n<b>                    CAROL\n</b>          Who was it?\n\n<b>                    DOC\n</b>          Just get your clothes on...\n\n<b>THE FOURTH FLOOR CORRIDOR\n</b>\nAS DOC AND CAROL COME BACK OUT OF 318 they step over the\nfallen bodies and start toward the waiting elevator.\n\nCarol stops as she recognizes Rudy. Doc pulls her along,\nforcing her to keep moving. Carol again carries the brown\nsuitcase, Doc holds the shotgun. They go down the back (or\nfront) stairs.\n<b>\n</b><b>                                                           100.\n</b>\n\n\n<b>INT. LOBBY\n</b>\n<b>THE ACCOUNTANT STANDS AT ONE CORNER OP THE RECEPTION COUNTER\n</b>IN THE LOBBY OF LAUGHLINS. Within an alcove behind and to one\nside of the desk (the area serving as an office) Cully, Swain\nand Hayhoe have stretched Laughlin across the pine desk. The\nAccountant eyes both the empty lobby and the entrance to the\nhotel3 acting as lookout.\n\nCULLY INSIDE THE ALCOVE LIFTS A SNAPPED OFF LEG of the heavy\nchair to use as a club. The thug turns back to the desk where\nSwain and Hayhoe have Laughlin pinioned.\n\n<b>                       CULLY\n</b>             Just tell us the room number.\n\nLAUGHLIN LOOKS BACK AT CULLY. He is very frightened but says\nnothing.\n\n<b>CULLY SLAMS THE WOODEN CLUB DOWN ON LAUGHLIN KNEECAP\n</b>\n<b>                       CULLY\n</b>             Now you want to tell me?\n\n<b>                       LAUGHLIN\n</b>             McCoy's in 318., the other guy's in 420.\n\n<b>                       CULLY\n</b>             Sure about that?\n\nHe again whacks Laughlin's knee.\n\n<b>INT. LOBBY STAIRS\n</b>\nDOC AND CAROL EMERGE,, MOVING QUICKLY FOR THE. main entrance.\nThey get five steps before simultaneously seeing the\nAccountant.\n\n<b>                       CAROL\n</b>             Doc !\n\nDoc and Carol freeze for an instant.\n\nThe Accountant snaps his fingers twice.\n\nCully lowers his club, looks to the Accountant, as do Swain\nand Hayhoe. The Accountant smiles, staring at Doc and Carol.\n\n<b>                       ACCOUNTANT\n</b>                 (calmly to his men)\n             Out here.\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                           101.\n</b><b>CONTINUED:\n</b>\n\nCULLY, SWAIN AND HAYHOE APPEAR FROM THE ALCOVE BEHIND the\nAccountant. They look over his shoulder toward the rear of\nthe hotel, their eyes finding Doc and Carol.\n\n<b>INT. WITHIN THE MAIN LOBBY\n</b>\n<b>DOC HAS ONE HAND IN HIS OUTSIDE COAT POCKET, WRAPPED\n</b>\naround the .45. Carol continues to hold the suitcase up in\nfront of herself, almost like a shield. The distance between\nDoc and Carol and the hotel entrance has been effectively cut\noff by the four opponents standing near the reception desk.\nCarol edges backward a few steps, toward the massive wooden\nstaircase.\n\n<b>                    ACCOUNTANT\n</b>          Just have her set it down.\n\nDoc's hand comes out of his coat pocket, a slow gesture\nrevealing that his palm is empty.\n\n<b>                    DOC\n</b>          You want it? Come and take it.\n\n<b>THE ACCOUNTANT NOW PLANKED BY THE THREE MEN\n</b>\n<b>                    ACCOUNTANT\n</b>              (quietly)\n          Get him.\n\nAs the three men reach for their guns.\n\nDOC MOVES MUCH PASTER. HE DUCKS TO   THE RIGHT, levels the\ndisguised shotgun and fires in the   same movement. The\nreception desk near the Accountant   splinters from the blast\nand he is hit painfully. The other   three men duck away from\nthe sudden burst of fire power.\n\n<b>DOC AND CAROL JUMP FOR THE STAIRS\n</b>\nHAYHOE LEVELS HIS PISTOL AT THE RETREATING COUPLE Another\nshot from Doc's riot gun... this one breaking open the floor\nat Hayhoe's feet and cutting him down at the knees. Cannon,\nCully, Swain and Max open fire as they dive for cover. They\nmiss their shots, digging up walls, stairs and flooring.\n\nON THE WINDING STAIRWAY DOC AND CAROL FLEE UPWARD She\nstruggles with the heavy suitcase, Doc transfers the riot gun\nto his left hand, pulls out the more accurate .45 to use with\nhis right.\n<b>\n</b><b>                                                         102.\n</b>\n\n\n<b>WITHIN THE LOBBY THE SIX MEN SPLIT FORCES\n</b>\nCully and the Accountant run to the elevator, enter it, pull\nthe door shut. Swain and Hayhoe, limping, and Cannon and Max\nstart for the stairwell in direct pursuit of Doc and Carol.\nAll the men, save the Accountant, now have guns in their\nhands.\n\nSWAIN AND HAYHOE CAUTIOUSLY GOING UPWARD. Still below the\nfirst level landing, their eyes search overhead. The SOUND of\nDoc and Carol's pounding feet can be heard.\n\nHAYHOE LEANS OUT OVER THE BANISTER, points his gun directly\nup and fires.\n\nDOC AND CAROL BETWEEN THE FIRST AND SECOND FLOOR landings as\nHayhoe's bullet tears by, ripping through the wooden banister\nsupports.\n\nINSIDE THE ELEVATOR THE ACCOUNTANT AND CULLY WATCH the arrow\nindicator pass \"Two.\"\n\nDOC AIMING HIS .45 RESTING IT ON THE BANISTER He fires two\nshots back down the stairwell.\n\nSWAIN AND HAYHOE MOVING UP THE STEPS TWO AT A TIME Suddenly\nHayhoe's leg buckles as a .45 slug tears through his hip, the\nother bullet ripping the plaster wall near his shoulder.\n\nSWAIN IS NOW BESIDE THE BANISTER, he points his 54l revolver\nstraight up... empties it.\n\nDOC AND CAROL AS SWAIN'S BULLETS BREAK AROUND THEM. Doc pulls\nCarol down, lifts the riot gun and fires down the stairwell\nwith a huge roar.\n\nTHE STAIRCASE TEN FEET IN FRONT OF SWAIN IS SMASHED by Doc's\nblast. Swain has to climb over the uprooted planking to\ncontinue moving upward. Cannon following.\n\n<b>THE ELEVATOR INDICATOR STOPPING AT \"THREE\"\n</b>\nCULLY PULLS OPEN THE DOOR, MOVES OUT INTO THE corridor. The\nAccountant remains within the elevator.\n\n<b>SWAIN ON THE STAIRWAY FIRES HIS PISTOL UPWARD\n</b>\nCAROL, ON THE STAIRWAY ABOVE, AS THE SHOTS SMASH PAST, runs\nahead of Doc by three steps. They pass the second landing,\nkeep moving upwards towards the third.\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                           103.\n</b><b>CONTINUED:\n</b>\n\nDoc's focus of attention is downward. He knows that he and\nCarol are being pursued up the stairwell, but he isn't aware\nof the fact that the gunsels have split their forces.\n\n<b>RUDY ON THE THIRD FLOOR AGAIN RISES LIKE LAZARUS FROM THE\n</b>DEAD. His head bloodied from Doc's heavy pistol, he slowly\nwobbles to his feet. Rudy looks down at Fran... she sobs\nviolently, her back leaning against the wall. Rudy picks up\nhis .44 then stumbles into the open door of Doc and Carol's\nroom. He unsteadily crosses to the bathroom, closes the door.\n\nCAROL FRANTICALLY MOVING UPWARD, DOC HAS NOW FALLEN five\nsteps behind.\n\n<b>DOC FIRES THE .45 DOWN THE STAIRWELL AT\n</b>\n<b>SWAIN ON THE THIRD FLOOR\n</b>\nCully walks cautiously down the corridor, pistol raised. He\nmoves toward the landing, having covered one quarter of the\ndistance from the elevator. The Accountant is still within\nthe elevator.\n\nCarol comes up the stairwell and looks back for Doc. The\nSOUND of Swain's pistol and Doc's answering .45. Carol senses\na movement; she turns and sees Cully's gun leveled at her. As\nCarol screams:\n\nDoc dives onto the landing facing the corridor... his plane\nof movement knee high.,, the riot gun in his left hand, .45\nin his right.\n\nCULLY IS HIT IN THE CHEST BY BUCKSHOT. The killing wounds\nfling him upward as he fires his own gun... his aim destroyed\nby the death blows,, the bullets stray above Carol, high of\ntheir mark.\n\n<b>DOC FIRES THREE TIMES MORE AT THE ELEVATOR CABLE\n</b>\nTHE CORRIDOR WALL NEAR THE ELEVATOR IS SMASHED BY ONE OF the\nriot gun's jumbo shots, as is the top of the elevator. The\nplaster flies away revealing further damage. The cables are\nsmashed, the elevator breaks loose and plummets downward.\n\n<b>THE EMERGENCY CABLE, INSIDE THE SHAFT\n</b>\nTHE MECHANISM TRANSFERS OVER, line catching within the pulley\nhousing. The line snaps taut - halting the speeding car.\n\n<b>WITHIN THE LOBBY\n</b><b>\n</b><b>                                                           104.\n</b>\n\n\n<b>AS THE ELEVATOR SLAMS TO A WRENCHING STOP FIVE FEET\n</b>\nABOVE the floor level. The Accountant bounces from the floor\nof the car to the ceiling, then back to the floor.\n\nLaughlin leans across the reception desk in great pain. He\nsees the suspended car through the iron grill door.\n\nThe Accountant lies completely still on the floor of the\nelevator. His head and neck twisted at an oblique angle.\n\n<b>DOC ON THE THIRD FLOOR LANDING\n</b>\nHE JAMS SEVERAL SHELLS INTO HIS RIOT GUN WHILE HOLDING his\n.45 ready for an appearance by Swain. Reloading completed, he\nstands, with Carol. He again begins to move upward.\n\n<b>SWAIN FIRES FROM THE STAIRWELL\n</b>\nDOC STOPS, SETS BOTH THE RIOT GUN AND THE .45 on 562 the\nbanister... He waits... on the winding staircase below him\nthere is a dark movement.\n\n<b>DOC FIRES BOTH GUNS\n</b>\nTHE STAIRWELL AROUND SWAIN DISINTEGRATES. The thug is\nobliterated by the firepower.\n\nDOC CANNOT SEE THE EFFECT OF HIS SHOTS. He again resumes his\nflight upward.\n\n<b>INT. DOC'S BATHROOM\n</b>\nRUDY HOLDS HIS BLOODY HEAD IN THE SINK BOWL, DUMBLY splashing\nwater over himself. Carol's underwear is still present.\nRudy's pistol lies on the soap tray.\n\nTHE LANDING AS DOC AND CAROL COME POUNDING INTO VIEW. No\nfurther avenues open, they turn down the corridor. Doc grabs\nCarol and pushes her into the room, past Fran; he kicks the\ndoor shut.\n\n<b>INT. THE ROOM\n</b>\nDOC GRABS THE SUITCASE, RUNS TO THE WINDOW, TEARS off the\nshade, lifts the frame, looks. The drop is too far. He grabs\nCarol and runs into the hallway.\n\n<b>INT. CORRIDOR\n</b>\nTHEY RUN DOWN TWO DOORS AND BREAK IN. Over the door is the\nsign \"Fire Escape.\"\n<b>\n</b><b>                                                         105.\n</b>\n\n\n<b>INT. FIRE ESCAPE ROOM\n</b>\nDOC HELPS CAROL OUT ONTO THE FIRE ESCAPE. He aids her with\nhis left hand, the riot gun now clutched tightly in his\nright. He motions, she hands him the suitcase and follows.\n\n<b>EXT. FIRE ESCAPE\n</b>\nTHEY DESCEND THE FIRE ESCAPE. They reach the end. The fire\nescape stays rigid.\n\nDoc cautiously steps on to the tilted steps. He turns and\nwith the suitcase crosses to the end. Throws the bag and the\nshotgun across the 6 foot gap to the retaining wall,\npreparing to jump.\n\nRUDY COMES OUT OF THE ROOM ONTO THE FIRE ESCAPE holding his\n.44. He looks down at Doc, then slowly raises his gun. Carol\nscreams.\n\nDOC JUMPS. RUDY FIRES. DOC IS HIT IN THE SIDE (flesh wound).\nIn the air he spins and lands. Rudy fires again and again as\nhe runs down the fire escape. Doc rolls, picks up the shotgun\nand fires.\n\nRUDY'S TIME HAS COME. THE JUMBO CHARGES MASH HIM BACK against\nthe wall and off the fire escape.\n\nCAROL RUNS ALMOST STAGGERING AND GETS READY TO JUMP the six\nfeet.\n\nTHE FIRE ESCAPE. BEGINS TO SINK. CAROL LOOKS AT DOC mutely,\nas she sinks beneath the retaining wall.\n\n<b>                    DOC\n</b>              (his hand out)\n          Jump!\n\nAnd she does. He catches her and pulls her up.\n\nThey look at one another for a long moment, then he stands\nand helps her to her feet, and leaving the shotgun behind\nthey walk into the alley.\n\n<b>RUDY LIES DEAD BEHIND THEM\n</b>\nIN A PARKING LOT AT THE END OF THE ALLEY, SLIM, a tough,\ngrizzly Western is about to pull out. Doc opens the back door\nand Carol gets in. Doc opens the front door as Slim turns and\nlooks at him.\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                         106.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>              (.45 in hand, pointing)\n          Drive.\n\n<b>                    SLIM\n</b>          Suit yourself.\n\nHe lets out a yell and guns across the lot over the four foot\ndrop to the sidewalk and into and off a car and into the\nstreet.\n\n<b>                    SLIM (CONT'D)\n</b>              (grinning)\n          How was that?\n\n<b>                     DOC\n</b>              (smiling in spite of himself)\n          Just fine.\n\n<b>                    SLIM\n</b>          Where we go in1?\n\n<b>                    DOC\n</b>          Mexico. I'd like to find a quiet place to\n          cross.\n\n<b>                      SLIM\n</b>          Why not?\n\nThe car pulls forward as the light blinks to green.\n\n<b>EXT. STREET\n</b>\nAS THE CAR PASSES AN INTERSECTION, SEVERAL POLICE cars can be\nseen arriving at the front of Laughlins.\n\nThe car continues moving up the street, then makes a right\nonto a larger boulevard.\n\nDoc half turns to Carol.\n\n<b>                      DOC\n</b>          You okay?\n\n<b>                    CAROL\n</b>              (nodding)\n          Where do we go from here?\n\n<b>                    DOC\n</b>          I don't know, airport I guess.\n\n\n\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>                                                          107.\n</b><b>CONTINUED:\n</b>\n\n<b>                    CAROL\n</b>          They will have our description before we\n          can get a plane.\n\n<b>                    DOC\n</b>              (way down)\n          Yeah.\n\n<b>                    SLIM\n</b>          I guess you ain't gonna shoot me, are\n          you?\n\n<b>                    DOC\n</b>          I kinda doubt it.\n\nSlim is obviously pleased that some excitement has come into\nhis life.\n\n<b>                    SLIM\n</b>          That's good... I'll cooperate, don't\n          worry about that... yes sir, I've had\n          some trouble with the law myself.\n\nDoc and Carol look at the man.\n\n<b>                    SLIM (CONT'D)\n</b>          Three years ago I dynamited some fish at\n          the reservoir.\n\n<b>                     CAROL\n</b>              (beginning to laugh)\n          Oh my God.\n\n<b>                    SLIM\n</b>          That little job cost me a hundred\n          dollars... didn't even get to keep the\n          fish.\n\n<b>                    DOC\n</b>              (resigned to the insanity of\n               the moment)\n          Let's just get to the border.\n\n<b>                    SLIM\n</b>          Sure thing, mister, it's coming right up.\n          'Bout an hour. Quiet crossing that is.\n\n<b>EXT. CASETA BRIDGE CROSSING - DAY\n</b>\n<b>THE AMERICAN OFFICIALS SIMPLY WAVE THE CAR BY.\n</b>\nAt the white line a Mexican CUSTOMS OFFICER emerges from the\nstation house. As he looks inside the car:\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                            108.\n</b><b>CONTINUED:\n</b>\n\n<b>                     OFFICIAL\n</b>           Buenas tardes... Your destination.\n\n<b>                     SLIM\n</b>               (speaking right up)\n           Chihuahua... gonna do some sightseeing.\n\nThe Official smiles and motions them past.\n\n<b>INT. CAR\n</b>\n<b>AS IT HEADS INTO CHIHUAHUA ON THE MEXICAN SIDE.\n</b>\n<b>                        SLIM\n</b>           Which way?\n\n<b>                     DOC\n</b>           Juarez - Chihuahua City road.\n\n<b>                     SLIM\n</b>           Don't you want to go to the airport?\n\n<b>                        DOC\n</b>           Not now.\n\n<b>                     CAROL\n</b>           How long before this car's hot?\n\n<b>                      DOC\n</b>               (after a moment)\n           Pull over.\n\nSlim stops the car near the soft shoulder of the dirt road.\nDoc looks at Slim.\n\n<b>                      DOC (CONT'D)\n</b>               (continuing)\n           Listen... how much money did you make\n           this year?\n\n<b>                     SLIM\n</b>               (slightly offended)\n           What's it to you?\n\n<b>                     DOC\n</b>               (patient)\n           Come on. How much?\n\n<b>                     SLIM\n</b>           'Bout five thousand.\n\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                           109.\n</b><b>CONTINUED:\n</b>\n\n<b>                    DOC\n</b>          How about if I buy your car for ten\n          grand?\n\n<b>                    SLIM\n</b>          You serious?\n\n<b>                      DOC\n</b>          Sure am.\n\n<b>                    SLIM\n</b>          And I keep my mouth shut?\n\n<b>                    DOC\n</b>          That's what I want.\n\n<b>                    SLIM\n</b>          I don't report the car and I don't know\n          either of you?\n\n<b>                    DOC\n</b>          You got it.\n\n<b>                    SLIM\n</b>          How about twenty thousand?\n\n<b>                    -DOC\n</b>          How about thirty?\n\n<b>                    SLIM\n</b>              (delighted)\n          Done, by God.\n\nDoc turns to Carol.\n\n<b>                    DOC\n</b>          Pay the man.\n\nAs she begins to open the suitcase...\n\n<b>A WAD OF MONEY DISAPPEARING INTO SLIM'S POCKET\n</b>\n<b>DOC LOOKS AT SLIM\n</b>\n<b>                    DOC\n</b>          You're going to have to walk back to the\n          border.\n\n<b>                    SLIM\n</b>          Don't worry about me, I'll grab a cab...\n          I can afford it, you know.\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                            110.\n</b><b>CONTINUED:\n</b>\n\nSlim steps out of the car, Carol moves into the front seat as\nDoc slides behind the wheel.\n\n<b>                    SLIM (CONT'D)\n</b>              (continuing, leaning through\n               the window)\n          Hope you get to where you're going.\n\n<b>                    CAROL\n</b>          Thanks. Hope you do too.\n\n<b>                    SLIM\n</b>          By the way, you're getting a hell of a\n          car there, mister.\n\n<b>                    DOC\n</b>              (laughs)\n          Well, I paid a hell of a price. Now for\n          God's sake keep your mouth shut.\n\n<b>                    SLIM\n</b>              (his pride hurt)\n          Wish you hadn't said that. When Slim\n          Canfield's lips are sealed, they're\n          sealed.\n\n<b>                    DOC\n</b>              (smiles)\n          Go with God.\n\nDOC SLIPS THE CAR into gear.\n\n<b>                    SLIM\n</b>          One thing though... how do I explain this\n          to my wife?\n\n<b>                    CAROL\n</b>          Tell her you robbed a bank...\n\nThe car pulls forward. Slim waves goodbye, then turns and\nbegins walking back down the highway.\n\n<b>BACK INSIDE THE CAR, DOC ACCELERATES AWAY\n</b>\n<b>                    CAROL\n</b>          Are we going to make it?\n\n<b>                    DOC\n</b>          Hell, I don't know... but we sure gave it\n          a run.\n\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                            111.\n</b><b>CONTINUED:\n</b>\n\n<b>                      CAROL\n</b>                (positive with a small smile)\n           Whatever happens... we're going all the\n           way.\n\n<b>                     DOC\n</b>               (smiles)\n           Yeah, why not? We're the good guys.\n\n<b>                     CAROL\n</b>           I guess we are.\n\nAfter a moment:\n\n<b>                     DOC\n</b>           Why don't you try the news?\n\nCarol snaps on the radioj the voice of a Mexican announcer is\nheard.\n\n<b>                     CAROL\n</b>           No more news, from now on we're just\n           going to listen to music.\n\nShe spins the dial. Mariachi music comes on.\n\n<b>EXT. MAIN HIGHWAY\n</b>\n<b>AS THEY HIT THE MAIN HIGHWAY, DOC PULLS OFF AND STOPS.\n</b>\n<b>                       CAROL\n</b>           What now?\n\n<b>                       DOC\n</b>           We walk.\n\nTHEY ARE WALKING ALONG THE HIGHWAY, THE EDSEL IS now a dot in\nthe background. Another dot appears, grows bigger, as it gets\ncloser it is a bus. Very Mexican but very Greyhound in\nappearance.\n\nDoc and Carol turn, Doc flags it down.\n\nIt pulls to a stop, they board. The bus pulls out.\n\n<b>INT. BUS\n</b>\n<b>DOC PAYS AND THEN FOLLOWS CAROL TO A SEAT.\n</b>\nThey sit. Mexico rolls by outside the window.\n\nThey look at each other and smile.\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                         112.\n</b><b>CONTINUED:\n</b>\n\n<b>                    VOICE (O.S.)\n</b>          Hey!\n\nDoc and Carol look back.\n\nTHE BLACK PANTHER IS LEANING OVER THE SEAT, his empty fist\ncocked up like a pistol. He grins.\n\n<b>                    BLACK PANTHER\n</b>              (pulling the trigger)\n          Bang!\n\nDoc and Carol look at him.\n\n<b>FREEZE FRAME.\n</b>\n<b>                                                    FADE OUT.\n</b>\n<b>THE END\n</b><b>\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Getaway, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Walter Hill\" title=\"Scripts by Walter Hill\">Walter Hill</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Getaway, The Script.html#comments\" title=\"Getaway, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:06:12.655230"}