{"title": "Ghost", "film_link": "/Movie Scripts/Ghost Script.html", "script_link": "/scripts/Ghost.html", "info_raw": "\n\nGhost Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.86 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Bruce Joel Rubin\nGenres  Romance  Thriller  Drama  Fantasy\nScript Date : September 1990\n\nRead \"Ghost\" Script\n\n\n", "script": "\n                                         \"GHOST\"\n\n                                      Screenplay by\n\n                                     Bruce Joel Rubin\n\n                                      SHOOTING DRAFT\n\n                \n\n               INT. TRIBECA LOFT - DAY\n\n               The CAMERA TRACKS slowly through clouds of moving dust. Shafts \n               of muted light pierce the dense atmosphere. An eerie \n               netherworld envelops us. Strange ghostly forms appear and \n               disappear in the distance. They seem like apparitions.\n\n               Broken timbers and dangling cables emerge from the smoky \n               light. We see hints of a huge demolished space.\n\n               An old white plaster wall FILLS THE SCREEN. Momentary blips \n               of light flash across it. SOUNDS of street traffic are heard \n               dimly in the distance.\n\n               With startling impact, the SOUND of a sledgehammer explodes \n               out of nowhere. The wall shudders.\n\n               HAMMER BLOWS assault the audience. They are loud and jarring. \n               The wall buckles.\n\n               Chunks of plaster CRASH to the floor. The air fills with new \n               swirls of white dust. The SLEDGEHAMMER smashes INTO VIEW. \n               Beams of sunlight cut through the cracks, piercing the \n               atmosphere like searchlights in a fog. A huge section of \n               wall falls toward camera as more plaster billows into the \n               air. We hear voices talking.\n\n                                     MOLLY (O.S.)\n                         What a mess!\n\n                                     SAM (O.S.)\n                         I told you!\n\n               Through jagged holes we can make out three dim figures on \n               the other side of the wall, all wielding SLEDGEHAMMERS.\n\n                                     SAM\n                         I can't breathe.\n\n                                     MOLLY\n                         Use your mask, dummy.\n\n               One of the figures adjusts something over his face. Isolated \n               rays of sunlight dance around him casting long shadows in \n               the air.\n\n                                     SAM\n                              (singing)\n                         \"Volga boat..., man.\" Whoomph!\n\n               His hammer pounds the wall. Molly laughs.\n\n               ANGLE\n\n               The CAMERA MOVES IN and for the first time we see them. MOLLY \n               JENSEN, in her late 20's, has a bandanna around her hair and \n               a workman's mask over her nose, but we can tell from her \n               eyes and cheekbones that she is beautiful. SAM WHEAT, in his \n               late 30's, is also hidden behind a mask, but he has a strong \n               forehead and handsome features. Sweat is dripping down his \n               brow, leaving streaks in the dust. CARL BRUNER, early 30's, \n               removes his mask revealing a good looking young man with a \n               fashionable two-day stubble. Both men have their shirts off.\n\n                                                                    CUT TO:\n\n               ANGLE\n\n               BLACKNESS AND A LOUD THUD. Suddenly a shaft of light \n               penetrates the darkness. Another thud and more light. We see \n               a hole. The hook of a crowbar enters it, grappling with \n               something around the edges. Then, with a tug and a loud yank, \n               a huge section of tin ceiling crashes to the floor. Huge \n               clouds of dust fly into the air. Molly looks up, astonished.\n\n                                     MOLLY\n                         Sam, look, there's a whole eight \n                         feet up there.\n\n                                     SAM\n                         And about eighty years of dust.\n\n                                     MOLLY\n                         We have all this height, Sam. We \n                         could add a second floor and put our \n                         bedroom upstairs. That would leave \n                         all this space.\n\n                                     SAM\n                              (eyeing her curiously)\n                         For what?\n\n                                     MOLLY\n                         For space. Just space.\n\n                                     SAM\n                         Be great for bumper cars.\n\n               Carl laughs as he looks at Sam. Their bodies, covered with \n               white powder, appear as strange, ghostly figures.\n\n                                     CARL\n                         Sam, this may be none of my business, \n                         but I'm concerned you're doing too \n                         much coke.\n\n               Sam glances down at his white body. They all laugh.\n\n                                     MOLLY\n                         Hey, Sam, turn around.\n\n               Sam obeys. Molly doodles on his chest, drawing a bow tie and \n               the outline of a tuxedo jacket. Her lines are quick, \n               accomplished, and subtly erotic.\n\n                                     CARL\n                              (offering his body)\n                         How 'bout me?\n\n               Molly nods. She reaches out and superimposes an armless female \n               torso over his. His stomach jumps sensually as she touches \n               it. Molly pulls back to admire her work. He looks like a \n               Greek statue.\n\n                                     CARL\n                         I'll never wash again.\n\n               Molly laughs.\n\n               ANGLE\n\n               Sam, Molly, and Carl are holding their sledgehammers. Molly \n               begins to count.\n\n                                     MOLLY\n                         All together now. One,\n                              (they strike the wall \n                              with their hammers. \n                              The wall shakes)\n                         two,\n                              (they pound again. \n                              The wall begins to \n                              give)\n                         three.\n\n               In unison, they hit it once more. A massive section of plaster \n               and metal topples to the ground. New clouds of dust fill the \n               air. Suddenly, Sam spies an old jar lying on the floor. \n               Something rattles inside it, a penny.\n\n                                     SAM\n                         Hey, look what I found. There's a \n                         penny inside.\n                              (he hands it to Molly)\n                         For luck in our new loft. It's a \n                         good omen.\n\n                                     MOLLY\n                              (shaking her head, \n                              disagreeing)\n                         You're the good omen.\n\n               She glances at him lovingly. Carl looks at the two of them \n               and grins.\n\n               As the dust settles we see, for the first time, the outlines \n               of the space they are working in. It is a huge loft over \n               four thousand square feet. Banks of windows run east and \n               west. Molly steps back and admires the room.\n\n                                     MOLLY\n                         It's gorgeous.\n\n                                     CARL\n                         You guys lucked out. Hell, I bet you \n                         could sell it tomorrow and double \n                         your investment.\n\n                                     MOLLY\n                         Sell it? Carl, we just bought it.\n\n                                     CARL\n                         What I wouldn't do for a place like \n                         this.\n\n                                     SAM\n                         It's gonna be great.\n\n               OMITTED\n\n               EXT. MARKET SECURITY BANK & TRUST - HEADQUARTERS - DAY\n\n               It is morning rush hour. Sam and Carl, both wearing suits \n               and ties, exit the Wall Street subway station and approach \n               the Headquarters of Market Security Bank & Trust.\n\n                                     CARL\n                         Oh, by the way, Sam, I had to move \n                         your 3:00 with Bob Kahan to 4:00 so \n                         you could squeeze in Gary Alan. He \n                         called yesterday and said he has to \n                         see you today about the Danway stuff. \n                         Three o'clock was the only time he \n                         could make it. Also, the board meeting \n                         in L.A. has been confirmed for the \n                         12th. I got you on a 9:00 a.m. flight.\n\n               Sam seems preoccupied.\n\n                                     CARL\n                              (continuing)\n                         Hey, Sam, relax. This isn't brain \n                         surgery you're going into.\n\n                                     SAM\n                         I hate pitching to these Japanese \n                         guys. They make me nervous. I mean, \n                         what am I supposed to say, \"Who do \n                         you think'll win that big Sumo \n                         championship\"?\n\n                                     CARL\n                         Sam, you'll be fine. You're great \n                         with people.\n\n               Sam's jacket flares open. He is wearing yellow suspenders. \n               Carl notices.\n\n                                     CARL\n                              (continuing)\n                         Hey, nice. I like those.\n\n               Sam, not completely comfortable wearing them, buttons his \n               jacket.\n\n                                     SAM\n                         ...Molly.\n\n               Carl smiles and then turns to admire a car going by.\n\n                                     CARL\n                         Jesus, look at that, a Testerossa. \n                         That's the car I'm gonna drive when \n                         I'm making two hundred grand.\n\n                                     SAM\n                         Better pay off your Mustang first.\n\n               INT. BANK HEADQUARTERS, ELEVATOR - DAY\n\n               Sam and Carl are standing on a crowded elevator. It is deadly \n               quiet. Suddenly Carl elbows Sam and winks. There is something \n               he wants him to do. Sam hesitates a moment, annoyed, and \n               then relents. He clears his throat.\n\n                                     SAM\n                         So Carl, what did the doctor say?\n\n                                     CARL\n                         He said it was contagious. Very \n                         contagious. I shouldn't be going \n                         into work today.\n                              (he coughs loudly)\n                         But what could I do?\n\n               He sneezes. People on the elevator freeze.\n\n                                     SAM\n                         And what about the rash?\n\n                                     CARL\n                         Not good. It's spreading everywhere.\n\n                                     SAM\n                         On your genitals again?\n\n                                     CARL\n                         Everywhere. He said be sure not to \n                         touch anyone.\n\n               We see people trying to inch away. Carl coughs again. They \n               hold their breath. The elevator stops at the next floor. All \n               the passengers get off.\n\n               INT. BANK HEADQUARTERS, EXECUTIVE OFFICES - DAY\n\n               Sam and Carl, laughing, walk through a large office area \n               bustling with activity. Employees, in various cubicles, are \n               talking on telephones and punching information into computers.\n\n               Sam heads into his executive office. Carl steps into a cubicle \n               across the aisle. ROSE, Sam's secretary, approaches him.\n\n                                     ROSE\n                         Morning, Mr. Wheat.\n\n                                     SAM\n                         Morning Rose. Listen, when the \n                         Kobiashi people arrive, have Elenore \n                         take them right to the...\n\n                                     ROSE\n                         They're already here.\n\n               She points to a windowed conference room. Sam turns around \n               and sees a large group of JAPANESE MEN standing inside.\n\n                                     SAM\n                         They're early!\n\n                                     ROSE\n                         I know. And Andy Dillon called. He \n                         said they need $900,000 transferred \n                         to Albany by noon.\n\n                                     SAM\n                         Noon? Damn!\n\n               He hurries over to Carl's cubicle. He is on the phone. Carl \n               cups the mouthpiece.\n\n                                     CARL\n                         Hold on.\n\n                                     SAM\n                         Listen, Dillon needs $900,000 in \n                         Albany by noon. Can you transfer it \n                         to his payroll account?\n\n                                     CARL\n                         Sure. Just let me have your MAC code.\n\n               Sam pulls out his wallet and extracts a small address book. \n               He jots the code numbers on a piece of paper and hands it to \n               Carl.\n\n                                     SAM\n                         Discretion, huh?\n\n                                     CARL\n                         You bet. I'll do it right away.\n\n               INT. WELL-APPOINTED EXECUTIVE BOARDROOM - DAY\n\n               Sam and a group of fifteen somber Japanese businessmen are \n               sitting around a large granite conference table. Sam stands \n               up and speaks a simple greeting to them.\n\n                                     SAM\n                              (in Japanese)\n                         Good morning, Gentlemen. On behalf \n                         of Market Security Bank & Trust, I \n                         welcome you to our city.\n\n               The men smile happily and nod their heads in unison.\n\n                                     MEN\n                         Arigato.\n\n               They look to Sam, expecting more. Uncomfortable, he clears \n               his throat.\n\n                                     SAM\n                         I'm afraid that's the only Japanese \n                         I know. But I realize it's not our \n                         language fluency, or lack of it, \n                         that brings you to Market Security. \n                         Rather, I'm sure, it is our banking \n                         expertise, our ability to represent \n                         and anticipate all of your banking \n                         needs. As you know, we are not the \n                         largest banking establishment in New \n                         York.\n                              (his throat goes dry \n                              and he takes a sip \n                              of water)\n                         But, with combined assets of over \n                         200 billion dollars, we have a firm \n                         commitment to the international \n                         marketplace.\n\n               A SECRETARY enters the room and hands Sam a piece of paper. \n               It reads \"MOLLY ON LINE 2. URGENT.\" She hands him a phone.\n\n               Sam looks surprised. He nods apologetically to his guests.\n\n                                     SAM\n                         Excuse me.\n                              (he picks up the \n                              receiver)\n                         Hello?\n\n                                                                    CUT TO:\n\n               MOLLY\n\n               dressed in a long, clay covered smock. She is in a potters \n               studio. SEVERAL OTHER POTTERS are in the background working \n               at their wheels. A five-foot high ceramic vase stands beside \n               Molly. It is still wet. She toys with it as she speaks into \n               the phone.\n\n                                     MOLLY\n                         A man and a woman are lying in bed \n                         when the woman's husband suddenly \n                         comes home. Frightened, she tells \n                         the man he has to leave instantly \n                         through the window. He has no time \n                         to dress.\n\n                                                               CUT BACK TO:\n\n               SAM\n\n               straight-faced, listening and trying to look as if it is \n               important.\n\n                                     SAM\n                         Uh hmm.\n\n                                     MOLLY (V.O.)\n                         It's raining outside. The man, running \n                         naked along the street, sees some \n                         joggers approaching.\n\n               The entire contingent of Japanese men is staring at Sam.\n\n                                     MOLLY (V.O.)\n                              (continuing)\n                         One of the joggers calls out. \"Hey, \n                         do you always go jogging naked?\" And \n                         the man says, \"Yes, always.\"\n\n                                     SAM\n                         Okay.\n\n                                     MOLLY (V.O.)\n                         And then the other jogger says, \"And \n                         do you always wear a condom?\" The \n                         man looks down, embarrassed, and \n                         replies, \"Only when it's raining.\"\n\n               Sam squelches a smile.\n\n                                     SAM\n                         Well, that's just fine.\n\n                                     MOLLY (V.O.)\n                         Now just relax and have fun, okay? \n                         It's not the end of the world if you \n                         lose this account. You've always got \n                         me.\n\n                                     SAM\n                         Thank you. I'll remember that.\n\n                                     MOLLY (V.O.)\n                         See ya.\n\n               He hangs up and stares at the Japanese men. A short smile \n               crosses his face.\n\n                                                                    CUT TO:\n\n               A CARVED WOODEN ANGEL\n\n               eight feet tall, ascending into an afternoon sky. As the \n               CAMERA PULLS BACK we see that we are inside a building and \n               that the angel is dangling outside an open doorway high above \n               the street.\n\n               A group of workmen grab for the angel, but have difficulty \n               bringing it in. Suddenly Molly steps INTO the FRAME.\n\n                                     MOLLY\n                         Where you guys from, the New York \n                         City Ballet?\n\n               With a gutsy maneuver, Molly leans out over the sidewalk and \n               tries to grab hold of the ropes. She can't reach them. \n               Suddenly a pair of hands grabs her around the waist. She \n               screams.\n\n                                     SAM\n                         Saved your life.\n\n               Sam laughs as he pulls her back into the loft. She does not \n               think it is funny.\n\n                                     MOLLY\n                         You bastard. Don't do that to me. \n                         You scared me half to death.\n\n                                     SAM\n                         Better than seeing this gorgeous \n                         body splattered all over the street. \n                         Here, look out.\n\n               Sam jumps up, grabs hold of the door's top molding, and swings \n               out over the sidewalk. Molly gasps. Sam's feet push at the \n               angel and send it swinging away and then back toward the \n               loft. Quickly he jumps back, grabs hold of it, and brings it \n               in. The workmen applaud. Molly eyes him with admiration.\n\n               Suddenly we hear a voice call out.\n\n                                     CARL (O.S.)\n                         Sam? Molly? Anybody home?\n\n               Molly looks to Sam.\n\n                                     MOLLY\n                         Carl? Did you invite him?\n\n                                     SAM\n                              (under his breath)\n                         I couldn't keep him away.\n\n               Carl enters, shakes Molly's hand, and pats Sam on the back.\n\n                                     CARL\n                         Hi, Moll. Hi, Sam. So, how's it goin?\n\n               Before they can answer, a WORKMAN turns to Molly.\n\n                                     WORKMAN (V.O.)\n                         Where do you want this?\n\n                                     MOLLY\n                         In the bedroom.\n\n               INT. LOFT - DAY\n\n               As the angel pulls away from camera, we see the newly \n               decorated loft for the first time. It is painted now in lovely \n               pastels. The floor, a huge gymnasium-like expanse, is \n               lacquered with polyurethane. Furniture and boxes are piling \n               up along the walls. Dominating the space, with a kind of \n               surreal presence, are a large number of Molly's sculptures \n               and ceramics. There is also a vintage jukebox. Carl is \n               impressed.\n\n                                     CARL\n                         Wow! The place looks great. Really \n                         great.\n\n                                     MOLLY\n                         You like it, huh?\n\n                                     CARL\n                         \"Like\" is hardly the word. I never \n                         imagined it would be this beautiful. \n                         This is incredible.\n\n               A mover lugs in a heavy old chair. Molly sees it.\n\n                                     MOLLY\n                         Sam, you kept that chair?\n\n                                     SAM\n                         What do you mean? It's comfortable. \n                         For T.V. I love that chair.\n\n                                     MOLLY\n                         But it doesn't go with anything.\n\n                                     SAM\n                         It goes with me.\n\n                                     MOLLY\n                         It's okay, I'll paint it.\n\n               Sam pinches her ass. Molly smiles.\n\n               INT. KITCHEN - DAY - LATER\n\n               Sam, Molly, and Carl are sprawled out on the floor, eating \n               from Cartons of Chinese food. Frank, a gray cat, eats beside \n               them. Unpacked boxes are scattered everywhere.\n\n                                     SAM\n                         It was the middle of December. I was \n                         sitting in my old office, the one \n                         Charlie's in. Suddenly, I heard this \n                         woman screaming. I thought someone'd \n                         been shot or something.\n\n                                     MOLLY\n                         They took away my MasterCard. It was \n                         Christmas, for godssake.\n\n                                     SAM\n                         She was four thousand dollars over \n                         her limit.\n\n                                     MOLLY\n                         It wasn't four thousand. And I'd \n                         already sent in the payment! You're \n                         the ones that lost it.\n\n                                     SAM\n                         She's still angry.\n\n                                     MOLLY\n                         No I'm not.\n\n               The cat begins nibbling Sam's food.\n\n                                     SAM\n                         Get outta here, Frank!\n                              (the cat scampers \n                              away)\n                         You should have seen her. All pink \n                         and flushed. Her skin was gorgeous, \n                         like a rose. And she's screaming, \n                         demanding to see the president. So \n                         Wilton brought her to me.\n\n                                     CARL\n                         You? You weren't even a VP yet.\n\n                                     SAM\n                         She didn't know that.\n\n               Carl smiles.\n\n                                     MOLLY\n                         Can you believe it? And the next \n                         thing I know, he's telling me his \n                         life story. I couldn't believe it. \n                         Everything. About his divorce, how \n                         he'd just arrived in New York, how \n                         he didn't know any women. And all \n                         with this Montana accent.\n\n                                     SAM\n                         What's a Montana accent?\n\n                                     MOLLY\n                         The one you always slip into it when \n                         you get nervous. \"Yes, Ma'am. Thank \n                         you, Ma'am. Can I fondle your breasts, \n                         Ma'am?\"\n\n                                     SAM\n                              (laughing)\n                         I wasn't nervous.\n\n                                     MOLLY\n                         Admit it. You liked me. You were \n                         interested.\n\n                                     SAM\n                              (matter of factly)\n                         I thought you were cute.\n\n                                     MOLLY\n                         Cute?\n                              (looking at Carl)\n                         Do you believe this? I should have \n                         been Picasso's mistress. I should \n                         have been living in Barcelona or \n                         Paris. But no, I'm moving in with a \n                         New York banker who thinks I'm cute.\n\n               She looks at Sam and grins. Carl is staring at Molly, \n               obviously turned on by her. He is embarrassed when she catches \n               his gaze and quickly looks away.\n\n               OMITTED\n\n               INT. MOLLY'S STUDIO - NIGHT\n\n               Molly, dressed only in a T-shirt, is sitting at her potters \n               wheel throwing a series of pots. Sam enters the studio. He \n               is barefoot, shirtless, wearing jeans.\n\n                                     SAM\n                         What are you doing?\n\n                                     MOLLY\n                         I felt inspired.\n\n                                     SAM\n                         At 2:00 am?\n\n               She nods and presses her hands into a pot that is forming in \n               front of her. Sam watches the sensual movement of her fingers, \n               molding and forming the clay. She is forceful, assured, \n               gifted. The clay responds to her slightest effort. Slowly, \n               almost unconsciously, Sam reaches for her shoulders and begins \n               kissing them.\n\n                                     SAM\n                              (continuing)\n                         You notice Carl's eyes today? They \n                         were all over you.\n\n                                     MOLLY\n                         What? Are you jealous? Sam, let me \n                         tell you something. He's not even \n                         looking at me. It's you he idolizes. \n                         He doesn't see me at all... Anyway, \n                         he's not my type.\n\n               Sam reaches over her and gently adds his fingers to the clay. \n               Molly looks up at him.\n\n                                     MOLLY\n                              (continuing)\n                         What are you doing?\n\n                                     SAM\n                         I feel inspired.\n\n               His hands dig into the clay. Molly smiles. Their fingers \n               seem to dance together. After a moment, she reaches up to \n               him, her clay-covered fingers streaking his face and curving \n               down to his chest. Sam grins and reaches down to her.\n\n                                                              MATCH CUT TO:\n\n               SAM'S FINGER\n\n               as it presses two buttons on his jukebox. We watch as the \n               mechanical arm selects a record and slowly, sensuously, lowers \n               it to the turntable. The arm hovers over the record and then \n               descends. It begins to play. The song is \"Unchained Melody\" \n               by the Righteous Brothers.\n\n               SAM AND MOLLY\n\n               are dancing in the middle of the dark loft. Moonlight pours \n               through the windows and shines off the floor. Wads of packing \n               paper swirl sensuously around their feet.\n\n               Molly runs her fingers down Sam's naked back. The moment is \n               sweet and erotic. We watch as Sam slowly draws his fingers \n               down over Molly's face, gently caressing her forehead, her \n               eyes, her lips.\n\n               Sam slides his hands under Molly's T-shirt, slowly moving \n               them toward her breasts. Her breathing slows. They dance \n               silently, her hair swaying in the soft light.\n\n               We hear the sounds of their bare feet on the highly polished \n               floor.\n\n               Sensuously, Molly's shirt lifts above her navel as Sam presses \n               into her. Their stomachs touch and part and touch again. She \n               bites her lip. Sam eyes her moonlit form as she strokes his \n               chest, slowly moving her fingers down his torso, around the \n               curve of his hips, and then digging into the back of his \n               jeans.\n\n               Sam leans into Molly and nips at her neck. She stops dancing. \n               Her eyes close. She stands absolutely still. Sam's hands \n               move to her backside. He pulls her closer.\n\n                                                                  DISSOLVE:\n\n               LIVINGROOM - NIGHT\n\n               SAM AND MOLLY, making love on the livingroom carpet. Paper \n               and packing materials crumble beneath them and scatter across \n               the floor. For all their sensuality, it is their hands and \n               eyes that are most expressive, revealing a tenderness that \n               is deeply moving. Their lovemaking is full of love.\n\n               JUKEBOX\n\n               The song ends. The jukebox arm retracts and gently slides \n               the record back into its slot.\n\n                                                                  DISSOLVE:\n\n               OMITTED\n\n               BEDROOM - NIGHT\n\n               Sam and Molly are lying together silently. Molly gazes at \n               him.\n\n                                     MOLLY\n                         What's the matter?\n\n                                     SAM\n                         The matter?\n\n                                     MOLLY\n                         I can tell.\n\n                                     SAM\n                         Nothing... really.\n\n                                     MOLLY\n                         You're worried, aren't you? About \n                         moving in together?\n\n                                     SAM\n                         No. Not really.\n\n                                     MOLLY\n                         Then what? The promotion?\n\n                                     SAM\n                         I don't know. A lot of things. I \n                         just don't want the bubble to burst... \n                         Whenever something good happens to \n                         me I'm just afraid I'm going to lose \n                         it.\n\n               Molly gently strokes his head.\n\n                                     MOLLY\n                         You know what?\n\n                                     SAM\n                         What?\n\n                                     MOLLY\n                         I love you. I really love you.\n\n               He smiles and strokes her cheek.\n\n                                     SAM\n                         Ditto.\n\n               Suddenly the T.V. blares into the room. Sam jumps up, grabbing \n               the remote control unit from under his buttocks. Molly laughs \n               as he turns the SOUND DOWN. The news is on and they are \n               showing the remains of an airline disaster. Sam stares at \n               the tube.\n\n                                     SAM\n                         Oh Jesus. Another one.\n\n                                     MOLLY\n                         Don't watch that stuff.\n\n               He motions to wait. Dead bodies litter the screen.\n\n                                     CORRESPONDENT\n                         ...It is estimated that 34 people \n                         died in the crash, the second in \n                         less than two weeks.\n\n               The T.V. goes OFF. Sam, confused, spins around. Molly is \n               holding the remote control. She nods for him to lie down.\n\n                                     SAM\n                         I should cancel my L.A. trip... These \n                         things always happen in threes.\n\n                                     MOLLY\n                         Threes? Sam, get serious. Besides, \n                         you lead a charmed life.\n\n                                     SAM\n                         Yeah. So did they.\n\n               Sam looks at her and then back at the screen.\n\n                                     SAM\n                              (continuing)\n                         Amazing, huh?\n                              (he snaps his fingers)\n                         Just like that. Blackout.\n\n               EXT. WALL STREET ESTABLISHING SHOT - DAY\n\n               OMITTED\n\n               INT. SAM'S OFFICE - DAY\n\n               Sam is sitting at his computer. His address book with his \n               access codes is sitting open beside him. He seems perplexed \n               by something happening on the screen. After pushing a series \n               of buttons and getting the same response, he whacks the \n               computer on the side. Carl, walking in the door, sees him. \n               Sam looks up sheepishly.\n\n                                     SAM\n                         A glitch. What's up?\n\n                                     CARL\n                         The Mark Greenberg and Larry White \n                         accounts. I can't get in. Your MAC \n                         code doesn't work.\n\n                                     SAM\n                         I changed it.\n\n                                     CARL\n                         Why? What's up?\n\n                                     SAM\n                         Nothing. I just want to nose around \n                         a bit... Can you keep your mouth \n                         shut?\n\n                                     CARL\n                         Yeah, sure. Tell me, what's going \n                         on.\n\n                                     SAM\n                         I think I've stumbled onto something. \n                         There's too much money in these \n                         accounts.\n\n                                     CARL\n                         Too much money. That's ridiculous. \n                         How could there be too much money?\n\n                                     SAM\n                         That's what I keep asking myself.\n\n                                     CARL\n                         It must be the computer.\n\n                                     SAM\n                         I've been checking.\n\n                                     CARL\n                         Yeah, Mr. Fixit.\n                              (he hits the computer \n                              like Sam did and \n                              laughs)\n                         Come on, move over. Let me see what \n                         I can do.\n\n                                     SAM\n                         Not yet. I'm gonna dig around a bit.\n\n                                     CARL\n                         Okay, okay. Just call me when you're \n                         ready for help.\n                              (he heads for the \n                              door)\n                         So, what are you and Moll doing \n                         tonight?\n\n                                     SAM\n                         We're going to the theatre. She wants \n                         to see \"Macbeth\" at the Spring Street \n                         Repertory.\n\n               Carl winces. Sam smiles.\n\n               INT. SPRING STREET REPERTORY - NIGHT\n\n               Sam and Molly are sitting in the fifth row of a crowded \n               auditorium. He is sound asleep.\n\n               ANGLE STAGE\n\n               A scene from \"Macbeth\".\n\n               Sam begins to snore. Molly grabs his nose. He jerks awake. \n               Molly grins.\n\n               EXT. SPRING STREET REPERTORY - NIGHT\n\n               Bright marquee lights sparkle overhead as Sam and Molly exit \n               the theatre. It is a beautiful brisk night.\n\n                                     SAM\n                         I loved it.\n\n                                     MOLLY\n                         I could tell.\n\n               She smiles and squeezes his arm. They walk silently down a \n               dark street, heading toward their loft. The pavement is full \n               of shadows.\n\n                                     MOLLY\n                              (continuing)\n                         Did I tell you what Marcia said?\n\n                                     SAM\n                         Six times.\n\n                                     MOLLY\n                         Six? No I didn't. Sam, don't be so \n                         blasé. I'll have two major pieces in \n                         the show. The New York Times reviews \n                         her gallery all the time. This could \n                         be huge.\n\n                                     SAM\n                         Molly, the \"New York Times\" is some \n                         frustrated little critic with pimples \n                         on his ass who flunked out of art \n                         school. Who cares what The New York \n                         Times thinks?\n\n                                     MOLLY\n                         Eight million readers, that's who.\n\n                                     SAM\n                         Your work's beautiful. That's a fact, \n                         Moll. It doesn't matter what anyone \n                         thinks.\n\n               We can tell from the expression on Molly's face that it does. \n               Sam puts his arm around her. She nestles close to him. Then, \n               suddenly, she stops and looks up. There is an unexpected \n               seriousness in her voice.\n\n                                     MOLLY\n                              (continuing)\n                         I want to marry you, Sam.\n\n                                     SAM\n                              (taken aback)\n                         What?\n\n                                     MOLLY\n                         I've been thinking about it for days. \n                         More than thinking. I want to do it. \n                         I want to jump in whole hog...\n                              (she pauses)\n                         What is that look for?\n\n                                     SAM\n                              (staring at her)\n                         It's just been so long since... I \n                         mean, you never wanted to talk about \n                         it.\n\n               There is a long pause.\n\n                                     MOLLY\n                         Do you love me, Sam?\n\n                                     SAM\n                         What do you think, Moll?\n\n                                     MOLLY\n                         How come you never say it?\n\n                                     SAM\n                         What are you talking about?\n\n                                     MOLLY\n                         You say \"ditto\". It's not the same.\n\n                                     SAM\n                         People say \"I love you\" all the time. \n                         It doesn't mean anything.\n\n                                     MOLLY\n                         Sometimes you need to hear it.\n\n               Sam stops and stares at Molly. He pauses quietly. He is about \n               to speak when A MAN'S FACE emerges from the shadows behind \n               him. Molly gasps. Sam spins around.\n\n               AN INTENSE LOOKING MAN\n\n               is standing in the darkness between two buildings. He stares \n               at the couple for a moment and then steps onto the sidewalk. \n               Sam and Molly stand motionless. The man hesitates and then \n               begins walking the other way. Molly exhales a deep breath.\n\n               Sam takes Molly's arm and they continue briskly down the \n               street. Suddenly they hear FOOTSTEPS coming after them.\n\n                                     MOLLY\n                         What should we do?\n\n                                     SAM\n                         Let me handle this.\n\n               Sam stops abruptly and turns around. A gun is staring him in \n               the face. Molly screams.\n\n                                     WILLIE\n                         Your wallet!\n\n               Sam waits a beat.\n\n                                     MOLLY\n                         Give it to him!\n\n               Sam reaches for his jacket. The Mugger grabs his wrist and \n               then carefully pulls the wallet out himself.\n\n                                     SAM\n                         Take the money. Just leave the wallet \n                         and my...\n\n               He swipes Sam across the head. Molly screams. The Mugger \n               whacks her across the face. Sam explodes, plowing into the \n               mugger with all his might.\n\n                                     MOLLY\n                         Sam, No!\n\n               There is a wild, all out brawl. Sam fights like a mad man. \n               Suddenly the GUN goes off. The Mugger panics and takes off \n               running. Sam charges after him.\n\n                                     MOLLY\n                         Sam!!!!!\n\n               The two men run down the dark street, but the Mugger is \n               already a full block ahead and disappears into the shadows.\n\n               Sam gives up. Slowly he turns and begins walking back toward \n               Molly.\n\n               We can see Molly dimly at the end of the block as Sam \n               approaches. She is screaming for help. Frightened, Sam calls \n               out.\n\n                                     SAM\n                         Molly!\n\n               She doesn't answer. Sam tenses and starts running toward \n               her. He is just three feet away when suddenly he stops. An \n               expression of pure terror overwhelms his face.\n\n                                                                    CUT TO:\n\n               CLOSEUP - MOLLY\n\n               drenched in blood. Her eyes are glazed, on the verge of shock. \n               Panting, she stoops down to the curb as THE CAMERA TRAVELS \n               WITH HER. She grabs hold of something lying in the shadows \n               and pulls it toward her.\n\n               It is Sam's dead body she is holding in her arms.\n\n               Sam's ghostly form, still solid to all appearances, stands \n               beside Molly. His eyes are awash in horror and confusion. He \n               seems unable to move. THE CAMERA HOLDS on his face as the \n               full impact of his situation dawns in his eyes.\n\n               Suddenly he lets out a blood-curdling scream.\n\n                                     SAM\n                         No!!!!!!\n\n               He jumps down toward his body and reaches out to grab hold \n               of his motionless form. His hands make a strange SOUND as \n               they pass right though it. It is terrifying. Sam jumps up, \n               crazed, frenzied, and begins circling Molly. It is as though \n               he is trying to undo what has been done.\n\n                                     SAM\n                              (continuing)\n                         This isn't happening. It's not \n                         happening.\n\n               He reaches out to Molly for help. His hand cuts through her \n               shoulder. He screams.\n\n               FOOTSTEPS. People are running down the street. The sound of \n               SIRENS can be heard in the distance. Two MEN run toward Sam. \n               He yells out at them.\n\n                                     SAM\n                              (continuing)\n                         Help me!\n\n               They run right through him. He gasps in stunned terror.\n\n               Sam watches helplessly as they reach his body. Molly looks \n               up and begins screaming hysterically. One of the Men grabs \n               her as the other goes for Sam's wrist. There is no sign of \n               life.\n\n               The first Man holds Molly back as his friend stoops down and \n               begins some form of cardio-pulmonary resuscitation. There is \n               no response. Sam bends down, trying desperately to help. It \n               is a futile gesture.\n\n                                     SAM\n                         Do it! Do it!\n\n               The Man bangs on Sam's chest. Blood gushes from the wound. \n               Molly recoils. He bangs again.\n\n                                                           CUT ABRUPTLY TO:\n\n               INT. LOFT - NIGHT\n\n               Sam shoots up in bed, panting. It is dark. He stares around \n               the loft in sudden confusion. With a lurch he flicks on the \n               night light. Molly is lying beside him, her head buried \n               beneath a pillow. Sam seems stunned.\n\n                                     SAM\n                         Molly? Molly!\n\n               Tears stream down his face. Molly stirs.\n\n                                     MOLLY\n                         Sam? What's the matter? Is something \n                         wrong?\n\n                                     SAM\n                         Molly!\n\n               Sam is so relieved to hear her voice that he can hardly \n               breathe.\n\n                                     MOLLY\n                         What is it, honey?\n\n               Molly, groggy, tries to sit up. Sam reaches out for her.\n\n               As she turns around, we see A SKELETEL VERSION OF HER HEAD \n               staring at the camera. It speaks.\n\n                                     MOLLY\n                              (mocking him)\n                         What is it, honey?\n\n               Sam bolts upright, screaming. It is a scream so consumed by \n               terror that one fears it will never stop.\n\n                                                       CUT UNEXPECTEDLY TO:\n\n               CLOSE-UP OF SAM\n\n               asleep in bed. He is thrashing at his pillow and moaning.\n\n               Suddenly, a hand reaches out and touches his shoulder. Sam \n               jumps straight up in bed and kicks wildly at the sheets.\n\n                                                                    CUT TO:\n\n               SAM'S P.O.V.\n\n               Molly is sitting on the bed looking at him, afraid.\n\n               Sam stares down at her. He is breathing heavily, not trusting \n               his own senses. His hands clutch at the wall.\n\n                                     SAM\n                         What's happening to me?!\n\n               ANGLE\n\n               Suddenly, a brilliant white light shoots into the room as a \n               host of glowing forms, radiating an intense inner light, \n               float before us. A blinding tunnel spirals in an infinite \n               vortex behind them. Sam is awed and confused. We sense that \n               the light is enchanting him. The entire room begins to \n               disappear in the light.\n\n               Molly screams.\n\n                                     MOLLY\n                         Don't leave me. I need you, Sam.\n\n               ANGLE\n\n               Sam turns and sees Molly, only she is not in the bed. She is \n               back on the street. To his amazement, he is on the street, \n               too, still bathed in the soothing light. Frightened, he calls \n               out to her.\n\n                                     SAM\n                         Molly!\n\n               She does not hear him. He calls again.\n\n                                     SAM\n                              (continuing)\n                         Molly.\n\n               There is no response. Sam, deeply troubled, hesitates for a \n               moment. He is torn between Molly and the light. Then, in a \n               painful, but conscious gesture, he turns from the light and \n               walks toward Molly. At that instant, the light behind him \n               disappears with the sound of a pneumatic door closing. There \n               is a sense of terrible finality as the tunnel evaporates \n               into the void. Sam is left on the dark pavement. He stands \n               there a moment, as if in shock, and then begins running toward \n               Molly. An AMBULANCE is rounding the corner.\n\n                                                                    CUT TO:\n\n               OMITTED\n\n               EXT. NEW YORK STREETS - NIGHT\n\n               Swirls of light speed toward the ambulance as car headlights \n               and streetlamps merge in a wild dizzying rush. The SIREN \n               wails into the night.\n\n               INT. AMBULANCE - NIGHT\n\n               Sam's body is lying in the back of the ambulance as a \n               PARAMEDIC applies electric paddles to his chest in an effort \n               to save him. After a moment, he looks up at Molly. We can \n               tell from the expression in his eyes that it is hopeless. \n               Sam yells.\n\n                                     SAM\n                         Don't stop! I'm not dead!\n\n               Molly, kneeling over Sam's body, grabs him and begins to cry \n               in long terrible sobs.\n\n               INT. HOSPITAL EMERGENCY ROOM - NIGHT\n\n               A DOCTOR, comforting Molly, accompanies her from one of the \n               emergency operating rooms and leads her through a pair of \n               swinging doors into a separate waiting area. We see TWO \n               POLICEMEN and TWO DETECTIVES stand up and approach her.\n\n               Sam doesn't want Molly to go and begins to follow her, but \n               then seems torn, afraid to leave his body. He turns back \n               just as his corpse, covered in a green sheet, is wheeled \n               into the corridor and parked alongside the wall. Sam seems \n               stunned and inconsolable as he sits down beside it.\n\n               A wrinkled OLD MAN approaches Sam and joins him on the bench. \n               He begins talking.\n\n                                     MAN\n                         So, what happened to you?\n\n               Sam is startled, amazed that the man can see him.\n\n                                     SAM\n                         What?\n\n                                     MAN\n                         You're new, huh? I can tell.\n\n                                     SAM\n                         Are you talking to me?\n\n                                     MAN\n                         Relax. It ain't like before, you \n                         know. It's a whole new ball-a-wax.\n\n                                     SAM\n                         Who are you?\n\n                                     MAN\n                         I'm waiting for my wife. She's in \n                         4C. Cardiac wing. She's fighting it.\n\n               The man sticks his head into the green sheet covering Sam's \n               body. His head disappears. Sam is terrified.\n\n                                     MAN\n                              (continuing)\n                         Shot, huh? That'll do it every time. \n                         Poor bastard. Well, get used to it. \n                         You could be here a long time.\n                              (leaning in close)\n                         I'll tell you a secret. Doors ain't \n                         as bad as you think. Zip zap. They \n                         ain't nothin' at all. You'll see. \n                         You'll catch on.\n\n               Suddenly there is a loud COMMOTION and we see several \n               PHYSICIANS operating furiously on an Old Man lying on the \n               table beside them. It is a life threatening situation and \n               they seem to be failing.\n\n                                     MAN\n                              (continuing)\n                         He ain't gonna make it. I've seen it \n                         a million times. He's a goner. See? \n                         Here they come. Lucky bastard. Could \n                         have been the other ones. You never \n                         know.\n\n               ANGLE\n\n               Before Sam can understand what is happening the entire room \n               fills with a strange preternatural light. Suddenly he looks \n               up and freezes.\n\n               The amorphous forms he saw right after he died are floating \n               down through the ceiling and reaching for the body on the \n               operating table. They are emitting a powerful light.\n\n                                     DOCTOR\n                         Hurry, we're losing him.\n\n                                     MAN\n                         What'd I tell you? Bingo!\n\n               The glowing forms take hold of the man's spirit and help \n               extract it from his body. His physical form changes instantly \n               from a solid object into an ethereal substance.\n\n               Sam stares in amazement as the strange beings carry the spirit \n               upward. They evaporate through the ceiling.\n\n                                     DOCTOR\n                         He's gone.\n\n               ANGLE\n\n               The light in the room grows dull instantly. Nurses cover the \n               dead man with a dark sheet as the doctors step away. Sam \n               turns to the Old Man.\n\n                                     SAM\n                         Who are you? What's happening...?\n\n               The Man isn't there. An Orderly approaches the gurney with \n               Sam's body and begins pushing it toward the elevator. Sam \n               jumps in front of him.\n\n                                     SAM\n                              (continuing)\n                         No!\n\n                                                                    CUT TO:\n\n               SAM'S P.O.V.\n\n               as the stretcher begins to roll right through him. The \n               penetration of his physical space is horrifying to Sam. He \n               stands, almost paralyzed, as the body of the Orderly \n               intersects with his. It is a stunning moment of extraordinary \n               strangeness as we witness the atoms and molecules of the \n               Orderly's body passing through his. It is like a glimpse of \n               ultimate chaos, the universe within.\n\n               Then, in a flash, the Orderly has passed through, but Sam is \n               still shaking. He stares up at the ceiling.\n\n                                     SAM\n                         Oh God, help me.\n\n                                                                    CUT TO:\n\n               SAM'S P.O.V.\n\n               as the ceiling lights and acoustical tiles begin to blur. \n               The hallway grows dark. It is as though Sam is blacking out.\n\n               EXT. CEMETERY - DAY\n\n               Slowly, images begin to emerge out of the blackness. It takes \n               a moment to realize that they are scenes from Sam's funeral.\n\n               The CAMERA TRACKS along rows of mourners as seen from SAM'S \n               P.O.V. He seems to be floating among them. We hear snippets \n               of conversations. It all seems strangely odd and disjointed. \n               Time seems unfixed, malleable.\n\n               We see a MINISTER standing beside the grave.\n\n                                     MINISTER\n                         As we say farewell to our friend Sam \n                         Wheat, we are reminded of his \n                         kindness, his generosity, his buoyancy \n                         of spirit...\n\n               The CAMERA KEEPS MOVING. Sam's associates from the bank are \n               among the mourners.\n\n                                     MINISTER\n                              (continuing)\n                         All that we treasure, our friends, \n                         our loved ones, our body, our mind, \n                         are but on loan to us. We must \n                         surrender them all. We are all \n                         travelers on the same road which \n                         leads to the same end.\n\n               Sam notices a WOMAN in a fancy print dress comforting one of \n               the mourners. The woman looks up at him, smiles, and waves. \n               Sam is surprised. He looks behind him, but no one is there.\n\n               As he turns back, the woman is walking away. She appears \n               just like any normal person until she approaches a large \n               gravestone and passes right through it. Sam is shocked.\n\n                                     MINISTER\n                         As our loved one enters eternal life, \n                         let us remember that love, too, is \n                         eternal, that although we will miss \n                         him, our love will light the void \n                         and dispel the darkness.\n\n               Suddenly, Molly ENTERS THE FRAME. Sam spots her. The CAMERA \n               STOPS.\n\n                                     SAM\n                         Molly.\n\n               She does not respond. RUTH, her sister, leans over to her. \n               Tears form in Molly's eyes. A hand reaches out to give her a \n               tissue. Molly looks up. It is Carl. She gives him her hand. \n               He squeezes it with affection.\n\n                                     MINISTER\n                         ...and into Your hands we commend \n                         his spirit. May he rest in peace. In \n                         the name of the Father, the Son, and \n                         the Holy Ghost. Amen.\n\n               The casket is lowered into the ground. Molly approaches the \n               grave. She us a little unsteady. Carl takes her elbow. A \n               shovel is placed in her hands. With great emotional effort \n               she lifts a shovelful of dirt and tosses it onto the casket. \n               It lands with a REVERBERATING finality. Sam shudders.\n\n                                                                  DISSOLVE:\n\n               LONG SHOT - PEOPLE\n\n               leaving the cemetery. We hear them talking.\n\n                                     VOICES\n                         What time you going back to work?... \n                         What's the buzz on Digital? It's \n                         sad. He was so young... How's your \n                         new Honda?... Going away this weekend?\n\n                                                               CUT BACK TO:\n\n               CLOSEUP - SAM\n\n               desperately alone. Down the hill, people are getting back \n               into their cars. Sam can see Molly being let into a limousine. \n               He stands there staring at his own casket, grieving. Then, \n               after a moment, he turns away. Separating from his body, \n               from his own grave site, he runs after her.\n\n                                                                  DISSOLVE:\n\n               INT. LOFT - DAY\n\n               Molly is sitting on the couch in the middle of the loft \n               surrounded by FRIENDS and WELL WISHERS. A young GIRL, her \n               niece, cuddles in her lap. People are eating and milling \n               around. Slowly THE CAMERA BEGINS TO PAN. It ends on Sam, \n               standing alone in a corner. In the midst of all the activity \n               he is lost and alone.\n\n                                                             FADE TO BLACK:\n\n               ANGLE\n\n               Raw clay on a potter's wheel spins hypnotically, sensuously. \n               Molly's wet hands press in, shaping it, molding it. A bowl \n               begins to appear. The camera pulls back and reveals Sam. He \n               is sitting on the floor behind her, knees pressed to his \n               chest, rocking aimlessly.\n\n               Molly looks away from the bowl she is forming. It distorts \n               and bends. Angry, she digs her finger into it. The bowl \n               disintegrates. Tears form in her eyes.\n\n               Frank jumps up on the bench beside her. Molly stares sadly \n               around the room. Quietly, she begins talking to herself, to \n               the air.\n\n                                     MOLLY\n                         Oh God, Sam...\n\n               Sam looks up.\n\n                                     MOLLY\n                              (continuing)\n                         I picked up your shirts this morning. \n                         I don't know why. Mr. Reynolds said \n                         to tell you hello. I broke into tears. \n                         It's so hard...\n\n               Sam walks over to Molly. Desperate for contact, he reaches \n               out to touch her cheek, but then hesitates and pulls back.\n\n                                     MOLLY\n                              (continuing)\n                         I think about you every minute. It's \n                         like you're still here, like I can \n                         feel you, Sam.\n\n               He stares at her, hoping, wondering.\n\n                                     SAM\n                         I am here, Moll. I am.\n\n               ANGLE\n\n               Suddenly, as if hearing Sam's voice, the cat begins to hiss. \n               Molly spins around. The cat scans the room. Unexpectedly, \n               Sam's and the cat's eyes meet... With a wild SCREECH, the \n               cat jumps from the bench and takes off running. Sam recoils. \n               Molly stands up.\n\n                                     MOLLY\n                         Frank, what's wrong? Frank?\n\n               The cat is nowhere to be seen. All of a sudden, Molly freezes. \n               Sam is standing right beside her. It is almost as though she \n               senses his presence.\n\n                                     MOLLY\n                              (continuing; whispering)\n                         Sam?\n\n               She holds very still for a moment. Sam watches breathlessly, \n               loving her, wanting her. Then quietly, hopefully, he reaches \n               out. It is a useless gesture. In a moment of great poignancy, \n               Molly shakes her head and walks right through him. He remains \n               IN THE FRAME, alone.\n\n               INT. BEDROOM - DAY\n\n               Sam, stands in the corner of a large, walk-in closet, watching \n               as Molly goes through his effects. Boxes, scattered underfoot, \n               are filling up with his life's possessions. Molly reaches \n               for a shirt.\n\n                                     SAM\n                         Wait, Moll. Not that one. That's my \n                         favorite...\n\n               She tosses it into a box and then takes down a sweater. It \n               is obviously handmade, about four sizes too big. Sam \n               recognizes it.\n\n               Molly holds the sweater tenderly and presses it to her cheek. \n               After a moment she puts it back. Then, in a surprising \n               outburst, she cries out and begins flailing at the shelves. \n               Everything comes flying off. Sam reaches out to console her.\n\n                                     SAM\n                              (continuing)\n                         Molly, don't.\n\n               Unexpectedly, Carl comes rushing into the room. He takes \n               hold of Molly and sits her on the bed.\n\n                                     SAM\n                              (continuing)\n                         Say something. Help her, Carl.\n\n                                     CARL\n                         It's hard. It's very hard.\n\n                                     SAM\n                              (sarcastic)\n                         Oh good. That's really good.\n\n                                                                    CUT TO:\n\n               OMITTED\n\n               INT. KITCHEN - DAY\n\n               Molly and Carl are standing over the kitchen table folding \n               piles of Sam's clothes and placing them into boxes. As Molly \n               lifts one of Sam's jackets, something falls from a side \n               pocket. It is his small black leather address book. Sam stares \n               at it with recognition. Carl sees the book fall and stoops \n               to pick it up but Molly gets it first.\n\n                                     MOLLY\n                         Sam's address book.\n\n               She skims through it a moment, but the memories it evokes \n               are too powerful for her. She places it carefully into a box \n               labeled \"Sam's Things -- Valuable\" and continues packing. \n               She finds the old jar with the penny in it. It's marked \"For \n               Luck\". She holds it tenderly for a moment and then places it \n               on the nightstand beside the bed.\n\n               Carl discovers some old ticket stubs in another of Sam's \n               jackets. He examines them.\n\n                                     CARL\n                         Dave Brubeck. Newport '86. Should I \n                         toss 'em?\n\n                                     MOLLY\n                         No!\n\n                                     SAM\n                         Molly, we hated that concert.\n\n               She takes the stubs and lovingly puts them in the box. Sam \n               groans.\n\n               Carl finds a half used package of Rolaids. Molly takes them \n               from his hand and puts them in the box, too.\n\n                                     CARL\n                         Oh, you want to save those?\n\n                                     SAM\n                         Rolaids? What are you doin' Moll?\n\n               Molly just stares for a moment.\n\n                                     MOLLY\n                         I miss him, Carl.\n\n               Carl comes over and takes her hand.\n\n                                     CARL\n                         We all do.\n\n               Molly buries her head on his shoulder. Carl strokes her hair.\n\n                                                                    CUT TO:\n\n               ANGLE\n\n               Carl lifting a pile of boxes and carrying them to the door. \n               Suddenly Molly yells out.\n\n                                     MOLLY\n                         Wait. Wait. Not that one.\n\n               She hurries over and pulls the \"Valuable\" box from the stack \n               in his arms. He looks at it with surprise.\n\n                                     CARL\n                         Oh, shit. I'm sorry. I don't know \n                         how that got in there.\n\n               He turns to the door and then back to Molly.\n\n                                     CARL\n                              (continuing)\n                         Hey, Moll. Why don't you come? It's \n                         like summer outside.\n\n                                     MOLLY\n                         No.\n\n                                     CARL\n                         Just for a stroll. It'd be good to \n                         get out.\n\n               Molly shakes her head and turns away.\n\n                                     MOLLY\n                         I can't do it Carl.\n\n               Carl, annoyed, walks over to her.\n\n                                     CARL\n                         Molly... you're not the one who died!\n\n               Molly stops and looks at him. He has struck home. After a \n               moment she nods her head.\n\n                                     MOLLY\n                         Okay. Just a short walk.\n\n               He gently squeezes her shoulders.\n\n                                     CARL\n                         Thata girl.\n\n               Before Sam even understands what is happening, they are \n               exiting the loft. Sam jumps up and runs after them.\n\n                                     SAM\n                         Hey, Molly! Wait!\n\n               ANGLE\n\n               The door slams shut. Sam is locked inside. Frightened and \n               desperate, he rushes for the door knob. His hand sinks through \n               it. There is a strange sound, like ELECTRICAL STATIC, as it \n               penetrates the metal and wood. Frightened, he yanks it back.\n\n               Sam circles the space several times and then returns to the \n               door. Clenching his teeth, he reaches out again. As his hand \n               pushes up against it, we sense that he experiences a subtle \n               resistance. The hairs on the back of his hand vibrate as his \n               ghostly form presses into it. We sense Sam's fear as his \n               entire arm DISAPPEARS FROM VIEW. The grating ELECTRICAL SOUND \n               shudders up his spine.\n\n               The sight of his amputated limb is unsettling but Sam does \n               not pull back. Slowly he edges in and presses his face into \n               the molecules of the wood.\n\n                                                                    CUT TO:\n\n               SAM'S P.O.V.\n\n               as atoms and electrons spin past him at frightening speed. \n               There is a sense of a universe in total chaos. Terrifying \n               SOUNDS charge through his body.\n\n                                                                    CUT TO:\n\n               SAM\n\n               pulling back from the door. He is trembling.\n\n               INT. LOFT - AN HOUR LATER\n\n               THE CAMERA MOVES SLOWLY THROUGH THE LOFT AND GRADUALLY \n               DISCOVERS SAM. He is sitting in a corner singing quietly to \n               himself.\n\n                                     SAM\n                         \"Singing bye bye, Miss American Pie. \n                         Drove my Chevy to the levy, but the \n                         levy was dry. Them good ol' boys \n                         were drinkin' whiskey and rye, and \n                         singing this'll be the day that I...\"\n\n               He stops, realizing the last word of the song. He sits \n               silently, staring at the wall.\n\n               Suddenly, there is a SOUND at the door. Sam's eyes shoot up. \n               The door begins to open.\n\n               Sam stands up. His face begins to tighten. We know instantly \n               that something is wrong. His eyes fill with a fury we have \n               not seen before.\n\n               The Mugger, the man who killed Sam, is entering the loft. He \n               has a key in his hand and puts it in his pocket. Sam is \n               stunned. The Mugger locks the door.\n\n               ANGLE\n\n               Sam goes wild. He shoots at the man with all his might, \n               attacking him unceasingly, but with no effect. His hands and \n               feet pass right through him.\n\n                                     SAM\n                         You motherfucking bastard! What the \n                         hell are you doing here? What are \n                         you doing?\n\n               The Mugger, unaware that anything is going on, glances around \n               nervously as he moves through the vast space.\n\n               ANGLE\n\n               Entering the bedroom, the Mugger goes to the dresser and \n               quickly examines the drawers. He is very neat, careful to \n               leave no sign that he was there. He seems to be looking for \n               something but cannot find it.\n\n               ANOTHER ANGLE\n\n               Suddenly we hear a KEY TURNING in the front door. The Mugger \n               seems startled. He dashes from the bedroom and hides quickly \n               behind one of the large sculptures. We hear the door OPEN. \n               Molly is standing there.\n\n               Sam goes crazy.\n\n                                     SAM\n                         Molly, no! Get out!\n\n               Molly closes the door and locks it shut. Sam freezes as she \n               heads for the bedroom. She walks right past the Mugger. To \n               Sam's horror she stops and turns to look around. There is a \n               curious expression on her face. Seeing nothing she continues \n               through the loft.\n\n               The Mugger pulls out his gun. Sam looks on in absolute terror.\n\n               Molly's purple blouse hits the floor as she begins to remove \n               her clothes. She turns on the radio.\n\n               Sam doesn't know what to do. The Mugger seems excited by \n               Molly's semi-nudity. He begins skirting the edges of the \n               loft, moving toward the bedroom. Sam is crazed.\n\n               Suddenly, out of nowhere, Frank appears at the Mugger's feet. \n               Sam's eyes light up. He drops to his knees, crawls over to \n               him, glares into his eyes, and screams.\n\n               ANGLE - THE CAT\n\n               SCREECHES and jumps straight up. His claws shoot out at the \n               mugger's face, ripping into the flesh near his eye.\n\n               Blood appears. The mugger sees it dripping through his \n               fingers. The sight of it upsets him. He grabs the cat angrily \n               by the neck. It SQUEALS. Molly in her bra, peers from the \n               bedroom.\n\n                                     MOLLY\n                         Frank, what's wrong?\n\n               The Mugger holds the cat's mouth shut. Seeing and hearing \n               nothing, Molly steps back into the bedroom.\n\n               The Mugger takes the cat and throws it across the floor. \n               Holding his eye, he gets up and rushes for the exit. Sam \n               runs after him, but the door closes before he can get through. \n               He is left inside.\n\n               ANGLE - SAM\n\n               stares at the closed door in a wild panic. He doesn't know \n               what to do. Then, summoning all of his courage, he takes a \n               blind, running slow motion leap and charges through it.\n\n               SAM'S P.O.V.\n\n               There is a brief sense of passing through a molecular force \n               field, a miniature universe inside the door.\n\n               ANGLE - SAM\n\n               as he emerges from the door and lands on the other side. He \n               seems excited to have survived and is very pleased with \n               himself.\n\n               EXT. NEW YORK STREET - DAY\n\n               The Mugger steps out onto the sidewalk and hurries toward \n               the subway. A patch of sleeve soaks up the blood from his \n               eye.\n\n               Sam starts after the man but instantly freezes. Hordes of \n               people crowd the sidewalk. The crush of humanity is \n               frightening. Two lovers, holding hands, are coming right at \n               him. Before Sam is able to move, we hear the sound of their \n               arms cutting through his ghostly form.\n\n               Sam tries instinctively to dodge the crowds but people \n               approach him from all angles.\n\n               We hear a BABY CARRIAGE roll through Sam's feet and he nearly \n               falls over trying to avoid it. His instincts will not let \n               go.\n\n               A barrage of images and SOUNDS assaults Sam. It is more than \n               he can handle. Still, he refuses to give up. He stays close \n               to the Mugger.\n\n               EXT. NEW YORK SUBWAY STATION - DAY\n\n               The Mugger heads down a flight of steps into the IRT.\n\n               INT. SUBWAY TRAIN - DAY\n\n               The Mugger gets onto a crowded subway car. Sam stands near a \n               corner of the train watching him.\n\n               Suddenly, Sam notices that something odd is happening. One \n               of the riders at the other end of the car is walking toward \n               him. As he approaches the Mugger, he does not stop, but passes \n               right through him. It takes Sam a moment to realize what is \n               happening, but then it is too late.\n\n               ANGLE - THE OTHER GHOST\n\n               With unholy fury the New Ghost charges into Sam. The attack \n               is so unexpected and ferocious that Sam has no sense of how \n               to defend himself. With unexpected power, the Ghost grabs \n               hold of him and slams him into the subway door. Sam's head \n               plows right through it.\n\n               ANGLE\n\n               on Sam's head sticking outside of the car as the subway tunnel \n               rushes past him. There is a panicked look on his face. The \n               look intensifies as he turns and sees another train barreling \n               down on him.\n\n               ANGLE\n\n               on Sam's body inside the car still struggling with the Ghost \n               as the other train shoots by the window. With a huge gasp, \n               Sam shoots back into the car, and wrests himself free of the \n               Ghost's hold. The Ghost flies after him, screeching.\n\n               Sam surges through the door at the end of the train and finds \n               himself on the bridge between the subway cars. The subway \n               Ghost stares at him through the window with a wild, insane \n               look.\n\n                                     GHOST\n                         Stay off! This is mine!\n\n               ANGLE FAVORING WINDOW\n\n               With shocking impact, the Ghost's fist goes flying into the \n               window. To Sam's terror and amazement, the window SHATTERS. \n               The Ghost smiles. Passengers scream and Sam dives for cover. \n               Sam stares at the broken glass with fascination and confusion. \n               Suddenly, the train moves from the darkness of the tunnel \n               into broad daylight.\n\n               EXT. ELEVATED SUBWAY STATION - DAY\n\n               The train stops at an elevated subway platform in Brooklyn.\n\n               OMITTED\n\n               SAM'S P.O.V.\n\n               Sam sees the Mugger exiting the train and frantically rushes \n               after him.\n\n               EXT. BROOKLYN STREETS - DAY\n\n               Sam follows the Mugger down a long covered staircase to the \n               street.\n\n               EXT. 321 PROSPECT PLACE - DAY\n\n               The Mugger heads toward 321 Prospect Place. The streets are \n               lined with old apartment buildings. Many windows are boarded \n               up. TWO MEN, standing on the corner, are slamming a piece of \n               heavy machinery onto the pavement.\n\n               Sam hears GOSPEL MUSIC coming from a storefront church and \n               notices a sign, \"SISTER ODA MAE BROWN, MEDIUM, SPIRIT READER, \n               ADVISOR.\" He looks up to a third story window and sees a \n               similar sign with day-glo arrows pointing to the entrance on \n               the street. He seems curious, but then realizes that the \n               Mugger is nearly halfway down the block. He turns and rushes \n               after him.\n\n               EXT. 321 PROSPECT PLACE - DAY\n\n               Sam and the mugger approach a tenement building at 321 \n               Prospect Place.\n\n               INT. TENEMENT HALLWAY - DAY\n\n               Sam follows the Mugger into the building and watches as he \n               opens the mail box for APT. 4D. The name scribbled across it \n               is WILLIE LOPEZ. There's no mail.\n\n               INT. WILLIE'S APARTMENT - DAY\n\n               Sam enters Willie's apartment. It is a squalid affair. Peeled \n               paint chips litter the floor. The bed is unmade.\n\n               Willie pulls open a drawer in a small nightstand and drops \n               in the keys to Molly's loft. Sam sees his wallet. His driver's \n               license, bank ID, and a photo of Molly are there, too. \n               Furious, Sam lunges for Willie but then holds his punch, \n               knowing it will have no effect. He turns instead to a window \n               and, like the Ghost on the subway, smashes it with his fist. \n               Nothing happens.\n\n                                     SAM\n                         Damn!\n\n               Willie dials the phone. Someone comes on the line.\n\n                                     WILLIE\n                         She came home. I couldn't get it. \n                         Give me a couple of days. I'll go \n                         back.\n\n               He hangs up. Sam stares at him in wild confusion.\n\n                                     SAM\n                         Get what? Who the hell are you? What \n                         were you doing at Molly's? What the \n                         hell's going on?\n\n               Willie grabs a bottle of wine from the nightstand and lies \n               down. After a moment he reaches over and takes Molly's photo \n               from the drawer. He studies it slowly.\n\n               Sam stands by the door in a state of motionless rage. There \n               is nothing he can do.\n\n                                     SAM\n                              (continuing)\n                         Stay away from her!\n\n               EXT. BROOKLYN STREETS - DAY\n\n               Sam storms down the street. His movements seem undirected, \n               utterly aimless. He is seething inside.\n\n               Suddenly Sam looks up. An old BAG LADY is walking down the \n               street talking loudly to a SHORT WOMAN tagging along beside \n               her. As they approach a street pole, the Bag Lady swerves to \n               the side. The Short Woman, however, walks right through it. \n               Passersby laugh at the Old Lady talking to herself. Sam, \n               unsettled, rushes away.\n\n               As Sam rounds a corner, a sudden blast of MUSIC explodes out \n               of nowhere. Sam jumps into the street, gasping. A phonograph \n               needle SCRATCHES across a record and the MUSIC STOPS. A \n               woman's voice booms out:\n\n                                     WOMAN'S VOICE\n                         Sorry 'bout that.\n\n               PANNING SHOT\n\n               to a pair of loudspeakers in a storefront window. The MUSIC \n               blares out once more and SOUNDS of gospel fill the street.\n\n               Sam looks up. He is back in front of the storefront church \n               with the sign for SISTER ODA MAE BROWN, MEDIUM, SPIRIT READER, \n               ADVISOR, hanging overhead. Below it is another sign. \"Contact \n               the dearly departed. $20.00\".\n\n               Sam stares at the sign with curiosity. The MUSIC is \n               compelling. After a moment's hesitation, he goes in the open \n               door.\n\n               INT. STOREFRONT - DAY\n\n               A record player is sitting near the storefront window, a \n               makeshift microphone placed in front of it.\n\n               Several rows of folding chairs face a raised platform with \n               nothing on it. A number of people are sitting there, mostly \n               women. One gets the sense that this is a cross between a \n               waiting room and a meeting hall. A black WOMAN steps up on \n               the platform and calls out:\n\n                                     WOMAN\n                         Rosa Santiago.\n\n               MRS. SANTIAGO tucks a Spanish paperback romance into her \n               purse and heads to a door at the rear of the hall. Sam follows \n               after her.\n\n               INT. SEANCE ROOM - DAY\n\n               Mrs. Santiago enters a dark room with a window and door \n               leading to a side street. A paisley bedspread is tacked over \n               the window.\n\n               In the center of the room is a round seance table. Two \n               heavyset sisters, CLARA (39), and LOUISE (36), are standing \n               beside an open closet. It is empty.\n\n                                     WOMAN\n                         Please be seated.\n\n               Mrs. Santiago sits at the table. She seems apprehensive. \n               Clara steps into the closet and taps on each of the walls as \n               though demonstrating that they are solid.\n\n                                     CLARA\n                         My sister will be with us soon.\n\n               She steps back out and closes the door. Louise inserts a \n               tape into a boom box and then steps forward.\n\n                                     LOUISE\n                         Sister Oda Mae. Grant us the gift of \n                         your all-seeing presence. Appear for \n                         us now.\n\n               ANGLE FAVORING CLOSET\n\n               She turns back to the closet and opens the door. Like magic, \n               ODA MAE BROWN, 41, appears standing inside. She is a black \n               woman in a white tunic. The whiteness of her garment makes \n               it look as if she is glowing in the dark. Mrs. Santiago is \n               wide-eyed. Sam smiles as Oda Mae steps into the room.\n\n                                     ODA MAE\n                         Mrs. Santiago.\n\n                                     MRS. SANTIAGO\n                         Buenos dias.\n\n               She takes a twenty dollar bill from her purse and hands it \n               to Oda Mae. Clara graciously intercepts the money.\n\n                                     ODA MAE\n                         I understand you are hoping to contact \n                         your husband.\n\n                                     MRS. SANTIAGO\n                         Si. Si.\n\n                                     ODA MAE\n                         Well, I believe he's gonna be with \n                         us today.\n\n                                     MRS. SANTIAGO\n                         Oh, tsank you, tsank you.\n\n               Tears well up in her eyes. She crosses herself several times.\n\n                                     ODA MAE\n                         But there's no telling about the \n                         other world. You gotta cast out all \n                         doubt. You gotta believe. Do you \n                         believe?\n\n                                     MRS. SANTIAGO\n                              (nodding her head \n                              vigorously)\n                         Si. Si. I believe. I believe.\n\n                                     ODA MAE\n                         And remember, we don't make no \n                         promises. I can phone up there till \n                         I'm blue in the face,\n                              (she points to the \n                              ceiling)\n                         ...but it don't necessarily mean \n                         he's gonna be home. Them folks go \n                         shopping, they play bingo. It's just \n                         like here. You can't always get 'em.\n\n               Mrs. Santiago, utterly fascinated, nods understandingly.\n\n                                     SAM\n                         Sure lady!\n\n               Oda Mae's eyes glance up curiously for a second, as though \n               she heard something, and then she continues.\n\n                                     ODA MAE\n                         Okay, let's get ready then.\n\n               Sam steps back as the sisters get up and position themselves \n               behind Oda Mae. The moment feels rehearsed, theatrical. Oda \n               Mae raises her hands into the air and closes her eyes. There \n               is a hush in the room. Her body begins to tremble. Mrs. \n               Santiago clutches her chair. Suddenly Oda Mae breaks out of \n               her trance.\n\n                                     ODA MAE\n                         We got a problem here. I don't think \n                         he's in. Wait. I feel something. Did \n                         he know someone who's passed over, \n                         someone named Anna... Mary... \n                         Consuela... Maria?\n\n                                     MRS. SANTIAGO\n                         Si, si! His mama. She's Maria.\n\n                                     ODA MAE\n                         Ah! I knew it. He's with his mama.\n\n                                     SAM\n                              (sarcastic)\n                         Oh my God...\n\n               Oda Mae's eyes dart uncomfortably around the room.\n\n                                     ODA MAE\n                         I'm afraid this is gonna be too hard. \n                         Now I got two souls I gotta contact. \n                         I don't know about that. It's \n                         difficult, you know. The pain. The \n                         effort.\n\n                                     MRS. SANTIAGO\n                         I pay more. How much? How much?\n\n                                     ODA MAE\n                         Twenty dollars.\n\n                                     SAM\n                         Way to go. Milk her for every penny.\n\n               Oda Mae jumps up and stares at her sisters. They look back \n               at her curiously. They can't figure out what's wrong. Neither \n               can Oda Mae.\n\n               Mrs. Santiago reaches into her purse. A twenty dollar bill \n               changes hands. Sam watches, amazed at it all. Oda Mae sits \n               down and goes back into her trance. Her eyeballs roll up \n               into their sockets.\n\n                                     CLARA/LOUISE\n                         Praise the Lord. Thank you, Jesus.\n\n               Oda Mae is beginning to shake again. The two women grab her \n               shoulders to keep her from falling out of the chair. Suddenly \n               her whole body stiffens.\n\n                                     CLARA/LOUISE\n                              (continuing)\n                         Have mercy! Have mercy!\n\n               Mrs. Santiago stares on in amazement. After a moment Oda \n               Mae's body collapses in a heap. Then, like a phoenix rising \n               from the ashes, she pulls herself up in her chair and assumes \n               a normal pose.\n\n               After several seconds to get her bearings, Oda Mae begins to \n               speak. Only now she has an entirely new voice. It sounds \n               deep and hoarse, like an old man's. For all its put on \n               theatricality, it is strangely convincing.\n\n                                     ODA MAE\n                         Welcome, Rosa Santiago. You are \n                         fortunate today. The channel is clear. \n                         Many spirits are gathering.\n\n                                     SAM\n                              (scanning the room)\n                         Yeah? Where?\n\n               Oda Mae jerks. Her eyes dart nervously around the room.\n\n                                     MRS. SANTIAGO\n                         My husband?\n\n                                     ODA MAE\n                              (a bit uneasy)\n                         I can feel his vibration. Yes, yes, \n                         he is drawing toward us now. I can \n                         see him coming.\n\n                                     MRS. SANTIAGO\n                         Julio! Julio! How is he? How does he \n                         look?\n\n                                     ODA MAE\n                         Oh, he is a very handsome man.\n\n                                     MRS. SANTIAGO\n                              (surprised)\n                         Handsome?\n\n                                     ODA MAE\n                         In our Father's Kingdom we are all \n                         handsome.\n\n                                     MRS. SANTIAGO\n                              (understanding)\n                         Julio!\n\n               Sam looks on dismayed.\n\n                                     ODA MAE\n                         He is standing before me. He is \n                         wearing a black suit.\n\n                                     MRS. SANTIAGO\n                         A black suit? Oh yes, yes. He was \n                         buried in that.\n\n               Mrs. Santiago begins to cry. Sam looks around the room with \n               growing disgust. Then he leans over to Oda Mae and yells \n               into her ear.\n\n                                     SAM\n                         What a crock of shit!\n\n               Oda Mae nearly falls off her chair. She spins around.\n\n                                     ODA MAE\n                         Who's there?\n\n               Sam is stunned. Clara and Louise look at one another in total \n               confusion. This is obviously not part of the act. Mrs. \n               Santiago seems frightened.\n\n                                     ODA MAE\n                              (continuing)\n                         Where are you?\n\n                                     SAM\n                              (looking around)\n                         Who?\n\n               Oda Mae screams and jumps up thrashing at the air. Her knee \n               kicks the table and sends it toppling. Mrs. Santiago is \n               terrified.\n\n                                     MRS. SANTIAGO\n                         Julio! Julio!\n\n                                     SAM\n                         What's going on?\n\n                                     ODA MAE\n                         Get out of here! Leave me alone!\n\n               Mrs. Santiago doesn't know what to do. She begins to cry.\n\n                                     SAM\n                         Who are you talking to?\n\n               Clara runs up to Oda Mae.\n\n                                     ODA MAE\n                         Keep him away!\n\n               Louise looks at the empty room.\n\n                                     SAM\n                         Are you talking to me?\n\n                                     ODA MAE\n                         Do something. Help me.\n\n               Clara just stares at her sister. Sam is excited and amazed.\n\n                                     SAM\n                         I don't believe this. Hey you. My \n                         name is Sam Wheat. Can you hear me? \n                         Sam Wheat!\n\n                                     ODA MAE\n                         Stop it!\n\n                                     SAM\n                         Say my name! Sam Wheat! Say it!\n\n                                     CLARA\n                         Talk to me, Oda Mae. Say something.\n\n                                     ODA MAE\n                         Sam Wheat!\n\n               Sam nearly falls on his face. Clara's eyes widen. She is \n               more confused than ever.\n\n                                     SAM\n                         Jesus!\n\n                                     CLARA\n                         Samweet?\n\n               Oda Mae runs into the closet.\n\n               It has a false panel leading to a hidden chamber on the left \n               side and she barricades herself inside it. Clara and Louise \n               stand outside pulling on the handle. They seem frightened.\n\n                                     CLARA/LOUISE\n                         Oda Mae! Oda Mae!\n\n               INT. CLOSET - DAY\n\n               Oda Mae is rocking back and forth on the floor praying. Sam's \n               feet enter the frame beside her.\n\n                                     ODA MAE\n                         Lord, I swear, no more cheatin'. I \n                         promise, Lord. I don't want to go to \n                         hell. I'll do anything. Gimme a \n                         penance. Just make him go away.\n\n                                     SAM\n                         Go away. Hell no. I'm stayin' right \n                         here!\n\n               Oda Mae screams, jumps back into the closet, and bolts up \n               against the door. It tears from its hinges and falls into \n               the seance room, nearly crushing Louise. Mrs. Santiago runs \n               out screaming. Oda Mae takes one look around and collapses \n               in a dead faint.\n\n               OMITTED\n\n               INT. ODA MAE'S LIVINGROOM - DAY\n\n               Beads of sweat collect on Oda Mae's brow and cheeks. She \n               seems feverish. Clara and Louise are sitting beside her with \n               damp towels nervously soaking up the perspiration. Oda Mae \n               appears to be talking to herself until we PULL BACK and reveal \n               Sam nearby.\n\n                                     ODA MAE\n                         My mama, her mama, may they rest in \n                         peace, they had de gift. Mama always \n                         said I had it, but I never did. She \n                         tol' me all about it, how it felt \n                         an' all. But now that it's happenin' \n                         I don't know what to do. You're \n                         scarin' me half to death. Please, \n                         you gotta go away, you gotta find \n                         someone else.\n\n               Clara and Louise look at one another with growing concern.\n\n                                     SAM\n                         Someone else? Are you outta your \n                         mind?\n\n                                     ODA MAE\n                         I'm gettin' there fast.\n                              (she pushes Louise's \n                              hand)\n                         Leave me alone.\n\n                                     SAM\n                         Not till you help me.\n\n                                     ODA MAE\n                         Where are you?\n\n                                     LOUISE\n                         Where? I'm right here.\n\n                                     SAM\n                         I'm standing right beside you.\n\n                                     ODA MAE\n                              (mimicking his words)\n                         \"I'm standing right beside you.\"\n                              (she pauses and looks \n                              up)\n                         Are you white?\n\n                                     SAM\n                         What?\n\n                                     ODA MAE\n                         Oh God, I knew it. He's white. Why \n                         me?\n\n               Louise looks at her sister and shakes her head.\n\n                                     SAM\n                         Listen, damn it. You can help me. \n                         There's a woman, Molly Jensen. She's \n                         in terrible danger. The man who killed \n                         me broke into our apartment. He's \n                         going to go back. You've gotta warn \n                         her.\n\n                                     ODA MAE\n                         Why would she listen to me?\n\n                                     SAM\n                         She has to! This man's a killer! \n                         He's got a key.\n\n                                     ODA MAE\n                         Forget it, mister. I can't.\n\n                                     SAM\n                         It's just a phone call. You're all \n                         I've got. Lookit. I'm not leavin' \n                         till you help me. I don't sleep \n                         anymore, so I can sit here day and \n                         night. I don't care how long it takes. \n                         I can talk forever.\n\n               Oda Mae gulps, a horrified expression on her face.\n\n               INT. LOFT - DAY\n\n               The telephone rings. Molly, preparing dinner, runs to answer \n               it.\n\n                                     MOLLY\n                         Hello.\n\n                                     ODA MAE (V.O.)\n                         Molly? Is this Molly speaking?\n\n                                     MOLLY\n                         Yes.\n\n                                     ODA MAE (V.O.)\n                         My name is Oda Mae. I'm a spiritual \n                         reader and adviser.\n                              (she hesitates)\n                         I'm calling for a friend of yours. \n                         He asked me to call. This is \n                         important. You gotta believe me. \n                         Don't be afraid.\n\n                                     MOLLY\n                         Who is this?\n\n                                     ODA MAE (V.O.)\n                         I got a message from Sam.\n\n                                     MOLLY\n                              (stunned)\n                         What?\n\n                                     ODA MAE (V.O.)\n                         Sam Wheat. He asked me to call.\n\n               Molly slams down the receiver, panting. For several seconds \n               she doesn't move. Slowly, she walks to the couch and sits \n               down. She is trembling.\n\n               INT. ODA MAE'S KITCHEN - DAY\n\n               Oda Mae hangs up the phone.\n\n                                     ODA MAE\n                         What'd I tell you.\n\n                                     SAM\n                         You gotta go there.\n\n                                     ODA MAE\n                         Look, I don't care what you do to \n                         me, I'm not goin' nowhere.\n\n               INT. ODA MAE'S BEDROOM - NIGHT\n\n               Sam is sitting on the edge of Oda Mae's bed, singing. It \n               sounds like he's been singing for hours. He is very hoarse.\n\n                                     SAM\n                         \"I'm Henery the Eighth I am / Henery \n                         the Eighth I am, I am / I'm gettin' \n                         married to the widow next door / \n                         She's been married seven times before \n                         / And every one was an Henery / \n                         Wouldn't take a Willie or a Sam / \n                         I'm her eighth old man I'm Henery / \n                         Henery the Eighth I am, I am / Henery \n                         the Eighth I am / Second verse same \n                         as the first / I'm Henery the Eighth \n                         I am...\"\n\n               Oda Mae bolts upright in her bed, her hands over her ears.\n\n                                     ODA MAE\n                         Okay! Okay! I'll go. You just shut \n                         your mouth.\n\n               EXT. NEW YORK CITY BUS - ESTABLISHING SHOT - DAY\n\n               INT. BUS - DAY\n\n               Sam and Oda Mae are sitting at the rear of a crowded bus. \n               She appears to be talking to herself.\n\n                                     ODA MAE\n                         I can't believe I'm doin' this. I \n                         gotta be a crazy lady goin' into the \n                         city with you. I never go there. \n                         What the hell you doin' in my life, \n                         huh? Why me?\n\n               Several people move away.\n\n               OMITTED\n\n               EXT. LOFT BUILDING - DAY\n\n               Oda Mae approaches the loft building and buzzes Molly's \n               apartment. She waits a few moments.\n\n                                     ODA MAE\n                         There's nobody there.\n\n                                     SAM\n                         Just wait.\n\n                                     ODA MAE\n                         No, sir. I did what I promised. I \n                         said I'd come and I'm here. I didn't \n                         say anything 'bout waitin'.\n\n                                     SAM\n                         Just one more time. Please. It's a \n                         big place.\n\n               Oda Mae turns to leave. Sam, desperate, starts to sing.\n\n                                     SAM\n                              (continuing)\n                         \"Ninety-nine bottles of beer on the \n                         wall, ninety nine bottles of beer,\"\n\n               Oda Mae stops. She turns back to the buzzer and rings once \n               more. Suddenly Molly answers.\n\n                                     MOLLY (V.O.)\n                         Hello, who's there?\n\n                                     ODA MAE\n                              (nervous)\n                         Don't go away. It's Oda Mae Brown. I \n                         called you last night. Your friend \n                         Sam says you gotta talk to me.\n\n               There is a CLICK as Molly hangs up.\n\n               INT. LOFT - DAY\n\n               Molly walks away from the intercom, shaken. Suddenly we hear \n               Oda Mae yelling up from the street.\n\n                                     ODA MAE (O.S.)\n                         Hey you, Molly! You gotta listen to \n                         me! this is for real. Sam is here. \n                         He needs to talk to you.\n\n               Molly walks over to the window and looks down. Oda Mae is \n               standing in the street looking up. She is calling out at the \n               top of her lungs. Molly pulls back. She is afraid.\n\n                                     ODA MAE (O.S.)\n                              (continuing)\n                         He says remember the starfish at \n                         Montego Bay? Remember the picture he \n                         took a' you in Reno?\n                              (pause)\n                         Remember his green underwear, the \n                         pair you wrote your name on? She \n                         wrote her name on 'em?\n\n               Molly tenses. There is a sign of recognition in her eyes.\n\n               EXT. TRIBECA STREET - DAY\n\n               Oda Mae is standing by the curb and shouting up to Molly's \n               fifth floor window. Several people stare at her curiously. \n               She turns to them.\n\n                                     ODA MAE\n                         Hey, do you mind? This here's a \n                         private conversation.\n\n               The people turn away. She turns back to the window. Sam \n               prompts her.\n\n                                     SAM\n                         Ask her about the sweater in the \n                         closet, the one she knitted that's \n                         too big.\n\n                                     ODA MAE\n                         What about the sweater you knitted \n                         that was too big?\n\n                                     SAM\n                         Four sizes.\n\n                                     ODA MAE\n                         Four sizes.\n\n                                     SAM\n                         She couldn't throw it out. I saw. I \n                         was there.\n\n                                     ODA MAE\n                         You couldn't throw it out. He saw. \n                         He was there. This is for real. Hey \n                         do you hear me up there?\n\n               A WORKMAN peers out of a second story window.\n\n                                     WORKMAN\n                         I hear you.\n\n                                     ODA MAE\n                         I'm not talkin' to you.\n\n                                     WORKMAN\n                         Haven't you ever heard of phones?\n\n                                     ODA MAE\n                         Kiss my behind!\n                              (yelling again)\n                         Listen, I'm not gonna stand here all \n                         day.\n\n                                     WORKMAN\n                         Thank God.\n\n                                     ODA MAE\n                         Forget it. I've had enough of this.\n\n               Oda Mae is about to walk away when the entrance door opens. \n               Molly steps outside. Oda Mae sees her and stops.\n\n                                     ODA MAE\n                              (continuing)\n                         Molly?\n                              (Molly nods)\n                         I'm Oda Mae Brown.\n                              (walking over and \n                              shaking her hand)\n                         You can call me Oda.\n\n               INT. SOHO LUNCHEONETTE - DAY\n\n               Molly and Oda Mae are sitting in a booth staring at one \n               another.\n\n                                     MOLLY\n                         Why should I believe you? Why should \n                         I believe any of this?\n\n                                     ODA MAE\n                         Girl, if you think I'd come down \n                         here for the fun of it, you got \n                         another think comin'. This Sam of \n                         yours... I don't know, lady. I mean, \n                         you ever hear a whole night of \"Henry \n                         the Eighth I am?\"\n\n                                     MOLLY\n                         He did that? That's how he got me to \n                         go out with him.\n\n                                     ODA MAE\n                         And he cain't carry a tune.\n\n                                     MOLLY\n                         I know. Oh God. This is all so crazy. \n                         I can't believe I'm talking to you \n                         like this. I don't believe in these \n                         things. I don't believe in life after \n                         death.\n\n                                     SAM\n                         Tell her she's wrong.\n\n                                     ODA MAE\n                         He says you're wrong.\n\n                                     MOLLY\n                         You're talking to him right now?\n\n                                     ODA MAE\n                         What? You think I'm makin' it up?\n\n                                     MOLLY\n                         Where is he?\n\n                                     ODA MAE\n                         How should I know? It's not like I \n                         can see him. I just hear his voice.\n\n                                     SAM\n                         I'm holding her hand.\n\n                                     ODA MAE\n                         He says he's holding your hand.\n\n                                     MOLLY\n                         I'm sorry. I don't believe you. Why \n                         are you doing this to me? I don't \n                         believe a word you're saying. Sam is \n                         dead. He's dead.\n\n                                     SAM\n                         I'm holding her hand.\n\n                                     ODA MAE\n                         He says he's holding your hand.\n\n               Molly's hand jumps. Oda Mae looks at her. There is a long, \n               poignant moment. Sam chokes up.\n\n                                     SAM\n                         God, I love her. I love her so much.\n\n                                     ODA MAE\n                         He says he loves you... so much.\n\n                                     MOLLY\n                              (shaking her head)\n                         No. He would never say that.\n\n                                     SAM\n                              (his eyes brightening)\n                         Ditto. Tell her \"ditto\".\n\n                                     ODA MAE\n                         Ditto? What's that mean, ditto?\n\n               Molly starts, an expression of true astonishment shining in \n               her eyes.\n\n                                     MOLLY\n                         Sam?\n\n               INT. LOFT - DAY\n\n               Molly is pressed up against the edge of the couch listening \n               nervously as Oda Mae speaks. Sam wanders around the room, \n               anxiously.\n\n                                     ODA MAE\n                         To tell the truth, I don't know how \n                         I'm doin' it. In fack, confidentially, \n                         nothin' like this never happened to \n                         me before. Now, all a sudden, I can't \n                         turn it off.\n                              (she sees a photo of \n                              Sam)\n                         Is this you? Is this him?\n\n               They both say \"yes\" at the same time.\n\n                                     ODA MAE\n                              (continuing; to Sam)\n                         Hazel eyes, huh? You sound like they'd \n                         be blue.\n\n                                     MOLLY\n                         I don't understand. Why did he come \n                         back? Why is he still here?\n\n                                     ODA MAE\n                         Cause he's stuck, that's why. He's \n                         between worlds. It happens sometimes, \n                         when their spirits get out too quick. \n                         He thinks he still has stuff t'do \n                         down here.\n\n                                     SAM\n                         Come on Oda Mae, stop rambling.\n\n                                     ODA MAE\n                         Oh, oh, now he's got an attitude.\n\n               Molly stares at Oda Mae.\n\n                                     SAM\n                         I do not have an attitude.\n\n                                     ODA MAE\n                              (to Molly)\n                         We're having a discussion.\n                              (back to Sam)\n                         Whataya mean, you're not angry? If \n                         you weren't angry you wouldn't be \n                         raisin' your voice like that.\n\n                                     SAM\n                         Goddamn it, Oda Mae!\n\n                                     ODA MAE\n                         Ah ah, baby. That does it. I don't \n                         talk to anybody who takes the Lord's \n                         name in vain.\n\n               She stands up, as if to leave. Molly watches with growing \n               discomfort as Oda Mae seems to be talking to herself.\n\n                                     SAM\n                         Relax, Oda Mae.\n\n                                     ODA MAE\n                         You relax. You're the dead one. You \n                         want my help, then you apologize. \n                         Nobody talks to me like that, \n                         understand?\n\n                                     SAM\n                         Jesus Christ!\n\n                                     ODA MAE\n                              (to Molly)\n                         Excuse me, girl. Time for me to go.\n\n               Oda Mae heads for the door. Molly is confused.\n\n                                     MOLLY\n                         I don't believe I'm watching this.\n\n                                     SAM\n                         Damn it. All right. I apologize.\n\n               Oda Mae stops, pauses a moment, and walks back to the couch. \n               Sam, relieved, paces back and forth.\n\n               Oda Mae's eyes follow his voice as Molly watches her \n               curiously.\n\n                                     SAM\n                              (continuing)\n                         Please, Oda Mae, I need you to tell \n                         Molly what I'm saying. You gotta \n                         tell her word for word.\n\n                                     ODA MAE\n                         Monsieur has a message for you.\n\n                                     SAM\n                         Molly, you're in danger.\n\n                                     ODA MAE\n                         You can't tell her like that. And \n                         would you stop movin' all over the \n                         place? You're makin' me sick.\n\n               Molly looks concerned. Sam leans into Oda Mae.\n\n                                     SAM\n                         Say it!\n\n                                     ODA MAE\n                         He's sayin' you're in danger.\n\n                                     MOLLY\n                         Danger?... What do you mean?\n\n                                     SAM\n                         I know the man who killed me. Willie \n                         Lopez. I know where he lives.\n\n                                     ODA MAE\n                         He says he knows the man who killed \n                         him, Willie Lopez. He's Puerto Rican.\n\n               Molly grows pale as she listens. Her forehead tightens.\n\n                                     SAM\n                         Write it down.\n\n                                     ODA MAE\n                         Write it down.\n\n                                     SAM\n                         You do it!\n\n                                     ODA MAE\n                         Now I'm a secretary.\n\n               Oda Mae takes a card from her purse and grabs a pencil.\n\n                                     SAM\n                         321 Prospect Place. Apartment 4D.\n\n                                     ODA MAE\n                         321? Hey, that's my neighborhood.\n\n               Oda Mae seems perplexed as she writes it down and gives it \n               to Molly.\n\n                                     SAM\n                         Molly, he's got my wallet and my \n                         key. He was in here.\n\n                                     ODA MAE\n                         He's got his wallet and key. He was \n                         in here.\n\n                                     MOLLY\n                         In here?\n\n                                     SAM\n                              (directly to Molly)\n                         You have to go to the police. The \n                         Mugger wasn't acting alone. It was a \n                         setup, Moll. I was murdered.\n\n                                     ODA MAE\n                         He says he was set up, that he was \n                         murdered. He wants you to go to the \n                         police.\n\n               Molly stands up, afraid. Oda Mae stands up, too.\n\n                                     ODA MAE\n                              (continuing)\n                         I'm sorry. I don't want nothin' to \n                         do with this.\n\n               Oda Mae heads for the door as Molly watches in a daze.\n\n                                     SAM\n                         Where you going?\n\n                                     ODA MAE\n                         Don't follow me! I've done all I'm \n                         gonna do.\n                              (opening the door)\n                         I'm finished. And I ain't comin' \n                         back. So don't you come botherin' me \n                         again cause it's over. I mean it. \n                         This is it. Have a nice life. Have a \n                         nice death. I'm goin'.\n\n               She lets herself out. Sam just stands there as the door slams \n               shut.\n\n               OMITTED\n\n               INT. KITCHEN - THAT NIGHT\n\n               Carl is pacing nervously. He seems very upset. After a moment \n               he approaches Molly. Sam is behind her.\n\n                                     CARL\n                         Molly, there's no one on earth who'd \n                         like it to be true more than me, but \n                         you've got to be rational about this. \n                         I understand your desire to hold on \n                         to him, but this... this is absurd.\n\n                                     MOLLY\n                         It was real, Carl. She was real.\n\n                                     SAM\n                         Listen to her, Carl, goddamn it. She \n                         needs some support here.\n\n                                     CARL\n                         Molly, you're a grown woman. How can \n                         you believe some fortune teller from \n                         Brooklyn...?\n\n                                     MOLLY\n                         She was in touch with him.\n\n                                     CARL\n                         I don't believe it, Molly. Not for a \n                         minute.\n\n                                     SAM\n                         Come on, Carl. Open your mind.\n\n               Carl sits down beside her.\n\n                                     MOLLY\n                         Carl, she knew things.\n\n                                     CARL\n                         What kind of things?\n\n                                     MOLLY\n                         I told you, the picture in Reno, the \n                         starfish,... damn it, Carl.\n                              (with great difficulty)\n                         She said Sam knew who killed him. \n                         That he was set up... murdered.\n\n                                     CARL\n                         Oh boy. This is getting deranged. \n                         We're going off the deep end here.\n\n                                     SAM\n                         Give him the address, Moll.\n\n                                     MOLLY\n                         She had a name, an address -- Willie \n                         Lopez, 321 Prospect Place. She said \n                         he had Sam's wallet.\n\n               Sam smiles. Carl stands up. His voice begins to rise.\n\n                                     CARL\n                         This is sick. This is really sick. \n                         How can you swallow this crap? Who \n                         knows if this guy exists? Maybe she's \n                         just setting someone up.\n\n                                     MOLLY\n                         That's what I have to find out.\n\n                                     CARL\n                         Find out? What are you talking about?\n\n                                     MOLLY\n                         Sam wants me to go to the police.\n\n                                     CARL\n                         Sam wants you to go to the police? \n                         Molly! Jesus! Are you outta your \n                         mind? What are you gonna tell 'em? \n                         Some storefront psychic's been getting \n                         messages from the dead? Do you know \n                         how that sounds? You're talkin' ghosts \n                         here, for God's sake.\n\n               Molly looks suddenly vulnerable.\n\n                                     CARL\n                              (continuing)\n                         I'm sorry. This stuff just really \n                         gets to me.\n\n                                     MOLLY\n                         You don't believe me. You don't \n                         believe any of this, do you?\n\n                                     CARL\n                              (half heartedly)\n                         I'm trying to, but... Look, if it'll \n                         make you sleep any better, I'll check \n                         it out, okay? Now why don't you go \n                         to bed. Try and get some sleep.\n\n               Molly looks at Carl, annoyed. She doesn't believe him for a \n               second.\n\n               INT. CARL'S CAR - NIGHT\n\n               Carl, in his red Ford Mustang, is speeding up town. Sam is \n               beside him in the front seat.\n\n               INT. WILLIE'S BUILDING - NIGHT\n\n               Carl steps into the lobby of Willie's building. Sam follows, \n               wide-eyed. He seems both intrigued and astounded by what \n               Carl is doing. When Carl stops to read the apartment number \n               on Willie's mail box, Sam is thrilled.\n\n                                     SAM\n                         Way to go, Carl!\n\n               Carl climbs the stairs two at a time and approaches Willie's \n               door. He bangs on it, loudly.\n\n               ANGLE - THE DOOR\n\n               opens a crack as Willie peers out. Carl pushes it hard and \n               it opens the rest of the way. Willie steps back.\n\n                                     WILLIE\n                         Carl, what're you doin' here?\n\n               Sam freezes as Willie addresses Carl by name. He can barely \n               move.\n\n                                     CARL\n                              (scared, in over his \n                              head)\n                         Who've you been talking to?\n\n                                     WILLIE\n                         Talking to? What the hell do you \n                         mean? What's going on?\n\n                                     CARL\n                         Some woman knows all about you. The \n                         murder, everything. Where's she \n                         getting it from, huh?\n\n                                     WILLIE\n                         What the hell are you talking about? \n                         I haven't said a word.\n\n               Sam is staggered. His body is shaking.\n\n                                     CARL\n                         She knows your name, goddamn it! She \n                         knows where you live!\n\n                                     WILLIE\n                         A lot of women know where I live.\n\n               Carl is fuming.\n\n                                     CARL\n                         This isn't a joke, man. You find \n                         that bitch, whoever she is, and... \n                         get rid of her, you hear me? I've \n                         got four million dollars stuck in \n                         that fucking computer. If I don't \n                         get those codes, if that money's not \n                         transferred soon, I'm dead. If I \n                         lose Balistrari's money, we're both \n                         dead.\n\n                                     WILLIE\n                         Tell him you only wash dirty money \n                         on the first of the month.\n\n                                     CARL\n                         What is wrong with you? Is everything \n                         a joke? You were supposed to steal \n                         his wallet. You weren't supposed to \n                         kill him. Was that a joke?\n\n                                     WILLIE\n                              (casually)\n                         I did you a favor. Freebee.\n\n                                     CARL\n                         Jesus!\n                              (sickened)\n                         These are drug dealers, man.\n                              (pause)\n                         Don't blow this for me, Willie. I've \n                         risked my job here. I could go to \n                         jail. A hundred thousand of that \n                         money goes to me. Now give me Sam's \n                         key. I'll get that address book \n                         myself.\n\n               Willie goes to the desk drawer and takes out Sam's key. Sam, \n               unable to control himself, explodes in a fit of rage. Hauling \n               back, he slugs Carl with all his might. His fist has no \n               impact.\n\n                                     SAM\n                         You killed me, Carl. You had me \n                         killed. Look what you've done to me! \n                         Look what you've done!\n\n               EXT. STREET - NIGHT\n\n               Carl is on the street heading back to his car. Sam is beside \n               him, yelling right into his face.\n\n               He is screaming and cursing at the top of his lungs but Carl \n               doesn't hear him.\n\n                                     SAM\n                         You fucker! You mother fucker! I had \n                         a life, Goddamn you. I had a life!\n\n               From the distance, we see Sam smashing into Carl. It is like \n               hitting the air. For all of his rage and bluster, there is \n               nothing he can do.\n\n               EXT. LOFT BUILDING - DAY\n\n               Molly, neatly dressed, exits her building and hails a cab. \n               She hops inside. Seconds later she hops out again, yelling.\n\n                                     MOLLY\n                         You white fascist bigot. Who do you \n                         think you are? Bed Stuy's part of \n                         New York, you know. This is America.\n\n               The driver speeds off. Molly gives him the finger.\n\n               EXT. BROOKLYN STREETS - ELEVATED TRAIN - DAY\n\n               Molly exits a subway station and walks toward 131st Street. \n               She is the only white woman on the block and heads turn as \n               she passes.\n\n                                     WOMAN\n                         Hey, Snow, you lost or sumpin'?\n\n               Molly pays no attention. Children run up to her, stare, and \n               run away.\n\n               TRACKING SHOT\n\n               When Molly turns down 131st Street, the crowds disperse and \n               she is all alone. There is a sense of menace in the air. A \n               group of young men sitting on a stoop watches as she walks \n               by. One of them whistles. Molly keeps walking.\n\n               EXT./INT. WILLIE'S BUILDING\n\n               Molly sees Willie's building. She walks into the dank lobby. \n               It is dark and full of shadows. Leaning close, she examines \n               the mail boxes. Willie's name is there. She backs away, \n               afraid.\n\n               INT. LIVINGROOM - DAY\n\n               A dresser drawer opens and a box labeled \"Sam's Things -- \n               Valuable\" is slowly pulled out. A hand reaches inside it and \n               extracts Sam's address book. As THE CAMERA PULLS BACK, we \n               see that it is Carl standing in Molly and Sam's livingroom. \n               Carl opens the book and quickly jots down a series of code \n               numbers he finds in the back. His eyes sparkle with \n               excitement.\n\n               INT. POLICE STATION - DETECTIVE'S OFFICE - DAY\n\n               Molly is sitting in a room opposite DETECTIVE SERGEANT THOMAS \n               BEIDERMAN, 48, and SERGEANT DOROTHY WALLACE, 29. Both officers \n               are staring at her as she speaks. She seems very \n               uncomfortable.\n\n                                     MOLLY\n                         Look, you've gotta believe me. I \n                         don't even believe this stuff, myself. \n                         But this is real. Do you think I'd \n                         come here if it wasn't real? You \n                         told me to come if I had any new \n                         information. Well, here I am.\n\n               The officers don't respond.\n\n                                     MOLLY\n                              (continuing)\n                         Don't look at me like that. You guys \n                         use psychics all the time.\n\n               There is dead silence.\n\n                                     MOLLY\n                              (continuing)\n                         Damn it. I know how this sounds. I \n                         hear myself saying it and I want to \n                         cringe. But this woman knew things \n                         she couldn't have known, intimate \n                         details.\n\n                                     WALLACE\n                         How intimate?\n\n                                     MOLLY\n                         Things Sam only said to me.\n\n                                     WALLACE\n                              (smirking)\n                         Okay, let me get this straight. \n                         According to this psychic lady, there \n                         are ghosts and spirits all over the \n                         place, watching us all the time, \n                         huh?...\n                              (she stands up)\n                         I'm sorry. I've got important things \n                         to do.\n\n               She leaves the room. Molly gives her a dirty look and turns \n               to Beiderman.\n\n                                     MOLLY\n                         I'm telling you. The killer's name \n                         is Willie Lopez. I've got his address. \n                         You've got to check it out.\n\n               Sgt. Beiderman gets up and looks over to Molly.\n\n                                     SGT. BEIDERMAN\n                         Okay. You just wait here. Let me see \n                         if this guy's got a record.\n\n               He heads out of the room. Molly sits back with an air of \n               enormous relief and gratitude. Sergeant Wallace comes into \n               the room again and picks up a folder. Molly waits nervously. \n               After a moment Sergeant Beiderman returns with a police file \n               in his hands. Molly looks up at him, and then smiles at \n               Wallace as she sees it. She feels vindicated. He lays the \n               thick folder on the desk and opens it up. She hurries over \n               to him.\n\n                                                                    CUT TO:\n\n               MUG SHOTS OF ODA MAE\n\n               and reams of police paperwork. WIDEN as Molly stares at it \n               all in sudden shock.\n\n                                     MOLLY\n                         What are you doing? Where's your \n                         file on Willie Lopez?\n\n                                     SGT. BEIDERMAN\n                         There's no file for a Willie Lopez. \n                         He was probably some old boyfriend \n                         she was trying to get even with. \n                         This psychic woman's record goes \n                         back a long way. Fraud, numbers \n                         rackets, you name it. She's a real \n                         pro.\n\n               CUT BACK AND FORTH between the records and Molly's stunned \n               reaction. We see recent photos of Oda Mae and others going \n               back to her youth. They are fascinating and revealing. We \n               even see photos of her mother and grandmother. In addition, \n               there are pages of arrest records and prison files.\n\n                                     SGT. BEIDERMAN\n                              (continuing)\n                         1967. Shreveport, Louisiana. Forgery, \n                         selling false ID. Served one year. \n                         1971. Baton Rouge. Arrested for fraud, \n                         numbers racketeering. Served ten \n                         months. 1974. Hattiesburg, \n                         Mississippi. Fraud, seven months. \n                         1984. Albany, New York. Petty larceny. \n                         It goes on and on.\n\n               Molly is overwhelmed by the evidence.\n\n                                     SGT. BEIDERMAN\n                              (continuing)\n                         This woman's a charlatan. You can't \n                         believe anything she said.\n\n                                     MOLLY\n                         This isn't possible. There were words, \n                         private things. How could she have \n                         known all that?\n\n                                     SGT. BEIDERMAN\n                         They have ways.\n\n                                     MOLLY\n                         Ways? What ways?\n\n                                     SGT. BEIDERMAN\n                         They've got a million cons. A lot of \n                         times they read the obits. All she \n                         had to do was see the word \"banker\". \n                         Hell, they even go through your \n                         garbage to find things they can use, \n                         letters, old papers. They don't need \n                         much.\n\n               Molly turns away.\n\n                                     SGT. BEIDERMAN\n                              (continuing)\n                         I bet you threw stuff out, huh? It \n                         could have been anything. What about \n                         that underwear she knew all about?\n\n               Molly's eyes widen.\n\n                                     SGT. BEIDERMAN\n                              (continuing)\n                         Green underwear. I'll bet she zeroed \n                         right in on that.\n\n                                     MOLLY\n                         No! She was real. She said things. \n                         She knew about a sweater I knitted, \n                         about songs we sang... She knew about \n                         this place we went, Montego Bay...\n\n               Molly begins to cry.\n\n                                     SGT. BEIDERMAN\n                         I'm sorry. I know this is hard. People \n                         want so much to believe. They're \n                         grieving, vulnerable. They'd give \n                         anything for one last moment... money, \n                         insurance policies. Believe me, these \n                         people know what they're doing. Look, \n                         I know how you must feel. You know, \n                         you can press charges.\n\n               Molly shakes her head no. Sgt. Beiderman closes the file. \n               Molly sits for a long time. She is in terrible pain.\n\n                                     MOLLY\n                         Oh God, I wanted it to be Sam.\n\n               Sgt. Beiderman nods his head compassionately and then turns \n               away.\n\n               INT. BEDROOM - LATE AFTERNOON (THE SAME DAY)\n\n               Molly is sitting in her bedroom. The glow of the late \n               afternoon sunlight casts long shadows across the bed. She \n               seems deeply depressed and alone. Gradually her gaze falls \n               on a jar sitting on the nightstand. In it is the penny Sam \n               found when they were first working on the loft. A label on \n               the jar says, \"For Luck!\" In a moment of sudden rage, she \n               picks it up and throws it against the wall. It SHATTERS on \n               the floor.\n\n               INT. CARL'S OFFICE - NIGHT\n\n               The code from Sam's address book, jotted on a piece of paper, \n               is sitting beside Carl.\n\n                                     CARL\n                              (excitedly)\n                         God, let this be it!\n\n               Anxiously, Carl punches the code into a computer and, \n               suddenly, Sam's old accounts appear on the screen. A look of \n               relief wafts across Carl's face.\n\n                                     CARL\n                              (continuing)\n                         Oh God, yes!\n\n               Carl is staring at the same accounts Sam was examining the \n               afternoon before he was killed, the accounts with too much \n               money in them.\n\n               Carl picks up the phone and punches a number. Someone answers.\n\n                                     CARL\n                              (continuing)\n                         Tony, this is Carl. I'm all set. \n                         We're fine. Everything's fine. Just \n                         tell me what you want me to do.\n\n               A VOICE on the other end begins to speak.\n\n                                     VOICE\n                         We want you to transfer the money \n                         from the 12 separate accounts into a \n                         single account under the name \"Rita \n                         Miller\". Tomorrow, at five minutes \n                         before closing, 3:55 p. m., transfer \n                         the full account to First Island \n                         Bank of Nassau, registry number 486-\n                         9580.\n\n               Carl writes it all down.\n\n                                     VOICE\n                              (continuing)\n                         Call us when it's done.\n\n                                     CARL\n                         Tell Mr. Balistrari there won't be \n                         any problems.\n\n                                     VOICE\n                         I'll do that.\n\n               Carl hangs up. He seems deeply relieved.\n\n               REVEAL SAM\n\n               He is standing in front of Carl, watching. Quickly, Carl \n               begins punching commands into the computer. He is setting up \n               the dummy account. Rita Miller, #926-31043.\n\n               INT. LOFT - THE SAME NIGHT\n\n               Molly, in a short terrycloth robe, is sitting in a chair. A \n               magazine is on her lap but she is staring vacantly into the \n               loft. She seems lost in the vast space. Sam is pacing back \n               and forth. There is a melancholy look in his eyes.\n\n                                     SAM\n                         Why can't you hear me, Molly? I need \n                         you.\n\n               Suddenly the BELL rings. Molly jumps.\n\n               Molly's finger is on the intercom. She seems unsettled.\n\n                                     MOLLY\n                         Who's there?\n\n                                     CARL\n                         Molly, it's Carl. Can I come up?\n\n               Sam freezes. Molly is surprised. She hesitates a moment and \n               then pushes the buzzer to let him in. We hear Carl bounding \n               up the stairs.\n\n                                     SAM\n                         Don't open it. He's a murderer, Moll!\n\n               There is a KNOCK. Molly opens the door. Carl seems buoyant, \n               almost celebratory. He has a bag of fruit in his hand. He is \n               still in a suit and tie.\n\n                                     CARL\n                         Hi. Thanks. I know it's late. I'm \n                         sorry to disturb you. I felt bad \n                         about last night. This supernatural \n                         stuff just makes me so uncomfortable. \n                         I don't even read horoscopes.\n\n                                     MOLLY\n                         Don't worry. It's okay.\n\n                                     CARL\n                         No it's not. You needed me to hear \n                         you and I didn't and that was wrong. \n                         I want you to know that I'm your \n                         friend, Moll.\n\n                                     SAM\n                         You were never our friend.\n\n                                     CARL\n                              (holding out a paper \n                              bag)\n                         Hey, I brought you some Japanese \n                         apple pears. I know you like them.\n\n                                     MOLLY\n                              (taking the bag)\n                         Oh, that's so sweet.\n\n                                     CARL\n                         Listen, can I come in for a minute? \n                         I won't stay long. I've had one of \n                         those days. Maybe a cup of coffee?\n\n                                     SAM\n                         No, Moll. Don't do it. Don't let him \n                         in!\n\n                                     MOLLY\n                              (hesitating)\n                         Sure.\n\n               OMITTED\n\n               INT. LIVINGROOM - NIGHT\n\n               Carl, in shirt sleeves and Molly in her robe, are sitting on \n               the couch drinking coffee. We notice that Carl is wearing \n               yellow suspenders. Sam is beside himself, watching them.\n\n                                     MOLLY\n                         Are you alright? You look nervous, \n                         upset.\n\n                                     CARL\n                              (glancing at her thighs)\n                         What can I tell you. It's been tough. \n                         Hell, you know. It still hurts so \n                         much.\n                              (he poses sadly)\n                         Then on top of it all... it's the \n                         responsibilities. They've given me \n                         my own accounts, but I've had no \n                         time to adjust. My mind has been \n                         reeling.\n\n               Molly reaches out and pats his arm. There is an awkward pause.\n\n                                     CARL\n                              (continuing)\n                         Where were you this morning? I thought \n                         you were coming to the bank to sign \n                         those papers.\n\n                                     MOLLY\n                         I didn't have time.\n                              (beat)\n                         I went to the police, Carl.\n\n               Sam looks at her, amazed. Carl, on the other hand, stiffens. \n               He laughs nervously.\n\n                                     CARL\n                         You're kidding. You really did it? I \n                         don't believe... What did you tell \n                         them? What did they say?\n\n                                     MOLLY\n                         You were right, you know. I felt \n                         like such a fool. They brought out a \n                         file on this psychic woman ten inches \n                         thick. It was awful.\n\n                                     CARL\n                              (relieved)\n                         A ripoff artist, huh?\n\n                                     SAM\n                              (shocked)\n                         Molly, no.\n\n                                     MOLLY\n                         The sad part is that I believed her. \n                         I believed her, Carl.\n                              (pause)\n                         It was all a sham.\n\n                                     CARL\n                              (relaxing)\n                         Sometimes we need to believe.\n\n                                     MOLLY\n                         Why?... I was a fool. I don't believe \n                         anything anymore. Why would people \n                         do such things?\n\n               Sam is devastated.\n\n                                     CARL\n                              (milking it)\n                         It's hard to face reality, Moll, the \n                         hard cold facts of it. What you have \n                         to remember is the love you felt. \n                         That's what's real. You have to \n                         remember how good Sam was. How much \n                         he loved you.\n\n               Molly holds back tears. Carl reaches out tenderly and strokes \n               her hair.\n\n                                     CARL\n                              (continuing)\n                         You were everything to him, Molly. \n                         You were his life.\n\n                                     MOLLY\n                              (finally crying)\n                         I feel so alone.\n\n                                     CARL\n                         You're not alone. You're young. You've \n                         got so much talent. You're \n                         fantastically gorgeous.\n\n                                     MOLLY\n                              (appreciating his \n                              words)\n                         Oh God, I don't know what's real \n                         anymore. I don't know what to think.\n\n                                     CARL\n                         Just think about Sam. Think about \n                         what he meant to you, the years you \n                         had together, how wonderful they \n                         were.\n\n               Carl glides his hand slowly, lovingly across her cheek.\n\n                                     CARL\n                              (continuing)\n                         Let your feelings out.\n\n               Almost imperceptibly, his hand moves down to the nape of her \n               neck. As she moves, her robe opens slightly. Carl notices, \n               glimpsing her nakedness beneath it. Sam notices, too. He \n               freezes.\n\n                                     CARL\n                              (continuing)\n                         Life turns on a dime, Moll. People \n                         think they have forever, that they'll \n                         always have tomorrow. But it's not \n                         true. Sam taught us that. We have to \n                         live for now, for today.\n\n               Molly can barely contain her tears. Carl moves toward her \n               moist cheeks and kisses them gently. Slowly, he guides his \n               lips to her neck and kisses it, too. It is all hateful and \n               sensual at the same time. Sam turns away.\n\n               Molly feels Carl's tenderness, needs it. She does not notice \n               his hand reaching for the cord on her robe and slowly pulling \n               it toward him. With a little tug the cord unravels and the \n               robe falls open. Molly is confused, aroused, not sure what \n               to do. She starts to pull it closed. He holds her hand. For \n               a moment they do nothing. Then his fingers reach for her \n               thigh. Her body quivers. Carl feels her openness and pulls \n               closer, his hand rising gently up her naked body.\n\n               Molly's eyes close. She says nothing.\n\n                                     SAM\n                         No!!!\n\n               OMITTED\n\n               ANGLE\n\n               Sam charges wildly at the couch and begins flailing \n               uncontrollably at the two of them. Unexpectedly his foot \n               kicks out and hits a framed photograph of him and Molly that's \n               sitting on an end table. The picture CRASHES to the floor, \n               the glass SHATTERING.\n\n               Molly jumps up, the mood suddenly broken. She sees the photo \n               and recoils. Carl reaches for her. She backs away.\n\n               Sam is stunned by what has happened. He jumps up and tries \n               kicking over another picture but nothing moves. His foot \n               goes right through it.\n\n               Molly looks at Carl, drying her tears.\n\n                                     MOLLY\n                         I can't. I'm sorry. I can't. It's \n                         too soon... You've been great Carl, \n                         but... I need you to leave. Please. \n                         I need you to.\n\n                                     CARL\n                         Sure. It's okay. I understand. I \n                         really do.\n\n               She reaches out and takes his hand.\n\n                                     CARL\n                              (continuing)\n                         Look, what if we have dinner tomorrow \n                         night? Just talk. Can I interest you \n                         in that?\n\n                                     SAM\n                         NO!!!\n\n               Molly hesitates a moment and then nods her head \"yes\". Carl \n               smiles.\n\n               INT. SUBWAY STATION - NIGHT\n\n               Sam rushes madly down a flight of stairs into a subway \n               station. A train is just leaving. He jumps on board.\n\n                                                                    CUT TO:\n\n               INT. SUBWAY TRAIN - NIGHT\n\n               Sam begins quickly casing the aisles, looking for something. \n               It is not there. Another train can be seen speeding past the \n               window. Sam takes a running leap and jumps onto it, passing \n               through the walls.\n\n                                                                    CUT TO:\n\n               OMITTED\n\n               ANGLE - SAM\n\n               disappointed. Suddenly, an express train passes alongside \n               his local. Sam sticks his face inside it. Suddenly, he smiles \n               and rushes onto it.\n\n               ANGLE\n\n               Sam does not have to stand there long. Within seconds, the \n               terrifying Ghost he had seen before comes charging at him. \n               We notice him more clearly now. He is wearing a dark blue \n               pea coat. There is a grizzled look about him. He has stained \n               teeth and seems perpetually unshaven.\n\n                                     GHOST\n                         Get off my train!\n\n               This time Sam does not back away. He holds his ground. The \n               Ghost lets fire every trick in his arsenal. Posters come \n               flying off the walls. A bag of groceries topples from a \n               woman's arms, an old man's cane flies across the aisle, a \n               boy's Mets cap flips off his head. People on the train move \n               quickly to other cars.\n\n               Unable to frighten him, the Ghost kicks Sam in the stomach. \n               Sam recoils, feeling it, but gets back up again. He is angry \n               now. He begins raging at the other Ghost. The Ghost is \n               shocked.\n\n                                     SAM\n                         Teach me how you do that! I want to \n                         learn! I'm not leaving til you teach \n                         me!\n\n               The Ghost, exhausted, looks up at him and smiles with \n               appreciation.\n\n                                     GHOST\n                         You stubborn asshole.\n\n               Sam nods in agreement.\n\n                                                                    CUT TO:\n\n               SAM AND THE GHOST\n\n               sitting in the corner of a deserted subway station. Sam is \n               trying desperately to push a bottle cap with his finger.\n\n                                     GHOST\n                              (continuing)\n                         What are you doing? What are you \n                         doing? You can't push it with your \n                         finger. You're dead.\n\n               The Ghost demonstrates, kicking a garbage pail onto its side. \n               Sam can't quite tell how he did it.\n\n                                     SAM\n                         I don't get it.\n\n                                     GHOST\n                         It's your mind, you idiot. It's all \n                         in the mind. The problem is you think \n                         you're still real, that you're \n                         standin' on the floor, that you're \n                         wearin' those clothes. Bullshit! You \n                         don't even have a body anymore. It's \n                         all up here. You wanna move things, \n                         you gotta use your mind. You gotta \n                         focus! You hear what I'm saying?\n\n                                     SAM\n                         How do you focus?\n\n                                     GHOST\n                         I don't know how you focus! You just \n                         focus!\n\n               With surprising energy, the Ghost flicks a bottle cap and \n               sends it shooting across the subway platform.\n\n                                     GHOST\n                              (continuing)\n                         It's all in the anger. You gotta \n                         direct it. You gotta channel it.\n\n                                     SAM\n                         I'm angry all the time. It doesn't \n                         do a thing.\n\n                                     GHOST\n                         Cause you're angry all over. You \n                         gotta be angry here, in the pit of \n                         your stomach. Bring it down here. \n                         Let it explode.\n                              (he makes an explosive \n                              gesture)\n                         It's like a reactor, you know. Pow!\n\n               He kicks a Coke can toward Sam. Sam tries to kick it back \n               and misses. The Ghost laughs. Sam gets angry. He tries again \n               and falls on his head. The Ghost laughs louder. Now Sam is \n               really angry. We see him forcing the anger down into his \n               stomach. He holds still for a moment and then kicks at the \n               can with all his might. To his shock and amazement, it sails \n               right through the Ghost's head. The Ghost smiles.\n\n                                     SAM\n                         I did it!\n\n                                     GHOST\n                         Way to go.\n\n                                                                    CUT TO:\n\n               SAM\n\n               practicing. He smashes at an abandoned tennis shoe with his \n               fist. Nothing happens.\n\n                                     GHOST\n                         From your gut. What do I keep tellin' \n                         you?\n\n               Sam's stomach bulges. He tries again. Nothing.\n\n                                     GHOST\n                              (continuing)\n                         Give it time! What else have you \n                         got?\n\n               Undaunted, Sam tries once more. This time the tennis shoe \n               moves. The Ghost nods his head approvingly. Sam is thrilled.\n\n                                     SAM\n                         How long have you been here?\n\n                                     GHOST\n                         Since they pushed me.\n\n                                     SAM\n                         Someone pushed you?\n\n                                     GHOST\n                         Yeah, someone pushed me!\n\n                                     SAM\n                         Who?\n\n                                     GHOST\n                         What? You don't believe me? You think \n                         I fell? You think I jumped? Well, \n                         fuck you!\n                              (an unexpected rage \n                              starts to build)\n                         It wasn't my time! I wasn't supposed \n                         to go! I'm not supposed to be here!\n\n               Venom spews from the Ghost's mouth. Suddenly he rams a \n               cigarette machine full force with his head. The glass SHATTERS \n               and packs of cigarettes scatter everywhere. He throws himself \n               on top of them with terrible longing.\n\n                                     GHOST\n                              (continuing)\n                         I'd give everything for a drag. Just \n                         one drag.\n\n               He rolls and wallows in terrible frustration, tossing the \n               cigarettes in all directions. Suddenly he looks up and sees \n               Sam. He is unable to control his fury.\n\n                                     GHOST\n                              (continuing)\n                         Who the hell are you? Why are you \n                         hounding me like this? Leave me alone.\n\n               AN EXPRESS TRAIN\n\n               is shooting through the station. The Ghost throws himself \n               into it and in an instant he is gone.\n\n               OMITTED\n\n               INT. SUBWAY STATION - NIGHT\n\n               Sam, all alone, walks through the station. Suddenly, he \n               reaches out and pushes a garbage can lid. It swings back and \n               forth. He is delighted. A beer can is sitting on a bench. He \n               pushes it off, watching it roll across the platform with \n               childlike glee.\n\n               Looking up, Sam sees an advertisement for Market Security \n               Bank and Trust. He stares at it with great interest. \"Special \n               Banking for Special People. We make it easy for you.\" \n               Something registers in Sam's eyes. He yells and jumps straight \n               up, hitting a subway sign with his finger. With great \n               excitement, he runs for the stairs and rushes from the \n               station.\n\n               OMITTED\n\n               INT. SEANCE ROOM - NIGHT\n\n               ORTISHA JONES, a black woman with brassy red hair, is sitting \n               at Oda Mae's seance table surrounded by several of her \n               relatives. Clara and Louise stand behind Oda Mae helping \n               with the ritual. Oda Mae goes into her trance.\n\n               ANGLE\n\n               A GROUP OF GHOSTS is milling behind Oda Mae. Sam comes barging \n               into the room and looks at them in amazement.\n\n                                     SAM\n                         What the hell?\n\n               Oda Mae, startled, jumps up in her chair. Everyone else jumps, \n               too. Clara and Louise look worried.\n\n                                     ODA MAE\n                         Sam?\n\n                                     SAM\n                         What is all this? What's goin' on?\n\n                                     ODA MAE\n                         What'd you do, tell every spook in \n                         town about me? I got spooks from out \n                         of town here. There's stuff goin' on \n                         you wouldn't believe. I can't hardly \n                         believe it myself.\n\n               Ortisha and her relatives look up, confused.\n\n                                     SAM\n                         Oda Mae. You're doing it. This is \n                         for real. How do you like that?\n\n                                     ODA MAE\n                         I don't.\n\n                                     SAM\n                         Come on. Look at this. You're doing \n                         great.\n\n               One of the GHOSTS standing in the background butts in.\n\n                                     GHOST\n                         Can you hurry this up? My husband's \n                         in the waiting room.\n\n                                     SAM\n                         I need your help, Oda Mae. There's \n                         something we need to do.\n\n                                     ODA MAE\n                         Forget it. I'm not doin' anything. \n                         You're holdin' on to a life that \n                         don't want you no more. Give it up.\n\n                                     SAM\n                         Give it up? I'm already dead.\n\n                                     ODA MAE\n                         Dead, yeah, but you ain't finished \n                         dyin'. Give up the ghost.\n\n                                     SAM\n                         And how am I supposed to do that?\n\n                                     ODA MAE\n                         You're asking me?\n\n               Ortisha looks at Oda Mae. She has no idea what's going on.\n\n                                     ORTISHA\n                         Are you speaking to me?\n\n                                     ODA MAE\n                         Does it look like I'm speakin' to \n                         you?\n                              (continuing; to Sam)\n                         So, are you gonna leave or not? I've \n                         got work to do.\n\n               Ortisha is totally confused. Oda Mae turns back to her.\n\n                                     ODA MAE\n                              (continuing)\n                         What's a matter? You're supposed to \n                         be concentrating. How do you expect \n                         me to do this if you're not \n                         concentrating? Okay then. You ready? \n                         Let's do it.\n\n               ANGLE\n\n               Oda Mae and everyone in the room gets very quiet. One of the \n               ghosts draws close. Oda Mae's eyes roll up into her head. \n               Then, suddenly, an extraordinary thing occurs. We see the \n               spirit pull back and dive right into Oda Mae. Oda Mae gulps. \n               Her nostrils flare. Her eyes bulge.\n\n                                     ODA MAE\n                         Oh, Lord! Stop! Whatcha doin' to me?\n\n               Oda Mae's body goes into bizarre convulsions as the Ghost \n               tries to move inside her. She looks strangely stuffed and \n               enormously uncomfortable.\n\n               Sam and the others watch in astonishment as she tries to \n               speak, but nothing comes out.\n\n               Then suddenly the GHOST speaks through Oda Mae.\n\n                                     ORLANDO\n                              (screaming)\n                         Ortisha?!\n\n               Ortisha and her relatives jump up in amazement.\n\n                                     ORTISHA\n                              (excitedly)\n                         Orlando! Is that you?\n\n                                     ORLANDO\n                              (disoriented)\n                         Ortisha, where are you? I can't see \n                         too good.\n\n                                     RELATIVES\n                         Here! She's here!\n\n                                     ORTISHA\n                         In front of you! I'm right here!\n\n               Orlando suddenly zeros in on Ortisha. His eyes widen.\n\n                                     ORLANDO\n                         Mother of God, what've you done to \n                         your hair!?\n\n               Ortisha smiles excitedly.\n\n                                     ORTISHA\n                         Orlando, do you like it? It's Autumn \n                         Sunrise.\n\n               Suddenly Oda Mae's body begins to shake wildly and her voice \n               booms out, screaming with all her might.\n\n                                     ODA MAE\n                         Get out of here, you little shit!\n\n               With frightening speed, she sends the spirit catapulting out \n               of her body. Clara and Louise jump up. Oda Mae is shaking.\n\n                                     ODA MAE\n                              (continuing)\n                         Lord oh Lord, don't you ever do that \n                         to me!\n\n                                     ORTISHA\n                              (confused)\n                         Orlando!?\n\n               ANGLE ORLANDO\n\n               He is lying on the floor, exhausted.\n\n                                     ORLANDO\n                         What happened to me? I can barely \n                         move.\n\n                                     GHOST\n                         You should know better than to try \n                         that. It's not worth it. It'll wipe \n                         you out for days.\n\n                                     SAM\n                         That was incredible, Oda Mae.\n\n                                     ODA MAE\n                         Never again. Never.\n\n                                     ORTISHA\n                         Where's Orlando?\n\n                                     SAM\n                         He spoke through you. It was amazing.\n\n                                     ODA MAE\n                         No more, uh uh, no more.\n\n                                     ORTISHA\n                         What happened to Orlando? Where'd he \n                         leave the insurance policy?\n\n                                     SAM\n                         You're great, Oda Mae! You're a real \n                         medium. It's what you were born for.\n\n                                     ODA MAE\n                         I want everybody out.\n\n                                     ORTISHA\n                         Orlando?\n\n               Ortisha looks around the room, befuddled. Clara and Louise \n               aren't sure what to do.\n\n                                     ODA MAE\n                         Now!\n\n               Ortisha and her relatives scurry out fast. The ghosts, too, \n               begin passing through the wall. Oda Mae lays her head on the \n               table. Suddenly her whole body begins heaving. She is starting \n               to cry. Sam is surprised.\n\n                                     SAM\n                         Oda Mae, what's wrong?\n\n                                     ODA MAE\n                         Out! I said out! That means you, \n                         too!\n\n               Sam hesitates a moment and then respectfully follows the \n               others through the wall.\n\n               OMITTED\n\n               INT. SEANCE ROOM - NIGHT\n\n               Clara knocks on the seance room door and peeks in.\n\n                                     CLARA\n                         Oda Mae, there's a man here who says \n                         he has to see you right away.\n\n                                     ODA MAE\n                         I ain't seein' nobody.\n\n               Willie pushes his way into the room. Clara isn't sure what \n               to do. Oda Mae looks up. She does not know him.\n\n                                     WILLIE\n                         Are you the one that can talk to the \n                         dead?\n\n                                     ODA MAE\n                         I beg your pardon! I'm not seeing \n                         customers right now.\n\n                                     WILLIE\n                         I said I need to know if you're the \n                         one.\n\n                                     ODA MAE\n                         I'm the one. But not now.\n\n                                     WILLIE\n                         This is important. I have a friend. \n                         He died recently. Some say he was \n                         mugged. I think he was murdered.\n\n               Oda Mae stares at him curiously.\n\n                                     WILLIE\n                              (continuing)\n                         I'm told you can contact people like \n                         that. Is that true?\n\n                                     ODA MAE\n                         It's been known to happen. But it's \n                         not gonna happen now, so come back \n                         later.\n\n                                     WILLIE\n                         I can't wait til later.\n\n               He sits down across from Oda Mae and shows no signs of \n               leaving. Oda Mae observes him quietly for a moment.\n\n                                     ODA MAE\n                         What's your friend's name?\n\n                                     WILLIE\n                         Good question. Why don't you tell \n                         me?\n\n               Oda Mae glares at him.\n\n                                     WILLIE\n                              (continuing)\n                         You're the psychic, right?\n\n                                     ODA MAE\n                         This ain't no guessin' game.\n\n                                     WILLIE\n                         Then what is it, lady?\n\n                                     ODA MAE\n                         Lookit, I don't know what your trouble \n                         is...\n                              (getting nervous)\n                         Who are you?\n\n                                     WILLIE\n                         You're the mindreader. I hear you've \n                         been tellin' people about me for \n                         days. What's my name?\n\n               ANGLE - ODA MAE\n\n               confused and uncomfortable. Sam comes wandering back into \n               the room. His eyes bulge.\n\n                                     SAM\n                         Willie!\n\n                                     ODA MAE\n                         Willie!?\n\n               Willie sits straight up in his chair, amazed.\n\n                                     WILLIE\n                         How'd you know that?\n\n                                     ODA MAE\n                         Because I'm psychic.\n\n               With a sudden thrust, Oda Mae sends her foot shooting into \n               Willie's balls. As he recoils she knocks the table into his \n               lap and rushes for the closet. We see her barricade herself \n               in the hidden chamber.\n\n               Willie, shaking, scrambles to his feet and, before Sam can \n               stop him, BLASTS his gun at the closet door. It is riddled \n               with bullets. Sam screams out. Willie runs to the side door \n               and escapes to the street. Clara and Louise come rushing in.\n\n               Sam charges into the closet and sees that Oda Mae is safe \n               behind the false door. Then he hurries to the street.\n\n               OMITTED\n\n               EXT. STREET - NIGHT\n\n               Sam rushes to the sidewalk and looks in all directions. Willie \n               is nowhere to be seen. He hurries back to Oda Mae.\n\n               OMITTED\n\n               INT. SEANCE ROOM - NIGHT\n\n               The room is a disaster area, full of hysterical women. Oda \n               Mae is being dragged from the closet, unhurt but in a state \n               of shock.\n\n                                     ODA MAE\n                         He tried to kill me! Why? Why?\n\n               No one answers.\n\n                                     ODA MAE\n                              (continuing)\n                         Talk to me!\n\n               Her sisters start talking but she shoos them away.\n\n                                     SAM\n                         Oda Mae, we're in trouble...\n\n                                     ODA MAE\n                         We're in trouble? Who's we? You're \n                         already dead.\n\n                                     SAM\n                         I can stop them. But I can't do it \n                         alone. You've gotta help me.\n\n                                     ODA MAE\n                         Help you? It's me they're tryin' to \n                         kill.\n\n                                     SAM\n                         You're right. And they'll be back. \n                         I'm your only chance.\n\n                                     ODA MAE\n                         Why don't you go find a haunted house \n                         and rattle some chains.\n\n                                     SAM\n                         I need you Oda Mae. I need you to \n                         get some fake ID's.\n\n                                     ODA MAE\n                         Fake ID's? What for?\n\n                                     SAM\n                         Help me now, they'll never bother \n                         you again. I promise.\n\n                                     ODA MAE\n                              (stopping, thinking)\n                         Help you? Whataya talking about \n                         exactly? What else do I have to do?\n\n               EXT. NEW YORK STREET - DAY\n\n               Oda Mae, dressed to the hilt, is walking with Sam toward the \n               main branch of Market Security Bank & Trust. She seems nervous \n               and upset.\n\n                                     ODA MAE\n                         This is crazy. This ain't gonna work. \n                         I don't know nothin' 'bout bankin'.\n\n                                     SAM\n                         I'll teach you. You'll learn fast.\n\n               As they reach the entrance of the bank, they pass a pair of \n               NUNS collecting money to build a shelter for the homeless. \n               One of them holds out a collection box. Oda Mae passes her \n               by, carefully avoiding eye contact.\n\n               INT. MARKET SECURITY BANK & TRUST - DAY\n\n               Oda Mae enters Sam's bank. She seems completely out of place. \n               Sam, walking beside her, directs her every move.\n\n                                     SAM\n                         See where it says \"New Accounts\"? \n                         That's where you're going.\n\n                                     ODA MAE\n                              (paranoid)\n                         I'm not givin' 'em any money.\n\n                                     SAM\n                         Just do what I say.\n\n               Oda Mae approaches the New Accounts desk. She seems very \n               uptight. A woman OFFICER behind the desk looks up at her.\n\n                                     OFFICER\n                         Can I help you?\n\n                                     SAM\n                         Tell her you're here to fill out a \n                         signature card for a new account.\n\n                                     ODA MAE\n                         I'm here to fill out a signature \n                         card for a new account.\n\n                                     OFFICER\n                         And do you know your account number?\n\n                                     SAM\n                         Yes. 926-31043.\n\n                                     ODA MAE\n                         Yes. 926-31043.\n\n                                     SAM\n                         Rita Miller.\n\n                                     ODA MAE\n                         Who?\n\n                                     OFFICER\n                         What?\n\n                                     SAM\n                         Tell her Rita Miller.\n\n                                     ODA MAE\n                         Rita Miller.\n\n                                     OFFICER\n                              (eyeing her oddly)\n                         Didn't they have you sign a card \n                         when you opened the account?\n\n                                     SAM\n                         Tell her Carl Bruner opened it for \n                         you by phone and asked you to come \n                         in today.\n\n                                     ODA MAE\n                         Carl Bruner opened it for me. He \n                         asked me to come in today.\n\n                                     OFFICER\n                         Ah.\n\n               The Officer checks out the name and account number on her \n               computer screen. It all seems to jive. She pulls out a card \n               from her desk and hands it to Oda Mae. Oda Mae stares at it.\n\n                                     SAM\n                         Just sign you name at the bottom on \n                         the first blank line.\n\n               Oda Mae nods and starts to sign \"Oda Mae\". Sam stops her.\n\n                                     SAM\n                              (continuing)\n                         No, no, no. Rita Miller.\n\n                                     ODA MAE\n                              (to the officer)\n                         Can I have another one please? I \n                         signed the wrong name.\n\n               Sam hits his forehead with his hand. The Officer gives her \n               another card. Oda Mae signs it.\n\n                                     SAM\n                         Tell her to see that it goes right \n                         up to the third floor file since you \n                         have a transaction to make.\n\n                                     ODA MAE\n                         I need you to put that in the third \n                         floor file cause I got a transfusion \n                         to make.\n\n                                     OFFICER\n                         A what?\n\n                                     ODA MAE\n                         You know what I mean.\n                              (innocently)\n                         Umm, can I keep the pen?\n\n                                     OFFICER\n                              (surprised, not sure \n                              what to say)\n                         ...uh, sure.\n\n               Oda Mae, delighted, walks away smiling and gives the officer \n               a wave. She is loving this.\n\n                                     ODA MAE\n                         Thanks.\n\n               INT. CARL'S OFFICE\n\n               The clock on Carl's wall says 3:40. He seems anxious. The \n               phone RINGS. Carl jumps. He pushes down the speaker button.\n\n                                     CARL\n                         Hello. Carl Bruner speaking.\n\n                                     VOICE\n                         Carl?\n\n                                     CARL\n                         Mr. Balsitrari\n\n                                     VOICE\n                         Balistrari? Carl, it's me, John. \n                         I've got the info on the Bradley \n                         portfolio.\n\n                                     CARL\n                         Oh yeah, yeah. That's great. I'll \n                         pick it up later.\n\n               He hangs up. His hand is shaking.\n\n               INT. MARKET SECURITY BANK & TRUST - DAY\n\n               Sam and Oda Mae approach a fancy part of the bank housing \n               administrative personnel. They approach a GUARD who is \n               standing there.\n\n                                     SAM\n                         Tell the guard you're here to see \n                         Lyle Furgeson.\n\n                                     ODA MAE\n                         Lyle Furgeson, please.\n\n                                     GUARD\n                         Do you have an appointment?\n\n                                     ODA MAE\n                         No. I'm here for the fun of it.\n\n                                     SAM\n                         Don't say that! Tell him Rita Miller's \n                         here.\n\n                                     ODA MAE\n                         Tell him Rita Miller's here.\n\n                                     GUARD\n                         Just one moment, please.\n\n                                     SAM\n                         Don't embellish.\n\n                                     ODA MAE\n                         Yes, Sir.\n\n                                     GUARD\n                              (turning around)\n                         Excuse me?\n\n               She waves him on.\n\n                                     SAM\n                              (whispering)\n                         Now listen, this guy Furgeson's a \n                         real jerk.\n\n                                     ODA MAE\n                         Why are you whispering?\n\n                                     SAM\n                              (he doesn't know)\n                         Just be quiet and listen. I've known \n                         him five years and he still thinks \n                         my name's Paul.\n\n               We see the Guard leaning over Mr. Furgeson's desk. FURGESON \n               looks up and sees Oda Mae. He shrugs his shoulders.\n\n                                     SAM\n                              (continuing)\n                         He's a social moron. You don't have \n                         to worry about anything. Tell the \n                         guard Furgeson knows you. You spent \n                         time with him and his wife Shirley \n                         at the Brewster's Christmas party \n                         last year.\n\n               The Guard comes back.\n\n                                     GUARD\n                         What is this regarding?\n\n                                     ODA MAE\n                         What? He doesn't remember me? We \n                         were together at the Brewster's \n                         Christmas party. With his wife \n                         Shirley. They had that lovely tree... \n                         all those presents. Why, I'll never \n                         forget all those beautiful...\n\n               Sam pokes her. She yelps, surprised, and glances around. The \n               Guard gives her an odd look.\n\n                                     ODA MAE\n                              (continuing)\n                         Oops. Gas.\n\n               She forces a smile. He smiles back and then goes over to Mr. \n               Furgeson.\n\n                                     SAM\n                         This'll be easy. Furgeson was so \n                         drunk at that party, he could have \n                         had a conversation with Tina Turner \n                         and he wouldn't remember.\n\n               The Guard whispers in Furgeson's ear. Furgeson appears totally \n               flummoxed. He looks up at Oda Mae, embarrassed, and waves. \n               The Guard motions her to come back. She walks proudly over \n               to his desk. He sticks out his hand.\n\n                                     FURGESON\n                         Hello, hello. Of course, of course. \n                         It's been so long.\n\n                                     ODA MAE\n                         A long time.\n\n                                     SAM\n                         Ask how Bobby and Snooky are.\n\n                                     ODA MAE\n                         How are Bobby and Snooky doin'?\n\n                                     FURGESON\n                              (perplexed)\n                         Why, they're just fine, thank you. \n                         Nice of you to ask. And how is your... \n                         family?\n\n                                     ODA MAE\n                         Couldn't be better.\n\n                                     FURGESON\n                         Well, isn't that wonderful.\n\n                                     SAM\n                         Tell him you've been wondering how \n                         they did on the Gibraltar securities.\n\n                                     ODA MAE\n                         So tell me, Fergie, how did you do \n                         on the Gibraltar securities?\n\n                                     FURGESON\n                              (surprised)\n                         The Gibraltar securities! Well, it \n                         looks like we topped out, huh?\n\n                                     SAM\n                         \"We sure did!\"\n\n                                     ODA MAE\n                         We sure did.\n\n                                     FURGESON\n                              (impressed)\n                         That was a wonderful tip.\n\n                                     SAM\n                         \"Good old Randy\".\n\n                                     ODA MAE\n                         Good old Randy. Got a real head on \n                         his shoulders.\n\n                                     SAM\n                         \"Her\" shoulders.\n\n                                     ODA MAE\n                         \"Her\" shoulders.\n\n                                     FURGESON\n                         Sure does. Well... well. So what \n                         brings you here today?\n\n                                     SAM\n                         You're closing an account.\n\n                                     ODA MAE\n                         I'm closing an account.\n\n                                     FURGESON\n                         Well... wonderful. Do you have your \n                         account number?\n\n                                     SAM\n                         926-31043.\n\n                                     ODA MAE\n                         926-3143.\n\n                                     SAM\n                         31-0-43.\n\n               She looks up into the air. Furgeson eyes her strangely.\n\n                                     ODA MAE\n                         Make that 31-0-43... Numbers. I'm \n                         dyslexic.\n\n               He punches Rita Miller's number into the computer. A figure \n               appears on the screen. He stares at it for a few seconds and \n               then punches it in again.\n\n                                     FURGESON\n                              (trying to be calm)\n                         Well, Rita, you'll be withdrawing \n                         four million dollars from us today, \n                         is that correct?\n\n                                     ODA MAE\n                         Four million dollars?!\n\n                                     SAM\n                         Say \"yes\"!\n\n                                     ODA MAE\n                              (gasping)\n                         Yes! Four million. That's right. \n                         That's right.\n\n                                     FURGESON\n                         And how will you want that?\n\n                                     ODA MAE\n                         Tens and twenties?\n\n                                     FURGESON\n                         Pardon?\n\n                                     SAM\n                         A cashier's check! Tell him a \n                         cashier's check.\n\n                                     ODA MAE\n                         A cashier's check.\n\n                                     FURGESON\n                         Fine. Of course, you realize we're \n                         required to get some identification \n                         from everyone. It's just procedural. \n                         You understand.\n\n                                     ODA MAE\n                         Of course.\n\n               Oda Mae reaches into her purse and pulls out a DRIVER'S \n               LICENSE and a SOCIAL SECURITY CARD. Furgeson gets up and \n               walks away from his desk. He seems unsteady on his feet. An \n               OFFICER at the next desk is using a Brillo pad to clean a \n               stain on her desk. Oda Mae smiles.\n\n                                     ODA MAE\n                         You know, if you put that Brillo pad \n                         in the freezer, it'll last twice as \n                         long.\n\n               The Officer nods appreciatively.\n\n               INT. CARD FILE ROOM - DAY\n\n               Furgeson lays Oda Mae's ID next to her signature card. The \n               signatures match up. He nods his head in approval.\n\n               INT. CARL'S OFFICE - DAY\n\n               Carl looks up at the clock. It is 3:50. He pushes down a \n               button on the phone. A SECRETARY answers.\n\n                                     SECRETARY (V.O.)\n                         Yes, Mr. Bruner.\n\n                                     CARL\n                         Get me the First Island Bank of \n                         Nassau. It's on the rolodex.\n\n               INT. MARKET SECURITY BANK & TRUST - DAY\n\n               Mr. Furgeson returns with Rita Miller's signature card and a \n               cashier's check for $4,000,000. Oda Mae's hand shakes as she \n               examines it.\n\n                                     FURGESON\n                         I'll just need your signature right \n                         here.\n\n                                     ODA MAE\n                         Sure.\n\n                                     SAM\n                         Sign Rita Miller.\n\n               Sam looks up and gulps. Molly has just entered the bank and \n               is heading toward them. He jumps up nervously.\n\n                                     SAM\n                              (continuing)\n                         I'll be back in a minute. You're on \n                         your own. Don't say anything foolish.\n\n               Oda Mae signs a form closing the account. Of course the \n               signatures match. Mr. Furgeson examines them both and smiles. \n               He shakes Oda Mae's hand.\n\n                                     FURGESON\n                         Now you be careful with this. It's \n                         like carrying cash, you know.\n\n                                     ODA MAE\n                              (positively glowing)\n                         I sure do.\n\n               Sam rushes over to Molly. He is not sure what to do. He \n               notices a stack of deposit forms on the counter she is about \n               to pass. He hurries to it and flicks the entire stack, a \n               hundred sheets, flying up into the air. Molly, confused, \n               thinks she is responsible and stoops to pick them up. Sam, \n               delighted, flicks another stack.\n\n               Oda Mae is talking a blue streak when Sam returns to her.\n\n                                     ODA MAE\n                              (continuing)\n                         Then my mother took all the money \n                         from the oil wells and put it in \n                         gasoline pumps. Every gas station \n                         has 'em you know, sometimes six or \n                         more. It adds up.\n\n                                     SAM\n                         Oda Mae, come on. We gotta get out \n                         of here. Say goodbye.\n\n                                     ODA MAE\n                              (abruptly getting up)\n                         Well, I've got to leave. It's been a \n                         pleasure doin' business with you. \n                         Say \"hi\" to Shirley and Snooky for \n                         me.\n\n                                     FURGESON\n                         Thank you, Rita. I'll be glad to.\n\n               Oda Mae smiles and leaves. There is a new lilt in her walk. \n               Suddenly Sam looks and sees Molly about to stand up.\n\n                                     SAM\n                         Hurry up, Oda Mae.\n\n               At that second, Oda Mae spots a quarter lying on the ground. \n               She stoops down and picks it up.\n\n                                     ODA MAE\n                              (excitedly)\n                         What a day!\n\n               Molly sees her, does a double take, and starts to go after \n               her. Unfortunately, Oda Mae steps onto an elevator before \n               Molly can catch up. The doors close. Molly stops for a moment \n               and then looks back across to the executive area. She sees \n               Lionel Furgeson and hurries over to him.\n\n                                     MOLLY\n                         Lionel?\n\n               He is surprised to see her and grows instantly solicitous.\n\n                                     FURGESON\n                         Molly. How are you?\n\n                                     MOLLY\n                         Lionel, a woman who just left, a \n                         black lady, about my height, did you \n                         see her?\n\n                                     FURGESON\n                         Well, yes. I just took care of her.\n\n                                     MOLLY\n                         What did she want? Did it have \n                         anything to do with me? Did she ask \n                         about Sam?\n\n                                     FURGESON\n                              (not understanding)\n                         Sam? No. Why?\n\n                                     MOLLY\n                         Was her name Oda Mae Brown?\n\n                                     FURGESON\n                         No, Rita Miller. She just closed an \n                         account.\n\n               Molly stares at Furgeson. She is not sure what to think.\n\n                                     FURGESON\n                              (continuing)\n                         Is there a problem?\n\n                                     MOLLY\n                              (hesitating, not sure \n                              what to say)\n                         No. I guess not. Thanks.\n\n               She walks away, confused.\n\n               INT. CARL'S OFFICE - DAY\n\n               Carl, in front of his computer, is going crazy. He keeps \n               punching buttons on the keyboard but the same response appears \n               over and over on the screen. \"RITA MILLER, #926-31043. ACCOUNT \n               CLOSED. BALANCE $00.00.\"\n\n               Panicked, Carl jumps up. He moves quickly, erratically around \n               the office and then back to the computer. He punches the \n               keys over and over. The same answer appears on the screen. \n               The account is closed.\n\n               HALL OUTSIDE CARL'S OFFICE\n\n               Carl runs through the office. He seems crazed. People look \n               at him.\n\n                                     LEEDEN\n                         Carl, is something wrong?\n\n                                     CARL\n                         Is someone playing with the computers?\n\n                                     LEEDEN\n                         What?\n\n                                     CARL\n                         Is this a joke? One of my accounts \n                         is closed.\n\n                                     LEEDEN\n                         Which account? What's wrong?\n\n               Carl freezes. He doesn't answer.\n\n                                     LEEDEN\n                              (continuing)\n                         You want me to call someone?\n\n                                     CARL\n                              (changing his demeanor)\n                         No, no. Never mind. It's okay. It's \n                         all right. I can do it.\n\n               EXT. MARKET SECURITY BANK & TRUST - DAY\n\n               Sam and Oda Mae are walking down the street in front of the \n               bank. Oda Mae is talking to herself.\n\n                                     ODA MAE\n                         $4,000,000. $4,000,000. Lord Almighty.\n\n                                     SAM\n                         Oda Mae. Take the check out of your \n                         purse.\n\n               She stops. There is a nervous look on her face.\n\n                                     ODA MAE\n                         Take it out? Why?\n\n                                     SAM\n                         Just do it.\n\n               Oda Mae, worried, removes the check but holds onto it tightly.\n\n                                     SAM\n                              (continuing)\n                         Now endorse it. Sign Rita Miller.\n\n                                     ODA MAE\n                              (in shock)\n                         Endorse it? Why?\n\n                                     SAM\n                         Do what I say.\n\n                                     ODA MAE\n                         No!\n\n                                     SAM\n                         That's blood money, Oda. I was killed \n                         for that money. Endorse it now.\n\n                                     ODA MAE\n                         What are you going to do with it?\n\n                                     SAM\n                         We're giving it away.\n\n                                     ODA MAE\n                         Away? What do you mean? To who?\n\n                                     SAM\n                         Look to your left.\n\n               Oda Mae looks at the nuns collecting money for the homeless. \n               She recoils.\n\n                                     ODA MAE\n                         Are you outta your mind?\n\n                                     SAM\n                         Do what I tell you.\n\n                                     ODA MAE\n                         No!\n                              (clutching the check)\n                         I can't.\n\n                                     SAM\n                         Yes, you can. If you don't do it, \n                         they'll track you down. Your only \n                         protection is to get rid of it, now.\n\n                                     ODA MAE\n                         Sweet Jesus, you're killing me, Sam.\n\n                                     SAM\n                         I'm saving you, Oda Mae. You'll go \n                         to heaven for this.\n\n               Oda Mae growls at him.\n\n               With great difficulty, she approaches the nuns.\n\n               The nuns look at her with curiosity and compassion.\n\n                                     SAM\n                         Write \"St. Joseph's Shelter\".\n\n               With great hesitation, Oda Mae begins to write. We sense \n               that every word is a torment for her. The nuns politely avert \n               their eyes from the check.\n\n                                     NUN\n                         Bless you, child.\n\n               Oda Mae gives her a dirty look and hands the check over.\n\n                                     SAM\n                         I'm proud of you.\n\n                                     ODA MAE\n                         Don't you talk to me. I don't want \n                         you comin' round no more. I mean it. \n                         Understand?\n\n                                     SAM\n                         Come on, we're friends.\n\n                                     ODA MAE\n                         Friends? Friends?\n\n               She turns on her high heels and wobbles away. Sam calls after \n               her.\n\n                                     SAM\n                         I think you're wonderful, Oda Mae.\n\n               She growls again. In the background we see the nuns secretly \n               peeking at the check. One of them, wide-eyed, faints dead \n               away. The other nun stoops down and fans her face in an \n               attempt to revive her.\n\n               INT. CARL'S OFFICE - NIGHT\n\n               It is after hours. Almost everyone on the floor has gone. \n               Carl, hunched over his computer, is typing furious commands \n               on the keyboard. He looks haggard and worn.\n\n               Sequence after sequence of coded numbers flash past on the \n               monitor screen. Sam, sitting in a desk chair, watches, \n               smiling.\n\n                                     SAM\n                         Search, you bastard! You'll never \n                         find it. It's gone.\n                              (he smiles)\n                         They'll kill you for this, Carl. You \n                         and Willie. They'll wipe you off the \n                         face of the earth.\n\n               In a moment of childish delight, he pushes his feet against \n               the wall and the chair shoots across the room. Carl looks up \n               and sees an empty chair moving. He stares at it in confusion, \n               and then goes back to the screen. He seems desperate. Nothing \n               is working.\n\n               Panicked and frightened, Carl flicks off the machine and \n               storms furiously around the room. Sam approaches the computer, \n               hesitates a moment, and then pushes the power switch. The \n               computer CLICKS back on. Carl spins around. He stares at the \n               computer curiously for a moment and then turns it back off. \n               Sam, enjoying this, reaches for the switch and FLICKS it \n               back on again. Carl stares at it.\n\n                                     CARL\n                         What the...?\n\n               Carl watches as the keys seem to depress themselves and \n               letters begin appearing on the screen. He sits down, \n               mesmerized by what is happening. Then his face grows tense. \n               The word \"M-U-R-D-E-R-E-R\" is emerging before him.\n\n               Carl flies out of his chair, frantically running around to \n               see who else is on the floor. He yells out like a madman.\n\n                                     CARL\n                              (continuing)\n                         Who's doing that?\n\n               There is no one there. He hears the computer beginning to \n               type again and hurries back to look at the screen. One word \n               appears. \"S-A-M\".\n\n               Carl gasps and smashes the computer with his fist. It crashes \n               to the floor. Electrical sparks go flying as Carl gasps for \n               breath.\n\n               Sam cannot hold himself back any longer. With a horrifying \n               scream, he charges at Carl, jamming his fist hard into his \n               ribs.\n\n                                     SAM\n                         You bastard! You goddamn bastard!\n\n               Carl grabs his side.\n\n                                     CARL\n                         Ah!\n\n               He hits Carl again. Carl gasps in inexplicable pain.\n\n                                     SAM\n                         It's dinner time, Carl. Don't you \n                         have a date with Molly, you creepy \n                         son-of-a bitch?\n\n               Sam keeps hitting deeper into Carl's mid-section. Carl doubles \n               over as though he's going to throw up.\n\n                                     CARL\n                         Jesus! Oh God!\n\n               Sam is flushed with excitement. Carl kneels beside his desk. \n               He cannot understand what is happening to him. His face goes \n               stark white as the attack continues.\n\n               Then, unexpectedly, the assault stops. Sam, exhausted, stares \n               hatefully at his old friend cowering on the floor. Slowly \n               and dizzily, Carl gets up. He looks fearfully around the \n               office and then, holding his stomach, hurries from the room.\n\n               INT. LOFT - THE SAME NIGHT\n\n               Molly, all dressed to go out, is sitting in Sam's easy chair, \n               asleep. Suddenly Carl arrives knocking at her door. He does \n               not look well. Sam is with him.\n\n                                     MOLLY\n                         Carl? Where were you? I thought we \n                         were having...?\n\n                                     CARL\n                         I'm sorry. Things just got so crazy. \n                         I completely forgot.\n\n                                     SAM\n                         Old Carl had a little trouble at the \n                         office.\n\n                                     MOLLY\n                         Forgot? I was worried. Is everything \n                         okay? Are you all right?\n\n                                     CARL\n                         I'm okay. I'm alright. Look, can I \n                         talk to you for minute? Can I come \n                         in?\n\n               Molly eyes Carl with concern as he enters the loft.\n\n                                     CARL\n                              (continuing)\n                         I need to ask you a question.\n\n                                     SAM\n                         He needs to borrow four million \n                         dollars.\n\n                                     CARL\n                         Molly, I know what the police said, \n                         but when you thought Sam was here, \n                         when you thought he spoke to you, \n                         what did you feel? What did he say?\n\n                                     MOLLY\n                         Why? What happened?\n\n                                     CARL\n                              (very tense)\n                         Molly, that psychic woman, I want to \n                         know what she told you. I want to \n                         know what she said.\n\n                                     MOLLY\n                         Carl, stop this. It was all a hoax. \n                         I told you. It wasn't real. She's a \n                         charlatan.\n                              (she hesitates and \n                              stares at Carl)\n                         Does this have anything to do with \n                         her being at the bank today?\n\n                                     SAM\n                         Oh shit!\n\n                                     CARL\n                              (gulping)\n                         At the bank?\n\n               Sam tenses. He holds up his hand as if wanting her to stop.\n\n                                     MOLLY\n                         I was sure I saw her. Furgeson says \n                         she was taking out money. It turns \n                         out her name isn't even Oda Mae Brown. \n                         It's Rita Miller or something.\n\n               Carl turns white. His eyes bulge. He feels sick.\n\n                                     MOLLY\n                              (continuing)\n                         What's wrong?\n\n                                     CARL\n                         Stomach. My stomach. Do you have \n                         anything? Pepto Bismol.\n\n                                     MOLLY\n                              (worried)\n                         Sure. Just a second. What's going \n                         on?\n\n               Concerned, she hurries from the room. Sam digs his hands \n               into Carl's back. Carl jerks forward in intense pain and \n               begins flailing at the air.\n\n                                     CARL\n                         What are you doing to me. Get away! \n                         Get away!\n\n               INT. KITCHEN\n\n               Sam does not go away. Freaked, Carl runs into the kitchen \n               and rushes to the stove. Quickly he turns on the gas. He \n               looks crazed. Turning to the air, he begins whispering loudly.\n\n                                     CARL\n                         You touch me again and I'll set her \n                         on fire. I mean it. I'll kill her. \n                         I'll blow up the whole building if I \n                         have to. Stay away!\n\n               Sam jabs at the knob on the stove and begins to turn it off. \n               Carl sees it move. Shocked and frightened, he grabs it and \n               pulls it off, leaving only the tiny stem in place.\n\n                                     CARL\n                              (continuing)\n                         Go on, try it again. Let me see you \n                         turn it off now.\n\n               Sam, frightened, tries with all his might but he cannot twist \n               it. Carl pulls out a cigarette lighter and gloats.\n\n                                     CARL\n                              (continuing)\n                         Try and hurt me. I'll kill her if \n                         you hurt me.\n\n               Sam rushes at Carl about to jam his full fist into his chest, \n               but then he stops, afraid. He pulls back, shaken. Carl stands \n               there waiting for a blow that doesn't come. He begins to \n               gloat.\n\n                                     CARL\n                         What's a matter? You believe me, \n                         huh? You better believe me! I want \n                         my money. I need that money and I \n                         want it tonight -- at 11:00. If that \n                         psychic lady doesn't bring it here, \n                         Molly's dead.\n\n               Sam freezes. Molly enters the kitchen. She grabs her nose.\n\n                                     MOLLY\n                         Oh my God. Is that the gas?\n\n               Carl acts as if that's the reason he came into the kitchen.\n\n                                     CARL\n                         You must have left the stove on.\n\n               He fiddles with the dials and turns it off.\n\n                                     CARL\n                              (continuing)\n                         Just glad I smelled it.\n\n                                     MOLLY\n                              (confused)\n                         Me, too.\n\n               She opens a window.\n\n                                     CARL\n                         Molly, I'm sorry. I've got to go. \n                         Look, there's something going on. I \n                         can't talk now. Some trouble at the \n                         bank.\n\n                                     MOLLY\n                         Trouble? What kind of trouble? Is it \n                         that woman, the psychic?\n\n                                     CARL\n                         I don't have time to talk now. What \n                         if I come back? Around 11:00?\n\n                                     MOLLY\n                         Carl, what's going on? Let me help \n                         you.\n\n                                     CARL\n                         I can't. I'm sorry to do this, but \n                         it's important. I'll be back.\n\n               Molly is speechless.\n\n                                     CARL\n                              (continuing)\n                         Eleven!\n\n               OMITTED\n\n               INT. ODA MAE'S LIVINGROOM - NIGHT\n\n               Oda Mae is watching T.V. with Clara and Louise. Suddenly she \n               jumps, aware of Sam's presence in the room.\n\n                                     ODA MAE\n                         Sam!\n\n               Clara and Louise jump, too.\n\n                                     CLARA\n                         Not again!\n\n                                     ODA MAE\n                         What're you doin' here?\n\n                                     SAM\n                         Oda Mae! We're in trouble. They want \n                         the check. They're comin' to kill \n                         you. We gotta get outta here.\n\n                                     ODA MAE\n                         The check? What do you mean, \"the \n                         check\". You said they'd never find \n                         out.\n\n                                     CLARA\n                              (afraid)\n                         What's happenin' Oda Mae?\n\n               EXT. STREET\n\n               A red Mustang SCREECHES to a stop on the street below. Sam \n               and Oda Mae run to the window. Carl and Willie are looking \n               up.\n\n               INT. LIVINGROOM\n\n                                     SAM\n                         It's them.\n\n                                     ODA MAE\n                         They're comin' to kill me.\n                              (to Sam, crazed)\n                         What have you done?\n\n               EXT. ODA MAE'S APARTMENT BUILDING - NIGHT\n\n               Willie and Carl jump out of the car. They head for Oda Mae's \n               building.\n\n               INT. ODA MAE'S LIVINGROOM - NIGHT\n\n               Sam steps back from the window.\n\n                                     SAM\n                         They're heading for the door.\n\n                                     ODA MAE\n                              (terrified)\n                         Jesus have mercy.\n\n               EXT. APARTMENT BUILDING - NIGHT\n\n               Willie forces open a back door. They head into the building.\n\n               INT. APARTMENT HALLWAY - NIGHT\n\n               Oda Mae and the others hurry into the hall. They rush down \n               the corridor and knock loudly on a neighbor's door. A WOMAN \n               opens it a crack.\n\n                                     ODA MAE\n                         Emergency! Let us in!\n\n                                     WOMAN\n                         Who you kiddin'?\n\n               The Woman slams the door and locks it shut. Oda Mae looks \n               frightened.\n\n               INT. APARTMENT STAIRWAY - NIGHT\n\n               Carl and Willie climb the stairs two at a time.\n\n               INT. APARTMENT HALLWAY - NIGHT\n\n               Oda Mae and her sisters bang on another apartment door. No \n               one is home. Across the corridor an ELDERLY WOMAN sticks her \n               head out to see what is going on. Before she can say anything \n               they push their way inside.\n\n                                     ELDERLY WOMAN\n                         What're you doin'? You can't come in \n                         here. The cat don't like visitors. \n                         She'll pee all over the couch. You \n                         wanna pay for...\n\n               Oda Mae grabs the woman's mouth.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY - FISHEYE LENS VIEW\n\n               just as Willie and Carl emerge from the stairwell. They head \n               down the hall toward Oda Mae's door. Willie pulls out a gun, \n               and fires. The lock shoots open. They rush inside.\n\n                                                               CUT BACK TO:\n\n               ODA MAE\n\n               in the elderly woman's vestibule, peering through the \n               peephole. The old woman is struggling and still trying to \n               talk. Oda Mae's knees are wobbling.\n\n                                     ODA MAE\n                         They're gonna find us.\n\n                                     SAM\n                         No they won't. I'm gonna get 'em.\n\n                                     ODA MAE\n                         Oh yeah? And how you gonna do that?\n\n                                     SAM\n                         Whataya mean? I'm a ghost, aren't I?\n\n               INT. ODA MAE'S LIVINGROOM - NIGHT\n\n               Willie moves quickly through Oda Mae's apartment, his gun \n               pointed, ready to fire. He seems furious when he realizes no \n               one is there.\n\n                                     WILLIE\n                         Looks like someone just left.\n\n                                     CARL\n                         I'll check the building.\n\n               ANGLE\n\n               He rushes back out and down the stairs. Willie stays in the \n               apartment. Suddenly, the doorbell RINGS. Willie rushes over \n               and opens the door a crack. There is no one there. Confused, \n               he backs away. The doorbell rings again. Completely mystified, \n               he aims his gun and opens the door all the way. The hallway \n               is empty.\n\n               As Willie stands there, wondering what is happening, Sam \n               steps inside and pushes the door closed. It slams shut. Willie \n               nearly jumps out of his skin.\n\n                                     WILLIE\n                         Damn!\n\n               He stares at the door in total bewilderment. At that instant, \n               a collection of picture frames flies off the breakfront and \n               crashes into his legs. He backs away, spooked.\n\n               Suddenly, the T.V. flicks ON at full volume and then the \n               STEREO and the RADIO. Lights begin flashing on and off. Willie \n               spins around in total dismay.\n\n               Summoning all of his force, Sam slams into Willie. Willie \n               recoils in unexplainable pain. He seems very disoriented. \n               His gun falls to the floor. He reaches for it and Sam pushes \n               it away. Willie jumps up, afraid. His eyes dart around the \n               room. Sam laughs.\n\n                                     WILLIE\n                              (continuing)\n                         Who's there? Who's doing that?\n\n               ANGLE\n\n               A pair of candle holders shoot off the mantle piece and nearly \n               hit Willie in the head. He freaks. Grabbing his gun, Willie \n               runs into the bathroom and locks the door. Suddenly the hot \n               water faucet turns on by itself.\n\n               Willie is terrified. Steam rises from the sink. Willie tries \n               to get out, but Sam approaches him from behind and appears \n               to dig his hands into his neck. Willie crumples to his knees.\n\n                                     WILLIE\n                         Oh God!\n\n               There is a SQUEAKING SOUND and Willie looks up. Letters are \n               appearing in the fogged mirror. He stares in disbelief as \n               the word \"B-O-O!\" emerges before him. He cries out.\n\n                                     WILLIE\n                              (continuing)\n                         Let me outta here!\n\n               Shaking uncontrollably, Willie FIRES his gun at the mirror. \n               Glass and tiles EXPLODE. Willie is cut and bleeding. He grabs \n               hold of the door and yanks it open.\n\n               INT. HALLWAY\n\n               Willie rushes to the hallway, charges for the back stairs \n               and stumbles down the three flights to the street. Carl, \n               running down the corridor, rushes after him. Willie drops \n               his gun. Carl picks it up.\n\n               EXT. BROOKLYN STREET -- NIGHT\n\n               Willie runs from the building and careens down the sidewalk. \n               People clear a path as he hurls past them like a madman. \n               Carl, confused, runs after him.\n\n               Sam, too, races after Willie, unwilling to let him get away.\n\n               Suddenly, a man obstructs his way. Willie goes flying over \n               him and lands face down on the cement. Before he can get up, \n               Sam is all over him and does not let up. People stand back \n               to watch as Willie does battle with himself. Panicked, he \n               calls out to a bystander.\n\n                                     WILLIE\n                         Help me!\n\n               People back away. Carl watches in terror. He understands \n               exactly what is happening.\n\n               EXT. STREET - NIGHT\n\n               Willie, blinded by his own hysteria, runs wildly into the \n               street. Cars are bearing down on him from all directions. He \n               does not get out of their way.\n\n               One driver sees Willie coming and swerves to avoid him. His \n               car skids. Another car brakes to avoid a collision and \n               suddenly both cars crash right into him.\n\n                                     CARL\n                         Look out!\n\n               Willie's body is crushed instantly between the two vehicles \n               as his spirit is catapulted into the air still screaming and \n               writhing. His ghostly form reaches out to people for help as \n               they rush past. No one stops.\n\n               Willie spins around and sees a mangled body crumpled on the \n               street. Suddenly, he recognizes that it is his own dead body \n               lying there. He begins to scream.\n\n               A bizarre and frightening CLICKING SOUND fills the air. Sam \n               looks up. A group of strange dark figures has emerged from \n               the shadows.\n\n               With a loud, terrifying shriek, the dark forms swoop down \n               and grab hold of Willie. Sam freezes. In an instant they are \n               dragging Willie, kicking and screaming, down through the \n               sewer grates into the bowels of the earth.\n\n               ANGLE\n\n               Sam backs against a wall in absolute horror. Carl, standing \n               in the crowd, turns and runs.\n\n               INT. OLD LADY'S APARTMENT - NIGHT\n\n               Oda Mae and her sisters are huddling with the old woman in \n               the entryway to her apartment. They all appear frightened. \n               The door is opened a crack and they can see people gathering \n               in the hall outside.\n\n               Sam walks up to Oda Mae. She feels his presence.\n\n                                     ODA MAE\n                         Sam? What happened?\n\n                                     SAM\n                         He's dead, Oda Mae.\n\n                                     ODA MAE\n                         Dead!\n                              (she utters a sigh of \n                              relief)\n                         Oh, thank God. It's over.\n\n                                     SAM\n                         No. It's not over, Oda Mae. There's \n                         still Carl.\n\n               Oda Mae freezes. She turns to Sam.\n\n                                     ODA MAE\n                         Who's Carl?\n\n               INT. TAXI CAB - NIGHT\n\n               Sam and Oda Mae are in a taxi speeding downtown.\n\n                                     SAM\n                         Tell him to hurry!\n\n                                     ODA MAE\n                         Can't you hurry up?\n\n                                     DRIVER\n                         Listen, lady, I'm going as fast as I \n                         can.\n\n               Sam leans forward and pushes at the gas pedal. The cab shoots \n               forward. The driver seems shocked.\n\n                                     ODA MAE\n                         Problems?\n\n               He gives her a dirty look.\n\n               INT. LOFT - NIGHT\n\n               There is a KNOCK at the door. Molly goes to it. Fastening \n               the latch, she opens it a crack.\n\n                                     MOLLY\n                         Carl, is that you?\n\n               Oda Mae wedges her foot inside.\n\n                                     ODA MAE\n                         Molly, it's Oda Mae. I know what you \n                         think of me, but your life is in \n                         danger. You have to listen to me. \n                         Sam's here, too. You gotta let us \n                         in.\n\n               Molly tries to slam the door but hits Oda Mae's foot.\n\n                                     MOLLY\n                         Get the hell out of here. I'm calling \n                         the police.\n\n                                     ODA MAE\n                         Go ahead. We want you to call 'em. \n                         You're in trouble. Let us in.\n\n                                     MOLLY\n                         No!\n\n                                     ODA MAE\n                         Sam's death was no accident. He was \n                         murdered, Molly. Carl was laundering \n                         money at the bank. Sam found out. \n                         He's dangerous. He tried to kill me. \n                         He'll kill you, too.\n\n                                     MOLLY\n                              (screaming)\n                         Why are you doing this to me? Get \n                         away from me! I know all about you. \n                         You're a fake. You're just a fake. \n                         Leave me alone!\n\n               We see Sam's inside the room with Molly. He gazes at her \n               lovingly for a moment and then calls back to Oda Mae.\n\n                                     SAM\n                         Tell her she's wearing the blouse I \n                         spilled the Margarita on and the \n                         earrings I gave her for Christmas.\n\n                                     ODA MAE\n                         Sam says you're wearin' the blouse \n                         he spilled the Margarita on and the \n                         earrings he gave you at Christmas.\n\n                                                               CUT BACK TO:\n\n               MOLLY\n\n               grabbing hold of her beads. Her hand is shaking.\n\n                                     ODA MAE (O.S.)\n                              (continuing)\n                         See, I'm no fake.\n\n                                     MOLLY\n                         Go away!\n\n                                     SAM\n                         Gimme a penny quick.\n\n                                     ODA MAE\n                         What?\n\n                                     SAM\n                         Empty your purse. On the floor. Now.\n\n               Oda Mae obeys. A pile of coins falls on the floor.\n\n                                     SAM\n                              (continuing)\n                         Push a penny under the door.\n\n               Oda Mae obeys and a penny slides into the loft. Molly sees \n               it. Sam tips it carefully so it lands upright against the \n               bottom of the door. Pushing gently, he moves the penny up \n               the door until it's eye level with Molly. She watches it, \n               amazed.\n\n               Then, to her astonishment, the penny floats away from the \n               door and hovers in the air. There is a look of wonder in \n               Molly's eyes as it floats toward her.\n\n                                     SAM\n                              (continuing; calling \n                              to Oda Mae)\n                         Tell her it's for luck.\n\n                                     ODA MAE (O.S.)\n                         Sam says it's for luck.\n\n               Molly stands there dumbfounded. Her face is completely white. \n               After a moment she reaches for the penny. It falls into her \n               hand. There are tears in her eyes.\n\n                                                                    CUT TO:\n\n               HALLWAY\n\n               Oda Mae standing in the hallway as the door to the loft begins \n               to open. Slowly Molly steps out onto the landing and stares \n               at her, nervously, uncomprehendingly. She hesitates for a \n               long moment and then invites Oda Mae in.\n\n               INT. LOFT - NIGHT\n\n               Molly is on the phone. Oda Mae is beside her.\n\n                                     MOLLY\n                         Right. Yes, it's right on the corner. \n                         We're a red brick building with the \n                         entrance on the left side. Please \n                         hurry. Thank you Sergeant. We'll be \n                         waiting right here.\n                              (she hangs up)\n                         Police are on their way.\n\n               Oda Mae takes her and leads her to the couch.\n\n                                     MOLLY\n                         What do we do now?\n\n                                     ODA MAE\n                         Just wait.\n\n               There is a period of awkward silence.\n\n                                     MOLLY\n                         Is Sam here?\n\n                                     SAM\n                         I'm sitting beside you.\n\n                                     ODA MAE\n                              (pointing)\n                         Right here.\n\n               Molly reaches out tentatively. Sam meets her hand. She \n               flinches for a second but does not pull back.\n\n                                     MOLLY\n                              (fingering the air)\n                         Can you feel me, Sam?\n\n                                     SAM\n                         With all my heart.\n\n                                     ODA MAE\n                         With all his heart, he says.\n\n                                     SAM\n                         I'd give anything to be alive again, \n                         just to feel you once more.\n\n                                     ODA MAE\n                         He wishes he could touch you, just \n                         one more time.\n\n                                     MOLLY\n                         Oh, Sam.\n\n               Oda Mae looks away uncomfortably. The CAMERA HOLDS on her \n               face. After a moment she turns around and addresses the air.\n\n                                     ODA MAE\n                         Okay, damn it, you can use me if you \n                         want.\n\n               Sam looks oddly at Oda Mae.\n\n                                     ODA MAE\n                              (continuing)\n                         Come on. Before I change my mind.\n\n               Suddenly he understands what she means.\n\n                                                                    CUT TO:\n\n               JUKEBOX\n\n               Sam's finger presses down two keys. We see a record slide \n               out of its slot and move toward the turntable. We know what \n               it is going to play.\n\n               ANGLE\n\n               Oda Mae closes her eyes. \"Unchained Melody\" begins to play. \n               Sam hesitates for a moment and then cautiously, awkwardly \n               slides his ghostly body into her solid form. We sense Oda \n               Mae's discomfort gradually give way as Sam emerges inside \n               her. After a second her body turns slowly toward Molly.\n\n               Oda Mae's hand reaches out and with slow, deliberate gestures, \n               touches Molly's hand. Molly swallows hard. She closes her \n               eyes.\n\n                                                                    CUT TO:\n\n               ANGLE\n\n               Sam. It is as though he alone is there with Molly. His eyes \n               are full of tears. He can barely move. His hand glides slowly \n               down Molly's cheek. He seems to be in a state of ecstasy and \n               pain.\n\n               The experience is more than he can bear. He pulls back.\n\n                                     MOLLY\n                         Sam!\n\n               Molly reaches out, takes Sam's hand, and guides it to her \n               soft lips. Sam can barely breathe. He seems totally absorbed \n               in the experience, the sensation of human flesh.\n\n               His eyes are absolutely still and full of light. He seems to \n               be glowing.\n\n               Gently, Molly takes Sam's arm and guides him to his feet. \n               Effortlessly, she draws him to the center of the huge loft. \n               With great tenderness, she puts her arms around him and before \n               he knows what is happening, they are dancing. It is a strange, \n               touching image, reminiscent of their first night in their \n               new home. Sam reaches out and slowly draws his fingers down \n               over her face, caressing her forehead, her cheeks, her lips. \n               She stands motionless. Her face shines. She knows beyond all \n               doubt that it is him.\n\n                                     MOLLY\n                         I love you so much.\n\n                                                                    CUT TO:\n\n               ANGLE\n\n               A LOUD JARRING SOUND. It takes a moment to realize that it \n               is someone KNOCKING at the door. The light slams back into \n               its shadowy substance and Sam comes shooting back into his \n               ghostly form. Oda Mae is standing with Molly in the center \n               of the room. Sam is beside them. He appears shaken and dizzy.\n\n               There is a another loud POUNDING at the door.\n\n                                     MOLLY\n                         The police!\n\n               Molly heads for the door. Sam calls out. He can barely speak.\n\n                                     SAM\n                         No!\n\n                                     ODA MAE\n                              (to Molly)\n                         Wait!\n\n               Sam tries to go instead. To his amazement and ours he is \n               extremely weak, barely able to move.\n\n                                     SAM\n                         What's happening to me?\n\n               His ghostly functions are diminishing.\n\n               There is another KNOCK and a voice rings out.\n\n                                     CARL (O.S.)\n                         Molly, open up. It's me.\n\n                                     MOLLY\n                         It's Carl!\n\n                                     SAM\n                         Get out of here! The fire escape.\n\n               Oda Mae grabs Molly.\n\n                                     ODA MAE\n                         Come with me.\n\n               Oda Mae and Molly run for the fire escape window. We hear \n               Carl yelling in the hallway.\n\n                                     CARL (O.S.)\n                         Molly. Open up. Are you there?\n\n               INT. STAIRWELL - NIGHT\n\n               Carl is standing on the landing. He is holding a gun. He \n               aims it at the lock and FIRES. The door to the loft flies \n               open.\n\n               INT. LOFT - NIGHT\n\n               Carl moves rapidly through the huge space.\n\n                                     CARL\n                         Molly!\n\n               It is obvious that no one's home.\n\n               ANGLE\n\n               Sam, with great effort, rushes at Carl and attacks him with \n               his fists. To his great shock, he has no impact. Carl walks \n               right through him.\n\n               EXT. FIRE ESCAPE - NIGHT\n\n               Molly and Oda Mae are climbing the fire escape.\n\n               INT. LOFT - NIGHT\n\n               Carl runs to the fire escape window. He looks out just in \n               time to see Oda Mae go into the 7th story window.\n\n               INT. NEW LOFT - NIGHT\n\n               Molly and Oda Mae run through a new loft that is under \n               construction. It is a maze of tangled wires and broken walls. \n               The fire escape window slams shut and nearly scares them \n               half to death. They rush blindly toward the front door. It \n               won't open.\n\n                                     ODA MAE\n                         Back to the fire escape. Head for \n                         the roof.\n\n               Oda Mae reaches the fire escape window just as Carl appears \n               on the other side. She screams. Carl tries shoving the window \n               open. It won't budge.\n\n               Molly sees some scaffolding leading to the skylight. There \n               is an opening at the top.\n\n                                     MOLLY\n                         This way!\n\n               Molly quickly climbs the scaffolding and makes it to the \n               roof.\n\n               With a huge shove, Carl opens the window and rushes inside. \n               The window slams behind him.\n\n               Oda Mae rushes back toward Molly, but her foot catches on a \n               loose cable and she falls to the ground.\n\n                                     ODA MAE\n                         Help us, Sam!\n\n               OMITTED\n\n               ODA MAE\n\n               A hand falls on Oda Mae's shoulder. She spins around. Carl \n               is standing behind her. She screams as he knocks her to the \n               floor.\n\n                                     CARL\n                         I want the check. Just give me the \n                         check.\n\n               Molly looks down from the scaffolding and begins to scream.\n\n                                     MOLLY\n                              (screaming)\n                         God almighty, Carl! What are you \n                         doing? What have you done!?\n\n               She descends quickly and runs toward Carl.\n\n                                     CARL\n                         Don't interfere! She's a thief. It's \n                         not her money.\n\n               Carl kicks Oda Mae. Molly rushes at him, attacking him \n               violently. Carl aims his gun at her.\n\n                                     CARL\n                              (continuing)\n                         Keep out of this, Molly!\n\n               He grabs Oda Mae by the hair.\n\n                                     CARL\n                              (continuing)\n                         Where is it?\n\n               Oda Mae cries out.\n\n                                     ODA MAE\n                         In my purse.\n\n                                     CARL\n                         Where?\n\n                                     ODA MAE\n                         Over there.\n\n               She points across the room.\n\n               Carl sees the purse and yanks Oda Mae toward it. Yanking it \n               off the floor, he tears through it like a wild man. There is \n               no check. He grabs Oda Mae.\n\n                                     CARL\n                         Where is it, goddamn it? Where is \n                         it?\n\n                                     ODA MAE\n                         I gave it away.\n\n                                     CARL\n                         You're lying! Don't lie to me!\n\n               He aims his gun at her eye and is about to FIRE when, \n               suddenly, something shoves him to the floor. Carl screams \n               and jumps back, tripping over Oda Mae. Sam is standing there.\n\n               In total panic, Carl scrambles to get up. Horrified, he SHOOTS \n               his gun blindly into the air. Molly and Oda Mae dive for \n               cover. The bullets have no impact. Sam musters all his \n               strength and shoves Carl again. White with fear, Carl grabs \n               Molly and aims his gun at her head.\n\n                                     CARL\n                              (continuing)\n                         I'll kill her. You touch me and I'll \n                         kill her. I mean it, Sam. Just give \n                         me the check.\n\n               The gun is cocked at her temple. No one moves. Slowly the \n               camera dollies toward Carl.\n\n                                     CARL\n                              (continuing)\n                         Sam, please. I didn't mean for him \n                         to kill you. It's not my fault. Come \n                         on, Sam, give me the check. Give it \n                         to me and I'll leave her alone.\n\n               Nothing happens. Carl looks nervous.\n\n               ANGLE\n\n                                     CARL\n                         Sam? Sam?\n\n               In a wild explosive fury, Sam charges at Carl and smashes at \n               his gun. The weapon flies out of Carl's hand. Empowered by \n               an anger we have not seen before, Sam smashes into Carl with \n               a violent force. Carl's body careens into walls and \n               floorboards. Wiring snaps. Two-by-fours crack.\n\n               Carl, crawling desperately to escape, sees his gun on the \n               floor. With a wild rush, he grabs for it and shoots at the \n               door. The lock explodes and the door flies open.\n\n               Carl tries to run for it, but Sam cuts in front of him. With \n               growing power, Sam sends Carl flying back into the apartment, \n               colliding into a tall scaffold. Bags of plaster topple to \n               the ground as mounds of plaster dust hurl into the air. The \n               apartment looks like a scene from another world.\n\n               Carl, in a state of total unrelieved panic, breaks away from \n               Sam. The dust obscures his escape. Like a trapped insect, he \n               scrambles furiously to the fire escape window. Sam cannot \n               see him.\n\n               Carl shoves at the window. It is stuck. With a supreme effort, \n               he grabs a ripped bag of plaster and swings it at the glass. \n               Half of its plaster spews across the room before smashing \n               the window. Shards of glass fly in all directions. Sam turns \n               and sees Carl. He surges after him, but knows he cannot get \n               to him in time.\n\n               Carl is halfway out the window when Sam's fist slams into an \n               electrical box attached to a dangling BX cable. It goes flying \n               toward the window. To his amazement, it hits the frame. A \n               huge pane of glass dislodges and comes crashing down. Carl \n               looks up just in time to see the pointed edge aiming for his \n               chest. Before he can move, it pierces him between the ribs \n               and slices into his heart. His body quivers.\n\n               Carl's eyes bulge from their sockets. His body begins to \n               spasm. He can't get up. A look of abject terror flashes \n               through his eyes. He tries to scream. There is no sound. He \n               tries to breathe. There is no breath.\n\n               ANGLE\n\n               With one last effort, Carl lurches forward. To his amazement, \n               his body stands up and pulls away from the window. He looks \n               down at his chest and is amazed to see that the glass is \n               gone. There is no blood. Excited and confused, he turns around \n               and sees Sam. For a moment, he cannot comprehend what is \n               happening.\n\n                                     CARL\n                         Sam?\n\n               There is a strange, silent moment between them.\n\n               Then, seemingly out of nowhere, a terrible CLICKING sound is \n               heard. Frightening black forms are emerging from the darkness. \n               Carl looks behind him and gasps. Past the figures coming \n               toward him, he sees his own dead body. It is pinned to the \n               window sill.\n\n               Before Carl can cry out, the dark figures swoop down and \n               envelope him. In a flash, his spirit is caught and surges \n               with the dark forces back into the shadows. Far in some \n               invisible distance, we can barely hear him scream.\n\n               And then it is silent. It is over.\n\n               ANGLE\n\n               Molly is crouched in the corner, her back pressed tightly \n               against the wall. She is staring into space. The room is \n               filled with plaster dust. Slowly, emerging from the dust, we \n               see Sam approaching Molly. He gazes at her with terrible \n               longing.\n\n               Suddenly, a brilliant light glows from behind the ceiling \n               and the skylight floods the room with a golden haze. Sam \n               turns to look at it. His eyes are full of surprise and wonder. \n               The spirits beyond the ceiling are beckoning to him. As he \n               looks down, he notices that his hands are growing transparent. \n               His body is beginning to fade. A faint smile forms on his \n               face. He leans down toward Molly, staring at her for a long, \n               silent moment.\n\n                                     SAM\n                         Goodbye, Moll.\n\n               Molly's head lifts up. She looks around.\n\n                                     MOLLY\n                         Sam? Is that you?\n\n                                     SAM\n                              (stunned)\n                         Molly?!\n\n                                     MOLLY\n                         I hear you, Sam.\n\n               She starts to cry.\n\n               Gradually, we notice that the dust in the air near Molly is \n               beginning to shimmer with a subtle glow. To her astonishment, \n               Sam's spirit is reflected in the floating particles.\n\n                                     MOLLY\n                              (continuing)\n                         Oh God!\n\n               Sam's luminous form appears before her. Molly is overwhelmed \n               by the sight of him. The two of them gaze at one another \n               without moving. They know it is for the last time. It is a \n               silent exchange, charged with emotion.\n\n               Slowly, the two bodies reach forward. As their lips touch, \n               the plaster dust swirls sensuously through Sam's vaporous \n               image and he begins to disappear. Molly pulls back from him \n               as though from a cloud. His voice rises from the mist.\n\n                                     SAM\n                         I can't stay anymore.\n\n               Tears roll down her cheek.\n\n               The brilliant light intensifies. It is beautiful, like a \n               sunrise, saturating the room with a warm, comforting glow. \n               Molly looks up and sees it all. Oda Mae sees it, too.\n\n                                     ODA MAE\n                         They're waiting for you, Sam.\n\n                                     SAM\n                              (smiling)\n                         I know. Goodbye, Oda Mae.\n                              (with deep felt \n                              gratitude)\n                         Thank you. Your mama would be proud.\n\n               Oda Mae smiles warmly.\n\n               Sam turns to Molly. She is gazing at the last remaining \n               moments of him. Her eyes brim over with tears and love.\n\n                                     SAM\n                         I love you, Molly. I've always loved \n                         you.\n\n               Molly swallows hard and wipes her eyes.\n\n                                     MOLLY\n                         Ditto.\n\n               The light inside Sam intensifies. A sweet smile emerges on \n               his lips.\n\n                                     SAM\n                         It's so amazing, Moll...\n\n               His face fills with joy.\n\n                                     SAM\n                              (continuing)\n                         The love inside.\n\n               He whispers, almost crying.\n\n                                     SAM\n                              (continuing)\n                         You take it with you.\n\n               They are his last words. His spirit dissolves within its \n               ghostly moorings and begins to evaporate. Molly looks up \n               silently for a moment, her face filled with love.\n\n                                     MOLLY\n                         See ya.\n\n               We see Sam's spirit rise from the room. It passes effortlessly \n               through the ceiling and, in seconds, he is gone. The room \n               grows dark.\n\n               Molly sits quietly on the floor. There is a look of awe and \n               wonder in her eyes. After a moment, Oda Mae reaches down to \n               help her up. Molly looks at her lovingly and then gently \n               takes her hand. Arm in arm, supporting one another, they \n               walk quietly from the room.\n\n                                         THE END\n\n\n\n\nGhost\nWriters :   Bruce Joel Rubin\nGenres :   Romance  Thriller  Drama  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:52.627090"}