{"title": "Ghostbusters 2", "film_link": "/Movie Scripts/Ghostbusters 2 Script.html", "script_link": "/scripts/Ghostbusters-2.html", "info_raw": "\n\nGhostbusters 2 Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Dan Aykroyd  Harold Ramis\nGenres  Sci-Fi  Comedy  Action  Adventure\nScript Date : February 1989\n\nRead \"Ghostbusters 2\" Script\n\n\n", "script": "\n\t\t\t\t\t\tGhostbusters II\n\n\t\t\t\t\t\t\tby\n\t\t\t\t\t\tHarold Ramis\n\t\t\t\t\t\t\tand\n\t\t\t\t\t\tDan Aykroyd\n\n\t\t\t\t\t September 29, 1988\n\t\t\t\tLast revised Feburary 27, 1989\n\n\nEXT.  MANHATTAN ISLAND - DAY\n\nA high AERIAL SHOT of the island features the Statue of Liberty\nprominently in the foreground then TRAVELS ACROSS the harbor, OVER the\nBattery and Lower Manhattan to Greenwich Village.\n\nEXT.  EAST 77TH STREET - DAY\n\nA car is being hoisted up by a municipal tow truck while its owner is\nhaving a terrible screaming arguement with a parking enforcement officer.\nDANA BARRETT comes home pushing a baby buggy, struggling with two full\nbags of groceries, and trying to dig her keys out of her purse. The\n\nbuilding superintendent FRANK, sees her struggling but pretends not to\nnotice.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (exasperated)\n\t\t\tFrank, do you think you could give me a hand\n\t\t\twith these bags?\n\n\t\t\t\t\t\tFRANK\n\t\t\tI'm not a doorman, Miss Barrett.  I'm a\n\t\t\tbuilding superintendent.\n\n\t\t\t\t\t\tDANA\n\t\t\tYou're also a human being, Frank.\n\n\t\t\t\t\t\tFRANK\n\t\t\t\t (reluctantly going to help)\n\t\t\tOkay, okay.  It's not my job, but what the\n\t\t\thell.  I'll do you a favor.  He takes the\n\t\t\tgrocery bags from her.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (setting the wheel brakes on\n\t\t\t\t the buggy)\n\t\t\tThank you, Frank.  I'll get the hang of this\n\t\t\teventually.\n\nShe continues digging in her purse while Frank leans over the buggy and\nmakes funny faces at the baby, OSCAR, a very cute nine-month old boy.\n\n\t\t\t\t\t\tFRANK\n\t\t\t\t (to the baby)\n\t\t\tHiya, Oscar.  What do you say, slugger?\n\n\t\t\t\t\t\tFRANK\n\t\t\t\t (to Dana)\n\t\t\tThat's a good-looking kid you got there, Ms.\n\t\t\tBarrett.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (finding her keys)\n\t\t\tThank you, Frank.  Oh, are you ever going to\n\t\t\tfix the radiator in my bedroom?  I asked you\n\t\t\tlast week.\n\n\t\t\t\t\t\tFRANK\n\t\t\tDidn't I do it?\n\nBABY BUGGY\n\nIt starts to vibrate as if shaken by an unseen hand.\n\nEXT.  EAST 77TH STREET - BABY - DAY\n\nHe GURGLES with delight at the movement.\n\nEXT.  EAST 77TH STREET - DANA AND FRANK - DAY\n\nNeither of them notice the movement of the carriage.\n\n\t\t\t\t\t\tDANA\n\t\t\tNo, you didn't, Frank.\n\n\t\t\t\t\t\tFRANK\n\t\t\tOkay, that's no problem.\n\n\t\t\t\t\t\tDANA\n\t\t\tThat's exactly what you said last week.\n\nBUGGY WHEELS\n\nThe brakes unlock themselves.\n\nDANA\n\nShe reaches for the handlebar of the buggy, but the buggy rolls forward\njust out of her reach and stops.  Surprised by the movement, she reaches\nfor the handlebar again, but this time the buggy rolls away even\nfurther.  Alarmed now, Dana hurries after it, but the buggy keeps\nrolling down the street at ever increasing speed.\n\nSIDEWALK\n\nDana chases the buggy down the street, shouting to passing pedestrians\nfor help, but every time someone reaches out to stop it, the buggy\nswerves and continues unchecked.\n\nINTERSECTION\n\nCars, trucks, and buses speed by in both directions as the buggy races\ntoward the corner.\n\nDANA\n\nShe puts her head down and sprints after the buggy like an Olympian.\n\nEXT.  EAST 77TH STREET - INTERSECTION - DAY\n\nA city bus is on a collision course with the speeding baby buggy.\n\nBUGGY\n\nIt careens toward the corner.\n\nEXT.  EAST 77TH STREET - BABY - DAY\n\nIts eyes are wide open with excitement.\n\nEXT.  EAST 77TH STREET - INTERSECTION - DAY\n\nBus and buggy are closing fast as the buggy bounces over the curb and\ninto the crosswalk.\n\nBUS\n\nThe bus driver reacts in helpless horror as he sees the buggy enter the\nintersection at high speed.\n\nBUGGY\n\nIt comes to a dead stop right in the middle of the street.  The bus\ncontinues missing the buggy by inches.\n\nINTERSECTION\n\nCars and trucks swerve and hit their brakes as Dana runs into the\nintersection and snatches up the baby.  She hugs it close, deeply\nrelieved, then looks at the buggy with the dawning awareness that the\nsupernatural has re-entered her life.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  UPPER WEST SIDE - NEW YORK CITY STREET - GHOSTBUSTERS LOGO - DAY\n\nTHEME MUSIC kicks in strongly as we see the familiar \"No Ghosts\" symbol\nand PULL BACK to reveal that it's painted on the side of Ecto-1, the\nGhostbusters' emergency vehicle, which is speeding up Broadway on the\nUpper West Side.  RAY STANTZ is driving and WINSTON ZEDDEMORE is riding\nshotgun.\n\nEXT.  WEST 77TH STREET - DAY  (MOMENTS LATER)\n\nThe Ectomobile pulls up in front of a carefully-restored brownstone.\nStantz and Winston, wearing their official Ghostbuster uniforms, jump\nout of the old ambulance, shoulder their proton packs and enter the\nhouse.\n\nINT.  BROWNSTONE - DAY  (CONTINUOUS ACTION)\n\nA WOMAN greets them and leads them through the expensively-furnished\nhouse.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (all business)\n\t\t\tHow many of them are there, ma'am?\n\n\t\t\t\t\t\tWOMAN\n\t\t\tFourteen.  They're in the back.  I hope you can\n\t\t\thandle them.  It's been like a nightmare.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tHow big are they?\n\nShe holds her hand out indicating about four feet.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (resolute)\n\t\t\tWe'll do our best, ma'am.\n\n\t\t\t\t\t\tWOMAN\n\t\t\tThey're right out here.\n\nShe leads them to a set of French doors that open into another room.\nStantz and Winston pause to make final adjustments to their equipment.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tReady?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tI'm ready.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThen let's do it.\n\nHe pushes through the French doors and they step into the room.\n\nINT.  BROWNSTONE - DAY  (CONTINUOUS ACTION)\n\nThey are immediately attacked by fourteen or fifteen screaming KIDS\nbetween the ages of seven and ten.\n\n\t\t\t\t\t\tKIDS\n\t\t\t\t (disappointed)\n\t\t\tGhostbusters!!  Boooo!!\n\nTables are set with party favors, ice cream and birthday cake and the\nroom is strewn with discarded toys and games.  A couple of weary parents\nsink onto lawn chairs as Stantz and Winston take over the party.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (trying his best)\n\t\t\tHow you doin', kids?\n\n\t\t\t\t\t\tLITTLE BOY\n\t\t\t\t (nasty)\n\t\t\tI though we were having He-Man.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tHe-Man couldn't make it today.  That's why\n\t\t\twe're here.\n\n\t\t\t\t\t\tBOY\n\t\t\tMy dad says you're full of crap.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (stopped cold)\n\t\t\tWell, a lot of people have trouble believing\n\t\t\tin the paranormal.\n\n\t\t\t\t\t\tBOY\n\t\t\tNo, he just says you're full of crap and that's\n\t\t\twhy you went out of business.\n\nHe kicks Stantz in the leg.  Stantz grabs him by the shirtfront.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (low and menacing)\n\t\t\tI'm watching you.\n\t\t\t\t (to Winston)\n\t\t\tSong.\n\nWinston switches on a tiny TAPE RECORDER which starts PLAYING the\nGhostbusters THEME SONG. Stantz and WInston start singing\n\n\t\t\t\t\t\tSTANTZ AND WINSTON\n\t\t\t'There's something wrong in the neighborhood.\n\t\t\tWho you gonna call?'\n\n\t\t\t\t\t\tKIDS\n\t\t\t\t (all together)\n\t\t\tHe-Man!!\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. WEST 77TH STREET - DAY (LATER)\n\nStantz and Winston wearily load their equipment into the Ectomobile.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tThat's it, Ray.  I've had it.  No more parties.\n\t\t\tI'm tired of taking abuse from over-privileged\n\t\t\tnine-year-olds.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tCome on, Winston.  We can't quit now.  The\n\t\t\tholidays are coming up.  It's our best season.\n\nThey get in the car\n\nINT.  ECTO-1 - DAY (CONTINUOUS ACTION)\n\nStantz tries to start the car, but the engine won't turn over.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tGive it up, Ray.  You're living in the past.\n\t\t\tGhostbusters doesn't exist anymore.  In a year\n\t\t\tthese kids won't even remember who we are.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (tries to start the car again)\n\t\t\tUngrateful little Yuppie larvae.  After all we\n\t\t\tdid for this city.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tYeah, what did we do, Ray?  The last real job\n\t\t\twe had we bubbled up a hundred foot marshmallow\n\t\t\tman and blew the top three floors off an uptown\n\t\t\thighrise.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYeah, but what a ride.  You can't make a\n\t\t\thamburger without chopping up a cow.\n\nHe turns the key again, the ENGING TURNS OVER, then starts GRINDING and\nCLUNKING disastrously, chewing up vital parts and dropping twisted bits\nof metal onto the pavement.  Finally, with a BLAST of black sooty\nexhaust from the tailpipe, Ecto-1 shudders and dies.  Frustrated, Stantz\nbangs his head lightly on the steering wheel\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  WKRR-TV STUDIO RECEPTION AREA - DAY (LATER)\n\nA bank of monitors in the lobby show the program now running on WKRR,\nChannel 10 in New York. We PUSH IN ON one of the monitors as a title\ncard and logo come up accompanied by some EERIE SYNTHESIZER MUSIC, and\nwe return to the show in progress: \"World of the Psychic with Dr. Peter\nVenkman.\"  There is a video dissolve to a standard talk show set and\nsitting there is our host PETER VENKMAN, the renowned and somewhat\ninfamous ex-Ghostbuster.\n\nVENKMAN\n\nHe turns TO CAMERA and talks to his viewers in a suavely engaging tone,\nunderstated and intimate.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHi, welcome back to the 'World of the Psychic,'\n\t\t\tI'm Peter Venkman and I'm chatting with my guest,\n\t\t\tauthor, lecturer and of course, psychic, Milton\n\t\t\tAnglund.\n\t\t\t\t (to his guest)\n\t\t\tMilt, your new book is called The End of the\n\t\t\tWorld.  Isn't that kind of like writing about\n\t\t\tgum disease.  Yes, it could happen, but do you\n\t\t\tthink anybody wants to read a book about it?\n\n\t\t\t\t\t\tMILTON\n\t\t\tWell, I think it's important for people to know\n\t\t\tthat the world is in danger.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOkay, so can you tell us when it's going to\n\t\t\thappen or do we have to buy the book?\n\n\t\t\t\t\t\tMILTON\n\t\t\tI predict that the world will end at the\n\t\t\tstroke of midnight on New Year's Eve.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThis year?  That's cutting it a little close,\n\t\t\tisn't it?  I mean, just from a sales point of\n\t\t\tview, the book just came out, right?  So you're\n\t\t\tnot even looking at the paperback release for\n\t\t\tmaybe a year.  And it's going to be at least\n\t\t\tanother year after that if the thing has\n\t\t\tmovie-of-the-week or mini-series potential.\n\t\t\tYou would have been better off predicting 1992\n\t\t\tor even '94 just to be safe.\n\n\t\t\t\t\t\tMILTON\n\t\t\t\t (irritated)\n\t\t\tThis is not just some money-making scheme!  I\n\t\t\tdidn't just make up the date.  I have a strong\n\t\t\tpsychic belief that the world will end on New\n\t\t\tYear's Eve.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (placating)\n\t\t\tWell, for your sake, I hope you're right.  But\n\t\t\tI think my other guest may disagree with you.\n\t\t\tElaine, you had another date in mind?\n\nThe CAMERA REVEALS ELAINE, an attractive, aggressive New Jersey\nhousewife, sitting on the other side of Venkman.\n\n\t\t\t\t\t\tELAINE\n\t\t\tAccording to my sources, the world will end\n\t\t\ton February 14, in the year 2016.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tValentine's Day.  That's got to be a bummer.\n\t\t\tWhere did you get that date, Elaine?\n\n\t\t\t\t\t\tELAINE\n\t\t\tI received this information from an alien.  I\n\t\t\twas at the Paramus Holiday Inn, I was having\n\t\t\ta drink in the bar when he approached me and\n\t\t\tstarted talking.  Then he must have used some\n\t\t\tsort of ray or a mind control device because\n\t\t\the made me follow him to his room and that's\n\t\t\twhere he told me about the end of the world.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYour alien had a room in the Holiday Inn?\n\n\t\t\t\t\t\tELAINE\n\t\t\tIt may have been a room on the spacecraft made\n\t\t\tup to look like a room in the Holiday Inn.  I\n\t\t\tcan't be sure, Peter.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (humoring her)\n\t\t\tNo, you can't, and I think that's the whole\n\t\t\tproblem with aliens; you just can't trust them.\n\t\t\tYou may get some nice ones occasionally like\n\t\t\tStarman or E.T., but most of them turn out to\n\t\t\tbe some kind of lizard.  Anyway, we're just\n\t\t\tabout out of time.\n\t\t\t\t (does his wrap-up right TO\n\t\t\t\t the CAMERA)\n\t\t\tNext week on 'World of the Psychic,' hairless\n\t\t\tpets.\n\t\t\t\t (holds up a hairless cat)\n\t\t\tUntil then, this is Peter Venkman saying ...\n\t\t\t\t (puts a finger to his temple\n\t\t\t\t and sends out a though to his\n\t\t\t\t viewers)\n\t\t\t... Good night.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT. TV STUDIO - CORRIDOR - DAY (LATER)\n\nVenkman comes out of the studio squabbling with his producer, NORMAN, a\nwell-meaning young incompetent.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhere do you find these people?  I thought\n\t\t\twe were having the telekinetic guy who bends\n\t\t\tthe spoons?\n\n\t\t\t\t\t\tNORMAN\n\t\t\tA lot of the better psychics won't come on the\n\t\t\tshow.  They think you're too skeptical.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSkeptical!  Norman, I'm a pushover.  I think\n\t\t\tprofessional wrestling is real.\n\nThere is a small commotion down the hall as two plainclothes cops come\nout of the next studio followed by a group of mayoral assistants.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Norman)\n\t\t\tWhat's all this?\n\n\t\t\t\t\t\tNORMAN\n\t\t\tThey just interviewed the mayor on 'Cityline.'\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThe Mayor!  He's a friend of mine.\n\nVenkman starts down the hall as the MAYOR and his principal aide, JACK\nHARDEMEYER, come walking out of the studio.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (calling to the Mayor)\n\t\t\tLenny!\n\nThe Mayor sees Venkman, blanches and hurries off, pretending not to know\nhim.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (starts to follow him)\n\t\t\tLenny!  It's Pete Venkman!\n\nThe plainclothesmen cut Venkman off and Hardemeyer puts a heavy hand\nagainst Venkman's chest.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (snide)\n\t\t\tCan I help you?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (dangerous)\n\t\t\tYeah, you can get your hand off my chest.\n\nHardemeyer smiles and drops his hand.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\tI'm Jack Hardemeyer.  I'm the mayor's assistant.\n\t\t\tWhat can I do for you?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'm an old friend of the mayor's.  I just\n\t\t\twant to say hello to him.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (scornful)\n\t\t\tI know who you are, Doctor Venkman.  Busting\n\t\t\tany ghosts lately?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNo, that's what I want to talk to the mayor\n\t\t\tabout.  We did a little job for the city a\n\t\t\twhile back and we ended up getting sued,\n\t\t\tscrewed and tattooed by deskworms like you.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (bristling)\n\t\t\tLook, you stay away from the mayor.  Next fall,\n\t\t\tbarring a disaster, he's going to be elected\n\t\t\tgovernor of this state and the last thing we\n\t\t\tneed is for him to be associated with two-bit\n\t\t\tfrauds and publicity hounds like you and your\n\t\t\tfriends.  You read me?\n\nHardemeyer walks off with the two cops.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOkay, I get it.  But I want you to tell Lenny\n\t\t\tthat, because of you, I'm not voting for him.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. MANHATTAN MUSEUM OF ART - DAY\n\nThe broad front steps of the museum are crowded with tourists and\nvisitors.  Dana arrives carrying a portfolio and artist's tackle box and\nenters the museum.\n\nINT. MUSEUM - RESTORATION STUDIO - DAY (LATER)\n\nWe are FULL-FRAME ON a larger-than-life, full-figure portrait of VIGO\nTHE CARPATHIAN, a demented and sadistic 16th century despot with an\nincredibly powerful evil presence.  Then we PULL BACK to reveal the\nstudio, which is a large open space on the top floor of the museum, lit\nby large skylights in the ceiling.  Working on the Vigo painting is\nJANOSZ POHA, a youngish art historian and painter, the head of the\ndepartment, quirky, intense and somewhat creepy.  Janosz is staring\nlongingly across the room at Dana.\n\nDANA\n\nShe is carefully cleaning a 19th Century landscape painting, still\npreoccupied by the extraordinary near-accident with the buggy.  Janosz\nwatches her for a moment, then comes up behind her and looks over her\nshoulder.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (with an East European accent)\n\t\t\tStill working on the Turner?\n\nDana jumps, startled by the intrusion.\n\n\t\t\t\t\t\tDANA\n\t\t\tOh, yes, I got in a little late this morning,\n\t\t\tJanosz.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tYou know, you are really doing very good work\n\t\t\there.  I think soon you may be ready to assist\n\t\t\tme in some of the more important restorations.\n\n\t\t\t\t\t\tDANA\n\t\t\tThank you, Janosz.  I've learned a lot here,\n\t\t\tbut now that my baby's a little older, I was\n\t\t\thoping to rejoin the orchestra.\n\nVIGO PAINTING\n\nAt the mention of Dana's baby, the figure of Vigo miraculously turns his\nhead and looks at Dana.\n\nJANOSZ AND DANA\n\nNeither of them notice the movement in the painting.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (disappointed)\n\t\t\tWe'll be very sorry to lose you.  Perhaps I\n\t\t\tcould take you to lunch today?\n\n\t\t\t\t\t\tDANA\n\t\t\tActually, I'm not eating lunch today.  I have\n\t\t\tan appointment.\n\t\t\t\t (looks at her watch)\n\t\t\tIn fact, I'd better go.\n\nShe starts gathering up her things.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tEvery day I ask you, and every day you've got\n\t\t\tsomething else to do.  Do I have bad breath\n\t\t\tor something?\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (trying to brush him off)\n\t\t\tI'm sorry.  Perhaps some other time.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tOkay, I'll take a raincheck on that.\n\nJanosz smiles at her as she exits, then goes back to his easel.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (to himself)\n\t\t\tI think she likes me.\n\nHe switches on an English language TAPE and starts practicing the\nphrases as he resumes working.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. UNIVERSITY - DAY\n\nDana Barrett crosses the quad and enters a modern building.  A sign\nidentifies it as \"The Institute for Advanced Theoretical Research.\"\n\nINT. UNIVERSITY - DAY (A LITTLE LATER)\n\nDana is explaining the buggy incident to EGON SPENGLER, the soberly\nintellectual techno-wizard and former Ghostbuster, as he conducts an\nexperiment assisted by a research team of graduate students, all of whom\nare Japanese, Chinese, or Korean.  The device he is testing is a black\nbox about the size of a Sony Watchman with both digital and graphic\ndisplays.\n\n\t\t\t\t\t\tDANA\n\t\t\t... and then the buggy just suddenly stopped\n\t\t\tdead in the middle of the street\n\n\t\t\t\t\t\tSPENGLER\n\n\t\t\tDid anyone else see this happen?\n\n\t\t\t\t\t\tDANA\n\t\t\tHundreds of people.  Believe me, I didn't\n\t\t\timagine this.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI'm not saying you did.  In science we always\n\t\t\tlook for the simplest explanation.\n\nAn ASSISTANT interrupts.\n\n\t\t\t\t\t\tASSISTANT\n\t\t\tWe're ready, Dr. Spengler\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to the Assistant)\n\t\t\tWe'll start with the negative calibration.\n\nHe picks up the device and prepares to test it.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (curious)\n\t\t\tWhat are you working on, Egon?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI'm trying to determine whether human\n\t\t\temotional states have a measurable effect on\n\t\t\tthe psychomagnetheric energy field.  It's a\n\t\t\ttheory Ray and I were working on when we had\n\t\t\tto dissolve Ghostbusters.\n\nAn assistant draws a curtain revealing a large picture window, actually\na two-way mirror, that looks into a small waiting room.  Inside the\nwaiting room they can see but not hear a youngish couple having a heated\narguement.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to Dana)\n\t\t\tThey think they're here for marriage\n\t\t\tcounseling.  We've kept them waiting for two\n\t\t\thours and we've been gradually increasing the\n\t\t\ttemperature in the room.\n\t\t\t\t (checking a heat sensor)\n\t\t\tIt's up to 95 degrees at the moment.  Now my\n\t\t\tassistant is going to enter and ask them if\n\t\t\tthey'd mind waiting another half-hour.\n\nAs Spengler, Dana, and the research team watch, the assistant enters the\nwaiting room and tells the couple about the new delay.  They explode\nwith anger both at him and each other while Spengler monitors them\nthrough the glass.  After recording his readings, he returns to his\nAssistant.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tWe'll do the happiness index next.\n\t\t\t\t (to Dana)\n\t\t\tI'd like to bring Ray in on your case, if\n\t\t\tit's all right with you.\n\n\t\t\t\t\t\tDANA\n\t\t\tOkay, whatever you think -- but not Venkman.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tOh no.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (affectedly casual)\n\t\t\tDo you ever see him?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tOccasionally\n\n\t\t\t\t\t\tDANA\n\t\t\tHow is he these days?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tVenkman?  I think he was borderline for a\n\t\t\twhile there.  Then he crossed the border.\n\n\t\t\t\t\t\tDANA\n\t\t\tDoes he ever mention me?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tNo.  Not that I can recall.\n\nThey move to another two-way mirror through which they can see a lovely\nlittle girl playing with a wonderful array of toys.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (slightly disappointed)\n\t\t\tWell, we didn't part on very good terms and\n\t\t\twe sort of lost track of each other when I\n\t\t\tgot married.\n\nThe Assistant interrupts again.\n\n\t\t\t\t\t\tASSISTANT\n\t\t\tWe're ready for the affection test.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to the assistant)\n\t\t\tGood.  Send in the puppy.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (continuing)\n\t\t\tI thought of calling him after my marriage\n\t\t\tended, but --.  Anyway, I appreciate you're\n\t\t\tdoing this, Egon\n\nThey watch as another assistant enters the playroom with an adorable\nCocker Spaniel puppy and gives it to the little girl.  Spengler monitors\nher as she jumps for joy and hugs the little dog.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (handing him a card)\n\t\t\tThis is my address and telephone number.\n\t\t\tWill you call me?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tCertainly.\n\n\t\t\t\t\t\tDANA\n\t\t\tEgon, I'd rather you didn't mention any of\n\t\t\tthis to Peter if you don't mind.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI won't.\n\n\t\t\t\t\t\tDANA\n\t\t\tThank you.\n\nShe shakes his hand and exits.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to his assistant)\n\t\t\tNow let's see how she reacts when we take\n\t\t\taway the puppy\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. RAY'S OCCULT BOOK STORE - DAY (LATER)\n\nIt's a small basement shop located on a quaint commercial block in\nGreenwich Village.  The window is crowded with occult artifacts and old\nbooks full of arcane metaphysical lore.  The TELEPHONE RINGS.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (v.o., answering the phone)\n\t\t\tRay's Occult.\n\nINT. RAY'S OCCULT BOOKS - CONTINUOUS\n\nThe shelves are jammed floor to ceiling with books on the paranormal.\nRay sits on a barstool behind the counter wearing an old cardigan\nsweater over a T-shirt.  He has on a pair of reading glasses and chews\non a battered, reeking pipe.  As he talks on the phone he prepares a cup\nof herb tea for Spengler who is thumbing through an arcane text.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (on the phone)\n\t\t\tYeah ... mmhmm ... What do you need? ... What\n\t\t\thave I got?  I've got alchemy, astrology,\n\t\t\tapparitions, Bundu Magic Men, demon\n\t\t\tintercession, U.F.O. abductions, psychic\n\t\t\tsurgery, stigmata, modern miracles, pixie\n\t\t\tsightings, golden geese, geists, ghosts, I've\n\t\t\tgot it all -- what are you looking for? ...\n\t\t\tDon't have any.  Try the stockyards.\n\nHe hangs up.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tWho was that?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tSome crank.  Looking for goat hooves.  Come\n\t\t\tup with anything?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (referring to the book)\n\t\t\tThis one's interesting.  Berlin, 1939, a\n\t\t\tflower cart took off by itself and rolled\n\t\t\tapproximately half a kilometer over level\n\t\t\tground.  Three hundred eyewitnesses.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYou might want to check those Duke University\n\t\t\tmean averaging studies on controlled\n\t\t\tpsychokinesis.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (going to the stacks)\n\t\t\tGood idea.\n\nThe bones hanging over the door rattle as Venkman enters the shop.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOh, hello, perhaps you could help me.  I'm\n\t\t\tlooking for an aerosol love potion I could\n\t\t\tspray on a certain Penthouse Pet that would\n\t\t\tmake her unconditionally submit to an unusual\n\t\t\tpersonal request.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tOh, hiya, Pete.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSo, no goat hooves, huh?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (strung)\n\t\t\tI knew that voice sounded familiar.  What's\n\t\t\tup?  How's it going?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNowhere -- fast.  Why don't you lock up and\n\t\t\tbuy me a sub?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (slightly evasive)\n\t\t\tUh, I can't.  I'm kind of working on something.\n\nSpengler steps out of the stacks.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tEgon!\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tHello, Venkman.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHow've you been?  How's teaching?  I bet\n\t\t\tthose science chicks really dig that big\n\t\t\tcranium of yours, huh?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI think they're more interested in my\n\t\t\tepididymis.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI don't even want to know where that is.\n\nVenkman steps behind the counter and takes a beer from Ray's mini-fridge.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tOh, your book came in, Venkman.  Magical\n\t\t\tPaths to Fortune and Power.\n\nHe hands Venkman the book.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tGreat.\n\t\t\t\t (reading the contents)\n\t\t\tSo what are you guys working on?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tOh, just checking something for an old friend.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWho?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (at a loss)\n\t\t\tWho?  Just -- someone we know.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOh, Ray --\n\nHe grabs Stantz by both ears and pulls up.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWho?  Who?  Who?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tAaah!  Nobody!  I can't tell you!\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWho, Ray?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (giving in)\n\t\t\tDana!  Dana Barrett!\n\nVenkman lets go of his ears and smiles.  Spengler looks at Stantz and\nshakes his head.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT. DANA'S APARTMENT - DAY (LATER)\n\nThe apartment is old and creatively furnished with a comfortable mix of\nmodern and traditional pieces.  Maria, a young Hispanic woman who does\nday care for Dana, is feeding the baby in the kitchen when the DOORBELL\nRINGS.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nDana enters from the bedroom and crosses to the front door.  She opens\nit and admits Ray and Egon.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (hugging Ray)\n\t\t\tHi, Ray.  It's good to see you.  Thanks for\n\t\t\tcoming.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNo problem.  Always glad to help -- and hug.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (to Spengler)\n\t\t\tHi, Egon.\n\nShe shakes his hand and is about to close the door when Venkman appears\nin the doorway.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHi, Dana.\n\nDana is caught completely off guard by Venkman's surprise appearance.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI knew you'd come crawling back to me.\n\nShe regards him coolly, as always amused and amazed at his\npresumptuousness.\n\n\t\t\t\t\t\tDANA\n\t\t\tHello, Peter.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Dana)\n\t\t\tYou know, Dana, I'm very very hurt that you\n\t\t\tdidn't call me first.  I'm still into all\n\t\t\tthis stuff, you know.  Haven't you ever seen\n\t\t\tmy show?\n\n\t\t\t\t\t\tDANA\n\t\t\tI have.  That's why I didn't call you first.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI can see that you're still very bitter about\n\t\t\tus, but in the interest of science, I'm going\n\t\t\tto give it my best shot.  Let's go to work,\n\t\t\tboys.\n\nStantz and Spengler begin a comprehensive parapsychological work-up on\nthe baby and the immediate physical environment.\n\nVENKMAN AND DANA\n\nVenkman starts nosing around the apartment.  Dana follows him.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSo what happened to Mr. Right?  I hear he\n\t\t\tditched you and the kid and moved to Europe.\n\n\t\t\t\t\t\tDANA\n\t\t\tHe didn't \"ditch\" me.  We had some problems,\n\t\t\the got a good offer from an orchestra in\n\t\t\tEngland and he took it.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHe ditched you.  You should've married me,\n\t\t\tyou know.\n\n\t\t\t\t\t\tDANA\n\t\t\tYou never asked me, and every time I brought\n\t\t\tit up you'd get drowsy and fall asleep.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tMen are very sensitive, you know.  We need to\n\t\t\tfeel loved and desired, too.\n\n\t\t\t\t\t\tDANA\n\t\t\tWell, when you started introducing me as \"the\n\t\t\told ball and chain,\" that's when I left.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI may have a few personal problems but one thing\n\t\t\tI am is a total professional.\n\nHe leaves her and crosses to Spengler.\n\nSPENGLER\n\nHe's taking a complete set of body and head measurements of the baby\nwith a tape measure and calipers.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhat are you going to do, Egon?  Knit him a\n\t\t\tsnowsuit?\n\nSpengler ignores the remark and hands Venkman a specimen jar.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI'd like to have a stool specimen\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYeah, you would.  Is that for personal or\n\t\t\tprofessional reasons?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (picking up the baby)\n\t\t\tOkay, kid.  Up you go.\n\nHe starts clowning with the baby, holding him over his head and pressing\nhis nose into the baby's belly, pretending that the baby is attacking\nhim.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHelp!  Please somebody help me!  Get him off!\n\t\t\tQuickly!  He's gone completely berserk!\n\nDana is amused and somewhat disarmed by Venkman's rapport with the baby.\n\n\t\t\t\t\t\tDANA\n\t\t\tWhat do you think?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThere's no doubt about it.  He's got his\n\t\t\tfather's looks.  The kid is ugly -- extremely\n\t\t\tugly.  And smelly.\n\t\t\t\t (resumes playing with the baby)\n\t\t\tYou stink!  It's just horrible.  You are the\n\t\t\tstinkiest baby I ever smelled.\n\t\t\t\t (to Dana)\n\t\t\tWhat's his name?\n\n\t\t\t\t\t\tDANA\n\t\t\tHis name is Oscar.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOscar!  You poor kid!\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (losing patience)\n\t\t\tPeter, this is serious.  I need to know if you\n\t\t\tthink there's anything unusual about him.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tUnusual?\n\t\t\t\t (holds up the baby and\n\t\t\t\t scrutinizes him)\n\t\t\tI don't know.  I haven't had a lot of\n\t\t\texperience with babies.\n\nHe looks at the baby, pulling his feet up, trying to get the sleeper\noff.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (taking the specimen jar)\n\t\t\tI'll do it.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'll supervise.\n\nINT. DANA'S APARTMENT - NURSERY - DAY (CONTINUOUS ACTION)\n\nVenkman enters and finds Stantz monitoring the room.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Stantz)\n\t\t\tWell, Holmes, what do you think?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIt's an interesting one, Pete.  If anything\n\t\t\twas going on it's totally subdued now.\n\nSpengler enters.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Spengler)\n\t\t\tWhat now, Brainiac?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI think we should see if we can find\n\t\t\tanything abnormal on the street.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tFinding something abnormal on the street\n\t\t\tshouldn't be too hard.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. EAST 77TH STREET - DAY (LATER)\n\nDana walks down the street with Venkman, retracing the path of the\nrunaway buggy.  Spengler and Stantz follow, monitoring PKE valences from\nthe pavement and the buildings.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Dana, nostalgic)\n\t\t\tBrings back a lot of sweet memories, doesn't\n\t\t\tit?\n\t\t\t\t (pointing out familiar\n\t\t\t\t neighborhood sights)\n\t\t\tThere's our old cash machine.  And the dry\n\t\t\tcleaners we used to go to.  And the old\n\t\t\tvideo store.\n\t\t\t\t (he wipes away an imaginary\n\t\t\t\t tear)\n\t\t\tWe really had some good times, didn't we?\n\n\t\t\t\t\t\tDANA\n\t\t\tWe definitely had a moment or two.\n\nDana stops at the intersection and points to the middle of the street.\n\n\t\t\t\t\t\tDANA\n\t\t\tThat's where the buggy stopped.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOkay, let's take a look.\n\nVenkman walks right out into the middle of the street, completely\noblivious to the CARS HONKING and whizzing past him and starts motioning\nlike a traffic cop, bringing traffic to a standstill.  Then he signals\nfor Dana, Stantz and Spengler to join him in the middle of the street.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (reading the PKE meter)\n\t\t\tIs this the spot?\n\n\t\t\t\t\t\tDANA\n\t\t\tA little to the left.  Right there!  That's\n\t\t\twhere it stopped.\n\nStantz reads the PKE meter.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNothing.  Not a trace.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tWhy don't we try the Giga-meter?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhat's that?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tEgon and I have been working on a gauge to\n\t\t\tmeasure psychomagnetheric energy in GEVs -\n\t\t\tgiga electron volts.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tThat's a thousand million electron volts.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI knew that.\n\nSpengler switches on the Giga-meter, the device he was testing in the\nlab, and passes it over the spot on the street where the buggy stopped.\nThe indicator goes right into the red zone and the DEVICE starts CLICKING\nWILDLY.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI think we hit the honeypot, boys.  There's\n\t\t\tsomething brewing under the street.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (worried, to Venkman)\n\t\t\tPeter, do you think maybe I have some genetic\n\t\t\tproblem or something that makes me vulnerable\n\t\t\tto these supernatural things.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou mean like the time you got possessed and\n\t\t\tturned into a monster terror dog?  No, not\n\t\t\ta chance.  Total coincidence.\n\t\t\t\t (to Stantz and Spengler)\n\t\t\tAm I right?\n\nStantz and Spengler look at him skeptically, not convinced by the\ncoincidence theory.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MANHATTAN MUSEUM OF ART - LATE AFTERNOON\n\nThe museum has just closed for the day and the last of the visitors and\nemployees are leaving.\n\nINT.  RESTORATION STUDIO - SAME TIME\n\nJanosz is working late on the painting of Vigo.\n\nVIGO PAINTING\n\nUnnoticed by Janosz, the eyes of Vigo start to glow.\n\nJANOSZ\n\nHe touches his brush to the canvas and a powerful current of red,\ncrackling energy surges through the brush and courses through his body,\ndriving him to his knees.\n\nPAINTING\n\nThe figure of Vigo comes to life, turns toward Janosz and gestures\ndramatically at him.  Then he speaks to Janosz in a commanding voice.\n\n\t\t\t\t\t\tVIGO\n\t\t\tI, Vigo, the scourge of Carpathia, the\n\t\t\tsorrow of Moldavia, command you.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (in agony)\n\t\t\tCommand me, lord.\n\n\t\t\t\t\t\tVIGO\n\t\t\tOn a mountain of skulls in a castle of pain,\n\t\t\tI sat on a throne of blood.  What was will\n\t\t\tbe, what is will be no more.  Now is the\n\t\t\tseason of evil.  Find me a child that I might\n\t\t\tlive again.\n\nBolts of red-hot energy shoot from the eyes of Vigo into Janosz's eyes.\nHe screams and falls to his knees.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. COFFEE SHOP - EAST 77TH STREET - NIGHT\n\nVenkman and Stantz come out with small boxes containing coffee,\nsandwiches and Danish and start walking up the street.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI love this.  We're onto something really\n\t\t\tbig.  I can smell it, Ray.  We're going to\n\t\t\tmake some headlines with this one.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tHey, hey, hey, stresshound!  Are you nuts?\n\t\t\tIf anybody found out about this we'd be in\n\t\t\tserious trouble.  The judge couldn't have\n\t\t\tbeen clearer - no ghostbusting.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tRelax.  We're going to keep this whole thing\n\t\t\tnice and quiet, low key, no profile.\n\nEXT.  EAST 77TH STREET - NIGHT (CONTINUOUS ACTION)\n\nSpengler, wearing a hardhat, is JACKHAMMERING a hole in the middle of the\nstreet.  Safety cones and reflectors have been set up and a small area is\nlit by strong work lights.\n\nPOLICE CAR\n\nIt turns onto East 77th Street, cruises slowly up to the makeshift\nworksite and stops.  The noise of the JACKHAMMER is so loud, Spengler\ndoesn't notice the police car and the two COPS inside looking at them.\nFinally, he looks up, sees the police car and freezes.\n\n\t\t\t\t\t\tFIRST COP\n\t\t\tHow ya doing?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (reeking with guilt)\n\t\t\tFine!  It's cutting fine now.\n\n\t\t\t\t\t\tFIRST COP\n\t\t\t\t (curious)\n\t\t\tWhy are you cutting?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (looking for one of the\n\t\t\t\t others)\n\t\t\tWhy are we cutting?  Uh - boss!\n\nVenkman and Stantz arrive just in time wearing Con Ed hardhats, doing a\ngood imitation of a Consolidated Edison repairman.\n\n\t\t\t\t\t\tFIRST COP\n\t\t\tWhat are you doing here?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (belligerent)\n\t\t\tWhat the hell's it look like we're doing?\n\t\t\tWe're bustin out asses over here 'cause\n\t\t\tsome douchebag downtown ain't got nothin'\n\t\t\tbetter to do than make idiots like us work\n\t\t\tlate on a Friday night, right?\n\t\t\t\t (looks to Spengler for\n\t\t\t\t agreement)\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (with a \"right on\" fist)\n\t\t\tYo.\n\nThe cops seem satisfied by the explanation.\n\n\t\t\t\t\t\tFIRST COP\n\t\t\tOkay, boys, take it easy.\n\nThey drive off.  Spengler breathes a great sigh of relief and starts\nrubbing his sore shoulders.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tYou were supposed to help me with this.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou need the exercise.\n\nStantz resumes JACKHAMMERING, while Venkman and Spengler clear the\nrubble from the hole.  Suddenly he hits metal.  They clear away\ngenerations of paving material revealing an ornate iron manhole cover.\nThe manhole cover bears a strange logo and the letters NYPRR.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (examing it)\n\t\t\tNYPRR.  What the hell -- ?  Help me lift\n\t\t\tthis.\n\nThey prey off the iron cover with crowbars, uncovering a very dark and\nvery deep abyss.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (shining a flashlight into\n\t\t\t\t the hole)\n\t\t\tWow!  It's an old airshaft.  It just goes\n\t\t\tforever.\n\nSpengler leans in with the giga-meter which is reading even higher now.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tVery intense.  We need a deeper reading.\n\t\t\tSomebody has to go down there.\n\nVenkman and Spengler both look at Ray.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThanks, boys.\n\nThey snap Stantz into a harness and lower him into the hole on a strong\ncable attached to a winch.  Ray calls out orders to them as he descends\ndeeper and deeper.\n\n\t\t\t\t\t\tSTANTZ (O.S.)\n\t\t\t\t (his voice echoing in the\n\t\t\t\t airshaft)\n\t\t\tKeep going -- more -- more --\n\nINT.  HOLE - NIGHT (CONTINUOUS ACTION)\n\nStantz rappels off the sides of the airshaft as he continues his descent\nin total darkness.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (using a radio now)\n\t\t\tLower -- lower --\n\t\t\t\t (to himself)\n\t\t\tGee, this really is deep.\n\nSuddenly, his feet kick thin air as he gets to the bottom of the airshaft\nand swings free in some kind of tunnel.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (shouts)\n\t\t\tHold it!  Steady!\n\nHe pulls a powerful flashlight from his utility belt and shines it into\nthe tunnel below.\n\nINT.  VAN HORNE STATION - STANTZ'S POV - NIGHT\n\nHe is suspended near the top of a beautifully preserved chamber with\nrounded, polished tile walls ardorned with intricate, colorfully enameled\nArt Nouveau mosaics.  A finely inlaid sign identifies it as VAN HORNE\nSTATION.\n\nSTANTZ\n\nHe pans the walls with his flashlight, admiring the excellent tilework,\nand speaks quietly to Venkman and Spengler over his walkie-talkie.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (reverently)\n\t\t\tThis is it, boys, the end of the line.  Van\n\t\t\tHorne Station.  The old New York Pneumatic.\n\t\t\tIt's still here.\n\nEXT.  EAST 77TH STREET - HOLE - NIGHT (CONTINUOUS ACTION)\n\nVenkman has no idea what he's talking about.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (explaining)\n\t\t\tThe New York Pneumatic Railway.  It was an\n\t\t\texperimental subway system.  Fan-forced\n\t\t\tair-trains, built around 1870.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (over the walkie-talkie)\n\t\t\tThis is about as deep as you can go under\n\t\t\tManhattan without digging your own hole.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to Stantz)\n\t\t\tWhat's the reading?\n\nINT.  VAN HORNE STATION - NIGHT (CONTINUOUS ACTION)\n\nStantz shines his flashlight on the meter and whistles at the extremely\nhigh reading.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (on the radio)\n\t\t\tOff the top of the scale.  This place is\n\t\t\treally hot.  Lower me to the floor.\n\nAs Venkman and Spengler feed him some more cable, he pans his flashlight\ndown the wall of the station, then onto the floor.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (shouts)\n\t\t\tHold it!!  Stop!!  Whoa!!\n\nINT. VAN HORNE STATION - STANTZ'S POV - FLOOR - NIGHT\n\nBelow him is a river of bubbling seething, glowing slime, a veritable\ntorrent of disgusting ooze.\n\nAs he stares into the foul effluent, we become aware of the strangely\namplified and magnified sounds of great ENGINES THROBBING and pulsing in\nthe bowels of the city, of WATER RUSHING through pipes, STEAM HISSING\nthrough ducts, the muffled RUMBLE of the SUBWAY and the ROAR of TRAFFIC,\nand mixed with it all, the unmistakable sounds of human conflict and pain\n-- VOICES SHOUTING in anger, SCREAMING in fear, GROANING in pain, a sad\nand eerie symphony.\n\nINT.  VAN HORNE STATION - STANTZ - NIGHT\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (ranting on the radio)\n\t\t\tOh, my God!  It's a seething, bubbling,\n\t\t\tpsychic cess!  Interlocked tubes of plasm,\n\t\t\tcrackling with negative GEVs!  It's glowing\n\t\t\tand moving!  It's -- it's a river of slime!!\n\nSTANTZ\n\nHe dangles from the end of the cable, holding his feet up as high as he\ncan.  He unhooks a device from his utility belt and pulls the trigger on\nit, shooting out a long telescoping fishing-pole with a scoop on the end.\nReaching down, he scoops up a sample of the slime and starts retracting\nthe pole.\n\nSLIME\n\nSuddenly, a grotesque arm with a long skeletal fingers reaches up out of\nthe slime and snatches at Stantz's dangling feet.  He jerks his legs up\nas several more arms poke up out of the slime and reach for him.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (on the radio)\n\t\t\tHaul me up, Venkman!  Now!\n\nEXT.  EAST 77TH STREET - HOLE - NIGHT (CONTINUOUS ACTION)\n\nVenkman and Spengler start hauling in the cable as a Con Ed Supervisor's\ncar drives up, and behind it, the same police car they saw earlier.  A\nburly SUPERVISOR gets out and crosses toward them, followed by the two\ncops.\n\n\t\t\t\t\t\tSUPERVISOR\n\t\t\t\t (no nonsense)\n\t\t\tOkay, what's the story here?\n\nVenkman and Spengler stop pulling up the cable and Venkman tries the\nbelligerent worker ploy again, only this time he's wearing a Nynex\nhardhat.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhat, I got time for this?  We got three\n\t\t\tthousand phones out in the Village and about\n\t\t\teight million miles of cable to check.\n\n\t\t\t\t\t\tSUPERVISOR\n\t\t\t\t (not buying it)\n\t\t\tThe phone lines are over there.\n\t\t\t\t (points to the curb)\n\nVenkman pops Spengler on the head.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI told ya!\n\nStantz can be heard ranting over Venkman's walkie-talkie.\n\n\t\t\t\t\t\tSTANTZ (O.S.)\n\t\t\t\t (filtered)\n\t\t\tHelp!  Help!  Pull me up!  It's alive!  It's\n\t\t\teating my boots.\n\nVenkman switches off the walkie-talkie.\n\n\t\t\t\t\t\tFIRST COP\n\t\t\tYou ain't with Con Ed or the phone company.\n\t\t\tWe checked.  Tell me another one.\n\nVenkman stares at the Cop for a long moment.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tGas leak?\n\nINT.  VAN HORNE STATION - SAME TIME\n\nStantz is hanging there, looking down into the shaft at the slime which\nis now bubbling up the shaft after him.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (shouting)\n\t\t\tGet me out of here!!\n\nDesperate now, he kicks wildly and knocks loose a section of an old,\nrusting conduit.\n\nINT.  VAN HORNE STATION - BOTTOM OF THE SHAFT\n\nThe conduit falls on a heavy electrical transmission line, ripping\nthrough the cable with a SHOWER OF SPARKS.\n\nEXT.  EAST 77TH STREET - HOLE - CONTINUOUS ACTION\n\nVenkman, Spengler, the cops and the supervisor all react to a bright\nFLASH deep down in the hole and a SHOUT from Stantz.\n\nEXT.  EAST 77TH STREET - STREET - NIGHT\n\nOne by one, all the streetlights go out; then the lights on all the\nbuildings along East 77th street; then the whole neighborhood blacks\nout, and finally the entire city is plunged into darkness.\n\n\t\t\t\t\t\tSTANTZ (O.S.)\n\t\t\tSorry.\n\nINT. DANA BARRETT'S APARTMENT - NIGHT (SAME TIME)\n\nShe walks around in the dark lighting candles and placing them all over\nthe living room.  Then she finds a transistor radio and turns it on for\ninformation about the blackout.  She listens to a special news report\nfor a moment, then has a compelling impulse to go check on the baby.\nShe crosses to the nursery carrying a candle and quietly opens the door\nand looks in.  Suddenly the DOORBELL RINGS, scaring her half to death.\nLeaving the chain on the door, she opens it a crack and sees Janosz\nstanding in the hall, eerily lit by a red emergency spot at the end of\nthe hallway.  He looks slightly dazed and even creepier.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (surprised)\n\t\t\tJanosz?\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tHello, Dana.  I happened to be in the\n\t\t\tneighborhood and I thought I'd stop by to\n\t\t\tsee if everything's all right with you --\n\t\t\tyou know, with the blackout and everything?\n\t\t\tAre you okay?  Is the baby all right?\n\nHis affected concern is chilling.  She is frightened but conceals it\nfrom him.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (mechanically and cautiously)\n\tWe're fine, Janosz.\n\nHe tires to look around her into the apartment.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tDo you need anything?  You want me to come\n\t\t\tin?\n\n\t\t\t\t\t\tDANA\n\t\t\tNo, everything's fine.  Honestly.  Thanks\n\t\t\tanyway.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tOkay, just thought I'd check.  Good night,\n\t\t\tDana.  Sleep well.  Don't let the bedbugs\n\t\t\tbite you.\n\n\t\t\t\t\t\tDANA\n\t\t\tGood night, Janosz.\n\nShe closes the door behind him and double locks it, then stands there\nstaring into the candlelight, alone and afraid.\n\nINT.  HALLWAY OF DANA'S BUILDING - NIGHT (CONTINUOUS ACTION)\n\nJanosz stands there in semi-darkness, then his eyes light up like\nheadlights and he walks off down the hall.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  COURTROOM - WITNESS STAND - NEXT DAY\n\nThe JUDGE, a rather sour-looking jurist of the old school, calls the\ncourt to order.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tI want to make one thing very clear before\n\t\t\twe go any further.  The law does not recognize\n\t\t\tthe existence of ghosts, and I don't believe\n\t\t\tin them either, so I don't want to hear a\n\t\t\tlot of malarkey about goblins and spooks and\n\t\t\tdemons.  We're going to stick to the facts\n\t\t\tin this case and save the ghost stories for\n\t\t\tthe kiddies.  Understood?\n\nDEFENSE TABLE\n\nStantz leans over and whispers to Spengler.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tSeems like a pretty open-minded guy, huh?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tHis nickname is \"The Hammer.\"\n\nStantz and Spengler are seated with their attorney LOUIS TULLY, lawyer,\nCPA and former demonic possession victim.  Louis is desperately paging\nthrough a mountain of legal textbooks.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (nervous)\n\t\t\tI think you're making a big mistake here,\n\t\t\tfellas.  I do mostly tax law and some probate\n\t\t\tstuff occasionally.  I got my law degree at\n\t\t\tnight school.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThat's all right.  We got arrested at night.\n\nSPECTATORS' GALLERY\n\nVenkman is talking to Dana at the wooden rail in front of the gallery.\n\n\t\t\t\t\t\tDANA\n\t\t\tI wish I could stay.  I feel personally\n\t\t\tresponsible for you being here.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou are personally responsible.  If I can\n\t\t\tget conjugal rights, will you visit me at\n\t\t\tSing Sing?\n\n\t\t\t\t\t\tDANA\n\t\t\tPlease don't say that.  You won't go to prison.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDon't worry about me.  I'm like a cat.\n\n\t\t\t\t\t\tDANA\n\t\t\tYou mean you cough up hairballs all over\n\t\t\tthe rug?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'm El Gato.  I always land on my feet.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (sincerely)\n\t\t\tGood luck.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThanks.\n\nShe gives him a quick, unexpected kiss and exits.  Venkman savors it for\na moment then goes back to the defense table.\n\nPROSECUTION TABLE\n\nJack Hardemeyer, the mayor's principal aide, is goading the PROSECUTOR,\na very sober, humorless woman in her late thirties.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\tHow are you doing, hon?  Just put these guys\n\t\t\taway fast and make sure they go away for a\n\t\t\tlong, long time.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tIt shouldn't be hard with this list of charges.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\tGood.  Very good.  The mayor and future\n\t\t\tgovernor won't forget this.\n\nHe smiles conspiratorially and makes a point of passing the defense table\non his way out of the courtroom.\n\nDEFENSE TABLE\n\nThe Ghostbusters look up as Hardemeyer approaches.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (gloating)\n\t\t\tNice going, Venkman.  Violating a judicial\n\t\t\trestraining order, willful destruction of\n\t\t\tpublic property, fraud, malicious mischief\n\t\t\t-- smooth move.  See you in a couple years\n\t\t\t-- at your first parole hearing.\n\nHerdemeyer exits.  Louis looks devastated.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tGee, the whole city's against us.  I think\n\t\t\tI'm going to be sick.\n\nSpengler hands him a waste basket as the Prosecutor calls her first\nwitness.\n\nINT.  COURTROOM - WITNESS STAND - DAY (LATER)\n\nThe Con Ed Supervisor is testifying.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tMr. Fianella, please look at Exhibits A\n\t\t\tthrough F on the table over there.  Do you\n\t\t\trecognize that equipment?\n\nEXHIBIT TABLE\n\nLying on the table are the basic tools of the Ghostbusting trade: three\nproton packs and particle throwers, a couple of ghost traps, and various\nmeters and detection devices.\n\n\t\t\t\t\t\tCON ED\n\t\t\t\t (o.c.)\n\t\t\tThat's the stuff the cops found in their\n\t\t\ttruck.\n\nWITNESS STAND\n\nShe continues.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tDo you know what this equipment is used for?\n\n\t\t\t\t\t\tCON ED\n\t\t\t\t (shrugs)\n\t\t\tI don't know.  Catching ghosts, I guess.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\t\t (to the Judge)\n\t\t\tMay I remind the court that the defendants\n\t\t\tare under a judicial restraining order that\n\t\t\tspecifically forbids them from performing\n\t\t\tservices as paranormal investigators and\n\t\t\teliminators.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tSo noted.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tNow, Mr. Fianella, can you identify the\n\t\t\tsubstance in the jar on the table marked\n\t\t\tExhibit F?\n\nPROSECUTOR\n\nShe goes to the exhibit table and picks up a specimen jar containing the\nslime sample Stantz removed from the tunnel.\n\n\t\t\t\t\t\tCON ED\n\t\t\tI been working underground for Con Ed for\n\t\t\t27 years and I never saw anything like that\n\t\t\tin my life.  We checked out that tunnel the\n\t\t\tnext day and we didn't find nothing.  If it\n\t\t\twas down there, they must have put it there.\n\nDEFENSE TABLE\n\nVenkman and Spengler look at Stantz.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (defensively)\n\t\t\tHey, I didn't imagine it.  There must have\n\t\t\tbeen ten thousand gallons of it down there.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tIt may be ebbing and flowing from some tidal\n\t\t\tsource.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (nervously)\n\t\t\tShould I say that?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI doubt that they'd believe us.\n\nLouis moans and goes back to his notes.\n\n\t\t\t\t\t\t\t\t\t\t\t\t WIPE TO:\n\nINT.  COURTROOM - WITNESS STAND - LATER\n\nVenkman himself is on the stand and Louis is questioning him.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tSo like you were just trying to help out\n\t\t\tyour old friend because she was scared and\n\t\t\tyou didn't really mean to do anything bad\n\t\t\tand you really love the city and won't ever\n\t\t\tdo anything like this again, right?\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tObjection, your Honor.  He's leading the\n\t\t\twitness.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tThe witness is leading him.  Sustained.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOkay, let me rephrase that question.\n\t\t\t\t (to venkman)\n\t\t\tDidn't you once coach a basketball team for\n\t\t\tunderprivileged children?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYes, I did.  We were city champs.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tObjection.  Irrelevant and immaterial.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tSustained.  Mr. Tully, do you have anything\n\t\t\tto ask this witness that may have some\n\t\t\tbearing on this case?\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (to Venkman)\n\t\t\tDo I?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNo, I think you've helped them enough already.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (to the Judge)\n\t\t\tNo, I guess not.\n\t\t\t\t (to the Prosecutor)\n\t\t\tYour witness.\n\nThe Prosecutor rises and approaches the witness stand with relish.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tSo, Dr. Venkman, please explain to the court\n\t\t\twhy it is you and your co-defendants took it\n\t\t\tupon yourselves to dig a big hole in the\n\t\t\tmiddle of the street.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSeventy-seventh and First Avenue has so many\n\t\t\tholes already we didn't think anyone would\n\t\t\tnotice.\n\nThe gallery laughs and the Judge gavels for order.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tKeep that up, mister, and I'll find you in\n\t\t\tcontempt.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSorry, your Honor, but when somebody sets\n\t\t\tme up like that I can't resist.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tI'll ask you again, Dr. Venkman.  Why were\n\t\t\tyou digging the hole?  And please remember\n\t\t\tthat you're under oath.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI had my fingers crossed when they swore me\n\t\t\tin, but I'm going to tell you the truth.\n\t\t\tThere are things in this world that go way\n\t\t\tbeyond human understanding, things that\n\t\t\tcan't be explained and that most people don't\n\t\t\twant to know about anyway.  That's where we\n\t\t\tcome in.\n\n\t\t\t\t\t\tPROSECUTOR\n\t\t\tSo what are you saying?  That the world of\n\t\t\tthe supernatural is your special province?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNo, I guess I'm just saying that shit happens\n\t\t\tand somebody has to deal with it.\n\nThe spectators in the gallery cheer and the judge gavels for order.\n\n\t\t\t\t\t\t\t\t\t\t\t\t WIPE TO:\n\nINT.  COURTROOM - LATER\n\nThe trial is nearing its end.  The Judge calls on Louis to make his\nsummation.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tDoes the counsel for the defense wish to\n\t\t\tmake any final arguements?\n\nLouis rises.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tYour honor, may I approach the bench?\n\n\t\t\t\t\t\tJUDGE\n\t\t\t\t (impatient)\n\t\t\tYes.\n\nLouis crosses to the judge's bench.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (to the judge)\n\t\t\tCan I have some of your water?\n\n\t\t\t\t\t\tJUDGE\n\t\t\tGet on with it, counselor!\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (scared)\n\t\t\tYour honor, ladies and gentlemen of the --\n\t\t\t\t (he remembers there's no\n\t\t\t\t jury)\n\t\t\taudience.  I don't think it's fair to call\n\t\t\tmy clients frauds.  Okay, the blackout was\n\t\t\ta big problem for everybody.  I was stuck in\n\t\t\tan elevator for about three hours and I had\n\t\t\tto go to the bathroom the whole time, but I\n\t\t\tdon't blame them because once I turned into\n\t\t\ta dog and they helped me.  Thank you.\n\nHe goes back to the defense table and sits down.  Stantz and Spengler\nhang their heads.  Venkman pats Louis on the back.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to Louis)\n\t\t\tWay to go.  Concise and to the point.\n\nJUDGE\n\nHe stares at Louis, astonished at his summation.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tThat's it?  That's all you have to say?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tDid I forget something?\n\nHe searches through a disorderly pile of notes.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tThat was unquestionably the worst\n\t\t\tpresentation of a case I've ever heard in a\n\t\t\tcourt of law!  I ought to cite you for\n\t\t\tcontempt and have you disbarred.  As for\n\t\t\tyour clients, Peter Venkman, Raymond Stantz\n\t\t\tand Egon Spengler, on the charges of\n\t\t\tconspiracy, fraud and the willful destruction\n\t\t\tof public property, I find you guilty on all\n\t\t\tcounts.  I order you to pay fines in the\n\t\t\tamount of $25,000 each and I sentence you to\n\t\t\teighteen months in the city correctional\n\t\t\tfacility at Ryker's Island.\n\nSTANTZ\n\nHe sees the activity in the jar\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tUh-oh, she's twitchin'.\n\nTHE BENCH\n\nThe Judge continues\n\n\t\t\t\t\t\tJUDGE\n\t\t\tAnd on a more personal note, let me go on\n\t\t\trecord as saying that there is no place in\n\t\t\tdecent society for fakes, charlatans and\n\t\t\ttricksters like you who prey on the\n\t\t\tgullibility of innocent people.  You're\n\t\t\tbeneath the contempt of this court.  And\n\t\t\tbelieve me, if my hands were not tied by the\n\t\t\tunalterable fetters of the law, a law which\n\t\t\thas become in my view far too permissive and\n\t\t\tinadequate in it's standards of punishment,\n\t\t\tI would invoke the tradition of our\n\t\t\tillustrious forebearers, reach back to a\n\t\t\tsterner, purer justice and have you burned\n\t\t\tat the stake!\n\nHe hammers the bench with his gravel as the gallery erupts noisily.  Then\nhe feels a LOW RUMBLING TREMOR in the courtroom.\n\nSPECIMEN JAR\n\nThe slime starts to pulse and swell, pushing up the lid on the jar.\n\nDEFENSE TABLE\n\nStantz anticipates big trouble.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tUnder the table, boys!\n\nThe Ghostbusters duck under the defense table.\n\nLOUIS\n\nHe stands up and looks around fearfully.\n\nINT.  COURTROOM - GHOST BATTLE - DAY\n\nEverybody is silent now as the rumbling increases.  All eyes turn to the\nexhibit table.  Then suddenly all Hell breaks loose as TWO FULL-TORSO\nAPPARITIONS explode out of the specimen jar.\n\nJUDGE\n\nHe looks up in terror at the two huge apparitions looming above him and\nrecognizes them immediately.\n\n\t\t\t\t\t\tJUDGE\n\t\t\t\t (in horror)\n\t\t\tOh, my God!  The Scoleri Brothers!\n\nSCOLERI BROTHERS\n\nBig in life, even bigger in death, the ghostly Scoleri brothers seem ten\nfeet tall.  They are strapped into electric chairs and on their heads are\nmetal electrocution caps with live, sparking electrical wires still\nattached.  Twenty-five hundred volts of electricity shoot through their\nbodies as they start to break free of the leather restraints, trying to\nget at the Judge.\n\nJUDGE\n\nHolding his gavel like a pitiful weapon, he crawls over to the defense\ntable where Venkman, Stantz and Spengler are now crouched, assessing the\nspectral intruders.\n\n\t\t\t\t\t\tJUDGE\n\t\t\t\t (terrified)\n\t\t\tYou've got to do something!\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWho are they?\n\n\t\t\t\t\t\tJUDGE\n\t\t\tThey're the Scoleri Brothers.  I tried them\n\t\t\tfor murder.  They were electrocuted up at\n\t\t\tOssining in '48.  Now they want to kill me.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tMaybe they just want to appeal.\n\nSCOLERI BROTHERS\n\nThey break loose from the electric chairs, then turn toward the defense\ntable and BLAST it with HIGH-VOLTAGE FINGER-LIGHTNING.\n\nPROSECUTOR\n\nShe sprints for the door, pursued by one of the Scoleri brothers.\n\nGHOSTBUSTERS\n\nThey jump to safety behind the rail of the jury box, pulling the Judge\nwith them.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThese boys aren't playing around.\n\n\t\t\t\t\t\tJUDGE\n\t\t\t\t (desperately)\n\t\t\tYou've got to stop them.  Please!\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (thinking like a lawyer)\n\t\t\tViolating a judicial restraining order could\n\t\t\texpose my clients to serious criminal\n\t\t\tpenalties.  As their attorney I'd have to\n\t\t\tadvise them against it.\n\nSCOLERI BROTHERS\n\nThey start punching through the jury box.\n\nJUDGE\n\nHe is just about hysterical with fear.\n\n\t\t\t\t\t\tJUDGE\n\t\t\tAll right!  All right!  I'm recinding the\n\t\t\torder.  Case dismissed!!\n\t\t\t\t (he pounds his gavel on\n\t\t\t\t the floor)\n\t\t\tNow do something!\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tLet's go to work, boys.\n\nWith that, the Ghostbusters leap over the rail of the jury box and dash\nacross the courtroom to the exhibit table where their proton packs were\nbeing displayed as evidence.  They strap them on hastily as the Brothers\ncontinue tearing up the seats looing for the Judge.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (slinging the pack onto\n\t\t\t\t his back)\n\t\t\tGeez, I forgot how heavy these things are.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (grabbing other gear)\n\t\t\tOkay, let's heat 'em up!\n\nThey flip the power switches on their packs and draw their particle\nthrowers.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tAll right, throwers.  Set for full neutronas\n\t\t\ton stream.\n\nThey switch on their throwers and turn to face the raging phantasms.\n\nSCOLERI BROTHERS\n\nThey are just about to wipe out the Judge when a loud shout distracts\nthem.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHey!  Why don't you pick on someone your own\n\t\t\tsize?\n\nThe towering ghosts turn in a fury and raise their arms, ready to shoot\nlightning at their new adversaries.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to the others)\n\t\t\tOn my signal, boys.  Open 'em up -- Now!\n\nThey all pull their triggers and the wands EXPLODE with incredible\npowerful STREAMS OF ENERGY, doing even more damage to the courtroom.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSpengs, take the door.  Ray, let's try and\n\t\t\twork them down and into the corner.\n\nWorking as a team, they gradually confine the Scoleri Brothers with the\nstreams, forcing them closer and closer to the traps Ray has set out on\nthe floor.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWatch it!  I'm coming under you, Pete.\n\nThey circle around the two ghosts, prodding them with the streams while\nducking the lightning bolts shooting from their fingers.  Finally, Ray\nsees his chance and pops open the traps which emit inverted pyramids of\nlight energy.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tSteady -- watch your streams -- easy now --\n\t\t\tVenky, bring him left -- Spengy, pull him\n\t\t\tdown -- trapping -- trapping -- now!\n\nHe stomps on a control pedal and the Scoleri Brothers are drawn into the\ntraps which snap shut.\n\nINT.  COURTROOM - TRAPS - DAY\n\nLEDs on the outer casing start flashing, indicating the presence of a\nghost inside each trap.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (checking the trap)\n\t\t\tOccupado.\n\nINT.  COURTROOM - JUDGE - DAY (AFTER GHOST BATTLE)\n\nHe sticks his head up slowly from behind the debris of his bench and\nlooks around in total amazement.\n\nLOUIS\n\nHe crawls out from under a chair.  Reporters and spectators get back on\ntheir feet and start buzzing about the incredible manifestation.\n\nPROSECUTOR\n\nShe's lying on the floor, attended to by the Bailiff and the Court Clerk.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to the Prosecutor)\n\t\t\tBrilliant summation.\n\nGHOSTBUSTERS\n\nThey break into big smiles as photographers start snapping pictures of\nthem standing in the wrecked courtroom.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tCase closed, boys.  We're back in business.\n\nThe spectators cheer and applaud.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  FIREHOUSE - DAY\n\nThe old, dilapidated Ghostbusters logo comes crashing to the ground,\ndropped by a pair of workmen on a ladder, and the new logo is hoisted\ninto place over the main entrance.  It's just like the original \"No\nGhosts\" logo, but in the new one the ghost in the red circle is holding\nup two fingers.  Venkman enters the firehouse.\n\nINT.  BEDROOM SET (TV COMMERCIAL - FULL SCREEN VIDEO) - NIGHT\n\nA man and his wife are lying in bed reading.  The man is played by Louis\nTully and JANINE MELNITZ, the Ghostbusters' once and future receptionist,\nis playing his wife.  They are both terrible actors.  Suddenly, a ghost,\nactually a very bad puppet on a wire, floats through the bedroom.  Janine\nsees it and screams.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tWhat is it, honey?\n\n\t\t\t\t\t\tJANINE\n\t\t\tIt's that darn ghost again!  I don't know\n\t\t\twhat to do anymore.  He just won't leave us\n\t\t\talone.  I guess we'll just have to move.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tDon't worry.  We're not moving.  He is.\n\nHe picks up the phone.\n\n\t\t\t\t\t\tJANINE\n\t\t\tWho are you going to call?\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (with a wink)\n\t\t\tGhostbusters.\n\nAs he starts to dial, the CAMERA PULLS BACK to reveal the Ghostbusters\nstanding in the bedroom.  Their acting isn't much better than Louis and\nJanine's.\n\nGHOSTBUSTERS\n\nStantz speaks directly TO the CAMERA.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI'm Ray --\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'm Peter --\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tI'm Egon --\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tAnd we're the ...\n\n\t\t\t\t\t\tALL\n\t\t\t\t (together)\n\t\t\tGhostbusters.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThat's right -- Ghostbusters.  We're back\n\t\t\tand we're better than ever with twice the\n\t\t\tknow-how and twice the particle-power to\n\t\t\tdeal with all your supernatural elimination\n\t\t\tneeds.\n\nDuring his speech, Winston can be seen in the b.g. pretending to trap the\nfake ghost.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tCareful, Winston.  He's a mean one.\n\t\t\t\t (TO CAMERA)\n\t\t\tAnd to celebrate our grand reopening, we're\n\t\t\tgiving you twice the value with our special\n\t\t\thalf-price 'Welcome Back' service plan.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHold on, Ray!  Half-price!  Have you gone\n\t\t\tcrazy?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI guess so, Pete, because that's not all.\n\t\t\tTell them what else we've got, Egon.\n\nSpengler actually mouths everyone else's dialogue along with them,\nwaiting for his cue.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tYou mean the Ghostbusters hot beverage\n\t\t\tthermal mugs and free balloons for the kids?\n\nHe holds up a mug and a limp, uninflated balloon.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYou bet.\n\nAs Stantz wraps it up, SUPERS APPEAR at the bottom of the SCREEN: FULLY\nBONDED - FULLY LICENSED - SE HABLA ESPANOL.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (TO CAMERA)\n\t\t\tSo don't wait another minute.  Make your\n\t\t\tsupernatural problem our supernatural problem.\n\t\t\tCall now, because we're still --\n\n\t\t\t\t\t\tALL\n\t\t\t\t (in unison, mechanically)\n\t\t\t-- Ready to believe you.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  JACK HARDEMEYER'S OFFICE - DAY\n\nHardemeyer is watching the Ghostbusters commercial on a TV in his office.\nHe bangs his fist on his desk and angrily switches OFF the TV.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  FIREHOUSE - DAY (LATER)\n\nThe garage door opens and the new improved ECTOMOBILE comes ROARING out\nonto the street, its ghostly SIREN MOANING and WAILING.  Louis comes\nrunning out after it.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  FIREHOUSE - DAY\n\nLouis comes back into the garage bay and stops as he smells a foul odor.\nHe sniffs around, following the smell.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOh, geez, smells like somebody took a really\n\t\t\tbig --\n\nHe freezes.\n\nINT. OFFICE AREA - LOUIS'S POV\n\nSlimer, a spud-like green ghost, is hovering over Louis's desk, scarfing\ndown Louis's bag lunch.  Slimer looks up and sees Louis.\n\nSLIMER AND LOUIS\n\nThey both scream and run off in opposite directions.\n\nSLIMER\n\nHe passes right through a wall and disappears.\n\nLOUIS\n\nHe runs right into a wall, recovers and exits in a hurry.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (screaming)\n\t\t\tHelp!  There's a thing!\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  CENTRAL PARK RESERVOIR - DAY (LATER)\n\nRunners of both sexes and all ages are huffing and puffing as they jog\nalong the track that circles the reservoir.  One of the runners looks\nbehind him at the sound of APPROACHING FOOTFALLS and screams.\n\nGHOSTLY JOGGER\n\nA ghost jogger is loping along at a pretty fair pace.  Other runners\nstumble and run screaming into the park as he passes them.  Seemingly\noblivious to the effect he's having, the ghost jogger puts two fingers to\nhis skeletal neck and checks his watch as if taking his pulse.\n\nEXT. CLEARING IN PARK - DAY (SAME TIME)\n\nVenkman is sitting on a park bench near the jogging track reading the\nnewspaper, eating a donut and drinking coffee from a Styrofoam cup.\n\nSTANTZ\n\nHe's sitting on a bench opposite Venkman's, casually watching the jogging\ntrack.\n\nGHOST JOGGER\n\nHe approaches the benches where the Ghostbusters are waiting.  As the\nghost jogger passes the benches, Stantz and Venkman simultaneously hit\nconcealed control buttons.  A ghost trap buried in the track throws up a\nglowing inverted pyramid and catches the ghost jogger in mid-stride.\nStantz and Venkman close the trap and capture the ghost jogger.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (checking his watch)\n\t\t\tYou know he ran that last lap in under six\n\t\t\tminutes?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIf he wasn't dead he'd be an Olympic\n\t\t\tprospect.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  JEWELRY STORE - DAY\n\nThe Ghostbusters come out carrying smoking traps, wearing cheap\ndime-store Santa Claus hats.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to the client)\n\t\t\tMerry Christmas!\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  FIFTH AVENUE - ORREFORS GLASS STORE - DAY\n\nThe Ectomobile is parked at the curb and a curious crowd looks on as the\nGhostbusters enter the store.\n\nINT.  ORREFORS GLASS STORE - CONTINUOUS ACTION\n\nAll the precious crystal is floating in the air, several feet above the\nglass shelves and display tables.  Stantz and Venkman are talking to the\nmanager while Winston and Spengler set up an array of electronic devices\npositioned in each corner of the store.\n\nOn a signal from Stantz, Spengler and Winston switch on the devices which\nthrow laser-type beams around the perimeter of the store.  The manager\nwatches in horror as all the GLASSWARE suddenly drops out of the air,\nSMASHES through the GLASS SHELVES and SHATTERS on the display tables.\nThere is a long pregnant pause.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to the manager)\n\t\t\tSo will that be cash or a check?\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MUSEUM - RESTORATION STUDIO - DAY (LATE AFTERNOON)\n\nEveryone else has gone home.  Dana is cleaning her brushes and putting\nher supplies away.\n\nVIGO PAINTING - CONTINUOUS ACTION\n\nVigo turns his head and watches Dana as she walks past the painting.\n\nDANA\n\nShe stops, vaguely aware of the movement, and looks up curiously at the\npainting.  As she starts to walk on, Vigo looks at her again, but Dana\nturns suddenly and catches the movement.  Frightened now, she hastily\nleaves the studio.\n\nINT.  FIREHOUSE - DAY\n\nLouis is lurking behind a pillar, peeking out at the office area.  We PAN\nDOWN TO the floor and see a foot pedal, then PAN ALONG the cord TO a\nghost trap sitting on Louis's desk.  Hanging from strings over the desk\nare several pieces of Kentucky fried chicken.\n\nWALL\n\nSlimer partially emerges and furtively sniffs the air, then spots the\nchicken bait.  He licks his lips, materializes completely and flies to\nthe chicken.\n\nLOUIS\n\nHis eyes light up and he stomps the foot pedal.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (shouts)\n\t\t\tGotcha!\n\nDESK\n\nThe trap pops open and shoots out a powerful cone of energy.  Slimer\ndodges it and escapes as a big section of the ceiling comes crashing down\non Louis's desk.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (seeing the damage)\n\t\t\tUh-oh.\n\nHe slinks off, defeated.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MANHATTAN MUSEUM OF ART - SECURITY DESK - DAY\n\nThe Ghostbusters commercial is playing on a portable TV on the security\ndesk.  Rudy, the Security Guard, is reading a National Enquirer with a\ngiant front-page headline: GHOSTBUSTERS SAVE JUDGE.  Venkman enters.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'm looking for Dana Barrett.\n\n\t\t\t\t\t\tSECURITY GUARD\n\t\t\tRoom 304 -- Restorations.\n\t\t\t\t (recognizing him)\n\t\t\tHey!  Dr. Venkman -- 'World of the Psychic.'\n\t\t\tI'm a big, big fan.  That used to be one of\n\t\t\tmy two favorite shows.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (flattered)\n\t\t\tThanks.  What's the other one?\n\n\t\t\t\t\t\tSECURITY GUARD\n\t\t\t'Bass Masters.'  It's a fishing show.  Ever\n\t\t\tsee it?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYeah, really great.  Take it easy.\n\nHe exits.\n\nINT.  MUSEUM - RESTORATION STUDIO - DAY (MOMENTS LATER)\n\nDana is working on a valuable Flemish still-life by Ver Meer.  Janosz is\nat the other end of the room, still working on the painting of Vigo.\nVenkman enters and sneaks up behind Dana.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (looking at the Ver Meer)\n\t\t\tSo this is what you do, huh?\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (glad to see him)\n\t\t\tOh, hello, Peter.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou're really good, you know.\n\n\t\t\t\t\t\tDANA\n\t\t\tI didn't paint it.  I'm just cleaning it.\n\t\t\tIt's an original Ver Meer.  It's worth about\n\t\t\tten million dollars.\n\nVIGO\n\nHe turns his head and watches Venkman and Dana.\n\nVENKMAN\n\nUnaware that he's being watched, Venkman squints at the still life,\nholding up his thumb like he's seen artists do.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou know you can go to Art World and get\n\t\t\tthese huge sofa-size paintings for about\n\t\t\tforty-five bucks.\n\nHe starts looking around at the other artwork in the studio.\n\n\t\t\t\t\t\tDANA\n\t\t\tI'm sure you didn't come here just to talk\n\t\t\tabout art.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAs a matter of fact, I stopped by to tell\n\t\t\tyou that I haven't forgotten your problem\n\t\t\tand that we're still on the case.\n\nThey are interrupted by the sudden appearance of Janosz.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (smiling at Venkman)\n\t\t\tDana, aren't you going to introduce me to\n\t\t\tyour friend?\n\n\t\t\t\t\t\tDANA\n\t\t\tOh, I'm sorry.  This is Peter Venkman.\n\t\t\tPeter, Janosz Poha.\n\nVenkman warily shakes his hand, trying to size him up.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (avoiding his gaze)\n\t\t\tPleasure to meet you.  I've seen you on\n\t\t\ttelevision.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHow are you?\n\t\t\t\t (looking over at the Vigo\n\t\t\t\t painting)\n\t\t\tWhat's that you're working on, Johnny?\n\nJanosz winces at the nickname but lets it go.  Venkman and Dana cross to\nthe Vigo painting.  Janosz steps protectively in front of it.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tIt's a painting I'm restoring for the new\n\t\t\tByzantine exhibition.  It's a self-portrait\n\t\t\tof Prince Vigo, the Carpathian.  He ruled\n\t\t\tmost of Carpathia and Moldavia in the 17th\n\t\t\tCentury.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (staring at the painting)\n\t\t\tToo bad for the Moldavians.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (defensive)\n\n\t\t\tHe was a very powerful magician.  A genius\n\t\t\tin many ways and quite a skilled painter.\n\n\t\t\t\t\t\tDANA\n\t\t\tHe was also a lunatic and a genocidal madman.\n\t\t\tI hate this painting.  I've felt very\n\t\t\tuncomfortable since they brought it up from\n\t\t\tstorage.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYeah, it's not the kind of thing you'd want\n\t\t\tto hang in the rec room.  You know what it\n\t\t\tneeds?\n\t\t\t\t (picking up a brush)\n\t\t\tA fluffy little white kitten in the corner.\n\nVenkman reaches toward the painting, but Janosz grabs his hand.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (with forced good will)\n\t\t\tWe don't go around altering valuable\n\t\t\tpaintings, Dr. Venkman.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWell, I'd make an exception in this case if\n\t\t\tI were you.\n\nDana looks disapprovingly at Venkman.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Janosz)\n\t\t\tI'll let you get back to it.  Nice meeting\n\t\t\tyou.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tMy pleasure.\n\nVenkman and Dana cross back to her workspace.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (confidentially)\n\t\t\tI may be wrong, but I think you've got a\n\t\t\tlittle crush on this guy.\n\n\t\t\t\t\t\tDANA\n\t\t\tGood-bye, Peter.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (dragging his feet)\n\t\t\tI'd like to stay, but I really don't have\n\t\t\ttime to hang around here.  I'll call you.\n\t\t\t\t (calls out to Janosz)\n\t\t\tLater, Johnny!\n\nHe exits.\n\nVIGO\n\nVigo turns his head and follows Dana as she returns to her workbench.\n\nDANA\n\nShe stops, vaguely aware of the movement, and looks up curiously at the\npainting.  As she starts to walk on, Vigo looks at her again, but Dana\nturns suddenly and catches the movement.  Frightened now, she hastily\nleaves the studio.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  FIREHOUSE - LIVING QUARTERS - CONTINUOUS ACTION - DAY\n\nVenkman and Winston enter and find Stantz and Spengler at work in the lab\narea.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tOh good, you're here.  Spengler and I have\n\t\t\tsomething really amazing to show you.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Spengler)\n\t\t\tIt's not that thing you do with your\n\t\t\tnostrils, is it?\n\nStantz goes to the refrigerator, opens the freezer, rummages around among\nthe TV dinners and frozen pizza and pulls out a slime specimen in a\nTupperware container.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to Venkman)\n\t\t\tWe've been studying the stuff that we took\n\t\t\tfrom the subway tunnel.\n\nHe pops the specimen jar in the microwave and lets it thaw for a minute.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAnd now you're going to eat it?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNo, I'm just restoring it to its normal state.\n\nHe takes the specimen out of the microwave and pours some of it into a\nlarge Petri dish.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNow watch this.\n\nHe leans over the specimen and starts shouting at it.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (simulating anger)\n\t\t\tYou worthless piece of slime!!\n\t\t\t\t (as the slime starts to\n\t\t\t\t twitch and glow)\n\t\t\tYou ignorant disgusting blob!!\n\nSPECIMEN\n\nIt bubbles and swells, changing color with each insult.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYou foul, obnoxious muck!!\n\nSTANTZ\n\nHe continues venting his rage on the slime.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI've seen some real crud in my time, but\n\t\t\tyou're a chemical disgrace!!\n\nThe specimen doubles its size and starts spilling over the rim of the\nPetri dish.\n\nSTANTZ AND SPENGLER\n\nThey turn to Venkman for his reaction.  He's dumbfounded.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThis is what you do with your spare time?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (very excited)\n\t\t\tThis is an incredible breakthrough, Venkman.\n\t\t\tA psychoreactive substance!  Whatever this\n\t\t\tis, it clearly responds to human emotional\n\t\t\tstates.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t'Mood slime.'  We ought to bottle this stuff\n\t\t\tand sell it.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tWe've found it at every event site we've\n\t\t\tbeen to lately.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (poking at the slime)\n\t\t\tYou mean this stuff actually feeds on 'bad\n\t\t\tvibes'?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tLike a goat on garbage.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWe're running tests to see if we can get an\n\t\t\tequally strong positive reaction.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhat kind of tests?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (a little embarrassed)\n\t\t\tWell, we sing to it, we talk to it, we say\n\t\t\tsupportive, nurturing things --\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou're not sleeping with this stuff, are you?\n\nSpengler reacts as if he might be.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIt really responds to music.\n\t\t\t\t (to Spengler)\n\t\t\tLet's calm it down.\n\nSpengler picks up a guitar and he and Stantz start singing \"Cumbaya\" to\nthe slime specimen.\n\nSPECIMEN\n\nIt stops bubbling and starts to shrink.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tDoes it have any favorites?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIt likes all the sappy stuff: 'Cumbaya,'\n\t\t\t'Everything is Beautiful,' 'It's a Small\n\t\t\tWorld' -- but it loves Jackie Wilson.\n\nVenkman and Winston watch intently as Spengler spoons some of the\npsych-reactive slime onto an old toaster.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWatch this.\n\nStantz turns on a CASSETTE PLAYER and Jackie Wilson's \"HIGHER AND HIGHER\"\nBLASTS from the speakers.\n\nTOASTER\n\nIt shakes, spins and actually starts moving in time with the MUSIC.\n\nVENKMAN\n\nHe stares in disbelief at the dancing toaster as it shoots two pieces of\ntoast into the air and catches them without missing a beat.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI don't care what you say.  This could be a\n\t\t\tmajor Christmas gift item.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tRight, and the first time someone gets mad,\n\t\t\ttheir toaster will eat their hand.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSo we'll put a warning on the label.\n\nStantz turns OFF the MUSIC and the toaster stops moving.  Venkman looks\nat the toaster and sticks his fingers in the slot.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to the toaster)\n\t\t\tGo ahead.  I dare you.\n\nSuddenly, he yelps as if the toaster has actually bitten into his hand\nand won't let go.  The others jump in to help him, but Venkman laughs and\neasily withdraws his hand.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tJust kidding.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  DANA'S APARTMENT - NIGHT\n\nDana brings Oscar into the bathroom and lays him on the bassinet.  She's\nwearing a robe over her nightgown, preparing to bathe the baby.  She\nturns the taps on the old claw-footed bathtub, checks the water\ntemperature, then turns away and starts to undress the baby.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (talking sweetly to the\n\t\t\t\t baby)\n\t\t\tLook at you.  I think we got more food on\n\t\t\tyour shirt than we got in your mouth.\n\nBATHTUB\n\nThe water pouring from the faucet changes to slime and settles at the\nbottom of the tub.  Dana reaches over and turns off the water without\nlooking into the tub.  When she turns away, both taps start to spin by\nthemselves and the tub flexes and bulges.\n\nDANA\n\nStill unaware, she routinely reaches over and squirts some bubble bath\ninto the tub.\n\nBATHTUB\n\nThe rim of the tub puckers up and the sides convulse as if swallowing the\nbubble bath.\n\nDANA\nShe picks the baby up off the bassinet and turns to place him in the tub.\nShe is just about to lower him into the water when the tub starts to\nclose up around the baby like a hugh mouth.  Dana screams, snatches the\nbaby away and runs from the room clutching Oscar to her bosom as the\nbathtub convulses and vomits up buckets of slime.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  VENKMAN'S LOFT - SAME NIGHT (LATER)\n\nThe big open loft space is a chaotic clutter of mismatched furniture, old\nmagazines, books, tapes, and sports equipment.  Venkman is asleep on the\nfloor, still wearing his coat, scarf, hat and gloves, having collapsed\njust short of the bedroom.  The DOORBELL RINGS, he wakes up, lumbers to\nhis feet and answers it.  He opens the door and sees Dana standing there.\nShe is wearing only a nightgown under her coat and Oscar is naked,\nwrapped in a baby blanket.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (somewhat embarrassed to\n\t\t\t\t be there)\n\t\t\tI'm sorry.  Were you on your way out?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (surprised to see her)\n\t\t\tNo, I just got in -- a couple hours ago.\n\t\t\tCome on in.\n\t\t\t\t (noting her apparel)\n\t\t\tAre we having a pajama party?\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (upset)\n\t\t\tPeter, the bathtub tried to eat Oscar.\n\nVenkman looks at her for a long moment.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou know, if anyone else told me that, I'd\n\t\t\thave serious doubts.  But coming from you,\n\t\t\tI can't honestly say I'm surprised.\n\n\t\t\t\t\t\tDANA\n\t\t\tI must be losing my mind.  At the museum\n\t\t\ttoday I could have sworn that terrible\n\t\t\tpainting of Vigo looked right at me.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWho could blame him?  Were you wearing this\n\t\t\tnightgown?\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (distraught)\n\t\t\tI don't know what to do anymore.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'll get Ray and Egon to check out the\n\t\t\tbathtub.  You better stay here.\n\nHe exits to the bathroom.  She looks around the loft, amazed at the\ndisorder.  Venkman comes back immediately with an old sweatshirt and\ntakes Oscar from her.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNow this kid has a serious nudity problem.\n\nHe spreads the sweatshirt out on the sofa, lays the baby on it and starts\ntying it around him like a diaper.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to the baby)\n\t\t\tThis is Joe Namath's old number, you know.\n\t\t\tYou could get a lot of chicks with this.\n\t\t\tJust don't pee in it.\n\n\t\t\t\t\t\tDANA\n\t\t\tPeter, what about the bathtub?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (grabs the phone and dials)\n\t\t\tWe'll take care of that.\n\t\t\t\t (on the phone)\n\t\t\tRay, Pete.  Listen, get over to Dana's right\n\t\t\taway ... Her bathtub pulled a fast one --\n\t\t\ttried to eat the kid.\n\n\t\t\t\t\t\tDANA\n\t\t\tIt was full of this awful pink ooze.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Ray)\n\t\t\tSounds like another slime job ... No,\n\t\t\tthey're all right.  They're here now ...\n\t\t\tRight ... Let me know.\n\nHe hangs up.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThey're going over there right now.  You\n\t\t\tmight as well make yourself at home.  Let\n\t\t\tme show you around.\n\t\t\t\t (he crosses to the kitchen area)\n\t\t\tThis is the cuisine de maison --\n\nIt's an incredible mess. The sink is piled high with dirty dishes and the\ncounters are littered with all sorts of food trash.  He grabs a big open\nHefty bag on the floor and starts throwing garbage into it.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (looking at the sink)\n\t\t\tWe may have to wash some of these if you get\n\t\t\thungry --\n\t\t\t\t (he looks in the fridge)\n\t\t\t-- but there's no food anyway so forget\n\t\t\tabout it.  I have all kinds of carry-out\n\t\t\tmenus if you feel like ordering.\n\nHe opens a drawer full of pizza, barbecue and Chinese food menus, then\ncrosses to the bathroom.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tBathroom's right here -- let me just tidy\n\t\t\tup a few things.\n\n\t\t\t\t\t\tDANA\n\t\t\tPeter, this is very nice, but you don't have\n\t\t\tto do any of this, you know.\n\nHe goes into the bathroom and we hear WATER RUNNING, the TOILET FLUSHING\nand more items going into the Hefty bag.\n\n\t\t\t\t\t\tVENKMAN (O.S.)\n\t\t\tThe shower works but it's a little tricky.\n\t\t\tThey're both marked \"Hot.\"  It takes a little\n\t\t\tpractice, but at least this one won't try\n\t\t\tand eat you.\n\nHe comes out of the bathroom with the now-loaded Hefty bag over his\nshoulder.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tBe careful on that sofa -- it's a butt-biter.\n\t\t\tBut the bed's good and I just changed the\n\t\t\tsheets so if you get tired, feel free.  In\n\t\t\tfact, I think you should definitely plan on\n\t\t\tspending the night here.\n\n\t\t\t\t\t\tDANA\n\t\t\tReally?  And how would we handle the sleeping\n\t\t\tarrangements?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tFor me it's best if I sleep on my side and\n\t\t\tyou spoon up right behind me with your arms\n\t\t\taround me.  If we go the other way I'm\n\t\t\tafraid your hair will be getting in my face\n\t\t\tall night.\n\n\t\t\t\t\t\tDANA\n\t\t\tHow about you on the sofa and me in bed with\n\t\t\tthe baby.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOr we could do that.\n\n\t\t\t\t\t\tDANA\n\t\t\tThank you.\n\t\t\t\t (she picks up Oscar)\n\t\t\tPoor baby.  I think I should put him down\n\t\t\tnow.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'll put him down for you.\n\t\t\t\t (taking the baby)\n\t\t\tYou are way too short!  And your belly-button\n\t\t\tsticks out!  You're nothing but a burden to\n\t\t\tyour poor mother!\n\nVenkman carries the baby into the bedroom leaving Dana in the living\nroom, feeling more relaxed and a lot safer.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  MUSEUM - DAY (NEXT MORNING)\n\nVenkman is waiting in front of the building as ECTO-2 pulls up and\nStantz, Spengler and Winston get out and report on Dana's apartment.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDid you find anything at Dana's?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNothing.  Just some mood-slime residue in\n\t\t\tand around the bathtub.  But we did turn up\n\t\t\tsome interesting stuff on this Vigo character\n\t\t\tyou mentioned.  I found the name Vigo the\n\t\t\tCarpathian in Leon Zundinger's Magicians,\n\t\t\tMartyrs and Madmen.  Listen to this:\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (reads from xerox of entry)\n\t\t\t\"Vigo the Carpathian, born 1505, died 1610 --\"\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tA hundred and five years?  He really hung\n\t\t\ton, didn't he.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tAnd he didn't die of old age either.  He was\n\t\t\tpoisoned, stabbed, shot, hung, stretched,\n\t\t\tdisemboweled, drawn and quartered.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tI guess he wasn't too popular at the end\n\t\t\tthere.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tNo, not exactly a man of the people.\n\t\t\t\t (reads)\n\t\t\t\"Also known as Vigo the Cruel, Vigo the\n\t\t\tTorturer, Vigo the Despised, and Vigo the\n\t\t\tUnholy.\"\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThis guy was a bad monkey.  He dabbled in\n\t\t\tall the Black Arts, and listen to this\n\t\t\tprophecy.  Just before his head died, his\n\t\t\tlast words were, \"Death is but a door, time\n\t\t\tis but a window.  I'll be back.\"\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThat's it?  \"I'll be back?\"\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tIt's a rough translation from the Moldavian.\n\nThey enter the museum carrying their monitoring equipment.\n\nINT.  MUSEUM - SECURITY DESK - DAY (CONTINUOUS ACTION)\n\nRudy the guard looks up in surprise as the Ghostbusters enter.\n\n\t\t\t\t\t\tRUDY\n\t\t\tHey, Dr. Venkman.  What's going on?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWe're just going up to Restorations for a\n\t\t\tminute.\n\n\t\t\t\t\t\tRUDY\n\t\t\tOh, I can't let you do that.  Mr. Poha told\n\t\t\tme not to let you up there anymore.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (with mock seriousness)\n\t\t\tOkay, we were trying to keep this quiet but\n\t\t\tI think you can be trusted.  Tell him, Ray.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (very official)\n\t\t\tMister, you have an Ecto-paritic,\n\t\t\tsubfusionary flux in this building.\n\n\t\t\t\t\t\tRUDY\n\t\t\tWe got a flux?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tYou got a flux and a half.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNow if you don't want to be the --\n\t\t\t\t (he counts)\n\t\t\t-- fifth person ever to die in meta-shock\n\t\t\tfrom a planar rift, I suggest you get down\n\t\t\tbehind that desk and don't move until we\n\t\t\tgive you the signal \"Stabilize -- All Clear.\"\n\nRudy gulps and starts to hunker down behind the desk as the Ghostbusters\nhead upstairs.\n\nINT.  MUSEUM - RESTORATION STUDIO - DAY (MOMENTS LATER)\n\nJanosz is working on the Vigo painting when the Ghostbusters enter.  He\nrushes over and stops them at the door.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tDr. Venkman?  Dana is not here.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI know.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tThen why have you come?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWe got a major creep alert and we're just\n\t\t\tgoing down the list.  Your name was first.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to Spengler and Winston)\n\t\t\tLet's sweep it, boys.\n\nThey deploy and start scanning the studio with their monitoring devices.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Janosz)\n\t\t\tYou know, I never got to ask you.  Where you\n\t\t\tfrom, Johnny?\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (nervous)\n\t\t\tThe Upper West Side.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (consulting his PKE meter)\n\t\t\tThis entire room is extremely hot, Peter.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tWhat exactly are you looking for, Dr. Venkman?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWe'll know when we find it.  You just sit\n\t\t\ttight.  This won't take long.\n\nSTANTZ\n\nUsing the Giga-meter, he traces a strong psychomagnetheric reading to\nthe painting of Vigo in the alcove at the end of the studio.  Venkman\ncomes up behind him with Janosz right on his heels.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThis is the one that looked at Dana.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tIt must be the chemical fumes in the studio.\n\t\t\tPeople start imagining things --\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (interrupts)\n\t\t\tI'm going to rule out the glue-sniffing\n\t\t\ttheory.  If she says it looked at her, it\n\t\t\tlooked at her.\n\t\t\t\t (to Vigo)\n\t\t\tHey, you!  Vigie!  Look at me.  I'm talking\n\t\t\tto you.  Hey!  Look at me when I'm talking\n\t\t\tto you.\n\nThey watch the painting for any sign of movement.\n\nVIGO\n\nHis eyes stare lifelessly into the distance.\n\nSTANTZ AND VENKMAN\n\nVenkman starts shooting Polaroids of Vigo.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Vigo)\n\t\t\tBeautiful, beautiful.  Work with me, baby.\n\t\t\tJust have fun with it.\n\t\t\t\t (to Stantz)\n\t\t\tOkay, he's playing it cool.  Let's finish\n\t\t\tup and get out of here.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI'll get one more reading.\n\nVenkman walks off leaving Stantz alone with the painting.  Stantz scans\nthe painting with the Giga-meter until his eyes meet Vigo's.\n\nVIGO\n\nHis eyes seems to burn right through to the depths of Stantz's soul.\n\nSTANTZ\n\nHe stands there transfixed, unable to look away, as a strange and subtle\ntransformation occurs within him.  Winston comes up behind him and breaks\nthe spell.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (looking at the painting)\n\t\t\tNow that's one ugly dude.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (coming back to his senses)\n\t\t\tHuh?  What?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tYou finished here?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (distracted)\n\t\t\tWhat?  Yeah.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tAre you all right?  You coming down with\n\t\t\tsomething?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNo, I'm fine.  I just got light-headed for\n\t\t\ta second there.  Let's go.\n\nThey head for the door.\n\nJANOSZ\n\nHe escorts the Ghostbusters to the door.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tSo you see, everything is in order, is it\n\t\t\tnot?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNot.  Don't leave town and report any change\n\t\t\tin your address to the proper authorities.\n\t\t\tWe'll be back.\n\nThey exit.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  MUSEUM - DAY (LATER)\n\nThe Ghostbusters cross to ECTO-2.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tThere's definitely something going on in\n\t\t\tthat studio.  The PKE levels were max-plus\n\t\t\tand the Giga-meter was showing all red.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tI'd put my money on that Vigo character.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYeah, that's a safe bet.\n\t\t\t\t (to Stantz)\n\t\t\tYou and Spengman see what else you can dig\n\t\t\tup on Vigo and this little weasel Poha.\n\t\t\tThose two were made for each other.\n\nINT.  ECTO-2 - DAY (LATER)\n\nThe Ghostbusters are driving back to the firehouse.  Stantz is at the\nwheel.  His eyes are vacant, he seems distracted and very tense.  Stantz\nswerves suddenly and HONKS the horn angrily.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to another driver)\n\t\t\tIdiot!\n\t\t\t\t (honking)\n\t\t\tMove it, you jerk!\n\nVenkman and Winston exchange surprised looks.\n\nEXT.  STREET - DAY (CONTINUOUS ACTION)\n\nStantz drives extremely fast, HONKING vindictively, weaving dangerously\nthrough traffic.\n\nINT.  ECTO-2 - DAY (CONTINUOUS ACTION)\n\nWinston looks at Ray, concerned.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tGoing a little fast, aren't we, Ray?\n\nStantz turns on him.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (viciously)\n\t\t\tAre you telling me how to drive?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tNo, I just thought --\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWell don't think!\n\nHe HONKS again and tromps hard on the accelerator.\n\nEXT.  STREET - DAY (CONTINUOUS)\n\nEcto-2 is now barreling down the avenue.  Pedestrians leap to safety as\nStantz runs a red light.\n\nINT.  ECTO-2 - DAY (CONTINUOUS ACTION)\n\nThey hang on to the safety straps as Stantz continues his maniacal ride.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (to Stantz, really worried\n\t\t\t\t now)\n\t\t\tAre you crazy, man?  You're going to kill\n\t\t\tsomebody!\n\nStantz looks at him and smile demonically.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNo, I'm going to kill everybody!\n\nHe swerves off the road.\n\nEXT.  ECTO-2 - DAY (CONTINUOUS ACTION)\n\nThe car heads right for a big tree.\n\nINT.  ECTO-2 - DAY (CONTINUOUS ACTION)\n\nAt the last possible moment, Winston cold-cocks Stantz, grabs the wheel\nand steps across to stomp on the brakes.\n\nEXT.  ECTO-2 - DAY (CONTINUOUS ACTION)\n\nThe car skids into the tree and stops.  The Ghostbusters stumble out\ndazed and shaken, but unhurt.  Stantz rubs his eyes and looks at the\nothers, completely at a loss.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (himself again)\n\t\t\tWhat happened?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYou just picked up three penalty points on\n\t\t\tyour driver's license.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tAre you all right?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYeah, I guess so.  It was the strangest\n\t\t\tthing.  I knew what I was doing but I\n\t\t\tcouldn't stop.  This really terrible feeling\n\t\t\tcame over me and -- I don't know -- I just\n\t\t\tfelt like driving into that tree and ending\n\t\t\tit all.  Whew!  Sorry, boys.\n\nThey inspect the damage to the car.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (confidentially, to\n\t\t\t\t Spengler)\n\t\t\tWatch him, Egon.  Don't even let him shave.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  VENKMAN'S LOFT - DAY (LATER)\n\nThere's a KNOCK at the front door, a key turns in the lock, and Venkman\nenters somewhat tentatively holding a bouquet of flowers and a small\nsuitcase of Dana's.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (calls out)\n\t\t\tI'm home!\n\nHe looks around the large open loft.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to himself)\n\t\t\tI knew it.  She cleaned.\n\nHe hears the SHOWER RUNNING and crosses to the bathroom.  The door is\nhalf-open and he can see Dana in the shower (tastefully blurred) through\nthe transparent vinyl curtain.  He closes the bathroom door and looks at\nthe baby asleep on the bed, surrounded by pillows to prevent him rolling\noff.  Then he turns and bumps into Dana who's just coming out of the\nbathroom wrapped in a towel.  She jumps back into the bathroom.\n\nShe comes out again, this time wearing a robe.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAre you all squeaky clean now?\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (humoring him)\n\t\t\tYes, I'm very clean.  Did they find anything\n\t\t\tat my apartment?\n\nShe squeezes past him into the bedroom and closes the door.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (through the door)\n\t\t\tNothing.  They stayed there all night, went\n\t\t\tthrough your personal stuff, made a bunch of\n\t\t\tlong-distance phone calls and cleaned out\n\t\t\tyour refrigerator.  And didn't find anything.\n\nDana opens the bedroom door.\n\n\t\t\t\t\t\tDANA\n\t\t\tThey didn't find anything?  In the bathtub\n\t\t\t... the pink ooze ... nothing?  So, what do\n\t\t\tI do now?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNow you get dressed and we go out.  I got a\n\t\t\tbabysitter and everything.  Trust me, you\n\t\t\tneed it.\n\n\t\t\t\t\t\tDANA\n\t\t\tI'm not here to date.  I can't leave Oscar\n\t\t\tin a strange place with someone I don't know.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tIt's Janine Melnitz, from my staff.  She's\n\t\t\tone of my most valuable employees.\n\n\t\t\t\t\t\tDANA\n\t\t\tDoes she know anything about babies?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tJanine Melnitz, are you kidding?\n\t\t\t\t (handing her the flowers)\n\t\t\tDo I have a vase?  I brought some of your\n\t\t\tclothes.  Wear something intriguing.  I\n\t\t\tbrought along some interesting possibilities.\n\n\t\t\t\t\t\tDANA\n\t\t\tOkay, but it's not a date.  It's a dinner.\n\nShe smiles and closes the door again.  He opens the closet and starts\nlooking for his good suit.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDid you happen to see some shirts on the\n\t\t\tfloor in here?\n\n\t\t\t\t\t\tDANA (O.S.)\n\t\t\tI put them in your hamper.  I thought they\n\t\t\twere dirty.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (shaking his head)\n\t\t\tI have a hamper?  Next time ask me first,\n\t\t\tokay.  I have more than two grades of\n\t\t\tlaundry.  There're lots of subtle levels\n\t\t\tbetween clean and dirty.\n\nHe pulls some clothes out of the hamper and inspects them.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThese aren't so bad yet.  You just hang them\n\t\t\tup for a while and they're fine.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\nINT.  FIREHOUSE - RECEPTION AREA - EARLY EVENING\n\nJanine covers her computer terminal and starts turning out the lights.\nThen she notices that the lights are still on upstairs.  She starts\nprimping and freshening up her makeup.\n\nINT.  FIREHOUSE - LAB AREA - SAME TIME\n\nLouis is strapping on a proton pack, preparing to deal with Slimer once\nand for all.  He's wearing a bicyclist's rearview mirror on a headband.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (to himself)\n\t\t\tOkay, Stinky, this is it.  Showdown time.\n\t\t\tYou and me, pal.  You think you're smarter\n\t\t\tthan I am?  We'll see about that.\n\t\t\t\t (loud)\n\t\t\tOh, hello, Pizza Man!  Oh, two larges!  I\n\t\t\tonly ordered one.  Oh, pepperoni and\n\t\t\tpineapple.  My absolute favorite.  I guess\n\t\t\tI'll have to eat these both by myself.\n\nTHE CEILING\n\nSlimer pokes his head through the ceiling and scans the room hanging\nupside down.\n\nLOUIS\n\nHe spots Slimer through the rearview mirror.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (quietly)\n\t\t\tOkay, let's boogie!\n\nHe whirls around and fires a proton stream at Slimer, slicing a burning a\ngash across the ceiling.\n\nTHE STAIRS\n\nJanine comes up and ducks as a bolt of energy streaks across the room and\nstrikes the wall behind her.  Slimer disappears.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (embarrassed and apologetic)\n\t\t\tOh migod!  I'm sorry.  I didn't mean to do\n\t\t\tthat.  It was an accident.\n\n\t\t\t\t\t\tJANINE\n\t\t\tWhat are you doing up here?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tI was trying to get that smelly green thing.\n\t\t\tThe guys asked me to help out.  I'm like the\n\t\t\tfifth Ghostbuster.\n\n\t\t\t\t\t\tJANINE\n\t\t\tWhy would you want to be a Ghostbuster if\n\t\t\tyou're already an accountant?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOh, no, it's just if one of the guys calls\n\t\t\tin sick or gets hurt.\n\nLouis quickly slips off the proton pack and sets it down.\n\n\t\t\t\t\t\tJANINE\n\t\t\tHave you made any plans yet?  You know\n\t\t\ttomorrow is New Year's Eve.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tNo, I celebrate at the beginning of my\n\t\t\tcorporate tax year which is March first.\n\t\t\tThat way I beat the crowds.\n\n\t\t\t\t\t\tJANINE\n\t\t\tThat's very practical.  I hate going out on\n\t\t\tNew Year's Eve, too.\n\nThere is an awkward silence between them and Janine starts to leave.\n\n\t\t\t\t\t\tJANINE\n\t\t\tWell, good night, Louis.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (on an impulse)\n\t\t\tJanine, do you feel like maybe getting\n\t\t\tsomething to eat on the way home?\n\n\t\t\t\t\t\tJANINE\n\t\t\tI'd like to, but I told Dr. Venkman I'd\n\t\t\tbabysit.\n\t\t\t\t (seductively)\n\t\t\tDo you want to babysit with me?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOh, sure, that sounds great.\n\nThey exit.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  VENKMAN'S LOFT - NIGHT (LATER)\n\nThere is a KNOCK at the door and Venkman goes to answer it.  He's dressed\nfor the evening and looking very dapper.\n\nINT.  VENKMAN'S LOFT - ENTRANCE HALL - CONTINUOUS ACTION\n\nVenkman opens the door and finds Stantz, Spengler and Winston standing\nthere wearing over-the-hip rubberized waders, firemen's slickers, and\nminers' helmets, carrying tons of sensing devices, meters, collection\njars and photographic equipment.  They look like they're rigged out for a\nmajor spelunking expedition.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (ushering them in)\n\t\t\tDon't tell me, let me guess.  All-you-can-eat\n\t\t\tbarbecue rib night at the Sizzler?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWe're going down into the sewer system to\n\t\t\tsee if we can trace the source of the\n\t\t\tpsycho-reactive slime flow.  We thought you\n\t\t\tmight want to come along.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDarn it!  I wish I'd known you were going.\n\t\t\tI'm stuck with these damn dinner reservations.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tYou know, animals and lower life forms often\n\t\t\tanticipate major disasters.  Given the new\n\t\t\tmagnetheric readings we could see a tremendous\n\t\t\tbreeding surge in the cockroach population.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tRoach breeding?  Sounds better and better.\n\t\t\t\t (calls out)\n\t\t\tDana?  The boys are going down under the\n\t\t\tsewers tonight to look for slime.  Egon\n\t\t\tthinks there might even be some kind of big\n\t\t\troach-breeding surge.  Should we forget about\n\t\t\tdinner and go with them instead?\n\nDana steps into the living room looking very beautiful.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWow.\n\nDana looks curiously at their outfits.\n\n\t\t\t\t\t\tDANA\n\t\t\tHi.\n\nThey nod and wave back.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Ray and Egon)\n\t\t\tI think we're going to have to pass on the\n\t\t\tsewer trip, boys.  Let me know what you find\n\t\t\tout.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (on his exit)\n\t\t\tOkay, but you're missing all the fun.\n\nINT.  VAN HORNE STATION - NIGHT (LATER)\n\nStantz, Spengler and Winston come down the stairs into the station,\nguided by a very old map of the underground city.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThis is it.  Van Horne Station.  Right where\n\t\t\tthe old transit map said it would be.\n\nThey cross to the edge of the platform and look into the river of slime.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tLet's get a sounding on the depth of that\n\t\t\tflow.\n\nStantz has a long, coiled, graduated cord with a plumb bob on the end of\nit attached to his utility belt.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tStand back.\n\nHe takes the cord in his hand, swings the plumb bob over his head and\ncasts it out into the middle of the flow.  The plumb bob sinks and\nSpengler reads the depth.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tSix feet -- seven -- eight --\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThat's it.  It's on the bottom.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tNine feet -- ten --\n\n\t\t\t\t\t\tWINSTON\n\t\t\tIs the line sinking?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tNo, the slime is rising.\n\nStantz looks down and notices the slime rising over the edge of the\nplatform and around his boots.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (alarmed)\n\t\t\tLet's get out of here, boys.\n\nHe starts to pull out the plumb line but it seems to be stuck.\n\nSpengler tries to help, but whatever is pulling on the cord is stronger\nthan all three of them.  As their unseen adversary pulls them closer and\ncloser to the edge, Stantz works desperately to unhook the cord from his\nbelt but finally just unhooks the whole belt.  Spengler lets go in time\nbut Winston doesn't.  He is jerked off his feet and into the slime flow.\nStantz and Spengler look at each other, summon their courage and jump in\nafter him.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  ARMAND RESTAURANT - NIGHT (LATER)\n\nDana and Venkman are sitting at a table in an elegant restaurant nibbling\ncaviar and toasting with very expensive champagne.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (very intimate)\n\t\t\tHere's to -- us.\n\nShe sighs and drinks.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSo -- are you making any New Year's\n\t\t\tresolutions?\n\n\t\t\t\t\t\tDANA\n\t\t\tI want to stop getting involved with men who\n\t\t\taren't good for me.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDoes that start exactly at midnight tomorrow,\n\t\t\tor could you hold off for a few days maybe?\n\n\t\t\t\t\t\tDANA\n\t\t\tFor one night in your life, do you think\n\t\t\tit's possible for us to be completely real?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAll right, you want to be real?  So tell me\n\t\t\twhy did you dump me?\n\n\t\t\t\t\t\tDANA\n\t\t\tOh, Peter, I didn't dump you.  I just had\n\t\t\tto protect myself.  You really weren't very\n\t\t\tgood for me, you know.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI'm not even good for me.\n\n\t\t\t\t\t\tDANA\n\t\t\tWhy do you say things like that?  You're so\n\t\t\tmuch better than you know.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThank you.  If I had that kind of support\n\t\t\ton a daily basis, I could definitely shape\n\t\t\tup by the turn of the century.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (already feeling the\n\t\t\t\t effects of the champagne)\n\t\t\tSo why don't you give me a jingle in the\n\t\t\tyear 2000?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tLet me jingle you right now.\n\nHe leans over to kiss her.\n\n\t\t\t\t\t\tDANA\n\t\t\tMaybe I should call Janine.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDon't worry.  Janine has a very special way\n\t\t\twith children.\n\nThey kiss.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  APARTMENT - NIGHT (SAME TIME)\n\nJanine is on the sofa doing her nails while Louis paces with the baby.\n\n\t\t\t\t\t\tJANINE\n\t\t\t\t (looking around)\n\t\t\tI can't believe a person could actually live\n\t\t\tlike this.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (to the baby)\n\t\t\tSo these dwarfs had a limited partnership in\n\t\t\ta small mining operation and then one day a\n\t\t\tbeautiful princess came to live with them.\n\n\t\t\t\t\t\tJANINE\n\t\t\tIt's really not a bad place.  It just needs\n\t\t\ta woman's touch.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (continuing)\n\t\t\tSo they bartered room and board in exchange\n\t\t\tfor housekeeping services, which was a good\n\t\t\tdeal for all of them because then they didn't\n\t\t\thave to withhold tax and social security,\n\t\t\twhich I'm not saying is right but it's just\n\t\t\ta story, so I guess it's all right.  I can\n\t\t\tfinish this later if you're tired.\n\nLouis goes into the bedroom and puts the baby down.\n\n\t\t\t\t\t\tJANINE\n\t\t\tYou're really good with children, Louis.  I\n\t\t\tcan tell.\n\t\t\t\t (as he returns)\n\t\t\tWhy don't you come here and sit with me?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOkay.\n\nHe sits stiffly beside her on the sofa.\n\n\t\t\t\t\t\tJANINE\n\t\t\t\t (getting close)\n\t\t\tMotherhood is a very natural instinct for\n\t\t\tme.  I'd like to have a baby myself.\n\t\t\tWouldn't you?\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (gulps)\n\t\t\tTonight?\n\nEXT.  STREET - MANHOLE COVER - NIGHT (SAME TIME)\n\nA manhole cover is dislodged and pushed up from below.  It slides away,\nand Winston crawls out of the manhole followed by Stantz and Spengler.\nThey are exhausted and covered with slime.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (uncharacteristically\n\t\t\t\t angry)\n\t\t\tNice going, Ray!  What were you trying to\n\t\t\tdo -- drown me?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (unusually mean)\n\t\t\tLook, Zeddemore, it wasn't my fault you were\n\t\t\ttoo stupid to drop that line.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (shoves him)\n\t\t\tYou better watch your mouth, man, or I'll\n\t\t\tpunch your lights out.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tOh yeah?  Anytime, anytime.  Just go ahead\n\t\t\tand try it.\n\nSpengler steps between them with unprecedented aggression.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tIf you two are looking for a fight, you got\n\t\t\tone.\n\t\t\t\t (putting up his fists)\n\t\t\tWho wants it first?  Come on, Ray.  Try me,\n\t\t\tsucker.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (squaring off)\n\t\t\tButt out, you pencil-necked geek.  I've had\n\t\t\tit with you.\n\nThey grab each other and start to tussle.  Suddenly Spengler comes to his\nsenses and pulls them apart.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (forcefully)\n\t\t\tStrip!  Right now!  Get out of those clothes!\n\nHe starts yanking off his slicker and waders.  Bewildered, Stantz and\nWinston start doing the same.  Spengler helps pull off their clothes and\nthrows them into the open manhole.  Now wearing only long underwear, they\nseem to return to normal.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tWhat are we doing?  Ray, I was ready to kill\n\t\t\tyou.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tDon't you see?  It's the slime.  That stuff\n\t\t\tis like pure, concentrated evil.\n\nStantz looks around and sees that they are standing right in front of the\nmuseum.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tAnd it's all flowing right to this spot.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  ARMAND RESTAURANT ENTRANCE - NIGHT (CONTINUOUS ACTION)\n\nThe MAITRE D' looks up in surprise as Stantz, Spengler and Winston enter\nthe restaurant wearing only long underwear.\n\n\t\t\t\t\t\tMAITRE D'\n\t\t\t\t (intercepting them)\n\t\t\tCan I help you?\n\nStantz looks around and spots Venkman.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThat's all right, I see him.\n\nThey blow right by the Maitre d' who jumps back in horror as they pass.\n\nVENKMAN\n\nHe's just about to pour more champagne when he sees Ray, Egon and Winston\ncoming toward him through the restaurant.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (very excited)\n\t\t\tYou should've been there, Venkman.\n\t\t\tAbsolutely incredible!\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYeah, sorry I missed it.\n\t\t\t\t (noting their attire)\n\t\t\tI guess you guys didn't know about the dress\n\t\t\tcode here.  It's really kind of a coat and\n\t\t\ttie place.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIt's all over the city, Pete -- well, under\n\t\t\tit actually.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tRivers of the stuff!\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tAnd it's all flowing toward the museum.\n\nHe gestures excitedly and a big gob of slime flies across the room and\nlands on a well-dressed diner.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (calls out)\n\t\t\tSorry!\n\n\t\t\t\t\t\tDANA\n\t\t\tMaybe we should discuss this somewhere else.\n\nVenkman notes the look of alarm on Dana's face and pulls his colleagues\naside.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (confidentially)\n\t\t\tBoys, listen.  You're scaring the straights.\n\t\t\tLet's save this until tomorrow, okay?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to Venkman)\n\t\t\tThis won't wait until tomorrow, Venkman.\n\t\t\tIt's hot and it's ready to pop.\n\nMAITRE D'\n\nHe hurries through the restaurant with two city COPS right behind him and\nmakes straight for Venkman's table.\n\n\t\t\t\t\t\tMAITRE D'\n\t\t\tArrest these men.\n\n\t\t\t\t\t\tCOP\n\t\t\t\t (recognizing them)\n\t\t\tHey!  It's the Ghostbusters.  You're out of\n\t\t\tuniform, gentlemen\n\nStantz suddenly realizes how ridiculous they look.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (self-conscious)\n\t\t\tUh -- well -- we had a little accident, but\n\t\t\tforget that.  We have to see the mayor as\n\t\t\tsoon as possible.\n\n\t\t\t\t\t\tCOP\n\t\t\tLook, Doc, why don't you just go home.\n\t\t\tYou'll get a good night's sleep and then you\n\t\t\tcan give the mayor a call in the morning.\n\t\t\tCome on.\n\nHe takes Stantz by the arm but Stantz resists.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWe're not going anywhere with you.  I told\n\t\t\tyou we have to see the mayor now.\n\n\t\t\t\t\t\tCOP\n\t\t\t\t (grabbing Stantz)\n\t\t\tI'm warning you.  You can come along\n\t\t\tpeaceably or --\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (grabs the Cop)\n\t\t\tHey, don't be an idiot.  This is serious.\n\n\t\t\t\t\t\tCOP\n\t\t\t\t (angry)\n\t\t\tLook, pal, keep this up and you're going\n\t\t\twith them.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOh, yeah?\n\n\t\t\t\t\t\tCOP\n\t\t\t\t (has had enough)\n\t\t\tYeah, let's go.  You're all under arrest.\n\nThe Cop catches Venkman in an armlock and starts walking him out of the\nrestaurant.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Dana)\n\t\t\tFinish your dessert -- it's already paid\n\t\t\tfor.  I'll call you.\n\nThey all exit, causing a major commotion among the other diners.\n\nEXT.  ARMAND'S RESTAURANT - NIGHT (CONTINUOUS ACTION)\n\nThe police car is parked right behind Ecto-2.  Spengler stops at the\npolice car and confronts the cops.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tLook, we're not drunk and we're not crazy.\n\t\t\tThis is a matter of vital importance.\n\nVenkman steps in and looks at the policemen's nametags.\n\n\t\t\t\t\t\tCOP\n\t\t\tWhat are you doing?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI just want to get your names right for when\n\t\t\tthe mayor asks us why we didn't let him know\n\t\t\tabout this sooner.\n\nThe Cops look at each other, uncertain about what to do.\n\n\t\t\t\t\t\tCOP\n\t\t\t\t (relenting)\n\t\t\tOkay, Doc.  You want to see the mayor, you\n\t\t\tgot it.  Follow us.\n\nThey head for their respective vehicles.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  VENKMAN'S LOFT - NIGHT (SAME TIME)\n\nLouis and Janine are on the sofa making out when Dana enters.  They jump\nup and start smoothing their clothes.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (embarrassed)\n\t\t\tOh, hello, Dana.  we were just -- we were --\n\n\t\t\t\t\t\tDANA\n\t\t\tI know what you were doing, Louis.  It's\n\t\t\tall right.\n\n\t\t\t\t\t\tJANINE\n\t\t\tHow was your date?\n\n\t\t\t\t\t\tDANA\n\t\t\tTypical.  Peter was arrested.  Has he called?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tNo, nobody called.\n\nDana frowns.\n\n\t\t\t\t\t\tDANA\n\t\t\tIs everything all right with Oscar?\n\n\t\t\t\t\t\tJANINE\n\t\t\tOh, he's fine.  He's such a good baby.  He\n\t\t\twas a little fussy at first, but we gave\n\t\t\thim a Freach bread pizza and he went right\n\t\t\tto sleep.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (relieved)\n\t\t\tOh, good.  I'll just check on him.\n\nShe crosses to the bedroom.\n\nINT.  VENKMAN'S BEDROOM - NIGHT (CONTINUOUS ACTION)\n\nDana looks at Oscar sleeping peacefully on the bed.  She starts to change\nclothes.\n\nINT.  VENKMAN'S LIVING ROOM - NIGHT (SAME TIME)\n\nLouis and Janine aren't sure what to do.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tShould we go?\n\n\t\t\t\t\t\tJANINE\n\t\t\tI don't think we should leave her alone.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tYou're right.  We should stay.\n\nHe grabs Janine and they start making out again.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MUSEUM RESTORATION STUDIO - NIGHT (SAME TIME)\n\nJanosz stands before the painting of Vigo.  Vigo comes to life and\nrepeats the litany of his power.\n\n\t\t\t\t\t\tVIGO\n\t\t\tI, Vigo, the scourge of Carpathia --\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (heard all this before)\n\t\t\tYes, the scourge --\n\n\t\t\t\t\t\tVIGO\n\t\t\t-- the sorrow of Moldavia --\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t-- the sorrow --\n\n\t\t\t\t\t\tVIGO\n\t\t\tI command you.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (checking his watch)\n\t\t\tI await the word of Vigo.\n\n\t\t\t\t\t\tVIGO\n\t\t\tThe season of evil begins with the birth of\n\t\t\tthe new year.  Bring me the child that I\n\t\t\tmight live again.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (abjectly humble)\n\t\t\tLord Vigo, the mother, Dana, is fine and\n\t\t\tstrong.  I was wondering -- well, would it\n\t\t\tbe possible -- if I bring the baby, could I\n\t\t\thave the woman?\n\n\t\t\t\t\t\tVIGO\n\t\t\tSo be it.  On this the day of darkness, she\n\t\t\twill be ours, wife to you and mother to me.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  CARL SCHURZ PARK - NIGHT (LATER)\n\nPreceded by a police car, Ecto-2 enters the small park on the East River\nat 88th Street and disappears into an underground entrance.  The CAMERA\nPANS UP to reveal Gracie Mansion, the residence of the Mayor of New York\nCity.\n\nINT.  GRACIE MANSION - MOMENTS LATER\n\nThe Ghostbusters, now wearing police raincoats over their longjohns are\nushered through the house by a butler to a set of double oak doors.  The\nbutler knocks lightly, then opens the door to reveal the MAYOR sitting in\nfront of the fireplace in his well-appointed private study, flanked by\nJack Hardemeyer, both in tuxedoes.  The Ghostbusters enter.\n\nINT.  STUDY - CONTINUOUS ACTION\n\nThe Mayor is impatient and a little angry at having been pulled out of\nhis formal reception.  He frowns at their bizarre attire.\n\n\t\t\t\t\t\tMAYOR\n\t\t\tAll right -- the Ghostbusters.  I'll tell\n\t\t\tyou right now; I've got two hundred of the\n\t\t\theaviest campaign contributors in the city\n\t\t\tout there eating bad roast chicken waiting\n\t\t\tfor me to give the speech of my life.\n\t\t\tYou've got two minutes.  Make it good.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYou get enough negative energy flowing in a\n\t\t\tdense environment like Manhattan, it starts\n\t\t\tto build up, and if we don't do something\n\t\t\tfast this whole place will blow like a frog\n\t\t\ton a hotplate.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tTell him about the toaster.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI don't think he's ready for the toaster.\n\n\t\t\t\t\t\tMAYOR\n\t\t\t\t (shaking his head)\n\t\t\tBeing miserable and treating other people\n\t\t\tlike dirt is every New Yorker's God-given\n\t\t\tright.  What am I supposed to do -- go on\n\t\t\ttelevision and tell eight million people\n\t\t\tthey have to be nice to each other?  I'm\n\t\t\tsorry, none of this makes any sense to me,\n\t\t\tand if anything does happen we've got plenty\n\t\t\tof paid professionals to deal with it.  Your\n\t\t\ttwo minutes are up.  Good night, gentlemen.\n\nThe mayor exits, leaving the Ghostbusters to Hardemeyer.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (smirking)\n\t\t\tThat's quite a story.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tYeah, I think the Times might be interested,\n\t\t\tdon't you?  The Post might have a lot of fun\n\t\t\twith it, too.\n\nHardemeyer's eyes go cold and calculating.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\tBefore you go running to the newspapers with\n\t\t\tthis, would you consider telling this slime\n\t\t\tthing to some people downtown?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tNow you're talking.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  PARKVIEW HOSPITAL - PSYCHIATRIC WARD - NIGHT (LATER)\n\nAn attendant opens a locked door with a wire mesh window and the\nGhostbusters, in straitjackets, are led into the psych ward as Hardemeyer\nconfers with the chief PSYCHIATRIST.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (protesting)\n\t\t\tI'm telling you, we're not crazy.  He is!\n\nHARDEMEYER\n\nHe laughs off the remark.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (to the Psychiatrist)\n\t\t\tThe mayor wants them kept under strict\n\t\t\tobservation for a few days.  We think\n\t\t\tthey're seriously disturbed and potentially\n\t\t\tdangerous.\n\n\t\t\t\t\t\tPSYCHIATRIST\n\t\t\tWe'll do whatever's necessary.\n\nHardemeyer shakes his hand and exits as the door slams shut on the\nGhostbusters.\n\nINT.  VENKMAN'S LOFT - NIGHT (SAME TIME)\n\nLouis and Janine are watching an old rerun on TV, eating popcorn, while\nDana is stretched out on the other sofa.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (wishing they'd leave)\n\t\t\tYou know you really don't have to stay.\n\t\t\tPeter should be back soon.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOh no, we don't mind.\n\nShe hears a little CRY from the nursery and sits up.\n\n\t\t\t\t\t\tDANA\n\t\t\tExcuse me.  I think Oscar is up.\n\nShe crosses to the bedroom.\n\nINT.  VENKMAN'S BEDROOM - NIGHT (CONTINUOUS ACTION)\n\nDana enters and immediately notices that the crib is empty and the window\nis open.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (screams)\n\t\t\tLouis!\n\nFrantic now, Dana rushes to the window and looks out, as Louis and Janine\ncome running in.\n\nEXT.  WINDOW LEDGE - DANA'S POV - NIGHT (ECLIPSE)\n\nThe baby is standing out on the ledge at the corner of the building,\nfifty feet above the street, staring off into the distance as if he's\nwaiting for something.\n\nEXT.  WINDOW LEDGE - NIGHT (ECLIPSE) (CONTINUOUS ACTION)\n\nDana climbs out onto the ledge and starts inching slowly toward the baby.\nThen she stops as a miraculous apparition materializes.\n\nLOUIS AND JANINE\n\nThey lean out the window, gaping at the apparition.\n\nEXT.  VENKMAN'S LEDGE - APPARITION\n\nA sweet, kindly-looking English nanny appears, pushing a pram, strolling\non thin air parallel to the ledge high above the ground.  Her face looks\nremarkably like Janosz Poha's.  The nanny extends her hand to the BABY\nwho GURGLES sweetly as he reaches out to take it.\n\nDANA\n\nShe watches in helpless horror.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (screams)\n\t\t\tNo!!\n\nGHOST NANNY\n\nShe picks up the baby and lays it gently in the pram, then turns and\nsmiles at Dana.  The smile turns to a hideous grin, then the nanny\nshrieks at Dana and takes off like a shot with the baby.\n\nDANA\n\nShe watches the creature fly off with Oscar, then climbs back through\nthe window assisted by Louis and Janine.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (resolutely)\n\t\t\tLouis, you have to find Peter and tell him\n\t\t\twhat happened.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (confused and worried)\n\t\t\tWhere're you going?\n\n\t\t\t\t\t\tDANA\n\t\t\tTo get my baby back.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  MUSEUM - NIGHT (A LITTLE LATER)\n\nA taxi pulls up, Dana jumps out and rushes into the museum.  The moment\nthe door closes behind her, there is a loud THUNDERCLAP, the ground\ntrembles and a massive amount of slime erupts from around the base of\nthe museum and starts covering the walls, sealing her inside the\nbuilding.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  PARKVIEW PSYCHIATRIC - PADDED ROOM - NIGHT (SAME TIME)\n\nVenkman, Stantz, Spengler and Winston are in a padded cell.  They are\nhandcuffed and the cuffs are chained to thick leather belts around their\nwaists.  Venkman stands there banging his head into the padded wall\nwhile the others try to explain the situation to a skeptical\nPsychiatrist.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWe think the spirit of Vigo the Carpathian\n\t\t\tis alive in a painting at the Manhattan\n\t\t\tMuseum.\n\n\t\t\t\t\t\tPSYCHIATRIST\n\t\t\tI see. And are there any other paintings in\n\t\t\tthe museum with bad spirits in them?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (impatient)\n\t\t\tYou're wasting valuable time!  We have reason\n\t\t\tto believe that Vigo is drawing strength from\n\t\t\ta psychomagnetheric slime flow that's been\n\t\t\tcollecting under the city.\n\n\t\t\t\t\t\tPSYCHIATRIST\n\t\t\tYes, tell me about the slime.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tIt's potent stuff.  We made a toaster dance\n\t\t\twith it, then a bathtub tried to eat his\n\t\t\tfriend's baby.\n\nThe psychiatrist looks at Venkman.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tDon't look at me.  I think they're nuts.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MUSEUM RESTORATION STUDIO - NIGHT (SAME TIME)\n\nMoonlight streams through the skylight above, bathing the studio in\neerie white light.  Oscar is lying safely on a table in front of the\npainting of Vigo.  Dana enters cautiously and sees the baby.  Seeing no\none else about, she quickly sneaks down to the table and picks up the\nbaby, hugging hin tight, greatly relieved to find him unharmed and\nintact.\n\n\t\t\t\t\t\tJANOSZ (O.S.)\n\t\t\tI knew you would come.\n\nStartled, Dana turns at the sound of his voice as Janosz steps out from\nbehind the Vigo painting.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (defiantly)\n\t\t\tWhat do you want with my baby?\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tNo harm will come to the child.  You might\n\t\t\teven say it's a privilege.  He will be the\n\t\t\tvessel for the spirit of Vigo.  And you --\n\t\t\twell, you will be the mother of the ruler\n\t\t\tof the world.  Doesn't that sound nice?\n\n\t\t\t\t\t\tDANA\n\t\t\tIf this is what the world will be like, I\n\t\t\tdon't want to live in it.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (confidentially, indicating\n\t\t\t\t Vigo)\n\t\t\tI don't believe we have the luxury of choice.\n\n\t\t\t\t\t\tDANA\n\t\t\tEverybody has a choice.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tNot in this case, my dear.  Take a look.\n\t\t\tThat's not Gainsborough's Blue Boy up there.\n\t\t\tHe's Vigo!\n\n\t\t\t\t\t\tDANA\n\t\t\tI don't care who he is.  He's not taking my\n\t\t\tbaby.\n\nDana walks quickly to the door but suddenly Oscar flies out of her arms,\nfloats across the room and lands lightly back in the cradle.\n\nDANA\n\nShe turns and looks at Vigo, for the first time feeling his power.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tYou will see.  It's all for the best.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  PARKVIEW HOSPITAL - DAY (NEXT MORNING)\n\nIt's the last day of the year and the sun is shining brightly.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  PARKVIEW PSYCHIATRIC WARD - DAY (SAME TIME)\n\nThe Ghostbusters are sitting in the dayroom, a dingy lounge for patients\nin the locked ward.  There is a television set, a Ping-Pong table and a\nfew tables and chairs.  Stantz is looking at the sky through the heavy\nwire mesh covering the windows.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThis is it. boys.  It's starting.  Shit-storm\n\t\t\t2000.\n\nVenkman is doing occupational therapy, weaving on a little hand-loom.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tIt better not start yet.  I'm trying to\n\t\t\tfinish my potholder before lunch.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tYou think all those predictions about the\n\t\t\tworld coming to an end in the 1990s are true?\n\nA PATIENT at the next table joins the discussion.\n\n\t\t\t\t\t\tPATIENT\n\t\t\t\t (with certainty)\n\t\t\t1997.  My dog told me.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhat kind of dog?\n\n\t\t\t\t\t\tPATIENT\n\t\t\tLabrador.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (shakes his head)\n\t\t\tHabitual liars.  They can't help it.  It's\n\t\t\tin the breed.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  PARKVIEW HOSPITAL - EXAMINING ROOM - DAY (SAME TIME)\n\nLouis is pleading with his cousin, SHERMAN TULLY, a doctor on the staff\nat Parkview.  He looks and sounds just like Louis.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tCome on, Sherm.  You're my cousin.  Do this\n\t\t\tfor me.  I'm begging you.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tI can't do it, Louis.  It isn't ethical.  I\n\t\t\tcould lose my license.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tWhy can't you just have them released?\n\t\t\tYou're a doctor.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tI'm a dermatologist.  I can't write orders\n\t\t\ton the psych ward.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tSherman, I've done lots of favors for you.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tLike what?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tI got you out of those bad tax shelters.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tYou were the one who got me in.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tI fixed you up with Diane Troxler and she\n\t\t\tput out, didn't she?\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tYeah, I had to give her free dermabrasion\n\t\t\tfor a year.  Forget it, Louis.  I could get\n\t\t\tin a lot of trouble.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tI'm telling you, we're all going to be in\n\t\t\tbig trouble if we don't do something fast.\n\t\t\tThat ghost guy came and took my friend's\n\t\t\tbaby and we got to get it back.  It's just\n\t\t\ta scared little baby, Sherm.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tThen you should go to the police.  I don't\n\t\t\tbelieve in any of that stuff.\n\nSherman looks out the window.\n\nEXT.  SKY - SHERMAN'S POV\n\nThe sky begins to go dark as the sun is magically eclipsed.\n\nINT.  EXAMINING ROOM - CONTINUOUS ACTION - DAY\n\nThe room goes dark.  Louis switches on a lamp which casts an eerie light\non his face.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (spooky)\n\t\t\tDo you believe it now, Sherm?\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  HUDSON RIVER PIER - NIGHT (ECLIPSE)\n\nA drainpipe starts dripping slime into the river near the Cunard Line\ndocks.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  PUBLIC FOUNTAIN (59TH AND FIFTH) - NIGHT (ECLIPSE)\n\nWith the Plaza Hotel in the background, the fountain starts to spout\npsycho-reactive slime.\n\nHOTEL ENTRANCE\n\nA well-heeled MAN and WOMAN step out of a limousine and walk up the steps\ntoward the revolving door.  She looks up at the sky and frowns.\n\n\t\t\t\t\t\tWOMAN\n\t\t\t\t (shrewish)\n\t\t\tI told you we should have stayed in Palm\n\t\t\tBeach.  The weather here gets stranger every\n\t\t\tyear.\n\n\t\t\t\t\t\tMAN\n\t\t\tYes, dear.\n\nShe doesn't notice it, but a small amount of slime falls on the back of\nher luxurious, full-length, white mink coat.  The doorman nods\ncourteously and extends a hand to help her up the stairs.\n\nWOMAN\n\nShe yelps in pain.\n\n\t\t\t\t\t\tWOMAN\n\t\t\t\t (to the doorman)\n\t\t\tSomething just bit me!\n\nThe doorman looks curiously at her, then recoils in shock as her coat\ncomes alive.  MINK HEADS pop out of the thick fur, SNARLING, BARKING and\nYAPPING, their sharp, little teeth biting the air.  Reacting quickly, the\ndoorman yanks the coat off the woman's back, throws it to the ground and\nstarts stomping on it as the Woman and her husband look on in horror.\nThe coat scuttles down the steps and runs off down the street.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MIDTOWN CENTRAL POLICE PRECINCT - NIGHT (ECLIPSE)\n\nThe squad room is busy as DETECTIVES try to answer the flood of calls\nregarding the wave of supernatural events sweeping the city.\n\n\t\t\t\t\t\tDETECTIVE ONE\n\t\t\t\t (on the phone)\n\t\t\tLook, lady, of course there are dead people\n\t\t\tthere.  It's a cemetery ...\n\t\t\t\t (his face falls)\n\t\t\tThey were asking you for directions?\n\n\t\t\t\t\t\tDETECTIVE TWO\n\t\t\t\t (on another phone)\n\t\t\tWas this a big dinosaur or a little dinosaur?\n\t\t\t... Oh, just the skeleton, huh?  Well, where\n\t\t\tis it now?\n\n\t\t\t\t\t\tDETECTIVE THREE\n\t\t\t\t (on the phone)\n\t\t\tWait a second -- the park bench was chasing\n\t\t\tyou?  You mean, someone was chasing you in\n\t\t\tthe park ... No, the bench itself was chasing\n\t\t\tyou.  I see --\n\nA weary SERGEANT answers a RINGING PHONE.\n\n\t\t\t\t\t\tSERGEANT\n\t\t\tManhattan Central, Flaherty speaking ...\n\t\t\tYeah ... yeah? ... What?  Who is this? ...\n\t\t\tWait a second.\n\nHe puts the caller on \"Hold\" and turns the LIEUTENANT.\n\n\t\t\t\t\t\tSERGEANT\n\t\t\tLieutenant, I think you better talk to this\n\t\t\tguy.\n\n\t\t\t\t\t\tLIEUTENANT\n\t\t\t\t (on another call)\n\t\t\tWhat is it?  I'm talkin' here!\n\n\t\t\t\t\t\tSERGEANT\n\t\t\tIt's some dock supervisor down at Pier 34\n\t\t\ton the Hudson.  The guy's going nuts.\n\n\t\t\t\t\t\tLIEUTENANT\n\t\t\tWhat's the problem?\n\n\t\t\t\t\t\tSERGEANT\n\t\t\t\t (takes a deep breath)\n\t\t\tHe says the Titanic just arrived.\n\nINT.  PORT AUTHORITY OFFICE - NIGHT (ECLIPSE)\n\nThe dock supervisor stands there with the phone in his hand, an assistant\nbeside him, both staring out the window at the ocean liner tied up at the\npier.\n\nEXT.  PIER 34 - THEIR POV - NIGHT (ECLIPSE)\n\nThe name \"R.M.S. Titanic\" is clearly visible on the side of the huge\nship.  The gangplank is down and dozens of drowned passengers, sopping\nwet and festooned with seaweed, are disembarking while drowned porters\noff-load their waterlogged baggage.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  PARKVIEW HOSPITAL - NIGHT (MOMENTS LATER)(ECLIPSE)\n\nEcto-2 is parked outside as Louis and Sherman come out of the hospital\nwith the Ghostbusters, now wearing their standard uniforms.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tGood work, Louis.  How did you get us out?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOh, I pulled a few strings.  I wouldn't want\n\t\t\tto say any more than that.\n\nLouis winks conspiratorially at Sherman.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tThis is my cousin Sherman.  Sherm, say hello\n\t\t\tto the Ghostbusters.\n\t\t\t\t (sotto voce to Stantz)\n\t\t\tI promised him a ride in the car if he got\n\t\t\tyou out.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\t\t (to the Ghostbusters)\n\t\t\tHi, it's really great to meet you guys.  I\n\t\t\tknow this sounds weird but once I had a\n\t\t\tdream that my grandfather was standing at\n\t\t\tthe foot of my bed, but I knew it was\n\t\t\timpossible because he died and he started\n\t\t\tto tell me that --\n\nWhile he's talking, the Ghostbusters jump in the Ectomobile and drive\noff, leaving him and Louis standing at the curb.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tHey!  Wait!  Okay, I'll meet you there.\n\n\t\t\t\t\t\tSHERMAN\n\t\t\tI thought you were like the fifth Ghostbuster.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tI let them handle all the little stuff.  I\n\t\t\tjust come in on the big ones.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\n-----------------------------------------------------------------------\n(original version of the above scene - 11/27/88)\n(TRANSCRIBER'S NOTES: These two versions of this scene were put in my\ncopy of the script, so I have included both of them here)\n\n\t\t\t\t\t\tLOUIS\n\t\t\tActually, they still think you're crazy, but\n\t\t\tI convinced them you're not dangerous.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (determined)\n\t\t\tYeah, well guess again.\n\nEXT.  BELLEVUE HOSPITAL - NIGHT (ECLIPSE)(MOMENTS LATER)\n\nEcto-2 is parked outside and the Ghostbusters are hastily donning their\nstandard uniforms.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tI brought everything you asked for and I\n\t\t\tgassed up the car with Super Unleaded.  It\n\t\t\tcost twenty cents more than Regular Unleaded\n\t\t\tbut you get much better performance and in\n\t\t\tan old car like this that'll end up saving\n\t\t\tyou money in the long run.  I put it on my\n\t\t\tcredit card, so you can either reimburse me\n\t\t\tor I can take it out of petty cash --\n\nWhile he's talking, the Ghostbusters jump in the Ecto-2 and drive\noff without him.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tHey!  Wait!  Okay, I'll meet you there.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\n-----------------------------------------------------------------------\n\nEXT.  MUSEUM - NIGHT (ECLIPSE)(LATER)\n\nECTO-2 pulls to the curb across the street from the museum.  Hundreds of\nspectators are already there gawking at the building as the Ghostbusters\njump out and gape at the sight that greets them.\n\nEXT.  MUSEUM THEIR POV - BUILDING\n\nThe building is now totally covered in a shell of psycho-reactive slime.\nCITY WORKMEN and FIREMEN are trying to cut their way in with blowtorches,\njackhammers, power tools and the \"jaws of life,\" but they can't even make\na dent.\n\nGHOSTBUSTERS\n\nThey size up the situation as they don their proton packs.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIt looks like a giant Jello mold.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tI hate Jello.\n\nThey stride manfully across the street and approach the main entrance to\nthe museum.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (to the Fire Captain)\n\t\t\tOkay, give it a rest, Captain.  We'll take\n\t\t\tit from here.\n\n\t\t\t\t\t\tFIRE CAPTAIN\n\t\t\t\t (skeptical)\n\t\t\tBe my guest.  We been cutting here for three\n\t\t\thours.  What the hell's going on?  You know\n\t\t\tthe Titanic arrived this morning?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWell, better late than never.\n\nThe workmen and firemen put down their tools and fall back as the\nGhostbusters draw their particle throwers.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (monitoring valences)\n\t\t\tFull neutronas, maser assist.\n\nThey adjust their settings and prepare to fire.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tThrow 'em!\n\nThey trigger their throwers and spray the front doors of the building\nwith bolts of proton energy, but it has no effect on the hardened slime.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to the firemen)\n\t\t\tOkay, who knows \"Cumbaya?\"\n\nA few of the firemen and workmen tentatively raise their hands.  Venkman\ngrabs them and lines them up at the entrance of the museum.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAll right.  Nice and sweet --\n\t\t\t\t (starts singing)\n\t\t\tCumbaya, milord, cumbaya --\n\nStantz, Spengler, Winston and the firemen sing along, reluctantly holding\nhands and swaying to the music.\n\n\t\t\t\t\t\tALL\n\t\t\t\t (singing)\n\t\t\tCumbaya, milord, cumbaya, Cumbaya, milord,\n\t\t\tcumbaya, Oh, Lord, cumbaya.\n\nStantz inspects the wall of slime with his infra-goggles and finds that\nthey have only managed to open a hole the size of a dime.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tForget it.  The Vienna Boys Choir couldn't\n\t\t\tget through this stuff.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tGood effort.  Now what?  Should we say\n\t\t\tsupportive, nurturing things to it, Ray?\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tIt won't work.  There's no way we could\n\t\t\tgenerate enough positive energy to crack\n\t\t\tthat shell.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI can't believe things have gotten so bad\n\t\t\tin this city that there's no way back.\n\t\t\tSure, it's crowded, it's dirty, it's noisy.\n\t\t\tAnd there are too many people who'd just as\n\t\t\tsoon step on your face as look at you.  But\n\t\t\tthere've got to be a few sparks of sweet\n\t\t\thumanity left in this burned-out burg.  We\n\t\t\tjust have to mobilize it.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tWe need something that everyone can get\n\t\t\tbehind, a symbol --\n\nHis eyes fall on ECTO-2's New York State license plate which features a\nline drawing of the Statue of Liberty.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (he sees it, too)\n\t\t\tSomething that appeals to the best in each\n\t\t\tand every one of us --\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tSomething good --\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAnd pure --\n\n\t\t\t\t\t\tWINSTON\n\t\t\tAnd decent.\n\nEXT.  THE STREET - NIGHT (SAME TIME)\n\nThere is a commotion among the crowd as the Mayor's limousine arrives\nwith a police escort.  Jack Hardemeyer steps out followed by the Mayor\nhimself and they cross to the museum entrance.\n\nHardemeyer, his ASSISTANT and several police BODYGUARDS confront the\nGhostbusters.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\tLook, I've had it with you.  Get your stuff\n\t\t\ttogether, get back in that clown car and get\n\t\t\tout of here.  This is a city matter and\n\t\t\teverything's under control.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOh, you think so?  Well, I've got news for\n\t\t\tyou.  You've got Dracula's brother-in-law\n\t\t\tin there and he's got my girlfriend and her\n\t\t\tkid.  Around about midnight tonight, when\n\t\t\tyou're partying uptown, this guy's going to\n\t\t\tcome to life and start doing amateur head\n\t\t\ttransplants.  And that's just round one.\n\n\t\t\t\t\t\tMAYOR\n\t\t\tAre you telling me there're people trapped\n\t\t\tin there?\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (to his assistant)\n\t\t\tThis is dynamite.  Call A.P., U.P.I., and\n\t\t\tC.N.N. and get them down here right away.\n\t\t\tWhen the police bring this kid out I want\n\t\t\tthem to hand it right to the mayor and I\n\t\t\twant it all on camera.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tMr. Mayor, if we don't do something by\n\t\t\tmidnight, you're going to go down in history\n\t\t\tas the man who let New York get sucked down\n\t\t\tinto the tenth level of hell.\n\nThe Mayor stops to consider the situation.\n\n\t\t\t\t\t\tMAYOR\n\t\t\t\t (to the Fire Captain)\n\t\t\tCan you get into that museum?\n\n\t\t\t\t\t\tFIRE CAPTAIN\n\t\t\tIf I had a nuclear warhead, maybe.\n\nThe Mayor turns to Venkman.\n\n\t\t\t\t\t\tMAYOR\n\t\t\tYou know why all these things are happening?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWe tried to tell you last night, but Mr.\n\t\t\tHard-On over here packed us off to the loony\n\t\t\tbin.\n\nHardemeyer flips out.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\tThis is preposterous!  You can't seriously\n\t\t\tbelieve all this mumbo-jumbo!  It's the\n\t\t\tTwentieth Century, for crying out loud!\n\t\t\t\t (viciously, to Venkman)\n\t\t\tLook, mister, I don't know what this stuff\n\t\t\tis or how you got it all over the museum,\n\t\t\tbut you better get it off and I mean right\n\t\t\tnow!\n\nHe pounds the wall of slime with his fist, and they all watch in\namazement as his fist goes through the wall and he is sucked bodily\nthrough the slime curtain.  Only his shoes can be seen, embedded in the\nslime.\n\n\t\t\t\t\t\tMAYOR\n\t\t\t\t (to Venkman)\n\t\t\tOkay, just tell me what you need.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  LIBERTY ISLAND (NEW YORK HARBOR) - NIGHT\n\nWith the city skyline in the b.g., the Ghostbusters prepare their\nequipment.  Each of them dons a makeshift backpack consisting of tanks,\nhoses, nozzles and an abundance of gauges, valves and regulators.\nVenkman looks up at the Statue of Liberty looming above them.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tKind of makes you wonder, doesn't it?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tWonder what?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tIf she's naked under that toga.  She's\n\t\t\tFrench, you know.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tThere's nothing under that toga but 300 tons\n\t\t\tof iron and steel.\n\nStantz is looking worried.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI hope we have enough stuff to do the job.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOnly one way to find out.\n\t\t\t\t (to Stantz)\n\t\t\tReady, Teddy?\n\nThey enter the statue.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  STATUE OF LIBERTY - MOMENTS LATER\n\nThe Ghostbusters are working from the iron staircase that spirals\nstraight up 100 feet inside the hollow super-structure of the statue.\nSpengler and Winston are busy assembling hundreds of wires connected to\nvarious relays on the interior surface of the statue.  Venkman and Stantz\nare mounting large auditorium loudspeakers near the top of the staircase.\nThey finish the installation, then Stantz dons one of the new backpacks\nand gives the order.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tOkay, boys.  Let's frost it.\n\nThey begin hosing the inside of the statue with the psycho-reactive\nslime.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  FIREHOUSE - NIGHT (SAME TIME)\n\nJanine watches as Louis, wearing a Ghostbuster uniform, slings a heavy\nproton pack onto his back.\n\n\t\t\t\t\t\tJANINE\n\t\t\tI'm not sure this is such a good idea?  Do\n\t\t\tthey know you're doing this?\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOh, yeah, sure -- no.  But there's really\n\t\t\tnot much to do here and they might need\n\t\t\tsome back-up at the museum.\n\n\t\t\t\t\t\tJANINE\n\t\t\tYou're very brave, Louis.  Good luck.\n\nShe kisses Louis and he gets extremely self-conscious.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tUh -- oh -- well, I better hurry.\n\nHe rushes out.\n\nEXT  STREET OUTSIDE FIREHOUSE - NIGHT (LITTLE LATER)\n\nLouis stands on the street corner waiting for a bus.  Finally, a bus\npulls up, Louis climbs aboard and finds Slimer behind the wheel.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  STATUE OF LIBERTY - OBSERVATION DECK - MOMENTS LATER\n\nVenkman, Stantz, Spengler and Winston are standing in the observation\nwindows in the crown of the statue.  It looks like they're on the bridge\nof an ocean liner, then the CAMERA PULLS BACK to reveal the head of the\nstatue.\n\nSTANTZ\n\nHe plugs the main cable lead into a transformer.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tIt's all yours, Pete.\n\t\t\t\t (checks his watch)\n\t\t\tThere's not much time left.\n\nVenkman plugs the speaker cable into a Walkman and gives a downbeat.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (giving the downbeat)\n\t\t\tOkay, one, two, three, four --\n\nHe hits \"Play\" on the Walkman and \"HIGHER AND HIGHER\" BOOMS from the huge\nSPEAKERS, amplified by the statue's vast hollow interior.\n\nINT.  OBSERVATION DECK - NIGHT (CONTINUOUS ACTION)\n\nThe head of the statue lurches suddenly, but the Ghostbusters cling to\nthe rail and manage to keep their feet.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tShe's moving!\n\n\t\t\t\t\t\tWINSTON\n\t\t\tI've lived in New York all my life and I\n\t\t\tnever visited the Statue of Liberty.  Now I\n\t\t\tfinally get here and we're taking her out\n\t\t\tfor a walk.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (reading the Giga-meter)\n\t\t\tWe've got full power.\n\nStantz picks up a Nintendo control paddle from a home video game and\nstarts pushing the buttons.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (into a microphone)\n\t\t\tOkay, Libby.  Let's get it in gear.\n\nThey feel a strong vibration and the statue starts to move.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  SOUTH STREET SEAPORT - NIGHT\n\nNew Years Eve celebrants line the riverfront, pointing and gawking at an\nincredible sight.\n\nEXT.  EAST RIVER - THEIR POV - NIGHT (CONTINUOUS ACTION)\n\nThe statue is moving up the river almost completely submerged, only her\nhead from the nose up is visible above the surface.\n\nINT.  OBSERVATION DECK - NIGHT (CONTINUOUS ACTION)\n\nWinston looks out apprehensively.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tHow deep does it get?  That water's cold and\n\t\t\tI can't swim.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tIt's okay.  I have my Senior Lifesaving card.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tWith a water temperature of forty degrees\n\t\t\twe'd survive approximately fifteen minutes.\n\nStantz studies a maritime navigational chart.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI'll keep to the middle of the channel.\n\t\t\tWe're okay to 59th Street, then we'll go\n\t\t\tashore and take First Avenue to 79th.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tAre you kidding?  We'll hit all that bridge\n\t\t\ttraffic at 59th.  I'm going to take 72nd\n\t\t\tstraight up to Fifth.  Trust me, I used to\n\t\t\tdrive a cab.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  RIVERFRONT - NIGHT (SAME TIME)\n\nSpectators cheer wildly, inspired by the sight of the Statue.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MUSEUM RESTORATION STUDIO - NIGHT (SAME TIME)\n\nJanosz is sitting next to Dana, still wheedling her with promises and\nself-serving logic.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tTime is running out, Dana.  Soon it will be\n\t\t\tmidnight and the city will be mine -- and\n\t\t\tVigo's.  Well, mainly Vigo's.  But we have\n\t\t\ta spectacular opportunity to make the best\n\t\t\tof our relationship.\n\n\t\t\t\t\t\tDANA\n\t\t\tWe don't have a relationship.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tI know.  Marry me, Dana, and together we\n\t\t\twill raise Vigo as our son.  There are many\n\t\t\tperks that come with being the mother of a\n\t\t\tliving god.  I'm sure he will supply for us\n\t\t\ta magnificent apartment.  And perhaps a car\n\t\t\tand free parking.\n\n\t\t\t\t\t\tDANA\n\t\t\tI hate and despise you and everything you\n\t\t\tstand for with all my heart and soul.  I\n\t\t\tcould never forgive what you've done to me\n\t\t\tand my child.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tMany marriages begin with a certain amount\n\t\t\tof distance, but after a while I believe we\n\t\t\tcould learn to love each other.  Think about\n\t\t\tit.\n\n\t\t\t\t\t\tDANA\n\t\t\tI'd rather not.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  TIMES SQUARE - NIGHT (SAME TIME)\n\nPeople are jammed together shoulder to shoulder filling Times Square,\nwatching the big Seiko clock count down the last ten minutes to midnight.\nSuddenly, they look down Broadway and see a magnificent sight.\n\nEXT.  BROADWAY - NIGHT (CONTINUOUS ACTION)\n\nThe Statue of Liberty is walking up Broadway approaching 42nd Street,\nwith \"Higher and Higher\" BOOMING from the SPEAKERS inside.  A great cheer\ngoes up, and the crowd goes wild with joy, dancing and singing along with\nthe MUSIC.\n\nINT.  STATUE OF LIBERTY OBSERVATION DECK - NIGHT (CONTINUOUS)\n\nSpengler reads the Giga-meter.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tIt's working.  The positive GeV's are\n\t\t\tclimbing.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (patting the Statue)\n\t\t\tThey love you, Lib.  Keep it up.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  FIFTH AVENUE - NIGHT (LATER)\n\nThe avenue has been closed to traffic and barricades placed, blocking all\nthe side streets.  A squadron of police motorcycles comes speeding around\nthe corner at 72nd Street and proceeds up Fifth Avenue in the direction\nof the museum.  Then MUSIC is heard BOOMING in the distance, the ground\nshakes and the Statue of Liberty comes walking around the corner onto\nFifth Avenue followed by a wildly cheering throng.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  OBSERVATION DECK - NIGHT (CONTINUOUS ACTION)\n\nThe Ghostbusters can see the museum ahead.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSo far so good.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (worried)\n\t\t\tI'm worried.  The vibrations could shake her\n\t\t\tto pieces.  We should have padded her feet.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI don't think they make Nikes in her size.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWe're almost there, Lib.\n\t\t\t\t (to Stantz)\n\t\t\tStep on it.\n\nEXT.  STREET - NIGHT (CONTINUOUS ACTION)\n\nThe Statue's huge foot comes down and squashes a car.\n\nINT.  OBSERVATION DECK - NIGHT (CONTINUOUS ACTION)\n\nThe Ghostbusters look down at the flattened car.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (shouts out the window)\n\t\t\tMy Fault!\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (shouts)\n\t\t\tShe's new in town.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MUSEUM - RESTORATION STUDIO - SAME TIME\n\nJanosz is painting the last of the mystical symbols on the baby's chest.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  TIMES SQUARE - NIGHT (SAME TIME)\n\nThe people still in the square start counting off the last ten seconds to\nmidnight and the New Year.\n\n\t\t\t\t\t\tCROWD\n\t\t\t\t (chanting)\n\t\t\tTen .. nine ... eight ... seven ...\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nINT.  MUSEUM - PAINTING - NIGHT\n\nA strange light spreads over the painting.  As the light moves onto his\nface, Vigo spreads his arms wide and his upper body starts to emerge from\nthe canvas.\n\n\t\t\t\t\t\tVIGO\n\t\t\tSoon my life begins.  Then woe to the weak,\n\t\t\tall power to me, the world is mine.\n\nINT.  MUSEUM - JANOSZ - NIGHT\n\nThe baby's body begins to glow as Vigo reaches out for it.  Then suddenly\na dark shadow falls across the skylight.  Janosz looks up.\n\nINT.  MUSEUM - JANOSZ'S POV - SKYLIGHT - NIGHT\n\nThe Statue of Liberty is looming over the skylight looking down on Janosz\nwith an expression of righteous anger on it's face.\n\nEXT.  MUSEUM - NIGHT (CONTINUOUS ACTION)\n\nKneeling beside the museum, the statue draws back it's mighty right arm\nand smashes the skylight with its torch.\n\nINT.  RESTORATION STUDIO - NIGHT (CONTINUOUS ACTION)\n\nJanosz retreats from the shower of broken glass as the Ghostbusters come\nsliding down ropes into the studio and confront Janosz with their new\nweapons.  Quick as a flash, Dana seizes the moment, dashes across the\nstudio and snatches the baby from Vigo's outstretched arms.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Janosz)\n\t\t\tHappy New Year.\n\nINT.  MUSEUM - VIGO PAINTING - NIGHT (CONTINUOUS ACTION)\n\nVigo bellows in rage.\n\nINT.  MUSEUM - STUDIO - NIGHT (CONTINUOUS ACTION)\n\nJanosz steps in front of the painting.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tHi there.  Feel free to try something stupid.\n\nJanosz sneers, trusting the invincibility of Vigo.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tYou pitiful, miserable creatures!  You dare\n\t\t\tto challenge the power of darkness?  Don't\n\t\t\tyou realize what you are dealing with?  He's\n\t\t\tVigo!  You are like the buzzing of flies to\n\t\t\thim.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (sighs)\n\t\t\tOh, Johnny.  Did you back the wrong horse.\n\nWith that, the Ghostbusters fire their slime-blowers and hose Janosz from\nhead to toe, blowing him into the corner.  Then they turn to Vigo.\n\nVIGO\n\nHe is now almost completely out of the painting, but still held from the\nknees down.  He spits and rages at the Ghostbusters, trying to unleash\nhis magic powers.\n\nTHE GHOSTBUSTERS\n\nThey stand fast, secure in the knowledge that Vigo's power has been\nneutralized by the good will of the people.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tVigi, Vigi, Vigi -- you have been a bad\n\t\t\tlittle monkey.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThe whole city's together on this one.  We\n\t\t\ttook a vote.  Everybody's down on you, you\n\t\t\tknow.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (arming his slime-blower)\n\t\t\tSay goodnight now.\n\nSuddenly Vigo grabs Stantz by the neck and holds him up as a shield.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tDon't shoot!  You'll hit Ray!\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (strangling)\n\t\t\tDo it!  Just do it!\n\nWinston fires and hoses both Vigo and Ray.\n\nVIGO\n\nHe bellows and drops Ray, then falls back into the painting.\n\nINT.  MUSEUM - PAINTING - NIGHT\n\nThe paint turns liquid, melts off the canvas and runs onto the floor\nrevealing another painting underneath it.\n\nINT.  MUSEUM - GHOSTBUSTERS - NIGHT (AFTER BATTLE)\n\nVenkman, Spengler and Winston rush over to Ray and kneel beside him.  He\nis completely covered with slime and motionless.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (examining him)\n\t\t\tHe's breathing.\n\nWinston wipes the slime off Ray's face and Ray opens his eyes.\n\n\t\t\t\t\t\tWINSTON\n\t\t\tRay -- Ray -- How do you feel, man?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (smiles lovingly)\n\t\t\tGroovy.  I've never felt better in my life.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tOh, no.  We've got to live with this?\n\nThey pull him to his feet.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tI love you guys.  You're the best friends\n\t\t\tI've ever had.\n\nHe hugs them each in turn, leaving them slimed as well.  Venkman recoils\nin disgust.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tHey, I just had this suit cleaned.\n\t\t\t\t (indicating Janosz)\n\t\t\tTake care of the wiggler, will you.\n\nVenkman crosses to Dana who is snuggling the baby.  She hugs Venkman.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tWhat is this -- a love in?\n\t\t\t\t (notes the symbols painted\n\t\t\t\t on the baby's body)\n\t\t\tHey, sailor.  I think the tattoos are a\n\t\t\tlittle much, don't you?\n\nHe picks up the baby.\n\n\t\t\t\t\t\tDANA\n\t\t\t\t (to Venkman)\n\t\t\tI think he likes you.  I think I do too.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tFinally came to your senses, huh?\n\nThey hug and kiss.\n\nSPENGLER, WINSTON AND STANTZ\n\nThey help Janosz to his feet.  He's dazed but unhurt.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (restored to normalcy)\n\t\t\tWhat happened?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (calmly)\n\t\t\tSir, you had a violent, prolonged,\n\t\t\ttransformative psychic episode.  But it's\n\t\t\tover now.  Want a coffee?\n\n\t\t\t\t\t\tJANOSZ\n\t\t\t\t (extremely nice)\n\t\t\tThat's very kind of you.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\t\t (to Stantz)\n\t\t\tHe's fine, Ray.  Physically intact,\n\t\t\tpsychomagnetherically neutral.\n\n\t\t\t\t\t\tJANOSZ\n\t\t\tIs that good?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tIt's where you want to be.\n\nAs they exit they stop to examine the painting that was concealed by\nVigo's self-portrait.\n\n\t\t\t\t\t\tSPENGLER\n\t\t\tLate Renaissance, I think.  Caravaggio or\n\t\t\tBrunelleschi.\n\n\t\t\t\t\t\tWINSTON\n\t\t\t\t (staring at it)\n\t\t\tThere's something very familiar about this\n\t\t\tpainting.\n\nINT.  MUSEUM - NEW PAINTING - NIGHT\n\nIt's a beautiful painting in the high-Renaissance style depicting four\narchangels hovering protectively over a cherubic baby.  One holds a harp,\none, an olive branch, the third, a book, and the last, a sword.  Most\nremarkably, their faces bear an uncanny resemblance to Venkman, Stantz,\nSpengler and Winston.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  STREET - NIGHT (SAME TIME)\n\nA city bus pulls up near the museum and Louis steps off.  He waves his\nthanks to Slimer who is behind the wheel.\n\n\t\t\t\t\t\tLOUIS\n\t\t\t\t (to Slimer)\n\t\t\tOkay, so Monday night we'll get something\n\t\t\tto eat and maybe go bowling?  Can you bowl\n\t\t\twith those little arms?\n\nSLIMER GRUNTS and SLOBBERS a reply, flexing his scrawny biceps.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tOkay, I have to go save Dana.  I'll see you\n\t\t\tlater.\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT. MUSEUM - NIGHT (LITTLE LATER)\n\nThe Ghostbusters are greeted by wild cheering and applause as they come\nout the main entrance with Dana and the baby.  Everybody starts singing\n\"Auld Lang Syne.\"  Louis picks his way through the celebrating crowd and\nfinds the Ghostbusters.\n\n\t\t\t\t\t\tLOUIS\n\t\t\tAm I too late?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tNo, you're right on time.\n\nStantz pops the cork on a bottle of champagne and hands it to him.\n\nEXT.  MUSEUM ENTRANCE - NIGHT (SAME TIME)\n\nHardemeyer staggers out of the museum covered in slime.  He looks at the\ncelebrating crowd and his eyes fill with tears.\n\n\t\t\t\t\t\tHARDEMEYER\n\t\t\t\t (weepy)\n\t\t\tHappy New Year, everybody!\n\nHe joins in on \"Auld Lang Syne.\"\n\n\t\t\t\t\t\t\t\t\t\t\t\t CUT TO:\n\nEXT.  CENTRAL PARK - NIGHT (LATER)\n\nThe Statue of Liberty is sprawled inert on her back in the park behind\nthe museum, her toga up over her knees.  The Mayor looks nearly suicidal.\nThe Ghostbusters stand beside him commiserating.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tShe's all right.  She's just sleeping it off.\n\n\t\t\t\t\t\tMAYOR\n\t\t\t\t (stricken)\n\t\t\tWe just had it restored.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tThis probably isn't a good time to bring\n\t\t\tthis up, but the last time we did a job for\n\t\t\tthe city you stiffed us.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\t\t (handing the Mayor an\n\t\t\t\t invoice)\n\t\t\tThis is a bill for tonight's job.\n\nThe Mayor looks at it and gasps at the amount.\n\n\t\t\t\t\t\tMAYOR\n\t\t\tWhat!  This is way too much.\n\t\t\t\t (hands the bill back to\n\t\t\t\t Venkman)\n\t\t\tWe won't pay.\n\nVenkman looks at the Statue.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\t\t (to Stantz)\n\t\t\tI think she looks pretty good here, don't\n\t\t\tyou?\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tYeah, and a lot easier to get to than that island.\n\nRealizing he has no alternative, the Mayor sighs and takes the bill back.\n\n\t\t\t\tMAYOR\n\t\tAll right, all right.  If you can wait until\n\t\tMonday I'll issue you a check.\n\n\t\t\t\tSPENGLER\n\t\tSorry.  No checks.  Company policy.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT. LIBERTY ISLAND - DAY (WEEKS LATER)\n\nThe sun is shining brightly and Liberty is back on her pedestal where she\nbelongs.  The Mayor and a host of officials are commemorating her return.\nThe Ghostbusters, Dana, Janine and Louis are there as honored guests.\n\n\t\t\t\tVENKMAN\n\t\t\t(looking up at the statue)\n\t\tPretty impressive, huh?\n\n\t\t\t\tSPENGLER\n\t\t\t(musing)\n\t\tIt's probably the first thing my\n\t\tgrandparents saw when they came to this\n\t\tcountry.\n\n\t\t\t\tVENKMAN\n\t\tFrom where -- Neptune?\n\n\t\t\t\tSPENGLER\n\t\tThey came from Ostrov in Eastern Poland.\n\n\t\t\t\tVENKMAN\n\t\tOstrov?  I've been there.  Good party town.\n\n\t\t\t\tSTANTZ\n\t\t\t(in a similarly reflective\n\t\t\tmood)\n\t\tMy great-grandparents were Swiss.  I still\n\t\thave the pictures they took of the statue\n\t\tfrom the boat when they arrived.\n\n\t\t\t\tVENKMAN\n\t\tOh, right, you told me that.  They came to\n\t\tAmerica seeking other kinds of cheese, as I\n\t\trecall.  How about you, Winston?\n\n\t\t\t\t\t\tWINSTON\n\t\t\tMy people weren't taking any pictures from\n\t\t\tthose slave ships, man.  And there wasn't\n\t\t\tany Statue in Charleston Harbor to welcome\n\t\t\tthem, either.  What are you, Dana?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tMiss Blue Blood?  Her family's been here\n\t\t\tsince the year 12.\n\n\t\t\t\t\t\tDANA\n\t\t\tThat's not true.  It was 1620.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSame difference.\n\n\t\t\t\t\t\tSTANTZ\n\t\t\tWhat's your story, Pete?\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tMe?  I'm a little of everything.  Some Irish,\n\t\t\tsome German, some French, Dutch -- the women\n\t\t\tin my family slept around.  And that's what\n\t\t\tmade this country great.\n\n\t\t\t\t\t\tDANA\n\t\t\tThat's a terrible thing to say.\n\n\t\t\t\t\t\tVENKMAN\n\t\t\tSo what?  It's a free country.\n\t\t\t\t (looking up at the Statue)\n\t\t\tThanks, Lib.\n\nThey all look up at the Statue.\n\nEXT.  STATUE OF LIBERTY - HEAD OF STATUE - DAY\n\nSlimer flies out one of the observation windows, THEME MUSIC KICKS IN and\nthe CAMERA PULLS UP and AWAY FROM the island TO a HIGH SHOT of the\nStatue, lower Manhattan and the shining sea beyond.\n\n\t\t\t\t\t\t\t\t\t\t\tFADE OUT.\n\n\t\t\t\t\t\tTHE END\n\n\n\n\n\nGhostbusters 2\nWriters :   Dan Aykroyd  Harold Ramis\nGenres :   Sci-Fi  Comedy  Action  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:25:57.408556"}