{"title": "Godfather Part II", "film_link": "/Movie Scripts/Godfather Part II Script.html", "script_link": "/scripts/Godfather-Part-II.html", "info_raw": "\n\nGodfather Part II Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Mario Puzo  Francis Ford Coppola\nGenres  Crime  Drama\nScript Date : September 1973\n\nRead \"Godfather Part II\" Script\n\n\n", "script": "\n\n\nThe Godfather: Part two\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\tTHE GODFATHER\n\n\t\t\t\t Part Two\n\n\t\t\t\tScreenplay by\n\n\t\t\t\tMario Puzo\n\n\t\t\t\t    and\n\n\t\t\t Francis Ford Coppola\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSECOND DRAFT\n\nSeptember 24, 1973\n\n\n\n\n\nFADE IN:\n\nThe Paramount Pictures logo is presented over a simple black\nbackground, as a single trumpet plays the familiar theme of\na waltz.  White lettering fades in:\n\n\t\t     Mario Puzo's THE GODFATHER\n\nThere is a pause, as the trumpet concludes, and there is the\nadditional title: - Part Two -\n\nINT. DON CORLEONE'S OLD OFFICE - CLOSE VIEW ON MICHAEL\nCORLEONE - DAY\n\nstanding impassively, like a young Prince, recently crowned\nKing.\n\nCLOSE VIEW ON Michael's hand.  ROCCO LAMPONE kisses his hand.\nThen it is taken away.  We can SEE only the empty desk and\nchair of Michael's father, Vito Corleone.  We HEAR, over\nthis, very faintly a funeral dirge played in the distance,\nas THE VIEW MOVES SLOWLY CLOSER to the empty desk and chair.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. A SICILIAN LANDSCAPE - FULL VIEW - DAY\n\nWe can barely make out the funeral procession passing over\nthe burnt-brown of a dry river bed.  The figures move\nslowly, seemingly from out of hundreds of years of the past.\n\nThe MUSICIANS walking unsteadily on the rocky bed, their\ninstruments harsh and blaring.\n\nThey are followed by six young peasant men, carrying the\ncrude wooden coffin on their shoulders.  Then the widow, a\nstrong large woman, dressed in black, and not accepting the\narms of those walking with her.\n\nBehind her, not more than twenty relatives, few children and\npaisani continue alone behind the coffin.\n\nSuddenly, we HEAR the shots of the lupara, and the musicians\nstop their playing.  The entire procession scatters in odd\ndirections along the rocky river bed.\n\nThe young men struggle with the burden of the heavy coffin,\nthrowing it out of balance and nearly crashing to the ground.\nWe hear a woman SCREAMING:\n\n\t\t\t\tWOMAN\n\t\t\t(Sicilian)\n\t\tThey've killed young Paolo!  They've\n\t\tkilled the boy Paolo!\n\nEXT. SICILIAN LANDSCAPE - MED. VIEW - DAY\n\nacross the slain body of a fourteen year old boy, lying on\nthe parched ground.  In the distance we see four or five of\nthe mourning women, the wind blowing their black dresses and\nveils, running up to the body of the boy.  They begin to\nwail, and cry out in anguished Sicilian, as the widow, the\nmother of the murdered boy, holds her child in her arms, his\nfresh blood wetting her strong hands.\n\nEXT. BARONIAL ESTATE - TIGHT MOVING VIEW - DAY\n\nA boy, eight or nine, with wide, frightened eyes, being\npulled quickly by the hand.  This is VITO ANDOLINI, who is\nto become The Godfather.\n\nThe VIEW ALTERS revealing that he is being pulled along by\nhis Mother, the Widow, across a field leading to the\nornamental gates of a Baronial Estate of some forgotten Noble.\n\nAt various positions near the gates are men with shotguns,\nor lupara.  The gates are opened; and the Widow and her boy\nare shown before DON FRANCESCO, a man in his sixties.  He\nwears his trousers with suspenders, and an open white shirt\nsloppily tucked in over his enormous belly.  He wears a hat\nto protect him from the white-hot sun, and proudly displays\na gold watch and chain over his vest.\n\nHe sits in a chair, near a group of his men in the garden,\nlistening to the Widow, who stands before him with her only\nson.\n\n\t\t\t\tWIDOW\n\t\t\t(Sicilian)\n\t\tDon Francesco.  You murdered my\n\t\thusband, because he would not bend.\n\t\tAnd his oldest son Paolo, because\n\t\the swore revenge.  But Vitone is\n\t\tonly nine, and dumb-witted.  He\n\t\tnever speaks.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tI'm not afraid of his words.\n\n\t\t\t\tWIDOW\n\t\t\t(Sicilian)\n\t\tHe is weak.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tHe will grow strong.\n\n\t\t\t\tWIDOW\n\t\t\t(Sicilian)\n\t\tThe child cannot harm you.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tHe will be a man, and then he will\n\t\tcome for revenge.\n\nAs she pleads, the Widow moves closer to the Don, until she\nhas practically thrown herself to her knees before him.\n\n\t\t\t\tWIDOW\n\t\t\t(Sicilian)\n\t\tI beg you, Don Francesco, spare my\n\t\tonly son.  He is all I have.  In\n\t\tthe name of the Holy Spirit, I\n\t\tswear he will never be a danger to\n\t\tyou...\n\nSuddenly, she reaches under her skirt, where she has hidden\na kitchen knife.\n\n\t\t\t\tWIDOW\n\t\t\t(continuing)\n\t\tBut I will kill you myself!\n\t\t\t(she lunges at the\n\t\t\tMafia chieftain)\n\t\tVitone, go!\n\nThe boy runs as fast as he can out through the gates.  Then\nthere is a lupara blast.  He turns, and sees his Mother\nflung a distance of five feet from the short range of the\nterrible blast of the shotgun.  Then he sees the men turn\ntheir attention to him.  One fires at him; but the boy is\nquick, and disappears into a grove of olive trees.\n\nEXT. STREETS OF CORLEONE - NIGHT\n\nTwo men roam the deserted streets of Corleone, carrying\nlupare.  Every so often, they stop, and one shouts in a\nloud, almost singsong voice, like a fish peddler.  Their\nnames are MOSCA and STROLLO.\n\n\t\t\t\tMOSCA\n\t\t\t(Sicilian)\n\t\tOur Friend promises misery to\n\t\tanyone who harbors the boy Vito\n\t\tAndolini.\n\t\t\t(he turns and shouts\n\t\t\tin the other direction)\n\t\tOur Friend promises misery to\n\t\tanyone who harbors the boy Vito\n\t\tAndolini.\n\nINT. A HOUSE - NIGHT\n\nA family quietly eats their dinner.  The father is the local\npoliceman, as indicated by his uniform jacket and gun,\nhanging nearby.\n\n\t\t\t\tSTROLLO\n\t\t\t(Sicilian, O.S.)\n\t\tOur Friend will be hard with any\n\t\tfamily who gives help to Vito\n\t\tAndolini.\n\nOne of the children looks up, about to speak.  But the\nfather sternly indicates that nothing must be said.  They go\non with their dinner.\n\nEXT. THE STREETS OF CORLEONE - FULL VIEW - NIGHT\n\nThe men continue walking up and throughout the streets, far\nin the distance.\n\n\t\t\t\tMOSCA\n\t\t\t(Sicilian O.S.)\n\t\t...misery to any family who harbors\n\t\tthe boy, Vito...\n\nINT. A BARN - NIGHT\n\nFour little girls watch with wide eyes as their mother and\nfather bind Vito tightly in swaddled cloth, and then lift\nhim up to the side of a mule; counter-balancing a heavy load\nof firewood.  The father looks at the boy's almost stoically\ncalm little face.\n\n\t\t\t\tFATHER\n\t\t\t(Sicilian)\n\t\tVito...We pray for you.\n\nHe pulls the fabric over the boy's face.\n\n\t\t\t\tMOSCA\n\t\t\t(Sicilian O.S.)\n\t\t...Andolini...\n\n\t\t\t\tSTROLLO\n\t\t\t(Sicilian O.S.)\n\t\tOur Friend promises misery to any\n\t\tfamily...\n\nEXT. THE CHURCH PLAZA - NIGHT\n\nThe men continue on their night-walk, up to the plaza of the\nchurch.\n\n\t\t\t\tSTROLLO\n\t\t\t(Sicilian)\n\t\t...who harbors the boy Vitone\n\t\tAndolini.\n\nThe figure of a single man on a mule passes them.\n\n\t\t\t\tMOSCA\n\t\t\t(Sicilian)\n\t\tLet no one give help to the boy\n\t\tVito Andolini...\n\nThe man on the mule makes his way out of the village and\ndisappears into the distance.\n\nWe begin to hear, very quietly, the Waltz repeated once again.\n\nEXT. STEAMSHIP - CLOSE VIEW ON VITO - DAY\n\nhuddled in blankets, on the deck of the ship in Steerage.\nHe does not say a word.  The Waltz grows louder as the VIEW\nALTERS, revealing the hundreds of immigrant families huddled\ntogether with all their earthly possessions on their way to\nAmerica.\n\nThen, suddenly, the Waltz stops.\n\nTHE NEW YORK HARBOR - DAY\n\nSILENCE.  We glide past the Statue of Liberty.\n\nVIEW on the IMMIGRANTS standing on shipboard silently;\nlooking.  Vito is standing with them, his eyes wide.\n\nCAMERA MOVES IN on the statue, then MOVING PAST, on to the\nbeautiful buildings of Ellis Island.\n\nEXT. ELLIS ISLAND - DAY\n\nA tugboat pulls a barge brimming with immigrants into the\nEllis Island harbor.  Uniformed officials of the Immigration\nService load them up toward the main building.\n\nINT. ELLIS PROCESSING HALL - DAY\n\nThe hundreds of immigrant families sit on rows of benches in\nthe great hall.  Various painted lines lead to the steps and\nprocessing rooms above.\n\nThere is the babble of many interviews going on\nsimultaneously, uncertainly, in different languages.\n\nVito is bundled in an old coat, with a large tag pinned on\nit: \"Vitone Andolini -- Corleone, Sicilia.\"\n\nHe stands, moves up in the line, when several other immigrant\nboys, older than he, rush up an push him back in the line.\nWeak from the trip, he falls to the floor.  The boys laugh,\nderisive in a language he cannot understand.  He struggles\nto his feet, lifting his makeshift bags; staring at them in\nan icy hatred.\n\nINT. PROCESSING ROOM - DAY\n\nThree or four interviews are crowded into the small room;\nthey are conducted in English.  From the expression on\nVito's face, and from the fragmented of the English, we\nrealize that he doesn't understand a word of it.\n\n\t\t\t\tOFFICIAL\n\t\t\t(English)\n\t\tWhat is your name?\n\nThe man waits, impatiently.\n\n\t\t\t\tOFFICIAL\n\t\tYour name?\n\nVito doesn't answer.  The Official pulls the tag pinned onto\nhis coat and copies to down on his form, using a typewriter.\n\n\t\t\t\tOFFICIAL\n\t\t\t(speaking as he types)\n\t\tVito...Corleone.  Step up, over\n\t\tthere.\n\nHe hands the form to another official.\n\nCLOSE VIEW on the form.  The name has been entered as Vito\nCorleone.\n\nINT. MEDICAL EXAM - DAY\n\nVito is stripped to the waist, as other immigrants wait.\n\nThe DOCTOR is just finishing his examination.  He shakes his\nhead, and then writes on the medical form.\n\n\t\t\t\tDOCTOR\n\t\tCan you understand me?\n\nVito stares blankly.\n\n\t\t\t\tDOCTOR\n\t\tYou understand?  Smallpox.  Smallpox.\n\nHe doesn't understand.  The doctor turns to the Immigration\nOfficial.\n\n\t\t\t\tDOCTOR\n\t\tQuarantine...six months.\n\nUNDERGROUND PASSAGEWAY - MOVING VIEW - DAY\n\nOfficials move a group of immigrant men, including Vito, to\nthe quarantine section of the Island.\n\nINT. QUARANTINE HALLWAY - DAY\n\nThe official stops at each doorway, and reads off a name.\n\n\t\t\t\tOFFICIAL\n\t\tSalvatore Ormenta.\n\nThe man moves into the room, and the group proceeds.\n\n\t\t\t\tOFFICIAL\n\t\tVito Corleone.\n\nNo one responds.  The guard moves to the boy, reads his new\nname tag.  And then, not unkindly:\n\n\t\t\t\tGUARD\n\t\tThat's you.\n\nHe opens the door, and Vito enters the room.\n\nEXT. THE STATUE OF LIBERTY - DAY\n\nThe VIEW slowly begins to pull back, revealing this to be\nthe view from inside the quarantine cell, where Vito stands\non his bench, looking out to the statue through the barred\nwindow.\n\nThen he turns, and sits in the corner.  He is silent for a\nlong time.\n\nThen, in a sweet, pure voice, he sings to himself in Sicilian.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. CATHOLIC CHURCH - MOVING CLOSE SHOT - DAY\n\nA nine year old boy, dressed immaculately in white, with a\nlarge white silk bow tied to his shoulder, moving slowly\ndown the aisle of the church with a group of other children\ndressed in white.  He has dark black hair, and his face is\nunmistakably similar to young Vito's.  He moves slowly, his\nhands clasped around a golden missal.  We HEAR only the pure\nvoice of Vito in Sicilian, his sad song reaching out from\nthe past, as ANTHONY CORLEONE, his Grandson, moves on the\nway to his First Holy Communion more than fifty years later.\n\nFULL VIEW\n\nThe little children move in procession down to the Altar,\nwhere the PRIEST raises the Host, and performs the Communion\nMass in Latin.\n\n\t\t\t\tPRIEST\n\t\tEcce Agnus Dei, ecce qui tollit\n\t\tpeccata mundi.\n\nMOVING VIEW ON THE PRIEST\n\nand Altar boys, as he moves along the row of kneeling\nchildren, blessing them, and administering their first\nCommunion.\n\nCLOSE MOVING VIEW\n\nas the innocent faces receive the Host; finally, the Priest\ncomes to Anthony.\n\n\t\t\t\tPRIEST\n\t\tCorpus Christi.\n\n\t\t\t\tANTHONY\n\t\tAmen.\n\nEXT. LAKE TAHOE ESTATE - DAY\n\nThe lawns of this great estate on the shore of Lake Tahoe\nare covered with guests of a wonderful party to honor the\nFirst Holy Communion of Anthony Corleone, the son of Mr. and\nMrs. Michael Corleone.  A full dance orchestra plays music\nof the times on a pavilion bandstand built especially for\nthe occasion.  Speedboats roar through the water, pulling\nyouthful waterskiers; and the pool and private harbor are\nfilled with laughing, swimming guests.  It is Fall of 1958.\n\nMED. VIEW\n\nAnthony, in his Communion suit sits alone at the table,\nlooking like a lonely young Prince.\n\n\t\t\t\tKAY (O.S.)\n\t\tSmile, Anthony.  Smile.\n\nHe does, and a flash goes off.\n\n\t\t\t\tPHOTOGRAPHER (O.S.)\n\t\tNow, one with the whole family.\n\n\t\t\t\tKAY (O.S.)\n\t\tMr. Corleone can't right now...\n\nKAY CORLEONE enters from the side, leading her four year old\ndaughter, MARY, and MAMA CORLEONE to pose with Anthony.\n\n\t\t\t\tKAY (O.S.)\n\t\t...but we'll get one with the ladies.\n\n\t\t\t\tPHOTOGRAPHER\n\t\tAll together now, c'mon, Anthony...\n\t\tCHEESE and\n\t\t\t(flash)\n\n\t\t\t\tKAY\n\t\tThank you.\n\nShe smiles as she leaves the photographer, and then lets out\na weary sigh to Mama, as she touches the slightly protruding\nbelly.\n\n\t\t\t\tKAY\n\t\tDo you think it'll show in the\n\t\tpicture?\n\n\t\t\t\tMAMA\n\t\tTwo months never shows.  Two months\n\t\tlook like you had a big lunch.\n\n\t\t\t\tVOICE (O.S.)\n\t\tOh, Mrs. Corleone.\n\nA slender, aristocratic WOMAN in her late forties is waving\nto KAY.\n\n\t\t\t\tMRS. BARRETT\n\t\tHello, Mrs. Corleone.  I'm Fran\n\t\tBarrett, our place is just down the\n\t\tlake.  This is my husband, Marshall.\n\n\t\t\t\tKAY\n\t\tI'm so happy you could come.\n\n\t\t\t\tMR. BARRETT\n\t\tThe place is transformed.  We've\n\t\tbeen watching workmen come and go\n\t\tall summer.\n\n\t\t\t\tMRS. BARRETT\n\t\tWhere is Mr. Corleone?\n\n\t\t\t\tKAY\n\t\tA business meeting ran late...but\n\t\the promised he wouldn't be long.\n\nKay puts her arm around little Anthony's shoulder.\n\n\t\t\t\tKAY\n\t\tThis is our son Anthony Vito\n\t\tCorleone.  Today he made his First\n\t\tHoly Communion.\n\nEXT. TAHOE GATE AND KENNELS - DAY\n\nA confusion of cars; arriving and parking.  The squad of\nparking attendants are supplemented by a whole team of the\nlocal Police, working as high-class parking valets.\n\nA very beautiful, statuesque woman, though slightly drunk,\nDEANNA DUNN, slams the door of a powder blue Mercedes and\nhurries barefoot through the great stone gate.\n\n\t\t\t\tDEANNA\n\t\tI will not shut my mouth, and keep\n\t\tyour Goddamn hands off of me!\n\nShe is followed by a harried, FREDDIE CORLEONE, dressed with\nflash in the Hollywood style, and carrying her shoes in his\nhands.\n\n\t\t\t\tFREDO\n\t\tHoney!  Wait a minute; let's go for\n\t\ta drive.\n\n\t\t\t\tDEANNA\n\t\tI just had a drive; besides, I want\n\t\tto see my brother-in-law Michael.\n\n\t\t\t\tFREDO\n\t\t\t(trying to get her to\n\t\t\tput her shoes on)\n\t\tYeah, but I don't want him to see\n\t\tyou.\n\nDeanna pauses reflectively a moment, allowing Fredo to get\nher shoes on.\n\n\t\t\t\tDEANNA\n\t\tWhat beats me, is how you guys\n\t\tcould be brothers.  You musta been\n\t\tyour Mother's rotten egg.\n\nShe kicks off the shoes, giggling, and runs toward a waiter.\n\n\t\t\t\tDEANNA\n\t\t\t(lifting a glass of champagne)\n\t\tYoung man, young man...thank you,\n\t\tyoung man.\n\n\t\t\t\tWAITER\n\t\t\t(impressed)\n\t\tExcuse me, but aren't you...\n\n\t\t\t\tDEANNA\n\t\tYes, you saw me in the movies, Good\n\t\tHumor man, and yes, I had more off\n\t\tthan my shoes!\n\n\t\t\t\tFREDO\n\t\tGoddamn bitch.\n\n\t\t\t\tDEANNA\n\t\tRelax, Freddie honey.  Come dance\n\t\twith me.\n\nShe extends her hand to him.\n\n\t\t\t\tFREDO\n\t\tListen, Michael's got a lot of nice\n\t\tpeople here.  Friends of Kay's.\n\t\tHe'll never forgive me if you ruin\n\t\this party.\n\n\t\t\t\tDEANNA\n\t\tI hate to see you cringe in front\n\t\tof him.  How come you're so scared\n\t\tof your own kid brother?\n\n\t\t\t\tFREDO\n\t\tHe's the head of the family.\n\nDisgusted, she turns around, and heads toward the music.\n\n\t\t\t\tDEANNA\n\t\tDon't follow me!\n\nEXT. TAHOE LAWN AND TABLES - MED. SHOT - DAY\n\nRushing through the tables, waving an arm jangling with gold\njewelry, and carrying several gift-wrapped packages, is a\nhardened and aging CONNIE CORLEONE.  She is followed by a\nblond, and wrinkled-handsome escort named MERLE.\n\n\t\t\t\tCONNIE\n\t\tMama...Mama!  Here I am!\n\nShe throws her arms around her Mother, who returns the\naffection somewhat reproachfully.\n\n\t\t\t\tMAMA\n\t\tConstanzia.  We expected you last\n\t\tweek; we sent the car to pick you\n\t\tup at the airport last week.\n\n\t\t\t\tCONNIE\n\t\tI know, it was chaos; but anyway,\n\t\there I am one week late.\n\t\t\t(lifting a shiny\n\t\t\tgreen package out of\n\t\t\tMerle's arms)\n\t\tThis is for my Mama.  You remember\n\t\tMerle?\n\n\t\t\t\tMAMA\n\t\t\t(not giving him a\n\t\t\tchance to greet her)\n\t\tYes, thank you.\n\n\t\t\t\tCONNIE\n\t\tHow are the kids?\n\n\t\t\t\tMAMA\n\t\tWell, thank you, they asked for you\n\t\tall week.\n\n\t\t\t\tCONNIE\n\t\tI got surprises for everybody!\n\n\t\t\t\tMAMA\n\t\t\t(glancing at the wrapping)\n\t\tBought at the airport.\n\n\t\t\t\tCONNIE\n\t\t\t(gazing about)\n\t\tThis is swell.  Where's Michael?\n\t\tI've got things to get straight\n\t\twith him and I can't wait on line.\n\n\t\t\t\tMAMA\n\t\tYou go see your children first, and\n\t\tthen you wait to see your brother\n\t\tlike everybody else.\n\nEXT. THE BOATHOUSE - DAY\n\nA porch-like foyer of the boathouse, where a group of five\nor six men wait, some nervously.  Some sit, and some pace.\n\nMED. CLOSE VIEW\n\non one of these men, FRANKIE PENTANGELI, approaching his\nsixties, with gray hair (the little of it left).  He's a bit\nscruffy, this morning's shave of his white beard is not\nperfect, and he seems tired.  He is accompanied by an\nassociate-bodyguard, WILLY CICCI; thin and dark, and also\ndressed up for the occasion.  Frankie tries to get the\nattention of one of the waiters; a college-groomed young man\nin white sports jacket and black bow-tie.\n\n\t\t\t\tPENTANGELI\n\t\tHey, kid!  You got any red wine?\n\n\t\t\t\tWAITER\n\t\t\t(offering the tray)\n\t\tOnly champagne and cocktails.\n\n\t\t\t\tPENTANGELI\n\t\tForget it...\n\nFinally, he sees someone he recognizes, Fredo, and shouts\nout in a husky voice:\n\n\t\t\t\tPENTANGELI\n\t\tFredo!  Sonuvabitch.  You look great.\n\nFredo squints in his direction; finally recognizes him.\n\n\t\t\t\tFREDO\n\t\tWho's that?  Pentangeli?  Frankie\n\t\t\"Five-Angels\"...thought you were\n\t\tnever coming West.\n\n\t\t\t\tPENTANGELI\n\t\t\t(affectionately)\n\t\tGotta check up on my boys.  Hey,\n\t\twhat's with the food?  Some kid in\n\t\ta white jacket brings me a ritz\n\t\tcracker with some chopped liver.\n\t\t'Canapes,' he says.  I say, 'Can a\n\t\tpeas, my ass, that's a ritz cracker\n\t\twith chopped liver.' Go get me a\n\t\tsalami sandwich and a glass of wine\n\t\tor I'll send you and your white\n\t\tjacket to the dry cleaners!\n\nThey get a good laugh at this fresh breath of New York.\n\n\t\t\t\tFREDO\n\t\tGee, Frankie, it's good to see you.\n\t\tReminds me of old times.\n\n\t\t\t\tPENTANGELI\n\t\tYou remember Willy Cicci, don't\n\t\tyou, Freddie?  We was all together\n\t\twith the old man Clemenza in\n\t\tBrooklyn... before...uh...\n\n\t\t\t\tFREDO\n\t\tWe were all upset about that.\n\n\t\t\t\tPENTANGELI\n\t\tThat's what I'm here to talk to\n\t\tyour brother about.  What's with\n\t\thim, I got to get a letter of\n\t\tintroduction to have a 'sitdown'?\n\n\t\t\t\tFREDO\n\t\t\t(throwing his arm\n\t\t\taround him)\n\t\tC'mon, I see what I can do.\n\nEXT. TAHOE PAVILION - MED. VIEW - DAY\n\nThe orchestra wears white summer sportcoats and black tuxedo\nslacks as they play a tango behind monogrammed music stands.\nA professional dance team, probably imported from Vegas,\ndance the tango for the excited guests.\n\nINT. TAHOE BOATHOUSE - DAY\n\nA large and very beautiful room overlooking the lake.  It is\ndominated by an enormous bar, behind which stands ALBERT\nNERI, discreetly in the background.\n\nMICHAEL CORLEONE sits on a large sofa, his back to us.\nStanding to one side is a tired and somewhat uneasy TOM\nHAGEN.  Standing before Michael is SANDRA CORLEONE, Sonny's\nwidow; her daughter, one of the twins, FRANCESCA CORLEONE,\nand a handsome young man of twenty, GARDNER SHAW.\n\n\t\t\t\tSANDRA\n\t\tMichael, this is Gardner Shaw.\n\t\tFrancesca and he have been seeing\n\t\teach other for six months now.\n\t\tGardner, this is Francie's Uncle\n\t\tMichael.\n\n\t\t\t\tGARDNER\n\t\t\t(a little nervous)\n\t\tI've heard a lot about you, Mr.\n\t\tCorleone.\n\n\t\t\t\tMICHAEL (O.S.)\n\t\tSit down.  Francie.\n\nThe couple sit themselves on the sofa opposite Michael.\n\n\t\t\t\tSANDRA\n\t\tThey would like to set an engagement\n\t\tdate, and...\n\n\t\t\t\tMICHAEL\n\t\tLet them speak for themselves.\n\nVIEW ON MICHAEL, calm, thoughtful.  One can tell that he has\nspecial affection for his niece.\n\n\t\t\t\tFRANCESCA\n\t\tWe love each other, Uncle Michael.\n\t\tAnd, we want to be married.  I came\n\t\tto ask for your blessing.\n\nThere is a loud KNOCKING on the door; then Fredo's voice.\n\n\t\t\t\tFREDO (O.S.)\n\t\tHey, Mike...guess who's here?\n\nNeri goes to answer it, cracks the door open.\n\n\t\t\t\tNERI\n\t\tNot now, Freddie...\n\n\t\t\t\tFREDO\n\t\tTell Mike Frankie 'Five-Angels' is\n\t\there.\n\n\t\t\t\tNERI\n\t\tNot now...\n\nNeri closes the door, and Michael looks at the nervous young\nman.\n\n\t\t\t\tMICHAEL\n\t\tFrancesca is my oldest brother's\n\t\tdaughter.  He died many years ago,\n\t\tand ever since I've felt much more\n\t\tof a father than an uncle.  I love\n\t\ther very much.  I'm pleased and\n\t\timpressed that you had the thought\n\t\tto come to me before going on with\n\t\tyour plans.  It shows me that\n\t\tyou're a considerate man, and will\n\t\tbe good to her.  What are you\n\t\tstudying in college?\n\n\t\t\t\tGARDNER\n\t\tMy major is Fine Arts, sir.\n\n\t\t\t\tMICHAEL\n\t\tHow will Fine Arts support your new\n\t\twife?\n\n\t\t\t\tGARDNER\n\t\tIt's embarrassing to say, sir, but\n\t\tI'm a major stockholder in the\n\t\tfamily corporation.\n\n\t\t\t\tMICHAEL\n\t\t\t(smiling)\n\t\tNever be embarrassed by your wealth.\n\t\tThis recent contempt for money is\n\t\tstill another trick of the rich to\n\t\tkeep the poor without it.\n\t\t\t(warmly)\n\t\tOf course I give you my blessing.\n\t\tLet's set the wedding soon...it\n\t\twill be my pleasure to give the\n\t\tbride away.\n\nThey all smile, and rise.\n\n\t\t\t\tMICHAEL\n\t\t\t(continuing)\n\t\t...and take a few courses in\n\t\tBusiness Administration just to be\n\t\ton the safe side!\n\nThey laugh; Michael moves toward them.  Francesca throws her\narms around him, and kisses her favorite uncle.  The flushed\nyoung man shakes his hand heartily.\n\n\t\t\t\tFRANCESCA\n\t\tThank you, Uncle Michael.\n\nThey all take their leave; Michael turns to Hagen.\n\n\t\t\t\tMICHAEL\n\t\tMake her dowry impressive.  He\n\t\tcomes from a family who still\n\t\tthinks an Italian bride goes\n\t\tbarefoot.\n\nEXT. TAHOE SWIMMING POOLS AND HARBOR - DAY\n\nFrancesca and Gardner are greeted by her twin sister and\ntheir young friends, who squeal and embrace at the good news.\nSomeone throws someone in the pool, and life is good.\n\nMED. CLOSE\n\nFrancesca kisses her Aunt Kay.\n\n\t\t\t\tFRANCESCA\n\t\tUncle Michael is the greatest man\n\t\tever!\n\nVIEW on Kay - happy for her niece.\n\nINT. TAHOE BOATHOUSE - DAY\n\nMichael sits in the darkened boathouse.  Tom Hagen paces.\nMichael is looking at photographs.  Neri stands over him.\n\nCLOSE ON MICHAEL\n\nstudying the pictures.\n\n\t\t\t\tNERI (O.S.)\n\t\tHis name is Fred Vincent.  He owns\n\t\ta small pizza parlor in Buffalo...\n\nCLOSE ON THE PICTURES\n\nSnapshots of a middle-aged man, handsome, Italian.  There is\nsomething familiar about him.\n\n\t\t\t\tNERI (O.S.)\n\t\t\t(continuing)\n\t\t...American wife and two small kids.\n\t\tWe traced him and found that he's\n\t\tin the country illegally, from\n\t\tSicily...\n\nMichael looks at another picture.  The same man.  Only\nyounger, and dressed in Sicilian shepherd's clothing.  We\nremember him as FABRIZZIO...Michael's traitorous bodyguard\nin Sicily.\n\n\t\t\t\tNERI (O.S.)\n\t\t...came over around 1956.  Sponsored\n\t\tby the Barzini Family.\n\nMichael puts the pictures down.\n\n\t\t\t\tMICHAEL\n\t\tIt's him.  Fabrizzio.\n\t\t\t(almost to himself)\n\t\tRevenge is a dish that tastes best\n\t\twhen it's cold.\n\n\t\t\t\tNERI\n\t\tHow do you want me to handle it?\n\nMichael glances at Hagen, who has been waiting in the room.\n\n\t\t\t\tMICHAEL\n\t\tLater.  Tom?\n\nHagen brings him a folder; then, as Michael glances through\nit:\n\n\t\t\t\tHAGEN\n\t\tI've cleared it through the\n\t\tSenator's chief aide, a man named\n\t\tTurnbull.  Turnbull's a heavy\n\t\tgambler, and into us for over a\n\t\thundred grand, so I figure his\n\t\tinformation is reliable.\n\nNeri moves to the bar, to prepare Michael a drink.\n\n\t\t\t\tHAGEN\n\t\tThe Senator can be set up; but he\n\t\tthinks of himself as a clean\n\t\tpolitician.  So it's got to be on\n\t\tterms he can live with: campaign\n\t\tcontribution, donation to a\n\t\tcharitable cause that he controls,\n\t\tthings like that.  If he gets even\n\t\tthe inkling that you think you're\n\t\tbuying him, he'll freeze up.\n\t\tNevada's a funny state, they like\n\t\tthings both ways here... All right.\n\t\tTurnbull says the Senator will be\n\t\there at two-thirty, and he's been\n\t\tprimed.  He knows you'll want to\n\t\tmeet with him alone, and he knows\n\t\tit's about the Tropicana's license.\n\t\tAt any rate, he expects to be\n\t\tintroduced around to some of the\n\t\tinfluential people here today, and\n\t\tgenerally treated as an ordinary\n\t\tguest.  Just go light on him,\n\t\tMikey, sometimes the biggest crooks\n\t\tdon't like to think of themselves\n\t\tas crooks...\n\nMichael glances at Hagen, as though that last remark was\nunnecessary.\n\n\t\t\t\tHAGEN\n\t\tI'm sorry; of course, you know that.\n\n\t\t\t\tMICHAEL\n\t\tTwo-thirty.  That gives me time to\n\t\tsee my boy.\n\n\t\t\t\tHAGEN\n\t\tConnie's outside.\n\nMichael doesn't want to see her.\n\n\t\t\t\tHAGEN\n\t\tI promised; she said it was urgent.\n\nMichael nods.\n\n\t\t\t\tMICHAEL\n\t\tAll right.  Apologize to Pentangeli.\n\nNeri opens the door; Hagen exits, and Connie steps in\nimpatiently, followed by Merle.\n\n\t\t\t\tMICHAEL\n\t\tI said I would see my sister, alone.\n\n\t\t\t\tMERLE\n\t\tI think this concerns me too.\n\t\t\t(taking a cigarette\n\t\t\tfrom the dispenser)\n\t\tYou don't, do you?\n\nConnie steps forward, kisses Michael on the cheek.\n\n\t\t\t\tCONNIE\n\t\tHow are you, honey?  You've met\n\t\tMerle, haven't you.  He was with me\n\t\tin Vegas.\n\n\t\t\t\tMICHAEL\n\t\tI saw him with you.\n\n\t\t\t\tCONNIE\n\t\tWe're going to Europe next week.  I\n\t\twant to get passage booked on the\n\t\tQueen.\n\n\t\t\t\tMICHAEL\n\t\tWhy do you come to me?  Why don't\n\t\tyou go to a travel agent?\n\n\t\t\t\tMERLE\n\t\tWe're going to get married first.\n\nMichael is silent.  Then he rises, and moves to the window\noverlooking the lake.\n\n\t\t\t\tMICHAEL\n\t\tThe ink on your divorce isn't dry.\n\t\tYour children see you on weekends;\n\t\tyour oldest boy, Michael Francis...\n\t\twas in some trouble with the Reno\n\t\tpolice over some petty theft that\n\t\tyou don't even know about.\n\n\t\t\t\tCONNIE\n\t\tMichael...\n\n\t\t\t\tMICHAEL\n\t\tYou fly around the world with lazy\n\t\tyoung men who don't have any love\n\t\tfor you, and use you like a whore.\n\n\t\t\t\tCONNIE\n\t\tYou're not my father!\n\n\t\t\t\tMICHAEL\n\t\tThen why do you come to me?\n\n\t\t\t\tCONNIE\n\t\tBecause I need MONEY!\n\n\t\t\t\tMICHAEL\n\t\t\t(softly)\n\t\tConnie, I want to be reasonable\n\t\twith you.  You have a house here,\n\t\twith us.  You can live here with\n\t\tyour kids...and you won't be\n\t\tdeprived of anything.  I don't know\n\t\tmuch about Merle; I don't know what\n\t\the does for a living; what he lives\n\t\ton.  Why don't you tell him marriage\n\t\tis really out of the question; and\n\t\tthat you can't see him any more.\n\t\tHe'll understand.  But if you\n\t\tdisobey me, and marry this pimp...it\n\t\twould disappoint me.\n\n\t\t\t\tCONNIE\n\t\tIt was my father's money; and I'm\n\t\tentitled to what I need.  Where is\n\t\tTom Hagen?\n\nShe turns angrily, leaving Michael standing face to face\nwith Merle.\n\n\t\t\t\tMICHAEL\n\t\tAre you finished?\n\n\t\t\t\tMERLE\n\t\tI think so.\n\n\t\t\t\tMICHAEL\n\t\tThen out.\n\nMerle puts out his cigarette and leaves, quickly.\n\nEXT. TAHOE PAVILION - FULL VIEW - DAY\n\nThe orchestra has struck up a \"Paul Jones,\" where two\nconcentric circles of young people march in opposite\ndirections, until the music stops.  Then they take whomever\nis opposite them as their new dance partner.\n\nVIEW ON THE HARBOR AREA\n\nFrancesca and her twin, Gardner and their elite young\nfriends roar out of the private harbor, to get up on the\nwater skis.  We notice ROCCO LAMPONE, move along a path\nleading to a separate and more private boathouse.  A small\ncovered craft approaches, ties off, and a group of three men\nstep on to the pathway, shake hands with Lampone - and\nfollow him to the large boathouse where Michael conducts his\nbusiness.\n\nCLOSE VIEW\n\nPentangeli has led Mama up to the dance floor, and is having\nsome difficulty with the orchestra.\n\n\t\t\t\tPENTANGELI\n\t\tI can't believe that out of thirty\n\t\tprofessional musicians, not one of\n\t\tyou is Italian!\n\t\t\t(as the musicians laugh)\n\t\tC'mon, give us a tarantella.\n\nHe waves his hands, conducting, and singing.  The piano\nstarts a vamp, the drums uncertainly join in.  A clarinet\nstarts to play \"Pop Goes the Weasel,\" and soon the rest of\nthe orchestra is playing that.  They look to Pentangeli for\napproval.  Disgusted, he goes back to his table, eating a\nhandful of canapes.\n\nINT. THE BOATHOUSE - DAY\n\nRocco ushers an older Italian, bundled up against the cold\nand wet of his boatride, to Michael.\n\nThe man shows respect to Michael, who quickly indicates that\nNeri should get him a drink.\n\n\t\t\t\tMICHAEL\n\t\tRocco, his friends must be hungry.\n\t\tSee what you can do, but I'd like\n\t\tto keep them away from the guests.\n\nThe older man, JOHNNY 'BLUE BOY' OLA, gestures to his\nbodyguards, and they follow Lampone.\n\n\t\t\t\tMICHAEL\n\t\tYou know my lawyer, Tom Hagen.\n\t\tJohnny Ola.\n\n\t\t\t\tOLA\n\t\tSure, I remember Tom from the old\n\t\tdays.\n\nTom shakes hands with Ola, remembering him, and his\nimportance.\n\n\t\t\t\tMICHAEL\n\t\tTom isn't going to sit in with us,\n\t\tJohnny.  He only handles specific\n\t\tareas of the family business.  Tom?\n\n\t\t\t\tHAGEN\n\t\tSure, Mikey.\n\nHe gathers up some of his papers, as the three men remain\nsilent, waiting for him to go before they talk.  It's clear\nTom doesn't want to be excluded.\n\n\t\t\t\tHAGEN\n\t\tIf you need anything, just...\n\n\t\t\t\tMICHAEL\n\t\tJust tell Rocco I'm waiting.\n\nHagen nods and leaves.  As soon as the door closes:\n\n\t\t\t\tOLA\n\t\tI just left our friend in Miami.\n\n\t\t\t\tMICHAEL\n\t\tHow is his health?\n\n\t\t\t\tOLA\n\t\tNot good.\n\n\t\t\t\tMICHAEL\n\t\tIs there anything I can do; anything\n\t\tI can send?\n\n\t\t\t\tOLA\n\t\tHe appreciates your concern,\n\t\tMichael, and your respect.\n\nThere's a KNOCK on the door; a moment, and then Rocco\nquietly enters and takes his place without disturbing the\nconversation.\n\n\t\t\t\tOLA\n\t\tThe hotel's registered owners are\n\t\tone Jacob Lawrence, and Sidney\n\t\tBarclay, both Beverly Hills\n\t\tattorneys.  In reality it's split\n\t\tbetween the Old Lakeville Road\n\t\tGroup from Cleveland, and our\n\t\tfriend in Miami.  He takes care of\n\t\tothers outside the country, you\n\t\tknow who I mean.  Meyer Klingman\n\t\truns the store, and does all right,\n\t\tbut I've been instructed to tell\n\t\tyou, that if you move him out, our\n\t\tfriend in Miami will go along with\n\t\tyou.\n\n\t\t\t\tMICHAEL\n\t\tHe's very kind, tell him it's\n\t\tappreciated.  I'm sure it will be\n\t\tprofitable all the way around.\n\n\t\t\t\tOLA\n\t\tHe always makes money for his\n\t\tpartners.  One by one, our old\n\t\tfriends are gone.  Death, natural\n\t\tor not, prison, deported.  Our\n\t\tfriend in Miami is the only one\n\t\tleft, because he always made money\n\t\tfor his partners.\n\nThe door opens suddenly, and standing there in his white\nCommunion suit, is Michael's boy Anthony.  A moment later,\nKay appears, and takes the boy's hand.\n\n\t\t\t\tKAY\n\t\tAnthony, Daddy's busy.\n\n\t\t\t\tMICHAEL\n\t\t\t(rising)\n\t\tThis is my boy, and my wife.  Mr.\n\t\tJohn Ola of Miami.\n\n\t\t\t\tKAY\n\t\tI'm sorry, Michael.  Senator\n\t\tGeary's here, and Mr. and Mrs.\n\t\tBarrett wanted to thank you before\n\t\tthey left.  Won't you join us, Mr.\n\t\tOla?\n\n\t\t\t\tMICHAEL\n\t\tMr. Ola's just leaving, Kay.\n\t\tPlease tell the Senator I won't be\n\t\ta minute.\n\nPause; she stands there a moment.\n\n\t\t\t\tMICHAEL\n\t\t\t(continuing)\n\t\tKay.\n\n\t\t\t\tKAY\n\t\tYes, Michael.\n\nEXT. THE BOATHOUSE - DAY\n\nKay closes the door.  It seems as though Michael has violated\nsome sort of promise to her by having this man here today.\nShe looks up toward the first boathouse.\n\nWHAT SHE SEES:\n\nThe covered launch, and Ola's three bodyguards, eating while\nthey wait.\n\nMED. VIEW\n\nAnthony runs away from her, heading toward the house.\n\n\t\t\t\tKAY\n\t\tAnthony!\n\t\t\t(she runs after him)\n\t\tAnthony, where are you going?\n\nMoodily, the boy stops, turns, and walks back to his table\nof honor without answering her.\n\nEXT. TAHOE TABLES AND PAVILION - VIEW ON THE PAVILION - DAY\n\nThe orchestra has taken its break; now two couples in formal\ndress are performing the Quartet from Rigoletto.\n\nVIEW ON HAGEN\n\nsitting by himself, a little down, having a drink.  He's\nwaiting for Michael to re-summon him.  SANDRA, Sonny's\nwidow, sits opposite him.\n\n\t\t\t\tHAGEN\n\t\tWhere's my wife?\n\n\t\t\t\tSANDRA\n\t\tWith Mama, putting the baby to\n\t\tsleep.  Francesca's very happy.\n\t\tMichael was kind to her.  She\n\t\tidolizes him.\n\t\t\t(pause; she looks at\n\t\t\ta despondent Hagen)\n\t\tThe children are all out in the\n\t\tspeedboat.  I'm going to my house.\n\nSandra gets up, still an attractive woman, and walks alone\nto the back path that leads to her home on the estate.\n\nVIEW ON THE PAVILION\n\nThe returned orchestra strikes a big, show-biz chord,\nintended to command the guests' attention.\n\nThe orchestra LEADER raises his hands for silence, and makes\nan announcement over the P.A. system.\n\n\t\t\t\tMAESTRO\n\t\tLadies and gentlemen, a most\n\t\tdistinguished guest would like to\n\t\tsay a few words: Senator and Mrs.\n\t\tPat Geary of the state of Nevada!\n\nA big hand, as the smiling SENATOR introduces his WIFE by\nholding her arm up to the crowd, and then proceeds alone to\nthe bandstand.\n\nMED. VIEW\n\nMichael stands with Kay and Mrs. Geary.  The Senator's\npresence seems to be a statement of political and social\nstatus.\n\nA little distance away, his beautiful son Anthony sits\nquietly, in an unmistakably morose mood.\n\nINT. TAHOE - SANDRA'S HOUSE - DAY\n\nWe HEAR the applause and whistles echoing in the distance.\nSandra stands in her bedroom, looking at the door.  We SEE a\nphotograph of SONNY, and also one of their wedding.\n\nA moment goes by, and then Tom Hagen enters, closing the\ndoor behind him.\n\nWe begin to HEAR Senator Geary's amplified voice resounding\nover the lake.  Hagen moves to Sandra.  She takes him in her\narms, comforting, holding his head against her full breast.\n\n\t\t\t\tHAGEN\n\t\t\t(quietly)\n\t\tHe doesn't want my help any more.\n\t\tHe doesn't need it.\n\n\t\t\t\tSANDRA\n\t\tWe don't know that's true, he never\n\t\tsaid that.\n\n\t\t\t\tHAGEN\n\t\tI can feel it in the way he talks\n\t\tto me.\n\nHe moves to the dresser; pours himself a drink.\n\n\t\t\t\tHAGEN\n\t\tJust now when Johnny Ola showed up,\n\t\the asked me to leave them alone.\n\t\tOla is Hyman Roth's Sicilian\n\t\tcontact.  I was on the inside of\n\t\tten, twenty meetings with him.  But\n\t\ttoday Mike asked me to leave, like\n\t\tan outsider.\n\n\t\t\t\tSANDRA\n\t\tTalk to him.  Tell him how you feel.\n\n\t\t\t\tHAGEN\n\t\tIt's as though he blames me for the\n\t\tground the family lost when I was\n\t\tConsigliere to Sonny.\n\nSandra pulls Hagen to her, and kisses him passionately on\nthe mouth.\n\n\t\t\t\tHAGEN\n\t\tI love Michael, I want to help him,\n\t\tbe close to him.  I don't want to\n\t\tend up a third string lawyer making\n\t\tproperty settlements for the hotels.\n\nSandra knows he needs her.  Slowly she begins to undress.\n\n\t\t\t\tSANDRA\n\t\tWe have a little time now.\n\nEXT. THE PAVILION - VIEW ON SENATOR GEARY - DAY\n\n\t\t\t\tSENATOR GEARY\n\t\t...my thanks, and the thanks of the\n\t\tyoung people of the State of\n\t\tNevada, for this most impressive\n\t\tendowment...\n\t\t\t(he holds a check in\n\t\t\this hand)\n\t\t...made to the University in the\n\t\tname of Anthony Vito Corleone.\n\t\tThank you, Mr. and Mrs. Michael\n\t\tCorleone.\n\nApplause.  Senator Geary returns the microphone to the\nMaestro who adds:\n\n\t\t\t\tMAESTRO\n\t\tAnd now, the Nevada Boys' Choir\n\t\thave prepared a special thank you\n\t\tfor Mr. Michael Corleone.\n\nHe turns to a small Choir Master, who leads the Boys' Choir\nin a choral arrangement of \"MR. WONDERFUL.\"\n\nVIEW ON SENATOR GEARY\n\nshaking hands with Michael, as Press Photographers snap\npictures, showing the check; showing a special award of\nGratitude from the State; Mrs. Corleone and Mrs. Geary; all\ntogether; Michael and his son; Senator Geary and Michael's\nson; and on and on.  In the midst of this:\n\n\t\t\t\tSENATOR GEARY\n\t\tWhere can we meet alone?\n\nMichael indicates the boathouse a distance away, where Neri\nseems to be waiting for them.  Then Michael leans to Rocco:\n\n\t\t\t\tMICHAEL\n\t\tFind Hagen.\n\nRocco sets off; as more pictures are taken, and the:\n\nBOYS' CHOIR\n\nsings its lovely arrangement of \"Mr. Wonderful.\"\n\nINT. TAHOE BOATHOUSE - MED. VIEW - DAY\n\nMichael, the Senator, Neri and Rocco make a group in the\ndark, large room.\n\n\t\t\t\tMICHAEL\n\t\tIt was very kind of you to come to\n\t\tmy home on this occasion, Senator.\n\t\tMy wife has been very concerned\n\t\twith making a good impression on\n\t\tthe people who are our neighbors,\n\t\tand your appearance here has made\n\t\ther very happy.  If I can ever\n\t\tperform a service for you, you only\n\t\thave to ask.\n\nThe door opens, and Hagen sheepishly makes his way in.\n\n\t\t\t\tMICHAEL\n\t\tMy lawyer, Tom Hagen.  He arranged\n\t\tthis all through your man Turnbull.\n\n\t\t\t\tSENATOR GEARY\n\t\tI thought we would meet alone.\n\n\t\t\t\tMICHAEL\n\t\tI trust these men with my life.\n\t\tThey are my right arms; I cannot\n\t\tinsult them by sending them away.\n\n\t\t\t\tSENATOR GEARY\n\t\t\t(taking out some medication)\n\t\tSome water.\n\nHe addresses that to Neri, who resentfully goes to fetch the\nSenator a glass of water.\n\n\t\t\t\tSENATOR GEARY\n\t\tAlright, Corleone.  I'm going to be\n\t\tvery frank with you.  Maybe more\n\t\tfrank than any man in my position\n\t\thas ever spoken to you before.\n\nMichael nods, indicating that he should do so.\n\n\t\t\t\tSENATOR GEARY\n\t\tThe Corleone family controls two\n\t\tmajor hotels in Vegas; one in Reno.\n\t\tThe licenses were grandfathered in,\n\t\tso you had no difficulties with the\n\t\tGaming Commission.  But I have the\n\t\tidea from sources...\n\t\t\t(takes the water from\n\t\t\tNeri and swallows his pills)\n\t\t...that you're planning to move in\n\t\ton the Tropicana.  In another week\n\t\tor so you'll move Klingman out,\n\t\twhich leaves you with only one\n\t\ttechnicality.  The license, which\n\t\tis now in Klingman's name.\n\n\t\t\t\tMICHAEL\n\t\tTurnbull is a good man.\n\n\t\t\t\tSENATOR GEARY\n\t\tLet's forget the bullshit, I don't\n\t\twant to stay here any longer than I\n\t\thave to.  You can have the license\n\t\tfor two hundred and fifty thousand\n\t\tin cash, plus a monthly fee equal\n\t\tto five percent of the gross...\n\nMichael is taken aback; he looks at Hagen.\n\n\t\t\t\tSENATOR GEARY\n\t\t...of all three Corleone hotels.\n\nHagen is frustrated; all his information was wrong.\n\n\t\t\t\tMICHAEL\n\t\tSenator Geary, I speak to you as a\n\t\tbusinessman who has made a large\n\t\tinvestment in your state.  I have\n\t\tmade that state my home; plan to\n\t\traise my children here.  The\n\t\tlicense fee from the Gambling\n\t\tCommission costs one thousand\n\t\tdollars; why would I ever consider\n\t\tpaying more?\n\n\t\t\t\tSENATOR GEARY\n\t\tI'm going to squeeze you, Corleone,\n\t\tbecause I don't like you; I don't\n\t\tlike the kind of man you are.  I\n\t\tdespise your masquerade, and the\n\t\tdishonest way you pose yourself and\n\t\tyour fucking family.\n\nVIEW ON HAGEN\n\nglances at Michael.\n\nVIEW ON MICHAEL\n\nmakes no outward reaction.\n\n\t\t\t\tMICHAEL\n\t\t\t(quietly)\n\t\tWe're all part of the same\n\t\thypocrisy, Senator.  But never\n\t\tthink it applies to my family.\n\n\t\t\t\tSENATOR GEARY\n\t\tAll right, then let me say you'll\n\t\tpay me because it's in your\n\t\tinterests to pay me.\n\nVIEW ON GEARY\n\nrising.\n\n\t\t\t\tSENATOR GEARY\n\t\tI'll expect your answer, with\n\t\tpayment, by tomorrow morning.  Only\n\t\tdon't contact me...from now on,\n\t\tdeal only through Turnbull.\n\nHe is almost out the door.\n\n\t\t\t\tMICHAEL\n\t\tSenator...\n\t\t\t(cold and calm)\n\t\t...you can have my answer now if\n\t\tyou'd like.\n\nGeary turns back.\n\n\t\t\t\tMICHAEL\n\t\tMy offer is this.  Nothing...not\n\t\teven the thousand dollars for the\n\t\tGaming Commission, which I'd\n\t\tappreciate if you would put up\n\t\tpersonally.\n\nGeary returns Michael's hard look; then laughs and leaves.\nSlowly Michael turns to Hagen.\n\nVIEW ON HAGEN\n\nembarrassed at being so off the mark.\n\n\t\t\t\tMICHAEL\n\t\tIt's all right, Tom, we'll talk\n\t\tlater.  Tell Frankie Pentangeli I'd\n\t\tlike him to have dinner at my\n\t\tfamily table before we do business.\n\nEXT. THE PAVILION - NIGHT\n\nNow the light has faltered, and the young waiters have put\nup the night lights.  The tables are all properly set for\ndinner, with candles on each one.\n\nThe orchestra is playing quiet, unobtrusive dinner music,\nand many of the guests have begun to help themselves to the\nimpressive buffet, under a party tent.\n\nMED. VIEW\n\nMichael sits at a large table with Kay, his son Anthony,\nMama, Hagen and TERESA, Connie and Merle' Fredo and Deanna,\nand Frankie Pentangeli.\n\n\t\t\t\tMAMA\n\t\tCent' Anne.\n\nThis, the table of honor, all raise their glasses and repeat\nthe toast.\n\n\t\t\t\tDEANNA\n\t\tWhat's 'cent' Anne?'\n\n\t\t\t\tFREDO\n\t\tA hundred years...it's a toast.\n\n\t\t\t\tCONNIE\n\t\tIt means we should all live happily\n\t\tfor one hundred years.  The family.\n\t\tIf my Father were alive, it'd be\n\t\ttrue.\n\n\t\t\t\tMAMA\n\t\tConnie.\n\n\t\t\t\tCONNIE\n\t\tMerle, have you met my sister-in-\n\t\tlaw Deanna?\n\n\t\t\t\tDEANNA\n\t\tWhat a pleasure, Merle.\n\t\t\t(shaking hands)\n\n\n\t\t\t\tMAMA\n\t\t\t(Sicilian)\n\t\tThose two are perfect for each other.\n\n\t\t\t\tMERLE\n\t\tWhat's that mean?\n\n\t\t\t\tCONNIE\n\t\tMama!\n\n\t\t\t\tPENTANGELI\n\t\t\t(Sicilian)\n\t\tMichael, in all respect, I didn't\n\t\tcome three thousand miles for dinner.\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tI know.\n\n\t\t\t\tPENTANGELI\n\t\t\t(Sicilian)\n\t\tWhen do we talk?\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tAfter dinner.\n\nBy now, the conversation has become exclusively Sicilian,\nwith Merle and Deanna, looking from side to side like in a\ntennis match.  Finally, Kay, to be polite:\n\n\t\t\t\tKAY\n\t\tAnthony, you were talking to Mr.\n\t\tPentangeli?\n\n\t\t\t\tANTHONY\n\t\tHis name is \"Five-Angels.\"\n\n\t\t\t\tPENTANGELI\n\t\tYeah, the kid and me talked Sicilian.\n\t\tA one-way conversation!\n\nINT. TAHOE BOATHOUSE - NIGHT\n\nPentangeli is angry; but because it is Michael he is talking\nto, he keeps his voice low and represses his desire to shout.\n\n\t\t\t\tPENTANGELI\n\t\tSure, Pete Clemenza died of a heart\n\t\tattack, but the Rosato Brothers\n\t\tgave it to him.\n\n\t\t\t\tMICHAEL\n\t\tWe were all heartbroken at the\n\t\tnews; but that wasn't cause to\n\t\tstart a war.\n\n\t\t\t\tPENTANGELI\n\t\tOkay, now it's my family in\n\t\tBrooklyn; and I wanna keep up\n\t\tClemenza's loyalty to you.  But how\n\t\tcan I run my family with you\n\t\tchallenging my every move?  You're\n\t\ttoo far from the street, Mike, the\n\t\tonly way to reason with the Rosato\n\t\tBrothers is to whack 'em and whack\n\t\t'em fast.\n\n\t\t\t\tMICHAEL\n\t\tYou were unfair with them.\n\n\t\t\t\tPENTANGELI\n\t\tSays who?\n\n\t\t\t\tMICHAEL\n\t\tClemenza promised Rosato three\n\t\tterritories in the Bronx after he\n\t\tdied, and then you took over and\n\t\twelched.\n\n\t\t\t\tPENTANGELI\n\t\tClemenza promised them nothing, he\n\t\thated the sonsuvbitches.\n\n\t\t\t\tMICHAEL\n\t\tThey feel cheated.\n\n\t\t\t\tPENTANGELI\n\t\tMichael, you're sitting up here in\n\t\tthe Sierra Mountains with champagne\n\t\tcocktails making judgment on the\n\t\tway I run my family.\n\n\t\t\t\tMICHAEL\n\t\t\t(suddenly in Sicilian)\n\t\tYour family still carries the name\n\t\tCorleone, and you will run it like\n\t\ta Corleone!\n\n\t\t\t\tPENTANGELI\n\t\t\t(Sicilian)\n\t\tAnd while I feed my family in New\n\t\tYork, you put the knife in my back\n\t\tin Miami.\n\n\t\t\t\tMICHAEL\n\t\t\t(firm)\n\t\tFrankie, you're a good old man, and\n\t\tyou've been loyal to my Father for\n\t\tyears...so I hope you can explain\n\t\twhat you mean.\n\n\t\t\t\tPENTANGELI\n\t\tThe Rosatos are running crazy;\n\t\ttaking hostages, spitting in my\n\t\tface, because they're backed by the\n\t\tJew in Miami.\n\n\t\t\t\tMICHAEL\n\t\tI know.  That's why I want you to\n\t\tbe fair with them.\n\n\t\t\t\tPENTANGELI\n\t\tHow can you be fair with animals?\n\t\tThey recruit niggers and spicks;\n\t\tthey do violence in their own\n\t\tGrandmother's neighborhoods.  And\n\t\teverything is dope and whores; the\n\t\tgambling is left to last.  Let me\n\t\trun my family without you on my\n\t\tback.  I want them taken care of.\n\n\t\t\t\tMICHAEL\n\t\tNo.  There are things that I have\n\t\tplanned with Hyman Roth.  I don't\n\t\twant them disturbed.\n\n\t\t\t\tPENTANGELI\n\t\tYou give your loyalty to a Jew over\n\t\tyour own blood.\n\n\t\t\t\tMICHAEL\n\t\tFrankie, you know my father\n\t\trespected Roth, did business with\n\t\thim.\n\n\t\t\t\tPENTANGELI\n\t\tHe did business...but he never\n\t\ttrusted him.\n\nPentangeli takes his hat, and leaves.\n\n\t\t\t\tNERI\n\t\tShould he go?\n\n\t\t\t\tMICHAEL\n\t\tThe old man had too much vino\n\t\trosso, or he'd never talk openly\n\t\tthat way.  Let him go back to New\n\t\tYork; I've already made my plans.\n\t\t\t(he checks his watch)\n\t\tIt's late; I've spent so little\n\t\ttime at the party.\n\nEXT. THE LAWNS AND TABLES - FULL VIEW - NIGHT\n\nBy now the sun has fallen and the lawns of the Corleone\nestate are lit by moonlight.  Beautifully dressed couples\ndance as the orchestra plays a foxtrot of the late fifties.\n\nVIEW ON THE DANCE FLOOR\n\nDeanna has been dancing with Fredo; she has gotten drunk and\nit teasing her husband by flirting with other men on the\nfloor.\n\n\t\t\t\tDEANNA\n\t\tI wanta dance...whatsa matter with\n\t\tthat?\n\n\t\t\t\tFREDO\n\t\tDancing is alright; you're falling\n\t\ton the floor.\n\n\t\t\t\tDEANNA\n\t\tWhatsamatter, you don't want me to\n\t\tdance with him 'cause he's a man!\n\n\t\t\t\tFREDO\n\t\tDeanna, I'm going to belt you right\n\t\tin the mouth!\n\n\t\t\t\tDEANNA\n\t\tThese Eye-ties are really crazy\n\t\twhen it comes to their wives.\n\nBy now guests are starting to notice the disturbance;\nMichael is with Kay, and some friends; Rocco catches his eye.\n\n\t\t\t\tDEANNA (O.S.)\n\t\tJesus, never marry a WOP, they\n\t\ttreat their wives like shit.\n\nVIEW on Kay, listening, embarrassed by her flashy sister-in-\nlaw.\n\nVIEW ON FREDO AND DEANNA\n\nRocco passes by Fredo and whispers:\n\n\t\t\t\tROCCO\n\t\tFreddie, Mike says take care of it,\n\t\tor I have to.\n\n\t\t\t\tDEANNA\n\t\tHe's a friend of your brother!\n\nWithout another word, Rocco grabs firm hold of her and\nwhisks her out of the crowd.\n\n\t\t\t\tDEANNA\n\t\t\"Shuffle off to Buffa...\n\t\tShuffle off to Buffa...\n\t\tShuffle off to Buffalooooo...\"\n\nFreddie mops his forehead, and moves to Michael.\n\n\t\t\t\tFREDO\n\t\tHey Mike, what can I say?\n\n\t\t\t\tMICHAEL\n\t\tForget it, just go take care of her.\n\nEXT. THE HARBOR DECK - NIGHT\n\nA large group of Tahoe teenagers join the Corleone youngsters\nsitting around a large fire out by the harbor.  Gardner and\nFrancie, sitting arm in arm.\n\nEXT. TABLE OF HONOR - MED. VIEW - NIGHT\n\nLittle Anthony, in his white suit, sitting alone.\n\nEXT. MAIN GATE - NIGHT\n\nA taxi pulls up, and is signaled over to the gate by a\npoliceman carrying a torch flashlight.\n\nConnie and Merle enter; Merle tips the cop, and the cab\ndrives off.\n\nEXT. DANCE FLOOR AND PAVILION - MOVING TWO SHOT - NIGHT\n\nKay and Michael dancing in the moonlight.\n\n\t\t\t\tMICHAEL\n\t\tHow's the baby?\n\n\t\t\t\tKAY\n\t\tSleeping inside me.\n\n\t\t\t\tMICHAEL\n\t\tDoes it feel like a boy?\n\n\t\t\t\tKAY\n\t\tYes, Michael, it does.\n\n\t\t\t\tMICHAEL\n\t\tI'm sorry about some of the people\n\t\tI had to see today.  It was bad\n\t\ttiming... but it couldn't be helped.\n\n\t\t\t\tKAY\n\t\tIt made me think of what you told\n\t\tme once.  In five years, the\n\t\tCorleone family will be completely\n\t\tlegitimate.  That was seven years\n\t\tago.\n\nHe has no answer for her; except that he loves and values\nher, and holds her tight, as they dance amid their guests,\nall dressed elegantly for the social event of the season.\n\nThe VIEW LOOSENS to show the entire, night-lit party.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. LAS VEGAS CHAPEL - MED. CLOSE VIEW - NIGHT\n\nA Cadillac limousine waits for some people inside the tacky,\nLas Vegas marriage mill.\n\nINT. THE CHAPEL - NIGHT\n\nSome quiet, informally dressed couples wait in the rear of\nthe chapel; some talking, others sitting nervously.\n\nA single organ plays some standard wedding music.\n\nThe VIEW PANS up to the altar, where Connie and Merle, in\nthe same clothing they wore to the Tahoe party, are being\nmarried by a Justice of the Peace.\n\nThe Justice goes through the bored, simple ceremony, and we\nbegin to HEAR an echo of the waltz Connie danced with her\nfather, when she was married all those years ago in Long\nIsland.\n\nEXT. THE TROPICANA - LAS VEGAS - MED. VIEW - DAY\n\nA dark car pulls up to the glitter of the neon facade.\nAlbert Neri, alone, leaves it to the parking valets, and\nmoves quickly through the automatic doors, into the main\ncasino.  We still hear the CORLEONE WALTZ.\n\nINT. THE TROPICANA - DAY\n\nAlbert Neri enters the room; glances around a moment, and\nthen heads toward the crap table, where a short, middle-aged\nman, KLINGMAN, stands by the pit boss.  Several security\nguards of the casino, are at their posts.\n\n\t\t\t\tNERI\n\t\tAre you Klingman?\n\n\t\t\t\tKLINGMAN\n\t\tWho's asking?\n\n\t\t\t\tNERI\n\t\tWhere can we talk?\n\n\t\t\t\tKLINGMAN\n\t\tRight here.\n\n\t\t\t\tNERI\n\t\tI represent the interests of the\n\t\tCorleone family.  We make the\n\t\tinvitation to you to tie up your\n\t\taffairs and be out of the hotel by\n\t\tMonday morning.\n\n\t\t\t\tKLINGMAN\n\t\tWho do you think you're talking to?\n\n\t\t\t\tNERI\n\t\tYou said you were Klingman.\n\n\t\t\t\tKLINGMAN\n\t\tYou don't come in here, talk to an\n\t\towner in Las Vegas like that.\n\n\t\t\t\tNERI\n\t\tYou missed my point; you are no\n\t\tlonger an owner.\n\n\t\t\t\tKLINGMAN\n\t\tGet out of my hotel.\n\nNeri stands in front of him, smiling.\n\n\t\t\t\tKLINGMAN\n\t\tBoys, get him out of here.\n\nQuickly, Neri moves toward Klingman, and slaps him hard\nseveral times in the face, knocking off his glasses... Red-\nfaced, Klingman gets down on his knees to pick them up once,\nagain.  Glasses on, he looks to his guards.\n\nWHAT HE SEES\n\nThey stand, motionless.\n\nVIEW ON KLINGMAN\n\nHumiliated, Klingman moves across the casino floor, past a\nfew interested gamblers, and his own people.  Neri slowly\nfollows.\n\nINT. SHOWROOM - MED. VIEW - DAY\n\nA typical, Lido de Paris type of show is in rehearsal, as\nKlingman backs into the showroom.\n\nHIS VIEW\n\nNeri keeps coming.\n\nVIEW ON KLINGMAN\n\nrealizes that no one will help him.  He finally capitulates.\n\n\t\t\t\tKLINGMAN\n\t\tAll right!  All right, I'll be out.\n\nNeri keeps moving, then heads past the terrified man, sits\ndown at a table, and looks up at the stage.\n\n\t\t\t\tNERI\n\t\t\t(to the staring performers)\n\t\tKeep it going.\n\nEXT. A STREET IN BUFFALO, NEW YORK - NIGHT\n\nThe neon lights that spell out \"FRED'S PIZZERIA\" go out;\nafter a moment a man in an overcoat steps out, and turns to\nlock the door of his restaurant.  The Corleone Waltz\ncontinues over this.  He turns.\n\nMED. CLOSE VIEW\n\nFRED VINCENT, whom we remember as the Sicilian Fabrizzio.\nHe moves toward his parked car.  Gets in.\n\nMED. LONG VIEW\n\nThe starter turns, and the automobile blows in a great\nexplosion.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. THE TAHOE ESTATE - NIGHT\n\nThe waltz continues over the VIEW of the empty, but still\nilluminated pavilion.  There is the debris of the great\nparty spread over the grounds, which a silent crew of\nworkmen are at work cleaning up,\n\nMED. VIEW\n\nMichael walks alone, followed by two of the family dogs,\nIrish Setters.\n\nHe walks to the water line, and looks out across the lake.\nHe picks up a stick, and throws it for the dogs; who go\nscampering after it.\n\nWe notice that a respectful distance away, there are\nbodyguards watching every move he makes.\n\nCLOSE VIEW ON MICHAEL\n\nlooking across the lake.  There is much on his mind.  The\nSOUND of the waltz, begins to segue into the echoed music\nand laughter of an old Italian Music Hall from the past.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. NEW YORK THEATRE - 1915 - NIGHT\n\nVITO CORLEONE is a shy young man of 23, holding his hat in\nhis hand, being led down the crowded aisle of this Italian\nVaudeville theatre by an energetic and fulfilled GENCO\nABBANDANDO, his friend in America.  This entire sequence is\nplayed in Sicilian.\n\n\t\t\t\tGENCO\n\t\tCome on, you've got to see her!\n\nVIEW ON THE STAGE\n\nA tattered melodrama is in progress in Neapolitan.  The sets\nare two-dimensional, and flap whenever there's an entrance\nor exit.\n\nThe hero, PEPPINO, is weeping as he sings about how he's\nleft his Mother in Italy, while he is in this new country,\nAmerica.\n\nVIEW ON THE AUDIENCE\n\nAll poor, Italo-Americans.  Genco finds a few seats, and\nleads Vito to them, stepping on a few shoes in the process.\nThey have barely come to their seats, when an excited Genco\nnudges Vito, and points to the stage.  People shout that\nthey should sit down.\n\nVIEW ON THE STAGE\n\nThere is a knock on the door, and a young girl enters,\ndelivering a letter to Peppino in his tenement in America.\nThe girl is pretty; and obviously the object of Genco's\naffection.  The letter brings bad news.  Peppino's Mother is\ndead.  He weeps, and sings the final song, which most of the\naudience knows: SENZA MAMMA.\n\nVIEW ON THE AUDIENCE\n\nGenco is enthralled with the young actress.  The people in\nthe audience are singing along with Peppino.\n\nVIEW ON THE STAGE\n\nThe actress, object of Genco's affection, makes a dramatic\nexit.\n\nVIEW ON THE AUDIENCE\n\nGenco pulls on Vito's jacket, indicating that now that his\nlove is offstage, they should leave.  Vito rises with him,\nand they make their way all the way down the aisle.\n\nINT. BACKSTAGE THEATRE - MOVING VIEW - NIGHT\n\nGenco hurrying down the backstage corridor, hoping to catch\na glimpse of the actress.  He is followed by Vito.  Suddenly,\nGenco stops short.\n\nGENCO'S VIEW\n\nA heavy-set, fierce looking Italian wearing an expensive\nlight-colored suit and a cream colored fedora.  This is\nFANUCCI.  He is discussing a business matter with the\ntheatre IMPRESARIO; a large, strong looking man, who is\nsweating nonetheless.  He doesn't seem to be giving in to\nFanucci.  He holds a locked strongbox.\n\nVIEW ON VITO\n\nwatching.  The two men argue in Italian.\n\nMED. VIEW\n\nThe young ACTRESS crosses into the area, unaware of the\ndifficulties.  The impresario sees her, and frightened,\nmotions that she should keep away.\n\n\t\t\t\tIMPRESARIO\n\t\tCarla!\n\nBut Fanucci grabs her easily by her slender wrist, and with\nlightning speed, produces a knife which he holds against her\ncheek.  The impresario wrings his hands in agony.\n\n\t\t\t\tIMPRESARIO\n\t\t\t(Sicilian)\n\t\tNo...please, not my daughter.\n\nWhereupon he begins to unlock the box which holds the\nreceipts for the night's box-office.\n\nVIEW ON GENCO AND VITO\n\nhiding, watching.  At first, Genco is enraged, as though he\nwould rush up to help his enamorata.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tThe Black Hand.\n\nThen he backs away.  Vito looks at him shocked and\ndisappointed in this cowardly behavior.  Genco shakes his\nhead, and points, as though to say that where Fanucci is\nconcerned, there is nothing to be done.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\t\t (whispered)\n\t\tLet's get out of here.\n\nVIEW ON FANUCCI\n\nhas released the girl.  Her father pulls her away from him,\nand slaps her for no reason; then he pays Fanucci.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tBecause you protested, it will cost\n\t\ta hundred more.\n\nEXT. NEW YORK ALLEY - NIGHT\n\nGenco and Vito; Genco leans against the wall, breathlessly,\nas though he's had a near escape.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tI know what you are thinking,\n\t\tVitone, but you don't understand\n\t\tyet how things are.  Fanucci is of\n\t\tthe Black Hand.  Everyone in the\n\t\tneighborhood pays him, even my\n\t\tfather.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tHe's an Italian?\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tA pig of a Neaponitan.\n\t\t\t(spits)\n\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWhy?  Why does he bother other\n\t\tItalians?\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tBecause he knows them; he knows\n\t\tthey have no one to protect them.\n\t\tVitone?  What do you think of my\n\t\tangel?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tBeautiful.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tBeautiful.\n\n\t\t\t\tVITO\n\t\tFor you, she is beautiful.  For me,\n\t\tthere is only my wife!\n\n\t\t\t\tGENCO\n\t\tI know.  That's why I brought you\n\t\twith me!\n\nGenco embraces his good friend, and they laughingly walk\ndown the alley.\n\nThe stage door opens, and Fanucci exits, a sinister figure\nin white, moving down the alley just in front of them, into\nthe night.\n\nThe two friends hold their breath, until he disappears.\n\nEXT. NEW YORK STREETS - MOVING VIEW - DAY\n\nVito moves through the street, carrying groceries that he is\nto deliver.\n\nIt is cold, and so vendors are huddled around fires they\nhave lit in old cans and drums.\n\nHe turns up an alleyway, and then stops.\n\nVIEW UP THE ALLEY\n\nWith great strength, Fanucci lifts one of them up into the\nair and throws him down hard to the concrete; but another,\nholding onto his back, manages to produce a switchblade\nknife and awkwardly reaching around from behind the moving\nman, slits Fanucci's throat from one side to the other.\n\nFanucci groans like some great hurt animal.  Blood pours\nfrom the deep, smile-like slit in his throat.\n\nHe throws the young man off his back.\n\nVIEW ON VITO\n\nstepping back in the alley.\n\nVIEW ON FANUCCI\n\nHe takes off his white fedora, and runs down the alley\ntoward Vito, catching the flowing blood in his hat.\n\nThe young attackers scurry off in various directions.\n\nINT. ABBANDANDO GROCERY STORE - DAY\n\nA tiny shop featuring imported food: trays of cured meats,\nprosciutto, copagole, mortadella lies on the counter covered\nwith netting to keep away the thousands of flies.\n\nOlive oil is sold in bulk, as well as wine, cheese and bacala.\n\nGenco works here for his father, and is busy slicing paper\nthin prosciutto for a customer, by hand.  Vito works in the\nback as a stock clerk.\n\nFinished with his customer, Genco moves to his friend.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tI bet you can't guess what happened?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWhat?\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tSome guys from Ninth Avenue jumped\n\t\tFanucci today; slit his throat from\n\t\tear to ear.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tNo, I didn't know.  Is he dead?\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tNah.  Those guys aren't murderers.\n\t\tThey wanted to scare him, that's\n\t\tall.  Make him look bad.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tIn Sicily, when you attack a man,\n\t\tyou had better finish him.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tI wish they had.  He takes fifty\n\t\tdollars a week from my father's\n\t\tcash drawer.  But you can't kill a\n\t\tman like Fanucci.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWhy?\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tBecause he's what we say...\n\t\t\"connected\"... You wait, see what\n\t\thappens to those guys from Ninth\n\t\tAvenue.\n\nA customer enters; and Genco moves away to serve him.\n\nCLOSE VIEW ON VITO\n\nrecalling what he had seen and thought.\n\nEXT. NEW YORK ALLEYWAY - MED. VIEW - NIGHT\n\nA young man, one of those who had tried to kill Fanucci,\nruns down an alleyway, breathlessly.  Then he stops, and\nlooks behind himself.  Whoever was following him is gone.\nHe turns and walks ahead.  Then the mammoth, white-suited\nfigure of Fanucci leaps down before him from the fire-escape.\nHe grins at the young man, and then raises his neck, showing\nthe gruesome wound that marks his throat.\n\nHe takes out his pistol and fires point-blank at his attacker.\n\nINT. TINY TENEMENT - FULL VIEW - NIGHT\n\nThe very small, railroad type flat where Vito lives with his\nnew family.\n\nIt is late at night, and he is exhausted.\n\nHe returns home; where his young wife, CARMELLA, goes\nthrough the silent ritual of preparing a simple meal for him.\nHe sits and eats quietly.\n\nINT. TENEMENT ROOM - NIGHT\n\nVito and Carmella enter the darkened bedroom, and approach a\nmetal crib.  Vito reaches down and takes the small hand of\nthe baby between his thick peasant fingers.  Carmella waits\na respectful distance behind him.\n\nINT. ABBANDANDO GROCERY - DAY\n\nThe shop bell RINGS; SINGER ABBANDANDO turns to see a\nsmiling Fanucci tipping his hat, like an old customer.\n\n\t\t\t\tFANUCCI\n\t\tBuon giorno.\n\nImmediately, Vito turns back to his work, and Signor\nAbbandando moves to Fanucci with a sigh.\n\nVito notices the two men talking quietly at one side of the\nstore, while he goes about his work.  Genco works his way\ncloser to his friend.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tWhat did I tell you.  The one who\n\t\tcut him was found in an alley.  And\n\t\tthe family of the others paid\n\t\tFanucci all their savings to make\n\t\thim forswear his vengeance.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\t\t (surprised)\n\t\tAnd he agreed?\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tHe took the money.  Now he wants\n\t\tdouble from everybody in the\n\t\tneighborhood, including Papa.\n\nVito watches the heated, but inevitable transaction.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\t\t (almost to himself)\n\t\tA real mafioso doesn't sell his\n\t\tvengeance.\n\nMED. VIEW\n\nSignor Abbandando seems to be arguing with Fanucci, and\nevery so often they turn and relate to where Vito is working.\nThen Fanucci leaves, the little bell RINGING; and Signor\nAbbandando reluctantly moves to Vito.\n\n\t\t\t\tSIG. ABBANDANDO\n\t\t\t(Sicilian)\n\t\tVitone.  How is your son?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWe are all well.\n\nIt is clear that he has something difficult to tell the\nyoung man.\n\n\t\t\t\tSIG. ABBANDANDO\n\t\tVitone...I...Fanucci has a nephew.\n\nVito looks at him a while, as the old man struggles to tell\nhim.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tAnd you must give him my job.\n\nThe old man nods, regretfully.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tYou have been kind to me since I\n\t\twas a boy; taken care of me, and\n\t\tbeen as a father.  I will always be\n\t\tgrateful to you.  Thank you.\n\nVito takes off his apron, and leaves, passing the youth who\nloiters by the counter.\n\nEXT. THE STREET - DAY\n\nmaking his way from the store.\n\n\t\t\t\tSIG. ABBANDANDO\n\t\t\t(Sicilian o.s.)\n\t\tVitone!\n\nHe turns, and Abbandando has followed him out of the shop,\nholding a basket of some groceries.\n\n\t\t\t\tSIG. ABBANDANDO\n\t\tHere...for your family.\n\n\t\t\t\tVITO\n\t\tNo...please understand...I cannot\n\t\taccept.\n\nINT. VITO'S TENEMENT - MED. VIEW - NIGHT\n\nVito and his wife sit quietly at the table; the two are\nquiet and sad.\n\nSuddenly, we HEAR a noise, and Vito is astonished to see a\nyoung man, PETER CLEMENZA, leaning out of the window on the\nother side of the air shaft which separates their apartments.\n\n\t\t\t\tCLEMENZA\n\t\tHey Paisan!  Hold this for me until\n\t\tI ask for it.  Hurry up!\n\nAutomatically Vito reaches over to the empty space at the\nair shaft, and takes the bundle of rags.  Clemenza's round\nface is strained and urgent, obviously in some kind of\ntrouble.  Suddenly, he closes the window and there is\nactivity that we cannot see in the other apartment.\n\nVito looks to his wife, and then closes the window and\nwindow dressing and takes the bundle into a private part of\nhis kitchen and begins to unwrap it.\n\nWHAT HE SEES:\n\nFive oily guns.  He immediately wraps them again, and\ncarries them to a private closet, and hides it, and returns\nto his wife.  He sits down back at the table; and she knows\nnot to ask him what has happened.\n\nEXT. NEW YORK STREETS - DAY\n\nVito is walking through the crowded streets with a group of\nworkmen; they all wear work clothes, and paper hats on their\nheads.\n\nVito looks to his left, and realizes that Clemenza is\nwalking silently with him; by contrast, Clemenza dresses well.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\t\t (casually)\n\t\tDo you have my goods still?\n\nVito nods.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tDid you look inside?\n\nVito, his face impassive, shakes his head 'no.'\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tI'm not interested in things that\n\t\tdon't concern me.\n\nINT. DOWNTOWN ITALIAN SOCIAL CLUB - DAY\n\nVito and Clemenza drinking wine; they've become friends.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tI have a friend who has a fine rug.\n\t\tMaybe your wife would like it.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWe have no money for a rug.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tNo.  He would give it away.  I know\n\t\thow to repay a consideration.\n\nVito thinks, then nods.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tShe would like it.\n\nINT. HALLWAY WEALTHY APARTMENT BUILDING - DAY\n\nThe two men proceed up the hallway; Vito is impressed with\nthe opulence.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tYour friend lives in a fine building.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tOh yes, the very best.\n\nClemenza knocks on the door as though he is well known here;\nthen rings.  No answer.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tAh, he's not at home.  Oh, well, he\n\t\twouldn't mind.\n\nQuickly and expertly he takes out a tool and pries open the\ndoor.\n\nINT. WEALTHY APARTMENT - FULL VIEW - DAY\n\nVito looks in awe at the luxurious apartment, which features\na fabulous rich red wool rug.\n\nClemenza immediately moves some of the furniture away, and\ndrops to the floor.\n\n\t\t\t\tCLEMENZA\n\t\tA little help.\n\nVito joins him, and the two begin rolling the rug.  We HEAR\na BUZZER RING.  Clemenza immediately drops his side of the\nroll, and moves to the window.  He pulls a gun from his\njacket.\n\nVIEW ON Vito watching.  He moves so he can see out the window.\n\nTHEIR VIEW\n\nA Policeman stands at the exterior door, waiting.  He rings\nthe buzzer again.\n\nVIEW ON CLEMENZA\n\ncocking his gun.  Vito realizes that if the Policeman should\npursue it any further he is a dead man.  The Policeman gives\nup and leaves.\n\nClemenza puts away his gun.\n\nINT. VITO'S TENEMENT HALLWAY - DAY\n\nThe two men run up the steps, laughing, carrying the fine rug.\n\nINT. VITO'S TENEMENT - DAY\n\nThey are on their knees cutting the rug to fit the small\nroom.  Carmella watches, holding the baby SANTINO.\n\nMED. CLOSE ON CLEMENZA\n\nLike a professional, cutting quickly, with the proper tools.\nHe sings as he works.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. DOWNTOWN WAREHOUSE - NIGHT\n\nClemenza knocks on the steel door of this downtown building.\nVito waits with him, holding some packages; and another\nyouth, TESSIO, tall and thin and deadly waits with them.\n\nThe door is lifted, and they are greeted by a bright,\nmiddle-aged Italian named AUGUSTINO who leads them into a\nmachine shop.\n\nINT. MACHINE SHOP - NIGHT\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tGood, you waited for us.\n\nClemenza looks up on a higher level.\n\nHIS VIEW\n\nThere is a nine year old boy, operating a drill press.\n\nMED. VIEW\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tWho is he?\n\n\t\t\t\tAUGUSTINO\n\t\t\t(Sicilian)\n\t\tMy son, Carmine...it's all right.\n\nThe men then quickly open the packages they've brought;\nrevealing gun, including a more sophisticated machine weapon.\n\nAugustino takes them and expertly begins to clean and\nprepare them.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\t\t (to Vito)\n\t\tPaisan Augustino was a gunsmith in\n\t\tthe Italian army.  We do each other\n\t\tfavors.\n\n\t\t\t\tAUGUSTINO\n\t\t\t(Sicilian)\n\t\t\t (while he works)\n\t\tMy boy is studying the flute.  He\n\t\tplays very well.  He helps me at\n\t\tnight so we can buy him a silver\n\t\tflute someday.  Now he has one made\n\t\tof wood.  Carmine...play...play for\n\t\tmy friends.\n\nVIEW ON THE BOY\n\nwide-eyed... he shuts off the press; and takes out a shabby\nwooden flute.  And begins to play a simple and pure melody.\n\nCLOSE ON VITO\n\nlistening.\n\nCLOSE ON AUGUSTINO\n\nproudly smiling, as he prepares the machine gun.\n\nCLOSE ON TESSIO\n\nlistening, smiling.\n\nFULL VIEW\n\nThe men listening, as the boy's father prepares their guns.\n\nEXT. WAREHOUSE AREA - NIGHT\n\nTessio and Clemenza quickly load racks of cheap dresses.\n\nVito sits behind the wheel of the truck.  He seems reserved,\nand we get the impression that he is studying every move his\ntwo friends are making.\n\nINT. TENEMENT STAIRS - DAY\n\nClemenza runs up a flight of stairs with an armful of\ndresses.  He knocks on a door, and a pretty HOUSEWIFE answers.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tLady, I got a bargain on these\n\t\tdresses.  Five dollars each.  You\n\t\tgotta pay at least fifteen, maybe\n\t\ttwenty in a store.  Look at them,\n\t\tfirst class.\n\nHe holds the dresses up and the woman seems interested.  She\nhandles a couple of them and stands aside so Clemenza can\nenter her apartment.\n\n\t\t\t\tWOMAN\n\t\t\t(Sicilian)\n\t\tI don't know which one I like best.\n\nShe holds the dresses against her body, Clemenza approving\nof each one; and then she goes to her purse and takes out\nfive singles and gives them to him.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tYou'd look beautiful in all of\n\t\tthese.  You should buy at least two.\n\n\t\t\t\tWOMAN\n\t\t\t(Sicilian)\n\t\tAre you kidding?  My husband will\n\t\tkill me if he knows I paid five\n\t\tdollars for one dress.\n\nShe holds one up, then another.  She is torn.  Clemenza\nshakes his head and straightens the dress on her body.  His\nhand brushes her arm; she looks at him smiling.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tYou can have two for five.\n\nShe smiles back.\n\nEXT. TENEMENT BUILDING - DAY\n\nClemenza jumps down the stairs, and out to the middle of the\nstreet, where Vito and Tessio are waiting in the car with\nsome of the stock.\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tWhat took so long?\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tShe couldn't decide.\n\nTessio and Clemenza each take more armsful of dresses and\ndivide the neighborhood.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tVito, take the rest of the stock\n\t\tover to Dandine's warehouse; he'll\n\t\tmove it to a wholesaler.\n\nThe three part.  Vito drives the truck off.\n\nMOVING VIEW\n\nVito drives the truck through the downtown streets; he turns\na corner and stops for a light.\n\nSuddenly, to his left, he sees the formidable figure of\nFanucci.\n\nHe grabs young Corleone by the shoulder.\n\nCLOSE VIEW ON FANUCCI\n\nfrightening, revealing the large circular scar, now healed.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tAhhh, young fellow.  People tell me\n\t\tyou're rich, you and your two\n\t\tfriends.  Yet, you don't show\n\t\tenough respect to send a few\n\t\tdresses to my home.  You know I\n\t\thave three daughters.\n\nVito says nothing.  Fanucci thumbs through the stock.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tThis is my neighborhood.  You and\n\t\tyour friends have to show me a\n\t\tlittle respect, ah?  This truck you\n\t\thijacked was in my neighborhood.\n\t\tYou should let me wet my beak a\n\t\tlittle.\n\nFanucci takes a few of the dresses.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tI understand each of you cleared\n\t\taround six hundred dollars.  I\n\t\texpect two hundred dollars for my\n\t\tprotection and I'll forget the\n\t\tinsult.  After all, young people\n\t\tdon't know the courtesies due a man\n\t\tlike myself.\n\nVito smiles at him and nods.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tOtherwise the police will come to\n\t\tsee you and your wife and children\n\t\twill be dishonored and destitute.\n\t\tOf course, if my information as to\n\t\tyour gains is incorrect, I'll dip\n\t\tmy beak just a little.  Just a\n\t\tlittle, but no less than one\n\t\thundred dollars, and don't try to\n\t\tdeceive me, eh paisan?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\t\t (quietly)\n\t\tMy two friends have my share of the\n\t\tmoney.  I'll have to speak to them\n\t\tafter we deliver these to the\n\t\twholesaler.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tYou tell your friends I expect them\n\t\tto let me wet my beak in the same\n\t\tmanner.  Don't be afraid to tell\n\t\tthem.  Clemenza and I know each\n\t\tother well, he understands these\n\t\tthings.  Let yourself be guided by\n\t\thim.  He has more experience in\n\t\tthese matters.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\t\t (shrugging innocently)\n\t\tYou must understand, this is all\n\t\tnew to me...\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tI understand...\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tBut thank you for speaking to me as\n\t\ta Godfather.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\t\t (impressed)\n\t\tYou're a good fellow.\n\nHe takes Vito's hands and clasps them in his own.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tYou have respect.  A fine thing in\n\t\tthe young.  Next time, speak to me\n\t\tfirst, eh?  Perhaps I can help you\n\t\tmake your plans.\n\nFanucci turns with the dresses draped over his arms, waving\nto Vito.\n\nVito throws the truck in gear, and drives off.\n\nCLOSE VIEW ON VITO\n\nWe know that throughout this encounter he has seethed with\nan icy rage.\n\nINT. VITO'S APARTMENT - MED. VIEW - NIGHT\n\nHe wife serves a dinner for her husband and his two friends.\nThey discuss Fanucci as they eat.\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tDo you think he'd be satisfied with\n\t\tthe two hundred dollars?  I think\n\t\the would.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tThat scar-faced bastard will find\n\t\tout what we got from the wholesaler.\n\t\tHe won't take a dime less than\n\t\tthree hundred dollars.\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tWhat if we don't pay?\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\t\t (gestures, it's hopeless)\n\t\tYou know his friends...real animals.\n\t\tAnd his connections with the police.\n\t\tSure he'd like us to tell him our\n\t\tplans so he can set us up for the\n\t\tcops and earn their gratitude.\n\t\tThen they would owe him a favor;\n\t\tthat's how he operates.  We'll have\n\t\tto pay.  Three hundred, are we\n\t\tagreed?\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tWhat can we do?\n\nClemenza doesn't even bother checking for Vito's opinion.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tThey say Fanucci has a license from\n\t\tMaranzalla himself to work this\n\t\tneighborhood.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tIf you like, why not give me fifty\n\t\tdollars each to pay Fanucci.  I\n\t\tguarantee he will accept that\n\t\tamount from me.\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tWhen Fanucci says two hundred he\n\t\tmeans two hundred.  You can't talk\n\t\twith him.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tI'll reason with him.  Leave\n\t\teverything in my hands.  I'll\n\t\tsettle this problem to your\n\t\tsatisfaction.\n\nTessio and Clemenza regard him suspiciously.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tI never lie to people I've accepted\n\t\tas my friends.  Speak to Fanucci\n\t\tyourself tomorrow.  Let him ask you\n\t\tfor the money, but don't pay it,\n\t\tand don't in any way quarrel with\n\t\thim.  Tell him you have to get the\n\t\tmoney and will send me as your\n\t\tmessenger.  Let him understand that\n\t\tyou're willing to pay what he asks,\n\t\tdon't bargain.  I'll go to his\n\t\thouse, and quarrel with him.  He\n\t\tlikes me; enjoys explaining how\n\t\tthings are here.  He uses ten\n\t\tsentences when he only needs one,\n\t\tso while he talks, I'll kill him.\n\nClemenza, irritated, makes a large belch, and washes his\nfood down with wine.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\tVitone!\n\t\t\t(to Tessio)\n\t\tOur driver has drunk too much wine.\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\t\t (laughs at himself)\n\t\tHe's going to kill Fanucci.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\t\t (stern)\n\t\tThen, after that, what?  Joe\n\t\t'Little Knife' Pisani; Willie\n\t\tBufalino, maybe, Mr. Maranzalla\n\t\thimself, c'mon!\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tFanucci is not connected; he is\n\t\talone.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\t\t (sarcastically)\n\t\tWhat?  You read it in the papers?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tThis man informs to the police;\n\t\tthis man allows his vengeance to be\n\t\tbought off... No, he is alone.\n\n\t\t\t\tTESSIO\n\t\t\t(Sicilian)\n\t\tIf you're wrong...\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tIf I'm wrong, they will kill me.\n\nBoth Clemenza and Tessio are impressed with their young\nfriend; his willingness to risk his life on his perception\nof the situation.\n\nEXT. NEW YORK STREET - MED. VIEW - NIGHT\n\nA ten piece Italian street band plays in front of the church\nto commemorate the first night of the Festa di San Gennaro.\nPeople swarm in crowds, delighted by the music, as out of\nthe church four men carry the statue of San Gennaro down to\nthe street.\n\nMOVING VIEW\n\nClemenza moves along the booths that have been set up along\nthe street: sausage cooking on an open fire; pork livers and\nsweetbeards.  He stops for a sandwich, and makes an irritated\ngesture when the vendor expects to be paid.  He crosses to a\nchurch-sponsored booth with a great Wheel of Fortune, and\nslaps a dollar on a number.  Standing next to him is Vito;\nthey embrace.\n\n\t\t\t\tCLEMENZA\n\t\t\t(Sicilian)\n\t\t\t (quietly)\n\t\tAll three daughters are at church;\n\t\the is alone.  It's important that\n\t\tyou let his neighbors see you leave.\n\t\tTessio has broken the latch on the\n\t\tskylight of his building.\n\nThe wheel stops; they both lose.\n\n\t\t\t\tCLEMENZA\n\t\t\t(English)\n\t\tSee, Brother Carmello, even the\n\t\tchurch makes numbers.\n\n\t\t\t\tPRIEST\n\t\t\t(English)\n\t\tIt's only the way we collect that's\n\t\tdifferent.\n\nVito has left while Clemenza jokes with the Priest.\n\nEXT. FESTA STREET - NIGHT\n\nVito passes the booths of food, crossing toward a small and\ndark club.\n\nINT. SOCIAL CLUB - NIGHT\n\nWe can still HEAR the crowds and music of the festa.  Vito\nenters; the club is empty, except for the large white figure\nsitting alone at a small table.  Fanucci barely acknowledges\nVito as he joins him.\n\nWithout a word, Vito counts out two hundred dollars on the\ntable.  Fanucci looks, then takes off his fedora and puts it\non the table over the money.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tI think there's only two hundred\n\t\tdollars under my hat.\n\t\t\t(he peeks)\n\t\tI'm right.  Only two hundred dollars.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tI'm a little short.  I've been out\n\t\tof work.  Let me owe you the money\n\t\tfor a few weeks.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tAh, you're a sharp young fellow.\n\t\tHow is it I've never noticed you\n\t\tbefore\n\t\t\t(he takes the two\n\t\t\thundred and pours\n\t\t\tsome wine for Vito)\n\t\tYou're too quiet for your own\n\t\tinterest.  I could find some work\n\t\tfor you to do that would be very\n\t\tprofitable.\n\t\t\t(he rises)\n\t\tNo hard feelings, eh?  If I can\n\t\tever do you a service let me know.\n\t\tYou've done a good job for yourself\n\t\ttonight.\n\nEXT. FESTA STREET - MED. VIEW - NIGHT\n\nBy now the musicians have left, but still families are\nwalking the street, and stopping at the booths.\n\nFanucci stands there a moment; he is known by everyone, and\nconsiders himself highly loved.\n\nThen Fanucci begins the walk through the festa, on his way\nhome.\n\nEXT. ROOFTOPS - MOVING VIEW - NIGHT\n\nVito silently moves along the rooftop; paralleling Fanucci's\nwalk.\n\nWe HEAR the sounds of the festa, and every so often catch a\nglimpse of the patterned lights, and the crowds below.\n\nEXT. FESTA STREETS - MOVING VIEW ON FANUCCI - NIGHT\n\nwalking through the crowded streets.  The statue of San\nGennaro is arranged in some midnight religious ceremony.\n\nThe VIEW LIFTS UP, to the rooftops.\n\nEXT. THE ROOFTOPS - NIGHT\n\nVito makes the leap that separates two buildings; then\ncrosses toward the large skylight in the center of the\nbuilding.\n\nEXT. THE STREETS - NIGHT\n\nThe procession in the streets is preceded by ten altar boys;\nand the glittering Monstrance, something of an altar carried\nout into the streets.\n\nThe priest begins this nocturnal service, as the crowds in\nthe street kneel down in prayer.\n\nINT. FANUCCI'S BUILDING - NIGHT\n\nFanucci unlocks the door to his building; we can HEAR the\nservices in the background.\n\nEXT. THE ROOFTOP - NIGHT\n\nVito tries the trap door on the roof; it is stuck firmly\nshut; despite Clemenza's instructions.  He struggles with\nit, but no luck.\n\nFrom the distance, the Choir begins to Latin.  Vito moves\naround the skylight, to an identical trap, tries this one;\nit opens.\n\nEXT. THE MONSTRANCE - MED. VIEW ON THE PRIEST - NIGHT\n\nperforming the services in Latin.  The ten altar boys are in\nattendance.\n\nEXT. THE ROOFTOP - NIGHT\n\nVito reaches down into the trap, and pulls out the newly\noiled gun that has been left for him.  He slides down into\nthe building.\n\nINT. FANUCCI'S HALLWAY - DOWN ANGLE - NIGHT\n\nFanucci proceeds up the staircase with loud, heavy steps.\nAn OLD WOMAN on one of the flights sees him, and immediately\nmoves to her apartment.\n\n\t\t\t\tFANUCCI\n\t\t\t(Sicilian)\n\t\tWhat's the matter, Signora?  You\n\t\tdon't say 'good evening'?\n\n\t\t\t\tWOMAN\n\t\t\t(Sicilian)\n\t\t'Good evening,' Signor Fanucci.\n\nShe quickly disappears behind her door.  Fanucci laughs,\ncontinues up, singing to himself.  The MASS outside is\nalways in evidence.\n\nINT. HALLWAY - NIGHT\n\nVito climbs down from the attic, and finds Fanucci's rear\ndoor open.  He slips in, and makes his way past the open\nwindows, out of which pour the music and chanting of the\nMass.  Slowly and quietly he pulls them down, shut.\n\nHe moves quietly to a glass door, and peeks out.\n\nWHAT HE SEES:\n\nThree young women, Fanucci's DAUGHTERS, laughing and talking.\n\nVIEW ON VITO\n\nA slip up.  Tessio had said they were out.  He steps outside\nto the alley where he can look into the apartment.\n\nANOTHER VIEW\n\nFanucci opens the door of his apartment, and enters.\n\nCLOSE VIEW ON VITO\n\nHe begins to wrap the gun.\n\nVIEW ON THE DAUGHTERS\n\nTheir father greets them with a kiss; and a little religious\ngift he has bought for each.\n\nCLOSE ON THE GUN\n\nwrapped in this primitive method of a silencer.  The VIEW\nTILTS to Vito, caught in the dilemma of having to kill all\nor none of them.  Then something catches his eye.\n\nWHAT HE SEES:\n\nA small gray alley cat is attracted to the young man, comes\nup to him and rubs itself against him.  Vito rubs the\nanimal, speaking softly in Sicilian, then, gaining its\nconfidence, lifts it up and carefully lets it into Fanucci's\napartment.\n\nHe steps back, holding the gun.  We HEAR some Italian\nshouted in the house; a loud sound from the cat, and some of\nthe thumping footsteps of Fanucci.\n\nVIEW ON VITO\n\nholding the wrapped gun, waiting.\n\nWHAT HE SEES:\n\nThe white blob of Fanucci opening the door and cursing in\nItalian as he throws the cat out.\n\nVIEW ON VITO\n\nsqueezing the trigger; the muffled, but still LOUD BLAST\nresounding in the building.\n\nVIEW ON FANUCCI\n\nHe holds onto the door frame, trying to stand erect, trying\nto reach for his gun.  The force of his struggle has torn\nthe buttons off his jacket and made it swing loose.  His gun\nis exposed but so is a spidery vein on the white shirtfront\nof his stomach.  Carefully, as if plunging a needle into\nthis vein, Vito Corleone fires a second bullet.\n\nFanucci falls to his knees, propping the door open, giving a\nterrible groan.  We begin to hear the VOICES of girls inside\nthe apartment.\n\nVito quickly opens his wallet, removes the two hundred,\nquickly fires one last bullet into Fanucci's sweaty cheek.\nNow the towel the gun was wrapped with catches fire,\nliterally on Vito's hand; quickly he throws it to the\nground, stamps it out...and disappears upward.\n\nEXT. THE ROOFTOPS - MED. VIEW - NIGHT\n\nVito moves like a cat along the rooftops; we HEAR the\nconclusion of the Mass down below.\n\nCLOSE ON VITO\n\nPausing; we can SEE the great spectacle of lights and\ncandles on the streets below.\n\nHe empties the gun of bullets and smashes the barrel against\nthe side of the roof ledge.  He reverses it in his hand, and\nbreaks the butt into two separate halves against the chimney.\nHe smashes it again, and the pistol breaks into barrel and\nhandle, two separate pieces.\n\nHe then moves along the rooftop, dropping the two separate\nfragments into various air shafts.\n\nEXT. THE STREET PROCESSION - MOVING VIEW - NIGHT\n\nThe Priest, having completed the ceremony, follows as the\nMonstrance is carried off through the streets, as the Choir\nsings.\n\nEXT. THE ROOFTOPS - MOVING VIEW - NIGHT\n\nVito is a dark figure, moving with agility across the\nrooftops.\n\nINT. FANUCCI'S VESTIBULE - MED. VIEW - NIGHT\n\nThe corpse that was Fanucci, stained with blood.\n\nEXT. PROCESSION - CLOSE VIEW - NIGHT\n\nThe statue of San Gennaro, followed by the altar boys.\n\nEXT. CORLEONE TENEMENT - MED. VIEW - NIGHT\n\nVito's wife; her baby and several friends and neighbors sit\nhappily on the front stoop of their tenement.  Some of the\nmen drink wine poured out of a pitcher; we can still HEAR\nthe music and night sounds of the Festa.\n\nA neighbor is singing a Neapolitan song.\n\nQuietly, without a word, and with only a momentary glance\nfrom his wife, Vito joins the little group; takes a glass of\nwine, and listens to the song.\n\nCLOSE VIEW ON VITO\n\nlistening to the song.  He reaches out and takes the small\nhand of his son.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tSantino, your papa loves you.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ANTHONY'S TAHOE ROOM - NIGHT\n\nThe room is large, lit from the outside by a bright evening.\nWe can see the outline of many toys on the shelves built\nalong the wall.  We see the dark figure of Michael Corleone\nenter the room and approach the bed where his son Anthony\nlies curled in messy blankets.  Michael quietly arranges his\nsmall hands and feet and covers the little boy.  Suddenly,\nAnthony turns, his eyes open.  He is staring, perfectly\nawake, at his father.\n\n\t\t\t\tMICHAEL\n\t\tCan't you sleep?\n\nNo answer.\n\n\t\t\t\tMICHAEL\n\t\tAre you alright?\n\n\t\t\t\tANTHONY\n\t\tYes.\n\n\t\t\t\tMICHAEL\n\t\tDid you like your party?\n\n\t\t\t\tANTHONY\n\t\tI got lots of presents.\n\n\t\t\t\tMICHAEL\n\t\tDo you like them?\n\n\t\t\t\tANTHONY\n\t\tI didn't know the people who gave\n\t\tthem to me.\n\n\t\t\t\tMICHAEL\n\t\tThey were friends.\n\nHe kisses his boy, and then turns.\n\n\t\t\t\tANTHONY\n\t\tDid you see my present for you?\n\n\t\t\t\tMICHAEL\n\t\tNo, where is it?\n\n\t\t\t\tANTHONY\n\t\tOn your pillow.\n\n\t\t\t\tMICHAEL\n\t\tI'm leaving very early tomorrow,\n\t\tbefore you wake up.\n\n\t\t\t\tANTHONY\n\t\tI know.  How long will you be gone?\n\n\t\t\t\tMICHAEL\n\t\tJust a few days.\n\n\t\t\t\tANTHONY\n\t\tWill you take me?\n\n\t\t\t\tMICHAEL\n\t\tI can't.\n\n\t\t\t\tANTHONY\n\t\tWhy do you have to go?\n\n\t\t\t\tMICHAEL\n\t\tTo do business.\n\n\t\t\t\tANTHONY\n\t\tI can help you.\n\n\t\t\t\tMICHAEL\n\t\tSome day you will.\n\nMichael kisses him again.\n\nINT. MICHAEL-KAY'S BEDROOM - NIGHT\n\nThe room is lit from a small night lamp on Michael's side of\nthe large bed.\n\nKay is huddled in blankets, asleep.  Michael closes the door\nto his room, moves to his side of the bed, and glances down\nto the pillow.\n\nVIEW ON THE PILLOW\n\nis a child's drawing of a long limousine, with a man in a\nhat sitting in the back seat.\n\nAn arrow pointing to him is marked \"DAD.\" Under it, a nine\nyear old's handwriting says: \"Do you like it?  Check YES __\nI liked it or NO __ I didn't like it.\" Michael turns,\nlooking for a pencil, and moves to the dresser, where he\nplaces a check next to \"YES.\"\n\nHe starts to cross back toward his side of the bed, when Kay\nturns, almost in her sleep:\n\n\t\t\t\tKAY\n\t\tMichael?  Why are the drapes open?\n\nHis eyes dart back to the curved, beautifully leaded windows\nof the room.  The DRAPES are opened.  Then, without a\nsecond's hesitation, he leaps to the floor, still holding\nhis son's drawing, as a spray of machine gun bullets sweep\nacross the windows; glass shattering all over the room.\n\nKay screams out; rising, still half-asleep.  Michael crawls\ntoward her, and pulls her down to the floor to him.\n\nThen, for a moment, there is silence, soon filled by the\nshouts of men; as flashes of light sweep by the window, as\nguards with flashlights come running.\n\nMichael holds Kay to him, knowing they have both survived,\nand then gently:\n\n\t\t\t\tMICHAEL\n\t\tGo with the kids.\n\nEXT. THE TAHOE ESTATE - NIGHT\n\nSuddenly, the great floodlights are turned on, bathing lawns\nin an intense blue light.\n\nGroups of ordinarily dressed security men drawn in from all\ndirections; a state of confusion prevails.  There is no sign\nof the attackers.\n\nVIEW BY MICHAEL'S HOUSE\n\nMichael is joined by Rocco Lampone, his gun drawn.\n\n\t\t\t\tROCCO\n\t\tThey're still on the property.\n\t\tMaybe you better stay inside.\n\n\t\t\t\tMICHAEL\n\t\tKeep them alive.\n\nSix men take up posts by Michael's house.\n\n\t\t\t\tROCCO\n\t\tWe'll try.\n\n\t\t\t\tMICHAEL\n\t\tIt's important.\n\nHe returns inside.\n\nEXT. MAIN GATE AND KENNELS - NIGHT\n\nThe character of the summer estate has changed: bright\nfloodlights illuminate the main points of entry: the main\ngate; the waterway; the stone wall that encompasses the\nestate on all sides.\n\nSeveral men with flashlights reinforce the guard at the main\ngate.\n\nFULL VIEW\n\nOff in the distance, we see another group of men with\nflashlights combing the waterline.  We hear indistinguishable\nshouts.\n\nVIEW ON THE KENNELS\n\nThe wire gates are opened, and the trained dogs go out\nyelping into the outer edge of the estate.\n\nROOFTOP\n\nOne of Rocco's men turns the large floodlight scanning\ndarkened forest areas, where men could hide.\n\nMOVING VIEW\n\nMen with flashlights and dogs.  Moving through the dark areas.\n\nLOOSE VIEW\n\nA small Corleone launch, with a bright spotlight slowly\ncruises the boundaries of the estate.  We SEE the silhouette\nof men with guns, quietly waiting and watching.\n\nEXT. MICHAEL'S HOUSE - NIGHT\n\nSome of the bodyguards by the shattered windows of Michael's\nbedroom.\n\nThe curtains are drawn from inside.\n\nINT. MICHAEL'S HOUSE - NIGHT\n\nKay, the children, and some women servants have come down\nfrom the various rooms into the central living area, that\ncan be most easily secured.  The little girl is still\nasleep; they make you think of an immigrant family, with\ntheir blankets and frightened faces, all waiting in a\ncentral room.\n\nMichael goes up to Kay, squeezes her hand, and whispers:\n\n\t\t\t\tMICHAEL\n\t\tIt will be all right.  We were lucky.\n\nShe says nothing; but her face expresses the anger she feels\nover the jeopardy Michael has placed his children in.  She\nholds her young daughter in her arms.\n\nThe door opens, and Rocco enters.  He quickly realizes he is\nholding his gun in plain view in front of the family, and\nputs it away.  Michael moves to him, and they talk a distance\naway from Kay.\n\n\t\t\t\tROCCO\n\t\tYour family all seem to be okay in\n\t\tthe other houses; your Mother's\n\t\tstill sleeping.\n\n\t\t\t\tMICHAEL\n\t\tAnd?\n\n\t\t\t\tROCCO\n\t\tNo sign of them yet; but they're\n\t\tstill on the Estate.\n\nWe HEAR loud shouting from outside.\n\n\t\t\t\tDEANNA (O.S.)\n\t\tGoddamn you!  You're all nuts here,\n\t\tI'm not goin' to calm down...\n\nMICHAEL'S VIEW\n\nThrough the door, that Rocco opens.\n\nDeanna, in her nightgown, has been frightened by the\ngunshots; while Fredo in his bathrobe, tries to get her back\ninto the house.\n\n\t\t\t\tFREDO\n\t\tDeanna, will you get back into the\n\t\thouse!\n\n\t\t\t\tDEANNA\n\t\tI'm getting out of here I said;\n\t\tthese guys all have guns!\n\n\t\t\t\tMICHAEL\n\t\tFredo, can't you shut that woman up!\n\t\t\t(to Rocco's men)\n\t\tGet her in here!\n\nThe bodyguards, gracefully help Fredo bring the hysterical\nDeanna into the safety of the house.\n\n\t\t\t\tDEANNA\n\t\t\t(whimpering)\n\t\tI don't want to stay here...\n\n\t\t\t\tFREDO\n\t\tMike, what can I do, she's a\n\t\thysterical woman...\n\n\t\t\t\tKAY\n\t\tLeave her alone!  You're talking as\n\t\tthough she has no right to be\n\t\tfrightened when there are machine\n\t\tguns going off in her backyard.\n\n\t\t\t\tMICHAEL\n\t\t\t(to Rocco)\n\t\tHave Tom Hagen meet me in the\n\t\tHarbor House.\n\nEXT. TAHOE ESTATE - HIGH ANGLE - NIGHT\n\nMichael walks the short distance from his house, to the\nboathouse where he conducts his business away from his family.\n\nA small group of bodyguards, carrying machine guns, make the\nwalk with him from all sides, a respectful distance away.\nIt gives the appearance of a lonely President moving in his\ncompound, followed by teams of Secret Service men.\n\nThe boathouse is already secured by teams of men, hastily\nwakened from their lodge house; a barracks-like structure\nwhere reinforcements are lodged just for this kind of\nemergency.\n\nFULL VIEW\n\nIn the distance, we can see the teams of men and dogs, with\ntheir lights, guns and shouts, combing every inch of the\nestate.\n\nINT. THE BOATHOUSE - EMPTY VIEW - NIGHT\n\nMichael alone in the great room.  He moves to a walk-in\nsafe, quickly runs through the combination, and opens it.\nHe takes out an envelope, and puts it into his pocket;\nthere's a KNOCK on the door, and Hagen enters.  He had been\nasleep, and has quickly thrown on a robe.\n\n\t\t\t\tMICHAEL\n\t\tSit down, Tom.\n\nEXT. TAHOE BOATHOUSE - NIGHT\n\nFrom outside the leaded windows, a disoriented Hagen sits\ndown; Michael starts to talk to him; obviously about\nsomething very serious.\n\nThe patrol securing the boathouse, walk past the window.\nMichael says something to Tom, who rises, and pulls the\ndrapes, obscuring OUR VIEW.\n\nINT. TAHOE BOATHOUSE - NIGHT\n\nMichael talks intimately to Tom.\n\n\t\t\t\tMICHAEL\n\t\tThere's a lot I can't tell you, Tom.\n\t\tI know that's upset you in the\n\t\tpast; and you've felt that it was\n\t\tbecause of some lack of trust or\n\t\tconfidence.  But it is because I do\n\t\ttrust you that I've kept so much\n\t\tsecret from you.  It's precisely\n\t\tthat at this moment, you are the\n\t\tonly one that I can completely\n\t\ttrust.  In time, you'll understand\n\t\teverything.\n\n\t\t\t\tHAGEN\n\t\t\t(nods with this statement)\n\t\tBut your people... Neri... Rocco;\n\t\tyou don't think...\n\n\t\t\t\tMICHAEL\n\t\tNo, I have confidence in their\n\t\tloyalty... but this is life and\n\t\tdeath, and Tom, you are my brother.\n\nHagen in very moved.\n\n\t\t\t\tHAGEN\n\t\tMikey, I hoped...\n\n\t\t\t\tMICHAEL\n\t\tNo Tom, just listen.  All my people\n\t\tare businessmen; their loyalty is\n\t\tbased on that.  One thing I learned\n\t\tfrom my father is to try to think\n\t\tas the people around you think...and\n\t\ton that basis, anything is possible.\n\t\tFredo has a good heart, but he is\n\t\tweak...and stupid, and stupid\n\t\tpeople are the most dangerous of\n\t\tall.  I've kept you out of things,\n\t\tTom, because I've always known that\n\t\tyour instincts were legitimate, and\n\t\tI wanted you to know very little of\n\t\tthings that would make you an\n\t\taccomplice, for your own protection.\n\t\tI never blamed you for the setbacks\n\t\tthe family took under Sonny; I know\n\t\tyou were in a position of limited\n\t\tpower, and you did your best to\n\t\tadvise and caution him.  What I am\n\t\tsaying is that now, for how long I\n\t\tdo not know, you will be the Don.\n\t\tIf what I think has happened is\n\t\ttrue; I will leave tonight, and\n\t\tabsolutely no one will know how to\n\t\tcontact me.  And even you are not\n\t\tto try to reach me unless it is\n\t\tabsolutely necessary.  I give you\n\t\tcomplete power: over Neri... Fredo,\n\t\teveryone.  I am trusting you with\n\t\tthe lives of my wife and children,\n\t\tand the future of this family,\n\t\tsolely resting on your judgment and\n\t\ttalent.\n\nVIEW ON HAGEN\n\nA man who has steadily declined over the last five years,\nrealizing that total power and responsibility is being\nplaced on him.\n\n\t\t\t\tMICHAEL\n\t\t\t(continuing)\n\t\t...But Tom, you must know that I do\n\t\tthis only because I believe you are\n\t\tthe only one who is capable of\n\t\ttaking over for me.\n\nVIEW ON MICHAEL\n\ntaking out the envelope.\n\n\t\t\t\tMICHAEL\n\t\tI've prepared this; have had it for\n\t\tover a month.  It won't explain\n\t\teverything; but indicates where I\n\t\twill be, so in a sense, it is my\n\t\tlife.\n\t\t\t(he hands the envelope\n\t\t\tto Hagen)\n\t\tAlso, there are three tasks that\n\t\tmust be executed immediately.  Pop\n\t\twould have given those to Luca --\n\t\tYou knew Pop as well as anyone, act\n\t\tas though you were him.  It\n\t\tdiscusses Kay as well; that will be\n\t\tthe most difficult.  The men who\n\t\ttried to kill me tonight, will\n\t\tnever leave the estate.\n\n\t\t\t\tHAGEN\n\t\tWill we...be able to get who\n\t\tordered it out of them?\n\n\t\t\t\tMICHAEL\n\t\tI don't think so.  Unless I'm very\n\t\twrong...they're already dead.\n\t\tKilled by someone inside...very\n\t\tfrightened that they botched it.\n\t\tThat's why I am going to disappear\n\t\tin a few minutes, and leave\n\t\teverything to you.\n\n\t\t\t\tHAGEN\n\t\tBut if you're wrong...\n\n\t\t\t\tMICHAEL\n\t\tIf I'm wrong...\n\nThere is a KNOCK on the door.\n\n\t\t\t\tMICHAEL\n\t\t...I don't think I'm wrong.\n\t\t\t(he indicates the knock)\n\t\tYes.\n\nThe door opens; it is Rocco; Michael rises, after making a\nknowing glance toward Tom, and moves to talk quietly to a\nfrightened and agitated Rocco.\n\nEXT. STONE WALL AND STREAM - MOVING VIEW - NIGHT\n\nA group of men with flashlights and guns lead Michael, Tom\nand Rocco to the stone bridge spanning the stream which runs\nthrough the estate.\n\nLOW CLOSE VIEW\n\nMichael's dispassionate face, looking down.  THE VIEW MOVES\nto Hagen's, and then down to the murky water under the\nbridge, where we see the bodies of three strangers, lying in\nthe moving water; machine-type guns nearby, with their\nthroats cut.  Light from the many flashlights illuminates\nthe grotesque scene.\n\n\t\t\t\tMICHAEL (O.S.)\n\t\tFish them out.\n\nSeveral of the men wade down into the stream; Rocco helps,\nand even Tom steps down to get a better look at who they\nwere.  They are total strangers; Rocco examines the type of\nguns they used.\n\nWhen they climb back onto the ground, Michael is gone.\nEveryone notices it, but no one says anything.\n\nHagen stands there, holding the envelope Michael had given\nhim in his hand.\n\nHe realizes that now, he is the DON.\n\n\t\t\t\tHAGEN\n\t\tGet rid of the bodies.  Tomorrow\n\t\tmorning I want a report made to the\n\t\tlocal police, and paper, that some\n\t\texplosives we keep on the property\n\t\twere accidentally ignited.\n\nThe men respond; Hagen makes the lonely walk back to the\nlighted section of the compound, which now resembles a\nprison camp.\n\n\t\t\t\t\t\t\tFADE OUT.\n\nFADE IN:\n\nINT. STATE SENATE FLOOR - DAY\n\nThe Senate is in session; Senator Geary is on the floor\nduring a vote.  An aide approaches him, with a slip of paper.\n\nINT. GEARY'S OFFICE - DAY\n\nThe Senator steps behind his desk.\n\n\t\t\t\tSENATOR GEARY\n\t\tAll right, Mr. Hagen, you've got\n\t\tten minutes.\n\nHe flicks the switch of a small tape recorder.\n\n\t\t\t\tSENATOR GEARY\n\t\t...and the tape will be running.\n\n\t\t\t\tHAGEN\n\t\tActually, I've come with good news;\n\t\tthe Corleone family has done you a\n\t\tfavor.\n\nThe Senator immediately shuts the tape recorder off.\n\n\t\t\t\tSENATOR GEARY\n\t\tWhat the hell are you talking about?\n\n\t\t\t\tHAGEN\n\t\tWe know you're a busy man, with\n\t\tplenty of enemies -- we saw the\n\t\topportunity to do you a favor, and\n\t\twe did.  No strings.\n\n\t\t\t\tSENATOR GEARY\n\t\tNo strings.\n\n\t\t\t\tHAGEN\n\t\tYou know there's a Senate\n\t\tInvestigating Committee recently\n\t\tset up; we thought it would be\n\t\tunfortunate if they were to trace\n\t\tanything though-provoking to your\n\t\tname.\n\n\t\t\t\tSENATOR GEARY\n\t\tNo one can trace anything to me; I\n\t\tpride myself on that.\n\n\t\t\t\tHAGEN\n\t\tDo you gamble?\n\n\t\t\t\tSENATOR GEARY\n\t\tA little; what's so thought-\n\t\tprovoking about that?\n\n\t\t\t\tHAGEN\n\t\tDo you owe markers?\n\n\t\t\t\tSENATOR GEARY\n\t\tMaybe two, three thousand dollars.\n\nHagen leans forward, and deposits a handful of paper on the\nSenator's desk.\n\n\t\t\t\tHAGEN\n\t\tThe Corleone family has paid them\n\t\toff for you...as an expression of\n\t\tour esteem.\n\nGeary quickly looks through the paid markers.\n\n\t\t\t\tSENATOR GEARY\n\t\tThere's thirty grand worth of paid\n\t\toff markers -- I never owed that\n\t\tmuch.\n\n\t\t\t\tHAGEN\n\t\tOur mistake.  But what does it\n\t\tmatter; it was our money.\n\t\t\t(rising)\n\t\tWe don't even expect thanks.\n\n\t\t\t\tSENATOR GEARY\n\t\tYou paid off thirty grand I never\n\t\towed.\n\n\t\t\t\tHAGEN\n\t\tWe'll keep it quiet; the people who\n\t\tknow are trustworthy...the Committee\n\t\tneedn't find out.\n\n\t\t\t\tSENATOR GEARY\n\t\tAnd what's the price of their not\n\t\tfinding out.\n\n\t\t\t\tHAGEN\n\t\tSimple.  Be friendly like us.  Not\n\t\thostile.\n\n\t\t\t\tSENATOR GEARY\n\t\t\t(he despises Hagen)\n\t\tThanks...friend.\n\nEXT. TAHOE ESTATE - FULL VIEW - DAY\n\nThere are more men on duty than usual; not that there are\nguns apparent, but it's clear that the boundaries are being\npatrolled.\n\nVIEW BY MICHAEL'S HOUSE\n\nKay exits her house, followed by her children; she helps\nthem into her station wagon like any housewife, and drives\nalong the path leading to the main gate.\n\nShe's about to drive through, when one of the men steps in\nfront of her, raising his hand.\n\n\t\t\t\tKAY\n\t\t\t(graciously)\n\t\tYes.\n\n\t\t\t\tMAN\n\t\tI'm sorry, Mrs. Corleone.  We're\n\t\tnot to let you through.\n\n\t\t\t\tKAY\n\t\t\t(disbelieving)\n\t\tI'm going to the market.\n\n\t\t\t\tMAN\n\t\tIf you could just give us a list,\n\t\twe'll pick up anything you want.\n\n\t\t\t\tKAY\n\t\tWhose orders are these?\n\n\t\t\t\tMAN\n\t\tMr. Hagen's, ma'am.\n\nWe notice Hagen walking to them in the background.\n\n\t\t\t\tHAGEN\n\t\tKay.\n\nVIEW THROUGH THE GATE\n\nHagen approaches the car; Kay gets out so they can talk away\nfrom the children.\n\n\t\t\t\tHAGEN\n\t\tI wanted to explain this myself...\n\t\tI had business in Carson City.\n\nHe walks with her a little way from the others; the children\nrun out of the station wagon, and start to play.\n\n\t\t\t\tHAGEN\n\t\tIt's Michael's request...for your\n\t\tsafety.  We can send out for\n\t\tanything you need.\n\n\t\t\t\tKAY\n\t\tI'm supposed to stay in my house.\n\n\t\t\t\tHAGEN\n\t\tWithin the compound will be fine.\n\n\t\t\t\tKAY\n\t\tI was supposed to take the children\n\t\tto New England next week.\n\n\t\t\t\tHAGEN\n\t\tThat's off now.\n\n\t\t\t\tKAY\n\t\tI'm going to see my parents.\n\n\t\t\t\tHAGEN\n\t\tKay, Michael didn't tell me a lot;\n\t\tand what he did tell me, I can't\n\t\trepeat.  But the responsibility for\n\t\tyou and the kids was the most\n\t\timportant thing he left me with.\n\n\t\t\t\tKAY\n\t\tHow long does this go on?\n\n\t\t\t\tHAGEN\n\t\tI don't know.\n\t\t\t(pause)\n\t\tI'm sorry, Kay...\n\n\t\t\t\tKAY\n\t\tAm I a prisoner?\n\n\t\t\t\tHAGEN\n\t\tThat's not the way we look at it.\n\nAngrily, without another word, Kay turns away from him, and\nwalks to her children, ignoring the running station wagon.\n\nEXT. ITALIAN LUXURY LINER - DAY\n\nThe luxury liner making its way across the Atlantic.\n\nINT. ITALIAN LUXURY LINER - MED. VIEW - DAY\n\nThe PURSER followed by several white uniformed associates\nknocks on the door of something designated the \"Leonardo\nSuite.\" He is holding a telegram.\n\nThe door opens, and a tanned Merle peeks out of the door.\n\n\t\t\t\tPURSER\n\t\t\t(holding up the telegram)\n\t\tI'm terribly sorry to disturb you\n\t\tbut we have received two telegrams.\n\n\t\t\t\tMERLE\n\t\t\t(reluctantly)\n\t\tWell...come in.\n\nThis entourage enters the suite, an impressive and\nbeautifully spacious luxury suite.  Connie is relaxing.\n\n\t\t\t\tCONNIE\n\t\tWhat is it?\n\n\t\t\t\tPURSER\n\t\tYes.  One is from our office in New\n\t\tYork.  The check that you wrote for\n\t\tyour passage has been returned.\n\n\t\t\t\tCONNIE\n\t\tCan't be...\n\n\t\t\t\tMERLE\n\t\tWhy don't you wire your bank?\n\n\t\t\t\tPURSER\n\t\tThe other telegram is from your\n\t\tbank.  Your account has been closed\n\t\tand the company is warned not to\n\t\textend any credit.\n\n\t\t\t\tCONNIE\n\t\tI'll take care of it in Naples.\n\n\t\t\t\tPURSER\n\t\tThe company hopes so.  But for now,\n\t\twe have orders to change your\n\t\taccommodations.\n\nAnd with that, the men in white begin to pack Connie and\nMerle's luggage.\n\n\t\t\t\tCONNIE\n\t\tThat son of a bitch!\n\nINT. ITALIAN LUXURY LINER - TINY THIRD CLASS CABIN - NIGHT\n\nConnie and Merle are attempting to sleep in the miniature\ncabin in bunk beds.  The little space is crowded with their\ntrunks and luggage.  Merle can barely hang onto the bunk,\nthe boat pitches so violently below.\n\nEXT. TRAIN TRACKS - MED. VIEW - DAY\n\nA train speeds across the countryside.\n\nINT. THE TRAIN - DAY\n\nInside the corridor, a porter advances, and knocks on the\ndoor of a stateroom.  A voice tells him to enter.  OUR VIEW\nenters with him as he carries a tray of lunch.  From this\nPOV we see Michael Corleone sitting in the compartment.\n\n\t\t\t\tPORTER\n\t\tMr. Paul?\n\n\t\t\t\tMICHAEL\n\t\tYes.\n\n\t\t\t\tPORTER\n\t\tYou ordered lunch?\n\n\t\t\t\tMICHAEL\n\t\tPut it right there.\n\nThe porter does so; as he places the tray down, he catches a\nglimpse of a second person in the compartment with Michael.\n\nHIS VIEW\n\nA very fierce, almost maniacal looking man, BUSSETTA.  He\nnods that the porter should leave.\n\n\t\t\t\tMICHAEL\n\t\tThank you.\n\nThe porter takes his advice and leaves quickly, closing the\ndoor behind him.\n\nVIEW THROUGH THE WINDOW\n\nMichael and his mysterious companion have lunch together on\nthe moving train.\n\nEXT. GULFSTREAM RACE TRACK IN MIAMI - HIGH FULL VIEW - DAY\n\nThe empty parking lot of the Gulfstream track, on an off-\nrace day.\n\nCLOSER VIEW\n\nMichael sits behind the wheel of a nondescript late model\ncar.  Bussetta sits in the rear.\n\nAnother car swings into the lot.  Michael starts his car,\nand pulls out of the lot; the second car following.\n\nNEW VIEW\n\nThis car pulls out and begins to follow them.  Michael\nglances back by adjusting the rear view mirror, and nods to\nBussetta.\n\nMichael's car begins to slow down, allowing the other car to\novertake them.\n\nThe overtaking car hesitates a moment, moving side by side\nwith them.\n\nMichael glances toward the driver.\n\nMICHAEL'S VIEW\n\nWe recognize Johnny Ola, who waves a greeting to Michael,\nand then continues on to lead him.\n\nEXT. SUBURBAN MIAMI NEIGHBORHOOD - DAY\n\nOla's car leads Michael's through a middle-class suburban\narea of $30,000 to $40,000 homes.  There are small channels\nwith sporting and fishing boats parked near the houses.\nOla's car pulls up in front of a very simple, tract-type\nhome.  Michael's car parks nearby.\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\t\t (to Bussetta)\n\t\tYou'll wait in the car.\n\nOla has gotten out of his car and walks up the little path\nto the front door.  Michael waits.\n\nOla rings the bell, and after a moment, a rather pretty,\nmiddle-aged WOMAN answers, remaining behind the screen door.\nOla says a few things to her and she disappears, leaving the\ndoor open.\n\nOla comes down the steps, looks at Michael, nodding to him.\nOla then gets into his car and drives off.  Michael walks up\nthe walkway and enters the little house, closing the door\nbehind him.\n\nThis woman, TERRI ROTH, is in the kitchen, looking out at\nMichael.\n\n\t\t\t\tTERRI\n\t\tI'm just going to make lunch.  How\n\t\tabout a tuna fish sandwich?\n\n\t\t\t\tMICHAEL\n\t\tThank you, Mrs. Roth.\n\nShe hurries halfway up the staircase.\n\n\t\t\t\tTERRI\n\t\tHyman...HYMAN, your friend is here.\n\t\t\t(turning to Michael)\n\t\tWhy don't you go right upstairs, Mr.\n\t\tPaul?\n\n\t\t\t\tMICHAEL\n\t\tFine.\n\nHe continues upstairs; she goes into the kitchen.\n\n\t\t\t\tTERRI\n\t\tI'll give a yell when lunch is ready.\n\nMichael continues up to a small den on the second floor; we\ncan HEAR the sound of a baseball game coming over the\ntelevision.\n\nINT. HYMAN ROTH'S DEN - DAY\n\nMichael enters the den: it's very comfortable, but somewhat\nlike a senior citizen's retirement home in Florida.\n\nMICHAEL'S VIEW\n\nThere, sitting before the television is a small man in his\nmiddle sixties, thin, with a wizened face, looking like a\nsmall-time retired Jewish businessman.  This is HYMAN ROTH.\n\n\t\t\t\tROTH\n\t\tSit down, this is almost over.  You\n\t\tfollow the baseball games?\n\n\t\t\t\tMICHAEL\n\t\tNot for a few years.\n\n\t\t\t\tROTH\n\t\tI like sporting events -- I really\n\t\tenjoy watching them in the afternoon.\n\t\tOne of the things I love about this\n\t\tcountry.  I loved baseball ever\n\t\tsince Arnold Rothstein fixed the\n\t\tWorld Series of 1919...I heard you\n\t\thad some trouble.\n\n\t\t\t\tMICHAEL\n\t\tYes.\n\n\t\t\t\tROTH\n\t\tWhat a mistake; people behaving\n\t\tlike that, with guns.\n\t\t\t(he shakes his head)\n\t\tIt was my understanding we left all\n\t\tthat behind.  But, let me tell you,\n\t\tthe important thing is that you're\n\t\tall right.  Good health is the most\n\t\timportant thing; more than success;\n\t\tmore than power; more than money.\n\n\t\t\t\tMICHAEL\n\t\tThe incident of the other night is\n\t\ta nuisance that I can take care of.\n\t\tI came to you because I want\n\t\tnothing to affect our agreement; I\n\t\twanted to clear everything I'm\n\t\tgoing to do with you, just in case.\n\n\t\t\t\tROTH\n\t\tYou're a considerate young man.\n\n\t\t\t\tMICHAEL\n\t\tYou're a great man, Mr. Roth, I\n\t\thave much to learn from you.\n\n\t\t\t\tROTH\n\t\t\t(warmly)\n\t\tHowever I can help you...\n\n\t\t\t\tMICHAEL\n\t\tThe Rosato Brothers have performed\n\t\tservices for you in the past; I\n\t\tunderstand that they are under your\n\t\tprotection.\n\n\t\t\t\tROTH\n\t\t\t(simply)\n\t\tWe do favors for each other...\n\n\t\t\t\tMICHAEL\n\t\tTechnically, they are still under\n\t\tthe Clemenza wing of the Corleone\n\t\tFamily, now run by Frankie\n\t\tPentangeli.  After Clemenza died,\n\t\tthe Rosatos wanted territory of\n\t\ttheir own.  Pentangeli refused, and\n\t\tcame to me, asking for permission\n\t\tto eliminate them.  I, of course,\n\t\tknew of their relationship with\n\t\tyou, and in gratitude for your help\n\t\twith the Tropicana matter, turned\n\t\thim down.  Pentangeli was furious,\n\t\tand paid one hundred and fifty\n\t\tthousand dollars to have me killed.\n\t\tI was lucky and he was stupid.\n\t\tI'll visit him soon.\n\t\t\t(leaning toward the\n\t\t\told man, sincerely)\n\t\tThe important thing is that nothing\n\t\tjeopardize our plans, yours and\n\t\tmine.  This thing of ours, that we\n\t\twill build.\n\nThe old man touches Michael's hand, warmly.\n\n\t\t\t\tROTH\n\t\tNothing is more important.\n\n\t\t\t\tMICHAEL\n\t\t\t(quietly)\n\t\tPentangeli is a dead man; do you\n\t\tobject?\n\n\t\t\t\tROTH\n\t\tIt's always bad for business; but\n\t\tyou have no choice.\n\n\t\t\t\tMICHAEL\n\t\tThen it's done.  I must choose his\n\t\treplacement: it cannot be Rosato.\n\n\t\t\t\tROTH\n\t\tOf course you must keep control of\n\t\tyour family.\n\nHe turns to Michael, turning the volume higher on the\ntelevision, and moving closer to his young partner.\n\n\t\t\t\tROTH\n\t\tMichael, these things are\n\t\tunimportant.  Who should be the\n\t\tmanager of a dime store, Joe or\n\t\tJack?  Unimportant.  You do what\n\t\tyou think is right.  You're a young\n\t\tman, and I'm old and sick.  What we\n\t\tdo together in the next few months\n\t\twill be history, Michael; it has\n\t\tnever been done before.  We will do\n\t\tthis historical thing together, and\n\t\teven your Father could never dream\n\t\tit would be possible.  We are\n\t\tbigger than U.S. Steel, you and\n\t\tme... because in America, anything\n\t\tis possible!\n\t\t\t(pause)\n\t\tBut soon I will be dead, and it\n\t\twill all belong to you.\n\nThere is a KNOCK on the door, and Terri Roth pushes the door\nopen with her hip.\n\n\t\t\t\tTERRI\n\t\tMy goodness, you'll rupture your\n\t\teardrums, Hyman.\n\nShe puts the tray down, and turns down the television.\n\nEXT. ROTH'S HOUSE - MED. VIEW - DAY\n\nThe sinister Bussetta waits patiently in the rear seat of\nthe car, outside Roth's modest house.\n\nEXT. DOWNTOWN NEW YORK - MOVING VIEW - DAY\n\nA black Cadillac moves down the street, slowed by the\nFestivities of the Festa that is in progress: people milling\naround, buying souvenirs at the many stands set up.\n\nSausage and grilled meats are prepared, just as they were\nyears ago.  Electric lights are strung from the street\nlamps, and brightly colored banners pronounce the \"Festa of\nthe Madonna.\"\n\nMOVING CLOSE VIEW\n\nWilly Cicci drives, frustrated that he cannot go any faster.\nNext to him, Frankie Pentangeli sits, catching a few seconds'\nsnooze.\n\nMED. VIEW\n\nThe black car pulls up; another car that had been following\nit parks nearby.\n\nOne of Pentangeli's button men gets out of the car, and\nsteps into a small Italian restaurant; he exits quickly, and\nnods affirmatively toward Pentangeli's Cadillac.\n\nThe group of them step out quickly, men huddled around\nPentangeli, and enter the restaurant.\n\nINT. THE RESTAURANT - DAY\n\nThe restaurant is quite empty, despite the excitement out on\nthe street.\n\nPentangeli immediately sits at a table with a tall, dark,\nsnappily dressed young man, CARMINE ROSATO.\n\nNearby, on the other side of the room is Rosato's brother,\nTONY, seated with a group of their men.\n\nAt another table in the restaurant is a table of Pentangeli's\npeople: they are joined by bodyguards.\n\n\t\t\t\tPENTANGELI\n\t\tRosato, where's your brother?\n\n\t\t\t\tROSATO\n\t\tSitting right behind you.\n\nPentangeli glances behind himself.\n\n\t\t\t\tPENTANGELI\n\t\tHe don't want to talk?\n\n\t\t\t\tROSATO\n\t\tWe worked it all out beforehand.\n\n\t\t\t\tPENTANGELI\n\t\tAre we going to eat or what?\n\n\t\t\t\tROSATO\n\t\tSure, on me.  I got Diner's Club.\n\n\t\t\t\tPENTANGELI\n\t\t\t(sarcastically)\n\t\tForget it; I'm suddenly without an\n\t\tappetite.  You're making big\n\t\ttrouble, Carmine.\n\n\t\t\t\tROSATO\n\t\tYou weren't straight with us,\n\t\tFrankie, what else could we do?\n\n\t\t\t\tPENTANGELI\n\t\tWe could have talked first, saved a\n\t\tlot of running around.\n\n\t\t\t\tROSATO\n\t\tYou wasn't listening, you didn't\n\t\twant to talk.\n\n\t\t\t\tPENTANGELI\n\t\tDon't I look like I'm listening?\n\n\t\t\t\tROSATO\n\t\tWe want Brooklyn one hundred\n\t\tpercent.  No more taxes to you.  We\n\t\twant to be only loosely connected\n\t\twith your family -- sort of a\n\t\tunder-family all of our own.  Then\n\t\twe can act on all internal matters\n\t\twithout talking.  Also we want you\n\t\tto inform Michael Corleone that we\n\t\tcan deal directly with him.\n\n\t\t\t\tPENTANGELI\n\t\tI'm a little hungry, maybe I'll\n\t\torder something.  Joe.\n\t\t\t(one of his men)\n\t\tGet me some bracciole or something.\n\t\tAnd pay cash.\n\t\t\t(to Rosato)\n\t\tAnd in return for these concessions,\n\t\twhat do you do for me?\n\n\t\t\t\tROSATO\n\t\tWe will release the hostages,\n\t\tnumber one.  Number two, we're here\n\t\tfor you to count on when you need\n\t\tus.  We're independent, but we're\n\t\there if you need us.  In general,\n\t\twe'll cooperate with you and your\n\t\tbusinesses, and you in turn will\n\t\tcooperate with us.  Pari persu.\n\n\t\t\t\tPENTANGELI\n\t\tPari Persu; what the fuck is Pari\n\t\tpersu...?\n\n\t\t\t\tROSATO\n\t\tMy lawyer went over this beforehand.\n\n\t\t\t\tPENTANGELI\n\t\tWhat assurances do I have that\n\t\tthere will be no more kidnapping,\n\t\tno more hits?\n\n\t\t\t\tROSATO\n\t\tThe same assurance we got from you.\n\n\t\t\t\tPENTANGELI\n\t\tWhat if I say shove it?\n\n\t\t\t\tROSATO\n\t\tThen Carmine Fucillo and Tony Blue\n\t\tDeRosa will need to be fitted for\n\t\tslabs.\n\n\t\t\t\tPENTANGELI\n\t\tYou want a war?\n\n\t\t\t\tROSATO\n\t\tWe got no choice.\n\n\t\t\t\tPENTANGELI\n\t\tYou know if there's a way I'll go\n\t\tto the commission and the commission\n\t\twill side with me.  That puts me\n\t\tand the other New York families\n\t\tagainst you.\n\n\t\t\t\tROSATO\n\t\tWe got friends in the commission.\n\n\t\t\t\tPENTANGELI\n\t\t\t(getting angry)\n\t\tI'm talking about Italians!\n\n\t\t\t\tROSATO\n\t\tWhat about Michael Corleone?\n\n\t\t\t\tPENTANGELI\n\t\tHe supports me.\n\n\t\t\t\tROSATO\n\t\tMaybe, yes... maybe no.\n\nOne of Pentangeli's men approaches with a plate of Italian\nfood.\n\nPentangeli stands up, angered by this remark of Rosato's; he\npushes the dish of food out of the surprised Bodyguard's\nhands.\n\n\t\t\t\tPENTANGELI\n\t\tYou drove old Pete Clemenza to his\n\t\tgrave, Carmine; you and your\n\t\tbrother.  Turning on him; trouble\n\t\tin his territories -- you and your\n\t\tdemands.  I hold you responsible,\n\t\tjust as though you shot him in the\n\t\thead.  And I ain't gonna let that\n\t\tgo for long!\n\nPentangeli walks out of the restaurant; there's a little\ntension between the bodyguards of the two factions.\n\n\t\t\t\tROSATO (O.S.)\n\t\tHey, Five-Angels...\n\nHe gives him the arm.\n\nFrankie's face turns red, like he wants to have it out here\nand now; but Willy Cicci calms his down, and they all make\ntheir move out.\n\nEXT. THE RESTAURANT - DAY\n\nPentangeli gets into the car.\n\n\t\t\t\tPENTANGELI\n\t\tNobody I hate calls me Five-Angels\n\t\tto my face!\n\nHe slams the door.\n\nEXT. PENTANGELI'S LONG BEACH ESTATE - DAY\n\nPart of the old estate of Don Corleone.  By now, the wall\nhas been torn down, and the other houses sold off.\n\nHis car is parked; Pentangeli steps out, still angry over\nthe confrontation.  As he approaches the house, he notices\nsomething strained about the bodyguards who discreetly guard\nhis house.  No one seems to want to tell him.\n\n\t\t\t\tPENTANGELI\n\t\tWhat's up?\n\nPentangeli glances over to the front door foyer.\n\nPENTANGELI'S VIEW\n\nThe strange and silent Bussetta, the man who now always\ntravels with Michael.\n\nINT. PENTANGELI'S HOUSE - DAY\n\nPentangeli enters; he sees his WIFE, standing oddly in the\nhallway.\n\n\t\t\t\tPENTANGELI\n\t\t\t(Sicilian)\n\t\tWhat's this?\n\n\t\t\t\tWIFE\n\t\tMichael Corleone.\n\n\t\t\t\tPENTANGELI\n\t\tOne Michael Corleone...Dove?\n\n\t\t\t\tWIFE\n\t\t\t(Sicilian)\n\t\tHe's in your study.\n\nHe knows it is very very serious for Michael to be here in\nhis home.\n\nHe automatically moves into his study.\n\nINT. PENTANGELI'S STUDY - DAY\n\nMichael stands quietly in the room.  This was once his\nfather's study, although it is totally redecorated.\nPentangeli starts sweating, and moves toward the young Don,\nand kisses his hand.\n\n\t\t\t\tPENTANGELI\n\t\tDon Corleone, I wish you let me\n\t\tknow you was coming.  We could have\n\t\tprepared something for you.\n\n\t\t\t\tMICHAEL\n\t\tI didn't want you to know I was\n\t\tcoming.  You heard what happened in\n\t\tmy home?\n\n\t\t\t\tPENTANGELI\n\t\tMichael, yes, we was all relieved...\n\n\t\t\t\tMICHAEL\n\t\t\t(furious)\n\t\tIn my home!  In the same room where\n\t\tmy wife was sleeping; where my\n\t\tchildren come in their pajamas, and\n\t\tplay with their toys.\n\nHe's terrified Pentangeli with his anger; then, just as\nsuddenly, he talks quietly, calmly.\n\n\t\t\t\tMICHAEL\n\t\tI want you to help me take my\n\t\trevenge.\n\n\t\t\t\tPENTANGELI\n\t\tMichael, anything.  What is it I\n\t\tcan do for you?\n\n\t\t\t\tMICHAEL\n\t\tI want you to settle these troubles\n\t\twith the Rosato Brothers.\n\n\t\t\t\tPENTANGELI\n\t\tI was just going to contact you,\n\t\tMichael; we just had a 'sit-down' -\n\t\tin fact, I just come from there.\n\n\t\t\t\tMICHAEL\n\t\tI want you to settle on their terms.\n\n\t\t\t\tPENTANGELI\n\t\tMike, I don't understand.  Don't\n\t\task me to do that.\n\n\t\t\t\tMICHAEL\n\t\tTrust me; do as I ask.\n\n\t\t\t\tPENTANGELI\n\t\tIt would be the beginning of the\n\t\tend for my family.  How can I keep\n\t\tall my other territories in like if\n\t\tI let two wise-guys stand up and\n\t\tdemand this and that, and then give\n\t\tit to them?\n\n\t\t\t\tMICHAEL\n\t\tFrankie...do you respect me?  Do I\n\t\thave your loyalty?\n\n\t\t\t\tPENTANGELI\n\t\tAlways... But sometimes I don't\n\t\tunderstand.  I know I'll never have\n\t\tyour kind of brains, in big deals.\n\t\tBut Mike, this is a street thing.\n\t\tAnd Hyman Roth in Miami is behind\n\t\tthe Rosato Brothers.\n\n\t\t\t\tMICHAEL\n\t\tI know.\n\n\t\t\t\tPENTANGELI\n\t\tThen why do you want me to lay down\n\t\tto them?\n\n\t\t\t\tMICHAEL\n\t\t\t(coldly, but convincing)\n\t\tFrankie, Roth tried to have me\n\t\tkilled.  I'm sure it was him, but I\n\t\tdon't know yet why.\n\n\t\t\t\tPENTANGELI\n\t\tJesus Christ, Michael, then let's\n\t\thit 'em now, while we still got the\n\t\tmuscle.\n\n\t\t\t\tMICHAEL\n\t\tThis was my father's old study.\n\t\tWhen I was a kid, we had to be\n\t\tquiet when we played near here.\n\t\tWhen I was older, I learned many\n\t\tthings from him here.  I was happy\n\t\tthat this house never went to\n\t\tstrangers; first Clemenza took it\n\t\tover, and then you.  My father\n\t\ttaught me, in this room, never to\n\t\tact until you know everything\n\t\tthat's behind things.  Never.  If\n\t\tHyman Roth sees that I interceded\n\t\twith you in the Rosato Brothers'\n\t\tfavor, he'll think his relationship\n\t\twith me is still sound.  I'm going\n\t\tsomewhere to meet him tomorrow.  We\n\t\thave friends in some very important\n\t\tbusiness that we're making.  Do\n\t\tthis for me; you make the peace\n\t\twith the Rosato Brothers on their\n\t\tterms.  Let the word out that I\n\t\tforced you; you're not happy wit\n\t\thit, but acquiesced, just because\n\t\tof me.  It will get back to Hyman\n\t\tRoth.  Do this, Frankie.  You can\n\t\ttrust me.\n\n\t\t\t\tPENTANGELI\n\t\tSure, Mike.  I'll go along.\n\n\t\t\t\tMICHAEL\n\t\tGood.\n\nThey embrace; Michael kisses him.  He looks at the young\nDon, thoughtfully.\n\nINT. TROPICANA HOTEL - CLOSE VIEW - DAY\n\nThe money trays are carefully unloaded from the gaming\ntables, and put on a cart with others.\n\nThe cart, preceded and followed by security guards, is then\nwheeled through the casino, into a private, counting room.\n\nINT. COUNTING ROOM - MED. VIEW - DAY\n\nThe guards leave the room; the door is locked after them,\nleaving only Hagen.  Neri and an ACCOUNTANT, a very fat man.\nThe numbered boxes are opened, and cash and checks are\nspread out on the counting table.\n\nThe accountant begins with amazing speed and skill, to count\nand divide the money.\n\n\t\t\t\tNERI\n\t\tFifteen percent skim?\n\n\t\t\t\tHAGEN\n\t\tTwenty-five this time.\n\nThe accountant stops, and looks up to Neri.\n\n\t\t\t\tNERI\n\t\tIt might show.\n\n\t\t\t\tHAGEN\n\t\tMike wants it.\n\nNeri nods, and the accountant continues.  Neri opens a door,\nallowing a sandy-haired man, a COURIER, into the room.  The\ncream is placed into his pouch personally by Neri.\n\n\t\t\t\tNERI\n\t\tWe've never sent this much with one\n\t\tcourier.\n\n\t\t\t\tHAGEN\n\t\t\t(to the courier)\n\t\tYour plans are a little different\n\t\tthis time.  You skip Miami, and go\n\t\tstraight to Geneva.  It's to be\n\t\tdeposited to this number.\n\t\t\t(handing him a small envelope)\n\t\tAnd it's got to be there by Monday\n\t\tmorning, no slip-up.\n\n\t\t\t\tCOURIER\n\t\tI think I was 'picked-up' last trip.\n\t\tThat hour layover I had at Kennedy.\n\t\tI went over and bought a paper...\n\nNeri has finished putting the 'creamed' money into the pouch.\n\n\t\t\t\tNERI\n\t\tThose were our people.\n\n\t\t\t\tCOURIER\n\t\tOkay, just thought you should know.\n\nHe is just about to close and lock the pouch, when Hagen\ngestures that he should wait, and adds more stacks of\ncarefully packaged bills into the pouch.  Then Neri locks\nit, and handcuffs it to the courier's arm, looking\ninquiringly at Hagen.\n\n\t\t\t\tHAGEN\n\t\tLet them count.\n\nThe courier is shown out through a private door, and then\nthe first door is opened.  Two accountants come in with the\nguards, and the trays are opened, and the counting process\nis begun all over again, this time with the State Tally\nsheets.\n\nINT. TROPICANA CORRIDOR - MOVING VIEW - DAY\n\nThe courier continues on his way; followed by Hagen and Neri.\n\n\t\t\t\tNERI\n\t\tWhat's up?\n\n\t\t\t\tHAGEN\n\t\tNo questions.\n\n\t\t\t\tNERI\n\t\tI got to ask questions, Tom,\n\t\tthere's three million dollars cash\n\t\tin that pouch; Mike is gone and I\n\t\thave no word from him.\n\n\t\t\t\tHAGEN\n\t\tAl, as far as you're concerned, I'm\n\t\tthe Don.\n\n\t\t\t\tNERI\n\t\tHow do I know you haven't gone into\n\t\tbusiness for yourself?\n\nThis hurts Tom; but he is a reasonable man, and he knows he\nowes Neri some explanation.\n\n\t\t\t\tHAGEN\n\t\tYou've been through a lot with us\n\t\tso I'm going to give you the truth.\n\t\tMike knows it was someone within\n\t\tthe compound that set him up for\n\t\tthat hit.  So nobody is to know\n\t\twhere he is, not you, not Rocco,\n\t\tnot even his brother Fredo.  Sorry,\n\t\tAl, I know how you feel about\n\t\tMike...but he still remembers Tessio.\n\nEXT. KEY WEST - NIGHT\n\nMichael is led to a desolate, night-lit private dock.  He is\nfollowed by the ever-present Bussetta, and they are helped\nonto a light-weight, luxury cabin cruiser.  The crew cast\noff various ropes, and the boat sets out into the night.\n\n\t\t\t\t\t\t\tFADE OUT.\n\nFADE IN:\n\nEXT. TAHOE ESTATE - DAY\n\nA seaplane lands nicely by the private Corleone harbor;\nHagen disembarks with his inevitable overloaded briefcase.\nHe continues down the ramp, past several Buttonmen, dressed\nin summer casual attire, and who resemble secret service men\nrather than thugs.\n\nHis wife THERESA lies on a blanket on the great lawn, with\nher youngest children, who run to their father for a kiss.\n\n\t\t\t\tTHERESA\n\t\tHungry?\n\n\t\t\t\tHAGEN\n\t\tJust a little.\n\n\t\t\t\tTHERESA\n\t\tI've invited Mama, Sandra and the\n\t\tkids for barbecue.\n\n\t\t\t\tHAGEN\n\t\tWhat about Kay?\n\n\t\t\t\tTHERESA\n\t\tI couldn't find her.  She's been so\n\t\tbroody, sticks to herself.\n\nEXT. TAHOE LAWN BARBECUE - MED. VIEW - DAY\n\nHagen and Sonny's boys are throwing a football around on the\nlawn; the littler kids running after them.\n\nCoals are burning in the old style stone barbecue, and\nseveral tables are set for the family.\n\nIn the distance, there is always evidence of the bodyguards.\n\nTheresa, Mama and Sandra prepare the steaks.\n\nHagen relaxes in a sports shirt.\n\n\t\t\t\tHAGEN\n\t\tLet me try Kay.\n\nHe crosses the lawn, to the house on the beach where Michael\nand his family live.  Is about to knock on the door:\n\n\t\t\t\tHAGEN'S SON\n\t\tHey, Pop, heads up!\n\nThe football is flying in his direction; he catches it and\nthrows it back.  Then he cracks the door open, and peeks in.\n\nINT. MICHAEL'S HOUSE - DAY\n\n\t\t\t\tHAGEN\n\t\tKay?\n\nHe steps in, the beautiful summer living room is neat, but\nempty.\n\n\t\t\t\tHAGEN\n\t\tAnyone hungry?\n\nHe moves through the house more quickly; into the dining and\nrecreation room areas.  A cat jumps off a pile of cushions\nand runs across the room.\n\n\t\t\t\tHAGEN\n\t\tHello?\n\n\t\t\t\tSANDRA (O.S.)\n\t\tShe's gone, Tom.\n\nSandra has followed him into Michael's house.\n\n\t\t\t\tHAGEN\n\t\tWhat do you mean gone?\n\n\t\t\t\tSANDRA\n\t\tThe Barretts from Rubicon Bay came\n\t\tby in a new speedboat.  Rocco tried\n\t\tto say she wasn't in, but Kay\n\t\tspotted them and asked if they\n\t\twould take her and the kids for a\n\t\tride.  That was three hours ago.\n\n\t\t\t\tHAGEN\n\t\t\t(furious)\n\t\tWhy didn't someone tell me!\n\n\t\t\t\tSANDRA\n\t\tI wanted to tell you alone; your\n\t\twife doesn't know what's going on.\n\nHagen rushes out of the house.\n\nEXT. TAHOE LAWN - DAY\n\nHagen moves quickly out of Michael's house; moving across\nthe lawn to the boathouse.\n\n\t\t\t\tHAGEN'S SON\n\t\tHey, Dad!\n\nThis time he ignores the thrown ball, and moves directly to\nRocco, who is by some men near the boathouse.\n\n\t\t\t\tHAGEN\n\t\tRocco!\n\n\t\t\t\tROCCO\n\t\tI know.  I went down to the Barrett\n\t\thouse.  But she's gone.  They drove\n\t\ther and the kids to North Tahoe\n\t\tairport.\n\n\t\t\t\tHAGEN\n\t\tGoddamn it, where were you?\n\n\t\t\t\tROCCO\n\t\tI was in my house.  Willy tried,\n\t\tbut it would have taken some\n\t\tstrong-arm to stop her, and he\n\t\tfigured you wouldn't want that.\n\nINT. THE BOATHOUSE - DAY\n\nThey enter the boathouse.\n\n\t\t\t\tHAGEN\n\t\t\t(to one of the men)\n\t\tGet me a Scotch and water.\n\nThe man hurries behind the bar.\n\n\t\t\t\tROCCO\n\t\tShe took a flight to San Francisco.\n\t\tWe figure she's going to connect to\n\t\tNew Hampshire; her parents' place.\n\n\t\t\t\tHAGEN\n\t\t\t(almost to himself)\n\t\tI can't let him down.\n\nHe swallows the drink down in several gulps.  And then looks\nup to his men watching him.  He's embarrassed to have shown\nsuch weakness.\n\n\t\t\t\tHAGEN\n\t\tAll right, let me think a minute.\n\nRocco clears the men out.\n\n\t\t\t\tROCCO\n\t\tMe too, Tom?\n\n\t\t\t\tHAGEN\n\t\tYeah, give me a minute.\n\nRocco gone, Hagen moves behind the enormous bar, and pours\nhimself a giant drink.  He drinks that, and calms himself.\n\n\t\t\t\tHAGEN\n\t\tOh Christ, Pop.  It was so good\n\t\twhen you were alive.  I felt I\n\t\tcould handle anything...\n\nEXT. VIEW FROM BOAT - FULL VIEW - DAY\n\nA beautiful coastal view of a tropical Caribbean city.  An\nextraordinary view, high buildings, palm trees, all set\nright on the bay.\n\nMED. CLOSE VIEW ON MICHAEL\n\non the cruiser, Bussetta a little distance away, watching,\nbut never speaking.  The dark-skinned CAPTAIN of the cruiser\nkeeps pointing repeatedly.\n\n\t\t\t\tCAPTAIN\n\t\tHabana, Habana.\n\nEXT. HAVANA STREET - MOVING VIEW - DAY\n\nMichael and Bussetta are driven in a Mercury sedan, making\nits way through the streets of Havana.\n\nCLOSE VIEW ON MICHAEL\n\nlooking out the window.\n\nMICHAEL'S POV\n\nCrowded streets, occasional roving bands playing for the\ntourists; there is much evidence of tourism: Americans\nwalking through the streets with cameras.  Occasionally, we\nsee a Cuban with a row of numbers attached to his hat,\ncarrying a big sheet of the daily lottery numbers.  From all\nof these street impressions, the city is booming with\nactivity, but there is also much evidence of whores and\npimps and little children begging in the streets.\n\nMED. VIEW\n\nThe big American car stops at an intersection.  Bussetta is\nsitting in the forward passenger side; while Michael is in\nthe back.  He hears tapping on the window; he turns and sees\nfour Cuban boys tapping on his window and extending their\nhands, and rubbing their stomachs as though they were hungry.\nThe Cuban driver rolls down his window and shouts them away\nin Spanish.\n\nINT. HAVANA CASINO LOBBY - MOVING VIEW - NIGHT\n\nMichael is led through a beautiful wooden lobby of the\nhotel, done in Spanish style, apparently just recently\ncompleted.  He is approached by a thin, mousy man, SAM ROTH,\nwho ushers him toward the casino entrance.\n\n\t\t\t\tSAM ROTH\n\t\tHiya, Mr. Corleone, I'm Sam Roth.\n\t\tWelcome to the Capri; my brother's\n\t\tupstairs.  You wanta take a rest\n\t\tbefore you see him, or can I get\n\t\tyou something, anything at all?\n\n\t\t\t\tMICHAEL\n\t\tNo, I'm fine.\n\nHe leads Michael into the main casino.\n\n\t\t\t\tSAM ROTH\n\t\tThis is it!  We think it makes\n\t\tVegas look like the corner crap game.\n\n\t\t\t\tMICHAEL\n\t\tVery impressive.\n\n\t\t\t\tSAM ROTH\n\t\tJake, Jake, come over here.  Mike,\n\t\tI want you to meet Jake Cohen; he\n\t\tmanages the casino for us.\n\n\t\t\t\tCOHEN\n\t\t\t(appreciating\n\t\t\tMichael's status)\n\t\tMr. Corleone.\n\nSam turns to Bussetta and extends his glad-hand.\n\n\t\t\t\tSAM ROTH\n\t\tPleasure to meet you, I'm sure...\n\nHe gets no response whatsoever from Bussetta.\n\nINT. PRESIDENTIAL PALACE - NIGHT\n\nAn extremely tall, well-built Cuban, tanned and wearing an\nattractive mustache, LEON, in his middle forties, reads from\na prepared paper.  His sentences are translated by a smaller\nman, standing to his rear.\n\n\t\t\t\tLEON\n\t\t\t(Spanish)\n\t\tMost respected gentlemen, allow me\n\t\tto welcome you to the City of\n\t\tHavana, the Republic of Cuba on\n\t\tbehalf of His Excellency, Fulgencio\n\t\tBatista.\n\nTHE VIEW BEGINS TO MOVE along the various men gathered for\nthis meeting.\n\n\t\t\t\tLEON (O.S.)\n\t\tI'd like to thank this distinguished\n\t\tgroup of American Industrialists,\n\t\tfor continuing to work with Cuba,\n\t\tfor the greatest period of\n\t\tprosperity in her entire history.\n\t\tMr. William Proxmiro, representing\n\t\tthe General Fruit Company... Messrs.\n\t\tCorngold and Dant, of the United\n\t\tTelephone and Telegraph Company; Mr.\n\t\tPetty, regional Vice-President of\n\t\tthe Pan American Mining Corporation;\n\t\tand, of course, our friend Mr.\n\t\tRobert Allen, of South American\n\t\tSugar.  Mr. Nash of the American\n\t\tState Department.  And Mr. Hyman\n\t\tRoth of Miami, and Michael Corleone\n\t\tof Nevada representing our\n\t\tAssociates in Tourism and Leisure\n\t\tActivities.\n\nVIEW ON THE ENTIRE GROUP\n\nLeon pauses to take a drink of water.  Then proudly, he\nlifts a shiny yellow telephone for all to see.\n\n\t\t\t\tLEON\n\t\tThe President would like to take\n\t\tthis opportunity to thank U T&T for\n\t\ttheir lovely gift: a solid gold\n\t\ttelephone!  He thought all you\n\t\tgentlemen would care to take a look\n\t\tat it.\n\nHe hands the heavy phone set to one of his aides, and it is\npassed in turn to each of the men in attendance.\n\n\t\t\t\tCORNGOLD\n\t\tYour Excellency, perhaps you could\n\t\tdiscuss the status of rebel activity\n\t\tand how this may affect our\n\t\tbusinesses.\n\nMED. CLOSE VIEW ON MICHAEL\n\nHe receives the telephone, and glances at it before passing\nit on to Hyman Roth.\n\n\t\t\t\tLEON (O.S.)\n\t\tOf course.  The rebel movement is\n\t\tbasically unpopular, and since July\n\t\tof 1958 has been contained in the\n\t\tOriente Province, in the mountains\n\t\tof the Sierra Muestre.\n\nMichael passes the phone on to Roth.\n\n\t\t\t\tLEON\n\t\t\t(continuing)\n\t\tWe began a highly successful\n\t\toffensive against them in March,\n\t\tand activities within the city\n\t\titself are at a minimum.  I can\n\t\tassure you we'll tolerate no\n\t\tguerrillas in the casinos or\n\t\tswimming pools!\n\nGeneral subdued laughter.\n\nA CUBAN STREET - LATE DAY\n\nPolice are stopping traffic.  Michael's Mercury is among the\ncars; a police officer, seeing that some important person is\nbeing driven, walks up to the driver.  He leans forward, and\nsays something in Spanish to the driver.\n\nThe driver, in turn, leans over to Michael.\n\n\t\t\t\tDRIVER\n\t\tHe says it will just be a short\n\t\ttime and they'll let us through.\n\nMichael looks out the window.\n\nMICHAEL'S VIEW\n\nThe old building has been totally surrounded by police and\nmilitary vehicles.  Right at this moment, they are waiting\nlazily, but soldiers are there with automatic weapons ready.\nThere is a momentary commotion inside the building, and the\nmen brace up.  A Captain of the Army detachment says\nsomething in Spanish over a megaphone; and his men put their\nweapons at the ready, as other policemen lead a group of\ncivilians out of the building with their hands up.\n\nThey are moved over to some military truck, where they are\nfrisked before being loaded.\n\nAll of a sudden, one of the civilian rebels breaks loose,\nand rushes toward the command vehicle.  He hurls himself\ninto the vehicle, as two police try to pull him out.  A\nsecond later, and there is an explosion; the man obviously\nhaving hidden a grenade on his body, sacrificing his own\nlife to take the life of the Captain.\n\nThere is a commotion, but the military quickly quell it.\n\nCLOSE VIEW ON MICHAEL\n\nwatching.  The police rush to Michael's car and guide it\noutside of the trouble area.\n\nMED. VIEW\n\nas they lead and escort the Mercury out of the area.\n\nEXT. HAVANA COUNTRY CLUB - CLOSE VIEW - DAY\n\nSome glasses; rum is poured into them; then Coca Cola.\nQuarter limes are squeezed.\n\n\t\t\t\tSAM ROTH (O.S.)\n\t\tRum... Coca Cola...a squeeze of\n\t\tfresh lime...\n\nSam prepares the drinks for his brother, Hyman, and a group\nof men, including Michael.\n\n\t\t\t\tMAN\n\t\tCuba Libres.\n\n\t\t\t\tMICHAEL\n\t\tI was told the Cubans now call this\n\t\tdrink: \"La Mentira.\"\n\n\t\t\t\tROTH\n\t\tI still don't speak Spanish, Michael.\n\n\t\t\t\tMICHAEL\n\t\tIt means... \"The Lie.\"\n\nA moment's hesitation, then a few of the men laugh.  Now two\nCubans in white carry a table which has a lovely small cake\non it.\n\n\t\t\t\tSAM ROTH\n\t\tThe cake is here.\n\nThey all raise their glasses to the old man.\n\n\t\t\t\tEVERYONE\n\t\t\t(ad lib)\n\t\tHappy Birthday!\n\nRoth glances at the cake and its inscription, is pleased.\n\n\t\t\t\tROTH\n\t\tI hope my age is correct: I am\n\t\talways accurate about my age.\n\nSome laugh.  He nods, and they begin to cut it, put a piece\non plates, and carry them to the different men.\n\n\t\t\t\tROTH\n\t\tEverything we've learned in Vegas\n\t\tis true here; but we can go further.\n\t\tThe bigger, the swankier, the\n\t\tplusher the store, the more a sense\n\t\tof legitimacy, and the bigger\n\t\tbusiness we do.\n\t\t\t(looking at the plate\n\t\t\tbrought to him)\n\t\tA smaller piece.  What we've\n\t\tproposed to the Cuban Government is\n\t\tthat it put up half the cash on a\n\t\tdollar for dollar basis.\n\t\t\t(accepting a smaller piece)\n\t\tThank you.  We can find people in\n\t\tthe United States who will put up\n\t\tour share for a small piece of the\n\t\taction, yet we will retain control.\n\n\t\t\t\tONE OF THE MEN\n\t\tHow much?\n\n\t\t\t\tROTH\n\t\tA hundred million dollars.  But\n\t\tonly if this Government relaxes its\n\t\trestrictions on importing building\n\t\tmaterials; we'll need some new\n\t\tlaws, too, but that will be no\n\t\tdifficulty.\n\n\t\t\t\tANOTHER MAN\n\t\tWhat are import duties now?\n\n\t\t\t\tROTH\n\t\tAs much as seventy percent.  Also,\n\t\tI'm working out an arrangement with\n\t\tthe Minister of Labor so that all\n\t\tour pit bosses, stick-men and\n\t\tDealers, can be considered\n\t\tspecialized technicians eligible\n\t\tfor two year visas.  As of now\n\t\tthey're only allowed in Cuba for\n\t\tsix months at a time.  In short,\n\t\twe're in a full partnership with\n\t\tthe Cuban Government.\n\nVIEW ON MICHAEL\n\nis handed a piece of cake.  Roth moves over to a folder of\ndocuments.\n\n\t\t\t\tROTH\n\t\t\t(continuing)\n\t\tHere are applications from Friends\n\t\tall over the States.  I understand\n\t\tSanto Virgilio in Tampa is trying\n\t\tto make his own deal.  Well, the\n\t\tCuban Government will brush him off.\n\t\tThe Lakeville Road Boys are going\n\t\tto take over the Nacionale here.\n\t\tI'm planning a new hotel casino to\n\t\tbe known as Riviera.  The new Capri\n\t\twill go to the Corleone Family.\n\nMED. VIEW\n\nThe cake is sliced and carried to each of the men.\n\n\t\t\t\tROTH\n\t\tThen there's the Sevilla Biltmore;\n\t\tthe Havana Hilton, which is going\n\t\tto cost twenty-four million --\n\t\tCuban banks will put up half, the\n\t\tTeamsters will bankroll the rest.\n\t\tGenerally, there will be friends\n\t\tfor all our friends including the\n\t\tLieutenant Governor of Nevada;\n\t\tEddie Levine of Newport will bring\n\t\tin the Pennino Brothers, Dino and\n\t\tEddie; they'll handle actual casino\n\t\toperations.\n\nAnd seeing that all of his friends have been served, Roth\nraises his fork.\n\n\t\t\t\tROTH\n\t\tEnjoy.\n\n\t\t\t\tMICHAEL\n\t\tI saw an interesting thing today.\n\t\tA man was being arrested by the\n\t\tMilitary Police; probably an urban\n\t\tguerrilla.  Rather than be taken\n\t\talive, he exploded a grenade hidden\n\t\tin his jacket, taking the command\n\t\tvehicle with him.\n\nThe various men look up as Michael eats his cake, wondering\nwhat the point of it is.\n\n\t\t\t\tMICHAEL\n\t\tIt occurred to me: the police are\n\t\tpaid to fight, and the Rebels are\n\t\tnot.\n\n\t\t\t\tSAM ROTH\n\t\tSo?\n\n\t\t\t\tMICHAEL\n\t\tSo, that occurred to me.\n\nVIEW ON ROTH\n\nHe understands Michael's point, if the others do not.\n\n\t\t\t\tROTH\n\t\tThis country has had rebels for the\n\t\tlast fifty years; it's part of\n\t\ttheir blood.  Believe me, I know...\n\t\tI've been coming here since the\n\t\ttwenties; we were running molasses\n\t\tout of Havana when you were a baby.\n\t\tTo trucks owned by your father.\n\t\t\t(he chuckles warmly\n\t\t\tover the memory)\n\t\tWe'll talk when we're alone.\n\nAnd he returns his attention to the men who are gathered\nwith him on his birthday.\n\nEXT. ROTH'S PRIVATE TERRACE - DAY\n\nMichael sits alone with the old man, on a terrace that\noverlooks the city.\n\n\t\t\t\tROTH\n\t\tYou have to be careful what you say\n\t\tin front of the others... they\n\t\tfrighten easy.  It's always been\n\t\tthat way, most men frighten easy.\n\n\t\t\t\tMICHAEL\n\t\tWe're making a big investment in\n\t\tCuba.  That's my only concern.\n\n\t\t\t\tROTH\n\t\tMy concern is that the three\n\t\tmillion never arrived at Batista's\n\t\tnumbered account in Switzerland.\n\t\tHe thinks it's because you have\n\t\tsecond thoughts about his ability\n\t\tto stop the rebels.\n\n\t\t\t\tMICHAEL\n\t\tThe money was sent.\n\n\t\t\t\tROTH\n\t\tThen you have to trace it.  Michael,\n\t\tpeople here look at me as a reliable\n\t\tman.  I can't afford not to be\n\t\tlooked on as a reliable man.  But\n\t\tyou know all that; there's nothing\n\t\tyou can learn from me.  You\n\t\tshouldn't have to put up with a\n\t\tsick old man as a partner.\n\n\t\t\t\tMICHAEL\n\t\tI wouldn't consider anyone else.\n\n\t\t\t\tROTH\n\t\tExcept the President of the United\n\t\tStates.\n\nHe laughs slyly, as though this is some private joke between\nthem.  Then his laughter becomes a cough, which he painfully\nstifles with a handkerchief.\n\n\t\t\t\tROTH\n\t\tIf only I could live to see it,\n\t\tkid; to be there with you.  How\n\t\tbeautifully we've done it, step by\n\t\tstep.  Here, protected, free to\n\t\tmake our profits without the\n\t\tJustice Department, the FBI; ninety\n\t\tmiles away in partnership with a\n\t\tfriendly government.  Ninety miles,\n\t\tjust a small step, looking for a\n\t\tman who desperately wants to be\n\t\tPresident of the United States, and\n\t\thaving the cash to make it possible.\n\n\t\t\t\tMICHAEL\n\t\tYou'll be there to see it; you'll\n\t\tbe there.\n\nINT. MICHAEL'S SUITE - NIGHT\n\nThe telephone has just rung; Michael listens.\n\n\t\t\t\tOPERATOR\n\t\tWe have your call to Tahoe, Nevada,\n\t\tsir.\n\n\t\t\t\tMICHAEL\n\t\tThank you.\n\t\t\t(click, click)\n\t\tTom?  Tom, is that you?\n\n\t\t\t\tROCCO (O.S.)\n\t\tNo, Tom's out of town.  This is\n\t\tRocco.  Who is this?\n\nMichael is openly disturbed that Hagen is not there.  He\nhangs up without answering.\n\nEXT. NEW ENGLAND HOUSE - DAY\n\nTom Hagen steps out of a taxicab a bit tentatively, and then\nsteps toward the door of a pleasant New England house.  He\nrings the bell and waits, hat in hand.  A moment later, the\ndoor opens, and Kay is standing there.\n\n\t\t\t\tKAY\n\t\tI'm not surprised to see you, Tom.\n\nINT. SMALL ROOM - NEW ENGLAND HOUSE - MED. VIEW - DAY\n\nOut to the yard, where we can see glimpses of little Anthony\nplaying by himself.\n\n\t\t\t\tKAY (O.S.)\n\t\tI can't love a man like that; I\n\t\tcan't live with him, I can't let\n\t\thim be father to my children.  Look.\n\nThe little boy, moodily by himself.\n\nVIEW ON KAY\n\nobviously moved.\n\n\t\t\t\tKAY\n\t\tHe's not like a little boy... he\n\t\tdoesn't talk to me; he doesn't want\n\t\tto play; he doesn't like other\n\t\tchildren, he doesn't like toys.\n\t\tIt's as though he's waiting for the\n\t\ttime he can take his Father's place.\n\t\t\t(almost in tears)\n\t\tYou know what he told me when he\n\t\twas four years old.  He said he had\n\t\tkilled his Grandfather...\n\nVIEW ON HAGEN\n\nlistening, calmly.\n\n\t\t\t\tKAY\n\t\t... He said he had shot his\n\t\tGrandfather with a gun, and then he\n\t\tdied in the garden.  And he asked\n\t\tme... he asked me, Tom, if that\n\t\tmeant now his father would shoot\n\t\thim out of... revenge.\n\t\t\t(she cries)\n\t\tHow does a four year old boy learn\n\t\tthe word... 'revenge'?\n\n\t\t\t\tHAGEN\n\t\tKay... Kay...\n\nVIEW ON KAY\n\n\t\t\t\tKAY\n\t\tWhat kind of a family is this...\n\t\tare we human beings?  He knows his\n\t\tFather killed his Uncle Carlo.  He\n\t\theard Connie.\n\n\t\t\t\tHAGEN\n\t\tYou don't know that's true.  But\n\t\tKay, just for the sake of an\n\t\targument, let's assume it is, I'm\n\t\tnot saying it is, remember, but...\n\t\tWhat if I gave you what might be\n\t\tsome justification for what he\n\t\tdid... or rather some possible\n\t\tjustification for what he possibly\n\t\tdid.\n\n\t\t\t\tKAY\n\t\tThat's the first time I've seen the\n\t\tlawyer side of you, Tom.  It's not\n\t\tyour best side.\n\n\t\t\t\tHAGEN\n\t\tOkay, just hear me out.  What if\n\t\tCarlo had been paid to help get\n\t\tSonny killed?  What if his beating\n\t\tof Connie that time was a deliberate\n\t\tplot to get Sonny out into the open?\n\t\tThen what?  And what if the Don, a\n\t\tgreat man, couldn't bring himself\n\t\tto do what he had to do, avenge his\n\t\tson's death by killing his\n\t\tdaughter's husband?  What if that,\n\t\tfinally, was too much for him, and\n\t\the made Michael his successor,\n\t\tknowing that Michael would take\n\t\tthat load off his shoulders, would\n\t\ttake that guilt?\n\n\t\t\t\tKAY\n\t\tHe's not the same as when I met him.\n\n\t\t\t\tHAGEN\n\t\tIf he were, he'd be dead by now.\n\t\tYou'd be a widow.  You'd have no\n\t\tproblem.\n\n\t\t\t\tKAY\n\t\tWhat the hell does that mean?  Come\n\t\ton, Tom, speak out straight once in\n\t\tyour life.  I know Michael can't,\n\t\tbut you're not Sicilian, you can\n\t\ttell a woman the truth; you can\n\t\ttreat her like an equal, a fellow\n\t\thuman being.\n\nThere is a long silence.\n\nThen Hagen shakes his head; he can tell her no more.\n\n\t\t\t\tHAGEN\n\t\tIf you told Michael what I've told\n\t\tyou today, I'm a dead man.\n\n\t\t\t\tKAY\n\t\tWhen is it finally over?  I want it\n\t\tto be over before my baby is born.\n\n\t\t\t\tHAGEN\n\t\tI don't know.  I hope soon; but\n\t\tit's not over yet, and that's why\n\t\tyou and the kids have to come back\n\t\tto me.\n\nHe looks at her; it's clear that he has been entrusted with\nher safety and her children's.\n\nHe is a kind, good man, and seems very nervous and\noverwrought.\n\nVIEW ON THE WINDOW\n\nLittle Anthony is pressing his face against the glass pane,\nas though he senses the adults are discussing something of\nimportance to him.\n\nINT. TROPICANA HOTEL-CASINO - MED. VIEW - NIGHT\n\nThe Baccarat table.  Busy, hundred dollar bills being played.\n\n\t\t\t\tLOUDSPEAKER\n\t\tMr. Corleone; Mr. Freddie Corleone,\n\t\ttelephone please.\n\n\t\t\t\tPIT BOSS\n\t\tNot here.\n\nVIEW ON THE CRAP TABLES\n\nThe play is fast; pit boss presiding; but no sign of Fredo.\n\n\t\t\t\tLOUDSPEAKER\n\t\tTelephone for Mr. Corleone.\n\nANOTHER PART OF THE CASINO\n\nWe see Neri, ominous, presiding over the entire store.  He\npicks up a pit telephone.\n\n\t\t\t\tNERI\n\t\tHe's backstage.\n\t\t\t(and hangs up disgustedly)\n\nINT. TROPICANA BACKSTAGE AREA - MED. VIEW - NIGHT\n\nFredo is entertaining two showgirls done up in feathers and\nwhat-have-you.\n\n\t\t\t\tFREDO\n\t\tC'mon, you got fifteen minutes\n\t\tbefore the finale!  I want to show\n\t\tyou a trick with feathers.\n\n\t\t\t\tSTAGEHAND\n\t\tPhone for you.\n\n\t\t\t\tFREDO\n\t\tDon't go away; wait a minute.\n\nHe takes the phone; we can catch a VIEW of the show going on\nfrom the wings.\n\n\t\t\t\tFREDO\n\t\t\t(on the phone)\n\t\tYeah.  Okay.  Who?  Mikey?  But...\n\t\tSi... si, caposco.\n\t\t\t(in Sicilian)\n\t\tSure... how much?  I understand.\n\t\tJesus, three million... I won't let\n\t\tyou down.  Sure.\n\nHe hangs up thoughtfully.\n\n\t\t\t\tONE OF THE GIRLS\n\t\tFreddie; we still got twelve\n\t\tminutes before the finale!\n\n\t\t\t\tFREDO\n\t\tYeah... some other time.\n\nEXT. NEW YORK BAR - DAY\n\nThere is a light rain.  Pentangeli steps out of his car;\npoints to Willy Cicci.\n\n\t\t\t\tPENTANGELI\n\t\tWait in the car.\n\nHe walks up the street, to the bar, where he is greeted by\nthe tall, handsome Carmine Rosato.  They shake hands.\nPentangeli looks in his hand.\n\nCLOSE VIEW\n\nRosato has put a crisp one hundred dollar bill in his hand,\nfolded sharply in two.\n\n\t\t\t\tPENTANGELI\n\t\tWhat's this?\n\n\t\t\t\tROSATO\n\t\tThat's a lucky C note for our new\n\t\tdeal.\n\nHe puts his arm around Pentangeli, and they walk into the bar.\n\nINT. THE BAR - DAY\n\nThe bar is fairly empty; and very dark.  Pentangeli and\nRosato step up to the bar; the bartender momentarily stops\npolishing glasses to pour a couple of drinks.\n\n\t\t\t\tROSATO\n\t\tWe were all real happy about your\n\t\tdecision, Frankie; you're not goin'\n\t\tto regret it.\n\nHe holds up the glass.\n\n\t\t\t\tPENTANGELI\n\t\tI don't like the C-note.  I take it\n\t\tlike an insult.\n\nSuddenly, a garrote is thrown around Pentangeli's throat;\nand he is forcefully yanked back into the shadows, all the\nway into a wooden telephone booth.\n\nCLOSE VIEW\n\nThe folded hundred dollar bill resting on the bar.\n\nMED. CLOSE - THE PHONE BOOTH\n\nWe see only Pentangeli's feet and legs, struggling.  We HEAR\nthe terrible sounds of a man being strangled.\n\nCLOSE ON ROSATO\n\nCalm, and then he sees something that disturbs him.\n\n\t\t\t\tROSATO\n\t\tShit, your friend the cop!\n\nSuddenly, the side door opens, and a shaft of sunlight cuts\nthrough the darkness.\n\n\t\t\t\tCOP\n\t\tEverything all right in there,\n\t\tRitchie?  The door was open.\n\nCLOSE ON THE PHONE BOOTH\n\nPentangeli's feet stop moving.\n\n\t\t\t\tRITCHIE\n\t\tJust cleaning up.\n\t\t\t(strained voice)\n\t\tYou okay?\n\n\t\t\t\tCOP\n\t\tIs that something on the floor?\n\n\t\t\t\tROSATO\n\t\tTake him!\n\n\t\t\t\tVOICE\n\t\tOkay.\n\n\t\t\t\tRITCHIE\n\t\tNot here; not a cop, not here!\n\nTwo figures race through the shadows and race through the\ndoors.\n\n\t\t\t\tCOP\n\t\t\t(shouting to his\n\t\t\tpartner, in uniform)\n\t\tStutz!  Watch out, Stutz!\n\nEXT. THE BAR - DAY\n\nWe see that a patrol car had stopped for its routine visit.\nSTUTZ, the second patrolman, is just stepping out of his\ncar; Pentangeli's bodyguard, seeing the commotion, leaps out.\nThree men, including Rosato, rush out.  There is gunfire;\nCicci is wounded.\n\nMED. CLOSE\n\nThe patrolmen is grazed across the face; trying to stop the\nflow of blood with his hand.\n\nNEW VIEW\n\nThe three assailants jump into the car and drive off.\n\nINT. THE BAR - DAY\n\nThe stricken Pentangeli comes back to life.  He can barely\nmove his lips.\n\n\t\t\t\tPENTANGELI\n\t\tThe bastard.  The dirty bastard, he\n\t\tgave me a C-note.  He gave me a C-\n\t\tnote.\n\nHe sees the patrolman leaning over him.\n\nEXT. PATROL CAR - DAY\n\nThe Sergeant is on the car radio.\n\n\t\t\t\tSERGEANT\n\t\tFrankie Pentangeli murder attempt.\n\t\tPatrolman Stutz shot.  Sahara\n\t\tLounge - Utica Avenue and Claredon\n\t\tRoad.  White Cadillac three or four\n\t\tmen took off from scene.  Need\n\t\tambulance; Stutz is bad.  Taking\n\t\tPentangeli into custody...\n\nINT. ROTH'S SUITE IN HAVANA - MED. CLOSE VIEW ON ROTH - DAY\n\nHis wizened face, pale.  Right now, though, his eyes have a\nsparkle as he watches three million dollars in cold cash\nbeing counted on a card table in front of him.\n\nHis brother Sam is present, and the sandy-haired Courier, a\nlittle nervous; the one who had left from the Tropicana with\nthe Corleone skim-money.  Also Johnny Ola.  The money is\nevidently all there; Roth picks up a packet; probably a\nhundred thousand dollars, and throws it over to the Courier.\n\n\t\t\t\tROTH\n\t\tMake it fast; I don't want to\n\t\tchance him being seen.\n\n\t\t\t\tCOURIER\n\t\t\t(frightened)\n\t\tWhat about the arrangements?  How\n\t\tcan I be sure about the arrangements?\n\n\t\t\t\tOLA\n\t\tRelax.  You're under our protection;\n\t\tthe Corleone family will never find\n\t\tyou.\n\nOla leads the Courier to the adjoining room where two\nsmartly dressed Military (Cuban) Police are standing, and a\ncivilian.  The Courier sees them, looks back to Ola.  One of\nthe police steps forward, placing the Courier under arrest;\nhandcuffing him.\n\n\t\t\t\tCOURIER\n\t\tHey, what's this?\n\nThe other takes the packet of money, and hands it to the\ncivilian, who places it in the briefcase he carries.  The\nother officer kneels down and fastens leg manacles.\n\n\t\t\t\tCOURIER\n\t\tThe arrangements... YOU BASTARDS!\n\t\tWhat...\n\nThe Captain strikes him expertly across the side of his head\nwith his pistol.\n\nOla closes the door on this scene.\n\nEXT. THE HAVANA CAPRI - DAY\n\nFredo Corleone steps out of a car, squints up at the sunshine\nand palm trees.  He is holding on tightly to a small satchel,\nwhich he won't let the bellman carry along with his other\nthings.\n\nINT. MICHAEL'S SUITE - MED. CLOSE VIEW - DAY\n\nMichael and Fredo in a brother's embrace; they kiss each\nother.  Fredo is still in his jacket, holding the satchel.\n\n\t\t\t\tFREDO\n\t\tMikey.  How are you?\n\nHe glances up at Bussetta, who doesn't say a word.  Fredo\nextends his hand.\n\n\t\t\t\tFREDO\n\t\tHiya, Freddie Corleone.\n\n\t\t\t\tMICHAEL\n\t\tMio fratello.\n\nThen Bussetta offers his hand back to Fredo.\n\n\t\t\t\tFREDO\n\t\t\t(taking off his jacket)\n\t\tWhat a trip, Jesus Christ, the\n\t\twhole time I'm thinking what if\n\t\tsomeone knew what I got in here.\n\nHe undoes the combination of the briefcase starts taking out\ncash.  Then he stops, remembering that there's a stranger in\nthe room.\n\n\t\t\t\tFREDO\n\t\tOh, 'scuse me.\n\n\t\t\t\tMICHAEL\n\t\tIt's all right.  He stays with me\n\t\tall the time.\n\n\t\t\t\tFREDO\n\t\tOh.  Mikey, what's up?  I'm totally\n\t\tin the dark.\n\n\t\t\t\tMICHAEL\n\t\tWe're making an investment in Havana.\n\n\t\t\t\tFREDO\n\t\tGreat, Havana's great.  Lots of\n\t\tactivity in Havana!  Anybody I know\n\t\there.  Five-Angels?  Anybody?\n\n\t\t\t\tMICHAEL\n\t\tJohnny Ola... Hyman Roth.\n\n\t\t\t\tFREDO\n\t\tI never met them.\n\n\t\t\t\tMICHAEL\n\t\tPentangeli's dead.  He was ambushed\n\t\tby the Rosato Brothers.\n\t\t\t(pause)\n\t\tDidn't you know that?\n\n\t\t\t\tFREDO\n\t\tNo.  No, I didn't.  Who tells me\n\t\tanything?  I been kept in the dark\n\t\tso long, I'm getting used to it.\n\n\t\t\t\tMICHAEL\n\t\tI want you to help me, Fredo.\n\n\t\t\t\tFREDO\n\t\tThat's what I'm here for.\n\n\t\t\t\tMICHAEL\n\t\tTonight I want to relax with you.\n\t\tThe Senator from Nevada is here\n\t\twith some people from Washington.\n\t\tI want to show them a good time in\n\t\tHavana.\n\n\t\t\t\tFREDO\n\t\tCount on me; that's my specialty.\n\n\t\t\t\tMICHAEL\n\t\tI'd like to come along.  There's\n\t\tbeen a lot of strain, and I've been\n\t\tcooped up in this room for three\n\t\tdays.\n\n\t\t\t\tFREDO\n\t\tMe and you, great!  Gimme an hour\n\t\tto wash my face and do my research\n\t\tand we'll have these Washington\n\t\tsuckers right where you want 'em.\n\t\t\t(then a thought\n\t\t\tstrikes him)\n\t\tPoor Frankie Five-Angels.  He\n\t\talways wanted to die in bed...with\n\t\ta broad.\n\nINT. ROTH'S SUITE - MED. VIEW - DAY\n\nMichael stands at Roth's door carrying the briefcase that\nFredo had brought.\n\nA hotel DOCTOR takes Hyman Roth's blood pressure, while his\nwife waits nervously.\n\n\t\t\t\tDOCTOR\n\t\t\t(Spanish)\n\t\tYou must not exert yourself; I will\n\t\twrite out a prescription and come\n\t\tback tomorrow.\n\n\t\t\t\tHOTEL MAN\n\t\tHe's going to write a prescription.\n\n\t\t\t\tROTH\n\t\tI want my own doctor; fly him in\n\t\tfrom Miami.  I don't trust a doctor\n\t\twho can't speak English.\n\nThe doctor is shown out.  Roth gestures to the hotel man,\nwho also leaves.  Then he looks to his wife.\n\n\t\t\t\tROTH\n\t\tHoney, go down to the casino?\n\n\t\t\t\tTERRI\n\t\tIf you feel better...\n\n\t\t\t\tROTH\n\t\tI do.  Play the Bingo game.\n\nThey kiss, and she leaves.  Also Bussetta and Ola remain.\n\n\t\t\t\tROTH\n\t\tMy sixth sense tells me you have a\n\t\tbag full of money in your hand.\n\nOla locks the door; Michael nods, and opens the bag, spilling\nits contents on the card table.\n\n\t\t\t\tMICHAEL\n\t\tThis doubles my investment.\n\n\t\t\t\tROTH\n\t\tStill no word of your courier?\n\t\tWe'll find him.  But at least this\n\t\twill satisfy our friends here.\n\t\tYou've been invited to the New Year\n\t\treception at the Presidential Home.\n\t\tI understand your brother is here\n\t\tas well; I hope he'll come.\n\n\t\t\t\tMICHAEL\n\t\tSix million dollars in cash is a\n\t\thigh price for a piece of a country\n\t\tin the middle of a revolution.\n\nRoth looks patiently at Michael, as though he were a child\nwho hadn't minded the lesson that he had been taught over\nand over again.\n\n\t\t\t\tROTH\n\t\tYou're a careful kid, and that's\n\t\tgood.  But look.  An international\n\t\tdispatch on the wire service.\n\t\tAmerican journalism, not propaganda.\n\t\tThe government troops have all but\n\t\teliminated the rebels.  All but\n\t\ttheir radio station.\n\n\t\t\t\tMICHAEL\n\t\tI've read it; I'm pleased that the\n\t\tgovernment is doing so well.  As a\n\t\theavy investor, I'm pleased.  How\n\t\tdid the doctor find you?\n\n\t\t\t\tROTH\n\t\tTerrible.  I'd give twice this\n\t\tamount to take a piss without it\n\t\thurting.\n\n\t\t\t\tMICHAEL\n\t\tWho had Frankie Pantangeli killed?\n\n\t\t\t\tROTH\n\t\t\t(taken a bit off-balance)\n\t\tWhy...the Rosato Brothers.\n\n\t\t\t\tMICHAEL\n\t\tI know that; but who gave the go\n\t\tahead.\n\nRoth glances to Ola; he is not a fool; he realizes Michael\nhas begun to suspect him.\n\n\t\t\t\tMICHAEL\n\t\tI know it wasn't me...so that\n\t\tleaves you.\n\n\t\t\t\tROTH\n\t\tThere was this kid that I grew up\n\t\twith; he was a couple years younger\n\t\tthan me, and sort of looked up to\n\t\tme, you know.  We did our first\n\t\twork together, worked our way out\n\t\tof the street.  Things were good\n\t\tand we made the most of it.  During\n\t\tprohibition, we ran molasses up to\n\t\tCanada and made a fortune; your\n\t\tfather too.  I guess as much as\n\t\tanyone, I loved him and trusted him.\n\t\tLater on he had an idea to make a\n\t\tcity out of a desert stop-over for\n\t\tG.I.'s on the way to the West Coast.\n\t\tThat kid's name was Moe Greene, and\n\t\tthe city he invented was Las Vegas.\n\t\tThis was a great man; a man with\n\t\tvision and guts; and there isn't\n\t\teven a plaque or a signpost or a\n\t\tstatue of him in that town.  Someone\n\t\tput a bullet through his eye; no\n\t\tone knows who gave the order.  When\n\t\tI heard about it I wasn't angry.  I\n\t\tknew Moe; I knew he was headstrong,\n\t\tand talking loud, and saying stupid\n\t\tthings.  So when he turned up dead,\n\t\tI let it go, and said to myself:\n\t\tthis is the business we've chosen.\n\t\tI never asked, who gave the go\n\t\tahead because it had nothing to do\n\t\twith business.\n\nHe regards Michael silently a moment.\n\n\t\t\t\tROTH\n\t\t\t(continuing)\n\t\tThere's three million dollars on\n\t\tthat table.  I'm going to lie down,\n\t\tmaybe take a nap.  When I wake up,\n\t\tif it's still there, I'll know I\n\t\thave a partner.  If it's gone, then\n\t\tI'll know I don't.\n\nThe old man turns, and moves in his slippers, toward his\nbedroom.\n\nINT. THE CORRIDOR - DAY\n\nMichael closes the door, and moves down the hallway.  He is\nfollowed by Bussetta, who had waited in the corridor.\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tHow sick do you think the old man is?\n\n\t\t\t\tBUSSETTA\n\t\t\t(Sicilian)\n\t\tHe'll live longer than me.\n\nINT. TROPICOR NIGHT CLUB - VIEW ON THE SHOW - NIGHT\n\nA Havana extravaganza, with tall, beautiful showgirls done\nup in flamboyant, 'South-of-the-Border' Carmen Miranda\ncostumes; the lead singer is a six foot blonde doing \"Rum\nand Coca Cola\" in that style.  Her name is YOLANDA.\n\nMED. VIEW\n\nAt a large round table, located in an obvious VIP section of\nthe high, tropically draped room with living ferns and other\ntropical planting with artificial stars.\n\nMichael rises, to be introduced by Fredo to some conservative\nlooking Senatorial types, including Senator Pat Geary of\nNevada.  We notice Bussetta standing nearby.\n\n\t\t\t\tFREDO\n\t\tDoes everyone know everyone, or\n\t\tnobody knows nobody.  Here, my\n\t\tbrother, Michael Corleone... well,\n\t\tyou know Senator Geary.\n\nGeary warmly shakes Michael's hand.\n\n\t\t\t\tSENATOR GEARY\n\t\tGood to see you, Mike; I'm glad we\n\t\tcan spend this time together.\n\n\t\t\t\tFREDO\n\t\tThis is Senator Payton from Florida;\n\t\tJudge DeMalco from New York...\n\t\tSenator Ream... Mr. Questadt from\n\t\tCalifornia, he's a lawyer with the\n\t\tPrice-Control Administration.  And\n\t\tFred Corngold of U T&T.\n\nThey all make themselves comfortable.  A waiter with a tray\nof drinks appears.\n\n\t\t\t\tFREDO\n\t\tGentlemen... your pleasure?  Cuba\n\t\tLibres, Pina Coladas, you name it.\n\n\t\t\t\tSENATOR GEARY\n\t\tI'll take a Yolanda.\n\nLaughter.\n\n\t\t\t\tFREDO\n\t\tLater, later.  All those girls look\n\t\tlike they're on stilts!\n\nThe various tropical drinks are distributed.\n\n\t\t\t\tSENATOR GEARY\n\t\tTo a night in Havana!\n\nThey all join in.\n\n\t\t\t\tFREDO\n\t\t\t(aside to Michael)\n\t\tJeeze, it's great you came along,\n\t\tMike... You know, we've never spent\n\t\ta night out on the town together.\n\t\tI always thought you looked down on\n\t\tme for liking a good time.\n\n\t\t\t\tMICHAEL\n\t\tI never looked down on you, Fredo.\n\t\tYou don't look down at a brother.\n\nINT. THE CASINO - NIGHT\n\nBy now the group has made its way into the casino.  Some of\nthem are crowded around the crap table; Senator Geary is\nwith the enormous and beautiful Yolanda, who barely speaks\nEnglish.  There are other girls with some of the men; not\nwith Michael, who gambles dollars while talking to Corngold.\n\n\t\t\t\tCORNGOLD\n\t\tOur information is that Castro is\n\t\tdead.  There are maybe a few\n\t\thundred die-hards in the Sierra\n\t\tMuestra; but government troops are\n\t\tgoing to clean them out any day.\n\nJohnny Ola approaches Michael.\n\n\t\t\t\tOLA\n\t\tMike, can I talk to you.\n\nMichael follows Ola toward the Baccarat table; a watchful\nBussetta moves, a distance away, with them.\n\n\t\t\t\tOLA\n\t\tListen, this Senator from Florida\n\t\talready has a hundred grand worth\n\t\tof markers on the table.\n\nWe can see Senator Ream at the table, making thousand dollar\nbets on the Bank.\n\n\t\t\t\tOLA\n\t\tThey asked him to sign paper to\n\t\ttake down the markers; but he got\n\t\tmad; told them to wait until he was\n\t\tfinished.\n\n\t\t\t\tMICHAEL\n\t\tLet him gamble.\n\n\t\t\t\tOLA\n\t\tOkay.  You know he doesn't have\n\t\tthat kind of money.\n\n\t\t\t\tFREDO\n\t\tMike said let him gamble.\n\nFredo puts his arm around his brother; he is high with the\nfirst attention Mike has ever given him, as though finally\nhe is being taken seriously; as though his brother needs him.\n\n\t\t\t\tFREDO\n\t\tMike, I got something special up my\n\t\tsleeve for these boys.  You ever\n\t\thear of \"Superman?\" And I don't\n\t\tmean the comic book.\n\n\t\t\t\tMICHAEL\n\t\tNo.\n\n\t\t\t\tFREDO\n\t\tWait'll you see!\n\nINT. HAVANA BAR - NIGHT\n\nOur group are in a large Havana bar; the walls totally\ncovered with hundreds of fifths of different types of rum\nand other liquor.\n\nA couple of the girls from the show are out with the men;\nYolanda herself is giving them a private song and dance.\n\nFredo is a little loaded, and especially attentive to\nMichael this night.\n\n\t\t\t\tFREDO\n\t\tMikey, why would they ever hit poor\n\t\told Frankie Five-Angels?  I loved\n\t\tthat ole sonuvabitch.  I remember\n\t\twhen he was just a 'button,' when\n\t\twe were kids.  We used to put\n\t\tbedsheets on our heads, you know,\n\t\tlike we were ghosts.  An' ole\n\t\tFrankie come peek into our room,\n\t\twe'd jump up, and he'd always\n\t\tpretend like he was really scared.\n\t\tYou remember?\n\n\t\t\t\tMICHAEL\n\t\tIt was hard to have him killed.\n\n\t\t\t\tFREDO\n\t\tYou?  What do you mean you, I\n\t\tthought...\n\n\t\t\t\tMICHAEL\n\t\tIt was hard to have him killed.\n\n\t\t\t\tFREDO\n\t\tYou?  What do you mean you, I\n\t\tthought...\n\n\t\t\t\tMICHAEL\n\t\tIt was Frankie tried to have me hit.\n\n\t\t\t\tFREDO\n\t\tNo.  I mean, are you sure?\n\n\t\t\t\tMICHAEL\n\t\tYou know otherwise, Freddie?\n\n\t\t\t\tFREDO\n\t\tMe?  NO, no, I don't know anything.\n\t\tFellas!  You're all falling asleep.\n\t\tWe got to see Superman.\n\nCLOSE ON MICHAEL\n\nA growing feeling about his brother.\n\nEXT. GARISH HAVANA STREET - NIGHT\n\nThe street is lit with tons of neon signs; it is alive with\npeople; some roving bands of musicians.  Everywhere are\nlittle boys running around, begging for money.  And in\ndoorways and windows are silent, dark-skinned women.\n\n\t\t\t\tSENATOR REAM\n\t\t\t(pushing away from\n\t\t\tthe palm outstretched\n\t\t\tlittle hands of the boys)\n\t\tGoddamn beggers.  Goddamn city of\n\t\tbeggars and pimps and whores.  And\n\t\twe bend over backwards to support\n\t\tthem with the goddamn sugar quota.\n\n\t\t\t\tFREDO\n\t\t\t(to Geary)\n\t\tWhat's eating him?\n\n\t\t\t\tSENATOR GEARY\n\t\tHe lost a quarter million dollars\n\t\tat the casino.\n\n\t\t\t\tSENATOR REAM\n\t\t...goddamn city of whores...\n\n\t\t\t\tSENATOR GEARY\n\t\tHe gave them a bad check.\n\nINT. 'SUPERMAN SHOW' - MED. VIEW - NIGHT\n\nA large room with a succession of platforms arranged step-\nlike around a circular area which becomes a stage.\n\nThere are a hundred or so people, practically all men,\ntourists and business men, standing on the different levels,\nforming the audience.\n\nIn the center of the stage is a thick, telephone type pole,\nto which is tied a young Cuban girl, in a flimsy white\nsacrificial slip.  A small band, mostly drummers, play some\nLatin music.\n\nMED. VIEW\n\nFredo's party standing on the ramp, looking down at the\nspectacle.  They're a little woozy from the drinks and late\nhour.  Michael is with them, but now we sense he is using\nthis time, with all exhausted and drunk, to come to some\nimportant conclusions.\n\n\t\t\t\tQUESTADT\n\t\tWhy do we have to stand?\n\n\t\t\t\tFREDO\n\t\tEveryone stands.  But it's worth\n\t\tit, watch!\n\nVIEW ON THE ARENA\n\nNow two high priestesses, scantily clad, bring in a tall and\nmuscular Cuban, done up in chains and loin cloth, as though\nhe were a captured slave.  This is SUPERMAN\n\nVIEW ACROSS THE MEN TO THE STAGE\n\n\t\t\t\tFREDO\n\t\tThat's him; that's Superman!\n\nSome preliminary pornographic proceedings go on, as the\npriestesses lead the slave to the virgin tied to the post.\nThe music is percussive and wild.\n\nMED. VIEW ON THE MEN\n\n\t\t\t\tSENATOR GEARY\n\t\tOhmygod.  I don't believe it.\n\n\t\t\t\tQUESTADT\n\t\tIt's got to be fake.\n\n\t\t\t\tFREDO\n\t\tThat's why they call him Superman.\n\t\tJohnny Ola told me about this; I\n\t\tdidn't believe it.\n\nCLOSE on Michael turning away.  Not because of the spectacle\nwhich he finds disgusting, but at what his brother is saying.\n\n\t\t\t\tFREDO (O.S.)\n\t\t... but seeing is believing.  Ole\n\t\tJohnny knows all the places.  I\n\t\ttol' you... can you believe it?\n\nIf Michael would ever allow himself to cry, it would be now.\n\n\t\t\t\tFREDO\n\t\t\t(continuing)\n\t\tThe old man Roth, would never come;\n\t\tbut Johnny knows these places like\n\t\tthe back of his hand...\n\n\t\t\t\t\t\t\tFADE OUT.\n\nFADE IN:\n\nINT. MICHAEL'S SUITE - MED. VIEW - MORNING\n\nMichael is alone in his bedroom; it seems as though he\nhasn't slept very much, but sits by his window, looking out\nat the city.  He is troubled and tired.\n\nHis radio is on:\n\n\t\t\t\tRADIO\n\t\t\t(Spanish)\n\t\t\"This is Rebel Radio: Rebel troops\n\t\tof Column Four 'Jose Marti' took\n\t\tthe town of Baire yesterday at 8:30\n\t\tp.m.  The enemy has retreated...\"\n\nEXT. CUBAN STREET - MORNING\n\nThis street in Havana is like a Caribbean tourist city with\nno indication of the revolution in progress.\n\nMichael walks along the street, alone, past the Cubans on\ntheir way to work; past the American ladies who have gotten\nup early for their shopping spree.\n\n\t\t\t\tRADIO\n\t\t\t(Spanish)\n\t\t\t (continuing)\n\t\t... An important military action is\n\t\tdeveloping along a 35-kilometer\n\t\tstretch of the Central Highway.\n\t\tNumerous enemy garrisons are left\n\t\twith two alternatives, surrender or\n\t\tannihilation...\n\nOne full block away, Bussetta rides in the front seat of the\ndark Mercury, driving slowly, giving Michael his privacy,\nbut never letting him out of Bussetta's sight.\n\nCLOSE ON MICHAEL\n\nwatching.\n\nMICHAEL'S VIEW\n\nShopkeepers happily luring the tourists into their shops in\nbroken English.  Havana is prosperous.\n\n\t\t\t\tRADIO\n\t\t\t(continuing)\n\t\t... Victories in war depend on a\n\t\tminimum on weapons and to a maximum\n\t\ton morale...\n\nVIEW ON MICHAEL\n\nglances back to the dark car following him.  In a moment, it\npulls up to him, and he gets into the back seat.\n\nEXT. AMERICAN MILITARY MISSION - VIEW ON MICHAEL - DAY\n\nstanding by his car, looking through the cyclone fencing\nthat borders this military training camp operated by the\nAmerican Army near the city.\n\n\t\t\t\tRADIO\n\t\t... War is not a simple question of\n\t\trifles, bullets, guns and planes...\n\nCLOSER VIEW INTO THE CAMP\n\nEXT. HAVANA STREET - DAY\n\nA street singer, followed by a guitarist sings Jose Marti's\nwords of \"Guantanamera.\" It is solemn, as though it is a\nsong of protest, a song of the revolution.\n\nNearby, in a restaurant, Michael has lunch with Fredo.\n\n\t\t\t\tMICHAEL\n\t\tHow is your wife, Fredo...your\n\t\tmarriage?\n\n\t\t\t\tFREDO\n\t\t\t(eating)\n\t\tYou know her; drives me crazy, one\n\t\tminute she's a popsicle, the next\n\t\tshe's all vinegar.  Sometimes I\n\t\tthink... I think - I should a\n\t\tmarried someone, like you did.  To\n\t\thave kids, to have a family.\n\nMichael turns, distracted for a moment at something the\nsinger has sung.\n\n\t\t\t\tMICHAEL\n\t\t\"Yo soy un hombre sincero...\"\n\t\tI am a sincere man,\n\t\tFrom the land of the palms...\n\n\t\t\t\tFREDO\n\t\tWhat's that?\n\n\t\t\t\tMICHAEL\n\t\tThe song.  Are you sincere with me,\n\t\tFredo?\n\n\t\t\t\tFREDO\n\t\tSincere.  What are you talking\n\t\tabout, of course I'm sincere with\n\t\tyou, Mike.\n\n\t\t\t\tMICHAEL\n\t\tThen I'm going to confide in you;\n\t\ttrust you with something.\n\n\t\t\t\tFREDO\n\t\t\t(Sicilian)\n\t\tMike, are you crazy, I'm your\n\t\tbrother.\n\n\t\t\t\tMICHAEL\n\t\tTonight we've been invited to a\n\t\treception at the Presidential\n\t\tPalace; to bring in the New Year.\n\t\tYou and I will go in a special car\n\t\tthat's being sent.  They'll have\n\t\tcocktails... then dinner, and a\n\t\treception with the President.  When\n\t\tit's over, it will be suggested\n\t\tthat you take Questadt and his\n\t\tfriends from Washington to spend\n\t\tthe night with some women.  I'll go\n\t\thome alone in the car; and before I\n\t\treach the hotel, I'll be\n\t\tassassinated.\n\n\t\t\t\tFREDO\n\t\t...Who?\n\n\t\t\t\tMICHAEL\n\t\tThe same man who tried in Nevada...\n\t\tHyman Roth, not Pentangeli.\n\n\t\t\t\tFREDO\n\t\tBut, you told me yourself...\n\n\t\t\t\tMICHAEL\n\t\tIt was never Pentangeli... I've\n\t\talways known that.  It was Roth all\n\t\talong.  He talks to me as a son; as\n\t\this successor, but the old man\n\t\tthinks he'll live forever.\n\n\t\t\t\tFREDO\n\t\tWhat do you want me to do?\n\n\t\t\t\tMICHAEL\n\t\tTo go tonight, with me, as though\n\t\twe know nothing.  I've already made\n\t\tmy move.\n\n\t\t\t\tFREDO\n\t\tWhat is it?  Can I help?\n\n\t\t\t\tMICHAEL\n\t\tThe old man will never bring in the\n\t\tNew Year.\n\nFredo realizes what he means; looks immediately to Bussetta,\nwho had been sitting near the door and the musicians.  He is\ngone.\n\nINT. HOTEL CORRIDOR - MOVING VIEW ON BUSSETTA - NIGHT\n\nThe first time ever away from Michael, moving toward us\nquickly.  He stops, knocks on the door of Roth's suite.\nThen quickly for a man his size, he moves without noise to\nthe adjoining door, opens it with a key, and disappears\ninside.\n\nA moment elapses on the empty corridor, and then a roused\nJohnny Ola, opens the first door.  He steps out into the\ncorridor, to see who had knocked.  Confused, he is about to\nreturn inside, when Bussetta easily breaks his neck in two\nfrom behind.\n\nINT. THE SUITE - MED. VIEW - NIGHT\n\nas Bussetta quietly pulls the limp body of Johnny Ola, his\nhead bent at an impossible angle, and lays it at the foot of\nthe couch.\n\nEXT. PRESIDENTIAL PALACE - NIGHT\n\nGuards who are regular troops patrol the Palace in twos,\ncarrying machine weapons.\n\nNow an elite officer, checks the identification of the\nvarious cars carrying dignitaries, as they are driven up to\nthe Palace.  The one being inspected at the moment contains\nFredo and Michael.  We can see the beautifully dressed\npeople on their way to the reception, and sense the cheerful\nmood of this New Year's Eve.\n\nINT. THE SUITE - NIGHT\n\nBussetta bends over Ola's body, tying the wrists and knees\nwith electrical extensions.  He then easily carries the body\nto the small balcony which all the rooms have.\n\nEXT. THE BALCONY - NIGHT\n\nBussetta swings the body over the side of the balcony\nrailing; tying the extension cord to the railing, and\nsuspending the body so that it is invisible both from the\ninside and out during the night.\n\nINT. PRESIDENTIAL PALACE - VIEW ON THE MAIN FOYER - NIGHT\n\nThe PRESIDENT, his WIFE and six oldest CHILDREN great\nformally the many beautifully and affluently dressed guests.\nHe speaks to them in Spanish, as one by one they file to him.\n\nMichael and Fredo are presented in a group with several\nother Americans, including several of the American\nbusinessmen with interests in Cuba.\n\nEXT. STREETS OF HAVANA - MED. VIEW - NIGHT\n\nThe excitement of the night is beginning to build; people\nare out in the streets; poor people, but they are\nenthusiastic and lively.\n\nNEW VIEW\n\nTraffic stops, as an ambulance speeds its way to a hospital;\nSIREN going.\n\nINT. THE SUITE - NIGHT\n\nBussetta delicately picks up a small satin cushion that had\nfallen from the couch, and replaces it as though nothing had\nhappened.  Slowly he cracks the door open which adjoins\nRoth's bedroom.  There is a slight commotion; whispered\nvoices.\n\nBUSSETTA'S VIEW\n\nTerri, Mrs. Roth, is crying.  A group of men lift Hyman\nRoth's frail body onto a stretcher.\n\nCLOSE ON BUSSETTA\n\nrealizes that this is the man he is to kill.\n\nCLOSER VIEW ON ROTH\n\nHe is alive; breathing hard with his mouth dry and open.\nThe doctor examines him, and then gives instructions to the\norderly who carries him out, presumably to the ambulance.\n\nBussetta closes the door on this VIEW.\n\nINT. PRESIDENTIAL PALACE - NIGHT\n\nAn orchestra plays for the guests, as an army of waiters\nserve champagne and hors d'oeuvres.  Michael relaxes with\nSenator Geary, Major Leon, and several of the Americans.\n\n\t\t\t\tQUESTADT\n\t\tThe embargo on arms shipments from\n\t\tthe U.S. to your government, was\n\t\tjust a necessary public relations\n\t\tmove... Only last month, your air\n\t\tforce received a major shipment of\n\t\trockets...\n\nMichael glances at his watch; Fredo concentrates on this.\n\n\t\t\t\tSENATOR GEARY\n\t\tWe believe in non-intervention...\n\t\tbut the agreement stipulates that\n\t\tour forces may be withdrawn... but\n\t\tas you've seen, we have not\n\t\twithdrawn them.\n\n\t\t\t\tCORNGOLD\n\t\tAnd my guess is that President\n\t\tEisenhower won't pull out while we\n\t\thave over three billion invested\n\t\tover here.\n\n\t\t\t\tMICHAEL\n\t\tFredo.  Where are you going?\n\n\t\t\t\tFREDO\n\t\tNowhere, Mike.  I wanted to get a\n\t\trefill.  How about you?\n\nEXT. HAVANA HOSPITAL - MED. VIEW - NIGHT\n\nThe ambulance makes its way up to the emergency section of\nthe hospital.  The orderlies quickly carry the old man\ninside.  His wife and the doctor, and several of his men,\nfollow in another car.\n\nTHE VIEW ALTERS\n\nand we see Bussetta waiting in the shadows.\n\nEXT. HAVANA STREETS - NIGHT\n\nThe growing crowds of Cubans begin their celebration.\n\nNEW VIEW\n\nA Cuban military detachment speeds along in the night,\nmotorcyclists clear a path through the celebrants.\n\nINT. PRESIDENTIAL PALACE - FULL VIEW - NIGHT\n\nA full sitdown dinner is being served the guests.  Michael\nsits at a table at dinner with several of the distinguished\nCubans, and some of the American businessmen.\n\n\t\t\t\tQUESTADT\n\t\tWhat's kept Mr. Roth?\n\nFredo looks up at Michael.\n\nIn the back of the room, we notice the detachment of military\nmoving quickly through the reception room on their way to\nthe President's private quarters.  Michael notices it as well.\n\nINT. THE HOSPITAL CORRIDOR - FULL VIEW - NIGHT\n\nThe activity at the end of the hall has come to rest; we can\ntell that the doctor tells Mrs. Roth that she should go, the\nold man will be taken to a room where he can rest.\nGradually, these people leave him in the care of the hospital\nstaff.\n\nBussetta watches from the distance of the hallway; after the\nold man has been moved, he quietly walks down the hallway to\nthe room.\n\nHIS VIEW\n\nA nurse sits in the room in attendance; Hyman Roth is\nasleep, his mouth wide open, breathing noisily.\n\nVIEW ON BUSSETTA\n\nhears footsteps, quickly steps away from the door, and into\nanother room.\n\nSome nurses and attendants speak to the nurse in the room in\nSpanish; one has brought a small bottle of wine, and\nobviously they are inviting the nurse to have a New Year's\ntoast with them.  They laugh; and the nurse steps away from\nthe room for a moment.\n\nBussetta moves slowly back into the room, alone with the\nhelpless Roth.\n\nINT. PRESIDENTIAL PALACE - FULL VIEW ON THE GUESTS - NIGHT\n\nseeing in the New Year; a great banner is hoisted up in\nSpanish, welcoming 1959.\n\nHands are shaken; kisses exchanged.\n\nMED. CLOSE VIEW\n\nMichael and Fredo in an embrace; they kiss one another.\n\n\t\t\t\tMICHAEL\n\t\tI've arranged for a plane; we're\n\t\tgoing to Miami in an hour.  Try not\n\t\tto make a big thing of it.\n\nHe kisses his brother once again.\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tI know it was you, Fredo.  You've\n\t\tbroken my heart.\n\nSlowly, understanding, Fredo backs away from his brother,\ntaking the kiss another way.\n\nA little distance away, Major Leon notices an old woman, one\nof the President's maids, moving across the alcove, carrying\nher suitcases.\n\n\t\t\t\tLEON\n\t\tWhat a pity; she's crying.  Must\n\t\thave been fired, and she's been\n\t\twith the President's family for\n\t\ttwenty years.\n\nEXT. HAVANA STREETS - NIGHT\n\nThe gathered crowd joyously welcomes the New Year.  We\nnotice the continual military movement.\n\nMED. VIEW\n\nA family surreptitiously leaves their home, carrying\nsuitcases and belongings.\n\nINT. ROTH'S HOSPITAL ROOM - NIGHT\n\nBussetta raises a hospital pillow, and easily begins to\nsmother the thin old man, who can barely struggle.\n\nOUT IN THE HALL\n\nA detachment of military move quickly, accompanied by some\nof Roth's men, as though they have important news that must\nbe dealt with.\n\nThey pass the small group of aides and nurses welcoming the\nNew Year.\n\nSeeing them, the nurse assigned to him, puts down her glass\nand moves quickly to the room.\n\nShe opens the door, and lays bare the sight of Bussetta\nsmothering Roth.  Bussetta turns quickly; and one of the\nmilitary takes out his pistol and shoots several times at\nhis head.\n\nINT. PRESIDENTIAL PALACE - NIGHT\n\nThe entire reception has been disrupted for an announcement;\nall the guests in their formal dress and evening gowns,\nstanding with frightened faces like first class passengers\non a doomed ship.  The President himself, his back to our\nVIEW, is making an announcement in Spanish.  While he\nspeaks, we notice continuous movement of his personal staff,\ncarrying suitcases and possessions.\n\n\t\t\t\tPRESIDENT\n\t\t...Because of serious setbacks of\n\t\tour troops in Guantanamo and\n\t\tSantiago, we feel reluctantly, that\n\t\twe must leave the Capital at once.\n\t\tMyself and my family must bid you\n\t\tgoodbye, and good fortune.  We will\n\t\tgo directly to Ciudad Trujillo.\n\nThe crowd is stunned; already whispers are moving throughout\nthe guests.\n\nThe only one who is not completely taken off guard is\nMichael, who quietly steps back, and disappears from the room.\n\n\t\t\t\tPRESIDENT\n\t\t...My only regret is that there\n\t\tcould not have been more warning...\n\t\tAs my last official act as\n\t\tPresident, I hereby appoint a\n\t\tprovisional government with Dr.\n\t\tCarlos M. Piedra, as its President.\n\nBy now, there is only one thought among the guests: how can\nthey get out, and with what.\n\nEXT. PRESIDENTIAL PALACE - NIGHT\n\nWe see evidence of the confusion at this late hour; already\ncars are beginning to move; people leaving the Palace in\nhaste.  Michael moves quickly toward his car.  He sees\nFredo, watching him in fear.\n\n\t\t\t\tMICHAEL\n\t\tCome with me.  It's your only way\n\t\tof getting out!\n\nVIEW ON FREDO\n\nTerrified of his brother, and what he knows; Fredo backs\naway into the growing noise and confusion of the crowd.\n\nVIEW ON MICHAEL\n\nFinally, he has to step into the car and it roars off.\n\nEXT. HAVANA STREETS - NIGHT\n\nRebel cars with loudspeakers have already picked up the news\nthat Batista has conceded...this throws the crowds already\ngathered for the New Year into cheers of joy.\n\nThey harass a wealthy family who are trying to get away in\ntheir car.\n\nThe people pull them out of the car, opening their suitcases,\nout of which spill piles of cash and jewelry into street.\n\nMichael's car makes its way as the crowd cheers: \"El animale\nse fue!\"\n\nEXT. THE UNITED STATES EMBASSY - MED. VIEW - NIGHT\n\nCrowds of panicked and frightened tourists, and Batistianos\nare trying to get to the safety of the Embassy with the\nfamilies and possessions.\n\nWe see Geary, and some of the Americans we had met, working\ntheir way through the crowds, shouting that they are\nAmericans in order to get preference on the line.  Often\nthat declaration brings 'boos' from the crowds.\n\nSometimes the joyous Cubans will let a family through, but\nagain, taking away the suitcases, rich leather, filled with\nmoney and valuables.  Money seems to be stuffed everywhere.\n\nEXT. THE YACHT CLUB - NIGHT\n\nAll forms of private transportation are jammed with people\ntrying to get out, holding cash in their hands for anyone\nwith a yacht or small boat to get them to Florida.\n\nA car pulls up; and we see Sam Roth, Terri Roth and some of\ntheir men, carry the sickly, but still alive Hyman Roth to a\nprivate cruiser which is protected by men with machine guns.\n\nWithin seconds, they are on their way to Miami.\n\nEXT. THE PRIVATE AIRPORT - NIGHT\n\nThings are no different at the airport; where anything that\ncan fly is being jammed with refugees and their money.\n\nA wealthy family is arguing with the pilot of a fast\nairplane; trying to force cash on him, and his family into\nthe plane.  The PILOT steadfastly refuses, although checking\nhis watch, as though his passengers are late.  He speaks\nonly English.\n\n\t\t\t\tPILOT\n\t\tNo, this is a private plane.  No,\n\t\tthis plane is taken.\n\nFinally Michael's Mercury pulls up, and Michael approaches\nthe Pilot.\n\n\t\t\t\tMICHAEL\n\t\tHe isn't here.\n\n\t\t\t\tPILOT\n\t\tWe've got to leave, they'll take\n\t\tthis thing apart.\n\n\t\t\t\tMICHAEL\n\t\tAll right.  Go now.\n\nThe Pilot lets Michael in, as the Cuban screams curses at\nthem, and begins searching for another plane for his family.\n\nINT. THE PLANE - VIEW ON THE PILOT - NIGHT\n\nas the propeller turns over.\n\nEXT. THE AIRPORT - FULL VIEW - NIGHT\n\nGroups of the cheering, celebrating Cubans sing\n\"Guantanamera,\" now as a song of triumph.\n\nINT. THE PLANE - MOVING VIEW - MICHAEL - NIGHT\n\nCloser to him, his personal and business life caught in the\nmiddle of history.\n\nEXT. NEW YORK STREET - MED. VIEW - DAY (1920)\n\nHe stops to pick out some choice oranges and peaches from a\nfruit stand.  Then he reaches into his pocket for change.\n\n\t\t\t\tVENDOR\n\t\tNo, no.  It is my pleasure to make\n\t\tthis a gift.\n\nCLOSE VIEW ON VITO\n\n\t\t\t\tVITO\n\t\tYou are kind.  If ever I can do\n\t\tsomething for you, in return,\n\t\tplease come to me.\n\nINT. VITO'S TENEMENT - DAY\n\nDespite his new position of 'respect,' there is little\nchanged about his home.  Only that they have lived there a\nwhile now, and the rooms are fuller with the inevitable\npossessions a young family acquires.\n\nHe kisses his wife, who seems a big apprehensive.  He shows\nher the fruit; and from her reaction knows she has something\non her mind.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWhat is it?\n\n\t\t\t\tCARMELLA\n\t\t\t(Sicilian)\n\t\tCome...\n\nThey step into the tiny parlor, where we see an older woman,\nwaiting nervously.\n\n\t\t\t\tCARMELLA\n\t\tThe Signora is a friend of mine.\n\t\tShe has a favor to ask of you.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tWhy do you come to me?\n\n\t\t\t\tSIGNORA COLOMBO\n\t\t\t(Sicilian)\n\t\tShe told me to ask you.\n\nHe seems surprised; looks to his wife.\n\n\t\t\t\tCARMELLA\n\t\tShe is having some trouble.  Her\n\t\tlandlord has received complaints\n\t\tbecause of her dog.  He told her to\n\t\tget rid of it, but her boy loved\n\t\tit, so they tried to hide it.  When\n\t\tthe landlord found out, he was so\n\t\tangry, he ordered her to leave.\n\t\tEven if she truly will let the dog\n\t\tgo.\n\n\t\t\t\tSIGNORA COLOMBO\n\t\t\t(Sicilian)\n\t\tHe said he would have the police\n\t\tput us out.\n\n\t\t\t\tVITO\n\t\t\t(thoughtfully)\n\t\tI can give you some money to help\n\t\tyou move, is that what you want?\n\n\t\t\t\tSIGNORA COLOMBO\n\t\tMy friends are all here; how can I\n\t\tmove to another neighborhood with\n\t\tstrangers?  I want you to speak to\n\t\tthe landlord to let me stay.\n\nVito nods to the frightened old woman.\n\n\t\t\t\tVITO\n\t\tIt's done then.  You won't have to\n\t\tmove; I'll speak to him tomorrow\n\t\tmorning.\n\nCarmella breaks into a smile; which her husband des not\nacknowledge.\n\nThe old woman starts to leave the room; but she is not\nconvinced.\n\n\t\t\t\tSIGNORA COLOMBO\n\t\tYou're sure he'll say yes, the\n\t\tlandlord?\n\n\t\t\t\tVITO\n\t\tI'm sure he's a good-hearted fellow.\n\t\tOnce I explain how things are with\n\t\tyou, I'm sure he'll take pity on\n\t\tyour misfortunes.  Don't let it\n\t\ttrouble you any more.\n\t\t\t(as he shows her out)\n\t\tGuard your health, for the sake of\n\t\tyour children.\n\nEXT. TENEMENT BLOCK - DAY\n\nSIGNOR ROBERTO, a pompous, rather well-dressed Patrone\nangrily walks down the steps of one of his tenement buildings.\n\nHe carries a check list, and makes marks with a pencil\nconcerning the condition of his various buildings; a broken\nwindow here, some missing tile there.  He bends over to pick\nup some garbage left by a thoughtless tenant, muttering to\nhimself, when he sees the shoes and legs of a young worker.\n\n\t\t\t\tVITO (O.S.)\n\t\tSignore Roberto...\n\nHe rises to be face to face with a polite Vito Corleone.\n\n\t\t\t\tVITO\n\t\tThe friend of my wife, a poor widow\n\t\twith no man to protect her, tells\n\t\tme that for some reason she has\n\t\tbeen ordered to move from your\n\t\tbuilding.  She is in despair.  She\n\t\thas no money, she has no friends\n\t\texcept those that live here.\n\nSignor Roberto brusquely answers, and continues on his way.\n\n\t\t\t\tROBERTO\n\t\tI have already rented the apartment\n\t\tto another family.\n\nMOVING SHOT ON THE TWO\n\n\t\t\t\tVITO\n\t\tI told her I would speak to you,\n\t\tthat you are a reasonable man who\n\t\tacted out of some misunderstanding.\n\t\tShe has gotten rid of the animal\n\t\tthat caused all the trouble, so why\n\t\tshouldn't she stay.  As one Italian\n\t\tto another, I ask you the favor.\n\n\t\t\t\tROBERTO\n\t\tI've already rented it; I cannot\n\t\tdisappoint the new tenants.  They're\n\t\tpaying a higher rent.\n\n\t\t\t\tVITO\n\t\tHow much more a month?\n\n\t\t\t\tROBERTO\n\t\tEh...\n\t\t\t(we sense he is lying)\n\t\tFive dollars more.\n\nVito reaches into his pocket, and takes out a roll of bills.\n\n\t\t\t\tVITO\n\t\tHere is the six month's increase in\n\t\tadvance.  You needn't speak to her\n\t\tabout it, she's a proud woman.  See\n\t\tme again in another six months.\n\t\tBut of course, you'll let her keep\n\t\ther dog.\n\n\t\t\t\tROBERTO\n\t\tLike hell!  And who the hell are\n\t\tyou to give me orders.  Watch your\n\t\tmanners or you'll be on your\n\t\tSicilian ass in the street there.\n\nVito raises his hands in surprise; his voice is reasonable.\n\n\t\t\t\tVITO\n\t\tI'm asking you a favor, only that.\n\t\tOne never knows when one might need\n\t\ta friend, isn't that true?  Here,\n\t\ttake this money as a sign of my\n\t\tgood-will, and make your own\n\t\tdecision.  I won't quarrel with it.\n\t\t\t(he puts the money in\n\t\t\tRoberto's hand)\n\t\tDo me this little favor, just take\n\t\tit and think carefully.  Tomorrow\n\t\tmorning if you want to give me the\n\t\tmoney back, by all means do so.  If\n\t\tyou want the woman out of your\n\t\thouse, how can I stop you?  It's\n\t\tyour property, after all.  If you\n\t\tdon't want the dog in there, I can\n\t\tunderstand.  I dislike dogs myself.\n\t\t\t(he pats Roberto on\n\t\t\tthe shoulder)\n\t\tDo me this service, eh?  I won't\n\t\tforget it.  Ask your friends in\n\t\tthis neighborhood about me, they'll\n\t\ttell you I'm a man who believes in\n\t\tshowing his gratitude.\n\nWithout a word more, Vito leaves a hypnotized Roberto\nstanding in front of the tenement, his hand clasping the\nmoney.\n\nEXT. NEIGHBORHOOD STREET - DAY\n\nA thin young man, almost gawky, walks down the street in\nthis Italian neighborhood, his name is HYMAN SUCHOWSKY.\n\nHe carries his tools as he comes home from work.  He is\npursued and tormented by a couple of Italian youths, about\nhis own age, eighteen.\n\n\t\t\t\tITALIAN BOY\n\t\tKid, where do you live?\n\n\t\t\t\tANOTHER\n\t\tWhere'd you get those nigger lips?\n\nHe tries not to be intimidated; finally one of the boys,\nsteps in front of him and stops him.\n\n\t\t\t\tITALIAN BOY\n\t\tSay 'bread' in Italian.\n\n\t\t\t\tANOTHER\n\t\tHe dunno.\n\n\t\t\t\tITALIAN BOY\n\t\tGo on; how do you say 'bread' in\n\t\tItalian?  If you're from the\n\t\tneighborhood, you should know how\n\t\tto say 'bread' in Italian.\n\nAn amused Peter Clemenza steps forward from a local coffee\nhouse, to preside over the fuss.  He's a 'big' man in the\nneighborhood, and loves a fight.\n\n\t\t\t\tCLEMENZA\n\t\tWhat's up?\n\n\t\t\t\tITALIAN BOY\n\t\tThis kid lives around here, but he\n\t\tcan't say bread in Italian.\n\n\t\t\t\tCLEMENZA\n\t\tThat's 'cause he's Jew.  Look at\n\t\tthose pregnant lips!\n\nHe giggles at his own joke.\n\n\t\t\t\tITALIAN BOY\n\t\tAre you a Jewboy?\n\nThe boy doesn't answer, tries to keep going.\n\n\t\t\t\tITALIAN BOY\n\t\tWell, if you're not a Jew, say\n\t\t'bread' in Italian.  See, he can't.\n\nAnd with that, he rounds a blow squarely to the boy's face,\nsending him sprawling to the cement, his tools flying with a\nclatter.\n\nThe other Italian immediately joins in with a few kicks to\nthe boy's stomach.  Hyman tries to fight back; grabs a hold\nof his tormentor's foot, and brings him down on the cement\nas well.  For a moment, they are rolling around on the\nsidewalk, two against one, Hyman taking the worst of it.\n\n\t\t\t\tCLEMENZA\n\t\tAlright, alright, cut it out.\n\n\t\t\t\tSECOND ITALIAN\n\t\tWhat for?  He killed Jesus Christ!\n\nClemenza pulls him off, and kicks him in the ass.\n\n\t\t\t\tCLEMENZA\n\t\tI said cut it out!\n\t\t\t(to the beaten kid)\n\t\tWhat's your name?\n\n\t\t\t\tHYMAN\n\t\tHyman Suchowsky.\n\n\t\t\t\tITALIAN BOY\n\t\tI don't believe it.  In our\n\t\tneighborhood, with a name like that!\n\n\t\t\t\tCLEMENZA\n\t\tWhat are those tools?  You work on\n\t\tcars?\n\n\t\t\t\tHYMAN\n\t\tYeah.\n\n\t\t\t\tCLEMENZA\n\t\tMaybe I know how you can make a\n\t\tcouple of extra bucks working as a\n\t\tmechanic.\n\nThe boy seems agreeable.\n\n\t\t\t\tCLEMENZA\n\t\tBut you gotta know how to keep your\n\t\tmouth shut, and fer Chrissakes, get\n\t\trid of that name.  I'll call you\n\t\tJohnny Lips.\n\t\t\t(he giggles at his\n\t\t\town humor again)\n\t\tCome on...\n\nHe leads the boy down the street, whispering to him, on the\nside:\n\n\t\t\t\tCLEMENZA\n\t\tBread in Italian is pane.  P-A-N-E,\n\t\tpane.  Don't forget.\n\nINT. NEW GENCO WAREHOUSE - DAY\n\nA newly acquired warehouse, stocked with cases of the new\nproduct \"GENCO PURA\" olive oil.  It is the beginning of a\nnew business, in the American tradition.  Now they have one\nrattling old truck, and a few stock boys.\n\nGenco has become the accountant-business manager, based on\nthe experience working with his father.  But it is clear,\nthat Vito is the leader, and undisputed 'President' of the\nnew enterprise.\n\nGenco moves through the darkness of the warehouse, to the\nsmall divided area that Vito uses as his office.\n\n\t\t\t\tGENCO\n\t\t\t(Sicilian)\n\t\tThe 'patrone' is here.\n\n\t\t\t\tVITO\n\t\tChi?\n\n\t\t\t\tGENCO\n\t\tRoberto.  Who owns the 'rat-holes.'\n\nVito nods that he will see him; and soon Roberto enters, on\ntiptoe, his hat in his hand, and in a apologetic voice.\n\n\t\t\t\tROBERTO\n\t\tExcuse me, I hope I am not a\n\t\tdisturbance, Don Corleone.\n\n\t\t\t\tVITO\n\t\tYes.\n\n\t\t\t\tROBERTO\n\t\tWhat a terrible misunderstanding.\n\t\tOf course, Signora Colombo can stay\n\t\tin the flat.  Who were those\n\t\tmiserable tenants to complain about\n\t\tnoise from a poor animal...when\n\t\tthey pay such low rent.\n\nThen abruptly, he puts the roll of money on Vito's table,\nand steps back a respectful distance.\n\n\t\t\t\tROBERTO\n\t\tYour good heart in helping the poor\n\t\twidow has shamed me, and I want to\n\t\tshow that I, too, have some\n\t\tChristian charity.  Her rent will\n\t\tremain what it was.\n\n\t\t\t\tVITO\n\t\tWhat was that?\n\n\t\t\t\tROBERTO\n\t\tIn fact, reduced, bu five dollars!\n\nVito embraces him warmly.\n\n\t\t\t\tVITO\n\t\tI accept your generosity...\n\n\t\t\t\tROBERTO\n\t\tI won't keep you another minute...\n\nHe quickly takes his leave, bowing several times, and then\nmakes it back to the safety of the warehouse; he sighs,\ndeflates his lungs, and mops his brow; his bones have turned\ntoo jelly with fear at his narrow escape.  He all but runs\nout of the warehouse.\n\nGenco laughs as he watches.\n\n\t\t\t\tGENCO\n\t\tWe won't see him for weeks!  He'll\n\t\tstay in bed in the Bronx!\n\nClemenza has been waiting with his new mechanic.  We notice\nthe subtle difference in the way he treats Vito.  He is no\nlonger a junior apprentice in their petty crimes; but an\nimposing leader.\n\n\t\t\t\tCLEMENZA\n\t\tThis kid is good with cars; he\n\t\tkiijed at the truck, and says he\n\t\tcan keep it going.\n\nVito looks over the lanky young man.\n\n\t\t\t\tCLEMENZA\n\t\tWhat's your name?\n\n\t\t\t\tHYMAN\n\t\tSuchowsky.  Hyman Suchowsky.\n\n\t\t\t\tCLEMENZA\n\t\tHe's gonna dump that; I call him\n\t\tJohnny Lips.\n\n\t\t\t\tVITO\n\t\tWho is the greatest man you can\n\t\tthink of?\n\n\t\t\t\tCLEMENZA\n\t\tGo on, answer him when he talks to\n\t\tyou.  Tell him: Columbus, Marconi...\n\t\tGaribaldi.\n\n\t\t\t\tHYMAN\n\t\tArnold Rothstein.\n\n\t\t\t\tVITO\n\t\tThen take that as your name: Hyman\n\t\tRothstein.\n\nGenco is out in the alley; he calls out with glee.\n\n\t\t\t\tGENCO\n\t\tVitone!  Look at this!\n\nVito moves out to the smiling Genco; Clemenza and the newly\nchristened Hyman Rothstein follow a distance behind.\n\nEXT. THE ALLEY - DAY\n\nGenco stands beaming, as two workers raise up high, the\nfreshly painted sign: \"GENCO OLIVE OIL COMPANY.\"\n\n\t\t\t\tGENCO\n\t\t\t(enthusiastically)\n\t\tGod bless America!  We're in\n\t\tbusiness!\n\nThe young men watch as the sign is hoisted into place.  OUR\nVIEW goes from one to the other: Clemenza, Genco, Vito and\nHyman Rothstein.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. SENATE CAUCUS ROOM - MED. CLOSE VIEW - DAY\n\nWilly Cicci, Pentangeli's associate and bodyguard takes a\ndrink of water.\n\n\t\t\t\tSENATOR (O.S.)\n\t\tMr. Cicci.  From the year 1927 to\n\t\tthe present time, you were an\n\t\temployee of the \"Genco Olive Oil\n\t\tCompany.\"\n\n\t\t\t\tCICCI\n\t\tThat's right.\n\n\t\t\t\tSENATOR (O.S.)\n\t\tBut in actuality, you were a member\n\t\tof the Corleone Crime organization.\n\n\t\t\t\tCICCI\n\t\tThe Corleone Family, Senator.  We\n\t\tcalled it, \"The Family.\"\n\n\t\t\t\tSENATOR (O.S.)\n\t\tWhat position did you occupy?\n\n\t\t\t\tCICCI\n\t\tAt first, like everybody, I was a\n\t\tsoldier.\n\nVIEW ON SENATOR KANE\n\nA thin, angular Baptist with a Mid-Western accent.\n\n\t\t\t\tSENATOR KANE\n\t\tWhat is that exactly?\n\n\t\t\t\tCICCI\n\t\tA button.  You know, Senator.\n\n\t\t\t\tSENATOR KANE\n\t\tNo, I don't know, explain that\n\t\texactly.\n\n\t\t\t\tCICCI\n\t\tWhen the boss says push the button\n\t\ton a guy, I push the button, see,\n\t\tSenator?\n\nThe Senators treat Cicci with a surface courtesy, as if he\nwere a curious kind of animal, not really human.  Cicci\nreacts to this by being even more brutally forthright than\nhe has to be, to show his contempt for what he considers a\nhypocrisy.\n\nThe VIEW ALTERS from Senator Kane to the Committee's\nattorney, Mr. Questadt.\n\n\t\t\t\tQUESTADT\n\t\tYou mean you killed people at the\n\t\tbehest of your superiors?\n\n\t\t\t\tCICCI\n\t\tThat's right, counsellor.\n\n\t\t\t\tQUESTADT\n\t\tAnd the head of your family was\n\t\tMichael Corleone.\n\n\t\t\t\tCICCI\n\t\tYeah, counsellor, Michael Corleone.\n\n\t\t\t\tSENATOR KANE\n\t\tDid you ever get such an order\n\t\tdirectly from Michael Corleone?\n\n\t\t\t\tCICCI\n\t\tNo, Senator, I never talked to him.\n\n\t\t\t\tSENATOR SAVOY\n\t\t\t(very autocratic,\n\t\t\tdeep South,\n\t\t\tgentlemanly man)\n\t\tThere was always a buffer, someone\n\t\tin between you who gave you orders.\n\n\t\t\t\tCICCI\n\t\tYeah, a buffer, the Family had a\n\t\tlot of buffers.\n\nEXT. THE TROPICANA IN VEGAS - MED. VIEW - DAY\n\nA limousine pulls up at a private area near the side of the\nhotel.  Michael exits the limousine followed by Hagen and\nNeri.\n\n\t\t\t\tMICHAEL\n\t\tDo you think they have somebody to\n\t\tback up Cicci?\n\n\t\t\t\tHAGEN\n\t\tNo.  But if they do have somebody,\n\t\tyou'll do three years for perjury\n\t\tif you give them so much as a wrong\n\t\tmiddle name.\n\nMichael smiles to him, but it's a cold, deadly smile.\n\n\t\t\t\tHAGEN\n\t\tMichael, take the Fifth all the\n\t\tway, that way you can't get into\n\t\ttrouble.\n\nEXT. PRIVATE BALCONY OF CORLEONE APARTMENT AT TROPICANA - DAY\n\nA Corleone bodyguard waits outside on the balcony overlooking\nthe pool area.  Through the translucent draperies, we see a\ngrouping of me.\n\nINT. CORLEONE APARTMENT AT THE TROPICANA - DAY\n\nMichael, Hagen, Neri and Rocco are seated in this luxury in\nthe hotel.  Michael sits in a comfortable chair in his\napartment.  Neri comes and brings him a drink without\nasking, but Michael refuses it.\n\n\t\t\t\tMICHAEL\n\t\tAl, get me a wet towel.  Does Kay\n\t\tknow I'm back?\n\nHagen nods.\n\n\t\t\t\tMICHAEL\n\t\tDid the boy get something from me\n\t\tfor Christmas?\n\n\t\t\t\tHAGEN\n\t\tI took care of it.\n\n\t\t\t\tMICHAEL\n\t\tWhat was it, so I'll know.\n\n\t\t\t\tHAGEN\n\t\tA little care he can ride in with\n\t\tan electric motor.\n\nNeri comes around with a wet face towel, which Michael uses\nto cool his eyes.  He puts the used towel down on the table.\n\n\t\t\t\tMICHAEL\n\t\tFellas, can you wait outside a\n\t\tminute?\n\nThey know what he means and leave the apartment, going out\nto the balcony where we can see them but they cannot hear.\nOnly Hagen remains.\n\n\t\t\t\tMICHAEL\n\t\tWhere's my brother?\n\n\t\t\t\tHAGEN\n\t\tRoth got out on a private boat.\n\t\tHe's in a hospital in Miami.  Had a\n\t\tstroke but he's recovered okay.\n\t\tBussetta's dead.\n\n\t\t\t\tMICHAEL\n\t\tI asked about Fredo?\n\n\t\t\t\tHAGEN\n\t\tThe new government arrested him,\n\t\theld him for a couple of days with\n\t\ta lot of the other casino people,\n\t\tincluding Roth's brother, Sam.  The\n\t\tAmerican Embassy arranged flights\n\t\tfor citizens; I'm not sure, but I\n\t\tthink he's somewhere in New York.\n\n\t\t\t\tMICHAEL\n\t\tI want you to reach Fredo.  I know\n\t\the's scared, but have one of our\n\t\tpeople reach him.  Assure him that\n\t\tthere will be no reprisals.  Tell\n\t\thim that I know Roth misled him.\n\n\t\t\t\tHAGEN\n\t\tMy information is that Fredo\n\t\tthought it was a kidnapping.  Roth\n\t\tassured him nothing would happen to\n\t\tyou.\n\n\t\t\t\tMICHAEL\n\t\t\t(indicating Rocco and\n\t\t\tNeri on the balcony)\n\t\tThey can come in now.\n\n\t\t\t\tHAGEN\n\t\tWait... there's something else.\n\n\t\t\t\tMICHAEL\n\t\tAlright.\n\nHagen pauses; doesn't know how to begin.\n\n\t\t\t\tMICHAEL\n\t\t\t(impatiently)\n\t\tGo on, tell me.\n\n\t\t\t\tHAGEN\n\t\tKay had a miscarriage; she lost the\n\t\tbaby.\n\nAfter a moment:\n\n\t\t\t\tMICHAEL\n\t\tWas it a boy or a girl?\n\n\t\t\t\tHAGEN\n\t\tMike, at three and a half...\n\n\t\t\t\tMICHAEL\n\t\tWhat is it, can't you give me\n\t\tstraight answers anymore!\n\n\t\t\t\tHAGEN\n\t\tIt was a boy.\n\n\t\t\t\tMICHAEL\n\t\tAnd Kay...she's all right?\n\n\t\t\t\tHAGEN\n\t\tShe took the Senate Investigation\n\t\tworse.\n\n\t\t\t\tMICHAEL\n\t\tDoes she blame it on me?  The baby?\n\n\t\t\t\tHAGEN\n\t\tI don't know.\n\nEXT. TAHOE ESTATE - DAY\n\nThe first snow of the New Year has fallen; the trees are\nbare, and there is hush all over this part of the Sierras.\nMichael is driven in his car, looking out at the familiar\nsight of the home he has been forced to be away from.\n\nVIEW ON MICHAEL\n\nlooking out from his window.  The last time he had seen the\nestate it was warm, and the trees were full.\n\nMOVING VIEW\n\napproaching the great stone gates; closed.  The bodyguards\nare not readily visible, but they are there.  The iron gates\nare opened, and one of the men makes a simple nod of respect,\nas the car pulls in.\n\nNEW VIEW\n\nInside the estate, the private roads have been freshly\nplowed, and occasionally a worker will pause to watch the\ncar as it passes.\n\nThe Grandchildren are in school now, and so the estate is\nespecially quiet.  Although there are signs that children\nlive here; a bicycle, a sled, a swing and gymnastic set, wet\nand with a rim of snow still on it.\n\nINT. MICHAEL'S HOUSE - VIEW FROM INSIDE THE HOUSE - DAY\n\nto the outside, where Michael walks slowly.  He stops and\nlooks at a little Italian red sportscar made for children.\n\nNEW VIEW\n\nThe front door opens, and Michael enters his own home.  It\nis very quiet, no one is at home to greet him.  He can see\nthe evidence of his family; things his wife and his children\nhave been using, and left on a sofa or a table.\n\nHe moves toward his and Kay's bedroom, where we can HEAR the\nSOUND of a sewing machine running.\n\nQuietly he opens the door.\n\nMICHAEL'S VIEW\n\ninto the bedroom.  Kay is sitting by the window, lit by the\ncold afternoon light, at work with her sewing machine.  She\nhasn't noticed that he's in the room yet, and goes on with\nher work.\n\nVIEW ON MICHAEL\n\nstands there a moment, watching, not making a sound.  And\nthen without a word, he steps back, and closes the door, so\nthat she doesn't see him.\n\nVIEW FROM INSIDE THE HOUSE\n\nonto Michael, moving outside, walking through the snow, he\nmoves to the house next to his own.\n\nINT. CONNIE'S HOUSE - DAY\n\nThis is the house where Mama lives with Connie's children,\nConnie so rarely is there.\n\nHe steps in; his mother is asleep in a chair in the living\nroom.  He moves to her, and bends low, whispers.\n\n\t\t\t\tMICHAEL\n\t\tMom... Mom...\n\nShe opens her eyes, which are red and small with age.\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tIt's Michael.  How are you, Mom?\n\n\t\t\t\tMAMA\n\t\t\t(Sicilian)\n\t\tI'm alright.  Will you stay home\n\t\tfor awhile?\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tThere are still things I have to do.\n\n\t\t\t\tMAMA\n\t\t\t(Sicilian)\n\t\tWell, we can all have a nice dinner\n\t\ttogether tonight.  How are your eyes?\n\n\t\t\t\tMICHAEL\n\t\tAlright.  They bother me once in\n\t\tawhile.\n\t\t\t(a pause as he thinks)\n\t\tTell me, when Pop had troubles...\n\t\tdid he ever think, even to himself,\n\t\tthat he had gone the wrong way;\n\t\tthat maybe by trying to be strong\n\t\tand trying to protect his family,\n\t\tthat he could... that he could...\n\t\tlose it instead?\n\n\t\t\t\tMAMA\n\t\t\t(Sicilian)\n\t\tYou talk about the baby.  She can\n\t\thave another baby.\n\n\t\t\t\tMICHAEL\n\t\t\t(Sicilian)\n\t\tNo, I meant lose his family.\n\n\t\t\t\tMAMA\n\t\t\t(as best she ever\n\t\t\tunderstood it)\n\t\tYour family?  How can you ever lose\n\t\tyour family?\n\n\t\t\t\tMICHAEL\n\t\t\t(almost to himself)\n\t\tBut times are different...\n\nFULL VIEW IN ROOM - MICHAEL AND HIS MOTHER\n\nQuietly we HEAR the music of a small band playing an Italian\nmarch.  From the orchestration, we know it is from the past.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. TRAIN STATION AT CORLEONE - DAY\n\nVitone and his young family: Mama, Santino, Fredo and the\nbaby Michael are met at the small station in Sicily by\nfriends, and Mama's relatives.  There is a small band,\nplaying for the occasion.  A small man has brought a motor\ncar to pick the family up; and there are certain dark men,\nwith shotguns slung over their shoulders to preside over the\noccasion.\n\nThe family is helped into the car; the luggage is packed on\nthe roof, and the car drives off.  The second car, with\nbodyguards following.\n\nEXT. DON TOMASINO'S VILLA OUTSIDE OF CORLEONE - DAY\n\nThe villa is bloomed with flowers and DON TOMASINO at this\npoint is a man in his late twenties.  He embraces Vitone and\npats the heads of his children, and leads them all into the\ngarden.\n\nINT. THE VILLA - SUMPTUOUS MED. VIEW - LATE DAY\n\nA sumptuous table is set for the visiting family from\nAmerica.  There is a warm atmosphere as Vito, his wife and\nchildren eat.  Tomasino and his family received presents\nfrom Carmella and to Tomasino's mother, and gifts are given\nto all of the children.\n\nAll typically American representing some of the prosperity\nand interests in the consumer goods that followed a great war.\n\nEXT. CORLEONE PLAZA - DAY\n\nThe family exits the church on the plaza of the town.  Vito\nshakes hands warmly with the priest.\n\nINT. VILLAGE COTTAGE - NIGHT\n\nThe door is open -- the footsteps of a man enter the room.\nWe follow these footsteps without quite knowing to whom they\nbelong.  They lead us to a bed, where we see asleep an OLD\nMAN.  He sleeps in his undershirt and is sweating, covered\nby mosquito netting.\n\nVIEW ALTERS\n\nand we realize that it is young Vito looking at the MAN.\n\nWe remember that the man is MOSCA, one of three men, who\nalmost twenty years before had hunted down Vito when he was\na boy.  With lightning speed, Vito slashes through the\nmosquito netting with a knife.  And with the movement\nprecise as a butcher's he disembowls this man.\n\nEXT. OLIVE OIL WAREHOUSE - FULL VIEW\n\nVito has brought his wife and children to see the Olive Oil\nDepot which is the link to his New York importing business.\nThey go inside.\n\nINT. OLIVE OIL WAREHOUSE - DAY\n\nThey are led by one of Vito's associates through rows and\nrows of large vats of olive oil.  Vito very proudly shows\nhis associates in Italy the olive oil can that will be used\nin the United States.  They all stand around at the link to\ntheir new importing business and share a toast of wine.\n\nEXT. THE BAY - DAY\n\nA team of Sicilian fisherman are at work mending their nets.\nOne sings accompanied by a guitar.\n\nVIEW MOVES TO ONE OF THE OLD FISHERMAN\n\nHe is recognized as the second of the men who had hunted\nVito down.  STROLLO.  As he walks we notice there is a\nfigure that is moving through the drying sails and barrels,\nit is Vito.  He moves quietly, stepping up behind the old\nman.  In an instant, he has thrown a garrote around his\nthroat, twisting it tight, so that there is very little\nsound.\n\nThen, almost silently dragging him through the space hidden\nby the drying sails.\n\nEXT. THE IMPRESSIVE ESTATE OF DON FRANCESCO - DAY\n\nWe see an old car approach.  Its driver is the young Tomasino.\nSitting in the car with him is Vito.\n\nThe car stops at the gates, and an old guard sees and\nrecognizes Tomasino, opens the gates allowing them to enter.\n\nMED. VIEW\n\non an almost decrepit DON FRANCESCO.  He must be in his\nearly nineties, sitting as powerful and as impressive as\never, in his throne-like chair from which he manages the\npower as the Mafia Chieftan of this village.  Young Don\nTomasino is speaking.\n\nWe notice in a little distance in the rear, there are some\nyounger shepherds with shotguns thrown over their shoulders.\n\n\t\t\t\tTOMASINO\n\t\t\t(Sicilian)\n\t\tDon Francesco, if you will honor\n\t\tme, by allowing me to introduce my\n\t\tassociate in America, in New York.\n\t\tHis name is Vito Corleone.\n\nThe old man and his eyes glance up at a notion of a man who\nhas taken the name of this town as his name.\n\n\t\t\t\tTOMASINO\n\t\tWe will supply him with olive oil\n\t\texclusively in the town of Corleone.\n\t\tHis company is called the \"Genco\n\t\tOlive Oil Company.\" Here we have\n\t\tbrought you an indication of how he\n\t\twill sell the product.\n\nTomasino respectfully puts a can of olive oil where the old\nman can look at it.  The old man nods, accepting the notion\nof this business.\n\n\t\t\t\tTOMASINO\n\t\t\t(Sicilian)\n\t\tWe have come to ask your blessing\n\t\tand permission to continue this\n\t\tenterprise.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\t\t (in a shrill, high,\n\t\t\traspy voice)\n\t\tWhere is this young man?\n\n\t\t\t\tTOMASINO\n\t\tHe is right here, standing next to\n\t\tme, Don Francesco.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tHave him come closer, I can't see\n\t\tvery well.\n\nVito takes those several steps, so that he is standing right\nin front of the old man.\n\nVIEW ON DON FRANCESCO\n\nlooking up, squinting against the sun.\n\nDON FRANCESCO'S VIEW\n\nStrangely backlit, almost blurry image of the young man from\nAmerica.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tWhat is your name?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tVito Corleone.\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tYou took the name of this town, eh?\n\t\tWhat was your father's name?\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tAntonio Andolini.\n\nCLOSE VIEW ON THE OLD MAN\n\nThe recognition of the name throws a shudder through him.\nIt is as though he recognizes that this is the boy; the son\nof his old enemy, whom he had killed, and whose sons he had\ntried to wipe out.  The old man raises his feeble hands\nsignalling his guard, and in his weak voice, he shouts:\n\n\t\t\t\tDON FRANCESCO\n\t\t\t(Sicilian)\n\t\tKill him!  Kill him!\n\nBut he is too late; Vito steps forward.\n\n\t\t\t\tVITO\n\t\t\t(Sicilian)\n\t\tIn the name of my Father, and my\n\t\tBrother...\n\nAnd uses the knife, ritualistically plunging it into the old\nman's belly, and then up to his throat, which is severed.\n\nVIEW ON TOMASINO\n\nhas drawn his pistol and quickly shoots one of the guards,\nhelping Vito to escape back into the motor car.\n\nVIEW ON A GUARD\n\nraising his shotgun.\n\nVIEW ON THE MOTOR CAR\n\nJust as Tomasino is about to get into the car, the shotgun\nis fired, and he is hit in the legs.\n\nVito manages to pull him up into the car, and they make\ntheir escape.\n\nEXT. RAILROAD STATION IN CORLEONE - DAY\n\nSome of the townspeople have come bringing flowers and gifts\nfor Vito and his family.\n\nHis wife is radiant with the flowers given her.\n\nThe train has arrived and the crowd shout \"Ciao, come back\nsoon.\"\n\nTHE VIEW ALTERS\n\nrevealing his good friend Tomasino, waving from his\nwheelchair.\n\nVIEW ON VITO\n\nand his wife.  She holds up the baby Michael, and helps him\nwave his hand.\n\nINT. SENATE CAUCUS ROOM - MED. CLOSE VIEW ON MICHAEL - DAY\n\n\t\t\t\tSENATOR KANE (O.S.)\n\t\tAre you the son of Vito Corleone?\n\n\t\t\t\tMICHAEL\n\t\tYes.\n\n\t\t\t\tSENATOR KING\n\t\tDid he use at times an alias?  Was\n\t\tthis alias in certain circles\n\t\tGODFATHER?\n\n\t\t\t\tMICHAEL\n\t\tIt was not an alias.  GODFATHER was\n\t\ta term of affection, used by his\n\t\tfriends, one of respect.\n\n\t\t\t\tSENATOR WEEKLER\n\t\t\t(Senator from New\n\t\t\tYork, very smooth,\n\t\t\tpartly liberal,\n\t\t\tTammany Hall)\n\t\tLet me agree with that.  Many of my\n\t\tconstituents are Italian and have\n\t\tbeen honored with that certain\n\t\tfriendship by my close Italian\n\t\tfriends.  Up to this point before I\n\t\thave to leave this hearing to join\n\t\tmy own committee, let me say, that\n\t\tthis hearing on the Mafia is in no\n\t\tway a slur on the Italians by the\n\t\tSenate; nor is it meant to be; nor\n\t\twill I allow it to be.  Italian\n\t\tAmericans are the hardest working,\n\t\tmost law abiding patriotic Americans\n\t\tof our country.  It is a shame and\n\t\ta pity that a few rotten apples\n\t\tgive them a bad name.  We are here\n\t\tto weed those rotten apples out of\n\t\tthe vast healthy barrel of Italian\n\t\tAmericans, who are one of the\n\t\tbackbones of our country.\n\nThere is a pause for a while, while the New York Senator\nposes for the TV cameras and leaves the hearing so that he\nwill not be associated with hearing the rough stuff.\n\n\t\t\t\tSENATOR KANE\n\t\tI'm sure we all agree with our\n\t\testeemed colleague.  Now, Mr.\n\t\tCorleone, you have been advised as\n\t\tto your legal rights.  We have had\n\t\ttestimony from a preceding witness\n\t\twho states you are head of the most\n\t\tpowerful Mafia family in this\n\t\tcountry.  Are you?\n\n\t\t\t\tMICHAEL\n\t\tNo.\n\n\t\t\t\tSENATOR KANE\n\t\tThis witness has testified that you\n\t\tare personally responsible for the\n\t\tmurder of a New York Police Captain\n\t\tin the year 1947 and with him a man\n\t\tnamed Virgil Sollozzo.  Do you deny\n\t\tthis?\n\n\t\t\t\tMICHAEL\n\t\tI deny his every charge.\n\n\t\t\t\tSENATOR KANE\n\t\tIs it true that in the year 1950\n\t\tyou devised the murder of the heads\n\t\tof the Five Families in New York,\n\t\tto assume and consolidate your\n\t\tnefarious power?\n\n\t\t\t\tMICHAEL\n\t\tThat is a complete falsehood.\n\n\t\t\t\tSENATOR KANE\n\t\tIs it true that you own a\n\t\tcontrolling interest in three of\n\t\tthe major hotels in Las Vegas?\n\n\t\t\t\tMICHAEL\n\t\tThat is not true.  I own some stock\n\t\tin some of the hotels, but only\n\t\tvery small amounts.  I also own\n\t\tsome American Telephone and IBM\n\t\tstock.\n\nMichael had checked this point with Hagen, before answering,\nand then once again after the answer.\n\n\t\t\t\tSENATOR ROGERS\n\t\tWhy is it necessary for your\n\t\tcounsel to advise you on that\n\t\tquestion?\n\n\t\t\t\tMICHAEL\n\t\tSenator, I've observed the head of\n\t\tGeneral Motors before a Senate\n\t\tCommittee, and his lawyer whispered\n\t\tin his ear.  That was not commented\n\t\tupon in the way you have just done.\n\n\t\t\t\tSENATOR KANE\n\t\tMr. Corleone, do you have any hotel\n\t\tinterests in the state of Arizona?\n\t\tOr any gambling interests in that\n\t\tstate?\n\n\t\t\t\tMICHAEL\n\t\tI do not.\n\n\t\t\t\tSENATOR KANE\n\t\tDo you have interests or control\n\t\tover gambling and narcotics in the\n\t\tstate of New York.\n\n\t\t\t\tMICHAEL\n\t\tI do not.\n\nA pause.  Silence, as the Chairman whispers something to his\nassistant.\n\nTom Hagen takes a paper out of his briefcase, and addresses\nthe Chair.\n\n\t\t\t\tHAGEN\n\t\tSenator, my client would like to\n\t\tread a statement for the record.\n\n\t\t\t\tSENATOR KANE\n\t\tI don't think that's necessary.\n\n\t\t\t\tHAGEN\n\t\tSir, my client has answered every\n\t\tquestion asked by this committee\n\t\twith the utmost cooperation and\n\t\tsincerity.  He has not taken that\n\t\tFifth Amendment as it was his right\n\t\tto do, and which because of the\n\t\textreme legal complexity of this\n\t\thearing, counsel advised him to do.\n\t\tSo, I think in all fairness this\n\t\tcommittee should hear his statement\n\t\tand put it in the record.\n\n\t\t\t\tSENATOR KANE\n\t\tVery well.\n\nAt this point Senator Rogers contemptuously walks out of the\nhearing room.\n\n\t\t\t\tMICHAEL\n\t\t\t(reading)\n\t\tIn the hopes of clearing my family\n\t\tname, in the sincere desire to give\n\t\tmy children their fair share of the\n\t\tAmerican way of life without a\n\t\tblemish on their name and background\n\t\tI have appeared before this\n\t\tcommittee and given it all the\n\t\tcooperation in my power.  I consider\n\t\tmy being called before this\n\t\tcommittee an act of prejudice to\n\t\tall Americans of Italian extraction.\n\t\tI consider it a great dishonor to\n\t\tme personally to have to deny that\n\t\tI am a criminal.  I wish to have\n\t\tthe following noted for the record.\n\t\tThat I served my country faithfully\n\t\tand honorably in World War II and\n\t\twas awarded the Distinguished\n\t\tService Cross for actions in\n\t\tdefense of my country.  That I have\n\t\tnever been arrested or indicted for\n\t\tany crime whatsoever... that no\n\t\tproof linking me to any criminal\n\t\tconspiracy, whether it is called\n\t\tMafia or Cosa Nostra or whatever\n\t\tother name you wish to give, has\n\t\tever been made public.  Only one\n\t\tman has made charges against me,\n\t\tand that man is known to be a\n\t\tmurderer, arsonist and rapist.  And\n\t\tyet this committee had used this\n\t\tperson to besmirch my name.  My\n\t\tpersonal protest can only be made\n\t\tto the people of this country.  I\n\t\tcan only thank God that in this\n\t\tcountry we have a legal system and\n\t\tcourts of law to protect innocent\n\t\tpeople from wild accusation.  I\n\t\tthank God for our democratic due\n\t\tprocess of Law that shields me from\n\t\tthe false charges made by this\n\t\tcommittee's witness.  I have not\n\t\ttaken refuge behind the Fifth\n\t\tAmendment, though counsel advised\n\t\tme to do so.  I challenge this\n\t\tcommittee to produce any witness or\n\t\tevidence against me, and if they do\n\t\tnot, I hope they will have the\n\t\tdecency to clear my name with the\n\t\tsame publicity with which they have\n\t\tnow besmirched it.  I ask this\n\t\twithout malice, in the interests of\n\t\tfair play.\n\nThe television cameras have documented this moment, as Hagen\nhands the document over to the committee lawyer.\n\n\t\t\t\tSENATOR ROGERS\n\t\tWe are all impressed.  The committee\n\t\twill now recess over the weekend.\n\t\tHowever, it will continue Monday\n\t\tmorning, at eleven a.m.  At that\n\t\ttime, this committee will then\n\t\tproduce a witness directly linking\n\t\tMr. Corleone to the charges we have\n\t\tmade.  And then, Mr. Corleone may\n\t\tvery well by liable for indictments\n\t\tof perjury.  However, this document\n\t\twill be made a matter of record.\n\nEXT. ARMY POST - DAY\n\nAn army post somewhere in the East.  It is safely guarded.\n\nINT. HOUSE ON THE POST - DAY\n\nwhere Pentangeli is being held by his constant companions,\nthe two FBI MEN.\n\n\t\t\t\tPENTANGELI\n\t\tTen to one shot, you said.  Ten to\n\t\tone shot in my favor, and I lose.\n\n\t\t\t\tFBI MAN #1\n\t\tGet a good night's sleep.  We got a\n\t\tnew suit, new shirt, new tie, and\n\t\tI'm going to shave you myself.\n\t\tTomorrow we want you to look\n\t\trespectable for fifty million of\n\t\tyour fellow Americans.\n\n\t\t\t\tPENTANGELI\n\t\tMy life won't be worth a nickel\n\t\tafter tomorrow.\n\n\t\t\t\tFBI MAN #1\n\t\tWe have a special home for you for\n\t\tthe rest of your life.  Nobody gets\n\t\tnear you.  You're not going any\n\t\tplace.\n\n\t\t\t\tPENTANGELI\n\t\tYeah, some deal I made.\n\n\t\t\t\tFBI MAN #2\n\t\tYou live like a king.  You'll be a\n\t\thero.  You'll live better in here\n\t\tthan most people on the outside.\n\n\t\t\t\tPENTANGELI\n\t\tSome deal.\n\t\t\t(pause)\n\t\tI just wish Mike had took the Fifth.\n\n\t\t\t\tFBI MAN #1\n\t\tWhy'd you do it, Frankie?  After\n\t\tall these years, why'd you turn\n\t\tagainst him?\n\n\t\t\t\tPENTANGELI\n\t\tI didn't turn against nobody; he\n\t\tturned against me.\n\nEXT. THE BOATHOUSE ALCOVE - DAY\n\nA somewhat frightened Fredo Corleone sits in the easy chair\noverlooking the lake in this canopied section of the\nboathouse.  Rocco sits with him.\n\nINT. BOATHOUSE - DAY\n\nMichael is in the dark room with Hagen and Neri.\n\n\t\t\t\tMICHAEL\n\t\tHow did they get their hands on\n\t\tPentangeli?\n\n\t\t\t\tHAGEN\n\t\tRoth engineered it, Michael.  He\n\t\tmade Pentangeli think you hit him.\n\t\tDeliberately letting him get off\n\t\talive.  Then the New York detectives\n\t\tturned Frankie over to the FBI.  My\n\t\tinformants say he was half dead and\n\t\tscared stiff -- talking out loud\n\t\tthat you had turned on him and\n\t\ttried to kill him.  Anyway, they\n\t\thad him on possession, dealing in\n\t\theroin, murder one and a lot more.\n\t\tThere's no way we can get to him\n\t\tand you've opened yourself to five\n\t\tpoints of perjury.\n\n\t\t\t\tNERI\n\t\tThey've got him airtight.  He's in\n\t\ta military base, twenty-four hour\n\t\tguards.  Trying to kill him is like\n\t\ttrying to like the President --\n\t\tit's impossible.\n\n\t\t\t\tMICHAEL\n\t\tWhat does Fredo know?\n\n\t\t\t\tHAGEN\n\t\tHe says he doesn't know anything,\n\t\tand I believe him.  Roth played\n\t\tthis one beautifully.\n\n\t\t\t\tMICHAEL\n\t\tAlright.  I'm going to go outside\n\t\tand talk to Fredo.\n\nEXT. BOATHOUSE FOYER - DAY\n\nFredo sits on the couch.  When Rocco sees Michael, he\nautomatically takes his leave.  Michael sits in the chair\nopposite Fredo.\n\n\t\t\t\tFREDO\n\t\t\t(after a pause)\n\t\tI don't have a lot to say, Michael.\n\n\t\t\t\tMICHAEL\n\t\tWe have time.\n\n\t\t\t\tFREDO\n\t\tI was kept pretty much in the dark.\n\t\tI didn't know all that much.\n\n\t\t\t\tMICHAEL\n\t\tWhat about now, is there anything\n\t\tyou can help me out with?\n\n\t\t\t\tFREDO\n\t\tI know they get Pentangeli, that's\n\t\tall I know.\n\nFredo gets up, walks to the glass panel that separates the\nterrace from the lake.\n\n\t\t\t\tFREDO\n\t\tI didn't know it was a hit.  I\n\t\tswear to you I didn't know.  Johnny\n\t\tOla contacted me in Beverly Hills --\n\t\tsaid he wanted to talk.  He said\n\t\tyou and Roth were in on some big\n\t\tdeal, and there was a place for me\n\t\tin it if I could help them out.\n\t\tThey said you were being tough on\n\t\tthe negotiation, and if they had a\n\t\tlittle bit of help, they could\n\t\tclose it fast and it would be good\n\t\tfor you.\n\n\t\t\t\tMICHAEL\n\t\tAnd you believed that story.\n\n\t\t\t\tFREDO\n\t\tHe said there was something good in\n\t\tit for me...me on my own.\n\n\t\t\t\tMICHAEL\n\t\tI've always taken care of you.\n\n\t\t\t\tFREDO\n\t\tTaken care of me.  Mike, you're my\n\t\tkid brother, and you take care of\n\t\tmy.  Did you ever think of that.\n\t\tEver once?  Send Fredo off to do\n\t\tthis, send Fredo to take care of\n\t\tthat... take care of some little\n\t\tunimportant night club here, and\n\t\tthere; pick somebody up at the\n\t\tairport.  Mike, I'm your older\n\t\tbrother; I was stepped over!\n\n\t\t\t\tMICHAEL\n\t\tIt's the way Pop wanted it.\n\n\t\t\t\tFREDO\n\t\tIt wasn't the way I wanted it!  I\n\t\tcan handle things.  I'm not dumb\n\t\tChrist, not like everyone says.\n\t\tI'm smart; and I want respect.\n\n\t\t\t\tMICHAEL\n\t\tThere's nothing more you can tell\n\t\tme about this investigation?\n\n\t\t\t\tFREDO\n\t\tThe lawyer; Questadt, he belongs to\n\t\tRoth.\n\n\t\t\t\tMICHAEL\n\t\tYou're nothing to me now, Fredo;\n\t\tnot a brother, not a friend, I\n\t\tdon't want to know you, or what\n\t\thappens to you.  I don't want to\n\t\tsee you at the hotels, or near my\n\t\thome.  When you visit our Mother, I\n\t\twant to know a day in advance, so I\n\t\twon't be there.  Do you understand?\n\nMichael turns, and starts to leave.  A frightened voice\nbehind him:\n\n\t\t\t\tFREDO\n\t\tMikey?\n\nMichael doesn't stop, doesn't turn back.  He continues off\nthrough the veranda, and out the summer doors.\n\nNeri stops by him.\n\n\t\t\t\tMICHAEL\n\t\tI don't want anything to happen to\n\t\thim while my Mother's alive.\n\nMichael leaves.\n\nEXT. ARMY POST - DAY\n\nFive cars brimming with Army guards and Agents are waiting\nto move Pentangeli.  There is one empty car.\n\nINT. GUARDED HOUSE - DAY\n\nThe two FBI Agents are helping Pentangeli get dressed.  He's\nin brightly colored striped shorts and bare-chested.  The\nAgents help him with the shirt and tie.  One holds out the\ntrousers but Pentangeli ignores it and looks at himself in\nthe mirror.\n\n\t\t\t\tFBI MAN #1\n\t\tReady, Frankie.\n\n\t\t\t\tPENTANGELI\n\t\tLet's go.\n\nThe Agents open the door, and precede him, surveying the\narea.  They check the cars waiting, each with two Agents.\nThey check the gate and note the military sentries.  Then\nthey stand aside, and let Pentangeli come out.  They get\nclose to his side, and it is obvious they will protect his\nlife with their own.\n\nEXT. ARMY POST - DAY\n\nThe Agents put him in the front seat of the empty car, and\nget in with him, one at each side.  Another Agent drives.\nNow, the first cars start out; the Sentries opening the\ngates, and letting the caravan pass.\n\nAn Army supply truck comes very close to them, and the\nAgents next to Pentangeli become very tense.  Pentangeli\ngrins.  Then the truck passes on, and they relax.\n\nINT. SENATE CAUCUS ROOM - DAY\n\nThe room is crowded with TV journalists, cameras, etc.  We\npick Pentangeli up, closely guarded, being led to witness\nchair.\n\nPentangeli is seated, and made to take his oath.  FBI Agents\nare all around him.\n\nMED. VIEW\n\nAnyone given entrance to the caucus room is being frisked.\nThe five Senators take their places.\n\nVIEW ON HAGEN\n\nwaiting at his long table, very nervous.  He seems startled\nby the appearance of Pentangeli.\n\nVIEW ON PENTANGELI\n\ncatching Hagen's eye.  It's as though he is pleading for\nsome kind of understanding of the fact that he has become a\ntraitor.\n\nVIEW ON HAGEN\n\ncold; then he turns away.\n\nVIEW ON THE ENTRANCE\n\nThe bustle is settling down; then Michael Corleone enters,\nand with him is someone very peculiar and out of keeping for\nthis setting.  A burly-chested imposing man of middle age.\nVery powerful-looking with frightening magnetic eyes.  His\ndress is odd: boots, rough tie, and shirt.  He could be the\ntenor out of a Sicilian opera.  He is clearly a country Don,\ndirect from Sicily, and he dominates the room.\n\nVIEW ON PENTANGELI\n\nAt first his view is blocked.  Then he sees Michael and is a\nbit shamefaced, but still defiant.\n\nPENTANGELI'S POV\n\nMichael returns his glances without emotion.  Then the VIEW\nALTERS, revealing the Sicilian.\n\nVIEW ON PENTANGELI\n\nHe is terror stricken; obviously he recognizes the man.\n\nVIEW ON HAGEN'S TABLE\n\nMichael and the Sicilian sit by Hagen, where they can stare\ndirectly at Pentangeli; he is frozen with fear.\n\nVIEW ON THE SENATOR\n\nNotices the tension in the room.  The Chairman commences:\n\n\t\t\t\tSENATOR KANE\n\t\tWe have here a witness who will\n\t\ttestify further on Michael\n\t\tCorleone's rule of the criminal\n\t\tempire that controls gambling in\n\t\tthis country and perhaps in other\n\t\tcountries.  This witness had no\n\t\tbuffer between himself and Michael\n\t\tCorleone.  He can corroborate our\n\t\tcharges on enough counts for this\n\t\tcommittee to consider a charge of\n\t\tperjury against Michael Corleone.\n\t\t\t(then he turns to Pentangeli)\n\t\tYour name please, for the record.\n\n\t\t\t\tPENTANGELI\n\t\tFrank Pentangeli.\n\n\t\t\t\tSENATOR KANE\n\t\tWere you a member of the Corleone\n\t\tFamily?  Were you under the\n\t\tCaporegime Peter Clemenza, under\n\t\tVito Corleone, known as the\n\t\tGodfather?\n\nThere is a long silence.\n\nVIEW ON PENTANGELI\n\nHe seems unable to speak.\n\nVIEW ON THE SICILIAN\n\ngazing at him.\n\nVIEW ON PENTANGELI\n\n\t\t\t\tPENTANGELI\n\t\tI never knew no Godfather.  I got\n\t\tmy own family.\n\nSenator Kane is stunned.  The two FBI men are alert, their\neyes searching the room for what has intimidated their\nwitness at the last moment.\n\n\t\t\t\tSENATOR KANE\n\t\tMr. Pentangeli, you are\n\t\tcontradicting your confessions to\n\t\tour investigators; I ask you again,\n\t\twere you a member of a crime\n\t\torganization headed by Michael\n\t\tCorleone?\n\n\t\t\t\tPENTANGELI\n\t\tNo.  I never heard of it.  I never\n\t\theard of nothing like that.  I was\n\t\tin the olive oil business with his\n\t\tfather a long time ago.  That's all.\n\n\t\t\t\tSENATOR KANE\n\t\tWe have your confession that you\n\t\tmurdered on the orders of Michael\n\t\tCorleone.  Do you deny that\n\t\tconfession and do you know what\n\t\tdenying that confession will mean\n\t\tto you?\n\nThe die is cast and like a good soldier, Pentangeli will go\nall the way now.  So he is brazen in his defiance of the\nSenator.\n\n\t\t\t\tPENTANGELI\n\t\tThe FBI guys promised me a deal.\n\t\tSo I made up a lot of stuff about\n\t\tMichael Corleone.  Because then,\n\t\tthat's what they wanted.  But it\n\t\twas all lies.  Everything.  They\n\t\tsaid Michael Corleone did this,\n\t\tMichael Corleone did that.  So I\n\t\tsaid, \"Yeah, sure.\"\n\nHe makes a big grin to show how he has made fools of\neverybody.\n\nVIEW ON THE FBI AGENTS\n\nglancing around the room; their eyes have settled on the\nSicilian.  One of them scribbles a note on a piece of paper,\nand passes it to the Committee lawyer.  Then in turn it goes\nto Senator Kane.\n\n\t\t\t\tSENATOR KANE\n\t\tMr. Hagen, would you kindly identify\n\t\tto this committee that gentleman\n\t\tsitting on your right hand?\n\n\t\t\t\tHAGEN\n\t\t\t(coolly)\n\t\tYes, sir.  His name is Vincenzo\n\t\tPentangeli.\n\n\t\t\t\tSENATOR KANE\n\t\tIs he related to the witness?\n\n\t\t\t\tHAGEN\n\t\tHe is, I believe, a brother.\n\nVIEW ON MICHAEL AND VINCENZO PENTANGELI\n\nThey wait with no expression.\n\n\t\t\t\tSENATOR KANE\n\t\t\t(to Vincenzo Pentangeli)\n\t\tSir, I would like you to take the\n\t\tstand.\n\nVincenzo stares at him, uncomprehending.  There may just be\na shadow of contempt.  He doesn't answer.\n\n\t\t\t\tHAGEN\n\t\tSir, the gentleman does not\n\t\tunderstand English.  He would not\n\t\tin any case, take the stand.  He\n\t\tcame, at his own expense, to aid\n\t\this brother in his trouble.  He is\n\t\tnot under any jurisdiction of our\n\t\tgovernment and his reputation in\n\t\this own country is impeccable.\n\n\t\t\t\tSENATOR KANE\n\t\t\t(furious)\n\t\tThe witness is excused; take him out.\n\nThe guards and FBI Agents quickly remove Pentangeli, as\neverybody else in the room is required to sit still.\n\n\t\t\t\tHAGEN\n\t\tSenator Kane.\n\n\t\t\t\tSENATOR KANE\n\t\tThis meeting is adjourned.\n\n\t\t\t\tHAGEN\n\t\t\t(rising and shouting)\n\t\tThis committee owes an apology!\n\n\t\t\t\tSENATOR KANE\n\t\tThe committee is adjourned until\n\t\tfurther notice.\n\nFor the first time, in the midst of the confusion, Hagen\nsmiles.  A bitter, contemptuous smile.\n\nVIEW ON MICHAEL\n\nThe modest champion.  He rises and they take their leave.\n\nVIEW ON THE TWO FBI AGENTS\n\nThey watch the Corleone party as they exit.\n\nINT. WASHINGTON HOTEL CORRIDOR - DAY\n\nThe Corleone nurse is waiting, playing with the little girl\nMARY.  A distance away, the boy, Anthony, is standing by\nhimself.\n\nINT. MICHAEL'S SUITE - WASHINGTON HOTEL - DAY\n\nThe door to Michael's suite opens; Rocco leans in.\n\n\t\t\t\tROCCO\n\t\tIt's Kay.\n\nMichael is sitting in an easy chair; he seems to have\ndifficulty with his eyes.\n\n\t\t\t\tMICHAEL\n\t\tOn the phone?\n\n\t\t\t\tROCCO\n\t\tNo, she's here.\n\nMichael rises, surprised.  Rocco steps back, and Kay enters.\n\n\t\t\t\tMICHAEL\n\t\tI had no idea...\n\n\t\t\t\tKAY\n\t\tI wanted to see you before you went\n\t\tback to Nevada.  Also, the\n\t\tchildren - Michael, they're here.\n\n\t\t\t\tMICHAEL\n\t\tWhere?\n\n\t\t\t\tKAY\n\t\tIn a minute.  They're outside with\n\t\tEsther.  I'm very happy for you...\n\t\tI suppose I knew that you're simply\n\t\ttoo smart for anyone ever to beat\n\t\tyou.\n\n\t\t\t\tMICHAEL\n\t\tWhy don't you sit down?\n\n\t\t\t\tKAY\n\t\tI'm not going to stay long; I can't.\n\n\t\t\t\tMICHAEL\n\t\tThere are a lot of things I want to\n\t\ttalk to you about.  Things I've\n\t\tbeen thinking about -- changes I\n\t\twant to make.\n\n\t\t\t\tKAY\n\t\tI think it's too late for changes,\n\t\tMichael.  I promised myself I\n\t\twouldn't talk about it and I've\n\t\tgone and spoiled it.\n\n\t\t\t\tMICHAEL\n\t\tWhy too late?\n\n\t\t\t\tKAY\n\t\tTell me, Michael.  What really\n\t\thappened with Pentangeli?\n\n\t\t\t\tMICHAEL\n\t\tHis brother came to help him.\n\n\t\t\t\tKAY\n\t\tI didn't even know he had a brother.\n\t\tAnd where is he now?\n\n\t\t\t\tMICHAEL\n\t\tOn a plane back to Sicily.\n\n\t\t\t\tKAY\n\t\tAnd that's all he had to do.  Just\n\t\tshow his face.\n\n\t\t\t\tMICHAEL\n\t\tThat's all.  You see, in Sicily, in\n\t\tthe old days... there was only one\n\t\tlegitimate reason to kill a blood\n\t\trelative... only one.  IF he was a\n\t\ttraitor.\n\n\t\t\t\tKAY\n\t\tYou would have killed his brother?\n\n\t\t\t\tMICHAEL\n\t\tKay, you've got it wrong.  That\n\t\tkind of thing's all over, I promised\n\t\tyou.  This was between the two\n\t\tbrothers.  Years ago Frankie had a\n\t\tyoung girlfriend; he called her his\n\t\tco-wife.  That was his joke, but he\n\t\tmeant it.  He wouldn't divorce his\n\t\twife... because she was a great\n\t\tcook.  He said he girlfriend made a\n\t\tspaghetti sauce once and it was so\n\t\tterrible he knew he could never\n\t\tmarry her.  He set her up in a\n\t\thouse in Jersey.  She had to be\n\t\tfaithful... and she had to have kids.\n\t\tAnd she did, two, a boy and a girl.\n\t\tHe had her checked out and watched\n\t\tso she couldn't cheat... but the\n\t\tgirl couldn't stand that kind of\n\t\tlife.  She begged him to let her go.\n\t\tHe did.  He gave her money and made\n\t\ther give up the kids.  Then Frankie\n\t\ttook them to Italy, and had them\n\t\tbrought up by his brother Vincenzo.\n\t\tWhere he knew they'd by safe.\n\nKay begins to realize.\n\n\t\t\t\tMICHAEL\n\t\tWhen he saw his brother in the\n\t\thearing room, he knew what was at\n\t\tstake.\n\t\t\t(pause)\n\t\tI don't think Vincenzo would have\n\t\tdone it.  He loves the kids, too.\n\t\tOmerta, Kay.  Honor, silence.  It\n\t\thad nothing to do with me.  It was\n\t\tbetween those brothers.\n\n\t\t\t\tKAY\n\t\tI'll bring the children up now;\n\t\tthey want to say goodbye.\n\n\t\t\t\tMICHAEL\n\t\tKay, I told you...\n\n\t\t\t\tKAY\n\t\tGoodbye, Michael.\n\n\t\t\t\tMICHAEL\n\t\tI won't let you leave!  Christ, do\n\t\tyou think I'm going to let you leave.\n\n\t\t\t\tKAY\n\t\t\t(meekly)\n\t\tMichael.\n\n\t\t\t\tMICHAEL\n\t\tNo, I don't want to hear anything.\n\t\tThere are things between men and\n\t\twomen that will not change; things\n\t\tthat have been the same for\n\t\tthousands of years.  You are my\n\t\twife, and they are my children...\n\t\tand I love you and I will not let\n\t\tyou leave, because you are MINE!\n\n\t\t\t\tKAY\n\t\tOh, I do feel things for you,\n\t\tMichael; but now, I think it's pity.\n\t\tFor the first time since I've known\n\t\tyou, you seem so helpless.  You\n\t\theld me a prisoner once; will you\n\t\ttry again?\n\n\t\t\t\tMICHAEL\n\t\tIf that's what it takes; then yes,\n\t\tI will.\n\n\t\t\t\tKAY\n\t\tAt this moment, I feel no love for\n\t\tyou at all.  I never thought that\n\t\tcould happen, but it has.\n\n\t\t\t\tMICHAEL\n\t\tWe'll go back tonight.  Bring the\n\t\tchildren.\n\n\t\t\t\tKAY\n\t\tYou haven't heard me.\n\nHe moves to her; he does love her, and is tender with her.\n\n\t\t\t\tMICHAEL\n\t\tHow can I let you leave; how can I\n\t\tlet you take my children away?\n\t\tDon't you know me?  You understand,\n\t\tit's an impossibility.  I would\n\t\tnever let it happen; no, never, not\n\t\tif it took all my strength, all my\n\t\tcunning.  But in time, soon, you'll\n\t\tfeel differently.  You see, you'll\n\t\tbe happy that I stopped you.  I\n\t\tknow you.  You'll forget about\n\t\tthis; you'll forget about the baby\n\t\twe lost... and we'll go on, you and\n\t\tI.\n\n\t\t\t\tKAY\n\t\tThe baby I lost...\n\n\t\t\t\tMICHAEL\n\t\tI know what it meant... and I'm\n\t\tprepared to make it up to you.  I\n\t\twill make changes; I can.\n\t\t\t(he clenches his fist tightly)\n\t\tI CAN change; that I have learned,\n\t\tthat I have the strength to change...\n\t\tAnd we have another child, a boy...\n\t\tand you'll forget the miscarriage.\n\n\t\t\t\tKAY\n\t\tIt wasn't a miscarriage.  And you\n\t\twith your cunning, couldn't you\n\t\tfigure it out!  It was an abortion;\n\t\tan abortion, like our marriage is\n\t\tan abortion, something unholy and\n\t\tevil.  I don't want your son; I\n\t\twouldn't bring another of your sons\n\t\tinto this world.  An abortion,\n\t\tMichael... it was a son, and I had\n\t\tit killed, but this must all end!\n\nVIEW ON MICHAEL\n\nHe had no hint, not in his wildest imagination could he have\nguessed that she would do such a thing.\n\n\t\t\t\tKAY\n\t\tAnd I know that now it's over; I\n\t\tknew it then, there would be no way\n\t\tyou could ever forgive me, not with\n\t\tthis Sicilian thing that goes back\n\t\ttwo thousand years.\n\nHe is silent, though raging -- then, with all his passion,\nand his strength, he raises his arms, and strikes her across\nher neck, literally knocking her down to the floor, and\nhurting her badly.\n\n\t\t\t\tMICHAEL\n\t\t\t(coldly)\n\t\tYou won't take my children.\n\n\t\t\t\t\t\t\tFADE OUT.\n\nFADE IN:\n\nEXT. THE CORLEONE ESTATE AT TAHOE - FULL VIEW - DAY\n\nA collection of dark cars and black limousines are gathered\nto one side.  A few drivers wait quietly.\n\nAnd then, to the other extreme of the estate, is a small\ngrouping of about twenty to thirty people, gathered near\nMichael's house.\n\nMED. CLOSE SHOT\n\nConnie Corleone, dressed simply and now showing her age\nwithout the carefully applied makeup which we have been used\nto, kneels down before the shrine of Santa Theresa, and puts\ndown a bouquet of flowers, along with others that have been\nplaced there.  We see that some have the simple silk ribbon\nwith the word \"Mama\" hand-lettered upon it.\n\nHer two children stand close behind her; they had been\nraised by their Grandmother.\n\nConnie steps back, and moves through the small group of\nfriends and relatives, into Michael's house.\n\nINT. MICHAEL'S HOUSE - CONNIE'S VIEW - DAY\n\nFredo, kneeling by the coffin of his mother in a portion of\nthe house that has been set aside for the wake.  Fredo\nconcludes his prayer, wipes away the tears in his eyes and\nsteps away from the coffin.\n\nHe stops when he notices Neri, a little distance away,\nlooking at him.\n\nVIEW ON NERI\n\nAfter a moment, he nods respectfully to Fredo, and steps\nforward, moving to the old woman's coffin.  Fredo moves to\nHagen, who is there with his wife and children.\n\n\t\t\t\tFREDO\n\t\tTom.  Where's Mike?\n\n\t\t\t\tHAGEN\n\t\t\t(difficult to tell him)\n\t\tHe's waiting for you to leave.\n\n\t\t\t\tFREDO\n\t\tCan I talk to him?\n\n\t\t\t\tHAGEN\n\t\tNo chance.  I'm sorry, Freddie.\n\n\t\t\t\tCONNIE\n\t\t\t(who has heard this)\n\t\tCan I see him?\n\n\t\t\t\tHAGEN\n\t\tHe's in the boathouse.\n\nINT. THE BOATHOUSE - MED. VIEW - DAY\n\nMichael sits quietly in the darkened room in one of the big\nsofas, dressed immaculately in suit and tie.  His two\nchildren, also dressed for the wake sit opposite him in the\nother oversized sofa, their shoes not touching the floor.\nWe regard this tableau for a long moment.\n\n\t\t\t\tCONNIE (O.S.)\n\t\t\t(quietly)\n\t\tMichael?  It's Connie.\n\nShe comes in, and sits down by his knees.\n\n\t\t\t\tCONNIE\n\t\tI want to stay close to home now,\n\t\tis that alright?\n\nMichael nods.\n\n\t\t\t\tCONNIE\n\t\tIs Kay coming?\n\n\t\t\t\tMICHAEL\n\t\tNo.\n\n\t\t\t\tCONNIE\n\t\tMichael, Fredo's in the house with\n\t\tMama.  He asked for you, and Tom\n\t\tsaid he couldn't see you.\n\n\t\t\t\tMICHAEL\n\t\tTom is right.\n\n\t\t\t\tCONNIE\n\t\tKids, why don't you go outside for\n\t\ta while?\n\nThe children don't move; Connie realizes they will only\nlisten to Michael.\n\n\t\t\t\tCONNIE\n\t\tI want to talk to you, Michael.\n\n\t\t\t\tMICHAEL\n\t\tThe children can stay.\n\n\t\t\t\tCONNIE\n\t\tI hated you for so long, Michael;\n\t\tfor so many years.  I think I did\n\t\tthings to myself, to hurt myself,\n\t\tso that you would know -- and you\n\t\twould be hurt too.  But I understand\n\t\tyou now; I think I do.  You were\n\t\tbeing strong for all of us, like\n\t\tPapa was.  And I forgive you, and\n\t\twant to be close to you now.  Can't\n\t\tyou forgive Fredo; he's so sweet,\n\t\tand helpless without you.\n\nSlowly, Michael puts his hand on her hair, and touches her\ngently.\n\n\t\t\t\tCONNIE\n\t\tYou need me, Michael.  I want to be\n\t\twith you now.\n\nINT. MICHAEL'S HOUSE - DAY\n\nFriends, relatives; Francesca and her new husband, Gardner\nand their baby; Sandra Corleone; Teresa, her children; all\nthe familiar faces of the family are present, quietly paying\ntheir respects to Mama.\n\nSome of the men can be seen in the kitchen, drinking wine,\nand talking in low voices.\n\nFredo is there, broken-hearted over the loss of his Mother;\nlike some lost child with no friends.\n\nMED. VIEW\n\nMichael enters the room, followed by Connie, who tends\nlittle Mary and Anthony.\n\nHe approaches his brother, and then embraces.  Fredo breaks\ninto tears.\n\n\t\t\t\tFREDO\n\t\tChrist, Mike.  Jesus Christ, Mike.\n\nVIEW ON MICHAEL\n\nembracing his brother, he glances up.\n\nVIEW ON NERI\n\nquiet, and deadly.\n\nEXT. THE TAHOE ESTATE - MED. VIEW - DAY\n\nTom Hagen is talking in the distance to his wife, and one of\nhis older sons; he kisses, and moves toward the boathouse.\nAfter crossing the lawn, he stops.\n\nVIEW ON SANDRA CORLEONE\n\nwaiting there; obviously wanting to talk to him.  He\ncontinues, and she walks with him.\n\nMOVING VIEW ON THE TWO\n\nas they cross toward the boathouse.\n\n\t\t\t\tSANDRA\n\t\tYou're going to talk to him now.\n\n\t\t\t\tHAGEN\n\t\tYes.\n\n\t\t\t\tSANDRA\n\t\tWill you tell him?\n\n\t\t\t\tHAGEN\n\t\tI don't know.\n\nShe stops him.\n\n\t\t\t\tSANDRA\n\t\tTom, think of yourself for once.\n\t\tDon't let this opportunity slip\n\t\tthrough your fingers; don't do it.\n\t\tWe're all trapped here, don't you\n\t\tsee?\n\nHe continues past her, without answering her.  Continues up\nto the boathouse.  He stops before he enters.\n\nHAGEN'S VIEW\n\nFredo is sitting by the edge of the harbor with Michael's\nson Anthony; he is helping him with some fishing rig.\n\nINT. THE BOATHOUSE - VIEW ON MICHAEL - DAY\n\nlooking through the window at his son and brother.  Neri\nsits in the room, dressed informally.\n\n\t\t\t\tMICHAEL\n\t\t\t(without looking back)\n\t\tSit down, Tom.  Have you heard\n\t\tabout our friend and partner, Mr.\n\t\tHyman Roth?\n\n\t\t\t\tHAGEN\n\t\tI know he's in Israel.\n\n\t\t\t\tNERI\n\t\t\t(hands Hagen the paper)\n\t\tThe High Court of Israel turned\n\t\tdown his request to live as a\n\t\t'returned Jew.' His passport's been\n\t\tinvalidated except for return to\n\t\tthe U.S.  He landed in Buenos Aires\n\t\tyesterday, offered a gift of one\n\t\tmillion dollars if they would give\n\t\thim citizenship.  They turned him\n\t\tdown.\n\n\t\t\t\tHAGEN\n\t\t\t(reading)\n\t\tHe's going to try Panama...\n\n\t\t\t\tMICHAEL\n\t\tThey won't take him; not for a\n\t\tmillion, not for ten million.\n\n\t\t\t\tHAGEN\n\t\tHis medical condition is reported\n\t\tas... \"terminal.\"\n\n\t\t\t\tMICHAEL\n\t\tHe's been dying of the same heart\n\t\tattack for twenty years.\n\n\t\t\t\tHAGEN\n\t\tThat plane goes to Miami...\n\n\t\t\t\tMICHAEL\n\t\tI want it met.\n\n\t\t\t\tHAGEN\n\t\t\t(understanding)\n\t\tMike, it's impossible.  He'll be\n\t\tmet by the Internal Revenue; the\n\t\tCustoms Service, and half the FBI.\n\n\t\t\t\tMICHAEL\n\t\tI don't like it when you use the\n\t\tword impossible; nothing is\n\t\timpossible...\n\n\t\t\t\tHAGEN\n\t\tMike, it would be like trying to\n\t\tkill the President; there's no way\n\t\twe can get to him.\n\n\t\t\t\tMICHAEL\n\t\tI'm surprised at you, Tom.  If\n\t\tthere's anything certain; certain\n\t\tin life; if history has taught us\n\t\tanything, it's that you can kill...\n\t\t\t(he stops, then coldly)\n\t\tANYBODY.  But perhaps your\n\t\trelucatance is because you've come\n\t\tto tell me that you're moving your\n\t\tfamily to Vegas, that you've been\n\t\toffered the Vice-Presidency of the\n\t\tHoustan Hotels there.  Or weren't\n\t\tyou going to tell me at all?\n\n\t\t\t\tHAGEN\n\t\tAre you so hungry for traitors; do\n\t\tyou want to find them everywhere?\n\n\t\t\t\tMICHAEL\n\t\tThey are everywhere!\n\n\t\t\t\tHAGEN\n\t\tI turned Houstan down; I didn't see\n\t\twhy I should tell you about an\n\t\toffer I turned down.\n\t\t\t(Michael begins to\n\t\t\tconfuse him)\n\t\tAre you sure, Mikey?  Are you sure\n\t\tof what we're doing; what we'll\n\t\tgain; what does the family gain?\n\t\tForget that, Mike; I already know\n\t\tthe answer.\n\n\t\t\t\tMICHAEL\n\t\tI know you do, Tom.  Then I can\n\t\tcount on you to help me do the\n\t\tthings I have to do.  If not, call\n\t\tHoustan, and become a Vice-President.\n\t\tTake your family and your mistress\n\t\tand move them to Las Vegas.\n\n\t\t\t\tHAGEN\n\t\tWhy do you hurt me, Michael?  I've\n\t\talways been loyal to you.\n\n\t\t\t\tMICHAEL\n\t\tGood.  Then you're staying.\n\n\t\t\t\tHAGEN\n\t\tI'm staying.\n\t\t\t(he pauses...then,\n\t\t\twithout being asked)\n\t\tDon't ever enjoy the cruel part of\n\t\tall this; Sonny never listened to\n\t\tme about that.\n\t\t\t(then he sits down,\n\t\t\tand opens his briefcase)\n\t\tNow, explain everything to me.\n\nEXT. THE HARBOR - DAY\n\nFredo sits with Anthony, with a silly-looking fishing hat on\nhis head, covered with lure and flies.\n\n\t\t\t\tFREDO\n\t\tAnthony, ole buddy, your Uncle\n\t\tFredo's gonna teach you how to\n\t\tcatch the big fish.  You know, when\n\t\tI was a kid, I did this amazing\n\t\tthing.  I went out on a fishing\n\t\ttrip; me and my brothers and my\n\t\tPop, and no one could catch a fish\n\t\texcept me.  And this was my secret:\n\t\t\t(confidentially)\n\t\tEvery time I would put the line\n\t\tdown I would say a \"Hail Mary\" and\n\t\tevery time I said a \"Hail Mary\" I\n\t\twould catch a fish.  Now, when it's\n\t\tsunset, we're gonna go out on the\n\t\tlake, and we're gonna try it.\n\nINT. GUARDED HOUSE - DAY\n\nThe guards step aside as Tom Hagen enters the foyer of the\nhouse.  He shows a court order to them and they lead him up\nthe stairs where he knocks on the door.\n\nINT. GUARDED HOUSE - DAY\n\nThere is a KNOCK at the door.  The two guards show Hagen in\nand Hagen presents the court order to one of the FBI men.\n\n\t\t\t\tHAGEN\n\t\tI think I prefer to see my client\n\t\tprivately.\n\n\t\t\t\tPENTANGELI\n\t\tThe room has a bug in it.\n\n\t\t\t\tHAGEN\n\t\t\t(to the FBI men)\n\t\tI'd like to go outside with him, in\n\t\tthe open air.\n\n\t\t\t\tFBI MAN #1\n\t\tThis room is not bugged.\n\n\t\t\t\tHAGEN\n\t\tYou have guards outside and the\n\t\telectric fence.  There's no security\n\t\treason for not letting us talk in\n\t\tthe yard.\n\n\t\t\t\tFBI MAN #1\n\t\tOkay.\n\nThey pass out of the room.\n\nEXT. THE ARMY POST - DAY\n\nHagen and Pentangeli outside, by the electric fence.  They\ncannot be overheard.  Pentangeli takes out some cigars and\noffers Hagen one.  Hagen takes it and Pentangeli lights both\ntheir cigars.  They puff on them contentedly.  They are\ncomfortable together, almost.\n\n\t\t\t\tHAGEN\n\t\tEverything is going to be okay,\n\t\tFrankie, don't worry.\n\n\t\t\t\tPENTANGELI\n\t\tDid my brother go back?\n\n\t\t\t\tHAGEN\n\t\tYeah, but don't worry.\n\n\t\t\t\tPENTANGELI\n\t\tHe's ten times tougher than me, my\n\t\tbrother.  He's old-fashioned.\n\n\t\t\t\tHAGEN\n\t\tYeah.  He wouldn't even go out to\n\t\tdinner.  Just wanted to go home.\n\n\t\t\t\tPENTANGELI\n\t\tThat's my brother.  Nothing could\n\t\tget him away from that two mule\n\t\ttown.  He coulda been big over\n\t\there -- he could of had his own\n\t\tFamily.\n\n\t\t\t\tHAGEN\n\t\tYou're right.\n\n\t\t\t\tPENTANGELI\n\t\tTom, what do I do now?\n\nThe light is beginning to turn reddish as the sun falls.\n\n\t\t\t\tHAGEN\n\t\tFrankie, you were always interested\n\t\tin politics, in history.  I remember\n\t\tyou talking about Hitler back in\n\t\t'43.  We were young then.\n\n\t\t\t\tPENTANGELI\n\t\tYeah, I still read a lot.  They\n\t\tbring me stuff.\n\n\t\t\t\tHAGEN\n\t\tYou were around the old timers who\n\t\tdreamed up how the Families should\n\t\tbe organized, how they based it on\n\t\tthe old Roman Legions, and called\n\t\tthem 'Regimes'... with the 'Capos'\n\t\tand 'Soldiers,' and it worked.\n\n\t\t\t\tPENTANGELI\n\t\tYeah, it worked.  Those were great\n\t\told days.  We was like the Roman\n\t\tEmpire.  The Corleone family was\n\t\tlike the Roman Empire.\n\n\t\t\t\tHAGEN\n\t\t\t(sadly)\n\t\tYeah, it was once.\n\nThey both puff on their cigars.  Pentangeli lets himself be\ncarried away by thoughts of old days of glory; Hagen thinks\nof other days too.\n\n\t\t\t\tHAGEN\n\t\t\t(very gently)\n\t\tThe Roman Empire... when a plot\n\t\tagainst the Emperor failed, the\n\t\tplotters were always given a chance\n\t\tto let their families keep their\n\t\tfortunes.\n\n\t\t\t\tPENTANGELI\n\t\tYeah, but only the rich guys.  The\n\t\tlittle guys got knocked off.  If\n\t\tthey got arrested and executed, all\n\t\ttheir estate went to the Emperor.\n\t\tIf they just went home and killed\n\t\tthemselves, up front, nothing\n\t\thappened.\n\n\t\t\t\tHAGEN\n\t\tYeah, that was a good break.  A\n\t\tnice deal.\n\nPentangeli looks at Hagen; he understands.\n\n\t\t\t\tPENTANGELI\n\t\tThey went home and sat in a hot\n\t\tbath and opened their veins, and\n\t\tbled to death.  Sometimes they gave\n\t\ta little party before they did it.\n\nHagen throws away his cigar.  Pentangeli puffs on his.\n\n\t\t\t\tHAGEN\n\t\tDon't worry about anything, Frankie\n\t\tFive-Angels.\n\n\t\t\t\tPENTANGELI\n\t\tThanks, Tom.  Thanks.\n\nThey shake hands.  The FBI Agents come out to let Hagen out\nthe gate.  Pentangeli is led back to the house.\n\n\t\t\t\tFBI MAN #1\n\t\tYour lawyer tell you he can get\n\t\tthat 600 years reduced to 500?\n\nPentangeli puffs on his cigar and reflects.\n\n\t\t\t\tPENTANGELI\n\t\tYou boys sure you can't get me a\n\t\tbroad for tonight?  Give me a\n\t\tlittle party?\n\n\t\t\t\tFBI MAN #2\n\t\tWe got some nice books.\n\nPentangeli puffs on his cigar and gives the Agent a smile an\nold man gives a child.  He starts upstairs.\n\n\t\t\t\tPENTANGELI\n\t\tI guess I'll just take a hot bath.\n\nEXT. THE ARMY POST - DAY\n\nHagen walks away; glances back.  Then gets into his waiting\ncar and drives off.\n\nINT. THE BOATHOUSE - FULL VIEW - SUNSET\n\nMichael sits alone in the empty boathouse; in the shadows.\n\nINT. BOAT DOCK - SUNSET\n\nNeri stands by the dock area under the boathouse.  He pushes\nthe button which lowers a boat by winch and tackle.  He\nwears a fishing cap.\n\nHe steps into the boat, and pulls the small outboard, which\nglides the boat out into the harbor.\n\nMED. VIEW\n\nThe boat pulls up alongside Fredo and Anthony.\n\n\t\t\t\tFREDO\n\t\tHere we go; and remember the secret.\n\nHe lifts Anthony into the boat.\n\n\t\t\t\tCONNIE (O.S.)\n\t\tAnthony.\n\nTHEIR VIEW\n\nConnie, in houseclothes, is calling Anthony.\n\n\t\t\t\tFREDO\n\t\tHe's here; we're goin' fishing.\n\n\t\t\t\tCONNIE\n\t\tHe can't go; Michael wants to take\n\t\thim into Reno.\n\n\t\t\t\tFREDO\n\t\tAh.  Okay, kid, you got to go to\n\t\tReno with your Pop.\n\nHe lifts the boy out of the boat, and puts him on the shore.\n\n\t\t\t\tFREDO\n\t\tI'll catch one for you, with the\n\t\tsecret.\n\n\t\t\t\tCONNIE\n\t\tHurry, Anthony.\n\nNeri stands the motor; and the boat with the two fisherman\nglides off.\n\nVIEW ON MICHAEL\n\nwatching, from the dark window of the boathouse.\n\nINT. HIGH SECURITY HOUSE IN ARMY POST - NIGHT\n\nThe FBI man knocks on the bathroom door in the house where\nthey have kept Pentangeli.\n\n\t\t\t\tFBI MAN #1\n\t\tFrankie, open up.  You okay?\n\nNo answer; he hammers on the door.  Using his elbow, and\nthen a kick he breaks into the bathroom.\n\nHIS VIEW\n\nPentangeli lying in a tub of water.  His stomach shows above\nit.  His wrists are cut and covered with blood.  The bath\nwater has a purplish tone.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. LAKE TAHOE - MED. VIEW - SUNSET\n\nFredo and Neri are fishing, each with lines out.  The VIEW\nMOVES CLOSER, and we can hear Fredo as he holds the pole.\n\n\t\t\t\tFREDO\n\t\t... the Lord is with thee.  Blessed\n\t\tart thou amongst women, and blessed\n\t\tis the fruit of thy womb, Jesus.\n\nLONG SHOT\n\nThe boat on the shimmery lake.\n\n\t\t\t\tFREDO\n\t\t... Holy Mary, Mother of God, pray\n\t\tfor us...\n\nWe hear a quiet, echoing GUNSHOT; and then silence.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. MIAMI AIRPORT - NIGHT\n\nAn exhausted Hyman Roth, ill-shaven, and in shirt-sleeves in\ntaken into custody by a swarm of Customs, and FBI men.  They\nallow him to be photographed by press people; and television\ncameramen.\n\n\t\t\t\tFBI MAN\n\t\tMr. Roth, we have to take you into\n\t\tcustody.\n\n\t\t\t\tROTH\n\t\tYes, I know.\n\nSome flashbulbs go off.\n\n\t\t\t\tREPORTER\n\t\tCan you give us your reaction to\n\t\tthe High Court of Israel's ruling.\n\n\t\t\t\tROTH\n\t\tI am a retired investor on a\n\t\tpension, and I wished to live there\n\t\tas a Jew  in the twilight of my\n\t\tlife...\n\n\t\t\t\tLAWYER\n\t\tMr. Roth is not a well man; he's\n\t\ttired of running.\n\n\t\t\t\tROTH\n\t\tI'm an old man; at my age, it's too\n\t\tlate to start worrying.\n\n\t\t\t\tREPORTER\n\t\tIs it true you are worth over three\n\t\thundred million dollars, Mr. Roth?\n\n\t\t\t\tROTH\n\t\tI'm a retired investor, living on a\n\t\tpension... I came home to vote in\n\t\tthe Presidential election, because\n\t\tthey wouldn't give me an absentee\n\t\tballot...\n\nThe newsmen and photographers all laugh, as the FBI men move\nhim away.\n\nCLOSE VIEW\n\nOne of the newspapermen laughing we recognize to be Rocco\nLampone.\n\nHe moves closer to Roth, and shoves his revolver right\nagainst his head, and in a second, on camera, assassinates\nRoth.  People scream, as Rocco attempts to run down the\nairport corridor, limping as he does.\n\nFBI men easily pick him off.\n\n\t\t\t\t\t\t\tFADE OUT.\n\nEXT. THE DRIVEWAY BY MICHAEL'S HOUSE - DAY\n\nA taxi cab waits by the house; its driver sleeping with a\nnewspaper over his face.\n\nINT. MICHAEL'S HOUSE - DAY\n\nThe cleaning woman, Esther, who had been with Kay for years,\nsits by the dining room table, weeping profusely.  Behind\nher, in the recreation room, we can see the tableau of Kay\nsitting on the couch, her little daughter Mary, between her\nknees, talking quietly about things we cannot hear.  Her son\nAnthony sits by himself, in another chair by the side of the\nroom.\n\nMED. VIEW\n\nConnie comes into the house quickly, and moves toward them.\n\n\t\t\t\tCONNIE\n\t\tKay, you have to go.\n\nThis prompts Esther to weep all the more.  Kay hugs her\ndaughter, and kisses her many times.\n\n\t\t\t\tCONNIE\n\t\tYou have to hurry; he's coming.\n\nKay puts her coat on; then stands, and reaches out for her\nson.\n\n\t\t\t\tKAY\n\t\tAnthony, kiss Mama goodbye.\n\nHe doesn't move.\n\n\t\t\t\tCONNIE\n\t\t\t(angrily)\n\t\tAnthony, you kiss your Mother\n\t\tgoodbye!\n\nHe rises, and walks to her.  Hugs her lifelessly.\n\nMED. CLOSE VIEW\n\non Kay, kissing her boy.\n\n\t\t\t\tKAY\n\t\tAnthony, say goodbye; your Mama\n\t\tloves you.\n\n\t\t\t\tANTHONY\n\t\tGoodbye.\n\nShe restrains any tears; she has become too strong for tears.\nKay starts to go; picks up Mary, kisses her, and starts to go.\n\nNEW VIEW\n\nShe steps out the kitchen door; then she cannot help herself.\nCrouches down, outside, and calls to her son.\n\n\t\t\t\tKAY\n\t\tAnthony, kiss me once.\n\nThen she looks up, and slowly rises.\n\nHER VIEW\n\nMichael has stepped into the dining room.  He seems older\nsomehow; as though some sickness has taken more years away\nfrom him.\n\nVIEW ON KAY\n\nlooks at him; instinctively, she takes a step back.\n\nVIEW ON MICHAEL\n\nslowly steps toward her.\n\nVIEW ON KAY\n\nAnother step back; the door is still open.\n\nVIEW ON MICHAEL\n\nHe moves closer to the door; stops, looks at her.  And then\ncloses it obscuring any view of her.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. TAHOE ESTATE - DAY\n\nIt is late fall -- most of the leaves have fallen on the\ngrounds and there is quite a wind.\n\nMED. VIEW\n\nThe water is whipped up by the wind, and the waves are high\nas they break against the pavilion.  We HEAR the MUSIC of\ntime passing, of Michael, of the Godfather over these images.\n\nVIEW ON THE SWIMMING POOLS\n\nThey have not been used in several months; they are drained\nand the bottoms are mossy and dark.\n\nVIEW ON THE MAIN GATE\n\nLeaves blowing past it; we don't see the button men; only a\nhint of someone in the gatehouse.\n\nVIEW ON THE HOUSES\n\nSome of the houses have had the summer awnings taken down,\nand put away.  Some of the windows have been boarded up.\n\nVIEW ON THE KENNELS\n\nThere are still the guard dogs; some sleeping, some moving\nimpatiently.\n\nAs the MUSIC concludes its statement.\n\nMED. VIEW\n\nThe peninsula of the private Corleone Harbor.  We see the\nfigures of two people, seated at a table.\n\nMED. VIEW\n\nMichael sits at a table having a sparse lunch.  He is\nattended by his sister Connie, who seems to be the closest\nperson now living on the estate with him.  We see from the\nway she pampers him with his lunch, that she has fallen into\nthe role of a surrogate Mother-Wife.  He seems older than\nhis years, as though his illness, diabetes, has taken its\ntoll.\n\n\t\t\t\tCONNIE\n\t\tDon't worry; I'm sure he got here\n\t\ton time.  The roads from the\n\t\tairport are so windy, it takes\n\t\tforever; I've driven them myself.\n\nShe picks up some of the serving plates that he has left\nuntouched.\n\n\t\t\t\tCONNIE\n\t\tI'll bring him out to you as soon\n\t\tas he comes.\n\nShe moves back to the main house.\n\nMED. CLOSE VIEW ON MICHAEL\n\nHe turns and looks at the rough water of the lake for a\nmoment.  He slowly takes a sip of wine.\n\nEXT. A PLACE IN THE GARDEN - DAY\n\nThere are a few chairs.\n\nMED. VIEW ON ANTHONY CORLEONE\n\nHe is eighteen years old.\n\n\t\t\t\tANTHONY\n\t\tHello, Dad.\n\nVIEW ON MICHAEL\n\nsquinting up at his son.\n\n\t\t\t\tMICHAEL\n\t\tAnthony.\n\nHe rises, and reaches up to his son, who is now taller than\nhe; he embraces him.\n\n\t\t\t\tMICHAEL\n\t\tYou've grown so tall... so tall in\n\t\tthe last year.  You're much taller\n\t\tthan me.\n\n\t\t\t\tANTHONY\n\t\tI was taller than you when I was\n\t\tfourteen.\n\n\t\t\t\tMICHAEL\n\t\tSit down.  Your Aunt Connie and I\n\t\twaited for you to have some lunch,\n\t\tbut now it's all dried out.\n\n\t\t\t\tANTHONY\n\t\tI'm not hungry.\n\n\t\t\t\tMICHAEL\n\t\tWell, that's alright... alright.\n\t\tGood.  You'll graduate in another\n\t\tyear, isn't that right?  You know...\n\t\tI never finished college.  I was a\n\t\tgood student, but I never finished.\n\t\tOf course, there was a war then.\n\nConnie approaches them.\n\n\t\t\t\tCONNIE\n\t\tDon't let me interrupt anything,\n\t\tthis will just take a second.  Here.\n\t\t\t(she takes out a\n\t\t\tsmall needle, and\n\t\t\tbegins to prepare it)\n\t\tYour father has to have his insulin\n\t\tshot.  Why don't you go to your\n\t\troom and put your things away,\n\t\tAnthony.\n\nShe begins to give Michael the shot.\n\n\t\t\t\tMICHAEL\n\t\tHurry back; we'll talk.  We'll talk.\n\nAnthony goes on his way to the house with his things.\nConnie gives Michael the shot.\n\n\t\t\t\tCONNIE\n\t\tWhenever I see that lake so cold, I\n\t\tthink of poor Fredo, drowned.  Lake\n\t\tTahoe is very cold.  They say if a\n\t\tperson drowns in it, that the body\n\t\twill remain mid-suspended --\n\t\tperfectly preserved.  Some say it\n\t\twill remain forever.\n\nShe finishes the shot, puts her things away.\n\n\t\t\t\tCONNIE\n\t\tYour boy will be right back.\n\nShe leaves.\n\nVIEW ON MICHAEL\n\nAlone in the garden.\n\nOUR VIEW begins to MOVE CLOSER to him.  We begin to HEAR\nMUSIC of the forties; happy music, swing music, as we move\nCLOSER to Michael.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. OLD CORLEONE HOUSE - MED. VIEW - NIGHT\n\nSONNY CORLEONE, his arm wrapped around a smiling red-faced\nCarlo Rizzi, pulls him into the Corleone dining room.\n\n\t\t\t\tSONNY\n\t\tHey, who knows my buddy Carlo Rizzi.\n\t\tHere... my brother Fredo, here's my\n\t\tMom.  Mom, whatcha got cooking?\n\t\tAnd Carlo, this is my kid sister\n\t\tConnie.  Here, pull up a chair,\n\t\tCarol is sitting next to Connie.\n\t\tOh, the droopy kid over there is\n\t\tMike.  The college boy.\n\nAn older, lanky man enters the room, his arms laden with\npresents.  This is TESSIO.\n\n\t\t\t\tTESSIO\n\t\tBuon Natale, everybody.  Buon\n\t\tNatale...\n\t\t\t(he smiles at Tom Hagen)\n\t\tHi, Tom, how's every little thing?\n\n\t\t\t\tHAGEN\n\t\t\t(helping him with the presents)\n\t\tWonderful, Sal.\n\nNow the study door opens, and DON CORLEONE enters.\n\n\t\t\t\tDON CORLEONE\n\t\tIs dinner ready?\n\n\t\t\t\tMOM\n\t\tTwo minutes.\n\nThe Don happily regards his family; his sons and daughters\nand even some Grandchildren.  He raises a glass.\n\n\t\t\t\tDON CORLEONE\n\t\tA good life, a long life to all my\n\t\tchildren, and friends.  To my\n\t\tgrandchildren, and those that will\n\t\tbe.  To our family.\n\nThey all drink.\n\nThey refill glasses; then Tessio proposes a toast.\n\n\t\t\t\tTESSIO\n\t\tTo our Godfather.\n\nThey all drink.\n\nINT. THE DINING ROOM - MED. VIEW - NIGHT\n\nThe family is happily at Christmas dinner.  Don Corleone\nseated at the head of the table.\n\n\t\t\t\tSONNY\n\t\tWhat'd you think of those Japs, eh?\n\t\tThe nerve of those Japs, coming\n\t\tright here in our own backyard\n\t\tdropping bombs!\n\n\t\t\t\tHAGEN\n\t\tWell, we could have expected it\n\t\tafter the embargo.\n\n\t\t\t\tSONNY\n\t\tHey!  Expect it or not, those Japs\n\t\tdon't have a right to drop bombs in\n\t\tour backyard.  Whose side you on?\n\n\t\t\t\tMAMA\n\t\tPlease, do we have to talk about\n\t\tthe war at the table?  On Christmas,\n\t\tmuch less.\n\nVIEW ON MICHAEL\n\nHe has been listening to this discussion.\n\n\t\t\t\tMICHAEL\n\t\tPop, I've decided I'm going to\n\t\tenlist.\n\nA quiet hush descends over the table, as though everyone\nknows the effect this will have on the old man.  Sonny tries\nto make light of it.\n\n\t\t\t\tSONNY\n\t\tKid, stay in college.  The girls\n\t\tare cuter, if you know what I mean.\n\n\t\t\t\tHAGEN\n\t\tPop had to pull a lot of strings to\n\t\tget you your deferment.\n\n\t\t\t\tMICHAEL\n\t\tI never asked for it; I don't want\n\t\tit.\n\nVIEW ON DON CORLEONE\n\nDisturbed; but wise and prudent.\n\n\t\t\t\tDON CORLEONE\n\t\tMy son wants to talk about this,\n\t\tand so we'll talk, but not at the\n\t\tdinner table.\n\nHe rises, and starts across the room toward his study.  Then\nhe looks back.\n\n\t\t\t\tDON CORLEONE\n\t\tMichael.\n\nHe disappears into his study.  Michael rises, glances around.\nPeople are generally tense over the situation.  Michael\nfollows his father into the study.\n\nINT. DON CORLEONE'S OLD STUDY - NIGHT\n\nThe Don closes the door behind his son, and then moves\nacross the room.  He stops at the little bar there, and\npours himself a brandy.\n\n\t\t\t\tDON CORLEONE\n\t\tWould you like some?\n\n\t\t\t\tMICHAEL\n\t\tNo, Dad.\n\n\t\t\t\tDON CORLEONE\n\t\tNow what is this talk about joining\n\t\tthe army?  Eh?\n\n\t\t\t\tMICHAEL\n\t\tIt's not talk; I'm doing it.\n\n\t\t\t\tDON CORLEONE\n\t\tYou would risk your life for\n\t\tstrangers?\n\n\t\t\t\tMICHAEL\n\t\tNot for strangers; for my country.\n\n\t\t\t\tDON CORLEONE\n\t\tAnyone not in your family, is a\n\t\tstranger.  Believe me, when trouble\n\t\tcomes, your country won't take care\n\t\tof you.\n\n\t\t\t\tMICHAEL\n\t\tThat's how it was in the old world,\n\t\tPop, but this is not Sicily.\n\n\t\t\t\tDON CORLEONE\n\t\tI know.  I know, Michael.  It's\n\t\tChristmas, your brothers and sister\n\t\tare all here -- we are happy.\n\t\tLet's not spoil this.  Go your own\n\t\tway, but when you are ready, come\n\t\tto me the way a son should.  I have\n\t\thopes for you...\n\nCLOSE VIEW ON MICHAEL\n\nlooking at his father with a mixture of great love, and also\nfear, and confusion.\n\n\t\t\t\tMICHAEL\n\t\tI won't be a man like you.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. THE TAHOE ESTATE - HIGH FULL VIEW - DAY\n\nThe leaves are blowing.  MUSIC comes up.\n\nMichael and his young son, Anthony, walk through the grounds\nof the estate, talking about things we cannot hear.\n\n \n\n\n\n\nGodfather Part II\nWriters :   Mario Puzo  Francis Ford Coppola\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:03.435723"}