{"title": "Gothika", "film_link": "/Movie Scripts/Gothika Script.html", "script_link": "/scripts/Gothika.html", "info_raw": "\n\nGothika Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.40 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Sebastian Gutierrez\nGenres  Horror  Thriller  Mystery\nScript Date : December 2002\nMovie Release Date : November 2003\n\nRead \"Gothika\" Script\n\n\n", "script": "\n\n\n\n                             Gothika\n                               by\n                       Sebastian Gutierrez\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       REVISED SECOND DRAFT\n\n                       December 8, 2002\n\n\n\nThe Woodward Forensic Institute (WFI) is a 175-bed Intermediate\nSecurity treatment facility for male and female psychiatric\npatients. Its primary clientele are those who have histories\nof committing criminal offenses and are either committed to the\nDepartment of Mental Health by the Circuit Courts of the State\nor who are admitted under authority of an appointed guardian.\n\n\n\n\nFADE IN:\n\n\n\n\n\n\n\n\nOPENING CREDITS OVER QUICK CUTS:\n\n\nINT. MIRANDA AND DOUG'S BEDROOM - DAWN\n\n\n\n\nPUSH in on a sleeping couple in the dark. The ALARM\nCLOCK reads 5:59 AM. The woman's eyes open a second\nbefore the alarm beeps and turns it off. She grabs a\nglass of water on her bedside table and drinks it.\nClimbs out of bed past typical bedside photographs\n(wedding, vacation, etc.). This is MIRANDA GREY: 30,\nsharp and prettier than she knows.\n\n\n\n\nINT. GYM SWIMMING POOL - MORNING\n\nMiranda slides through the water. Swimming cap on,\ngoggles. Her STEADY BREATHING takes us in and out of the\nwater. Something unsettling about this sound. Something\nslightly unsettling too about her detached manner. A\nperson on autopilot, recognizing only the water and the\nperfectly aligned lap stripes leading her path. Like\ngraphic metaphors for her own conscience: flat. She\nemerges from the pool and self-consciously wraps herself\nin a towel.\n\n\n\n\nINT. COFFEEHOUSE - MORNING\n\nMiranda pays for a pair of coffees and a newspaper.\n\n\n\n\nINT. KITCHEN - MORNING\n\nMiranda's husband DOUGLAS GREY (older, a superficial\nanalysis would suggest a father figure) serves breakfast.\nMiranda smiles thank you and goes back to studying a case\nfile. He sips from his takeout coffee and reads the\nnewspaper. A pleasant domestic scene. It's 8:00 AM.\n\n\n\n\nEXT. ST. ANNE'S HIGH SCHOOL PARKING LOT - MORNING\n\nMiranda's Volvo pulls in as students amble up the steps.\nDoug kisses his wife and hops out. Exemplary carpoolers.\nStudents are already chatting him up as Miranda drives\noff.\n\n\n\n\nEXT. WOODWARD INSTITUTE - ON A SURVEILLANCE MONITOR\n\nMiranda's car at some sort of guard gate. A BUZZER lets\nher in. As the car drives past we read the plate on the\nwall:\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                         2.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n\"WOODWARD FORENSIC INSTITUTE\"\n\nThe gate shuts behind her with a certain finality as\nwe...\n\n\n\n\n\n\n\nINT. WOODWARD INSTITUTE - MIRANDA'S OFFICE - EVENING\n\nStark walls. Simple decor. Bookshelves packed with the\naccording psychiatric tomes and diplomas. Miranda faces\na troubled young mess of a woman, CHLOE: charismatic,\nderanged and forever trying to provoke. Mid-session:\n\n                           MIRANDA\n\n             This is your stepfather who came\n             to visit you?\n\n                           CHLOE\n\n             My stepfather?  No.   He's dead.\n                     (beat)\n             I killed him.\nMiranda tries not to act surprised at this breakthrough.\nResponds with the even keel of a trained psychiatrist.\n\n                           MIRANDA\n\n             That's the first time you admit\n             it.\n\n                          CHLOE\n\n             So? There's a first time for\n             everything.\n\n                           MIRANDA\n\n                     (jotting this down)\n             It means you're finally past the\n             denial stage. This is good,\n             Chloe.\n\n                           CHLOE\n\n             I never killed anyone who didn't\n             deserve it.\n\n                            MIRANDA\n\n             You only killed your stepfather as\n             far as I know.\n\n                           CHLOE\n\n             I should've taken care of my\n             mother. She knew all along.    You\n             remind me of her.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        3.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             I remind you of your mother?\n\n                           CHLOE\n\n             Always so put together. Like you\n             iron your underwear. Like your\n             pussy is the apricot of the\n             Promised Land and the bread of\n             the --\n\n                           MIRANDA\n\n                     (getting her back\n                     on track)\n             Let's get back to your visitor\n             last night.\n\n                           CHLOE\n\n             The Devil.\n\n                           MIRANDA\n\n             Alright, the Devil. Why would the\n             Devil visit you? It's already\n             hell in here, what would he have\n             to gain?\n\n                           CHLOE\n\n             He came to fuck an angel.\n                     (giggles at that)\n             I'm his dirty angel.\nBefore Miranda can analyze that one, the room LIGHTS FLICKER\nAND DIE. Darkness. Miranda's breathing speeds up.\n\n                           CHLOE\n\n             He grabbed me by the hair while I\n             sucked him and usually I love\n             that, I just do -- maybe you can\n             tell me why I love it so much --\n             but not this time, he was just too\n             rough --\nAs suddenly as it went out, now the POWER RETURNS.      A\nvisibly uncomfortable Miranda checks the clock.\n\n                           MIRANDA\n\n             That's it until Monday. Try and\n             get some sleep tonight, okay?\n\n                           CHLOE\n\n             Sure, Doctor.\n                     (leans in)\n             Crazy people hear messages from\n             God. Not the Devil. You know\n             that, right?\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                       4.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             I didn't say you were crazy.\n\n                           CHLOE\n\n             You don't have to say it.\nShe almost doesn't seem crazy when she says this.\nAlmost. TWO ORDERLIES appear at the door. Miranda nods\nfor them to escort Chloe. Chloe shakes their hands away\nfrom her, strides off dramatically. The princess of the\nasylum.\n\n\n\n\nINT. WOODWARD CORRIDOR - LATER\n\nMiranda locks her office, armed with paperwork. The end\nof another workweek. DR. PETE GRAHAM, a good ten years\nolder and Miranda's best friend on the job, approaches.\n\n                           PETE\n\n             Dr. Grey.\n\n                           MIRANDA\n\n             Dr. Graham.\nThey walk along with the easy confidence of colleagues\nwho not only respect each other, but enjoy each other.      A\nlot.\n\n                           PETE\n\n             Power went out again in our wing.\n\n                           MIRANDA\n\n                     (knows what's coming)\n             Same here.\n\n                           PETE\n\n             It's not shrink-appropriate to be\n             afraid of the dark, you know?\n\n                           MIRANDA\n\n             You're not shrink appropriate and\n             you're about to get promoted.\n             Everybody's afraid of something.\n\n                           PETE\n\n             What am I afraid of?\n\n                           MIRANDA\n\n             Yourself. At least you should be.\n             What are you up to this weekend?\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         5.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             Write a little country music,\n             decline invites to grand social\n             events, drink myself to sleep --\n             the usual. You?\n\n                           MIRANDA\n\n             Doug wants to look at some Real\n             Estate up at Willow's Creek.\n\n                           PETE\n\n             Again?\n\n                           MIRANDA\n\n             He thinks it's fun.\n\n                           PETE\n\n             So is golfing, I'm told.   Who was\n             your six o'clock?\n\n                           MIRANDA\n\n             Chloe McGrath -- talk about trying\n             to empty the ocean with a tea cup.\n             She's a mess.\n\n                           PETE\n\n             I hear Manhattan's full of them.\n\n                           MIRANDA\n\n             Don't start with that. I already\n             turned down the job. We're\n             staying.\n\n                           PETE\n\n             Good girl.\nThey have reached an office marked \"DR. PHILLIP PARSONS\nDIRECTOR\" and peer in to see Parsons (50's,\ndistinguished, commands respect from everyone) on the\nphone. He gestures for Pete to sit. Miranda is about to\nexit when he covers the mouthpiece --\n\n                           PARSONS\n\n             Miranda, my wife keeps wanting to\n             set that dinner with you and Doug.\n             Are you free tonight?\n\n                           MIRANDA\n\n             He's stuck at a school board\n             meeting.\nParsons looks through his appointment book.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         6.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PARSONS\n\n             You've been here a year already,\n             Dorothy's starting to take this\n             personal. How's next Wednesday?\n\n\n\n\n                           MIRANDA\n\n             Next Wednesday it is, Phil.\nHe nods at her with a smile and returns to his phone\ncall.\n\n\n\n\nEXT. WOODWARD INSTITUTE - NIGHT\n\nMiranda drives off, leaving the majestic grounds behind.\nA GUARD waves her off.\n\n\n\n\nEND OPENING CREDITS.\n\n\n\n\n\nEXT. ROAD - NIGHT\n\nMiranda slows down at the sight of colored lights up\nahead. A knocked-down telephone post blocks the road.\nEMERGENCY VEHICLES at the scene. A patrolman waves her\ndown.\n\n\n\n\nINT. MIRANDA'S CAR - MOVING - NIGHT\n\nSHERIFF RYAN, 40'S, recognizes her and ambles over.\n\n                           MIRANDA\n\n             Anybody hurt, Sheriff?\n\n                            SHERIFF RYAN\n\n             Nah, telephone post just decided\n             to fall. It'll take us a while to\n             clear this up so I'm afraid you're\n             gonna have to take the long way\n             home, Miranda.\n\n                           MIRANDA\n\n             If you say so.\n\n                           SHERIFF RYAN\n\n             And tell your husband he owes me a\n             phone call.\n\n                           MIRANDA\n\n             Will do. Wouldn't want him in\n             trouble with the authorities.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                           7.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHERIFF RYAN\n\n             That a girl. The law never sleeps\n             and all that. You take care now.\n\n\n\nHe taps on her hood and heads back to the site.      She\nshifts into reverse and makes a U-turn.\n\n\n\n\nEXT. OLD MAIN ROAD - NIGHT\n\nMiranda drives down the curvy road toward an old bridge.\nSomething definitely creepy about this deserted place --\n\n\n\n\n\n\n\nINT. MIRANDA'S CAR - MOVING\n\nMiranda dials a number on her cell phone, gets the\nmachine.\n\n                           MIRANDA\n\n                     (into phone)\n             Hi, it's me. Are you there? Pick\n             up, pick up. I'm on my way but I\n             just got detoured so I'm...\nA bump on the road makes her drop the phone on the\npassenger seat. She reaches for it and when she looks up\nwe see:\n\n\n\n\nPOV THROUGH THE WINDSHIELD\n\nA TEENAGE GIRL stands smack in front of us.      Naked.\nAbout to get pummelled by us.\n\n\n\n\nBACK TO SCENE\n\nMiranda swerves to avoid her and slams into the railing.\nMETAL SCREECHES as she struggles to regain control of the\ncar and finally BRAKES TO A HALT --\nShe looks in her rearview mirror: the girl is standing\nback there. Drunk or high or in any case completely out\nof it.\n\n                           MIRANDA\n\n                     (into phone)\n             Stay on the line. Don't go\n             anywhere. The weirdest thing\n             just --\n                     (the phone cuts out)\n             Hello? Hello?\n\n                                             (CONTINUED)\n\n\n\n\n\n                                                          8.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nShe stares at the dead phone.      Punches the buttons on it.\nNo go.\n\n                           MIRANDA\n\n             Wonderful.\nShe tosses the phone on the seat and hops out of the car.\n\n\n\n\nEXT. ASHLEY BRIDGE - NIGHT\n\nMiranda cautiously approaches the girl, who is now not\nmoving. Just standing there. Her back to us.\n\n                            MIRANDA\n\n             Hello?   Are you hurt?   Hello?\nNothing.     As we get closer we see she is covered in\nbruises.     Clearly something horrible has happened to her.\n\n                            MIRANDA\n\n             Were you in an accident? Were you\n             attacked? It's okay, I'm a doctor.\n                     (beat)\n             My name is Miranda Grey...\nAnd now she turns. Young, seventeen tops. Busted lip,\nblack eye. Miranda pulls off her coat, wraps it around\nthe girl --\n\n                           MIRANDA\n\n             You're in shock right now, that's\n             perfectly natural. I'm going to\n             get you to the hospital. Okay?\nThe girl suddenly grips Miranda's arm.         Hard.\n\n                           MIRANDA\n\n             Don't be scared. It's going to be\n             fine.\nNow the girl is touching Miranda's face. Her movements\ndesperate, smothering. Like the movements of a drowning\nperson. Miranda tries to push the girl's hands back down.\n\n                           MIRANDA\n\n             Hands off me, okay? Tell me your\n             name, do you remember your name?\nThe girl tries to speak but no words come out. Instead\nshe produces a strained, wettish sound. Creepy as hell.\nAnd now she is prying Miranda's mouth open and she's much\nstronger than expected and Miranda is panicking --\n\n                                                 (CONTINUED)\n\n\n\n\n\n                                                              9.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             What are you doing? I'm trying to\n             help you --?!\n\n\n\nThe girl opens her own mouth wide like a snake. And as\nMiranda muffles a scream, blood starts leaking out of the\ngirl's eye sockets and from wounds all over her body.\n\n                                            SLAM CUT TO:\n\n\n\n\n\nINT. BEDROOM - DAWN\n\nMiranda wakes up in a cold sweat.         Just a bad dream.    A\nbeat.\nFAINT at first but GROWING LOUDER, we hear a REPETITIVE\nSOUND outside. Like an ECHO of some sort, but vaguely\nfamiliar: THWIP, THWIP, THWIP.\nMiranda takes a deep breath, reaches for the glass of\nwater on her bedside table. Except... it's not there.\nShe turns to her husband but he's not in the bed. And\nnow she glances around the room and realizes this is not\nher bedroom.\nShe climbs off the bed and walks in the dark. Trips over\nsomething. A TRAY that CLANGS LOUDLY. Her heartbeat\ngoes haywire. She feels her way along the wall to a\nsmall opening in the door. A glass pane.\nShe peers through the glass at the empty corridor\noutside, realizing what this must mean, realizing she's\ninside a cell.\nShe jiggles the handle and pounds on the door, frantic --\n\n                            MIRANDA\n\n             Hello?   Somebody help me!\n\n\n\n\n\n\n\nEXT. WOODWARD INSTITUTE - ESTABLISHING - DAY\n\nCAMERA SOARS through the tall iron gates, past the guard.\nNow we spot the source of our continuing THWIP THWIP\nsound: sprinklers watering the impressively-kept gardens.\nThe expansive complex is more Victorian campus than drab\nprison, with separate wings (male and female), research\nunits, libraries, gym and volunteer outpatient center.\n\n\n\n\n                                                    10.\n\n\n\n\n\nINT. WOODWARD INSTITUTE - VARIOUS SHOTS\n\n\n\n\nA bored group of female patients listen to a social\nworker lecturing them. A janitor mops a long corridor.\nPatients study at the library under the watchful eye of\norderlies.\n\n\n\nA doctor and two orderlies hold down a patient having an\nepileptic fit (we'll soon know her as SHELLEY). They\nforce a biting block in her mouth to avoid her swallowing\nher tongue, prepare a syringe.\nInstitute director Phil Parsons at a meeting with other\ndoctors, discussing a patient's progress on a chart.\nNow we are MOVING up the main building's wall and THROUGH\nlarge windows into --\n\n\n\n\nINT. FEMALE WING STAIRS\n\nPete rushes up two steps at a time, passing by a NURSE\nWITH A CART OF MEDS, who nods respectfully as he goes --\n\n\n\n\n\n\n\nINT. HALLWAY OUTSIDE MIRANDA'S CELL\n\nAn ORDERLY unlocks the door for Pete. Through the glass\npane he can see a visibly upset Miranda arguing with the\nhead nurse: a tough as nails woman in her 50's: IRENE.\n\n                        ORDERLY #1\n\n          Sleeping beauty is awake.\nPeter forces a smile, enters --\n\n\n\n\nINT. MIRANDA'S CELL\n\n\n                        MIRANDA\n\n          Peter, what the hell is going on?\nPete nods at Irene: it's okay, he'll take it from here.\n\n                        PETE\n\n          How do you feel?\n\n                        MIRANDA\n\n          How do you think I feel?    Is this\n          a joke?\nPeter is half-listening to her, half-signaling to the\nnurse with the meds to come in. Miranda catches all of\nthis, growing more agitated. She wears the uniform all\npatients wear: a white T-shirt and sweats. Her wedding\nring is gone.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                         11.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             What are you doing?\n\n                           PETE\n\n             Giving you something to calm down.\n\n                           MIRANDA\n\n             I don't need to calm down.   What I\n             need is an explanation\nPete grabs the meds from the nurse. Irene and the\nattendant step closer to help. Miranda feels them\nclosing in on her. Peter's tone is infuriatingly gentle:\n\n                           PETE\n\n             Just take this and we can sit down\n             and chat.\n\n                           MIRANDA\n\n             Why here, why not in my office?\nShe looks at the silent faces around her. No sympathy.\nOr maybe too much sympathy. Either way it's unnerving.\n\n                           MIRANDA\n\n             I don't want an anticonvulsant, at\n             least give me Valium.\n\n                           PETE\n\n                     (nods at nurse)\n             Fifty milligrams.\n\n                           MIRANDA\n\n             Jesus Christ, you're gonna knock\n             me out? Ten milligrams.\n\n                             PETE\n\n                       (final offer)\n             Twenty.\nThe nurse complies. Miranda stares at the meds, trying\ndesperately to put this into some kind of perspective.\n\n                           MIRANDA\n\n             How would you feel if you woke up\n             in a goddamn cell, dressed like this?\n\n                           PETE\n\n             We can discuss it at length after\n             you take your meds.\nAwkward nods from Irene, the nurse and the attendant.\nPete holds Miranda's gaze. Miranda takes her meds.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                           12.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                             MIRANDA\n\n             Okay.    This better be good.\nPete motions for the others to leave them alone.         One by\none they file out and lock the door behind them.\n\n\n\n\nINT. MIRANDA'S CELL - LATER\n\nMiranda paces.       Alone with Pete, she is even more upset.\n\n                           PETE\n\n             Miranda, this is very awkward.\n             Technically I shouldn't even be\n             treating you but the court has\n             granted us a waiver until you're\n             transferred. So whatever is said\n             here won't leave this room. I\n             won't tell Parsons, I won't tell\n             anyone.\n\n                           MIRANDA\n\n             I want to talk to my husband.\n\n                           PETE\n\n             You can't to that. Sit down,\n             please. Try to relax.\n\n                           MIRANDA\n\n             Why would I pretend to be in any\n             way relaxed?\n\n                           PETE\n\n             I understand you're upset. But we\n             need to put some things in order.\n\n                           MIRANDA\n\n             Two massive understatements.\nHe hesitates, unsure where to begin.\n\n                           PETE\n\n             How long have you been here?\n\n                           MIRANDA\n\n                     (laughs)\n             What is this? Why are you doing\n             this to me?\n\n                           PETE\n\n             Just answer the question.    Humor\n             me.\n\n                                                  (CONTINUED)\n\n\n\n\n\n                                                      13.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Hi, my name is Miranda Grey. I'm a\n             psychiatrist. I transferred here to\n             the Woodward Forensic Institute a\n             little over a year ago. My job\n             entails dealing with a ward of\n             schizophrenic women between the\n             ages of eighteen and fifty-fife --\n\n                           PETE\n\n             I don't mean how long you've\n             worked here, I mean how long\n             you've been staying here.\nThis stops her. Wanting desperately to whip out a\ncomeback but realizing she doesn't know the answer.\n\n                           MIRANDA\n\n             I'm a doctor, yes? Or was medical\n             school just an elaborate dream?\n\n                           PETE\n\n             Of course you're a doctor. A\n             great doctor in fact.\nThe hint of sadness in his voice alarms her.\n\n                           MIRANDA\n\n             Pete, how long have I been here?\n\n                          PETE\n\n             Five days.\n\n                           MIRANDA\n\n                     (barely audible)\n             What?\n\n                           PETE\n\n             You were admitted to the\n             neurosurgical unit seizing\n             violently. That lasted three\n             days. Scans revealed left-sided\n             weakness, numbness and severe\n             fontal lobe deficits.\nMiranda shakes her head in disbelief, but we --\n\n\n\n\nFLASHBACK - INT. NEUROSURGICAL UNIT\n\nMiranda seizing violently FROM HER POV: Doctors\nstruggling to contain her. Arms thrashing, legs.\nFLASHES of the wall, the floor. Head crashing against a\ncart, out of control.\n\n                                          (CONTINUED)\n\n\n\n\n\n                                                       14.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE (V.O.)\n\n             You came out of it and tested\n             negative for PCP, underwent\n             extensive hypnosis and received\n             amytal injections.\nFLASH: Miranda being tied down.      A nurse with a\nsyringe --\n\n\n\n\nINT. MIRANDA'S CELL - CONTINUOUS ACTION (PRESENT)\n\nShe looks down at her wrists with the reddish marks.\n\n                            PETE\n\n             You were tied down for a day and a\n             half so you wouldn't hurt yourself\n             and then you went into a state of,\n             well --\n                     (how to put this?)\n             You've been pretty much catatonic.\n                     (beat)\n             This is the first time you speak.\nMiranda, speechless.     Reality sinking in.\n\n                            MIRANDA\n\n             Doug must be worried sick.   I need\n             to call him --\nPete shakes his head emphatically.\n\n                           PETE\n\n             You're the most logical person I\n             know, bar none. Plus you have a\n             photographic memory -- unconfirmed,\n             but you do remember events and\n             phrases more accurately than anyone\n             around. Why am I telling you this?\n\n                           MIRANDA\n\n             You're establishing my personality\n             as fairly intellectual, you don't\n             consider me impulsive or emotional.\n\n                           PETE\n\n             And that's a fair assessment, no?\n\n                           MIRANDA\n\n             Yes, that's fair. And following\n             this pattern of analysis, we're\n             about to discuss a traumatic event\n             that rendered this psychological\n             profile useless, correct?\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                       15.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             Two hundred percent.\nA pause here. He's waiting for her to continue. She's\nnot used to being on the other side of the therapist's\ntable.\n\n                           MIRANDA\n\n             You think I'm in denial. That I'm\n             putting on a brave show -- that\n             this is a 'cover' for some\n             unbearable emotion I'm hiding.\n             Why?\n\n                           PETE\n\n             Don't analyze yourself, just focus\n             on remembering.\n\n                           MIRANDA\n\n             I remember Friday night after\n             work, if you say that was five\n             days ago --\n                     (pushing on)\n             Anyway, I asked you what you were\n             doing for the weekend and you said\n             the usual and you made a joke\n             about writing country songs and\n             drinking yourself to sleep and I\n             told you I was going to look at\n             some real estate in Willows Creek\n             with Doug.\n\n                           PETE\n\n             And then what?\n\n                           MIRANDA\n\n             Then I drove home.\n\n                           PETE\n\n             And then what?\n\n                           MIRANDA\n\n             I got home, I guess, and had\n             dinner by myself because --\n                     (pauses, struggling)\n             Because Doug had an alumni meeting\n             at his school and he was going to\n             get a ride back. He's the\n             principal now, as you well know.\nShe stops here. Pete waits. The silence is deafening.\nShe pushes on, but her hands shake a little.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                          16.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             But wait -- there was an accident\n             before that, wasn't there? A girl\n             -- she had been beaten. I took\n             her to the hospital, right?\n\n                           PETE\n\n             There was indeed an accident, you\n             were detoured by the cops. But\n             there's no report of any girl.\n\n                           MIRANDA\n\n             No, the cops weren't there. They\n             were back on Main Road. A\n             knocked-down telephone post,\n             correct?\nPete nods.     Miranda is all foggy on the details:\n\n                           MIRANDA\n\n             I saw the girl after that.   She\n             was bleeding.\n\n\n\n\nFLASHBACK - ANTIQUE WIND CHIMES\n\nsway in the night breeze with their gentle tinkling\nSOUND, more menacing than joyful --\n\n                                          FLASH CUT TO:\n\n\n\n\n\n\n\n\nINT. MIRANDA AND DOUG'S HOUSE - NIGHT\n\nA breathless Miranda wipes her face, leaving a thick\nstreak of blood on it.\n\n                                          FLASH CUT TO:\n\n\n\n\n\nEXTREME CLOSEUP - MIRANDA'S EYE\n\nJittery, alert. We scour her every blood vessel, iris,\npupil. FILLING the SCREEN and now we distinctly make out\nan eerie shape reflected inside of it. But just for a\nsec --\nThe teenage girl.\n\n                           PETE (V.O.)\n\n             What about your husband, what can\n             you tell me about him?\n\n\n\n\n                                                       17.\n\n\n\n\n\nINT. MIRANDA'S CELL - CONTINUOUS ACTION (PRESENT)\n\n\n\n\nMiranda shakes the puzzling images out of her head:\n\n                          MIRANDA\n\n          Excuse me?\n\n\n\n\n                        PETE\n\n          What's the last memory you have of\n          him that night?\n\n                        MIRANDA\n\n          My last -- ?\n                  (frowns)\n          Tell me nothing happened to Doug.\n\n                        PETE\n\n          Let's backtrack a second. You left\n          your office, you were driving home,\n          you got detoured by the police --\n          Did you call someone on the phone\n          that night?\n\n                          MIRANDA\n\n          I don't know.    I might have.\n\n                        PETE\n\n          Who would you call?\n\n                        MIRANDA\n\n          I might have called Doug to tell\n          him something. Or checked my\n          answering service.\n\n                        PETE\n\n          Were you seeing someone else that\n          night?\n\n                        MIRANDA\n\n          I beg your pardon?\n\n                        PETE\n\n          There was some trouble in your\n          marriage, wasn't there?\n\n                          MIRANDA\n\n          Of course not.\nShe shakes her head emphatically as we:\n\n                                       FLASH CUT TO:\n\n\nFLASHBACK - INT. LOFT - NIGHT\n\nCAMERA PANS ACROSS the large space to find Miranda and a\nMAN (whose face we don't see) kissing heatedly.\n\n                                             (CONTINUED)\n\n\n\n\n\n                                                        18.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                             PETE (V.O.)\n\n             Wasn't there?\n\n\n\n\n\n\n\nINT. MIRANDA'S CELL - CONTINUOUS ACTION (PRESENT)\n\nMiranda chases the disconcerting image out of her head.\n\n                           MIRANDA\n\n             No. There was no trouble in my\n             marriage, I don't know what --\n                     (stops herself)\n             There is no trouble in my\n             marriage. You just used the past\n             tense; why?\nHis face says he doesn't know how to tell her.\n\n                           MIRANDA\n\n             Did something happen to Doug?\n\n                           PETE\n\n             You don't remember anything else.\n             Anything at all?\nFrustrated, she snatches his cell phone and starts to\ndial:\n\n                           MIRANDA\n\n             This is preposterous.    What's\n             wrong with Doug?\n\n                             PETE\n\n             He's dead.\nThis stops her cold. Time stands eerily still. She\nstares at Pete as if by looking at him long enough, he\nwill contradict his statement.\n\n                           MIRANDA\n\n             No, he's not. Don't tell me that.\n             Don't tell me that.\n                     (sickened)\n             Are you -- sure?\n\n                           PETE\n\n             I'm positive.\n                     (painful beat)\n             You killed him.\n\n\n\n\n\n\n\nINT. CORRIDOR - MOMENTS LATER\n\nIrene and TWO NURSE rush to Miranda's cell.      WE HEAR her\nhysterical CRIES from inside --\n\n\n\n\n                                                        19.\n\n\n\n\n\nINT. MIRANDA'S CELL - NIGHT\n\n\n\n\nPete struggles to contain Miranda, who howls\ndisparagingly.\n\n                         PETE\n\n           It's going to be alright, Miranda.\n           You just need to sleep. It's\n           going to be alright --\nOff Pete's nod, a nurse injects the syringe into\nMiranda's arm. They hold her down with great effort as\nshe continues to cry, and we...\n\n                                       FADE TO BLACK.\n\n\n\n\n\nFADE IN:\n\n\nFLASHBACK SEQUENCE - SERIES OF SHOTS\n\nA blur of images and scrambled snippets of memories come\nat us rapid-fire, like a drug-induced dream:\n\n\n\n\n\n\n\nEXT. ASHLEY BRIDGE - NIGHT\n\nMiranda's CAR SCREECHES to a stop and she jumps out,\nglances around.\n\n\n\n\nINT. ST. ANNE'S HIGH SCHOOL - GYMNASIUM - NIGHT\n\nGraduation night. School principal Douglas Grey shakes\nhands with proud parents and clumsily formal students.\nMiranda grabs a drink from a nearby tray, bored.\n\n                         DOUG\n\n                   (re: her drink)\n           Is that number three?\n\n                         MIRANDA\n\n           Yes, Mr. Principal. Special\n           occasion -- I'm celebrating how\n           proud I am of my husband tonight.\nHe smiles weakly at the compliment. Moves his hand\ntowards her, in an affectionate gesture (or so Miranda\nthinks) but instead fixes her bra strap. Ever\nmethodical.\n\n\n\n\nEXT. MOVIE THEATER - DAY\n\nMiranda and a man exit the theater.    Giggling.\n\n                                       FLASH CUT TO:\n\n\n\n\n\n                                                     20.\n\n\n\n\n\nINT. MIRANDA AND DOUG'S HOUSE\n\n\n\n\nDoug laying on the floor covered with bloodstains.\nBloodstained axe on floor in f.g. Walls covered with\nbloodstains.\n\n\n\n\n\n\n\nINT. LOFT - NIGHT\n\nA flustered Miranda fumbles with her purse and keys,\nheads for the door. She tries to fix her smeared\nlipstick and messed-up hair. TURNS TO CAMERA:\n\n                        MIRANDA\n\n          I'm sorry. The fact is I'm\n          married and I -- this is not me,\n          this is a mistake.\nFirst we hear our mystery man's voice, then we see him:\nPete. (Yes, the same person she kissed and went to the\nmovies with.) He places his hand on the door, blocking\nher.\n\n                        PETE\n\n          Your marriage is the mistake and\n          you know it.\n\n                          MIRANDA\n\n          Don't.\n\n                        PETE\n\n          I'm sorry. That was out of line.\n          I feel like a school kid hiding\n          from the Principal.\n\n                        MIRANDA\n\n          We are hiding from the Principal.\nHe smiles. Touches her face tenderly. Torn. A person\nused to doing the right thing but not liking that at the\nmoment.\n\n                         PETE\n\n          I would just like to spend some\n          time together.\n\n                        MIRANDA\n\n          We spend time together every day.\n\n                        PETE\n\n          I meant minus the schizophrenic\n          women.\n\n                          MIRANDA\n\n          I have to go.    I need time to think.\n\n                                             (CONTINUED)\n\n\n\n\n\n                                                         21.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nHe nods.     Opens the door for her.     She starts to walk\naway.\n\n                           PETE\n\n             Don't be too hard on yourself, Dr.\n             Grey. You haven't done anything\n             wrong.\n\n                            MIRANDA\n\n             Not yet.   But I want to.\n\n\n\n\nEXT. MIRANDA AND DOUG'S HOUSE - MORNING\n\nPUSH INTO a quiet house on a quiet suburban street. Two\nVolvos parked in the driveway. Perfectly-kept front lawn.\n\n                                               CUT TO:\n\n\n\n\n\n\n\n\nFLASHBACK - INT. MIRANDA AND DOUG'S HOUSE\n\nAnother near-subliminal glimpse of Doug laying on the\nfloor covered with bloodstains. Bloodstained axe on\nfloor in f.g. Walls covered with bloodstains.\n\n\n\n\nEXT. CHAPEL - DAY\n\nMiranda and Doug laugh at their wedding. It's clearly\nhot, because she wipes sweat off his brow with a\nhandkerchief.\n\n\n\n\nINT. MIRANDA AND DOUG'S HOUSE - NIGHT\n\nA breathless Miranda wipes her face, leaving a thick\nstreak of blood on it. She looks down at her hand,\nnoticing the blood -- and now we are back in --\n\n\n\n\nINT. MIRANDA'S CELL - NIGHT (PRESENT)\n\nMiranda wakes up with a start. The darkness renders the\nroom almost void of any color. Monochromatic. It takes\nher a moment to orient herself. Her eyes wander across\nthe unfamiliar room, feeling like she's being watched.\nWe become aware of a RAGGED BREATHING sound. Like\nsomebody is standing over her bed. But we don't see\nanything. Miranda gingerly crosses to the door and peeks\nthrough the glass partition into the empty corridor. She\nglances back at the room, stills seeing nothing -- and\nbangs on the door.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                        22.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Can I get some assistance here?\n             Hello?!\n\n\n\nShe waits.     Bangs on the door again.\n\n                            MIRANDA\n\n             Irene?!   Anybody!?\nA beat. And now finally we hear FOOTSTEPS APPROACHING.\nA light is switched on down the corridor.\nThe FOOTSTEPS get CLOSER... and CLOSER...\nMiranda tries to appear composed. Wipes sweat off her\nforehead. Fixes her hair. The FOOTSTEPS now STOP right\nout side the door. A KEY goes into the lock and JIGGLES\nit.\nMiranda waits for the door to open but nothing happens.\nConfused, she steps up to the glass partition and\npeeks --\nThe second her face touches the glass, she is met by a\npair of piercing eyes. The eerie teenage girl. Miranda\njumps back, screams.\nAnd when she looks up again, the image is gone.      A beat.\nRational thought kicking in --\n\n                            MIRANDA\n\n                     (to self)\n             Wake up, wake up...\n                     (beat)\n             You're dreaming. It's not real.\n             An anxiety dream, that's all.\n             That's all. This is dream logic.\n             If it was real, they would have\n             heard you scream. There are\n             twenty employees on the night\n             shift. Fact. At least twenty.\nShe props herself with her back against the wall. With a\nview of the whole cell. Just in case. Staring at the\ndoor.\n\n                           MIRANDA\n\n             I'm just dreaming.\nAnd now, FAINTLY at first, but GROWING LOUDER --\nFOOTSTEPS can be heard APPROACHING outside. Just like\nbefore.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         23.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             I'm dreaming, I'm dreaming, I'm\n             dreaming, I'm dreaming.\n\n\n\nLike her life depends on that mantra. The FOOTSTEPS get\nCLOSER. And her voice begins to falter --\n\n                           MIRANDA\n\n                     (voice rising)\n             I'm dreaming, I'm dreaming --\nAnd now the FOOTSTEPS pause outside her door like before\nand she holds her breath, horrified, when suddenly we are\nhit with the sudden glare of returning light.\nEVERYTHING FLASHES WHITE and then COLOR RETURNS --\n\n                           IRENE (O.S.)\n\n             Rise and shine, ladies!\n\n\n\n\nINT. MIRANDA'S CELL - DAY\n\nIrene tries to shake Miranda awake.       An orderly and nurse\nstand by.\n\n                           IRENE\n\n                     (shaking her)\n             That means you, honey.   Up -- !\nNo reaction.\n\n                           IRENE\n\n             Rise and shine now.    Wake up.\nShe shakes her harder. And now Miranda's EYES SHOOT OPEN\nand she grips Irene's arm. Hard. Like the teenage girl\ndid.\n\n                           IRENE\n\n             Easy now, it's okay.\nMiranda stares at her, coming back to. Starts to speak\nbut has no voice. Clears her throat --\n\n                           MIRANDA\n\n             I need to see Peter Graham.\n\n                           IRENE\n\n             And you have a session scheduled\n             this afternoon --\n\n                           MIRANDA\n\n             Right now.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        24.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                            IRENE\n\n             He's not even in yet, now let go\n             my arm, honey.\n\n\n\n\n                           MIRANDA\n\n             Doctor Grey, if you don't mind.\n\n                           IRENE\n\n             Actually I do mind. I start\n             calling you 'doctor' and everybody\n             else wants to be called 'doctor' --\n\n                           MIRANDA\n\n             Please. It's a bit different,\n             wouldn't you say -- ?\nIrene reaches out her hand and the nurse places a cup\nwith meds on it.\n\n                           MIRANDA\n\n             What do you think you're doing?    I\n             want to speak to my lawyer --\n             wait, what are you doing?\n\n                           IRENE\n\n             My job.\nIrene shoves the meds into Miranda's mouth --\n\n                           MIRANDA\n\n             C'mon, Irene, don't do this. I'm\n             calm now, look -- I'm calm -- !\nShe struggles as they hold her down and Irene sedates\nher.\n\n\n\n\nINT. REC ROOM - DAY\n\nDRIFTING PAST the female patients at their usual activities.\nSome watch TV, play dominoes, some pretend to read, some\nstare out blankly. Here's Chloe at a table, engaged in\nsome sort of trivia game with a tattooed Southern redhead\nnamed JENNA:\n\n                           CHLOE\n\n\n             M.\n\n\n                           JENNA\n\n             Mallorol, Matzine, Megaphen,\n             Meallaril-S, Meleretten, Meleril,\n             Mellaril, Mellaril-S, Mesoridazine,\n             Methotrimaprazine, Mixidol, Moban\n             Modalina --\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         25.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                            CHLOE\n\n             Modalina?   Isn't that a band?\n\n                           JENNA\n\n             Trade name for Triflupoerazine.\n             Look it up.\nChloe shrugs, if you say so.       Jenna resumes:\n\n                           JENNA\n\n             Moditen, Molindone, Moltipress,\n             Motival. That's it for the 'M's.\n\n                           CHLOE\n\n             Not bad. High potency\n             neuroleptics starting with 'J.'\n\n                           JENNA\n\n             Trick question. There's only\n             Jatroneural.\n\n                           CHLOE\n\n             What do you wanna bet?\n\n                           JENNA\n\n             Bet you a soda.\nChloe checks a reference book.       Nods, impressed.\n\n                           CHLOE\n\n             Right on the money, cowgirl.\n             Twenty points and a soda.\nCAMERA FOLLOWS HER INTENT GAZE to another patient,\nSHELLEY (the same patient we saw earlier mid-fit)\nmoseying across the room. Nervously takes a seat beside\nMiranda.\n\n                           SHELLEY\n\n             Hi there, Doc.\nIt takes a moment for the heavily-drugged Miranda to\nreact. She looks up slowly: eyes glazed, painfully out\nof it.\n\n                           SHELLEY\n\n             I never got shrinked by you but\n             all I hear is nothing gets past\n             you, I mean, that's just hearsay\n             and I don't pay much attention to\n             hearsay because now they say you\n             hacked your husband with an axe\n             but I say maybe it just slipped,\n             right?\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        26.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nMiranda notices Shelley is toying with a wrinkled\nNEWSPAPER CLIPPING. Shelley catches this look and slides\nit over to her. Without malice, like a child.\n\n\n\n\n                           SHELLEY\n\n             They put your picture in the\n             paper.\nIt reads \"SCHOOL PRINCIPAL SLAUGHTERED. WIFE UNDER\nARREST.\" Photos of Miranda, Douglas, their house.\nMiranda stares at it in disbelief.      Growing sick.\n\n                           MIRANDA\n\n             How did you get this?\n\n                           SHELLEY\n\n             Chloe did. Who knows how? Not\n             me. Around here I'm on a need to\n             know basis about stuff and most\n             stuff I don't need to know. My\n             point is about people talking\n             behind other people's backs. Like\n             before I was here, everything I\n             did I thought, 'this'll get them,'\n             wanting their approval, wanting\n             them to say good things behind my\n             back. But now I'm more anonymous,\n             more myself. I'm Shelley.\nMiranda slides the clipping back to Shelley, clueless as\nto how to get out of this conversation, but Shelley has\nno problem holding a conversation all by herself --\n\n                           SHELLEY\n\n             You're not like, undercover here,\n             are you? They pulled that at\n             Spring Grove, had a bunch of\n             doctors pretend they were\n             patients, see if they could handle\n             it. Most quit after day one.\n             You're not, are you?\n\n                            MIRANDA\n\n             No, Shelley.   I'm not undercover.\n\n                           SHELLEY\n\n             Because if you were, I'm like the\n             Fort Knox of secrets. Ask\n             anybody.\n\n                           MIRANDA\n\n             That's good to know. But I'm not.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         27.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHELLEY\n\n             Say no more.\n                     (sotto)\n             I understand perfectly.\n\n\n\nShe hands Miranda paper and some crayons, whispers:\n\n                           SHELLEY\n\n             Drawing is a great cover.   Good\n             luck to you.\nWith a wink, she's gone. Miranda looks at the room\naround her: Chloe spying on her in the corner, Irene and\nthe nurse sharing a laugh, other patients ambling about,\narguing --\nLife among the insane.\n\n\n\n\nINT. LOCKER ROOM - DRESSING AREA - DAY\n\nPatients undress in the bare-bones locker area. An\nuneasy Miranda is handed a bar of soap and towel by\nIrene.\n\n                           MIRANDA\n\n             I don't -- I think I'm alright.\n\n                            IRENE\n\n             You go in last because you're\n             special.\n                      (off Miranda's look)\n             It's not a Mexican prison, toots.\n             Everybody here minds their own\n             business.\n\n                           MIRANDA\n\n             If it's all the same, I'd\n             rather --\n\n                            IRENE\n\n             State law says we keep you ladies\n             clean. And I'm a stickler for the\n             law.\n                     (beat)\n             Now come on. If you go downtown,\n             you gotta dance.\nMiranda studies the patients already under the spray of\nthe shower. Something vaguely concentration camp-like\nabout institutional bathing.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                    28.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nThe shower, like everything else in this place, is\nregulated by shifts, so that various groupings of\npatients each get their turn. Miranda feels Chloe's gaze\non her across the room. She is stripping off her clothes\nfor Miranda's benefit, gleefully mangling the last\nrefrain from the Stones' \"START ME UP.\"\n\n                           IRENE\n\n                     (checking watch)\n             That's five minutes, group one.\n                     (to Chloe's group)\n             Alright, ladies, nice and easy.\nThe first group of bathers file out, dripping wet past\nMiranda, in all shapes and sizes. She registers their\nmany scars and tattoos, like maps of troubled souls:\nnames of men, places, religious quotes. Burn scars,\ncuts, needle marks. They begin to towel off as Miranda,\nslowly and painfully self-conscious, begins to undress in\nthe corner.\nA moment later Irene nods for her to go in.\n\n\n\n\nINT. COMMUNAL SHOWERS - LATER\n\nMiranda hangs her head under the spray and closes her\neyes, trying to shut it all out.\nThe SOUNDS slowly FADE OUT until all we have is Miranda\nand her RAGGED BREATHING. Chloe and Shelley, the last\ntwo out from the previous group, grab towels.\nChloe winks at Miranda when she catches her staring, but\nMiranda is not staring at her. She is staring past her\nat the tile wall.\nMore specifically at a hole in the tile where a busted\nwater pipe pokes out. Clearly at some point there was a\nhandle there, but now it is just a hole with a busted\npipe.\nPUSH INTO the hole to see a perfectly-formed globule of\nblood emerge, following by a GURGLING sound which seems\nto come from deep in the bowels of the plumbing system.\nThe blood lingers tentatively, as if unfamiliar with the\nlaws of gravity, before tracing an upward line along the\ntile. The GURGLING GROWS LOUDER, CLOSER, and now more\nblood flows from the hole and spreads up the wall.\nMiranda looks away, disturbed, and now realizes she is\nthe only one left in the showers. Panic. Shuts her\neyes.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                         29.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n                     (to self)\n             It isn't real. It isn't real.\n\n\n\nOpens her eyes.\nFive letters are written in blood.       N-O-T-A-L.\nShaking, nauseous, she looks down at her feet and the\ndrain, too scared to look back up.\n\n                            MIRANDA\n\n                     (to self)\n             It isn't real. You're\n             hallucinating.\nPerhaps. But now blood drips by       her ankle, DRIP, DRIP,\nDRIP. And the shooting pain she       feels is coming from her\narm. What the hell -- ? WE SEE        SHARP SLASHES appearing\non her skin, like some invisible      knife is slicing her.\nHallucination or not, she bolts out of the showers --\n\n\n\n\nINT. LOCKER ROOM - DRESSING AREA\n\nMiranda wraps a towel around her bloody arm, too freaked\nout to process anything. Fumbles for her clothes and heads\nstraight to Shelley, tying her shoelaces, muttering.\n\n                           MIRANDA\n\n             Shelley?\n\n                           SHELLEY\n\n             And pick up those damn cigarette\n             butts. Jesus, TV is dumb --\n\n                           MIRANDA\n\n             Shelley, can you do me a favor??\nShelley fixes her with an intense conspiratorial look.\n\n                           SHELLEY\n\n             The housewives will find something\n             better to do.\n\n                           MIRANDA\n\n             Can you go in the shower and tell\n             me if you see anything on the wall?\nShelley doesn't respond. Simply crosses over and heads\nfor the showers. Miranda gets dressed when a hand on her\nshoulder makes her jump --\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         30.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           IRENE\n\n             Enough privacy for you?\n\n                            MIRANDA\n\n             Yes.   Thank you, Irene.\nBut now Irene notices the blood seeping through the\ntowel.\n\n                           IRENE\n\n             What did you do?\n\n                            MIRANDA\n\n             Nothing.   It's nothing --\n\n                           IRENE\n\n             What the hell did you do to\n             yourself?!\nAnd now the other patients are curiously watching as\norderlies RUSH IN to haul her away.\n\n\n\n\nINT. WOODWARD CORRIDOR - LATER\n\nTHROUGH a glass pane we see a NURSE bandaging Miranda's\narm. Parsons and Irene confer just outside the room.\n\n                           IRENE\n\n             I looked away for a second. It's\n             unacceptable, won't happen again.\n\n                           PARSONS\n\n             Not your fault. Patients always\n             find a way to hurt themselves if\n             that's what they want.\n\n                           IRENE\n\n             I just didn't peg her for a\n             cutter, that's all.\nParsons watches Miranda through the glass.       She can't\nlook him in the eye.\n\n\n\n\n\n\n\nINT. REC ROOM - LATER\n\nMiranda (with her fresh new bandage) ignores the looks\nfrom the other patients as she rejoins them. Spots\nShelley by the window furthest from the wardens. Scared.\n\n                            SHELLEY\n\n             Oh my God.   Oh my God.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                          31.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             You saw it?\n\n                            SHELLEY\n\n             Listen, Doctor. Some people, they\n             have a gift. And in here, because\n             they categorize us as a bunch of\n             schizos, they refuse to\n             acknowledge that. It's like that\n             Hubble telescope that sees things\n             a trillion miles away but what\n             it's seeing is just reflected\n             light of a star that died a\n             thousand years ago? It's like\n             that. Doesn't mean you're crazy.\n             It only means your eyes open in a\n             different way.\nMiranda tries to follow the convoluted explanation, but\nhas a sinking feeling.\n\n                           MIRANDA\n\n             What did it say?\n\n                           SHELLEY\n\n             On the telescope?\n\n                           MIRANDA\n\n             Did you see anything, Shelley?\nShelley glances around to make sure no one can hear.\n\n                           SHELLEY\n\n             That's not tile that wall is made\n             out of . It's a holographic\n             screen. All part of your mission,\n             isn't it?\nMiranda shakes her head, feeling foolish.     Walks away.\n\n                           MIRANDA\n\n             Thanks anyway.\n\n                           SHELLEY\n\n                     (taps her forehead)\n             This is all we have. The rest is\n             dust.\n\n\n\n\nINT. MIRANDA'S CELL - DAY\n\nPete and Miranda stare at each other.     A tense beat.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                        32.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             It was you I called that night.\n\n                            PETE\n\n             Yes.\n\n                           MIRANDA\n\n             Did you mention that to the cops?\n\n                            PETE\n\n             No.\n\n                            MIRANDA\n\n             Why?\n\n                           PETE\n\n             I didn't think it would help you.\n\n                           MIRANDA\n\n             What does that mean?\n\n                           PETE\n\n             It means they wouldn't have let me\n             treat you if they thought I had\n             any kind of involvement in what\n             happened.\n\n                            MIRANDA\n\n             And did you?\n\n                            PETE\n\n             Did I what?\n\n                           MIRANDA\n\n             Did I make it to your place?   Did\n             I see you that night?\n\n                           PETE\n\n             No. We got disconnected and I\n             couldn't get through to you. I\n             sat there waiting all night.\n             Figured you'd changed your mind.\n\n                           MIRANDA\n\n             Why didn't you tell me this before?\n\n                           PETE\n\n             Because the only way you'll be\n             able to accept these events is if\n             you remember them on your own. My\n             job is to assist you in processing\n             that information because you're\n             not in a frame of mind to do it by\n             yourself.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         33.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nShe stares at him.     Queasy.\n\n                           MIRANDA\n\n             You're changing the subject.\n\n\n\n\n                           PETE\n\n             The subject is you don't trust me.\n\n                           MIRANDA\n\n             Right now I don't trust anyone.\nShe tries to read his face. Reminds herself of who Pete\nis and what he means to her. He points at her bandaged\narm.\n\n                           PETE\n\n             You want to talk about today?\nShe takes a resigned breath, slowly shakes her head.\nWishing she could wake up from this nightmare:\n\n                           MIRANDA\n\n             I want to talk to my lawyer.\n\n                           PETE\n\n             I think that's premature.\n\n                           MIRANDA\n\n             I can't help what you think.\n\n                                             FADE OUT.\n\n\n\n\n\nFADE IN:\n\n\n\n\n\nEXT. WOODWARD INSTITUTE GARDEN - DAY\n\nSPRINKLER SYSTEMS doing their thing: THWIP, THWIP,\nTHWIP... The female patients are out in the gardens for\ntheir freshly dose of air. BOOM DOWN TO Miranda alone at\na bench. A cigarette appears before her, being offered\nto her:\n\n                           JENNA\n\n             You a Marlboro girl?\nMiranda sees Jenna looming above her, shielding the sun.\n\n                           MIRANDA\n\n             I don't smoke, thanks.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                          34.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                            JENNA\n\n             All we have is our health,\n             cupcake.\n                      (sits beside her)\n             What I do is quit constantly,\n             start again. Drives them all\n             crazy. One day I quit three\n             times.\n\n                          MIRANDA\n\n             Huh.\nJenna lights her smoke, blows out the match slowly.\nMiranda turns and checks the building entrance as Jenna\nrambles on.\n\n                           JENNA\n\n             They allow me one match at a time\n             and pretend they're not watching.\n             Check it out: salivating goon\n             number one at three o'clock, oh-\n             so-inconspicuous goon number two\n             at five o'clock.\nMiranda follows Jenna's gaze. Sure enough, she's being\nclosely watched by two orderlies.\n\n                           MIRANDA\n\n             What did you set on fire to wind\n             up here?\n\n                           JENNA\n\n             Very perceptive, Doc. I burnt\n             down the building where I worked.\n             I found a baby at the doorstep,\n             called the cops -- of course the\n             bottom feeding pricks never\n             showed. It's beside the point,\n             really.\nMiranda shrugs. God knows what Jenna is talking about\nbut who is she to say? Once again, Miranda checks the\nbuilding entrance and now sees Parsons emerge. She\nrises --\n\n                          MIRANDA\n\n             Phil.\nHe keeps walking.     Headed to the parking lot beyond.\n\n                          MIRANDA\n\n             Phil!\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         35.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nHe turns. His first instinct is to smile. But he checks\nhimself, reminding himself of her new status. Slips into\nhis best professional face:\n\n\n\n\n                           PARSONS\n\n             Hello, Miranda.\n\n                           MIRANDA\n\n             I wonder if I could talk to you.\n\n                           PARSONS\n\n             Of course.\n                     (checks his watch)\n             Well, actually, I'm about to...\n\n                           MIRANDA\n\n             Your staff meeting's done and\n             Thursdays you don't schedule\n             sessions until the afternoon.\n             This will just take one minute.\n             Promise.\nImpressive.    She remembers his schedule perfectly.\n\n                          PARSONS\n\n             True.\n                     (points)\n             But the Sheriff wants to ask me\n             some questions.\nShe follows his look to the parking lot where Sheriff\nRyan emerges from his patrol car. Miranda nods.\n\n                           MIRANDA\n\n             It's about Pete.\n\n                           PARSONS\n\n             What about him?\n\n                           MIRANDA\n\n             Perhaps he's not the most\n             qualified person to be treating\n             me.\nHis tone is fatherly yet direct.\n\n                           PARSONS\n\n             Are you complaining about his\n             methods or are you referring to\n             the nature of your past\n             relationship with him?\nThis surprises her.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         36.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             What did he tell you?\n\n                           PARSONS\n\n             He explained there might be a\n             conflict of interest because he\n             has feelings for you. You two\n             engaged in a kiss at one point.\n             Am I right?\n\n                             MIRANDA\n\n             Yes.\n\n                           PARSONS\n\n             I told him we're all grownups here\n             and the fact is he's the best doctor\n             on my staff. As such, and given the\n             severity of the charges you face, I\n             consider him the most qualified person\n             to assist your recovery. Now, if\n             you'll excuse me, Sheriff Ryan is\n             not a patient man.\nStonewalled in the simplest of ways, she's left feeling\nlike an idiot. Watches Parsons join the Sheriff by his\ncar. The two men shake hands when suddenly Irene runs\npast her, yelling --\n\n                             IRENE\n\n             Hey!   Chloe!\nNow two ORDERLIES race past. Miranda looks over to see\nwhat the fuss is all about. Chloe is on top of an\ninstitute staff member we haven't seen before, a round\nblack woman named CONSUELO. Punching her --\nOther patients have crowded around the scuffle.\n\n                           CHLOE\n\n             You fucking cow giving me the evil\n             eye, huh? Fuck you, you fuckin'\n             voodoo witch -- !\nIrene and the orderlies yank Chloe off Consuelo. Chloe kicks\nand screams like an animal. Consuelo meekly stands up.\n\n                           CONSUELO\n\n                     (heavy Cuban accent)\n             Is okay, she's okay -- she don't\n             mean nothing.\n\n                           CHLOE\n\n             You bet your goddamn fat ass I\n             mean it, you're a witch -- !!\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        37.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           IRENE\n\n             McGrath, that's enough!\nThe orderlies start pulling Chloe away.      Chloe spits at\nConsuelo, full of venom.\n\n                           CHLOE\n\n             Take your voodoo shit back to\n             Cuba --\n\n                           IRENE\n\n             I said that's enough.\n\n                           CONSUELO\n\n             Irene, she's okay. Pobrecita, la\n             infeliz. It's a misunderstanding.\n             Pobrecita. I was only trying to\n             help her --\n\n                            CHLOE\n\n             You wanna help me? You pity me?\n                      (grabbing her\n                       crotch)\n             Suck me.\nThe orderlies haul Chloe off. Irene disperses the crowd.\nConsuelo sighs, embarrassed, wipes a bloody lip. Her\nmanner says she just wants to get back to her duties.\nExcitement over, the patients resume whatever it is they\nwere doing.\nMiranda stares at her bleak surroundings when something\ncatches her eye: Pete watching her from his office\nwindow. He quickly slides the curtain shut. Odd.\n\n\n\n\nEXT. WOODWARD INSTITUTE - DAY TO NIGHT (TIME LAPSE\n\n\nPHOTOGRAPHY SHOTS)\n\nA sunny sky grows dark as night envelops us with a SWOOSH --\n\n\n\n\n\n\n\nINT. WOODWARD CORRIDOR\n\nSLOW PUSH DOWN empty corridors.      The air thick with dread --\n\n\n\n\nINT. MIRANDA'S CELL - NIGHT\n\nMiranda cries softly, unable to sleep. VOICES trickle in\nfrom the corridor outside, wardens on their rounds, a\nSOFT MOAN from another cell, a random SCREAM. She shuts\nher eyes, repositions herself on her stomach.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                          38.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nAs before, somebody seems to be watching her.\n\n                                              FADE OUT.\n\n\n\n\n\n\n\n\nFADE IN:\n\n\n\n\n\nINT. WOODWARD LIBRARY - DAY\n\nIrene escorts Miranda into the library.       A warden\nfollows.\n\n                           IRENE\n\n             How are we feeling today?\n\n                           MIRANDA\n\n             'We'?\n\n                           IRENE\n\n             Sorry I asked.\n\n                           MIRANDA\n\n             Doesn't seem like the best choice\n             of words when treating\n             schizophrenics.\n\n                           IRENE\n\n             Fitting right in, aren't you?\nThe library is pretty    much empty at this hour except for\nthe LIBRARIAN and the    odd janitor tidying up. An\nefficient-looking man    rises from a desk, briefcase in\nplace, glass of water    -- this is attorney THEODORE\n\n\"TEDDY\" HOWARD.\n\n\n                           TEDDY HOWARD\n\n             Miranda.\n\n                           MIRANDA\n\n             Hi.\nIrene checks her watch.       The warden hangs back, keeping\nwatch.\n\n                           IRENE\n\n             She's due back in the rec room in\n             twenty, Counselor.\n\n                           TEDDY HOWARD\n\n             Thank you kindly.\nMiranda sits.      Waits until Irene is out of hearing range.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         39.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Teddy, I know you knew Doug well\n             and this is an extremely --\n\n\n\n\n                           TEDDY HOWARD\n\n             I'm here as your lawyer. So\n             whatever my relationship was with\n             Doug is no longer of consequence.\n             First things first, how are they\n             treating you?\n\n                           MIRANDA\n\n             Like I'm crazy.\n\n                           TEDDY HOWARD\n\n             You know this place better than\n             anyone. Anything out of the\n             ordinary?\n\n                           MIRANDA\n\n             Other than me being crazy?   No.\n\n                           TEDDY HOWARD\n\n             The DA is pushing for a hearing as\n             soon as next week. They're eager\n             to resolve this situation because\n             -- well, crimes like this don't\n             happen that often around here.\n             Doug was a hometown boy who'd done\n             good, beloved high school\n             principal, a role model. Our best\n             shot -- scratch that, our only\n             shot -- is to claim temporary\n             insanity.\nAs he speaks, she starts fidgeting with her itchy\nbandage.\n\n                           MIRANDA\n\n             Wait, wait, wait -- Teddy, you\n             know me. I wouldn't raise a hand\n             at my husband for the life of me.\n             Not even in self-defense. Isn't\n             it remotely possible a burglar\n             broke in or some crazed high\n             school student attacked Doug and I\n             went into shock?\nTeddy shakes his head.\n\n                           MIRANDA\n\n             You're telling me there's no other\n             suspects in anyone's mind?\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        40.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           TEDDY HOWARD\n\n             Frankly, no. Neighbors heard\n             screams. They have you at the\n             scene, they have the murder weapon\n             and they have your prints everywhere.\n             The only thing they don't have is\n             motive.\nShe keeps absently playing with the bandage. The\nadhesive is giving. The bandage starting to peel off.\n\n                           MIRANDA\n\n             Because there is no motive.\n\n                           TEDDY HOWARD\n\n             And that's what's confusing them.\n             The fact that you're a brilliant\n             psychiatrist doesn't help either.\n             It fills their heads with ideas.\n             They figure if you were to plan a\n             murder you might know how to fake\n             insanity to get out of it.\nShe pulls off half the bandage, back and forth. Not\nlooking. BUT WE SEE the beginning of a pattern in her\nscarred skin --\n\n                           MIRANDA\n\n             I'm not faking anything.\n\n                          TEDDY HOWARD\n\n             Good. I pass no judgment either\n             way. The point is --\n\n                            MIRANDA\n\n             The point is I'm the only person\n             who doesn't believe I killed my\n             husband. I never thought I'd say\n             this, but I feel like I'm in the\n             middle of a conspiracy.\n                     (beat)\n             Do you believe I'm crazy?\nAn uncomfortable Teddy takes too long before answering.\nMiranda looks down, humiliated -- and now she sees it.\nPerfectly carved into her arm, her scar reads:\n\n\"NOT ALONE.\"\n\nPetrified, Miranda jumps back, knocks down Teddy's glass\nof water all over his papers, her chair topples over.\nThe warden and janitor look up --\nTeddy tries for delicate:\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                        41.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           TEDDY HOWARD\n\n             It doesn't matter what I believe.\n\n                            MIRANDA\n\n             Forget it.   Forget I asked.\nPUSH INTO her face as involuntary tears roll down and we --\n\n\n\n\nINT. PETE'S OFFICE - DAY\n\nMiranda. Numb. Pete trying hard to get through. A\nbeat. We get a good look at the writing on her arm.\n(The right arm.)\n\n                           PETE\n\n             I can't help you if you don't talk\n             to me.\nSilence from Miranda.     He is firm but not unkind:\n\n                           PETE\n\n             I can stand here all day. All\n             week. You're the one running out\n             of time.\nNothing.     He goes to touch her arm.   She jerks it away.\n\n                           PETE\n\n             What does it mean?\nShe shakes her head, at a loss. Torn between her\nsuspicion and the need to confide in someone. Finally:\n\n                           MIRANDA\n\n             I didn't write this.\n\n                           PETE\n\n             Then who?\nThey stare each other down. There's definitely chemistry\nbetween these two. But the moment is far from romantic.\n\n                           PETE\n\n             You're going to have to trust me.\n\n                           MIRANDA\n\n             Why?\n\n                           PETE\n\n             Because no matter what's going\n             through your mind right now, I\n             haven't done anything wrong.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         42.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Then you know exactly how I feel.\nHe starts to speak, stops himself. Switches tactics.\nTheir banter escalates in speed as their terms get more\nclinical:\n\n                           PETE\n\n             You admit you're having a hard\n             time differentiating what's\n             reality from what's hallucination,\n             right? So isn't it at least\n             possible that --\n\n                           MIRANDA\n\n             As a doctor I agree with you.\n             Maybe -- and this is a big maybe\n             -- all of this is just a deep\n             epilepsy that extends to the\n             limbic structures, but I'm telling\n             you --\n\n                           PETE\n\n             How about this moment right now?\n\n                           MIRANDA\n\n             What about it?\n\n                           PETE\n\n             Is this a hallucination?\n\n                           MIRANDA\n\n             You tell me. But I do know what I\n             sound like. Paranoia is the\n             ultimate awareness, right?\n\n                           PETE\n\n             Which is why I suggest we simply\n             increase your dose until --\n\n                            MIRANDA\n\n                      (venom)\n             No!   Goddamnit! No!\nHe steps back at her blowout. She catches the look on\nhis face and forces herself to sit down.\n\n                           MIRANDA\n\n             I'm sorry. Is there any way we\n             can pretend that didn't just\n             happen?\n\n                           (MORE)\n\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         43.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA (CONT'D)\n\n                     (beat; struggling)\n             I want to believe you. I do. So\n             I'll take your word for it --\n             you're not involved in this -- but\n             you take mine: I didn't write\n             this and I didn't kill my husband.\nHe studies her.     Finally nods.   New tactic:\n\n                           PETE\n\n             Alright. Let's say you didn't\n             write this --\n\n                           MIRANDA\n\n             Number one: I'm right-handed.\n             Number two: I would have had to\n             bring an X-Acto knife into the\n             shower to do this, wouldn't I?\nPete tries to reserve judgment. Her argument has a\ncertain loopy logic to it. He hesitates, then pulls a\nSERIES OF PHOTOGRAPHS from a manila envelope.\n\n                           PETE\n\n             I think it's time you look at\n             these.\nMiranda looks at the crime scene photos. Lurid.\nTerrible. Here's part of Doug's body. Here's the axe.\nAnd now she sees a closeup picture of the wall with words\non it. In blood, a la Manson family. And it says:\n\n\"NOT ALONE.\"\n\nMiranda immediately tosses it away from her.      Repulsed --\n\n                                         FLASH CUT TO:\n\n\n\n\n\nFLASHBACK - INT. MIRANDA AND DOUG'S HOUSE - NIGHT\n\nMiranda furiously writes on the wall with blood. Wipes\nher face breathlessly, leaving a thick red streak on it.\n\n\n\n\n\n\n\nINT. PETE'S OFFICE - CONTINUOUS ACTION (PRESENT)\n\n\n                           PETE\n\n             You wrote that. Any idea why?\n\n                           MIRANDA\n\n                     (panic rising)\n             No, I didn't. No, I didn't!\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                       44.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nPete retrieves the photograph off the floor and holds it\nup for her to study again.\n\n                           PETE\n\n             You're the only person who can\n             figure out what this means. Try\n             to remember. Stop holding back.\nShe nods meekly. Staring at the picture. Begins to\nshake as all of it finally comes flooding in --\n\n                                       FLASH CUT TO:\n\n\n\n\n\nFLASHBACK - INT. MIRANDA AND DOUG'S HOUSE - NIGHT\n\nA breathless Miranda wipes her face, leaving a thick\nstreak of blood on it. She looks down at Doug, crawling\non hands and knees. He moans horribly, in shock. She\ngrabs the heavy axe from the floor and follows him. He\nreaches for the coffee table with the telephone on it and\nmakes a move to grab it. He has all the speed of a dying\nturtle, and that's pretty much what he resembles.\nMiranda bites her lip, lifts the heavy axe with both hands.\nDoug's hand grabs the phone. Miranda SWINGS THE AXE over\nher head and it comes down straight AT CAMERA.\nMiranda wipes her face again, catches her reflection in\nthe mirror over the mantel and stares --\nWE HEAR THAT SOUND. The WETTISH GURGLING sound. Miranda\nstares at the MIRROR looking for the source of it. For\nan instant we see the teenage girl's reflection there,\nbeckoning. But now she's gone and Miranda is left\nstudying her own demented expression and now FLAMES RISE\naround her. She looks down at her feet: No fire. Blood\non her clothes, axe still in her hands. Looks back up\nat:\n\n\n\n\n\n\n\nTHE MIRROR VERSION OF MIRANDA\n\nshows a serene expression on her face. Fire enveloping\nher. She slowly lifts her hands over her head. In place\nof the axe there are CHAINS attached to SHACKLES on her\nwrists. She is completely naked, as if purified -- like\nan extreme version of Anima Sola. (A Biblical icon in\nwhich a woman in fiery purgatory awaits her fate.)\nTime stands still for a mesmerizing moment --\nWhen the MIRROR SHATTERS TO PIECES and we're back to\nreality. Miranda stares at the axe she's flung at it.\n\n\n\n\n                                                     45.\n\n\n\n\n\nINT. MIRANDA'S BATHROOM - LATER\n\n\n\n\nMiranda tries to wash off the blood in the sink. This is\na daunting task, seeing as how she's covered in it. She\nstares at her bloody footprints all over the floor, at\nthe marks on the door handle, towels and wall.\n\n\n\nGasping for breath, almost crying, she turns on the\nshower at full blast and climbs into the tub. She\nwatches the blood wash off her. As if finally coming\nback to her body and realizing what she's done, she\nslowly slides down the shower wall and curls up in the\ntub. Crying. Shaking.     She shuts her eyes as hard as\nshe can to make it all go away, and we --\n\n                                    FADE TO BLACK.\n\n\n\n\n\nBLACKNESS\n\nSilence. And now, faintly at first, but GROWING\nPROGRESSIVELY LOUDER, we hear the SOUND OF BUZZING FLIES.\n\n\n\n\nFADE IN:\n\n\n\n\n\nINT. MIRANDA'S BATHROOM - DAY\n\nMiranda wakes up, still in the tub. How long has she\nbeen there, hours? Days? Impossible to know.\nBut at some point she must have turned off the water.\nShe sits up, every muscle of her body aching, hair caked\nwith blood.\nThe first thing that hits her is the stench. And it's foul,\nthe putrid smell of decaying flesh. She steps gingerly out\nof the tub onto the flooded floor and follows the trail of\nblood, mortified at what she will find.\n\n\n\n\nINT. MIRANDA AND DOUG'S LIVING ROOM - CONTINUOUS ACTION\n\nSoon enough the press will make the Manson Family\nreference, but for now, only Miranda is here to witness\nthe fruit of her labor. She gasps for air.\nInstead she is hit by a wave of nausea. She doubles over\nto throw up when there is a FRANTIC RAPPING at the front\ndoor.\nShe freezes. VOICES and YELLS trickle in. The HINGES on\nthe door RATTLE under REPEATED POUNDING and she still\nstands there as the first FIREMAN breaks in. Sheriff\nRyan and his deputies right behind. A concerned Pete\nGraham behind them.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                         46.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nThe cops take one look at the place and raise their guns\nat her, but we can't hear what they're saying because\nMiranda's ragged BREATHING has taken over the soundtrack.\nSuffice to say that, at the sight of the guns, something\nclicks inside her and she turns on her heel and flees --\n\n\n\n\nINT. HALLWAY - CONTINUOUS ACTION\n\nShe slips on blood, nearly falls as she scrambles to the\nbedroom --\n\n\n\n\n\n\n\nINT. MIRANDA AND DOUG'S BEDROOM\n\nShe locks the door behind her, hyperventilating in terror.\nInstantly there are men POUNDING on it. SQUAWKING RADIOS.\nORDERS BARKED at her. She spots two officers through the\nwindow in her backyard. About to smash the window.\nA caged animal, completely surrounded, she covers her face\nwith her hands. Trembling. The doorknob jiggles violently,\nabout to give. And when she brings her hands down she is\nstaring straight into the teenage girl's face. And she\nOPENS HER MOUTH WIDE and now we are back in --\n\n\n\n\nINT. MIRANDA'S CELL - NIGHT (PRESENT)\n\nMiranda gasps for air, drowning in sensory overload.\n\n                           MIRANDA\n\n             Oh God, oh God, oh God...\nShe rocks back and forth. Finally aware of what she's\ndone. She is the killer. No more doubts. And now that\nshe knows, everything is much worse.\nA long, harrowing beat.\nWE PUSH IN ON her devastated face.       NIGHT TURNS TO DAY.\n\n\n\n\nINT. MIRANDA'S CELL - DAY\n\nThe locks are unlocked. Pete appears at the door.\nMiranda glances up at him. She looks like a different\nperson. Completely destroyed. He crouches beside her.\n\n                          PETE\n\n             You okay?\nShe shakes her head slowly. He sets his hand on her\nshoulder. She turns to him and hugs him tight, holding\non for dear life. Breaks down in sobs.\n\n\n\n\n                                                     47.\n\n\n\n\n\nINT. PHIL PARSONS' OFFICE - DAY\n\n\n\n\nParsons leafs through Miranda's file.   Pete stands by the\nwindow, lost in thought.\n\n                        PARSONS\n\n          How much does she remember?\n\n                        PETE\n\n          It all came flooding back last\n          night.\n\n                        PARSONS\n\n          Guilt?\n\n                        PETE\n\n          More like an uncontrollable\n          reminiscence. Intense, over-\n          cathected. She's not feeling\n          guilty of her actions, not\n          exactly. Sounds to me like last\n          night she actually re-lived them\n          in great detail.\n\n                        PARSONS\n\n          Hypermnesis following amnesia.\n          Could a specific epileptic element\n          be involved?\n\n                        PETE\n\n          That's exactly what she suggested.\n          Even in her present state, her\n          instincts remain impeccable.\n\n                        PARSONS\n\n          I'd like to talk to her.\n\n\n\n\nINT. WOODWARD CORRIDOR - LATER\n\nPete escorts a fragile Miranda down the corridor.    The\ntwo orderlies walking ominously behind them.\n\n                        PETE\n\n          Standard procedure.\n\n                        MIRANDA\n\n          I didn't say a word.\n\n\n\n\n\n\n\nINT. DR. PHIL PARSONS' OFFICE - DAY\n\nParsons on the phone, gestures for them to enter.\n\n                                             (CONTINUED)\n\n\n\n\n\n                                                       48.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PARSONS\n\n                     (into phone)\n             Dorothy, I can't discuss this\n             now --\n                     (motions for\n                      them to sit)\n             I'm not taking it lightly, no.   We\n             will talk about it at home.\nMiranda and Pete sit across from him. Miranda trying\nhard to appear composed -- acutely aware of her every\ngesture, and of how different her last visit to this\noffice was. Nothing casual about it now.\nShe stares at the picture frames on Phil's desk (all\nfacing AWAY FROM us), the diplomas on the wall, the books\nby noted fathers of neurology (works by Hughlings\nJackson, Kurt Goldstein, Henry Head, A.R. Luria). A\nframed quote reads:\n\"'If You Do Know That Here Is One Hand, We'll Grant You\nAll The Rest.' -- Wittgenstein\"\n\n                           PARSONS\n\n                     (into phone)\n             Yes, dear. Me too.\nHe hangs up. Takes a moment to look at Miranda. Tries a\nsmile but to her it comes off condescending. Fact is --\nthere's nothing to smile about.\n\n                           PARSONS\n\n             I'm so sorry about this, Miranda.\nShe nods, dazed. Angles her head to look at a framed\npicture on his desk. Parsons looks to Pete.\n\n                           PARSONS\n\n             Has Pete told you about the\n             hearing?\n\n                           PETE\n\n             Teddy already filled her in.\n\n                           PARSONS\n\n             Teddy Howard is top notch. He's\n             going to do everything in his power\n             -- and he's quite resourceful -- to\n             prove you're not fit to stand trial.\n             Miranda, I know you have no family\n             left, so we're your family now and\n             we're all going down to the wire to\n             protect you and help you in any way\n             we --\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         49.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nPUSH IN ON Miranda who stares intently at something on\nthe desk. Not listening to a word he's saying --\n\n                            MIRANDA\n\n             Who is that?\nParsons pauses here.      Exchanges glances with Pete.\n\n                            PARSONS\n\n             Excuse me?\n\n                           MIRANDA\n\n             The girl in the picture.\nWE SEE what she is talking about: a framed photograph on\nthe desk is now FACING us. Eerie. It shows Parsons, his\nwife Dorothy and a young girl. Our teenage girl.\n\n                            PARSONS\n\n             My daughter.\nMiranda looks up at this, perplexed.\n\n                           MIRANDA\n\n             She's the girl I saw.\n\n                           PARSONS\n\n             You're obviously mistaken.\n\n                           MIRANDA\n\n             I'm positive. She was hurt,\n             bleeding. Is she all right?\nPete and Parsons trade uneasy looks.\n\n                           PETE\n\n             Miranda, you've seen that\n             photograph at least a dozen times,\n             every time you've been in this\n             office. You're just confused --\n\n                           MIRANDA\n\n             Not about this. Is she all right?\n\n                            PARSONS\n\n             No, she's not... all right.\n                     (beat)\n             Rachel committed suicide six years\n             ago.\nThis shuts Miranda right up.      Mind spinning.\n\n                            MIRANDA\n\n             How?\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                      50.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             Miranda, that's none of your --\n\n                            PARSONS\n\n             That's okay.\n                     (to Miranda)\n             Rachel was a very troubled girl.\n             Handicapped since birth. She was\n             born mute. My wife and I tried\n             everything to help her fit in\n             but... but she ran away from home\n             more than once, wanting to end her\n             life.\n                     (beat)\n             And she finally succeeded. Jumped\n             off Ashley Bridge. She was only\n             seventeen years old.\nAshley Bridge. Mute. Ghost? Miranda hesitates here.\nShe is not the type to believe in ghosts, and knows full\nwell what even her suggestion of it will sound like.\n\n                           MIRANDA\n\n             I'm -- I'm terribly sorry, Phil.\nParsons doesn't want to talk about it anymore.    Rises.\n\n                           PARSONS\n\n             Peter, can I speak to you?\nThe men step outside. PUSH IN ON Miranda's face as she\nstares at the picture of Rachel. We catch snippets of\nthe doctors' discussion outside, increasing her\nparanoia --\n\n                           PETE (O.S.)\n\n             ... Textbook psychotic pattern...\n             manifestation of guilt...\n\n                           PARSONS (O.S.)\n\n             ... much she knows about Rachel?\n\n                           PETE (O.S.)\n\n             I'm telling you she doesn't...\n             Concocted alternate reality...\n\n                           PARSONS (O.S.)\n\n             I'm trusting you... crawling with\n             cops.\nA DARK SHADOW envelops Miranda's confused face, as we --\n\n\n\n\n                                                    51.\n\n\n\n\n\nINT. MIRANDA'S CELL - NIGHT\n\n\n\n\nMiranda's pale skin is visible in the dim monochromatic\nlight. We are MOVING TOWARDS her, seeing her as if from\nthe POV of someone approaching her. We become aware of\nthe RAGGED BREATHING sound. Miranda opens her eyes,\nlooks this way and that, then closes them again.\nShe is nearly asleep when she hears a sound we've heard\nbefore. The strained WET SOUND. Miranda's eyes SNAP\nOPEN. She slowly sits up, back against the wall.\nSquinting to cover every inch of the room.\nAnd now she sees it: a SHADOW crouched in the corner.\nRoughly the size of a person. Miranda climbs off the bed\nand slowly walks towards it. Scared, but determined.\nShe wrinkles her nose at the putrid smell coming from it.\nShe gets closer... closer... The RAGGED BREATHING GROWING\nLOUDER as she reaches the shadow --\nShe stretches out her hand and finally touches...\nNOTHING. She swipes her hand through the air, feeling\nstupid.\n\n                        MIRANDA\n\n          This is not going to work. I'm\n          sick of being watched, and I know\n          this place well and it doesn't\n          smell this bad.\nShe paces around the room, feels the wall, taps her head.\n\n                        MIRANDA\n\n          I'm awake, I'm not dreaming. I'm\n          alive -- this is not some\n          afterlife mumbo jumbo. So-called\n          paranormal activity can be\n          debunked a million different ways.\n          So whatever you are, whatever it\n          is I'm making up here -- I'm\n          letting you go, I'm setting you\n          free. I'm the wrong person. And\n          I need to sleep. I'm not afraid\n          and I don't believe and I'm fully\n          aware that this is all in my mind\n          -- fiction -- a concocted\n          alternate reality -- and I\n          acknowledge it. And now I'm done\n          with it. I'm going to sleep now.\nThe moment is as brave as it is ridiculous. She has\npsyched herself into verbally defeating the ghost. And\nnow she climbs back in bed.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                      52.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n                     (sleepy)\n             Besides, if you really were the\n             ghost of Rachel Parsons, you would\n             let me out of this cell.\nA beat. And now we hear the SOUND OF THE DEADBOLT SLIDE\nOPEN. The door opens quietly. PUSH INTO Miranda's face.\nProperly scared now.\n\n                           MIRANDA\n\n             Holy shit.\nIf proof is what she wanted, proof is what she got.   From\nnow on we'll refer to the teenage girl as RACHEL.\n\n\n\n\nINT. FEMALE WARD - CORRIDOR - NIGHT\n\nMiranda takes a tentative step outside her cell, feeling\nthe door with her fingers, feeling along the wall --\nstill making sure she isn't dreaming this.\nShe looks down the long, empty corridor, the glare of\nneon lights making her readjust her eyes momentarily.\nNobody there. But when she looks down the other way she\nsees a pair of bare feet disappear behind the wall. So\nquick we're not sure we saw it for sure.\nMiranda deliberately walks in the opposite direction.\nAt night the clinical corridor takes on an unsettling\nquality. She silently strolls down the hall, tilting her\nhead at the various sounds from PATIENTS in their cells.\nShe turns to make sure Rachel isn't behind her and when\nMiranda faces forward again, she realizes she is standing\nright across from:\n\n\n\n\n\n\n\nTHE NURSES' STATION\n\nWhere two nurses are watching TELEVISION. Miranda tiptoes\npast them, ducking at the window to remain unseen.\n\n\n\n\nANOTHER CORRIDOR\n\nThis one is wider. Miranda is startled by the sudden\nsound of LAUGHTER behind her. The nurses laughing at\ntheir late night show. Momentarily distracted, she\nalmost knocks over a mop and bucket resting by the wall.\nShe holds the mop in place and now opens the door to a\n\nSANITATION CLOSET.\n\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                      53.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nShe looks for something, a tool. Discards a pair of\nbrushes and finds a small screwdriver. Pockets it.\n\n\n\n\n\n\n\nTHE STAIRS\n\nMiranda hurries up the stairs, hugging the wall to stay\nclear from the SURVEILLANCE CAMERA sweeping the area.\nShe waits at the landing, times it just right -- and\nscurries to the next floor.\n\n\n\n\n\n\n\nINT. WOODWARD CORRIDOR (OFFICE FLOOR) - CONTINUOUS\n\n\nACTION\n\nKnowing her way around here, Miranda keeps a steady pace\nas she heads towards her old office. She turns a corner\nand stops in her tracks: another JANITOR making his\nrounds. She waits until he's out of sight and rushes to\nher office.\nShe pulls out the stolen screwdriver and brings it to the\nlock. Starts unscrewing the screws. She does this as\nfast as she can, but she's no professional -- so it takes\na few tries. She loosens one screw, then another -- and\nclumsily drops the screwdriver. The METAL ECHOES against\nthe floor.\nMiranda sucks her breath in, waits. No footsteps. She\nbends down, retrieves it, and holds onto the knob for\nbalance. It easily turns in her hand. It was open all\nalong. She simply forgot to check.\n\n\n\n\nINT. MIRANDA'S OFFICE\n\nMiranda shuts the door behind her and slips behind her\ncomputer. Shrouded in darkness. Hits a switch and a\nSURVEILLANCE MONITOR comes to life. Now she has a view\nof the corridors: two guards here, a nurse going for a\nsmoke, a janitor at the coffee machine and so on.\nShe switches on her computer and taps her fingers as she\nwaits for it to boot up.\n\n\n\n\nON SURVEILLANCE MONITOR\n\nThe JANITOR with his coffee cup now heading back towards\nMiranda's office corridor --\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                       54.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nMiranda glances at the door, can see the glare of the\ncomputer screen reflecting against the glass pane. She\ntries opening drawers but they're all locked. She\nremembers something and digs a sweatshirt from beneath\nthe couch, uses it to block the light.\nComputer powered up, she runs an online search for\n\"RACHEL PARSONS.\" Waits as the info appears --\n\n                           MIRANDA\n\n                     (to self)\n             Alright. What happened to you?\n\n\n\n\nON COMPUTER SCREEN\n\nVarious listings: The archive news of her funeral,\nsomething about her search and a LOCAL NEWS ARTICLE about\nteen suicide. That's the one she chooses. Hits \"PRINT.\"\nShe checks the surveillance monitor again:     the janitor\nnow mops right outside her door.\n\n\n\n\n\n\n\nON PRINTOUT\n\nThe heading says \"WHAT DRIVES OUR TEENAGERS TO SUICIDE?\"\nA quick glimpse gives us ages (16, 18, 17) and names of\nthree local girls who have died. Rachel's name and\nPHOTOGRAPH appears with two others: Jenny Dixon and\nAndrea White.\nMiranda pockets it, looks back at the surveillance\nmonitor: the janitor is walking away. She watches him\ndisappear down the hall. Slowly but surely. And now the\nscreen is empty.\nBut just for a second. Because suddenly Rachel is there.\nStaring straight at her. Makes us jump.\n\n\n\n\nINT. CORRIDOR/STAIRS - MOMENTS LATER\n\nRetracing her steps, Miranda shuts her door and hits the\nstairs. Playing off the sweep of the surveillance camera.\n\n\n\n\nINT. FEMALE WARD CORRIDOR - CONTINUOUS ACTION\n\nAs she reaches the landing, she hears VOICES coming her\nway. She detours down another corridor and hides from\nview. Waits for Consuelo and a nurse to exit down the\nstaircase.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                    55.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nAnd now she turns at ANOTHER SOUND. Coming from inside\nthe room immediately behind her. Room 237. She steps to\nthe small glass pane on the door and peers inside.\n\n\n\n\n\n\n\nINT. ROOM 237\n\nIt takes a moment to adjust our eyes to the darkness but\nnow we make out TWO FIGURES in the room involved in some\nsort of struggle.\nMiranda presses her face against the glass and now sees a\nflash of metal. Something sharp. Not a knife, but a needle.\nAnd now a blur of hair yanked up by a strong arm. In the dim\nlight we can make out Chloe, eyes glazed, drooling.\nJust for a beat, because now she is slapped down on the\nbed like a rag doll and the man with the needle ENTERS\n\nFRAME.\n\n\n\n\n\n\n\n\nINT. CORRIDOR - CONTINUOUS ACTION\n\nMiranda flinches, confused. Glances down the corridor to\nensure she remains undiscovered. Then peers back in.\n\n\n\n\nINT. ROOM 237\n\nChloe on her stomach on the bed. Her pale naked skin\nmarked with scratches and bruises. The needle is stuck\nin her arm, which hangs off the side. Her mouth is open\nbut it is impossible to tell whether she is laughing or\nsobbing. Abruptly the man climbs on her, pulling off his\nT-shirt.\nAs he discards it we see that it is yellow.\n\n\n\n\nINT. CORRIDOR - CONTINUOUS ACTION\n\nDisturbed, Miranda turns away. Except now the corridor\nisn't empty. There is a JANITOR at the end. Coffee cup\nin hand. Staring at her, disconcerted.\n\n                          JANITOR\n\n             Hey!\nMiranda turns and runs.\n\n\n\n\nINT. FEMALE WARD STAIRS\n\nMiranda bolts down the stairs. THUNDERING FOOTSTEPS and\nYELLS can be heard right behind her.\n\n\n\n\n                                                      56.\n\n\n\n\n\nINT. FEMALE WARD THIRD FLOOR\n\n\n\n\nMiranda races down the empty floor towards an emergency\nexit door all the way at the end.\nTWO ORDERLIES emerge from the staircase and give chase,\nshouting for her to stop. PATIENTS holler from their\ncells, awakened by the COMMOTION.\nMiranda's heart is nearly bursting through her chest as\nshe gets closer and closer to the emergency door. Twenty\nfeet, fifteen, ten --\nWhen a side door opens and a MAN IN A YELLOW SHIRT\nappears, blocking her path. Miranda tries to avoid\ncrashing into him but carries too much momentum. Veers\nleft against the wall but the man easily tackles her and\npins her down.\nThe orderlies and an nurse arrive at the scene to find\nher screaming, hysterical. They hold her down --\n\n                         MIRANDA\n\n           It's him! It's him! Jesus\n           Christ, it's him!\nThe man in the yellow shirt acts as if he has no idea\nwhat she's talking about. Ho-hum, just another psychotic\nwoman trying to escape. A nurse prepares a needle and\nwe --\n\n                                          FADE OUT.\n\n\n\n\n\nFADE IN:\n\n\n\n\n\nINT. CONFERENCE ROOM - DAY\n\nTRACKING ALONG a long desk where the staff finish their\nmorning meeting. Parsons, Pete and Irene among others.\n\n                         PARSONS\n\n           We've transferred her to a higher\n           security room on the fifth floor.\n           That's my final concession to any\n           type of special treatment.\n\n                         PETE\n\n           And the night staff?\n\n                         IRENE\n\n           They insist her room was properly\n           locked, what else could they say?\n\n                                            (CONTINUED)\n\n\n\n\n\n                                                        57.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             Could there be any truth to her\n             claim?\n\n\n\n\n                           PARSONS\n\n             Peter, we have one hundred and\n             forty employees. Thirty-five work\n             maintenance. They all wear yellow\n             shirts, it's their uniform. I'm\n             holding a very discreet inquiry,\n             sure -- but I don't want a news\n             van parked outside day and night.\n             It makes much more sense that she\n             tried to escape and got caught,\n             doesn't it?\nPete ponders this.     It certainly seems that way.\n\n                           PETE\n\n             I perused Miranda's files on Chloe\n             McGrath -- they're damn\n             comprehensive. Maybe she was a\n             bit obsessed with her.\nIrene and Parsons share a look.     He wraps it up:\n\n                           PARSONS\n\n             The scariest gift God gave us is\n             our minds. And a bright person\n             like Miranda -- she's grasping at\n             straws here -- who knows what her\n             brain is telling her, now that\n             it's snapped.\n\n\n\n\nINT. MIRANDA'S NEW CELL - DAY\n\nA better room, in fact. This one has a view. Heavy bars\non the windows, but still. Miranda paces. Pete is\nseated, observing her deteriorating state.\n\n                           MIRANDA\n\n             Did you live here when Rachel\n             killed herself?\n\n                           PETE\n\n             Yes. As a matter of fact, I was\n             part of the search party that\n             found the body.\n\n                           MIRANDA\n\n             Phil must have been a wreck.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         58.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             You can imagine. Actually, Phil\n             was in Houston undergoing triple\n             bypass surgery when it happened.\n\n\n\nWhat was that?     Miranda reacts to this.\n\n                           MIRANDA\n\n             And this is confirmed. There are\n             hospital records and so forth?\n\n                           PETE\n\n             I'm sure there are.   Can we get\n             back on track now?\nMiranda pulls out the folded printout from her pocket.\n\n                           MIRANDA\n\n             What about these other dates, was\n             Phil here when the other girls\n             went missing and found dead?\nA disconcerted Pete looks at the article with the\npictures of Rachel and the others: Andrea White and\nJenny Dixon.\n\n                           PETE\n\n             Where are you going with this?\n             First I'm a suspect in Doug's\n             death, now what, Phil Parsons\n             murdered his own daughter?\n\n                           MIRANDA\n\n             Rachel Parsons disappeared six\n             years ago. A week later she's a\n             suicide. Andrew White, four years\n             ago, same M.O., and Jenny Dixon,\n             two years ago. Don't you find\n             that unusual?\nHe regards her. Maybe Parsons is right: she's\ndesperately grasping at straws now. Skims the article:\n\n                           PETE\n\n             What same M.O.? One jumped off a\n             bridge, one hung herself and one\n             crashed her car. Who gave you\n             this?\n\n                            MIRANDA\n\n             Not one left a suicide note. In\n             fact, how is anybody sure these\n             were suicides?\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        59.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             You heard Phil, his daughter had\n             tried several times before --\n\n\n\n\n                           MIRANDA\n\n             That's his story. I need to talk\n             to the reporter who wrote that.\n             Frank something.\n\n                           PETE\n\n             Well, you can't.\n\n                           MIRANDA\n\n             I beg to differ. I know my\n             visitation rights.\n\n                           PETE\n\n             You can't because... he died.\nMiranda snaps to attention here.\n\n                           MIRANDA\n\n             You're telling me the one local\n             investigative reporter who connected\n             three highly-suspicious deaths, just\n             happens to have conveniently died?\n\n                           PETE\n\n             Frank Albright was an eighty-year-\n             old retired sociology professor.\n                     (re: the article)\n             This is a fluff piece about\n             teenage depression and the\n             breakdown of the nuclear family.\n             You can find one in any local\n             paper, anywhere, any other week!\n\n                           MIRANDA\n\n             Don't be smug, Pete. That's one\n             thing you've never been. Rachel\n             is somehow connected to what I'm\n             going through. I don't know\n             how -- like you said, I'm not in a\n             frame of mind to process the\n             information without assistance.\n             So I'm asking you for assistance.\n\n                           PETE\n\n             Listen to me. You are not well. I\n             had hoped once you remembered the\n             murder we could deal with your\n             feelings about it but these\n             fixations:\n\n                           (MORE)\n\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                       60.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE (CONT'D)\n\n             Rachel Parsons, Chloe McGrath --\n             are self-created distractions to\n             avoid looking into yourself. And\n             the longer you --\n\n                           MIRANDA\n\n             I know this lecture like the back\n             of my hand!\n\n                            PETE\n\n             Good.   Saves me the trouble.\nDiscussion over. He raps on the door. Triple-locks come\nunlocked and an ORDERLY is there. Peter exits.\n\n\n\n\nINT. WOODWARD CORRIDOR - MOMENTS LATER\n\nPeter hurries down the corridor, passing by a nurse. The\nsame one who bandaged Miranda earlier, so let's give her\na proper name: CLAIRE. She pushes her cart into the\nelevator.\n\n\n\n\n\n\n\nINT. THIRD FLOOR CORRIDOR - DAY\n\nClaire and her cart emerge from the elevator and she\nheads down the long corridor, reaches a door and unlocks\nit.\n\n\n\n\nINT. MEDICAL SUPPLY ROOM\n\nTIGHT ON a row of drug-filled shelves. Claire parks her\ncart and kicks off her shoes. Digs a pack of smokes out\nof her stashed purse when a pair of hands grab her.\nClaire squeaks until she sees her attacker: a stoner\ntype named SIMON. Deftly unbuttoning her uniform, hands\nall over her. She means to resist but he's got such\nboyish charm.\n\n                           CLAIRE\n\n             Get off me, you dog --\n\n                           SIMON\n\n             Hell, don't go all bubbly with joy\n             or anything.\n\n                           CLAIRE\n\n             You can't be in here and you know\n             it. Nap in your car.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         61.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nShe finally twists herself out of his grasp. Points an\naccusing finger, but she's grinning. Blushing, even.\n\n                           CLAIRE\n\n             Now get out before we get busted.\nProperly reprimanded, Simon picks up his folded uniform\nand prepares to leave, head hung low.\n\n                           SIMON\n\n             You slay me, Claire.    Honest.\n\n                           CLAIRE\n\n             Sure I do, Boy Scout.\nHe exits.    She shakes her head, slips her uniform back\non.\n\n\n\n\nINT. ELEVATOR - MOMENTS LATER\n\nSimon presses the button, waits. He checks inside his\nfolded uniform where we see several stolen vials of\nsedatives. The doors begin to close when --\n\n                           CLAIRE\n\n             Hold it, Simon!\nHe hides the loot behind his back, busted.       She holds the\ndoor open and tosses him his yellow shirt.\n\n                           CLAIRE\n\n             What do you think I am, laundry\n             service?\n\n                           SIMON\n\n                     (relieved)\n             Won't happen again, ma'am.\nShe turns and exits.     The doors slide shut.   Meet our\nrapist.\n\n\n\n\n\n\n\nINT. WOODWARD CAFETERIA - DAY\n\nBustling with activity. The room is divided into two:          a\nlarge main area where the patients eat, plus a second,\nsmaller upstairs area for the staff.\nBOOM DOWN to find Miranda eating at a long table.\nShelley beside her, playing with her plastic fork. Jenna\ntaps an unlit cigarette. As usual, Irene keeps watch\nnearby.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                       62.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHELLEY\n\n             ... She'd get high on glue and\n             make me help her try on my bras.\n             Is that the strangest shit you've\n             heard?\n\n                           JENNA\n\n             Heard stranger. But she's a case.\n\n                           SHELLEY\n\n             And she always put on a happy\n             face. Man, what an optometrist.\nOptometrist?     Miranda starts to correct her, but lets it\ngo.\n\n                           JENNA\n\n             You narced her out, didn't you?\n             Boo-hoo. Bet you were a little\n             buzzed yourself.\nMiranda's gaze strays from this, um, most compelling of\nconversations and comes to rest on Chloe. Alone at\nanother table. Heavily sedated. A wreck.\nMiranda rises and walks over. Shelley waits until she's\nout of hearing range, leans in to Jenna --\n\n                           SHELLEY\n\n             All work, that woman.   Work, work,\n             work.\n\n                           JENNA\n\n             What are you talking about?\n\n                           SHELLEY\n\n             She's like an alcoholic.   But with\n             work.\n\n                          JENNA\n\n             What work?\n\n                           SHELLEY\n\n             Not safe to tell you.   Wish I\n             could.\nJenna rolls her eyes, returns to her food.\n\n\n\n\nUPSTAIRS\n\nParsons watches intrigued as Miranda sits beside Chloe\nand starts talking. From Parson's POV up above we can\nsee pretty much the entire dining area.\n\n\n\n\n                                                     63.\n\n\n\n\n\nBACK TO MIRANDA\n\n\n\n\nTrying to get Chloe's attention. But Chloe just stares\nat her untouched food, glassy-eyed.\n\n                         MIRANDA\n\n           I saw what happened. I'm sorry.\nNo reaction.\n\n                         MIRANDA\n\n           Have you told anyone?   Chloe?\nNothing.\n\n                         MIRANDA\n\n           Look, Chloe -- the person who did\n           this to you is not the devil. And\n           if you can identify him, I'll make\n           sure the motherfucker is arrested.\nNow Chloe looks at her, like something finally registers.\n\n                         CHLOE\n\n           Doctor, did you just say\n           'motherfucker'?\n\n                         MIRANDA\n\n           Do you know his name? Maybe you\n           saw a nametag on his uniform?\n           Think.\nChloe simply stares.    Finally shakes her head.\n\n                         CHLOE\n\n           Man, you must really hate me.\n\n                          MIRANDA\n\n           What?   I don't hate you.\n\n                         CHLOE\n\n           You hate me because now you're\n           just the same as me. You must\n           feel so embarrassed.\n\n                         MIRANDA\n\n           I don't hate you. And I don't\n           feel embarrassed.\n\n                         CHLOE\n\n           That's just a pat answer you have\n           because you're new at this. Trust\n           me, I know what I'm talking about.\n\n                                             (CONTINUED)\n\n\n\n\n\n                                                        64.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n                     (rising)\n             Forget it, alright? Forget we had\n             this conversation.\n\n\n\nChloe abruptly grabs her arm.     Tightly.\n\n                           CHLOE\n\n             You know what happens next?\n\n                           MIRANDA\n\n             I get the distinct feeling you're\n             going to tell me.\n\n                           CHLOE\n\n             The shock wears off and the guilt\n             kicks in. And that guilt is the\n             real motherfucker. You'll be\n             watched 24/seven, because they're\n             afraid you'll kill yourself. Dr.\n             Graham will question every harmless\n             gesture, every innocent comment, ever\n             twitch you make and eventually -- and\n             it's a fucking tedious 'eventually'\n             -- you'll stop hating yourself for\n             what you did. But what replaces that\n             hatred is this unbearable sadness. And\n             you don't lose that as long as you live.\nPUSH IN ON Miranda.     Deeply affected by Chloe's words, as\nwe --\n\n\n\n\nINT. WOODWARD INSTITUTE - VARIOUS SHOTS - DAY AND NIGHT\n\n\nMIRANDA'S RESIGNED DAILY GRIND IN QUICK DISSOLVES --\n\nA) Miranda and the other patients line up for meds in\nthe rec room.\nB) Irene keeps watch in the garden as the women get\ntheir daily fresh air.\nC) Wardens watch as each patient enters their cell at\nnight and the lights go off.\n\n\n\n\n\n\n\nINT. MIRANDA'S CELL - NIGHT\n\nEchoing an earlier scene, we are MOVING TOWARDS her --\nher pale skin visible in the dim monochromatic light.\nMiranda flicks a look this way and that, alert. Sensing\nsomething.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                    65.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Leave me alone. Go away.\nJust like a crazy person. She listens for any further\nnoise, hears none and shuts her eyes. Exhausted.\n\n                           MIRANDA\n\n             I've lost my fucking mind.   Happy\n             now?\nSilence. But now the BEDSPRINGS CREAK behind her and she\nwhips around and starts to scream as a big hand covers\nher mouth. Her eyes open wide at the sight of Simon, in\nhis yellow shirt. He shoves her against the mattress and\npresses his full weight against her. She lets out a\nmuffled scream as he uncaps a syringe with his teeth and\nbrings the plunger to her throat. Straight into her\njugular.\n\n                           SIMON\n\n                     (sotto)\n             This is gonna hurt you more than\n             it hurts me.\nShe flails and kicks desperately but he pins her down.\nThe BEDSPRINGS STRAIN violently and now he's straddling\nher, squeezing the plunger into her throat. Her eyes\nwelling up:\n\n                           SIMON\n\n                     (sotto)\n             I've always wanted to do a doctor.\nShe manages to free one hand and yanks the syringe from\nher throat. It flies to the floor. He grins, enjoying\nthis:\n\n                           SIMON\n\n                     (sotto)\n             The more you fight me, the harder\n             I get, pussycat -- so pretty\n             please, with sugar on top -- keep\n             still.\nSimon paws at her clothes as she struggles to defend\nherself. He finally slaps her free arm down. Presses\nhis knee against it, immobilizing her once more. Now he\nproduces another syringe from his pocket. Checks it.\nMiranda shakes her head, pleading. A scream stuck in her\nthroat. But nobody can hear her.\nSimon brings the syringe towards her when suddenly we\nhear a LOUD CLANGING at the door. Shaking it off its\nhinges.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                       66.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nSimon looks up, confused. Nobody is there. The split-\nsecond distraction is all Miranda needs to shove him off\nthe bed. She fumbles for the discarded syringe and STABS\nHIS CHEST WITH IT -- squeezes the plunger --\n\n\n\n\n                           MIRANDA\n\n                     (sotto)\n             Take that, son of a bitch.\nSimon moans as the full dose hits his system and his body\ngoes limp. Miranda exhales, coming back to herself. A\nbeat.\n\n                           MIRANDA\n\n             Rachel?\nNo response.     Miranda grabs his keys, begins to undress\nhim.\n\n                                             CUT TO:\n\n\n\n\n\nSECURITY CAMERA POV\n\nshows a uniformed janitor calmly walking down the\ncorridor. PULL BACK to see we are in --\n\n\n\n\n\n\n\nINT. SURVEILLANCE BOOTH - NIGHT\n\nA bank of monitors keep watch on the premises   after dark.\nTWO GUARDS play cards (Uno), bored to tears.    A cursory\nglance at the monitors produces no reaction.    Certainly a\njanitor walking down the corridor is no cause   for alarm.\n\n\n\n\nEXT. PARKING LOT - NIGHT\n\nDead quiet. CRICKETS CHIRP or whatever it is    crickets\ndo. Miranda steadies her breathing, perusing    rows of\nunfamiliar cars. She clicks Simon's key-ring    button\nrepeatedly until a set of headlights blink on   and off.\n\n\n\n\nINT. SIMON'S CAR - NIGHT\n\nMiranda slips behind the wheel, STARTS the CAR. The RADIO\nKICKS IN at EAR-DEAFENING VOLUME. She nearly drops dead.\n\n\n\n\nEXT. WOODWARD GATE - NIGHT\n\nThe gate GUARD reads a magazine as Miranda's stolen car\napproaches. The guard barely registers the driver in the\nbooth mirror, immersed in his article. Hits a button to\nopen the gate for him. It opens SLOWLY. S-l-o-w-l-y.\n\n\n\n\n                                                   67.\n\n\n\n\n\nINT. SIMON'S CAR - MOVING - NIGHT\n\n\n\n\nMiranda, sweating, watches the receding image of the\ninstitute behind her. Turns on the main road. Free.\n\n                        MIRANDA\n\n          Thank you, thank you, thank you.\nShe glances back, makes sure no one is following her.\nCatches her own reflection in the rearview mirror: the\nscared eyes, the haunted face. The new version of\nherself.\nShe flips the RADIO dial: BAD NEW AGE MUZAK. BAD\nCOUNTRY. BAD DISCO. More BAD NEW AGE MUZAK. She finds\nIGGY POP'S entirely appropriate \"THE PASSENGER) and lets\nit play.\n\n\n\n\nANOTHER ANGLE\n\nNow we are seeing her as if from the POV of someone\ntraveling alongside the car. Peering THROUGH the\npassenger window. Miranda becomes aware of this, slowly\nglances over. Sees nothing but her own reflection.\nTurns back forward.\nWe NOTICE the blue cigarette lighter key chain dangling\noff the dashboard. Nothing but a long stretch of road\nahead.\n\n\n\n\n\n\n\nEXT. MIRANDA AND DOUG'S HOUSE - NIGHT\n\nThe neighborhood perfectly quiet late at night. Miranda\nparks in the driveway and stares at the empty house.\nSteels herself, climbs out of the car and heads around\nback.\nShe finds her SPARE KEY behind a potted plant, takes a\ndeep breath and lets herself in through the back door.\n\n\n\n\nINT. MIRANDA AND DOUG'S HOUSE\n\nPOLICE CRIME-SCENE TAPE everywhere. She turns on the\nkitchen light only and scurries to her bedroom without\neven looking in the direction of the living room,\navoiding the scene of the gruesome crime altogether.\nEerie as hell --\n\n\n\n\nINT. BEDROOM - QUICK CUTS\n\nMiranda stuffs clothes into a suitcase, finds her passport,\ndigs out some cash from a box. Quick change of clothes to\nget rid of the rapist's uniform. Fast, fast, fast --\n\n\n\n\n                                                       68.\n\n\n\n\n\nINT. SIMON'S CAR - MOVING - NIGHT\n\n\n\n\nMiranda watches her house fade from view in the rearview\nmirror as she drives down the block. Shudders. Flips\nthe RADIO dial with shaky hands.\n\n\n\n\n                          RADIO DJ (V.O.)\n\n            ... Weather forecasters predict\n            heavy winds tonight as a major\n            thunderstorm rolls in tomorrow.\n            You're listening to KLPG, 101.4 on\n            your dial. This next honky-tonk\n            heartbreak classic is...\nShe looks in the rearview mirror once more.      Only this\ntime she is met by a piercing pair of eyes.\nRachel's.     Inside the car.\nRachel's mouth opens unnaturally wide, revealing a gaping\nabyss of rotted teeth and flesh -- and lets out the wet\nsound. A threatening howl this time, pure venom.\nMiranda covers her face, jerks the car. It does a 180\nand slides to a halt in the middle of the street --\nFacing the direction of her house again.\n\n\n\n\nEXT. STREET\n\nMiranda jumps out, panicked. Glances around. Looks\ninside the car: no Rachel. A beat to catch her breath,\nmaking up her mind. Slides behind the wheel and makes a\nU-turn.\n\n\n\n\n\n\n\nINT. SIMON'S CAR - MOVING - CONTINUOUS ACTION\n\nMiranda flips the rearview mirror so it faces the ceiling\nand turns UP the RADIO. GUNS the pedal. Freaked.\nShe's driven maybe 20 feet when suddenly her ENGINE DIES --\n\n                          MIRANDA\n\n            No.\nThe CAR SPUTTERS to a stop. Miranda goes to turn the key\nbut suddenly freezes. Looks at the ignition oddly and\nnotices the key is gone.\n\n                          MIRANDA\n\n            Why are you doing this to me?\nA dead-still beat. Glancing around, she is even more\nstartled to see the blue lighter key chain lying in the\nmiddle of the street.\n\n\n\n\n                                                      69.\n\n\n\n\n\nEXT. STREET - NIGHT\n\n\n\n\nMiranda opens her car door and walks down the empty\nstreet to retrieve her suddenly magical keys.\nWe watch her reach the keys, all alone out here. The\nmoment she bends down to pick it up she is blinded by the\nglare of HEADLIGHT and the ROAR OF AN ENGINE. Miranda\njumps out of the way, narrowly avoiding being flattened\nby a ROAD SWEEPER, spraying water as it goes.\nShe watches the truck disappear down the block. Heart in\nher throat. Calms her nerves and now walks over to the\npesky keys again. Smack in the middle of a puddle now.\nBOOM UP the posts harnessing power lines which surround\nthe area until we STOP ON a pair of INDUSTRIAL BOLTS\nfastened around the insulators of a thick power line.\nFrom here we see Miranda bend down and pick up her keys.\nAnd now the bolts suddenly shake off their hinges, coming\nloose right in front of our eyes -- moved by some\ninvisible force --\nMiranda tilts her head at the sound of a METALLIC SNAP\nand turns. The bolts pop out of their sockets. The LIVE\nWIRE uncoils like some gigantic serpent and swings\nstraight towards the paralyzed Miranda --\nShe looks down at her feet, ankle-deep in the puddle,\nback up at the 11,000 VOLTS OF POWER about to fry her to\na crisp and jumps out of the way at the last second. The\nwire hits the water and the monumental charge sends\nSPARKS flying in every direction. It looks like\nlightning.\nA silent, sudden beat.   That was as close as close gets.\n\n                        MIRANDA\n\n                  (fighting tears)\n          What do you want from me?\nNo sign of Rachel. Miranda yells at the air, glancing\nover her shoulder, seemingly demented:\n\n                        MIRANDA\n\n          What is it you want me to do?!!\nA moment. Miranda stranded. The stolen car in the\nmiddle of the road. And now the SQUEAK of a GATE OPENING\nabruptly. Miranda whips her head in the direction of the\nsound.\nIt's the front gate to her house. And now the front door\nSWINGS OPEN. And now the living room LIGHTS switch on.\n\n                                            (CONTINUED)\n\n\n\n\n\n                                                       70.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nClearly Rachel wants her back in the house.\n\n                           MIRANDA\n\n             I can't.\n                     (softly)\n             Please, please don't make me go\n             back in there.\nBut even as she's saying this her feet are moving towards\nit. She pauses, looks at the car in the middle of the\nroad. Looks at the fizzling puddle where she was almost\nelectrocuted. No neighbors have come out to investigate\nyet, but how long can that last? She walks to the car.\n\n\n\n\nINT. SIMON'S CAR\n\nMiranda climbs in, not sure whether to laugh or cry here.\nShe's never asked a ghost for permission before:\n\n                           MIRANDA\n\n             Bear with me, I'm just parking it\n             out of the way so it won't look\n             suspicious in the middle of the\n             road -- okay.\nShe STARTS the ENGINE and pulls over to the sidewalk.\n\n\n\n\n\n\n\nINT. MIRANDA AND DOUG'S HOUSE\n\nMiranda stands in her living room, staring at her\nhandiwork. Frozen with dread.\nThe blood has been cleaned up some, but the mess remains.\nThe upturned furniture covered in plastic, the chalk\noutline of the body, the yellow crime-scene tape, the\nshattered mirror above the fireplace, the muddied\nfootprints of dozens of cops, coroners, etc.\nThe faded writing on the wall:       \"NOT ALONE.\"\nMiranda takes it all in, not entirely sure what she's\nsupposed to be looking for.\n\n                            MIRANDA\n\n                     (piecing it together)\n             Not alone. What happened to you\n             happened to other girls.\n                     (beat)\n             I understand. And I'm sorry. But\n             there is nothing I can do about it\n             now. It has nothing to do with\n             me.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         71.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nNot knowing what else to do, she turns to exit when the\nTELEVISION SET suddenly COMES TO LIFE, making her jump.\nThe unmistakable MUSIC from some old WB cartoon at FULL\n\nBLAST.\n\n\n\n\nShe stares at the TV screen. Is there some sign here she\nshould be able to follow? She crosses to turn it off and\nimmediately doubles over in pain --\n\n                            MIRANDA\n\n             Shit.\nShe looks at her foot. A big SHARD OF GLASS is stuck\nright through the flimsy hospital slipper into her skin.\nBlood already seeping from the nasty cut --\n\n\n\n\nINT. BATHROOM\n\nMiranda seated on the edge of the tub, slowly pulls out\nthe piece of glass, drops it in the wastebasket. She\ngrabs a cotton ball and alcohol and starts cleaning the\ncut.\nAnd now, FAINT at first, but GROWING LOUDER -- she hears\nthe hollow WET SOUND we've come to associate with Rachel.\nInside the room with her --\nMiranda stares at the medicine cabinet. Did the mirror\nmove? We watch her from the MIRROR POV as she holds\nperfectly still, listening. The SOUND now seems to have\nSTOPPED. A silent beat.\nShe turns her attention back to cleaning her cut, grimacing\nas the alcohol burns her skin. It looks painful.\nAnd now the slow SQUEAK of the MEDICINE CABINET DOOR makes\nher look up again. And she sees herself in the mirror like\nthe night of the slaughter: flames all around her. Naked\narms raised. Wrists shackled. Anima Sola.\nShe stares.     Mesmerized.    The sound of FLAMES GROWING\n\nLOUDER.\n\n\n                             MIRANDA\n\n             No.   No.   No...\nMiranda walks slowly to the mirror. Incredibly, the\nimage reflecting back at her also grows bigger. As if\nthe two versions of her are literally walking towards\neach other. FROM A SIDE ANGLE WE SEE both their faces\nmere inches apart. Miranda brings her fingertips to the\nmirror and touches it. Immediately pulls her hand back.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                     72.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nMiranda stares at her fingertips. The tips are burnt.\nThe skin sizzles softly. 200 percent scientifically\nimpossible. And when she looks up at the mirror again --\nthe image is gone.\n\n\n\nIt is now deathly quiet. And what she finds herself\nstaring at in the mirror is the reflection of something\njust behind her. A folded newspaper discarded in the far\ncorner of the room.\nShe turns to look at it now. It's opened to the REALTY\nLISTINGS page. Doug must have left it there. She picks\nit up and looks closer: Focusing on a picture of a bank-\nrepossessed property.\nThe address is in Willows Creek.\nHer brain wires start clicking. This must be what Rachel\nwanted her to see. She stares at it.\nPUSH IN ON the picture as we --\n\n                                     MATCH CUT TO:\n\n\n\n\n\nEXT. WILLOWS CREEK PROPERTY - DAWN\n\nA \"FOR SALE\" sign still flapping in the wind.   The first\nfew rays of light break through the dawn sky.\nMiranda's (Simon's) car approaches up the road until it\nFILLS the FRAME and parks. Miranda steps out.\nShe studies the house before walking up the drive. We\nwatch her peek through windows and walk around back,\nlooking for something. What exactly, we don't know.\n(Neither does she.)\nShe makes her way back to the starting point and fixes\nher stare now on the barn. The one place he hasn't\nlooked.\n\n\n\n\n\n\n\nINT. BARN\n\nDark, empty. The WIND outside causes the ALUMINUM SIDING\nto FLAP NOISILY. It's slightly unnerving, but hey, it's\njust the wind. Miranda covers the distance of the large\nroom, perplexed. There is something about this place.\nSomething she can't quite put her finger on. Beckoning\nher.\nWith a last fruitless look, she heads towards the front\ndoor when a glint of mental in the opposite corner stops\nher. She moves to it.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                       73.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nAnd here, where the walls should meet, there is a narrow\ngap, leading to a passage, maybe five inches wide. A\npadlocked chain has been threaded through a hole in both\nwalls, holding them together. Miranda inspects the heavy\npadlock, the source of the glint. She tugs on the wall\nand opens it to the limits of the chain, but that's only\na few inches more. Miranda peers into the darkness\nbeyond, but can't see a thing.\nHesitating only a moment, she turns sideways and slides\nherself into the claustrophobic slot.\nShe moves forward cautiously a few feet until her face\nbrushes against something hanging in the air. She stops,\nstartled. It's a pull-string hanging from a naked light\nbulb.\nShe tugs on it. And now she has 60 watts of reddish glow\nto see the hatch on the floor immediately in front of\nher. She pulls on the LATCH and it opens with a RUSTY\nCREAK. She peers into the pitch-black basement below.\nFeels around for the beginning of a stepladder and climbs\ndown.\n\n\n\n\nINT. SECRET BASEMENT\n\nMiranda emerges from the ladder into total darkness.\nWhatever dim reddish light was provided by the bulb\nupstairs does not reach here. She feels around the wall\nfor a switch. Nothing.\n\n                           MIRANDA\n\n                     (to self)\n             It's not shrink-appropriate to be\n             afraid of the dark, right?\nAbruptly there's a sharp CLICK as she lights Simon's key-\nchain lighter, and the wavery light illuminates the vast\nspace. Rats scurry for cover. It takes a second to orient\nourselves. Something metallic catches the lighter's\nreflection way in back. Miranda walks towards it.\n\n                          MIRANDA\n\n             Hello?\nShe takes a few more steps until her foot hits a bulk on\nthe floor. She stops. Kneels down and in the dim half-\nlight we make out a backpack. She unzips it and rifles\nthrough it (T-shirts, underwear, Walkman) until she finds\na wallet. Opens the billfold and brings the lighter next\nto the ID: the picture belongs to a teenager named\n\n\"TRACY MARIE SEAVER.\"\n\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                    74.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Is there anybody here?   Hello?\nThe lighter in her hand is getting hot, so she lets it\nclick off. When it comes back on we see she has wrapped\na ragged T-shirt around it for insulation.\nMiranda steps deeper into the room. Up ahead, she can\nmake out the metallic thing that reflected light before.\nIt is a hook in the ceiling. And suspended from it are\nseveral heavy chains.\nLike a meat rack.\nAnd now she catches a whiff of the terrible smell and\nsees the body of the teenage girl: hanging upside down,\ntied around the hands and ankles.\nMedical training kicking in, Miranda quickly lowers the\ngirl to the ground, causing the angry rats to skitter\naway.\n\n                            MIRANDA\n\n             Go away!   Fuck off!\n(We see the following in between flicks of the lighter so\nthat we go from midnight black to wavery light in an\nalmost strobe-light effect:)\nShe checks for vital signs, pulse, heartbeat -- Miranda's\nadrenaline at full tilt --\n\n                           MIRANDA\n\n             C'mon, c'mon, c'mon --\nShe strikes the flint and brings the lighter to the\ngirl's pupils. Inspects them. Slaps her repeatedly,\nclinically.\nThe strobe effect also allows us glimpses of the\nimmediate surroundings:   household tools strewn about;\nwire cutters, pliers -- a pool of dried blood.\n\n                           MIRANDA\n\n             Wake up, Tracy, wake up --\nNothing. She unties the wires around the girl's ankles.\nThe skin swollen grotesquely around them. She shakes the\ngirl. Slowly coming to the realization that it's too\nlate.\n\n\n\n\n                                                          75.\n\n\n\n\n\nEXT. BARN - LATER\n\n\n\n\nMiranda comes crashing out of the barn, doubles over and\nthrows up. The bright light outside blinding her\nmomentarily. Her bloodshot eyes taking a moment to\nregister --\n\n\n\n\n\n\n\nTHE PATROL CAR\n\nparked in front of the house. A POLICE OFFICER\ncautiously peering inside her stolen car. He looks up\nand notices her.\nMiranda hesitates. Nowhere to run.      The officer waves.\nHis name is TURLINGTON.\n\n                         OFFICER TURLINGTON\n\n          Howdy there.\nHe says this while already strolling over.        Miranda's\nmind races a mile a minute --\n\n                        OFFICER TURLINGTON\n\n          Everything okay?\n\n                         MIRANDA\n\n          Y-yes.\n\n                        OFFICER TURLINGTON\n\n          That your vehicle, ma'am?\nShe stares at the young, friendly cop. His left hand\nresting on his belt. Right next to his gun. But it\nseems as if he has no idea who she is. At least not yet.\n\n                        MIRANDA\n\n          Yes -- I -- I just pulled over.     I\n          was -- looking for a bathroom.\n          Morning sickness, you know...\n\n                        OFFICER TURLINGTON\n\n          Congratulations. But I'm afraid\n          this is private property -- you\n          can't just waltz on in. You\n          understand that.\nShe nods, nerves shot to hell.     Starts walking.\n\n                        MIRANDA\n\n          I'll be on my merry way now. My\n          husband will never forgive me if I\n          get a ticket for trespassing.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         76.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nThe cop nods at that, seeming to have a fair grasp of\nmarital dynamics. He flashes a smile but suddenly stops,\nwhips out his gun and trains it on her --\n\n\n\n\n                           OFFICER TURLINGTON\n\n             Holy shit.\n                     (clicks the safety\n                      off)\n             Lady, stay right where you are.\nMiranda shuts her eyes, busted.     Freezes.\n\n                           OFFICER TURLINGTON\n\n             Hands up where I can see them.\nMiranda awkwardly raises her shaky hands.\n\n                           OFFICER TURLINGTON\n\n             Nice and slow, start talking to\n             me. And make it good. Tell me\n             just exactly who that is.\nA confused Miranda slowly turns in the direction he's\nlooking to see Tracy Seaver at the barn door. Dragging\nherself in agony, clearly in a severe state of shock.\nBattered, yet somehow -- incredibly -- still alive.\nBut just barely.\n\n\n\n\nEXT. JACKSON HOSPITAL - DAY\n\nA car pulls up to the chaotic ER area.       Phil Parsons and\nPete step out, rush inside.\n\n\n\n\n\n\n\nINT. HOSPITAL ER - MEN'S ROOM - DAY\n\nSheriff Ryan is busy at the urinal. But even here he\ncan't find any peace because Teddy Howard is on his\ncase --\n\n                            SHERIFF RYAN\n\n             Mr. Howard -- let me simply list\n             the events your client was\n             involved in last night. First she\n             drugs a janitor, steals his car\n             and escapes a mental\n             institution --\n\n                           TEDDY HOWARD\n\n             Hold on, there isn't even any\n             substantial evidence --\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        77.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nSheriff Ryan zips up his pants, flushes and runs the sink\nto wash his hands --\n\n                           SHERIFF RYAN\n\n             Mr. Howard -- there isn't evidence\n             because the overdosed janitor\n             hasn't woken up, that's why -- and\n             when your client was questioned on\n             the matter she admitted to\n             injecting a full syringe of --\n\n                           TEDDY HOWARD\n\n                     (handing him a\n                      paper towel)\n             You had no right to question my\n             client without my presence --\n\n                           SHERIFF RYAN\n\n             Mr. Howard, this is not a courtroom.\n             Your client was read her rights and\n             she still insisted --\n\n                           TEDDY HOWARD\n\n             -- Let me ask you this, Sheriff:\n             what exactly was a janitor doing\n             with several vials of sedatives\n             inside my client's cell? And is\n             it not possible he had taken some\n             drugs himself before my client --\nSheriff Ryan discards the paper towel and walks out to\nthe waiting room, Teddy following closely --\n\n\n\n\nINT. ER WAITING ROOM\n\nParamedics and nurses doing their thing. The young\nofficer who arrested Miranda hands the Sheriff a cup of\ncoffee.\n\n                           SHERIFF RYAN\n\n             I'm not a drug expert. I'm simply\n             stating the frigging facts.\nSheriff Ryan burns his tongue on the coffee, notices\nParsons and Pete approaching. Relief crosses his face.\n\n                           SHERIFF RYAN\n\n             Phil, thank God -- this guy's\n             driving me nuts!\n\n                           PARSONS\n\n             What happened?\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                          78.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHERIFF RYAN\n\n             An 'incident' -- for lack of a\n             better frigging word -- involving\n             Miss Grey and a teenage girl who's\n             been tortured and is in critical\n             condition and chances are slim\n             she'll even utter another word.\n\n                           PETE\n\n             Who's the girl?\n\n                           SHERIFF RYAN\n\n             A runaway from Portland, Tracy\n             Marie Seaver. Reported missing a\n             couple weeks ago. We found Miss\n             Grey in some barn off Willows\n             Creek with the girl all messed up.\n             I'm just now waiting for the\n             surgeon to give me an update.\n                     (to Teddy)\n             Notice, Counselor, how I'm not\n             even mentioning her trespassing or\n             lying to a police officer.\nTeddy waves him off in frustration.     Goes to talk to\nTurlington.\n\n                           SHERIFF RYAN\n\n             Christ, the woman's got the entire\n             hospital busy --\nSheriff Ryan notices Teddy talking to Turlington --\n\n                           SHERIFF RYAN\n\n             Why are you harassing my deputies?\n\n                           TEDDY HOWARD\n\n             I'm only asking him where he got\n             the coffee -- ?\n\n                           SHERIFF RYAN\n\n             He's not at liberty to answer\n             that. You've had enough goddamn\n             coffee already.\nThe Sheriff leaves Pete and Parsons. They walk over to\nthe water cooler where they can talk more privately.\n\n                           PETE\n\n             We need to get Miranda back to the\n             institute. She needs psychiatric\n             care, not a prison cell.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                          79.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nParsons nods, lost in thought.        Sheriff Ryan returns.\n\n                           SHERIFF RYAN\n\n             Phil, how well does your wife know\n             the suspect?\n\n                           PARSONS\n\n             Why do you ask?\n\n                           SHERIFF RYAN\n\n             Because she's at the station right\n             now, demanding to speak with her.\nParsons frowns at this, concerned.        Pete studies him.\n\n\n\n\nINT. COUNTY STATION HOLDING CELL - DAY\n\nBare room. A desk and two chairs. Glass window         panes to\ninsure no privacy. DOROTHY PARSONS (50s) waits,        seated.\nThe door opens and a DEPUTY escorts Miranda in.        She sits\nacross from Dorothy, looking as lost as can be.        A long\nbeat.\n\n                            DOROTHY\n\n             How are you?\nMiranda doesn't answer. Her mind elsewhere.         Namely back\nat the barn and how it connects to Rachel.\n\n                           DOROTHY\n\n             I needed to see you, but I'm not\n             sure where to begin. I don't know\n             you well, I certainly have nothing\n             but fond feelings for you. Phil\n             always keeps me posted on his\n             colleagues and his work and -- in\n             any case, I have always thought of\n             you as a very bright, very\n             perceptive doctor. Even though I\n             don't know you well.\nShe pauses here. Miranda looks up now. Her face hollow\nand exhausted. Bags under her eyes. A person who has\nseen too much. Wondering where the hell this is going.\n\n                           DOROTHY\n\n             My point is, my point being --\n             when Rachel died I had, um, I\n             suffered through these spells,\n             these recurring dreams.\n\n                           (MORE)\n\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                          80.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           DOROTHY (CONT'D)\n\n             And eventually, once I came to\n             terms with her death, they went\n             away. Losing a child is the\n             hardest, most inconceivable event\n             a mother can --\nShe drifts off.     Takes a beat to collect herself and\nresume:\n\n                           DOROTHY\n\n             The past few days I have been\n             having the same dream. A\n             nightmare.\nMiranda can't help but smile to herself at that.\n\n                            MIRANDA\n\n             That word.   Nightmare.   Welcome to\n             my life.\n\n                           DOROTHY\n\n             This nightmare involves Rachel but\n             it also involves you. In the\n             nightmare Rachel holds a box in\n             her left hand. A small box. And\n             she repeats a series of numbers.\n             Now, Rachel never spoke, from the\n             time she was born -- she had a\n             condition -- I often asked God why\n             he punished this child in such a\n             way -- she couldn't speak, but she\n             was extremely bright. She wasn't\n             autistic as the doctors claimed --\nDorothy Parsons starts to cry. A moment passes like\nthis. It seems she won't recover enough to continue her\ntale.\n\n                           MIRANDA\n\n             Mrs. Parsons, you need a\n             therapist. Normally I would\n             encourage you to schedule a\n             session with me but as you can\n             see --\nDorothy shakes her head, determined to finish.       She pulls\nout a folded piece of paper.\n\n                           DOROTHY\n\n             Every night the same box in her\n             hand and the same numbers. I\n             wrote them down.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        81.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nShe slides the paper over. Miranda watches her\ncarefully, then looks at the piece of paper. The numbers\nare:\n\n\n\n\n1-0-2-2-0-1.\n\nA long beat.\n\n                           DOROTHY\n\n             It's a message. It's a code for\n             something. I don't know what.\n             But she wants you to have it.\nMiranda studies it. Studies this woman, who quite\nfrankly seems to have completely lost her mind. Then she\nlooks back at the numbers and is slowly hit with a\nrealization.\n\n                           MIRANDA\n\n             October 22nd, 2001. It's my\n             wedding date.\nShe stares at Dorothy, stunned. Brain click-click-\nclicking. Her wildest fears confirmed: Doug is behind\nthis somehow.\n\n                            MIRANDA\n\n             That code belongs to a safety\n             deposit box my husband kept in a\n             bank up in Newcastle, that's where\n             his parents live.\n                     (beat)\n             Dorothy, I need you to drive up\n             there and open it.\nDorothy stares at her, scared.     And finally nods.\n\n\n\n\nEXT. WOODWARD INSTITUTE - DAY\n\nPete hurries down the front steps of the main building as\nTWO POLICE CRUISERS pull up. Miranda is brought out of\none of the cruisers by two OFFICERS.\n\n                           PETE\n\n             We can take those off now.\nSheriff Ryan leans out of the other cruiser.\n\n                            SHERIFF RYAN\n\n             Don't push it, Doctor. She's\n             cuffed until your people secure\n             her in a cell.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                           82.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nPete sighs, gestures for the officers to bring her in.\nIrene and two heavy-duty orderlies will also be part of\nthe escort. Miranda locks eyes with Pete as she\napproaches.\n\n\n\n\n                           PETE\n\n             Are you alright?\n\n                           MIRANDA\n\n                     (quietly)\n             I was wrong. It wasn't Phil\n             Parsons. It was Doug.\n\n                           PETE\n\n             Can we talk about this later?\n                     (to Sheriff)\n             Thanks, Sheriff.\n\n                           SHERIFF RYAN\n\n             Tomorrow morning first thing my\n             deputies are here.\n\n                           PETE\n\n             I know, I know. We'll see you\n             then.\n\n                           SHERIFF RYAN\n\n             And my offer still stands if you\n             need added security.\n\n                           PETE\n\n             Thank you. She won't go anywhere.\n             I guarantee it.\nThe Sheriff waves, whatever. Knocks twice on the hood\nand the officer behind the wheel shifts into drive.\n\n                           MIRANDA\n\n             That's why Rachel picked me.    It\n             was Doug. I'm so stupid.\nPete regards her now, has no idea what she's going on\nabout this time. Tries to remain professional.\n\n                             PETE\n\n             Inside, okay?\n\n\n\n\nINT. CAFETERIA - MOMENTS LATER\n\nLunch time for the female wing. An excited Shelley\nrushes over to a table where Chloe and Jenna are,\nwhispers something to them. They glance at the door.\n\n                                                  (CONTINUED)\n\n\n\n\n\n                                                        83.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nA moment later, Miranda walks in with her police escort.\nTaking her across the cafeteria towards the back door.\nAn uneasy Pete leads. Irene and the wardens at the rear.\n\n\n\nMiranda glances at the women staring at her like a\nspecimen. Like somehow she's even more dangerous than\nthem. Top dog, as it were, of the crazies.\nAnd then, halfway across the room, one of the women\nstands up. Chloe. She claps her hands together.\nSlowly. Miranda watches her, confused. And slowly\nShelly, Jenna and others rise as well. All of them\njoining Chloe in clapping.\n\n                             PETE\n\n             What is this?\n\n                           IRENE\n\n             She's a hero. Little Red Riding\n             Hood put the big bad wolf in a\n             coma.\nPete nods.     Just what he needed.   The OFFICERS trade looks.\n\n                           OFFICER #1\n\n             They're not gonna start something,\n             are they?\nIrene shakes her head, amused.\n\n                           IRENE\n\n             You ain't scared of a bunch of\n             women now, are you, Officer?\nThe entire cafeteria is on their feet showing their\nsolidarity for Miranda. Chloe locks eyes with her,\nmouths the words \"thank you.\"\nAnd Miranda is hauled out the side door.\n\n\n\n\nINT. MIRANDA'S NEW CELL\n\nWhite. Surveillance cameras in every corner. Two\nseparate doors with elaborate locks. High security all\naround. The officers undo Miranda's cuffs and excuse\nthemselves.\nPete gestures for Irene and the Orderlies to leave as\nwell.\n\n                           ORDERLY #1\n\n             We'll be right outside, Doctor.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         84.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nOnce the doors are locked and they're alone, the\nconversation jumps straight into frustrated high gear:\n\n                           PETE\n\n             I pulled a lot of strings to get\n             you transferred back. The best\n             case scenario you're looking at\n             right now is five years here.\n             Five. Under my --\n\n                           MIRANDA\n\n                     (interrupting)\n             Peter, I didn't believe in ghosts\n             before this. And neither do you.\nPete is at the end of his rope. Can't hide his sadness\nwhen he looks at her. Still, he tries to get her back on\ntrack:\n\n                           PETE\n\n             But you know that the brain is\n             fully capable of tricking you into\n             seeing all sorts of things. The\n             simplest chemical deficiencies\n             can --\n\n                           MIRANDA\n\n             Chemical deficiencies can't get\n             inside of you and make you do\n             terrible things you don't remember\n             doing!\n\n                            PETE\n\n             I'm a very open-minded person, but\n             as a doctor --\n\n                           MIRANDA\n\n             No, you're not. You're a close-\n             minded academic, just like me.\n             You told me once that I was the\n             most logical person you knew,\n             remember? Well, everything that's\n             happened has an explanation but it\n             has nothing to do with psychiatry\n             or science. Rachel Parsons was\n             abducted and she was murdered six\n             years ago -- tossed off the Ashley\n             Bridge by my husband. My\n             harmless, righteous 'community\n             leader' husband -- that's how\n             pathetically blind I've been.\n\n                           (MORE)\n\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                       85.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA (CONT'D)\n\n             Andrea White and Jenny Dixon were\n             also abducted and murdered -- now\n             this was before I met Doug but I\n             bet you anything that they both\n             went to his school. Then he\n             obviously stopped for a while:\n             fear, guilt, distractions --\n             namely me -- delayed him from\n             reverting to his sickness. That's\n             why I didn't notice anything. I\n             believe he really tried to lead a\n             normal life, for me. Then along\n             comes Tracy Seaver and he can't\n             resist. Locks her up and tortures\n             her in some abandoned property --\nShe shows him the crumpled newspaper listing.\n\n                           MIRANDA\n\n             Here's Doug's interest in real\n             estate, Pete.\nPete stares at the realty listing for Willows Creek.\n\n                           MIRANDA\n\n             Rachel Parsons is a pissed-off\n             ghost with an agenda, furious at\n             her parents for giving up on\n             her -- she's been trying to\n             communicate with them for years\n             but they're too goddamn logical to\n             pay attention -- and she picked\n             me, she sought me out that night\n             and sent me home to fix her\n             problem. Made sure I killed Doug\n             because he was going to do the\n             same thing to Tracy Seaver as he\n             did to her. And she will get rid\n             of anyone who stands in her way.\nPete takes all of this in.     Dumbfounded.\n\n                           PETE\n\n             Is that a threat?\n\n                           MIRANDA\n\n             To whom?\n\n                           PETE\n\n             To me.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                        86.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             To you? I'm telling you she\n             nearly electrocuted me when I\n             tried to leave town and she led me\n             to that barn and if I don't do\n             what she wants -- she's going to\n             kill me.\nPete can see that she's petrified. He starts to speak,\nbut she hushes him by gently placing her finger on his\nlips. The gesture is tender, almost romantic. A\nreminder of their very real connection.\n\n                           MIRANDA\n\n             I need you to at least consider\n             the possibility that I'm not\n             insane.\n                     (beat; pleading)\n             Not as a doctor. As the only\n             person I trust in this world.\n\n\n\n\nEXT. NEWCASTLE COMMUNITY BANK PARKING LOT - DAY\n\nA tense Phil and Dorothy Parsons in their parked car.\n\n                           DOROTHY\n\n             I'm not doing it for Miranda, I'm\n             doing this for Rachel.\n\n                           PARSONS\n\n             You're making a complete fool of\n             yourself. Do you realize what you\n             sound like?\nShe sighs, climbs out of the car, leaving him there.\nTakes three steps. Stops. Turns back around and lets\nhim have it:\n\n                            DOROTHY\n\n             What do I sound like, Phil? Like\n             one of your patients? Well, it's\n             probably because that's exactly\n             how you treat me. And I've had\n             enough of this deafening silence\n             between us, this exemplary\n             mourning in front of the\n             community, tiptoeing around our\n             lives with you pretending Rachel\n             never existed.\nBANK CUSTOMERS walk around the argument, pretending not\nto hear. Phil is mortified. But Dorothy doesn't care:\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                       87.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           DOROTHY\n\n             I'm losing my mind. Our daughter\n             is gone and I miss her and I'm\n             angry.\n\n\n\nShe turns and storms off. Phil takes it all in for the\nfirst time. A moment later he climbs out of the car.\n\n\n\n\nINT. BANK VAULT - DAY\n\nA solemn GUARD places the safety deposit box on the table\nin the middle of the room. Steps back through the gate\nand waits. Dorothy and Phil stare at the box for a\nmoment.\nFinally, Phil punches in the code written out by his wife\nand opens it. He sorts through some paperwork that means\nnothing to him until his hands feel a thick envelope. He\nopens it and spills the contents on the table.\nIt is a stack of POLAROIDS.\nDorothy leans in and immediately her face darkens. She\ngrabs onto the table, shakily -- and is forced to sit\ndown. A horrified sob rises from deep inside her, comes\nout like the howl of a dying animal. Her husband pales,\nall blood draining from his face.\n\n\n\n\n\n\n\nEXT. WOODWARD INSTITUTE - EVENING\n\nThe sky darkens fast.     The storm moving in.\n\n\n\n\nINT. WOODWARD INSTITUTE - NURSES' STATION\n\nTHUNDER RUMBLES outside, making a tray of meds rattle.\nPAN UP to see Consuelo, the round black woman we might\nremember Chloe beating up earlier. She shakes her head.\n\n                           CONSUELO\n\n             It's gonna be an interesting\n             night.\n\n\n\n\nINT. MIRANDA'S NEW CELL\n\nMiranda looks up at the sound of the BOLT BEING DRAWN and\nthe handle unfastened. Through the door comes Consuelo,\ncarrying a tray. Sets it down by the bed.\nShe is on her way out when she pauses, stares at Miranda.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                          88.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           CONSUELO\n\n             How are we doing today?\nThat term again, \"we.\" Doctor-speak.         Miranda doesn't\nhave the energy for it:\n\n                           MIRANDA\n\n             Just fine, thank you.\n\n                           CONSUELO\n\n             The spirit is not fine.    She's\n             very unhappy.\nWhat was that? Normally Miranda would look at this woman\nas if she were crazy, but things have changed.\n\n                           MIRANDA\n\n             How -- how do you know?\n\n                            CONSUELO\n\n                     (shuts her eyes)\n             But she's only a girl. Do you\n             know her name?\n\n                              MIRANDA\n\n             Yes.   Rachel.\n\n                           CONSUELO\n\n             Have you talked to her?\n\n                           MIRANDA\n\n             Yes, I -- you could say that.\nConsuelo holds Miranda's hands firmly, \"reading\" her.\n\n                           CONSUELO\n\n             She's very, very angry. And she's\n             not finished with you yet.\n\n                           MIRANDA\n\n             I'm sure that's meant to sound\n             comforting but --\n\n                           CONSUELO\n\n             She wants to show you something.\n\n                           MIRANDA\n\n             That may be so, but I want her to\n             go away.\n\n                           CONSUELO\n\n             Then you need to protect yourself.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                          89.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             And how exactly would I do that?\n\n                           CONSUELO\n\n             Mira, first I'm gonna bring you\n             some cascarilla, it's a powder,\n             you get it anyplace, it comes from\n             eggs -- you pour it all over\n             you --\n                     (indicates)\n             Like this --\n\n                           MIRANDA\n\n             Look --\n                     (reading nametag)\n             Consuelo, I appreciate what you're\n             trying to do, but I honestly don't\n             think this ghost will go away if I\n             pour some egg powder on myself --\nConsuelo holds up a finger, hushing Miranda.      She's\nreceiving something here. Shudders.\n\n                           CONSUELO\n\n             She made you do things.   Bad\n             things, didn't she?\n\n                           MIRANDA\n\n             Yes.\n\n                           CONSUELO\n\n             And you carried this out for her.\n             She used you as a vessel...\nConsuelo's grip tightens on Miranda as we --\n\n                                         FLASH CUT TO:\n\n\n\n\n\nFLASHBACK - EXT. ASHLEY BRIDGE - NIGHT\n\nWe're back at the bridge.     Rachel pries open Miranda's\nmouth. Miranda panics:\n\n                            MIRANDA\n\n             What are you doing? I'm trying to\n             help you -- ?!\nRachel opens her mouth wide like a snake. And as Miranda\nscreams, blood starts leaking out of Rachel's wounds.\nAnd now we see it. Rachel's lips touch Miranda's and\nBREATHE HER SPIRIT INTO Miranda with a WHOOSH --\n\n\n\n\n                                                       90.\n\n\n\n\n\nINT. MIRANDA'S NEW CELL - CONTINUOUS ACTION (PRESENT)\n\n\n\n\nConsuelo lets go of Miranda's hand. Like recoiling from\nfire. Speaks in the simplest of ways. The truth:\n\n                         CONSUELO\n\n           You were possessed by her.\n\n                         MIRANDA\n\n           Yes.\n\n                         CONSUELO\n\n           Ay, probrecita. You're both in\n           terrible danger. She's scared too\n           but she can't step back into the\n           light until she finishes what she\n           started here. And now you're the\n           only person who can help her find\n           the way back.\n\n                         MIRANDA\n\n           I don't know how to do that -- I'm\n           not qualified for it. You do it.\nConsuelo crosses herself. A sign of respect for the\nsituation. But it has a chilling effect on Miranda.\n\n                         CONSUELO\n\n           Despair is the only unforgivable\n           sin. You'll be in my prayers,\n           Miranda.\nPrayers?   What good is that going to do?   Consuelo exits.\n\n\n\n\nEXT. PARSONS' HOUSE - NIGHT\n\nTwo POLICE CRUISERS parked outside.\n\n\n\n\n\n\n\nINT. PARSONS' LIVING ROOM - NIGHT\n\nA glassy-eyed Phil Parsons serves himself another Scotch,\ndevastated. The SHOT is FRAMED so that we see the\nbedroom door is open, Dorothy lying in bed, heavily\ntranquilized.\nSheriff Ryan inspects the photographs.\n\n\n\n\nON THE LURID POLAROIDS\n\nPostcards from hell: scared teenage girls in forced\nposes -- gagged, tortured -- Andrea White, Jenny Dixon,\nTracy Seaver...\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                       91.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nAnd young Rachel Parsons.\n\n                           PARSONS\n\n             This proves that her story is\n             true: my daughter appeared to her\n             in some form and guided her\n             through all this, putting things\n             right.\n\n                           SHERIFF RYAN\n\n             Come on, Phil, you of all\n             people --\n\n                           PARSONS\n\n             I of all people hold logic, reason\n             and facts above everything else.\n             And seek the truth through proof\n             and proof only.\n                     (re: pictures)\n             And what do you call that?\n\n                           SHERIFF RYAN\n\n             Has it occurred to you that maybe\n             she knew what her husband was\n             doing to those girls?\n\n                            PARSONS\n\n             No.   Frankly, it hasn't.\n\n                           SHERIFF RYAN\n\n             Maybe she couldn't stand the guilt\n             and cooked up this far-fetched\n             tale to tug at everybody's\n             heartstrings. The fact remains\n             she hacked her husband to pieces.\n\n                           PARSONS\n\n             The fact remains my daughter was\n             murdered and Miranda stopped the\n             killer. A killer who was loose\n             under your incompetent nose for\n             over six years. We don't know how\n             many future victims were spared,\n             but we do know she saved that girl\n             in the barn's life. And that's\n             more than you or I can say -- !\n\n                           SHERIFF RYAN\n\n             Calm down. For the record, that\n             girl is on a ventilator. The\n             doctors don't think she'll make it\n             through tonight.\n\n                           (MORE)\n\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                      92.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHERIFF RYAN (CONT'D)\n\n             Now, you want to stand up in a\n             courtroom and tell a judge that a\n             ghost is behind all this, that's\n             your prerogative -- but I have to\n             abide by the law. And the law\n             says Miranda Grey faces criminal\n             chargers. So here's what we're\n             going to do. I'm going to leave a\n             cruiser outside to make sure you\n             don't go anywhere tonight and two\n             of my deputies will go guard Ms.\n             Grey until tomorrow morning.\n             Phil?\nParsons doesn't respond.     His eyes far away.\n\n                           SHERIFF RYAN\n\n             There will be no breakouts, no\n             aiding and abetting, no taking the\n             law into your own hands. It'll\n             take an Act of God for Miranda\n             Grey not to show up in that\n             courtroom tomorrow. Are we clear?\nAnd now the Sheriff can see that Parsons is crying.\nQuietly, miserably. And it's a disparaging sight.\nSheriff Ryan exits. Two deputies follow, RADIOS\n\nSQUAWKING.\n\nParsons remains still for a moment, then digs a\nphotograph out of a drawer. A picture of Rachel in\nhappier times.\n\n                           PARSONS\n\n             I'm sorry. I will never forgive\n             myself for what happened to you.\n             Not as long as I live.\n                     (breaking down)\n             I miss you so much.\nHe sits there, staring at his dead daughter. Grieving.\nWE PULL BACK to see he is not alone. Rachel is watching\nhim.\n\n\n\n\nEXT. WOODWARD INSTITUTE - NIGHT\n\nThe WIND has really PICKED UP now. A massive LIGHTNING\nBOLT streaks the sky, officially announcing the storm's\nonset.\nA POLICE CRUISER pulls up to the guard gate.\n\n\n\n\n                                                            93.\n\n\n\n\n\nINT. WOODWARD SURVEILLANCE BOOTH\n\n\n\n\nPAN OFF the bank of monitors TO the same two guards we've\nseen before. Playing yet another bored card game. The\nLIGHT RAPPING on their glass door makes them look up.\n\n\n\n\n                             GUARD #1\n\n             Help you?\nTWO OFFICERS stand there.       We recognize one of them:\n\n                           OFFICER TURLINGTON\n\n             We're here on Miranda Grey detail.\nThe Guards shake their heads, chuckle.\n\n                           GUARD #1\n\n             Sixth floor. You can get a couple\n             chairs from the nurses up there.\n             A pretty decent cup of joe too.\n\n                             OFFICER TURLINGTON\n\n             Thanks, guys.\nThe Guard points at the bank of monitors.\n\n                           GUARD #1\n\n             Although why the Sheriff is making\n             you fellas waste your time is\n             beside me. We got her right here.\n             She ain't going no place.\n\n\n\n\nON MONITOR\n\nMiranda inside her pristine white cell.       Restlessly\npacing.\n\n                           OFFICER TURLINGTON\n\n             Looks perfectly harmless, doesn't\n             she?\n\n                           GUARD #1\n\n             Don't they all, Officer, don't\n             they all?\nThe men share a chuckle over that one when suddenly\nTHUNDER CRACKLES and the power goes out.\nNo monitors, no radio, no nothing.       Pitch black.\n\n                            GUARD #1\n\n             Shit.   There goes the card game.\nAbruptly there's a SERIES OF sharp CLICKS as FOUR\nFLASHLIGHTS come alive.\n\n\n\n\n                                                        94.\n\n\n\n\n\nINT. MIRANDA'S NEW CELL\n\n\n\n\nThe THUNDER outside RATTLES the WINDOW PANE. The only\nlight source being the intermittent LIGHTNING as the\n\nSTORM RAGES.\n\n\n\n\nShe paces in the dark.    Sits.   Waits.\n\n\n\n\nINT. WOODWARD INSTITUTE - STAIRS - SAME TIME\n\nThe two cops use their flashlights to hustle up the stairs.\n\n\n\n\n\n\n\nINT. MIRANDA'S NEW CELL - SAME TIME\n\n\n\n\nMiranda holds her breath, listens. And sure enough,\nsomebody else is in the room. She looks around.\n\n                          MIRANDA\n\n          No.   No.   What do you want -- ?\nAnd now LIGHTNING streaks the room and we see Rachel in\nthe corner. Staring with her dead eyes. Moving towards\nher.\n\n                         MIRANDA\n\n          I've done everything you've asked\n          me to. My life is ruined. I\n          can't take this anymore. I\n          can't...\n                   (faintly)\n          You have to step into the light,\n          Rachel. You don't belong here --\n          you don't belong...\nBut it doesn't work. Rachel keeps walking towards her.\nMiranda backs up against the wall. Trapped. Fighting\ntears --\n\n                        MIRANDA\n\n          Into the light --\n                  (loudly)\n          Can somebody come in here?       I need\n          help. Somebody, please!\n\n\n\n\nINT. WOODWARD INSTITUTE - DIFFERENT FLOOR - STAIRS -\n\n\nSAME TIME\n\nThe cops reach the landing where we see other flashlights\ndown the corridor. They walk towards them.\n\n                        IRENE\n\n          And who are you?\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        95.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           OFFICER TURLINGTON\n\n             Officer Turlington, ma'am. We're\n             supposed to sit outside Miranda\n             Grey's cell all night.\n\n\n\n\n                           IRENE\n\n             Knock yourself out. Next floor up.\n                     (loudly)\n             It's only a power outage, ladies\n             -- let's call it an early night.\nThe cops head down the corridor.\n\n\n\n\nINT. MIRANDA'S NEW CELL - SAME TIME\n\nRachel stretches out her arm to Miranda's face --\n\n                           MIRANDA\n\n             Please don't. Why are you doing\n             this? It's over. Over and done!\nRachel slowly shakes her head, places her hands on\nMiranda's eyes and shuts them --\n\n                                       FLASH CUT TO:\n\n\n\n\n\n\n\n\nMIRANDA'S VISION - ANDREA WHITE\n\nin her school uniform. Staring straight ahead. Now the\nimage is bathed in a red and blue light and we see her\nhalf-naked, bruised. Dead.\n\n                                       FLASH CUT TO:\n\n\n\n\n\nJENNY DIXON\n\nstaring AT us in her school uniform. Now abruptly she is\na hellish vision: opening her mouth in agony, also\nbathed in the strange red and blue light --\n\nEND OF MIRANDA'S VISION.\n\n\n\n\n\nINT. MIRANDA'S NEW CELL - CONTINUOUS ACTION\n\nMiranda screams at the visions.    Rachel holds her steady.\n\n                          MIRANDA\n\n             Stop it! I don't want to see\n             this! I can't help you anymore!\n             Stop it!\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                        96.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nNow a heavy RATTLING makes her turn to the door. One of\nthe HINGES has SHATTERED and the latch itself is half-\npulled from the doorframe. Relentless POUNDING on the\nother side.\n\n\n\n\n                           MIRANDA\n\n             Let me out of here! Let me out!\nThere's a deafening SOUND like a thousand bells ringing\nat once and Miranda covers her ears --\nOutside WE HEAR MURMURS, YELLS, INSTRUCTIONS --\n\n\n\n\nINT. WOODWARD INSTITUTE - CORRIDOR\n\nThe cops arrive to find every door in the corridor flung\nopen. Confused patients spill out as guards and nurses\ntry to restore order. RADIOS SQUAWK, flashlights beam\nand FOOTSTEPS fill the dark corridor as patients try to\nescape.\n\n\n\n\n\n\n\nEXT. WOODWARD INSTITUTE - VARIOUS SHOTS - NIGHT\n\nFIRE ENGINES and PATROL CARS arrive at the scene, SIRENS\nblazing. Sheriff Ryan and additional deputies rush from\ntheir cars to contain the breakout. A large SPOTLIGHT\ncomes to life. We spot Jenna making a run for the garden\nwall when the spotlight hits her. Two officers rush\nafter her.\n\n\n\n\nINT. WOODWARD INSTITUTE\n\nSheriff Ryan makes his way through the mayhem, past Irene\nhelping a patient, past nurse Claire cowering in a corner --\n\n                           SHERIFF RYAN\n\n             Christ Almighty.\nSheriff Ryan hits the stairs.\n\n\n\n\nINT. SIXTH FLOOR CORRIDOR\n\nOfficer Turlington runs down the corridor, searching\nfrantically with his flashlight --\n\n\n\n\nEXT. WOODWARD INSTITUTE - NIGHT\n\nA car pulls up at the scene.     Pete and Parsons step out.\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         97.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                          PETE\n\n             Miranda...\nPete rushes up the steps --\n\n\n\n\n\n\n\nINT. SIXTH FLOOR CORRIDOR\n\nOfficer Turlington looks inside Miranda's cell. Empty.\nAnd as he is about to speak into his walkie he spots her:\nSeated by the elevator. Holding a biting block in\nShelley's mouth as her seizing subsides.\n\n                           OFFICER\n\n                     (into radio)\n             Sheriff? I have Miss Grey right\n             here.\nHe flashes his light at her.     Miranda looks back blankly.\n\n                           OFFICER TURLINGTON\n\n             Sorry, we thought you might have\n             made a run for it.\n\n                           MIRANDA\n\n             Page Irene ASAP. This patient\n             needs her meds.\nTurlington nods. Miranda looks down at a grateful\nShelley, whose head is cradled in her lap. Brushes the\nmatted hair off her face. Carefully removes the biting\nblock, making sure Shelley is alright.\n\n                           SHELLEY\n\n                     (after a beat)\n             You're gonna get that Pulitzer\n             after all.\n\n                           MIRANDA\n\n             Shh, shh, just rest.\n\n                           SHELLEY\n\n                     (sotto, smiling)\n             I told you I could keep a secret.\n\n\n\n\n\n\n\nINT. REC ROOM - LATER\n\nThe patients are all assembled here. Flashlights galore.\nIrene and Consuelo do head counts. Guards, officers,\njanitors -- everybody. Irene points a finger at Jenna.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         98.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           IRENE\n\n             You have really disappointed me\n             tonight, Jenna --\n\n\n\n\n                           JENNA\n\n             Give me a break. You wouldn't\n             respect me if I hadn't tried --\nParsons breaks away from Turlington, heads over to Pete\nand Miranda --\n\n                           PETE\n\n             Everybody accounted for?\n\n                           PARSONS\n\n             We're doing the final count.   Now\n             they can't find the Sheriff.\nMiranda scans the near-dark room, looking for someone.\nWatches Turlington step aside to take a call on his\nradio.   Parsons regards her with newfound respect:\n\n                           PARSONS\n\n             Are you alright, Miranda?\n\n                            MIRANDA\n\n             Fine, Phil.   Thanks for asking.\nSuddenly all the policemen in the room begin to exit --\n\n                           PETE\n\n             What's going on, Officer?\n\n                            OFFICER TURLINGTON\n\n             One of your patients is holding\n             the Sheriff at gunpoint. She's in\n             the cafeteria.\nPete glances at Miranda.      She knows exactly who it is:\n\n                           MIRANDA\n\n             Chloe.\nTurlington is about to exit when Parsons stops him:\n\n                           PARSONS\n\n             I think Doctor Grey should be the\n             one to talk to her.\n\n\n\n\nINT. CAFETERIA - MOMENTS LATER\n\nThe DOOR CRASHES open and Chloe shoves the Sheriff\ninside. She has a gun pressed hard against his ear.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                          99.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHERIFF RYAN\n\n             Young lady, I don't know how you\n             think you can get out of here,\n             but --\n\n\n\n\n                           CHLOE\n\n             You're very polite for a piggy.\n             Now take off your uniform.\nSheriff Ryan hesitates.      Chloe presses the gun against\nhim.\n\n                            CHLOE\n\n             Do it quick.   I won't make fun of\n             you.\nThe sound of the UPSTAIRS DOOR BEING THROWN OPEN makes\nher glance up. She trains her flashlight at the second\nlevel, stepping behind the Sheriff to use him as cover.\n\n                           CHLOE\n\n             Nobody better fucking move up\n             there or I'll blow this piggy's\n             head off!\nHer FLASHLIGHT BEAM searches the section. Catches the\nreflection of a police shield hiding behind a table.\n\n                           CHLOE\n\n             That means you, fucko. Up on your\n             feet or I'll start by shooting his\n             ear off.\nA beat.   Officer Turlington rises.      Slow and deliberate.\n\n                           CHLOE\n\n                     (to Sheriff, sotto)\n             Tell junior the grownups are\n             talking now and he's not allowed\n             in here. Do it.\n\n                           SHERIFF RYAN\n\n             Turlington, it's alright. I\n             can -- I'm just going to --\n\n                            CHLOE\n\n             The grownups are talking.   Don't\n             paraphrase me.\n\n                           SHERIFF RYAN\n\n             The grownups are -- are talking\n             now. Just leave.\n\n                                                 (CONTINUED)\n\n\n\n\n\n                                                          100.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nA voice startles Chloe from behind, at floor level.\n\n                            MIRANDA\n\n             Chloe?   Can I talk to you?\n\n\n\nChloe flicks the flashlight to see Miranda by the door.\n\n                           CHLOE\n\n             Dreadful timing, I'm real busy.\n\n                           MIRANDA\n\n             You have to let him go.   I'm sorry.\nChloe flinches at that. Like all this multitasking is\naffecting her. She digs the gun deeper into the Sheriff's\nneck, making him cower to his knees, execution style --\n\n                           CHLOE\n\n             Look -- let's not confuse things.\n             I like you. But this is my only\n             chance.\n                     (to Sheriff)\n             Now take off that goddamn uniform\n             before I get really pissed.\nThe Sheriff glances at Miranda. Miranda nods.       The\nSheriff begins unbuttoning his shirt --\n\n                           MIRANDA\n\n             What are you going to do? Put on\n             his uniform and walk out of here?\n             Think about it, Chloe. They know\n             you have him. The place is\n             crawling with cops.\n\n                           CHLOE\n\n             What are my options? To grow old\n             in this place? It's clear they will\n             never let me go. Never. Ever.\n\n                           MIRANDA\n\n             That's not true. You have less\n             than a year left here.\n\n                           CHLOE\n\n             That's a lie! I'll never stop\n             being sick, they'll just find\n             something new that's wrong with\n             me. No wonder you doctors can't\n             help anyone -- all you have are\n             deficit columns and stupid tests\n             designed to point out what part of\n             the puzzle you think we're missing!\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         101.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nShe starts sobbing.     Letting everything go --\n\n                           MIRANDA\n\n             You're right, doctors never\n             concentrate on the things patients\n             are actually capable of. But I\n             know you, Chloe, you've been\n             through things that most people\n             don't survive. And you have a\n             wonderful future in front of you\n             if you choose it. It's up to you.\nThis gets through to Chloe.       Her grip loosens on the gun.\n\n                           MIRANDA\n\n             No more guilt, no more hatred, no\n             more unbearable sadness. You have\n             no use for any of that anymore.\n             Your life begins this very second.\n\n                             CHLOE\n\n             I'm so tired.    So goddamn tired --\nMiranda walks over and embraces her.       Chloe hands her the\ngun.\nAnd that's when the power returns.\nMiranda and Chloe frozen in their embrace. Sheriff Ryan\non his knees. In the sudden, shocking glare of returning\nlight, color abruptly re-enters the world and every\nRADIO, PHONE, FAN and MACHINE that were left on HUM TO\n\nLIFE.\n\nMiranda finds herself staring at Sheriff Ryan, bathed in\nthe glow of the flashing red and blue lights from the\ncruisers outside. The image a replica of the Andrea\nWhite and Jenny Dixon visions.\nPeeking from his half-unbuttoned shirt is the beginning\nof a chest TATTOO. Miranda slowly trains the gun on the\nSheriff, finally struck with the realization:\n\n                           MIRANDA\n\n             It was you, wasn't it?\n\n                           SHERIFF RYAN\n\n             What are you talking about?\nShe opens his shirt to reveal the tattoo: a 1950s pinup-\nstyle WOMAN SURROUNDED BY FLAMES, ARMS RAISED, SHACKLED.\nAnima Sola. Miranda's recurring vision from the night of\nthe slaughter.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                        102.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             'Not alone.' That's what Rachel\n             has been trying to tell me all\n             along. Doug was not alone. You\n             were with him. This whole time\n             it's been you. You covered up\n             their deaths to look like\n             suicides.\nThe Sheriff throws his jacket on, starts walking --\n\n                           SHERIFF RYAN\n\n             You've lost your mind.\n\n                           MIRANDA\n\n             Don't fucking move.\nThe CLICK! of a SAFETY being released makes him pause.\nHe turns to look at her. A tense beat.\n\n                           PETE (O.S.)\n\n             Miranda, don't do it!\nShe glances at Pete's pleading face and the room around\nher: cops everywhere. All guns trained on her.\nSheriff Ryan speaks low so only she can hear the\nfollowing:\n\n                           SHERIFF RYAN\n\n             And just exactly who would believe\n             you? No proof, no living witness.\n             Everybody knows you're crazy.\nMiranda's finger itches on the trigger as they face off.\nHer hand starts to shake. Sheriff Ryan turns and strides\noff. Getting away. Further. Further...\nBut as much as she wants to, she can't bring herself to\ndo it. Finally brings the gun down. The armed policemen\nrush over and disarm her, shove her to the floor and cuff\nher.\n\n                           SHERIFF RYAN\n\n             I want that woman in custody. She\n             has a judge to face in the morning.\n\n\n\n\nEXT. WOODWARD INSTITUTE - NIGHT (HEAVY RAIN)\n\nTurlington escorts a cuffed Miranda to a waiting cruiser.\nHe jumps behind the wheel and starts to pull out when\nPete suddenly taps on Miranda's window, startling her --\n\n                                               (CONTINUED)\n\n\n\n\n\n                                                         103.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           PETE\n\n             I'll call your lawyer and -- !\n\n                           OFFICER TURLINGTON\n\n             Sir, not now --\n\n                           PETE\n\n             I'll meet you at the station!\nShe shakes her head.     Mouths something Pete can't make out.\n\n                           OFFICER TURLINGTON\n\n             Sir, please --\n\n                           PETE\n\n             What?\nTurlington hits the gas. Miranda presses her face\nagainst the window so only Pete can see her say the\nfollowing:\n\n                           MIRANDA\n\n             The girl in the hospital.\nPete locks eyes with her, nods -- as the cruiser leaves.\n\n\n\n\nINT. JACKSON HOSPITAL - RECOVERING ROOM - NIGHT\n\nTracy Seaver lies unconscious, hooked up to a series of\nmachines. PULL BACK to find Pete with a young DOCTOR.\n\n                           DOCTOR\n\n             Her condition remains the same.\n             Basically that ventilator is\n             keeping her alive. We have no\n             reason to think she'll ever wake\n             up. I'm sorry.\nPete nods, disconcerted.      Stares at the girl.\n\n                           PETE\n\n             You mind if I stay here tonight?\n\n                           DOCTOR\n\n             Hey, it's a big place. The more\n             the merrier. If I can just ask\n             you to wait outside.\n\n\n\n\n\n\n\nINT. WAITING AREA\n\nThe Doctor gestures for Pete to make himself comfortable.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                           104.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           HOSPITAL LOUDSPEAKER (V.O.)\n\n             Dr. Brooks to ER. Dr. Brooks --\n\n                            DOCTOR\n\n             That's me.   Excuse me.\nThe Doctor rushes off.\n\n\n\n\nINT. RECOVERY ROOM #2\n\nLike Tracy Seaver, Simon Reynolds is hooked up to a bunch\nof machines and cables. Suddenly his EYES SHOOT OPEN and\nthe CARDIAC ALARM SQUEALS --\nTwo NURSES rush in.       The young Doctor right behind.\n\n                            NURSE #1\n\n             V-tach.\nThe EKG whipsaws. The Doctor feels for a pulse, then slaps\non the defibrillator pads, places the paddles on the chest --\n\n                            DOCTOR\n\n             Clear!\nHe begins chest compressions on Simon's heart. He spasms\nviolently once, twice -- And then it stops. The Doctor\nand Nurses stare at the monitor. Flatline.\nUnseen by them, Rachel steps out of the room.\n\n\n\n\n\n\n\nEXT. COUNTY POLICE STATION - NIGHT\n\nWE SEE Turlington and two other COPS climb in a patrol\ncar and drive off. WE MOVE INSIDE the empty station...\n\n\n\n\nINT. SHERIFF RYAN'S OFFICE\n\nSheriff Ryan takes a healthy chug from a fifth of Scotch,\nslips it back in a drawer. Stares at his hands. Steady as\na rock. Takes a deep breath. Knows what he must do next.\nA religious man despite everything, he brings his thumb\nto his forehead and crosses himself.\n\n\n\n\nINT. COUNTY STATION - HOLDING CELL - MOMENTS LATER\n\nMiranda's eyes snap open at the SOUND OF DEADBOLTS\nSLIDING UNLOCKED. Hopeful. Could this be Rachel?\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                         105.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nA looming figure appears at the door. Doesn't bother to\nshut it. Stares at her silently for a long while. And\nso begins a claustrophobic cat and mouse game:\n\n\n\n\n                           SHERIFF RYAN\n\n             How did you know?\n\n                            MIRANDA\n\n             You tell me.\n\n                           SHERIFF RYAN\n\n             This isn't one of your word\n             association games, Doctor. Did\n             Douglas tell you that night?\n\n                           MIRANDA\n\n             Why wait this long if he had?\n\n                           SHERIFF RYAN\n\n             Maybe it's your amnesia. Maybe\n             you blocked it out.\n\n                           MIRANDA\n\n             Maybe. But it seems to me that\n             it's vital you know for sure.\nHe studies her. Takes a step towards her. Miranda\nresponds by stepping back. A slow motion semicircle, if\nyou will. She eyes the open door. Tempted.\n\n                           SHERIFF RYAN\n\n             You think me and Doug are\n             monsters. That this was all a\n             carefully laid out plan with those\n             girls. But it wasn't that at all.\n             You do things sometimes and you're\n             not sure why you did them. Then\n             you realize you can live with them\n             and so can everyone else. Life\n             goes on.\n\n                           MIRANDA\n\n             If you're looking for forgiveness,\n             you came to the wrong place.\nShe's stalling, trying to keep him talking and he knows\nit.\n\n                           SHERIFF RYAN\n\n             One thing about fear is it makes\n             people say the dumbest things.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                       106.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             Be that as it may, you're afraid\n             too -- because you know killing me\n             won't solve your problems.\n\n\n\n\n                           SHERIFF RYAN\n\n             My only problem is you.\n\n                           MIRANDA\n\n             What about Parsons? And Peter?\n             They know. And that girl in the\n             hospital will never forget your\n             face. You miscalculated, now you\n             pay.\nPatience tested, he suddenly WHACKS her across the face.\n\n                           SHERIFF RYAN\n\n             I hate a bad bluffer.\nShe makes a big effort to hide how much that stung.\n\n                           MIRANDA\n\n             I sure hope that felt good because\n             you can't afford too many more\n             signs of struggle. Can you?\n\n                           SHERIFF RYAN\n\n             Go ahead, hit me back. It's what\n             you want.\n\n                           MIRANDA\n\n             No, that's what you want me to do.\n\n                           SHERIFF RYAN\n\n             Back to profiling, huh? Your\n             thought process is completely\n             transparent.\nAnd now Miranda briefly takes the reins of the\nconversation. Analyst and patient in session.      Echoing\nher opening scene with Chloe.\n\n                           MIRANDA\n\n             So we're even. You left that door\n             open so I'd try and run, it's what\n             you get off on, isn't it?\n\n                           SHERIFF RYAN\n\n             I guess we'll find out.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                        107.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           MIRANDA\n\n             And yet you have to make me look\n             like a suicide. With what, your\n             belt?\n                     (off his shrug)\n             How would I get access to a belt?\n\n                           SHERIFF RYAN\n\n             Trust me, prisoners hang themselves\n             with just about anything.\n\n                           MIRANDA\n\n             I don't think that's going to\n             satisfy you. You won't be able to\n             do this clean. You have too much\n             guilt inside.\nSMACK! Another slap across the face. Miranda's knees\nbuckle. But she remains standing. Her lip trembles.\n\n                           MIRANDA\n\n             You're losing grasp of the\n             situation. It was different with\n             those girls. I bet all they did\n             was cry and scream.\n\n                           SHERIFF RYAN\n\n             Don't worry, you'll scream.\n                     (after a beat)\n             Take off your shirt.\nThis throws her off.     She shoots a quick glance at the\ndoor.\n\n                           MIRANDA\n\n             Aren't I a little old for you?\n\n                            SHERIFF RYAN\n\n             Take it off.\nShe hesitates.    He draws his gun, tired.    Removes the\nsafety.\n\n                           MIRANDA\n\n             That's for show. You know you\n             can't shoot me.\n\n                           SHERIFF RYAN\n\n             But I can smash your teeth out and\n             make it look like you bashed your\n             head against the wall. Now shut\n             up, take off your goddamn shirt\n             and pull off your bra.\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                          108.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nMiranda is petrified now.      Running out of ways to hide\nit.\n\n                            SHERIFF RYAN\n\n             Today, Doctor.\nIn a sudden move, Miranda shoves the chair at him and\nbolts out the door. The Sheriff doesn't move to stop\nher.\n\n\n\n\nINT. HALLWAY TO CELL AREA - CONTINUOUS ACTION\n\nMiranda dashes down the hallway, trying to escape. Takes\nquick inventory of the space: two more holding cells\nlike her own, a row of filing cabinets, and a storage\narea with barred windows. She makes a turn up ahead and\nreaches another gate down the corridor. A sliding gate\nthat closes off the cell area from the main station.\nShe tries the gate. Locked, naturally.       She shakes and\nbangs on it, desperate.\n\n                            MIRANDA\n\n\n             TURLINGTON!!   SOMEBODY HELP ME!!\n\nNo response. And no way to disguise the sheer panic in\nher voice. She fell for his trap. They're all alone\nhere.\n\n\n\n\n\n\n\nINT. MIRANDA'S CELL - SAME TIME\n\nRyan smiles at that. Re-holsters his weapon and walks\ntowards her, taking his time. Relishing the hunt.\n\n                           SHERIFF RYAN\n\n             Doug mentioned you were painfully\n             'modest.' But enough about you,\n             let's discuss Rachel.\n\n\n\n\nINT. HALLWAY TO CELL AREA - CONTINUOUS ACTION\n\nNow Miranda searches for a place to hide.        His FOOTSTEPS\n\nGETTING CLOSER --\n\n\n                           SHERIFF RYAN (O.S.)\n\n             She was no crippled saint. Wasn't\n             the first time she turned up at\n             Doug's house all messed up.\n\n\n\n\n                                                     109.\n\n\n\n\n\nANOTHER ANGLE\n\n\n\n\nSheriff Ryan peeks down the corridor where we last saw\nMiranda. The gate still locked. She's not there. He\ntraces her steps, clearly enjoying this:\n\n\n\n\n                        SHERIFF RYAN\n\n          Sure she was a minor, but she\n          wasn't going to let that get in\n          her way.\n\n\n\n\nINT. STORAGE AREA - SAME TIME\n\nMiranda is cramped underneath an upturned desk. The SHOT\nis FRAMED so we can see the doorway. She prays silently:\n\n                        MIRANDA\n\n                  (sotto)\n          Rachel, where are you when I need\n          you?\nClearly not here.   Sheriff Ryan's voice getting closer:\n\n                        SHERIFF RYAN (O.S.)\n\n          Those other girls -- make no\n          mistake -- they knew what they\n          were getting into.\nHe appears at the doorway now, peeks inside the room.\nSensing her in there. Miranda holds her breath.\n\n                        SHERIFF RYAN\n\n          I'm not saying they knew they were\n          going to die, but truth is, Doug and\n          I didn't know it was going to end that\n          way. It was just the natural extension\n          of that moment. So yeah, we fucked\n          them and we killed them. And we knew\n          it was wrong. Sure we did.\nHe reaches the upturned desk and flips it over with a\nCLANGING SOUND. Miranda wasn't underneath that one. She\nscrambles to the door behind him as he turns --\n\n\n\n\n\n\n\nINT. HALLWAY TO CELL AREA - CONTINUOUS ACTION\n\nShe slams the door shut on his fingers and fumbles to\nslide the deadbolt behind her when the door suddenly\nSMASHES OPEN against her, knocking her backwards onto the\nfloor --\nHe looms over her. She reaches around for anything to\ndefend herself. Nothing there. Game over --\n\n                                            (CONTINUED)\n\n\n\n\n\n                                                       110.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                             SHERIFF RYAN\n\n             It wasn't some satanic pact,\n             society didn't make us do it. But\n             I believe given the proper\n             circumstances a person is capable\n             of anything -- certainly in my\n             line of work you see it day in,\n             day out.\n                      (beat)\n             Tell you what, keep the shirt.\n             The bra will do.\nMiranda stares, helpless. The Sheriff gestures for her\nto begin. Like he has all the time in the world.\nMiranda slides up the wall and starts to unclasp her bra\nunder her shirt. Petrified --\n\n                           SHERIFF RYAN\n\n             Chin up, Doctor. You wanted to\n             get to the bottom of this and you\n             did. You followed it all the way\n             through. This is how it ends.\nHis demeanor and voice are eerily calm,    as if in a\ntrance. He takes the bra from her hand     and hangs it\naround her neck, as if helping somebody    with their tie.\nShe takes a step back and finds herself    pinned against\nthe wall --\n\n                           SHERIFF RYAN\n\n             Doug settled down once you two got\n             married. New start and all that.\n             Wanted nothing to do with this\n             runaway I'd found, Tracy Seaver --\nHe squeezes the bra tightly around her throat, choking\nher. She stares straight into his eyes -- her whole\nbody simultaneously frozen in place and shaking\nuncontrollably --\n\n                           SHERIFF RYAN\n\n             Or so he claimed. Because the\n             truth, Doc -- is people never\n             change. The son of a bitch\n             couldn't resist. I asked him to\n             dump the body and instead he went\n             found some barn to work her out of\n             his system some more. Go fucking\n             figure.\nAnd now we PAN DOWN TO see Miranda's left hand ever so\nslowly reach for his holster...\n\n                                              (CONTINUED)\n\n\n\n\n\n                                                         111.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           SHERIFF RYAN\n\n             You can't count on anyone, even\n             friends you've had your whole\n             life.\n\n\n\nThey're so close together their noses nearly touch. He\ngazes into her eyes, watching life drain out of her. He\napplies one final burst of pressure, stretching her skin\nto the point of no return --\n\n                           SHERIFF RYAN\n\n             The only soul you can ever count\n             on is yourself --\nBLAM! A GUNSHOT rings out and half his ear explodes in a\ngush of blood. He stumbles back, still on his feet,\ndazed.\nHe looks up at Miranda with the gun trained on him.\nStruggling to catch her breath. A faint smile forms on\nhis lips, somehow appreciative of this turn of events.\n\n                            SHERIFF RYAN\n\n             Why, Doctor.   That was unexpected.\nHe steps forward, almost playfully. She slowly shakes\nher head. Wraps her fingers tightly around the\ntrigger --\n\n                           SHERIFF RYAN\n\n             You sure about this?\nHe stares at her. Blood flowing from the side of his\nhead. He's now standing directly in front of Miranda's\nopen cell, weighing his options at triple speed --\n\n                           SHERIFF RYAN\n\n             You need me alive for your story\n             to stick. Be logical now. You\n             know you can't kill me.\nHe takes exactly half a step forward when Miranda drills\na BULLET through his forehead. Sheriff Ryan splays\nbackwards and lands with a crash.\n\n                           MIRANDA\n\n             Logic is overrated.\n\n\n\n\nINT. HOSPITAL - WAITING ROOM - NIGHT\n\nThe door to Tracy's room is closed. WE FIND Pete where\nwe left him, by the soda machine, fighting to stay awake.\n\n                                                (CONTINUED)\n\n\n\n\n\n                                                      112.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nMOVING TOWARD him, we COME TO REST ON the back of his\nneck. So TIGHT we can actually see the hairs on the back\nof his neck. And as he feels the SWOOSH of a cold\nwhisper, they stand up on their ends.\n\n\n\nPete turns to Tracy's room to notice that the door is now\nopen. Strange. He stands up and walks to the door.\n\n\n\n\nINT. RECOVERY ROOM #1\n\nPete looks oddly around the room.\n\n                           PETE\n\n             Anybody in here -- ?\nAs he turns, we REVEAL Rachel slipping out of the room.\nUnseen by him, of course. Pete starts to exit when Tracy\nopens her eyes. Groggily waking as if from a dream.\n\n                             TRACY SEAVER\n\n             Hello -- ?\n\n\n\n\n\n\n\nEXT. COUNTY POLICE STATION - NIGHT\n\nTurlington comes out of his cruiser, carrying a bag of\ntake-out food. Chatting with his colleagues.\n\n\n\n\nINT. HALLWAY TO SHERIFF RYAN'S OFFICE - MOMENTS LATER\n\nTurlington raps on the Sheriff's door and opens it.\n\n                             OFFICER TURLINGTON\n\n             Sheriff Ryan?\nNo sight of the man.  That's odd. Maybe he's in the\nbathroom. Turlington heads in that direction.\n\n\n\n\nINT. MEN'S ROOM - MOMENTS LATER\n\nTurlington peeks in.      checks the stalls.\n\n                             OFFICER TURLINGTON\n\n             Sheriff?\nNobody. He notices the back window is open because\nraindrops are blown in by the wind. He looks out to the\nparking lot for a moment before shutting it.\n\n\n\n\n                                                      113.\n\n\n\n\n\nINT. POLICE STATION - CORRIDOR\n\n\n\n\nThe FRONT DESK OFFICER is trying to hold back a grim Pete,\nParsons and Teddy Howard from heading to the back area.\n\n                        FRONT DESK OFFICER\n\n          I'm sorry, but nobody is allowed\n          to visit at this hour --\n\n                        PETE\n\n          Is the Sheriff here or isn't he?\n\n                        OFFICER TURLINGTON\n\n                  (reaching the scene)\n          Help you, gentlemen?\n\n                        PETE\n\n          We're here to see Miranda Grey.\n\n                        OFFICER TURLINGTON\n\n          You know full well you're not\n          allowed to see --\nTeddy Howard slaps an official-looking document on him.\n\n                        TEDDY HOWARD\n\n          That's straight from Judge\n          Wilkinson. Take us to her cell.\n\n                        FRONT DESK OFFICER\n\n          Better get the Sheriff out here.\nTurlington looks over the paperwork, confused.\n\n                        OFFICER TURLINGTON\n\n          Sheriff Ryan isn't here. His car\n          is gone too.\n\n                        PARSONS\n\n          Officer, unlock the goddamn door\n          to Miranda's cell or I'll break it\n          down myself.\nTurlington is not used to being spoken to this way,\ncertainly not by upstanding directors of psychiatric\ninstitutes. He leads the men down the corridor and\nunlocks the cell. The men wait as all three locks are\ndutifully undone and then the heavy door is slid open.\nThe men look inside and instantly stop in their tracks.\n\n\n\n\nINT. HOLDING CELL\n\nSheriff Ryan, splayed.   Very dead.\n\n                                             (CONTINUED)\n\n\n\n\n\n                                                           114.\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n                           OFFICER TURLINGTON\n\n             Jesus H. Christ.\nTeddy Howard has to look away. Pete places his hand on\nParsons' shoulder. Parsons simply glares at the dead\nman, eyes filled with hatred.\nNo sign of Miranda anywhere.        Vanished.   Like Houdini.\n\n                                            DISSOLVE TO:\n\n\n\n\n\nEXT. WOODWARD INSTITUTE - DAY\n\nCAMERA SOARS THROUGH the tall gates, PAST the guard, PAST\nthe sprinklers watering the impressive gardens. A\nTAXICAB pulls up.\n\nSUPERIMPOSE:     SIX MONTHS LATER\n\nA healthier, much happier-looking Chloe shakes Pete's\nhand at the front steps. Small suitcase by her side.\n\n                           CHLOE\n\n             Thank you for everything, Dr.\n             Graham. I'll never forget all\n             you've done for me.\n\n                           PETE\n\n             It's been my pleasure, Miss\n             McGrath. Good luck out there.\nChloe smiles.     Awkward.   Her first day out in the real\nworld.\n\n                           CHLOE\n\n             Well, I guess this is it. I hope\n             not to see you again unless it's\n             for coffee or something.\n\n                           PETE\n\n             Hey, you never know. It's a small\n             world, unless you have to clean it.\nChloe picks up her bag, climbs down the steps to her cab.\nStops midway, turns:\n\n                           CHLOE\n\n             You don't have to tell me if you\n             don't want to, but -- have you\n             ever heard anything from -- ?\nPete shakes his head. Chloe nods, climbs inside the cab.\nPete waves as it drives off. Then he pulls out a postcard\nfrom his pocket. It has a New York City postmark.\n\n\n\n\n                                                      115.\n\n\n\n\n\nINSERT - POSTCARD\n\n\n\n\n\n                        MIRANDA (V.O.)\n\n          Dear Pete. Hope this finds you on\n          both feet, preferably having been\n          promoted to director after Phil's\n          retirement. Not that you had much\n          competition, but a big hug to you\n          anyway... I was as surprised as\n          anyone to read about Sheriff\n          Ryan's suicide and the startling\n          discovery that it was he who\n          murdered my late husband. I wish\n          I could personally thank certain\n          people for their convincing\n          testimonies in the case.\n\n\n\n\nNEWSPAPER HEADLINES\n\nfly AT us under her V.O.:\nA) \"Female doctor still at large, wanted for\nquestioning,\" with a picture of Miranda underneath.\nB) \"Guilt-ridden serial killer killed accomplice, then\nkilled self: Female Doctor cleared on charges.\"\nPictures of Sheriff Ryan and Douglas Grey side by side.\nC) \"Authorities close case on dual serial killers:\ncommunity mourns murdered daughters.\" A picture of\nOfficer Turlington, Pete, and Phil Parsons at a press\nconference.\n\n                        MIRANDA (V.O.)\n\n          As for myself, I have a new name\n          now and a job working with teenage\n          girls at a runaway shelter, trying\n          to keep an open mind at the\n          horrors they tell me...\n\n\n\n\n\n\n\nEXT. CEMETERY - DAY\n\nBOOM DOWN TO a young woman kneeling down to set flowers\non a grave and we recognize her as Tracy Seaver.\nShockingly cleaned up and properly attired -- she's even\ncute.\n\n                        MIRANDA (V.O.)\n\n          Which reminds me: Consuelo the\n          Cuban witch is a keeper, don't\n          fire her. She knows things about\n          the world you and I don't.\n\n                                           (CONTINUED)\n\n\n\n\n\n                                                        116.\n\n\n\n\n\nCONTINUED:\n\n\n\n\nPULL BACK to see the gave is Rachel's, and it is\npositively overflowing with flowers. She's become\nsomething of a cause celeb in these parts. Tracy walks\nback to the retired couple holding hands, Phil and\nDorothy Parsons.\n\n                           MIRANDA (V.O.)\n\n             Well, gotta run now, I have some\n             country songs to write and lots of\n             social invites to decline...\nSTILL PULLING BACK THROUGH the lush cemetery, PAST\nseveral trees until we find Rachel watching the serene\nscene. She turns TO CAMERA now and we PUSH INTO her\neyes, finally at peace, until it FILLS the SCREEN and in\nit we see...\n\n\n\n\nEXT. BLEEKER STREET (NYC) - DAY\n\nMiranda walking among the throng of pedestrians. She\nlooks confident, relaxed, down to earth. No longer the\ntightly wound professional at the beginning of our story.\n\n                           MIRANDA (V.O.)\n\n             P.S. And in case you're wondering\n             what the chances are of me buying\n             you a beer and maybe finishing\n             something we almost started, the\n             answer is: it's just not going to\n             happen. Especially not at\n             McSorley's next Friday night. Say\n             around nine. So you probably\n             shouldn't bother showing up. All\n             my love, M.G.\nShe turns at the light and gets lost in the crowd.\n\n\n\n\n                                            FADE OUT.\n\n\n\n\n\n\n\n\n                           THE END\n\n\n\n\n\n\n\n\n\n\nGothika\nWriters :   Sebastian Gutierrez\nGenres :   Horror  Thriller  Mystery\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:10.074208"}