{"title": "Grapes of Wrath, The", "film_link": "/Movie Scripts/Grapes of Wrath, The Script.html", "script_link": "/scripts/Grapes-of-Wrath,-The.html", "info_raw": "\n\nGrapes of Wrath, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Nunnally Johnson\nGenres  Drama\n\nRead \"Grapes of Wrath, The\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nTHE GRAPES OF WRATH\n\n\n                                  \"THE GRAPES OF WRATH\"\n\n                                        Screenplay\n\n                                            by\n\n                                     Nunnally Johnson\n\n                         Based on the Novel \"The Grapes Of Wrath\"\n\n                                            By\n\n                                      John Steinbeck\n\n                \n\n               AN OKLAHOMA PAVED HIGHWAY in daylight. At some distance, \n               hoofing down the highway, comes Tom Joad. He wears a new \n               stiff suit of clothes, ill-fitting, and a stiff new cap, \n               which he gradually manages to break down into something \n               comfortable. He comes down the left side of the road, the \n               better to watch the cars that pass him. As he approaches, \n               the scene changes to a roadside short-order RESTAURANT on \n               the right side of the road. From it comes the sound of a \n               phonograph playing a 1939 popular song. In front of the eatery \n               is a huge Diesel truck labeled: OKLAHOMA CITY TRANSPORT \n               COMPANY. The driver, a heavy man with army breeches and high-\n               laced boots, comes out of the restaurant, the screen door \n               slamming behind him. He is chewing on a toothpick. A waitress \n               appears at the door, behind the screen.\n\n                                     WAITRESS\n                         When you be back?\n\n                                     DRIVER\n                         Couple a weeks. Don't do nothin' you \n                         wouldn't want me to hear about!\n\n               We see him climbing into the cab of the truck from the right \n               side. Getting behind the wheel, he is releasing the handbrake \n               when Tom appears at the driver's seat window.\n\n                                     TOM\n                         How about a lift, mister?\n\n                                     DRIVER\n                         Can't you see that sticker?\n\n               He indicates a \"No Riders\" sticker on the windshield.\n\n                                     TOM\n                         Sure I see it. But a good guy don't \n                         pay no attention to what some heel \n                         makes him stick on his truck.\n\n               After a moment of hesitation the driver releases the brake.\n\n                                     DRIVER\n                         Scrunch down on the running board \n                         till we get around the bend.\n\n               As Tom scrunches down on the running board the driver throws \n               the truck into gear and it moves.\n\n               The scene dissolves to the CAB OF THE TRUCK. It is day, and \n               Tom is seated beside the driver, who is surreptitiously eyeing \n               him, trying to confirm some suspicion--an inspection which \n               Tom ignores at first.\n\n                                     DRIVER\n                         Goin' far?\n\n                                     TOM\n                              (shaking his head)\n                         Just a few miles. I'd a walked her \n                         if my dogs wasn't pooped out.\n\n                                     DRIVER\n                         Lookin' for a job?\n\n                                     TOM\n                         No, my old man got a place, forty \n                         acres. He's a sharecropper, but we \n                         been there a long time.\n\n                                     DRIVER\n                              (after a curious glance)\n                         Oh!\n\n               Cautiously, the driver's eyes drop to Tom's feet. We see \n               TOM'S SHOES. They are prison shoes--new, stiff and bulky.\n\n               Curiosity is in the eyes of the DRIVER as they shoot a swift \n               glance at Tom. TOM is looking straight ahead, with the dead-\n               pan look that prisoners get when they are trying to conceal \n               something. The DRIVER'S eyes take in Tom's hands and the \n               stiff coat.\n\n                                     DRIVER\n                         Been doin' a job?\n\n                                     TOM\n                         Yeah.\n\n                                     DRIVER\n                         I seen your hands. You been swinging \n                         a pick or a sledge--that shines up \n                         your hands. I notice little things \n                         like that all the time.\n                              (After a pause)\n                         Got a trade?\n\n                                     TOM\n                              (evenly)\n                         Why don't you get to it, buddy?\n\n                                     DRIVER\n                              (uneasily)\n                         Get to what?\n\n                                     TOM\n                         You know what I mean. You been givin' \n                         me a goin' over ever since I got in. \n                         Whyn't you go on and ask me where I \n                         been?\n\n                                     DRIVER\n                         I don't stick my nose in nobody's \n                         business.\n\n                                     TOM\n                         Naw--not much!\n\n                                     DRIVER\n                              (a little frightened)\n                         I stay in my own yard.\n\n                                     TOM\n                              (without emotion)\n                         Listen. That big nose of yours been \n                         goin' over me like a sheep in a \n                         vegetable patch. But I ain't keepin' \n                         it a secret. I been in the \n                         penitentiary. Been there four years. \n                         Like to know anything else?\n\n                                     DRIVER\n                         You ain't got to get sore.\n\n                                     TOM\n                              (coldly)\n                         Go ahead. Ask me anything you want.\n\n                                     DRIVER\n                         I didn't mean nothing.\n\n                                     TOM\n                         Me neither. I'm just tryin' to get \n                         along without shovin' anybody around, \n                         that's all.\n                              (After a pause)\n                         See that road up ahead?\n\n                                     DRIVER\n                         Yeah.\n\n                                     TOM\n                         That's where I get off.\n\n               With a sigh of relief the driver puts his foot on the brake. \n               The TRUCK stops and Tom gets out. He look at the uneasy driver \n               contemptuously.\n\n                                     TOM\n                         You're about to bust to know what I \n                         done, ain't you?  Well, I ain't a \n                         guy to let you down.\n                              (Confidentially)\n                         Homicide!\n\n               The driver throws the truck into gear. He doesn't like this \n               at all.\n\n                                     DRIVER\n                         I never asked you!\n\n                                     TOM\n                              (as the truck moves \n                              away)\n                         Sure, but you'd a throwed a fit if I \n                         hadn't tol' you.\n\n               He looks indifferently after the truck and then starts on \n               foot down the dirt crossroad. A wind has begun to blow.\n\n               The scene dissolves to the roadside under a WILLOW TREE in \n               daylight. The wind is still blowing. Sitting on the ground, \n               his back against the tree, Casy, a long, lean man in overalls, \n               blue shirt, and one sneaker, is fixing something on the other \n               dirty sneaker. To the tune of \"Yes, Sir, That's My Baby\" he \n               is absent-mindedly singing.\n\n                                     CASY\n                         Mmmmm he's my saviour. Mmmmm my \n                         saviour, Mmmmmmmmmm my saviour now.\n                              (Looking up as Tom \n                              comes down the road)\n                         Howdy, friend.\n\n               Carrying his coat under his arm, TOM wipes his face with his \n               cap as he cuts off the road to acknowledge the greeting.\n\n                                     TOM\n                         Howdy.\n\n               He stops, grateful for the momentary relief of the shade.\n\n                                     CASY\n                         Say, ain't you young Tom Joad--ol' \n                         Tom's boy?\n\n                                     TOM\n                              (surprised)\n                         Yeah. On my way home now.\n\n                                     CASY\n                         Well, I do declare!\n                              (Grinning)\n                         I baptized you, son.\n\n                                     TOM\n                              (staring)\n                         Why, you're the preacher!\n\n                                     CASY\n                         *Used* to be. Not no more. I lost \n                         the call.\n                              (Reminiscently)\n                         But boy, I sure *used* to have it! \n                         I'd get an irrigation ditch so \n                         squirmin' full of repented sinners I \n                         pretty near *drowned* half of 'em!\n                              (Sighing)\n                         But not no more. I lost the sperit.\n\n                                     TOM\n                              (with a grin)\n                         Pa always said you was never cut out \n                         to be a preacher.\n\n                                     CASY\n                         I got nothin' to preach about no \n                         more--that's all. I ain't so sure o' \n                         things.\n\n                                     TOM\n                         Maybe you should a got yourself a \n                         wife.\n\n                                     CASY\n                              (shakes his head sadly)\n                         At my meetin's I used to get the \n                         girls glory-shoutin' till they about \n                         passed out. Then, I'd go to comfort \n                         'em--and always end up by lovin' \n                         'em. I'd feel bad, an' pray, an' \n                         pray, but it didn't do no good. Next \n                         time, do it again. I figgered there \n                         just wasn't no hope for me.\n\n                                     TOM\n                         I never let one go by me when I could \n                         catch her.\n\n                                     CASY\n                         But you wasn't a preacher. A girl \n                         was just a girl to you. But to me \n                         they was holy vessels. I was savin' \n                         their souls.\n                              (Fervently)\n                         I ast myself--what *is* this call, \n                         the Holy Sperit? Maybe *that's* love. \n                         Why, I love everybody so much I'm \n                         fit to bust sometimes!  So maybe \n                         there ain't no sin an' there ain't \n                         no virtue. There's just what people \n                         do. Some things folks do is nice, \n                         and some ain't so nice. But that's \n                         as far as any man's got a right to \n                         say.\n\n                                     TOM\n                              (after a moment, \n                              figuring there is no \n                              percentage in \n                              continuing this \n                              philosophical \n                              discussion, pulls \n                              out a flask, which \n                              he extends)\n                         Have a little snort?\n\n                                     CASY\n                              (holding the flask)\n                         Course I'll say grace if somebody \n                         sets out the food--\n                              (shaking his head)\n                         --but my heart ain't in it.\n                              (He takes a long pull)\n                         Nice drinkin' liquor.\n\n                                     TOM\n                         Ought to be. That's fact'ry liquor. \n                         Cost me a buck.\n\n                                     CASY\n                              (handing back the \n                              flask)\n                         Been out travelin' around?\n\n                                     TOM\n                         Didn't you hear? It was in the papers.\n\n                                     CASY\n                         No, I never. What?\n\n                                     TOM\n                         I been in the penitentiary for four \n                         years.\n                              (He drinks)\n\n                                     CASY\n                         Excuse me for asking.\n\n                                     TOM\n                         I don't mind any more. I'd do what I \n                         done again. I killed a guy at a dance. \n                         We was drunk. He got a knife in me \n                         and I laid him out with a shovel. \n                         Knocked his head plumb to squash.\n\n                                     CASY\n                         And you ain't ashamed?\n\n                                     TOM\n                              (shaking his head)\n                         He had a knife in me. That's why \n                         they only gave me seven years. Got \n                         out in four--parole.\n\n                                     CASY\n                         Ain't you seen your folks since then?\n\n                                     TOM\n                              (putting on his coat)\n                         No, but I aim to before sundown. \n                         Gettin' kind of excited about it, \n                         too. Which way you going?\n\n                                     CASY\n                              (putting on his sneaker)\n                         It don't matter. Ever since I lost \n                         the sperit it looks like I just as \n                         soon go one way as the other.\n                              (Rising)\n                         I'll go your way.\n\n               They pause at the edge of the shade, squint up at the sky, \n               and then move off.\n\n               The scene dissolves to the SURFACE OF A DIRT ROAD by daylight. \n               Leaves are scuttling across it. The top soil begins to fly \n               up. It is not a hard wind as yet, but it is steady and \n               persistent. Tom's and Casy's feet walk into sight.\n\n                                     TOM\n                         Maybe Ma'll have pork for supper. I \n                         ain't had pork but four times in \n                         four years--every Christmas.\n\n                                     CASY\n                         I'll be glad to see you pa. Last \n                         time I seen him was at a baptizin', \n                         an' he had one a the bigges' doses \n                         of the Holy Sperit I ever seen. He \n                         go to jumpin' over bushes, howlin' \n                         like a dog-wolf in moon-time. Fin'ly \n                         he picks hisself out a bush big as a \n                         piana an' he let out a squawk an' \n                         took a run at that bush. Well, sir, \n                         he cleared her but he bust his leg \n                         snap in two. They was a travellin' \n                         dentist there and he set her, an' I \n                         give her a prayin' over, but they \n                         wasn't no more Holy Sperit in your \n                         pa after that.\n\n                                     TOM\n                              (worriedly)\n                         Lissen. This wind's fixin't to *do* \n                         somepin'!\n\n                                     CASY\n                         Shore it is. It always is, this time \n                         a year.\n\n               Tom, holding his cap on his head with his hand, looks up... \n               The TOPS OF THE TREES are bending before the wind. TOM AND \n               CASY continue walking.\n\n                                     CASY\n                         Is it fur?\n\n                                     TOM\n                              (still looking back)\n                         Just around that next bend.\n\n               TOM AND CASY are almost being blown along and dust is rising \n               from the road.\n\n                                     CASY\n                              (lifting his voice \n                              above the wind)\n                         Your granma was a great one, too. \n                         The third time she got religion she \n                         go it so powerful she knocked down a \n                         full-growed deacon with her fist.\n\n                                     TOM\n                              (pointing ahead)\n                         That's our place.\n\n               The JOAD CABIN is an ancient, bleak, sway-backed building. \n               There is neither sign of life or habitation about it.\n\n                                     CASY\n                              (looking back)\n                         And it ain't any too close, either! \n                         We better run!\n\n               A DUST STORM, like a black wall, rises into the sky, moving \n               forward. TOM AND CASY are running, but looking back over \n               their shoulders as the DUST STORM nears. Dust rises from the \n               ground to join and thicken the black wall.\n\n               TOM AND CASY are seen racing down the road to the cabin, the \n               wind whipping up the dust. The two men smack open the door \n               and slam it shut after them. The screen begins to grow dark \n               as the storm sweeps over the land. It becomes black.\n\n               In THE CABIN, it is black too, but the sound is different. \n               In addition to the sound of the wind there is the soft hissing \n               of sand against the house.\n\n                                     TOM'S VOICE\n                         Ma?... Pa?... Ain't nobody here?\n                              (After a long silence)\n                         Somepin's happened.\n\n                                     CASY'S VOICE\n                         You got a match?\n\n                                     TOM'S VOICE\n                         There was some pieces of candle always \n                         on a shelf.\n\n               Presently, after shuffling about, he has found them and lights \n               one. He holds it up, lighting the room. A couple of wooden \n               boxes are on the floor, a few miserable discarded things, \n               and that's all. Tom's eyes are bewildered.\n\n                                     TOM\n                         They're all gone--or dead.\n\n                                     CASY\n                         They never wrote you nothing?\n\n                                     TOM\n                         No. They wasn't people to write.\n\n               From the floor he picks up a woman's high button shoe, curled \n               up at the toe and broken over the instep.\n\n                                     TOM\n                         This was Ma's. Had 'em for years.\n\n               Dropping the shoe, he picks up a battered felt hat.\n\n                                     TOM\n                         This used to be mine. I give it to \n                         Grampa when I went away.\n                              (To Casy)\n                         You reckon they could be dead?\n\n                                     CASY\n                         I never heard nothin' about it.\n\n               Dropping the hat, he moves with the candle toward the door \n               to the back, the only other room of the cabin. He stands in \n               the doorway, holding the candle high.\n\n               In the BACK ROOM the scene moves from Tom at the door across \n               the room to the shadows, where a skinny little man sits \n               motionless, wide-eyed, staring at Tom. His name is Muley.\n\n                                     MULEY\n                         Tommy?\n\n                                     TOM\n                              (entering)\n                         Muley! Where's my folks, Muley?\n\n                                     MULEY\n                              (dully)\n                         They gone.\n\n                                     TOM\n                              (irritated)\n                         I know that! But *where* they gone?\n\n               Muley does not reply. He is looking up at Casy as he enters.\n\n                                     TOM\n                              (to Casy)\n                         This is Muley Graves.\n                              (To Muley)\n                         You remember the preacher, don't \n                         you?\n\n                                     CASY\n                         I ain't no preacher anymore.\n\n                                     TOM\n                              (impatiently)\n                         All right, you remember the *man* \n                         then.\n\n                                     MULEY AND CASY\n                         Glad to see you again. Glad to see \n                         you.\n\n                                     TOM\n                              (angrily)\n                         Now where is my folks?\n\n                                     MULEY\n                         Gone--\n                              (hastily)\n                         --over to your Uncle John's. The \n                         whole crowd of 'em, two weeks ago. \n                         But they can't stay there either, \n                         because John's got *his* notice to \n                         get off.\n\n                                     TOM\n                              (bewildered)\n                         But what's happened?  How come they \n                         got to get off? We been here fifty \n                         years--same place.\n\n                                     MULEY\n                         Ever'body got to get off. Ever'body \n                         leavin', goin' to California. My \n                         folks, your folks, ever'body's folks.\n                              (After a pause)\n                         Ever'body but me. I ain't gettin' \n                         off.\n\n                                     TOM\n                         But who done it?\n\n                                     MULEY\n                         Listen!\n                              (Impatiently Tom \n                              listens to the storm)\n                         That's some of what done it--the \n                         dusters. Started it, anyway. Blowin' \n                         like this, year after year--blowin' \n                         the land away, blowin' the crops \n                         away, blowin' us away now.\n\n                                     TOM\n                              (angrily)\n                         Are you crazy?\n\n                                     MULEY\n                              (simply)\n                         Some say I am.\n                              (After a pause)\n                         You want to hear what happened?\n\n                                     TOM\n                         That's what I asked you, ain't it?\n\n               MULEY is seen at close range. Not actually crazy, Muley is a \n               little touched. His eyes rove upward as he listens to the \n               sound of the storm, the sough of the wind and the soft hiss \n               of the sand. Then...\n\n                                     MULEY\n                         The way it happens--the way it \n                         happened to me--the man come one \n                         day...\n\n               The scene dissolves to MULEY'S DOORYARD. It is a soft spring \n               day, with the peaceful sounds of the country. Seated in a \n               three-year-old touring car is THE MAN, a city man with a \n               collar and tie. He hates to do what he is doing and this \n               makes him gruff and curt, to hide his misgivings. Squatted \n               beside the car are Muley, his son-in-law, and a half-grown \n               son. At a respectful distance stand Muley's wife, his \n               daughter, with a baby in her arms, and a small barefooted \n               girl, watching worriedly. The men soberly trace marks on the \n               ground with small sticks. A hound dog sniffs at the automobile \n               wheels.\n\n                                     THE MAN\n                         Fact of the matter, Muley, after \n                         what them dusters done to the land, \n                         the tenant system don't work no more. \n                         It don't even break even, much less \n                         show a profit. One man on a tractor \n                         can handle twelve or fourteen of \n                         these places. You just pay him a \n                         wage and take *all* the crop.\n\n                                     MULEY\n                         But we couldn't *do* on any less'n \n                         what our share is now.\n                              (Looking around)\n                         The chillun ain't gettin' enough to \n                         eat as it is, and they're so ragged \n                         we'd be shamed if ever'body else's \n                         chillun wasn't the same way.\n\n                                     THE MAN\n                              (irritably)\n                         I can't help that. All I know is I \n                         got my orders. They told me to tell \n                         you you got to get off, and that's \n                         what I'm telling you.\n\n               Muley stands in anger. The two younger men pattern after \n               him.\n\n                                     MULEY\n                         You mean get off my own land?\n\n                                     THE MAN\n                         Now don't go blaming me. It ain't \n                         *my* fault.\n\n                                     SON\n                         Whose fault is it?\n\n                                     THE MAN\n                         You know who owns the land--the \n                         Shawnee Land and Cattle Company.\n\n                                     MULEY\n                         Who's the Shawnee Land and Cattle \n                         Comp'ny?\n\n                                     THE MAN\n                         It ain't nobody. It's a company.\n\n                                     SON\n                         They got a pres'dent, ain't they? \n                         They got somebody that knows what a \n                         shotgun's for, ain't they?\n\n                                     THE MAN\n                         But it ain't *his* fault, because \n                         the *bank* tells him what to do.\n\n                                     SON\n                              (angrily)\n                         All right. Where's the bank?\n\n                                     THE MAN\n                              (fretfully)\n                         Tulsa. But what's the use of picking \n                         on him? He ain't anything but the \n                         manager, and half crazy hisself, \n                         trying to keep up with his orders \n                         from the east!\n\n                                     MULEY\n                              (bewildered)\n                         Then who *do* we shoot?\n\n                                     THE MAN\n                              (stepping on the \n                              starter)\n                         Brother, I don't know. If I did I'd \n                         tell you. But I just don't know \n                         *who's* to blame!\n\n                                     MULEY\n                              (angrily)\n                         Well, I'm right here to tell you, \n                         mister, ain't *nobody* going to push \n                         me off *my* land! Grampa took up \n                         this land seventy years ago. My pa \n                         was born here. We was *all* born on \n                         it, and some of us got killed on it, \n                         and some died on it. And that's what \n                         makes it ourn--bein' born on it, and \n                         workin' it, and dyin' on it--and not \n                         no piece of paper with writin' on \n                         it! So just come on and try to push \n                         me off!\n\n               The scene dissolves to the BACK ROOM. The sound of the storm \n               is heard again as Tom and Casy watch Muley.\n\n                                     TOM\n                              (angrily)\n                         Well?\n\n                                     MULEY\n                              (without emotion)\n                         They come. They come and pushed me \n                         off.\n\n               We see MULEY at close range.\n\n                                     MULEY\n                         They come with the cats.\n\n                                     TOM'S VOICE\n                         The what?\n\n                                     MULEY\n                         The cats--the caterpillar tractors.\n\n               The scene dissolves to a MONTAGE OF TRACTORS: tractors looming \n               over hillocks, flattening fences, through gullies, their \n               drivers looking like robots, with goggles, dust masks over \n               mouth and nose--one after the other, crossing and recrossing \n               as if to convey the impression that this was an invasion of \n               machine-men from some other world.\n\n                                     MULEY'S VOICE\n                         And for ever' one of 'em ten-fifteen \n                         families gets throwed outa their \n                         homes--one hundred folks with no \n                         place to live but on the road. The \n                         Rances, the Perrys, the Peterses, \n                         the Joadses--one after another they \n                         got throwed out. Half the folks you \n                         and me know--throwed right out into \n                         the road. The one that got me come a \n                         month ago.\n\n               The scene dissolves to MULEY'S FARM. We see the backs of \n               Muley and the two younger men standing shoulder to shoulder \n               watching a lumbering tractor headed straight toward them. It \n               is at some distance. Muley holds a shotgun. His son has a \n               baling hook. The son-in-law has a two-by-four. Behind them \n               is their cabin. Frightened and huddled together are the women \n               and children. The roar of the tractor comes closer.\n\n                                     MULEY\n                              (shouting)\n                         You come any closer and I'm gonna \n                         blow you right outa that cat!\n                              (He lifts his shotgun)\n\n               The TRACTOR continues to lumber along, its driver goggled \n               and black of face where his dust mask doesn't cover. MULEY \n               lifts his shotgun to his shoulder, and aims.\n\n                                     MULEY\n                         I *tol'* you!\n\n               The TRACTOR stops. The driver takes off his goggles and dust \n               mask. Like the others he's a country boy. His face is sullen. \n               Muley is lowering his shotgun. There is a surprise in his \n               face as he recognizes the driver.\n\n                                     MULEY\n                         Why, you're Joe Davis's boy!\n\n               He moves forward, followed by his son and son-in-law in the \n               TRACTOR. Davis is wiping his face as they walk toward him.\n\n                                     DAVIS\n                         I don't like nobody drawin' a bead \n                         on me.\n\n                                     MULEY\n                         Then what are you doin' this kind a \n                         thing for--against your own people?\n\n                                     DAVIS\n                         For three dollars a day, that's what \n                         I'm doin' it for. I got two little \n                         kids. I got a wife and my wife's \n                         mother. Them people got to eat. Fust \n                         and on'y thing I got to think about \n                         is my own folks. What happens to \n                         other folks is their lookout.\n\n                                     MULEY\n                         But this is *my land*, son. Don't \n                         you understand?\n\n                                     DAVIS\n                              (putting his goggles \n                              back on)\n                         *Used* to be your land. B'longs to \n                         the comp'ny now.\n\n               We see THE WOMENFOLKS. A small girl pulls her mother's dress.\n\n                                     GIRL\n                         What's he fixin' to do, ma?\n\n                                     MA\n                         Hush!\n\n               Back to the TRACTOR AND THE MEN:\n\n                                     MULEY\n                              (grimly)\n                         Have it your own way, son, but just \n                         as sure as you touch my house with \n                         that cat I'm gonna blow you plumb to \n                         kingdom come.\n\n                                     DAVIS\n                              (contemptuously)\n                         You ain't gonna blow nobody nowhere. \n                         First place, you'd get hung and you \n                         know it. For another, it wouldn't be \n                         two days before they'd have another \n                         guy here to take my place.\n\n               And the tractor roars into slow motion again...\n\n               We see the HOUSE AND TRACTOR. The womenfolks scamper out of \n               the way as the tractor heads for a corner of the house. It \n               goes over a ramshackle fence and then a feeble little flower \n               bed. Muley and the two younger men walk along. Breathing \n               hard, frightened and desperate, Muley is shouting warnings \n               at Davis, but the roar of the tractor drowns his voice. The \n               dog barks excitedly, snarling at the tractor. THE WOMENFOLKS \n               stand watching, terrified but dead pan, until a cry bursts \n               from Muley's wife.\n\n                                     WIFE\n                         Don't! Please don't!\n\n               The little girl begins to whimper.\n\n                                     MULEY\n                         I'm tellin' you!\n\n               The TRACTOR moves across the yard, nosing a chair out of the \n               way, and with a rending of boards hits a corner of the house, \n               knocking a part of the foundation away. The corner of the \n               house sinks. MULEY lifts his shotgun, aims it, holds it, and \n               then slowly lowers it. As he stands looking at what has \n               happened his shoulders sag. He seems almost to shrink.\n\n               The scene dissolves to MULEY, once more in the back room of \n               Tom's old home, as the sound of the storm continues.\n\n                                     MULEY\n                              (dully)\n                         What was the use. He was right. There \n                         wasn't a thing in the world I could \n                         do about it.\n\n                                     TOM\n                              (bewildered)\n                         But it don't seem possible--kicked \n                         off like that!\n\n                                     MULEY\n                         The rest of my fambly set out for \n                         the west--there wasn't nothin' to \n                         eat--but I couldn't leave. Somepin' \n                         wouldn't let me. So now I just wander \n                         around. Sleep wherever I am. I used \n                         to tell myself I was lookin' out for \n                         things, so when they come back \n                         ever'thing would be all right. But I \n                         knowed that wan't true. There ain't \n                         nothin' to look out for. And ain't \n                         nobody comin' back. They're gone--\n                         and me, I'm just an 'ol graveyard \n                         ghost--that's all in the world I am.\n\n               Tom rises in his agitation and bewilderment.\n\n                                     MULEY\n                         You think I'm touched.\n\n                                     CASY\n                              (sympathetically)\n                         No. You're lonely--but you ain't \n                         touched.\n\n                                     MULEY\n                         It don't matter. If I'm touched, I'm \n                         touched, and that's all there is to \n                         it.\n\n                                     TOM\n                              (still unable to grasp \n                              it all)\n                         What I can't understand is my folks \n                         takin' it! Like ma! I seen her nearly \n                         beat a peddler to death with a live \n                         chicken. She aimed to go for him \n                         with an ax she had in the other hand \n                         but she got mixed up and forgot which \n                         hand was which and when she got \n                         through with that peddler all she \n                         had left was two chicken legs.\n\n               He looks down at Muley.\n\n                                     MULEY\n                         Just a plain 'ol graveyard ghost, \n                         that's all.\n\n               His eyes are dull on the floor. The sound of the dust storm \n               continues strongly.\n\n               The scene dissolves to the EXTERIOR OF THE CABIN at night. \n               It is several hours later and the sound of the storm has \n               faded out. Now all is silence as first Tom, then Casy, and \n               finally Muley steps out of the cabin and looks around. There \n               is still a slight fog of dust in the air, and clouds of \n               powderlike dust shoot up around their feet. All three men \n               have wet rags tied over their mouths and noses.\n\n                                     TOM\n                         She's settlin'.\n\n                                     CASY\n                         What you figger to do?\n\n                                     TOM\n                         It's hard to say. Stay here till \n                         mornin' an' then go on over to Uncle \n                         John's, I reckon. After that I don't \n                         know.\n\n                                     MULEY\n                              (grabbing Tom)\n                         Listen!\n                              (Faint sound of motor)\n                         That's them! Them lights! Come on, \n                         we got to hide out!\n\n                                     TOM\n                              (angrily)\n                         Hide out for what? We ain't doin' \n                         nothin'.\n\n                                     MULEY\n                              (terrified)\n                         You're *trespassin'*! It ain't you \n                         lan' no more! An' that's the \n                         supr'tendant--with a gun!\n\n                                     CASY\n                         Come on, Tom. You're on parole.\n\n               A CAR approaches at some distance, the headlights moving up \n               and down as the car rides a dirt road.\n\n               A PART OF THE COTTON FIELD: Muley leads the way.\n\n                                     MULEY\n                         All you got to do is lay down an' \n                         watch.\n\n                                     TOM\n                              (as they lie down)\n                         Won't they come out here?\n\n                                     MULEY\n                              (snickering)\n                         I don't think so. One come out here \n                         once an' I clipped him from behin' \n                         with a fence stake. They ain't \n                         bothered since.\n\n               THE EXTERIOR OF THE CABIN: The car stops. A strong searchlight \n               flashes on and goes over the cabin.\n\n                                     MAN\n                              (in car)\n                         Muley?\n                              (After a pause)\n                         He ain't here.\n\n               The car moves on.\n\n               TOM, CASY AND MULEY lie flat, listening to the sound of the \n               car going away.\n\n                                     TOM\n                         Anybody ever 'tol me I'd be hidin' \n                         out on my own place...!\n\n               He whistles, as the scene fades out.\n\n               DRIED CORNSTALKS, seen by daylight, fade in. The cornstalks, \n               their roots blown clean and clear of the earth, lie fallen \n               in one direction. This is what has happened to farms that \n               were once rich and green. Then Uncle John's cabin comes into \n               view. It is just after sunup. The air is filled with country \n               sounds--a shrill chorus of birds, a dog barking in the \n               distance. The cabin is of the same general appearance as the \n               Joad cabin but even smaller. Smoke curls from the chimney.\n\n               We see a PLATTER ON A TABLE, inside the cabin. The platter \n               is filled with sidemeat. Over the scene comes Ma Joad's voice.\n\n                                     MA'S VOICE\n                         Lord, make us thankful for what we \n                         are about to receive, for His sake. \n                         Amen.\n\n               As she speaks, a man's scrawny hand reaches forward and sneaks \n               out a piece of sidemeat.\n\n               Five people are seated around the breakfast table on chairs \n               or boxes. They are Pa, Grampa, Granma, Noah, and Uncle John. \n               Two children, Ruthie and Winfield, stand to the table, because \n               there are no more chairs. Their heads are all bent as Ma, \n               standing with a fork in her hand between the table and the \n               stove, ends the grace. Heads lift and there is a bustle as \n               Ma turns back to the frying pork on the stove and the others \n               truck into their food. Granma points a spiteful finger at \n               Grampa.\n\n                                     GRANMA\n                         I seen you!--You et durin' grace!\n\n                                     GRAMPA\n                              (indignantly)\n                         One little ole dab!--one teeny little \n                         ole dab!\n\n               RUTHIE AND WINFIELD, though they are shoveling it in, are \n               grinning at Grampa.\n\n                                     RUTHIE\n                              (in a snickering \n                              whisper to Winfield)\n                         Ain't he messy though!\n\n                                     GRANMA\n                              (viciously)\n                         I seen him!--gobblin' away like an \n                         ole pig!\n\n                                     GRAMPA\n                         Whyn't you keep your eyes shet durin' \n                         grace, you ole...\n\n               NOAH is solemnly studying a handbill. Over his shoulder the \n               HANDBILL can be read: \"800 PICKERS WANTED--WORK IN CALIFORNIA\"\n\n               We see NOAH AND UNCLE JOHN.\n\n                                     NOAH\n                              (who is a half-wit)\n                         What's it say again?\n\n                                     JOHN\n                         Says plenty work in California--\n                         peaches. Eight hundred pickers needed.\n\n               Noah frowns at the print.\n\n                                     GRAMPA\n                              (who has mush on his \n                              mouth)\n                         Wait'll I get to California! Gonna \n                         reach up and pick me an orange \n                         whenever I want it! Or grapes. That \n                         there's somethin' I ain't *never* \n                         had enough of! Gonna get me a whole \n                         bunch a grapes off a bush and I'm \n                         gonna squash 'em all over my face \n                         and just let the juice dreen down \n                         offen my chin!\n\n                                     GRANMA\n                              (in a feeble bleat)\n                         Puh-raise the Lawd for vittory!\n\n                                     GRAMPA\n                              (expanding)\n                         Maybe I get me a whole *washtub* \n                         fulla them grapes and jest sit in \n                         'em and scrooge around till they was \n                         gone!\n                              (Sighing)\n                         I shore would like to do that!\n\n               RUTHIE AND WINFIELD are snickering. Ruthie has smeared her \n               face with mush. She pulls Winfield around to see.\n\n                                     RUTHIE\n                              (whispering)\n                         Look. I'm Grampa!\n\n               She begins to slobber in mimicry. Winfield snickers. At that \n               instant Ma enters, unobserved, and without a word give Ruthie \n               a fine wallop. Nobody else pays any attention to the slap as \n               Ma, a bucket in her hand, moves on toward the door. We see \n               her now in the BACKYARD, first at the door, then moving toward \n               the well. She stops dead still, her eyes gazing outward.\n\n               TOM is looking at the household goods piled around the yard, \n               to be taken to California. Casy is in the background. Then \n               Tom looks up and see Ma (out of the scene). His face softens. \n               He moves toward her.\n\n                                     MA\n                              (softly--her eyes \n                              closed)\n                         Thank God. Oh thank God.\n                              (In sudden terror as \n                              he approaches)\n                         Tommy, you didn't *bust* out, didya? \n                         You ain't got to hide, have you?\n\n                                     TOM\n                         No, Ma. I'm paroled. I got my papers.\n\n               With a sigh and a smile, and her eyes full of wonder, she \n               feels his arm. Her fingers touch his cheek, as if she were \n               blind. Swelling with emotion, Tom bites his lip to control \n               himself.\n\n                                     MA\n                         I was so scared we was goin' away \n                         without you--and we'd never see each \n                         other again.\n\n                                     TOM\n                         I'd a found you, Ma.\n\n               CASY, with great politeness, turns his back to the scene and \n               keeps well away from it.\n\n               TOM now looks around at the dusty furniture piled around the \n               yard.\n\n                                     TOM\n                         Muley tol' me what happened, Ma. Are \n                         we goin' to California true?\n\n                                     MA\n                         We *got* to, Tommy. But that's gonna \n                         be awright. I seen the han'bills, \n                         about how much work they is, an' \n                         high wages, too. But I gotta fin' \n                         out somepin' else first, Tommy.\n                              (Breathlessly)\n                         Did they hurt you, son? Did they \n                         hurt you an' make you mean-mad?\n\n                                     TOM\n                              (puzzled)\n                         Mad, Ma?\n\n                                     MA\n                         Sometimes they do.\n\n                                     TOM\n                              (gently)\n                         No, Ma I was at first--but not no \n                         more.\n\n                                     MA\n                              (not yet quite \n                              convinced)\n                         Sometimes they do somethin' to you, \n                         Tommy. They hurt you--and you get \n                         mad--and then you get mean--and they \n                         hurt you again--and you get meaner, \n                         and meaner--till you ain't no boy or \n                         no man any more, but just a walkin' \n                         chunk a mean-mad. Did they hurt you \n                         like that, Tommy?\n\n                                     TOM\n                              (grinning)\n                         No, Ma. You don't have to worry about \n                         that.\n\n                                     MA\n                         Thank God. I--I don't want no mean \n                         son\n                              (She loves him with \n                              her eyes)\n\n               At the DOOR, Pa is staring toward them, his mouth open.\n\n                                     PA\n                              (almost to himself)\n                         It's Tommy!\n                              (Then shouting inside)\n                         It's Tommy back!\n                              (Heading for Tom)\n                         What'd you do, son--bust out?\n\n               INSIDE UNCLE JOHN'S CABIN, all but Granma are staring toward \n               the door. Then all but Granma scramble to their feet, headed \n               for the door.\n\n                                     WINFIELD AND RUTHIE\n                              (in an excited chant)\n                         Tom's outa ja-ul! Tom's outa ja-ul!\n\n                                     GRAMPA\n                         I knowed it! Couldn't keep him in! \n                         Can't keep a Joad in! I knowed it \n                         from the fust!\n\n               The children and Grampa scramble out first, followed hurriedly \n               but less rowdily by Uncle John and Noah. Granma, aware only \n               that there is some excitement, looks interestedly after them \n               but decides against any activity.\n\n                                     GRANMA\n                              (vaguely)\n                         Puh-raise the Lawd for vittory!\n                              (she resumes eating)\n\n               In the BACKYARD, the prodigal son, mother and father proudly \n               beside him, is having his hand wrung by Grampa, who vainly \n               tries to button various buttons of his shirt, as always. The \n               two children jump up and down excitedly but are too shy to \n               force themselves into the reception.\n\n                                     GRAMPA\n                              (to Pa)\n                         You know what I al'ays said: \"Tom'll \n                         come bustin' outa that jail like a \n                         bull through a corral fence.\" Can't \n                         keep no Joad in jail!\n\n                                     TOM\n                              (grinning)\n                         I didn't bust out. They lemme out. \n                         Howya, Noah. Howya, Uncle John.\n\n                                     NOAH AND JOHN\n                         Fine, Tommy. Glad to see you.\n\n                                     GRAMPA\n                              (to anybody)\n                         I was the same way myself. Put me in \n                         jail and I'd bust right out. Couldn't \n                         hold me!\n\n               As Tom chucks the two children under the chin, the rattling \n               roar of a jalopy causes all to turn to look.\n\n                                     NOAH\n                              (confidentially)\n                         Bust out?\n\n                                     TOM\n                              (shaking his head)\n                         Parole.\n\n               The roar increases. A home-built TRUCK comes around the corner \n               of the house. Once a Hudson sedan, the top has been cut in \n               two and a truck body constructed. It is driven now by Al, \n               and on the front seat with him are Rosasharn and Connie. The \n               arrival, as the truck moves into the yard, increases the \n               excitement, and the scene is a little incoherent with the \n               talking and shouting and the noise of the jalopy.\n\n                                     AL AND ROSASHARN\n                         Hi, Tom! Howya doin'?\n\n                                     TOM\n                              (surprised and pleased)\n                         Rosasharn! Hi, Rosasharn! Howya, Al!\n\n                                     GRAMPA\n                              (wildly)\n                         The jailbird's back! The jailbird's \n                         back!\n\n                                     OMNES\n                         Hi, Ma! Hi, Connie! Hiya, Grampa!\n\n                                     PA\n                              (to Tom)\n                         That's Connie Rivers with her. They're \n                         married now.\n                              (Confidentially)\n                         She's due about three-four months.\n\n                                     TOM\n                              (marveling)\n                         Why, she wasn't no more'n a kid when \n                         I went up.\n\n                                     AL\n                              (eagerly as he jumps \n                              down)\n                         You bust outa jail, Tom?\n\n                                     TOM\n                              (patiently)\n                         Naw. They paroled me.\n\n                                     AL\n                              (let down)\n                         Oh.\n\n                                     ROSASHARN\n                         Heh'o Tom.\n                              (Proudly)\n                         This is Connie, my husband.\n\n                                     TOM\n                              (shaking hands)\n                         If this don't beat all!\n                              (Chuckling)\n                         Well, I see you been busy already!\n\n                                     ROSASHARN\n                              (gasping)\n                         You do not see either!--not yet!\n\n               At the whoop of laughter that goes up from all, she turns in \n               a fine simulation of maidenly mortification, and throws \n               herself into Connie's arms, hiding her face against his chest. \n               After a moment of surprise, a slow, happy, fatuous grin begins \n               to broaden his face. He beams, whereupon their delight \n               increases, the men roaring and jeering and slapping their \n               legs, the women making modest efforts to suppress their \n               amusement.\n\n                                     OMNES\n                         Lookut his face! Y'see his face? \n                         Lookut Rosasharn! Y'ever see anything \n                         like her face when Tom said it? Look \n                         around, Rosasharn! Let's see it again!\n\n               An automobile horn sounds sharply. Their laughter halted as \n               though cut by a knife, they look off. A TOURING CAR has \n               stopped in the road by the house, the engine still running. \n               One man drives, the other talks.\n\n                                     MAN\n                         Hey, Joad! John Joad!\n\n               In the BACKYARD the people are silent, their faces without \n               expression, as all gaze toward the touring car.\n\n                                     MAN\n                         Ain't forgot, have you?\n\n                                     JOHN\n                         We ain't forgot.\n\n                                     MAN\n                         Comin' through here tomorrow, you \n                         know.\n\n                                     JOHN\n                         I know. We be out. We be out by sunup.\n\n               The touring car's engine is still heard after the men drive \n               off. The Joads watch the car, their heads turning, their \n               eyes following, expressionless.\n\n               The scene dissolves to the BACKYARD just before dawn. Now \n               and then a rooster crows. A couple of lanterns light the \n               scene as the man load the truck. It is nearly done, the body \n               piled high but flat with boxes, and more tied on running \n               boards. Al has the hood open and is working on the motor.\n\n               Noah, Casy, Uncle John, Connie, Pa, and Tom are at various \n               tasks. They talk as they work.\n\n                                     TOM\n                              (to Pa)\n                         How you get all this money?\n\n                                     PA\n                         Sol' things, chopped cotton--even \n                         Grampa. Got us about two hunnerd \n                         dollars all tol'. Shucked out seventy-\n                         five for this truck, but we still \n                         got nearly a hunnerd and fifty to \n                         set out on. I figger we oughta be \n                         able to make it on that.\n\n                                     TOM\n                              (dryly)\n                         Easy. After all, they ain't but about \n                         *twelve* of us, is they?\n\n                                     AL\n                              (proudly closing the \n                              hood)\n                         She'll prob'ly ride like a bull calf--\n                         but she'll ride!\n\n                                     PA\n                         Reckon we better begin roustin' 'em \n                         out if we aim to get outa here by \n                         daylight. How about it, John? How \n                         you boys comin'?\n                              (He casts a critical \n                              eye over the truck)\n\n               INSIDE THE CABIN, Ma sits on a box in front of the stove. \n               The fire door is open and the light shines out. The room \n               itself has been pretty well stripped, with only trash and \n               discarded things left. In Ma's lap is a pasteboard shoebox \n               and she is going through the meager treasures stored in it, \n               to see what must go and what she can take with her. Her eyes \n               are soft and thoughtful as each item brings a memory, but \n               not sad. Occasionally she smiles faintly. She pulls out a \n               letter, looks at it, starts to throw it into the fire, then \n               puts it back in the box. Her hand pulls out a PICTURE \n               POSTCARD. We see it in Ma's hand. It is a picture of the \n               Statue Of Liberty. Over it: \"Greetings from New York City.\" \n               She turns it over. It is addressed: \"Mrs. Joad RFD 254 \n               Oklahomy Territory.\" In the space for a message: \"Hello honey. \n               Willy Mae.\"\n\n               MA, after a moment of studying it, throws the card into the \n               fire. She lifts the letter again, puts it back. She pulls \n               out a worn NEWSPAPER CLIPPING. We see it in Ma's hand. The \n               headline is: \"JOAD GETS SEVEN YEARS.\"\n\n               MA drops the clipping into the fire. Rummaging around, she \n               pulls out a small CHINA DOG. We see it closely as before. On \n               it is printed: \"Souvenir of Louisiana Purchase Exposition--\n               St. Louis--1904.\"\n\n               MA studies the dog, smiling, remembering something that it \n               meant in her life. Then she puts in in a pocket in her dress. \n               Next she pulls out some pieces of cheap jewelry; one cuff \n               link, a baby's signet ring, two earrings. She smiles at the \n               ring, then pockets it. The cuff link too. The earrings she \n               holds for a moment longer, then looks around to make sure \n               nobody sees, then holds them to her ears, not looking into \n               any kind of a mirror, just feeling them against the lobes of \n               her ears, as once perhaps she wore them. Her eyes are grave.\n\n                                     TOM\n                              (from the door)\n                         How about it, Ma?\n\n                                     MA\n                         I'm ready.\n\n               Tom disappears. Ma looks at the earrings, and then at the \n               contents of the box. She lifts out the letter again and looks \n               at it. Then, without drama, she drops it into the fire. She \n               watches it burn. Her eyes are still on the flame as she calls.\n\n                                     MA\n                         Rosasharn honey! Wake up the chillun. \n                         We're fixin' to leave.\n\n               The flame dies down.\n\n               In the BACKYARD it is grey dawn. There is a thrill of quiet \n               excitement as they all stand around the loaded truck, hats \n               on, putting on coats. The ones missing are Ma, Rosasharn, \n               the children, and Grampa. Pa is in charge.\n\n                                     PA\n                              (as Ma comes out of \n                              the cabin)\n                         Where's Grampa? Al, go git him.\n\n                                     GRANMA\n                              (trying to climb in \n                              the front seat)\n                         I'm gonna sit up front! Somebody \n                         he'p me!\n\n               Tom easily lifts her up the step. The two children come \n               running out of the house, chanting.\n\n                                     RUTHIE AND WINFIELD\n                         Goin' to California! Goin' to \n                         California!\n\n                                     PA\n                         You kids climb up first, on top.\n                              (all obey as he directs)\n                         Al's gonna drive, Ma. You sit up \n                         there with him and Granma and we'll \n                         swap around later.\n\n                                     GRANMA\n                         I ain't gonna sit with Grampa!\n\n                                     PA\n                         Connie, you he'p Rosasharn up there \n                         alongside Ruthie and Winfiel'.\n                              (Looking around)\n                         Where's Grampa?\n\n                                     GRANMA\n                              (with a cackle)\n                         Where he al'ays is, prob'ly!\n\n                                     PA\n                         Well, leave him a place, but Noah, \n                         you and John, y'all kinda find \n                         yourself a place--kinda keep it even \n                         all around.\n\n               All have obeyed and are aboard but Pa, Tom, and Casy, who is \n               watching the springs flatten out.\n\n                                     TOM\n                         Think she'll hold?\n\n                                     CASY\n                         If she does it'll be a miracle outa \n                         Scripture.\n\n                                     GRAMPA'S VOICE\n                         Lemmo go, gol dang it! Lemmo go, I \n                         tell you!\n\n               All turn. In a CORNER OF THE HOUSE Al is pulling Grampa gently \n               but firmly, the old man holding back, and furious. He flails \n               feebly at Al, who holds his head out of the way without \n               effort.\n\n                                     AL\n                         He wasn't sleepin'. He was settin' \n                         out back a the barn. They's somepin' \n                         wrong with him.\n\n                                     GRAMPA\n                         Ef you don't let me go--\n\n               Al permits Grampa to jerk loose and sit down on the doorstep. \n               The old man is miserable and frightened and angry, too old \n               to understand or accept such a violent change in his life.  \n               Tom and Pa come up to him. The others watch solemnly from \n               their places in the truck.\n\n                                     TOM\n                         What's the matter, Grampa?\n\n                                     GRAMPA\n                              (dully, sullenly)\n                         Ain't nothin' the matter. I just \n                         ain't a-goin', that's all.\n\n                                     PA\n                         What you mean you ain't goin'? We \n                         *got* to go. We got no place to stay.\n\n                                     GRAMPA\n                         I ain't talkin' about you, I'm talkin' \n                         about me. And I'm a-stayin'. I give \n                         her a good goin' over all night long--\n                         and I'm a-stayin'.\n\n                                     PA\n                         But you can't *do* that, Grampa. \n                         This here land is goin' under the \n                         tractor. We *all* got to git out.\n\n                                     GRAMPA\n                         All but me! I'm a-stayin'.\n\n                                     TOM\n                         How 'bout Granma?\n\n                                     GRAMPA\n                              (fiercely)\n                         Take her with you!\n\n                                     MA\n                              (getting out of the \n                              truck)\n                         But who'd cook for you? How'd you \n                         live?\n\n                                     GRAMPA\n                         Muley's livin', ain't he? And I'm \n                         *twicet* the man Muley is!\n\n                                     PA\n                              (on his knee)\n                         Now listen, Grampa. Listen to me, \n                         just a minute.\n\n                                     GRAMPA\n                              (grimly)\n                         And I ain't gonna listen either. I \n                         tol' you what I'm gonna do.\n                              (Angrily)\n                         And I don't give a hoot in a hollow \n                         if they's oranges and grapes crowdin' \n                         a fella outa bed even, I ain't a-\n                         goin' to California!\n                              (Picking up some dirt)\n                         This here's my country. I b'long \n                         *here*.\n                              (Looking at the dirt)\n                         It ain't no good--\n                              (after a pause)\n                         --but it's mine.\n\n                                     TOM\n                              (after a silence)\n                         Ma. Pa.\n                              (They move toward the \n                              cabin with him)\n                         Grampa, his eyes hurt and hunted and \n                         frightened and bewildered, scratches \n                         in the dirt.\n\n                                     GRAMPA\n                              (loudly)\n                         And can't nobody *make* me go, either! \n                         Ain't nobody here *man* enough to \n                         make me! I'm a-stayin'.\n\n               All watch him worriedly.\n\n               INSIDE THE CABIN:\n\n                                     TOM\n                         Either we got to tie him up and \n                         *throw* him on the truck, or somepin. \n                         He can't stay here.\n\n                                     PA\n                         Can't tie him. Either we'll hurt him \n                         or he'll git so mad he'll hurt his \n                         self.\n                              (After thought)\n                         Reckon we could git him *drunk*?\n\n                                     TOM\n                         Ain't no whisky, is they?\n\n                                     MA\n                         Wait. There's a half a bottle a \n                         soothin' sirup here.\n                              (In the trash in the \n                              corner)\n                         It put the chillun to sleep.\n\n                                     TOM\n                              (tasting it)\n                         Don't taste bad.\n\n                                     MA\n                              (looking in the pot)\n                         And they's some coffee here. I could \n                         fix him a cup...\n\n                                     TOM\n                         That's right. And douse some in it.\n\n                                     PA\n                              (watching)\n                         Better give him a good 'un. He's \n                         awful bull-headed.\n\n               Ma is already pouring coffee into a can as GRAMPA is seen.\n\n                                     GRAMPA\n                              (mumbling defiantly)\n                         If Muley can scrabble along, I can \n                         do it too.\n                              (Suddenly sniffing)\n                         I smell spareribs. Somebody been \n                         eatin' spareribs? How come I ain't \n                         got some?\n\n                                     MA\n                              (from the door)\n                         Got some saved for you, Grampa. Got \n                         'em warmin' now. Here's a cuppa \n                         coffee.\n\n                                     GRAMPA\n                              (taking the cup)\n                         Awright, but get me some a them \n                         spareribs, too. Get me a whole mess \n                         of 'em. I'm hongry.\n\n               He drinks the coffee. Pa and Tom watch him. He notices \n               nothing. He takes another dram of the coffee.\n\n                                     GRAMPA\n                              (amiably)\n                         I shore do like spareribs.\n\n               He drinks again.\n\n               The scene dissolves to the TRUCK. It is just after dawn. Pa, \n               Tom, and Noah are lifting Grampa into the truck. He mumbles \n               angrily, but is unconscious of what is happening.\n\n                                     PA\n                              (fretfully)\n                         Easy, *easy!* You wanta bust his \n                         head wide open? Pull his arms, John.\n\n                                     GRAMPA\n                              (mumbling)\n                         Ain't a-goin', thas all...\n\n                                     PA\n                         Put somepin' over him, so he won't \n                         git sun-struck.\n                              (Looking around)\n                         Ever'body set now?\n                              (A chorus of responses)\n                         Awright, Al, letta go!\n\n               The engine rattles and roars shakily. Grinning with \n               excitement, Pa sits down and pats Grampa clumsily.\n\n                                     PA\n                         You be awright, Grampa.\n\n               The truck starts to move heavily. Casy stands watching it.\n\n                                     CASY\n                         Good-by, an' good luck.\n\n                                     PA\n                         Hey, wait! Hold 'er, Al!\n                              (The car stops)\n                         Ain't you goin' with us?\n\n                                     CASY\n                              (after a pause)\n                         I'd like to. There's somethin' \n                         happenin' out there in the wes' an' \n                         I'd like to try to learn what it is. \n                         If you feel you got the room...\n\n               He stops politely. Pa looks from one face to the other in \n               the truck--a swift, silent canvass--and though no one speaks \n               or gives any other sign, Pa knows that the vote is yes.\n\n                                     PA\n                              (heartily)\n                         Come on, get on, plenty room!\n\n                                     OMNES\n                         Sure, come on, Casy, plenty room!\n\n               Quickly he climbs aboard. The truck rattles into motion again.\n\n                                     PA\n                              (excitedly)\n                         Here we go!\n\n                                     TOM\n                              (grinning)\n                         California, here we come!\n\n               As they all look back the deserted CABIN is seen from the \n               departing truck.\n\n               Now we see the FAMILY IN THE TRUCK, as it snorts and rattles \n               toward the road--a study of facial expressions as the Joad \n               family look back for the last time at their home. Connie and \n               Rosasharn, whispering, giggling, and slappings, are oblivious \n               of the event. Ruthie and Winfield are trembling with \n               excitement. But Tom's and Pa's smiles have disappeared, and \n               all the men are gazing back thoughtfully and soberly, their \n               minds occupied with the solemnity of this great adventure.\n\n               In the FRONT SEAT OF THE TRUCK. Al is driving. Granma is \n               already dozing. Ma looks steadily ahead.\n\n                                     AL\n                              (grinning)\n                         Ain't you gonna look back, Ma?--give \n                         the ol' place a last look?\n\n                                     MA\n                              (coldly shaking her \n                              head)\n                         We're goin' to California, ain't we? \n                         Awright then, let's *go* to \n                         California.\n\n                                     AL\n                              (sobering)\n                         That don't sound like you, Ma. You \n                         never was like that before.\n\n                                     MA\n                         I never had my house pushed over \n                         before. I never had my fambly stuck \n                         out on the road. I never had to \n                         lose... ever'thing I had in life.\n\n               She continues to stare straight ahead. The TRUCK is lumbering \n               up onto a paved highway.\n\n               The scene dissolves to a MONTAGE: Almost filling the screen \n               is the shield marker of the U.S. Highway 66. Superimposed on \n               it is a montage of jalopies, steaming and rattling and piled \n               high with goods and people, as they pull onto the highway, \n               to indicate as much as possible that this departure of the \n               Joad family is but part of a mass movement of jalopies and \n               families. The signs of towns on U.S. Highway 66 flash past--\n               CHECOTAH, OKLAHOMA CITY, BETHANY.\n\n               This dissolves to a HIGHWAY. It is late afternoon. The Joad \n               truck pulls of the paved highway and stops. The men leap \n               down quickly from the truck, all but Pa, who lifts Grampa in \n               his arms and then lowers him slowly, gently into Tom's arms.\n\n               In TOM'S arms Grampa is whimpering feebly.\n\n                                     GRAMPA\n                         *Ain't* a-goin'... ain't a-goin'...\n\n                                     TOM\n                         'S all right, Grampa. You just kind \n                         a tar'd, that's all. Somebody fix a \n                         pallet.\n\n               With a quilt pulled from the truck Ma runs ahead as Tom \n               carries Grampa toward a clump of woods back off the highway. \n               The others get down soberly from the truck, all but Granma, \n               who is dozing. Cars pass-a fast car passing a jalopy. Tom is \n               letting the old man down gently as Ma adjusts the quilt on \n               the ground. Death is in Grampa's eyes as he looks up dimly \n               at them.\n\n                                     GRAMPA\n                              (a whisper)\n                         Thas it, jus' tar'd thas all... jus' \n                         tar'd...\n                              (He closes his eyes)\n\n               The scene dissolves to an insert of a NOTE. It is written \n               awkwardly in pencil on the flyleaf of a Bible. Tom's voice \n               recites the words.\n\n                                     TOM'S VOICE\n                         This here is William James Joad, \n                         dyed of a stroke, old old man. His \n                         folkes bured him becaws they got no \n                         money to pay for funerls. Nobody \n                         kilt him. Jus a stroke an he dyed.\n\n               A GRAVE, at night. In the clump of woods, lighted by two \n               lanterns, The Joad tribe stands reverently around an open \n               grave. Having read the note, Tom puts it in a small fruit \n               jar and kneels down and, reaching into the grave, places it \n               on Grampa's body.\n\n                                     TOM\n                         I figger best we leave something \n                         like this on him, lest somebody dig \n                         him up and make out he been kilt.\n                              (Reaching into the \n                              grave)\n                         Lotta times looks like the gov'ment \n                         got more interest in a dead man than \n                         a live one.\n\n                                     PA\n                         Not be so lonesome, either, knowin' \n                         his name is there with 'im, not just' \n                         a old fella lonesome underground.\n\n                                     TOM\n                              (straightening up)\n                         Casy, won't you say a few words?\n\n                                     CASY\n                         I ain't no more a preacher, you know.\n\n                                     TOM\n                         We know. But ain't none of our folks \n                         ever been buried without a few words.\n\n                                     CASY\n                              (after a pause)\n                         I'll say 'em--an' make it short.\n                              (All bow and close \n                              eyes)\n                         This here ol' man jus' lived a life \n                         an' jus' died out of it. I don't \n                         know whether he was good or bad, an' \n                         it don't matter much. Heard a fella \n                         say a poem once, an' he says, \"All \n                         that lives is holy.\" But I wouldn't \n                         pray for jus' a ol' man that's dead, \n                         because he's awright. If I was to \n                         pray I'd pray for the folks that's \n                         alive an' don't know which way to \n                         turn. Grampa here, he ain't got no \n                         more trouble like that. He's got his \n                         job all cut out for 'im--so cover \n                         'im up and let 'im get to it.\n\n                                     OMNES\n                         Amen.\n\n               The scene fades out.\n\n               HIGHWAY 66, in daylight, fades in: an Oklahoma stretch, \n               revealing a number of jalopies rattling westward. The Joad \n               truck approaches.\n\n               In the FRONT SEAT OF THE TRUCK Tom is now driving. Granma is \n               dozing again, and Ma is looking thoughtfully ahead.\n\n                                     MA\n                         Tommy.\n\n                                     TOMMY\n                         What is it, Ma?\n\n                                     MA\n                         Wasn't that the state line we just \n                         passed?\n\n                                     TOM\n                              (after a pause)\n                         Yes'm, that was it.\n\n                                     MA\n                         Your pa tol' me you didn't ought to \n                         cross it if you're paroled. Says \n                         they'll send you up again.\n\n                                     TOM\n                         Forget it, Ma. I got her figgered \n                         out. Long as I keep outa trouble, \n                         ain't nobody gonna say a thing. All \n                         I gotta do is keep my nose clean.\n\n                                     MA\n                              (worriedly)\n                         Maybe they got crimes in California \n                         we don't know about. Crimes we don't \n                         even know *is* crimes.\n\n                                     TOM\n                              (laughing)\n                         Forget it, Ma. Jus' think about the \n                         nice things out there. Think about \n                         them grapes and oranges--an' ever'body \n                         got work--\n\n                                     GRANMA\n                              (waking suddenly)\n                         I gotta git out!\n\n                                     TOM\n                         First gas station, Granma--\n\n                                     GRANMA\n                         I gotta git *out*, I tell ya! I gotta \n                         git *out*!\n\n                                     TOM\n                              (foot on brakes)\n                         Awright! Awright!\n\n               As the truck slows to a stop a motorcycle cop approaches \n               after them. Looking back, Tom sees him bearing toward them. \n               He looks grimly at Ma.\n\n                                     TOM\n                         They shore don't waste no time!\n                              (As Granma whines)\n                         Take her out.\n\n                                     COP\n                              (astraddle his \n                              motorcycle)\n                         Save your strength, lady.\n                              (to Tom)\n                         Get goin', buddy. No campin' here.\n\n                                     TOM\n                              (relieved)\n                         We ain't campin'. We jus' stoppin' a \n                         minute--\n\n                                     COP\n                         Lissen, I heard that before--\n\n                                     GRANMA\n                         I tell ya I gotta git out!\n\n               The cop looks startled, puzzled, but Tom shrugs a disclaimer \n               for responsibility in that quarter.\n\n                                     TOM\n                              (mildly)\n                         She's kinda ol'--\n\n                                     GRANMA\n                              (whimpering)\n                         I tell ya--\n\n                                     COP\n                         Okay, okay!\n\n                                     GRANMA\n                              (triumphantly)\n                         Puh-raise the Lawd for vittory!\n\n               As Ma helps Granma out the other side, Tom and the cop \n               exchange a glance and snother shrug at the foibles of women \n               and then look studiedly into space.\n\n               The scene dissolves to a MONTAGE: superimposed on the marker \n               of U.S. Highway 66 an assortment of roadside signs flashes \n               by: Bar-B-Q, Joe's Eats, Dr. Pepper, Gas, Coca Cola, This \n               Highway is Patrolled, End of 25 Mile Zone, Lucky Strikes, \n               Used Cars, Nutburger, Motel, Drive-Inn, Free Water, We Fix \n               Flats, etc.\n\n               A HAND-PAINTED SIGN reads: \"CAMP 50¢.\" It is night. We hear \n               the sound of guitar music. In the CAMP GROUND a small wooden \n               house dominates the scene. There are no facilities; the \n               migrants simply pitch makeshift tents and park their jalopies \n               wherever there is a space. It is after supper and a dozen or \n               more men sit on the steps of the house listening to Connie \n               play a road song on a borrowed guitar. The music softens the \n               tired, drawn faces of the men and drives away some of their \n               shyness. In the dark, outside the circle of light from the \n               gasoline lantern on the porch, some of the women and children \n               sit and enjoy the luxury of this relative gaiety. The \n               proprietor sits tipped back in a straight chair on the porch.\n\n               We see the JOAD TENT. Behind their truck, a tarpaulin is \n               stretched over a rope from tree to tree. Granma lies asleep \n               on a quilt, stirring fitfully. Ma sits on the ground at her \n               head, fanning her with a piece of cardboard. Rosasharn lies \n               flat on her back, hands clasped under her head, looking up \n               at the stars. The music comes to them pleasantly.\n\n                                     ROSASHARN\n                         Ma... all this, will it hurt the \n                         baby?\n\n                                     MA\n                         Now don't you go gettin' nimsy-mimsy.\n\n                                     ROSASHARN\n                         Sometimes I'm all jumpy inside.\n\n                                     MA\n                         Well, can't nobody get through nine \n                         *months* without sorrow.\n\n                                     ROSASHARN\n                         But will it--hurt the baby?\n\n                                     MA\n                         They use' to be a sayin': A chile \n                         born outa sorrow'll be a happy chile. \n                         An' another: Born outa too much joy'll \n                         be a doleful boy. That's the way I \n                         always heard it.\n\n                                     ROSASHARN\n                         You don't ever get scairt, do you, \n                         Ma?\n\n                                     MA\n                              (thoughtfully)\n                         Sometimes. A little. Only it ain't \n                         scairt so much. It's just waitin' \n                         an' wonderin'. But when sump'n happens \n                         that I got to do sump'n--\n                              (simply)\n                         --I'll do it.\n\n                                     ROSASHARN\n                         Don't it ever scare you it won't be \n                         nice in California like we think?\n\n                                     MA\n                              (quickly)\n                         No. No, it don't. I can't do that. I \n                         can't let m'self. All I can do is \n                         see how soon they gonna wanta eat \n                         again. They'd all get upset if I \n                         done anymore 'n that. They all depen' \n                         on me jus' thinkin' about that.\n                              (After a pause)\n                         That's my part--that an' keepin' the \n                         fambly together.\n\n               As the music ends we see a GROUP ON THE PORCH STEPS. The men \n               murmur approbation of Connie's playing.\n\n                                     PA\n                              (with quiet pride)\n                         Thas my son-in-law.\n\n                                     FIRST MAN\n                         Sings real nice. What state y'all \n                         from?\n\n                                     PA\n                         Oklahoma. Had us a farm there, share-\n                         croppin'.\n\n                                     TOM\n                         Till the tractors druv us out.\n\n                                     FIRST MAN\n                         We from Arkansas. I had me a store \n                         there, kind of general notions store, \n                         but when the farms went the store \n                         went too.\n                              (Sighing)\n                         Nice a little as you ever saw. I \n                         shore did hate to give it up.\n\n                                     PA\n                              (profoundly)\n                         Wal, y'cain't tell. I figure when we \n                         git out there an' git work an' maybe \n                         git us a piece a growin' lan' near \n                         water it might not be so bad at that.\n\n                                     OTHER MEN\n                         Thas right... Payin' good wages, I \n                         hear... Ever'body got work out \n                         there... Can't be no worse...\n\n               As they talk, a SECOND MAN, standing on the edge of the group, \n               begins to grin bitterly. He is much more ragged than the \n               others.\n\n                                     SECOND MAN\n                         You folks must have a pot a money.\n\n               The GROUP turns to look at the Man.\n\n                                     PA\n                              (with dignity)\n                         No, we ain't got no money. But they's \n                         plenty of us to work, an' we 're all \n                         good men. Get good wages out there \n                         an' put it all together an' we'll be \n                         awright.\n\n               The Man begins to snigger and then to laugh in a high \n               whinneying giggle which turns into a fit of coughing. All of \n               the men are watching him.\n\n                                     SECOND MAN\n                         Good wages, eh! Pickin' oranges an' \n                         peaches?\n\n                                     PA\n                              (quietly)\n                         We gonna take whatever they got.\n\n                                     TOM\n                         What's so funny about it?\n\n                                     SECOND MAN\n                              (sniggering again)\n                         What's so funny about it?  I just \n                         *been* out there! I been an' *seen* \n                         it! An' I'm goin' *back* to starve--\n                         because I ruther starve all over at \n                         once!\n\n                                     PA\n                              (angrily)\n                         Whatta you think you're talkin' about? \n                         I got a han'bill here says good wages, \n                         an' I seen it in the papers they \n                         need pickers!\n\n                                     SECOND MAN\n                         Awright, go on! Ain't nobody stoppin' \n                         ya!\n\n                                     PA\n                              (pulling out handbill)\n                         But what about this?\n\n                                     SECOND MAN\n                         I ain't gonna fret you. Go on!\n\n                                     TOM\n                         Wait a minute, buddy. You jus' done \n                         some jackassin'! You ain't gonna \n                         shut up now. The han'bill says they \n                         need men. You laugh an' say they \n                         don't. Now which one's a liar?\n\n                                     SECOND MAN\n                              (after a pause)\n                         How many you'all got them han'bills? \n                         Come on, how many?\n\n               At least three-quarters of the men worriedly reach into their \n               pockets and draw out worn and folded handbills.\n\n                                     PA\n                         But what does *that* prove?\n\n                                     SECOND MAN\n                         Look at 'em! Same yella han'bill--\n                         800 pickers wanted. Awright, this \n                         man wants 800 men. So he prints up \n                         5,000 a them han'bills an' maybe \n                         20,000 people sees 'em. An' maybe \n                         two-three thousan' starts movin, \n                         wes' account a this han'bill. Two-\n                         three thousan' folks that's crazy \n                         with worry headin' out for 800 jobs! \n                         Does that make sense?\n\n               There is a long worried silence. The proprietor leans forward \n               angrily.\n\n                                     PROPRIETOR\n                         What are you, a troublemaker? You \n                         sure you ain't one a them labor fakes?\n\n                                     SECOND MAN\n                         I swear I ain't, mister!\n\n                                     PROPRIETOR\n                         Well, don't you go roun' here tryin' \n                         to stir up trouble.\n\n                                     SECOND MAN\n                              (drawing himself up)\n                         I tried to tell you folks sump'n it \n                         took me a year to fin' out. Took two \n                         kids dead, took my wife dead, to \n                         show me. But nobody couldn't tell me \n                         neither. I can't tell ya about them \n                         little fellas layin' in the tent \n                         with their bellies puffed out an' \n                         jus' skin on their bones, an' \n                         shiverin' an' whinin' like pups, an' \n                         me runnin' aroun' tryin' to get work--\n                              (shouting)\n                         --not for money, not for wages--jus' \n                         for a cup a flour an' a spoon a lard! \n                         An' then the coroner came. \"Them \n                         children died a heart-failure,\" he \n                         says, an' put it in his paper.\n                              (With wild bitterness)\n                         Heart-failure!--an' their little \n                         bellies stuck out like a pig-bladder!\n\n               He looks around at the men, trying to control his emotions, \n               and then he walks away into the darkness. There is an uneasy \n               silence.\n\n                                     FIRST MAN\n                         Well--gettin' late. Got to get to \n                         sleep.\n\n               They all rise as at a signal, all moved and worried by the \n               Second Man's outburst. TOM, PA AND CASY move away, worry on \n               their faces.\n\n                                     PA\n                         S'pose he's tellin' the truth--that \n                         fella?\n\n                                     CASY\n                         He's tellin' the truth awright. The \n                         truth for him. He wasn't makin' \n                         nothin' up.\n\n                                     TOM\n                         How about us? Is that the truth for \n                         us?\n\n                                     CASY\n                         I don't know.\n\n                                     PA\n                              (worriedly)\n                         How can you tell?\n\n               The scene dissolves to a MONTAGE: superimposed on the shield \n               marker of U.S. Highway 66 and the rattling Joad truck the \n               signs of towns flash by: AMARILLO, VEGA, GLENRIO.\n\n               The TRUCK is seen on the HIGHWAY. It is now mountain country--\n               New Mexico. Then it is seen at a GAS STATION. It is a cheap \n               two-pump station, hand-painted, dreary, dusty. Huddled next \n               to it is a hamburger stand. In front of the hamburger stand \n               is a truck labeled: NEW MEXICO VAN AND STORAGE COMPANY. The \n               Joads are piling out of their truck. Directed by Ma, Noah \n               lifts Granma out. The two children scamper around shrieking \n               because their legs have gone to sleep. Al is preparing to \n               put water in the radiator. Pa takes out a deep leather pouch, \n               unties the strings, and begins calculating his money as the \n               fat proprietor advances.\n\n                                     FAT MAN\n                              (truculently)\n                         You folks aim to buy anything?\n\n                                     AL\n                         Need some gas, mister.\n\n                                     FAT MAN\n                         Got any money?\n\n                                     AL\n                         Whatta you think:--we's beggin'?\n\n                                     FAT MAN\n                         I just ast, that's all.\n\n                                     TOM\n                              (evenly)\n                         Well, ask right. You ain't talkin' \n                         to bums, you know.\n\n                                     FAT MAN\n                              (appealing to heaven)\n                         All in the worl' I done was ast!\n\n               INSIDE THE HAMBURGER STAND, a standard cheap eatery, Bert is \n               doing the short orders and Mae is handling the counter. A \n               nickel phonograph is playing a tune. Bill, a truck driver, \n               sits at the counter; his partner, Fred, is playing a slot \n               machine.\n\n                                     BILL\n                         Kinda pie y'got?\n\n                                     MAE\n                         Banana cream, pineapple cream, \n                         chocolate cream--and apple.\n\n                                     BILL\n                         Cut me off a hunk a that banana cream, \n                         and a cuppa java.\n\n                                     FRED\n                         Make it two.\n\n                                     MAE\n                         Two it is.\n                              (Smirking)\n                         Seen any new etchin's lately, Bill?\n\n                                     BILL\n                              (grinning)\n                         Well, here's one ain't bad. Little \n                         kid comes in late to school. Teacher \n                         says--\n\n               He stops. Pa is peering in the screen door. Beside him Ruthie \n               and Winfield have their noses flattened against the screen. \n               Mae looks at Pa.\n\n                                     MAE\n                         Yeah?\n\n                                     PA\n                         Could you see your way clear to sell \n                         us a loaf of bread, ma'am.\n\n                                     MAE\n                         This ain't a groc'ry store. We got \n                         bread to make san'widges with.\n\n                                     PA\n                         I know, ma'am... on'y it's for a ole \n                         lady, no teeth, gotta sof'n it with \n                         water so she can chew it, an' she's \n                         hongry.\n\n                                     MAE\n                         Whyn't you buy a san'wich? We got \n                         nice san'widges.\n\n                                     PA\n                              (embarrassed)\n                         I shore would like to do that, ma'am, \n                         but the fack is, we ain't got but a \n                         dime for it. It's all figgered out, \n                         I mean--for the trip.\n\n                                     MAE\n                         You can't get no loaf a bread for a \n                         dime. We only got fifteen-cent loafs.\n\n                                     BERT\n                              (an angry whisper)\n                         Give 'em the bread.\n\n                                     MAE\n                         We'll run out 'fore the bread truck \n                         comes.\n\n                                     BERT\n                         Awright then, run out!\n\n               Mae shrugs at the truck drivers, to indicate what she's up \n               against, while Bert mashes his hamburgers savagely with the \n               spatula.\n\n                                     MAE\n                         Come in.\n\n               Pa and the two children come in as Mae opens a drawer and \n               pulls out a long waxpaper-covered loaf of bread. The children \n               have been drawn to the candy showcase and are staring in at \n               the goodies.\n\n                                     MAE\n                         This here's a fifteen-cent loaf.\n\n                                     PA\n                         Would you--could you see your way to \n                         cuttin' off ten cents worth?\n\n                                     BERT\n                              (a clinched teeth \n                              order)\n                         Give 'im the loaf!\n\n                                     PA\n                         No, sir, we wanta buy ten cents worth, \n                         thas all.\n\n                                     MAE\n                              (sighing)\n                         You can have this for ten cents.\n\n                                     PA\n                         I don't wanta rob you, ma'am.\n\n                                     MAE\n                              (with resignation)\n                         Go ahead--Bert says take it.\n\n               Taking out his pouch, Pa digs into it, feels around with his \n               fingers for a dime, as he apologizes.\n\n                                     PA\n                         May soun' funny to be so tight, but \n                         we got a thousan' miles to go, an' \n                         we don't know if we'll make it.\n\n               But when he puts the dime down on the counter he has a penny \n               with it. He is about to drop this back in the pouch when his \n               eyes fall on the children staring at the candy. Slowly he \n               moves down to see what they are looking at. Then:\n\n                                     PA\n                         Is them penny candy, ma'am?\n\n               The children look up with a gasp, their big eyes on Mae as \n               she moves down behind the counter.\n\n                                     MAE\n                         Which ones?\n\n                                     PA\n                         There, them stripy ones.\n\n               Mae looks from the candy to the children. They have stopped \n               breathing, their eyes on the candy.\n\n                                     MAE\n                         Oh, them? Well, no--them's *two* for \n                         a penny.\n\n                                     PA\n                         Well, give me two then, ma'am.\n\n               He places the penny carefully on the counter and Mae holds \n               the sticks of candy out to the children. They look up at Pa.\n\n                                     PA\n                              (beaming)\n                         Sure, take 'em, take 'em!\n\n               Rigid with embarrassment, they accept the candy, looking \n               neither at it nor at each other. Pa picks up the loaf of \n               bread and they scramble for the door. At the door Pa turns \n               back.\n\n                                     PA\n                         Thank you, ma'am.\n\n               The door slams. Bill turns back from staring after them.\n\n                                     BILL\n                         Them wasn't two-for-a-cent candy.\n\n                                     MAE\n                              (belligerently)\n                         What's it to you?\n\n                                     BILL\n                         Them was nickel apiece candy.\n\n                                     FRED\n                         We got to get goin'. We're droppin' \n                         time.\n\n               Both reach in their pockets, but when Fred sees what Bill \n               has put down he reaches again and duplicates it. As they go \n               out of the door...\n\n                                     BILL\n                         So long.\n\n                                     MAE\n                         Hey, wait a minute. You got change \n                         comin'.\n\n                                     BILL'S VOICE\n                              (from outside)\n                         What's it to you?\n\n               As Mae watches them through the window, her eyes warm, Bert \n               walks around the counter to the three slot machines, a paper \n               with figures on it in his hand. The truck roars outside and \n               moves off. Mae looks down again at the coins.\n\n                                     MAE\n                              (softly)\n                         Bert.\n\n                                     BERT\n                              (playing a machine)\n                         What ya want?\n\n                                     MAE\n                         Look here.\n\n               As he looks we see the COINS ON THE COUNTER. They are two \n               half-dollars.\n\n                                     MAE\n                              (reverently)\n                         Truck drivers.\n\n               There is a rattle of coins as Bert hits the jackpot. In his \n               left hand on the machine is a paper with three columns of \n               figures on it. The third column is much the longest. He scoops \n               out the money.\n\n                                     BERT\n                         I figgered No. 3 was about ready to \n                         pay off.\n\n               The scene fades out.\n\n               The ARIZONA BORDER, in daylight, fades in. It is in a gap in \n               the mountains and beyond can be seen the Painted Desert. A \n               border guard halts the Joad truck. He is not as tough as his \n               words indicate, just curt and matter-of-fact.\n\n                                     GUARD\n                         Where you going?\n\n                                     TOM\n                              (who is driving)\n                         California.\n\n                                     GUARD\n                         How long you plan to be in Arizona?\n\n                                     TOM\n                         No longer'n we can get acrost her.\n\n                                     GUARD\n                         Got any plants?\n\n                                     TOM\n                         No plants.\n\n                                     GUARD\n                              (putting sticker on \n                              windshield)\n                         Okay. Go ahead, but you better keep \n                         movin'.\n\n                                     TOM\n                         Sure. We aim to.\n\n               The truck rattles into movement.\n\n               The scene dissolves to a MONTAGE superimposed on the shield \n               marker of U.S. Highway 66 and the Joad truck. Signs flash \n               by: FLAGSTAFF, WATER 5¢ A GAL, WATER 10¢ A GAL, WATER 15¢ A \n               GAL, and finally, NEEDLES, CALIF.\n\n               In the foreground, their backs turned, the Joads stand on \n               and about their truck looking in a long silence at what can \n               be seen of California from Needles. Their silence is eloquent. \n               The faces of the Joads are blank with dismay, for this is an \n               unattractive sight indeed.\n\n                                     PA\n                              (finally)\n                         There she is, folks--the land a milk \n                         an' honey--California!\n\n                                     CONNIE\n                              (sullenly)\n                         Well, if *that's* what we come out \n                         here for...\n\n               They look at each other in disappointment.\n\n                                     ROSASHARN\n                              (timidly, to Connie)\n                         Maybe it's nice on the other side. \n                         Them pitchers--them little pos'cards--\n                         they was real pretty.\n\n                                     TOM\n                              (rallying them)\n                         Aw, sure. This here's jus' a part of \n                         it. Ain't no sense a gettin' scairt \n                         right off.\n\n                                     PA\n                         Course not. Come on, let's get goin'. \n                         She don't look so tough to me!\n\n               The Joads and the landscape are seen again. Then the scene \n               dissolves to the BANK OF A RIVER. The camp at Needles is on \n               the bank of the Colorado River, among some willows. We see \n               the man of the family sitting chest-deep in the shallow \n               waters, talking, occasionally ducking their heads under, \n               reveling in this relief. In the background are the towering \n               mountains.\n\n                                     TOM\n                         Got that desert yet. Gotta take her \n                         tonight. Take her in the daytime \n                         fella says she'll cut your gizzard \n                         out.\n\n                                     PA\n                              (to Al)\n                         How's Granma since we got her in the \n                         tent?\n\n                                     AL\n                         She's off her chump, seems to me.\n\n                                     NOAH\n                         She's outa her senses, awright. All \n                         night on the truck keep talkin' like \n                         she was talkin' to Grampa.\n\n                                     TOM\n                         She's jus' wore out, that's all.\n\n                                     PA\n                              (worriedly)\n                         I shore would like to stop here a \n                         while an' give her some res' but we \n                         on'y got 'bout forty dollars left. I \n                         won't feel right till we're there \n                         an' all workin' an' a little money \n                         comin' in.\n\n                                     NOAH\n                              (lazily, after a \n                              silence)\n                         Like to jus' stay here myself. Like \n                         to lay here forever. Never get hungry \n                         an' never get sad. Lay in the water \n                         all life long, lazy as a brood sow \n                         in the mud.\n\n                                     TOM\n                              (looking up at the \n                              mountains)\n                         Never seen such tough mountains. \n                         This here's a murder country, just \n                         the *bones* of a country.\n                              (Thoughtfully)\n                         Wonder if we'll ever get in a place \n                         where folks can live 'thout fightin' \n                         hard scrabble an' rock. Sometimes \n                         you get to thinkin' they *ain't* no \n                         such country.\n\n               They look up as a man and his grown son stand on the bank.\n\n                                     MAN\n                         How's the swimmin'?\n\n                                     TOM\n                         Dunno. We ain't tried none. Sure \n                         feels good to set here, though.\n\n                                     MAN\n                         Mind if we come in an' set?\n\n                                     TOM\n                         She ain't our river. But we'll len' \n                         you a little piece of her.\n\n               They start to shuck off their clothes. THE MAN, excluding \n               those undressing, form another scene.\n\n                                     PA\n                         Goin' west?\n\n                                     MAN'S VOICE\n                         Nope. We come from there. Goin' back \n                         home.\n\n                                     TOM\n                         Where's home?\n\n                                     MAN'S VOICE\n                         Panhandle, come from near Pampa.\n\n                                     PA\n                              (in surprise)\n                         Can you make a livin' there?\n\n                                     MAN'S VOICE\n                         Nope.\n\n               The man and his son sit down in the water.\n\n                                     MAN\n                              (continuing)\n                         But at leas' we can starve to death \n                         with folks we know.\n\n               There is a long silence among the Joads as the man and his \n               son splash water over their heads.\n\n                                     PA\n                              (slowly)\n                         Ya know, you're the second fella \n                         talked like that. I'd like to hear \n                         some more about that.\n\n                                     TOM\n                         Me an' you both.\n\n               The man and his son exchange a glance, as though the Joads \n               had touched on the deadliest of subjects.\n\n                                     SON\n                              (finally)\n                         He ain't gonna tell you nothin' about \n                         it.\n\n                                     PA\n                         If a fella's willin' to work hard, \n                         can't he cut her?\n\n                                     MAN\n                         Listen, mister. I don't know \n                         ever'thing. You might go out an' \n                         fall into a steady job, an' I'd be a \n                         liar. An' then, you might never get \n                         no work, an' I didn't warn you. All \n                         I can tell ya, most of the folks is \n                         purty mis'able.\n                              (Sullenly)\n                         But a fella don't know ever'thing.\n\n               There is a disturbed silence as the Joads study the man, but \n               he obviously has no intention of saying anything more. Finally \n               Pa turns to his brother.\n\n                                     PA\n                         John, you never was a fella to say \n                         much, but I'll be goldanged if you \n                         opened your mouth twicet since we \n                         lef' home. What you think about this?\n\n                                     JOHN\n                              (scowling)\n                         I don't think *nothin'* about it. \n                         We're a-goin' there, ain't we?  When \n                         we get there, we'll get there. When \n                         we get a job, we'll work, an' when \n                         we don't get a job we'll set on our \n                         behin's. That's all they is to it, \n                         ain't it?\n\n                                     TOM\n                              (laughing)\n                         Uncle John don't talk much but when \n                         he does he shore talks sense.\n                              (He spurts water out \n                              of his mouth)\n\n               The scene dissolves to a GAS STATION, at night. The Joad \n               truck, loaded with goods and people, is last gas and servicing \n               before the desert. Two white uniformed boys handle the \n               station. A sign reads: \"LAST CHANCE FOR GAS AND WATER.\" Al \n               is filling the radiator. Tom is counting out the money for \n               the gas.\n\n                                     FIRST BOY\n                         You people got a lotta nerve.\n\n                                     TOM\n                         What you mean?\n\n                                     FIRST BOY\n                         Crossin' the desert in a jalopy like \n                         this.\n\n                                     TOM\n                         You been acrost?\n\n                                     FIRST BOY\n                         Sure, plenty, but not in no wreck \n                         like this.\n\n                                     TOM\n                         If we broke down maybe somebody'd \n                         give us a han'.\n\n                                     FIRST BOY\n                              (doubtfully)\n                         Well, maybe. But I'd hate to be doin' \n                         it. Takes more nerve than I got.\n\n                                     TOM\n                              (laughing)\n                         It don't take no nerve to do somep'n \n                         when there ain't nothin' else you \n                         can do.\n                              (He climbs into the \n                              driver's seat)\n\n               MA AND GRANMA are seen lying on a mattress in the TRUCK. \n               Granma's eyes are shut. Actually she is near death. Ma keeps \n               patting her.\n\n                                     MA\n                              (softly)\n                         Don't you worry, Granma. It's gonna \n                         be awright.\n\n                                     GRANMA\n                              (mumbling)\n                         Grampa... Grampa... I want Grampa...\n\n                                     MA\n                         Don't you fret now.\n\n               The truck moves off.\n\n               We see the GAS STATION again with the truck pulling away. \n               The First Boy, a lad who knows everything, stands looking \n               after them, shaking his head. His assistant is cleaning up \n               the pumps.\n\n                                     FIRST BOY\n                         Holy Moses, what a hard-lookin' \n                         outfit!\n\n                                     SECOND BOY\n                         All them Okies is hard-lookin'.\n\n                                     FIRST BOY\n                         Boy, but I'd hate to hit that desert \n                         in a jalopy like that!\n\n                                     SECOND BOY\n                              (contentedly)\n                         Well, you and me got sense. Them \n                         Okies got no sense or no feeling. \n                         They ain't human. A human being \n                         wouldn't live like they do. A human \n                         being couldn't stand it to be so \n                         miserable.\n\n                                     FIRST BOY\n                         Just don't know any better, I guess.\n\n               NOAH is seen hiding behind a corner of the GAS STATION. \n               Peering out, he sees that the truck has gone. He turns to \n               walk away into the darkness.\n\n               The scene dissolves to a RIVER BANK at night, and Noah is \n               once more seated in the shallow water, splashing, looking up \n               at the mountains, content.\n\n               The TRUCK is rattling along U.S. Highway 66, across the \n               desert, in the night. In the DRIVER'S SEAT Tom is driving, \n               Al and Pa are by his side.\n\n                                     AL\n                         What a place! How'd you like to walk \n                         acrost her?\n\n                                     TOM\n                         People done it. If they could, we \n                         could.\n\n                                     AL\n                         Lots must a died, too.\n\n                                     TOM\n                              (after a pause)\n                         Well, we ain't out a it yet.\n\n               RUTHIE AND WINFIELD huddle together in THE TRUCK, eyes wide \n               with excitement.\n\n                                     RUTHIE\n                         This here's the desert an' we're \n                         right in it!\n\n                                     WINFIELD\n                              (trying to see)\n                         I wisht it was day.\n\n                                     RUTHIE\n                         Tom says if it's day it'll cut you \n                         gizzard smack out a you.\n                              (Trying to see too)\n                         I seen a pitcher once. They was bones \n                         ever'place.\n\n                                     WINFIELD\n                         Man bones?\n\n                                     RUTHIE\n                         Some, I guess, but mos'ly cow bones.\n\n               MA AND GRANDMA are seen again. The old woman lies still, \n               breathing noisily. Ma continues to pat her.\n\n                                     MA\n                              (whispering)\n                         'S awright, honey. Everything's gonna \n                         be awright.\n\n               Then we see the TRUCK still churning along Highway 66 by \n               night. CASY is asleep in the truck, his face wet with sweat. \n               CONNIE AND ROSASHARN are huddled together, damp and weary.\n\n                                     ROSASHARN\n                         Seems like we wasn't never gonna do \n                         nothin' but move. I'm so tar'd.\n\n                                     CONNIE\n                              (sullenly)\n                         Women is always tar'd.\n\n                                     ROSASHARN\n                              (fearfully)\n                         You ain't--you ain't sorry, are you, \n                         honey?\n\n                                     CONNIE\n                              (slowly)\n                         No, but--but you seen that \n                         advertisement in the Spicy Western \n                         Story magazine. Don't pay nothin'. \n                         Jus' send 'em the coupon an' you're \n                         a radio expert--nice clean work.\n\n                                     ROSASHARN\n                              (pleadingly)\n                         But we can still do it, honey.\n\n                                     CONNIE\n                              (sullenly)\n                         I ought to done it then--an' not \n                         come on any trip like this.\n\n               Her eyes widen with fright as he avoids meeting her glance.\n\n               MA AND GRANDMA lie side by side. Ma's hand is on Grandma's \n               heart. The old woman's eyes are shut and her breathing is \n               almost imperceptible.\n\n                                     MA\n                              (whispering)\n                         We can't give up, honey. The family's \n                         got to get acrost. You know that.\n\n                                     JOHN'S VOICE\n                         Ever'thing all right?\n\n               Ma does not answer immediately. Her head lifted, she is \n               staring at Granma's face. Then slowly she withdraws her hand \n               from Grandma's heart.\n\n                                     MA\n                              (slowly)\n                         Yes, ever'thing's all right. I--I \n                         guess I dropped off to sleep.\n\n               Her head rests again. She lies looking fixedly at the still \n               face.\n\n               The scene dissolves to an INSPECTION STATION, near Daggett, \n               California, at night. Obeying a sign that reads: \"KEEP RIGHT \n               AND STOP,\" the Joad truck pulls up under a long shed as two \n               officers, yawning, come out to inspect it. One takes down \n               the license number and opens the hood. The people aboard the \n               truck bestir themselves sleepily.\n\n                                     TOM\n                         What's this here?\n\n                                     OFFICER\n                         Agricultural inspection. We got to \n                         go over your stuff. Got any vegetables \n                         or seed?\n\n                                     TOM\n                         No.\n\n                                     OFFICER\n                         Well, we got to look over your stuff. \n                         You got to unload.\n\n               MA gets down off the truck, her face swollen, her eyes hard. \n               There is an undercurrent of hysteria in her voice and manner.\n\n                                     MA\n                         Look, mister. We got a sick ol' lady. \n                         We got to get her to a doctor. We \n                         can't wait.\n                              (Almost hysterically)\n                         You can't make us wait!\n\n                                     OFFICER\n                         Yeah? Well, we got to look you over.\n\n                                     MA\n                         I swear we ain't got anything. I \n                         swear it. An' Granma's awful sick.\n                              (Pulling him to the \n                              truck)\n                         Look!\n\n               The officer lights his flashlight on Granma's face.\n\n                                     OFFICER\n                              (shocked)\n                         You wasn't foolin'! You swear you \n                         got no fruit or vegetables?\n\n                                     MA\n                         No, I swear it.\n\n                                     OFFICER\n                         Then go ahead. You can get a doctor \n                         at Barstow. That's just eight miles. \n                         But don't stop. Don't get off. \n                         Understand?\n\n               Ma climbs back up beside Granma.\n\n                                     TOM\n                         Okay, cap. Much oblige.\n\n               The truck starts.\n\n                                     MA\n                              (to John)\n                         Tell Tom he don't have to stop. \n                         Granma's all right.\n\n               The TRUCK moves away on Highway 66.\n\n               The scene dissolves to the TEHACHAPI VALLEY, by day. Taking \n               it from the book, there is a breath-taking view of the valley \n               from where Highway 66 comes out of the mountains. This is \n               the California the Joads have dreamed of, rich and beautiful, \n               the land of milk and honey. It is just daybreak, with the \n               sun at the Joad's back. They have pulled off the side of the \n               road and stopped, just to drink in the sight. They are looking \n               almost reverently at the sight before them as they climb \n               stiffly out of the truck.\n\n                                     AL\n                         Will ya look at her!\n\n                                     PA\n                              (shaking his head)\n                         I never knowed they was anything \n                         like her!\n\n               One by one, they climb down.\n\n                                     TOM\n                         Where's Ma? I want Ma to see it. \n                         Look, Ma! Come here, Ma!\n\n               He starts back. MA is holding to the rear of the truck, her \n               face stiff and swollen, her eyes deep-sunk, her limbs weak \n               and shaky.\n\n                                     TOM\n                              (shocked)\n                         Ma, you sick?\n\n                                     MA\n                              (hoarsely)\n                         Ya say we're acrost?\n\n                                     TOM\n                              (eagerly)\n                         Look, Ma!\n\n                                     MA\n                         Thank God!  An' we're still together--\n                         most of us.\n                              (Her knees buckle and \n                              she sits down on the \n                              running board)\n\n                                     TOM\n                         Didn' you get no sleep?\n\n                                     MA\n                         No.\n\n                                     TOM\n                         Was Granma bad?\n\n                                     MA\n                              (after a pause)\n                         Granma's dead.\n\n                                     TOM\n                              (shocked)\n                         When?\n\n                                     MA\n                         Since before they stopped us las' \n                         night.\n\n                                     TOM\n                         An' that's why you didn't want 'em \n                         to look?\n\n                                     MA\n                              (nodding)\n                         I was afraid they'd stop us an' \n                         wouldn't let us cross. But I tol' \n                         Granma. I tol' her when she was dyin'. \n                         I tol' her the fambly had ta get \n                         acrost. I tol' her we couldn't take \n                         no chances on bein' stopped.\n\n               With the valley for background, Ma looks down on it.\n\n                                     MA\n                              (softly)\n                         So it's all right. At leas' she'll \n                         get buried in a nice green place. \n                         Trees and flowers aroun'.\n                              (Smiling sadly)\n                         She got to lay her head down in \n                         California after all.\n\n               The scene fades out.\n\n               A TOWN STREET, by day, fades in. Down a town or small city \n               business street, with quite a bit of traffic, comes the Joad \n               truck being pushed by the Joad men. At the wheel, aiming at \n               a corner gas station, is Rosasharn, frightened and uncertain, \n               with Ma beside her on the front seat. In the back Ruthie and \n               Winfield are delighted with this new form of locomotion. \n               Crossing the street, a policeman falls into step with Tom.\n\n                                     POLICEMAN\n                         How far you figger you gonna get \n                         *this* way?\n\n                                     TOM\n                         Right here. We give out a gas.\n\n               It is a two-pump station and one of the pumps has a car, \n               with the attendant servicing it. The Joad truck stops by the \n               other pump and Tom, wiping his face with his sleeve, grins \n               and address himself to the policeman. The others stand \n               listening solemnly in the background.\n\n                                     TOM\n                         Where's the bes' place to get some \n                         work aroun' here?\n                              (Pulling out the \n                              handbill)\n                         Don't matter what kin' either.\n\n                                     POLICEMAN\n                              (patiently)\n                         If I seen one a them things I must a \n                         seen ten thousan'.\n\n                                     PA\n                         Ain't it no good?\n\n                                     POLICEMAN\n                              (shaking his head)\n                         Not here--not now. Month ago there \n                         was some pickin' but it's all moved \n                         south now. Where'bouts in Oklahoma \n                         you from?\n\n                                     TOM\n                         Sallisaw.\n\n                                     POLICEMAN\n                         I come out from Cherokee County--two \n                         years ago.\n\n                                     ROSASHARN\n                              (pleased)\n                         Why, Connie's folks from Cherokee \n                         County--\n\n                                     POLICEMAN\n                              (stopping her wearily)\n                         Okay, ma'am, let's don't go into it. \n                         I already met about a hundred firs' \n                         cousins an' it mus' be five hundred \n                         secon'. But this is what I got to \n                         tell you, don't try to park in town \n                         tonight. Keep on out to that camp. \n                         If we catch you in town after dark \n                         we got to lock you up. Don't forget.\n\n                                     PA\n                              (worriedly)\n                         But what we gonna *do*?\n\n                                     POLICEMAN\n                              (about to leave)\n                         Pop, that just ain't up to me.\n                              (Grimly he points to \n                              the handbill)\n                         But I don't min' tellin' you, the \n                         guy they *ought* to lock up is the \n                         guy that sent out *them* things.\n\n               He strolls away, the Joads looking concernedly after him, \n               just as the gas station attendant comes briskly to them after \n               disposing of the other car.\n\n                                     ATTENDANT\n                              (brightly)\n                         How many, folks?\n\n                                     AL\n                              (after a pause)\n                         One.\n\n               The attendant regards him in disgust.\n\n               The scene dissolves to HOOVERVILLE, by day. A large migrant \n               camp, a typical shanty town of ragged tents and tarpaper \n               shacks, jalopies and dirty children. A dozen or more children \n               pause to watch as the Joad truck lumbers down a dirt incline \n               from the road and stops at the edge of the camp in front of \n               one of the most miserable of the shacks. The Joads regard \n               the camp with dismay.\n\n                                     TOM\n                              (shaking his head)\n                         She shore don't look prosperous. \n                         Want to go somewheres else?\n\n                                     MA\n                         On a gallon a gas?\n                              (As Tom grins at her)\n                         Let's set up the tent. Maybe I can \n                         fix us up some stew.\n\n               The truck moves into the camp through a lane of children.\n\n               The scene dissolves to the JOAD TENT. In front of it, Ma is \n               on her knees feeding a small fire with broken sticks. On the \n               fire is a pot of stew. Ruthie and Winfield stand watching \n               the pot. About fifteen ragged, barefooted children in a half-\n               circle are now around the fire, their solemn eyes on the pot \n               of stew. Occasionally they look at Ma, then back at the stew. \n               Presently one of the older girls speaks.\n\n                                     GIRL\n                              (shyly)\n                         I could break up some bresh if you \n                         want me, ma'am.\n\n                                     MA\n                              (gently)\n                         You want to get ast to eat, hunh?\n\n                                     GIRL\n                              (simply)\n                         Yes, ma'am.\n\n                                     MA\n                         Didn' you have no breakfast?\n\n                                     GIRL\n                         No, ma'am. They ain't no work \n                         hereabouts. Pa's in tryin' to sell \n                         some stuff to get gas so's we can \n                         get along.\n\n                                     MA\n                         Didn' none of these have no breakfast?\n\n               There is a long silence. Then:\n\n                                     BOY\n                              (boastfully)\n                         I did. Me an' my brother did. We et \n                         good.\n\n                                     MA\n                         Then you ain't hungry, are you?\n\n               The boy chokes, his lip sticks out.\n\n                                     BOY\n                              (doggedly)\n                         We et good.\n                              (Then he breaks and \n                              runs)\n\n                                     MA\n                         Well, it's a good thing *some* a you \n                         ain't hungry, because they ain't \n                         enough to go all the way roun'.\n\n                                     GIRL\n                         Aw, he was braggin'. Know what he \n                         done? Las' night, come out an' say \n                         they got chicken to eat. Well, sir, \n                         I looked in whilst they was a-eatin' \n                         an' it was fried dough jus' like \n                         ever'body else.\n\n               Pa and John enter.\n\n                                     PA\n                         How 'bout it?\n\n                                     MA\n                              (to Ruthie)\n                         Go get Tom an' Al.\n                              (looking helplessly \n                              at the children)\n                         I dunno what to do. I got to feed \n                         the fambly. What'm I gonna do with \n                         these here?\n\n               She is dishing the stew into tin plates. The children's eyes \n               follow the spoon, and then the first plate, to John. He is \n               raising the first spoonful to his mouth when he notices them \n               apparently for the first time. He is chewing slowly, his \n               eyes on the children, their eyes on his face, when Tom and \n               Al enter.\n\n                                     JOHN\n                              (standing up)\n                         You take this.\n                              (Handing plate to Tom)\n                         I ain't hungry.\n\n                                     TOM\n                         Whatta ya mean? You ain't et today.\n\n                                     JOHN\n                         I know, but I got a stomickache. I \n                         ain't hungry.\n\n                                     TOM\n                              (after a glance at \n                              the children)\n                         You take that plate inside the tent \n                         an' you eat it.\n\n                                     JOHN\n                         Wouldn't be no use. I'd still see \n                         'em inside the tent.\n\n                                     TOM\n                              (to the children)\n                         You git. Go on now, git. You ain't \n                         doin' no good. They ain't enough for \n                         you.\n\n               The children retreat a step, but no more, and then look \n               wonderingly at him.\n\n                                     MA\n                         We can't send 'em away. Take your \n                         plates an' go inside. Take a plate \n                         to Rosasharn.\n                              (Smiling, to the \n                              children)\n                         Look. You little fellas go an' get \n                         you each a flat stick an' I'll put \n                         what's lef' for you.\n                              (The children scatter)\n                         But they ain't to be no fightin'!\n                              (Dishing plates for \n                              Ruthie and Winfield)\n                         I don't know if I'm doin' right or \n                         not but--go inside, ever'body stay \n                         inside.\n                              (The children are \n                              back)\n                         They ain't enough. All you gonna get \n                         is jus' a taste but--I can't help \n                         it, I can't keep it from you.\n\n               She goes in the tent hurriedly to hide the fact that tears \n               have come into her eyes. The children pounce on the pot, \n               silently, too busy digging for the stew to speak.\n\n               INSIDE THE TENT they have all finished their stew already.\n\n                                     MA\n                              (bitterly)\n                         I done fine! Now nobody got enough!\n\n               At the ROAD a new coupe drives off the highway and into the \n               camp and stops. It contains two men. One gets out.\n\n               A GROUP OF MEN are squatting in a half-circle, the usual \n               pattern for conversation, but they are silent now as their \n               eyes fix on the man approaching. He is a labor agent.\n\n               OUTSIDE THE JOAD TENT the men are looking in the direction \n               of the group. They start to walk toward it.\n\n               AT THE GROUP OF MEN: The agent, wearing a flat-brimmed Stetson \n               and with his pockets filled with pencils and dog-eared \n               booklets, looks down at the silent men. All of the men in \n               the camp are approaching slowly, silently. The women give \n               their anxious attention in the background. Among the men who \n               walk up is FLOYD, a grimly disappointed young man.\n\n                                     AGENT\n                         You men want to work?\n\n                                     PA\n                         Sure we wanta work. Where's it at?\n\n                                     AGENT\n                         Tulare County. Fruit's opening up. \n                         Need a lot of pickers.\n\n                                     FLOYD\n                         You doin' the hirin'?\n\n                                     AGENT\n                         Well, I'm contracting the land.\n\n                                     FIRST MAN\n                         Whay you payin?\n\n                                     AGENT\n                         Well, can't tell exactly, yet. 'Bout \n                         thirty cents, I guess.\n\n                                     FIRST MAN\n                         Why can't you tell? You took the \n                         contrac', didn' you?\n\n                                     AGENT\n                         That's true. But it's keyed to the \n                         price. Might be a little more, might \n                         be a little less.\n\n                                     FLOYD\n                              (quietly)\n                         All right, mister. I'll go. You just \n                         show your license to contrack, an' \n                         then you make out a order--where an' \n                         when an' how much you gonna pay--an' \n                         you sign it an' we'll go.\n\n                                     AGENT\n                              (ominously)\n                         You trying to tell me how to run my \n                         own business?\n\n                                     FLOYD\n                         'F we're workin' for you, it's our \n                         business too. An' how do we know--\n                              (pulling out a handbill)\n                         --you ain't one a the guys that sent \n                         these things out?\n\n                                     AGENT\n                              (tough)\n                         Listen, Smart Guy. I'll run my \n                         business my own way. I got work. If \n                         you wanta take it, okay. If not, \n                         just sit here, that's all.\n\n               The squatting men have risen one by one. Their faces are \n               expressionless because they simply don't know when one of \n               these calls is genuine or when it isn't. Floyd addresses \n               them.\n\n                                     FLOYD\n                         Twicet now I've fell for that line. \n                         Maybe he needs a thousan' men. So he \n                         get's five thousan' there, an' he'll \n                         pay fifteen cents a hour. An' you \n                         guys'll have to take it 'cause you'll \n                         be hungry.\n                              (Facing the agent)\n                         'F he wants to hire men, let him \n                         write it out an' say what he's gonna \n                         pay. Ast to see his license. He ain't \n                         allowed by law to contrack men without \n                         a license.\n\n                                     AGENT\n                              (turning)\n                         Joe!\n\n               The other man gets out of the COUPE. He wears riding breeches \n               and laced boots, carries a pistol and cartridge belt, and \n               there is a deputy sheriff's star on his brown shirt. He smiles \n               thinly and shifts his pistol holster as he starts toward the \n               group. THE MEN are watching the deputy approach.\n\n                                     FLOYD\n                              (angrily)\n                         You see? If this guy was on the level, \n                         would he bring a cop along?\n\n                                     DEPUTY\n                              (entering)\n                         What's the trouble?\n\n                                     AGENT\n                              (pointing at Floyd)\n                         Ever see this guy before?\n\n                                     DEPUTY\n                         What'd he do?\n\n                                     AGENT\n                         He's agitatin'.\n\n                                     DEPUTY\n                         Hmmm.\n                              (Giving Floyd a looking \n                              over)\n                         Seems like I have. Seems like I seen \n                         him hangin' around that used car lot \n                         that was busted into. Yep, I'd swear \n                         it's the same fella.\n                              (Sharply)\n                         Get in that car.\n\n                                     TOM\n                         You got nothin' on him.\n\n                                     DEPUTY\n                         Open your trap again and you'll go \n                         too.\n\n                                     AGENT\n                              (to the men)\n                         You fellas don't wanta lissen to \n                         troublemakers. You better pack up \n                         an' come on to Tulare County.\n\n               The men say nothing.\n\n                                     DEPUTY\n                         Might be a good idea to do what he \n                         says. Too many of you Okies aroun' \n                         here already. Folks beginnin' to \n                         figger it ain't maybe *safe*. Might \n                         start a epidemic or sump'n.\n                              (After a pause)\n                         Wouldn't like a bunch a guys down \n                         here with pick handles tonight, would \n                         you?\n\n               As the agent gets into the coupe FLOYD'S thumbs hook over \n               his belt and he looks off, away. TOM'S look away is an answer. \n               His thumbs also hook over his belt.\n\n                                     DEPUTY\n                              (to Floyd)\n                         Now, you.\n\n               He takes hold of Floyd's left arm. At the same time Floyd \n               swings, smacks him in the face. As the deputy staggers, Tom \n               sticks out a foot and trips him. Floyd is already running \n               through the camp. The deputy fires from the ground. There is \n               a scream. A WOMAN is looking down at her hand, the knuckles \n               shot away.\n\n               The COUPE is seen as the agent steps on the gas to get away. \n               As Floyd gets in the clear, the DEPUTY, sitting on the ground, \n               aims his pistol again, slowly, carefully. Behind him Casy \n               steps up, gauges his distance, and then kicks him square in \n               the base of the skull. The deputy tumbles over unconscious. \n               Tom picks up the pistol.\n\n                                     CASY\n                         Gimme that gun. Now git outa here. \n                         Go down in them willows an' wait.\n\n                                     TOM\n                              (angrily)\n                         I ain't gonna run.\n\n                                     CASY\n                         He seen you, Tom! You wanta be \n                         fingerprinted? You wanta get sent \n                         back for breakin' parole?\n\n                                     TOM\n                         You're right!\n\n                                     CASY\n                         Hide in the willows. If it's awright \n                         to come back I'll give you four high \n                         whistles.\n\n               As Tom strides away there is the distant sound of a siren. \n               Casy empties the gun and throws cartridges and gun aside. \n               The men, aghast, have been standing back, worried and excited \n               and apprehensive. They wish nothing like this had happened. \n               The women have gathered around the wounded woman, who is \n               sobbing. Now at the sound of the siren everybody begins to \n               move uncomfortably toward his tent or shack. Al looks \n               admiringly from Casy to the unconscious deputy.\n\n               Everybody has disappeared into his tent but Al and Casy. The \n               siren draws nearer.\n\n                                     CASY\n                         Go on. Get in your tent. You don't \n                         know nothin'.\n\n                                     AL\n                         How 'bout you?\n\n                                     CASY\n                              (grinning)\n                         *Some*body got to take the blame. \n                         They just *got* to hang it on \n                         somebody, you know.\n                              (Shrugging)\n                         An' I ain't doin' nothin' but set \n                         around.\n\n                                     AL\n                         But ain't no reason--\n\n                                     CASY\n                              (savagely)\n                         Lissen. I don't care nothin' about \n                         you, but if you mess in this, your \n                         whole fambly li'ble to get in trouble, \n                         an' Tom get sent back to the \n                         penitentiary.\n\n                                     AL\n                         Okay. I think you're a darn fool, \n                         though.\n\n                                     CASY\n                         Sure. Why not?\n\n               Al heads for the Joad tent and Casy kneels down and lifts \n               the deputy. He wipes his face clean. The deputy begins to \n               come to. An open car curves off the highway, stops in the \n               clearing, and four men with rifles pile out. The deputy sits \n               rubbing his eyes and Casy stands.\n\n                                     SECOND DEPUTY\n                         What's goin' on here?\n\n                                     CASY\n                         This man a yours, he got tough an' I \n                         hit him. Then he started shootin'--\n                         hit a woman down the line--so I hit \n                         him again.\n\n                                     SECOND DEPUTY\n                         Well--what'd you do in the first \n                         place?\n\n                                     CASY\n                         I talked back.\n\n               Two of the men have helped the deputy to his feet. He feels \n               the back of his neck gingerly.\n\n                                     CASY\n                         They's a woman down there like to \n                         bleed to death from his bad shootin'.\n\n                                     SECOND DEPUTY\n                              (to assistant)\n                         Take a look at her.\n                              (To deputy)\n                         Mike, is this the fella that hit \n                         you?\n\n                                     DEPUTY\n                              (dazedly)\n                         Don't look like him.\n\n                                     CASY\n                         It was me, all right. You just got \n                         smart with the wrong fella.\n\n                                     DEPUTY\n                              (shuddering)\n                         Don't look like him, but... maybe it \n                         was. I ain't sure.\n\n                                     SECOND DEPUTY\n                         Get in that car.\n\n               With a deputy on either side of him, Casy climbs in the back \n               seat. The sickish deputy is helped into the car. The other \n               man comes running back.\n\n                                     MAN\n                              (proudly)\n                         Boy, what a mess a .45 does make!  \n                         They got a tourniquet on. We'll send \n                         a doctor out.\n\n               The car starts. CASY and two deputies beside him are revealed \n               in the back seat. Casy sits proudly, head up, eyes front. On \n               his lips is a faint smile; on his face, a curious look of \n               conquest.\n\n                                     DEPUTY\n                              (angry at the whole \n                              business)\n                         But what you gonna do? Must be \n                         *thousands* of 'em around here, sore \n                         and hungry and living in them dumps. \n                         What you gonna do about 'em?\n\n                                     SECOND DEPUTY\n                         You gotta hold 'em down. Hold 'em \n                         down or they'll take over the whole \n                         country. That's all you *can* do.\n\n                                     DEPUTY\n                              (grimly)\n                         Well, they ain't gonna take over \n                         *my* country. I been livin' here too \n                         long for *that*. Maybe some a the \n                         boys better drop around tonight and \n                         give 'em something to think about.\n\n               Casy sits with eyes front. AT THE WILLOWS, screened by trees \n               or brush, Tom looks off at the car taking Casy away. Starting \n               at a sound, he withdraws into the brush as the scene \n               dissolves.\n\n               IN FRONT OF THE JOAD TENT, at night, Ma stands facing Pa and \n               Al. Rosasharn lies on a pallet, her face in her arms, while \n               Ruthie and Winfield look on, wide-eyed at the family quarrel.\n\n                                     PA\n                              (to Ma)\n                         Leave him alone, Ma--Al's just billy-\n                         goatin' around--\n\n                                     AL\n                         Sure! I was just aimin' to meet up \n                         with a couple girls I know.\n\n                                     MA\n                         You don't know *no* girls around \n                         here. You're lyin', *You're runnin' \n                         away*!\n\n                                     PA\n                              (a short flash of \n                              momentary but ill \n                              advised belligerence)\n                         Cut it out, Ma, or I'll--\n\n                                     MA\n                              (softly, as she picks \n                              up jack-handle)\n                         You'll *what*?... Come on, Pa. Come \n                         on an' whup me. Jus' try it.\n\n                                     PA\n                              (solemnly)\n                         Now don't get sassy, Ma.\n\n                                     MA\n                         Al ain't a-goin' away, an' you gonna \n                         *tell* him he ain't a-goin' away.\n                              (Hefting the jack-\n                              handle)\n                         An' if you think diff'unt, you gotta \n                         whup me first. So some on.\n\n                                     PA\n                              (helplessly)\n                         I never *seen* her so sassy.\n                              (With a touch of \n                              bewildered pride)\n                         An' she ain't so young, neither!\n\n                                     AL\n                              (sullenly)\n                         I'd come back--\n\n                                     MA\n                              (eyes on Pa)\n                         But ef you *do* whup me, I swear you \n                         better not ever go to sleep again, \n                         because the minute you go to sleep, \n                         or you're settin' down, or your back's \n                         turned, I'm gonna knock you belly-up \n                         with a bucket.\n\n               They stand staring at each other in silence.\n\n               At the EDGE OF HOOVERVILLE, Tom is heading for the Joad tent \n               warily, glancing around constantly, but not running, for \n               that would draw attention to him.\n\n               IN FRONT OF THE JOAD TENT again:\n\n                                     PA\n                              (helplessly)\n                         Jus' sassy, that's all.\n\n                                     MA\n                              (angrily)\n                         Sassy my foot! I'm jus' sick and \n                         tar'd a my folks tryin' to bust up. \n                         All we got lef' in the *worl'* is \n                         the fambly--an' right down at bottom \n                         that's all we *got* to have! Ef some \n                         of us dies, we can't he'p that--but \n                         ain't nobody else runnin' away!\n\n                                     AL\n                         But it ain't runnin' away, Ma. All I \n                         wanta do is go away with another \n                         fella an' look aroun' for work by \n                         ourself--\n\n                                     MA\n                              (blazing)\n                         Well, you ain't a-goin'! Ain't \n                         *nobody* else a-goin'! We *got* here \n                         an' we gonna *stay* here, together! \n                         As long as we got the fambly unbroke \n                         I ain't scared, but it's a long bitter \n                         road we got ahead of us--\n                              (squaring off)\n                         --an' I'm here to tell ya ef anybody \n                         else tries to bust us up anymore I'm \n                         a-goin' cat wild with this here piece \n                         a bar-arn!\n\n               As she gets ready for whatever... IN THE SHADOWS, twenty \n               feet away from the tent, Tom whistles softly.\n\n                                     TOM\n                         Hey, Al!\n\n               IN FRONT OF THE JOAD TENT, all but Ma are looking off. Ma \n               still eyes Pa.\n\n                                     AL\n                              (peering into the \n                              darkness)\n                         Tom? You can come on. They gone.\n\n                                     TOM\n                              (entering quickly)\n                         We got to get outa here right away. \n                         Ever'body here? Where's Uncle John?\n\n                                     JOHN\n                              (from tent)\n                         Here I am.\n\n                                     PA\n                         What's a matter now?\n\n                                     TOM\n                         Fella tells me some a them poolroom \n                         boys figgerin' to burn the whole \n                         camp out tonight. Got to get that \n                         truck loaded--what you doin' with \n                         the jack-handle, Ma?\n\n                                     MA, PA, AND AL\n                              (together)\n                         Al's tryin' to go away... She jus' \n                         got sassy... All I aimed to do...\n\n                                     TOM\n                              (taking the jack-handle)\n                         Awright, you can fight it out later. \n                         Right now we got to hustle. Where's \n                         Connie?\n\n               There is a silence that stops Tom in his rush of preparation.\n\n                                     MA\n                              (quietly)\n                         Connie's gone.\n                              (Indicating Rosasharn)\n                         Lit out this e'enin'--said he didn't \n                         know it was gonna be like this.\n\n                                     PA\n                              (angrily)\n                         Glad to get shet of him. Never was \n                         no good an' never will be--\n\n                                     MA\n                         Pa! Shh!\n\n                                     PA\n                         How come I got to shh? Run out, didn't \n                         he?\n\n                                     TOM\n                              (looking to Rosasharn)\n                         Cut it out, Pa. He'p Al with the \n                         truck.\n                              (He kneels beside \n                              Rosasharn. Gently)\n                         Don't fret, honey. You goin' to be \n                         awright.\n\n                                     ROSASHARN\n                              (uncovering her face)\n                         Tom, I jus' don't feel like nothin' \n                         a tall. Without him I jus' don't \n                         wanta live.\n\n                                     TOM\n                         Maybe he'll be back. We'll leave \n                         word for him. Jus' don't cry.\n                              (He pats her awkwardly)\n\n               The scene dissolves to HOOVERVILLE, at night. The jalopies \n               are lumbering up on the road, one after the other, as the \n               migrants scatter before the threatened invasion.\n\n               IN THE JOAD TRUCK, Tom is helping Rosasharn into the front \n               seat, beside Ma. The others are aboard except Al. Tom hands \n               Al a wrench.\n\n                                     TOM\n                         Just in case. Sit up back an' if \n                         anybody tries to climb up--let 'im \n                         have it.\n\n                                     PA\n                              (from truck)\n                         I ain't got nothin' in *my* han'.\n\n                                     TOM\n                              (to Al)\n                         Give 'im a fryin' pan.\n                              (He gets into the \n                              driver's seat and \n                              starts the truck)\n\n               In the FRONT SEAT of the truck, Tom drives, Ma sits in the \n               middle, Rosasharn on the other side.\n\n                                     ROSASHARN\n                              (hopefully)\n                         Maybe Connie went to get some books \n                         to study up with. He's gonna be a \n                         radio expert, ya know. Maybe he \n                         figgered to suprise us.\n\n                                     MA\n                         Maybe that's jus' what he done.\n\n                                     TOM\n                         Ma, they comes a time when a man \n                         gets mad.\n\n                                     MA\n                         Tom--you tol' me--you promised you \n                         wasn't like that. You promised me.\n\n                                     TOM\n                         I know, Ma. I'm a tryin'. If it was \n                         the law they was workin' with, we \n                         could take it. But it *ain't* the \n                         law. They're workin' away at our \n                         spirits. They're tryin' to make us \n                         cringe an' crawl. They're workin' on \n                         our decency.\n\n                                     MA\n                         You promised, Tommy.\n\n                                     TOM\n                         I'm a-tryin', Ma. Honest I am.\n\n                                     MA\n                         You gotta keep clear, Tom. The \n                         fambly's breakin' up. You *got* to \n                         keep clear.\n\n                                     TOM\n                         What's that--detour?\n\n               As he slows down the truck, we see that half of the ROAD is \n               blocked with boards and red lanterns. a group of men swarm \n               around the Joad truck as it stops. A leader leans in Tom's \n               window.\n\n                                     LEADER\n                         Where you think you're goin'?\n\n               In the FRONT SEAT of the truck Tom's hand reaches for the \n               jack-handle on the seat at his side but Ma's hand clutches \n               his arm in a steel grip.\n\n                                     TOM\n                         Well--\n                              (then in a servile \n                              whine)\n                         --we're strangers here. We heard \n                         about they's work in a place called \n                         Tulare.\n\n                                     LEADER\n                         Well, you're goin' the wrong way, \n                         an' what's more, we don't want no \n                         more Okies in this town. We ain't \n                         got work enough for them that are \n                         already here.\n\n               Tom's arm trembles as he tries to pull it away, but Ma holds \n               on tight.\n\n                                     TOM\n                         Which way is it at, mister?\n\n                                     LEADER\n                         You turn right aroun' and head north. \n                         An' don't come back till the cotton's \n                         ready.\n\n                                     TOM\n                         Yes, sir.\n\n               The TRUCK turns around. In the FRONT SEAT Tom is almost \n               sobbing with anger as he maneuvers the truck around.\n\n                                     MA\n                              (whispering)\n                         Don't you min', Tommy. You done good. \n                         You done jus' good.\n\n               The TRUCK is going back down the road as the scene fades \n               out.\n\n               A MONTAGE fades in: superimposed on growing fields hand-made \n               signs flash by: NO HELP WANTED, KEEP OUT--THIS MEANS U, NO \n               WORK, NO HELP WANTED.\n\n               Then we see the JOAD TRUCK pulled up off the paved highway, \n               and jacked up while Tom and Al fix a puncture. Ma is seated \n               in the front seat with Rosasharn. Pa and Uncle John are \n               puttering about worriedly.\n\n                                     MA\n                              (thoughtfully)\n                         Sump'n got to happen soon. We got \n                         one day's more grease, two day's \n                         flour, an' ten potatoes. After that...\n                              (Looking at Rosasharn)\n                         An' Rosasharn, we got to remember \n                         she's gonna be due soon.\n\n                                     PA\n                              (shaking his head)\n                         It sure is hell jus' tryin' to get \n                         enough to eat.\n\n                                     TOM\n                         Fella tells me they's three hunerd \n                         thousan' aroun' here like us, a-\n                         scrabblin' for work an' livin' like \n                         hogs. Can't figger what it is, but \n                         *sump'n's* wrong.\n\n               A BUICK ROADMASTER which has been speeding toward them stops \n               suddenly. Driving it is a husky man, named Spencer, whose \n               manner is amiable and disarming.\n\n                                     SPENCER\n                         Morning.\n\n                                     TOM\n                         Morning.\n\n                                     SPENCER\n                         You people looking for work?\n\n                                     TOM\n                         Mister, we're lookin' even under \n                         boards for work.\n\n                                     SPENCER\n                         Can you pick peaches?\n\n                                     TOM\n                         We can pick anything.\n\n                                     SPENCER\n                         Well, there's plenty of work for you \n                         about forty miles north, this road \n                         just outside Pixley. Turn east on 32 \n                         and look for Hooper's ranch. Tell \n                         'em Spencer sent you.\n\n               This is electrifying news, as their faces show.\n\n                                     TOM\n                         Mister, we sure that ya!\n\n               As they snap into action to get under way again the scene \n               dissolves to the FRONT SEAT, Al driving, with Ma and Tom \n               beside him. They are all smiles, their faces glowing with \n               excitement.\n\n                                     MA\n                              (excitedly)\n                         Fust thing I'll get is coffee, cause \n                         ever'body been wantin' that, an' \n                         then some flour an' bakin' powder \n                         an' meat. Better not get no side-\n                         meat right off. Save that for later. \n                         Maybe Sat'dy. Got to get some soap \n                         too. An' milk. Rosasharn's got to \n                         have some milk.\n\n                                     TOM\n                         Get some sugar too, for the coffee.\n\n                                     MA\n                         You know, I jus' can't remember when \n                         I felt so good before!\n\n                                     AL\n                         Know what I'm a-gonna do? I'm a-gonna \n                         save up an' go in town an' get me a \n                         job in a garage. Live in a room an' \n                         eat in restaurants. Go to the movin' \n                         pitchers *ever'* night. Cowboy \n                         pitchers.\n\n               The scene dissolves to the ENTRANCE OF THE HOOPER RANCH in \n               daylight. A gravel road leads from the paved highway to the \n               big wire gates, which are enclosed. Along the side of the \n               paved highway are parked a dozen jalopies, the migrants \n               sitting soberly in them. Fifty or sixty other migrants line \n               the gravel road and the junction with the paved highway. \n               Five jalopies are in line waiting to enter the gates. And \n               the scene is overwhelmingly policed. There must be ten \n               motorcycle cops around. Six are dismounted and strolling to \n               keep order among the migrants along the road. Three, their \n               motorcycles roaring, flank the line of five jalopies. As the \n               Joad truck drives up, we see the FRONT SEAT. Tom, Al, and Ma \n               are beholding the scene with bewilderment.\n\n                                     AL\n                         What is it, a wreck?\n\n                                     COP\n                              (on motorcycle)\n                         Where you think you're going?\n\n                                     TOM\n                         Fella named Spencer sent us--said \n                         they was work pickin' peaches.\n\n                                     COP\n                         Want to work, do you?\n\n                                     TOM\n                         Sure do.\n\n                                     COP\n                         Pull up behind that car.\n                              (Calling)\n                         Okay for this one. Take 'em through.\n\n                                     TOM\n                              (the truck moving)\n                         What's the matter? What's happened?\n\n                                     COP\n                         Little trouble up ahead, but you'll \n                         get through. Just follow the line.\n\n               The motorcycle escort forms around the line of six cars and \n               a deafening din is raised, of motorcycles, sirens, and an \n               inexplicable blowing of horns on the jalopies. At the same \n               time, as the gates open and the six cars start through, \n               flanked by the motorcycle cops, the migrants begin spasmodic \n               shouts, but what they say cannot be understood. As the cars \n               move slowly, Tom and Al in the FRONT SEAT are puzzled and \n               worried at the demonstration.\n\n                                     AL\n                         Maybe the road's out.\n\n                                     TOM\n                         I don't know what these cops got to \n                         do with it but I don't like it.\n                              (Looking out)\n                         An' these here are our own people, \n                         all of 'em. I don't like this.\n\n               AT THE GATES the heckling from the bystanders is spasmodic, \n               not continuous, as the six jalopies in line pass through the \n               gate into the Hooper ranch. Two men stand beside the gates \n               with shotguns. They keep calling.\n\n                                     MEN\n                         Go on, go on! Keep movin'!\n\n               The Joad truck passes through the gates. IN THE HOOPER RANCH \n               the six jalopies are halted at the end of a camp street. The \n               houses are small, square blocks, set in line. One, a little \n               larger, is a grocery store. Casually about are men in pairs \n               with metal stars on their shirts and shotguns in their hands. \n               Two bookkeepers are already passing down the cars and jotting \n               down information.\n\n                                     BOOKKEEPER\n                         Want to work?\n\n                                     TOM\n                         Sure, but what is this?\n\n                                     BOOKKEEPER\n                         That's not your affair. Name.\n\n                                     TOM\n                         Joad.\n\n                                     BOOKKEEPER\n                         How many men?\n\n                                     TOM\n                         Four.\n\n                                     BOOKKEEPER\n                         Women?\n\n                                     TOM\n                         Two.\n\n                                     BOOKKEEPER\n                         Kids?\n\n                                     TOM\n                         Two.\n\n                                     BOOKKEEPER\n                         Can all of you work?\n\n                                     TOM\n                         Why, I guess so.\n\n                                     BOOKKEEPER\n                         Okay. House 63. Wages 5 cents a box. \n                         No bruised fruit. Move along and go \n                         to work right away.\n\n               He moves to the next car. The Joad truck starts...\n\n               AT HOUSE 63, as the Joad truck pulls up, two deputies \n               approach. They look closely into each face as the Joads pile \n               out. One of the deputies has a long list in his hand.\n\n                                     FIRST DEPUTY\n                         Name.\n\n                                     TOM\n                              (impatiently)\n                         Joad. Say, what is this here?\n\n                                     SECOND DEPUTY\n                              (consulting list)\n                         Not here. Take a look at his license.\n\n                                     FIRST DEPUTY\n                         542-567 Oklahoma.\n\n                                     SECOND DEPUTY\n                         Ain't got it. Guess they're okay.\n                              (To Tom)\n                         Now you look here. We don't want no \n                         trouble with you. Jes' do your work \n                         and mind your own business and you'll \n                         be all right.\n                              (The deputies walk \n                              away)\n\n                                     TOM\n                         They sure do want to make us feel at \n                         home all right.\n\n               Ma and Rosasharn step inside the house. It is filthy. A rusty \n               tin stove resting on four bricks is all the one room contains. \n               Ma and Rosasharn stand looking around at it. Finally:\n\n                                     ROSASHARN\n                         We gonna live here?\n\n                                     MA\n                              (after a moment)\n                         Why, sure. It won't be so bad once \n                         we get her washed out.\n\n                                     ROSASHARN\n                         I like the tent better.\n\n                                     MA\n                         This got a floor. Wouldn't leak when \n                         it rains.\n\n               OUTSIDE, a clerk with glasses appears, pushing a cart loaded \n               with three-gallon buckets.\n\n                                     CLERK\n                         Name?\n\n                                     TOM\n                              (patiently)\n                         It's still Joad.\n\n                                     CLERK\n                              (doling out the buckets)\n                         How many?\n\n                                     MA\n                              (at the door)\n                         Six.\n                              (To Tom)\n                         All y'all go. Me an' Rosasharn'll \n                         unload.\n\n               With their buckets they shuffle away toward the peach trees--\n               Tom, Pa, Uncle John, Al, and the two children struggling \n               with the enormous containers.\n\n               The scene dissolves to the INTERIOR OF HOUSE 63 at night, a \n               lantern lighting the scene. Sitting wherever they can, the \n               Joads have finished their supper of hamburgers. And grateful \n               they are too, for the meat.\n\n                                     TOM\n                              (wiping his mouth)\n                         Got any more, Ma?\n\n                                     MA\n                         No. That's all. You made a dollar, \n                         an' that's a dollar's worth.\n\n                                     PA\n                         That!\n\n                                     MA\n                         They charge extry at the comp'ny \n                         store but they ain't no other place.\n\n                                     TOM\n                         I ain't full.\n\n                                     MA\n                         Well, tomorra you'll get in a full \n                         day--full day's pay--an' we'll have \n                         plenty.\n\n                                     PA\n                              (rising)\n                         You wouldn't think jus' reachin' up \n                         an' pickin'd get you in the back.\n\n                                     TOM\n                         Think I'll walk out an' try to fin' \n                         out what all that fuss outside the \n                         gate was. Anybody wanta come with \n                         me?\n\n                                     PA\n                         No. I'm jus' gonna set awhile an' \n                         then go to bed.\n\n                                     AL\n                         Think I'll look aroun' an' see if I \n                         can't meet me a girl.\n\n                                     TOM\n                         Thing's been workin' on me, what \n                         they was yellin' about. Got me all \n                         curious.\n\n                                     JOHN\n                         I got to get a lot curiouser than I \n                         am--with all them cops out there.\n\n                                     TOM\n                              (laughing)\n                         Okay. I be back a little later.\n\n                                     MA\n                         You be careful, Tommy. Don't you be \n                         stickin' your nose in anything.\n\n                                     TOM\n                              (leaving)\n                         Okay, Ma. Don't you worry.\n\n               IN THE RANCH STREET. There is a faint moonlight, but not \n               much, and little sound from the other houses as Tom strolls \n               down the street.\n\n               NEAR THE GATE: beyond, cars pass. As Tom approaches the gate \n               a flashlight plays on his face suddenly and a guard rises \n               from a box.\n\n                                     GUARD\n                         Where you think you're going?\n\n                                     TOM\n                         Thought I'd take a walk. Any law \n                         against it?\n\n                                     GUARD\n                         Well, you just turn around and walk \n                         the other way.\n\n                                     TOM\n                         You mean I can't even get outa here?\n\n                                     GUARD\n                         Not tonight you can't. Want to walk \n                         back?--or you want me to whistle up \n                         some help and take you back?\n\n                                     TOM\n                         I'll walk back.\n\n               The guard watches him as he walks back and then douses his \n               flashlight.\n\n               At a SECTION OF WIRE FENCE, watching his chance, moving \n               silently, Tom drops on the ground, on his back, gets his \n               head under the bottom wire, and pushes himself under and \n               outside. Rising, he crosses the paved highway.\n\n               AN EMBANKMENT across the road from the wire fence: Tom \n               clambers down it, moving quietly. He picks his way down the \n               shallow ravine.\n\n               A TENT: there is a light inside and there are the shadows of \n               figures. In the background, beyond the tent, is the silhouette \n               of a small concrete bridge spanning a small stream. Following \n               a trail, Tom enters and approaches the tent. (The opening is \n               away from him.) IN FRONT OF THE TENT, a man sitting on a box \n               looks up suspiciously as Tom enters. His name is Joe.\n\n                                     TOM\n                         Evenin'.\n\n                                     JOE\n                         Who are you?\n\n                                     TOM\n                         Jus' goin' pas', that's all.\n\n                                     JOE\n                         Know anybody here?\n\n                                     TOM\n                         No. Jus' goin' pas', I tell you.\n\n               A head sticks out of the tent. Until he speaks, Tom does not \n               recognize Casy.\n\n                                     CASY\n                         What's the matter?\n\n                                     TOM\n                         Casy! What you doin' here?\n\n                                     CASY\n                         Well, if it ain't Tom Joad. How ya, \n                         boy?\n\n                                     TOM\n                         Thought you was in jail.\n\n                                     CASY\n                         No, I done my time an' got out. Come \n                         on in.\n                              (He pulls Tom into \n                              the tent.)\n\n               INSIDE THE TENT, three other men sit on the ground as Casy \n               brings Tom in. One's name is Frank.\n\n                                     FRANK\n                         This the fella you been talkin' about?\n\n                                     CASY\n                         This is him. What you doin' here, \n                         Tommy?\n\n                                     TOM\n                         Workin'. Pickin' peaches. But I seen \n                         a bunch a fellas yellin' when we \n                         come in, so I come out to see what's \n                         goin' on. What's it all about?\n\n                                     FRANK\n                         This here's a strike.\n\n                                     TOM\n                              (puzzled)\n                         Well, fi' cents a box ain't much, \n                         but a fella can eat.\n\n                                     FRANK\n                         Fi' cents! They pain' you fi' cents?\n\n                                     TOM\n                         Sure. We made a buck since midday.\n\n                                     CASY\n                              (after a long silence)\n                         Lookie, Tom. We come to work here. \n                         They tell us it's gonna be fi' cents.  \n                         But they was a whole lot of us, so \n                         the man says two an' a half cents. \n                         Well, a fella can't even eat on that, \n                         an' if he got kids...\n                              (After a pause)\n                         So we says we won't take it. So they \n                         druv us off. Now they're payin' you \n                         five--but when they bust this strike \n                         ya think they'll pay five?\n\n                                     TOM\n                         I dunno. Payin' five now.\n\n                                     CASY\n                              (soberly)\n                         I don't expeck we can las' much longer--\n                         some a the folks ain't et for two \n                         days. You goin' back tonight?\n\n                                     TOM\n                         I aim to.\n\n                                     CASY\n                              (earnestly)\n                         Well--tell the folks inside how it \n                         is, Tom. Tell 'em they're starvin' \n                         us and stabbin' theirself in the \n                         back. An' as sure as God made little \n                         apples it's goin' back to two an' a \n                         half jus' as soon as they clear us \n                         out.\n\n                                     FRANK\n                              (suddenly)\n                         You hear sump'n?\n\n               They listen. Then:\n\n                                     TOM\n                         I'll tell 'em. But I don't know how. \n                         Never seen so many guys with guns. \n                         Wouldn't even let us talk today.\n\n                                     CASY\n                         Try an' tell 'em, Tom. They'll get \n                         two an' a half, jus' the minute we're \n                         gone. An' you know what that is? \n                         That's one ton a peaches picked an' \n                         carried for a dollar. That way you \n                         can't even buy food enough to keep \n                         you alive! Tell 'em to come out with \n                         us, Tom! Them peaches is *ripe*. Two \n                         days out an' they'll pay *all* of us \n                         five!\n\n                                     TOM\n                         They won't. They're a-gettin' five \n                         an' they don't care about nothin' \n                         else.\n\n                                     CASY\n                         But jus' the minute they ain't strike-\n                         breakin' they won't get no five!\n\n                                     FRANK\n                              (bitterly)\n                         An' the nex' thing you know you'll \n                         be out, because they got it all \n                         figgered down to a T--until the \n                         harvest is in you're a *migrant* \n                         worker--afterwards, just a bum.\n\n                                     TOM\n                         Five they're a-gettin' now, an' that's \n                         all they're int'rested in. I know \n                         exackly what Pa'd say. He'd jus' say \n                         it wasn't none a his business.\n\n                                     CASY\n                              (reluctantly)\n                         I guess that's right. Have to take a \n                         beatin' before he'll know.\n\n                                     TOM\n                         We was outa food. Tonight we had \n                         meat. Not much, but we had it. Think \n                         Pa's gonna give up his meat on account \n                         a other fellas? An' Rosasharn needs \n                         milk. Think Ma's gonna starve that \n                         baby jus' cause a bunch a fellas is \n                         yellin' outside a gate?\n\n                                     CASY\n                              (sadly)\n                         Got to learn, like I'm a-learnin'. \n                         Don't know it right yet myself, but \n                         I'm tryin' to fin' out. That's why I \n                         can't ever be a preacher again. \n                         Preacher got to *know*.\n                              (Shaking his head)\n                         I don't. I got to *ask*.\n\n                                     JOE\n                              (sticking his head in \n                              tent)\n                         I don't like it.\n\n                                     CASY\n                         What's the matter?\n\n                                     JOE\n                         Can't tell. Seems like I hear sump'n, \n                         an' then I listen an' they ain't \n                         nothin' to hear.\n\n                                     FRANK\n                              (rising)\n                         'Tain't outa the question, y'know.\n                              (He exits)\n\n                                     CASY\n                         All of us a little itchy. Cops been \n                         tellin' us how they gonna beat us up \n                         an' run us outa the country. Not \n                         them reg'lar deppities, but them tin-\n                         star fellas they got for guards.\n                              (After a pause)\n                         They figger I'm the leader because I \n                         talk so much.\n\n               Frank's head sticks in the door. His voice is an excited \n               whisper.\n\n                                     FRANK\n                         Turn out that light an' come outside. \n                         They's sump'n here.\n\n               Quickly Casy turns the light down and out. He gropes for the \n               door, followed by Tom and the other man.\n\n               IN FRONT OF THE TENT:\n\n                                     CASY\n                              (softly)\n                         What is it?\n\n                                     FRANK\n                         I dunno. Listen.\n\n               There are night sounds but little else to be distinguished.\n\n                                     CASY\n                         Can't tell if you hear it or not. \n                         You hear it, Tom?\n\n                                     TOM\n                              (softly)\n                         I hear it. I think they's some guys \n                         comin' this way, lots of 'em. We \n                         better get outa here.\n\n                                     JOE\n                              (whispering)\n                         Down that way--under the bridge span.\n\n               Casy leads the way softly. THE BRIDGE SPAN is seen from the \n               stream as Casy, Tom, and the other man wade carefully toward \n               it.\n\n               UNDER THE BRIDGE it is almost black as they creep through \n               the culvert. Just as Casy and Tom step out from under the \n               bridge on the other side, a blinding flashlight hits them, \n               lighting them like day.\n\n                                     VOICE\n                         There they are! Stand where you are!\n\n               Halted, uncertain, they stand as three men with stars on \n               their coats and pickhandles in their hands slide down the \n               EMBANKMENT. Two of them hold lighted flashlights.\n\n                                     DEPUTY\n                         That's him! That one in the middle, \n                         the skinny one! Chuck! Alec! Here \n                         they are! We got 'em!\n\n               There are faint responses from a distance. CASY AND TOM are \n               alone. The others have fled. The deputies approach, their \n               lights on Casy and Tom.\n\n                                     CASY\n                         Listen, you fellas. You don't know \n                         what you're doin'. You're helpin' to \n                         stave kids.\n\n                                     DEPUTY\n                         Shut up, you red--\n\n               He swings the pickhandle. Casy dodges but the stick cracks \n               his skull. He falls face down out of the light. The deputies \n               watch for a moment but Casy doesn't stir.\n\n                                     SECOND DEPUTY\n                         Looks like to me you killed him.\n\n                                     DEPUTY\n                         Turn him over. Put the light on him.\n\n               Bending over, their bodies hide Casy.\n\n               TOM, seen close, is breathing hard, his eyes glistening.\n\n                                     DEPUTY'S VOICE\n                         Serves him right, too.\n\n               As the deputies straighten up, Tom steps forward, grabs the \n               pickhandle from the man who felled Casy, and swings. The \n               blow strikes the deputy's arm, sending his flashlight flying, \n               and the scene is in semi-darkness as Tom swings again. There \n               is a grunt and a groan as the deputy goes down. Then all is \n               confusion. Backing away, swinging the pickhandle, Tom bolts, \n               splashes a few yards through the stream, turns and gains a \n               better start by throwing the pickhandle at his pursuers. \n               They duck, and Tom disappears into the night. The other men \n               rush through the scene in pursuit.\n\n               THE SECOND DEPUTY is seen bending over the body of the man \n               Tom laid out.\n\n                                     SECOND DEPUTY\n                         Where's that flash?\n\n                                     THIRD DEPUTY\n                         Here.\n\n               The light flashes on the man's face.\n\n                                     THIRD DEPUTY\n                              (awed)\n                         Boy, he's *good* and dead! You see \n                         that fella that done it?\n\n                                     SECOND DEPUTY\n                         I ain't sure--but I caught him one \n                         across the face, and believe me, I \n                         give him a trade-mark *he* ain't \n                         gonna be able to shake off easy!\n\n               TOM is seen crashing through the bushes, his face bloody. \n               The scene fades out.\n\n               THE EXTERIOR OF HOUSE 63 fades in. It is day. Ma comes down \n               the street with a bundle under her arm and enters the house.\n\n               INSIDE HOUSE 63, Rosasharn sits by the window as Ma enters.\n\n                                     MA\n                         Anybody ask anything?\n\n                                     ROSASHARN\n                         No'm.\n\n                                     MA\n                         Stand by the door.\n\n               Rosasharn takes her post at the door as Ma kneels on the \n               floor beside Tom, puts down the rag bundle, and gets a basin. \n               Tom, who is under a quilt, is with his back alone visible. \n               She speaks softly, guardedly, as she bathes his face.\n\n                                     MA\n                         How's it feel, Tommy?\n\n                                     TOM\n                         Busted my cheek but I can still see. \n                         What'd you hear?\n\n                                     MA\n                         Looks like you done it.\n\n                                     TOM\n                              (soberly)\n                         I kinda thought so. Felt like it.\n\n                                     MA\n                         Folks ain't talkin' about much else. \n                         They say they got posses out. Talkin' \n                         about a lynchin'--when they catch \n                         the fella.\n\n                                     TOM\n                         They killed Casy first.\n\n                                     MA\n                         That ain't the way they're tellin' \n                         it. They're sayin' you done it fust.\n\n                                     TOM\n                              (after a pause)\n                         They know what--this fella looks \n                         like?\n\n                                     MA\n                         They know he got hit in the face.\n\n                                     TOM\n                              (slowly)\n                         I'm sorry, Ma. But--I didn't know \n                         what I was doin', no more'n when you \n                         take a breath. I didn't even know I \n                         was gonna do it.\n\n                                     MA\n                         It's awright, Tommy. I wisht you \n                         didn't do it, but you done what you \n                         had to do. I can't read no fault in \n                         you.\n\n                                     TOM\n                         I'm gonna go away tonight. I can't \n                         go puttin' this on you folks.\n\n                                     MA\n                              (angrily)\n                         Tom! They's a whole lot I don't \n                         understan', but goin' away ain't \n                         gonna ease us.\n                              (Thoughtfully)\n                         They was the time when we was on the \n                         lan'. They was a bound'ry to us then. \n                         Ol' folks died off, an' little fellas \n                         come, an' we was always one thing--\n                         we was the fambly--kinda whole an' \n                         clear. But now we ain't clear no \n                         more. They ain't nothin' keeps us \n                         clear. Al--he's a-hankerin' an' a-\n                         jibbitin' to go off on his own. An' \n                         Uncle John is just a-draggin' along. \n                         Pa's lost his place--he ain't the \n                         head no more. We're crackin' up, \n                         Tom. They ain't no fambly now. \n                         Rosasharn--\n                              (a glance at the girl)\n                         --she gonna have her baby, but *it* \n                         ain't gonna have no fambly. I been \n                         tryin' to keep her goin' but--Winfiel'--\n                         what's he gonna be, this-a-way?  \n                         Growin' up wild, an' Ruthie, too--\n                         like animals. Got nothin' to trus'. \n                         Don't go Tom. Stay an' help. Help \n                         me.\n\n                                     TOM\n                              (tiredly)\n                         Okay, Ma. I shouldn't, though. I \n                         know I shouldn't. But okay.\n\n                                     ROSASHARN\n                         Here come a lot of people.\n\n               Tom puts his head under the quilt. Ma turns, faces the door, \n               her body protectively between Tom and whatever threatens.\n\n                                     BOOKKEEPER'S VOICE\n                         How many of you?\n\n                                     MIGRANT'S VOICE\n                         Ten of us. Whatcha payin'?\n\n               OUTSIDE HOUSE 63, the bookkeeper has encountered the \n               newcomers.\n\n                                     BOOKKEEPER\n                         House 25. Number's on the door.\n\n                                     MIGRANT\n                         Okay, mister. Whatcha payin'?\n\n                                     BOOKKEEPER\n                         Two and a half cents.\n\n                                     MIGRANT\n                              (angrily)\n                         Two an' a half! Say, mister, a man \n                         can't make his dinner on that.\n\n                                     BOOKKEEPER\n                         Take it or leave it. There's 200 men \n                         coming from the South that'll be \n                         glad to get it.\n\n                                     MIGRANT\n                         But--but how we gonna eat?\n\n                                     BOOKKEEPER\n                         Look, I didn't set the price. I'm \n                         just working here. If you want it, \n                         take it. If you don't, turn right \n                         around and beat it.\n\n                                     MIGRANT\n                              (sullenly)\n                         Which way is House 25?\n\n                                     TOM\n                              (slowly)\n                         That Casy. He might a been a preacher, \n                         but--he seen a lot a things clear. \n                         He was like a lantern--he helped mw \n                         see things too.\n\n                                     MA\n                         Comes night we'll get outa here.\n\n               At night, the TRUCK is backed up to the door of House 63; it \n               is already loaded. Ma is speaking in a low voice to Tom, who \n               is peering out from under a mattress in the truck.\n\n                                     MA\n                         It's jus' till we get some distance. \n                         Then you can come out.\n\n                                     TOM\n                         I'd hate to get *trapped* in here.\n\n                                     GUARD'S VOICE\n                         What's goin' on here?\n\n               Tom disappears. Ma turns, her back to the truck. The guard \n               plays his flashlight on the Joads, who stand watching him \n               ominously.\n\n                                     PA\n                         We're goin' out.\n\n                                     GUARD\n                         What for?\n\n                                     MA\n                         We got a job offered--good job.\n\n                                     GUARD\n                         Yeah? Let's have a look at you.\n                              (He plays his \n                              flashlight on the \n                              truck)\n                         Wasn't there another fella with you?\n\n                                     AL\n                         You mean that hitch-hiker? Little \n                         short fella with a pale face?\n\n                                     GUARD\n                         I guess that's what he looked like.\n\n                                     AL\n                         We just picked him up on the way in. \n                         He went away this mornin' when the \n                         rate dropped.\n\n                                     GUARD\n                              (thinking hard)\n                         What'd he look like again?\n\n                                     AL\n                         Short fella. Pale face.\n\n                                     GUARD\n                         Was he bruised up this mornin'? About \n                         the face?\n\n                                     AL\n                         I didn't see nothin'.\n\n                                     GUARD\n                              (reluctantly)\n                         Okay. Go on.\n\n               Quickly, Al is in the driver's seat, with Ma and Pa beside \n               him. The truck rattles into motion and moves down the street.\n\n               AT THE GATES TO THE RANCH another guard flashes a light as \n               Al stops the car.\n\n                                     SECOND GUARD\n                         Goin' out for good?\n\n                                     AL\n                         Yeah. Goin' north. Got a job.\n\n                                     SECOND GUARD\n                         Okay.\n\n               He opens the gate and the truck goes through. It turns from \n               the gravel road onto the paved highway.\n\n               IN THE FRONT SEAT OF THE TRUCK:\n\n                                     MA\n                         You done good, Al. Just good.\n\n               Al shows his pleased pride in her quiet approval.\n\n                                     PA\n                         Know where we're a-goin'?\n\n                                     MA\n                              (shaking her head)\n                         Don't matter. Just got to go--an' \n                         keep a-goin', till we get plenty a \n                         distance away from here.\n\n               The TRUCK is rattling along the highway.\n\n               Next, it is day, and the TRUCK is still churning along.\n\n               In the FRONT SEAT, Tom is driving, his cap pulled as far \n               down as possible over his wounded cheek. Rosasharn has taken \n               Pa's place and is leaning wearily against Ma's shoulder.\n\n                                     ROSASHARN\n                         Ma... you know, if Connie was here I \n                         wouldn't min' any a this.\n\n                                     MA\n                         I know, honey, an' just as soon as \n                         we get settled Al's gonna set out \n                         an' look for him. How 'bout gas, \n                         Tommy?\n\n                                     TOM\n                         Full up. Uncle John come through \n                         with five bucks he been hol'in' out \n                         on us since we lef' home.\n\n               The TRUCK keeps moving along.\n\n               Then it is night, and the TRUCK is still making distance.\n\n               On a COUNTRY ROAD, in grey dawn, with a deafening clank under \n               the hood, the Joad truck pulls to a stop off the side of the \n               road. Al is driving. Asleep in Tom's arm in the front seat, \n               Ma stirs awake as Al turns off the ignition and gets out. He \n               lifts the hood.\n\n                                     TOM\n                         She's hotter'n a heifer.\n\n                                     AL\n                         Fan-belt's shot.\n\n               He pulls out the pieces. Tom gets out and takes off the \n               radiator cap. There is a geyser of steam. In the back of the \n               truck the others stand looking on, sleepy-eyed.\n\n                                     TOM\n                              (looking around)\n                         Picks a nice place for it, too, don't \n                         she?\n\n               They all look around. At first they find nothing in sight. \n               Al and Tom look at each other in disgust.\n\n                                     TOM\n                         Any gas?\n\n                                     AL\n                         Gallon or two?\n\n                                     TOM\n                              (whistling)\n                         Well, looks like we done it this \n                         time awright!\n\n                                     ROSASHARN\n                              (standing in truck)\n                         Tommy.\n                              (Pointing)\n                         Some smoke up there.\n\n               All look. Tom climbs on the running board the better to see.\n\n                                     TOM\n                         Looks like about a mile. Reckon she'll \n                         make it?\n\n                                     AL\n                         She got to make it.\n\n                                     MA\n                              (as they get back in)\n                         What is it?\n\n                                     TOM\n                         Don't know--but it's better'n this.\n\n               As Al starts the truck, the scene dissolves to a weather-\n               beaten wooden sign: \"PERMANENT CAMP NO. 9\"  \"DEPT. OF \n               AGRICULTURE\"\n\n               We see the GATE TO THE GOVERNMENT CAMP, a wide gate in a \n               high wire fence, with a caretaker's shack to one side of the \n               gate. The caretaker stands beside his shack as the Joad truck \n               swings off the road, hits an unnoticed rut that bounces the \n               whole truck off the ground, and stops.\n\n                                     CARETAKER\n                              (mildly)\n                         You hit 'er too fast.\n\n               In the FRONT SEAT Al leans angrily out of the driver's window. \n               Tom is keeping his face away from the caretaker's line of \n               vision.\n\n                                     AL\n                         What's the idea of that?\n\n                                     CARETAKER\n                              (chuckling)\n                         Well, a lot a kids play in here. You \n                         tell folks to go slow and they liable \n                         to forget. But let 'em hit that hump \n                         once and they don't forget!\n\n               Al starts climbing out. Pa jumps down from the truck.\n\n                                     AL\n                         Got any room here for us?\n\n                                     CARETAKER\n                              (nodding)\n                         You're lucky. Fellow just moved out \n                         half-hour ago.\n                              (Pointing)\n                         Down that line and turn to the left. \n                         You'll see it. You'll be in No. 4 \n                         Sanitary Unit.\n\n                                     MA\n                         What's that?\n\n                                     CARETAKER\n                         Toilet and showers and washtubs.\n\n                                     MA\n                         You mean you got *washtubs?* An' \n                         runnin' water?\n\n                                     CARETAKER\n                         Yes, ma'am.\n                              (To Al)\n                         Camp committee'll call on you in the \n                         morning and get you fixed.\n\n                                     AL\n                              (quickly)\n                         Cops?\n\n                                     CARETAKER\n                         No. No cops. Folks here elect their \n                         own cops.\n                              (To Ma)\n                         The ladies' committee'll call on \n                         you, ma'am, about the kids and the \n                         sanitary unit and who takes care of \n                         'em.\n                              (To Al)\n                         Come inside and sign up.\n\n               As Ma, Pa, and Al look at each other in almost incredulous \n               bewilderment, Tom climbs out of the truck.\n\n                                     TOM\n                         Take 'er on down, Al. I'll sign.\n\n                                     PA\n                         We gonna stay, ain't we?\n\n                                     TOM\n                         You're tootin' we're gonna stay.\n                              (He follows the \n                              caretaker into the \n                              shack)\n\n               INSIDE THE SHACK, Tom enters warily, alert for any indication \n               that either his name or his scar may have been learned and \n               telegraphed here. But the caretaker obviously attaches no \n               significance to either. The shack is bare but for a cot, a \n               table, a chair, and an electric light. The caretaker is seated \n               at the table, pen in hand, a soiled ledger open, when Tom \n               enters.\n\n                                     CARETAKER\n                         I don't mean to be nosy, y'understand. \n                         I just got to have certain \n                         information. What's your name?\n\n                                     TOM\n                              (watching him)\n                         Joad. Tom Joad.\n\n                                     CARETAKER\n                              (writing)\n                         How many of you?\n\n               THE JOAD TRUCK is seen in front of its camp site as the Joads \n               descend.\n\n                                     AL\n                         How 'bout it, Uncle John? Gotta pitch \n                         this tent.\n\n                                     JOHN\n                              (groggy with sleep)\n                         I'm a-comin'.\n\n                                     MA\n                         You don't look so good.\n\n                                     JOHN\n                         I *ain't* so good, but--I'm a-comin'.\n\n               INSIDE THE CARETAKER'S SHACK:\n\n                                     CARETAKER\n                         Camp site costs a dollar a week, but \n                         you can work it out, carrying garbage, \n                         keeping the camp clean--stuff like \n                         that.\n\n                                     TOM\n                         We'll work it out. What's this \n                         committee you talkin' about?\n\n                                     CARETAKER\n                         We got five sanitary units. Each one \n                         elects a central committee man. They \n                         make the laws, an' what they say \n                         goes.\n\n                                     TOM\n                         Are you aimin' to tell me that the \n                         fellas that run this camp is jus' \n                         fellas--campin' here?\n\n                                     CARETAKER\n                         That's the way it is.\n\n                                     TOM\n                              (after a pause)\n                         An' you say no cops?\n\n                                     CARETAKER\n                              (shaking his head)\n                         No cop can come in here without a \n                         warrant.\n\n                                     TOM\n                              (marveling)\n                         I can't hardly believe it. Camp I \n                         was in once, they burned it out--the \n                         deputies an' some of them poolroom \n                         fellas.\n\n                                     CARETAKER\n                         They don't get in here. Sometimes \n                         the boys patrol the fences, especially \n                         dance nights.\n\n                                     TOM\n                         You got dances too?\n\n                                     CARETAKER\n                         We got the best dances in the county \n                         every Saturday night.\n\n                                     TOM\n                         Say, who runs this place?\n\n                                     CARETAKER\n                         Government.\n\n                                     TOM\n                         Why ain't they more like it?\n\n                                     CARETAKER\n                              (shortly)\n                         *You* find out, I can't.\n\n                                     TOM\n                         Anything like work aroun' here?\n\n                                     CARETAKER\n                         Can't promise you that, but there'll \n                         be a licensed agent here tomorrow \n                         mornin', if you want to talk to him.\n\n                                     TOM\n                              (leaving)\n                         Ma's shore gonna like it here. She \n                         ain't been treated decent for a long \n                         time.\n\n                                     CARETAKER\n                              (as Tom is at the \n                              door)\n                         That cut you got?\n\n                                     TOM\n                              (evenly)\n                         Crate fell on me.\n\n                                     CARETAKER\n                         Better take care of it. Store \n                         manager'll give you some stuff for \n                         it in the morning. Goodnight.\n\n                                     TOM\n                         Goodnight.\n\n               As he exits we see the GOVERNMENT CAMP, with Tom coming out \n               of the shack, amazement still on his face. As he walks slowly \n               down the main camp street we share the revelation of the \n               place to him. It is nearly daylight. Roosters crow in the \n               distance. The street is neat and orderly in a military way, \n               its cleanliness in sharp contrast to anything he has known \n               before. Inside the tents people are stirring. In front of \n               one tent a woman is cooking breakfast. A baby is in her arms.\n\n                                     TOM\n                         Good mornin'.\n\n                                     WOMAN\n                         Mornin'.\n\n               As he walks on, Tom draws a breath of exultation. As he moves \n               on, looking around, we see the EXTERIOR OF SANITARY UNIT NO. \n               4, a cheap frame building the purpose of which is pretty \n               obvious. Ruthie, warily alert lest she be caught, is peering \n               in the door. She looks a long time and then she runs out of \n               the scene.\n\n               WINFIELD is seen asleep in a quilt on the ground when Ruthie \n               enters and rousts him out.\n\n                                     RUTHIE\n                              (in an excited whisper)\n                         Git up. I got sump'n to show you.\n\n                                     WINFIELD\n                              (sleepily)\n                         Whatsa matter?\n\n                                     RUTHIE\n                              (tugging him)\n                         It's them white things, made outa \n                         dish-stuff, like in the catalogues!\n\n               He stumbles after her.\n\n               THE EXTERIOR OF SANITARY UNIT NO. 4. Ruthie is putting on a \n               bold front as she leads Winfield into sight but she is still \n               alert for interference.\n\n                                     RUTHIE\n                         Come on. Ain't nobody gonna say \n                         anything.\n\n                                     WINFIELD\n                         Won't they ketch us?\n\n               He follows her into the unit, big-eyed with excitement and \n               apprehension. There is a silence. Then:\n\n                                     RUTHIE'S VOICE\n                         Them's where you wash your han's.\n\n               Another silence. Then:\n\n                                     WINFIELD'S VOICE\n                         What's these?\n\n                                     RUTHIE'S VOICE\n                              (uncertainly)\n                         Well, I reckon you *stan'* in them \n                         little rooms--an' water come down \n                         outa that there little jigger up \n                         there--take a bath!\n\n               Another silence. Then:\n\n                                     WINFIELD'S VOICE\n                              (excitedly)\n                         Jes' like in the catalogues, ain't \n                         they!\n\n                                     RUTHIE'S VOICE\n                              (proudly)\n                         I seen 'em b'fore you did.\n\n                                     WINFIELD'S VOICE\n                         What's this?\n\n                                     RUTHIE'S VOICE\n                              (in alarm)\n                         Now don't you go monk'ing--\n\n               There is the sound of a toilet flushing. It is a cheap toilet \n               and it is a loud flush which eventually ends in a long \n               refilling of the tank just as loudly. There is a paralyzed \n               silence. Then:\n\n                                     RUTHIE'S VOICE\n                         Now you done it! You busted it!\n\n                                     WINFIELD'S VOICE\n                         I never--\n\n               Terrified, Winfield comes dashing out of the unit but Ruthie \n               grabs him just outside the door. Beginning to cry, he \n               struggles to get away.\n\n                                     WINFIELD\n                         Lemme go! I didn't go to do it!\n\n                                     RUTHIE\n                              (fiercely)\n                         Keep qui'te, will ya! Shet your mouth!\n\n                                     WINFIELD\n                              (weeping)\n                         I never knowed it! All I done was \n                         pull that string!\n\n                                     RUTHIE\n                         Lissen. You done busted it. You hear?\n                              (They listen to the \n                              refilling of the \n                              tank)\n                         But lissen here. I won't tell nobody, \n                         y'understan'?\n\n                                     WINFIELD\n                         Please don't.\n\n                                     RUTHIE\n                         I won't--\n                              (craftily)\n                         --if you won't tell what *I* done!\n\n               He nods quickly. Then Ruthie begins to walk away with what \n               she fancies is an innocent, nonchalant stroll, yawning \n               casually. Sniffling a little, Winfield mimics her, a very \n               innocent walk and yawn indeed.\n\n               The scene dissolves to a DITCH. Alongside the ditch are some \n               lengths of concrete pipe. Tom and the two Wallaces are in \n               the ditch, Tom and Tim picking, Wilkie shoveling.\n\n                                     TOM\n                              (exulting)\n                         If this don't feel good!\n\n                                     WILKIE\n                              (chuckling)\n                         Wait'll about 'leven o'clock, see \n                         how good she feels then!\n\n                                     TOM\n                         Seems like a nice frien'ly fella to \n                         work for, too.\n\n                                     TIM\n                         Lotta these little farmers mighty \n                         nice fellas. Trouble is they're \n                         little, they ain't got much say-so.\n\n                                     TOM\n                         Shore looks like my lucky day, anyway. \n                         Gettin' some work at las'.\n\n               Mr. Thomas, the farmer, a stock man wearing a paper sun \n               helmet, enters. His face is worried as he squats down beside \n               the ditch. What he has come to say has taken some effort and \n               he is still uncertain and annoyed. The men stop work.\n\n                                     THOMAS\n                         Lissen here. Maybe I'm talkin' myself \n                         outa my farm, but I like you fellas, \n                         so I'm gonna tell you. You live in \n                         that gov'ment camp, don't you?\n\n                                     TOM\n                              (stiffening)\n                         Yes, sir.\n\n                                     THOMAS\n                         And you have dances every Saturday \n                         night?\n\n                                     WILKIE\n                              (smiling)\n                         We sure do.\n\n                                     THOMAS\n                         Well, look out next Saturday night.\n\n                                     TIM\n                              (suddenly tense)\n                         What you mean? I belong to the central \n                         committee. I got to know.\n\n                                     THOMAS\n                         Don't you ever tell I told.\n\n                                     TIM\n                         What is it?\n\n                                     THOMAS\n                              (angrily)\n                         Well, the association don't like the \n                         government camps. Can't get a deputy \n                         in there. Can't arrest a man without \n                         a warrant. But if there was a big \n                         fight, and maybe shooting--a bunch \n                         of deputies could go in and clean \n                         out the camp.\n                              (Unfolding a newspaper)\n                         Like last night. Lissen. \"Citizens, \n                         angered at red agitators, burn another \n                         squatters' camp, warn agitators to \n                         get out of the county.\"\n\n                                     TOM\n                              (sick of the expression)\n                         Listen. What *is* these reds? \n                         Ever'time you turn aroun' somebody \n                         sayin' somebody else's a red. What \n                         is these reds, anyway?\n\n                                     WILKIE\n                              (chuckling)\n                         Well, I tell you. They was a fella \n                         up the country named King--got about \n                         30,000 acres an' a cannery an' a \n                         winery--an' he's all a time talkin' \n                         about reds. Drivin' the country to \n                         ruin, he says. Got to git rid of \n                         'em, he says. Well, they was a young \n                         fella jus' come out an' he was \n                         listenin one day. He kinda scratched \n                         his head an' he says, \"Mr. King, \n                         what *is* these reds you all a time \n                         talkin' about?\" Well, sir, Mr. King \n                         says, \"Young man, a red is any fella \n                         that wants thirty cents a hour when \n                         I'm payin' twenty-five.\"\n\n                                     THOMAS\n                              (fretfully)\n                         I ain't talkin' about that one way \n                         or the other. All I'm saying is that \n                         there's going to be a fight in the \n                         camp Saturday night. And there's \n                         going to be deputies ready to go in.\n\n                                     TOM\n                         But why? Those fellas ain't botherin' \n                         nobody.\n\n                                     THOMAS\n                         I'll tell you why. Those folks in to \n                         being treated like humans. Suppose \n                         the Government closes its camps.  \n                         Suppose too many people pass through \n                         'em. Well, when those people go back \n                         to the squatters' camps they'll be \n                         hard to handle.\n                              (Wiping his brow)\n                         Go on back to work now. Maybe I've \n                         talked myself into trouble, but you're \n                         folks like us, and I like you.\n\n                                     TIM\n                              (extending his hand)\n                         Nobody won't know who tol'. We thank \n                         you.\n                              (Grimly)\n                         An' they ain't gonna be no fight, \n                         either.\n\n               They shake hands.\n\n               The scene dissolves to the GATE TO THE CAMP, at night. It is \n               Saturday evening, the night of the dance. Glaring electric \n               lights hang over the open gate. Parked jalopies line the \n               highway as the invited guests, small farmers and migrants \n               from other camps and their families, arrive to be greeted \n               and checked by a committee of three men.\n\n                                     COMMITTEE MAN\n                         Ev'nin', ma'am. Who'd you say invited \n                         you?\n\n                                     GUESTS\n                         Mister an' Mizz Clark, they ast us.\n\n                                     COMMITTEE MAN\n                         Yes, ma'am. Come right in, ma'am.\n\n               There is an air of eager anticipation, of gay celebration, \n               and everyone is in his or her best--the men in clean washed \n               overalls, clean shirts, some with ties, their hair damp and \n               slicked down, the women in their nicest. Through the gate, \n               inside the camp, can be seen the outdoor dance floor, brightly \n               lighted, with the camp musicians already tuning up, and around \n               the dance floor scores of wide-eyed children.\n\n               INSIDE THE GATE TO THE CAMP, we see Wilkie and a dark-\n               complexioned man named Jule standing among a group inside \n               watching the arrivals. They watch sharply, eyeing everyone, \n               listening to every credential. As his employer, Thomas, comes \n               through the gate with his wife, Wilkie grins and greets him \n               with a handshake.\n\n                                     WILKIE\n                         Hidy, Mr. Thomas. Hidy, Mizz Thomas.\n\n                                     THOMAS\n                              (sotto voce)\n                         You watching out, ain't you?\n\n                                     WILKIE\n                              (grinning)\n                         Don't you worry. Ain't gonna be no \n                         trouble.\n\n                                     THOMAS\n                         I hope you know what you're talking \n                         about.\n                              (He moves away, Wilkie \n                              grinning after him)\n\n               We see the DANCE FLOOR, and after three pats of the foot, to \n               get the tempo, the home talent dance orchestra swings into \n               music.\n\n               INSIDE THE JOAD TENT, Rosasharn dressed in her nicest, sits \n               gripping her hands together, the music seeming to bring her \n               to the verge of tears.\n\n                                     ROSASHARN\n                         Ma...\n                              (Ma turns from drying \n                              dishes)\n                         Ma, I--I can't go to the dance. I \n                         jus' can't Ma. I can't hardly stan' \n                         it, with Connie not here--an' me \n                         this way.\n\n                                     MA\n                              (trying to cheer her)\n                         Why, honey, it makes folks happy to \n                         see a girl that way--makes folks \n                         sort of giggly an' happy.\n\n                                     ROSASHARN\n                              (miserably)\n                         I can't he'p it, Ma. It don't make \n                         *me* giggly an' happy.\n\n               Drying her hands, Ma sits beside Rosasharn and takes her in \n               her arms.\n\n                                     MA\n                              (tenderly)\n                         You an' me's goin' together--jus' \n                         you an' me. We're a-goin' to that \n                         dance an' we're a-goin' to jus' set \n                         an' watch. If anybody says to come \n                         dance--why I'll say you're poorly. \n                         But you an' me, we're gonna hear the \n                         music an' see the fun.\n\n                                     ROSASHARN\n                         An' you won't let nobody touch me?\n\n                                     MA\n                         No--an' look what I got for you.\n\n               Smiling mysteriously, Ma fishes in a pocket in her dress and \n               brings out the envelope of her treasures. From it she produces \n               the earrings and holds them up in front of Rosasharn's wide \n               eyes.\n\n                                     MA\n                              (softly)\n                         I used to wear these--when your pa \n                         come callin' on me.\n                              (Then as she puts \n                              them on Rosasharn's \n                              ears)\n                         You'll look pretty in 'em tonight.\n\n               They smile at each other, proud in the luxury of ornaments.\n\n               Down the road from the GATE a touring car with six men pulls \n               of the pavement and stops. Three men get out. They are \n               bareheaded and dressed similar to the other migrants. They \n               stroll down the highway toward the gate. The other men, \n               deputies, sit watching them.\n\n               WITHIN THE GATE:\n\n                                     WILKIE\n                         They tell me you're half Injun. You \n                         look all Injun to me.\n\n                                     JULE\n                         No, jes' half. Wisht I was full-\n                         blooded. Gov'ment'd be lookin' out \n                         for me an' I'd be ridin' around in a \n                         Buick eight.\n\n               The three men from the touring car are at the gate. Wilkie \n               and Jule watch them.\n\n                                     COMMITTEE MAN\n                         Who give you the invitation?\n\n                                     MAN\n                         Fella named Jackson--Buck Jackson.\n\n                                     COMMITTEE MAN\n                         Okay. Come on in.\n\n               The three men stroll past Wilkie and Jule, whose eyes follow \n               them.\n\n                                     JULE\n                         Them's our fellas.\n\n                                     WILKIE\n                         How you know?\n\n                                     JULE\n                         Jes' got a feelin'. They're kinda \n                         scared too. Follow 'em an' get a \n                         holt of Jackson. See if he knows \n                         'em. I'll stay here.\n\n               Wilkie moves after them.\n\n               We see the DANCE FLOOR. The musicians are at it and the \n               fiddler is calling turns.\n\n                                     FIDDLER\n                         Swing your ladies an' a dol ce do. \n                         Join han's roun' an' away we go! \n                         Swing to the right an' a swing to \n                         the lef'. Break, now break--back to \n                         back!\n\n               Well in front, among the older folks and children who surround \n               the floor, are Ma and Rosasharn, clinging close. A young man \n               stops in front of them.\n\n                                     MA\n                              (quietly)\n                         Thank you kin'ly but she ain't well.\n\n               As Rosasharn's eyes drop. Ma bends toward her, a shy smile \n               on her face.\n\n                                     MA\n                         Maybe you wouldn't think it, but \n                         your pa was as nice a dancer as I \n                         ever seen, when he was young.\n                              (With a little sigh)\n                         Kinda makes me think a ol' times.\n\n               The three men stroll into sight and stand watching the \n               dancing. One glances at Ma and Rosasharn but does not speak. \n               Ma has smiled back at him.\n\n               WILKIE AND JACKSON are seen; removed somewhat from the dance \n               floor they are peering in the direction of the three men.\n\n                                     JACKSON\n                         I seen 'em before. Worked at \n                         Gregorio's with 'em. But I never ast \n                         'em.\n\n                                     WILKIE\n                         Awright. Keep your eye on 'em. Jus' \n                         keep 'em in sight, that's all.\n                              (He moves quickly \n                              away)\n\n               We find ourselves INSIDE TIM WALLACE'S TENT.  The five members \n               of the central committee, Tim Wallace, chairman, look grave \n               as a 15-year-old boy reports.\n\n                                     BOY\n                         I seen 'em, Mr. Wallace. A car with \n                         six men parked down by the euc'lyptus \n                         tree an' one with three men on the \n                         main road. They got guns, too. I \n                         seen 'em.\n\n                                     TIM\n                         Thank you, Willie. You done good.\n                              (As Willie exits)\n                         Well, it looks like the fat's in the \n                         far this time.\n\n                                     FIRST MAN\n                              (angrily)\n                         What them deppities want to hurt the \n                         camp for? How come they can't leave \n                         us be?\n\n                                     SECOND MAN\n                         What we oughta do, we oughta git us \n                         some pickhandles an'--\n\n                                     TIM\n                              (quickly)\n                         No!  That's what they want. No sir. \n                         If they can git a fight goin', then \n                         they can run in the cops an' say we \n                         ain't orderly--\n                              (He stops as Wilkie \n                              enters followed by \n                              Tom)\n\n                                     WILKIE\n                         They're here. We got 'em spotted.\n\n               There is a grim pause at this news. Tim's eyes go hard.\n\n                                     TIM\n                              (to Tom)\n                         You sure you got ever'thing ready?\n\n                                     TOM\n                              (calmly)\n                         Ain't gonna be no trouble.\n\n                                     TIM\n                              (worriedly)\n                         You ain't to hurt them fellas.\n\n                                     WILKIE\n                              (grinning)\n                         You don't have to worry. We got \n                         ever'thing arranged. Maybe nobody'll \n                         even see it.\n\n                                     TIM\n                         Just don't use no stick nor no knife, \n                         no piece a arn. An' if you got to \n                         sock 'em, sock 'em where they won't \n                         bleed.\n\n                                     TOM\n                         Yes, sir.\n\n                                     TIM\n                         Awright. An' if she gets outa han', \n                         I'll be in the right han' corner, \n                         this side the dance floor.\n\n                                     TOM\n                              (blandly)\n                         Ain't gonna get outa han'.\n\n               Wilkie makes a mocking military salute as he and Tom exit. \n               The committee men look worriedly after them.\n\n                                     FIRST MAN\n                         Mighty sure a themselves, looks like.\n\n                                     TIM\n                         All I hope, I hope they don't kill \n                         nobody.\n\n               In front of the JOAD TENT, dressed to kill, is Al, ready for \n               the festivities. He wears a tight-fitting wool suit, a tie \n               on his shirt, yellow shoes, and his hair is damp and slicked \n               down. He rubs his hands together in anticipation as he strolls \n               in the direction of the dance floor.\n\n               At ANOTHER TENT, a blonde girl sits on a box as Al enters. \n               Casually he throws open his coat, revealing a vivid striped \n               shirt. This is designed to stun his quarry.\n\n                                     AL\n                         Gonna dance tonight?\n                              (The girl \n                              ostentatiously ignores \n                              him)\n                         I can waltz.\n\n                                     GIRL\n                              (aloofly)\n                         That's nothin'--anybody can waltz.\n\n                                     AL\n                              (shaking his head)\n                         Not like me!\n\n               A fat woman thrusts her head out of the tent.\n\n                                     WOMAN\n                         You git right along! This here girl's \n                         spoke for. She's gonna be married, \n                         an' her man's a-comin' for her.\n\n               Shrugging, Al winks at the girl and moves on, stepping and \n               moving his shoulders and snapping his fingers in time to the \n               music, a very gay fellow indeed. The blonde girl's eyes follow \n               him. Then she turns and glances cautiously toward the tent.\n\n               ON THE DANCE FLOOR, we see Ma and Rosasharn as Tom enters \n               and stands between them. This is during a pause between dances \n               and only a few couples stand on the floor waiting for the \n               music to begin again. We also see the three men very casually \n               looking around--but no more casual looking than Wilkie, \n               standing just behind them, idly whistling.\n\n                                     TOM\n                              (grinning)\n                         She's gettin' prettier, Ma.\n\n                                     MA\n                              (as Rosasharn hides \n                              her face)\n                         Girl with a baby *always* gets \n                         prettier.\n\n               The music starts again, once more the dancers move onto the \n               dance floor. The three men exchange a glance and step casually \n               to the edge of the dancing space, one in the lead. They survey \n               the scene, but for the moment make no further move. The \n               atmosphere is tense.\n\n                                     TOM\n                              (softly)\n                         Excuse me, Ma.\n                              (He moves quietly out \n                              of the scene, toward \n                              the three men)\n\n               AL, taking the blonde girl's hand, steps onto the dance floor. \n               Encircling her waist, they begin to dance. They are a smooth, \n               rhythmic couple who move as one being.\n\n                                     AL\n                         Well, you said anybody can waltz... \n                         How'm *I* doin'?\n\n                                     BLONDE GIRL\n                         Don't hold me so tight.\n\n                                     AL\n                              (tongue-in-cheek)\n                         Why, I ain't hardly touchin' you!\n\n                                     BLONDE GIRL\n                              (squirming)\n                         You're *ticklin' me!*\n\n                                     AL\n                              (grabbing her still \n                              closer)\n                         That comes from not holdin' you tight \n                         *enough.*\n\n                                     BLONDE GIRL\n                              (complaining but loving \n                              it)\n                         Now I can't breathe.\n\n               At this moment the leader of the three men (the other two \n               directly behind him) enters the scene.\n\n                                     LEADER\n                         I'll dance with this girl.\n\n                                     AL\n                              (angrily)\n                         You an' who else?\n\n               Behind the three men a solid wall of migrants are closing in \n               quietly, Tom and Wilkie in the middle.\n\n                                     LEADER\n                         Don't gimme no argament--\n                              (A shrill whistle \n                              sounds in the distance)\n                         --you little--\n\n               His fist goes back, his left hand reaches for Al's collar. \n               At the same instant Tom grabs him, Wilkie claps his hand \n               over the leader's mouth, at least fifteen other men have \n               similarly collard the other two invaders, and they are all \n               lifted bodily. There is not a sound as the three men, held \n               in iron grips, are whisked from the dance floor and into the \n               crowd.\n\n               Two touring cars have stopped in front of the closed GATE \n               and the deputies have drawn guns.\n\n                                     DRIVER\n                         Open up! We hear you got a riot.\n\n                                     CARETAKER\n                         Riot? I don't see no riot. Who're \n                         you?\n\n                                     DRIVER\n                         Deputy sheriffs.\n\n                                     CARETAKER\n                         Got a warrant?\n\n                                     DRIVER\n                         We don't need a warrant if it's a \n                         riot.\n\n                                     CARETAKER\n                         Well, I don't know what you gonna do \n                         about it, because I don't hear no \n                         riot an' I don't see no riot, an' \n                         what's more I don't believe they \n                         *is* no riot.\n                              (Waving toward the \n                              dance floor)\n                         Look for yourself.\n\n               As the deputies, puzzled and uncertain, look toward the DANCE \n               FLOOR, we see the music, the dancing, the gaiety continuing \n               as if nothing had happened.\n\n               WITHIN THE JOAD TENT at night, several hours later: the tent \n               is black, Tom strikes a match. From a piece of wood on the \n               ground or floor he selects one from several cigarette butts \n               and lights it. While he is doing so, he lifts his head \n               suddenly, and listens.\n\n               In the CAMP STREET we catch sight of legs walking, the ground \n               lighted from a flashlight. Two pairs of the legs wear state \n               policemen's leather leggings. The third pair are the \n               caretaker's. They stop behind a car. The flashlight plays on \n               the license plate. One of the state cops leans down to copy \n               the license number in a booklet. Then they move on.\n\n               TOM has lifted the edge of the tent a trifle, enough to see \n               out by flattening his head on the floor. The LEGS are now \n               seen at the Joad jalopy. The light is on the license plate. \n               The cop leans over and copies the number. They move on.\n\n               TOM, lowering the edge of the tent, sits up. Quietly he pushes \n               aside the piece of carpet that covers him. He is wearing his \n               clothes. We see the policeman's CAR at the caretaker's hut. \n               The two policemen get into the car.\n\n                                     CARETAKER\n                         You got no right to arrest anybody \n                         without a warrant, you know.\n\n                                     FIRST COP\n                         We'll have a warrant--just as soon \n                         as we check with headquarters.\n\n               The car drives off, leaving the caretaker looking somberly \n               after it.\n\n               WITHIN THE JOAD TENT, his cap on, fully dressed for travel, \n               Tom is tieing the ends of the carpet into a shoulder bundle. \n               Rising, he slings it across his shoulder. As he tiptoes toward \n               the door:\n\n                                     MA\n                         Ain't you gonna tell me goodbye, \n                         Tommy?\n\n               For a moment he looks into the darkness in her direction.\n\n                                     TOM\n                         I didn't know, Ma. I didn't know if \n                         I ought.\n\n               She has risen, pulling the quilt around her. He takes her by \n               the hand.\n\n                                     TOM\n                         Come outside.\n\n               They go out. Tom leads Ma around BEHIND THE TENT, to a SECTION \n               OF WIRE FENCE. There is a bench there. Tom leads Ma to it \n               and sits her down. He sits beside her.\n\n                                     TOM\n                         They was some cops here, Ma. They \n                         was takin' down the license numbers. \n                         It looks like somebody knows sump'n.\n\n                                     MA\n                              (softly)\n                         It had to come, I reckon, soon or \n                         later.\n\n                                     TOM\n                         I'd like to stay. I'd like to be \n                         with ya--\n                              (smiling)\n                         --an' see your face when you an' Pa \n                         get settled in a nice little place. \n                         I sure wish I could see you then. \n                         But--\n                              (shaking his head)\n                         --I guess I won't never be able to \n                         do that. Not now.\n\n                                     MA\n                         I could hide you, Tommy.\n\n                                     TOM\n                              (touching her hand)\n                         I know you would, Ma. But I ain't \n                         gonna let you. You hide somebody \n                         that's kilt a man an'... an' you'd \n                         be in trouble too.\n\n                                     MA\n                              (touching his face \n                              with her fingers)\n                         Awright, Tommy. What you figger you \n                         gonna do?\n\n                                     TOM\n                              (thoughtfully)\n                         You know what I been thinkin' about, \n                         Ma? About Casy. About what he said, \n                         what he done, an' about how he died. \n                         An' I remember all of it.\n\n                                     MA\n                         He was a good man.\n\n                                     TOM\n                         I been thinkin' about us, too--about \n                         our people livin' like pigs, an' \n                         good rich lan' layin' fallow, or \n                         maybe one fella with a million acres, \n                         while a hundred thousan' farmers is \n                         starvin'. An' I been wonderin' if \n                         all our folks got together an' yelled--\n\n                                     MA\n                              (frightened)\n                         Tommy, they'll drive you, an' cut \n                         you down like they done to Casy.\n\n                                     TOM\n                         They gonna drive me anyways. Soon or \n                         later they'll get me, for one thing \n                         if not another. Until then...\n\n                                     MA\n                         You don't aim to kill nobody, Tom!\n\n                                     TOM\n                         No, Ma. Not that. That ain't it. But \n                         long as I'm a outlaw, anyways, maybe \n                         I can do sump'n. Maybe I can jus' \n                         fin' out sump'n. Jus' scrounge aroun' \n                         an' try to fin' out what it is that's \n                         wrong, an then see if they ain't \n                         sump'n could be done about it.\n                              (Worriedly)\n                         But I ain't thought it out clear, \n                         Ma. I can't. I don't know enough.\n\n                                     MA\n                              (after a pause)\n                         How'm I gonna know 'bout you? They \n                         might kill you an' I wouldn't know. \n                         They might hurt you. How'm I gonna \n                         know?\n\n                                     TOM\n                              (laughing uneasily)\n                         Well, maybe it's like Casy says, a \n                         fella ain't got a soul of his own, \n                         but on'y a piece of a big soul--the \n                         one big soul that belongs to ever'body--\n                         an' then...\n\n                                     MA\n                         Then what, Tom?\n\n                                     TOM\n                         Then it don't matter. Then I'll be \n                         all aroun' in the dark. I'll be \n                         ever'where--wherever you look. \n                         Wherever there's a fight so hungry \n                         people can eat, I'll be there. \n                         Wherever there's a cop beatin' up a \n                         guy, I'll be there. I'll be in the \n                         way guys yell when they're mad--an' \n                         I'll be in the way kids laugh when \n                         they're hungry an' they know supper's \n                         ready. An' when our people eat the \n                         stuff they raise, an' live in the \n                         houses they build, why, I'll be there \n                         too.\n\n                                     MA\n                              (slowly)\n                         I don't understan' it, Tom.\n\n                                     TOM\n                              (drily)\n                         Me neither.\n                              (Rising)\n                         It's jus' stuff I been thinkin' about. \n                         Gimme you han', Ma. Good-by.\n                              (He climbs over the \n                              fence)\n\n                                     MA\n                         Good-by, Tom. Later--when it's blowed \n                         over--you'll come back? You'll try \n                         to fin' us?\n\n                                     TOM\n                         Sure. Good-by.\n\n                                     MA\n                         Good-by, Tommy.\n\n               He walks away. She stands looking after him. He's leaving \n               her forever--she knows it. She lifts her hand and waves. She \n               tries to smile. TOM turns, waves, smiles. His lips form the \n               words: \"Good-by, Ma.\" Then he strides away into the darkness.\n\n               The scene fades out.\n\n               The JOAD TRUCK fades in. It stands loaded in front on the \n               Joad tent while Al, Pa, Uncle John, Ma, and the little fellas \n               pile in the last article in a fury of excitement. Beyond, in \n               the background, another jalopy is being prepared for travel \n               with the same feverish haste. It is day.\n\n                                     AL, PA, JOHN\n                              (ad lib)\n                         Get them buckets on! Somebody tie \n                         down the mattress! You little fellas \n                         keep outa the way!\n\n                                     MAN\n                              (from the other truck, \n                              gaily)\n                         What y'all hurryin' so for? Tell me \n                         they got twenny days work.\n\n                                     PA\n                         Yes, sir, an' we aim to git in all \n                         twenny of 'em.\n\n               Other jalopies in the background are being readied for leaving--\n               an excited, hopeful exodus on a new report of work.\n\n                                     AL\n                         Ready, Ma?\n\n                                     MA\n                         I'll get Rosasharn.\n\n                                     PA\n                              (beaming)\n                         All aboard, ever'body! All aboard \n                         for Fresno!\n\n               Ma comes out of the tent supporting Rosasharn tenderly. For \n               the plumpness has gone from the girl and she is thin again, \n               her face drawn and unhappy, her eyes swollen with weeping \n               and suffering.\n\n                                     MA\n                              (softly)\n                         Try to be strong, honey. Someday \n                         it'll be diff'rent--someday you'll \n                         have another one. You're still jus' \n                         a little girl, remember.\n\n               Pa takes Rosasharn's other arm. He and Al and Uncle John \n               help Rosasharn onto the truck. She lies down on the mattress, \n               her face away from them.\n\n                                     PA\n                         Make her easy, John. Watch her.\n\n                                     MA\n                         She'll be awright.\n\n                                     AL\n                              (in the driver's seat)\n                         Ready, Pa?\n\n                                     PA\n                              (as he and Ma climb \n                              in the front seat)\n                         Let 'er go, Gallagher!\n\n               The truck wabbles into motion. Al races the engine. It nearly \n               crashes another wheezing jalopy at the corner. When it turns \n               the corner we see the GATE, and a line of loaded jalopies \n               that ride out to the highway. The caretaker waves and the \n               migrants wave back.\n\n                                     CARETAKER\n                         Good luck to you! Good luck, \n                         ever'body!\n\n                                     THE JOADS\n                         Good-by, Mr. Conway! Much oblige to \n                         you for ever'thing!\n\n               The Joad truck turns onto the highway. In the FRONT SEAT Al \n               is driving, Ma in the middle, Pa on the outside.\n\n                                     AL\n                         Twenty days work, oh boy!\n\n                                     PA\n                         Be glad to get my han' on some cotton. \n                         That's the kin' a pickin' I \n                         understan'.\n\n                                     MA\n                         Maybe. Maybe twenny days work, maybe \n                         *no* days work. We ain't got it till \n                         we get it.\n\n                                     AL\n                              (grinning)\n                         Whatsa matter, Ma? Gettin' scared?\n\n                                     MA\n                              (smiling faintly)\n                         No. Ain't ever gonna be scared no \n                         more.\n                              (After a pause)\n                         I was, though. For a while I thought \n                         we was beat--*good* an' beat. Looked \n                         like we didn't have nothin' in the \n                         worl' but enemies--wasn't *no*body \n                         frien'ly anymore. It made me feel \n                         bad an' scared too--like we was \n                         lost... an' nobody cared.\n\n                                     AL\n                         Watch me pass that Chevvy.\n\n                                     PA\n                              (soberly)\n                         You the one that keeps us goin', Ma. \n                         I ain't no good any more, an' I know \n                         it. Seems like I spen' all my time \n                         these days a-thinkin' how it use'ta \n                         be--thinkin' of home--an' I ain't \n                         never gonna see it no more.\n\n               Ma places her hand on one of Pa's and pats it.\n\n                                     MA\n                         Woman can change better'n a man. Man \n                         lives in jerks--baby born, or somebody \n                         dies, that's a jerk--gets a farm, or \n                         loses one, an' that's a jerk. With a \n                         woman it's all one flow, like a \n                         stream, little eddies, little \n                         waterfalls, but the river it goes \n                         right on. Woman looks at it like \n                         that.\n\n                                     AL\n                              (at the jalopy ahead)\n                         Look at that ol' coffeepot steam!\n\n                                     PA\n                              (thinking of what Ma \n                              says)\n                         Maybe, but we shore takin' a beatin'.\n\n                                     MA\n                              (chuckling)\n                         I know. Maybe that makes us tough. \n                         Rich fellas come up an' they die, \n                         an' their kids ain't no good, an' \n                         they die out. But we keep a-comin'. \n                         We're the people that live. Can't \n                         nobody wipe us out. Can't nobody \n                         lick us. We'll go on forever, Pa. \n                         We're the people.\n                              (She says this with a \n                              simple, unaffected \n                              conviction)\n\n               The TRUCK, steaming and rattling and churning, passes the \n               Chevrolet and Al leans out of the window and waves a jeering \n               hand at it. As the Joad truck pulls in front, we see Ruthie \n               and Winfield laughing with excitement over the triumph. Even \n               Uncle John shares the general satisfaction. Grinning, he \n               waves. As the truck moves away along the road, all three and \n               beaming and waving. Further along the truck passes a sign on \n               the side of the road. It says NO HELP WANTED.\n\n               The scene fades out.\n\n                                         THE END\n\n\n\n\n\n\n\n\nGrapes of Wrath, The\nWriters :   Nunnally Johnson\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:14.516681"}