{"title": "Green Mile, The", "film_link": "/Movie Scripts/Green Mile, The Script.html", "script_link": "/scripts/Green-Mile,-The.html", "info_raw": "\n\nGreen Mile, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.47 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Stephen King  Frank Darabont\nGenres  Drama  Fantasy\nScript Date : November 1997\n\nRead \"Green Mile, The\" Script\n\n\n", "script": "\n\n              T H E   G R E E N   M I L E\n\n              Screenplay by Frank Darabont\n\n              from the novel by Stephen King\n\n              First Draft\n              11/4/97\n\n\n              \"We each owe a death, there are no exceptions...\"\n\n              --------------------------------------------------------------\n\n              A SONG BEGINS, distant as a faded memory on an old Victrola:\n\n              Once I built a railroad, made it run... Made it race against\n              time...Once I built a railroad, now it's done...Brother, can\n              you spare a dime...\n\n              Opening credit sequence\n\n              plays against footage of the Great Depression, images\n              haunting and sepia-toned, defining an era. The bread\n              lines...the soup kitchens...the dust bowl refugees heading\n              west with their possessions on their backs and no hope in\n              their eyes...the strutting gangster royalty flaunting their\n              bootleg riches...an entire generation of lost youth riding\n              the rials...the U.S. army troops raining truncheon blows on\n              the half-starved and forgotten veterans of World War One as\n              \"Hooverville\" is set afire in the very shadow of the nation's\n              capitol...\n\n              All these faces, all these lives, in a world not really so\n              very long ago...\n\n              EXT. FIELD - DAY(SLOW MOTION)\n\n              ...where cattails sway in the sepia-toned heat. A small scrap\n              of fabric is snagged in the nettles, fluttering languidly...\n\n              COLOR BLEEDS SLOWLY IN as mosquitoes swarm and dragonflies\n              skitter, showing the fabric scrap to be pale yellow...\n\n              Suddenly, a MAN WITH A SHOTGUN comes crashing through the\n              cattails, wiping through frame and exiting...\n\n              ...then ANOTHER MAN...and ANOTHER...armed with rifles,\n              plowing through the brush, exiting frame...\n\n              ...and now comes KLAUS DETTERICK, a farmer one step above\n              shirt-tail poor, a double-barrel shotgun in the crook of his\n              arm. He pauses, horrified, seeing the scrap of cloth. He\n              pulls it loose, turns back, screaming something in anguish...\n\n              ...and still more men come crashing into view, flooding by us\n              with dreamlike, slow-motion grace. ONE MAN is leading a team\n              of DOGS, trying to untangle the leads. DEPUTY ROB McGEE is\n              shouting for everybody to stay together...\n\n              ...and under it all, we hear a sibilant, frightening whisper:\n\n                                  WHISPERING VOICE (V.O.)\n                        You love your sister? You make any\n                        noise, know what happens?\n\n              And off that horrible voice, we\n\n                                                       CUT TO:\n\n              INT. GEORGIA PINES NURSING HOME - MORNING(PRESENT DAY)\n\n              A CLOCK RADIO spews the morning weather report, abruptly\n              pulling us into the present with a prediction of rain. PAUL\n              EDGECOMB, late 70's/early 80's, wakes to another day...\n\n              INT. PAUL'S ROOM - MORNING\n\n              Paul stands at his bathroom mirror, meticulously buttoning\n              his shirt. He picks up a hairbrush, starts tidying his hair...\n\n              INT. CORRIDOR - MORNING\n\n              THE OLD AND INFIRM haunt these corridors like ghosts. A WOMAN\n              inches along on a walker. A MAN shuffles by with a rolling\n              I.V. stand. The floor is a limey, institutional green.\n\n              Paul comes into view, spry for his age, murmurs an occasional\n              greeting.\n\n              INT. BREAKFAST ROOM - MORNING\n\n              DOZENS OF RETIREES are having breakfast, sipping weak coffee\n              or tea. Some chat and gossip, other are content to keep their\n              own company, some just stare slackly into space.\n\n              Paul enters, sees ELAINE CONNELLY sitting with a few other\n              ladies, sipping tea. She's 80, refined and elegant, his best\n              friend here. She gives him a good-morning smile. He gives her\n              a rakish wink in return, which makes her smiles all the more.\n\n              Paul reaches past the people at the counter and sneaks two\n              pieces of cold leftover toast off a serving plate. He tosses\n              Elaine another look--catch ya later--and exits.\n\n              INT. HALLWAY PAST KITCHEN - MORNING\n\n              Paul slips to the back door unnoticed. Identical red plastic\n              rain ponchos line the wall on pegs. He helps himself to one\n              and eases outside, making good his escape.\n\n              EXT. NURSING HOME - ESTABLISHING - MORNING\n\n              Nestled in a valley of wooded hills, a drizzly mist rolling\n              over the treetops.\n\n              Paul appears f.g., coming up the ridge in his borrowed\n              poncho. He looks back at the valley below, inhales deeply--\n              this is a man who loves his walks.\n\n              He pulls a piece of toast from his pocket and starts to\n              nibble as he presses up on the ridge...\n\n              Low angle: nursing home and ridge beyond\n\n              ...and we see Paul from a distance, just a speck trudging up\n              toward the treeline. A PICKUP TRUCK rumbles into frame and\n              parks, a bumper sticker looming large: \"I Have Seen God and\n              His Name Is Newt Gingrich\".\n\n              BRAD DOLAN gets out, an orderly in his late 20's/early 30's,\n              arriving for work in jeans and cheesy plaid shirt. He gazes\n              up toward the ridge, scowling and muttering softly:\n\n                                  BRAD\n                        Old fuck.\n\n              He slams the door and heads for the nursing home...\n\n              EXT. WOODS - MORNING\n\n              ...as CAMERA BOOMS DOWN through the trees to find Paul\n              wandering a wooded path, munching a tidbit of toast, looking\n              for all the world like Red Riding Hood in his plastic poncho.\n\n              It's silent here, like a church. The only sounds we hear are\n              the twittering of the birds and the hammering of the\n              woodpecker.\n\n              A RUSTLING SOUND makes Paul freeze. He turns, becomes\n              transfixed. Softly:\n\n                                  PAUL\n                        Oh, my...\n\n              Reverse angle\n\n              reveals a magnificent BUCK, not twenty feet away, misty\n              breath punching the cold morning air. They watch each other\n              for an endless moment, both standing stock still...\n\n              ...and then the animal bounds away, vanishing into the\n              foliage. Paul lets out a breath, shakes his head in wonder.\n              He takes another bite of toast, moves on...\n\n              ...and WE PAN WITH HIM to reveal a pair of old wooden storage\n              shacks along the path up ahead.\n\n              INT. SHACK - MORNING\n\n              Dark in here, cobwebby and decrepit. We see Paul approaching\n              outside the grimy window. He steps up to the glass and shades\n              his eyes, peering curiously in as we\n\n                                                       DISSOLVE TO:\n\n              EXT. NURSING HOME - DAY\n\n              Paul approaches the back door, returning from his walk. He\n              reaches for the knob...and a figure in white lunges from\n              behind the dumpster to grab his wrist. He whirls, gasping in\n              fright--it's Brad Dolan, wearing his orderly's uniform.\n\n                                  BRAD\n                        Out for a little stroll, Paulie?\n\n                                  PAUL\n                        Let go...\n\n              Paul tries to pull away, but Dolan's got him tight.\n\n                                  BRAD\n                        What's with this poncho you got\n                        on, huh? This isn't yours.\n\n                                  PAUL\n                        I got it off the wall there.\n                        There's a whole row of them.\n\n                                  BRAD\n                        But not for you, Paulie, that's\n                        the thing. Those are for the staff.\n\n                                  PAUL\n                        I just borrowed it. Don't see what\n                        harm it does.\n\n                                  BRAD\n                        It's not about harm, it's about\n                        rules. You probably don't think an\n                        old fart like you has to mind\n                        rules anymore, but that's just not\n                        true.\n\n              Brad's eyes keep shifting--he obviously doesn't mind abusing\n              the elderly as long as he doesn't get caught doing it.\n\n                                  PAUL\n                        I'm sorry if I broke the rules.\n\n                                  BRAD\n                        You got no business up in those\n                        woods anyway, especially in the\n                        rain. What if you fall and bust a\n                        hip, huh? Who you think's gonna\n                        have to hoss your sorry old bacon\n                        back down here? Me, that's who.\n\n                                  PAUL\n                        You're hurting me!\n\n                                  BRAD\n                        What do you do up there, anyway?\n                        You're too old to go jerk off, so\n                        what do you do?\n\n                                  PAUL\n                        Nothing. I just walk, that's all,\n                        I like to walk!\n\n              Brad lashes out and grabs Paul's other hand, which he's been\n              holding tightly clenched shut.\n\n                                  BRAD\n                        Come on. Open up. Let Poppa see.\n\n              Paul uncurls his fingers, revealing the crushed remnants of\n              a bit of toast, his palm slick with a greasy oleo smear.\n\n                                  ELAINE (O.S.)\n                        Paul?\n\n              They turn. Elaine stands just inside the screen door with a\n              cup of tea. Brad's eyes become calculated, wondering how much\n              she's seen. Elaine keeps her tone level, betraying nothing:\n\n                                  ELAINE\n                        I saw you coming back, thought\n                        you'd like some tea.\n                               (beat)\n                        Are you coming in?\n\n                                  PAUL\n                        Mr. Dolan and I were...chatting.\n                        About the weather. I think we're\n                        through now.\n\n              Brad lets Paul loose, leans close:\n\n                                  BRAD\n                        Paulie? You tell anyone I squeezed\n                        your po' ol' hand, I'll tell 'em\n                        you're having senile delusions.\n                        Who you think they'll believe?\n\n              Brad walks off. Paul turns, watches him go. The screen door\n              opens and Elaine steps out, her face pale. Paul gives her a\n              strained, though grateful, smile as we\n\n                                                       CUT TO:\n\n              INT. TV ROOM - DAY\n\n              Jerry Springer's on the tube, whipping his studio audience\n              into a frenzy. PAN OFF TO REVEAL DOZENS OF OLD FOLKS watching\n              on couches and folding chairs. An old black fellow named PETE\n              is grousing to a GROUP OF ELDERLY LADIES...\n\n                                  PETE\n                        Why we always watch this crap?\n\n                                  ELDERLY LADY #1\n                        It's interesting.\n\n                                  PETE\n                        Interesting? Bunch'a inbred\n                        trailer trash, all they ever talk\n                        about is fucking...\n\n              ...and WE CONTINUE PANNING to Paul and Elaine sitting near\n              the back, talking quietly as Paul rubs his bruised hand:\n\n                                  ELAINE\n                        We should report him.\n\n                                  PAUL\n                        That might just provoke him all\n                        the more, make things worse for\n                        everybody.\n\n                                  ELAINE\n                        It's not everybody he has it in\n                        for, Paul. It's you.\n                               (off his look)\n                        What did you do to provoke him in\n                        the first place? Nothing. He's\n                        just an abusive bully, and should\n                        be made to stop.\n\n                                  PAUL\n                        Ellie, please...\n\n              Pete\n\n              is at the TV, switching channels while:\n\n                                  ELDERLY LADIES\n                        ...no, the Movie Classic channel\n                        is further down...past the Home\n                        Shopping...keep going...\n\n              He finds the Movie Classic channel, which is playing an old\n              black and white musical--\"Top Hat,\" with Fred Astaire and\n              Ginger Rogers. A delighted reaction:\n\n                                  ELDERLY LADY #2\n                        Oh! This is wonderful...\n\n              Paul\n\n              idly shifts his gaze to the TV...and his expression goes\n              slack with recognition and dismay. Elaine sees the look in\n              his eyes.\n\n              He glances away...even briefly considers walking out...but in\n              the end, he can't help himself. The past just caught up with\n              him with a freight-train wallop, and, for one, he decides to\n              ride the rails...\n\n              He looks back at the TV. On screen, Fred and Ginger have\n              begun their famous \"Cheek to Cheek\" number, with Astaire\n              singing in that sublime, easy-go-lucky way of his:\n\n                                  FRED ASTAIRE\n                        Heaven, I'm in heaven...and my\n                        heart beat so that I can hardly\n                        speak...\n\n              SLOW PUSH IN on Paul, watching. He'd like to take his eyes\n              off the screen, but the movie has him in a grip tighter than\n              Brad Dolan's. Elaine is watching him with puzzled concern:\n\n                                  ELAINE\n                        Paul? What is it?\n\n              No response. All he can hear is that music, all he can see\n              are those dancers. The figures on TV are gliding with\n              ghostlike grace in their silvery, phosphor-dot world of long\n              ago...\n\n              Paul abruptly bursts into tears.\n\n              The room goes quiet, everything comes to a standstill. All\n              eyes turn, some concerned, others merely curious. Paul just\n              sits sobbing into his hands, shoulders heaving.\n\n                                  ELAINE\n                        Paul...my God...\n\n                                  ORDERLY\n                               (rushing over)\n                        What is it? What's wrong?\n\n                                  PAUL\n                        It's okay...I'll be okay...\n\n              Another orderly appears--Brad Dolan. He puts his hand on\n              Paul's shoulder and leans close, feigning concern.\n\n                                  BRAD\n                        S'matter, Paulie? Why the boo-hoo-\n                        hoo? Something nasty happen?\n\n              Elaine shoves his hand away, eyes flashing with anger.\n\n                                  ELAINE\n                        Mr. Edgecomb will be perfectly\n                        fine without your help, thank you.\n\n              Brad back off with a \"hey, suit yourself\" gesture. Elaine\n              helps Paul to his feet and leads him out.\n\n                                                       CUT TO:\n\n              INT. SUN ROOM - DAY\n\n              Paul is staring out the windows, pensive and drained. It's\n              raining now, pattering the glass and the lawn beyond. Elaine\n              waits across from him, wishing he would speak. Softly:\n\n                                  PAUL\n                        I guess sometimes the past just\n                        catches up with you, whether you\n                        want it to or not. It's silly.\n\n                                  ELAINE\n                        Was it the film?\n                               (off his look)\n                        It was, wasn't it?\n\n                                  PAUL\n                        I haven't spoken of these things\n                        in a long time, Ellie. Over sixty\n                        years.\n\n              She reaches out, gently takes his hand.\n\n                                  ELAINE\n                        Paul. I'm your friend.\n\n                                  PAUL\n                        Yes. Yes you are.\n\n              Paul wonders if he's even up to talking about it after all\n              this time...and decides that perhaps he is:\n\n                                  PAUL\n                        I ever tell you I was a prison\n                        guard during the depression?\n\n                                  ELAINE\n                        You've mentioned it.\n\n                                  PAUL\n                        Did I mention I was in charge of\n                        death row? That I supervised all\n                        the executions?\n\n              This does come as a surprise. She shakes her head.\n\n                                  PAUL\n                        They usually call death row the\n                        Last Mile, but we called ours the\n                        Green Mile, because the floor was\n                        the color of faded limes. We had\n                        the electric chair then. Old\n                        Sparky, we called it.\n                               (beat)\n                        I've lived a lot of years, Ellie,\n                        but 1935 takes the prize. That was\n                        the year I had the worst urinary\n                        infection of my life. That was\n                        also the year of John Coffey, and\n                        the two dead girls...\n\n                                                       FADE TO BLACK\n\n              In blackness, a title card appears:\n\n                                  \"The Two Dead Girls\"\n\n                                                       CUT TO:\n\n              EXT. GEORGIA COUNTRYSIDE - DAY (1935)\n\n              HUNDREDS OF PRISONERS work the fields, pickaxes rising and\n              falling in waves, a prison song being sung in cadence with\n              the work. GUARDS patrol on horseback, rifles aimed at the sky.\n\n              A late 20's Ford PRISON TRUCK comes chugging into view along\n              the road, kicking up a long trail of dust in the heat. It\n              seems to be riding unusually low on its rear suspension.\n\n              EXT. COLD MOUNTAIN PENITENTIARY - ESTABLISHING - DAY\n\n              A Depression-era prison in the south. The prison truck sways\n              down the rutted dirt road toward the main gate...\n\n              INT. E BLOCK TOILET - DAY\n\n              ...while Paul Edgecomb, early 40's, stands in a cramped\n              toilet in his guard's uniform, trying to piss. His face is\n              pained, his forehead beaded with sweat.\n\n              INT. E BLOCK (THE GREEN MILE) - DAY\n\n              BRUTUS HOWELL(nicknamed \"Brutal\" for his intimidating size,\n              but he's actually rather thoughtful by nature) stands at the\n              entry door of the cellblock, peering out through a viewing\n              slot. He sees the prison truck arrive at the main gate.\n\n              He turns and nods to fellow guard DEAN STANTON sitting at the\n              duty desk, then cross the Green Mile--a wide corridor of\n              faded green linoleum running some sixty paces top to bottom,\n              with four large cells to a side.\n\n              Brutal steps to the bathroom, listen a moment, knocks softly.\n\n                                  BRUTAL\n                        Paul? Prisoner.\n\n                                  PAUL (O.S.)\n                        Christ. Gimme a minute.\n\n              Brutal waits patiently, a bit embarrassed. He finally hears\n              a THIN TRICKLE, accompanied by a stifled groan of pain.\n\n                                  BRUTAL\n                        You all right in there?\n\n                                  PAUL (O.S.)\n                        For a man pissing razor blades.\n\n              The door opens, revealing Paul's pale and sweaty face.\n\n                                  BRUTAL\n                        You should'a took the day off,\n                        gone to see the doctor.\n\n                                  PAUL\n                        With a new arrival? You know\n                        better. Besides, it's not as bad\n                        as it was. I think it's clearing\n                        up.\n\n              They hear the truck HONKING as it rumbles up outside. Paul\n              gives them a nod to resume their positions. Paul walks down\n              the Mile, passing the cells where two inmates reside--the\n              first is ARLEN BITTERBUCK, a Washita Cherokee; the second is\n              EDUARD DELACROIX(\"DEL\"), a skinny Cajun.\n\n                                  DEL\n                        New boy coming in, boss?\n\n                                  PAUL\n                        Never you mind, Del, you just keep\n                        your nose quietly on your business.\n\n              Paul arrives at the end of the Mile, takes up a position at\n              an empty cell. (Down at this end, past the cells, is E\n              Block's version of the \"hole\" -- a padded room where violent\n              inmates are sent to cool off. It isn't used very often...in\n              fact, at the moment, it's doubling as storage space.)\n\n              Brutal\n\n              peers out the viewing slot as the truck stops outside.\n\n                                  BRUTAL\n                        Damn, they're riding on the axle.\n                        What'd they do, bust the springs?\n\n              GUARDS PERCY WETMORE AND HARRY TERWILLIGER OF E BLOCK emerge\n              from the back of the truck and step down, turn back...\n\n              Tighter angle on back of truck\n\n              We get our first glimpse of the new inmate as a pair of\n              GIGANTIC BLACK FEET step down into the yard...and the rear of\n              the truck bounces back up on its springs where it belongs.\n\n              Brutal\n\n              sees what's coming, eyes widening slightly.\n\n                                  BRUTAL\n                        Paul? You might wanna reconsider\n                        getting in the cell with this guy?\n\n                                  PAUL\n                        Why's that?\n\n                                  BRUTAL\n                        He's enormous.\n\n                                  PAUL\n                        Can't be bigger than you.\n\n              Brutal tosses him a look--just wait. He swings the door open\n              in a hot flood of daylight, giving us our first good look at:\n\n              John coffey\n\n              is a huge black man, nearly 7 feet tall and 300 pounds, his\n              massive head shiny and bald, his skin a tapestry of old\n              scars, his prison overalls (the biggest size they had) ending\n              at mid-calf. He looks dull and confused, as if wondering\n              where he is and how he got there. Percy and Harry lead him\n              toward E Block in shackles. Percy's got his hickory baton out\n              of it custom-made holster, hollering:\n\n                                  PERCY\n                        Dead man walking! Dead man walking\n                        here!\n\n              Inside the cellblock\n\n              Paul can't see them approach from where he stands, but he can\n              certainly hear Percy:\n\n                                  PAUL\n                        Jeezus, pleeze-us, what the hell's\n                        he yelling about?\n\n              Up by the door, Brutal just rolls his eyes. Percy is the\n              first one through the door, still hollering...\n\n                                  PERCY\n                        Dead man walking!\n\n              ...then Coffey enters, ducking low to get through, his shadow\n              blotting out Brutal and Dean as his massive frame fills the\n              door. Everything hangs suspended for a moment, a look of\n              \"hold shit\" written on everybody's faces. Percy keeps yanking\n              on the big man's cuffs, leading him along with a cry of:\n\n                                  PERCY\n                        Dead man walking! Dead man--\n\n                                  PAUL\n                        Percy, that's enough.\n\n              Percy falls reproachfully silent. Paul doesn't dignify it,\n              just motions for them to come on. The procession comes down\n              the Mile, with Brutal and Dean bringing up rear.\n\n                                  BRUTAL\n                        You sure you wanna be in there\n                        with him?\n\n                                  PAUL\n                               (looks to Coffey)\n                        Am I gonna have trouble with you,\n                        big boy?\n\n              Coffey shakes his head slowly. Paul takes the clipboard\n              transfer papers from Harry, turns and enters the cell.\n\n              Coffey just stands outside the cell and waits, as if he\n              doesn't understand the concept. Paul motions him to come on\n              in. Coffey starts to comply, but Percy raps him smartly with\n              the tip of his hickory baton to get him moving faster.\n\n              Coffey flinches, enters the cell. Paul stares angrily at\n              Percy, who stands slapping his hickory baton against the palm\n              of his hand like a man with a toy he's itching to use.\n\n                                  PAUL\n                        Percy. They're moving house over\n                        in the infirmary. Why don't you go\n                        see if they could use some help?\n\n                                  PERCY\n                        They got all the men they need.\n\n                                  PAUL\n                        Why don't you just go make sure?\n                               (off his look)\n                        I don't care where you go, Percy,\n                        as long as it's not here at this\n                        very moment.\n\n              Percy flushes red, the baton hovering near his palm. He looks\n              like he's about to say something, but thinks better of it and\n              stalks angrily up the Mile instead...\n\n              ...and sees Del at his bars, smiling. Infuriated, Percy\n              swings his baton and smashes Del's fingers with a LOUD CRACK.\n              Del jerks back, howling in pain:\n\n                                  DEL\n                        OWW, GOD, HE BUS' MY FINGERS!\n\n                                  PERCY\n                        Wiped that grin off your shitpoke\n                        face, didn't I\n\n                                  PAUL\n                        Goddamn it, Percy! Get the hell\n                        off my block!\n\n              Percy throws Paul a look of disdain--your block, huh? He\n              swaggers out. Del's on his knees, weeping from the pain:\n\n                                  DEL\n                        Oww, damn, boss, he done bus' my\n                        fingers for true...\n\n                                  PAUL\n                        We'll get it looked at, Del, now\n                        keep yourself quiet like I said!\n\n              Del falls silent, moaning over his hand. Paul turns to\n              Coffey, who looks unsettled by all the commotion.\n\n                                  PAUL\n                        If I let Harry take those chains\n                        off you, you gonna be nice?\n\n              Coffey nods. Harry enters to remove Coffey's shackles.\n\n                                  PAUL\n                        Your name is John Coffey.\n\n                                  COFFEY\n                               (deep and quiet)\n                        Yes, sir, boss, like the drink,\n                        only not spelt the same.\n\n                                  PAUL\n                        So you can spell, can you?\n\n              Coffey shakes his head. Harry steps out.\n\n                                  PAUL\n                        My name is Paul Edgecomb. If I'm\n                        not here, you can ask for Mr.\n                        Terwilliger, Mr. Howell, or Mr.\n                        Stanton...those gentlemen there.\n                               (beat)\n                        This isn't like the rest of the\n                        prison. It's a quiet place, we\n                        like to keep it that way.\n\n              Coffey considers this carefully, puzzled.\n\n                                  COFFEY\n                        It weren't me making all the\n                        noise, boss.\n\n                                  PAUL\n                               (eyes narrowing)\n                        You having a joke on me, John\n                        Coffey?\n\n                                  COFFEY\n                        No, sir.\n\n              Paul sees he isn't joking, continues:\n\n                                  PAUL\n                        Your time here can be easy or\n                        hard, depends on you. If you\n                        behave, you get to walk in the\n                        exercise yard every day.\n\n                        We might even play some music on\n                        the radio from time to time.\n                        Questions?\n\n              Coffey doesn't miss a beat, as if he's been waiting to ask:\n\n                                  COFFEY\n                        Do you leave a light on after\n                        bedtime?\n\n              Paul blinks. It's the last thing he expected. Coffey smiles\n              uneasily, as if they might think him foolish for asking.\n\n                                  COFFEY\n                        Because I get a little scared in\n                        the dark sometimes. If it's a\n                        strange place.\n\n              Paul looks to his men. The guards are trading glances.\n\n                                  PAUL\n                        It's pretty bright in here all\n                        night long. We keep half the\n                        lights burning in the corridor.\n\n                                  COFFEY\n                        Cor'der.\n\n              Coffey looks confused. Paul points to the lights lining the\n              ceiling of the Green Mile in wire mesh cages.\n\n                                  PAUL\n                        Right out there.\n\n              Coffey nods, relieved. Then he surprises everybody by\n              offering Paul his hand, as if to show proper manners. Paul\n              hesitates, oddly touched, then surprised his men even more by\n              accepting. Coffey's hand swallows his. Coffey shakes gently,\n              lets go.\n\n              Paul steps from the cell. Brutal slides the door shut, locks\n              it. Coffey stands a moment as if unsure what to do, then\n              sinks onto the cot with his hands clasped between his knees.\n              He looks up at Paul, his voice soft as a whisper:\n\n                                  COFFEY\n                        Couldn't help it, boss. I tried to\n                        take it back, but it was too late.\n\n              Paul turns, leads his men up the Mile...\n\n              PAUL'S INNER OFFICE\n\n              ...and they enter a few moments later. Paul is furious, but\n              keeping a lid on his temper:\n\n                                  PAUL\n                        Dean, run Delacroix up to the\n                        infirmary and see if his fingers\n                        are broken.\n\n                                  BRUTAL\n                        Course they're broken, I heard the\n                        damn bones crack. Goddamn Percy.\n\n                                  HARRY\n                        You hear what he was yelling when\n                        we brought the big dummy in?\n\n                                  PAUL\n                        How could I miss it, Harry? The\n                        whole prison heard.\n\n              This makes Brutal snort, breaking the tension--the others\n              can't help smiling.\n\n                                  BRUTAL\n                        You'll probably have to answer for\n                        sending him off the Mile. He's\n                        gonna cause you trouble over this,\n                        you mark me.\n\n                                  PAUL\n                        I'll chew that food when I have\n                        to. Right now I wanna hear about\n                        the new inmate...aside from how\n                        big he is, okay?\n\n                                  BRUTAL\n                               (smiles)\n                        Monstrous big. Damn.\n\n                                  PAUL\n                        Seems meek enough. Looks like they\n                        sent us an imbecile to execute.\n\n                                  HARRY\n                        Imbecile or not, he deserves to\n                        fry for what he done. Here...\n\n              Harry tosses a pair of manila envelopes bound with rubber\n              bands on the desk before Paul--Coffey's file.\n\n                                  HARRY\n                        ...make your blood curdle.\n\n                                                       CUT TO:\n\n              EXT. E BLOCK PRISON YARD - DAY\n\n              A small are reserved for inmates of the Mile, fenced-off from\n              the main prison yard. Arlen Bitterbuck walks the perimeter\n              under the watchful eyes of guard BILL DODGE.\n\n              We find Paul sitting by himself on the bleachers with\n              Coffey's file on his knees, thoughtfully unwrapping his brown-\n              bagged sandwich. PUSH SLOWLY IN as he begins to read...\n\n              EXT. DETTERICK FARM - DAWN (FLASHBACK)\n\n              ...and we see Klaus Detterick walk from his house to the barn\n              with a milking pail, a solitary figure against a brightening\n              horizon. He disappears into the barn...\n\n              ...and we hold for a long moment, the house silent\n              b.g.,chickens clucking and scratching in the front yard...\n\n              ...until a WOMAN'S SCREAM shatters the silence. Klaus\n              reappears, dropping the pail, running toward the house...\n\n              PAUL ON BLEACHERS\n\n              ...as Paul turns the page, keeps reading...\n\n              INT. DETTERICK HOUSE - DAWN (FLASHBACK)\n\n              ...and Klaus bursts in to find his wife MARJORIE absolutely\n              frantic with terror:\n\n                                  KLAUS\n                        WHAT? GOD SAKES, WHAT?\n\n                                  MARJORIE\n                        THE GIRLS! THE GIRLS ARE GONE!\n\n              She drags him through the house to a screened-off porch area\n              where their 12 year old son HOWIE is pointing and shouting--\n\n                                  HOWIE\n                        Papa! Papa, look! The blood!\n\n              --and Klaus freezes there, stunned to see blood spattered on\n              the floor and the screen door hanging off its hinges...\n\n                                  KLAUS\n                        Oh my God.\n\n              PAUL ON BLEACHERS\n\n              ...as Paul absently takes another bite of his sandwich, not\n              really tasting it, keeps reading...\n\n              INT. DETTERICK HOUSE - DAWN (FLASHBACK)\n\n              ...plunging us back into the screaming chaos: Klaus grabbing\n              up shotgun shells, Howie loading the .22 rifle he got for\n              Christmas, Marjorie sobbing incoherently...\n\n                                  KLAUS\n                        GODDAMN IT, WOMAN, GET ON THE\n                        PHONE NOW! YOU TELL 'EM WE HEADED\n                        WEST! MIND WHAT I'M SAYING! WEST,\n                        Y'HEAR?\n\n              ...and she goes stumbling through the house, grabbing for the\n              phone as her men disappear toward the porch b.g.:\n\n                                  MARJORIE\n                        Central! Central, are you on the\n                        line? Oh, God, please, somebody\n                        took my little girls...\n\n              OUTSIDE THE HOUSE\n\n              Klaus and his son race from the house, following spatters of\n              blood across the yard...\n\n              PAUL ON THE BLEACHERS\n\n              ...as Paul lets out a long breath, turns the page...\n\n              EXT. COUNTRY ROAD/FIELD - DAY (FLASHBACK)\n\n              ---and we see CARS AND TRUCKS pulling up, MEN jumping out\n              with rifles, pouring down the incline toward the field where\n              Klaus is hollering and waving his arms. Deputy McGee comes\n              sliding down from the road, taking charge at the top of his\n              lungs--\n\n                                  McGEE\n                        I WANT ALL THE WEAPONS UNLOADED,\n                        Y'HEAR? TAKE OUT YOUR SHELLS, I\n                        WON'T HAVE A MAN SHOT BY ACCIDENT\n                        TODAY! BOBO, WHERE THEM DOGS?\n\n              --and the dogs come bounding out of the back of a truck,\n              howling down the incline to lead the chase...\n\n              VARIOUS ANGLES\n\n              ...which takes us through the cattails and bulrushes...to the\n              spot where Klaus finds the little scrap of pale yellow\n              fabric, turns and screams...\n\n                                  KLAUS\n                        Oh, Lord, this belongs to my\n                        Katie...\n\n              ...and they keep going, stopping abruptly as they find: A\n              blood-drenched area of tramped grass. A little girl's bloody\n              nightgown hangs in the low branches of a tree. Some of these\n              strong men look like they might throw up or faint at the\n              sight of it. Their blood freezes in their veins as an INHUMAN\n              HOWLING commences up ahead. It's like nothing they've ever\n              heard before, raising the hackles of men and dogs alike.\n\n              PAUL ON BLEACHERS\n\n              ...as Paul quietly turns another page, shaking his head...\n\n                                  PAUL\n                        Jesus.\n\n              EXT. FIELD - DAY (FLASHBACK)\n\n              The men reload their weapons. Everybody's terrified. McGee\n              starts off, the other following his lead toward--\n\n              THE RIVER\n\n              --where they emerge from the treeline, drawing ever closer to\n              the source of that INHUMAN HOWLING...\n\n              ...and they stop, gazing in horror:\n\n              John Coffey sits on the riverbank in bloody overalls, his\n              huge feet splayed out before him. He's making that inhuman\n              howling sound, face twisted in monstrous grief, pausing\n              occasionally to take in a great hitching breath of air.\n\n              Curled in his massive arms are the naked bodies of\n              Detterick's 9 year-old twin girls, their once-blonde hair now\n              matted to their heads with blood.\n\n              A tableau. The men staring. John Coffey howling. A train\n              puffing smoke across the landscape.\n\n              Klaus Detterick breaks the moment, lunging down the riverbank\n              in a headlong rush. The others try to grab him, but he shrugs\n              them off and throws himself on Coffey with a scream of\n              inarticulate rage, kicking and punching, fists flying. Coffey\n              barely seems to notice.\n\n              The others catch up with Klaus, drag him off. He falls to his\n              knees on the riverbank, sobbing into his hands. Howie runs to\n              him, throws himself into his father's arm. They hug each\n              other tightly, overwhelmed with grief.\n\n              A semblance of quiet descends, except for Coffey's\n              heartbroken wailing. A ring of rifle toting men forms around\n              him, though he hardly seems aware of it. McGee steps forward,\n              uncertain:\n\n                                  McGEE\n                        Mister.\n\n              Coffey goes quiet at once, eyes still streaming tears.\n\n                                  McGEE\n                        Mister? Can you hear me?\n                               (Coffey nods)\n                        You have a name?\n\n                                  COFFEY\n                        John Coffey. Like the drink, only\n                        not spelt the same.\n\n              McGee hunkers carefully down, watching for any sudden moves.\n\n                                  McGEE\n                        What happened here, John Coffey?\n                        You want to tell me that?\n\n                                  COFFEY\n                        I couldn't help it. I tried to\n                        take it back, but it was too late.\n\n                                  McGEE\n                               (pause)\n                        Boy, you are under arrest for\n                        murder.\n\n              McGee spits in Coffey's face...\n\n              PAUL ON BLEACHERS\n\n              ...as Paul looks up with a slight start, jarred from his\n              reading to find WARDEN HAL MOORES standing before him.\n\n                                  HAL\n                        I interrupt?\n\n                                  PAUL\n                        I'm just about done.\n\n              Paul stows the file as Hal settles onto the bleachers.\n\n                                  PAUL\n                        How's that pretty gal of yours?\n\n                                  HAL\n                        Melinda's not so well, Paul. Not\n                        so well at all. Got laid up with\n                        another headache yesterday. Worst\n                        one yet. She's also developed this\n                        weakness in her right hand.\n\n                                  PAUL\n                        Doctor still think it's migraines?\n\n              Hal gives a slight shake of his head.\n\n                                  HAL\n                        I'll be taking her up to Indianola\n                        next day or so for some tests. Had\n                        X-rays and the like. She is scared\n                        to death. Truth to tell, so am I.\n\n                                  PAUL\n                        If it's something they can see\n                        with an X-ray, maybe it's\n                        something they can fix.\n\n                                  HAL\n                        Maybe.\n\n              He pulls a letter, hands it to Paul.\n\n                                  HAL\n                        This just came in. D.O.E. on\n                        Bitterbuck.\n\n              Paul glances toward Bitterbuck, scans the letter, nods.\n\n                                  PAUL\n                        You didn't come all the way down\n                        here just to hand me a D.O.E.\n\n                                  HAL\n                        No. I had an angry call from the\n                        state capital about twenty minutes\n                        ago. Is it true you ordered Percy\n                        Wetmore off the block.\n\n                                  PAUL\n                        It is.\n\n                                  HAL\n                        I'm sure you had reason, but like\n                        it or not, the wife of the\n                        governor of this state has only\n                        one nephew, and his name happens\n                        to be Percy Wetmore. I need to\n                        tell you how this lays out?\n\n                                  PAUL\n                        Little Percy called his aunt and\n                        squealed like a schoolroom sissy.\n                               (Hal nods)\n                        He also mention he assaulted a\n                        prisoner this morning out of sheer\n                        petulance? Broke three fingers on\n                        Eduard Delacroix's left hand.\n\n                                  HAL\n                        I didn't hear that part. I'm sure\n                        she didn't either.\n\n                                  PAUL\n                        The man is mean, careless, and\n                        stupid. Bad combination in a place\n                        like this. Sooner or later, he's\n                        gonna get somebody hurt. Or worse.\n\n                                  HAL\n                        You and Brutus Howell will make\n                        sure that doesn't happen.\n\n                                  PAUL\n                        Easy enough to say. We can't watch\n                        him every minute, Hal.\n\n                                  HAL\n                        Stick with it. May not be much\n                        longer. I have it on good\n                        authority that Percy has an\n                        application in at Briar Ridge.\n\n                                  PAUL\n                        The mental hospital?\n\n                                  HAL\n                               (nods)\n                        Administration job. Better pay.\n\n                                  PAUL\n                        Then why's he still here? He could\n                        get that application pushed\n                        through...hell, with his\n                        connections, he could have any\n                        state job he wants.\n\n              Hal has no answer. Paul look off toward Bitterbuck.\n\n                                  PAUL\n                        Tell you what I think. I think he\n                        just wants to see one cook up\n                        close.\n\n              Hal follows Paul's gaze, takes his meaning.\n\n                                  HAL\n                        Well, he'll get his chance then,\n                        won't he? Maybe then he'll be\n                        satisfied and move on. In the\n                        meantime, you'll keep the peace.\n\n                                  PAUL\n                        Of course.\n\n                                  HAL\n                        Thank you, Paul.\n\n              Hal rises, slapping yard dust off his trousers.\n\n                                  PAUL\n                        You give Melinda my love, okay? I\n                        bet that X-ray turns out to be\n                        nothing at all.\n\n              Hal walks off looking like he's got the weight of the world\n              on his shoulders. Paul looks at the letter again...\n\n              TIGHT ON LETTER\n\n              ...which is head: Date Of Execution.\"\n\n                                                       DISSOLVE TO:\n\n              INT. PAUL'S HOUSE - NIGHT\n\n              Paul is at the kitchen table in the wee hours of the morning,\n              drinking buttermilk and listening to SOFT MUSIC on the radio.\n              JANICE EDGECOMB appears, shuffling sleepily downstairs.\n\n                                  JAN\n                        Paul?\n\n                                  PAUL\n                        Hey, you. Music too loud?\n\n                                  JAN\n                        No. There's just this big empty\n                        spot in the bed where my husband\n                        usually sleeps.\n\n                                  PAUL\n                        He said to tell you he's having a\n                        little trouble with that tonight.\n\n              She comes into the kitchen, strokes his hair. There's an easy\n              familiarity and a deep love between these two.\n\n                                  JAN\n                        Worried about Melinda and Hal? Is\n                        that what's got you up?\n\n                                  PAUL\n                        Yeah, that. Things.\n\n                                  JAN\n                        Things.\n\n              She sits on his lap and gives him a crooked smile--you're not\n              getting off that easily.\n\n                                  PAUL\n                        Got a new inmate today. Big,\n                        simple-minded fella.\n\n                                  JAN\n                        Do I want to hear what he did?\n\n                                  PAUL\n                        No. One sleepless member of this\n                        family's enough.\n                               (softly)\n                        The things that happen in this\n                        world. It's a wonder God allows it.\n\n              She gives him a tiny kiss above his left eyebrow, in that\n              special spot that makes him prickle.\n\n                                  JAN\n                        Why don't you come to bed? I've\n                        got something to help you sleep,\n                        and you can have all you want.\n\n                                  PAUL\n                        Don't I wish. I've still got\n                        something wrong with my\n                        waterworks, I don't want to pass\n                        it on.\n\n                                  JAN\n                        You see Doc Sadler yet?\n\n                                  PAUL\n                        No, because he'll want me to take\n                        sulfa tablets and I'll spend the\n                        rest of the week puking in every\n                        corner of my office. It'll run its\n                        course all by itself, thank you\n                        very much for your concern.\n\n              She kisses that spot above his eyebrow again. He smiles.\n\n                                  JAN\n                        Poor old guy...\n\n                                                       DISSOLVE TO:\n\n              IN TIGHT ANGLES: Copper plugs are cleaned, switches are\n              oiled, circuits are tested...\n\n              INT. EXECUTION CHAMBER - NIGHT\n\n              ...as maintenance is performed on Old Sparky by JACK VAN HAY\n              and a small crew. Paul is carefully sanding a connector plug.\n              Dean is waxing Old Sparky's wooden arms to a gleam.\n\n              Paul and Dean pause, thinking they hear a LAUGH drifting in\n              from E Block...and then Brutal calls softly to them:\n\n                                  BRUTAL (O.S.)\n                        Paul? Dean?\n\n              INT. E BLOCK - NIGHT\n\n              Paul and Dean enter to find Brutal trying not to wake the\n              cons in their cells by laughing too loudly. They follows his\n              gaze down the Mile, see nothing, turn to him like he's crazy.\n\n                                  BRUTAL\n                        I guess the legislature loosened\n                        those purse-strings enough to hire\n                        on a new guard.\n                               (off their looks)\n                        Look again. He's right there.\n\n              Paul and Dean look again and this time they see it:\n\n              A tiny brown mouse is coming up the Mile. It trots a short\n              distance, peers right and left as if checking the snoring\n              inmates in their cells, then makes another forward spurt.\n\n                                  PAUL\n                        He's doing a cell check.\n\n              This gets them all trying not to laugh. The mouse draws ever\n              closer. Dean starts to look worried.\n\n                                  DEAN\n                        It ain't normal for a mouse to\n                        come up on people that way. Maybe\n                        it's rabid.\n\n                                  BRUTAL\n                        Oh, my Christ. The big mouse\n                        expert. The Mouse Man. You see it\n                        foaming at the mouth, Mouse Man?\n\n                                  DEAN\n                               (dubious)\n                        I don't see its mouth at all.\n\n              That does it--Paul and Brutal burst out laughing. The mouse\n              stops before them and peers up, curling its tail primly\n              around its paws as if to wait. The guards fall silent,\n              fascinated. Bitterbuck stirs in his cell, sits up to watch.\n\n              Brutal tears off a piece of his half-eaten corned beef\n              sandwich, holds it delicately out with two fingers. The mouse\n              rises up, appraising the morsel with shiny black eyes.\n\n                                  DEAN\n                        Aw, Brutal, no! We'll be hip-deep\n                        in mice around here...\n\n                                  BRUTAL\n                               (to Paul)\n                        I just wanna see what he'll do. In\n                        the interests of science, like.\n\n              Paul shrugs. Brutal drops the scrap. The mouse grabs it and\n              eats, sitting up like a dog doing a trick.\n\n              The mouse turns and scurries back down the Mile, vanishing\n              under the restraint room door at the far end. Dean throws\n              Paul an \"I told you so\" look.\n\n                                  DEAN\n                        He's in the damn restraint room.\n                        You know he's gonna be chewing the\n                        padding out of walls and making\n                        himself a nice little nest.\n\n              Brutal give Paul a sheepish look--well? Paul sighs.\n\n                                  PAUL\n                        All right. Let's get the damn\n                        mouse.\n\n              They stride grimly down the Mile to the restraint room door,\n              men on a mission. Coffey's awake now, peering from his cot.\n\n                                  COFFEY\n                        Saw me a mouse go by.\n\n                                  PAUL\n                        It was a dream. Go back to sleep.\n\n                                  COFFEY\n                        Weren't no dream. It was a mouse\n                        all right.\n\n                                  PAUL\n                        Can't put anything over on you.\n\n              Paul unlocks the door, revealing a padded room filled with\n              storage: cleaning supplies, buckets of paint, mops and\n              ladders, you name it. Brutal shrugs off his jacket. Paul\n              grabs a mop from a steel bucket, hands it to Dean.\n\n                                  PAUL\n                        Dean, watch the door. He tries to\n                        get past you, whack him.\n\n                                  DEAN\n                        Brutal or the mouse?\n\n                                  BRUTAL\n                        Har har, Mouse Man.\n\n              Brutal and Paul start doing the heavy lifting, muscling an\n              unused filing cabinet out the door...\n\n                                                       DISSOLVE:\n\n              ...and they finally relay the last few heavy buckets of paint\n              onto the Mile. Paul and Brutal catch their breath, scanning\n              the empty restraint room. Their eyes go glaringly to Dean.\n\n                                  PAUL\n                        You let him get past you.\n\n                                  DEAN\n                        No I didn't, I was here all the\n                        time!\n\n                                  BRUTAL\n                        Then where the hell is he?\n\n              They move slowly into the room, peering into every nook and\n              cranny, utterly mystified. Brutal shakes his head.\n\n                                  BRUTAL\n                        Three grown men. Outsmarted by a\n                        mouse.\n\n                                  DEAN\n                        Well, bright side is, all this\n                        commotion probably scared him off\n                        for good.\n\n                                  PAUL\n                        Yeah, that's right. That's the\n                        last we'll see of him...\n\n                                                       FADE TO BLACK\n\n              IN BLACKNESS, A TITLE CARD APPEARS:\n\n                                \"The Mouse on the Mile\"\n\n                                                       CUT TO:\n\n              INT. E BLOCK - DAY\n\n              A low, static shot. Green floor stretching before us. Harry\n              and Bill Dodge are at the desk b.g., doing paperwork and\n              filing chores. Percy is idling nearby, whistling softly and\n              combing his hair...\n\n              ...and into this quiet shot, deep in foreground, creeps the\n              mouse. He starts walking the Mile as before...\n\n              ...right toward Percy.\n\n              COFFEY\n\n              stares through his bars as the mouse goes by...\n\n              PERCY\n\n              keeps combing his hair, unaware...\n\n              DEL\n\n              sits quietly picking his nose in his cell. The mouse appears\n              outside the bars, cruising inexorably up the Mile. Del turns\n              slowly, watches the mouse go by...\n\n              PERCY\n\n              still grooming himself, still unaware...\n\n              THE MOUSE\n\n              keeps coming closer. ANGLE UP to Bitterbuck peering through\n              his bars, watching him go by...\n\n              PERCY\n\n              keeps working that comb--and freezes at the sound of a TINY\n              SQUEAK. His head swivels slowly...\n\n              ...and there's the mouse. Staring at him.\n\n              That moment of eye contact reveals an enmity older than time\n              itself. If mice have a natural enemy, Percy is it.\n\n                                  PAUL\n                        You little son of a bitch.\n\n              Harry and Bill glance up from their work.\n\n                                  HARRY\n                        Well, I'll be damned. There he is,\n                        big as Billy-be-frigged. I thought\n                        Brutal was pulling my leg.\n\n                                  BILL\n                        That's a goddamn mouse.\n\n                                  HARRY\n                        Yeah. Brute said he was in here\n                        last night begging for food, came\n                        right up to the desk.\n\n                                  BILL\n                        My ass. Give him some room, Percy,\n                        see what he does.\n\n              Percy takes a few careful steps back, eyes never leaving the\n              mouse. (Percy's hand starts easing toward the handle of his\n              baton.) The mouse comes up to the desk as before.\n\n                                  HARRY\n                        Brave little bastard, gotta give\n                        him that.\n\n              Harry breaks off a small piece of cracker and drops it. The\n              mouse picks it up, starts to eat. (Percy's hand inches ever\n              closer to his baton).\n\n                                  BILL\n                        Here, lemme try.\n\n              Bill drops a piece of cracker. The mouse ignores it\n              completely, keeping its beady little eyes on Harry. (Percy's\n              hand starts easing his baton from its holster.)\n\n                                  BILL\n                        Maybe he's full.\n\n                                  HARRY\n                               (grins)\n                        Maybe he knows you're just a\n                        floater. Gotta be an E Block\n                        regular to feed the E Block mouse,\n                        don'cha know...\n\n              Harry drops another piece--and sure enough, the mouse starts\n              to eat. Harry's smile fades. He and Bill trade a look.\n\n                                  HARRY\n                        I was just kidding ab--\n\n              Percy lets rip a BELLOWING WAR CRY (\"Yaaaahhh!\") and launches\n              his baton like a spear, scaring the crap out of everyone.\n\n              The mouse ducks (yes, actually ducks) and the baton sail over\n              his head close enough to ruffle its fur, bouncing off the\n              floor. Apparently remembering a pressing engagement\n              elsewhere, the mouse takes off in a flash toward the\n              restraint room.\n\n              Percy roars with frustration and takes off after it, trying\n              to squash it with his heavy work shoes, leaping and stomping\n              with great big galloping strides, missing the mouse by\n              inches...\n\n              ...and thus is the Green Mile traversed, with Percy stomping\n              and hollering like a spastic flamenco dancer, the convicts\n              yelling at their bars, the mouse zigging and zagging like Jim\n              Thorpe heading for the endzone...\n\n              The mouse wins, zipping to safety under the restraint room\n              door. Percy pounds his fist against the door in frustration:\n\n                                  PERCY\n                        FUCK!\n\n              He fumbles with his keys, unlocks the door, yelling all the\n              while:\n\n                                  PERCY\n                        I'M GONNA RIP YOUR DISEASED HEAD\n                        OFF, YOU LITTLE PIECE OF SHIT!\n\n              OUTSIDE E BLOCK\n\n              Paul and Brutal are arriving for work--they pause, hearing\n              PERCY'S YELLS drifting from the windows. The regular CONS in\n              the yard are drifting curiously to the fence, wondering if a\n              riot's brewing. Paul and Brutal take off running--\n\n              INSIDE E BLOCK\n\n              --and rush in to find:\n\n                                  HARRY\n                        Percy met your mouse.\n\n              Harry points. Percy's down at the far end, rummaging wildly\n              in the restraint room, tossing shit out onto the Mile.\n\n                                  PERCY\n                        It's in here somewhere! I'm gonna\n                        squish the little son of a bitch!\n\n              He starts muscling the filing cabinet out the door, kicking\n              buckets out of his way. Brutal calls out to him:\n\n                                  BRUTAL\n                        Percy, we already tried that--\n\n                                  PERCY\n                        What? Whad'ja say?\n\n                                  BRUTAL\n                        I said--\n\n              Paul stops Brutal with a look--don't you dare stop him.\n\n                                  BRUTAL\n                        --uh, knock yourself out. Hope you\n                        nail the bastard.\n\n              Paul crosses his arms and smiles, leans back against the desk\n              to wait...\n\n                                                       DISSOLVE:\n\n              ...and Percy hauls the last of the stuff out, exhausted. He\n              steps back in and looks around, unable to believe there's no\n              mouse cowering in the corner. Paul and the men approach,\n              keeping straight faces, navigating the crap in the corridor.\n\n                                  BRUTAL\n                        Gosh. Ain't in there, huh? Don't\n                        that beat the mousie band?\n\n              Percy keeps scanning the restraint room. The others all look\n              to Paul, waiting for him to speak--you're the boss.\n\n                                  PAUL\n                        Percy. You want to think about\n                        what you were doing just now.\n\n                                  PERCY\n                               (turns, glaring)\n                        I know what I was doing. Trying to\n                        get the mouse. You blind?\n\n                                  HARRY\n                        You also scared the living crap\n                        out of me and Bill. And them.\n\n              He cocks a thumb at the inmates in their cells.\n\n                                  PERCY\n                        So what? They aren't in cradle-\n                        school, case you didn't notice...\n\n                               (directed at Paul)\n                        ...although you treat them that\n                        way half the time.\n\n                                  BRUTAL\n                        We don't scare 'em any more than\n                        we have to, Percy. They're under\n                        enough strain as it is.\n\n                                  PAUL\n                        Men under strain can snap. Hurt\n                        themselves. Hurt others. That's\n                        why our job is talking, not\n                        yelling. You'll do better to think\n                        of this place like an intensive\n                        care ward in a hospital--\n\n                                  PERCY\n                        I think of it as a bucket of piss\n                        to drown rats in. That's all.\n                               (scans their faces)\n                        Anybody doesn't like it can kiss\n                        my ass. How's that sit?\n\n              Brutal steps forward, wanting to slug the little bastard.\n              Percy shies back, but keeps his bravado up:\n\n                                  PERCY\n                        Try it. You'll be on the bread\n                        lines before the week is out.\n\n                                  PAUL\n                        We all know who your connections\n                        are, Percy...\n                               (steps close)\n                        ...but you ever threaten a man on\n                        this block again, we're all gonna\n                        have a go. Job be damned.\n\n                                  PERCY\n                        Big talk. You done?\n\n                                  PAUL\n                        Get all this shit back in the\n                        restraint room. You're cluttering\n                        up my Mile.\n\n              They turn and walk away, leaving Percy as we\n\n                                                       DISSOLVE TO:\n\n              INT. E BLOCK - NIGHT\n\n              A SLOW TRACKING SHOT OF THE GREEN FLOOR takes us past a tiny\n              scrap of break...and then another...and then past a mousetrap\n              primed with a scrap of bacon...\n\n              ...and we keep following a long trail of bread scraps and\n              mousetraps until we come to Percy, alone on the Mile,\n              carefully laying the last mousetrap down...\n\n              ...and he scoots back against the desk to wait, crouched and\n              holding his breath, eyes riveted to the restraint room door\n              for any sign of his furry nemesis...\n\n              ...and CAMERA BOOMS SLOWLY DOWN off his face, dipping down to\n              floor level...\n\n              ...where the mouse is revealed under the desk, peering in the\n              same direction as Percy, wondering what the hell's so\n              interesting down there. It hops further out to see...\n\n              ANGLE OF PERCY FROM FLOOR LEVEL\n\n              ...and the mouse enters frame, hopping out a few more steps,\n              mouse and man staring in the same direction.\n\n              A long beat. Percy turns, looks down at the mouse. The mouse\n              turns, looks up at Percy...\n\n              ...and all hell breaks loose again. They race the Mile as\n              before, Percy hollering and stomping all the way, mousetraps\n              snapping and flying up into frame as they go charging wildly\n              past the cells.\n\n              The mouse wins again. Percy pauses, furious...and sees Coffey\n              staring at him from his cell.\n\n                                  COFFEY\n                        Saw me a mouse go by.\n\n              Percy loses it, kicking and punching the restraint room door\n              in a screaming rage as we\n\n                                                       FADE TO:\n\n              INT. E BLOCK - DAY\n\n              Paul appears at Bitterbuck's bars with a group of guards.\n\n                                  PAUL\n                        Arlen? Your daughter and her\n                        family are here.\n\n              Bitterbuck steps from his cell. Bill Dodge escorts him off\n              the block. The moment they're gone:\n\n                                  PAUL\n                        Let's move. I want at least two\n                        rehearsals before he gets back.\n\n              INT. VISITOR'S ROOM - DAY\n\n              Bitterbuck is led in. His DAUGHTER rises...an awkward\n              hesitation...and she touches his face, kisses him. He takes\n              her hands, kisses them, tries not to cry. The rest of the\n              family is there: SON-IN-LAW, GRANDCHILDREN, COUSINS. They\n              form around him, murmuring hellos, shaking hands...\n\n              INT. E BLOCK - DAY\n\n              ...while TOOT-TOOT takes Bitterbuck's place in the cell. He's\n              a wiry and toothless old trusty, crazy as a tick. He sits:\n\n                                  TOOT\n                        Sittin' down, sittin' down,\n                        rehearsing now! Everybody settle!\n\n              He glances to Paul--okay, hit it.\n\n                                  PAUL\n                        Arlen Bitterbuck, step forward.\n\n              Toot springs to his feet and steps from the cell.\n\n                                  TOOT\n                        I'm steppin' forward, I'm steppin'\n                        forward, I'm steppin' forward...\n\n              Toot turns, shows the top of his head to Dean.\n\n                                  PAUL\n                        Is his head properly shaved?\n\n                                  DEAN\n                        No, it's dandruffy and it smells.\n\n                                  PAUL\n                        I'll take that for a yes. All\n                        right, Arlen, let's go.\n\n              Toot starts up the corridor, ringed by guards.\n\n                                  TOOT\n                        I'm walkin' the Mile, I'm walkin'\n                        the Mile, I'm walkin' the Mile...\n\n              PAUL'S INNER OFFICE\n\n              Toot throws himself to his knees as soon as they enter:\n\n                                  TOOT\n                        I'm prayin', I'm prayin', I'm\n                        prayin'. The Lord is my shepherd,\n                        so on an' so forth...\n\n                                  PAUL\n                        Toot, you have to wait till I tell\n                        you to pray.\n                               (Toot waits)\n                        Okay, pray.\n\n                                  TOOT\n                        Still prayin', still prayin'...\n\n                                  HARRY\n                        Paul, we're not gonna have some\n                        Cherokee medicine man in here\n                        whoopin' and hollerin' and shaking\n                        his dick, are we?\n\n                                  PAUL\n                        Well, actually--\n\n                                  TOOT\n                        Still prayin', prayin', gettin'\n                        right with Jesus...\n\n                                  HARRY\n                        Do it quietly, you old gink!\n\n              Harry slaps Toot upside the head to shut him up.\n\n                                  PAUL\n                        As I was saying, I don't believe\n                        they actually shake their dicks,\n                        Harry. Be that as it may, Mr.\n                        Bitterbuck is a Christian, so we\n                        got Reverend Schuster coming in.\n\n                                  DEAN\n                        Oh, he's good. Fast, too. Doesn't\n                        get 'em worked up.\n\n                                  PAUL\n                        On your feet, Toot. You've prayed\n                        enough for one day.\n\n                                  TOOT\n                        Gettin' to my feet, walkin' again,\n                        walkin' on the Green Mile...\n\n              EXECUTION CHAMBER\n\n              They enter. Brutal is waiting for them, gun drawn. Percy\n              peers out from behind the partition wall from the switch room.\n\n                                  PERCY\n                        What do I do?\n\n                                  PAUL\n                        Watch and learn.\n\n              Paul motions Percy behind the wall. Percy sighs, takes his\n              spot next to Jack Van Hay, peers through the wire mesh as\n              Toot plops into Old Sparky, wriggling his skinny ass to get\n              comfy.\n\n                                  TOOT\n                        Sittin' down, sittin' down, takin'\n                        a seat in Old Sparky's lap...\n\n              Paul and Dean kneel to apply the ankle clamps. Brutal steps\n              in from the side, pressing down on the condemned man's left\n              arm to keep him in place until the ankle clamps are secure.\n              Harry moves in from the other side, securing the right arm\n              clamp.\n\n                                  TOOT\n                        Gettin' clamped, gettin' clamped,\n                        gettin'--ow, shit, watch the skin!\n\n              Paul signals \"ankles secure.\" Brutal holsters his pistol,\n              applies the final clamp to the left arm.\n\n                                  BRUTAL\n                        Roll on one.\n\n              BEHIND THE PARTITION\n\n              Van Hay mimes turning the generator knob up, whispering:\n\n                                  VAN HAY\n                        \"Roll on one\" means I turn the\n                        generator up full. You'll see the\n                        lights go brighter in half the\n                        prison...\n\n              RESUME MAIN CHAMBER\n\n              as Brutal steps before the \"condemned\" and pronounces:\n\n                                  BRUTAL\n                        Arlen Bitterbuck, you have been\n                        condemned to die by a jury of your\n                        peers, sentence imposed by a judge\n                        in good standing in this state.\n\n                        Do you have anything to say before\n                        the sentence is carried out?\n\n                                  TOOT\n                               (gleefully)\n                        Yeah! I want a fried chicken\n                        dinner with gravy on the taters,\n                        I want to shit in your hat, and I\n                        got to have Mae West sit on my\n                        face, because I am one horny\n                        motherfucker!\n\n              Brutal tries to hold on, but it's impossible--he cracks up.\n              Everybody falls apart, howling helplessly with laughter. Even\n              Jack Van Hay is guffawing behind his partition.\n\n              Only Paul is reining it in--he's a little too pissed to go\n              with it. He waits until the laughing fit starts to pass, then:\n\n                                  PAUL\n                        Shut up, Brutal. That goes for\n                        everybody. I want quiet in here.\n                               (turns)\n                        Toot, another remark like that,\n                        I'll have Van Hay roll on two for\n                        real.\n\n                                  BRUTAL\n                               (beat, gently)\n                        It was pretty funny.\n\n                                  PAUL\n                        That's why I don't like it.\n                        Tomorrow night we're doing this\n                        for real. I don't want somebody\n                        remembering a stupid joke like\n                        that and getting going again.\n                               (off their looks)\n                        Ever try not laughing in church\n                        once something funny gets stuck in\n                        your head. Same goddamn thing.\n\n                                  BRUTAL\n                        Sorry, Paul. You're right. Let's\n                        keep going. Harry...\n\n              Harry takes a black mask and snugs it down over Toot's head,\n              leaving only the crown of his head exposed. Brutal takes a\n              large sponge, dips it in a steel bucket, mimes soaking it...\n\n              BEHIND THE PARTITION\n\n                                  PERCY\n                        What's with the sponge?\n\n                                  VAN HAY\n                        You soak it in brine, get it good\n                        and wet. Conducts the electricity\n                        directly to the brain, fast like\n                        a bullet. You don't ever want to\n                        throw the switch on a man without\n                        that.\n\n              RESUME MAIN CHAMBER\n\n              as the sponge is placed atop Toot's head. Harry now lowers\n              the steel cap and Brutal secures the straps.\n\n                                  BRUTAL\n                        Arlen Bitterbuck, electricity\n                        shall now be passed through your\n                        body until you are dead, in\n                        accordance with the state law. God\n                        have mercy on your soul.\n                               (to Van Hay)\n                        Roll on two.\n\n              BEHIND THE PARTITION\n\n              Van Hay mimes flipping the switch, looks to Percy:\n\n                                  VAN HAY\n                        And that's that.\n\n              RESUME MAIN CHAMBER\n\n              Toot can't resist--he starts bucking and flailing:\n\n                                  TOOT\n                        Now I'm fryin'! Fryin'! Geeaaah!\n                        Fryin' like a done tom turkey!\n\n              Paul rolls his eyes at Brutal. Brutal shifts his gaze past\n              him and nods--look behind you.\n\n                                  BRUTAL\n                        One of the witnesses showed up a\n                        day early.\n\n              Paul turns. Sitting on the door sill, watching them with\n              beady eyes, is the mouse. Paul turns back, addresses the room:\n\n                                  PAUL\n                        All right, let's go again and do\n                        it right this time! Get that idiot\n                        out of the chair...\n\n              HIGH WIDE ANGLE OF EXECUTION CHAMBER\n\n              Brutal and Harry start undoing Toot's clamps. Everybody\n              relaxes, drifting from their positions...\n\n                                                       DISSOLVE TO:\n\n              SAME ANGLE AS ABOVE - NEXT NIGHT\n\n              ...and the room is now quietly filling up with WITNESSES\n              trickling in. People speak in whispers, if at all.\n\n              INT. BITTERBUCK'S CELL - NIGHT\n\n              Bitterbuck, the top of his head now shaved, is speaking\n              quietly as Paul listens:\n\n                                  BITTERBUCK\n                        You think if a man sincerely\n                        repents on what he done wrong, he\n                        might get to go back to the time\n                        that was happiest for him and live\n                        there forever? Could that be what\n                        heaven is like?\n\n              Paul doesn't think so--but that's not what Bitterbuck needs\n              to hear, so the lie comes easy:\n\n                                  PAUL\n                        I just about believe that very\n                        thing.\n\n              Pause. Bitterbuck smiles.\n\n                                  BITTERBUCK\n                        Had me a young wife when I was\n                        eighteen. Spent our first summer\n                        in the mountains. Made love every\n                        night. She'd just lie there after,\n                        bare-breasted in the firelight,\n                        and we'd talk sometimes till the\n                        sun come up.\n                               (beat)\n                        That was my best time.\n\n              Brutal appears at the door, checks his pocketwatch, nods to\n              Paul. Bitterbuck takes a deep breath, getting himself ready.\n\n                                  PAUL\n                        It'll be fine. You'll do fine.\n\n              INT. EXECUTION CHAMBER - NIGHT\n\n              THE SPONGE is pulled sopping wet from the bucket of brine,\n              dripping a trail of water across the floor. Brutal places it\n              atop Bitterbuck's head. Water courses down the sides of the\n              condemned man's mask and neck, pooling on the floor.\n\n              The cap is lowered, the straps secured. All we hear now is\n              the sound of Bitterbuck's BREATHING growing louder and faster\n              under the mask...until, softly:\n\n                                  BRUTAL\n                        Roll on two.\n\n              WHAM! The switch is thrown. Bitterbuck surges forward against\n              the straps, riding the powerful current.\n\n              Some witnesses turn away. Paul and Brutal maintain grim eye\n              contact with each other, waiting.\n\n              Behind the partition, Percy watches through the mesh with\n              gleaming eyes, wishing he could see better.\n\n              Van Hay kills the current. Bitterbuck goes limp. A DOCTOR\n              steps forward, checks for a heartbeat, shakes his head.\n\n                                  BRUTAL\n                        Again.\n\n              The switch is thrown a second time. Bitterbuck surges forward\n              again, riding the current all the way...\n\n                                                       CUT TO:\n\n              INT. E BLOCK ACCESS TUNNEL - NIGHT\n\n              Bitterbuck's dead face stares up at us from a gurney. A hand\n              reaches down, gives his cheek a squeeze. TILT UP to:\n\n                                  PERCY\n                        Adios, Chief. Drop us a card from\n                        hell, let us know if it's hot\n                        enough.\n\n              Brutal knocks Percy's hand away, shoves him aside.\n\n                                  BRUTAL\n                        He's paid what he's owed. He's\n                        square with the house again, so\n                        keep your goddamn hands off him.\n\n              He draws the sheet over Bitterbuck's face, wheels the gurney\n              down the tunnel. Percy throws a look to Paul.\n\n                                  PERCY\n                        What's up his ass?\n\n                                  PAUL\n                        You, Percy. Always you.\n\n              Paul brushes past him, but:\n\n                                  PERCY\n                        You gotta hate the new boy? That\n                        the way it is around here?\n\n                                  PAUL\n                               (turns back)\n                        Why not just move on? Go to Briar\n                        Ridge.\n                               (off his look)\n                        Yeah, I know about it. Sounds like\n                        a good job.\n\n                                  PERCY\n                        I might take it, too. Soon as you\n                        put me out front.\n\n              Paul cocks his head--excuse me?\n\n                                  PERCY\n                        You heard me. I want Brutal's spot\n                        for the next execution.\n\n                                  PAUL\n                               (beat)\n                        What's with you? Seeing a man die\n                        isn't enough? You gotta be close\n                        enough to smell his nuts cook?\n\n                                  PERCY\n                        I wanna be out front, is all. Just\n                        one time. Then you'll be rid of me.\n\n                                  PAUL\n                        If I say no?\n\n                                  PERCY\n                        I might just stick around for\n                        good, make me a career of this.\n\n              Paul just shakes his head in wonder and walks away.\n\n                                                       FADE TO:\n\n              INT. COFFEY'S CELL - DAY\n\n              Coffey's lying on his bunk, weeping quiet tears. He stirs at\n              the sound of GIGGLING. He sits up, peers curiously through\n              the bars. Softly:\n\n                                  COFFEY\n                        Del?\n\n              AT THE GUARD STATION\n\n              Paul glances up from writing in the daily log. Silence now.\n              He goes back to writing--and the GIGGLING comes again.\n\n                                  PAUL\n                        Delacroix? That you?\n\n              No answer. Just more giggling. Paul rises, walks down the\n              Mile to Delacroix's cell--and stops, staring in through the\n              bars.\n\n              PAUL'S INNER OFFICE\n\n              Brutal and Dean are having lunch. Paul pokes his head in.\n\n                                  PAUL\n                        You are not gonna believe this.\n\n              RESUME E BLOCK\n\n              The men follow Paul onto the Mile. By now, Del is CACKLING\n              WILDLY in his cell. Brutal shoots Paul a look--has he gone\n              insane? Paul gestures \"see for yourself.\"\n\n              They arrive at the bars...and find the mouse sitting on Del's\n              shoulder. Del looks up, giggling like a kid at Christmas.\n\n                                  DEL\n                        Look! I done tame me dat mouse!\n\n                                  PAUL\n                        We see that.\n\n                                  DEL\n                        Watch dis! Watch what he do!\n\n              He stretches out his left arm. The mouse crawls over the top\n              of his head, scampers along his arm to the wrist, turns\n              around and scampers back. The guards just stand there,\n              staring.\n\n                                  DEL\n                        Ain't he sumpthin now? Ain't Mr.\n                        Jingles smart?\n\n                                  PAUL\n                        Mr. Jingles?\n\n                                  DEL\n                        Dat his name. He whisper it in my\n                        ear. Cap'n, can I have a box for\n                        my mouse so he can sleep in here\n                        wi' me?\n\n                                  PAUL\n                        I notice your English gets better\n                        when you want something.\n\n                                  DEL\n                        Wanna see what else he can do?\n                        Watch, watch, watch...\n\n              He puts the mouse on the floor, grabs a small wooden spool.\n              The mouse sees it, poises like a man getting ready for a race.\n\n                                  DEL\n                        We play fetch, Mr. Jingles? We\n                        play fetch?\n\n              He tosses the spool across the floor, bounces it against the\n              wall. The mouse goes after it like a dog after a stick--and\n              proceeds to push it back to the bunk, rolling it with its\n              front paws all the way to Delacroix's feet.\n\n              By now, the guard's jaws are hanging open. Paul's got a funny\n              little chill running up his spine.\n\n                                  DEL\n                        He fetch it ever' time. Smart as\n                        hell, ain't he? We do da trick\n                        again, watch, watch, watch...\n\n              Again he throws the spool. Again the mouse goes after it,\n              starts rolling it back. Del howls with laughter, claps his\n              hands like a kid. Brutal murmurs to the others:\n\n                                  BRUTAL\n                        Who's training who here?\n\n                                  COFFEY\n                        That's some smart mouse, Del. Like\n                        he's a circus mouse or something.\n\n                                  DEL\n                        A circus mouse! Dat jus' what he\n                        is, too! A circus mouse! I get\n                        outta here, he make me rich, see\n                        if he don't!\n\n              He picks up the spool again, makes a drumroll sound, tosses\n              it. The mouse does its thing, rolling the spool back...\n\n              ...as Percy enters the scene. Del catches sight of him and\n              scoops up his mouse, drawing fearfully back on his bunk. He\n              tries to hide Mr. Jingles in his hands--but the mouse\n              wriggles from his grasp and scampers up on top of his head,\n              where he regards Percy with mistrustful, beady mouse eyes.\n\n                                  PERCY\n                        Well, well. Looks like you found\n                        yourself a new friend, Eddie.\n\n              Del tries to offer some defiance--but all he can manage is:\n\n                                  DEL\n                        Don' hurt him, 'kay? 'kay?\n\n              Percy shrugs as if to say \"no skin off me\", looks to Paul.\n\n                                  PERCY\n                        That the one I chased?\n\n                                  PAUL\n                               (level)\n                        Yes, that's the one. Only Del says\n                        his name is Mr. Jingles.\n\n                                  PERCY\n                        Is that so?\n\n              Paul trades a look with the others, everybody wondering just\n              what the hell's going through Percy's mind.\n\n                                  PAUL\n                        Del was just asking for a box. He\n                        thinks the mouse will sleep in it,\n                        I guess. That he might keep it for\n                        a pet. What do you think?\n\n                                  PERCY\n                        I think it'll shit up his nose\n                        some night and run away, but I\n                        guess that's Del's lookout.\n                               (beat)\n                        We oughtta find a cigar box. Get\n                        some cotton batting from he\n                        dispensary to line it with. That\n                        should do real nice.\n\n              Percy walks away, leaving them dumbstruck. Paul turns to the\n              others. Of all the things they've seen in the last few\n              minutes, Percy being nice is the most amazing of all.\n\n                                  PAUL\n                        Man said get a cigar box.\n\n                                                       CUT TO:\n\n              INT. PRISON ADMINISTRATION BUILDING - DAY\n\n              Paul comes up the stairs to the warden's office...\n\n              INT. WARDEN MOORES' OFFICE - DAY\n\n              ...and enters to find Hal staring out the window.\n\n                                  PAUL\n                        Hal? You wanted to see me?\n\n                                  HAL\n                        Yeah. Paul. Close the door.\n\n              Hal's speech is halting, his thoughts disjointed and slow:\n\n                                  HAL\n                        Uh. So you know. You got a new\n                        prisoner coming in tomorrow.\n                        William Wharton. Young kid. Wild\n                        as hell, judging from this...\n\n              He picks up the report, trying to focus his thoughts:\n\n                                  HAL\n                        ...been rambling all over the\n                        state last few years, causing all\n                        kinds of trouble. Finally hit big\n                        time. Killed three people in a\n                        holdup, including a pregnant\n                        woman. Got \"Billy the Kid\"\n                        tattooed on his left arm...bad\n                        news all around...\n\n              He trails off, no longer able to focus on the words. Paul is\n              shocked to see tears spill silently down his cheeks.\n\n                                  PAUL\n                        Hal?\n\n                                  HAL\n                        It's a tumor, Paul. A brain tumor.\n\n              Paul doesn't know what to say. Hal looks at him.\n\n                                  HAL\n                        They got X-ray pictures of it.\n                        It's the size of a lemon, they\n                        said, and way down deep inside\n                        where they can't operate. They say\n                        she'll be dead by Christmas. I\n                        haven't told her. I can't think\n                        how. For the life of me, Paul, I\n                        can't think how to tell my wife\n                        she's going to die.\n\n              Hal Moores, one of the toughest and steadiest men you'd ever\n              meets, starts to cry. He dissolves into great big gasping\n              sobs, losing all control.\n\n                                                       CUT TO:\n\n              INT. PAUL'S BEDROOM - NIGHT\n\n              Paul lies awake, watching Jan sleep. He looks troubled--not\n              to mention feverish. It occurs to him how badly he has to\n              pee. He sits up, clutching at a queasy stab of pain in his\n              groin...\n\n              LIVING ROOM STAIRS\n\n              ...and comes hurrying down the steps, clutching himself...\n\n              EXT. HOUSE - NIGHT\n\n              ...and he's moving even faster as he exits the kitchen,\n              racing for the outhouse. He realizes he's not going to make\n              it, stops to piss near the woodpile at the corner of the\n              house...\n\n              ...and as he does, he's hit with the most stunning pain of\n              his life. He buckles to his knees--it's only his flailing\n              hand against the woodpile that prevents him from going face-\n              first into his own piss. He crams his other hand to his mouth\n              in an enormous effort not to scream and wake his wife.\n\n              He manages to ride it out until his bladder empties. He falls\n              onto his side, rolls over on the grass, and stares up at the\n              sky with both hands pressed to his groin.\n\n                                  PAUL\n                        ...oh God...oh God...\n\n                                                       FADE TO BLACK\n\n              IN BLACKNESS, A TITLE CARD APPEARS:\n\n                                    \"Coffey's Hands\"\n\n                                                       CUT TO:\n\n              INT. PAUL'S KITCHEN - MORNING\n\n              Paul looks feverish and clammy as he buttons up his uniform\n              jacket. Jan is packing his lunch, throwing him looks, knowing\n              how sick he is.\n\n                                  PAUL\n                        I'm going.\n\n                                  JAN\n                        What?\n\n                                  PAUL\n                        To the doctor. I'm going.\n                               (off her look)\n                        Today. Just as soon as we get the\n                        new inmate squares away.\n\n                                  JAN\n                        That bad?\n\n                                  PAUL\n                        Oh yeah.\n\n              She hands him his brown-bagged lunch, kisses his face.\n\n                                                       CUT TO:\n\n              INT. BRIAR RIDGE MENTAL HOSPITAL - MORNING\n\n              We see a tattoo: \"Billy the Kid.\" TILT UP to WILLIAM WHARTON\n              staring out the window, wearing a hospital gown, his face\n              utterly blank. He looks heavily medicated.\n\n              Harry, Dean, and Percy enter. Billy doesn't react, just keeps\n              staring out. Harry waves his fingers in Billy's face.\n\n                                  HARRY\n                        Boy's doped to the gills. Dean,\n                        hand me them clothes...\n\n              Dean relays some folded prison clothes to Harry.\n\n                                  HARRY\n                        William Wharton! Hey! I'm talking\n                        to you! Put these clothes on!\n\n              Billy turns with a vacant look, takes the clothes. He fumbles\n              with the shirt, drops the pants. Harry and Dean sigh.\n\n              They strip Billy's hospital gown off and proceed to put the\n              shirt on him, guiding his limp arms through the sleeves.\n\n                                  PERCY\n                        Hellraiser, huh? Looks more like\n                        a limp noodle to me. Hey! Hey, you!\n\n              Billy looks up, meets Percy's eyes.\n\n                                  PERCY\n                        You been declared competent! Know\n                        what that means? Mean's you're\n                        gonna ride the lightning, son!\n\n              Percy does a quick impression of a man jittering and jerking\n              in the electric chair.\n\n                                  PERCY\n                        Bzzzzzzzzt-zap! Just like that!\n                        How's it feel to know you're gonna\n                        die with your knees bent?\n\n                                  DEAN\n                        C'mon, Percy, give us a hand.\n\n              Laughing, Percy picks up the pants. They proceed to help\n              Billy into them one leg at a time...\n\n                                                       CUT TO:\n\n              INT. E BLOCK TOILET - DAY\n\n              Paul is trying to piss. Except for a few drops hitting the\n              bowl, excruciating pain seems to be the only result. He gives\n              up, grabs a towel, wipes the sweat from his feverish face...\n\n              INT. E BLOCK - DAY\n\n              ...and steps gingerly from the toilet. Del's watching.\n\n                                  DEL\n                        Don' look so good, boss. Look like\n                        you runnin' you a fever.\n\n              Paul shoots him a baleful look--no kidding. Another voice\n              calls softly from further down the Mile:\n\n                                  COFFEY (O.S.)\n                        Boss Edgecomb? Needs ta see you\n                        down here, boss.\n\n                                  PAUL\n                        Got things to tend to just now,\n                        John Coffey. You be still in your\n                        cell now, y'hear?\n\n              Coffey falls silent. Paul goes to the entrance door and peers\n              through the viewing slot, anxious to have this over with...\n\n              EXT. COLD MOUNTAIN PENITENTIARY - DAY\n\n              The prison truck appears, swaying along the rutted road...\n\n              IN THE TRUCK\n\n              ...while Billy Wharton stares at nothing, drool dripping from\n              his slack mouth in long strings.\n\n              INT. E BLOCK - DAY\n\n              Paul watches the truck pull in. He draws away from the slot,\n              proceeds toward the empty cell which used to be\n              Bitterbuck's...\n\n              ANGLE ON TRUCK\n\n              The rear doors are swung open. Harry emerges. Dean and Percy\n              are guiding Billy by the arm, helping him down...\n\n              INSIDE E BLOCK\n\n              Paul waits at the empty cell. ANGLE PANS TIGHT to Coffey at\n              his bars, eyes widening in a blossoming of some nameless fear\n              or dread. Something bad's coming. A whisper:\n\n                                  COFFEY\n                        Careful.\n\n              OUTSIDE E BLOCK\n\n              Billy is brought to the door. Dean pulls his keys, starts to\n              unlock it. We PUSH IN on Billy's face, where the tiniest\n              trace of a smile is starting to grow...\n\n              INSIDE E BLOCK\n\n              ...and Coffey's unease grows with it. he presses his face to\n              the bars, his whispering becoming more urgent:\n\n                                  COFFEY\n                        Careful. Careful.\n\n              Paul hears him, glances back with a puzzled look. Coffey's\n              gaze is directed at the door, which is being unlocked...\n\n              THE DOOR\n\n              ...and opened. In that moment, the slack look on Billy's face\n              gives way to a wild grin. A CRAZED SCREECH leaps from his\n              throat, a cross between a rebel yell and a dog being\n              tortured, freezing everybody's blood in their veins--\n\n                                  BILLY\n                        Yeeeeeeehaaaawwwwwwrooooo!\n\n              --and he drops his wrist-chain down over Dean's head, jerks\n              it tight, begins to strangle him. Dean lurches forward, Billy\n              riding/propelling him through the door onto the Mile.\n\n              Percy stands frozen in the doorway, stunned. Harry shoves him\n              aside and jumps on Billy from behind, trying to get him off\n              Dean. Dean is choking, turning purple.\n\n              Paul rushes from the cell to join the fray. Billy whirls,\n              delivering a stunning kick to Paul's groin. Paul's bladder\n              pain goes nuclear--he falls back in agony, clutching himself\n              and sucking air through his teeth, unable even to scream.\n\n              Billy rams an elbow into Harry's face, knocks him sprawling\n              on the desk, screaming and laughing and howling all the while:\n\n                                  BILLY\n                        WHOOOEE, BOYS! AIN'T THIS A PARTY,\n                        NOW? IS IT, OR WHAT?\n\n              Paul forces himself to his feet, pulls his revolver, draws\n              down on Billy...\n\n                                  PAUL\n                        LET HIM GO!\n\n              ...but Billy jerks Dean around, using him as a shield...\n\n                                  BILLY\n                        G'WAN, SHOOT! SEE WHO YA HIT!\n\n              Dean is choking, dying. Paul is shifting his aim, trying for\n              a clear shot, not getting one. Percy's still just inside the\n              doorway, pressed against the wall with fear...\n\n                                  PAUL\n                        HIT HIM, PERCY! GODDAMN IT, HIT\n                        HIM!\n\n                                  BILLY\n                        C'MON, PERCY, HIT ME! HIT ME, YOU\n                        LIMP NOODLE, HIT ME! YEEHAWWW!\n\n              ...and suddenly a hand comes in, grabs the hickory stick out\n              of Percy's grasp, raises it high--\n\n              --it's Brutal coming through the door. He swings the baton\n              and lands an awesome blow to Billy's head--THUMP! The force\n              of it spins Billy off his feet and slams him flat on his back.\n\n              Dean crawls away, gulping ragged breaths of air. Amazingly,\n              Billy's still conscious--he looks up at Brutal and laughs:\n\n                                  BILLY\n                        Big fucker. Snuck up on me. No\n                        fair.\n\n              Still laughing, he makes another grab at Dean. Brutal whacks\n              him again, turning his lights out for good. Brutal drops to\n              Dean's side, helping him hack air back into his lungs:\n\n                                  BRUTAL\n                        Breathe...breathe...that's it...\n\n              Everybody's reining in their adrenaline. Paul glares at Harry.\n\n                                  HARRY\n                        We thought he was doped.\n                               (to Percy)\n                        Didn't we? Didn't we all of us\n                        think he was doped?\n\n              Percy nods, still numb. Paul is furious:\n\n                                  PAUL\n                        You didn't ask? I guess that's not\n                        a mistake you'll be need to make\n                        again anytime soon, is it?\n\n              Harry shakes his head miserably. Paul grabs Billy by the feet.\n\n                                  PAUL\n                        Grab his arms! You too, Percy!\n                               (off Percy's\n                                hesitation)\n                        Percy, goddamn it, get your feet\n                        out of cement and help us out here!\n\n              Percy finally unfreezes. The three of them hoist Billy up in\n              a dead-lift, get him in his cell, toss him on the cot. They\n              step out, slam the door, lock it. Paul looks to Harry and\n              Brutal.\n\n                                  PAUL\n                        Get Dean looked at right away,\n                        make sure he's all right.\n\n                        Percy, you go make a report to the\n                        warden for me. Start off by saying\n                        the situation is under control--\n                        it's not a story, he won't\n                        appreciate you drawing out the\n                        suspense.\n\n                                  BRUTAL\n                        What about you? You look about\n                        ready to collapse.\n\n                                  PAUL\n                        I've got the Mile till you all get\n                        back. Go on now.\n\n              They all exit. As soon as he's alone, Paul gives in to the\n              pain, holding his crotch and sinking to his knees with a\n              moan. It's so bad he actually lays down on the Mile, face\n              pressed against the cool linoleum, wishing he were dead. A\n              stretch of silence...and then:\n\n                                  COFFEY (O.S.)\n                        Boss? Needs ta see ya down here.\n\n                                  PAUL\n                        This is not a good time, John\n                        Coffey. Not a good time at all.\n\n                                  COFFEY (O.S.)\n                        But I needs ta see ya, boss. I\n                        needs ta talk t'ya.\n\n              Paul sighs. Things couldn't get much worse than this. He\n              rises with a supreme effort, walks painfully down the Mile...\n\n              COFFEY'S CELL\n\n              ...and finds Coffey waiting at his bars.\n\n                                  COFFEY\n                        Closer.\n\n                                  PAUL\n                        I'm alone here right now, John.\n                        Figure this is close enough.\n\n                                  COFFEY\n                        Boss, please. I got to whisper in\n                        your ear.\n\n              Paul blinks. Maybe it's the fever clouding his brain, or\n              maybe...hell, is this what being hypnotized is like? He tries\n              to shake the sensation off, comes a little closer.\n\n                                  DEL\n                        Boss? You know you not s'pose to\n                        do dat.\n\n                                  PAUL\n                        Mind your business, Del. What do\n                        you want, John Coffey?\n\n                                  COFFEY\n                        Just to help.\n\n              His hand shoots out, grabs Paul by the collar, jerks him\n              close. Paul makes a panic-grab for his revolver...\n\n              ...but Coffey lays his free hand atop Paul's, eases his grip\n              from the gun--no need for that. Coffey's hand then drifts\n              slowly down, easing to Paul's crotch...\n\n                                  PAUL\n                               (stunned, frozen)\n                        What are you...doing?\n\n              ...and something goes WHUMP through Paul's body. He arches\n              back with his mouth agape and arms outstretched as a rush of\n              energy seems to pass from Paul through Coffey's hand...\n\n              ...and then it's over. Paul comes back to the real world,\n              weak against the bars, realizes Del is hollering in his cell:\n\n                                  DEL\n                        HELP! JOHN COFFEY'S KILLING BOSS\n                        EDGECOMB! HELP!\n\n                                  PAUL\n                        Del, Chrissake, settle down, I'm\n                        fine...\n\n              It dawns on him that he really is fine. Fever's gone. So is\n              the pain in his groin. John Coffey, though, seems to be\n              having trouble. He sits down on his bunk, bends forward,\n              gagging like a man with a chicken bone caught in his throat.\n\n                                  PAUL\n                        John? John, what's wrong?\n\n              Paul fumbles his keys to the lock, unsure if he should open\n              the door, watching the big man's contortions grow stronger\n              like a cat trying to cough up a hairball...\n\n              ...and then comes an unpleasant, gagging/retching sound as\n              Coffey's lips draw back from his teeth in a kind of godawful\n              sneer...and he exhales a cloud of what look like tiny black\n              insects. They swirl furiously in front of his face, turn\n              white...and disappear. Paul just stares, stunned. Softly:\n\n                                  PAUL\n                        What did you do, big boy? What did\n                        you do to me?\n\n                                  COFFEY\n                        I helped it. Didn't I help it?\n\n                                  PAUL\n                        Yes, but...how?\n\n              Coffey shrugs--it's something that just is.\n\n                                  COFFEY\n                        Just took it back, is all. Awful\n                        tired now, boss. Dog tired.\n\n              He rolls onto his bunk, faces the wall. Paul just stares at\n              him, stunned. He turns and walks up the Mile, his stiffness\n              and pain now gone. Del watches him go by, also stunned:\n\n                                  DEL\n                        What dat man do to you? He throw\n                        some gris-gris on you?\n                               (off Paul's look)\n                        You look diff'int! Even walk\n                        diff'int. Like y'all better!\n\n                                  PAUL\n                        You're imagining thing. Lie down,\n                        Del. Get you some rest.\n\n              Paul continues up the Mile...\n\n              E BLOCK TOILET\n\n              ...and steps back into the toilet. Not trusting this\n              situation for even a moment, Paul opens his fly, takes a deep\n              breath to prepare himself for the pain, starts to pee...\n\n              ...and we hear a healthy stream of water hitting the bowl.\n              The look on Paul's face says it all--blessed relief.\n\n                                                       CUT TO:\n\n              INT. PAUL'S HOUSE - DUSK\n\n              Paul comes home from work, still looking numb about the whole\n              thing. He drifts to the kitchen door. Jan's at the counter,\n              slicing vegetables for dinner. She glances at him.\n\n                                  JAN\n                        Hi, honey. How are you feeling?\n\n                                  PAUL\n                        Um...not too bad.\n\n              She turns back. Paul's eyes drift down to admire her ass.\n\n                                  JAN\n                        What did the doctor say?\n\n              No response. He's too busy staring. She turns again--he\n              glances hastily up.\n\n                                  PAUL\n                        Oh, you know doctors. Gobble-de-\n                        gook mostly.\n\n              She turns back, keeps working. He crosses the room, eyeing\n              her ass all the way...and surprised her by pressing up\n              against her from behind, running his hands along her hips.\n\n                                  JAN\n                        Paul? What are you doing?\n\n              He starts laying kisses on the back of her neck, giving her\n              pleasant shivers, murmuring:\n\n                                  PAUL\n                        What's it feel like?\n\n                                  JAN\n                        I know what it feels like...it\n                        feels great...but...Paul...\n\n              He's getting her breathless. She turns into his arms and they\n              get into some passionate kissing. It's not too long before\n              they're frantically peeling each other's clothes off...\n\n              INT. BEDROOM - NIGHT\n\n              ...and we find them having a wild tumble in the sheets, both\n              moaning and groaning, sweating and panting. She pushes him\n              flat on the bed, pauses to catch her breath...\n\n                                  JAN\n                        Those must've been some pills.\n\n              ...and they keep going, rutting like crazed weasels...\n\n              EXT. HOUSE - NIGHT\n\n              ...as their moans go drifting into the night...\n\n                                                       FADE TO:\n\n              SAME ANGLE AS ABOVE - DAWN\n\n              ...and they're still moaning up there as the sun creeps up.\n\n              INT. BEDROOM - MORNING\n\n              Jan falls back, exhausted after the latest go-round. She\n              catches her breath, looks over at Paul, and finally:\n\n                                  JAN\n                        Paul? Not that I'm complaining.\n                        But we haven't gone four times in\n                        one night since we were nineteen.\n                               (off his look)\n                        You wanna tell me just what the\n                        hell's going on?\n\n                                  PAUL\n                        Well...thing is...I never actually\n                        got to the doctor yesterday...\n\n              She gives him a look--oh?\n\n                                                       CUT TO:\n\n              INT. LIVING ROOM - MORNING\n\n              Paul is on the phone:\n\n                                  PAUL\n                        Brutal? Listen...I'm thinking of\n                        taking the morning off sick. You\n                        cover the fort for me?\n                               (beat)\n                        That's swell. Thanks. Yeah, I'm\n                        sure I'll feel better. Okay.\n\n              He hangs up, turns to Jan.\n\n                                  JAN\n                        You sure you ought to do this?\n\n                                  PAUL\n                        I'm not sure what I'm sure of.\n\n                                                       CUT TO:\n\n              EXT. ROAD TO TEFTON - DAY\n\n              Paul's model T comes putt-putting up the road past a sign:\n              \"Trapingus County Welcomes You.\"\n\n              EXT. HOUSE IN TEFTON - BACK PORCH - DAY\n\n              BURT HAMMERSMITH, public defender for Trapingus County, sits\n              with a cold soda and a magazine, watching his TWO CHILDREN\n              playing on a swing at the far end of the backyard. The screen\n              door opens and CYNTHIA HAMMERSMITH ushers Paul out.\n\n                                  CYNTHIA\n                        I offer you a cold drink?\n\n                                  PAUL\n                        Yes, ma'am, a cold drink would be\n                        fine. Thank you.\n\n              She goes back inside. Burt rises.\n\n                                  PAUL\n                        Mr. Hammersmith. Your office said\n                        I'd find you at home today. I hope\n                        I'm not troubling you.\n\n                                  BURT\n                        That depends, Mr.--?\n\n                                  PAUL\n                        Paul Edgecomb. I'm the E Block\n                        superintendant at Cold Mountain.\n\n                                  BURT\n                        The Green Mile. I've heard of it.\n                        Lost a few clients your way.\n\n                                  PAUL\n                        That's why I'm here. I'd like to\n                        ask you about one of them.\n\n              Burt settles back down, motions \"please sit\".\n\n                                  BURT\n                        Which client? Now you got my\n                        curiosity aroused.\n\n                                  PAUL\n                        John Coffey.\n\n                                  BURT\n                        Ah, Coffey. He causing you\n                        problems?\n\n                                  PAUL\n                        No, can't say he is. He doesn't\n                        like the dark. He cries on\n                        occasion. Other than that...\n\n                                  BURT\n                        Cries, does he? Well, he's got a\n                        lot to cry about, I'd say. You\n                        know what he did.\n\n                                  PAUL\n                               (nods)\n                        I read the court transcripts.\n\n              Cynthia reappears, hands Paul a cold root beer.\n\n                                  PAUL\n                        Thank you, Missus.\n\n                                  CYNTHIA\n                        My pleasure. Kids! Lunch is about\n                        ready! Y'all come on up!\n\n              She goes back inside, but the kids aren't quite able to tear\n              themselves away from their play.\n\n                                  BURT\n                        What exactly are you trying to\n                        find out? Satisfy my curiosity,\n                        I'll see if I can satisfy yours.\n\n                                  PAUL\n                        I've wondered if he ever did\n                        anything like that before.\n\n                                  BURT\n                        Why? Has he said anything?\n\n                                  PAUL\n                        No. But a man who does a thing\n                        like that has often developed a\n                        taste for it over time. Occurred\n                        to me it might be easy enough to\n                        follow his backtrail and find out.\n                        A man his size, and colored to\n                        boot, can't be that hard to trace.\n\n                                  BURT\n                        You'd think so, but you'd be\n                        wrong. Believe me, we tried. It's\n                        like he dropped out of the sky.\n\n                                  PAUL\n                        How do you explain that?\n\n                                  BURT\n                        We're in a Depression. A third of\n                        the country's out of work.\n\n                        People are drifting by the\n                        thousands, looking for work,\n                        looking for that greener grass.\n                        Even a giant like Coffey wouldn't\n                        get noticed everywhere he goes...\n                        not until he kills a couple of\n                        little girls.\n\n                                  PAUL\n                        He's...strange, I admit. But there\n                        doesn't seem to be any real\n                        violence in him. I know violent\n                        men, Mr. Hammersmith. I deal with\n                        'em day in and day out.\n\n              Burt smiles, realizing:\n\n                                  BURT\n                        You didn't come up here to ask me\n                        whether he might have killed\n                        before. You came up here to see if\n                        I think he did it at all. That's\n                        it, isn't it?\n\n                                  PAUL\n                        Do you?\n\n                                  BURT\n                        One seldom sees a less ambiguous\n                        case. He was found with the\n                        victims in his arms. Blurted out\n                        a confession right then and there.\n\n                                  PAUL\n                        Yet you defended him.\n\n                                  BURT\n                        Everyone is entitled to a defense.\n\n              Cynthia hollers from an open window:\n\n                                  CYNTHIA\n                        Kids! Lunch!\n\n                                  BURT\n                        Y'all listen to your Momma, now!\n\n              The kids start this way. Burt turns back to Paul.\n\n                                  BURT\n                        Tell you something. You listen\n                        close, too, because it might be\n                        something you need to know.\n\n                                  PAUL\n                        I'm listening.\n\n                                  BURT\n                        We had us a dog. No particular\n                        breed, but gentle. Ready to lick\n                        your hand or fetch a stick. Just\n                        a sweet mongrel, you know the kind.\n                               (Paul nods)\n                        In many way, a good mongrel dog is\n                        like you negro. You get to know\n                        it, and often you get to love it.\n                        It is of no particular use, but\n                        you keep it around because you\n                        think it loves you. If you're\n                        lucky, Mr. Edgecomb, you never\n                        have to find out any different. My\n                        wife and I were not so lucky.\n                        Caleb. Come here for a second.\n\n              The little boy comes to him, staring at his feet. Burt tires\n              to raise the boy's chin. The boy resists for a moment...\n\n                                  BURT\n                        Please, son.\n\n              ...and then his face comes around. He's horribly scarred on\n              that side, the eye missing.\n\n                                  BURT\n                        He has the one eye. I suppose he's\n                        lucky not to be blind. We get down\n                        on our knees and thank God for\n                        that much at least. Right Caleb?\n                               (the boy nods shyly)\n                        Okay, go on in now.\n\n              The boy races inside after his sister. Paul follows Burt's\n              gaze off toward the rear of the property, where an unoccupied\n              doghouse stands weathered and sad in the weeds.\n\n                                  BURT\n                        That dog attacked my boy for no\n                        reason. Just got it into his mind\n                        one day. Same with John Coffey. He\n                        was sorry afterwards, of that I\n                        have no doubt...but those little\n                        girls stayed raped and murdered\n                        nonetheless. Maybe he's never done\n                        it before--my dog never bit\n                        before, but I didn't concern\n                        myself with that. I went out there\n                        with my rifle and grabbed his\n                        collar and blew his brains out.\n\n                                  PAUL\n                        I'm sorry for your trouble.\n\n              Burt acknowledges the condolence with a gracious nod.\n\n                                  BURT\n                        I'm as enlightened as the next\n                        man, Mr. Edgecomb. I would not\n                        bring back slavery for all the tea\n                        in China. I believe we have to be\n                        humane and generous in our efforts\n                        to solve the race problem. But we\n                        have to remember that the negro\n                        will bite if he gets the chance,\n                        just like a mongrel dog will bite\n                        if it crosses its mind to do so.\n                               (beat)\n                        Is Coffey guilty? Yes, he is.\n                        Don't you doubt it, and don't you\n                        turn your back on him. You might\n                        get away with it once or even a\n                        hundred times...but in the end...\n\n              He raises his hand, making biting motions with his fingers.\n\n                                  BURT\n                        You understand?\n\n              Paul says nothing. Burt gazes out again. Softly:\n\n                                  BURT\n                        I'm gonna have to tear that old\n                        doghouse down one of these days.\n\n                                                       CUT TO:\n\n              INT. PAUL'S MODEL T - DAY\n\n              Paul drives back to Cold Mountain, his heart conflicted...\n\n              INT. E BLOCK - DAY\n\n              ...and he walks onto the Mile with a bundle wrapped in a dish\n              towel. Brutal glances up from the desk, sniffing the air.\n\n                                  PAUL\n                        No, it's not for you.\n\n              Paul continues down the Mile. Whatever he's carrying, the\n              smell of it brings Del to his bars. Even Mr.Jingles comes\n              skittering out of his cigar box, sniffing.\n\n                                  DEL\n                        Oh. Oh my.\n\n              Paul arrives at Coffey's cell. Coffey's on his bunk facing\n              the wall. His head comes around, drawn by the aroma. He sits\n              up, wipes the tears leaking from his eyes, looks at Paul.\n\n                                  COFFEY\n                        I'm smelling me some cornbread.\n\n              Paul speaks softly so the others can't hear:\n\n                                  PAUL\n                        It's from my missus. She wanted to\n                        thank you.\n\n              Coffey nods thoughtfully, absorbing this notion. Then:\n\n                                  COFFEY\n                        Thank me for what?\n\n                                  PAUL\n                        You know. For helping me.\n\n                                  COFFEY\n                        Helping you with what?\n\n              Paul motions discreetly to his crotch.\n\n                                  COFFEY\n                        Ohhh.\n                               (beat)\n                        Was your missus pleased?\n\n                                  PAUL\n                        Several times.\n\n              Paul hands him the bundle through the bars. Coffey takes it,\n              uncovers the cornbread reverently, gazes back up.\n\n                                  COFFEY\n                        This all for me?\n\n              Paul nods. Across the way, Del is pressing his face longingly\n              through the bars while Mr. Jingles crawls on his shoulder.\n\n                                  DEL\n                        Oh my. John, I can smell it from\n                        here. I surely can.\n\n                                  COFFEY\n                               (looks to Paul)\n                        Can I give some to Del?\n\n                                  PAUL\n                        It's yours, John. You do with it\n                        as you please.\n\n              John carefully scoops a big chunk of cornbread out with his\n              enormous hand, holds it through the bars to Paul.\n\n                                  COFFEY\n                        Here's for Del and Mr. Jingles\n                        then.\n\n                                  BILLY\n                        Hey! What about me? I'm'a get some\n                        too, ain't I\n\n              Coffey looks to Paul--do I have to?\n\n                                  PAUL\n                        It's yours, John. As you please.\n\n                                  COFFEY\n                        Well. Fine. I think I'll keep the\n                        rest, then.\n\n              He smiles like a big kid, digging in with his fingers. Paul\n              crosses the Mile to Del's cell, hands him his share.\n\n                                  PAUL\n                        Courtesy of the gentleman across\n                        the way.\n\n                                  DEL\n                        Oh, John. So very fine of you. So\n                        very kind. Mr. Jingles t'ank you.\n\n                                  COFFEY\n                               (mouth full)\n                        ...wel'cm...\n\n                                  BILLY\n                        Hey! What about me? Don't you hold\n                        out on me, ya big dummy nigger!\n\n              Paul's temper flares--he steps to Billy's cell.\n\n                                  PAUL\n                        You'll keep a civil tongue on my\n                        block.\n\n              Beat. Billy spits in Paul's face and follows it up with a big\n              grin--what are you gonna do about that? Paul is seething as\n              he wipes the spit off, but keeps his temper where it belongs.\n\n                                  PAUL\n                        You get that one for free. But\n                        that's the last one.\n\n              Paul walks away. Billy laughs, hollering after him:\n\n                                  BILLY\n                        That's it? Just that little bitty\n                        one? Guess I'll have to pay out\n                        for the rest, huh?\n\n                                                       DISSOLVE TO:\n\n              INT. E BLOCK - DAY\n\n              Harry is walking the Mile, doing a cell check and jotting on\n              a clipboard. He pauses, making a notation...\n\n              ...and a long stream of piss hits his leg. Billy's at his\n              bars, peeing on him. Harry jumps back, stunned. Billy howls\n              with laughter, hosing his aim wildly from side to side.\n\n                                  BILLY\n                        Yeehaaw! Good shot, weren't it?\n                        Oh, the look on your face!\n\n              Paul and Brutal come running. Harry's just flabbergasted:\n\n                                  HARRY\n                        You believe this? Son of a bitch\n                        pissed on me!\n\n                                  BILLY\n                        Hey, d'jall like that? I'm\n                        currently cooking some turds t'go\n                        with it! Nice soft ones! I'll have\n                        'em out t'yall tomorrow!\n\n              Paul stays calm, turns to Brutal, nods at the restraint room.\n\n                                  PAUL\n                        We've been looking to clear that\n                        room out anyway.\n\n                                                       TIMECUT:\n\n              A STREAM OF GUARDS comes toting the last of the restraint\n              room stuff past Billy's cell while he heckles them from the\n              bars...\n\n                                  BILLY\n                        Hey! Whassit now, movin' day?\n                        Y'all wanna come in and dust a\n                        little? Y'can shine my knob for me\n                        while yer at it!\n\n              ...and he pauses as Paul and Brutal step to the bars. Paul\n              has a canvas straitjacket. Brutal pulls his nightstick.\n\n                                  BILLY\n                        You can come in here on your legs,\n                        but you'll go out on your backs,\n                        Billy the Kid guarantee ya that.\n                               (motions to Brutal)\n                        C'mon, fuckstick. No sneakin' up\n                        on me this time. We'll go man to\n                        man, see who's the better fel--\n\n              Brutal unlocks the cell--and sidesteps, revealing Harry\n              pointing a fire hose. The hose erupts, driving Billy across\n              the cell with bone-jarring force. They batter him half-\n              senseless, then cut the water. Billy collapses in a heap.\n\n              Paul and Brutal drag him semi-conscious from his cell and get\n              the straitjacket on him. He comes around as they draw the\n              straps tight and pull him to his feet.\n\n                                  PAUL\n                        C'mon, Wild Bill. Little walky\n                        walky.\n\n                                  BILLY\n                        Don't you call me that! Wild Bill\n                        Hickock wasn't no range rider! He\n                        was just a bushwackin' John Law!\n                        Dumb sonovabitch sat with his back\n                        to the door and kilt by a drunk!\n\n                                  BRUTAL\n                        Oh, my suds and body! A history\n                        lesson! You just never know what\n                        you're gonna get when you come to\n                        work everyday on the Green Mile.\n                        Thank you, Wild Bill.\n\n              Billy lets out a scream of rage and throws himself at Brutal.\n              Brutal, bored, shoves him back toward Paul, who then propels\n              him down the Mile toward the open restraint room door. Billy\n              sees where they intend to put him, resorts to pleading:\n\n                                  BILLY\n                        Oh, not in there! C'mon now, I'll\n                        be good! Honest Injun I will! No!\n                        No! Ummmmhhhh...urg...ah!\n\n              He suddenly drops to the floor, bucking and jerking wildly,\n              spewing drool. Harry's eyes go wide.\n\n                                  HARRY\n                        Holy Christ, he's pitchin' a fit!\n\n              Paul reaches down and unceremoniously starts dragging Billy\n              kicking and writhing the rest of the way.\n\n                                  PAUL\n                        He'll be fine, boys. Trust me on\n                        this one.\n\n              Brutal helps Paul toss Billy headlong into the padded room.\n              They slam the door...\n\n              RESTRAINT ROOM\n\n              ...and Billy staggers to his feet in the straitjacket,\n              inarticulate with rage, starts throwing himself against the\n              door, screaming at the top of his lungs.\n\n                                  BILLY\n                        ALL I WANTED ME WAS A LITTLE\n                        CORNBREAD, YOU MUTHERFUCKERS!\n\n                                                       FADE TO:\n\n              INT. E BLOCK - NEXT DAY\n\n              Paul and Brutal unlock the restraint room. Billy looks up\n              from the corner, pale and drained. Softly:\n\n                                  BILLY\n                        I learnt my lesson. I'll be good.\n\n                                                       CUT TO:\n\n              INT. E BLOCK - DAY\n\n              Billy's back in his cell, quiet for a change. Toot-Toot is\n              outside the bars, mopping the floor. Billy notices a\n              chocolate Moon Pie in Toot's shirt pocket.\n\n                                  BILLY\n                        Pssss. Hey. Give'ya nickel for\n                        that Moon Pie.\n\n              Toot looks around. Nobody's watching, and a nickel's a\n              nickel. He steps to Billy's bars, swaps the Moon Pie for the\n              money.\n\n              Toot hurries away. Billy unwraps the Moon Pie, makes sure\n              he's not being watched...and crams the entire thing into his\n              mouth...\n\n                                                       DISSOLVE:\n\n              ...and here comes Brutal strolling down the Mile, doing a\n              cell check and jotting on a clipboard. He pauses, seeing:\n\n              Billy at his bars. Just standing there staring. His cheeks\n              bulging way out.\n\n              Brutal steps closer, fascinated...what the fuck is that.\n              Billy waits until he's just a bit closer--\n\n              --and he slams his fists against his own cheeks, propelling\n              a disgusting spew of liquefied chocolate sludge into Brutal's\n              face. Billy falls back onto his bunk, shrieking with laughter:\n\n                                  BILLY\n                        Li'l Black Sambo, yassuh, boss,\n                        yassuh, howdoo you do?\n\n                                  BRUTAL\n                               (beat, calmly)\n                        Hope your bags are packed.\n\n                                                       TIMECUT:\n\n              ...and once again, Billy gets dragged to the restraint room,\n              kicking and screaming all the way. They toss him in, slam the\n              door. Brutal turns, still wiping traces of sludge off.\n\n                                  PAUL\n                        The Moon Pie thing was pretty\n                        original. Gotta give him that.\n\n              Brutal nods. They walk away as we\n\n                                                       FADE TO:\n\n              INT. E BLOCK - DAY\n\n              Paul and Brutal appear at Del's bars with Harry and Dean.\n\n                                  PAUL\n                        Del, grab your things. Big day for\n                        you and Mr. Jingles.\n\n                                  DEL\n                        Whatchoo talkin' bout?\n\n                                  PAUL\n                        Important folks heard about your\n                        mouse, wanna see him perform. Not\n                        just guards, either. One of them's\n                        a politician all the way from the\n                        state capital, I believe.\n\n              Del swells with pride upon hearing this. He scrounges up Mr.\n              Jingles props, steps from his cell, looks to Harry and Dean.\n\n                                  DEL\n                        You fellas comin'?\n\n                                  HARRY\n                        We got other fish to fry just now,\n                        Del, but you knock 'em for a loop.\n\n              Del nods, beaming happily, looks to Coffey in his cell.\n\n                                  COFFEY\n                        You knock 'em for a loop like Mr.\n                        Harry says, Del.\n\n              Brutal leads Del up the Mile, Paul and the others at their\n              heels. Percy's at the duty desk. He smirks and rolls his eyes\n              as Del goes by. The moment Brutal and Del are out the door...\n\n              ...Toot emerges from Paul's office where he's been hiding.\n\n                                  PAUL\n                        Let's move along briskly, folks.\n                        There's not much time.\n\n              Toot hurries down to take his place in Del's cell.\n\n                                  TOOT\n                        I'm sittin' down, I'm sittin'\n                        down, I'm sittin' down.\n\n              INT. OFFICE/ADMINISTRATION BUILDING - DAY\n\n              A HALF DOZEN GUARDS are waiting. We find Bill Dodge fixing\n              the tie of a fat good ol' boy named EARL.\n\n                                  EARL\n                        Been sweepin' floors here ten\n                        years, never had to wear no damn\n                        tie before.\n\n                                  BILL\n                        You're a V.I.P. today, Earl, so\n                        just shut up.\n\n              A KNOCK at the door. Everybody takes a seat. Del is ushered\n              in by Brutal. Del faces his audience, puts his hands to his\n              chest in a \"thank you\" gesture worthy of Lillie Langtry\n              before her adoring public, then announces grandly:\n\n                                  DEL\n                        Messieurs et mesdames! Bienvenue\n                        au cirque de mousie!\n\n              INT. EXECUTION CHAMBER - DAY\n\n              The steel cap is lowered over Toot's head, the straps\n              tightened. TILT UP to Percy as:\n\n                                  PERCY\n                        Roll on two.\n\n              Behind his partition, Van Hay mimes flipping the switch.\n\n                                  VAN HAY\n                        That's that.\n\n              A pause. Percy looks anxiously to Paul, who's trading glances\n              with the other guards. Finally:\n\n                                  PAUL\n                        Very good. Very professional.\n\n              Percy smiles. Harry and Dean step up, slapping his back and\n              shaking his hand...\n\n              INT. E BLOCK - DAY\n\n              ...and they're still chatting a short time later, waiting for\n              Del's return. Percy actually looks happy for a change,\n              feeling genuinely accepted for the first time...\n\n              Billy is watching from his cell. Just watching.\n\n              The door opens. Del returns with Mr. Jingles on his shoulder,\n              escorted by Brutal. Brutal is toting the cigar box and spool\n              like a magician's assistant carrying the boss' props.\n\n                                  PAUL\n                        Well?\n\n                                  DEL\n                        They love Mr. Jingles! They laugh\n                        and cheer and clap they hands!\n\n                                  PERCY\n                        Well, that's just aces. Pop back\n                        in your cell, old-timer.\n\n              The generosity of Percy's tone catches Del completely off\n              guard. Del gives him a look of almost comical mistrust...\n\n              ...and the old Percy comes back. He bares his teeth in a mock\n              snarl and curls his fingers as if to grab Del. It's a joke,\n              but Del doesn't know that--he jerks back in fear and trips\n              over Brutal's big feet. Del goes down hard, hitting the\n              linoleum with the back of his head. Mr. Jingles jumps clear,\n              goes squeaking down the Mile. Del sits up, painfully\n              clutching his head. Brutal helps him up...\n\n                                  BRUTAL\n                        Percy, you shit.\n\n              ...and moves him toward his cell. Percy is actually moved to\n              apologize--he starts after them with a half-laugh, drifting\n              much too close to Wild Bill's side of the Mile...\n\n                                  PERCY\n                        Del! Hey, you numb wit, I didn't\n                        mean nothin' by it! You all ri--\n\n              ...and Wild Bill's arms thrust out, grabbing Percy and\n              slamming him back against the bars with an arm around his\n              throat. Percy squeals like a pig in a slaughter-chute,\n              thinking he's gonna die. The guards scramble, drawing their\n              clubs--as Billy strokes Percy's hair and whispers in his ear:\n\n                                  BILLY\n                        Ain't you sweet. Soft. Like a\n                        girl. I druther fuck your asshole\n                        than your sister's pussy, I think.\n\n              Billy kisses Percy's ear--and his hand drops down to squeeze\n              Percy's crotch. Paul pulls his sidearm, taking aim...\n\n                                  PAUL\n                        Wharton!\n\n              ...and Billy lets go, stepping back with his hands raised,\n              laughing. Percy darts across the Mile in terror and cringes\n              against the cell opposite, breathing so loud and fast it\n              almost sounds like sobbing.\n\n                                  BILLY\n                        I let 'im go, I'us just playin'\n                        and I let 'im go! Never hurt a\n                        hair on his purty head!\n                               (grins at Percy)\n                        Your noodle ain't limp at all,\n                        loverboy! I think you sweet on ol'\n                        Billy the Kid...\n                               (sniffs his fingers)\n                        ...oooh, but smell you.\n\n              Down at his cell, Del starts laughing shrilly. Everybody else\n              starts to realize it, including Percy himself...he looks\n              down, sees the huge dark stain spreading at his crotch.\n\n                                  DEL\n                        Lookit, he done piss his pants!\n                        Look what the big man done! He\n                        bus' other people wid 'is stick,\n                        mais oui some mauvais homme, but\n                        someone touch him, he make water\n                        in his pants jus' like a baby!\n\n              Percy just stares. Brutal shoves Delacroix into his cell.\n\n                                  BRUTAL\n                        Shut up, Del.\n\n              Paul steps to Percy, puts a hand on his shoulder. Percy\n              shakes his hand off, looks around at their faces, whispers:\n\n                                  PERCY\n                        You talk about this to anyone,\n                        I'll get you all fired. I swear\n                        that to God.\n\n                                  PAUL\n                        What happens on the Mile, stays on\n                        the Mile. Always has.\n\n              The men nod solemnly. Nobody's going to talk about this.\n              Percy looks at Delacroix still snorting in his cell, points\n              at him.\n\n                                  PERCY\n                        You keep laughing, you French-\n                        fried faggot. You just keep\n                        laughing.\n\n              Del falls silent. Percy turns and storms away as we\n\n                                                       FADE TO BLACK\n\n              IN BLACKNESS, A TITLE CARD APPEARS:\n\n                          \"The Bad Death of Eduard Delacroix\"\n\n                                                       CUT TO:\n\n              INT. DEL'S CELL - DAY\n\n              Paul is sitting with Delacroix. Brutal is leaning against the\n              bars. Del is throwing the spool. Mr. Jingles is fetching it.\n\n              The silence is thick. Just the clack-clatter of the spool,\n              and the skitter skitter of tiny mouse paws on concrete. It's\n              getting on Paul's nerves in a big way. Softly:\n\n                                  PAUL\n                        What about Dean? He's got a little\n                        boy would love a pet mouse, I bet.\n\n              Del looks horrified at the thought.\n\n                                  DEL\n                        How could a boy be trust wid Mr.\n                        Jingles? Maybe forget to feed him.\n                        And how he keep up wid his\n                        trainin', just a boy, n'est-ce pas?\n\n              Del tosses the spool again--clack-clatter, skitter-skitter.\n\n                                  PAUL\n                        All right, I'll take him.\n\n                                  DEL\n                        T'ank you kindly, merci beaucoup,\n                        but you live out in the woods, and\n                        Mr. Jingles, he be scared to live\n                        out dans la foret.\n\n                                  PAUL\n                        He whisper that in your ear?\n\n              Del nods, tosses the spool again--clack-clatter, skitter\n              skitter. Paul is completely out of ideas. But then:\n\n                                  BRUTAL\n                        How about Mouseville?\n\n                                  DEL\n                        Mouseville?\n\n                                  BRUTAL\n                        Tourist attraction down in\n                        Florida. Tallahassee, I think. Is\n                        that right, Paul? Tallahassee?\n\n                                  PAUL\n                               (level)\n                        Yeah, that's right. Tallahassee.\n                        Just down the road apiece from the\n                        dog university.\n\n              Brutal's mouth twitches, but he manages to keep a straight\n              face. He gives Paul a look--don't blow this.\n\n                                  BRUTAL\n                        You think they'd take Mr. Jingles?\n                        You think he's got the stuff?\n\n                                  PAUL\n                        Might. He's pretty smart.\n\n                                  DEL\n                        Hey! What dis Mouseville?\n\n                                  BRUTAL\n                        Tourist attraction, I said. They\n                        got this big tent you go into--\n\n                                  DEL\n                        Like a cirque? You have to pay?\n\n                                  BRUTAL\n                        You shittin' me? Course you pay.\n                        Dime a piece, two cents for the\n                        kids. And inside the tent there's\n                        this mouse city made out of boxes\n                        and toilet paper rolls...\n\n              Percy is drifting up the block, listening too, but nobody's\n              really paying him much mind.\n\n                                  BRUTAL\n                        ...plus they got the Mouseville\n                        All-Star Circus. There's mice that\n                        swing on trapeze, mice that roll\n                        barrels, mice that stack coins...\n\n                                  DEL\n                        Dat's it! Dat's da place for Mr.\n                        Jingles! You gonna be a circus\n                        mouse after all! Gonna live in a\n                        mouse city down in Florida!\n\n              Del tosses the spool extra hard--it takes a bad bounce off\n              the wall and goes clattering through the bars onto the Mile.\n              The mouse goes after it like a shot, too intent to notice:\n\n              His old enemy Percy.\n\n                                  BRUTAL\n                        Percy, no!\n\n              Percy stomps the heel of his heavy work shoe down on Mr.\n              Jingles. There's a SOFT SNAP as the mouse's back breaks.\n\n              Del screams in horror and throws himself at the bars, sobbing\n              the mouse's name. Percy looks to Brutal and Paul, smiles.\n\n                                  PERCY\n                        Knew I'd get him sooner or later.\n                        Just a matter of time, really.\n\n              He turns and strolls up the Mile, leaving Mr. Jingles dying\n              in a tiny pool of blood. Up at the duty desk, Dean and Harry\n              get up from a cribbage game, stunned and furious.\n\n              Percy strolls past, exits to the execution chamber. Del is\n              still screaming, all his pent-up terror and grief pouring out\n              at the dying mouse. And then comes a soft, urgent voice:\n\n                                  COFFEY\n                        Give'm to me.\n\n              They turn. Coffey's got his arms out through his bars, one\n              massive hand spread open.\n\n                                  COFFEY\n                        Give'm to me. Might still be time.\n\n              Paul hesitates, scoops the mouse up off the floor, wincing at\n              the feel of it. Splintered bones are poking at the hide.\n\n                                  BRUTAL\n                        What are you doing?\n\n              Paul doesn't answer, just lays Mr. Jingles into Coffey's\n              hand. Coffey pulls the mouse in through his bars and lays his\n              other hand gently over it, cupping the creature. All we see\n              now is the tail hanging out the side, twitching weakly.\n\n                                  BRUTAL\n                        Paul, what the hell--\n\n              Paul motions him quiet. Del is pleading softly at his bars:\n\n                                  DEL\n                        Please, John. Oh Johnny, help him,\n                        please help him, s'il vous plait.\n\n              Harry and Dean join the group. Everybody watching now.\n\n              Coffey puts his mouth to his cupped hands, inhales sharply.\n              The world hangs suspended for a moment. Coffey raises his\n              face, contorting as if desperately ill, starts making those\n              horrendous choking sounds in his throat...\n\n                                  BRUTAL\n                               (softly)\n                        Oh, dear Jesus. The tail. Look at\n                        the tail.\n\n              They do. The tail is no longer weak and dying. It's snapping\n              briskly back and forth, as if ready to play.\n\n              Coffey makes that retching/gagging sound...and again exhales\n              a cloud of swirling black \"insects\" from his nose and mouth.\n              The men watch, speechless, as the bugs turn white and\n              disappear.\n\n              Coffey bends down, opens his hand. Mr. Jingles bounds off his\n              fingers through the bars, racing past the guards' feet. They\n              turn to see Del gather the mouse up, laughing and crying.\n              Dean turns back to Coffey with a stunned whisper:\n\n                                  DEAN\n                        What did you do?\n\n                                  COFFEY\n                        I helped Del's mouse. He a circus\n                        mouse. Goan live in a mouse city\n                        down in...down in...\n\n                                  BRUTAL\n                               (numb)\n                        Florida?\n\n              Coffey nods, remembering.\n\n                                  COFFEY\n                        Boss Percy's bad. He mean. He step\n                        on Del's mouse.\n                               (softly)\n                        I took it back, though.\n\n              And with that, he lies back on his bunk and faces the wall.\n              The others look to Paul, don't even know what to say.\n\n                                  PAUL\n                        Brute, come along with me.\n                               (to Harry and Dean)\n                        You fellas go on back to you\n                        cribbage game.\n\n              Harry nods numbly. Paul leads Brutal up the Mile...\n\n              EXECUTION CHAMBER\n\n              ...and they enter to find Percy polishing Old Sparky's arms.\n\n                                  PERCY\n                        Don't start in on me. It was just\n                        a mouse. Never belonged here in\n                        the first place.\n\n                                  PAUL\n                        The mouse is fine. Just fine.\n                        You're no better at mouse-killing\n                        than anything else around here.\n\n                                  PERCY\n                        You expect me to believe that? I\n                        heard the goddamn thing crunch.\n\n              Paul steps closer, angry as we've ever seen him:\n\n                                  PAUL\n                        Aren't you glad Mr. Jingles is\n                        okay? After all our talks about\n                        how we should keep the prisoners\n                        calm? Aren't you relieved?\n\n                                  PERCY\n                        What kind of game is this?\n\n                                  PAUL\n                        No game. See for yourself.\n\n              Beat. Percy stalks past them, heads out onto the Mile. Paul\n              and Brutal just wait, saying nothing. Brutal picks up the rag\n              left by Percy, resumes polishing chores on Old Sparky. Paul\n              stretches, cracks his neck. The silence heavy...\n\n              ...until Percy reappears.\n\n                                  PERCY\n                        You switched them! You switched\n                        them somehow, you bastards!\n\n                                  BRUTAL\n                        I always keep a spare mouse in my\n                        wallet for occasions such as this.\n\n                                  PERCY\n                        You're playing with me, the both\n                        of you! Just who the hell do you\n                        think you are--\n\n              Brutal grabs him , slams him bodily into the electric chair.\n              Paul bends close, gets right in Percy's face.\n\n                                  PAUL\n                        We're the people you work with,\n                        Percy, but not for long. I want\n                        your word.\n\n                                  PERCY\n                        My word?\n\n                                  PAUL\n                        I put you out front for Del, you\n                        put in your transfer to Briar\n                        Ridge the very next day.\n\n                                  PERCY\n                        What if I just call up certain\n                        people and tell them you're\n                        harassing me? Bullying me?\n\n                                  PAUL\n                        Go ahead. I promise you'll leave\n                        your share of blood on the floor.\n\n                                  PERCY\n                        Over a mouse? You think anyone's\n                        gonna give two shits?\n\n                                  PAUL\n                        No. But four men will swear you\n                        stood by while Wild Bill tried to\n                        strangle Dean to death. About that\n                        people will care, Percy. Even your\n                        uncle the governor will care.\n\n                                  BRUTAL\n                        Thing like that goes in your work\n                        record. Work record can follow a\n                        man around a long, long time.\n\n              Percy looks from one man to another, knowing he's trapped.\n\n                                  PAUL\n                        I put you out front, you put in\n                        your transfer. That's the deal.\n\n              Percy thinks it over, nods. He tries to get up, but Paul keep\n              him pinned...and pointedly offer his hand.\n\n                                  PAUL\n                        You make a promise to a man, you\n                        shake his hand.\n\n              Percy hesitates, shakes Paul's hand...\n\n              HIGH WIDE ANGLE OF EXECUTION CHAMBER\n\n              ...and Paul pulls him out of the electric chair as we\n\n                                                       DISSOLVE TO:\n\n              SAME ANGLE AS ABOVE - NEXT NIGHT\n\n              Witnesses are trickling in, filling the seats. A storm is\n              brewing, sending FLASHES OF LIGHTNING across the floors.\n\n              INT. DEL'S CELL - NIGHT\n\n              Del sits with Mr. Jingles in his lap, stroking the mouse\n              between the ears. Paul, Brutal, and Harry appear at the bars.\n\n                                  DEL\n                        Hey, boys. Say hi, Mr. Jingles.\n\n                                  PAUL\n                        Eduard Delacroix, will you step\n                        forward?\n\n                                  DEL\n                        Boss Edgecomb?\n\n                                  PAUL\n                        Yes, Del?\n\n                                  DEL\n                        Don' let nothin' happen to Mr.\n                        Jingles, okay?\n\n              Paul nods--I promise. Del rises, steps to Paul.\n\n                                  DEL\n                        Here, take him.\n\n              Del lifts his hand. Mr. Jingles steps off onto Paul's\n              shoulder with no hesitation. Gently:\n\n                                  PAUL\n                        Del. I can't have a mouse on my\n                        shoulder while...you know.\n\n                                  COFFEY\n                        I'll take him, boss. Jus' for now.\n                        If Del don' mind.\n\n                                  DEL\n                        Yeah, you take 'im, John. Take him\n                        til' dis foolishment done--bien!\n                               (to Paul and Brutal)\n                        After, you take him down to\n                        Florida? To dat Mouseville?\n\n                                  BRUTAL\n                        We'll do it together, most likely.\n                        Maybe take a little vacation time.\n\n              Paul moves to Coffey's cell. The mouse skitters off Paul's\n              shoulder onto Coffey's hand.\n\n                                  DEL\n                        People pay a dime apiece to see\n                        him. Two cents for the kiddies.\n                        Ain't dat right, Boss Howell?\n\n                                  BRUTAL\n                        That's right, Del.\n\n                                  DEL\n                        You a good man, Boss Howell. You\n                        too, Boss Edgecomb. Wish I could'a\n                        met you bot' someplace else.\n\n              Del gives Mr. Jingles one last look, starts to cry.\n\n                                  DEL\n                        Au revoir, mon ami. Je t'aime, mon\n                        petit.\n\n              And they start to walk the Mile...\n\n              EXECUTION CHAMBER\n\n              Sweltering in the damp heat. Rain is pissing down, drumming\n              the tin roof. People glance up uneasily as THUNDER BOOMS. A\n              FAT LADY is staring grimly at the electric chair.\n\n                                  FAT LADY\n                        Hope he's good and scared. Hope he\n                        knows the fires are stoked, and\n                        that Satan's imps are waiting.\n\n              ANGLE ON DOOR\n\n              Del enters, horrified to see Percy waiting at Old Sparky.\n              Paul gives Del's arm a reassuring squeeze, leads him\n              forward...\n\n              IN A TIGHT SERIES OF SHOTS:\n\n              The clamps are applied. The straps are drawn tight.\n\n                                  PERCY\n                        Roll on one.\n\n              The lights brighten on a RISING HUM. Witnesses look up.\n\n              ON THE MILE\n\n              Coffey looks up as the overheads flare hotter and hotter,\n              whispers to the mouse in his hands:\n\n                                  COFFEY\n                        You be still, Mr. Jingles. You be\n                        so quiet and so still.\n\n              RESUME EXECUTION CHAMBER\n\n                                  PERCY\n                        Eduard Delacroix, you have been\n                        condemned to die by a jury of your\n                        peers, sentence imposed by a judge\n                        in good standing in this state.\n                        You have anything to say before\n                        sentence is carried out?\n\n              Del tries to speak. Doesn't quite manage the first time.\n              Licks his lips and tries again.\n\n                                  DEL\n                        I sorry for what I do. I give\n                        anything to take it back, but I\n                        can't. God have mercy on me.\n                               (whispers to Paul)\n                        Don' forget 'bout Mouseville.\n\n              Paul and Brutal nod--and are stunned as:\n\n                                  PERCY\n                        No such place. That's just a fairy\n                        tale these guys told you to keep\n                        you quiet. Just thought you should\n                        know, faggot.\n\n              The stricken look in Del's eyes tells us a part of him had\n              known all along. Paul and Brutal would both like to deck\n              Percy right about now, and he knows it--he gives them a \"what\n              are you gonna do about it\" smile.\n\n              Nothing they can do. Paul nods to Harry, who takes the black\n              mask from the back of the chair and rolls it down over Del's\n              head, leaving the top of his shaved head exposed.\n\n              PERCY\n\n              takes the sponge and bends down to the bucket of brine. The\n              other don't see it, but we do:\n\n              Percy only pretends to dip the sponge and soak it. It never\n              touches the water. He straightens up and places the sponge\n              atop Delacroix's head, hiding it with his hands.\n\n              The cap is lowered. Paul and the others haven't yet realized\n              what's happened. THUNDER BOOMS and LIGHTNING CRASHES as Percy\n              hides a smile, steps back to address the condemned:\n\n                                  PERCY\n                        Electricity shall now be passed\n                        through your body until you are\n                        dead, in accordance with state\n                        law. God have mercy on your soul.\n\n              TIGHT ON PAUL\n\n              as realization starts to dawn. He stares at the bucket, then\n              across the floor to Delacroix, coming to terms with the\n              evidence of his eyes--there's no water on the floor or\n              dripping down the sides of Del's neck.\n\n              Paul's eyes widen. A stunned beat of horror. He starts to\n              open his mouth to scream \"NO!\", but Percy beats him to it\n              with:\n\n                                  PERCY\n                        Roll on two.\n\n              Van Hay flicks the switch. WHAM. The electricity hits home\n              and Del rocks forward, riding the current.\n\n              Then things start to go horribly wrong.\n\n              The HUMMING loses its steadiness and starts to waver with a\n              CRACKLING SOUND. Tendrils of smoke begin curling from under\n              the cap, a mixture of burning hair and sponge. Brutal shoots\n              Paul a horrified look. Paul responds with a harsh whisper:\n\n                                  PAUL\n                        It's dry!\n\n              Delacroix begins twisting and jittering in the chair, his\n              masked face snapping violently from side to side, his legs\n              pistoning up and down in his restraints.\n\n              There's a MUFFLED POP from under the cap, like a pine knot\n              exploding in a hot fire. Smoke starts coming through the\n              fabric of the mask, puffing upward. Del is being cooked\n              alive. Paul spins to the partition, hollering--\n\n                                  PAUL\n                        JACK!\n\n              --but Brutal grabs his arm, whispers fiercely:\n\n                                  BRUTAL\n                        Don't you tell him to stop. Don't\n                        you do it. It's too late for that.\n\n              Paul turns back, helpless. The other guards are trading wild\n              looks, unable to believe what's happening. Even Percy looks\n              aghast--he was expecting something, but not this.\n\n              Del begins SCREAMING--the wild, hysterical sound of an animal\n              being shredded alive in a hay baler. The HUMMING goes uneven\n              and ragged, the lights rising and falling...\n\n              ON THE MILE\n\n              ...as Del's screams rise and fall with them, echoing up the\n              corridor. Coffey's shaking and screaming too, as if feeling\n              Del's pain. Mr. Jingles squirms out of his grasp and goes\n              squeaking in terror toward the restraint room door...\n\n                                  BILLY\n                        HE'S COOKIN' NOW! THEY COOKIN' HIM\n                        GOOD! NEAR ABOUT DONE, I RECKON!\n\n              RESUME EXECUTION CHAMBER\n\n              Wrong. Del's nowhere near about done. He's slamming back and\n              forth in the chair hard enough to shake the platform,\n              twisting hard against the leather restraints. We hear BONES\n              BREAKING. A WOMAN'S SCREAMS. Witnesses start rising to their\n              feet:\n\n                                  WITNESSES\n                        What the hell's happening to\n                        him?...Are those clamps going to\n                        hold?...Christ, the smell!...Is\n                        this normal?\n\n              The mask bursts into flame on Delacroix's face. Van Hay\n              hollers through the wire mesh, horrified:\n\n                                  VAN HAY\n                        SHOULD I KILL THE JUICE?\n\n                                  PAUL\n                        NO! ROLL, FOR CHRIST'S SAKE, ROLL!\n\n              Harry scoops up the bucket of water to throw it.\n\n                                  PAUL\n                        No water! No water! You crazy?\n\n              Harry backs off with a look of dazed understanding--you don't\n              throw water on a man getting juiced. Right. He drops the\n              bucket, races to get the chemical fire extinguisher instead.\n\n              The flaming mask peels away, revealing Del's charring face.\n              His eyeballs are misshapen globs of burning white jelly blown\n              out of their sockets. The ATTENDING DOCTOR faints dead away.\n\n              Pandemonium now in the room. People shouting and hurrying to\n              exit, chairs falling over, women screaming:\n\n                                  FAT LADY\n                        Stop it, stop it, oh can't you see\n                        he's had enough?\n\n              Hal grabs Paul by the shoulder, spins him around.\n\n                                  HAL\n                        Why don't you shut it down?\n\n                                  PAUL\n                        He's still alive! You want me to\n                        shut down while he's still alive?\n\n              Hal is horrified at the thought. Del is jittering and\n              screaming, rocking from side to side, smoke pouring from his\n              nostrils and mouth, his tongue sizzling purple-black.\n\n              The witnesses are crowding and shoving to get out, but the\n              back door is locked. All they can do is cluster there.\n\n              Paul sees Percy with his head turned away. He grabs him,\n              forces his head around.\n\n                                  PAUL\n                        You watch, you son of a bitch!\n\n              Harry steps up, the extinguisher in his hands. Waiting. Del\n              finally slumps over. He still vibrating, but now it's just\n              the effect of current flowing through his body.\n\n                                  PAUL\n                        Kill it!\n\n              Van Hay kills the current. The HUMMING DIES. Brutal grabs the\n              extinguisher from Harry, shoves it into Percy's hands.\n\n                                  BRUTAL\n                        You do it. You're running the\n                        show, ain't you?\n\n              Percy, sick and dazed, aims the extinguisher and hoses the\n              smoking corpse. Hal is near the back, calming the crowd:\n\n                                  HAL\n                        It's all right, folks, it's all\n                        under control. Just a power surge\n                        from the storm, that's all,\n                        nothing to worry about...\n\n                                  PAUL\n                        Dean, get doc's stethoscope.\n\n              Dean drops to the doctor's bag, digs through it, hands up the\n              stethoscope. Paul plugs them into his ears. People are\n              moaning and sobbing at the back of the room:\n\n                                  MAN\n                        Oh my God! Is it always like this?\n                        Why didn't somebody tell me? I\n                        never would have come!\n\n              Paul wipes some foam away from Delacroix's chest, places the\n              stethoscope pad to the raw flesh. He nods to Brutal--it's\n              over.\n\n                                                       CUT TO:\n\n              INT. ACCESS TUNNEL - NIGHT\n\n              Paul and the others bring the stretcher down, lay the corpse\n              on the gurney. Percy starts stammering excuses:\n\n                                  PERCY\n                        I didn't know the sponge was\n                        supposed to be wet--\n\n              Brutal hauls off and slugs him. A scuffle ensues as the\n              others grab Brutal and pull him off.\n\n                                  PAUL\n                        Brutal, no!\n\n                                  BRUTAL\n                        What do you mean, no? How can you\n                        say no? You saw what he did!\n\n                                  PAUL\n                        Delacroix's dead, nothing can\n                        change that, and Percy's not worth\n                        it!\n\n                                  BRUTAL\n                        So he just gets away with it? Is\n                        that how it works?\n\n              Hal comes lunging down the stairs, furious:\n\n                                  HAL\n                        What the fuck was that? Jesus\n                        Christ, three witnesses puked all\n                        over the floor up there! And the\n                        smell! I got Van Hay to open both\n                        doors, but that smell won't come\n                        out for five damn years, that's\n                        what I'm betting! And that asshole\n                        Wharton is singing about it! I can\n                        hear him!\n\n                                  PAUL\n                               (quietly)\n                        Can he carry a tune, Hal?\n\n              This pulls the plug on the moment--Hal snorts, triggering\n              laughter among the men, a wild release of tension and fear.\n              Everybody starts feeling a bit saner again as it dies down:\n\n                                  HAL\n                        Okay, boys. Okay. Now what the\n                        hell happened?\n\n              All eyes go to Percy. Hal turns, sees Percy's bloody lip.\n\n                                  HAL\n                        Percy? Something to say?\n\n                                  PERCY\n                        I didn't know the sponge was\n                        supposed to be wet.\n\n              Beat. A look of utter contempt from Hal.\n\n                                  HAL\n                        How many years you spend pissing\n                        on the toilet seat before somebody\n                        told you to put it up?\n\n                                  PAUL\n                        Percy fucked up, Hal. Pure and\n                        simple.\n\n                                  HAL\n                        Is that your official position?\n\n                                  PAUL\n                        Don't you think it should be?\n\n              Hal considers it, nods.\n\n                                  PAUL\n                        He'll be putting in a transfer\n                        request to Briar Ridge tomorrow.\n                        Moving on to bigger and better\n                        things. Isn't that right, Percy?\n\n              Percy nods. Hal steps close, gives him a tight, icy smile.\n\n                                  HAL\n                        You're a little asshole, and I\n                        don't like you a bit.\n                               (off Percy's look)\n                        Have that transfer request on my\n                        desk first thing.\n\n              Hal heads back up the stairs. Brutal shoves Percy aside and\n              wheels Delacroix's body down the tunnel.\n\n              INT. E BLOCK - NIGHT\n\n              Paul returns to find Wild Bill making up a song in his cell:\n\n                                  BILLY\n                               (singing)\n                        Barbecue! Me and you! Stinky,\n                        pinky, phew-phew-phew! Weren't\n                        Billy or Jilly or Hilly or Roy--it\n                        was a French-fried faggot named\n                        Delacroix!\n\n                                  PAUL\n                        You're about ten seconds away from\n                        spending the rest of your life in\n                        the padded room.\n\n              Billy falls silent. Paul continues down the Mile to Coffey's\n              cell. Coffey's on his bunk, face streaked with tears. He\n              wipes his eyes with the heels of his hands like an exhausted\n              child.\n\n                                  COFFEY\n                        Poor Del. Poor old Del.\n\n                                  PAUL\n                        Yes. Poor old Del. John, are you\n                        okay?\n\n                                  COFFEY\n                        I could feel it from here.\n\n                                  PAUL\n                        What do you mean? You could hear\n                        it? Is that what you mean?\n\n                                  COFFEY\n                        He's out of it now, though. He's\n                        the lucky one. No matter how it\n                        happened, Del's the lucky one.\n\n              Paul realizes he won't get a coherent answer.\n\n                                  PAUL\n                        Where's Mr. Jingles?\n\n                                  COFFEY\n                               (points vaguely)\n                        Ran down there. Don't think he'll\n                        be back.\n                               (beat)\n                        Awful tired now, boss. Dog tired.\n\n              Coffey lays down, turns to face the wall.\n\n                                  PAUL\n                        Me too, John. Me too.\n\n                                                       CUT TO:\n\n              INT. PAUL'S HOUSE - NIGHT\n\n              Paul enters in darkness, hangs his hat. He drifts into the\n              kitchen, clicks on the radio. SOFT MUSIC BEGINS: Gene Austin\n              singing \"Did You Ever See A Dream Walking?\"\n\n              He pours a drink at the kitchen table, takes a sip, lays the\n              glass down. Jan sleepily appears from the darkness behind\n              him, entering the kitchen. He realizes she's there, glances\n              back.\n\n              She can sense the weight on his soul. She comes to him, folds\n              his head into her arms. They stand that way, he drawing\n              strength and she giving it, as the music plays on...\n\n                                                       DISSOLVE TO:\n\n              SEQUENCE WITH MUSIC:\n\n              INT. CHURCH - MORNING\n\n              CAMERA TRACKS the pews to find Paul and Jan seated together\n              in the congregation, voices raised in hymn...\n\n              EXT. COUNTRY ROAD - MORNING\n\n              Paul's Model T comes sputtering up the road. He and Jan are\n              taking a drive, still in their Sunday best...\n\n              EXT. HAL'S HOUSE - MORNING\n\n              Paul and Jan wait at the front door. Jan holds a baking dish.\n\n                                  PAUL\n                        I hate this.\n\n                                  JAN\n                        I know.\n\n              The door opens. Hal, looking tired, ushers them inside...\n\n              EXT. BACKYARD - MORNING\n\n              ...and they walk outside to find MELINDA MOORES sitting in\n              the sun, frail and wasted, a blanket on her knees. She'd be\n              beautiful if not for the cancer killing her.\n\n              Paul is shocked at her appearance, hides it as best as he\n              can. Jan covers this for him--she drops to Melinda's side\n              with a warm smile and a kiss, takes the woman's frail hands\n              in hers.\n\n              Paul catches Jan's eye. The look he gives her says it all--I\n              don't know what I'd do without you...\n\n                                                       DISSOLVE:\n\n              ...and we find Paul and Hal talking quietly over beers while\n              the women visit b.g.:\n\n                                  HAL\n                        She's having one of her good days.\n                        I thank God for that.\n\n                                  PAUL\n                        What a bad day?\n\n                                  HAL\n                               (beat)\n                        Sometimes she's...not herself\n                        anymore. She swears.\n\n                                  PAUL\n                        Swears.\n\n                                  HAL\n                        It just pops out, the most awful\n                        language you can imagine. She\n                        doesn't even know she's doing it.\n                        I didn't know she'd ever heard\n                        words like that...and to hear her\n                        say them in her sweet voice...\n                               (gazes off)\n                        I'm glad she's having a good day,\n                        Paul. I'm glad for you and Jan.\n\n                                                       DISSOLVE TO:\n\n              INT. PAUL'S BEDROOM - NIGHT\n\n              Paul is wide awake, staring at the dark. Jan can sense him\n              brooding. She rolls over sleepily.\n\n                                  JAN\n                        Honey? If you don't say what's on\n                        your mind, I'm afraid I'll have to\n                        smother you with a pillow.\n\n                                  PAUL\n                        I'm thinking I love you. I'm\n                        thinking I don't know what I'd do\n                        if you were gone.\n\n                                  JAN\n                        Oh.\n\n                                  PAUL\n                               (beat)\n                        I'm also thinking I'd like to have\n                        the boys over tomorrow.\n\n              Off Jan's look, we\n\n                                                       CUT TO:\n\n              INT. DINING ROOM- DAY\n\n              Brutal, Harry, and Dean are seated at the table with Paul and\n              Jan. Serving plates are being passes, everybody digging in:\n\n                                  THE MEN\n                               (various, ad-lib)\n                        Ma'am, you sure know how to fry up\n                        some fine chicken...Brutal, don't\n                        hog the taters now...Try that corn\n                        yet? It's something special...\n\n              Paul softly interjects:\n\n                                  PAUL\n                        You saw what he did with the mouse.\n\n              This stops everybody cold. Dean puts his chicken down, wipes\n              his hands. Looks are traded in the silence.\n\n                                  BRUTAL\n                        I could'a gone the rest of the day\n                        without you bringing that up.\n\n                                  DEAN\n                        I could'a gone the rest of the\n                        year.\n\n                                  PAUL\n                        He did it to me too. He put his\n                        hands on me and took my bladder\n                        infection away.\n\n              The men absorb this. Brutal glances to Jan.\n\n                                  JAN\n                        When he came home, he was...all\n                        better.\n\n                                  DEAN\n                        You're talking about an authentic\n                        healing. A praise-Jesus miracle.\n\n                                  PAUL\n                        I am.\n\n                                  BRUTAL\n                        If you say it, I accept it. But\n                        what's it got to do with us?\n\n              Jan looks to Paul, realization starting to dawn:\n\n                                  JAN\n                        Melinda? Oh, Paul...\n\n                                  BRUTAL\n                        Melinda? Melinda Moores?\n\n              Paul nods--that's who we're talking about.\n\n                                  JAN\n                        You really think you can help her?\n\n                                  PAUL\n                        It's not a bladder infection, or\n                        even a busted-up mouse. But there\n                        might be a chance.\n\n                                  HARRY\n                        Hold on now. You're talking about\n                        our jobs. Sneak a sick woman onto\n                        a cellblock?\n\n                                  PAUL\n                        Hal would never allow that. You\n                        know him, he wouldn't believe\n                        something unless it fell on him.\n\n                                  BRUTAL\n                        So you're talking about taking\n                        John Coffey to her. That's more\n                        than just our jobs, Paul.\n\n                                  DEAN\n                        Damn right. That's prison time if\n                        we get caught.\n\n                                  HARRY\n                        Let's not discuss this like it's\n                        even an option. Brutal, help me\n                        out here...\n\n              Brutal lets out a deep breath, considering. He looks to Paul.\n\n                                  BRUTAL\n                        I'm sure she's a fine woman...\n\n                                  JAN\n                        The finest.\n\n                                  PAUL\n                        What's happening to her is an\n                        offense, Brutal. To the eyes and\n                        the ears and the heart.\n\n                                  BRUTAL\n                        I have no doubt. But we don't know\n                        her like you and Jan do...do we?\n\n                                  PAUL\n                        That's why it's a lot to ask.\n\n                                  HARRY\n                        It is. Let's not forget Coffey's\n                        a murderer. What if he escapes?\n                        I'd hate losing my job or going to\n                        prison, but I'd hate having a dead\n                        child on my conscience even more.\n\n                                  PAUL\n                        I don't think that'll happen...\n                               (beat, softly)\n                        ...in fact, I don't think he did\n                        it at all.\n\n              The men are stunned by this. Off their looks:\n\n                                  PAUL\n                        I just can't see God putting a\n                        gift like that in the hands of a\n                        man who would kill a child.\n\n                                  DEAN\n                        Well, that's a tender notion, but\n                        the man's on death row for the\n                        crime. Plus, he's huge. If he\n                        tried to get away, it'd take a lot\n                        of bullets to stop him.\n\n                                  BRUTAL\n                        We'd all have shotguns in addition\n                        to sidearms. I'd insist on that.\n                               (to Paul)\n                        He tried anything, we'd have to\n                        take him down. You understand.\n\n                                  PAUL\n                        I understand.\n\n                                  BRUTAL\n                               (beat)\n                        So. Tell us what you had in mind.\n\n                                                       FADE TO BLACK\n\n              IN BLACKNESS, A TITLE CARD APPEARS:\n\n                                    \"Night Journey\"\n\n                                                       CUT TO:\n\n              INT. INFIRMARY BUILDING/DISPENSARY - NIGHT\n\n              A FLASHLIGHT BEAM plays across a glass cabinet, scanning the\n              contents. The beam pauses. A hand enters frame, unlocks the\n              cabinet, pulls out a bottle of morphine tablets...\n\n              ...and WE ANGLE TO Brutal as he shakes half a dozen pills\n              onto his palm, pockets them, replaces the bottle on the\n              shelf. He turns and slips five bucks to a NIGHTSHIFT ORDERLY.\n\n                                  BRUTAL\n                        I was never here.\n\n                                  ORDERLY\n                        Shit, for five bucks, you was\n                        never nowhere.\n\n              INT. E BLOCK ACCESS TUNNEL - NIGHT\n\n              A MORPHINE PILL is being crushed to powder on the stainless\n              steel gurney. TILT UP to Paul crushing the pills. Brutal\n              carefully scrapes the powder onto a small sheet of paper...\n\n              INT. PAUL'S INNER OFFICE - NIGHT\n\n              Percy is parked in Paul's chair with his feet up, reading a\n              book titled: \"CARING FOR MENTAL PATIENTS.\"\n\n              INT. E BLOCK - NIGHT\n\n              Harry and Dean are playing cards at the duty desk, tension\n              thick, cards slapping softly as the seconds tick by. Paul and\n              Brutal finally show up toting bottles of RC cola:\n\n                                  BRUTAL\n                        Fellas thirsty? Fresh out of the\n                        icebox.\n\n                                  DEAN\n                        Oh, thanks. That's swell.\n\n                                  HARRY\n                        Yeah, hot in here.\n\n              They begin popping the caps off, swigging cola. The sound of\n              it brings Billy to his bars.\n\n                                  BILLY\n                        Hey. Hey, I'm'a get some too.\n\n                                  BRUTAL\n                        My ass you get some too.\n\n                                  PAUL\n                        You think you deserve any?\n\n                                  HARRY\n                               (checks a clipboard)\n                        Day report says he's been okay.\n\n                                  BILLY\n                        Hell, yes, I been behaved. C'mon,\n                        now, don't be stingy hogs.\n\n              Paul shrugs to Brutal--why not? Brutal pops the top off a\n              bottle, passes it to Paul. Paul grabs a tin cup, sets it on\n              the desk...and we see it contains the morphine powder. He\n              pours the cola, swirls it around...\n\n              ANGLE THROUGH COFFEY'S BARS\n\n              ...as Coffey looks up, sensing something happening. He peers\n              up the Mile as Paul walks to:\n\n              BILLY'S CELL\n\n              Billy reaches for the cup, but Paul keeps it out of reach.\n\n                                  PAUL\n                        You gonna stay behaved?\n\n                                  BILLY\n                        C'mon, you clunk, gimme that.\n\n                                  PAUL\n                        You promise me, or I'll drink it\n                        myself right here in front of you.\n\n                                  BILLY\n                        C'mon now, don't be that way. I be\n                        good.\n\n              Paul lets him take the cup. Billy knocks it back, draining it\n              in three huge swallows. He lets out an awesome belch.\n\n                                  PAUL\n                        Cup.\n\n                                  BILLY\n                        We'll break out the fire hose and\n                        take it anyway. And you will have\n                        drunk your last R.C. cola. Unless\n                        they serve 'em down in hell.\n\n              Billy's smile fades. He hands the cup through the bars. Paul\n              takes it, turns and heads back to--\n\n              THE DUTY DESK\n\n              --where Brutal, Harry, and Dean have been watching the entire\n              exchange with their hearts in their throats...\n\n                                                       DISSOLVE:\n\n              ...and we find Billy staring glassy-eyed at the ceiling. He\n              keels over on his bunk. ANGLE to Paul and Brutal stepping to\n              the bars with Harry and Dean.\n\n                                  PAUL\n                        Anybody wants to back out, now's\n                        the time. After this, there's no\n                        turning back.\n                               (off their looks)\n                        So? We gonna do this?\n\n              A voice comes softly from down the way:\n\n                                  COFFEY\n                        Sure. I'd like to take a ride.\n\n              Their heads come slowly around, staring at Coffey in shock.\n\n                                  BRUTAL\n                               (to Paul)\n                        Guess were all in.\n\n              INT. PAUL'S OFFICE - NIGHT\n\n              Percy looks up from his book as the door opens. Paul enters\n              with Brutal and Harry, ominously hemming the desk.\n\n                                  PERCY\n                        What is this?\n\n              Paul pulls the canvas straitjacket from behind his back.\n\n                                  PAUL\n                        Payback.\n\n              Percy jumps up and tries to the execution chamber, but Harry\n              grabs him, spins him back. A wild scuffle ensues as:\n\n                                  PERCY\n                        Let go of me! Let go!\n\n                                  PAUL\n                        Settle down, Percy!\n\n              Percy tries to jerk away, crashes into the desk. The book he\n              was reading falls to the floor--\n\n              --and a \"Tijuana Bible\" is revealed within the pages. It's a\n              pornographic cartoon book of the type popular in the '30's,\n              featuring crude drawings of famous cartoon characters or\n              movie stars engaged in outlandish sexual acts. This one has\n              Olive Oyl getting it doggy-style from Popeye. The word\n              balloon over his head features his famous laugh: \"Uk-uk-uk-\n              uk!\"\n\n                                  BRUTAL\n                        Oooo, Poicy! What would your\n                        mother say?\n\n                                  PERCY\n                        Let go, you ignoramus! I know\n                        people! Big people!\n\n                                  PAUL\n                        So you've said. C'mon, stick out\n                        your arms like a good boy.\n\n                                  PERCY\n                        I won't. And you can't make me.\n\n                                  BRUTAL\n                        You're dead wrong about that, you\n                        know.\n\n              Brutal grabs Percy by the ears, twisting hard. Percy lets out\n              a shriek--not just of pain, but a dismayed understanding that\n              he's not going to bluster his way out of this one.\n\n                                  BRUTAL\n                        You gonna put your arms up? I'll\n                        rip your ears off. Use 'em for tea\n                        caddies. You know I will.\n\n                                  PAUL\n                        The man's ripping your ears off,\n                        Percy. I'd do as he says.\n\n              Percy jerks his arms up before him. They get the straitjacket\n              on him within seconds. Percy turns to Paul on the verge of\n              tears. Softly:\n\n                                  PERCY\n                        Please, Paul. Don't put me in with\n                        Wild Bill. Please.\n\n                                  PAUL\n                        You would think that.\n\n              Paul gives him a hard, angry shove...\n\n              INT. E BLOCK - NIGHT\n\n              ...and they bring him down the Mile to the restraint room\n              door. Brutal takes Percy's holster and baton.\n\n                                  BRUTAL\n                        You'll get 'em back, don't worry.\n\n                                  PERCY\n                        That's more than I can say about\n                        your jobs. All your jobs! You\n                        can't do this to me! You can't!\n\n              Paul steps forward with a roll of strapping tape.\n\n                                  PAUL\n                        Let you in on a little secret. We\n                        can and we are.\n\n              He slaps the tape over Percy's mouth and shoves him back into\n              the restraint room. Percy stands breathing heavily through\n              his nose, making muffled mmmmph-mmmph! sounds under the tape.\n\n                                  PAUL\n                        You're going to have a few hours\n                        of quiet time now, so you can\n                        reflect on what you did to Del.\n\n                                  BRUTAL\n                               (grins)\n                        If you get lonely, think about\n                        Olive Oyl...\n                               (thrusting his hips)\n                        ...uk-uk-uk-uk!\n\n              And they slam the door, shutting Percy into darkness.\n\n              A WALL-MOUNTED GUN SAFE\n\n              is unlocked, shotguns pulled out. The men load up, heading\n              down the Mile as:\n\n                                  PAUL\n                        One more time--what do you say if\n                        somebody comes by?\n\n                                  DEAN\n                        Coffey got upset, so we put him in\n                        the restraint room. They hear any\n                        noise, they'll think it's him.\n\n              They come to Coffey's cell.\n\n                                  COFFEY\n                        We goan for the ride now?\n\n                                  PAUL\n                        That's right.\n\n              The cell is unlocked. Coffey emerges. Paul motions them\n              along, still grilling Dean:\n\n                                  PAUL\n                        What about us?\n\n                                  DEAN\n                        You're over in Admin, going over\n                        Del's file. Brutal and Harry are\n                        in the laundry doing their wash--\n\n              A skinny white arm suddenly shoots out from Wild Bill's cell\n              and grabs Coffey by the wrist. The men gasp, shocked to see\n              Billy on his feet, grinning and weaving like a punch-drunk.\n\n              Coffey's reaction is beyond simple surprise; he's actually\n              trembling at Billy's touch as if some electrical circuit were\n              engaged. His eyes are wide and horrified, as if he'd just put\n              his hand in a basket full of snakes. He tries to pull away,\n              but Billy has him tight, that mysterious circuit blazing.\n\n                                  BILLY\n                               (slurring wildly)\n                        Where you fink you're goin'?\n\n              Coffey responds softly, with utmost horror:\n\n                                  COFFEY\n                        You're a bad man.\n\n                                  BILLY\n                        S'right, nigger. Bad as you'd want.\n\n              Paul plucks Billy's hand off Coffey's arm--and Coffey\n              flinches back as the circuit is broken.\n\n                                  BILLY\n                        Whooeee. Whole room's spinning.\n                        Like I'm shit-ass drunk. I have me\n                        some shine or what?\n\n              He turns and staggers back to his bunk, muttering all the way:\n\n                                  BILLY\n                        Niggers oughtta have they own\n                        'lectric chair. White man oughtn't\n                        havta sit in no nigger 'lectric\n                        chair, nossir...\n\n              He goes face-first onto his bunk. Coffey is still staring.\n\n                                  COFFEY\n                        He's a bad man.\n\n              INT. EXECUTION CHAMBER - NIGHT\n\n              Coffey is brought in...and freezes in horror at the sight of\n              Old Sparky. A whisper:\n\n                                  COFFEY\n                        They're still in there. Pieces of\n                        them, still in there. I hear them\n                        screaming.\n\n              All eyes go to the electric chair. It sits shrouded in shadow\n              like an ominous throne. Never before has this place felt so\n              haunted to the men. It makes the hairs on the neck stand up.\n\n                                  PAUL\n                        John, come along! Right now,\n                        y'hear? C'mon! Toward that door!\n\n              Coffey finally responds, pulling away...\n\n              INT. E BLOCK ACCESS TUNNEL - NIGHT\n\n              ...and they come down the steps. They realize Coffey will\n              have to stoop all the way down the tunnel. Paul pats the\n              gurney.\n\n                                  PAUL\n                        Lie down on this.\n                               (off Coffey's look)\n                        It'll be easier for you and no\n                        harder for us.\n\n              Coffey eases carefully onto the gurney, lying on his back.\n              His knees hang over the edge and his toes touch the ground,\n              but it works. They push him along, traversing the pools of\n              light.\n\n              Coffey actually starts to smile. He reaches out his arms,\n              fingertips touching the tunnel walls as they go by.\n\n                                  COFFEY\n                        Say. This is fun.\n\n              EXT. PRISON WALL - NIGHT\n\n              A massive iron door SQUEALS open onto a little-used fenced\n              enclosure. Paul and the others bring Coffey up from the\n              tunnel below, emerging into the night. Coffey's breath\n              catches as he gazes wondrously up at the stars, pointing:\n\n                                  COFFEY\n                        Look, boss! It's Cassie, the lady\n                        in the rocking chair!\n\n                                  PAUL\n                        Shhh. John, you have to be quiet\n                        now.\n\n                                  COFFEY\n                               (whispering)\n                        You see her? You see the lady?\n\n                                  BRUTAL\n                        We see her, John.\n\n              Harry goes first, hugging the shadows as he pulls his keys to\n              unlock the gate...\n\n              WIDE SHOT OF PRISON\n\n              ...while TOWER GUARDS huddle in their enclosure atop the\n              walls. An occasional SPOTLIGHT cuts the darkness. FIREFLIES\n              dance in the fields and trees as far as the eye can see.\n\n              Four dark figures detach from the shadows, hurrying across\n              the lonely country road into the fields on the far side...\n\n              EXT. WOODS - NIGHT\n\n              Coffey's hand scoops up some fallen leaves. TILT UP to his\n              face as he crunches them under his nose, inhaling their smell.\n\n              He see the guards throwing him anxious looks. He misreads\n              this, holds out his hand so they can smell too. They do it,\n              just to make him happy.\n\n                                  PAUL\n                        C'mon, big boy, keep moving.\n\n              A FEW FIREFLIES come winking through frame as the group\n              presses on...\n\n              ANOTHER AREA/WOODS\n\n              The trees are growing sparser, opening onto fields. MORE\n              FIREFLIES are flitting into view, trailing in their wake...\n\n                                  BRUTAL\n                        How far is it?\n\n                                  HARRY\n                        Just up ahead...\n\n              Harry brings them to a thicket of trees. They start removing\n              branches and boughs, uncovering a battered old FARMALL TRUCK\n              hidden in the brush.\n\n              The men pause. Even more fireflies are swirling around them,\n              growing in number. It's getting downright weird.\n\n              Coffey laughs softly, drawing their attention. A childlike\n              smile has utterly transformed his face. He raises his hand,\n              letting a firefly weave playfully in and out of his fingers.\n\n                                  COFFEY\n                        Hey there, little firefly. Where's\n                        Mrs. Firefly this evening?\n\n              Another firefly joins the first, both now dancing and\n              blinking around his fingers. Coffey laughs again.\n\n                                  COFFEY\n                        Oh, there you is. You come out to\n                        play too?\n\n              The men stand gaping. The fireflies are flitting to Coffey as\n              if to a beacon. He waves his hands slowly, fireflies blinking\n              and trailing from his fingertips like magic dust.\n\n              They begin orbiting his shiny bald head like tiny glowing\n              planet orbiting a sun, their light kicking a mellow sheen off\n              his ebony skin. Coffey's eyes meet Paul's.\n\n                                  PAUL\n                        They seem...drawn to you.\n\n                                  COFFEY\n                        I love 'em, is why. They don't\n                        think no hurtful thoughts. They's\n                        just happy to be. Happy little\n                        lightning bugs...\n\n              The men don't know whether to be enchanted or terrified.\n              Harry gives Paul a look--can we go? Please?\n\n                                  PAUL\n                        C'mon, big boy. Upsy-daisy.\n\n              Coffey clambers up on the stakebed. Paul and Brutal join him.\n              Harry gets in behind the wheel, jabs the starter button...\n\n              ON THE STAKEBED\n\n              ...while Coffey sits with his back to the cab.\n\n                                  PAUL\n                        John? Do you know where we're\n                        taking you?\n\n                                  COFFEY\n                        Help a lady?\n\n                                  PAUL\n                        That's right. Help a lady. But how\n                        did you know?\n\n                                  COFFEY\n                        Dunno. Tell the truth, boss, I\n                        don't know much'a anything. Never\n                        have.\n\n              The truck pulls out. Coffey waves as the fireflies get left\n              behind, dwindling away like stars.\n\n                                  COFFEY\n                        Bye, fireflies. Bye.\n\n              WIDE ANGLE OF COUNTRYSIDE\n\n              The truck rumbles from the fields onto a dirt road, countless\n              fireflies swirling in its wake...\n\n                                                       DISSOLVE TO:\n\n              EXT. MOORES HOUSE - NIGHT\n\n              Headlights come over the rise. The truck appears, rumbling\n              down toward the house. The world is isolated and still.\n\n              IN THE TRUCK CAB\n\n              Harry stops and cuts the engine, leaving the headlights on.\n              Silence now, save for the trilling of crickets.\n\n              IN THE STAKEBED\n\n              Paul and Brutal both look terrified now that they're actually\n              here. An urgent whisper:\n\n                                  BRUTAL\n                        We can still turn back.\n\n              Paul hesitates, wanting to do just that, but:\n\n                                  COFFEY\n                        Boss, look. Someone's up.\n\n              Lights are coming on inside the house. Coffey rises and steps\n              down from the truck, pulling Paul along. Brutal follows them.\n\n                                  BRUTAL\n                        This is a mistake. Christ, Paul,\n                        what were we thinking?\n\n                                  PAUL\n                        Too late now. Harry, keep John\n                        here until we call you.\n\n              Paul and Brutal walk to the front door as the lights inside\n              the house keep clicking on. The last one finally comes on\n              over the stoop, the front door opens a crack...and the twin\n              barrels of a shotgun poke out into the night.\n\n                                  HAL\n                        Who the hell goes there at two-\n                        thirty in the goddamn morning?\n\n                                  PAUL\n                        Hal, it's us! It's Paul and\n                        Brutal--it's us!\n\n              The door swings wider, revealing Hal's face gaunt and haggard\n              in the yellow porch light, stunned to see them:\n\n                                  HAL\n                        Paul, what are you doing here at\n                        this hour? Jesus, it's not a\n                        lockdown, is it? Or a riot?\n\n                                  PAUL\n                        Hal, God's sakes, take your finger\n                        off the trigger...\n\n              Hal doesn't, aiming past them at the truck in the yard.\n\n                                  HAL\n                        Are you hostages? Who's out there?\n                        Who's by that truck?\n\n              Coffey steps into the glare of headlights with Harry tugging\n              on his arm, trying to hold him back. Hal cocks both hammers.\n\n                                  HAL\n                        John Coffey! Halt! Halt right\n                        there or I shoot!\n\n              His aim wavers as a woman's voice comes from upstairs:\n\n                                  MELINDA (O.S.)\n                        Hal? Who are you talking to, you\n                        fucking cocksucker?\n\n              A frozen moment. Hal mortified. Paul gives him a look--is\n              that Melinda?\n\n              Hal's shotgun shifts back to Coffey--but Paul steps in front\n              of the muzzle.\n\n                                  PAUL\n                        No one's hurt. We're here to help.\n\n                                  HAL\n                        Help what? I don't understand. Is\n                        this a prison break?\n\n                                  PAUL\n                        I can't explain what it is. You\n                        just have to trust me.\n\n              Coffey comes up the steps, brushes Paul aside, stops before\n              the warden. Hal blinks, his thoughts suddenly fuzzy--it's\n              that benign hypnotic effect Coffey has.\n\n                                  HAL\n                        What do you...want?\n\n                                  MELINDA\n                        Hal! Make them go away! No\n                        salesmen in the middle of the\n                        night! No Fuller brushes! No\n                        French knickers with come in the\n                        crotch! Tell them to take a flying\n                        fuck in a rolling d...d...\n\n              We hear the sound of GLASS BREAKING, then she begins to sob.\n\n                                  COFFEY\n                               (a whisper)\n                        Just to help. Just to help, boss,\n                        that's all.\n\n                                  HAL\n                        You can't. No one can.\n\n              Coffey pulls the shotgun gently from Hal's grasp, hands it to\n              Paul. Coffey moves past Hal into the house...\n\n              INT. HOUSE - NIGHT\n\n              ...and comes up the hallway toward the stairs.\n\n                                  HAL\n                        Don't you go up there! Don't you\n                        do it!\n\n                                  COFFEY\n                        Boss, you just be quiet now and\n                        let me be.\n\n              Coffey mounts the stairs with the others at his heels,\n              heading up toward that quavering voice:\n\n                                  MELINDA (O.S.)\n                        Stay out of here! Whoever you are,\n                        just stay out! I'm not dressed for\n                        visitors, you rat's asshole!\n\n              INT. BEDROOM - NIGHT\n\n              Coffey enters, trailed by the others. Paul pauses, horrified.\n\n              The woman propped in bed barely resembles Melinda Moores\n              anymore--she looks made up like a Halloween witch, her livid\n              skin hanging in a loose trail of wrinkles, one corner of her\n              mouth twisted. Yellowish bile stains her chin and the front\n              of her nightgown. Her hair has gone white and straw-like, her\n              eyes glowering at Coffey with lively, irrational interest:\n\n                                  MELINDA\n                        Oh, so big! Pull down your pants!\n                        Let's have a look!\n\n              Hal groans with despair. Coffey just stands there for a\n              moment, watching her from a distance, then approaches the\n              bed...\n\n                                  MELINDA\n                        Don't come near me, pigfucker.\n\n              ...but as he draws closer, a change occurs. Her features\n              soften, her eyes become more sane and aware.\n\n                                  MELINDA\n                        Why do you have so many scars? Who\n                        hurt you so badly?\n\n                                  COFFEY\n                        Don't hardly remember, ma'am.\n\n              Coffey sits on the edge of the bed. The lights seem to flare\n              hotter and brighter. Tears are forming in Melinda's eyes.\n\n                                  MELINDA\n                        What's your name?\n\n                                  COFFEY\n                        John Coffey, ma'am. Like the\n                        drink, only not spelt the same.\n\n              She lays back, staring at him with shining fascination. The\n              world seems to be slowing down, growing very still indeed...\n\n              ...and he starts bending slowly toward her.\n\n                                  COFFEY\n                        Ma'am?\n\n                                  MELINDA\n                        Yes, John Coffey?\n\n                                  COFFEY\n                        I see it. I see it.\n\n              He comes closer...closer still...\n\n                                  COFFEY\n                        You be still now. You be so quiet\n                        and so still.\n\n              He brushes her forehead with his lips...the gentlest whisper\n              of a kiss...then moves his mouth down to hers. For a moment\n              we can see one of her eyes staring past him, filling with an\n              expression of surprise...\n\n              ...and then her face is lost to view as Coffey puts his lips\n              on hers. We hear a soft whistling sound as he begins inhaling\n              the air deeply from her lungs. Something hot and glowing\n              starts passing between them, drawn on his breath...\n\n              The men watch. The house seems to shudder in that moment, as\n              if the entire world has shifted an inch to the right...\n\n              DOWNSTAIRS PARLOR\n\n              ...and the grandfather clock stops ticking, the pendulum\n              stopping dead, the glass face cracking neatly up the center...\n\n              BEDROOM\n\n              ...and a windowpane cracks. Then another. A picture falls off\n              the wall. A lightbulb bursts, showering glass.\n\n              Paul smells smoke, realizes the fringed coverlet of the bed\n              has caught fire. Moving like a man in a dream, he reaches for\n              the waterglass on the nightstand, douses the flames.\n\n              Coffey keeps kissing Melinda in that deep and mysterious way,\n              inhaling and inhaling, her hand held in his like a tiny white\n              bird. For a moment we actually hear something screaming, as\n              if some willful imp were being extracted by force...\n\n              ...and then it's over. Coffey raises his head, revealing:\n\n              Melinda's beautiful face. Her mouth no longer droops. Color\n              is coming back to her hair. Her skin is shining with life.\n\n              Coffey regards her raptly for a moment or two, then starts\n              coughing violently.\n\n              He turns away and drops to his knees, hacking like a man in\n              the last stages of tuberculosis.\n\n              Paul and his men are expecting Coffey to spit out the \"bugs\",\n              but he doesn't--he just keeps coughing, deep and hard, barely\n              finding time to snatch in the next breath of air.\n\n              Hal goes to his wife, beyond stunned, sits at her side. She\n              looks back at him with amazement, her face like a dirty\n              mirror that's been suddenly wiped clean.\n\n              John's coughing grows even worse. Brutal drops to his side\n              and slaps his broad, spasming back.\n\n                                  BRUTAL\n                        John! Sick it up! Cough 'em out\n                        like you done before!\n\n              Coffey just keeps retching, eyes watering from the strain,\n              spit flying from his mouth.\n\n                                  BRUTAL\n                        He's choking! Whatever he sucked\n                        out of her, he's choking on it!\n\n              Paul starts toward them. Coffey crawls away, pressing himself\n              into a corner with his face against the wallpaper. He's still\n              making gruesome deep hacking sounds, but getting it under\n              control. He weakly waves Paul off--let me be.\n\n              Paul looks to the bed. Hal sits with Melinda, stroking her\n              brow. Color is blooming in her cheeks even as we watch.\n\n                                  MELINDA\n                        How did I get here? We were going\n                        to the hospital in Indianola,\n                        weren't we? We stopped and you\n                        bought me a packet of posies...\n\n                                  HAL\n                        Shhh. It doesn't matter. It\n                        doesn't matter anymore.\n\n                                  MELINDA\n                        Did I have the X-ray? Did I\n\n                                  PAUL\n                        Yes.\n\n              They both look at him.\n\n                                  PAUL\n                        It was clear. There was no tumor.\n\n              Hal bursts into tears. Melinda sits up, comforting him. Her\n              eyes are drawn to the corner.\n\n                                  MELINDA\n                        Who is that man?\n\n              Coffey is struggling to rise. Brutal does his best to help.\n\n                                  PAUL\n                        John? Can you turn around? Can you\n                        turn around and see this lady?\n\n              Coffey turns. His face is ashen gray, seriously ill.\n\n                                  MELINDA\n                        What's your name?\n\n                                  COFFEY\n                        John Coffey, ma'am.\n\n                                  MELINDA\n                        Like the drink, only not spelled\n                        the same.\n\n                                  COFFEY\n                        No, ma'am. Not spelt the same at\n                        all.\n\n              She pushes the covers aside to rise. Hal tries to stop her...\n\n                                  HAL\n                        Melly, no...\n\n              ...but she pushes his hand gently aside. Hal watches in\n              wonder as she stands, takes a first tentative step...and\n              walks to Coffey. She gazes up and touches his face.\n\n                                  MELINDA\n                        I dreamed of you. I dreamed you\n                        were wandering in the dark, and so\n                        was I. We found each other. We\n                        found each other in the dark.\n\n              She undoes her necklace, holds it up for him. He hesitates,\n              glances to Paul. Paul nods--it's all right. Coffey lowers his\n              head. Melinda affixes the delicate chain around his neck.\n\n                                  MELINDA\n                        It's St. Christopher. I want you\n                        to have it, Mr. Coffey, and wear\n                        it. He'll keep you safe. Please\n                        wear it for me.\n\n                                  COFFEY\n                        Thank you, ma'am.\n\n                                  MELINDA\n                        Thank you, John.\n\n              Her arms go around his neck, hugging him tightly as if she\n              might never let go.\n\n              EXT. MOORES HOUSE - NIGHT\n\n              Paul and the men hustle Coffey out the front door toward the\n              truck, helping him as best they can. He's weak as a baby,\n              knees threatening to give out at any moment.\n\n                                  PAUL\n                        C'mon, John, stay on your feet.\n\n                                  HARRY\n                        Christ, he goes down, we'll need\n                        three mules and a crane to pick\n                        him up again...\n\n              They get Coffey to the truck and throw their backs into it,\n              helping him crawl up onto the stakebed. He rolls over on his\n              back. Harry hops up, covers him with an old blanket. Brutal\n              pulls aside, speaking low:\n\n                                  BRUTAL\n                        He'll never sit in Old Sparky. You\n                        know that, don't you?\n                               (off Paul's look)\n                        He swallowed that stuff for a\n                        reason. I give him a few days. One\n                        of us'll be doing a cell check and\n                        there he'll be. Dead on his bunk.\n\n                                  PAUL\n                        If that's his choice, he's earned\n                        it.\n                               (beat)\n                        Let's get him back on the Mile.\n\n                                                       FADE TO BLACK\n\n              IN BLACKNESS, A TITLE CARD APPEARS:\n\n                                  \"Coffey on the Mile\"\n\n                                                       CUT TO:\n\n              INT. E BLOCK - NIGHT\n\n              Dean starts babbling with relief as they return:\n\n                                  DEAN\n                        Am I glad to see you! You were\n                        gone so long! Wild Bill's making\n                        noises like he's gonna wake up...\n                               (notices Coffey)\n                        What the hell's wrong with him?\n\n                                  BRUTAL\n                        He's hurting, Dean. Hurting bad.\n\n              Dean jumps in, helps them steer Coffey into his cell.\n\n                                  PAUL\n                        John, we're gonna set you on your\n                        bunk now. Ready?\n\n              Coffey nods, sits heavily on the bunk. He lowers his head,\n              breath rasping like a rusted hinge. The guards step out.\n\n                                  DEAN\n                        What about Mrs. Moores? Was it\n                        like the mouse? Was it a...you\n                        know...a miracle?\n\n                                  PAUL\n                        Yes. Yes it was.\n\n              Paul scans their faces. Smiles are traded. An exultant beat.\n\n                                  HARRY\n                        Damn. I think we got away with it.\n\n                                  BRUTAL\n                        We still gotta convince a certain\n                        somebody to keep his trap shut.\n\n                                  PAUL\n                        Get his stuff.\n\n              Dean hurries off to retrieve Percy's holster and baton.\n              Brutal unlocks the restraint room door, swings it open. Percy\n              is revealed sitting against the wall, glaring, his mouth\n              still taped. Paul crouches down. Brutal joins him.\n\n                                  PAUL\n                        I want to talk, not shout. I take\n                        the tape off, you gonna be calm.\n\n              Percy nods. Paul takes hold of the tape, preparing to yank.\n\n                                  BRUTAL\n                        My mother always said if you do it\n                        fast, it won't hurt so much.\n\n              Paul rips the tape off. Percy's eyes water with pain.\n\n                                  BRUTAL\n                        I guess she was wrong.\n\n                                  PERCY\n                        Get me out of this nut-coat.\n\n                                  PAUL\n                        In a minute.\n\n                                  PERCY\n                        Now! Now! Right n--\n\n              Paul slaps him hard, knocks him sideways. Percy looks up,\n              blinking in surprise. Paul grabs him, yanks him back up.\n\n                                  PAUL\n                        You shut up and listen. You\n                        deserved to be punished for what\n                        you did to Del. You'll accept it\n                        like a man, or we'll make you\n                        sorry you were ever born. We'll\n                        tell people how you sabotaged\n                        Del's execution--\n\n                                  PERCY\n                        Sabotaged!\n\n                                  PAUL\n                        --and how you pissed yourself like\n                        a frightened little girl. Yes,\n                        we'll talk, that's a given--but,\n                        Percy, mind me now...we'll also\n                        see you beaten within an inch of\n                        your life.\n\n              Percy blinks, unable to grasp that.\n\n                                  PAUL\n                        We know people, too, are you so\n                        foolish you don't realize that?\n                        People with friends and loved ones\n                        doing time in this prison. People\n                        who'd be happy to amputate you\n                        nose or your penis just so someone\n                        they care about could get an extra\n                        three hours in the exercise yard\n                        every week.\n                               (off Percy's look)\n                        Let bygones be bygones. Nothing's\n                        hurt so far but your pride...and\n                        nobody need ever know about that\n                        except the people in this room.\n\n                                  BRUTAL\n                        What happens on the Mile, stays on\n                        the Mile. Always has.\n\n              A long pause. Softly:\n\n                                  PERCY\n                        May I be let out of this coat now?\n\n              They pull him to his feet, undo the straps. He shrugs out of\n              the straitjacket and adjusts his clothes, trying to maintain\n              a shred of dignity.\n\n                                  PERCY\n                        My things?\n\n              Dean hands them over. Percy smooths his hair and puts his hat\n              on, starts strapping on his holster belt.\n\n                                  PAUL\n                        Think it over, Percy.\n\n                                  PERCY\n                        Oh, I intend to. I intend to think\n                        about it very hard. Starting right\n                        now.\n\n              Percy exits the restraint room. Brutal whispers to Paul:\n\n                                  BRUTAL\n                        He'll talk. Sooner or later.\n\n              Paul nods with weary resignation--yeah, I know.\n\n              ON THE MILE\n\n              Percy pauses near Coffey's cell, careless as always, getting\n              his holster buckled--and a massive black arm grabs him\n              through the bars. His SCREAM brings Paul and the others from\n              the restraint room.\n\n              Coffey's face is pressed so tight between his bars it looks\n              like he's trying to push his head through. He draws his lips\n              back, baring his teeth in an awful sneer...\n\n              Percy whacks him with his baton. Coffey barely seems to feel\n              it. He curls his free hand around the back of Percy's head,\n              pulling him ever closer...\n\n              ...and Percy's screams are muffled as their mouths come\n              together. Coffey begins exhaling as if he'd held his breath\n              for hours. Percy jerks like a fish on a hook, but can't get\n              away. The men jump in, try to pry Percy loose, hollering for\n              Coffey to let him go.\n\n              The black \"insects\" are flowing from Coffey to Percy,\n              swirling into his mouth, up his nose, down his throat.\n\n              Several lightbulbs explode in their steel cages up and down\n              the Mile. Percy's baton drops from his nerveless fingers and\n              clatters to the floor, never to be picked up again.\n\n              And then Coffey steps back, rubbing his mouth as if he's\n              tasted something bad. The color has returned to his skin.\n\n              Percy, however, is ashen gray. His expression is blank as a\n              sheet of paper, not a trace of awareness in his eyes.\n\n              The men are stunned. Paul raises his hand to Percy's face,\n              snaps his fingers. Nothing. He tries again, clapping loudly.\n              Percy reacts slightly, eyes fluttering, swaying a bit.\n\n                                  PAUL\n                        Easy, easy. You all right?\n\n              Percy says nothing. He turns and walks slowly up the Mile,\n              his movements vacant and disjointed. He comes to a swaying\n              stop at Wild Bill's cell...and turns slowly to look in.\n\n              Wild Bill is coming painfully around, groggily clutching his\n              head. He looks up, see Percy.\n\n                                  BILLY\n                        What'a you looking at, you limp\n                        noodle? You wanna kiss my ass or\n                        suck my dick?\n\n              Nothing for the longest moment. Percy just staring...\n\n              ...and then he pulls his gun and empties it into Wild Bill as\n              fast as he can pull the trigger. BAM!BAM!BAM!BAM!BAM!BAM!\n              Bill takes all six rounds in the chest, reeling back across\n              the cell. He hits the wall and slides down, leaving a smear,\n              his face registering a final look of stunned surprise.\n\n              Paul and the other tackle Percy and bring him down, wrestling\n              the gun out of his hand. Dean is almost weeping:\n\n                                  DEAN\n                        Oh God, oh God, no...\n\n              Percy is flat on his back, staring up at nothing. The black\n              \"bugs\" come drifting out of nose and mouth, swirling in the\n              air over his head. They turn white and disappear.\n\n              The men are speechless. Paul turns, sees Coffey sitting on\n              the floor at his bars, watching.\n\n                                  COFFEY\n                        Punished them bad men.\n\n                                  PAUL\n                        Why Wild Bill? Why?\n\n                                  COFFEY\n                        I saw in his heart. When he grab\n                        my arm, I saw what Wild Billy\n                        done. Saw plain as day. Can't hide\n                        what's in your heart.\n\n                                  PAUL\n                        What? Saw what?\n\n              Coffey reaches toward him, straining through the bars.\n\n                                  COFFEY\n                        Take my hand, boss. You see for\n                        yourself.\n\n                                  BRUTAL\n                        Paul, no!\n\n              Paul hesitates, torn between reason and Coffey's pleading\n              eyes. A whisper:\n\n                                  COFFEY\n                        My hand.\n\n              Paul can't help it. He has to. Their hands come together.\n              Paul lurches wildly as that circuit starts blazing between\n              them...\n\n                                  PAUL\n                        No...please...\n\n                                  COFFEY\n                        Gots to, boss. Gots to give you a\n                        little bit of myself. A gift,\n                        like. A gift of what's in me so\n                        you can see...\n\n              ...and Paul sees:\n\n              The Detterick twins. Kathe and Cora. Laughing and playing\n              hopscotch in the dust under a later afternoon sun...\n\n              A dinner table. Family having supper late in the day, basket\n              of biscuits being passed. Twelve year old Howie Detterick\n              taking it, passing it on...\n\n              An hand with a paint brush slopping bright red paint on the\n              side of a barn...\n\n              Kathe skipping to the head of the hopscotch squares, turning\n              and starting back, laughing in the sun...\n\n              The paint brush slopping more paint, dripping like blood...\n\n              Paul jerks and twists, trying to pull away, trying to break\n              the circuit, but he can't, not till all is seen and done:\n\n              Marjorie Detterick calling from the porch for everybody to\n              come eat, supper's ready...\n\n              A hammer pausing. Klaus looking down from atop the barn...\n\n              The Detterick twins finishing their hopscotch, gathering\n              their jump ropes from the dust, running across the yard...\n\n              The basket of biscuits being passed to little Cora, who takes\n              a biscuit and passes it on...\n\n              Klaus coming down the ladder, calling to his daughters. The\n              little girls running past the man with the paint brush, who\n              turns and smile as they go by...it's Wild Bill.\n\n              The basket of biscuits is passed one last time. A hand pulls\n              one out, raises it for a bite. It's Wild Bill, smiling at the\n              little girls as conversation flows around the table...\n\n              Paul screams, trying to pull away, but:\n\n              The porch door is kicked off its hinges just before dawn, a\n              figure looming in the doorway. Kathe wakes, her scream cut\n              short as the man's fist punches her hard in the face...\n\n              Paul trembles violently as if riding the lightning himself,\n              pleading for it to stop, but there's one last thing:\n\n              Wild Bill looms over the terrified little girls like a\n              horrendous boogeyman, whispers to Kathe:\n\n                                  BILLY\n                        You lover your sister? You make\n                        any noise, know what happens? I'll\n                        kill her instead of you.\n                               (to Cora)\n                        And if you make any noise, I'll\n                        kill her.\n\n              And he drags them out into the coming dawn...\n\n              ...as Coffey lets Paul go. Paul is gasping, back in the real\n              world where his men are staring at him with wide eyes.\n\n                                  COFFEY\n                        He kill 'em with they love. They\n                        love for each other. You see how\n                        it is?\n\n              Paul nods, numb. Tears are flowing down Coffey's face. Softly:\n\n                                  COFFEY\n                        That's how it is ever' day. That's\n                        how it is all over the worl'...\n\n                                                       CUT TO:\n\n              WILD BILL\n\n              lies dead, staring with glassy eyes. A FLASHBULB POPS,\n              rimming him with harsh blue light...\n\n              INT. E BLOCK - DAWN\n\n              ...as Hal arrives, wearing his pajama top under his overcoat.\n              He sees the POLICE PHOTOGRAPHER taking pictures. The guards\n              are giving statements to GROUPS OF COPS, everybody murmuring:\n\n                                  DEAN\n                        ...well, I dunno, he just snapped,\n                        I guess...\n\n                                  HARRY\n                        ...s'right, one minute he's fine,\n                        the next--blammo...\n\n                                  BRUTAL\n                        ...bastard grabbed him through the\n                        bars a few days back, scared the\n                        boy so bad he wet himself...\n\n              Hal turns, sees:\n\n              PERCY\n\n              sits handcuffed on the floor of the Mile, eyes glassier than\n              Wild Bill's. TWO COPS are trying to snap him out of it:\n\n                                  COP #1\n                        Son! Son! Can you hear me?\n\n                                  COP #2\n                        Speak up if you can hear us! We\n                        gotta ask you some questions!\n\n              A MEDIC is raising Percy's eyelid with his thumb, shining a\n              penlight, getting no reaction.\n\n                                  MEDIC\n                        I think this boy's cheese slid off\n                        his cracker.\n\n              HAL\n\n              sees Paul, motions him aside to talk privately:\n\n                                  HAL\n                        I'll cover you as much as I can,\n                        even if it mean my job, but I have\n                        to know. Does this have anything\n                        to do with what happened at my\n                        house? Does it, Paul?\n\n              Paul looks Hal in the eye. As with Bitterbuck, the lie comes\n              easy:\n\n                                  PAUL\n                        No.\n\n                                                       DISSOLVE TO:\n\n              INT. HOSPITAL ROOM - DAY\n\n              TRACKING A PAIR OF FEET shuffling into the room in hospital\n              slippers, escorted by TWO ORDERLIES. The patient is brought\n              to a window. The orderlies turn to leave...\n\n              ...and we BOOM UP to reveal Percy, catatonic, staring out the\n              same window where we met Wild Bill...\n\n              EXT. HOSPITAL - DAY\n\n              ...and we WIDEN SLOWLY from Percy at the window to reveal his\n              last stop in life. It's emblazoned on the gate: BRIAR RIDGE\n              MENTAL HOSPITAL. He finally got that transfer.\n\n                                                       CUT TO:\n\n              EXT. PAUL'S HOUSE - DUSK\n\n              TIGHT ON PAUL as softly:\n\n                                  PAUL\n                        It makes sense. I read the file.\n                        Hal even said it himself. Wharton\n                        rambled all over the state last\n                        few years, causing trouble. Hell,\n                        longer than that. Been at it since\n                        he was ten. Vandalism. Petty\n                        theft. Setting fires.\n\n              ANGLE SHIFTS to include Jan, Brutal, Harry and Dean. They're\n              in the brambly patch that borders the woods behind the house.\n              The sun is setting, turning the horizon fiery.\n\n                                  JAN\n                        You saw him. You actually saw this\n                        Wild Bill person take those girls.\n\n                                  PAUL\n                        Their father hired him on for a\n                        few days last spring, help repair\n                        the barn. Cheap labor, just\n                        another drifter...\n\n                                  BRUTAL\n                        Only not.\n\n                                  PAUL\n                        Sick bastard came back a month\n                        later, just before dawn. Took the\n                        girls...did what he did. Coffey\n                        found them afterwards and tried to\n                        help. It was too late.\n\n                                  JAN\n                               (absorbs this)\n                        Then you can stop it. The\n                        execution, I mean. Get Coffey a\n                        new trial.\n\n                                  PAUL\n                        Based on what, honey? Some kind of\n                        magical vision I had?\n\n                                  JAN\n                        Show this farmer--what's his name,\n                        Detterick?--show him a picture of\n                        Wild Bill.\n                               (off their looks)\n                        Why not? If Wharton was there...if\n                        the farmer can identify his\n                        picture and they know he was\n                        there...\n\n                                  BRUTAL\n                        Him being there in May doesn't\n                        mean he came back and killed those\n                        girls in June. Even if he was\n                        committing other crimes.\n\n                                  PAUL\n                        They got their killer as far as\n                        they're concerned.\n\n                        Hell, Coffey's own lawyer would\n                        come throw the switch if we let\n                        him.\n\n                                  JAN\n                        Then lie.\n\n                                  PAUL\n                        Lie? About what?\n\n                                  JAN\n                        Tell them Wharton confessed to the\n                        crime. Brutus, you can back him\n                        up, say you heard it too. You can\n                        say that's what set Percy off. He\n                        shot Wharton because he couldn't\n                        stand thinking of what happened to\n                        those two little girls, it snapped\n                        his mind...\n                               (seeing their looks)\n                        ...what? What now?\n\n                                  DEAN\n                        We never reported anything like\n                        that. We would've, too, everybody\n                        knows it. It's part of our job.\n\n                                  BRUTAL\n                        Besides, confessing don't make it\n                        so. Slugs like Wild Bill lie about\n                        everything. Crimes they committed,\n                        women they had, even the weather.\n\n                                  JAN\n                        But he was there! He painted their\n                        barn! He ate dinner with them!\n\n                                  PAUL\n                        All the more reason he might take\n                        credit for the crime. He's gonna\n                        fry anyway, so why not boast?\n\n              Jan stands thinking for a moment, then:\n\n                                  JAN\n                        All right. Then you've got to get\n                        John Coffey out on your own.\n\n                                  HARRY\n                        Ma'am?\n\n                                  JAN\n                        You did it once, didn't you? Only\n                        this time, don't bring him back.\n\n              Dean blinks, stunned by this notion. Gently:\n\n                                  DEAN\n                        Ma'am, your son's grown up and\n                        moved away. My kids are just\n                        starting kindergarten. Will you be\n                        the one to explain to them why\n                        their daddy's in prison?\n\n                                  JAN\n                        Work out a plan. Make it look like\n                        a real escape.\n\n                                  HARRY\n                        Better be a plan an imbecile could\n                        dream up. Nobody'd believe it\n                        otherwise.\n\n                                  BRUTAL\n                        Even if we did think of something,\n                        it wouldn't do any good.\n\n                                  JAN\n                        Why not? Just why the hell not?\n\n                                  PAUL\n                        Because he's a six-foot-eight-inch\n                        baldheaded black man with barely\n                        enough brains to feed himself. How\n                        long you think it'd be before he\n                        was recaptured? Two hours? Six?\n\n              Jan swipes a tear away with the heel of her hand. Softly:\n\n                                  JAN\n                        Do you mean to kill him, you\n                        cowards? Do you?\n\n              Paul tries to take her hand. She wrenches away, furious.\n\n                                  JAN\n                        Don't touch me! Next week this\n                        time you'll be a murderer, no\n                        better than that man Wharton, so\n                        don't touch me!\n\n              She runs off toward the house, starting to sob as we\n\n                                                       DISSOLVE TO:\n\n              INT  PAUL'S KITCHEN - NIGHT\n\n              Paul is at the kitchen table in the wee hours, at his regular\n              place, sipping his beer. Irving Berlin's \"Remember\" PLAYS\n              SOFTLY on the radio. Jan comes down, looking miserable and\n              exhausted.\n\n                                  JAN\n                        I'm so sorry I called you a\n                        coward. I feel worse about that\n                        than anything I've ever said to\n                        you in our whole marriage.\n\n                                  PAUL\n                        Even that time we went camping and\n                        you called me Old Stinky Sam?\n\n              She can't help smiling at that. He returns the smile, offers\n              her a sip of beer. She takes it, sits.\n\n                                  JAN\n                        Does Hal know? That Coffey's\n                        innocent, I mean?\n                               (Paul shakes his head)\n                        Can he help? Does he have the\n                        influence to do something about\n                        this?\n\n                                  PAUL\n                        No.\n\n                                  JAN\n                        Then don't tell him. If he can't\n                        help, don't tell him. Ever.\n\n                                  PAUL\n                        I won't.\n\n                                  JAN\n                               (beat)\n                        There's no way out of this for\n                        you, is there?\n\n                                  PAUL\n                        No. I've been thinking about it,\n                        too, believe me.\n                               (beat)\n                        Tell you the truth, honey. I've\n                        done some things in my life I'm\n                        not proud of, but this is the\n                        first time I've ever felt in real\n                        danger of hell.\n\n                                  JAN\n                        Hell? Oh Paul...\n                               (touches his face)\n                        Talk to him. Talk to John. Find\n                        out what he wants.\n\n                                                       CUT TO:\n\n              INT. E BLOCK - NIGHT\n\n              Coffey sits quietly in his cell, a solitary firefly flitting\n              in circles around his finger. Paul and the men appear. The\n              firefly flits away, vanishing through Coffey's tiny window.\n\n                                  COFFEY\n                        Hello, boss.\n\n                                  PAUL\n                        Hello, John.\n\n              Brutal unlocks his cell. Paul enters.\n\n                                  PAUL\n                        I guess you know we're coming down\n                        to it now. Another couple of days.\n                               (beat)\n                        Is there anything special you'd\n                        like for dinner that night? We can\n                        rustle you up most anything.\n\n              Coffey gives it some careful thought.\n\n                                  COFFEY\n                        Meatloaf be nice. Mashed taters\n                        with gravy. Okra, maybe. I's not\n                        picky.\n\n                                  PAUL\n                        What about a preacher? Someone you\n                        could say a little prayer with?\n\n                                  COFFEY\n                        Don't want no preacher. You can\n                        say a prayer, if you want. I could\n                        get kneebound with you, I guess.\n\n                                  PAUL\n                        Me?\n\n              Coffey gives him a look--please.\n\n                                  PAUL\n                        S'pose I could, if it came to that.\n\n              Paul sits, working himself up to it:\n\n                                  PAUL\n                        John, I have to ask you something\n                        very important right now.\n\n                                  COFFEY\n                        I know what you gonna say. You\n                        don' have to say it.\n\n                                  PAUL\n                        I do. I do have to.\n                               (beat)\n                        John, tell me what you want me to\n                        do. You want me to take you out of\n                        here? Just let you run away? See\n                        how far you can get?\n\n                                  COFFEY\n                        Why would you do such a foolish\n                        thing?\n\n              Paul hesitates, emotions swirling, trying to find the right\n              words.\n\n                                  PAUL\n                        On the day of my judgement, when\n                        I stand before God, and He asks me\n                        why did I kill one of his true\n                        miracles, what am I gonna say?\n                        That is was my job? My job?\n\n                                  COFFEY\n                        You tell God the Father it was a\n                        kindness you done.\n                               (takes his hand)\n                        I know you hurtin' and worryin',\n                        I can feel it on you, but you\n                        oughtta quit on it now. Because I\n                        want it over and done. I do.\n\n              Coffey hesitates--now he's the one trying to find the right\n              words, trying to make Paul understand:\n\n                                  COFFEY\n                        I'm tired, boss. Tired of bein' on\n                        the road, lonely as a sparrow in\n                        the rain. Tired of not ever having\n                        me a buddy to be with, or tell me\n                        where we's coming from or going\n                        to, or why. Mostly I'm tired of\n                        people being ugly to each other.\n\n                        I'm tired of all the pain I feel\n                        and hear in the world ever' day.\n                        There's too much of it. It's like\n                        pieces of glass in my head all the\n                        time. Can you understand?\n\n              By now, Paul is blinking back tears. Softly:\n\n                                  PAUL\n                        Yes, John. I think I can.\n\n                                  BRUTAL\n                        There must be something we can do\n                        for you, John. There must be\n                        something you want.\n\n              Coffey thinks about this long and hard, finally looks up.\n\n                                  COFFEY\n                        I ain't never seen me a flicker\n                        show.\n\n                                                       CUT TO:\n\n              TIGHT ON COFFEY'S FACE\n\n              gazing with wide-eyed, open-mouthed wonder, the light of a\n              motion picture projector flickering on his skin...\n\n              INT  PRISON AUDITORIUM - NIGHT\n\n              ...while Fred Astaire and Ginger Rogers dance up there on the\n              big screen, images flowing in magical black and silver tone.\n\n                                  FRED ASTAIRE\n                               (singing)\n                        Heaven, I'm in heaven...and my\n                        heart beats so that I can hardly\n                        speak...\n\n              Paul and the men are scattered about in the otherwise empty\n              auditorium, also watching.\n\n              PROJECTION BOOTH\n\n              Toot operates the projector, peering through the tiny window\n              into the theater. He yawns, glances at his watch. Late.\n\n              IN THE AUDITORIUM\n\n              Fred and Ginger are now in the most passionate and graceful\n              part of the dance. Irving Berlin's music swells.\n\n              COFFEY\n\n              can't believe what he's seeing. He's so excited his breath is\n              caught in his throat. Softly:\n\n                                  COFFEY\n                        Why, they's angels. Angels. Just\n                        like up in heaven...\n\n                                                       DISSOLVE TO:\n\n              INT. E BLOCK - NIGHT\n\n              FOUR PAIRS OF FEET come marching up the Green Mile.\n\n              ANGLE ON COFFEY\n\n              Paul appears at the bars with Brutal, Harry, and Dean.\n              Nothing is said. Coffey knows why they're here. He rises as\n              Brutal unlocks the cell, slides the door open. Coffey steps\n              out, looks around at their dazed and sad faces.\n\n                                  COFFEY\n                        I be all right, fellas. This\n                        here's the hard part. I be all\n                        right in a little while.\n\n              Paul indicates St. Christopher medal around John's neck:\n\n                                  PAUL\n                        John, I should have that just for\n                        now. I'll give it back after.\n\n              John lets him take the necklace. Paul pockets it. They start\n              to walk the Mile as:\n\n                                  COFFEY\n                        You know, I fell asleep this\n                        afternoon and had me a dream. I\n                        dreamed about Del's mouse.\n\n                                  PAUL\n                        Did you, John?\n\n                                  COFFEY\n                        I dreamed he got down to that\n                        place Boss Howell talked about,\n                        that Mouseville place. I dreamed\n                        there was kids, and how they\n                        laughed at his tricks! My!\n\n              He laughs at the memory of it, then grows more serious:\n\n                                  COFFEY\n                        I dreamed those two little blonde-\n                        headed girls were there. They 'us\n                        laughing, too. I put my arms\n                        around 'em and sat 'em on my\n                        knees, and there 'us no blood\n                        comin' outta their hair and they\n                        'us fine. We all watch Mr. Jingles\n                        roll that spool, and how we did\n                        laugh. Fit to bus', we was.\n\n              Behind them, Dean stifles a sob.\n\n              PAUL'S INNER OFFICE\n\n              Coffey kneels. Paul joins him, self-conscious and uncertain.\n\n                                  PAUL\n                        What should we pray for, John?\n\n                                  COFFEY\n                        Strength?\n\n              Paul nods--strength it is. Dean surprises Brutal and Harry by\n              also kneeling. Brutal and Harry hesitate...then join them.\n\n                                  PAUL\n                        God, please help us finish what\n                        we've started, and please welcome\n                        this man, John Coffey--like the\n                        drink, but not spelled the same--\n                        into heaven and give him peace.\n                        Please help us to see him off the\n                        best we can and let nothing go\n                        wrong. Amen.\n\n              Paul starts to rise, but Coffey takes his hand.\n\n                                  COFFEY\n                        I know a prayer I once heard. Can\n                        I say it?\n\n                                  PAUL\n                        You go right ahead, John. Take all\n                        the time you need.\n\n              Coffey closes his eyes, frowning in deep concentration.\n\n                                  COFFEY\n                        Baby Jesus, meek and mild, pray\n                        for me...\n\n              And Paul sees:\n\n              Kathe and Cora Detterick kneeling together in the enclosed\n              porch that night, just before their bedtime:\n\n                                  KATHE AND CORA\n                        ...and every child. Be my\n                        strength, be my friend...\n\n              And then the vision is gone as:\n\n                                  COFFEY\n                        ...be with me until the end. Amen.\n\n              Coffey rises, offers Paul his hand, helps him up.\n\n              EXECUTION CHAMBER\n\n              Full house tonight. Bill Dodge is waiting at Old Sparky.\n\n              Silence as Coffey is led in, all eyes on him. Klaus and\n              Marjorie Detterick are in the front row. She mutters:\n\n                                  MARJORIE\n                        Die slow, you bastard.\n\n              COFFEY\n\n              is faltering as Paul and Brutal bring him to the chair.\n\n                                  COFFEY\n                        They's a lot of folks here hate\n                        me. A lot. I can feel it. Like\n                        bees stinging me. It hurts.\n\n                                  BRUTAL\n                        Feel how we feel, then. We don't\n                        hate you--can you feel that?\n\n              Coffey tries to take comfort in it, but flinches as:\n\n                                  MARJORIE\n                        Kill him twice, you boys! You go\n                        on and kill that raping baby-\n                        killer twice, that'd be fine!\n\n              She dissolves into tears. Klaus pulls her against his\n              shoulder, looking dazed by the whole thing.\n\n              Paul and Brutal turn John around, sit him down. Paul notices\n              Dean crying again, his back to the witnesses. They kneel to\n              apply the leg clamps, while Brutal and Harry secure the arms.\n\n                                  PAUL\n                        Wipe you face before you stand up,\n                        Dean.\n\n              Dean nods, wiping his face with the sleeve of his coat. They\n              rise, stepping back. This time, Paul's out front:\n\n                                  PAUL\n                        Roll on one.\n\n              Van Hay cranks the generator. The lights flare hotter and\n              brighter. It's just like in Melinda's bedroom the night\n              Coffey cured her with a kiss. Airless and bright, dreamlike.\n\n                                  MARJORIE\n                        Does it hurt yet? I hope it does!\n                        I hope it hurts like hell!\n\n                                  PAUL\n                        John Coffey...you have been\n                        condemned to die in the electric\n                        chair by a jury of your\n                        peers...sentence imposed by a\n                        judge in good standing in this\n                        state. Do you have anything to say\n                        before sentence is carried out?\n\n              John hesitates, nods.\n\n                                  COFFEY\n                        I'm sorry for what I am.\n\n                                  MARJORIE\n                        You ought to be! Oh, you monster,\n                        you damn well ought to be!\n\n              Brutal takes the mask from the hook to draw it over Coffey's\n              head. Coffey looks to Paul with terrified, pleading eyes.\n\n                                  COFFEY\n                        Please, boss, don't put that thing\n                        over my face. Don't put me in the\n                        dark, I's afraid of the dark.\n\n                                  PAUL\n                        All right, John.\n\n              Brutal puts the mask back, proceeds with the sponge.\n\n              IN TIGHT ANGLES\n\n              The cap is lowered, the straps drawn. Coffey is breathing\n              fast, terrified, muttering under his breath:\n\n                                  COFFEY\n                        ...heaven...I'm in heaven...\n                        heaven...heaven...heaven...\n\n              THE WITNESSES\n\n              sit and wait, barely breathing.\n\n              JACK VAN HAY\n\n              is poised at the switch, wondering why the order won't come.\n\n              PAUL\n\n              is staring at Coffey, unable to say the words.\n\n                                  BRUTAL\n                               (whispers)\n                        Paul. You have to say it. You have\n                        to give the order.\n\n              Paul can't. He reaches out and touches Coffey's hand. Their\n              fingers clasp. In that moment, staring into his eyes, Paul\n              hears the last thought that ever goes through Coffey's head:\n\n                                  COFFEY\n                               (whispered V.O.)\n                        He kill 'em with they love. That's\n                        how it is ever' day. All over the\n                        worl'...\n\n              Their fingers disengage. Paul steps back, eyes still locked\n              with Coffey's, and says the hardest words he's ever spoken:\n\n                                  PAUL\n                        Roll on two.\n\n              Van Hay throws the switch. Coffey surges forward, fingers\n              splayed and jittering past Old Sparky's arms.\n\n              Lights begin blowing out all over the Mile, raining shattered\n              glass and sparks. Some of the witnesses scream.\n\n              A thin line of blood comes trickling out of Klaus Detterick's\n              nose. He reaches up, absently wipes it away.\n\n              Coffey's eyes are locked on Paul's, riding the lightning all\n              the way. He finally slumps. Van Hay kills the current.\n\n              Coffey's expression is peaceful, as if sleeping. A final pair\n              of tears drift gently down his cheeks.\n\n                                                       CUT TO:\n\n              INT. ACCESS TUNNEL - NIGHT\n\n              Paul ever so carefully replaces the St. Christopher's medal\n              around Coffey's neck. They wheel him down the tunnel.\n\n                                                       CUT TO:\n\n              INT. PAUL'S MODEL T - NIGHT\n\n              Paul drives home, his heart numb.\n\n              EXT. PAUL'S HOUSE - NIGHT\n\n              Paul pulls in, cuts the engine. He sits for a moment, then\n              gets out and heads for the house.\n\n              The door opens. Jan steps out in her nightgown and robe to\n              meet him on the stairs. She takes him in her arms.\n\n              Paul can't hold it back anymore. He breaks down sobbing\n              against her as we\n\n                                                       DISSOLVE TO:\n\n              INT. NURSING HOME SUNROOM - PRESENT DAY\n\n              It's late in the day as:\n\n                                  PAUL\n                        That was the last execution I ever\n                        took part in. Just couldn't do it\n                        anymore after that. Brutal either.\n                        We both transferred out, took jobs\n                        with Boys' Correctional.\n                               (beat, nods)\n                        That was all right. Catch 'em\n                        young, that became my motto. Might\n                        even have done some good.\n\n              ANGLE SHIFTS TO Elaine listening. Uncertain.\n\n                                  PAUL\n                        You don't believe me.\n\n                                  ELAINE\n                        I don't imagine you would lie to\n                        me, Paul. It's just that...\n\n                                  PAUL\n                        ...It's quite a story.\n\n                                  ELAINE\n                        Yes. Quite a story.\n                               (pause)\n                        One thing I don't understand. You\n                        said you and Jan had a grownup son\n                        in 1935. Is that right?\n                               (Paul nods)\n                        But if that's true...\n\n                                  PAUL\n                        The math doesn't work, does it?\n\n              She shakes her head. Paul thinks for a moment, comes to a\n              decision.\n\n                                  PAUL\n                        You feel up to a walk?\n\n                                                       CUT TO:\n\n              EXT. GEORGIA PINES - DAY\n\n              The rain has mostly stopped. Brad Dolan, back in street\n              clothes, gets in his pickup truck and drives away...\n\n              INT. NURSING HOME - DAY\n\n              ...while Paul and Elaine watch from a window.\n\n              EXT. GEORGIA PINES - DAY\n\n              This time, we see two red specks trudging slowly up the ridge\n              toward the treeline.\n\n                                                       CUT TO:\n\n              EXT. WOODS - DAY\n\n              Paul brings Elaine along the wooded path into view of the\n              storage shacks. They're both wearing ponchos.\n\n                                  PAUL\n                        There. It's in there.\n\n                                  ELAINE\n                        Paul? This thing you want to show\n                        me. Is it scary?\n\n                                  PAUL\n                        Scary? No. Not really.\n\n              He gives her a smile, offers his hand. She takes it.\n\n              INT. SHACK - DAY\n\n              We see Paul approach through the grimy window as before, this\n              time bringing Elaine. ANGLE SHIFTS to the door as they\n              arrive, creaking open on rusty hinges to reveal them.\n\n              They enter. Elaine looks around at the musty nooks and\n              crannies, wondering what they're doing here. Paul touchers\n              arm, directs her attention:\n\n                                  PAUL\n                        There.\n\n              Elaine moves closer, sees it on the dusty floorboards:\n\n              An old cigar box.\n\n              For a moment, she doesn't know what to make of it.\n\n                                  PAUL\n                        Hey. Wake up, old boy. Wake up.\n\n              Elaine's breath catches in her throat...\n\n              ...as a pair of bright oilspot eyes peer over the edge of the\n              cigar box. It's a mouse. His fur, once brown, is now all gray.\n\n                                  ELAINE\n                        Paul? It isn't...it can't be...\n\n              Paul gets down on the floor, holds out his hand.\n\n                                  PAUL\n                        Come over here, boy. Come on over\n                        her and see this lady.\n\n              The mouse tries several times to get over the side of the\n              cigar box before he finally makes it. He comes to them,\n              hobbling and crippled with arthritis. Paul pulls a slice of\n              toast from his pocket, breaks off a small piece for the mouse.\n\n                                  ELAINE\n                        That can't be Mr. Jingles.\n\n              Paul says nothing, just pulls a spool from his pocket. Mr.\n              Jingles might be old, but he's as obsessed as ever. He gets\n              ready to fetch, eyes riveted to the spool. Softly:\n\n                                  PAUL\n                        Messieurs et mesdames. Beinvenue\n                        au cirque du mousie.\n\n              Paul tosses the spool. The mouse limps painfully after it. He\n              reaches it, goes around...and has to lay down to catch his\n              breath. Elaine starts forward, but Paul holds her back.\n\n              After a moment, Mr. Jingles finds his feet again. He rises\n              and starts nosing the spool back to Paul.\n\n                                  ELAINE\n                        Oh, Paul. Don't make him do it\n                        again. I can't bear to watch.\n\n                                  PAUL\n                               (softly)\n                        But he loves it so much.\n\n              He glances around at the shack with a sad smile.\n\n                                  PAUL\n                        This isn't exactly the Mouseville\n                        we had in mind...but we make do,\n                        don't we, old fella?\n\n                                  BRAD (O.S.)\n                        As I live and breathe!\n\n              They gasp and spin. Brad Dolan stands in the doorway.\n\n                                  BRAD\n                        Fooled you, didn't I Got yourself\n                        a little love nest here, I see...\n\n              He pauses, seeing Mr. Jingles.\n\n                                  BRAD\n                        ...what the fuck? Is that a mouse?\n\n                                  PAUL\n                        Don't hurt him, okay? Okay?\n\n                                  BRAD\n                        It's a goddamn mouse, y'old fool,\n                        they carry all kind'a disease...\n\n              Brad grabs an old garden hoe--the blade's rusted, but still\n              sharp enough to cut a mouse in two.\n\n                                  BRAD\n                        ...now step aside.\n\n              Paul rushes in front of Brad, fists clenched, yelling:\n\n                                  PAUL\n                        You leave him alone, Percy! You\n                        leave him alone, or by God I'll--\n\n              Brad gives Paul a hard shove, pins him against the wall.\n\n                                  BRAD\n                        Who you calling Percy? Name's\n                        Brad, you senile fucker. And I'm\n                        gonna nail that mouse, you can\n                        take that to the everfucking bank.\n\n              Elaine is suddenly at Brad's elbow, seething with fury:\n\n                                  ELAINE\n                        How dare you? Get out!\n\n                                  BRAD\n                        Piss off, you wrinkeldy old bitch.\n                        Me and Paulie are talking.\n\n                                  ELAINE\n                        His name is Mr. Edgecomb. If you\n                        ever call him Paulie again, your\n                        days of employment at Georgia\n                        Pines will end.\n\n                                  BRAD\n                        Who the hell you think you are?\n\n                                  ELAINE\n                        I am the grandmother of the man\n                        who is currently Speaker of the\n                        Georgia House of Representatives.\n                        A man who loves his relatives, Mr.\n                        Dolan. All it would take is a\n                        phone call.\n\n              Brad's smile falters. Elaine steps closer.\n\n                                  ELAINE\n                        At first I thought I'd let you be.\n                        I'm old, and that seemed easiest.\n                        But when my friends are threatened\n                        and abused, I do not let it be.\n                               (icy beat)\n                        Now get out, or you won't work\n                        another day here. Not another\n                        hour. I swear it.\n\n              Brad eases his grip on Paul...and backs off.\n\n                                  BRAD\n                        Don't know what you're getting so\n                        het up about. Just a damn mouse.\n\n                                  ELAINE\n                        Get out, you ignorant man. What\n                        little mind you have is ugly and\n                        misdirected.\n\n              Brad flushes red, heads for the door. He pauses.\n\n                                  BRAD\n                        Don't bother coming back here\n                        tomorrow...Mr. Edgecomb Gonna be\n                        a new lock on this door. This is\n                        off-limits to residents, no matter\n                        what Mrs. My Shit Don't Stink has\n                        to say about it.\n\n              And off he goes. Paul tries to control the shaking in his\n              hands, looks to Elaine.\n\n                                  ELAINE\n                        Little trick I learned from Percy\n                        Wetmore.\n\n                                  PAUL\n                        Is your grandson really Speaker of\n                        the House?\n\n                                  ELAINE\n                        He is.\n\n              Paul bends down, picks Mr. Jingles up.\n\n                                  PAUL\n                        You gonna thank the lady? She just\n                        saved your old mousie hide.\n\n              The mouse stretches his neck forward, nose twitching,\n              smelling Paul's breath. Paul looks to Elaine. Softly:\n\n                                  PAUL\n                        I think Mr. Jingles happened by\n                        accident. I think when we\n                        electrocuted Del, and it all went\n                        so badly...well, John could feel\n                        it, you know...and I think a tiny\n                        part of whatever was inside of him\n                        just leapt out...\n                               (beat)\n                        Me, I was no accident. John had to\n                        give me a little part of\n                        himself...a gift, like...so I\n                        could see for myself what Wild\n                        Bill had done. When John did that,\n                        a part of whatever power worked\n                        through him spilled into me.\n\n                                  ELAINE\n                        He...what? Infected you with life?\n\n              Paul looks at the mouse, strokes him gently between the ears.\n\n                                  PAUL\n                        That's as good a word as any. He\n                        infected us both, didn't he, Mr.\n                        Jingles. With life.\n                               (beat)\n                        I'm a hundred and five years old,\n                        Elaine. I was forty the year John\n                        Coffey walked the Green Mile.\n\n                                  ELAINE\n                        ...oh my God...\n\n              CAMERA PUSHES SLOWLY IN on Paul as:\n\n                                  PAUL\n                        I haven't even had a cold since\n                        1935. I've had to watch my friends\n                        and loved ones die off through the\n                        years...Hal and Melinda...Brutus\n                        Howell...my wife...my son...\n                               (beat)\n                        ...and you, Elaine. You'd die,\n                        too, and my curse is knowing I'll\n                        be there to see it...\n\n                                                       DISSOLVE TO:\n\n              INT. FUNERAL HOME - DAY\n\n              Paul, dressed in a dark suit, comes up the aisle. ANGLE\n              SHIFTS to reveal Elaine Connelly lying in the open casket.\n\n                                  PAUL (V.O.)\n                        ...that's my punishment, you see?\n                        My punishment for letting John\n                        Coffey ride the lightning...for\n                        killing a miracle of God...\n\n              Paul lays a rose atop the casket.\n\n                                  PAUL (V.O.)\n                        ...you'll be gone, like all the\n                        others, and I'll have to stay...\n\n              EXT. CEMETERY - DAY\n\n              Paul stands at the graveside as the casket is lowered.\n\n                                  PAUL (V.O.)\n                        I'll die eventually, I imagine. I\n                        have no illusions of immortality.\n                        But I will have wished for death\n                        long before death finds me.\n\n              He turns and walks away.\n\n                                  PAUL (V.O.)\n                        In truth, I wish for it already.\n\n              INT. E BLOCK - NIGHT(1935)\n\n              Empty and silent. Young Paul walks the Mile alone, listening\n              to the quiet. He pauses, seeing something. A whisper:\n\n                                  PAUL\n                        Mr. Jingles?\n\n              It is Mr. Jingles. The little mouse is peering from under the\n              restraint room door. He's come home, looking bedraggled. Paul\n              bends down, gently picks him up.\n\n                                  PAUL\n                        Where you been, boy? I've been\n                        worried about you. You hungry?\n\n              Paul turns and head back up the Green Mile, carrying the\n              mouse cupped in his hands as we\n\n                                                       MATCH DISSOLVE TO:\n\n              INT. NURSING HOME - DAY\n\n              Young Paul transforms into Old Paul in the dissolve, the\n              corridor of the Green Mile becoming the corridor of the\n              nursing home. He's walking along, holding the little mouse\n              the same way he did over sixty years ago.\n\n                                  PAUL (V.O.)\n                        I lie in bed most nights, thinking\n                        about it. And I wait...\n\n                                                       DISSOLVE TO:\n\n              INT. PAUL'S BEDROOM - NIGHT\n\n              Paul lies awake, staring at the moon outside his window.\n\n                                  PAUL (V.O.)\n                        I think about all the people I've\n                        loved, now long gone.\n\n                        I think about my beautiful Jan,\n                        and how I lost her so many years\n                        ago. I think about all of us\n                        walking our own Green Mile, each\n                        in our own time. But one thought,\n                        more than any other, keeps me\n                        awake most nights...\n                               (beat)\n                        ...if he could make a mouse live\n                        so long, how much longer do I have?\n\n              He looks over at the nightstand...\n\n                                  PAUL (V.O.)\n                        We each owe a death, there are no\n                        exceptions, but sometimes, oh God,\n                        the Green Mile is so long...\n\n              ...and WE PAN to reveal Mr. Jingles sleeping fitfully in his\n              cigar box, chasing that spool in his dreams as we\n\n                                                       FADE OUT:\n\n              --------------------------------------------------------------\n\n\n\n\nGreen Mile, The\nWriters :   Stephen King  Frank Darabont\nGenres :   Drama  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:16.162195"}