{"title": "Grifters, The", "film_link": "/Movie Scripts/Grifters, The Script.html", "script_link": "/scripts/Grifters,-The.html", "info_raw": "\n\nGrifters, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Donald E. Westlake\nGenres  Crime  Drama\nScript Date : March 1989\n\nRead \"Grifters, The\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nGRIFTERS - by Donald E. Westlake\n\n\n\t\t\t\t\tGRIFTERS\n\t\t\t\tby Donald E. Westlake\n\n\t\t\t   Based on the novel by Jim Thompson. \n\n\t\t\t\t\t\t\tSecond Draft. \t\n\t\t\t\t\t\t\tMarch 1989\n-----------------------------------------------------------------------\n\n\tFADE IN:\n\t\n\tEXT. RUIDOSO DOWNS - DAY\n\t\n\tAN ANGLE establishing the race track, Ruidoso Downs\n\t(pronounced Ree-oh-do-so), set among the beautiful mountains\n\tof New Mexico's Lincoln National Forest, as a white Chrysler\n\tturns in with a stream of cars moving toward the parking\n\tarea.\n\t\n\tAN ANGLE through the open driver-side window of the Chrysler\n\tat LILLY DILLON, 39 but looking younger, beautiful but cold\n\tand watchful.\n\t\n\tWIDE SHOT, track in b.g. as Lilly parks the Chrysler, gets\n\tout, locks the car. As she walks toward the track, WIPE\n\tRIGHT, as SCENE TWO WIPES IN from the left. SCENE ONE CAMERA\n\tFOLLOWS Lilly as she walks across the large parking area.\n\tSPLIT SCREEN.\n\t\n\tSCENE TWO:\n\t\n\tEXT. SIDE STREET - DAY\n\t\n\tDowntown Los Angeles, near the courts and the business\n\tsection. ROY DILLON, 25, handsome and charming but self\n\tindulgent, parks his orange Honda convertible, gets out,\n\tpicks up a large ledger book from the back seat, goes around\n\tto open the trunk.\n\t\n\tAN ANGLE on the trunk, establishing the tools of the\n\tsalesman's trade: catalogs, samples, ledgers full of manuals\n\tand product sheets. Roy adds the ledger from the back seat,\n\tshuts the trunk, walks away.\n\t\n\tEXT. 6TH STREET - DAY\n\t\n\tRoy walks around the corner near a bar/restaurant. As he\n\tapproaches it, WIPE LEFT, the two half-width scenes\n\tcontracting to one-third each as SCENE THREE WIPES IN from\n\tthe right.\n\t\n\tSCENE ONE: Lilly approaches the track's entrance doors.\n\t\n\tSCENE TWO: Roy approaches the bar.\n\t\n\tSCENE THREE:\n\t\n\tEXT. SANTA MONICA BOULEVARD - DAY\n\t\n\tA baby blue Cadillac parks in front of a jeweler.\n\t\n\tAN ANGLE on the driver's door as MYRA LANGTRY, 36, beautiful\n\tin an impersonal calculating way, gets out, carrying a small\n\tjewelry care, and locks the car. At first glance, Myra looks\n\trather like Lilly. (Myra always wears large dangly earrings,\n\tand usually wears big-lensed dark sunglasses.)\n\t\n\tSIMULTANEOUSLY:\n\t\n\tSCENE ONE: Lilly enters the track.\n\t\n\tSCENE TWO: Roy enters the bar.\n\t\n\tSCENE THREE: Myra enters the jeweler's.\n\t\n\tWIPE RIGHT AND LEFT, as SCENE TWO takes FULL SCREEN.\n\t\n\tINT. BAR - DAY\n\t\n\tAN ANGLE on a hurried bartender in a full bar, crowded with a\n\tNOISY lunchtime crowd. In b.g., Roy slithers his way to the\n\tbar, waving a bill in the air to attract the bartender's\n\tattention.\n\t\n\tAN ANGLE on Roy as the bartender comes to him. Roy puts the\n\tbill on the bar, holding it down with one finger, as he\n\tSHOUTS his order. The bartender looks down.\n\t\n\tBARTENDER'S POV: Roy's finger holds down a twenty dollar\n\tbill.\n\t\n\tAN ANGLE steep over Roy's shoulder, the twenty visible, as\n\tthe bartender hurries away to get the drink. Roy's hand makes\n\ta fist, swallowing the twenty, opens, pushing a ten out onto\n\tthe bar, holding it there with one finger.\n\t\n\tAN ANGLE on the bartender returning with a draft beer,\n\tnodding to other ORDERS shouted to him along the way, putting\n\tthe beer down, grabbing the bill without looking at it,\n\thurrying away.\n\t\n\tAN ANGLE on Roy, content, smiling, sipping his beer.\n\t\n\tAN ANGLE on the bartender, hurrying by, slapping Roy's change\n\tdown, moving on, Roy nodding acknowledgement, reaching out.\n\t\n\tCU, the change, a ten dollar bill on top. Roy's hand closes\n\tover it.\n\t\n\tEXT. TOTE BOARD - DAY\n\t\n\tWIDE SHOT, the tote board at the track, showing the shifting\n\todds on the horses for the next race, the amounts bet.\n\t\n\tCLOSE SHOT, number 3. Not much bet, odds 70-1.\n\t\n\tEXT. RUIDOSO DOWNS - DAY\n\t\n\tAN ANGLE on Lilly, frowning at the tote board. She carries a\n\tlarge heavy shoulder-bag, which she opens, looking in it as\n\tthough it were a file drawer.\n\t\n\tAN ANGLE on Lilly studying the contents of her bag, the track\n\tbeyond her, the mountains visible out beyond the track wall.\n\tLilly moves.\n\t\n\tAN ANGLE on a high-dollar betting window, as Lilly\n\tapproaches, taking bank-banded wads of bills from her bag.\n\t\n\tEXT. TOTE BOARD - DAY\n\t\n\tA change of numbers sweeps across the board.\n\t\n\tEXT. RUIDOSO DOWNS - DAY\n\t\n\tLilly moves away from the betting window, tucking betting\n\ttickets into her bag.\n\t\n\tECU, Lilly's bag, compartmented, with stacks of money, small\n\tenvelopes and notes on notepaper in each compartment. Lilly\n\tcarefully files the betting slips.\n\t\n\tAN ANGLE on Lilly looking out at the tote board.\n\t\n\tEXT. TOTE BOARD - DAY\n\t\n\tCU, number 3. Odds 32-1.\n\t\n\tEXT. RUIDOSO DOWNS - DAY\n\t\n\tAN ANGLE on Lilly, not satisfied. She turns and goes back.\n\t\n\tAN ANGLE at the betting window as Lilly arrives and makes\n\tmore bets.\n\t\n\tEXT. TOTE BOARD - DAY\n\t\n\tCU, number 3. Odds 32-1. CROWD NOISE INCREASES. The numbers\n\tshift: odds 26-1.\n\t\n\t                    CALLER (O.S.)\n\t          And they're off!\n\t\n\tINT. JEWELER'S OFFICE - DAY\n\t\n\tVery quiet, stately; abrupt contrast with the track. A slow\n\tticking clock.\n\tMyra sits in the client's chair, while at the desk sits the\n\tJEWELER, a pleasant but overweight man of 40, who studies a\n\tjeweled bracelet through a loupe. He sighs, drops the loupe,\n\tshakes his head regretfully.\n\t\n\t                    JEWELER\n\t          Mrs. Langtry, I'm sorry.\n\t\n\t                    MYRA\n\t          Why? What's wrong?\n\t\n\t                    JEWELER\n\t              (personal emotion mixed\n\t               in)\n\t          You are a valued customer, as you\n\t          know.\n\t\n\t                    MYRA\n\t          But what's wrong?\n\t\n\t                    JEWELER\n\t          I can't understand a thing like\n\t          this. It's something you almost\n\t          never see.\n\t\n\t                    MYRA\n\t          What is?\n\t\n\t                    JEWELER\n\t              (holding up bracelet)\n\t          This is some of the finest\n\t          filigreed platinum I've ever seen.\n\t          But the stones, no. They're not\n\t          diamonds, Mrs. Langtry.\n\t\n\t                    MYRA\n\t          But they must be! They cut glass!\n\t\n\t                    JEWELER\n\t              (wry)\n\t          Glass will cut glass, Mrs. Langtry.\n\t          Do you know where it was purchased?\n\t\n\tINT. HOTEL ROOM - DAY\n\t\n\tAn expensive hotel room, with a sunstruck day beyond the\n\twindows. Myra, naked, a few years younger, sits cross-legged\n\ton the bed and laughs at COLE \"FARMER\" LANGLEY, 55, stringy\n\tbodied, who stands naked, his back to us, hands on hips,\n\tpresenting himself to Myra. She reaches forward, hand hidden\n\tby his body as she lifts something that was hanging on\n\tsomething at the front of him. She brings back the bracelet,\n\tlooks at it, is delighted, puts it on, and then leans forward\n\tagain toward the unmoving Cole, her head hidden by his body.\n\t\n\tINT. JEWELER'S OFFICE - DAY\n\t\n\t                    MYRA\n\t          It was a gift. It isn't worth\n\t          anything at all?\n\t\n\t                    JEWELER\n\t              (warm, encouraging)\n\t          Why, of course it is. I can offer\n\t          you -- well, five hundred dollars.\n\t\n\tMyra expected -- and needed -- a lot more. She's worried,\n\ttense, but stuck. She nods.\n\t\n\t                    MYRA\n\t          All right.\n\t\n\t                    JEWELER\n\t              (rising)\n\t          I'll get you a check.\n\t\n\tHe leaves the room. Myra grimaces, in almost physical pain.\n\t\n\tINT. SECOND BAR - DAY\n\t\n\tAnother crowded lunchtime bar. A big beefy BARTENDER moves\n\tquickly, carrying a draft beer.\n\t\n\tAN ANGLE on Roy, in position, finger holding bill down, as\n\tthe bartender arrives, puts down the beer, reaches for the\n\tbill, stops, stares at the bill.\n\t\n\tTWO SHOT, the bartender and Roy, as the bartender gives Roy a\n\tvery cold look. He knows, and Roy knows he knows. Roy tries\n\tan innocent smile, which doesn't work. Roy moves.\n\t\n\tCU, the ten dollar bill, as Roy grabs it, but the bartender\n\tsimultaneously grabs Roy's wrist.\n\t\n\tAN ANGLE on Roy and the bartender as Roy tries to pull away\n\tand the bartender holds him with his left hand while reaching\n\tunder the bar with his right. He comes up with a sawed-off\n\tbaseball bat. Roy, seeing it, throws his free arm up to\n\tprotect his head, but the bartender pushes the blunt end of\n\tthe bat straight across the bar at a downward angle and hard\n\tinto Roy's solar plexus, driving the air out of him and\n\tpropelling him back away from the bar, leaving the ten. The\n\tnearest CUSTOMERS on both sides become aware that something\n\thappened, but nothing follows and they're already involved in\n\tconversations. The bartender scoops up the ten as he puts the\n\tbat away under the bar.\n\t\n\tAN ANGLE on Roy, arms folded across his torso, staring in\n\tshock toward the bar, where the space he filled has already\n\tbeen closed in by other bodies. Nearly retching, he stumbles\n\ttoward the door.\n\t\n\tEXT. RUIDOSO DOWNS - DAY\n\t\n\tAN ANGLE on four PEOPLE at a table, CHEERING a race,\n\tswitching to disgust and despair when they lose, moving away\n\tfrom the table, leaving their betting tickets behind. Lilly\n\tpasses by, smoothly and casually scoops up the tickets, moves\n\ton along a row of tables, and there finding more tickets.\n\t\n\tINT. JEWELER'S OFFICE - DAY\n\t\n\tMyra sits as before. The jeweler enters with a check, which\n\the hands her. She looks up at him, making no move to leave.\n\t\n\t                    JEWELER\n\t          I hope you're not too badly\n\t          disappointed with us, Mrs. Langtry.\n\t\n\t                    MYRA\n\t          It's not your fault.\n\t\n\t                    JEWELER\n\t          You'll give us an opportunity to\n\t          serve you again, I hope. If there's\n\t          anything you think we might be\n\t          interested in...\n\t\n\t                    MYRA\n\t          I have only one thing now. Are you\n\t          interested?\n\t\n\t                    JEWELER\n\t          Well, I'd have to see it, of\n\t          course.\n\t\n\t                    MYRA\n\t          You are seeing it. You're looking\n\t          right at it.\n\t\n\tThe jeweler is puzzled, then startled.\n\t\n\t                    JEWELER\n\t          I see.\n\t\n\tHe turns away, goes behind his desk, sits down, looks at\n\tMyra.\n\t\n\t                    JEWELER\n\t          You know something, Mrs. Langtry? A\n\t          bracelet like that very rarely\n\t          happens. A fine setting and\n\t          workmanship usually mean precious\n\t          stones. It always hurts me when I\n\t          find they're not. I always hope -- \n\t              (faint sad friendly smile)\n\t          -- I'm mistaken.\n\t\n\tMyra likes him better now, even though he hasn't solved her\n\tproblem. She rises.\n\t\n\t                    MYRA\n\t          Thank you. For everything you felt\n\t          you could do.\n\t\n\tEXT. STREET - DAY\n\t\n\tRoy has been throwing up but is finished now. He's sprawled\n\tlike a shot deer across the hood of his Honda, still\n\tclutching his stomach. A police car stops, the passenger COP\n\tgets out. He's suspicious at first.\n\t\n\t                    COP\n\t          Sir? Everything all right?\n\t\n\tThe sight of the uniform forces Roy into gear. He\n\tstraightens, smiling through his pain.\n\t\n\t                    ROY\n\t          Getting better. A bad shrimp, I\n\t          think.\n\t\n\tThe con's suspicion changes to concern.\n\t\n\t                    COP\n\t          Want us to take you to a doctor?\n\t\n\t                    ROY\n\t          No no, I'm fine now, thanks,\n\t          anyway. Still got a lot of clients\n\t          to see.\n\t\n\t                    COP\n\t          Take it easy, now.\n\t\n\t                    ROY\n\t          Oh, I will.\n\t\n\tEXT. RUIDOSO DOWNS - DAY\n\t\n\tLate afternoon. AN ANGLE on the parking area, where almost\n\tall the cars are gone and the few remaining are widely\n\tseparated. The white Chrysler is one of these. Lilly walks to\n\tit from the track entrance.\n\t\n\tAN ANGLE on the Chrysler as Lilly opens the trunk, puts her\n\tbag inside.\n\t\n\tCLOSE UP, Lilly and the trunk. She takes betting tickets from\n\ther bag, sorts them, files them in envelopes in different\n\tcompartments, puts some to one side, then sorts through these\n\tseparated tickets, throwing some away, keeping some. She\n\ttakes money from the bag, puts tickets in, closes the bag\n\twith the money on the trunk floor. Reaching farther in, she\n\tlifts the pad deep inside the trunk, lifts the metal floor\n\tpanel, and reveals a cache mostly filled with money. She adds\n\ttoday's skim, puts everything away, puts the bag back on her\n\tshoulder, closes the trunk.\n\t\n\tEXT. MADERO APARTMENTS - DAY\n\t\n\tA shabby apartment hotel on Wilshire. An exterior hall\n\tbalcony on each floor has the entrance doors to the front\n\tapartments. Roy's Honda makes the turn and enters the\n\tbasement garage.\n\t\n\tINT. MADERO LOBBY - DAY\n\t\n\tModest but clean. The owner, SIMMS, a sloppy garrulous old\n\tbore, talks with a potential RENTER.\n\t\n\t                    SIMMS\n\t          Put it this way, now. Say I rent to\n\t          a woman, well, she has to have a\n\t          room with a bath. I insist on it,\n\t          because otherwise she's got the\n\t          hall bath tied up all the time,\n\t          washing her goddamn hair and her\n\t          clothes and everything she can\n\t          think of.\n\t\n\tIn b.g., Roy, still in pain, comes out of the elevator, waves\n\tto Simms, who waves back without pausing in his monologue,\n\tand crosses to the mailboxes.\n\t\n\t                    SIMMS\n\t          Now, your minimum for a room with\n\t          bath is three hundred a month, just\n\t          for a place to sleep and no cooking\n\t          allowed.\n\t          And just how many of these tootsies\n\t          make that kind of money and have to\n\t          eat in restaurants and buy clothes\n\t          and --\n\t\n\tRoy, carrying his junk mail and pretending not to be in pain,\n\tcrosses to Simms.\n\t\n\t                    ROY\n\t          Mr. Simms.\n\t\n\t                    SIMMS\n\t              (fawning)\n\t          Why yes, Mr. Dillon. Here's a\n\t          potential new neighbor, looking at--\n\t\n\t                    ROY\n\t              (uninterested)\n\t          Uh-huh. Mrs. Langtry may drop by.\n\t\n\tSimms doesn't like Mrs. Langtry, but can't say so.\n\t\n\t                    SIMMS\n\t          I'll send her right up.\n\t\n\tRoy goes back to the elevator. Simms continues his monologue.\n\t\n\t                    SIMMS\n\t          I had my first hotel thirty-seven\n\t          years ago in Wichita Falls, Texas,\n\t          and that's where I began to learn\n\t          about women. They just don't make\n\t          the money, you see, not regular\n\t          they don't, and there's only one\n\t          way they can get it.\n\t\n\tRoy enters the elevator.\n\t\n\t                    SIMMS\n\t          Now, that Mr. Dillon there, that's\n\t          the fine type of person I have in\n\t          mind for here. Like yourself, I\n\t          have no doubt. He's a salesman,\n\t          regular as clockwork, has a suite\n\t          here. Fine man. Now, about these\n\t          women. At first, you know, they\n\t          just go out and do it now and then,\n\t          just enough to make ends meet. But\n\t          pretty soon they got that bank open\n\t          twenty-four hours a day, and then\n\t          you've got trouble. Hookers and\n\t          hotellin' just don't mix.\n\t          You'd think the cops'd be too busy\n\t          catching real criminals, not\n\t          snooping around after working\n\t          girls, but that's the way the gravy\n\t          stains, as the saying is, and I\n\t          don't fight it. An ounce of\n\t          prevention is my motto.\n\t\n\tMyra enters from the front, looks across at Simms, points\n\tupward. Simms calls to her.\n\t\n\t                    SIMMS\n\t          Oh, yes, Mrs. Langtry, he's up\n\t          there, he's expecting you.\n\t\n\tMyra crosses to the elevator. Simms speaks more softly.\n\t\n\t                    SIMMS\n\t          If you keep out the women in the\n\t          first place, see, you keep out the\n\t          hookers, and then you keep out the\n\t          cops, and that's how you have a\n\t          clean place.\n\t\n\tEXT. ROY'S APARTMENT - DAY\n\t\n\tAN ANGLE along the balcony, with Roy's apartment door in f.g.\n\tand Los Angeles in b.g. Myra crosses to the door, opens it\n\twith her key, enters.\n\t\n\tINT. BATHROOM - DAY\n\t\n\tA small crowded old-fashioned bathroom. Roy, shirt open and\n\ttrousers pushed down almost to his crotch, looks in the\n\tmirror at purplish greenish bruises on his stomach. He\n\ttouches his stomach, winces.\n\t\n\t                    MYRA (O.S.)\n\t          Roy?\n\t\n\tHe looks at the door, then grins at his reflection.\n\t\n\t                    ROY\n\t          Your medicine is here.\n\t\n\tHe leaves the bathroom.\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tHotel furniture, shabby and anonymous. On the walls,\n\tcontrasting with everything else, are two crying-clown\n\tpictures on black velvet, mounted in big boxy frames. Myra\n\tstands in the middle of the room, and Roy enters, shirt and\n\ttrousers still disarranged.\n\t\n\t                    MYRA\n\t              (amused by clothing)\n\t          Well, well. In a real hurry, are\n\t          we?\n\t\n\t                    ROY\n\t          Always, for you, baby.\n\t\n\tHe reaches for her, but she playfully holds him off.\n\t\n\t                    MYRA\n\t          You aren't taking me for granted,\n\t          are you?\n\t\n\t                    ROY\n\t          Taking you for granite?\n\t\n\tHe grins, as his fingertip prods her breast.\n\t\n\t                    ROY\n\t          That isn't granite. If that fell on\n\t          me, it wouldn't hurt at all.\n\t\n\t                    MYRA\n\t              (playing along)\n\t          Are you sure?\n\t\n\t                    ROY\n\t              (pulling her close)\n\t          Let's find out.\n\t\n\tEXT. HIGHWAY PHONE BOOTH - DAY\n\t\n\tLilly's white Chrysler is parked next to an open-air phone.\n\tTraffic whizzes by. Lilly talks on the phone, with pen and\n\tnotebook at the ready. The racetrack is visible in the b.g.\n\t\n\t                    LILLY\n\t          I'm done here. Do I come back to\n\t          Baltimore?\n\t\n\tINT. OFFICE - DAY\n\t\n\tIt could be an expensive, if gaudy, lawyer's office.\n\tBaltimore harbor is visible past the windows. IRV, the\n\taccountant, sits at a desk covered -- but neatly covered --\n\twith ledgers, computer printouts, etc. He speaks on the\n\tphone.\n\t\n\t                    IRV\n\t          Bobo wants you to go on to Delmar.\n\t\n\tINTERCUT PHONE BOOTH AND OFFICE\n\t\n\t                    LILLY\n\t          Delmar? I never go out to\n\t          California. That's a thousand miles\n\t          from here.\n\t\n\t                    IRV\n\t          Nine hundred. Bobo needs somebody\n\t          to handle playback this time. Come\n\t          on, Lilly, you don't argue with\n\t          Bobo.\n\t\n\t                    LILLY\n\t              (fatalistic)\n\t          I know.\n\t\n\t                    IRV\n\t          Take two, three days. Call when you\n\t          get there.\n\t\n\t                    LILLY\n\t          Maybe I'll swing around Los Ang\n\t          gleez on the way.\n\t\n\tThis is Lilly making the best of the situation. She listens a\n\tbit more, GRUNTS a farewell, hangs up, moves to her car.\n\t\n\tINT. BEDROOM - DAY\n\t\n\tAgain, anonymous hotel furniture. Roy and Myra naked in bed,\n\the on his back, she straddling him, both moving gently. He's\n\thalf feeling pleasure, half unconscious.\n\t\n\t                    MYRA\n\t          Roy?\n\t\n\t                    ROY\n\t          Mm?\n\t\n\t                    MYRA\n\t          Look at me.\n\t\n\t                    ROY\n\t          Oh, I am, baby, believe me.\n\t\n\t                    MYRA\n\t          Roy? It this all we have?\n\t\n\t                    ROY\n\t          All? It ain't bad.\n\t\n\t                    MYRA\n\t          No more than this? \n\t\n\tHe tries to concentrate on her.\n\t\n\t                    ROY\n\t          What are you talking abut, Myra?\n\t          Marriage?\n\t\n\t                    MYRA\n\t          I didn't say that. You aren't\n\t          marriage material.\n\t\n\tHe keeps watching her, ironic, hips moving. Looking for a\n\tdistraction, she notices the bruise on his stomach.\n\t\n\t                    MYRA\n\t          What's that?\n\t\n\tShe touches it; he flinches back, in real pain.\n\t\n\t                    ROY\n\t          Ow! Hey, what are you trying to do,\n\t          throw me off my game?\n\t\n\t                    MYRA\n\t              (laughing)\n\t          No, baby. Come to Mama.\n\t\n\tShe folds forward onto him. He puts his arms around her. They\n\trock together slowly.\n\t\n\tEXT. MOTEL - DAY\n\t\n\tThe same mountains in b.g. as at the track. Lilly carries two\n\tsmall bags from her motel room, puts them on the back seat of\n\tthe Cadillac, gets behind the wheel, drives away.\n\t\n\tINT. BATHROOM - DAY\n\t\n\tMyra, dressed, primps at the mirror, surveys herself\n\tcritically, is reasonably satisfied, leaves.\n\t\n\tINT. BEDROOM - DAY\n\t\n\tRoy lies supine on the bed, semi-conscious, half-covered by a\n\tsheet. Myra, casual, not noticing his condition, leans her\n\thead in through the doorway.\n\t\n\t                    MYRA\n\t          Wore you out, did I? It's a good\n\t          woman you can't keep down, baby.\n\t\n\tHe moves fitfully, CROAKS an attempt at speech.\n\t\n\t                    MYRA\n\t          Have a good sleep, baby. Call you\n\t          tomorrow. \n\t\n\tHe sits up, trying to grin and be easy.\n\t\n\t                    ROY\n\t          Wait'll next year.\n\t\n\tAN ANGLE across Roy's profile, with open bedroom door beyond\n\thim. Through it, the living room and outer door can be seen.\n\tMyra crosses the living room, opens the door. Bright sunlight\n\tpours in, emphasizing the sweat on his face. She closes the\n\tdoor, and he gives up trying to smile. Gingerly, he touches\n\this bruised stomach, winces.\n\t\n\t                    ROY\n\t          Damn that guy.\n\t\n\tHe's going to get out of bed, but movement creates pain. He\n\tsits back against the headboard, looks around, reaches\n\tpainfully to the bedside table drawer, takes a quarter from\n\tit, studies the quarter, feels it with fingertips, places it\n\ton the back of his left hand, slowly moves the soft pads of\n\this right palm over it, then turns the quarter over and\n\trepeats. Then he takes the quarter in his right hand, flips\n\tit, slaps it down onto the back of his left hand, SPEAKS\n\tsimultaneously with the hands coming together.\n\t\n\t                    ROY\n\t          Smack.\n\t\n\tHe looks away, right hand moving minimally on left hand.\n\t\n\t                    ROY\n\t          Heads.\n\t\n\tHe lifts the right hand, nods, then flips the coin again,\n\tlooks away, moves the right hand slightly.\n\t\n\t                    ROY\n\t          Heads.\n\t\n\tAgain he's right. Again he repeats.\n\t\n\t                    ROY\n\t          Tails.\n\t\n\tHe's about to repeat when a wave of weakness comes over him.\n\tHe sits back, gasping, but won't acknowledge the problem.\n\tHe forces himself to flip the coin, misses catching it, finds\n\tit on the blanket, flips it again, slaps it onto the back of\n\tthe other hand, looks away.\n\t\n\t                    ROY\n\t          Tails.\n\t\n\tRight again. He prepares to flip the coin, but then his hand\n\tsags onto the covers, his chin drops, his eyes glaze.\n\t\n\t                    ROY\n\t              (whispered)\n\t          How much can I bet?\n\t\n\tINT. PASSENGER TRAIN - DAY\n\t\n\tThe train runs through a forest, tree shadows making a light\n\tand-dark pattern. Roy, four or five years younger, sits with\n\ta three-core-monte gang, consisting of a DEALER, a spectacled\n\tSHILL beside him, Roy facing the dealer, a ROPER next to Roy.\n\tOn a briefcase on the dealer's lap are three cards, face up:\n\tAn ace and two deuces. Across the aisle, alone in the seats,\n\tsits MINTZ, a conman in his fifties, pretending not to watch,\n\tbut watching with amusement.\n\t\n\t                    DEALER\n\t          That's between you two. I got\n\t          nothing at stake here, I'm just\n\t          dealing.\n\t\n\t                    SHILL\n\t          What if we both guess wrong? You\n\t          aren't gonna take...\n\t\n\tThe dealer turns aside, allowing himself to be distracted. He\n\tand the shill ARGUE nonsensically. The roper nudges Roy, then\n\treaches out and crimps the ace. Roy's doing a wide-eyed\n\tbumpkin kid; he stares at the roper in delight and amazement.\n\t\n\tAN ANGLE on the shill, arguing with the dealer but looking\n\ttoward Roy and the roper, then increasing the force of his\n\targument.\n\t\n\tAN ANGLE across the amused Mintz at the roper whispering to\n\tRoy.\n\t\n\tTWO SHOT, Roy and the roper.\n\t\n\t                    ROPER\n\t          We got him now! Put down that big\n\t          bill you got.\n\t\n\t                    ROY\n\t              (whispered)\n\t          The fifty or the hundred?\n\t\n\t                    ROPER\n\t          The hundred! Hurry!\n\t\n\t                    ROY\n\t              (doubtful)\n\t          The ace is what I want?\n\t\n\tThe roper's having trouble keeping his patience.\n\t\n\t                    ROPER\n\t          Sure it is!\n\t\n\tTWO SHOT, the dealer and the shill, fake-squabbling, Roy and\n\tthe roper seen in b.g. between their faces, Roy finally\n\tbringing out his wallet, withdrawing a bill. Relieved, the\n\tdealer and the shill cut the crap.\n\t\n\tAN ANGLE on the group as Roy puts his hundred dollar bill on\n\tthe briefcase.\n\t\n\t                    ROY\n\t          Is that okay?\n\t\n\tThe shill pulls a messy wad of bills from his inner pocket,\n\tuses most of it to cover the bet.\n\t\n\t                    SHILL\n\t          You're damn right that's okay.\n\t\n\t                    DEALER\n\t              (picks up the cards)\n\t          Whoever finds the ace, wins.\n\t\n\tECU, the dealer's hands, shuffling the cards at lightning\n\tspeed. He deals the cards out face down.\n\t\n\tINT. BEDROOM - DAY\n\t\n\tCU, Roy's sweat-covered face, eyelids fluttering.\n\t\n\t                    ROY\n\t              (whispered)\n\t          Dark in here.\n\t\n\tINT. PASSENGER TRAIN - DAY\n\t\n\tAN ANGLE on the group. Roy squints at the cards, light and\n\tdark playing on his face.\n\t\n\t                    ROY\n\t          Too dark. I just can't see.\n\t\n\tCasually, but too quickly to be stopped, he reaches across\n\tand plucks the shill's glasses off.\n\t\n\t                    ROY\n\t          Let me borrow these, will you?\n\t\n\tAN ANGLE across Mintz, surprised and amused, at the group in\n\tb.g., in consternation as Roy puts on the glasses and looks\n\tdown at the cards.\n\t\n\t                    ROY\n\t          Now, that's better.\n\t\n\tROY'S POV: The glasses are 'readers.' Through them, a large\n\tgray 'A' can be seen on the back of one of the non-crimped\n\tcards. Roy's hand reaches out and flips it over. It's the ace\n\tof spades.\n\t\n\tINT. BEDROOM - DAY\n\t\n\tAN ANGLE across Roy toward the doorway. Roy, eyes closed,\n\tsmiles in triumph, then winces in pain. Mintz partially\n\tappears, hovering beside the bed, grinning at Roy.\n\t\n\t                    MINTZ\n\t          I didn't teach you that.\n\t\n\t                    ROY\n\t              (whispered)\n\t          You taught me a lot. Then I\n\t          invented.\n\t\n\tINT. AIRPORT DEPARTURE LOUNGE - DAY\n\t\n\tWeary bored people sit around waiting. Roy, 17, lugging a big\n\tsuitcase, walks through, takes a seat near Mintz, who's doing\n\tcard tricks for his own pleasure. Roy watches, then moves\n\tcloser.\n\t\n\t                    ROY\n\t          Let me see how you did that one.\n\t\n\t                    MINTZ\n\t          Scram. Go home.\n\t\n\t                    ROY\n\t          I can't. I just left home.\n\t\n\t                    MINTZ\n\t          You're too young. You should be in\n\t          school.\n\t\n\t                    ROY\n\t          I am in school.\n\t\n\tMintz peers at him, taking an interest. Then he holds up the\n\tfive of spades, shows it to Roy, puts it back in the deck,\n\tshuffles, shows Roy the deck.\n\t\n\t                    MINTZ\n\t          Where's the five?\n\t\n\t                    ROY\n\t          In your other hand.\n\t\n\tMintz grins slowly, turns his hand over with the palmed card\n\tshowing.\n\t\n\tINT. BEDROOM NIGHT\n\t\n\tRoy slumps, eyes closed, half-smiling, with the fever Mintz\n\thovering. Roy's smile fades, his fluttering eyelids grow\n\tstill, his face slack. The fever Mintz fades and disappears.\n\t\n\tEXT. HIGHWAY - DAY\n\t\n\tAN ANGLE on a large sign indicating \"Los Angeles\" straight\n\tahead. CAMERA PANS DOWN and around 180 degrees to face the\n\tseveral lanes of heavy Los Angeles-bound traffic. LONG BEAT.\n\tHundreds of cars rush by. CAMERA PANS with Lilly's white\n\tChrysler as it comes along in the stream.\n\t\n\tAN ANGLE through the Chrysler's left side window at Lilly,\n\tdriving, concentrating, biting her left thumbnail. She\n\tbecomes aware that's what she's doing, shakes her head in\n\tirritation: She's trying to break herself of this habit.\n\tOstentatiously she tucks the thumb into her fist, rests the\n\tfist on top of the steering wheel, where she can keep an eye\n\ton it.\n\t\n\tHIGH ANGLE on the westbound lanes. The Chrysler passes. Soon\n\tit's out of sight among all the other cars. LONG BEAT.\n\t\n\tINT. BEDROOM - DAY\n\t\n\tAN ANGLE across the unmoving unconscious Roy toward the\n\tdoorway. The apartment door beyond the living room opens,\n\tthrowing light on Roy, who doesn't react. Lilly enters, in\n\tsilhouette, closes the door, crosses toward the bedroom.\n\t(Until she speaks, we can't be quite sure who this is. With\n\tthe similarity between herself and Myra, this could be Myra.)\n\t\n\t                    LILLY\n\t              (hesitant)\n\t          Roy?\n\t\n\tNo reaction. Lilly, getting worried, moves closer, through\n\tthe bedroom doorway.\n\t\n\t                    LILLY\n\t          Roy? You asleep?\n\t\n\tHis head moves slightly. He barely has strength to speak.\n\t\n\t                    ROY\n\t          Myra?\n\t\n\tShe moves forward to the side of the bed, only her torso IN\n\tFRAME. She touches a hand to his forehead.\n\t\n\t                    LILLY\n\t              (startled)\n\t          My God!\n\t\n\tShe turns, hurries back to the living room, looks around for\n\tthe phone, crosses to it, dials, SPEAKS. Roy's eyes open, he\n\tfrowns.\n\t\n\t                    ROY\n\t          Lilly?\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tLilly, hard and fast and urgent, on the phone.\n\t\n\t                    LILLY\n\t          Tell the doctor I work for Bobo\n\t          Justus, and this is an emergency.\n\t          Don't worry, he knows who Bobo is.\n\t\n\tINT. BEDROOM - DAY\n\t\n\tAN ANGLE down toward Roy, from above, he's weak but troubled.\n\tEyes closed, frowning, whispering.\n\t\n\t                    ROY\n\t          Go away, Lilly. Go away.\n\t\n\tRoy's eyes close. He looks dead. SLOW FADE.\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tThe DOCTOR, a nervous heavyset man in his fifties, a drinker\n\tfrom the look of him, is on the phone in b.g., while Lilly\n\tprowls the room, looking at everything with distaste, then\n\tstopping to frown at the box-framed clown pictures. She\n\tdoesn't get it. She touches one of the pictures, trying to\n\tunderstand. The doctor hangs up, turns to Lilly.\n\t\n\t                    DOCTOR\n\t              (lugubrious)\n\t          The ambulance is on the way, for\n\t          what good it will do.\n\t\n\t                    LILLY\n\t          What? He's going to be all right!\n\t\n\t                    DOCTOR\n\t          Mrs. Dillon, your son was in some\n\t          sort of accident. He's had an\n\t          internal hemorrhage, he's bleeding\n\t          to death inside.\n\t\n\t                    LILLY\n\t          Well, make it stop!\n\t\n\t                    DOCTOR\n\t          His blood pressure is under a\n\t          hundred. I don't think he'll live\n\t          to get to the hospital.\n\t\n\t                    LILLY\n\t              (icy, stern)\n\t          You know who I work for.\n\t\n\tHe's uncomfortable, wants to dismiss that part of his life.\n\t\n\t                    DOCTOR\n\t          Yes, yes, but that's --\n\t\n\t                    LILLY\n\t          My son will be all right. If he\n\t          isn't, I'll have you killed.\n\t\n\tThe doctor stares at her in astonishment, then in belief.\n\tSOUND of ambulance siren. To break the moment, he crosses to\n\tthe door, opens it. Light bathes Lilly. The doctor steps back\n\tacross the threshold, waiting for the ambulance. He looks\n\tback at Lilly, who stares at him.\n\t\n\tINT. AMBULANCE - DAY\n\t\n\tECU, Roy, skin pallid, eyes closed and sunken, lips white.\n\tSOUND of siren LOUDER. SOUND SEGUES to CHILD CRYING. CRYING\n\tFADES.\n\t\n\tINT. HOTEL LOBBY - DAY\n\t\n\tA clumsy slum hotel fifteen years ago, with a tiny lobby, the\n\tDESK CLERK at a half-door in one wall. Lilly, at 24, enters\n\tfrom the street. This is a definite hooker, with bright\n\tmaroon hair and a black-and-white miniskirt. She stops\n\twordlessly at the desk for her key.\n\t\n\t                    CLERK\n\t              (handing key)\n\t          Your kid's in the back here. He's\n\t          crying.\n\t\n\t                    LILLY\n\t          Roy? He's always crying.\n\t\n\t                    CLERK\n\t              (sympathetic to Roy)\n\t          The kids beat him up, because his\n\t          home life is, uh, different.\n\t\n\t                    LILLY\n\t              (ironic)\n\t          I like you, too.\n\t\n\tThe clerk shrugs. He doesn't like this tough broad. He turns\n\tand calls back into his office.\n\t\n\t                    CLERK\n\t          Roy, your mother's here.\n\t\n\tRoy, 10, comes reluctantly out to Lilly, sniffling and\n\trubbing his arm.\n\t\n\t                    LILLY\n\t          So what's your story today?\n\t\n\t                    ROY\n\t          They twisted my arm.\n\t\n\t                    LILLY\n\t              (laughing lightly)\n\t          Only one arm?\n\t\n\tHe tries not to cry, and shows her a space between his teeth.\n\t\n\t                    ROY\n\t          They knocked out my tooth!\n\t\n\t                    LILLY\n\t          Only one tooth?\n\t\n\tRoy's frustrated, unhappy, having nowhere else to turn.\n\t\n\t                    ROY\n\t          You always say that!\n\t\n\tLilly won't take him seriously, but she relents enough to\n\tstop teasing him, and to pat his head, ignoring how he\n\tflinches away.\n\t\n\t                    LILLY\n\t          Come on, kid, let's see if there's\n\t          any food in the house.\n\t\n\t                    CLERK\n\t              (there's no food)\n\t          Hah.\n\t\n\tLilly gives him a jaundiced look, walks Roy to the stairs and\n\tup. The clerk, scornful but sexually interested, watches her\n\tgo.\n\t\n\tINT. HOSPITAL ROOM - DAY\n\t\n\tECU, Roy in a hospital bed, with more color in his face,\n\tbreathing more normally. He begins to react to the sound of\n\tpeople speaking.\n\t\n\t                    MYRA (O.S.)\n\t          No, really, you're Roy's mother?\n\t          That's impossible!\n\t\n\t                    LILLY (O.S.)\n\t          Not quite. But I'm not sure who you\n\t          are, Mrs... Langtry, was it?\n\t\n\tRoy's eyes open, he looks toward the voices.\n\t\n\t                    MYRA (O.S.)\n\t          I'm Roy's friend.\n\t\n\tWIDE SHOT, Lilly and Myra facing one another across the foot\n\tof Roy's bed, in a two-bed hospital room. (The OLD MAN in the\n\tother bed sleeps through the scene.) Neither woman is yet\n\taware that Roy's awake. Lilly looks Myra up and down, with\n\tobvious contempt.\n\t\n\t                    LILLY\n\t          Yes. I imagine you're lots of\n\t          people's friend.\n\t\n\tMyra moves one pace to the side, studying Lilly's face.\n\t\n\t                    MYRA\n\t          Oh, of course, now that I see you\n\t          in the light, you're plenty old\n\t          enough to be Roy's mother.\n\t\n\t                    LILLY\n\t              (sweet smile)\n\t          Aren't we all?\n\t\n\t                    ROY\n\t              (very weak, but amused)\n\t          Play nice. Don't fight.\n\t\n\tThe women, startled, both move toward Roy, one on each side\n\tof the bed.\n\t\n\tTHREE SHOT, Myra and Lilly both leaning over to look down at\n\tRoy's sleepy face.\n\t\n\t                    MYRA\n\t          Darling!\n\t\n\t                    LILLY\n\t          Roy. You're going to be all right.\n\t\n\t                    ROY\n\t          Sure I am. What made you turn up,\n\t          after all these years?\n\t\n\t                    LILLY\n\t          I'm working down in San Diego. Just\n\t          for a few weeks.\n\t              (awkward laugh)\n\t          Thought I'd drop in on my long-lost\n\t          son.\n\t\n\t                    ROY\n\t              (cold)\n\t          Nice to see you.\n\t              (turns to Myra)\n\t          What am I doing in here?\n\t\n\t                    MYRA\n\t          You were bleeding inside, honey.\n\t          Remember that bruise you had?\n\t\n\t                    ROY\n\t          You called the doctor, huh?\n\t\n\t                    MYRA\n\t              (reluctant)\n\t          Well, no, Roy. Your mother found\n\t          you.\n\t\n\t                    ROY\n\t              (tossing It away)\n\t          Oh, yeah?\n\t              (very casual, to Lilly)\n\t          Thanks.\n\t              (back to Myra)\n\t          How long do they say I'm in here?\n\t\n\tMyra's willing to fight with Lilly, but Roy's attitude toward\n\this mother makes her uncomfortable.\n\t\n\t                    MYRA\n\t          Roy... Your mom saved your life.\n\t\n\tRoy turns his head, gives Lilly an ironic smile. Lilly waits,\n\tholding herself in.\n\t\n\t                    ROY\n\t          Yeah? Only one life?\n\t\n\tShe nods, accepting that, but then responds.\n\t\n\t                    LILLY\n\t          Second time I gave it to you.\n\t\n\tRoy gives her a cold smile, then turns to Myra for the ironic\n\texplanation.\n\t\n\t                    ROY\n\t          I was kind of... inconvenient...\n\t          for Lilly.\n\t\n\tLilly has nothing but contempt for Myra. To be humiliated in\n\tfront of Myra -- and by her son -- is the worst thing that\n\tcould happen to her. She makes as dignified an exit as she\n\tcan.\n\t\n\t                    LILLY\n\t          Well... You're all right now, I\n\t          guess. I have to get down to the\n\t          track.\n\t\n\t                    ROY\n\t              (reluctant, but it's\n\t               necessary)\n\t          Thanks, uh, Lilly.\n\t\n\t                    LILLY\n\t              (awkward laugh)\n\t          Don't mention it.\n\t\n\t                    ROY\n\t          I guess I owe you my life.\n\t\n\t                    LILLY\n\t              (faint smile)\n\t          You always did.\n\t\n\tLilly exits. Myra looks after her, curious.\n\t\n\t                    MYRA\n\t          \"Down to the track?\"\n\t\n\tRoy will not talk about this, with anyone. His response is\n\tcold, closing the subject.\n\t\n\t                    ROY\n\t          Her job.\n\t\n\t                    MYRA\n\t              (bright smile)\n\t          I want to know everything about\n\t          you.\n\t\n\t                    ROY\n\t              (easy grin)\n\t          You do. And once I'm out of here,\n\t          I'll remind you of the best parts.\n\t\n\tThey smile flirtatiously at one another, both with their\n\tminds on other things.\n\t\n\tINT. BATHROOM - DAY\n\t\n\tVery messy, small. Myra showers. She finishes, emerges, wraps\n\therself in a towel, opens the crowded messy medicine cabinet,\n\tremoves cosmetics and other items, starts to tweeze her\n\teyebrows. Doorbell RINGS. She looks irritated, ignores it.\n\tLong doorbell RING. Exasperated, she slaps the tweezers down,\n\texits.\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tAnother furnished apartment, this one with Myra's clothing\n\tand dishes and glasses and other junk all over it.\n\tShe crosses to the door, pulls it open. The APARTMENT MANAGER\n\tenters; a sullen, nervous, heavyset man.\n\t\n\t                    MYRA\n\t              (angry, but defensive)\n\t          You heard the shower, didn't you?\n\t\n\t                    MANAGER\n\t          I don't care about that. This time,\n\t          I gotta have the rent.\n\t\n\tMyra forces herself to be more pleasant.\n\t\n\t                    MYRA\n\t          Joe, I thought I was gonna be all \n\t          right by now, I just need a little\n\t          more --\n\t\n\t                    MANAGER\n\t          It isn't the owner, Myra, it's my\n\t          wife. She knows what's going on.\n\t          This time, I gotta have the money.\n\t\n\t                    MYRA\n\t          Joe, you know you'll --\n\t\n\tIn gesturing, Myra \"accidentally\" loses the towel, then wraps\n\tit around herself again as the manager stares nervously away.\n\tShe smiles, knowing she's got him.\n\t\n\t                    MYRA\n\t          Joe, could we talk it over? Do you\n\t          want a drink?\n\t\n\t                    MANAGER\n\t          My wife sent me here, Myra. For the\n\t          money. She's waiting.\n\t\n\t                    MYRA\n\t          I'll have it tonight. Nine o'clock?\n\t          Ten?\n\t\n\t                    MANAGER\n\t              (trying to be determined)\n\t          This time...\n\t\n\t                    MYRA\n\t          We'll work something out, Joe.\n\t\n\tShe strokes his arm, smiling. He flees. She smiles till he's\n\tgone, then looks worried, leans her head against the door.\n\t\n\tINT. HOSPITAL ROOM - DAY\n\t\n\tRoy, very comfortable in pajamas and robe, sits in a\n\twheelchair beside the bed, with magazines lying handy on the\n\tbed. Myra, irritable, paces beside him.\n\t\n\t                    MYRA\n\t          I don't see why you're still here.\n\t          You look healthy to me.\n\t\n\t                    ROY\n\t          I just do what the doctor says,\n\t          babe.\n\t\n\t                    MYRA\n\t          You're just comfortable, that's\n\t          all. You don't even ask to go home.\n\t          You just lie around, let your mama\n\t          take care of you.\n\t\n\t                    ROY\n\t              (truly astonished)\n\t          Mama!\n\t\n\t                    MYRA\n\t          Who else is paying for all this?\n\t          You badmouth the woman all the\n\t          time, but you sure do take the\n\t          payoffs she gives you.\n\t\n\t                    ROY\n\t              (insulted)\n\t          I'll pay Lilly back, don't you\n\t          worry about that.\n\t\n\t                    MYRA\n\t          I don't like to come here, Roy.\n\t          Every time I do, your mother comes\n\t          in and makes remarks.\n\t\n\t                    ROY\n\t          That's just Lilly's way.\n\t\n\t                    MYRA\n\t          And you never defend me. You're\n\t          afraid of her.\n\t\n\t                    ROY\n\t          Oh, don't be stupid.\n\t\n\t                    MYRA\n\t          You're a mama's boy, if you want\n\t          the truth. \n\t\n\tThis is so absurd, Roy doesn't know how to respond.\n\t\n\t                    ROY\n\t          Are you kid --? I hadn't even seen\n\t          her in seven years!\n\t\n\tLilly enters, smiling in self-confidence. A large ugly burn\n\tis on the back of her right hand.\n\t\n\t                    LILLY\n\t          Should my ears be burning?\n\t\n\t                    MYRA\n\t              (surly)\n\t          They might as well.\n\t\n\tLilly gives her a mock-admiring look.\n\t\n\t                    LILLY\n\t          I heard those skirts were coming\n\t          back.\n\t\n\tMyra's not quite up to direct confrontation with Lilly. She\n\tglowers at Roy instead.\n\t\n\t                    MYRA\n\t          Get well soon.\n\t\n\t                    ROY\n\t              (easy)\n\t          Every day in every way.\n\t\n\t                    MYRA\n\t          I'll see you when you get home.\n\t\n\tMyra stalks out. Acting as though Myra hadn't existed, Lilly\n\tputs her bag on the bed, takes mail from it.\n\t\n\t                    ROY\n\t          What happened to your hand?\n\t\n\t                    LILLY\n\t              (casually dismissive)\n\t          Just a little accident. I went by\n\t          your place, picked up your mall.\n\t          Just bills, I'll take care of them.\n\t\n\t                    ROY\n\t          I can take care of my own bills,\n\t          Lilly.\n\t\n\t                    LILLY\n\t              (indifferent shrug)\n\t          Whatever you say. The manager says\n\t          your boss called.\n\t              (crooked grin)\n\t          Really pulled the wool over\n\t          everybody's eyes, huh?\n\t\n\t                    ROY\n\t          What are you talking about? So I've\n\t          got a job. So what?\n\t\n\t                    LILLY\n\t          Stop kidding me! Four years in a\n\t          town like Los Ang-gleez, and a\n\t          peanut selling job is the best you\n\t          can do? You expect me to believe\n\t          that?\n\t\n\t                    ROY\n\t              (spreads hands; it's\n\t               obvious)\n\t          It's there. The boss called, you\n\t          said so yourself.\n\t\n\t                    LILLY\n\t          And that dump you live in! Those\n\t          clown pictures on the walls!\n\t\n\tThis reference alerts and worries Roy, which he tries to\n\thide.\n\t\n\t                    ROY\n\t          I like those.\n\t\n\t                    LILLY\n\t          You do not! Roy Dillon? Cornball\n\t          clown pictures? Commission\n\t          salesman? It's all a front, isn't\n\t          it? You're on the grift, I know you\n\t          are. You're working some angle, and\n\t          don't tell me you're not because I\n\t          wrote the book!\n\t\n\t                    ROY\n\t              (defensive)\n\t          You're one to talk. Still running\n\t          playback money for the mob.\n\t\n\t                    LILLY\n\t          That's me. That's who I am. You\n\t          were never cut out for the rackets,\n\t          Roy, and if you --\n\t\n\t                    ROY\n\t          How come?\n\t\n\tShe considers him. His expression is jaunty, daring her. She\n\tgives him a somber answer.\n\t\n\t                    LILLY\n\t          You aren't tough enough.\n\t\n\tHe's afraid she's right. He covers the doubt with a display\n\tof self-assurance.\n\t\n\t                    ROY\n\t          Not as tough as you, huh?\n\t\n\t                    LILLY\n\t              (dead serious)\n\t          No. And you have to be.\n\t\n\tShe holds up her burned hand, showing it to him.\n\t\n\t                    LILLY\n\t          You asked me about this. You really\n\t          want to know what happened?\n\t\n\tHe isn't sure he does; but what choice does he have?\n\t\n\t                    ROY\n\t          Up to you.\n\t\n\t                    LILLY\n\t          My boss is a guy named Bobo Justus,\n\t          back in Baltimore. When a long shot\n\t          gets too much action, I have to put\n\t          money on that horse at the track,\n\t          because it's the only way to get\n\t          the odds down.\n\t\n\t                    ROY\n\t          Sure.\n\t\n\t                    LILLY\n\t          The first day of the Delmar meet,\n\t          there was a nag called Bluebell. I\n\t          should have been on it. But that\n\t          was the day after you came in here,\n\t          so I stuck around to see how you\n\t          were gonna be.\n\t\n\tHe would speak protest, deny, explain, but she cuts him off.\n\t\n\t                    LILLY\n\t          That was my choice, nothing to do\n\t          with you. I took a chance, and it\n\t          didn't work out.\n\t\n\t                    ROY\n\t          Bluebell came in?\n\t\n\t                    LILLY\n\t          I sent Bobo ten grand of my own\n\t          money, like it was the winnings\n\t          from my bets. I hoped that would\n\t          cover me.\n\t              (shrug)\n\t          It didn't.\n\t\n\tEXT. DELMAR DAY\n\t\n\tAN ANGLE on the exit doors toward the parking lot. Lilly\n\tcomes out, self-absorbed, then sees something ahead of her,\n\tfalters briefly, keeps walking, tries a very shaky smile.\n\t\n\tREVERSE ANGLE, as Lilly approaches her car. BOBO JUSTUS, 50,\n\ta blunt hoodlum in a good suit and a civilized veneer, stands\n\tleaning against the car, arms folded, squinting behind\n\tsunglasses.\n\t\n\t                    LILLY\n\t          Hi, Bobo.\n\t\n\t                    BOBO\n\t          Did I buy you that dress, you piece\n\t          of shit?\n\t\n\tLilly's scared, startled, but trying to figure out how to\n\tplay this.\n\t\n\t                    LILLY\n\t          Well, I guess so. You're the guy I\n\t          work for.\n\t\n\t                    BOBO\n\t          You work for me, huh? Then I just\n\t          may flush you down the toilet.\n\t          Drive me to the Durando.\n\t\n\tBobo gets into the passenger seat, while Lilly nods\n\tconvulsive agreement and hurries around to get behind the\n\twheel. The car jolts forward, then smooths, and heads for the\n\tgate.\n\t\n\tINT. CHRYSLER - DAY\n\t\n\tDriving along the highway. Lilly concentrates on traffic.\n\tBobo heavily watches her profile, finally speaks.\n\t\n\t                    BOBO\n\t          Bluebell.\n\t\n\tLilly's eyes briefly close, her shoulders sag. Then she goes\n\tback to the silent alert person she'd been. Bobo nods.\n\t\n\t                    BOBO\n\t          How'd you figure you were gonna get\n\t          away with that?\n\t\n\t                    LILLY\n\t          I'm not getting away with anything,\n\t          Bobo.\n\t\n\t                    BOBO\n\t          You're fuckin right you're not. How\n\t          much did your pals cut you in for\n\t          on that nag, huh? Or did they give\n\t          you the same kind of screwing you\n\t          gave me?\n\t\n\t                    LILLY\n\t          I was down on that horse, Bobo. Not\n\t          as much as I should have been, but\n\t          there was a lot of action on those--\n\t\n\tBobo taps a fingertip against the side of her head to shut\n\ther up. She shuts up.\n\t\n\t                    BOBO\n\t          One question. Do you want to stick\n\t          to that story, or do you want to\n\t          keep your teeth?\n\t\n\t                    LILLY\n\t          I want to keep my teeth.\n\t\n\t                    BOBO\n\t          Now I'll ask you another. You think\n\t          I got no contacts out here? That\n\t          nag paid off at just the opening\n\t          price. There wasn't hardly a\n\t          flutter on the tote board from the\n\t          time the odds were posted. There\n\t          ain't enough action to tickle the\n\t          tote, but you claim a ten grand\n\t          win!\n\t          You send me ten thousand dollars,\n\t          like I'm some mark you can blow\n\t          off!\n\t\n\t                    LILLY\n\t              (terrified, broken)\n\t          Bobo, no, I --\n\t\n\t                    BOBO\n\t          You wanna talk to me straight up?\n\t\n\t                    LILLY\n\t          My son --\n\t\n\t                    BOBO\n\t          Your what?\n\t\n\t                    LILLY\n\t          My son was in the hospital --\n\t\n\t                    BOBO\n\t          What the fuck are you doin with a\n\t          son?\n\t\n\t                    LILLY\n\t          He left home a long time ago. He\n\t          was in the hospital, up in Los Ang\n\t          gleez, real sick.\n\t\n\t                    BOBO\n\t              (utter scorn)\n\t          Motherhood.\n\t\n\t                    LILLY\n\t          I never fucked up before, Bobo.\n\t\n\t                    BOBO\n\t          You expect me to buy this?\n\t\n\tIt's time for Lilly to show tough, and she knows it.\n\t\n\t                    LILLY\n\t          You do buy it, Bobo. I cost you,\n\t          and I'm sorry.\n\t\n\tBobo thinks this over.\n\t\n\t                    BOBO\n\t          I got a lot of people work for me,\n\t          Lilly. I can't have shit like this.\n\t\n\t                    LILLY\n\t              (begging)\n\t          It'll never happen again. I swear.\n\t\n\t                    BOBO\n\t          It happened once. With me, that's\n\t          making a habit of it.\n\t\n\tLilly drops back to her final position; fatalism.\n\t\n\t                    LILLY\n\t          You're calling the shots.\n\t\n\t                    BOBO\n\t          You got any kind of long coat in\n\t          the car? Anything you can wear home\n\t          over your clothes?\n\t\n\t                    LILLY\n\t              (deadened with fear)\n\t          No.\n\t\n\t                    BOBO\n\t              (doesn't matter)\n\t          I'll loan you a raincoat.\n\t\n\tLilly drives, holding herself together.\n\t\n\tEXT. HOTEL DURANDO - DAY\n\t\n\tA tall expensive hotel on the coast north of San Diego.\n\tCAMERA PANS with the Chrysler pulling in and stopping at the\n\tentrance, then PANS UP the balconied facade.\n\t\n\tINT. HOTEL SUITE - DAY\n\t\n\tLiving room of a high-floor suite. CAMERA FACES across the\n\troom to the balcony and the view of the ocean. Entrance door\n\tto one side. A supermarket shopping bag is on the coffee\n\ttable. Two THUGS sit on the sofa, watching TV.\n\t\n\tThe door opens and Lilly enters, followed by Bobo. The thugs\n\timmediately rise and switch off the TV.\n\t\n\t                    BOBO\n\t              (to the thugs)\n\t          Take a walk.\n\t\n\tThe thugs leave the room as Lilly crosses to stand between US\n\tand the view, followed by Bobo, neither looking out. Lilly\n\tturns to Bobo, who abruptly punches her hard in the stomach.\n\tShe falls to the floor.\n\t\n\tANOTHER ANGLE as Bobo steps across her and goes over to close\n\tthe drapes over the view. Lilly sits up, watching him,\n\twaiting obediently. Bobo looks at her.\n\t\n\t                    BOBO (CONT'D)\n\t          Get me a bath towel.\n\t\n\tShe gets up, hurting, and hurries to the bathroom. Bobo sits\n\ton the sofa, crosses his ankles on the coffee table next to\n\tthe supermarket bag. He takes out and lights a cigar. Lilly\n\tcomes back with a large white bath towel.\n\t\n\t                    BOBO (CONT'D)\n\t          You ever hear about the oranges?\n\t\n\t                    LILLY\n\t          You mean, the insurance frammis?\n\t\n\t                    BOBO\n\t          Tell me about the oranges, Lilly.\n\t\n\tHe kicks over the supermarket bag. Oranges roll on the floor.\n\t\n\t                    BOBO (CONT'D)\n\t          While you put those in the towel.\n\t\n\tLilly's very scared. She drops to her knees, spreads the\n\ttowel, crawls around gathering oranges while she talks.\n\t\n\t                    LILLY\n\t          You hit a person with the oranges\n\t          in the towel, they get big, awful\n\t          looking bruises, but they don't\n\t          really get hurt, not if you do it\n\t          right. It's for working scams\n\t          against insurance companies.\n\t\n\t                    BOBO \n\t          And if you do it wrong?\n\t\n\t                    LILLY\n\t          It can louse up your insides. You\n\t          can get puh, puh, puh...\n\t\n\t                    BOBO\n\t              (impatient)\n\t          What's that, Lilly?\n\t\n\tLilly pauses, bent over, tightly holding an orange.\n\t\n\t                    LILLY\n\t          Permanent damage.\n\t\n\t                    BOBO \n\t          You'll never shit right again.\n\t\n\tHe gets to his feet, leaving his cigar in an ashtray.\n\t\n\t                    BOBO (CONT'D)\n\t              (hard, impatient)\n\t          Bring me the towel.\n\t\n\tFumbling slightly, she folds the towel edges together to make\n\ta bag, then stands, brings the towel to Bobo. He makes a\n\tproduction out of getting his grip on the edges just right.\n\tShe stands as limp as she can, just wanting to get through\n\tthis. He looks at her without expression, rears back with the\n\ttowel, swings it forward, lets it drop open. Oranges roll on\n\tthe floor. Lilly stares, wide-eyed, recognizing reprieve.\n\tBobo tosses the towel behind him onto the sofa, then gestures\n\tcontemptuously for her to pick up the oranges again.\n\t\n\tTWO SHOT, closer, as Lilly turns, bending toward the oranges,\n\tand Bobo picks up his cigar, then lifts a foot and kicks her\n\tflatfooted, hard, in the back. She sprawls on the floor. He\n\tfollows and drops to his knees on her back.\n\t\n\tAN ANGLE close on Lilly on the floor, Bobo's knees grinding\n\tback and forth into her back.\n\t\n\tAN ANGLE on Bobo, grimacing as he bears down, pressing his\n\tweight onto her back. He leans forward, left hand bracing\n\thimself on the floor beside her head as he reaches down with\n\tthe cigar held in his right hand and presses the ember\n\tagainst the back of her splayed-out right hand.\n\t\n\tECU, Lilly, clenching her teeth, tears squeezing from her\n\teyes, simply bearing it.\n\t\n\tAN ANGLE on Bobo, catching a bad smell, looking back down\n\tbehind himself at Lilly's body. This is the result he wanted,\n\tbut it disgusts him. He straightens up, still kneeling on\n\ther, puts the cigar in his mouth, doesn't like its taste,\n\tremoves it, braces his left hand against her back while he\n\tlifts off her, getting back up onto his feet.\n\t\n\tWIDE SHOT, Bobo stepping over her, expression repulsed.\n\t\n\t                    BOBO (CONT'D)\n\t          Go clean yourself up.\n\t\n\tHe puts the cigar back in the ashtray as she rises, cradling\n\ther burnt hand. Not looking toward Bobo, hobbling with knees\n\ttogether, she starts from the room.\n\t\n\t                    BOBO (CONT'D)\n\t          The raincoat's on the bed.\n\t\n\tShe leaves. He opens the drapes, then picks up an orange from\n\tthe floor and steps out onto the balcony.\n\t\n\tEXT. BALCONY - DAY\n\t\n\tBobo stands looking out at the ocean. He enjoys breathing the\n\tsea air. He slowly peels the orange, dropping pieces of peel\n\tover the side.\n\t\n\tLilly appears in the doorway, wearing a too-large man's\n\traincoat. Bobo doesn't seem to notice her at first, then nods\n\tto her.\n\t\n\t                    BOBO\n\t          Almost forgot. That ten grand of\n\t          yours. It's in the envelope by the\n\t          door.\n\t\n\t                    LILLY \n\t              (tries for animation)\n\t          Oh, thanks, Bobo.\n\t\n\t                    BOBO\n\t          You want a drink?\n\t\n\t                    LILLY \n\t          Gee, I better not, if it's okay. I\n\t          still gotta drive back up to Los\n\t          Ang-gleez.\n\t\n\t                    BOBO \n\t          See your son, huh? Well, that's\n\t          nice. A side of you I didn't know,\n\t          Lilly.\n\t\n\tLilly chances taking a step out onto the balcony. It's vital\n\tthat she encourage this forgive-and-forget dialogue.\n\t\n\t                    LILLY\n\t          He's a good kid. A salesman.\n\t\n\t                    BOBO \n\t          On the square, huh? And how are you\n\t          making out these days? Stealing\n\t          much?\n\t\n\tBobo's being jolly now. Lilly's scared, but has to be jolly,\n\ttoo.\n\t\n\t                    LILLY\n\t          From you? My folks didn't raise any\n\t          stupid kids.\n\t\n\tBobo's joshing now. He raises a humorous eyebrow.\n\t\n\t                    BOBO \n\t          Not skimming a thing, Lilly?\n\t\n\t                    LILLY\n\t          Oh, well, you know. I just clip a\n\t          buck here and a buck there. Not\n\t          enough to notice.\n\t\n\t                    BOBO\n\t              (honest approval)\n\t          That's right. Take a little, leave\n\t          a little.\n\t\n\t                    LILLY \n\t          A person that don't look out for\n\t          himself is too dumb to look out for\n\t          anybody else. He's a liability,\n\t          right, Bobo?\n\t\n\t                    BOBO\n\t              (this is his creed)\n\t          You're a thousand percent right!\n\t\n\t                    LILLY \n\t          Or else he's working an angle. If\n\t          he doesn't steal a little, he's\n\t          steeling big.\n\t\n\t                    BOBO \n\t          You know it, Lilly.\n\t\n\t                    LILLY\n\t          You know, I like that suit, Bobo. I\n\t          don't know what there is about it,\n\t          but it somehow makes you look\n\t          taller.\n\t\n\t                    BOBO\n\t              (delighted)\n\t          Yeah? You really think so? A lot of\n\t          people been telling me the same\n\t          thing.\n\t\n\t                    LILLY \n\t          Well, you can tell them I said\n\t          they're right.\n\t              (looks at sky)\n\t          I better get going. Roy'll wonder\n\t          where I am.\n\t\n\t                    BOBO \n\t          Worries about his mother, eh? Give\n\t          him a hug for me.\n\t\n\t                    LILLY \n\t          I will. So long, Bobo.\n\t\n\tLilly leaves the balcony. Bobo eats more orange, looking out\n\tat the ocean. His expression is stern but calm.\n\t\n\tINT. CHRYSLER - DAY\n\t\n\tLilly drives along the highway, weeping, shaking, teeth\n\tchattering. Her hands are both high on the wheel, the back of\n\tthe right hand developing a large red burn.\n\t\n\t                    LILLY\n\t          Lucky! Lucky! Oh, am I lucky.! Am I\n\t          lucky!\n\t\n\tINT. HOSPITAL ROOM - DAY\n\t\n\tRoy's appalled and embarrassed and ashamed by this story; the\n\tsurface result is, he's mad at Lilly.\n\t\n\t                    ROY \n\t          Lucky? You call that lucky?\n\t\n\t                    LILLY\n\t              (simply)\n\t          He let me live. He let me be his\n\t          friend.\n\t\n\tRoy in his agitation wheels himself back and forth in the\n\twheelchair, bumping into things.\n\t\n\t                    ROY \n\t          You don't put up with that! Nobody\n\t          has to put up with that!\n\t\n\t                    LILLY\n\t          You do if you're where I am. Where\n\t          you want to be. How'd you get that\n\t          punch in the stomach, Roy?\n\t\n\tHe closes down, sullen, not caring if she believes him or\n\tnot.\n\t\n\t                    ROY \n\t          I tripped over a chair.\n\t\n\t                    LILLY\n\t              (calm maternal advice)\n\t          Get off the grift, Roy.\n\t\n\t                    ROY \n\t          Why?\n\t\n\t                    LILLY (CONT'D)\n\t              (faint smile)\n\t          You don't have the stomach for it.\n\t\n\tHe stares at her, hurt and angry. She stares back,\n\tunflinching. Angrily, he spins the wheelchair around, his\n\tback to her.\n\t\n\tNow she's hurt. She shrugs, speaks indifferently to his back.\n\t\n\t                    LILLY \n\t          I just give you your life. What you\n\t          do with it is up to you.\n\t\n\t                    ROY\n\t              (his back turned)\n\t          That's right.\n\t\n\tShe hesitates, then stalks out, shutting the door.\n\t\n\tHearing the door close, Roy spins around in the wheelchair to\n\tface where she'd been. He starts to get up, pauses midway.\n\t\n\tINT. HOSPITAL CORRIDOR - DAY\n\t\n\tAngry, Lilly takes a step away from the closed door, then\n\tstops, looks uncertainly back.\n\t\n\tINT. HOSPITAL ROOM - DAY\n\t\n\tRoy, on his feet now, stands still, indecisive.\n\t\n\tINT. HOSPITAL CORRIDOR - DAY\n\t\n\tLilly shakes her head, turns firmly away, marches down the\n\tcorridor.\n\t\n\tINT. HOSPITAL ROOM - DAY\n\t\n\tRoy makes an angry gesture, drops back into the wheelchair,\n\tspins it around and wheels over to the phone. Quick and\n\tangry, he makes a call. SOUND of ring; SOUND of click.\n\t\n\t                    MYRA  (V.O.)\n\t              (filtered; little-girl\n\t               flirtatious)\n\t          Myra here. Sorry you missed me.\n\t          Tell me how to reach you and I\n\t          will, just as soon as I can.\n\t\n\tSOUND of answering machine beep.\n\t\n\t                    ROY \n\t          Babe, I'm gettin out of here, and\n\t          that's it. Let's take some time out\n\t          this weekend, go down to LaJolla,\n\t          hit the beach, have some fun.\n\t          Forget all this other stuff, huh?\n\t\n\tRoy hangs up, sits in the wheelchair looking determined.\n\t\n\tINT. MADERO LOBBY - DAY\n\t\n\tSimms talks with a MAID.\n\t\n\t                    SIMMS\n\t          Your difference between your folded\n\t          towel and your clean towel is a\n\t          trip to the laundry. When you're\n\t          cleaning those bathrooms, what you\n\t          do, you pick up the towel, you give\n\t          it a good shake and a good look,\n\t          and you say to yourself, 'Would I\n\t          dry myself on this towel?' If the\n\t          answer's yes, fold it.\n\t\n\tRoy comes out of the elevator, crossing toward Simms.\n\t\n\t                    MAID \n\t          What if it's wet?\n\t\n\t                    SIMMS\n\t          Mr. Dillon! Welcome back! You look\n\t          fine, just fine.\n\t\n\t                    ROY \n\t          Thanks, Mr. Simms, I'm feeling\n\t          fine.\n\t\n\t                    MAID \n\t              (shy)\n\t          I'm glad you're better.\n\t\n\tSimms hands Roy a stack of mail.\n\t\n\t                    SIMMS\n\t          You're well liked around here, Mr.\n\t          Dillon. The entire staff will be\n\t          pleased to see you're back.\n\t\n\tRoy's touched and embarrassed by this reaction.\n\t\n\t                    ROY \n\t          Well, thank you. And thank them.\n\t\n\t                    SIMMS \n\t          Sickness comes to us all, Mister\n\t          Dillon.\n\t\n\t                    ROY \n\t          That's true, Mr. Simms.\n\t\n\t                    SIMMS\n\t          We never know when and we never\n\t          know why. We never know how. The\n\t          only blessed thing we know is,\n\t          it'll be at the most inconvenient\n\t          and unexpected time. Just when\n\t          you've got tickets to the World\n\t          Series. And that's the way the\n\t          permanent waves.\n\t\n\t                    ROY \n\t          Well, I'm back now. I just wanted\n\t          you to know. Gotta rush.\n\t\n\t                    SIMMS\n\t          Happy to see you looking so good.\n\t\n\tRoy crosses back to the elevator, enters it. Elevator door\n\tcloses. Simms looks after him, avuncular.\n\t\n\t                    SIMMS (CONT'D)\n\t          That fellow could be a congressman.\n\t              (turns to maid)\n\t          If it's wet, you don't fold it. You\n\t          shake it, and hang it neatly on the\n\t          rod provided.\n\t\n\t                    MAID \n\t          Yes, sir.\n\t\n\tEXT. SARBER & WEBB - DAY\n\t\n\tA long low stucco building in an industrial section of Los\n\tAngeles. The company name is on the glass of the main door.\n\tKAGGS, a humorless hotshot of 28, dressed in short-sleeved\n\twhite shirt and narrow dark tie, prowls the cracked sidewalk\n\tin front of the place, MAKING REMARKS into a small cassette\n\trecorder. Roy's Honda arrives and drives into the company lot\n\tat the end of the building. Kaggs watches, then goes on\n\tpatrolling and TALKING into the recorder. Roy comes out to\n\tthe sidewalk and heads for the entrance. Kaggs stops and\n\twatches him approach.\n\t\n\t                    ROY\n\t              (cheerful, confident)\n\t          Whadaya say?\n\t\n\t                    KAGGS\n\t              (uptight, minimal)\n\t          Hello.\n\t\n\tRoy continues on and enters the building.\n\t\n\tINT. SARBER & WEBB - DAY\n\t\n\tA low rail separates the visitors from an area of desks with\n\tCLERKS typing or adding up figures or TALKING on the phone.\n\tBeyond them are floor-to-ceiling bins and shelves with narrow\n\taisles between, in which more CLERKS move busily, filling\n\torders or doing inventory. A great sense of activity and\n\thubbub. Roy enters, looks around in surprise. A clerk at a\n\tfront desk sees him, stands happily.\n\t\n\t                    CLERK \n\t          Roy! Welcome back.\n\t\n\t                    ROY\n\t              (approaching him)\n\t          What's going on? This is usually\n\t          coffee break time.\n\t\n\t                    CLERK \n\t          Not since Kaggs showed up.\n\t\n\tOther clerks, aware of Roy, come over with AD LIB GREETINGS.\n\t\n\t                    ROY\n\t              (happily basking)\n\t          Hey, yeah, I'm fine, everything's\n\t          great. What's this Kaggs? Sounds\n\t          like a disease.\n\t\n\t                    2ND CLERK \n\t          It is.\n\t\n\t                    CLERK \n\t          Troubleshooter from the main\n\t          office. Came out here right after\n\t          you went into the hospital, and he\n\t          ain't had a kind word for anybody\n\t          yet.\n\t\n\t                    3RD CLERK \n\t          Nobody knows anything but him.\n\t\n\t                    CLERK \n\t          He chopped off half a dozen\n\t          salesmen; won't wholesale to them\n\t          any more.\n\t\n\t                    2ND CLERK \n\t          What kind of sense does that make?\n\t          They're all on commission.\n\t\n\t                    ROY\n\t              (unworried)\n\t          You think he'll chop me?\n\t\n\t                    CLERK\n\t          If he does, he's crazy.\n\t\n\t                    2ND CLERK \n\t          Here he comes!\n\t\n\tThe clerks all hurry back to their desks as Kaggs enters. He\n\tcrosses to Roy, hand stuck out.\n\t\n\t                    KAGGS\n\t          Kaggs. Home office.\n\t\n\t                    ROY\n\t              (taking his hand)\n\t          Roy Dillon.\n\t\n\t                    KAGGS\n\t              (keeping Roy's hand)\n\t          I know that. Knew it when I saw you\n\t          out there. The best salesman here,\n\t          which isn't saying much. Want to\n\t          talk to you, Dillon.\n\t\n\tKaggs moves toward the gate in the rail, still holding Roy's\n\thand, to move him along. Roy stands still, which yanks Kaggs\n\tback. Kaggs frowns at him, releases his hand.\n\t\n\t                    KAGGS (CONT'D)\n\t          What's up?\n\t\n\t                    ROY \n\t          That was a pretty backhanded\n\t          compliment. If I let people get\n\t          away with things like that, I\n\t          wouldn't be a good salesman.\n\t\n\t                    KAGGS\n\t              (brisk)\n\t          You're right. I apologize. But I\n\t          still want to talk to you.\n\t\n\t                    ROY \n\t          Lead on.\n\t\n\tKaggs leads the way through the rail.\n\t\n\tINT. KAGGS' OFFICE - DAY\n\t\n\tSmall, crowded, efficient, with interior windows showing the\n\taisles of bins. Kaggs leads Roy in, shuts the door, gestures\n\tat the second chair as he goes behind the desk.\n\t\n\t                    KAGGS \n\t          Take a seat.\n\t\n\tThey both sit, Roy amused and observant.\n\t\n\t                    KAGGS \n\t          When I said you being the best\n\t          salesman here didn't say much, I\n\t          meant for us. I know your record\n\t          with Sarber and Webb, and I'd say\n\t          you're a top-flight man, but you've\n\t          had no incentive. No one walking on\n\t          your heels. Just a lot of half\n\t          asses, so the tendency's been not\n\t          to stretch yourself. I'm bouncing\n\t          the slobs, incidentally.\n\t\n\t                    ROY \n\t              (dry)\n\t          So I heard.\n\t\n\t                    KAGGS \n\t          Makes no difference to me if\n\t          they're only on commission. If they\n\t          don't make good money, they're not\n\t          giving us good representation, and\n\t          we can't afford to have them\n\t          around. Ever supervise salesmen?\n\t\n\t                    ROY \n\t          Just myself.\n\t\n\t                    KAGGS \n\t          That's right, you've had to\n\t          supervise yourself. This place\n\t          needs a sales manager. Somebody\n\t          who's proved he's a salesman and\n\t          can handle other salesmen. He'd\n\t          have a lot of deadwood to clear\n\t          out, new men to hire. What do you\n\t          think?\n\t\n\tRoy doesn't yet know he's being offered the job.\n\t\n\t                    ROY \n\t          Sounds like a good Idea.\n\t\n\t                    KAGGS\n\t          I don't know offhand what your best\n\t          year's been, we can look it up. The\n\t          idea is, we'll top it by fifteen\n\t          percent.\n\t\n\tNow Roy gets it. He's startled, almost scared, thinks\n\tautomatically of escape.\n\t\n\t                    ROY \n\t          What? Me?\n\t\n\t                    KAGGS \n\t          That's just the first year. If you\n\t          aren't worth a lot more than that\n\t          the second year, I'll kick you out.\n\t          What do you say?\n\t\n\t                    ROY \n\t          Well, uh... No.\n\t\n\t                    KAGGS\n\t              (astonished)\n\t          No?\n\t\n\t                    ROY \n\t          I can't take that job! I mean, I\n\t          mean, I can't take it right away.\n\t          I'm still recuperating, I just\n\t          dropped in to say hello, see\n\t          everybody --\n\t\n\t                    KAGGS \n\t          I didn't realize. Yeah, you do look\n\t          a little pale. How soon will you be\n\t          ready? A week?\n\t\n\t                    ROY \n\t          But you need a man right now. It\n\t          wouldn't be fair to you to --\n\t\n\t                    KAGGS \n\t          I take care of the being-fair-to-me\n\t          department. Things've gone to hell\n\t          this long, they can go a little\n\t          longer.\n\t\n\t                    ROY\n\t              (trapped)\n\t          Well...\n\t\n\tKaggs gets to his feet, terminating the meeting.\n\t\n\t                    KAGGS \n\t          See you in a week, Roy. I can call\n\t          you Roy?\n\t\n\t                    ROY\n\t              (rising)\n\t          Oh, sure. Fine.\n\t\n\tKaggs sticks his hand out for another shake. Roy obliges.\n\t\n\t                    KAGGS \n\t          And I'm Perk. Short for Percy, I'm\n\t          afraid.\n\t\n\t                    ROY\n\t              (distracted)\n\t          Perk.\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tRoy's place. Roy enters from the bedroom, carrying a\n\tsuitcase, which he drops on the sofa. He goes to one of the\n\tbox-framed clown pictures, takes it off the wall, puts it\n\tface down on the coffee table, removes two wing nuts holding\n\tthe back, lifts off the back, and reveals stacks of money\n\thidden inside. He takes two wads of money out, counting them,\n\tputting them on the coffee table, then fits the back in\n\tplace, reattaches the wing nuts, and hangs the picture on the\n\twall. Stuffing the wads of money into the suitcase, he\n\tleaves.\n\t\n\tEXT. UNION STATION - DAY\n\t\n\tA cab pulls up to discharge passengers. Roy and the DRIVER\n\tget out. Roy pays the driver, who opens the trunk to take out\n\tseveral pieces of luggage. Myra leans hesitantly out, as\n\tthough afraid it's raining out there.\n\t\n\t                    ROY \n\t          This really is it. Union Station.\n\t\n\tMyra comes out of the cab. She's feeling testy. Roy's in a\n\tgood mood and ignores her bad temper.\n\t\n\t                    MYRA\n\t          I don't see why we have to take the\n\t          train.\n\t\n\t                    ROY \n\t          Because it's comfortable.\n\t\n\tMyra and Roy burden themselves with the luggage.\n\t\n\t                    MYRA\n\t          What if we want to drive somewhere\n\t          while we're there?\n\t\n\t                    ROY\n\t          We'll rent a car.\n\t\n\tThey start for the station.\n\t\n\t                    MYRA\n\t          Big spender.\n\t\n\t                    ROY\n\t          You ain't seen nothin.\n\t\n\tINT. TRAIN DAY\n\t\n\tAN ANGLE from outside the passenger car through the window at\n\tMyra, mulish, watching the scenery go by. Beyond her Roy's\n\teasy, content. He moves to get up.\n\t\n\tTWO SHOT, within the train. Myra looks questioningly at Roy\n\tas he stands.\n\t\n\t                    ROY\n\t          Stretch my legs. Come along?\n\t\n\tShe's not ready to relent and enjoy herself.\n\t\n\t                    MYRA\n\t          No.\n\t\n\t                    ROY\n\t              (unruffled)\n\t          See you soon.\n\t\n\tHe walks down the aisle behind Myra, who sighs and looks out\n\tthe window again.\n\t\n\tINT. BAR CAR - DAY\n\t\n\tFour young SOLDIERS sit at a table in a rudimentary bar car.\n\tThey're drinking bloody Marys out of plastic glasses and\n\thaving a good time together. In b.g., several customers are\n\tclustered at the small service bar, waiting for drinks.\n\t\n\tAN ANGLE on Roy, at the service bar, looking back past other\n\tpeople at the soldiers. He gets his mixed drink, in a plastic\n\tglass, and turns away.\n\t\n\tAN ANGLE on the soldiers as Roy starts by. The train lurches,\n\tand Roy falls heavily against their table, slopping their\n\tdrinks and spilling some of his own on the table.\n\t\n\t                    ROY \n\t          Oh! Ow, I'm sorry! Oh, look, I\n\t          spilled your drinks!\n\t\n\t                    SOLDIER\n\t          That's okay, don't worry about it.\n\t\n\t                    SOLDIER 2\n\t          You okay, pal?\n\t\n\t                    ROY\n\t          Let me buy you a new round.\n\t\n\t                    SOLDIER\n\t          Hey, no, no problem.\n\t\n\t                    SOLDIER 3\n\t          You didn't like spill much at all.\n\t\n\tRoy firmly places his own glass on their table.\n\t\n\t                    ROY \n\t          What are those, bloody Marys? Watch\n\t          this, I'll be back.\n\t\n\tHe leaves, while the soldiers are still PROTESTING.\n\t\n\tINT. TRAIN - DAY\n\t\n\tMyra applies makeup, watching herself in her compact mirror.\n\tShe becomes aware of eyes, and looks around.\n\t\n\tTWO SHOT, Myra and a BUSINESSMAN, sitting across the way,\n\tgrinning at her. Myra registers him.\n\t\n\tCU, Myra, considering the possibilities. Then she shrugs,\n\tshakes her head at the businessman almost reluctantly, and\n\tgoes back to applying makeup.\n\t\n\tINT. BAR CAR - DAY\n\t\n\tRoy now sits with the soldiers, eagerly listening to them\n\ttalk. There are plastic glasses enough on the table for three\n\trounds of drinks.\n\t\n\t                    SOLDIER 3\n\t              (to Soldier 2)\n\t          Yeah, but it was you like told the\n\t          sergeant your grandmother was dead.\n\t\n\t                    SOLDIER\n\t              (laughing)\n\t          Again!\n\t\n\t                    SOLDIER 2\n\t              (to Soldier 3)\n\t          And you jumped right in.\n\t              (broad imitation)\n\t          I'll drive him, Sarge, he's too\n\t          distraught.\n\t\n\t                    SOLDIER 4\n\t              (astonished)\n\t          Distraught? You said distraught?\n\t\n\tThey all laugh, Roy laughing with them.\n\t\n\t                    ROY\n\t          Boy! You guys could've got in a lot\n\t          of trouble.\n\t\n\t                    SOLDIER 3\n\t          Nah. Old Sarge, he's slowing down.\n\t\n\t                    ROY\n\t          I don't know. I wouldn't take a\n\t          chance like that.\n\t              (looks at floor)\n\t          What's that?\n\t\n\tThey watch as he bends, picks up one die from the floor,\n\tholds it where they can all see it, his manner open,\n\tguileless.\n\t\n\t                    ROY (CONT'D)\n\t          One of you fellows drop this?\n\t\n\tINT. TRAIN - DAY\n\t\n\tMyra walks down the aisle, demurely looking at no one.\n\t\n\tINT. BAR CAR - DAY\n\t\n\tRoy's getting to his feet, the soldiers protesting.\n\t\n\t                    SOLDIER 2\n\t          You can't buy every round!\n\t\n\t                    SOLDIER 3 \n\t          Like our turn!\n\t\n\t                    ROY \n\t          Tell you what. We'll roll for it.\n\t          Low number buys.\n\t\n\tHe hands the die to Soldier 2.\n\t\n\t                    ROY \n\t          Go ahead. You roll for the four of\n\t          you.\n\t\n\tThe soldiers are confused but agreeable, seeing this as some\n\tkind of fun.\n\t\n\t                    SOLDIER 2 \n\t          Here goes.\n\t\n\tHe tosses the die on the table.\n\t\n\t                    SOLDIER 3 \n\t          That's a four!\n\t\n\tRoy picks up the die.\n\t\n\tAN ANGLE close on Roy, his eyes glittering, his fist with the\n\tdie shaking beside his head.\n\t\n\tWIDE SHOT. Roy throws. They all look at the die. Roy spreads\n\this hands; the good sport.\n\t\n\t                    ROY \n\t          Told you I'd buy.\n\t\n\t                    SOLDIER \n\t          It just doesn't seem fair, Tom.\n\t\n\t                    ROY \n\t          Tell you what. Give me a chance to\n\t          get even when I come back.\n\t\n\tINT. TRAIN - DAY\n\t\n\tMyra reaches the end of one car, starts through.\n\t\n\tINT. BAR CAR - DAY\n\t\n\tAN ANGLE on Myra about to enter. She stops, looking through\n\tthe glass in the door.\n\t\n\tMyra's POV: Roy and the soldiers rolling the die for money.\n\t\n\tECU, Myra, absorbed, watching.\n\t\n\tMyra's POV: MOS through the glass. ECU, Roy's hand with the\n\tdie. ECU, Roy's profile, his smile, his innocent distress\n\twhen he wins. ECU, Roy's hand scoops money.\n\t\n\tECU, Myra, smiling, pleased.\n\t\n\tINT. DINER - NIGHT\n\t\n\tA brightly lit Hopperish place. Lilly sits alone in a booth\n\teating a bowl of chili and reading a newspaper folded beside\n\tthe bowl. A DRUNK with a great deal of faith in his own charm\n\tsits with a male FRIEND at the counter, drinking coffee. The\n\tdrunk keeps looking toward Lilly, grinning, COMMENTING\n\tplayfully to his friend, who's bored by it all. Lilly doesn't\n\tseem to be aware of him.\n\t\n\tThe drunk rises from his stool, turning toward Lilly,\n\tstaggering slightly. His friend makes a small move to stop\n\thim, then shrugs and lets him go. The drunk makes his way to\n\tLilly's table, leans on it.\n\t\n\t                    DRUNK \n\t          Pretty woman like you shouldn't eat\n\t          alone. Whadaya wanna eat alone for?\n\t\n\tLilly gives him a flat look.\n\t\n\t                    LILLY\n\t          Go away.\n\t\n\tShe looks past him toward the WAITRESS behind the counter.\n\t\n\t                    LILLY (CONT'D)\n\t              (calling)\n\t          Could I have some coffee, please?\n\t\n\t                    WAITRESS \n\t          Right away.\n\t\n\t                    DRUNK \n\t          We could have coffee together. My\n\t          name's Kenny.\n\t\n\tLilly looks over at the drunk's friend, who pointedly ignores\n\tthe situation.\n\t\n\t                    LILLY\n\t          Your pal wants you.\n\t\n\tThe drunk could turn mean; his gesture brushing away the idea\n\tof his friend is stronger than necessary.\n\t\n\t                    DRUNK\n\t          Let him find his own pretty woman.\n\t\n\tThe waitress arrives, with the coffee pot and a mug. She puts\n\tthe mug on the table, pours coffee.\n\t\n\t                    WAITRESS\n\t          This fellow bothering you, Ma'am?\n\t\n\t                    LILLY\n\t          Yes.\n\t\n\t                    WAITRESS\n\t              (to the drunk)\n\t          Why don't you go sit down?\n\t\n\t                    DRUNK\n\t          I'll sit here. Move over.\n\t\n\tThe drunk wants to sit beside Lilly, who looks to the\n\twaitress to solve the problem, but the waitress stands there\n\twith the coffee pot, looking helpless. The drunk bends to\n\tslide onto the seat. Lilly, exasperated, rabbit punches him\n\tin the throat.\n\t\n\tThe drunk, astounded and in pain (and not breathing),\n\tstaggers back, flailing, hitting the waitress's arm so that\n\tshe slops coffee on him as his feet tangle and he falls\n\theavily onto the floor.\n\t\n\tLilly, suddenly concerned, slides out of the booth.\n\t\n\t                    LILLY\n\t          Oh! Are you all right?\n\t\n\tShe goes to one knee beside the drunk, who clutches his own\n\tthroat with both hands, retching as he tries to inhale. Lilly\n\tlooks up at the astonished waitress.\n\t\n\t                    LILLY (CONT'D)\n\t          I shouldn't have hit him that hard.\n\t          I guess I don't know my own\n\t          strength.\n\t\n\tThe drunk's friend arrives and helps Lilly get the drunk to\n\this feet. The drunk is breathing now, but shaken. He looks at\n\tLilly with reproachful eyes. His friend transfers his\n\tannoyance at the drunk to Lilly.\n\t\n\t                    FRIEND \n\t          You didn't have to do that.\n\t\n\t                    LILLY\n\t              (matter of fact)\n\t          I thought I did. You should take\n\t          better care of your friend.\n\t\n\t                    DRUNK\n\t              (mumbled)\n\t          Outta here.\n\t\n\tThe drunk and his friend head for the exit, as Lilly turns to\n\tthe waitress.\n\t\n\t                    LILLY \n\t          I'm sorry a lady can't eat in here\n\t          without being bothered.\n\t\n\tThe waitress is apologetic, and also in awe of Lilly.\n\t\n\t                    WAITRESS \n\t          It won't happen again, Ma'am, I\n\t          promise. Dinner's on the house.\n\t          More chili? Dessert? We have lovely\n\t          pecan pie, my husband makes it\n\t          himself.\n\t\n\t                    LILLY \n\t          That sounds nice. Pecan pie. Thank\n\t          you.\n\t\n\tLilly sits down as the waitress goes back behind the counter.\n\t\n\tAN ANGLE on the waitress, as she puts down the coffee pot,\n\tbrings out the pecan pie, prepares to slice it, pauses, looks\n\twith wonder toward Lilly.\n\t\n\tEXT. RESTAURANT - NIGHT\n\t\n\tThe setting is a wide porch or lanai pretending to be a 19th\n\tcentury locale; a mix of western and antebellum south; the\n\tusual tourist confusion of histories. The effect is both\n\tromantic and false. Roy and Myra linger over wine, near the\n\tend of their meal. Roy's relaxed, happy, expansive. Myra's\n\tpleased but watchful, the bird watching the worm.\n\t\n\t                    ROY \n\t          You were right, I had to get out of\n\t          that hospital. Nothing wrong with\n\t          me any more.\n\t\n\t                    MYRA\n\t              (purring)\n\t          I'll sign that affidavit.\n\t\n\t                    ROY\n\t          Great to get away, take it easy.\n\t          Next week, I'll get back to work.\n\t\n\t                    MYRA\n\t          You already went back to work.\n\t\n\t                    ROY\n\t              (confused)\n\t          What?\n\t\n\t                    MYRA\n\t              (indulgent smile)\n\t          I watched you. Working the tap on\n\t          those soldier boys.\n\t\n\t                    ROY\n\t              (elaborate innocence)\n\t          Working the what?\n\t\n\t                    MYRA\n\t          Oh, come on, Roy.\n\t\n\tShe mimes rolling the die, slowly, showing how it will roll\n\tout of her hand just so, then speaks to him as though to a\n\tbright child.\n\t\n\t                    MYRA\n\t          The tap. What you do for a living.\n\t\n\t                    ROY\n\t          I'm a salesman.\n\t\n\t                    MYRA\n\t          You're on the grift. Same as me.\n\t\n\t                    ROY\n\t              (demonstrating patience)\n\t          Myra, I'm not following this.\n\t\n\t                    MYRA\n\t              (demonstrating\n\t               exasperation)\n\t          Roy, you're a short-con operator.\n\t          And a good one, I think. Don't talk\n\t          to me like I'm another square.\n\t\n\tRoy leans back, studying her, thinking it over, makes up his\n\tmind.\n\t\n\t                    ROY \n\t          You talk the lingo. What's your\n\t          pitch?\n\t\n\t                    MYRA \n\t          The long end. Big con.\n\t\n\t                    ROY\n\t              (shaking his head)\n\t          Nobody does that single-o.\n\t\n\t                    MYRA \n\t          I was teamed ten years with the\n\t          best in the business. Cole Langley.\n\t\n\t                    ROY \n\t          I've heard the name.\n\t\n\t                    MYRA \n\t          It was beautiful. And getting\n\t          better all the time.\n\t\n\t                    ROY\n\t              (skeptical)\n\t          Is that right?\n\t\n\t                    MYRA\n\t              (enthusiasm building)\n\t          It is, Roy! And now, right now,\n\t          it's the perfect time, the best\n\t          time since I've been in the game.\n\t\n\tEXT. DESERTED DOWNTOWN - DAY\n\t\n\tNew skyscrapers are separated by blank fields or small older\n\tbuildings. Almost no traffic. A white limo drives alone down\n\tthe street.\n\t\n\t                    MYRA (V.O.) \n\t          All over the southwest, you've got\n\t          these businessmen, they were making\n\t          money when everybody was making\n\t          money, they think that means\n\t          they're smart.\n\t\n\tINT. LIMO - DAY\n\t\n\tMyra, dressed expensively and fashionably, sits with\n\tGLOUCESTER HEBBING, a stocky businessman, sixtyish. Their\n\tmanner suggests intimacy.\n\t\n\t                    MYRA (V.O.)\n\t          And now they're hurting. Everything\n\t          they had was because of oil.\n\t\n\tEXT. NEW BUILDING - DAY\n\t\n\tGlossy, but no people around. The limo stops, the mustached\n\tCHAUFFEUR hops out and holds the door as Myra and Hebbing\n\temerge and cross to enter the building, Myra carrying an\n\tattache case.\n\t\n\t                    MYRA (V.O.)\n\t          They still got money, but they need\n\t          more money, and that's just the\n\t          kind of guy Cole and me like.\n\t\n\tINT. LIMO - DAY\n\t\n\tThe chauffeur gets back behind the wheel, adjusts the\n\tinterior mirror so he can see himself, peels off his\n\tmoustache, scratches his upper lip, refits the moustache more\n\tto his liking.\n\t\n\tINT. ATRIUM - DAY\n\t\n\tThis building has a central atrium with corridors circling\n\tit, waist-high walls on the atrium side, glass-walled\n\televators rising up through the atrium. Myra and Hebbing are\n\tvisible in an elevator coming up to a high floor. It stops\n\tand they exit, moving down the corridor.\n\t\n\t                    MYRA (V.O.)\n\t          When the oil money was good, they\n\t          put up all these office buildings,\n\t          and now they're half empty.\n\t\n\tINT. OFFICE - DAY\n\t\n\tECU, translucent glass in door with company name: COE, STARK,\n\tFELLOWES & ASSOCIATES, STOCK BROKERAGE - London - New York -\n\tDallas - Los Angeles - Tokyo. CAMERA PANS to follow Myra and\n\tHebbing as they enter the office.\n\t\n\tAN ANGLE showing the well-furnished outer office, the\n\tattractive and competent RECEPTIONIST welcoming Myra as\n\tsomeone she knows, gesturing her through, Myra graciously\n\taccepting, moving on. Hebbing's impressed by everything,\n\ttrying not to show it.\n\t\n\t                    MYRA  (V.O.)\n\t          They'll give you anything to move\n\t          in; first two months free,\n\t          redecoration, whatever you want.\n\t\n\tAN ANGLE in a clerical office, four CLERKS at well-equipped\n\tdesks with computer terminals, hard at work.\n\tMaps and clocks on the walls indicate the world. Myra and\n\tHebbing pass through.\n\t\n\t                    MYRA (V.O.)\n\t          They help you set up the store!\n\t\n\tAN ANGLE in the PRIVATE SECRETARY'S office, she on the phone,\n\tnodding and smiling at Myra and waving her through. Myra\n\tleads the way, opening a door marked HENRY FELLOWES, Partner.\n\t\n\t                    MYRA (V.O.)\n\t          I'm the roper, I go out and find\n\t          them and bring them in. Cole ran\n\t          the store, and he was the best.\n\t\n\tINT. COLE'S OFFICE - DAY\n\t\n\tMyra and Hebbing enter an office decorated with sleekly\n\tunderstated opulence; the view through large windows is of\n\tapparently-prosperous skyscrapers. Cole, a plausible rich\n\tbusinessman, happily greets Myra.\n\t\n\t                    COLE \n\t          Mary Beth! As beautiful as ever.\n\t\n\tHe lifts a dubious eyebrow toward Hebbing.\n\t\n\t                    COLE\n\t              (gentle disapproval)\n\t          I see you brought a friend.\n\t\n\tAs Mary Beth, Myra has a faint southern-belle accent and a\n\tclinging flirtatiousness.\n\t\n\t                    MYRA \n\t          Mister Hebbing is my bodyguard, my\n\t          strong right arm. Gloucester\n\t          Hebbing, may I present my fine\n\t          stockbroker, Henry Fellowes.\n\t\n\tThe men shake hands, Hebbing open and pleased and dignified,\n\tCole clearly holding something back.\n\t\n\t                    COLE \n\t              (to Myra; gentle warning) \n\t          Mary Beth, what we have here, uh...\n\t\n\t                    MYRA\n\t              (gaily innocent)\n\t          Oh, I told Mister Hebbing all about\n\t          it, how brilliant you are at making\n\t          money for your special clients!\n\t\n\t                    COLE\n\t              (alarmed)\n\t          Mary Beth, I hope you aren't\n\t          spreading this good news too\n\t          widely.\n\t\n\t                    MYRA \n\t          Well, of course not! I know how\n\t          dangerous this is. But I would\n\t          trust Mister Hebbing with anything.\n\t              (to Hebbing; suggestive)\n\t          Wouldn't I, darling?\n\t\n\tWhile Hebbing looks manly and flustered and pleased, Cole\n\tbrings from under his desk a partially full gray canvas sack\n\tmarked Federal Reserve Bank.\n\t\n\t                    COLE \n\t          Well, I'll have to take your word\n\t          for it, Mary Beth. Here's your\n\t          money.\n\t\n\t                    MYRA\n\t              (innocent avarice)\n\t          Goody!\n\t\n\tMyra opens her attache case on the desk. Cole takes banded\n\tstacks of bills from the sack, packs them neatly in the case.\n\tHebbing tries not to look envious and impressed.\n\t\n\tHEBBING'S POV: The top bill in each stack is a hundred.\n\t\n\tPREVIOUS SHOT. Myra takes a stack, riffles it for Hebbing's\n\tbenefit.\n\t\n\t                    MYRA \n\t          Isn't that just beautiful?\n\t\n\t                    HEBBING \n\t          Yes, it is.\n\t\n\tMyra returns the stack to the case, talks to Cole.\n\t\n\t                    MYRA \n\t          Henry, next time, couldn't Mister\n\t          Hebbing --\n\t\n\t                    COLE\n\t              (shocked)\n\t          Mary Beth! This has never been\n\t          anything but --\n\t\n\t                    MYRA \n\t          Oh, I know, I know, and you've been\n\t          wonderful since I was widowed. But\n\t          Mister Hebbing has--\n\t              (to Hebbing)\n\t          -- you don't mind my telling him,\n\t          darling --\n\t              (to Cole)\n\t          -- suffered reverses. If he\n\t          could...\n\t\n\tShe gestures vaguely, unable to describe the situation\n\taccurately. Hebbing fills in, bluff and hearty.\n\t\n\t                    HEBBING \n\t          Top up the tanks, as It were. Until\n\t          this little glitch in the oil\n\t          economy comes to an end.\n\t              (man to man laugh)\n\t          Not that I understand exactly what\n\t          you do, not from Mary Beth's\n\t          explanation.\n\t\n\tCole broods, studying Hebbing, deciding at last to trust him.\n\t\n\t                    COLE\n\t          Well. If Mary Beth vouches for you,\n\t          and if she told you the story\n\t          already...\n\t\n\t                    MYRA\n\t              (girlish laugh)\n\t          So here we are!\n\t\n\t                    COLE\n\t              (solemn)\n\t          Mister Hebbing, we are talking\n\t          about breaking the law here, I want\n\t          to be sure you understand that. No\n\t          one gets hurt, but the law does get\n\t          broken.\n\t\n\t                    HEBBING\n\t              (a real sport; laughing)\n\t          Well, that's what the law's for,\n\t          isn't it?\n\t\n\t                    COLE\n\t              (still serious)\n\t          And I don't just mean the SEC. We\n\t          could have the FBI breathing down\n\t          our necks.\n\t\n\t                    HEBBING\n\t              (suddenly serious)\n\t          I certainly hope not.\n\t\n\t                    COLE \n\t          Loose talk is the one thing I worry\n\t          about.\n\t\n\t                    HEBBING\n\t          I can keep my mouth shut, Mister\n\t          Fellowes.\n\t\n\tDescribing the scheme, Cole becomes increasingly\n\tenthusiastic.\n\t\n\t                    COLE \n\t          Okay, then. Sit down, sit down.\n\t\n\tHebbing sits on the sofa, Myra beside him, holding his arm in\n\tboth of hers. Cole paces, describing.\n\t\n\t                    COLE \n\t          The Tokyo Exchange is nine hours\n\t          ahead of us, New York one hour\n\t          behind. There isn't one hour of the\n\t          day when both are open. Information\n\t          moves, but it has to wait. Now, we\n\t          have a young fellow working here --\n\t          Do you know what a hacker is,\n\t          Mister Hebbing?\n\t\n\t                    HEBBING\n\t          One of those computer geniuses,\n\t          isn't it?\n\t\n\t                    COLE\n\t          You're right! And this boy tapped\n\t          into that main link between Tokyo\n\t          and the New York Stock Exchange. He\n\t          can give us, when it's really\n\t          useful, a seven second delay in\n\t          that movement of information. Do\n\t          you know what that means?\n\t\n\tHebbing doesn't want to admit ignorance.\n\t\n\t                    HEBBING \n\t          Well, you've got your information\n\t          ahead of New York, I see that.\n\t\n\t                    COLE \n\t          Every once in a while, a major\n\t          change comes through.\n\t          We have seven seconds to take\n\t          advantage, put our buy order, our\n\t          sell order, into the computer in\n\t          New York before the Tokyo data\n\t          comes in.\n\t\n\t                    HEBBING \n\t          Not much time.\n\t\n\t                    COLE \n\t          We have to be ready. We have to\n\t          have the money, and we have to know\n\t          what the information means, and we\n\t          have to move immediately.\n\t\n\t                    HEBBING \n\t              (impressed)\n\t          Seven seconds. I don't see how you\n\t          do it.\n\t\n\t                    COLE \n\t          These machines -- They're in here.\n\t\n\tCole crosses to an inner door, pushes it partway open, looks\n\tback grinning with his hand on the knob.\n\t\n\t                    COLE \n\t          Want a look?\n\t\n\t                    MYRA \n\t          Oh, Henry, no, that's just boring.\n\t\n\tINT. BARE ROOM - DAY\n\t\n\tA bare dusty room. A ladder leans against a wall, a paint can\n\ton the floor beside it. Only Cole is visible in the open\n\tdoorway. He speaks back into the main office.\n\t\n\t                    COLE \n\t          Come take a look. An entire-suite\n\t          of main-frame computer.\n\t\n\t                    MYRA (O.S.)\n\t          We're not really interested, Henry.\n\t\n\tINT. COLE'S OFFICE - DAY\n\t\n\tCole remains in the doorway, luring Hebbing with a smile.\n\t\n\t                    COLE \n\t          It's quite a sight. You sure?\n\t\n\tCole's pushing this too far. Hebbing's thinking politeness\n\trequires him to look. Myra's nervous, her smile with an edge\n\tto it.\n\t\n\t                    MYRA \n\t          Henry, don't try Mister Hebbing's\n\t          patience. He knows what machines\n\t          look like.\n\t\n\tINT. BARE ROOM - DAY\n\t\n\tCole smiles at the empty room again, looks back.\n\t\n\t                    COLE \n\t          Well, if you're sure.\n\t\n\tHe shuts the door.\n\t\n\t                    ROY (V.O.) \n\t          Cole liked to take risks, huh?\n\t\n\tEXT. RESTAURANT - NIGHT\n\t\n\tRoy and Myra at the table.\n\t\n\t                    MYRA \n\t          He didn't think they were risks. He\n\t          was so good, Roy, he could just\n\t          play with the mark.\n\t\n\t                    ROY \n\t          And when he got serious?\n\t\n\t                    MYRA \n\t          He'd explain he had to have cash,\n\t          so there wouldn't be any paper\n\t          trail for the SEC. And a lot of\n\t          cash, or it wasn't worth while. The\n\t          least we ever took was forty\n\t          thousand, and the most was one\n\t          hundred eighty-five thousand\n\t          dollars! From one sucker!\n\t\n\t                    ROY \n\t          I thought these people were broke.\n\t\n\t                    MYRA \n\t          No, no, Roy, just cash poor. They\n\t          had savings accounts, stocks to\n\t          sell, houses to mortgage. Sell\n\t          their wife's jewelry. Oh, they had\n\t          a lot of money, when they put their\n\t          minds to it.\n\t          Or when I put their minds to it. I\n\t          stayed with them, that's the\n\t          roper's job, made them get up every\n\t          penny they could raise, turn it all\n\t          over to Cole.\n\t\n\t                    ROY \n\t          And a month later, the sucker calls\n\t          the cops and you're on the run.\n\t\n\t                    MYRA \n\t          No no! He never calls the cops, not\n\t          after we give him the blow-off.\n\t\n\t                    ROY \n\t          Yeah? How?\n\t\n\tINT. HOTEL ROOM - DAY\n\t\n\tMyra puts a blood-filled four-inch-square plastic package\n\tinto her bra on the left side, then puts on a white blouse.\n\t\n\t                    MYRA  (V.O.)\n\t          Three or four days after Cole got\n\t          the money, he'd phone the sucker,\n\t          tell him he'd made the move.\n\t\n\tEXT. NEW BUILDING - DAY\n\t\n\tMyra and Hebbing hurry across the sidewalk from the limo,\n\teach carrying an attache case.\n\t\n\t                    MYRA (V.O.)\n\t          Our buy was in the computer, we\n\t          were rich, he should come collect.\n\t\n\tINT. COLE'S OFFICE - DAY\n\t\n\tMyra and Hebbing enter, Cole meets them, all happy.\n\t\n\t                    COLE \n\t          Here you are! Two rich people!\n\t\n\t                    HEBBING\n\t          I must admit, Mister Fellowes, I\n\t          had moments I was worried.\n\t\n\t                    COLE\n\t          You brought a case? Good.\n\t\n\tCole brings out the canvas sack from under the desk, reaches\n\tin, brings out a stack of bills. The door opens and two men\n\tin suits and topcoats and hats enter, one of them flashing a\n\tbadge. (These are, altered, two of the clerks from before.)\n\t\n\t                    MAN\n\t          Hold it right there!\n\t\n\t                    COLE\n\t              (cool outrage)\n\t          What? This is a private office!\n\t\n\t                    MAN\n\t          FBI! Stock fraud, tampering with\n\t          Exchange communications --\n\t\n\tCole suddenly loses all control, becomes a gibbering wreck.\n\t\n\t                    COLE\n\t          Oh, my God! No! The scandal!\n\t\n\tThe second man approaches Hebbing, pencil and notebook at the\n\tready, manner cold and tough.\n\t\n\t                    SECOND MAN\n\t          Your name?\n\t\n\t                    HEBBING\n\t          My --? I don't I only --\n\t\n\t                    COLE\n\t              (screams at Myra)\n\t          You! You and your goddamn big\n\t          mouth!\n\t\n\t                    KYRA\n\t              (terrified)\n\t          Henry, no, I --\n\t\n\t                    COLE\n\t          Who did you tell? Who?\n\t\n\t                    MYRA\n\t          Just one or two of the girls, just,\n\t          they wouldn't --\n\t\n\tCole pulls a pistol from his desk drawer.\n\t\n\t                    COLE \n\t          Don't move!\n\t\n\t                    MAN\n\t          Mister Fellowes, that isn't going\n\t          to do you any good. Put that down,\n\t          and --\n\t\n\tCole ignores him, staring in frantic hatred at Myra.\n\t\n\t                    COLE \n\t          You ruined me! You destroyed me!\n\t\n\t                    MYRA \n\t          Henry, no!\n\t\n\tCole shoots her, the SOUND very loud, the men flinching away.\n\tMyra slaps her hand to her breast; blood spurts between her\n\tfingers. In terror, she turns toward Hebbing, who stares at\n\tthe blood seeping down her white blouse. She tries to speak,\n\tcan't. She reaches out, her bloody hand sliding down\n\tHebbing's front without getting any purchase, leaving a swath\n\tof blood diagonally across his jacket, shirt and tie. She\n\ttopples forward. Hebbing tries to hold her, but she slips to\n\tthe floor.\n\t\n\tCole runs around the desk toward the door, waving the gun.\n\t\n\t                    COLE \n\t          Get back! Get back!\n\t\n\tThe men warily move away from the door.\n\t\n\t                    COLE \n\t          I'll kill the first one that\n\t          follows me!\n\t\n\tCole runs from the room. The two men pull guns from hip\n\tholsters under their coat-tails. Hebbing, kneeling beside\n\tMyra, watches them approach the door, crouch, run through.\n\tHebbing rises, looks around, runs to the inner door, finds it\n\tlocked. He crosses to the main door, looks out, cautiously\n\tcreeps from the room.\n\t\n\tMyra sits up.\n\t\n\tINT. OFFICE - DAY\n\t\n\tHebbing hurries through the empty secretary's office and out\n\tthe other door. The two men enter from a different door and\n\tcross to re-enter Cole's office.\n\t\n\tINT. ATRIUM - DAY\n\t\n\tCole stands behind a pillar, watching. Across the way,\n\tHebbing comes out of the office, staring around, trying to\n\twipe the blood from his clothes. In obvious panic, he runs to\n\tthe elevator, presses the button.\n\t\n\tAN ANGLE through the glass wall into the elevator as it\n\tstops. The doors open, Hebbing hurries in, frantically jabs\n\tthe button. The elevator descends. CAMERA PANS to Cole coming\n\taround the corridor, entering the office.\n\t\n\tINT. COLE'S OFFICE - DAY\n\t\n\tGeneral hilarity. The secretary, two men, other two clerks,\n\tchauffeur and receptionist are all present, opening\n\tchampagne, Hebbing's money now out of the sack and spread on\n\tthe desk. Myra, stripped to the waist (unconcerned about the\n\tothers present) cleans blood from her breasts with damp\n\ttowels. He and Myra look at one another across the room,\n\tbroadly smile.\n\t\n\tEXT. RESTAURANT - NIGHT\n\t\n\tMyra's very up, from reliving this story.\n\t\n\t                    MYRA \n\t          Oh, Roy, it was great! We were\n\t          rolling in dough, lived wherever we\n\t          wanted, only pulled two or three\n\t          scams a year.\n\t\n\t                    ROY \n\t          What happened to Cole?\n\t\n\t                    MYRA\n\t              (suddenly evasive)\n\t          He retired.\n\t\n\t                    ROY \n\t          Where?\n\t\n\t                    MYRA \n\t          Upstate.\n\t\n\t                    ROY \n\t          Upstate where?\n\t\n\t                    MYRA\n\t          Atascadero.\n\t\n\t                    ROY \n\t          That's where they keep the\n\t          criminally insane, isn't it?\n\t\n\tMyra turns her face away.\n\t\n\tINT. HOTEL ROOM - DAY\n\t\n\tExpensive room. Cole, naked, expression haunted and crazed,\n\tsits cross-legged on the bed. Myra enters, happy, carrying\n\tdress shop boxes. She stops, shocked, when she sees Cole.\n\t\n\t                    MYRA\n\t          No, baby. Not again.\n\t\n\tHe stares at the floor over the edge of the bed, like a\n\tshipwreck victim in a raft looking at the sea.\n\t\n\t                    COLE\n\t          It's hollow. You'll fall through.\n\t\n\tMyra drops the packages on a chair.\n\t\n\t                    MYRA\n\t          Cole, it'll be all right. Honey?\n\t\n\t                    COLE \n\t              (frightened but\n\t               determined)\n\t          Can't move.\n\t\n\t                    MYRA \n\t          It's just the strain again, the\n\t          stress. We'll take a vacation.\n\t\n\t                    COLE\n\t          It's all hollow. Nothing behind it.\n\t\n\tShe approaches him, scared but needing him.\n\t\n\t                    MYRA \n\t          Cole, you scare me when this\n\t          happens. One of these times...\n\t\n\tShe touches him. He suddenly lashes out, knocking her\n\tbackward, glaring at her.\n\t\n\t                    COLE \n\t          Demon! Demon! That's why you can\n\t          walk on it! Demon!\n\t\n\t                    MYRA\n\t              (heartbroken)\n\t          Oh, Cole, please. Please come out\n\t          of it. What would I do without you?\n\t\n\tDistracted, gone, unaware of her existence, he gazes around,\n\thugs himself, sits staring at demons. She watches him,\n\tmournful, knowing he's gone.\n\t\n\tEXT. RESTAURANT - NIGHT\n\t\n\tMyra looks back at Roy. Her expression makes it clear she\n\tisn't going to tell him any more than she already has.\n\t\n\t                    MYRA \n\t          He retired, and that's it. But I\n\t          didn't. I'm still the best long-con\n\t          roper you'll ever see.\n\t\n\tRoy laughs, genuinely pleased by her and also tacitly letting\n\this questions drop.\n\t\n\t                    ROY \n\t          I just bet you are, too. And now\n\t          you're trying to rope me.\n\t\n\t                    MYRA\n\t              (pushing enthusiasm)\n\t          Join up with you! I watched you,\n\t          Roy, I've been watching you,\n\t          wondering if I should talk about\n\t          this at all, or maybe just...\n\t              (shrug)\n\t\n\t                    ROY \n\t          Take a hike, you mean?\n\t\n\t                    MYRA \n\t          I need a partner, Roy. I need an\n\t          inside man, and you're it. You\n\t          could be as wonderful as Cole.\n\t\n\t                    ROY \n\t              (dubious)\n\t          I don't know, Myra, I never had\n\t          partners. I never needed them.\n\t\n\t                    MYRA \n\t          Not to take soldiers for a hundred\n\t          bucks. But how about taking a bank\n\t          president for a hundred grand?\n\t\n\tRoy doesn't like this; he's feeling pressured. Myra sees it,\n\tbut believes she's got him anyway, so she can let up. She\n\tpats his hand.\n\t\n\t                    MYRA \n\t          Think about it. Okay?\n\t\n\t                    ROY\n\t              (easy to promise)\n\t          Sure.\n\t\n\tINT. HOTEL CORRIDOR - NIGHT\n\t\n\tA little drunk and happy, Roy and Myra come down the corridor\n\ttogether, then make it obvious they're going into separate\n\trooms, across the corridor from one another.\n\t\n\t                    MYRA\n\t              (coy, sexy)\n\t          See you later.\n\t\n\tRoy complains, but half-heartedly, half humorously; this\n\targument has already taken place.\n\t\n\t                    ROY \n\t          I still don't see why we have to\n\t          have separate rooms. You expect\n\t          your father to come through?\n\t\n\t                    MYRA \n\t          Separate bathrooms, darling. I will\n\t          not lay out all my cosmetics for\n\t          you to knock over.\n\t\n\t                    ROY\n\t              (nevertheless grumpy)\n\t          Things a man isn't supposed to\n\t          know.\n\t\n\t                    MYRA\n\t              (soothing)\n\t          You don't mind, really, do you,\n\t          Roy? It's been such a wonderful\n\t          evening, I guess I just wore myself\n\t          out.\n\t\n\t                    ROY \n\t          Sure. I'm pretty tired myself.\n\t\n\tThey unlock the opposing doors, look back at one another.\n\tMyra's smile and good-night wave are consciously cute. Roy's\n\tresponse is a little forced. They go into their rooms.\n\t\n\tINT. HOTEL ROOM - NIGHT\n\t\n\tOnce he's alone, Roy stops trying to look like a good sport.\n\tDisgusted, he tosses the room key onto the dresser, then\n\tcrosses to sliding glass doors closed in front of a balcony.\n\tHe's about to close the drapes when he looks out, changes his\n\tmind, unlocks and opens the door. He steps outside.\n\t\n\tEXT. BALCONY - NIGHT\n\t\n\tA high floor, with a wide view of ocean and starry sky. Roy\n\tleans on the rail, looking out, thinking. He mutters to\n\thimself.\n\t\n\t                    ROY \n\t          Long con. I'm the one's been\n\t          conned. Who needs this?\n\t\n\tHe continues to stand there, taking some solace from the\n\tnight. BEAT. Phone RINGS. Confused, irritated, he turns to\n\tlook into the room. Phone RINGS. At last, he goes back into\n\tthe room.\n\t\n\tINT. HOTEL ROOM - NIGHT\n\t\n\tRoy crosses to pick up the phone, grumpy and suspicious.\n\t\n\t                    ROY \n\t          Yeah?\n\t\n\t                    MYRA (V.O.)\n\t              (filtered)\n\t          Open your door.\n\t\n\t                    ROY \n\t          What?\n\t              (grins; gets it)\n\t          What for?\n\t\n\t                    MYRA (V.O.) \n\t              (filtered)\n\t          Open it and find out.\n\t\n\tRoy hangs up and crosses to the door.\n\t\n\tAN ANGLE directly at the door as Roy opens it, showing Myra's\n\tdoor open across the way, Myra standing in her doorway naked.\n\tShe waves at him to move over.\n\t\n\t                    MYRA (CONT'D)\n\t          Gangway!\n\t\n\tRoy steps back, holding his door open.\n\t\n\tINT. HOTEL CORRIDOR - NIGHT\n\t\n\tAN ANGLE down the hall as Myra skips across from her room to\n\tRoy's, her door slamming behind her.\n\t\n\tINT. HOTEL ROOM - NIGHT\n\t\n\tMyra runs in, giggling. Roy shuts the door, laughing at her.\n\t\n\t                    MYRA\n\t              (coquettish)\n\t          I hope you don't mind, sir. I just\n\t          washed my clothes, and I couldn't\n\t          do a thing with them.\n\t\n\tRoy's pleased, but at a loss.\n\t\n\t                    ROY \n\t          You -- I don't know.\n\t\n\t                    MYRA\n\t              (sudden burst of laughter)\n\t               )\n\t          If you could have seen your face\n\t          when I told you good night! You\n\t          looked so, so... Ah!\n\t\n\t                    ROY \n\t          Oh, come here.\n\t\n\tThey embrace.\n\t\n\tINT. MOTEL ROOM - DAY\n\t\n\tA clean anonymous Holiday Inn. Lilly, dressed for the track,\n\tsits at the round table under the swag light, sorting through\n\ther business purse. There's a folded newspaper on the table.\n\tKNOCK on the door. She's startled. For just a second, she's\n\tlike a trapped animal. Then she's calm again. She turns the\n\tpurse around, opens another zipper section, removes a pistol\n\tand a silencer, quickly screws the silencer onto the pistol,\n\tlays the pistol on the table and covers it with the\n\tnewspaper. Then she crosses to open the door.\n\t\n\tAN ANGLE to include Roy in the doorway, grinning, easy.\n\tLilly's surprised, pleased, but wary.\n\t\n\t                    LILLY \n\t          Roy! What are you doing in San\n\t          Diego?\n\t\n\t                    ROY\n\t              (entering)\n\t          Myra and me come down to LaJolla\n\t          for the weekend.\n\t\n\tLilly makes a face, but no comment, at Myra's name, as she\n\tcloses the door.\n\t\n\t                    LILLY\n\t          If you come out to the track, don't\n\t          know me.\n\t\n\t                    ROY\n\t          We won't hit the track. The beach.\n\t          Couple a nice restaurants.\n\t\n\tHe takes from his pockets the wads of money held removed from\n\tthe clown pictures, extends them toward her.\n\t\n\t                    LILLY\n\t          What's that?\n\t\n\t                    ROY\n\t          Four grand. For the hospital. Is\n\t          that enough?\n\t\n\t                    LILLY\n\t              (distressed)\n\t          Roy, I don't want money from you.\n\t\n\t                    ROY\n\t          I pay my debts.\n\t\n\t                    LILLY\n\t              (level skeptical look)\n\t          You do?\n\t\n\tSince she won't take the money, he turns to put it on the\n\ttable beside her purse, pushing the newspaper out of the way,\n\trevealing the gun. He gives it a surprised smile.\n\t\n\t                    ROY\n\t          Expecting visitors?\n\t\n\t                    LILLY\n\t          No. That was the point.\n\t\n\tShe crosses to unscrew the silencer and put both pieces back\n\tin her purse. Roy, watching, points at the still angry burn\n\ton her hand.\n\t\n\t                    ROY \n\t          You ought to put a bandage on that.\n\t\n\t                    LILLY\n\t          No can do. Have to dip in and out\n\t          of my bag too much. Besides, it'll\n\t          heal in the air.\n\t\n\tDisdainful and hurt, she pushes at the wads of money.\n\t\n\t                    LILLY (CONT'D)\n\t          Roy, take that back.\n\t\n\tHis own hostility shows through.\n\t\n\t                    ROY \n\t          No.\n\t\n\tShe's not used to being vulnerable, can neither hide it nor\n\treally express it; can't use it as a tactic.\n\t\n\t                    LILLY\n\t          I thought... I was hoping we could\n\t          play it straight with one another.\n\t\n\t                    ROY \n\t          I guess not. You'll be heading east\n\t          from here, huh?\n\t\n\t                    LILLY \n\t              (dull)\n\t          After the meet. Back to Baltimore.\n\t\n\t                    ROY \n\t          Well... nice to see you again,\n\t          Lilly.\n\t\n\t                    LILLY\n\t          You, too, Roy.\n\t\n\tRoy finds this parting unsatisfactory, but has nothing to\n\tadd. With a shrug, he leaves. Lilly looks after him, her\n\texpression becoming resentful, dully angry.\n\t\n\t                    LILLY \n\t          Prick.\n\t\n\tEXT. HOLIDAY INN - DAY\n\t\n\tMyra sits in the back seat of a taxi parked across the street\n\tfrom the motel. The door to Lilly's room is visible in b.g.\n\tRoy walks toward the street from Lilly's room.\n\t\n\t                    DRIVER\n\t          Here he comes.\n\t\n\t                    MYRA\n\t          I see him.\n\t\n\tReaching the sidewalk, Roy turns to an empty cab parked on\n\tthat side of the street, in front of the motel. Myra's driver\n\tshifts into gear.\n\t\n\t                    MYRA (CONT'D)\n\t          Wait. Hold it.\n\t\n\t                    DRIVER\n\t          That's the guy we're following.\n\t\n\t                    MYRA\n\t          Just wait.\n\t\n\tRoy enters the other cab, which drives away, as Lilly comes\n\tout of her room in b.g.\n\t\n\t                    MYRA (CONT'D)\n\t          Ah.\n\t\n\tLilly gets into her Chrysler, backs away from the slot,\n\tdrives to the street.\n\t\n\t                    MYRA (CONT'D)\n\t          Now we follow her.\n\t\n\t                    DRIVER\n\t          You're the boss.\n\t\n\tAN ANGLE on the two vehicles, as they leave the motel.\n\t\n\tEXT. DELMAR - DAY\n\t\n\tWhere the surf meets the turf. Over the punters' heads, out\n\tbeyond the track, spreads the Pacific Ocean, unnoticed,\n\tignored. In every shot in this sequence, the ocean is visible\n\tbut not looked at.\n\t\n\tAN ANGLE on Lilly, with her heavy shoulderbag, moving along\n\tempty tables, here and there picking up used tickets.\n\t\n\tAN ANGLE on Myra, on a different level, watching Lilly.\n\t\n\tAN ANGLE on Lilly at the betting windows.\n\t\n\tAN ANGLE on Myra, on a high vantage point in the stands. A\n\tMAN near her watches the field through binoculars. Myra ASKS\n\tif she can borrow them for a minute. Men are always happy to\n\tdo Myra favors; the man gives her the binoculars. She looks\n\tat the field briefly, then turns and looks through the\n\tbinoculars the other way, outside the track. The man,\n\tsurprised, looks the same way.\n\t\n\tMAN'S POV: The parking area.\n\t\n\tPREVIOUS SHOT. The man looks in curiosity at Myra, who\n\tconcentrates, adjusting the focus.\n\t\n\tMYRA'S POV: Foreshortened through the binoculars, Lilly opens\n\tthe Chrysler's trunk, stashes money.\n\t\n\tPREVIOUS SHOT. Myra smiles, turns it into a sweet thank-you\n\tsmile as she returns the binoculars to their owner.\n\t\n\tEXT. HOTEL POOL - DAY\n\t\n\tRoy dives into the pool, swims underwater to the ladder,\n\tclimbs out near a YOUNG BLONDE on a chaise longue, who's been\n\tadmiring him.\n\t\n\t                    BLONDE\n\t          You stay down real good.\n\t\n\t                    ROY\n\t          One of my talents.\n\t\n\t                    BLONDE \n\t              (pointing upward)\n\t          Your mother's calling.\n\t\n\tRoy looks up.\n\t\n\tAN ANGLE to show Myra waving from her balcony, four flights\n\tup.\n\t\n\tPREVIOUS SHOT. Roy's at first surprised, then amused by the\n\tblonde.\n\t\n\t                    ROY\n\t          Naughty.\n\t\n\tHe gathers up his towel and heads for the building.\n\t\n\tINT. BATHROOM - DAY\n\t\n\tRoy stands in heavy spray in the shower, half asleep, gently\n\ttouching his stomach where the bruise used to be. KNOCK on\n\tdoor. He ignores it.\n\t\n\t                    MYRA (O.S.)\n\t          Roy! You drown in there?\n\t\n\tHe rouses himself.\n\t\n\t                    ROY \n\t          Be right out!\n\t\n\tINT. HOTEL ROOM - DAY\n\t\n\tMyra moves away from the bathroom door. She's in a bad mood.\n\tShe paces back and forth, out onto the balcony, then back\n\tinto the room as Roy comes out of the bathroom wearing a\n\ttowel.\n\t\n\t                    ROY\n\t          You were gone for a while.\n\t\n\t                    MYRA\n\t              (casual)\n\t          I went out to Delmar.\n\t\n\t                    ROY\n\t              (suddenly wary) )\n\t          The track? Did you run into Lilly?\n\t\n\t                    MYRA \n\t          I saw her.\n\t\n\t                    ROY\n\t          She didn't see you, in other words.\n\t\n\t                    MYRA \n\t          I'm not trying to make trouble,\n\t          Roy. It's just, she's always so\n\t          nasty to me, I thought, who is she\n\t          to be so high and mighty. I saw her\n\t          out there, and I called a friend of\n\t          mine in Baltimore, so now I know\n\t          who she is.\n\t\n\t                    ROY\n\t              (dry)\n\t          You must have some very\n\t          knowledgeable friends.\n\t\n\t                    MYRA \n\t          I'm well connected, Roy, Cole\n\t          introduced me to a lot of people.\n\t          Very valuable. Valuable for us.\n\t\n\t                    ROY \n\t          Running your broker scam, you mean.\n\t\n\t                    MYRA\n\t              (enthusiastic)\n\t          You and me, Roy. What a team we'll\n\t          make. We think alike; we get along\n\t          together.\n\t          Once or twice a year we take some\n\t          slob, the rest of the time we live\n\t          like this. You won't regret this,\n\t          Roy.\n\t\n\t                    ROY\n\t          Regret what? I didn't say I was\n\t          coming aboard.\n\t\n\t                    MYRA \n\t          But why not? I thought it was\n\t          settled. What's holding you back?\n\t\n\t                    ROY \n\t          Come on, Myra, don't talk business\n\t          here. This is time out.\n\t\n\tShe considers him.\n\t\n\t                    MYRA \n\t          You mean, it would be too tough to\n\t          give me a turndown here. Easier on\n\t          home grounds.\n\t\n\t                    ROY\n\t              (shrug)\n\t          Yes or no. They're both easier at\n\t          home. Okay?\n\t\n\tMyra makes a visible effort to be accommodating.\n\t\n\t                    MYRA \n\t          Whatever you say, darling.\n\t\n\tINT. KAGGS' OFFICE - DAY\n\t\n\tKaggs sits at his computer terminal, bringing up data, not\n\tpleased by what he sees. Buzzer SOUNDS. He swivels to the\n\tdesk, presses the intercom button.\n\t\n\t                    KAGGS \n\t          Yeah?\n\t\n\t                    RECEPTIONIST (V.O.)\n\t          Roy Dillon, Mr. Kaggs.\n\t\n\t                    KAGGS \n\t          Good! Send him in.\n\t\n\tWith a now-we're-getting-somewhere manner, Kaggs turns back\n\tto the VDT, punches up a different set of data, sits looking\n\tat it in gloomy satisfaction. Roy enters, and Kaggs rises,\n\textending his hand across the desk. They shake hands.\n\t\n\t                    KAGGS \n\t          Good to have you back, Roy. I was\n\t          just looking at --\n\t\n\t                    ROY \n\t          Mr. Kaggs, I'm sorry.\n\t\n\t                    KAGGS \n\t              (keen)\n\t          You're turning me down? Makes no\n\t          sense, Roy.\n\t\n\t                    ROY \n\t          I guess I'm just not a leader of\n\t          men.\n\t\n\t                    KAGGS \n\t          Oh, come on, Roy.\n\t\n\t                    ROY \n\t          The truth is, Mr. Kaggs --\n\t\n\t                    KAGGS \n\t          Perk, remember?\n\t\n\t                    ROY \n\t          Okay, fine. Perk, the truth is, I\n\t          like things the way they are now.\n\t          Pick my own hours, have time for,\n\t          uh, other activities...\n\t\n\t                    KAGGS \n\t          A well-rounded life. I respect\n\t          that. But it has to have a center,\n\t          Roy, something you care about,\n\t          something you can think about.\n\t\n\t                    ROY \n\t          Maybe I'm just not ready for that\n\t          yet.\n\t\n\t                    KAGGS\n\t              (deep sigh)\n\t          Well, Roy, if that's the way you\n\t          feel, I won't badger you.\n\t              (forced laugh)\n\t          Don't want to lose you as a\n\t          salesman, too.\n\t\n\t                    ROY \n\t          Oh, I'd like to stay on. Just keep\n\t          everything the way it was.\n\t\n\t                    KAGGS \n\t          That's what we'll do, then. But I\n\t          tell you what, Roy. Before I hire\n\t          anybody else, I'll ask you one last\n\t          time. Fair enough?\n\t\n\t                    ROY \n\t          Fair enough.\n\t\n\tThey shake hands.\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tRoy's room. He has one of the clown pictures face down on the\n\tcoffee table. He takes money from his jacket pockets, crams\n\tit into the space, which is now just about full. As he's\n\ttightening the wing nuts closing the back, doorbell RINGS. He\n\thurries, finishing the job, hanging the picture on the wall,\n\tthen crossing to open the door. Myra enters, ebullient.\n\t\n\t                    MYRA \n\t          Darling, guess what? I had to tell\n\t          you right away.\n\t\n\tShe gives him an enthusiastic kiss, then marches into the\n\tliving room.\n\t\n\t                    ROY \n\t              (grinning)\n\t          And hello to you, too.\n\t\n\t                    MYRA \n\t          I called a fellow I know in Tulsa,\n\t          the one who plays my chauffeur.\n\t          There's a sucker there he says is\n\t          made for us. And a boroker that\n\t          just shut down, we can use their\n\t          office, not change a thing! Now, I\n\t          can scrape up ten grand without\n\t          much trouble. That leaves fifteen\n\t          or twenty for your end. We could\n\t          start this weekend, get the sucker\n\t          into position --\n\t\n\t                    ROY \n\t          Wait a minute! When did this\n\t          happen, that we're partners?\n\t\n\t                    MYRA \n\t              (bewildered)\n\t          What?\n\t\n\t                    ROY \n\t          The last I looked, we were just\n\t          talking things over.\n\t\n\t                    MYRA \n\t          But the setup's there. It's there\n\t          now.\n\t\n\t                    ROY \n\t          I don't think I need it.\n\t\n\t                    MYRA \n\t          You're too good for the small-time,\n\t          Roy. Move up to where there's big\n\t          dough to be made, and you don't\n\t          have to stick your neck out every\n\t          day.\n\t\n\t                    ROY \n\t          Maybe I like it where I am.\n\t\n\tMyra's need breaks through her good sense.\n\t\n\t                    MYRA \n\t          Well, maybe I don't! I had ten good\n\t          years with Cole, and I want them\n\t          back! I gotta have a partner! I\n\t          looked and I looked and believe me,\n\t          brother, I kissed a lot of fucking\n\t          frogs, and you're my prince!\n\t\n\tRoy tries to treat this lightly.\n\t\n\t                    ROY\n\t          Don't I get any say in this?\n\t\n\t                    MYRA \n\t          No! Because I --\n\t\n\t                    ROY\n\t              (pointing at her)\n\t          That's what I say.\n\t\n\t                    MYRA\n\t              (thrown off course)\n\t          What?\n\t\n\t                    ROY \n\t          What I say is, no. We don't do\n\t          partners.\n\t\n\t                    MYRA (CONT'D)\n\t              (raging)\n\t          For Christ's sake, why not?\n\t\n\t                    ROY \n\t          Mostly, because you scare the shit\n\t          out of me. I've seen people like\n\t          you before, baby. Double-tough and\n\t          sharp as they come, and you get\n\t          what you want or else. But you\n\t          don't make it work forever.\n\t\n\t                    MYRA \n\t          Bullshit!\n\t\n\t                    ROY \n\t          No; history. Sooner or later, the\n\t          lightning hits. I don't want to be\n\t          around when it hits you.\n\t\n\tShe stares at him, trying to find a chink in the armor,\n\ttrying to find a reason, trying to find something.\n\t\n\t                    MYRA \n\t          What is it? What's going on?\n\t\n\t                    ROY \n\t          I'm happy the way I am.\n\t\n\t                    MYRA \n\t          By God, it's your mother. It's\n\t          Lilly.\n\t\n\t                    ROY\n\t              (doesn't get it) )\n\t          What?\n\t\n\t                    MYRA \n\t          Sure it is. That's why you act so\n\t          funny around each other.\n\t\n\tHe frowns at her, not believing he understands her right.\n\t\n\t                    ROY \n\t          What's that?\n\t\n\t                    MYRA \n\t          Don't act so goddamned innocent!\n\t          You and your own mother, gah! You\n\t          like to go back where you been,\n\t          huh?\n\t\n\tHe takes a step toward her, rising toward fury.\n\t\n\t                    ROY \n\t          You watch that mouth.\n\t\n\t                    MYRA \n\t          I'm wise to you, I should have seen\n\t          it before, you rotten son of a\n\t          bitch. How is it, huh? How do you\n\t          like --\n\t\n\tHe slaps her openhanded but hard, and she staggers back. He\n\tpursues her.\n\t\n\t                    ROY \n\t          How do you like this?\n\t\n\tHe slaps her as hard with the other hand. Astonished,\n\tfrightened, befuddled, she backpedals, bringing her forearms\n\tup to protect her face. He grabs her two wrists in one hand,\n\tholds them out of the way, slaps her forehand and backhand,\n\tforehand and backhand.\n\t\n\t                    MYRA \n\t          STOP!!\n\t\n\tHe suddenly gets control of himself, releases her, steps back\n\tinto the middle of the room. He's angry, but also remorseful,\n\tsorry he lost control but still enraged at the enormity of\n\ther suggestion.\n\t\n\t                    ROY \n\t          That's not like me. I don't do\n\t          violence.\n\t\n\tShe cowers against the wall, peering in terror at him through\n\ther raised arms. He settles down, becomes heavily calm.\n\t\n\t                    ROY \n\t          That's why we wouldn't work\n\t          together. You're disgusting. Your\n\t          mind's so filthy, it's hard even to\n\t          look at you.\n\t\n\tHe crosses to the apartment door, pulls it open. Sunlight\n\tpours in.\n\t\n\t                    ROY \n\t          Goodbye, Myra.\n\t\n\tShe lowers her arms slowly, as though her whole body aches.\n\tShe's still scared, but angry now, too. She'd like to tell\n\thim off, but discretion tells her not to. She moves across\n\tthe room toward the open door, but stops, not wanting to be\n\tthat close to him.\n\tUnderstanding, he backs away from the doorway, gestures with\n\tcold irony for her to proceed. She moves to the threshold,\n\tlooks back at him.\n\t\n\t                    MYRA \n\t          And you don't even know it.\n\t\n\tAngry again, Roy steps forward. She hastily steps outside,\n\tand he slams the door.\n\t\n\tEXT. ROY'S APARTMENT - DAY\n\t\n\tMyra moves slowly along the balcony, muttering to herself.\n\t\n\t                    MYRA \n\t          Mama. It's Mama. She's the one.\n\t\n\tShe stops, holding the balcony rail, looking out at the city.\n\t\n\t                    MYRA \n\t          You'll get yours, Mama. Oh, yes.\n\t\n\tINT. MOTEL ROOM - DAY\n\t\n\tLilly's room; empty. Phone RINGS. Lilly enters, tired, with\n\ther shoulderbag; the end of her work day. Phone RINGS. She\n\tfrowns at it, expecting nothing good, then drops the\n\tshoulderbag on the bed, crosses, answers.\n\t\n\t                    LILLY \n\t          Yes?\n\t\n\tA sudden smile doesn't entirely hide the wariness.\n\t\n\t                    LILLY \n\t          Roy! An unexpected pleasure.\n\t\n\tINT. LIVING ROOM - DAY\n\t\n\tRoy, troubled, paces while talking on the phone.\n\t\n\t                    ROY \n\t          Lilly, I've got a couple things to\n\t          think about. Well, kind of job\n\t          offers, kind of. Different ways to\n\t          go. I'd kind of like to talk them\n\t          out, you know? Maybe just hear\n\t          myself talk.\n\t\n\tINT. MOTEL ROOM - DAY\n\t\n\tLilly's delighted, but can't trust this moment more than any\n\tother.\n\t\n\t                    LILLY \n\t          Well, sure, Roy. You want me to\n\t          drive up --? Okay, fine, come on\n\t          down.\n\t              (kidding)\n\t          It won't be a home-cooked meal, you\n\t          know.\n\t\n\tTNT. LIVING ROOM DAY\n\t\n\t                    ROY\n\t              (kidding)\n\t          Well, that's good news.\n\t\n\tHe hangs up, but he's nervous, still uncertain, pacing.\n\t\n\t                    ROY \n\t          Well? Who's a boy gonna talk to, if\n\t          not his mother?\n\t\n\tThe sound of the question makes him laugh.\n\t\n\tEXT. MOTEL - DAY\n\t\n\tMyra's Cadillac eases to a stop across the street, where she\n\tearlier waited in the cab.\n\t\n\tAN ANGLE through the windshield at Myra, settling down to\n\twait, looking at the motel.\n\t\n\tINT. MOTEL ROOM - NIGHT\n\t\n\tLilly comes out of the bathroom, putting her lipstick away in\n\ta small purse. She's dressed carefully for tonight; upscale\n\tand respectable, without being stodgy. She crosses to the\n\twindow -- night view outside -- and as she pulls the drapes\n\tshut the phone RINGS. She looks at it in disappointment,\n\tcrosses to answer.\n\t\n\t                    LILLY\n\t              (expecting rejection)\n\t          Roy?\n\t\n\tINT. OFFICE - NIGHT\n\t\n\tIrv the accountant's office in Baltimore. He looks secretive\n\tand scared, talks in a hush.\n\t\n\t                    IRV \n\t          Lilly, listen, it's Irv. You were\n\t          always decent with me, I'm taking a\n\t          hell of a chance here.\n\t          Somebody blew you out with Bobo.\n\t          The car full of money. He's --\n\t          Lilly?\n\t\n\tINT. MOTEL ROOM - NIGHT\n\t\n\tEmpty. The phone receiver dangles off the table on its cord.\n\tThe door finishes closing.\n\t\n\tEXT. MOTEL - NIGHT\n\t\n\tLilly's Chrysler jounces out to the street, moving too fast,\n\tmaking the turn, racing away. CAMERA PANS to Myra's Cadillac,\n\tpulling away from the curb, following. CAMERA HOLDS with the\n\ttwo cars receding in b.g.\n\t\n\tINT. HONDA - NIGHT \n\t\n\tRoy drives down a San Diego street, is stopped by a red\n\tlight, looks at his watch. He's late.\n\t\n\t                    ROY \n\t          Damn.\n\t\n\tINT. MOTEL ROOM - NIGHT\n\t\n\tEmpty; as before. The door opens and the two thugs we saw\n\tearlier with Bobo enter, one putting a thick ring of keys\n\taway in his jacket pocket. They close the door, look around\n\tthe room. One goes to the closet, opens it, looks at the\n\tclothing inside, while the other goes into the bathroom. The\n\tfirst crosses to the dresser, pulls open a drawer full of\n\tclothing. The second comes out of the bathroom. They look at\n\tone another. The guy from the bathroom shakes his head. The\n\tother one points at the dangling phone, speaks.\n\t\n\t                    THUG\n\t          Somebody spooked her.\n\t\n\t                    SECOND THUG\n\t          White Chrysler.\n\t\n\t                    THUG\n\t          Full of cash.\n\t\n\tThey leave the room.\n\t\n\tEXT. MOTEL - NIGHT\n\t\n\tRoy walks toward Lilly's room as the two thugs pass him, on\n\ttheir way out. Roy knocks on Lilly's door, waits, knocks\n\tagain.\n\tHe tries to look through a crack in the drapes into the room,\n\tthen turns to look at the empty place where Lilly's Chrysler\n\thad been. He shakes his head, knocks once more, looks at his\n\twatch, turns away.\n\t\n\t                    ROY\n\t              (disgusted)\n\t          Thanks a lot, Lilly.\n\t\n\tHe walks off.\n\t\n\tEXT. ARIZONA MOTEL - NIGHT\n\t\n\tLilly's white Chrysler pulls off the road into the front\n\tparking area of a new small motel. The car brakes to a stop.\n\t\n\tAN ANGLE from the road as Myra's blue Cadillac drives slowly\n\tby, while, in b.g., Lilly gets out of the Chrysler, moving as\n\tthough she's stiff and tired. Lilly enters the motel office.\n\t\n\tINT. MOTEL OFFICE - NIGHT\n\t\n\tThe CLERK, an elderly woman, turns away from a small TV set\n\twhen Lilly enters.\n\t\n\t                    CLERK\n\t          Evening. Welcome to Phoenix.\n\t\n\t                    LILLY \n\t          Good evening. I'd like a single for\n\t          tonight.\n\t\n\t                    CLERK \n\t          Oh, everything's the same size,\n\t          same price.\n\t\n\tThe clerk extends a registration card and pen to Lilly, who\n\ttakes them but doesn't yet start to write.\n\t\n\t                    LILLY\n\t          I'm a very light sleeper, traffic\n\t          noise keeps me wide awake all\n\t          night.\n\t\n\t                    CLERK\n\t              (sympathetic)\n\t          Those trucks. I know exactly what\n\t          you mean.\n\t\n\t                    LILLY\n\t          Do you have something around back,\n\t          facing away from the road?\n\t\n\tThe clerk turns to consider the key rack.\n\t\n\t                    CLERK\n\t          I'll put you in one thirty-one.\n\t          Very quiet. Faces the desert.\n\t\n\t                    LILLY\n\t          Sounds perfect. I can park my car\n\t          back there?\n\t\n\t                    CLERK \n\t          Right in front of the room.\n\t\n\t                    LILLY \n\t          Fine.\n\t\n\tShe starts to fill in the registration card.\n\t\n\t                    LILLY\n\t          And I'll want to leave an early\n\t          wake-up call.\n\t\n\t                    CLERK \n\t          No problem. My husband gets up the\n\t          crack of dawn.\n\t              (confidential)\n\t          It's his kidneys.\n\t\n\tEXT. ROAD - NIGHT\n\t\n\tMotel in b.g. The blue Cadillac, having turned around and\n\tcome back, pulls off onto the shoulder of the road about\n\tfifty yards short of the motel.\n\t\n\tINT. CADILLAC - NIGHT\n\t\n\tOver Myra's shoulder as she watches, through the windshield,\n\tthe Chrysler parked in front of the motel. Lilly comes out of\n\tthe office over there, gets into the Chrysler, backs it up,\n\tdrives it out of sight past the motel. Myra puts the Cadillac\n\tin gear.\n\t\n\tINT. ROOM 131 - NIGHT\n\t\n\tA clean anonymous motel room, with two beds. Lilly enters,\n\tvery weary, puts her shoulderbag on one of the beds, goes\n\tback outside and leaves the door open. She has backed the\n\tChrysler into its spot just outside her room, so its trunk is\n\tvisible through the open doorway.\n\t\n\tEXT. ARIZONA MOTEL - NIGHT\n\t\n\tAN ANGLE on Lilly as she opens the rear door of the Chrysler\n\tand leans in.\n\t\n\tINT. CHRYSLER - MIGHT\n\t\n\tLilly wrestles the rear seat out of position, reaches down\n\tinto the space under and behind it, and brings out a soft\n\tcloth overnight bag. It seems not too full but fairly heavy.\n\tShe puts the bag on the ground outside the car and then\n\tpushes and prods the seat back into position.\n\t\n\tEXT. ARIZONA MOTEL - NIGHT\n\t\n\tLilly shuts the car door, picks up the bag, and enters her\n\troom, shutting the door behind her.\n\t\n\tINT. MOTEL OFFICE - NIGHT\n\t\n\tMyra enters. The clerk looks at her in surprise.\n\t\n\t                    CLERK \n\t          Something wrong?\n\t              (embarrassed)\n\t          I'm sorry. I thought you were the\n\t          other lady.\n\t\n\t                    MYRA \n\t          No. I'm me.\n\t\n\tINT. ROOM 231 - NIGHT\n\t\n\tLilly puts the bag on the bed with her shoulderbag. She opens\n\tthe overnight bag, takes from it a blond wig, a pair of horn\n\trim glasses and a passport. From her shoulderbag she takes\n\tthe pistol and silencer. She attaches the silencer to the\n\tpistol and puts the pistol under the pillow of the other bed.\n\t\n\tINT. MOTEL OFFICE - NIGHT\n\t\n\tMyra's checking in. She fills in the registration card while\n\tthe clerk considers her key rack.\n\t\n\t                    CLERK \n\t          I'll give you one oh seven. That's\n\t          a very nice room, very handy, in\n\t          the front, right by the pool.\n\t\n\t                    MYRA \n\t          Oh, don't you have something around\n\t          back, where it's quieter?\n\t\n\tThe clerk sighs, looks at the key she'd taken from the rack,\n\treluctantly goes back to consider the situation again.\n\t\n\t                    CLERK \n\t          Everybody wants the back tonight.\n\t\n\t                    MYRA \n\t          I guess everybody wants privacy.\n\t\n\tINT. ROOM 131 - NIGHT\n\t\n\tLilly, in nightgown, yawning, comes out of the bathroom,\n\tswitching off its light. The shoulderbag and overnight bag\n\tand overnight bag's contents are still on one bed. Lilly gets\n\tinto the other, switches off the light.\n\t\n\tINT. ROOM 119 - NIGHT\n\t\n\tVirtually identical to Room 131. Myra enters, lugging a\n\tsuitcase, and shuts the door behind herself. She puts the\n\tsuitcase on one of the beds, opens it, paws through it, and\n\tbrings out slippers, nightgown and robe. Briskly, she strips\n\tand puts on the nightgown, the slippers and the robe.\n\t\n\tBack into the suitcase, she brings out a small snubnose\n\tpistol which she puts in the pocket of her robe. Next out of\n\tthe suitcase is a large ring of keys.\n\t\n\tSitting on the other bed, she compares her room key with keys\n\ton the ring, takes three keys from the ring, and puts them in\n\ther robe pocket along with the room key.\n\t\n\tGetting to her feet, she crosses to the dresser, picks up the\n\tice bucket, and leaves the room, closing the door behind\n\therself.\n\t\n\tEXT. ROOM 131 - NIGHT\n\t\n\tCU, the door, with its number. CAMERA PANS to pick up Myra,\n\tapproaching. She stops at room 132, looks at the Chrysler,\n\tsmiles at it in proprietary fashion, and pats the Chrysler on\n\tthe trunk.\n\t\n\tThen she turns to the room. She takes the keys from her\n\tpocket, looks around to be sure she's alone, and bends over\n\tthe lock.\n\t\n\tINT. ROOM 131 - NIGHT\n\t\n\tIn very dim light, Myra enters the room, closes the door,\n\tmoves toward the beds. CAMERA PANS with her. Keeping her eyes\n\ton the sleeping form of Lilly, she puts the empty ice bucket\n\ton the empty bed, then moves closer to Lilly. CAMERA PANS in,\n\tmoving forward as Myra's arms move forward, moving to CU on\n\tLilly as Myra's hands (remaining IN FRAME) move forward and\n\tdown. Her hands abruptly clamp on Lilly's throat. QUICK CUT.\n\t\n\tEXT. PHOENIX AIRPORT - DAY\n\t\n\tESTABLISHING SHOT. A plane lands.\n\t\n\tINT. PHOENIX AIRPORT - DAY\n\t\n\tRoy, looking stunned, is among the deplaning passengers\n\tspreading out across the terminal. He's met by PIERSON, a\n\tplainclothes detective, and a uniformed COP.\n\t\n\t                    PIERSON \n\t          Roy Dillon?\n\t\n\t                    ROY \n\t          Yes?\n\t\n\t                    PIERSON \n\t          Lieutenant Pierson, Phoenix police.\n\t          I have a car here.\n\t\n\t                    ROY \n\t          Thank you.\n\t\n\tINT. POLICE CAR - DAY\n\t\n\tThe uniformed cop drives. Pierson and Roy sit in back.\n\t\n\t                    PIERSON \n\t          I realize this is a shock.\n\t\n\t                    ROY \n\t          Well, mostly, I don't believe it.\n\t\n\t                    PIERSON \n\t          That's natural.\n\t\n\t                    ROY \n\t          No. I mean, I don't believe it.\n\t          Lilly is not a suicide. I know my\n\t          mother, nothing would make her\n\t          check out.\n\t\n\t                    PIERSON \n\t          I'm sorry, it was her all right.\n\t          Her gun, even.\n\t\n\t                    ROY \n\t          Gun?\n\t\n\t                    PIERSON \n\t          I grant you, it's a little odd,\n\t          shoot yourself with a gun with a\n\t          silencer on it, but it was hers,\n\t          all right. It really is your\n\t          mother, Mister Dillon.\n\t\n\t                    ROY \n\t          It may be Lilly, but it isn't\n\t          suicide.\n\t\n\t                    PIERSON \n\t              (interested)\n\t          Do you have any particular reason\n\t          to say that?\n\t\n\t                    ROY \n\t          My mother... Well, I guess it\n\t          doesn't matter now. She worked for\n\t          gamblers. She always knew they\n\t          might turn on her some day.\n\t\n\t                    PIERSON\n\t              (thoughtful)\n\t          A hit, you mean. Honestly, it\n\t          doesn't have that feel to it, but\n\t          I'll certainly consider the\n\t          possibility. Thank you for telling\n\t          me.\n\t\n\tThe car stops.\n\t\n\t                    ROY \n\t          Not that it matters.\n\t              (looks out)\n\t          This is the morgue?\n\t\n\t                    PIERSON \n\t          You up to it now?\n\t\n\t                    ROY \n\t          Sure. Let's get it over.\n\t\n\t                    PIERSON \n\t          One thing I have to caution you\n\t          about. A gunshot wound...\n\t\n\t                    ROY\n\t              (impatient)\n\t          Yes, I know, I know.\n\t\n\t                    PIERSON\n\t              (reluctant)\n\t          Well, uh, you know, she ate the\n\t          gun.\n\t\n\t                    ROY\n\t              (not understanding)\n\t          What?\n\t\n\t                    PIERSON \n\t          I'm sorry, that's an unfortunate\n\t          phrase, it slipped out, I'm, to\n\t          tell you the truth, Mr. Dillon,\n\t          this isn't an everyday occurrence\n\t          around here.\n\t\n\t                    ROY\n\t              (low; getting it)\n\t          Ate the gun. Oh.\n\t\n\t                    PIERSON \n\t          Someone who knows her well could\n\t          still identify her, that's not the\n\t          problem. It's just there's, uh,\n\t          it's likely to be a shock.\n\t\n\t                    ROY\n\t              (opening the door)\n\t          Well, let's get the shock over\n\t          with.\n\t\n\tINT. MORGUE VIEWING ROOM - DAY\n\t\n\tA bare bright room with tiled walls, a few plastic chairs, an\n\tordinary office door on one side and wide hospital swinging\n\tdoors on the other. Pierson and Roy stand watching.\n\t\n\t                    ROY \n\t          Not many laughs in this room, eh?\n\t\n\t                    PIERSON \n\t          Not many.\n\t\n\tThe swinging doors open and an ATTENDANT wheels in a gurney\n\tcontaining a body covered by a sheet. Roy braces himself. The\n\tattendant pulls the sheet away from the face.\n\t\n\t                    PIERSON (CONT'D)\n\t              (to the attendant)\n\t          Remove that. We'll want a full, uh,\n\t          identification.\n\t\n\tThe attendant removes the sheet. The body wears a nightgown.\n\t\n\tAN ANGLE on Roy, swallowing bile, as he forces himself to\n\tmove forward and look down at the face. He immediately looks\n\taway again.\n\t\n\t                    ROY \n\t          Oh, Jesus.\n\t\n\t                    PIERSON \n\t          No question, huh?\n\t\n\t                    ROY \n\t          No, its -- Why did she--?\n\t\n\tHe forces himself to look at the body again, his own face\n\tfull of the unanswerable question. He looks her up and down,\n\tthen his eyes stop. He focuses on something, a look of\n\tsurprise coming into his eyes.\n\t\n\tRoy's POV: CU, the body's hands, crossed over the stomach,\n\tthe wrists crossed, the palms down, the clear backs of both\n\thands visible.\n\t\n\tCU, Roy. He knows. Sharpness comes back into his expression.\n\t\n\t                    PIERSON  (O.S.)\n\t          That's that, then.\n\t\n\t                    ROY\n\t              (starting to grin)\n\t          Oh, yeah. That's that.\n\t\n\tTWO SHOT, Roy and Pierson. Pierson wants to leave, but Roy\n\tstands over the gurney. He chuckles. Pierson looks at him,\n\tsurprised and appalled. Roy ignores him.\n\t\n\t                    ROY (CONT'D)\n\t              (laughing quietly)\n\t          Mom.\n\t\n\tQUICK CUT.\n\t\n\tEXT. DESERT HIGHWAY - DAY\n\t\n\tMONTAGE. Myra's baby blue Cadillac drives, at extreme high\n\tspeed, alone on the highway.\n\t\n\tEXT. MADERO APARTMENTS - NIGHT\n\t\n\tMyra's Cadillac drives slowly past, comes to a stop at the\n\tcurb half a block away.\n\t\n\tINT. CADILLAC - NIGHT\n\t\n\tAN ANGLE through the windshield at the driver, a woman,\n\tdeeply weary. Her forearms are crossed on top of the steering\n\twheel, her brow resting on the forearms. The burn on the back\n\tof her right hand is visible in illumination from a nearby\n\tstreetlight. Traffic goes by. BEAT. Lilly lifts her head,\n\tlooking out at the night. She's very tired, but determined.\n\t\n\tAN ANGLE beside Lilly, inside the car. From the seat beside\n\ther she picks up Myra's large dangly earrings and fixes them\n\tin place. Then she puts on Myra's big-lensed dark sunglasses.\n\t(She's wearing the clothes Myra wore when checking into the\n\tmotel.) Lilly checks her appearance in the rearview mirror,\n\tthen gets out of the car.\n\t\n\tINT. MADERO LOBBY - NIGHT\n\t\n\tAN ANGLE on Simms at the desk, talking to a TELEPHONE\n\tREPAIRMAN steadily at work fixing the switchboard.\n\t\n\t                    SIMMS\n\t          The last modern thing I liked was\n\t          the miniskirt. Your technology,\n\t          now, nobody understands it, and\n\t          that's the simple fact of the\n\t          situation.\n\t\n\tLilly enters in b.g., crosses to the elevator, presses the\n\tbutton. Simms waves to her.\n\t\n\t                    SIMMS\n\t              (calling) )\n\t          Evening, Mizz Langley!\n\t\n\tThe elevator door opens, Lilly boards and presses the button.\n\tThe elevator door closes.\n\t\n\t                    SIMMS\n\t          New things come in here all the\n\t          time, how do they work? You can ask\n\t          your Ph.Ds, your highly educated,\n\t          intelligent, professional people,\n\t          you can say to them, how does that\n\t          work, and you know what they'll\n\t          tell you? You plug it in. And\n\t          that's the way the donut dunks.\n\t\n\tEXT. MADERO APARTMENTS BALCONY - NIGHT\n\t\n\tThe balcony leading to Roy's apartment. It's illuminated by a\n\tlight next to the public door from the interior hall.\n\tAN ANGLE on that door as Lilly cautiously opens it, looks out\n\tand around while remaining mostly behind the door, then\n\tfocuses on the light. She reaches out and unscrews the bulb.\n\tGO TO BLACK.\n\t\n\tINT. LIVING ROOM - NIGHT\n\t\n\tRoy's place. Dark. SOUNDS of lock being picked. The door\n\topens, showing only blackness outside, Lilly enters and shuts\n\tthe door, then switches on the main light.\n\t\n\tAh ANGLE on Lilly, in the middle of the room, distractedly\n\tbiting her thumbnail as she looks around, calculating. She\n\tlooks directly at something.\n\t\n\tLilly's POV: One of the box-framed pictures hanging on the\n\twall.\n\t\n\tPREVIOUS SHOT. Lilly, making up her mind, crosses to the\n\tpicture and takes it off the wall. She finds it surprisingly\n\theavy. She carries it to the coffee table, puts it down there\n\ton its back, sits on the sofa.\n\t\n\tAN ANGLE on Lilly studying the picture. She raps her knuckle\n\tagainst the sides, looks to see if the front or sides open\n\tsomeway, and finally turns the picture over, laying it face\n\tdown on the coffee table. She sees how to remove the back,\n\tlifts it off, and looks at the stacks of money lying in\n\tthere.\n\t\n\tCU, Lilly, almost fainting with relief.\n\t\n\tWIDE SHOT. Lilly looks at the other picture, looks again at\n\tthe money, comes to a conclusion. She rises and leaves the\n\troom, deeper into the apartment.\n\t\n\tINT. BEDROOM - NIGHT\n\t\n\tLilly switches on the light as she enters the room. She looks\n\taround, crosses to the closet, goes through the stuff in\n\tthere, finds an old attache case on the shelf. She brings it\n\tout, puts it on the bed, opens it. Inside are a few decks of\n\tcards and a paperback book. She tosses them onto the bed,\n\tchecks the case, finds that one of the clasps works but the\n\tother doesn't. One is good enough. She carries the attache\n\tcase out of the room, leaving the light on.\n\t\n\tINT. LIVING ROOM - NIGHT\n\t\n\tLilly enters, puts the case on the coffee table beside the\n\tpicture, scoops the money out of the picture and puts it in\n\tthe case. Then she unceremoniously dumps the picture on the\n\tfloor.\n\t\n\tLilly takes the second picture from the wall, puts it face\n\tdown on the coffee table, opens the back, transfers the money\n\tto the case. She closes the case, attaches the one clasp that\n\tworks, picks up the case.\n\t\n\t                    ROY (O.S.)\n\t          Hello, Lilly.\n\t\n\tTWO SHOT, as Lilly whirls around, terrified and then\n\trelieved. Roy stands in the open apartment doorway, blackness\n\tbehind him.\n\t\n\t                    LILLY\n\t          Oh! Roy! You scared me.\n\t\n\tRoy enters the room and shuts the door.\n\t\n\t                    ROY\n\t          Going somewhere?\n\t\n\t                    LILLY\n\t          Somewhere else, that's for sure.\n\t\n\t                    ROY\n\t          I just came back from Phoenix.\n\t\n\t                    LILLY \n\t              (anxious)\n\t          Oh, yeah? Is the frame holding?\n\t\n\t                    ROY\n\t          Looks very solid, Lilly. Sit down.\n\t          Take a minute, tell me about it.\n\t\n\t                    LILLY \n\t          I've really got to --\n\t\n\t                    ROY\n\t          You're dead, Lilly, it worked.\n\t\n\t                    LILLY \n\t          Not for long. Not when they do a\n\t          fingerprint check.\n\t\n\t                    ROY \n\t          Why should they? The cops are\n\t          satisfied.\n\t\n\t                    LILLY \n\t          Bobo won't be. He'll spend the\n\t          money to make sure.\n\t\n\t                    ROY \n\t          Even so. You still got time. Relax\n\t          a minute, tell me what happened.\n\t          Sit down.\n\t\n\tHe gestures at the sofa. Lilly's holding the attache case.\n\tThe gutted pictures are lying around, one on the coffee table\n\tand one on the floor. She looks around at everything, awkward\n\tand embarrassed. But Roy hasn't said anything. And he's\n\tbetween her and the door.\n\t\n\t                    LILLY\n\t          Just for a minute.\n\t\n\tShe backs up, sits on the sofa, puts the case on her lap. Roy\n\tpulls a chair over so it's directly between Lilly and the\n\tdoor. He sits, looking at her with polite interest.\n\t\n\t                    ROY \n\t          Myra followed you, huh?\n\t\n\t                    LILLY\n\t          She must have been the one that\n\t          blew me off with Bobo. I guess to\n\t          get me running. Did you tell her\n\t          about my stash?\n\t\n\t                    ROY\n\t              (isn't worth discussing)\n\t          No.\n\t\n\t                    LILLY\n\t          No, you wouldn't. That's what she\n\t          was after, though. But why hit on\n\t          me?\n\t\n\t                    ROY \n\t          I wouldn't go in on a deal with\n\t          her. She blamed you for it.\n\t\n\t                    LILLY\n\t              (a shaky laugh)\n\t          As though you do what I say.\n\t\n\t                    ROY\n\t              (cold grin)\n\t          That's pretty funny, all right.\n\t          What happened in Phoenix?\n\t\n\tRemembered emotion makes Lilly talk in little fast clusters\n\tof words.\n\t\n\t                    LILLY\n\t          Roy, it was terrible. You read\n\t          about people killing people and all\n\t          that, but when it happens, my God.\n\t\n\tEXT. ARIZONA MOTEL - NIGHT\n\t\n\tMyra, in nightgown, carrying the ice bucket, approaches Room\n\t131.\n\t\n\t                    LILLY\n\t          She was in her nightgown, you know,\n\t          the old grifter's dodge, nightgown\n\t          and the Ice bucket and she just got\n\t          into the wrong room by mistake.\n\t\n\tINT. ROOM 131 - NIGHT\n\t\n\tCU, Lilly asleep. Very dim light. The shadows shift on her\n\tface as Myra OUT OF FRAME approaches. Myra's hands ENTER\n\tFRAME, abruptly clamp on Lilly's throat. Lilly's eyes pop\n\topen wide, staring, her mouth stretches open. Myra's arms are\n\tlocked straight, pressing her weight down onto her hands\n\tsqueezing Lilly's throat. Lilly clutches at Myra's fingers,\n\ttries to reach Myra's face, twists and squirms, then suddenly\n\tlifts her arm up and behind her head, hand dipping under the\n\tpillow, coming out with the silenced gun, pushing the gun\n\tupward, straight-arm, the gun moving up OUT OF FRAME. SOUND\n\tof shot. Blood sprays Lilly's face. Myra's body drops down\n\tonto her, at an angle, so we can still see Lilly's horrified\n\tface over Myra's shoulder as Lilly gasps for breath.\n\t\n\tINT. LIVING ROOM - NIGHT\n\t\n\tLilly stares across the room, breathing hard, reliving the\n\texperience.\n\t\n\t                    LILLY \n\t          I sat in there with her, I thought,\n\t          what do I do now? Run and I've got\n\t          Bobo and the law after me. Stay,\n\t          and how do I explain?\n\t\n\t                    ROY \n\t          This way's perfect.\n\t\n\tLilly sits back, showing that relief again.\n\t\n\t                    LILLY \n\t          It is, isn't it? And maybe it's a\n\t          break for me after all.\n\t          I've been wanting out of the racket\n\t          for years, and now I'm out. I can\n\t          make a clean start, and --\n\t\n\t                    ROY \n\t          You've already made a start.\n\t          Doesn't look that clean, though.\n\t\n\tHere's the awkwardness. Lilly looks guilty and embarrassed.\n\t\n\t                    LILLY\n\t          I'm sorry. I hated to take your\n\t          money, but --\n\t\n\t                    ROY\n\t          Don't be sorry. You're not taking\n\t          it.\n\t\n\tLilly reacts as though he's slapped her. But then she gets\n\ther determination back. She splays out both hands, palm down,\n\ton the attache case on her lap.\n\t\n\t                    LILLY\n\t          I need this, Roy. I can't run\n\t          without money, and if I can't run\n\t          I'm dead.\n\t\n\t                    ROY \n\t          You must have some money.\n\t\n\t                    LILLY\n\t          Just a few bucks.\n\t\n\t                    ROY \n\t          And Myra's stuff?\n\t\n\t                    LILLY\n\t              (scornful)\n\t          Her credit cards. How far am I\n\t          gonna get with that?\n\t\n\t                    ROY \n\t          Far enough. Maybe up to San\n\t          Francisco. Or St. Louis, someplace\n\t          new. Start over.\n\t\n\t                    LILLY\n\t          At what?\n\t\n\t                    ROY \n\t          You're smart, Lilly, and you're\n\t          good-looking. You won't have any\n\t          trouble finding a job.\n\t\n\t                    LILLY \n\t              (appalled)\n\t          A job? I've never had a legit job\n\t          in my life!\n\t\n\t                    ROY \n\t          Well, you're gonna start, if you\n\t          hope to live through this. A square\n\t          job and a quiet life. You start\n\t          showing up at the track or the hot\n\t          spots and Bobo's boys will be all\n\t          over you.\n\t\n\t                    LILLY\n\t              (exasperated)\n\t          Roy, I know what to do with myself!\n\t          It's a big world out there.\n\t\n\t                    ROY \n\t          Not any more. Lilly, listen, I'm\n\t          giving you good advice. I'm\n\t          following it myself.\n\t\n\t                    LILLY\n\t              (doesn't get it)\n\t          What?\n\t\n\t                    ROY \n\t          I thought it over, and you were\n\t          right. You wanted me out of the\n\t          rackets, and now --\n\t\n\t                    LILLY\n\t              (bedeviled, aggravated)\n\t          Roy, that's fine, but I don't have\n\t          time for this. Bobo --\n\t\n\t                    ROY\n\t          I thought you'd be happy for me.\n\t          After all, you --\n\t\n\t                    LILLY \n\t          Bobo isn't after you! Bobo's after\n\t          me, and he's goddamn good! But so\n\t          am I. I'm a survivor, Roy. I\n\t          survive.\n\t\n\t                    ROY \n\t          I know you do, so that's why --\n\t\n\t                    LILLY \n\t          And to survive, my way, I need\n\t          money.\n\t          Bobo knows about the stash in the\n\t          car, so I didn't dare touch it, not\n\t          if Lilly Dillon's dead. So that\n\t          leaves this.\n\t\n\t                    ROY\n\t          No.\n\t\n\tLilly sits back again, brooding at Roy, trying to think how\n\tto get to him, how to get through him or around him. She\n\tsighs, licks her lips.\n\t\n\t                    LILLY\n\t          You want a drink?\n\t\n\t                    ROY \n\t          I don't think so. You probably\n\t          shouldn't either.\n\t\n\t                    LILLY \n\t          No, but I'm goddamn thirsty. Ice\n\t          water?\n\t\n\t                    ROY\n\t          Yeah, sure, that sounds nice.\n\t\n\t                    LILLY\n\t          I'll get it.\n\t\n\tShe stands, putting the attache case on the sofa next to\n\twhere she was sitting. Roy, with a faint smile, watches her\n\tleave the room.\n\t\n\tINT. KITCHEN - NIGHT\n\t\n\tVery small, little used. Dark. Lilly switches on the light\n\twhen she enters, then leans against the counter, fists\n\tclenched and trembling on the counter in front of her. She\n\tgrits her teeth, hyperventilates, stares around the room in\n\tsearch of escape, an answer, something.\n\t\n\tCU, Lilly's face, desperate, grim, but not giving up.\n\t\n\tWIDE SHOT. Lilly opens cabinets, finds two glasses, opens the\n\tnearly-empty refrigerator, gets ice cubes from a tray, puts\n\tthem in the glasses, puts the partial tray back in the\n\tfreezer compartment, fills the glasses from the cold water\n\ttap, puts the glasses on the counter, stares at them briefly.\n\tShe then shakes her head, searches the kitchen some more, and\n\tfinds a cookie sheet she can use as a tray. She puts the\n\tglasses on the tray, carries the tray from the room, leaving\n\tthe light on.\n\t\n\tINT. LIVING ROOM - NIGHT\n\t\n\tLilly enters with the tray, crosses to Roy, presents the\n\tglasses, speaks as he reaches for one.\n\t\n\t                    LILLY \n\t          Take whichever one you want.\n\t\n\tHe hesitates. It hadn't occurred to him Lilly might try to\n\tpoison him or knock him out. He grins at her and takes a\n\tglass.\n\t\n\t                    ROY \n\t          You wouldn't do that.\n\t\n\tLilly takes the other glass, puts the cookie sheet on a\n\ttable, looks down at Roy.\n\t\n\t                    LILLY \n\t          You don't know what I'd do, Roy.\n\t          You have no idea. To live.\n\t\n\t                    ROY\n\t              (easy)\n\t          Oh, you'll live, Lilly.\n\t\n\tLilly crosses back to the sofa, sits beside the attache case,\n\tpats it absently as though it is a pet and she's glad it\n\tdidn't move, waited for her. She sips water, puts the glass\n\ton the end table.\n\t\n\t                    LILLY \n\t          I know what's bugging you, of\n\t          course.\n\t\n\t                    ROY \n\t          Oh? I didn't know anything was.\n\t\n\t                    LILLY\n\t              (twisted grin)\n\t          Oh, really? You've got a legitimate\n\t          complaint, Roy, I don't deny that.\n\t          I wasn't a very good mother when\n\t          you were a kid.\n\t\n\t                    ROY\n\t              (full laugh)\n\t          Not very good!\n\t\n\tShe nods, accepting the correction.\n\t\n\t                    LILLY \n\t          A bad mother. By any standards.\n\t          I've thought about it, you know,\n\t          from your side, since then. I know\n\t          just how bad I was.\n\t\n\t                    ROY\n\t              (closed against her)\n\t          Uh-huh.\n\t\n\t                    LILLY \n\t          I wonder did you ever think about\n\t          it from my side.\n\t\n\t                    ROY\n\t              (not worth discussing)\n\t          Never.\n\t\n\t                    LILLY \n\t          No, I guess not. It was pretty\n\t          lousy of me, I guess, to be a child\n\t          at the same time you were. Not to\n\t          stop being a child just because I\n\t          had a child. I guess I was a real\n\t          stinker not to be a grown-up when\n\t          you needed a grown-up.\n\t\n\tRoy didn't expect to be made uncomfortable and defensive, and\n\the resents it.\n\t\n\t                    ROY \n\t          What do you want me to do? Pin a\n\t          halo on you? You're doing a pretty\n\t          good job of that yourself.\n\t\n\t                    LILLY \n\t          And making you feel bad at the same\n\t          time, huh? But that's the way I am,\n\t          you know, the way I've always been.\n\t          Always picking on poor little Roy.\n\t\n\t                    ROY \n\t          For God's sake, Lilly!\n\t\n\t                    LILLY\n\t              (intense)\n\t          I gave you your life twice. I'm\n\t          asking you to give me mine once. I\n\t          need the money.\n\t\n\t                    ROY\n\t              (not worth discussing)\n\t          No.\n\t\n\tLilly subsides back onto the sofa. One hand rests on the\n\tattache case. With the other, she sips water, puts the glass\n\tback down. Roy watches her, unmoving, expressionless. Lilly\n\tfrowns, not quite looking at him.\n\t\n\t                    LILLY\n\t          You're getting off the grift?\n\t\n\t                    ROY \n\t          That's right.\n\t\n\t                    LILLY\n\t          That's good. You don't really\n\t          belong on this side of the fence,\n\t          you know.\n\t\n\t                    ROY \n\t              (amused)\n\t          I don't?\n\t\n\t                    LILLY\n\t          If you stayed a crook, do you think\n\t          you'd live to be my ripe age?\n\t\n\t                    ROY \n\t          I don't see why not.\n\t\n\t                    LILLY\n\t          Well, I guess I got it wrong, then.\n\t          Seems to me I heard about a guy\n\t          just your age that got hit so hard\n\t          in the guts it almost killed him.\n\t\n\tRoy's again unexpectedly uncomfortable. He shifts uneasily in\n\this chair, trying to think of a response.\n\t\n\t                    ROY \n\t          Well, uh...\n\t\n\t                    LILLY\n\t          Sure, sure, that doesn't count.\n\t          That's different.\n\t\n\t                    ROY\n\t          Well, it doesn't matter, does it?\n\t          I'm getting out.\n\t\n\t                    LILLY\n\t              (intense)\n\t          And that's why you've got to get\n\t          rid of this money. If you keep it\n\t          around, it'll just make you think\n\t          how clever you are.\n\t          It'll be a temptation to get back\n\t          into the game.\n\t\n\t                    ROY\n\t              (full laugh)\n\t          Oh, that's it! You're stealing my\n\t          money for my own good! How very\n\t          motherly of you, Lilly.\n\t\n\tOnce again, Lilly drops back against the sofa back. Another\n\tround in the fight is over. Roy watches her, patient, waiting\n\tfor her to give up, seeing no other outcome.\n\t\n\tAN ANGLE on Lilly, frustrated, feeling the need to move, the\n\tpressure of pursuit. Her head turns back and forth, her body\n\tstarts false gestures. Finally, abruptly, she gets to her\n\tfeet, looks at Roy, looks away, picks up the attache case.\n\t\n\tCU, Roy, alert. He won't let her reach the door.\n\t\n\tAN ANGLE PANNING with Lilly as she prowls the room, pacing\n\tback and forth, the attache case swinging at her side.\n\tFinally, she stops, standing the attache case on the coffee\n\ttable, her hand still on its handle.\n\t\n\t                    ROY \n\t          Lilly.\n\t\n\tShe looks at him, attentive without hope.\n\t\n\t                    ROY \n\t          If I should get out of the racket,\n\t          that goes double for you. That's\n\t          why you've got to change your life\n\t          completely, go to some town, get a\n\t          square job, live like a john\n\t          yourself. If you try to do it your\n\t          way, what future is in it?\n\t\n\t                    LILLY \n\t          A future. The only future I've got.\n\t\n\t                    ROY \n\t          That money wouldn't last forever.\n\t          And then what? You'd be back in\n\t          some other part of the rackets.\n\t          Another Bobo Justus to slap you\n\t          around and burn holes in your\n\t          hands. This way, you've got to go\n\t          the square route. You could send me\n\t          a card when you're settled, I could\n\t          maybe help out sometimes...\n\t\n\t                    LILLY\n\t              (bitter laugh) )\n\t          That's what it is, isn't it? Keep\n\t          me down. Your turn to be in charge,\n\t          have the power.\n\t\n\t                    ROY\n\t              (stonewalling)\n\t          Just trying to help, Lilly.\n\t\n\tShe sits on the sofa again, this time leaving the attache\n\tcase to stand on the coffee table. She studies Roy,\n\tcalculating.\n\t\n\t                    LILLY \n\t          Roy... What if I told you I wasn't\n\t          really your mother? That we weren't\n\t          related?\n\t\n\t                    ROY\n\t              (bewildered)\n\t          What?\n\t\n\tLilly leans back again, but this time her manner is\n\tdifferent; languorous, sexy. She crosses her legs, the upper\n\tleg swinging gently. She smiles gently, encouragingly, at\n\tRoy.\n\t\n\t                    LILLY \n\t          You'd like that, wouldn't you? Sure\n\t          you would. You don't need to tell\n\t          me. Now, why would you like it,\n\t          Roy?\n\t\n\tAN ANGLE on Roy, understanding and not wanting to understand.\n\t\n\t                    ROY\n\t              (hoarse)\n\t          What's that all about? Of course\n\t          you're my mother. Of course you\n\t          are.\n\t\n\tTWO SHOT. Lilly leans forward toward Roy, inviting him.\n\t\n\t                    LILLY\n\t              (very soft)\n\t          Roy... Roy\n\t\n\tRoy will not let anything complicated come to the surface.\n\t\n\t                    ROY \n\t          There's nothing more to talk about.\n\t\n\t                    LILLY\n\t              (very soft)\n\t          I have to have that money, Roy.\n\t          What do I have to do to get it?\n\t\n\tAN ANGLE on Roy, his face bruised-looking, eyes scared. He\n\twill not know what's going on. He shakes his head, not\n\ttrusting himself to speak.\n\t\n\tAN ANGLE on Lilly, leaning forward, tension showing through\n\tthe seductive manner.\n\t\n\t                    LILLY \n\t          No? Won't you give me the money,\n\t          Roy? Can't I change your mind? What\n\t          can I do to change your mind?\n\t\n\tTWO SHOT, as Lilly gets to her feet and takes a step toward\n\thim. Roy's pressed back into his chair, trying to maintain a\n\tcold facade.\n\t\n\t                    ROY \n\t          Lilly, Jesus, what are you doing?\n\t\n\t                    LILLY\n\t          Is there nothing I can do, Roy,\n\t          nothing at --\n\t\n\t                    ROY \n\t          NO!\n\t\n\tThey both turn away at the same instant. Roy turns to the\n\tside to pick up the glass of water, to break the spell and\n\tthe tension. Lilly turns back toward the coffee table and\n\tpicks up the attache case. Roy, lifting the glass to drink,\n\tturns forward again as Lilly spins forward, swinging the\n\tattache case at his head with all her might. The case crashes\n\tinto the glass and into his face. Roy SCREAMS and topples off\n\tthe chair, as the one remaining clasp on the case lets go and\n\tmoney goes flying, filling the air.\n\t\n\tAN ANGLE DOWN at Roy, face up, expression horrified, hands to\n\this throat. A large triangle of glass is in his throat. Blood\n\tpumps thickly, fountaining up.\n\t\n\tCU, Lilly, staring down in horror. She lurches forward, but\n\tthere's nothing to do. She stares around.\n\t\n\tECU, wads of bills on the floor, getting bloody.\n\t\n\tCU, Lilly, in agony, but looking down, kicking.\n\t\n\tECU, Lilly's feet kicking the bills away from the blood. \n\t\n\tTWO SHOT, as Lilly drops to her knees beside Roy, who's\n\talready dying. Blood spurts less forcefully. His hands fall\n\tto his sides, eyes stare upward, mouth still moves slightly.\n\tLilly, shoving money away with her hands now, stares at him,\n\twilling it not to happen. He stops moving. His eyes dull.\n\tLilly clasps her arms around herself. She knows she doesn't\n\tdare scream. Lips drawn back in a snarl, teeth clenched, she\n\tHISSES her agony through her teeth. She HISSES; she HISSES;\n\tshe HISSES. Then, slowly, she regains control.\n\t\n\tWIDE SHOT as Lilly gets to her feet. She seems dazed now,\n\tlike someone who's just been in a traffic accident. She\n\tblunders around the room, kicks the attache case, bends to\n\tpick it up. She studies the clasp, sees it still works, goes\n\tback to her knees.\n\t\n\tLOW ANGLE, Lilly in f.g., Roy in b.g., as Lilly repacks the\n\tmoney into the case, wiping the blood from some wads onto the\n\tcarpet. Finishing, she closes the case, then remains on her\n\tknees, bending over the case. She WEEPS grindingly.\n\t\n\tWIDE SHOT, entrance door in b.g. Lilly's weeping subsides.\n\tShe gets wearily to her feet, and leaves the room. CAMERA\n\tHOLDS. SOUND of water running in sink. SOUND STOPS. Lilly\n\treappears. She does not again look toward Roy. She picks up\n\tthe attache case, crosses to the door, opens it, steps across\n\tthe threshold, reaches back to switch off the light. GO TO\n\tBLACK.\n\t\n\t                          THE END\n\n\n\n\n\n\nGrifters, The\nWriters :   Donald E. Westlake\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:18.878797"}