{"title": "Halloween: The Curse of Michael Myers", "film_link": "/Movie Scripts/Halloween: The Curse of Michael Myers Script.html", "script_link": "/scripts/Halloween-The-Curse-of-Michael-Myers.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Halloween: The Curse of Michael Myers Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Halloween: The Curse of Michael Myers Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.15 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Daniel Farrands\" title=\"Scripts by Daniel Farrands\">Daniel Farrands</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<br/>\n<a href=\"/scripts/Halloween-The-Curse-of-Michael-Myers.html\">Read \"Halloween: The Curse of Michael Myers\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\t<title>Halloween 6: The Curse of Michael Myers - by Daniel Farrands</title>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\n\n\n<center><p><b><u>HALLOWEEN 6</u></b></p></center>\n<center>THE CURSE OF MICHAEL MYERS</center>\n\n<b><pre>\n</pre></b>DARKNESS fills the SCREEN.  SUPERIMPOSE:\n\nOctober 30, 1995\n\nDEAD SILENCE for what seems like an eternity, followed by a \nstartling, bone-chilling SCREAM as we\n\n<b>FADE IN:\n</b>\n<b>INT. DUNGEON - TUNNELS - NIGHT (DISTORTED)\n</b>\nThe agonizing SCREAMS continue as we MOVE rapidly through a \nlabyrinth of winding underground tunnels.  Glowing torches light \nthe way.  Blurry, indistinct silhouettes of grim FIGURES wearing \nblack-cowled robes flash along the dank, craggy walls.\n\nAs we BLAST around dark corners, we realize we are looking from \nthe P.O.V. of a SCREAMING young woman being pushed forward on a \ngurney.  Plunging deeper into this hellish maze.\n\nA door is SLAMMED.  Wooden.  Heavy.  Muffling the SCREAMS.\n\nSpurs CLANK on a pair of silver-tipped cowboy boots as a \nMYSTERIOUS STRANGER steps into VIEW.  Long black duster.  \nWidebrimmed fedora.  Lit cigarette dangling between gloved \nfingers.\n\n<b>INT. BIRTHING CHAMBER - NIGHT (CONTINUOUS)\n</b>\nA rat scampers from a hole, foraging in the muck of a rotted \nrack.  A white sheet, saturated with blood, covers the parted legs \nof JAMIE LLOYD, now 16, cheeks flushed with perspiration.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tOh, God, it's coming!  It's coming!\n\nMARY, a young midwife, rushes in with a bowl of hot water.  Jamie \nlurches, knocking the bowl out of the girl's hands; it SHATTERS on \nthe floor.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\t   (continuing)\n\tMary, mother of God, please make it stop!\n\nMary's face is frozen in horror.  Jamie's SCREAMS build to an \nunnerving crescendo.  The paiin too much for her to bear.\n<b>\t\t\t\n</b><b>\t\t\t     FLASH CUT TO:\n</b>\nLurid SHOCK CUTS from the previous \"Halloween\" entries -- a \nsurrealistic blend of IMAGES and VOICES -- as Jamie relives her \nterrifying childhood ordeal:\n<b>\t\t\n</b><b>\t\tLOOMIS (V.O.)\n</b>\t... Ten years ago he tried to kill Laurie \n\tStrode ...\n\nA)   LAURIE STRODE (Jamie Lee Curtis) twists and squirms as she is \n     strangled mercilessly in the hands of the murderous SHAPE.\n<b>\t\t\n</b><b>\t\tLOOMIS (V.O.)\n</b>\t... Now he wants her daughter.\n\nB)   Trapped in her bedroom, 10-YEAR-OLD JAMIE (Danielle Harris) \n     struggles to open the door.  She flings it open.  The Shape is \n     standing there, knife poised to kill!\n<b>\t\t\n</b><b>\t\tLOOMIS (V.O.)\n</b>\tMichael Myers is here to kill that little girl \n\tand anyone else who gets in his way!\n\nC)   RACHEL (Ellie Cornell) dies in anguish as the Shape plunges a \n     pair of scissors through her chest.  TINA (Wendy Kaplan) dives \n     right into the path of the Shape's knife.  \"Jamie, run!!!\"\n\nD)   Jamie sinks to her knees behind the fallen Shape, taking its \n     hand in her own.  CLOSE ON the Shape's hand.  Fingers flexing to \n     life.  A grotesque BRAND on its wrist -- an inverted isocsceles \n     triangle that will come to be known as the mark of THORN.\n\nE)   BLINDING EXPLOSION rips through cinderblock.  A jail cell blown \n     to oblivion.  FIRESTORM rages.  The MYSTERIOUS STRANGER appears, \n     opening fire with a SEMI-AUTOMATIC RIFLE.\n\nPitiful wails of death.  OFFICERS writhing in pools of blood.  In \nthe aftermath of this carnage stands YOUNG JAMIE.\n<b>\t\t\t\n</b><b>\t\t\t     FLASH CUT TO:\n</b>\n<b>INT. CHAMBER - NIGHT (SAME)\n</b>\nJamie struggles against her bonds.  Pushing.  SCREAMING.  Lapsing \nin and out of consciousness during the excruciating pangs of \nlabor.  Haunted by low, moaning VOICES.  CHANTING.\n<b>\t\t\t\n</b><b>\t\t\t     FLASH CUT TO:\n</b>\n<b>EXT. POLICE STATION - BACK ALLEY - NIGHT (NEW FOOTAGE)\n</b>\nRESUME Jamie, filled with repidation as she staggers through the \nsmoke-filled cell into a darkened, drizzly alleyway.\n\n<b>JAMIE'S P.O.V.\n</b>\nBeyond the clearing wisps of smoke, THREE FIGURES wearing black \nski masks usher THE SHAPE -- arms and legs shackled in heavy \nchains -- into the back of a white van.\n\n<b>BACK TO SCENE\n</b>\nMutely terrified, Jamie backs away -- into the arms of another \nfigure, obscured by smokescreen:  the Mysterious Stranger!\n\nJamie's scream is cut off as the Stranger descends upon her like \nthe Angel of Death.\n\nA cigarette arcs throug the darkness like a tiny flare.  Crushed \nunder the boot of the Stranger.\n\nA moment later, Jamie is shoved into the front seat of the van.  \nDoors SLAM.  Tires SCREECH over wet pavement.\n\n<b>THE ENTIRE PRECINCT EXPLODES IN A HUGE CONFLAGRATION!\n</b><b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>INT. CHAMBER - NIGHT\n</b>\nA SLAP and the first cry of the newborn BABY.  Jamie sobs \nuncontrollably, the straps preventing her from reaching him.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tPlease ... give him to me ...\n\nThe infant is wrapped in black swaddling.  The wooden door CREAKS \nopen.  Jamie's eyes fill with horror as the shadow of the Stranger \nfills the room.  Standing at the threshold.  Waiting to receive \nthe child.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\t   (continuing)\n\tNo, please ... my baby!\n\nThe dark sentinels march out in somber procession, ignoring her \ndesperate pleas.  Torches lighting the way.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\t   (continuing)\n\tDamn you!!  Damn you all to hell!!!\n\nJamie's heartrending SHRIEKS are cut off by the cold sound of the \n<b>SLAMMING DOOR.\n</b><b>\t\t\t\n</b><b>\t\t\t     FADE TO BLACK.\n</b>\n<b>MAIN TITLE SEQUENCE\n</b>\nA diaphanous column rises, a ghostly, slow-motion cylinder of \nflame that BURNS through the SCREEN to form the MAIN TITLE:\n<b>\t\t\t\n</b><b>\t\t\tHALLOWEEN 6\n</b>\nThe OPENING CREDITS are BRANDED against the BLACK SCREEN by an \ninvisible, kenetic force, interspersed with a SERIES OF CUTS:\n\nJamie's baby is lain upon a primitive altar.  Ringed by eleven \nstones engraved with cryptic markings.\n\nHooded, faceless figures.  Torches held aloft.  Disembodied \nVOICES.  Whispering.  Invoking a dark spell.\n\nMARY, the young midwife, peers around a corner.  Eyes glazed with \nhorror.  Watching.  Spying.\n\nThe newborn SCREAMS.  The flattened blade of a dagger smears a \ntriangular symbol in blood over the baby's torso.\n\nWe MOVE IN on this symbol, capturing it in FREEZE FRAME.  It burns \noff into fiery cinders, disintegrating into DARKNESS.\n\nSilence.  Then a startling CLAP OF THUNDER as we\n<b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>A SIGN POST\n</b>\nstanding askew in a matted patch of lawn.  WIND and RAIN.  INTENSE \nFLASH of LIGHTNING illuminates:\n\n\"For Sale By Strode Realty - SOLD\"\n\n<b>EXT/INT. MYERS HOUSE - SUBJECTIVE P.O.V.\n</b>\nMOVE along a trail of drowning toys -- baseball, Power Rangers, a \ndeck of Pogs -- TOWARD a weather-beaten porch.  Leftover gallons \nof Sears Best.  Brushes soaking in turpentine.  A dozen or so 2 x \n2s l;ined up to replace a row of broken railing slats.\n\nP.O.V. LOOKS UP to the tall, brooding edifice.  Address reads:  45 \nLampkin Lane.  Fresh coat of white paint over old clapboard.  New \nshutters on the narrow windows.  A jack-o'-lantern grins behind \nfilmy curtains.  The Myers house.\n\nDespite its recent face-lift, it looks just as foreboding as it \ndid in \"Halloween I.\"\n\nP.O.V. stalks down the side of the house, around to the back \ndoor.  Opens it and quietly MOVES inside.\n\nP.O.V. MOVES across the darkened kitchen.  A drawer is opened.  \nLIGHTNING reveals a large butcher knife being withdrawn.\n\nP.O.V. glides past the living room -- a few boxes, furniture to be \narranged -- and MOVES swiftly UP a long flight of stairs.\n\nDown the long, dark hallway ... through a door.  A bedroom.  \nP.O.V. FINDS 6-year-old DANNY STRODE ... tossing and turning in \nthe throes of a nightmare.\n\nAn ear-splitting THUNDER CRASH causes the boy to bolt upright in \nbed, looking right into the P.O.V.  Sweating.  Shaking.  \nPetrified.\n\n<b>DANNY'S P.O.V.\n</b>\nThe THUNDER seems to ROAR from the ferocious jaws of T-REX -- a \n24\" scale model posing on a shelf among an army of Jurassic \nmonsters.  Seemingly brought to life by the ELECTRICAL STORM.\n\n<b>FOLLOW DANNY\n</b>\nas he leaps out of bed and pads across polished wooden floors into \nthe hallway.  LIGHTNING FLASHES.  With the next THUNDER CRASH \ncomes a startling, barely intelligible VOICE.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (O.S.)\n</b>\tDanny ...\n\nDanny freezes.  Slowly turns.\n\n<b>DANNY'S POV\n</b>\nAn ominous shadow at the end of the hall, illuminated by \nLIGHTNING.  Long duster and brimmed hat.  The Stranger!  In his \noutstretched hand, the gleaming butcher knife!\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (O.S.)\n</b>\tKill for him!\n\n<b>BACK TO SCENE\n</b>\nDanny screams!  THUNDER CRASHES HELLISHLY.  Lights flash on.  \nDoors fly open.  Suddenly Danny is swept up in the protective arms \nof his mother, KARA, 22.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny!\n\nThe little boy holds onto her for dear life.  Crying \nhysterically.  Eyes clenched tightly.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing)\n\tShh.  Mommy's here.  What is it?\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tThe voice man!  He's here!\n\nKara looks in the direction he's pointing.  In the light there's \njust an antique coat rack -- \"dressed\" in a hat, rain jacket and \nold silver-tipped umbrella.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, no one's there.\n\nDanny dares to look -- but now only cries harder.\n\nKara carries Danny back to his room, averting the steely-eyed gaze \nof her father, JOHN STRODE, staunch, late 40s, wearing boxer \nshorts and a well-worn undershirt.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tSome of us have to get some sleep around \n\there.  What's with that kid?\n\nKara ignores him as her mother, DEBRA, careworn face with \ncompassionate eyes, tries to lend a hand.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tLet me take him for you, Kara.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tIt's all right, Mom.  Go back to bed.\n\nDebra sighs resignedly.  TIM, 18, stocky and streetwise, wearing \ntorn red sweat pants and \"Ice-T\" t-shirt, casually replaces his \nWalkman headphones and returns to his room.\n\n<b>INT. DANNY'S BEDROOM - NIGHT (A FEW MINUTES LATER)\n</b>\nKara opens the closet and switches on the light.  Satisfying Danny \nthat it's empty, she breaks into her perfunctory routine.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tStay away monters, stay away ghouls. Stay away \n\tfrom Danny.  You jerks know the rules. \n\t   (crossing to Danny's bed)\n\tBetter?\n\nDanny giggles as his pretty young mother tucks him in.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tMommy, when can we go home?\n\nKara sighs.  They've been through this one before.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tHome is here in Grandma and Grandpa's new \n\thouse.  At least while I'm in college.  \n\tRemember our deal.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tThe kids at school said this is a haunted \n\thouse -- that a bad man used to live here.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tThey did, did they?  Since when did we start \n\tlistening to the kids at school?\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tBut I've seen him!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tYou've been watching too much TV.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tHe says things.  Bad things.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tLike what?\n\nDanny is afraid to tell her.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing)\n\tIf you mean the things Grandpa says sometimes, \n\tignore him.  Once he gets to know you he'll \n\tcome around ... Let the bad things you hear \n\tslide right off your back.\n\nKara tousles his blond hair and kisses his forehead.  Then she \ngoes to the closet, just about to turn out the light --\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\t   (sitting up; panicked)\n\tNo, Mom -- keep it on!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tOkay ... But just for tonight.\n\nKara adjusts the closet door, causing one of Danny's school \ndrawings to fly off the wall.  She picks it up on her way out.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing)\n\tGood-night, Danny.\n\nKara softly closes the door.  Danny lies awake, blankets drawn up \nto his chin, eyes wide.  Still very much afraid.\n\n<b>INT. KARA'S ROOM (CONTINUOUS)\n</b>\nKara yawns, removes her glasses and rubs her eyes, setting Danny's \ndrawing on a pile of open books.  Cliffs Notes and Diet Coke \ncans.  Telltale signs of a late-night cram session.\n\nAdjusting the dial on her FM/alarm clock, Kara begins to move \nabout the little room, slipping out of her clothes as the \nsubtly-seductive voice of a WOMAN comes over the radio:\n<b>\t\t\n</b><b>\t\tWOMAN (V.O.)\n</b>\tI know this sounds crazy, Harry, but I love \n\thim.  I write to him every week. I think I \n\teven want to have his child --\n\nThe woman is cut off by the nasally, steel-trap voice of HARRY \nSIMMS, talk radio's most popular man of controversy:\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tLet me get this straight, Debi.  Now you're \n\tsaying that not only does this guy get you \n\tsexually aroused, but now you want to bear his \n\toffspring?!\n\nWearing only her bra and panties, Kara moves to a full-length \nmirror and lets down her long, flaxen hair.  Beneath her studious \nexterior, she is quite attractive:  delicate features with an \nenviable, naturally-toned figure.\n<b>\t\t\n</b><b>\t\tWOMAN (V.O.)\n</b>\tDeep down, he's just like you and me. He just \n\tneeds someone to understand him.  Someone to \n\tlove him.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tYou're talking about one of this nation's most \n\tnotorious serial killers like he belongs in \n\tsome kind of Est seminar!  What planet have \n\tyou been on, lady?  Michael Myers has been \n\tdead for six years!\n\nA CLICK as the woman is abruptly DISCONNECTED.\n\nKara suddenly whirls around, startled by a FLASH of something -- a \nface -- in the mirror!\n\nDrawn to the window behind her, she rubs off rainy mist and peers \noutside.\n\n<b>KARA'S P.O.V.\n</b>\nof the large Victorian frame house directly across the street.  \nAnother FLASH OF LIGHTNING reveals the shadow of a man standing in \nthe uppermost window -- looking right at her!\n\n<b>ANGLE ON KARA\n</b>\nFrightened, her eyes lock on Danny's drawing.  A child's \nscribbling in red Crayon:  The triangular symbol of Thorn!\n\n<b>EXT. MYERS HOUSE / BLANKENSHIP HOUSE\n</b>\nKara draws the priscilla curtains over the window as we PULL BACK \nthrough the pouring RAIN ... toward the house across the street.  \nAn ornate sign on the front door reads:\n\n\"Blankenship House - Rooms Available\"\n\nCRANE UP toward the window where the shadowy figure stands.  An \ninsidious CRASH OF THUNDER as we PUSH through the window.\n\n<b>INT. TOMMY'S APARTMENT - NIGHT (CONTINUOUS)\n</b>\nA macabre display of old newspaper headlines, arranged \nhelterskelter on a wall:  \"HALLOWEEN KILLS ESCAPES FROM ASYLUM.\"  \n<b>\"HORROR IN HADDONFIELD:  MICHAEL MYERS CLAIMS 16 LIVES.\"  \"REIGN \n</b><b>OF TERROR ENDS AS MYERS PERISHES IN VIGILANTE EXPLOSION.\"\n</b>\nHarry Simms BOOMS over a state-of-the-art HiFi system.  A cassette \ntape RECORDS the continuing broadcast.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tNow we've got someone who claims he's actually \n\tseen Michael Myers.  Does this whacko caller \n\thave a name?\n\nStaring out the window at the Myers house, TOMMY DOYLE, a \nstrapping 25-year-old with reddish brown hair and intense eyes, \ncradles a cordless phone.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tMy name's Tommy.  I was only eight- years-old \n\twhen I saw him.  But I was lucky.  I survived.\n\nTommy paces nervously around his sparsely-furnished attic \napartment.  Classic horror movie one-sheets and mint first edition \ncomic books share wall space with a chilling array of guns, \nknives, and survivalist weapons.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tSounds like you're a candidate for \n\telectroshock therapy, Tommy.  Don't tell me \n\tafter all this time you still believe Myers is \n\talive?!\n\nTommy pauses, mesmerized by one of the newspaper clippings.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tMichael's work isn't finished in Haddonfield.  \n\tNow it's just a matter of time before he comes \n\thome to kill again.  But this time I'll be \n\tready.\n\nMOVE IN TIGHT on the headline, frail and yellowed by age:  \n\"November 1, 1978.  TOMMY DOYLE SURVIVES BABYSITTER BLOODBATH.\"  \nDirectly beneath this:  \"November 3, 1989.  JAMIE LLOYD FEARED \n<b>DEAD IN POLICE STATION MASSACRE.\"\n</b>\nCLOSE ON a photograph of young Jamie and\n<b>\t\t\t\n</b><b>\t\t\t     SLOW DISSOLVE TO:\n</b>\n<b>INT. DUNGEON - CHAMBER - NIGHT\n</b>\nJamie remains strapped to the table, wrapped in bloody sheets.  \nEyes closed.  Deathly still.  Suddenly an urgent, WHISPERING VOICE \npierces the darkness:\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (O.S.)\n</b>\tJamie?  Jamie?!\n\nJamie startles awake to see the midwife frantically releasing her \nstraps.\n<b>\t\t\n</b><b>\t\tMARY\n</b>\tCome with me if you want to save your baby.\n\nJamie can't believe her eyes.  Mary opens a threadbare knapsack -- \nrevealing the baby inside!\n\nA soul-shuddering RUMBLE echoes throughout the cavern.  Jamie \nleaps up, eyes wide with fear, sensing the evil presence.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tOh, God ... He's coming!\n<b>\t\t\n</b><b>\t\tMARY\n</b>\tWe've got to move.  Now!\n\nPulsing with adrenaline, Jamie harnesses the knapsack over her \nshoulders and follows Mary out into the tunnels.\n\n<b>TUNNEL GATE\n</b>\nChains GRIND over rusted pulleys.  A massive iron gate rises, \nrevealing a pair of filthy work boots.  Legs planted in bold \nstance as a tall, ominous shape begins to emerge.\n\n<b>ANOTHER TUNNEL\n</b>\nThe terrified midwife leads Jamie with her baby on a breathless \nflight through the winding network of tunnels.  Haunted by the \nECHOING SOUNDS of the rising gate.\n\n<b>STALKING P.O.V. - THROUGH TUNNELS\n</b>\nGliding forward into the hollow catacombs.  Slow by determined.  \nSensing the way.\n\n<b>ANOTHER PART OF THE TUNNELS\n</b>\nReaching a corner, Mary stops and sends Jamie off in the opposite \ndirection.\n<b>\t\t\n</b><b>\t\tMARY\n</b>\tThere!  It's that way!\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tNo --\n<b>\t\t\n</b><b>\t\tMARY\n</b>\tSave your baby -- go now!\n\nJamie runs, disappearing down the dark tunnel.  Mary quickly \nremoves her shoes and tears off, now SILENT.\n\n<b>STALKING P.O.V.\n</b>\nsurges around a corner.  FINDS Mary.  MOVES IN on her.\n\n<b>ANOTHER ANGLE\n</b>\nMary turns in small circles.  Fear mounting as she falters into \ndarkness.  Heavy, labored BREATHING fills the tunnel.\n\nA mask -- the pale, neutral features of a man weirdly distorted by \nthe rubber -- materialized out of the void right behind her.  THE \n<b>SHAPE!\n</b>\nMary turns, about to scream when the Shape lunges out, lifts her \nup by the nape of the neck and SLAMS her forehead into a large \nmetal SPIKE jutting out from the cavern wall!\n\nLeaving her impaled like a fish on a hook, the Shape resumes its \nrelentless pursuit.  Eerie under the lighted torches.\n\n<b>END OF TUNNEL\n</b>\nJamie runs frantically.  Methodical, heavy FOOTSTEPS behind her.  \nShe chances a look behind.  The Shape is coming!\n\nJamie vaults up a dark stairwell.  A trap door above.  It won't \nbudge.  Jamie frantically POUNDS against the hatch.\n\nThe Shape mounts the stairs!\n\nStrength fueled by sheer desperation, Jamie forces the door open.  \nTumbles onto muddy ground.\n\n<b>EXT. WOODS - NIGHT\n</b>\nJamie drags herself out of the hole and half-runs, half-stumbles \nwith her baby through an ugly, charred forest.  Sharp branches \nwhip at her face.  RAIN falls.  LIGHTNING streaks across the sky.\n\nAs if hell-spawned, the Shape emerges from the underground chamber \nand trudges forward, bold and unstoppable.\n\nJamie tumbles into a gully, nearly dropping the knapsack.  She \npicks herself up, hands groping at rain-sopped earth.  The Shape \nis right behind her!\n\n<b>INT. PICKUP TRUCK - NIGHT (SAME)\n</b>\nA slap-happy, overweight MOTORIST sips coffee from a 7-11 cup, \nstraining to see the road through falling rain and fogged-up \nglasses.  Harry Simms keeps him mindlessly occupied.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tNext up is Dwayne.  What's on your feeble \n\texcuse for a mind, \"Dwayne?\"\n\nThe Motorisft lets out a hardy GUFFAW, spilling his coffee.\n<b>\t\t\n</b><b>\t\tMOTORIST\n</b>\tShit!\n\nFingers burning, he searches the glove compartment for a napkin.\n<b>\t\t\n</b><b>\t\tDWAYNE (V.O.)\n</b>\tI'd just like to say that I listen to your \n\tshow every night, Harry.  I think you're the \n\tbest.  I can't tell you how excited we are \n\tthat you'll be paying a visit to our little \n\ttown tomorrow night.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tDo you have a point to make here, Dwayne, or \n\tshould I just keep practicing my wrist \n\texercises?\n<b>\t\t\n</b><b>\t\tDWAYNE\n</b>\t   (chortles)\n\tHarry, you're too much.  I'd just like to say \n\tthat I understand how things have changed in \n\tthe 90's.  Gays in the military, cut off your \n\thusband's do- jigger, become a national hero.  \n\tBut I just can't see any sense in bringing \n\tHalloween back to Haddonfield.\n\nThe Motorist looks up.  Eyes go wide with panic.  Startled GASP.\n\n<b>P.O.V. THROUGH WINDSHIELD\n</b>\nJamie stands in the middle of the road, SCREAMING bloody-murder.\n\n<b>EXT. WOODED ROAD / INT. PICKUP TRUCK (SAME)\n</b>\nTires SCREECH.  The pickup stops on a dime.  The Motorist just \nsits there, mouth agape as the shrieking girl throws open the door \nand clambers into the passenger seat.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tDrive!  Goddamnit, drive!\n\nThrough his side-view mirror, the unsuspecting Motorist sees the \noutline of a quickly-approaching man.  Unrolling his window, he \nrubbernecks a look outside.\n<b>\t\t\n</b><b>\t\tMOTORIST\n</b>\tHey, what do you think you're --\n\nCRUNCHING BONE and TEARING FLESH as the Shape's hands shoot \nthrough the window, twisting the man's head off his shoulders!\n\nJamie SCREAMS!  Lunges for the steering wheel.  Slams her foot \ndown hard on the gas.\n\n<b>ANOTHER ANGLE\n</b>\nThe pickup bullets forward, fishtailing up the road, never slowing \ndown as the driver's door flies open, dumping the motorists's \nheadless bulk into a muddy ditch.\n\n<b>INT. PICKUP (SAME)\n</b>\nJamie drives.  Checks to see that her baby is safe.  Then lets out \na PRIMAL SCREAM.  A hysterical release of fear and rage, drowned \nout by the squabble of VOICES over the radio:\n<b>\t\t\n</b><b>\t\tMALE CALLER #2 (V.O.)\n</b>\tYou're coming here for this Halloween fair -- \n\tit's all just a game -- a publicity stunt for \n\tyou, isn't it Harry?  These kids -- they're \n\tnot old enough to remember what Myers did \n\there. They look up to you.  Now you're just \n\tasking for trouble.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tYou people really get me.  What are they \n\tputting in the water in that town?\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. LOOMIS'S CABIN - NIGHT (SAME)\n</b>\nLIGHTNING FLASHES and RAIN pelts the windows of a bucolic cabin.  \nThis is a man's retreat and has been for years.  Dark wood, worn \nleather, a few tastefully-chosen antiques.  Floor-to-floor ceiling \nshelves containing a myriad of books and an impressive display of \nawards and degrees, all bearing the name:  SAMUEL J. LOOMIS, Ph.D.\n\nAfter a STATION IDENTIFICATION, \"The Harry Simms Show\" resumes, \ntinny-voiced CALLERS blaring over a handsomely-restored 1928 \nBremer-Tully.\n<b>\t\t\n</b><b>\t\tMALE CALLER #3 (V.O.)\n</b>\tAll these fanatics aside, Harry, I'd \n\tpersonally like to thank whoever did the \n\tmasked one in.  Saved us tax-payers a lot of \n\tmoney in the long run.\n<b>\t\t\n</b><b>\t\tFEMALE CALLER #3 (V.O.)\n</b>\tYeah, that sucker's been dead for six years.  \n\tIt's about time they had a Halloween revival \n\tin this town.  Now my kids can stop driving me \n\tcrazy!\n\nMOVE IN behind a bald, sharp-featured man, hunched over a can as \nhe reminisces over a collection of framed photographs -- memories \nof his wife and children.\n<b>\t\t\n</b><b>\t\tMALE CALLER #4 (V.O.)\n</b>\tWhat happened to that psychiatrist of his?  \n\tLoomis, I think was his name.  I heard the old \n\tquack was dead.\n\nTurning at the mention of his name is DR. LOOMIS himself, wearing \nspectacles, a comfortable sweater and his trademark goatee.  For \nthe first time ever, we actually see him smile.  The burn scars on \nhis face have all but faded away.  Last traces of the horrid past.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tNot dead.  Just very much retired.\n\nLoomis hobbles to the desk and finishes cutting out a newspaper \narticle.  As he arranges the strips of paper in a leather-bound \nscrapbook, a sudden KNOCK at the door gives him a startle.\n\n<b>EXT. LOOMIS'S CABIN - NIGHT (SAME)\n</b>\nAn ominous FIGURE, clad in hat and trench coat, stands beneath the \nglowing porch light, silhouetted in the pouring RAIN.\n\nLoomis opens the door, eyes straining in the semi-darkness, trying \nto identify his unexpected visitor.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (sudden recognition)\n\tWhat the devil?!  Come in -- come in!\n\n<b>INT. LOOMIS'S CABIN - NIGHT (CONTINUOUS)\n</b>\nShuffling inside, dripping with rain, DR. TERENCE WYNN, a \nwell-dressed gentleman in his 50s, removes his hat and coat, \nquickly making himself at home by the crackling fire.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tChrist, what a night!  Not even so much as a \n\tsign for five miles on that road!\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tThat's the whole idea of living in the \n\tcountry.  I thrive on the seclusion.\n\nWynn heads for the kitchen, rummaging through cabinets and drawers \nas Loomis dutifully wipes up his muddy trail.\n<b>\t\t\n</b><b>\t\tWYNN (O.S.)\n</b>\tDon't tell me that the reviled Rasputin of \n\tSmith's Grove has grown complacent in his \n\tgolden years.  I don't buy it for a single \n\tsecond, Dr. Loomis.\n\nLoomis immediately senses that Wynn has an angle.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tAnd in all these years, I've never known you \n\tto make house calls, Dr. Wynn.  Especially at \n\tthis hour ...\n\nWynn returns with a bottle of Irish whiskey and two shot glasses.  \nThrusts one in Loomis's hand and begins to pour.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tUnlike you, Sam, I learned many years ago not \n\tto second-guess the motives of my fellow man.  \n\tRemember what Freud said:  'Sometimes a cigar \n\tis just a cigar.'  Or, in this case, a drink \n\tis just a drink.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI hope you didn't come all the way out here in \n\tthis storm just to quote Freud.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tAs always, your keen powers of perception \n\tastound me.  And you're right.  I've come to \n\tcelebrate. \n\t   (raising his glass)\n\tAfter thirty-two years as Psychiatric \n\tAdministrator, guess who has been named \n\tSmith's Groves new Chief of Staff.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tBut surely Rogers isn't --\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tRetiring.\n\nLoomis is abruptly stunned and delighted by the news.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tWhy -- congratulations!  I can think of no one \n\tbetter suited for the position.\n\nThe two old sparring partners drink to the occasion.  But Wynn's \nangle soon comes to the helm.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tOf course, I need a new Administrator. Someone \n\twho can bring new life -- and some old blood, \n\tif you'll pardon the expression -- back to our \n\tprogram ...\n\nLoomis prepares himself for the bomb.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tWe need you, Dr. Loomis.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tYou should know that it's not wise to play \n\tHalloween pranks on me.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tYou're the only man for the job, Sam. Things \n\thaven't been the same since you left.  I'm \n\trecruiting the best psychiatric team in the \n\tcountry.  Old colleagues.  This is your change \n\tto finally make a difference.\n\nLoomis scratches his head and settles down into his comfortable \neasy chair, amused at the irony of Wynn's speech.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tEven after my stroke six years ago they \n\tpractically had to hold a gun to my head to \n\tget me to retire.  Now things have changed.  \n\tI've changed.  The ghosts have been buried.  \n\tWhy on earth would I want to dig them up \n\tagain?\n\nLoomis finally looks over at Wynn, surprised to find him standing \nat the desk, looking through his scrap book.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tSeems to me there's at least one ghost that's \n\tstill lurking in your closet.\n\nWe follow Wynn's gaze down toward the open page.  A blazing \ntabloid headline:  \"MICHAEL MYERS - DEAD OR ALIVE?\"\n<b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>EXT. RURAL HIGHWAY - NIGHT\n</b>\nJamie's getaway truck ROARS around a bend, tearing up a deserted \nstretch of highway.  The STORM rages.\n\n<b>INT. PICKUP (CONTINUOUS)\n</b>\nJamie strains to see as she drives through sheets of RAIN.  Bone \nweary, fighting panic, holding one hand steady against the wheel, \nthe other on the CRYING infant.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tGod ... Help us, please ...\n\nSomething up ahead.  Jamie's face fills with expectancy.\n\n<b>JAMIE'S P.O.V. - THROUGH WINDSHIELD\n</b>\nA lighted sign appears out of the darkness.  Glowing salvation.  \nFamiliar red-white-and-blue logo.  \"GREYHOUND.\"\n\n<b>EXT. BUS DEPOT - NIGHT\n</b>\nThe pickup drives into the glow of orange vapor lights.  SKIDS to \na stop in a deserted parking lot.  Jamie staggers out, cradling \nthe knapsack as she runs toward the old depot.\n\n<b>INT. BUS DEPOT - NIGHT\n</b>\nJamie blasts through double glass doors.  But the bus station is \ndevoid of life.  Empty benches.  Blank ARRIVAL/DEPARTURE \nsignboard.  The low hum of vending machines.\n\nJamie moves toward the ticket counter.  A handwritten sign left by \nthe attendant:  \"BACK IN 20.\"\n\nShivering, holding her baby, Jamie enters an old-fashioned phone \nbooth.  Picks up the receiver and immediately dials 911.\n<b>\t\t\n</b><b>\t\tVOICE (V.O.)\n</b>\tYou have reached Haddonfield Emergency \n\tServices.  Due to severe weather conditions, \n\tall circuits are momentarily busy.  If this is \n\tnot an emergency, please dial directly ...\n\nJamie slams the phone down in terrified frustration.  Suddenly she \nbecomes aware of the radio program.  Piped in over ancient \nloudspeakers:\n\n<b>\t\tHARRY SIMMS (V.O.)\n</b>\tFor anyone who gives a flying circus, this is \n\tHarry Simms -- the light in your night, the \n\tlove of your loins -- and I want to hear from \n\tmore of you bogeyman believers out there.  So \n\tgive me your best shot at 1-800-878-7274. \n\tThat's 1-800-URTRASH!\n\nThe STATION IDENTIFICATION cuts in.  Jamie picks up the receiver and \nfrantically dials the number.\n\n<b>INT. LOOMIS'S CABIN - NIGHT (SAME)\n</b>\nWynn doesn't give up the sales pitch even as Loomis leads him to the \ndoor.  The radio program still squawking in the b.g.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tBut with Rogers and his house of hacks gone, \n\tyou'd make the rules.  Just think it over.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tPlease try to understand, Terence. I've already \n\tmade up my mind.\n\nAs Wynn continues to talk, his voice trailing off into nothingness, \nLoomis's attention is diverted to the VOICES on the radio.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tSo they're trying to kill you and your baby.  \n\tDon't tell me.  Your name also happens to be \n\tRosemary.\n<b>\t\t\n</b><b>\t\tJAMIE (V.O.)\n</b>\t   (intense whisper)\n\tNo -- please listen!  They're coming ... coming \n\tfor me and my baby.\n\nLoomis's eyes widen; a man possessed.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tCome on, sweetheart -- what is this? Who's \n\tcoming?\n<b>\t\t\n</b><b>\t\tJAMIE (V.O.)\n</b>\tIt's ... Michael ... \n\t   (releasing)\n\t... Michael Myers!\n\nLoomis staggers.  A lifetime of nightmares coming back to haunt him \nall at once.\n\n<b>INT. TOMMY'S APARTMENT - NIGHT (SAME)\n</b>\nPRESS IN TIGHT ON TOMMY in bed.  Listening through headphones.  \nSitting upright.  Thunderstruck.\n<b>\t\t\n</b><b>\t\tJAMIE (V.O.)\n</b>\tSomebody help me!  Dr. Loomis, are you out \n\tthere?  Can you hear me?\n\n<b>INT. LOOMIS'S CABIN - NIGHT (SAME)\n</b>\nWynn watches with rapt attention as Loomis unlocks his safe and \nwithdraws a metal case.  He pops it open, revealing his trusted .357 \nMagnum and a box of cartridges.\n\n<b>INT. BUS DEPOT - NIGHT (SAME)\n</b>\nA bus has arrived.  The ATTENDANT returns to his post.  Jamie hangs \nup the phone, filled with trepidation as PASSENGERS file inside.  A \nstrung-out ROCKER.  A pair of stern-faced NUNS.  A PRETTY TEENAGER \ngreeted in the loving arms of her BOYFRIEND.\n\nJust as she is about to step out of the phone booth, a TALL MAN, \nback turned, wearing a hat and black trench coat, moves to stand \noutside the booth!  Jamie freezes.\n\nSecuring her baby in the knapsack, Jamie throws open the door.  \nSuddenly the Tall Man steps in her path!\n<b>\t\t\n</b><b>\t\tTALL MAN\n</b>\tAre you all right, young lady?\n\nShaking uncontrollably, Jamie shrinks away.  Backing down a narrow \nhall through the door marked \"LADIES ROOM.\"\n\n<b>INT. LADIES ROOM - NIGHT (SAME)\n</b>\nWater runs into a grimy basin.  Unable to contain her tears, she \nwashes the newborn.  Takes a roll of paper towels and tries to rub \nthe triangular blood mark off his chest.\n\nSuddenly the lights go out.  Jamie gasps.  Clutching her baby, she \nturns off the faucet and melts into the darkness.\n\nThe door CREAKS open.  FOOTSTEPS echo inside.\n\n<b>JAMIE\n</b>\nhas locked herself inside one of the stalls.  Heart pounding.  The \nFOOTSTEPS grow louder.  Jamie's eyes dart frantically.\n\n<b>STALKING P.O.V.\n</b>\nMOVING methodically past the row of stalls, pushing open each door, \nrevealing that they are all empty.  A CRASH from the last stall.  \nP.O.V. moves toward it.  RUSTLING and MOVEMENT inside.\n\nA HAND pushes on the door.  An open window above the toilet.  Jamie \nis gone!\n\n<b>EXT. BUS DEPOT - NIGHT (CONTINUOUS)\n</b>\nJamie trembles off a stack of crates piled beneath the window and \ndashes around the side of the depot.\n\nSuddenly the bus ROARS by, sending up a muddy wave as it pulls out, \ndisappearing down the highway.\n\nJamie moves swiftly across the parking lot, clutching the knapsack.  \nShe throws open the door of the pickup and jumps into the driver's \nseat.\n\n<b>INT. PICKUP - NIGHT (CONTINUOUS)\n</b>\nSlapping down the locks, Jamie thrusts the key into the ignition.  \nThe engine REVS to life.  She guns it, peeling out of the parking \nlot.  Back toward the highway.\n\nShe drives on, suppressing her tears, stealing glances at the \nknapsack bunched up on the passenger's seat.  Then she turns and \nlooks forward with concentrated attention.\n\n<b>JAMIE'S P.O.V.\n</b>\nA sign looms ahead:  \"Haddonfield Memorial Hospital - 10 Mi.\"\n\n<b>BACK TO SCENE\n</b>\nJamie sighs with relief, steadying the wheel just as --\n\nHIGHBEAMS flash on right behind her, a juggernaut roaring out of \nblackness!  Jamie's eyes flood with terror.\n\n<b>JAMIE'S P.O.V. - THROUGH WINDSHIELD\n</b>\nThe grill of a familiar white van shoots forward, SLAMMING violently \nagainst the pickup's rear bumper.\n\n<b>JAMIE\n</b>\nis jolted forward in her seat.  Holding on the wheel with a \nwhite-knuckle grip as she's repeatedly hit from behind.\n\n<b>EXT. HIGHWAY - NIGHT\n</b>\nThe unseen madman noses forward, veering sharply over the double \nyellow line, scraping sides with the truck.\n\nHeadlights sear a path through the night, locked in neck-and-neck \nprofile.  SPARKS flashing at 70-miles-per-hour.\n\nThe van forces Jamie onto the shoulder.  It leaves the road, tearing \nbranches from trees.  Jamie SCREAMING.\n\n<b>EXT. PUMPKIN PATCH - THE CHASE\n</b>\nA quick-cut MONTAGE, events ticking out in fractions of a second \nlike a nightmare:\n\nThe pickup springboards over a gulch and slams down hard, tires \nspinning in waves of mud, careening through a vast field.  A \npumpking patch.\n\nThe van reappears in a glare of headlights.  Its engine screaming \nwith fire-breathing rage.\n\nThe pickup puts on a furious burst of speed.  Eating up pumpkins and \nspinning out chunks of splattering seeds and pulp.\n\nThe van bears down hard, slingshotting across the field, whizzing \npast the pickup, cutting right in front of it.\n\n<b>INT. PICKUP\n</b>\nSomething heavy is thrown from the back of the van right through the \nwindshield!\n\nGlass EXPLODES!  Jamie SCREAMS, hands going up instinctively to \nprotect her face.  Swerving wildly out of control.\n\nShe looks to see a sprawling, mutilated corpse on top of her.  Wide, \ncold, lifeless eyes -- Mary!\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tNo!!!\n\n<b>EXT. PUMPKIN PATCH (CONTINUOUS)\n</b>\nThe pickup rockets at breakneck speed toward the edge of the field.  \nSuddenly --\n\n<b>JAMIE'S P.O.V.\n</b>\nThe Shape stands in the field, tall and unmoving, white mask glowing \nhideously in the rush of oncoming headlights.\n\n<b>BACK TO SCENE\n</b>\nThe truck plows into the Shape, dragging it under, SLAMMING headlong \ninto the trunk of a huge oak tree.\n\nEverything is abruptly and shockingly silent.  Like a phantom in the \nnight, the van is gone.  The Shape nowhere to be seen.\n\nSteam billows from the pickup, engine TICKING, a heap of shattered \nglass and mangled steel.  Pinned against the base of the tree is a \nshape in human form -- a scarecrow!\n\nMOVE IN on Jamie, face-down against the steering wheel.  Coughing on \nthe noxious fumes, she stirs back to life.  Slowly, painfully, she \nshoulders the door.  Falls onto the ground.\n\nA SPARK ignites.  BLINDING FLASH as the gas tank EXPLODES, setting \nthe truck ablaze.  Jamie turns, her face a frozen rictus of horror.  \nDebris rains down on her.\n\nSuddenly a grim shadow rises from the field.  The Shape -- wielding \nan enormous butcher knife!\n\nJamie rolls onto her back, SCREAMING.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tNo -- NO!!!\n\nSuddenly the knife plunges down and lands with a terrible THUD.\n\n<b>INT. PICKUP\n</b>\nThe knapsack catches fire ... but inside there is no baby.  Only a \nroll of paper towels from the bus depot.\n\n<b>THE SCARECROW\n</b>\nburns; mocking Jamie with its grinning, hand-painted face.\n<b>\t\t\t\n</b><b>\t\t\t     SLOW DISSOLVE TO:\n</b>\n<b>THE SHAPE\n</b>\nlooks at us, white mask scintillating against blinding rays of \nSUNLIGHT.  Rivulets of blood drip off a large carving knife.\n\nPULLING BACK, we see it is a life-sized, knife-wielding effigy of \nMichael Myers, sitting astride the \"For Sale by Strode Realty\" \nsign.  Stage blood spells out the words:  \"He's coming!\"\n\n<b>EXT. MYERS HOUSE - MORNING (CONTINUOUS)\n</b>\nJohn Strode looks up with disgust as he inspects the grim monument \nthat's been left on his front lawn during the night.  Puffing on a \ncigarette, wearing slippers and a flimsy bath robe, John raises a \nlarge axe.\n\nA group of neighborhood KIDS -- some dressed in Halloween \ncostumes -- stand a safe distance away.  Gathered on the sidewalk.  \nGawking, whispering, tittering.\n\nJohn angrily swings the axe into the signpost.  The kids jump with a \ncollective start.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tEnough ... \n\t   (one CHOP)\n\t... of this ... \n\t   (two CHOPS)\n\t... Michael Myers ... \n\t   (timber)\n\t... shit!\n\nSuddenly the sign crashes down -- and \"Michael Myers\" with it.  The \nkids huddle.  John turns on them, brandishing the axe.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (continuing)\n\tYou stinkin' kids got three seconds to get the \n\thell off my property!  One, two --\n\nThat's all it takes.  The kids scatter, tripping over one another as \nthey tear off down the black.\n\nSatisfied with himself, John stubs out his cigarette and hauls the \nsign and its now-headless rider to the trash.\n\nThen he trudges up the porch steps, dropping the axe as he enters \nthe house.  Uttering oaths under his breath.\n\nBOOM UP over the surrounding neighborheed.  SUPERIMPOSE:\n\n\"Haddonfield, Illinois.  Halloween.\"\n\nLast night's storm has given way to an incredibly bright and \npicturesque morning.  CHILDREN pour out of their homes, bursting \nwith excitement, dressed in colorful costumes.\n\nEven the Myers house, with its trimmed hedges and fresh coat of \npaint, somehow manages to look invite.\n\nA white van slowly rolls up the street.  WKNB logo, streamers and a \nlarge orange banner proclaiming:  \"HADDONFIELD JUNIOR COLLEGE \nHARVEST FAIRE '95 - See Harry Simms Live - October 31.\"  A \nnow-familiar voice booms over loudspeaker:\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tThis is Hard Harry Simms harping on ya from the \n\tBig Apple.  Tonight's the night and the place \n\tto be is the First Annual Harvest Faire.  So \n\tcome on out of your broom closets, 'Fielders, \n\tand bogey the night away with me.\n<b>\t\t\n</b><b>\t\tMALE CALLER #4 (V.O.)\n</b>\tHarry, I just won first prize for ugliest \n\tcostume!  Guess who I'm dressed as.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tYour mother?\n<b>\t\t\n</b><b>\t\tMALE CALLER #4 (V.O.)\n</b>\tNo, man -- You!!!\n\n<b>EXT. SANITARIUM - MORNING\n</b>\nA car bearing an official state emblem stops outside an imposing \ncurtain of security gates.  A large sign reads:  \"SMITH'S GROVE - \n<b>WARREN COUNTY SANITARIUM.\"\n</b>\nA hand reaches out and waves a plastic key card in front of an \ninfrared scanner.  Surveillance cameras perched on the walls.\n\nAs the gate yawns open and the car drives through, we SEE the asylum \nin the distance -- the entire perimeter bounded by woods and barbed \nwire fences.\n\n<b>INT. WYNN'S CAR (CONTINUOUS)\n</b>\nWynn drives.  Loomis in the passenger seat, fueling his own \nanxieties.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tIt was her voice.  On the radio.  It was \n\tJamie.  Calling for me.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tYou don't know that for sure.  It could have \n\tbeen anyone.  A practical joke. Kids.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tIt was Jamie Lloyd.  She came back, as I knew \n\tshe would one day.  And whatever has brought \n\ther back has brought Michael back as well.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tAfter six years?  Sam, she died with him in \n\tthat explosion after the --\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tThat's what someone wants us to believe, but I \n\ttell you Michael is alive.  I feel him.  I \n\tsense the evil that lives inside, just as I did \n\tall those years as I watched him.  Sitting \n\tbehind these very same walls.  Staring. Growing \n\tstronger. \n\t   (off Wynn's silence)\n\tAs my colleague, as my friend, please. I can't \n\tgo through this again.  Not alone.  I need your \n\thelp to stop him.\n\nWynn stares.  Loomis's words fall on him like a death sentence.\n\n<b>INT. SANITARIUM - RECEPTION AREA (SAME)\n</b>\nGold insignia on mahogany doors:  \"TERENCE WYNN - CHIEF OF STAFF.\"\n\nWynn and Loomis stride through a plush reception area.  DAWN, an \nattractive, high-energy secretary, keeps pace, taking notes, handing \nWynn his briefcase, phone messages, etc.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tCancel all my appointments.  Get Dr. Loomis \n\tanything he needs -- files, tests, records of \n\tevery treatment ever administered to a former \n\tpatient of ours -- Michael Myers.\n<b>\t\t\n</b><b>\t\tDAWN\n</b>\t   (stunned)\n\tMichael Myers?\n\nWynn stops abruptly before heading out the door.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tThat's right.  We think there's a very good \n\tchance he might still be alive.\n\nLoomis acknowledges Wynn's silent understanding.\n\n<b>CORRIDOR\n</b>\nWynn and Loomis move along a sterile white corridor.  Wynn uses his \nkey card to BUZZ them through a series of metal security cages.  A \nretinue of DOCTORS and NURSES fall in behind.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tNotify Haddonfield's sheriff; tell him we're on \n\tour way.  I want the entire staff on alert.  We \n\tgo to code red lockdown for twenty-four hours. \n\t   (beat)\n\tIf he is alive, I plan on bringing him back.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tOr what's left of him.\n\nThey cut down a sub-passageway and out a fire exit.\n\n<b>EXT. SANITARIUM - LANDING FIELD (CONTINUOUS)\n</b>\nLoomis and Wynn dash across a windswept field where a Smith's Grove \nmedical transport helicopter awaits them.  The deafening WHINE of \nspinning rotors as a TECHNICIAN refuels.\n\nThe doctors step inside.  The doors close and the helicopter lifts \noff, rising high above the cluster of the white coats below.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. MYERS HOUSE - KITCHEN - MORNING\n</b>\nA blender whips up a revolting concoction of chocolate Yoo-Hoo, \nbanana yogurt and chewy Gummi-worms as Tim, wearing Levi's baggies \nand a \"Harry Simms Kicks Ass\" T-shirt, raps on the phone.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tBro', I knew Harry when we lived in the city.  \n\tDon't worry -- he'll be there. We've got \n\teverything arranged.  Get with me tonight at \n\tthe fair and I'll hook you up.  Peace.\n\nTim hangs up, guzzling down his shake as Debra navigates around him, \nsetting out the breakfast dishes as Kara tries to study.\n\nJohn, dressed in what might be a respectable business suit if it fit \nhim better, mutters grumpily as he pours himself a cup of coffee.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tShitheads ... Defacing my property.  I showed \n\tthem ...\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tRelax, John.  They were just kids.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tKids are what's ruining this country. \n\tEverywhere you go, it's the same.  No goddamn \n\trespect.\n\nTim lets out a huge BELCH as he finishes drinking his breakfast.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (continuing)\n\tSee what I'm talkin' about?\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tYou'll never pass that exam on an empty \n\tstomach, Kara.\n\nDebra snatches the book out of Kara's hands.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\t   (continuing; reading)\n\tCognitive Therapy and Emotional Disorders?  \n\tWhat are they teaching in college these days?  \n\tThe art of going crazy?\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (indignant)\n\tIt's called psychology, Mom.  Living in this \n\thouse is what's driving me crazy.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tWho the hell told you to come live here in the \n\tfirst place?\n\nKara rises, collects her books, trying to avoid a confrontation.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tI'd better get Danny to school.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tShe don't show her face for five years, then \n\texpects us to roll out the red carpet.  You \n\tthink going to college is gonna make up for \n\tyour mistakes, girl?\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tJohn, please don't --\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tYo', just lay off her, Dad.\n\nSuddenly Danny runs in, showing off in his dinosaur costume.  \nROARING loudly.  Startling John.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tWhat the fuck --\n\nKara immediately seizes Danny's hand and ushers him toward the back \ndoor.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tLet's go, Danny.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tKara, wait.  John.  Can't we all just sit \n\tdown?  Try to be a family for once?\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tI'm sorry, Mom.\n\nDebra reaches into her purse and hands Kara a couple of dollars.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tThat's it, Debra, keep slipping her the cash.  \n\tWhile you're at it, why don't you just give her \n\tall our goddamn money?!\n\nJohn explodes, dumping the entire contents of her purse onto the \nfloor.  Debra recoils.  Kara steps in.  Danny is terrified.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tStay away from her, you bastard.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (re Danny)\n\tI only see one bastard in this house.\n\nKara flies at him with Medea-like rage.  John instantly grabs her by \nthe neck and shoves her violently against the counter.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tDad!  Let her go!\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tJohn!  Stop it!  Stop it!\n\nDanny looks outside.  Frozen in horror.  A VOICE whispers.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (V.O.)\n</b>\tKill him, Danny ... Kill him ...\n\nDanny moves across the kitchen.  Mesmerized.  Through the screen \ndoor, the Shape can be seen standing in the back yard.\n\nKara's eyes bulge as John squeezes her throat.  Choking her.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tYou ever raise your hand to me again, I'll kill \n\tyou, you understand?\n\nJohn looks down to see the tip of a butcher knife pointed at his \ngroin.  Danny is holding it -- his eyes dark, emotionless.  Ever so \nslowly, John releases Kara.  Debra and Tim watch in horrified \nastonishment.\n\nSuddenly there's a KNOCK at the back door.  Kara dives toward \nDanny.  The knife clatters to the floor as she picks him up, grabs \nher book bag and hurtles outside.\n\n<b>EXT. MYERS HOUSE - BACK YARD (CONTINUOUS)\n</b>\nBETH, 19, very \"retro,\" cute in the waifish sense -- milky white \nskin, two-tone hair and a dangling nose ring --is nearly bowled off \nthe back porch as Kara and Danny fly out the door.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tMake way for the Hardin County Express. \n\t   (following them across the yard)\n\tHey, where's Tim?  We're supposed to go over \n\tthe list of events for tonight --\n\nBeth is taken aback when she sees the bruise on Kara's neck.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (continuing)\n\tHe do that to you?\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tAnother episode of 'Daddy Knows Best' at the \n\tStrode house.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tPig.  What the hell happened this time?\n\nSuddenly Tim jumps out from behind a clothesline, locking his arms \naround Beth, attacking her with kisses.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (continuing)\n\tHold on, hot lips.  We got work to do.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tShit, Beth, why do we have to be the ones to \n\torgannize this friggin' fair? It's only \n\tHalloween.\n\nBeth shoves the clipboard at him, a champion of her cause.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tHow many times o I have to tell you? It's not \n\tabout Halloween.  It's about being political.  \n\tThere are too many people with corn-cobs up \n\ttheir ass in this town telling us what we can \n\tand can't do.  If we want change, it's up to us \n\tto set an example.\n\n<b>INT. MYERS HOUSE - KITCHEN (SAME)\n</b>\nDebra is on the floor, stifling her tears, putting things back in \nher purse.  John stares coldly out the window.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tI want her and that kid out of here tonight.\n\nDebra rises, facing him scornfully.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tI thought inheriting your father's house ... \n\tthe business ... moving out here might change \n\tthings.  But you're still the same, John. \n\t   (with finality)\n\tKara has come home, and I'll be damned if I let \n\tyou turn her away again.\n\nDebra storms off.  John bores holes into her with his eyes.\n\n<b>EXT. BLANKENSHIP HOUSE (SAME)\n</b>\nTim lifts Danny into the back seat of Beth's convertible VW Bug -- \nplastered with \"Greenpeace\" and \"This is Your Brain on Drugs\" bumper \nstickers.  Kara and Beth in front.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tWhatever happened to women in back?\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tReality check, dillweed.  This is 1995.\n\nPulling away from the curb, Beth honks at MRS. BLANKENSHIP, at least \n80, owner of the student boarding house across the street.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (continuing)\n\tSee you tonight, Mrs. Blankenship!\n\nThe old woman just stares forward.  A gardem hose in hand as she \nwaters a garden of long-dead flowers.\n\nKara shields her eyes, distracted, looking up at the old Victorian \nhouse.\n\n<b>KARA'S P.O.V.\n</b>\nBeth drives down a shady, tree-lined avenue, unaware of the white \nvan that is following them.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tBeth, who's that guy that lives across the hall \n\tfrom you?\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tWhy?  You interested?\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tNo!  I keep seeing him staring out his window.  \n\tWatching me.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tYou mean Tommy.  Yeah, on the weirdness scale \n\the's about an eleven.  Supposedly some scary \n\tshit happened to him when he was a kid.  Messed \n\tup his head.  He's harmless, though.  Probably \n\tjust lonely.\n\nTim leans forward, ravaging Beth's neck.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tOr horny.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tTim, do you always have to act like such an \n\tasshole?\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tOnly when you're around to dump on ... Hey, \n\tchill, sis.  I'm just doggin' ya.\n\nSuddenly the van ROARS by and cuts them off.  Beth lays on the \nHORN.  Slams on the brakes.  Narrowly avoiding a collision.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tSpeed kills, asshole!\n\nSuddenly the van swerves around to face the VW head on.  For a \nbreathless moment the van and the VW sit at opposite ends of the \nintersection.  Idling.  A tense stand-off.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWho is that ...\n\nKara strains to get a look at the van's driver.  A momentary glimpse \nof a pale white face behind the wheel.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (bravely)\n\tI've got my pepper spray.\n\nDanny sits frozen in the back seat.  Suddenly the van shoots \nforward, tires SCREAMING.  Startled GASPS.  The van turns off \nsharply at the last second, SCREECHING down the next block.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\t   (relieved)\n\tHappy fuckin' Halloween.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tSomeone's trying to scare us out of having this \n\tfair ... and it's not gonna work.\n\nBeth drives on, grimly determined.  Kara looks back at Danny.  He \nreturns her frightened gaze.\n\n<b>INT. TOMMY'S APARTMENT - DAY\n</b>\nTommy paces in his cramped apartment.  Dark circles under his eyes.  \nA remote control in hand, reviewing his recording of last night's \nHarry Simms broadcast:\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tSo they're trying to kill you and your baby.  \n\tDon't tell me.  Your name also happens to be \n\tRosemary.\n<b>\t\t\n</b><b>\t\tJAMIE (V.O.)\n</b>\tNo, please listen!  They're coming ... coming \n\tfor me and my baby.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tCome on, sweetheart -- what is this? Who's \n\tcoming?\n<b>\t\t\n</b><b>\t\tJAMIE (V.O.)\n</b>\tIt's ... Michael ... Michael Myers!\n\nFrustrated, Tommy plays it again.  Adjusts the speed.  Tries to make \nout something else in the b.g.  Jamie's voice comes through.  Slow.  \nEerie.\n<b>\t\t\n</b><b>\t\tJAMIE (V.O.)\n</b>\t   (continuing; slowed)\n\tIt's ... Michael ... Michael Myers!\n\nAnother VOICE, distant and distorted, filters up behind hers.\n<b>\t\t\n</b><b>\t\tANNOUNCER (V.O.)\n</b>\tBus 611 from Russellville now arriving.\n\nTommy quickly stops the tape, throws on his worn leather bomber \njacket and bolts straight out the door.\n\nMOVE IN on a pair of old newspaper clippings left on the floor.  \nHeadlines read:  \"November 5, 1989.  JAMIE LLOYD STILL MISSING.\"  \n\"November 19, 1989.  MYERS' NIECE PRESUMED DEAD.\"\n<b>\t\t\t\n</b><b>\t\t\t     DISSOLVE TO:\n</b>\n<b>INT. FORD EXPLORER / EXT. RURAL HIGHWAY - MORNING\n</b>\nTommy drives like a bat out of hell.  The \"Greyhound\" sign looms \nahead.\n\n<b>EXT. BUS DEPOT - MORNING (CONTINUOUS)\n</b>\nThe Explorer pulls up to the depot.  Tommy makes a beeline for the \nentrance, cowboy boots splashing through rain puddles.\n\n<b>INT. BUS DEPOT (CONTINUOUS)\n</b>\nTommy wades his way through a small crowd up to the ticket booth.  A \ncross-eyed ATTENDANT greets him.\n<b>\t\t\n</b><b>\t\tATTENDANT\n</b>\tCan I help you, sir?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tCan you tell me if a bus arrived from \n\tRussellville last night?\n\nThe Attendant checks her roster.\n<b>\t\t\n</b><b>\t\tATTENDANT\n</b>\tSure did.  About seven hours ago.  You lookin' \n\tfor someone --\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (walking away)\n\tThank you.\n\nThe Attendant eyes Tommy suspiciously as he enters the phone booth \nin the corner.  Inside, he picks up the receiver and pretends to \ndial a number.  Makes a cursory inspection.\n\n<b>TOMMY'S P.O.V. - PHONE BOOTH\n</b>\nOn the floor, tiny droplets of what appear to be blood form a dotted \ntrail out the door.\n\n<b>TOMMY\n</b>\nfollows the crimson path around the corner down a dim hallway, \nstopping at the door marked \"Ladies Room.\"  Checking first to make \nsure the coast is clear, he steps furtively inside.\n\n<b>INT. LADIES' ROOM (CONTINUOUS)\n</b>\nTommy walks past the sink.  Water drips into the filthy basin.  He \ntouches something inside, rubs it on his fingers -- blood.\n\nTommy whirls, startled by a sudden NOISE.  Muffled, indistinct.  \nLike CRYING.  Tommy gathers his courage as he slowly moves past the \nlong row of empty stalls.  The CRIES grow louder as he reaches the \nfinal stall.  Jamie's escape route -- the window -- still wide open.\n\nA hole in the wall behind the toilet.  Tommy reaches in, his hands \nlocking onto something.  Shock and amazement overcome him when he \nlifts out a baby -- Jamie's baby.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tJesus ...\n\nThe helpless newborn kicks and CRIES, the triangular symbol of Thorn \nstill caked in blood over his tiny torso.\n\n<b>SUBJECTIVE P.O.V.\n</b>\nSomeone partially opens the door, peering in from the hallway as \nTommy removes his jacket and bundles the baby inside.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tOkay, little guy.  You're okay.\n\n<b>BACK TO SCENE\n</b>\nA CREAK.  Tommy looks up.  The door slowly closes.\n\n<b>DEPOT HALLWAY\n</b>\nTommy looks into shadowy stillness.  No one there.  Hiding the baby, \ncradling his jacket, he hurries through the crowd and slinks out the \ndoor marked ENTRANCE.\n<b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>HELICOPTER P.O.V.\n</b>\nThe SOUND of THWACKING BLADES as we FLY past a winding rural highway \nover a dense grove of oak trees -- massive, ancient guardians of the \nsprawling pumpkin patch that lies beyond.\n\nAs we circle the field, red-and-blue gum machines -- police cars, \nfire engines and ambulances -- can be seen through gauzy veils of \nrising BLACK SMOKE, dissipating with the strong WIND.\n\nCharred in the ground, three intersecting lines stretch a hundred \nfeet across the plan to form a vivid geoglyphic.  The symbol of \nThorn.\n<b>\t\t\n</b><b>\t\tHELICOPTER PILOT (V.O.)\n</b>\t   (filtered)\n\tChopper One to Smith's Grove.  We've got a \n\tvisual.  Approximately ten miles due east of \n\tHaddonfield.\n\n<b>INT. HELICOPTER (CONTINUOUS)\n</b>\nLoomis surveys the crash site with morbid fascination.  Wynn, \nwearing headphones, shouts over the noise.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (pointing)\n\tWhat is that?\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tIt's a sign.  He's come home.\n\n<b>EXT. PUMPKIN PATCH - MORNING (CONTINUOUS)\n</b>\nThe helicopter lands, windmilling gusts of ashen earth.  Loomis and \nWynn jump out, ducking past the spinning blades.\n\nWe FOLLOW them through EMERGENCY CREWS and a few CURIOSITY-SEEKERS \ntoward the center of attention.  A charred body is lifted from the \neviscerated, flame-blackened pikcup truck.\n\nA few feet away, a team of PARAMEDICS work frantically around \nanother body, hidden among a cluster of pumpkins.\n\nLoomis surges forward, at once halted by an armed DEPUTY.\n\n<b>\t\tDEPUTY\n</b>\tSir, you'll have to step back.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tPlease.  I need to see the sheriff.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tOfficial business.\n\nWynn flashes his badge.  The Deputy gives them a vexed glance.\n<b>\t\t\n</b><b>\t\tDEPUTY\n</b>\tWait here.\n\nLoomis's eyes flicker with nervous anticipation.  The Deputy \nwhispers something to SHERIFF JIM HOLDT, a brooding giant of a man \nwho dons a Stetson, holstered .44 Special and steel-toed boots that \ngive new meaning to the term \"bad ass.\"\n\nEven Loomis steps back as the sheriff lumbers toward them.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (extends his hand)\n\tYou must be Sheriff Holdt.\n\nHoldt responds by stubbing out his Marlboro at Loomis's foot.\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tAs a matter of fact, I am.  And I take it \n\tyou're the infamous Dr. Loomis.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI'd like to introduce you to Terence Wynn, the \n\tChief of Staff at --\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tSmith's Grove.  They told me you'd be coming.  \n\tNow I suggest you fly right on back to your \n\tcrackpot asylum.  You people got no business in \n\tmy town.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tMichael Myers is my business.\n\nHoldt towers above him.\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tI want you to listen and listen good, Loomis.  \n\tThings have been quiet for six years and that's \n\tthe way they're gonna stay.  The last thing we \n\tneed is you spouting off your ghost stories.\n\nAs usual, Loomis isn't easily intimidated.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI suppose it was a ghost that did all this.  A \n\tghost who called the radio station last night.  \n\tMaybe that same ghost is lying over there right \n\tnow.\n\nHoldt fumes, ready to boil when --\n<b>\t\t\n</b><b>\t\tDEPUTY\n</b>\tSheriff!  She's alive!\n\nHoldt and Loomis wade through the crush of paramedics, running \nalongside the stretcher being whisked toward an ambulance.\n\nA large knife extruding from a girl's stomach, packed under sterile \ngauze.  Skin pasty-white.  Lips blue from shock.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tDear God ... Jamie!\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. HADDONFIELD JUNIOR COLLEGE - PARKING LOT - MORNING\n</b>\nBeth's car pulls into the parking lot of a picturesque, impeccably \nlandscaped campus, speckled with colorful leaves.  A buzz of \nexcitement fills the autumn air.\n\nTim and Beth are surprised to see a small crowd -- camped out in \nsleeping bags, holding \"We Love to Hate Harry\" signs.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tYo, check it out.  They've been lining up all \n\tnight just to see Harry. \n\t   (to Kara)\n\tYou lose your mind in that thing, Kara?\n\nKara is nervously rifling through her enormous book bag.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tI can't find my term paper.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tSo copy someone else's.  I do it all the time.  \n\tWorks primo.\n\nArmed with her clipboard, Beth is assailed by her COMMITTEE.  \nInundating her with QUESTIONS.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tGive us victory or give us death.  See you \n\ttonight, Kara!\n\nTim and Beth are swept away.  A large sheet of paper falls out of \nKara's bag.  She picks it up, startled by what she sees.\n\n<b>KARA'S P.O.V. - THE DRAWING\n</b>\nCrayola figures of Grandma, Grandpa, Uncle Tim, and Mommy.  Knives \npiercing them.  Blood dripping.  Mouths screaming.  A black shadow \nfigure bearing the word \"THORN.\"\n\nOn the flip side, the drawing she found last night.  Danny's \nscribbling of the odd triangular symbol.\n\n<b>BACK TO SCENE\n</b>\nThe horrifying images send chills up Kara's spine.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tThorn ...\n\nLost in grim reverie, Kara walks on, oblivious to the activity all \naround her ...\n\nA banner hangs from the eaves of the library:  \"HADDONFIELD JR. \n<b>COLLEGE - FIRST ANNUAL HARVEST FAIRE.\"\n</b>\nTim and Beth supervise as preparations for tonight's event get \nunderway.\n\nSTUDENT VOLUNTEERS nailing together booths, hanging decorations.  A \nhalf-assembled Ferris wheel, a merry-go-round, an ominous-looking \nHouse of Horrors.\n\nRounding the corner onto the quiet path behind the library, Kara \nsuddenly finds herself alone.  WIND whips at her hair.  She glances \nover her shoulder, as if sensing a presence.\n\n<b>KARA'S P.O.V.\n</b>\nNo one is there.  Just the rustling of leaves on the ground.\n\n<b>ANGLE ON KARA\n</b>\nWalking off in the distance.  Suddenly the Shape steps shockingly \ninto FRAME, watching her disappear around the corner.\n<b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>INT. HADDONFIELD MEMORIAL - EMERGENCY ROOM - DAY\n</b>\nDoors BLAST open.  The stretcher holding Jamie is pushed through, \nLoomis right beside her.  Wynn follows, trying to stop him.  A \nSHOCK-TRAUMA unit swarms in.  No time to lose.\n<b>\t\t\n</b><b>\t\tPARAMEDIC\n</b>\tPenetrating abdominal trauma.  Massive blood \n\tloss.  We've given her two units of O-negative \n\tstat and dextran.  BP sixty.  Pulse one-twenty \n\t... Somehow she pulled through out there all \n\tnight!\n\nDR. BONHAM, the ER resident, peels off the sheet, exposing a dark \nsea of blood around the enormous knife still jutting from Jamie's \nstomach.  Bonham stares, incredulous.\n<b>\t\t\n</b><b>\t\tDR. BONHAM\n</b>\tHow can this girl still be alive?! Type and \n\tcross-match for another six units!  Get a CT \n\tscan and move her into surgery. \n\t   (re Loomis and Wynn)\n\tAnd get them out of here!\n\nORDERLIES move in.  Loomis won't release Jamie's hand.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tSam, don't -- let them take care of her.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI'm here now, Jamie.  You're going to live.  \n\tYou have to.\n\n<b>HOSPITAL ENTRANCE / ADMITTANCE DESK\n</b>\nPneumatic doors fly open.  Tommy bursts through, holding the baby in \nhis jacket.  PATIENTS and COPS everywhere.  He hones in on the NURSE \nbehind the admittance desk.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI need to see a doctor.\n<b>\t\t\n</b><b>\t\tNURSE\n</b>\tWhat seems to be the problem?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI-it's a baby -- my baby.  There's been -- been \n\tan accident.\n<b>\t\t\n</b><b>\t\tNURSE\n</b>\tWhat kind of an accident?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (explodes)\n\tJust get me a doctor right now!\n\n<b>ADJACENT HALLWAY\n</b>\nWynn and Loomis skirt past a line of SECURITY GUARDS.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tThere's nothing more you can do for her.\n\nThe shrill sound of Wynn's beeper.  He clicks it.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tI'll be right back.\n\nWynn disappears around the corner.  Loomis wanders off alone.\n<b>\t\t\n</b><b>\t\tTOMMY (O.S.)\n</b>\tDr. Loomis!\n\nLoomis reacts, taken aback by the frantic young man bounding toward \nhim.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tYes?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tDr. Loomis, thank God you're here.  You heard \n\ther, didn't you?  It was Jamie.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI'm sorry, but do I know you --\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI'm Tommy.  Tommy Doyle.  Laurie Strode -- \n\tJamie's mother -- she was baby-sitting for me \n\tthat night --\n\nLoomis suddenly recognizes him.  It's been a very long time.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tYes ... Tommy.  What are you doing here?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tPlease -- just tell me the truth.  Has Michael \n\tMyers come home?\n\nLoomis pulls Tommy aside into an empty alcove.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tWhat do you know about Michael?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI know he's alive.  People in this town -- they \n\twant us to believe he's dead.  But I know.  \n\tI've always known.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tRight now at least one girl is dead and Jamie \n\tLloyd is in there fighting for her life.  She \n\tis the last of his blood line.  If she dies --\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (gravely)\n\tNo, Dr. Loomis.  She's not the last night.\n\nTommy hesitates.  Loomis's eyes are drawn enigmatically to the \ninfant in Tommy's arms.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (continuing; startled realization)\n\tOh, God -- his cousins.  The Strodes. They're \n\tliving in the Myers house!\n\nLoomis's face flls with horror.  Tommy sees the Admittance Nurse, \nflanked by a pair of security guards, walking his way.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (continuing)\n\tI gotta go.\n\nTommy bolts toward the exit.  Loomis tries to stop him.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tTommy, wait!\n\nBut he is gone.  A hand taps Loomis's shoulder; he reels.  Wynn.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tThere you are.  Who was that boy?\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tAn old friend.\n\nDarkness fills Loomis's countenance as we\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. MYERS HOUSE - DAY\n</b>\nWe peer OVER THE SHOULDER of the Shape, standing across the street.  \nWatching Debra, in jeans and a rumpled sweatshirt, collecting \nleft-over painting supplies from the front porch.\n\nDebra starts to open the CREAKY screen door when she notices the axe \nJohn had used earlier.  Clumsily picks it up and slides it through \nthe top of the crate she is holding.\n\n<b>INT. MYERS HOUSE - FOYER (CONTINUOUS)\n</b>\nLaden with her heavy load, Debra nudges the door shut with her \nfoot.  Then crosses to another door -- the cellar door.\n\n<b>INT. MYERS HOUSE - CELLAR - DAY (CONTINUOUS)\n</b>\nDebra, silhouetted at the top of the stairs, hits a light switch; a \nnaked bulb springs to life.  Slowly she descends the rickety \nstaircase.\n\nThe basement, pitch dark save for a spear of sunlight shooting \nthrough an elevated window, is overrun with cobwebs, rusted tools \nand broken bicycle parts.  A clunker of a washing machine RATTLES in \nthe corner.\n\nDebra makes space for the crate in a storage cabinet.  Suddenly the \nwashing machine stops.  Nonplissed, she moves toward it.  Lifts the \nlid.  The bed sheets inside are sopping wet.\n\nOpening the electrical fuse box, she flicks a switch back and forth \na few times -- but the washing machine doesn't respond.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tGreat.\n\nFrustrated, Debra looks down to see a large puddle of water forming \non the floor.\n\n<b>INT. MYERS HOUSE - FOYER (SAME)\n</b>\nDebra hauls a laundry basket upstairs, filled with wet sheets.  She \nturns, startled.  The front door is standing wide open.\n\nJust as she goes to shut it, a man steps out from the living room \nbehind her.  She gasps, dropping the basket; it's Loomis.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI'm very sorry, Mrs. Strode.\n\nDebra shudders at the sight of the beguiling, wide-eyed man.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (continuing)\n\tI've been knocking.  The door was open. Is \n\teverything all right in here?\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\t   (defensively)\n\tWho are you?\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI've come to help your family.\n\nDebra steps aside as Loomis walks in right past her.  Holding a \nvaluminous file bearing the name \"MICHAEL AUDREY MYERS.\"\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. TOMMY'S APARTMENT - DAY\n</b>\nThe SOUND of JANGLING KEYS.  A door UNLOCKING.  Tommy scrambles in, \nthe baby iin one arm, a bag of groceries under the other.\n\nWith a single swipe, he clears away the junk on his futin, then \ncarefully lays down the CRYING infant.  He digs through the bag:  \nBaby Wipes.  Diapers.  Formula.  Bottles.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tShhh.  Okay, okay, Kyle.  You like that name?  \n\tYeah, I think it suits you.\n\nQuickly he scans the directions on the formula.  Pours the liquid \ninto a bottle, nukes it in the microwave, then returns to the \nbusiness at hand.\n\nTommy grimaces at the mess inside his leather bomber.  The baby \nCRIES harder.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (continuing)\n\t This is worse for me than it is for you.\n\nArmed with Baby Wipe and a diaper, Tommy goes to work.\n\n<b>UPSTAIRS HALLWAY (SAME)\n</b>\nMrs. Blankenship traverses the hall outside Tommy's apartment.  The \nbaby's CRIES; Tommy's GROSSED-OUT GROANS can clearly be heard.  But \nthe old woman keeps walking, oblivious to it all.\n\n<b>TOMMY'S APARTMENT (SAME)\n</b>\nTommy finishes securing the diaper.  The baby in his arms, he tests \nthe formula's temperature and feeds him.  The infant sucks \nvoraciously.  The crying stops.  Tommy rocks him gently.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tIt's okay, big guy.  Don't you worry. I'm gonna \n\ttake care of you.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. MYERS HOUSE - LIVING ROOM (SAME)\n</b>\nLoomis, setting out the case file on Michael Myers -- gruesome \nphotographs of the murder scenes -- has Debra's undivided attention.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tMichael Myers was just six-years-old when he \n\tstabbed his sister to death in 1963.  Here in \n\tthis house.  For the next fifteen years, I \n\tbecame obsessed with finding out what was \n\tliving inside of him.  He was my lift's work \n\tand my ultimate failure.  I knew what he was \n\tbut I never knew why.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. COLLEGE CLASSROOM (SAME)\n</b>\nKara sits in the front row of a classrooom as a PROFESSOR drones \non.  He looks at Kara, something frightening in his gaze.  Watching \nas her pen glides dreamily over her notebook.\n<b>\t\t\n</b><b>\t\tLOOMIS (V.O.)\n</b>\tThere's a living force inside of him. Driving \n\thim.  And I fear that somehow it has been \n\tunleashed again.\n\n<b>KARA'S P.O.V. - NOTEBOOK\n</b>\nAn entire page of scribbled triangles.  The mark of Thorn.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. ELEMENTARY SCHOOL - PLAYGROUND - DAY\n</b>\nA group of KIDS engaged in a game of Pogs -- two opponents facing \noff, slamming down the colored discs.  Lunch money on the ground.  \nHigh stakes indeed.\n\nIAN, a lunkish 5th grader, is clearly the man to be reckoned with.\n<b>\t\t\n</b><b>\t\tIAN\n</b>\tWho's my next victim?\n\nThe other kids make way as Danny takes the empty spot on the \ntetherball court, sitting face-to-face with the inplacable Ian.\n\nDanny says nothign as he places his bet and slams the stack of \nPogs.  Ian glowers.  Easy money.  The showdown begins.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. MYERS HOUSE - HALLWAY / KARA'S ROOM\n</b>\nLoomis vivdly reenacts the nightmare as Debra shows him upstairs.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tHe crept up these stairs and made his way into \n\tthis room.  His sister's room. Right here.  \n\tWhere it all began.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\t   (near tears)\n\tWhat makes you think he'll come here again?\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tThis house is sacred to him.  It's the source \n\tof his memories -- his rage.  Mrs. Strode, I \n\tbeg you.  Don't let your family suffer the same \n\tfast as Laurie and her daughter.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tJamie?  But I thought she was --\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tFound this morning.  In a field outside \n\tHaddonfield.  Stabbed.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. HOSPITAL - OPERATING ROOM - DAY\n</b>\nDr. Bonham and his team surround Jamie, anesthetized on the \noperating table, her condition weak but stable.\n\nBlood flows from the gaping wound in her abdomen.  Slowly, \npainstakingly, the knife is extracted.\n\nA NURSE takes a sample of a thick, viscous fluid from beneath \nJamie's gown and holds it up to the light for the doctor.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. PLAYGROUND - DAY (SAME)\n</b>\nDanny wins another round.  His till growing.  More kids gather to \nwatch.  Ian is losing his cool, determined to save face.\n<b>\t\t\n</b><b>\t\tIAN\n</b>\tDouble or nothing.\n\nDanny pushes over the stack, nothing incisive in his manner.  Ian \nretorts, angrily slamming his Pogs.\n<b>\t\t\n</b><b>\t\tIAN\n</b>\t   (continuing)\n\tLook how he sits there.  Little freak. Just \n\tlike the bogeyman who used to live in his \n\thouse.  Are you the bogeyman, Danny?\n\nIan trumps Danny's hand and smiles haughtily.  The low, whispering \nVOICE which only Danny can hear RUMBLES in his mind.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (V.O.)\n</b>\tKill him, Danny ... Kill him now ...\n\nDanny stares blankly across the playground.\n\n<b>DANNY'S P.O.V.\n</b>\nThe white van is parked across the street.  A tall figure in black \nstands beside it, watching Danny.  The Stranger!\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. CAMPUS LIBRARY - DAY\n</b>\nKara sits glued behind a computer monitor, the glow of the screen \nreflected in her reading glasses.\n<b>\t\t\n</b><b>\t\tLOOMIS (V.O.)\n</b>\tThis force which drives him, which keeps him \n\talive, comes from something more powerful -- \n\tmore deadly than we can possibly imagine.  The \n\tembodiment of all that is evil.\n\n<b>KARA'S P.O.V.\n</b>\nA litany of topics scroll up the screen.  Kara punches in one of \nthem.  Card catalog entry reads:  \"Thorn:  The Devil's Rune.\"\n\n<b>EXT. PLAYGROUND (SAME)\n</b>\nSpellbound, Danny slams down the winning Pog.  Methodically, he \ndumps the money in his Halloween bag and begins to walk away.\n\nIan sees red.  Written across Danny's last Pog:  \"DIE, FAT ASS.\"\n<b>\t\t\n</b><b>\t\tIAN\n</b>\tYou crazy little freak!!!\n\nIan goes berserk, leaping out at Danny like an enraged lion.  The \nkids cheer him on as a full-fledged playground brawl ensues.\n\nDanny breaks away.  Runs.  With an amazing burst of strength, he \nswings a tetherball.  Th ball CRACKS Ian right between his eyes, \nlaying the bully flat on his ass.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. MYERS HOUSE (SAME)\n</b>\nDebra leads Loomis to the front door, her face clouded with fear.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tWhat should I do?\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tLock the doors and call your husband. Get your \n\tfamily as far away from Haddonfield as \n\tpossible.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tGod ... this can't be true.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tMrs. Strode, Michael Myers is here to kill his \n\tfamily.  And he won't stop until you are all \n\tdestroyed.  I only thank God that I found you \n\tbefore he did.\n\nLoomis grips her hand reassuringly, then heads out the door.  Debra \nturns the deadbolt, securing it with the chain lock.  She collapses \nagainst the wall, tears of horror in her eyes.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. PLAYGROUND / GATE (SAME)\n</b>\nA TEACHER blows a WHISTLE, wading through the screaming, cheering \nkids as Danny pummels Ian brutally with his fist.\n\nThe teacher helps Ian out of the fray, eyes warbling, nose and mouth \nbleeding.  Danny takes off running toward the gate.\n\nSuddenly he barrels into the outstretched hands of a towering \nshape.  Danny looks up in shock at a stone-faced man -- Tommy!\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. CAMPUS LIBRARY - DAY\n</b>\nMOVING with Kara through long rows of books -- a veritable labyrinth \nof knowledge.  She comes down a deserted aisle, searching.  Her eyes \nspotting what she is looking for.\n\nShe pulls out an old, dusty tome and begins flipping through its \npages.\n\nAs she reads we SEE the cover:  \"Runes and Ancient Black Magic.\"\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. STRODE REALTY - DAY\n</b>\nESTABLISHING.  A modest, one-story building located in the older \nbusiness section of town.  Cheap Halloween decorations hang in the \nwindows.  An \"OPEN\" sign on the front door.\n\nMOANS of ecstasy resound along the street, attracting the attention \nof the mid-day passerby.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tI'm coming.  Yes.  I'm coming.  Get ready.  I'm \n\tcoming.  Oh, yes!  Yesss!!!\n\nThe WKNB station van rolls by; another Harry Simms plug.  Some \npeople laugh.  Others wince in disgust.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\t   (continuing)\n\tMade ya look!!!  I'm coming, all right. And you \n\tbetter be there.  Tonight.  Let's do it \n\ttogether.\n\n<b>INT. STRODE REALTY - DAY (CONTINUOUS)\n</b>\nA sparesely-furnished office screaming for renovation.  Business is \nobviously slow.  John rattles a jammed file cabinet, then kicks it \nin a fit of angry frustration before answering the incessantly \nRINGING phone.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (barking)\n\tStrode Realty.\n\n<b>INT. MYERS HOUSE - KITCHEN\n</b>\nDebra on the other end.  Tears reddening her cheeks.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tJohn, it's me.  Something terrible has \n\thappened.\n\nINTERCUT their conversation.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tWhat is it this time?\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tA man came by the house.  A psychiatrist by the \n\tname of Loomis.\n\nJohn stiffens, slowly sits down behind his desk.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\t   (continuing)\n\tHe told me about the terrible things that \n\thappened here.  In our house.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tWhat the fuck are you doing letting strangers \n\tin without --\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\t   (releasing)\n\tJohn, they sound Jamie Lloyd this morning!  \n\tSomeone tried to kill her!\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tWhat in God's name are you talking about, \n\twoman?  When are you gonna stop listening to \n\tthose damned talk shows?\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tI'm getting the children out of here. At least \n\tuntil we know what we're dealing with.  John, I \n\twant you to come with us.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (whispers)\n\tDebra, you're fuckin' insane.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tYou knew, didn't you, John?  You knew.\n\nA CLICK as the line suddenly goes DEAD.\n\nJohn scowls, opens his lower desk drawer, produces a bottle of JD \nand a small glass.  He blows off dust and begins to pour.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tTrick-or-treat to you, too.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. MYERS HOUSE - UPSTAIRS (SAME)\n</b>\nCAMERA FOLLOWS Debra in frantic flight from bedroom to bedroom, \nthrowing open closets and drawers, filling a suitcase with a night's \nworth of clothes for her family.  She accidentally knocks a family \nportrait off a bureau.  Glass SHATTERS.\n\n<b>FOYER / LIVING ROOM\n</b>\nDebra drags the suitcase downstairs.  Lets out a horrified gasp.  \nThe crate she had previously stored in the cellar is now sitting in \nthe center of the hallway ...\n\nThe axe that had been sticking out of it earlier is now missing!\n\nThe telephone RINGS.  Eyes riveted to the crate, Debra backs away \ndown the hall.  Into the living room.  Picks up the phone.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tHello?\n\nA startling, intensely whispering VOICE:\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (V.O.)\n</b>\tWe want the child ...\n\nDebra slams down the phone.  Terror paralyzing her.\n\nMUFFLED, HEAVY BREATHING fills the room.\n<b>\t\t\n</b><b>\t\tDEBRA\n</b>\tOh, God ...\n\nDebra races back into the foyer and struggles with the door.  In her \npanic, she can't release the chain lock.\n\nShe turns to see the Shape standing right behind her!  Debra \nSCREAMS.  Breaks for the hall.  Through the kitchen.  Flings open \nthe back door.\n\n<b>EXT. BACK YARD - DAY (CONTINUOUS)\n</b>\nDebra half-runs, half-stumbles through the endless rows of \nclotheslines.  White sheets twist around her like ghosts in the \nblustering WIND.  She tosses them aside, one after the other.  \nApproaching the driveway.  Safety up ahead.\n\nWhipping aside the last sheet, Debra finds herself staring into the \nShape's death mask.  Her eyes bug.  Too late to scream.  The missing \naxe swings at her like a sledge hammer.  Blood paints the sheets red \nas we\n<b>\t\t\t\n</b><b>\t\t\t     DISSOLVE TO:\n</b>\n<b>EXT. COLLEGE CAMPUS - DUSK\n</b>\nLaden with her book bag, Kara exits the library and heads across the \ncampus green.  All around her, the sights and sounds of the \nimpending carnival come to life.\n\nRides assembled.  Paper witches hang from broomsticks.  Goblins lurk \nbehind syrofoam gravestones.\n\nKara waves at Beth in the distance, making last-minute \npreparations.  Student volunteers scurrying in every which \ndirection.  Donning costumes.\n\nA ducking for apples booth.  Homebaked goodies set out on picnic \ntables.  Long rows of pumpkins lined up for a jack-o'-lantern \ncarving contest.\n\nThe centerpiece of all this is a huge, magnificently decorated \nHALLOWEEN TREE.  Tim and a gaggle of WORKERS stream up ladders, \nstringing lights, hoisting up colorful bunting filled with mounds of \ncandy.\n\nAs Kara walks along, her hair being tossed about in the brisk WIND, \nshe becomes aware of the magical, almost out of time quality that \nseems to hang in the air.\n\n<b>EXT. STREET (SAME)\n</b>\nKara walks past the crows of \"Harry-ites\" gathered outside the \ncampus gates, now extending half-way around the block.\n\nThe WKNB van rolls by, exhorting the crowd with the voice of the man \nthey've all come to see:\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tIt's almost that time, all you kiddies and \n\twomen with big -- hey, what rhymes with \n\tkiddies?  So let's count it down as we get down \n\tto the witching hour!\n\nKara walks on, smiling to herself as the crowd bursts into gales of \nwild, exuberant CHEERS.\n\n<b>EXT. LAMPKIN LANE / MYERS HOUSE - DUSK\n</b>\nThe setting sun glows behind the trees, casting long shadows as Kara \nrounds the corner onto her street.\n\nKIDS already pouring out of their homes, some accompanied by \nPARENTS, others joining groups of friends.\n\nKara ambles up the walk of the Myers house, shoes clapping up the \nporch steps as she digs the keys out of her overstuffed bag.\n\nUnbolting the door, she finds that it's secured with the \nchain-lock.  Kara pushes on it, calling inside.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMom, I'm home ... Hello?\n\nNo response.  Puzzled, she steps off the porch and makes her way \naround the side of the house, CAMERA FOLLOWING as she peers into the \nwindows along the way.\n\n<b>BACK YARD (CONTINUOUS)\n</b>\nKara walks along the billowing clotheslines, passing the blank spot \nwhere the blood-stained sheets were -- and are no longer.\n\nShe reaches the back door.  Standing ajar.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMom?\n\nCasting one last glance across the yard, she steps inside.\n\n<b>INT. MYERS HOUSE - KITCHEN (SAME)\n</b>\nEverything in its proper place.  Kara drops her heavy bag on the \nkitchen table and proceeds down the hall.\n\n<b>LIVING ROOM / FOYER - DUSK INTO NIGHT (CONTINUOUS)\n</b>\nThe room is quickly falling into darkness.  The eeriness almost \npalpable.  Kara advances into the living room, eyes roaming.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMom? ... Danny?\n\nNothing.  Kara moves into the foyer.  Her mother's suitcase still \nsitting there.  Beyond, the cellar door stands wide open.  Kara \nmoves toward it, peering into blackness.\n\nA sudden CRASH from upstairs.  Kara jerks the door closed and looks \nup the deeply-shadowed staircase.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing)\n\tMom?  Are you there?\n\nA muffled ROAR.  Kara mounts the staircase.\n\n<b>UPSTAIRS HALLWAY (CONTINUOUS)\n</b>\nKara reaches the second floor landing and moves slowly toward the \ndoor at the end of the hall.  Danny's room.  An orange glow flickers \naround the edges of the closed door.\n\n<b>KARA'S P.O.V.\n</b>\nHer hand grabs the doorknob, turns it.  The door swings open.\n\n<b>DANNY'S BEDROOM\n</b>\nSomeone sitting on the edge of Danny's bed.  A man.  His back \nturned.  Dinosaurs ROAR on Sega Genesis.  Danny squatting on the \nfloor, engrossed in his game.\n\nKara stares at the intruder in horrified disbelief.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWho the hell are you?\n\nThe man watching over Danny turns toward Kara.  It's Tommy.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI-I'm your neighbor from across the street.  My \n\tname's Tommy.  Tommy Doyle.\n\nPanicked, Kara makes a wall of herself between Tommy and Danny.  The \nlittle boy isn't the least bit fazed.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWhat are you doing with my son? Where's my \n\tmother?\n\nTommy backs off a tick, calmly trying to explain.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tShe wasn't here when I brought Danny home \n\tfrom --\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (fortissimo)\n\tDanny, go downstairs -- Now!\n\nDanny finally looks up, exasperated.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tTommy's my new friend.  We've been playing 'til \n\tyou got home.  He knows all about dinosaurs.\n\nOne look at Danny's black eye and Kara goes ballistic.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMy, God!  What have you done to him?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI didn't -- He got in a fight and I --\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tYou stay away from him!\n\nKara starts to drag Danny away by the arm.  He resists angrily.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tIt wasn't Tommy!  It was the voice man.\n\nKara sees Tommy hunkering down in the corner, lifting something out \nof a crate -- a makeship crib.  He turns, his expression very \ngrave.  Holding the baby.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI want you to listen very carefully to \n\teverything I'm about to tell you.\n\nKara's face is a melange of wonder and fear as we\n<b>\t\t\t\n</b><b>\t\t\t     DISSOLVE TO:\n</b>\n\n<b>INT. JAMIE'S HOSPITAL ROOM - NIGHT\n</b>\nJamie lies comatose, ensconced in the dim GLOW of monitors.  \nSustained by I.V.s and a breathing apparatus.\n\nMOVE IN on Jamie.  EKG registers rapid heartbeat.  MOVE IN TIGHT on \nher eyes, darting beneath closed lids.\n\n<b>INT. CORRIDOR - DISTORTED VISION (DREAM SEQUENCE)\n</b>\nBlood-chilling SCREAMS as we MOVE rapidly through a BLINDING TUNNEL \nOF LIGHT.  Blurred, indistinct images.  FIGURES wearing long white \ncoats flash along sterile walls.\n\nAs we BLAST around corners, we realize we are seeing from the P.O.V. \nof a girl being pushed forward on a gurney.  It is Jamie.\n\nHer arm injected with a sedative.  Eyes lolling.  Succumbing.\n\n<b>JAMIE'S P.O.V. - MOVING (DREAM SEQUENCE)\n</b>\nEven more DISTORTED now, images swirling at random.  Cold, staring \nFACES.  Flashing lights on a wall panel:  \"3-2-1-B\" -- an elevator.  \nGoing down.  Down.  Beneath the basement level.\n\nThe doors open.  The gurney SLAMS out into DARKNESS.  VOICES ECHO.  \nLighted torches flicker on craggy walls.\n<b>\t\t\n</b><b>\t\tJAMIE (O.S.)\n</b>\tPlease -- don't let him do this to me.\n<b>\t\t\n</b><b>\t\tVOICE (O.S.)\n</b>\tWe're not going to hurt you, Jamie.  He chose \n\tyou.  Now it's time.\n\n<b>SHAPE'S P.O.V.\n</b>\nPacing back and forth behind iron bars, agitated, disturbed.  SEEING \nJamie strapped to a table.  Surrounded by robed figures.  CHANTING.  \nWeakly, Jamie reaches out toward the cell.\n<b>\t\t\n</b><b>\t\tJAMIE\n</b>\tPlease, Michael ... Help me.\n\nSuddenly a long SHADOW fills the room.  The P.O.V. becomes more \nrestless as the Stranger glides toward Jamie and disrobes.  The \nfigures close the circle.  Jamie SCREAMS in terror.\n\nThe Shape's hands SLAM violently against the iron bars, a horrific \nSHUDDER of metal as we\n<b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>INT. JAMIE'S HOSPITAL ROOM - NIGHT (SAME)\n</b>\nJamie's eyes flash open!  A dark shadow fills the room.  The \nStranger descends on her!\n\nGloved hand covers Jamie's mouth.  A switchblade FLICKS open.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (O.S.)\n</b>\tYour work is done, Jamie.\n\nThe glinting blade SLASHES across Jamie's throat, cutting off her \nsoundless scream!\n\nThen the Stranger flows out of the room.  Spurs CLANKING.  Like a \nthief in the night.  The shrill sound of a BEEPER going off as we\n<b>\t\t\t\n</b><b>\t\t\t     SLOW DISSOLVE TO:\n</b>\n<b>EXT. HADDONFIELD STREETS - NIGHT - SERIES OF SHOTS\n</b>\nThe dark blanket of night envelops the little town.  The LIGHTS of \nthe fair twinkle in the distance, bright and beckoning.\n\nFamilies -- men, women and children alike -- turn out from their \nhomes wearing COSTUMES, joining a growing procession along the \npeaceful streets of Haddonfield.\n\nA large group of PROTESTORS carry PICKET SIGNS in front of the \ncampus gates.  Rallying against the celebration.\n\nHaddonfield's finest out in full force, squad cars sweeping \nalongside a black STRETCH LIMO as it makes its way through town.  \nTinted windows make it impossible to see inside.\n\n<b>EXT. CAMPUS PARKING LOT / HARVEST FAIR ENTRANCE - NIGHT\n</b>\nTim and Beth, standouts as punk versions of Frankenstein and his \nbride, stride purposefully toward the fair entrance.  Beth is a \njumble of nerves as she runs down her checklist of events.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tSeven-thirty is the costume pageant ... Carving \n\tjack-o'-lanterns at eight ... Photos for the \n\tschool paper at nine ... Then Harry lights the \n\ttree at nine- thirty ... I just know I'm \n\tforgetting something!\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tRelax.  Everything's cool.  Didn't I tell you \n\tHarry would be here?\n\nThe limo crawls into the parking lot.  A stampede of overzealous \nFANS surge past them.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tThat's what worries me.\n\nTim and Beth move into the fair, with all its noise and colorful \nmovement.\n\n<b>ANOTHER ANGLE\n</b>\nKIDS waving signs and T-shirts.  Throwing themselves at the \nwindows.  Frenzied CLAMORING.  Harry-mania abound.\n\nThe WKNB van parks parallel to the steps of the library, adorned \nwith HAREM GIRLS and a large golden throne.  The side door opens.  A \nred carpet is rolled out.\n\nA tall, imposing figure emerges from the van and walks up the \nsteps.  Spurs CLANKING on black boots.  \"Jesse James\" style duster.  \nHat cocked slightly.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS (V.O.)\n</b>\tHellllo, Haddonfield!!!\n\nThe crowd turns in a mass of confusion.  Standing above them, waving \nfrom a microphone, is HARRY.  Dark sunglasses.  Gaunt, glacial \nfeatures and an outrageous mane of black hair.\n\nSuddenly Harry throws open his duster -- flashing them -- revealing \nthat he has nothing on beneath except his boots and a pair of bright \norange boxer shorts that say \"HAPPY HALLOWEEN.\"\n\nThe kids go insane.\n\n<b>ANGLE ON LOOMIS\n</b>\nMaking his way through the teeming crowd.  Walkie-talkie in hand.  \nThe helicopter zooms overhead.  Wynn's voice squawks over garbled \nRADIO CHATTER.  Conducting a surveillance by air.\n<b>\t\t\n</b><b>\t\tWYNN (V.O.)\n</b>\t   (filtered)\n\tThere's more people moving eastbound down Old \n\tReservoir Road past the elementary school.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (into walkie-talkie)\n\tAny word on the location of the Strodes?\n<b>\t\t\n</b><b>\t\tWYNN (V.O.)\n</b>\tNo one's home.  Checked it out myself.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tGood.  I want around-the-clock surveillance on \n\tthat house.\n\nSuddenly Loomis is waylaid by a giant wall of a man -- Sheriff \nHoldt.  Loomis meets his fiery gaze.\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tI'm warning you, Loomis -- stay out of my way.  \n\tYou may have had free reign when Ben Meeker was \n\tsheriff, God rest his soul, but I'm in charge \n\tnow.  And I'm not about to stand by and watch \n\tyou turn this night into some kind of sadistic \n\twitch hunt.\n<b>\t\t\n</b><b>\t\tWYNN (V.O.)\n</b>\tSam, I just got word from the hospital. You'd \n\tbetter get over there right away.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (into walkie-talkie)\n\tWhat's wrong?  What's happened to Jamie?\n<b>\t\t\n</b><b>\t\tWYNN (V.O.)\n</b>\tI'll meet you over there.\n\nLoomis tears off.  Holdt stares brazenly, throwing down his \ncigarette.  Crushes it under his boot and slowly follows him.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. BLANKENSHIP HOUSE - LOBBY - NIGHT\n</b>\nCarrying the CRYING baby, Tommy leads Kara and Danny into the lobby \nof the vintage boarding home.  Polished wood.  Framed old \npaintings.  Wall-to-wall Tiffany lamps.\n\nMrs. Blankenship sits behind the front desk, oblivious to the \nGRINDING and SCREAMING on the television as \"The Texas Chain Saw \nMassacre\" reaches its horrific climax on the annual Horrorthon.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tQuiet around here tonight, huh, Mrs. B.?\n\nAs usual, the senile old woman doesn't reply.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (indignantly; to Tommy)\n\tDo you mind telling me what this is all about?  \n\tTim and Beth are waiting for us.\n\nTommy ushers Kara and Danny up the stairs.  Mrs. Blankenship stares \nat the boy -- the kind of stare that would send most kids running \nfor their moms.  But Danny is undaunted.\n\n<b>INT. TOMMY'S APARTMENT (CONTINUOUS)\n</b>\nThe door opens.  Kara is repulsed by the sight of Tommy's musty, \nunkempt apartment.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tMom, I want to go to the fair ...\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (to Tommy)\n\tYou can't expect us to stay here --\n\nTommy adjusts the blinds on the window looking out on the Myers \nhouse.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tI want you to watch your house.  You can see \n\teverything from this window.\n\nKara glares, reminded of last night.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDo you know how insane this is?  Who am I \n\tsupposed to be looking for?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tHim.\n\nTommy flashes a newspaper article in front of her.  One we've seen \neariler:  \"MICHAEL MYERS - DEAD OF ALIVE?\"\n\nThe baby's SCREAMS are verging on overload.  Tommy dashes to the \nrecessed kitchen area and heats up another bottle.\n\nAs Kara reads, Danny tugs at his mother's blouse.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tCome on, Mom.  We're gonna miss all the fun \n\tstuff!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (snapping)\n\tDanny, you're just going to have to wait!\n\nDanny plods off.  Kara hands Tommy a nipple for the bottle.  Their \neyes lock for a beat.  He takes it.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tShhh.  It's okay, Kyle.  Just give me one \n\tmore -- \n\t   (the microwave BEEPS)\n\t-- second.  There you go, big guy.\n\nKara looks on as Tommy attempts to feed the baby.  Despite his \nclumsiness, she's undeniably moved.\n\nBehind them, Danny's imagination kicks into high gear as he drives a \nPower Ranger over an invisible race track.  On the floor.  Across \nthe windowsill.  Glancing across the street.\n\n<b>DANNY'S P.O.V. - THE MYERS HOUSE\n</b>\nStanding below on the front lawn is the Shape, silhouetted under a \nmoonlit tree.  Looking right at Danny.\n\n<b>BACK TO SCENE\n</b>\nDanny backs away, terrified.  Tommy and Kara are too concerned with \nthe baby to notice.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tGod, what's wrong with him?\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tHere.  Let me try.\n\nTommy gingerly hands the baby over to her.  Instantaneously, Kyle's \nCRIES subside.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing; fawning)\n\tThere.  All it takes is a mother's touch.\n\nFor one fleeting moment, Tommy and Kara find themselves smiling at \none another.  Unaware as Danny glides silently out the door.  \nTommy's expression darkens once again.  A man possessed.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tKyle's mother might be dead for all I know.  \n\tNow I'm afraid he could be next.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWhy would anyone want to kill an innocent baby?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tNot just Kyle.  All of you.  His entire family. \n\t   (reaching toward Kyle)\n\tHere.  Look at this.\n\nTommy opens the baby's quilt, revealing the blood mark smeared over \nhis torso.  Kara's face registers terrified recognition.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (continuing)\n\tIt was there when I found him this morning.  It \n\tlooks like some kind of letter or number or --\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tIt's a rune ... Thorn.\n<b>\t\t\t\n</b><b>\t\t\tCUT TO:\n</b>\n<b>INT. JAMIE'S HOSPITAL ROOM / HALLWAY - NIGHT\n</b>\nPOLICE on the scene.  A crying NURSE gives a statement.  A CRIME \nSCENE PHOTOGRAPHER snapps photographs as Jamie's bloody corpse is \ncovered over with a white sheet.\n\nLoomis stands frozen in horror.  Tears in his eyes.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tJamie ... I failed you again.  I never should \n\thave left you.\n\nHe spins, pouncing on Sheriff Holdt.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (continuing)\n\tNow will you do something?!  How many more \n\tinnocent people have to die?!\n\nWynn restrains him.  Pulls him away.  The sheriff doesn't budge.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tDon't do this to yourself, Sam.  Let's go.  \n\tCome on.\n\nWynn ushers Loomis out of the room.  Holdt stares apathetically.\n\n<b>HALLWAY (CONTINUOUS)\n</b>\nWynn tries to calm Loomis down.  Jamie's doctor approaches.\n<b>\t\t\n</b><b>\t\tDR. BONHAM\n</b>\tDr. Loomis?\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tWhat is it?\n<b>\t\t\n</b><b>\t\tDR. BONHAM\n</b>\tI'm very sorry ...\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tYou let it get to her.  How could you?\n<b>\t\t\n</b><b>\t\tDR. BONHAM\n</b>\tDr. Loomis, there's something else you should \n\tknow.  During surgery, we discovered that \n\tJamie's uterus was hemorrhaging.  We found \n\tthis. \n\t   (displays a small vital)\n\tIt's placental fluid.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tGod in heaven.  You don't tell me she was --\n<b>\t\t\n</b><b>\t\tDR. BONHAM\n</b>\tI estimate she gave birth no more than a few \n\thours before the attack.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tThen where's her baby?\n\nJamie's covered body is wheeled out past them.  Loomis regards Wynn \nwith a look of abject fear.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI think I may already know ...\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. TOMMY'S APARTMENT (SAME)\n</b>\nCLOSE ON a chapter heading.  \"Thorn - The Devil's Rune.\"  Beneath \nit, a bold depiction of the familiar Thorn triangle.\n\nPULL BACK to REVEAL Tommy poring over the old library book.  Kara \npaces, rocking the baby, feeding him with the bottle.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tRunes were a kind of early alphabet that \n\toriginated in Northern Europe thousands of \n\tyears ago.  They were symbols -- carved out of \n\tstone or pieces of wood.  Of all the runes, \n\tThorn had the most negative influence. Cults \n\tused them in blood rituals to portend future \n\tevents and invoke magic.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tBlack magic ... \n\t   (reads)\n\t'In ancient times, Thorn was believed to cause \n\tsickness, famine and death. Translated \n\tliterally, it was the name of a demon spirit \n\tthat delivered human sacrifices ... on the \n\tCeltic celebration of Samhain.'\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tHalloween.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t'When applied directly to another person, Thorn \n\tcould be used to call upon them confusion and \n\tdestruction -- to literally visit them with the \n\tDevil.'\n\nTommy jumps up, frantically moving around the apartment, collecting \nhis jacket, his keys -- a gun.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (terrified)\n\tWhere are you going?\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tTo find the rest of your family before Michael \n\tMyers does -- or whoever's been controlling \n\thim.\n\nAn ominous CLICK as Tommy loads a cartridge into his gun.  He bolts \ntoward the door.  Finds it standing wide open.  Kara freezes, \nnoticing for the first time that Danny is missing.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tOh, God -- Where's Danny? Kara flies down the \n\thall, the baby in her arms.  Tommy moves out \n\tright behind her.\n\n<b>INT. BLANKENSHIP HOUSE - LOBBY (CONTINUOUS)\n</b>\nKara and Tommy barrel downstairs, searching frantically.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny?!  Danny!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tMrs. Blankenship, have you seen the little boy \n\twho came in with me and --\n\nThey find Mrs. Blankenship and Danny sitting side by side, watching \nthe Horrorthon.  A bowl of popcorn between them.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (grabs him)\n\tDanny, don't ever walk off without telling me \n\twhere you're going!\n\nDanny looks at her.  A blank, hollow stare.  The old woman's eyes \nglitter madly.\n<b>\t\t\n</b><b>\t\tMRS. BLANKENSHIP\n</b>\tThe voice.  He hears the voice.  Just like the \n\tother little boy who used to live in that \n\thouse.\n\nTommy throws on his jacket and opens the front door.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tTake the kids upstairs, lock the door and wait \n\tfor me. \n\t   (beat)\n\tAnd Kara, whatever you do -- don't go back to \n\tyour house.\n\nKara watches fearfully as Tommy heads out the door.  Leaving her \nalone with the children.\n\n<b>EXT. HOUSES / STREET - NIGHT\n</b>\nWind MOANS.  Dead leaves blow across the WINDY lane as Tommy flies \ndown the path of the Blankenship house and hops into his Explorer.  \nThe Shape suddenly RISES INTO FRAME.  Watching him peel off down the \nblock.  Taillights disappearing.\n\nA moment later, another car rambles up the street, swerving \nerratically into the driveway of the Myers house.\n\nThe Shape watches.\n\n<b>INT. GARAGE - NIGHT (CONTINUOUS)\n</b>\nThe car parks.  Sits in silence.  Suddenly the driver's side door \nopens, emblazoned with the \"Strode Realty\" emblem.\n\nJohn spills out, collar unbuttoned, tie dangling.  Picking himself \nup, he staggers out of the garage.  Laughing.  Singing.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t... Pretty woman, walking down the street ... \n\tPretty woman, the kind I'd like to meet.\n\n<b>EXT. MYERS HOUSE (CONTINUOUS)\n</b>\nFOLLOW John's circuitous route across the front lawn, stumbling over \none of Danny's toys on his way up the porch steps.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tDamn kid ... this is my house ...\n\nJohn fumbles wth his key, estimates the location of the lock.  He \nturns the knob -- but the door's jammed.  Chain-locked.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (continuing)\n\tWhat the fuck ... \n\t   (yelling inside)\n\t... Debra, open this goddamn door before I \n\tbreak it down!  You got to three ... \n\t   (no response)\n\t... One ... Two ... \n\t   (still no response)\n\t... Two and a half ...\n\nJohn slams his weight against the door.  It doesn't budge.\n\nGrumbling, John totters off the porch, trying to hold himself \nsteady.  Skirting along the side of the house.\n\n<b>INT. MYERS HOUSE - KITCHEN (CONTINUOUS)\n</b>\nJohn sways in through the back door and flicks on a light.  Strains \nfor lucidity.  No one in the kitchen.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tDebra -- I'm home!\n\nNo answer.  John shrugs and moves to the stove.  Opens the lid on a \npasta cooker.  Nothing inside.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (continuing; mutters)\n\tWork all day and not even any supper ...\n\nFrustrated, John opens the freezer and removes a frozen dinner.  \nTears open the box and pops it in the microwave.  Then he flounders \ndown the dark alley, knocking picture frames awry.\n\n<b>LIVING ROOM / FOYER\n</b>\nDarkness, save for a glowing jack-o'-lantern.  John stands there, \nlisting.  Bewildered.\n\nThen he switches on a lamp, kicks off his shoes and crashes onto his \nlumpy old recliner.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tAll right ... You can all come out now ...\n\nStill no reply.  John sneers, flicks on the television with the \nremote control and settles back into his chair.\n\n<b>INSERT - TELEVISION\n</b>\nA scene from another horror movie.  A boy shreds his pumpkin mask as \na mass of beetles and snakes pour out of his skull.\n\n<b>BACK TO SCENE\n</b><b>\t\t\n</b><b>\t\tJOHN\n</b>\tWhat is this shit?\n\nDisgusted, he switches channels to the local NEWS.  A shrill BEEP \nfrom the kitchen startles him.  The microwave.\n\n<b>KITCHEN\n</b>\nJohn waddles to a drawer and removes a set of utensils.  Then he \nreaches for the microwave, opens it.  But his dinner is gone.\n\nSpinning around, he sees the piping hot entree already sitting out \non the kitchen table.  John double-takes, mentally retracing his \nsteps.  Shrugs.\n\n<b>FOLLOW JOHN\n</b>\nas he picks up his tray and plods back down the hall.  Suddenly he \ntrips over something -- the suitcase Debra had packed earlier, \nsitting smack-dead in the center of the hall.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tSo this is the game you wanna play. Fine.  Go \n\tahead.  Keep it up all night ...\n\n<b>LIVING ROOM\n</b>\nJohn settles back into his chair and begins to eat ravenously.  \nSCREAMS from the television.  He reacts.\n\n<b>INSERT - TELEVISION\n</b>\nSomeone has switched it back to the horror movie.  A \nCOMPUTER-GENERATED PUMPKIN causes more masked heads to EXPLODE.\n\n<b>BACK TO SCENE\n</b>\nJohn shakes the remote.  Out of the corner of his eye, he catches a \nshadowy figure darting by in the darkened foyer.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tIs that you, you little brat?  Danny?!\n\nJohn rises, about to go for him when suddenly the power cuts out -- \nand the entire house is plunged into blackness.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (continuing)\n\tWhen I get my hands on you, kid, you're gonna \n\twish you were never born!\n\nJohn pulls a rechargeable flashlight from the wall and goes to the \ncellar door.  It stands open.  An invitation to enter.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\t   (continuing)\n\tOh, I'm scared.  I'm really scared.\n\nWith that, John steps down into the basement.\n\n<b>INT. CELLAR (CONTINUOUS)\n</b>\nJohn tentatively descends the stairs.  Barefoot.  The flashlight \nbeam preceding his every step.  A RUMBLING below.\n\nThe cellar is lit only by a shaft of moonlight cutting through the \nsingle dusty window.  John probes around, shining the flashlight \nover cobwebs, boxes -- the puddle of water at his feet.  Now \nflooding the entire floor.\n\nJohn SLOSHES through the water toward the washing machine -- which \nis running at full tact.\n<b>\t\t\n</b><b>\t\tJOHN\n</b>\tWhat the hell --\n\nHe opens the washer lid and lifts out a water-logged sheet.  It \ndrips red onto the white appliance -- blood.\n\nJohn backs away, loses his footing, and slips in the water -- \nlanding right at the Shape's feet.  John SCREAMS as the Shape grabs \nhim by the neck, lifts him off the floor with one hand, then carries \nhim across the basement and SLAMS him brutally against the open fuse \nbox.\n\nThe Shape's free hand lifts an enormous butcher knife.  A loud WHAP \nas it's driven to the hilt into John's chest, through the fuse box.  \nSparks wain from the wall.  Electricity courses through John's \nwriting body.\n\n<b>EXT. MYERS HOUSE (SAME)\n</b>\nLights flash on and off in the windows.  Suddenly the entire house \nis plunged into darkness.\n\n<b>INT. MYERS HOUSE - CELLAR (SAME)\n</b>\nJohn's toes curl.  The skin around where the knife penetrates \nFRIES.  The Shape steps back, head tilted, BREATHING steadily, \ncuriously observing John's hanging, lifeless body.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. HARVEST FAIR - NIGHT\n</b>\nTommy grabs the ticket he's just paid for, hands it to an ATTENDANT \nand moves through the turnstiles amid a steady stream of REVELLERS.\n\nLoud MUSIC, the aroma of apple cider and pumpkin pie fills the air.  \nBoots selling food and crafts.  Children carving jack-o'-lanterns.  \nParents beaming with pride.\n\nTrendy co-eds playing games.  Ducking for apples.  Shooting \npumpkin-faced balloons with water pistols.\n\n<b>EXT. LIBRARY STEPS\n</b>\nTim and Beth sit on either side of Harry as he interviews them \nduring a live BROADCAST.  A large crowd gathered below.\n<b>\t\t\n</b><b>\t\tHARRY SIMMS\n</b>\t   (into mike)\n\tI'm here with Tim and Beth -- the organizers of \n\ttonight's event.  How does it feel knowing \n\tyou've finally pulled Halloween out of the \n\tcloset?\n<b>\t\t\n</b><b>\t\tTIM\n</b>\t   (into mike)\n\tYo, Harry, it's great!  And having you here \n\twith us is dope.  Totally raw. You're the \n\tultimate juice!\n<b>\t\t\n</b><b>\t\tHARRY SIMMS\n</b>\tI'll remember that the next time my wife tells \n\tme I didn't make her climax.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (impassioned)\n\tWhat Tim means is that we've taken a firm stand \n\tagainst censorship.  Not only for Haddonfield, \n\tbut for every town in the nation.  Our \n\tgeneration will not let the powers-that-be \n\tcontrol our minds, dictate what clothes we \n\twear, what music we listen to, or what holidays \n\twe celebrate.\n\nBeth's rousing speech is met by gales of enthusiastic CHEERS.\n<b>\t\t\n</b><b>\t\tHARRY\n</b>\t   (off-handedly)\n\tHave you ever considered running for public \n\toffice?\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. HADDONFIELD STREETS - VARIOUS SHOTS - NIGHT\n</b>\nThe distant SOUNDS of the celebration are carried on the wings of \nthe WIND.  Howling through dark, empty streets.  Rows of deserted \nhouses.  Not a soul in sight.  Preternatural stillness.\n\n<b>INT. BLANKENSHIP HOUSE - NIGHT\n</b>\nKara looks nervously out a window, then walks into the parlor where \nshe finds Danny sitting in the dark, glued to the Horrorthon.  \nFlames CRACKLE in the fireplace, casting weird shadows.\n\nMrs. Blankenship sits in a wooden rocker, cradling the infant, \nhumming a lullaby.\n\nIf we look closely enough, behind her in the window we can see the \nhazy shadow of the Shape looking in.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMrs. Blankenship, what did you mean about the \n\tlittle boy who used to live across the street?\n\nThe old woman doesn't seem to hear her.  Lost in her own world.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing; insistent)\n\tMrs. Blankenship, please.  This is important!\n\nMrs. Blankenship looks up sharply, startling Kara.\n<b>\t\t\n</b><b>\t\tMRS. BLANKENSHIP\n</b>\tHe heard the voice.  Same as your boy hears.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWhat voice?  What are you talking about?\n<b>\t\t\n</b><b>\t\tMRS. BLANKENSHIP\n</b>\tThe voice that spoke to Michael Myers. The one \n\tthat told him to kill his family.\n\nKara stares at her, numbed.  She gazes over at Danny, his eyes \nriveted  -- not to the TV screen.  Looking past it.  Across the \nstreet at the Myers house.  The haunting VOICE whispers to him.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (V.O.)\n</b>\tI'm coming for you, Danny ... I'm coming.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. HARVEST FAIR - NIGHT\n</b>\nTim and Beth ride high atop the Ferris wheel.  Their smiling faces \naglow in a dizzying whirlwind of LIGHTS.  DARK CLOUDS are gathering \nin the sky, covering the moon and stars.  A light RAIN begins to \nfall.\n\n<b>ANGLE ON TOMMY\n</b>\nWalking, searching, hunting.  Past a large tent where children are \ngathering.  A sign reads:  COSTUME PAGEANT.\n\nTommy reacts to a terrified SCREAM.  Just a couple of teenage BOYS \npulling an innocuously fightened GIRL onto another ride.\n\n<b>THE STRANGER\n</b>\nwalks steadily past the bright lights of the Ferris wheel.\n\n<b>TOMMY\n</b>\npushes through a dense crowd.  Suddenly he bumps shoulders with the \nStranger.  More people pass.  There was something very sinister \nabout that man.\n\nTommy turns to look again, eyes widening in terror.\n\n<b>TOMMY'S P.O.V. - STRANGER'S WRIST\n</b>\nBranded with the mark of Thorn!\n\n<b>TOMMY\n</b>\nremoves his gun.  Flows through the crowd like a vengeful wraith.\n\nPeople see the gun in his hand and back away.  Tommy surges \nforward.  The Stranger walks faster.  Gaining ground.  Toward the \nHalloween tree.\n\nWORKERS hauling wheelbarrows loaded with jack-o'-lanterns cross his \npath.  Tommy stumbles, pumpkins spilling out all around him.\n\nThe Stranger is getting away!  Tommy picks himself up, raises the \ngun and begins FIRING shots into the air.  People SCREAM, scattering \nlike insects, ducking for cover.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tStop that man!  Stop him!!!\n\nTommy races through the horrified crowd.  The Stranger keeps moving, \nnever once looking back.\n\nSuddenly SIRENS.  Squad cars converge.  Sheriff Holdt and a slew of \nOFFICERS surround Tommy.  Weapons trained.\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tThrow down the gun!  Now!!!\n\nTommy drops the gun.  Puts his arms up in surrender.  The cops swarm \nin, taking him.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tStop that man!  He's the one!\n\n<b>ANGLE ON FERRIS WHEEL\n</b>\nBeth and Tim exit the ride and follow the crowd toward the flashing \nLIGHTS of the police cruisers.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tWho's gettin' busted?\n\nBeth is stunned to see Tommy being searched spread-eagle over the \nsheriff's car.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tJesus, that's my neighbor.  Tommy.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tIsn't he that psycho who's been spying on my \n\tsister?\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (worried)\n\tKara and Danny never showed up tonight. We'd \n\tbetter go home and check on them. There's \n\tnothing else for us to do here.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tBut they're gonna light the tree in a few \n\tminutes --\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (suggestively)\n\tWe can light our own tree at home.\n\nShe brushes against Tim's crotch and saunters away.  Tim glances \nback at Tommy, then follows her like a hungry puppy.\n<b>\t\t\t\n</b><b>\t\t\tCUT TO:\n</b>\n<b>INT. BLANKENSHIP HOUSE - TOMMY'S APARTMENT - NIGHT\n</b>\nKara rushes Danny and the baby inside.  The old spinster close at \nher heels.  Releasing her dark secret.\n<b>\t\t\n</b><b>\t\tMRS. BLANKENSHIP\n</b>\tI was baby-sitting for him that night. Little \n\tMikey Myers from across the street.  That's \n\twhen the voice told him what to do.  Same as \n\this great- grandfather.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tHis what?!\n<b>\t\t\n</b><b>\t\tMRS. BLANKENSHIP\n</b>\tEighteen-ninety-five.  A hundred years ago to \n\tthis night.  All Hallows Eve. Murdered his \n\tfamily in that very same house.  Then the \n\ttownspeople burned him alive.  Our mother \n\talways told us when we were children, 'Don't go \n\tnear the Myers house.'  We never did.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>EXT. HARVEST FAIR - NIGHT (SAME)\n</b>\nThe Stranger glides unnoticed among a large crowd gathered for the \nlighting of the Halloween tree.  People putting up umbrellas.  A \nSTORM fast approaching.\n\nHundreds of anxious kids stand beneath the oak tree with open bags \nand pillow cases, waiting for the candy to drop on them.\n\n<b>STALKING P.O.V\n</b>\nMOVING behind the tree where a long-haired figure stands in the \ndarkness.  Waiting to make a presentation.\n\n<b>HARRY\n</b>\nturns, sensing a presence.  A knife shoots out of the darkness, \njabbing him right between the legs.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>TOMMY\n</b>\nis shoved into the back of the squad car.  Suddenly Loomis appears.  \nPrevailing upon the sheriff.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tWait!  This boy is being placed in my custody.\n\nTommy looks out, stunned.\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tWhat are you trying to pull now, Loomis?\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tUncuff him!  This is a matter of life or death.\n<b>\t\t\t\n</b><b>\t\t\t     SHOCK CUT TO:\n</b>\n<b>HARRY\n</b>\nThe knife is lifted straight up, splitting his torso in two, eyes \nbugging with shock.  He slumps to the ground in a huge pool of \nblood.\n<b>\t\t\t\n</b><b>\t\t\t     CUT BACK TO:\n</b>\n<b>TOMMY AND LOOMIS\n</b>\nThe sheriff uncuffs Tommy and shoves him out of the car.\n<b>\t\t\n</b><b>\t\tHOLDT\n</b>\tYou'd better as fuck have an explanation for \n\tthis, Doctor.\n\nLoomis begins to usher Tommy through the gaping crowd.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tDr. Loomis, there's something you should \n\tknow --\n\nTommy is prodded forward by Loomis's .357.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tI know enough already.  Just shut your mouth \n\tand take me to that baby.\n\nThey move swiftly through the gaping crowd.\n\n<b>ANGLE ON TREE\n</b>\nA growing murmur of concern spreads.  \"Where's Harry?\"  The children are \nbecoming impatient, and the impending STORM isn't doing much to calm \nanyone's nerves.  Harry's people are at a loss to explain their star's \nwhereabouts.\n\n<b>ANGLE ON LOOMIS AND TOMMY\n</b>\nOn the fringes of the crowd.  Walking away.\n\n\"Oohs\" and \"ahhs\" as the tree suddenly comes to life with thousands of \norange lights.  From the boughs of the tree, ropes are pulled.  Bunting \ntears open, dropping hails of CANDY on the SHRIEKING kids.\n\nTommy glances back.  His eyes drawn to something.  Grotesque and misshapen.  In the \ntree.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tOh my God --\n\n<b>ANGLE ON TREE\n</b>\nKids of all ages scurry around the stage, laughing and screaming as a \nrainbow of candy RAINS down on them.  Diving for it.  Fighting over it.  \nScooping it up in big handfuls.\n\n<b>ANGLE ON TOMMY AND LOOMIS\n</b>\nTommy instantly breaks away and tears back through the crowd.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tTommy!\n\nLoomis goes for him.  Sheriff Holdt sees what is happening and \nflies toward them in pursuit.\n\n<b>ANGLE ON TREE\n</b>\nA BALLERINA looks down at her white pillow case in horrified \nastonishment.  Her hands painted red as she reaches inside.  All \nof her candy is covered with blood!\n\nThe other kids back away in revulsion -- the entire stage begins \nto drip with blood!\n\nThe adults don't seem to notice what is happening, more concerned \nwith the sudden burst of POURING RAIN.\n\nTommy pushes his way through the crowd, SCREAMING.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tGet them out of there!  Get out!!!\n\nSheriff Holdt tries to intercept Tommy just as he leaps up onto \nthe stage, pushing kids out of the way.\n\nParents' faces register shock when they see their children running \ntoward them, SCREAMING hysterically, soaked with blood.\n\nLoomis sees what Tommy sees.  Words cannot convey the horror in his \neyes.\n\nJust then, a BOLT OF LIGHTNING ignites the tree.  SPARKS flash.  \nTiny pumpkin lights EXPLODE in a startling chain reaction.\n\nTommy helps the last of the kids off the stage when something falls \nfrom the gnarled branches:  a dangling, rotating, wrapped-up thing.  \nThe mutilated remains of Harry Simms!\n\nHorrified, Tommy dashes headlong off the stage.  Runs with Loomis \nwith the trampling crowd.\n\nStruck dumb with terror, Holdt looks out upon the mass destruction.  \nThe bloody corpse hanging from the tree.  People running, SCREAMING, \ncarrying their children toward the exits.\n\n<b>EXT. CAMPUS PARKING LOT (SAME)\n</b>\nBumper to bumper cars.  Horns BLARING.  Women SCREAMING.  Men SHOUTING.  \nChildren CRYING.  Pandemonium.\n\nLoomis and Tommy appear out of this jumble of confusion.  More people \nrunning along the sidewalks.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tOh, God -- Kara!!!\n\nA car SCREECHES to a halt as Tommy barrels across the street.  Loomis \nright behind him.  Running toward home.\n\nOnce again, terror reigns in Haddonfield, Illinois.\n<b>\t\t\t\n</b><b>\t\t\t     CUT TO:\n</b>\n<b>INT. BLANKENSHIP HOUSE - TOMMY'S APARTMENT - NIGHT\n</b>\nKara shivers as she curls up beside Danny on the futon, holding the \nsleeping baby close at her bosom.  THUNDER rattles the old house.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tMommy, I'm scared.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tThere's nothing to be scared of, baby. It's just another \n\tstorm.  Try to get some sleep.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tI can't.  The voice man is coming to get me.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tNo one's coming to get you.  Not while I'm around.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tPromise?\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (kisses him)\n\tI promise.\n\nKara stands up and goes to the window, looking out into the \npouring RAIN.\n\n<b>KARA'S P.O.V. - THE MYERS HOUSE\n</b>\nDark and foreboding.  LIGHTNING FLASHES.  Beth's car parked in \nfront.\n\n<b>ANGLE ON KARA\n</b>\nShe stares at the car, puzzled.  Quickly she moves away from the \nwindow, heads out the door.\n\n<b>HALLWAY\n</b>\nShe KNOCKS loudly on the door across the hall.  A sign that reads:  \n\"Beth's Place.\"\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tBeth, are you in there?\n\nShe knocks again.  No response.  Another CLAP OF THUNDER.  Kara \nshudders, quickly returns to Tommy's apartment and locks the door.\n\n<b>INT. MYERS HOUSE - FOYER (CONTINUOUS)\n</b>\nSounds of PASSION as we FOLLOW a trail of hastily-discarded costume \npieces across the darkened foyer.  Tim and Beth are on the stairs, \nhalf-naked, kissing fervently.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (coming up for air)\n\tGuess they -- went to the fair after all.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\t   (hot and heavy)\n\tGuess so ...\n\nTim nuzzles his face in Beth's chest.  She's feeling apprehensive.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tWhat if your parents come home?\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tThen they can watch.\n\nLaughing, they heard up the stairs, kissing, fondling each other.  \nSlowly we PULL BACK into the foyer.  THUNDER and LIGHTNING CLASH, \nrevealing the Shape, knife held at ready.  Watching.\n\n<b>INT. TOMMY'S APARTMENT (SAME)\n</b>\nShe picks up the cordless phone, switches on and dials her home \nnumber.  We HEAR the phone RINGING on the other end.\n\n<b>INT. MYERS HOUSE - KARA'S BEDROOM - NIGHT\n</b>\nBeth collapses with Tim onto Kara's bed.  The PHONE RINGS.  Tim \nignores it, consumed by passion.  Beth sits up nervously.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tAren't you gonna answer that?\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tAnswer what?\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (fends him off)\n\tWhat if it's Kara?\n\nFrustrated, Tim jumps off the bed and stomps into the bathroom, \ntaking a candle with him.\n<b>\t\t\n</b><b>\t\tTIM\n</b>\tFine.  You answer it.  I'll make friends with my soap on a \n\trope.\n\nTim slams the door.  Beth deliberates her move, then goes to pick \nup the phone.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\t   (into phone)\n\tHello?\n\n<b>INT. TOMMY'S APARTMENT\n</b>\nKara is frantic.  Looking out the window at the Myers house.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (into phone)\n\tMom -- Who is this?\n<b>\t\t\n</b><b>\t\tBETH (V.O.)\n</b>\tKara? ... No, this is Beth.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWhat are you doing there?  Where's my mother?\n\n<b>INT. MYERS HOUSE - KARA'S BEDROOM (SAME)\n</b><b>\t\t\n</b><b>\t\tBETH\n</b>\tWe were worried about you guys so we left early to see if \n\tyou were --\n<b>\t\t\n</b><b>\t\tKARA (V.O.)\n</b>\tIs Tim there?\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tHe's in the bathroom.\n\n<b>BATHROOM - SHOWER (CONTINUOUS)\n</b>\nA lighted candle flickers.  Tim waits for the running shower to \nwarm up as he does a bare-ass jig over to the sink.\n\nRinsing off his tooth brush, he elbows out a circle of steam from \nthe mirror.  He gasps.  The Shape is standing right behind him!\n\nBefore he can react, Tim's head is yanked backwards.  The chilling \nSNAP of his neck is punctuated by a CRASH OF THUNDER.\n\n<b>INT. TOMMY'S APARTMENT\n</b>\nKara can SEE Beth on the phone.  Sitting by the window.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tI'm across the street.  I can see you. Beth, I want you to \n\tlisten to me.  Get Tim and get out of that house.  Right \n\tnow.\n\nUnnoticed by Kara, Danny rises and crosses the room.  Drawn toward \nthe door by the irascible voice.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (V.O.)\n</b>\tCome to me, Danny ... Come to me.\n\n<b>INT. MYERS HOUSE - KARA'S BEDROOM\n</b>\nBeth shifts nervously, looking out across the way at Kara.\n\nTHUNDER drowns out the sound of the bathroom door CREAKING open.  The \nShape advances.\n<b>\t\t\n</b><b>\t\tBETH\n</b>\tKara, what the hell is going on?\n\n<b>INT. TOMMY'S APARTMENT\n</b>\nKara's mouth suddenly drops open.  Her mind snaps into sensory overload.  \nShe can see the Shape walking up behind Beth!  Raising a gleaming \nbutcher knife!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tBeth, look out!  There's someone in the room!  He's right \n\tbehind you!\n\n<b>INT. MYERS HOUSE - KARA'S BEDROOM\n</b>\nBeth drops the phone, eyes bulging as the Shape plunges the knife \ninto her back.  She falls, CRASHING against the vanity.\n\nBeth SCREAMS unholy terror.  But the Shape isn't through.\n\n<b>INT. TOMMY'S APARTMENT\n</b>\nKara stands frozen in pure horror, hearing and seeing her friend's \nvicious murder.\n\nHer eyes shoot down.  A little blond-haired boy is walking steadily \nacross the street toward the Myers house.\n\nNo, it can't be true.  Kara wheels around.  Danny is gone.\n\n<b>INT. MYERS HOUSE - KARA'S BEDROOM - ANGLE THROUGH WINDOW\n</b>\nDanny can be seen below walking toward the house as Beth's \nblood-gurgling SCREAMS fill the room.  The knife repeatedly, \nmercilessly SLASHING down at her.\n\n<b>EXT. STREET / MYERS HOUSE - NIGHT\n</b>\nKara bolts out of the Blankenship house and races across the street, \nchasing after Danny through RAIN and LIGHTNING.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, no!!!\n\n<b>KARA'S P.O.V. - FOLLOWING DANNY\n</b>\nHe glides up the porch steps and slips through the front door of the \nMyers house.  Disappearing inside.\n\n<b>KARA\n</b>\nshoots across the lawn.  Up the porch steps.  Right behind him.\n\n<b>INT. MYERS HOUSE - FOYER\n</b>\nKara dives through the front door.  THUNDER shatters the house.  \nEverything is frighteningly dark.  Shockingly quiet.\n\nInch by inch, she makes her way inside.  Eyes wide.  Savage.  \nShaking uncontrollably.  A CRASHING SOUND behind her.  She jumps out \nof her skin.  Just the door SLAMMING shut in the WIND.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (the faintest whisper)\n\tDanny?\n\nShe advances into the hall.  Old floorboards CREAK beneath her feet.  \nSOUNDS up ahead.  FOOTSTEPS.\n\nKara looks up.  LIGHTNING FLASHES.  Danny is nearing the top of the \nstairs!\n\nInstinct propels her up the stairs after him.  Then suddenly she stops \ndead.  Reason taking over.  And she turns back.\n\nPicks up a fireplace poker sitting in the corner.  Then she heads back \nup the stairs.  Mind-blown with horror.\n\n<b>UPSTAIRS HALLWAY\n</b>\nKara reaches the top of the staircase, looking down the dark hallway.  \nSummoning all of her courage, she moves forward.\n\nSuddenly Danny darts out from the adjacent hall and disappears inside \nhis bedroom -- a fleeting, ghostly image.  Kara startles.  Follows him \ninside.\n\n<b>DANNY'S BEDROOM\n</b>\nDanny stands in a corner.  LIGHTNING illuminates his toy dinosaurs.  \nKara goes to him, takes his hand.  He resists her.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (intense whisper)\n\tCome on ... Danny, please.\n\nShe picks him up, carries him toward the door.  LUMBERING FOOTSTEPS.  \nKara stands paralyzed in the doorway as the Shape stalks down the hall.  \nEyes probing.  Walking right past them.\n\n<b>DANNY'S BEDROOM\n</b>\nKara slips silently back into the room, carrying Danny through the \nbathroom.  Adjoining on the opposite side into\n\n<b>KARA'S ROOM\n</b>\nLIGHTNING CRACKLES.  The walls are covered with blood.  Kara stumbles \nover something on the floor.  Cranes her neck to look down.\n\nBeth's bloody, mangled remains at her feet.\n\nShock waves send Kara reeling backwards against the open bathroom door.  \nHanging on a hook is Tim's naked body, eyes open, staring at her in a \nhorrified rictus of death.\n\nKara SCREAMS.  Drops Danny.  Quickly covers her mouth.  Realizing that \nshe's given them away.\n\nSuddenly the bedroom door tears open, buckling off its hinges.  The \nShape bulldozes in, wielding its huge butcher knife!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, run!!!\n\nDanny ducks into the hall, evading the Shape's lurching hands.\n\n<b>DANNY\n</b>\ncareens down the stairs.  THUNDER RAGES.\n\n<b>KARA\n</b>\nbrandishes the fireplace poker at the killer.  The Shape moves in, \nbacking her through the bathroom ... into Danny's room.  Suddenly \nshe SLAMS the door on the Shape.\n\nKara tears off into the hallway.  Turns.  Waiting for the Shape to \nappear.  It doesn't.\n\nKara vacillates down the hall.  Jumping at every sound.  Training her \nweapon at things unseen.  SLAMMING doors along the way, sealing off \nevery passageway as she tries to find her way through the impenetrable \ndark tunnel.\n\nSuddenly something CRASHES down from above.  Kara's mother, strung up on \na bloody sheet, dangling upside-down from the trap door in the ceiling! \nThe axe still protruding from her chest.\n\n<b>ANOTHER ANGLE\n</b>\nKara SCREAMS, shrinking away from the gruesome sight, faltering through \nthe blackened doorway behind her.  An unbearable moment of tension as we \nthink the Shape's mask will be there.\n\nSuddenly the Shape shoots up directly in front of her!  Tearing the \ndangling corpse from the sheet, dislodging the axe from Debra's chest \nwith a repulsive SQUISH.\n\nKara wheels toward the stairs.  The Shape advances.  Swings the axe.  \nMisses her by inches.  Kara ducks, lurches behind the Shape.  Swings \nthe fireplace poker with everything she's got.  CRACKING it full-force \nover the back of the Shape's head.\n\nThe Shape breaks through the banister and plunges off the landing, \nSLAMMING hard onto the floor below.\n\nTerrified, Kara chances a look down.  The Shape doesn't move.\n\n<b>EXT. STREET / BLANKENSHIP HOUSE - NIGHT (SAME)\n</b>\nTommy's Explorer skids to a stop outside the boarding house.  Loomis and \nTommy fly up the front path.  Tommy glances back at the blackened Myers \nhouse for a moment, then follows Loomis inside.\n\n<b>INT. MYERS HOUSE - DOWNSTAIRS HALLWAY (SAME)\n</b>\nKara barrels off the stairs.  Moves cautiously past the Shape.  Sprawled \nface-up in the middle of the hall.\n\n<b>LIVING ROOM\n</b>\nKara searches for Danny, keeping her eyes trained on the Shape.  The \nlittle boy appears in the doorway directly across the hall.\n\nThe Shape lying in between them.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, come to Mommy.\n\nDanny shakes his head.  Too frightened to move.\n\n<b>HALLWAY / FOYER\n</b>\nEver so slowly, Kara moves toward the threshold.  Hefting the fireplace \npoker, she steps right over the Shape.\n\nInstantly she snatches Danny up in her arms.  Takes one step forward when \nsuddenly --\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tMommy!!!\n\nThe Shape springs up, twisting Kara's ankle.  She falls, splaying forward.  \nThe Shape claws at her leg.  Kara fights back, kicking herself free of the \nvice-like grip.\n\nScrambling to her feet, Kara rockets Danny through the foyer to the front \ndoor -- desperately trying to escape from this real-life house of horrors \n-- only to find that it is locked.\n\nThe Shape rises, gleaming butcher knife in hand.\n\nKara twists the deadbolt, but someone's secured the chain lock!  Too late \nto remove it.  The Shape is right behind them.\n\nOnly one way to go.  The cellar.  Kara shoves Danny through.\n\n<b>INT. CELLAR (CONTINUOUS)\n</b>\nKara and Danny clatter down the rickety stairs and SPLASH across the flooded \nbasement floor.\n\nA soul-shuddering POUNDING on the door above.\n\nKara ushers Danny toward the elevated window.\n\nThe cellar door EXPLODES, the Shape's hand breaking through, splintering \nthe wood as if it were paper.\n\nKara HEARS the Shape moving rapidly down the stairs.  Lifts Danny up the \nwall toward the window.  But it's not a wall -- it's John's electrocuted \nbody, propped inside a storage cabinet!\n\nDanny SHRIEKS, staring into John's lifeless eyes.  Kara pushes him up.  \nDanny reaches for the lock.  Just an inch away.\n\nKara can't lift him any higher.  The Shape is coming!\n\nDanny hoists himself up just enough to twist the lock.  He pushes the \nwindow open and clambers outside.\n\nKara scrambles up old pressboard shelves.  They break under her weight; \nshe topples back to the floor.\n\nThe Shape wades toward her.  Reaching up for the window.\n\n<b>EXT. MYERS HOUSE - BASEMENT WINDOW\n</b>\nDanny watches his mother struggle to climb out of the crypt.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, help me!\n\nKara's hand reaches toward him.  Danny makes no movement.\n<b>\t\t\n</b><b>\t\tWHISPERING VOICE (V.O.)\n</b>\tCome to me, Danny ... Come to me.\n\nDanny obediently turns and starts to walk away.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny!!!\n\n<b>INT. MYERS HOUSE - CELLAR\n</b>\nKara's foot falls on the handle of the knife jutting from her father's \nchest.  Uses it to springboard herself half-way through the window.  \nClawing at wet grass.\n\nThe Shape's hand shoots out of the darkness below, grabbing at her legs.  \nKara writhes, kicking and SCREAMING.\n\n<b>EXT. MYERS HOUSE - CELLAR WINDOW\n</b>\nKara grabs chunks of mud as she is pulled back through the window.  The \nShape yanks hard.  Kara catches herself on the window frame.  Quickly \nlosing her grip.\n\n<b>INT. MYERS HOUSE - CELLAR\n</b>\nThe knife swipes downward, swiping her ankle.\n\n<b>EXT. MYERS HOUSE - CELLAR WINDOW\n</b>\nKara reacts to the searing pain, releasing her grip on the window frame.  \nSuddenly Danny appears, locking onto her collar, pulling her clear in one \nmassive heave.\n\nKara shuffles across the ground and picks herself up.  Grabs Danny's hand \nand runs full-tilt around the side of the house.\n\n<b>EXT. STREET / BLANKENSHIP HOUSE\n</b>\nCAMERA FOLLOWS their frenzied flight across the street.  Past Tommy's \nExplorer.  Kara limping.  Danny surging toward the Blankenship house.  Kara \nSCREAMS, pounding frantically on the door.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tPlease!  Open the door!\n\n<b>INT. BLANKENSHIP HOUSE - TOMMY'S APARTMENT\n</b>\nTommy and Loomis have turned the apartment upside-down.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tThe baby -- where's the baby?!\n\nSuddenly they HEAR Kara's frantic pleas outside.  Tommy bolts out the door.\nLoomis right behind him.\n\n<b>EXT. BLANKENSHIP HOUSE (CONTINUOUS)\n</b>\nKara POUNDS furiously.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tPlease!  Somebody help us!\n\nDanny huddles beside her, peering out across the street.\n\n<b>DANNY'S P.O.V. - MYERS HOUSE\n</b>\nThe Shape trudges boldly down the porch steps -- knife in hand!\n\n<b>BACK TO SCENE\n</b>\nKara sees the Shape -- walking slowly and deliberately toward them.  Her \nSCREAMS become even more intense.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tHelp us please!!!\n\nThe Shape closes in.  At the last second, Tommy throws open the door.  Kara \nand Danny tumble inside.  Into his arms.\n\n<b>INT. BLANKENSHIP HOUSE - LOBBY / PARLOR (CONTINUOUS)\n</b>\nLoomis slams and deadbolts the door.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tGet them upstairs.  Now!\n\nKara pounds against Tommy's chest.  Hysterical.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWhere's the baby?!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tHe's gone.\n\nKara holds Danny close to her side, backing away in horror as Tommy and \nLoomis go around the parlor, securing the doors and windows.  THUNDER RIPS \nthrough the darkened room.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (continuing)\n\tWho else knew I had the baby?!\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tNo one.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tNo -- there had to be someone else. Who knew?!\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tOnly me -- \n\t   (dark realization)\n\t-- and Dr. Wynn.\n\nSuddenly the window behind Kara EXPLODES.  She SCREAMS, recoiling.  Then \nthe window in front of her.  HANDS reach through.  Tommy shoves her out of \nthe way.\n\nANOTHER HAND shoots through the stained glass window in the front door, \ntwists open the lock.\n\nDanny races across the lobby and up the stairs.\n\nRobed figures fill the doorways.  Climbing through windows.  Moving inside \nthe house.  Surrounding Loomis.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (continuing)\n\tWynn!!!\n\nThe robed figures descend on Loomis.  Drops his .357.  Tommy lurches for it, \nto no avail.  Loomis's SCREAM fills the darkness like a fever dream.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\t   (continuing)\n\tRun, Tommy!!!  Run!!!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tNo!!!\n\nTommy backpedals up the stairs.  Kara pulling him along as the cloaked \nfigures glow toward them.  Daggers raised.\n\n<b>UPSTAIRS HALLWAY\n</b>\nKara reacts to the SOUND of Danny's VOICE.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tMommy!  Please help me!\n\nKara rushes through darkness to find him.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny!  Danny, where are you?!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tKara, no!\n\nKara trips and falls.  A pair of silver-tipped black boots planted in \nbold stance.  Slowly she looks up the long duster, the cigarette in the \ngloved hand of the nefarious Stranger -- Dr. Wynn!  Danny stands by his \nside, staring dispassionately.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, no ... please ...\n\nKara picks herself up, shaking her head in unmitigated fear, staggering \nback down the hallway.\n\nShe turns to see the black figures overtaking Tommy.  His SCREAMS \nswallowed by hollow darkness.\n\nAlone, Kara careens through another doorway into\n\n<b>TOMMY'S APARTMENT\n</b>\nKara slams the door, turns in desperate circles.\n\nStepping out from behind the door is Mrs. Blankenship -- the baby bundled \nin her arms!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMrs. Blankenship -- Oh, God -- Hurry. We have to --\n\nAs Kara reaches for the baby, the old woman raises a dagger.  Her eyes \nburning.  Her wrist branded with the mark of Thorn!\n\nKara SCREAMS.  The old woman opens the door, allowing the figures to \nenter the room.  Daggers drawn.  CHANTING a dark invocation.\n\nThe coven forces Kara backwards.  Nowhere to run.  Nowhere to hide.\n\nSuddenly Kara makes a decision -- and takes a running leap toward the \nwindow!\n\n<b>EXT. BLANKENSHIP HOUSE (CONTINUOUS)\n</b>\nDefenestrating herself, Kara SCREAMS, tumbling through the air, bouncing \noff the porch overhang before plunging to the front lawn below.  A \nthousand grass fragments raining down on her.\n\n<b>KARA\n</b>\nlies on her back, eyes close, hands folded over her chest in silent \nrepose.  She doesn't move.\n\n<b>THE HOUSE\n</b>\nis still.  Unearthly silence fills the cold October night.\n<b>\t\t\t\n</b><b>\t\t\t     SLOW DISSOLVE TO:\n</b>\n<b>KARA'S P.O.V. - DISTORTED - INT. TUNNELS\n</b>\nA ring of faceless figures move in, completely surrounding her.\n\nSuddenly the feeling of RAPID MOVEMENT.  Glowing torchlight flickers \nacross dank walls.\n\n<b>KARA\n</b>\nis being pushed forward on a gurney.  Strapped down.  SCREAMING for God's \nmercy.\n\n<b>TOMMY\n</b>\nis wheeled through another tunnel.  His face a mass of bloody cuts and \nbruises.  His eyes glazed over, trying to find focus.  SLAMMING into \ndarkness.\n\n<b>EXT. SANITARIUM - NIGHT\n</b>\nLIGHTNING illuminates the cold, forbidding asylum.  The white van pulls up \nto the security gate.  Headlights illuminate the sign:  \"SMITH'S GROVE - \n<b>WARREN COUNTY SANITARIUM.\"\n</b>\nThe main gate cranks open.  The van pulls through.\n\n<b>THE VAN\n</b>\npulls to a stop near the main building.  The door slides open and Danny \nsteps out, surrounded by Smith's Grove staff wearing white jackets.  \nLeading him toward the entrance.\n\n<b>LANDING FIELD\n</b>\nThe helicopter touches down.  Wynn ducks out, moving in long, even strides \ntoward the building.\n\n<b>INT. SANITARIUM CORRIDOR - NIGHT\n</b>\nFOLLOW Wynn through the series of security cages, using his key card to \nBUZZ through.  White coats bringing up the rear.\n\nThrough tall mahogany doors, they cross purposefully into the adjacent wing.\n\n<b>EXECUTIVE RECEPTION AREA\n</b>\nDawn, Wynn's efficient secretary, rises with a congenial smile.\n<b>\t\t\n</b><b>\t\tDAWN\n</b>\tGood evening, Dr. Wynn.  Your -- appointment is waiting \n\tinside.\n\nWynn picks up his messages, then heads straight into the office.  Dawn \nresumes her typing.  Something eerie in her grin.\n\n<b>INT. WYNN'S OFFICE - NIGHT (CONTINUOUS)\n</b>\nWynn and his staff file inside.  Removing his hat and duster, he walks over \nto where Loomis is seated -- shackled to a chair, a bloody slash across \nhis forehead.\n\nSeeing this, Wynn snaps angrily at two burly GUARDS.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tWhat is this all about?  Remove those!\n\nThe guards comply.  Loomis rubs his aching wrists, glowering.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tWhere's the child?\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tSam, you know you never fail to amaze me.  Yesterday \n\thappily retired, today right back in the thick of things. \n\tSomehow I knew you still had it in you.\n\nLoomis sees his .357 resting atop Wynn's desk -- only inches away.  Wynn's \nhand covers it, slips it inside the top drawer.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tCome now, Sam.  This is a gathering of old friends.  I know \n\thow difficult this must be for you -- a man of your \n\tupbringing and integrity -- but now that I'm in charge I \n\tfelt it was only fair that you finally know the truth. \n\t   (gestures to his staff)\n\tAfter all, you're the only one around here who's still in \n\tthe dark, as it were.  This isn't the way I wanted to tell \n\tyou, but you've really given me no other choice.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tThis is madness, Wynn.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tYour madness is another man's greatness.  This is the way \n\tthings have always been.  You've just been too blinded by \n\tyour own reality to see. \n\t   (beat)\n\tBut having you on the outside has been convenient for us in \n\tmany ways. \n\t   (smiles)\n\tYou always did come through -- our loyal watch dog.  \n\tFinding him. Bringing him back to us once he'd finished his \n\twork.  Although after you had that nasty stroke the last \n\ttime, I had to go after him myself.  And what a terrible \n\ttime we had getting him out of that jail cell.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tIt was you.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (lights a cigarette)\n\tSometimes a cigar is just a cigar.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tWhy did you take Jamie?\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tShe has the gift -- the blood of Thorn running through her \n\tveins.  Michael's mother had it, too.  So for six years I \n\tincubated her, prepared her for this night.  Michael has \n\tserved his purpose.  And soon we will have a new progeny.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tJamie's baby ...\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tThere you go trying to make sense again. \n\t   (grimly entranced)\n\tIt's a curse.  Handed down through countless generations.  \n\tAs ageless as this celebration which you call Halloween.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tSamhain.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tAnd I'm its deliverer. \n\t   (slams his key card on the desk)\n\tIts calling card, if you will.  I follow it.  Protect it.  \n\tAct as its guardian.  In a sense, Sam, so do you.\n\nLoomis shudders, rocked by these revelations.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tI know you have more questions, my friend, and there's so \n\tmuch more for you to try to make sense of.\n\nLoomis is hoisted out of his chair and led out of the office.  Wynn and \nhis white coats flow out behind him.\n\n<b>INT. CELL - NIGHT\n</b>\nA tight, damp, claustrophobic space.  Tommy is strapped upright to a crude \nmetal rack, not unlike the one Jamie was bound to the night before.\n\nFeverishly he rubs his wrists against a jagged metal edge, cutting through \nskin, wearing away his bonds.  Breaking through.\n\n<b>INT. TUNNELS - NIGHT (CONTINUOUS)\n</b>\nA group of white coats, led by Wynn, usher Loomis off an old service \nelevator, leading him through the dark passageway.  Wynn turns around, \nsurveying the tunnel.  As he walks on, we SEE something fall from his back \npocket.\n\nAs they disappear down another tunnel, a wooden door slowly CREAKS open.  \nTommy appears, cautiously stepping out into the catacombs.  Edging along \nthe dank, torch-lit walls.  WIND MOANS.  Rats scamper past his feet.\n\nWynn has dropped his security key card.  Tommy swipes it.\n\n<b>INT. CATWALK (SAME)\n</b>\nLoomis is led across a narrow precipice overlooking a filthy prison cell.  \nThe Shape lies inside.  Dormant.\n\nWynn stares down hypnotically at his most prized possession.  Michael Myers.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tLook at him.  So silent, yet so deadly. He moves when I \n\ttell him to.  Act on my impulses.  Feels what I feel.\n\nWynn demonstrates.  Loomis looks on, spellbound.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tMichael -- Rise.\n\nBelow, the Shape slowly rises.  Wynn takes out his trusted switchblade.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tMichael -- Pain.\n\nWynn cuts his hand.  The Shape grabs his own hand in agony.  Wynn smiles, \nsucking the bleeding gash.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tMichael -- Kill.\n\nSuddenly Wynn whirls around, throwing Dawn -- his faithful secretary -- \ninside the Shape's pit.  Wynn watches with hideous delight as her horrified \nSCREAMS trail away into blood-gurgling SILENCE.\n\nLoomis closes his eyes in anguish.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tYou've created a monster.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tAmazing, isn't it?  I even taught him to drive.\n\nWynn carries on without remorse.  Loomis is brutally shoved forward.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tWe're not the only ones, you know. There are many \n\tbelievers -- generous contributors to our church.  You'd be \n\tamazed to know how far it reaches.\n\n<b>INT. CATACOMBS - STORAGE BUNKER\n</b>\nA metal door BUZZES open.  Tommy makes his way furtively inside, \npocketing the key card.\n\nA storage room filled with sawdust and wooden crates.  Tommy pries one of \nthem open.  Eyes widening in startled disbelief.\n\nA small arsenal of automatic rifles and ammunition inside.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tHoly shit ...\n\nTommy lifts a rifle, awed by its devastating lines, then slams in a \ncartridge and bolts out the door.  Back into the tunnels.\n\n<b>INT. CEREMONIAL ROOM - NIGHT\n</b>\nA large, amber-hued chamber.  The CHANTING coven forms a circle around a \nprimitive stone altar where Kara is tied down, wearing a white gown, her \nhead adorned with a wreath of mistletoe.\n\nA wooden symbol of Thorn, like an inverted crucifix, hangs in a place of \nreverence.\n\nBehind the altar, the Shape stands in its cell.  Waiting.\n\nLoomis is led inside.  Wynn glides through this macabre gathering, up to \nthe altar.  Looming over the terrified Kara.\n\nThe CHANTING continues as Wynn dons a magnificent ceremonial robe.  At \nWynn's gesture, there is SILENCE.  The worshippers offer an obedient \nresponse, removing their hoods, baring the mark of Thorn on their wrists.\n\nWe recognize many of the faces in the congregation.  Wynn's staff.  Dr. \nBonham.  Mrs. Blankenship.  The cross-eyed attendant from the bus depot.  \nPeople from all walks of life.\n\nFaces glazed with sadistic rapture.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (prophetically)\n\tBehind, Disciples of Thorn!  The final sign!  The birth of \n\tthe heretic child, delivered unto us on the eve of our \n\tgreat Feast of the Sun ... as I have foreseen it.\n\nJamie's baby is carried forth, CRYING as it is lain inside a baptismal urn \nbeside Kara.  Ringed by candles and a circle of stones -- eleven in all -- \netched with symbolic runes.\n\n<b>INT. TUNNELS\n</b>\nLetting the rifle guide him, Tommy makes his way through the tunnels.  \nToward the sound of MUFFLED CHANTING up ahead.\n\n<b>CEREMONIAL ROOM\n</b>\nThe coven CHANTS its invocation.  Wynn draws a magic circle around the \ninfant with blood from a silver chalice.  Then he inscribes a pentagram in \nthe air with an ornate dagger.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tSpirits and powers of the flame, attend and witness this \n\tritual.  Bear our gifts to Thorn.  Open us to the path of \n\tDarkness.  By these runes transform us. Open our eyes and \n\tshow us the Chosen One to whom we offer this sacrifice of \n\tInnocent Blood.\n\nSuddenly Danny is issued forth up to the altar.  His eyes dark, lifeless \npools.  Kara struggles against her bonds.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny!!!\n\nLoomis lurches forward.  Halted by massive, restraining hands.\n\n<b>CATWALK\n</b>\nTommy moves cautiously along the narrow wooden lip, looking down upon the \nevil ritual.  Startled by the SOUND of rusted chains.  Pulleys CRANKING.  \nThe Shape's cell being opened.\n\n<b>CEREMONIAL ROOM\n</b>\nThe Shape emerges from its cell and slowly walks forward.  Strangely calm.  \nHypnotized.  Looming above Kara.  She lets out a SCREAM of unbridled terror \nas he raises a gleaming dagger.\n\nWynn stands behind Danny.  Places the dagger in his hand and holds it aloft.\nAbove the baby.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tStrong and fierce Thorn, Thundered, by thy hammer we summon \n\tthee and offer this sacrifice of innocent blood.  Let thy \n\tDarkness descend on your son. Danny.  Lord of the Dead.\n\nDanny drifts into the dark spell, holding the dagger above the SCREAMING \ninfant.  Wynn speaks in the ominous WHISPERING VOICE:\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (continuing)\n\tKill for him, Danny ... Kill for him.\n\nKara cries, appealing to the boy inside of Michael.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tMichael, please.  You can make him stop.  You remember, \n\tdon't you?\n\nThe Shape stares hard at her through the sockets of its mask.  Listening.  \nReminded of his mother.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\t   (continuing)\n\tRemember what he did to you that night. What his voice told \n\tyou to do.  You can stop it, Michael.  Stop the voice \n\tforever.\n\nDanny's eyes flash like fire.  The CHANTING is insidious.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tKill him, Danny.  Kill him!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny, don't listen!  The voice isn't real!\n\nDanny turns sharply, seeing his mother.  Suddenly terrified.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tKill him, Danny!  You feel the rage inside!  You are Thorn!\n\nSuddenly Danny drops the dagger.  Wynn flies at him, SCREAMING like an \nenraged beast.  The Shape raises its dagger and plunges it -- into Wynn!\n\nWynn's eyes go wide with shock.  The Shape lurches empathetically.  Wynn \nstaggers, yanks the blade from his stomach.\n\nRAPID-FIRE GUNSHOTS rip through the chamber as Tommy lets loose a barrage \nof bullets from above.  Taking out several coven members, the rest scattering,\nretreating into the tunnels.\n\nLoomis dives Danny a split second before he through Kara's bonds with the \ndagger.\n\nKara springs toward the baby as the room is ripped apart by GUNFIRE.  The \naltar decimated.  Candles falling.  Setting the room ablaze.\n\nWynn releases the supports which suspend the catwalk.  Wooden girders CRASH \ndown from the ceiling.  Tommy pitches to the floor, dropping the rifle.\n\nThe Shape staggers, trying to get to its feet.  Slowly.  Painfully.  Flames \nlapping at its back.\n\nLoomis crawls toward the rifle.  Grabs it.  Rises just as Wynn seizes Danny, \na dagger at his throat.  Pulling him away.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tNo!!!\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\tStay away, Sam.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tLeave the boy.  Take me.\n\nLoomis slowly places the rifle down in front of Wynn.  Surrendering himself.\n\nTommy drags himself toward Kara and the baby.  Paralyzed with horror as they try to \nanticipate Wynn's move.\n<b>\t\t\n</b><b>\t\tWYNN\n</b>\t   (smiles trenchantly)\n\tGood-bye, Dr. Loomis.\n\nLoomis turns.  Gasps in startled reflex.  The Shape rises up behind him, \nswiping the dagger across his chest!\n\nWynn retreats and flies through a doorway with Danny.\n<b>\t\t\n</b><b>\t\tDANNY\n</b>\tMommy!!!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tDanny!!!\n\nTommy and Kara race across the flame-engulfed room, reaching the door just \nas it SLAMS shut.  Cutting them off.\n\nThe Shape, the trail of flames growing on its back, hurls Loomis over the \ncrushed altar.\n\nTommy sees Loomis writhing on the floor, about to go for him when --\n\nThe Shape turns on them!  Tommy stands in front of Kara and the baby, \nbacking away, propelling them out into the tunnels.\n\nThe Shape walks forward in fevered pursuit, all but consumed by fire.\n\n<b>TUNNELS\n</b>\nTommy, Kara and Danny race deep into the heart of the tunnel maze.\n\n<b>LOOMIS\n</b>\npainfully crawls away.\n<b>\t\t\n</b><b>\t\tLOOMIS\n</b>\tDie, Michael.  In the name of God, die!\n\n<b>END OF TUNNEL\n</b>\nTommy, Kara and Danny reach the tunnel end.  Kara pounds frantically on the \nelevator panel.  A DEAFENING ROAR -- the SOUND of fire as the Shape sweeps \ntoward them.\n\n<b>THE SHAPE\n</b>\nglides steadily through the tunnels.  A walking pillar of flame.  Undaunted.  \nUnstoppable.  Hell-spawned.\n\n<b>END OF TUNNEL\n</b>\nFinally the doors open.  Kara and Tommy barrel inside.  Mashing buttons until \nthe doors close -- a millisecond before the Shape reaches them.\n\n<b>INT. ELEVATOR\n</b>\nKara cradles the baby.  Tommy waits anxiously as the old elevator MOANS and \nGRINDS toward ground level.  The doors open.\n\n<b>INT. SANITARIUM CORRIDOR\n</b>\nThey barrel off the elevator and race down a long corridor.\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\tThis way!\n\nTommy leads her toward an exit sign.  Behind them, the elevator doors close. \nThe indicator light shows it moving down.\n\nThey reach a dead end.  The row of coded security cages.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tWhat now?!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (realization)\n\tWait a minute ...\n\nHe reaches into his pocket -- withdrawing Wynn's key card!\n\nSuddenly the elevator doors open.  FIRE GUSTS.  The Shape emerges, totally \nengulfed in flame.  The emergency sprinklers are activated.  Dousing the \nflames as it walks after them.\n\nTommy panics, runs the key card.  The gate BUZZES open.  They run through.  \nThe Shape's hands lurch through the bars, missing Kara by inches.\n\nThey race toward the next gate.  The gate behind them opens, and the Shape \nwalks through!\n\nTommy runs the card again.  The gate BUZZES.  They slam it -- one step \nahead of the Shape.\n\nThe third and final gate.  Tommy tries the card.  Nothing!\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tCome on!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (tries it again)\n\tIt's not working!\n\nThe Shape moves through the last gate.  Inside the cage with them!\n<b>\t\t\n</b><b>\t\tTOMMY\n</b>\t   (continuing)\n\tSomeone's controlling it!\n\n<b>INT. WYNN'S OFFICE (SAME)\n</b>\nStanding behind his computer, observing them on the security monitors, Dr. \nWynn jams the card's access code.  Then he grabs his satchel and strides \nquickly out of the office.  Pulling Danny with him.\n\nOn the screens, we can SEE the Shape approaching.  Kara's SCREAM can almost \nbe heard on the silent monitor.\n\n<b>INT. SECURITY CAGE (SAME)\n</b>\nKara SCREAMS as the Shape rakes Tommy against the cage.  Kara cowers in the \ncorner, protecting the baby.\n\n<b>EXT. SANITARIUM - FIELD - NIGHT (SAME)\n</b>\nWynn races with Danny across the field toward the waiting helicopter.  \nGetting ready for take-off as they duck inside.\n\n<b>INT. SECURITY CAGE\n</b>\nThe Shape slams Tommy's head against the bars; he slumps to the floor.  Then \nturns its murderous attention on Kara and the baby.\n\n<b>INT. WYNN'S OFFICE\n</b>\nA hand reaches into the top desk drawer, removes the .357 and FIRES an entire \nround into the security console.  Destroying it.\n\nThe man holding the gun is Loomis.\n\n<b>INT. SECURITY CAGE\n</b>\nThe door BUZZES open.  Kara drags Tommy and the baby out.  Slamming the door \nshut on the Shape.  Trapping it inside.\n\nThe Shape lurches against the bars in wild paroxysms.\n\n<b>EXT. SANITARIUM - LANDING FIELD\n</b>\nTommy comes to as he races with Kara and the baby across the windswept field.  \nSuddenly they stop dead, watching in horror as the helicopter lifts off.\n\nKara stands paralyzed with shock, looking skyward.  The helicopter disappears \ninto the gloom-filled night.\n\nTommy drags Kara in another direction.  A vehicle parked nearby.  The white \nvan.\n\n<b>INT. VAN (SAME)\n</b>\nKara lifts the baby inside.  Tommy flops down in the driver's seat.  Face \nbruised and bloody.  A key in the ignition.\n\nKara holds Jamie's baby.  Tears falling.\n<b>\t\t\n</b><b>\t\tKARA\n</b>\tHow will we ever find him?\n\nTommy's gaze terrifies her.  He starts the engine and tears off toward the \nsanitarium gate.\n\nKara looks down at the baby, then stares numbly forward.\n\nIn the back of the van, we can SEE the the Shape's white mask.  Glowing in \nthe darkness.  Emerging.\n\nKara and Tommy drive on, unaware.  And that, for now, is how we leave them.\n<b>\t\t\t\n</b><b>\t\t\t     FADE OUT.\n</b>\n<b>ROLL FINAL CREDITS\n</b>\n\n\n\n<b></b></pre>\n<b></b><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Halloween: The Curse of Michael Myers</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Daniel Farrands\" title=\"Scripts by Daniel Farrands\">Daniel Farrands</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Halloween: The Curse of Michael Myers Script.html#comments\" title=\"Halloween: The Curse of Michael Myers comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:06:49.184978"}