{"title": "Hancock", "film_link": "/Movie Scripts/Hancock Script.html", "script_link": "/scripts/Hancock.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Hancock Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Hancock.jpg\" title=\"Hancock Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/1-stars.gif\"/> (1.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Vincent Ngo\" title=\"Scripts by Vincent Ngo\">Vincent Ngo</a><br/>  <a href=\"/writer.php?w=Vince Gilligan\" title=\"Scripts by Vince Gilligan\">Vince Gilligan</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Movie Release Date</b> : July 2008<br/>\n<br/>\n<a href=\"/scripts/Hancock.html\">Read \"Hancock\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                       HANCOCK\n</b>\n\n                                      Written by\n\n                             Vincent Ngo &amp; Vince Gilligan\n<b>       \n</b>\n<b>          \n</b>\n<b>          FADE IN:\n</b>          BLACK. It's everywhere. It swallows the screen. And so we stare\n          into a sea of BLACK.\n\n<b>          NARRATOR (V.0.)\n</b>          I saw a severed head once. Except for the,\n          paleness, it looked healthy, well-fed.\n          The end came abruptly you could tell\n          'cause the mouth froze in mid-sentence.\n          \"Shh.  ,\" the curled lips attempted. Like\n          it started saying \"shucks\" or \"Shirley\"\n          or... \"shit happens.\" Your eyes don't\n          forget things like that. Like you don't\n          forget the sound animals make when\n          they're humping. Primal.\n          Raw. They endure\n          in you forever because the senses have a\n          brain all their own and they recall long\n          after you've succumbed to the la-la of\n          forgetfulness.\n          (a pregnant beat)\n          Sometimes when it's dark out,-so dark\n          it's black, I'll see HIM.\n\n<b>          (BEAT)\n</b>          And it starts all over again.\n          From this blackness, a streak of LIGHTNING splits the night sky.\n\n<b>          EXT. SKY - NIGHT\n</b>\n           We are in the eye of a STORM, an angry mass of clo uds raging\n          o f a howling WIND. across the black sky..It brings RAIN and THUNDER an d the swirl\n          An ENTITY emerges from this moist darkness.\n          weather and advances into our scope of visibilityies through the\n          A FLASH, of lightning erupts and it illuminates the sky. We SEE\n          the approaching entity as it hovers before us.\n          It's a man.\n          It's a man, plus.\n          It's a SUPERHERO,\n          garbed in an elastic dark-grey outfit - a faded RED CAPE extends b\n          ehind him, thrashing against the wind and rain.\n          This Superhero (30). Unshaven.\n          Disheveled. Worn. A face\n          chiselled with mileage.\n<b>          \n</b>\n<b>          \n</b>\n<b>          2.\n</b>          In the eyes, we can see his soul. Intense. Fierce. An exposed\n          nerve, snagged in a fish hook.\n          He hangs in the air, tired, rain-soaked, pissed-off.\n          He stares down at the earth below and he beholds the saturated\n          visage of SHEEPSHEAD BAY, a seaside Brooklyn neighborhood.\n          And from the bowels of his very soul, this Superhero belches a\n          thunderous ROAR. He pivots in the air and dives toward land.\n          He slices through the downpour, arms extended, body erect,\n          engulfed in the dimensions of his cape.\n          The ground approaches, fast. He accelerates as if to embrace it.\n          Velocity sucks up all remaining space and there is IMPACT.\n          An EXPLOSION as he rips through the street surface, penetrating\n          the asphalt - head first. Debris and concrete spew from the\n          ruptured orifice as he disappears inside.\n          There is an expulsion of subterranean pressure and it launches\n          nearby manhole LIDS from their spots - they bounce and CLANG\n          down the street like loose change.\n          The rain continues its onslaught.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          Rain sloshes against a kitchen window. Where the sink is. Not\n          far from the kitchen table. Where the LONGFELLOW Family sits,\n          dinner before them.\n          HORUS (35) leans over his plate, eating his meal. Here idles a\n          man of diminutive frame, bespectacled, placid - as harmless as\n          low fat milk.\n          He sits opposite MARY (30), frenetically appropriating food. A\n          gentle beauty. entwined in maternal angst she is estrogen with an\n          attitude.\n          A meek little AARON (8), slouches between the folks - a BLACK\n          EYE tattoos the left of his face. Aaron stares at the damn\n          plate, finding no humor in eggplant.\n\n<b>          MARY\n</b>          The principal did'nothing. Like\n          schoolyard terrorism is no worse than\n          being tardy. What's the matter with\n          education? Back when, you could go to\n          school and learn about Betsy Ross and...\n          mollusks and... not get stabbed on the\n          way home.\n<b>          \n</b>\n<b>          4.\n</b>\n<b>          INT. SUBWAY TUNNEL - NIGHT\n</b>\n          A subway TRAM idles by a passenger ramp. STEAM hisses from its\n          side and plumes into a wall of white mist.\n          And from this cloud of angry vapors, a figure appears. He\n          surfaces from the dark subway tunnel, a cool nonchalance in his\n          gait.\n          It is the Superhero, his identity safely concealed under the\n          collar of a tattered TRENCHCOAT. He traverses the loading deck,\n          PASSENGERS boarding and disembarking around him.\n          He wades through them - to a deserted section of the subway. He\n          strolls over to a CIGARETTE MACHINE, up against the grafetti-\n          raped subway wall.\n          On the wall, a line of profanity declares that...\n\n<b>          \"YOUR MOTHER TAKES IT UP THE ASS.\"\n</b>          He surveys the machine. His right arm appears from the coat\n          pocket. Fingers merge into a tight fist. And casually, he rips\n          into the metal vendor like it was Jello.\n          His fist withdraws a handful of bills, coins. He pockets the\n          loot. He reaches back in and withdraws a carton of LUCKY STRIKE.\n          Deposits it under his coat.\n          And with that, he heads for the stairs - to the flooded streets\n          above.\n          At the ramp, and on cue, the subway tram closes its doors.\n          Trembles. Moves. Steams into the deep dark tunnel. White SMOKE\n          mushrooms from its tail. It lingers in the air as we...\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          see STEAM, rising from a faucet of running HOT water.\n          It rises from a sink of soiled dishes - where Mary deposits\n          another set of pots. She's clearing the table.\n          Down a dark hallway, a streak of light escapes from an open\n          door. Inside and on the bed, the frail posture of Horus changes\n          out of his clothes.\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Horus disrobes down to his t-shirt and briefs. He stands before\n          the closet mirror, scrutinizing the emaciated, sand-kicked-in-\n          the-face body.\n\n\n<b>          5.\n</b>           Horns strikes\n           a He-man pose, his\n           biceps in the\n           wind.\n\n           He removes the Police apparel,\n           plastic. Proceeds to put it on.\n\n<b>   \n</b><b>          INT. RED\n</b>\n\n<b>          EYE MOTEL - NIGHT\n</b>\n<b>          FISH\n</b>          How the fuck can I help you sir?\n\n\n<b>           SUPERHERO\n</b>          A room.\n<b>     \n</b>\n<b>          \n</b>\n<b>          6.\n</b>          His blood-shot eyes mean it.\n          Fish turns to the back wall. Grabs a random KEY from a nail.\n\n<b>          FISH\n</b>          Top floor, 7F. Fifteen a pop, up front.\n          (re: the check-in sheet)\n          And your John Hancock makes it sweet.\n          The Superhero scrutinizes the CHECK-IN sheet. Scribbles\n\n<b>          HANCOCK\n</b>          on the dotted line.\n          Fish hands over the key. Then, pulls it back from Hancock's\n          grab.\n\n<b>          FISH (CONT'D)\n</b>          I don't take messages, I don't do favors,\n          and I don't know you from Jack. You want\n          sheets, they're extra. Towel's extra.\n          Plunger's extra.\n\n<b>          HANCOCK\n</b>          I need quiet. Is it quiet?\n\n<b>          FISH\n</b>          Quiet? Hey pal, we look like a public\n          library to you? The girls work. Some of\n          them scream, some of them moan...\n\n<b>          (SMILES)\n</b>          and some of them just kinda lay there\n          cold. You want quiet, I got cotton balls\n          you can stick in your ear. They're extra.\n\n          Hancock eyes Fish, mentally dissecting the vermin with his bare\n          hands. He withdraws from his coat the WAD of loot. Pushes it\n          under the window.\n\n          And while Fish collects, he leans into the window and emits a\n          deep GROWL. Fish recoils. The bills fly.\n\n          Hancock takes the key. Exchanges it with a metal ORB - the\n          strangulated remains of the bell. It rolls out of his palm and\n          CLINKS off the counter.\n          Hancock sidles off. Fish - the cat's got his tongue.\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Horus, in full uniform - dark blue pants, shirt.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          7.\n</b>          He dips into a dresser, pulls out a thick black leather belt -\n          complete with holster.\n\n          Horus returns to the dresser for one final item - It's obscured\n          by his arm but we feel it to be some heavy chunk of metal.\n          He confronts the mirror, twirls this piece, holsters it. And we\n          SEE it to be a FLASHLIGHT.\n          A shoulder patch reads...\n\n<b>          U-RENT SECURITY CO.\n</b>          Their motto: \"TO OBSERVE AND RECORD\"\n          Horus tucks a hat under his arms, ready to move.\n\n<b>          INT. AARON'S ROOM - NIGHT\n</b>\n          A jar of MARBLES rests upon a window ledge. Outside, the story\n          is rain.\n          On a bed, sprawled on his back, Aaron gazes up at the empty\n          ceiling - the black eye squats prominently on his face.\n          Aaron brings his hand before his eyes. Looks at it. Studies it.\n          Slowly, his fingers converge into a tight FIST - a boy's\n          interpretation of a man's weapon.\n          A gentle KNOCK disperses the knuckles. Horus peers in.\n\n<b>          HORUS\n</b>          How's the eye?\n\n<b>          AARON\n</b>          Black.\n          Horus enters.\n          Stands awkwardly before his son.\n\n<b>          HORUS\n</b>          It'll be gone in a week. Mom'11 touch it\n          up with some make-up and you won't even\n          know it's there.\n\n<b>          AARON\n</b>          Yeah I will. And I don't want any girly\n          make-up on my face.\n          Horus deposits himself on the bed. Hunches over-h13 knees.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          B.\n</b>\n<b>          HORUS\n</b>          (almost apologetically)\n          There'll always be people around\n          who'll... exert force over those of us\n          who just want to live in peace.\n          Aaron listens, observing his father's efforts.\n\n<b>          HORUS (CONT' D)\n</b>          (pain in every word)\n          The thing to do is... to avoid them.\n          They're no-wins. Can't-wins. You hold the\n          anger... and move on. You hold the anger.\n          (turns to Aaron)\n          I tell you because I can't take it,\n          seeing you hurt. You're part of me.\n\n<b>          (BEAT)\n</b>          I've felt what you're feeling now. And if\n          you've got any of me in you, you're gonna\n          feel what I felt-when you go up against\n          one of 'em. Turn away... that's what you\n          do... the other cheek. You do that for\n          me. No, you're not the coward. Not you.\n          No. I'll be the coward, all right? 'Cause\n          I don't want to see you hurt. I love you.\n          I ask you to do that for me... your old\n          man.\n          And while he utters these words, Mary watches from the dark\n          hallway - moved b y his affection.\n          She oversees a father-son embrace.\n\n<b>          HORUS (CONT'D)\n</b>          I'm late for work. Get some sleep.\n          Tomorrow always feels better...\n\n<b>          AARON\n</b>          .after a good night sleep.\n          The light FLICKS off and the man's silhouette form exits the\n          room.\n\n<b>          INT. HALLWAY - NIGHT\n</b>\n          Horus backs his way out. Shuts the door. Mary's hand greets him\n          from behind.\n          It startles the man. He.tries to regroup.\n\n<b>          HORUS\n</b>          Mary.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          9.\n</b>           Mary inches closer - passion oozes from every pore. She nestles\n          up against her husband.\n           Horus stands uncoordinated, pressing his hands against her back.\n          He is gentle, but as effective as an armless masturbator.\n           Mary caresses his neck. Moves her lips to his ear, enraptured\n\n<b>          BY\n</b>          the moment.\n          And out of nowhere...\n\n<b>          HORUS (CONT'D)\n</b>\n<b>          (AWKWARD)\n</b>          I'm late.\n          Mary snaps from her trance. Unshackles her hold, like she almost\n          expected it.\n\n<b>          MARY\n</b>\n<b>          (DISAPPOINTED)\n</b>          Right.\n\n<b>          (BEAT)\n</b>          Coffee's by the door.\n           She marches back into the kitchen. Horus stares at his feet.\n          S hakes his fists, mentally kicking himself in the face.\n           He settles for the door, grabs hisjac ke , coffee thermos. A\n           look at Mary and he's out thedoo rt\n\n<b>          CUT TO:\n</b>\n<b>          INT. KITCHEN - NIGHT\n</b>\n          Mary - against\n          the kitchen sink.\n          Her thin cotton\n          dress clings to a body still'robust with enrgy,\n          to breasts so ful l they could yread Uncl\n           pop a boner inoud e\n           And while the storm rages outside, Mary burns in a feverish\n          sweat. The swelling steam and running ho t water combine to\n          saturate her chest and face - she drips.\n           Mary gazes out at the wet abyss, possessed by some inner\n          longing.\n\n<b>          INT. MOTEL ROOM (7F) - NIGHT\n</b>\n          A T.V. SET. It MOANS from the corner of a room. Scant\n          blinking red neon from the street cannot disguise thecant lighting\n          torture this r oom has seen.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          10.\n</b>          Torn, mildewed' curtains. Damp carpeting,. et _ d by every form\n           of bodily discharge. No self-rem nï¿½ g maggot would want to be\n          caught dead here.\n          On a shredded s, blotched with urine and cum, we SEE a\n          trenehc -lï¿½n open carton of cigarettes accompanies the\n          picture.\n          An open door faces the MOANING TV set. It's the bathroom and\n          it's occupied by the intensely frazzled image of Hancock.\n          He squats on the TOILET, pants around the ankles, cape shrouded\n          around him.\n          Those unforgiving eyes plant on the TV screen, a cigarette\n          dangling from the corner of his lip.\n          We discern the MOANS to be human and we SEE that he is watching\n          a PORNO flick - flashes of flesh upon flesh in a fucking frenzy.\n\n<b>          T.V. SET (O.S.)\n</b>\n<b>          (FEMALE)\n</b>          Ooh yeah, big fella. That's it. Shoot\n          your load, baby. Let it fly... FLY...!\n          (male; in ecstasy)\n          fly. YES! G0000D!\n          Hancock absorbs the action from the can, a glint of pain on his\n          face.\n          He takes a long hard drag on the cigarette - a full stick\n          deteriorates into ashes before our eyes.\n          And outside, it rains like there's no tomorrow.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. SHEEPSHEAD BAY - DAY\n</b>\n          Morning brings a cease-fire on precipitation. The streets\n          glimmer from puddles left behind from the night.\n          The overcast sky - its precarious rain formation indicates that\n          the storm is far from over.\n\n<b>          INT. KITCHEN - DAY\n</b>\n          A SUPERMAN lunchbox perches on the kitchen table. Mother and son\n          prepare for school.\n          Aaron adjusts his raincoat, looking disturbed.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          11.\n</b>          Mary parts his hair, Straightens\n           his shirt.\n           _the complete morning routine. Her maternal h'ahdf\n           Stay inside.\n\n<b>           AARON\n</b>\n<b>           (IRRITATED)\n</b>           I don't need you walking\n           me to school.\n          Mary clasps her ears - deaf.\n\n<b>           MARY\n</b>           not listening\n           .Lalalala...\n\n<b>           AARON\n</b>           (in disbelief)\n           I got the only mother\n           does this. in the world that\n           I'm not lisMARY g. Lalalala..,\n\n<b>           INT. WATANABE'\n</b>\n\n<b>           S SHOPPING EMPORIUM - THI\n</b>\n<b>           RD FLOOR - DAY\n</b>          A light beam.\n           It dances over the consoles of H\n          H orns holsters i-fi's televisions\n           , his flashli ht , stereo\n          floor. He take and mores ' across the s\n           s the stairs g - down. howrooms\n           Horus passes the\n           second floor.\n\n<b>          INT. FIRST FLOOR - DAY\n</b>\n           Horus crosses the floor\n           to the back,. to where\n\n<b>          ROHEIM (50)\n</b>          stoops, on a stool and\n           in a deep\n          from his mou th over his saturated ssleeve. A line of SALIVA dangles\n           The badge and uniform reveal\n          employee. Roheim another U-Rent Secu Co.\n           is your uncle lostjck sexuallytdeviant\n          as threatening as a burnt-outmat and\n\n<b>           CHSTICK\n</b>           Horns stands over Roheim's slumpne ss. Removes a\n           from his own pocket. handkerchief\n\n<b>          HORUS\n</b>\n<b>          (GENTLY)\n</b>          Roheim.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          12.\n</b>          He's done this before.\n\n<b>          ROHEIM\n</b>          (dream state)\n          Olga...\n\n<b>          HORUS\n</b>          Roheim. Let's go home.\n          Roheim stirs...\n\n<b>          ROHEIM\n</b>          . bitch.\n          From the dark recesses of sleep - he wakes. Straightens up.\n          Slurps back his dignity.\n\n<b>          ROHEIM (CONT' D)\n</b>\n<b>          (BARELY)\n</b>          What, already?\n          Takes the handkerchief. Wipes his mouth.\n\n<b>          HORUS\n</b>          I just made the last run.\n          He helps the old man to his feet.\n\n<b>          ROHEIM\n</b>          You're a good man.\n\n<b>          INT. RED EYE MOTEL (7F) - DAY\n</b>\n          An ASHTRAY buried under a mountain of butts.\n          A bed unslept. The TV is on, commercialing some spring-fresh\n          vaginal wash. The room sits empty.\n          But the bathroom door is open. Inside, the supersuit peeled down\n          to his waist, Hancock shaves.\n\n<b>          HANCOCK\n</b>          (mumbling; rehearsing)\n          it's about responsibility... with\n          what is empowered in you... to correct\n          the ills of man.\n          No foam. No gel. Just skin and the razor edge of his belt BUCKLE\n          - it slices through stubble, clearing up a face that has yet to\n          sleep.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          13.\n</b>\n<b>          HANCOCK (CONT'D)\n</b>\n<b>          (AGAIN)\n</b>          it's about responsibility...\n          Hancock reaches into the cabinet below the sink - pulls out a\n          BOTTLE of 409 all-purpose cleaner...\n          On the tube, the commercial segues way into...\n\n<b>          T.V. (O.S.)\n</b>\n<b>          (FAINTLY)\n</b>          And on the world front, heavy fighting\n          continues in Angola as rebel forces\n          storm... regime... under the military\n          stronghold...\n          The SOUND of machine guns CRACKLE amidst mortar explosions and\n          civil destruction.\n          Hancock listens - it disturbs him. He whirls around, accosts the\n          TV Rips it from the wall, throws it out the window. And a CRASH\n          eradicates images of war and chaos.\n          He returns to the bathroom. To the mirror. Proceeds to spray his\n          teeth with 409...\n\n<b>          EXT. WATANABE'S SHOPPING EMPORIUM - DAY\n</b>\n          Behold this imposing, block-long behemoth of commerce and\n          decadence. A shopper's wet dream, this is WATANABE'S SHOPPING\n\n<b>          EMPORIUM.\n</b>          From the street, notice the display windows - all mannequins\n          come complete with outfit and ultra-erect nipples.\n          As EMPLOYEES file into the service entrance, out comes Horus and\n          Roheim. They head streetward, to the sidewalk.\n          Roheim unscrews the battery cap from his flashlight. Takes a\n          swig from its hollow interior.\n\n<b>          ROHEIM\n</b>          I'll just play out the rest of this Eight\n          Ball...\n          He laps up the last drop. Reloads it with a couple of batteries\n          from his jacket.\n\n<b>          ROHEIM (CONT' D)\n</b>          (caps it)\n          like that.\n          Horus looks on - silent.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          14.\n</b>          A POLICE VEHICLE enters this urban landscape. It slows in front\n          of them. The cops: RUTGER and ADAMS, two hairy-knuckled\n          testosterone cases with nothing to do.\n\n<b>          RUTGER.\n</b>          (passenger seat)\n          Boys...\n          The cops smile at one another. A large SHOTGUN rests fully erect\n          between them. And they drive off.\n          Horus, watching them go, focuses in on the\n\n<b>          \"TO SERVE AND PROTECT\"\n</b>          of their vehicle.\n          Roheim watches him - turning red with drama.\n\n<b>          ROHEIM\n</b>          Bastards... couldn't protect a pitcher of\n          warm spit... couldn't find their\n          asshole with common sense and a thumb.\n\n<b>          (BEAT)\n</b>          Like I been saying, it's their.loss. The\n          jerk-offs, they don't got the heart...\n          the sensitivity of a man like you.\n          Horus tries to shrug off these words. No good - they stick like\n          a thorn in the eye of his soul.\n\n<b>          ROHEIM (CONT'.D)\n</b>\n<b>          (CONTINUING)\n</b>          Come on, let's go home.\n\n<b>          EXT. ROOFTOP - DAY\n</b>\n          On the rooftop; the Red Eye Motel.\n          A trenchcoated figure - we see him from the back, only. We\n          recognize the broad of his shoulders and the red of his cape,\n          peering out from a hole in his coat.\n          A cloud of smoke lingers above his head, from an unseen\n          cigarette. He stands before the Sheepshead neighborhood, ever so\n          still.\n          Something brews within this superman.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          15.\n</b>\n<b>          EXT. SHEEPSHEAD BAY - DAY\n</b>\n          The streets of Sheepshead: apartments, brownstones speckled with\n          e DELIS and NEWSSTANDS and BARBER SHOPS and OUTDOOR MARKETS - they\n          are the \"esque\" in Bro ly qu\n          Through this hustle-bustle, we spot Mary and Aaron on their way\n\n<b>          TO\n</b>\n<b>          BRADLEY ELEMENTARY SCHOOL.\n</b>          Schoolyard activities abound. Buses, bouncing balls, and hoards\n          of screaming little anti-christs.\n\n<b>          I\n</b>          Mary leads Aaron along the playground fence, the latter trying\n          to pull ahead and away.\n\n<b>          MARY\n</b>          Will you slow down.\n\n<b>          AARON\n</b>          I know it. I know it.\n\n<b>          MARY\n</b>          I think I'm... slow down... I'm gaining\n          weight. Honey, take a look at my waist.\n\n<b>          AARON\n</b>          What?\n\n<b>          MARY\n</b>          Is my dress too tight?\n\n<b>          AARON\n</b>          What? Nothing. It's fine.\n\n<b>          MARY\n</b>          Really, my waist isn't too big?\n\n<b>          AARON\n</b>          What? Not here, mom.\n\n<b>          MARY\n</b>          All right, already. Two-thirty. You do n't\n          leave the building till then. I'll be\n          there.\n\n<b>          AARON\n</b>          I know it, mom. Can I go now?\n\n<b>          MARY\n</b>          Give me a kiss, you snot.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          16.\n</b>\n<b>          AARON\n</b>          (there is no god)\n          Geez!\n          He turns back. Plants a kiss on Mary's smiling cheeks.\n\n<b>          MARY\n</b>          Two-thirty.\n\n<b>          AARON\n</b>          All right, mom.\n          He leaves, merging into the undulating sea of children.\n\n<b>          MARY\n</b>          (after him; in vain)\n          You want anything from the store?\n          He's gone.\n\n<b>          EXT. STREET - DAY\n</b>\n          This is the Longfellow's street - lower-middle class but\n          comfortable, quaint, safe. Mr. Longfellow, hustling through the\n          street, takes us home.\n          Greeting him at the entrance, at the mailboxes, is CLYDE BANNER\n          (35). Quite large this tenant is, quite simply a Cro-Magnon Man.\n          Clyde stands with the morning paper in hand, searching\n          carelessly through. He finds the SPORTS PAGE. Hides it under his\n          robe.\n\n<b>          CLYDE\n</b>\n<b>          (LOUD)\n</b>          Longfella. Good to see you.\n\n<b>          HORUS\n</b>          Clyde...\n          Clyde shoves the remains of the paper at Horus - in his face.\n\n<b>          CLYDE\n</b>          Picked this up for you.\n          (pulls the paper back)\n          Say thanks.\n\n<b>          HORUS\n</b>          Thanks.\n\n<b>          CLYDE\n</b>          (hands it over)\n          You're a good man.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          17.\n</b>          He heads inside.\n          Horus swallowing it. He unshuffles the paper, finding the front\n          page. The headline reads...\n\n<b>          RAINSTORM HITS SHEEPSHEAD. NO END IN SIGHT.\n</b>          Horus checks the sky - a sinewy mesh of angry clouds. He lumbers\n          inside.\n\n<b>          INT. NICK'S MARKET - DAY\n</b>\n          Your average market, mom and pop.\n           Artichokes! Mary handles an artichoke, contemplating. NICK (30),\n          the grocer, moves behind her. handsome in a greasy,\n           grimy, rebuilt carb in uretor He's\n          That's a lovely dress, Mary.\n          If he could mount her now, he would.\n\n<b>          MARY\n</b>          You're sweet, Nick.\n          He cracks a wet smile. Mary, aware, unhands the artichoke. Moves\n          on.\n\n<b>          L\n</b>\n<b>          CUT TO:\n</b>\n<b>          EXT. STREET - DAY\n</b>\n          Mary moves through the street, embracing a grocery bag.\n          She continues her way, purpose in every step. No window shopping\n          bullshit for this woman - Mary's strong, beautiful.\n          She crosses the street, her destination: CENTRAL FIDELITY BANK.\n          A dark CHEVY eases pass Mary on this street, pulls to a stop.\n          Mary continues forth, entering the bank.\n\n<b>          INT. BANK - DAY\n</b>\n          Sheepshead DENIZENS crisscross amok. People queue behind teller\n          lines, taking care of business.\n          Mary takes her place. She glances at the bank CLOCK - it's 10\n          o'clock.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          18.\n</b>\n<b>          EXT. BANK - DAY\n</b>\n          A BEE spirals the air and lands on the sleeve of a nervous ARM.\n          This arm protrudes from the dark Chevy, parked before the bank.\n          The engine is running.\n          The arm fidgets. SHOOS the insect away. With white knuckles, it\n          grips the wheel.\n\n<b>          INT. BANK - DAY\n</b>\n          Same bank, same people. Mary awaits service in the same line.\n          A MAN ambles pass Mary's line, up towards the front. He cuts off\n          the person in front, an elderly WOMAN.\n\n<b>          WOMAN\n</b>          Hey, what's the idea?\n          The man turns. Smiles. His smile fades, turning into a maniacal.\n          grin. This man is TOM (35), as plainly evil as the eye can see.\n\n<b>          TOM\n</b>          You know what, you remind me of my\n          grandma.\n          Tom whips out a sawed-off SHOTGUN from his pants...\n\n<b>          TOM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          She gave me this when I made parole.\n          He aims the barrel in her face.\n\n<b>          TOM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Thanks, Granny!\n          Of course, by now, people have realized the implications of the\n          situation at hand. They begin to panic.\n          On cue, two new GUNMEN, JERRY and JERRY (30's), emerge from the\n          crowded bank, both revealing automatic RIFLES.\n          Jerry #1 drops the SECURITY GUARD with the butt of his gun.\n          As planned, they take aim at the surveillance CAMERAS on each\n          end of the bank. BANG. BANG. They miss, much to Tom's chagrin.\n          The crowd ducks, Mary among them. Terror grips,the queues.\n          The Jerrys try again. BANG. BANG. No more cameras. And with\n          ,Irâ\u0096º that, Tom takes center stage. He leaps on the teller counter.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          19.\n</b>\n<b>          TOM (CONT'D)\n</b>          Ladies and gentlemen, this is your\n          captain speaking. My name is Tom. These\n          are my assistants, Jerry and Jerry.\n          Why're we doing what we're doing, you\n          ask? We got one word to say to you\n          folks...\n          (shrugging; smiles)\n          Recession.\n\n<b>          CUT TO:\n</b>\n<b>          TNT. BANK - DAY\n</b>          Order in the bank - employees and patrons are now corralled at\n          the center of the bank. Their faces all register pain. And we\n          find out why...\n          They all squat in the LOTUS position - legs crossed like\n          pretzels.\n\n<b>          TOM\n</b>          (to Jerry #2)\n          Thank you, Jerry.\n          Tom is referring to Jerry's demonstration of the lotus Jerry\n          does not respond.\n\n<b>          TOM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Thank you, Jerry.\n\n<b>          JERRY #2\n</b>          I'm stuck.\n          Mary, amongst the crowd, watcheson withinterest.\n\n<b>          INT. CLASSROOM - DAY\n</b>\n          Bradley Elementary School.\n           Class.is in session, captained by ravishing MS. MILLIS (28).\n          Lips, legs, lungs - stuff prepubescent wet dreams are made of.\n          Aaron, nestled mid-room, tries to keep his eyes straight.\n          He steals a quick look to the back of the room: there, in the\n          back, a BLONDE boy (8) sits chewing gum.\n          This kid, from the slicked-back hair and rolled-up t-shirt\n          sleeves, is a sub-species of vermin.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          20.\n</b>          He taunts Aaron a smile, opens his mouth, and we realize that\n          he's gnawing on a plastic DOLL HEAD.\n\n<b>          INT. BANK - DAY\n</b>\n          Behind the teller window is Tom, assisted by a quite voluptuous\n          employee - VERONICA, (23), with an IQ to match.\n\n<b>          TOM\n</b>          (to the crowd)\n          And while I take care of business, my\n          associates will be making their rounds.\n          The Jerrys leap into action - guns pointing. They rummage the\n          helpless patrons for jewelry, cash and collectables.\n\n<b>          TOM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Please be cooperative and more\n          importantly, charitable. We'd like you to\n          think of it as donations... for Jerry's\n          kids.\n          Jerry #2 weaves through crowd waving his automatic wand. People\n          dish out valuables into his canvas BAG. He arrives at Mary,\n          motioning at the bag with the rifle.\n\n<b>          MARY\n</b>\n<b>          (UNINTIMIDATED)\n</b>          I have no money.\n\n<b>          JERRY #2\n</b>          (I wasn't born yesterday)\n          Come on, is. What the hell you doing in\n          a bank if you.got no money?\n\n<b>          MARY\n</b>          I'm here to withdraw money.\n          This stumps the brainless beast.\n          And over by the teller, while he's stuffing her bag...\n\n<b>          TOM\n</b>          Don't hate me 'cause I'm beautiful.\n          She's too scared for speech.\n          But back on the bank floor...\n\n<b>          JERRY #2\n</b>          (at her ring)\n          Give me that.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          22.\n</b>          Jerry #2, testicles in his throat.\n\n<b>          INT. BANK - DAY\n</b>\n          Tom is out on the floor, gun wielding. Jerry #1 is with him,\n          loot bags in hand.\n\n<b>          TOM\n</b>          (to the crowd)\n          No heroes! No heroes!\n          Jerry #2 returns, bad news on his tongue.\n\n<b>          JERRY #2\n</b>          He flew! Fucking Fred flew!\n\n<b>          TOM\n</b>          Fuck! Fuck!\n          A wave of SIRENS punctuate their state of \"fuck.\" It crescendoes\n          around the building.\n\n<b>          EXT. BANK - DAY\n</b>\n          SQUADS of police cars form a noose around the building. A\n          S.W.A.T. teem spews from a transport unit, armed for the big\n          tightening. Guns and ammo abound.\n\n<b>          INT. BANK - DAY\n</b>\n          Jerry #1 is at the entrance - peering out at doom.\n\n<b>          JERRY #1\n</b>\n<b>          (IMPRESSED)\n</b>          Wow, S.W.A.T.\n\n<b>          TOM\n</b>          (muttering; spelling the end)\n          I'm not going back.\n          Mary, amongst the crowd, takes a glance at the CLOCK --one\n          thirty.\n\n<b>          CUT TO:\n</b>\n<b>          INT. BANK DAY\n</b>\n          Time LAPSES. It's 2:30.\n          Mary turns from the clock, concerned. She studies the situation,\n          the robbers - an overall glumness tells the story. At the\n          entrance - Tom. He looks desperate. Irrational. Ready to snap.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          23.\n</b>          The hostages huddle on the floor, tired. They wait.\n\n<b>          EXT. BRADLEY ELEMENTARY - DAY\n</b>\n          The CLOCK on the building reads 2:30 school is out. Children\n          file out of classrooms. Scatter. Only Aaron remains, alone to\n          the elements - waiting.\n          A ball bounces, rolls to his feet. Aaron looks...\n          It's not a ball. It's a doll's head.\n          Aaron's face - dread.\n\n<b>          EXT. BANK - DAY\n</b>\n          A portly man, oily, thick, bellows out negotiations via his\n          HORN; Introducing TED, the police captain, BROCK (45) - aspires\n          to be Warren Beatty, more like Ned Beatty.\n\n<b>          TED\n</b>\n<b>          (YAWNING)\n</b>          Time's running out, fellas.\n          He turns to his sidekick, CHAD (25), a fellow cop. Chad's on the\n          phone deliberating an important call.\n\n<b>          TED (CONT'D)\n</b>          (tapping his attention)\n          The pizza here, yet?\n\n<b>          CHAD\n</b>          Negative.\n          (hands over the phone)\n          Tami.\n\n<b>          TED\n</b>          Ooh, one sec.\n          (to the bank)\n          Time's... all Hell's gonna break loose,\n          fellas.\n          (to phone)\n          My koochie, woochie, oochie ooo...\n          A BLAST rings out from Central Fidelity.\n          Glass shatters from the entrance. A body, the security guard,\n          tumbles out and onto the sidewalk.\n          Blood and brain exits in OOZES where the bullet had entered -\n          he's probably dead.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          24.\n</b>          The cops, Ted., Chad. Rutger and Adams - they all REACT, guns\n          raised.\n\n<b>          INT. BANK - DAY\n</b>\n          Tom huddles by the entrance, gun smoking. Cool and suave has\n          succumbed to psychotic. The Jerrys are nearby, nervous. As are\n          the hostages, clumped together in fright.\n\n<b>          TOM\n</b>\n<b>          (SNAPPED)\n</b>          I'm not gonna say it again, Ted!\n          (re: hostages)\n          swiss cheese. All of them!\n\n<b>          TED (O.S.)\n</b>          Time's running out, fellas!\n          The hostages grimace, hell not so far away.\n\n<b>          TOM\n</b>          I want that car, Ted!\n\n<b>          EXT. BANK - DAY\n</b>\n          Ted punches Chad on the shoulders.\n\n<b>          TED\n</b>          Where's that car, Jesus!\n\n<b>          CHAD\n</b>          It's out getting your pizza.\n\n<b>          TOM (O.S.)\n</b>          . a car and I want it NOW!\n          And on this cue, the sky answers with a thunderous surprise - a\n          CAR comes CRASHING down before the bank entrance.\n          It came from the clouds and it looks familiar - it's the getaway\n          Chevy, bruised and punctured beyond recognition, its hubcaps\n          still reeling from the impact.\n          The sky answers again, this time with the tattered body of FRED,\n          the getaway driver (alias, the arm.) Fred lands on the hood of\n          the Chevy, sinking into its metal frame.\n          SHOCK waves across faces of stone. The cops all look up.\n\n<b>          TED\n</b>          (at the sky)\n          What the...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          25.\n</b>          There :;n the sky, a taped figure works his magic of flight. He\n          examines the ground below. And he dives.\n          Hancock approaches earth and swings lateral. He circumvents the\n          bank structure, flying around and around.\n          Everybody ducks. Trash and paper batter about behind his draft.\n\n<b>          INT. BANK - DAY\n</b>\n          Tom and the Jerrys stand shackled in their spots.\n          Their eyes wander about, lost in confusion. The WHIR outside\n          subsides. Stops.\n          A loaded beat.\n          Tom, in mid-swallow, watches as a spectacular EXPLOSION of\n          bricks sprays the air inside. A caped figure bursts into the\n          scene amidst SCREAMS from clueless hostages.\n          in the blink of an eye, Hancock has Jerry #2 by the collar. With\n          a flick of the wrists, Jerry #2 is a human projectile en route\n          to the windshield of a police vehicle outside.\n          Jerry #1 opens FIRE on Hancock. Bullets careen off flesh of\n          steel.\n\n<b>          EXT. BANK - DAY\n</b>\n          Jerry #1 rides air and glass out and across the street into\n          another awaiting police windshield.\n\n<b>          INT. BANK - DAY\n</b>\n          Smoke and debris smother the air. And as they subside, all eyes\n          fall on the caped figure that is Hancock, erect in the rubble.\n          Mary can't believe her eyes. She surveys every inch of his\n          frame, now clean-shaven, combed, comic book perfect.\n          Hancock scans the crowd of stunned hostages - his eyes pick out\n          the WOMEN - Veronica's wet smile takes him.\n          A heartbeat.\n\n<b>          HANCOCK\n</b>\n<b>          (GOD)\n</b>          Everybody out, please.\n          Bodies bang about, all moving for the door.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          26.\n</b>          Mary follows the herd out but her eyes remain on the caped\n          figure, until real estate ushers her into the street.\n\n<b>          EXT. BANK - DAY\n</b>\n          PARAMEDICS converge on the hostages .\n          The cops are at a loss - deers staring down a pair headlights.\n          They train their guns on the bank, waiting for answers.\n\n<b>          INT. BANK - DAY\n</b>\n          The bank floor in shambles. No one in sight. But movement jars\n          us to the back, where the bank SAFE is.\n          We SEE Hancock wade through rubble towards the open safe, a\n          thick steel chamber of commerce. Hancock arrives at the safe.\n          Confronts the object inside - Tom.\n\n<b>          INT. BANK SAFE - DAY\n</b>\n          There he is, in the corner, a sweaty piece of misery. Tom bears\n          his revolver, aimed at Hancock. Hancock enters the safe.\n\n<b>          TOM\n</b>          Stay away.\n          Hancock does not respond.\n\n<b>          TOM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          I'm not going back.\n          Hancock turns, grabs the safe door. Slams it shut with a\n          resounding THUD. They're locked in.\n\n<b>          TOM (CONT'D)\n</b>\n<b>          (HYSTERICAL)\n</b>          What're you doing?\n          Hancock does not respond.\n\n<b>          TOM (CONT'D)\n</b>          What's going on, here?\n          Hancock no response. Tom raises his gun, and meaning it.\n\n<b>          TOM (CONT'D)\n</b>          Answer me! Say something!\n\n<b>          (FIRES)\n</b>          Fuck me!\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          27.\n</b>          BANG! Tom fires a. shot off Hancock's forehead. The BULLET\n          ricochets about the steel interior, under great velocity.\n          It rips Tom's right EAR from his head.\n\n<b>          HANCOCK\n</b>          (catching the renegade slug)\n          Why'd you go and do that for?\n          Tom retrieves his ear from the ground. Tries to put it back,\n          clutching his head. He bleeds.\n\n<b>          TOM\n</b>          Fuck... My shirt.\n\n<b>          HANCOCK\n</b>          (steps forward)\n          Why don't we call it the day.\n\n<b>          TOM\n</b>          (gun raised)\n          Don't. I told you... I'm not going back.\n\n<b>          HANCOCK\n</b>\n<b>          (IRRITATED)\n</b>          If you're going to tease, cock the damn\n          gun. Otherwise, spare me the wounded\n          animal act of desperation. I don't got c,\n          time for rhetoric and sympathy so. don't\n          expect... dialogue and \"come with me and\n          you won't be hurt\" bullshit. You walk out\n          of here with me and your life is a\n          violent storm. You will be hurt, you will\n          be abused... whatever turns them on.\n          Either way, your days are shit! Those are\n          the realities, spelled out.\n\n<b>          TOM\n</b>          What's eating you, man?\n\n<b>          HANCOCK\n</b>\n<b>          (UPSET)\n</b>          You got half the precinct out there,\n          armed, trained to blow the tail off a\n          sperm from a hundred yards... you're\n          standing in here, cornered, three bullets\n          left in that squirter of yours, if you're\n          lucky, and you got one ear. I don't need\n          the aggravation. I don't need this.\n\n<b>          TOM\n</b>          Man, you're jaded. I'm not asking for a\n          rainbow...\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          28.\n</b>\n<b>          TOM (CONT' D)\n</b>          you don't got to shower me with respect.\n          Just a little.. tenderness, is all. Have\n          you no mercy, mister?\n\n<b>          HANCOCK\n</b>          (he's had enough)\n          I'm all out. Let's go...\n          And as he utters this, he approaches Tom.\n\n<b>          TOM\n</b>\n<b>          (HURT)\n</b>          Fuck you.\n          Close on his trigger finger. It tightens...\n\n<b>          HANCOCK\n</b>\n<b>          NO!\n</b>\n<b>          INT. BANK - DAY\n</b>\n          On the bank floor, where a group of cops now huddle, we hear\n          THREE SHOTS - from the safe.\n\n<b>          EXT. ALLEY - DAY\n</b>\n          The schoolyard - it looms in the background, as a reference to\n          where we are.\n          Aaron occupies this alley and we see what he sees - trash and\n          fire-escapes and ominous gray skies. DARK FIGURES move into this\n          sight - they eclipse the heavens.\n          And there Aaron is, twisted in a contorted heap of arms and legs\n           - his body eternally locked within the stranglehold of SPENGLER\n          and ERLICK (both his age.)\n          Aaron's face, another BLACK EYE makes it a set. Rage distorts\n          his mouth out of symmetry. He stares at PERCEVAL, before him -\n          the blonde kid from class.\n          We HEAR water, a stream of liquid-something SPLASHING about,\n          SPRAYING. Perceval - he's taking a leak on Aaron's exposed leg.\n\n<b>          EXT. BANK - DAY\n</b>\n          The aftermath.\n          Hancock is swarmed under MEDIA LIGHTS, reporters squeezing\n          through a wall of people, police, trying to get a piece of this\n          superman.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          29.\n</b>          We follow Hancock's scope amidst the melee it spots luscious\n          Veronica again, it spots WOMEN, all who'd die for a chance to\n          suck on his cape.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. STREET - DAY\n</b>\n          Mary hastens after Aaron, urine-soaked and on the verge of\n          tears. He rages down the street while his mother pursues.\n\n<b>          MARY\n</b>          Tell me... what happened?\n\n<b>          AARON\n</b>          (about to break)\n          You were late.\n\n<b>          MARY\n</b>          I was held up...\n\n<b>          AARON\n</b>          The asshole peed on me. I'm dog shit.\n\n<b>          MARY\n</b>          .at the bank. Honey, were they the same\n          ones? Don't cry.\n\n<b>          AARON\n</b>          Get a grip, mom.\n          They arrive home, both storming through the entrance and up the\n          stairs.\n\n<b>          EXT. APARTMENT - DAY\n</b>\n          The door SLAMS to signify arrival. School books go flying.\n          Mother and son march down the hallway. They are greeted by\n          Horus, sleep still on his face.\n\n<b>          HORUS\n</b>          How was your day?\n          Mother and son - if eyes could disembowel.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. BUILDING - DAY\n</b>\n          Just your average professional building, several stories of\n          brick and cement.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          30.\n</b>          But all is not well with this typically normal picture. On the\n          top floor, outside and on the ledge - a JUMPER stands poised\n          before blood and concrete. His TIE flaps in the wind.\n          From an adjacent window, a SECRETARY, a FIREMAN attempt to get\n          him down.\n\n<b>          JUMPER'\n</b>\n<b>          (SELF-PITY)\n</b>          People ignore me.\n          From his vantage - a congregation of PEOPLE swarm below in his\n          honor. A woman cradling a BABY watches from a building window\n          across the street.\n\n<b>          FIREMAN\n</b>          Mr. Fisher.\n\n<b>          SECRETARY\n</b>          (through her teeth)\n          You're not unattractive.\n\n<b>          FIREMAN\n</b>          Baldness is not fatal.\n\n<b>          JUMPER\n</b>          My wife ignores me.\n\n<b>          FIREMAN\n</b>          Your wife's a cunt, Mr. Fisher.\n\n<b>          SECRETARY\n</b>          We like you, Mr. Fisher. The girls\n          acknowledge you, we all do.\n\n<b>          JUMPER\n</b>          No.\n\n<b>          SECRETARY\n</b>          Yes.\n\n<b>          JUMPER\n</b>          Really?\n          The secretary SCREAMS. All attention shifts to the BUILDING\n          across the street. The secretary points...\n\n<b>          EXT. OPPOSITE BUILDING - DAY\n</b>\n          There...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          31.\n</b>          on the top floor, outside and on the ledge - the baby seen\n          earlier, diaper-clad, crawls precariously on the rim of doom.\n          His mother's FREAKING from the window.\n          Below, the crowd makes its way across the street. They point and\n          gasp at the infant's every movement - leaving the jumper by his\n          lonesome.\n          The baby teeters along the edge. It heads for a FLAG pole,\n          dazzled by the red-white-and-blue. It reaches out at fabric.\n          Almost. Not quite. The baby DROPS from the precipice.\n          On the street, people CHOKE on their tongues as gravity pulls\n          the infant down.\n          But wait... Hancock swoops out of the thin blue, swift and\n          silent. He cradles the baby from utter concrete.\n          He deposits the youngster with.the ecstatic crowd - they, of\n          mostly the FEMALE persuasion, all form around the savior.\n          We SEE in the background and across the street, the Jumper nose-\n          diving into the sidewalk - without much fanfare.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. STREET - DAY\n</b>\n          An apartment building engulfed in FLAMES. FIRE TRUCKS don't even\n          bother with the hoses - it's too late. Around them, TENANTS\n          bemoan the loss of...\n          Like a wrecking ball, Hancock BURSTS through the burning rubble\n          and surfaces clean on the other side of the building.\n          Blanketed under his cape are two little TODDLERS, and a young\n          WOMAN in bra and panties. He lowers them to safety.\n\n<b>          CUT TO:\n</b>\n<b>          INT. APARTMENT - NIGHT\n</b>\n          We're in the hallway. Where Horus kneels. He's bent listening\n          into Aaron's bedroom, in his security clothes. By the TV and in\n          her apron, Mary watches the news...\n\n<b>          NEWS\n</b>          . paramedics have taken the rescued\n          tenants to County General for smoke\n          inhalation but no serious injuries\n          reported thanks to the superheroics of\n          this mystery man...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          32.\n</b>          We see FOOTAGE of the dramatic fire rescue: Hancock recovering\n          tenants from the pyre - plebs and dwellers cheer in exaggerated\n          astonishment.\n\n<b>          HORUS\n</b>          (to Mary)\n          Mary?\n          Mary blinks back her attention.\n\n<b>          HORUS (CONY' D)\n</b>\n<b>          (CONTINUING)\n</b>          Why is he mad at me?\n\n<b>          MARY\n</b>          He's looking for answers. He's Upset.\n\n<b>          HORUS\n</b>          (tapping the door)\n          Let me see your eye...\n          (to Mary)\n          I told him about the other cheek. Avoid\n          confrontations... to turn the other\n          cheek.\n\n<b>          MARY\n</b>          .He did. He turned the other cheek and\n          they punched it.\n\n<b>          HORUS\n</b>\n<b>          (PLEADING)\n</b>          Aaron.\n\n<b>          MARY\n</b>          You're late. I'll try again later.\n          Horus finds his hat on the table. His eyes fall on Mary, her\n          back to him. She's glued to the set.\n\n<b>          HORUS '\n</b>          How... what about you?\n\n<b>          MARY\n</b>\n<b>          (ALOOF)\n</b>          What?\n          Horus turns his focus to the TV - more Hancock FOOTAGE. He\n          watches Mary.\n\n<b>          HORUS\n</b>          Mary?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          33.\n</b>\n<b>          MARY\n</b>          Yes.\n\n<b>          .HORUS\n</b>          I... had no idea.\n\n<b>          MARY\n</b>          (on the TV)\n          What could you do?\n          Horns - hat in hand, goes to the door. He wants to stay.\n\n<b>          HORUS\n</b>          (opens door)\n          Good thing he was there. I don't know\n          what I'd do... if you...\n          Mary does not hear him... until the door SHUTS behind her. She\n          turns to face an empty room.\n\n<b>          MARY\n</b>          Coffee's by the... door.\n\n<b>          (GUILTY)\n</b>          Horus?\n\n<b>          INT. BROWNSTONE - NIGHT\n</b>\n          A room, a place we don't know. It's dark save the street light\n          outside. A rhythmic POUNDING reverberates through this darkness.\n          More intense it becomes.\n          And then a high-pitch GASP. Two individuals, man and woman,\n          stumble into view - their silhouettes obscure the window.\n          They're locked at the hips, pumping away like high-revving\n          pistons.\n          For a second, light dances off the woman's aroused face: it's\n          Veronica.\n\n<b>          VERONICA\n</b>          (a her voice trembles)\n          Oh god.\n          The man surfaces from her cleavage for air, his face wet with\n          sweat and saliva. He brushes his cape away from his arm.\n          Veronica uncoils yet another orgasm, her back arched, her\n          breasts beckoning at ceiling.\n          Quite abruptly, he lets her go. Rights his pants. Unlatches the\n          window. She paws after him.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          34.\n</b>\n<b>          VERONICA (CONT'D)\n</b>          What'd I do?\n\n<b>          HANCOCK\n</b>\n<b>          (DEJECTED)\n</b>          'Nothing. I'm sorry.\n          And with that, he floats out into the night.\n\n<b>          VERONICA\n</b>          (dazed; after him)\n          Hancock.\n\n<b>          EXT. STREET - NIGHT\n</b>\n          Horus. His walk. Unaware of everything but the storm inside his\n          head.\n          He crosses an alley. A band of THUGS, neighborhood kids of\n          malcontent, surprises him. And. versa. They recoil at his\n          uniform, his gun.\n          They quickly realize that he's rent-a-security.\n          The leader speaks first - he's SCARPO (25), as tough as a steel-\n          belted radial. The others regroup their DRUGS.\n\n<b>          SCARPO\n</b>          Nutri-cop.\n          Horus keeps walking.\n\n<b>          SCARPO (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Look like the Man. Walk like the Man.\n          Shit, ain't half the Man.\n\n<b>          OTHERS\n</b>          Ain't half the Man.\n          Horus simply walks away.\n\n<b>           CUT TO:\n</b>\n<b>          EXT. ALLEY - NIGHT\n</b>\n          A streetlight HUMS. Blinks - revealing a deserted alley in'\n          sporadic intervals. Garbage, etc.\n          A slight drizzle shimmers pass the streetlight. Pelts a soulful\n          Hancock below - he moves through the gray dreariness in\n          solitude.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          35.\n</b>          He reaches behind his e. withdraws a box of cigarettes.\n          Taps himself a stick.\n\n<b>          VOICE (O.S.)\n</b>          How about spreading some of that joy?\n          Hancock turns and faces a young HOODLUM, scraggly in his own\n          slimy kind of way.\n          In a huff, he shoves Hancock up against the building. Presses a\n          gun to Hancock's temple.\n\n<b>          HOODLUM\n</b>\n<b>          (PSYCHOTIC)\n</b>          Better yet, why don't I just take it...\n          Hancock - enraged. In a caffeinated blink, he has the Hoodlum by\n          the throat via one arm, the gun with the other.\n\n<b>          HANCOCK\n</b>\n<b>          (SUPER-PSYCHOTIC)\n</b>          What are you thinking?\n          The Hoodlum notices that he's dangling a foot off the ground -\n          one of his SNEAKERS remains in its spot from the swift jolt.\n          The other sneaker teeters on his one foot... and falls to the\n          pavement.\n\n<b>          HOODLUM\n</b>          (fuck me)\n          Shit...\n\n<b>          HANCOCK\n</b>          What are you thinking?!\n          Hancock wrests the gun from his hand. Places it into his own\n          mouth. FIRES two slugs inside. The Hoodlum FREAKS.\n\n<b>          HANCOCK (CONT' D )\n</b>          Huh?!\n          Takes the smoking gun out of his mouth. Shoves it up the-\n          Hoodlum's nose.\n\n<b>          HANCOCK (CONY' D)\n</b>          Want to see brain? Huh?!\n          Sticks the gun back into his mouth. FIRES another shot inside.\n          Takes it out and this time - jams it into the Hoodlums mouth.\n          The Hoodlum proceeds to urinate in his pants.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          36.\n</b>\n<b>          HOODLUM\n</b>          (with his mouth full)\n          Please, mister. I got a baby coming.., a\n          wife. I got student loans...\n          Hancock - intense.\n          Is this getting through?\n\n<b>          HOODLUM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          please. Have a heart, mister.\n          Hancock - the fire inside subsides. Cools to a rational state.\n          He lowers the. Hoodlum.\n          He spits the three SLUGS into his hand. Deposits them in the\n          Hoodlum's breast pocket. Walks away.\n\n<b>          INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          In the closing hours of business, employees pell-mell about in\n          preparation for departure.\n          A group of LADIES form around a display T.V., taking in with\n          frothy wetness every inch of Hancock's footage. They gasp\n          amongst themselves.\n          Horus enters the picture, jacket and thermos. He notices the TV -\n          it's like he can't escape the good news.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          The TV set.\n          More news on the day's activities. Mary sits mesmerized on the\n          sofa, holding a dish she had planned to dry.\n          Aaron surfaces from the hallway, lured out by the TV He comes up\n          behind Mary - his black eyes on the news.\n\n<b>          MARY\n</b>\n<b>          (SURPRISED)\n</b>          You're still up.\n\n<b>          AARON\n</b>          Can't sleep.\n          He rolls over the sofa, next to his mother.\n          They watch VIDEO clips of the foiled bank heist: the crashing\n          Chevy, the aerial maneuvers, the sheer invincibility of this\n          man.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          37.\n</b>\n<b>          AARON (CONT' D)\n</b>\n<b>          (IMPRESSED)\n</b>          That's him?\n\n<b>          MARY\n</b>          There's something about him... I don't\n          know.\n          A female REPORTER concludes the footage...\n\n<b>          REPORTER\n</b>\n<b>          (FAINTLY)\n</b>          And so we ask... who is this man?\n          Speculation abounds - government super-\n          experiment, an aberration of nature, or\n          extraterrestrial renegade? Who are you?\n          Where are you now, superguy? Call me.\n\n<b>          (SMILES)\n</b>          We'll get together. Have a drink.\n\n<b>          INT. BAR - NIGHT\n</b>\n          HADES - a smoky bar in the armpit of town.\n          NEON beer signs. POOL tables. CIGARETTE machines. This is home\n          to mean people, tough guys - children of a fucked-up god.\n          We cut through the nicotine air to find the bar. A figure\n          hunches on the far end, smoking. Popping vodka like mountain\n          water in Dixie cups.\n          It's Hancock and his trenchcoat. The long day wears heavy on his\n          face - those perpetually red eyes, the horror they've seen.\n\n<b>          HANCOCK\n</b>\n<b>          (MUTTERING)\n</b>          What he's got to do... a man's got to do\n          it.\n\n<b>          EXT. BAR - NIGHT\n</b>\n          Hancock stumbles out, incognito, frazzled under his guise. Up\n          above, the sky - so dark under the storm clouds.\n          We HEAR commotion in the side alley. And so does Hancock. He\n          peers into the alley.\n          There, by a lighted PHONE BOOTH, a WHORE is fending off a horny\n          JOHN. Hancock simply watches she drives her knee between his\n          legs. He drops. SQUEALS like a little girl.\n          The John finds a two-by-four in the dirt. He reaches for it...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          38.\n</b>          A COUGH stops him - it's Hancock and he discourages further\n          violence.\n          Up and out of the alley, the John flees - tail, between his\n          legs.\n          A long stare ensues - Hancock and the Whore, looking into each\n          other's eyes for answers.\n          The Whore approaches him. Touches his face - studies it. Moves\n          it into the light.\n\n<b>          WHORE\n</b>          (the sage)\n          You've been to Hell, it looks. And you're\n          tired...\n\n<b>          (BEAT)\n</b>          and in need.\n          Hancock - his eyes agree.\n          The Whore lifts her skirt, reaching into her panties. She takes\n          out a MATCHBOOK.\n          Hands it to him.\n\n<b>          WHORE (CONY' D)\n</b>          My business card.\n          (to the phone booth)\n          My office.\n          Hancock inspects the matchbook - 555-GINA, etched inside.\n\n<b>          HANCOCK\n</b>\n<b>          (GEENA)\n</b>          Gina.\n\n<b>          WHORE\n</b>          (correcting; vaGINA)\n          Gina.\n\n<b>          CUT TO:\n</b>\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Aaron's room, his nightlight the only source of light. Mary sits\n          on the bed, by her son.\n\n<b>          AARON\n</b>          Don't.\n\n<b>          MARY\n</b>          Just a quick one.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          39.\n</b>\n<b>          'AARON\n</b>          Don't 3Â±119.\n\n<b>          MARY\n</b>          I want to.\n\n<b>          AARON\n</b>          Mom.\n\n<b>          EXT. SKY - NIGHT\n</b>\n          From the black night - a dark figure plummets, caroms off the\n          side of a building, strikes the metal fire-escapes, crashing\n          into the trash cans below.\n          Hancock stumbles from the wreckage, the garbage. Falls. He leans\n          against the building, glazed over with drunkenness.\n          He turns to the only source of light that of a building across\n          the street: KILLYBEGS TEXTILES, looming above the rest. Boarded-\n          up windows indicate abandonment - an urban relic.\n          He stares at the building - perhaps sparing more attention than\n          we think it deserves.\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Mary swallows. Starts in on the tune.\n\n<b>          MARY\n</b>          \"Once there was a way, to get back\n          homeward. Once there was a way, to get\n          back home.\"\n\n<b>          AARON\n</b>          Oh, mom.\n\n<b>          MARY\n</b>          Shut up.\n\n<b>          EXT. ALLEY - NIGHT\n</b>\n          There, on his ass, his head a raging inferno - Hancock listens,\n          as if he can hear.\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Aaron, succumbing to his mother's song - his lids flutter.\n\n<b>          MARY\n</b>          \"Sleep pretty darling, do not cry. And I\n          will sing a lullaby...\"\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          40.\n</b>          Mary as her voice carries...\n\n<b>          EXT. ALLEY - NIGHT\n</b>\n          Something overcomes this fevered superman. He begins to unravel.\n          A calm consumes him. Tames him. It could be Mary's voice - maybe\n          he can hear it, and then maybe not.\n\n<b>          MARY (V.O.)\n</b>          \"Golden slumber fills your eyes. Smiles\n          awake you when you rise.\"\n          Hancock wavers on consciousness - quite unlike him.\n\n<b>          MARY (V.O.) (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          \"Sleep pretty darling, do not cry. And I\n          will sing a lullaby...\"\n          And like that, a seamless fade into peace - he sleeps.\n\n<b>           CUT TO:\n</b>\n<b>          EXT. STREET - DAY\n</b>\n          Erratic traces of an urban landscape JAG about.\n          Aaron's distorted view of his neighborhood comes sharp and in\n          flashes as he is pursued by his tormentors.\n          Spengler. Erlick. Perceval. They chase him from behind, HOOTING,\n          taunting poor Aaron - they're out for blood.\n          Aaron cuts into an alley, lungs pumping...\n\n<b>          EXT. ALLEY - DAY\n</b>\n          .. but a brick wall stares him down, providing no exit. He\n          swallows hard.\n          FOOTSTEPS approach, just seconds away. Close on Aaron, as blood\n          drains from his face. His eyes dash for a garbage CAN - but is\n          there time?\n          Spengler. Erlick. Perceval. They can smell their prey.\n\n<b>          ERLICK\n</b>          He's not going anywhere.\n\n<b>          SPENGLER\n</b>          'Less he can walk through wall.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          41.\n</b>\n<b>          ERLICK\n</b>          Fuck... squeeze through brick.\n\n<b>          PERCEVAL\n</b>          (just arriving)\n          Let's rock it up.\n          They turn the corner, attack mode. Aaron, nowhere in sight. Just\n          the brick wall and a trash can.\n          They converge, baffled. Erlick inspects the solid wall. Spengler\n          scratches his head. But'Perceval's no fool. He spots the trash\n          can.\n          He motions the fellas over. They circle the can. A beat. They\n          ATTACK... an empty can. No one inside. Nothing.\n          That's because above them, no strings and no cables, Aaron\n          hovers - under Hancock's capable arm.\n          In mid-air, they hang for a second. Then, Hancock takes them\n          away.\n\n<b>          EXT. SCHOOLYARD - DAY\n</b>\n          Mary stands at the designated pick-up spot, pacing like her\n          bladder's going to break.\n\n<b>          MARY\n</b>          (checking watch)\n          No... no... no!\n\n<b>          EXT. ROOFTOP - DAY\n</b>\n          A secluded view of the city, high above. Hancock, Aaron under\n          his arms, rides a light breeze - and then lands.\n          Aaron scampers away. Turns and faces the man.\n          Hancock examines the boy's face, the black eyes. He shakes his\n          head. Disappointed.\n          He reaches for his belt. Pulls out a cigarette. Lights it.\n\n<b>          HANCOCK\n</b>          You smoke?\n\n<b>          AARON\n</b>          What?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          42.\n</b>\n<b>          HANCOCK\n</b>          Of course you don't. Nothing but a kid.\n          (beat; takes a puff)\n          Smoke no evil.\n          Hancock moves over to Aaron, now backed in a corner.\n\n<b>          HANCOCK (CONT'D)\n</b>          (re: cigarette)\n          Ever curious... .what it's like?\n          Aaron shakes his head.\n\n<b>          HANCOCK (CONT'D)\n</b>          (hands it to.him)\n          Go on... give it a try. One time. Won't\n          kill you. Once.\n          Aaron under pressure, acquiesces. He takes the stick. Sucks on\n          it. Doubles over, coughing.\n\n<b>          HANCOCK (CONT'D)\n</b>          Good, huh? Tastes like compost... your\n          first stick. Then, after a few more... it\n          starts getting this. flavor. A little\n          nicotine buzz. A while passes and all of\n          a sudden, it's as sweet as candy. Only\n          now, it takes a whole pack to get\n          there.., and you won't settle till your,\n          mouth's as sweet.\n          Hancock takes another cool drag - Mr. Wisdom waxing\n          philosophical.\n\n<b>          HANCOCK (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          From manure to pure cane sugar. That's\n          change. Today... you're a boy. Tomorrow,\n          Mr. Penis comes knocking. Shakes your\n          hand. Takes you for a walk... and tells\n          you about life's simple pleasures. You're\n          a man. And you don't look back..\n\n<b>          (BEAT)\n</b>          You see... things evolve. Nothing is\n          wholly inert. A step in any direction...\n          you're walking into pockets of evolution.\n          That is living... taking those steps. And\n          change. Can start by changing some\n          principles.\n          Blank best describes Aaron's face.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          43.\n</b>\n<b>          AARON\n</b>          Principles?\n\n<b>          HANCOCK\n</b>          Principles. Here's one; very simple. Just\n          about all you need to know: a man's got\n          to do what a man's got to do.\n          (beat; smokes)\n          I look at your face, the shiners. You\n          took a shove and you let it go clean. Not\n          good. That's a formula for future\n          abuse... an invitation to the loser's\n          dance. Letting it go. Walking away.\n          ,(shakes head)\n          Bad policy. Won't be long 'fore you're\n          running, looking for a place to hide.\n\n<b>          AARON\n</b>          What am I suppose to do?\n\n<b>          HANCOCK\n</b>          You do what is necessary.\n\n<b>          AARON\n</b>          I wanted... there were three of them.\n\n<b>          HANCOCK\n</b>          What is necessary.\n\n<b>          (HEAT)\n</b>          Let me tell you something, kid. There was\n          this infantry unit, you see... badly\n          outnumbered.\n          (thinks about it)\n          Wait, let me put it in kid terms. So you\n          relate, OK? There's a fox, you relate? A\n          fox and he's walking through what, the\n          woods, the forests, right? Next thing the\n          fox knows, he's staring down a pack of...\n          hounds. Bloodhounds. And there's this\n          chase, the fox's running his ass off,\n          over boulders and through streams and,\n          but the damn hounds are still on his\n          tail. Finally the fox comes to this\n          cliff, a precipice... and it's what, a\n          seven hundred foot drop onto jagged\n          rocks. He's in trouble 'cause the hounds\n          are closing in and they're going to tear\n          him to pieces. So what does he think...\n          \"I jump and I die for sure. I stay,\n          confront them and I'll get my ass\n          butchered.\" Decision time. He thinks,\n          \"stay and least I'd have something, a\n          chance.\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          44.\n</b>\n<b>          HANCOCK (CONT'D)\n</b>          To slip away, maybe.\" The fox decides to\n          go down fighting, make a stand. Right?\n\n<b>          (BEAT)\n</b>          The hounds come. What do you think\n          happens?\n\n<b>          AARON\n</b>          (thinking about it)\n          He gets away.\n          Hancock inhales what's left of his cigarette. Blows smoke.\n\n<b>          HANCOCK\n</b>          No. The fox gets his ass kicked and\n          some... I mean ripped apart by the dogs,\n          like cheap fabric.\n\n<b>          AARON\n</b>          What're you saying?\n\n<b>          HANCOCK\n</b>          But you know, when the last hound was\n          through with him,-and he's walking away,\n          he hears this noise. It's the fox and\n          he's muttering something under his\n          breath... words. The dog goes over. Gets\n          up close. To hear what he's saying. You\n          know what the fox's saying... just before\n          he keels off?\n          Aaron - negative.\n\n<b>          HANCOCK (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Now he's gurgling, choking on his own \n          blood, right? A massacre. The fox's lying\n          next to his entrails, you know... and you\n          know what he says?\n          (raises his fist in the air)\n          \"No regrets.\"\n\n<b>          AARON\n</b>          What?\n\n<b>          HANCOCK\n</b>          No regrets. You make a decision and you\n          stick to it. Like a man's got to do. And\n          \"no regrets.\"\n          Aaron - submitting it to memory.\n\n<b>          AARON\n</b>          Why're you telling me all this?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          45.\n</b>\n<b>          HANCOCK\n</b>          (a beat to think)\n          Look at it this way... I got to do what I\n          got to do.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. STREET - DAY\n</b>\n          Through the street darts Mary, eyes berserk in search for herher\n          son. She looks at her watch. And up... up ahead, by steps\n          apartment - Aaron, levitating in air.\n          Hancock explains this defiance of gravity. He gently lowers\n          Aaron on the sidewalk, before his mother.\n          She beckons him. Like a shield, she envelops him with her arms.\n          She stares up at Hancock - her eyes, stricken with fear. Or\n          possibly, they were awestruck.\n\n<b>          .CUT TO:\n</b>\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Horus, in his bed - smothered in slumber.\n          He begins to stir, wrestling some unseen dream. He wakes, in\n          defeat.\n\n<b>          INT. LIVING ROOM - DAY\n</b>\n          Close on a TV set, featuring a COMMERCIAL - in mid-hype. A\n          portly man states his purpose.\n          His name tag reads - DR. HOLE.\n\n<b>          DR. HOLE\n</b>          at the Hole Institute, our\n          experienced staff and cutting-edge\n          technology means you need not spend\n          another day in discomfort from\n          hemorrhoidal flare-ups. Also, for anal\n          fissures, warts, and secondary yeast\n          infections, the institute is your\n          complete rectal service clinic.\n\n<b>          (BEAT)\n</b>          And remember, I'm not just the Hole\n          Institute spokesperson. I'm also a\n          client.\n          As Dr. Hole proceeds to exhibit an enlarged PHOTOGRAPH of his\n          hemorrhoidal tissues, the TV channel changes. A NEWS program, in\n          progress.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          46.\n</b>          On the living room sofa squats. Hancock, remote in hand.\n\n<b>          REPORTER (O.S.)\n</b>          . more.on the neighborhood robberies in\n          our next hour.\n\n<b>          (BEAT)\n</b>          World news, today. Hundreds are believed\n          dead when an explosion ripped through a\n          crowded market place in...\n          Hancock staring into footages of bedlam, bloodshed. From the TV\n          set, maternal CRIES spew forth grief and anguish.\n          Hancock grabs the remote. Fumbles around for the power button.\n          He pumps the volume instead - the WAILS intensify his state of\n          panic, pain.\n          CLICK. Mary - by the tube, switches off the mayhem. She studies\n          his reaction, now marked with relief.\n\n<b>          MARY\n</b>\n<b>          (SAVIOR)\n</b>          Are you OK?\n\n<b>          HANCOCK\n</b>          I'm sorry.\n\n<b>          MARY\n</b>\n<b>          (NERVOUS)\n</b>          I came in to... hope you like chicken.\n          Hancock nods, watching Mary as she retreats into the kitchen. He\n          continues to stare - at Mrs. Longfellow, in frenetics, prepping\n          for dinner.\n          She catches him looking... looking surreal, this superman, there\n          on her sofa.\n          A calm, while they stare. And then...\n\n<b>          AARON (O:S.)\n</b>          Table's done.\n          Mary turns to Aaron, offscreen.\n\n<b>          MARY\n</b>          Glasses.\n\n<b>          AARON (O.S.)\n</b>          Geez.\n          Horus enters from the hallway, disheveled from sleep. He does\n          not see the superman on his sofa. He continues into the kitchen.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          47.\n</b>          Mary stares at him. Aaron appears, also staring at him. Horus\n          does a \"what?\" with his shoulders. Mother and son gesture behind\n          him.\n          He turns and beholds: Hancock,' rising in full garb, arm\n          extended. All eyes on Horus - befuddled.\n\n<b>          MARY\n</b>          You know Hancock?\n\n<b>          AARON\n</b>          He comes for dinner.\n          Close on Hancock. Close on Horus.\n\n<b>          HANCOCK\n</b>          Man of the house?\n\n<b>          INT. KITCHEN - NIGHT\n</b>\n          Dinner is served. All the key players, present. Horus sits\n          facing his son - dethroned by the distinguished visitor. Mary\n          serves.\n\n<b>          MARY\n</b>          (to Hancock)\n          Which piece would you like?\n\n<b>          HANCOCK\n</b>          Breasts, please.\n          Horus, watching everything - Mary and her every blush.\n\n<b>          AARON\n</b>          You want milk?\n\n<b>          HANCOCK\n</b>          No. It gives me gas. Thank you.\n          A beat - as everyone visualizes a superFART.\n\n<b>          AARON\n</b>          It makes mom fart, too.\n          Mary CHOKES on her food.\n          Drops her fork. She maneuvers, in the allotted space, for the\n          utensil - and finding difficulty.\n          Hancock grabs the table, one arm. Lifts it off the carpet and\n          above everyone's head. Mary, startled, impressed, all of the\n          above. She picks up the fork.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          48.\n</b>          Horus - a chicken leg dangling from his lips, in mid-chew,.\n          looking impotent.\n\n<b>          AARON (CONT'D)\n</b>          Good arm.\n\n<b>          INT. KITCHEN - NIGHT\n</b>\n          Later.\n\n<b>          HANCOCK\n</b>          not about the labor... or the love of\n          it.\n          (beat; we've heard this before)\n          .It's about responsibility... with what is\n          empowered in you. The gift of might.\n          Might to.do what? Exploitation, because\n          you can? Or a different path. To purvey\n          justice. To correct the ills of man...\n          because I can.\n          Faces of profound confusion - Mary and Aaron. But they are\n          charmed, his words secondary to his charisma.\n          Horus, the quiet observer, observes.\n\n<b>          HANCOCK (CONY' D)\n</b>\n<b>          (CONTINUING)\n</b>          so, a job? Yes. And no. It's about...\n          essence. The essence of the man... not\n          his clothes. It's the job. Take away the\n          arm,. the leg..., his bodily possessions\n          but not his trade, his profession. That\n          case, you strip him of what he is... a\n          man.\n          Horus a firm grasp of the concept.\n\n<b>          HANCOCK (CONY' D)\n</b>          What line of work are you in, Mr.\n          Longfellow?\n\n<b>          HORUS\n</b>          (clearing throat)\n          Oh, it's not like you... what you do or\n          anything. A department store over on\n          Third.\n\n<b>          MARY\n</b>          Horus is in the securities business.\n\n<b>          HORUS\n</b>          I'm a security guard. I'm just...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          49.\n</b>          Aaron rises from the table. Goes over to the fridge.\n\n<b>          MARY\n</b>          It's a large department store, over a\n          couple million in merchandise... stereos,\n          jewelry. On three floors.\n\n<b>          HORUS\n</b>          It's a night job. I sit around.\n\n<b>          HANCOCK\n</b>          You're a security guard. You keep the\n          state of things. It's a job. You do it.\n\n<b>          (PAUSE)\n</b>          We're in the same business.\n          Aaron returns with the ketchup bottle.\n          A frozen moment while Horus ponders the implications. He stares\n          at the BOTTLE.\n\n<b>          HANCOCK (CONT'D)\n</b>          Aaron, could you show me the restroom?\n          Aaron points first door in the hall.\n\n<b>          AARON\n</b>          On the right.\n          He leaves to find bladder relief - leaving Horus to his family.\n\n<b>          AARON (CONT' D)\n</b>          What do you think, mom?\n\n<b>          MARY\n</b>          (in a whisper)\n          Horus, what do I do?\n\n<b>          HORUS\n</b>          (at his watch)\n          I need to get ready.\n\n<b>          AARON\n</b>          mom?\n\n<b>          MARY\n</b>          (to Horus)\n          What do I do with him... when you're\n          gone? I have to entertain this super...\n          She doesn't finish her... A NOISE interrupts her - seizes the\n          participants.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          50.\n</b>          It comes from the bathroom - the sound of PISS, urine versus the\n          surface tension.of water.\n          LOUD. WET. A turgid firehose at full blast. The force of\n          urination grips the room - as powerful as the penile mechanism\n          from which it is generated.\n          The toilet FLUSHES. Hancock returns to a'room of astonished\n          faces - mouths agape.\n\n<b>          INT. KITCHEN - NIGHT\n</b>\n          Later,. by a few minutes.\n\n<b>          HANCOCK\n</b>          (lost; sombre)\n          and you could see the flames, through\n          the storm... I get there, the vessel's\n          all over, spread across three miles of\n          South Pacific. Bodies floating in the\n          water, shoes, kids who'd thought it some\n          routine reconnaissance joyride. Turns\n          out, the only one alive was the captain,\n          up against a buoy... crying 'cause he\n          didn't go down with his men... and he's\n          got to live with it.\n\n<b>          (BEAT)\n</b>          Sprayed his brain all over the dashboard\n          in a parking lot a couple months after. A\n          good man...\n          (at Aaron)\n          . did what he had to do.\n          A brief moment while the graphics sink in. No one talks. Aaron's\n          smitten. Mary, a mixture of repulsion and fascination.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          In the kitchen, in the sink, stacks of plates indicate that\n          dinner is through.\n          Company has moved into the living room, with the exception of\n          Horus. Aaron kneels besides Hancock. Mary, across from him.\n\n<b>          AARON\n</b>          (making a fist)\n          I wanted to kill him.\n\n<b>          MARY\n</b>          Aaron.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          51.\n</b>\n<b>          AARON\n</b>          I want to deck him, just once. So bad I\n          tense up... like I can't even move.\n\n<b>          MARY\n</b>          (to Hancock)\n          He comes home crying.\n\n<b>          AARON\n</b>          Did not. Not crying. It was pissed-off.\n\n<b>          HANCOCK\n</b>\n<b>          (REACTS)\n</b>          No... there's no shame in it. The crying.\n          It's relief...\n          (to Mary)\n          we're older and we don't remember\n          when... we go, \"God, when was the last\n          time?\" Maybe it's me. It's more an\n          effort, now. Takes more pain... more\n          blood. Like it's, do you have the time\n          anymore? Even to look back and recall a\n          moving experience. To be moved.\n\n<b>          (AARON)\n</b>          By rage. Hurt.\n\n<b>          (MARY)\n</b>          By love.\n\n<b>          (BEAT)\n</b>          But if you have to remember the last time\n          something touched you... you've missed it\n          - you've forgotten how to cry.\n          Horus enters the room, Mr. Security Guard. He observes this\n          magic Hancock works over his wife and kid - a talent whose\n          nature he has yet to comprehend.\n          Horus opts to not disturb their trance. He makes for the door.\n          Hancock - holds him accountable.\n\n<b>          HANCOCK (CONT'D)\n</b>\n<b>          (AWARE)\n</b>          Mr. Longfellow. I'll be leaving, too.\n\n<b>          HORUS\n</b>          Oh, I... you don't have to leave. I don't\n          want to interfere. I have work.\n\n<b>          MARY\n</b>          (the original sin)\n          Oh, I forgot to make coffee.\n          She rushes into the kitchen. Horus stops her.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          52.\n</b>\n<b>          HORUS\n</b>          It's all right, Mary. I'm late.\n\n<b>          MARY\n</b>          No, I'll make it right now.\n\n<b>          HORUS\n</b>          I don't have time. I'll grab some on the\n          way. Thanks.\n          Mary accepts it - not entirely guilt-free.\n\n<b>          HORUS (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          I don't want to interrupt. Please don't\n          let me stop you.\n\n<b>          HANCOCK\n</b>          No, I need to go.\n          (at' Mary and only Mary)\n          The last time I had a meal... an evening\n          like this, I was... it was too long ago.\n          I appreciate your kindness.\n\n<b>          MARY\n</b>\n<b>          (AWKWARD)\n</b>          Please... you're welcome, here. Anytime.\n          Horus watches everything - watching her chest heave under\n          Hancock's every word, watching his wife slip away.\n\n<b>          HANCOCK\n</b>          Aaron. Tomorrow. After the bell. I'll\n          drop by after school. See how you're\n          doing.\n\n<b>          AARON\n</b>\n<b>          (SMILES)\n</b>          Yeah.\n          Horus watches this - his son slipping away.\n          The two men leave, Hancock ushering Horus out first.\n          Mary closes the door behind them. Leans against the door and\n          EXHALES - a sign of relief, of despair, or, of a heart raging\n          wild.\n          We just .don't know.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          53.\n</b>\n<b>          EXT. APARTMENT - NIGHT\n</b>\n          The two men appear from the entrance, shoulder to shoulder -\n          sort of. They enter the street.\n\n<b>          HORUS\n</b>\n<b>          (POINTING)\n</b>          I'm this way.\n          Hancock points the opposite way.\n\n<b>          HANCOCK\n</b>          Need a lift?\n\n<b>          HORUS\n</b>          It's a short walk.\n          Acknowledged.\n          An awkward beat while they stare at each other...\n          . until finally, they go their separate ways - Horus via walk\n          and Hancock, with effortless grace,, via flight.\n          From the sidewalk and awe-stricken - Horus watches Hancock merge\n          into the blackness. A look of dread squats on his face.\n\n<b>          CUT TO:\n</b>\n<b>          INT. DONUT SHOP - NIGHT\n</b>\n          The white fluorescent of the neighborhood donut shop. Donuts.\n          Coffee. Yellow formica. Etc..\n          A frazzled Korean woman, SOON-YI (60) watches over HOLLY (19),\n          the trainee behind the cash register.\n          Officer Rutger and Adams sip Joe in the corner booth.\n\n<b>          ADAMS\n</b>\n<b>          (MID-CONFESSION)\n</b>          bleeding heart dyke, I know not what.\n          Fuck martyrdom. Bottom line, Sheila won't\n          put out...\n\n<b>          RUTGER\n</b>          No.\n\n<b>          ADAMS\n</b>          . won't blow me...\n\n<b>          RUTGER\n</b>          Shit stinks.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          54.\n</b>\n<b>          ADAMS\n</b>          says I'm keeping poontang on the\n          side.\n\n<b>          RUTGER\n</b>          D'fuck she know? Shit smears, man.\n\n<b>          ADAMS\n</b>          Games. I don't need it.\n\n<b>          RUTGER\n</b>          Fuck games, fuck dames.\n\n<b>          ADAMS\n</b>          I got a'wife, I don't need the\n          aggravation...\n\n<b>          RUTGER\n</b>          Take a donut hole.\n          The entrance. Horus wanders in, lost in this environment. He\n          finds the front counter. The cops watch him.\n\n<b>          HORUS\n</b>          A cup of coffee, please.\n          Holly takes the order. Leaves to fetch it.\n\n<b>          ADAMS (O.S.)\n</b>          Longfellow.\n\n<b>          HORUS\n</b>          (turns; with dread)\n          How are you, John?\n\n<b>          (RUTGER)\n</b>          Frank?\n\n<b>          ADAMS\n</b>          (god, I'm funny)\n          Observe anything worth recording, lately?\n\n<b>          HORUS\n</b>          You know... things are slow.\n\n<b>          RUTGER\n</b>          Not for Samsone Electronics on fifth. Got\n          hit on Thursday.\n\n<b>          ADAMS\n</b>          The guard, he was cut-up like a piece of\n          meat.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          55.\n</b>\n<b>          RUTGER\n</b>          Anything go wrong, you make sure you\n          notify us, the authorities. No heroics\n          without a license. You know the\n          procedure.\n          Horus - he knows the procedure.\n\n<b>          ADAMS\n</b>          Of course he does.\n\n<b>          RUTGER\n</b>          Of course.\n          Holly returns with the coffee. Hands it to Horus - free of\n          charge. From the back, Soon-yi intervenes...\n\n<b>          SOON-YI\n</b>          He no have gun. Not copper.\n\n<b>          HOLLY\n</b>          Oh, I thought...\n\n<b>          SOON-YI\n</b>          He regular guy. Sixty-five cents for\n          regular.guy.\n          Horus - somebody shoot him.\n\n<b>          INT. AARON'S BEDROOM - NIGHT\n</b>\n          Mary's folding clothes by the dresser, busy with thought. Aaron\n          squats on the bed, his brain going a mile a minute. He plops\n          back against the bed. Brings his hand up to his face. Makes a\n          fist. Thinking. Wondering.\n\n<b>          MARY\n</b>          What're you doing?\n          She's taken by this scene.\n\n<b>          AARON\n</b>          (releases fist)\n          Thinking.\n          Mary goes over to the bed. Sits.\n\n<b>          MARY\n</b>          About him?\n\n<b>          AARON\n</b>          No. Not really. Are you?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          56.\n</b>\n<b>          MARY\n</b>          No.\n          They're lying through their collective teeth.\n\n<b>          AARON\n</b>          Me neither. I was thinking.., about\n          tomorrow.\n\n<b>          MARY\n</b>          Go to sleep. You know what dad says.\n          Tomorrow always feels better...\n\n<b>          AARON\n</b>          I know, mom... after a good night sleep.\n          He says that but he's the one working\n          every night. Does that mean he never\n          feels better? He's always feeling\n          terrible?\n\n<b>          MARY\n</b>\n<b>          (AMUSED)\n</b>          Go to bed, anyway.\n          She tucks him-in.. Turns off the lamp. And as she's out the\n          door...\n\n<b>          AARON\n</b>          Mom?\n          She turns.\n\n<b>          AARON (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Who is Mr. Penis?\n\n<b>           CUT TO:\n</b>\n<b>          EXT. SHEEPSHEAD - NIGHT\n</b>\n          Time lapses into the late hours. This town experiences a serene\n          moment - a peacefulness which says that this as night as a night\n          will be.\n\n<b>          INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          Looking down aisles of merchandise - not a trace of life and not\n          unlike a cemetery.\n          All is dead, with the exception of FOOTSTEPS - shoes pacing\n          linoleum. It's Horus, on duty. His flashlight leads the way...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          57.\n</b>          Outside, the SIRENS of police vehicles charge by - real men en\n          route to real work.\n          Horus watches them from the window - like a kid who can't come\n          out to play.\n          He turns to look across the floor - Roheim, against a chair,\n          watching the NEWS on a big-screen TV\n\n<b>          NEWS\n</b>          (re: Hancock)\n          .the trains seemed imminently bound for\n          a catastrophic collision when this...\n          this superguy...\n\n<b>          ROHEIM\n</b>\n<b>          (IMPRESSED)\n</b>          Man. I bet he gets laid.\n          Horus - he looks terrible.\n\n<b>          EXT. ROOFTOP - NIGHT\n</b>\n          It's dark out here in the night. On the roof. Overlooking the\n          community, the Longfellow's apartment building... and Mary's\n          bedroom.\n          From here, we can SEE her - entering from the hallway. She\n          disrobes down to bare back...\n          And from this darkness, the RED tip of a burning cigarette GLOWS\n          into view. Hancock watches from here, the cigarette BLAZES back\n          towards his face intense.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. SOMEWHERE - NIGHT - DREAM SEQUENCE\n</b>\n          A foreign TERRAIN of trees, of lakes so clear and blue.\n          They pass below us as we soar through air and mist...\n          the mist clears, thrusting us into the dense foliage of a\n          JUNGLE. We penetrate the silence\n          the silence, it fades into SONG - the silk, mellifluous\n          voice of a woman (not unlike Mary's). Her siren call beckons\n          us... takes us deeper into unknown greenery...\n          but the sound of crackling GUNSHOTS punctuate the end to\n          song. SCREAMS and CRIES rise from the smoke, women and children\n          in hysterics...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          58.\n</b>          we quicken to a frantic pace, slicing through the growth.\n          Rocket and mortar shells EXPLODE in our path, splitting trees\n          and earth...\n          . we remain undaunted... but the WAILS of suffering\n          continues...\n          until we get there, there in a clearing as smoke and debris\n          settle... and we see the remains of a lake, a,lake full of\n          BLOOD... of mangled BODIES floating like flotsam... WOMEN and\n\n<b>          CHILDREN... DEAD...\n</b>          . we SCREAM!\n\n<b>          INT. RED EYE MOTEL - NIGHT\n</b>\n          Hancock bolts from his bed - horrified, eyes cracked with red\n          veins. He is soaked.\n          The orgasmic SCREAMS of a prostitute seeps through from the\n          adjacent motel room -.the wall behind Hancock's bed trembles to\n          the rhythm of each pelvic thrust...\n          He clasps.-his ears - tormented.\n\n<b>           CUT TO:\n</b>\n<b>          INT. WATANABE'S SHOPPING EMPORIUM -DAY\n</b>\n          Roheim in his usual state of sleep. His lips mutter dialogue\n          from an unseen dream.\n\n<b>          ROHEIM\n</b>          Olga...\n          He snaps out of it...\n\n<b>          ROHEIM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          .bitch.\n          Consciousness slowly sinks in. He checks his watch, then the\n          area around him. He spots Horus - slumped in a chair, in a\n          thinking posture.\n          Horns seems lost in his own blank stare.\n\n<b>          HORUS\n</b>          (without looking)\n          Another dream?'\n\n<b>          ROHEIM\n</b>          I was talking again, huh?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          59.\n</b>          No response.\n\n<b>          EXT. WATANABE'S SHOPPING EMPORIUM - DAY\n</b>\n          A deserted street at this early hour. On the curb and by\n          themselves - Horus and Roheim, ruminating.\n\n<b>          ROHEIM\n</b>          . that look on her face, you know the\n          look, when she's almost there... makes\n          you feel like a man.\n\n<b>          (BEAT)\n</b>          Then everything gets blurry and all of a\n          sudden, it's not my arm that's around her\n          and it's not my hand that's touching her\n          and it's not even me, my body. Some guy,\n          this good-looking guy... he looks like\n          the Marlboro Man, only shirtless. And\n          so... the Marlboro Man's running his\n          fingers through her hair. And he's...\n          banging her... and her knees... by her\n          ears, you know?\n          (beat; cringing)\n          And that look on her face. That look.\n\n<b>          HORUS\n</b>          Roheim.\n\n<b>          ROHEIM\n</b>\n<b>          (CONTINUING)\n</b>          Bitch.\n\n<b>          HORUS\n</b>          Come on.\n\n<b>          ROHEIM\n</b>          (gets up)\n          Walk with me.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. APARTMENT - DAY\n</b>\n          The Longfellow's apartment.- seem from above.\n          Clyde exits the building in his morning robe., Takes hold of the\n          newspaper. Digs through it...\n          Mary and Aaron - they exit, surprising Clyde.\n          Mary gestures at Clyde, pointing an accusing finger. She seizes\n          the paper from him, sending him cowering inside.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          61.\n</b>\n<b>          EXT. SCHOOLYARD DAY\n</b>\n          Mary and Aaron - by the perimeter fence.\n\n<b>          MARY\n</b>          Have a good one.\n\n<b>          AARON\n</b>          I got to do what I got to do.\n          She watches him go -curious.\n\n<b>          EXT. SKY - DAY\n</b>\n          The sky's POV - the schoolyard. Aaron - sauntering to class.\n          Mary - turning, walking away.\n          We soar through air and mist. Circle a street below. Hover over\n          an alley. Descend from the clouds - into the depths of buildings\n          and fire escapes.\n\n<b>          EXT. STREET - DAY\n</b>\n          Mary, among other pedestrians, head homeward. Her pace say \n          she's in no hurry to get there.\n          Out of an alley and into the street - Hancock, trenchcoated,\n          inconspicuous, and in pursuit. J\n\n<b>          EXT. LIQUOR STORE - DAY\n</b>\n          Horus waits outside - hands in his pockets. He paces\n          uncomfortably.\n          Roheim exits the liquor store, already imbibing from a brown\n          paper BAG.\n          Not a word from Horus.\n\n<b>          ROHEIM\n</b>\n<b>          (POST-GULP)\n</b>          This stuff's going to kill me.\n          He gives Horus a glance. Takes another swig.\n\n<b>          ROHEIM (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          You disapprove, I know.\n\n<b>          HORUS\n</b>          No.\n\n<b>          J\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          62.\n</b>\n<b>          ROHEIM\n</b>          Sure you do. You disapprove and yet you\n          allow me to drink... to poison myself.\n          Your friend. Without a word of caution.\n          Not a word. Just take it... you take\n          everything.\n\n<b>          HORUS\n</b>          No.\n\n<b>          ROHEIM\n</b>          You're afraid to offend. You don't want\n          to be abrasive. Provocative.\n          (beat; as'Horus squirms)\n          So you suppress. Do nothing. Take it.\n          Roheim takes another gulp.\n\n<b>          HORUS\n</b>          (pulling teeth)\n          You shouldn't drink.\n\n<b>          ROHEIM\n</b>          My wife. She left a bad taste in my\n          mouth. I drink to kill-the taste.\n          Horus has no response to this.\n\n<b>          ROHEIM (CONT'D)\n</b>\n<b>          (SMILES)\n</b>          You're a good man, Horus...\n\n<b>          (BEAT)\n</b>          And you're right. This stuff's no good.\n          It's a coward's way out and I know it.\n          He gives the bottle a guilty stare. Tosses the bottle into a\n          nearby garbage can.\n\n<b>          ROHEIM (CONY' D)\n</b>          (sick of himself)\n          What the hell. I can learn to love\n          beverage.\n\n<b>          EXT. STREET - DAY\n</b>\n          Mary. Walking.\n          Hancock. Following. From across the street. Mesmerized and in a\n          world to himself.\n          He crosses. the street, failing to look both ways... BAH! A UPS\n          truck STRIKES the clueless superhero, sending him across air -\n          towards Mary.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          63.\n</b>          200 lbs. of superflesh EXPLODES into a JEWELRY display window -\n          just ahead of Mary's path. Glass showers the scene. People\n\n<b>          SCREAM.\n</b>          Hancock warbles out from the debris - his trenchcoat reduced to\n          mere tatters. He pulls a severed SLEEVE from the rubble. Looks\n          at Mary, reposed before him.\n\n<b>          HANCOCK\n</b>          (nothing happened)\n          How are you?\n          In unison, they turn to the UPS vehicle - a .mangled heap of\n          steel, STEAM billowing from its ruptured radiator.\n          Hancock shrugs a smiles.\n\n<b>          EXT. STREET - DAY\n</b>\n          Mr. Longfellow rounds the corner and ambles home. He is tired\n          and his face shows it.\n          There to make it worse - Clyde. He's back, getting at the sports\n          page on the front steps.\n          A sudden burst of outrage consumes Horus. He approaches the\n          steps with fire and...\n\n<b>          HORUS\n</b>          (burning...)\n          Clyde. Can I talk to you for just a brief\n          moment?\n\n<b>          CLYDE\n</b>\n<b>          (YAWNING)\n</b>          Not now, Longfella. I'm all blocked up.\n          Clyde heads inside - with the sports page.. He FARTS as he goes\n          in.\n\n<b>          HORUS\n</b>\n<b>          (EXTINGUISHED)\n</b>          Sure.\n\n<b>          EXT. STREET - DAY\n</b>\n          Along a street somewhere who cares - Hancock and Mary - in a\n          cool stroll. Mary holds his trenchcoat, surveying the damage.\n\n<b>          MARY\n</b>          What were you doing in the street?\n          (the trenchcoat)\n          You ripped it pretty good.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          64.\n</b>          Hancock - he's lost.\n\n<b>          MARY (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          What're you:.. how old's this thing?\n\n<b>          HANCOCK\n</b>          didn't see it coming... left myself\n          open.\n\n<b>          MARY\n</b>          It'll be all right.\n\n<b>          HANCOCK\n</b>          All right?\n\n<b>          MARY\n</b>          It's just the seams. I can sew it back.\n\n<b>          HANCOCK\n</b>          What?\n\n<b>          MARY\n</b>          (the trenchcoat)\n          This. It's just the seams.'I'll take good\n          care of it.\n\n<b>          HANCOCK\n</b>          You'll sew -it?\n\n<b>          MARY\n</b>          Yes. Me. I can. And I'll re-button it for\n          you, all right?\n          Hancock acknowledges with a smile - a slight one.\n\n<b>          MARY (CONT' D)\n</b>\n<b>          (CONTINUING}\n</b>          Are you okay?\n          No reply. He stares at her - simply.\n\n<b>           CUT TO:\n</b>\n<b>          EXT. STREET - DAY.\n</b>\n          Mary stands alone on the sidewalk, looking up at heaven. Her\n          eyes search the gray sky for signs of life.-\n          There, overhead - a DOT. It grows in size, getting closer and\n          arriving fast... and gradually, it shapes into Hancock.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          65.\n</b>          He swoops into view, straight downward. Pulls on the air brakes\n          and eases into a soft landing - by Mary's side.\n          He is wet from his flight and his hands, 'we notice, are cupped\n          together tightly.\n\n<b>          MARY\n</b>          (like a little girl)\n          Let's see.\n\n<b>          HANCOCK\n</b>          You have to be quick.\n\n<b>          MARY\n</b>          Come on, I want to see.\n\n<b>          HANCOCK\n</b>          If you blink, you'll miss it.\n          Hancock uncups his hands, releasing a billowy MASS of white\n          something - it hangs in the air, and then dissipates into\n          moisture. It showers into his open hands.\n          Mary reaches for it. Too late.\n\n<b>          MARY\n</b>          I saw it, right? A little cloud.\n          She peers into his hands - where only a pool of wetness remains.\n          And with her fingers, Mary reaches inside to feel the rain.\n          Hancock watches this - the innocence in her face, as her hand\n          touches his.\n          He stares down at her hand... at the wedding ring. Mary-pulls\n          her hand away.\n\n<b>          MARY (CONY' D)\n</b>          The water is dirty.\n\n<b>          HANCOCK\n</b>\n<b>          MARY\n</b>\n<b>          HANCOCK\n</b>          I'm sorry.\n\n<b>          MARY\n</b>          (into his eyes)\n          It's not your fault.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          66.\n</b>          Hancock looks away.\n\n<b>          MARY (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          You're tense.\n\n<b>          HANCOCK\n</b>          I've been tired, lately.\n\n<b>          MARY\n</b>          You should slow down. Rest.\n\n<b>          HANCOCK\n</b>          -So people tell me.\n\n<b>          MARY\n</b>          (heat; upon some thought)\n          It must be hard.\n\n<b>          HANCOCK\n</b>          Hard?\n\n<b>          MARY\n</b>          To always do right... do good when all\n          you want to do is rest.\n\n<b>          HANCOCK\n</b>          It's harder to not do anything. What am\n          I? It's not for me. It's for... it is\n          about people. Rest? When there is\n          despair? I cannot. I bring relief. I am\n          relief. You know that instant, that split\n          instant of time when you realize that the\n          nightmare... the totality of fear\n          itself... that it's all been a bad dream?\n          That it's safe? That is relief. The\n          infant in my arms... to the hysterical\n          mother. When you can see her face, what's\n          rest? It is self-indulgence.\n          Mary - in some advance stage of \"wow.\"\n\n<b>          MARY\n</b>          Where... who are you?\n\n<b>          HANCOCK\n</b>          It's not important who I am, Mary. Or\n          what... where I'm from. It doesn't\n          matter. I'm a man. I am every man.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          67.\n</b>\n<b>          MARY\n</b>          (sizing up his words)\n          You probably get a lot of practice\n          explaining yourself, on account of who\n          you are and what you do.\n\n<b>          HANCOCK\n</b>          Why... do you say that?\n\n<b>          MARY\n</b>          It's like, everything you say sounds...\n          so perfect. Like you rehearse them so\n          they'll be that way. I mean, not to say\n          that it's insincere...\n\n<b>          (BEAT)\n</b>          I mean, maybe it's something about you\n          but... it must be hard on you sometimes.\n          Hancock stares at his feet, perhaps reluctant to answer.\n\n<b>          MARY (CONT' D)\n</b>\n<b>          (APOLOGETIC)\n</b>          But probably not... probably..\n\n<b>          HANCOCK\n</b>          Yes...\n          (pulling teeth)\n          sometimes.\n          Mary allows the moment to sink in.\n\n<b>          MARY\n</b>          So, you never answered. Back there...\n          what were you doing in the middle of the\n          street?\n\n<b>          HANCOCK\n</b>\n<b>          (THINKS)\n</b>          I was lost...\n\n<b>          (EXHALES)\n</b>          . but I think I'm ok, now.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. ALLEY - DAY\n</b>\n          Trash cans fly. Paper, swept up and sent aflutter. We've seen\n          this before - Aaron, running for his life and the bullies in\n          pell-mell pursuit.\n          He cuts into an alley. Looses them momentarily. Finds a DUMPSTER\n          to his liking.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          68.\n</b>          Erlick. Spengler. They zoom by and with great eagerness.\n          Perceval strolls after them, too cool to sweat.\n          From the dumpster, little Aaron watches them... looks\n          relieved... until conscience kicks in. A moment to reflect, he\n          takes.\n\n<b>          AARON\n</b>\n<b>          (HANCOCK)\n</b>          \" before long, you're running, looking\n          for a place to hide.\"\n\n<b>          EXT. ALLEY - DAY\n</b>\n          Erlick and Spengler - at a dead end. Their trail leads them to a\n          metal FENCE, the alley continuing beyond it. No time wasted\n          they scale it.\n          Perceval arrives - in time to see Erlick, landing on the other\n          side. Spengler pulls himself over. Joins Erlick on the ground.\n\n<b>          PERCEVAL\n</b>          Shit, I'm not climbing this. Just combed\n          my hair.\n          Erlick and Spengler turn to him, through the metal bars. Their\n          eyes are of disbelief.\n\n<b>          PERCEVAL (CONT'D)\n</b>          What's up?\n          (checks his hair)\n          What?\n          Perceval follows their gaze behind him to Aaron, shivering\n          with clenched fists.\n\n<b>          PERCEVAL (CONT'D)\n</b>          (rolls up sleeves)\n          I just combed my hair.\n          Erlick and Spengler make for the fence, to join the fray.\n\n<b>          PERCEVAL (CONT'D)\n</b>          Don't bother. He's mine.\n          (to Aaron)\n          No biting. I hate biting.\n\n<b>          SPENGLER\n</b>          Kick his ass, Percy.\n\n<b>          ERLICK\n</b>\n<b>          (OVERLAPPING)\n</b>          Do him, Percy. He's your woman.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          69.\n</b>\n<b>          PERCEVAL\n</b>          Let's go. Let's have it. While we're\n          still kids.\n          Nothing from Aaron - just a lot of balls.\n\n<b>          PERCEVAL (CONT'D)\n</b>          Dick wad, let's go. Come on, you impotent\n          little gonad.\n\n<b>          (BEAT)\n</b>          Your mother chokes on big, hard, veiny,\n          purple-headed shlongs the size of...\n          All Aaron needs to hear. He charges - comatose.\n          And the pummeling begins. Perceval dictates the assault, landing\n          BLOWS to the face and body.\n          Aaron - doing an impression of a punching bag. He wafts at air,\n          left and right...\n\n<b>          ERLICK\n</b>          He's yours.\n\n<b>          SPENGLER\n</b>          Save some for us.\n          Someone blinks - and Aaron finds himself on the dirt, supine.\n          Perceval looms over him, silhouetted against the sky.\n          He reaches for his zipper, doing that Perceval-thing. A look of\n          recognition in Aaron's eyes - it's going to rain soon.\n          He reacts with knee-jerk reflects, administering a swift kick\n          into Perceval's peeing apparatus. A faint SQUEAL eructs from the\n          fellow's mouth. He drops like a wet tea bag.\n          Erlick. Spengler. Shock. Disbelief. Aaron gets to his feet,\n          ready to book... but he doesn't. He stays.\n\n<b>          ERLICK\n</b>          What's he doing?\n\n<b>          SPENGLER\n</b>          Kick his ass, Percy.\n          Aaron stares at them, behind the fence. Then down at Perceval\n          fetal position, mouth agape. Aaron reaches for his zipper ZIP,\n          revenge presents itself.\n\n<b>          ERLICK\n</b>          That's cold.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          ?0.\n</b>\n<b>          SPENGLER\n</b>          Kill him, Percy.\n          Aaron cranes himself over Perceval's face, over his open oral\n          orifice. Contemplates his target.\n          Aaron - to pee or not to pee...\n          ZIP. He closes his fly. Steps away.\n\n<b>          AARON\n</b>          (to the boys)\n          Don't mess with me.\n          He struts out of the alley. Shifts into a mad sprint, adrenaline\n          taking him away.\n\n<b>          CUT TO:\n</b>\n<b>          INT. BEDROOM - DAY\n</b>\n          Horus sleeps. Mary enters from the hallway, hush-hush. She moves\n          to the closet. Changes out of her clothes.\n          Not a stir from Horus - exercising stealth in his efforts to\n          watch her, watching her sweater fall to the carpet.\n          Mary stands before the closet mirror. Does a profile check. She\n          reaches for her bra... and from the mirror, catches Horus\n          staring,.\n\n<b>          MARY\n</b>          You're still up?\n          She moves behind the bathroom door. Self-conscious.\n\n<b>          HORUS\n</b>          Just get in?\n          Mary steps out of the bathroom, buttoning up her domestic\n          attire. She nods affirmatively.\n\n<b>          MARY\n</b>          Nick's market. Are you sick?\n\n<b>          HORUS\n</b>          I can't sleep.\n          She goes to the bed. Palms his forehead with her right. Palms\n          her own with the left, as reference.\n          Horus tilts his head away from her hand.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          71.\n</b>\n<b>          HORUS (CONT'D)\n</b>          Please, Mary.\n\n<b>          MARY\n</b>          You want some milk? I'll heat it up for\n          you, how about that?\n\n<b>          HORUS\n</b>          No thank you.\n\n<b>          (BEAT)\n</b>          Aaron, today? This Hancock 's picking up\n\n<b>          MARY\n</b>          Yes, he is.\n          He sits there in bed, struggling with the words. Mary continues\n          dressing - oblivious.\n\n<b>          HORUS\n</b>          He'll take him home?\n\n<b>          MARY\n</b>          Yes.\n\n<b>          HORUS\n</b>          What do we know about this man? The\n          papers... they don't have all the facts\n          about him.\n\n<b>          MARY\n</b>          What facts? He's not a hero.\n\n<b>          HORUS\n</b>          Yes. A hero. I know that...\n\n<b>          MARY\n</b>          Aaron likes him.\n\n<b>          HORUS\n</b>\n<b>          (TIMID)\n</b>          I know that maybe, I've been\n          neglectful... that I haven't been\n          there...\n          Mary does not hear him. She's at the mirror, fixing her hair.\n\n<b>          HORUS (CONT' D)\n</b>\n<b>          (SERIOUSLY)\n</b>          I'm trying... you have to know... I'd\n          like to be more... involved. Like it used\n          to be. Before we moved here.\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          72.\n</b>\n<b>          HORUS (CONT' D)\n</b>          (notices Mary, applying\n\n<b>          LIPSTICK)\n</b>          Are you going somewhere?\n\n<b>          MARY\n</b>          No. I have to start on dinner. So how\n          about that glass of milk?\n          Horus - shakes his head, annoyed.\n\n<b>          MARY (CONT' D)\n</b>          All right. Try to get some sleep.\n          With that, she's out the door.\n          Horns alone in bed, staring into the vanity mirror at his\n          wretched face.\n          He spots a brown paper BAG on the chair. Goes to inspect. Inside\n          - Hancock's tattered trenchcoat. Oy, what does it mean?\n          Horus returns to bed, distraught. He buries himself under the\n          cover.\n\n<b>          EXT. STREET - DAY\n</b>\n          Aaron races down the. last leg of his street. On the steps of his\n          apartment building - Hancock, making himself at home. Yes, a\n          cigarette smolders from his lips..\n          Hancock looks at the boy. They share a second of silence.\n          And finally, Hancock-puts out his hand - he approves. Aaron,\n          triumphant, SMACKS it for five.\n\n<b>          CUT TO:\n</b>\n<b>          INT. APARTMENT - NIGHT\n</b>\n          The dinner table. Post meal. Mid-digestion. Aaron is running off\n          at the mouth.\n\n<b>          AARON\n</b>          .o his mouth was. open and he just stared\n          up at me, it hurt that bad.\n          And while he narrates, Mary runs her fingers through his hair -\n          a mother grooming her child. Meanwhile, Horus listens concerned.\n\n<b>          AARON (CONTD.)\n</b>\n<b>          (CONTINUING)\n</b>          I said, \"don't mess with me.\" Just like\n          that.\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          73.\n</b>\n<b>          AARON (CONT'D)\n</b>          \"Don't mess with me.\" Mom, remember that\n          guy in the cop movie... he said that?\n\n<b>          MARY\n</b>          All right, already. How's your mouth?\n\n<b>          AARON\n</b>          It doesn't hurt, I told you.\n\n<b>          (CONTINUING)\n</b>          He saw everything from the roof. Said I\n          did what I had to do.\n\n<b>          HORUS\n</b>\n<b>          (FINALLY)\n</b>          Aaron, tomorrow...\n\n<b>          AARON\n</b>          (to Mary; oblivious)\n          He said tomorrow, he'd pi ck me up\n          again...\n\n<b>          HORUS\n</b>          I thought maybe you'd like it -- if I\n          pick you.\n\n<b>          AARON\n</b>          God, my friends will freak.\n          Horus freezes - fades back to his meal, unheard.\n\n<b>          0\n</b>\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Through the dim of light - Horus, alone, prepares for work.\n          A framed PHOTOGRAPH of a distinguished MAN (50's) sits on the\n          shelf inside the closet - he poses in full police regalia, stern\n          and proud.\n          Horus pauses to acknowledge the photograph. He closes the closet\n          door.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          On the kitchen floor and under the light - Mary and Aaron,\n          mother giving son a HAIRCUT.\n\n<b>          MARY\n</b>          Hold still.\n\n<b>          AARON\n</b>          I like it long.\n\n<b>          MARY\n</b>          Shut up.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          74.\n</b>          Horus walks into the living room,. in the dark. He looks at his\n          wife, then at his son - doing their own thing. They don't\n          realize he's there.\n          Horus leaves, the door'CLICKS shut behind him.\n\n<b>          MARY (CONT'D)\n</b>          Horus?\n\n<b>          AARON\n</b>          it's almost eight. Dad's late.\n\n<b>          MARY\n</b>          Horus?\n          She brushes hair off her apron. Moves into the living room, the\n          bedroom - no husband. She goes to the front door. Opens it into\n          the stairway outside.\n          There on the stairs and down below, Hancock stands - on his way\n          up. Mary sees him... and they look at each other.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          In the kitchen and under the light, Mary. Hancock. Aaron. Mary\n          is finishing up on Aaron, applying the last SNIP.\n\n<b>          AARON\n</b>          like this?\n          (holds up hand)\n          How do you make a fist?\n\n<b>          MARY\n</b>          (grabs his head)\n          Aaron, hold it.\n          Hancock shoves his fist up close, almost between the boy's eyes.\n          So there it is, the fist - this petrified mass of knuckles and\n          bones. It SNARLS at Aaron.\n          Hancock holds it there, fingers locked together - like he can't\n          let go of them.\n          Aaron swallows - in awe. Mary watches her guest, the change in\n          him.\n\n<b>          MARY (CONT'D)\n</b>          Hancock?\n          The sound of her voice takes him. He snaps out of it.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          15.\n</b>\n<b>          MARY (CONY' D)\n</b>\n<b>          (CONTINUING\n</b>          ) turn. Hancock, it's yo ur\n\n<b>          HANCOCK\n</b>          What?\n\n<b>          MARY\n</b>          Your hair. Come on, have a seat.\n\n<b>          AARON\n</b>          Mom's going butcher your hair.\n\n<b>          MARY\n</b>          Shut up, kid. Hit the showers. And the n\n          homework.\n\n<b>          AARON\n</b>          Oh, mom. I want to talk to him. Tell her,\n          Hancock.\n          Hancock shrugs a \"what can I do.\"\n\n<b>          AARON (CONT' D)\n</b>          Yeah, right. I know. I got to do what I\n          got to do.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          The Big Haircut. Mary and Hancock - up close. Mary runs her\n          fingers through his hair, testing his length. She leans into\n          him. SNIP, goes her scissor.\n          Hancock - in his seat, as hard as marble. He seems a bit lost in\n          her presence. Baffled.\n          From his position, the view consists of Mary - blossoming in her\n          sweater.\n          And that's it. Not a word during this process - just the SOUND\n          of their breaths.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          Hancock.\n          Erected before us, the immediate product of a mediocre haircut -\n          he looks plain and un-super. He looks... goofy.\n\n<b>          MARY\n</b>          There... my hero.\n          He inspects himself via a hand MIRROR. Smiles. Politely.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          76.\n</b>\n<b>          MARY (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          How do you like it?\n\n<b>          HANCOCK\n</b>          Nice. Thank you.\n          Mary - peripatetic, putting away things...\n\n<b>          MARY\n</b>          I started out just trimming for Horus.\n          Here and there. He had to look just right\n          for the academy, says his father, a\n          police captain there... in Philly. When\n          we moved here, I pretty much took over as\n          the resident barber. You know, to save\n          some money.\n\n<b>          HANCOCK\n</b>          He was in the-police academy?\n          A pause.\n\n<b>          MARY\n</b>          His father's idea. Not his. He went\n          through it anyway, like he had something\n          to prove... the validation of his\n          manhood.\n\n<b>          (BEAT)\n</b>          It tpok everything out of him. He didn't\n          talk for days after he was cut. He took\n          it real hard. I mean, still, he's not...\n          I mean,, he's still...\n          (edits herself)\n          .it was a difficult time for hi.. Me. I\n          understand that I'm not intolerant of it,\n          the working-through process. It's just\n          that, sometimes...\n          (at Hancock)\n          sometimes, I need his strength. I\n          miss. the strength.\n\n<b>          HANCOCK\n</b>          Is that what you want?\n\n<b>          MARY\n</b>          Want?\n\n<b>          HANCOCK\n</b>          What you need?\n\n<b>          MARY\n</b>          The hair... I need to...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          77.\n</b>          She kneels to sweep up hair. Hancock follows her down.\n\n<b>          HANCOCK\n</b>          Mary?\n\n<b>          MARY\n</b>          Yes?\n\n<b>          HANCOCK\n</b>\n<b>          (BEAT)\n</b>          You ever been down the boardwalk, at\n          night?\n\n<b>          MARY\n</b>          Why... what for?\n          They're eye to eye. Close.\n\n<b>          AARON (O.S.)\n</b>          Mom?\n          Mary bursts from her perch - regroups, awkwardly. Aaron stands\n          in the hallway, his hair still wet from the shower.\n\n<b>          MARY\n</b>          Yes.\n          Inside Aaron's head: My mother + Hancock? Nah!\n\n<b>          AARON\n</b>          my mouth. It's starting to swell. I\n          think he loosened a tooth.\n          Mary - maternal duty calls.\n\n<b>          MARY\n</b>          All right. Go to your room. I'll get the\n          ice pack.\n          Aaron exits. Mary exits.\n          Hancock - alone and on his knees. He finally rises. Heads for\n          the front door.\n          Mary returns with the ice pack. Catches him...\n\n<b>          MARY (CONT' D)\n</b>          You're leaving?\n\n<b>          HANCOCK\n</b>          It's getting late.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          78.\n</b>\n<b>          MARY\n</b>          I'm sorry.\n\n<b>          HANCOCK\n</b>          I'm going to take a walk.\n\n<b>          MARY\n</b>          Really? On the boardwalk?\n\n<b>          HANCOCK\n</b>          Maybe.\n          Pause.\n\n<b>           AARON (O.S.)\n</b>          Mom.'\n\n<b>           MARY\n</b>          I'm sorry.\n          She goes to him, without words to say. In this silence, he\n          stares at her his eyes, glazed with thought.\n\n<b>          HANCOCK\n</b>\n<b>          (FINALLY)\n</b>          Good night, Mary.\n\n<b>          MARY\n</b>          Good night.\n\n<b>          INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          The clock - 9:45 pm.\n          The store rests in afterhour stillness. Horus paces by the side\n          door, his ears pressed to the phone receiver - no answer.\n          He hangs up. Checks his watch. Goes to the front entrance and\n          peers out at the street - no Roheim.\n\n<b>          INT. BAR - NIGHT\n</b>\n          The bar. The smoke. The scums of humanity. Gina - over there,\n          marketing her cleavage to anything with a pulse and a penis.\n          She mingles with a BAR FLY.\n          Her eyes locate Hancock - entering, finding a seat.\n          From an adjacent stool, A MAN places his hand on Hancock's lap.\n          Whispers to him.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          79.\n</b>\n<b>          MAN\n</b>          I wear dresses. How about you?\n\n<b>          HANCOCK\n</b>          (considers; nah)\n          Get lost.\n          The warning comes across quite well - the man exits.\n          Gina saunters over - takes the vacancy. At the other end, the\n          bar fly rises. Pays. Heads pass them, for the door.\n\n<b>          GINA\n</b>          (to bar fly)\n          Meet you outside. The El Camino, right?\n          The bar fly nods. Exits. Gina turns to Hancock. Takes his face\n          in her hands, studies him.\n\n<b>          GINA (CONT'D)\n</b>          Your eyes are calm. It's good.\n          She withdraws her hands.\n\n<b>          HANCOCK\n</b>          What?\n\n<b>          GINA\n</b>          But you're still here.\n          She rises. And as she makes for the exit...\n\n<b>          GINA (CONT'D)\n</b>          Nice haircut.\n          Hancock watches as the night swallows her whole. He inhales the\n          rest of his cigarette - pensive.\n\n<b>          CUT TO:\n</b>\n<b>           INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          The clock, it reads 1:05 am.\n          Horns, his flashlight, they're making their rounds. His routine\n          takes him outside - via an EXIT door.\n\n<b>          EXT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          A dark alley. Dumpsters. Boxes.\n          Horus peruses the premises. Heads around the building and to the\n          street.:.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          80.\n</b>          . as a ragged FIGURE collapses onto.him. It's Roheim and he's\n          been drinking, right?\n\n<b>          HORUS\n</b>          Dear God.\n          Horus catches him.\n\n<b>          INT. WATANABE'S - NIGHT\n</b>\n          They find a chair in the back, Horus Positioning Roheim in the\n          light. The old man isn't drunk - his mouth agape, his face\n          bruised with wounds from a serious pummeling.\n          A chunk of lip dangles, bleeds.\n\n<b>          HORUS\n</b>          Jesus.\n          Goes to the bathroom sink for some paper towels. Comes back to\n          nurse' the wounds.\n\n<b>          ROHEIM\n</b>          Figured I can get you by the front... but\n          you weren't there.\n\n<b>          HORUS\n</b>          (dabbing the torn lip)\n          Who... what happened?\n\n<b>          ROHEIM\n</b>          They-jumped me. That bastard Scarpo and\n          his boys. They were waiting on me.\n          Returns to get more clean towels. And comes back.\n\n<b>          HORUS\n</b>          Why didn't you come through the back...\n          standing out there in the dark?\n\n<b>          ROHEIM\n</b>          -Couldn't find my keys. Must've dropped\n          them'in the fight.\n          (feels his lip)\n          Shit...\n          He works himself off the chair. Heads inside the bathroom.\n\n<b>          HORUS\n</b>          What're you doing?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          81.\n</b>\n<b>          ROHEIM\n</b>          (into the mirror)\n          the old man\n          Look at what they did.. gave\n          a fat lip to match his big mouth. I'm for\n          shit.\n\n<b>          HORUS\n</b>\n<b>          (FRUSTRATION)\n</b>          Sit down\n          Could you knock it off, please.\n          so I can clean the cuts.\n          He leads the old wretch back to the chair.\n\n<b>          ROHEIM\n</b>          I'm a waste of time...\n\n<b>          HORUS\n</b>          Stop.\n\n<b>          ROHEIM\n</b>          I'm too old for this.\n\n<b>          HORUS\n</b>          You're not old.\n\n<b>          ROHEIM\n</b>          What am I... I'm biologically challenged.\n          Any way you look, I'm a waste of effort.\n\n<b>          (BEAT)\n</b>\n<b>          I\n</b>           Use to be, I blame the job. The job.\n           think, bullshit job. Not right for a man.\n           \"To observe and record...\" I say, what a t's for\n           the hell is DIo nly\n           dogs. They got a d o o gs in t g g hisn\n           reason we're he d re, we don't shit on the\n          carpet.\n          Horus looks away. Doesn't want to hear it.\n\n<b>          ROHEIM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          But you know what, Horus. That's all\n          wrong. It ain't the job. The job don't\n          make the man. It's me. Not the uniform.\n          It starts right here... 'cause I can't do\n          anything right. Fuck up my ABC's.\n          (a beat; at Horus)\n          But you. Why do you put up with this\n          crap? A wife. A kid. There... waiting for\n          you at home.\n          Horus - he just doesn't know anymore.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          82.\n</b>\n<b>          EXT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          On the rooftop of this building - Hancock, on another end of a\n          Marlboro. Eyes red. Hair in wet dishevelment. He's a mess.\n\n<b>          HANCOCK\n</b>          got to do what you got to do.\n          He paces with nervous energy, pounding his fist into the other\n          hand. We sense a decision brewing...\n\n<b>          INT. THE LONGFELLOW BEDROOM - NIGHT\n</b>\n          A desk clock points to 2:30 am.\n          Mary - awake undercover. She twists, turns...\n          A shadow engulfs the side of her wall, smothering the light in\n          the room. Mary catches it. Rises above her blanket.\n          What she sees - outside the window, Hancock hanging there in non-\n          gravity. He stares directly at her.\n\n<b>          HANCOCK\n</b>          I know you're up, Mary. I know you can\n          hear me. Please meet me on the boardwalk\n          tomorrow morning. Nine o'clock. It's\n          important that I talk to y ou, then.\n\n<b>          (GRAVELY)\n</b>          Please, Mary.\n          And with that, he's off and away. Mary.- stunned.\n\n<b>          CUT TO:\n</b>\n<b>          INT. ROHEIM'S APARTMENT - DAY\n</b>\n          We're in the staircase - where Horus is, supporting Roheim up\n          the stairs.\n\n<b>          ROHEIM\n</b>          They're going to can me.\n\n<b>          HORUS\n</b>          No one's canning anyone. No one saw us...\n          watch your step... leave.\n\n<b>          ROHEIM\n</b>          Should be an extra key over the door.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          83.\n</b>\n<b>          INT. KITCHEN - DAY\n</b>\n          In the kitchen, Mary and Aaron - the morning routine. Something\n          is off this morning, like someone threw a wrench into the\n          machinery.\n          Mary appears a bit frazzled, handing her son toasts. She rushes\n          back to the stove - her eggs beckoning.\n\n<b>          AARON\n</b>          The toast's burnt.\n\n<b>          MARY\n</b>          What?\n          Aaron inspects his Superman lunchbox.\n\n<b>          AARON\n</b>          We're late... you forgot the corn chips.\n          Mary serves up-the eggs - sunny side up. 1. and down... and all\n          over the place.\n\n<b>          MARY\n</b>          Eat... and we'll go.\n          (checks her watch)\n          Where's your father?\n          She grabs a comb and proceeds to part Aaron's hair.\n\n<b>          AARON\n</b>          You forgot the corn...\n          (the comb snags)\n          . ouch!\n\n<b>          MARY\n</b>          I'm'sorry, honey. I was hoping daddy'll\n          be home before we leave. I'm sorry.\n\n<b>          AARON\n</b>          You having your period, mom?\n          She responds with a brisk slap to the head... SMACK.\n\n<b>          INT. ROHEIM'S APARTMENT - DAY\n</b>\n          We enter an anal-retentively neat and manicured living room.\n          Horus ushers Roheim in...\n\n<b>          ROHEIM\n</b>          Shoes.\n          The two pause. Remove their shoes. Proceed into bedroom.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          84.\n</b>\n<b>          INT. BEDROOM - DAY\n</b>\n          Horus sets Roheim down on the bed. Tucks him under.\n\n<b>          HORUS\n</b>          You're going to be okay?\n\n<b>          ROHEIM\n</b>          I don't know. You might have solo act\n          tomorrow night.\n\n<b>          HORUS\n</b>          Get some sleep.\n\n<b>          ROHEIM\n</b>          You're a good man, Horus.\n\n<b>          HORUS\n</b>          (washing over it)\n          I have to get home, now. I'll call.\n          Roheim grabs on to his sleeve.\n\n<b>          ROHEIM\n</b>          You know what Olga said before she walked\n          out on me? Her last words to me. She\n          turned at the front door. Looked around\n          the room and she says, \"keep it clean.\"\n          That's it, can you believe it? Then out\n          the door.\n\n<b>          (BEAT)\n</b>          But like a.shmuck,.I keep the place\n          spotless... in case she walks through\n          that door one day.\n          (at Horus; with pain)\n          I don't think she's coming back.\n\n<b>          EXT. STREET - DAY\n</b>\n          Horus struggles homeward - his mind in a headlock with anger,\n          despair, a combination thereof.\n          He moves down his street. Looks ahead - where Clyde stands,\n          pillaging his morning paper. Clyde Spots Horus on the approach.\n          Smiles at him, with impunity. Goes back in.\n          On Horus - you can boil an egg in his seething mouth.\n\n<b>          INT. APARTMENT - DAY\n</b>\n          Fist clenched, the morning paper under his arm - Horus. steadies\n          down the hallway. His eyes target the door at the end of the hall, seeing red.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          85.\n</b>          He gets there, the door. He swallows. Wipes sweat off his hand.\n          KNOCK. And again, KNOCK.\n          ï¿½ow\n          He fidgets in his spot - courage evaporating with every elapsed\n          second. Until finally, Horus is a pile of dung.\n          The door opens.\n          And Clyde emerges, tall and ugly. He's holding up his pants with\n          one and the SPORTS PAGE with the other.\n          Caughtin mid-defecation, he is none too happy.\n\n<b>          CLYDE\n</b>          The box scores are waiting and I got an\n          inch of meat sticking out of my ass. Make\n          it snappy.\n\n<b>          HORUS\n</b>          (loosing his voice)\n          I'd like my sports page, please.\n\n<b>          CLYDE\n</b>          You what?\n\n<b>          HORUS\n</b>          I want you to stop taking my sports page.\n\n<b>          CLYDE\n</b>          All right.\n          Clyde closes the door. Horus - thunderstruck.\n          He stutter-steps... KNOCKS...\n\n<b>           CLYDE (CONT' D)\n</b>\n<b>           (AGITATED)\n</b>           What's the matter, you deaf? I'll stop\n           taking your sports page. Now get out of\n          here and let me...\n\n<b>          HORUS\n</b>\n<b>          (INTERRUPTS)\n</b>          I want today's sports page.\n\n<b>          CLYDE\n</b>          You what?\n\n<b>          HORUS\n</b>          That there... my sports page.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          86.\n</b>\n<b>          CLYDE\n</b>          What's gotten in to you? All of a sudden?\n          You don't even like football.\n          Horus does.not budge.\n\n<b>          CLYDE (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          You'll get it back... after I take my\n          dump.\n          Clyde proceeds to close the door... but Horus interjects, his\n          foot in the door.\n\n<b>          HORUS\n</b>          No.\n\n<b>          CLYDE\n</b>          What?\n\n<b>          HORUS\n</b>          No. I would like my sports page now.\n          Please.\n\n<b>          CLYDE\n</b>          After I finish.\n\n<b>          HORUS\n</b>          I'd prefer it now.\n\n<b>          CLYDE\n</b>          What's eating you, Longfella? You crazy?\n          Without warning, Horus wrests the sports page from Clyde's arm\n          a kamikaze move, indeed.\n\n<b>          CLYDE (CONT'D)\n</b>\n<b>          (SHOCKED)\n</b>          Give that back.\n          Horns lunges at his hulking opponent, lands a punch into Clyde's\n          midsection. Harmless - it tickles him, maybe.\n\n<b>          CLYDE (CONT'D)\n</b>          Why'd you go and do that for?\n          Clyde belts up has pants. Roles up his sleeves.., and the\n          massacre commences.\n          He simply tears into Horus... SLOWS to the stomach... RIGHTS\n          across the face. It ends quickly and without resistance - as if\n          Horns accepted it as fate.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          87.\n</b>          Clyde 'kneels over. Picks up the sports page. And as if yawning,\n          returns to his room.\n\n<b>          KAW/\n</b>\n<b>          CUT TO:\n</b>\n<b>          EXT. SCHOOLYARD - DAY\n</b>\n          By the fence - Mary and Aaron.\n          Mary, with a brown paper BAG, seems.distant, preoccupied in a\n          far away place.\n\n<b>          AARON\n</b>          Are you all right, mom?\n\n<b>          MARY\n</b>\n<b>          (DISTRACTED)\n</b>          Yeah... why?\n\n<b>          AARON\n</b>          You're acting weird.\n\n<b>          MARY\n</b>          (didn't hear)\n          What?\n\n<b>          AARON\n</b>          I'm late for class. Go home, mom. I think\n          it's time for your nap.\n          Aaron leaves.\n          Pensive, Mary begins her walk... to the boardwalk.\n\n<b>          INT. APARTMENT - DAY\n</b>\n          The door swings open to admit Horus - battered, enraged,\n          disoriented. He confronts an empty apartment.\n\n<b>          HORUS\n</b>          Mary!\n          A deaf ear. No one's there to console him. He storms out of the\n          apartment.\n\n<b>          EXT. BOARDWALK - DAY\n</b>\n          The ocean RAGES against the shore, in the distance and at some\n          muffled volume.\n          Up against the railing leans Hancock, and the remains of a\n          cigarette. His hair drips of salt water - he's been here a\n          while, one would suspect.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          88.\n</b>\n<b>          COP (O.S.)\n</b>          Come back here! Stop him!\n          In the background, a COP commences pursuit on a THIEF.\n          The thief dashes by - pass an indifferent Hancock. The cop\n          follows suit, passing by.\n\n<b>          COP (CONT'D)\n</b>          Stop him!\n           Hancock - his gaze wavers not from the distant waters.\n\n<b>          EXT..STREET - DAY\n</b>\n           Horus stumbles. Keeps his balance. Trudges down the street to a\n          corner BAR.\n\n<b>          INT. BAR - DAY\n</b>\n          The bar is empty at this hour. The chairs are up, the floor\n          swept. A husky BARTENDER unloads liquor in the back.\n          Horus enters. Finds a stool.\n\n<b>          HORUS\n</b>          Drink.\n          The bartender comes out, considers this man's appearance.\n\n<b>          HORUS (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          Is this a bar... or what? Drink.\n          (uncomfortable with his own\n\n<b>          RUDENESS)\n</b>          Please.\n\n<b>          EXT. BOARDWALK - DAY\n</b>\n          Mary stands there on the boardwalk, the bag in her arms.\n          It's cold this morning. A little wind has picked up. And the\n          clouds - they're alive, restless.\n          She finds Hancock, staring at her, waiting for. her.\n\n<b>          HANCOCK\n</b>          Hi.\n\n<b>          (EMBARRASSED)\n</b>          Thank you for being here.\n\n<b>          MARY\n</b>          Is everything all right?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          89.\n</b>          Hancock has no response.\n\n<b>          U\n</b>\n<b>          MARY (CONT' D)\n</b>\n<b>          (CONCERNED)\n</b>          What's wrong?\n\n<b>          HANCOCK\n</b>          (constipated; following some\n\n<b>          THOUGHT)\n</b>          It's cold.\n          Mary and Hancock - we notice, they look good together.\n\n<b>          HANCOCK (CONT'D)\n</b>          (at the clouds)\n          They're moving. The turbulence has\n          started.\n\n<b>          MARY\n</b>          Tell me what's wrong.\n          He points to the distant ocean - where the horizon curves into\n          darkness.\n\n<b>          HANCOCK\n</b>          Look out there and what do you see, Mary?\n\n<b>          MARY\n</b>\n<b>          (PERPLEXED)\n</b>          Nothing. I don't know... I don't see\n          anything.\n\n<b>          HANCOCK\n</b>          see it,can\n           It's out there. But you can't\n          Y nu?\n          (beat; holding on to a thread)\n          And that's good, not seeing. But for me,\n          I've seen it. It's where I'm from... out\n          there.\n\n<b>          MARY\n</b>          Please, Hancock. What are you talking\n          about? What's out there?\n\n<b>          HANCOCK\n</b>          Duty.\n          (beat; at Mary)\n          You ask a man, Mary, and he'll tell you.\n          He'll say: \"you do what you have to do.\"\n          Or what? You let the next guy do it for\n          you, if you don't... if you can't.\n          (losing it)\n          And... but. If I can't, then who?\n\n<b>          (MORE)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          90.\n</b>\n<b>          HANCOCK (CONT'D)\n</b>          The next guy? No. There is no \"I can't.\"\n          Just \"I must.\"\n          Mary - watching a grown superman unravel.\n\n<b>          HANCOCK (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          But I don't ask, \"why me?\" I don't\n          question it. This is me. I'm it. I do\n          what I have to do. I get in there.., all\n          the killing... the blood... and I deal\n          with it. I clean up. I make things right.\n\n<b>          (BEAT)\n</b>          And. But when.., where does it end?\n          (re: his cape)\n          Can't stop the hemorrhage... it's\n          everywhere. And it stays. All that I can\n          do, Mary. The things I am capable of\n          doing, I can't blink away the hell I've\n          seen. It's in me...\n          (points to his head)\n          in here and I can't not think about\n          it. It's in me. It's me.\n\n<b>          MARY\n</b>          Hancock... what...\n\n<b>          HANCOCK\n</b>          I just want to let go, Mary. Or I'll\n          break. I need to get away. Get away to\n          where? I don't know.\n          (at Mary)\n          I need your help.\n\n<b>          MARY\n</b>          Me? What can I do?\n          (she's helpless)\n          What do you want me to do?\n\n<b>          HANCOCK\n</b>          I want you to save me.\n\n<b>          MARY\n</b>          How?\n          Hancock leans forward. Towards Mary. And kisses her.\n          Their lips lock, twisted and entwined... until Mary, composing\n          her senses, pulls away.\n\n<b>          MARY (CONT'D)\n</b>          Don ' t.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          91.\n</b>\n<b>          HANCOCK\n</b>\n<b>          (DESPERATE)\n</b>          Save me.\n\n<b>          MARY\n</b>          I can't.\n\n<b>          HANCOCK\n</b>          You can.\n          (the hard sell)\n\n<b>          AND\n</b>          Mary,-I'll take you away. And Aaron.\n          what... I'll quit. Get a real job. An\n          apartment. I'll flip burgers. I don't\n          know what I'm doing... what I'm saying\n          anymore.\n\n<b>          MARY\n</b>\n<b>          (OVERLAPPING)\n</b>          I'm married.\n          A pause.\n\n<b>          HANCOCK\n</b>          To whom?\n\n<b>          MARY\n</b>          I love him.\n          The death blow.\n\n<b>          HANCOCK\n</b>          No.\n          (turns from her)\n          Unacceptable.\n\n<b>          MARY\n</b>          I love him. I'm sorry.\n          One can almost hear life's precious air seeping out of this\n          superman - he'd slump over if not for the muscles of steel.\n          Mary wants to console... but what can she do?\n\n<b>          HANCOCK\n</b>          I'm cold.\n          Mary hands him the contents of the bag - the trenchcoat.\n\n<b>          MARY\n</b>          I'm sorry.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          92.\n</b>          She leaves.\n\n<b>          CUT TO:\n</b>\n<b>          INT. BRADLEY ELEMENTARY SCHOOL - DAY\n</b>\n          Aaron. The school hallway. He holds a wooden hall PASS,\n          indicating that class is in session.\n          He swings into the BOYS ROOM.\n\n<b>          INT. BOYS ROOM - DAY\n</b>\n          A large restroom - empty. Little Aaron passes up on the urinals.\n          Selects a private STALL. ZIP - urination begins.\n          Splash segues into drip. DRIP. Aaron shakes off the last drop...\n\n<b>          PLOP.\n</b>          And that's the cue for the adjacent stalls - arms like tentacles\n          surface from below, shackling Aaron in his spot. He can't see\n          but, from behind, the stall door opens...\n          Guess who?\n          Perceval - possessed. He grabs the back of Aaron's head.\n          Introduces it to the yellowed waters below.\n          SPLASH - the head goes in, submerged. What Aaron sees for the\n          next several seconds: yellow, the thrashing of.bubbles, the\n          shine.-of white porcelain at.intimate range.\n          What he hears: the GASPING of his own breath, GURGLE, and wicked\n          laughter.\n          The ambush ends. Perceval. Erlick. Spengler. One of them says...\n\n<b>          THEM\n</b>\n<b>          (MOCKINGLY)\n</b>          \"Don't mess with me.\"\n          They leave - laughing.\n\n<b>          THEM (CONT'D)\n</b>          (in the distant)\n          Little shit.\n          Left there and in the stall - Aaron, slumped against the bowl.\n          On the tile floor. A wet rag of piss.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          93.\n</b>\n<b>          INT. APARTMENT - DAY\n</b>\n          Mary hurries into the room - flustered, adrenaline coursing\n          wild.\n          She runs down the hallway to her bedroom, seeking solace in\n          Horns. The cold, empty bed says he hasn't been home.\n\n<b>          MARY\n</b>          Horus...\n\n<b>          CUT TO:\n</b>\n<b>          EXT. SCHOOLYARD - DAY\n</b>\n          The school front. KIDS swarm into the streets, freshly released\n          from captivity. And there amidst bedlam - Aaron, roughed-up and\n          soiled in disgrace.\n          He moves to the curb, waiting for someone to take him away. No\n          Hancock, anywhere.\n          Aaron waits, hopeful.\n\n<b>          EXT. STREET - DAY\n</b>\n          Hancock walks an aimless walk - in oblivion, a WHISKEY BOTTLE in\n          his hand. He's been drinking. L\"i\n          in his path and up ahead, a little girl SUE (8) beckons at the\n          upper branches of a tree.\n\n<b>          SUE\n</b>          (so innocent, her voice)\n          Hymie. Come down, Hymie.\n          She catches Hancock, Mr..Superhero who can fly, stumbling by.\n\n<b>          SUE (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          Mister? My Hymie won't come down from the\n          tree.\n          Hancock's reaction - \"what?\"\n\n<b>          SUE (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          My pussycat. She won't come down.\n          She stares up at him with big, blue, sad, helpless, innocent\n          eyes.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          94.\n</b>          So cool, Hancock reaches down for a PEBBLE - takes it in his\n          palm. Finds the little pussy named Hymie. And with a simple\n          flick of the wrist... shoots it down.\n          A sharp MEOW. punctuates the task. Hymie drops from the branch,\n          limp and lifeless. A THUD we hear on impact.\n\n<b>          SUE (CONT'D)\n</b>          (so innocent, her voice)\n          Holy fuck.\n          Hancock resumes his course, taking off and into the wet sky.\n\n<b>          EXT. SKY - DAY\n</b>\n          Hancock's drunken flight - erratic and dangerously close to...\n          BAM... buildings. He strikes the corner of a brick tower,\n          plummeting downward with the dislocated debris.\n          He bounces off the concrete -.in an alley.\n\n<b>          INT. APARTMENT - DAY\n</b>\n           Mary is on the sofa - wondering where Horus might be. She checks\n          h er watch.\n\n<b>          EXT. SCHOOLYARD - DAY\n</b>\n          The place is empty. Deserted.\n          Aaron. On the curb. Some trash flutters by his feet. On his face\n          - the abandonment of all hope. Nobody's coming, this is clear.\n\n<b>          EXT. ALLEY - DAY\n</b>\n          Hancock - on his back and amidst the rubble.\n          He braces the building to get up. Drops. Gets to his feet, only\n          to be confronted by the police officer from the boardwalk.\n          We'll call this one officer REED - a beat cop with something\n          stiff up his ass.\n\n<b>          REED\n</b>          What do we have here? A piece of shit.\n          A slow look of recognition seizes his face - this is that\n          superguy.\n          Hancock stares at him.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          95.\n</b>\n<b>          HANCOCK\n</b>\n<b>          (HUMORLESS)\n</b>          Fuck off.\n          He pushes past Reed, who acquieces willingly.\n\n<b>          EXT. STREET - DAY\n</b>\n\n<b>          A\n</b>          Aaron. Walking home. Dejected. His eyes catch a glimpse of\n          particular pedestrian down the street - Hancock. He gives\n          chase... and confronts him, out of breath.\n\n<b>          AARON\n</b>          (a slight smile)\n          Hi.\n\n<b>          HANCOCK\n</b>          (turning; drunk)\n          What're you doing here?\n\n<b>          AARON\n</b>          (the smile fades)\n          I saw you walking. Where were you today?\n          You said you'd... be there.\n          Hancock - looking over Aaron's abused frame.\n\n<b>          HANCOCK\n</b>          I don't know what you're talking about.\n\n<b>          AARON\n</b>          Where are you going? Can I go?\n\n<b>          HANCOCK\n</b>          You don't want to go where I'm going.\n\n<b>          AARON\n</b>          Those assholes got me in the bathroom,\n          today...\n          (trying to hold on)\n          and you said you'd pick me up at\n          school.\n          Hancock turns. He's upset now.\n\n<b>          HANCOCK\n</b>          Listen.\n          Aaron recoils.\n\n<b>          HANCOCK (CONY' D)\n</b>\n<b>          (CONTINUING)\n</b>          Listen. I'm not here to save you.\n\n<b>          (MORE)\n</b>\n<b>          1  \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          96.\n</b>\n<b>          HANCOCK (CONT'D)\n</b>          No, not my job. Don't put that on me.\n          (pounds his chest)\n          Not my problem. Not on my shoulders. Deal\n          with it, kid. You are what you are and...\n          what I say, it won't do you any change.\n          You'll grow up to be just like-your old\n          man. A coward. Not a damn thing you can\n          do about it... 'cept grab both ankles,\n          hope by the grace of God the reaming's\n          gentle.\n          Aaron backs away from his angry wrath.\n\n<b>          HANCOCK (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          That's right. Walk away. Me... I'm not\n          here to save you.\n          He watches Aaron break 1into a run - another youngster dashed\n          against the rocks.\n          In Hancock's eyes - a .glint of regret. But only a glint.\n\n<b>          INT. BAR - DAY\n</b>\n          This empty bar.\n          With the exception of Horus and the bartender - while he's\n          drying some mugs, let's call him JOEY (30).\n\n<b>          HORUS\n</b>\n<b>          (BOOZED)\n</b>          One.more.\n          Joey studies him. He takes a mug and begins to fill it...\n\n<b>          HORUS (CONT'D)\n</b>          No... nevermind.\n          (going to blow)\n          Where's your bathroom?\n\n<b>          JOEY\n</b>          (not in my place)\n          Bathroom's closed.\n          Horus politely stands'- teeters a bit.\n\n<b>          HORUS\n</b>          How much.\n\n<b>           JOEY\n</b>\n<b>          (SARCASM)\n</b>          Let's see... that's one beer. Tell you\n          what. I'll take care of this one.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          97.\n</b>\n<b>          HORUS\n</b>          Thank you.\n\n<b>          JOEY\n</b>          The register ain't open yet, anyhow.\n          Horus doesn't hear him. He's already on the move, making a dash\n          for the door. But too late - he VOMITS at the front entrance.\n\n<b>          JOEY (CONT'D)\n</b>          Shit.\n\n<b>          EXT. HADES - DAY\n</b>\n          In the armpit of town - Hancock. He lights a cigarette with the\n          matchbook Gina had given him earlier.\n          At attention before him - Gina, gnawing on gum, heaving in all\n          her glory.\n\n<b>          GINA\n</b>          I've been waiting.\n          They stare for one horny beat.\n          Hancock moves into her. Buries his head into her bosoms, looking\n          for solace. She takes him in, very maternal this Gina.\n\n<b>          \\./\n</b>\n<b>          INT. APARTMENT - DAY\n</b>\n          The front door opens, but slowly. Aaron steps inside.\n          From the kitchen, Mary spots him in his violated condition. He\n          sees her reaction, that of shock - and like that, he runs\n          s obbing into her arms.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. HADES - DAY\n</b>\n          A phone booth - Gina's office.\n          There in the back alley and in this glass booth - Hancock and\n          Gina, their organs ensnared. They're pumping away. Up. Down.\n          A surreal sight, indeed - the red of his cape and the black of\n          her leather.\n\n<b>          GINA\n</b>          Come on, baby. Relax.\n\n<b>          HANCOCK\n</b>          I can't.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          98.\n</b>\n<b>          GINA\n</b>          You can.\n          The phone begins to RING - but they're busy.\n\n<b>          HANCOCK\n</b>          I can't.\n\n<b>          GINA\n</b>          Let it go, baby. Just let it...\n\n<b>          RING...\n</b>\n<b>          HANCOCK\n</b>          (in tears)\n          I can't.\n          His arm rips through the glass...\n\n<b>          GINA\n</b>          . go.\n\n<b>          (ORGASMS)\n</b>          Oh god.\n\n<b>          HANCOCK\n</b>          I can't!\n\n<b>          RING...\n</b>          He DRILLS a hole into the phone - killing it.'\n\n<b>          GINA\n</b>          Don't give up, now.\n          He lets her down. Tears out of the booth. Finds the sky.\n\n<b>          EXT. SHEEPSHEAD BAY - NIGHT\n</b>\n          There is movement in the sky above - aggressive formations and\n          grooves in clouds once coy and demure. The wind HUMS its\n          presence, toys with fallen leaves.\n\n<b>          'INT. APARTMENT - NIGHT\n</b>\n          It's dinner - but all is not well. Mary and Aaron and an empty\n          chair. '\n          They sit without talking.. They eat without making a sound.\n          Between them - a ketchup bottle.\n          The door bursts wide, coughing up Horus. He locates his chair\n          and plops on it... misses... kisses the carpet.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          99.\n</b>\n<b>          HORUS\n</b>          (on the ground; prone)\n          Son. Go to your room.\n          Struggles to his knees.\n\n<b>          MARY\n</b>          What happened toyou?\n\n<b>          AARON\n</b>          Dad, are you wasted?\n\n<b>          MARY\n</b>          Where... Aaron, he's not wasted. Go to\n          your room.\n\n<b>          AARON\n</b>          He is wasted.\n          Horus rises, under great difficulty. Feels his way to the sofa.\n          When Mary tries to assist, he waves her away.\n\n<b>          HORUS\n</b>          Aaron. Go to your room.\n\n<b>          AARON\n</b>          But dad...\n\n<b>          MARY\n</b>\n<b>          (AUTHORITY)\n</b>          Go!\n          Aaron obliges, at reluctant pace.\n\n<b>          MARY (CONT' D)\n</b>          What do you think you're doing, Horus\n          Longfellow?\n          Horus gauges her.\n\n<b>          HORUS\n</b>          Don't \"Horus Longfellow\" me, Mary. I'm\n          not your child. I'm your husband.\n\n<b>          MARY\n</b>          Horus, what're you talking about?\n          (re: bruises)\n          Who did this to your face?\n          Horus rises from his seat with mustered strength.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          100.\n</b>\n<b>          HORUS\n</b>\n<b>          (OBLIVIOUS)\n</b>          But you didn't know-about me...\n          Mary knows where this is headed.\n\n<b>          HORUS (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          You didn't know I was going to do this to\n          you.\n          (a half-chuckle)\n          I guess I should've known. We were\n          married and I knew... at the reception. I\n          couldn't dance. so I sat in the back and\n          watched. You were with Stuart Olmsted and\n          I watched you dance. In your white dress.\n          And I remember zoning out... for a\n          second, just watching you. God, Mary...\n          the little girl next door who used to get\n          into fist fights with her brothers in\n          those patched-up Toughskins. We met only\n          'cause the tallest tree in the\n          neighborhood was in my backyard and you\n          needed to climb it.\n\n<b>          (BEAT)\n</b>          But that night. God, you looked so\n          beautiful I.had to realize it... how much\n          I loved you... one more time.\n\n<b>          (BEAT)\n</b>          You and Stuart danced. Laughed. And I\n          remember I'm watching you there, with\n          him... together like that. You looked\n          good with him, I thought all of a sudden.\n          Like you belong... better. And as I\n          stared across the floor, it was the same\n          story with all the guys there, that they\n          were more right for you.\n\n<b>          (SWALLOWS)\n</b>          More right because that night, you walked\n          in with the wrong man.\n\n<b>          MARY\n</b>          Why do you say that?\n\n<b>          HORUS\n</b>          Because I let you down.\n\n<b>          (BEAT)\n</b>          I'm a coward. I can't do anything about\n          it. Look at me, I'm breaking up in front\n          of you. And God, I fear the day when I'd\n          have to defend you and Aaron. What do I\n          do, then? What am I if I can't do that...\n          my own wife, family? Not a man.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          101.\n</b>\n<b>          MARY\n</b>          (ballistic) L\n          are. Did\n          You're a fool, that's what you\n          you think I was completely blind when I\n          married you? Something cuts at your\n          masculine ego and it's the pressure...\n          the standard's unreasonable. The woman,\n          she wants me to part oceans. That's the\n          kind of bull shit's made of. I went w\n          through it...,I was there when the hurt\n          came, when the academy said no. I\n          there. And when you felt like hiding...\n          from me and your ownforward. taking\n          Rent job, I stepped\n          It was you, Horus Longfellow. otile. I\n          didn't take the love away.\n          here.\n           the closet,\n          Horus stands there - tears, almost. He takes to his security\n          retrieving his U-Rent Security Jacket. He grabs\n          hat. Straightens his hair. Puts it on.\n\n<b>          MARY (CONT' D)\n</b>          Horns, what are you doing?\n          Inserts the flashlight into his holster.\n\n<b>          HORUS\n</b>          All that I can do.\n           the frontdoor.\n          And with that, stumbles out of\n\n<b>          MARY\n</b>          Horus!\n\n<b>          INT. BROWNSTONE - NIGHT\n</b>\n           A dark room somewhere. Close on the top of aBdr dresser - a framed The e\n           picture of a happy Ted \"the police captain\"\n          begins to RATTLE.\n\n<b>           AND\n</b>           It comes from a BED g twrithingNintherrposit onI over\n           obscured from view, iearidin\n           s 1 he can.\n          a Hancock. She's doing the best\n\n<b>          GIRL\n</b>          Come on, baby. What's... wrong?\n          The picture of Ted \"the police captain\" Brock succumbs to the\n          rattle. It DROPS off\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          102.\n</b>\n<b>          DREAM SEQUENCE - SOMEWHERE\n</b>          EXPLODES into the rage and fury of an apartment fire.\n          Casualties come in the form of CRIES, women and children on the v erge of incineration.\n          Hancock's POV: a burning hallway, flames spewing from every\n          crevice - we're walking through Hell.\n          We see a BOY, huddled under a table. Hancock wraps his cape\n          around him. Bolts through the inferno... as glass SHATTERS...\n          and gas pipes ERUPT.\n          He takes the boy to safety. Unwraps the cape... only to see the\n          CHARRED remains of a human BODY...\n          the-CRIES, they continue...\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          The room is dark, of course. A BED - as the SQUEAKING of springs\n          suddenly stops.\n          A woman's VOICE says...\n\n<b>          VOICE\n</b>          What's the matter?\n\n<b>          HAN000K\n</b>          I need a cigarette.\n\n<b>          VOICE\n</b>          You what? But you haven't...\n\n<b>          HANCOCK\n</b>          (losing it)\n          I need a cigarette, goddamn it!\n          He storms from the bed. Heads for the bathroom.\n\n<b>          VOICE\n</b>          I don't smoke. What's wrong with you?\n          She rises after him and into view - it's no other than the TV\n          reporter, in the flesh. She bounces over to the bathroom, as the\n          door SLAMS shut.\n\n<b>          REPORTER\n</b>          What're you doing?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          103.\n</b>\n<b>          INT. BATHROOM - NIGHT\n</b>\n          Hancock stares into the mirror - a face in the latter stages of\n          deterioration.\n          And in disgust, he swipes EVERYTHING off the sink.\n\n<b>          REPORTER (O.S.)\n</b>          What're you doing, in there! I'm calli ng\n          the police.\n          Hancock drops his pants.\n          Straight-arms the wall with his left. And with his right,\n          latches on to his magnanimous member.\n          Outside and beyond the door, the reporter has her ear pressed\n          against wood - listening.\n          So there our superhero stands, bent over a bit, yanking up a\n          storm. His body convulses under said stimulation. He GROWLS...\n          Cue for the reporter to back away.\n\n<b>          REPORTER (CONT'D)\n</b>          Jesus...\n          Hancock stiffens, in full throttle. Full. Throttle...\n          up and into a fevered pitch... and BOOM, we hear a He GROWLS... P\n          baby explosion. The reporter leaps back.\n          Beat.\n          The bathroom door flies open. Hancock emerges, buttoning his\n          pants. He brushes pass her. Finds the window... and he's off\n          with a gush of wind.\n          The reporter turns back to Looks ins\n          everywhere, in shambles.. nwke . b nd in the ceiling,ï¿½da.9apings\n          HOLE - seething still fro S m the l A aunch.\n\n<b>          REPORTER (CONT'D)\n</b>          Shit.\n\n<b>          EXT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          The store bathroom.\n          Horus - his reflection in the mirror. He stares at himself.\n          Disgust.\n\n<b>          R\n</b>          He washes his face.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          104.\n</b>\n<b>          EXT. ALLEY - NIGHT\n</b>\n          Hancock's P.O.V. - a blurred, wobbly image of an alley. He-takes\n          a swig from a fresh bottle of whiskey.\n          He turns a corner... a dark FIGURE jumps him.,, knocks him\n          against the wall... GUN pointed.\n          it is the Hoodlum - from before..,\n\n<b>          HOODLUM\n</b>          Scream and I blow...\n          (not you again!)\n          oh shit.\n          Hancock in a foul mood. He brushes the Hoodlum away, sending\n          flesh and bone against the opposite wall. SNAP goes the landing.\n          The Hoodlum. Dead.\n          Hancock - realization. He hastens to the body... limp... broken.\n\n<b>          HANCOCK\n</b>          No... don't. No.\n\n<b>          (LOUDER)\n</b>          No!\n          He moves away. Angry. Tired. Drunk. Hancock drops against the\n          wall, beaten...\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Aaron's bedroom. Mary -.on the bed, rocking Aaron to sleep as\n          she finishes off a familiar melody...\n\n<b>          MARY\n</b>          (stroking his hair)\n          \"Once there was a way, to get back\n          homeward...\"\n\n<b>          EXT. ALLEY - NIGHT\n</b>\n          Hancock listens.\n\n<b>          MARY (V.O.)\n</b>          once there was a way, to get back\n          home...\"\n          Her voice grips him. Torments him...\n\n<b>          INT. BEDROOM - NIGHT\n</b>\n          Mary. Aaron.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          105.\n</b>\n<b>          MARY\n</b>          \"Sleep pretty darling, do no t cry. And I\n          will sing a lullaby...\"\n\n<b>          (WHISPERING)\n</b>          Good night, darling.\n          Kisses him.\n\n<b>          AARON\n</b>          Thanks, mom.\n\n<b>          MARY\n</b>          Sleep tight.\n          She leaves.\n          Aaron stops her by the door.\n\n<b>          AARON\n</b>          Mom. Tomorrow always feel bette r.\n\n<b>          MARY\n</b>\n<b>          (SMILES)\n</b>          Really?\n\n<b>          AARON\n</b>          Probably.\n\n<b>          ï¿½/\n</b>\n<b>          INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          Horus - on a chair, his face buried in his two hands. He sits\n          alone, concealed in the darkness.\n\n<b>          INT. KITCHEN - NIGHT\n</b>\n          In the kitchen - Mary, trying to sift through pieces of the\n          evening. She finds no comfort.\n          She moves to the sinks L1oks night. The wind is\n          alive. And dark cloud ut at the\n\n<b>          HANCOCK (O.S.)\n</b>          (deep; demonic)\n          Mary.\n          Mary launches back, cold. Outside the window and in frontrof her\n          - Hancock, suspended in air. The blood-red of his eyes p\n          nothing but bad news.\n          And being so, he EXPLODES through the glass. Glass rains through\n          trance. n the kitchen, amplifying his e\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          106.\n</b>\n<b>          HANCOCK (CONT'D)\n</b>          (maniacal; drunk)\n          Amway, anyone?\n          The pursuit commences - Hancock steadies after Mary, in retreat\n          around the living room.\n\n<b>          MARY\n</b>          (she's white)\n          What're you doing?\n          Hancock closes in. Corners her.\n\n<b>          HANCOCK\n</b>          It's the haircut, Mary.\n          (strikes his head)\n          I'm pissed!\n          Out of nowhere - Aaron charges the caped psychotic. He\n          trampolines on Hancock's back, trying to saddle him.\n\n<b>          AARON\n</b>          Don't you fucking touch her!\n          Mary SCREAMS. Hancock cringes, says...\n\n<b>          HANCOCK\n</b>          Shut your mouth.\n          He swats the kid off his back.\n\n<b>          AARON\n</b>          Don't touch her you bastard!\n\n<b>          HANCOCK\n</b>          You're getting on my nerves.\n\n<b>          MARY\n</b>          Hancock, please.\n          He reaches down and untangles Mary from her son - she concedes\n          out of fear for Aaron.\n\n<b>          AARON\n</b>          No! Mom!\n\n<b>          MARY\n</b>          Stay back, Aaron!\n          Hancock takes her away - like booty. Aaron dangles from his\n          cape, trying to save his mother.. In vain.\n          The superhero springs into the night - with his woman.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          101.\n</b>\n<b>          AARON\n</b>          (through heavy sobs)\n\n<b>          DAD!\n</b>\n<b>          INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          From the depths of defeat - rises, his\n          attention focused on the bac k Horus responds. Hee\n          Roheim? Roehim lost his keys...\n          The back door creeps open. Several under\n          stealth. They move through enitrs Scarpogand his\n          thugs.\n          Horus takes refuge behind the locker, allows them to pass.\n\n<b>          THUG #1\n</b>\n<b>          (WHISPERING)\n</b>          Stop grabbing my ass, man.\n          Horus slides out the back, into the alley. He crosses the street\n          to a phone. Jabs in 911.\n\n<b>          HORUS\n</b>          Police?\n\n<b>          EXT. KILLYBEGS TEXTILE (ROOF) - NIGHT\n</b>\n           This dilapidated structure serves as landing pad for Hancock,\n          easing Mary down with him.\n          A swift kick and the oor is no more. He drags her down\n          into the bowels of da roof d rkness.\n\n<b>           MARY\n</b>           What're you doing?\n\n<b>           HANCOCK\n</b>           What I got to do.\n\n<b>           CUT TO:\n</b>\n<b>          EXT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          The SOUND of distant SIRENS are heard. They arrive binlthe form\n          of three POLICE CARS - pulling up\n          From one of the cars - Officer Rutger and Officer Adams, in\n          control of the situation.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          108.\n</b>\n<b>          INT. WATANABE'S SHOPPING EMPORIUM - NIGHT\n</b>\n          Scarpo and the thugs are at the front door - looking out at\n          about... five to ten for armed robbery. They're in hysterics.\n          They observe as Horus emerges from the building across, trying\n          to assist the authorities.\n          Scarpo recognizes this one security guard.\n\n<b>          SCARPO\n</b>          Nutri-cop.\n\n<b>          THUG #1\n</b>          He got out.\n\n<b>          SCARPO\n</b>          He's dead, man.\n\n<b>          THUG #2\n</b>          Fuck, we're dead! What, now?\n\n<b>          EXT. WATANABE'S DEPARTMENT STORE - NIGHT\n</b>\n          Rutgers and Adams - cops with Dirty Harry delusions. They greet\n          Horus as one would Rodney Dangerfield.\n\n<b>          RUTGERS\n</b>          You did the right thing, Longfellow.\n\n<b>          HORUS\n</b>\n<b>          (COP)\n</b>          I saw four. Presumably armed. Only other\n          way out is through the back.\n          The cops trade laughs.\n\n<b>          RUTGERS\n</b>          Take a hike, Longfella. Get back in your\n          hole and watch the law kick some ass.\n          Horus, reluctant, returns inside his building.\n          Rutgers moves to work the speakers - his action preempted by the\n          other COPS.\n\n<b>          COP #1\n</b>          We got something big going down.\n\n<b>          (LISTENS)\n</b>          Shit, all units. What the bell's going\n          on?\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          109.\n</b>\n<b>          ADAMS\n</b>          (at the computer)\n          Killybegs Textiles. The Cap sounds like\n          he's chewing the rag.\n\n<b>          RUTGERS\n</b>          Fuck, what do we do with this?\n\n<b>          COP #1\n</b>          This is a wrap. Come on, lets roll! All\n          units.\n\n<b>          ADAMS\n</b>          I don't like the smell of this shit.\n\n<b>          INT. WATANABE'S DEPARTMENT STORE - NIGHT\n</b>\n          Scarpo. Thugs. They watcherheasqua d cars move out and away.\n          Disbelief would be an adt\n\n<b>          THUG #1\n</b>          What the...\n\n<b>          SCARPO\n</b>          They're taking off...\n\n<b>          THUG #1\n</b>          Fucking no way.\n\n<b>          EXT. ACROSS THE STREET - NIGHT\n</b>\n          Horus, watching the red and blue light fade into the night. His\n          complexion is the color of liquid paper.\n\n<b>          INT. WATANABE'S DEPARTMENT STORE - NIGHT\n</b>\n          The display TV - tuned to the showdown at Killybegs.\n\n<b>          THUG #2\n</b>          (re: TV)\n          Check this-out, fellas.\n          Scarpo. Thug #1, #3. They gather around - watching the woman\n          reporter do her thing, at the scene.\n\n<b>          REPORTER\n</b>          blocked off the streets. Already,\n          orders for more substantial fire power\n          have been requested by the commissioner's\n          office as police surround the condemned\n          textile building in an all-out\n          confrontation with Hancock, superhero-\n          turned-renegade...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          110.\n</b>\n<b>          SCARPO\n</b>          Fuck, you guys know what this means?\n\n<b>          THUG #2\n</b>          We're off the hook, man.\n\n<b>          SCARPO\n</b>          The store's ours.\n\n<b>          THUG #3\n</b>          What about that security guy?\n\n<b>          SCARPO\n</b>          He ain't coming back?\n          In unison - their FLASHLIGHTS flick on.\n\n<b>          EXT. STREET - NIGHT\n</b>\n          On Horus - as he swallows, backing away and down the street. See\n          coward run. See coward hide. He disappears around the corner...\n          . but something pulls him back. He reappears, thinking,\n          staring at his feet. Destiny awaits him.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          POLICE UNITS flood this once quiet and forgotten block. S.W.A.T.\n          teams ooze from vans. COPS kneel behind their cars, guns cocked.\n          We SEE Ted Brock - he's on the radio, hammering out orders. He\n          looks pissed.\n          Rutgers and Adams arrive. They take position next to fellow\n\n<b>          COPS.\n</b>\n<b>          ADAMS\n</b>          What's with the Cap? Looks like someone\n          just fucked his wife, or something.\n          Nervous smiles from the fellas.\n\n<b>          INT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          In the wide expanse of this top floor - Hancock and Mary. He\n          squats before her, calm - unperturbed by the activities outside.\n          Mary huddles in her spot, occasionally stealing glances outside.\n          Hancock simply stares at her. At the curves of her gentle frame.\n          The alcohol's wearing off.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          INT. WATANABE'S DEPARTMENT STORE - NIGHT\n</b>\n          Scarpo. The Thugs. They sack the emporium, unimpeded.\n\n<b>          INT. BACK DOOR - NIGHT\n</b>\n          The silhouette figure of Horus - it enters the back room,\n          bracing the wall for silence. He moves into the store.\n          From his vantage, several beams of light slice the darkness they\n          indicate the positions of the thugs.\n          Horus sneaks in, heads for the second floor.\n\n<b>          INT. SPORTING GOODS SECTION - SECOND FLOOR - NIGHT\n</b>\n          Thug #3 peruses this department.\n          Moving across the floor on bent knee - Horus, concocting some\n          desperate strategy. He moves to the GUN counter. Slips his hand\n          underneath and withdraws a hidden KEY.\n\n<b>          LST FLOOR - NIGHT INT. FIP\n</b>\n          Scarpo - stuffing his bag with merchandise. He waves Thug #2\n          over.\n\n<b>          SCARPO\n</b>          Take the show upstairs.\n\n<b>          INT. SECOND FLOOR - NIGHT\n</b>\n          The gun counter. Horus loads a .45 - it's foreign to his hand.\n           He rolls out in search for Thug #3, who is by the BASEBALL\n          aisle. Horus cocks the .45 in pursuit. Sidles up behind him.\n\n<b>           THUG #2 (O. S . )\n</b>          (from behind)\n          Behind you!\n          Thug #3 swings around with a Louisville Slugger - it swipes the\n          45 from Horus's hand. Horus \"I'm screwed.\"\n          Thug #3 promptly knocks Horus against the BAT rack. Bats roll,\n          spray the floor. Thug #3 slips hard on his approach, landing\n          heavy on his head.\n          Thug #2 comes running, gun raised.fa rusCdives for r a goes oose bat,\n          his swing greeting Thug #2 in the\n          the count.\n          Horus stands over the two bodies - as surprised as we are.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          112.\n</b>\n<b>          INT. FIRST FLOOR - NIGHT\n</b>\n          Scarpo - in full alert. He's heard the commotion upstairs.\n\n<b>          SCARPO\n</b>          Guys?\n          (no answer)\n          Fuck me.\n          He drops his loot. Heads for the second floor, cocking his gun.\n\n<b>          INT. ELECTRONICS SECTION - THIRD FLOOR - NIGHT,\n</b>\n          Thug #1, he's writhing to music under the privacy of headphones -\n          unaware of Horus behind him... Thug #1 whirls around with a gun,\n          catching Horus off guard.\n          Horus responds with a FLASH he had acquired from the camera\n          section - the burst of light momentarily blinds the thug.\n          And a quick SNAP of the bat takes out Thug #1. Horus dispenses\n          of the camera, his adrenaline raging. He commandeers the free\n          gun, heads downstairs.\n          But the TV stops him... it displays the siege at Killybegs\n          Textiles.\n\n<b>          REPORTER\n</b>          again, we believe that this is a\n          hostage situation. Officials refuse to\n          comment but we believe Hancock has\n          abducted a woman, the identity of whom we\n          do not yet know...\n          Horus - a look of horror on his face.\n\n<b>          HORUS\n</b>          Mary.\n          He's off, slowing to a ginger descent at the stairs. Makes his\n          way down to the second floor... where he is greeted by a gun\n          NOZZLE, pressed against his temple.\n\n<b>          SCARPO\n</b>          You're starting to piss me off.\n          He pushes Horus down the remaining steps.\n\n<b>          INT. SECOND FLOOR - NIGHT\n</b>\n          Horus rolls to a halt. Scarpo greets him there...\n          pulling him-up by the hair...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>           ,knees him in the gut. r\n           osition. Scarpo stands over\n          him s drops to the floor in a fetal p\n           Cocks his gun...\n          him menacingly.\n\n<b>          SCARPO\n</b>          Your move...\n          Horus uncoils an accurate kick to Scarpo's groin.\n          Scarpo - a dumbfounded look entwined in pain. He drops.\n           Horus goes for the gun. A struggle ensues, Scarpo finding Horus to the side.\n          strength from god knows where. g\n          Takes dead aim with a tremblin\n          BANG... Horus grimaces...\n          Scarpo drops.\n          .45 (knocked from\n          Roheim steps forward from the darkness, the\n          Horus, earlier) smoking in his hand.\n          Did I get him?\n          Horus. Roheim. They look at Scarpo.\n\n<b>          ROHEIM (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          of him.\n          Holy shit. I think I g\n          Roheim notices the unconscious thugs on the floor. Turns to\n          Horus, measuring him.\n\n<b>          HORUS\n</b>          What're you doing here.\n          ROHEIM ed\n          Mary called earlier. She was worri\n          about you.\n\n<b>          HORUS\n</b>          Mary...\n\n<b>          EXT. SHEEPSHEAD BAY - NIGHT\n</b>\n          with gloom.\n          Those clouds that shroud the sky\n          a CRACKLE of lightning echoes through the\n          They begin to surge\n          neighborhood. And the rain begins to pour.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          114.\n</b>\n<b>          EXT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          All right, so this block is squared off - surrounded. The local\n          police force and your cousins are here, ready to pounce on cue.\n          Ted \"the pissed-off police captain\" Brock stands by his vehicle,\n          screaming out orders - a BULL HORN in his hand.\n\n<b>          TED\n</b>          Let the lady go, Hancock. Or all hell's\n          going to break loose.\n\n<b>          RUTGERS\n</b>          (to Adams)\n          Does he know anything else?\n\n<b>          INT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          Hancock. Mary. She's slumped against the wall, exhausted.\n\n<b>          TED (O.S.)\n</b>          (bull horn)\n          Come on out!\n          Hancock seizes his ears the bull horn testing his nerves.\n          He bolts upright, turns to Mary. He seeks a special kind of\n          healing.\n          Hancock closes in - corners her.\n\n<b>          MARY\n</b>          Please.\n          But there's no denying this superman - he grabs her, running his\n          hand down her back and between her buttocks.\n\n<b>          MARY (CONT' D)\n</b>          (in tears)\n          No...\n\n<b>          HANCOCK\n</b>          Please...\n          A sudden burst of anger seizes Mary. She SCREAMS... STRIKES\n          Hancock across the face.\n\n<b>          MARY\n</b>\n<b>          NO!\n</b>          He tears himself away. Disgusted. Tortured.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          115.\n</b>\n<b>          HANCOCK\n</b>          (a desperate child)\n          Help me.\n\n<b>          TED (O.S.)\n</b>          (bull horn)\n          All HELL'S going to break loose!\n          Hancock recoils from this noise - in veritable pain. Clutches\n          his ear.\n\n<b>          HANCOCK\n</b>          Make it go away, Mary.\n          Mary huddles against the wall..She watches on, watching him\n          struggle.\n\n<b>          TED (0. S)\n</b>          You are surrounded. There's no way out of\n          this one... NO WAY OUT!\n          Hancock on his knees, tears bubbling inside. He shakes it off.\n\n<b>          HANCOCK\n</b>          No... do what I got to do.\n          He unloads a PUNCH. PUNCTURES brick. Clear through...\n\n<b>          C\n</b>\n<b>          EXT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          the other side. The authorities react. They right their\n          guns.\n          Ted Brock - a picture of grim impatience, breathing hard.\n\n<b>          TED\n</b>          I want his balls in a jar...\n          Chad. The others. They take a good look at him.\n\n<b>          TED (CONT' D)\n</b>          in a fucking vice...\n          (into horn)\n          this is the END of the line.\n\n<b>          INT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          Hancock - pacing the floor, trying to marshal some emotional\n          order.\n          He drops to a squat, searching for calm.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          116.\n</b>\n<b>          MARY\n</b>          I'm cold..\n          Hancock does not respond.\n\n<b>          MARY (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          You're fighting a lot, right now. I know\n          that.\n\n<b>          (BEAT)\n</b>          They're out there waiting for you. It's\n          like... sometimes.., you feel like the\n          world's waiting for you. Expecting.\n          What's your next move, they want to\n          know...\n\n<b>          TED (O.S.)\n</b>          there's NO ESCAPE!\n\n<b>          MARY\n</b>\n<b>          (CONTINUING)\n</b>          and the responsibility. The duty. You\n          can't shrug it off.\n\n<b>          (BEAT)\n</b>          I know that. And I'm sorry.\n          Hancock - a committed stare into space. Can he hear her?\n\n<b>          MARY (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          Maybe... if you knew that, that I know.\n          And. That I won't expect anything from\n          you. And... there doesn't have to be a\n          next move.\n          Hancock turns on this. Stares at her. He rises from the crouch.\n          Mary - back to wall, on the defensive.\n          He approaches. Stands before her.\n          He reaches back... and removes his CAPE. He covers Mary, gently\n          shielding her. from the cold.\n          There is no eye contact.\n\n<b>          EXT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          Ted. Out of patience. He signals to a RIFLEMAN atop an adjacent\n          building.\n          Signal acknowledged. The Rifleman loads his piece...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>          in.\n\n<b>          TED\n</b>          Where the fuck is Chopper Three?\n\n<b>          CHAD\n</b>\n<b>          (CONCERNED)\n</b>          This is a hostage situation, Cap. We've\n          got a woman in there.\n\n<b>          TED\n</b>          Fuck the woman, this is Armageddon. I\n          want that bastard in a body bag.\n          Ted waves a \"go-when-ready\" sign. The Rifleman steadies his high-\n          powered weapon... FIRES...\n\n<b>          INT. KILLYBEGS TEXTILE - NIGHT\n</b>\n          Bullets EXPLODE against walls... bricks... Mary SCREAMS, ducking\n          to the floor.\n          Hancock REACTS, the chaos throbbing inside his head. And like\n          that something snaps.\n          He BURSTS out of the building - eyes lit with the Hell inside.\n          He lands on the wet surface below. ROARS before the police force\n          - possessed.\n\n<b>          HANCOCK\n</b>          Go away! Go. Away.\n          The authorities - they pause, startled. They open FIRE. Cops.\n          S.W.A.T. teams. Their cousins.\n          Bullets ZIP through the air and with dead accuracy. Hundreds of\n          shells strike Hancock - the target. They PING off his armor of\n          superFLESH.\n          He stares at them all, invincible.\n\n<b>          EXT. APARTMENT - NIGHT\n</b>\n          Through this downpour hobbles Horus - pass police CARS\n          SCREECHING by, en route to Killybegs. A police car sits in front\n          of his apartment, lights blaring.\n\n<b>          INT. APARTMENT - NIGHT\n</b>\n          Horus storms into the room... in time to greet a police OFFICER,\n          trying to pry Aaron from the bathroom sink.\n\n<b>          AARON\n</b>          Let me go you bastard.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          118.\n</b>\n<b>          OFFICER\n</b>          Let go, you little asabite.\n          Aaron spots Horus in the hallway...\n\n<b>          AARON\n</b>          Dad!\n          He breaks loose - running into his father's arms, crying.\n\n<b>          AARON (CONT' D)\n</b>          I'm sorry dad. I didn't know what to\n          do...\n\n<b>          OFFICER\n</b>          Mr. Longfellow...\n\n<b>          AARON.\n</b>          He's got mom, dad. He came and took her\n          away. What do we do, now?\n          Horus - he hasn't a clue.\n          On the TV - a graphic depiction of war at Killybegs.\n\n<b>          OFFICER\n</b>          There's not much you can do. We've got\n          every man out there, already. I suggest\n          you take your son some place safe. Let us\n          do our jobs.\n\n<b>          HORUS\n</b>          (on the TV)\n          Mary...\n\n<b>          AARON\n</b>          I'm sorry, dad. I'm sorry.\n\n<b>          OFFICER\n</b>          (dreading it)\n          I have to go... they need me.\n          He exits.\n          Roheim enters, out of breath. He notices the nasty, gaping hole\n          in the kitchen.\n\n<b>          HORUS\n</b>          He's got Mary, Roheim.\n          (blank; uncertain)\n          I got to get her.\n\n<b>          11\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          119.\n</b>\n<b>          ROHEIM\n</b>          What do you mean, you got to get her?\n\n<b>          HORUS\n</b>          I got to do what I got to do.\n          Aaron stares up at his father - \"did he just say that?\"\n\n<b>          AARON\n</b>          Damn right, dad. We got to get her.\n          Horus at the screen - oblivious. \"What can I do?\"\n\n<b>          ROHEIM\n</b>          Brain damage runs in this family or\n          something?\n          Aaron senses his father's state of overwhelmness.\n\n<b>          AARON\n</b>          Dad. You ever hear about the fox and the\n          bloodhounds?\n\n<b>          EXT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          A HELICOPTER (Chopper Three) has since joined the picture of\n          CHAOS. A strobe light cuts through the darkness and rain, zeroed\n          in on Hancock.\n          A machine GUN mounted inside opens FIRE - a wave of bullets\n          ricochet off the superhero with no effect.\n          Cops and S.W.A.T. teams continue their assault - it's the only\n          thing they can do, and it's worthless.\n          And on that note, Hancock retaliates - with a vengeance.\n          First to go is the helicopter. He slices through the air and\n          RIPS the vehicle in half.\n          An EXPLOSION punctuates its demise - sending the spinning\n          PROPELLER into wild trajectory. It crashes into a cluster of\n          Cops - heads are severed, sent flying.\n\n<b>          EXT. STREET - NIGHT\n</b>\n          Horus sprints through the downpour, following the SOUNDS of\n          destruction. At the scene, he arrives in time to witness the\n          dismantling of future law enforcement.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          120.\n</b>\n<b>          EXT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          Hancock swoops down toward a patrol car. Scares the Cops away.\n          Hoists the vehicle over. his head. Throws it at a band of Cops.\n          He ROARS...\n\n<b>          HANCOCK\n</b>          Go away!\n\n<b>          EXT. STREET - NIGHT\n</b>\n          Aaron and Roheim arrive, finding their places behind Horus. They\n          startle him.\n\n<b>          HORUS\n</b>          Jesus, Aaron. I don't want you to be\n          here.\n\n<b>          ROHEIM\n</b>          (at the mayhem)\n          I need a drink.\n          Aaron, staring at the massacre - a HEAD rolls pass him.\n          It looks pale but well-fed, healthy. It Ted's.\n          Aaron ducks into his father's chest.\n\n<b>          EXT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          In the blink of an eye, the police department is no more. The\n          entire block - a panorama of bedlam, overturned vehicles, and\n          mangled bodies.\n          Satisfied - Hancock returns inside the building.\n          From the street, we can SEE Horus - fumbling through the rubble,\n          heading towards the confrontation. He'passes a mutilated body -\n          belonging to Adams.\n          A revolver dangles from his fingers. Horus reaches for the gun\n          and stops. He looks around at the vast destruction and realizes\n          that no revolver will do. He continues forth.\n\n<b>          INT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          Mary is on the floor, wrapped in cape.\n          Hancock returns. He's pumped, deranged, and he's lost that\n          loving feeling.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          121.\n</b>\n<b>          MARY\n</b>          What have you dome?\n\n<b>          HANCOCK\n</b>          I made them go away.\n\n<b>          HORUS (O.S.)\n</b>          Mary!\n          Mary responds to her name like a body to sugar.\n\n<b>          MARY\n</b>\n<b>          (HORROR)\n</b>          Horus!\n\n<b>          HANCOCK\n</b>          (holding his head)\n          The noise...\n\n<b>           HORUS (O.S.)\n</b>          Mary!\n\n<b>           MARY\n</b>          Horus!\n\n<b>           HANCOCK\n</b>          Why?!\n\n<b>          MARY\n</b>          Please, Hancock. Don't hurt him.\n          (grabs him)\n          It'll never go away.\n          Hancock responds to \"it.\"\n\n<b>          MARY (CONT' D)\n</b>\n<b>          (CONTINUING)\n</b>          If you've got anything left... inside...\n          (hand over heart)\n          and you do, I know you do... whatever\n          it was that you felt for me... inside...\n          then you won't go out there.\n          He just looks at her.\n\n<b>          MARY (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          Just let go... and it'll go away. Please,\n          just let go.\n\n<b>          HANCOCK\n</b>\n<b>          (DESPAIR)\n</b>          I can't.\n\n<b>          \n</b>\n<b>          122.\n</b>\n<b>          EXT. KILLYBEGS TEXTILES - NIGHT\n</b>\n          Horns stands there in the rain - a feeble frame of a man. He\n          wants a fight.\n          And he gets it... as Hancock, once again, emerges from the\n          building - fire in his eyes.\n\n<b>          HANCOCK\n</b>          You ready to rock it up?\n          Horus runs - he runs for an overturned S.W.A.T. VAN. Hancock\n          follows, toying with the man.\n          Horus disappears inside.\n\n<b>          HANCOCK (CONT' D)\n</b>          Come out, you little shit.\n          A pause in action - no reply from Horus.\n\n<b>          HANCOCK (CONT'D)\n</b>          Are you a man?!\n          Horus answers...\n          He storms out with a ROCKET LAUNCHER.\n          He FIRES it at the unsuspecting Hancock. It's a hit and it BLOWS\n          Hancock against Killybegs Textile. It lodges him inside the\n          brick structure.\n\n<b>          HORUS\n</b>          Fuck you.\n          Hancock pries himself loose - enraged beyond imaginable. He\n          GROWLS - looking to retaliate. But there's no Horus.\n          Hancock explores the rubble - by the building. A sudden\n          EXPLOSION rips the base of a nearby wall - it jars the wall\n          loose, sending it crashing down.., on Hancock.\n          CRUNCH, the concrete rips right pass Hancock - stuns but does\n          not subdue him. He shakes off the dirt. Finds Horus down the\n          street.\n          Like a rocket, Hancock heads that way. He gets there, over Horus\n          - grabbing him by the collar.\n          With a swift flick, he sends the family man flying.\n          THUD as his body careens off the Killybegs wall. He drops to the\n          asphalt below. Horus - in pain, something broken possibly.\n\n<b>          \n</b>\n<b>          123.\n</b>          He gets up. Tries to walk. Can't.\n          Hancock - on the app roach, maintaining a cruel but steady pace\n          towards his wounded game.\n          Horns tries to crawl. Can't. Too much pain. He peddles back\n          against the curb, nowhere left to go.\n          Hancock arrives, looking afully steamed. He stands over Horus -\n          not unlike Scarpo much\n          The situation presents itself - he reacts.\n          A kick into Hancock's groin muscle - CHINK, sliikeyt a soundWofshrugs.\n          bone off metal. Absolutely harmless. Horus\n          else can he do?\n          Hancock tears a YIELD street SIGN it backs Ready to strikeï¿½ es\n          this piece of jagged metal.\n\n\n<b>          (CONT' D)\n</b>\n<b>          (DEFIANT)\n</b>          No regrets.\n\n<b>          HANCOCK\n</b>\n<b>          (COOL)\n</b>          No mercy.\n          He takes aim...\n\n<b>          AARON (O.S.)\n</b>\n<b>          NO!\n</b>          Mary SCREAMS in the background...\n          Horns. Hancock. They turn to witness the de-physicalization of\n          Killybegs Textile.\n          they begin to crumble, weakened by the wear Bricks... beams...\n          and tear of recent artillery.\n          Mary braces herself as the floor beneath begins to give. It\n          slips... she SCREAMS... and collapses, taking the rest of the\n          building with it.\n          A CRASH, followed by a cloud of billowing smoke.\n          Mary is no more.\n\n<b>          HORUS\n</b>\n<b>          MARY!\n</b>          Aaron. Roheim. In disbelief.\n<b>          \n</b>\n<b>          124.\n</b>\n<b>          AARON\n</b>\n<b>          (BLANKLY)\n</b>          Mom...\n          Horus, he struggles to his feet. Pushes past Hancock, limping\n          over to the building that once was.\n\n<b>          HORUS\n</b>\n<b>          MARY!\n</b>          Hancock - not a word. He stands in comatose silence, looking\n          pale.\n          Horus charges the building in possessed hysterics, trying to\n          excavate his wife - one brick at a time.\n          Roheim meets him there, in an effort to console.\n\n<b>          ROHEIM (O.S.)\n</b>          (you're wasting your time)\n          Come on, Horus.\n          Horus - lost in the pain. He won't listen.\n          Slowly and with a sense of duty, Roheim joins the excavation. He\n          r olls up his sleeve and gets to work.\n          Hancock drops the yield,sign. Turns to the battlefield in his\n          midst... surveys the carnage...\n          A loaded beat.\n          Hancock ROARS - a cry of desperation. He grimaces with defeat.\n          Staggers off. SCREAMS, because what else can he do. Falls to his\n          knees... by a fallen police GUN.\n\n          He picks it up...\n          points it at his head...\n\n           FIRES the remaining rounds against his temple. Bullets carom\n          off skull.\n          Hancock discards the gun. Breaks into TEARS. Long SOBBING wet\n          tears. He CRIES. He WEEPS. Into his cupped hands. Indeed, a\n          surreal sight.\n          Horus. Roheim. Engaged to the task, brick by brick. Horus works\n          his way down... to a lifeless ARM, protruding from its tomb.\n          He stops.\n\n<b>          \n</b>\n<b>          126.\n</b>\n<b>          INT. APARTMENT - NIGHT\n</b>\n          Aaron - in his pajamas, creeping down a dark hallway. He\n          approaches a DOOR.\n\n<b>          NARRATOR (V.0.)\n</b>          sometimes when it's dark out, so dark\n          it's black, I'll see HIM.\n          Aaron peers through the open door. His eyes wander inside ever\n          so gently.\n          On the bed there - HIM... Horns.\n\n<b>          NARRATOR (V.0.) (CONT'D)\n</b>\n<b>          (CONTINUING)\n</b>          and it starts allover again.\n          And Mary. They are in some latter state of coital bliss.\n          Horus THRUSTS.\n          Mary GASPS...\n\n<b>          NARRATOR (V.O.) (CONT'D)\n</b>          Some things... you just never forget.\n\n<b>          FADE OUT:\n</b>\n\n\n<b>          THE END\n</b>\n </pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Hancock.jpg\"/>\n</td><td><h1>Hancock</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Vincent Ngo\" title=\"Scripts by Vincent Ngo\">Vincent Ngo</a>  <a href=\"/writer.php?w=Vince Gilligan\" title=\"Scripts by Vince Gilligan\">Vince Gilligan</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Hancock Script.html#comments\" title=\"Hancock comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:06:50.123806"}