{"title": "Hebrew Hammer, The", "film_link": "/Movie Scripts/Hebrew Hammer, The Script.html", "script_link": "/scripts/Hebrew-Hammer,-The.html", "info_raw": "\n\nHebrew Hammer, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Jonathan Kesselman\nGenres  Comedy\nMovie Release Date : January 2003\n\nRead \"Hebrew Hammer, The\" Script\n\n\n", "script": "\n\n\n\n                                  THE HEBREW HAMMER\n\n                                     Written by\n\n                                  Jonathan Kesselman\n\n\n\n\n\n            Over BLACK, we hear the first few bars of Jingle Bells. The\n            music morphs into an OMINOUS SCORE. \n\n            With a thunderous BOOM, comes a TITLE CARD reading \"HANUKKAH\n            PAST.\"\n\n            EXT. PUBLIC ELEMENTARY SCHOOL - DAY\n\n            We start on JESUS ON A CRUCIFIX, and then violently CRANE\n            down to reveal MORDECHAI (10), a timid little Hasidic boy\n            standing nervously at the foot of the statue.\n\n            Behind Morty is a wall with the graffiti phrase \"HANUKKAH IS\n            4 HOMOS\" scrawled across it. He clutches his Sandy Koufax\n            lunchbox tightly as he looks off into the distance. He's got\n            quite a large bulge in his pants for a child his age.\n\n            We see a menacing, EXTREMELY WIDE ANGLE shot of the school.\n            Superimposed over the picture are the words, \"ST. PETER,\n            PAUL, AND MARY PUBLIC ELEMENTARY SCHOOL.\" \n\n            Mordechai takes a deep breath, and walks towards the school.\n\n            EXT. SCHOOLYARD - MOMENTS LATER\n\n            Mordechai walks past a row of bleachers occupied by FOUR\n            GENTILE CHILDREN.\n\n                                GENTILE BOY 1\n                      Hey Mordechai, look. I dropped a penny.\n\n            He drops a penny. The other children cackle.\n\n            The Gentile Girl next to him holds up a bag of bagels.\n\n                                GENTILE GIRL 1\n                      Hey Mordechai. Want a bagel?\n\n            Gentile Boy 1 feigns choking.\n\n                                GENTILE BOY 2\n                      Hey Jew nose, save some oxygen for us.\n\n            More laughter. Morty attempts to take it all in stride. We\n            PUSH into GENTILE GIRL 2, a severe looking puritanically \n            dressed child as she turns to face the camera.\n\n                                GENTILE GIRL 2\n                      Hey Morty, my mom says that unless your\n                      people wise up and accept Jesus Christ as\n                      your lord and savior you're all going to\n                      burn in hell.\n\n            Dead silence. The other children exchange \"Now that went a\n            little over the line\" looks.\n\n            The silence is broken by the sound of the SCHOOLBELL. Morty\n            gathers himself, and walks off.\n\n            INT. CLASSROOM - LATER\n\n            As Morty holds a small gift wrapped box in his hands we hear\n            a tinny version of the song Dreidel, dreidel, dreidel. \n\n            He tears open the wrapping paper to reveal a DREIDEL. He\n            looks at his gift, and then looks off-screen. We PAN with his\n            look to reveal...\n\n            A group of Christian children congregating around a large,\n            garishly decorated Christmas tree. A very Vegas Merry\n            Christmas sign flashes as a larger-than-life HI-FI version of\n            the Christmas song Jingle Bells blares. The children\n            festively slap high fives as they open their presents.\n\n            We cut to a SLOW-MOTION CU of Gentile Boy 1 enamored with his\n            brand new ATC motorbike.\n\n            We cut to a SLOW-MOTION CU of Gentile Girl 1. She wears an \"I\n            Love Jesus\" T-shirt and holds an adorable dog with a bow\n            affixed to its head in her arms. It licks her on the face.\n\n            We cut back to Mordechai. He looks down at his pathetic\n            excuse for a present. He's on the verge of tears. \n\n            Gentile Boy 1 calls to Mordechai as he drives his ATC.  \n\n                                GENTILE BOY 1\n                      Hey everybody! Look what Mordechai got.\n                      Nice spinning top Morty. \n\n            The other children take notice of Mordechai's gift and begin\n            to laugh. \n\n            Mordechai is crushed. MRS. HIGHSMITH (40's), an incredibly\n            Waspy teacher puts down her copy of 'Modern W.A.S.P.,' and\n            appears genuinely concerned by the teasing Mordechai has\n            weathered. She walks over to comfort him.\n\n                                MRS. HIGHSMITH\n                      Now, now class let's not make fun of\n                      Mordechai's spinning top. We need to all\n                      learn the importance of tolerance and\n                      understanding. Isn't that right\n                      Mordechai?\n\n                                MORDECHAI\n                      Yes Mrs. Highsmith.\n\n                                MRS. HIGHSMITH\n                      So class, in honor of Mordechai's special\n                      day, I'd like for all of us to wish Morty\n                      a heartfelt Merry... \n\n            She looks to Mordechai for confirmation on the word.\n\n                                MRS. HIGHSMITH (CONT'D)\n                          (Stumbling)\n                      \tCha-noo-kuh Day 7.\n\n            In unison, the class attempts to repeat the words, but all\n            suffer various degrees of pronunciation problems.\n\n                                MRS. HIGHSMITH (CONT'D)\n                      Very good class. I hope you've all\n                      learned an important lesson today. Just\n                      because Mordechai's people are different\n                      from us...just because they might appear\n                      strange to us with their furry hats,\n                      their beady eyes, and their long\n                      sideburns...not to mention their bizarre\n                      customs and unnecessarily guttural, funny\n                      sounding names...just because they\n                      control all of the worlds' money, yet are\n                      too cheap to buy their children anything\n                      better than spinning tops for presents,\n                      does not mean that we can't learn to\n                      respect and love them as our equals.\n\n            She squeezes his cheek.\n\n                                MRS. HIGHSMITH (CONT'D)\n                      Happy Chanoo-juah-kah Day 7 Morty.\n\n            A reaction shot of the mortified Morty.\n\n                                                                 CUT TO:\n\n            EXT. GHETTO STREET - NIGHT\n\n            A sullen Mordechai wanders the streets. Absurd XMAS\n            DECORATIONS, horrific in their appearance blanket the street. \n\n            Morty glances a GROTESQUE FAUX REINDEER with fangs. We hear a\n            growling noise as it lights up. He walks quickly away in fear\n            past... \n\n            A STOREFRONT\n\n            We track with Morty as he passes a storefront window. Inside,\n            the CLERK turns a sign outwards reading, \"JEWS NOT WELCOME.\"\n            We continue with Morty as he passes by a second storefront. A\n            similar sign reading, \"KYKES GO HOME\" is turned outwards by\n            ANOTHER CLERK. He continues past yet another building as a\n            sign reading, \"MONOTHEISTS NEED NOT APPLY\" is displayed by a\n            THIRD CLERK for Morty's benefit.\n\n            Morty looks across the street.\n\n            A sign hangs from a storefront reading \"JEWS OK FOR ABOUT 5\n            MINUTES.\" The FOURTH CLERK gives him the thumbs up.\n\n            Morty finds a spot on the sidewalk outside the building and\n            pulls out his dreidel. \n\n            He spins it, and we hold on the spinning top for a few beats\n            as Morty stares at in wonderment. \n\n            Suddenly, a huge black boot comes crashing down into frame\n            and smashes the little dreidel. Mordechai slowly looks up. \n\n            A menacing SANTA CLAUS gives him the finger, and exits frame\n            as we hear him sadistically laugh O.S. the words \"Ho, ho, ho\"\n            at Morty.\n\n            We start CLOSE on Mordechai. Rage fills every inch of his\n            face. As we SLOWLY CRANE AWAY, the opening CREDITS begin as\n            the HEBREW HAMMER THEME SONG kicks into full gear.\n\n                                                                 CUT TO:\n\n            TITLE SEQUENCE\n\n            As the Jewxploitation music pumps, metallic slashes rip\n            through the screen line by line, spinning into place to form\n            a Star Of David. The title, \"The Hebrew Hammer\" SLAMS into\n            frame.\n\n            TITLE CARD: HANUKKAH PRESENT\n\n            EXT. THE CHOOD - DAY\n\n            We start CLOSE on a gift wrapped Hanukkah present. We pull\n            back a bit as MORDECHAI JEFFERSON CARVER (29), AKA THE HEBREW\n            HAMMER, a baaad Jewish brother spins the package in his hands\n            as he saunters down the street past a latke stand. He's a\n            Semitic super stud straight out of a 70's Blaxploitation\n            flick. He tosses the gift to MACCABEE, a young Hasidic boy. \n\n                                HAMMER\n                      Happy Hanukkah Maccabee.\n\n            Macabee tears open the wrapping paper and holds up the gift -\n            a Hebrew Hammer action figure. He beams.\n\n            We cut back to the Hammer as he smiles back. From O.C., we\n            hear Maccabee say...\n\n                                MACCABEE (O.C.)\n                      Thanks Hammer!\n\n            The Hammer smiles back and walks off frame.\n\n            ANOTHER PART OF THE CHOOD\n\n            We begin on the Hammer's black boots and slowly TILT up as we\n            DOLLY back with him.\n\n            The Hammer passes a line of THREE JEWISH PRINCESSES who swoon\n            as he passes. \n\n            He stops below the sign of a butcher shop that reads, \"100%\n            KOSHER MEAT.\" We PUSH into his CLOSE UP as he blows them all\n            a kiss.\n\n            The pubic area of their dresses moisten in synchrony.\n\n            The Hammer winks back.\n\n            An OLD WOMAN calls to the Hammer from the window of a second\n            story flat. \n\n                                OLD WOMAN\n                      Hammer, why don't you come eat by us for\n                      Shabat. My Miriam is all grown up now.\n                      God willing, you should settle down and\n                      marry.\n\n            We punch in to a CLOSE UP of a demure Miriam as the Hammer\n            takes stock of the goods. She is an atrociously ugly girl\n            wearing orthodontic headgear, and bespectacled with a pair\n            oversized librarian's glasses.\n\n            The Hammer shakes off his wave of nausea.\n\n                                HAMMER\n                      Thanks for the invite Mrs. Kleinman, but\n                      right now G dash d's the only one for me. \n\n                                OLD WOMAN\n                      I can dig it.\n\n            The Hammer continues on down the street. The old woman and\n            Miriam are framed in the BG.\n\n                                OLD WOMAN (CONT'D)\n                      Hammer, you're the baaddest Hebe this\n                      side of Tel Aviv.\n\n            The Hammer stops for a second and smiles at the compliment.\n\n                                HAMMER\n                          (To himself)\n                      Shabat Shalom!\n\n             He walks off frame.\n\n            EXT. GHETTO ALLEY - MOMENTS LATER\n\n            Some TEENAGE GENTILE BOYS play keep away with a yarmulke\n            belonging to SHLOMO, another young Hasidic kid.\n\n                                SHLOMO\n                      Give it back! Give me back my yarmulke!\n\n                                TEENAGE GENTILE \n                      Hey Teddy, throw me the frisbee.\n\n            TEDDY (the non-speaking teen Gentile) throws the yarmulke,\n            and we FOLLOW it as it spins towards another TEENAGE GENTILE.\n            The other Teenage Gentile excitedly extends his hands to\n            catch, but right before it reaches him another hand comes\n            into frame and snatches it. He looks up, and we cut to his...  \n\n            POV as we tilt up to reveal The Hammer. He looks pretty damn\n            big and pissed off from this angle.\n\n            The Teenage Gentile  begins to shake and stammer.\n\n                                TEENAGE GENTILE (CONT'D)\n                      We...we were going to give it back. I\n                      swear to god.\n\n                                HAMMER\n                      Did you just take god's name in vain?\n\n                                TEENAGE GENTILE \n                      No, no. It...It's not like that. We were\n                      just about...\n\n                                HAMMER\n                      Just about to leave, right?\n\n                                TEENAGE GENTILE \n                      Yeah, yeah, that's right. We were just\n                      about to leave. C'mon Teddy.\n\n            The two run off.\n\n            The Hammer looks down to Shlomo. His spirit seems broken.\n\n                                HAMMER\n                      You alright?\n\n                                SHLOMO\n                      I guess. Sometimes I wonder why I even\n                      bother praying to one god.\n\n                                HAMMER\n                      Hey, hey! Be proud of who you are. You're\n                      a bad, bold, big-nosed, biblical brother.\n                      You feelin' me?\n\n            The kid's morale is boosted.\n\n                                SHLOMO\n                      Yeah. You're right.\n\n                                HAMMER\n                      Aveenooh Shalom Alechem little brother.\n\n            The Hammer pounds his fist into his chest ala the Black\n            Panthers. The kid returns the gesture.\n\n                                SHLOMO\n                      Thanks Hammer.\n\n            The Hammer points at him as he leaves.\n\n                                HAMMER\n                      Stay Jewish.\n\n            EXT. 'HEBREW HAMMER INVESTIGATIONS' OFFICE BUILDING - DAY\n\n            The Hammer walks up the stairs and past the sign advertising\n            his office. \n\n            The Hammer theme music winds down, punctuated with Shaft-like\n            brass hits. However, the brass hits become incredibly\n            overblown and extraneous.\n\n            The Hammer walks back into frame from the stairway to his\n            office. He looks around strangely for the source of the\n            music.\n\n            INT. 'HEBREW HAMMER INVESTIGATIONS' OFFICE BUILDING - MOMENTS\n            LATER\n\n            TIKKVA (Late 30's), the Hammer's very nasaly Laawng Island\n            secretary, files her nails furiously as the Hammer enters the\n            office. A MUZAK version of the Hammer Theme song plays over\n            the office PA system.\n\n                                HAMMER\n                      Happy Hanukkah Tikva. \n\n                                TIKVA\n                      Happy Hanukkah Morty.\n\n            The Hammer tosses his Shtreml and we WHIP with it as lands\n            squarely on the hat rack.\n\n            We cut back to the Hammer. He's wearing a yarmulke.\n\n                                HAMMER\n                      So, what's shakin' Yenta.\n\n                                TIKVA\n                      Well, for stahters, your mother called.\n                      She said to remind you that you're having\n                      Shabat Dinner by her tomorrow, and also\n                      to remind you to bring the Manischewitz,\n                      and she wanted me to relate the following\n                      information to you. \n\n                                HAMMER\n                      Okay, what's the information?\n\n                                TIKVA\n                      She said to remind you that you're having\n                      Shabat dinner by her tomorrow and also to\n                      remind you to bring the Manischewitz.\n\n            The Hammer lets this sink in. \n\n                                HAMMER\n                      Anything else?\n\n                                TIKVA\n                      Yeah, I'm going to be out of the office\n                      from 1:30 to 3:00 on Sunday. I have a\n                      terrible yeast infection and I need to\n                      see my gynecologist.\n\n                                HAMMER\n                      But we're not open on Sundays.\n\n                                TIKVA\n                      I understand that. I just thought that\n                      you might want to know.\n\n                                HAMMER\n                          (Beat)\n                      I'll be in my office.\n\n            The Hammer walks into his private office and shuts the\n            frosted glass door. We hold on what's stenciled on the\n            outside of the door. The lettering reads, \"Mordechai\n            Jefferson Carver - Certified Circumcised Dick - State of New\n            York.\"\n\n                                                   YET TBD TRANSITION TO:\n\n            EXT. NORTH POLE - DAY\n\n            An establishing shot of Santa's Workshop. The lettering\n            \"NORTH POLE - SANTA'S WORKSHOP\" is superimposed over the\n            picture.\n\n            INT. SANTA'S CONFERENCE ROOM - DAY\n\n                                SANTA CLAUS (O.S.)\n                      I want to start by thanking all of you\n                      for pulling yourselves away from the\n                      workshop to make this emergency meeting.\n                      I know it's the busiest time of the year\n                      for all of you, so I'll try and be brief.\n\n            As Santa speaks, we begin on a painting of a meek and\n            frightened looking Santa Claus. His eyes look fearfully to\n            his right.  Below the picture frame is a plaque reading \"St.\n            Nick the Nervous. 1871-1941\", we continue a slow DOLLY to the\n            right on to the next picture.\n\n            We see another Santa Claus, much more treacherous in his\n            appearance. His eyes are fixed menacingly on the picture of\n            Santa to his left. The plaque below his picture read, \"St.\n            Nick The Nasty 1941-1970.\"\n\n            We continue our DOLLY to the right, finally ending on a\n            painting of a jolly, portly Santa. Below his picture the\n            plaque reads, \"St. Nick The Nice. 1970-Christmas Present.\"\n\n            We cut to a WIDE shot of a Conference Room. The same nice\n            Santa Claus from the last picture addresses a handful of\n            ELVES. Two reindeer flank Santa on either side. Their\n            nameplates hang from their necks - \"BLITZEN\" and \"RUDOLPH.\"\n\n            At the other end of the table from Santa sits his son DAMIAN,\n            quite a nasty looking man. \n\n                                SANTA CLAUS (CONT'D)\n                      My father, often referred to as St. Nick\n                      The Nasty, was a tyrannical man. He was\n                      obsessed with making Christmas the only\n                      holiday anyone could celebrate before the\n                      New Year.\n                      Since his death, I've prided myself on\n                      ensuring that the Christmas season is one\n                      of tolerance and understanding between\n                      all races and religions. It's always been\n                      my belief that Hanukkah and Kwanzaa\n                      deserve the same respect as Christmas. \n\n            Damian whispers to an elf on his right hand side, and then\n            makes the JERKING OFF motion with his hand. \n\n                                SANTA CLAUS (CONT'D)\n                      Lights please.\n\n            As Rudolph's nose dims, so do the lights in the room. Santa\n            picks up a remote in his hand, and turns on a SLIDE\n            PROJECTOR.\n\n                                SANTA CLAUS (CONT'D)\n                      Over the course of my career as Santa\n                      Claus, I've made it my mission to ensure\n                      that Jews, Christians, and African\n                      Americans could all observe their\n                      respective holidays in harmony.\n\n            We see a slide of THE HEBREW HAMMER, an African American man\n            (Mohammed), and Santa Claus arm in arm below a banner in a\n            mall reading \"HAPPY HOLIDAYS!\"\n\n                                SANTA CLAUS (CONT'D)\n                      I was responsible for pushing the Happy\n                      Holidays Ordinance, in which all Merry\n                      Christmas signage was replaced by the\n                      Trans-relgious and inoffensive phrase\n                      'Happy Holidays.'\n\n            We see another slide in which an assembly of SCHOOLCHILDREN\n            are singing.\n\n                                SANTA CLAUS (CONT'D)\n                      It was nearly a decade ago, in\n                      conjunction with our friends in the\n                      Jewish and African American communities \n                      that I supported a bill that mandated\n                      that 'Dreidel, dreidel, dreidel' and 'I'm\n                      dreaming of a bright Kwanzaa' be taught\n                      and sung in elementary schools along with\n                      the Christmas standards 'Frosty The\n                      Snowman', and 'Deck The Halls.' \n                      Which is why upon examination of my\n                      annual naughty and nice list it shocked\n                      me to discover that my own son, Damian...\n\n            Damian, preoccupied with the cigarette he's attempting to\n            light, looks up in response to his name.\n            A brown bagged bottle of booze now sits on the table in front\n            of him. We can see Santa and the reindeer in silhouette on\n            the slide projection screen behind him.\n\n                                SANTA CLAUS (CONT'D)\n                      The heir to the Red Suit could be so\n                      filled with hate. \n\n            Santa addresses Damian.\n\n                                SANTA CLAUS (CONT'D)\n                      Damian, when I learned of your ludicrous\n                      scheme to wipe out Hanukkah, my first\n                      reaction was one of disgust. Now, I'm\n                      only filled with sadness and\n                      disappointment. Disappointed that I\n                      failed to teach you the true meaning of\n                      Christmas. What do you have to say for\n                      yourself?\n\n            We being a SLOW PUSH into Damian as he ponders the question.\n            The cigarette dangles from his lips. \n\n            Rudolph nods to Blitzen. Blitzen returns the gesture with a\n            nod of acknowledgment.\n\n            With a slow and measured pace Damian says...\n\n                                DAMIAN\n                      Ho. Ho. Ho.\n\n            On the slide projector screen behind Damian, we see the\n            silhouetted images of Blitzen and Rudolph goring Santa\n            through the chest with their antlers. Damian cringes.\n\n            Blood trickles from Santa's mouth, and with his last breath\n            he utters the words...\n\n                                SANTA CLAUS\n                      Et tu, Blitzen?\n\n            Santa falls out of frame with a thud. Standing behind him\n            with bloodied antlers is Blitzen. \n\n            Damian walks over to the newly deceased Santa, takes his\n            bloodstained Santa's hat, and put it on his own head. From\n            this point on in the screenplay, Damian will now be referred\n            to as SANTA.\n\n            The elves in the room, in various stages of shock, stare at\n            their new master in horror.\n\n                                SANTA \n                      What are you fucking midgets looking at!?\n                      Get back to work! We have Hanukkah to\n                      destroy!\n\n                                                   STAR OF DAVID WIPE TO:\n\n            EXT. THE JEWISH DEFENSE LEAGUE - DAY\n\n            A building resembling the Pentagon with the exception that\n            it's shaped like the Star Of David. Superimposed over the\n            picture are the words, \"JEWISH DEFENSE LEAGUE.\"\n\n            INT. THE JEWISH DEFENSE LEAGUE - DAY\n\n            A smoky chamber reminiscent of the Senate or the United\n            Nations. A GIANT BANNER reading \"HANUKKAH NOW!,\" illustrated\n            with a Hasid in silhouette with his fist raised, covers the\n            back wall behind the men.\n\n            As with the Senate House Committee, various factions of the\n            JDL sit behind plaques describing the group they represent.\n            We see members from: The Anti-Defamation League, Jews Against\n            Drunk Driving, etc. A chair belonging to THE COALITION OF\n            JEWISH ATHLETES is empty.\n\n            The floor is chaotic. The JDL Chief bangs his gavel and\n            yells...\n\n                                CHIEF\n                      Gentleman! \n\n            His pleas for silence are ignored.\n\n                                CHIEF (CONT'D)\n                      Gentleman! Please!\n\n            Still chaos. He flips a light switch on and off a few times\n            as he says...\n\n                                CHIEF (CONT'D)\n                      Sheket B'vakasha! Sheket B'vakasha!\n\n            The entire hall responds in unison...\n\n                                HALL\n                      Hey!\n\n            The room falls silent. Every member of the JDL sits straight\n            up with their hands folded in front of them.\n\n                                 CHIEF\n                      The time for action is now. We predict\n                      that the St. Nick Day Massacre will put\n                      Hanukkah-Christmas relations back at\n                      least a hundred years. With this\n                      meshuggena new Santa Claus in power,\n                      Hanukkah is in jeopardy. Our first order\n                      of business is to put into motion a plan\n                      to create goodwill towards the Jewish\n                      Community. Mr. Chairman of the Worldwide\n                      Jewish Media Conspiracy.\n\n            HARVEY WEINSTEIN sits before a plaque reading, \"HARVEY\n            WEINSTEIN - CHAIRMAN WORLDWIDE JEWISH MEDIA CONSPIRACY\"\n\n                                HARVEY WEINSTEIN\n                      Yes Chief.\n\n                                CHIEF\n                      We need your people to crank out a couple\n                      more award winning documentaries on the\n                      Holocaust, possibly a new Adam Sandler\n                      movie.\n\n            The CHAIRMAN OF THE ANTI-DEFAMATION LEAGUE pipes in.\n\n                                ADL CHAIRMAN\n                      Not another Adam Sandler movie!\n\n                                HARVEY WEINSTEIN\n                      What's wrong with Adam Sandler movies? \n\n                                ADL CHAIRMAN\n                      We're trying to create goodwill here. I\n                      just think... \n\n                                HARVEY WEINSTEIN\n                      Frankly, I don't care what you think. I\n                      think you're a putz.\n\n            The plaque reading \"Anti-Defamation League\" is clearly framed\n            in this shot.\n\n                                ADL CHAIRMAN\n                          (Beat)\n                      Don't defame me. I'm against that.\n\n                                CHIEF\n                      Focus people. Our next order of business\n                      is to assign an agent to track Santa's\n                      activities. Step in and use force if the\n                      situation calls for it.\n                      We need to put the toughest Jew we have\n                      on the case. Suggestions? Suggestions,\n                      anybody?\n\n            One of the JDL MEMBERS calls out.\n\n                                JDL MEMBER 1\n                      What about Steven Spielberg?\n\n                                CHIEF\n                      C'mon, he made ET. We need someone tough\n                      people.\n\n            A SECOND MEMBER calls out.\n\n                                JDL MEMBER 2\n                      What about Itzahk Perlman?\n\n                                CHIEF\n                      He's in a wheelchair for crying out loud.\n\n            We stay on the chief while we hear offscreen...\n\n                                JDL MEMBER'S 3 AND 4 (O.S.)\n                      Allen Greenspan? Henry Kissinger?\n\n                                CHIEF\n                      Too old.\n\n                                ADL CHAIRMAN\n                      Joe Lieberman?\n\n                                CHIEF\n                      Missing in action.\n\n                                JDL MEMBER 1\n                      Robert Shapiro?\n\n                                CHIEF\n                      He's a lawyer. We're looking for heros\n                      people.\n\n                                HARVEY WEINSTEIN\n                      David Copperfield?\n\n                                CHIEF\n                      What's he gonna do, make Santa disappear?\n                      Think people think. We need a hard\n                      hittin' Hebe on this one. \n\n            At the back of the room, ESTHER (25), a Semitic siren, pushes\n            her way to the front. A black skirt covers every inch of her\n            sexy figure.\n\n                                ESTHER\n                      What about Mordechai Jefferson Carver? \n\n            The hall fills with hushed voices as the various members of\n            the JDL whisper to one another.\n\n                                CHIEF\n                      The Hebrew Hammer? No. No way. After the\n                      way he handled that situation in the West\n                      Bank? He's the only Jew in the world too\n                      extreme for the JDL. There's a reason why\n                      we kicked him out of our ranks,\n                      sweetheart. We need a man who can follow\n                      orders. A man with self-control. We need\n                      a man...\n\n            The COUNCIL ELDER, a sage looking elderly Jewish man\n            interrupts. The plaque in front of him reads, \"SAGE ELDERLY\n            JEWISH LEADER.\"\n\n                                COUNCIL ELDER\n                      ...We need a man who can get the job\n                      done.\n\n                                ESTHER\n                      Daddy, he's our only hope. And you know\n                      it.\n\n            The Chief nods his head reluctantly.\n\n                                ADL CHAIRMAN\n                      Only problem is, ever since we kicked him\n                      out, he wants nothing to do with us.\n                      There's no way we can persuade him to\n                      come back.\n\n            Esther lifts her skirt a few inches.\n\n                                ESTHER\n                      Perhaps I can persuade him.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            INT. HEBREW HAMMER INVESTIGATIONS - PRIVATE OFFICE - DAY\n\n            A shoddy low-rent office replete with Film Noirish lighting\n            via the blinds. The Hammer fiddles with a dreidel as he sits\n            with his feet propped up on his desk. His Shtreml hat is\n            skewed to one side and a toothpick dangles from his lips.\n\n                                \tHAMMER (V.O.)\n                      It was the day before Hanukkah when she\n                      strolled into my office.\n\n            There is knock at the door.\n\n                                HAMMER (CONT'D)\n                      Come in.\n\n            The door opens to reveal a long denim skirt covering every\n            possible inch of flesh. We tilt up the length of the skirt to\n            reveal Esther. She is breathtakingly sexy.\n\n            The Hammer quickly removes his feet from the table. Esther\n            approaches his desk and sits.\n\n                                ESTHER\n                      Mr. Jefferson Carver?\n\n                                HAMMER\n                      Please, call me Mordechai.\n\n                                HAMMER (V.O.) (CONT'D)\n                      From the way she carried herself I could\n                      tell she'd been around the block a few\n                      times...\n\n                                ESTHER\n                      Sorry I'm late. Traffic was a pisher, and\n                      I've been circling the block for the past\n                      half hour looking for parking. What are\n                      you listening to?\n\n                                HAMMER (V.O.)\n                      Oh, the things I would do to her if I had\n                      the...\n\n            The Hammer attempts to press stop on his tape recorder, but\n            accidentally FAST FORWARDS to another part of the tape. We\n            hear the sound of SEXUAL INTERCOURSE. The Hammer scrambles\n            for the STOP button. \n\n                                HAMMER (CONT'D)\n                      Client notes. Sorry.\n                          (Beat)\n                      What can I do for you?\n\n                                ESTHER\n                      My name is Esther. Chief\n                      Bloomenbergensteinenthal from the Jewish\n                      Defense League desperately needs to speak\n                      with you.  \n\n                                HAMMER\n                      How is old Chief\n                      Bloomenbergensteinenthal?\n                      Is he still shtooping every girl he can\n                      get his hands on? \n\n                                ESTHER\n                          (Annoyed)\n                      Actually, his days of marital infidelity\n                      have long since past. Now he just shtoops\n                      my mother exclusively.\n\n            The Hammer makes the realization.\n\n                                HAMMER\n                      Your mother? Oh. Whoops.\n\n                                ESTHER\n                      Mordechai, Santa Claus has been rubbed\n                      out by his son Damian. The man's a demon.\n                      There's no telling what this new anti\n                      semitic psycho Santa is capable of.\n\n                                HAMMER\n                      I'm sorry to hear about Santa. He was a\n                      good friend, but my days...\n\n            The Hammer stops himself and glances over Esther's shoulder.\n\n            In the doorway stands a BLONDE BOMBSHELL in a mink coat.\n\n                                BLONDE BOMBSHELL\n                      Mr. Hammer? I'd like to hire you to put a\n                      tail on my husband. I think my life might\n                      be in danger. I think he wants to kill\n                      me.\n\n                                HAMMER\n                      Sorry Shiksa, I think you got the wrong\n                      office. I'm the Hebrew Hammer. Mike\n                      Hammer's down the hall.\n\n            The Blonde Bombshell is confused for a moment.\n\n                                BLONDE BOMBSHELL\n                      Oh. \n\n            She leaves.\n\n                                HAMMER\n                      Listen. Esther, you seem like a nice\n                      girl, so I'm only gonna say this once. I\n                      no longer affiliate myself with that\n                      organization. The politics there were\n                      brutal. Besides, I've already got a full\n                      case load.\n\n            Esther looks down at his desk.\n\n            We cut to a shot of the Hammer's In/Out Box. Both are\n            completely empty, and thickly coated with spiderwebs. \n\n            The Hammer takes notice of her expression of skepticism.\n\n                                HAMMER (CONT'D)\n                      That's...uh...that's all done\n                      electronically now.\n\n            Still a look of disbelief.\n\n                                ESTHER\n                      Why are you being so difficult? All my\n                      father wants is to just speak with...\n\n                                HAMMER\n                      I hate to cut you short, but in an hour\n                      the sun goes down, and then it's\n                      officially the Sabbath. I can't work on\n                      the Sabbath. This is where we're going to\n                      have to part ways boobola.\n\n            The Hammer grabs his overcoat from the coat rack. Esther gets\n            up as well.\n\n                                ESTHER\n                      I'm not leaving your side until I get you\n                      to agree to come speak with my father.\n\n            It's obvious the Hammer's amused by her persistence. \n\n                                HAMMER\n                      Be my guest. But I have to warn you, I'm\n                      going to my mother's for dinner tonight.\n                      And if you think I'm difficult, wait till\n                      you meet her.\n\n            The two walk towards the front door of the office.\n\n                                ESTHER\n                          (Solemnly)\n                      Before we leave, there's just one more\n                      thing. I noticed that the sign on your\n                      door says you're a certified circumcised\n                      dick. Would you mind if I asked to see\n                      your credentials?\n\n            The Hammer looks directly into the camera and shakes his head\n            proudly.\n\n                                                                 CUT TO:\n\n            EXT. MRS. CARVER'S HOUSE - SHABAT \n\n            We start on the outside of the front door as we hear the Ding\n            of the doorbell. MRS. CARVER, the epitome of Jewish\n            motherhood opens the door. \n\n            For all the Gentiles reading, I thought I might digress for\n            just a moment. JEWISH MOTHER (adj.) A complicated and\n            charismatic package of the following qualities rolled into\n            human female form: intense, judgmental, overbearing,\n            manipulative, lacking boundaries, yet fiercely involved,\n            loving, and protective of her children. Got it?\n\n                                MRS. CARVER\n                      Mordechai! Shabat Shalom!\n\n            The Hammer pulls a bottle of wine out from a paper bag.\n\n                                HAMMER\n                      Shabat Shalom mama. I brought some\n                      Manischewitz. The black label.\n\n                                MRS. CARVER\n                      I can see. And you also brought a nice\n                      girl to come eat by us.\n\n            Mrs. Carver forcefully grabs Esther into an embrace\n            resembling a bear hug, and begins to plaster her with sloppy\n            kisses. Esther is visibly overwhelmed by it all as the\n            kissing and embracing continue for a bit too long.\n\n            Mrs. Carver places her tongue into Esther's ear canal as a\n            sign of affection, forcing Esther to break the embrace. Mrs.\n            Carver and Esther look at one another strangely for an\n            awkward few moments.\n\n                                MRS. CARVER (CONT'D)\n                      So. Do you have a name?\n\n                                ESTHER\n                      It's Esther.\n\n                                MRS. CARVER\n                          (She sighs ferclempt)\n                      From the story of Purim.\n                          (To Hammer)\n                      Well, now that we're all acquainted,\n                      let's sit down and start the Sabbath.\n\n                                                                 CUT TO:\n\n            TITLE CARD: 4 HOURS LATER\n\n            INT. MRS. CARVER'S DINING ROOM - 4 HOURS LATER\n\n            The Hammer and Esther grasp their stomachs which protrude\n            from underneath their slightly unbuttoned shirts. Plates of\n            half-eaten food are everywhere. On the table, on the dining\n            room furniture behind them, etc.\n\n                                HAMMER\n                      Oy vey, I'm stuffed.\n\n                                ESTHER\n                      I don't think I could eat another latke\n                      if you paid me.\n\n            Mrs. Carver enters the dining room through the kitchen door\n            carrying an enormous platter loaded with serving dish after\n            serving dish of food.\n\n                                MRS. CARVER\n                      Everybody ready for the main course?\n\n            Esther and the Hammer exchange looks.\n\n                                HAMMER\n                      Mom, I think we've had enough.\n\n            Mrs. Carver places the food on a dresser opposite the kitchen\n            table and then sits. \n\n                                MRS. CARVER\n                          (Hysterically)\n                      Nonsense young man. You'll eat everything\n                      in front of you. After all, there are\n                      people starving in China. Isn't that\n                      right Mun Chi?\n\n            We cut to a previously unseen end of the table. MUN CHI, a\n            skin and bones elderly Chinese man looks up in response to\n            his name. The plate directly in front of him is still\n            pristine. He mutters something in Chinese and then reaches\n            for a chicken wing on a platter in the middle of the table.\n\n            Mrs. Carver smacks his hands away with a wooden salad spoon\n            and then glares at him.\n\n                                MRS. CARVER (CONT'D)\n                      Not until Mordechai finishes everything\n                      in front of him. \n\n            Mrs. Carver directs her piercing stare at the Hammer.\n\n                                MRS. CARVER (CONT'D)\n                      Mordechai!?\n                          (Beat)\n                      So, Esther, how did you and Mordechai\n                      meet. You know they call him the Hebrew\n                      Hammer for a reason.\n\n            Esther coughs up some of her food. The Hammer interjects.\n\n                                HAMMER\n                      Mom! Esther works for the JDL. They sent\n                      her to try and recruit me back to save\n                      Hanukkah for them. What she doesn't seem\n                      to understand is that nothing, not even\n                      god himself could convince me to ever\n                      work for them again.\n\n                                ESTHER\n                      But Hanukkah's in dan...\n\n            The Hammer cuts her off.\n\n                                HAMMER\n                      Not my problem. If you'll excuse me now,\n                      I need to use the bathroom.\n\n            He stands and leaves.\n\n            Mrs. Carver stares lovingly at Esther.\n\n                                MRS. CARVER\n                      You like my Mordechai, yes?\n\n                                ESTHER\n                      He's...he's very nice. \t\n                          (Desperately)\n                      But Mrs. Carver, the fate of Hanukkah\n                      rests solely in his hands. Please, you\n                      have to help me.\n\n                                MRS. CARVER\n                      Hanukkah, Shmanukkah. It isn't even one\n                      of the high holidays. What concerns me\n                      more is that my boychick is almost\n                      thirty, and has yet to settle down with a\n                      nice Jewish girl. \n                          (Beat)\n                      I'll make you a deal. I'll help you with\n                      your little Hanukkah problem if you help\n                      me with my Mordechai. \n\n                                ESTHER\n                          (Confused)\n                      What do you want me to do?\n\n                                MRS. CARVER\n                      He works too much. God forbid he should\n                      have a nice Jewish girl come eat by him\n                      once in a while. Take his mind off his\n                      work. Maybe a blowjob here and there. \n\n            Esther begins to choke again.\n\n                                MRS. CARVER (CONT'D)\n                      Is this something you could do for me?\n\n            The Hammer calls out from the bathroom.\n\n                                HAMMER\n                      Mom, where do you keep the plunger?\n\n                                MRS. CARVER\n                          (Yells)\n                      It's under the sink by my tampons!\n\n            Esther appears panicked.\n\n                                MRS. CARVER (CONT'D)\n                      So, do we have a deal?\n\n            In the BG, we hear the toilet FLUSH. The Hammer begins his\n            walk back to the table.\n\n                                ESTHER\n                      Deal.\n\n            The Hammer sits down.\n\n                                HAMMER\n                      So, what did you two ladies discuss while\n                      I was gone.\n\n            Esther begins to speak, but Mrs. Carver interrupts.\n\n                                MRS. CARVER\n                      I was just telling your nice friend\n                      Esther about how I used to have such a\n                      problem with the gas.\n                          (To Esther)\n                      So, once I started taking two charcoal\n                      pills before I ate, the gas cleared\n                      itself right up. \n\n            Esther plays along.\n\n                                ESTHER\n                      Thanks. That's...good to know.\n\n            Mrs. Carver turns her attention towards her son.\n\n                                MRS. CARVER\n                      Mordechai. Do you love your mother?\n\n                                HAMMER\n                      Mom, stop with this already. Of course I\n                      love you. You're my mother.\n\n                                MRS. CARVER\n                      Then how come you won't stop this\n                      Certified Circumcised Dick nonsense and\n                      get yourself a real job. \n\n                                HAMMER\n                      Mom, I have a real job. I do good things\n                      for this community. I help people.\n\n                                MRS. CARVER\n                      When I play bridge with all the girls,\n                      everyone has what to talk about with\n                      their sons. They show pictures. Their\n                      sons are lawyers and doctors and Rabbis.\n                      Why can't I show a picture?  \n\n                                HAMMER\n                          (Angered)\n                      So don't show a picture.\n\n                                MRS. CARVER\n                      You know my friend Maureen? Her son, the\n                      investment banker? He paid for her entire\n                      retirement in Boca Raton. What a mench he\n                      is. Instead of schleping to save\n                      Hanukkah, god forbid you should go back\n                      to business school and get an MBA. Maybe\n                      then you could send me to Boca, too.\n\n            This puts the Hammer into a neurotic fit.\n\n                                HAMMER\n                      Oh. Oh, What. So, all of a sudden my\n                      saving Hanukkah's not good enough for\n                      you? Is that what your saying?\n\n            Mrs. Carver throws her arms up in resignation.\n\n                                MRS. CARVER\n                      I don't want to argue with you. Let's\n                      just eat in peace.\n\n                                HAMMER\n                      No. No. We're gonna argue. And you know\n                      what mom? I'm going to save Hanukkah just\n                      to spite you. And when my face is all\n                      over the television. When your friends\n                      are opening their Hanukkah gifts next\n                      year, don't mention it to them, okay? I\n                      wouldn't want you to have to show my\n                      picture.\n\n                                MRS. CARVER\n                      Do what you must. \n\n            Mrs. Carver looks at Esther and winks.\n\n                                MRS. CARVER (CONT'D)\n                          (To Esther)\n                      Such a good boy he is.\n\n            The Hammer shakes his head in frustration.\n\n            Mrs. Carver becomes very animated.\n\n                                MRS. CARVER (CONT'D)\n                      Mazel Tov!\n\n            MAZEL TOV, a tabby with two paralyzed back legs wearing a\n            diaper slides itself across the floor. With each writhing\n            motion we hear a very distinct SWISHING NOISE. \n\n            Mrs. Carver picks the cat up and places it in her lap. Mazel\n            Tov makes a strange, UNHAPPY NOISE. \n\n                                MRS. CARVER (CONT'D)\n                      What's that Mazel Tov? Your diaper needs\n                      changing?\n\n            Mrs. Carver pulls off Mazel Tov's diaper while it still sits\n            in her lap. She plays with undiapered cat's two good paws.\n\n                                MRS. CARVER (CONT'D)\n                          (To Mazel Tov)\n                      Let's let your tuchus breathe.\n\n                                HAMMER\n                      Mom, why don't you put that cat out of\n                      its misery?\n\n                                MRS. CARVER\n                          (Extremely offended)\n                      Because it isn't god's way.\n                      When you spent the fourth grade in bed\n                      recovering from your bout with\n                      hypoglycemia, did I put you down? No.\n                      Mazel Tov will lead a full life just like\n                      the rest of us. Isn't that right Mazel\n                      Tov?\n\n            The cat purrs back at her. She takes the cat from her lap and\n            places it on the floor.\n\n            BROWN STREAKS cover her white blouse.\n\n                                MRS. CARVER (CONT'D)\n                      Anybody hungry for desert?\n\n                                                                 CUT TO:\n\n            EXT. JEWISH DEFENSE LEAGUE - SUNDAY\n\n            \"JEWISH DEFENSE LEAGUE - SUNDAY - 0800 Hrs - Year 5734\" is\n            typed out sequentially over the image of the building.\n\n            EXT. JEWISH DEFENSE LEAGUE FRONT GATE - CONTINUOUS\n\n            The exterior resembles any walled private residence with a\n            front gate. The Hammer stands in front of the large, metallic\n            Star Of David vault-like gate and pushes the button next to\n            it. A COMPUTERIZED VOICE begins...\n\n                                COMPUTERIZED VOICE\n                      Jew Confirmation Test initiated.\n\n            He's clearly irritated by this.\n\n                                HAMMER\n                      You've gotta be kidding me. They're still\n                      doing this?\n\n                                COMPUTERIZED VOICE\n                      Please state your full Hebrew name.\n\n                                HAMMER\n                      Mordechai Baruch Netanyahoo.\n\n            The vault-like gate slides open in a futuristic manner, and\n            the Hammer steps in. The gate shuts behind him, and he finds\n            himself in an all white room. A microphone is placed by\n            another massive door directly in front of him. \n\n                                COMPUTERIZED VOICE\n                      Please state the six dishes found on the\n                      Passover Seder plate in alphabetical\n                      order?\n\n                                HAMMER\n                      Beitzah, Charoset, Chazeret, Karpas,\n                      Maror, and Zeroa.\n\n            The second door slides open, and Morty steps forward into the\n            next room. Inside this room lies a single violin in a case.\n\n                                COMPUTERIZED VOICE\n                      Please demonstrate musical aptitude.\n\n            The Hammer picks up the violin and begins to play 'Hava\n            Nagila.' He's pretty damn good at it. The next door slides\n            open, and Hammer steps forward into yet another room.\n\n            A drape, about four feet high off the floor, is stretched\n            into a semi-circle against the wall of the room. \n\n                                COMPUTERIZED VOICE (CONT'D)\n                      Please step forward and remove your\n                      undergarments.\n\n            The Hammer steps inside the drape, and drops his pants.\n\n            A panel on the wall opens, and a metal probe heads for his\n            shmekel. He is clearly uncomfortable with this bit of\n            testing.\n\n                                HAMMER\n                      Oooh. That's cold.\n\n                                COMPUTERIZED VOICE\n                      Circumcision confirmed. \n\n            The door slides open, and the Hammer quickly pulls his pants\n            up as he steps into the next room. The room is completely\n            empty with the exception of a one way mirror on the front\n            wall by the door.\n\n                                COMPUTERIZED VOICE (CONT'D)\n                      Final test initiated.\n\n            Nothing happens. The Hammer waits a few seconds, but quickly\n            becomes agitated.\n\n                                HAMMER\n                      Hello? Can anybody hear me? I think this\n                      machine is broken or something. Hello?\n                          (To himself)\n                      This is ridiculous! I didn't even want to\n                      come here. I shlep all the way out to the\n                      middle of nowhere, for lord knows what\n                      purpose, and...\n\n            We cut to the OTHER SIDE OF THE MIRROR. The Chief observes\n            the Hammer as he continues to whine. Next to them, a METER\n            with the label \"WHINING SCALE\" slowly grows in magnitude as\n            the Hammer continues to rant. The meter bars go from red to\n            yellow in color.\n\n                                HAMMER (CONT'D)\n                      I am so unhappy with this situation. Why\n                      Mordechai? Why do you always feel it\n                      necessary to do what other people want\n                      you to do? Why can't you be your own\n                      man...\n\n                                CHIEF\n                      Come on. Come on.\n\n            The meter bars switch from yellow to green, finally passing\n            the '0  - Jewish' mark.\n\n                                CHIEF (CONT'D)\n                          (To himself)\n                      He's still got it.\n\n            Back inside with the Hammer, the doors slide open, revealing\n            the Chief to the Hammer.\n\n                                CHIEF (CONT'D)\n                      Welcome back Hammer.\n\n                                                                 CUT TO:\n\n            INT. JEWISH DEFENSE LEAGUE - HALLWAY - MOMENTS LATER\n\n            The Hammer and the Chief make their way down the hallway.\n\n                                CHIEF\n                      Since you've been gone Hammer, some\n                      things have changed around here. Our\n                      agents are now subjected to a strict\n                      physical training regiment. Take a look.\n\n            The Chief stops at a door labeled \"Goldsmith's Gym.\" The sign\n            is illustrated with a picture of a Hasidic Jew squatting a\n            dumbbell a la Gold's Gym. The Chief opens the door. \n\n            INT. KARATE ROOM - CONTINUOUS\n\n            Inside, about FIVE or so HASIDS decked out in white Karate\n            gi's stand facing the door. By the front door, A GROUP\n            LEADER, notices the Hammer, and walks towards the door. He\n            bows with his hands folded in front of him as a sign of\n            respect.\n\n            The Hammer returns the gesture.\n\n            The Group Leader shakes his head in one last respect, and\n            then turns away from the Hammer as he goes back to his class.\n            On the back of his gi is written the word \"JEW-DO.\"\n\n                                HAMMER\n                      A minion practicing Jew-do, the deadly\n                      fighting art. Cool.\n\n                                CHIEF\n                      There's more. Follow me.\n\n            The two leave, and continue their walk down the hallway. An\n            agent with his back to camera fiddles with some HIGH-TECH\n            gadgetry that lines the walls.\n\n                                CHIEF (CONT'D)\n                      We've even relaxed our centuries old\n                      admissions criteria. \n\n            The Chief stops behind the man and taps him on the back. \n\n            SAMMY DAVIS JR. JR., the spitting image of Sammy, turns to\n            greet the two. \n\n                                CHIEF (CONT'D)\n                      Mordechai Jefferson Carver, I'd like for\n                      you to meet the Jewish Defense League's\n                      first black Jewish agent. A close\n                      personal friend of mine, agent Sammy\n                      Davis Jr. Jr.\n\n                                SAMMY DAVIS JR. JR.\n                      The Hebrew Hammer? I've heard about this\n                      cat. Your beautiful babe. Keep on keeping\n                      on. \n\n            The Hammer is a bit taken back.\n\n                                HAMMER\n                      Alright. I'll, uh, keep doing that.\n\n            Sammy's all smiles. \n\n                                CHIEF\n                      Sammy, if you'll excuse us, Mordechai and\n                      I have business to attend to.\n\n                                SAMMY DAVIS JR. JR.\n                      You two cats keeps purrin'. \n\n            INT. THE CHIEF'S OFFICE - DAY\n\n            Your standard 70's TV police Chief's office. The Hammer\n            enters and the Chief shuts the door behind him.\n\n                                CHIEF\n                      Alright Mordechai, now that we're alone I\n                      just want to say that I'm not happy about\n                      this. I don't want a repeat of that\n                      incident in the West Bank.\n\n                                HAMMER\n                      I got the job done didn't I? I did what I\n                      had to do.\n\n                                CHIEF\n                      A settlement completely demolished, ten\n                      smashed army jeeps, four dead Arabs. G\n                      dash D damn it, Hammer! You think you're\n                      above the Ten Commandments? Just find\n                      Santa Claus and bring him back to us. No\n                      heroics, got it?\n\n                                HAMMER\n                          (Smirks)\n                      Hey, it's your Bar Mitzvah. I'm just\n                      readin' the Torah portion.\n\n                                CHIEF\n                      Well it's good to see that you can be so\n                      nonchalant about the whole thing.\n\n                                HAMMER\n                          (Thinking)\n                      I guess I could be chalant about it, but\n                      then again I'm not even sure if that's a\n                      word. Listen Chief, we could stand around\n                      arguing all day, but I gotta case to\n                      crack.\n\n                                CHIEF\n                      What's your first move?\n\n                                HAMMER\n                      I'm gonna pay a visit to the K.L.F. See\n                      if they've got the 411 on Santa's\n                      location. I'll check in with you when I\n                      know more.\n\n            The Hammer heads for the door. \n\n                                CHIEF\n                      You be careful Hammer.\n\n            The Hammer walks out the door. The Chief calls to him.\n\n                                CHIEF (CONT'D)\n                      The fate of Hanukkah rests squarely on\n                      your shoulders.\n\n            A beat passes, and then the Hammer walks back in.\n\n                                HAMMER\n                      Okay. You guys have seriously got to stop\n                      with that stuff. That's a lot of pressure\n                      to put on one Jew. I'm only human you\n                      know. I'm already shvitzing about the\n                      whole thing. You know, believe it or not,\n                      I'm allowed to make mistakes, too. I can\n                      only do the best that I can do, and\n                      that's just gonna have to be good enough\n                      for all of you. \n\n            A reaction shot of the befuddled Chief.\n\n                                HAMMER (CONT'D)\n                      Just...just stop with that. Okay?\n                      Alright, I'm out of here.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            EXT. GHETTO STREETS - DAY\n\n            We see various shots of the Hammer's Caddy. The grill, the\n            white wall tires, the fuzzy dreidel hanging from the rear\n            view mirror, etc. Very 'Superfly.'\n\n            EXT. KWANZAA LIBERATION FRONT - DAY\n\n            We start on an incredibly impressive looking building. Over\n            this we see the words \"KWANZAA LIBERATION FRONT\" typed out\n            sequentially. The camera than tilts down to reveal a Popeye's\n            Chicken.\n\n            A BLACK TEENAGER scouts the street with a pair of binoculars. \n\n            BINOCULAR POV - Instead of the usual two circles, we see the\n            world through two cutouts of the African continent. The\n            Hammer's Caddy pulls up.\n\n                                BLACK TEENAGER \n                      Oh shit!\n\n            The teen runs inside.\n\n            The Hammer's Caddy pulls up to a stop right at camera, giving\n            us a full view of the license plate. It reads, \"LCHAIM.\" \n\n            INT. KWANZAA LIBERATION FRONT HQ - MOMENTS LATER\n\n            A handful of BAAAD BROTHERS, decked out in a mixture of\n            African clothing and combat gear relax to the sounds of\n            mellow Blaxploitation music. 'KWANZAA NOW!' posters and other\n            Pro-Kwanzaa propaganda hang on the walls of the room, machine\n            guns rest idly against sofas,  blunts are passed around.\n            We're talking Black Panthers here. A WHITE ACCOUNTANT counts\n            money at a card table to the side of the room.\n\n            The black teenager enters breathlessly.\n\n                                BLACK TEENAGER\n                      Hey, yo, we got ourselves a visitor.\n\n            O.S., one of the BAAAD BROTHERS inquires.\n\n                                BAAAD BROTHER (O.S.)\n                      Who is it?\n\n                                BLACK TEENAGER\n                      It's some pimped out Hebrew dude in a\n                      caddy.\n\n            The men scramble for their guns, inserting clips, and\n            removing safeties. \n\n            The front doors bust open, and we DOLLY into the Hammer.\n\n            All guns are trained on him. \n\n            From behind the frontline of gunmen, MOHAMMED, clearly the\n            leader of the operation, pushes his way through.\n\n            He walks towards the Hammer. You can feel the tension in the\n            room.\n\n                                MOHAMMED\n                      The Hebrew Hammer! My main Kike! \n\n                                HAMMER\n                      Mohammed Ali Paula Abdul Rahim. My main\n                      nigga!\n\n            The two embrace in a warm hug. The White Accountant looks up\n            in shock from the card table. His nametag is clearly visible,\n            and it reads, \"WHITE ACCOUNTANT.\" He points at Mohammed.\n\n                                WHITE ACCOUNTANT\n                      You...you just called him a Kike.\n\n            He points to the Hammer. \n\n                                WHITE ACCOUNTANT (CONT'D)\n                      And you. You just called him a Nigger.\n\n            The Hammer and Mohammed look to one another. They're having a\n            hard time understanding his concern.\n\n                                MOHAMMED\n                      Well it's okay when we call each other\n                      that.\n\n            The White Accountant thinks it over for a second.\n\n                                WHITE ACCOUNTANT\n                      Oh.\n\n            The other Brothers put their guns down and go back to their\n            pre-Hammer activities, and the accountant takes his place\n            back at the card table.   \n\n            Mohammed puts his arm around the Hammer.\n\n                                MOHAMMED\n                      So Morde-chai, tell me, what brings your\n                      bad self down to the KLF?\n\n                                HAMMER\n                      I'm back on the job for the JDL. You hear\n                      about that crazy white boy who took over\n                      as Santa?\n\n                                MOHAMMED\n                      Oh, most definitely. Got the brothers\n                      here in full alert mode.\n\n            The Hammer looks over at the Brothers smoking weed, making\n            out with their girlfriends, etc. Mohammed takes notice.\n\n                                MOHAMMED (CONT'D)\n                      Gotta always be cool under pressure. You\n                      know what I'm sayin.\n\n                                HAMMER\n                      True dat. True dat. So, what's the word\n                      on the street?\n\n                                MOHAMMED\n                      Word is that papa's got a brand new bag,\n                      and it's velvety red, and it ain't gonna\n                      be overnight Fed-Exed to Jerusalem. If\n                      you know what I mean. \n\n            This clearly flies over the Hammer's yarmulke.\n\n                                HAMMER\n                      Actually, I...I don't. What does that\n                      mean?\n\n                                MOHAMMED\n                      Oh. It means that Santa's gonna fuck\n                      Hanukkah's shit up.\n\n                                HAMMER\n                      Not if I can help it. You got any\n                      information for me?\n\n                                MOHAMMED\n                      I don't. But I know somebody who does.\n\n                                                                 CUT TO:\n\n            ANOTHER ROOM\n\n            Mohammed escorts the Hammer through a love beaded doorway\n            into a back room. Inside, JAMAL, a black elf, sits on a sofa.\n            A blunt hangs from his mouth and his arms are wrapped around\n            two GORGEOUS SISTERS. \n\n                                MOHAMMED (CONT'D)\n                      Jamal, I'd like for you to meet the\n                      Hebrew Hammer. \n\n            Jamal pulls his shades down slightly to get a better look.\n\n                                JAMAL\n                      'Sup.\n\n                                MOHAMMED\n                      I'd like for you to tell him what you\n                      told me.\n\n                                JAMAL\n                      A'ight, a'ight, cool. Yo, it's like this.\n                      That nigga Santy Claus be trippin'. First\n                      that motherfucker kills his own pops,\n                      then he start talkin' 'bout bustin a cap\n                      in Hanukkah's ass. Next, the racist\n                      motherfucker kick my ass out the\n                      workshop, sayin' that there ain't no room\n                      for no little colored elves like me. Can\n                      you believe that shit? Yo, if it wasn't\n                      for the arthritis in my joints, you best\n                      believe that I'd be...\n\n            Jamal makes the sideways gun holding gesture, and mock pulls\n            the trigger.\n\n                                JAMAL (CONT'D)\n                      ...blam! blam! blam! Bustin' caps all up\n                      in his ass. You know what I'm sayin'?\n\n                                HAMMER\n                      Is there anything else you can tell me?\n                      His hangouts, his next move, anything?\n\n            Jamal thinks for a second.\n\n                                JAMAL\n                      Well, come to think of it, there is one\n                      thing. Before I left, I was packin' up my\n                      shit and I overheard the nigga talkin' to\n                      some business pahtnah or something. Sayin\n                      that he'd meet him today at some joint\n                      called Duke's. Round five o'clock if my\n                      memory serves. When he got off the phone\n                      and jetted, I scoped the room for some\n                      jewelry, cash, whatevers. You know, a\n                      severance package. Didn't find any\n                      duckets, but I did snatch this.\n\n            Jamal pulls out a matchbbok from his pocket. The front cover\n            reads, \"DUKE'S - WHERE SKIN IS IN.\" He hands it to the\n            Hammer.\n\n                                HAMMER\n                      Thanks little brother, you've been a big\n                      help.\n\n                                JAMAL\n                      Shit fool, ain't no thang. If it wasn't\n                      for my real brothers here at the K.L.F.,\n                      I'd be shining shoes at the train station\n                      or getting my afro tossed up against a\n                      velcro wall in some redneck bar\n                      somewhere. I finally gots a place where I\n                      belong. Fuck Christmas. I'm all about\n                      smoking blunts and pimpin' bitches. I'm\n                      all about Kwanzaa nigga!\n\n            Mohammed and the Hammer head towards the door. \n\n                                MOHAMMED\n                      He's new. He's still got a long way to go\n                      before he understands the true meaning of\n                      Kwanzaa.\n\n                                HAMMER\n                      Thanks again Mo, you always deliver the\n                      goods.\n\n                                MOHAMMED\n                      You watch your back Hammer. Hanukkah\n                      might just be his first move. For all we\n                      know Kwanzaa could be next. There's a lot\n                      of brothers counting on you. If you\n                      fail... \n\n                                HAMMER\n                      Okay, look. I'm going to work really,\n                      really hard on this one. But, please stop\n                      with the pressure. I'm already tense as\n                      it is.\n\n                                MOHAMMED\n                      It's cool. It's cool. Aveenooh Shalom\n                      Alechem, brother.\n\n            Mohammed pounds his fist against his chest and then raises\n            it. The Hammer returns the gesture. \n\n                                HAMMER\n                      Alekem Salam.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            EXT. CITY STREET - AFTERNOON\n\n            The Hammer's Caddy drives past a sneaky looking SALVATION\n            NAVY GUY. We do your standard BLAXPLOITATION ZOOM into him as\n            he begins to speak into the lapel of his uniform.\n\n            INT. SANTA'S WORKSHOP - CONTINUOUS\n\n            Santa holds a walkie-talkie in hand and we the hear the voice\n            of the Salvation Navy Guy. Although behind him hangs a banner\n            reading, \"SANTA'S WORKSHOP,\" the interior is a run down\n            sweatshop.\n\n                                SALVATION NAVY GUY (O.S.)\n                      It's me. He's on his way.\n\n                                SANTA\n                      Excellent. Everything is going as\n                      planned.\n\n            Santa puts the walkie-talkie down, and addresses somebody\n            O.S.\n\n                                SANTA (CONT'D)\n                      With the Hebrew Hammer out of the\n                      picture, Hanukkah will be nothing more\n                      than a confusing and hard to pronounce\n                      word. I want to thank you very much Jamal\n                      for all of your help.\n\n            We cut to the other side to reveal whom he's speaking to.\n            Jamal, the same black 'elf' from the Kwanzaa Liberation Front\n            sits at the table across from Santa.\n\n                                JAMAL\n                      Pfff. Shit nigga, ain't no thang. Hey, yo\n                      Santy Claus, so does this mean that you\n                      gonna make me an official elf now?\n\n                                SANTA\n                      Can you believe this guy Tiny Tim?\n\n            Santa looks over to TINY TIM. Unshaven, not so tiny anymore,\n            and still on crutches, Tiny Tim's grown up since 'A Christmas\n            Carol.' A common street thug. C'mon, did you seriously think\n            that Scrooge would give free handouts to the Cratchit family\n            forever?\n\n            Tiny Tim shrugs his shoulders.\n\n                                SANTA (CONT'D)\n                      Take a look around you Jamal. Do you see\n                      any colored midgets in my workshop?\n\n            A shot of a couple of the same elves from the conference room\n            slaving away on the assembly line.\n\n                                SANTA (CONT'D)\n                      Your presence would be a disruption to\n                      the utopian model of efficiency I've\n                      created here.\n\n                                JAMAL\n                      That's some cold shit.\n\n            The ELVES appear to be struggling with the speed at which the\n            products move down the assembly line. The HEAD ELF steps out\n            from the assembly line and addresses Santa.\n\n                                HEAD ELF\n                      Utopian model of efficiency my ass! Ever\n                      since you took charge, this place has\n                      been more like a sweatshop. \n\n            The other elves stop working and vocalize their agreement\n            with the Head Elf. \n\n                                HEAD ELF (CONT'D)\n                      We know our rights Santa! You're in\n                      violation of the union regulations! We're\n                      going on strike!\n\n            The other elves shout out their approval. Santa takes it all\n            in stride.\n\n                                SANTA\n                      You know something, you're right.\n\n            The Head Elf is taken aback by what seems to be a glimpse of\n            compassion on Santa's part.\n\n                                HEAD ELF\n                      Really?\n\n                                SANTA\n                      Yeah. This is a sweatshop. And since you\n                      elves aren't willing to do the work, I\n                      made arrangements to have some Taiwanese\n                      children shipped over. And I might add, \n                      they're more than willing to work for\n                      peanuts.\n\n            Santa performs the two fingered whistle.\n\n                                SANTA (CONT'D)\n                      Come on in boys!\n\n            A group of FIVE TAIWANESE BOYS file past Santa towards the\n            assembly line.\n\n            As each child passes Santa, he hands them each a bag of\n            PEANUTS. \n\n            At the assembly line, the Taiwanese boys move like lightning\n            as they gift wrap boxes clearly labeled \"NIKEY,\" \"KATHY LEE\n            CLOTHING COMPANY,\" and \"STARSTRUCKS COFFEE.\"\n\n            The elves, including Jamal, watch in amazement at their\n            agility and efficiency.\n\n            Defeated, they shuffle out of the workshop.\n\n                                TINY TIM\n                      So, what's our first plan of attack\n                      Santa?\n\n                                SANTA\n                      While I was in Taiwan negotiating the\n                      solution to our labor problems, I came\n                      across a factory that illegally\n                      manufactures the most addictive, Jewish\n                      pride weakening substance on the planet.\n                      I bought the entire plant. \n\n            Santa walks over to a FED-Y truck overflowing with large\n            brown cardboard boxes marked 'PRODUCT.' \n\n                                SANTA (CONT'D)\n                      I want you and your men to target every\n                      young person in the Jewish neighborhoods\n                      of every major city of this country. I\n                      want you to flood their streets with this\n                      product.\n\n                                TINY TIM\n                      What should I charge?\n\n                                SANTA\n                      Oh, that's the beauty of it. These are\n                      free samples.\n\n            Tiny Tim's curiosity is peaked.\n\n                                TINY TIM\n                      So what's in the boxes? Heroin? Cocaine?\n\n                                SANTA\n                      Worse.\n\n            Santa slits open one of the boxes with a large knife and\n            pulls out a VIDEOCASSETTE generically labeled, \"It's A\n            Wonderful Life.\"\n\n                                SANTA (CONT'D)\n                      Bootleg copies of the Frank Capra\n                      classic, 'It's A Wonderful Life.'\n\n                                TINY TIM\n                      That's some cold shit.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            EXT. DUKE'S BAR - DAY\n\n            HARD CORE PUNK music pours out from the inside of the bar.\n            The Hammer walks into frame and looks up at the sign. He\n            curiously notes the ASTRO TURF spread across the pavement,\n            and then makes his way for the front door.\n\n            INT. DUKE'S BAR - AFTERNOON\n\n            We DOLLY into the Hammer as he pushes open the WESTERN STYLE\n            doors. \n\n            The MUSIC comes to a SCREECHING STOP. We HOLD ON HIS CU as he\n            looks around.\n\n            We cut to the other side to get a look at what he sees - A\n            bar of about TEN SKINHEADS staring back at him dumbfounded.\n            Skinhead paraphernalia adorns the walls.  \n\n            The Hammer maintains his cool, takes a deep breath, and then\n            walks towards the bar.\n\n            We cut to a FLOOR LEVEL shot as his STAR OF DAVID SPURS\n            jangle as he continues his walk to the bar.\n\n            He steps up to the counter, where a SKINHEAD BARTENDER with a\n            Manson-like swastika inked on his forehead studies him\n            curiously.\n\n                                HAMMER\n                      Manischewitz. Straight up.\n\n                                SKINHEAD BARTENDER\n                      Usually we don't serve your kind. But\n                      since you had the balls to walk in here,\n                      Kike, I'll pour you one last drink before\n                      we lynch you.\n\n            The bartender reaches for a bottle of cherry flavored\n            Manischewitz wine. The Hammer interrupts him by clearing his\n            throat. \n\n                                HAMMER\n                      Actually, can I have the black label?\n\n            The Bartender eyeballs him, and then grabs the bottle of\n            Black Label Manischewitz. He grabs a glass from the rack, and\n            begins to pour.\n\n                                HAMMER (CONT'D)\n                      I figure if this is my last drink, you\n                      might as well leave the bottle.\n\n            The bartender stops pouring and places the bottle on the bar.\n\n                                SKINHEAD BARTENDER\n                      Be my guest.\n\n                                HAMMER\n                      Do you guys take Shekels? I just got back\n                      from a trip in Israel, and all I've got\n                      is a fistful of Shekels.\n\n            He drops a fistful of Shekels on the bar. \n\n            A FEW SKINHEADS slowly begin to approach the bar.\n\n            The Hammer picks up the bottle and begins to examine it.\n\n                                HAMMER (CONT'D)\n                      5733. That was a good year for me. \n\n            With one swift motion, the Hammer spins the bottle up to grab\n            it by the neck, and thwacks the bartender on the head with\n            it. \n\n            All of the OTHER OCCUPANTS in the bar jump out of their\n            seats, encircling the Hammer.\n\n            We do a QUICK PUSH into the Hammer as he pulls out TWO SAWED\n            OFF SHOTGUNS from underneath his coat.\n\n                                HAMMER (CONT'D)\n                      Shabat Shalom, motherfuckers.\n\n            He points his weapons, and we...\n\n                                                                 CUT TO:\n\n            EXT. DUKE'S BAR - CONTINUOUS\n\n            A WIDE SHOT of the bar. The camera is STATIONARY. We hear the\n            sound of SHOTGUNS BLASTING and then the sounds of intense\n            FIGHTING. A few seconds of the fighting sounds pass.\n\n            Suddenly, the front doors bust open and a few bloodied\n            Skinheads fall out onto the ground, followed by the Hammer.\n            He's untouched, and he carries the bottle of Manischewitz in\n            one hand and a shotgun in the other. \n\n            He stops in the MIDGROUND, and pours the Manischewitz out on\n            the astroturf lawn in a methodical manner.\n\n            He approaches FOREGROUND, and pulls out something from his\n            jacket pocket.\n\n            We see a CU of the same matchbook the elf gave him. \"DUKE'S -\n            WHERE SKIN IS IN.\"\n\n            He lights a match and tosses it over his shoulder. We hear\n            the sounds of bursting flames. \n\n            The Hammer puts his sunglasses on, and walks straight past\n            the camera.\n\n            We pull back into a SPINNING OVERHEAD to reveal flames in the\n            shape of the STAR OF DAVID burning on the lawn.\n\n                                                          FADE TO BLACK.\n\n            PUSHERMAN MONTAGE\n\n            Curtis Mayfield's 'Pusherman' FADES UP, and we cut into a\n            STILL PHOTO of Tiny Tim with his arms around two Hasidic boys\n            in an a alley. The SCREEN DIVIDES INTO THIRDS as we see CU's\n            of each character smiling. Stills are constantly replaced in\n            time with the music. We see a still of MONEY BEING EXCHANGED,\n            then HANDS BEING SHAKEN. Then a still of a VIDEOCASSETTE\n            BEING PLACED INTO A VCR, A HASIDIC KID WATCHING THE TV, etc.\n            The music continues as we...\n\n                                                                 CUT TO:\n\n            INT. JEWISH HOME - DAY\n\n            Maccabee, the same kid the Hammer gave the Hanukkah present\n            to earlier in the film, sits glued to his television set.\n            O.S. from the television we hear someone approximating Zuzu\n            from the film 'It's A Wonderful Life' say...\n\n                                TELEVISION SET\n                      Papa, Papa! Mommy says that every time\n                      you hear the sound of a bell ringing an\n                      angel gets his wings!\n\n            A JEWISH MOTHER calls to her son from O.S.\n\n                                JEWISH MOTHER (O.S.)\n                      Maccabee! It's time to light the menorah!\n\n            Maccabee looks over his shoulder in disgust, and then CRANKS\n            UP THE VOLUME on the film until all other sounds are drowned\n            out.\n\n                                                            CUT BACK TO:\n\n            PUSHERMAN MONTAGE\n\n            More STILLS depicting the sale and distribution of the\n            videocassettes.  \n\n                                                                 CUT TO:\n\n            INT. ANOTHER JEWISH HOME - NIGHT\n\n            A second ADDICT JEWISH CHILD is glued to his TV set. Drool\n            slowly makes its way down his chin. He gets up, and we FOLLOW\n            him into the living room where we find his PARENTS. His\n            father reads a newspaper, while his mother is absorbed in her\n            knitting.\n\n                                ADDICT JEWISH CHILD\n                      Mom, dad. How come you made me Jewish?\n\n            His parents look to one another in absolute shock.\n\n                                                            CUT BACK TO:\n\n            MORE PUSHERMAN MONTAGE\n\n            More STILLS...\n\n                                                                 CUT TO:\n\n            INT. YET ANOTHER JEWISH HOME - DAY\n\n            An ADOLESCENT HASIDIC BOY backs his way through the front\n            door into the kitchen. He's carrying an incredibly large\n            CHRISTMAS TREE.\n\n            We cut to a shot of HIS FAMILY, who watch this all go down as\n            they sit at the kitchen table.  \n\n            The Adolescent Hasid finally gets the tree into the house,\n            and turns to see the rest of his family staring at him,\n            mouths agape.\n\n                                ADOLESCENT HASIDIC BOY\n                      What? It's a Hanukkah bush.\n\n            The family remains expressionless. \n\n            The glass in his mother's hand, slips from her grasp and\n            shatters on the kitchen floor.\n\n            EXT. JEWISH GHETTO STREET - DAY \n\n            The Hammer's Caddy cruises slowly down the street.\n\n            INT. HAMMER'S CADDY - CONTINUOUS\n\n            Things definitely seem odd. The Hammer looks out his left\n            window. TWO Hasidic CHILDREN decorate a giant Christmas tree\n            on the street. \n\n            He looks to his right. A GROUP of HASIDIC kids sing Christmas\n            Carols.\n\n            The Hammer looks through his front windshield. A kid is\n            standing right in the middle of the road! \n\n            The Hammer slams on his breaks, skidding to a stop just\n            inches from the kid. It's Shlomo (remember the kid the Hammer\n            helped with the Yarmulke earlier?), and he has a strange\n            glazed look in his eyes. Shlomo holds a videocassette in his\n            hand.\n\n            The Hammer steps out of the Caddy, leaving his car door open.\n            We hear the annoying beep, beep, beep door ajar sound.\n\n                                HAMMER\n                      Shlomo, you okay?\n\n                                SHLOMO\n                          (Dreamily)\n                      Mommy says that every time you hear the\n                      sound of a bell ringing, an angel gets\n                      his wings!\n\n                                HAMMER\n                      Huh.\n\n            The car door beeps again. The kid looks to it, and the Hammer\n            follows his gaze.\n\n                                SHLOMO\n                      Mommy says that every time you hear the\n                      sound of a bell ringing, an angel gets\n                      his wings!\n\n            The Hammer is baffled. He looks down at Shlomo's hand and\n            spots the videocassette. He grabs it from him and examines at\n            it.\n\n                                HAMMER\n                      Bootleg 'It's A Wonderful Life' from\n                      Taiwan.\n\n            The Hammer inspects the tape a little longer, and then gives\n            the label a huge lick.\n\n                                HAMMER (CONT'D)\n                      Sixty five percent pure. Damn! People\n                      could get hurt watching this shit.\n                          (To Shlomo)\n                      Come with me.\n\n            A POV shot from inside the Hammer's trunk as it opens. Hammer\n            stands with Shlomo. \n\n            Inside the trunk we see a box of videos. The three on top\n            read, \"Fiddler On The Roof,\" \"Yentl,\" and \"Chaim Potok's The\n            Chosen.\" The Hammer grabs a copy of the Chosen and hands it\n            to Shlomo.\n\n                                SHLOMO\n                      Chaim Potok's The Chosen?\n\n                                HAMMER\n                      Get yourself home and watch this as soon\n                      as possible.\n\n            A HASIDIC KID ON A BIKE with a Christmas tree in tow rides\n            past the two. One of the ornaments makes a tinkling sound.\n\n                                SHLOMO\n                      Mommy says that every time you hear the\n                      sound of a bell ringing, an angel gets\n                      his wings!\n\n            The Hammer slaps him out of his spell.\n\n                                HAMMER\n                      Hey, hey, hey! You can beat this. Now get\n                      going.\n\n            EXT. JEWISH GHETTO STREET - MOMENTS LATER\n\n            The Hammer dials a number on the payphone. As he dials, he\n            verbalizes the number he's calling.\n\n                                HAMMER\n                      555-55-555-55555...\n\n            The Hammer struggles with the last number, but then quickly\n            remembers.\n\n                                HAMMER (CONT'D)\n                      ...5.\n\n            It rings once, and then we hear the other line pick up. \n\n            INT. CHIEF'S OFFICE - CONTINUOUS\n\n            The Chief's on the other end.\n\n            INTERCUT PHONE CONVERSATION\n\n                                HAMMER\n                      Chief, it's me. Listen carefully. I need\n                      for the Worldwide Jewish Media Conspiracy\n                      to mass produce video copies of every\n                      Hollywood movie ever made featuring a\n                      positive Jewish protagonist as its lead.\n\n                                CHIEF\n                      You mean you want us to make copies of\n                      Yentl, Fiddler On The Roof, and Chaim\n                      Potok's The Chosen?\n\n                                HAMMER\n                      That'll work. Get them out to the Jewish\n                      community stat. We got an epidemic on our\n                      hands.\n\n                                CHIEF\n                      We're on it Hammer. How'd you do with\n                      Santa?\n\n                                HAMMER\n                      It was a trap. I'm back at square one.\n\n                                CHIEF\n                      Well, then I've got good news for you. We\n                      just got word that he'll be making an\n                      appearance at the Mall Of America today.\n                      I'm sending Esther to meet you there at\n                      once. \n\n                                HAMMER\n                      Good thinking. We'll disguise ourselves\n                      as a Gentile couple to pass undetected.\n                      Now that he thinks I'm dead, this should\n                      be a piece of homentashen.\n\n                                CHIEF\n                      One last thing Hammer. You take care of\n                      yourself. The...\n\n            We cut back to the Hammer on the payphone. He holds the\n            receiver away from his ear. He doesn't want to hear this.\n\n                                HAMMER\n                      The fate of Hanukkah. Right. Right. Yeah,\n                      Got it. Will do. Okay, bye now.\n\n            He hangs up and leaves.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            INT. MALL OF AMERICA - DAY\n\n            'Merry Christmas' decorations and signage dominate the\n            landscape of the establishing shot of the Mall.\n\n            Tiny Tim, walkie-talkie in hand, surveys this Christmas\n            Wonderland with smug satisfaction. He spots a small, barely\n            visible Hanukkah decoration poking out from beneath one of\n            the other Christmas decorations. \n\n            He rips it from the wall and tosses it into a small trashcan\n            bonfire.\n\n            Tiny Tim speaks into his the walkie-talkie. \n\n                                TINY TIM\n                      One partridge in a pear tree to two\n                      turtle doves. What's your status?\n\n                                                                 CUT TO:\n\n            ANOTHER PART OF THE MALL\n\n            Two adult sized Santa's Helpers, TONY AND MIKEY stand with\n            walkie-talkies behind the nightclub velvet ropes, and hold\n            back the throngs (15-20 extras) of screaming children\n            attempting to make their way past the red curtain to see\n            Santa. A huge 'Citizen Kane'/Big Brother style poster with a\n            menacing picture of Santa looms behind them. It reads, \"SANTA\n            CLAUS: HE KNOWS IF YOU'VE BEEN NAUGHTY OR NICE.\"\n\n            Santa's staging area is very Studio 54. Both Tony and Mikey\n            are decked out in Addidas warm up pants, gold chains, etc.\n            Tony, very Guido in his mannerisms, replies into his\n            walkie...\n\n                                TONY\n                      Nothing stirring here.\n\n            A little BLONDE GENTILE GIRL tugs on Tony's sleeve.\n\n                                BLONDE GENTILE GIRL\n                      Can I be next? Please, please!\n\n                                TONY\n                      Let's get a look at you, shall we.\n\n            The Gentile Girl pulls her Power Muff Girls T-shirt down,\n            allowing the two to get a better look at it.\n\n                                TONY (CONT'D)\n                      A power muff girls T. Very nice.\n                      Alright, now spin around.\n\n            She twirls for the two.\n\n                                TONY (CONT'D)\n                      Very nice! Alright. You're cool. Go on\n                      and see Santa, sunshine.\n\n            A pushy, FRECKLE FACED GENTILE BOY steps out of line and\n            approaches the two.\n\n                                FRECKLE FACED GENTILE BOY\n                      That's not fair! How come she gets to go\n                      next? We were here first!\n\n                                TONY\n                      Oh really! Is that a fact? Well guess\n                      what buddy? You ain't gettin' in to see\n                      Santa today, so why don't you just turn\n                      around and high tail it home.\n\n            The kid begins to sob uncontrollably.\n\n                                FRECKLE FACED GENTILE BOY\n                      But I've been waiting to see Santa all\n                      year.\n\n            Tony apes him.\n\n                                TONY\n                      But I've been waiting to see Santa all\n                      year. \n\n            The kid is a pathetic mess.\n\n                                TONY (CONT'D)\n                      You heard me. Get moving punk!\n\n                                                                 CUT TO:\n\n            The Hammer and Esther scope out the area. The Hammer is\n            disguised terribly, consisting of a baseball hat on top of\n            his Shtreml, and a Jesus Fish T-shirt worn over his black\n            suit. Esther's visibly nervous.\n\n                                ESTHER\n                      Any sign of Santa?\n\n                                HAMMER\n                      He must be behind that curtain. Relax.\n                      We're undercover. We need to give off the\n                      appearance of calm. You see Esther, the\n                      trick to undercover work is to try and\n                      blend in. Act as a Gentile would.\n\n            The two pass a samples booth. The FREE SAMPLES WOMAN solicits\n            the Hammer.  \n\n                                SAMPLES WOMAN\n                      Could I interest you in a free sample\n                      bacon cheeseburger? \n\n            We get a CU of the burger followed by a CU of the Hammer.\n            He's mortified, but he pulls it together.\n\n                                HAMMER\n                      While I thank you, Gentile friend, for\n                      your generous offer of that deliciously\n                      unkosher snack, I sadly have to decline\n                      for I stuffed myself full of meat and\n                      milk product at a prior lunch engagement.\n\n            The Sample Woman looks at him strangely as the Hammer and\n            Esther walk on.\n\n                                ESTHER\n                      You're good.\n\n            The two take their place at the end of the line in to see\n            Santa.\n\n            Tony performs the two fingered whistle.\n\n                                TONY\n                      Can I have everyone's attention please.\n                      In fifteen minutes, Santa's gonna have to\n                      leave.\n\n            The kids all vocalize their disappointment.\n\n                                TONY (CONT'D)\n                      Ah, don't be like that kids. We gotta lot\n                      work to do if we're gonna get all those\n                      presents out in time.\n\n            The kids aren't buying it. More boos and protests of\n            disapproval.\n\n                                TONY (CONT'D)\n                      Hey! Hey! You want shitty ass presents\n                      for Christmas? You want Barbies with\n                      heads screwed on backwards? You want\n                      remote control cars without the batteries\n                      included. Then be my fucking guest!\n\n            Tony spits and grabs his crotch as he turns back around to\n            take his place in front of the velvet ropes.\n\n            Esther surveys their place in line. It's about fifteen deep.\n\n                                ESTHER\n                      What are we going to do? We're at least\n                      an hour from the front.\n\n                                HAMMER\n                      C'mon follow me.\n\n            The two make their way up to the front of the line. They pass\n            a man who looks eerily like ex-rapping god, MC HAMMER.\n\n                                ESTHER\n                          (To Hammer)\n                      Is that...? No, couldn't be.\n\n                                TONY\n                      Hey, hey! Not so fast.\n\n                                HAMMER\n                      We have to get through. It's an\n                      emergency.\n\n                                TONY\n                      Sorry pal, you're gonna have to wait in\n                      line just like all the other parents.\n\n            Esther adjusts her bust. She's incredibly sexy in her tight\n            fitting denim jacket. She smiles flirtatiously at the Elves.\n\n                                ESTHER\n                      We're so sorry to have to cut, but our\n                      beautiful Gentile boy ran on ahead of us\n                      in line.\n\n            She puts her hand on Tony's bicep and smiles once again.\n\n                                ESTHER (CONT'D)\n                      It would mean so much to Paul and I if\n                      you'd let us through to see Santa.\n\n            Tony is putty in her hands.\n\n                                TONY\n                      Well...umm, when you put it that way.\n                      Sure go on through.\n\n            Tony unhinges the rope, and the two pass. The Hammer leans\n            over to Esther.\n\n                                HAMMER\n                      You're good!\n\n                                                                 CUT TO:\n\n            INSIDE THE CURTAIN\n\n            JIMMY, an adorable six year old sits on Santa's lap. Santa's\n            assistants, two busty blondes named BAMBI and TAWNI, flank\n            his chair. \n\n                                SANTA\n                      And what do the Jewish people do during\n                      Hanukkah?\n\n                                JIMMY\n                      They worship the devil and sacrifice\n                      small Gentile children like me in\n                      bizarre, sadistic rituals.\n\n                                SANTA\n                      That's right. Santa can tell that you've\n                      been a very good boy this year. Run along\n                      now Jimmy.\n\n            Bambi and Tawni escort Jimmy out, and re-enter with Esther\n            and the Hammer. Santa's confused.\n\n                                SANTA (CONT'D)\n                      Sorry folks, I don't do couples.\n\n                                HAMMER\n                      If you keep your mouth shut and come with\n                      me, you won't get hurt.\n\n                                SANTA\n                      Excuse me? Do I know you, friend? Take a\n                      look around you. Do you even know who I\n                      am?\n\n            The Hammer rips off his baseball hat and T-shirt. Santa\n            gasps.\n\n                                HAMMER\n                      Let me guess, you're the goy who stole\n                      Hanukkah.\n\n                                SANTA\n                      The Hebrew Hammer! You're alive.\n\n            The Hammer takes out his gun and points it Santa.\n\n                                HAMMER\n                      What's your shpiel, Santa? \n\n                                SANTA\n                      Whoa, whoa there. C'mon Mordechai, is\n                      this any way to treat an old family\n                      friend? Let's cut out all the\n                      unpleasantness. I admit, I went way\n                      overboard with the whole Hanukkah thing.\n                      Let me make it up to you. How about a\n                      peace offering?\n                          (To Bambi and Tawni)\n                      Girls.\n\n            Santa snaps his fingers, and Bambi and Tawni drape themselves\n            on either side of the Hammer, rubbing his arms erotically.\n\n                                SANTA (CONT'D)\n                      Bambi. Tawni. I'd like for you to meet\n                      world renown Semitic super stud,\n                      Mordechai Jefferson Carver. \n\n            Bambi speaks with a thick Southern drawl.\n\n                                BAMBI\n                      Oh, I declare I just love Jewish men.\n                      They're so sensitive and well read.\n\n            Esther is clearly jealous.\n\n            The Hammer's enjoying the attention. He looks down at Bambi's\n            breasts. We're talking HUGE, obviously augmented boobolas. A\n            large crucifix chain hangs around her neck, nestled in\n            between the mounds of silicone. We hear the requisite DING as\n            it sparkles.\n\n            The Hammer is released from the sexual spell of the Gentile\n            Seductress.\n\n                                HAMMER\n                      Sorry Santa. I like my women like my\n                      matzah. Unleavened. \n\n            The girls move away from the Hammer. Esther smiles at the\n            Hammer's resolve.\n\n                                HAMMER (CONT'D)\n                      This is where you go down.\n\n            Suddenly, Tony draws the curtain back.\n\n                                TONY\n                      Hey, hurry it up in there. We gotta bunch\n                      of kids...\n\n            He sees the Hammer with his gun pointed at Santa's head.\n\n                                TONY (CONT'D)\n                      Oh shit!\n\n            Esther pulls out her piece and points it at Tony.\n\n                                ESTHER\n                      Back it up buddy!\n\n            He does. The entire crowd of children can now see what's\n            happening. Hushed, fearful whispers. MC Hammer steps out of\n            line and pleads...\n\n                                MC HAMMER\n                      Please Hammer, don't hurt em'!\n\n            The Hammer does a double take. MC Hammer gives a \"Did I just\n            say that?\" expression.\n\n                                HAMMER\n                      Let's do this clean. I don't want to make\n                      a scene Santa.\n\n            Santa stands up slowly with his hands raised.\n\n                                SANTA\n                      Well, it's a bit too late for that now,\n                      isn't it? Excuse me children, if I could\n                      have your attention for a moment.\n\n                                HAMMER\n                      What are you doing?\n\n                                SANTA\n                      I'm just calming the kiddies. \n                          (To children)\n                      There's no need to worry about Santa.\n                      He's just having a peaceful, adult\n                      conversation with his nice Jewish friend,\n                      The Hebrew Hammer.\n\n            The Hammer plays along, raising his hand to keep the children\n            calm.\n\n                                HAMMER\n                      Hey everybody. How's it hangin'?\n\n                                SANTA\n                      In fact, he's just informed me that he\n                      personally plans on cancelling Christmas\n                      this year. \n\n            The Hammer and Esther look to one another. This riles the\n            masses. Trouble.\n\n                                SANTA (CONT'D)\n                      Why don't we show him how that makes us\n                      feel.\n\n                                                                 CUT TO:\n\n            AN EMPTY SECTION OF THE MALL - MOMENTS LATER\n\n            We hold a few beats on a shot of this fairly untrafficked\n            portion of the mall. \n\n            Suddenly, Esther and the Hammer haul ass around the corner,\n            running for their lives.\n\n            A second or two pass, and an ANGRY MOB of about twenty\n            Gentile children round the corner after them. They're\n            definitely not in the Christmas spirit.\n\n            The Hammer and Esther take another turn. From the other\n            direction a SECOND MOB OF CHILDREN head straight at them. \n\n            The Hammer spots another corridor in front of them.\n\n                                HAMMER\n                      C'mon!\n\n            They run about a hundred yards before they hit a wall. A dead\n            end! O.S. we can hear the throng of children nearing in the\n            BG.\n\n                                THRONG (O.S.)\n                      Where'd they go? I saw them go down that\n                      hallway. C'mon, let's get em'!\n\n            Hammer turns to Esther defeated.\n\n                                HAMMER\n                      It's over. We're doomed.\n\n            The barely audible sound of a gospelized version of the \n            Biblical slave song, \"Let My People Go\" sounds as if it's\n            coming from within the walls of the mall. \n\n                                ESTHER\n                      Shh. Shh, listen. Do you hear that?\n\n            The Hammer tries to place the source.\n\n                                HAMMER\n                      What is that? \n\n            Suddenly, a panel on the wall slides open to reveal a door.\n            The other side of the door is dark, but it has a cavernous\n            feel to it.\n\n            An elderly Jewish woman, HARRIET TUBBELMAN, appears from out\n            of the doorway. She smokes a corncob pipe.\n\n                                HARRIET TUBBELMAN\n                      Psst. Hammer, Esther. This way. Hurry! \n\n            Harriet escorts the two into the passageway, and the door\n            slides shut behind them.\n\n            INT. CAVERNOUS ROOM - MOMENTS LATER\n\n            We appear to be in what looks like the loading dock for an\n            'It's A Small World After All' type water ride. \n\n            Harriet leads Esther and the Hammer into one of the waiting\n            cars. The cars kind of have a baby Moses straw basket theme\n            going on. The 'Let My People Go' song, piped from unseen\n            speakers, is now at full strength.\n\n                                HAMMER\n                      You saved our lives. Thank you. How can I\n                      ever repay you...?\n\n                                HARRIET TUBBELMAN\n                      ...My name is Harriet Tubbelman, but you\n                      can call me Moses. The only payment I ask\n                      Mordechai, is that you keep Hanukkah safe\n                      for us all.\n\n            She hands each of them a ticket and then lowers the lap\n            restraints for Hammer and Esther, testing them to make sure\n            they're secure.\n\n                                HARRIET TUBBELMAN (CONT'D)\n                      You should be safe from here on out. Just\n                      follow the river to it's conclusion.\n\n            She begins to walk away, but then catches herself as she\n            turns back to face them.\n\n                                HARRIET TUBBELMAN (CONT'D)\n                      Oh yeah, and keep your arms and legs\n                      inside the water craft at all times.\n\n                                HAMMER\n                      Where are we? What is this place?\n\n            She smiles with great pride.\n\n                                HARRIET TUBBELMAN\n                      Welcome to the Underground Jewish\n                      Railroad. Just sit back, relax, and enjoy\n                      the ride.\n\n            The brakes on the water craft release, and the craft makes it\n            way from the loading dock.\n\n            Wide eyed, Esther and Hammer check out their surroundings.\n\n            Hasidic Animatronic puppets sing of thousands of years of\n            Jewish oppression and persecution in an educational, yet\n            oddly entertaining way. \n\n            The Hammer puts his arm around Esther and continues to check\n            out the attraction in wonderment. \n\n            Esther secretly glances at him affectionately. It's clear\n            she's falling for him. \n\n            We cut to a wide shot as we watch the craft disappear down\n            the river. A funkdafied version of the \"Let My People Go\"\n            song FADES UP and over the gospel version from the ride.\n\n            EXT. ALLEY - DAY\n\n            We see a non-descript door in the middle of a brick wall. Two\n            turnstiles stand directly in front of the door. We can hear\n            the muffled sounds of the gospel version of \"Let My People\n            Go.\" Scribbled on the wall is the graffiti phrase, \"HANUKKAH\n            NOW!\"\n\n            The door opens, and the obnoxiously loud music spills out\n            into the street. The Hammer and Esther exit, close the door,\n            and push their way past the turnstiles into the alley. \n\n                                HAMMER\n                      That got annoying fairly quickly.\n\n                                ESTHER\n                      Yeah, no kidding.\n\n            A CARNIVAL WORKER stands behind a makeshift 'Underground\n            Jewish Railroad' booth. \n\n                                CARNIVAL WORKER\n                      Tickets please.\n\n            The two hand the Carnival Worker their tickets.\n\n                                CARNIVAL WORKER (CONT'D)\n                      Thanks for riding the Underground Jewish\n                      Railroad. If you plan on returning today,\n                      please make sure to get you hands stamped\n                      before you leave the alley.\n\n                                HAMMER\n                      Nah, we're kosher. Thanks though.\n\n            The two walk past him. Esther turns to the Hammer.\n\n                                ESTHER\n                      So, now what?\n\n                                HAMMER\n                      Now we wait for Santa to make his next\n                      move.\n\n            He gives her a once over. She is stunning.\n\n                                HAMMER (CONT'D)\n                      Want to get a drink?\n\n                                ESTHER\n                      Sure. Why not.\n\n            EXT. THE GOLDEN MENORAH - DAY\n\n            Your typical Blaxploitation bar. It could easily pass for the\n            Lenox Lounge in Harlem, with the exception of the large\n            menorah shaped sign out front.\n\n            INT. THE GOLDEN MENORAH - CONTINUOUS\n\n            We see a bar packed with ORTHODOX JEWS. A WALL separating the\n            men and women in the bar runs along the center of the room,\n            stopping about ten feet from the stage. Signs clearly\n            demarcate these 'MEN' and 'WOMEN' sections.\n\n            Onstage, a KLEZMER band plays a rendition of a to be\n            determined 70's funk classic.\n\n            Esther and the Hammer enter the joint. Mid song, the\n            BANDLEADER notices the two walk in...\n\n                                BANDLEADER\n                      Hey! The Hebrew Hammer everybody!\n\n            The Hammer raises his hand in acknowledgment. The entire bar\n            cheers and applauds.\n\n            Hammer escorts Esther to a table on the woman's side of the\n            wall, and then walks around to the other side of the divider\n            where he takes a seat opposite the wall from her.\n\n            The band begins a rousing version of \"Hava Nagila.\" A good\n            majority of the men in the bar rush to the dance floor and\n            begin dancing zealously with one another.\n\n            Esther shouts over the wall in an attempt to overcome the din\n            of the bar.\n\n                                ESTHER\n                      So, do you come here often!?\n\n            The Hammer struggles to hear. He shouts back to her.\n\n                                HAMMER\n                      What was that!?\n\n                                ESTHER\n                      I said, do you come here often!?\n\n                                HAMMER\n                      Oh. Yeah, about once a week!\n\n                                ESTHER\n                      What!?\n\n                                HAMMER\n                      I said, yeah, about once a week!\n\n                                ESTHER\n                      Oh!\n\n            A HASIDIC BAR PATRON approaches the Hammer and smiles.\n\n                                HASIDIC BAR PATRON\n                      Would you like to dance?\n\n            We get another shot of the men dancing together, arm in arm, \n            on the dance floor.\n\n                                HAMMER\n                      I'm okay right now. Thanks though.\n\n            As the Patron leaves, JOSHUA, another Hasidic man standing\n            directly behind him takes his place at the Hammer's table.\n\n                                JOSHUA\n                      Hey Morty, wanna cut a rug?\n\n                                HAMMER\n                      Nah, I'm good. I'm kind of here with\n                      somebody.\n\n            The Hammer motions to the wall. Joshua looks as if his\n            feelings are hurt.\n\n                                JOSHUA\n                      Oh. Okay. Maybe next time.\n\n                                HAMMER\n                      Yeah. Maybe next time Joshua. Take it\n                      easy.\n\n            As Joshua leaves, we get a WIDER shot of the Hammer's table.\n            A LONG LINE OF MEN leads up to it.\n\n            CHAIM FEYGELE, an effeminate slick Hasidic man, chest hair\n            spilling out of his loosely buttoned butterfly collar shirt,\n            neck dripping with gold chains, steps up to the Hammer. He's\n            got a huge phoney smile plastered across his face. \n\n                                CHAIM FEYGELE\n                      Well Shalom there mister!\n\n                                HAMMER\n                      Do we know each other?\n\n                                CHAIM FEYGELE\n                      No, but we have mutual friends.\n\n            Chaim points to the dance floor. Another shot of men dancing\n            with one another, arm in arm.\n\n                                CHAIM FEYGELE (CONT'D)\n                      The name's Feygele. Chaim Feygele.\n\n            This guy is clearly making the Hammer nervous.\n\n                                HAMMER\n                      Mordechai. My friends call me Morty.\n\n                                CHAIM FEYGELE\n                      So Morty, I just love a man in a black\n                      suit. Care to dance.\n\n            Mordechai is flustered.\n\n                                HAMMER\n                      Uhhh. You know, I...have to go to the\n                      bathroom. I'll be right back.\n\n            The Hammer gets up quickly and leaves.\n\n            We cut to Esther's side of the wall. The Hammer walks behind\n            her while she checks out the band on stage.\n\n                                HAMMER (CONT'D)\n                      Hey there.\n\n            She turns around, pleasantly surprised.\n\n                                ESTHER\n                      Hey.\n\n                                HAMMER\n                      Do you want to get out of here? \n\n            She looks relieved.\n\n                                ESTHER\n                      I would love to get out of here.\n\n            INT. THE HAMMER'S PAD - NIGHT\n\n            A smooth, laid back Blaxploitation era song pumps from the\n            speakers. We do a SLOW PAN from the stereo into a TIGHT SHOT\n            of Esther and the Hammer slow dancing. Sexy. Esther grunts\n            and moans a bit. \n\n            We begin a SLOW ZOOM back from the two, eventually pulling\n            back far enough to see what Esther's moaning about. The\n            Hammer is a seriously terrible dancer, stepping on her toes,\n            forcing her into awkward positions, etc. \n\n            We see a CU of the Hammer accidentally stepping on her toes\n            yet again.\n\n                                ESTHER\n                      Ouch!\n\n            Esther pulls herself away from the Hammer.\n\n                                HAMMER\n                      Sorry. I'm better with men.\n\n                                ESTHER\n                          (Sensually)\n                      Maybe we should try a different kind of\n                      dancing.\n\n                                HAMMER\n                      You mean like disco dancing or doing the\n                      funky chicke...Oh. I get it.\n\n            We see a TIGHT MEDIUM SHOT of Esther. Her erect nipples are\n            clearly outlined through her blouse. Now, the Hammer's really\n            getting it.\n\n                                HAMMER (CONT'D)\n                      Now we're talking Boobola.\n\n                                ESTHER\n                      Mordechai?\n\n                                HAMMER\n                      Yes Esther.\n\n                                ESTHER\n                      I want you to talk dirty to me.\n\n                                HAMMER\n                      Oh. Okay.\n\n            He thinks for a moment.\n\n                                HAMMER (CONT'D)\n                      I want to have lots of children by you.\n                      Get a good paying, stable job. Settle\n                      down in Long Island somewhere. Someplace\n                      nice. Fancy. But not fancy schmancy. \n\n            She's warming up. \n\n                                HAMMER (CONT'D)\n                      I want for our children to go to private\n                      schools and take music lessons. Little\n                      Abraham will go to Stanford for college,\n                      Batya will go Ivy League, maybe Vassar.\n\n                                ESTHER\n                      Keep going.\n\n                                HAMMER\n                      Afterwards they'll make the decision as\n                      to whether or not they'd like to continue\n                      their religious studies in Israel.\n                      Because, hey, after all we'll have\n                      practiced the highly effective assertive\n                      democratic style of child rearing,\n                      sprinkled with a healthy dose of\n                      liberalism.\n\n            She's on fire for him.\n\n                                ESTHER\n                      Oh god, yes! Keep going! Don't stop!\n\n                                HAMMER\n                      Also, on a daily basis, I want you to\n                      tell me what to do, where to do it, and\n                      how I should live my life.\n\n                                ESTHER\n                      Kiss me you Semitic stud!\n\n            She grabs him and kisses him passionately. \n\n                                ESTHER (CONT'D)\n                          (Playfully)\n                      Hmm. I feel something poking around down\n                      there. Maybe I should investigate. What\n                      do you think about that Mr. Certified\n                      Circumcised Dick?\n\n            She begins to unzip his pants. We cut to a shot of an excited\n            Mordechai as we hear the sound of the unzipping of his pants\n            reach its conclusion. \n\n            A CU on her as she looks down at his Jewish Manhood. A wide\n            eyed, almost shocked reaction. She slowly looks back to him\n            and smiles slyly.\n\n                                ESTHER (CONT'D)\n                      Shabat Shalom!\n\n            As the two embrace, we RACK FOCUS from the two of them in the\n            BG to the Hanukkah candles burning brightly on the menorah in\n            the FG. We blur out of focus.\n\n                                                            DISSOLVE TO:\n\n            EXT. NEW YORK CITYSCAPE - MORNING\n\n            The sun rises over the city.\n\n            INT. HAMMER'S BEDROOM - MORNING\n\n            We start close on the Hammer's hand as he screws a light bulb\n            into his electric Menorah until it glows orange.\n\n            Esther caresses the Hammer's chest as the two enjoy a post\n            coital cigarette. \n\n                                ESTHER\n                      Wow, that was amazing.\n\n            The Hammer gives her ass a smack, and then picks up a\n            container filled with some kind of WHITE POWDER.\n            He snorts a bit of it off of the Star Of David chain that\n            hangs from his neck, and places the container of white powder\n            back in its place by the menorah.\n\n            Esther is mortified.\n\n                                ESTHER (CONT'D)\n                      What did you just snort?\n\n                                HAMMER\n                      Antihistamine. It's for my allergies. The\n                      capsules make me gassy.\n\n            She relaxes. \n\n                                HAMMER (CONT'D)\n                      You know, I've been thinking about what\n                      Santa's got planned for us next. Maybe\n                      he'll...\n\n            She cuts him off.\n\n                                ESTHER\n                      Your mother was right. You do work too\n                      hard.\n\n                                HAMMER\n                      Oh, she said that, did she? What else did\n                      Mommy Dearest have to say?\n\n                                ESTHER\n                      Well, she also said that you need to find\n                      a nice girl to help take your mind off of\n                      your work. I'm just glad she thought I\n                      was good enough for you.\n\n            The Hammer sits up.\n\n                                HAMMER\n                      When did you guys have this conversation?\n                      When I was in the bathroom? What else did\n                      she have to say?\n\n                                ESTHER\n                      Relax Morty, I think your mom is\n                      wonderful. She cares so much about you.\n                      Get this, while you were gone she said\n                      she'd help me get you to work with the\n                      JDL if I'd come eat by you once in\n                      awhile. Like I needed any incentive to be\n                      with you. She's so...\n\n            The Hammer goes into a fit.\n\n                                HAMMER\n                      What? You made a deal with my mother to\n                      sleep with me if I'd help you?!\n\n                                ESTHER\n                      No. Of course...\n\n                                HAMMER\n                      What does that make you? What does that\n                      make me? And my mother. What does that\n                      make her?\n\n            He makes a realization.\n\n                                HAMMER (CONT'D)\n                      Oh my god. She's become my pimp. And\n                      she's whoring her bitch-son out to the\n                      highest bidder. \n\n                                ESTHER\n                      No. It's not like that. You're being\n                      completely neurotic. I was just playing\n                      along...\n\n            He thinks aloud.\n\n                                HAMMER\n                      Always meddling in my life. This is so\n                      typical of her.\n                          (To Esther)\n                      But from you? I thought we had something\n                      good here.\n\n                                ESTHER\n                      We do!\n\n                                HAMMER\n                      I'm sorry Esther, I just don't think we\n                      can see each other romantically anymore.\n\n            The phone RINGS, and the Hammer picks it up.\n\n                                HAMMER (CONT'D)\n                      Hammer here.\n\n            We WIPE INTO SPLIT SCREEN. The Chief is on the other end.\n\n                                CHIEF\n                      Hammer, it's the Chief. We've got\n                      ourselves a situation. Get yourself down\n                      here, I've got something you need to see.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            INT. JEWISH DEFENSE LEAGUE - MAIN CHAMBER - DAY \n\n            The Star Of David vault-like doors open, and the Hammer and\n            Esther hurriedly enter the room. The Chief waits for them. \n\n                                CHIEF\n                      Mordechai. Thank god you're here.\n\n                                HAMMER\n                      What's up?\n\n                                CHIEF\n                      About an hour ago, we received this\n                      transmission from the North Pole.\n\n            He clicks a button on a remote control, and static fills the\n            GIANT TELECOMMUNICATIONS SCREEN, eventually fading into the\n            image of a larger then life SANTA. \n\n                                SANTA\n                      And now my Hanukkah loving friends, I\n                      will reveal to you the true nature of my\n                      diabolical scheme.\n\n            An image of a GIANT CLOCK in the shape of a Star Of David. \n\n                                SANTA (V.O.) (CONT'D)\n                      The Jewish Atomic clock, located in the\n                      outskirts of Jerusalem. Keeper of time\n                      for the Jewish Calendar. Powered by\n                      Judeum. An element so rare, it exists\n                      only inside the clock itself.\n\n            We TILT down to reveal a BLUE GLOWING SUBSTANCE in its base.\n\n            Santa comes back on screen.\n\n                                SANTA (CONT'D)\n                      Once I extract the Judeum from the clock,\n                      the Jewish Calendar will cease to exist,\n                      forever eradicating Hanukkah. In less\n                      than twenty four hours, which by your\n                      Jewish Calendar is approximately...\n\n            He struggles with this one. He looks at someone O.S. at the\n            North Pole.\n\n                                SANTA (CONT'D)\n                          (To someone at North Pole)\n                      Can I borrow that pen and notepad?\n\n            A notepad and pen are handed to him from O.S. Santa makes\n            some written calculations on the notepad. He's clearly having\n            trouble.\n\n            The Hammer and Esther exchange looks.\n\n                                SANTA (CONT'D)\n                          (Uncertain)\n                      Four years and three quarters a lunar\n                      cycle?\n                          (Shifting back into psycho\n                           mode)\n                      Well, whatever! In less than twenty four\n                      Christian hours, Hanukkah will be nothing\n                      more than a fond memory. Tiny Tim.\n\n            Tiny Tim hobbles into frame on his crutches.\n\n                                TINY TIM\n                      Merry Christmas everybody, and god bless\n                      us, everyone.\n\n            The two laugh hysterically.\n\n                                SANTA\n                       End transmission.\n\n            The transmission, however, doesn't end. The two abruptly stop\n            laughing. Santa begins to talk to TINY TIM. \n\n                                SANTA (CONT'D)\n                      So, how was I?\n\n                                TINY TIM \n                      It was good. Very chilling, but you still\n                      got all the points across that we talked\n                      about.\n\n                                SANTA\n                      Really? Good, good. \n\n            We cut to more confused reactions of the Hammer and Esther.\n\n                                SANTA (CONT'D)\n                      I wasn't too over the top?\n\n                                TINY TIM\n                      No, it was the perfect level.\n\n                                SANTA\n                      Thanks. Oh, did I tell you. I picked up\n                      that new KC and the Sunshine Band record\n                      that you recommended. You were right, it\n                      is good. \n\n            Santa looks towards the camera and begins to react strangely.\n\n                                SANTA (CONT'D)\n                          (To O.S. Cameraman)\n                      Why is the red light on the camera still\n                      on? Are you still filming me!? \n\n            Santa approaches the camera.\n\n                                SANTA (CONT'D)\n                      You fucking ass...\n\n            Static fills the screen.\n\n            The Hammer turns to the Chief.\n\n                                HAMMER\n                      Looks like I got a plane to catch.\n\n                                CHIEF\n                      Take Esther with you, you'll need the\n                      backup.\n\n                                HAMMER\n                      No way, it's too dangerous. Besides, my\n                      days of hooking are over.\n\n                                ESTHER\n                      You're not my bitch Mordechai. Please,\n                      you have to believe me.\n\n                                CHIEF\n                      Did I miss something here?\n\n                                HAMMER\n                      It's a long story. I'll explain when I\n                      get back from saving the clock. \n\n            He turns his attention to Esther.\n\n                                HAMMER (CONT'D)\n                      Alone.\n\n            The Hammer exits. Esther is dejected.\n\n                                CHIEF\n                      Tail him. He's gonna need the help.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            EXT. BEN GURION AIRPORT - ISRAEL - DAY\n\n            A STOCK FOOTAGE shot of an airplane landing. SUPERIMPOSED\n            OVER THE IMAGE are the words, \"BEN GURION AIRPORT - ISRAEL.\"\n\n                                ISRAELI WOMAN'S VOICE (V.O.)\n                      Shalom. Welcome to the Ben Gurion\n                      airport. For ground transportation,\n                      please proceed to Terminal 18. \n\n            We cut to the Hammer who's watching this stock footage of the\n            airplane landing on a TELEVISION SET by the \"CHERTZ\" car\n            rental counter. \n\n            INT. BEN GURION AIRPORT - CHERTZ CAR RENTAL COUNTER\n\n            The Hammer approaches the counter where a female ISRAELI\n            RENTAL AGENT stands waiting. \n\n                                HAMMER\n                      Do you speak English?\n\n                                ISRAELI RENTAL AGENT\n                      Yes. Chello.\n\n            The Ch sound she makes is accompanied by a whole lot of\n            spittle. The Hammer wipes his face, and then returns the\n            favor.\n\n                                HAMMER\n                      Chello. \n\n            She's unfazed. The Hammer continues.\n\n                                HAMMER (CONT'D)\n                      I need to rent your biggest Cadillac.\n                      Preferably lowered, with white wall\n                      tires.\n\n            She checks her rental sheet.\n\n                                ISRAELI RENTAL AGENT\n                      I'm so sorry sir, but somebody just\n                      rented our last Chadillac.\n\n            She nails him again. Seriously annoyed, he wipes his face\n            clean once more. \n\n                                HAMMER\n                      Well what else do you have?\n\n                                ISRAELI RENTAL AGENT\n                      Well, we do have a Ch...\n\n            The Hammer puts his hand up as a shield and cuts her off\n            quickly.\n\n                                HAMMER\n                      Whatever it is, I'll take it.\n\n                                                                 CUT TO:\n\n            EXT. ISRAELI OPEN  HIGHWAY - DAY\n\n            70's road music occupies the soundtrack as we see a shot of\n            the fast moving pavement of the open road. Slowly, we PULL\n            BACK to reveal the Hammer throttling a monstrous HARLEY\n            CHOPPER MOTORCYCLE.\n\n            The Hammer's Talis flaps wildly in the wind. His Shtreml\n            helmet is strapped on tight over his goggles.  \n\n            The scenery, oddly enough, resembles the Mojave Desert. \n\n            We cut to a sign reading \"THE WEST BANK PALMS: A GATED\n            COMMUNITY. COMING SOON!\" On it, we see an illustration of a\n            housing compound surrounded by a remarkable amount of BARBED\n            WIRE. \n\n            We PAN over to the highway as the Hammer zips past on his\n            motorcycle.\n\n            INT. ESTHER'S CADILLAC - CONTINUOUS\n\n            The Hammer, unaware of her presence, speeds by her large\n            Cadillac. She puts the car into gear. \n\n            EXT. ISRAELI OPEN  HIGHWAY - CONTINUOUS\n\n            Tucked out of sight behind a billboard, Esther pulls off from\n            her side of the road and onto the highway in pursuit of the\n            Hammer. And yes, the car is lowered, with white walled tires.\n\n            The camera makes it way up to reveal a large ROADSIDE\n            BILLBOARD ARROW, resembling the ones you might see\n            advertising casinos on the drive into Vegas announces \"THE\n            JEWISH ATOMIC CLOCK. 20 Kilometers.\" \n\n                                                                 CUT TO:\n\n            EXT. JEWISH ATOMIC CLOCK - AFTERNOON\n\n            From the outside the J.A.C has the appearance of an\n            observatory. For no apparent reason, a small MOTORCYCLE RAMP\n            sits near the front door. \n\n            A single Fed-Y truck pulls into the dirt parking lot.\n\n            A gang of THUG ELVES spill out of the back of the truck as a\n            S.W.A.T. team would. \n\n                                HEAD ELF\n                      Go, go, go!\n\n            The Head Elf jumps out, and out of frame.\n\n                                                                 CUT TO:\n\n            An ELF FLUNKY stand by a SMALL MOTORCYCLE RAMP, studying it\n            curiously. The Head Elf walks into frame.\n\n                                HEAD ELF (CONT'D)\n                      What's this doing here?\n\n                                ELF FLUNKY\n                      Not sure. I think it was left over from\n                      an Israeli Robbie Kneivel television\n                      special. You want me to get rid of it? \n\n                                HEAD ELF\n                      No time. Besides, it's not like someone's\n                      gonna jump their motorcycle into the\n                      building while we're inside.\n\n            The HEAD THUG ELF points up towards the sky.\n\n                                HEAD ELF (CONT'D)\n                      There's Santa now.\n\n            The Thug Elves look up to the sky, and we do an OVERHEAD PUSH\n            DOWN ON THEM as helicopter force winds blow their hats off. \n\n            The carriage of SANTA'S SLEIGH touches down on the ground. \n\n            Tiny Tim sits shotgun in the sleigh while Santa vomits\n            violently over the other side. Santa finishes up, and wipes\n            his mouth with his hand.\n\n                                TINY TIM\n                      You okay?\n\n                                SANTA\n                      No. I'm airsick you asshole! Where the\n                      hell did these reindeer learn to fly?\n\n                                TINY TIM\n                      I don't know. Why don't you ask them sir.\n\n            Santa takes this in.\n\n                                                                 CUT TO:\n\n            Santa paces as a Drill Sargent would in front of the line of\n            harnessed reindeer. They're shivering in their hooves.\n\n                                SANTA\n                      Who's the leader of this operation?\n\n            More scared reindeer faces. Comet furtively motions towards\n            Rudolph with his antlers. Santa sees this, marches quickly up\n            to Rudolph, and gets in his face.\n\n                                SANTA (CONT'D)\n                      What's your major malfunction, dumbfuck!?\n\n            Rudolph's scared shitless.\n\n                                SANTA (CONT'D)\n                      Step forward son!\n\n            Rudolph attempts to move forward, but the harness attachments\n            prevent him from doing so.\n\n                                TINY TIM\n                      Uh, he can't sir. The harnesses.\n\n            You can feel the Robert Deniro-esque intensity boiling inside\n            of Santa.\n\n                                SANTA\n                      You gonna learn to guide this sled right?\n                      You gonna make sure your men follow suit?\n                      Because if I'm puking down chimneys come\n                      Christmas Eve, I'm gonna have your hide.\n                      We clear?\n\n            Rudolph shakes his head. The bells on his harness tinkle.\n\n            Santa continues to stare down the reindeer as he walks away.\n            Rudolph is clearly broken, but continues staring back at\n            Santa as he makes his way out of frame. The expression on\n            Rudolph's face changes from fear to insolence as he angrily\n            follows the O.S. Santa.\n\n            Suddenly, Santa charges right back into frame, and places his\n            drawn gun to Rudolph's temple.\n\n                                SANTA (CONT'D)\n                      You eyeballin' me son!?\n\n            Rudolph quickly looks away. Santa puts his gun back into his\n            belt, and then adjusts his suit and hat as if to regain his\n            composure.\n\n            Without warning, Santa throws a fake punch at Rudolph's face,\n            forcing the reindeer to flinch.\n\n                                SANTA (CONT'D)\n                      I didn't think so.\n\n            INT. JEWISH ATOMIC CLOCK - MOMENTS LATER\n\n            Santa and his gang bust through the front doors, taking the\n            TWO GUARDS by surprise. \n\n            Santa's men quickly tie them up and duct tape their mouths\n            shut as if out of 'Gulliver's travels.' The guards are\n            dragged away out of frame.\n\n            Santa steps towards camera and surveys the room.\n\n                                SANTA\n                      The Jewish Atomic Clock.\n\n            It's the kind of place where a giant telescope at an\n            observatory would be housed. The clock is breathtaking in its\n            size. On its face, in place of the standard numerals are the\n            names of Jewish holidays. For example, \"Yom Kipur\" is where\n            the twelve should be, followed by \"Passover\", etc. In the\n            center of the face, an odometer-like gauge reveals the year\n            '5734.' At its base, the brilliant blue Judeum glows\n            brightly. \n\n            Santa barks out orders.\n\n                                SANTA (CONT'D)\n                      Get moving! We've got work to do!\n\n            One of the thugs pushes play on a ghetto blaster and the song\n            'Santa Claus Is Coming To Town' begins to play.\n\n            A few of the thugs insert a bicycle pump into the Judeum\n            clock base and begin pumping.\n\n            EXT. ISRAELI HIGHWAY - LATE AFTERNOON\n\n            The Hammer is moments away from the J.A.C. compound. He spots\n            the motorcycle ramp, and then guns his engine. He's close!\n\n            INT. JEWISH ATOMIC CLOCK - CONTINUOUS\n\n            Inside, Santa and his thugs hear the sound of the Chopper\n            growing in strength. The ROAR of the engines is piercingly\n            loud! And then nothing.\n\n            A beat passes, and then the Hammer's motorcycle busts open\n            the front door. \n\n            An INSERT of the Hammer's bike skidding to a stop. \n\n            As Santa goes for his gun, the Hammer interrupts him...\n\n                                HAMMER\n                      Uh. Can you just give me one second?\n\n            Santa is confused.\n\n            Still on the bike, the Hammer uses his feet to backpeddle the\n            motorcycle to the doorway. Looks of bewilderment from Santa\n            and his gang.\n\n            The Hammer reaches the doorway and kisses his hand. A John\n            Wooish SLO-MO shot as the Hammer touches his hand to the\n            mezuzah nailed to the doorframe. \n\n            The Hammer jumps off the bike, and we get the requisite QUICK\n            push in on him as he pulls out two Uzi's from under his\n            jacket.\n\n                                HAMMER (CONT'D)\n                      Let's dance the hora!\n\n            Santa draws a pistol, and with a single shot from his Uzi,\n            the Hammer blows it out of his hand. \n\n            It lands on the other side of the room. Santa looks up from\n            his empty hand.\n\n                                SANTA\n                      Get him boys!\n\n            Santa's Elf Thugs open a CHEST filled with LARGE SUB-MACHINE\n            GUNS. The chest is labeled \"HEAVY ARTILLERY.\" With great\n            difficulty, they struggle to pull the heavy machinery out of\n            the box. \n\n            The Hammer, mildly amused, watches them.\n\n            The Hammer blasts away, and the elves scramble for safety.\n            The sound of gunfire is deafening and constant.\n\n            An Elf sneaks quietly towards Santa's gun.\n\n            Esther walks in through the front door and spots something\n            O.S. that gives her cause for concern.\n\n            Unbeknownst to the Hammer, the SNEAKY ELF picks up Santa's\n            gun.  He raises it at the Hammer, ready to fire.\n\n                                ESTHER\n                      Mordechai! Behind you!\n\n            The Hammer turns and nails the elf just in time.\n\n            Esther, gun drawn, backs up into frame with the Hammer, and\n            the two fire off rounds.\n\n                                HAMMER\n                      What are you doing here?\n\n                                ESTHER\n                      Mordechai, I love you. I couldn't let you\n                      do this alone.\n\n                                HAMMER\n                      I love you too. I'm sorry about freaking\n                      out yesterday. I was wrong.\n\n                                ESTHER\n                      I forgive you.\n\n                                HAMMER\n                      Go check on the clock. I'll finish up\n                      here.\n\n            We do another QUICK PUSH into the Hammer as he turns towards\n            Tiny Tim.\n\n            Tiny Tim, standing alone with his crutches tucked under his\n            arms, looks like a deer caught in headlights.\n\n            The Hammer grins mischievously.\n\n                                TINY TIM\n                      Uh oh.\n\n            The Hammer begins firing.\n\n            In SLOW-MOTION, Tiny Tim hobbles as fast as he can towards an\n            overturned table, gunfire trailing him.\n            Like a pole vaulter with two poles, Tiny Tim plants his\n            crutches firmly into the ground and launches himself over the\n            table.\n\n            He lands directly on top of Santa, who cowers underneath the\n            table.\n\n                                SANTA\n                      Get off of me you cripple!\n\n                                TINY TIM\n                      What are we gonna do? He's got us on the\n                      ropes.\n\n            We DOLLY BACK with the Hammer as he approaches the camera,\n            firing rounds at the table.\n\n            We cut to the duct taped Hasidic Guards tied to their chairs.\n            One of them frantically nudges the other and motions to the\n            window. Fear fills both of their eyes.\n\n            We see what they see. Through the window, the SUN is quickly\n            setting behind the mountains.\n\n            We cut back to the Hammer. The speed with which he shoots\n            begins to slow.\n\n            Esther, checking the clock for damage calls to him. \n\n                                ESTHER\n                      What's the matter?\n\n                                HAMMER\n                      I don't know. I'm feeling kind of tired.\n\n            We cut back to Santa and Tiny Tim underneath the table. We\n            HEAR the shooting continue to slow, until finally it ceases\n            altogether. Santa and Tiny Tim exchange looks.\n\n                                SANTA\n                      What's going on? Why'd he stop?\n\n                                TINY TIM\n                      Maybe he ran out of ammo.\n\n                                SANTA\n                      Take a look.\n\n            Tiny Tim pokes his head over the table to see...\n\n            The Hammer and Esther lie together slumped up against the\n            wall. They look exhausted.\n\n            Tiny Tim drops back below the table.\n\n                                TINY TIM\n                      Well, he's kinda just resting in the\n                      corner with his girlfriend.\n\n                                SANTA\n                      Resting?\n\n            He thinks for a second. An idea forms.\n\n                                SANTA (CONT'D)\n                      What day is it?\n\n                                TINY TIM\n                      It's Friday.\n\n                                SANTA\n                      What time is it?\n\n                                TINY TIM\n                      I don't know. About sundown I guess.\n\n            Santa makes the connection.\n\n                                SANTA\n                      Why didn't I think of this? It's the\n                      Sabbath.\n\n            A blank look from Tiny Tim.\n\n                                SANTA (CONT'D)\n                      The day of rest. He can't fight on the\n                      Sabbath. C'mon, get up. We've got him\n                      beat.\n\n            The Hammer's POV as Santa and his thugs approach him\n            cautiously. \n\n                                SANTA (CONT'D)\n                      Well, well, well. It looks as if the\n                      Hebrew Hammer's got a weakness after all.\n\n            Santa turns to his thugs.\n\n                                SANTA (CONT'D)\n                      Finish extracting the Judeum from the\n                      clock.\n                          (To Tiny Tim)\n                      Tiny Tim, I want you to introduce the\n                      Hebrew Hammer to the Christmas spirit.\n\n            Another blank look from Tiny Tim.\n\n                                TINY TIM\n                      You want me to be nice to him for no\n                      apparent reason whatsoever, buy him\n                      clothing he'll never wear, and for just\n                      one day of the year pretend to forgive\n                      him for all the horrible things he did to\n                      me as a young boy when my mommy wasn't\n                      looking?\n\n                                SANTA\n                      No dipshit, I want you to kill him.\n\n            He thinks about it.\n\n                                TINY TIM\n                      Oh.\n\n                                SANTA\n                      Santa's gonna take the sled back to the\n                      North Pole and celebrate his victory with\n                      his new stocking stuffer. \n\n            Santa grabs Esther and attempts to pull her up. The Hammer\n            holds on tightly to her other hand, but isn't strong enough\n            to resist Santa's might. Esther's hand is pulled from his\n            firm grip, and Santa takes her into his arms.\n\n                                HAMMER\n                      Esther!\n\n                                ESTHER\n                      Mordechai!\n\n            Santa forces her out the front door, leaving Tiny Tim alone\n            with the Hammer. O.S., we hear the sound of Santa's Sled\n            taking off.\n\n                                TINY TIM\n                      Take a look Hammer. The clock's already\n                      beginning to power down.\n\n            We see a shot of the elves pumping out the Judeum from the\n            clock, and then tilt up to reveal its face.\n\n            The dial slowly spins past 'Yom Kippur', 'Passover',\n            'Hanukkah,' 'Purim', and then finally the 'Macy's 50% Off\n            Spring Sale.'\n\n            Tiny Tim raises his gun point blank at the Hammer.\n\n                                TINY TIM (CONT'D)\n                      Ah. What's the matter? No more snappy one\n                      liners.\n\n            It seems all is lost when...\n\n            We hear the sounds of a whole lot of GUNS being COCKED.\n\n            Tiny Tim turns around to see the ENTIRE KWANZAA LIBERATION\n            FRONT with their guns raised at him. Jamal, standing next to\n            Mohammed, flashes Tiny Tim a smile.\n\n                                JAMAL\n                      Merry Kwanzaa nigga!\n\n                                                   STAR OF DAVID WIPE TO:\n\n            INT. JEWISH DEFENSE LEAGUE - MAIN CHAMBER - SATURDAY NIGHT\n\n            The Hammer and Mohammed enter through the vault doors. The\n            Chief waits anxiously.\n\n                                CHIEF\n                      Mordechai, you're back. The clock?\n\n                                HAMMER\n                      Still ticking. Thanks to the help from\n                      the Brothers at the KLF, Hanukkah's safe\n                      for now. \n\n                                CHIEF\n                      That's wonderful! \n\n            The Chief notices the Hammer's dejected look.\n\n                                CHIEF (CONT'D)\n                      So why the long face?\n\n                                HAMMER\n                      It's Esther. Santa's got her.\n\n                                CHIEF\n                      My Esther! Oh Mordechai.\n\n            The Chief, overcome by sadness, slumps down into a chair. \n\n                                CHIEF (CONT'D)\n                      Please. Will you help me?\n\n                                HAMMER\n                      I love her sir. If I don't help you, I\n                      won't be able to make her my wife.\n                      Mohammed Ali Paula Abdul Rahim has agreed\n                      to come with me to the North Pole on a\n                      rescue mission.\n\n            Mo, standing in the BG, gives the Chief the fist/chest\n            salute.\n\n                                MOHAMMED\n                      Asalam Alekem.\n\n                                CHIEF\n                          (To Mo)\n                      You're a mench. Thank you.\n                          (To Hammer)\n                      Mordechai, by any means necessary, you\n                      bring my Esther back to me. Even if it\n                      requires using Judaism's most powerful\n                      weapon.\n\n                                HAMMER\n                      Oh no, not the...\n\n            The Chief shakes his head yes.\n\n                                HAMMER (CONT'D)\n                      There won't be any need for that sir.\n\n                                CHIEF\n                      Hammer, the fate of my daughter rests\n                      solely in your hands.\n\n                                HAMMER\n                      I know sir. I won't let you down.\n\n            The Hammer motions to Mo, and the two begin to leave. They\n            pass by Sammy Davis Jr. Jr. The Hammer acknowledges him.\n\n                                HAMMER (CONT'D)\n                      Sammy Davis Jr. Jr.\n\n                                SAMMY DAVIS JR. JR.\n                      You two cats are beautiful. I love you\n                      guys. You take care babe.\n\n            Mo whispers into the Hammer's ear.\n\n                                MOHAMMED\n                      What's wrong with him?\n\n                                HAMMER\n                      He's still working out some identity\n                      issues.\n\n                                                   STAR OF DAVID WIPE TO:\n\n            EXT. NORTH POLE - DAY\n\n            The Hammer and Mo crawl onto the snow covered bluff\n            overlooking Santa's Workshop. With his binoculars, the Hammer\n            scopes out the compound below.\n\n            BINOCULAR POV - Instead of your standard two circles filling\n            the screen, we see the world through a pair of Star Of\n            Davids. The place resembles the exterior of an industrial\n            warehouse, with two Elves on guard with guns.\n\n                                HAMMER\n                      It's gonna be tough, but the back\n                      entrance looks like our best bet.\n\n                                MOHAMMED\n                      I wanted to ask you, how were you able to\n                      pinpoint the exact location of Santa's\n                      workshop? We've been trying to gain that\n                      piece of surveillance for years.\n\n            The Hammer puts the binoculars down.\n\n                                HAMMER\n                      This is the year 5734. It's time the boys\n                      at the KLF got into the 58th century. Let\n                      me show you something.\n\n            The Hammer pulls out a LAPTOP COMPUTER.\n\n                                HAMMER (CONT'D)\n                      The JDL supplies all its agents with this\n                      state of the art device called a laptop\n                      computator.\n\n                                MOHAMMED\n                      Cool. What's it do?\n\n                                HAMMER\n                      Now this might get a bit technical, but\n                      try and stay with me. Using a highly\n                      sophisticated connection of other\n                      computators, called the Internet, I can\n                      access surveillance maps, villian\n                      biographical information, and even sports\n                      scores with a few simple keystrokes of\n                      this electronic typewriter.\n\n            The Hammer makes a few keystrokes and turns the screen\n            towards Mo.\n\n                                MOHAMMED\n                      Man, that's far out! Hey, the Jets won!\n\n                                HAMMER\n                      But wait, there's more. With a few swift\n                      clicks of this hand-computer interface,\n                      commonly referred to as a mouse, I can\n                      download illicit pornographic material\n                      and even send it along to a friend via a\n                      cyber postal route known as e-mail.\n\n            Mo's interest is seriously peaked.\n\n                                MOHAMMED\n                      Porno? You're tellin' me that you can get\n                      porno on that thing?\n\n                                HAMMER\n                      Oh yeah. Take a look. \n\n            The Hammer does some computing.\n\n                                HAMMER (CONT'D)\n                      For example, here's a picture of your\n                      sister Tawanda getting freaky with a\n                      German Shepard.\n\n            Mo's eyes widen.\n\n                                MOHAMMED\n                      Gettin' freaky with a what?\n\n            He grabs the laptop from the Hammer and looks at the screen.\n\n            A picture of TAWANDA making out with a GERMAN man decked out\n            in lederhosen on a rural German hillside. The two are\n            surrounded by sheep.\n\n            Mo gives a sigh of relief.\n\n                                MOHAMMED (CONT'D)\n                      Oy vey, that's almost as bad. That's\n                      Tawanda getting freaky with a notorious\n                      white supremacist. \n\n            Mo goes for the keyboard.\n\n                                MOHAMMED (CONT'D)\n                      Where's the white out button on this\n                      thing?\n\n            We get a CU of the ENTER KEY as Mo presses it. A SOOTHING\n            COMPUTERIZED FEMALE VOICE purrs...\n\n                                COMPUTERIZED FEMALE VOICE\n                      Message sent.\n\n                                MOHAMMED\n                      What just happened?\n\n                                HAMMER\n                      Remember that bit about the cyber postal\n                      route?\n\n                                MOHAMMED\n                      Yeah.\n\n            The Hammer looks at the blissfully ignorant Mo with empathy.\n\n                                HAMMER\n                      Nah, forget about it.\n\n            INT. SANTA'S CONFERENCE ROOM - DAY\n\n            Santa sits at the head of his conference table. Tawni and\n            Bambi sit on his lap. A cigarette dangles from his mouth, and\n            he holds a giant glass of eggnog in his hand. Rudolph stands\n            in the corner of the room. \n\n                                SANTA\n                      Rudolph, more egg nog!\n\n            Rudolph, equipped with a tray around his neck holding a glass\n            of egg nog, walks over. Santa stares at him antagonistically\n            as he takes the glass off of the tray and takes a sip.\n\n            Santa puts his cigarette back into his mouth, takes a drag\n            and blows smoke past camera. \n\n            A huge cloud of smoke blows over Rudolph's face.\n\n            Santa smiles at his women as we hear Rudolph cough.\n\n                                SANTA (CONT'D)\n                      Ho, ho, ho.\n\n            Suddenly, the two women are pushed from his lap as a SASSY\n            BLACK PROSTITUTE rises up between his legs from underneath\n            the table.\n\n                                SASSY BLACK PROSTITUTE\n                      Listen motherfucker, I already told you!\n                      I don't care how much yo ass is payin'\n                      me, if you call me that one more time\n                      there ain't gonna be no more visits down\n                      to the South Pole! You feelin' me!?\n\n            His ego deflates a bit.\n\n                                SANTA\n                      Yes maam, loud and clear.\n\n            Tiny Tim enters the room. He has a black eye and his clothing\n            is torn.\n\n                                SASSY BLACK PROSTITUTE\n                      Damn sugar, what happened to you?\n\n                                TINY TIM\n                      Santa, I got some really bad news.\n\n            EXT. COMPOUND PERIMETER WALL - DAY\n\n            The Hammer wears Tefilon, consisting of leather straps with\n            boxes, wrapped around his head and arms. He silently bows his\n            head in front of the gigantic wall as he mumbles something to\n            himself. Mo nervously scans the area for guards.\n\n                                MOHAMMED\n                      What are you doing?\n\n                                HAMMER\n                      Just praying to god that we don't kill\n                      ourselves going over this wall.\n\n            The Hammer unwraps his leather straps, and then tosses them\n            high over the wall.\n\n            The boxes on the straps catch on a pipe. The line is pulled\n            taut, and the boxes hold secure against the pipe.\n\n            The Hammer and Mo begin to scale the wall a la the 60's\n            Batman and Robin television show. The Hammer leads the way\n            while Mo, directly behind him, has his arms wrapped tightly\n            around his waist. The Hammer stops climbing for a second, and\n            turns to him.\n\n                                HAMMER (CONT'D)\n                      You know, you don't have to hold on to my\n                      waist. You're tied in.\n\n            Mo releases his arms from the Hammer's waist. Indeed, he is\n            tied in.\n\n                                MOHAMMED\n                      I knew that.\n\n            EXT. SANTA'S COMPOUND PERIMETER WALL - OTHER SIDE - MOMENTS\n            LATER\n\n            The Hammer and Mo drop from the wall onto the ground. The\n            Hammer looks around.\n\n            No guards in sight. In front of them is door clearly marked\n            \"BACK DOOR.\"\n\n                                MOHAMMED\n                      Well, that was easy.\n\n            Mo heads for the door. The Hammer calls to him.\n\n                                HAMMER\n                      Wait! Before we enter, you need to know\n                      that my research has determined that\n                      Santa's compound is wired with the XP\n                      2000 stereo type alarm system. \n\n                                MOHAMMED\n                      A stereo type alarm system?\n\n                                HAMMER\n                      Take a look.\n\n            The Hammer points to above the door. Sure enough, there sit\n            TWO LARGE STEREO SPEAKERS.\n\n                                MOHAMMED\n                      How do we bypass it?\n\n                                HAMMER\n                      The alarm will trigger if the system\n                      detects any Non-W.A.S.P. tendencies\n                      inside the building. For example, if you\n                      were to dribble a basketball, or eat\n                      watermelon, or use the word dawg...that\n                      is, spelled with an aw as opposed to the\n                      letter o...within the confines of this\n                      workshop, the alarm would sound.\n\n            This pisses Mo off.\n\n                                MOHAMMED\n                      Listen cat, I'll have you know that I\n                      hate the taste of watermelon and am a\n                      terrible basketball player.\n\n                                HAMMER\n                      Well that's good news for us. It means\n                      the system is outdated. This should be\n                      easy. C'mon.\n\n            The two enter through the door. \n\n            INT. SANTA'S WORKSHOP COMPOUND - CONTINUOUS\n\n            The Hammer shuts the door behind them. So far, so good.\n\n            Suddenly, the two hear the sound of footsteps coming down the\n            hall. They duck into a corner. \n\n            The sound of the footsteps passes. The Hammer makes the\n            silent military \"eyes\" gesture to Mo by pointing two fingers\n            at his eyes, indicating for him to check and see if the coast\n            is clear.\n\n            Mo bends out from the corner to look. Pennies fall from his\n            pockets.\n\n                                MOHAMMED\n                      It's all clear. Let's go.\n\n            The Hammer bends down to pick up the change.\n\n                                HAMMER\n                      Mo, I think you dropped some... \n\n            Mo's eyes widen in terror.\n\n                                MOHAMMED\n                      Hammer, no!\n\n            The Hammer picks up the pennies, and the ear splitting alarm\n            system is triggered. Red Lights flash, and over the\n            loudspeakers we hear..\n\n                                LOUDSPEAKERS\n                      Jewdar alert! Jewdar alert!\n\n            Mo and The Hammer start running down the hallway. Doors line\n            the corridor.\n\n            The Hammer kicks open one of the doors, and enters as it\n            shuts behind him. The camera stays in the hallway with Mo,\n            who looks around nervously. From inside the room, we can hear\n            INTENSE GUNFIRE.\n\n            The Hammer exits the room.\n\n                                HAMMER\n                      Let's go!\n\n            The two continue on down the hall. The Hammer spots another\n            door, violently kicks it open, and enters. Again, the door\n            shuts behind him followed by the sound of more INTENSE\n            GUNFIRE. \n\n            The Hammer exits.\n\n                                HAMMER (CONT'D)\n                      C'mon, let's go!\n\n            Mo stops and looks at him.\n\n                                MOHAMMED\n                      What are you doing?\n\n                                HAMMER\n                      Offscreen gunfire. That Jewish Atomic\n                      Clock stuff ate up a lot of our budget.\n\n            Mo shakes his head in understanding, and the two run on,\n            making a hard right out of frame at the corridor's end. A\n            beat passes, and then we hear MORE INTENSE GUNFIGHTING.\n\n                                                                 CUT TO:\n\n            ANOTHER CORRIDOR\n\n            Mo and the Hammer run into frame. Mo points to the other end\n            of the hall.\n\n                                MOHAMMED\n                      There's Tiny Tim.\n\n            Tiny Tim spots them and begins to hobble furiously away in\n            the other direction.\n\n                                MOHAMMED (CONT'D)\n                      I'll take Tiny Tim. You go find your\n                      woman.\n\n            Mo runs down the hallway after Tiny Tim. The Hammer turns\n            towards the other direction to find...\n\n            TWO ELVES on multi-colored MOPEDS comin' right for him.\n\n            The Hammer stands motionless as the Elves gain ground.\n\n            Right before they reach him, the Hammer quickly pulls his\n            Talis off of his neck and holds it outstretched,\n            clotheslining the two off of their mopeds. \n\n            The elves are out cold. The Hammer admires his work.\n\n            Santa, running for his life, rounds the corner. He stops dead\n            in his tracks as he spots the Hammer.\n\n            The two look at one another for a brief moment, and then\n            Santa points at something behind the Hammer.\n\n                                SANTA\n                      Hey, what's that over there? Is that a\n                      bowl of Matzah Ball soup?\n\n            The Hammer looks behind him. Nothing. He turns back to find\n            Santa long gone.\n\n                                HAMMER\n                      Damn!\n\n            He takes off down the hall after Santa.\n\n                                                                 CUT TO:\n\n            ANOTHER CORRIDOR\n\n            Mo catches up to the hobbling Tiny Tim, and begins to mock\n            the manner and speed at which he runs, running side by side\n            with him, circling around him as he attempts to get away,\n            etc. \n\n            Realizing that it'd be impossible to outrun him, Tiny Tim\n            comes to a stop.\n\n            Mo trains his pistol on him.\n\n                                MOHAMMED\n                      Now I'm gonna do to you what I should\n                      have done earlier.\n\n            Tiny Tim closes his eyes in anticipation of the worst.\n\n            Mo grabs both of his crutches from under his arm and runs\n            off. Tiny Tim wobbles a few steps and then slumps down\n            against the wall. We PULL AWAY from Tiny Tim as he calls to\n            Mo.\n\n                                TINY TIM\n                      My crutches. Noooo. Not my crutches.\n\n            INT. SANTA'S CONFERENCE ROOM - CONTINUOUS\n\n            Santa enters the room and begins to frantically barricade the\n            front door with anything he can find: a chair, a large\n            crucifix, a CART OF TOMATOES. Feeling confident that the door\n            is secure, he turns around to find the Hammer standing in\n            front of him.\n\n            The Hammer grabs Santa by his shirt.\n\n                                HAMMER\n                      Where's my girlfriend Santa?\n\n                                SANTA\n                      I don't have to tell you anything Hammer!\n                      You're gonna have to kill me before I\n                      tell you!\n\n            The Hammer's confused.\n\n                                HAMMER\n                      But if I kill you, then you'll be dead.\n\n            Santa thinks about this for a couple seconds.\n\n                                SANTA\n                      Good point.\n\n            The Hammer looks up from his interrogation and spots a sign\n            taped to a door directly behind Santa. It reads, \"THE ROOM\n            WHERE THE HEBREW HAMMER'S GIRLFRIEND IS.\"\n\n            The Hammer grins mischievously at Santa.\n\n                                HAMMER\n                      Don't worry your pretty little head.\n\n            Hammer fires a single round past camera. RED SPLATTERS his\n            face.\n\n            We cut to the other side. Santa cowers by the cart of\n            TOMATOES.\n\n                                HAMMER (CONT'D)\n                      That was a warning shot.\n\n            We hear Esther screaming from inside the room.\n\n                                ESTHER (O.S.)\n                      Mordechai! I'm in here! Help! \n\n            The Hammer turns towards the sound.\n\n            Suddenly, Santa kicks the Hammer's gun out of his hand, and\n            then draws a pistol from behind his belt and points it at\n            him.\n\n                                SANTA\n                      Looks like the tables have turned once\n                      again Hammer.\n\n            More screaming from Esther behind the door. \n\n                                SANTA (CONT'D)\n                      And you won't even be able to say goodbye\n                      to your Esther. So sad. So long\n                      Mordechai. Give my father my regards.\n\n            Santa readies to fire.\n\n                                HAMMER\n                      Wait! I didn't want it to come to this,\n                      but you leave me no choice. I have no\n                      other option but to use the most powerful\n                      weapon in the Jewish arsenal.\n\n            The Hammer closes his eyes and puts his hands together as if\n            in meditation. Santa looks around nervously.\n\n                                SANTA\n                      What are you doing?\n\n            The Hammer meditates for a bit more. Suddenly, his eyes open\n            and he begins...\n\n                                HAMMER\n                      I shlepped all the way to the North Pole\n                      for this? I come to fight you, and you\n                      don't even put out anything to nosh on?\n                      What kind of arch nemesis are you?\n\n                                SANTA\n                      Hah! Jewish guilt. Well, it won't work on\n                      me Hammer. I'm too strong for it.\n\n            Esther continues to scream for help. This makes the Hammer\n            even more determined.\n\n                                HAMMER\n                      What sort of host would treat company\n                      this way? Esther is clearly uncomfortable\n                      in your guest room. I'm shvitizing from\n                      running around shooting people. And my\n                      feet. What kind of flooring is this\n                      anyway? My arches are killing me.\n\n            It's beginning to work on Santa.\n\n                                SANTA\n                      No. Stop it!\n\n                                HAMMER\n                      And to top it off, you didn't even have\n                      the courtesy to give me a proper hello\n                      when I entered the room. What have I ever\n                      done to you to be treated with such\n                      disrespect?\n\n            Santa's a wreck.\n\n                                SANTA\n                      Please, make it stop. I'll do anything.\n                      Here take my gun.\n\n            He hands his piece to the Hammer and kneels on the ground,\n            pointing to his head.\n\n                                SANTA (CONT'D)\n                      Shoot me. Please, just one to the head.\n                      Put me out of misery.\n\n            Mo enters the room.\n\n                                MOHAMMED\n                      Hammer, you alright?\n\n                                HAMMER\n                      Everything's kosher. Watch him for me. \n\n            INT. ROOM WHERE THE HEBREW HAMMER'S GIRLFRIEND IS - MOMENTS\n            LATER\n\n            The Hammer kicks open the door.\n\n                                HAMMER\n                      Esther!\n\n                                ESTHER\n                      Mordechai!\n\n            She is restrained to a chair. The Hammer quickly unties her,\n            and the two kiss.\n\n            As they continue kissing, we hear the sound of someone\n            CLEARING THEIR THROAT. The Hammer looks towards the source of\n            the noise to see none other than JOSEPH LIEBERMAN. Joe is\n            tied to a chair, and wears a Gore/Lieberman 2000 campaign\n            button.\n\n                                HAMMER\n                      Joseph Lieberman?\n\n            The Hammer begins to untie Joe.\n\n                                JOSEPH LIEBERMAN\n                      Mordechai! Thank god you're here.\n\n            Esther looks at the Hammer curiously.\n\n                                ESTHER\n                      You two know each other?\n\n                                HAMMER\n                      We go to the same temple.\n\n            All three step back into Santa's Conference Room. Mo\n            continues to hold Santa at gunpoint.\n\n                                HAMMER (CONT'D)\n                      Mo, get him out of my sight.\n\n            Mo begins to take Santa away. \n\n            The Hammer turns around.\n\n                                HAMMER (CONT'D)\n                      No, wait. I need closure here.\n                          (To Santa)\n                      I just wanna say one thing. You know\n                      where you messed up Santa? You\n                      underestimated the true meaning of\n                      Hanukkah.\n\n            Santa's a broken man. He gets on his knees and inquires\n            earnestly...\n\n                                SANTA\n                      Please tell me. What is the true meaning\n                      of Hanukkah?\n\n            The Hammer thinks about this for a second. He's drawing a\n            blank. He looks to Esther, and she shrugs back at him. \n\n                                HAMMER\n                      That's...that's a very good question. And\n                      I do know that it does have something to\n                      do with...dreidels, and...\n\n            Esther chimes in.\n\n                                ESTHER\n                      ...and latkes.\n\n                                HAMMER\n                      And latkes! And some miracle oil that\n                      lasted eight days. And that my friend,\n                      should've been enough for you. Take him\n                      away Mo.\n\n            Mo drags Santa out of the room.\n\n                                SANTA\n                      I'm sorry. I see the light now. I was\n                      wrong. I'm...\n\n            And Santa's gone.\n\n            The Hammer turns to Esther, and gets down on one knee. He\n            places a ring on her finger.\n\n                                HAMMER\n                      Esther Bloomenbergensteinenthal, will you\n                      marry me?\n\n            She glows.\n\n                                ESTHER\n                      Yes! Of course! I'd gladly give up my\n                      last name to be with you.\n\n            The two kiss in celebration. \n\n            Joe pokes his head out into the Hallway.\n\n                                JOE LIEBERMAN\n                      What happened out there?\n\n            He looks to the Hammer. The Hammer shrugs his shoulders.\n\n                                JOE LIEBERMAN (CONT'D)\n                      Oh Mordechai, you know how I detest gore.\n\n                                HAMMER\n                      Well then maybe you should have thought\n                      about that before you ran with him.\n                      C'mon, let's get you back to Washington.\n\n            And we PULL out as the three make their way down the hallway.\n\n            TITLE CARD: ONE WEEK LATER. CHRISTMAS EVE.\n\n            INT. MRS. CARVER'S HOUSE - SHABAT\n\n            Mrs. Carver exits the kitchen, platters of food in hand.\n\n                                MRS. CARVER\n                      Shabat Shalom everybody!\n\n            We see Esther and the Hammer at the other end of the table.\n            They smile and hold hands. Domestic bliss.\n\n                                HAMMER/ESTHER\n                      Shabat Shalom!\n\n            With a bit of difficulty, Mrs. Carver works her large behind\n            into her chair.\n\n                                HAMMER\n                      And a Merry Christmas to all of our\n                      Gentile friends. Mun Chi.\n\n            The Hammer raises his glass in honor of Mun Chi. Mun Chi\n            returns the gesture.\n\n                                HAMMER (CONT'D)\n                      Before we start the Sabbath, I'd\n                      personally just like to thank god for all\n                      the blessings I've received over the past\n                      year. A beautiful fiancee...\n\n            Esther smiles.\n\n                                HAMMER (CONT'D)\n                      ...a wonderful mother...\n\n            Mrs. Carver is as proud as can be...\n\n                                HAMMER (CONT'D)\n                      ...and the opportunity to help my\n                      brothers and sisters in the Jewish\n                      community.\n\n                                MRS. CARVER\n                      Well I'm just glad you're safe Bubba\n                      Shaina, and eating by your mother for\n                      Shabos.\n\n            She squeezes his hand.\n\n                                HAMMER\n                      Thanks mom.\n\n            Mrs. Carver begins to cut her meat.\n\n                                MRS. CARVER\n                      But with all the attention the newspapers \n                      and television have given you, you'd\n                      think that you were the pope or\n                      something.\n\n                                HAMMER\n                          (Proudly)\n                      Well, I did save Hanukkah mom. My\n                      children, and my children's children, and\n                      my children's children's children...\n\n            He gets himself back on track.\n\n                                HAMMER (CONT'D)\n                      ...and their children will all be able to\n                      eat latkes and spin dreidels, and light\n                      the menorah with the knowl...\n\n                                MRS. CARVER\n                          (Interrupting)\n                      ...So you saved Hanukkah Mr. Big Shot.\n                      I mean, let's be honest Mordechai, it\n                      isn't even one of the high holidays.\n\n            Mordechai looks to Esther. She shrugs her shoulders in\n            encouragement.\n\n                                MRS. CARVER (CONT'D)\n                      Now, if you had saved Passover or Yom\n                      Kipur, then maybe you'd have what to brag\n                      about. Did I tell you that my friend\n                      Maureen's son, the Investment Banker, was\n                      responsible for a very big merger on...\n\n                                HAMMER\n                      ...No, no, no, no, no. I see what you're\n                      doing here. So all of a sudden Hanukkah's\n                      not good enough for you, is that right? \n\n            We get a shot of Mrs. Carver. She's a master of the art of\n            pleasant non-listening.\n\n                                HAMMER (CONT'D)\n                      Well I have news for you mom. It is good\n                      enough...I'm good enough and I won't\n                      leave here until I hear you tell me...\n\n                                MRS. CARVER\n                      Mazel Tov!\n\n            Mrs. Carver picks up the paralyzed Tabby and begins Eskimo\n            kissing it.\n\n                                MRS. CARVER (CONT'D)\n                      Hello Mazel Tov! A boojee boojee boojee\n                      boo...\n\n                                HAMMER\n                      ...I'm not finished yet, mom.\n\n            Mun Chi, completely uninvolved in the conversation and\n            obviously famished, scoops serving after serving onto his\n            plate. Mrs. Carver ignores her son as she continues to play\n            with the cat. \n\n                                MRS. CARVER\n                      ...A boojee boojee boojee boo.  What's\n                      that Mazel Tov? Your tuchus needs some\n                      more airing out?\n\n            Mrs. Carver removes the diaper. Esther and Hammer gag from\n            the smell of it.\n\n            Mun Chi, a forkful of food inches from his mouth, gets a\n            whiff and then places the utensil down in angry frustration.\n\n                                HAMMER\n                      Mom! We're eating!\n\n                                MRS. CARVER\n                      What a good poop you made in your diaper\n                      Mazel Tov! That's right! Mommy loves you!\n                      Such a good boy you are!\n\n            This gets the Hammer going.\n\n                                HAMMER\n                      Oh, I get it. To you, the cat pooping in\n                      his diaper is somehow better than my\n                      saving a Jewish holiday.\n                          (Giving up)\n                      Forget it.\n\n                                MRS. CARVER\n                      So, what are you two planning after the\n                      wedding?\n\n                                ESTHER\n                      Well, for starters, we're going to\n                      honeymoon in Boca for a week. And then,\n                      when we get back, Morty's been talking\n                      about taking a stable, good paying job as\n                      a consultant for the JDL.\n\n                                MRS. CARVER\n                      Well, I couldn't be happier for the both\n                      of you.\n\n            From outside, we hear the sound of sleighbells ringing.\n\n                                HAMMER\n                      I think I hear the new Santa Claus busy\n                      at work. C'mon.\n\n            The Hammer motions for everyone to get up and follow him to\n            the window. \n\n            We cut to the outside of the window looking in on the four as\n            they try and get a better look outside.\n\n                                MRS. CARVER\n                      I forgot to ask you, who'd they put in\n                      charge as the new Santa Claus?\n\n                                HAMMER\n                      Since Santa will be living out the rest\n                      of his days at a home for the\n                      religionally insane and because he had no\n                      blood heirs, the Kwanzaa Liberation Front\n                      and the Jewish Defense League agreed to\n                      make the whole Santa Claus process a\n                      democratic vote. We're all very pleased\n                      with the first Santa elect.  \n\n            The Hammer spots something up in the sky, and points it out\n            to the rest of them.\n\n                                HAMMER (CONT'D)\n                      Look, there he is now.\n\n            The full moon shines brightly in the BG of the night sky as\n            we slowly PAN past Rudolph and the rest of the reindeer,\n            eventually reaching the cockpit.\n\n            Jamal holds the reigns and waves down at Mordechai and\n            company.\n\n            From the window, Mordechai, Esther, Mrs. Carver, and Mun Chi\n            wave back. The Hammer Jewxploitation theme music begins to\n            fade up.\n\n                                HAMMER (CONT'D)\n                      Merry Christmas Jamal.\n\n                                JAMAL\n                      Merry Christmas Niggas!\n\n            We pull away from the outside window as the four continue to\n            wave.\n\n            One by one, the reindeer whip straight past camera followed\n            by Jamal. As he clears frame we...\n\n                                                      CUT TO END CREDITS.\n\n\n\n\nHebrew Hammer, The\nWriters :   Jonathan Kesselman\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:43.328900"}