{"title": "Hellbound: Hellraiser II", "film_link": "/Movie Scripts/Hellbound: Hellraiser II Script.html", "script_link": "/scripts/Hellbound-Hellraiser-II.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Hellbound: Hellraiser II Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Hellbound: Hellraiser II Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (9.50 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Peter Atkins\" title=\"Scripts by Peter Atkins\">Peter Atkins</a><br/>  <a href=\"/writer.php?w=Clive Barker\" title=\"Scripts by Clive Barker\">Clive Barker</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : March 2000<br/>\n<br/>\n<a href=\"/scripts/Hellbound-Hellraiser-II.html\">Read \"Hellbound: Hellraiser II\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>HELLRAISER II by Peter Atkins - November 1, 1987 Second Draft</title>\n\n<pre>\n<b>                   HELLRAISER II : HELLBOUND\n</b>\n\n                  Screenplay by Peter Atkins\n                Original Story by Clive Barker\n\n\n                                                 2nd. Draft\n                                                 November 1, 1987\n\n\n<b>FADE IN:\n</b>\n<b>1    TITLES\n</b>\nThe screen is composed of large, straight-edge areas of black\nand white that rest against each other in a manner that suggests\nsome kind of pattern, without making a final sense; it is as if\nwe are too close to something that, could we see it from a\ndistance, would be clear to us.\n\nThese areas shift and change - both their own shape and their\nrelationship to their neighbors.  New patterns are being made,\nnew solutions found - but they are just beyond our comprehension.\nThe effect should be aesthetically pleasing but simultaneously\nfrustrating and, perhaps, a little unsettling.\n\nShortly into this sequence, and subsequently inter-cut\nthroughout, we begin to see, in FLASHBACK, the story of\nHELLRAISER.  Arriving first as very short shock-images, these\nbrief sections eventually convey to the audience all the\nnecessary emotional and narrative information they will need to\nunderstand the background to HELLBOUND.\n\nMeanwhile, the black and white shapes are still moving, the\nunseen patterns still shifting.\n\nOver this constantly mobile background, the TITLES begin to\nappear.\n\nAs the TITLES unroll, another change comes over the puzzle pieces\nbehind them.  Where before they moved and related only in two\ndimensions, gradually we see that they are now claiming depth as\nwell.  The puzzle we are looking at is now a three-dimensional\none.  The pieces are now solid blocks of various geometric\nshapes, locking together, moving apart, finding their final\nposition.\n\nFinally, as the TITLES come to their conclusion, the camera pulls\nback until we can see clearly what we have been looking at.  As\nthe final piece clicks into positions we see it is THE LAMENT\nCONFIGURATION from HELLRAISER.\n\nThe closed box rests before our eyes a moment and then the circle\nin the centre of the side that faces us gives way to an image\nof a dusty street with a market. Simultaneous to this, the camera\nTRACKS into this image until it fills the screen\n\n\n<b>2    EXT   A STREET BAZAAR   DAY\n</b>\nThe TRACK continues up through the market and then turns through\nthe stalls to find a store behind them. As we TRACK through the\nstore's doorway, we pass through a beaded curtain that\nmomentarily reminds us of the TORTURE ROOM in HELLRAISER.\n\n\n<b>3   INT.   STORE   DAY\n</b>\nOnce we are in the store itself, though, this impression disappears.\nIt is an ordinary, slightly seedy, junk shop.\n\nThe stall seems to sell an odd mixture of items; native trinkets\nshare space with second-hand items from European colonists. These\nsecond-hand goods give us some sense of period. They suggest the\nlate 'twenties/early 'thirties. This is reinforced by the\nsounds coming from one of them, an old-fashioned mahogany-cased\nwireless. A foreign voice speaks from it in a language we don't\nunderstand, though perhaps the words \"BBC world service\" are\ndiscerned in the middle, and then a dance-hall tune of the period\nbegins to play. (Depending on availability, it would be nice to\nhave something relevant - 'I'll follow my Secret Heart', perhaps,\nor 'Dancing in the Dark'.)\n\nInto shot comes an ENGLISH OFFICER. His uniform, too, suggests\nthe 'twenties, the last days of Empire. He is tall, thin, and\ndark-haired, but at no stage do we see his face clearly. He\nstands in front of the stall.\n\nThe TRADER suddenly stands behind the counter. He has been\ncrouched beneath it, as if checking or preparing something. He\nis a big, impressive-looking black man. His face is totally\nimpassive as he stares at his customer.\n\nNeither of the men speak. Obviously, a deal has already been\nstruck and today is the pay-off.\n\nThe OFFICER, a little arrogantly - suggesting racist contempt,\nslaps down a bag of gold on the stall's counter.\n\nKeeping his eyes firmly on the OFFICER, he reaches beneath him\nand brings something up from under the counter and places it In\nthe OFFICER'S outstretched hand. He is holding a LAMENT\n<b>CONFIGURATION.\n</b>\nThe OFFICER turns and leaves. The camera TRACKS out of the store,\nlooking at the TRADER as he watches the departing OFFICER.\n\n\n<b>4    INT   THE OFFICER'S QUANSETT HUT   DAY\n</b>\nIt is typical of temporary military quarters, complete with a\ncurved ceiling of corrugated material. It is stripped of furniture.\nThe blinds are down.\n\nThe OFFICER, still in uniform, sits cross-legged, the BOX held\nbefore him.\n\nHe is already well into the solving process and very soon after\nthe shot begins the BOX begins to speed its own solution.\n\nFinally, two sections of the BOX shoot upwards and begin to peel\napart from each other, ready to reveal its secret.\n\nThe OFFICER, suddenly nervous, drops the BOX and scuttles back\nacross the floor to stare at it. The BOX lands upright, its\nextended parts still open above it. For a beat of two, nothing\nhappens. We become aware of the OFFICER'S pulse, throbbing\nexcitedly on the soundtrack.\n\n\n<b>5    INT   THE OFFICER'S QUANSETT HUT   DAY    OFFICER'S P.O.V.\n</b>\nSlowly we, the camera, and the OFFICER, move towards the still,\nsilent, but menacing BOX.\n\nWe approach it until finally we are above it, looking down into\nthe opening it has made in itself. There is undefined movement\ninside.\n\nSuddenly, something flies up directly at us. We glimpse it only\nbriefly, but enough to see its nature. Unlike the hooks that\nflaw at FRANK in HELLRAISER, this is more organic than metallic.\nPink and flesh-like but on a long gray-blue stalk, it\nflies upward, its lips peeling apart gapingly to reveal scores of\nyellow, discoloured, and viciously sharp teeth-like hooks.\n\nThe OFFICER screams and the screen begins to take on a red tint\nso that, just as the thing is about to fill the screen\nwith its hungry mouth, the entire screen turns red.\n\nThe red screen is held for a second and then suddenly becomes\ncomplete blackness.\n\n\n<b>6    INT   BLACK SPACE\n</b>\nThe black screen continues and, rising slowly from it and falling\nback slowly into it, in a dream-like, surrealistic manner, come\nvarious images of the OFFICER'S torment/pleasure in Hell.\n\nBy various camera tricks, such as step-printing or optical\nblurring, his face is still not clearly seen, but is seen enough\nfor us to see his sensual, almost orgasmic responses to what is\nbeing done to him.\n\nCuts appear spontaneously across his face, leaving a grid like\ncrisscross pattern of wounds.\n\nFinally, a disembodied hand gripping a hammer drives nails into\neach corner formed by these wounds and, as the face comes into\nfull view for the first time, we realize who this is. It is\nPINHEAD from HELLRAISER.\n\nPINHEAD'S completed face floats on the blackness and stares out\nat us.\n\n<b>                            PINHEAD\n</b>                        (echoed &amp; slow)\n                  Kirsty, come to daddy\n\nThe tiny silence following PINHEAD's words is shattered by a\npiercing and terrified scream.\n\n\n<b>7    INT   HOSPITAL ROOM    NIGHT\n</b>\nThe scream continues, but the blackness is replaced by KIRSTY's\nanguished face; it is she who is screaming. The scream subsides,\nreplaced by breathless panting accompanied by rapid eye movement.\n\n<b>                            RONSON\n</b>                         (off camera)\n                  Ah, you're awake. Good.\n\nWe pull out to see that KIRSTY is sitting up, fully dressed, on a\nhospital bed. RONSON, a police detective, sits on a plain wooden\nchair, which is the only other piece of furniture in the room.\nThe walls are bare save for a piece of primitive art on one wall,\nand, on another, a circular barred window looking out.\n\nRONSON stands up and walks to the foot of the bed. He rests his\nhand on the bed's metal frame and smiles a perfunctory smile.\n\n<b>                            RONSON\n</b>                  Tell you what - we'll make a\n                  deal. I'll tell you what I\n                  know, then you tell me what\n                  you know.  O.K.?\n\nKIRSTY is still re-orienting herself. She blinks a few times\nand then focuses on RONSON's hands gripping the bed.\n\n<b>                            RONSON\n</b><b>                  O.K.?\n</b>\nKIRSTY looks up at RONSON's face and then around at the room.\n\n<b>                            KIRSTY\n</b>                  Where am I?\n\n<b>                            RONSON\n</b>                  You're in the Malahide Institute.\n                  It's a psychiatric hospital. But, hey,\n                  don't feel judged - it was just\n                  the nearest place to bring you.\n                  Remember? You and your boyfriend... ?\n\n<b>                            KIRSTY\n</b>                  Steve...\n\n<b>                            RONSON\n</b>                  Don't worry. He's O.K.  We sent him\n                  home hours ago.  Jeez, what a story.\n\nHe puts a cigarette in his mouth and lights it.\n\n<b>                            RONSON\n</b>                  What was it, kid? Smack? Angel dust?\n                  Don't tell me acid's back in fashion?\n\n<b>                            KIRSTY\n</b>                  What are you talking about?  Who\n                  are you?\n\n<b>                            RONSON\n</b>                  Oh, excuse me...\n\nRONSON reaches in his jacket and flashes an I.D.\n\n<b>                            RONSON\n</b>                  Ronson.  Homicide.  I'm this\n                  district's slash and dash expert.\n                  Made a career of the nasty ones.\n                  That's why I was at your\n                  Dad's house.  Jesus, what a mess.\n\nKIRSTY'S eyes prick with tears. She looks away from RONSON.\n\n                            KIRSTY (to herself)\n                  Daddy...\n\n\n<b>8    INT   JUNK ROOM LODOVICO STREET   NIGHT\n</b>\nCORTEZ, a POLICE OFFICER, shifts some unpacked crates to\nallow a closer look at the shriveled and deformed corpse of one\nof FRANK and JULIA'S victims.\n\n<b>                            CORTEZ\n</b>                  Jesus...\n\nCORTEZ prods at the corpse with his night-stick, attempting\nto turn it over. A stream of maggots pours from the mouth and\nthe cavity that used to be its throat.\n\nCORTEZ jumps back in disgust and knocks against one of the\nseveral wardrobes in the cluttered room.  Another corpse flies\nout at him, as decayed and flvblown as the first.\n\nCORTEZ draws his gun and empties it blowing the corpses\nhead off, scattering flesh, mucus, and bone - but no blood -\neverywhere before realizing it is already dead.\n\nHe realises what he has done and lowers his weapon sheepishly.\n\n<b>                            CORTEZ\n</b>                  Oh. shit...\n\n\n<b>9   INT.   HOSPITAL ROOM   DAY\n</b>\nRONSON is sitting back in the chair, looking at the now slightly\ncalmer KIRSTY.\n\n<b>                            RONSON\n</b>                  We got two missing people\n                  and a house full of corpses.\n\nHe holds out his hand towards KIRSTY in a theatrical manner.\n\n<b>                            RONSON\n</b>                  Talk to me.\n\nKIRSTY swings her legs off the bad, but remains sitting on it,\nher feet on the floor. She doesn't look directly at RONSON but\nbegins to take in the (few) details of the room for the first\ntime.\n\n<b>                            KIRSTY\n</b>                  I thought Steve had talked\n                  to you?\n\n<b>                            RONSON\n</b>                  Oh, pardon me. I obviously didn't\n                  convey my hesitation to take his\n                  story at face-value. No, YOU\n                  talk to me. But - do me a favor? -\n                  none of this DEMONS crap.\n\nKIRSTY closes her eyes, almost wincing, as memory comes.\n\nKIRSTY opens her eyes. Consciously, she slows the rhythm of the\ndialogue down.\n\n<b>                            KIRSTY\n</b>                  He talked about Demons, huh?\n\n<b>                            RONSON\n</b>                  Yeah.\n\nKIRSTY turns her head to look directly at RONSON.\n\n<b>                            KIRSTY\n</b>                  It's true. All of it. It's all true.\n\nRONSON stares at her, impressed by her conviction and intensity.\nThere is a second of shared silence.\n\nSuddenly, a shocking ELECTRONIC CRACKLE shatters the mood. RONSON\nstarts, then realises it is the radio at his belt. He snatches it\nup and speaks into it.\n\n<b>                            RONSON\n</b>                  Ronson.\n\n<b>10    INT   BEDROOM  LODOVICO STREET   NIGHT\n</b>\nAnother OFFICER, KUCICH, is standing, radio in hand, by the\nblood-stained mattress. CORTEZ stands beside him, gun now safely\nre-holstered.\n\n<b>                            KUCICH\n</b>                  Kucich here,sir.  We just found another one,\n                  though it suffered a little...\n\nKUCICH looks at CORTEZ, who looks embarrassed.\n\n<b>                            KUCICH\n</b>                  ...er, accidental damage in discovery.\n                  Anyway, just about the only portable\n                  evidence we've got here - apart from\n                  human remains - is the mattress. Looks\n                  like someone was messed up real bad\n                  on it.\n\n\n<b>11    INT   HOSPITAL ROOM   NIGHT\n</b>\n<b>                            KUCICH\n</b>                         (off-camera)\n                  Can we send it downtown?\n\nRONSON throws KIRSTY a look of exasperation with his colleague.\nThe camera stays on KIRSTY's face as RONSON speaks.\n\n<b>                            RONSON\n</b>                  What the hell are you asking me\n                  for?  Tag it.  Move it.\n\n                            KIRSTY (to herself)\n                  The mattress... The mattress... JULIA.\n\nWithout waiting for a reply, RONSON switches the radio off and\nclips it back to his belt.\n\n\n<b>12    INT   BEDROOM   55 STREET   NIGHT\n</b>We are looking at the mattress. KUCICH has left the room.\n\nCORTEZ draws a pad from his packet. The pad is stapled, and\nthe staple has been badly inserted and is not closed property.\nIn the act of tearing a label from the pad, CORTEZ catches\nhis thumb on the staple.\n\n<b>                            OFFICER\n</b>                  Shit!\n\nThe label is adhesive-backed. CORTEZ licks it and presses\nit on the mattress. He writes on it - 55L/E1.  As he stands up\nfrom doing this, a single drop of blood from his thumb lands on\nthe mattress. (It is important that we see it is only a single\ndrop - and nothing like the amount LARRY spilled on the\nfloorboards.)\n\nCORTEZ leaves the room to fetch a colleague to help him\nmove the mattress.  We move in to see the drop of blood disappear\nvery quickly into the mattress, as if it is being sucked in.\n\nAs this happens, we hear on the soundtrack the faintest RUMBLE.\n\n\n<b>13    INT   OPERATING ROOM   NIGHT\n</b>\nA somewhat antiquated and frightening operating room, filled\nwith machines, monitors, and surgical instruments. The corners of\nthe room fall away to shadow.\n\nSitting upright in the centre of the room is a FEMALE PATIENT.\nShe is awake and staring out at the camera.  Twin probes/clamps\nare in each of her ears to hold her in place.  Her head is shaved\nand the skin on the back of her head has been cut open and peeled\napart.  The flaps of the skin are held away from the area being\nworked on by four clamps. (we never actually see round to the\nexposed brain itself)\n\nImmediately behind her, and probing with professional skill and\ncoolness into her exposed brain, is DOCTOR MALAHIDE.  He is in\nhis late forties and looks like all the great doctors look -\nrational, civilized, competent, and powerful.  There is an\nintensity in his eyes and the lines  of his face though that\nsuggests something more than normal.\n\nThe room has several attentive listeners and observers, but the\none nearest to MALAHIDE is his personal student/assistant KYLE\nMACRAE, young, conventionally good-looking, with an open,\nfriendly, face.\n\nMALAHIDE is holding forth on the secrets of his trade, several times\nlooking away from his patient while still working on her, to make\nsure his audience understand his points.\n\n<b>                            MALAHIDE\n</b>                  We can bring them back properly\n                  more often than scientific orthodoxy\n                  dictates, ladies and gentlemen.  And\n                  the knife, far from the enemy of\n                  of analysis, is often its greatest\n                  ally in solving the puzzles of\n                  psychosis. Analysis isolates and\n                  massages. Surgery pinpoints and\n                  corrects. ... though you've got to\n                  know what you're doing, of course...\n\nPolite laughter from several students.\n\n<b>                            MALAHIDE\n</b>                  Some things are obvious. Here,\n                  for example, ...\n\nHe prods in at a specific area.\n\n<b>                            MALAHIDE\n</b>                  ...are the optical motor nerve\n                  control centers.\n\nThe PATIENT begins to blink in time with MALAHIDE'S prodding.\nThe affect is half-comical, half-distressing.  Perhaps MALAHIDE\ncarries it on just that half-second too long for innocent\ndemonstration.  But the students give impressed murmurs anyway.\n\n<b>                            MALAHIDE\n</b>                  Now. This case. A deeply-buried\n                  psychosis severe enough to produce\n                  frighteningly frequent hysteria and\n                  aggression. Incurable. Say others. Not so.\n                  Analysis isolates. The knife\n                  exposes. Medication controls.\n\nAs he speaks, MALAHIDE injects a syringe directly into the\nPATIENT's brain. Her face spasms momentarily.\n\nMALAHIDE stands back slightly. His face is serene, calm, and\nconfident.\n\nHe takes a small, motorised drill and sets to work on the brain.\n\n<b>                            MALAHIDE\n</b>                  And then, ladies and gentlemen, we\n                  REBUILD. With all the care and\n                  knowledge that our years of training\n                  have given us ...\n\nHe looks around at them all, smiling slightly.\n\n<b>                            MALAHIDE\n</b>\n<b>                  ... WE BRING THEM BACK.\n</b>\nThe students murmur their approval. Perhaps they even applaud.\nMALAHIDE acknowledges their reaction with a modest nod.\n\nSuddenly, an intercom on the wall cuts in.\n\n<b>                            INTERCOM\n</b>                  Dr. Malahide, the new arrival is\n                  awake, and appears very distressed.\n\nMALAHIDE steps back briskly and begins to peel his cloves off.\nHe nods at a nearby student.\n\n<b>                            MALAHIDE\n</b>                  My part in this is over.  You\n                  may tidy up for me.  Kyle, you\n                  come with me.\n\nMALAHIDE and KYLE leave the room.\n\n\n<b>14    INT   HOSPITAL ROOM   NIGHT\n</b>\nKIRSTY has her hands over her face and is shaking.  RONSON stands\nand crosses to her.  He takes her hand from her face and calms\nher.\n\n<b>                            RONSON\n</b>                  Easy, easy.  Whatever happened,\n                  whatever you saw, it's not here\n                  now.\n\n<b>                            KIRSTY\n</b>                  I saw it...him.  But I got away.\n                  And I took the box.  And I solved\n                  it.  And they came.\n\n<b>                            RONSON\n</b>                  Who?\n\n<b>                            KIRSTY\n</b>                  The Cenobites.\n\nShe stares directly at RONSON, daring him to disbelieve.\n\n<b>                            KIRSTY\n</b>                  The Demons.\n\nRONSON stares back, perhaps a glimmer of belief in his eyes.\n\nOn the soundtrack, the sudden and shocking sound of a door being\nslammed open and hitting the wall.\n\nKIRSTY screams. Even RONSON is startled.\n\nIn the doorway are DOCTOR MALAHIDE and KYLE.  MALAHIDE advances\ninto the room, smiling apologetically as he does so.\n\n<b>                            MALAHIDE\n</b>                  Sorry.  Must get that door\n                  fixed.  Detective Ronson?\n\nMALAHIDE holds his hand out, as RONSON nods in response.\n\n<b>                            MALAHIDE\n</b>                  I am Doctor Malahide.\n\nThe man shake hands. MALAHIDE gestures behind him.\n\n<b>                            MALAHIDE\n</b>                  My assistant, Kyle Macrae.  And\n                  this must be Kirsty?\n\nMALAHIDE speaks quickly, as if to get the formalities out of the\nway.  As he says her name, he smiles benignly at KIRSTY who,\nstill distraught from her memories and shocked at the slamming of\nthe door, simply stares at him.\n\nMALAHIDE turns his attention back to RONSON, drawing him away and\nspeaking to him in a lower voice.\n\nMeanwhile, KYLE walks over to KIRSTY and smiles at her - long\nenough to embarrass her into smiling back.\n\n<b>                            MALAHIDE\n</b>                  I've read the boy's statement.\n                  Quite the adventure they\n                  believe they had. I'd like to talk\n                  to her alone. Do you think ... ?\n\nRONSON looks over his shoulder at KIRSTY.  He then looks\ncarefully at MALAHIDE and then nods slowly.\n\n<b>                            RONSON\n</b>                  Mmmm.  O.K.  Frankly, I think\n                  she's more your territory than\n                  mine.  Shame.\n\nRONSON looks back at KIRSTY.\n\n<b>                            RONSON\n</b>                  Kirsty.  Doctor Malahide's going\n                  to look after you now.  Maybe we\n                  could talk some more tomorrow.\n\nKIRSTY nods vaguely and then, just as RONSON reaches the door,\ncalls out to him.\n\n<b>                            KIRSTY\n</b>                  Wait!  The mattress.  You've got\n                  to destroy it.  She DIED on it,\n                  you see.  The mattress.  It's\n                  haunted now.  She can come back...\n                  like Frank. SHE CAN COME BACK.\n\nRONSON smiles helplessly at her, then glances at MALAHIDE with a\n \"you see what I mean\" expression, and leaves the room.\n\n                            KIRSTY (to herself)\n                  The mattress ...\n\nMALAHIDE stares at her briefly, with a strange expression on his\nface and then abruptly follows RONSON through the door.\n\nKIRSTY is too absorbed to notice this odd behavior, but KYLE\nstares incredulously as MALAHIDE leaves the room.\n\n<b>                            KYLE\n</b>                  Uh...excuse me a moment.\n\nHe follows to the door and stands in the doorway, looking down\nthe corridor.\n\n\n<b>15    INT   HOSPITAL CORRIDOR    NIGHT\n</b>\nRONSON stands before a set of double-doors, talking to a\n<b>UNIFORMED OFFICER.\n</b>\nMALAHIDE comes into view, walking swiftly, and instantly talks\nover their conversation.\n\n<b>                            MALAHIDE\n</b>                  Detective. I'll be able to help\n                  this girl. But I need your assistance ...\n\n\n<b>16    INT   HOSPITAL CORRIDOR   NIGHT\n</b>\nLooking back at the corridor, we see the door to KIRSTY'S room\najar, and KYLE standing by it looking down.\n\n\n<b>17    INT   HOSPITAL CORRIDOR   NIGHT  (KYLE' P.O.V)\n</b>\nA LONG SHOT of MALAHIDE and RONSON.  KYLE, and we, are too far\naway to hear what is said, but MALAHIDE in nodding and gesturing\nemphatically, as if persuading RONSON of something.\n\n\n<b>18   INT   HOSPITAL ROOM NIGHT\n</b>\nKYLE returns into the room and closes the door. His expression is\npuzzled, troubled. Then he remembers there is a patient here and\nhe smiles.\n<b>                            KYLE\n</b>                  So...You're Kirsty, huh?\n\n\n<b>                            KIRSTY\n</b>                  You a doctor, too?\n\nKYLE smiles again.\n\n<b>                            KYLE\n</b>                  Nearly a doctor. I'm Kyle\n                  Macrae. Call me Kyle.\n\nKIRSTY draws a deep breath, temporarily calmed. She even manages\na smile.\n\n<b>                            KIRSTY\n</b>                  Hi, Kyle.\n\nMALAHIDE re-enters the room.\n\n<b>                            MALAHIDE\n</b>                  Now, Kirsty...\n\nKIRSTY looks at him warily.\n\n<b>                            KIRSTY\n</b>                  The cop. He didn't believe me.\n\n<b>                            MALAHIDE\n</b>                  I suspect not. But that\n                  doesn't necessarily mean\n                  you're wrong, does it?\n\n<b>                            KIRSTY\n</b>                  Do you believe me?\n\nMALAHIDE offers a re-assuring laugh.\n\n<b>                            MALAHIDE\n</b>                  Well, I don't know yet.\n                  However, you're not lying.\n                  YOU believe this is the truth.\n\n<b>                            KIRSTY\n</b>                  It IS the truth.\n\nSuddenly, the door opens again. An INTERN is standing there. For\nthe briefest of moments, MALAHIDE looks furious and then,\ncatching himself, assumes his calm demeanor.\n\n<b>                            MALAHIDE\n</b>                  Well?\n\n<b>                            INTERN\n</b>                  Sorry, Dr. Malahide. But it's\n                  Tiffany. She's escaped ... again.\n\nMALAHIDE sighs.\n\n<b>                            MALAHIDE\n</b>                  Very Well.\n\nHe looks down at KIRSTY.\n\n<b>                            KIRSTY\n</b>                  I'm sorry, Kirsty. Kyle will\n                  come back with something to\n                  help you sleep. We shall speak\n                  tomorrow.\n\nMALAHIDE and KYLE follow the intern from the room, KYLE giving a\nlast friendly smile as the door closes behind them.\n\n\n<b>19   EXT.   CARNIVAL   NIGHT\n</b>\nWe are staring down the midway of a deserted carnival. On either\nside, stalls and rides beckon to pleasures that their locked\ndoors and tarpaulin-draped entrances deny. A light rain is\nfalling.\n\nA huge wooden cut-out of a grinning clown dominates one stall\nwhile the sign beneath him seems to state the ethos of the whole\nplace; LOTS 'O' FUN.\n\nAnother has a banner proclaiming FREAK SHOW, with the subheading\n<b>YOU'LL GASP AT THE GEEK!\n</b>\nOn the horizon in the distance, almost denying the reality of\nwhat we are seeing, tower vast cranes of unimaginable height\nwhile beyond them impossibly huge oil-drums squat against the\nmoon-bright but cloudy sky.\n\nInto shot, and running down the midway, comes a girl, TIFFANY.\n\nTIFFANY is a girl in her early teens but looks younger\nthen her years due to her boyish figure and her slightly over-\ndelicate features.\n\nFor the last months, TIFFANY has been finding ways out of the\ninstitute and making her way here, where she has one special\nobsession, which we will soon see.\n\nFollowing her into shot, but many yards behind, come two INTERNS\nfrom the Institute. They contrast each other almost comically,\none being tall and plump while the other is smaller and thinner.\nThey're not quite the Stan and Ollie of the medical world but\nwith some serious rehearsal they could get there.\n\n                            1st INTERN\n                  Oh, Jesus -she's gonna make it.\n\nEven as the first INTERN says this, we see TIFFANY make a sharp\nleft turn into a stall entrance.\n\n\n<b>20   EXT.   HALL OF MIRRORS   ENTRANCE   NIGHT\n</b>\nA front view of the stall into which TIFFANY has run. The large\nsign above it proclaims 'HALL OF MIRRORS' and a smaller sign\nperched above a distorting mirror to one side of the entrance\nsays 'YOU'LL BE AMAZED'.\n\nThe two INTERNS enter at a run.\n\n\n<b>21   INT.   HALL OF MIRRORS    NIGHT\n</b>\nThere follows a hopelessly one-sided pursuit through the\nmirror maze as TIFFANY effortlessly eludes the two INTERNS.\n\nThere are three major facets to this sequence;\n1) Comic relief - as the two interns make fools of themselves.\nThere could even be a room of distorting mirrors where the thin\nINTERN becomes fat and the fat one thin.\n2) TIFFANY'S ease and expertise with patterns and puzzles.\n3) Confusion of the audience's sense of the real and the unreal.\n\nThis goes on long enough for us to realise the 1ST INTERN was\nright to worry, how long TIFFANY could elude them. Then,\njarringly, as the screen is full of reflected TIFFANYS\nthere suddenly appears amongst them a single image of\n<b>MALAHIDE.\n</b>\nEverything stops.\n\nThe image of MALAHIDE (and we shouldn't he sure yet if we're\nlooking at a reflection or the real man) puts its hands out,\npalms up.\n\n<b>                            MALAHIDE\n</b>                  Tiffany. Come.\n\nAll the TIFFANYS move quietly toward him until they all disappear\nfrom view. Then the real TIFFANY comes into shot, her back to us,\nand walks toward what we now see to be the real MALAHIDE, who is\nstanding in a doorway deliberately framed like a mirror to\nconfuse the customers.\n\nTIFFANY places her hands docilely on to MALAHIDE's outstretched\nones.\n\n\n<b>22   INT.   HOSPITAL ROOM   NIGHT\n</b>\nKIRSTY has been dozing fitfully, but is awakened by strange\nnoises. At first terrified, she slowly realises it is simply\nsomeone being put in the room next door.\n\nShe waits until activity has ceased and then moves to her door.\nIt is unlocked. She moves out into the corridor.\n\n\n<b>23   INT.   HOSPITAL CORRIDOR   NIGHT\n</b>\nLooking warily from side to side, KIRSTY edges out into the\ncorridor, along it, and then stops by the door of the adjoining\nroom.\n\n\n<b>24   INT.   TIFFANY'S ROOM   NIGHT   C.U.\n</b>\nA hand fits a piece of jig-saw puzzle into the space it belongs.\nWe know it is a jig-saw by the shape of the pieces, but it is\nclearly not the conventional type - a picturesque photo - because\nall we can see at this close-up angle are large areas of black\nand white.\n\n\n<b>25    INT. TIFFANY'S ROOM   NIGHT\n</b>\nWe now see that the puzzle is on the floor of a room of a similar\nsize to KIRSTY'S. It is slightly more decorated; It has curtains\nand wallpaper. And a tiled floor. Sitting cross-legged on the\nfloor next to the puzzle is TIFFANY.\n\nThe puzzle, which we can now see more clearly, is an intricate\nabstract design in black and white. There are several pieces\nstill un-fitted but TIFFANY is working steadily, efficiently, and\nwith complete concentration.\n\nOn a wall behind her there is a visual record of her progress\nover the last few months. Sealed in plastic by staff members are.\nPuzzles she has solved, with dates marking her advancement. They\nbegin with the simplest wood block animals usually given to very\nsmall children. passing through photo-puzzles of increasing\ndifficulty, and culminating in one or two other examples of the\nkind of complicated pattern-work she is involved in now.\n\n\n<b>26   INT.   HOSPITAL CORRIDOR   NIGHT\n</b>\nWe pull out to see that this is KIRSTY'S P.O.V. from the glass\npanel in the door of TIFFANY'S room.\n\nTIFFANY looks up at one point and eye-contact is made. KIRSTY\ngives a tentative smile and a small wave. TIFFANY stares at her.\nThe stare is long but unresponsive and finally TIFFANY returns to\nthe puzzle.\n\nKIRSTY has her back to us and the camera is quite close in when a\nhand suddenly moves into shot and touches her shoulder.\n\nKIRSTY jumps back in alarm, fear on her face. But it is only\n<b>KYLE.\n</b>\nKYLE raises his hand in apology.\n\n<b>                            KYLE\n</b>                  Oh, Jesus, I'm sorry. God, if\n                  anyone should know not to do that,\n                  it's me. I'm sorry. O.K.?\n\nKIRSTY nods and gives a nervous smile. KYLE, still embarrassed by\nhis foolishness and eager to change the subject, nods towards the\nglass panel.\n\n<b>                            KYLE\n</b>                  Sad, huh? She's been here\n                  six months. Her name's TIFFANY.\n\n<b>                            KIRSTY\n</b>                  What's the matter with her?\n\n<b>                            KYLE\n</b>                  Almost complete withdrawal. She\n                  hasn't said a word for nearly\n                  two years.\n\n<b>                            KIRSTY\n</b>                  God, that's terrible.\n\n<b>                            KYLE\n</b>                  Yeah. Doctor Malahide's got her\n                  doing these jig-saws and things,\n                  though. Says it's helping to\n                  bring her out.\n\nKYLE ushers KIRSTY back into her own room.\n\n\n<b>27   INT.   HOSPITAL ROOM   DAY\n</b>\nAs he closes the door to KIRSTY's room, KYLE reaches into the\npocket of his lab-coat and produces a small box of pills.\n\n<b>                            KYLE\n</b>                  Anyway, let's concentrate on\n                  you for a moment. Wanna suck\n                  on this for me?\n\nKIRSTY looks up at him sharply. He is proffering a pill and\ngrinning facetiously.\n\n<b>                            KIRSTY\n</b>                  Hey, good joke, Kyle. Do you\n                  always come on to the mentally\n                  ill?\n\nKYLE's face falls. He blushes. Pressing the pills into KIRSTY's\nhand, he backs off to the door, apologising.\n\n<b>                            KYLE\n</b>                  Shit. Sorry. Here's the\n                  pills. Red face. Door. Bye.\n\nHe exits hurriedly, closing the door behind him. KIRSTY grins\ndespite herself. She looks at the pill for a second or two and\nthen puts it firmly back in the box. Realising there is no\nbedside table, she puts the box on the wooden chair.\n\n<b>                            KIRSTY\n</b>                  Jesus, I'm glad I'm not paying\n                  for this place.\n\nShe is about to lie down on the bed, when she senses something is\nwrong in the room.\n\nKIRSTY is instantly tense again. She swings her head to the side\nand tenses in horror, stifling a scream.\n\nIn the corner of the room, against the wall lying in a pool of\nblood, is her skinned father LARRY.\n\nKIRSTY emits a pained moan of pure anguish as she realises what\nshe is looking at.\n\n<b>                            KIRSTY\n</b>                    (under her breath)\n                  Daddy...\n\nThe thing in the corner raises its arm weakly from its side and\nbegins to write on the wall in its own blood.\n\nIt writes : I AM IN HELL; HELP ME.\n\nKIRSTY covers her eyes with her hands and begins to sob.\n\nKIRSTY takes her hands from her eyes.\n\nThe figure has gone. The pool of blood has disappeared. But, on\nthe wall the words remain.\n\nKIRSTY makes herself rise from the bed and walk slowly across the\nroom.\n\nHer eyes full of tears, she stretches out her arm and touches the\nword 'I'.\n\nAs her fingers make contact, the words instantly disappear.\n\nShe presses her bloodied finger quickly to her lips before that\nlast trace of her father can vanish, too.\n\n\n<b>28    INT.    TIFFANY'S ROOM  NIGHT\n</b>\nTIFFANY is still sitting up cross-legged, weeping. Her puzzle is\ncompleted.\n\n\n<b>29    EXT.    THE INSTITUTE   DAY\n</b>\nBasically an establishing shot to show it is the next morning but\nit also serves to show MALAHIDE walking briskly to work. His suit\nis tasteful and simple, but discreetly expensive-looking. He\nwalks with purpose and looks straight ahead, acknowledging only\nwith polite nods the respectful greetings of various JUNIOR\nDOCTORS and NURSES he passes on his way. He enters the institute.\n\nWe should also see several patients being walked, or wheeled,\naround by STAFF during this shot.\n\n<b>                            MALAHIDE\n</b>                          (off-camera)\n                  And how are we feeling today...?\n\n\n<b>30   INT.   LARGE WARD   DAY\n</b>\nThis is a large, traditional hospital ward with a line of beds\ndown each long wall and a wide central aisle.\n\nNearly all of the beds are occupied and, at the far end of the\nward, there is a male patient in a wheelchair.\n\nAll the PATIENTS' eyes turn immediately and happily to MALAHIDE\nas he crosses the room, continuing his speech.\n\n<b>                            MALAHIDE\n</b>                  Better? Good.\n\nHe-doesn't stop his progress but walks straight through the room\nand into the corridor.\n\nAs the door closes behind him the WHEELCHAIR PATIENT scowls.\n\n<b>                            W/CHAIR PATIENT\n</b>                  105 years and he still doesn't\n                  know my name.\n\n\n<b>31    INT.   HOSPITAL CORRIDOR   DAY\n</b>\nMALAHIDE walks swiftly down the corridor in which we saw him talk\nto RONSON earlier, but this time the camera follows him through\nthe double doors and further down the corridor.\n\nHe enters an elevator and the doors close in front of him.\n\n\n<b>32   INT.  BASEMENT CORRIDOR   DAY\n</b>\nMALAHIDE exits the elevator into a lower corridor, one not so\ncarefully decorated.\n\nWe are in the area in which the more deeply disturbed of the\nInstitute's patients live.\n\nThe rooms are smaller, closer together, and there is an\nobservation panel set in each door.\n\nMALAHIDE looks into the first four rooms.\n\nIn the first, a middle-aged, overweight woman sits completely\nmotionless in the middle of the floor. She is dressed in a\nshapeless white robe and is sitting crosslegged. Her head is\nshaven, her eyes are rolled completely up into the sockets so\nthat only white shows.\n\nIn the second, a very thin man of about thirty is pressed as\ntight as he can be into one corner of the room. His hair is long\nand he has a full beard. He is naked but not unadorned - his body\nand much of his cell wall is smeared in excrement.\n\nIn the third, a man of about MALAHIDE'S age-stands in the centre\nof the room. He is of normal build but his head is shaved. His\nface, scalp, and hands are covered in self-inflicted and\namaterurish tattoos- all of crosses. He is dressed in T-shirt and\njeans. With both hands he holds aloft a silver crucifix, pointing\nit in all directions, as if under constant siege by Devils. He\nmutters prayers and invocations constantly.\n\nIn the fourth, a man in his early twenties restrained in a\nstrait-jacket. He shuffles around on the call-floor, his eyes\ntwitching and flitting from one part of his body to another.\n\n<b>                            BROWNING\n</b>                          (muttering)\n                  Get them off me. Get them off me.\n\nOff-camera, we hear the sound of KIRSTY's sobbing - which bridges\nthe CUT TO:\n\n\n<b>33 INT.  HOSPITAL ROOM DAY\n</b>\nKYLE enters, having heard KIRSTY crying. She is sitting with her\nlegs over the side of the bed with her face in her hands.\n\nKYLE immediately sits next to her and puts an arm around her\nshoulder. He doesn't force her to speak. He lets her let the\ntears out. Finally, she looks up.\n\n<b>                            KIRSTY\n</b>                  I...I had a visitor.\n\n<b>                            KYLE\n</b>                  What?\n\n<b>                            KIRSTY\n</b>                  Oh, Jesus. I can't explain. It's\n                  ...it's. I don't know how to\n                  help! I have to save him and I\n                  don't know how to help!\n\n<b>                            KYLE\n</b>                         (Carefully)\n                  Kirsty, I'm sorry...  don't\n                  understand. I...\n\n<b>                            KIRSTY\n</b>                  I know. No-one can. But I have to save\n                  him. Where's the other doctor? He said\n                  He'd listen. He promised.\n\nKYLE responds quickly to this. His faith in MALAHIDE is\nstrong, despite that curious incident of the previous night when\nMALAHIDE followed RONSON out of the room.\n\n<b>                            KYLE\n</b>                  Dr. Malahide. Yes. Look, I'll\n                  fetch him. You take it easy.\n                  I'm sure he can help.\n\nKYLE stands up, making soothing motions with his hands, and heads\nfor the door.\n\n<b>                            KIRSTY\n</b>                  Help. No, no-one can help. I\n                  just want someone to listen\n                  or I WILL go crazy.\n\n<b>                            KYLE\n</b>                  If anyone can help, HE can.\n\nKIRSTY turns and gives KYLE a strange look as he opens the door.\n\n<b>                            KIRSTY\n</b>                  Yeah? He got a ticket to Hell?\n\n\n<b>34    INT.    HOSPITAL CORRIDOR     DAY\n</b>\nWe TRACK with KYLE down the corridor, eventually reaching an\nimpressive door, which is slightly ajar. Even before we reach it,\nwe hear MALAHIDE's voice. He is clearly on the phone. Because of\nthe nature of what he is hearing, KYLE pauses when he reaches the\ndoor, listening with a confused expression on his face.\n\n<b>                            MALAHIDE\n</b>                   (off-camera &amp; gradually fading up)\n                  Officer Kucich? Yes, Doctor\n                  Malahide. You've spoken to\n                  Ronson? Yes ... That's right.\n                  The mattress ... No, I'll meet\n                  you by the side entrance. No, no,\n                  my HOUSE. Yes, let me make that\n                  clear. The house, NOT the hospital.\n                  ... Yes ... Fine, and thank you.\n\nWe hear the phone click. KYLE waits a moment and then walks\nswiftly through the door, speaking as he does so.\n\n<b>                            KYLE\n</b>                  Doctor Malahide ... ?\n\n\n<b>35   INT.   HOSPITAL ROOM    DAY\n</b>\nKIRSTY'S face fills the screen. Her voice is slightly dreamy, as\nif she is still trying to understand herself the story she is\nabout to tell.\n\n<b>                            KIRSTY\n</b>                  It must have been going on\n                  forever...\n\nHer voice trails off. We pull out to see KIRSTY sitting up on her\nbed. MALAHIDE on the wooden chair, and KYLE standing by the\ndoor.\n\nMALAHIDE's voice pulls her back.\n\n<b>                            MALAHIDE\n</b>                  Kirsty...?\n\nKIRSTY snaps back and continues to speak in a more normal voice.\n\n<b>                            KIRSTY\n</b>                  But the part I know about,\n                  That must have started with\n                  my Uncle Frank...\n\n<b>                            MALAHIDE\n</b>                  Then let us speak of it ...\n\n<b>DISSOLVE TO\n</b>\n\n36   EXT.   MALAHIDE's HOUSE  TWILIGHT\n\nWe TRACK in slowly towards a modern house that we will learn is\nMALAHIDE'S, up the drive, towards the front door.\n\n<b>DISSOLVE TO\n</b>\n\n<b>37  INT.  MALAHIDE'S HALLWAY  TWILIGHT\n</b>\nThe TRACK continues along the hallway and into the OBSESSION\n<b>ROOM.\n</b>\n\n<b>38   INT.   OBSESSION ROOM   NIGHT\n</b>\nThe TRACK continues.\n\nThe room is dim, lit only by stray shafts of moonlight.\n\nOn the floor in the centre of the room is the mattress.\n\nThe TRACK stops. A main light is clicked on and MALAHIDE moves\ninto shot.  MALAHIDE pours himself a scotch from the decanter that\nsits on the writing table and approaches the mattress.\n\nHe is clearly very, excited. He walks around the mattress two or\nthree times, never taking his eyes off it.\n\nHe walks back to the writing table, throws his drink back, puts\nthe glass down and leaves the room.\n\n\n<b>39   EXT.   MALAHIDE'S HOUSE  NIGHT\n</b>\nMALAHIDE leaves through his front door and walks toward the\nhospital.\n\n\n<b>40    INT.   OBSESSION ROOM NIGHT\n</b>\nAfter a few seconds silence we hear a repeated clicking sound, as\nif something is being forced, followed by a louder snap and the\nsound of a sash window being opened.\n\nThe curtains balloon inwards, part, and KYLE steps into the room.\n\nHe stands still for a moment, as if making sure he is alone, and\nthen begins to take in his surroundings.\n\nThe room is entirely devoted to MALAHIDE'S secret obsession -\nwith the Paranormal in general and the Lament Configuration in\nparticular.\n\nIt is a fair-sized, square shaped room. Prints, paintings, and\nphotographs cover the walls. All of these pictures relate in some\nway to his obsession; photographs of ghost-sightings; portraits\nof magicians from Cagliostro to Crowley; prints of arcane symbols\nand pentagrams, etc.\n\nSpecifically, we recognize a print that resembles very closely\nthe jigsaw he has had TIFFANY recently solve. Also, there are\nframed diagrams (which look very old) of the Lament Configuration\n-Both open and closed.\n\nOn a long, low table there are three glass cases. In each of\nthese cases is a Lament Configuration. On each case is a small\nlabel giving a location, a date of acquisition, and a number -\nwhich we may assume to be the number of deaths attributable to\nthat specific box.\n\nThese labels read:          CAIRO 3/4/'59 7\n<b>                            LYONS 6/2/'72 4\n</b><b>                            NEW YORK 12/3/'81 5\n</b>\nThere are also, on a small desk-top bookshelf on a writing table,\neditions of MALAHIDE'S own books. He seems to have spent his\ncareer publicly denying what he is privately obsessed with -\nbecause the books titles include 'Possession: Not Demons but\nDisease','The Myth of the Diabolic', and 'The Internal Inferno'.\n\n<b>                            KYLE\n</b>                  Jesus Christ. Jee-sus-kerr-ist!\n\nWe assume he has visited MALAHIDE'S house before, but he has\nclearly never seen this room.\n\nHe stares at the mattress with incredulity, as if he still can't\nbelieve his superior has had it brought here. Then he begins to\nlook around the room in more detail. He approaches the glass\ncases and bends slightly to look at their contents.\n\nKYLE shakes his head.\n\n<b>                            KYLE\n</b>                  Oh, shit.\n\n\n<b>41   INT.   BASEMENT CORRIDOR NIGHT\n</b>\nMALAHIDE walks past a bank of meters and huge circuit breakers on\nhis way to the lower and of the corridor, by the cells\nof the very disturbed. He stops by the cell of the man in the\nstrait-jacket. We hear from the outside the familiar muttering of\nBROWNING. MALAHIDE enters the call.\n\n\n<b>42   INT.   BROWNING'S CELL   NIGHT\n</b>\nAs MALAHIDE enters, BROWNING looks at him. His eyes demand, not\nplead, and he speaks through clenched teeth.\n\n<b>                            BROWNING\n</b>                  Get them off me. Get. Them.\n                  Off. Me.\n\n\n<b>43   INT.   OBSESSION ROOM   NIGHT\n</b>\nKYLE is rooting through the drawers in the writing table.\n\nGenerally the contents are unremarkable - handwritten notes, a\nfew patients case-files etc. - but in one of the drawers he\nfinds a black ring-binder which he takes out and lays on the\ntable.\n\nIt is a book of faces. There are about fifteen sheets in the\nbinder. Some of them are genuine photographic prints, some\nphotocopies of original photos. They range widely in age, race,\nand sex. They are all full-face portraits. Chronologically, the\nrange is extensive too. Some pictures (generally photocopies)\nappear to date from the earliest days of photography, the late\n1880's, others have an Edwardian appearance, or suggest the\n1920's. Only one or two seem to be less than thirty years old.\n\nKYLE flicks back and forward in the book, wondering on the\nsignificance of these people.\n\nHe is lost in the musings when the click of the front door tells\nhim MALAHIDE has returned.\n\nKYLE closes the book and quickly slips it back into the drawer.\nHe heads rapidly for the window he came in through but realises\nMALAHIDE is too close for him to open it and make good his\nescape. Instead he stands between the window and the curtains,\npulling the latter closed over him.\n\nMALAHIDE enters the room, leading BROWNING who is still strait-\njacketed.\n\n\n<b>44    INT.    BEHIND THE CURTAIN        NIGHT\n</b>\nWe see KYLE standing very still in the limited space behind the\ncurtains. It is clearly seen that, given the thoroughness with\nwhich he closed the curtains and his immobile position, he is\nunable to see what is happening in the room. He can hear, but not\nsee.\n\n\n<b>45   INT.   OBSESSION ROOM    NIGHT\n</b>\nMALAHIDE leads BROWNING across to the mattress. Standing beside\nit, he unbuckles and removes the strait-jacket from his patient.\n\nBROWNING, beneath the strait-jacket, is naked to the waist. His\narms and cheat are a mass of scars of various age and size.\n\nMALAHIDE gestures to the mattress. Now that his arms are free,\nBROWNING is scratching furiously.\n\n<b>                            MALAHIDE\n</b>                  Mr. Browning. Please, lie down.\n\nBROWNING lies down, still scratching, trust and hope in his eyes.\n\n\n<b>46  INT.   OBSESSION ROOM   BROWNING'S DELUSION  (BROWNING'S P.O.V.)\n</b>\nAs if looking through BROWNING's eyes, we see his body stretched\nout before us on the mattress.\n\nThe naked chest and arms are covered with raised lumps, red and\npainful-looking.\n\nAs his scratching arms attack these lumps, they break open,\nrevealing vile black insects that have hatched beneath his skin.\nBROWNING brushes these away while he scratches at the remaining\nlumps.\n\n\n<b>47   INT.   OBSESSION ROOM   NIGHT\n</b>\nBROWNING has already re-opened some of the more recent scars, and\nblood slowly rises to the surface of his skin.\n\nMALAHIDE walks over to his writing tableland goes into one of\nthe drawers.\n\nHe produces an old-fashioned cut-throat razor and walks back to\n<b>BROWNING\n</b>\n<b>                            MALAHIDE\n</b>                  Here. This will help.\n\nHe proffers the razor. BROWNING siezes it. MALAHIDE steps back\nquickly, a mixture of anticipation and apprehension on his face.\n\nBROWNING slashes at his body and left arm with a short, sharp,\nslicing motions. In his mind, he is lancing the cysts that\ncontain the tormenting insects. In reality, he is inflicting\nhorrifying damage on himself.\n\nBlood pours from the multitude of wounds, running over his body\nand down onto the mattress.\n\nSuddenly, without any preliminaries, two painfully thin, flayed,\nmucus-covered arms shoot out of the mattress, one on either side\nof the still-busy BROWNING.\n\nThey wrap themselves tightly across his chest and crush him\ntightly to the mattress, as a head, similarly wasted, oozes out\nof the mattress to the side of BROWNING's head.\n\nBeneath his delusions, BROWNING suddenly has an inkling of what is\nhappening to him. His eyes widen and his mouth opens ready to\nemit a scream but the monster beneath him forces a hand over his\nmouth as it buries its face into the soft flesh of his neck.\n\nTwo legs now rise from the oozing slime that the bloodstains on\nthe mattress have become. They too wrap themselves around\nBROWNING so that he is held tight.\n\nFinally, with titanic effort, he gathers enough momentum to roll\ncompletely free of the mattress and falls to the floor beside it.\nThe thing on his back now is pulling free from the bed of\nbubbling, frothing slime that the mattress now is with a sliding,\nslurping sound.\n\nThe monster's face is now deep in the flesh of his throat, and\neven as BROWNING forces himself up first onto one knee and then,\nvery unsteadily, onto his feet, we can see him wasting away - his\nface losing its fullness and colour, his chest sinking in on\nitself.\n\nThe creature, which is still wrapped around him and clinging\ntight is, unlike him, growing in stature by the second. Muscles\nare inflating, arteries pumping more vigorously, and flesh itself\nfilling out.\n\nIts horrific thin-ness when it first appeared effectively unsexed\nit but now, as its regeneration continues, the fullness of its\nhips, the roundness of its thighs, and the sacs of fat and muscle\nthat bloom above its ribs confirm its female nature. If there was\nany doubt that this was JULIA, it is now disappearing.\n\nBROWNING is now nearly a walking corpse and it is the strength of\nhis will alone that allows him to take a few faltering steps with\nJULIA still enveloping him. With the desperate strength with which\nshe clings to him and the way her legs are wrapped around his\nhips, it is like an obscenely perverse parody of sexual passion.\n\nMALAHIDE has been watching all this with an incredible mix of\nemotions playing across his face. Still human enough to feel both\nfear and disgust at what is happening he is nevertheless awe\nstruck and exhilarated. He has waited all his life for such an\nirrefutable demonstration of the power and the truth of the\nsupernatural.\n\nSimilarly, the scientist in him is fascinated by the living\nanatomy lessons that JULIA's regeneration and BROWNING rapid\ndecay offer.\n\nWith one last dying effort, the now-almost-husk-like BROWNING\nbreaks JULIA'S grip and makes a futile step forward as she falls\nfrom him. He totters towards the curtains.\n\nJust as the audience think he will pull them down with him,\nrevealing KYLE, JULIA grabs his ankle and pulls. He falls back to\nthe floor.\n\n\n<b>48   INT.   BEHIND THE CURTAINS   NIGHT\n</b>\nThe loud noise of BROWNING's fall renews KYLE's resolve to see\nwhat is going on. Carefully, he shifts his position so that he\ncan see through a small gap in the curtains.\n\n\n<b>49   INT.   KYLE'S P.O.V.   NIGHT\n</b>\nKYLE may have heard one or two strange and unpleasant noises but\nBROWNING has not screamed nor JULIA spoken; nothing has prepared\nhim for what he sees - a skinned woman sucking out what life\nremains from the dried husk of a psychotic man.\n\n\n<b>50   INT.   BEHIND THE CURTAINS   NIGHT\n</b>\nKYLE's head jerks back, shaking as if he's just had an electric\nshock. His mouth moves but no sound emerges.\n\n<b>                            KYLE\n</b>                           (mimed)\n                  Jesus Christ!\n\nHis terror simultaneously urging speed and silence, KYLE gingerly\nmaneuvers himself out of the window.\n\n\n<b>51   INT.   OBSESSION ROOM   NIGHT\n</b>\nJULIA lies back satisfied on the floor. She looks up weakly at\n<b>MALAHIDE.\n</b>\n<b>                            JULIA\n</b>                  Help me.\n\nHer voice is perfect. MALAHIDE stares at her, his fascination\nintense. He crosses the few yards that separate them. He looks at\nher, lying beside the hollow shell that was CHEYNEY. Her eyes\nstare back, brilliant, sparkling, alive.\n\n<b>                            JULIA\n</b>                  Help Me.\n\nMALAHIDE realises her temporary vulnerability; all the life force\nshe has absorbed from BROWNING has made up her body, but it will\ntake some moments for the strength to return to her.\n\nFascinated and sympathetic as he is however he cannot yet quite\nbrine himself to touch this creature. Instead he moves the\nmattress nearer to her, allowing her to crawl back onto it and\nlie down again.\n\nMALAHIDE stares down at her. He attempts a smile, but is too\nnervous to make it convincing. He is trembling slightly. This\ncontact with the beyond is something he has dreamt of for years,\nbut nevertheless the physical reality is overwhelming.\n\nJULIA treats him to the approximation of a smile. She is far from\nnervous.\n\nShe studies herself. Her figure is fully formed, her womanliness\nundeniable. All she is missing is a skin. She stretches her arms.\nShe lifts her legs. She writhes on the bed in pleasure, like an X-\nray photograph of a calendar girl.\n\nMALAHIDE stares at her, following the sensual movements of her\nbody. He swallows, a little embarrassed by his response to the\nnaked display he is privileged to watch.\n\nJULIA'S eyes twinkle at him.\n\n<b>                            JULIA\n</b>                  Don't be embarrassed. You're\n                  my friend.\n\nShe looks away and continues her stretching and wiggling, more\nconscious of it now as an erotic display.\n\nThe strength has flooded through her body as she rises to her\nfeet, and stops off the mattress, smiling at MALAHIDE.\n\nMALAHIDE backs away from her as she moves towards him, doing his\nbest to return her smile.\n\nAfter a few steps, JULIA stops and simply stares into MALAHIDE'S\neyes. He too stops and returns the gaze. The camera circles them\nslowly several times, studying them - the dressed, nervous man\nand skinned, confident woman.\n\n<b>                            JULIA\n</b>                  Well?\n\nMALAHIDE says nothing. Perhaps he swallows nervously. The camera\ncontinues its circling movements. The scene FADES TO BLACK and\nJULIA begins to laugh, small, sensual giggles at first building\nfinally as the blackness comes into an almost hysterical\ncrescendo of raucous joy.\n\n\n<b>52   INT.   HOSPITAL ROOM   NIGHT\n</b>\nKIRSTY is again lying on her back on top of the bed. She is a\nstark contrast to JULIA. No display. No laughter.\n\nHer eyes are open and red-rimmed from weeping now. There is also\ncomplete silence.\n\nAll the more jarring, then, the sudden sound of someone fumbling\nat the handle of KIRSTY'S door.\n\nHer eyes widen in alarm and she flings herself off the bed,\nscanning the room for anything that can be used as a weapon.\nThere is nothing but the chair and she she has all but lifted it\naloft when she sees that it is KYLE, who comes into the room.\n\n<b>                            KIRSTY\n</b>                  Shit, Kyle. This is getting to\n                  be a habit. What is it, some\n                  kind of shock-therapy?\n\nShe was angry, relieved, and amused when she realized it was KYLE\nand all these showed in her voice and face. Now they drop away\ncompletely, replaced by a nervous apprehension as she becomes\naware of the blank horror on his face.\n\n<b>                            KIRSTY\n</b>                  Oh, Jesus. What is it?\n\nKYLE opens his mouth a few times, as if unsure what to say.\n\n<b>                            KYLE\n</b>                  It's all true.\n\n\n<b>53   INT.   TIFFANY'S ROOM   NIGHT\n</b>\nTIFFANY walks around her room, staring at her completed puzzles -\nthose on the wall and the one on the floor - and waiting for the\nnext one.\n\n<b>FADE OUT\n</b>\n<b>FADE IN\n</b>\n\n<b>54   EXT.   MALAHIDE'S HOUSE   DAY\n</b>\nA simple shot tells us it is the next morning.\n\n\n<b>55   INT.   OBSESSION ROOM   MALAHIDE'S HOUSE   DAY\n</b>\nMALAHIDE , dressed in a black suit, is in the room, staring at\nthe empty mattress. We TRACK with him through to his LIVING ROOM.\n\n\n<b>56   INT.   LIVING ROOM  MALAHIDE'S HOUSE   DAY\n</b>\nIn contrast to the secret and private obsession room, this room\nis the tasteful and upmarket room of the successful professional.\n\nIt is a long spacious room with modern furniture and white walls.\nThe walls are mostly free of decoration save for two or three\nlarge canvases of abstract art.\n\nThe longest wall is broken up only by a low circular table, which\nrests against it about half way down. On this table is a very\nsimple black vase containing a spray of beautiful white lilies.\nAbove this vase on the wall is a large frameless mirror.\n\nAs MALAHIDE enters, the first thing he sees is a bloody palm-\nprint on one of his white walls. He blinks at it and looks down\ninto the room. We CUT TO;\n\nJULIA. At first it seems she is staring at the lilies, but as we\nTRACK around her, we realise she is staring at the reflection of\nher skinned self.\n\nHer face snarls at herself, she roars with rage, forms her hand\ninto a fist and shatters the mirror.\n\nMALAHIDE rushes towards her. She swings round and freezes him\nwith a glance.\n\nThey hold their positions for a moment, MALAHIDE nervous and\nJULIA furious, and then JULIA makes herself relax. She sighs,\ntakes a few deep breaths, and then speaks.\n\n<b>                            JULIA\n</b>                  I'm cold.\n\n<b>TIME CUT\n</b>\n\n<b>57   INT.   LIVING ROOM   MALAHIDE'S HOUSE   DAY\n</b>\nCLOSE UP on a strangely Art Deco electric fan heater, with bright\nred coils emitting waves of heat.\n\nWe pull out to see MALAHIDE standing by the table with the flowers.\nThere is now a half-full glass of wine on the table, along with\nan ashtray where a cigarette burns away ignored. A pack of\ncigarettes is now visible in the breast pocket of MALAHIDE's jacket.\n\nJULIA enters the room and closes the door behind her. She is\ndressed in one of MALAHIDE'S suits. It is a light weight suit of\nwhite linen, a suit for expensive holidays in hot countries.\n\nShe crosses the room to the table; pausing slightly in the centre\nof the room, to allow MALAHIDE to look at her.\n\n<b>                            JULIA\n</b>                  Well?\n\nMALAHIDE'S nervousness has retreated a little, he manages to\nsmile. He nods his head slowly a few times.\n\n<b>                            MALAHIDE\n</b>                  Yes... Yes. You look...\n\n<b>                            JULIA\n</b>                  Surreal? Strange? Nightmarish?\n\n<b>                            MALAHIDE\n</b>                  No. You look...\n\nHe pauses, lost for words.\n\nJULIA doesn't wait for an answer. She crosses to the table and\ntakes up his glass of wine. She downs it in one.\n\nMALAHIDE stares at her, a little surprised.\n\n<b>                            JULIA\n</b>                  Yes, I still like WINE ...\n\nShe smiles strangely at him and then moves closer. Slowly,\nkeeping her eyes on his, she reaches into his breast pocket\nfor his packet of cigarettes and places one in her mouth.\n\n<b>                            JULIA\n</b>                  ... and more.\n\nFor a moment, MALAHIDE's face is stone. Then, slowly, he returns\nher smile and, drawing his lighter, lights her cigarette.\n\n\n<b>58   INT.   SHOPPING MALL   DAY\n</b>\nA large multi-level shopping complex obviously up-market and\nexpensive.\n\nWe see MALAHIDE, riding up one on the central escalators, looking\naround him as he does so, as if searching for a specific shop.\n\nHe reaches the next level and begins to walk along one of the\nseveral avenues that lead away from the central square containing\nthe escalators.\n\nHe walks past several shops, looking in their windows; a chic\nspecialty shop, a window full of clocks, a cutler's. Finally,\nhe stops in front of one. He stares at its display window.\n\nThe window is classily minimal. There is in fact only one dress\nin it. It is an exquisite white cocktail gown. The gown is full\nlength but quite tight-fitting, merely flaring a little from\nbelow the knee, and has a halter-neck.\n\nMALAHIDE walks into the shop.\n\n\n<b>59   INT.   MALAHIDE'S BEDROOM   DAY\n</b>\nWe are looking at a reflection of MALAHIDE in the large mirror\nthat covers the inside of his wardrobe door. His real hand and\nhis reflected hand come together at the edge of the door and tip\nit slightly, changing the image that the mirror shows us.\n\nNow we see JULIA. She is in the dress from the shop in the mall.\nIt is a perfect fit and shows her figure off very well. Being a\nhalter-neck, however, her skinned arms and shoulders are\ncompletely bare. Also, it is quite low cut at the front, exposing\na fair degree of visceral cleavage, and at the back.\n\nJULIA turns fully around in front of the mirror examining herself\nfrom every angle. Her mood is unreadable until she speaks.\n\n<b>                            JULIA\n</b>                  Close it.\n\nMALAHIDE does so. He understands and tries to console her..\n\n<b>                            MALAHIDE\n</b>                  It's a beautiful dress...\n\n<b>                            JULIA\n</b>                  I know.\n\n<b>TIME CUT\n</b>\n\n<b>59   INT.   LIVING ROOM   MALAHIDE'S HOUSE   DAY\n</b>\nCLOSE UP MALAHIDE'S hands applying wide, white, surgical\nbandages to JULIA.\n\nWe pull out as MALAHIDE steps away from JULIA. They are both\nstanding in the middle of the living room floor.\n\nJULIA'S arms, torso, and head are now completely enclosed in\nneatly and professionally applied bandages. There are three slits\nfor her eyes and mouth but apart from these she is completely\ncovered. Over these she is still wearing the white dress.\n\n<b>                            MALAHIDE\n</b>                  There...\n\nJULIA lifts her arms slightly to look at them and then touches her\nbandaged face. She turns towards MALAHIDE. The camera begins the\nsame circling movement it made around them the previous night.\n\nMALAHIDE'S nervousness has practically disappeared. He has helped\nthis woman. He has bandaged her and dressed her. He is slightly\nin awe of her, but it is now tinged with excitement, not fear.\n\nThe camera's circling grows faster.\n\n<b>                            MALAHIDE\n</b>                  Well?\n\nJULIA walks towards him, slowly raising her hands. When she is\nclose enough her hands cup his cheeks. She pulls him towards her,\nand, tipping her head to one side, kisses him. Her body moulds\nitself to his.\n\nShe leans her head back. Were they have kissed blood has pressed\nup onto the bandage from her skinned flesh. It looks like smeared\nlipstick.\n\n<b>                            JULIA\n</b>                  Well?\n\nMALAHIDE puts his arms around her waist. They kiss tenderly.\nSlowly, almost nervously, he lowers his hands until they rest on\nher buttocks and presses her in towards him. They begin to spin\nthemselves now, echoing the camera movements.\n\nThey cross the room, kissing blindly, until they come to rest\nagainst the wall that bears JULIA's bloody palm print. JULIA\ntwists their bodies so that MALAHIDE is pressed against the wall,\nand begins to move her hips forcefully and sensually against\n<b>MALAHIDE.\n</b>\nThe camera is stationary now, watching without movement as\nMALAHIDE begins to raise JULIA's dress up her legs, her hand\non his wrist, helping and encouraging.\n\nAbout halfway up the thigh, the bandaging disappears and the\nraw flesh is exposed.\n\nThe kissing and the fumbling continue until they are making\nfast and violent love against the wall.\n\nHis hands clutch tightly at her hips and he pulls his face away\nfrom the kissing to loan it on her shoulder so that we see his\nface as it grimaces in ecstasy.\n\nHe cries out and shudders and slowly both their movements stop.\n\nHe strokes at her back gently and their bodies relax.\n\n<b>                            JULIA\n</b>                     (almost coyly)\n                  Now all we need is a skin.\n\n\n<b>60   INT.   BATHROOM KYLE'S APARTMENT   DAY\n</b>\nCLOSE UP on shower jets hitting KIRSTY's face and naked\nshoulders.\n\nHer eyes are closed, but she smiles in pleasure as the water\nrefreshes her.\n\nA knocking is heard. KIRSTY moves her head out of the water's\npath and shouts.\n\n<b>                            KIRSTY\n</b>                  Yeah?\n\n\n<b>61   INT.   KYLE'S APARTMENT   DAY\n</b>\nIt is basically a studio apartment - everything except the bathroom\nfacilities is in the one room. There is a sofa - with sheets and\nblankets on it - a bed, a dining/all-purpose table with two\nchairs, shelves full of records and books, and a small working\ndesk against one of the walls. The desk is weighed down by text\nbooks and notes and, tacked to the wall above it, are medical prints,\nsome of the brain and central nervous system, but also two fullcoloured\nanatomical prints - one of a man and one of a woman. They could\nalmost be portraits of JULIA and FRANK.\n\nKYLE, fully dressed, is standing by the bathroom door, his hand\nstill in a knocking position.\n\n<b>                            KYLE\n</b>                  You O.K.?\n\nSilence.\n\n<b>                            KYLE\n</b>                  Kirsty? You 0. K.?\n\nThe bathroom door opens and KIRSTY Comes into the main room,\ndressed in a toweling robe that is clearly a 'hers' not a 'his'.\n\nShe crosses the room to a mirror, rubbing at her wet hair with a\ntowel.\n\n<b>                            KIRSTY\n</b>                  No bad dreams.\n\n<b>                            KYLE\n</b>                  So you slept O.K.?\n\nKIRSTY gestures at the sofa.\n\n<b>                            KIRSTY\n</b>                  As much as that bed of\n                  nails allowed.\n\nKYLE glances meaningfully at the bed as he replies.\n\n<b>                            KYLE\n</b>                  Well, the sofa isn't often used\n                  for sleeping on...\n\n<b>                            KIRSTY\n</b>                  Oh yeah? On your own a lot,\n                  Huh?\n\nKYLE grins.\n\n<b>                            KYLE\n</b>                  Like the robe?\n\nKIRSTY returns the smile via the mirror.\n\nKYLE crosses the room to sit at his dining table. Empty coffee\ncups, the remnants of a loaf and some cheese suggests their\nbreakfast was simple and finished some time ago.\n\nKIRSTY gathers her clothes from by the sofa and moves back into\nthe bathroom to dress.\n\nKYLE waits a few moments and then speaks.\n\n<b>                            KYLE\n</b>                  I think I need to talk. About\n                  what I saw.\n\nKIRSTY emerges, fully dressed, her hair still damp.\n\n<b>                            KIRSTY\n</b>                  You thought I was crazy, didn't\n                  you?\n\nKYLE spreads his hands wide.\n\n<b>                            KYLE\n</b>                  Jesus, yes! What do you expect.\n                  I mean, God, I still do! It's\n                  just that now I'm crazy too.\n\nHe grins wryly. KIRSTY moves to the sofa and sits down.\n\n<b>                            KIRSTY\n</b>                  And you're sure it was a woman?\n\n<b>                            KYLE\n</b>                  God, I wish I could say no.\n                  This is going to do terrible\n                  things to my attitude, you know.\n\nKIRSTY grins at him.\n\n<b>                            KIRSTY\n</b>                  Don't worry about it. Your\n                  attitude sucks anyway.\n\n<b>                            KYLE\n</b>                  Hey, so for it. Don't let pity\n                  stop you. I'm down. Nail me.\n\nFor a moment, they laugh together but then stop.  KIRSTY stares\ndownward and then suddenly bursts into tears.\n\n<b>                            KIRSTY\n</b>                  What can I do? How can I\n                  save him?\n\nKYLE joins her on the sofa. He offers an arm but she shakes it\noff.\n\n<b>                            KIRSTY\n</b>                  The box. I need the box.\n\n<b>                            KYLE\n</b>                  The box? Like in your story?\n                  Like in his house?\n\nKIRSTY's tears suddenly stop. She looks at KYLE.\n\n<b>                            KIRSTY\n</b>                           (sharply)\n                  What?\n\n<b>                            KYLE\n</b>                  The Boxes. In the House. I\n                  told you.\n\n<b>                            KIRSTY\n</b>                  What do you mean?\n\n<b>                            KYLE\n</b>                  The boxes! I TOLD you.\n\n<b>                            KIRSTY\n</b>                  You DIDN'T tell me. Do you\n                  mean Malahide's got...\n\n<b>                            KYLE\n</b>                  Yeah. The things you were\n                  talking about.\n\nKIRSTY heads instantly for KYLE'S door.\n\n<b>                            KIRSTY\n</b>                  I'm going.\n\nKYLE runs across the room and puts a restraining hand on his\ndoor.\n\n<b>                            KYLE\n</b>                  Wait a minute. What do you mean,\n                  'I'm going?' TO the HOUSE?\n\nKIRSTY nods and pulls at the door handle.\n\n<b>                            KIRSTY\n</b>                  Get out of the way.\n\n<b>                            KYLE\n</b>                  Are you crazy?\n\n<b>                            KIRSTY\n</b>                  I don't know, Kyle. You're the\n                  fucking expert. Now get out of\n                  the way!\n\n<b>                            KYLE\n</b><b>                  WHY?\n</b>\n<b>                            KIRSTY\n</b>                          (shouting)\n                  Because I'm going to get my father!\n\nTears start to her eyes and she stares at KYLE defiantly. Then\nshe repeats, more softly;\n\n<b>                            KIRSTY\n</b>                  I'm going to get my father.\n\nThere is a two-second silence between them as they stare at each\nother.\n\nFinally, Kyle backs away from the door, raising a finger.\n\n<b>                            KYLE\n</b>                  Two seconds. Just two seconds.\n                  Don't move.\n\nHe rushes across the room, grabs a jacket, and moves back to the\ndoor.\n\n<b>                            KYLE\n</b>                  O.K. Let's go.\n\n<b>                            KIRSTY\n</b>                  Kyle, you don't have...\n\n<b>                            KYLE\n</b>                  I KNOW I don't have to. It's\n                  just my time of the month to be a\n                  complete fucking idiot. O.K.?\n\nKIRSTY stares at him, her face at first blank then suffused with\nemotion. She leans across and plants a chaste kiss on his lips\nthen pulls back. There is a beat while they simply stare at each\nother and suddenly they are tight in each other's arms, kissing\nfervently. But the kiss is fuelled, not by passion, but by fear\nand their mutual need for human solace in the face of the\nunknown.\n\nAs the kiss continues, the camera pulls back from them.\n\n\n<b>62   INT.   THE BLOOD-BOUDOIR   DAY\n</b>\nCLOSE UP as JULIA (still bandaged) and MALAHIDE come together for\na kiss. They part and, as JULIA moves across the room, the camera\nbegins a long TRACK around the room.\n\nFirst, it reaches a naked GIRL. As catatonic as TIFFANY, she says\nnothing but her eyes betray her terror. Her hands are tied above\nher.\n\nJULIA moves in towards the girl, her eyes glittering with an alien\nhunger beneath their gauze mask. As she nears the girl, the TRACK\npasses them and moves through the room.\n\nMALAHIDE has done his mistress proud. It had been an empty\nupstairs room (no furniture, bare floorboards) but now it\nresembles a nightmarish cross between a butcher's shop and a\nbordello.\n\nThe camera slowly reveals, as it TRACKS, that there are seven\nmore people in the room. Seven dead people. Dried-out husks.\n\nThe TRACKING is now completing its circle around the room. After\nthe corpses, we return to JULIA and the GIRL - but the GIRL too\nis now a hollow, dried-out shell.\n\nJULIA moves back into the centre of the room and stands still.\n\nMALAHIDE crosses the room to her quickly, drawing a wicked-\nlooking kitchen knife from his pocket as he does so. He reaches\nJULIA and raises the knife to her face.\n\nWith one swift, precise movement, he slices the bandages across\nthe side of her face. JULIA raises her hand and pulls the mask\naway.\n\nThe camera sweeps in toward her as she does this until her face\nis in CLOSE UP as the bandage-mask is pulled aside.\n\nHer face is perfect.\n\n\n<b>63   EXT.   MALAHIDE'S HOUSE   DAY\n</b>\nMALAHIDE emerges from his front door. He is still in his black\nsuit and looks every inch the respectable professional. He looks\nneither left nor right but moves straight off, a busy man with\nthings to do.\n\nA few seconds after he has gone off-camera, KYLE and KIRSTY\nemerge from around the corner of the house.\n\nKYLE gestures to KIRSTY to follow him and leads her around to the\nwindow he broke in through on the previous night.\n\n\n<b>64   INT. OBSESSION ROOM   DAY\n</b>\nThe room is much as we saw it last.\n\nThe window slides up and KYLE pulls himself into the room. He\nlooks around it carefully. Sure that the monster he saw the\nprevious night is no longer in the room, he helps KIRSTY in\nthrough the window.\n\nKIRSTY's eyes go at once to the three LAMENT CONFIGURATIONS in\nthe glass cases. She crosses the room eagerly.\n\nKYLE rushes after her and stops her opening one of the cases.\n\n<b>                            KYLE\n</b>                  Wait! The .. thing ...\n                  I want to be sure it's\n                  not here.\n\nKIRSTY nods and KYLE leaves the room.\n\n\n<b>65   INT.   STAIRS/LANDING MALAHIDE'S HOUSE   DAY\n</b>\nKYLE advances carefully, and slowly, from the stairs onto the\nlanding. He looks about him at every step he takes.\n\nAhead of him on the landing is a door, which is very slightly\najar.\n\nHe advances gingerly down the landing to the door.\n\nWhen he reaches it, he pauses. We see his face working as he\nponders his choices -should he push it open inch by slow inch, or\nslam it inwards quickly?\n\nVery slowly he moves his hand towards the door. The camera\nmatches his movement, moving in on his hand, the door, and the\nspace between.\n\nHis fingertips are less than an inch from touching the door when\nanother hand shoots into view and grabs his wrist.\n\nJULIA has crept up beside him on the landing while all his\nattention was on the door.\n\nKYLE swings round in horror, his mouth opening to scream when he\nsees that JULIA has her other hand to her mouth, her finger at\nher lips in a silencing gesture.\n\nThere is of course, nothing for him to recognize from the\nmonstrous vision of the previous night. JULIA's arms, chest, and\nface are completely re-skinned now. All KYLE sees is a beautiful\nstranger in a white dress.\n\n<b>                            JULIA\n</b>                  Sssh. I think it's still here.\n\n<b>                            KYLE\n</b>                  What? The...The thing?\n\nJULIA nods.\n\n<b>                            JULIA\n</b>                  Yes. I had to stop you going in\n                  there because I knew you'd cry\n                  out. Any normal person would.\n                  It ...It's just TERRIBLE.\n\n<b>                            KYLE\n</b>                  Is it in there?\n\n<b>                            JULIA\n</b>                  No. Not now.\n\nKYLE swallows, nods, and gently, pushes the door open. He walks\ninto the room.\n\n\n<b>66   INT.   THE BLOOD-BOUDOIR   DAY\n</b>\nThe camera follows KYLE into the room. He reaches the middle\nbefore horror and disgust stop him.\n\nHe hears a click behind him and turns to see JULIA has come into\nthe room and closes the door behind her. She looks at KYLE.\n\n<b>                            JULIA\n</b>                  Was I right? Is it terrible?\n\nKYLE stares all around him. All eight victims have been sucked\ndry. He is surrounded by dead husks.\n\nHis face is ghastly. He looks like he is about to faint. He nods.\nHis voice is a cracked whisper.\n\n<b>                            KYLE\n</b>                  Yes. Yes, it's terrible.\n\nJULIA crosses the room rapidly towards him. Her face is a\npicture of concern.\n\n<b>                            JULIA\n</b>                  Oh. You look awful.  You poor\n                  boy. Come here...\n\nAs she speaks, JULIA's arms are opening out to him. KYLE sees the\ncomfort offered and advances towards her, too.\n\nAs they come together, the camera moves around them and we see,\nfor the first time, that JULIA is still incomplete; Her entire\nback is still glistening raw flesh, the naked bones of the spine\nstill clearly visible.\n\nTheir arms go around each other just as JULIA completes her\nspeech;\n\n<b>                            JULIA\n</b>                  ...Come to Mother ...\n\nAs KYLE's hands touch the sticky, mucoid meat of her shoulders,\nit is instantly clear to him what has happened. For a moment he\nfreezes in terror.\n\nHis arms fly from her and he throws his head back. But JULIA is\nvery strong now and her grip does not relax.\n\nKyle's expression is a mixture of terror and confusion as he\nstares into the beautiful face of the monster.\n\nJULIA smiles at him, a hungry, aroused smile.\n\n<b>                            JULIA\n</b>                  What's your name?\n\nKYLE can hardly speak for fear.\n\n<b>                            KYLE\n</b>                  Kyle...\n\n<b>                            JULIA\n</b>                  I'm JULIA.\n\nShe raised one hand from his back to the back of his head and\npresses his face to hers.\n\nJULIA plays it exactly as a sensual, passionate kiss, her mouth\nwide open, her head moving rhythmically and sinuously.\n\nKYLE's reaction is somewhat different; his arms flail in panic\n(though only from the elbow - JULIA'S grip prevents anything\nmore) and his head makes jerking, backward movements against her\npressing hand.\n\nThe camera moves around the embracing couple until it is behind\n<b>JULIA.\n</b>\nThe back of her gown, as we know, is extremely low. As the kiss\ncontinues, we see skin creeping above the line of the gown at the\nbase of her spine and gradually flowing up her back until finally\nit meets and blends perfectly with ragged and raw edges of the\nskin at her neck and shoulders. JULIA is complete again.\n\nWhile this process has been going on, KYLE has been dying slowly\nand horribly in her arms, his lifeforce being sucked into her\nthrough their open mouths. His body, by the time her back is\ncompletely formed, is shrunken, hollow, and dried up.\n\nJULIA takes her arms from around the corpse of KYLE and steps\nback, allowing the husk to fall to the floor.\n\nJULIA licks her lips and looks down, not without affection, at\nthe dead KYLE. She smiles.\n\n<b>                            JULIA\n</b>                  Thank you, Kyle.\n\n\n<b>67   INT.   OBSESSION ROOM   DAY\n</b>\nKIRSTY has found the black ring-binder and laid it on the\nwriting table.\n\nShe has separated one of the photographs from the others and laid\nit out on the table beside the binder. It is the ENGLISH OFFICER\nfrom the opening sequence. KIRSTY has obviously recognized something\nfamiliar in it but she can't quite grasp it completely.\n\nShe is still puzzling over it when she suddenly realises that\nseveral minutes have elapsed since KYLE left her there. Her\nhead straightens up and her puzzled look is replaced by a\nslightly worried one.\n\n<b>                            KIRSTY\n</b>                          (to herself)\n                  Kyle...?\n\nShe folds up the photograph and puts it in her pocket.\n\nShe crosses to the door and opens it. She does not go through it\nimmediately but stands in the doorway for a moment, her hand\nstill on the door, cocking her head slightly as if listening.\n\n<b>                            KIRSTY\n</b>                        (slightly louder)\n                  Kyle?\n\nShe can't hear anything, but she regards that as a bad sign, not\na good one. She leaves the room.\n\n\n<b>68   INT.   STAIRS/LANDING   DAY\n</b>\nKIRSTY makes her way up the stairs. Unlike KYLE a little earlier\nshe moves up them quite quickly and advances onto the landing.\n\nWhen she is on the landing and looking at the closed door to\nJULIA's Boudoir she stops, standing still and staring at the\ndoor.\n\nKIRSTY suppresses a shudder. She bites her lip, takes two or\nthree deep breaths, crosses to the door firmly, and flings it\nopen, moving into the room even as she does so.\n\n\n<b>69   INT.  THE BLOOD-BOUDOIR   DAY\n</b>\nKIRSTY moves three or four steps into the room and then stops\ndead. The door swings shut behind her.\n\nKIRSTY's eyes flick left and right, taking in the sickening\ndetails of the room's contents, and then stare straight ahead,\nfocusing on the figure in white which is turning around to face\nher.\n\nJULIA completes her turn and looks at KIRSTY completely\nimpassively for a moment. Then her mouth opens up into a smile of\nwelcome - but there is nothing but hate in her eyes.\n\n<b>                            JULIA\n</b>                  Kirsty! How nice of\n                  you to drop in.\n\nJULIA glances meaningfully at the dead thing that lies beside her\nfeet and then back at KIRSTY.\n\n<b>                            JULIA\n</b>                  You have surprisingly good taste in men.\n\nKIRSTY's fear and disgust are momentarily displaced by a furious\nrage as she realises what JULIA has done. Her face erupts into\nanger and she screams out.\n\n<b>                            KIRSTY\n</b>                  Kyle! No! I'll kill you,\n                  you...\n\nShe flings herself across the room at JULIA even as she speaks.\n\nJULIA is completely unphased by this attack and simply raises one\narm. She siezes the wrist of the arm that KIRSTY has raised into\na clenched fist and effortlessly throws KIRSTY bodily back across\nthe room. We realise for the first time the immense physical\nstrength that JULIA now possesses.\n\nKIRSTY smashes into the door and falls to a sitting position\nagainst it. She is shaken and slightly hurt enough not to get to\nher feet immediately but she stares at JULIA with undimmed\nhatred.\n\nJULIA throws a look halfway between a smile and a sneer.\n\n<b>                            JULIA\n</b>                  Oh, you can try it, you\n                  little bitch. I'd love you\n                  to try it. But I'm not just\n                  the woman I was.\n\n<b>                            KIRSTY\n</b>                  What, you mean you're something\n                  more than a whore with a vicious\n                  streak?\n\n<b>                            JULIA\n</b>                  I mean I'm something more than\n                  human, you little shit!\n\nJULIA snaps this first line but then holds her anger in check.\nShe shakes her head and an amused smile plays across her lips.\n\n<b>                            JULIA\n</b>                  Oh, Kirsty. They didn't tell\n                  you, did they? I'm afraid\n                  they've changed the rules of\n                  the fairy tale; I'm no longer\n                  just the wicked step-mother.\n\nThe smile disappears and she delivers the next line with an\nutterly straight face. It is, after all, the truth.\n\n<b>                            JULIA\n</b>                  Now I'm the Evil Queen.\n\nThe hatred and the heat returns to her voice.\n\n<b>                            JULIA\n</b>                  So come on; Take your best\n                  shot, Snow White.\n\nKIRSTY scrambles to her feet and again charges at JULIA.\n\nJULIA steps forward to meet her advance and delivers a single\nback-handed swipe across KIRSTY's face with such force that not\nonly is the girl knocked off her feet but is actually knocked\nunconscious.\n\nKIRSTY rolls onto her back and lies at JULIA's feet.\n\nJULIA stares down at the unconscious body. When it was awake, it\nwas KIRSTY and her attitude to it was based on personal enmity.\nNow, it is simply another body and she judges it differently; it\nis firm, full, healthy, and young. We see the expression on her\nface change from hatred and triumph to pure appetite. She licks\nher lips and her eyes glisten. She begins to bend slightly\ntowards it.\n\n<b>                            MALAHIDE\n</b>                         (off-camera)\n                  Julia!\n\nThe door to the room opens. JULIA straightens up and looks as\nMALAHIDE stands in the doorway. Her eyebrows question this\ninterruption.\n\nA second later, and it is explained. He leads TIFFANY into the\nroom.\n\n<b>                                               TIME CUT\n</b>\n\n<b>70   INT.   OBSESSION ROOM   DAY\n</b>\nTIFFANY sits cross-legged in the middle of the floor. She appears\nto be alone in the room. Cradled in her lap is a Lament\nConfiguration, taken from one of the glass cases on the low\ntable.\n\nOn a wall behind TIFFANY, one of the large prints that previously\nhung there has been taken down.\n\nRevealed in the space behind  it is a large mirror. The camera\nmoves in towards this mirror.\n\n\n<b>71   INT.   OBSESSION ROOM   ALCOVE   DAY\n</b>\nMALAHIDE and JULIA stand in a tiny and completely bare room. On the\nwall in front of them is a large window through which we see a\nback-view of TIFFANY in the obsession room.\n\n\n<b>72   INT.   OBSESSION ROOM    DAY\n</b>\nTIFFANY looks around the room generally and then turns her\nattention completely to the LAMENT CONFIGURATION.\n\nShe picks it up and turns it around in her hands, studying each\nof its faces intently.\n\nShe begins trying to move the interlinked pieces within it. At\nfirst she has no success; the box appears to be one solid\nconstruction with no internal movement possible.\n\nShe stops her attempts and studies it again for a moment, her face\nstill impassive. Then she gives a tiny smile and begins again.\nHer movements are faster now, less tentative.\n\nSuddenly, there is a click and one of the panels on-the box\nslides out slightly. The little music-box tune begins to play.\n\nTo TIFFANY this is a marvelous reward - something the jigsaw\nnever offered - and she lets out a little sound in response,\nsomewhere between a sigh and a delighted giggle. It tempts her to\neven greater skill and her delighted fingers fly over the box.\nAnother panel moves. Then two more. The tune is prettier and\nfuller.\n\n\n<b>73   INT.   OBSESSION ROOM   ALCOVE   DAY\n</b>\nMALAHIDE stares fixedly through the window, nervous but terribly\nexcited. He is breathing rapidly and shallowly.\n\nThrough the glass, TIFFANY's success continues. Small flashes of\nintense blue light begin to buzz around the box. The room grows\ndarker and cracks begin to appear in its walls.\n\nJULIA seems quietly amused - both by what is going on in the room\nand by MALAHIDE's heated response to it. She glances from one to\nthe other, her eyes twinkling.\n\n<b>                            JULIA\n</b>                  You're sure this is what you\n                  want?\n\nMALAHIDE doesn't take his eyes from the window.\n\n<b>                            MALAHIDE\n</b>                  It's what I've ALWAYS\n                  wanted. A view of ...\n                  beyond.\n\nHe pauses. Perhaps he is being ungallant. He turns slightly\ntowards JULIA and takes her hand.\n\n<b>                            MALAHIDE\n</b>                  You were almost enough, Julia\n                  but...I have to see. I have to\n<b>                  KNOW.\n</b>\nJULIA smiles indulgently. She nods.\n\n<b>                            JULIA\n</b>                  Oh, I quite understand.\n\n\n<b>74    INT.   OBSESSION ROOM     DAY\n</b>\nTIFFANY is completely engrossed in the box. She seems blissfully\nunaware of the changes taking place in the room.\n\nThe cracks have widened in the walls and, in some places, pieces\nof plaster have fallen away, revealing the slats beneath.\n\nBlue light begins to stream into the room, ignoring the geography\nof what should lie beyond its walls. Where the light comes\nthrough the slats, it is as broad beams of light, given contrast\nby the shadows of the slats. But it also comes through the\nsmaller cracks and enters the room in intensely bright and very\nthin beams that criss-cross through the room almost like a laser\ndisplay.\n\nSuddenly, TIFFANY's solution is complete. The central core of the\nbox rises up and twists itself around into its final position.\n\n\n<b>75   INT.   OBSESSION ROOM   ALCOVE   DAY\n</b>\nMALAHIDE takes an almost involuntary step backward. His\nexcitement has now reached the pitch where it is beyond obvious\nphysical manifestation. He is perfectly still, his face perfectly\nimpassive.\n\n<b>                            MALAHIDE\n</b>                  She's done it.\n\n<b>                            JULIA\n</b>                  She certainly has.\n\n<b>                            MALAHIDE\n</b>                  It's coming.\n\n<b>                            JULIA\n</b>                  It certainly is.\n\nMALAHIDE turns away to meet her eyes.\n\nThere is a beat or two where absolutely nothing happens.\n\nThe mirror explodes inwards into the alcove.\n\n\n<b>76   INT.   OBSESSION ROOM   DAY\n</b>\nThe room is filled with smoke and suffused with blue light.\n\nTwo of the walls simply part physically, revealing entrances into\nthe corridors of Hell. These corridors are lined with gray walls\nand seem to run for a great distance.\n\nTIFFANY still sits cross-legged in the middle of the floor,\nstaring about her in astonishment.\n\nSurrounding her, in various parts of the room, are the four\nCENOBITES from HELLRAISER.\n\nThe FEMALE CENOBITE smiles and advances towards TIFFANY.\n\nThe leader of the CENOBITES, PINHEAD raises a hand.\n\n<b>                            PINHEAD\n</b>                  Wait.\n\nThe FEMALE stops and looks questioningly at PINHEAD.\n\nPINHEAD, at a more leisurely pace, crosses towards TIFFANY and\nlooks down at her. She stares back at him, the remnants of her\ninsanity a temporary defense against fear, her face registering\nnothing.\n\nPINHEAD looks up.\n\n<b>                            PINHEAD\n</b>                  No.\n\nThe FEMALE looks across at him.\n\n<b>                            CENOBITE\n</b>                  No?\n\nPINHEAD shakes his head.\n\n<b>                            PINHEAD\n</b>                  No.\n\nHe glances down at TIFFANY again.\n\n<b>                            PINHEAD\n</b>                  It is not HANDS that call us...\n\nHe looks up and stares directly at the shattered two-way mirror.\n\n<b>                            PINHEAD\n</b>                  ... It is DESIRE.\n\n\n<b>77   INT.   OBSESSION ROOM   ALCOVE   DAY\n</b>\nThe wall opposite the shattered mirror has also opened up to\nreveal a way into Hell.\n\nMALAHIDE and JULIA are no longer in the alcove.\n\nWe hear the ringing of their footsteps. They are making their way\ndown the corridor.\n\n\n<b>78   INT.   OBSESSION ROOM   DAY\n</b>\nThe four CENOBITES have gone.\n\nTIFFANY looks around the room again. She stares from one entrance\nto the other. Her manner is reminiscent of when she is making\ndecisions during her solving of puzzles.\n\n\n<b>79   INT.   BLOOD-BOUDOIR   DAY\n</b>\nKIRSTY is still on the floor in the boudoir of blood. This room\ntoo is now suffused with blue light and smoke. There are no\ngateways to Hell in the walls but there are several cracks in the\nplaster and these appear to be spreading.\n\nKIRSTY moans and opens her eyes gingerly. She puts a hand to her\nface, rubbing at the place where JULIA hit her.\n\nStill a little groggy, she lifts herself slowly to a sitting\nposition, her legs stretched out. Only when she has blinked a few\ntimes, shaken her head, and rubbed her jaw again, does full\nconsciousness return - at which point she looks quickly about the\nroom ( possibly expecting another attack from JULIA) and notices\nthe light and the smoke.\n\nShe has been in this atmosphere before. She knows precisely what\nit means. Her mouth opens and her eyes grow nervous again.\n\n<b>                            KIRSTY\n</b>                  Oh, shit.\n\nKIRSTY scrambles quickly to her feet and rushes through the door\nto the stairs.\n\n\n<b>80   INT.   OBSESSION ROOM    DAY\n</b>\nKIRSTY enters the room just as TIFFANY is about to go down one of\nthe corridors. KIRSTY screams at her.\n\n<b>                            KIRSTY\n</b><b>                  NO!\n</b>\nTIFFANY stops, startled, and looks at the doorway and KIRSTY.\n\nKIRSTY raises her hands in a placatory gesture and speaks more\nsoftly.\n\n<b>                            KIRSTY\n</b>                  Wait. Wait.\n\nKIRSTY begins to move into the room slowly and shakes her head\ngently.\n\n<b>                            KIRSTY\n</b>                  Hey, remember me? From the\n                  hospital? I was in the next room?\n\nKIRSTY is rewarded with a small recognizing smile from TIFFANY,\nKIRSTY returns the smile.\n\n<b>                            KIRSTY\n</b>                  You don't want to go down\n                  there. You REALLY don't\n                  want to go down there.\n\nTIFFANY turns her head once more to look down the corridor and\nthen turns back to KIRSTY. For a second it looks as if KIRSTY's\npersuasions have succeeded, but MALAHIDE's training has been too\nthorough; TIFFANY knows a puzzle when she sees one. She smiles\nonce more at KIRSTY and then suddenly turns and disappears into\nthe corridor.\n\nKIRSTY stands still for a moment, as if she can't quite believe\nthat TIFFANY has done it. She shakes her head - half in disbelief\nand half in despair.\n\n<b>                            KIRSTY\n</b>                  Jesus Christ.\n\nPausing only to pick up the LAMENT CONFIGURATION from  where\nTIFFANY has left it on  the floor, She heads straight for the\ncorridor and follows TIFFANY in.\n\n\n<b>81   INT.   CORRIDORS/LABYRINTH\n</b>\nWe are looking straight down one of the very long corridors of\nHell.\n\nIt has the same architecture as the corridor that appeared in the\nhospital room in HELLRAISER; walls of stained gray stone broken\nup by vaguely medieval-looking arches.\n\nKIRSTY comes into view, walking away from the camera. Ahead of\nher, at an illogically far distance given that she entered the\ncorridor only seconds before KIRSTY, is TIFFANY.\n\nKIRSTY breaks into a slight run, and calls out to the girl.\n\n<b>                            KIRSTY\n</b>                  Tiffany. Wait!\n\nHer voice has an unpleasant ring in the acoustics of these\ncorridors and echos horribly. KIRSTY pulls a face and doesn't\nshout again. She increases her pace slightly.\n\nSuddenly TIFFANY makes a sharp turn and enters an intersecting\ncorridor. KIRSTY is forced to increase her speed even more.\n\nKIRSTY too makes the turn into another corridor. Even as she does\nso, she sees TIFFANY disappearing again into yet another\nintersection.\n\nKIRSTY follows and, again, the same thing happens.\n\nThis happens several times and, always, KIRSTY never quite loses\nsight of TIFFANY but never quite catches up with her either.\n\nIn short, TIFFANY's instincts were absolutely right; this too is\nanother puzzle. The girls are lost in a concrete maze, full of\ntwists and turns and labyrinthine windings.\n\nAfter enough turns have been made to completely confuse KIRSTY's\nsense of direction, she makes a final turn into one corridor and\nsees something different.\n\nAt the end of this corridor is a blinding white light. As soon as\nKIRSTY sees the light, the air is filled with beautiful\nbirdsong.\n\nTIFFANY disappears into the light as soon as KIRSTY sees it.\nDespite the light, despite the birdsong, KIRSTY is still\nsuspicious and shouts out.\n\n<b>                            KIRSTY\n</b>                  Tiffany! Don't trust it! Don't\n                  Trust it!\n\nBut it is too late. The girl is gone. KIRSTY follows-and vanishes\ninto the light.\n\n\n<b>82    INT.   CORRIDORS/LABYRINTH\n</b>\nJULIA and MALAHIDE are seen in the corridors of the labyrinth.\n\nMALAHIDE's face is full of delight. He is absolutely the\nenchanted visitor.\n\nJULIA, on the other hand, walks with the brisk assurance of one\non familiar territory.\n\nThe corridors that MALAHIDE sees are different to KIRSTY'S; they\nare grotto-like, dotted with stalactites and stalagmites and not\nimmediately unattractive. The walls contain portals of a glass-\nlike substance at random intervals that emit blooming lights of\ndifferent colors and MALAHIDE peers eagerly into several of these.\n\nIn one, the view is like an aquarium. An alien fish swims past his\neyes. Its body resembles a human brain but it has pincer-like claws.\nMALAHIDE presses his hand against the glass as the thing comes nearer.\nSuddenly, from within its body, the thing produces a perfect\nhuman forearm and hand and meets MALAHIDE's hand on the other\nside of the glass.\n\nMALAHIDE starts slightly but then keeps his hand there. He is\nturning his head to call JULIA's attention to this marvel when\nthe thing suddenly forms a fist and begins to beat against the\nglass with tremendous force.\n\nMALAHIDE jumps back sharply, but the thing shatters the glass and\nleaps out at him. He gasps and runs up the corridor, the thing\nhopping after him on its one hand.\n\nAs they pass JULIA, she tuts with the slightly exasperated but\nindulgent tone of a parent or a teacher. She steps on the thing,\nsquashing it flat. It emits a horrible death-cry.\n\n<b>                            JULIA\n</b>                  Do be careful.\n\n\n<b>83   INT.   HELL'S SITTING ROOM   DAY\n</b>\nWhite light fills the screen and KIRSTY steps through it into\nview. Instantly the White light contracts and disappears.\n\nKIRSTY finds herself standing in a beautiful family sitting room.\n\nThe room is bathed in the warm light of a perfect summer's day.\nThe birdsong KIRSTY heard earlier continues but is, if anything,\neven more melodic, even more sweet.\n\nThe room is vaguely Edwardian in its decor; real wood furnishings\nand decorative porcelain ornaments. There is a large wooden\ndresser, on top of which are many photographs in old-fashioned\nbrass frames.\n\nDespite herself, KIRSTY cannot resist a smile of pure pleasure at\nthe appearance of the room.\n\nShe touches some of the furniture, as if to assure herself it is\nreal.\n\nShe approaches the dresser and picks up one of the large framed\nphotographs. She gasps in pleasure.\n\nWe see the photograph. It is a family group and looks to be have\nbeen taken ten to twenty years ago. It is of a man, a woman, and\na young girl of four or five.\n\nThe man is clearly LARRY, albeit a younger version, and the\nlittle girl has dark, thick, slightly curly hair - just like\nKIRSTY'S. The woman is beautiful and has similar hair to her\ndaughter.\n\nKIRSTY's eyes prick with tears - but they are clearly tears of\nhappy memories. She smiles.\n\n<b>                            KIRSTY\n</b>                  Mommy...\n\nKIRSTY puts down the photograph of her family and looks around\nthe room again. A troubled look crosses her face.\n\nDespite the aparent Summer light in the room, KIRSTY suddenly\nrealises what it is that is odd.\n\nShe looks from wall to wall with mounting distress on her face.\nThere are no windows in the room. And no door.\n\nAt this point, the odd discordant note in the birdsong becomes\napparent. It is nothing too obvious at the moment - the total\neffect is simply less sweet than it was.\n\nKIRSTY looks back at the photograph and snatches it up, with a\nlook of concern.\n\nThe photograph has changed. It is now a wedding photo. The\nwedding of LARRY and JULIA.\n\nSuddenly the photograph begins to bleed. Blood pours from the\npaper itself, pressing up and smearing against the glass-so that\nit is momentarily framed blood, without a single trace of the\npicture showing.  The blood begins to escape out of the frame,\ntrickling over the lip that holds the glass in place and dripping\nonto KIRSTY's fingers.\n\nWith a cry of horror, KIRSTY drops the frame. It lands on the\nfloor and the glass shatters. The blood continues to flow. In\nfact, now that the glass does not restrain it, it fairly\nfountains out, spreading across the floor.\n\nKIRSTY steps back and glances at the dresser. Blood is flowing\nfrom every frame, pooling on the dresser and overflowing onto the\nfloor.\n\nBy now, the discordant elements in the birdsong are very much\npredominant and, as KIRSTY sweeps all the frames off the dresser\nand onto the floor with a scream of anguish, the birdsong gives\nway completely to a hideous, dissonant shrieking.\n\nKIRSTY throws her hands to her ears.\n\n<b>                            KIRSTY\n</b>                  Nooooo!\n\nShe rushes at one of the walls and begins beating it with her\nfists.\n\nThe walls are soft and pulpy and give slightly as her fists\nstrike, like flabby flesh. KIRSTY stands back in disgust.\n\nThe wall visibly bruises before her eyes, swelling and purpling.\n\nThe light in the room, like the birdsong, has changed utterly. It\nis not dark, but simply dull, featureless, and depressing.\n\nKIRSTY turns away in disgust and finds that the whole room has\ngiven in to decay. The sofas and chairs are mildewed and rotten,\nthe wooden furniture is ridden with woodworm and rot. A skinned rat\nruns across the room beside the buckled and chipped skirting board.\n\nA rotten leg gives way under a small chest and the bottom drawer\nspills out, freeing a whole family of quite large spiders which\nrun wildly across the floor.\n\nSuddenly the room begins to fill with smoke, churned up by an\never-increasing intensity of wind. The smoke obscures the screen.\n\n\n<b>84   INT.   BARE CHAMBER   HELL\n</b>\nThe smoke and wind subside but not entirely.\n\nKIRSTY is standing in exactly the same position in a room of\nexactly the same proportions, but which is completely empty and\nwhich has walls of the same gray stone that the corridors do.\n\nSuddenly, rising up from behind KIRSTY, comes PINHEAD.\n\n<b>                               PINHEAD\n</b>                  Ah, Kirsty. And we thought\n                  we'd lost you.\n\nKIRSTY swings round in terror. As the mist continues to clear,\nshe sees, advancing to join PINHEAD, the FEMALE CENOBITE and the\nCHATTERER. Beyond them, it is now revealed, that this chamber has\nno fourth wall; it gives directly onto the corridors\n\n<b>                               FEMALE CENOBITE\n</b>                  So sweet of you to come back.\n\nKIRSTY begins to work furiously at the BOX she has brought from\nMALAHIDE's house. It sent them away at the end of HELLRAISER.\nShe obviously hopes it will work again.\n\nPINHEAD raises a hand and the box simply flies out of KIRSTY's\nhands and hovers in the air between them. KIRSTY stares, open-\nmouthed.\n\n<b>                            PINHEAD\n</b>                  How can it send us back, child?\n                  We're already here. And so are you.\n\nSuddenly PINHEAD works at the box himself - by remote control and\nwith dazzling skill.\n\nHe turns the box rapidly through positions KIRSTY and we have\nnever seen before - even opening it out at one stage into  a\nlarge, two-dimensional square. Finally, it closes itself down -\nbut in a wholly new shape; a white, multi-faceted, diamond shape\n- and drops back into KIRSTY's hands.\n\nHe stares at KIRSTY and makes a small gesture with his brow. It\nis ALMOST cute. If anything, it resembles the cocky, aren't-I-\nclever look STEVE gave KIRSTY after swallowing the cigarette in\nHELLRAISER. Then his face assumes its normal deadly blankness.\n\nKIRSTY shakes her head dumbly and begins to back into a corner,\nhoping that if they converge on her, she might just be able to\nslip around them and get back to the labyrinth.\n\n<b>                            KIRSTY\n</b>                  No! You... You can't! It wasn't\n                  me...I didn't do it! I didn't\n                  open the box!\n\n<b>                            FEMALE CENOBITE\n</b>                  Didn't open the box. And what was it\n                  last time? Didn't know what the box\n                  was. And yet we DO keep finding each\n                  other, don't we?\n\n<b>                            PINHEAD\n</b>                  Oh, Kirsty; so eager to play, so\n                  reluctant to admit it.\n\n<b>                            FEMALE CENOBITE\n</b>                  Perhaps you're teasing us. Are\n                  you teasing us?\n\nTo some extent, KIRSTY's ploy is working. The CENOBITES are\nmoving closer together as they advance to the corner in which she\nstands.\n\n<b>                            KIRSTY\n</b>                  But I didn't open it! I didn't!\n\n<b>                            PINHEAD\n</b>                  Then why are you here?\n\n<b>                            KIRSTY\n</b>                  I've come for my father!\n\nKIRSTY shouts this with brave defiance. PINHEAD laughs in\nresponse, a very unattractive sound.\n\n<b>                            PINHEAD\n</b>                  But he's in his own Hell, child\n                  And quite unreachable.\n\nSuddenly KIRSTY makes her break shouting out as she does so.\n\n<b>                            KIRSTY\n</b>                  I don't believe you!\n\nIt seems for a moment she has succeeded. She swings around the\nside of the CENOBITES and begins to run across the chamber.\nThe CENOBITES do not move but suddenly, from nowhere a hook flies\nacross the room, attached to a metal chain. The hook buries\nitself in the wall only inches in front of KIRSTY's face, the\nchain pulled tight and barring her path. The wall begins to\nbleed.\n\nKIRSTY screams.\n\nThe CENOBITES turn to face her, but make no attempt to cross the\nroom to her new position.\n\n<b>                            PINHEAD\n</b>                  But it's true, He is his own Hell.\n                  Just as you are in yours.\n\n<b>                            KIRSTY\n</b>                  And what about you?\n\nPINHEAD almost smiles at the naivete of the question.\n\n<b>                            PINHEAD\n</b>                  It's different for us.\n\n<b>                            FEMALE CENOBITE\n</b>                  We've always been here.\n\n<b>                            PINHEAD\n</b>                  We have no more surprises.\n\nSuddenly, as quickly as it came, the hook withdraws from the wall\nand flies back into nothingness.\n\nPINHEAD puts out his hand in an expansive gesture.\n\n<b>                            PINHEAD\n</b>                  But, please; feel free.\n                  Explore. We'll always\n                  be here...\n\n\n<b>85   INT.   CORRIDOR\n</b>\nKIRSTY can't quite believe this but she has no intention of\nquestioning it. She runs into the corridor and away, with\nPINHEAD's last words echoing after her.\n\n<b>                            PINHEAD\n</b>                  ... we have Eternity to\n                  know your flesh!\n\nDelighted CENOBITE laughter follows her back into the labyrinth.\n\nKIRSTY drops the transformed BOX into her pocket as she\nbegins running through the corridors again. The labyrinth\nseems tighter now - the corridors shorter, the turns sharper.\nCorner after corner we see KIRSTY turn.\n\nAccompanying this tightening, the light in the corridors becomes\ngradually murkier - not quite dark, more like the oppressive\ncolourlessness that descends before a thunderstorm breaks.\n\nOccasionally there are little hissing noises from the walls\nthemselves, which are accompanied by small jets of dull and heavy\nsmoke escaping between the bricks.\n\nOver all this, there grows in volume on the soundtrack a\nrhythmic, labored, resonant sound - a sound somewhere between\nbreathing and machinery.\n\nSuddenly, as KIRSTY turns one more corner, a hand reaches out to\ntouch her.\n\nKIRSTY throws herself back against the far wall of the corridor,\nunsure whether to fight or flee. Then her face relaxes. It is\n<b>TIFFANY.\n</b>\n\n<b>86   INT.   CORRIDORS/LABYRINTH\n</b>\nIn another corridor within the labyrinth, MALAHIDE and JULIA are\nwalking.\n\nThey too have found their way into the inner sections. They too\nare in tighter, sharper corridors where the light is distressing.\nThey too hear the machine-like breathing noise. And what is\nrevealed behind the portals in the corridor walls is less\nambiguous in its unpleasantness; in one we see CHATTERER in some\nHell's equivalent of a beauty salon. He is being re-made. This\ninvolves the scar tissue being manually peeled from the upper\npart of his face to reveal beneath small, vicious, human eyes.\n\nMALAHIDE's attitude has begun to change, as well. His nervousness\nnow clearly outweighs his delight. He' rushes on to the next\nportal.\n\nIf the last room was a beauty salon, this is the orgy room. But\nthe orgy is very strange. It is a very dark room, filled with a\nfaint layer of smoke. In the background, a bound man is having\nhis chest licked by a kneeling woman. She pulls her face back for\na moment. Her tongue is horrifically long and studded with short,\nsharp blades. The man's chest is stripped of skin where she has\nbeen attending him. His face is a picture of ecstasy.\n\nIn the foreground, three people are buried up to their waists in\nthe floor. They are naked. The one in the middle is a woman, the\nother two, men. The one in front of her faces her, the one behind\nhas his back to her back. They are all very, close. The men have\nvarious hooks in their chests, connected by chains to the unseen\nwalls and their faces are impassive. The woman is unwounded and\nher head flicks back and forth, as if in the grip of a sexual\nclimax of stunning ferocity. The movements of her head keep the\ndetails of her features blurred until, finally, it turns to give\nMALAHIDE a three-quarter profile and holds its position, its\nmouth open, its eyes half-closed in pleasure. It is JULIA's face.\n\n\nMALAHIDE gasps and pulls back from the portal. The camera TRACKS\nback to reveal that JULIA is still in the corridor, just a few\nyards in front of him\n\n<b>                            JULIA\n</b>                  Come. I have such sights to show you.\n\nMALAHIDE shakes his head crazily from side to side and begins to\nback away.\n\nJULIA looks at him and walks toward him slowly. She smiles. She\nstrokes his cheek. She moves closer, gently slipping her arms around\nhim and molding her body to his. She extends her tongue and licks\nlightly at his lower lip. He opens his mouth and returns the\nkiss, pressing her body more firmly to him. The kiss becomes\nquite passionate.\n\n\n<b>87   INT.   CORRIDORS/LABYRINTH\n</b>\nKIRSTY and TIFFANY are now walking together.\n\nKIRSTY is talking to her as calmly as her sense of urgency will\nallow.\n\n<b>                            KIRSTY\n</b>                  Do you see? You were RIGHT.\n                  This IS a puzzle, too. But\n                  WE'RE CAUGHT in the puzzle.\n\nKIRSTY stops walking and catches hold of TIFFANY's arm. TIFFANY\nstops, looks at the hand holding her arm, and then looks into\nKIRSTY's eyes.\n\n<b>                            KIRSTY\n</b>                  Yeah?\n\nTIFFANY smiles directly at KIRSTY and then returns her nod.\n\n<b>                            KIRSTY\n</b>                  Yeah?\n\nTIFFANY nods again, more emphatically.\n\n<b>                            KIRSTY\n</b>                  Yeah!\n\nKIRSTY throws her arms around TIFFANY and hugs her.\n\n\n<b>88   INT.   CORRIDORS/LABYRINTH\n</b>\nJULIA is leading MALAHIDE down a corridor which has intersections\nevery few yards on both of its sides.\n\nJULIA walks past these shadowed entrances without pause, without\na single sidelong glance. She is clearly confident, clearly back\non her own turf.\n\nMALAHIDE, on the other hand, glances nervously into every one\nbefore moving on.\n\nThere is also one last portal he looks into. He is gazing into\na room where the floor is a vast, seething pool of maggots.\nSuddenly, something breaks the surface. It would doubtless scream\nwere its mouth not full of maggots. It is BROWNING. His nightmare\nhas come true; his skin is producing the maggots in a constant,\nspewing flow from numerous sores that pack his face.\n\nMALAHIDE turns away and calls to JULIA.\n\n<b>                            MALAHIDE\n</b>                  Enough. God, that's enough. We\n                  HAVE to go back.\n\nJULIA smiles at him.\n\n<b>                            JULIA\n</b>                  Go back? What an earth makes\n                  you think we can go back?\n\nMALAHIDE's jaw drops.\n\n<b>                            MALAHIDE\n</b>                  I want to go back!\n\n<b>                            JULIA\n</b>                  Sorry, friend. No day trips to\n                  Hell. Here you are. Here you\n                  stay. And forward the only way\n                  to go.\n\nJULIA turns back and walks an down the corridor.\n\nMALAHIDE, with a glance back at the maggot pool, turns after the\nnow departing JULIA.\n\n\n<b>89   INT.   CORRIDORS/LABYRINTH\n</b>\nKIRSTY and TIFFANY are walking warily along a corridor when,\nsuddenly, the corridor wall parts with a roar. Both girls jump,\nand TIFFANY cries out.\n\nA new, and very narrow corridor has been revealed. The GIRLS\nstare down it. It culminates in a door. Despite being set in a\nblank gray stone wall, the door is normal. But frightening -\nbecause it is an exact replica of the front door of 55 LODOVICO\nSTREET, LARRY's house.\n\nBefore KIRSTY can react to this, a voice issues from beyond the\ndoor.\n\n<b>                            VOICE\n</b>                  Kirsty!\n\nKIRSTY stops dead in her tracks. She looks at the door and\nmoves toward it, walking slowly down the corridor. TIFFANY\nfollows.\n\n<b>                            KIRSTY\n</b>                      (Very Tentatively)\n                  Daddy...?\n\n Only a low moan comes from behind the door.\n\n<b>                            KIRSTY\n</b>                  Tiffany. Wait here. If I'm\n                  not back real soon - get\n                  out. Get home.\n\nLeaving TIFFANY in the corridor, KIRSTY opens the door and steps\nin.\n\n\n<b>90    INT.   THE BROTHERS' ROOM\n</b>\nThe door that KIRSTY opens gives directly on to a room.\n\nLike the SITTING ROOM earlier this appears to be an ordinary room\nand not a stone wall chamber.\n\nIt's wall-papered walls were once white but are now yellowed and\nold. Overhead there is an equally ancient four bladed wooden fan\nthat turns sluggishly.\n\nIn the middle of the floor is a small low table of vaguely\nEastern design.\n\nOn this table lie a hand of cards, face down, an empty and cloudy\ntumbler, and a soiled ashtray.\n\nOver by the far wall (the wall opposite to that containing the\ndoor) there is a mattress on the floor. A body like shape on this\nmattress is obscured by a heavy blanket that covers it.\n\nTo the side of the mattress a latticed wooden screen stands,\nhiding whatever is behind it from those entering the room. If the\natmosphere of the room reminds us of anything it is of the seedy\nbazaar where FRANK first bought the LAMENT CONFIGURATION.\n\nWe are looking at the door as it opens inwards and KIRSTY slowly\nand nervously walks into the room.\n\nKIRSTY advances into the room. She stares at the mattress ahead\nof her. Above it written in blood on the wall, is the message she\nsaw in her vision. I AM IN HELL:HELP ME.\n\n<b>                            KIRSTY\n</b>                  daddy...\n\nA low moan comes from the far end of the room. KIRSTY assumes it\nissues from the figure hidden beneath the blanket and walks\nnearer, lifting her arm in readiness to remove the blanket.\n\n<b>                            KIRSTY\n</b>                  Daddy. It's Kirsty...\n\nThere is no response. KIRSTY arrives at the mattress and pulls\nthe blanket back. She leaps backwards, her hand at her mouth\nstifling a scream.\n\nLying on the bed is a husk like figure, vaguely female in shape.\nDespite its appearance of long decay, it is dressed in vaguely\nsexual garments of leather. Suddenly, the eyes pop open,\nrevealing a vague remnant of life.\n\n<b>                            KIRSTY\n</b>                  Oh God.\n\nKIRSTY hurriedly, throws the blanket back over it.\n\nA voice issues into the room. It sounds like LARRY but, as we\nshall see, it is not.\n\n<b>                            VOICE\n</b>                  No. Over here. Behind the\n                  screen.\n\nKIRSTY walks carefully around the screen, giving it a wide berth\nin case of a trick.\n\nThere is a figure standing against the wall behind the screen. It\nis deeply shadowed by the screen itself but is clearly male.\n\nKIRSTY gulps back a sob and her eyes fill with tears.\n\n<b>                            KIRSTY\n</b>                  Daddy... ?\n\nThe figure leans slowly into the light, speaking as he does\nso.\n\n<b>                            FRANK\n</b>                  That's it, baby. Come to\n                  Daddy.\n\nKIRSTY stands still. There is a second where her face registers\nnothing. Then she screams.\n\n<b>                            KIRSTY\n</b><b>                  NO!\n</b>\nit is her UNCLE FRANK, back in his skin and dressed in white\nshirt and jeans.\n\nFRANK chuckles. KIRSTY backs away from him into the room. FRANK\nputs out his right hand in a placatory gesture. KIRSTY realises\nhe is not moving after her. She also sees that his body is\ncuriously angled, the left side still in the deep shadow cast by\nthe screen. Is there something else there? Something she can't\nquite see? FRANK's voice stops her wondering.\n\n<b>                            FRANK\n</b>                  What's the matter, Kirsty?\n                  It's only Frank. It's only\n                  Uncle Frank.\n\nKIRSTY's anger at being tricked wins over her fear and distress\nand she shouts at FRANK in fury.\n\n<b>                            KIRSTY\n</b>                  I should have known! I should've\n                  known he wouldn't be here! This\n                  place is only for filth like you!\n\nFRANK sneers.\n\n<b>                            FRANK\n</b>                  Oh, right. Daddy's died and gone\n                  to heaven, eh?\n\n<b>                            KIRSTY\n</b>                  Yes!\n\n<b>                            FRANK\n</b>                  Shit. Bull. Shit\n\nFRANK pauses and smiles. Then he begins to move more fully into\nthe room, shifting his weight as he does so and dragging what was\nhidden into the light. KIRSTY screams again.\n\nFRANK's white shirt is cut off at the left shoulder. His arm is\nbare and, from the elbow down to the wrist, joined to another\nforearm. The flesh is completely fused, like that of siamese\ntwins. As FRANK moves into the room, the owner of the other arm\nis revealed. It is his brother, LARRY. KIRSTY's father.\n\nLARRY, like his brother, is dressed in a white shirt (cut off at\none shoulder) and jeans and, like his brother, has his skin back.\nHis face is frozen into a permanent expression of terror and he\nseems incapable of any independent movement, simply being pulled\nalong by FRANK.\n\nKIRSTY steps back in horror.\n\n<b>                            FRANK\n</b>                  See? He's here. You should learn\n                  to believe your Uncle Frank.\n\n<b>                            KIRSTY\n</b>                  No! He SHOULDN'T be here! It\n                  SHOULD'VE been a trick!\n\n<b>                            FRANK\n</b>                  'Fraid not, baby. He belongs here.\n                  With me. We're the same. Brothers.\n                  Equal and opposite. Pure appetite.\n                  Pure banality. Too much feeling.\n                  None at all.\n\nKIRSTY's fear of FRANK is now outweighed by her contempt for his\nargument.\n\n<b>                            KIRSTY\n</b>                  You're full of shit, Frank Cotton.\n                  My Dad wasn't like that at all.\n                  He could feel. He could love. He\n                  loved ME.\n\nKIRSTY's voice breaks.\n\n<b>                            KIRSTY\n</b>                  He...he loved me.\n\n<b>                            FRANK\n</b>                  Don't waste your tears. Look\n                  at him!\n\nHer hatred for FRANK gives KIRSTY her strength back.\n\n<b>                            KIRSTY\n</b>                  He loved me, you bastard! He\n                  Loved me, he loved my mother.\n                  He even loved that bitch you\n                  betrayed him with!\n\nFRANK begins to move towards KIRSTY again, LARRY dragging behind\nhim.\n\n<b>                            FRANK\n</b>                  Ah, Julia. She hasn't been to\n                  see me recently. That's why\n                  it's so nice to have you\n                  here, baby. Daddy's little girl.\n                  So pretty when she's upset. Come\n                  to Daddy,\n\nFRANK is very close to her, now. KIRSTY attempts to run across\nthe room. FRANK siezes her arm and throws her back against the\nwall. He moves in close and presses against her. His voice is\nmidway between arousal and anger.\n\n<b>                            FRANK\n</b>                  Now don't be naughty, Kirsty. Or\n                  I'll have to punish you first.\n                  Perhaps you'd like that. Would\n                  you like that?\n\nKIRSTY screams and stares pleadingly, at the still frozen LARRY.\n\n<b>                            KIRSTY\n</b>                  Daddy! Daddy! I love you! Help me!\n\n<b>                            FRANK\n</b>                  I'm your Daddy now, Kirsty.\n\nFRANK leans in to kiss the terrified KIRSTY.\n\nSuddenly, a hand appears at FRANK's throat and hurls him off\nKIRSTY. It is LARRY, roused by his daughter's cries.\n\n<b>                            LARRY\n</b>                  Get your fucking hands off\n                  my daughter, you bastard!\n\nSuddenly, the room, previously full of slow movements and\ntension, is full of furious, violent action as the fused brothers\nkick, tear, and punch at each other in a paroxysm of killing\nhatred.\n\n\n<b>91   INT.   THE CENTRE OF HELL\n</b>\nMALAHIDE and JULIA are at the end of a corridor. They turn into\nan open space. A vast open space. It is desert-like in its\nexpanse, almost vanishing into infinity at its furthest reaches.\nIt is criss-crossed by catwalks, on one of which MALAHIDE and\nJULIA now stand. Beside these catwalks, the ground falls away\ninto mile-deep, dark, abysses.\n\nAbove the catwalks, dominating the huge space, is the master of\nthe labyrinth.\n\nThe master, LEVIATHAN, is a monumentally huge, white, multi-\nfaceted diamond, spinning on its own axis, entirely unsupported\nby any physical means, above its territory.\n\nApart from its very immensity, the most unsettling thing about\nLEVIATHAN are the beams of black light that shine out from the\ncorners of all its many facets. Due to the fast spinning, these\nbeams shoot and swoop around the chamber, like a negative laser\ndisplay of dazzling complexity.\n\nThe sound that has been in the corridors is now magnified. It is\nthe sound of LEVIATHAN's breath.\n\nMALAHIDE has walked the last few yards like a man in shock. Now\na black beam strikes his face and images of horror flash before\nhis eyes at almost subliminal speed. His face suddenly crumbles\ninto an expression of incredulous terror, he makes a noise\nhalfway between screaming and retching, and drops to his knees by\nthe edge of the catwalk.\n\nUnfortunately, this allows him to look down into LEVIATHAN's pit.\nLooking down with him, we are given a sudden and vertiginously\nsickening realization of Hell's immensities. There is a drop of\nmiles visible down the pit and, all the way down, as far as the\neye can see, there are other catwalks cutting across the pit at\nvarious angles.\n\nMALAHIDE looks back up, his scream renewed by his sight of the\npit. Two or three of the beams of black light flit across his\nface, filling his eyes with more subliminal images of horror as they\npass; a child, a knife, and a dead animal; a naked woman whose\nprivate parts are made of sharp, oily, metal; perfect hands\nending in crumbling, leprous fingers.\n\nSuddenly, LEVIATHAN stops spinning. Effortlessly. Instantly. Two\nmore beams are projected at MALAHIDE but, as they come within a\nfew yards of him, they become writhing pink limbs that fly out,\nsieze MALAHIDE and lift him into the air. He screams out.\n\n<b>                            MALAHIDE\n</b>                  No! No! Julia! Help me!\n\nMALAHIDE is held in the air as JULIA replies.\n\n<b>                            JULIA\n</b>                  But you WANTED this. You wanted\n                  to SEE. You wanted to KNOW. And\n                  here it is. The heart of Hell.\n                  Leviathan.\n\nAs she says this two of the thing's facets part to reveal a raw\nand gaping cavity lined with angry, sore-looking purple flesh\ndirectly behind the dangling MALAHIDE.\n\nThe purple and pink walls of this flesh gash peel apart and open\nin various places to reveal blades, hooks and needles at the end\nof various vestigial limbs.\n\nThe limbs holding MALAHIDE draw him back inexorably into this\ncavity.\n\nHe has one last moment to meet JULIA's eyes.\n\n<b>                               JULIA\n</b>                  Why do you think I was allowed\n                  to go back? For YOU? No, it\n                  wanted souls. And I brought you.\n                  And you wanted to KNOW. Now you're\n                  both happy.\n\nMALAHIDE is now held within the walls of the gash. He opens his\nmouth for one final scream but one of the tiny needle-topped\nlimbs flies at his mouth and sews his lips together with heavy\nblue wire before he can utter it.\n\nHis eyes widen in both agony and horror.\n\nJULIA smiles.\n\n<b>                            JULIA\n</b>                  Goodbye, Doctor. It's been real.\n\nThe gash heals itself, closing MALAHIDE within.\n\nDespite the gash having closed over MALAHIDE, the leathery flesh\nthat covers that area is a mass of movement, ripples and bumps.\nSmall rips and gashes appear and disappear on its surface, allowing\nus occasional and partial glimpses of MALAHIDE and what is\nhappening to him.\n\nAt one stage MALAHIDE's hand and forearm appear. A long deep,\nrunning cut has been made down the arm and the flesh peeled and\nfolded back, revealing the meat and the muscle beneath. As we\nwatch, two of the tiny operating limbs sew the flaps of flesh,\nstill folded back, to the rest of the arm, leaving the wound open\nand un-healable.\n\nAnother gash opens and MALAHIDE's face is visible. Here too the\nneedles are at work, diving into and out of his flesh in a\ncomplicated sewing pattern that is finally pulled together\nbeneath one ear, leaving MALAHIDE's features permanently pulled\nout of shape and decorated with running stitches of metal wire.\n\nAgain, MALAHIDE's torso appears, naked. Two large triangular\nblades make deep parallel slashes down his chest. Two different\nlimbs appear but these have sucker-like tips rather than metallic\nones. They fasten onto the new cuts, as if battening. Instead\nthey are injecting - as becomes apparent when MALAHIDE's skin\nturns blue.\n\nThe blueness, the conscious disfigurement, and the almost\ndecorative open wounds should serve to convey that what is\nhappening to MALAHIDE is not simply torture; he is being\ntransformed into a CENOBITE.\n\nJULIA watches with avid interest.\n\n\n<b>92   INT.   BROTHERS' ROOM\n</b>\nLARRY and FRANK are fighting furiously, tumbling around the\nroom. LARRY is fuelled by righteous anger and revenge but FRANK\nhas had more experience of dirty fighting.\n\nAt one stage their free hands each have hold of the other man by\nthe throat and are rolling along one of the walls, each trying to\nestablish the dominant grip.\n\nThey smash violently against one of the walls in the room. It\ngives and they fall through into the next room.\n\n\n<b>93   INT.   KNIFE ROOM\n</b>\nThis is a small square room. With the exception of the doorway\nto the BROTHERS ROOM, every inch of the walls is covered\nwith sharp and deadly-looking double-bladed knives -ie One blade\nis buried in the wall up to a central hilt/handle and the other\nblade juts out menacingly into the room.\n\nThe two brothers tumble into the room. Their grips loosened by\ntheir fall through the wall, they land on the floor and\nrise to their feet, staring at each other but taking in\nthe vicious nature of the room as well.\n\n<b>                            FRANK\n</b>                  How convenient.\n\nKIRSTY comes through and gasps as she sees the walls.\n\n<b>                            LARRY\n</b>                  Stay there, baby. Don't\n                  come in.\n\n<b>                            FRANK\n</b>                  Yes. Stay there. I'll be with\n                  you in a minute.\n\nLARRY and FRANK trade blows.\n\nFRANK lands a powerful blow to LARRY's jaw. It straightens LARRY\nup and FRANK slams the flat of his hand against his brother's chest.\n\nLARRY flies backwards. He flings out his arm to balance\nhimself but he is nearer to the wall than he thinks and the\nimpetus of his fall drives his arm onto the knives.\n\nLARRY cries out. FRANK grins and prepares to force his wounded\nbrother completely onto the knives.\n\nSuddenly KIRSTY flies across the room at FRANK and beats at his\nback with her fists.\n\nFRANK snarls and, without turning around completely, flings her\naway from him. KIRSTY goes flying but lands just safely short of\nthe deadly walls.\n\nLARRY, in the pause KIRSTY gave him and galvanized by her example,\nhas found more strength. He pulls his arm painfully forward, clear\nof the knives, and throws himself to the side, forcing FRANK onto\nthe knives. With a vicious push, LARRY impales his brother\ncompletely.\n\nFRANK howls, loud and long.\n\nWithout pausing, LARRY pulls a knife free from the wall and, with\none vicious slice, separates himself from his brother.\n\nLARRY rushes to KIRSTY and helps her to her feet. They embrace.\n\nThere is a cry of horror off-camera. We pull out. TIFFANY has\nfollowed her friend. She stares in shock at LARRY's wounded arm\nand at the impaled FRANK.\n\n\n<b>94   INT.   THE CENTRE OF HELL\n</b>\nJULIA is being given more glimpses of the transforming MALAHIDE.\n\nThe major surgery seems to be complete. There are no spinning\nblades of needles in sight as the gashes open. MALAHIDE's head is\ncompletely bald and his face, like the rest of his skin is blue.\nThe only new sophistications are that his upper and lower eyelids\nhave been stretched wide and stapled to his face and forehead,\nand that a new mouth has been sliced into what was his cheek\nbefore his features were pulled permanently to one side.\n\nOver the sound of LEVIATHAN's breath and the CENOBITE\nmachinery still at work on MALAHIDE, FRANK's howl is heard.\n\nJULIA's head turns to the direction of this new sound.\n\n<b>                            JULIA\n</b>                  Frank...\n\nShe turns away without a backward glance and moves back into the\ncorridors.\n\n\n<b>95   INT.   THE KNIFE ROOM\n</b>\nFRANK is still impaled on the knives,  but his anguished howl has\nBecome  small whimpers of complaint (with, given his history with\nthe  CENOBITES,  perhaps  the tiniest note of pleasure in  there,\ntoo)\n\nKIRSTY,  LARRY and TIFFANY are now gathered together to one side\nof the room near the door that leads to the corridor. They should\nleave, but a kind of sick fascination keeps them watching FRANK.\n\nFRANK realises only leverage will pull him free of the knives and\nlifts his forearms up as much as they are free to.\n\nHe turns his palms to face the knives and, with a growl of self-\nencouragement, drives them deeply onto the knives so that he can\nbegin to push the rest of his impaled body backwards.\n\nIt takes several seconds and much pain for him to succeed, but\nsucceed he does. He flops backwards into the room.\n\nSeveral of the knives have stayed in him, rather than the wall -\nhis chest is decorated, or armed, with many blades.\n\nJust as FRANK begins to stand, and just as LARRY and the girls\nsnap out of it and are about to leave, the door from the CONVEYOR\nBELT ROOM opens and JULIA walks into the room.\n\nKIRSTY and LARRY gasp. FRANK gives a slow smile.\n\n<b>                            JULIA\n</b>                  Well, well. All my family\n                  together again. How very\n                  sweet.\n\n<b>                            FRANK\n</b>                     (delighted/flattered)\n                  Julia.\n\n<b>                            JULIA\n</b>                           (Flatly)\n                  Frank.\n\n<b>                            FRANK\n</b>                  I knew you'd come.\n\n<b>                            JULIA\n</b>                  You knew?\n\n<b>                            FRANK\n</b>                  Yes. You're a girl who\n                  remembers her promises.\n\n<b>                            JULIA\n</b>                  Oh, I do. I do.\n\nFRANK grins, his grin taking in LARRY, KIRSTY and TIFFANY as well\nas JULIA. He extends an arm to JULIA.\n\n<b>                            FRANK\n</b>                  And I know how much I mean\n                  to you. Come here.\n\nJULIA does not move.\n\n<b>                            FRANK\n</b>                  Come here. Kiss me. And\n                  then...\n\nHe glances meaningfully at the others, perhaps stroking a blade\nof one of the knives in his chest.\n\n<b>                            FRANK\n</b>                  ... we'll have a real family\n                  re-union.\n\nSuddenly, surprisingly, LARRY laughs. He is genuinely amused.\n\n<b>                            LARRY\n</b>                  Jesus Christ, FRANK. I don't\n                  believe you. You don't know\n                  her at all do you? You still\n                  think you're in charge.\n\nJULIA still has not moved.\n\n<b>                            FRANK\n</b>                  Of course I am. She BELONGS\n                  to me.\n\nJULIA begins to cross the room to him.\n\n<b>                            KIRSTY\n</b>                  For God's sake! He KILLED you!\n\nJULIA doesn't pause. FRANK grins.\n\n<b>                            FRANK\n</b>                  She's forgiven me that. Haven't\n                  you?\n\nJULIA is now next to him.\n\n<b>                            JULIA\n</b>                  Do you really need to ask?\n\nFRANK laughs.\n\n<b>                            FRANK\n</b>                  Show them.\n\n JULIA glances at the knives. FRANK shrugs.\n\n<b>                            FRANK\n</b>                  Just a small inconvenience, babe.\n\nJULIA shifts position so she is standing behind him. She wraps\nher arms around him, one stroking his belly, the other across his\nshoulders.  FRANK leans his head back and twists it slightly.\nThey kiss.\n\nJULIA removes her arm from his stomach and slips it behind him.\nNothing happens for a second and then, suddenly, FRANK's whole\nbody spasms.  We almost think it may be with pleasure until he\nbreaks from the kiss and we see the confused expression on his\nface - and the blood bubbling at his mouth.\n\nThere is a ripping, bursting sound and JULIA's hand emerges from\nhis chest, covered in his blood.  Clutched in her hand is his\nruptured, still pumping heart.\n\n<b>                            LARRY\n</b>                  Jesus!  Out.  Out!\n\nHe shepherds the girls quickly through the door to the corridor.\n\nFRANK's body begins to twitch.  JULIA holds it tightly.\n\n\n<b>96   INT  CORRIDORS/LABYRINTH\n</b>\nThey reach the end of the corridor.  It terminates in a T-\njunction.\n\nTIFFANY automatically heads in one direction.  KIRSTY makes to\nfollow, but LARRY hesitates.\n\n<b>                            LARRY\n</b>                  Wait a minute.  Why are we\n                  following her? Who is this?\n\n<b>                            KIRSTY\n</b>                  This is Tiffany\n\nKIRSTY shrugs.\n\n<b>                            KIRSTY\n</b>                  ... She's good at puzzles.\n\n<b>                            LARRY\n</b>                  Fine.\n\nThey take the turn TIFFANY has indicated.\n\n\n<b>97   INT  THE KNIFE ROOM\n</b>\nJULIA still holds FRANK tight.\n\nSlowly, she raises the hand which holds his heart until it is in\nfront of his face.  FRANK's eyes are glassing over but he can\nstill see.\n\n<b>                            JULIA\n</b>                  Nothing personal, babe.\n\nWithout ceremony, she bursts the heart with one quick squeeze.\n\n\n<b>100    INT  THE CENTRE OF HELL\n</b>\nLARRY, KIRSTY and TIFFANY come running toward the camera.\nInitially oblivious to the fact that the corridor they were\nrunning along has widened and the walls retreated.  Suddenly,\nthey come to a stunned halt together, staring ahead of them with\nawestruck faces.\n\n<b>                            KIRSTY\n</b>                  Oh. My. God.\n\nThe camera moves around them to take in what they see.  They are\nof course in the central chamber of LEVIATHAN.\n\nLEVIATHAN is spinning again, the black beams flying around the\nchamber.\n\nTIFFANY screams. KIRSTY grabs her.\n\n<b>                            KIRSTY\n</b>                  Tiffany, listen.  You've solved\n                  it. But we've got to solve it\n                  the OTHER way.  See?  See?\n                  We've got to get out.\n\nTIFFANY is frozen.\n\n<b>                            LARRY\n</b>                  Come on!\n\nLEVIATHAN spins, the beams fly.\n\n<b>                            KIRSTY\n</b>                  Please!  Tiffany, Please!\n                  Get us out!  Take us home,\n                  please!\n\nTIFFANY nods. They are just about to leave when LEVIATHAN stops\nspinning.\n\nA large beam flies down , carrying an object which lands on the\ncatwalk before the HUMANS, who all take a step or two backwards.\nThe beam withdraws.\nThe object at first resembles a large and bloody plastic bag, but\nthen internal movement begins to rip at this covering.  Hands\nappear out of the rips and complete the removal.  We realise that\nthe bag-like thing was a kind of caul, a membranous after-birth\nthat some creatures produce their young in.\n\nThe thing inside completes its escape and stands clear of the\nshredded caul.  Like a new-born child, it is stained and soiled\nwith amiotic fluids and blood.  But it is not a new born child.\n\nIt is a NEW CENOBITE.  And it used to be MALAHIDE.  The\ntransformation we caught glimpses of is now complete.  Its skin\nis entirely blue, its head entirely bald.  The decorative wounds\nand tortures we saw being applied are all present;  its flesh is\npeeled back in various places, its features are threaded and\ndistorted by, wire, its eyelids are stapled open.\n\nFor a second it stands and regards the HUMANS before it.\n\nTIFFANY gasps in recognition.\n\nKIRSTY too knows what it was.\n\n<b>                            KIRSTY\n</b>                  Malahide ...\n\nFor some reason, KIRSTY draws from her pocket the photo she took\nfrom the OBSESSION ROOM. She stares at it.\n\n<b>                            KIRSTY\n</b>                  Jesus Christ!  Of course ...\n\nThe MALAHIDE CENOBITE stretches its arms and flexes its fingers.\n\n<b>                            MALAHIDE\n</b>                  And to think I hesitated ...\n\nIt looks at the HUMANS again, its gaze finally settling on the\nstill shocked TIFFANY.\n\n<b>                            MALAHIDE\n</b>                  Tiffany. Come. I have a whole new\n                  world of puzzles for you to enjoy ...\n\nIt reaches out its hand to her.\n\n<b>                            MALAHIDE\n</b>                  A whole new world of pleasures\n                  for you to endure.\n\nTIFFANY, confused and used to obeying her doctor's voice,\ntentatively stretches out her arm to meet the MALAHIDE\nCENOBITE's.\n\nLARRY suddenly walks between TIFFANY and MALAHIDE.  The\nexpression on his face is strange; it is not fear, nor defiance.\nIt is simpler than that.  He is really, really pissed off.\n\n<b>                            LARRY\n</b>                  No.  I've had enough of this shit.\n                  Who the hell are you?\n\n<b>                            KIRSTY\n</b>                  It's ...\n\nLARRY waves a hand at her, but keeps his eyes on\n<b>MALAHIDE.\n</b>\n<b>                            LARRY\n</b>                  Never mind.  Never mind.\n\nHe points a finger at MALAHIDE's face, which is attempting a\nversion of PINHEAD's imposing glacial stars, but frankly, isn't\nquite making it.\n\n<b>                            LARRY\n</b>                  Fuck you and the horse you rode in on.\n\nSuddenly, he forms a fist with his unwounded arm and smashes it\nstraight into MALAHIDE's face.  MALAHIDE is completely decked.\n\nLARRY grabs TIFFANY by the shoulders and speaks\nurgently to her.\n\n<b>                            LARRY\n</b>                  O.K.  You've done it before.  You\n                  can do it again.  GET US OUT OF\n<b>                  HERE!\n</b>\nThe three of them run back up the catwalk.\n\nLEVIATHAN spins wildly and a myriad of black beams flow from it.\nAs they shine into the catwalk they become limbs like those that\ncaptured MALAHIDE, but all with different tips; some are organic,\nvicious mouths, some are hooks or blades, some are faces, some\nare (as if LEVIATHAN Is too angry to be thinking straight)\nbeautiful flowers.\n\nThe limbs fly up the catwalk, but the HUMANS have gained too\ngreat a start.  The limbs retract rapidly into the black lights.\n\nMALAHIDE staggers to his feet, just as LEVIATHAN re-directs its\nenergy into forming and projecting one much fatter limb.  It is\ndirty pink and segmented, like a vast earthworm.  The end peels\nback as it flies toward MALAHIDE, revealing a cruel, metallic,\nand rapidly-spinning surgical saw.\n\nJust as MALAHIDE stands up straight, the limb smashes into the\nback of his skull.  There is a distressing WHIRRING noise as\nthe limb seals itself fleshily to MALAHIDE's skull and the former\nsurgeon twitches and dances in horrible involuntary movements as\nLEVIATHAN takes over what little mind remains.\n\n\n<b>101   INT  CORRIDORS/LABYRINTH\n</b>\nKIRSTY, TIFFANY and LARRY are running, TIFFANY making the\ndecisions as to direction.\n\nDown one corridor, blades and knives jut out from the opposite\nwalls at random intervals and they have to weave at high speed\nbetween them. They negotiate the corridor successfully but, just\nas KIRSTY, bringing up the rear, emerges from it, she stumbles\nand half-falls. The re-structured BOX falls from her pocket and\nrolls back a few feet up the corridor.\n\nTIFFANY, who is nearest to her, helps her to her feet and, as she\ndoes so, catches sight of the BOX (or white diamond, as it is\nnow). She makes as it to go and get it. KIRSTY holds her arm.\n\n<b>                               KIRSTY\n</b>                  No. Come on. We have to get\n                  out of here.\n\nTIFFANY moves away with KIRSTY, but not without a backward glance\nand a puzzled expression.\n\nThey all make another turning. Suddenly, when they are about\nhalfway down this next corridor, a new gap opens up behind them\nin the wall and a terrible sucking noise is heard.  Corridor\ndebris disappears into the vacuum.\n\nLuckily, LARRY has reached the end of the corridor and grasps the\ncorner with one hand, seizing KIRSTY's hand with the other.\nKIRSTY grabs TIFFANY and the three of them flatten themselves\nagainst the wall, fighting against the suction.  The force is\ntremendous and LARRY's finger are slowly losing hold.\n\n\n<b>102   INT.   CORRIDORS/LABYRINTH\n</b>\nCLOSE UP on a hand picking up the re-structured BOX from the\ncorridor floor they have just left.\n\n\n<b>103   INT.   CORRIDORS/LABYRINTH\n</b>\nThe sucking force is growing stronger by the second. Not only is\nLARRY's right hand losing its grip on the edge of the wall, but\nhis left arm - stretched tight as it clings to KIRSTY and, via\nher, TIFFANY - is bleeding profusely again.\n\n\nSuddenly, JULIA appears at the top of the corridor next to LARRY.\nIn her hand is the white diamond BOX that KIRSTY had let drop.\nShe stays just out of range of the sucking wind.  She stares at\nLARRY's weakening fingers and smiles.\n\n<b>                            JULIA\n</b>                  Oh, poor Larry.  You never\n                  could hold on to anything\n                  for very long, could you?\n\nSuddenly, audaciously, his face set in a scowl of anger, LARRY\nlets go of the wall.  Before she realises what is happening, he\nhas grabbed JULIA's wrist and pulled her off her feet into the\ncorridor. He lets go almost immediately and with a superhuman\neffort grabs at the corner again before the wind can claim him\nand the girls.\n\nJULIA is not so lucky; without support or foothold, she is seized\nby the wind and hurtles to the gap in the wall.\n\nShe manages to brake herself by flinging her arms out to either\nside of her. For a moment she is hold there and then the pressure\nbegins to draw her in.\n\nIn her left hand she still holds the BOX, but her right hand is\nonly a few inches from TIFFANY's left.\n\nTIFFANY reaches her hand to her, not knowing JULIA as the others\ndo. Their fingers just manage to interlock when JULIA's face\nregisters a disbelieving shock.\n\nThere is a terrible ripping sound. JULIA's new skin, so recently\ngained, is giving up its hold and has ripped right up the spine.\nJULIA is drawn from it.\n\n<b>                            JULIA\n</b><b>                  NOOOOOOOOOO!\n</b>\nWith a final, slurping sound, the skinned woman slips from the\nskin and disappears down the new corridor.\n\nThe momentary break in tension allows LARRY to make one last\neffort. He rounds the corner and pulls the girls after him.\nTIFFANY, finally, realising what has happened, screams in terror\nand disgust, especially when she looks at what she has brought round\nthe corner in her hand. She drops JULIA's skin to the floor as\nthe three of them scramble to their feet and begin to run again.\n\nStill clutched in the skin's hollow fingers is the white diamond BOX.\n\nAs they turn another corner, they see, very far in the distance,\na glimmer of light. TIFFANY points excitedly.\n\n<b>                            KIRSTY\n</b>                  My God, it's her room!\n\n<b>                            LARRY\n</b>                  Let's go!\n\nHe starts urging the girls down the corridor - a long and very\nnarrow one - but KIRSTY shows some resistance.\n\n<b>                            KIRSTY\n</b>                  No. No, there's something\n                  wrong...\n\nBefore they can discuss it, a new rushing sound is heard. They\nlook back.\n\nHurtling towards them is the ENGINEER from HELLRAISER.\n\nTIFFANY screams.\n\n<b>                            LARRY\n</b>                  Jesus. O.K. No more arguments.\n                  Just RUN!\n\nThey begin one last panic-fuelled run down the narrow corridor,\nthe ENGINEER at their heels.\n\nThe sequence is equivalent to KIRSTY's pursuit by the ENGINEER in\nHELLRAISER, the twist here being that as they approach the entrance\ninto TIFFANY's room the walls of the corridor, already thin, begin\nto close together.\n\nLARRY is bringing up the rear (the corridor is now so narrow only\nsingle file is possible) and he can almost feel the ENGINEER'S\nbreath on his neck.\n\n<b>                            LARRY\n</b>                  Go. Go. Go. Go. Go!!\n\nFinally, almost impossibly, they reach the gap in the wall.\nTIFFANY tumbles through, then KIRSTY, and finally LARRY. Less\nthan a micro-second after LARRY has made it, the walls seal\nthemselves.\n\n\n104   INT.   TIFFANY'S ROOM    (2nd VERSION)   DAY\n\nAs we see clearly the room they have come into, we perhaps share\nthe feeling that KIRSTY expressed in the corridor; Something Is\nWrong.\n\nThe tiles that make up the floor are patterned as before but the\nindividual tiles are larger. The room itself seems more spacious,\nthe ceiling higher.\n\nThere is a bowl of flowers by the window. The flowers were in\nfull bloom before their trip to Hell but now they seem long dead.\n\nThe audience have to notice most of this for themselves because\nLARRY, KIRSTY, and TIFFANY are too relieved by, and tired from,\ntheir escape to take this in immediately. LARRY seats himself in\nthe chair, KIRSTY perches on the end of TIFFANY's bed. TIFFANY\nhowever walks straight across to her window. She is the first to\nnotice anything. She stares at the flowers.\n\n<b>                            KIRSTY\n</b>                  Tiffany ... ?\n\nKIRSTY rises from the bed and joins TIFFANY by the window.\n\n<b>                            KIRSTY\n</b>                  But these were ... Daddy?\n\nLARRY rises to his feet. Just as he stands, a fleeting expression\nof bewilderment crosses his face. He strokes at his right arm\nwith an unconscious gesture as he crosses the room.\n\nKIRSTY doesn't look at her father right away.\n\n<b>                            KIRSTY\n</b>                  These flowers. I saw them just...\n\nShe looks at her father. A sea of sweat has broken out on his\nbrow and face as he stares intensely at the flowers. KIRSTY's\nvoice slows, begins to trail off.\n\n<b>                            KIRSTY\n</b>                  ...the day ...before... yesterday\n                  Daddy? Daddy!\n\nLARRY's eyes close. His entire face screws up as if an\nexcruciating pain just hit him. He clamps his arm across his\nchest, the hands clutching his shoulders. He opens his eyes and\nlooks at KIRSTY for a second, his expression one of surprise.\nThen his eyes roll up into the sockets and he collapses to the\nfloor.\n\nTIFFANY has hardly had time to turn from the bowl of flowers\nbefore KIRSTY is kneeling by her father.\n\n<b>                            KIRSTY\n</b>                  Daddy!\n\nLARRY is unconscious. TIFFANY gasps. KIRSTY looks up at her.\n\n<b>                            KIRSTY\n</b>                  Get help.\n\nTIFFANY's eyes widen. She rushes to the door and disappears into\nthe corridor. Within two seconds we hear an emergency alarm go\noff and TIFFANY re-enters the room.\n\n<b>                            KIRSTY\n</b>                  Pass me a pillow.\n\nTIFFANY does so and KIRSTY places it under the head of LARRY,\nwhose lips are now blue and who is breathing very shallowly.\nKIRSTY looks up at TIFFANY, despair in her eyes.\n\n<b>                            KIRSTY\n</b>                  What do you do? I just don't\n                  know what to do.\n\nTIFFANY shakes her head helplessly.\n\nSuddenly, the door to the room flies open and two INTERNS - maybe\nStan and Ollie from the carnival sequence - come in, complete with\nstretcher and gurney. They assess the situation with a glance and\nit is serious enough to make one of them break their professional\nsilence.\n\n<b>                            INTERN\n</b>                  Coronary arrest. Let's be quick.\n\nThey are good at their job - within seconds LARRY is secured on\nthe gurney and they head for the door, KIRSTY and TIFFANY behind\nthem. The following exchanges are spoken on the move.\n\n<b>                            KIRSTY\n</b>                  Is he going to be 0.K.?\n\n<b>                            INTERN\n</b>                  We just can't say.\n                  O.R.'s on standby. They'll\n                  do what they can.\n\n<b>                            KIRSTY\n</b>                  But it's bad?\n\nThe INTERNS exchange a glance and decide honesty is best.\n\n<b>                            INTERN\n</b>                      (gently but flatly)\n                  Yeah. It's bad.\n\n\n<b>105   INT.   ELEVATOR   DAY\n</b>\nThe elevator is uncomfortably full, KIRSTY and TIFFANY squashed\nup against the back while the INTERNS hold the gurney in the\ncentre.\n\nThe elevator is descending. The ride seems to take longer than it\nshould, even though they are going to basement level;like the\nlook of TIFFANY's room, it's ALMOST normal but just different\nenough to make us slightly uneasy in an un-focused way.\n\nEventually, though, it does come to a stop. TIFFANY squeezes\nKIRSTY's shoulder sympathetically (NOTE. RE: TIFFANY's character\n- it should be clear to the audience by this stage that, though\nshe is still mute, TIFFANY is now a responsive, more rounded\ncharacter)\n\nThe INTERNS wheel the gurney out of the elevator and the girls\nfollow.\n\n\n<b>106   INT.   BASEMENT CORRIDOR   DAY\n</b>\nThe basement corridor is long, cavernous, and not very pleasant.\nIt has a grimier, more uncared-for look than the upper floors and\nthe high ceiling is covered with an intricate system of naked\npipes and conduits.\n\nThe INTERNS wheel LARRY down this corridor, going so fast that\nKIRSTY and TIFFANY are continually breaking into a trot to keep\nup with them.\n\nAt the far and of the corridor are a set of double doors. The\nnearer they all get to these doors, the tackier the corridor\nseems to become. The walls now have pipes running over them, as\nwell as the ceiling, and several of these pipes are dripping\nwater into small pools on the corridor floor. The sound of these\ndrips is artificially loud on the soundtrack.\n\nFinally, the doors are reached and the INTERNS, LARRY, KIRSTY and\nTIFFANY disappear through them.\n\n\n<b>107   INT.   PRE-OP ROOM    DAY\n</b>\nThis is a small ante-room to the operating room which is beyond a\nfurther set of double doors. Without ceremony the two INTERNS\npass straight across this room to those doors and wheel the\ngurney through, one of them throwing back a parting remark to\n<b>KIRSTY.\n</b>\n<b>                            INTERN\n</b>                  Wait out here. A doctor\n                  will talk to you when\n                  we know more.\n\nThe double doors part and close, giving just a glimpse of the\noperating room beyond, all lights, monitors and whirring machinery,\nand the several gowned and masked experts attending to LARRY.\n\nAs the doors close, KIRSTY turns to TIFFANY, expecting a long\nwait before anyone comes to speak to them. Surprisingly, though,\nthe doors open again almost immediately and two figures step\nthrough. They, too, are masked and gowned in surgical green and\nvery little of them is visible.\n\n<b>                            KIRSTY\n</b>                  Is he going to be all right?\n\n                            1st GOWNED FIGURE\n                      (matter of factly)\n                  No. He's not going to be\n                  all right.\n\nKIRSTY staggers visibly, shocked by this bluntness.\n\n<b>                            KIRSTY\n</b>                  Wh...\n\n                            1st GOWNED FIGURE\n                  No. He's going to die. He's got\n                  a ruptured aorta. He's going to\n                  die in agony.\n\nAs he makes this speech, the mask of his colleague stains rapidly\nwith blood, as if it is literally pouring from its mouth.\nSimultaneously, his own mask is slowly pierced by a score of nails\nbursting through from beneath.\n\nTIFFANY screams.\n\nThe 1st GOWNED FIGURE pulls the mask and cap away from its face -\nIt is PINHEAD. His colleague does the same. It is the FEMALE\n<b>CENOBITE.\n</b>\n<b>                            KIRSTY\n</b>                  Oh, Fuck.\n\nShe's had too much experience with these two to hesitate. She\ngrabs TIFFANY's arm and bursts through the double doors to the\ncorridor.\n\n\n<b>108   INT.   BASEMENT CORRIDOR   DAY\n</b>\nWe are now looking along the corridor in the other direction -\nback towards the elevator.\n\nKIRSTY and TIFFANY come into shot, running rapidly along the\ncorridor.\n\nAs they make their way, a rumbling, flatulent sound is heard from\nthe overhead pipes and they all begin to drip blood not water.\n\nWe hear the sound of the doors flying open behind them.\n\nKIRSTY and TIFFANY reach the elevator. KIRSTY presses frantically\non the call button, while TIFFANY looks behind them with\nfrightened eyes.\n\n<b>                            KIRSTY\n</b>                  C'mon. C'MON!\n\nThe sound of steadily-pacing, purposeful feet is heard coming up\nthe corridor, getting louder, coming closer.\n\nKIRSTY begins hammering on the closed elevator doors. TIFFANY\nstifles a cry with her hand.\n\n<b>                            KIRSTY\n</b><b>                  COME ON!!\n</b>\nSuddenly, the doors fly open. KIRSTY and TIFFANY tumble into the\nelevator.\n\n\n<b>109   INT.   BASEMENT CORRIDOR   DAY   (GIRLS' P.O.V.)\n</b>\nWe see the door-frame of the elevator and the floor buttons\nbeside it and, looking down the corridor through the open\nelevator doors, PINHEAD and the FEMALE CENOBITE marching towards\nus.\n\nWe also see KIRSTY'S finger jabbing frantically at the floor\nbuttons. The doors are not closing. The CENOBITES are getting\nvery close.\n\nFinally, just as PINHEAD breaks from his determined but medium-\npaced stride and speeds up eagerly for the last two or three\nyards, extending his arm as he does so, the door slams shut\nacross our vision and we hear the elevator machinery start up.\n\n\n<b>110    INT.   ELEVATOR   DAY\n</b>\nKIRSTY leans against the back wall of the elevator, breathing\nheavily. TIFFANY stands very still in the middle, a frozen\nexpression of fear on her face.\n\n<b>                            KIRSTY\n</b>                  Faster, you bastard, faster!\n\nShe slams her fist against the elevator wall. The elevator\nstops. Its lights flicker.\n\n<b>                            KIRSTY\n</b>                  Oh, Jesus. I'm sorry. I'm\n                  sorry. I didn't mean it.\n\nThe elevator starts again.\n\n<b>                            KIRSTY\n</b>                  It's 0.K. They can't beat an\n                  elevator. Not upstairs. It'll be O.K.\n\nThe lift stops, but this time it's where they want it. KIRSTY's\nfinger hesitates over the DOOR OPEN button.\n\n<b>                            KIRSTY\n</b>                  It'll be O.K.\n\nShe presses the button.\n\n\n<b>111   INT.   HOSPITAL CORRIDOR   DAY   (GIRLS P.O.V.)\n</b>\nWe are looking at the closed elevator door.  When it opens we\nwill be looking down the corridor on the main hospital floor -\nthe floor with the girls' rooms on.\n\nThe door flies open. CHATTERER II lunges in at them.\n\nKIRSTY screams, but because of the eagerness of his lunge they\nare able to get around him as his impetus carries him to the back\nof the elevator.\n\n\n<b>112   INT.  HOSPITAL CORRIDOR      DAY\n</b>\nThe door begins to close as the girls straighten up in the\ncorridor and as CHATTERER II turns around to come back out at\nthem.\n\nHe tries to put his hand out to stop the door closing, but\nsucceeds only in trapping his fingers in the door.\n\nKIRSTY, as soon as the doors began to close, had hit the DOWN\nbutton. Now, she squeals with horror as she realises what is\nabout to happen.\n\nThe elevator begins to descend - we can tell this because\nCHATTERER II's fingers move down to the floor and are then\nsliced off.\n\nThe GIRLS run off down the corridor.\n\n<b>                            KIRSTY\n</b>                  This way. Short cut.\n\nThey turn into a set of double doors leading to a large ward.\n\n\n<b>113   INT.   LARGE WARD   DAY\n</b>\nKIRSTY and TIFFANY enter the ward at a run and then slow down to\na confused and horrified walk.\n\nEvery bed in the ward is occupied, some by men, some by women,\nand every patient has in their hands, and is busily working on, a\n<b>LAMENT CONFIGURATION.\n</b>\nDespite this collective work-in, the BOXES obviously still have\nthe vicious characteristics they have previously demonstrated\nwhen used individually - as is witnessed by the ten or so patients\nwho are struggling on with their work despite having one or two\nhooks and chains connecting their flesh to their BOX.\n\nKIRSTY and TIFFANY move slowly down the room, a look of\nincredulity on both their faces.\n\n<b>                            KIRSTY\n</b>                  Oh, Christ. This isn't just\n                  personal anymore.\n\nTIFFANY nods slowly, her eyes flicking back and forth across the\nward.\n\nSuddenly, the wheelchair patient from the earlier scene in this\nward, who has been between two of the beds on one side of\nthe ward, cuts across the GIRLS' path. He too has a BOX on his\nlap. As he passes in front of them, he looks at them, giggles in\nan unmistakably insane fashion, and gives them a conspiratorial\nwink. Then he simply proceeds to the other side of the ward.\n\nA second or so after this, as the GIRLS edge down the middle of\nthe room, they hear a rushing sound behind the double doors they\nare heading towards.\n\nSuddenly, the doors slam open and revealed in the doorway is\n<b>MALAHIDE.\n</b>\nBut he is not standing there. He is hovering about two feet off\nthe floor. The umbilical limb that connects him to LEVIATHAN is\nstill at the back of his skull. His face is contorted in a grin\nof manic glee as he floats three or four feet into the ward.\n\n<b>                            MALAHIDE\n</b>                  The Doctor is in!\n\nHe laughs, and the sound is far from human. KIRSTY and TIFFANY\nstare at him.\n\n<b>                            TIFFANY\n</b>                  Oh, shit.\n\nKIRSTY looks sharply at TIFFANY for a second,  as if she is about\nto comment on her re-found voice, but instead simply nods. She\ntakes her friend's hand and the GIRLS begin to walk very slowly\nbackwards to the far end of the ward.\n\nMALAHIDE is too enraptured of his new power to pay attention to\nspecific victims and so makes no move to stop the GIRLS' slow\nretreat.\n\nSuddenly his palms erupt into a writhing mass of tentacle-like\nlimbs as his head tips back to emit a wide band of LEVIATHAN's\nblack light at the ceiling, accompanied by, renewed inhuman\nlaughter.\n\nTaking this as their cue, the GIRLS turn and bolt for the doors\nat the far and of the ward and exit through them.\n\nThe limbs extrude from MALAHIDE's palms only twelve inches or so\nand are all quite thin, but they all have independent movement\nand they all have various surgical-like, gleaming tips. MALAHIDE\nfloats over to the nearest bed. He looks at the patient and then\nlooks at the bladed tips of his new limbs and, as if addressing\nthem, speaks.\n\n<b>                               MALAHIDE\n</b>                  I recommend amputation.\n\nThere is another burst of laughter as the limbs fly at the\npatient, writhing, twitching, slashing, and slicing.\n\n\n<b>114   INT.   HOSPITAL CORRIDOR  DAY\n</b>\nThe GIRLS run wildly along the corridor, not knowing MALAHIDE is\nworking his way through his former patients. They come to another\ndoor and pause. They look back down the corridor to ensure they\nare not visible as they hide and KIRSTY pushes the door open with\nthe flat of her hand behind her. Carefully, still looking down\nthe corridor, they back into the room and let the door close.\n\n\n<b>115   INT.   HOSPITAL/TORTURE ROOM  DAY\n</b>\nCLOSE UP on the GIRLS' faces as the door closes in front of them.\nKIRSTY lets out a breath. Then they hear the rattling sound behind\nthem. They swing round and the camera pulls out to take in the room.\n\nIt is like the TORTURE ROOM in HELLRAISER. The walls are black,\nthe floor slimy, and the room filled with chains, hooks, and\ntorture-pillars. And, in the room and staring at the GIRLS, are\nthe four CENOBITES.\n\nPINHEAD glances theatrically around the room, as if checking\nsomething.\n\n<b>                            PINHEAD\n</b>                  Oh. No Boxes. Such a shame.\n\n<b>                            FEMALE CENOBITE\n</b>                  No more delays, Kirsty. No more\n                  teasing. Time to play.\n\n<b>                            PINHEAD\n</b>                  Time to play.\n\nKIRSTY looks at his unforgiving face and then her eyes suddenly\nwiden as she thinks Of something.\n\n<b>                            KIRSTY\n</b>                  Wait!\n\n<b>                            PINHEAD\n</b>                  No more deals, Kirsty. It's\n                  your flesh we want to experience,\n                  not your skill at bargaining.\n\n<b>                            KIRSTY\n</b>                  No deals! Just information.\n                  Information. Free of charge.\n                  No strings. Just information.\n\n<b>                            PINHEAD\n</b>                  Go on. But trick us again,\n                  child, and your suffering will\n                  be legendary even in Hell.\n\nCarefully, making no fast movements, KIRSTY reaches into her\npocket where she placed the photograph from MALAHIDE's OBSESSION\nROOM. She brings out the picture that she realized earlier was\nof PINHEAD and hands it to him.\n\nHe takes hold of it and looks, his face registering nothing.\n\n<b>                            PINHEAD\n</b>                  What is this? Someone else\n                  you think escaped us, like\n                  Frank?\n\n<b>                            KIRSTY\n</b>                  No, No, this one didn't escape.\n                  You told me you'd always been\n                  in Hell. You were wrong. Look\n                  at it. LOOK. IT'S YOU.\n\n<b>                            PINHEAD\n</b>                  Nonsense, I...\n\n<b>                            KIRSTY\n</b>                  It's you! You HAVEN'T always\n                  been as you are. You were\n                  HUMAN. Remember. Remember\n                  all your confusions. Think!\n\nThe FEMALE CENOBITE strides across the room.\n\n<b>                            FEMALE CENOBITE\n</b>                  Enough!\n\nShe raises her hand towards KIRSTY. PINHEAD's arm flies out and\nstops her.\n\n<b>                            PINHEAD\n</b>                  Wait!\n\nHe is staring at the photograph, that great immobile brow finally\npuckering, as if something is stirring.\n\n<b>                            PINHEAD\n</b>                  I...remember.\n\n<b>                            KIRSTY\n</b>                  You were ALL human!\n\nThe other three CENOBITES stop moving and stare at KIRSTY. Any\nadvances they were making on KIRSTY or TIFFANY stop as the same\ndim, distant, recollection begins to stir within them.\n\nSuddenly, the door bursts open. MALAHIDE is there, still\nfloating, his voice still a mixture of hideous threat and\ninsane joy.\n\n<b>                            MALAHIDE\n</b>                  Tiffany. Come.\n\nHe turns his palms downwards, mirroring his gesture in the hall\nof mirrors.\n\nTIFFANY lets out a moan of terror and shakes her head.\n\nOne of the snake-like limbs from MALAHIDE's palms flies towards\nTIFFANY's face. Before anybody can react, its scalpel tip has\nsliced an inch or so off several strands of her hair.\n\n<b>                            MALAHIDE\n</b>                  Tiffany. Come.\n\nKIRSTY throws her arms around the cowering TIFFANY and snarls at\nher tormentor.\n\n<b>                            KIRSTY\n</b>                  Leave her alone, you asshole!\n\nMALAHIDE makes no reply, but suddenly several more limbs fly\ntowards the GIRLS and begin to weave in front of KIRSTY's face\nlike snakes awaiting their moment.\n\nAt this stage, the camera CUTS TO the watching PINHEAD. He lets\nthe photograph of his past life flutter to the floor.\n\nMALAHIDE looks up at the tiny noise this makes and his eyes meet\nPINHEAD'S. He turns more fully to face PINHEAD and the other\nCENOBITES who are now standing with their leader, and a strange\nsmile crosses his face\n\n<b>                            MALAHIDE\n</b>                  Oh,good. A fight.\n\nSuddenly, the air is full of flying chains. MALAHIDE is hooked\neverywhere. It is like a high-speed version of FRANK's final re-\ncapture in HELLRAISER. The chains start tugging almost instantly.\n\nIs MALAHIDE about to be ripped apart?\n\nWith contemptuous, dismissive speed, the limbs that ooze from\nMALAHIDE's palms have sliced the chains to pieces and, almost\nbefore we have time to realise that, three of them have\nlengthened, thickened, and hardened and have skewered the FEMALE\nCENOBITE, CHATTERER II, and BUTTERBALL to the walls.\n\nThe three limbs detatch themselves from MALAHIDE. The three\nCENOBITES are all well above the floor, pinned and twitching like\nthe rats in FRANK's attic.\n\nAs they die, they suddenly revert; there are three human corpses\non the walls of the room. A woman, a fat man, and a little boy.\n\nMALAHIDE smiles. Be looks at PINHEAD again and advances. Suddenly\na heavy torture pillar smashes into him, knocking him slightly\noff-balance.\n\nPINHEAD is backing across the room, weaving pillars in front of\nhim as he moves. MALAHIDE moves forward, knocking them out of the\nway. As each pillar is knocked aside, PINHEAD's face is more and\nmore human. Finally, when the face we see is nearly that of the\nENGLISH OFFICER from the opening, he turns his head slightly away\nfrom the advancing MALAHIDE and finds KIRSTY's eyes. A look\npasses between them. Understanding? Gratitude? Friendship?\n\nWhatever emotion lies beneath it, it is clearly a cue and\nKIRSTY and TIFFANY make a break for it, bursting through the\ndoor. Simultaneously to this, MALAHIDE and PINHEAD find each\nother's eyes a final time. For a second, everything is still then\na single bladed limb flies across the space between them and\nneatly and calmly slices PINHEAD's throat open. The thin red line\nbecomes a torrent of blood and the former lord of Hell falls dead\nat the feet of his successor.   \n\n\n<b>116   INT.   HOSPITAL CORRIDOR   DAY\n</b>\nKIRSTY and TIFFANY burst out into the corridor and almost fall\nover the PATIENT IN THE WHEELCHAIR.\n\n<b>                            PATIENT\n</b>                  So what, girls? It's O.K.\n                  for an ego-trip but it\n                  doesn't got the job done.\n\nShaking their heads at the insanity, they run up the corridor.\n\nTIFFANY looks slightly distracted and when she speaks it is half\nto herself.\n\n<b>                            TIFFANY\n</b>                  I have to go back. Or it'll\n                  never stop.\n\n<b>                            KIRSTY\n</b>                         (Confused)\n                  What are you talking...\n\n<b>                            TIFFANY\n</b>                          (to herself)\n                  I've got to finish it.\n\n<b>                            KIRSTY\n</b>                  Finish what?\n\nEven as KIRSTY says this, TIFFANY has moved past her and is\nresuming her run down the corridor.\n\n<b>                            KIRSTY\n</b>                  Tiffany! Wait!\n\nKIRSTY starts after her friend.\n\nThey turn back into the main section of the corridor that contains\ntheir own rooms, TIFFANY still four or five yards in front of\n<b>KIRSTY.\n</b>\nTIFFANY reaches her room. The door is open. She goes in. A second\nlater, KIRSTY follows.\n\n\n<b>117      INT.   TIFFANY'S ROOM   DAY\n</b>\nKIRSTY enters the room. It is as we last saw it except that\nthe walls have re-parted to give onto the corridors of Hell.\n\nCarefully and slowly, KIRSTY moves across to the entrance and\nlooks down it. She is rewarded with the sight of TIFFANY just\ndisappearing at the far end of the first corridor. With a\ngrimace, KIRSTY follows her in.\n\n\n<b>118   INT.   CORRIDOR/LABYRINTH\n</b>\nTIFFANY's skill at finding her way through puzzles means the\nGIRLS are soon in the murkier corridors close to the Centre.\n\nHell seems angrier now, steam is issuing in jets from the\ncorridor walls, the cries of children are heard faintly on the\nsoundtrack, LEVIATHAN's breathing is more dominant, perhaps the\nlight is even pulsing in time with it.\n\nKIRSTY is still several yards behind TIFFANY. TIFFANY takes a\ncorner and is out of sight for a second or so . KIRSTY dashes\naround the corner to find TIFFANY staring with distress at\nsomething on the floor.\n\nIt is the skin ripped off JULIA by the vacuum tunnel earlier.\n\n<b>                            KIRSTY\n</b>                  Oh, gross.\n\nTIFFANY bends down and retrieves the white diamond BOX from the\nempty fingers.\n\n<b>                            KIRSTY\n</b>                  What are you doing? What are WE doing?\n\nTIFFANY looks at the BOX in her hand. When she speaks, it is not\nto KIRSTY but to herself.\n\n<b>                            TIFFANY\n</b>                  I can't do it here. I have to\n                  go to it.\n\n\n<b>119   INT.   THE CENTRE OF HELL\n</b>\nLEVIATHAN spins and fires light in the centre, his machine-like\nbreathing drowning all other sound. We are looking down the\ncatwalk as KIRSTY and TIFFANY approach its edge.\n\nThe beams of black light wash across their faces, as they passed\nover MALAHIDE's in the earlier scene. Images of horror freeze\nmomentarily before them and then pass on, only to be replaced by\nothers.\n\n<b>                            TIFFANY\n</b>                  I'm scared.\n\n<b>                            KIRSTY\n</b>                  No. Don't let it. You've\n                  come this far.\n\nThe GIRLS press on. Whether LEVIATHAN is oblivious to their\npresence or simply doesn't consider them a threat, the beams stop\nstriking the GIRLS' faces. Nevertheless, the mood remains\nominous. The audience should feel something is about to happen.\n\nThey are six feet from the lip of the catwalk. TIFFANY kneels\nand, holding the white diamond BOX in front of her, begins to\nmove her fingers over it. The music box tune begins to play as\nthe BOX begins to move.\n\nThat 'something' that the audience was waiting to happen,\nsuddenly does; MALAHIDE flies up from the abyss beside the\ncatwalk. The vastness of the limb that seals him to LEVIATHAN is\nnow directly apparent; instead of merging into black light, the\nlimb itself trails through the air over the huge distance to\nLEVIATHAN itself.\n\nOne of the limbs from MALAHIDE's palms flies out and knocks the\nBOX from TIFFANY's hands. It rolls perilously close to the edge\nof the catwalk.\n\nKIRSTY grabs TIFFANY and, dragging her to her feet, pulls her\nfurther back down the catwalk as MALAHIDE floats to a landing\nbetween them and the BOX.\n\n<b>                            MALAHIDE\n</b>                  Ah, girls. And how are we\n                  feeling today?\n\nThe blades on the end of his limbs twitch eagerly.\n\n<b>                            MALAHIDE\n</b>                  You have your whole lives\n                  behind you now.\n\nThe limbs fly forward. KIRSTY screams and both girls run up\nthe catwalk.\n\nAbout halfway back up, however, TIFFANY stops, turns around, and\nbegins to walk back. KIRSTY calls out.\n\n<b>                            KIRSTY\n</b>                  Tiffany! No!\n\nThe camera stays with TIFFANY as she makes her way back. KIRSTY's\nvoice stays on the soundtrack for a time, imploring her friend to\nturn back and then simply stops. This should be abrupt enough to\nmake the audience notice but smooth enough to avoid their\nattention leaving TIFFANY.\n\nMALAHIDE waits, happy to see a patient so keen on the knife.\n\nVery slowly, TIFFANY moves forward, inch by slow inch. This is\nsomething she HAS to do; the expression on her face is not\ndetermination but terror. And MALAHIDE is very happy to encourage\nthis.\n\n<b>                            MALAHIDE\n</b>                  Surgery is open, Tiffany.\n                  What was today's agenda?\n\nHis scalpels flick in the air, making small slicing motions.\n\n<b>                            MALAHIDE\n</b>                  Ah, yes. Evisceration.\n\nStill TIFFANY comes forward, closer and closer until she is\nsurely close enough to be grabbed.\n\nSuddenly, she is grabbed. But from behind, and by a human hand.\nTIFFANY gasps, and turns to see who has seized her. She screams.\nIt is JULIA.\n\nThe limbs retract into MALAHIDE's palms. He smiles.\n\n<b>                            JULIA\n</b>                  Doctor. I've missed you.\n\nJULIA, having presumably just replaced her skin, is not quite as\nperfect as before; there are bloody lines like scars beneath her\nears and chin as if the skin required some adjustment before\nbeing put on.\n\nJULIA moves forward, her left arm still holding TIFFANY, her\nsmile returning MALAHIDE'S.\n\n<b>                            MALAHIDE\n</b>                  I knew you'd come back.\n\n<b>                            JULIA\n</b>                  I'm a girl who keeps her promises.\n\nJULIA is right next to MALAHIDE now. Smoothly, she releases her\ngrip on TIFFANY and embraces MALAHIDE sensuously. He returns the\nembrace. They kiss.\n\nUnseen, TIFFANY moves to the edge of the catwalk and picks up the\nBOX. Her fingers move over it, finding its solution. Suddenly,\nLEVIATHAN's breath becomes a roar of anger and fear.\n\nMALAHIDE breaks away from his kiss, his face a mixture of\nconfusion and rage. JULIA plants both hands in the middle of his\nchest and pushes. He falls over the lip of the catwalk but,\nalmost before he drops from sight, he is suddenly pulled\nbackwards through the air, screaming, as LEVIATHAN's limb\nretracts. JULIA jumps back. shouting.\n\n<b>                            JULIA\n</b>                  Do it, Tiffany! Do it!\n\nTIFFANY's fingers fly over the BOX and suddenly we see what is\nhappening. The mountain-like LEVIATHAN is following the movements\nof the small replica in TIFFANY's hands. As TIFFANY inverts the\nnew configuration back towards a closed BOX, LEVIATHAN too is\nbeing twisted and turned. Being closed.\n\nThe whole centre of Hell shakes as if suffering a mild\nearthquake. JULIA and TIFFANY almost lose their footing, but\nTIFFANY continues working. She is nearly, there. LEVIATHAN is\nhalfway between its white diamond, majesty and a huge closed BOX.\n\nTIFFANY takes her hands from the BOX. It is done. The larger BOX\noperates a few seconds behind it's control, so that we can inter-\ncut the final sliding and creaking into position with the\nfollowing human drama;\n\nAs LEVIATHAN makes its final closing, the mild tremors of before\nbecome larger. Hell shakes violently and this time TIFFANY does\nlose her footing. She looks set to tumble into the vast abyss to\nthe side of the catwalk but just manages to catch hold of the edge\nwith one hand. The small BOX flies from her hand and hurtles down\ninto the miles of blackness below. TIFFANY dangles over the edge,\nher feet kicking wildly for a foothold that doesn't exist.\n\nSuddenly, a hand extends to her. She looks up. It is JULIA. For a\nsecond, nothing happens.\n\n<b>                            JULIA\n</b>                  Trust me.\n\nTIFFANY lifts one hand off the edge and grabs at JULIA's\nproffered wrist.\n\nJULIA begins to pull up and for a moment it seems the crisis is\nover. Then a terrible and familiar ripping noise is heard: The\nskin of the arm that TIFFANY clings to begins to rip free at the\nshoulder. Gradually, like a shirt's threads unraveling, it\ncomes off. TIFFANY's weight pulls it clear like a very long and\nvery tasteless evening glove and it seems she will finally make\nthe long drop. At the final second, as the arm-skin comes off,\nthe entire skin flies from the body and falls with its arm into\nthe abyss. TIFFANY screams. She is going to die.\n\nBut suddenly the two arms that have Just lost their skin fly out\nagain and catch her fingers. TIFFANY is hauled over the edge and\nstaggers to her feet, staring into the-bloodied face of KIRSTY,\nwho had donned JULIA's skin to help her friend.\n\nThe two girls share a quick and joyous embrace and then run\nrapidly up the catwalk. The camera stays with LEVIATHAN.\n\nThe rumbling stops. And the mountainous BOX creaks into its final,\nsealed position.\n\n<b>FADE OUT\n</b>\n<b>FADE IN\n</b>\n\n<b>120   INT.  RECOVERY ROOM  DAY\n</b>\nCLOSE UP on a bowl of beautiful flowers, sitting on a shelf in\nthe recovery room.\n\nThe camera TRACKS out to let us see LARRY, pale, drawn, but\nbasically okay, in the room's single bad. He is wired up to\nvarious drips and monitors.\n\nSunlight is flooding into the room from a window and the camera\ncontinues its TRACK up to and through this window to;\n\n\n<b>121   EXT.   HOSPITAL MAIN ENTRANCE  DAY\n</b>\nKIRSTY is kissing TIFFANY on the cheek. TIFFANY is dressed in\nsmart clothes and has a small traveling bag in her hand.\n\n<b>                            KIRSTY\n</b>                  So. What're you going to do?\n                  Open up a games-shop somewhere?\n                  Sell jigsaw puzzles?\n\nTIFFANY gives a smile.\n\n<b>                            TIFFANY\n</b>                  Oh, yeah.\n\nThere is a slightly awkward pause.\n\n<b>                            KIRSTY\n</b>                  Well ... G'bye.\n\n<b>                            TIFFANY\n</b>                  It's been Hell.\n\nThey share a rueful knowing smile, like the smile of soldiers\nback from a war who say goodbye on a dockside and know they will\nnever meet again.\n\nTIFFANY turns and walks down the long path to the hospital gates.\nKIRSTY watches her for a few moments and then turns and re-enters\nthe institute.\n\nThe camera TRACKS back to the window of the RECOVERY ROOM and we\nwatch through the window as KIRSTY enters the room. She bends to\nkiss her father's cheek. LARRY slips an arm around her shoulders\nand they embrace. The camera moves away again.\n\n\n122   INT.   HALLWAY  MALAHIDE's HOUSE  DAY\n\nThe camera TRACKS slowly up MALAHIDE's hallway. The hallway is\nlined with packing cases filled with items from the house. A\nWORKMAN is shoving something into one of the cases. As the camera\nmoves past him, he speaks.\n\n<b>                            WORKMAN\n</b>                  So whose was all this shit?\n\nThe camera reaches the doorway of the OBSESSION ROOM as an\nanswering voice is heard.\n\n                            2nd. WORKMAN\n                  Not our problem...\n\nThe TRACK continues into -\n\n\n<b>123   INT.   OBSESSION ROOM  DAY\n</b><b>                    \n</b>and we see the 2nd. WORKMAN. He is crouching over the mattress\nwhich is still in the middle of the floor of the otherwise empty\nroom.\n\n                            2nd. WORKMAN\n                  ... Gimme a hand with this.\n\nAlmost faster than the eye can register it, a hand shoots out\nfrom the mattress and grabs his wrist.\n\nHe has about half a second to issue a strangled shout and then,\nhideously quickly, a matter of two seconds or so, his body is\ndrained of all life and the dried husk collapses to the floor.\n\nThe first WORKMAN appears hurriedly in the doorway and then\nfreezes, an awestruck expression on his face.\n\nJULIA is rising, headfirst and upright, from the centre of the\nmattress. The movement is smooth, magical, unsettling. It is\ngraceful but not slow.\n\nJULIA is fully fleshed, fully skinned, and fully dressed. She is\nin a replica of the dress MALAHIDE bought for her, but this one\nis jet black. She looks fabulous.\n\nAs the WORKMAN stands open-mouthed, her feet clear the mattress.\nBut they don't stop there. She slows to a graceful halt about six\ninches above the mattress. She stretches and flexes her arms\nsensually. Than her head swivels and her excited, aroused eyes\nmeet those of the WORKMAN.\n\n<b>                            JULIA\n</b>                  I'm Julia. Love me.\n\nSuddenly, her head tips back and, accompanied by JULIA's\ndelighted laughter, a wide beam of Hell's black light flies at\nthe ceiling from her open mouth. Instantaneously, it spills\nacross the ceiling and falls,like a fountain of blood, across the\nscreen.\n\n<b>COMPLETE BLACKNESS.\n</b>\n\n<b>THE CREDITS ROLL\n</b></pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Hellbound: Hellraiser II</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Peter Atkins\" title=\"Scripts by Peter Atkins\">Peter Atkins</a>  <a href=\"/writer.php?w=Clive Barker\" title=\"Scripts by Clive Barker\">Clive Barker</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Hellbound: Hellraiser II Script.html#comments\" title=\"Hellbound: Hellraiser II comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:07:11.826674"}