{"title": "Hellraiser 3: Hell on Earth", "film_link": "/Movie Scripts/Hellraiser 3: Hell on Earth Script.html", "script_link": "/scripts/Hellraiser-3-Hell-on-Earth.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Hellraiser 3: Hell on Earth Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Hellraiser-3-Hell-on-Earth.jpg\" title=\"Hellraiser 3: Hell on Earth Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Peter Atkins\" title=\"Scripts by Peter Atkins\">Peter Atkins</a><br/>  <a href=\"/writer.php?w=Tony Randel\" title=\"Scripts by Tony Randel\">Tony Randel</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/>\n<b>Script Date</b> : July 1991<br/>\n<b>Movie Release Date</b> : September 1992<br/>\n<br/>\n<a href=\"/scripts/Hellraiser-3-Hell-on-Earth.html\">Read \"Hellraiser 3: Hell on Earth\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>           \n<b>          \n</b><b>          \n</b><b>          \n</b><b>                          HELLRAISER III: HELL ON EARTH\n</b><b>          \n</b><b>          \n</b><b>          \n</b>                                   Written by\n<b>          \n</b>                                  Peter Atkins\n<b>          \n</b><b>          \n</b><b>          \n</b>                                Original Story by\n                           Peter Atkins &amp; Tony Randel\n<b>          \n</b><b>              \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b>          1st Draft  May 8 1991                 Bobbi Thomson\n          Revised   May 29 1991                 William Morris Agency\n          Revised  June 13 1991                 151 El Camino Drive\n          Revised  July 1 1991                  Beverly Hills CA 90212\n<b>          \n</b><b>          \n</b><b>                                                                      1\n</b><b>          \n</b><b>          EXT.   DERELICT STREET   TWILIGHT\n</b><b>          \n</b>          Night is falling in a forgotten part of the city.\n<b>          \n</b>          The street-lights are a joke - three out of four are dead.\n          Only a large moon and some cloud-streaked stars illuminate this\n          dark and derelict street.\n<b>          \n</b>          Once the hub of an industrial area, now the buildings are\n          abandoned, the sidewalks choked with litter and debris.  Stores\n          are boarded-up, windows are glassless, walls are graffitied.\n<b>          \n</b>          At various points, several BUMS warm their hands at trash-can\n          fires.\n<b>          \n</b><b>          ANGLE ON TWO BUMS\n</b><b>          \n</b>           - as their eyes move, following something moving down the\n          street.  Heard OFF is the sound of a smooth and powerful\n          engine.\n<b>          \n</b><b>          ANGLE ON STREET\n</b><b>          \n</b>          Down this boulevard of decay and despair drives an\n          incongruously expensive car - a Range Rover. A rich kid is\n          going shopping.\n<b>          \n</b>          The car cruises the ruins until it pulls up outside the only\n          open store on the block.\n<b>          \n</b><b>          ANGLE ON STORE\n</b><b>          \n</b>          A dim light bulb shines within - the only indicator that the\n          store is still trading.  Its windows are grimy, its door\n          defaced.  Above the door - barely legible through the accrued\n          dirt of city years - a sign; CARDUCCI'S ANTIQUES AND CURIOS.\n<b>          \n</b><b>          ANGLE ON CAR\n</b><b>          \n</b>          The side door opens - helped on its way by the kick of an\n          expensive leather boot - and JP MONROE steps out.\n<b>          \n</b>          JP is 24, rich, handsome, and spoiled. His hair is slick with\n          designer-grease, his slim frame is wrapped in a $600 leather\n          jacket.\n<b>          \n</b>          For a moment he surveys the store and casts contemptuous\n          glances up and down the ruined street.  He shows no anxiety at\n          being in this twilight part of town.  Cocooned in the\n          confidence of wealth, he's never felt threatened in his life.\n          Satisfied he's in the right place, he walks confidently through\n          the doorway.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      2\n</b><b>          \n</b><b>          INT.   CARDUCCI'S ANTIQUES   NIGHT\n</b><b>          \n</b>          The store itself looks like an antique - old wood panelling and\n          shelving, Victorian display cases, and faded wallpaper.  It is\n          grimy, dusty, and dimly-lit - and apparently unattended.\n<b>          \n</b>          It is packed with merchandise - shelves and aisles overflow\n          onto the floor making the place a maze to walk through.\n<b>          \n</b>          The stock is a strange surreal mix.  Discarded items from 50's\n          America (Norge fridges, toasters, Frankie Lymon albums) share\n          space with older items; framed pictures, Victorian automata,\n          wax dolls, and (a specialty of the store?) items of punishment;\n          stocks, iron boots, chastity belts, whips. Could that really\n          be an Electric Chair glimpsed in the shadowed back of the room?\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>          He wanders through the merchandise, casting appraising glances\n          at some items.  Some he even runs his hands over - grimacing at\n          the dust and grime they leave on his fingers.  But his manner\n          suggests he is looking for something specific.\n<b>          \n</b>          Near the room's center is an old hoarding from the dead days of\n          vaudeville and travelling shows.  It is tall and broad and is\n          leaning against something behind it.\n<b>          \n</b><b>          ANGLE ON HOARDING\n</b><b>          \n</b>           - which is colorfully and garishly decorated and full of\n          hyperbolic come-ons to long-dead punters:\n<b>          \n</b><b>          YOU WILL BE AMAZED! THEY SHOULDN'T BE ALIVE! FREAKS OF NATURE!\n</b><b>          AN EDUCATIONAL SHOW FOR ALL THE FAMILY PRESENTED UNDER THE\n</b><b>          AUSPICES OF PROFESSOR EMMANUEL BOCKLIN, TRAGEDIAN AND\n</b><b>          MENAGERIST.\n</b><b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>           - as he moves the hoarding aside.\n<b>          \n</b><b>                                     JP\n</b>                        Wow ...\n<b>          \n</b>          REVEALED is a six-foot tall black rectangular pillar, covered\n          in beautifully detailed 3-D carvings all in the same matt-black\n          finish as the pillar itself.  The pillar is extremely bizarre,\n          as if a New York avant-garde sculptor has interpreted a Totem\n          Pole for jaded modern tastes.  The carvings are of dead rats,\n          copulating skeletons,  filigree-patterned boxes, and faces.\n<b>          \n</b>          One of these faces - recognizable to the audience but not to JP\n          - is the ossified visage of PINHEAD, the demon from the first\n          two HELLRAISER pictures.\n<b>          \n</b><b>                                                                      3\n</b><b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>           - as he leans in to study this face, already fascinated by its\n          calm cruelty and promise of dark wisdom.\n<b>          \n</b>          A voice OFF startles him.\n<b>          \n</b><b>                                     BUM\n</b>                        You want it?\n<b>          \n</b>          JP whirls round in shock.  A BUM is standing close to him.\n<b>          \n</b><b>          ANGLE ON BUM\n</b><b>          \n</b>          He has long matted black hair and a similarly greasy beard.\n          His eyes are a piercing, excited blue.  Otherwise he is\n          indistinguishable from those we saw on the street outside \u0096\n          ragged, tatty clothes, features blackened with grime.\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>           - as he glances round the store and past the bum to the door\n          beyond; has this character just wandered in from the street?\n<b>          \n</b><b>                                     JP\n</b>                        Is it yours?\n<b>          \n</b><b>          ANGLE ON BOTH\n</b><b>          \n</b>          The Bum smiles, shaking his head knowingly.\n<b>          \n</b><b>                                     BUM\n</b>                        No.  Not mine.  Yours.\n<b>          \n</b>          JP nods, still a little uncertain.\n<b>          \n</b><b>                                     JP\n</b>                        How much do you want for it?\n<b>          \n</b><b>                                     BUM\n</b>                        Whatever you think its worth.\n<b>          \n</b>          JP digs a hand into his back pocket and pulls out a wad of\n          cash.  Without counting or checking, he proffers it.\n<b>          \n</b>          The Bum's hand flies out and siezes JP's, pressing the money\n          between their palms, making the exchange into a handclasp.\n<b>          \n</b>          In the background, OUT OF FOCUS, is Pinhead's face on the\n          pillar.\n<b>          \n</b><b>                                     BUM (OFF)\n</b>                        Enjoy ...\n<b>          \n</b><b>          \n</b><b>                                                                      4\n</b><b>          \n</b>          The FOCUS switches so that the hands in foreground BLUR and\n          Pinhead's frozen face becomes SHARP, as if he is silently\n          watching this deal take place.\n<b>          \n</b>          The Bum's hand moves away with the money as we\n<b>          \n</b><b>          FADE TO BLACK\n</b><b>          \n</b><b>          \n</b><b>          INT.   HOSPITAL EMERGENCY ROOM   NIGHT\n</b><b>          \n</b>          BLACKNESS.   Voice OVER.\n<b>          \n</b><b>                                     JOEY\n</b>                        It's a mystery to me ...\n<b>          \n</b>          SMASH-CUT to full-frame VIDEO IMAGE image of JOANNE\n          SUMMERSKILL, standing and looking directly into camera, as if\n          we are watching a TV broadcast.  In shot behind her is a quiet\n          hospital Emergency Room - no patients, no staff, just beds and\n          intensive-care equipment.\n<b>          \n</b>          Joanne - or JOEY, as she prefers to be called - is 23 years\n          old, an attractive and clever brunette, with a quiet sadness in\n          her eyes that she usually manages to keep almost hidden.\n<b>          \n</b>          Dressed in the stylish but sedate garb of a TV newsperson, she\n          holds a microphone marked with the logo of her station, W-QQY.\n<b>          \n</b>          Her direct address to the unseen TV camera continues.\n<b>          \n</b><b>                                     JOEY\n</b>                        Most nights this inner-city Emergency\n                        Room would be a chaos of blood and panic\n                        and grace under pressure.  But tonight,\n                        as you see, it's like Death took a\n                        holiday.  It's a mystery to me ... A\n                        mystery how those assholes at\n                        Assignments knew it.  This is Joey\n                        Summerskill for W-QQY.  Emergency Room.\n                        No story.  Really, really pissed off.\n<b>          \n</b>          Despite the nature of her last few words, Joey has ironically\n          kept up the manner and delivery of a newscaster.  Now, she\n          breaks mood, looks away from the camera, and, with a dismissive\n          wave of the hand, begins to walk out of shot.\n<b>          \n</b><b>                                     JOEY\n</b>                        Ah, break it down, Doc.  It's a bust.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>          \n</b>           - to reveal that we are not watching a broadcast at all but\n          are in the ER in real time.  As well as Joey, the room contains\n          her cameraman (\"DOC\" FISHER) and an ER NURSE.\n<b>                                                                      5\n</b><b>          \n</b>          Doc - a 45 year old with a weight problem, a nicotine\n          addiction, and a cynical attitude - lowers a shoulder-mounted\n          Video camera and watches Joey walk to a water-cooler against a\n          wall. His expression is a mix of exasperation and sympathy.\n<b>          \n</b>          The Nurse is a middle-aged woman of Asian ancestry.  She has a\n          puzzled expression as she addresses Doc.\n<b>          \n</b><b>                                     NURSE\n</b>                        She can talk like this on television?\n                        She can say this thing?  This assholes?\n<b>          \n</b>          Doc replies but keeps his eyes on Joey as he crosses to her.\n<b>          \n</b><b>                                     DOC\n</b>                        No sweat, sweetheart.  It's for the\n                        European satellite ....  Joey; rein it\n                        in, kid.  They couldn't've known.\n<b>          \n</b>          Joey sucks angrily at water from a paper-cup and then crushes\n          and bins the cup like an act of revenge.\n<b>          \n</b><b>                                     JOEY\n</b>                        I know.  I know.  But it's just so ...\n                        neat, isn't it?  The first gig that\n                        isn't cute kids or diet gurus and it's\n                        taken away from me.\n<b>          \n</b><b>                                     DOC\n</b>                        Yeah, well like you said - it's a\n                        mystery.  But that's all it is.\n                        Mystery.  Not malice.  What, you think\n                        the station paid off every accident\n                        victim in the city to ... ?\n<b>          \n</b>          Doc is interrupted by the RINGING of a cell-phone he has\n          holstered at his waist.  He picks it up.\n<b>          \n</b><b>                                     DOC\n</b>                        Speak.\n<b>          \n</b><b>                                     CELLPHONE\n</b>                        Doc.  24th and Cedar.  Fast.  Hostage\n                        situation.\n<b>          \n</b><b>                                     DOC\n</b>                        OK.  Listen - Joey's here.  Shall ...\n<b>          \n</b><b>                                     CELLPHONE\n</b>                        No need.  Martin's already there.\n                        Hurry.  You've got ambulances to beat.\n<b>          \n</b>          The line goes dead.  Doc looks at Joey.  She heard it all.  He\n          shrugs apologetically.\n<b>          \n</b><b>                                                                      6\n</b><b>          \n</b><b>                                     JOEY\n</b>                        Better hurry, Doc.  A real story.  With\n                        a real reporter.\n<b>          \n</b><b>                                     DOC\n</b>                        Joey ....  Look, you wanna ride?  I can\n                        go by your place.\n<b>          \n</b><b>                                     JOEY\n</b>                        You'd lose the money-shots.  No.  I'll\n                        catch a bus.  Or a cab.  Don't worry\n                        about it.  Go.\n<b>          \n</b><b>                                     DOC\n</b>                        OK.  Be careful.  And lighten up.  Story\n                        of your life could be right round the\n                        corner.\n<b>          \n</b><b>                                     JOEY\n</b>                        That is the story of my life.\n<b>          \n</b>          With a rueful smile, Joey watches Doc leave.\n<b>          \n</b>          Joey and the Nurse exchange glances - Joey's impassive but\n          vaguely friendly, the Nurse's a little disapproving; if the\n          camera's gone, what the hell are YOU still doing here?\n<b>          \n</b><b>          \n</b><b>          INT.   HOSPITAL CORRIDOR   NIGHT\n</b><b>          \n</b>          Joey makes her solitary way along a medium-length corridor\n          that has two sets of double swing doors at either end, one set\n          giving on to the ER, the other toward an exit.  Joey is heading\n          for the latter, her mood sad and defeated.\n<b>          \n</b><b>          ANGLE ON EXIT DOORS\n</b><b>          \n</b>          Suddenly - SMASH! - the doors burst open from the other side.\n<b>          \n</b><b>          ANGLE ON CORRIDOR\n</b><b>          \n</b>          The mood is suddenly fast and urgent as a gurney is wheeled\n          rapidly through the doors.\n<b>          \n</b>          Two PARAMEDICS, both male, both about Joey's age, are pushing\n          the gurney at a run and talking rapidly to each other.  They\n          completely ignore Joey and also ignore the TEENAGE GIRL who is\n          running beside the gurney.\n<b>          \n</b>          The girl - TERRI - is 18 or 19.  She is a pale-faced blonde\n          dressed as if for a Desperately-Seeking-Susan party and is\n          keeping up a stream of chatter as if rehearsing excuses.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      7\n</b><b>          \n</b>          As Joey flattens herself against the corridor wall to let them\n          pass, it is neither the paramedics nor Terri that get her\n          attention.  It is the BOY on the gurney.\n<b>          \n</b><b>          ANGLE ON GURNEY/BOY\n</b><b>          \n</b>          The teenage boy lies flat on his back semi-conscious, his\n          eyelids fluttering, his breathing shallow.\n<b>          \n</b>          Horribly, shockingly, dangling from his face and body are long,\n          heavy chains that drag and rattle along the corridor floor.\n          There are at least sixteen of them and they seem firmly buried\n          in his skin.\n<b>          \n</b><b>          ANGLE ON CORRIDOR\n</b><b>          \n</b>          The DIALOGUE as the gurney is rushed to the ER doors is RAPID-\n          FIRE and OVERLAPPED, the Paramedics responding only to each\n          other and ignoring the two girls comments and questions.\n<b>          \n</b><b>                                     TERRI\n</b>                        It wasn't my fault.  It wasn't my fault.\n<b>          \n</b><b>                                     PARAMEDIC 1\n</b>                        10 milligram IV Valium stat.  How the\n                        fuck did this happen ... ?!\n<b>          \n</b><b>                                     TERRI\n</b>                        It was outside.  I wasn't even with him.\n<b>          \n</b><b>                                     PARAMEDIC 2\n</b>                        You ever see anything like this before?\n<b>          \n</b><b>                                     TERRI\n</b>                        He must have stolen it.\n<b>          \n</b><b>                                     JOEY\n</b>                        What's going on?\n<b>          \n</b><b>                                     PARAMEDIC 1\n</b>                        Yeah, sure.  Five times a fucking day.\n                        Just push!\n<b>          \n</b>          Once the gurney has passed her, Joey runs along behind it.\n<b>          \n</b><b>                                     TERRI\n</b>                        It was off the statue.  In the club.\n<b>          \n</b><b>                                     JOEY\n</b>                        What happened to him?\n<b>          \n</b><b>                                     PARAMEDIC 2\n</b>                        Think they'll get him back?\n<b>          \n</b><b>          \n</b><b>                                                                      8\n</b><b>          \n</b><b>                                     TERRI\n</b>                        It's nothing to do with me.\n<b>          \n</b><b>                                      PARAMEDIC 1\n</b>                        Worst case of status I've seen.  Even\n                        money at best.\n<b>          \n</b>          The foot of the gurney slams into the ER doors and the\n          Paramedics slide it rapidly through.\n<b>          \n</b><b>                                     JOEY\n</b>                        Wait!  I'm a reporter!  Tell me where he\n                        was ...\n<b>          \n</b><b>          ANGLE ON ER THROUGH DOORS\n</b><b>          \n</b>          The Nurse and a middle-aged DOCTOR are seen through the doors\n          preparing emergency equipment.  The Doctor already has\n          fibrillator pads in his hands.\n<b>          \n</b>          The Paramedics follow the gurney through and, turning rapidly,\n          push the doors closed from the inside.\n<b>          \n</b><b>          ANGLE ON CORRIDOR\n</b><b>          \n</b>          Joey and Terri are alone, excluded from the ER activity. Joey\n          turns to speak but Terri is already halfway to the other doors.\n<b>          \n</b>          Joey runs after her.\n<b>          \n</b><b>                                     JOEY\n</b>                        Hold on.  Hold on, please.  I need\n                        talk to you.\n<b>          \n</b><b>                                     TERRI\n</b>                               (over her shoulder)\n                        It's nothing to do with me.  I wasn't\n                        even with him.\n<b>          \n</b>          Joey catches up with her a couple of yards short of the doors.\n          She grabs at her arm to slow her down.\n<b>          \n</b>          Terri turns, snatching her arm away in a sudden moment of fierce\n          anger.  She backs toward the doors, making gestures of\n          dismissal and denial with her hands.\n<b>          \n</b><b>                                     TERRI\n</b>                        Look, lady!  I told you!  It's not my\n                        problem!  I was just there!\n<b>          \n</b><b>                                     JOEY\n</b>                        Where?\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      9\n</b><b>          \n</b><b>                                     TERRI\n</b>                        Under The Underground.  Can I like GO\n                        now?!\n<b>          \n</b><b>                                     JOEY\n</b>                        Under the Underground?  What's that?\n                        Where is ...\n<b>          \n</b>          Suddenly, the conversation is interrupted by a shatteringly\n          loud SCREAM, agonized and terrified, coming from the ER.\n<b>          \n</b>          Both girls freeze but then their reactions are very different:\n          Joey turns instantly and runs back toward the ER.  Terri\n          watches her for a beat and then heads through the other doors.\n<b>          \n</b>          The SCREAM continues, a howling horrible sound.\n<b>          \n</b>          Joey reaches the ER doors and throws them open.  And freezes in\n          terrified shock.\n<b>          \n</b><b>          \n</b><b>          INT.  EMERGENCY ROOM   NIGHT\n</b><b>          \n</b><b>          THE DOCTOR\n</b><b>          \n</b>           - is on the floor, as if flung there by some powerful force.\n          The fibrillator pads are still in his hands and his expression\n          is awe-struck and disbelieving.\n<b>          \n</b><b>          THE NURSE\n</b><b>          \n</b>           - is cowering behind a mobile tray of surgical instruments,\n          muttering to herself and making the gesture of the cross.\n<b>          \n</b><b>          THE TWO PARAMEDICS\n</b><b>          \n</b>           - are flattened against the far wall, terror on their faces.\n<b>          \n</b><b>          ANGLE ON TABLE\n</b><b>          \n</b>          The Boy is on the emergency table.  It's him that's screaming.\n          His body is arched tight in shock, eyes and mouth wide open.\n<b>          \n</b>          He's wired up to an ECG and the MONITOR shows a heartbeat that\n          should be measured on the Richter scale.\n<b>          \n</b>          The chains - all still connected to his face and his body \u0096 are\n          rigid and tight, being pulled straight up into the air as if\n          tugged taut by invisible hands.\n<b>          \n</b>          The boy's skin is stretched and pulled at those points where\n          the chains are connected to him and it seems horribly possible\n          that his flesh will burst if the pressure continues.\n<b>          \n</b><b>          \n</b><b>                                                                      10\n</b><b>          \n</b>          The scene is held for a terrible frozen moment.  Then suddenly\n          the chains drop, the scream stops, and the boy's body slumps.\n<b>          \n</b>          There is a massive ELECTRICAL SURGE.  The ECG flat-lines before\n          it and the other monitors go haywire, sparking and spluttering.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>          \n</b>          The lights in the room flicker and strobe.\n<b>          \n</b>          The fibrillator pads arc angrily. The Doctor flings them away.\n<b>          \n</b>          ELECTRIC ENERGY seems to run along the slumped chains and they\n          disappear as if dissolved in some impossible electric meltdown.\n<b>          \n</b>          Lighting and machinery return to normal (ECG still flat-lining)\n          and the medical staff stare thunder-struck at the dead boy.\n<b>          \n</b>          For the first time, the other people in the ER become aware of\n          Joey's presence in the doorway.\n<b>          \n</b><b>                                     DOCTOR\n</b>                        Who's that?  Get her out of here!\n<b>          \n</b>          The Nurse heads for the doors.  Joey is already backing away.\n<b>          \n</b><b>          ANGLE THROUGH DOORS INTO CORRIDOR\n</b><b>          \n</b>           - as Joey backs away, an expression of numbed shock on her\n          face.  The doors close over, blocking her out.\n<b>          \n</b><b>          ANGLE ON FIBRILLATOR PADS\n</b><b>          \n</b>           - still arcing.\n<b>          \n</b><b>          CROSS-FADE TO\n</b><b>          \n</b><b>          \n</b><b>          INT.   CROSS-TOWN BUS    NIGHT\n</b><b>          \n</b>          CLOSE on flickering neon light in the bus cabin.\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b>           - glancing at the light from her seat.\n<b>          \n</b><b>          JOEY'S POV - VARIOUS ANGLES\n</b><b>          \n</b>          The bus is almost deserted.  Three other passengers - A PUNK, A\n          BAG LADY, and A WINO - are spread out around the interior.  All\n          seem lost in worlds of their own but their vacant alienated\n          stares highlight Joey's isolation and tension.  Fear has\n          entered her life.\n<b>          \n</b><b>          \n</b><b>                                                                      11\n</b><b>          \n</b>          The bus moves through the neon-lit loneliness of downtown\n          streets.\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b>           - her face, lit by reflected store-signs and street-lights, is\n          lost and distant, as if she is submerged in some dream-sea of\n          memory and sadness.\n<b>          \n</b><b>          INT.   TV STATION, EDITING SUITE   DAY\n</b><b>          \n</b>          A wall of TV monitors, each monitor showing Joey sitting on a\n          couch with a painfully thin older woman - BRITTANY VERTUE.\n<b>          \n</b>          Brittany's probably 50 but her face is as tight and smooth as\n          surgery can make it.  She is dressed in the standard uniform of\n          the health-avatar; brightly-colored leotard over black tights.\n<b>          \n</b>          Joey has a big paperback book - BEYOND HUNGER; THE BRITTANY\n          VERTUE GUIDE TO HOLISTIC DIETING - which she holds to camera.\n          She smiles and, turning to face Brittany, crosses her legs.\n<b>          \n</b>          The image freezes.  And replays.  Joey crosses her legs again.\n          And again.  And again.\n<b>          \n</b><b>                                     BRAD\n</b>                                    (over)\n                        See?  This is what I mean.  Your\n                        technique is all wrong.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>          \n</b>          Joey (in real time) is sitting in an easy chair in the editing\n          suite looking at the wall of monitors.\n<b>          \n</b>          BRAD, a techie in his late-twenties, and DOC FISHER are in\n          swivel chairs immediately in front of the video console.\n<b>          \n</b>          All three are drinking coffee.  Doc is smoking a cigarette.\n<b>          \n</b><b>                                     JOEY\n</b>                                  (guardedly)\n                        What do you mean?\n<b>          \n</b><b>                                     BRAD\n</b>                        I mean hardly any thigh.  I'm telling\n                        you, Joey; shorter skirt, more lift on\n                        the leg-cross ... and you're made.\n<b>          \n</b>          Doc chuckles in a half-friendly, half-sleazy way.\n<b>          \n</b><b>                                     JOEY\n</b>                        Fuck you.\n<b>          \n</b><b>          \n</b><b>                                                                      12 \n</b><b>          \n</b><b>                                     BRAD\n</b>                        What, you think I'm kidding?  I\n                        guarantee it.  An inch more flank.  Boys\n                        upstairs get hot.  Bingo, you're an\n                        anchor-woman.\n<b>          \n</b><b>                                     JOEY\n</b>                                 (to herself)\n                        Jesus Christ ...\n<b>          \n</b><b>                                     DOC\n</b>                        Ah, give her a break.\n<b>          \n</b>          Doc leans over and stops the tape.\n<b>          \n</b><b>                                     BRAD\n</b>                                   (to Doc)\n                        What's with you?\n<b>          \n</b>          He swivels his chair round to face Joey.\n<b>          \n</b><b>                                     BRAD\n</b>                        C'mon, Joey.  I'm just trying to help\n                        you hit a home run here.\n<b>          \n</b><b>                                     JOEY\n</b>                        Yeah?  Well, you just struck out.  It\n                        may be a surprise to you, Brad, but I\n                        want to do it the right way.  Not tight\n                        skirts.  Tight stories.\n<b>          \n</b><b>                                     BRAD\n</b>                        Right.  Like last night's doozie.\n<b>          \n</b><b>                                     JOEY\n</b>                        I know what I saw.\n<b>          \n</b><b>                                     BRAD\n</b>                        And I believe what you say.  But this is\n                        TV.  No pictures, no story.\n<b>          \n</b><b>                                     DOC\n</b>                        Yeah, too bad I had to go and ...\n<b>          \n</b><b>                                     BRAD\n</b>                        ... and cover something on Planet Earth.\n                        See, you gotta remember, Joey; this is a\n                        LOCAL station.  As in local to this\n                        galaxy.\n<b>          \n</b>          Joey slams her coffee mug down and stands up.\n<b>          \n</b><b>                                     JOEY\n</b>                        There's a story out there.\n<b>          \n</b><b>                                                                      13\n</b><b>          \n</b><b>                                     BRAD\n</b>                               (jumping in warningly)\n                        Not on station time.\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  Not on station time.  My story.  My\n                        time.\n<b>          \n</b>          Joey exits.  Brad watches her leave with a half-smile on his\n          face then turns to Doc.\n<b>          \n</b><b>                                     BRAD\n</b>                        Lot of attitude there, Doc ...\n<b>          \n</b>          He starts up the video tape again and, on the monitors, Joey\n          once again crosses her legs on the couch.\n<b>          \n</b><b>                                     BRAD\n</b>                        ... but great legs.\n<b>          \n</b><b>          \n</b><b>          INT.   UNDER THE UNDERGROUND   NIGHT\n</b><b>          \n</b>          CLOSE on a screaming male face, twisted as in pain or fury.\n<b>          \n</b>          PULL BACK rapidly to REVEAL the face belongs to the lead singer\n          of THANATOS.  He is on a nightclub stage with the rest of the\n          band, all of them dressed in that shit-poor-white-trash-on-dope\n          look favored by all such rich young businessmen with guitars.\n<b>          \n</b>          A tatty banner across the back of the stage proclaims: UNDER\n<b>          THE UNDERGROUND PRESENTS THANATOS.\n</b><b>          \n</b>          The SCREAM ends, replaced with the roaring thunder of drums and\n          guitars as Thanatos kick into some thrash-metal.\n<b>          \n</b>          The dance-floor of the club is packed with KIDS dancing to the\n          incredibly fast, incredibly loud music.\n<b>          \n</b>          Many of the kids favor the same look as the band but it's not\n          exclusive; college types are there too, along with some \u0096 male\n          and female - sporting the glitz-meets-sleaze look of Terri.\n<b>          \n</b>          The club itself is of course dimly-lit and the basic decor is\n          black.  Where it is distinguished from hundreds of others is in\n          the bizarre sculptures and pieces of artwork that hang from the\n          ceiling and walls, all in tones of black, silver and gray:\n<b>          \n</b><b>          VARIOUS ANGLES ON SCULPTURES\n</b><b>          \n</b>          A headless, armless torso wrapped in barbed wire.\n<b>          \n</b>          A pair of male and female heads.  Bonsai-like trees grow out of\n          every orifice - eye-sockets, nostrils, ears, and mouths.\n<b>          \n</b><b>                                                                      14\n</b><b>          \n</b>          A human arm with the skin and flesh of its upper half peeled\n          open and pinned out to reveal inside - instead of bone and\n          sinew - an entire miniature metropolis, beautifully detailed.\n<b>          \n</b>          A black bird cage containing a fetal skeleton.\n<b>          \n</b><b>          VARIOUS ANGLES ON CLUB\n</b><b>          \n</b>          Kids also crowd the bar and the tables on the outskirts of the\n          dance floor.  It is a hot, sweaty, faintly aggressive\n          atmosphere - people jostling for position, shouting to be\n          heard, etc etc.\n<b>          \n</b>          The camera finds Joey - incongruous by dress and demeanor \u0096\n          pushing her way among the crowd.\n<b>          \n</b>          The music is too loud and overpowering to hear Joey's voice but\n          it is clear as she moves through the confines of the club that\n          she is approaching various people and enquiring after Terri.\n<b>          \n</b><b>          FOUR KIDS AT A TABLE\n</b><b>          \n</b>          - shake their heads and shrug.\n<b>          \n</b><b>          A PUNK\n</b><b>          \n</b>          - stares blankly and blinks.\n<b>          \n</b><b>          TWO BIMBOS\n</b><b>          \n</b>          - giggle, purse their lips, shake their heads.\n<b>          \n</b><b>          JOEY\n</b><b>          \n</b>           - catches sight of a blonde figure moving across the dance\n          floor and pushes through the crowd to follow.  She taps the\n          figure's arm but, as it turns, she realizes it is a man \u0096 some\n          70's revivalist GLITTER-ROCKER.  He looks quizzically at her.\n<b>          \n</b>          Joey's mouth moves and this time she seems to get some\n          response.  The Glitter-Rocker mouths a name.\n<b>          \n</b>          Joey can't hear him.  She hands him a business card and a pen.\n<b>          \n</b>          He scrawls a name on the back of the card and Joey nods her\n          thanks as he moves on.\n<b>          \n</b><b>          CLOSE ANGLE ON CARD\n</b><b>          \n</b>           - as Joey reads the name \"Terri\" on it.  She flips the card to\n          reveal her name and number and writes \"Terri - Please call!\".\n<b>          \n</b><b>          ANGLE ON BAR\n</b><b>          \n</b><b>          \n</b><b>                                                                      15\n</b><b>          \n</b>           - as Joey pushes to the counter and hands the card to a BARMAN\n          who looks at it, nods, and puts it beneath the counter.\n<b>          \n</b><b>          ANGLE ON EXIT\n</b><b>          \n</b>           - as Joey makes her way out.\n<b>          \n</b><b>          ANGLE ON DANCE FLOOR\n</b><b>          \n</b>          Camera moves into the tightly-packed throng on the dance floor,\n          making its way slowly toward the previously unseen center.\n<b>          \n</b>          The crowd parts slightly to reveal, in the direct center of the\n          floor, the tall black pillar from the opening sequence.\n<b>          \n</b>          The pillar is mounted on a plinth and spins as the clientele\n          dance around it.  It seems very in keeping with the decor of\n          the club but even so it is a strong unsettling presence.\n<b>          \n</b>          The pillar has been mounted upside down, so that it looks even\n          odder than our first glimpse of it.  Near the bottom the\n          inverted face of Pinhead, black and frozen, can be seen.\n<b>          \n</b>          The camera begins to spin around the pillar in contrary motion\n          to the pillar's own movement and, as it does so, draws closer\n          and closer making for a disorienting, vertiginous image.\n<b>          \n</b>          As this happens, the raucous sound of the band Thanatos begins\n          to fade into a whirl of ECHO and to be replaced by a whirring,\n          spinning, sound which we only recognize fully as we\n<b>          \n</b><b>          CUT TO\n</b><b>          \n</b><b>          \n</b><b>          EXT.   DENSE JUNGLE   DAY     (JOEY'S DREAM)\n</b><b>          \n</b>          The screen is filled with dense jungle foliage.\n<b>          \n</b>          The chugging spinning sound is now identifiable as the sound of\n          Helicopter blades, one element of a SOUND MONTAGE conveying the\n          sense and feel of a Jungle War; Helicopters in flight, machine\n          gun fire, distant explosions, confused shouts and cries.\n<b>          \n</b>          A POV camera pushes its way through the lush, humid greenery.\n<b>          \n</b>          The camera seems to be searching for something, glancing this\n          way and that, shoving leaves and tall grass aside.\n<b>          \n</b>          Voices begin to emerge clearly from the SOUND MASS off-screen\n          as if the unseen seeker is getting nearer to his or her goal.\n<b>          \n</b><b>                                     SOLDIER 1\n</b>                                   (off)\n                        Call for a Medi-Vac!\n<b>          \n</b><b>                                                                      16\n</b><b>          \n</b><b>                                     SOLDIER 2\n</b>                                   (off)\n                        Don't die, man!  Don't fucking die!\n<b>          \n</b>          The dialogue prompts a more furious effort on the part of the\n          POV camera.  Pushing frantically through the obscuring foliage,\n          it finally gains a clearer view and stops, looking ahead.\n<b>          \n</b>          In a tiny clearing, ten feet from the camera, still partially\n          obscured by the jungle, two camouflage-clad SOLDIERS lean over\n          the prone body of a third.  It is unclear due to distance but\n          there is a lot of blood on the Soldier's body and uniform.\n<b>          \n</b>          A new sound joins the SOUND MONTAGE - a persistent, rhythmic,\n          ringing sound.  The other elements die away until only this is\n          left and we recognize it as the sound of a telephone as we\n<b>          \n</b><b>          CUT TO\n</b><b>          \n</b><b>          \n</b><b>          INT.   BEDROOM, JOEY'S APARTMENT   NIGHT\n</b><b>          \n</b>          Joey jerks upright in bed as the ringing continues.  Confused\n          and disoriented, her eyes fly around her darkened bedroom as if\n          she's trying to understand where she is and what is happening.\n<b>          \n</b>          Finally, she registers the phone and leans toward her bedside\n          table to pick it up.\n<b>          \n</b><b>          ANGLE ON BEDSIDE TABLE\n</b><b>          \n</b>           - favoring the luminous display of an alarm clock next to the\n          phone.  Its warm green figures show the time is 2:35.\n<b>          \n</b><b>                                     JOEY\n</b>                               (off. Sleepily)\n                        God.  This better be birth, marriage, or\n                        death ...\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b>           - as she picks up the handset and puts it to her ear.\n<b>          \n</b><b>                                     JOEY\n</b>                        Uh-huh?\n<b>          \n</b><b>                                     TERRI\n</b>                               (on phone)\n                        Uh ... Hi!  Is this ... er ... Joanne\n                        Summerskill?\n<b>          \n</b><b>                                     JOEY\n</b>                        Joey.  Yeah, who is this?\n<b>          \n</b><b>          \n</b><b>                                                                      17\n</b><b>          \n</b><b>                                     TERRI\n</b>                        You like ... left me a card?  At the\n                        club?\n<b>          \n</b><b>                                     JOEY\n</b>                        Right.  Right!\n<b>          \n</b>          Joey swings out of bed to sit on the edge, much more alert now.\n<b>          \n</b><b>                                     TERRI\n</b>                        Right ... So ... Well, what do you want?\n<b>          \n</b><b>                                     JOEY\n</b>                        I want to talk to you.  We met ... now,\n                        listen, don't hang up, OK? ... We met at\n                        the hospital last night.\n<b>          \n</b><b>                                     TERRI\n</b>                        Oh yeah.  Yeah.  Well ... Look, I'll\n                        make a deal with you ... My boyfriend\n                        threw me out, right?  I'll trade you.\n                        You give me couch-space.  I'll give you\n                        talk.  OK?\n<b>          \n</b>          Joey can't resist another glance at the clock.\n<b>          \n</b><b>                                     JOEY\n</b>                        Yeah.  Sure.  You mean ... tonight?\n<b>          \n</b><b>                                     TERRI\n</b>                               (Surprised at Joey's surprise.\n                                Bit of a culture clash here)\n                        Of course tonight.  Is that a problem?\n                        Like, if you've got a guy there or\n                        something ...\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  No.  It's fine.  Come now.  I was\n                        having bad dreams anyway.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.    NIGHT\n</b><b>          \n</b>          CLOSE on the front door of the apartment as it opens to reveal\n          Terri leaning against the doorframe.\n<b>          \n</b>          Clad identically to how we last saw her, Terri clutches a well-\n          stuffed leather bag, containing all her worldly possessions.\n<b>          \n</b><b>                                     TERRI\n</b>                        Hi.  How're you doing?\n<b>          \n</b>          Not waiting for either reply or invitation, she moves forward.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>                                                                      18\n</b><b>          \n</b>           - as Terri walks past the dressing-gowned Joey and heads\n          straight for Joey's sofa and sprawls on it, laying her bag on\n          the floor beside her.\n<b>          \n</b><b>                                     TERRI\n</b>                        You got anything to drink?\n<b>          \n</b>          Joey closes the door, raised eyebrows registering her slight\n          disapproval at Terri's cavalier attitude.  Her voice, however,\n          is polite.\n<b>          \n</b><b>                                     JOEY\n</b>                        I put some decaf on.  Er ... make\n                        yourself comfortable.\n<b>          \n</b><b>                                     TERRI\n</b>                        Right.\n<b>          \n</b>          Joey walks past Terri and through to her kitchen, from where we\n          hear the sound of COFFEE BEING POURED.\n<b>          \n</b>          Terri looks around at Joey's room.\n<b>          \n</b><b>          VARIOUS ANGLES ON ROOM\n</b><b>          \n</b>          The large and spacious room suggests that even if Joey is\n          dissatisfied with her job she's at least being paid enough to\n          make it bearable.  The room is very ordered, very neat, but\n          stops short of being prissy.\n<b>          \n</b>          A very large picture window takes up all of one wall.  At the\n          moment of course the drapes are closed.  Another wall is taken\n          up by a huge shelf unit packed with books, videos, and CDs.\n          Joey's obsession with \"getting the whole story\" seems to be\n          true of her personal life as well as her professional.\n<b>          \n</b><b>          ANGLE ON TERRI\n</b><b>          \n</b>           - having finished her quick examination, she calls out.\n<b>          \n</b><b>                                     TERRI\n</b>                        So ... what was your bad dream?\n<b>          \n</b>          Joey re-enters, carrying two mugs of coffee.\n<b>          \n</b><b>                                     JOEY\n</b>                        What?\n<b>          \n</b><b>                                     TERRI\n</b>                        Your dream.  You said you were having a\n                        bad dream.\n<b>          \n</b><b>                                     JOEY\n</b>                        Oh yeah ...\n<b>          \n</b><b>                                                                      19\n</b><b>          \n</b>          She hands one coffee to Terri and sits opposite her.\n<b>          \n</b><b>                                     JOEY\n</b>                        ... well, I've been having it for years.\n                        It's not a nightmare or anything.  It's\n                        ... well, I know what it is.\n<b>          \n</b><b>                                     TERRI\n</b>                        What is it?\n<b>          \n</b><b>                                     JOEY\n</b>                        Why are you so interested?\n<b>          \n</b><b>                                     TERRI\n</b>                        Sorry.\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  No, it's OK.  I ... It's my father.\n<b>          \n</b><b>                                     TERRI\n</b>                               (sympathetic, knowing)\n                        Oh, right.  Did he used to ... ?\n<b>          \n</b><b>                                     JOEY\n</b>                        God, no!  Nothing like that.  No, he\n                        died before I was born.  He died in\n                        Vietnam.  I never knew him.  Never met\n                        him.  We don't even know the details.  I\n                        dream of battlefields.  Of searching.\n                        Of trying to find out.\n<b>          \n</b><b>                                     TERRI\n</b>                        That's great.\n<b>          \n</b><b>                                     JOEY\n</b>                        What?\n<b>          \n</b><b>                                     TERRI\n</b>                        No ... I mean, it's not like great about\n                        your dad or anything.  It's just I don't\n                        dream.  Never have.  ... Maybe it'd help\n                        if I slept sometime ... Just kidding ...\n                        No, so it's always neat for me to hear\n                        about dreams.  I'm jealous.  It's like\n                        everybody has another world except me.\n                        You know what I mean?\n<b>          \n</b><b>                                     JOEY\n</b>                        I know what you're saying but ... Never?\n                        You've never had a dream?  No, you know,\n                        you do.  You must.  What you mean is you\n                        don't remember them.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      20\n</b><b>          \n</b><b>                                     TERRI\n</b>                        Whatever.  All I know is - this is it\n                        for me.  Just me, my bag, and a series\n                        of shithead boyfriends.  It'd be good to\n                        see something else.  Have a nighttime\n                        life.  Be somebody different.\n<b>          \n</b>          Terri pauses, then smiles like she's just realized something.\n<b>          \n</b><b>                                     TERRI\n</b>                        Hey ... this is great, isn't it?  Just\n                        girls talking.  Like having a\n                        conversation?  Good coffee.  You got a\n                        cigarette?\n<b>          \n</b>          Joey waits, letting herself catch up with Terri's good-natured\n          but marginally strung-out personality.  She looks around the\n          room as if trying to remember where there are cigarettes.\n<b>          \n</b><b>                                     JOEY\n</b>                        Uh ...  yeah.  Yeah, somewhere.  Wait a\n                        minute.\n<b>          \n</b>          Joey crosses to the big shelf-unit and pulls out a concealed\n          pack of cigarettes, a Zippo lighter, and an ashtray from behind\n          a shelf of videos.  We notice that the videos are THE WORLD AT\n          WAR, volumes 1 thru 26.  She brings the smokes to Terri.\n<b>          \n</b><b>                                     TERRI\n</b>                        Great.  Thanks.  You gonna have one?\n<b>          \n</b><b>                                     JOEY\n</b>                        I'm trying to quit.\n<b>          \n</b><b>                                     TERRI\n</b>                        Oh, go on.  Have one.  Fuck it.  You\n                        think you're going to live forever?\n<b>          \n</b>          She smiles and proffers the pack to Joey who shrugs, smiles,\n          and takes one.  Terri picks up the Zippo and sparks it. A huge\n          FLAME leaps out of the lighter, producing an instant of terror\n          from Terri.  Joey pulls the lighter back from Terri and closes\n          the lid extinguishing the flame.  Terri draws a book of matches\n          from her pocket shakily attempts to light her cigarette.\n<b>          \n</b><b>                                     JOEY\n</b>                        Sorry.  It was my father's.  It's\n                        temperamental.\n<b>          \n</b><b>                                     TERRI\n</b>                        It's okay.  It's just someone burned me\n                        once.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      21\n</b><b>          \n</b>          Joey takes the book of matches from Terri's hands and lights\n          both cigarettes.  Terri takes a long, fearful look at the\n          burning flame and then takes a deep, calming drag of her\n          cigarette.\n<b>          \n</b><b>                                     TERRI\n</b>                        Wanna know how I look at it?  Way I see\n                        it is ... you give up, right?  Three\n                        days later, you get hit by a fucking\n                        truck and you know - you just KNOW \u0096\n                        that your last thought as you go under\n                        those wheels'd be \"Jesus H. Christ, I\n                        coulda smoked another three packs!\"\n<b>          \n</b>          She lays the book of matches down.  Joey's eyes go to them.\n<b>          \n</b><b>          ANGLE ON MATCHES\n</b><b>          \n</b>          Black letters on the dark-grey cover: UNDER THE UNDERGROUND.\n<b>          \n</b><b>          ANGLE ON JOEY AND TERRI\n</b><b>          \n</b>          Terri's eyes flick to the match-book and her mood changes,\n          becoming subdued and a little sullen.\n<b>          \n</b><b>                                     TERRI\n</b>                        Oh.  You wanna talk about that stuff.\n<b>          \n</b><b>                                     JOEY\n</b>                        Yes I do.  Terri, something awful\n                        happened to that boy.  I have to find\n                        out what it was.\n<b>          \n</b><b>                                     TERRI\n</b>                        But I don't know anything!  Really.  I\n                        just came out of the club and the kid\n                        was already in the street.  He ...\n<b>          \n</b><b>                                     JOEY\n</b>                        Did you know him?\n<b>          \n</b><b>                                     TERRI\n</b>                        No.  I'd seen him in there a few times\n                        before.  He was just a punk.  I'd never\n                        like danced with him or anything.\n                        Anyway, he was a thief.  He must've\n                        taken it from the statue.\n<b>          \n</b><b>                                     JOEY\n</b>                        Taken what?\n<b>          \n</b><b>                                     TERRI\n</b>                        The thing!  He was lying there in the\n                        street, moaning.  But he pointed at it\n<b>                        ...\n</b><b>                                                                      22\n</b><b>          \n</b><b>                                     JOEY\n</b>                        Wait a minute.  He was already ...\n                        wounded ... when you found him?\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah!  That's what I'm saying!  And it\n                        was lying next to him.  And he pointed\n                        at it before he passed out and ...\n<b>          \n</b><b>                                     JOEY\n</b>                        Wait.  Wait.  The chains.  Where did the\n                        chains come from?\n<b>          \n</b><b>                                     TERRI\n</b>                        That's what I'm trying to tell you! ...\n<b>          \n</b>          Terri rummages in her bag, getting hold of something.\n<b>          \n</b><b>                                     TERRI\n</b>                        He said they came out of this.\n<b>          \n</b>          She holds her hand out and the camera TRACKS in to meet it.\n<b>          \n</b><b>          ANGLE ON TERRI'S HAND/BOX\n</b><b>          \n</b>          Resting on her palm is a black cube about 4 inches square.  It\n          has the same matt-black carbonized look as the pillar and is\n          recognizable as one of the \"carvings\" we saw on it.\n<b>          \n</b>          There is fine filigree pattern-work over each of its surfaces\n          and, to audiences familiar with the HELLRAISER movies, the box\n          is recognizable despite its black coating; it is the Lament\n          Configuration, the puzzle box that opens the doors to Hell.\n<b>          \n</b>          There is a stubby shard of material protruding from one side of\n          the box - presumably where the boy from ER had broken it off\n          the pillar.  Camera favors this jagged shard as we\n<b>          \n</b><b>          CROSS-FADE TO\n</b><b>          \n</b><b>          \n</b><b>          INT.   UNDER THE UNDERGROUND   NIGHT\n</b><b>          \n</b><b>          ANGLE ON PILLAR\n</b><b>          \n</b>          VERY CLOSE on its upper left section.  We are looking at a hole\n          in the pillar that matches the pattern of the shard on the Box.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>          \n</b>          The club is empty.  The dim lighting of working hours has been\n          replaced with the sickly gleam of one or two fluorescent tubes\n          and the club has that eerie not-quite-right look that all night\n          places have when subjected to a harsher light.\n<b>          \n</b><b>                                                                      23\n</b><b>          \n</b>          Two WORKERS are in the final stages of clearing the night's\n          debris - emptying trash into big black plastic bags, wiping\n          down tables and bars etc.\n<b>          \n</b>          Work completed, they head to the main exit.\n<b>          \n</b>          One of them hits the light switches so that the fluorescent\n          clarity is again replaced by the more appropriate dim lighting.\n          The other shouts across the apparently deserted club.\n<b>          \n</b><b>                                     WORKER\n</b>                        All done, Mr. Monroe.\n<b>          \n</b>          They stand a second but no response comes.  The first turns to\n          the second and shrugs.\n<b>          \n</b><b>                                     WORKER\n</b>                               (mouthing silently)\n                        Ass hole.\n<b>          \n</b>          His co-worker grins and they let themselves out.\n<b>          \n</b>          A beat.  Another door opens into the club and JP Monroe \u0096 the\n          club's owner and the man we saw buy the pillar -  walks into\n          the main room of the club from his private room at the back.\n<b>          \n</b>          JP walks out into the shadowed darkness of his small kingdom.\n          He describes a circle around the dance floor, throwing glances\n          at his odd sculptures, and finally walks into the center of the\n          room to stand before the pride of his collection, the pillar.\n<b>          \n</b>          The pillar of course is stationary at this time, though it is\n          still mounted upside down.\n<b>          \n</b>          JP smiles possessively at the pillar - and then registers the\n          mutilation where the Box has been ripped away.\n<b>          \n</b><b>                                     JP\n</b>                        What the ... ?\n<b>          \n</b>          He leans in closer to stare at the hole.\n<b>          \n</b>          Suddenly, jarringly, there is a quiet but distinct SQUEAK that\n          seems to come from within the hole.\n<b>          \n</b>          JP starts back a little, a small expression of anxiety on his\n          normally supercilious face.  He glances to right and left, gets\n          a grip, and leans forward again.\n<b>          \n</b><b>          ANGLE ON PILLAR/HOLE\n</b><b>          \n</b>           - as, again, the noise comes.  Is it a squeak - or is it the\n          creaking shifting of hidden machinery, hidden chains?\n<b>          \n</b><b>          \n</b><b>                                                                      24\n</b><b>          \n</b>          JP's hand moves tentatively into shot, approaching the hole.\n          Slowly, slowly, it reaches wrist-deep into the blackness.\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>          VERY CLOSE on JP's face - quizzical, enquiring ... and suddenly\n          contorted in pain!\n<b>          \n</b><b>                                     JP\n</b>                        Aaaaaahh!!\n<b>          \n</b><b>          ANGLE ON PILLAR/HOLE\n</b><b>          \n</b>           - as JP's hand whips out of the hole, shaking in shock and\n          pain.  A rat is hanging on to one of JP's fingers, its sharp\n          teeth buried in the flesh!\n<b>          \n</b>          JP swings his arm violently through the air, dislodging the rat\n          with the force of his swing.  A spray of blood is seen to come\n          from JP's wounded finger.\n<b>          \n</b><b>          ANGLE ON RAT\n</b><b>          \n</b>           - as it lands heavily in a shadowed corner of the club and\n          scurries away deeper into the darkness, squeaking furiously.\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>           - as he looks down at his finger, face snarling.\n<b>          \n</b><b>                                     JP\n</b>                        Son of a ...\n<b>          \n</b><b>          ANGLE ON FINGER\n</b><b>          \n</b>          VERY CLOSE.  Blood seeps from the tiny teeth marks.\n<b>          \n</b><b>                                     JP\n</b>                                   (off)\n                        ... bi ...\n<b>          \n</b>          JP's voice is cut off by a strange SIZZLING NOISE heard OFF.\n<b>          \n</b>          JP's face moves up to look at the pillar.  A look of awe and\n          shock crosses his face.\n<b>          \n</b><b>          ANGLE ON PILLAR\n</b><b>          \n</b>          Some small drops of blood stand out bright red on the blackness\n          of the pillar.  The sizzling noise is coming from them.\n<b>          \n</b>          Suddenly the drops draw together magically into one large ruby\n          of blood - already larger than possibility would allow.  Then\n          it gets wierder; the blood suddenly dissipates into six or\n          seven little rivulets that begin to run down the pillar.\n<b>                                                                      25\n</b><b>          \n</b>          The streams of blood don't simply fall straight.  They seem to\n          follow some pre-gouged pattern, running down the pillar tracing\n          the blackened organic contours of the carvings.\n<b>          \n</b>          They all culminate at the point of Pinhead's chin - and then\n          separate again, running over his frozen black face along the\n          carved scar lines that make a matrix across his features.\n<b>          \n</b>          When every canal line on the demon's face is filled neatly with\n          blood, a BLUE LIGHT seems to glow from within the pillar\n          through Pinhead's face, giving it temporarily the blue tone he\n          had enjoyed in (un)life.\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>          CLOSE on his awe-struck face - bathed in reflected blue light.\n<b>          \n</b><b>          ANGLE ON PINHEAD\n</b><b>          \n</b>           - as gradually the blueness subsides again, the visible blood\n          vanishing with it, leaving the same frozen implacable blackness\n          as before but charged now with a waiting power.\n<b>          \n</b><b>          FADE TO BLACK\n</b><b>          \n</b><b>          \n</b><b>          INT.   KITCHEN, JOEY'S APT.   DAY      (NEXT MORNING)\n</b><b>          \n</b><b>          BLACKNESS\n</b><b>          \n</b><b>                                     JOEY\n</b>                                    (off)\n                        Oh my God ...\n<b>          \n</b><b>          CLOSE ON STOVE TOP\n</b><b>          \n</b>          A frying pan sits atop a burner.  it contains the ugliest mess\n          of scrambled eggs you have ever seen ... or perhaps it's an\n          omelette.  There are other ingredients in there but they're\n          burnt so black they're unrecognizable.  At least half of the\n          mixture lies all over the stove top instead of in the pan.\n<b>          \n</b><b>                                     JOEY\n</b>                                    (off)\n                        Did I sleep through an earthquake?\n<b>          \n</b><b>          VARIOUS ANGLES\n</b><b>          \n</b>           - showing the chaos all around the kitchen: Spilled flour on\n          work surfaces; Egg-shells on the linoleum; A knocked-over glass\n          of orange juice, the juice soaking into a piece of kitchen\n          roll; Coffee as black and thick as a mix of Indian ink and\n          molasses.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>                                                                      26\n</b><b>          \n</b>          Joey, in her dressing-gown, stands in the doorway with a\n          shocked expression on her face.\n<b>          \n</b>          Terri, in an oversized man's shirt, stands by the stove holding\n          a fish-slice and smiling nervously.\n<b>          \n</b><b>                                     TERRI\n</b>                        I figured I'd make breakfast.\n<b>          \n</b><b>                                     JOEY\n</b>                        Right ... That's ... er ... that's nice\n                        of you, Terri.  Can I ask?  Is it always\n                        this ... exploratory?\n<b>          \n</b><b>                                     TERRI\n</b>                        Ha!  I don't know yet.  First time.\n                        Kitchen virgin, that's me.\n<b>          \n</b>          Joey nods slowly, crossing to a cabinet and taking out some\n          instant coffee.\n<b>          \n</b><b>                                     JOEY\n</b>                        I'll boil some water.\n<b>          \n</b><b>                                     TERRI\n</b>                        I'll do it!\n<b>          \n</b><b>                                     JOEY\n</b>                        No!  No, that's OK.  I like to.  I love\n                        boiling water.  It's a specialty of\n                        mine.  Why don't you go watch cartoons?\n<b>          \n</b>          Joey watches Terri walk out of the kitchen, sighs in relief,\n          and grabs the kettle.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S AP'T.\n</b><b>          \n</b>          Joey sits, drinking her coffee, as Terri walks round the room\n          with hers.\n<b>          \n</b><b>                                     TERRI\n</b>                        This is great.  And it's yours?  You\n                        like own it?\n<b>          \n</b><b>                                     JOEY\n</b>                        The bank owns it.  But I'm working on\n                        it.\n<b>          \n</b><b>                                     TERRI\n</b>                        Jeez, I've never owned anything.  I\n                        haven't even had a room of my own since\n                        I was fifteen years old.\n<b>          \n</b><b>          \n</b><b>                                                                      27\n</b><b>          \n</b><b>                                     JOEY\n</b>                        How have you ... ?\n<b>          \n</b><b>                                     TERRI\n</b>                        Guys.  Sometimes friends.  Mostly guys.\n<b>          \n</b>          Terri walks past Joey's TV set (sound down, cartoons playing).\n<b>          \n</b><b>          ANGLE ON TV\n</b><b>          \n</b>          The Box is on top of the TV.  In the warm light of morning it\n          seems innocuous and harmless, like just another ornament.\n<b>          \n</b><b>          DIFFERENT ANGLE\n</b><b>          \n</b>           - as Terri walks on, pausing by the shelves of books.\n<b>          \n</b><b>                                     TERRI\n</b>                        Wow.  Lotta books.  You read all these?\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  I buy them to impress people.  Of\n                        course I've read them.\n<b>          \n</b><b>                                     TERRI\n</b>                        Cool.  I read a book once.  It was like\n                        all these people discovering who they\n                        used to be.  You know, like\n                        reincarnation?  It was really good.  You\n                        ever read that?\n<b>          \n</b><b>                                     JOEY\n</b>                        I don't think so.  But it's a\n                        fascinating subject.  Did you ...\n<b>          \n</b>          But Terri has already moved on.  She is by the big picture\n          window.  The drapes are now open.\n<b>          \n</b><b>                                     TERRI\n</b>                        Great view!  Great view!  Look at this!\n<b>          \n</b>          Joey stands and walks to join Terri.\n<b>          \n</b><b>                                     JOEY\n</b>                        Actually, I'm pretty familiar with the\n                        view ...\n<b>          \n</b><b>          GIRLS' POV - THROUGH WINDOW\n</b><b>          \n</b>          Joey's apartment is on a high floor and her window overlooks\n          many lower buildings, giving a view of the city beyond.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      28\n</b><b>          \n</b><b>                                     JOEY\n</b>                                    (off)\n                        ... but it is good.  You know, over to\n                        the left, you can ...\n<b>          \n</b><b>                                     TERRI\n</b>                               (looking to right and pointing)\n                        Who's that?\n<b>          \n</b>          On the flat roof of a nearby building, a RETARDED TEENAGE BOY\n          sits motionless in an old rusty deck chair next to a small\n          Jerry-built pigeon coop.  Its door is open and it is empty.\n<b>          \n</b>          The boy is some distance from the girls but his solitude, his\n          stillness, and the empty coop beside him lend the scene an\n          atmosphere of sadness and loss.\n<b>          \n</b>          As Joey tells his story, we INTERCUT between the POV of the\n          roof and the girls at the window.\n<b>          \n</b><b>                                     JOEY\n</b>                        I don't know his name ...  I saw the\n                        whole story.  A wounded bird was on his\n                        roof.  I could hear its cries from here.\n                        He went straight to it.  I couldn't've.\n                        I'd be frozen between pity and fear.\n                        But he wasn't.  Its pain spoke directly\n                        to him.  He picked it up.  Nursed it.\n                        Fed it.  And it got better.  Everyday\n                        he'd watch the pigeon.  Everyday the\n                        pigeon would watch him. I saw him learn.\n                        Learn that there was one more thing he\n                        had to do to make the rescue complete.\n                        And one day, just as afternoon became\n                        evening, he leaned over, opened the\n                        cage, and walked away.  Didn't look\n                        back.  But he heard the sound of its\n                        wings.\n<b>          \n</b><b>                                     TERRI\n</b>                        And he still sits there?\n<b>          \n</b><b>                                     JOEY\n</b>                        Every day.\n<b>          \n</b><b>                                     TERRI\n</b>                        Maybe he thinks it'll come back.\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  He knows it won't.  It was his\n                        final act of love and part of him knows\n                        that and part of him doesn't yet.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      29\n</b><b>          \n</b><b>                                     TERRI\n</b>                        Bullshit!  He should've kept it.  It'd\n                        live longer!  It's dangerous out there!\n                        People get hurt!\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b>           - as she realizes she has a wounded pigeon of her own.\n<b>          \n</b><b>                                     JOEY\n</b>                        What?  I wasn't talking about ... I ...\n                        Do you want to stay?  You want to stay\n                        here for a while?\n<b>          \n</b>          Terri shrugs, gives a nervous smile.\n<b>          \n</b>          Joey crosses to the TV, picks up the Box and weighs it in her\n          hand.\n<b>          \n</b><b>                                     JOEY\n</b>                        OK.  OK.  It's a done deal.  But look \u0096\n                        you have to help me.  I've got to solve\n                        this thing.  I've got to know what's\n                        going on.\n<b>          \n</b>          Terri follows across the room and sits on the sofa.\n<b>          \n</b><b>                                     TERRI\n</b>                        But I don't know what's going on.\n<b>          \n</b><b>                                     JOEY\n</b>                        Maybe not.  But you know more than I do.\n                        You know something about this box.\n                        Something about a statue?\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah.  I found it.  I knew held like it\n                        and I figured ...\n<b>          \n</b><b>                                     JOEY\n</b>                        Woah.  Wait a minute.  Who?  The kid?\n<b>          \n</b><b>                                     TERRI\n</b>                        No.  JP.  My last boyfriend?  He like\n                        owns the club.  You know?  You were\n                        there?  He bought the statue.\n<b>          \n</b><b>                                     JOEY\n</b>                        That you found.  What do you mean you\n                        found it?\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      30\n</b><b>          \n</b><b>                                     TERRI\n</b>                        I was downtown looking for a ... a\n                        friend.  A guy I know.  Anyway, there\n                        was this store.  Like real old?  Lotsa\n                        weird shit in there.  I saw this statue.\n                        Pillar.  Thing.  I knew he'd love it.\n                        You've seen the club.\n<b>          \n</b><b>                                     JOEY\n</b>                        Would you know this store again?\n<b>          \n</b><b>                                     TERRI\n</b>                        Sure.  Why?\n<b>          \n</b><b>                                     JOEY\n</b>                        It's Saturday morning.  Let's go\n                        shopping.\n<b>          \n</b><b>          \n</b><b>          EXT.   DERELICT STREET   DAY\n</b><b>          \n</b>          Joey's Mazda 323 drives down the street.\n<b>          \n</b>          The daylight street is still creepy but in a different way; No\n          bums, no trash-can fires, nothing.  It has the feel of a ghost\n          town, as if nothing has breathed here for years.\n<b>          \n</b><b>          ANGLE IN CAR\n</b><b>          \n</b>          Joey, at the wheel, has a disbelieving look on her face.\n<b>          \n</b>          Terri, smoking, flicks ash through her wound-down window.\n<b>          \n</b><b>                                     JOEY\n</b>                        Jesus.  Are you sure this is the street?\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah.  Happening, isn't it?\n<b>          \n</b><b>                                     JOEY\n</b>                        What on earth were you doing down here?\n<b>          \n</b>          An evasive silence.\n<b>          \n</b><b>                                     JOEY\n</b>                        Terri?\n<b>          \n</b><b>                                     TERRI\n</b>                        Buying some drugs, alright?\n<b>          \n</b><b>                                     JOEY\n</b>                        Oh, Terri ...\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      31\n</b><b>          \n</b><b>                                     TERRI\n</b>                        For somebody else, alright?  Not for me.\n                        I don't do that shit anymore.\n<b>          \n</b><b>                                     JOEY\n</b>                        Then you shouldn't even be around it.\n                        You know, it's ...\n<b>          \n</b><b>                                     TERRI\n</b>                        Here!  Here!  Pull over!\n<b>          \n</b>          Joey brings the car to a halt outside the antique store.\n<b>          \n</b>          Terri scrambles out of the passenger door.\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah.  See.  I told you it was here.\n<b>          \n</b><b>          CLOSE ANGLE ON JOEY\n</b><b>          \n</b>           - as she looks at Terri from behind, her face worried for her\n          new and screwed-up friend.\n<b>          \n</b><b>          \n</b><b>          INT.   CARDUCCI\u0092S ANTIQUES   DAY\n</b><b>          \n</b>          Joey and Terri enter the store.\n<b>          \n</b>          The store is different, its selection of merchandise reduced.\n          The 50's and 60's junk hardware is still there, along with some\n          of the more mundane Victoriana, but it seems more \"normal\" \u0096\n          none of the odd items of punishment memorabilia are there.\n<b>          \n</b>          Also, because it is daylight, the store seems merely old,\n          interesting, and musty, not creepy or odd.\n<b>          \n</b>          There seems to be no-one in attendance.\n<b>          \n</b><b>          ANGLE ON GIRLS\n</b><b>          \n</b>           - as they walk through the store.\n<b>          \n</b><b>                                     MAMA\n</b>                                    (off)\n                        Can I help?\n<b>          \n</b>          The voice startles the girls and they jump around to face the\n          counter as MAMA CARDUCCI moves into view from beneath it.\n<b>          \n</b>          Mama, an ancient and slightly eccentric Italian-American woman\n          eyes the girls with the suspicion of somebody who hasn't had a\n          customer in decades.  Not aggressive, just surprised.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      32\n</b><b>          \n</b><b>                                     JOEY\n</b>                        Yes.  Thank you.  We were wondering ...\n                        Terri, show her the box.\n<b>          \n</b>          Terri removes the box from her purse and holds it up.\n<b>          \n</b><b>                                     MAMA\n</b>                        No.  Sorry.  Not interested.  Not for my\n                        customers.  Have you tried ...\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  No, you don't understand.  We're\n                        not selling it.  It came from here.  We\n                        want ...\n<b>          \n</b><b>                                     MAMA\n</b>                        Everything sold as is.  No guarantees.\n                        No returns.\n<b>          \n</b><b>                                     JOEY\n</b>                        No.  We want ...\n<b>          \n</b><b>                                     MAMA\n</b>                        I took back everything bought on a whim,\n                        I'd have no business.  I ...\n<b>          \n</b><b>                                     TERRI\n</b>                        Lady, will you shut the fuck up and give\n                        her a break.\n<b>          \n</b>          A sudden silence.  Both Mama and Joey stare at Terri in\n          surprise.\n<b>          \n</b>          Mama looks back at Joey.\n<b>          \n</b><b>                                     MAMA\n</b>                        Quite a mouth.  So what's the problem?\n                        You tell me.  You I like.\n<b>          \n</b>          Joey smiles.  Terri raises her eyes to heaven.  Mama waits.\n<b>          \n</b><b>                                     JOEY\n</b>                        Thank you.  This came off a ... statue?\n                        A pillar.  We wondered if you knew\n                        anything about the piece.  About where\n                        it came from.\n<b>          \n</b>          Mama squints at the box, as if trying to recognize it.\n<b>          \n</b><b>                                     MAMA\n</b>                        Oh ... yeah.  Yeah.  That thing.  Ugly.\n                        Real ugly.  I sold that?\n<b>          \n</b>          Mama's eyes scan the store.\n<b>          \n</b><b>                                                                      33\n</b><b>          \n</b><b>                                     MAMA\n</b>                        Never mind.  I'm glad it's gone.  Made\n                        the store feel strange.  Who'd make such\n                        a thing?\n<b>          \n</b><b>                                     JOEY\n</b>                        Fine.  Fine.  But can you tell us\n                        anything about it?\n<b>          \n</b><b>                                     MAMA\n</b>                        It was part of a job-lot.  Some loony-\n                        bin they shut down.  Unclaimed stuff.\n<b>          \n</b><b>                                     JOEY\n</b>                        What else came with it?  Anything still\n                        here?\n<b>          \n</b><b>                                     MAMA\n</b>                        Sure.  Just papers, photos.  Stuff\n                        nobody'd ever want.\n<b>          \n</b><b>                                     JOEY\n</b>                        Can we see?\n<b>          \n</b><b>                                     MAMA\n</b>                        You gonna buy?\n<b>          \n</b><b>                                     JOEY\n</b>                        I don't know.  Maybe.\n<b>          \n</b><b>                                     MAMA\n</b>                        Right at the back there.  Middle\n                        shelves.  Coupla folders.  Nice stuff.\n                        I'd do you a good price.\n<b>          \n</b><b>          CUT TO:\n</b><b>          \n</b><b>          ANGLE ON REAR OF STORE\n</b><b>          \n</b>          Joey and Terri approach an old shelf unit along the rear wall.\n<b>          \n</b>          A shaft of sunlight throws a square of light on the wooden\n          floor a few yards in front of the shelves.\n<b>          \n</b>          Joey takes up a big bulging manilla folder from the shelves and\n          begins to look through it.\n<b>          \n</b><b>                                     JOEY\n</b>                        Terri, check out the other folder.\n<b>          \n</b>          Terri, still holding her purse and the box, looks around for\n          somewhere to put them.  All the shelves are full.  She lays\n          them on the floor in the square of sunlight and joins Joey at\n          the shelves, grabbing up the second folder.\n<b>          \n</b><b>                                                                      34\n</b><b>          \n</b><b>                                     TERRI\n</b>                        What am I looking for?\n<b>          \n</b><b>                                     JOEY\n</b>                        God knows.  Anything.  Contacts.  Clues.\n<b>          \n</b>          Terri opens up the folder and begins to pace the floor as she\n          flicks through the contents.\n<b>          \n</b><b>                                     TERRI\n</b>                        Jesus.  You're gonna pay her for this\n                        shit?  It's like fucking business papers\n                        for God's sake!\n<b>          \n</b>          Bored, Terri wanders off to lean against another shelf-unit.\n<b>          \n</b><b>          ANGLE OVER JOEY'S SHOULDER ON FOLDER\n</b><b>          \n</b>           - as she flicks through the contents.\n<b>          \n</b>          Terri's dismissive summary seems justified.  All Joey sees are\n          obscure and meaningless case-notes and paperwork.  Each item is\n          letter-headed THE CHANNARD INSTITUTE.\n<b>          \n</b>          Joey's hand reaches a large envelope.  Scrawled in hand across\n          it is the phrase DR. CHANNARD - PERSONAL PAPERS.  Joey draws\n          the contents out and begins to sift through them.\n<b>          \n</b>          The first item is a dusty, black-and-white photograph of an\n          officer in English Army uniform, circa 1920.  Joey blows the\n          dust from the photo.\n<b>          \n</b><b>          LOW ANGLE - ON BOX\n</b><b>          \n</b>           - which sits on the floor in the shaft of sunlight, the dust\n          from the photo settling next to it.\n<b>          \n</b><b>          ON JOEY\n</b><b>          \n</b>          The next photo is that of a beautiful young woman.  Joey flips\n          it over.  Gummed on the back is a type-written slip that says\n<b>          COTTON, KIRSTY  CASE NO.  5719.\n</b><b>          \n</b><b>          ON BOX\n</b><b>          \n</b>          The sounds of the girls flicking through papers is heard OFF\n          and then FADES as something strange begins to happen.\n<b>          \n</b>          Suddenly, the dust around the box begins to move as if blown by\n          an invisible wind.  It is drawn up so that it forms an\n          impossible spiral in the air.  Spinning like a miniature\n          hurricane, it hovers over the box.  The sunlight seems to grow\n          brighter.  Is it just reflections on the metalwork designs or\n          is the box itself glowing and shining?\n<b>          \n</b><b>                                                                      35\n</b><b>          \n</b><b>          CLOSE ANGLE ON JOEY'S FACE\n</b><b>          \n</b>           - as her eyes flick back and forth as she scans ...\n<b>          \n</b>          Joey turns another item and her face registers surprise at what\n          she is seeing ...\n<b>          \n</b>          The next item in the folder is a Xerox sheet, a reproduction of\n          what appears to be an ancient document.\n<b>          \n</b>          It is a diagram, like a designer's drawing or plan.  And it is\n          of the box seen from various angles.\n<b>          \n</b><b>          CLOSE ANGLE ON JOEY'S FACE\n</b><b>          \n</b>           - as she realizes what she is looking at.\n<b>          \n</b><b>                                     JOEY\n</b>                                  (softly)\n                        Alright ...\n<b>          \n</b>          Joey turns, folder in hand, to look at the box on the floor and\n          compare it to the diagram.\n<b>          \n</b>          Joey gasps.\n<b>          \n</b>          The miniature tornado of spiralling dust suddenly disappears\n          inside the apparently sealed box as if sucked down into it.\n<b>          \n</b>          As if on cue, the shaft of sunlight disappears behind a cloud\n          as the last particle of dust disappears into the box.\n<b>          \n</b>          Joey, mouth open in shock, lets the folder drop from her hand.\n          The sound of its splayed contents hitting the floor alerts\n          Terri, who walks back round from the other shelf unit.\n<b>          \n</b>          Terri looks at the dropped contents and then up at Joey.\n<b>          \n</b><b>                                     TERRI\n</b>                        Joey ... ?\n<b>          \n</b><b>                                     JOEY\n</b>                               (still staring at Box)\n                        Help me pick 'em up, Terri.  I think\n                        the lady just made a sale.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   EARLY EVENING\n</b><b>          \n</b>          Joey is sitting behind a desk.  She has a phone in one hand and\n          a pen in the other.\n<b>          \n</b>          Spread out over the desk are various documents - the photo of\n          Kirsty, the diagram of the box, type-written transcripts etc -\n          and a scratch-pad on which Joey has scrawled several numbers.\n<b>                                                                      36\n</b><b>          \n</b>          Joey is in mid-conversation on the phone.\n<b>          \n</b><b>                                     JOEY\n</b>                        Yeah ... yeah ... yeah ... No, it's\n                        important that I speak to ... What?  No,\n                        don't ...          (a beat)       Put.\n                        Me.  On.  Hold.  You.  Stupid.  Bitch.\n<b>          \n</b>          Joey slams the phone down.\n<b>          \n</b>          She stares at the papers, at the scratch pad, takes a deep\n          breath, and punches out a number on the phone.\n<b>          \n</b>          This time Joey's voice is different.\n<b>          \n</b><b>                                     JOEY\n</b>                        Hi.  Now listen.  And listen good.  I'm\n                        the Station Manager at W-QQY.  For the\n                        last half-hour you've been dicking\n                        around with my assistant.  Let me tell\n                        you something.  With or without your co-\n                        operation we are making this expose.  I\n                        assume you're smart enough to guess\n                        which version is going to make you look\n                        good.  Now, if you can't put one hand on\n                        that cassette and the other on a FedEx\n                        man's butt within thirty seconds then\n                        you damn well better put me through to\n                        somebody who can.\n<b>          \n</b>          A pause while somebody jumps through hoops at the other end.\n<b>          \n</b>          Joey's voice transmogrifies again; now it's a seductive,\n          persuasive purr.\n<b>          \n</b><b>                                     JOEY\n</b>                        Dr.  Fallon?  How nice of you to take my\n                        call.  I understand you're in charge of\n                        video archive from the Channard\n                        Institute ... ?\n<b>          \n</b><b>          \n</b><b>          INT.   UNDER THE UNDERGROUND   NIGHT\n</b><b>          \n</b>          Another night in Under The Underground\n<b>          \n</b>          Kids dance.\n<b>          \n</b>          Customers jostle at the bar.\n<b>          \n</b>          Couples neck in shadowed corners.\n<b>          \n</b>          Loud Metal music blasts out from speakers next to the various\n          sculptures on the walls and ceiling.\n<b>          \n</b><b>                                                                      37\n</b><b>          \n</b>          The center of the dance-floor is packed.\n<b>          \n</b>          The pillar is missing.\n<b>          \n</b><b>          ANGLE ON BAR\n</b><b>          \n</b>          Sitting alone at a bar stool - though surrounded by tightly-\n          packed customers - is SANDY, a very pretty teenage girl.  She\n          is the same basic type as Terri; blonde, frail, young.  Too\n          young, in fact, to be legally in a club like this.\n<b>          \n</b>          Sandy stares at her empty glass - and stares at it wistfully\n          enough to suggest she doesn't have the money to get it\n          refilled.  She is trying to keep up a cool impassive face but\n          her eyes betray her basically vulnerable character.\n<b>          \n</b><b>          REVERSE ANGLE\n</b><b>          \n</b>          Sitting at the opposite end of the bar, his eye-line confirming\n          he is looking at Sandy, is JP Monroe.\n<b>          \n</b>          The bar-stool beside JP is occupied by a TEENAGE BOY who has\n          his back to the bar and is talking to a GROUP of his FRIENDS.\n<b>          \n</b>          JP has a speculative, predatory look on his face.  Without\n          shifting his gaze, he raises his hand and within seconds the\n          BARMAN is leaning over to hear his request.\n<b>          \n</b>          CLOSE on Sandy as a full glass is placed in front of her.  Laid\n          alongside the glass is a beautiful long-stemmed red rose.\n<b>          \n</b>          Sandy looks surprised at the drink and then smiles in delight\n          at the rose.  She raises her eyes and looks across the bar.\n<b>          \n</b>          JP returns the smile.\n<b>          \n</b>          He turns to the Boy beside him and murmurs something unheard.\n<b>          \n</b>          The boy glances round, as if ready to argue with whoever is\n          speaking to him.  On recognizing JP, however, he vacates the\n          seat without an argument and stands to join his friends.\n<b>          \n</b>          JP looks back across the bar at Sandy and gestures at the empty\n          stool beside him, an attractive welcoming smile on his face.\n<b>          \n</b>          Sandy gets up and, carrying the drink and the rose, makes her\n          way across to sit beside JP.\n<b>          \n</b><b>          ANGLE ON JP AND SANDY\n</b><b>          \n</b>          The deafening music playing in the club means that they have to\n          lean in close to hear each other speak.\n<b>          \n</b><b>                                     JP\n</b>                        Welcome.\n<b>                                                                      38\n</b><b>          \n</b><b>                                     SANDY\n</b>                        You're JP Monroe, right?\n<b>          \n</b><b>                                     JP\n</b>                        Uh-huh.\n<b>          \n</b><b>                                     SANDY\n</b>                        And this is your club.  Great club.  I\n                        really love it here.  Great club.\n<b>          \n</b><b>                                     JP\n</b>                        Thank you.\n<b>          \n</b><b>                                     SANDY\n</b>                        Thank you for the drink.  And the rose.\n                        Wow.  That's ... really nice.\n<b>          \n</b><b>                                     JP\n</b>                        It's yours.  You won it.  It's a prize.\n<b>          \n</b><b>                                     SANDY\n</b>                        A prize?  For what?\n<b>          \n</b><b>                                     JP\n</b>                        You see, everyday I have my friend John\n                        here bring ...\n<b>          \n</b><b>                                     SANDY\n</b>                        The barman?  I thought he was called\n                        Rick?\n<b>          \n</b><b>                                     JP\n</b>                        He's a barman.  Whatever.  Do you mind\n                        if I continue?\n<b>          \n</b><b>                                     SANDY\n</b>                        I'm sorry.\n<b>          \n</b><b>                                     JP\n</b>                        Everyday I have my friend Rick here\n                        bring a newly-cut red rose in with him\n                        and keep it behind the bar.  And I award\n                        it to a woman of exceptional beauty.\n<b>          \n</b><b>                                     SANDY\n</b>                        Oh come on.  There're lots of girls here\n                        who look better than ...\n<b>          \n</b><b>                                     JP\n</b>                        Don't do that!  Don't put yourself down.\n                        If you have a quality, be proud of it...\n<b>          \n</b>          While talking, and without taking his eyes off Sandy, JP\n          gestures at the barman and their glasses.\n<b>          \n</b><b>                                                                      39\n</b><b>          \n</b><b>                                     JP\n</b>                        ... Let it define you.  Whatever it is.\n                        Most of the roses die behind the bar.\n                        This is the first I've given out for\n                        nearly a month.\n<b>          \n</b><b>                                     SANDY\n</b>                        No.  Really?\n<b>          \n</b>          Two full glasses join the still half-full ones on the bar.\n<b>          \n</b><b>                                     JP\n</b>                        Yes really.\n<b>          \n</b><b>                                     SANDY\n</b>                        Wow.  Thank you.\n<b>          \n</b><b>                                     JP\n</b>                        No.  Thank you.\n<b>          \n</b><b>          ANGLE ON GLASSES\n</b><b>          \n</b><b>          TIME-FADE\n</b><b>          \n</b><b>          ANGLE ON GLASSES\n</b><b>          \n</b>          Now there are six empty glasses on the bar and two half-full\n          ones.\n<b>          \n</b><b>          ANGLE UP TO JP AND SANDY ...\n</b><b>          \n</b>           - except they're not there.  The two bar-stools are empty.\n<b>          \n</b><b>          \n</b><b>          INT.  JP'S PRIVATE ROOM   NIGHT\n</b><b>          \n</b>          The music OFF from the club is dull and muffled.\n<b>          \n</b>          JP1s private room is the size - and shares the general\n          appearance of - an expensive studio apartment.\n<b>          \n</b>          His room looks like an annex to his club - black walls, black\n          fittings, artworks of elegant cruelty - show that JP's taste\n          for the bizarre is not just professional.\n<b>          \n</b>          Camera explores the room as the sound of BREATHING grows OFF.\n<b>          \n</b><b>          ANGLE ON PILLAR\n</b><b>          \n</b>           - now the right way up, it stands in a corner of the room.  As\n          usual, it looks jarring and impressive but it doesn't really\n          seem out of place in JP's room.\n<b>          \n</b>          The Breathing OFF becomes mixed with MOANS and SMALL CRIES.\n<b>          \n</b><b>                                                                      40\n</b><b>          \n</b><b>          ANGLE ON BED\n</b><b>          \n</b>          JP and Sandy, both naked, are on the bed making love.  Well,\n          maybe Sandy's making love.  JP's having sex.\n<b>          \n</b>          It is a selfish, phallocentric scene, concentrating on JP's\n          concern only for his own gratification.  It may be an erotic\n          sight, but it's not a pretty one.\n<b>          \n</b>          JP is on top.  He has hold of both Sandy's wrists in one of his\n          hands and his body is working away rhythmically.  He is half-\n          upright, looking down at her.  No kissing.\n<b>          \n</b>          CLOSE on JP's face - his eyes open, staring down at Sandy.\n<b>          \n</b>          CLOSE on Sandy's face - her eyes closed, half in pleasure, half\n          in shame.\n<b>          \n</b><b>          SMASH-CUT TO PILLAR\n</b><b>          \n</b>          CLOSE on Pinhead's face.  Suddenly, horribly, the monster's\n          eyes fly open and his frozen face stares down at the lovers.  A\n          BLUE LIGHT seems to pulse from within the pillar, lending color\n          to Pinhead's face.\n<b>          \n</b>          Pinhead continues to watch the love-making until it comes to a\n          climax.\n<b>          \n</b>          As JP GROANS out his orgasm and collapses forward onto Sandy's\n          body, Pinhead's eyes close.  The BLUE LIGHT disappears and the\n          pillar is just the pillar again.\n<b>          \n</b><b>          \n</b><b>          INT.  MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b><b>          ANGLE ON DESK\n</b><b>          \n</b>           - FAVORING the telephone/answering machine, its red message\n          light blinking in the darkness of the apartment.\n<b>          \n</b>          Heard OFF is the sound of Joey coming in to her apartment -\n          doors opening and closing, bags being put down, footsteps etc.\n<b>          \n</b>          Joey's hand comes into frame and presses the message button.\n<b>          \n</b><b>          WIDER ANGLE\n</b><b>          \n</b>           - as Joey waits for her machine and glances around the room\n          for Terri.\n<b>          \n</b><b>                                     JOEY\n</b>                        Terri?\n<b>          \n</b><b>          ANGLE ON SOFA - JOEY'S POV\n</b><b>          \n</b><b>                                                                      41\n</b><b>          \n</b>          The sofa is empty.\n<b>          \n</b>          Joey looks puzzled and is about to call again when the machine\n          kicks in.\n<b>          \n</b><b>                                     FALLON\n</b>                                    (on ansafone)\n                        Ms.  Summerskill.  Joanne.  Hello.  This\n                        is Dr. Fallon.  Martin.  Your reference\n                        material is on its way to you.  I very\n                        much enjoyed talking to you and I hope\n                        that if I'm ever in town you'll do me\n                        the honor of (sqwaaaaalk)\n<b>          \n</b>          Joey has her finger on the fast forward button.\n<b>          \n</b><b>                                     JOEY\n</b>                        In your dreams, pal.\n<b>          \n</b>          The chipmunk-squeal of Fallon's voice is replaced by the\n          warning-beep of a second message.  Joey lets it play.\n<b>          \n</b><b>                                     WOMAN\n</b>                                 (on ansafone)\n                         ... your number from your resume.\n                        Which was very impressive, by the way.\n                        My name is Sharon Leech and you can\n                        reach me here at K-YZY in Monterey, area\n                        code 805 ... (sqwaaalk)\n<b>          \n</b>          Joey stops the tape.\n<b>          \n</b><b>                                     JOEY\n</b>                                 (to herself)\n                        Shit. Why now? Why not last week? Oh ...\n<b>          \n</b>          She glances round at the empty room again, troubled by Terri's\n          absence.  She crosses to her bedroom door.\n<b>          \n</b><b>          \n</b><b>          INT.   JOEY'S BEDROOM   NIGHT\n</b><b>          \n</b>          Joey enters the darkened room - and then stops a few feet from\n          the door.\n<b>          \n</b>          Terri - lit only by the moonlight through the blinds - is lying\n          on one side of Joey's bed fast asleep.  Apart from her shoes,\n          which she has kicked off, she is fully dressed.\n<b>          \n</b>          Joey approaches the bed and watches her sleeping friend, her\n          face sympathetic, affectionate, and troubled.\n<b>          \n</b>          Joey reaches over, takes one of the pillows from the other side\n          of the bed, and lays it at the bottom end.\n<b>          \n</b><b>                                                                      42\n</b><b>          \n</b>          She slips off her shoes, shrugs off her jacket, and -\n          delicately, carefully - climbs on to the other side of the bed,\n          laying her head on the pillow she had moved.\n<b>          \n</b><b>                                     JOEY\n</b>                                  (whispered)\n                        Goodnight, Terri ...\n<b>          \n</b><b>          \n</b><b>          INT.   JP'S PRIVATE ROOM   NIGHT\n</b><b>          \n</b>          JP, on his bed in his shorts enjoying a post-coital cigarette,\n          blows smoke-rings at the ceiling and all but ignores Sandy.\n<b>          \n</b>          Sandy has put some of her clothes back on and is wandering\n          around the room, admiring it and chattering.\n<b>          \n</b><b>                                     SANDY\n</b>                        So cool ...\n<b>          \n</b>          She approaches the pillar ... leans in close ... closer ... and\n          ... nothing happens.\n<b>          \n</b><b>                                     SANDY\n</b>                        Radical.\n<b>          \n</b>          She walks on to look at a painting on one of the walls.\n<b>          \n</b><b>          ANGLE ON PAINTING\n</b><b>          \n</b>          It's a painstakingly rendered but crudely imagined piece.  The\n          kind of crap you'd buy in a Melrose gallery.\n<b>          \n</b>          Perhaps it's called Biker Crucifixion.  Night-time, somewhere\n          rural. A Hell's Angel, arms outstretched and stripped to the\n          waist, is tied to a tree by cruelly-tight barbed wire wrapped\n          around his body.  At the foot of the tree his biker friends\n          party, drink, and fuck, Harleys parked in the distance.  The\n          crucified Angel's eyes are raised to the Moon.  He's smiling.\n<b>          \n</b><b>          WIDER ANGLE ON SANDY AND PAINTING\n</b><b>          \n</b><b>                                     SANDY\n</b>                        Wow.  You've got great taste.  This ...\n                        well ... this really says it, you know?\n                        It's really ... dark.\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>          Still staring at the ceiling, JP pulls a pained face - like\n          he's heard this embarrassing shit a hundred times.\n<b>          \n</b><b>                                     SANDY\n</b>                        Don't you think?\n<b>          \n</b><b>                                                                      43\n</b><b>          \n</b><b>                                     JP\n</b>                        Mmn-hmnn.\n<b>          \n</b>          Sandy turns to look at JP, troubled by his unresponsiveness.\n<b>          \n</b><b>                                     SANDY\n</b>                        Do you mind me talking about your stuff?\n<b>          \n</b><b>                                     JP\n</b>                        Unh-unh.\n<b>          \n</b>          A beat.  Sandy stares at JP.  JP stares at the ceiling.\n<b>          \n</b><b>                                     SANDY\n</b>                        If it bothers you, just say so.\n<b>          \n</b>          JP sighs.\n<b>          \n</b><b>                                     JP\n</b>                        It doesn't bother me.  I'm just not\n                        interested.\n<b>          \n</b><b>                                     SANDY\n</b>                        Oh.  Like I'm not an interesting person.\n<b>          \n</b>          JP blows a smoke ring at the ceiling.\n<b>          \n</b>          Sandy walks back across the room to stand at the foot of the\n          bed.  ( And yes, fright fans, this does put her in front of the\n          pillar - though hopefully the blossoming argument will distract\n          audience attention.)\n<b>          \n</b><b>                                     SANDY\n</b>                        But you gave me a rose ...\n<b>          \n</b><b>                                     JP\n</b>                        And tomorrow I'll give one to somebody\n                        else.  Get dressed.  Get out.\n<b>          \n</b><b>                                     SANDY\n</b>                        You shit.  Who do you think you are?\n<b>          \n</b><b>                                     JP\n</b>                        I'm JP Monroe, you stupid little bitch.\n                        Now get the fuck out of my life.\n<b>          \n</b><b>                                     SANDY\n</b>                        You ... I can't fucking believe you, you\n                        bastard!  You get me in here ...\n<b>          \n</b><b>                                     JP\n</b>                        Right.  Like you were hog-tied or\n                        something.\n<b>          \n</b><b>          \n</b><b>                                                                      44\n</b><b>          \n</b><b>                                     SANDY\n</b>                        Look at you!  You think you're some God\n                        damn Prince or something.  With your\n                        shitty little Kingdom out there and all\n                        this ugly shi ....\n<b>          \n</b>          Sandy is waving her arms to illustrate her point and, halfway\n          through her last line, has turned to indicate the pillar.\n<b>          \n</b>          Suddenly - BAM! BIG SCARE MOMENT! - two blackened arms fly out\n          from the center of the pillar and grab Sandy's gesturing arms.\n<b>          \n</b>          The BLUE LIGHT burns from within, illuminating Pinhead's face\n          as his eyes open, filled with demonic glee and hunger.\n<b>          \n</b>          An impossible WIND begins to whistle through the room, as if an\n          echoed glimpse of a storm in Hell.\n<b>          \n</b>          Sandy screams in mortal terror.\n<b>          \n</b>          JP jumps from the bed, cigarette falling to the floor.  He\n          backs away to the opposite wall, face shocked, scared shitless.\n<b>          \n</b><b>                                     JP\n</b>                        Jesus Christ!\n<b>          \n</b>          Pinhead smiles sardonically.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Not quite.\n<b>          \n</b>          Pinhead's arms pull Sandy tight against the pillar and his\n          face, stifling her scream.\n<b>          \n</b>          JP flattened against the far wall, watches in horror as Sandy,\n          held tight against the pillar, suffers a horrible death:\n<b>          \n</b>          Sandy's life-force is sucked from her.  Drawn into the pillar.\n          Into Pinhead.\n<b>          \n</b>          It is a matter of seconds only but, in those few seconds -\n<b>          \n</b>          Her body begins to collapse in on itself, turning grey and\n          lifeless.  It is made worse by the fact that until the very end\n          Sandy keeps struggling, writhing in the grasp of the monster.\n<b>          \n</b>          The wind keeps blowing through the room.\n<b>          \n</b>          Finally, a dry lifeless husk, she is dropped to the floor.\n<b>          \n</b>          The Blue Light fades from within the pillar. The wind\n          disappears.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      45\n</b><b>          \n</b>          The pillar is again black and stationary.  But its contours are\n          different, more rounded.  It looks more organic, as if shifting\n          its raw material into new alignments, new configurations.  The\n          pillar seems to be in a process of becoming.  And the obvious\n          suggestion is that what it is becoming is Pinhead.\n<b>          \n</b>          Pinhead's head, arms, and torso now protrude from the pillar.\n          They are not completely free and - now that the \"eating\" of\n          Sandy is concluded - seem incapable of independent movement but\n          there is plainly a lot more of him than there was before.\n<b>          \n</b>          Even though the blue light has faded, Pinhead's face is\n          noticeably different.  It is blue-tinged and more fleshy in\n          appearance.  Capable of movement.  And speech.\n<b>          \n</b><b>          ANGLE ON JP\n</b><b>          \n</b>           - who has sunk to the floor, staring at the pillar.\n<b>          \n</b><b>                                     JP\n</b>                        What ... What ... ?\n<b>          \n</b><b>          WIDER ANGLE\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        What did you see?  The same as I.\n                        Appetite sated.  Desire indulged.  You\n                        saw the working of the world in\n                        miniature.\n<b>          \n</b>          JP shakes his head in denial.  But he's already a little more\n          together than he was: after all, the pillar can't move and he's\n          several yards from it.\n<b>          \n</b><b>                                     JP\n</b>                        That had nothing to do with the world.\n                        Not this one, anyway.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        On the contrary.  It has everything to\n                        do with the world.  And our dreams of\n                        how it will succumb to us.  You enjoyed\n                        the girl?\n<b>          \n</b><b>                                     JP\n</b>                        Yes.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Good.  So did I.  And that's all ...\n<b>          \n</b><b>                                     JP\n</b>                        No!  No.  It's not the same ... I ... \n                        No.  What you did ... it was ... evil.\n<b>          \n</b>          Pinhead laughs.\n<b>                                                                      46\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        How uncomfortable that word must feel on\n                        your lips.  Evil.  Good.  There is no\n                        Good, Monroe.  There is no Evil.  There\n                        is only the flesh and the patterns to\n                        which we can submit it.  You will help\n                        me to ...\n<b>          \n</b>          JP shakes his head in furious denial.\n<b>          \n</b><b>                                     JP\n</b>                        No.  No no no.  No fuckin' way.  I'm\n                        gone ...\n<b>          \n</b>          Grabbing at his jeans, JP heads out of his room.  Rapidly.\n<b>          \n</b><b>          \n</b><b>          EXT.   CITY STREETS, OUTSIDE CLUB   NEXT DAY\n</b><b>          \n</b>          The sun is high.  It's about noon.\n<b>          \n</b>          Like most clubs of its type, Under The Underground's exterior\n          is far from prepossessing.  It's set in an old brick warehouse\n          in a run-down section of town.\n<b>          \n</b>          JP's Range Rover pulls up and JP gets out, carrying a long slim\n          black bag.  He glances round the all-but-deserted street and\n          enters the club.\n<b>          \n</b><b>          \n</b><b>          INT.  JP'S PRIVATE ROOM   DAY\n</b><b>          \n</b>          CLOSE on Pinhead's face; in repose, back to its statue-like\n          state.\n<b>          \n</b>          The sound of the door OFF opens the monster's eyes.\n<b>          \n</b>          JP enters, closing the door behind him.\n<b>          \n</b>          He doesn't look at the pillar.  He stays by the door and keeps\n          his eyes on the long black bag he has brought in with him.\n<b>          \n</b>          He unzips it.  His manner is that of a man who has made a\n          decision and is not about to listen to contrary argument.\n<b>          \n</b><b>                                     PINHEAD\n</b>                               (off)\n                        Another offering?\n<b>          \n</b>          JP doesn't respond.  He draws a double-barrelled shotgun from\n          the bag, cocks it, and loads it.\n<b>          \n</b>          JP turns to face the pillar, drawing a bead on Pinhead.\n<b>          \n</b>          Pinhead's expression is wearily amused.\n<b>                                                                      47\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        I'm touched ... That is the gun you used\n                        to kill your parents?\n<b>          \n</b>          JP visibly staggers as Pinhead lets slip this knowledge.\n<b>          \n</b>          Pinhead smiles.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        I understand.  Their fortune was so\n                        tempting, their affection so\n                        conditional.  What else could you do?\n<b>          \n</b><b>                                     JP\n</b>                        Fuck you!\n<b>          \n</b>          He pulls the double trigger.\n<b>          \n</b>          A massive BLAST resounds around the room but that's about it;\n          the 30 ott six is absorbed magically into the pillar.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Thank you.  Now, shall we talk sensibly?\n<b>          \n</b>          JP lets the useless gun fall from his hand.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Don't flee from yourself.  If you have a\n                        quality, let it define you.  Cultivate\n                        it.  It is you.  By helping me, you will\n                        help yourse...\n<b>          \n</b><b>                                     JP\n</b>                        What!?  What are you talking about?  Why\n                        should I help you?\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Because you want to.  You've always\n                        wanted to.  Look at your pictures.  Look\n                        at your sculptures.  Look at those\n                        tawdry representations and then ...\n                        Imagine.  Imagine a world of the body as\n                        canvas.  The body as clay.  Your will\n                        and mine as the brush and the knife.\n                        Oh, I have such sights to show you.\n<b>          \n</b>          It's working.  JP's eyes are glittering with excited interest.\n<b>          \n</b><b>                                     JP\n</b>                        What are you?\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      48\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        A dark star rising.  I was bound to\n                        another's system by a soul I once\n                        possessed.  A friend relieved me of that\n                        inconvenience.  Now I'm free.  Born\n                        again of Blood and Desire.\n<b>          \n</b><b>                                     JP\n</b>                        Hey, that's what makes the world go\n                        round.\n<b>          \n</b>          Pinhead raises an amused eyebrow at JP's little joke.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        You see, we're not so dissimilar.\n<b>          \n</b><b>                                     JP\n</b>                        But how in God's name ...\n<b>          \n</b><b>                                     PINHEAD\n</b>                        God?  My God was diamond and black\n                        light.  And I was his Dark Pope.  All\n                        that is changed.  A terrible beauty is\n                        born.  With a place at my right hand for\n                        a man of your tastes.\n<b>          \n</b>          JP cruises the room, contemplating this.\n<b>          \n</b><b>                                     JP\n</b>                        How do we start?\n<b>          \n</b><b>                                     PINHEAD\n</b>                        It has already begun.\n<b>          \n</b><b>          \n</b><b>          INT.   TV STATION, EDITING SUITE   NIGHT\n</b><b>          \n</b><b>          ANGLE ON MONITORS\n</b><b>          \n</b>          Many screens fill the frame, all of them crackling with snow.\n<b>          \n</b><b>          CUT TO WIDE\n</b><b>          \n</b>          Joey is alone at the control desk.  She has a video tape in her\n          hand and feeds it into the master machine.\n<b>          \n</b>          She looks up at the still-ghosting monitors and then presses a\n          few buttons on the console.\n<b>          \n</b>          The snow is replaced by blackness on every monitor with a time\n          code ticking away at the bottom of each screen.\n<b>          \n</b><b>                                     JOEY\n</b>                               (softly)\n                        Alright ... Let's see what we got here.\n<b>                                                                      49\n</b><b>          \n</b>          The blackness on the monitors gives way to multiple images of\n          KIRSTY, the girl in the picture in the antique store.\n<b>          \n</b>          The video image is primitive, shot with a non-professional\n          camcorder, and is a simple medium long-shot of Kirsty, dressed\n          in a simple white smock, sitting in a hospital room.\n<b>          \n</b>          Kirsty addresses the camera directly, though occasionally looks\n          up to the side as if speaking to an unseen doctor.\n<b>          \n</b>          INTERCUT through Kirsty's monologue between: A single monitor\n          image, the wall of monitors, and the watching and listening\n          Joey.\n<b>          \n</b><b>                                     KIRSTY\n</b>                               (on video)\n                        I don't know what the Box is.  But I\n                        know what it does.  I ...    (looks up\n                        to side)     I've said all this before.\n                        Do you ...    (blinks, nods, as if\n                        listening.  Looks back to camera)  I saw\n                        it open.  I opened it.  I saw what came\n                        out.  I don't know what else to call\n                        them.  Demons.  Demons live in the box.\n                        Or come through the box from somewhere\n                        else.  It's a gateway to Hell.  Or the\n                        South Bronx.     (smiles ruefully at her\n                        own joke.  Looks up to side as if\n                        chastised for kidding around.  Nods.\n                        Continues)     I know you don't believe\n                        me.  I know what it sounds like.  But\n                        what else ... Jesus, talk to Ronson,\n                        talk to the other cops.  They saw the\n                        house.  They saw my ... my father ...\n<b>          \n</b>          Kirsty breaks down into sobs.\n<b>          \n</b><b>          QUICK-CUT TO JOEY\n</b><b>          \n</b>           - whose expression shows distressed sympathy.  She too has\n          lost her father.\n<b>          \n</b><b>          ANGLE ON MONITORS\n</b><b>          \n</b>          The video image breaks up into white noise and then comes back\n          in, as if the camcorder was turned off for a few moments.\n<b>          \n</b>          When the image returns, Kirsty is smoking a cigarette to help\n          calm her.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      50\n</b><b>          \n</b><b>                                     KIRSTY\n</b>                               (on video)\n                        Solving the puzzle means opening the\n                        box.  Opening the box means opening\n                        doors.  And there are some doors you\n                        don't want to open.  And it may be\n                        metaphorical to you, Doctor, but you\n                        haven't had some blue-faced bastard come\n                        at you with hooks and chains.  It isn't\n                        delusion, it isn't psychosis.  It's\n                        reality.  It's reality.     (Pause.\n                        Long drag on the cigarette?)   Maybe not\n                        this reality ... but there are others.\n                        I've seen them.\n<b>          \n</b>          Joey's face shows horrified fascination at Kirsty's story.\n          There is a conviction in the telling which is working on Joey.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          The room is dimly-lit.\n<b>          \n</b><b>          ANGLE ON FLOOR BY TV SET\n</b><b>          \n</b>          The floor is littered with video-boxes and tapes.  Other tapes\n          are piled on top of the VCR.  It's like somebody has been\n          viewing constantly for a week and hasn't put anything away.\n<b>          \n</b><b>          ANGLE ON SOFA AND COFFEE TABLE\n</b><b>          \n</b>          Many books are lying on the sofa, the table, and the floor.\n          Some are lying open, most are closed.\n<b>          \n</b>          Also on the coffee table are three different soft-drink cans, a\n          half- empty cup of coffee, and a very full ash-tray.\n<b>          \n</b><b>          ANGLE ON BOOKSHELFS\n</b><b>          \n</b>          Terri is standing by the bookshelfs, running her eyes and her\n          finger along some titles.\n<b>          \n</b>          Now we understand the chaos in the room.  Terri's home alone.\n          She's bored and trying to find something to hold her interest.\n<b>          \n</b>          She looks away from the shelves and walks idly over to the TV.\n<b>          \n</b>          The Box is back on top of the TV.  Terri's hand hovers near the\n          on/off switch of the TV.  Then it hesitates and picks up the\n          box instead.  Terri holds the box and looks at it.  Her face\n          becomes puzzled and she crosses the room to flick on a LIGHT.\n          She wanders back to the TV looking at the box.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      51\n</b><b>          \n</b>          It looks different.  Its edges are more sharply defined.  The\n          shard where it was broken from the pillar is smaller, smoother.\n          The detailed metal-work has some color back and is shining.\n<b>          \n</b><b>                                     TERRI\n</b>                        Jeez, Joey musta polished you up some.\n                        Sometimes I think she's wierder than me.\n<b>          \n</b>          Terri's voice trails off as she continues to look at the box.\n          She turns it in her hands, running her fingers over its\n          filigree surfaces.\n<b>          \n</b>          TRACK in slowly as she cups it in both hands, her eyes moving\n          from puzzlement to fascination and concentration.\n<b>          \n</b>          She rubs her thumbs over the designs.  TRACKING IN continues.\n          It's tense.  Is she going to try and work the puzzle?\n<b>          \n</b>          Suddenly .... BRRRRRRRRR ... the phone rings.\n<b>          \n</b>          Terri jumps in shock, nearly dropping the box.\n<b>          \n</b>          She puts the box back on top of the TV and crosses to the\n          phone.  She picks it up.\n<b>          \n</b><b>                                     TERRI\n</b>                        Joey?\n<b>          \n</b><b>                                     JP\n</b>                               (on phone)\n                        Not quite.\n<b>          \n</b><b>                                     TERRI\n</b><b>                        JP?\n</b><b>          \n</b><b>                                     JP\n</b>                        Live and in the flesh.  How're you\n                        doing, babe?\n<b>          \n</b><b>                                     TERRI\n</b>                        What do you want?\n<b>          \n</b><b>          \n</b><b>          INT.   JP'S PRIVATE ROOM   NIGHT\n</b><b>          \n</b>          CLOSE on JP's face as he speaks into a phone.\n<b>          \n</b><b>                                     JP\n</b>                        God, always questions.  What do I want?\n                        I don't want anything.  Just concerned\n                        about you.  Just checking in.\n<b>          \n</b><b>          INTERCUT BETWEEN ROOMS THROUGH CONVERSATION\n</b><b>          \n</b><b>          \n</b><b>                                                                      52\n</b><b>          \n</b><b>                                     TERRI\n</b>                        Yeah right.  How'd you get this number?\n<b>          \n</b><b>                                     JP\n</b>                        Will you relax?  Your little girlfriend\n                        left a card, remember?\n<b>          \n</b><b>                                     TERRI\n</b>                        Oh.  Yeah.  Yeah.  Well ... I'm fine.\n                        Things are great here.  Joey's going to\n                        get me a job at the TV station.  I'm\n                        meeting lotsa new people.  It's really\n                        great.\n<b>          \n</b><b>                                     JP\n</b>                        Really?\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah really.  I'm ...\n<b>          \n</b><b>                                     JP\n</b>                        No.  I mean, really?  Because I'm\n                        concerned for you, sweetheart.  I care\n                        about you.  I guess I miss you.  I'm\n                        sorry we split up.  I'm sorry I ...\n<b>          \n</b><b>                                     TERRI\n</b>                        You're apologizing?\n<b>          \n</b><b>                                     JP\n</b>                        Hey, it has been known.  C'mon Terri,\n                        I'm not that bad a guy.  I have regrets.\n                        I'd like to put things right.  Don't\n                        tell me you haven't thought about me.\n                        Huh?\n<b>          \n</b><b>                                     TERRI\n</b>                        Well ... of course I have.  I've\n                        thought.  I've ... Oh, JP, you were so\n                        horrible.  You really hurt me ...\n<b>          \n</b><b>                                     JP\n</b>                        I know.  I know.  It's bad.  I'm a bad\n                        person.  But I try not to be, Terri.  I\n                        really do.  And I really miss you.\n<b>          \n</b><b>                                     TERRI\n</b>                        I miss you too.\n<b>          \n</b><b>                                     JP\n</b>                        That's so good to hear, sweetheart.  It\n                        really is. You know, I .. are you alone?\n<b>          \n</b><b>                                     TERRI\n</b>                        Yes.\n<b>                                                                      53\n</b><b>          \n</b><b>                                     JP\n</b>                        Good ... Good ... Look, why don't you\n                        come over?  You know, nothing heavy,\n                        little drink maybe, little talk.  Just\n                        see how we both feel?\n<b>          \n</b><b>                                     TERRI\n</b>                        Oh, I don't ...\n<b>          \n</b><b>                                     JP\n</b>                        C'mon.  It'll be great.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          CLOSE on Terri's face - we can almost see her summon the will-\n          power to refuse.\n<b>          \n</b><b>                                     TERRI\n</b>                        No!  No.  I can't.  I just can't.\n<b>          \n</b>          She slams the phone down quickly before he can persuade her.\n          She takes a couple of deep breaths and walks away from the\n          phone.\n<b>          \n</b><b>                                     TERRI\n</b>                        Shit.  Shit.  Shit.  Shit.  Shit.\n<b>          \n</b>          She looks around.  She looks at the books.  She looks at the\n          videos.  She looks at the table.  She looks back at the phone.\n<b>          \n</b><b>          ANGLE ON PHONE\n</b><b>          \n</b>           - as it RINGS again.\n<b>          \n</b><b>          TERRI\n</b><b>          \n</b>           - shakes her head and turns the ansafone on.\n<b>          \n</b>          After two rings, the machine responds.\n<b>          \n</b><b>                                     JOEY\n</b>                               (ansafone message)\n                        Hi.  You've reached Joanne Summerskill.\n                        In spirit at least.  Please leave a\n                        message.  Thanks.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          54\n</b><b>          \n</b><b>                                     WOMAN\n</b>                               (on phone)\n                        Hello.  Ms. Summerskill, this is Sharon\n                        Leech again from K-YZY in Monterey.\n                        Sorry to call so late but I was\n                        wondering if you got my other message?\n                        Look, I probably shouldn't say this on\n                        tape but what the hell ... there's a job\n                        here if you want it.  Late-night news\n                        reader.  We think you'd be marvelous ..\n<b>          \n</b>          The machine BEEPS and cuts her off, leaving the message light\n<b>          FLASHING.\n</b><b>          \n</b>          CLOSE on Terri's face - disappointed and sad.\n<b>          \n</b><b>          \n</b><b>          INT.   TV STATION, EDITING SUITE   NIGHT\n</b><b>          \n</b>          Joey is still at the desk watching the bank of monitors.\n<b>          \n</b>          As Kirsty speaks, INTERCUT between Joey and the monitors.\n<b>          \n</b><b>                                     KIRSTY\n</b>                        (Looks to side)  Again?  (Shrugs. Looks\n                        back at camera)  The box.  I don't know\n                        where it came from.  I don't know who\n                        made it or why.  I only know what it\n                        does.  It hurts.  It hurts.   (Looks off\n                        to side as if listening.)  How?  (Looks\n                        back)  I don't know.  It kind of opens\n                        itself.  Your fingers move.  You learn.\n                        It wants to open, that's the thing.  And\n                        it knows when you want to open it.  And\n                        it helps.  And it opens.  And then they\n                        come.  The Cenobites.  The demons.\n<b>          \n</b><b>          ANGLE ON WALL OF MONITORS\n</b><b>          \n</b>          Multiple images of Kirsty speaking those last few lines.\n<b>          \n</b>          Suddenly, one - and only one - of the monitors suffers a WHITE\n<b>          NOISE WIPE-OUT.\n</b><b>          \n</b>          Joey glances up at the one ghosting monitor, puzzled - and then\n          freezes in shock.\n<b>          \n</b><b>          ANGLE ON MONITORS\n</b><b>          \n</b>           - as, on the one monitor, a new image suddenly appears:\n<b>          \n</b>          A hazy, black-and-white image (very grainy, like early\n          experimental TV images) of a thirtysomething man in early\n          twentieth century military uniform.\n<b>          \n</b><b>                                                                      55\n</b><b>          \n</b>          The man - ELLIOTT - stares directly out of the monitor screen\n          and, just as Kirsty finishes her last line (\"The cenobites. The\n          demons.\"), he speaks (in an English accent).\n<b>          \n</b><b>                                     ELLIOTT\n</b>                                   (on monitor)\n                        She's telling the truth, Joey.\n<b>          \n</b>          Another BURST of WHITE NOISE and the image is gone.\n<b>          \n</b>          Kirsty is back on that monitor, just like all the others.\n<b>          \n</b><b>                                     KIRSTY\n</b>                        Look, you can have me tell this ...\n<b>          \n</b>          Joey remains staring at the haunted monitor, numb with shock.\n          What the hell is going on?\n<b>          \n</b>          Kirsty's voice plays OFF as Joey stares.\n<b>          \n</b><b>                                     KIRSTY\n</b>                        ...  as often as you want.  There's not\n                        going to be any breakthrough.  You might\n                        think it's delusion, but it's not.  I\n                        saw them.  I looked into their eyes and\n                        they looked back at me.  Creatures from\n                        Hell.\n<b>          \n</b><b>          \n</b><b>          INT.   24-HOUR DINER   NIGHT\n</b><b>          \n</b>          A late-night coffee-shop in the early hours of the morning.\n          Classic American Diner.\n<b>          \n</b><b>          VARIOUS ANGLES\n</b><b>          \n</b>          Empty booths.\n<b>          \n</b>          A quiet counter.  A COP perches on a stool drinking coffee.\n<b>          \n</b>          A TRUCKER in a booth by himself bites methodically on a donut,\n          his eyes staring off into the vacancy of the night.\n<b>          \n</b>          In a corner booth, FOUR KIDS nurse cokes and smoke cigarettes.\n<b>          \n</b><b>          ANGLE ON TABLE\n</b><b>          \n</b>          A black coffee sits by an ash-tray holding a burning cigarette.\n<b>          \n</b><b>          REVEAL TERRI\n</b><b>          \n</b>           - sitting at the table staring at the coffee.\n<b>          \n</b>          She waits.  She takes a drag on the smoke.  She waits.  She\n          sips her coffee.  She waits.  She looks up across the diner.\n<b>                                                                      56\n</b><b>          \n</b><b>          TERRI'S POV\n</b><b>          \n</b>          The double doors of the diner's entrance.\n<b>          \n</b><b>          ANGLE ON TERRI\n</b><b>          \n</b>          She looks back down at her coffee.\n<b>          \n</b>          The sound of doors opening OFF.  Terri looks up again.\n<b>          \n</b><b>          ANGLE FROM DOORS - TERRI IN DISTANCE\n</b><b>          \n</b>          A WALKING POV as somebody approaches Terri, whose face breaks\n          into a nervous, ambiguous smile of welcome.\n<b>          \n</b><b>          REVERSE ANGLE - TERRI'S POV\n</b><b>          \n</b>           - as JP walks confidently to her table, smiling.\n<b>          \n</b><b>                                     JP\n</b>                        Hey, babe.  Thanks for coming.\n<b>          \n</b>          JP sits down opposite her.  He reaches over and pats her hand.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          Joey enters the unlit main room.  She glances across at the\n          sofa.  It's unoccupied.  Joey puts the light on.\n<b>          \n</b>          She grimaces at the chaos of the room - the piles of videos and\n          books - and crosses the room to the bedroom door.  She opens\n          the door and looks in.\n<b>          \n</b><b>                                     JOEY\n</b>                        Terri, we can't bunk up every night!\n                        People will ...\n<b>          \n</b>          The bedroom is empty, nobody on the bed.\n<b>          \n</b><b>                                     JOEY\n</b>                                    (off)\n                        ... talk.  ... Terri?\n<b>          \n</b>          Joey leaves the door and walks back into the main room.\n<b>          \n</b>          She looks around and then walks over to the phone.  Something\n          has caught her eye.\n<b>          \n</b><b>          ANGLE BY PHONE\n</b><b>          \n</b>          A hand-scrawled note by the phone reads ENJOY MONTEREY, YOU\n<b>          LIAR.\n</b><b>          \n</b>          JOEY registers the note.\n<b>                                                                      57\n</b><b>          \n</b><b>                                     JOEY\n</b>                        Oh shit.\n<b>          \n</b>          Joey shakes her head sadly.  What can she do?  It's the early\n          hours of the morning.  She has no idea where Terri is.  She\n          walks back to the bedroom and closes the door behind her.\n<b>          \n</b><b>          \n</b><b>          EXT.   DENSE JUNGLE   DAY     (JOEY'S DREAM)\n</b><b>          \n</b>          Thick green jungle foliage obscures the view of a POV camera.\n<b>          \n</b>          The sounds of confused battle are heard OFF; helicopters, gun-\n          fire, distant explosions, screams of the dying and the wounded\n<b>          \n</b>          Leaves and branches SMACK against the frame as the unseen\n          dreamer rushes confusedly through the dense forest.\n<b>          \n</b>          The voices of the Soldiers - distant, echoed, repeated - are\n          heard over the roar of battle.\n<b>          \n</b><b>                                     SOLDIER 1\n</b>                                        (off)\n                        He's going.  He's going.  He's going ...\n<b>          \n</b><b>                                     SOLDIER 2\n</b>                                        (off)\n                        We're losing him.  We're losing him.\n                        We're losing him ...\n<b>          \n</b>          The sound of their voices seems to prompt the POV camera to\n          more furious endeavor.\n<b>          \n</b>          It turns rapidly left and right, forcing its way through the\n          greenery until suddenly, with one last push through foliage\n          thick enough to be a single bush, the view changes completely.\n<b>          \n</b><b>          \n</b><b>          EXT.  FLANDERS FIELD (WW I)   DAY      (JOEY'S DREAM)\n</b><b>          \n</b>          The POV camera (Joey) walks out into another battlefield, one\n          of a different character.\n<b>          \n</b>          It appears to be early morning.  The skies are grey and\n          overcast.  In the distance plumes of black smoke spiral upward\n<b>          \n</b>          No jungle, no trees or grass.  The ground is baked mud\n          disfigured with deep trenches, re-inforced by wooden slats.\n<b>          \n</b>          The atmosphere is post-conflict; guns are silent, there are no\n          cries or sound of machinery.\n<b>          \n</b>          Scattered around are corpses of many khaki-clad soldiers.\n<b>          \n</b><b>          \n</b><b>                                                                      58\n</b><b>          \n</b>          Nothing moves.  No birds sing.  It is a horrible, desolate\n          image from the bloody pages of history.  The fields of Flanders\n          in World War One.\n<b>          \n</b>          A noise begins to be heard OFF.  A low angry BUZZING.\n<b>          \n</b><b>          ANGLE ON DEAD SOLDIER\n</b><b>          \n</b>          A cloud of buzzing flies are feeding on the flesh of his poor\n          dead face.\n<b>          \n</b><b>                                     JOEY\n</b>                                     (off)\n                        Noooooooooo .......\n<b>          \n</b>          The buzzing and Joey's anguished cry both CONTINUE OVER as we\n<b>          \n</b><b>          CUT TO\n</b><b>          \n</b><b>          \n</b><b>          INT.   JOEY'S BEDROOM   NIGHT\n</b><b>          \n</b>          Joey sitting up in bed, eyes wide, still screaming.\n<b>          \n</b><b>                                     JOEY\n</b>                        Nooooooooooo!\n<b>          \n</b>          The cry cuts off abruptly as Joey realizes where she is.\n<b>          \n</b>          She catches her breath and then freezes as she realizes that\n          the buzzing sound from her dream is present in her bedroom.\n          Are the flies still feeding?  She glances around her room.\n<b>          \n</b><b>          ANGLE ON BEDROOM TV - JOEY'S POV\n</b><b>          \n</b>          Her TV set is on.  The buzzing sound comes from white noise.\n<b>          \n</b>          Joey is puzzled and scared.\n<b>          \n</b><b>                                     JOEY\n</b>                        Is somebody here?  Is somebody here!?\n                        Terri ... ?\n<b>          \n</b>          She half gets out of bed and then stops, transfixed, as the TV\n          screen's white noise is replaced by an image.\n<b>          \n</b><b>          ANGLE ON TV\n</b><b>          \n</b>          As in the editing suite, the image is grainy black-and-white.\n<b>          \n</b>          The buzzing continues, now joined by HISSING and WHISTLING that\n          fades in and out as if unseen hands are trying to tune into an\n          impossibly distant station.\n<b>          \n</b><b>          \n</b><b>                                                                      59\n</b><b>          \n</b>          Somewhere in the sound-montage we can almost hear GHOSTLY\n          VOICES whispering; \"Joey, Joey, Joey ... \"\n<b>          \n</b>          On the screen, an English Officer - Elliott - is sitting cross-\n          legged on the floor of a Quonset hut.\n<b>          \n</b>          On the floor in front of him is something at which he stares -\n          something that the image is not sharp enough to show.\n<b>          \n</b><b>          WIDER ANGLE - JOEY AND TV\n</b><b>          \n</b>          Fear vies with fascination in Joey's expression.\n<b>          \n</b><b>                                     JOEY\n</b>                        What ... What's going on?  What's\n                        happening?\n<b>          \n</b><b>          ANGLE ON TV\n</b><b>          \n</b>          The image disappears in a burst of STATIC which in turn is\n          replaced by another image, still monochrome and grainy; A head-\n          and-shoulders of Elliott, staring directly out of the screen.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        You have to help me, Joey.\n<b>          \n</b>          A burst of STATIC and the image disappears completely. The TV\n          is obviously not turned on.  The room is silent.\n<b>          \n</b>          Joey stares at her dead TV in numbed silence.\n<b>          \n</b>          She falls back into bed, pulling the covers protectively around\n          her, staring at the ceiling.\n<b>          \n</b><b>          \n</b><b>          INT.   JP'S PRIVATE ROOM   NIGHT\n</b><b>          \n</b><b>          BLACKNESS\n</b><b>          \n</b>          A CLICK is heard OFF and the room is lit, REVEALING JP by the\n          door, his finger by the light-switch.  He smiles into the room\n          and walks in, looking behind as Terri hesitates by the door.\n<b>          \n</b><b>                                     JP\n</b>                        Come on in.\n<b>          \n</b>          Terri moves past him.\n<b>          \n</b>          JP locks the door with a key he draws from his pocket.\n<b>          \n</b>          Terri registers this.  JP calms her.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      60\n</b><b>          \n</b><b>                                     JP\n</b>                        Not a good neighborhood.  People\n                        disappear.  (a beat)  Feel like home?\n                        It's just like you left it.\n<b>          \n</b>          Terri moves into the room, glancing around herself cautiously.\n          She registers the pillar.\n<b>          \n</b><b>          ANGLE ON PILLAR\n</b><b>          \n</b>          It's plainly different from the last time Terri saw it but -\n          despite what the audience knows about it - it still seems\n          inanimate; a black frozen carving, disturbing but harmless.\n<b>          \n</b><b>                                     TERRI\n</b>                        Not quite.  This wasn't here.\n<b>          \n</b><b>                                     JP\n</b>                        No.  But, as you can see, I'm having\n                        some work done on it.  You found a real\n                        treasure for me, Terri.  I hope I can\n                        show you how grateful I am.\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah ... yeah, it looks different.\n<b>          \n</b><b>                                     JP\n</b>                        Yeah, a girl I know helped smarten it\n                        up.  Put her heart and soul into it.\n<b>          \n</b><b>                                     TERRI\n</b>                        A girl?  Anyone I should know?\n<b>          \n</b><b>                                     JP\n</b>                        Not now, no.  I mean - now that you're\n                        here, it's like she doesn't even exist,\n                        you know what I mean?\n<b>          \n</b>          JP has been cruising the room as they speak.  Now he's standing\n          close to the pillar.  Terri is still some distance from him.\n<b>          \n</b><b>                                     TERRI\n</b>                        Yeah right.  Look ...\n<b>          \n</b><b>                                     JP\n</b>                        Terri, listen.    (a beat)   Why don't\n                        you come here and kiss me?  I mean, it's\n                        probably ticking away in both our minds,\n                        right?  Is it going to happen?  Isn't it\n                        going to happen?  Let's get it out of\n                        the way.  See how we feel.  Then we can\n                        relax.  Talk.  You know.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      61\n</b><b>          \n</b>          A pause - a tense one for the audience who know that JP has\n          obviously decided who Pinhead's next meal is.  Terri looks at\n          JP, half suspicious, half attracted.\n<b>          \n</b><b>                                     TERRI\n</b>                        I don't think so.  Not yet.  I'm not\n                        ready yet.\n<b>          \n</b><b>                                     JP\n</b>                        Sure.  Sure.  I understand.  It's cool.\n                        I mean, we've got all night.\n<b>          \n</b>          JP smiles winningly and warmly.  A nice guy.  A nice smile.  A\n          smile a girl can trust.\n<b>          \n</b>          The pillar stands behind him, its dark inhabitant still and\n          silent, waiting for the sacrifice.\n<b>          \n</b><b>          \n</b><b>          INT.   UNDER THE UNDERGROUND   NIGHT\n</b><b>          \n</b>          Series of shots (maybe all CROSS-FADED) of kids dancing and\n          drinking in the club to establish the passing of time - and to\n          highlight the tension of the scene in JP's room by its\n          proximity to this (relative) normality.\n<b>          \n</b><b>          \n</b><b>          INT.   JP'S PRIVATE ROOM   NIGHT    (MINUTES LATER)\n</b><b>          \n</b>          JP lounges against his wall, smoking, close to the pillar.\n<b>          \n</b>          Terri is sitting on the bed.  She's upset.  She's been telling\n          JP about Joey and the phone message.\n<b>          \n</b><b>                                     JP\n</b>                        That's terrible.  What a bitch.  She was\n                        obviously just using you, Terri.  Ready\n                        to dump you the second she had what she\n                        needed, interfering little whore.\n<b>          \n</b><b>                                     TERRI\n</b>                        No.  It isn't ... she wouldn't ... It's\n                        like I must have done something wrong,\n                        you know?  Freaked her out.  Just fucked\n                        up something good again.\n<b>          \n</b><b>                                     JP\n</b>                        Hey, you didn't fuck it up with me.  You\n                        know that.  It was my fault, babe, it\n                        really was.  And you know I'm sorry.\n                        And I'm sorry to see you upset now.  I\n                        hate to see you in pain like this.\n<b>          \n</b>          Terri looks up at him, her eyes vulnerable, on the verge of\n          tears.  She really wants to believe that he's being a nice guy.\n<b>                                                                      62\n</b><b>          \n</b><b>                                     TERRI\n</b>                        Really?\n<b>          \n</b><b>                                     JP\n</b>                        Yes!  God, yes.  I ... I just want to\n                        hug you.  To hold you.  To tell you it's\n                        alright.\n<b>          \n</b>          God, the bastard's good at this.  Terri breaks into small sobs\n          and holds her arms out for him.\n<b>          \n</b><b>                                     JP\n</b>                        No.  No, sweetheart, you come to me.\n                        It's not fair.  I come over there.  You\n                        know.  We're on the bed.  I just ...\n                        'cos you know how much you excite me.\n                        God, just looking at you.  You're so\n                        beautiful.  I come over there and I'd\n                        just want to touch you.  Feel you.  Kiss\n                        you.  And that isn't what this is about.\n                        C'mon, babe, come to daddy.  Let me make\n                        it better.\n<b>          \n</b>          Terri wipes her eyes, gives a small shy smile and stands up.\n<b>          \n</b>          She's walking toward JP.  And the pillar.\n<b>          \n</b>          JP puts a hand out.  He smiles.  Re-assuring.  Loving.\n<b>          \n</b>          Terri walks.  Vulnerable.  So in need of reassurance and love.\n<b>          \n</b><b>          WIDER ANGLE -JP, TERRI, PILLAR\n</b><b>          \n</b>          She's getting closer ... closer ... closer ...\n<b>          \n</b><b>          CLOSE ANGLE ON JP\n</b><b>          \n</b>           - as he blows it.  A sidelong glance at the pillar?  A sudden\n          naked hunger in the smiling eyes?  A single bead of sweat?\n          Some tiny little thing that takes the lid off his game.\n<b>          \n</b>          Terri stops dead.  She doesn't know what's happening but\n          suddenly this doesn't feel right.\n<b>          \n</b><b>                                     TERRI\n</b>                        No ... Wait a ...\n<b>          \n</b><b>          EVERYTHING ERUPTS!\n</b><b>          \n</b>          JP, smiling mask wiped off, leaps at Terri.\n<b>          \n</b>          Terri flings herself backward, screaming in shock and fear.\n<b>          \n</b>          Pinhead: suddenly animate and furious; eyes wide open, face\n          contorted in frustrated rage, black arms clawing at the air.\n<b>                                                                      63\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        Bring her to me, boy!\n<b>          \n</b>          A furious, confused scene of tension and struggle.\n<b>          \n</b>          JP has hold of Terri, trying to drag her to the monster.\n<b>          \n</b>          Terri fights back, screaming her disbelief and struggling and\n          kicking against him.  They are perilously close to the pillar.\n<b>          \n</b>          Pinhead is furious - roaring, tearing at the pillar with his\n          hands as if trying to physically rip himself. free of it.\n<b>          \n</b>          Slowly, JP's size and strength is telling; Terri is being\n          dragged nearer and nearer to the demon.\n<b>          \n</b>          At the last possible second - when it seems it's all over, when\n          Pinhead's snatching fingers are centimeters from Terri's flesh\n          - Terri snatches up a heavy ornament from a shelf by the pillar\n          and smashes JP right across the head with it.\n<b>          \n</b>          JP collapses semi-conscious at the foot of the pillar.\n<b>          \n</b>          Terri throws herself back from the monster's grabbing arms.\n<b>          \n</b>          Pinhead snarls in frustration, hands clenched in fists of rage.\n<b>          \n</b><b>          WIDER ANGLE\n</b><b>          \n</b>          Terri - safely feet away from the pillar - stands, shaking and\n          breathless, eyes wide in horror and shock as she stares at this\n          creature from nightmare.\n<b>          \n</b>          And suddenly Pinhead changes tack; he slides from the roaring\n          beast of a moment before to his more usual persona - the glib,\n          articulate Black Pope of Hell.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Wait!  Why run?  Where to?  Do you know\n                        where you are?\n<b>          \n</b><b>                                     TERRI\n</b>                        I'm ... I'm ...\n<b>          \n</b><b>                                     PINHEAD\n</b>                        You're at the door of dreams.  And you\n                        can open it.\n<b>          \n</b><b>                                     TERRI\n</b>                        What are you talking about?\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      64\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        There are two keys in this room.  On is\n                        in the pocket of this fool.  You could\n                        take it out without me reaching you. (a\n                        beat)  Probably.  And you could use it\n                        to let yourself back in to the world you\n                        know.  The world you've always known;\n                        banal, hopeless, dreamless.\n<b>          \n</b>          Pinhead, as ever, is hitting the right buttons.  Terri, as we\n          know, has dreamed of dreaming.\n<b>          \n</b><b>                                     TERRI\n</b>                        And ... like ... the other?\n<b>          \n</b><b>                                     PINHEAD\n</b>                        The other is the key to dreams.  To a\n                        world of black miracles and dark wonder.\n                        Another life of unknown pleasures.  It's\n                        yours.  Complete the pattern.  Solve the\n                        puzzle.  Turn the key.\n<b>          \n</b><b>          ANGLE ON TERRI\n</b><b>          \n</b>           - as she looks at the monster.  And smiles.\n<b>          \n</b><b>                                     TERRI\n</b>                        Where is it?\n<b>          \n</b>          Pinhead returns the smile.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        It's lying bleeding at your feet.\n<b>          \n</b>          JP is on the floor, semi-conscious, bleeding from the head.\n<b>          \n</b><b>                                     JP\n</b>                               (delerious. Ad-lib)\n                        Unhhh ... Terri ... what ... no ...\n<b>          \n</b>          Terri edges around the pillar to grasp one of JP's limp arms.\n<b>          \n</b><b>          INTERCUT CLOSE-UPS OF PINHEAD AND TERRI\n</b><b>          \n</b>           - as the bond between tempter and tempted is strengthened.\n<b>          \n</b>          Terri holds JP's arm out ...\n<b>          \n</b>          Pinhead stretches his own arm forward ...\n<b>          \n</b>          And JP finally - for one brief second of terrifying clarity -\n          realizes what's happening.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      65\n</b><b>          \n</b><b>                                     JP\n</b>                                (screaming)\n                        No! Terri! Please! I didn't mean to..!!\n<b>          \n</b>          Too late.  Pinhead's hand closes around his wrist.\n<b>          \n</b>          Terri leaps back out of harm's way.\n<b>          \n</b>          Pinhead - with awesome strength - yanks JP up to his feet and\n          pulls him close.  He stares into the terrified face of JP.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        I have such sights to show you.\n<b>          \n</b>          JP is sucked dry by Pinhead.\n<b>          \n</b>          And Terri watches, her face perversely excited by this - the\n          first of the dark miracles that the monster had promised.\n<b>          \n</b><b>          MAJOR F/X SEQUENCE\n</b><b>          \n</b>           - as the transformation of pillar into Pinhead is completed.\n<b>          \n</b><b>          WIDER ANGLE\n</b><b>          \n</b>          Pinhead, fully-fleshed and incarnate, stands in the room.  At\n          his feet are the dry husk that was JP and the steaming, hissing\n          remnants of the pillar like a pool of black toxic oil.\n<b>          \n</b>          He turns and looks at Terri.  Slowly, elegantly, he walks\n          toward her.\n<b>          \n</b>          Terri backs away across the room.  But she backs off slowly,\n          sensuously, like an eager but nervous virgin bride ready for\n          her groom.\n<b>          \n</b>          Camera moves in CLOSE on her glowing eyes and excited face.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          CLOSE on the Box.  A cloud of dust spirals out into the room in\n          a reverse action of the dust in the antiques store.\n<b>          \n</b><b>          \n</b><b>          INT.   JOEY'S BEDROOM   NIGHT\n</b><b>          \n</b>          CLOSE on Joey's sleeping face.  REM shows beneath her eyelids\n          and she murmurs in her sleep.\n<b>          \n</b>          Very faintly OFF is the sound of distant music.\n<b>          \n</b>          Joey's eyes snap open and glance from side to side.  She sits\n          up in bed and registers the music, which seems to have grown in\n          volume on her waking.\n<b>                                                                      66\n</b><b>          \n</b>          It is strange, old-fashioned music;  A palm-court string\n          orchestra playing a sentimental waltz tune reminiscent of the\n          1920's or earlier.\n<b>          \n</b>          Joey looks around the room.\n<b>          \n</b>          There is no-one in the room.\n<b>          \n</b>          The TV set is still dead.\n<b>          \n</b>          But ... the bedroom door is open a crack and a very strange DIM\n          ORANGE LIGHT is creeping in from the main room.  And that seems\n          to be from where the music is coming.\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b>           - as she gets out of bed.\n<b>          \n</b>          She's cautious and careful, moving slowly and quietly as she\n          wraps a robe around herself and moves to the door.\n<b>          \n</b>          The music continues to play.\n<b>          \n</b>          She opens the door slowly and walks through.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          This room too is empty.\n<b>          \n</b>          The music is louder and the soft warm pulse of the orange light\n          is more distinct, bathing the walls and the furniture.\n<b>          \n</b><b>          VARIOUS ANGLES - JOEY'S POV\n</b><b>          \n</b>           - as Joey tries to locate the source of the music and the\n          light;\n<b>          \n</b>          The sofa.\n<b>          \n</b>          The bookshelfs.\n<b>          \n</b>          The TV - with the still and inactive Box.\n<b>          \n</b>          The closed drapes over the big picture window.\n<b>          \n</b>          Finally -\n<b>          \n</b><b>          ANGLE ON CLOSET DOOR\n</b><b>          \n</b>          Both the music and the light seem to be centered on the closet\n          door across the room.  They're both coming from behind it.\n<b>          \n</b>          Joey approaches the closet, still tense, still careful.  She\n          opens the closet door and looks in.\n<b>                                                                      67\n</b><b>          \n</b>          The closet is where Joey has stored her past.  But she's stored\n          it neatly.\n<b>          \n</b>          Boxed and piled on shelves are old magazines, old greetings\n          cards, old photographs, old soft-toys, college diplomas,\n          clippings from small-town newspapers (\"Death of a Local Hero:\n          Tommy Summerskill lost in Vietnam\", \"Joanne Summerskill Class\n          Valedictorian: looks to career in Media\") etc etc.\n<b>          \n</b>          Also in there, stuffed away at the top of the closet, is an old\n          radio - a big old wood-and-wire-grille valve driven beauty from\n          which the lilting music is coming.\n<b>          \n</b>          At some stage in its life, part of its casing was smashed away\n          and the pulsing orange light is its flickering vacuum tubes.\n<b>          \n</b>          It's an old mains-powered model and its mains cord dangles off\n          the shelf of the closet.  This radio isn't plugged into\n          anything except the paranormal.\n<b>          \n</b>          CLOSE on Joey; staring at this broadcast from the beyond.\n<b>          \n</b><b>                                     JOEY\n</b>                        How .... ?\n<b>          \n</b>          Joey reaches up and brings the radio down from the shelf and\n          out into the main room.  She sets it down on the coffee table\n          in front of the sofa.\n<b>          \n</b><b>          DIFFERENT ANGLE\n</b><b>          \n</b>          Formal, classical framing from a low angle - Joey and radio in\n          foreground, big picture window and its closed drapes in the\n          background.\n<b>          \n</b>          Joey kneels up in front of the table.\n<b>          \n</b>          She stares at the radio with the same kind of trapped\n          fascination with which we have seen characters in the previous\n          HELLRAISER movies stare at the Box.\n<b>          \n</b>          Her fingers are drawn to the tuning dial as if to a puzzle.\n          She plays with the dial, moving through various \"stations\".\n<b>          \n</b>          Joey's face is open with expectation as she moves through them,\n          as if she is waiting for clues.  Or instructions.\n<b>          \n</b>          The music gives way to various VOICES;\n<b>          \n</b>          An Indian voice giving some kind of commentary.  The English\n          words \"BBC\" and \"World Service\" are heard amidst the punjabi.\n<b>          \n</b>          (Joey turns the dial)\n<b>          \n</b>          A tired sad English voice;\n<b>                                                                      68\n</b><b>          \n</b><b>                                     ENGLISH VOICE\n</b>                               ... and the King has sent a\n                        personal message of sympathy to the\n                        parents of those brave men who ...\n<b>          \n</b>          (Joey turns the dial)\n<b>          \n</b>          A resonant French voice;\n<b>          \n</b><b>                                     FRENCH VOICE\n</b>                        L'Oiseau chante avec ses doigts.  Deux\n                        fois.\n<b>          \n</b>          (Joey turns the dial)\n<b>          \n</b>          Another burst of music, this time more raucous and syncopated.\n          A ragtime tune from the birth of Jazz.\n<b>          \n</b>          (Joey turns the dial)\n<b>          \n</b>          Dead Air.  An ominous pause.  And Elliott's voice.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Joey.  Look out your window.\n<b>          \n</b>          Joey shrinks back in nervous shock at this direct address.\n<b>          \n</b>          The radio goes dead.  The tubes stop glowing.  The room is now\n          a dimly-lit place of shadow and suspense.\n<b>          \n</b>          Joey glances back over her shoulder at her closed drapes and\n          then at the silent radio.\n<b>          \n</b>          She stands up slowly and crosses to the drapes.  The camera\n          rises and TRACKS in as she walks, framing those drapes like\n          curtains in a theater.\n<b>          \n</b>          With one strong gesture, Joey sweeps the drapes open.  And\n          gasps.\n<b>          \n</b>          Instead of neighboring roof-tops and a view of the city, Joey\n          is looking directly into the interior of a Quonset hut.\n<b>          \n</b>          It is the image from her TV set though full-size, full-color,\n          and apparently real.\n<b>          \n</b>          At the far end, Elliott sits cross-legged on the floor.  In\n          front of him on the floor is the puzzle box.\n<b>          \n</b>          Elsewhere in the hut; A camp-bed on which lie a gun-belt and an\n          Officer's peaked cap.  And an old-fashioned radio - the same\n          radio that is still in Joey's room.\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b><b>                                                                      69\n</b><b>          \n</b>           - as she stares beyond her window into this impossible scene.\n<b>          \n</b><b>                                     JOEY\n</b>                        Tell me ... Tell me ... Hello?\n<b>          \n</b>          CLOSER on the elements in the hut, as we (and Joey) realize\n          that everything in there is frozen in time.  There is no\n          movement, no sound.\n<b>          \n</b>          Wonderingly (but carefully) Joey stretches her arm out before\n          her.  When her arm reaches the threshold of the Quonset hut, it\n          disappears into the space once occupied by window glass.\n<b>          \n</b>          She pulls her arm back sharply with an intake of breath.  Maybe\n          she even takes a half-step backward.\n<b>          \n</b><b>                                     JOEY\n</b>                        I'm seven floors up ... I'm seven floors\n                        up! I can't ...\n<b>          \n</b>          But she can.\n<b>          \n</b>          She summons her courage, steps over the sill, and walks into\n          the impossible.\n<b>          \n</b><b>          \n</b><b>          INT.   QUONSET HUT\n</b><b>          \n</b>          We are looking at a solid wall.  Then, through the wall, Joey\n          walks into the Hut, still bewilderment by the sights around\n          her.\n<b>          \n</b>          Still the image does not move.  Everything is very real, very\n          present.  But frozen.\n<b>          \n</b>          Joey approaches the immobile Elliott and looks from him to the\n          box and back again.\n<b>          \n</b>          (NB: Joey's speeches to the frozen Elliott are bravado; her\n          face and body language betray her awed nervousness at the\n          bizarre situation in which she finds herself.)\n<b>          \n</b><b>                                     JOEY\n</b>                        Now what?  I'm here.  Now what?  I just\n                        walked into madness for you.  Talk!\n<b>          \n</b>          Joey looks back behind her.\n<b>          \n</b><b>          ANGLE ON HUT WALL - JOEY'S POV\n</b><b>          \n</b>          There is no window back into the apartment, just a fourth wall.\n<b>          \n</b><b>          ANGLE ON JOEY AND ELLIOTT\n</b><b>          \n</b><b>          \n</b><b>                                                                      70\n</b><b>          \n</b><b>                                     JOEY\n</b>                        Great.  That's just great!  You bring me\n                        here.  You freeze up on me.  And now\n                        there's no way out.  I've had dates like\n                        you before.  I ...\n<b>          \n</b>          A CREAK is heard OFF.  Joey looks up.\n<b>          \n</b><b>          JOEY'S POV\n</b><b>          \n</b>          At the far end of the Quonset Hut, behind Elliott, a door has\n          creaked open an inch or two.\n<b>          \n</b>          Joey looks from the door back to the frozen Elliott.\n<b>          \n</b><b>                                     JOEY\n</b>                        Thanks.  I think.\n<b>          \n</b>          Joey crosses to the door and opens it.  She walks through.\n<b>          \n</b><b>          \n</b><b>          EXT.   FLANDERS FIELD   DAY\n</b><b>          \n</b>          Joey walks out onto the World War One battlefield of her most\n          recent dream.  She stands there - an incongruous vulnerable\n          figure in her nightdress and robe - amidst the corpses, the\n          trenches, and the distant plumes of smoke.\n<b>          \n</b><b>                                     JOEY\n</b>                        What's going on?  Is this a dream?\n<b>          \n</b>          She glances back at the door of the hut she has just left.\n<b>          \n</b><b>          JOEY'S POV - THROUGH HUT DOOR\n</b><b>          \n</b>          Within the hut, the frozen Elliott still sits.\n<b>          \n</b><b>          ANGLE ON JOEY\n</b><b>          \n</b>           - as she turns from looking into the hut and gasps, her eyes\n          wide in shock.\n<b>          \n</b>          Standing on a hillock, framed against the grey battlefield\n          skies, is Elliott.\n<b>          \n</b>          Joey walks toward him.\n<b>          \n</b>          Elliott stands calmly and smiles at Joey.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Joey.  How kind of you to come.\n<b>          \n</b>          A beat.  Joey (and the audience) take in Elliott's impossible\n          presence, as she and he stand amidst the corpse-strewn field.\n<b>          \n</b><b>                                                                      71\n</b><b>          \n</b><b>                                     JOEY\n</b>                        Wait ... wait.  You ... you have to help\n                        me.  I don't understand.  Am I dreaming\n                        this?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        You have to help me.  You will\n                        understand.  And no, you're not\n                        dreaming.  Do you know where we are?\n<b>          \n</b><b>                                     JOEY\n</b>                        It's ... I don't know.  First World War,\n                        right?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Correct.  The fields of France.  And\n                        many dead flowers ... Oh.  Forgive me.\n                        My name was Spenser.  Elliott Spenser.\n                        Captain.\n<b>          \n</b>          He extends his hand.\n<b>          \n</b>          Joey - slowly and nervously - puts her hand out to shake his.\n<b>          \n</b><b>                                     JOEY\n</b>                        Joey Summerskill.\n<b>          \n</b>          Elliott smiles understandingly as he releases her hand.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Well done.  Brave girl.  You've probably\n                        never shaken hands with a ghost before,\n                        am I right?\n<b>          \n</b><b>                                     JOEY\n</b>                        Captain Spenser.  Elliott.  I ... What\n                        the Hell is going on?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Hell is precisely what is going on,\n                        Joey.  And we have to stop it.  I\n                        because of a special obligation, you\n                        because you're the only person who can\n                        help. And because you know what is\n                        right, and just, and true.  Will you\n                        walk with me a while?\n<b>          \n</b>          He gestures with his hand and they begin to walk.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      72\n</b><b>          \n</b><b>                                     ELLIOTT\n</b>                        There were days in this war, days right\n                        on top of each other, when the newly\n                        dead were numbered in the tens of\n                        thousands.  They called it the war to\n                        end all wars.  Though it didn't.  You\n                        know that.  There were more wars.  More\n                        dead.  Your father's war.  Your dream\n                        search for your father led you here.  To\n                        me.  Joey, we need to talk.\n<b>          \n</b>          Elliott does nothing dramatic - he doesn't clap his hands or\n          snap his fingers - but somehow, magically, he and Joey, without\n          moving or changing position are back in the Quonset hut.\n<b>          \n</b><b>          \n</b><b>          INT.   QUONSET HUT\n</b><b>          \n</b>          The frozen Elliott is still sitting on the floor before the\n          box.  The mobile Elliott gestures at his frozen self as he\n          speaks to the bemused Joey.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        The war pulled poetry out of some of us.\n                        Others it affected differently.  This is\n                        me a few years later.  We're in India,\n                        by the way, and it's 1921.  I was like\n                        many survivors. Lost souls with nothing\n                        left to believe in but gratification.\n                        We'd seen God fail, you see.  So many\n                        dead.  For us God, too, fell at\n                        Flanders.  We adjusted to the loss.  And\n                        if we mourned, we mourned in silence.\n                        Thousands drank themselves to death.\n                        Others went further.  I went further.  I\n                        thought I was a lost soul.  But, until\n                        this frozen moment, I didn't even know\n                        what the phrase meant.\n<b>          \n</b><b>                                     JOEY\n</b>                        And what is ... this frozen moment?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        The cusp of my life.  What I was, what I\n                        am, what I will be ... past, present,\n                        future, all bound here at this timeless\n                        moment of decision.  I was an explorer\n                        of forbidden vices and pleasures.\n                        Opening the Box was my final act of\n                        exploration, of discovery.\n<b>          \n</b><b>                                     JOEY\n</b>                        And what did you discover?\n<b>          \n</b><b>          \n</b><b>                                                                      73\n</b><b>          \n</b><b>                                     ELLIOTT\n</b>                        Something bad.\n<b>          \n</b><b>                                     JOEY\n</b>                        And why are you back?  Why are we here?\n<b>          \n</b>          Again, no signal from Elliott but the background changes\n          magically once more;\n<b>          \n</b><b>          \n</b><b>          EXT.   FLANDERS FIELD   DAY\n</b><b>          \n</b>          Elliott is once again framed dramatically on the hillock, Joey\n          standing close.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Because something worse is coming.\n<b>          \n</b>                                     (a beat)\n<b>          \n</b>                        I opened the Box, Joey.  I found the\n                        monster within it.  And it found the\n                        monster within me.  For decades I served\n                        Hell with no memory of my former life\n                        until a friend released me.  You saw\n                        her.\n<b>          \n</b><b>                                     JOEY\n</b>                        Kirsty Cotton.  Yes.  But ... if your\n                        soul was freed, why are you back?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Because - monster as I was - I was bound\n                        by Laws.  The protocol of Hell.  The Box\n                        had to be opened to let me out.  The\n                        truly innocent were safe.  That's no\n                        longer true.  The shell of the beast has\n                        been fleshed.  What I was is out there,\n                        Joey.  In your world.  Unbound.\n                        Unstoppable.\n<b>          \n</b><b>                                     JOEY\n</b>                        What will he do?  What does he want?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        He'll do what he does best.  But he'll\n                        do it unfettered.  He wants to walk the\n                        Earth forever, indulging his taste for\n                        all the myriad subtleties of human\n                        suffering.\n<b>          \n</b><b>                                     JOEY\n</b>                        What can we do?\n<b>          \n</b><b>          \n</b><b>                                                                      74\n</b><b>          \n</b><b>                                     ELLIOTT\n</b>                        I like you, Joey.  You ask all the right\n                        questions.  There is something we can do\n                        but it will require great courage.\n<b>          \n</b><b>                                     JOEY\n</b>                        I don't know ...\n<b>          \n</b>          Elliott reaches out and strokes her cheek.  Gently.  Lovingly.\n          We see in Joey's eyes that there is a response there.  A\n          response beyond the comradely.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Joey, you walked through your window\n                        from one reality to another.  You're\n                        stronger than you think.\n<b>          \n</b><b>                                     JOEY\n</b>                        Then tell me what to do.\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        This is his first night on Earth.  He\n                        wants to close the door behind him.\n                        Like all Lieutenants, he covets command.\n                        There's a gateway to Hell through which\n                        he can be taken back.  He has to destroy\n                        it.\n<b>          \n</b><b>                                     JOEY\n</b>                        So where is it?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Your apartment.\n<b>          \n</b>          Joey gasps.\n<b>          \n</b><b>                                     JOEY\n</b>                        Wha .... ?\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        The Box, Joey.  He wants the Box.\n<b>          \n</b><b>          \n</b><b>          INT.   UNDER THE UNDERGROUND   NIGHT\n</b><b>          \n</b>          Lights flash.  Music pounds.  Kids dance.  It's a wild night at\n          Under The Underground and it's about to get wilder.\n<b>          \n</b>          The source music (thrash metal) builds and builds, as if\n          heading for a climax.  And then the climax comes.\n<b>          \n</b><b>          ANGLE ON DOOR TO JP'S ROOM\n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      75\n</b><b>          \n</b>          The door BLASTS open explosively from within.  The pieces of\n          the shattered door FLY across the dance-floor, accompanied by\n          chunks of plaster and brick from the door-surround.\n<b>          \n</b><b>          VARIOUS ANGLES (QUICK CUTS)\n</b><b>          \n</b>          Flying wood and masonry hit people.\n<b>          \n</b>          One chunk SMASHES into the DJ console, bringing the music to a\n          scratching, screeching end.\n<b>          \n</b>          Various SCREAMS are heard OFF through the ensuing silence.\n<b>          \n</b>          In the confusion, kids scramble for the main doorway.  Is it a\n          bomb?  Is it a street-gang attack?\n<b>          \n</b>          The Main Doorway SLAMS supernaturally shut, bolts flying into\n          place untouched by human (or inhuman) hand.\n<b>          \n</b>          Confused and frightened faces turn back to look at the source\n          of the explosion.\n<b>          \n</b><b>          ANGLE ON DOORWAY TO JP'S ROOM\n</b><b>          \n</b>          Lit from behind by blinding beams of BLUE LIGHT, Pinhead\n          emerges through the doorway.  Slow.  Elegant.  Terrifying.\n<b>          \n</b>          Pinhead surveys the scene before him and the terrified and awe-\n          struck crowd look back at him.\n<b>          \n</b>          For the most part, the crowd are stunned into silence but there\n          are a few murmurs from them;\n<b>          \n</b><b>                                     CROWD\n</b>                               (ad-lib)\n                        Oh My God ...\n<b>          \n</b>                        Jesus Christ!\n<b>          \n</b>                        What the FUCK ... ?!\n<b>          \n</b>                        No no no no no no no ....\n<b>          \n</b>          Pinhead scans the club.\n<b>          \n</b>          He looks at the terrified humans.  The cruelly beautiful\n          artworks.  The humans.  The artworks.  The humans.  The\n          artworks.\n<b>          \n</b>          A small smile forms on his face.  He's just had an entertaining\n          idea.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      76\n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          The view through the big picture window is entirely normal\n          again; the cityscape by night.\n<b>          \n</b>          Suddenly, Joey seems to appear behind the glass - translucent,\n          like a reflection - and comes through the window into her\n          apartment, \"solidifying\" as she steps in.\n<b>          \n</b>          Her hands are at her head and she staggers forward a few steps.\n          It's as if the enormity of her trip thru realities has just hit\n          her.  She falls forward onto the floor of her room, unconscious.\n<b>          \n</b><b>          FADE OUT\n</b><b>          \n</b><b>          FADE IN\n</b><b>          \n</b>           - as the ringing of a phone grows in volume.\n<b>          \n</b>          Joey raises her head, bleary-eyed, and glances round the room\n          trying to locate the source of the noise that has woken her.\n<b>          \n</b>          She crawls the few feet to the phone and snatches at it.  The\n          hand-set falls and she has to gather it up from the floor.\n          Maneuvering herself into a sitting position, she speaks.\n<b>          \n</b><b>                                     JOEY\n</b>                        Hello?\n<b>          \n</b><b>                                     DOC\n</b>                               (on phone)\n                        You wanted a story.  You got it.  Turn\n                        on the TV now.  And then get your ass\n                        down here ... (click) ...\n<b>          \n</b><b>                                     JOEY\n</b>                        Doc?  ...  Doc ... Hello?\n<b>          \n</b>          She puts the phone down and rushes across to turn on the TV.\n<b>          \n</b><b>          \n</b><b>          TV IMAGE/DOC'S SHOULDERCAM:\n</b><b>          \n</b><b>          \n</b><b>          EXT.   CITY STREETS, OUTSIDE CLUB   NIGHT\n</b><b>          \n</b>          The images are confusing, with the rapid pans and temporary\n          loss of focus or light that characterise raw news footage.\n<b>          \n</b>          Doc's Camera weaves amongst a mass of uniformed people, trying\n          to catch clear pictures of-what's been happening.\n<b>          \n</b>          Sirens howl, red emergency lights flash.\n<b>          \n</b><b>          \n</b><b>                                                                      77\n</b><b>          \n</b>          It becomes clear we are looking at the aftermath of a disaster.\n          Or a massacre.\n<b>          \n</b>          The club building looks like a bomb hit it.  Smoke and debris\n          litter the street.  So do corpses.\n<b>          \n</b>          Some of the dead bodies are simply dead bodies.  Others -\n          glimpsed fleetingly and tantalizingly as Doc is jostled and\n          bustled - seem to be mutilated decoratively.  In fact they bear\n          hideous similarities to the artworks that used to grace the\n          club: armless torsos wrapped in barbed wire; flayed limbs with\n          machinery inside instead of muscle.\n<b>          \n</b><b>                                     DOC\n</b>                               (off)\n                        Judas Priest!  Will you look at ...\n<b>          \n</b>          Suddenly, the images are blocked by a very BURLY COP pushing at\n          the camera and talking directly into it.\n<b>          \n</b><b>                                     BURLY COP\n</b>                        Move it!  Now!  No pictures!\n<b>          \n</b><b>                                     DOC\n</b>                               (off)\n<b>                        W-QQY.  I ...\n</b><b>          \n</b><b>                                     BURLY COP\n</b>                        I don't give a shit!  Move it or lose\n                        it!\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          CLOSE on Joey's face as she reacts in horror to what she is\n          seeing.    (INTERCUT with Doc's footage)\n<b>          \n</b><b>                                     JOEY\n</b>                        Oh my God, it's happening ...\n<b>          \n</b><b>          \n</b><b>          BACK ON TV SCREEN\n</b><b>          \n</b>          Doc's camera pans around the area, past rubbernecking crowds,\n          past shadowed alleys, past Police cars and ambulances vehicles\n          ... and then whips back to an alley in the distance.\n<b>          \n</b><b>                                     DOC\n</b>                        I thought ... what's ... I think there's\n                        something up there ...\n<b>          \n</b>          Joey's eyes widen in horror as she speaks uselessly to the\n          screen.\n<b>          \n</b><b>          \n</b><b>                                                                      78\n</b><b>          \n</b><b>                                     JOEY\n</b>                        No!  No, Doc, don't ... don't ...\n<b>          \n</b><b>          \n</b><b>          EXT.   ALLEYWAY   NIGHT    BACK ON TV SCREEN\n</b><b>          \n</b>          The hubbub and noise has died away.  Doc's camera is advancing\n          up a very dimly-lit alley.  Hardly any detail can be seen.  The\n          camera creeps forward ... forward ... forward ...\n<b>          \n</b>          Then suddenly a barely-glimpsed movement very close to the side\n          and the camera swings wildly toward it.\n<b>          \n</b><b>                                     DOC\n</b>                        Shit!  What was ...\n<b>          \n</b>          The face of Pinhead, almost lost to the darkness of the alley,\n          is glimpsed on the screen as it looms toward the lens.\n<b>          \n</b>          The image disappears to darkness, over which Doc's SCREAM of\n          mortal terror and agony can be heard before the blackness is\n          suddenly replaced by a station identification card and then a\n          very harried anchorperson at a studio desk.\n<b>          \n</b><b>                                     ANCHORPERSON\n</b>                        Well, we've ... er ... yes, we've\n                        temporarily lost our pictures there and\n                        ... and ...\n<b>          \n</b>          Joey has her hands at her mouth in horror.\n<b>          \n</b><b>                                     JOEY\n</b>                        Doc!  DOC!!\n<b>          \n</b>          Joey leaps to her feet, grabs the box from the TV, and stares\n          at it in her hand.\n<b>          \n</b><b>          SMASH-CUT TO\n</b><b>          \n</b><b>          \n</b><b>          INT/EXT    JOEY'S CAR/CTTY STREETS   NIGHT\n</b><b>          \n</b>          Joey's hands grip her steering-wheel tightly.  Her face is\n          drawn and grim.  The Box is on the seat beside her. She is\n          driving very fast.\n<b>          \n</b>          She has to slam on the brakes at a red light.  She pounds at\n          the dashboard in frustration.\n<b>          \n</b><b>                                     JOEY\n</b>                        C'mon.  C'mon!\n<b>          \n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      79\n</b><b>          \n</b><b>          EXT.   THE STREETS OF THE CITY   NIGHT\n</b><b>          \n</b>          CLOSE on a terrified face.\n<b>          \n</b>          The face belongs to EDDIE, a 20 year old runner for a drug\n          gang.  His head is pressed tight against a brick wall.  His\n          nose is bleeding and his eye is red and ready to bruise.\n<b>          \n</b><b>                                     EDDIE\n</b>                        I'll get it!  I promise!  I'll ...\n<b>          \n</b>          A fist slams into Eddie's face.\n<b>          \n</b><b>          WIDER ANGLE REVEALS -\n</b><b>          \n</b>          An alley.  Eddie is being held against the wall by two\n          uniformed COPS, one in his 40's, one in his 20's.  The elder\n          cop has just punched Eddie in the face.\n<b>          \n</b><b>                                     ELDER COP\n</b>                        Don't promise me shit, you little fuck!\n                        You know what your promise is worth to\n                        me?  Huh?  Fifty per cent of fuck-all!\n<b>          \n</b><b>                                     YOUNGER COP\n</b>                        Give him the money, Eddie.\n<b>          \n</b><b>                                     EDDIE\n</b>                        I don't ...\n<b>          \n</b>          A big back-handed slap from the Elder Cop.\n<b>          \n</b><b>                                     YOUNGER COP\n</b>                        Give him the money, Eddie.\n<b>          \n</b><b>                                     EDDIE\n</b>                        Just listen to me, Please!  I ...\n<b>          \n</b>          The Elder Cop gut-punches him and Eddie doubles up.\n<b>          \n</b><b>                                     ELDER COP\n</b>                        I'm done listening, shit-brain!  Where\n                        you been all day?  They shut the school?\n                        Kindergarten closed?  No customers?\n                        Huh?  Huh?\n<b>          \n</b><b>                                     YOUNGER COP\n</b>                        Give him the money, Eddie.  Tell ya, I'm\n                        gonna puke if he beats on you any more.\n                        Just give him the ...\n<b>          \n</b>          The Younger Cop pauses, looking beyond them down the alley as a\n          long black shadow falls over them.\n<b>          \n</b><b>          \n</b><b>                                                                      80\n</b><b>          \n</b><b>                                     YOUNGER COP\n</b>                        ... money.  What the ... ?\n<b>          \n</b>          The Elder Cop, at the change in his partner's tone, looks up.\n<b>          \n</b>          Standing in the center of the alley at its far end, light\n          coming from behind him so that he is unclear, is Pinhead.\n<b>          \n</b><b>                                     ELDER COP\n</b>                               (Calm. Expecting obedience)\n                        You, fuckoff.\n<b>          \n</b>          He turns back to Eddie.\n<b>          \n</b><b>                                     ELDER COP\n</b>                        Get your head outta your stinkin' ass\n                        and look at me, boy.\n<b>          \n</b><b>                                     YOUNGER COP\n</b>                               (still looking down alley)\n                        Hey ...\n<b>          \n</b>          Pinhead is moving up the alley towards the action.\n<b>          \n</b>          Elder Cop shoves Eddie away.\n<b>          \n</b><b>                                     ELDER COP\n</b>                               (to Eddie)\n                        Get lost.\n<b>          \n</b>          Eddie doesn't waste time with questions.  He's gone.\n<b>          \n</b>          The Cops straighten up and start walking to meet Pinhead.\n<b>          \n</b>          Pinhead advances- still in the shadows, still just a black\n          shape moving forward.\n<b>          \n</b><b>                                     ELDER COP\n</b>                        I have the distinct impression I told\n                        you to fuckoff.  Unless I miss my guess,\n                        you've just disobeyed an officer of the\n                        law.\n<b>          \n</b>          Pinhead emerges into the (dim) light in the alley.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        I am the Law.\n<b>          \n</b>          Cops halt in shock at this awesome presence, both of them\n          instinctively drawing their guns.  And both instinctively\n          beginning to back up.\n<b>          \n</b><b>                                     ELDER COP\n</b>                        You're one butt-ugly son of a bitch and\n                        you're about to dead meat.\n<b>                                                                      81\n</b><b>          \n</b><b>                                     PINHEAD\n</b>                        I am the son of eternal night and you\n                        are about to discover pain has no\n                        ending.\n<b>          \n</b>          Well, that's enough of a direct threat for any officer of the\n          law.  Both cops fire their guns.  Once.  Twice.  Three times.\n<b>          \n</b>          Pinhead keeps walking.  He spits out the bullets that his body\n          has absorbed.\n<b>          \n</b><b>                                     YOUNGER COP\n</b>                        Oh shh ...\n<b>          \n</b>          They empty their guns - useless - and then they turn and run\n          down the alley.  And then stop short.  There is a sudden wall\n          of impenetrable blackness in front of them as if the world\n          simply comes to a stop four yards from their feet.\n<b>          \n</b>          The cops turn, terrified, to look back.  Instinctively, they\n          spread apart - each walking near to opposite walls.\n<b>          \n</b>          The younger cop is standing beneath a fire escape.  He glances\n          up as if he might be able to jump up to safety.  No.  Too high.\n<b>          \n</b>          Pinhead's head flicks upward as if in a gesture of command.\n<b>          \n</b>          Suddenly, the Fire escape ladder zooms downward with impossible\n          speed and force.\n<b>          \n</b>          The Younger Cop doesn't even have time to scream.  The ladder\n          smashes right through his body, impaling him.\n<b>          \n</b>          His corpse stands there twitching and shuddering, wrapped\n          around the ladder.\n<b>          \n</b>          Elder Cop stares in terror at his partner's fate.\n<b>          \n</b><b>                                     ELDER COP\n</b>                        No.  No.  No.  No.  No.  No.\n<b>          \n</b>          Pinhead stands very still and speaks very calmly.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Curb your tongue.\n<b>          \n</b>          The Elder Cop's body starts to move involuntarily.  His\n          movements are jerky and spasmodic as if his mind is trying to\n          fight what his body is trying to do.\n<b>          \n</b>          Pinhead's head moves through various positions.  His face is\n          calm, showing no particular pleasure at what he is doing but\n          only a fascinated concentration as if experimenting with new-\n          found skills.\n<b>          \n</b><b>                                                                      82\n</b><b>          \n</b>          The Elder Copts shaking puppet-like hands draw his handcuffs\n          from his belt.\n<b>          \n</b>          His eyes show terror.  Everything else is beyond his control.\n<b>          \n</b>          He raises the cuffs to head level and springs one of them open.\n<b>          \n</b>          His mouth suddenly jerks open and his tongue protrudes.\n<b>          \n</b>          The fear in his eyes increases.\n<b>          \n</b>          He moves the open cuff over his tongue.  He's making panicked\n          moaning noises as if trying to scream.\n<b>          \n</b>          SLAM!  He drives the cuff closed right through his tongue!\n<b>          \n</b>          And SCREAMS (as best he can).\n<b>          \n</b>          Pinhead looks beyond the Cop to the wall of blackness and makes\n          another commanding gesture with his head.\n<b>          \n</b>          A Chain flies from the darkness and wraps itself around the\n          other cuff.\n<b>          \n</b>          The chain pulls taut and then suddenly retracts into the\n          darkness, hauling the Cop off his feet and dragging him along\n          the alley into the blackness.\n<b>          \n</b>          The Cop screams and moans all the way until he is enveloped\n          into the darkness and then the sounds suddenly stop dead.\n<b>          \n</b><b>          \n</b><b>          EXT.   CITY STREETS, NEAR CLUB   NIGHT\n</b><b>          \n</b>          A Paramedic is attempting to hold Joey back.  In the distance\n          behind them is the wreckage of the club.  They are standing\n          near the alley into which Doc's camera disappeared.\n<b>          \n</b><b>                                     JOEY\n</b>                        But I have to see him!  I'm his friend!\n<b>          \n</b><b>                                     PARAMEDIC\n</b>                        Lady, trust me!  You really don't want\n                        to go ...\n<b>          \n</b>          But Joey has slipped past his obstructing arm and runs on into\n          the alley.\n<b>          \n</b>          And pulls to a horrified stop.\n<b>          \n</b><b>                                     JOEY\n</b>                        No!  NO!!\n<b>          \n</b><b>          REVERSE ANGLE - JOEY'S POV\n</b><b>          \n</b><b>                                                                      83\n</b><b>          \n</b>          The scene is well-lit by Police emergency lights.  It is taped\n          off by yellow DO NOT CROSS banners.  Paramedics and cops stand\n          around in various states of shock or disgust.\n<b>          \n</b>          In the middle of it all is Doc.  Quite dead.\n<b>          \n</b>          The body is kneeling up, its cold hands resting on its lap and\n          holding its severed head which stares up at its shoulders.  The\n          camera has been shoved deep between the corpse's shoulder\n          blades and is angled down as if filming its dead face.\n<b>          \n</b>          CLOSE on Joey's devastated face.\n<b>          \n</b><b>          \n</b><b>          EXT.   INNER-CITY CHURCH   NIGHT\n</b><b>          \n</b>          An establishing shot of a church at the top of a small hill.\n<b>          \n</b><b>          \n</b><b>          INT.   INNER-CITY CHURCH   NIGHT\n</b><b>          \n</b>          The Church is in semi-darkness.  Some candles at an offertory,\n          some others on an altar, provide the only light.\n<b>          \n</b>          On the very front pew a PRIEST sits, head bent low in prayer.\n<b>          \n</b>          The Priest is a young man.  Probably a good man.  We're not\n          really going to have the time to find out.\n<b>          \n</b>          A shadow seems to pass over the Priest's bowed head.\n<b>          \n</b>          At first, it seems he hasn't noticed.  Then he looks up, a\n          little puzzled.  He looks to his right, his left, then shifts\n          in the pew to look back along the central aisle.\n<b>          \n</b>          There are rows and rows of empty pews and, in the distance, the\n          Church door ... which is ajar.\n<b>          \n</b>          The Priest stands, walks to the start of the aisle, and looks\n          back along it again.\n<b>          \n</b><b>                                     PRIEST\n</b>                               (calling down aisle)\n                        Is there anyone there?  Hello?\n<b>          \n</b>          Silence.  A beat.\n<b>          \n</b>          The Priest looks puzzled.  We see his mind work.  He's looked\n          right, looked left, looked down ... How about ...?\n<b>          \n</b>          He turns right round to face the altar.\n<b>          \n</b><b>          PRIEST'S POV\n</b><b>          \n</b><b>          \n</b><b>                                                                      84\n</b><b>          \n</b>          To the Priest, it's an image of nightmarish blasphemy.  Even to\n          us heathens, it's pretty shocking;\n<b>          \n</b>          Pinhead in all his dark glory is standing behind the altar.\n<b>          \n</b><b>                                     PRIEST\n</b>                        How dare you!\n<b>          \n</b>          It gets worse.  Pinhead, staring at the Priest all the while,\n          reaches his hand to the back of his head and begins to extract\n          one of the pins from his skull.\n<b>          \n</b>          The pin is horribly long and, sickeningly, the last few inches\n          aren't metal at all but some kind of infernal worm - dark,\n          slimy, and befanged.\n<b>          \n</b>          Pinhead presses the worm against his palm and it instantly\n          burrows through his flesh pulling its pin-tail behind it.  He\n          repeats the operation with the other palm.\n<b>          \n</b>          He turns his palms out to show the Priest in a blasphemous\n          parody of Christ's stigmata.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        I am the Way.\n<b>          \n</b>          The Priest rushes up to the altar to Pinhead.\n<b>          \n</b><b>                                     PRIEST\n</b>                        You'll burn in Hell for this!\n<b>          \n</b>          The Priest reaches him.  Pinhead's hand is on his throat\n          instantly, squeezing silence from him.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Burn?  What a limited imagination.\n<b>          \n</b>          The choking Priest kicks and struggles as Pinhead forces him to\n          his knees before him.\n<b>          \n</b>          Pinhead towers over the Priest.  He smiles.\n<b>          \n</b>          With his free hand he gouges out a piece of his own flesh from\n          the decorative wounds on his chest.  He holds the bloody piece\n          of meat up.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        This is my body.  This is my blood.\n                        Happy are they who come to my supper.\n<b>          \n</b>          Pinhead shoves the disgusting lump of blue and bloody flesh\n          into the Priest's aghast mouth.\n<b>          \n</b>          Pinhead flings the priest away from him.\n<b>          \n</b><b>                                                                      85\n</b><b>          \n</b>          The Priest lands heavily on the floor.\n<b>          \n</b>          Pinhead walks forward, smashing the altar aside.\n<b>          \n</b>          All the candles flicker as if an unheard wind is blowing\n          through the Church.\n<b>          \n</b>          Pinhead walks up the aisle toward the semi-conscious Priest.\n<b>          \n</b>          And all the candles go out.\n<b>          \n</b><b>          BLACKNESS\n</b><b>          \n</b><b>          \n</b><b>          INT/EXT   JOEY'S CAR/CITY STREETS   NIGHT\n</b><b>          \n</b>          Joey is driving again.  And this time she's not even stopping\n          at red lights.  She steams across junctions, leaving cars\n          swerving and horns honking in her wake.\n<b>          \n</b>          Something catches her eye and she throws a glance to her side.\n<b>          \n</b><b>                                     JOEY\n</b>                               (appalled)\n                        Oh God ...\n<b>          \n</b><b>          JOEY'S (MOVING) POV\n</b><b>          \n</b>          Up a side street, atop a hill, is the Inner-city Church.  It's\n          on fire.\n<b>          \n</b>          Joey swings the car up the hill.\n<b>          \n</b><b>          SMASH-CUT TO:\n</b><b>          \n</b>          Joey getting out of the car nearer the burning church.  Off to\n          her side is a smaller building, the Church Hall.\n<b>          \n</b>          Joey shakes her head at the desecration.  She has no doubt\n          who's responsible.\n<b>          \n</b><b>                                     JOEY\n</b>                        Having fun en route, you bastard.\n<b>          \n</b>          Suddenly, a CREAKING noise from behind her.\n<b>          \n</b>          Joey freezes in terror then slowly - very slowly - turns round.\n<b>          \n</b><b>          JOEY'S POV - SHOCK REVEAL\n</b><b>          \n</b>          The Priest - now mercifully dead - is crucified against the\n          side wall of the smaller building.  Pinhead's nails protrude\n          from his palms and his ankles.\n<b>          \n</b><b>          \n</b><b>                                                                      86\n</b><b>          \n</b><b>          EXT   CITY STREETS   NIGHT\n</b><b>          \n</b>          A SERIES of QUICK CUTS of Joey's car tearing through the\n          darkness heading back to her apartment.\n<b>          \n</b><b>          \n</b><b>          INT.   CORRIDOR, JOEY'S APT. BLDG.   NIGHT\n</b><b>          \n</b>          Joey rushes down the corridor to her apartment door, hurriedly\n          turns the lock and rushes in.\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          Joey closes her door and switches on the light.  The mood is\n          suddenly different after the frenzied drive across town.  It's\n          very still, very slow, very quiet.\n<b>          \n</b>          Perhaps it's too quiet:  Joey moves into the room slowly,\n          clutching the Box in her hands and glancing round.  Her manner\n          makes the mood suddenly creepy.  Is the monster already in the\n          house?\n<b>          \n</b>          Very slowly, very carefully, Joey begins to move round her\n          apartment.  Hardly breathing, making no sudden movements, she\n          checks her doors.  The kitchen ... empty.  The bedroom ...\n          empty.  The bathroom ... empty.\n<b>          \n</b>          Joey stands back in the center of her main room, facing out to\n          her big picture window.  Slowly, she lets out a big breath and\n          then draws an equally slow one in.  Maybe it's alright ...\n          maybe the monster isn't here ... maybe ...\n<b>          \n</b>          Magically, eerily, slowly, the Box begins to rise from Joey's\n          hand.  Her eyes stare in horror as it ascends through the air.\n<b>          \n</b><b>                                     JOEY\n</b>                        Oh shit ...\n<b>          \n</b>          Maybe there's one place she hasn't checked.  Swallowing\n          nervously, Joey tilts her head up and back, her eyes rising up\n          in their sockets.\n<b>          \n</b>          The camera tilts low ... low ... lower ... taking in a wider\n          view of the room and its ceiling and the ascending Box ...\n<b>          \n</b>          And the audience screams!\n<b>          \n</b>          Like a spider or a lizard, Pinhead is flat against the ceiling,\n          arms stretched out for balance, his face staring down at Joey.\n<b>          \n</b>          Joey throws her hands to her mouth and screams.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      87\n</b><b>          \n</b>          Pinhead, angling down feet first, floats elegantly to the floor\n          to stand facing Joey.  The Box lands in one of his outstretched\n          hands.  He holds it out to show Joey ... and then suddenly\n          closes his powerful hand on it, apparently crushing it.\n<b>          \n</b>          He flings the remnants from him and they land on Joey's floor -\n          Chunks and splinters of wood, whirring and spinning machinery\n          of gold and silver, and scores of tiny writhing worms.\n<b>          \n</b><b>                                     JOEY\n</b>                        No!\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Watch.\n<b>          \n</b>          Thanks to the miracles of trick photography, the remnants\n          suddenly come back together and reassemble themselves into the\n          Box which sits there intact on the floor.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        The Box can't be destroyed.  Like pain\n                        or the poor, it is always with us.  But\n                        as long as I have it, no-one can open\n                        it.  Now come here and die.  You have\n                        friends in Hell waiting to greet you.\n<b>          \n</b>          Joey begins to back across the room toward her window.\n<b>          \n</b><b>                                     JOEY\n</b>                        You'll have to come and get me, you ugly\n                        bastard.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Spirited.  Good.  I'll enjoy making you\n                        bleed.  I'll enjoy making you enjoy it.\n<b>          \n</b>          Pinhead starts across the room.\n<b>          \n</b>          Joey looks at her window.  It's the normal view ... with the\n          normal seven-story drop.\n<b>          \n</b>          Pinhead closes.\n<b>          \n</b>          She bites her lip, goes for it: in a literal and metaphorical\n          leap of faith she runs headlong at the window and jumps at it.\n<b>          \n</b>          The window shatters.\n<b>          \n</b>          Pinhead's arm reaches out after Joey as if to grab her and pull\n          her back.\n<b>          \n</b><b>          SIDELONG ANGLE\n</b><b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      88\n</b><b>          \n</b>           - shows his arm entering the shattered window and also shows\n          the night-time cityscape beyond the window.  What it doesn't\n          show is the front of the monster's arm.  That's somewhere else.\n<b>          \n</b><b>          CUT TO\n</b><b>          \n</b><b>          \n</b><b>          INT.   QUONSET HUT\n</b><b>          \n</b>          CLOSE on Pinhead's arm, still clutching at the air.\n<b>          \n</b>          Suddenly, a khaki-uniformed arm moves into shot and grasps\n          Pinhead's hand, arm-wrestling style.\n<b>          \n</b><b>          WIDER ANGLE (WITH OPTICAL F/X)\n</b><b>          \n</b>          Elliott literally pulls Pinhead through from one reality to\n          another - we see parts of the monster appearing and\n          disappearing in front of the Hut wall as if glimpsed through\n          tears in reality.  It's like a tug-of-war which Elliott wins -\n          Suddenly Pinhead's there on the floor of the Quonset hut.\n<b>          \n</b>          And his other self - Elliott - still has hold of his hand.\n<b>          \n</b>          Pinhead throws a glance around the Hut.  He recognizes it ...\n          and the frozen figure at the top end perched before the Box.\n<b>          \n</b><b>                                     PINHEAD\n</b>                               (furious rage)\n                        Aahhhh!!!\n<b>          \n</b><b>                                     ELLIOTT\n</b>                        Joey!  Back to the wall, quickly!\n<b>          \n</b>          Joey runs around then to the far wall - just in time because\n          now the pyrotechnics start.\n<b>          \n</b>          Elliott tightens his grip and (with a nice series of INTERCUT\n          CLOSE-UPS of these two alternative selves) the life-forces of\n          Elliott and Pinhead begin to erupt.\n<b>          \n</b>          ELECTRIC BLUE LIGHT begins to play over both their bodies.\n          It's apparently agonizing, both figures arching with the pain,\n          both faces grimacing.\n<b>          \n</b>          Joey watches, wincing in sympathetic agony.\n<b>          \n</b><b>                                     JOEY\n</b>                        Elliott!  No!  What about you?!  Where\n                        will you be?!\n<b>          \n</b>          Elliott grunts his answer through the agony.\n<b>          \n</b><b>          \n</b><b>          \n</b><b>                                                                      89\n</b><b>          \n</b><b>                                     ELLIOTT\n</b>                        Back with the damned.  No more hope of\n                        heaven.  But I drag this monster back\n                        with me!\n<b>          \n</b><b>                                     PINHEAD\n</b>                        You stupid interfering foo ... AAAAAH!\n<b>          \n</b><b>          VARIOUS ANGLES ON THE THREE SELVES - PINHEAD, ELLIOTT, AND THE\n</b><b>          SEATED OFFICER\n</b><b>          \n</b>          The essences of Pinhead and Elliott - drawn from their bodies\n          as sweeping, glowing, spitting arcs of BLUE LIGHT - crackle in\n          the air of the Hut like a miniature electrical storm ...\n<b>          \n</b>          Until they suddenly lock together in one more powerful arc\n          which flies at the body of the seated Officer and disappears\n          inside him in a BLINDING FLASH OF LIGHT.\n<b>          \n</b>          And suddenly, as vision returns, there is only the seated\n          officer   (and, at the far end of the room, Joey).\n<b>          \n</b>          And, almost as suddenly, the frozen scene comes to life;\n<b>          \n</b>          The radio near the camp bed is playing.\n<b>          \n</b>          A bead of sweat falls down the Officer's face as he reaches\n          forward to pick up the Box.\n<b>          \n</b>          The Officer, apparently completely unaware of Joey's presence,\n          begins to work the Box.\n<b>          \n</b>          As the process works through, we INTERCUT CONSTANTLY BETWEEN\n<b>          \n</b>          1)  The Officer's hands and the movements of the Box here in\n          the Hut in 1921.\n<b>          \n</b>          2)  EXACTLY MATCHING movements of the Box back on the floor of\n          Joey's apartment in 1992.  Moving on its own, linked across the\n          years to its earlier self.\n<b>          \n</b>          3)  Joey watching the movements in the Hut.\n<b>          \n</b><b>                                     JOEY\n</b>                        Elliott? ... Elliott? ... You can't\n                        hear me, can you?  It's 1921.  I'm not\n                        really here ...\n<b>          \n</b>          Suddenly, small patterns of BLUE LIGHT arc across the Box,\n          shocking the Officer who drops the Box and then stares in shock\n          and fascination as ...\n<b>          \n</b>          On the floor, the box begins to open.\n<b>          \n</b>          The Officer kneels up and leans over the Box ...\n<b>                                                                      90\n</b><b>          \n</b>          And the chains fly!  Shooting up from within and hooking\n          themselves cruelly into the Officer's face and chest.\n<b>          \n</b>          CLOSE ON the Officer's face, howling in agony.\n<b>          \n</b>          CLOSE ON Joey's face, sobbing in distress.  She throws up her\n          hands to hide the unbearable sight from herself and, when she\n          lowers them, ...\n<b>          \n</b><b>          \n</b><b>          INT.   MAIN ROOM, JOEY'S APT.   NIGHT\n</b><b>          \n</b>          .. she's back in her room. Alone.  Window intact.  Normal view.\n<b>          \n</b>          Joey stares around, her face a mix of sadness and relief.\n<b>          \n</b>          The mood now is very down, post-cataclysmic, post-adventure.\n<b>          \n</b>          Joey takes a deep slow breath and crosses the room toward the\n          kitchen door.\n<b>          \n</b>          She crosses the floor without glancing down at it.  Why should\n          she?  Everything's over.  But we notice, even if she doesn't,\n          that the Box is no longer there.  But we hardly have time to\n          register this before ...\n<b>          \n</b>          Joey opens the kitchen door.\n<b>          \n</b><b>                                     JOEY\n</b><b>                        (SCREAMS!!!!)\n</b><b>          \n</b>          Pinhead is framed in the doorway.\n<b>          \n</b>          Behind him, instead of her kitchen, is the black space of Hell\n          - like the Torture Rooms in HELLRAISER and HELLBOUND, it is\n          full of shadowy pillars and chains.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Oh, no kiss of welcome after 70 years?\n<b>          \n</b>          Joey backs away, shaking her head in shocked denial.\n<b>          \n</b>          Pinhead moves forward, very leisurely.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        This will be so good, Joey.  You loved\n                        him, didn't you?  I can feel him inside,\n                        weeping for you.  He can watch through\n                        the centuries as we discover the things\n                        that make you whimper.\n<b>          \n</b>          Joey's mood breaks and she turns and rushes for her front door.\n<b>          \n</b>          She reaches it, throws it open ... and screams.\n<b>          \n</b><b>                                                                      91\n</b><b>          \n</b>          JP Monroe is in the doorway - but he's only just recognizable.\n          He's now a CENOBITE - blue-skinned, scarred, mutilated, and\n          decorated with metal and leather.\n<b>          \n</b><b>                                     PINHEAD\n</b>                        You never met, did you?  This was JP\n                        Monroe.\n<b>          \n</b><b>                                     JP CENOBITE\n</b>                        Have you seen what they did to me?  Have\n                        you seen what they did?  You interfering\n                        little whore!\n<b>          \n</b>          The JP Cenobite moves into the room.\n<b>          \n</b>          Joey, now near hysteria, rushes across the room again to the\n          one remaining door - her bedroom.\n<b>          \n</b>          She throws that one open ...\n<b>          \n</b>          And Terri, the new FEMALE CENOBITE, walks out at her.  She has\n          the open Box in her hand and several cigarette protruding from\n          different holes in her cheek and face.\n<b>          \n</b><b>                                     JOEY\n</b>                        Terri?  Oh no!  NO!!  TERRI!!\n<b>          \n</b><b>                                     TERRI CENOBITE\n</b>                        Oh, go on.  Have one.  Fuck it.  You\n                        think you're going to live forever?\n<b>          \n</b>          Pinhead and JP are advancing across the room toward Joey and\n          Terri.  Joey only has seconds to act ...\n<b>          \n</b><b>                                     JOEY\n</b>                        Wanna light, you bitch?!\n<b>          \n</b>          Joey pulls her father's Zippo from her pocket and sparks it up\n          as she swings it through the air close to Terri's face.\n<b>          \n</b>          A huge FLAME shoots out of the Zippo (as in the earlier scene)\n          and scours across Terri's face.\n<b>          \n</b>          Terri howls in terror, throws her hands to her face ... and the\n          Box flies from her hands.\n<b>          \n</b>          Joey catches it, spins it, closes it!\n<b>          \n</b>          An arc of BLUE LIGHT zaps across to Terri and she's gone ...\n<b>          \n</b>          Still in one movement, swinging on her heels, Joey twists the\n          box again ...\n<b>          \n</b>          And another Arc of LIGHT zaps JP away ...\n<b>          \n</b><b>                                                                      92\n</b><b>          \n</b>          Joey completes her turn.  She's facing Pinhead.  She holds the\n          Box before her like a weapon ... and she's got the monster in\n          her sights ...\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Wait!\n<b>          \n</b>          His hands are raised palms out.  He's stopped advancing.\n<b>          \n</b>          Joey holds the Box ready, breathing heavy, waiting ...\n<b>          \n</b><b>                                     PINHEAD\n</b>                        You can send me back.  But why?  I can\n                        help you, Joey.  I can give you what you\n                        want.\n<b>          \n</b><b>                                     JOEY\n</b>                        You'll never know what I want ...\n<b>          \n</b>          (Despite what she's said, we see Joey's face register every\n          word of Pinhead's reply, every nuance, every promise ... )\n<b>          \n</b><b>                                     PINHEAD\n</b>                        Respect.  Power.  You and I can put your\n                        name on the World's lips, your face on\n                        it's screens ...\n<b>          \n</b>          Camera TRACKS closer to the Box in Joey's hands as Pinhead\n          speaks.  Closer and closer until it's side fills the screen.\n<b>          \n</b><b>          CROSS-FADE\n</b><b>          \n</b><b>          \n</b><b>          INT.  MS. SUMMERSKILL'S OFFICE   DAY\n</b><b>          \n</b>          CLOSE on the face of the Box, still filling the screen.\n<b>          \n</b>          SLOW PULL BACK to reveal that the Box is mounted on a plinth\n          within a glass bell-jar.\n<b>          \n</b>          PULL BACK continues.  The bell-jar stands on a tall thin wooden\n          sculpture stand.\n<b>          \n</b>          PULL BACK continues.  The stand is next to a large impressive\n          desk in an even larger even more impressive office.\n<b>          \n</b>          And seated behind the desk is ... well, we can't really call\n          her Joey - she's far too impressive for that ... is Ms. Joanne\n          Summerskill.\n<b>          \n</b>          Her hair is different.  Her make-up is different.  Her clothes\n          are different.  Everything about this woman speaks of power and\n          sophistication.\n<b> \n</b>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Hellraiser-3-Hell-on-Earth.jpg\"/>\n</td><td><h1>Hellraiser 3: Hell on Earth</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Peter Atkins\" title=\"Scripts by Peter Atkins\">Peter Atkins</a>  <a href=\"/writer.php?w=Tony Randel\" title=\"Scripts by Tony Randel\">Tony Randel</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Hellraiser 3: Hell on Earth Script.html#comments\" title=\"Hellraiser 3: Hell on Earth comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:07:15.672243"}