{"title": "Hellraiser: Hellseeker", "film_link": "/Movie Scripts/Hellraiser: Hellseeker Script.html", "script_link": "/scripts/Hellraiser-Hellseeker.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Hellraiser: Hellseeker Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Hellraiser-Hellseeker.jpg\" title=\"Hellraiser: Hellseeker Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Carl Dupre\" title=\"Scripts by Carl Dupre\">Carl Dupre</a><br/>  <a href=\"/writer.php?w=Clive Barker\" title=\"Scripts by Clive Barker\">Clive Barker</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/>\n<b>Script Date</b> : October 2000<br/>\n<b>Movie Release Date</b> : October 2002<br/>\n<br/>\n<a href=\"/scripts/Hellraiser-Hellseeker.html\">Read \"Hellraiser: Hellseeker\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<b>                HELLRAISER: HELLSEEKER\n</b>\n                      Written by\n\n                      Carl Dupre\n\n\n\n\n<b>                                              10/27/2000\n</b>\n\n\n<b>\n</b><b>INT. CAR DRIVING DOWN COUNTRY ROAD - DAY\n</b>\nKIRSTY GOODING looks out the passenger window as the trees go\nwhizzing past. She's attractive, late twenties, warmly\nsophisticated. Something makes her smile. She turns to the\ndriver and thinks real hard as she says this.\n\n<b>                    KIRSTY\n</b>          Okay. Cubic root of nine thousand two\n          hundred and sixty one.\n\nTREVOR is her husband, late twenties as well. God gave him\nbrains and beauty. He has used them both prodigiously.\n\n<b>                    TREVOR\n</b>          Twenty one. Why do we have to do this now\n          Kirsty?\n\n<b>                    KIRSTY\n</b>          Shut up and play darling. Your turn.\n\n<b>                    TREVOR\n</b>          Five hundred ninety two thousand seven\n          hundred and four.\n\n<b>                    KIRSTY\n</b>          Uh... eighty two?\n\n<b>                    TREVOR\n</b>          Eighty four.\n\nKirsty takes a calculator out of her purse and double checks\nthe math.\n\n<b>                    KIRSTY\n</b>          You win! Okay pull over.\n\n<b>                    TREVOR\n</b>              (looking at his watch)\n          But... I thought...\n\n<b>                    KIRSTY\n</b>              (laughing)\n          If what I've heard is true this could be\n          the last time for a long long time.\n          Besides we've got a whole seven minutes\n          before the next one. Clock's ticking.\n          Tick-tock...\n\nTrevor waits a moment to see if she's kidding.\n\n<b>                    KIRSTY\n</b>              (through clenched teeth)\n<b>          PULL OVER NOW.\n</b>\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                 2.\n</b><b>CONTINUED:\n</b>\n\nThen pulls over to the side of the road. Kirsty reaches over,\nquickly unzips his pants immediately goes down on Trevor OUT\nOF FRAME. He reacts accordingly. A little pleasure, utter\nshock.\n\n<b>                       KIRSTY'S VOICE\n</b>                 (from BELOW FRAME)\n             Honey what's wrong?\n\nKirsty rises INTO FRAME once again.\n\n<b>                       TREVOR\n</b>             What isn't wrong? Why are you doing this\n             anyway?\n\n<b>                       KIRSTY\n</b>                 (self-conscious)\n             I'm... I'm doing a very special thing\n             here. And you can't even ... respond?\n\n<b>                       TREVOR\n</b>             Sorry honey the present situation isn't\n             exactly fodder for an erection. Shouldn't\n             we be getting to the hospital?\n\nFULL ON Kirsty. For the first time WE SEE her big pregnant\nbelly sticking out. She looks at Trevor innocently.\n\n<b>                       KIRSTY\n</b>             I was going to keep breathing you know.\n             You think I'm an amateur or something?\n\nTrevor stuffs himself back in his pants, puts the car in gear\nand presses the accelerator.\n\n<b>                       TREVOR\n</b>             Just concentrate on the task at hand\n             please. Listen to me. You should be\n             giving ME this lecture.\n\n<b>                       KIRSTY\n</b>             You've been cheating on me haven't you?\n\n<b>                       TREVOR\n</b>             Yes I had a quickie with the neighbor\n             during your last contraction.\n\n<b>                       KIRSTY\n</b>             Roughly two thirds of married men who\n             cheat start during the eighth month of\n             their wives' first pregnancy.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                              3.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    TREVOR\n</b>          I would never cheat on you. Not while\n          you're pregnant now you know that.\n\n<b>                    KIRSTY\n</b>              (features tightening)\n          Okay... uh oh here comes another one.\n\n<b>                    TREVOR\n</b>          Share the pain Kirsty.\n\nShe takes Trevor's hand and squeezes as hard as she can. IN\n<b>CLOSE UP WE SEE:\n</b>\nA SOLVED RUBIC'S CUBE sitting between them.\n\nDo we need this vision of the solved rubics cube?\n\n<b>EXT. ROAD - DAY\n</b>\nThe car is approaching a bridge.\n\n<b>INT. CAR - DAY\n</b>\nTrevor takes his hand off the wheel to look at his watch.\n\n<b>                    TREVOR (CONT'D)\n</b>          One fifteen.\n\n<b>                    KIRSTY\n</b>              (in dire pain)\n          Oh God...... Trevor, I think my water\n          just broke.\n\nTrevor grabs the wheel again. Kirsty GASPS.\n\n<b>                    KIRSTY (CONT'D)\n</b>          Oh my God. It's coming out.\n\n<b>                    TREVOR\n</b>          What?\n\n<b>                    KIRSTY\n</b><b>          THE BABY IS COMING OUT! I CAN FEEL IT!\n</b><b>          SONOFABITCH IT HURTS!! AAAGGGGHHH!!!\n</b>\nTrevor looks at her, trying to stay calm.\n\n<b>                    TREVOR\n</b>          Okay Kirsty don't panic. Just keep\n          breathing! DON'T PANIC! Put the seat back\n          and hold on to something. Were almost\n          there!\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                 4.\n</b><b>CONTINUED:\n</b>\n\nKristy's hand moves down the along side the seat between the\ndoor and she plunges back with the seat. She looks at Trevor\nwide eyed.\n\nShes about to give birth in a Chevrolet.\n\n<b>                       KIRSTY\n</b>             OH MY GOD TREVOR! It hurts!! (breathing\n             heavily) oh my God, Oh my God. Trevor,\n             It's coming out.\n\n<b>                       TREVOR\n</b>             This isn't happening.\n\n\n\nKristy starts to convulse with pain. She begins to tremble\nand her arms flail about in an attempt to ease her\ndiscomfort. She grabs Trevors arm for support.\n\n<b>                       TREVOR\n</b>             Honey, take it easy.    Your gonna be\n             alright.\n\nKristy becomes more violent, kicking her legs up onto the\ndashboard. She starts grabbing Trevors arm a little more\nviolently, causing Trevors to weave a bit on the road as he\nrecoils.\n\n<b>EXT. CAR DRIVING DOWN COUNTRY ROAD - DAY\n</b>\nThe car lunges to the side of the road and weaves a bit in\nthe gravel. Up ahead a bridge approaches.\n\n<b>INT. CAR - DAY\n</b>\nTrevor regains control of the car.\n\n                       TREVOR (cont'd)\n             Kristy! Take it easy. everythings gonna\n             be alright. Com'on, start the breathing,\n             with me... come on. One, two-three, and\n             blow..\n\nTrevor starts the lamanns method alone, as Kristy appears to\nhave passed out from the pain. She has her head leaned away\nfrom him and is limp in the passengers seat.\n\n                        TREVOR (cont'd)\n             Krist.   Honey. Kristy!\n\nKristy doesn't answer. Trevors puts his arm on her and\nshakes her. She doesn't react.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                            5.\n</b><b>CONTINUED:\n</b>\n\n                       TREVOR (cont'd)\n             Kristy! Honey wake up!\n\nTrevors attention is now on his unconscious wife rather than\nthe two lane road which stretches across the bridge.\n\n                       TREVOR (cont'd)\n             Honey, wake up. Please wake up.\n\nAnd with that Kristy's does exactly that. She lunges toward\nhim in a violent spasm and scares the shit out of him (and\nus) which causes Trevor to now completely lose control of the\ncar.\n\n<b>INT./EXT. CAR - DAY\n</b>\nThe rest is a blur...\n\n... Trevor loses control of the steering wheel... Kirsty\nSCREAMS... Their car skids from one side of the bridge to the\nother-careening toward the guardrail- SMASH!\n\nThe car is plummeting toward the river below. Trevor and\nKirsty brace themselves. The car hits the surface...\n\n<b>INT. RIVER, UNDERWATER - DAY\n</b>\nTrevor flounders through a disoriented flurry of bubbles. He\nbreaks the surface and gasps for air. Getting his bearings\nhe see the car bobbing on the surface, the current is\nseparating him from his wife.\n\nTreading water, he looks out at the car and there she is\ntrapped inside...\n\nKirsty\n\nStill belted to her seat. Her eyes are wide with desperation,\nbreath quickening, sinking fast... Kristy pounds the window\nwith her hands, trying to get out. She's trapped.\n\nApparently giving in, she presses a hand against the\nwindshield just before the car disappears under the\nsurface...\n\n<b>EXT. SHORE - DAY\n</b>\nTrevor paddles hard to the shore. Exhausted, he crawls onto\nthe shore underneath the bridge they just jumped.\n\nTrevor stands trying to process what just happened in the\nlast fifteen seconds. He screams out for his wife, and to\nwhat has just happened.\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                              6.\n</b><b>CONTINUED:\n</b>\n\n<b>                       TREVOR\n</b>             Kristy!\n             Kristy!\n\nTrevor drops to his knee's in distress.\n\n                       TREVOR (cont'd)\n             Oh my God, Kristy! Please Kristy.\n             (frantically) I'm so sorry, Kristy.\n\n\n\n\nHe hears something from above and looks up. A chunk of the\nbashed-up guardrail from the bridge has just snapped off and\nis sailing right down toward him-\n\n<b>TREVOR BLACKS OUT JUST AS THE THING HITS HIM\n</b>\n<b>WHITE LIGHT FLOODS HIS VISION...\n</b>\n<b>INT. HOSPITAL ROOM - DAY\n</b>\nTrevor's eyes blink open, darting left and right. He is on a\nbed, his head bandaged.\n\nAN ANGULAR NURSE ENTERS the room, walking up to Trevor's bed.\n\n<b>                       TREVOR\n</b>             Where is she...? Where's Kirsty?\n\nThe Nurse grabs Trevor's right arm and straps it to the side\nof the bed. She isn't exactly one of God's gentler creatures.\n\n<b>                       TREVOR\n</b>             Hey, what are you-\n\nShe moves to Trevor's legs, strapping them down as well, then\nhis other arm.\n\nBy now SEVERAL SURGEONS ENTER the room, features obscured by\nsurgical masks.\n\nThe Nurse fastens a clamp around Trevor's head, attaches it\nto the bed.\n\nTrevor is completely discombobulated. The surgeons gather\nbehind Trevor's bed.\n\nCLOSE ON TREVOR'S FACE as he struggles to see what's\nhappening back there but it's useless.\n\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                              7.\n</b><b>CONTINUED:\n</b>\nHe cannot move a muscle. He hears a sickening SAWING noise\nand his eyes bulge in horror.\n\nWIDE as the doctors calmly lift Trevor's freshly sawed\ncranium from his head exposing his brain. The CHIEF SURGEON-\na large unshaven man with magnifying lens alreaday in place\nmake his eyes enormous and his face grotesquely distorted. He\nwalks up, presented with a tray full of evenly arranged pins.\nHe cranks up the magnification of his lenes which make his\neyes appear even larger. Though no one speaks his name his\nname tag reads Dr. Barker.\n\n<b>                       TREVOR\n</b>             What are you people doing?!\n\nThe Chief Surgeon takes one of the pins and gently pushes\ninto a Trevor's frontal lobe.\n\n<b>                       TREVOR (CONT'D)\n</b>             What's happening to-!\n\nTrevor's eyes glaze over and his jaw relaxes. The chief\nsurgeon speaks in an english accent.\n\n<b>                       CHIEF SURGEON\n</b>             As you can see I just accessed the speech\n             center, temporarily shutting down all\n             verbal ability.\n\nAs the Chief Surgeon continues he takes several more pins off\nthe tray.\n\n<b>                       CHIEF SURGEON (CONT'D)\n</b>             The goal is find the exact point in the\n             brain where moral decisions are made, the\n             place where right and wrong is\n             distinguished. In exploring this Morality\n             Center I will most likely be triggering\n             memories, disrupting the unconscious. Our\n             patient may experience some distress\n             during the proceedings but they are not\n             due to pain. It is merely our patient-\n             recalling his past...\n\nChief Surgeon slips another pin into Trevors exposed brain.\n\n                       CHIEF SURGEON (cont'd)\n             As he was thrown into the lake, where the\n             beast and the false prophet had been\n             thrown.\n\nThe Chief Surgeon voice lowers and his eyes turn black. The\neye magification no at a hideous level, showing jet black\neyes.\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             8.\n</b><b>CONTINUED: (2)\n</b>\n\n                    CHIEF SURGEON (cont'd)\n          Where you will be tormented day and night\n          for ever and ever. (rev.20:10)\n\n\n\nTrevor looks at the frowning nurse who is watching over him.\nChief Surgeon sticks a needle into another spot on Trevor's\nbrain.\n\nTREVOR'S POV: The nurse is suddenly a pale gargoyle with\nblackened eyes.\n\nTrevor opens his mouth to scream and-\n\n-IN A BURST OF WHITE LIGHT, AN ANGELIC WOMAN is now standing\nbefore him. She is bathed in a haze of white light.\n\n<b>                    ANGELIC WOMAN\n</b>          Well? What do say Trevor? Que pasa?\n\nTrevor relaxes. His bindings are gone. The gargoyle nurse is\ngone. The surgeons are gone. And his brain is sitting safely\nwithin his inviolated skull, upon which now sit a few\nelectrodes. The bandage is no longer there.\n\nBut from his pain wracked expression we know the pain in his\nhead is still very real. He reaches for his head, makes sure\nits all intact.\n\n<b>                    TREVOR\n</b>          Where do I start?\n\n<b>                     ANGELIC WOMAN\n</b>          How's the old noggin? Any change in the\n          intensity?\n\nShe touches him gently.\n\n                    ANGELIC WOMAN (cont'd)\n          Can you describe the pains?\n\nTrevor looks up. The angelic woman smiles back at him. She's\nin scrubs, a stethoscope dangling from her neck. Trevor\nwinces.\n\n<b>                    TREVOR\n</b>          I'm not sure. How about a jackhammer in\n          the Occipital lobe?\n\nShe picks up a pad and scribbles something on it. Trevor\nnotices she's wearing a nameplate. Dr. ALLISON DORMERE.\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                             9.\n</b><b>CONTINUED: (3)\n</b>\n\n<b>                    TREVOR\n</b>          Are you a dream too?\n\n<b>                    ALLISON\n</b>          Still hallucinating as well. Hmm...\n\n<b>                    TREVOR\n</b>          What just happened to me anyway? It\n          looked like a dream but it felt like\n          reality.\n\n<b>                    ALLISON\n</b>          It's the morphine Trevor. You're on so\n          much of it, you could be asleep and\n          dreaming even with your eyes wide open.\n\nTerevors quickly recalls the accident. Fearing the worst.\n\n<b>                    TREVOR\n</b>          Where's Kirsty? Where's my wife?\n\n<b>                    ALLISON\n</b>              (confused)\n          Your wife...?\n\nAN OLDER DOCTOR walks in. AMBROSE. He gives Trevor an icy\nlook, then looks at Trevor's chart.\n\n<b>                    ALLISON\n</b>              (to Ambrose)\n          Still a little hazy. He's still in pain\n          too, even after the morphine. I recommend\n          we admit him. At least for another day...\n              (leaning in, sotto)\n          He just asked for his wife...\n\n<b>                    AMBROSE\n</b>          Well I can't find any abnormalities. I\n          think we're ready for discharge.\n\n<b>                    ALLISON\n</b>          But, Dr. Ambrose-\n\n<b>                    AMBROSE\n</b>              (looking up at Trevor)\n          I think it's time to ween you off these\n          painkillers too. Wouldn't want you to\n          develop a dependency to them. You might\n          do things like come to the hospital for\n          no reason other than to get a fix,\n          wouldn't you?\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                            10.\n</b><b>CONTINUED: (4)\n</b>\n\nAmbrose gives Trevor a fatherly smile then EXITS, not even\nlooking at Allison. Allison watches him go, then turns back\nto Trevor... then smiles perkily.\n\n<b>                    ALLISON\n</b>          Well looks like you're going home! Hope\n          you brought your bus pass.\n\n<b>INT. BUS - NIGHT\n</b>\nTrevor starts nodding out. The bus is practically empty. TWO\nBLACK CHILDREN a boy and a girl sit across from Trevor. A\nCREEPY OLD WOMAN sits further back, knitting something.\n\nA CHURCH BELL RINGING causes Trevor to wake again up, wincing\nat the sound. As the church passes the BELL becomes louder\nand louder.\n\nTrevor hears LAUGHTER and looks up at the children. The girl\nand her brother seem to be play-fighting over a toy they hold\nbetween them. Trevor looks at the toy getting stretched this\nway and that.\n\n<b>                    TREVOR\n</b>          Do you kids mind keeping it down?\n\nThe creepy old woman speaks up.\n\n<b>                    OLD WOMAN\n</b>          Aww let them be. They're only kids.\n\nTrevor notices what the Old Woman is knitting is a baby's\nbootie. As the children continue to laugh at him Trevor\nstares at the bootie tears welling up.\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nTrevor lives in a dingy place, one step up from poverty-\nlevel. Funny thing is this used to be a nicer place. We see\nremnants of a feminine touch long since past. Dirty dishes\nsit in the sink. A cockroach skitters across the kitchenette.\n\nTrevor sits at his TV playing an extremely violent videogame.\nWe're talking heads getting blown off, bodies exploding,\nlimbs being severed. As the end ends a DEMONIC VOICE chuckles\nfrom the TV.\n\n<b>                    DEMONIC VOICE FROM TV\n</b><b>          YOU LOSE...\n</b>\nThe screen flashes TRY AGAIN? Trevor takes a swig of beer and\nsits back in the easy chair looking at something atop the TV.\nA picture of Kirsty.\n<b>\n</b><b>                                                             11.\n</b>\n\n\n<b>INT. TREVOR'S KITCHEN - NIGHT\n</b>\nTrevor looks through an old photo album. Pictures of him and\nKirsty. Some pictures of him. A lot of pictures of Kirsty.\nSmiles, smiles, smiles...\n\nHe stops at one close up of them mugging at a camera they've\npointed on themselves. All we see is their faces, the rest is\ndark and blurry, except for one thing. A small shadowy object\nKirsty is holding.\n\n<b>EXT. CUBIC ROUTE ACTUARIAL RESEARCH - DAY\n</b>\nDressed in a button down shirt and tie, Trevor walks up to\nthe pale utilitarian box-like structure.\n\n<b>INT. CUBIC ROUTE, BULLPEN - DAY\n</b>\nIt is a maze of cubicles iced by harsh fluorescence. It is a\nmill of data research, where the TAPPING of fingers on\ncomputer keypads never ends...\n\n<b>INT. TREVOR'S CUBICLE - DAY\n</b>\n... no thanks to Trevor, who has already resumed his head-in-\nhands position at his desk. He rubs his eyes, seemingly\nblinded by the screen staring back at him.\n\nA MAN Trevor's age rolls up on his office chair beside\nTrevor, banging into the desk. BRET. Trevor's co-worker and\ncubicle mate.\n\n<b>                    BRET\n</b>          Trevor what is the metric probability of\n          you getting any work done at all today?\n\n<b>                    TREVOR\n</b>          Hey Bret. Christ, my head feels like a\n          split coconut.\n\n<b>                    BRET\n</b>          Dude there is a track on the carpet\n          between here and the bathroom. It was\n          made by your ass. You've been dragging it\n          all fucking week.\n          What happened to you yesterday?\n\n\nBret eyes Trevor suspiciously. Then smiling...\n\n                    BRET (cont'd)\n          You never came back after lunch. Did you\n          get a piece o'ass, you bastard?\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                12.\n</b><b>CONTINUED:\n</b>\n\n\n\n<b>                       TREVOR\n</b>             Give me a break. I checked back into the\n             hospital- amongst other things.\n\n<b>                       BRET\n</b>             Hospital? You haven't been to the\n             hospital since uh...\n\n<b>                       TREVOR\n</b>             Since what?\n\n<b>                       BRET\n</b>                 (getting uncomfortable)\n             Look never mind. Just get some numbers\n             going- any numbers at all will due. The\n             hills have eyes remember?\n\nBret casually gestures to a surveillance camera overhead that\nsweeps across the room like a prison spotlight.\n\n<b>                       BRET (CONT'D)\n</b>             I'm just looking out for ya.\n\nBret slides back over to his work station.\n\nTrevor puts his hands on the computer keys and starts to\ntype. A jolt of pain rips through his cranium forcing him to\nstop. Bret stops typing and breathes an exasperated SIGH.\n\n<b>                       BRET\n</b>             Sixty five point three percent of all\n             headaches are due to low sugar levels in\n             the bloodstream Trevor.\n\nA light bulb seems to go off over Trevor's head.\n\n<b>INT. BREAK ROOM - DAY\n</b>\nInside the narrow room blasted in fluorescent light, Trevor\neyes a vending machine, examining its wares. He peruses the\nsundry sugary snacks, looking for just the right fix.\n\nIt's so quiet in here we can almost hear his head pounding in\npain. He shuts his eyes. A couple of the fluorescent bulbs\nover his head wink out and the rest flicker weakly.\n\nWhen Trevor opens his eyes again he notices the room has\ngotten considerably darker. He looks up at the weakening\nlights and grunts in disgust.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                13.\n</b><b>CONTINUED:\n</b>\n\nThe light is just dim enough now so that he can't see what's\nin the vending machine. He goes right up to the glass and\npeers into the machine, using his hand as a visor. This\nstrain on his eyes intensifies his headache.\n\nIt's still pretty murky inside the glass case. Trevor squints\nand just when he thinks he can read a wrapper on... what is\nit? A candy bar?-\n\nA PALE HAND suddenly presses against the glass from inside\nthe machine. Trevor jolts backwards. The hand is gone. But in\nthe reflection of the glass Trevor notices someone has been\nstanding behind him. He whirls around-\n\n-and is face to face with our worst nightmare: PINHEAD.\n\n<b>                       PINHEAD\n</b>             It's too late.\n\nPinhead lashes out at Trevor striking his face with a clawed\nhand the rips his face clean off. The lights are back up as\nTrevor slams against the machine and grabs his face. It's\nstill there!\n\nWhere Pinhead was standing is THE WOMAN who just slapped him.\n\n<b>                       WOMAN\n</b><b>             SNAP OUT OF IT!\n</b>\nShe is attractive and studious. Her sensible business attire\ncan't hide a very curvaceous body. This is Trevor's\nsupervisor GWEN.\n\n<b>                       GWEN\n</b>             Jesus what the hell was that? It's like\n             you saw a ghost or something.\n\nTrevor slowly peers into the vending machine. Nope. Nobody\nhere but your average every-day candy bars. Trevor is\ndumbfounded.\n\n<b>                       GWEN (CONT'D)\n</b>                 (angrily)\n             Come on speak up, Gooding, I'm trying to\n             run a business here. I can't have people\n             flipping out in the break room when they\n             should be slaving away at their desks.\n\n<b>                       TREVOR\n</b>             Sorry I just kind of... spaced for a\n             second there.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             14.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    GWEN\n</b>          Well don't let it happen again. Or I may\n          have to spank you.\n\nGwen grins sinfully at Trevor and pushes his shoulders back\nagainst the vending machine. Before he realizes it, she's\nkissing him real hard. He gently ducks out from under her,\nfreeing himself.\n\n<b>                    GWEN (CONT'D)\n</b>          Get back here, junior bean counter. This\n          is your supervisor speaking.\n\n<b>                    TREVOR\n</b>          Please, Gwen. You're- you're all over me.\n\n<b>                    GWEN\n</b>          How do you think you got this job, cock?\n              (cozying up to him)\n          Mmm. I'm still tingling all over from our\n          little midnight swim.\n\nTrevor looks constipated. He has no recollection of this.\nGwen strokes his face.\n\n<b>                    GWEN (CONT'D)\n</b>          What's wrong, Trev?\n\n<b>                    TREVOR\n</b>          Nothing, look. Gwen I really like you-\n\n<b>                    GWEN\n</b>          And it shows. Least it did last night at\n          the quarry. In a big way.\n\nTrevor gently pushes her off him again.\n\n<b>                    TREVOR\n</b>          Please you're going way too fast for me\n          here.\n\n<b>                    GWEN\n</b>          YOU'RE giving ME a speeding ticket? Mr.\n          Mario Andretti himself?\n\n<b>                    TREVOR\n</b>          Gwen, my wife's dead.\n\n<b>                    GWEN\n</b>          Oh I see. That again. Trevor? I realize\n          it must be hard. But Christ how long does\n          it take someone to move on?\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                               15.\n</b><b>CONTINUED: (3)\n</b>\n\n<b>                      TREVOR\n</b>            That was cold...\n\n<b>                      GWEN\n</b>            No, making another woman compete with\n            someone who's been dead eight months.\n            That's cold.\n\nThis goes through Trevor like a shot. EIGHT MONTHS!\n\nHere we go- Dolly in zoom out! In Close up of Trevor we...\n\n<b>FLASHBACK\n</b>\nQUICK FLASHES of Kirsty's hand pounding on the windshield,\nthe car sinking into the lake, a quick cut of a dark figure\nwith a bright ring, and shots of two naked bodies slamming\nagainst each other in climax course through Trevor's mind.\nFinally, over the images of erotica we hear Gwens voice as\none of the characters.\n\n                    GWEN (cont'd)\n        Yeah, Trevor thats it. Thats it.\n\nAnd back in the real world, Trevor is now locking lips with a\nvery ready Gwen. His hand is up her skirt. He stops abruptly\nand pulls back.\n\n<b>                      TREVOR\n</b>            I'm sorry Gwen. I don't know what's\n            happening to me. (zipping up) I think\n            it's the painkillers, really.\n\nGwen rolls her eyes. She re-adjusts her self and now getting\na little pissy. She's heard this one before.\n\n<b>                      TREVOR (CONT'D)\n</b>            They mess with my head. Yesterday gets\n            blacked out and a memory from months ago\n            is played out in vivid technicolor. Like\n            the accident just happened you know?\n\nGwen softens up. Trevor is so earnest, so vulnerable.\n\n<b>                      GWEN\n</b>            Why don't you let me take you out\n            tonight? I promise to make it the most\n            memorable night of your life.\n\nShe kisses him. He braces himself. She grabs his butt, then\ngoes for the door.\n\n\n\n<b>                                                       (CONTINUED)\n</b><b>\n</b><b>                                                            16.\n</b><b>CONTINUED: (4)\n</b>\n\n<b>                    GWEN (CONT'D)\n</b>          Pick you up round seven. And Gooding? Get\n          some fucking work done.\n\n<b>INT. TREVOR'S CUBICLE - DAY\n</b>\nTrevor relentlessly crunches numbers at his computer. He\npauses a moment to stretch and rubs his eyes. A PING from his\ncomputer announces he has an INTEROFFICE MEMO- FILE ATTACHED.\nTrevor goes to the mailbox on his screen, clicks.\n\nUp comes a jpeg slideshow. Each picture is of Gwen dressed in\na piece of sexy lingerie. The caption underneath reads WORK\nHARDER. Looking around his cubicle, he then takes another\nlook at the jpeg. Trevor stands up in the cubicle and we see\nhim peer the outer office looking for Gwen. He sits back\ndown. Embarrassed Trevor closes the memo at least for now.\n\nTREVOR'S PHONE RINGS. Startleing him(and us). He picks it up.\n\n<b>                    TREVOR\n</b>              (into phone)\n          You got Trevor.\n\n<b>                    MAN'S VOICE\n</b>              (from phone)\n          Trevor hi this is Detective Lange from\n          homicide. It's about your wife.\n\nPush in on to a bewildered Trevor.\n\n<b>INT. LANGE'S OFFICE, HOMICIDE - DAY\n</b>\nIt is a dank crumbling room. A place where sunlight is not\nwelcome. DETECTIVE LANGE, a handsome graying gentleman who's\nplagued with a chronic case of post nasal drip, sits at his\ndesk.\n\nTrevor sits across from him. Behind Trevor is another empty\ndesk.\n\nAs Lange speaks he SNIFFS wetly every so often.\n\n<b>                    LANGE\n</b>              (to Trevor)\n          Thanks for coming down Mr. Gooding. Has\n          your head healed okay by now?\n\n<b>                    TREVOR\n</b>          Where's my wife?\n\n<b>                    LANGE\n</b>          Okay then. Here's the scoop.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                17.\n</b><b>CONTINUED:\n</b>\n\nLange takes out nasal drops and squeezes some in each nostril\nas he speaks.\n\n                       LANGE (CONT'D) (cont'd)\n             We still haven't been able to locate your\n             the body in that river. And missing\n             persons turned up some evidence that\n             qualified the disappearance as foul play.\n\n<b>                       TREVOR\n</b>             What evidence?\n\n<b>                       LANGE\n</b>             For one thing there were no skid marks on\n             that bridge, the tires were all intact,\n             from what we could tell, nothing wrong\n             internally with the vehicle either. Like\n             the car had been driven off the bridge\n             intentionally.\n\n<b>                       TREVOR\n</b>             It should all in the report. I told you\n             guys everything. She was giving birth in\n             the fucking car. She grabbed the wheel\n             and I lost control.\n\n\n<b>                       LANGE\n</b>             I did read that, yes. (flipping through\n             the report) What hospital were you going\n             to? I mean the Lodovico Street Bridge\n             isn't exactly on the way to Mercy\n             General.\n\n\nTrevor looks numb, unable to answer.    Lange poker faced,\nkeeps looking through the reoport.\n\n                       LANGE (CON'T) (cont'd)\n             Listen we really are at a stalemate here\n             until we find the body itself. Is there\n             any way you did not tell missing persons\n             everything that happened just before that\n             accident?\n\n<b>                       TREVOR\n</b>             Why wouldn't I tell you everything?\n             (impatiently) Look, I've been fully\n             cooperative...\n                 (quick to add)\n             ... to my recollection.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             18.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    LANGE\n</b>          I'm sorry Mr. Gooding, I meant no\n          disrespect. I'm just doing my job here,\n          OK? I mean between your head injury and\n          the fact that you are on very strong pain\n          medication, you might not be remembering\n          a few details about the crash which might\n          help us here.\n\nLange takes a deep hit of the nasal spray.\n\n                    LANGE (cont'd)\n          What you're recalling could be a\n          fabrication you've made up about it. Do\n          you follow?\n\nCLOSE ON TREVOR'S FACE as he wrestles with this notion.\n\n<b>                                                     FLASH BACK:\n</b>\n<b>INT. TREVOR'S CAR - DAY\n</b>\nKirsty's eyes are closed. She is motionless. Trevor tries to\nlook at her while watching the road at the same time.\n\n<b>                    TREVOR\n</b>          Kirsty. Jesus, wake up!\n\nThis time she doesn't wake up.\n\n<b>EXT. ROAD - DAY\n</b>\nThe car fishtails. Trevor loses control and the car skids\nfrom one side of the bridge to the other- careening toward\nthe guardrail- SMASH!\n\nThe car is plummeting toward the river below... The car hits\nthe surface...\n\n<b>INT. UNDERWATER - DAY\n</b>\nTrevor flounders through a disoriented flurry of bubbles. He\nswims up to the passenger door and tries the handle. It won't\ngive. Unable to breathe Trevor finally swims up...\n\n<b>EXT. SHORE - DAY\n</b>\nHe breaks the surface and crawls onto the shore...\n\nHe looks out at the car to where she should be trapped\ninside...\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                19.\n</b><b>CONTINUED:\n</b>\n\nTrevors eyes are wide with desperation, breath quickening,\nThe car is sinking fast...\n\nHe looks at the car and calls out, but there is no Kristy\ninsight.\n\nThe car disappears under the surface...\n\nTrevor hears something from above and looks up. A chunk of\nthe bashed-up guardrail is sailing right down toward him-\n\n<b>TREVOR BLACKS OUT JUST AS THE THING HITS HIM\n</b>\n<b>INT. LANGE'S OFFICE - DAY\n</b>\n<b>                       LANGE\n</b>             Mr. Gooding? You still in there?\n\nTrevor blinks and looks around him. Lange is sitting just\nwhere they were when he saw him last. Only now there's a very\nwary look on his face. Whoa.\n\n<b>                       TREVOR\n</b>             Uhh. Yes detective, sorry. Just trying to\n             recollect, you know?\n\nLange nods.\n\n<b>                       TREVOR (CONT'D)\n</b>             Okay. From what I remember now, maybe my\n             wife was thrown from the car when it hit\n             the water. Maybe she wasn't trapped\n             inside.\n\nLange checks the report again. He believes Trevor...or does\nhe?\n\n<b>                       LANGE'S VOICE\n</b>             That's a start. I'll tell the people\n             trawling the river maybe it makes a\n             difference maybe not. Thanks for your\n             help Trevor. If we have any more\n             questions you'll get a call from myself\n             or my partner Detective Givens.\n\nLange stands up and backs up awkwardly to a file behind his\ndesk. Trevor stares at him suspiciously.\n\n<b>                       TREVOR\n</b>             You guys know something I don't?\n\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                20.\n</b><b>CONTINUED:\n</b>\n\n<b>                       LANGE\n</b>             All things considered we probably know a\n             lot less than you do. Have a good\n             afternoon, Mr. Gooding.\n\nTrevor exits, both men maintain eye contact as the door\ncloses between him.\n\n<b>EXT. BUS STOP - NIGHT\n</b>\nThe bus pulls up to the curb. Trevor climbs out and starts\nwalking down the empty street. As soon as the bus pulls away,\nthe only sound heard is Trevor's footsteps.\n\nPOV BEHIND TREVOR: We see Trevor's back from a slight\ndistance. Someone is following him.\n\nSensing this, Trevor looks behind him. Nothing but an empty\nsidewalk. Trevor hurries his pace, almost there at his\napartment building. He glances behind him again. Nope, nobody\nthere... then suddenly-\n\n-A DARK FIGURE passes under a streetlight on the opposite\nside of the street. Trevor turns a corner no picking up the\npace a little. The DARK FIGURE follows, it picks up it's pace\nas well.\n\nTrevors walks an d approaches a small alley way. Should he\ntake this home?\n\nA enraged Pitbull nearly rips his nose off as it Barks and\nlunges to the end of a heavy chain leash. Trevor (and us)\nabout piss our pant's. The dog continues barking, Trevor\nregains his composure. Suddenly the dogs attention moves\ntoward the direction of the DARK FIGURE. Amazingly, it stops\nbarking and actually cowers back into the shadows.\n\nSpooked, Trevor rushes up to:\n\n<b>EXT. TREVOR'S APT. - NIGHT\n</b>\nHe hurries up to his apartment building and lets himself in.\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nHe looks out on the street.\n\nThe figure is walking up the building opposite his. It's\nfeatures are shrouded in shadow, but it is definitely staring\nat Trevor, who slams the apartment door behind him. He peers\nout at the street from inside the front hall.\n\nThe figure is gone.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             21.\n</b><b>CONTINUED:\n</b>\n\nTrevors looks around the apartment. He opens the fridge, it\nlights up the darkened room. He grabs one of the three items\nsitting on the wire racks. About to twist off the cap off a\ncold beer, when a light out his window urges him to\ninvestigate. He draws the curtain open and GASPS.\n\nPOV OUT WINDOW: Staring back at him, from a dimly lit window\nin the apartment building across the street, is the SHADOWY\nMAN that followed Trevor home.\n\nThe man's face is shrouded in shadows but Trevor can see he's\nholding something bundled up in a blanket. The light in the\nwindow winks out, rendering it dark again.\n\nTrevor can almost still see the figure somewhere in the\ndarkness still gazing at him.\n\nTrevor looks a little sick all of a sudden, like he can't\nbreathe.\n\nTHE BELL FROM A DISTANT CATHEDRAL begins to peel. BONG...\n<b>BONG... BONG...\n</b>\nTrevor opens his mouth to draw in a breath but instead spits\nout a massive amount of water!\n\n<b>BONG... BONG... BONG...\n</b>\nTrevor falls to the ground, arms and legs thrashing, heaving\nup mouthfuls of water. Trevor is drowning...\n\n<b>BONG... BONG... BONG...\n</b>\nIn the puddles of water, we see bits of debris: leaves,\npebbles, etc. Finally, a hideous eel-like creature's head\npokes out of Trevor's gaping mouth- it escapes and slithers\nacross the floor, up the window sill and out into the night.\n\n-the ringing bell stops abruptly and he takes in a humongous\nlungful of sweet oxygen. He then notices he is completely\ndry. Stunned, he looks about him.\n\nTrevor is now laying on the easychair, nursing a beer. His\nvideogame is flashing PLAY AGAIN? Whoa.\n\nThe BING-BONG! of his doorbell startles him.\n\nTrevor gets the door to find a striking young GOTHIC WOMAN on\nthe other side. Black hair, lipstick, fingernails. She smiles\n(too brightly for someone with such somber appointments) then\nsummarily lifts her shirt to just below her breasts for\nTrevor.\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                             22.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    GOTHIC WOMAN\n</b>          Here it is, what do you think?\n\nTrevor looks down at her stomach, the lower half of which\ncontains tattoos which just break the surface of her jeans.\nAt its center is a navel pierced with a studded black pearl,\nwhich Gothic Woman then plays with. Trevor looks a little\nconfused.\n\n<b>                    GOTHIC WOMAN (CONT'D)\n</b>          I saw it on the counter, looked at the\n          name and the rest is history. It's like,\n          named after me. Well...?\n\n<b>                    TREVOR\n</b>              (getting uncomfortable)\n          Oh. Uh... it's beautiful. I'm sorry, I've\n          just been having a weird day...\n\n<b>                    TAWNY\n</b>          I totally understand. Listen I don't know\n          if you're into incense but, I bought\n          some, it's called Witching Hour. To\n          inhale it is to love it. I mean the\n          stuff'll clear your head big time. Come\n          on over, I'll burn some for you. If you\n          can't sleep tonight...\n\nShe jabs a thumb down the hall behind her.\n\n<b>                     TAWNY (CONT'D)\n</b>          ... knock on my door, I'm a total\n          insomniac.\n\n<b>                    TREVOR\n</b>          No, thanks I've got a... a date tonight-\n\nHis eyes roaming her, he finally finds a tattoo on her\nshoulder reading:\n\n<b>                    TREVOR (CONT'D)\n</b>          -Tawny.\n\n<b>                    TAWNY\n</b>              (eyebrows raised)\n          Whew. You bounce right back don't you?\n\n<b>                    TREVOR\n</b>          What do you mean?\n\n<b>                    TAWNY\n</b>          Didn't your like... whole life get\n          totalled last week?\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                            23.\n</b><b>CONTINUED: (3)\n</b>\n\n<b>                    TREVOR\n</b>          Last week...\n\n<b>                    TAWNY\n</b>          The car accident? Any of this ringing a\n          bell?\n\nTrevor eyes her nervously then:\n\n<b>                    TREVOR\n</b>          It's not that kind of date.\n\n<b>                    TAWNY\n</b>          Hey even if it is more power to ya.\n              (awkwardly)\n          Alrighty then. Have a good time.\n\nTawny ambles off to her apartment. Trevor closes the door and\nleans against it. He slides down the door and covers his face\nwith his hands. Another headache coming on.\n\n<b>INT. TREVOR'S APT. - SEVEN THIRTY\n</b>\nTrevor paces in his living room. Looks at watch. Then the\ndoor. Still no sign of Gwen.\n\n<b>INT. TREVOR'S APT. - DAY\n</b>\nTrevor rummages through a closet. Reaching up to a shelf\nabove him, he tugs at a big cardboard box and pulls. The\nentire box comes crashing down and out spill about fifty VHS\ntapes, all hand-labeled: KIRSTY &amp; TREVOR, then the date.\n\nHe puts one in the VCR, hits play...\n\nIt's his wedding video. Trevor watches the festivity of the\nwedding ON THE SCREEN, he smiles for the first time.\n\nThe wedding portion of the tape ends and a not-so-clean edit\ntakes us into the honeymoon.\n\n<b>CLOSE ON THE TV SCREEN:\n</b>\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nTrevor holds the camera on Kristy who is under the covers in\na generic hotel room. She looks into camera as Trevor adjusts\nfocus and squares up the frame.\n\n<b>                    KIRSTY\n</b>          Well Trevor. It's been one year. Three\n          hundred sixty five days.\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                24.\n</b><b>CONTINUED:\n</b>\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             Eight thousand seven hundred sixty hours.\n             Five hundred twenty five thousand...\n\nKirsty watches Trevor roam the room. She very comfortable on\ncamera.\n\n<b>                       KIRSTY\n</b>             How does feel to be Mr. Kirsty Hughes for\n             a whole year.\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             In a word? Lucrative.\n\n<b>                       KIRSTY\n</b>             The best business decision if you ever\n             made I'll bet.\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             Enjoyable too. The merger never even felt\n             work for one second.\n\n<b>                       KIRSTY\n</b>             You know what the family lawyer told me\n             one our wedding day?\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             What?\n\n<b>                       KIRSTY\n</b>             Never to put you in my will.\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             Really? Why?\n\n<b>                       KIRSTY\n</b>             Because you'd be staying with me for me\n             and not because you'd get rich if I died\n             for some reason.\n\n<b>                       TREVOR\n</b>             But you had more wisdom than to listen to\n             a false prophet\n\n<b>                       KIRSTY\n</b>             There is no wisdom, no insight, no plan\n             (prvb 21:30)\n\nThey share a moment.    Kristy stares at him quietly through\nthe camera.\n\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                25.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                       KIRSTY (CONT'D)\n</b>             And besides, I thought, to hell with\n             it... it's okay if you only married me\n             for my money.\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             Really, why's that?\n\n<b>                       KIRSTY\n</b>             I only married you for your body.\n\nThey laugh. The camera now looks away from Kristy and into\nTrevors suitcase. Trevors pulls out a wrapped present. A\nsmall tightly wrappped, perfectly square gift.\n\n<b>                       KIRSTY (CONT'D)\n</b>             What are you doing?\n\nThe camera now back on Kristy. And the present comes up into\nframe.\n\n<b>                       TREVOR (OFF CAMERA)\n</b>             Happy Anniversary, Mrs. Gooding.\n\n<b>                       KIRSTY\n</b>             For me? Trevor! How romantic! Come here,\n             you.\n\nThe camera begins to wobble as Trevor climbs onto the bed.\nIts lands sideways, and we see sheets and covers rustling,\naccompanied by the sound of giggling and kissing.\n\nThe tape ends. SNOW.\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nFROM THE COUCH Trevor watches this...Any of this ringing a\nbell?\n\n<b>BING BONG!\n</b>\nTrevor gets up and pops the tape out.\n\n<b>BING BONG!\n</b>\nHe slowly walks toward the door. He opens it to find a pitch\ndark hallway.\n\n<b>                       TREVOR\n</b>             Hello? Who's out there?\n\nGWEN suddenly comes out of the darkness clamping her mouth\nonto his and examining his tonsils with her tongue.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                26.\n</b><b>CONTINUED:\n</b>\n\n<b>                       GWEN\n</b>             Sorry I'm late dear.\n\nTrevor looks like he'd be more turned on sitting bare-assed\non an autopsy table.\n\n<b>                       TREVOR\n</b>             Gwen you scared the living shit out of\n             me.\n\nShe pushes him toward the chair and sits him in it.\n\n<b>                       GWEN\n</b>             You are turning into an old fuddy duddy.\n             Shoe.\n\nGwen puts one foot on his chest.\n\n<b>                       GWEN (CONT'D)\n</b>             Come on don't make me beat you.\n\nTrevor pulls the shoe off.\n\n<b>                       GWEN (CONT'D)\n</b>             Other shoe.\n\nTrevor does the same for the other leg.\n\n<b>                       GWEN (CONT'D)\n</b>             Good boy.\n                 (looking around)\n             Where's is it?\n\n<b>                       TREVOR\n</b>             What?\n\n<b>                       GWEN\n</b>             Our little toy. You usually have it up\n             and running by now.\n\n<b>                       TREVOR\n</b>             Do I really want to know what you're\n             talking about?\n\n<b>                                                      SMASH CUT TO:\n</b>\n<b>A VIDEOCAMERA ON A TRIPOD TAPING GWEN KISSING TREVOR ON THE\n</b><b>EASY CHAIR.\n</b>\nThe cable from the camera runs all the way to the TV where WE\nSEE what's happening as well.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                27.\n</b><b>CONTINUED:\n</b>\n\nIt's intense. Gwen is on top. Gwen aggressively pulls\nTrevor's shirt off then goes for his belt. Trevor suddenly\ngrabs her hands.\n\n<b>                       GWEN\n</b>             You're kidding me.\n\n<b>                       TREVOR\n</b>             I'm sorry Gwen. I just can't.\n\nGwen climbs off the chair and throws her jacket back on.\n\n<b>                       GWEN\n</b>             You have definitely got a screw loose,\n             Trevor. Goodbye.\n\nStuffing her feet in her shoes, Gwen's out the door.\n\nTrevor SIGHS, relieved the attack is finally over.\n\nAbout to turn the TV off and stow away his camera. He looks\nat the TV and freezes.\n\nTHE IMAGE ON THE TV shows that Gwen is still there,\nundressing Trevor. Only video Trevor is giving in, kissing\nher back, pulling her clothes off.\n\nTrevor looks at the camera. The red \"record\" light is\nflashing. Trevor turns back to the TV walking closer and\ncloser to the screen.\n\n<b>                       TREVOR\n</b>             What the hell?\n\nHe waves a hand in front of the camera and his hand actually\nappears on the TV in front of the sex image.\n\n<b>TREVOR WATCHES\n</b>\nTrevor and Gwen make love in video. Video Trevor turns to the\nthe camera (to Trevor) and gives a menacing smile.\n\nVideo Trevor looks back up at Gwen, who smiles down at him\ncarnivorously. She licks her lips.\n\n<b>                       VIDEO GWEN\n</b>             There's one thing I should have told you\n             right from the beginning Trevor.\n\nVideo Trevor doesn't see a knife she manages to slip out of\nher purse.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             28.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    VIDEO GWEN (CONT'D)\n</b>          I like it pretty rough.\n\nTo Trevor's shock Gwen suddenly drags the knife right across\nhis throat. Blood shoots up at Gwen's grinning face. Blood\npours out of Trevor's mouth and down his chest.\n\nFROM THE COLOR SCREEN Trevor, having just seen himself get\nmurdered, shouts:\n\n<b>INT. HOSPITAL ROOM - DAY\n</b>\n<b>                    TREVOR\n</b>          No!\n\nAllison stands above him Bic razor in her gloved hand. The\nbottom half of Trevor's face is covered with shaving cream.\n\n<b>                    ALLISON\n</b>          Sorry I thought you were going to stay\n          under longer.\n\nHis face is clean shaven, a little shaving cream remains\naround his chin. He now has several electrodes attached to\nhis cranium. They're connected to an EEG which BEEPS LOUDLY.\nThe noise bothers Trevor. His eyes dart this way and that. He\nfocuses on the Bic razor.\n\n<b>                    TREVOR\n</b>           What's happening to me? What are you\n          doing?\n\n<b>                    ALLISON\n</b>          You came in for your EEG. You fell asleep\n          and well, I took the liberty of...I'm\n          sorry. You looked like a wreck Trevor.\n\nTrevor seems to like the attention.\n\n\n<b>                    TREVOR\n</b>          I just had the most vivid dream. I was\n          sure I was dying.\n\n<b>                    ALLISON\n</b>          Well you can relax now you are quite\n          alive. And as long as you're awake, chin\n          up.\n\nTrevor puts his chin up and Allison continues shaving his\nneck. Trevor studies her face.\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                29.\n</b><b>CONTINUED:\n</b>\n\n<b>                       ALLISON (CONT'D)\n</b>             Well? What do you say Trevor? Que pasa?\n\n<b>                       TREVOR\n</b>                 (groggily)\n             Let me see. Oh yeah. My head feels like\n             it's going through a meat grinder. I'm\n             not sure if I'm dreaming or...\n\n<b>                    ALLISON\n</b>    (interupting) That `poor me' attitude doesn't suit\n    you Trevor. Listen, I don't mean to sound like\n    Pollyanna but things could be worse. There's one\n    good thing about coming so near to the end of ones\n    life. Everything is new and exciting, like your\n    seeing it for the first time.\n   You might see things a litlle differently from now\n    on.\n\n<b>                     TREVOR\n</b>    Your insight is enlightening.\n\n\n<b>                       ALLISON\n</b>             No wisdom, no insight, no plan.\n\nAllison gives him a wink, disarming Trevor.\n\n<b>                       TREVOR\n</b>             My wife said that exact same sentence to\n             me the day we got married. She even\n             winked too.\n\nAllison smiles and puts her hand on his.\n\n<b>                       ALLISON\n</b>             Do you use this wife thing to hit on all\n             the interns?\n\n<b>                       TREVOR\n</b>                 (smiling)\n             No... just you.\n\nAllison wipes his face clean with a towel.\n\n<b>                       ALLISON\n</b>             There. Just like a baby's butt.\n\nAllison gets up, grabs a clipboard starts filling out a\nreport. Trevor stares at her.\n\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             30.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    TREVOR\n</b>          Allison? Why can't remember what happened\n          to my wife? Is it something I'm on\n          that's... that's making me forget?\n\n<b>                    ALLISON\n</b>          Easy there Trevor. You need to relax.\n\n<b>                    TREVOR\n</b>          No I need to remember. Look whatever it\n          is take me off it. I can handle pain. I\n          can't handle not knowing...\n\n<b>                    ALLISON\n</b>          You need to get better first Trevor. Way\n          better.\n              (scribbling in the chart)\n          It's okay to miss somebody. It's okay to\n          still love someone after they're gone.\n          But you've got to quit blaming yourself\n          okay...? Okay?\n\nAllison looks up and notices Trevor's body has slackened, his\neyes empty. She drops the clipboard and starts snapping her\nfingers over his eyes.\n\n<b>                       ALLISON\n</b>          Trevor?\n\nHe is unconscious. A LOUD STEADY BUZZ sounds from one of the\nmachines behind her as blood begins to leak out of Trevor's\near. Allison jumps up and hits call button above Trevor's\nbed.\n\n<b>                       ALLISON (CONT'D)\n</b><b>          CODE BLUE!\n</b>\nShe yanks Trevor's johnnie down, wheels a defribulator over\nto his dying body and grabs the paddles.\n\n<b>                    ALLISON (CONT'D)\n</b>          It's okay Trevor I'm coming for you.\n\nAllison rubs the paddles together, presses the paddles\nagainst Trevor's chest and-\n\n<b>INT. TREVOR'S APT. - DAY\n</b>\n-Trevor sits bolt upright in his bed. His alarm clock is\nmaking that same BUZZING noise.\n\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             31.\n</b><b>CONTINUED:\n</b>\n\nTrevor is completely disoriented. He sees a note laying next\nto him on the bed. It says ìYou're an animal baby... you-know-\nwho...î He finally looks at the clock. Seven forty five.\n\n<b>                       TREVOR\n</b>             Shit, I'm gonna be late!\n\n<b>INT. TREVOR'S CUBICLE - DAY\n</b>\nTrevor is on his computer typing madly. ON THE SCREEN WE SEE\nhe has accessed the local newspaper. He calls up an article\nreading: ACCIDENT LEAVES ONE HOSPITALIZED ANOTHER MISSING.\n\nHe looks at a newspaper picture of the bridge, which is\nhumming with rescue activity.\n\nTrevor's head is pounding. He goes into his desk drawer and\npulls out a bottle of aspirin.\n\nTrevor empties the last of the bottle's six tablets into his\nhand, downs them, chases them with what's left of an economy\nsized bottle of Mylanta. Trevor can't seem to even look at\nhis computer screen. He hears a DING-DING and looks up.\n\nHe has an instant office message waiting. Trevor clicks OK.\nThe instant message reads: ìIT'S TOO LATE.î Trevor rapidly\ntypes up. ìWHO IS THIS.î The same message is repeated. ìIT'S\n<b>TOO LATE. IT'S TOO LATE. IT'S TOO LATE.î\n</b>\nTrevor stands up and looks around mazelike structure of\ncubicles as far as he can see. All of his co-workers are\nslaving away on their keypads. Trevor sits back down and\ncancels the instant message. He ruminates for a moment.\n\nFrom behind Bret's fingers TAPPING on the keyboard seem to\nget louder, more frustrated. They finally stop and Bret\nstretches momentarily.\n\n<b>                       BRET\n</b>             Must be nice.\n\n<b>                       TREVOR\n</b>             What?\n\n<b>                       BRET\n</b>             Getting paid for doing shit.\n\nBret goes back to work again, fingers HAMMERING away.\n\n<b>                       TREVOR\n</b>             Come on, Bret.\n\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                32.\n</b><b>CONTINUED:\n</b>\n\n<b>                       BRET\n</b>             Seriously man, you oughta work for the\n             government. You've got the sense of\n             urgency for it.\n\nTrevor himself begins to type, slowly, reluctantly.\n\n<b>                       TREVOR\n</b>             Look, I'm doing my best considering okay?\n\n<b>                       BRET\n</b>             Hey if the boss doesn't notice who cares\n             right? Just slack all the live long day\n             if you want.\n\n<b>                       TREVOR\n</b>             The boss won't notice me doing a bad job\n             because I'm not. Even if the boss thought\n             I was slacking I'd know right away.\n\n<b>                       BRET\n</b>             Yeah, how's that?\n\n<b>                        TREVOR\n</b>                 (smug)\n             I have my connections\n\n<b>                       BRET\n</b>             Really? Do tell.\n\n<b>                       TREVOR\n</b>                 (smiling)\n             Gwen.\n\nBret freezes. He then looks at Trevor, eyes bulging.\n\n<b>                       BRET\n</b><b>             GWEN?\n</b>\n<b>                       TREVOR\n</b>             I crap you not. She was all over me\n             yesterday in the break room. And she was\n             a total machine last night too.\n\n<b>                       BRET\n</b>             You were supposed to have a date with\n             Gwen last night? GWEN DEARDON? The\n             supervisor?\n\n<b>                       TREVOR\n</b>             Serious as a heart attack my friend. I\n             think she literally fucked me brains out.\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             33.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    BRET\n</b>              (super sarcastic)\n          Wow that's quite a feat Trevor\n          congratulations. Must be really tough to\n          get your brains fucked out by a CORPSE.\n\nTrevor stops and looks at Bret.\n\n<b>                    TREVOR\n</b>          What are you talking about?\n\n<b>                     BRET\n</b>          Me? This is your sick joke man. Gwen was\n          murdered here six months ago. The\n          security guard found her all over her\n          office. Her head was in the waste paper\n          basket. Her stomach was in the filing\n          cabinet. Her ass was on the copy\n          machine...\n\nTrevor is speechless.\n\n<b>                    BRET (CONT'D)\n</b>          They never found the sicko who did it...\n          remember?\n\nTrevor still can't speak. He goes into his computer mailbox\nand re-opens the file he'd received from ìYou Know Who.î\n\nHe stifles a scream when he sees the jpegs have changed. Sure\nthey're still of Gwen. Pieces of her swimming in puddles of\nher own blood. Where it once said ìWork harderî it now says\nìPolice File.î\n\n<b>                    TREVOR\n</b>              (to himself)\n          Jesus Christ...\n\nTrevor looks behind him to make sure Bret hasn't seen any of\nthis. He's facing his own computer typing away.\n\n<b>                    BRET\n</b>          Man are you ever out of the loop. Either\n          that or you've got the worst sense of\n          humor this side of Jeffrey Dahmer. What\n          is your problem anyway?\n\nTrevor quickly deletes the entire file. Finally...\n\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             34.\n</b><b>CONTINUED: (3)\n</b>\n\n<b>                    TREVOR\n</b>          Honestly Bret? I think I lost my mind.\n          And now I'm finding pieces of it, like\n          pieces of a wrecked car, scattered on\n          the side of the road.\n\nA beat.\n\n<b>                    BRET\n</b>          Bud you need to decompress. I told you\n          you came back to work too soon after the\n          accident.\n\nTrevor says nothing.\n\n<b>                    BRET (CONT'D)\n</b>          Hey you know what Trev? I'm going to hook\n          you up man. Here...\n\nBret wheels across the cubicle on his chair and hands\nsomething to Trevor. It's an oddly designed postcard bearing\nsome sort of voodoo mask. The font is faux-Oriental, the kind\nthey use for Chinese take-out menus. He looks closer. It's an\nappointment card for an acupuncturist. Sage.\n\n<b>                    BRET (CONT'D)\n</b>          This woman will take one look at you and\n          know exactly what you need.\n\n<b>INT. SAGE'S OFFICE - DAY\n</b>\nA chart of all the puncture points on the human body is\ntacked to the wall.\n\nTrevor lies on the table. SAGE, a gorgeous ethereal Indian\nwoman is at the far end, hovering over the soles of his feet,\nsticking pins into the appropriate places. She looks up at\nhim slyly.\n\n<b>                    SAGE\n</b>          These headaches you've been getting. Do\n          they happen in conjunction with the\n          hallucinations?\n\nSage walks over to one of the cabinets, gathering more\nacupuncture needles. Trevor can't help but notice her shapely\nbody, her feline gait. Sage throws a sultry glance over her\nshoulder at him, prompting him to finally answer her\nquestion.\n\n<b>                    TREVOR\n</b>              (unsure of himself)\n          Yes, sort of.\n<b>                    (MORE)\n</b><b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                35.\n</b><b>CONTINUED:\n</b>                       TREVOR (cont'd)\n             My head's been in constant pain since\n             the... accident. And the pain increases\n             whenever I, uh... slip into another, I\n             don't know what to call them...\n\nSage comes back to him, several needles in one hand. She\nlooks into his eyes.\n\n<b>                       SAGE\n</b>             Dreams?\n\n<b>                       TREVOR\n</b>             I was going to say dimensions. But I\n             guess technically they are dreams.\n\n<b>                       SAGE\n</b>             You should always listen to your\n             subconscious. It's trying to tell you\n             something about your waking life.\n\nSage begins applying the needles fluidly to his upper body\nnow.\n\n<b>                       TREVOR (CONT'D)\n</b>             But I never feel like I'm sleeping. It's\n             sort of, waking narcolepsy. I'll be\n             somewhere and then-\n                 (snapping his fingers)\n             -it's like I was never wherever I was to\n             begin with I was really somewhere else\n             entirely.\n\nSage puts the last needle in. For the first time Trevor\nactually feels a releief of pressure in his head.\n\n                       TREVOR (cont'd)\n             Ok, whatever that was...do it again.\n             That just set me free of the worlds\n             longest head ache. Is this making any\n             sense?\n\n<b>                       SAGE (CONT'D)\n</b>             None whatsoever. Now just relax. Let the\n             needles do the driving.\n\nA PHONE OUTSIDE THE OFFICE RINGS. Sage looks up at the door.\n\n<b>                       SAGE (CONT'D)\n</b>                 (patting his cheek)\n             Don't go anywhere. I'll be right back.\n\nTrevor watches Sage EXIT the office. He lies there a moment,\nbathing in warm sunshine. He is relaxed, pain free.\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             36.\n</b><b>CONTINUED: (2)\n</b>\n\nBehind him, an acupuncture anatomy chart on the wall. Which\nbegins to change its shape. It morphs (or economically\nchanges) into PINHEAD.\n\nTrevor is oblivious as PINHEAD approaches, doll eyes\nbetraying no feeling whatsoever. Then, Pinhead reaches up to\nhis head and begins pulling out one of those infamous pins.\nIt takes a while to come out.\n\nBecause it is a foot long. Once out, the needle drips with\nblack ooze.\n\nTrevor hears a noise and believes its Sage who's reentered\nthe room.\n\n<b>                    TREVOR\n</b>          I'm thinking this might just be what I\n          needed.\n\nPinhead speaks but in Sages voice. As he pushes on of the\npins into the tip Trevors skin in his back .\n\n<b>                    PINHEAD\n</b>          No matter what happens just remember...\n\nBefore Trevor can react, Pinhead suddenly jabs the pin down\ninto Trevor's back, pinning him to the table! It sears his\nskin. In Pinheads recognizable voice...\n\n<b>                    PINHEAD (CONT'D)\n</b>          We're all here for you Trevor.\n\nAs Trevor reels in terror, Pinhead pulls another foot long\nneedle from his head and thrusts this one into his neck! WE\nSEE the needle come right out the other side, nailing itself\ninto the table. Trevor can't believe he's still alive!\n\nPinhead pulls one more out, aims this one at Trevor's arm,\nand swings down.\n\n                                                    quick cuts:\n\n<b>INT. HOSPITAL ROOM - DAY\n</b>\nAllison pokes Trevor's arm with a hypodermic. She places a\nreassuring hand on his chest. Machines behind her are PINGING\nand BUZZING like crazy. Allison looks a little worried.\n\n<b>                    ALLISON\n</b>          Shh. It's okay. Go back to sleep.\n\nAllison blurs out of focus...\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                37.\n</b><b>CONTINUED:\n</b>\n\n... then briefly comes back into focus...\n\n... only now it's A MAN INSIDE A DARKENED ROOM.\n\n<b>INT. DARKENED ROOM - DAY\n</b>\nTREVOR'S POV: Buried in the murky shadow, all that can be\nseen are his hands, lit by a shaft of sunlight beaming\nthrough a blinded window. A ring on the man's left pinky\nfinger glimmers eerily, almost too much. We saw this man in\nan earlier FLASHBACK\n\nHe's holding something. The cube. He speaks in an ECHOED and\n<b>DISTORTED VOICE.\n</b>\n<b>                       DARKENED MAN\n</b>             I know. Divorce isn't good enough.\n             Abandonment isn't good enough. There's\n             only one way to do it and do it cleanly,\n             without leaving a trace of evidence.\n\nThe darkened man pushes the cube across the desk towards us.\n\n<b>                       DARKENED MAN (CONT'D)\n</b>             Open this and your problem will disappear\n             forever. And no one will ever suspect\n             you. A word of caution though. A certain\n             side effect of the box. Pleasure.\n             Pleasures that would redefine the\n             parameters of sensation.\n\nTrevors picks up the cube.\n\n\n<b>                       DARKENED MAN (CONT'D)\n</b>             Once the cube is opened there is no\n             turning back. Ever.\n\nA LOUD BUZZING NOISE BEGINS drowning out the darkened man's\nwords as we:\n\n                                                    dissolve to:\n\n<b>INT. TREVOR'S BEDROOM - DAY\n</b>\nTrevor quietly wakes up to the sound of his alarm BUZZING\nagain. He stares at the ceiling.\n\n<b>INT. OFFICE BUILDING - DAY\n</b>\nTrevor pushes through the front doors and a RECEPTIONIST\ngreets him with a big smile and a business card.\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                38.\n</b><b>CONTINUED:\n</b>\n\n<b>                       RECEPTIONIST\n</b>             Afternoon doll-face. Hey, a police\n             detective was just here to see you.\n                 (looking at the card)\n             Some guy named Givens.\n\nShe hands the card to him batting her eyelashes. Trevor looks\nat the card as she checks out his package. Trevor reads the\nword HOMICIDE.\n\n<b>                       TREVOR\n</b>             Uh thanks this looks a little important.\n             Could you let the folks upstairs know\n             I'll be late?\n\n<b>                       RECEPTIONIST\n</b>             For you bubbalicious?\n                 (winking)\n             I'd lay across a bed of nails.\n\nTrevor walks back OUT and the receptionist watches him go.\nAnother female employee walks by staring at Trevor. She looks\nat the receptionist and they both nod in agreement.\n\n<b>                       RECEPTIONIST (CONT'D)\n</b>             You know it girl. That ass is a three-\n             hummer baby. Mmm-mmm-mmm.\n\n<b>INT. LANGE'S OFFICE - DAY\n</b>\nSame office only Trevor is sitting at the other desk across\nfrom a hawklike MAN who is playing with a yoyo. This is\nGIVENS. If good cop bad cop is the scheme here, he's the\nlatter.\n\n<b>                        TREVOR\n</b>             I'm sorry. I still... I don't understand\n             how this is a homicide case. I mean\n             nobody was murdered here... Her body's\n             been missing for I don't know how long\n             now and...\n\n<b>                       GIVENS\n</b>             What did you just say?\n\n<b>                       TREVOR\n</b>             I said she's been missing for-\n\n<b>                       GIVENS\n</b>             No. No you said HER BODY's been missing.\n\n<b>                       TREVOR\n</b>             What's the difference?\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                39.\n</b><b>CONTINUED:\n</b>\n\n<b>                       GIVENS\n</b>             Last time anybody saw this woman she was\n             alive. You seem to certain she's dead.\n\n<b>                        TREVOR\n</b>                 (tearing up)\n             I saw her drowning inside the car,\n             detective.\n\n<b>                       GIVENS\n</b>             I read up on you, man. You're a smart guy\n             aren't you? I mean with numbers. Right?\n\n<b>                       TREVOR\n</b>             You could say that.\n\n<b>                       GIVENS\n</b>             Zero's a number right?\n\n<b>                       TREVOR\n</b>             As in one minus one equals zero yes.\n             Where are you going with this?\n\n<b>                       GIVENS\n</b>             How many zeros was your wife worth?\n\nBrow furrowing, Trevor stands up.\n\n<b>                       TREVOR\n</b>             I need to talk to my attorney. Now.\n\nGivens pushes his phone toward Trevor, who takes it and dials\nfuriously. Givens remains poker-faced. Trevor dials a number.\n\n<b>                       TREVOR (CONT'D)\n</b>                 (into phone)\n             Yes I need LARRY ELLIS' office please.\n\nHe says the lawyer's name like it's supposed to intimidate\nGivens. He couldn't care less.\n\n<b>                       TREVOR (CONT'D)\n</b>                 (a beat)\n             Yeah this is Trevor Gooding I need to\n             speak with Larry... Trevor...? Kirsty\n             Gooding's husband...?\n                 (another beat)\n             I see do you know when he'll be out that\n             meeting? Fine I'll uh... call back\n             then... Okay you give him the message and\n             he'll call me that's great.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                            40.\n</b><b>CONTINUED: (2)\n</b>\n\nWith that Trevor hangs up the phone and EXITS the office.\nGivens BUSTS OUT LAUGHING.\n\n<b>INT. TREVOR'S CUBICLE - DAY\n</b>\nTrevor types bitterly on the computer crunching numbers like\na madman.\n\n<b>                    BRET\n</b>          I don't know what pissed you off but it's\n          nice to see you getting the job done for\n          a change.\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nTrevor plays his videogame with venom. The cries of his kills\nemanate from the TV, building to a crescendo. Finally we hear\na WOMAN'S VOICE come from the TV.\n\n<b>                    WOMAN'S VOICE\n</b><b>          I'M SAVED! MY HERO!\n</b>\nTrevor flicks the REPLAY button.\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nTrevor stares at the self-taken picture of him and his wife\nmugging at the camera. What is it that Kirsty is holding?\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nThe TV is on. Trevor flips through the channels. He stops on\nthe Nature Channel. A goat is casually munching on some nuts\nand berries.\n\n<b>                    ANNNOUNCER'S VOICE\n</b>              (from TV)\n          -at the dawning of the agrarian age\n          goat's milk would be considered a\n          suitable substitute for a mother's breast\n          milk. And the sacrifice of a goat would\n          appease an angry god and ensure a\n          bountiful harvest. But in time the ritual\n          would become associated with less\n          hallowed purposes.\n\n<b>HEADLINE: CHURCH DESECRATED WITH BLOOD OF GOAT, LAMB\n</b>\n<b>                    ANNNOUNCER'S VOICE (CONT'D)\n</b>          Goat's blood is said to hold supernatural\n          properties linked to black magic.\n<b>                    (MORE)\n</b>\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                41.\n</b><b>CONTINUED:\n</b><b>                       ANNNOUNCER'S VOICE (CONT'D)\n</b>             In conjunction with the pentangle- the\n             five pointed star- the spilling of goat's\n             blood is considered to be either an\n             aphrodisiac that can be used in demonic\n             orgies, or a means by which a high priest\n             may summon Satan himself.\n\nAN ILLUSTRATION of a goat with many eyes appears on the\nscreen.\n\n<b>                       ANNNOUNCER'S VOICE (CONT'D)\n</b>                 (from TV)\n             The Book of Revelations speaks of the\n             anti-Christ as the beast with many eyes.\n             For centuries illustrators have chosen a\n             goat to represent this beast.\n\nHis eyes hurting too much to watch any more, Trevor turns the\nTV off. Out of sheer instinct he suddenly turns to look-\n\n<b>-OUT HIS WINDOW:\n</b>\nThe apartment across the street is lit. A STRANGE FIGURE is\nstanding in the window.\n\nTrevor jumps up and rushes over to his window. He looks OUT\nat that same shadowy man he saw earlier. The man's face is\nstill obscured and is still holding something in a blanket.\nSquinting Trevor is able to make out what it is:\n\nA SLEEPING BABY. The stranger pulls the baby's blanket over\nthe baby's angelic face. Then the light in that apartment\ngoes out abruptly.\n\nTrevor stares at the darkened window breathing heavily. Is\nthe stranger still in there, watching Trevor in the dark?\nTrevor cannot tell.\n\nA SUDDEN KNOCKING AT THE DOOR makes him flinch.\n\nTrevor goes to the door, opens it to find:\n\nTAWNY. Only now she's dressed in a skintight black rubber\ndress. She smiles accentuating a fresh coat of black\nlipstick.\n\n<b>                       TAWNY\n</b>             Hey. Can I borrow something?\n\n<b>                       TREVOR\n</b>             Uh... sure, Tawny... what?\n\n<b>                       TAWNY\n</b>             You.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                           42.\n</b><b>CONTINUED: (2)\n</b>\n\nTawny grabs the back of his neck, pulling him to her as she\nkisses him deeply. She grabs his collar and pulls him out to\nthe hallway.\n\n<b>INT. HALLWAY - NIGHT\n</b>\nShe turns around, leading Trevor through the hall like a\nhorse. A very confused horse.\n\n<b>                    TREVOR\n</b>          Tawny? What's- what are you doing?\n\n<b>                       TAWNY\n</b><b>          YOU!\n</b>\nTrevor eyes her gorgeous body and decides not to resist quite\nso much.\n\n<b>INT. TAWNY'S KITCHEN - NIGHT\n</b>\nTrevor leans against the counter, sipping at a glass of wine\nnervously. Right next to him, Tawny's at the stove, stirring\na pot of something dark and bubbly. She looks up at him,\nsmiling seductively. But Trevor's still a few lengths behind.\n\n<b>                       TAWNY\n</b>          You okay?\n\n<b>                    TREVOR\n</b>          I'm, uh, not sure... Feeling kind of\n          weird actually.\n\n<b>                       TAWNY\n</b>          Really?\n\nTawny grabs Trevor's balls and he jumps away as if jolted by\na cattle-prod.\n\n<b>                    TAWNY (CONT'D)\n</b>          I'm kinda feeling nuts myself!\n\n<b>                    TREVOR\n</b>          I've never said this to a woman before\n          but can't we talk a little bit before\n          grabbing at each other?\n\n<b>                    TAWNY\n</b>              (grinning)\n          God. Sometimes you can be such an animal.\n          Other times you are the ultimate tease...\n\nShe holds up a spoonful of what she's been stirring. It looks\nlike stew.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>                                                                43.\n</b><b>CONTINUED:\n</b>\n\n<b>                       TAWNY (CONT'D)\n</b>             Taste this.\n\nKeeping a hand below his waist Trevor leans toward the spoon,\ntastes, licks his lips. Then squints.\n\n<b>                       TREVOR\n</b>             Wow. That's good. Lots of capers, huh?\n\n<b>                       TAWNY\n</b>             For starters. It's also got fennel,\n             asparagus, olives, some more of mother\n             nature's aphrodisiacs... Back in college,\n             me and my roommates used to call it hard-\n             on stew.\n\n<b>                       TREVOR\n</b>             Not a very appetizing name.\n\n<b>                       TAWNY\n</b>             Have some more.\n\nTrevor takes another sip of it.\n\n<b>                       TAWNY (CONT'D)\n</b>             If you ever smelled this coming from our\n             dorm room, you knew one of us was in\n             there getting laid.\n\n<b>                       TREVOR\n</b>             You must have been very proud of\n             yourselves...\n\n<b>                       TAWNY\n</b>             It's getting hot in here.\n\nTawny summarily unzips her rubber dress and whips it off.\n\nTrevor is speechless.\n\nTawny's body is covered with bites and bruises.\n\n<b>                       TREVOR\n</b>             Jesus... who did that to you?\n\nTawny BUSTS OUT LAUGHING.\n\n<b>                       TAWNY\n</b>             You're kidding right?\n\nTrevor shakes his head no.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             44.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    TAWNY (CONT'D)\n</b>          You did! God, you are funny tonight.\n\nTawny approaches Trevor who tenses up.\n\n<b>                    TAWNY (CONT'D)\n</b>          Almost like I'm with somebody else.\n\nTrevor starts looking very ill.\n\n<b>                    TREVOR\n</b>          Tawny I think I'm going to be sick.\n\n<b>                    TAWNY\n</b>          Well now there's a compliment.\n\nTrevor grabs his stomach, lurching over. He can't breath.\nTrevor looks up at Tawny. But it is no longer her. Tawny has\nchanged into something else entirely.\n\n<b>A CENOBITE.\n</b>\nThe Cenobite rips Trevor's shirt open, and we can see\nmovement within his abdomen. Like a baby kicking. Whatever's\nin their shoots up expanding Trevor's chest cavity.\n\nThe Cenobite pins Trevor to the wall and hovers in his face\nas if about to kiss him.\n\nBefore Trevor can scream he is choking. The Cenobite watches\nwith glee as something begins to move up into Trevor's\nthroat, expanding his neck, forcing his jaws open and\nfinally...\n\n... a BLACK EEL pokes its head out of Trevor's mouth. The\nCenobite opens its own mouth and the eel starts to crawl\ninside it. Meanwhile Trevor's about to pass out from\nasphyxiation when-\n\n<b>INT. HOSPITAL ROOM - DAY\n</b>\n-he takes a deep grateful breath through an oxygen mask. The\nvarious pieces of monitoring equipment around him are BEEPING\nand PINGING like slot machines.\n\nAllison walks around the room pressing buttons that silent\neach machine one by one, then walks up to the bed, looking\nsurprisingly calm.\n\n<b>                    ALLISON\n</b>          Sorry about that. There was a blockage in\n          your oxygen hose. Won't happen again,\n          promise.\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                          45.\n</b><b>CONTINUED:\n</b>\n\nTrevor looks relieved. Shell-shocked but relieved.\n\n<b>                       TREVOR\n</b>             I'm certainly keeping you busy huh?\n\n<b>                       ALLISON\n</b>                 (smiling)\n             Too bad I hate my job...\n\nShe strokes his forehead.\n\n<b>                       ALLISON (CONT'D)\n</b>             Feeling better now?\n\nTrevor shakes his head.\n\n<b>                       TREVOR\n</b>             These hallucinations I'm having. I think\n             they're more like memories coming back to\n             me in a strange way.\n\n<b>                       ALLISON\n</b>             Well that's not necessarily a bad thing\n             is it?\n\n<b>                       TREVOR\n</b>             If they're blocked memories... I'm\n             starting to realize the reason why I\n             blocked them out. Allison I think I\n             really... screwed everything up.\n\n<b>                       ALLISON\n</b>             Shh. Don't blame yourself Trevor. Please.\n\n<b>                       TREVOR\n</b>             I miss her. I miss my wife.\n\nTrevor takes her hand. Allison looks briefly around her\nthen... climbs onto the bed with him.\n\n<b>                       ALLISON\n</b>             If you need to cry, go ahead. I won't\n             tell.\n\nHolding her hand to his face, Trevor closes his eyes,\nsqueezing out a tear.\n\nCLOSE ON TREVOR'S FACE. WE start to NOTICE subtle differences\nabout Allison's hand. It is very pale, the fingernails black.\n\nTrevor opens his eyes.\n<b>\n</b><b>                                                          46.\n</b>\n\n\n<b>INT. TAWNY'S APARTMENT, BEDROOM - MORNING\n</b>\nHe is now lying on Tawny's bed, which is surrounded by unlit\ncandles. Sunlight streams through her open window. It is her\nhand he is holding to his face. The rest of her is sitting\nunder the sheet, covered head propped against the headboard.\n\nTrevor drops her hand and it falls lifelessly to the bed\nbeside him. Breathing quickening he reaches up to the black\nsilk sheet covering her head. He yanks it back and covers his\nmouth in horror.\n\nShe's been bound to the bed and gagged with a white cloth\nthat is soaked with blood. A deep vertical incision has been\nmade in her neck, collarbone to chin and her tongue is pulled\nthrough the wound so it sticks out the bottom of her jaw. And\nthat's just for starters.\n\nWhen Trevor looks down he gags when he sees her ribcage has\nbeen opened like a set of French doors and her insides\nsitting in her lap.\n\nThe coup de grace? Trevor now sees he is covered with blood.\n<b>HERS.\n</b>\n<b>INT. TREVOR'S APT., BATHROOM - DAY\n</b>\nTrevor splashes his face with cold water, trying to get his\ncomposure back. He stares at the water rushing down the drain\nfor a moment. His breathing stabilizes He finally looks up at\nhis reflection in the mirror...\n\n... to see PINHEAD staring back at him.\n\nTrevor jolts backward in shock and does a double take. It's\nhim now, looking completely unhinged.\n\nOutside the PHONE RINGS. The answering machine picks up with\na BEEP.\n\n<b>                    LANGE'S VOICE\n</b>              (from answering machine)\n          This is Lange. We need to talk as soon as\n          possible. It's about your little...\n          dilemma. Give me a call.\n\n<b>INT. HALLWAY - DAY\n</b>\nCleaned up now Trevor carefully makes his way back to Tawny's\napartment. He tries the door. It's locked. This can't be\nright. He jiggles the door knob violently, then finally KICKS\nthe door.\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                47.\n</b><b>CONTINUED:\n</b>\n\nSuddenly-\n\n-TAWNY answers the door, looking utterly pissed off. Though\nstill in Goth mode, she's dressed much more conservatively\nnow.\n\n<b>                       TAWNY\n</b>             Can I help you?\n\n<b>                       TREVOR\n</b>             Tawny... I- you're-\n\nTrevor goes to embrace her. She shrinks back, startled.\n\n<b>                       TAWNY\n</b>             Whoa, I have serious space issues, dude.\n             What do you want?\n\n<b>                       TREVOR\n</b>             I... think we need to talk, there's\n             something really strange going on...\n\n<b>                       TAWNY\n</b>                 (a look of recognition)\n             Hey you're the guy from down the hall.\n\n<b>                       TREVOR\n</b>             Come on, quit fucking around. Listen it's\n             about... what we did together last night.\n\n<b>                       TAWNY\n</b>                 (utterly shocked)\n<b>             WHAT?!\n</b>\nA VERY DEEP VOICE comes from somewhere behind her.\n\n<b>                       VOICE\n</b>             Who the fuck is that?\n\n<b>                       TAWNY\n</b>             It's that guy from down the hall. He\n             thinks we did something with him last\n             night.\n\n<b>                       TREVOR\n</b>             Who's- who's in there with you...?\n\nTawny looks aghast.\n\n<b>                       TAWNY\n</b>             Are you cracking up or something?\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                            48.\n</b><b>CONTINUED: (2)\n</b>\n\nSuddenly an enormous BRUTE of a MAN, wide as he is tall\nENTERS the doorway. He's wearing a black tee, black jeans\nand, Trevor can't help notice, black nail polish... on\nfingers and toes. Obviously Tawny's significant other.\n\n<b>                    BRUTE\n</b>          What can we do for you, chief?\n\n<b>                    TREVOR\n</b>          I... who are you?\n\nBrute takes a sideward step through the doorway, forcing\nTrevor back two steps.\n\n<b>                    BRUTE\n</b>          You know Tawny, you better know me, pal.\n\n<b>                    TREVOR\n</b>          Okay. I don't want any trouble. I was\n          mistaken... I'll see you later.\n\n<b>                    BRUTE\n</b>          Much.\n\nTrevor turns and hurries off. Brute turns to Tawny who shrugs\nand makes a twirly motion at her temple. The two go back into\nher apartment.\n\n<b>INT. TREVOR'S APT. - DAY\n</b>\nTrevor paces in his apartment telephone to his ear. He lets\nout a heavy breath and looks at his watch. Finally:\n\n<b>                    OPERATOR (V.O.)\n</b>          City police main switchboard how may I\n          direct your call?\n\n<b>                    TREVOR\n</b>          You already asked me that ten minutes ago\n          just before you put me on hold. I'm\n          looking for defective- I mean Detective\n          Lange.\n\n<b>                    OPERATOR\n</b>          Oh he and his partner just stepped out to\n          lunch, can I-?\n\nTrevor hangs up.\n<b>\n</b><b>                                                             49.\n</b>\n\n\n<b>INT. BUS - DAY\n</b>\nTrevor sits at the front of the bus agitated. He folds and\nunfolds Detective Lange's business card in his hands like\nsome frustrated Origami artist.\n\nThe SIREN from a passing ambulance drills his ears. The\nirritating sound eventually fades away but the pain in his\nhead is still there.\n\nThe BONGING of a distant cathedral's bell makes him pause. He\nlooks around.\n\nToward the rear and sees a familiar old lady knitting a\nbaby's bootie. He looks again. The bootie is bright red and\ndripping... blood? Trevor follows the strand of bright red\nwool down to their source:\n\nA DYING GOAT laying under the seat. It's insides have been\nripped out. Its veins and tendons are serving as the old\nlady's yarn.\n\nTrevor's eyes bolt back up to the old woman. She continues\nHUMMING sweetly, her lap speckled with goat's blood. Trevor\npulls the wire and an OBNOXIOUS BUZZING goes off. Trevor\nhurries up to the bus driver as the bus pulls over.\n\n<b>                    TREVOR\n</b>          Just open the doors I'll jump off.\n\n<b>                    BUS DRIVER\n</b>          Not while the bus is moving, sir.\n\nTrevor clutches his head in pain and waits for the bus to\nstop. The doors open. He jumps off, knees nearly buckling\nfrom the pain. He looks up as the bus speeds off.\n\nIN THE REAR WINDOW the little black girl seen earlier pops\nup. She's holding her little doll. She pushes a clothespin\ninto its head. Blood drips from the puncture. At the same\ntime Trevor feels an incredible pain sear through his head.\nHe squints at the bus again. The little girl is gone.\n\n<b>INT. LANGE'S OFFICE - DAY\n</b>\nLange is at his desk eating a sandwich. Trevor comes in\nangrier than a hornet in a beehive.\n\n<b>                    TREVOR\n</b>          Where's my wife Detective Lange? What the\n          hell did you do with her?!\n\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                50.\n</b><b>CONTINUED:\n</b>\n\n<b>                       LANGE\n</b>             Mr. Gooding I assure you we are doing\n             everything within our-\n\n<b>                       TREVOR\n</b>             Why did you leave me that message?\n\n<b>                       LANGE\n</b>             I don't know what you're talking about.\n\nTrevor SLAMS his hand down on Lange's desk and gets right in\nhis face.\n\n<b>                       TREVOR\n</b><b>             LIAR!\n</b>\nTrevor immediately turns around and walks OUT.\n\n<b>INT. LARRY ELLIS' OFFICE - DAY\n</b>\nLARRY ELLIS is a somber but handsome young attorney. At\npresent he at his desk poring through several books on child\ncustody law. He makes notes on a pad beside him as he talks.\n\n<b>                       LARRY\n</b>                 (not looking up)\n             Basically they know where your wife's\n             body is and they're not telling you as a\n             tactic to get you to confess? Yet neither\n             of them has come out and told you that\n             you're a suspect. Is that what you're\n             trying to say?\n\nTrevor sits on the other side of the humongous office in a\nchair so big it practically swallows him whole.\n\n<b>                       TREVOR\n</b>             Look Larry I know you never thought too\n             much of me. And I know this all sounds a\n             little fucked up.\n\n<b>                       LARRY\n</b>             A little? Try unbelievably.\n\n<b>                       TREVOR\n</b>             I swear these guys are like playing\n             mindgames with me. I think they got a\n             hold of my e-mail address at work too.\n\nLarry is not buying this for a nanosecond. He trims some\nbrown leaves off a small plant as he speaks.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                51.\n</b><b>CONTINUED:\n</b>\n\n<b>                       LARRY\n</b>             Trevor barring the more outrageous\n             aspects of your claim you are not the\n             only widower the police have questioned\n             when foul play is suspected.\n\n<b>                       TREVOR\n</b>             Hey ninety five point three percent of\n             all murders are committed by either a\n             spouse, a direct relative or a close\n             friend that's common knowledge. But this\n             wasn't murder it was an accident-\n\n<b>                       LARRY\n</b>                 (concentrating on his notes)\n             And as far as hiding a body goes? I find\n             it hard to believe even the dirtiest of\n             cops would keep a victim's remains hidden\n             simply to get someone to confess. It's\n             absolutely preposterous. Now I'm not\n             saying I don't believe you,\n             I'm....ambiguous. There's quite alot of\n             money behind all this.\n\n<b>                       TREVOR\n</b>             How much do I stand to inherit if Kirsty\n             is presumed dead?\n\nLarry sighs and walks over to his desk. He presses a button\non his intercom.\n\n<b>                       LARRY\n</b>             Rosie can you bring in the Gooding\n             papers?\n\n<b>                       ASSISTANT'S VOICE\n</b>                 (from intercom)\n             Right away Mr. Ellis.\n\n<b>                       TREVOR\n</b>             Uh. Ballpark would be fine Larry.\n\n<b>                       LARRY\n</b>             In the vicinity of eight million four\n             hundred fifty thousand. Or is it sixty-\n\n<b>                       TREVOR\n</b>             What happens if I'm convicted of Kirsty's\n             murder?\n\n<b>                       LARRY\n</b>             Well they'd have to prove it in a court\n             of law for one thing-\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                          52.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    TREVOR\n</b>          Please Larry. Pretend you like me and\n          humor me.\n\n<b>                    LARRY\n</b>          Seeing you were her sole benefactor, and\n          I'm the executive of the will, Kirsty's\n          entire estate would have to be donated to\n          the city.\n\n<b>                    TREVOR\n</b>          Hello? City? Cops? It's a fucking\n          conspiracy!\n\n<b>                    LARRY\n</b>          Pardon my glibness Trevor but you sound\n          like a raving lunatic. The next time you\n          seek counsel it should be of the\n          psychiatric type. You're obviously on the\n          verge of some nervous collapse.\n\n<b>                    TREVOR\n</b>          Thanks for your concern Larry. And fuck\n          you too.\n\nTrevor gets up and heads for the door.\n\n<b>                    LARRY\n</b>              (to Trevor's back)\n          I never thought your late wife was the\n          sharpest knife in the drawer. But\n          marrying you was the dumbest thing she\n          ever did!\n\nOn his way out Trevor nearly runs down Larry's ASSISTANT who\nwas just coming IN with a large file. Trevor's gone.\n\n<b>INT. CAB - DAY\n</b>\nTrevor looks despondently out the window. The cab stops and\nTrevor hands some money to the CABBIE up front.\n\n<b>                    TREVOR\n</b>          You can go. I'm going to be here a while.\n\n<b>EXT. BRIDGE - DAY\n</b>\nTrevor gets out of the cab, which drives off leaving him on\nthe bridge looking down at the water below.\n<b>\n</b><b>                                                             53.\n</b>\n\n\n<b>EXT. BELOW BRIDGE - DAY\n</b>\nPolice tape FLAPS between the trees. Other than that there is\nno sign of an investigation. Trevor walks out of the woods on\nthe shore, through the police tape and to the water's edge.\n\nHe begins to walk the shore looking out at the still water.\nHe scans the area where the water meets the land, trying to\nremember.\n\nSomething on the surface few feet away catches his eye. It's\na rock sticking up. No it's something else. Trevor walks\nright up to the water and puts his feet on a couple of large\nrocks breaking the surface. He bends down and looks at...\n\nTHE CORNER OF A BLACK CUBE. He quickly reaches down, tries to\npick it up. It seems to be stuck just below the surface.\nTrevor pulls harder and finally it gives. Trevor slowly lifts\nthe black cube out of the water and GASPS when he sees-\n\n<b>-A WHITE WATERLOGGED HAND CLUTCHING IT FROM BELOW!\n</b>\nTrevor GASPS and lets go. And just as the cube (along with\nits owner) SPLASH under the surface-\n\n-ANOTHER WHITE HAND breaks the surface grabbing Trevor's\nwrist!\n\nAs Trevor Struggles he looks up to see the dark figure\nstanding above him holding a rock over his head. Just as he\nswings down towards Trevors head-\n\n                                                smash cut to:\n\n<b>INT. ALLISON'S OFFICE - DAY\n</b>\nTrevor jumps scaring the hell out of Allison who has just\ngotten done taking his pulse.\n\n<b>                    ALLISON\n</b>          Jesus I wish you would stop doing that.\n\nTrevor looks down at himself. He's on an examination table in\nhis normal clothes not a hospital johnnie. That's a good\nsign.\n\n<b>                       TREVOR\n</b>          Allison...\n\nTrevor tries to put his thoughts together.\n\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                              54.\n</b><b>CONTINUED:\n</b>\n\n<b>                       ALLISON\n</b>             Well Trevor? What have you got to say for\n             yourself? Que pasa?\n\n<b>                       TREVOR\n</b>                 (voice quivering)\n             Allison we have GOT to talk about this\n             medication you've got me on.\n\n<b>                       ALLISON\n</b>             I'm all over it.\n\nAllison shines a penlight in his eye.\n\n<b>                       ALLISON (CONT'D)\n</b>             Blink.\n\nTrevor blinks. Satisfied, Allison sits on the bed next to\nTrevor and takes his hand.\n\n<b>                       ALLISON (CONT'D)\n</b>             Okay. What we're going to do is up the\n             Topomax to two per day instead of one,\n             see if that takes care of these\n             hallucinatory seizures you've been\n             having. The extra Topomax won't interfere\n             with the painkillers either but... You're\n             going to be thrilled to hear this part\n             but we have been told by some patients it\n             affects the memory somewhat...\n\n<b>                       TREVOR\n</b>                 (weary)\n             Really? Does it affect the memory?\n\nAllison looks concerned. Then her features soften.\n\n<b>                       ALLISON\n</b>             You're one tough cookie, Trevor Gooding.\n             You keep coming back to your corner for a\n             quick fix up then go right back out into\n             the ring for another round.\n\n<b>                        TREVOR\n</b>             Some call it resilience. Others,\n             stupidity.\n\nAllison lets a lapse in the conversation last too long. That\nlook of concern returns as she lingers on his face. She's\ntrying to say something.\n\n<b>                       TREVOR (CONT'D)\n</b>             Everything okay Allison?\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                            55.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    ALLISON\n</b>              (surprised at her own emotional\n               outflow)\n          Of course, yes.\n\n<b>                    TREVOR\n</b>          The way you just looked at me...\n\n<b>                    ALLISON\n</b>          I know, my bedside manner's horrendous.\n\nAllison finishes writing a few notes, and Trevors rolls down\nhis sleves. He's intrigued.\n\n<b>                    TREVOR\n</b>          So, I'm done. Thats it for today?\n\n<b>                    ALLISON\n</b>          All finished.\n\nNeither of them want this visit to be over.\n\n                    TREVOR (cont'd)\n          How bout some lunch?\n\n<b>INT. CAFETERIA - DAY\n</b>\nThe two share the end of an empty cafeteria table, eating off\npastel colored trays.\n\n<b>                    TREVOR\n</b>          Think about it. In the entire world\n          where's the most life-threatening place\n          you could possibly be at any given\n          moment.\n\n<b>                    ALLISON\n</b>          I don't know... Beirut? New Orleans?\n\n<b>                    TREVOR\n</b>          Hint. It's not a geographical location.\n\n<b>                    ALLISON\n</b>          I'm stumped.\n\n<b>                    TREVOR\n</b>          It's inside a moving car.\n\n<b>                       ALLISON\n</b>          Bull...\n\n\n\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>                                                                56.\n</b><b>CONTINUED:\n</b>\n\n<b>                       TREVOR\n</b>             I've got numbers to back me up. Over the\n             course of one year more Americans die in\n             car accidents than did during the entire\n             span of World War II.\n\n<b>                       ALLISON\n</b>             Okay so... what's the safest place?\n\n<b>                       TREVOR\n</b>             Statistically speaking? Inside a moving\n             bus.\n\nAllison LAUGHS.\n\n<b>                       TREVOR (CONT'D)\n</b>             Millions of people around the world get\n             on busses every day. When was the last\n             time you heard of anybody anywhere dying\n             on a public transit bus?\n\n<b>                       ALLISON\n</b>             Okay Mr. Statistics I've got one for you.\n             What's the most common cause of death for\n             adults over the age of eighteen?\n\n<b>                       TREVOR\n</b>             Please. Heart attack. That was easy\n             street.\n\n<b>                       ALLISON\n</b>             Second most common?\n\n<b>                       TREVOR\n</b>             Skin cancer.\n\n<b>                       ALLISON\n</b>             Eighty third most common.\n\n<b>                       TREVOR\n</b>             Pitbull attacks.\n\n<b>                       ALLISON\n</b>             You just made that up.\n\n<b>                       TREVOR\n</b>             Like you're gonna check.\n\nThey both chuckle, Trevor's expression gets serious. After a\nmoment of silence.\n\n<b>                       ALLISON\n</b>             Where you two happy together?\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             57.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    TREVOR\n</b>          We startred off to be. She was, I guess I\n          was. I just sort of....butchered up the\n          relationship somehow. (to himself) Bad\n          choice of words.\n\n<b>                    ALLISON\n</b>          I understand, I think. Other women?\n\n<b>                    TREVOR\n</b>          Yeah. It's like I was a different guy\n          then I am today. I can't remember that\n          guy. I see these women, they think I'm\n          someone else, and I'm not that guy\n          anymore. I'm not sure who Kristy knew.\n\n<b>                    ALLISON\n</b>          You were unfaithful, it sounds like your\n          confessing.\n\n<b>                    TREVOR\n</b>          I did more then that.\n\nAllison reaches accross the table for Trevors hand. A quiet\nmoment.\n\n<b>                     ALLISON\n</b>          Com'on.   How bout some fresh air?\n\n<b>EXT. HOSPITAL ROOF - DAY\n</b>\nTrevor and Allison sit in a couple of chairs looking out at\nthe other rooftops around them.\n\n<b>                    TREVOR\n</b>          Lucky for us these chairs happened to be\n          here.\n\n<b>                    ALLISON\n</b>          Oh I knew about the chairs already. This\n          is where the emphysema patients come to\n          sneak cigarettes.\n\nShe points to the ground at myriad butts scattered at their\nfeet. Trevor smiles and looks at his hands.\n\n<b>                    ALLISON (CONT'D)\n</b>          Don't tell me. Kirsty used to smoke?\n\n<b>                     TREVOR\n</b>          No. She just would have loved it up\n          here... Allison when I was under... did I\n          ever talk?\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                               58.\n</b><b>CONTINUED:\n</b>\n\n<b>                       ALLISON\n</b>             Sure plenty of times.\n\n<b>                       TREVOR\n</b>             Was there anything I said that made you\n             stop and wonder, you know, \"where did\n             that come from?\"\n\n<b>                       ALLISON\n</b>             Sure plenty of times.\n\n<b>                       TREVOR\n</b>             Well?\n\n<b>                       ALLISON\n</b>             Trevor if someone is talking from a sleep\n             state they are obviously dreaming. So\n             practically everything say is going to\n             sound strange.\n\n<b>                       TREVOR\n</b>             Did I ever talk about the accident?\n\n<b>                       ALLISON\n</b>             No.\n\n<b>                       TREVOR\n</b>             Did I ever talk about Kirsty?\n\n<b>                       ALLISON\n</b>             No. But at one point you did repeat\n             something though. A phrase. You must have\n             been having this recurring dream, you\n             just kept saying this one thing over and\n             over\n\n<b>                       TREVOR\n</b>             What was it?\n\n<b>                       ALLISON\n</b>             You said, \"Jealousy arouses a husbands\n             fury, and he will show no mercy when he\n             takes revenge.\" (Proverbs 6:34) Does that\n             mean anything to you Trevor?\n\n<b>                       TREVOR\n</b>             It means I have alot more questions.\n\nTrevor stares off into the distance.\n\n<b>                       ALLISON\n</b>             Times up for today. I've got to get back.\n\n\n<b>                                                       (CONTINUED)\n</b><b>\n</b><b>                                                             59.\n</b><b>CONTINUED: (2)\n</b>\n\nAllison SMILES and pats Trevor's knee. He melts and puts his\nhand on hers. She slowly takes it away and fixes her hair.\n\n<b>                    TREVOR (CONT'D)\n</b>          Sorry.\n\n<b>                    ALLISON\n</b>          If it makes you feel better that took\n          every ounce of self control I had.\n          Trevor, I never date patients.\n\n<b>                    TREVOR\n</b>          I understand... I won't-\n\n<b>                    ALLISON\n</b>          No you don't understand. That's why I've\n          been fighting to get you better. So you\n          wouldn't be a patient anymore.\n\n<b>                    TREVOR\n</b>          Why didn't you tell me sooner? I would\n          have switched doctors!\n\n<b>                    ALLISON\n</b>          Just get better okay?\n\nShe caresses his face then looks at her watch.\n\n<b>                    ALLISON (CONT'D)\n</b>          I have to get back to work. And so do\n          you.\n\n<b>INT. OFFICE BUILDING - DAY\n</b>\nTrevor walks through the maze of cubicles a big smile on his\nface. He's actually having a good day.\n\n<b>INT. TREVOR'S CUBICLE - DAY\n</b>\nBret's already looking up at Trevor as he ENTERS.\n\n<b>                    TREVOR\n</b>          Don't say a word, Bret.\n\nTrevor's smile disappears when he sees someone's already\nsitting in his chair. LANGE. He's on Trevor's computer\nsurfing the internet.\n\n<b>                    BRET\n</b>              (to Lange)\n          Guess I'll leave you two alone.\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             60.\n</b><b>CONTINUED:\n</b>\n\n<b>                       LANGE\n</b>                 (concentrating on the computer)\n             Nice chatting with ya.\n\nBret gets up and LEAVES as Trevor approaches Lange.\n\n<b>                       LANGE (CONT'D)\n</b>             Sorry I'm in your seat aren't I?\n\n<b>                       TREVOR\n</b>             No please make yourself at home.\n\nTrevor sits in Bret's chair as Lange logs off and swivels to\nface Trevor.\n\n<b>                       LANGE\n</b>             How's everything, Mr. Gooding?\n\n<b>                       TREVOR\n</b>             Can't we dispense with the games for\n             once?\n\n<b>                       LANGE\n</b>             I thought you loved games.\n\n<b>                       TREVOR\n</b>             I'll just stay out of this conversation\n             until you come out and tell me why you've\n             disrupted me at work.\n\n<b>                       LANGE\n</b>             You and your wife were playing a game\n             shortly before you got into that car\n             accident weren't you?\n\n<b>                       TREVOR\n</b>             Where is she? Where is my wife?\n\nLange shakes his head and pulls something else out of his\npocket. It's The Cube sealed in a ziploc. Trevor cannot\nconceal a feeling of dread.\n\n<b>                       LANGE\n</b>             We found this curious little object not\n             too far from the site of the accident. No\n             prints but forensics scraped a little\n             dark residue that was caked on one of the\n             corners. It was blood Trevor. Matched\n             some blood we took off your car seat too.\n             Can you tell me anything about it?\n\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             61.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    TREVOR\n</b>              (to Lange)\n          It looks familiar. I think it was in the\n          car...\n\n<b>                    LANGE\n</b>          Gee you think so?\n\nLange puts the cube back in his pocket and stands up.\n\n<b>                    LANGE (CONT'D)\n</b>          Sorry to take up your time like that\n          Trevor. Don't work too hard. Oh, before I\n          forget. I talked your neighbor out of\n          pressing charges.\n\n<b>                    TREVOR\n</b>          What?\n\n<b>                    LANGE\n</b>          The whackjob in the black lipstick who\n          lives down the hall? She wanted you\n          arrested for harassment. I told her to\n          chill out and smoke a joint. I'd look the\n          other way as long as she did you know?\n\n<b>                    TREVOR\n</b>          Thanks.\n\n<b>                    LANGE\n</b>          We're all here for you Trevor.\n\nLange gets up and EXITS. Trevor satys seated, after a beat he\nstands up looking over his cubicle and sees DET. GIVENS\nstaring back at him from the door. Trevors sits back down.\nTrevor suddenly clutches his head as if it's been killing him\nthis whole time. He goes to his chair picks up the phone and\ndials.\n\n<b>                    RECORDING (V.O.)\n</b>              (from phone)\n          We're sorry the number you have has\n          either been disconnected or no longer in\n          service. If you feel you have reached\n          this recording in error-\n\nTrevor hangs up. We can almost hear his head throbbing in\npain.\n\nHe turns around and there's BRET LEANING AGAINST his desk\neating a frozen yogurt. Staring at Trevor.\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             62.\n</b><b>CONTINUED: (3)\n</b>\n\n<b>                    BRET\n</b>          Frogurt guy's here. They're all out\n          chocolate vanilla swirl or I'd have\n          gotten you one.\n\n<b>                    TREVOR\n</b>          I'm sure you would have.\n\nBret nods, tosses the frozen yogurt container out and sits\ndown.\n\n<b>                    BRET\n</b>          Hey if you're not doing anything I'd like\n          to buy you a beer after work. Be just\n          like old times.\n\n<b>                    TREVOR\n</b>          What's the occasion?\n\n<b>                    BRET\n</b>          I quit. Today's my last day.\n\nThis hits Trevor like a ton of bricks.\n\n<b>INT. PUB - DAY\n</b>\nThe place is practically empty. Bret and Trevor play darts\nand work on a pitcher of beer. Country Western plays on the\njukebox.\n\n<b>                    BRET\n</b>          I've got a better offer. More time off. A\n          sort of career shift, more in the\n          engineering line of work.\n\n<b>                    TREVOR\n</b>          How much time off?\n\n<b>                    BRET\n</b>          As much as he feels like. Its a much more\n          pleasurable line of work.\n\n<b>                    TREVOR\n</b>          As much as he likes?\n\n<b>                    BRET\n</b>          Yahtzee. Were all in this together Trev.\n          Trevor there are people who are doing\n          exactly what we're doing but they don't\n          need to wear a tie, punch a clock or have\n          some tight assed supervisor breathing\n          down their necks. Its all about the\n          pleasure Trevor!\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                              63.\n</b><b>CONTINUED:\n</b>\n\n<b>                       TREVOR\n</b>             So you're just packing it up just like\n             that?\n\n<b>                        BRET\n</b>             Almost that fast. I got a few loose ends\n             to tie up first. Came into a shitload of\n             money recently. I've always wanted to go\n             to take a trip. We're just gonna walk\n             into the airport and decide right then\n             and there.\n\n<b>                       TREVOR\n</b>             Yeah? You and who else?\n\n<b>                       BRET\n</b>             Someone special.\n\nBret throws a dart with extra mph. It misses the board\nentirely and hits the wall. Trevor winces in pain suddenly.\nHe touches his head and looks at his fingers. Fresh blood.\n\n<b>FLASHBACK\n</b>\nTrevor in the car in the water. Thrashing about, he bleeding\nfrom his head in the flashback as well. Where's Kristy? He\nlooks in the passenger seat. She's gone.\n\nTrevor takes the cube from the man with the ring. He fumbles\nwith the puzzle box in the darkness.\n\nCU box.   It starts to move.\n\nTrevor driving with Kristy, She's going down on him while\nhe's driving.\n\n\n<b>                      KIRSTY\n</b>             Okay pull over.\n\n<b>                       TREVOR\n</b>                 (looking at his watch)\n             But... I thought...\n\nTrevor waits a moment to see if she's kidding.\n\n<b>                       KIRSTY\n</b>                 (through clenched teeth)\n<b>             PULL OVER NOW.\n</b>\nThe car comes to a stop.\n\n\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                             64.\n</b><b>CONTINUED: (2)\n</b>\n\nTrevor gets the goods while he watches himself in the rear\nview mirror.\n\nSomeone approaches. Trevor zips up, pulls Kristy up out of\nhis lap. Its a cenobite.\n\nTrevor screams and opens the door of the car to make a\nfrantic exit. He dive out onto the pavement and looks back.\nAll is quiet. He's alone a quiet road.\n\nHe stands up and into an eerie world of slow motion . Trevor\nlooks up the road and back to find-\n\nA beautiful vision of Allison walking toward him. Walking\ngracefully, she approaches Trevor. Raises her hand to his\nface. Trevor smiles, then slowly looks back towards the car.\n\nInside the car he see's Kristy playing with the puzzle box.\nTrevors calls out to her.\n\n<b>                    TREVOR\n</b>          Kristy noooo!\n\nAnd he makes a move toward the car, as the box comes to life.\nThis stops Trevor in his tracks, and he looks toward Allison.\nWho is now PINHEAD.\n\n<b>                    PINHEAD\n</b>          There is no reprieve for you. Not even in\n          her. She's only a vision I'm afraid.\n\nTervors looks dumbfounded.\n\n                    PINHEAD (cont'd)\n\n           The truth hurts doesn't it?\n\n<b>END FLASHBACK\n</b>\n<b>INT. PUB - DAY\n</b>\nTrevor raises his head from the bar. The beers are there but\nBret is gone. Trevors stares at himself in the mirror\nopposite the bar. He looks like shit. He thinks hard about\nthe flashback.\n\nOut the door he goes.\n<b>\n</b><b>                                                            65.\n</b>\n\n\n<b>EXT. PAY PHONE - NIGHT\n</b>\n-Trevor's holding the phone up to his ear agitated beyond\nbelief. He'd pace if he could. Instead he just fumes.\n\n<b>                       TREVOR\n</b>                 (into phone)\n             Yes I'm trying to reach one of your\n             interns... Allison Dormere...? She works\n             in the emergency room there... What do\n             you mean...? I just saw her today... Yes\n             I'm sure she works there I've been in and\n             out of that place five times in the last\n             month...! Well good day to you too\n             asshole!\n\n-CLOSE UP on Trevor's hand searching through the D's in the\nwhite pages. He slams the book shut in frustration.\n\n-He's on the phone again.\n\n<b>                       TREVOR (CONT'D)\n</b>             No such listing...? Could you at least\n             tell me IF she has an unlisted number...?\n             What do you mean there are no Dormeres at\n             all there have to be...! WELL LOOK AGAIN!\n                 (a beat, more timidly)\n             H-hello?\n\nTrevor SLAMS the phone down and touches his head again. He\nlooks at his hand. The blood is gone. But the headache is\nback. Its crippling at this point. He's at his wits end. He\nreaches into his pocket and finds Pages card. Maybe as a last\nresort?\n\nTHE PHONE RINGS. IT RINGS AGAIN. Trevor presses his palm\nagainst his eye. Trevor picks up the phone.\n\n<b>                       TREVOR (CONT'D)\n</b>                 (into phone)\n             Hello?\n\n<b>                        WIMPERING VOICE\n</b>                 (from phone)\n             Goodbye...\n\n<b>                       TREVOR\n</b>             Kirsty?\n\n<b>                       WIMPERING VOICE\n</b>             You miserable sonofabitch!\n\n<b>DIAL TONE.\n</b><b>\n</b><b>                                                             66.\n</b>\n\n\n<b>EXT. SAGE'S BUILDING - NIGHT\n</b>\nTrevor is out of breath as he walks up to the last resort.\nThe entrance to Sage's building. The front door is locked. He\npresses a three digit code on the alarm box. RING. RING. The\nphone picks up. He's deperate.\n\n<b>                    SAGE'S VOICE\n</b>          Hello?\n\n<b>                    TREVOR\n</b>          Sage it's me Trevor. You've got to help\n          me.\n\n<b>INT. SAGE'S OFFICE - NIGHT\n</b>\nTrevor's head hits the pillow on the acupuncture table.\n\n<b>                    TREVOR\n</b>          The feeling is very distinct. It's like\n          somebody stuck a shard of glass through\n          my eye and it's embedded halfway into my\n          brain.\n\nSage nods, patient look on her face.\n\n<b>                    SAGE\n</b>          Trevor your body has been completely\n          healed. All the nerve endings have\n          repaired themselves. If there is any pain\n          in your head it's... in your head.\n\n<b>                    TREVOR\n</b>          Jeez it's getting awful crowded in there.\n\n<b>                    SAGE\n</b>          You are physically better. It's your soul\n          that still hurts.\n\nSage grabs a bunch of needles from the table.\n\n<b>                    SAGE (CONT'D)\n</b>          My teacher told me once there's a\n          puncture point on your body that can lock\n          your soul within it, even after you're\n          dead. So that when you die you're trapped\n          inside your body, watching it corrode for\n          all eternity.\n\n<b>                    TREVOR\n</b>          Look, whatever your Marharagi, told you,\n          forget. You've got to get this fuckin\n          pain to stop.\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                              67.\n</b><b>CONTINUED:\n</b>\n\n<b>                       SAGE\n</b>             It was an analogy. Your soul is locked up\n             inside you. You need to free it Trevor.\n             You've blocked it from the healing\n             process. That's what we need to do now.\n             Heal your soul. And to do that I you have\n             to give in utterly and without any\n             hesitation or doubt. Do you know what I\n             mean by giving in? It's about trust. Do\n             you trust me implicitly?\n\n<b>                       TREVOR\n</b>             I don't even know what's real and what\n             isn't how can I trust anyone?\n\n<b>                       SAGE\n</b>             You can trust me. Your wife is dead and\n             you need to move past that. And the only\n             way to move past something completely is\n             to go straight through it, not around it.\n             Surrender yourself to your wife's death.\n             Let it chew you up and spit you back out\n             on the other side. It's the only way you\n             can become whole again.\n\nSage looks Trevor dead in the eye.\n\n<b>                       SAGE (CONT'D)\n</b>             Are you ready?\n\n<b>                       TREVOR\n</b>             I surrender...\n\nTrevor closes his eyes\n\n<b>A MONTAGE\n</b>\nof Sage dimming the lights so that the room is nice and\ndark... placing needles into Trevor's body... his\nshoulders... his chest... his neck... his legs... his face...\n\nTrevor finally opens his eyes to find...\n\n... he's completely naked on Sage's table! And she's making\nlove to his body, which is now filled with needles!\n\n<b>                       TREVOR (CONT'D)\n</b>             Wait... what the hell is this...\n\n<b>                       SAGE\n</b>                 (whispering)\n             Surrender yourself... surrender\n             yourself...\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                             68.\n</b><b>CONTINUED: (2)\n</b>\n\nShe holds up a small chunk of ice and begins rubbing it on\nTrevor's chest. He catches his breath at the cold and begins\nto shiver.\n\n<b>INT. CAR - DAY\n</b>\nTrevor wakes up shivering. He is in the passenger seat, head\nresting against a baby blanket. A hand touches his...\n\n... Kirsty's.\n\n<b>                    TREVOR\n</b>          Kirsty... Kirsty?\n\n<b>                    KIRSTY\n</b>          It's okay it was just a nightmare that's\n          all.\n\nTrevor looks at Kirsty. She is breathtakingly beautiful.\n\n<b>                    TREVOR\n</b>          You're alive...\n\n<b>                    KIRSTY\n</b>          Yes. Now go back to sleep. You're driving\n          the rest of the way to gramma's remember?\n\nTrevor looks in the back and for the first time sees an\nINFANT GIRL sleeping in a car seat behind him.\n\n<b>                    KIRSTY (CONT'D)\n</b>          Trevor I've decided we have got to agree\n          on a name before we reach my mother's.\n          This poor kid's going to be starting\n          preschool as student x if we don't make\n          up our minds. So, I've been thinking,\n          what about Daisy?\n\n<b>                    TREVOR\n</b>              (looking at the baby)\n          It's perfect.\n\n<b>                    KIRSTY\n</b>          Well that was easy all of a sudden.\n\nTrevor looks back at Kirsty.\n\n<b>                    TREVOR\n</b>          Kirsty... I'm glad you're alive.\n\n<b>THE SIREN FROM AN APPROACHING AMBULANCE GETS LOUDER AND\n</b>LOUDER, piercing Trevor's ears.\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                               69.\n</b><b>CONTINUED:\n</b>\nTrevor winces in pain and blocks his ears from the noise.\nKirsty looks at him, puzzled. He can only read her lips:\n\"Honey what's wrong? Honey?\"\n\n<b>INT. AMBULANCE - NIGHT\n</b>\nTrevor's eye rivet open again. A PARAMEDIC is snapping his\nfingers in front of them. Another paramedic is readying a\nhypodermic.\n\n<b>                       PARAMEDIC\n</b>             Can you hear me? Just nod.\n\nTrevor nods.\n\n<b>                       PARAMEDIC (CONT'D)\n</b>             Do you know where you are?\n\n<b>                          TREVOR\n</b>             Ambulance.\n\n<b>                       PARAMEDIC\n</b>             We're just gonna take some blood here.\n\nThe other paramedic sticks a needle in Trevor's arm.\n\n<b>                       PARAMEDIC (CONT'D)\n</b>             You know what day it is?\n\nTrevor shakes his head. The paramedic holds up two fingers.\n\n<b>                       PARAMEDIC (CONT'D)\n</b>             Okay how many fingers am I holding up?\n\n<b>                          TREVOR\n</b>             Two.\n\n<b>                       PARAMEDIC\n</b>             Can you follow them?\n\nParamedic moves his hand left to right. Trevor keeps his eyes\non it.\n\n<b>                       PARAMEDIC (CONT'D)\n</b>             Perfect. Hey you remember what happened\n             back there?\n\n<b>                       TREVOR\n</b>             You mean... when the car went off the\n             bridge?\n\n<b>                       PARAMEDIC\n</b>                 (laughing)\n             Wow you are out of it.\n<b>                       (MORE)\n</b><b>                                                       (CONTINUED)\n</b><b>\n</b><b>                                                                70.\n</b><b>CONTINUED:\n</b>                       PARAMEDIC (cont'd)\n             No it was nothing that extreme. You were\n             riding on the bus and just collapsed onto\n             the floor. Out cold. Remember being on a\n             bus now?\n\n<b>                       TREVOR\n</b>             No... maybe... I don't know.\n\n<b>                       PARAMEDIC\n</b>             It's cool. Here we are.\n\nThe ambulance comes to a stop.\n\n<b>INT. EMERGENCY ROOM - NIGHT\n</b>\nA couple of orderlies wheel Trevor into the exact room he's\nbeen coming to this whole time. The orderlies EXIT and who\nshould ENTER but Dr. Ambrose... and the ANGULAR NURSE who\nreadied him for the brain surgery at the beginning.\n\n<b>                       DR. AMBROSE\n</b>             Hello I'm Dr...\n\n<b>                       TREVOR\n</b>             Ambrose. I know.\n\n<b>                       DR. AMBROSE\n</b>             Have we met?\n\n<b>                       TREVOR\n</b>             I've been in here before.\n\n<b>                       DR. AMBROSE\n</b>             Take no offense Trevor. I see many\n             patients a day and have an awful memory.\n\n<b>                       TREVOR\n</b>             Join the club.\n\nAmbrose holds a penlight up to each of Trevor's eyes and\nnods.\n\n<b>                       DR. AMBROSE (CONT'D)\n</b>             Right. Trevor you just had a seizure\n             brought on by a severe migraine. Things\n             could be much worse. In the next few days\n             you need to take plenty of aspirin, stay\n             out of the sun and make sure you've had\n             at least eight glasses of water by the\n             time you go to bed at night.\n\nTrevor just stares at Dr. Ambrose.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                            71.\n</b><b>CONTINUED:\n</b>\n\n<b>                       DR. AMBROSE (CONT'D)\n</b>             Why don't you relax for the next couple\n             of hours? Barring any relapses you should\n             be able to go home after that.\n\n<b>                       TREVOR\n</b>             Where's Allison?\n\nDr. Ambrose looks a little confused.\n\n<b>                       DR. AMBROSE\n</b>             Who's Allison?\n\n<b>                       TREVOR\n</b>             Allison Dormere. Your intern.\n\nAmbrose looks at the nurse, who shrugs, then back at Trevor.\n\n<b>                       DR. AMBROSE\n</b>             Uh we have no intern by that name here\n             Mr. Gooding. Listen I'll be back in a few\n             hours to check up on you meantime relax\n             try not to move around too much.\n\nAmbrose pats Trevor's shoulder congenially and WALKS OUT.\n\n<b>                       NURSE\n</b>             There there Trevor. Get some sleep.\n\nTrevor tenses when the nurse smiles.\n\n<b>                       NURSE (CONT'D)\n</b>             If you need anything give myself or any\n             of the nurses a call okay? We're-\n\n<b>                       TREVOR\n</b>             Don't tell me. ëWe're all here for you\n             Trevor' right? Go ahead say it! You know\n             you want to!\n\nThe nurse looks taken aback.\n\n<b>                       NURSE\n</b>             What the hell are you talking about...?\n\nTrevor suddenly jumps up yanking electrodes and IV tubes from\nhis body. The nurse is back to normal and very disconcerted.\n\n<b>                       NURSE (CONT'D)\n</b>             Trevor! Mr. Gooding lay back down-\n\nTrevor runs out of the woman mowing the woman down in his\ntracks.\n<b>\n</b><b>                                                             72.\n</b>\n\n\n<b>INT. HOSPITAL HALLWAYS - NIGHT\n</b>\nTrevor rushes down the halls of the hospital nearly knocking\ndown Dr. Ambrose.\n\n<b>                    DR. AMBROSE\n</b>          Hey!\n\nTrevor races as fast as his feet can carry him easily losing\nDr. Ambrose.\n\n<b>INT. OTHER WING - NIGHT\n</b>\nTrevor runs down a corridor through another doorway and into\nanother wing of the hospital entirely. He arrives at the door\nto Allison's office and throws it open. It's actually a\njanitor's closet.\n\n<b>EXT. HOSPITAL ROOF - NIGHT\n</b>\nDressed in janitorial garb, Trevor bursts open the stairwell\ndoor and comes out on the roof.\n\nAn OLD MAN in a johnnie is sitting in one of the chairs not\ntoo far away. An oxygen tube trails from his nose to an\noxygen tank at his feet.\n\n<b>                    OLD MAN\n</b>              (wheezing)\n          Okay ya caught me.\n\nHe brings a cigarette to his lips and takes a long drag.\n\n<b>                    OLD MAN (CONT'D)\n</b>          Least let me finish will ya? Got one puff\n          left.\n\n<b>                    TREVOR\n</b>          I don't work here.\n\n<b>                    OLD MAN\n</b>          Music to my ears.\n\nThe old man lights a fresh cigarette with the one he's just\nfinished.\n\nTrevor turns to go back and THERE'S ALLISON standing in the\ndoorway.\n\n<b>                    ALLISON\n</b>          Trevor. I heard you were looking for me.\n          Is everything all right?\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                            73.\n</b><b>CONTINUED:\n</b>\n\n<b>                       TREVOR\n</b>             Allison! Am I glad to see you!\n             (changing his tone) No... everything's\n             not right. Not at all.\n\n<b>                          ALLISON\n</b>             Come here.\n\nAllison holds him. The old smoker turns and watches with\ncuriosity.\n\n<b>                       TREVOR\n</b>             Allison I think I did some very, very bad\n             things. I mean very bad.\n\n<b>                       ALLISON\n</b>             Trevor things like this happen to people\n             who experience temporary memory loss.\n             Everybody does things they regret. You\n             just couldn't remember doing these things\n             and now you are so it's a shock to the\n             system. I'm telling you. You will never\n             get better if you keep blaming yourself\n             for your wife's death.\n\n<b>                       TREVOR\n</b>             Maybe I wasn't responsible for the car\n             accident...\n\nThe old man calls out to Trevor wheezily.\n\n<b>                          OLD MAN\n</b>             Hey buddy!\n\n<b>                       TREVOR\n</b>                 (ignoring him)\n             ... but I'm starting to think I was... I\n             was going to...\n\n<b>                          OLD MAN\n</b>             Hey buddy!\n\nTrevor turns to the old man.\n\n<b>                       TREVOR\n</b>             What do you want?!\n\n<b>                       OLD MAN\n</b>                 (wheezing)\n             Who the hell are you talking to?\n\nTrevor turns and Allison is gone. Vanished into thin air.\n<b>\n</b><b>                                                             74.\n</b>\n\n\n<b>INT. BUS - NIGHT\n</b>\nTrevor sits at the front of an empty bus rubbing his head. He\nstares at the spot where the creepy old lady knitting the\nbaby's bootie used to sit. He looks under the seat. There is\nnothing there.\n\nThe HYDRAULICS HISS as the bus comes to a stop.\n\n<b>                    BUS DRIVER\n</b>          This is it mister.\n\nTrevor gets up and hurries off giving the driver a cursory\nglance. The driver doesn't look at Trevor as he speaks.\n\n<b>                    BUS DRIVER (CONT'D)\n</b>          Have a good night now.\n\nTrevor EXITS the bus.\n\n<b>EXT. BUS STOP - NIGHT\n</b>\nTrevor steps out of the bus and faces the ROMAN CATHOLIC\nCATHEDRAL. He ascends the steps.\n\n<b>INT. CONFESSIONAL - NIGHT\n</b>\nTrevor sits in the booth across from the tiny screen, behind\nwhich is a VERY TIRED PRIEST who is still in his pajamas.\n\n<b>                    TREVOR\n</b>          I don't know what I'm doing here. I'm not\n          even Catholic. I just had to tell\n          somebody. It's like, ever since my wife\n          died I don't know what I've actually done\n          or what I've imagined. But I do know if\n          one tenth of what's happening to me is\n          reality... I've done some really awful\n          things in my life. Things that I've... I\n          guess I've blocked out...\n\n<b>                    PRIEST\n</b>          What things do you think you've done?\n\n<b>                    TREVOR\n</b>          Wow. Let's see. So many sins so little\n          time. For starters I was responsible for\n          the death my wife who by the way was\n          carrying my unborn child. That was so I\n          could collect her eight million dollar\n          estate. I think I killed several women I\n          was having mindless sex with behind her\n          back.\n<b>                    (MORE)\n</b><b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                75.\n</b><b>CONTINUED:\n</b>                       TREVOR (cont'd)\n             But I did those murders just for the hell\n             of it. Finally... I think I made some\n             kind of deal with the devil and now he's\n             come to collect my soul. Only he's\n             decided to mess with my head first. How\n             many Hail Marys do you recommend for that\n             one father?\n\n<b>                       PRIEST\n</b>             Trevor I'm sure you killed no one. You\n             are very distraught over your wife's\n             death and rightfully so. You did the\n             right thing by confessing to me here\n             tonight. And you should keep praying for\n             the wisdom that will set your soul at\n             ease. That being said, you are still in a\n             highly emotional state right now. It\n             might do you some good to get some\n             professional help. Confess to them the\n             way you confessed to me. In time you'll\n             probably find that the real killer has\n             already been caught. Or better yet...\n             that these murders never happened at all.\n\n<b>                       TREVOR\n</b>             But I saw these women. I saw their\n             mutilated bodies. I saw their ghosts. I\n             just know it happened I can feel it...\n\n<b>                       PRIEST\n</b>             All you've got is the here and the now\n             Trevor. That's all anyone really has.\n             Maybe this will make things easier to\n             understand. A man goes to sleep every\n             night and has recurring dream that he's a\n             butterfly. In time he begins to wonder if\n             he might actually be a butterfly who\n             dreams he's a man. And at the end of the\n             day does it even matter? All these events\n             you're describing. How can you be sure\n             any of them really happened?\n\n<b>                       TREVOR\n</b>             But that's what I need. To be sure... to\n             be absolutely sure...\n\n<b>                       PRIEST\n</b>             Shh. It's okay son. There is but one\n             truth. One thing you can be absolutely\n             sure of. And that thing is this:\n\nThe priest moves closer to the screen.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             76.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    PRIEST (CONT'D)\n</b><b>          WE'RE ALL HERE FOR YOU TREVOR.\n</b>\nThe Priest begins to chuckle ominously.\n\nResisting the urge to scream Trevor bolts out of the\nconfessional...\n\n<b>INT. CATHEDRAL - NIGHT\n</b>\nTrevor rushes out of the confessional. THE CATHEDRAL BELL\nbegins to CLANG. Eardrums getting battered by the RINGING\nTrevor blocks his ears and rushes toward the exit-\n\n-coming face to face with a gargoyle blocking his path.\nPINHEAD. Though he speaks softly his voice is heard easily\nover the bell.\n\n<b>                    PINHEAD\n</b>          Still in the dark I see?\n\n<b>                    TREVOR\n</b>          Who are you?\n\n<b>                    PINHEAD\n</b>          Poor Trevor.\n\n<b>                    TREVOR\n</b>          This game is over do you hear me?\n\n<b>                    PINHEAD\n</b>          I hear everything. And soon you will know\n          everything. More than you ever wanted I\n          can guarantee that. But I want you to\n          think for a minute first. Think about all\n          you've seen. All the clues you've been\n          given.\n\nPinhead opens his cloak revealing the darkness within. To\nTrevor's shock his sucked right into this void inside\nPinhead.\n\n<b>INT. CUBIC ROUTE ACTUARIAL RESEARCH, BULLPEN - NIGHT\n</b>\nTrevor is thrust into the interior of his office building.\nEveryone's gone for the day. The only light is coming in from\nstreetlights outside. Trevor races past the cubicles running\nout into a hallway.\n\nHe looks down one end then the other... where he sees an\noffice light is on. He cautiously approaches the office.\n\nHe looks inside.\n<b>\n</b><b>                                                             77.\n</b>\n\n\n<b>INT. GWEN'S OFFICE - DAY\n</b>\nGwen's hacked up body is strewn about the office. Her arms\nare atop the filing cabinet. Legs under her desk. Ass on the\ncopier.\n\nTrevor hears someone coming. He looks down the hall to see A\nFLASHLIGHT BEAM TURN THE CORNER, blinding him. It's bearer\nbegins running toward Trevor.\n\nTrevor bolts the other direction heading for the exit. He\npushes the door open and slams it behind him only he's not\nstill outside yet...\n\n<b>INT. TAWNY'S APARTMENT, BEDROOM - NIGHT\n</b>\nTawny lies on the bed, dead, tongue sticking out of her neck,\nribcage violated.\n\nTrevor hears someone coming toward the bedroom can see the\nflashlight beam jittering as its bearer approaches.\n\nTrevor rushes toward the window, opens it and leaps out onto\nthe fire escape.\n\n<b>EXT. APT. BUILDING - NIGHT\n</b>\nTrevor's about to climb down the fire escape when he is\nbathed in the flashlight's beam from inside. Trevor looks\ndown and sees a garbage dumpster full of trash bags below. He\njumps.\n\nTrevor sails down three stories and lands in the dumpster. He\nclimbs out and runs to the street as fast as he can. He races\ndown the sidewalk trying to get his bearings at the same\ntime.\n\nHearing footsteps from behind Trevor turns to see:\n\nThe Stranger in the Window not half a block behind Trevor,\nkeeping Trevor's pace. Then... Trevor stops. And turns.\n\nThe Stranger stops as well. This has never happened before.\nTrevor shouts down the empty street.\n\n<b>                    TREVOR (CONT'D)\n</b><b>          WHO ARE YOU!\n</b>\nHis voice echoes off the darkened buildings.\n\nThe Stranger stands there. Trevor begins walking toward him,\nblood in his eyes. The Stranger backs away.\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                78.\n</b><b>CONTINUED:\n</b>\n\nTrevor bolts into a run and the Stranger takes off running\nthe other way.\n\nThe stranger darts into an alley.\n\n<b>INT. ALLEY - NIGHT\n</b>\nTrevor runs into the alley, seeing no signs of the stranger.\nThe end of the alley is pitch black.\n\n<b>                       TREVOR\n</b><b>             WHERE'S MY WIFE?!\n</b>\nTrevor hears something at the end of the alley. He grabs a\nbroken bottle out of a garbage can and heads toward the\ndarkness. Trevor's teeth are bared now.\n\n<b>                       TREVOR (CONT'D)\n</b><b>             WHERE'S MY WIFE!?\n</b>\nSomething GLISTENS in the dark just before the razor sharp\nedge of a switchblade touches his left jugular. Trevor\nfreezes. OUT OF THE SHADOWS comes... BRET.\n\n<b>                       TREVOR (CONT'D)\n</b>             Bret... what the fuck...?\n\n<b>                       BRET\n</b>             Tonight was supposed to be the night,\n             Trevor. Remember? I couldn't believe you\n             went through five dart games and didn't\n             even joke about it.\n\n<b>                       TREVOR\n</b>             Bret. What the hell is going on?\n\n<b>                       BRET\n</b>             We were gonna be millionaires you said.\n             Nobody'd suspect a thing. I had never\n             even met her. No connection. Then you\n             went and had that fucking car accident.\n\n<b>                       TREVOR\n</b>             Bret you are making no sense whatsoever.\n\n<b>                       BRET\n</b>             I followed her Trevor. I got to know her\n             life. And what a boring one it was. Six\n             a.m. gym, nine a.m. trendy coffee shop,\n             noon bookstore, one soap operas, four\n             o'clock news, five wait for Trevor to\n             come home. And wait and wait and wait.\n             Nine o'clock get ready for bed.\n<b>                       (MORE)\n</b><b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             79.\n</b><b>CONTINUED:\n</b>                       BRET (cont'd)\n             Ten o'clock fall asleep in front of the\n             TV. She did that every day I followed\n             her. Every single day. While you were out\n             fucking your concubines. Every day I felt\n             more and more bad for her, man. And hated\n             you more and more.\n\nTrevor is absolutely speechless.\n\n<b>                       BRET (CONT'D)\n</b>             Then I find out you're having nooners\n             with my GWEN. That was all I could take.\n             I didn't want to kill your wife anymore.\n             I wanted to kill you. Even before that\n             little accident I decided to do it on the\n             day we'd set aside for her.\n\nBret presses the blade against Trevor's neck a little harder,\ndrawing a rivulet of blood.\n\n<b>                       BRET (CONT'D)\n</b>             But now that ain't gonna happen either. I\n             fell in love with Kirsty Trevor. The day\n             she died it was like my soul had been\n             ripped from my body. Not just because I\n             lost someone I loved. It's because the\n             child inside her... was mine.\n\nBret then puts the knife to his neck.\n\n<b>                       TREVOR\n</b>             No!\n\nBret drags the knife across his own jugulars slicing them\nopen. Blood pours out of his smiling mouth. Then something\nreally weird happens. Cuts begin to open up all over Bret's\nface and his hands. Blood pouring to the ground in buckets.\n\nBret lifelessly falls into the pool of blood... Before he can\nprocess what's just happened, Trevor hears a NOISE behind him\nand turns to see... several of those slithering sewer\nmonsters coming toward him, surrounding him.\n\nAnd behind them, SEVERAL SILHOUETTED FIGURES walking slowly\ntoward him. We don't need three guesses to figure out who\nthey are... CENOBITES.\n\nPanicking Trevor reaches down and grabs the knife out of\nBret's hand and readies himself for the inevitable attack\nwhen-\n\n-the BLINDING LIGHT FROM A POLICE car illuminates the alley.\nFirst Trevor notices the sewer monsters are gone.\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             80.\n</b><b>CONTINUED: (2)\n</b>\nThen the figures we thought were Cenobites are actually LANGE\nand several police officers. Lange looks disappointed.\n\n<b>                    LANGE\n</b>          Okay Trevor. Put the knife down.\n\nTrevor does so. TWO COPS rush up to Trevor and one swings his\nbaton down just over Trevor's eye- CRACK!\n\n<b>LIGHTS OUT.\n</b>\n<b>INT. POLICE CRUISER - NIGHT\n</b>\nTrevor's nose has been bleeding. His eye is black and blue\nhis lip cut. Trevor looks out the window. The streets are\ndeserted, foreign.\n\nTrevor looks at the rear view mirror. The cop staring back at\nhim averts his gaze. Trevor thinks he sees something crawl\ninto the cop's eye.\n\nLange sits next to the cop, staring back at Trevor. He takes\nout his antihistamine and sprays some up his nose.\n\n<b>INT. POLICE STATION LOBBY - NIGHT\n</b>\nThe doors burst open and the two cops, Lange escorts Trevor\n<b>IN.\n</b>\nThe lobby is entirely deserted. Trevor looks around. There\nare cups of coffee sitting on desks, jackets thrown over\nbacks of chairs. Signs of a recently bustling workplace that\nhas vacated.\n\n<b>INT. CHECK-IN - NIGHT\n</b>\nThe cops hustle Trevor up to a counter, finger print him, sit\nhim in a chair. One of them sits at a computer terminal.\nDespite being indoors both cops keep their sunglasses on.\n\n<b>                       COP#1\n</b>          Full name?\n\n<b>                    TREVOR\n</b>          Trevor Alan Gooding.\n\n<b>                       COP#1\n</b>          Age?\n\n<b>                     TREVOR\n</b>          Thirty one.\n              (beat)\n<b>                     (MORE)\n</b>\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                                81.\n</b><b>CONTINUED:\n</b>                       TREVOR (cont'd)\n             Don't you guys ever take your sunglasses\n             off?\n\n                                                   smaSH CUT TO:\n\n<b>INT. HALLWAY - NIGHT\n</b>\nThe cops hurry Trevor down a dank corridor toward a line up\nroom. Trevor sneaks a peek inside one of the rooms.\n\nINSIDE THE DOORWAY: TWO DETECTIVES have some HAPLESS SOUL\nstrapped to some odd looking electrical contraption.\n\n<b>                       HAPLESS SOUL\n</b>             I told you I don't know!\n\n<b>                       DETECTIVE#1\n</b>             Wrong answer!\n\nDetective#1 hits a button and a shock races through the\nHapless Soul's body. Just then the other detective notices\nTrevor looking in and SLAMS the door shut.\n\nThe trio comes to the line up room.\n\n<b>INT. LINE UP ANTEROOM - NIGHT\n</b>\nTrevor is shoved into the cramped booth-like room with four\nother strange looking MEN who all stare at him. Silence for a\nmoment then:\n\nA LOUD BUZZ is heard and the door on the other side of room\nopens.\n\n<b>                       COP#1\n</b>             Single file.\n\nTrevor follows the other men. The MAN just ahead of Trevor\nturns to him.\n\n<b>                       MAN\n</b>             We're all here for you Trevor.\n\n<b>                       COP#1\n</b><b>             NO TALKING!\n</b>\n<b>INT. LINE UP ROOM - NIGHT\n</b>\nTrevor walks IN with the rest of the gentlemen. Hugging the\nnearest wall they go up a small set of stairs onto a stage.\nTrevor hears Lange's VOICE overhead.\n\n<b>                       LANGE'S VOICE\n</b>             Stop and face the mirror!\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                82.\n</b><b>CONTINUED:\n</b>\n\nThe five men do as they're told, facing a large two-way\nmirror on the opposite wall. An awkward moment.\n\n<b>                          LANGE'S VOICE (CONT'D)\n</b>             Thank you!\n\nThe door to the room opens again and Trevor turns, leading\nthe other men back through the anteroom.\n\n<b>INT. HALLWAY - NIGHT\n</b>\nThe cops hustle Trevor out into the hallway. The next door\ndown opens and out come two more detectives and... TAWNY'S\nBOYFRIEND, the brute, looking fit to be tied. He sees Trevor\nand fills with rage.\n\n<b>                       BRUTE\n</b>             I hope they fry your ass mutherfucker!\n\nHe lunges at Trevor. It takes the detectives he's with and\ntwo more cops to keep him from pummeling Trevor. As Trevor's\nlead away the brute begins to sob uncontrollably.\n\n<b>                       BRUTE (CONT'D)\n</b>                 (to Trevor)\n<b>             YOU'RE GONNA BURN IN HELL!!\n</b>\n<b>                       COP#1\n</b>             Got quite a fan club don't you, hotshot?\n\n<b>INT. INTERROGATION ROOM - NIGHT\n</b>\nTrevor sits at a tape recorder. Lange sits across from him.\n\n<b>                       TREVOR\n</b>             For the last time. I honestly don't know\n             how any of them died...\n\nLange stands, squirting antihistamine in his nose. He nods at\nTrevor and WALKS OUT. No sooner has the door closed when it\nopens again and Givens walks IN. Givens gets right in\nTrevor's face.\n\n<b>                       GIVENS\n</b>             Now I want you to tell me what you\n             remember happening- in your own words-\n             exactly the way you told Detective Lange.\n             But this time I want you to make one\n             small adjustment.\n\n<b>                       TREVOR\n</b>             What's that?\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                83.\n</b><b>CONTINUED:\n</b>\n\nGivens whirls around revealing Lange's face on the back of\nhis head!\n\n<b>                       LANGE\n</b><b>             DON'T FUCKING LIE TO ME!\n</b>\nTrevor thinks a moment. He is absolutely numb. He smiles a\nlittle insanely.\n\n<b>                       TREVOR\n</b>             I did it. I killed them all. I confess.\n\n<b>INT. POLICE STATION HALLWAY - NIGHT\n</b>\nStill handcuffed Trevor is escorted toward the detention area\nby the cops in the sunglasses. He's silently praying he'll\nwake up from this one somehow. No such luck. Trevor and the\ncops round a corner and there's Lange running up to them.\n\n<b>                       LANGE\n</b>                 (to the cops)\n             Quick detour through the morgue boys.\n\nLange leads them to a set of elevators.\n\n<b>                          TREVOR\n</b>             Morgue...?\n\n<b>                       LANGE\n</b>             That's right Trevor. The timing was\n             impeccable wasn't it? It's been eight\n             months two weeks and three days but we\n             finally found the body. Just need you to\n             ID it for us.\n\n<b>                       TREVOR\n</b>             Where was it?\n\n<b>                       LANGE (CONT'D)\n</b>             That's the weird part. It just magically\n             turned up in the river less than thirty\n             yards from where the car had landed. Like\n             somebody put it there while we weren't\n             looking.\n\nThe elevator doors open and they get in.\n\n<b>INT. ELEVATOR - NIGHT\n</b>\nIt's a long ride down. Nobody speaks.\n\nTrevor looks at the cops in the sunglasses. One of them takes\nhis pair off. His eye sockets are empty. We can see brain.\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                84.\n</b><b>CONTINUED:\n</b>\nThe cop cleans his shades then his mouth smiles at Trevor\nbefore he puts the sunglasses back on.\n\nFinally the doors open. Lange unlocks Trevor's handcuffs and\nthe cops push him out the door into a dark corridor.\n\n<b>INT. DARK CORRIDOR - NIGHT\n</b>\nTrevor looks back to see Lange and the cops staring back at\nhim.\n\n<b>                       LANGE\n</b>             Just keep walking Trevor. You can't miss\n             it.\n\nOne of the cops waves bye-bye to him. And with that the\nelevator doors shut.\n\nTrevor turns around and faces the long corridor. He begins\nhis hike towards its end where an ominous set of double doors\nawaits.\n\nHe arrives at them and pushes them open.\n\n<b>INT. MORGUE - NIGHT\n</b>\nAs soon as the doors open fluorescent lights flicker overhead\nilluminating two walls of metal drawers and between them: a\nlarge slab of marble upon which rests a human form covered\nwith a sheet. Trevor ENTERS.\n\nHe makes his way toward the body and stares at it.\n\nA low WHEEZING noise coming from a dark corner just beyond\nthe slab distracts him. Trevor looks and freezes when he\nsees:\n\nTHE GOAT laying on the floor in a pool of blood. It's still\nbreathing. One of the goat's slatted eyes is staring at\nTrevor as if begging for mercy. A STRANGE RIPPING NOISE is\nheard. The goat MEWLS in pain then its eye rolls up. Dead.\n\nThe animal's body begins to quiver as a tiny wound on its\nback widens spitting out streams of blood.\n\nTrevor begins to back away as the wound stretches open,\ngiving birth to a rising form...\n\nPINHEAD. He rises completely from the goat, stepping out of\nthe wound. He is red with blood for a second. Then his skin\nand robe absorb the blood like a sponge. Pinhead approaches\nTrevor blocking him from the body on the slab.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                               85.\n</b><b>CONTINUED:\n</b>\n\n<b>                       PINHEAD\n</b>             How is our little student doing? Has he\n             learned his lesson yet?\n\n<b>                       TREVOR\n</b>             I don't know who you are or what you\n             want. I just want to know what's under\n             that sheet...\n\n<b>                       PINHEAD\n</b>             Use your mind for something other than\n             numbers dear Trevor. Think about people\n             for a change. People other than yourself.\n             Like the women you slept with behind your\n             wife's back. You were always so confident\n             you had covered your tracks. Always\n             confident your wife actually believed\n             your fervent denials? Part of you must\n             have known she would find out.\n\n                                                       flaSH BACK:\n\n<b>INT. GWEN'S OFFICE - NIGHT\n</b>\nGwen has Trevor on her desk riding him like a hobby horse.\nRain pounds against her window.\n\n<b>EXT. CUBIC ROUTE ACTUARIAL RESEARCH - NIGHT\n</b>\nKirsty sits inside the car looking up at the window, eyes\nnarrowing.\n\n<b>                       PINHEAD (O.S.)\n</b>             Jealousy arouses a spouse's fury.\n             And no mercy will be shown when that\n             revenge is given.\n\n<b>INT. TREVOR'S APT. - NIGHT\n</b>\nRubbing the baby that's growing inside her, Kirsty sits in\nfront of the TV watching Trevor having yet another romantic\nrendezvous with TAWNY.\n\nTHE TV SCREEN DISSOLVES to Trevor in bed with yet another\nwoman... and another... and another...\n\n<b>BACK TO:\n</b>\n<b>INT. MORGUE - NIGHT\n</b>\nThat fatal BELL begins to TOLL. With each peel the walls of\nthe morgue shakes. It's walls begin to rumble and crack.\n\n\n<b>                                                       (CONTINUED)\n</b><b>\n</b><b>                                                                86.\n</b><b>CONTINUED:\n</b>\n\n<b>                       PINHEAD\n</b>             Even a mind as narcissistic as yours\n             must have wondered: What unspeakable acts\n             was your wife committing behind YOUR\n             back?\n\n<b>EXT. WOODS - NIGHT\n</b>\nLOW ANGLE UP AT: Kirsty, Trevor's lovely wife, raising a rock\nabove her.\n\n<b>                       KIRSTY\n</b>                 (to camera)\n             Goodbye you miserable sonofabitch!\n\nAnd SLAMMING a rock down on us.\n\n                                                           bacK TO:\n\n<b>INT. MORGUE - NIGHT\n</b>\n<b>                       TREVOR\n</b>             What's under that sheet...?\n\n<b>                       PINHEAD\n</b>             You probably don't remember the night we\n             played. Your first year as husband and\n             wife.\n\n                                                        flASH BACK:\n\n<b>INT. TREVOR'S APT., BEDROOM - NIGHT\n</b>\nTrevor and a very pregnant Kirsty sit on their bed, passing\nthe cube back and forth. Trevor's the one with the magic\ntouch. The cube begins to open in his hands. Kirsty's eyes\nlight up as she watches...\n\n<b>                       PINHEAD (V.O.)\n</b>             It must have seemed like we were\n             uninvited guests crashing your little\n             celebration.\n\nON the walls as shadows begin to flail in pain and panic. OFF\nSCREEN SCREAMS are heard as blood begins to shower the walls\nof the bedroom.\n\n<b>                       PINHEAD (V.O.)\n</b>             But someone was expecting us Trevor. And\n             everything went according to plan.\n\n                                                           baCK TO:\n<b>\n</b><b>                                                          87.\n</b>\n\n\n<b>INT. MORGUE - NIGHT\n</b>\n<b>                    PINHEAD\n</b>          We were about to come for Kirsty. When we\n          were offered a deal. We don't usually\n          consider bargains but this one was too\n          good to pass up. A tribute to the\n          resourcefulness of a parent hellbent on\n          protecting its spawn. The deal we were\n          offered was this: three more souls in\n          exchange for the life of the unborn child\n          inside Kirsty. The three souls had\n          already been picked out. Needless to say\n          we were very impressed.\n\nThe lights dim. Drawers behind Pinhead begin to open. We see\nGwen's body, Tawny's, Sage's, Bonnie's.\n\n<b>                    PINHEAD (CONT'D)\n</b>          Two of your favorite companions, most\n          supple and delicious as you already know.\n          And the man you had at one time conspired\n          to kill Kirsty with. Until you found out\n          she was with child.\n\n                                                smASH CUT TO:\n\nQUICK IMAGES of Gwen, Tawny, and Bret being rent to pieces by\nthe Cenobites, SCREAMING in vain.\n\n<b>INT. MORGUE - NIGHT\n</b>\n<b>                    PINHEAD (CONT'D)\n</b>          They were all real screamers too. We had\n          a blast. And there was one more. You've\n          seen many things you wished you hadn't.\n          Many nightmares from which you never\n          awoke. They were all clues in our little\n          puzzle. Can you guess now Trevor? Can you\n          guess the fifth soul chosen for us to\n          torment in this little agreement?\n\nThe lights flicker overhead, reddening with each strobe.\nHundreds of those little sewer monsters come slithering out\nof the cracks in the walls, racing toward Trevor. He doesn't\ncare.\n\n<b>                    TREVOR\n</b><b>          WHAT'S UNDER THE SHEET?\n</b>\n\n\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>                                                              88.\n</b><b>CONTINUED:\n</b>\n\n<b>                       PINHEAD\n</b>                 (smiling)\n             Welcome to the worst nightmare of them\n             all, Trevor. Reality.\n\nPinhead grabs the sheet and whips it back.\n\nTrevor's jaw drops in disbelief.\n\nIT'S TREVOR'S BODY. It is blue, bloated and mutilated. The\ncorpse's skull has a massive crack in it.\n\n<b>                       TREVOR (CONT'D)\n</b>             No... no...\n\n                                                      flASH BACK:\n\n<b>INT. LANGE'S OFFICE - DAY\n</b>\nKirsty sits across from Lange, who slides the cube across the\ndesk towards her.\n\n<b>                       LANGE\n</b>             Open this and your problem will disappear\n             forever. And no one will ever suspect\n             you.\n\n<b>INT. CAR - DAY\n</b>\nKirsty drives. Trevor sits in the passenger seat, in the same\nposition we saw him in during his last flashback. Only now it\nis clear the reason his head is resting on the baby blanket\nis to keep his brains from spilling out his split open skull.\nON KIRSTY'S HAND holding his. It is now covered with blood.\n\n<b>                       KIRSTY\n</b>             Shhh it's okay.\n\n<b>EXT. BRIDGE - DAY\n</b>\nThe car goes off the bridge landing in the water. Kirsty's\nhead breaks the surface. She watches the car sink into the\nriver.\n\n                                                         baCK TO:\n\n<b>INT. MORGUE\n</b>\nTrevor stares at his own dead body in utter disbelief. The\nsewer monsters begin crawling up his legs. Pinhead smiles.\n\n<b>                       TREVOR (CONT'D)\n</b><b>             NOOO!!\n</b>\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                              89.\n</b><b>CONTINUED:\n</b>\n\nThe scream ECHOES over Trevor's dead self, which seems so\ntranquil in contrast. HOLD on the corpse. After a beat the\nbells stop, as does the rumbling and the cracking. The lights\nbrighten. Serenity. Then:\n\n<b>                       KIRSTY'S VOICE\n</b>             Yes. Yes that's him.\n\nREVERSE ANGLE on Kirsty looking down at the corpse wiping her\neyes. She looks over to the other side of the body where\nTrevor and Pinhead had been standing. Where now DETECTIVE\nLANGE and the coroner DR. AMBROSE had been standing.\n\nThe two gentlemen look at each other.\n\n<b>                       LANGE\n</b>             Well I guess that's it then. Thank you\n             Mrs. Gooding I realize that must have\n             been tough.\n\nLange escorts Kirsty to the door. They EXIT but not before\nKirsty gives her late husband a parting glance. Ambrose\ncovers Trevor's body and looks OFF CAMERA.\n\n<b>                       DR. AMBROSE\n</b>             Alrighty. Let's get started folks.\n\nREVERSE on two other DOCTORS who are busying themselves\ncollecting instrument. ALLISON and SAGE. They walk over to\nTrevor's body and get to work. Sage sticks a needle in\nTrevor's arm.\n\n<b>                       SAGE\n</b>             Collecting 40ccs of serum...\n\n<b>                       AMBROSE\n</b>             Examining cranial fracture...\n\nAllison at his side, Ambrose checks the wound on Trevor's\nhead, pauses to look inside Trevor's eyes.\n\nTREVOR'S POV: Ambrose closing the eyelid again.\n\n<b>                       AMBROSE (CONT'D)\n</b>             Checking oral cavity for blockage...\n\nAmbrose opens Trevor's mouth.\n\n<b>                       AMBROSE (CONT'D)\n</b>             And we have a winner...\n\nAmbrose pulls a long black dead lamprey out of Trevor's\nmouth. Looks at the slippery creature for a moment.\n\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>                                                             90.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    ALLISON\n</b>          Looks like an eel of some kind.\n\n<b>                    AMBROSE\n</b>          Guess it was murder after all.\n\n<b>                    SAGE\n</b>          Yeah all we need is the eel's motive.\n\nAllison holds out a large freezer bag, into which Ambrose\ndumps the dead lamprey.\n\n<b>                    ALLISON\n</b>          I still don't get it. He's been missing\n          for almost eight months. But this body\n          hasn't been dead more than twenty four\n          hours.\n\n<b>                    DR. AMBROSE\n</b>          Makes you wonder what he was up to\n          between the time he disappeared and when\n          he died.\n\nAllison walks right up to the corpse's face.\n\n<b>                    ALLISON\n</b>          Well? What do you say Trevor? Que pasa?\n\n<b>                    DR. AMBROSE\n</b>              (shivering)\n          Allison what on earth possesses you to\n          converse with cadavers?\n\n<b>                     SAGE\n</b>              (looking at Trevor's corpse)\n          It's simple, Dr. Ambrose. What if there\n          is no afterlife? What happens when we\n          die? Do we just stay stuck inside your\n          bodies for eternity watching ourselves\n          decompose?\n\n<b>                    AMBROSE\n</b>          I'm not following this...\n\n<b>                    ALLISON\n</b>          Well if that's the case... wouldn't you\n          want someone to talk to you like a normal\n          human being one last time?\n\n<b>                    AMBROSE\n</b>          You two are creeping me out. And I'm a\n          coroner.\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                             91.\n</b><b>CONTINUED: (3)\n</b>\n\nAllison fixes a stray lock of hair on Trevor's forehead.\n\nQUICK CUTS: Allison slipping a tag on Trevor's toe; sliding\nTrevor's body into the morgue drawer; her hand turning the\nlock on the drawer.\n\n<b>                    ALLISON (O.S.)\n</b>          Adios amigo.\n\n<b>INT. LANGE'S OFFICE - DAY\n</b>\nLange sits across from Kirsty, who signs some paperwork on\nLange's desk.\n\n<b>                    KIRSTY\n</b>          I would have come in sooner but I had an\n          important errand to run last night. Out\n          of town. Figures you'd find his body the\n          minute I decide to go off somewhere.\n\n<b>                    LANGE\n</b>          Well you made it down here that's the\n          important part. Thank you for your\n          patience Mrs. Gooding.\n\nShe nods teary eyed. She slides the paperwork across his desk\nand gets up to leave.\n\n<b>                    LANGE (CONT'D)\n</b>          One last thing... When they found him he\n          was holding something. Not to get too\n          graphic but they had to wrench it from\n          his hand.\n\nLange reaches under his desk then stands revealing:\n\nTHE CUBE inside a ziploc bag. Lange and Kirsty exchange a\nknowing glance.\n\n<b>                    LANGE (CONT'D)\n</b>          Figured you might want it.\n\n<b>                    KIRSTY\n</b>          Of course. That was my... last\n          anniversary present to him.\n\n<b>                    LANGE\n</b>          A token to remember him by now. Goodbye\n          Mrs. Gooding.\n\nShe takes the cube.\n\n\n\n<b>                                                     (CONTINUED)\n</b><b>\n</b><b>                                                                92.\n</b><b>CONTINUED:\n</b>\n\n<b>                       KIRSTY\n</b>             Thank you detective.\n\nLange takes out his nasal sprayer as she walks OUT. She\ncloses the door behind her and Lange looks up at the closed\ndoor. He sticks the sprayer up his nose.\n\n<b>INT. POLICE STATION HALLWAY - DAY\n</b>\nKirsty walks toward the exit. On her way she passes a trash\ncan. She discretely tosses the cube into it and rubs her\nhands together.\n\n<b>EXT. POLICE STATION - DAY\n</b>\nThe birds are chirping. The sun is shining. Kirsty Gooding\nwalks out the door and takes a breath of fresh air. She skips\ndown the steps of the police station toward the street. She\nstops in the middle of the sidewalk looking both ways.\n\nA SHADOW COMES up behind her. It's the STRANGER Trevor had\nseen out his window. He grabs her shoulder startling Kirsty.\nShe turns to see LARRY ELLIS, shit-eating grin on his face.\nHe's holding an eight month old BABY. The one he was drawing.\n\n<b>                       LARRY\n</b>             Looking for someone, Kirsty?\n\n<b>                       KIRSTY\n</b>                 (taking the baby)\n             You bet I was.\n\nKirsty plants a multitude of smothering kisses on the\nlaughing child as A NANNY comes up behind Larry pushing a\nstroller. Kirsty gently places the baby in it.\n\n<b>                       KIRSTY (CONT'D)\n</b>                 (to Nanny)\n             Okay we're on our way. Remember her-\n\n<b>                       NANNY\n</b>             Lactose intolerance. I've stocked the\n             fridge with Lactaid.\n\n<b>                       KIRSTY\n</b>             See you in a couple of weeks. You've got\n             my cell number right?\n\nThe Nanny pushes the stroller away, nodding, waving good-bye.\nLarry smiles as he watches the baby go.\n\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                                93.\n</b><b>CONTINUED:\n</b>\n\n<b>                        LARRY\n</b>             Daisy is getting so big.\n                 (beat)\n             I still can't believe HE was her father.\n\nKirsty smiles to herself.\n\n<b>                       KIRSTY\n</b>             Counselor can we not mention HIM anymore.\n             Can we just start spending HIS money\n             instead.\n\nThey walk slowly toward the curb.\n\n<b>                       LARRY\n</b>             I've always wanted to go to Madagascar.\n\n<b>                       KIRSTY\n</b>             You mean the place with bats?\n\n<b>                       LARRY\n</b>             They're called flying lemurs.\n\n<b>                       KIRSTY\n</b>             Yeah that sounds like a real blast...\n\nThey put their arms around each other.\n\n                       KIRSTY (cont'd)\n             I've been thinking about it. This has to\n             have been the best eight months of my\n             life.\n\nLarry sees a cab and rushes out to hail it.\n\n<b>                       LARRY (CONT'D)\n</b><b>             TAXI!\n</b>\nSomething out the corner of her eye scares Kirsty. She turns\nto see Lange standing there.\n\n<b>                       LANGE\n</b>             You forgot something.\n\nLange holds up the cube she tossed out. Kirsty's expression\nfalls. But... how...?\n\n<b>                       KIRSTY\n</b>             Oh. Thank you.\n\nKirsty takes the cube.\n\n\n\n<b>                                                        (CONTINUED)\n</b><b>\n</b><b>                                                             94.\n</b><b>CONTINUED: (2)\n</b>\n\n<b>                    LANGE (CONT'D)\n</b>          No Mrs. Gooding.\n\nLange turns and Kirsty's shock there's Givens' face... on the\nback of Lange's head!\n\n<b>                       GIVENS\n</b>          Thank YOU.\n\nGivens smiles at her then walks away. She slowly walks toward\nthe cab where Larry has opened the door for her.\n\n<b>                    LARRY\n</b>          After you my dear.\n\n<b>INT. CAB - DAY\n</b>\nKirsty slides into the cab looking at the cube in despair.\nLarry slides in after her.\n\n<b>                    LARRY\n</b>              (to the cabbie)\n          Airport please.\n\nHe grabs Kirsty's knee. She just stares at the cube.\n\n                       LARRY (CONT'D) (cont'd)\n          What's up?\n\nLarry looks down at the cube. It has magically risen from her\npalms and begun to rearrange itself in that way we've come to\nknow and love so well.\n\nThe cabbie, looking back at the sight, slowly slides the\nwindow between the driver and passenger compartments shut.\n\n<b>                    KIRSTY\n</b>          Time, Larry. Time's up.\n\n<b>EXT. CAB - DAY\n</b>\nAs the cab drives off into traffic we see LIGHT FLICKER from\nwithin it. The cab passes a cathedral. Its BELL BEGINS TO\n<b>TOLL.\n</b>\n<b>BONG\n</b>\n<b>BONG\n</b>\n<b>BONG\n</b>\n<b>BONG\n</b>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Hellraiser-Hellseeker.jpg\"/>\n</td><td><h1>Hellraiser: Hellseeker</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Carl Dupre\" title=\"Scripts by Carl Dupre\">Carl Dupre</a>  <a href=\"/writer.php?w=Clive Barker\" title=\"Scripts by Clive Barker\">Clive Barker</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Hellraiser: Hellseeker Script.html#comments\" title=\"Hellraiser: Hellseeker comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:07:17.520122"}