{"title": "Henry Fool", "film_link": "/Movie Scripts/Henry Fool Script.html", "script_link": "/scripts/Henry-Fool.html", "info_raw": "\n\nHenry Fool Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Hal Hartley\nGenres  Comedy  Drama\nMovie Release Date : June 1998\n\nRead \"Henry Fool\" Script\n\n\n", "script": "\n\n\n                                       HENRY FOOL\n\n\n\n                                       Written by\n\n                                       Hal Hartley\n\n\n\n                                     SHOOTING DRAFT\n\n                \n\n               EXT. JUNK YARD -- DAY\n\n               A garbage truck roars by and...\n\n               Simon Grim hangs from the back of it. He is a shy, skinny \n               and terrified-looking guy around thirty years old.\n\n               The truck rumbles to a halt and Simon climbs down off it to \n               go punch out at the time clock.\n\n               EXT. BEHIND THE WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               He comes walking up a small alley and sits to drink his beer.\n\n               He begins to relax. This is his quality private time.\n\n               Then he hears something and looks up.\n\n               He peeks up over the edge of some junked kitchen appliances \n               and sees...\n\n               Two teenage kids -- Warren and Amy -- smoking crack and having \n               sex.\n\n               Simon looks on, intrigued, as Warren smokes, then...\n\n                                     WARREN\n                              (to Amy)\n                         You want some?\n\n               Amy takes the pipe and smokes as he feels her up.\n\n               Simon is fascinated. He drinks and looks on as...\n\n               Amy grins up foolishly at Warren and lowers the pipe. The \n               boy undoes his belt and hikes up the girl's skirt.\n\n               Simon can't believe this. He looks around to see if the coast \n               is clear, then returns just in time to see...\n\n               Warren takes Amy by the waist and enter her.\n\n               The pipe falls from the young girl's hand.\n\n               Warren throws his head back and grinds himself into her.\n\n               Simon's mouth falls open in awe.\n\n               But Amy tosses her head back to the side and sees...\n\n               The amazed garbage man; caught.\n\n               Amy starts screaming insanely.\n\n               Simon runs for his life.\n\n               Amy and Warren throw rocks and bottles at him as they chase \n               him away.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Moments later.\n\n               Simon runs up and throws open the screen door. He stands \n               there in the doorway catching his breath.\n\n               His sister, Fay, is at the kitchen table watching a small \n               portable TV while their mother, Mary, sits a few feet away \n               in the living-room watching another TV tuned to a different \n               channel.\n\n                                     FAY\n                              (to Simon)\n                         Where the hell have you been?\n                              (to Mary)\n                         Mom, come on and eat.\n\n                                     MARY\n                         I'm not hungry.\n\n                                     FAY\n                              (pissed)\n                         Then why'd I cook!\n\n               Mary is a manic-depressive, still in her bathrobe at six in \n               the evening.\n\n                                     MARY\n                         I don't know why you cooked! I don't \n                         know why you bother!\n\n               Fay holds her head in her hands and sighs. She glares at her \n               brother.\n\n                                     FAY\n                         Sit down and eat, Simon.\n\n               Simon sits at the table and Fay slams down before him a bowl \n               of some sort of gruel. He hesitates, then lifts his spoon. \n               Supper is horrible and he screws up his face in disgust. Fay \n               gives him a sideways glance and he leans back down over the \n               bowl and eats some more.\n\n               Pushing the bowl away gently, he reaches out for the container \n               of milk on the table and drinks straight from it.\n\n               He suddenly jumps back and spits out sour milk all over the \n               table. The container drops to the floor and thick globs of \n               cheese roll out.\n\n               He stands back against the fridge, holding his stomach \n               while...\n\n               Fay and Mary look on in disgust.\n\n               EXT. THE GRIM HOUSE -- DAY\n\n               Moments later.\n\n               Simon crosses the lawn and sits on the curb outside his house. \n               He stares at the ground before him as he holds his stomach \n               and spits, sickened.\n\n               He looks up, though, and sees...\n\n               A little seven-year-old girl -- Pearl age seven -- standing \n               there in the street watching him.\n\n               Simon tries to smile at her.\n\n               But she throws a rock at him and hits him in the head.\n\n               He falls forward, hurt, as the little girl runs away. Lowering \n               his hand, he sees he's bleeding. Desperate, lonely and ill, \n               he drags his bloodied fingers across the coarse pavement.\n\n               Fay slams out of the side door of the house in a tight-fitting \n               dress and stands on the lawn, applying lipstick.\n\n                                     FAY\n                         God, I wanna get fucked.\n\n               Fay snaps shut her compact, straightens her skirt and sighs.\n\n                                     FAY\n                         You OK?\n\n               Simon loses track of what he is hearing and relaxes. He looks \n               back at his sister.\n\n               Fay fluffs out her hair and walks off.\n\n                                     FAY\n                         See ya later.\n\n               Simon watches her go, but is still drawn to something he \n               seems to hear up the street in the other direction. He cocks \n               his head, sits perfectly still and listens.\n\n               He hears it now. We do, too. Footsteps. Big ones. Like a \n               giant somewhere in the distance. The neighborhood trembles.\n\n               Titles begin.\n\n               Simon tries to figure out where it's coming from; the sky, \n               the house, the highway at the end of his block... Finally, \n               he focuses on...\n\n               The blacktop right before him, smeared with his own blood.\n\n               Music starts.\n\n               He kneels out slowly into the street and stares at the \n               pavement. He stretches out his hand and places it flat on \n               the road. The pounding is louder now, becoming the beat of \n               the music over the scene.\n\n               Simon lowers his face to the pavement, closes his eyes and...\n\n               Puts his ear right down against the road. He hears...\n\n               The steady tread of somebody very much larger than life.\n\n               Kneeling forward, with his ear to the ground, Simon opens \n               his eyes and sees...\n\n               A man approaching. The music swells up full.\n\n               Simon lifts his head slowly from the road, looking off in \n               wonder at...\n\n               This stranger coming towards him; an oddly handsome freak \n               striding over the crest of the distant intersection with a \n               windswept mane, two over-stuffed suitcases and a crumpled \n               tie fluttering back over his broad but crooked shoulders.\n\n               Simon rises till he's kneeling up straight in the road.\n\n               Henry Fool finally reaches him and stops.\n\n               Titles finish.\n\n               Simon says nothing and watches as Henry looks off at the \n               house.\n\n               Satisfied, but wary, Henry Fool looks around the neighborhood \n               and then down at Simon.\n\n                                     HENRY\n                         Get up off your knees.\n\n               He tosses the suitcases down in front of Simon and walks off \n               towards his new home.\n\n               EXT. BACK OF THE GRIM HOUSE -- DAY\n\n               Henry comes around behind the house and finds the door to \n               his basement apartment. He approaches. Simon follows, carrying \n               the suitcases.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Moments later.\n\n               The door is wrenched open and Henry is hit square in the jaw \n               by a decade of dank airless gloom. He coughs.\n\n               Entering, he finds a few old wooden chairs littering the \n               main room. He inspects the old wood stove, then takes a chair \n               and smashes it. He tosses the wood in the stove.\n\n               Simon looks on, amazed. Henry lights a fire with unusually \n               quick results, then stands back and looks at Simon.\n\n                                     HENRY\n                         Where you gotta go to get a six-pack \n                         of beer around here?\n\n               INT. WORLD OF DONUTS -- DAY\n\n               This is a convenience store with a number of tables at which \n               to eat donuts.\n\n               Warren is shoplifting while Amy terrorizes Gnoc Deng, the \n               Vietnamese cashier, who stares out at them from behind the \n               safety of the counter.\n\n                                     AMY\n                         Say something.\n\n                                     WARREN\n                              (calling)\n                         She's mute.\n\n                                     AMY\n                         What?\n\n                                     WARREN\n                         She don't -- you know -- talk.\n\n               Amy looks back at Gnoc, snarls, then follows the cashier's \n               gaze to the door.\n\n               Simon enters. Clutching Henry's cash, he stops dead in his \n               tracks when he sees...\n\n               Warren and Amy.\n\n               He steps forward and approaches the beer cooler.\n\n               Warren and Amy hover around, just out of reach, like a couple \n               of vampires.\n\n               Dragging a six-pack out of the cooler, Simon crosses to the \n               counter. Warren and Amy hang back, silent and threatening.\n\n               Gnoc rings up the purchase and glances over at...\n\n               Amy, staring a hole into the side of Simon's skull.\n\n               Gnoc hands Simon back his change and he makes for the door, \n               but...\n\n               Warren shoves himself between it and Simon.\n\n               Simon freezes. Warren is expressionless. Simon looks back at \n               Amy. She turns away, reaches up under her skirt, jerks down \n               her panties, then leans forward on to the counter. Leering \n               back over her shoulder, she hisses...\n\n                                     AMY\n                         Kiss my ass.\n\n               Simon is nonplussed.\n\n               Gnoc presses a button on the wall that sets...\n\n               A red light flashing above the stockroom door.\n\n               Warren grabs Simon by the neck and drags him over to Amy's \n               bare behind. Amy laughs as Simon is forced to his knees and \n               has his face shoved up right into the crack of her ass.\n\n               But then... Simon throws up all over her.\n\n               Warren falls back in disgust.\n\n               Gnoc covers her face with her hands.\n\n               Amy looks around at herself, realizes, and starts screaming \n               bloody murder.\n\n               Simon falls back on to the floor, clutching his stomach, as \n               Amy staggers around with her vomit-strewn underwear down \n               around her ankles.\n\n               Then Gnoc's father, Mr Deng, appears at the stockroom door \n               holding a shovel and ready to fight.\n\n                                     WARREN\n                              (scared)\n                         Oh, shit!\n\n               Mr Deng comes running at them and Warren drags Amy from the \n               store. Simon crawls out of the way as the old man throws \n               open the door to the parking lot and screams at the retreating \n               delinquents...\n\n                                     MR DENG\n                              (in Vietnamese)\n                         Stay the hell out of my store, you \n                         good-for-nothing punks!\n\n               Having scared them off, he comes back in and starts screaming \n               at Simon.\n\n                                     MR DENG\n                         Look at this! What's going on here? \n                         Simon, get up off the floor! Is this \n                         beer paid for?\n\n               INT. HENRY'S APARTMENT -- NIGHT\n\n               Later.\n\n               Simon splashes water over his face at the kitchen sink, then \n               watches as Henry unpacks one of his suitcases. It is filled \n               with dozens of old, worn notebooks. Henry stacks them on the \n               mantelpiece over the fireplace; the fire is now crackling \n               and bright.\n\n               Simon steps over and looks at...\n\n               The name tag on the other suitcase: 'Henry Fool'.\n\n                                     HENRY\n                              (off-screen)\n                         Centuries ago it had an 'e' at the \n                         end.\n\n               Simon looks over and sees...\n\n               Henry's silhouette against the fire. He steps forward into \n               the light and grabs a beer from the six-pack on the floor. \n               He hands one to Simon.\n\n               Simon takes it and stares at it a moment before raising his \n               eyes to Henry.\n\n                                     SIMON\n                         Where do you come from?\n\n                                     HENRY\n                         Nowhere in particular.\n\n               He winks at Simon, then struts around the room, hugely \n               impressed with himself.\n\n                                     HENRY\n                         I go where I will and I do what I \n                         must.\n                              (stops, drinks)\n                         That's why I'm in trouble. I'm sort've \n                         what you might call... 'in exile'.\n\n                                     SIMON\n                         Why are you in trouble?\n\n                                     HENRY\n                              (stopping)\n                         An honest man is always in trouble, \n                         Simon. Remember that.\n\n               Simon comes away from the fire, watching him carefully. Henry \n               stands in a dim corner across the room.\n\n                                     SIMON\n                         How do you know my name?\n\n               Henry pauses, looks aside, drinks, then grins demoniacally. \n               He steps forward and comes face to face with Simon. He lifts \n               his finger and points to...\n\n               Simon's name stitched upon the breast of his work shirt.\n\n               Realizing this, Simon moves off and thinks.\n\n               Henry throws more wood on the fire, glancing back over his \n               shoulder, laughing mischievously.\n\n                                     SIMON\n                              (stopping him)\n                         I am not retarded.\n\n                                     HENRY\n                              (pauses)\n                         Well... I'll take your word for that.\n\n                                     SIMON\n                              (explaining)\n                         People. I mean. They think. You know. \n                         Because.\n\n               He tries to articulate what he thinks he feels but winds up \n               gesticulating curiously with his hands. This finally dissolves \n               into a dumb stare into empty space.\n\n                                     HENRY\n                         I see.\n\n               Simon looks at him. Henry stands and grabs a notebook from \n               off the mantelpiece. He tears out a few pages and shoves \n               them in his pocket. He hands the now fresh writing tablet to \n               Simon.\n\n                                     HENRY\n                         Here. Take this. And...\n\n               He searches his pockets and finds a pencil.\n\n                                     HENRY\n                         ...this. Keep them with you at all \n                         times. You ever feel like you got \n                         something to say and you can't get \n                         it out, stop and write it down. OK?\n\n               Simon hesitates, then accepts the gifts. Henry goes for \n               another beer while his new friend studies the dozens of \n               notebooks on the mantelpiece.\n\n                                     SIMON\n                         What are these?\n\n                                     HENRY\n                              (proudly, returning)\n                         This? This is my life's work. My \n                         memoirs. My 'Confession'.\n\n                                     SIMON\n                              (carefully)\n                         What have you done?\n\n               Henry drinks and looks down into the raging fire.\n\n                                     HENRY\n                              (wistfully)\n                         I've been bad. Repeatedly.\n                              (shrugs and steps \n                              away)\n                         But why brag? The details of my \n                         exploits are only a pretext for a \n                         far more expansive consideration of \n                         general truths.\n                              (contemplating the \n                              notebooks)\n                         What is this? It's a philosophy. A \n                         poetics. A politics, if you will. A \n                         literature of protest. A novel of \n                         ideas. A pornographic magazine of \n                         truly comic-book proportions. It is, \n                         in the end, whatever the hell I want \n                         it to be. And when I'm through with \n                         it, it's gunna blow a hole this wide \n                         straight through the world's own \n                         idea of itself!\n\n               He smokes. Simon is impressed. They hear a bottle smash \n               outside in the street and Henry goes to the window. They're \n               throwing bottles at the house.\n\n                                     HENRY\n                              (throwing down his \n                              cigarette)\n                         Come on, let's go break their arms!\n\n               Simon jumps up.\n\n                                     SIMON\n                         No!\n\n               Henry stops. Simon looks away and sits back down.\n\n                                     SIMON\n                              (pauses)\n                         If I'm quiet.\n\n               He is ashamed of himself.\n\n               Henry sees this and settles down. He considers his new friend \n               with genuine care as he gets himself a new cigarette. He \n               lights up, thinks, then grabs another chair and sits close \n               by Simon. They sit there in silence a while, then...\n\n                                     HENRY\n                         Once. I forget where I was. Central \n                         America maybe. Somewhere hot. Stupid \n                         job. Bad pay. Dangerous location and \n                         water so foul the natives wouldn't \n                         even piss in it. This crowd of drunken \n                         motherfuckers hired by the local \n                         drug cartel shows up at my hotel \n                         room and threatens to tear me limb \n                         from limb. And I say, listen, hombres, \n                         OK, you've got me outnumbered four \n                         to one and you're gunna kill me here \n                         tonight and not a soul in this dimly \n                         lit world is ever gunna notice I'm \n                         gone. Fine. But one of you... one of \n                         you... one of you is gunna have his \n                         eye torn out. Period. Silence. I \n                         repeat myself. One of you poor, \n                         underpaid jerks is gunna have an eye \n                         ripped out of its socket. I promise. \n                         It's a small thing, perhaps, all \n                         things considered. But I will succeed. \n                         Because it's the only thing I have \n                         left to do in this world. So why \n                         don't you just take a good look at \n                         one another one last time and think \n                         it over for a few minutes more.\n                              (smokes, waits)\n                         They sober up a little, look at their \n                         shoes in confusion, then step out \n                         into the hall to talk among \n                         themselves.\n\n               Henry stares into the flames and falls silent. Simon is \n               riveted. He leans forward, on the edge of his seat...\n\n                                     SIMON\n                         What happened?\n\n                                     HENRY\n                              (winking)\n                         Well, here I am, still, after all.\n\n               INT. THE GRIM HOUSE. UPSTAIRS -- NIGHT\n\n               Later that night.\n\n               Simon climbs the stairs and stops when he hears raunchy sex \n               from his sister's room. He stands outside her door and \n               listens.\n\n                                     MARY\n                              (off)\n                         Did you throw up all over some girl?\n\n               Simon looks up the hall and sees his mother in her room, \n               sitting on the edge of her bed, smoking. He approaches and \n               stands in her doorway.\n\n                                     MARY\n                         They were throwing bottles at the \n                         house.\n\n               Simon says nothing. He looks down at his feet.\n\n                                     MARY\n                              (gesturing to Fay's \n                              room)\n                         She's got some ex-con in there she \n                         met at the bar. Tattoos all over \n                         himself and a big red bloated nose.\n\n                                     SIMON\n                         Did you take your pills?\n\n               Now she says nothing. She smokes and looks away.\n\n               Simon steps into the bathroom and gets her medication. He \n               runs a glass of water and brings it in to her.\n\n               She swallows the pills and washes them back with water.\n\n                                     SIMON\n                         You want me to tell her to be quiet?\n\n               She looks away, unconcerned and cynical.\n\n                                     MARY\n                         What's the use? She might as well \n                         get it while she can. She's not always \n                         gunna have the ass she has now, you \n                         know. That's just how life is.\n\n               She throws the blanket over herself and turns off the light. \n               Simon stands there in the dark.\n\n               INT. THE GRIM HOUSE KITCHEN -- NIGHT\n\n               Moments later.\n\n               Simon comes downstairs into the quiet, dark kitchen and sits \n               at the table. He listens to the traffic on the highway and \n               stares off into space. Finally, he takes the notebook Henry \n               gave him from his pocket and places it before him. But then \n               he just gazes off into the dim living-room and scratches his \n               head. Returning his attention to the notebook, he digs down \n               into his pocket and retrieves his short stub of pencil.\n\n               He opens the notebook and carefully flattens back the cover. \n               Lifting the pencil, he pauses and stares at the blank page. \n               Then, after more intense hesitation, he brings the pencil's \n               dull tip to the very top left edge of the page and begins \n               writing in a slow, laborious hand.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               The next morning.\n\n               Henry barges in the kitchen door with two containers of coffee \n               and some jelly donuts. Simon jumps up from where he sits \n               asleep over his notebook at the table.\n\n                                     HENRY\n                         Good morning, Simon! Glorious day, \n                         huh? Here, have a donut. Can you \n                         lend me twenty dollars?\n\n               Simon rubs the sleep from his eyes, blinks, disoriented and \n               reaches for his wallet.\n\n                                     HENRY\n                         Thanks. Where's the library in the \n                         scruffy little burgh?\n\n                                     SIMON\n                              (handing him cash)\n                         Down the highway about a mile and a \n                         half and then make a left.\n\n                                     HENRY\n                         Excellent! I'm polishing up the final \n                         chapters of my 'Confession' and I \n                         need a reasonably well-stocked \n                         reference section.\n\n               He lifts up Simon's notebook.\n\n                                     HENRY\n                         What's this?\n\n               Simon hesitates, shyly.\n\n                                     SIMON\n                         I thought. Um. I was. I wanted to. \n                         Maybe.\n\n               He gives up, sighs and gazes at the floor. Henry flips through \n               the book, impressed. It is full from cover to cover, every \n               page dense with Simon's cryptic scrawl. Henry frowns, \n               intrigued. Then...\n\n                                     HENRY\n                         Can I take this?\n\n               Simon looks up, terrified. But his friend puts him at ease.\n\n                                     HENRY\n                         I'll correct the spelling.\n\n               EXT. JUNK YARD -- DAY\n\n               Later that day.\n\n               Simon finds a number of volumes of the classics while crushing \n               garbage.\n\n               EXT. BEHIND WORLD OF DONUTS -- DAY\n\n               That evening.\n\n               Simon sits with his evening beer and his new collection of \n               soiled classics. He cracks open a volume of Shakespeare and \n               tries to read. It's an obvious struggle. He puts it aside \n               and lifts up Wordsworth, studying its cover and the texture \n               of the pages. A page flutters away and he climbs down to the \n               edge of a greasy puddle to retrieve it. It's now wet and \n               torn, so he flattens it out on the concrete and tries to fit \n               it back into the book.\n\n               He reads a little, furrowing his brow, then drinks. He bites \n               his lip and tries again.\n\n               He sits back, exhausted and thinks. He hears a twig snap and \n               looks back over his shoulder to see...\n\n               Amy throws a bottle at his head.\n\n               Smash!!!! He falls to the ground, blood streaming down his \n               neck.\n\n               Warren runs over and grabs him by the shirt, lifting him out \n               of the puddle and smacking him in the head.\n\n               Amy runs forward and waits with a rolled-up newspaper which \n               she sets aflame with her lighter.\n\n               Warren punches Simon in the stomach and throws him to the \n               ground, then unzips his fly and pisses on him.\n\n               Amy watches, giggling excitedly, waving the flaming torch.\n\n               Simon crawls away and grabs hold of an old section of fence, \n               while Warren zips up and grabs the fire from Amy.\n\n               Simon pulls himself to his knees, rests his face against the \n               rusted fence and gasps for breath. Warren waves the flaming \n               torch in his face.\n\n                                     SIMON\n                              (weakly, unheard)\n                         One of you is gunna lose an eye.\n\n               Amy comes nearer with a can of gasoline. Simon pulls himself \n               to his feet as she splashes him with fuel. Warren is waving \n               the torch deliriously above his head.\n\n                                     SIMON\n                              (screaming)\n                         One of you is gunna lose an eye!\n\n               Warren stops.\n\n               Amy steps back and lowers the gas can.\n\n               Simon turns with effort to face them, adjusts his glasses \n               and continues...\n\n                                     SIMON\n                         One of you. I promise.\n\n               Warren watches him blankly, then is burned by the torch which \n               is too hot to handle. He drops it.\n\n               Amy giggles, then stops, excited, but confused.\n\n               Simon grips the rusted chainlink so that it cuts into his \n               hands and stares straight at Warren.\n\n                                     SIMON\n                         You can set me on fire. But one of \n                         you is gunna have an eye torn out of \n                         your head. I promise.\n\n               Warren is transfixed. He shivers and looks at Amy, who steps \n               back, scared, and puts down the gas can. She turns and walks \n               away.\n\n               Warren looks back at Simon, troubled.\n\n               He hangs there still, glaring at him.\n\n               Further away, Warren rejoins Amy and stares at his hands. \n               Amy looks ill.\n\n                                     WARREN\n                         Fuck.\n\n                                     AMY\n                         Take me home.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Henry is at one of the tables, correcting the spelling in \n               Simon's notebook, when he looks up and sees...\n\n               Simon stumble in, beaten and bruised, dropping his classics \n               to the floor. Henry and Mr Deng rush over to him.\n\n                                     HENRY\n                              (scared)\n                         Simon! Who did this to you?\n\n                                     SIMON\n                         I was gunna tear out their eyes. I \n                         knew I could do it.\n\n                                     HENRY\n                         Whose eyes?\n\n                                     SIMON\n                         I told them. Like you said. I told \n                         them. And I knew I could do it.\n\n               He passes out. Henry looks at Mr Deng.\n\n                                     MR DENG\n                         You should take him home. He smells \n                         like a toilet.\n\n               Henry nods, agreeing, then lifts Simon off the floor. Mr \n               Deng holds the door open as Henry carries his friend out \n               into the parking lot.\n\n               Meanwhile, Gnoc gathers up the classics from the floor and \n               places them beside Simon's notebook, where it still sits \n               open on the table. She looks at it, then reads. She lifts it \n               off the table and reads further, immediately and deeply \n               engrossed.\n\n               Mr Deng watches as Henry departs with Simon, then comes back \n               into the store and stops, startled, when he sees...\n\n               Gnoc sitting there, staring off into space, the notebook \n               open in her hands before her, singing quietly.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Twenty minutes later.\n\n               Fay is in the bathroom helping Simon out of his clothes, \n               trying to clean his wounds.\n\n                                     FAY\n                              (calling)\n                         Shit, Mom, we gotta get him to a \n                         hospital!\n\n                                     SIMON\n                         No!\n\n                                     FAY\n                         Oh, shut up! Turn around.\n\n               Henry is at the kitchen table with Mary. She watches him \n               suspiciously. He lets her.\n\n                                     MARY\n                         This kinda thing has happened before.\n\n                                     HENRY\n                              (standing)\n                         It won't happen again.\n\n               She watches him as he walks around the room, browsing.\n\n                                     MARY\n                         How do you know?\n\n               He stops and lifts a small framed photo of a soldier off the \n               piano.\n\n                                     HENRY\n                         This your husband?\n\n               Violated somehow, she gets up and snatches it out of his \n               hands. She puts it in a drawer and cringes as Henry plays \n               one note on the piano.\n\n                                     MARY\n                         Stop that.\n\n               He fixes her with a steady, knowing stare which causes her \n               to gather the collar of her bathrobe up around her neck. She \n               steps back, exposed, when there's a knock at the door. They \n               look over to see...\n\n               Mr Deng enter with the notebook.\n\n                                     MR DENG\n                              (nods to Mary, then)\n                         Mr Fool, what is this?\n\n                                     HENRY\n                         It's poetry.\n\n                                     MR DENG\n                         Are you sure?\n\n               Henry comes over, takes the notebook from him and shoves it \n               in his pocket.\n\n                                     HENRY\n                         Of course I'm sure. I corrected the \n                         spelling myself.\n\n                                     MR DENG\n                         It made my daughter sing.\n\n                                     HENRY\n                         Yeah, well, you know -- that's what \n                         poetry does.\n\n                                     MR DENG\n                         But she has never spoken in her life.\n\n               Meanwhile, back in the bathroom...\n\n                                     SIMON\n                         Owww!!!\n\n                                     FAY\n                         Keep still!\n\n                                     SIMON\n                         Let me do it!\n\n                                     FAY\n                              (fed up)\n                         Fine! You do it, Simon! I don't care!\n\n               She storms out to the top of the stairs, cocks her hip and \n               whines...\n\n                                     FAY\n                         Mom! Simon's got a broken rib, his \n                         shoulder's dislocated or something, \n                         and he won't let me disinfect the \n                         gash in his head!\n\n                                     MARY\n                         Fay, just take him to the hospital, \n                         will ya!\n\n                                     FAY\n                              (stamping her foot)\n                         But he won't go!\n\n                                     MARY\n                              (screaming)\n                         Simon Grim, you go to the hospital \n                         with Fay right now, do hear me!\n\n               Simon reaches out and slams the bathroom door.\n\n               Fay looks from the bathroom door down the stairs to Mary. \n               Mary, her nerves rattled, glances over at Mr Deng, who turns \n               and leaves the house.\n\n               Henry lights a fresh cigarette, loosens his tie and heads \n               upstairs.\n\n               INT. THE GRIM HOUSE BATHROOM -- DAY\n\n               A moment later.\n\n               Henry throws open the door and enters. He steps over Simon, \n               who is on the floor, folded up against the toilet.\n\n                                     HENRY\n                         We gotta talk.\n\n               Henry sits on the edge of the bathtub and takes the notebook \n               from his pocket.\n\n                                     HENRY\n                         What the hell were you trying to do \n                         when you wrote this thing?\n\n               Simon just looks at him, not certain what he means.\n\n                                     SIMON\n                         Nothing.\n\n                                     HENRY\n                         Well, you know you wrote it in a \n                         kind of iambic pentameter.\n\n                                     SIMON\n                         Iambic what?\n\n                                     HENRY\n                         Verse.\n\n               He scratches his chin and smokes.\n\n                                     HENRY\n                         Look, in my opinion, this is pretty \n                         powerful stuff. Though your spelling \n                         is Neanderthal, and your reasoning a \n                         little naive, your instincts are \n                         profound. But the whole thing needs \n                         to be given a more cohesive shape. \n                         It can be expanded. Followed through. \n                         Unified.\n                              (smokes, then)\n                         You see what I'm getting at?\n\n               Simon just stares at him, overwhelmed. Henry drops the \n               notebook on the floor and points at it with his cigarette.\n\n                                     HENRY\n                         Are you willing to commit yourself \n                         to this? To really work on it? To \n                         give it its due? In the face of \n                         adversity and discouragement? To \n                         rise to the challenge you yourself \n                         have set?\n\n               Simon just blinks, looks away and wonders.\n\n                                     HENRY\n                         And don't gimme that wonderstruck \n                         'I'm-only-a-humble-garbage-man' \n                         bullshit, either.\n\n                                     SIMON\n                         It hurts to breathe.\n\n                                     HENRY\n                              (nodding)\n                         Of course it does.\n\n               Simon coughs and Henry leans back and smokes.\n\n               INT. THE GRIM HOUSE UPSTAIRS -- NIGHT\n\n               An hour later.\n\n               Fay cringes outside Simon's room as Henry goes about setting \n               her brother's arm.\n\n                                     SIMON\n                         Like this?\n\n                                     HENRY\n                         Yeah. No. OK?\n\n                                     SIMON\n                         Wait!\n\n                                     HENRY\n                         Don't move! Fuck. There.\n\n                                     SIMON\n                         Are you sure that's right?\n\n                                     HENRY\n                         Yes. Now shut up and lie back.\n\n               Simon does.\n\n                                     SIMON\n                         Is this gunna hurt?\n\n                                     HENRY\n                         Yes.\n\n               He pauses, then leans back.\n\n                                     HENRY\n                         You gunna be alright?\n\n               Simon nods and stares at the ceiling. Henry hands him a towel.\n\n                                     HENRY\n                         Here. Bite on this.\n\n                                     SIMON\n                              (spots blood on it)\n                         What's that?\n\n                                     HENRY\n                              (looking)\n                         It's blood. From your head. Lie back. \n                         Shove that in your mouth and hold on \n                         to something.\n\n               Simon bites down on the towel and grips the edge of the bed \n               with his free hand. Henry sits on his legs and gently raises \n               the broken arm.\n\n               Outside the door, Fay bites her knuckles. Further down the \n               hall, Mary listens from her bedroom.\n\n                                     HENRY\n                         Okay. You ready?\n\n               Simon nods. Henry grabs hold of the arm, swallows and braces \n               himself. Simon waits, then Henry tugs the arm straight.\n\n                                     SIMON\n                         Aaagghhh!!!!!!!\n\n               Fay turns and runs down the stairs. Mary backs away into her \n               room and shuts the door.\n\n               INT. THE GRIM HOUSE KITCHEN -- NIGHT\n\n               Later that night.\n\n               Henry comes downstairs and stops, tired. Fay is sitting at \n               the table with a bottle of gin and two glasses. She has dolled \n               herself up a little and Henry likes what he sees. He looks \n               her over and she smiles. He sits. She pours. They drink.\n\n                                     FAY\n                         So, do you have, like, you know, a \n                         girlfriend, Henry?\n\n                                     HENRY\n                         No.\n\n               They drink again in silence. He lights her cigarette and \n               they watch each other closely. Finally, Fay leans on the \n               table and twirls a strand of her hair between her fingers.\n\n                                     FAY\n                         Do you find me attractive?\n\n                                     HENRY\n                         Yes, I do.\n\n                                     FAY\n                         I look young for my age, don't I?\n\n                                     HENRY\n                         How old are you?\n\n                                     FAY\n                         How old do you think I am?\n\n                                     HENRY\n                         You look young.\n\n                                     FAY\n                              (playfully)\n                         How young?\n\n                                     HENRY\n                         I don't know. Young.\n\n                                     FAY\n                         But how... I mean, do I look more \n                         like twenty, or... you know, thirty?\n\n               He drinks and studies her. She presents her profile. Finally, \n               he leans back.\n\n                                     HENRY\n                         Thirty.\n\n               Fay jumps up, furious.\n\n                                     FAY\n                         Listen, you geek, after a couple of \n                         drinks plenty of people mistake me \n                         for eighteen!\n\n               She grabs her bag and storms out of the house. Henry watches \n               her go, then chuckles deviously and splashes himself another \n               drink.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Next morning.\n\n               A thirty-year-old cocktail waitress named Vicky walks up and \n               stops when she sees...\n\n               Warren, sitting back against the side of World of Donuts, \n               smoking a joint and thinking about his future.\n\n               She sighs and approaches.\n\n                                     VICKY\n                         Hey, Warren, are you a registered \n                         voter?\n\n                                     WARREN\n                         Bug off, Vicky!\n\n               Unruffled, she hands him a flyer.\n\n                                     WARREN\n                              (reading)\n                         'Saving America From Itself.' What \n                         the fuck is this?\n\n                                     VICKY\n                         It's everything you need to know \n                         about the upcoming elections and \n                         congressman Owen Feer and all the \n                         really good things he wants to do \n                         for our country.\n\n               He tokes deeply, then...\n\n                                     WARREN\n                         Oh yeah, like what?\n\n                                     VICKY\n                         He wants to win back this country \n                         for us Americans, Warren, and restore \n                         some kind of cultural-moral standard \n                         to our way of life.\n\n               Warren looks over the flyer, then reconsiders Vicky.\n\n                                     WARREN\n                         What time's your kid go off to school?\n\n                                     VICKY\n                              (carefully)\n                         Nine o'clock.\n\n                                     WARREN\n                         How about I come over and visit you \n                         later?\n\n               Vicky sighs, troubled. She adjusts her waitress uniform and \n               looks mildly offended.\n\n                                     VICKY\n                         Well, I don't know, Warren. I mean...\n\n               Warren gets up, too.\n\n                                     WARREN\n                         Come on. I mean it. I'm trying to \n                         change.\n\n               Vicky is hard-pressed. She wants to believe him, but knows \n               better. She thinks about it while...\n\n               Henry passes by and approaches the store.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Same time.\n\n               Henry enters and takes Simon's notebook from his pocket. He \n               flips through a few pages and selects one in particular.\n\n               He tears it out of the book and tapes it up beside the \n               register so customers can read it. He winks at Gnoc. She \n               smiles shyly and makes him a coffee. He takes it and moves \n               off to a table just as...\n\n               Vicky enters. She starts accumulating groceries, placing \n               them on the counter one item at a time.\n\n               Henry settles down and watches as...\n\n               Vicky returns to the counter with a bottle of orange juice \n               and notices the poem. She reads, holding the orange juice \n               out to her side.\n\n               Gnoc starts to ring up the other purchases as her father \n               comes up behind her, busying himself with an inventory of \n               the cigarettes.\n\n               Vicky's lip starts to tremble as she reads, a horrified \n               expression clouding her face. Finally...\n\n               Smash!!!! She drops the bottle of orange juice and stands \n               back. Mr Deng and Gnoc jump back, alarmed.\n\n               Henry tilts his head and pays close attention.\n\n                                     VICKY\n                              (screaming at Mr Deng)\n                         How dare you put something like this \n                         up where anyone can see it!\n\n               Mr Deng looks from her to the poem and then over at Henry. \n               Henry urges the man to stand up for himself.\n\n                                     MR DENG\n                              (to Vicky)\n                         It's poetry.\n\n                                     VICKY\n                         It's pornography! The product of a \n                         diseased mind! You oughta be ashamed \n                         of yourself, Mr Deng!\n\n                                     MR DENG\n                         It made Gnoc sing.\n\n                                     VICKY\n                              (pauses, confused)\n                         It's disgusting! There oughta be a \n                         law or something!\n\n               She grabs her things and leaves. Mr Deng holds his head and \n               looks over at Henry.\n\n                                     HENRY\n                              (winking)\n                         There's no accounting for taste, is \n                         there, Mr Deng?\n\n               Mr Deng has no idea. He sits, worried, as Gnoc comes out \n               from behind the counter and begins mopping up the mess.\n\n               INT. THE GRIM HOUSE KITCHEN - DAY\n\n               Later.\n\n               Henry is at the kitchen table with Simon, working on the \n               poem. Simon is bandaged up, his arm in a sling, black eyes, \n               etc.\n\n                                     HENRY\n                         See, Simon, there are three kinds of \n                         there. There's 'There'. T-H-E-R-E. \n                         There are the donuts. Then there's T-\n                         H-E-I-R; which is the possessive. It \n                         is their donut. Then, finally, there's \n                         'they're'. T-H-E-Y-'-R-E. A \n                         contraction, meaning they are. They're \n                         the donut people. Get it?\n\n                                     SIMON\n                         Uh-huh.\n\n               Henry lifts up one of Simon's newly acquired classics...\n\n                                     HENRY\n                         And look, if you're gunna read \n                         Wordsworth you've gotta get a more \n                         up-to-date edition. This odoriferous \n                         tome you're so attached to doesn't \n                         even have all fourteen books of the \n                         Prelude. And you need notes. \n                         Commentary. I'll go to the library \n                         and find you the best edition they \n                         have.\n\n                                     SIMON\n                         Thank you, but that's OK. I'll stop \n                         there on my way back from work. Well, \n                         yes, maybe not today, but, you know, \n                         tomorrow, probably.\n\n                                     HENRY\n                         Quit.\n\n                                     SIMON\n                         My job?\n\n                                     HENRY\n                         Yeah.\n\n                                     SIMON\n                         Why?\n\n                                     HENRY\n                         You need time to write, Simon. To \n                         study. To reflect.\n\n                                     SIMON\n                         But I like my job.\n\n                                     HENRY\n                         We all have to make sacrifices. A \n                         vocation like ours, Simon, is not a \n                         nine to five thing. You can't put a \n                         fence around a man's soul. We think \n                         and feel where and when we can think \n                         and feel. We are the servants of our \n                         muse and we toil where she commands.\n\n               Simon looks past him and Henry follows his gaze to find...\n\n               Mary standing at the foot of the stairs, listening to them. \n               She says nothing. She looks Henry up and down, then shakes \n               her head disdainfully and grunts. She throws herself on the \n               couch and turns on the TV, casting acid glances over at the \n               kitchen.\n\n               EXT. THE GRIM HOUSE - DAY\n\n               Moments later.\n\n               Henry and Simon come outside...\n\n                                     SIMON\n                         She's clinically depressed.\n\n                                     HENRY\n                         Yeah, and what's that mean?\n\n                                     SIMON\n                              (thinking, then)\n                         I guess it means it's not her fault.\n\n               Henry wanders out to the road, checking his wallet, then...\n\n                                     HENRY\n                              (sighing)\n                         You ever think of leaving?\n\n                                     SIMON\n                         Here?\n\n                                     HENRY\n                         Yeah.\n\n                                     SIMON\n                         To go where?\n\n                                     HENRY\n                         Out there. You know, into the world. \n                         Where ever.\n\n               Simon looks off, thinks it over and slowly nods.\n\n                                     SIMON\n                         Yeah, I guess.\n\n                                     HENRY\n                              (reciting)\n                         'Opportunity will step away and make \n                         room for a man to pass it by.'\n\n                                     SIMON\n                         Is that from your book?\n\n                                     HENRY\n                         No. I found it in a fortune cookie.\n\n               He pulls the tiny piece of crumpled advice out from one of \n               his pockets and shows it to Simon.\n\n                                     SIMON\n                         Can I read your confession?\n\n                                     HENRY\n                         No. Not yet. Soon. We'll see.\n\n                                     SIMON\n                         Is it almost finished?\n\n                                     HENRY\n                              (puffing himself up)\n                         Well, you know, Simon, a piece of \n                         work like this, it's... A vocation \n                         like ours... You can't put a fence \n                         around a man's soul. What I'm trying \n                         to achieve, it's... Well, it takes a \n                         lifetime really. It's a life's work.\n                              (looking around)\n                         But soon. Don't worry. I'd appreciate \n                         your feedback. I gotta go. See ya.\n\n               He hurries away around the corner. Simon walks back to the \n               house and stops when he sees...\n\n               A plain-clothes policeman, Officer Buñuel, drive up and park \n               before the house.\n\n               Simon spies as the man gets out of his car and knocks on \n               Henry's door. He, of course, gets no answer.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Later that day.\n\n               Simon works on his poem at the kitchen table while Fay flips \n               through a magazine and watches TV. Mary, lying on the couch \n               in her bathrobe, watches her own TV.\n\n               The cacophony is augmented by the rattling dishwasher and \n               the trucks rumbling by on the highway outside.\n\n               Mary looks over at her son, suspicious, and leans off the \n               couch.\n\n                                     MARY\n                         What are you doing there, Simon?\n\n               He carefully finishes writing a word, then looks up and \n               pauses.\n\n                                     SIMON\n                         I'm writing a poem.\n\n               Mary looks at Fay, who looks up from her magazine and \n               considers her brother. Then they break out laughing.\n\n               Simon looks on.\n\n               They laugh and laugh and laugh...\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Later.\n\n               Simon is bent over his notebook, consulting a dictionary, \n               hard at work.\n\n               Amy and three kids are grouped around the register, reading \n               the page Henry taped up earlier. As they read, Amy glances \n               anxiously back at Simon.\n\n               They finish reading and stand back.\n\n                                     PAT\n                         So what? It ain't so great.\n\n                                     CHRIS\n                              (to Amy, of Simon)\n                         That him?\n\n               Amy nods 'Yes', then leads them towards Simon.\n\n               Simon scribbles away.\n\n                                     AMY\n                              (off)\n                         Pardon me, Simon.\n\n               He looks up, sees her, panics and slides away on the seat. \n               Amy looks down and bites her lip, contrite. She sighs.\n\n                                     AMY\n                         Uhm. Look, ah... I'm the editor of \n                         the high school newspaper now and...\n\n                                     PAT\n                         One of the editors.\n\n                                     AMY\n                         One of the editors, and we...\n\n                                     PAT\n                         You.\n\n                                     AMY\n                         I... wanted to know if we could print \n                         your poem in this month's issue.\n\n               Simon looks around at them all, threatened.\n\n                                     SIMON\n                         Why?\n\n                                     AMY\n                         Because I think it's great.\n\n                                     PAT\n                         I don't.\n\n                                     CHRIS\n                              (to Pat)\n                         Who cares what you think?\n\n                                     TED\n                         You're a drag.\n\n                                     CHRIS\n                         A well-known drag.\n\n                                     AMY\n                              (to Simon)\n                         Please?\n\n               Simon fumbles with his pencil, ill at ease and self-conscious. \n               Then, to get rid of them, he nods his consent.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               That evening.\n\n               Fay comes downstairs in only a towel and wet hair. She \n               switches on the TV and looks for cigarettes. She finds Mary's \n               pills on the table and remembers to ask...\n\n                                     FAY\n                         Ma, you take your medication?\n\n               Mary is lying on the couch. She drags her eyes from the TV \n               and glances lazily at Fay, then back to the TV.\n\n                                     FAY\n                              (to herself)\n                         Guess so.\n\n               She sits at the kitchen table and lifts her magazine.\n\n               Henry shows up at the kitchen door with a pile of library \n               books. His eyes brighten when he sees...\n\n               Fay sitting there wearing only her towel. He knocks. She \n               looks back over her shoulder and sees him.\n\n                                     HENRY\n                         Evening, Fay.\n\n                                     FAY\n                              (disdainfully)\n                         What do you want?\n\n                                     HENRY\n                         I've got these books for Simon.\n\n               She turns away.\n\n                                     FAY\n                         Well, leave 'em there on the counter, \n                         then.\n\n               He comes in and stacks the books near the sink. Fay pretends \n               to ignore him, but rakes her fingers through her wet hair \n               anyway, to show more shoulder.\n\n               This is not lost on Henry, who tarries and leans back against \n               the counter, salivating.\n\n               Fay flips through her magazine and Henry steps closer and \n               leans against the fridge.\n\n               She casts a bored glance in his direction, then returns her \n               attention to the TV. She senses him step aside and follows \n               his movements without turning. Suddenly his hand appears \n               from behind her and gently strokes her hair. She freezes, \n               waits, wonders...\n\n               He leans his face down beside her. She looks at him. He looks \n               at her, then down to...\n\n               Her bare legs crossed before her on the kitchen chair. His \n               hand moves down and slides itself deep in between her things.\n\n               Her mouth drops open.\n\n               He looks back up at her. He grins.\n\n               Fay jumps up and away, breathlessly clutching the towel around \n               herself.\n\n               Henry casts a glance over her body, throws his hair back out \n               of his face and shivers with lust.\n\n               Fay steps back and grabs hold of the staircase banister, \n               making an unconvincing gesture of injured pride.\n\n               Henry comes closer and she steps backwards up the stairs.\n\n               He stops, loosens his tie, holding her with his gaze.\n\n               She readjusts her towel, throws back her wet hair, sighs \n               defiantly, then sashays into her room, leaving the door ajar.\n\n               Henry waits there at the foot of the stairs, reaches down, \n               grabs his crotch and repositions his hard-on. He takes a \n               step up the stairs, then stops. He looks over to the couch \n               and sees...\n\n               Mary, lying there, sedately amazed.\n\n               He pauses, then grins.\n\n               Mary blinks and smiles sleepily.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Same time.\n\n               Simon sits back from his writing and rubs his neck. Putting \n               down his pencil, he looks up and sees...\n\n               Warren enter the store and grab a beer from the cooler. Seeing \n               Simon, he waves and approaches.\n\n                                     WARREN\n                         Hey, Simon, you a registered voter?\n\n               Simon hesitates, but then nods uncertainly. Warren hands him \n               a flyer. This year when you go to the polls, I want you to \n               consider Congressman Owen Feer. He wants to restore America \n               to its position of unmatched wealth, power and opportunity; \n               to revitalize American civilization and lead the human race \n               to even greater levels of freedom, prosperity and security! \n               He's a good man.\n\n               He steps over to the register and pays for his beer. Mr Deng \n               glares at him, distrustfully. Warren stops on his way out \n               and snarls at the old man...\n\n                                     WARREN\n                         Immigrant.\n\n               He leaves. Simon looks down and studies the flyer.\n\n               INT. THE GRIM HOUSE. UPSTAIRS -- DAY\n\n               Same time.\n\n               Fay lies across her bed in her towel, holding a pose and \n               glancing anxiously back at the door. Finally, losing her \n               patience, she gets up.\n\n                                     FAY\n                         Where is he?\n\n               She opens the door and looks out into the hall.\n\n               He's not there.\n\n               She steps out into the hall and listens.\n\n                                     FAY\n                         Henry?\n\n               Nothing. She comes to the top of the stairs and hears faint \n               activity from down below. She proceeds downstairs.\n\n               She sees no one in the kitchen, then looks in the living-\n               room and stops. She goes white, her mouth falling open in \n               horror.\n\n               Henry and Mary are screwing one another on the couch. Sloppy, \n               impassioned, brute sex.\n\n                                     FAY\n                              (screaming)\n                         Mommy!!!!!\n\n               They fall away from each other in terror and fatigue. Mary \n               clutches wildly at her bathrobe as Henry falls over the coffee \n               table, stumbles to his feet and pulls up his trousers.\n\n               Fay is crushed. She breaks out in tears and runs upstairs.\n\n               Henry catches his breath and starts after her, but stops, \n               uncertain and confused.\n\n                                     MARY\n                         You bastard!\n\n                                     HENRY\n                         What?\n\n                                     MARY\n                         Get out!\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Simon is asleep with his head down on the table. He wakes \n               finally and sees...\n\n               Henry sitting across from him, gripping a beer and reading \n               the poem. He finishes, shuts the book and drinks.\n\n                                     HENRY\n                         Listen. I know a man. He's a big \n                         shot in the publishing business. \n                         Angus James. Smart, adventurous and \n                         tons of integrity. When this thing \n                         is ready, I'll recommend he reads \n                         it. He'll respect my opinion.\n\n               Simon takes this in, then looks down at his hands and proceeds \n               carefully.\n\n                                     SIMON\n                         A man was here today looking for \n                         you.\n\n                                     HENRY\n                              (alert)\n                         What man?\n\n                                     SIMON\n                         I don't know. He drove by the house \n                         a few times.\n\n               Henry throws his eyes heavenward and pulls his hair. Jumping \n               to his feet, he paces maniacally.\n\n                                     HENRY\n                         Why do they torment me like this? \n                         Why? They're like a bunch of fucking \n                         mosquitoes!\n\n               A customer a few tables away gets nervous and leaves.\n\n                                     SIMON\n                         What do they want from you?\n\n                                     HENRY\n                         They want to suffocate me, Simon! \n                         They wanna extinguish me like a flame!\n\n               Some kid named Tim, sitting at another table, turns around \n               and asks...\n\n                                     TIM\n                         But why?\n\n                                     HENRY\n                         They're afraid, that's why! They're \n                         afraid of what I might do! What I \n                         might say! Think! They're afraid of \n                         my ideas!\n\n               He drinks, then returns and sits beside Simon.\n\n                                     HENRY\n                         You and I are alike in this way, \n                         Simon.\n\n                                     SIMON\n                         Yeah?\n\n                                     HENRY\n                         We're outsiders. We think and feel \n                         too much and too deeply. And the \n                         world can't handle that. Our mere \n                         existence is a threat to its illusion \n                         of security. Sure, they'll name a \n                         wing of a new library after us when \n                         we're dead! But now... Now, when \n                         we're alive... Now, they wanna burn \n                         us at the stake!\n\n               He drinks, burps, then slams down the can. He glances over \n               at Tim who is still looking on.\n\n                                     HENRY\n                         Scram.\n\n               Tim hesitates, but then obeys. He gets up and leaves. Henry \n               returns to Simon.\n\n                                     HENRY\n                         For example, I made love to your \n                         mother about half an hour ago and \n                         now I'm beginning to think that maybe \n                         it wasn't such a good idea.\n\n               Simon blinks. Henry adds...\n\n                                     HENRY\n                         I mean to say, I think Fay may be \n                         jealous.\n\n               Simon is deeply confused. He looks ill. He stands and takes \n               a few steps away, staring at the floor.\n\n                                     SIMON\n                         I don't want to think about this.\n\n                                     HENRY\n                         Bad move, Simon.\n\n               Simon stops and looks at him.\n\n                                     HENRY\n                              (pointing at him)\n                         A poet has got to be able to think \n                         about anything.\n\n               Simon pauses, then comes closer to Henry and stops.\n\n                                     SIMON\n                         Am I really a poet?\n\n               Henry jumps up, strides around the store and speaks at the \n               top of his voice.\n\n                                     HENRY\n                         Of course you are! A great poet! But \n                         you need experience. You need to do \n                         something to be ashamed of every \n                         once in a while, for cryin' out loud.\n\n               He walks to the door.\n\n                                     HENRY\n                         Come on! Let's go out! There's a den \n                         of iniquity right across the street! \n                         You got any money?\n\n               He strides out of the store.\n\n               Simon stands there, stunned and looks at Mr Deng as the old \n               man wipes off the table with a wet rag.\n\n               INT. THE INFERNO -- NIGHT\n\n               Later that night.\n\n               Henry is dancing wildly on the bar with two sloppy-drunk \n               topless dancers. The place is rocking and the crowd cheers \n               them on.\n\n               Simon sits perched on a stool, gripping the bar with white \n               knuckles and clutching a beer, looking on in terror as...\n\n               Henry starts stripping.\n\n               INT. THE GRIM HOUSE -- NIGHT\n\n               Later that night.\n\n               Simon stumbles in and heads upstairs. But he stops, seeing...\n\n               Mary, sitting on the top step, smoking. She looks guilty and \n               tense. So does Simon.\n\n                                     MARY\n                         That man's a bad influence.\n\n                                     SIMON\n                         On who?\n\n               She gets up and storms into her room.\n\n               INT. FAY'S ROOM -- NIGHT\n\n               Moments later.\n\n               Simon comes upstairs and stops outside his bedroom door when \n               he sees...\n\n               Fay, passed out drunk on her bed. Her clothes are half off \n               and her lipstick smeared. She still grips a bottle of tequila \n               in her hand.\n\n               Simon hesitates, but then goes in and removes her shoes. He \n               gets her out of her jacket and rolls her into the bed.\n\n               Her bare limbs have their effect on Simon and he finds himself \n               staring at her thigh.\n\n               He reaches out and almost caresses her leg where her hiked-\n               up skirt reveals the bottom of her behind. He catches himself, \n               snaps his hand away and covers Fay with a blanket.\n\n               He flees.\n\n               INT. SIMON'S ROOM -- NIGHT\n\n               Moments later.\n\n               Simon is alone in the room with his bed.\n\n               The pale sheets beckon.\n\n               He is flushed. He blinks.\n\n               INT. THE GRIM HOUSE KITCHEN -- NIGHT\n\n               Moments later.\n\n               He creeps down the stairs with an arm-load of books. Sitting \n               at the table, he wrenches a nearby lamp into a more useful \n               position and begins to read.\n\n                                                               DISSOLVE TO:\n\n               INT. THE GRIM HOUSE -- DAY\n\n               The next morning.\n\n               Henry stumbles up the stoop carrying a laptop computer, its \n               various accessories and a couple of coffees.\n\n               He lets himself in and dumps the computer on the kitchen \n               counter.\n\n               Simon is asleep on the couch, still in his clothes.\n\n                                     HENRY\n                              (shoving him)\n                         Simon. Hey, Simon.\n                              (Simon wakes)\n                         Come on. I got ya some coffee.\n\n               Henry trudges back to the kitchen, where he whips out his \n               red pen and immediately begins to correct Simon's poem.\n\n               Simon rolls off the couch and makes his way to the table. \n               Seeing the computer...\n\n                                     SIMON\n                         What's this?\n\n                                     HENRY\n                         It's a computer. You write on it.\n\n               He reaches into his pocket.\n\n                                     HENRY\n                         Here's the manual.\n\n               Simon looks over the computer and flips through the manual.\n\n                                     SIMON\n                         Where'd you get it?\n\n                                     HENRY\n                         I stole it. Now listen. Remember how \n                         yesterday we discussed the relative \n                         desirability of cadence in relation \n                         to the readability of...\n\n                                     FAY\n                              (off)\n                         Oh, shit! Not you again!\n\n               Fay is on the stairs, hungover and disgusted. Henry throws \n               up his hands and gets up to go.\n\n                                     HENRY\n                         Simon, I can't work under these \n                         conditions.\n\n                                     FAY\n                         Yeah! Get outta here, you freak!\n\n                                     HENRY\n                         Get a life!\n\n                                     FAY\n                         Eat shit and die, Henry!\n\n               Mary throws open her bedroom door.\n\n                                     MARY\n                              (screaming)\n                         Beast! Fiend! Rapist!\n\n                                     FAY\n                         Oh, shut up, Mom!\n\n               Fay stomps back upstairs. Mary slams her door shut. Simon \n               runs out after Henry.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Simon follows Henry out into the street and over towards \n               World Of Donuts...\n\n                                     SIMON\n                         Henry, wait up!\n\n                                     HENRY\n                         I am not a rapist!\n\n               But Henry stops short, seeing...\n\n               Officer Buñuel enter World of Donuts.\n\n                                     HENRY\n                         Shit. Come on, this way.\n\n               And he runs down the street in the opposite direction. Simon \n               hangs back, but then follows...\n\n               INT. CHURCH -- DAY\n\n               Moments later.\n\n               They scramble in and Henry is out of breath. He slumps down \n               into a pew.\n\n                                     HENRY\n                         Keep a look out. Tell me when he's \n                         gone.\n\n               Simon does, but then...\n\n                                     SIMON\n                         Henry, what's going on? Who is that \n                         guy? What's he want?\n\n                                     HENRY\n                         He wants to help me! He wants to be \n                         my friend.\n\n               He pats his pockets, looking for his smokes. Simon looks on, \n               baffled. He comes closer.\n\n                                     SIMON\n                         Help you with what?\n\n                                     HENRY\n                              (suddenly)\n                         Shhh!\n\n               He hears something, stands and moves further into the church. \n               Simon hesitates, but then follows. They hear someone crying. \n               Finally, in a pew off to one side in the shadows, they find...\n\n               A young priest named Father Hawkes. He's a wreck. He looks \n               up from his quiet sobbing and sees...\n\n               Henry and Simon standing there looking on with embarrassed \n               distaste. He lowers his head in shame. Henry moves closer \n               and sits beside the distraught priest.\n\n                                     HENRY\n                         What's wrong?\n\n               The priest sighs hopelessly.\n\n                                     FATHER HAWKES\n                         I doubt.\n\n               Henry leans back with a sigh and reaches for his cigarettes.\n\n                                     HENRY\n                         So, you're an honest man. Why beat \n                         yourself up about it?\n\n               He offers a cigarette to the priest and he accepts.\n\n                                     FATHER HAWKES\n                         I don't know if there are grounds \n                         for faith. Is my vocation relevant? \n                         Does it make a difference?\n\n                                     SIMON\n                         A difference in what?\n\n                                     FATHER HAWKES\n                         The world. The way it is. Is this a \n                         way to help relieve suffering?\n\n                                     HENRY\n                         Your vocation makes a difference.\n\n                                     FATHER HAWKES\n                         How can you be so sure?\n\n                                     HENRY\n                         Because vocation is the difference. \n                         Only someone who really cares doubts. \n                         Listen, father, as I was about to \n                         tell my friend Simon here, I am, \n                         without doubt, the biggest sinner \n                         within a hundred miles of this parish. \n                         But still, I've gotta stay up late \n                         at night to outdo the unending parade \n                         of mundane little atrocities I see \n                         committed every day right out in the \n                         open spaces of this loud and sunlit \n                         culture we call home.\n\n                                     FATHER HAWKES\n                         You seem to me to be a sensitive and \n                         generous man.\n\n                                     HENRY\n                         I like to think so. But the fact is \n                         I appreciate depravity. Nevertheless, \n                         I insist your vocation makes a \n                         difference, because to hold out \n                         anything other than a spiritual \n                         yardstick to reality is to be jerking \n                         off grandly into the abyss. Listen, \n                         have you got any money? Let's go \n                         have a drink.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Warren is stopping people on their way in and out of World \n               of Donuts.\n\n                                     WARREN\n                         Excuse me, miss, are you a registered \n                         voter?\n\n                                     MISS\n                         Oh God, really I don't know.\n\n                                     WARREN\n                         Well, I'd like to give you some \n                         information about Congressman Owen \n                         Feer. This man is gunna make a big \n                         difference in the lives of every \n                         American in the years to come...\n\n                                     MISS\n                         Thanks, sure. I gotta go, thanks.\n\n               A man, Bill, steps up...\n\n                                     WARREN\n                         Pardon me, sir...\n\n                                     BILL\n                         Fuck off!\n\n                                     WARREN\n                         Right.\n\n               Warren stands back and loosens his tie. He looks over at \n               Pearl age seven, who is sitting outside the store.\n\n                                     WARREN\n                         What time's your mother get off work?\n\n               She doesn't respond. He shakes his head and approaches. He \n               sees Fay exit the store...\n\n                                     WARREN\n                         Fay, are you a registered voter?\n\n                                     FAY\n                              (stopping)\n                         Don't you dare talk that way to me! \n                         And keep your hands off my brother. \n                         Pearl, what are you doing here?\n\n                                     WARREN\n                         I'm watchin' her.\n\n               Fay figures it out and approaches.\n\n                                     FAY\n                         You and Vicky get back together?\n\n                                     WARREN\n                         I gotta regular job now and \n                         everything.\n\n               She lifts a flyer and reads.\n\n                                     FAY\n                         I saw this retard on TV this morning.\n\n                                     WARREN\n                         He's gunna be the next president of \n                         the United States of America, Fay.\n\n                                     FAY\n                         Keep dreamin' Warren. The guy's a \n                         Nazi.\n\n                                     WARREN\n                         I like him!\n\n                                     FAY\n                         Gimme a light.\n\n                                     WARREN\n                              (lighting her cigarette)\n                         He's a decent man. He takes \n                         complicated issues and totally \n                         simplifies them. And I appreciate \n                         that.\n\n                                     FAY\n                         You still sell dope?\n\n                                     WARREN\n                         No. You know what the problem is \n                         with this country, Fay? Me. I'm the \n                         problem. We live in a culture of \n                         poverty and crime, where the work \n                         ethic is undermined and male \n                         responsibility is made irrelevant.\n\n               She studies him a moment more, lost, then shakes her head \n               and helps the child off the car.\n\n                                     FAY\n                         Come on, Pearl, let's go play at my \n                         house.\n\n                                     WARREN\n                         She gives you any trouble, Fay, you \n                         just let me know.\n\n               INT. THE INFERNO -- DAY\n\n               An hour later.\n\n               Henry and Father Hawkes are drinking. Simon leans on the \n               bar, nodding off to sleep. After a while, Father Hawkes leans \n               back and...\n\n                                     FATHER HAWKES\n                         Do you think human beings are innately \n                         bad?\n\n                                     HENRY\n                         Worse than bad! Monstrous! But I \n                         love that about them.\n                              (banging on the bar)\n                         Wake up, Simon!\n\n               Simon falls off his bar stool.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Warren straightens his tie and looks over to see...\n\n               Simon stagger up.\n\n               Warren shakes his head in dismay and approaches. Simon \n               steadies himself against the wall of the building.\n\n                                     WARREN\n                         Jesus Christ, Simon, you're letting \n                         yourself go to hell! You read that \n                         flyer I gave you?\n\n                                     SIMON\n                         What?\n\n                                     WARREN\n                         Simon, wake up and smell the coffee, \n                         huh! It's up to guys like you and me \n                         to help create a better tomorrow!\n\n               Simon is lost.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               He staggers into World of Donuts and heads for the coffee \n               machine, but stops when he sees Buñuel talking to Mr Deng. \n               Buñuel looks over. Their eyes lock.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Same time.\n\n                                     WARREN\n                              (to Vicky)\n                         Why would I steal a computer from \n                         the campaign office?\n\n                                     VICKY\n                         I'm not saying you did, I'm just \n                         saying one was and since you do have \n                         this criminal background...\n\n               Whack!!! He slaps her...\n\n                                     WARREN\n                              (pointing)\n                         Don't judge me!\n\n               Simon runs out of the store and limps away towards home as \n               Buñuel storms out in pursuit. Simon tries to run, but Buñuel \n               catches him easily.\n\n                                     BUÑUEL\n                         Look, I know you know him. People \n                         have seen you around together.\n\n               Simon ceases to struggle, but shakes himself free and stands \n               looking down at his feet. Buñuel stands aside and watches \n               him a moment, then reaches in his jacket and brings out his \n               badge.\n\n                                     BUÑUEL\n                         I'm his parole officer.\n\n               Simon studies the badge and waits a little, before asking...\n\n                                     SIMON\n                         What did he do?\n\n                                     BUÑUEL\n                         I'm not supposed to talk about that \n                         stuff with people.\n\n                                     SIMON\n                         He's my. Friend.\n\n               Buñuel pauses, then puts away his badge and looks around the \n               parking lot.\n\n                                     BUÑUEL\n                         Mr Deng says you're some sort of a \n                         poet, or something.\n\n               Simon doesn't corroborate this. He looks away and readjusts \n               his sling. Buñuel scratches his head, satisfied and prepares \n               to leave. But first...\n\n                                     BUÑUEL\n                         You tell Henry to call me -- Officer \n                         Buñuel -- pronto! Or they're gunna \n                         chuck his ass straight back into \n                         jail! Got it?\n\n               Simon shrugs.\n\n               Buñuel waits a moment, then steps away and gets back in his \n               car. Simon watches as the parole officer drives away and \n               passes...\n\n                                     WARREN\n                         Vicky, look I'm sorry.\n\n                                     VICKY\n                         Don't you even come near me!\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Later.\n\n                                     FAY\n                         What do you mean, you quit?\n\n                                     SIMON\n                         I quit my job.\n\n                                     FAY\n                         Why!\n\n                                     SIMON\n                         There are things I want to do.\n\n                                     FAY\n                         Like what?\n\n               Simon thinks of trying to explain, but then decides not to.\n\n                                     SIMON\n                         'Opportunity will step out of the \n                         way to let a man... pass it by.'\n\n                                     FAY\n                         Are you drunk?\n\n                                     SIMON\n                         Now you have to go out and get a \n                         job!\n\n                                     FAY\n                         I am not gettin' a job!\n                              (paces, then)\n                         Who's gunna look after Mom!\n\n                                     SIMON\n                         I will.\n\n               Fay looks at the ceiling and sighs.\n\n                                     FAY\n                         Pearl, go outside.\n\n               They wait as the child goes outside.\n\n               Mary listens, unseen, from her bedroom door.\n\n               Fay comes over and frowns at her brother. She's about to \n               lecture him, but he cuts her off.\n\n                                     SIMON\n                         If you treat Mom like a sick person, \n                         she's gunna stay like... you know, a \n                         sick person.\n\n               Fay tries to control herself. She sighs tiredly and attempts \n               to reason with him...\n\n                                     FAY\n                         Simon, don't be retarded...\n\n                                     SIMON\n                              (banging the table)\n                         I am not retarded!\n\n               Fay steps back, startled. Simon stands, but can't decide \n               which way to go. He sits back down.\n\n                                     SIMON\n                         I can see with my own eyes.\n\n               Mary turns away from her door and sits on her bed.\n\n               Fay leans over the stove, where a large pot of water is \n               beginning to boil.\n\n                                     FAY\n                         Mom can't be left alone with no one \n                         to keep an eye on her.\n\n               Simon is frustrated and lashes out.\n\n                                     SIMON\n                         Well, who's been keeping an eye on \n                         her while you've been out getting \n                         fucked by every OTB winner in town?\n\n               Fay's mouth falls open and she staggers back, hurt.\n\n               Simon regrets it already and stands to leave, scared. But \n               Fay grabs the pot off the stove and hurls it at him, splashing \n               boiling water all over his back.\n\n                                     SIMON\n                         Aggghhhh!!!\n\n               Outside, Pearl turns and looks back at the house.\n\n               Simon lies gasping on the floor of the kitchen. Fay falls \n               back against the stove, terrified and drops her head into \n               her hands.\n\n               INT. THE GRIM HOUSE BATHROOM -- DAY\n\n               Later.\n\n               Fay is crouched on the floor, sobbing, while Simon lies in a \n               tub of cold water. Mary comes in with a pathetic little \n               freezer tray of ice cubes and dumps them into the tub.\n\n               She steps back into the hall and throws the ice tray down \n               the stairs. She glares back at Fay, who cries even louder as \n               Simon stares up at the ceiling.\n\n               Mary shakes her head and walks into her room, slamming the \n               door behind her.\n\n                                     FAY\n                              (sniffling)\n                         What happened to her, Simon? How did \n                         she get this way? Will it happen to \n                         me too? Huh? Why are we so fucked \n                         up?\n\n               Simon has no answers. But he reaches out and touches his \n               sister's hand.\n\n               INT. LIBRARY -- DAY\n\n               Evening.\n\n               Simon comes limping in, all stiff because of his scalded \n               back. He's not familiar with the library, so he stands looking \n               around, trying to figure it out.\n\n               INT. LIBRARY STACKS -- DAY\n\n               Moments later.\n\n               He wanders into an aisle, overwhelmed by all the books. Coming \n               to the far end of the aisle, he looks off to his left and \n               sees Henry sitting on a small stool, reading, with ten or \n               twenty open volumes scattered around him on the floor.\n\n                                     SIMON\n                              (approaching)\n                         Henry?\n\n                                     HENRY\n                              (looking up and rising)\n                         Simon! What are you doing here?\n\n                                     SIMON\n                         Henry... Your parole officer, Officer \n                         Buñuel, came by again today.\n\n               Henry sighs and sits back down.\n\n                                     SIMON\n                         He told me to tell you that if you \n                         don't call him they're gunna put you \n                         back in jail.\n\n                                     HENRY\n                         Simon...\n\n                                     SIMON\n                         He gave me this number...\n\n                                     HENRY\n                         Simon...\n\n                                     SIMON\n                         He was talking to Mr Deng too, and, \n                         well, you know, I was thinking...\n\n                                     HENRY\n                         Simon, just shut the fuck up!\n\n               Simon blinks and looks down at his feet, unable to respond. \n               Deeply hurt, he simply turns to walk away. But Henry reaches \n               out and grabs his arm. Simon stops, pauses and looks back at \n               his friend.\n\n                                     HENRY\n                         Forgive me.\n\n               He lets go and turns away on his stool.\n\n                                     HENRY\n                         Forgive me, Simon.\n\n               Simon comes back over to him.\n\n                                     SIMON\n                         Call him, Henry. Please.\n\n               Henry gives in slowly to the inevitable. He sighs deeply and \n               stands, handing Simon a book...\n\n                                     HENRY\n                         OK. Look, do me a favor. You got a \n                         library card?\n\n                                     SIMON\n                         Yeah.\n\n                                     HENRY\n                         Check this out for me.\n\n               Simon looks at the cover: Paradise Lost.\n\n                                     HENRY\n                         Milton. Seventeenth century. English. \n                         You see, Simon, it's important my \n                         'Confession' dig up the past, comb \n                         previous evidence and help chart the \n                         historic -- even the aesthetic -- \n                         inevitability of my ideas. And...\n\n               A young woman passes by, scanning the stacks. She and Henry \n               have a split second of eye contact, then she turns and moves \n               away. Henry straightens his tie and watches her go.\n\n                                     HENRY\n                         This place is crawling with chicks, \n                         Simon. Wander around. Leer a little. \n                         Cop a feel. Impose yourself on 'em. \n                         See what happens.\n\n                                     SIMON\n                         I make girls uncomfortable.\n\n                                     HENRY\n                         Bullshit! You've got a rough hewn \n                         charm that sets 'em on edge. Now, \n                         listen, I gotta go.\n\n                                     SIMON\n                         Henry?\n\n               Henry stops and turns. Simon pauses, then...\n\n                                     SIMON\n                         What did you do?\n\n               Henry watches him for a moment, then swaggers closer...\n\n                                     HENRY\n                         I got caught.\n\n               Simon waits for more but is disappointed. With one final \n               cracked grin at his friend, Henry throws back his shoulders, \n               slicks back his hair and strides off. Simon watches him go \n               and frowns, not comforted. He flips through the pages of \n               Paradise Lost.\n\n                                     SIMON\n                              (voice over)\n                         'Whereto with speedy words the arch-\n                         fiend replied Fallen Cherub, to be \n                         weak is miserable...'\n\n               INT. LIBRARY READING ROOM -- DAY\n\n               Moments later.\n\n               He comes out from the stacks, working his way through the \n               first page of Paradise Lost. He nearly bumps into a girl and \n               they stop and look at one another. He tries to hold her gaze \n               for a moment, challenging himself, but then turns away and \n               stalks to a table. He sits and leans over the page.\n\n               After a moment, though, he lifts his face and glances at...\n\n               Another girl, sitting further down the table. She looks up \n               from her reading and returns his gaze.\n\n               He smiles at her.\n\n               She gets up and leaves.\n\n               Simon frowns, confounded and returns to his book. He takes \n               out his notebook and pencil, meaning to take notes, but sees \n               instead...\n\n               A third girl sitting at another table, listening to her \n               Walkman and typing her homework into a laptop computer.\n\n               He finds himself staring at her and forces himself back to \n               his book. But he can't help himself and glances back over at \n               her.\n\n               With a sigh, he begins to write in his notebook...\n\n                                     SIMON\n                              (voice-over)\n                         Why is it this beautiful girl makes \n                         me sad? Does she know how beautiful \n                         she is? Do people tell her? Does she \n                         ever feel stupid?\n\n               He looks back over at her. She happens to look up and their \n               eyes meet. She smiles. Horrified, he looks down.\n\n                                     SIMON\n                         Why don't I smile when she looks at \n                         me? I look away. Ashamed of myself.\n\n               He watches her again, thinks, then writes...\n\n                                     SIMON\n                         Her figure makes me violent. I want \n                         to somehow break her. But tenderly. \n                         How is this possible? Ask Henry.\n\n               He writes a few moments more, scribbling across the page, \n               then stops and looks back over at the girl.\n\n                                     SIMON\n                              (voice-over)\n                         I can't breathe.\n\n               He tears out the page and folds it in half. Then he gets up \n               and crosses the room to where the girl is busily engaged in \n               her work. She looks up, sees him, and removes her headset \n               with a pleasant smile. He places his note on the table before \n               her, then turns and walks quickly away.\n\n               The girl watches him go, confused, then lifts the note and \n               reads...\n\n                                     SIMON\n                              (voice-over)\n                         Why do I do this to myself? And why \n                         do I reduce you to only one \n                         possibility? These are not even \n                         questions anymore. I know the answers \n                         myself. This isn't a page of notes. \n                         It's a letter. A letter to you. A \n                         desperate act. You are a miracle to \n                         me. I can't breathe.\n\n               By now, Simon is gone from the library. The girl finishes \n               reading the letter and looks around in astonishment.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Evening.\n\n               Henry enters and sits with Buñuel.\n\n                                     BUÑUEL\n                         How are you, Henry?\n\n                                     HENRY\n                              (frowning)\n                         Peachy. Gimme a light.\n\n                                     BUÑUEL\n                         Have you found a job?\n\n               Henry just glares at him and smokes.\n\n                                     BUÑUEL\n                         How 'bout those Alcoholics Anonymous \n                         meetings, did you go over and visit \n                         them yet?\n\n                                     HENRY\n                         What happened to this assistant \n                         librarian position you were supposed \n                         to set me up with?\n\n               Buñuel looks down, disappointed.\n\n                                     BUÑUEL\n                         I tried, Henry. I really did.\n\n                                     HENRY\n                         So what happened?\n\n                                     BUÑUEL\n                         Henry, with your background... Well, \n                         I mean, with your record, they didn't \n                         think it'd be right to have you at \n                         the neighborhood library.\n\n                                     HENRY\n                         Why not?\n\n                                     BUÑUEL\n                         They thought you'd be a bad influence \n                         on the kids.\n\n               Henry sits back, offended.\n\n                                     BUÑUEL\n                              (adds)\n                         Or worse.\n\n                                     HENRY\n                         So my word is not enough. My promise \n                         worthless. The fact I've served my \n                         time nothing but the emblem of my \n                         continuing guilt.\n\n                                     BUÑUEL\n                         Apparently.\n\n               Henry leans back and sighs, furious and indignant.\n\n               INT. THE GRIM HOUSE -- NIGHT\n\n               Simon comes in, excited and preoccupied, and finds Fay working \n               at the computer.\n\n                                     FAY\n                         What's up?\n\n                                     SIMON\n                              (guiltily)\n                         Nothing.\n\n                                     FAY\n                         I'm creating my résumé. This \n                         computer's got a program especially \n                         for it. I bought some special \n                         stationery too. It's scented. Look.\n\n               She shoves a sheath of papers up under his nose and he backs \n               away in disgust.\n\n                                     FAY\n                         It's roses.\n\n               Simon takes his notebooks from a cabinet above the fridge.\n\n                                     SIMON\n                         Can you type my poem into that thing?\n\n                                     FAY\n                              (shocked)\n                         That's your poem?\n\n                                     SIMON\n                         Yeah.\n\n                                     FAY\n                              (smokes, then)\n                         Simon, Mom's right about you. A poem's \n                         supposed to be a small, delicate \n                         kinda thing. Kinda feminine. Gentle. \n                         Look at this. You've made a fuckin' \n                         telephone book.\n\n               He places the notebooks on the table and leaves the house. \n               Fay clears the computer screen, pulls the notebooks closer \n               and gets down to work.\n\n               INT. HENRY'S APARTMENT -- NIGHT\n\n               Moments later.\n\n               Simon arrives with a six-pack and finds Henry sitting in \n               front of the fire, staring into the flames, brooding darkly.\n\n                                     HENRY\n                         I was caught. Yes, I was caught... \n                         once. I was caught in flagranti \n                         delicto screwing a thirteen-year-old \n                         girl named Susan. She was an ugly \n                         and mean-spirited kid, but she knew \n                         how to play upon my weaknesses which, \n                         I admit, are deep and many.\n\n               He drinks, then looks at Simon and adds...\n\n                                     HENRY\n                         You appear shocked.\n\n                                     SIMON\n                              (he is)\n                         Sorry.\n\n               Henry stands and leans over the fire.\n\n                                     HENRY\n                         It was a pathetic little conspiracy. \n                         A transparently desperate attempt to \n                         discredit me and my ideas; to label \n                         me a mere pedophile. As if I'd be \n                         ashamed of such a thing. As if \n                         Socrates himself hadn't been taken \n                         out of circulation for corrupting \n                         the youth of Athens!\n\n               He comes over and takes a beer. He strides around the room, \n               thinking, reflecting.\n\n                                     HENRY\n                         Seven years. Seven years for one \n                         afternoon of blissful transgression. \n                         But what of it? Who cares? Prison's \n                         not so bad; particularly if one's a \n                         sex offender, free from the popular \n                         and conventional horror of sodomy.\n\n               Stops, drinks declares...\n\n                                     HENRY\n                         They were not 'lost years'.\n\n               He approaches the notebooks lined up on the mantelpiece.\n\n                                     HENRY\n                         I put them to good use. I began my \n                         major work. My opus.\n\n               He glances over at Simon, who sits gripping his beer, \n               watching, rapt.\n\n                                     HENRY\n                         Believe me, Simon, this incident \n                         with the girl, prison... It pales to \n                         insignificance in the wider context \n                         of my career.\n\n               He pauses and swills back some beer. He brightens up, gets \n               excited...\n\n                                     HENRY\n                         Nothing in comparison to the day my \n                         'Confession' is unleashed.\n                              (beginning to pace)\n                         What an orgy we'll have then, huh? \n                         What shouts of outrage from the \n                         offended populace, from the \n                         sanctimonious purveyors of culture \n                         and quality, the righteous defenders \n                         of what ever inane and haphazard \n                         notion of progress then in vogue. \n                         They'll be beside themselves with \n                         fiercely reasoned critical analysis. \n                         Apoplectic with indignation!\n\n               Drinks sloppily, burps, wipes his mouth with his arm.\n\n                                     HENRY\n                         Their feelings will be hurt.\n\n               He smashes the bottle in the fireplace.\n\n                                     HENRY\n                         Yes, like a mirror which reflects \n                         only the inside of the person before \n                         it, my 'Confession' will lovingly \n                         render humanity's common monstrosity \n                         in all of its lurid wide screen glory.\n\n               He grabs a new beer and twists off its cap.\n\n                                     HENRY\n                         Why should I blush or feel shame \n                         before the common lot of humanity, \n                         anyway, for a few banal and, again I \n                         admit, inelegant transgressions?\n\n               He drinks, sighs and sits back down.\n\n                                     HENRY\n                         After all, really, I'm doing \n                         civilization a favor.\n\n               Simon sits back in awe. He waits a moment and thinks. Finally \n               he stands and approaches the 'Confession'. He reaches out \n               and drags his hand across the notebooks.\n\n                                     SIMON\n                         When can I read it?\n\n               Henry sits staring into the flames again. He pauses, then...\n\n                                     HENRY\n                         Soon.\n\n               INT. CHURCH -- DAY\n\n               Next day.\n\n               Simon and Father Hawkes are deep in conversation.\n\n                                     FATHER HAWKES\n                         We are told not to judge. But to \n                         forgive. Not to look into our \n                         neighbor's eye to find the bad, but \n                         to find the good.\n                              (pacing)\n                         Now this is difficult. I admit.\n                              (pause)\n                         But having a good friend is not always \n                         easy.\n\n               Simon listens and carefully considers all the priest says.\n\n                                     SIMON\n                         Yes, but... do you think Henry is... \n                         dangerous?\n\n               Father Hawkes pauses, then comes closer and sits.\n\n                                     FATHER HAWKES\n                         He needs help. Our help. Yours \n                         especially.\n\n                                     SIMON\n                         But what can I do?\n\n                                     FATHER HAWKES\n                         The best parts of himself come to \n                         the surface when he's helping someone \n                         learn. I've seen this. Let yourself \n                         be taught. Show your appreciation \n                         for his guidance. In this way, you \n                         know, perhaps. Well. There's hope \n                         for everyone. Even. Even Henry.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Fay comes walking up through the parking lot with Simon's \n               notebooks and a pile of typed papers. She's a wreck; tear-\n               stained face and a ball of tissues gripped in her hand like \n               a weapon. She throws open the door to the World of Donuts \n               and looks around.\n\n               The place is crowded with teenagers hanging around like it \n               was a café or student union.\n\n               Fay sniffles tragically and falls on the counter.\n\n                                     FAY\n                         Gnoc, gimme a value pack of Kleenex, \n                         will ya?\n\n               Gnoc gets the Kleenex while Fay overhears two kids near \n               Simon's poem...\n\n                                     TIM\n                         The violence of the imagery reminds \n                         me of early Clash, while the lyricism \n                         of the verse recalls, for me, Walt \n                         Whitman.\n\n                                     BIBI\n                         I would have said Dickinson, maybe \n                         even Eliot, and so on. But I agree \n                         with the punk roots...\n\n               Fay pays for her tissues and makes her way to the back of \n               the store where she finds Simon with Henry, who is holding \n               forth to his friend and the small coterie of high school \n               students surrounding them...\n\n                                     HENRY\n                         The greats all say the same thing: \n                         little. And what little there is to \n                         be said is immense. Or, in other \n                         words, follow your own genius to \n                         where it leads without regard for \n                         the apparent needs of the world at \n                         large, which, in fact, has no needs \n                         as such, but, rather, moments of \n                         exhaustion in which it is incapable \n                         of prejudice.\n                              (drinks)\n                         We can only hope to collide with \n                         these moments of unselfconsciousness. \n                         This divine fatigue... this...\n\n                                     FAY\n                              (sitting)\n                         Push over.\n\n               Henry takes the typed manuscript from her and continues...\n\n                                     HENRY\n                         As I tried to make plain in Paris: \n                         'Nous savons que nous avons chuté \n                         parce que nous savons qui nous \n                         sommes.' 'We know we have fallen \n                         because we know who we are.'\n\n                                     FAY\n                              (skeptically)\n                         When were you in Paris?\n\n                                     HENRY\n                              (interrupted)\n                         That's beside the point. But did \n                         they listen to me? Of course not!\n\n               Fay blows her nose and Simon is concerned.\n\n                                     SIMON\n                         You alright, Fay?\n\n                                     FAY\n                              (lighting a cigarette)\n                         No, I'm not alright! Your poem brought \n                         my period on a week and half early! \n                         So just shut up. Everybody just shut \n                         up!\n\n               She drops her head to the table and cries. Henry and Simon \n               look on in silence. Then Henry continues...\n\n                                     HENRY\n                         For is this not the best of all \n                         possible worlds? Are not the evils \n                         of this world necessary components \n                         of a cosmos that could not exist \n                         without them?\n\n               Amy's girlfriend, Chris, leans forward studiously and asks...\n\n                                     CHRIS\n                         So, do you believe in God?\n\n                                     HENRY\n                              (smokes, shrugs)\n                         Unfortunately.\n\n                                     FAY\n                              (lifting her head)\n                         Yeah, but when were you in Paris?\n\n                                     HENRY\n                              (aggravated)\n                         At. One. Time.\n\n                                     CHRIS\n                         Simon, can I have your autograph?\n\n               Simon looks from her to Henry. Henry winks at him.\n\n                                     HENRY\n                         Go ahead. But never let yourself be \n                         flattered.\n\n               Simon signs the girl's book.\n\n                                     FAY\n                              (to Henry)\n                         So what about this friend of yours, \n                         Hot Shot? The publisher.\n\n                                     HENRY\n                         Who?\n\n                                     SIMON\n                              (reminding him)\n                         Angus James.\n\n                                     FAY\n                         Yeah. Angus James. How about sending \n                         this poem to him?\n\n               Henry seems a bit put upon.\n\n                                     HENRY\n                         Because it's not done yet.\n\n                                     FAY\n                              (to Simon)\n                         When's it gunna be done, Simon?\n\n                                     SIMON\n                         I don't know.\n\n                                     FAY\n                         Well, you oughta be home writing \n                         instead of hanging out over here \n                         with all your groupies.\n\n                                     AMY\n                         Hey, I'm not a groupie.\n\n                                     FAY\n                         Pardon me, swivel-hips. Is that your \n                         PowerBook?\n\n                                     AMY\n                         Yeah.\n\n                                     FAY\n                         Can I see it?\n\n               Fay and Amy talk tech as...\n\n                                     HENRY\n                              (continues)\n                         The thing to do is to send parts of \n                         it to different magazines and literary \n                         journals first. That kinda thing. \n                         You know. Substantiate it.\n\n                                     AMY\n                              (looking up)\n                         What's 'scatalogical' mean?\n\n               Henry sips his beer and looks at her.\n\n                                     HENRY\n                         Filth, child. A preoccupation with \n                         excrement. Why?\n\n                                     AMY\n                         That's what the Board of Education \n                         called Simon's poem, yesterday; \n                         scatological.\n\n               Henry reaches across the table and shakes Simon's hand.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               The next day.\n\n               Fay is frying something on the stove, a cigarette hangs from \n               her lip. A middle-aged woman with a press ID on her lapel \n               appears at the kitchen door and taps.\n\n                                     EDNA\n                         Hello?\n\n                                     FAY\n                         Yeah, I'm listening.\n\n                                     EDNA\n                         My name is Edna Rodriguez and I write \n                         the human interest column for the \n                         Queens County Examiner and I was \n                         just wondering if I could have a \n                         word with Simon Grim?\n\n               Intrigued, Fay steps over to the door with her spatula. She \n               looks Edna over, studies her ID, then steps away and screams \n               upstairs.\n\n                                     FAY\n                         Simon!\n\n                                     EDNA\n                              (startled)\n                         Thank you.\n\n               Fay comes back over near the door, waving her spatula.\n\n                                     FAY\n                         You can't talk to him for, you know, \n                         too long or anything, 'cause he's \n                         gotta, you know... he writes all \n                         day. That's all he does. Can you \n                         believe that?\n\n               No response.\n\n                                     FAY\n                              (calling again)\n                         Hey! Simon! Get down here!\n\n               Simon finally shuffles into the kitchen.\n\n                                     FAY\n                         Simon, this is Edna. She's from the \n                         newspaper.\n\n                                     EDNA\n                              (rapid fire)\n                         Simon, the Parents' Association at \n                         the local high school are calling \n                         your poem pornography. The teachers \n                         are defending the students' right to \n                         exercise their critical tastes and \n                         sensibilities. The county agrees \n                         with the Church and considers the \n                         poem emblematic of modern society's \n                         moral disintegration. How do you \n                         feel about these controversial \n                         reactions to your poem?\n\n               Simon says nothing. He just stares at her.\n\n                                     FAY\n                              (punching him)\n                         Simon, answer the woman.\n\n               Simon just looks away, thinks, then wanders back upstairs. \n               Mary passes him on his way out of the kitchen and comes up \n               to Fay and Edna at the door.\n\n                                     MARY\n                         I need my prescription filled.\n\n                                     FAY\n                         Mom, this is Edna. Edna, Mom.\n\n                                     EDNA\n                         Mrs Grim, what was Simon like as a \n                         child?\n\n                                     MARY\n                         We all thought he was retarded.\n\n                                     FAY\n                         Everyone did.\n\n                                     MARY\n                         Never said a word.\n\n                                     FAY\n                         He masturbated constantly.\n\n                                     MARY\n                         Had no friends.\n\n                                     FAY\n                         Till he met Henry.\n\n                                     MARY\n                         And that's when all the trouble really \n                         started.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Henry is shaving. Simon sits in the kitchen, sorting through \n               rejection letters...\n\n                                     SIMON\n                              (reading)\n                         Dear Mr Grim, we here at the magazine \n                         consider ourselves and the publication \n                         open-minded and cutting edge and \n                         have consistently printed the work \n                         of the most brilliant and farseeing \n                         young talent of the day. Every week \n                         we are forced to return writing which \n                         we can not for one reason or another \n                         publish and include a brief but polite \n                         refusal. But this tract you've sent \n                         us demands a response as violent as \n                         the effect your words have had upon \n                         us. Drop dead. Keep your day job. \n                         Sincerely, The Editors.\n\n                                     HENRY\n                         De gustibus non disputandum est.\n\n                                     SIMON\n                              (thinking)\n                         You can't argue with taste?\n\n                                     HENRY\n                         About taste. You can't argue about \n                         taste. God, Simon.\n\n               Simon gives up and pushes the letters away, beaten.\n\n                                     SIMON\n                         The other twenty-five are almost as \n                         bad. I don't know why I bother.\n\n               Henry drops his razor and stomps out into the hall.\n\n                                     HENRY\n                         What do you mean you don't know why \n                         you bother? You bother because you \n                         know the poem is excellent!\n\n                                     SIMON\n                         Do I?\n\n                                     HENRY\n                         Of course you do!\n\n                                     SIMON\n                         I'm not so sure sometimes.\n\n                                     HENRY\n                         Can you sit there, look me straight \n                         in the eye, and tell me you don't \n                         think this poem is great? That it is \n                         not at once a work of great lyrical \n                         beauty and ethical depth? That it is \n                         not a genuine, highly individual, \n                         and profound meditation on the miracle \n                         of existence?\n\n               Simon holds the stare, overwhelmed.\n\n                                     SIMON\n                         I, ah...\n\n                                     HENRY\n                         Can you?\n\n               Simon looks away, thinks a moment, then looks back at Henry.\n\n                                     SIMON\n                         No. I can't.\n\n                                     HENRY\n                         So, you see, you have no choice!\n\n               He goes back into the bathroom. Simon thinks a while, then...\n\n                                     SIMON\n                              (calling)\n                         Can you recommend it to your friend, \n                         the publisher?\n\n               No response.\n\n                                     SIMON\n                         Henry? Can you recommend the poem to \n                         him?\n\n               Still no response. Simon gets up and stands in the bathroom \n               doorway. Henry is shaving.\n\n                                     SIMON\n                         I mean, I think it's finished and, \n                         for better or worse, it is book \n                         length.\n\n                                     HENRY\n                         That might not be as easy as it seems.\n\n                                     SIMON\n                         Why?\n\n                                     HENRY\n                         Well, it's been a long time. My name \n                         might not carry as much weight as it \n                         once did with Angus.\n\n                                     SIMON\n                         But he's your friend, right?\n\n                                     HENRY\n                         We were close at one time.\n\n                                     SIMON\n                         You said he respected your opinion.\n\n               Henry puts down his razor and looks at Simon in the mirror.\n\n                                     HENRY\n                         Look, Simon, opinions come and go.\n\n               He sees Simon looks worried.\n\n                                     HENRY\n                         To be honest; my ideas, my writing, \n                         they haven't always been received \n                         well or even calmly. They're \n                         upsetting. I'm a controversial man.\n\n               He walks around the bathroom, gesticulating.\n\n                                     HENRY\n                         You see, what I'm doing is too \n                         radical. Too uncompromising. It'll \n                         take time for people to see its value. \n                         It's ahead of its time, perhaps, or \n                         maybe just...\n                              (stops)\n                         A recommendation from me might do \n                         you as much harm as it does good.\n\n               Simon patiently absorbs all this, then walks through the \n               kitchen and looks across at the 'Confession' notebooks.\n\n                                     SIMON\n                         Henry, why can't I read the \n                         'Confession'?\n\n                                     HENRY\n                         Because certain work needs to be \n                         experienced all at once in order for \n                         one to appreciate the full force of \n                         its character.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Simon talks with Fay as she eats her lunch.\n\n                                     FAY\n                         Simon, wake up! The guy's in a dream \n                         world!\n\n                                     SIMON\n                         He's afraid that his reputation will \n                         prevent people from giving my work \n                         an honest chance.\n\n                                     FAY\n                         His reputation as what?\n\n                                     SIMON\n                         As a writer.\n\n                                     FAY\n                         Gimme a break.\n\n                                     SIMON\n                         He's kinda like in exile. Marginalized \n                         on account of his ideas.\n\n                                     FAY\n                         If he's such a great big fat genius, \n                         why doesn't he write books? Like you \n                         do.\n\n                                     SIMON\n                         He has. He's written a book. It's \n                         almost completed. He's been working \n                         on it for years. It's just not \n                         published.\n\n                                     FAY\n                         Yeah, I bet. It's probably disgusting.\n\n                                     SIMON\n                              (defensively)\n                         It's a quite serious and difficult \n                         piece of work, apparently.\n\n                                     FAY\n                         Have you read it?\n\n                                     SIMON\n                         No. Not yet. Soon. Certain work needs \n                         to be experienced all at once in \n                         order for one to appreciate the full \n                         force of its character.\n\n                                     FAY\n                         Yeah, well, what ever. Listen, Simon, \n                         forget Henry. Go straight up to this \n                         Angus James character yourself and \n                         make him read your poem.\n\n               She gets up to go. She's wearing a smart outfit.\n\n                                     FAY\n                         I'm gunna apply for a job at the one-\n                         hour photo joint and then go over to \n                         the Mall to see about that job in \n                         the bank. Make sure Mom takes her \n                         pills. See ya.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Mary is sitting, brooding in front of the TV, which displays \n               only static white noise. She turns it off with the remote \n               and sits in silence for a moment.\n\n               She gets off the couch and moves to the kitchen table, where \n               Fay's computer sits. She goes over and reaches up above the \n               fridge, opening the cabinet containing Simon's notebooks.\n\n               She hesitates, then takes them down and holds them in her \n               hands, as if to begin reading. But then she puts them back.\n\n               She walks over to the piano and stands there, hesitating, \n               before slowly sitting down and opening it. She lifts her \n               hands to play, then pauses and looks around behind her, making \n               sure no one is there.\n\n               But, finally, she turns back and begins playing.\n\n               She plays a sad-sounding modern classical piece with rusty \n               accomplishment. At one time she was probably quite good.\n\n               She plays for a while, gradually letting herself become moved \n               by the music. But then she stops, pauses, and looks behind \n               her.\n\n               Simon is standing in the kitchen. He has been deeply affected \n               by her playing.\n\n                                     SIMON\n                         Please don't stop.\n\n               She stares him down a moment longer, then looks away and \n               closes the piano. She returns to the couch and switches on \n               the TV.\n\n               Simon comes closer. He sits.\n\n                                     SIMON\n                         That was nice what you were playing.\n\n                                     MARY\n                         Yes, it was nice. But it was \n                         unremarkable.\n\n               Simon waits. Eventually...\n\n                                     SIMON\n                         Does that matter?\n\n                                     MARY\n                              (looking right at him)\n                         Yes. It does.\n\n               She gets up off the couch and goes upstairs. She slams her \n               bedroom door and leaves Simon alone on the couch. He thinks. \n               Then, he gets up and goes into the kitchen.\n\n               He takes the typed manuscript of his poem from the cabinet \n               above the refrigerator and goes to the door. He pauses, \n               clutches the poem and goes out.\n\n               EXT. SUBWAY STATION -- DAY\n\n               Simon waits, clutching his poem to his side, as a train pulls \n               into the station. Excited and determined, he gets on.\n\n               INT. TRAIN -- DAY\n\n               Simon travels to New York City. He finds an envelope on the \n               floor to put the poem in.\n\n               INT. MARY'S ROOM -- DAY\n\n               Mary wakes up and sits on the edge of the bed, feeling \n               regretful about her tone of voice with Simon.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Moments later.\n\n               Mary comes down into the kitchen and listens.\n\n                                     MARY\n                         Simon?\n\n               No answer. She steps over to the cabinet and almost takes \n               down Simon's notebook. But doesn't. She grabs her pills and \n               is about to take them. But then she stops. She puts them \n               down and goes to the cabinet. She takes down Simon's notebooks \n               and sits at the table, pauses, then pulls them closer and \n               begins to read.\n\n               INT. PUBLISHING HOUSE LOBBY -- DAY\n\n               Simon enters a big, posh lobby and checks the registry.\n\n               INT. PUBLISHING HOUSE RECEPTION -- DAY\n\n               Moments later.\n\n               Simon comes out of the elevator and enters the reception \n               area of James Midriff and Sutton Publishing. He walks \n               hesitantly up to the receptionist, a bright and spirited \n               young woman named Laura.\n\n                                     LAURA\n                         Hi, I'll take that.\n\n               Simon steps back defensively.\n\n                                     LAURA\n                         Aren't you the messenger?\n\n                                     SIMON\n                         No.\n\n                                     LAURA\n                         Are you here to fix the plumbing?\n\n                                     SIMON\n                         I'm here to see Mr. Angus James.\n\n                                     LAURA\n                              (amused)\n                         Are you?\n\n                                     SIMON\n                         I'm not a plumber. Or a messenger. I \n                         was once a garbage man. But now I'm \n                         a poet.\n\n               Laura steps back, cocks her head and removes her designer \n               eye-wear.\n\n               INT. CONFERENCE ROOM -- DAY\n\n               Same time.\n\n               Angus is at a big table with two other men, Steve and Barry.\n\n                                     BARRY\n                         The book, as we know it, Angus, will \n                         be a thing of the past within the \n                         next few years. Novels, articles, \n                         newspapers will all be downloaded on \n                         to our personal computers anyway.\n\n                                     ANGUS\n                         So you're telling me to get out of \n                         the publishing business?\n\n                                     STEVE\n                         No. But we've got to re-invent the \n                         publishing business for the electronic \n                         age.\n\n               Laura knocks.\n\n                                     ANGUS\n                         Yes, Laura?\n\n                                     LAURA\n                         I'm sorry to disturb you, gentlemen, \n                         but... Angus, there's a particularly \n                         wound-up young garbage man out here \n                         who seems to have written a poem. A \n                         long poem. And I recall how, at last \n                         month's meeting, you stressed the \n                         need for us to be on the look-out \n                         for more marginalized verse from \n                         unestablished quarters of the American \n                         scene.\n\n                                     ANGUS\n                         Did I say that?\n\n               Steve and Barry nod.\n\n                                     STEVE\n                         Yeah. You did.\n\n                                     BARRY\n                         Twice.\n\n                                     ANGUS\n                         Well, OK. Make an appointment, Laura. \n                         Sometime next month.\n\n                                     LAURA\n                         Right-e-o.\n\n               And she's gone.\n\n                                     ANGUS\n                              (returning)\n                         So, anyway, how is the digital \n                         revolution going to help me sell \n                         books?\n\n               INT. PUBLISHING HOUSE RECEPTION -- DAY\n\n               Simon looks disappointed.\n\n                                     SIMON\n                         Why can't I see him now?\n\n                                     LAURA\n                              (sincerely)\n                         Because he's a very important man \n                         and, well, you're not.\n\n               Simon just looks down at his shoes. Laura touches his arm \n               and reassures him.\n\n                                     LAURA\n                         Be reasonable.\n\n               He looks up, pauses, then...\n\n                                     SIMON\n                         Why?\n\n               INT. CONFERENCE ROOM -- DAY\n\n               Same time.\n\n                                     ANGUS\n                         I don't think people are going to \n                         prefer reading books on television, \n                         Steve.\n\n                                     STEVE\n                         It won't be television!\n\n                                     BARRY\n                         It'll be interactive.\n\n                                     STEVE\n                         Angus, look, we have a number of \n                         charts here...\n\n                                     BARRY\n                         In every home in America the PC will \n                         be where the TV used to be.\n\n                                     STEVE\n                         And it'll be a direct connection to \n                         all forms of media.\n\n                                     BARRY\n                         An unprecedented transformation of \n                         American social life...\n\n                                     STEVE\n                         We'll all become better informed, \n                         more literate, increasingly \n                         productive, and... Well, and, like I \n                         said, we have a number of charts...\n\n               Laura re-enters...\n\n                                     LAURA\n                         Sorry to disturb you again, gentlemen, \n                         but... Angus, I'd like to call \n                         security for this one. Though, before \n                         I do, I just wanted to ask just how \n                         marginal the as yet undiscovered \n                         voice of American poetry should be?\n\n                                     ANGUS\n                              (thinking)\n                         Pretty damn marginal, I'd think.\n\n                                     BARRY\n                         Down right controversial, probably.\n\n                                     ANGUS\n                         How's he strike you?\n\n                                     LAURA\n                         He's been denounced by his local \n                         Board of Education.\n\n                                     BARRY\n                         Oh, I read about him in the paper. \n                         Hangs out in a delicatessen somewhere \n                         and writes pornography.\n\n               INT. PUBLISHING HOUSE RECEPTION -- DAY\n\n               Moments later.\n\n               Angus comes out to the water cooler and glares at Simon as \n               he gets a drink.\n\n                                     ANGUS\n                         Hello, and why do you think I should \n                         take valuable time out of my busy \n                         schedule to read...\n\n               He grabs the envelope and sees no title.\n\n                                     ANGUS\n                         This?\n\n               Simon is stumped. He looks over at Laura, who purses her \n               lips and tilts her head. He twists a button on his shirt, \n               thinking, then returns to Angus.\n\n                                     SIMON\n                         Because it's a masterpiece.\n\n                                     ANGUS\n                         Really?\n\n                                     SIMON\n                         Yes.\n\n                                     ANGUS\n                              (to Laura)\n                         Are you hearing this?\n\n                                     LAURA\n                         He's adorable.\n\n                                     SIMON\n                         I wouldn't want to waste your time.\n\n                                     ANGUS\n                         I'm sure you wouldn't and I appreciate \n                         you being so straightforward.\n\n                                     SIMON\n                         Thank you.\n\n                                     ANGUS\n                         I assume you can take straightforward \n                         criticism?\n\n               Simon looks over at Laura.\n\n                                     LAURA\n                         Just say 'Yes'.\n\n                                     SIMON\n                              (looking back)\n                         Maybe.\n\n                                     ANGUS\n                         Get him a coffee, Laura.\n\n                                     LAURA\n                         Have a seat, Mr Grim.\n\n                                     ANGUS\n                         Hold my calls for the next half hour.\n\n                                     LAURA\n                         What about Steve?\n\n                                     ANGUS\n                         He doesn't drink coffee. Steve, do \n                         you drink coffee?\n\n                                     STEVE\n                              (off)\n                         Angus, listen to me!\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Henry paces back and forth. With the fingers of one hand \n               pressed against his forehead and his eyes closed tight in \n               concentration, he dictates to Amy, who is sitting at a table \n               with her laptop computer, typing his every word.\n\n                                     HENRY\n                         In the infinite amplitude of his \n                         love, God wants to create the largest \n                         number of best elements that can \n                         exist together in one cosmos... OK.\n\n               Amy types away, fascinated by Henry's intelligence.\n\n                                     HENRY\n                         In an instantaneous calculation made \n                         in eternity, God computes the best \n                         possible world and creates it. Fine. \n                         This 'decision' by God is uncontingent \n                         and eternal rather than temporally \n                         or ontologically sequential.\n\n               Stops, zeroing in on his point.\n\n                                     AMY\n                         How do you spell that?\n\n                                     HENRY\n                         What?\n\n                                     AMY\n                         Ontologically.\n\n                                     HENRY\n                         O-N-T... Don't you have some kinda \n                         spell-check on that thing?\n\n                                     AMY\n                         Never mind.\n\n                                     HENRY\n                         It is impossible for every perfect \n                         good to be compatible with every \n                         other perfect good. The intense beauty \n                         of the mountain must be set off by \n                         the fertility of the plain, so to \n                         speak.\n\n               He smokes, drinks, paces some more. Amy waits with bated \n               breath, devastated by his obscure profundity. He comes back \n               and sits beside her, reaching his conclusion.\n\n                                     HENRY\n                         The good of freewill must entail \n                         real choices for sin.\n\n               She gazes at his profile, in love.\n\n               Henry sits thinking and Amy watches him reverently. She leans \n               over close and whispers in his ear. He turns and looks at \n               her, alarmed.\n\n                                     HENRY\n                         Listen, Amy, back off. I'm on parole.\n\n                                     AMY\n                         You feel the same way. I can tell. I \n                         can see it when you look at me.\n\n               Henry jumps up and looks around, paranoid. He keeps his voice \n               down and points at her.\n\n                                     HENRY\n                         Hey! I don't look at you.\n\n                                     AMY\n                         Yes you do. In the street. In the \n                         parking lot yesterday. That night on \n                         the highway.\n\n                                     HENRY\n                         I look at a lot of people that way.\n\n               Disappointed, Amy turns away and sulks.\n\n                                     AMY\n                         You think I'm stupid.\n\n               Henry sees she's genuinely upset and feels bad. He sits back \n               down and lays his hand on hers.\n\n                                     HENRY\n                         No, as a matter of fact, I think \n                         you're a real bright kid and I like \n                         that about you.\n\n                                     AMY\n                              (looks up, pouts)\n                         You do?\n\n               Now Henry tries to scare her away. He leers at her.\n\n                                     HENRY\n                         I like it so much I've got half a \n                         mind to do perverse things to you. \n                         Right here. Right now. Things you \n                         might just learn to like.\n\n               She just stares at him, blinks, then looks away and tries to \n               imagine this. She takes her laptop and leaves, confused and \n               blushing.\n\n               Henry watches her go and grins, satisfied with himself.\n\n               INT. PUBLISHING HOUSE RECEPTION -- DAY\n\n               Angus throws on his coat and thrusts the poem at Simon as \n               they walk down the hall.\n\n                                     ANGUS\n                         This is really quite unbelievably \n                         bad, my friend. I mean, I'm all for \n                         experimentation and I've made a career \n                         out of a healthy disregard for \n                         convention, but... Look, this is \n                         profoundly irrelevant material. This \n                         is only my opinion. But it's an \n                         opinion I value highly. Goodnight, \n                         Laura. Call Norton Press. We're still \n                         on for tomorrow.\n\n               Simon looks pale as Angus strides towards the elevator.\n\n                                     ANGUS\n                         I've been wrong before as a publisher. \n                         But I refuse to admit I've ever been \n                         wrong as a reader. You have talent, \n                         I admit. You have an innate sense of \n                         the musicality of language. A good \n                         ear, maybe. But you do nothing \n                         significant with it. And this twisted \n                         reasoning that poses as... conviction \n                         or insight, it's... well, it's \n                         embarrassing.\n\n               They reach the elevator and stop. Simon tries to catch his \n               breath.\n\n                                     ANGUS\n                         Why did you bring this thing to me, \n                         anyway?\n\n                                     SIMON\n                              (weakly)\n                         A friend of mine spoke of you. He \n                         said you had a lot of integrity.\n\n                                     ANGUS\n                         Yes, well, of course, I do. But I'm \n                         not crazy, am I? Who is this person? \n                         Do I know him?\n\n               Simon hesitates, almost decides against it, but then...\n\n                                     SIMON\n                         Henry Fool.\n\n               Angus looks back at him.\n\n               Simon waits.\n\n               Angus looks aside, thinks, then shakes his head.\n\n                                     ANGUS\n                         Never heard of him.\n\n               Simon just looks at him blankly, confused.\n\n               The doors slide open and Angus gets in the elevator. He's \n               gone. Simon sinks into a chair and stares at the carpet. He \n               is so surprised and hurt he gasps for breath.\n\n               His poem slips from his hand and falls to the floor.\n\n                                     LAURA\n                              (off)\n                         I remember Henry.\n\n               Simon doesn't register this right away. But then he looks up \n               and over at the receptionist.\n\n               Laura stands and comes around her desk. She pauses, seeing \n               his disappointment, then comes closer and picks up his poem. \n               Handing it to him, she explains...\n\n                                     LAURA\n                         He used to be the janitor here.\n\n               He just stares at her, demolished.\n\n               EXT. SIDEWALK/SUBWAY ENTRANCE -- DAY\n\n               Later.\n\n               Simon dumps his poem in a trash can, pauses, then enters the \n               subway.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Henry is leaning on the counter, flipping through pornographic \n               magazines and smoking.\n\n                                     MR DENG\n                              (off)\n                         Henry, put those magazines back.\n\n                                     HENRY\n                         I'm just looking at the pictures.\n\n                                     MR DENG\n                         It's not good for you.\n\n               Henry flips through pages and nods, impressed.\n\n                                     HENRY\n                         I learn so much from these magazines, \n                         Mr Deng. I refuse to discriminate \n                         between modes of knowing.\n\n                                     MR DENG\n                         And you can't smoke in here anymore.\n\n               Henry looks up, outraged.\n\n                                     HENRY\n                         Why not!\n\n                                     MR DENG\n                         It's the law.\n\n               Henry throws his cigarette to the floor, steps on it and \n               returns to his magazine.\n\n                                     HENRY\n                         This place is losing all its charm, \n                         Mr Deng.\n\n                                     MR DENG\n                         Business is good. The kids, they \n                         hang out all day and drink coffee, \n                         talk about art and read poetry.\n\n               Henry shakes his head in dismay and studies a centerfold.\n\n                                     HENRY\n                         It's just a fad, Mr Deng. These kids \n                         today, they're just slaves to fashion.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Same time.\n\n               Fay comes in, hot and tired from walking around in high heels.\n\n                                     FAY\n                         Anybody home? Mom?\n\n               She stands on the stairs and hears the water running in the \n               bathroom.\n\n                                     FAY\n                         Ma, that you?\n\n               No answer. She discovers she's out of cigarettes.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Henry is leaning on the counter with a six-pack of beer, \n               pleading with Mr Deng.\n\n                                     HENRY\n                         Come on, Mr Deng! How much do I owe \n                         you?\n\n                                     MR DENG\n                         Twenty-five dollars.\n\n                                     HENRY\n                         That can't be right! And so what? My \n                         credit's good.\n\n               Warren comes in.\n\n                                     WARREN\n                         Henry!\n\n                                     HENRY\n                         Hey, Warren, you gotta couple of \n                         bucks I can borrow?\n\n               Warren reaches for his wallet.\n\n                                     WARREN\n                         Listen, Henry, I wanna remind you to \n                         vote this Thursday.\n\n                                     HENRY\n                         Ah, yes, of course. When noble minds \n                         shrink from the task of leadership \n                         scoundrels will rush in to fill the \n                         void.\n                              (takes cash)\n                         Thanks.\n\n                                     WARREN\n                         It's every American's right. A \n                         blessing. Yet another opportunity to \n                         save America from itself.\n\n               Henry pays Mr Deng for his beer.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Moments later.\n\n               Fay bangs on the door.\n\n                                     FAY\n                         Hey, Henry, you in there? Gimme a \n                         cigarette.\n\n               No answer. She tries the door. It's open. She hesitates.\n\n                                     FAY\n                         Henry?\n\n               She goes quietly in.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Henry steps out of the store and stops when he sees Amy \n               standing there, pouting. He looks away and sighs. Amy picks \n               at the fabric of her stockings and bites her lip.\n\n                                     AMY\n                         Henry?\n\n               Henry smokes.\n\n                                     HENRY\n                         Yeah.\n\n                                     AMY\n                         What kind of... Well, I mean... What \n                         kind of... perverse things would you \n                         do to me?\n\n               It's more than he can stand. He holds his head.\n\n                                     HENRY\n                         Take a powder, cupcake.\n\n                                     AMY\n                         No, really.\n\n                                     HENRY\n                         Evaporate!\n\n               Crushed, she breaks out in tears and flees.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon comes in, furious and throws open the fridge. He finds \n               nothing to eat or drink. He slams the door, then hears the \n               water running in the bathroom upstairs. He stops and listens.\n\n               The bathroom door; the water heard running steadily.\n\n               Simon turns away then sees...\n\n               The poem notebooks face down on the table.\n\n               He thinks.\n\n               The bathroom door; the water heard running...\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Moments later.\n\n               Henry comes into his house, hot and bothered, cradling his \n               six-pack. But he stops, listens, then steps through the \n               kitchen towards the living-room. He stops in the entrance \n               and sees...\n\n               Fay on the floor of the living-room, reading his 'Confession', \n               her mouth hung open in an astonished 'O'.\n\n               He drops his six-pack and...\n\n               She spins around, caught in the act.\n\n               Henry stands in the doorway, pent up, sweating and with \n               perverse things on his mind.\n\n               Fay, her hands palm down on the floor behind her, bites her \n               lip, coquettishly.\n\n               Henry looks her over like she was something good to eat.\n\n               She feels his gaze all over her and twists to one side with \n               a breathless little shudder.\n\n               He steps nearer, stands over her and she looks up at him.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon climbs the stairs to the bathroom...\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Henry and Fay kissing passionately...\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon knocks on the bathroom door.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Henry and Fay groping and shoving one another as they stagger \n               from room to room.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon bangs on the bathroom door.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Fay falls to the couch...\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon crashes through the door and finds...\n\n               Mary, kneeling over the edge of the tub, her wrists slit and \n               the blood running down the drain, the shower raining down \n               over her back.\n\n               Simon looks on in horror.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Henry tears open his trousers...\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon lifts Mary from the bathtub.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Henry and Fay clutch and grind and heave...\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon drags his mother from the bathroom and down the stairs.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Henry and Fay are making mad, passionate love, oblivious to \n               the world around them.\n\n               INT. GRIM HOUSE DAY -- DAY\n\n               Same time.\n\n               Simon drags Mary through the house.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Same time.\n\n               Henry and Fay fuck.\n\n               EXT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Simon drags Mary out the kitchen door and into the yard, \n               looking desperately for help. He reaches the street, her \n               limp body hanging grotesquely before him, and looks helplessly \n               up and down the block.\n\n                                                               DISSOLVE TO:\n\n               EXT. CEMETERY -- DAY\n\n               Simon, Henry, Mr Deng, Fay, Gnoc and Buñuel stand with Father \n               Hawkes at the grave.\n\n                                     FATHER HAWKES\n                         Let us pray. Lord, grant that peace \n                         be within reach for our friend, Mary. \n                         May the pain and confusion she endured \n                         on earth be fought through in the \n                         after life, so that she may enter \n                         the Kingdom of Heaven and live in \n                         the light of God. Amen.\n\n               He sprinkles holy water on the coffin and they all drop \n               carnations at the grave. Simon and Fay remain there looking \n               down at the coffin. Henry waits for them a few yards away, \n               wishing he could help, but feeling out of place.\n\n               EXT. JUNKYARD -- DAY\n\n               Simon is back working on the garbage truck. He collects \n               garbage and throws it in the truck as Henry, who is just \n               along for the ride, hangs from the side of the truck and \n               pulls the lever whenever Simon tells him to.\n\n                                     HENRY\n                         So I was a janitor! So what?\n\n                                     SIMON\n                         But Angus James said he didn't even \n                         know you!\n\n               Henry shrugs and qualifies...\n\n                                     HENRY\n                         Well, I mean, we weren't like bosom \n                         buddies or anything. But we used to \n                         talk sometimes. In the elevator. In \n                         the morning. He said he liked my \n                         ideas. Being a janitor's a good job \n                         if you're a writer. Especially the \n                         night shift; all that time to think \n                         and develop my ideas.\n\n                                     SIMON\n                         Do it.\n\n               Henry pulls the lever and the garbage gets crushed.\n\n                                     SIMON\n                         Anyway, he hated my poem.\n\n                                     HENRY\n                         Well, what the hell does he know? He \n                         wouldn't know a vital piece of \n                         literary art if it came up and bit \n                         him in the leg. To hell with him! \n                         He's not the only publisher in the \n                         world!\n\n                                     SIMON\n                         But nobody likes it.\n\n                                     HENRY\n                              (smokes)\n                         It's true. A prophet is seldom heeded \n                         in his own land. Remember that.\n\n                                     SIMON\n                         Do it.\n\n               Henry is about to pull the lever again, but sees something \n               in amongst the garbage...\n\n                                     HENRY\n                         Hey, look, treasure!\n\n               Henry steps down and leans over into the garbage. Simon joins \n               him as he lifts something that is either a ring or a stray \n               piece of machinery.\n\n                                     HENRY\n                         What is this?\n\n                                     SIMON\n                         Brass maybe. Some kinda copper.\n\n                                     HENRY\n                         It's a ring. Jewelry.\n\n                                     SIMON\n                         I think it's a gasket. A fitting \n                         from off of that old refrigerator \n                         over there.\n\n               Henry puts it in his pocket, satisfied and Simon jumps on \n               the back of the truck as it turns the corner and rolls away. \n               Henry starts to walk off in the opposite direction, but stops \n               when he sees Pearl age seven.\n\n               EXT. VICKY'S HOUSE -- DAY\n\n               Henry comes up the street with Pearl age seven on his back. \n               He walks into Vicky's yard and finds Warren lifting weights \n               in the garage.\n\n                                     HENRY\n                         Hey, Warren, I found Pearl wandering \n                         around by the garbage dump.\n\n                                     WARREN\n                         He lost.\n\n                                     HENRY\n                         Who lost?\n\n               Warren rests. He sits up on the bench and takes a toke off \n               the joint he has waiting.\n\n                                     WARREN\n                         Congressman Feer.\n\n                                     HENRY\n                              (realizing)\n                         Oh. Well, you know. Somebody's gotta \n                         lose.\n\n                                     WARREN\n                         What's the fucking use. You make \n                         sacrifices. You try to be a decent \n                         human being. Try to contribute \n                         something meaningful to society. And \n                         what happens? They lose to a bunch \n                         of cultural elite liberal fuck-ups. \n                         I don't give a shit anymore. People \n                         deserve what they get.\n\n               Henry pauses, then leads Pearl age seven towards the house. \n               Warren lies back down and continues his lifting.\n\n               INT. VICKY'S HOUSE -- DAY\n\n               Moments later.\n\n               Henry knocks on the door as he enters...\n\n                                     HENRY\n                         Vicky?\n\n               No answer. He comes in and finds her sitting on the couch \n               with a drink. She's got a black eye.\n\n                                     HENRY\n                         What happened to you?\n\n                                     VICKY\n                         He's a good man, Henry. Nobody's \n                         perfect.\n\n                                     HENRY\n                         I guess not.\n\n                                     VICKY\n                         He's terribly disappointed.\n\n                                     HENRY\n                         I found Pearl wandering around with \n                         no shoes on her feet.\n\n               Pearl comes over and stands beside her mother.\n\n                                     VICKY\n                         Thanks. She gets scared.\n\n                                     HENRY\n                         And you don't?\n\n               Vicky caresses Pearl's hair, then drinks and looks over at \n               Henry.\n\n                                     VICKY\n                         I love him.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Buñuel is waiting when Henry walks in and steps up to the \n               beer cooler.\n\n                                     HENRY\n                              (alarmed)\n                         Where's the beer?\n\n                                     MR DENG\n                         No more beer. Coffee. Espresso! \n                         Cappuccino! Café au lait. Carrot \n                         juice. Herbal tea.\n\n               Henry looks at the man, disgusted, then falls in to a seat \n               and motions to Gnoc, who is now the waitress.\n\n                                     HENRY\n                         A double espresso and a jelly donut, \n                         Gnoc.\n                              (to Buñuel)\n                         You mind paying? My credit's no good \n                         here anymore, apparently.\n\n                                     BUÑUEL\n                              (nods amiably)\n                         Did you go to the employment agency \n                         today, Henry?\n\n                                     HENRY\n                         No, but it's OK. Simon's gunna try \n                         to get me a job on the garbage truck.\n\n                                     BUÑUEL\n                         Listen, I'm a little concerned about \n                         your friend.\n\n                                     HENRY\n                         Simon?\n\n                                     BUÑUEL\n                         Seems he gave an obscene note to a \n                         girl in the library.\n\n                                     HENRY\n                         Get outta here! When?\n\n                                     BUÑUEL\n                         I'm not sure.\n\n                                     HENRY\n                         It couldn't have been Simon.\n\n                                     BUÑUEL\n                         It almost certainly is. He mentions \n                         you. Look...\n\n               He unfolds a print-out of the letter. Henry reads and Buñuel \n               leans over, pointing out...\n\n                                     HENRY\n                         'Her figure makes me violent. I want \n                         to somehow break her. But tenderly. \n                         How is this possible? Ask Henry.'\n\n               Henry thinks this over, gulps back some espresso and nods \n               his approval. Then...\n\n                                     HENRY\n                         Buñuel, this is obviously a love \n                         letter.\n\n                                     BUÑUEL\n                              (taking it back)\n                         We've had complaints.\n\n                                     HENRY\n                         Where did you get it?\n\n                                     BUÑUEL\n                         She posted it on the Internet.\n\n                                     HENRY\n                         Oh, the slut!\n\n                                     BUÑUEL\n                         She was trying to warn other girls \n                         about a potential rapist.\n\n                                     HENRY\n                              (smokes)\n                         Is all this true about the Internet? \n                         About how you can get pornography on \n                         it?\n\n                                     BUÑUEL\n                         Well, yeah, sure. It's a big problem. \n                         You can send dirty pictures and \n                         everything.\n\n                                     HENRY\n                         On the Internet?\n\n                                     BUÑUEL\n                         Yeah.\n\n               Henry is impressed.\n\n                                     HENRY\n                         No kiddin'?\n\n               Buñuel gets up to go.\n\n                                     BUÑUEL\n                         See you on Thursday, Henry.\n\n                                     HENRY\n                              (thinking)\n                         Sure. See you.\n                              (calls the waitress)\n                         Gnoc, gimme one of these double \n                         espressos to go, will ya?\n\n               He is having ideas.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Moments later.\n\n               Fay, still dressed in black, is tapping away on the keys to \n               the computer, surfing the Internet, as Henry appears at the \n               kitchen door, gripping his tall double espresso.\n\n                                     HENRY\n                         Hello, Fay.\n\n                                     FAY\n                         Go away.\n\n                                     HENRY\n                         You gotta get outta the house, Fay. \n                         You can't blame yourself for not \n                         being here. You did all you could \n                         for her.\n\n               She turns and glares at him.\n\n                                     FAY\n                         Is there something you want?\n\n               Henry stops, pauses, looks away. Then...\n\n                                     HENRY\n                         You got the Internet on that \n                         contraption?\n\n                                     FAY\n                              (resumes typing)\n                         Yeah. So what?\n\n               He changes the subject again, preoccupied and continues \n               tenderly...\n\n                                     HENRY\n                         Look Fay, about, you know, between \n                         us -- what happened...\n\n                                     FAY\n                         I don't wanna talk about it, Henry!\n\n               He sighs and drinks his coffee, then looks back at her.\n\n                                     HENRY\n                         Type a part of Simon's poem onto the \n                         Internet.\n\n                                     FAY\n                              (stops)\n                         What?\n\n                                     HENRY\n                         Go ahead.\n\n                                     FAY\n                         No.\n\n                                     HENRY\n                         Why not?\n\n                                     FAY\n                         Because.\n\n                                     HENRY\n                         Come on, Fay. It's a great idea.\n\n                                     FAY\n                         I don't know if he would want us to \n                         do that.\n\n                                     HENRY\n                         Sure he would. Just the first ten \n                         verses.\n\n               Fay is tempted.\n\n                                     FAY\n                         I don't know.\n\n                                     HENRY\n                         He'll thank you for it later.\n\n               Frowning, she reconsiders. She gets up and takes the notebooks \n               from the cabinet above the fridge. She flips through the \n               pages but suddenly stops and turns to the door with a nicer \n               attitude.\n\n                                     FAY\n                         Henry...\n\n               But he's gone. It's as if he has vanished into thin air. She \n               sighs, sits back down, and begins typing the poem onto the \n               Internet.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Henry comes back into the store, satisfied with himself. He \n               finishes off his coffee, tosses away the cup and takes a \n               pornographic magazine from the rack. He leans on the counter \n               where Mr Deng is busy working and flips through the pages.\n\n                                     HENRY\n                         Gimme another one of those tall double \n                         espressos, Mr Deng.\n\n               Mr Deng starts to make him one and sees him with the magazine.\n\n                                     MR DENG\n                         You gunna buy that?\n\n                                     HENRY\n                         I'm just looking.\n\n                                     MR DENG\n                         Well then put it back.\n\n                                     HENRY\n                         There's this fascinating story about \n                         a famous rock band and how they tied \n                         a friend of theirs to a bed in their \n                         hotel room and inserted a live fish \n                         into her vagina.\n\n               Mr Deng shakes his head and frowns.\n\n                                     HENRY\n                              (explains)\n                         They say she had numerous orgasms.\n\n                                     MR DENG\n                         Henry, you need to do something with \n                         your life. Get a job, or something.\n\n                                     HENRY\n                         I mean, it wasn't the entire fish, \n                         it was just, you know, the nose. The \n                         nose of the fish.\n\n               Mr Deng brings over the coffee. Henry is surprised to notice \n               he is not riveted.\n\n                                     HENRY\n                         You don't find that interesting?\n\n                                     MR DENG\n                         No.\n\n               Henry closes the magazine and puts it back. Leaning on the \n               counter, he sips his coffee and ponders.\n\n                                     HENRY\n                         You ever wonder what it would be \n                         like to have sex with an animal, Mr \n                         Deng?\n\n                                     MR DENG\n                         That coffee is free. Just take it \n                         and get out of here.\n\n                                     HENRY\n                         I mean, some dogs are almost as big \n                         as people and often more attractive.\n\n               Mr Deng just goes back to work, leaving Henry there at the \n               counter thinking big thoughts.\n\n               EXT. THE GRIM HOUSE -- EVENING\n\n               Simon hangs from the garbage truck as it comes up the street \n               and pauses in front of his house. He jumps down and the truck \n               barrels away.\n\n               INT. FAY'S ROOM -- EVENING\n\n               Simon taps at the door. She looks over at him and he sees \n               she's been crying. He comes into the room and she sits up on \n               the edge of the bed.\n\n                                     SIMON\n                         Did you see him?\n\n                                     FAY\n                         He came by this afternoon.\n\n                                     SIMON\n                         Did you talk?\n\n                                     FAY\n                         No.\n\n               He comes over and sits beside her. He thinks a moment, then...\n\n                                     SIMON\n                         You've got to tell him, Fay.\n\n                                     FAY\n                         He thinks I'm a slut.\n\n               And she starts crying again. Simon awkwardly touches her \n               shoulder, then moves his hand away. Fay pulls herself \n               together, sniffles and goes into the bathroom.\n\n               INT. THE GRIM HOUSE, AT THE PIANO\n\n               Moments later.\n\n               Simon comes downstairs and finds Henry at the piano. He looks \n               ill and is clutching a nearly empty container of espresso. \n               He is staring sickly at 'the ring'.\n\n                                     SIMON\n                         Henry?\n\n                                     HENRY\n                         Simon, I don't feel so good.\n\n                                     SIMON\n                         What's wrong?\n\n                                     HENRY\n                         I feel all kinda clammy. And damp.\n\n               Simon lifts the coffee container and smells it.\n\n                                     SIMON\n                         How many of these did you have?\n\n               Henry tries to remember. He squints.\n\n                                     HENRY\n                         Seven.\n\n               Simon puts the container down and sits at the table.\n\n                                     SIMON\n                         Henry, we have to talk.\n\n                                     HENRY\n                         Can I use your toilet?\n\n                                     SIMON\n                         Fay's taking a shower.\n\n               Henry grabs his stomach. He presses his hand against his \n               chest, holds his head, then stares at the ring.\n\n                                     HENRY\n                         How much you think I can get for \n                         this?\n\n               He looks at Simon.\n\n                                     SIMON\n                              (pauses)\n                         Henry, Fay's pregnant.\n\n               Henry looks at him.\n\n                                     SIMON\n                         Fay's pregnant with your child.\n\n               Henry lets this sink in. He stands and the room tilts. White \n               with fear, he clutches at his rumbling gut.\n\n               INT. THE GRIM HOUSE BATHROOM\n\n               Moments later.\n\n               Fay is in the shower as...\n\n               Henry bursts into the bathroom, tearing at his belt and \n               trousers. She starts screaming and wraps herself in the shower \n               curtain. He drops his pants and throws himself on the toilet \n               just in time to begin shitting his brains out. Fay crouches, \n               terrified and disgusted, in the shower.\n\n                                     FAY\n                         Jesus, Henry!\n\n               Henry sweats and moans as he empties his bowels in a violent \n               and messy blast of noise and foul air.\n\n               Fay covers her face and whimpers sickly.\n\n               Finally, he's done. He hangs with his face out over his knees, \n               sick, exhausted and in shock. Fay wraps herself in a towel \n               and steps out of the shower. She creeps carefully around him \n               and flushes the toilet, growing increasingly concerned.\n\n                                     FAY\n                         Hey, Henry. You OK?\n\n               He is destroyed, staring down at...\n\n               The 'ring' he still holds in his hand.\n\n               Fay sees this, looks at Henry, then kneels and takes it from \n               him. He doesn't resist. She lifts it up and breathlessly \n               admires it. Totally misunderstanding, moved beyond words...\n\n                                     FAY\n                         Oh. Oh, Henry.\n\n               And she throws her arms around him as he sits there, sweating \n               and spent, on the toilet.\n\n               INT. CHURCH -- DAY\n\n               A month later.\n\n               Mr Deng and Buñuel drag Henry, kicking and screaming, into \n               the church foyer. Once inside, he shakes them off and they \n               stand back. He huffs and puffs and tosses the hair back out \n               of his eyes. He paces back and forth like a caged animal, \n               then stops, sees...\n\n               Fay, at the altar, waiting with Simon. She is beautiful.\n\n               Henry calms down, deeply affected.\n\n               Fay smiles down the aisle at him.\n\n               Henry throws back his shoulders, straightens his tie and \n               strides up the aisle.\n\n               Also present at the ceremony are Vicky and Warren. Gnoc is \n               maid of honor.\n\n               INT. CHURCH -- DAY\n\n               Later.\n\n               Henry holds Fay's hand and repeats after Father Hawkes.\n\n                                     FATHER HAWKES\n                         I, Henry, take you, Fay to be my \n                         wife.\n\n                                     HENRY\n                         I, Henry, take you, Fay to be my \n                         wife.\n\n                                     FATHER HAWKES\n                         And do promise before God and these \n                         witnesses...\n\n                                     HENRY\n                         And do promise before God and these \n                         witnesses...\n\n                                     FATHER HAWKES\n                         To be your loving and faithful \n                         husband.\n\n                                     HENRY\n                         To be your loving and faithful \n                         husband.\n\n                                     FATHER HAWKES\n                         In plenty and in want.\n\n                                     HENRY\n                         In plenty and in want.\n\n                                     FATHER HAWKES\n                         In joy and in sorrow.\n\n                                     HENRY\n                         In joy and in sorrow.\n\n                                     FATHER HAWKES\n                         In sickness and in health.\n\n                                     HENRY\n                         In sickness and in health.\n\n                                     FATHER HAWKES\n                         For as long as we both shall live.\n\n                                     HENRY\n                         For as long as we both shall live.\n\n               The gasket everyone is now mistaking for a ring is lifted \n               high before the altar.\n\n                                     FATHER HAWKES\n                         Bless, O Lord, this ring, that he \n                         who gives it and she who wears it \n                         may abide in your peace and continue \n                         in your favor until their life's \n                         end.\n\n               The gasket is placed on Fay's finger.\n\n                                     FATHER HAWKES\n                         Whom God has joined, let no man \n                         separate.\n\n               The doors of the church swing open with a tremendous creak \n               and everyone turns from the altar to see...\n\n               Amy enter. She steps in and stands there, alarmed, clutching \n               a long scroll of fax paper.\n\n                                     HENRY\n                         Oh, shit.\n\n                                     FAY\n                         Simon, do something.\n\n               Simon walks down the aisle to see to Amy.\n\n               The guests watch and wait.\n\n               As Simon reaches her, Amy looks away from the altar and shows \n               him the fax scroll.\n\n                                     AMY\n                         Look.\n\n               He studies the fax and recognizes his poem. He grows \n               concerned.\n\n                                     SIMON\n                         Where did you get this?\n\n                                     AMY\n                         It's all over the Internet.\n\n               Simon looks up the aisle at...\n\n               Fay and Henry. They look away, caught.\n\n                                     AMY\n                         They're even talking about it on the \n                         TV news.\n\n               Confused, Simon starts for the door, shoving the fax in his \n               pocket. Fay steps down from the altar...\n\n                                     FAY\n                         Simon?\n\n               Amy hurries along beside him.\n\n                                     AMY\n                         There's a guy from the radio station \n                         over at World of Donuts and a story \n                         in the newspaper about some kids \n                         burning down a school near Boston!\n\n               INT. THE GRIM HOUSE -- NIGHT\n\n               Later that evening.\n\n               The whole neighborhood is celebrating Fay's wedding. The \n               music is loud. The people are drunk. The place is a shambles. \n               A big dance number is playing. Amidst all the festivities, \n               though, Simon and Buñuel have the small TV propped up on top \n               of the fridge, following the evening news...\n\n                                     REPORTER\n                              (on TV)\n                         It all started right here in Queens, \n                         Jim, at World of Donuts about one \n                         year ago today, when local garbage \n                         man, Simon Grim, put pencil to paper \n                         and began to compose what many have \n                         come to regard as vicious, antisocial \n                         and pornographic poetry -- 112 lines \n                         of unrhymed free meter verse which \n                         would one day serve to spark the \n                         flames of controversy across the \n                         nation and -- indeed -- the world.\n\n               Fay leads the neighbors in the dance...\n\n                                     OWEN FEER\n                              (on TV)\n                         This is outrageous! Measures must be \n                         taken. Have we debased our culture \n                         to such an extent that a garbage man \n                         with a head full of sick ideas is \n                         legitimately referred to as a poet, \n                         and where the filth he spews can be \n                         accessed by any child old enough to \n                         turn on a computer? Is this what we \n                         have come to? Not the transmission \n                         of our highest ideals, but a cynical, \n                         atheistic delirium!\n\n               Henry and Fay dance, surrounded by the dancing neighbors...\n\n                                     POET LAUREATE\n                              (on TV)\n                         Poetry of this kind, and this poem \n                         in particular, is, I think, a worthy \n                         form of desperation; a digression on \n                         the extremes of human experience; of \n                         solitude, of community. It is perhaps \n                         alarming, even upsetting to some -- \n                         myself included -- but it must be \n                         allowed to exist.\n\n               Henry throws an arm around Warren, who stands looking dejected \n               in the doorway, and raises his glass to the happiness in the \n               room.\n\n                                     ANCHORMAN\n                              (on TV)\n                         Meanwhile, in Rome today, the Pope \n                         issued a message of hope for believers \n                         in their fight against what he termed \n                         the godless and lost. He did not \n                         mention Simon Grim by name, but \n                         offered a prayer for the young whom \n                         he described as sadly in need of \n                         faith and not the illusion of \n                         conviction offered by rock music, \n                         drugs and contemporary poetry.\n\n               The TV is switched off. It's later now. People are passed \n               out on the kitchen floor and various neighbors are sitting \n               around the table. Fay steps back from the TV, drains a glass \n               of beer and wipes her mouth on the sleeve of her wedding \n               gown. She hugs Simon, who is deeply unsettled by the news of \n               his growing infamy.\n\n                                     FAY\n                         God, Simon, I mean, like, you're a \n                         total fucking rock star.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               A huge crowd of kids are pressed up against the doors, trying \n               to get a peek at their hero, Simon Grim.\n\n               Angus comes away from the window. He stands and regards Simon, \n               who is sitting at a table tearing a napkin to shreds.\n\n                                     ANGUS\n                         I'm willing to negotiate, Simon.\n\n                                     SIMON\n                         I know, it's just...\n\n                                     ANGUS\n                         You've had other offers.\n\n                                     SIMON\n                         Well, yes. But.\n\n                                     ANGUS\n                         What?\n\n                                     SIMON\n                         Why have you reconsidered?\n\n                                     ANGUS\n                         Because I think your writing will be \n                         tremendously successful.\n\n                                     SIMON\n                         But you don't like it?\n\n                                     ANGUS\n                         It's growing on me.\n\n                                     SIMON\n                         What made you change your mind?\n\n               He points to the fans outside.\n\n                                     ANGUS\n                         Other people's responses. I don't \n                         live in a vacuum, you know. Two months \n                         ago I didn't have the proof of your \n                         poem's appeal. Now I do.\n\n               Simon thinks this over, but says nothing. Angus comes over \n               and lays his hand on his shoulder.\n\n                                     ANGUS\n                         Consider my offer carefully. Get \n                         some professional advice. I'll call \n                         you tomorrow.\n\n               Simon nods.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Angus emerges and has to fight his way through the throng of \n               excited adolescents. He reaches his limo and gets in. But he \n               pauses before closing the door and considers the crowd.\n\n               Simon emerges from the store and kids begin screaming and \n               shouting for autographs. Angus shakes his head, impressed.\n\n               INT. CHURCH -- DAY\n\n               Simon consults Father Hawkes.\n\n                                     FATHER HAWKES\n                         What were the terms?\n\n                                     SIMON\n                         A hundred thousand in cash up front.\n\n                                     FATHER HAWKES\n                         Royalties?\n\n                                     SIMON\n                         A seventy/thirty split.\n\n                                     FATHER HAWKES\n                         Well, that could be better. But it \n                         is a hundred thousand dollars up \n                         front. Guaranteed money. You could \n                         use that.\n\n                                     SIMON\n                         So it's a good deal?\n\n                                     FATHER HAWKES\n                         Of course it's good.\n\n                                     SIMON\n                         So I should take it?\n\n                                     FATHER HAWKES\n                         No. Try to get him up to a hundred \n                         and fifty thousand.\n\n               EXT. JUNKYARD -- DAY\n\n               Evening.\n\n               Henry stalks along, all fired up. Simon tries his best to \n               keep up with him.\n\n                                     HENRY\n                         I've let myself down, Simon! I've \n                         let myself be caught in the bloody \n                         maw of banal necessity! How did I \n                         get here? How did this happen to me? \n                         I'm going to be somebody's father! I \n                         need time to think. To write. Time \n                         to finish my 'Confession'! I can't \n                         work for a living! It's impossible! \n                         I tried once. My genius will be wasted \n                         trying to make ends meet!\n\n               He collapses extravagantly.\n\n                                     HENRY\n                         This is how great men topple, Simon. \n                         Their hearts are in the right place \n                         too much of the time! They get \n                         sidetracked! Distracted. Oh! How \n                         could I have been so careless!\n\n                                     SIMON\n                         Henry, please, let me read the \n                         'Confession'.\n\n                                     HENRY\n                         No. Not now. It's not done. I'm all \n                         washed up. I'm finished!\n\n                                     SIMON\n                         Angus James is convinced my poem is \n                         going to make him incredibly wealthy. \n                         He'll read your book and seriously \n                         consider publishing it. If I ask him \n                         to. I'm certain.\n\n               Henry glances back at his friend, digesting this. He thinks \n               it over, then...\n\n                                     HENRY\n                         Really? You really think so?\n\n               Having finally got through to him, Simon comes forward, \n               anxious to help Henry.\n\n                                     SIMON\n                         I'll insist he publish the \n                         'Confession'.\n\n               He paces back and forth, thrusting out his chest, for the \n               first time in his life displaying something like pride or \n               arrogance.\n\n                                     SIMON\n                              (adds)\n                         Or I won't let him publish my poem.\n\n               Henry sits there watching Simon, impressed with this evidence \n               of increased self-esteem. He realizes the profundity of the \n               gesture.\n\n                                     HENRY\n                         You'd do that? You'd do that for me?\n\n               Simon stares off into the distance.\n\n                                     SIMON\n                         You saved my life.\n\n               Henry is moved. He stands and comes forward. He grabs his \n               friend by the shoulders and turns him around.\n\n                                     HENRY\n                         Do you realize what you're saying?\n\n                                     SIMON\n                              (pausing)\n                         I owe you everything.\n\n               Henry steps away, considering, then looks back at Simon and \n               extends his hand.\n\n                                     HENRY\n                         OK.\n\n               Simon smiles. Henry smiles. They shake hands.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Simon enters, comes forward into the room and pauses, looking \n               off at...\n\n               The stack of twelve books that comprise the 'Confession'.\n\n               EXT. HOUSE/BACKYARD -- DAY\n\n               Henry stands outside, watching his door.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               Simon lifts the first volume, opens it and begins reading. \n               He sits.\n\n               EXT. BACKYARD -- DAY\n\n               Henry paces, drinking and smoking nervously.\n\n               INT. HENRY'S APARTMENT -- NIGHT\n\n               Simon strides the length of the living room, reading. He \n               stops, frowns.\n\n               INT. HENRY'S APARTMENT -- NIGHT\n\n               Simon reads in front of the fire.\n\n               EXT. BACKYARD/GARAGE -- NIGHT\n\n               Buñuel, Hawkes and Mr Deng sleep sitting up as Henry talks \n               to himself. Fay leans out the back door and interrupts him. \n               He looks at her, but says nothing. She sighs and goes back \n               inside: turning off the lights.\n\n               INT. HENRY'S APARTMENT -- DAY\n\n               The next morning.\n\n               Simon sits wearily reading the final page of volume twelve \n               as the morning sun streaks into the room. Finally, he finishes \n               and slowly closes the book. He stands and crosses the room. \n               Leaning against the wall, he removes his glasses and rubs \n               his aching eyes.\n\n               EXT. BACKYARD -- DAY\n\n               Simon steps out of Henry's apartment and sees Henry asleep \n               on the back stoop.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Simon stares into a glass of water. Fay sits ten feet away, \n               waiting. Finally...\n\n                                     FAY\n                         It's really that bad?\n\n                                     SIMON\n                         It's terrible.\n\n               INT. ANGUS JAMES' OFFICE -- DAY\n\n               The 'Confession' lies on the big desk. Angus' hand comes \n               down upon it.\n\n                                     ANGUS\n                         You've read this?\n\n                                     SIMON\n                         Yes.\n\n                                     ANGUS\n                         And you want me to consider publishing \n                         it?\n\n                                     SIMON\n                         Yes.\n\n                                     ANGUS\n                         As part of our deal?\n\n                                     SIMON\n                         Yes.\n\n                                     ANGUS\n                         Simon, this book, it's... It's really \n                         quite bad.\n\n                                     SIMON\n                         That's what you said about my poem.\n\n               Angus pauses and figures. He changes the subject.\n\n                                     ANGUS\n                         I'm offering you a very real \n                         expression of my faith in your \n                         writing. Two hundred thousand dollars \n                         and a sixty/forty split.\n\n                                     SIMON\n                         But just exactly what is the nature \n                         of your faith in my writing?\n\n                                     ANGUS\n                         Look, Simon, you don't require my \n                         admiration. You require my experience \n                         as a publisher. And that experience \n                         leads me to believe your poem will \n                         make more money than any book of \n                         poetry ever published. In history. \n                         Virtually make you a household name \n                         within two years. You'll never have \n                         to work on a garbage truck again, I \n                         assure you. Or do anything else for \n                         that matter. Whereas this 'Confession' \n                         by Henry Fool...\n\n               He is at a loss for words.\n\n                                     ANGUS\n                         The most I can say for this is... \n                         The man is a scoundrel.\n\n                                     SIMON\n                         He taught me everything I know.\n\n                                     ANGUS\n                         No! He encouraged all that was \n                         expressive in you to become manifest. \n                         He inspired you to act. He influenced \n                         your perception.\n\n               Simon waits a while, staring at his shoes.\n\n                                     SIMON\n                         How about if my advance is only a \n                         hundred thousand?\n\n                                     ANGUS\n                         It's not about money, Simon.\n\n                                     SIMON\n                         We could split the royalties \n                         seventy/thirty.\n\n                                     ANGUS\n                         I will not publish Henry Fool's \n                         'Confession'.\n\n               Simon sits and lets this sink in. Angus waits, then...\n\n                                     ANGUS\n                         Will you sign the contract?\n\n               Simon continues looking out at the city. Angus waits, but \n               there is no response. Finally, Simon turns, pauses and slowly \n               crosses the room.\n\n               He sits at the table and looks down at the contract.\n\n               He signs.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Fay is in labor. Henry helps her into her coat as they rush \n               for the door.\n\n               INT. WORLD OF DONUTS -- DAY\n\n               Moments later.\n\n               Henry runs into the store and stands there, panicked, looking \n               at Hawkes, Buñuel and Mr Deng. Gnoc runs out to get Fay.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               Henry and Gnoc load Fay into the van. The van pulls out.\n\n               INT. VAN -- DAY\n\n               Henry drives recklessly. Fay rolls around in the back.\n\n               INT. HOSPITAL CORRIDOR -- DAY\n\n               Fay is in a wheelchair being rushed down the hall. She is \n               gripping Henry's hand as he runs along beside her.\n\n               INT. HOSPITAL DELIVERY ROOM -- DAY\n\n               Fay gasps and sweats as the Doctor and Nurse prepare her. \n               She is scared. She looks over at...\n\n               Henry, looking in through the window. He looks scared too.\n\n               Fay is sedated by gas.\n\n               Henry is taken away by the Nurse.\n\n               Fay stares up at the ceiling.\n\n               INT. HOSPITAL WAITING ROOM -- NIGHT\n\n               Henry is asleep on a row of waiting-room chairs, exhausted.\n\n               Simon comes running up the hall and finds him. It's late and \n               no one is around. He sits down beside Henry and shakes him.\n\n               Henry wakes.\n\n                                     HENRY\n                         Simon? You're here.\n\n               He sits up and Simon sits beside him.\n\n                                     SIMON\n                         What happened?\n\n                                     HENRY\n                              (coughs)\n                         It's a boy.\n\n                                     SIMON\n                         And Fay?\n\n                                     HENRY\n                         She's alright.\n\n               Simon sits back, relieved. Then he remembers the rain-soaked \n               shopping bag he has with him. He pulls out a couple of cans \n               of beer and hands one to Henry.\n\n                                     HENRY\n                         Thanks.\n\n               They look around, seasoned conspirators and make sure the \n               coast is clear. Then they pop open the beers and toast.\n\n               They drink. Then...\n\n                                     HENRY\n                         How did it go?\n\n               Simon pauses, scared, then gets up and crosses the room. He \n               looks out of the window and gathers his strength.\n\n                                     SIMON\n                         Listen, Henry, Angus James didn't \n                         like your 'Confession'.\n\n               Henry looks at Simon blankly, then blinks and looks away.\n\n                                     HENRY\n                         Ah. I see. Well, what now?\n\n                                     SIMON\n                         What do you mean?\n\n                                     HENRY\n                         Did he suggest changes?\n\n               Silence. Simon comes back and sits again.\n\n                                     SIMON\n                         No. He didn't.\n\n                                     HENRY\n                         I mean, after all, there are things \n                         I can do to make it more accessible.\n\n                                     SIMON\n                         Accessible?\n\n                                     HENRY\n                         I can soften up some of the language \n                         and make it read easier. Take out \n                         some of the more intratextual \n                         references and popularize the \n                         underlying Sturm und Drang, so to \n                         speak. I can change its mode. Make \n                         it more of a conventional novel \n                         instead.\n\n               Simon just stares at him blankly, then sighs and shakes his \n               head.\n\n                                     SIMON\n                         No. Don't.\n\n                                     HENRY\n                              (laughing)\n                         Oh, Simon, don't be such a purist! I \n                         appreciate your protectiveness, but \n                         the integrity of the work gives it a \n                         durability that can sustain such \n                         things.\n\n               Simon comes over and lays his hand on Henry's shoulder.\n\n                                     SIMON\n                         No. Really, Henry. Don't.\n\n                                     HENRY\n                         What are you saying; that it doesn't \n                         merit revision?\n\n                                     SIMON\n                         I'm saying... Angus James didn't \n                         like it.\n\n               He steps away and sits. Henry pauses, then approaches and \n               leans down over him.\n\n                                     HENRY\n                         Well, did you tell him what you think?\n\n                                     SIMON\n                         What I think doesn't matter.\n\n                                     HENRY\n                         Yes, it does. You've got to use your \n                         influence with him.\n\n                                     SIMON\n                         I gave it to him to read and he hated \n                         it. What more can I do?\n\n                                     HENRY\n                         You can refuse to let him publish \n                         your poem.\n\n                                     SIMON\n                         I can't do that.\n\n                                     HENRY\n                         You said you would.\n\n                                     SIMON\n                         That was before I read your book.\n\n                                     HENRY\n                              (hit hard)\n                         Oh.\n\n                                     SIMON\n                              (looking up at him)\n                         I signed the contract, Henry.\n\n               Henry stands there a moment longer, then lowers himself into \n               the nearest seat, weakened.\n\n                                     SIMON\n                         Look, Henry, what did you expect?\n\n                                     HENRY\n                         I... I don't know. Honesty, perhaps.\n\n                                     SIMON\n                              (indignantly)\n                         Look, if I had told you, when at \n                         first I read it, that I thought it \n                         was no good, what would you have \n                         done?\n\n                                     HENRY\n                         I would have respected your opinion.\n\n                                     SIMON\n                         And insisted that there's no \n                         accounting for taste.\n\n                                     HENRY\n                         Well, is there?\n\n               Simon's words catch in his throat. He turns away, frustrated.\n\n                                     SIMON\n                         I don't know. I didn't bring it to \n                         Angus because I thought it was good. \n                         I brought it to Angus because you're \n                         my friend.\n\n                                     HENRY\n                              (staggered)\n                         Oh how perfectly enormous of you, \n                         Simon.\n\n                                     SIMON\n                              (explodes)\n                         Look, Henry, I did it! I wrote. I \n                         wrote poetry because you told me to! \n                         I worked! I worked while you sat \n                         back and comfortably dismissed the \n                         outside world as too shallow, stupid \n                         and mean to appreciate your ideas.\n\n                                     HENRY\n                         Is that such a priority? Is that \n                         some sort of measure of a man's worth? \n                         To drag what's best in him out into \n                         the street so every average slob \n                         with some pretense to taste can poke \n                         it with a stick?\n\n                                     SIMON\n                              (sits, tired)\n                         Maybe. Maybe it is.\n\n               Henry just stares at him, stands, then turns on his heel and \n               waves him off.\n\n                                     HENRY\n                         You must be pretty impressed with \n                         yourself, huh? The all too obviously \n                         talented new man, the important new \n                         voice, the early clue to a new \n                         direction, or whatever, etc., etc., \n                         etc! A popular new trend conveniently \n                         packaged for the distracted young \n                         herd! You want to be liked more than \n                         you know, Simon Grim! You'd be nowhere \n                         without me and you know it.\n\n               Simon hangs his head, destroyed.\n\n                                     SIMON\n                         I'm leaving.\n\n               Henry is scared all of a sudden. But he puts on a defiant \n               exterior.\n\n                                     HENRY\n                         Yes. It's time you left.\n\n               He stands, drinks and walks over to the window...\n\n                                     HENRY\n                         I saw you for what you were in the \n                         beginning, Simon. I hold no grudge \n                         and I'm certain you will, in time, \n                         leave some serious and small dent in \n                         this world.\n\n                                     SIMON\n                              (weakly)\n                         The world is full of shit.\n\n               Henry take advantage of Simon's disillusionment and puts on \n               a big show of secure wisdom.\n\n                                     HENRY\n                         The world is full of shit. It's true. \n                         And you have to walk through it. \n                         That's your part. I'm sorry. But \n                         you're no good at it. Perhaps I'm \n                         not. Perhaps I wasn't made to walk \n                         through shit. Go on now. Leave. Do \n                         what you're good at. Go.\n\n               Simon sits there a moment, numb with grief. Henry, red in \n               the face, stares at the floor. Suddenly, Simon stands and \n               walks out. Henry looks up and watches him go. He can hardly \n               believe it. He almost raises his voice and apologizes, but \n               can't. He lowers his head again and covers his face with his \n               hands, listening to Simon's footsteps receding through the \n               halls.\n\n               Simon walks on, away from us, down the hospital corridor.\n\n                                                              FADE TO BLACK\n\n               EXT. STREET -- DAY\n\n               Seven years later.\n\n               Fay bangs out of the kitchen door with her seven-year-old \n               son Ned. Frazzled and overworked, she grips a loaded laundry \n               basket to her side as she sits Ned down on the curb and points \n               at him.\n\n                                     FAY\n                         Play!\n\n               The kid sits still, obviously guilty of some unspeakable \n               mischief, as Fay storms back into the house. He looks around, \n               bored, then brightens up when he sees...\n\n               Henry, coming up the street, hanging from the back of a \n               garbage truck.\n\n               INT. THE INFERNO -- DAY\n\n               Moments later.\n\n               Henry enters with Ned on his back and the bartender, Patty, \n               goes ballistic.\n\n                                     PATTY\n                         Henry, what did I tell you about \n                         bringing the kid in here!\n\n                                     HENRY\n                         Say hello to Patty, Ned.\n\n                                     NED\n                         Hi.\n\n               She suddenly becomes all soft and cuddly.\n\n                                     PATTY\n                         How you doin', sweetie? You wanna \n                         Coke?\n\n               He nods and Henry stands him on a stool at the bar.\n\n                                     HENRY\n                         So what did you learn at school today, \n                         Ned? Anything?\n\n               He shakes his head.\n\n                                     HENRY\n                         Here, I'll teach you something.\n\n               He hands Ned a cigarette and lights it for him. Ned takes a \n               drag and coughs.\n\n                                     HENRY\n                         Horrible, isn't it?\n\n               Ned nods in agreement.\n\n                                     NED\n                         It burns.\n\n                                     HENRY\n                         See. That'll teach ya. Here, sip \n                         this.\n\n               And he offers the kid his whiskey.\n\n               EXT. THE GRIM HOUSE -- DAY\n\n               Same time.\n\n               Fay comes out of the house and looks for her son.\n\n                                     FAY\n                         Ned!\n\n               She comes out to the street and looks around.\n\n                                     FAY\n                         Ned!\n\n               EXT. VICKY'S HOUSE -- DAY\n\n               Fay comes up looking for Ned and sees...\n\n               Pearl, age fourteen, come out of Vicky's House. She is \n               fourteen years old now. Warren steps out the door and grabs \n               her by the arm. She shakes him off. He slaps her.\n\n               She runs down the steps and glares back at him.\n\n                                     WARREN\n                              (pointing at her)\n                         I'm warning you, Pearl!\n\n               Pearl turns defiantly away and walks into the street.\n\n               INT. THE INFERNO -- DAY\n\n               Same time.\n\n               Henry is teaching Ned how to tip a topless dancer. A dancer \n               stands on the bar and stretches her garter as Ned slips a \n               dollar bill in beneath it.\n\n                                     HENRY\n                         That's it. That's it. Perfect!\n\n               Some other guy down the bar is reading a newspaper...\n\n                                     BILL\n                         Hey, Fool, it's about your friend -- \n                         what's his name. Your brother-in-\n                         law.\n\n               Henry looks over. The guy, Bill, shows him the article.\n\n                                     HENRY\n                         What about him?\n\n                                     BILL\n                              (reading)\n                         The controversial and reclusive \n                         American poet Simon Grim has been \n                         awarded the Nobel Prize in Literature. \n                         The Swedish Academy, who will confer \n                         the award late next week, praised Mr \n                         Grim for works of great and difficult \n                         striving, for the rendering of the \n                         desperate, the ugly and the mundane \n                         in a language packed with our shared \n                         human frailties...\n\n                                     HENRY\n                         God, they must be hard up for geniuses \n                         to pin medals on because, listen, I \n                         gotta tell you, when I first met \n                         this guy he didn't even know what an \n                         iambic pentameter was.\n\n                                     BILL\n                         He's a fraud.\n\n                                     HENRY\n                         Keep a lid on it, Bill, you're outta \n                         your league.\n\n                                     BILL\n                         Stir things up so as to stay in the \n                         newspapers. That's his racket.\n\n                                     HENRY\n                         He's a great American poet, you dumb \n                         fuck!\n\n                                     BILL\n                         Poet, my ass! I could puke all over \n                         a piece a loose leaf and be more \n                         profound than he is!\n\n                                     HENRY\n                         Come over here and say that and I'll \n                         cripple ya in three different ways, \n                         you boozed-up Philistine!\n\n                                     FAY\n                         Henry!\n\n               Henry and Ned crouch and quiver -- caught. Fay strides up to \n               the bar and grabs the kid.\n\n                                     FAY\n                         Listen, you degenerate, I've had \n                         about enough of this!\n                              (smells Ned's breath)\n                         Ned, have you been drinking?\n\n               The kid checks with Henry then looks back at Fay and nods. \n               Fay looks at her husband, outraged.\n\n                                     HENRY\n                              (explains)\n                         His throat hurt from smoking.\n\n               Fay slaps him across the face -- hard -- and the place goes \n               quiet. Henry shakes his head clear and she pokes him in the \n               chest with her finger.\n\n                                     FAY\n                         Henry, don't come home tonight! I'm \n                         warning you! Don't come home at all! \n                         Ever!\n\n               And she storms out with the kid. Henry snaps his jaw back \n               into place, then looks at Patty and Bill and shrugs. He knocks \n               back his drink and motions for another.\n\n               EXT. WORLD OF DONUTS -- NIGHT\n\n               Later (evening).\n\n               Henry staggers out of the back door of the Inferno and comes \n               across Mr Deng sitting against the wall of the store, watching \n               the basketball game on a small TV. World of Donuts vibrates \n               with loud music.\n\n                                     HENRY\n                         Who's winning?\n\n                                     MR DENG\n                         Nobody.\n\n               Henry gestures to World of Donuts...\n\n                                     HENRY\n                         What's going on in there?\n\n                                     MR DENG\n                         We gotta have rock 'n' roll shows \n                         these days, Henry. The poetry readings \n                         just don't pay the bills no more.\n\n                                     HENRY\n                         What did I tell you! It was just a \n                         fad. I told you that! I told everyone!\n\n                                     MR DENG\n                         Did you hear about Simon? It was on \n                         the news today.\n\n                                     HENRY\n                         Yeah yeah yeah. So what? A Nobel \n                         Prize. Anybody can get one of them \n                         these days. That's the problem, with \n                         this world, Mr Deng... Nobody's got \n                         any standards anymore. You seen Fay?\n\n                                     MR DENG\n                         You better sleep in my office tonight, \n                         Henry. She was very angry. You've \n                         gotta let her cool off.\n\n                                     HENRY\n                         I can't sleep in there with that \n                         racket!\n\n                                     MR DENG\n                         Suit yourself.\n\n               Henry considers his options, then...\n\n               INT. GARAGE -- NIGHT\n\n               The place is abandoned.\n\n               Henry comes in and, just as he is laying down to go to sleep \n               on an old couch, finds Pearl age fourteen.\n\n               She is hardened and disturbed, but frequently vulnerable and \n               scared; a troubled kid.\n\n                                     HENRY\n                         What are you doing here, Pearl?\n\n                                     PEARL\n                         You want some?\n\n                                     HENRY\n                              (pauses)\n                         Some what?\n\n               Pearl comes towards him. He is kneeling with his face at her \n               crotch level when she reaches him. She holds out a bottle of \n               cheap rot-gut wine. Realizing, he takes it and drinks. He \n               winces.\n\n                                     HENRY\n                         Shit!\n\n               Pearl laughs and falls back onto the couch, her sweater \n               hanging off her shoulder and her skirt hiked up and displaying \n               her underwear.\n\n               Henry stands and searches for something to sit on.\n\n                                     PEARL\n                         Come sit here.\n\n               She pats the couch beside her.\n\n               He comes over, eyeing her carefully and sits. He hands back \n               the bottle. She drinks, winces and sits staring at the flames.\n\n                                     PEARL\n                         That's what my dad always says.\n\n                                     HENRY\n                         What?\n\n                                     PEARL\n                              (dead)\n                         'You want some?'\n\n               Henry looks away, uncomfortable. She slides her gaze over to \n               him, their eyes meet, and she pins him to the spot.\n\n                                     PEARL\n                         People say you were once in jail for \n                         having sex with a girl my age.\n\n                                     HENRY\n                         That was a long time ago.\n\n               He gets up and stands at the window. Pearl age fourteen \n               watches him closely as she drinks, then...\n\n                                     PEARL\n                         You want some?\n\n               He looks over at her and she slides her coat off her shoulder. \n               Henry is sweating.\n\n                                     HENRY\n                         You oughta get outta here, Pearl.\n\n                                     PEARL\n                         I was here first.\n\n                                     HENRY\n                         Go home.\n\n                                     PEARL\n                         You go home.\n\n                                     HENRY\n                         Fine.\n\n               And he starts to leave. But Pearl sits up...\n\n                                     PEARL\n                              (scared)\n                         Wait!\n\n               Henry stops and looks back at her.\n\n                                     PEARL\n                              (hanging her head)\n                         I can't go home.\n\n                                     HENRY\n                              (concerned)\n                         Why not?\n\n                                     PEARL\n                         He beat her up again.\n\n               Henry holds his head, tries to sober up. He looks around the \n               room, then focuses on the girl.\n\n                                     HENRY\n                         Warren beat up your mom?\n\n               Pearl stares at the floor. She glances over at him, then \n               back down at the bottle gripped in her hands. She nods.\n\n               Henry pauses, then comes across the room, lowering himself \n               tentatively to the couch.\n\n                                     HENRY\n                         Is she alright?\n\n               She says nothing for a moment, then...\n\n                                     PEARL\n                              (sadly)\n                         Do you think I'm pretty?\n\n               Henry lifts his hand and covers his face. He looks up at the \n               ceiling and sighs. He returns to Pearl...\n\n                                     HENRY\n                         Does she need help?\n\n               Pearl reaches over and grabs his thigh. Looking up at him, \n               with tears rolling down her face, she suggests...\n\n                                     PEARL\n                         I'll suck your cock if you kill him \n                         for me.\n\n               Henry jumps away from her and Pearl throws herself down on \n               the couch, covering her face.\n\n               INT. VICKY'S HOUSE -- NIGHT\n\n               Moments later.\n\n               Henry barges in and starts searching for...\n\n                                     HENRY\n                         Vicky! Vicky, it's Henry from across \n                         the street! Vicky!\n\n               He runs through the house, checking the rooms. He throws \n               open the door to the bedroom and finds...\n\n               Vicky, sitting on the edge of the bed, smoking. She has a \n               black eye and a swollen cheek.\n\n                                     HENRY\n                              (taken back)\n                         Vicky?\n\n                                     VICKY\n                              (standing)\n                         What do you think you're doing, you \n                         idiot!\n\n                                     WARREN\n                              (off)\n                         Hey!\n\n               Henry looks over and sees Warren stumble drunkenly out of \n               the bathroom. What are you doing in my house?\n\n                                     HENRY\n                              (to Vicky)\n                         It's about Pearl.\n\n               Vicky looks troubled. She sits back down with a sigh.\n\n                                     VICKY\n                         Mind your own business, Henry.\n\n                                     WARREN\n                              (shoves him)\n                         Yeah, who the hell do you think you \n                         are, anyway?\n\n               Henry falls back and looks at Vicky. She looks away.\n\n               Henry looks at Warren, pauses, then gives him a sharp, hard \n               shove.\n\n               Warren stands back against the wall, pauses, then erupts \n               into viciousness.\n\n               He grabs Henry and throws him violently down the hall, where \n               he hits the wall and collapses.\n\n               As Henry gets to his knees, Warren kicks him in the ribs. \n               Henry curls up and rolls out on to the kitchen floor. Warren \n               kicks him in the side of the head.\n\n               Vicky sits back down on the bed, covering her ears.\n\n               Warren beats the hell out of Henry, kicking him in the face \n               and ribs whenever he manages to get up on his hands and knees. \n               Henry crawls under the kitchen table for safety. Warren grabs \n               his feet and drags him out. As he is dragged across the floor, \n               Henry finds a screwdriver and grabs it. He rolls over on his \n               back as...\n\n               Warren lunges down at him again and...\n\n                                     WARREN\n                         Ah.\n\n               Warren is stabbed in the heart.\n\n               Henry can't believe it.\n\n               Warren can't believe it. He stands there in the middle of \n               the kitchen, amazed, with the screwdriver sticking out of \n               his chest.\n\n               Henry, semi-conscious and severely beaten, falls against the \n               back door and coughs up a few of his teeth. Vicky steps into \n               the hall from her room and shudders.\n\n               Warren sits at the table, stunned. He looks from the \n               screwdriver to Vicky, then...\n\n                                     WARREN\n                         Fuck.\n\n               He falls to the floor.\n\n               EXT. STREETS -- NIGHT\n\n               Henry staggers away, limping. He comes to the intersection \n               at the end of the block and doesn't know which way to run. \n               Panicked, he looks round, holding his arm to his chest. He \n               runs towards the highway.\n\n               INT. POLICE STATION -- NIGHT\n\n               Later.\n\n               Fay is wired beyond belief. Trying to listen attentively, \n               but still too overwhelmed to maintain her concentration.\n\n                                     LAWYER\n                              (off)\n                         It is true your husband served seven \n                         years in prison for statutory rape.\n\n                                     FAY\n                         Yes. It is.\n\n                                     LAWYER\n                         And when was that?\n\n                                     FAY\n                         That was... I dunno. Fifteen... \n                         Sixteen years ago.\n\n                                     LAWYER\n                         And when were you married?\n\n                                     FAY\n                         We were married seven years ago.\n\n                                     LAWYER\n                         Were you aware at all of the victim's \n                         relationship with his daughter?\n\n                                     FAY\n                         Pardon me?\n\n                                     LAWYER\n                         The girl, the daughter, Pearl. She \n                         had been having sexual relations \n                         with her father.\n\n               Fay is overwhelmed.\n\n                                     FAY\n                         I didn't know that. No.\n\n                                     LAWYER\n                         Pearl claims she offered your husband \n                         sexual favors if he would kill her \n                         father.\n\n               Fay just looks at him blankly, overwhelmed, confused. She \n               starts to cry quietly.\n\n                                     LAWYER\n                         I'm just repeating what she said, \n                         Mrs Fool. The victim's wife, Vicky, \n                         claims your husband broke into the \n                         house and forcefully entered her \n                         bedroom.\n\n               Fay trembles and catches her breath trying to take this all \n               in. A cop hands her some tissues. She takes them and tries \n               to concentrate on what the lawyer says.\n\n                                     LAWYER\n                         Fay, I know this isn't easy. But we \n                         need your help here. The girl claims \n                         she asked your husband to kill her \n                         father in exchange for, well, I guess \n                         the promise of sexual relations with \n                         her.\n\n               INT. POLICE STATION CORRIDOR -- NIGHT\n\n               Later.\n\n               Fay staggers out into the noisy corridor and rests against \n               the wall. Looking down the hall she sees...\n\n               Pearl and Vicky, sitting in a blank, brightly lit room beyond \n               a glass door.\n\n               Fay comes closer and looks in at them.\n\n               They don't see her. They stare at the floor before them, \n               dazed and confused.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Morning.\n\n               Fay is lying on her bed with her coat still on, trying to \n               think. Ned stands by the side of the bed, watching her.\n\n                                     NED\n                         Mom?\n\n                                     FAY\n                         Yeah.\n\n                                     NED\n                         Where's Dad?\n\n                                     FAY\n                         I don't know, honey. Leave me alone \n                         a minute, I gotta think.\n\n               He picks at the bedspread and looks at the ceiling, then...\n\n                                     NED\n                         Mom?\n\n                                     FAY\n                         What!\n\n                                     NED\n                         Is Dad in trouble?\n\n                                     FAY\n                         Yes, Ned, he is. He's in big trouble. \n                         Now just be quiet for two minutes.\n\n               He walks around to the other side of the bed and waits a \n               moment before...\n\n                                     NED\n                         Mom?\n\n                                     FAY\n                         I'm warning you, Ned.\n\n                                     NED\n                         Mom, can I be a mailman when I grow \n                         up?\n\n               Fay sits up, pauses and studies her son.\n\n                                     FAY\n                         Sure you can, honey. You can be \n                         anything you want.\n\n               Ned is happy to hear this. He shuffles out of the room and \n               Fay falls back on the bed.\n\n               INT. THE GRIM HOUSE KITCHEN -- DAY\n\n               Moments later.\n\n               Ned comes into the kitchen and digs through the drawers \n               beneath the sink. He finds an envelope. He reads the return \n               address: Chelsea Hotel, New York City.\n\n               EXT. SUBWAY -- DAY\n\n               Ned approaches the subway station and climbs the stairs to \n               the platform.\n\n               EXT. SUBWAY PLATFORM -- DAY\n\n               Moments later.\n\n               Ned runs up the stairs to the elevated platform just as a \n               train pulls into the station. He runs down a few cars and \n               hops in as the doors slide open.\n\n               INT. TRAIN -- DAY\n\n               Ned rides the train to New York City.\n\n               EXT. SUBWAY STOP -- DAY\n\n               Twenty minutes later.\n\n               He comes up out of the subway on to the street, looks around.\n\n               INT. HOTEL LOBBY -- DAY\n\n               He comes into the hotel and rings an annoying buzzer which \n               brings out the concierge, who is in his little office, \n               watching TV.\n\n                                     CONCIERGE\n                         Yeah, what do you want?\n\n                                     NED\n                         My uncle.\n\n                                     CONCIERGE\n                         What's his name?\n\n                                     NED\n                         Simon Grim.\n\n               The concierge looks through his book as Ned waits.\n\n                                     CONCIERGE\n                         There ain't no one here by that name.\n\n               Ned pulls the envelope from his pocket, unfolds it and shows \n               it to the concierge.\n\n                                     NED\n                         Room 423.\n\n               The concierge studies the envelope and hands it back.\n\n                                     CONCIERGE\n                         This is post marked five years ago.\n\n               Disappointed, Ned takes back the envelope and stands looking \n               at his sneakers.\n\n                                     CONCIERGE\n                         What does he look like?\n\n                                     NED\n                              (hopeless)\n                         I don't know.\n\n                                     CONCIERGE\n                         Sorry, kid. Can't help ya.\n\n               Ned steps away from the front desk and moves towards the \n               door. But then he stops and looks back at...\n\n               The concierge, sitting back in his office, returning his \n               attention to the TV set.\n\n               The boy heads for the elevator.\n\n               The concierge looks up and sees him.\n\n                                     CONCIERGE\n                              (jumping up)\n                         Hey!\n\n               Ned checks his step and runs for the service stairs.\n\n               The concierge goes after him.\n\n               INT. HOTEL STAIRCASE -- DAY\n\n               Moments later.\n\n               Ned runs up the stairs, the concierge in pursuit.\n\n               INT. HOTEL CORRIDOR -- DAY\n\n               Moments later.\n\n               Ned jumps out into the hall, narrowly escaping the clutches \n               of the concierge, who falls to the floor.\n\n               Ned runs up the hall, checking the room numbers as the \n               concierge gets to his feet. He finds...\n\n               Room 423.\n\n               He knocks.\n\n               The concierge strides up the hall towards him.\n\n               Ned knocks again.\n\n               The concierge bears down upon him.\n\n               He knocks again and...\n\n               The door opens a crack, held by its safety chain. A female \n               figure in silhouette is at the narrow gap.\n\n               Ned looks from the door to the concierge approaching.\n\n               The concierge arrives and reaches out for him, but the door \n               opens wide and Ned dives in.\n\n               INT. HOTEL ROOM 423 -- DAY\n\n               Same time.\n\n               The concierge stands in the hallway. The door swings shut in \n               his face.\n\n               Ned kneels on the floor of the hotel room, waiting to be \n               smacked, or something.\n\n               But when nothing happens, he opens his eyes and looks back \n               over his shoulder at...\n\n               Laura, the secretary from the publishing house. She is dressed \n               for travel and has her coat hung over her arm, a suitcase in \n               her hand. She smiles at him, then looks from the boy to \n               someone across the room and...\n\n               Ned follows her gaze to find...\n\n               Simon, standing there before him, a suitcase in his hand as \n               well. He looks down at Ned with a calm, intrigued expression.\n\n               The boy looks up at him in awe.\n\n               Simon steps forward, pauses, then...\n\n                                     SIMON\n                         Get up off your knees.\n\n               He does.\n\n               EXT. WORLD OF DONUTS -- DAY\n\n               A taxi pulls up. Simon and Ned climb out and Laura leans out \n               of the window.\n\n                                     LAURA\n                         Promise me you'll be on that plane \n                         at seven, Simon.\n\n                                     SIMON\n                         I'll see you in Stockholm.\n\n               They kiss. The taxi pulls away. Simon comes down beside Ned, \n               takes the boy by the shoulders and whispers in his ear.\n\n               The kid takes off.\n\n               Simon looks over at World of Donuts and sees Gnoc waiting \n               there at the door.\n\n               EXT. BEHIND WORLD OF DONUTS -- DAY\n\n               Gnoc leads Simon out through the kitchen. A band is seen \n               doing a sound check, inside.\n\n               Buñuel and Hawkes are waiting there, looking concerned.\n\n               Simon gives Buñuel his passport.\n\n               Buñuel nods and leaves.\n\n               Hawkes and Gnoc open the cellar doors.\n\n               INT. WORLD OF DONUTS BASEMENT -- DAY\n\n               Moments later.\n\n               Simon is lead down the stairs and stops. He looks on in horror \n               at...\n\n               Henry, lying on a makeshift bed, badly beaten up and weak. \n               Mr Deng is wrapping his chest in bandages.\n\n               Simon pauses, then comes closer. He reaches out and touches \n               Henry's shoulder, standing there looking down at his friend. \n               Henry looks up at him, pauses and then gestures vaguely with \n               his hand.\n\n                                     HENRY\n                         Look, Simon, the world's a scary \n                         place. I admit it. But it's not my \n                         fault. I swear!\n\n               Simon thinks about this and looks away.\n\n                                     SIMON\n                         I'm sorry, Henry.\n\n                                     HENRY\n                         Don't be. You had things to do.\n\n                                     SIMON\n                         So did you.\n\n               Henry thinks about that, sighs and looks away.\n\n               INT. THE GRIM HOUSE -- DAY\n\n               Fay packs up the many books of the 'Confession' into one of \n               the old suitcases Henry first came to town with. She slams \n               it shut.\n\n               EXT. THE GRIM HOUSE -- DAY\n\n               Ned runs along the street and stops at the police car. He \n               points down the street with great urgency. The cops jump in \n               their cars and take off. He then looks over at...\n\n               Fay, leaving the house with Henry's suitcase.\n\n               EXT. WORLD OF DONUTS BACK ALLEY -- DAY\n\n               Same time.\n\n               Buñuel backs his car into the alley behind World of Donuts. \n               Stepping out of the car he hands Simon back the passport.\n\n               Simon checks it and then looks up to see...\n\n               Father Hawkes and Mr Deng helping Henry outside. Coming out \n               into the daylight, he straightens up and manages to walk on \n               his own. He motions Ned over and leans down to the kid with \n               difficulty.\n\n                                     HENRY\n                         Gotta light?\n\n               Ned does. He has his own Zippo lighter and he proudly lights \n               his dad's cigarette.\n\n               Henry smokes, hugs Ned, then leans back and pauses. Finally...\n\n                                     HENRY\n                         Take care of your mom and don't start \n                         trouble you can't finish.\n\n               Ned nods and Henry pats him on the shoulder. Then he stands \n               before Fay and looks at his feet. With her arms folded across \n               her chest and her hip cocked, she taps her foot impatiently \n               and waits for his last line of crap.\n\n                                     HENRY\n                         I love you, Fay.\n\n                                     FAY\n                              (rolls her eyes)\n                         Yeah, well, tough.\n\n               But then she looks at him and softens. He leans in and kisses \n               her passionately on the mouth.\n\n               Moments later, they all help Henry into Buñuel's car and \n               Simon gets in behind the wheel. The doors slam shut and Simon \n               steers the car slowly up the alley. Henry gazes out at Fay \n               running along beside the car with the rest of the \n               neighborhood, some of them laughing, some of them crying...\n\n               EXT. AIRPORT TERMINAL -- DAY\n\n               Simon pulls up at the curb and jumps out. He helps Henry \n               climb out and together they enter the terminal.\n\n               INT. AIRLINE TICKET COUNTER -- DAY\n\n               Moments later.\n\n               Henry steps up.\n\n                                     AIRLINE TICKET CLERK\n                         Passport and ticket, please.\n\n               Henry hands them over. He glances back at...\n\n               Simon, waiting.\n\n               The clerk compares Henry to the picture in the passport, \n               checks again, then...\n\n                                     AIRLINE TICKET CLERK\n                              (recognizes)\n                         It's an honor to meet you, Mr Grim. \n                         Really. I mean, God. Congratulations \n                         on the Nobel Prize.\n\n                                     HENRY\n                         Thanks.\n\n                                     AIRLINE TICKET CLERK\n                         I know all your work by heart. It \n                         changed my life.\n\n                                     HENRY\n                         Yeah, well. Look, thanks, but..\n\n                                     AIRLINE TICKET CLERK\n                         Yes. Of course.\n\n               She types something more into the computer, then looks up \n               urgently.\n\n                                     AIRLINE TICKET CLERK\n                         You'll have to hurry, sir. They're \n                         holding the plane for you on the \n                         runway.\n\n               INT. AIRPORT GATE -- DAY\n\n               Moments later.\n\n               Airline representatives come rushing up with walkie-talkies \n               to meet Henry and Simon as they run through the terminal.\n\n                                     AIRLINE REP #1\n                         This way, please, this way! This \n                         way, Mr Grim! This way! Excuse me!\n\n               As they are ushered up towards the gate, Henry stops and \n               looks off at the security guards and ground crew waiting for \n               him, certain they can spot him as a wanted criminal.\n\n                                     SIMON\n                              (shoves him)\n                         Go on.\n\n               Henry is ushered through security. They take his ticket and \n               check his passport again. They take his suitcase and place \n               it on the conveyor belt. He passes through the metal detector. \n               They pass the metal detector wand over him and he stands \n               there with his hands outstretched, as...\n\n               Simon waits and watches.\n\n               The suitcase rolls out from the x-ray machine and as Henry \n               grabs it, he stops and looks across the security checkpoint \n               at...\n\n               Simon, standing there. He steps forward anxiously.\n\n               Henry lingers, speechless, but the airline representatives \n               are at his side...\n\n                                     AIRLINE REP\n                         Mr Grim, please, the plane is waiting! \n                         We have to hurry!\n\n               They drag him away, but Henry looks back as...\n\n               Simon stops and watches.\n\n               EXT. AIRPORT RUNWAY -- DAY\n\n               Moments later.\n\n               The plane is waiting out on the asphalt and the airline \n               representative runs straight for it, calling back over her \n               shoulder to Henry...\n\n                                     AIRLINE REP\n                         This way, Mr Grim! This way!\n\n               Runway technicians rush to their positions, but Henry hangs \n               back and struggles across the tarmac, looking back over his \n               shoulder at...\n\n               Simon, behind the huge plate glass window of the terminal.\n\n               He stops and waits.\n\n               Simon raises his hand in farewell and...\n\n               Henry raises his in reply.\n\n               Then Simon, unheard behind the gigantic glass wall, silent \n               amongst the roar of the runway, says...\n\n                                     SIMON\n                              (unheard)\n                         Run.\n\n               And Henry understands. He lowers his hand, waits just a \n               moment, then turns and looks out at...\n\n               The airplane. The airline representative is shouting at him \n               from the foot of the stairs and waving him on with her walkie-\n               talkie.\n\n               He glances back once more at Simon. Then...\n\n               Henry is running, struggling towards us, forcing himself \n               towards the plane, getting stronger and running faster with \n               every step he takes.\n\n                                                               CUT TO BLACK\n\n                                         THE END\n\n\n\n\n\n\nHenry Fool\nWriters :   Hal Hartley\nGenres :   Comedy  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:26:52.391352"}