{"title": "Hollow Man", "film_link": "/Movie Scripts/Hollow Man Script.html", "script_link": "/scripts/Hollow-Man.html", "info_raw": "\n\nHollow Man Script\n\n\n\n\nIMSDb opinion  Not bad.\nIMSDb rating   (6 out of 10)\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gary Scott Thompson  Andrew W. Marlowe\nGenres  Horror  Sci-Fi  Thriller\nScript Date : June 1998\n\nRead \"Hollow Man\" Script\n\n\n", "script": "\nThe Hollow Man\n\n\n\t\t\t\twritten by Andrew W. Marlowe\n\t\t\t\t\t\t\t\t  Red Wagon \nProds. \n\t\t\t\t\t\t\t\tRevised Draft \n6/26/98\n\n\tFADE IN:\n\tOn complete darkness.\n\tA SMALL DOOR swings open.\n\tA circle of light reveals that we I re looking down the \n\tlength of a tube. At the far end of the tube, we see a \n\tgloved hand dangling a rat. The hand shoves the \n\tfrightened rat into the tube and closes the door behind \n\tit. The rat s stark white fur bristles and it begins to \n\tpad down the tube s length.\n\tAfter several feet, the tube opens up into a dimly lit \n\tcubicle. The rat hesitates and stops.\n\tThe SOUNDS of gentle BREATHING whispers in the rat s \n\tears.\n\tThe rat turns round to head back down the tube, but a \n\tdoor swings shut, trapping it in the cubicle.\n\tThe rat cowers as the BREATHING turns to SNORTING.\n\tThe rat s head jerks around, looking for signs of danger, \n\tbut the cubicle is empty. The rat sees a water dish on \n\tthe far side of the cubicle - a place to hide - and \n\tdashes toward it.\n\tBut an invisible force descends.\n\tThe rat squeals in agony as something smashes down on its \n\tbody, crushing it.\n\tA LOUD BELLOW rings out, and the rat flies into the air, \n\thalting a few feet off the ground. Its body writhes, \n\tstruggling against the unholy force.\n\tThen a sick crunch of tiny bones snapping. All life \n\tquickly drains from the levitating body. Dead eyes...\n\tThe creature s corpse floats in mid-air. Then the white \n\tfur of the rat explodes in a shower of blood.\n\tHUGE BLOOD SMEARED INCISORS appear, as do the red-slicked \n\tape- like lips. The gaping bloody mouth bites again into \n\tthe rat.\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\tINT. BEDROOM - NIGHT\n\tIn the background we hear Jay Leno s monologue from the \n\tTonight Show. A small lamp and the glow from a computer \n\tscreen illuminates SEBASTIAN CAINE, late twenties with \n\tthe shabby good looks of a perpetual grad-student. Wiry \n\tframed and wearing only boxer shorts, Sebastian sips \n\tcoffee from an  Einstein  coffee mug. He peers at a \n\tcomplex computer rendered molecule displayed on his \n\tscreen. He pecks a few keys and the molecule shifts \n\tslightly, then falls apart.\n\tSebastian pulls a twinkie from a hostess box, unwraps the \n\tcellophane and sucks it down. He attacks the keyboard \n\twith renewed vigor.\n\tAnother molecule appears on the screen. Sebastian s \n\tfingers fly across the keyboard. The molecule blinks on \n\tand off, it trembles and twists apart.\n\t\t\t\tSEBASTIAN\n\t\t\tDamnit.\n\tSebastian pears out his window. Across the courtyard, a \n\tlight comes on in a neighboring window. He sees a \n\tBRUNETTE, mid-twenties, absolutely stunning, enter her \n\tliving room. The Brunette thumbs through the mail, tosses \n\tit and then begins to undress. Sebastian loans over to \n\tthe window, getting interested. But when the brunette \n\treaches her bra and panties, she crosses to the window \n\tand lowers her shades.\n\t\t\t\tSEBASTIAN (cont d)\n\t\t\tDamnit.\n\tSebastian leans back in his chair and closes his eyes. \n\tHe s obviously tired. He opens his eyes and stares up at \n\tthe ceiling. Painted across the white matte finish in big \n\tred letters is a brief reminder -  You Should Be \n\tWorking.  Sebastian sighs, leans forward and begins \n\tpecking away again.\n\t\t\t\t\t\t\t\t\t\t \nLATER:\n\tThe television is now only static. We pan by his alarm \n\tclock. 4 am. We find Sebastian pacing in front of his \n\tcomputer.\n\tHe gets an idea... slides back in his chair. Types away \n\tagain. The molecule reforms on the computer screen.\n\tHe types a few more keys, waits, watches the molecule. \n\tNothing happens.\n\tHe hits a few more keys and watches intently for a \n\treaction.\n\t\t\t\tSEBASTIAN\n\t\t\t\t (beat)\n\t\t\tI am a goddamn genius.\n\tHe hits a few more keys and a telephone keypad appears on \n\tthe screen. He dials.\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\tINT. ANOTHER BEDROOM - NIGHT\n\tDigital phone rings.\n\tIn the bed, LINDA FOSTER, late twenties, stirs from a \n\tdeep sleep. As she straggles out of bed and over to her \n\tdesk, we notice a young man sleeping next to her.\n\tThe ringing continues. She moves her computer mouse \n\taround and her screen comes to life. She click on a \n\ttelephone icon and the ringing stops. A beat later, \n\tSebastian appears in a window on her screen.\n\t\t\t\tLINDA\n\t\t\tSebastian, do you know what time it \n\t\t\tis?\n\t\t\t\tSEBASTIAN (SCREEN)\n\t\t\tYou know Da Vinci never slept. Said it \n\t\t\twas waste of time.\n\t\t\t\tLINDA\n\t\t\tWhat is it this time?\n\tINTERCUT: SEBASTIAN S BEDROOM\n\tSebastian peers at the image of Linda in the computer \n\twindow. He notices something behind her in the bed, the \n\tyoung man sleeping face down.\n\t\t\t\tSEBASTIAN\n\t\t\tWho s that?\n\tLinda pulls the camera off the top of the of the computer \n\tscreen and positions it so Sebastian can t see the bed.\n\t\t\t\tLINDA\n\t\t\tNot your business. Not anymore.\n\t\t\t\tSEBASTIAN\n\t\t\tTouche.\n\t\t\t\tLINDA\n\t\t\tSo you calling about anything in \n\t\t\tparticular, or were you just hoping to \n\t\t\tcatch me sleeping in the nude?\n\t\t\t\tSEBASTIAN\n\t\t\tI cracked the reversion.\n\tUpon hearing this, Linda receives a jolt of adrenaline.\n\t\t\t\tLINDA\n\t\t\tYou cracked it?\n\t\t\t\tSEBASTIAN\n\t\t\tLook at this. \n\tSebastian hits a couple of keys. A moment later the \n\tmolecular structure appears on Linda s computer.\n\t\t\t\tSEBASTIAN\n\t\t\tWatch this.\n\t\t\t\tLINDA\n\t\t\tYou sure?\n\t\t\t\tSEBASTIAN\n\t\t\t91% sure.\n\t\t\t\tLINDA\n\t\t\t\t (astonished)\n\t\t\tEleven months with no progress and you \n\t\t\tsuddenly come up with it out of the \n\t\t\tblue? How?\n\t\t\t\tSEBASTIAN\n\t\t\tThe usual. Coffee and twinkies.\n\t\t\t\tLINDA\n\t\t\tI hate you.\n\t\t\t\tSEBASTIAN\n\t\t\tI know. You think you could hunt down \n\t\t\tMatt and get to the lab early. I want \n\t\t\tIsabelle prepped for a live test.\n\t\t\t\tLINDA\n\t\t\tYeah, I think I can find him. What are \n\t\t\tyou going to do?\n\t\t\t\tSEBASTIAN\n\t\t\tWell y know. It s daylight in \n\t\t\tSwitzerland. I gotta call the Nobel\n\t\t\tCommittee and tell them to get our\n\t\t\tprizes ready. See you in a few.\n\tON LINDA S COMPUTER SCREEN as Sebastian clicks off. Linda \n\tcrosses to her bed, and shakes the guy awake.\n\t\t\t\tLINDA\n\t\t\tHey... come on.\n\tDR. MATTHEW KENSINGTON, late 20s too, stirs from under \n\tsheets.\n\t\t\t\tMATT\n\t\t\t\t (groggy)\n\t\t\tWhat?\n\t\t\t\tLINDA\n\t\t\tSebastian just called. We gotta get to \n\t\t\tthe lab.\n\tMatt bolts up.\n\t\t\t\tMATT\n\t\t\tShit! You didn t tell him I was here, \n\t\t\tdid you?\n\t\t\t\tLINDA\n\t\t\tGive me some credit, will ya.\n\t\t\t\tMATT\n\t\t\tSo what s the rush?\n\t\t\t\tLINDA\n\t\t\tHe cracked reversion.\n\tMatt pulls his jeans on.\n\t\t\t\tMATT\n\t\t\tWanna ride down?\n\t\t\t\tLINDA\n\t\t\tWe better take our own cars.\n\t\t\t\tMATT\n\t\t\tYou re gonna have to tell him about us \n\t\t\teventually.\n\t\t\t\tLINDA\n\t\t\tI know. It s just You re his best \n\t\t\tfriend. He ll feel betrayed.\n\tEXT. WASHINGTON D.C. SKYLINE - DAY\n\tFrom a distance, the Nation s Monuments stand awash in \n\tthe harsh light of morning.\n\tCAMERA finds a BLACK PORSCHE as it pulls to the security \n\tfence of a warehouse. The imposing structure is \n\tsurrounded by a chainlink fence and barbed wire.\n\tThe Porsche is waved through security and heads straight \n\tinto the warehouse.\n\tINT. WAREHOUSE -DAY\n\tThe Porsche pulls to a halt in a reserved parking space \n\tand Sebastian exits, wearing a Hawaiian shirt, shorts, \n\tand Birkenstocks. He notes the other cars parked in the \n\tlot, then crosses to bunker in the center of the \n\twarehouse, guarded by a MARINE, shouldering an M-16.\n\t\t\t\tMARINE GUARD\n\t\t\tMorning, sir.\n\t\t\t\tSEBASTIAN\n\t\t\tMorning, Ed.\n\t\t\t\tMARINE GUARD\n\t\t\tYour team s in early. Something \n\t\t\tspecial going on?\n\t\t\t\tSEBASTIAN\n\t\t\tSorry, Ed. You know the rules. \n\tSebastian presses his thumb against a glass screen. A \n\tlaser reads his print. \n\tScan readout: CAINE, SEBASTIAN \n\tClearance:    ALPHA ALPHA THREE \n\tDivision:\tCLASSIFIED \n\tThe doors whisk open and Sebastian steps inside.\n\t\t\t\tMARINE GUARD\n\t\t\tHave a good day, sir.\n\tINT. ELEVATOR - DAY\n\tInside the elevator is a numberless keypad. Sebastian \n\ttaps in his floor code.\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization please.\n\t\t\t\tSEBASTIAN\n\t\t\tCaine zero zero two seven.\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization verified. Good morning, \n\t\t\tDr. Caine. \n\tThe elevator descends with a groaning hum. It passes \n\tbelow us and keeps descending into the belly of the \n\tearth, the shaft goes down forever.\n\tINT. HABITAT S CORRIDOR\n\tWe slowly push down a hallway panelled by Plexiglas \n\tchambers. Each chamber looks as if it s tailored for a \n\tspecific animal, although no animals are visible.\n\tAs we pass one habitat, something slams into the \n\tPlexiglas and begins barking. Another HOWL joins in. Then \n\tSCREECHING. Suddenly the hallway fills with a dozen \n\tanimal cries. THUMP.\n\tTHUMP.\n\tThe Plexiglas on several chambers vibrates as if angry \n\tanimals were slamming against it. But still, no animals \n\tare seen.\n\tAbove each chamber, VIDEO SCREENS display THERMAL IMAGES \n\trevealing heat signatures of the various animals, but \n\tthey remain invisible to the naked eye. MATT taps on a \n\tsheet of Plexiglas which seals off another seemingly \n\tempty cage.\n\t\t\t\tMATT\n\t\t\tIsabelle ...\n\tThe woodchips on the floor shift and suddenly the \n\tPlexiglas steams up right in front of Matt s face. The \n\tPlexiglas begins to shake violently.\n\t\t\t\tMATT (cont d)\n\t\t\tCalm down baby. Calm down. It s \n\t\t\tokay...\n\tMatt takes a pair of thermal goggles from his belt and \n\tpulls them down over his eyes. \n\tTHERMAL POV - A rather large heat signature, ape-like in \n\tshape, rattles about the cage. Matt slowly unlatches the \n\tPlexiglas door and reaches inside.\n\t\t\t\tMATT (cont d)\n\t\t\tIt s okay, baby. It s okay. I m not \n\t\t\tgoing to hurt you. Come here.\n\tTHERMAL POV - he reaches out to the creature. He grabs \n\thold of it, firmly. Stroking it. The creature COOS. Matt \n\treaches for a hypo and brings it up to the creature.\n\t\t\t\tMATT (cont d)\n\t\t\tJust hold still. \n\tSomething clamps down on his hand, breaking his skin. \n\tBlood erupts in a bite pattern.\n\t\t\t\tMATT (cont d)\n\t\t\t Ow, shit.\n\tMatt drops the hypo and falls back. The cage door flies \n\topen and something runs out. Matt pulls himself up to see \n\tthe heat signature running down the hallway. He turns \n\taround to see another heat signature coming at him. Matt \n\tpulls off his goggles to see Linda coming up the \n\tCorridor.\n\t\t\t\tLINDA\n\t\t\tYou okay?\n\t\t\t\tMATT\n\t\t\tShe bit me.\n\t\t\t\tLINDA\n\t\t\tYeah. She s become a lot more \n\t\t\taggressive in the last few days.\n\tLinda takes the goggles from Matt.\n\t\t\t\tLINDA (cont d)\n\t\t\tGo take care of that bite. I ll get \n\t\t\ther.\n\t\t\t\tMATT\n\t\t\tAnd give you a chance to pull ahead? \n\t\t\tNever.\n\tLinda opens a lock-box at the end of the hallway and \n\tpulls out a two tranquilizer guns. She hands one to Matt.\n\tAROUND THE CORNER\n\tA slight distortion shimmers as something runs past us. \n\tWe hear HOOTS and FOOTSTEPS.\n\tLooking down the shadowy corridor, we hear grunting and a \n\thaunting heavy breathing. The control door is closed \n\tthough and something large and angry is throwing itself \n\tagainst it. We can t see anything.\n\tA few moments later, Linda and Matt round the corner, \n\twearing goggles and leveling their pistols.\n\t\t\t\tMATT\n\t\t\t\t (ala Porky)\n\t\t\tShh. Be vewy, vewy quiet. I m hunting \n\t\t\tsimians.   heheheheh.\n\t\t\t\tLINDA\n\t\t\tKnock it off.\n\t\t\t\t (soothing voice)\n\t\t\tIsabelle!\n\tTHERMAL POV - Dark hallway. Movement. A red shimmering \n\theat signature. It comes running at Linda. HOWLING. Linda \n\tfires. A T-DART flies. Thwack... It stops in mid-air. \n\tThen falls. But it doesn t hit the floor. Instead, it \n\tstops inches above the ground. \n\tTHERMAL POV - the heat signature lies in a heap at \n\tLinda s feet.\n\t\t\t\tMATT\n\t\t\tGood shootin , Tex.\n\t\t\t\tLINDA\n\t\t\tWhat s that make it?\n\t\t\t\tMATT\n\t\t\tI m still ahead. 6 to 5.\n\tLike a smug gunfighter, Linda blows imaginary smoke from \n\tthe top of her tranquilizer gun.\n\t\t\t\tLINDA\n\t\t\tBut I m catching up.\n\tINT. CORRIDOR - DAY\n\tThe elevator doors open and Sebastian steps out. He s met \n\tby SARAH KENNEDY, early thirties, a fiery red-head.\n\t\t\t\tSARAH\n\t\t\tCan I have a word?\n\t\t\t\tSEBASTIAN\n\t\t\tMost normal people say good morning.\n\t\t\t\tSARAH\n\t\t\tDon t you think you should test the \n\t\t\tprotocol on the liver samples before \n\t\t\tyou inject Isabelle?\n\t\t\t\tSEBASTIAN\n\t\t\tHow many tissue samples have we \n\t\t\tsuccessfully regressed? Hundreds, \n\t\t\tright? How many have gone on to work \n\t\t\ton the full system? None.\n\t\t\t\tSARAH\n\t\t\tThat s beside the point.\n\t\t\t\tSEBASTIAN\n\t\t\tNo, that is the point. I m not going \n\t\t\tto waste six months of my life on an \n\t\t\toutmoded testing procedure. This thing \n\t\t\tworks. I know it. I feel it.\n\tLinda comes down the corridor, listening in on the tail \n\tend of the conversation.\n\t\t\t\tSARAH\n\t\t\tFine. You can mop up afterward.\n\t\t\t\tSEBASTIAN\n\t\t\tYou think I m going to kill Isabelle?\n\t\t\t\tSARAH\n\t\t\tKill? More like liquefy.\n\t\t\t\tSEBASTIAN\n\t\t\tSarah, thank you for your opinion, but \n\t\t\tI m the project leader. Understand? \n\tShe says ...\n\t\t\t\tSARAH\n\t\t\tYes, Sir.\n\t... but somehow it feels like  Fuck you.  She storms off. \n\tSebastian turns to Linda.\n\t\t\t\tSEBASTIAN\n\t\t\tHow did you ever convince me to hire \n\t\t\ther?\n\t\t\t\tLINDA\n\t\t\tYou said you wanted the beat vet in \n\t\t\tthe country.\n\t\t\t\tSEBASTIAN\n\t\t\tYeah, well she cares more about the \n\t\t\tanimals than the research.\n\t\t\t\tLINDA\n\t\t\tMaybe that s why she s so good.\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\tCLOSE ON: MATT as he shuts off the spinning cyclotron. As \n\tit s spinning slows to a halt, he pops the top and \n\treaches in, removing...\n\tA GLOWING VIAL OF ORANGE LIQUID.\n\tSebastian peers at the vial.\n\t\t\t\tSEBASTIAN\n\t\t\tWho da Man? You da Man.\n\t\t\t\tMATT\n\t\t\tAs we pull out we see we are.\n\tINT. LABORATORY - DAY\n\tAlmost feels like a dungeon. Think high-tech \n\tFrankenstein. Walls lined with video displays, technical \n\treadouts, bizarre medical equipment.\n\tOn a table in the middle of the room, a sheet drapes over \n\ta humanoid form, strapped down at it s invisible limbs. \n\tThe straps move slightly... ghostly. Wires lead from the \n\tbody to lots of machinery.\n\t\t\t\tMATT\n\t\t\tProtocol is hot.\n\t\t\t\tSEBASTIAN\n\t\t\tVitals?\n\tSarah, checks over the various readouts ... heartbeat, \n\tblood pressure, the rest.\n\t\t\t\tSARAH\n\t\t\tNormal.\n\tCARTER ABBEY, the late thirties lab assistant, wheels in \n\ta cart of equipment. Linda taken a seat by the table and \n\tpushes aside the sheet.\n\t\t\t\tBOOMING VOICE\n\t\t\tTHIS IS GOD. YOU ARE DISTURBING THE\n\t\t\tNATURAL ORDER OF THINGS AND WILL BE\n\t\t\tSEVERELY PUNISHED FOR ALL ETERNITY.\n\t\t\tGOD HAS SPOKEN.\n\t\t\t\tSEBASTIAN\n\t\t\tHow many times do I have to tell you, \n\t\t\tFrank you aren t God.\n\t\t\t\t (beat)\n\t\t\tI am.\n\t\t\t\tFRANK (LOUDSPEAKER)\n\t\t\tSorry, Boss. Forgot.\n\tSebastian glance up at a glass booth overlooking the \n\tLaboratory floor. TWO PEOPLE in the booth.\n\t\t\t\tSEBASTIAN\n\t\t\tYou guys ready to roll?\n\tINT. OBSERVATION BOOTH\n\tFRANK CHASE, early thirties, and tech expert JANICE \n\tWALTON, early twenties, man a small booth above the lab. \n\tThey re dressed more like band roadies than scientists.\n\tThe room is crammed with electronic and recording \n\tequipment. A handful of monitors display different images \n\tof the lab. Thermal and regular video. Another screen \n\tmonitors vital signs.\n\t\t\t\tFRANK\n\t\t\tWe are live and in color. On your \n\t\t\tmark.\n\tFrank and Janice looks down on their colleagues. \n\tSebastian nods their way.\n\t\t\t\tSEBASTIAN\n\t\t\tOkay. Roll  em.\n\t\t\t\tJANICE\n\t\t\tOkay. We are rolling record on videos \n\t\t\tone through twelve.\n\tFrank hits a series of buttons and speaks into a \n\tmicrophone. Recording.\n\tINT. LABORATORY - DAY\n\tFrank s voice echoes through the chamber.\n\t\t\t\tFRANK (V.O.)\n\t\t\tSubject Isabelle Two. Currently in \n\t\t\tphase shift... one hundred twenty six \n\t\t\tdays, eighteen hours.\n\t\t\t\tLINDA\n\t\t\tTesting De-Phase protocol. Injecting \n\t\t\tserial protein Caine One Two Five. \n\tLinda removes a glowing vial of orange liquid from a \n\tcentrifuge nearby.\n\t\t\t\tMATT\n\t\t\tMaybe if you stopped naming them after \n\t\t\tyourself, you d have better luck.\n\t\t\t\tSEBASTIAN\n\t\t\tWhy thank you, Dr. Kensington, for \n\t\t\tthat keen scientific observation. I ll \n\t\t\tbe sure to include it in my memoirs.\n\t\t\t\tMATT\n\t\t\tA whole mention? And I thought I was \n\t\t\tjust gonna be a footnote.\n\tMatt unwraps a hypodermic needle and jabs the needle into \n\tthe vial, drawing up the colored liquid.\n\tINT. OBSERVATION BOOTH\n\t\t\t\tMATT\n\t\t\tOkay.\n\tFrank and Janice monitor Isabelle s vitals.\n\tINT. LABORATORY - DAY\n\tTension in the air.\n\t\t\t\tSEBASTIAN\n\t\t\t\t (to Linda)\n\t\t\tReady.\n\tShe wraps a bungee cord around nothing and pulls it \n\ttight. She then takes some dye and sprays it. A surface \n\tappears, floating beneath the restraints. It sheens in \n\tthe light as Linda searches for a vein. She slaps the \n\tsurface several times. A small bulge appears, like a \n\tvein.\n\t\t\t\tLINDA\n\t\t\tPropped.\n\t\t\t\tMATT\n\t\t\tLet s make some history.\n\tMatt lowers the hypo to the vein. But Sebastian takes the \n\thypo from Matt s hand.\n\t\t\t\tSEBASTIAN\n\t\t\tNice try, Sparky.\n\tMatt relinquishes the needle.\n\t\t\t\tLINDA\n\t\t\tCome on, Isabelle. You can do this. \n\tSebastian lowers the hypo. The skin bonds and gives. The \n\tneedle remains in sight after it slips through the \n\tvisible surface. Matt presses down on the hypo plunger, \n\treleasing a dye into his bloodstream. The gold liquid \n\ttwists into a long snaking tube up and down the limb. \n\tIt s the shape of a vein. The liquid begins to react. \n\tSmall flashes of light blip up and down the strand of \n\tcolor. Ba-bump.. ba-bump... the heartbeat starts to speed \n\tup.\n\t\t\t\tSARAH\n\t\t\tElevated heartbeat.\n\tINT. OBSERVATION BOOTH\n\tJanice analyzes the screens.\n\t\t\t\tJANICE\n\t\t\tWe re still in the green.\n\t\t\t\tFRANK\n\t\t\tConfirmed. Vitals still in the normal \n\t\t\trange.\n\tINT. LABORATORY\n\tThe glowing liquid turns from gold to red as the complex \n\twebbing of a bloodstream appears.\n\t\t\t\tMATT\n\t\t\tIt s reacting.\n\tSpreading out from the bloodstream, soon becomes \n\tvisible.. the shadow of a skeletal system.\n\t\t\t\tSEBASTIAN\n\t\t\tDo you see this?\n\t\t\t\tLINDA\n\t\t\tIt s working. It s actually working. \n\tMatt pulls the sheet back. Muscles are beginning to \n\tappear. And eyeballs. Frightened eyeballs.\n\t\t\t\tSARAH\n\t\t\tHeart rate s up. She s scared.\n\tSarah soothes her.\n\t\t\t\tSARAH (cont d)\n\t\t\tIt's okay, baby. It's okay.\n\t\t\t\tSEBASTIAN\n\t\t\tSubject began manifesting almost \n\t\t\tImmediately. Protocol is reacting \n\t\t\tquickly.\n\tIsabelle starts to struggle against her restraints. She \n\tbegins to howl.\n\t\t\t\tLINDA\n\t\t\tSubject may be in pain or extreme \n\t\t\tdiscomfort.\n\t\t\t\tSARAH\n\t\t\tGoddamnit. Blood pressure elevating. \n\t\t\tBrain activity going through the roof. \n\tThe brain appears, seemingly growing from the inside out. \n\tThe shape of a large half-formed monkey grows from the \n\tinside out. A SKULL APPEARS howling in pain, in horror.\n\t\t\t\tSARAH (cont d)\n\t\t\tWe ve got a problem.\n\t\t\t\tSEBASTIAN\n\t\t\tWhat? What problem!\n\tSarah checks her monitors.\n\t\t\t\tSARAH\n\t\t\tIt s her heart. We can see the heart \n\t\t\tbeating in the ape s\n\t\t\t\tFRANK (V.0.)\n\t\t\tI got an erratic heart beat.\n\t\t\t\tSARAH\n\t\t\tShe s going into cardiac arrest.\n\t\t\t\tLINDA\n\t\t\tGot the crash cart.\n\tCarter charges the crash cart and rolls it in.\n\t\t\t\tSARAH\n\t\t\tWe re losing her.\n\tHer machine flatlines.\n\t\t\t\tSEBASTIAN\n\t\t\tNo! It s got to work.\n\tThe body is only half there. It looks as if its caught in \n\tdecomposition. Linda rubs the cardiac paddles together.\n\t\t\t\tLINDA\n\t\t\tClear!\n\tLinda slams the paddles on the monkey s chest. The jolt \n\tof electricity makes the monkey visible again for a brief \n\tmoment. Then the skin and flesh fade away again.\n\t\t\t\tSARAH\n\t\t\tWe ve got something!\n\tThe heartbeat starts up again. The body continues its \n\tmarch toward,visibility.\n\t\t\t\tSARAH (cont d)\n\t\t\tStill. erratic.\n\t\t\t\tLINDA\n\t\t\tCome on Isabelle. Come on. You can do \n\t\t\tit. You can fucking do it.\n\tEverybody s pulling for her.\n\t\t\t\tSARAH\n\t\t\tCome on, monkey.\n\t\t\t\tMATT\n\t\t\tDo it. Do it. Come on.\n\tMuscles spread like a rash on bone as the monkey twists \n\tand turns, frightened. Then skin. The monkey howls. Skin \n\tforms over the muscles reappearing like it was being \n\tpainted on before our eyes.\n\t\t\t\tSARAH\n\t\t\tStabilizing.\n\tThe entire form glows, then blinks, then glows again, as \n\tif it was discharging some stored energy.\n\t\t\t\tFRANK (V.0.)\n\t\t\tBrain activity returning to normal.\n\tThe monkey grunts and groans. Blinks its eyes. Linda \n\thovers over it stroking its fur.\n\t\t\t\tLINDA\n\t\t\tWelcome back, Isabelle.\n\tSebastian puts his hand on Linda s shoulder... a move \n\tthat does not go unnoticed by Matt. We did it.\n\t\t\t\tSEBASTIAN\n\t\t\t\t (beat)\n\t\t\tHow is she?\n\t\t\t\tSARAH\n\t\t\t\t (surprised)\n\t\t\tI think she s gonna be okay\n\t\t\t\t\t\t\t\t\n\tDISSOLVE TO:\n\n\tINT. HABITAT\n\n\tFrank, Matt, Sarah, Janice and Linda watch Isabelle rise \n\tand walk about the cage. She goes over to the other \n\tmonkeys and joins in their grooming rituals.\n\n\t\t\t\tCARTER\n\t\t\tAmazing. She's normal, absolutely \n\t\t\thealthy. If you didn't know any \n\t\t\tbetter, you'd think nothing had \n\t\t\thappened to her.\n\n\t\t\t\tMATT\n\t\t\t\t (ribbing Sarah)\n\t\t\tYeah. I can't wait to slice up her \n\t\t\tbrain and trace her neural pathways.\n\n\t\t\t\tSARAH\n\t\t\tScrew you, Matt.\n\n\t\t\t\tMATT\n\t\t\tWell maybe not right away.\n\n\t\t\t\tLINDA\n\t\t\tWe should celebrate.\n\n\tINT. RESTAURANT - NIGHT\n\n\tThe fanciest one in D.C.\n\n\tThe entire eight person team sits around a round table, \n\tdrunk and laughing, as the last champagne flute is \n\tfilled.\n\n\tSebastian raises his glass.\n\n\t\t\t\tSEBASTIAN\n\t\t\tTo the finest research team I've ever \n\t\t\tknown.\n\n\tA round of \"Hear, hears\" and they all clink glasses and \n\tdrink.\n\n\tEXT. RESTAURANT BALCONY - LATER\n\n\tThe din of the diners fades away as Linda slips out onto \n\tthe restaurant's balcony. She find Sebastian leaning \n\tagainst a railing, breathing in the night air.\n\n\t\t\t\tSEBASTIAN\n\t\t\tHey...\n\n\t\t\t\tLINDA\n\t\t\tI thought you'd gone.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWhere would I go?\n\n\tHe looks out over the sweep of the city, the twinkling \n\tlights of D.C. and darkness of the Potomac river.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tTwenty years ago there were no \n\t\t\tcomputers, no fax machines, no cell \n\t\t\tphones. I was just wondering what the \n\t\t\tworld will be like twenty years from \n\t\t\tnow... if what we're doing will change \n\t\t\teverything.\n\n\t\t\t\tLINDA\n\t\t\tA little \"I am become death... the \n\t\t\tshatterer of worlds\"?\n\n\t\t\t\tSEBASTIAN\n\t\t\tSomething like that.\n\n\t\t\t\tLINDA\n\t\t\tSince the day I met, all you wanted to \n\t\t\tdo was change the world.\n\n\tShe puts her hand on his shoulder.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tListen, I know we've... I mean... well \n\t\t\t... I just want you to know how proud \n\t\t\tI am of you. I know it probably \n\t\t\tdoesn't mean a lot...\n\n\t\t\t\tSEBASTIAN\n\t\t\tActually it does.\n\t\t\t\t (beat)\n\t\t\tI guess since you were there from the \n\t\t\tbeginning, you know me better than \n\t\t\tanyone else on this godforsaken \n\t\t\tplanet.\n\n\t\t\t\tLINDA\n\t\t\tYou're positively maudlin. You should \n\t\t\tbe happy. Do you have any idea what \n\t\t\tyou've accomplished?\n\n\t\t\t\tSEBASTIAN\n\t\t\tYeah... but I was working so hard, I \n\t\t\tdidn't realize I'd have no one to \n\t\t\tshare it with.\n\n\tSebastian heads back inside. But he stops and turns back.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tI don't suppose we could turn back the \n\t\t\tclock for a night and you could come \n\t\t\thome with me?\n\n\tHer look says it all. Too much water under the bridge.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tRight. Sorry. Too much champagne.\n\n\tHe turns and heads back into the party. As he heads in he \n\tpasses Matt heading out. He and Sebastian exchange \n\t\"Heys\".\n\n\t\t\t\tMATT\n\t\t\tWhat was that about?\n\n\t\t\t\tLINDA\n\t\t\tNothing. It's just... He is who he is. \n\t\t\tSometimes I just have to be reminded.\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tINT. LABORATORY - NIGHT\n\n\tSebastian wanders through the empty hallways of the \n\tlaboratory.\n\n\tINT. HALLWAY OF HABITATS - NIGHT\n\n\tSebastian paces back and forth, examining the habitats. \n\tHe taps on the Plexiglas of one. The cubicle explodes \n\twith\n\n\tBARKING.\n\n\tWe see the Plexi steam up in one part, as if something \n\twas breathing on it. As if a nose were pressed against \n\tit.\n\n\t\t\t\tSEBASTIAN\n\t\t\t\t (a little drunk)\n\t\t\tWhat's it like? Talk goddamnit! Tell \n\t\t\tme what it's like!\n\n\t\t\t\t\t\t\t\t\n\tDISSOLVE TO:\n\n\tEXT. PENTAGON - DAY\n\n\tFlying over Washington D. C. , we cross the Potomac and \n\tcircle the five-cornered building, looking particularly \n\tgloomy on this grey day.\n\n\t\t\t\tSEBASTIAN (V.0.)\n\t\t\tSix years ago, this committee \n\t\t\tcommissioned me with a very specific \n\t\t\ttask...\n\n\tINT. PENTAGON CONFERENCE ROOM - DAY\n\n\tAt the table are six men. A handful of senior military \n\tbrass and top civilian advisors direct their attention to \n\tthe front of the room, where Sebastian, flanked by Matt \n\tand Linda, is in the middle of his presentation.\n\n\t\t\t\tSEBASTIAN\n\t\t\tTo successful phase-shift a human \n\t\t\tbeing out of quantum sync with the \n\t\t\tvisible universe and then return him \n\t\t\tsafely, with no after affects.\n\n\tNext to Sebastian a video shows a small monkey shifting \n\tfrom the visible spectrum. It's hair, skin, organs and \n\tskeletons slowly dissolve before our eyes.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tWell, we found out sending them to \n\t\t\t\"never-never-land\" was easy, it's the \n\t\t\tgetting back that's hard.\n\n\tSebastian fast forwards a few moments until the video \n\tscreen shows the bizarrely tangled heap of flesh and bone \n\tthat used to be alive.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tEvery time we've tried to bring a test \n\t\t\tsubject back from phase-shift. \n\t\t\tCellular bonds would dissolve, the \n\t\t\tprimary DNA strands would decay. But \n\t\t\tnow...\n\n\tSebastian pauses. Something's bothering him.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tBut now...\n\n\tOne of the senior advisers, DR. HARRY KRAMER, \n\tdistinguished 50s, finally breaks the silence.\n\n\t\t\t\tKRAMER\n\t\t\tBut now?\n\n\tLinda and Matt look up at Sebastian expectantly.\n\n\t\t\t\tSEBASTIAN (CONT'D)\n\t\t\tBut now...\n\t\t\t\t (pause)\n\t\t\tBut now, we feel we are closer than \n\t\t\tever to resolving this issue. We've \n\t\t\tbeen experimenting with a new \n\t\t\tregression formula that looks rather \n\t\t\tpromising.\n\t\t\tA FOUR STAR GENERAL leans forward.\n\n\t\t\t\tGENERAL\n\t\t\tHow long?\n\n\t\t\t\tSEBASTIAN\n\t\t\tSir?\n\n\t\t\t\tGENERAL\n\t\t\tSon, as you can imagine, we are very \n\t\t\tanxious to field test this tactical \n\t\t\tasset. How long till you resolve this \n\t\t\tissue?\n\n\tLinda starts to speak, but Sebastian cuts her off with a \n\tlook.\n\n\t\t\t\tSEBASTIAN\n\t\t\tShouldn't be more than another year, \n\t\t\tSir.\n\n\tFrustrated sighs all around the room.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tMaybe sooner.\n\n\tEXT. PENTAGON - DAY\n\n\tAs Linda, Matt and Sebastian head to their cars.\n\n\t\t\t\tMATT\n\t\t\tYo. Reality check! What the hell was \n\t\t\tthat about?\n\n\t\t\t\tSEBASTIAN\n\t\t\tKeep your voice down.\n\n\t\t\t\tMATT\n\t\t\tThe protocol works. Why'd you tell \n\t\t\tthem it didn't?\n\n\t\t\t\tSEBASTIAN\n\t\t\tI wasn't ready for them to know.\n\n\t\t\t\tMATT\n\t\t\tBut they're the oversight committee. \n\t\t\tThey're supposed to know.\n\n\t\t\t\tLINDA\n\t\t\tI'm sure he had a reason.\n\t\t\t\t (firmly)\n\t\t\tYou did have a reason, didn't you, \n\t\t\tSebastian?\n\n\t\t\t\tSEBASTIAN\n\t\t\tI had more than a reason. I had a \n\t\t\tgoddamn epiphany.\n\n\tThey reach his Porsche.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tWhat do you think they'd do if they \n\t\t\tknow we could send a subject into \n\t\t\tphase shift and pull it back out \n\t\t\tagain? How many seconds would it take \n\t\t\tfor them to take over the whole \n\t\t\tproject, bringing in their soldiers to \n\t\t\ttest the formula on. We'd have lost \n\t\t\tcontrol of it by the end of the week.\n\n\t\t\t\tLINDA\n\t\t\tIt's their money, Sebastian. It's \n\t\t\tgoing to happen eventually.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI know. But not yet. There's too much \n\t\t\tfor us to learn. I don't want my hands \n\t\t\ttied by their political agenda when we \n\t\t\tgo to phase three.\n\n\t\t\t\tMATT\n\t\t\tWell, then... mind telling us how \n\t\t\tyou're gonna get a human test-subject \n\t\t\tfor phase three without the committee \n\t\t\tfinding out?\n\n\t\t\t\tSEBASTIAN\n\t\t\tThat's easy. I've decided to test the \n\t\t\tprocedure ...\n\n\tINT. LABORATORY CONFERENCE ROOM - DAY\n\n\t\t\t\tSEBASTIAN\n\t\t\t... on myself.\n\n\tThe team sits around the conference table. Their jaws \n\tdrop and they stare at him with wide eyes.\n\n\t\t\t\tFRANK\n\t\t\tAre you nuts?\n\n\t\t\t\tSEBASTIAN\n\t\t\tWas Jonas Salk nuts?\n\n\t\t\t\tFRANK\n\t\t\tYeah. Pretty sure he was.\n\n\t\t\t\tCARTER\n\t\t\tAnd remember, for every Jonas Salk, \n\t\t\tthere are a bunch of guys who aren't \n\t\t\tfamous cuz they died.\n\n\t\t\t\tSEBASTIAN\n\t\t\tIf we're that unsure, how can we \n\t\t\tmorally justify testing it on someone \n\t\t\telse?\n\n\t\t\t\tJANICE\n\t\t\tIsn't it a little soon to be moving \n\t\t\tinto phase three anyway?\n\n\t\t\t\tSARAH\n\t\t\tShe's right. We haven't even finished \n\t\t\tcollating the phase two research.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWe'll have plenty of time to collate \n\t\t\tand cross-reference later. Monkey data \n\t\t\tdoesn't matter anyway. The only real \n\t\t\tdata is human data.\n\n\t\t\t\tSARAH\n\t\t\tYou don't even know if any of the \n\t\t\tprotocols will work on humans.\n\n\t\t\t\tSEBASTIAN\n\t\t\tHow are we gonna find out? Besides, \n\t\t\twe've succeeded with a gorilla and \n\t\t\ttheir DNA is 98% the same as humans. \n\t\t\tAnd the 2% is not that significant.\n\n\t\t\t\tLINDA\n\t\t\tSebastian ... humans can talk, build \n\t\t\thouses and cook in microwave ovens. \n\t\t\tGorilla's live in trees. That's a \n\t\t\thelluva 2% if you ask me.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWe're all concerned. I know that. But \n\t\t\tif we're gonna move forward ever, this \n\t\t\tis something we have to do.\n\n\t\t\t\tLINDA\n\t\t\tWhy you? Why not one of us?\n\n\t\t\t\tSEBASTIAN\n\t\t\tThe risks. I couldn't ask...\n\n\t\t\t\tMATT\n\t\t\t\t (interrupting)\n\t\t\tWhat if we volunteer?\n\n\t\t\t\tLINDA\n\t\t\tWhat if you're too valuable to lose?\n\n\t\t\t\tSEBASTIAN\n\t\t\tI'm Project Leader. It's my formula \n\t\t\tand my call. The best way to express \n\t\t\tyour concern is to make damn sure you \n\t\t\tdo your best work. I'll want about \n\t\t\tfour weeks to...\n\n\t\t\t\tFRANK\n\t\t\tTo put your affairs in order?\n\n\t\t\t\tSEBASTIAN\n\t\t\tTo run some more reversions and tissue \n\t\t\ttests and then we'll attempt the phase \n\t\t\tshift. I'll stay shifted for three \n\t\t\tdays of testing and then we'll perform \n\t\t\ta quantum regression.\n\n\tINT. SEBASTIAN'S OFFICE\n\n\tA knock on the door.\n\n\t\t\t\tSEBASTIAN\n\t\t\tCome in.\n\n\tLinda pushes into the room and closes the door behind \n\ther.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tWhat?\n\n\t\t\t\tLINDA\n\t\t\tIn the past six years, I've never once \n\t\t\tchallenged your decisions, but this \n\t\t\t... Sebastian. I don't think you \n\t\t\tshould do this.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou don't understand.\n\n\t\t\t\tLINDA\n\t\t\tOh please. How long were we together? \n\t\t\tYou must've said it a million times \n\t\t\t... Nobody knows who built the lunar \n\t\t\tlander. All they remember in the first \n\t\t\tman on the moon.\n\n\tSebastian shrugs and nods.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tBut what if something happens to \n\t\t\tyou... what about the project? \n\n\tSebastian smiles.\n\n\t\t\t\tSEBASTIAN\n\t\t\tLin, trust me... nothing's going to \n\t\t\thappen.\n\n\tINT. BEDROOM - NIGHT\n\n\tLinda and Matt are in bed together. Matt kisses her way \n\tup and down her arm. But Linda is distracted.\n\n\t\t\t\tLINDA\n\t\t\tHe refuses to listen to reason.\n\n\t\t\t\tMATT\n\t\t\tCan we talk about this later? I'm \n\t\t\ttrying to make love to you.\n\n\t\t\t\tLINDA\n\t\t\tSorry. I just can't let it go.\n\n\tMatt props himself up on the pillow.\n\n\t\t\t\tMATT\n\t\t\tI know how you're feeling. Hell, he \n\t\t\tand I've been friends since freshman \n\t\t\tyear.\n\n\t\t\t\tLINDA\n\t\t\tSo how can we let him do this?\n\n\t\t\t\tMATT\n\t\t\tWhat if you were given the opportunity \n\t\t\tto be the first person on ,Mars, would \n\t\t\tyou go?\n\n\t\t\t\tLINDA\n\t\t\tIn a heartbeat.\n\n\t\t\t\tMATT\n\t\t\tWhat if they didn't know whether or \n\t\t\tnot they could get you home?\n\n\tLinda thinks about it. It's still tempting.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tThis is his chance to be Chuck Yeager \n\t\t\tor Christopher Columbus. Well, if I \n\t\t\twere him I'd do the same thing.\n\n\tMatt goes back to kissing Linda.\n\n\t\t\t\tLINDA\n\t\t\tLet me ask another question.\n\n\t\t\t\tMATT\n\t\t\tIs about who gets to be on top?\n\n\t\t\t\tLINDA\n\t\t\tIs the human race really ready for \n\t\t\twhat we're doing?\n\n\tMatt groans and rolls over.\n\n\t\t\t\tMATT\n\t\t\tWhy do you always get philosophical \n\t\t\tbefore we're about to get physical?\n\n\t\t\t\tLINDA\n\t\t\tNo really. Is it ready? We're \n\t\t\tbarrelling down a road that begs moral \n\t\t\tand ethical questions that I don't \n\t\t\tthink we can answer.\n\n\t\t\t\tMATT\n\t\t\tThey said the same thing about the \n\t\t\tbomb. They said we'd never survive the \n\t\t\tnuclear age... but here we are.\n\n\t\t\t\tLINDA\n\t\t\tThis night is still young.\n\t\t\t\t (beat)\n\t\t\tI mean, when you think about it, it's \n\t\t\tcreepy. Do we really want to live in a \n\t\t\tworld where people can just disappear \n\t\t\tin the blink of an eye?\n\n\t\t\t\tMATT\n\t\t\tWe made our deal with the devil years \n\t\t\tago. Might as well stick around to \n\t\t\tcash in.\n\n\tINT. MEDICAL EXAMINING ROOM - DAY\n\n\tSebastian stripped to his shorts paces nervously. A knock \n\ton the door.\n\n\t\t\t\tSEBASTIAN\n\t\t\t\t (his voice catches)\n\t\t\tYes?\n\n\tMatt sticks his head in.\n\n\t\t\t\tMATT\n\t\t\tWe're ready.\n\n\tSebastian nervously shakes his limbs out. Then nods.\n\n\t\t\t\tSEBASTIAN\n\t\t\tOkay.\n\n\t\t\t\tMATT\n\t\t\tIt's not too late to back out. I'm \n\t\t\thappy to take your place.\n\n\t\t\t\tSEBASTIAN\n\t\t\tNo. I'm ready.\n\n\tMatt leads him into the hallway.\n\n\tINT. CORRIDOR - DAY\n\n\tAs they walk down the corridor toward the lab...\n\n\t\t\t\tMATT\n\t\t\tNervous?\n\n\t\t\t\tSEBASTIAN\n\t\t\tA little.\n\n\t\t\t\tMATT\n\t\t\tEver tell you the one about Superman \n\t\t\tand Wonder Woman?\n\n\t\t\t\tSEBASTIAN\n\t\t\tI don't think so.\n\n\t\t\t\tMATT\n\t\t\tSo Superman's flying around the city, \n\t\t\tand he's horny as hell.  Lo and behold \n\t\t\the looks down and sees Wonder Woman, \n\t\t\tcompletely nude, sunning herself up on \n\t\t\tthe roof of the Justice League. I mean \n\t\t\tshe is lying there naked and spread \n\t\t\teagle. So Superman starts thinking, \n\t\t\t\"man... this is too easy. I could go \n\t\t\tdown there, do a little fast pumping \n\t\t\tand be gone before she even sees me.\" \n\t\t\tAfter all he is faster than a speeding \n\t\t\tbullet, right? Anyway, he swoops down, \n\t\t\ttakes care of business so quick, you \n\t\t\tcan't even see him. Well ... I tell \n\t\t\tya. Wonder Woman looks up, surprised \n\t\t\tas hell and says \"What the hell was \n\t\t\tthat.\" And the Invisible Man replies \n\t\t\t\"I dunno know, but it sure hurt like \n\t\t\thell.\"\n\n\tINT. LABORATORY\n\n\tSebastian shoots Matt a look.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou know, that could be the last joke \n\t\t\tI ever hear.\n\n\t\t\t\tMATT\n\t\t\tC'mon, man. That's funny shit.\n\n\tThe buzz of conversation is punctuated by an amplified \n\tHEARTBEAT, thumping its familiar rhythm. Bah-bump. \n\tBah-bump. In the center of the room, Sebastian, dressed \n\tonly in a pair of jogging shorts is strapped to a table \n\tinclined at a 45 degree angle. Electrodes are strapped to \n\this body. An I.V. tube snakes from the needle in his vein \n\tup to a bag of saline solution. Dripping slowly. Linda \n\tmakes last minute checks of some of the equipment. She \n\tpats Sebastian on the shoulder.\n\n\t\t\t\tLINDA\n\t\t\tO.K. How're you feeling?\n\t\t\t\n\t\t\tSebastian takes a deep breath.\n\n\t\t\t\tSEBASTIAN\n\t\t\tFine.\n\n\tSarah checks his vitals.\n\n\t\t\t\tSARAH\n\t\t\tPulse 88, BP 140 over 95. A bit \n\t\t\televated.\n\n\t\t\t\tSEBASTIAN\n\t\t\tTo be expected.\n\n\t\t\t\tSARAH\n\t\t\tNo reason for concern. He's ready. \n\n\tLinda takes a moment and studies Sebastian's face. She's \n\talmost teary eyed.\n\n\t\t\t\tSEBASTIAN\n\t\t\tHey... it's gonna be okay.\n\n\tLinda nods. Back to business.\n\n\t\t\t\tLINDA\n\t\t\tStart recording.\n\n\tINT. OBSERVATION BOOTH.\n\n\tJanice hits record on the equipment decks.\n\n\t\t\t\tJANICE\n\t\t\tWe're hot. All systems nominal, \n\t\t\tHouston.\n\n\tFrank coordinates all the data being fed into the \n\tcomputers. He pushes a series of buttons and speaks into \n\ta microphone.\n\n\t\t\t\tFRANK\n\t\t\tOkay, kids. Let's make some history.\n\n\tINT. LABORATORY - DAY\n\n\tFrank's voice echoes through the chamber.\n\n\t\t\t\tLINDA\n\t\t\tSubject: Male, Age 29, weight 166 lbs. \n\n\tMatt jabs a hypodermic into small vial of colored liquid. \n\tDraws up 20ccs.\n\n\t\t\t\tMATT\n\t\t\t\t (to Linda)\n\t\t\tReady.\n\n\tLinda takes the hypo from Matt.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tIf the tests are any indication it \n\t\t\tshould work quickly.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI'll inject myself. If anything goes \n\t\t\twrong, they can't blame you.\n\n\tShe hands the hypo Sebastian and steps away. Sebastian \n\tstares at the golden formula silently for a moment.\n\n\t\t\t\tLINDA\n\t\t\tWe can still shut down, Sebastian.\n\n\tHe shakes his head.\n\n\t\t\t\tMATT\n\t\t\tAny last words?\n\n\t\t\t\tSEBASTIAN\n\t\t\tYeah. If I'm killed, pretend I said \n\t\t\tsomething deep and clever. \n\n\tThen... Back to business. He inserts the needle into the \n\tI.V. Sebastian. Presses into himself and depresses the \n\tplunger.\n\n\t\t\t\tLINDA\n\t\t\tInjection was administered at\n\t\t\t\t (checks watch)\n\t\t\t... 18:23:47.\n\n\tThe colored liquid snakes it's way into his bloodstream.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tKeep talking. Tell us what you're \n\t\t\tfeeling.\n\n\t\t\t\tSEBASTIAN\n\t\t\tNothing so far.\n\n\t\t\t\tSARAH\n\t\t\tVitals are stable.\n\n\tThey wait and watch.\n\n\t\t\t\tLINDA\n\t\t\tNothing's happening.\n\n\tAnother moment passes by.\n\n\t\t\t\tMATT\n\t\t\tHuman DNA structure is slightly more \n\t\t\tcomplex... it's possible that it may \n\t\t\ttake more time...\n\n\tAnother moment passes.\n\n\t\t\t\tLINDA\n\t\t\tMaybe we overlooked something.\n\n\t\t\t\tSEBASTIAN\n\t\t\tRecheck the protocol. It can't be non- \n\t\t\treactive.\n\n\t\t\t\tCARTER\n\t\t\tKinda like a firecracker with a bad \n\t\t\tfuse...\n\n\tSebastian shoots Carter a questioning look.\n\n\t\t\t\tCARTER (cont'd)\n\t\t\tDon't know if it'll go off.\n\n\t\t\t\tLINDA\n\t\t\tFrank?\n\n\t\t\t\tFRANK (V.0.)\n\t\t\t\t (from the booth)\n\t\t\tNo change in bio-electric.\n\n\t\t\t\tSEBASTIAN\n\t\t\tGoddammit.\n\n\tAnother long pause. Sebastian concentrates.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tOkay wait, my arm... it's getting a \n\t\t\tbit warm... yeah, it's ... it's \n\t\t\tstarting to tingle...\n\n\tExcitement overtakes the room.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tOkay... it's spreading to my back... \n\t\t\tlike, like a fever...\n\n\t\t\t\tLINDA\n\t\t\tHere we go.\n\n\tSlowly the flesh on Sebastian's arm begins dissolving, \n\trevealing the complex network of nerves, blood vessels \n\tand flesh beneath it.\n\n\t\t\t\tSEBASTIAN\n\t\t\tShit... it's starting to burn... Oh \n\t\t\tgod. It hurts. I didn't think it would \n\t\t\thurt.\n\n\tThe HEART BEAT thumps faster, accelerating\n\n\t\t\t\tSARAH\n\t\t\tHeartbeat's elevated. Pulse at 100.\n\t\t\t... 130 ...\n\n\t\t\t\tLINDA\n\t\t\tWhat do you feel? Keep talking. KEEP \n\t\t\tTALKING!\n\n\t\t\t\tSEBASTIAN\n\t\t\tPain!\n\n\t\t\t\tSARAH\n\t\t\tPulse is 165 ... 170 Blood pressure \n\t\t\t180 over 100. ... \n\n\t\t\t\tCARTER\n\t\t\tHe's going to blow out his heart.\n\n\t\t\t\tLINDA\n\t\t\tProp the crash cart.\n\n\tCarter grabs the crash cart, rolls it in. Matt tears off \n\tthe I.V. leads into Sebastian's arms.\n\n\t\t\t\tMATT\n\t\t\tWe've got to stop it!\n\n\t\t\t\tLINDA\n\t\t\tWe can't!\n\n\tINT. OBSERVATION BOOTH\n\n\tAll the monitors are going crazy.\n\n\t\t\t\tJANICE\n\t\t\tSomething's happening.\n\n\tFrank leans into the microphone.\n\n\t\t\t\tFRANK\n\t\t\tListen up! Electric activity \n\t\t\tincreasing in all limbs. Brainwaves \n\t\t\tare through the roof.\n\n\t\t\t\tJANICE\n\t\t\tI didn't think the human brain could \n\t\t\tspike that high.\n\n\t\t\t\tFRANK\n\t\t\tMaybe it can't.\n\n\tINT. LABORATORY\n\n\tSebastian screams in dire pain. He struggles against his \n\trestraints as his skin liquefies into a muscular mass. \n\tIt's like something's eating away at him. Gruesome. The \n\tyells become louder and more painful to hear.\n\n\t\t\t\tSEBASTIAN\n\t\t\tNo. Oh god! NO! STOP IT! STOP IT!\n\n\tThe muscular system begins to dissolve, leaving a \n\tstruggling skeleton wrapped with tentacular blood vessels \n\tand stuffed with the major organs. The beating heart, the \n\theaving lungs.\n\n\t\t\t\tSARAH\n\t\t\tPulse is 180 .... holding stable. \n\n\tScreaming.... Then the organs go. Then the blood vessels. \n\tLeaving only a skeleton howling in pain. The jawbones \n\tspread wide ... Screaming... screaming...\n\n\t\t\t\tCARTER\n\t\t\t Holy shit.\n\n\tThen as if someone had poured acid all over the bones, \n\tthe skeleton evaporates into nothingness.\n\n\t\t\t\tSARAH\n\t\t\tPulse is dropping. 170..\n\t\t\t150 .... 160..\n\n\tThere is NOTHING left of Sebastian Caine.\n\n\t\t\t\tLINDA\n\t\t\tBio-quantum phase shift occurred at\n\t\t\t18:26.\n\n\tThe screaming continues and the restraints continue to \n\ttwist and turn. Suddenly the restraints go limp.\n\n\t\t\t\tMATT\n\t\t\tIs he dead?\n\n\tLinda checks the readouts.\n\n\t\t\t\tLINDA\n\t\t\tNo. He passed out from the trauma.\n\n\t\t\t\tSARAH\n\t\t\tVitals returning to normal. Pulse 110 \n\t\t\t... dropping. Blood pressure 130 over \n\t\t\t75.\n\n\tA long beat as everybody's eyes stare at the instruments.\n\n\t\t\t\tFRANK (V.O.)\n\t\t\tElectrical activity is stabilizing.\n\n\t\t\t\tSARAH\n\t\t\tPulse steady at 70.\n\n\tA long beat.\n\n\t\t\t\tMATT\n\t\t\tUn-fucking-believable.\n\n\tA reverent pause as Linda runs her fingers over what \n\twould be his skin. Small electrical charge dance around \n\ther fingertips. She gasps.\n\n\t\t\t\tLINDA\n\t\t\t\t (whispers in his ear)\n\t\t\tYou did it, Sebastian. You're the \n\t\t\tfirst.\n\n\t\t\t\tCARTER\n\t\t\tLet's get him into recovery.\n\n\t\t\t\t\t\t\t\t\n\tDISSOLVE TO:\n\n\tINT. RECOVERY CHAMBER\n\n\tThe chamber is half constructed out of Plexiglas at the \n\tend of the Hallway of Habitats.\n\n\tOn the recovery bed, a sheet drapes over Sebastian's \n\tinvisible body. The gentle bleatings of medical machinery \n\tpound out a dulling rhythm.\n\n\tLinda sleeps in a corner chair as Matt slips into the \n\troom. He checks the readouts on Sebastian then takes a \n\tseat by Linda. She wakes with a start.\n\n\t\t\t\tMATT\n\t\t\tS'okay. You nodded off.\n\n\t\t\t\tLINDA\n\t\t\tHis breathing's hypnotic. How long's \n\t\t\tit been?\n\n\t\t\t\tMATT\n\t\t\tSeventeen hours.\n\n\t\t\t\tLINDA\n\t\t\tWhere are the others?\n\n\t\t\t\tMATT\n\t\t\tIn the lab crunching numbers. We've \n\t\t\tgot enough data there for two \n\t\t\tlifetimes of research.\n\n\tLinda rubs her temples and gestures to the bed.\n\n\t\t\t\tLINDA\n\t\t\tI keep looking at that hole, wondering \n\t\t\tif he's really there.\n\n\tShe notices something out of the corner of his eye. The \n\tsheet twitches.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tDid you see...\n\n\tThe sheet twitches again.\n\n\t\t\t\tMATT\n\t\t\tHe may be coming out of it.\n\n\tLinda and Matt watch intently. Then suddenly... the \n\tsheets thrash violently. A yell of pain.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tThe lights! Turn off the goddamn \n\t\t\tlights! Ah Christ!\n\n\tLinda jumps up and crosses to Sebastian. Matt rushes to \n\tthe wall and turns off the lights. Darkness. The room is \n\tlit by the glow of machinery.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tI can't... I can't close my eyes. I \n\t\t\tcan't close my eyes.\n\n\t\t\t\tLINDA\n\t\t\tYour eyelids are transparent.\n\n\tThe sheets slowly stop thrashing.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tSo I ... I'm...\n\n\t\t\t\tLINDA\n\t\t\tYes.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tMy arms. I can.. where? ... I can feel \n\t\t\tthem...\n\n\t\t\t\tLINDA\n\t\t\tYour arms ... your whole body... It \n\t\t\tworked, Sebastian. It worked.\n\n\tThe sheet rises and slips away. The wires, seemingly \n\tconnected to thin air, spread out like a spider's web and \n\tthen fall away one-by-one. The monitors all go dead.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tMirror. I ... I want to see.\n\n\t\t\t\tMATT\n\t\t\tOver here in the corner.\n\n\tMatt motions to a dark corner of the room, toward a \n\tmirror and sink. We push in on the mirror. No reflection. \n\tSuddenly it fogs up ... Sebastian's breath. A finger \n\ttracing appears in the fog ... but of course we see no \n\tfinger. The sink faucet twists on and water runs. It cups \n\tinto the shape of hands and lifts into the air, splashing \n\tagainst the surface of Sebastian's face. Beads of water \n\tcling to his f ace, outlining it I shape f or a moment \n\tbefore dripping away.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tWhat was it like?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI ... It's hard to think.\n\n\tSebastian's voice is now behind him. Matt turns around.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tThe transformation... I remember every \n\t\t\tmolecule in my body shattering.\n\n\t\t\t\tMATT\n\t\t\tIt was painful?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tAt first... but then everything went \n\t\t\tblack. I couldn't see or hear or feel \n\t\t\tanything. It was all just black... \n\t\t\tlike I wasn't connected.\n\n\t\t\t\tLINDA\n\t\t\tYour system received quite a shock.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tAt least my senses are starting to \n\t\t\treturn... You're wearing your \n\t\t\tShalimar, aren't you?\n\n\tLinda realizes that he's standing very close by. Her hair \n\tlifts slightly and Sebastian inhales. Chills go down her \n\tspine.\n\n\t\t\t\tLINDA\n\t\t\tSebastian.\n\n\tLinda's hair drops back to her shoulders.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tThis is weird. I'm looking through \n\t\t\tmyself at the floor. I'm looking right \n\t\t\tthrough myself. I can't tell ...\n\n\tHe bumps into a chair.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\t... where my body is.\n\n\tA moment of silence.\n\n\t\t\t\tLINDA\n\t\t\tSebastian?\n\n\tNo answer. Linda and Matt look at each other, slightly \n\talarmed.\n\n\t\t\t\tMATT\n\t\t\tSebastian?\n\n\tAn indentation forms on the bed a moment later.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou really can't see me. Can you?\n\n\t\t\t\tLINDA\n\t\t\tGimme symptoms. Dizziness, nausea, \n\t\t\theadache, body-ache, disorientation.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tNo, just tired.\n\t\t\t\t (beat)\n\t\t\tIt's funny. I can see everything... \n\t\t\tmore than before... but I can't see \n\t\t\tmyself.\n\n\tINT. LABORATORY - DAY\n\n\tCarter, Frank, Janice and Sarah work at various research \n\tstations. The door opens and Linda and Matt enter.\n\n\t\t\t\tCARTER\n\t\t\tHey. How's he doing?\n\n\t\t\t\tLINDA\n\t\t\tWhy don't you ask him?\n\n\tLinda motions to the gap between her and Matt. The four \n\tof them stare at the nothing.\n\n\t\t\t\tSARAH\n\t\t\tSebastian, how do you feel.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tNot to bad, considering.\n\n\tThey turn round. The voice is coming from behind them. \n\tThe group rises from their various workstations and turn \n\ttoward where the voice came from.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tOdd, isn't it?\n\n\tA rheostat switch on the wall turns and the lights dim. \n\tThough it's a simple act, it feels somewhat ominous.\n\n\t\t\t\tLINDA\n\t\t\tHe can't close his eyes so they're \n\t\t\tsensitive to light.\n\n\tLinda's explanation puts everyone at ease.\n\n\t\t\t\tJANICE\n\t\t\tSo, what was it like?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tOver here.\n\n\tSebastian has moved. As everyone turns toward him again, \n\the can't stifle a slight giggle.\n\n\t\t\t\tLINDA\n\t\t\tC'mon Sebastian. Knock it off.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tSorry. Couldn't resist.\n\n\tHis voice again come s from somewhere else in the room.\n\n\t\t\t\tFRANK\n\t\t\tI feel like we're playing Marco Polo.\n\n\t\t\t\tMATT\n\t\t\tWell, I see the procedure hasn't \n\t\t\tchanged your personality.\n\n\tFrank pulls on a pair of THERMAL GOGGLES.\n\n\t\t\t\tFRANK\n\t\t\tNo worries. I'm on it.\n\n\tTHERMAL POV - Every body in the laboratory shows up as a \n\theat signature, including Sebastian. Frank points.\n\n\t\t\t\tFRANK (cont'd)\n\t\t\tGotcha, big man.\n\n\tTHERMAL POV - The HEAT SIGNATURE reaches for a chair.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tBoy, you people have no sense of \n\t\t\thumor.\n\n\tA chair slides back from a desk and bends under \n\tSebastian's weight.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tShow me. So ...\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tINT. LABORATORY - NIGHT\n\n\tFrank and Janice shuttle the playback controls as a VIDEO \n\tMONITOR re-plays various angles of Sebastian's phase \n\tshift.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tStop there.\n\n\tFrank halts the tape.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tIndex that. That was when it started \n\t\t\tburn. Epidermal reaction.\n\n\t\t\t\tJANICE\n\t\t\tIndex Mark. 112125.\n\n\tJanice scribble the numbers in her notebook. Linda \n\tcrosses, nursing a cup of coffee.\n\n\t\t\t\tLINDA\n\t\t\tIt's late. Time you got some rest.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tJust a little longer.\n\n\t\t\t\tLINDA\n\t\t\tHate to pull rank, but you're my \n\t\t\tpatient now and you need rest. We've \n\t\t\tgot a busy day tomorrow.\n\n\tHeavy sigh.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tFine.\n\n\t\n\n\tINT. THE RECOVERY ROOM - NIGHT\n\n\tAs Linda enters she points to a small camera in the upper \n\tcorner of the room.\n\n\t\t\t\tLINDA\n\t\t\tWe've set up a thermal camera for \n\t\t\tobservation and I've arranged one of \n\t\t\tus to be here 24/7 in case you need \n\t\t\tanything. The team's gonna be on alpha-\n\t\t\tcall alert for the duration. If \n\t\t\tanything goes wrong, we can all be \n\t\t\there within...\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tThirty minutes. Yes,,_I know. I wrote \n\t\t\tthe procedure.\n\n\t\t\t\tLINDA\n\t\t\tI was trying to be reassuring.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou like this don't you?\n\n\t\t\t\tLINDA\n\t\t\tWhat's that?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tBeing in charge.\n\n\tIt's clear she does. But she's certainly not going to \n\tadmit it.\n\n\t\t\t\tLINDA\n\t\t\tPlease. I'm just doing my job.\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tCLOSE ON: A video screen. A thermal lump lays stretched \n\tout on the bed.\n\n\tPull back to reveal SARAH staring at the screen. We are.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tA bank of monitors display the various angles of the Hall \n\tof Habitats, the laboratory and, of course, Sebastian in \n\tthe recovery room.\n\n\tLinda hands Sarah a cup of coffee.\n\n\t\t\t\tLINDA\n\t\t\tYou gonna be okay?\n\n\t\t\t\tSARAH\n\t\t\tFine. It's not like I have anything \n\t\t\telse going on in my sad pathetic life.\n\n\t\t\t\tLINDA\n\t\t\tCarter'll be in at six to spell you \n\t\t\tand I'll be in by nine. Call me if \n\t\t\tanything happens, okay?\n\n\tThrough the glass wall, Linda sees Matt knocking and \n\twaving her out.\n\n\t\t\t\tSARAH\n\t\t\tI'm fine. Go on ahead.\n\n\tINT. CORRIDOR - NIGHT\n\n\tThe rest of the team straggles into the elevator. \n\tYawning. Exhausted from the day.\n\n\t\t\t\tCARTER\n\t\t\tMan, I'm tired. That was a long day.\n\n\t\t\t\tLINDA\n\t\t\tDays only get longer from here.\n\n\tLinda catches Matt's eye. Gives him a look. \"You coming \n\tover?\" Matt nods, \"yes\", imperceptible to everyone but \n\tLinda. She smiles.\n\n\t\t\t\t\t\t\t\t\n\tDISSOLVE TO:\n\n\tINT. LABORATORY - NIGHT\n\n\tDeserted and dark.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tLate. Sarah rubs her temples. Her eyelids are heavy. \n\tShe's having real trouble staying awake. The buzzing \n\tfluorescent light isn't helping either.\n\n\tINT. RECOVERY ROOM - NIGHT\n\n\tThe sheets ruffle and the indentation disappears from the \n\tbed. We can hear breathing and soft sound of bare feet \n\tshuffling against linoleum.\n\n\tCAMERA SLOWLY PANS toward the door, as if we, are \n\tfollowing someone walking.\n\n\tThe door handle turns and the door pushes open.\n\n\tINT. HALLWAY OF HABITATS - NIGHT\n\n\tWE SLOWLY TRACK DOWN the Hallway of the Habitats. We hear \n\tthe sounds of sleeping creatures. A couple of them growl \n\tat something unseen. The growling follows the invisible \n\tsomething as it passes by.\n\n\tINT. LABORATORY - NIGHT\n\n\tThe laboratory door opens and shuts again. Ghostly. We \n\tsee papers shuffling at one of the work stations. A glass \n\tmoves slightly.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tSarah reclines in her chair. Fast asleep, Behind her is \n\tthe glass wall, revealing the empty hallway behind it.\n\n\tBut a small portion of the glass fogs, as if someone had \n\tjust breathed on it. As the fogged part quickly clears, \n\twe see the door to the observation room quietly open.\n\n\tON SARAH, still sleeping. We hear a whisper.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\t\t (whispering)\n\t\t\tSarah. Are you awake?\n\n\tHer heavy breathing mixes with Sebastian's.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\t\t (barely audible)\n\t\t\tHmm.\n\n\tSarah's hair moves slightly, as if a hand were running \n\tthrough it. And then we see her shirt move, like fingers \n\twere tracing over it. Down from the shoulder to her \n\tbreast. Around her nipple. Sarah moans slightly, as if \n\tshe were dreaming, but she doesn't stir. And then her \n\tbreasts cup slightly, as if they were being touched... \n\tsoftly... gently. Her breathing becomes harder, more \n\tlabored, erotic... and then she... BOLTS AWAKE. Bar eyes \n\twide with fear. She jumps and cups her own breasts and \n\tlooks around the room. It's empty, of course. She jumps \n\tover to the monitor and checks on Sebastian's room. The \n\theat signature isn't there.\n\n\t\t\t\tSARAH\n\t\t\tDr. Caine! Goddamnit, Dr. Caine! Are \n\t\t\tyou in here?\n\n\tShe listens. It's silent. She tries holding her breath, \n\tlistening for his breathing. But there's nothing.\n\n\tSarah reaches over to a microphone. Hits a few switches.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tDr. Caine?\n\n\tVARIOUS SHOTS OF THE COMPOUND\n\n\t- LABORATORY\n\n\t\t\t\tSARAH (V.0.,LOUDSPEAKER)\n\t\t\tDr. Caine, please report in.\n\n\t- HALLWAY OF HABITATS\n\n\t\t\t\tSARAH (V.0.,LOUDSPEAKER)\n\t\t\tDr. Caine, report in please!\n\n\tINT. OBSERVATION BOOTH - CONTINUOUS\n\n\tSarah waits. No response.\n\n\t\t\t\tSARAH\n\t\t\tShit. \n\n\tShe looks around the room. He must be in here.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tDr. Caine? Sebastian? Come on, this \n\t\t\tisn't funny. I know you're in here. \n\n\tNothing. No response. Sarah waves her hand around, \n\treaching out, trying to find him. After a few beats she \n\tstops and rubs her head.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tI must be going crazy.\n\n\tSuddenly, Sarah gets an idea. She quickly exits the \n\tobservation room.\n\n\tEXT. CORRIDOR - NIGHT\n\n\tAt a wall storage box, she removes a pair of Thermal \n\tGoggles and slips them on.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tSarah enters wearing the thermals. She scans the room.\n\n\tTHERMAL POV - The room is empty.\n\n\tShe pulls the goggles off in frustration, and when she \n\tglances over at the video screen, she sees Sebastian's \n\tthermal image lying on the bed in the recovery room.\n\n\tSarah sinks into her chair, a tad disconcerted.\n\n\tINT. OBSERVATION ROOM - MORNING\n\n\tLinda and Matt finish listening to Sarah's story.\n\n\t\t\t\tSARAH\n\t\t\tI found him later in the lab, running \n\t\t\tsamples.\n\n\t\t\t\tLINDA\n\t\t\tWhy didn't you call me?\n\n\t\t\t\tSARAH\n\t\t\tBecause I wasn't sure. I'm still not. \n\t\t\tI mean, I could've easily been \n\t\t\tdreaming.\n\n\t\t\t\tMATT\n\t\t\tIt doesn't sound like something \n\t\t\tSebastian would do.\n\n\t\t\t\tSARAH\n\t\t\tGod, I feel so stupid.\n\n\t\t\t\tLINDA\n\t\t\tI can talk to him.\n\n\t\t\t\tSARAH\n\t\t\tNo. I mean...\n\t\t\t\t (she torn, unsure of herself)\n\t\t\tIt was probably nothing. I \n\t\t\tshouldn't've mentioned it.\n\n\t\t\t\tMATT\n\t\t\tYou sure?\n\n\t\t\t\tSARAH\n\t\t\tYeah, I'm sure. I mean, y'know, why \n\t\t\twould he do that, right? Just, this \n\t\t\tplace at night can be kinda creepy, \n\t\t\ty'know.\n\n\tINT. RESEARCH LAB - DAY\n\n\tSebastian, wearing surgical scrubs sits in an examination \n\tchair. Wire leads sprout from the electrodes covering his \n\thead and arms. The electrodes seem to outline his body.\n\n\t\t\t\tMATT\n\t\t\tSo, how was your first night?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tRestless. Hard to sleep when you can't \n\t\t\tclose your eyes.\n\n\tAs Sebastian talks, we can see the electrodes around his \n\tjaw pump up and down.\n\n\t\t\t\tMATT\n\t\t\tYeah? What'd you do?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tGot up a couple of times. Knocked \n\t\t\tabout.\n\n\t\t\t\tMATT\n\t\t\tYeah, Sarah mentioned you weren't in \n\t\t\tyour cubicle. She said she called you \n\t\t\tover the intercom and you didn't \n\t\t\trespond.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI guess I didn't hear. I had the radio \n\t\t\ton.\n\n\t\t\t\tMATT\n\t\t\tIt'd be helpful to us if you'd tell \n\t\t\twhoever's on duty where you're going \n\t\t\tto. I mean, if something were to \n\t\t\thappen, we'd want to know where to \n\t\t\tfind you.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI didn't think it was a problem.\n\n\t\t\t\tMATT\n\t\t\tIt isn't. I just don't want it to \n\t\t\tbecome one.\n\n\tMachines pump out EEG, EKG readouts. Matt studies them.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tReadings are normal.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tNext I want to run a VV and UVF \n\t\t\tanalysis of the platelets.\n\n\t\t\t\tMATT\n\t\t\tWe'll have to draw some more blood.\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tSarah rolls up Sebastian's sleeve, revealing empty air. \n\tShe wraps a bungee cord around the nothing, pulls it \n\ttight and sprays the inside of his elbow with dye. She \n\tacts very self conscious.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou okay?\n\n\t\t\t\tSARAH\n\t\t\tYeah. Why?\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou just seem a little nervous.\n\n\t\t\t\tSARAH\n\t\t\tNo. I...I'm fine. Hold still. This \n\t\t\tmight hurt a bit.\n\n\tThe surface of his skin sheens in the light as Linda \n\tsearches for a vein. She slaps his arm several times, \n\tthen plunges a hypodermic needle into his skin. His skin \n\tbends and gives. The needle remains in sight after it \n\tslips through the visible surface. Sarah presses down on \n\tthe hypo plunger, releasing a dye into his bloodstream.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tDr. Caine... this might sounds stupid, \n\t\t\tbut are you... are you looking at me. \n\n\tThe red dye twists into a long snaking red tube up and \n\tdown his arm. His vein.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tNo. I was looking at the clock. Why? \n\n\tSarah draws the plunger back, sucking Sebastian's blood \n\tinto the hypodermic and then yanks the needle out.\n\n\t\t\t\tSARAH\n\t\t\tJust felt like someone was staring at \n\t\t\tme.\n\n\tSarah pulls the vial off the needle and labels it with a \n\tgrease pencil. After a few beats the red dye in \n\tSebastian's blood stream dissolves and disappears, as \n\tdoes the liquid in the vial.\n\n\tTESTING MONTAGE\n\n\tINT. MRI ROOM\n\n\tMATT slides Sebastian's sheet covered frame into an MRI. \n\tEven though his head is not visible, it shown up on the \n\tMRI scanner.\n\n\tINT. MAIN LABORATORY\n\n\tCARTER and SARAH lower a harness into a water tank. \n\tSEBASTIAN'S BODY displaces the water, revealing an empty \n\tbody shaped cavity in the water.\n\n\tINT. OBSERVATION ROOM\n\n\tCARTER sips a BIG GULP and stares at a monitor which \n\tshows two eat signatures in the Recovery Chamber, huddled \n\tover a chess game.\n\n\tINT. RECOVER CHAMBER\n\n\ton a chessboard... A BLACK KNIGHT takes WHITE BISHOP, \n\tseemingly all by itself.\n\n\tAcross the table, Matt leans back and topples his WHITE \n\tKING acknowledging defeat.\n\n\tINT. SPECTRAL LAB\n\n\tDim lights. Janice and Frank both don eye guards. Frank \n\tswitches on a low intensity laser on and it's beam shoots \n\tacross the room. The beam distorts slightly in the center \n\tof the room. As Frank widens the spectral pattern, \n\tsuddenly the beam splits into a million different \n\tspectral rainbows, momentary illuminating Sebastian's \n\tentire frame in a glowing tingle of light.\n\n\tINT. MAIN LABORATORY\n\n\tLINDA pulls vials from the cyclotrons and props blood \n\tsample slides. She slips them under the microscope. She \n\ttakes a sip of her Diet Coke and puts it on the table. \n\tShe pears into the microscope and analyses the blood \n\tsample, squeezing more stain onto it. She looks up to \n\tmake notations, but when she reaches for her Diet Coke IT \n\tISN'T THERE. She looks around. It's on the other side of \n\ther microscope. She shrugs it off, she takes a sip and \n\tsets it down where it was before. She peers into the \n\tmicroscope again and when she looks up... the Diet Coke \n\tis gone. She looks around the room and sees it on another \n\ttable completely.\n\n\t\t\t\tLINDA\n\t\t\tSebastian? Goddamnit.\n\n\tWe hear Sebastian's laughter echo in the room.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou've no idea how much fun I've had. \n\t\t\tI'm going to hate going back.\n\n\t\t\t\tLINDA\n\t\t\tThat's what worries me.?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tHow so?\n\n\t\t\t\tLINDA\n\t\t\tWhat happens when we turn the project \n\t\t\tover to the Army. Ever wonder how much \n\t\t\tfun they're gonna have?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tMaybe we won't give it to them. His \n\t\t\tvoice comes from behind her now.\n\n\tWe see indentations on her shoulders where his fingers \n\tpress down.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tI was thinking... tonight's my last \n\t\t\tnight. Ever fantasize about making \n\t\t\tlove to an invisible man?\n\n\tLinda pulls away from him.\n\n\t\t\t\tLINDA\n\t\t\tStop it, Sebastian. It's not funny.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWell, don't do it for me. Do it for \n\t\t\tscience. \n\n\tLinda walks away. Sebastian laughs.\n\n\t\t\t\tLINDA\n\t\t\tGrow up.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tOh well. Missed your big chance.\n\n\t\t\t\tLINDA\n\t\t\tGot some sleep. Big day tomorrow.\n\n\tINT. LABORATORY - DAY\n\n\tA bevy of activity below us as the scientists prepare. \n\tMatt slides the antigen cocktail into the centrifuge and \n\tstarts it spinning.\n\n\tA sheet drapes over a Sebastian's frame, straps across \n\this limbs. He is fully wired.\n\n\tLinda looks up to the observation booth.\n\n\t\t\t\tLINDA\n\t\t\tRecording?\n\n\tFrank peers down at her from the booth, his voice echoing \n\tthrough the chamber.\n\n\t\t\t\tFRANK\n\t\t\tRecording. Subject Doctor Sebastian \n\t\t\tCaine. Currently in phase shift... \n\t\t\tThree days, seven hours.\n\n\t\t\t\tLINDA\n\t\t\tDe-Phase protocol. Injecting Serial \n\t\t\tProtein Caine One Two Seven.\n\n\tMatt removes the glowing vial of orange liquid from a \n\tcentrifuge nearby. Carter hands Matt a hypo. Matt jabs it \n\tinto the vial, drawing up the colored liquid. Linda \n\tsprays Sebastian's arm with dye.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tReady?\n\n\t\t\t\tSEBASTIAN\n\t\t\tNot really. I was just starting to \n\t\t\tenjoy myself.\n\n\t\t\t\tLINDA\n\t\t\tTough.\n\n\t\t\t\tMATT\n\t\t\tOkay, man. Here we go.\n\n\tMatt inserts the hypo into the vein and presses down on \n\tthe plunger. The liquid begins to react. Small flashes of \n\tlight blip up and down the strand of color outlining the \n\tvein.\n\n\tBa-bump.. ba-bump... the heartbeat starts to speed up.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWait... something... something doesn't \n\t\t\tfeel right.\n\n\t\t\t\tSARAH\n\t\t\tHeartbeat elevated.\n\n\n\tINT. OBSERVATION BOOTH\n\n\tJanice and Frank look over the equipment.\n\n\t\t\t\tFRANK\n\t\t\tVitals still nominal..\n\n\tINT. LABORATORY\n\n\tThe glowing liquid turns from gold to red as the complex \n\twebbing of a bloodstream appears.\n\n\tSpreading out from the bloodstream, soon becomes visible \n\t... the shadow of a skeletal system.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI can't br... br...\n\n\tSebastian begins wheezing.\n\n\t\t\t\tLINDA\n\t\t\tWhat's wrong?\n\n\t\t\t\tSARAH\n\t\t\tHe's not breathing.\n\n\tMuscles are beginning to appear. And eyeballs. Frightened \n\teyeballs.\n\n\t\t\t\tMATT\n\t\t\tSubject manifesting.\n\n\t\t\t\tSARAH\n\t\t\tPulse erratic.\n\n\tSebastian pulls against his bonds. One set tears off.\n\n\t\t\t\tLINDA\n\t\t\tCarter!\n\n\tCarter grabs onto the mass of flesh and muscle, trying to \n\thold it back. But the restraints snap. The half-visible \n\tman is screaming. He grabs Carter and throws him across \n\tthe room.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tSebastian! Sebastian!\n\n\tAnd just for a second, Sebastian is fully visible. And \n\tfree. He looks around like a scared animal and rips off \n\tall the wiring.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tSebastian!\n\n\t\t\t\tMATT\n\t\t\tGet a tranq. Stat.\n\n\tSarah preps a tranquilizer. Sebastian locks eyes with \n\tLinda. He's lost, he doesn't know where he is. And \n\tsuddenly, he crumbles to the ground. Linda rushes over to \n\thim and puts bar hand on his shoulder. Light bleeds from \n\this skin and his skin begins to dissolve from sight.\n\n\t\t\t\tLINDA\n\t\t\tHe's reverting. Got him on the table. \n\n\tMatt, Linda and Sarah pull the shifting body up and onto \n\tan operating table. Carter pulls himself up and heads \n\tback to the group.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tGet me a I.V. of A.G. seven.\n\n\t\t\t\tSARAH\n\t\t\tI got no pulse. No pulse.\n\n\t\t\t\tMATT\n\t\t\tStart CPR.\n\n\tCarter locates Sebastian's heart, not a difficult thing \n\tbecause we can actually see it. Carter's hand pushes down \n\tin the air inches above the heart. We see the heart being \n\tpushed and squeezed. Sarah slaps an air bag on Sebastian \n\tand starts pumping air into his lungs. Sebastian's heart \n\tbegins to beat again, beat on its own.\n\n\t\t\t\tCARTER\n\t\t\tGetting a pulse.\n\n\t\t\t\tMATT\n\t\t\tHoly shit. What happened?\n\n\t\t\t\tLINDA\n\t\t\tSebastian... can you hear me? Can you \n\t\t\thear me? How are his pupils?\n\n\t\t\t\tMATT\n\t\t\tI can't see his goddamn pupils!\n\n\t\t\t\tSARAH\n\t\t\tI think he's going into shock.\n\n\tWe slowly FADE OUT to the sights and sounds of our \n\tscientist- doctors working on Sebastian... And the \n\tbeeping of Sebastian's erratic heartbeat.\n\n\t\t\t\t\t\t\t\t\t FADE \nUP ON:\n\n\tA HABITAT\n\n\tThe heartbeat continues. In the shadows, two Rhesus \n\tMonkeys defend themselves against an unseen attacker. \n\tBlood splatters against the Plexiglas wall.\n\n\tWe FADE OUT AGAIN...\n\n\tINT. CORRIDOR - NIGHT\n\n\tLinda stares through the Plexiglas walls into the \n\tRecovery Chamber. Inside the Chamber, Sarah and Carter-\n\teye the various screens monitoring Sebastian's vitals.\n\n\tLinda watches the hollow pocket underneath the blanket. \n\tShe watches the rhythm of its rises and falls as \n\tSebastian sleeps. Matt comes up behind her.\n\n\t\t\t\tMATT\n\t\t\tJust got the tissue sample results. \n\t\t\tCellular cohesion is stable.\n\n\tLinda exhales in relief. Matt puts his hands on her \n\tshoulder. Pulls her close to him.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tHow bout you? You gonna be okay?\n\n\t\t\t\tLINDA\n\t\t\tGuess so.\n\t\t\t\t (beat)\n\t\t\tI was just thinking about the Apollo \n\t\t\tmissions. Y'know? Grissom, White and \n\t\t\tChaffee... What it was like for them \n\t\t\ton that launch pad that day, thinking \n\t\t\tthey were gonna reach the stars only \n\t\t\tto burn to death.\n\n\t\t\t\tMATT\n\t\t\tSometimes the test pilots make \n\t\t\thistory. Sometimes the planes crash \n\t\t\tand people die.\n\n\t\t\t\tLINDA\n\t\t\tBut he didn't die, did he?\n\t\t\t\t (beat)\n\t\t\tWhat if we can't bring him back? What \n\t\t\tthen?\n\n\t\t\t\tMATT\n\t\t\tIt's just a little hitch is all. He'll \n\t\t\tbe the first to tell that he'll crack \n\t\t\tit and I'm sure he will. It'll just \n\t\t\ttake time.\n\t\t\t\t (beat)\n\t\t\tListen, let's got out of here. We \n\t\t\tcould drive up to the old observatory. \n\t\t\tWe'll take some wine and go count the \n\t\t\tstars and forget all this for awhile. \n\n\tShe pulls away.\n\n\t\t\t\tLINDA\n\t\t\tNo. I want to be here for him.\n\n\tLinda pushes through the door of the recovery chamber and \n\ttakes a seat by Sebastian's bedside. A little hurt, Matt \n\theads down the corridor.\n\n\tINT. CONFERENCE ROOM\n\n\tFrank and Janice are staring into their coffee when Matt \n\tenters. Matt crosses to the coffee machine and pours \n\thimself a cup. He takes a seat at the table. They all \n\tdrink their coffee in silent vigil.\n\n\tINT. RECOVERY CHAMBER - DAY\n\n\tLinda sits by Sebastian's bedside, listening to the \n\tconstant rhythm of the machines.\n\n\tThe sheets shift.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\t\t (weak)\n\t\t\tHey...\n\n\t\t\t\tLINDA\n\t\t\tHey...\n\n\t\n\n\t\t\t\tSEBASTIAN \n\t\t\tSo I guess it didn't work.\n\n\tLinda shakes her head.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou look worried. It must've been bad. \n\n\tSebastian's voice is weak and strained.\n\n\t\t\t\tLINDA\n\t\t\tYou almost died.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWell, remember your Nietchze. Whatever \n\t\t\tdoesn't kill me, makes me stronger. \n\n\tLinda smiles.\n\n\t\t\t\tLINDA\n\t\t\tI should be making you feel better. \n\t\t\tNot vice versa.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI guess if I'm going to be stuck this \n\t\t\tway for awhile, I'd better make some \n\t\t\tadjustments.\n\n\tINT. RECOVERY CHAMBER - DAY\n\n\tIn a dusty shaft of light...\n\n\tA cotton swab.\n\n\tis dipped by a gloved hand into a jar of flesh-colored \n\tcream make-up. We follow the hand as it raises the cotton \n\tswab into the darkness. The swab strokes over the black \n\tand the rich fleshy cream spreads, revealing...\n\n\tEYE LIDS of a closed eye.\n\n\tThe eyelids part, unveiling...\n\n\tPITCH BLACK. Blink. Blink.\n\n\tNo eye.\n\n\tNot even a trace of a eye socket. Just darkness.\n\n\tA COLORED CONTACT LENS floats through mid-air... hovering \n\tbefore the eyelids. It turns and fastens itself to the \n\tdarkness between the lids.\n\n\tWe PULL BACK slowly as Sebastian lifts a latex FACE MASK \n\tand pulls it over his head.\n\n\tHe checks his reflection in the mirror. He looks almost \n\thuman. Almost. A face, eyes, hands ... the rest of him \n\tcovered by surgical scrubs.\n\n\tWe pull back and see the rest of the team looking on.\n\n\t\t\t\tMATT\n\t\t\tNot too bad.\n\n\t\t\t\tSEBASTIAN\n\t\t\tThe latex'll limit the amount of light \n\t\t\tdelivered to my optic nerves.\n\n\t\t\t\tLINDA\n\t\t\tYou could almost pass for human. \n\n\tSebastian rises. He looks eerily removed from reality \n\twith his cold blank expression.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWell, it gives you a face to talk to \n\t\t\tat least, and we can all work in \n\t\t\tnormal light again.\n\n\tINT. LABORATORY - DAY\n\n\tSERIES OF SHOTS\n\n\tCarter draws blood from Sebastian.\n\n\tSamples are placed into the cyclotron.\n\n\tMatt peers through the eyepiece of a microscope. He makes \n\tnotes.\n\n\tFrank and Janice finish a computer simulation on a \n\tprotein strand. Matt looks over. They shake their heads, \n\tno.\n\n\tSebastian slides into the MRI.\n\n\tLinda examines a petri dish. She throws her pencil down \n\tin frustration.\n\n\tSebastian is hit by the spectral radiation beams.\n\n\tMatt pulls a vial of orange liquid from the cyclotron.\n\n\tINT. CORRIDOR - DAY\n\n\tSebastian, still in his latex and scrubs, but looking \n\tlike he's been dragged through the nine levels of \n\tpurgatory, is escorted back to the recovery chamber by \n\tLinda and Matt.\n\n\tHe crosses to his bed and collapses on it. Closes his \n\teyes.\n\n\t\t\t\tSEBASTIAN\n\t\t\tThe testing's making me sick.\n\n\t\t\t\tLINDA\n\t\t\tCould be the barium or the radiation.\n\n\t\t\t\tMATT\n\t\t\tYou're physiology has changed and, \n\t\t\twell, all bets are off.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI can't believe I have to spend \n\t\t\tanother night here.\n\t\t\t\t (to Linda)\n\t\t\tSuppose you're gonna go home now, meet \n\t\t\tup with that boyfriend of yours now. \n\n\tLinda and Matt exchange a glance. Linda quickly covers.\n\n\t\t\t\tLINDA\n\t\t\tDo you want me to stay?\n\n\t\t\t\tSEBASTIAN\n\t\t\tNo. That's okay. It's just, being a \n\t\t\tguinea pig is more work than I \n\t\t\tthought. I'll be fine.\n\n\tINT. RESEARCH COMPOUND - NIGHT\n\n\tVarious shots of the empty hallways and deserted labs.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tCarter kicks back in his chair listening to his walkman \n\tstereo and playing gameboy.\n\n\tINT. RECOVERY CHAMBER - DAY\n\n\tSebastian, in scrubs and make-up, paces back and forth.\n\n\tHe slams the wall in frustration. He crosses to a mirror \n\tand examines himself. He doesn't look half bad. He pokes \n\this cheeks. There's something about him that's a little \n\toff, but only if you look close.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tA shadow falls across Carter's face. He looks up. It's \n\tSebastian wearing street clothes - jeans and a hooded \n\tsweatshirt over his latex mask.\n\n\tCarter pulls of his earphones.\n\n\t\t\t\tCARTER\n\t\t\t\t (surprised)\n\t\t\tDr. Caine. What's up?\n\n\t\t\t\tSEBASTIAN\n\t\t\tJust stopped by to let you know, I'm \n\t\t\tgoing out for a bit.\n\n\tSebastian turns back into the hallway.\n\n\t\t\t\tCARTER\n\t\t\tGoing out? Hey wait a sec!\n\n\tCarter scrambles to his feet.\n\n\tINT. CORRIDOR - NIGHT\n\n\tCarter catches up with Sebastian.\n\n\t\t\t\tCARTER\n\t\t\tWhat do you mean going out for a bit?\n\n\t\t\t\tSEBASTIAN\n\t\t\tIf I don't get out of here, I'm gonna \n\t\t\tgo crazy.\n\n\t\t\t\tCARTER\n\t\t\tBut you're not supposed to leave the \n\t\t\tcompound.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWhy not?\n\n\t\t\t\tCARTER\n\t\t\tThat's the rule.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYes, but I made that rule. It's my \n\t\t\trule and I'm changing it.\n\n\t\t\t\tCARTER\n\t\t\tYou can't just change it.\n\n\tSebastian hits the elevator button. The doors open.\n\n\t\t\t\tSEBASTIAN\n\t\t\tCarter, I was suppose to be like this \n\t\t\tfor three days. Three fucking days and \n\t\t\tI'll be damned if I'm going to spend \n\t\t\tthe rest of my life as a prisoner in \n\t\t\tthis godforsaken dump. Now I'm going \n\t\t\tout. I'll be back in a couple of \n\t\t\thours. Okay?\n\n\tThe elevator doors close with Sebastian inside. Shit.\n\n\t\t\t\tCARTER\n\t\t\tShit.\n\n\tCarter runs down the corridor.\n\n\tINT OBSERVATION ROOM - NIGHT\n\n\tCarter picks up the phone and dials.\n\n\tA beat then.\n\n\t\t\t\tCARTER\n\t\t\tYeah, it's Carter. We got a problem.\n\n\tINT. WAREHOUSE - NIGHT\n\n\tThe elevator doors open and Sebastian pushes past the \n\tMarine Guard.\n\n\t\t\t\tMARINE GUARD\n\t\t\tHey, Doc. Haven't seen you for awhile? \n\n\tSebastian keeps his face turned away as he crosses to his \n\tPorsche.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYeah, well. You know how it in \n\t\t\tsometimes.\n\n\t\t\t\tMARINE GUARD\n\t\t\tYou got that right, sir. I was \n\t\t\tbeginning to worry 'cause your car \n\t\t\thadn't moved.\n\n\t\t\t\tSEBASTIAN\n\t\t\tThanks, but everything's cool. \n\n\tSebastian starts his car. It chugs a few times before \n\tturning over and speeding out of the warehouse.\n\n\tINT. APARTMENT - NIGHT\n\n\tThe door opens and Sebastian switches on the lights.\n\n\tHe looks around his apartment and sighs. It's good to be \n\thome.\n\n\tINT. BEDROOM - NIGHT\n\n\tSebastian enters the bedroom, clicking on the light. He \n\tlooks at the ceiling, \"You Should Be Working\", and \n\tsmiles.\n\n\tINT. LINDA'S APARTMENT BUILDING, PARKING GARAGE - NIGHT\n\n\tLinda and Matt each rush to their respective cars.\n\n\t\t\t\tMATT\n\t\t\tHe could be anywhere. Hell he could be \n\t\t\tright behind us.\n\n\t\t\t\tLINDA\n\t\t\tI'll meet you at the lab. I'm gonna \n\t\t\tswing by his place, just in case.\n\n\t\t\t\tMATT\n\t\t\tSee you there.\n\n\tMatt tries to give her a quick pack. Linda backs away.\n\n\t\t\t\tLINDA\n\t\t\t\t (quietly, looking around)\n\t\t\tI don't want him to see.\n\n\t\t\t\tMATT\n\t\t\t\t (looking around too)\n\t\t\tWhat a mess.\n\n\tThey get in their cars.\n\n\tINT. SEBASTIAN'S BEDROOM - NIGHT\n\n\tSebastian packs up a few personal belongings in an \n\tovernight duffle. He crosses to his bookcase and pulls \n\tout some books and throws them into the bag.\n\n\tBut as he does, he notices a light come on in the window \n\tacross the courtyard. Sebastian turns off his bedroom \n\tlight and moves toward the window. He peers across the \n\tcourtyard into the Brunette's apartment.\n\n\tHe watches the Brunette as she comes into the living room \n\tfrom her front hallway. She drops her keys on the table \n\tand begins unbuttoning her blouse as she crosses to the \n\twindow. Just as the blouse slips off her shoulder, she \n\tpulls her blinds shut.\n\n\t\t\t\tSEBASTIAN\n\t\t\tShit.\n\n\tFrustrated, Sebastian steps away from the window and then \n\tstops. Something has occurred to him.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tDon't even think it...\n\n\tHe looks down and notices his hand is trembling. His \n\tbreathing is a little heavy. A little nervous. He catches \n\ta glimpse at himself in the mirror.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\t\t (almost whispering)\n\t\t\tOnce...just once.\n\n\tThe Brunette's living room light switches off and the \n\tbathroom light switches on. We see him fighting an \n\tinternal battle and we see him lose it. He grabs a hold \n\tof his hand and peels the latex skin off.\n\n\tEXT. APARTMENT BUILDING - NIGHT\n\n\tLinda drives Sebastian's apartment. She spots his black \n\tPorsche in the parking lot. She pulls over to the curb, \n\tjumps out of her car and heads into the building.\n\n\tINT. BRUNETTE'S APARTMENT, BATHROOM - NIGHT\n\n\tWearing just a robe, the brunette turns on her shower. \n\tThe doorbell rings. With a frustrated sigh, the brunette \n\trises.\n\n\tAT THE FRONT DOOR\n\n\tShe peers through the peep hole. No one's there. But as \n\tshe turns she hears the doorbell again. She opens the \n\tdoor, steps out into the hallway and looks around. Empty. \n\tPuzzled she heads back inside her apartment.\n\n\tWe follow her as she crosses to her bedroom, but a moment \n\tlater, the bedroom door closes on its own.\n\n\tWe hear a SCREAM come from the other side. Then another. \n\tThen a muffled struggled. And we...\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tINT. HALLWAY, SEBASTIAN BUILDING - NIGHT\n\n\tLinda exits the elevator and heads down to Sebastian's \n\tdoor. She knocks. Waits. No answer. She knocks again. \n\tWaits.\n\n\tAnd then she tries the door. It's unlocked. She pushes \n\tthe door open.\n\n\t\t\t\tLINDA\n\t\t\tSebastian?\n\n\tINT. SEBASTIAN'S APARTMENT - NIGHT\n\n\tLinda pushes through the living room, into the bedroom.\n\n\t\t\t\tLINDA\n\t\t\tSebastian?\n\n\tShe notices that the bathroom light is on.\n\n\tBATHROOM\n\n\tOn the floor she finds Sebastian's clothing and on the \n\tvanity she sees his latex face and hands.\n\n\t\t\t\tLINDA\n\t\t\tOh shit.\n\n\tShe scramble for the bedroom phone and quickly dials.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYeah, Matt, it's me. He was here. No. \n\t\t\tHe's taken his make-up off. I don't \n\t\t\tknow...He must be outside somewhere.\n\t\t\tI don't know where he went. I'm coming \n\t\t\tback to the lab. How? How'm I supposed \n\t\t\tto do that? I CAN'T FUCKING SEE HIM! \n\t\t\tWe're going on alpha call.  I want \n\t\t\teveryone at the lab now. We're gonna \n\t\t\tneed thermal visors and we may need \n\t\t\ttranqs.\n\n\tAs she hangs up the phone, and heads out. The CAMERA \n\tdoesn't follow, but instead pushes through the blinds and \n\tout the window. As we cross the courtyard, we begin to \n\thear muffled cries of terror. We hold on the Brunette's \n\twindow as we...\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tINT. BRUNETTE'S APARTMENT - NIGHT\n\n\tThe bedroom door opens and we see the Brunette, nude and \n\tcurled up on the bed, sobbing. We follow the sounds of \n\theavy breathing to the front door of her apartment. The \n\tdoor opens and we push out into the hallway. We can see \n\tindentations of feet appear on the hallway carpet.\n\n\tINT. CORRIDOR BY SEBASTIAN'S APARTMENT\n\n\tThe elevator doors open and Linda steps inside. The doors \n\tclose shut behind her. A beat later we see the \n\tindentations of footsteps come around the corner. We \n\tfollow the breathing and stumbling footfalls back into...\n\n\tINT. SEBASTIAN'S APARTMENT - NIGHT\n\n\tWe push over to the bathroom sink. The faucet turns on \n\tand the water starts running.\n\n\tWe see the water cup under the faucet and splash against \n\tSebastian's face. His face appears briefly in the water. \n\tThen the water slips away.\n\n\tFor second it sounds like he's crying, but then we hear \n\tsomething far worse. He's laughing. Nervous laughter.\n\n\tINT. CONFERENCE ROOM - NIGHT\n\n\tMatt hands out thermal goggles, while Frank loads and \n\tpasses out tranquilizer guns.\n\n\t\t\t\tJANICE\n\t\t\tWhat are the tranqs for?\n\n\t\t\t\tLINDA\n\t\t\tUse your imagination.\n\n\t\t\t\tJANICE\n\t\t\tAre you saying he's dangerous?\n\n\t\t\t\tMATT\n\t\t\tWe're just saying we need to be \n\t\t\tcautious.\n\n\t\t\t\tLINDA\n\t\t\tThe Metro stops running after midnight \n\t\t\tand he's on foot, so he can't have \n\t\t\tgotten too far.\n\n\t\t\t\tCARTER\n\t\t\tLook, this isn't a monkey we're \n\t\t\ttalking about. It's Dr. Caine. Don't \n\t\t\tyou think you're over reacting?\n\n\t\t\t\tLINDA\n\t\t\tThis program is classified. If he's \n\t\t\tout there it means someone might find \n\t\t\tout about him. He could destroy the \n\t\t\twhole program.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tRelax, Linda. No one's gonna find out. \n\n\tThey all turn around. At the door is Sebastian, back in \n\this latex outfit.\n\n\t\t\t\tMATT\n\t\t\tWhere the hell have you been?\n\n\t\t\t\tSEBASTIAN\n\t\t\tI got a little stir crazy, so I went \n\t\t\tto my apartment to pick up some stuff.\n\n\t\t\t\tLINDA\n\t\t\tBullshit! I went to your apartment and \n\t\t\tI happen to know you did a helluva lot \n\t\t\tmore than pick some stuff up.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWhat are you talking about?\n\n\t\t\t\tLINDA\n\t\t\tYou, of all people How could you? \n\n\tCaught dead to rights, Sebastian sinks into his chair. He \n\tthinks she knows.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYou put yourself and this project at \n\t\t\trisk.\n\n\t\t\t\tSEBASTIAN\n\t\t\tJust what did you see in my apartment?\n\n\t\t\t\tLINDA\n\t\t\tI saw your face and your clothes.\n\n\t\t\t\tMATT\n\t\t\tIt was bad enough you left without an \n\t\t\tescort, but to take off the...\n\t\t\t\t (he motions to his face)\n\t\t\tout in public?\n\n\tSebastian realizes that they don't know.\n\n\t\t\t\tSEBASTIAN\n\t\t\tDon't make a mountain out of molehill. \n\t\t\tI didn't let anyone see me.\n\n\t\t\t\tLINDA\n\t\t\tThat's not good enough. When you're \n\t\t\toutside the lab there are a thousand \n\t\t\tvariables none of us can control. It's \n\t\t\tjust not safe for you to be out there.\n\n\t\t\t\tSEBASTIAN\n\t\t\tCome on, Linda. You don't expect me to \n\t\t\tbe some kind of prisoner.\n\n\t\t\t\tLINDA\n\t\t\tYou volunteered for this, Sebastian. \n\t\t\tYou knew going in there could be \n\t\t\tconsequences.\n\t\t\t\t (beat)\n\t\t\tFor the security of this project, I'm \n\t\t\tgonna have to ask you to confine \n\t\t\tyourself to the compound.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI'm still Project Leader, Linda. It's \n\t\t\tmy decision to make.\n\n\t\t\t\tLINDA\n\t\t\tYou're right. It's your decision. But \n\t\t\tif you leave the compound again, I'll \n\t\t\tnotify the oversight committee. Then \n\t\t\tthey can make the decision. You \n\t\t\tunderstand?\n\n\t\t\t\tSEBASTIAN\n\t\t\tMatt?\n\n\t\t\t\tMATT\n\t\t\tSorry, man. You'd do the same if it \n\t\t\twere the other way around.\n\n\tA long beat. Sebastian slowly rises, acknowledges Linda \n\twith a nod and leaves the room. Linda looks around at her \n\tsilent co-workers, the goggles and tranqs still on the \n\ttable.\n\n\t\t\t\tLINDA\n\t\t\tPack 'em up... Everyone go home.\n\n\t\t\t\t\t\t\t\t\n\tDISSOLVE TO:\n\n\tINT. LABORATORY - DAY\n\n\tThe Lab is buzzing with the usual activity. Linda rolls \n\tup Sebastian's sleeve, revealing nothing.\n\n\t\t\t\tLINDA\n\t\t\tHold still.\n\n\tShe wraps a bungee cord around the nothing and pulls it \n\ttight. She then sprays the inside of his elbow with dye.\n\n\t\t\t\tSEBASTIAN\n\t\t\t\t (contentious)\n\t\t\tHow much blood do you think you've \n\t\t\ttaken so far?\n\n\tThe surface of his skin sheens in the light as Linda \n\tsearches for a vein. She slaps his arm several times, \n\tthen plunges a hypodermic needle into his skin.\n\n\t\t\t\tLINDA\n\t\t\tNot enough to worry about.\n\n\t\t\t\tSEBASTIAN\n\t\t\tEvery day... feels like you're sucking \n\t\t\tme dry.\n\n\tLinda presses down on the hypodermic plunger, releasing a \n\tdye into his bloodstream.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tIt's funny. All these years I've known \n\t\t\tyou, I never pegged you for a \n\t\t\tmegalomanic.\n\n\t\t\t\tLINDA\n\t\t\tWhat are you talking about?\n\n\t\t\t\tSEBASTIAN\n\t\t\tThe shoe being on the other foot. You \n\t\t\tgetting to run things.\n\n\t\t\t\tLINDA\n\t\t\tI didn't ask for this, Caine. But when \n\t\t\ta classified experiment disappears in \n\t\t\tthe middle of the night, someone's \n\t\t\tgotta run the show.\n\t\t\t\t (tries sympathy)\n\t\t\tLook, I know how hard this has been \n\t\t\tfor you.\n\n\tHe knocks her arm away and pulls the hypo, out of his \n\tarm.\n\n\t\t\t\tSEBASTIAN\n\t\t\tDon't patronize me.\n\t\t\t\t (beat)\n\t\t\tAnd for the record, you've got no idea \n\t\t\twhat it's like. I get up every morning \n\t\t\tand you people stick needles in me. \n\t\t\tYou bombard me with radiation until I \n\t\t\tvomit. And then at six it's over for \n\t\t\tyou. You get to go home. But Sebastian \n\t\t\tis still here. Sebastian can't leave, \n\t\t\tor else. That's the worst part, you \n\t\t\tknow. Here I have this ... this GIFT \n\t\t\tand I can't even use it.\n\n\t\t\t\tLINDA\n\t\t\tNow it's a gift?\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou're goddamn right it's a gift. And \n\t\t\tif you weren't so goddamned short \n\t\t\tsighted, I'd be out there right now \n\t\t\ttrying to master it. \n\n\tSebastian looks around at the other scientists staring at \n\thim. He tosses the hypo with the needle onto the \n\tinstrument tray and heads toward the door.\n\n\t\t\t\tLINDA\n\t\t\tWhere're you going?\n\n\t\t\t\tSEBASTIAN\n\t\t\tLooks like I'm going nowhere.\n\n\t\t\t\tMATT\n\t\t\tCome on, man. We've got a ton of tests \n\t\t\tscheduled today.\n\n\t\t\t\tSEBASTIAN\n\t\t\tDo them yourself.\n\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\tLinda enters to find Sebastian reading the collected \n\tworks of T.S. Elliot.\n\n\t\t\t\tLINDA\n\t\t\tWant to talk about it?\n\n\t\t\t\tSEBASTIAN\n\t\t\tNo.\n\n\tLinda looks over his shoulder.\n\n\t\t\t\tLINDA\n\t\t\t\"We are the hollow men, the stuffed \n\t\t\tmen, headpieces filled with straw.\"\n\n\t\t\t\tSEBASTIAN\n\t\t\tFunny, huh? I've become a literal \n\t\t\tmetaphor.\n\n\tHe puts the books down.\n\n\t\t\t\tLINDA\n\t\t\tI don't want to fight you. I just want \n\t\t\twhat's best for the program.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI know. And you being right doesn't \n\t\t\tmake it any easier for me.\n\n\t\t\t\tLINDA\n\t\t\tYou can be scared. That's okay.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI'm not scared of being stuck this \n\t\t\tway. With a little more make-up and \n\t\t\tpractice, I could...\n\t\t\t\t (he motions to his face)\n\t\t\t... pass. Y'know, get by in the world. \n\t\t\tBut the testing...\n\n\t\t\t\tLINDA\n\t\t\tYou're talking like you've given up. \n\t\t\tIt's only been a few months.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWhat if it's years? I don't know how \n\t\t\tmuch more testing I can take.\n\n\tINT. RECOVERY CHAMBER - LATER\n\n\tSebastian paces back and forth, glancing at the camera.\n\n\tINT. LABORATORY - DAY\n\n\tLinda, Matt and Sebastian, in latex and scrubs, stare at \n\tan electron microscope's video display. On the screen in \n\ta sparse colony of blood calls but every second more and \n\tmore cells appear, filling the gap.\n\n\t\t\t\tMATT\n\t\t\t60% reversion. 70% ... 75% ... 80% ...\n\t\t\t85 ...\n\n\tThe others in the lab listen. They start to get excited. \n\tJanice and Carter leave their research and come over to \n\twatch the screen.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWe've got it. We've got it.\n\n\t\t\t\tMATT\n\t\t\t93% ... 95%... 95%\n\n\tThey wait. Linda points to a blank patch on the screen.\n\n\t\t\t\tLINDA\n\t\t\tThat's all we need.\n\n\t\t\t\tSEBASTIAN\n\t\t\tCome on, baby. Come on.\n\n\tBut the blood cells nearest the blank patch twinkle out \n\texistence, and then those around them also blink away \n\tuntil after a beat, the screen is empty.\n\n\t\t\t\tMATT\n\t\t\tFull quantum cascade at 95%.\n\t\t\t\t (beat)\n\t\t\tI'm sorry.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou're sorry? You're fucking sorry? \n\n\tSebastian picks up a glass beaker and hurls it against \n\tthe wall. It shatters.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tSix weeks of this shit and you're \n\t\t\tsorry!\n\n\tHe grabs more equipment and begins tossing it in a rage. \n\tCarter and Janice grab him and restrain him. After \n\tstruggling against them a beat or two, Sebastian calms \n\tdown and pushes away from them and heads out the door.\n\n\t\t\t\tJANICE\n\t\t\tI don't blame him.\n\n\t\t\t\tLINDA\n\t\t\tI'll go talk to him.\n\n\t\t\t\tMATT\n\t\t\tLeave him alone. He just needs to blow \n\t\t\toff some steam.\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\t\t\t\t\t\t\t\t\t\n\tCUT TO:\n\n\tSebastian lies in his bed, staring at the security \n\tcamera. The camera stares back at him.\n\n\tAs if from a dream, we hear the Brunette's muffled scream \n\tand cries for help. As we push in on Sebastian's cold \n\teyes, we can barely make out her face thrashing back in \n\tforth in panic and confusion.\n\n\tSebastian suddenly rises.\n\n\tHe crosses to the video camera and examines a small panel \n\ton the underneath of the camera.\n\n\tHe reaches into a box of twinkies and pulls out one of \n\tthe sponge cakes and begins munching. He hits the \n\tintercom button on the phone.\n\n\t\t\t\tFRANK (V.0.)\n\t\t\tYeah?\n\n\t\t\t\tSEBASTIAN\n\t\t\tI'm going to the lab.\n\n\t\t\t\tFRANK (V.0.)\n\t\t\tDon't you sleep?\n\n\t\t\t\tSEBASTIAN\n\t\t\tWaste of time. Da Vinci never slept.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tFrank eyes Sebastian in the monitor.\n\n\t\t\t\tFRANK\n\t\t\tOkay. I'm here if you need me.\n\n\tHe watches as Sebastian's heat signature moves toward the \n\tdoor.\n\n\tINT. LABORATORY - NIGHT\n\n\tIn the dark deserted lab, Sebastian pulls together a \n\tcircuit board, a computer chip and some wiring. He seems  \n\tbe assembling something.\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\tSebastian crosses underneath the camera... just out of \n\tits range... reaches up and using a screwdriver, unscrews \n\tthe access panel. He scans the electronics and attaches \n\ttwo alligator clips to wires on the circuit board.\n\n\tTrailing a long length of wire, Sebastian crosses back to \n\this bed and lies down. He holds a black project box with \n\ta button on it. He lies perfectly still and press the \n\tbutton.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tThe video image of the Recovery Chamber flickers \n\tslightly, before returning to normal.\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\tSebastian rises and begins to peel off his latex.\n\n\tINT. HALLWAY OF HABITATS - NIGHT\n\n\tSebastian's POV - Various animals stir restlessly. A DOG, \n\tvisible, leaps against the Plexiglas, barking wildly. We \n\tpush further down the corridor.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tAgain, Sebastian's POV as he pushes through the open door \n\tof the observation room. We see Frank sorting through \n\tvarious computer readouts, highlighting certain coding \n\tsequences.\n\n\tWe push in until we are looking over Frank's shoulder at \n\tthe video monitor. According to the video, Sebastian is \n\tsleeping soundly in his room.\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\tThe rewired security camera stares down at the empty bed.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tFrank glances over at the video monitor. He can see \n\tSebastian's heat signature lying in the bed.\n\n\tFrank feels something on his neck. He flicks whatever it \n\tis away with his hand and goes back to work.\n\n\tINT. WAREHOUSE - NIGHT\n\n\tThe elevator door opens. The Guard turns around. The \n\televator is empty.\n\n\tINT. METRO STATION, WASHINGTON D.C. - NIGHT\n\n\tA Metro Subway train draws to a halt. With a cautionary \n\t\"BING BONG\" its doors slide open. A handful of people \n\texit and enter. One man bumps shoulders. He turns round \n\tto apologize, but there's no one there. The doors close \n\tand the train pulls out of the station.\n\n\tEXT. DOWNTOWN D.C. - NIGHT\n\n\tA couple of pretty girls exit a bar and stumble to their \n\tapartments.\n\n\tINT. APARTMENT - NIGHT\n\n\tOne of the girls enters her apartment. The door half \n\tcloses behind her and then reopens and closes again.\n\n\tINT. OBSERVATION ROOM - MORNING\n\n\tFrank's reading a book when Linda and Matt enter.\n\n\t\t\t\tMATT\n\t\t\tHow'd it go?\n\n\t\t\t\tFRANK\n\t\t\tQuiet. He worked in the lab till about \n\t\t\t10:30 and then went to sleep.\n\n\tINT. RECOVERY CHAMBER - DAY\n\n\tClose on the security camera. The wires have been removed \n\tand the access panel replaced.\n\n\tSebastian whistles a cheerful tune as he finishes \n\tapplying his makeup. The door opens and Linda and Matt \n\tenter.\n\n\t\t\t\tSEBASTIAN\n\t\t\tAh, my two favorite people. Good \n\t\t\tmorning.\n\n\t\t\t\tLINDA\n\t\t\tGood morning.\n\n\t\t\t\tMATT\n\t\t\tWhy so cheery this morning?\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou know some days you just wake up \n\t\t\tfeeling the world is full of \n\t\t\tpotential. Like your eyes have been \n\t\t\topened.\n\n\t\t\t\tMATT\n\t\t\tI'm happy if I make it to my coffee \n\t\t\tmachine.\n\n\tLinda hands Sebastian a disk.\n\n\t\t\t\tLINDA\n\t\t\tI restructured the third genome on \n\t\t\tyour radiated protein strand. Thought \n\t\t\tyou might want to take look.\n\n\t\t\t\tSEBASTIAN\n\t\t\tCook up a batch and let's see where we \n\t\t\tgo.\n\n\t\t\t\tLINDA\n\t\t\tI thought you'd want to take a look at \n\t\t\tit.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI trust you. Now if you'll excuse me, \n\t\t\tI need to have my head examined.\n\n\tINT. STORAGE FREEZER - DAY\n\n\tLinda pulls bags of frozen plasma from the shelves in the \n\twalk-in storage freezer.\n\n\t\t\t\tLINDA\n\t\t\tI'm telling you, I know him. \n\t\t\tSomething's going on.\n\n\t\t\t\tMATT\n\t\t\tThink he knows about us.\n\n\t\t\t\tLINDA\n\t\t\tIf he knew about us, he'd be angry and \n\t\t\tthat wasn't angry.\n\n\tINT. CORRIDOR - DAY\n\n\tJanice heads up one of the corridors when something on \n\tthe floor catches her eye. She bends down and takes a \n\tlook at it. Barely visible on the floor is a fragment of \n\ta BAREFOOT FOOTPRINT.\n\n\tShe runs her finger along the dried mud. It turns to \n\tdust.\n\n\tINT. LABORATORY - DAY\n\n\tSebastian holds his latex head on his lap, while EEG \n\tleads hang suspended in mid-air, outlining his real head. \n\tCarter analyzes the results.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWhen you were a kid, you ever dream \n\t\t\tabout being invisible?\n\n\t\t\t\tCARTER\n\t\t\tSure... all the time.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWhat did you imagine you'd do?\n\n\t\t\t\tCARTER\n\t\t\tThe usual.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWhat's the usual?\n\n\t\t\t\tCARTER\n\t\t\tHanging out in the girl's locker room. \n\t\t\tKicking Jimmy Margiani's ass.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tJimmy Margiani?\n\n\t\t\t\tCARTER\n\t\t\tSchool asshole. Drove a red Trans Am. \n\t\t\tBack then, I was the size of a small \n\t\t\tplanet and made a rather large target.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tEver think up anything along the grand \n\t\t\tscale?\n\n\t\t\t\tCARTER\n\t\t\tSure. World domination. Manipulating \n\t\t\tstock markets, consolidating a \n\t\t\tpolitical power base. But those are \n\t\t\tmore recent fantasies.\n\n\tCarter pulls off the electrodes and Sebastian slides on \n\this latex facemask.\n\n\t\t\t\tSEBASTIAN\n\t\t\tAnd what if it weren't fantasy? What \n\t\t\tif you were out there in the world and \n\t\t\tcould do whatever you wanted with no \n\t\t\tconsequences whatsoever. How far would \n\t\t\tgo? I mean... if it were real?\n\n\t\t\t\tCARTER\n\t\t\tI don't know, man. Out in the real \n\t\t\tworld... I mean, there's a \n\t\t\tresponsibility...\n\n\t\t\t\tSEBASTIAN\n\t\t\tLet's say you saw a woman with amazing \n\t\t\ttits. Would you brush against them?\n\n\t\t\t\tCARTER\n\t\t\tHell, I try and do that now.\n\n\t\t\t\tSEBASTIAN\n\t\t\tHuman nature. So if you could get away \n\t\t\twith more, would you do more?\n\n\t\t\t\tCARTER\n\t\t\tI read that in a survey at a major \n\t\t\tuniversity they asked college students \n\t\t\t\"Would you steal if you were \n\t\t\tguaranteed to get away with it?\" 82% \n\t\t\tsaid yes.\n\n\t\t\t\tSEBASTIAN\n\t\t\tEighty two percent? Makes you wonder \n\t\t\tif the world's ready for what we're \n\t\t\tdoing.\n\n\t\t\t\tCARTER\n\t\t\tSo, Doc what did you do?\n\n\t\t\t\tSEBASTIAN\n\t\t\tWhat do you mean?\n\n\t\t\t\tCARTER\n\t\t\tWhen you were out.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI just walked around. Y'know.\n\n\t\t\t\tCARTER\n\t\t\tAw, you just walked around? Come on. \n\t\t\tThere's more, right?\n\n\t\t\t\tSEBASTIAN\n\t\t\tLike what?\n\n\t\t\t\tCARTER\n\t\t\tMan, I'd be walking up to people \n\t\t\tsaying shit like \"This is God, go,get \n\t\t\ta haircut.\" Or hanging out in the \n\t\t\tchanging room at Victoria's Secret.\n\n\t\t\t\tSEBASTIAN\n\t\t\tKind of sophomoric, don't you think. \n\t\t\tBesides, it was late and I wasn't out \n\t\t\tthat long.\n\n\t\t\t\tCARTER\n\t\t\tWell, did you see anybody?\n\n\t\t\t\tSEBASTIAN\n\t\t\tThere was this one girl.\n\n\t\t\t\tCARTER\n\t\t\tYeah? And did you mess with her? \n\n\t\t\t\tSEBASTIAN\n\t\t\tNaw...\n\n\tSebastian gives Carter a sly grin.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tWell maybe a little.\n\t\t\t\t (beat)\n\t\t\tI tell you though, a man could get \n\t\t\tused to it.\n\n\tINT. LABORATORY - NIGHT\n\n\tAlone, Linda packs up her stuff for the evening.\n\n\tSlowly we push in on her and hear quiet breathing. We \n\trealize we are in...\n\n\tSEBASTIAN'S POV\n\n\tThen ...\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tGoodnight.\n\n\tLinda-jumps.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tSorry, didn't mean to frighten you.\n\n\t\t\t\tLINDA\n\t\t\tIt's fine. I just didn't know you were \n\t\t\tthere. Goodnight.\n\n\tAs she leaves the Lab, he follows her down the hallway.\n\n\tEXT. LINDA'S APARTMENT BUILDING - NIGHT\n\n\tLinda passes through the revolving doors of her apartment \n\tbuilding. A few beats later, as if caught by a gust of \n\twind, the revolving door slowly turns on its own.\n\n\tINT. APARTMENT'S HALLWAY - NIGHT\n\n\tLinda slips into her apartment and the door closes behind \n\ther. A moment later we see the doorknob turn back and \n\tforth. It's locked.\n\n\tEXT. ALLEY - NIGHT\n\n\tOn a fire escape, we see the ladder shake and descend to \n\tthe ground. The metal rattles back and forth as if \n\tsomething were climbing it.\n\n\tWe slowly crane up the fire escape and hold on a window. \n\tThrough the wispy curtains and dirty glass we can see \n\tLinda enter the room. The panel of glass fogs from \n\tSebastian's breath. The fog wipes away, seemingly by \n\titself.\n\n\tBut then through the window we see Matt walk into the \n\tliving room and put his arms around Linda's waist. We \n\thear a shocked intake of air.\n\n\tHe kisses her neck and then slowly unzips her dress. Her \n\tdress falls to the floor. Matt takes off his sport coat \n\tand drapes it over a chair, while Linda unfastens the \n\tbuttons of his shirt. They're laughing now, exchanging \n\tkisses.\n\n\tMatt reaches behind Linda and unhooks her bra. He kisses \n\this way down her neck to her breasts. Linda pulls him to \n\ther.\n\n\tSuddenly the window shatters. Startled, both Matt and \n\tLinda jump back covering themselves.\n\n\tWe hear Sebastian's footsteps as he retreats down the \n\tfire escape.\n\n\tA moment later Matt reaches the window and peers out. He \n\tsees the fire escape ladder slowly rise back up down \n\tbelow.\n\n\t\t\t\tLINDA\n\t\t\tWhat was it?\n\n\t\t\t\tMATT\n\t\t\tI don't know. I don't see anything. \n\n\tMatt picks up a piece of glass and examines it.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tIt's like something hit it.\n\n\tLinda picks up the phone and dials.\n\n\tINT. OBSERVATION ROOM - NIGHT\n\n\tCarter picks up the phone.\n\n\t\t\t\tCARTER\n\t\t\tHello?\n\n\tCarter looks at the security monitor of the recovery \n\troom. Sebastian's heat signature lies still on the bed.\n\n\t\t\t\tCARTER (cont'd)\n\t\t\tNo. No. He's here No, I'm staring at \n\t\t\thim. He's right there in his room.\n\n\tINT. LINDA'S APARTMENT - NIGHT\n\n\tLinda breathes a sigh of relief.\n\n\t\t\t\tLINDA\n\t\t\tThanks. No, just checking. 'Kay, bye.\n\t\t\t\t (hangs up phone)\n\t\t\tPhew.\n\n\tMatt pulls her into him.\n\n\t\t\t\tMATT\n\t\t\tRelax... it's nothing. Where were we?\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\tBARKING can be heard in the background. That horrible \n\trepetitive barking that grates the soul like Chinese \n\twater torture.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tBe quiet!\n\n\tA photograph of Linda drifts through the air and settles \n\tatop a flaming candle. It ignites into fire, twisting and \n\tturning in mid-air, then falling on the floor as ash. A \n\tbeat later water runs from the sink faucet. It forms in \n\tthe shape of hands and splashes against his face, \n\tdripping away.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tAnd the cyclops screamed out, \"Who is \n\t\t\tit who blinds me?\" and Odysseus \n\t\t\treplied \"Nobody is my name\". And the \n\t\t\tCyclops raged to his friends \"Nobody \n\t\t\tis killing me. Nobody\".\n\n\tThe barking continues. A moment later the chamber door \n\tslides open. We push down the...\n\n\tHALLWAY OF THE HABITATS\n\n\t... until we are face-to-face with the unhappy barking \n\tdog.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tShhhh. It's Nobody-It's nothing.\n\n\tThe Plexiglas door to the doggie's cage swings open and \n\tsome invisible force grabs little doggie around the neck. \n\tThe force squeezes its little fur ball throat until the \n\tbarking stops.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tNobody's gonna hurt you. \n\n\tThe force keeps squeezing until the little doggie goes \n\tlimp. Then the dog smashes against the Plexiglas over and \n\tover until blood spills out its mouth. The Plexiglas door \n\tswings closed again and moments later the door to \n\tSebastian's cubicle closes as well. The water runs in \n\tSebastian's sink washing the blood away from his now half \n\tvisible hands.\n\n\t\t\t\t\t\t\t\t\n\tDISSOLVE TO:\n\n\tINT. HABITAT'S CORRIDOR - NEXT MORNING\n\n\tSarah sees the dead dog lying prone on its bedding. She \n\teyes it curiously and opens the cage door.\n\n\tINT. RECOVERY CHAMBER - LATER\n\n\tSarah stares at the empty chamber.\n\n\t\t\t\tSARAH\n\t\t\tYou awake?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI am now.\n\n\tThe sheets raise and drape off of him.\n\n\t\t\t\tSARAH\n\t\t\tNotice anything unusual last night. \n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tNo. Why?\n\n\t\t\t\tSARAH\n\t\t\tFranklin Three. He's dead.\n\n\tSebastian pulls a sheet around him. He moves across the \n\tdimly lit room like a ghost.\n\n\t\t\t\tSEBASTIAN\n\t\t\tWhat of?\n\n\t\t\t\tSARAH\n\t\t\tHis neck was broken and his windpipe \n\t\t\tcollapsed.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tHow'd that happen?\n\n\t\t\t\tSARAH\n\t\t\tI thought maybe you could tell me.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tSarah... You saying I had something to \n\t\t\tdo with it?\n\n\t\t\t\tSARAH\n\t\t\tHe was alive last night when I left \n\t\t\tand he was dead this morning. And you \n\t\t\twere the only one down here.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI was in my room all night.\n\n\tINT. OBSERVATION ROOM - DAY\n\n\tSarah sits with Carter as they run through the security \n\tvideo tape. Matt and Linda look over their shoulder.\n\n\t\t\t\tCARTER\n\t\t\tThat's all twelve hours.\n\n\t\t\t\tLINDA\n\t\t\tHe never left the room.\n\n\t\t\t\tSARAH\n\t\t\tA windpipe doesn't just suddenly \n\t\t\tcollapse. Someone or something killed \n\t\t\tit.\n\n\t\t\t\tMATT\n\t\t\tYou saw the tape. The man was in his \n\t\t\tchamber.\n\n\t\t\t\tSARAH\n\t\t\tThen we have a problem, because I the \n\t\t\tcage was locked from the outside. That \n\t\t\tmeans it was opened, the dog was \n\t\t\tkilled and the cage was closed and \n\t\t\tlocked again. Only a human could do \n\t\t\tthat.\n\n\t\t\t\tCARTER\n\t\t\tWell, it wasn't me.\n\n\t\t\t\tMATT\n\t\t\tAnd it wasn't him.\n\n\t\t\t\tLINDA\n\t\t\tAre we sure?\n\n\tINT. RECOVERY CHAMBER - NIGHT\n\n\tLinda passes Sebastian's chamber. Sebastian's in latex.\n\n\t\t\t\tSEBASTIAN\n\t\t\tAny big plans for tonight?\n\n\t\t\t\tLINDA\n\t\t\tQuiet night at home. Maybe a book.\n\n\t\t\t\tSEBASTIAN\n\t\t\tReally? Whatever happened to that guy \n\t\t\tyour were seeing?\n\n\t\t\t\tLINDA\n\t\t\tHe's still in the picture. Why?\n\n\t\t\t\tSEBASTIAN\n\t\t\tBeing locked down here, I'm forced to \n\t\t\tlive vicariously. Someday you'll have \n\t\t\tto tell me what he's like.\n\n\t\t\t\tLINDA\n\t\t\tMaybe someday I will. See you in the \n\t\t\tmorning.\n\n\t\t\t\tSEBASTIAN\n\t\t\tAu domain.\n\n\tSebastian watches Linda walk away. He glances at the \n\tcamera and starts to peel off his face.\n\n\tINT. WAREHOUSE - NIGHT\n\n\tThe elevator door opens. It's empty.\n\n\tSEBASTIAN'S POV - as we push past the guard and down onto \n\tthe street.\n\n\tEXT. STREET - NIGHT\n\n\tEmpty street. We hear whistling. Splashes of water splat \n\tout from shallow puddles,,as Sebastian walks through \n\tthem.\n\n\tSEBASTIAN'S POV - A car approaches. As it drives by we \n\tsee Matt and Linda inside, heading back to the warehouse.\n\n\tThe footsteps stop.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tHmmm.\n\n\tWe see the footsteps start to head back toward the \n\twarehouse.\n\n\tINT. WAREHOUSE - NIGHT\n\n\tLinda and Matt exit their car and cross toward the \n\televator.\n\n\t\t\t\tLINDA\n\t\t\t\t (to Marine Guard)\n\t\t\tForgot something.\n\n\tINT. STREET IN FRONT OF WAREHOUSE - NIGHT\n\n\tAs we watch the footsteps head back through the puddles \n\ttoward the warehouse, we see Frank pass us in his car.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWhat the hell?\n\n\tHe breaks into a run. Feet splash water and he races back \n\ttoward the warehouse.\n\n\tINT. ELEVATOR - NIGHT\n\n\tEmpty. The elevator door opens and we push out into the \n\thallway. Sebastian's POV\n\n\tINT. HALLWAY OF HABITATS - NIGHT\n\n\tWe follow Sebastian down the hallway to his cubicle. But \n\tas he rounds the corner, he quickly ducks back. The \n\tentire research team is in his cubicle. Sebastian slowly \n\tapproaches and watches as Frank takes down his video \n\tboard.\n\n\t\t\t\tFRANK\n\t\t\tPretty clever really. All it does is \n\t\t\trecycle the signal. He flips this \n\t\t\tswitch, it takes a snapshot and that's \n\t\t\tall we see.\n\n\t\t\t\tLINDA\n\t\t\tAsshole.\n\n\t\t\t\tJANICE\n\t\t\tAnd you think he's violent?\n\n\t\t\t\tSARAH\n\t\t\tHe killed a dog with his bare hands.\n\n\t\t\t\tFRANK\n\t\t\tDogs aren't people. Are we in any \n\t\t\tdanger?\n\n\tLinda doesn't know.\n\n\t\t\t\tLINDA\n\t\t\tEither way, we aren't equipped to \n\t\t\thandle this. We have to inform the \n\t\t\tcommittee.\n\n\tEverybody murmurs in agreement.\n\n\t\t\t\tJANICE\n\t\t\tWhat if he doesn't come back?\n\n\t\t\t\tLINDA\n\t\t\tThey'll go after him.\n\t\t\t\t (beat)\n\t\t\tWho has tonight's shift?\n\n\t\t\t\tJANICE\n\t\t\tI do.\n\n\t\t\t\tLINDA\n\t\t\tPretend nothing's wrong. Everyone just \n\t\t\tdo what you're doing so he doesn't \n\t\t\tbecome suspicious. Okay? Matt and I'll \n\t\t\tgo tell Doctor Kramer and we'll lot \n\t\t\tthe committee deal with it. \n\n\tSebastian's POV - He backs away and races down the hall.\n\n\tEXT. DR. KRAMER'S HOUSE - POTOMAC MD - NIGHT\n\n\tThe stately stone house sits on a finely manicured lawn \n\tin one of the nicest neighborhoods in town. Linda's car \n\tis parked on the curb in front.\n\n\tWe break from a typical establishing shot and as the \n\tCAMERA tracks closer to the house, we realize that we are\n\n\tSEBASTIAN'S POV\n\n\tWe hear breathing and footsteps as we push through some \n\tbushes and head toward a bay window which looks into the \n\tKramer living room.\n\n\tThrough the glass we see LINDA and MATT seated across \n\tfrom DR. KRAMER. We can't hear what they're saying but it \n\tcertainly looks serious. Kramer puffs on a pipe and \n\tstrokes his beard, shaking his head.\n\n\tKramer rises and shakes hands with Linda and Matt, and \n\tthe three of them head toward the front door.\n\n\tWe move away from the window and track toward the front \n\tdoor. As the door opens we begin to hear the tail end of \n\tthe conversation.\n\n\t\t\t\tKRAMER\n\t\t\tI'll call General Caster right now and \n\t\t\tconvene the oversight committee \n\t\t\ttomorrow.\n\n\t\t\t\tLINDA\n\t\t\tThank you, sir.\n\n\t\t\t\tMATT\n\t\t\tWhat do we do in the meantime?\n\n\t\t\t\tKRAMER\n\t\t\tJust sit tight and wait for my call. \n\n\tMatt and Linda head down to her car. Kramer heads back \n\tinside.\n\n\tINT. KRAMER'S HOUSE - NIGHT\n\n\tKramer heads back into the living room. His wife appears \n\ta the upstairs railing.\n\n\t\t\t\tMRS. KRAMER\n\t\t\tWhat was that about?\n\n\t\t\t\tKRAMER\n\t\t\tJust a little trouble at work.\n\n\t\t\t\tMRS. KRAMER\n\t\t\tYou coming up?\n\n\t\t\t\tKRAMER\n\t\t\tIn a minute. I have to make a few \n\t\t\tcalls.\n\n\tMrs. Kramer retreats back to her bedroom as Dr. Kramer \n\tcrosses over to the telephone. He picks up the receiver \n\tand starts dialing. In the middle of dialing, the phone \n\tgoes dead. He clicks the hookswitch up and down trying to \n\tget a dial tone. Nothing. He checks the connections on \n\tthe phone and then follows the wiring to the wall. The \n\tline's plugged in. Weird. He hears a door creak open in \n\tthe kitchen.\n\n\t\t\t\tKRAMER (cont'd)\n\t\t\tHello? Hello?\n\n\tKramer crosses to the darkened kitchen. The kitchen door \n\tleading to the backyard is open. Puzzled, he crosses to \n\tit. A wind stirs across the pool and backyard, swirling \n\tdead leaves in small twists of wind. The windchime rings \n\tlightly. Kramer steps out.\n\n\tEXT. POOL/PATIO, BACKYARD - NIGHT\n\n\tIn the dim spillover light from house, Kramer crosses to \n\tthe telephone- box against the back of the house. It Is \n\topen and several of the wires have been pulled. He looks \n\taround, spooked and puffs out a cloud of smoke from his \n\tpipe. For the briefest of instants, Sebastian's face is \n\tvisible in the smoke. Kramer jumps back in surprise and \n\tthe pipe drops from his mouth. He gives a small sharp \n\tcry, but deep indentations appear across his mouth and \n\this cries are stifled. In the darkness, we can make out \n\this form writhing as if possessed. The struggle continues \n\ta beat until Kramer manages to break free.\n\n\t\t\t\tKRAMER\n\t\t\tHelp! HELP! MARTHA! HELP!\n\n\tAs Kramer runs, he looks behind him. But no one's there. \n\tWHAM! Something slams into Kramer and he tumbles, rolling \n\tinto the pool. But as he hits water there's not just one \n\tsplash, but TWO. In the water next to him is human shaped \n\tAIR-POCKET. It's Sebastian displacing the water. And \n\tbecause of the water displacement, we can clearly see two \n\tarms pushing Kramer beneath the water's surface. \n\n\tMARTHA KRAMER opens the bedroom window and looks down at \n\tthe pool. All she can see is her husband drowning... his \n\tflailing limbs kicking up a massive air bubble around \n\thim. She races from the window. Kramer kicks and flails \n\tfor a few moments and then his limbs stop moving. A \n\tmoment later he floats to surface, face down. The AIR \n\tPOCKET bobs over to the pool ladder, and rising from the \n\tpool, we see Sebastian's body outlined in sheets of \n\twater. The shape melts away in a cascading waterfall \n\tuntil all we can see of Sebastian are the hundreds of \n\ttiny droplets still clinging to his body, caught in the \n\tlight like twinkling bulbs on a Christmas tree. The shape \n\tdisappears into the darkness. A moment later Martha \n\temerges from the house and sees her husband floating face \n\tdown in the pool. She screams.\n\n\tINT. RECOVERY CHAMBER - DAY\n\n\tLinda passes by Sebastian's chamber.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tWhat? No good morning for me? Don't \n\t\t\tyou like me anymore?\n\n\t\t\t\tLINDA\n\t\t\tOh, sorry. I...I'm in a hurry.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tThat's okay. It's going to be busy \n\t\t\tday.\n\n\tINT. LINDA'S OFFICE - DAY\n\n\tMatt sits across from her, twirling a pen in his hand. \n\tThey both stare at the phone.\n\n\t\t\t\tLINDA\n\t\t\tWhen did he say held call?\n\n\t\t\t\tMATT\n\t\t\tHe's probably meeting with the \n\t\t\tcommittee trying to figure out what to \n\t\t\tdo.\n\n\t\t\t\tLINDA\n\t\t\tI'm gonna call him.\n\n\tLinda picks up the phone and dials.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYes, Dr. Kramer please. Excuse me?\n\t\t\t\t (inhales sharply - surprised)\n\t\t\tWhen? I'm so sorry.\n\n\tLinda blanches as she hangs up the phone.\n\n\t\t\t\tMATT\n\t\t\tWhat?\n\n\t\t\t\tLINDA\n\t\t\tHe's dead. Drowned in his pool last \n\t\t\tnight.\n\n\tLinda picks up the phone again and dials.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYes, General Thompson please. Thank \n\t\t\tyou. \n\n\tAs she waits the phone line clicks dead.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tHello? Hello?\n\n\tShe clicks on the hookswitch.\n\n\t\t\t\tMATT\n\t\t\tLet me see that.\n\n\tHe tries it too. Same result.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tIntercom's working, but there doesn't \n\t\t\tseem to be an outside line.\n\n\tINT. CORRIDOR/ELEVATOR\n\n\tThey waste no time getting to the elevator. Linda and \n\tMatt step in.\n\n\t\t\t\tLINDA\n\t\t\tI'll be right back with help.\n\n\tLinda taps in his floor code.\n\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization please.\n\n\t\t\t\tLINDA\n\t\t\tFoster One Delta Eight Three Five.\n\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization invalid. Request denied.\n\n\t\t\t\tLINDA\n\t\t\tThat's a first.\n\n\tLinda taps the keypad again.\n\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization please.\n\n\t\t\t\tLINDA\n\t\t\tFoster One Delta Eight Three Five.\n\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization invalid. Request denied.\n\n\t\t\t\tMATT\n\t\t\tLet me try mine.\n\n\tMatt hits buttons on the keypad.\n\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization please.\n\n\t\t\t\tMATT\n\t\t\tKensington Two Romeo One Five Nine.\n\n\t\t\t\tELEVATOR (V.0.)\n\t\t\tAuthorization invalid. Request denied.\n\n\t\t\t\tLINDA\n\t\t\tTell me this isn't happening.\n\n\tINT. LABORATORY - DAY\n\n\tFrank, Sarah, Carter and Janice man various work stations \n\tin the lab. Linda and Matt enter.\n\n\t\t\t\tLINDA\n\t\t\tWe've got a problem.\n\n\tINT. COMPUTER ROOM - NIGHT\n\n\tFrank's fingers fly over the keyboard.\n\n\t\t\t\tMATT\n\t\t\tHow long before anybody starts looking \n\t\t\tfor us?\n\n\t\t\t\tLINDA\n\t\t\tThere's no set check in procedure. It \n\t\t\tcould be weeks.\n\n\tA graphic of the elevator system pops up on the screen. \n\tFrank highlights the security terminal. Frank hits a few \n\tmore keys. The screen reduces to a series of numbers.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYou think you can got in?\n\n\tFrank rewrites a few of the numbers.\n\n\t\t\t\tFRANK\n\t\t\tAlready in. It was only a second level \n\t\t\tencryption.\n\n\tThe Security System specifications pops up.\n\n\t\t\t\tJANICE\n\t\t\tSome security system.\n\n\t\t\t\tFRANK\n\t\t\tOh the system is fine. It's just I'm \n\t\t\tjust extraordinary.\n\n\tFrank types a few more keys, and his eyes widen.\n\n\t\t\t\tFRANK (cont'd)\n\t\t\tBut apparently someone is more \n\t\t\textraordinary than me.\n\n\t\t\t\tMATT\n\t\t\tWhat is it?\n\n\t\t\t\tFRANK\n\t\t\tThere's nothing wrong with the system. \n\t\t\tOur codes have been removed.\n\n\t\t\t\tMATT\n\t\t\tRemoved? By who?\n\n\t\t\t\tFRANK\n\t\t\tHere's a clue. Only one code remains. \n\n\t\t\t\tLINDA\n\t\t\tWhose?\n\n\t\t\t\tFRANK\n\t\t\tDr. Sebastian Caine.\n\n\tINT. RECOVERY CHAMBER\n\n\tThe team approaches Sebastian's chamber. Carter pulls on \n\tthe pair of thermal goggles dangling from his neck up.\n\n\tTHERMAL POV - The chamber is empty.\n\n\t\t\t\tCARTER\n\t\t\tHe's not in there.\n\n\tLinda enters the chamber. She notes that Sebastian's face \n\tand makeup are on the sink vanity. Linda crosses to the \n\tphone and hits the \"PAGE BUTTON\"\n\n\t\t\t\tLINDA\n\t\t\tOkay, Sebastian. Fun's over. Tell us \n\t\t\twhere you are.\n\n\tShe waits. Then...\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI'm sorry. But I can't lot you turn me \n\t\t\tin.\n\n\t\t\t\tLINDA\n\t\t\tSebastian... where are you?\n\n\t\t\t\tSEBASTIAN'S VOICE (INTERCOM)\n\t\t\tYou have no idea what it's like. The \n\t\t\tpower of it. The freedom. I can't let \n\t\t\tthat go.\n\n\t\t\t\tLINDA\n\t\t\tC'mon Sebastian. You're scaring me. \n\t\t\tTell me where you are and we can talk \n\t\t\tabout it.\n\n\t\t\t\tSEBASTIAN'S VOICE (INTERCOM)\n\t\t\tThere's nothing to talk about. See ... \n\t\t\tI've done things that can't be undone. \n\n\tA long beep as the intercom clicks off.\n\n\t\t\t\tLINDA\n\t\t\tSebastian! Sebastian!\n\t\t\t\t (beat)\n\t\t\tI want search parties. Thermal goggles \n\t\t\tand tranquilizers.\n\n\tINT. CORRIDOR\n\n\tLinda and Matt, wearing thermal goggles and clutching \n\ttranquilizer pistols, walk down the hallway, scanning \n\tback and forth.\n\n\tINT. SEBASTIAN'S OFFICE\n\n\tJanice enters the office.\n\n\t\t\t\tJANICE\n\t\t\tDr. Caine? Are you in here? Dr. Caine? \n\n\tSuddenly, Janice jerks back.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI'm here.\n\n\tINT. HABITAT'S CORRIDOR\n\n\tSarah scans all the habitats with a thermal scanner. \n\tListening intently.\n\n\tINT. SEBASTIAN'S OFFICE\n\n\tJanice struggles with her unseen assailant, slamming into \n\twalls and knocking into filing cabinets.\n\n\tINT. LABORATORY\n\n\tFrank and Carter search the lab with their thermal \n\tscopes.\n\n\t\t\t\tFRANK\n\t\t\tDoctor Caine?\n\n\tINT. SEBASTIAN'S OFFICE\n\n\tLinda and Matt knock.\n\n\t\t\t\tLINDA\n\t\t\tSebastian?\n\n\tNo response. They push through the door. The room seems \n\tdeserted. Signs of a struggle. File cabinets opened, \n\tdrawers tossed.\n\n\t\t\t\tMATT\n\t\t\tThis is bad.\n\n\tTHERMAL POV - Linda surveys the room, spotting a slight \n\theat signature peeking from the corner.\n\n\t\t\t\tLINDA\n\t\t\tThere's something over there.\n\n\tLinda moves toward it. Whatever it is its hidden from \n\tMatt's POV by the supply cabinet. As Linda gets close she \n\tpulls of f her thermal goggles to see...\n\n\tJANICE -\n\n\tHer face blue, eyes bulging. An I.V. cord wrapped around \n\this neck. Linda jumps back.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tJesus. Oh my god.\n\n\tMatt rushes over. Sees the lifeless corpse.\n\n\t\t\t\tMATT\n\t\t\tWhat happened?\n\n\tLinda lowers the body to the floor.\n\n\t\t\t\tLINDA\n\t\t\tShe was strangled. Multiple blows to \n\t\t\ther head.\n\n\tLinda begins a medical check of the rest of the body. \n\tMatt stoops down and examines Janice's face.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tWe got a big problem here.\n\n\tA lamp tumbles from the desk and smashes to the floor. \n\tBoth Linda and Matt jump. Linda frantically dons the \n\tthermal visor and scopes the room again. Nothing. Matt \n\tnotices the lamp cord beneath Linda's leg. Points it out \n\tto her. She sighs with relief... she pulled the lamp off \n\tthe table.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tGet everybody to the conference room. \n\t\t\tNow!\n\n\tMatt picks up the phone. Clicks the hookswitch. Clicks \n\tthe hookswitch again.\n\n\t\t\t\tMATT\n\t\t\tIntercom... the phone lines. They're \n\t\t\tdead.\n\n\t\t\t\tLINDA\n\t\t\tGimme that.\n\n\tShe checks the phone, punches some numbers. Nothing.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tIt was just working.\n\n\t\t\t\tMATT\n\t\t\tWhat the fuck is going on here?\n\n\tINT. CORRIDOR\n\n\tMatt and Linda head toward the lab.\n\n\tLinda suddenly stops.\n\n\t\t\t\tMATT\n\t\t\tWhat?\n\n\t\t\t\tLINDA\n\t\t\tShhh.\n\n\tLinda takes a few cautious steps. Senses something.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tGive me the visor.\n\n\tMatt, suddenly concerned, hands her the visor. \n\n\tTHERMAL POV - Linda checks out the corridor. Empty. Linda \n\ttakes Matt's hand.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tC'mon.\n\n\tThey move quickly up the corridor. See Frank, Sarah and \n\tCarter.\n\n\t\t\t\tFRANK\n\t\t\tDid you find him?\n\n\t\t\t\tLINDA\n\t\t\tJanice is dead.\n\n\tINT. CONFERENCE ROOM\n\n\tLinda scans the room with her thermal scope.\n\n\t\t\t\tLINDA\n\t\t\tIt's clear.\n\n\tMatt, Frank, Janice and Sarah step in, locking the door \n\tbehind them.\n\n\t\t\t\tSARAH\n\t\t\tThe man has checked out of reality.\n\n\t\t\t\tFRANK\n\t\t\tWhat happened? I don't understand.\n\n\t\t\t\tCARTER\n\t\t\tIsn't it obvious? Right now, we're the \n\t\t\tonly ones who knows he exists. If he \n\t\t\tgets rid of us, no one knows and he \n\t\t\tbecomes the most powerful man on \n\t\t\tearth.\n\n\t\t\t\tFRANK\n\t\t\tBut he's not a killer.\n\n\tThey all look at Linda.\n\n\t\t\t\tLINDA\n\t\t\tHe wasn't. He is now.\n\n\t\t\t\tMATT\n\t\t\tCan you fix the elevator? Restore our \n\t\t\tcodes?\n\n\t\t\t\tFRANK\n\t\t\tIt'd take hours to crack the \n\t\t\tencryptions.\n\n\t\t\t\tMATT\n\t\t\tRight now that sounds like good news.\n\n\t\t\t\tCARTER\n\t\t\tSo what do we do until then. Sit \n\t\t\taround waiting for him to kill us off? \n\n\tEveryone looks around for some leadership. Finally.\n\n\t\t\t\tLINDA\n\t\t\tNo. We find him, before he finds us.\n\n\tINT. CORRIDOR - DAY\n\n\tThe group moves quickly, passing under an air vent. As \n\tthey round the corner the vent slowly swings down and an \n\tair disturbance drops to the ground.\n\n\tINT. OBSERVATION ROOM\n\n\tAs they enter...\n\n\t\t\t\tCARTER\n\t\t\tYou sure this'll work.\n\n\tLinda sits down at a computer terminal, activates it.\n\n\t\t\t\tLINDA\n\t\t\tWe designed it to help find the rats \n\t\t\twe kept dropping in year one. They \n\t\t\twere too small for thermal scans.\n\n\tA map of the compound appears on the screen.\n\n\t\t\t\tMATT\n\t\t\tSystems hot. Activating motion \n\t\t\tdetectors.\n\n\tMatt toggles a switch. Linda stares at a map of the \n\tcompound. Blips appear on the display... in the \n\tobservation room... in the Habitat Area and in one of the \n\tcorridors.\n\n\t\t\t\tLINDA\n\t\t\tI've got movement in Corridor Six.\n\n\t\t\t\tMATT\n\t\t\tThat's him.\n\n\tINT. CORRIDOR - DAY\n\n\tA shadow edges down the tunnel. It settles for a moment, \n\tdisappearing completely, then is back on the move. At the \n\ttunnel's edges, motion detectors light up as the thing \n\tpasses by.\n\n\tINT. OBSERVATION ROOM\n\n\tCarter checks his Tranq pistol & Matt rummages through a \n\tlocker.\n\n\t\t\t\tMATT\n\t\t\tGot 'em.\n\n\tMatt pulls out a pair of walkie-talkies. He tosses one to \n\tLinda.\n\n\t\t\t\tLINDA\n\t\t\t\t (into walkie)\n\t\t\tCheck. Check.\n\n\tHer voice echoes from the other unit.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tBe careful.\n\n\t\t\t\tMATT\n\t\t\tJust watch our backs. Hey Carter, \n\t\t\tready?\n\n\t\t\t\tCARTER\n\t\t\tLet's do it.\n\n\tMatt and Carter exit. Linda locks the door behind them.\n\n\tINT. TUNNEL\n\n\tMatt and Carter trot toward corridor six.\n\n\tINT. OBSERVATION ROOM - DAY\n\n\tLinda huddles over the display, tracking the two.\n\n\t\t\t\tLINDA\n\t\t\t\t (into Walkie)\n\t\t\tTake a right at the next accessway. \n\t\t\tHe's working his way back to the \n\t\t\toffices.\n\n\tWe see Matt and Carter on one of the working video \n\tscreens as they push down the tunnel.\n\n\tINT. CORRIDOR - DAY\n\n\tMatt and Carter move cautiously, listening for any sound.\n\n\t\t\t\tMATT\n\t\t\t\t (Walkie - sotto)\n\t\t\tIf we split up, can we trap him on \n\t\t\tcorridor eight?\n\n\t\t\t\tLINDA (V.0.)\n\t\t\tIf he keeps heading in that direction. \n\n\tMatt nods to Carter. The pair splits, heading down \n\tseparate accessways.\n\n\t\t\t\tMATT\n\t\t\tGoing Thermal.\n\n\tMatt pulls the visor down over his eyes.\n\n\tINT. OBSERVATION ROOM - DAY\n\n\tLinda watches the two separate and come around Sebastian \n\tin a pincer move.\n\n\tSuddenly, the blip that was Sebastian disappears. Linda \n\tgrabs the walkie.\n\n\t\t\t\tLINDA\n\t\t\tI lost him. Matt, I lost him.\n\n\tINT. CORRIDOR - DAY\n\n\tMatt makes his way forward.\n\n\t\t\t\tMATT\n\t\t\tHe probably just stopped moving.\n\n\tBut Matt becomes more cautious with his footsteps. Slowly \n\t... approaching a corner...\n\n\tHe rounds the corner and sees a heat signature at the far \n\tend of the corridor. He levels his pistol, ready to fire.\n\n\t\t\t\tCARTER\n\t\t\tIt's me.\n\n\tMatt pulls off his goggles.\n\n\t\t\t\tMATT\n\t\t\tDo you have anything?\n\n\t\t\t\tCARTER\n\t\t\tNothing.\n\n\t\t\t\tMATT\n\t\t\tHow did he get by us?\n\n\t\t\t\tCARTER\n\t\t\tHe couldn't.\n\n\t\t\t\tMATT\n\t\t\tSebastian! We're here to help. \n\t\t\tSebastian.\n\n\tNo response. They both don their visors and move forward \n\tslightly. Carter holds up his hand.\n\n\t\t\t\tCARTER\n\t\t\tThere. Behind those pipes. He's not \n\t\t\tmoving.\n\n\tCarter points. Matt checks his thermal. A red heat \n\tsignature clings to the wall.\n\n\t\t\t\tCARTER (cont'd)\n\t\t\tDoctor Caine?\n\t\t\t\t (beat)\n\t\t\tCan you hear me?\n\n\tNo response.\n\n\t\t\t\tMATT\n\t\t\t\t (into walkie)\n\t\t\tWe see him. But he's not responding. \n\t\t\tThe heat signature doesn't move.\n\n\tMatt looks through his visor and holds the tranquilizer \n\tgun at the ready. He looks for a clear shot. The heat \n\tsignature huddles behind pipes.\n\n\t\t\t\tMATT\n\t\t\tC'mon... C'mon...\n\n\tThe two slowly move closer. Matt finally has a clear \n\tshot. He signals Carter. Carter levels his pistol too.\n\n\t\t\t\tCARTER\n\t\t\tCovered.\n\n\tMatt fires the dart at the heat signature. It bounces off \n\tthe wall ... Nothing there. \n\n\t\t\t\tMATT\n\t\t\tWhat the...\n\n\tHe crosses to the heat signature.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tJust a vent. Just a goddamn vent\n\n\t\t\t\tLINDA (V.0.)\n\t\t\tHe was there.\n\n\t\t\t\tMATT\n\t\t\tLooks like... looks like we're pumping \n\t\t\tout heat...\n\n\tSuddenly behind him... CARTER JERKS THREE FEET in the \n\tair, kicking wildly. SUSPENDED IN MID-AIR BY HIS NECK. He \n\tgasps for air.\n\n\t\t\t\tLINDA (V.0.)\n\t\t\tI got movement again! He's right on \n\t\t\ttop of you!\n\n\t\t\t\tMATT\n\t\t\tNo fucking shit!\n\n\tMatt opens fire with the tranquilize, shooting at the \n\tceiling until he spends his dart rounds.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tSebastian? Goddamnit! Let him go.\n\n\t\t\t\tCARTER\n\t\t\t\t (choking)\n\t\t\tH...Help... MMmmphg\n\n\tCarter suffocates. He passes out. With a sudden crack, \n\the's thrown against the side wall. A large cut opens up \n\tacross his head and his body goes limp.\n\n\t\t\t\tMATT\n\t\t\t\t (into walkie)\n\t\t\tWhere is he? Where the fuck is he?!?\n\n\tINT. OBSERVATION ROOM - DAY\n\n\tLinda huddles over the display.\n\n\t\t\t\tLINDA\n\t\t\tRight on top of you.\n\n\tINT. CORRIDOR - DAY\n\n\tMatt scrambles away. Running. Pipes burst and swing down \n\tfrom the ceiling. Steam billows forth. Something moves \n\tthrough the cloud of steam.\n\n\tAround the corner, Matt shoves more darts into his \n\ttranquilizer.\n\n\t\t\t\tLINDA (V.0.)\n\t\t\tWhat's going on? Are you okay?\n\n\t\t\t\tMATT\n\t\t\tCarter's down. Hurt bad. Bleeding from \n\t\t\ta head wound.\n\n\tINT. OBSERVATION ROOM - CONTINUOUS\n\n\tLinda watches the screen. Two blips, one traveling \n\tquickly.\n\n\t\t\t\tLINDA\n\t\t\tMatt, he's coming toward you.\n\n\tINT. CORRIDOR - DAY\n\n\tMatt takes a few steps back.\n\n\t\t\t\tMATT\n\t\t\tShit.\n\n\t\t\t\tLINDA\n\t\t\tGot outta there.\n\n\tMatt breaks into a run.\n\n\tINT. OBSERVATION ROOM\n\n\tLinda watches one dot chasing the other, down several \n\tcorridors.\n\n\t\t\t\tLINDA\n\t\t\tHe's close!\n\n\tINT. TUNNEL\n\n\tMatt running, checking over his shoulder. Sounds of \n\tfootsteps behind him, but up ahead the heavy metal blast \n\tdoors begin to close.\n\n\t\t\t\tMATT\n\t\t\tGoddamnit. The doors are closing. He's \n\t\t\tshutting me in.\n\n\tMatt rushes the doors as they slide shut. He doesn't make \n\tit in time. The doors close with a resounding clang. Matt \n\tturns and pulls on his thermals.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tWhere is he?\n\n\tINT. OBSERVATION ROOM - CONTINUOUS\n\n\tLinda huddled over the screen. Tense.\n\n\t\t\t\tLINDA\n\t\t\tHe's coming right at you! \n\n\tThen checks the Thermal goggles. Several heat signature \n\tdot the tunnel.\n\n\t\t\t\tMATT\n\t\t\tWhere?\n\n\t\t\t\tLINDA\n\t\t\tTwenty, maybe thirty feet.\n\n\t\t\t\tMATT\n\t\t\tGoddamnit, I got thermals all over the \n\t\t\tplace. Eight, maybe ten of them. Must \n\t\t\tbe ghosts.\n\n\tINT. OBSERVATION ROOM - CONTINUOUS\n\n\tLinda gets a sense of forboding. She looks around the \n\troom. Sees a heating vent in the corner.\n\n\tBeat.\n\n\tShe grabs the walkie.\n\n\t\t\t\tLINDA\n\t\t\tThose signatures ... they're coming \n\t\t\tfrom the heating vents. \n\n\tThrough the goggles, Matt sees the tunnel turning red.\n\n\t\t\t\tMATT\n\t\t\tI'm starting to lose resolution on my \n\t\t\tthermals.\n\n\t\t\t\tLINDA\n\t\t\tGet out of there!\n\n\tINT. OBSERVATION ROOM\n\n\t\t\t\tFRANK\n\t\t\tIf the room temperature is the same as \n\t\t\this body temperature, thermal \n\t\t\tvisors'll be no good.\n\n\tLinda grabs a Tranq gun and heads for the door. \n\n\t\t\t\tLINDA\n\t\t\tI'm going!\n\n\t\t\t\tFRANK\n\t\t\tLinda...it's not safe.\n\n\t\t\t\tLINDA\n\t\t\tThat's why I'm going.\n\t\t\t\t (to Frank and Sarah)\n\t\t\tCorridor eight is clear. Get Carter to \n\t\t\tthe lab. We'll meet you there.\n\n\t\t\t\tFRANK\n\t\t\tBut...\n\n\t\t\t\tLINDA\n\t\t\tDo it.\n\n\tINT. CORRIDOR\n\n\tMatt turns to face the corridor. It's turning red. Matt \n\tsees some movement in the thermal cloud. Opens fire. But \n\tthe thermal signature disappears into the heat. Matt \n\tcan't distinguish anything through his goggles anymore. \n\tHe pulls them off and holds him gun in front of him \n\tsweeping the hallway.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tMarco...Polo... Marco... Polo...\n\n\tHis voice keeps shifting. Matt fires.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tNot even close.\n\n\tMatt sweeps his front leg back and forth, like a blind \n\tman using a cane. But his foot isn't hitting anything. He \n\tsees a FIRE EXTINGUISHER mounted on the wall. He rushes \n\tit, turns it on the hallway and sprays. And SOMETHING \n\tLUNGES through the foam. GRABS HIM, sending him tumbling \n\tdown the tunnel. Matt is thrown against the wall. Blood \n\tcoming from his brow. He scrambles away, spraying more \n\tfoam. Sees a shape in the mist, raises his pistol and \n\tFIRES. The shape leaps away. The DART FLIES. Doesn't hit. \n\tMatt scrambles back into a corner. His pistol is empty.\n\n\t\t\t\tSEBASTIAN\n\t\t\tSo... just out of curiosity, how long \n\t\t\thas my best friend been fucking my ex-\n\t\t\tgirlfriend.\n\n\t\t\t\tMATT\n\t\t\tSebastian. Get a hold of yourself. You \n\t\t\taren't thinking rationally.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tShe's a pretty sweet fuck, isn't she?\n\n\t\t\t\tMATT\n\t\t\tCalm down, Sebastian... we can talk \n\t\t\tthis through. It's not too late.\n\n\tThe Shape parts the low hanging mist, the fine powder \n\tswirling in clouds behind it. Coming toward him.\n\n\t\t\t\tMATT (CONT'D)\n\t\t\tC'mon Sebastian. Don't do this. I'm \n\t\t\tyour friend.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI'm sorry, but I just feel that our \n\t\t\tfriendship is holding me back. I'm \n\t\t\tsure you understand. \n\n\tTHE DOOR OPENS. Linda reaches through, grabs Matt. She \n\tpulls him to his feet and through the door.\n\n\tINT. TUNNEL\n\n\tFrank and Sarah, holding their Tranq pistols, fly down \n\tthe corridor.\n\n\t\t\t\tSARAH\n\t\t\tThis way.\n\n\tThey shear off the main corridor into the side corridor. \n\tCarter lies crumpled up ahead. Sarah slides to his side. \n\tCarter's head rests in a pool of blood. She checks his \n\tpulse while Frank takes a protective position.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tPulse is weak. Breathing... shallow.\n\n\t\t\t\tFRANK\n\t\t\tHe'll be okay.\n\n\t\t\t\tSARAH\n\t\t\tIt's pretty severe. We have to get him \n\t\t\tto the lab.\n\n\t\t\t\tFRANK\n\t\t\tHe's got to be okay.\n\n\tFrank stands frozen.\n\n\t\t\t\tSARAH\n\t\t\tFor godsakes, help me.\n\n\tFrank snaps to. Grabs an arm. The pair hoist Carter up \n\tand carry him down the hallway.\n\n\tINT. OBSERVATION ROOM\n\n\tLinda pulls a handle and doors slide shut behind them.\n\n\t\t\t\tMATT\n\t\t\tHe was going to kill me.\n\n\tLinda pulls him close.\n\n\t\t\t\tLINDA\n\t\t\tI know. He's gone.\n\n\t\t\t\tMATT\n\t\t\tWe've got to got out of here.\n\n\tLinda checks the screen -- see Sarah, Frank and Carter \n\theaded toward the Laboratory.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tWhere is he? Goddamnit, where is he? \n\n\tIsolated in the Hallway of Habitats is a single blip.\n\n\t\t\t\tLINDA\n\t\t\tHabitats.\n\n\t\t\t\tMATT\n\t\t\tOh god. That's right between us and \n\t\t\tthe lab.\n\n\tINT. LABORATORY\n\n\tFrank and Sarah lift Carter onto a medical table.\n\n\t\t\t\tSARAH\n\t\t\tHis pulse is faint.\n\n\tSarah grabs a sheet from the counter top. Folds it and \n\tpresses it against the head wound.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tHe's lost a lot of blood. Here. Hold \n\t\t\tthis.\n\n\tShe guides Frank's hands to the wound.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tKeep applying pressure.\n\n\tSarah pulls out a saline solution I.V. bag and slap it on \n\tthe rack. She fumbles with the needle as she tries to \n\tfind a vein.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tDon't move your hand until I got back. \n\n\tSarah heads to the door.\n\n\t\t\t\tFRANK\n\t\t\tWhere are you going?\n\n\t\t\t\tSARAH\n\t\t\tThis'll hold him but he needs blood.\n\n\t\t\t\tFRANK\n\t\t\tBut...\n\n\t\t\t\tSARAH\n\t\t\tSupply is right down the hall. I'll be \n\t\t\ttwo seconds.\n\n\t\t\t\tFRANK\n\t\t\tSarah, wait for the others\n\n\t\t\t\tSARAH\n\t\t\tIf I wait, he'll die. Keep pressure on \n\t\t\tthe wound.\n\n\tINT. CORRIDOR\n\n\tSarah exits the lab. Checks the corridor. Down at the end \n\tof the cramped tunnel is the supply room.\n\n\tShe swallows her fear and heads toward it, all the while \n\tglancing side-to-side and behind her.\n\n\tINT. SUPPLY ROOM\n\n\tSpooked, Sarah bursts into the room. She goes to the \n\tsupply fridge/freezer, pulls open the door, and sorts \n\tthrough blood bags.\n\n\tINT. TUNNEL\n\n\tMatt and Linda push along the corridor; Matt spraying \n\twith the fire extinguisher in short controlled bursts, \n\tLinda clutching her tranquilizer like a commando.\n\n\tA noise behind them. Footsteps.\n\n\tMatt turns to blast with the extinguisher. The white \n\tchemical dust sprays out, outlining a shape in the \n\ttunnel. But it isn't a human shape.\n\n\tMatt's uniform shreds. Something with fierce sharp claws \n\tfells him. Tearing into his flesh. We see a angry, hungry \n\tface... jabbing for a moment through the lingering fog.\n\n\t\t\t\tMATT\n\t\t\tAhh!  Shit!\n\n\tLinda tries to get a clear shot off through the smoke. \n\tMatt trips and goes sprawling. Something yelps. A howl. \n\tLinda shoots. Her dart jabs into something which \n\tcollapses to the ground. A moment of calm. As the dusty \n\tchemical foam settles, the outline of a great ape \n\tappears, still twitching.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tKarl Three. Nice shot.\n\n\t\t\t\tLINDA\n\t\t\tHe's let the animals out. It wasn't \n\t\t\thim we were tracking.\n\n\tLinda leans against the wall, still clutching her tranq \n\tgun at the ready. The heat is getting to bar. Bar scrubs \n\tare soaked, her hair's a mess. She wipes the sweat from \n\ther brow.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYou okay?\n\n\t\t\t\tMATT\n\t\t\tIt won't kill me unless it gets \n\t\t\tinfected. You?\n\n\t\t\t\tLINDA\n\t\t\tMe .... Don't ask about me. If he \n\t\t\tfreed all the animals, we could have \n\t\t\tdozens running around the lab.\n\n\t\t\t\tMATT\n\t\t\tSo he could be anywhere right now.\n\n\tMatt sprays the whole tunnel, putting down a gentle cloud \n\tmist. Nothing else appears.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tWhat do we do?\n\n\t\t\t\tLINDA\n\t\t\tGet to the lab, lock the goddamn doors \n\t\t\tand pray to God Frank can reprogram \n\t\t\tthe elevator.\n\n\tINT. SUPPLY ROOM\n\n\tSarah finishes collecting blood bags and shuts the door \n\tto the fridge/freezer.\n\n\tThe DOOR SLAMS behind her. She freezes and slowly turns.\n\n\t\t\t\tSARAH\n\t\t\tFrank?\n\n\tShe eyes the supply room, looking for a sign of movement.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\t\t (frightened whisper)\n\t\t\tWho's there?\n\n\tShe listens. Is that breathing she hears? Now she's \n\tstarting to panic.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tDr. Caine?\n\n\tShe starts to back away, but she's already in the corner. \n\tShe clutches her tranquilizer gun, but there's nothing to \n\taim at. The vials of blood on the shelf gives her an \n\tidea. She reaches over, grabs a vial and throws it on the \n\tfloor. GLASS SHATTERS and BLOOD SMEARS across the \n\tlinoleum. Sarah tosses another vial and another. Becoming \n\tmore and more hysterical. Splattering more and more \n\tblood. But she runs out of vials. Shaking with fear, she \n\tsearches the blood looking for a footprint, or movement. \n\tBut there's nothing there. Sarah waits a beat, clutching \n\tthe tranquilizer gun. Takes a step. Waits a beat longer.\n\n\tFinally she relaxes. It was just her imagination. She \n\theads toward the door when she hears a terrifying whisper \n\tin her ear.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou missed.\n\n\tHer hair flies up, and she swings against the wall. She \n\ttries to move, but she's pinned there. Her hands \n\tstruggling against the force.\n\n\t\t\t\tSARAH\n\t\t\tPlease no. Let me go. Oh god, let me \n\t\t\tgo. \n\n\tThe arm holding the tranquilizer gun begins to move.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tWhat are you doing? No!\n\n\tSarah fights, but her arm moves nonetheless\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tHelp me! Oh God. Somebody help me!\n\t\t\tFRANK!\n\n\tSlowly, deliberately, her own arm moves down the wall and \n\taround, until the tranquilizer gun points right at her \n\tstomach.\n\n\tSarah watches in horror as her own body betrays her.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tNo... please. Don't do this to me.\n\n\tShe struggles, shaking back and forth. Writhing. In \n\tanguish and in fear.\n\n\t\t\t\tSARAH (cont'd)\n\t\t\tWhat do you want?\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou.\n\n\tThe trigger pulls .... Pop!\n\n\tA dart explodes from the gun and imbeds in Sarah's \n\tstomach. She whimpers as her eyes glass over. Suddenly \n\tshe's released. She stumbles backward and falls lifeless \n\tto the floor. A moment of stillness, all we can hear is \n\tthe sound of someone breathing.\n\n\tOn Sarah's face... a slight-indentation runs down her \n\tcheek..\n\n\tAlmost sweet... almost tender. And slight indentation \n\truns across her breast and strokes down her body. The \n\tsense of violation and vulnerability is awful. Sebastian \n\tsighs.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI've always liked your feistiness. \n\n\tSarah's head shifts slightly. Her head shifts violently, \n\taccompanied by the celery crunch of her neck snapping. \n\tSebastian exhales, his breath filled with the \n\tintoxication of power.\n\n\tINT. LABORATORY - DAY\n\n\tFrank applies pressure to the wound, waiting for Sarah to \n\treturn. Carter's vital signs are weakening..,.\n\n\t\t\t\tFRANK\n\t\t\tSarah! Sarah!\n\t\t\t\t (to Carter)\n\t\t\tGoddamnit. Stay with me now. Don't you \n\t\t\tlet up... Sarah! Sarah!\n\n\tNo response. Frank doesn't know whether to stay or go \n\tafter her. He starts toward the door several times but \n\tcan't leave Carter. Finally the door opens.\n\n\t\t\t\tFRANK (cont'd)\n\t\t\tSarah! I'm losing him.\n\n\tBut it's Linda and Matt.\n\n\t\t\t\tFRANK (cont'd)\n\t\t\tDid you see her?\n\n\tLinda rushes over to check on Carter.\n\n\t\t\t\tLINDA\n\t\t\tWhere is she?\n\n\t\t\t\tFRANK\n\t\t\tShe went to the supply room. Carter \n\t\t\tneeded blood.\n\n\tLinda grabs a stethoscope and listens to Carter's heart.\n\n\t\t\t\tLINDA\n\t\t\tI said no one goes anywhere alone.\n\n\t\t\t\tFRANK\n\t\t\tShe didn't listen.\n\n\tShe-slowly pulls Frank's hand away from the wound.\n\n\t\t\t\tFRANK (cont'd)\n\t\t\tBut...\n\n\t\t\t\tLINDA\n\t\t\tHe's dead.\n\n\tLinda would love to cry about it, but doesn't afford \n\therself the luxury.\n\n\tINT. CORRIDOR\n\n\tThe three of them approach the supply room door slowly. \n\tBlood trickles from under the door and bloody footprints \n\textend down the hallway.\n\n\tThey swing open the door.\n\n\tThe floor is covered in blood and broken glass. But no \n\tbody.\n\n\tINT. CORRIDOR\n\n\tSarah, broken, is dragged toward the chair, eerily \n\tjerking down the hallway... seemingly on its own.\n\n\tINT. CORRIDOR\n\n\tThe three scientists follow the bloody footprints down \n\tthe hallway past the empty cages in the tunnel of \n\thabitats.\n\n\tAll clutch their tranquilizer pistols.\n\n\tThe footprints lead past the habitats to Sebastian's \n\tchamber.\n\n\tThey see Sarah's body in the dim light.\n\n\t\t\t\tLINDA\n\t\t\tOh god. Sarah!\n\n\tThe group breaks into a run. Linda pushes into the \n\tchamber and falls at Sarah's side. Matt cradles Sarah's \n\thead. They look for some sign of life as Linda fights \n\tback the tears.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tNo...\n\n\t\t\t\tFRANK\n\t\t\tHer too?\n\n\tMatt nods. Linda slams the cubicle wall with her fist.\n\n\t\t\t\tLINDA\n\t\t\tThis didn't happen. This hasn't \n\t\t\thappened.\n\n\t\t\t\tMATT\n\t\t\tIt happened alright. Now we have to \n\t\t\tdeal with it.\n\n\tMatt puts his hands on her shoulder to calm her. She \n\tpushes him off.\n\n\t\t\t\tFRANK\n\t\t\tYeah? And just what are we supposed to \n\t\t\tdo now?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tNow? Now you die.\n\n\tThe three of them whip around.\n\n\t\t\t\tLINDA\n\t\t\tHe's here!\n\n\t\t\t\tMATT\n\t\t\tWhere?\n\n\t\t\t\tLINDA\n\t\t\tSebastian!\n\n\tSilence. The three cautiously move out. They stand back \n\tto back, each one facing out. They move toward the door \n\tof the Chamber.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tSebastian. Sebastian, listen to me.\n\n\tNo response. They all their tranq pistols level waiting \n\tfor some sign. Hearing each other breathe. They slowly \n\tmove outside the Chamber into the corridor.\n\n\t\t\t\tLINDA (CONT1D)\n\t\t\tI don't know if you can understand \n\t\t\tthis, but what you're experiencing is \n\t\t\ta psychological breakdown. This isn't \n\t\t\twho you are.\n\n\tA beat.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI would say that what I am \n\t\t\texperiencing is psychological \n\t\t\tawareness. I like you being in \n\t\t\tcomplete and absolute control.\n\n\tThey identify the general area the voice is coming from: \n\tBack inside the Chamber! They slowly move toward the \n\tChamber door. With lightning speed they slam the door \n\tshut, locking Sebastian inside the Recovery Chamber.\n\n\t\t\t\tLINDA\n\t\t\tYou goddamn bastard! You goddamn \n\t\t\tbastard. You're gonna pay for this. \n\t\t\tI'm going to bring you back to \n\t\t\tvisibility and then I'm going throw \n\t\t\tyour ass in jail.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tYou're never gonna bring me back \n\t\t\tLinda. I never want to come back.\n\n\t\t\t\tLINDA\n\t\t\tFuck you!\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tOr maybe I'll fuck you. One last time \n\t\t\tfor old times sake.\n\n\tLinda slams her fist against the wall of the Chamber.\n\n\t\t\t\tMATT\n\t\t\tDon't listen to him. It's not worth \n\t\t\tit.\n\n\t\t\t\tFRANK\n\t\t\tCome on, Matt. Let's go get the \n\t\t\televator back on-line so we can got \n\t\t\tout of this hell hole.\n\n\tMatt gives Linda a kiss...\n\n\t\t\t\tMATT\n\t\t\tHe does anything, anything at all, \n\t\t\tcome get us. I'll be back to check on \n\t\t\tyou in five.\n\n\tMatt and Frank head off down the corridor.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tImagine you two, carrying on right \n\t\t\tunder my nose. Out of curiosity, what \n\t\t\tdid he give you that I couldn't?\n\n\t\t\t\tLINDA\n\t\t\tShut up, Sebastian. He's more of a man \n\t\t\tthan you'll ever be.\n\n\tINT. OBSERVATION ROOM - CONTINUOUS\n\n\tA VIDEO SCREEN shows Linda pacing outside the Chamber \n\tdoor. The chair moves forward toward a microphone.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tOkay, sweetie. I'll be quiet. If \n\t\t\tthat's what you want...\n\n\tSebastian TOGGLES the intercom switch OFF. We pan over to \n\tone of the working video screens ... Matt and Frank \n\tstride down the hallway. The chair swivels and the \n\tobservation room door swings open slightly.\n\n\tINT. CHAMBER\n\n\tLinda still holds his tranq gun toward the door. Nothing \n\tmoves. Nothing. Linda walks over to the Plexiglas ... \n\tstares in. Can't see anything, anyone. Just the dead \n\tSarah.\n\n\tThen she sees it. The little red light on the intercom. \n\tIts on.\n\n\t\t\t\tLINDA\n\t\t\tSebastian? Sebastian? No.. No...\n\n\tLinda bangs on the glass. She looks. No movement, no \n\tnothing. She listens. Shit. She takes off running.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tMatt! Frank! \n\n\tTracking with Linda as she rushes down the hall.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tMatt! Matt! Frank!\n\n\tINT. LABORATORY - DAY\n\n\tLinda breaks in the room to see Frank slicked in blood, \n\this throat cut, and Matt bleeding from multiple stab \n\twounds with an extension cord around his neck being \n\tpulled tight.\n\n\t\t\t\tLINDA\n\t\t\tJesus!\n\n\tLinda rushes over and slams into Matt. They fall to the \n\tground. Linda crawls over to Matt, but her head snaps \n\tback and her lips erupt with blood.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tFigured it out? You were always so \n\t\t\tclever.\n\n\tMatt's pulled back across the lab by the cord around his \n\tneck. He grabs at the cord trying to breathe. Linda \n\twatches him being pulled away.\n\n\t\t\t\tLINDA\n\t\t\tNo!\n\n\tShe clamors over to him. But Matt rises in the air and is \n\ttossed against the lab table. Linda levels her dart \n\tpistol and fires haphazardly at the air. She hits nothing \n\tbut objects jerk and move in a line as Sebastian heads \n\tfor cover. Linda manages to grab Matt and pull him to \n\ther.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tHang on!\n\n\t\t\t\tMATT\n\t\t\tGet out of here!\n\n\tLinda pulls Matt toward the door.\n\n\t\t\t\tLINDA\n\t\t\t\t (yelling)\n\t\t\tYou won't get away with this. They'll \n\t\t\tfind out about you. They'll hunt you \n\t\t\tdown.\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tThe villagers with their torches? Lock \n\t\t\tup your daughters! Sorry, Lin. It's \n\t\t\tnot gonna happen that way.\n\n\tLinda hits the lights. The lab is now very, very dark.\n\n\t\t\t\tSEBASTIAN'S VOICE (cont'd)\n\t\t\tSee, I've spent all my time down here \n\t\t\tthinking up this plan. When they find \n\t\t\tyou, they'll find a pile of charred \n\t\t\tcorpses. The result of a terrible \n\t\t\taccident, I'm afraid.\n\n\tLinda reacts to the voice as it grows nearer. She \n\tnavigates the maze of equipment, heading toward the crack \n\tof light at the front door.\n\n\t\t\t\tLINDA\n\t\t\tHow can you be so brutal?\n\n\t\t\t\tSEBASTIAN'S VOICE\n\t\t\tI guess because I don't have to look \n\t\t\tat myself in the mirror anymore\n\t\t\t\t (beat)\n\t\t\tRemember that first night I was out? I \n\t\t\tdid something bad, just to see if I \n\t\t\tcould get away with it. And when I \n\t\t\tdid, I realized I could have it all. I \n\t\t\tcan kill in broad daylight. And \n\t\t\tnobody's gonna tell the police they \n\t\t\twere fucked by a ghost. Anything I \n\t\t\tdesire I can make happen, but not if \n\t\t\tpeople know.\n\n\tLinda and Matt have reached the door of the lab. She \n\tpushes through it and slams it behind her.\n\n\tINT. CORRIDOR - DAY\n\n\tLinda pulls Matt along.\n\n\t\t\t\tMATT\n\t\t\tI'm dizzy. I can't feel my legs.\n\n\t\t\t\tLINDA\n\t\t\tJust keep going. I'll fix you later.\n\n\tINT. CORRIDOR, LAB DOORS - DAY\n\n\tThe doors explode open.\n\n\tINT. SUPPLY ROOM - DAY\n\n\tLinda looks up and down the hall and pulls Matt inside \n\tthe supply room. It's still blood soaked from earlier.\n\n\tLinda closes the door, sliding the deadbolt into place.\n\n\tLinda lots him drop like a heap onto the floor. She falls \n\tto her knees beside Matt, lying on the ground.\n\n\t\t\t\tLINDA\n\t\t\tMatt... Matthew. Stay with me now. \n\n\tLinda pulls his scrubs open. The wounds are many and \n\tdeep.\n\n\t\t\t\tMATT\n\t\t\tHe surprised us. We weren't \n\t\t\texpecting...\n\n\t\t\t\tLINDA\n\t\t\tShhh. Don't talk.\n\n\tBAM! Something slams against the door. Bam! Slams against \n\tit again. The old deadbolt is buckling. Linda looks \n\taround the room and sees the storage freezer.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tWe gotta move. Hang on.\n\n\tLinda helps Matt up and into the storage freezer.\n\n\tINT. STORAGE FREEZER\n\n\tLinda grabs a metal bar and slides it between two hooks \n\ton the door and the jam.\n\n\tBAM! The storage room door blows open. Linda leans down \n\tnext to Matt.\n\n\t\t\t\tMATT\n\t\t\tLin...\n\n\tHe entire shirt is stained with blood. He's having \n\ttrouble breathing.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tI can't feel anything.\n\n\tLinda picks up his hand. Grips it tight.\n\n\t\t\t\tLINDA\n\t\t\tYou feel that?\n\n\tMatt smiles.\n\n\t\t\t\tMATT\n\t\t\tA little...\n\n\tShe rips his shirt open... and sees his wounds. She grabs \n\ta vial of alcohol and dumps it on her hands and then \n\tprobes the wound.\n\n\t\t\t\tLINDA\n\t\t\tYour losing blood, but he didn't hit \n\t\t\tthe vitals.\n\n\tShe looks around.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tSutures and thread.\n\n\tShe rises, and looks outside the porthole into the room. \n\tSuddenly it fogs up and she almost sees a face. She \n\tstumbles backward, and the door starts rattling. Linda \n\tscrambles over to hold the metal crowbar in place. \n\tSebastian pulls and rattles on the freezer door. To no \n\tavail. It's not gonna budge. Finally he gives up. The \n\tdoor stops shaking. Linda is relieved, briefly.  Still. \n\tThen she hears the click of the door locking.\n\n\tOUTSIDE THE FREEZER\n\n\tCLOSE ON THE REGULATOR as the dial turns from forty-five \n\tdegrees, down to negative twenty.\n\n\tINSIDE THE FREEZER\n\n\tThrough the porthole, Linda sees the bloody footprints \n\theading toward the door. She removes the metal bar and \n\tpushes on the door. It won't move.\n\n\t\t\t\tLINDA\n\t\t\tGoddamnit.\n\n\tLinda looks around the storage room. She grabs a roll of \n\tduct tape and pulls off a length.\n\n\t\t\t\tMATT\n\t\t\tWhat're you doing?\n\n\t\t\t\tLINDA\n\t\t\tThis is temporary.\n\n\tShe takes paper towel and cleans off Matt's wound. She \n\ttapes it, using duct tape.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tYou still with me?\n\n\t\t\t\tMATT\n\t\t\tBarely.\n\n\tA beat later, the compressor begins pumping Arctic air \n\tinto the freezer.\n\n\t\t\t\tLINDA\n\t\t\tJust keeps getting worse.\n\n\tLinda returns to the door. Shakes it.\n\n\tINT. CHAMBER - DAY\n\n\tWe hear WHISTLING as we see a sheet of flesh fill out \n\tinto a head as Sebastian slides on his latex head piece.\n\n\tINT. STORAGE FREEZER\n\n\tLinda continues shaking the door. The lock holds. A tear \n\trolls down Linda's cheek, but a strange thing happens. \n\tThe tear drops freeze. Linda shivers as she pulls the icy \n\ttears from her face.\n\n\t\t\t\tLINDA\n\t\t\tOh shit.\n\n\tThe inside thermometer has dropped to five degrees.\n\n\tLinda grabs the metal bar and starts smashing it against \n\tthe porthole. The metal bar just bounces off the glass.\n\n\tINT. SEBASTIAN'S OFFICE\n\n\tA drawer opens, revealing a set of clothing neatly \n\tfolded. Shirt, pants, shoes. They begin to move.\n\n\tINT. STORAGE FREEZER\n\n\tLinda drops the metal bar and slides down the wall, \n\tdefeated.\n\n\t\t\t\tMATT\n\t\t\tThere's no way out.\n\n\t\t\t\tLINDA\n\t\t\tThere's got to be.\n\n\t\t\t\tMATT\n\t\t\tThey say freezing to death isn't so \n\t\t\tbad. You just kinda pass out.\n\n\tMatt's head rolls back.\n\n\t\t\t\tLINDA\n\t\t\tMatt! MATT!\n\n\tShe checks his pulse. Thank god he still has one, but \n\the's not gonna last long. They're both already starting \n\tto turn a little blue. Linda stares desperately up at the \n\tshelves, trying to find some sort of advantage. Then she \n\tsees something. She looks back at the door lock and then \n\tshe rises ... and grabs AN EXTENSION CORD coiled on the \n\tshelf.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tWe're not dying in here.\n\n\n\tINT. BATHROOM - DAY\n\n\tSebastian, dressed in street clothes, stands before the \n\tmirror applying make-up to his latex mask.\n\n\tINT. STORAGE FREEZER\n\n\tLinda finishes stripping the insulation off the electric \n\tcord. \n\n\tShe grabs a hypodermic needle package, and her cold \n\tfingers fumbles with the package as she tries to pull out \n\tthe plastic tube.\n\n\tShe finally gets it out and she starts wrapping the \n\tstripped electric wire around the tube in a tight coil.\n\n\tINT. BATHROOM - DAY\n\n\tSebastian slides on a wig and checks his appearance in \n\tthe mirror. Pretty smooth. Even from relatively close up, \n\the could pass as normal.\n\n\tINT. STORAGE FREEZER\n\n\tLinda furiously winds wire into a coil.\n\n\tINT. CORRIDOR\n\n\tSebastian heads down the corridor. Lingering steam twists \n\tin and around the hallway, long wispy tendrils. Sebastian \n\tpauses for a moment, hearing A GROWL. Suddenly the \n\thallway seems a lot scarier. From beneath his scrubs he \n\tpulls his own tranq gun. He listens ... hearing scraping \n\tand footsteps. Watching the water on the floor twitch. \n\tWith machine like precision, he turns and fires. The \n\ttranq dart halts in mid-air and some invisible thing \n\ttumbles over.\n\n\tSebastian continues down the hallway.\n\n\tINT. STORAGE FREEZER\n\n\tLinda holds the plug end of the extension cord. The other \n\tend is wrapped into a tight long coil. Linda looks for an \n\toutlet, but can't find one. She looks at the overhead \n\tlights.\n\n\tA moment later she's climbing up the shelving. She wrap* \n\ta piece of fabric around her hand, and with a sharp punch \n\tshe smashes one of the overhead light bulbs.\n\n\tINT. LABORATORY\n\n\tSebastian enters, fully dressed. At a distance it'd be \n\thard to tell his secret. He pulls several chemicals off \n\tthe shelves. Then he pulls a tray of test tubes over and \n\tbegins mixing.\n\n\tINT. STORAGE FREEZER\n\n\tLinda works on jerry rigging the two ends of the wire to \n\tthe lightbulb, socket. \n\tSuddenly the coiled wire springs to life and flies \n\tagainst the nearest metal surface. She's made an \n\telectromagnet.\n\n\tINT. LABORATORY\n\n\tSebastian loads the filled test tubes into the \n\tcentrifuge. Dozens of other vials are already slotted. He \n\ttakes one of the left over vials, considers it a moment \n\tand then flings it over to the other side of the lab. The \n\tvial shatters and...\n\n\tEXPLODES.\n\n\tA powerful explosion that rocks the room.\n\n\tINT. STORAGE FREEZER\n\n\tLinda feels the rumbling as she places the coil up \n\tagainst the door. The magnet attaches itself. Linda \n\tshakes the coil, trying to get the doorlock to move.\n\n\tOUTSIDE THE DOOR -\n\n\tWe see the lock twitching. Shaking...\n\n\tINSIDE THE DOOR -\n\n\tLinda shivers as she plays with the coil. Her eyes glaze \n\tand she stumbles backward. Her surgical scrubs, once \n\tsoaked with sweat, are now frozen stiff. She composes \n\therself and pushes back toward the door. Her heavy breath \n\thangs as a low cloud of Mist.\n\n\tINT. LABORATORY - DAY\n\n\tSebastian looks over the dozens of other test tubes, \n\tcalculating their combined power in his mind. Then he \n\tcloses the top of the centrifuge. He taps a few commands \n\tinto its timer.\n\n\tINT. SUPPLY ROOM\n\n\tThe door lock twitches again and twists back. The door \n\tswings opens and Linda stumbles out, mashing into a \n\tsupply shelf of oxygen canisters. The canisters tumble \n\tevery which way as Linda tumbles to the ground.\n\n\tShe scrambles to her feet and goes in after Matt, pulling \n\this cold body out of the storage locker.\n\n\tShe pulls stacks of paper down from, the shelves into a \n\ttrashcan, grabs an industrial lighter and ignites the \n\tpaper. She pushes Matt close to the small bonfire. As she \n\tdoes, the oxygen tanks catch her eye.\n\n\tINT. CORRIDOR\n\n\tSebastian exits the lab, locking the door behind him. He \n\theads down the darkened tunnel. Something scampers in \n\tfront of him. Small, not visible. Sebastian sends it \n\treeling with a swift violent kick.\n\n\tINT. CORRIDOR, BY THE ELEVATOR - DAY\n\n\tSebastian, dressed and in full latex, comes striding up \n\tthe tunnel. He taps a code into the elevator vault doors. \n\tThe vault doors open revealing the elevator.\n\n\tThe doors slide open and Sebastian steps inside.\n\n\t\t\t\tELEVATOR\n\t\t\tAuthorization please?\n\n\t\t\t\tSEBASTIAN\n\t\t\tCaine. One One One One One.\n\n\t\t\t\tELEVATOR\n\t\t\tAuthorization valid. Thank you.\n\n\t\t\t\tLINDA\n\t\t\tSebastian!\n\n\tAnd there's Linda. Slicked with dirt and blood. She holds \n\ta oxygen container with a cut line.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tI can't let you leave. Come on out and \n\t\t\tI'll give you one last chance.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou said it yourself, Lin. I shouldn't \n\t\t\thold on to the past.\n\n\tThe door starts to shut.\n\n\t\t\t\tLINDA\n\t\t\tAaaaaaahhhh!\n\n\tShe hits the top of a LIGHTER duct-taped to the hose. A \n\tline of PRESSURIZED FIRE BLOWS into the elevator. \n\tWWHHHOOOOSSHHHH! Sebastian goes up in flame. Linda runs \n\ttoward the elevator. Just as the door's about to close, \n\tshe slides. Her foot jamming into it. \n\tShe lets loose with the flame again. Sebastian, backed \n\tinto the corner, has no where to go. He's yelling in \n\tpain. His latex FACE BUBBLES and burns. The surgical \n\tscrubs SINGE BLACK. With no other escape route, he dives \n\ttoward the door. Linda looks up to see his flaming body \n\tfly over her, back into the corridor. Linda kills the \n\ttank as Sebastian continues to burn. The elevator lights \n\tflickers and the security panel goes up in a shower of \n\tsparks. The elevator dies. Linda pulls herself to her \n\tfeet and turns to see...\n\n\tHalf of Sebastian's head MELTED AWAY, his latex facade a \n\tgruesome smoke-damaged mass. His clothes are half burned \n\trevealing large blistering bubbly welts underneath, like \n\tdeformed blackened bubble wrap.\n\n\tSebastian crawls to his feet, but Linda hits him with \n\tanother shot of flame.\n\n\tSebastian pulls at his clothes as he crawls around the \n\tcorner.\n\n\t\t\t\tSEBASTIAN\n\t\t\tOh God!\n\n\tLinda stalks toward him.\n\n\t\t\t\tLINDA \n\t\t\tYou wanna see God? I'll show you God. \n\n\tLinda turns the corner to see a heap of smoldering latex \n\tand clothing strewn about the corridor floor. Sebastian, \n\tlooking like some ugly creature, pushes down the \n\tcorridor. He throbs with his blackened skin blistering \n\tand cracking up and down his body. Linda lets loose \n\tanother jet of flame. It's smaller than the first and \n\tdoesn't quite hit Sebastian. Linda checks the tanks \n\tpressure gauge. It slowly drops. Linda follows the \n\tblackened horror into the maze of tunnels. But as he \n\tpushes along the corridor, his burns slowly re- absorb \n\tthemselves. Sebastian is no longer visible. A quiet \n\tmoment in the hallway as Linda realizes how vulnerable \n\tshe is. She looks around for him desperately. Nothing. \n\tBut something on the ceiling catches her attention. She \n\tblasts it with the last jet of her dying torch. THE \n\tSPRINKLER SYSTEM, hit by fire, comes to life. Water \n\tsprays down on the tunnel. Sebastian is caught in the \n\tdownpour, his invisible frame outlined by water. It comes \n\ttoward her, the hot skin steaming in the water. He grabs \n\tLinda and slams her against the wall. His watery hand \n\tsmashes her across her face. Linda reels. On the floor, \n\tshe looks to see Sebastian stalking toward her. She \n\tcrawls away, but he grabs her by her hair, pulls her to \n\ther feet and slams her against the wall.\n\n\t\t\t\tSEBASTIAN\n\t\t\tI'm gonna find everyone in your family \n\t\t\tand kill them-. Your sister... she \n\t\t\tnever liked me. I think I'll go after \n\t\t\ther and her little boy first. \n\n\tSebastian smashes her head against a metal post. Her head \n\tcuts open, blood dripping down.\n\n\t\t\t\tSEBASTIAN (cont'd)\n\t\t\tI just wanted you to know that before \n\t\t\tyou die.\n\n\tLinda collapses to the floor. Sebastian's foot presses \n\tagainst her neck, squeezing it. Linda gags for breath. \n\tBut through the shoot of water that is Sebastian, we see \n\tsomething also... a watery smudge.\n\n\tBAM!\n\n\tMATT - smashes Sebastian with the metal bar. Sebastian \n\tslams against the corridor wall and sinks down.\n\n\tMatt staggers. It's taken all his strength to got there. \n\tHe drops the crowbar and seeks the wall for support, he \n\tsinks to his knees by Linda.\n\n\t\t\t\tMATT\n\t\t\tThought I'd... thought I'd save you \n\t\t\tfor a change.\n\n\tHe gives her his hand and pulls her up into his arms.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tLet's got out of here.\n\n\tJust as the two turn, Sebastian rises with the crowbar. \n\tHe swings it with a yell. Matt pushes Linda out of the \n\tway, his arm glancing the blow into a conduit. The \n\tconduit splits open and severs ELECTRICAL wiring. The \n\tVOLTAGE shoots up the crowbar and into Sebastian. As the \n\tcurrent pulses through his body, Sebastian vibrates. His \n\tblood vessels yank back to visibility, followed by his \n\tskeletal structure and major organs. Sebastian is slowly \n\telectrified. Smoke pours off him and he becomes more and \n\tmore visible. Finally he collapses. His body throbbing in \n\tand out of visibility. Matt and Linda stumble away.\n\n\tINT. CORRIDOR - DAY\n\n\tJust outside the lab... Linda tries to pry open the \n\tsealed doors with the crowbar. But she can't.\n\n\tThrough the doors porthole she sees a collection of \n\tchemicals and the fire raging from the earlier explosion.\n\n\t\t\t\tLINDA\n\t\t\tNitro...\n\n\tMatt peaks inside.\n\n\t\t\t\tMATT\n\t\t\tHe said it himself... All they'll find \n\t\t\tis a pile of charred corpses.\n\n\tShe sees the centrifuge... The timed counter on its face \n\tcounts down from a minute. Fifty nine. Fifty eight. Fifty \n\tseven...\n\n\t\t\t\tLINDA\n\t\t\tHe's rigged the centrifuge.\n\n\t\t\t\tMATT\n\t\t\tIn an enclosed space, he'll wipe out \n\t\t\tthe whole lab.\n\n\tINT. TUNNEL\n\n\tLinda and Matt move as fast as they can. They reach the \n\tburned out elevator. What the hell are they gonna do? We \n\tknow the damn thing doesn't work. She swings her crowbar \n\tat the ceiling. The maintenance hatch comes down.\n\n\t\t\t\tLINDA\n\t\t\tGrab on.\n\n\tLinda hooks the crowbar onto the hatch lip and pulls \n\therself up. She reaches back down for Matt.\n\n\t\t\t\tMATT\n\t\t\tForget about me. You go.\n\n\t\t\t\tLINDA\n\t\t\tFuck you. Give me your hands.\n\n\tLinda grabs Matt's hands and pulls for all she's worth. \n\tShe struggles, but they both manage to got him through \n\tthe hatch.\n\n\tINT. LABORATORY - DAY\n\n\tThree... two... one. The centrifuge springs to life.\n\n\tThe centrifuge spins the two dozen vials slowly at first.\n\n\tINT. VENT\n\n\tLinda and Matt are on top of the elevator.\n\n\tLinda's hands search the wall. Bar fingers run across the \n\tsmooth metal surface.\n\n\tFrom the little light below she can see a maintenance \n\tladder that spans the entire height of the vertical tube. \n\tThey look up and see it disappear into the darkness.\n\n\t\t\t\tLINDA\n\t\t\tClimb!\n\n\t\t\t\tMATT\n\t\t\tBut...\n\n\t\t\t\tLINDA\n\t\t\tClimb!\n\n\tMatt starts up, rung after rung. Linda climbs right \n\tbehind him.\n\n\tINT. LABORATORY\n\n\tThe centrifuge spins faster and faster. The vials are \n\tstarting to rattle.\n\n\tINT. ELEVATOR SHAFT\n\n\tLinda and Matt pull themselves up the ladder as quick as \n\tthey can.\n\n\t\t\t\tMATT\n\t\t\tI can't. I'm going to pass out.\n\n\t\t\t\tLINDA\n\t\t\tKeep moving.\n\n\tHe does, through sheer force of will. Blood from his \n\twound drips down on Linda's face. No telling how much \n\tfurther they have to go in this darkness. Light leaks in \n\tfrom the maintenance hatch below.\n\n\tINT. LABORATORY\n\n\tThe centrifuge's whine has reached a fevered pitch. The \n\tvials shake violently.\n\n\tThen... one of the vials shatters.\n\n\tA FLASH OF LIGHT. A HUGE EXPLOSION rips through the \n\tlaboratory.\n\n\tINT. TUNNEL\n\n\tThe EXPLOSION rips through the lab doors. A MASSIVE \n\tFIREBALL rolls down the tunnel swallowing everything in \n\tits path.\n\n\tOne of the phase shifted animals gets caught in the \n\tflames. We see its shape briefly before it disappears In \n\ta wall of fire.\n\n\tINT. ELEVATOR SHAFT\n\n\tThe ladder begins to shake. The entire shaft begins to \n\trumble. Linda pushes Matt up as they scramble toward \n\tsafety.\n\n\tINT. EXHAUST VENT\n\n\tThe FIREBALL blows into the vent. Starts rolling down it \n\talso.\n\n\tINT. TUNNELS\n\n\tMore explosions.\n\n\tCHAIN REACTIONS. BOOM! BOOM! BOOM!\n\n\tTHE EXPLOSIONS rolls toward the OPEN ELEVATOR. Slamming \n\tinto it... The elevator flies upward.\n\n\tINT. ELEVATOR SHAFT\n\n\tThe rumbling worsens. The two desperately cling to the \n\tladder. They looks down to see...\n\n\tThe elevator...\n\n\tSURROUNDED BY FLAMES flying up toward them, lifted by the \n\texplosion's SHOCK WAVES.\n\n\t\t\t\tLINDA\n\t\t\tOh God!\n\n\t\t\t\tMATT\n\t\t\tDon't look.\n\n\tThe carriage accelerates toward them, faster and faster. \n\tIts loose cables whip around the shaft, slapping the \n\twalls around the pair. Its gonna hit them! Linda pulls \n\therself close to the ladder and closes her eyes. She's \n\tpressed against Matt. The elevator... 50 feet... 40 ... \n\t30 ... W0000000SH! It flames RIGHT BY THEM. \n\tWhen Linda opens her eyes, the elevator is HUNDREDS OF \n\tFEET ABOVE THEM and a wall of fire is below them, closing \n\tin.\n\n\t\t\t\tLINDA\n\t\t\tMove!\n\n\tPanicked, Linda pushes Matt up the ladder as she stares \n\tdown at the rising fire wall. But the fire dissipates \n\tbefore it hits them, though a stray tongue of flames \n\treaches up to lick the soles of her feet.\n\n\tThey hear a terrifying moan and looks up to see the \n\televator peaking far above her. It slows to a stop and \n\tBEGINS TO FALL.\n\n\t\t\t\tMATT\n\t\t\tIt's coming down!\n\n\tFASTER AND FASTER. Coming back toward them in complete \n\tfree- fall. It's emergency brakes clamp down, slowing it. \n\tMetal against metal. Sparks flying. One of the brakes \n\tshears. Then another. The elevator unseats from it's \n\ttracks, SLAMMING against the walls as it TUMBLES. Linda \n\tsees that the elevator is out of control, and watches as \n\tit ping-pongs toward them... smashing into the access \n\tladder, smashing into the wall. The elevator slows, but \n\tcontinues slamming side-to-side. Linda cringes as the \n\televator crashes into the wall above them. But it jams \n\tthere, stopping. They pull their heads away from wall and \n\tlook up. The elevator just hangs there, suspended. \n\tThere's a small crawlspace between the elevator and the \n\tladder.\n\n\t\t\t\tLINDA\n\t\t\tC'mon. Before it slips.\n\n\tThey begins to climb up again. Matt shimmies through the \n\ttight hollow, and squeezes out the other side, followed \n\tby Linda. She breathes a sigh of relief and just hangs \n\tthere a moment when ... Ah! Something grabs her. A singed \n\tthrobbing hand emerges from the darkness, gripping at her \n\tleg.\n\n\t\t\t\tLINDA (cont'd)\n\t\t\tIt's him.\n\n\tShe kicks at it and sees a dark dirty face - a swirl of \n\tdirt, grime and smoke with hollow eyes - rise up the \n\tladder.\n\n\t\t\t\tMATT\n\t\t\tSebastian, you fuck.\n\n\t\t\t\tLINDA\n\t\t\tGet off me.\n\n\tSebastian pulls himself up Linda's body. Translucent \n\tdirty hands paving at the fabric of her clothes. Linda \n\ttries to climb with this thing on her. But Sebastian \n\tgrabs her around the neck. She begins choking for breath. \n\tLinda fights to keep her grip on the ladder... She looks \n\tdown at the ten foot drop to the elevator and then... She \n\tlets go!\n\n\t\t\t\tMATT\n\t\t\tNo!\n\n\tShe and Sebastian plummet through the smoky haze and slam \n\tagainst the top of the elevator. Linda seems to hover a \n\tfew above the elevator, Sebastian's shadowy outline below \n\ther. Matt painfully lowers himself down the ladder. But \n\tmetal groans and the elevator drops another five feet. \n\tLinda struggles to her feet. Sebastian rises. A menacing \n\tdark figure stalking toward her. Linda pushes back from \n\thim. Sebastian grabs her by the hair and pulls bar over \n\tto the ladder. The elevator strains and groans.\n\n\t\t\t\tLINDA\n\t\t\tLet go of me.\n\n\tSebastian presses her up against the ladder. Presses into \n\ther from behind. He has her trapped. His dirty hand \n\treaches out and strokes her hair.\n\n\t\t\t\tSEBASTIAN\n\t\t\tRemember the day we met? You were \n\t\t\twearing a red dress and you were so \n\t\t\tpretty. Now... Now look at you.\n\n\t\t\t\tMATT\n\t\t\tGet off of her!\n\n\tSebastian pulls her hair back and kisses her neck with \n\this filthy, dirt-smeared mouth and half-burned away face.\n\n\t\t\t\tMATT (cont'd)\n\t\t\tSebastian, stop it.\n\n\tLinda and Sebastian struggle. Matt reaches down to try \n\tand grab her, help her.\n\n\t\t\t\tSEBASTIAN\n\t\t\tYou fucked it all up.\n\n\tLinda looks at her feet. The last elevator emergency \n\tbrake grips its cable. She grits her tooth and grabs hold \n\tof the ladder.\n\n\t\t\t\tLINDA\n\t\t\tGo to hell. \n\n\tLinda stamps on the brake release. The ELEVATOR TUMBLES \n\t... along with Sebastian. It slams into the fiery abyss a \n\thundred yards below. Linda hangs, one hand holding onto \n\tthe ladder, the other holding onto Matt. Matt pulls her \n\tback onto the ladder, using all his remaining strength.\n\n\tEXT. WAREHOUSE - DAY\n\n\tLinda and Matt stumble out into the blazing sunshine. \n\tEmergency crews close from all directions, sirens \n\troaring. A trail of smoke drifts higher and higher into \n\tthe sky.\n\n\tAn ambulance pulls up next to them and the paramedics hop \n\tout, immediately putting a blanket around her and \n\ttreating Matt's wounds.\n\n\t\t\t\tMARINE GUARD\n\t\t\tWhat happened?\n\n\t\t\t\tLINDA\n\t\t\tWe lived.\n\n\tLinda looks over her shoulder at the traces of the ruin \n\tand she sees a shimmer of heat rising from the ground... \n\talmost as if something was there.\n\n\t\t\t\t\t\t\t\t\t FADE \nOUT:\n\n\n\n\n\n\n\nHollow Man\nWriters :   Gary Scott Thompson  Andrew W. Marlowe\nGenres :   Horror  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:27:02.277721"}